{
  "id": 19963,
  "origin_website": "Wiley",
  "title": "Using CRISPR/ttLbCas12a for in planta Gene Targeting in A. thaliana",
  "procedures": [
    "In this protocol, we describe the procedure to create ttLbCas12a constructs for ipGT in detail (see Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20117#cppb20117-fig-0002]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/612f1bfd-cdf1-45da-8908-25d5cd48e62a/cppb20117-fig-0002-m.jpg</p>\nFigure 2\nOverview of the screening strategy of ipGT to identify positive GT plants. The constructs are transferred into A. thaliana via floral dip method. The plants are cultivated until maturity to harvest the T1 seeds. The T1 seeds are sown out to select for primary transformants. The primary transformants are transferred to soil to grow until maturity to harvest T2 seeds. Approximately 100 T2 seeds are sown out on GM-medium for pre-screening. The pre-screening determines the positive pools. Each plant of each positive pool is then analyzed separately for GT events. The result is confirmed via sequencing.\nThis protocol includes two steps: (1) Preparation and design; (2) Generation of the T-DNA.\nMaterials\nAatII for the integration of the HR donor sequence\nPacI for the integration of the HR donor sequence\nPlasmids (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20117#cppb20117-rec-0001])\nddH2O\nBbsI for the integration of the annealed oligonucleotides\nLigase for any conventional cloning step\nEscherichia coli, any standard cloning strain (e.g., NEB5α) for all cloning steps except for propagation of the destination vector before gateway cloning, where a ccdB-resistant strain has to be used\nAmpicillin-containing LB plates for colony selection\nPrimers for PCR screening (see Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20117#cppb20117-tbl-0001])\nLB medium for E. coli\nPlasmid preparation kit\nGateway LR Clonase II for the transfer of the programmed guide to the binary vector\nTE buffer for Gateway reactions\nProteinase K to stop Gateway reactions\nSpectinomycin-, rifampicin- and gentamicin-containing YEB plates for colony selection\nAgrobacterium tumefaciens, any standard transformation strain (e.g., GV3101)\nDNA polymerase for E. coli and A. tumefaciens colony PCRs\ndNTPs for E. coli and A. tumefaciens colony PCRs\nYEB medium for A. tumefaciens\nArabidopsis thaliana plants, wild-type (ecotype Columbia-0) or mutant\nTable 1.\n                Used Oligonucleotides\ntable:",
    "﻿Oligonucleotides,Sequence (5′–3′)\nM13-fw,TGTAAAACGACGGCCAGT\nSS42,TCCCAGGATTAGAATGATTAGG\nSS102,CACCATGTTATCACATCAATCC\nPreparation and design\n1. Identification of the target site: Search for a potential target site with a protospacer adjacent motif (PAM; 5'-TTTV-guide-3') in the selected target locus in close proximity to the desired modification. Avoid sequences containing a set of five or more Ts as this is the termination sequence for RNA polymerase III.\n2. Design of the HR donor: use 600 to 800 bp homologies on both flanks of the cleavage site. For excision of the HR donor, add the gRNA target sequence including the PAM to both ends of the donor sequence. To avoid Cas12a activity on the donor site, include silent mutations either in the PAM (preferred) or in the spacer sequence (nucleotides 4-7 proximal to the PAM are most vulnerable to mismatches). Additionally, add restriction sites (AatII and PacI) on the end of the HR donor, as they are required for inserting the HR donor sequence into your T-DNA (see Critical Parameters).\n3. Generate your HR donor sequence: methods to generate your HR donor are overlap extension PCRs, Gibson assembly, site-directed mutagenesis PCRs, or gene synthesis.\nGeneration of the T-DNA: creating the entry vector\n4. Order oligonucleotides for your target sequence. For ttLbCas12a the sequence should be 23-25 nt downstream of the PAM. Add “AGAT” at the 5′ end on the forward oligonucleotide and “GGCC” at the 5′ end on the reverse-complement oligonucleotide to ensure spacer integration into the gRNA expression cassette.\n5. Dilute the oligonucleotides in ddH2O to a final concentration of 2 pmol/µl for each oligonucleotide in a total volume of 50 µl. Mix and incubate for 5 min at 95°C using a thermal cycler. Incubate another 20 min at room temperature for annealing of the oligonucleotides.",
    "6. Digest the entry vector with BbsI to prepare it for the integration of the annealed oligonucleotides. Purify the digested vector (e.g., by using a common DNA purification Kit) and dilute to a final concentration of 5 ng/µl.\n7. Set up a ligation reaction (see a-e) and incubate as recommended by the manufacturer information.\n         \n2 µl digested entry vector\n3 µl annealed oligonucleotides\n1 µl T4 ligase buffer\n1 µl T4 ligase\n3 µl ddH2O\n8. Transform the ligation product into E. coli for amplification.\n9. Select for colonies on ampicillin-containing LB plates. Screen colonies by colony PCR using M13-fw and the reverse-complement oligonucleotide as primers (see Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20117#cppb20117-tbl-0001]).\n10. Cultivate transformed colonies in liquid LB-amp medium.\n11. Purify the plasmids (e.g., by using a common plasmid preparation kit) and validate them by sequencing with primer SS42 (see Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20117#cppb20117-tbl-0001]).\nGeneration of the T-DNA: creating the expression vector\n12. Set up a reaction (see a-d) to transfer the validated gRNA expression cassette to pDe-EC-ttLbCas12 and pDe-ttLbCas12a by Gateway cloning in a total volume of 10 µl and incubate for 2 to 3 hr at room temperature. pDe-EC-ttLbCas12a is for the GT construct. pDe-ttLbCas12a is for evaluating the cleavage activity within the chosen target.\n         \n200 ng entry vector\n150 ng destination vector\n1 µl LR Clonase II\nFill up to 10 µl with TE buffer\n13. Stop the Gateway reaction after incubation by adding 1 µl proteinase K and incubate 10 min at 37°C using a heating block.\n14. Transform the Gateway reaction into E. coli for amplification.\n15. Select for colonies on spectinomycin-containing LB plates. Screen for correct colonies by colony PCR using SS42/SS102 as primers (see Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20117#cppb20117-tbl-0001]).\n16. Cultivate transformed colonies in liquid LB-spec medium.\n17. Purify the plasmids and validate them by a restriction digestion.",
    "18. Insert your HR donor sequence into the pDe-EC-ttLbCas12a vector via a restriction digestion with AatII and PacI.\n19. Screen for correct clones by a suitable colony PCR and restriction digestion.\n20. Validate the correctness of your final construct by full sequencing.\n21. Transform your correct construct into A. tumefaciens (Wirth, Friesenegger, & Fiedler, 1989[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20117#cppb20117-bib-0014]).\n22. Select for colonies on spectinomycin-, rifampicin- and gentamicin-containing YEB plates. Validate the positive colonies by colony PCR using SS42/SS102.\n23. Cultivate one correct colony in liquid YEB-spec-rif-gent medium.\n24. Transform the final construct in A. thaliana via the floral dip method (Clough & Bent, 1998[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20117#cppb20117-bib-0001]).\n25. Harvest the T1 seeds after maturation.",
    "In this protocol, we describe the procedure to obtain heritable GT plants following A. thaliana transformation (see Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20117#cppb20117-fig-0002]).\nThis protocol includes two steps: (1) Generating primary transformants; (2) Obtaining heritable GT plants.\nMaterials\nT1 seeds (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20117#cppb20117-prot-0001])\nDNA polymerase for screening of GT plants\ndNTPs for screening of GT plants\nGentamicin-containing GM plates for selecting transgenic plants\nAdditional reagents and equipment for extracting DNA via the rapid DNA extraction method (see Edwards, Johnstone, & Thompson, 1991[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20117#cppb20117-bib-0002])\nGenerating primary transformants\n1. Sow seeds of the transformation on GM medium containing gentamicin to select for transgenic plants harboring the T-DNA.\n2. Let the seeds maturate for 2 weeks at 22°C in a growth chamber.\n3. For GT: Pick at least 40 T1 plants containing pDe-EC-ttLbCas12a and transfer them to soil until maturity.\n4. For cleavage activity: Extract DNA from 20 primary transformants containing the pDe-ttLbCas12a construct via the rapid DNA extraction method (see Edwards et al., 1991[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20117#cppb20117-bib-0002]). Analyze the mutagenesis efficiency by e.g., TIDE (see Critical Parameters).\n5. Extract DNA from one leaf of each plant and set up a suitable PCR to verify the presence of your construct.\nObtaining heritable GT plants\n6. Harvest the seeds of each T1 plant separately.\n7. Sow about 100 seeds per line on GM medium.\n8. Let the seeds maturate for 2 weeks at 22°C.\n9. Extract DNA from one leaf of 100 plants per line as a pool.\n10. Screen for positive GT events using a suitable PCR (see Critical Parameters).\n11. Extract DNA from each plant of the positive identified T1 pools separately after another week of growth.\n12. Analyze the T2 plants separately for heritable GT via PCR and confirm it by sequencing (see Critical Parameters).\n13. Transfer positive T2 plants to soil and cultivate them to maturity.",
    "14. Harvest seeds from each positive T2 line separately.\n15. Sow T3 seeds on GM medium.\n16. Screen for loss of the T-DNA via PCR.\n17. Confirm successful GT events to ensure stable inheritance."
  ],
  "subjectAreas": [
    "Plant Biology"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}