{
  "id": 15554,
  "origin_website": "Jove",
  "title": "Eye-tracking Technology and Data-mining Techniques used for a Behavioral Analysis of Adults engaged in Learning Processes",
  "procedures": [
    "This protocol was performed in compliance with the procedural regulations of the Bioethical Committee of the University of Burgos (Spain) nº Nº IR27/2019. Prior to their participation, the participants had been made fully aware of the research objectives and had all provided their informed consent. They received no financial compensation for their participation.\n1. Participant recruitment\nRecruit participants from among a group of adults within two environments (students and teachers), with an age rank of 18 to 69 year-old in the environment of Higher Education (formal and non-formal education).\nInclude participants with normal or corrected-to-normal vision and hearing.\nExclude participants with neurological, psychiatric, and sleep disorders, disabilities related to educational special needs, perceptual difficulties (impaired sight and hearing), and cognitive disabilities.\n\t​NOTE: In this study we worked with a sample of 40 participants, 6 students from the University of Experience (one participant was excluded in the category of students from the university of experience because of visual difficulties), 25 university professors in the disciplines of health sciences, engineering, and history and heritage, and 9 undergraduate and master's students following courses in health sciences, engineering, and history and heritage. The participants had no cognitive, hearing, nor visual problems, and they all had normal or corrected-to-normal vision (Table 2). That is why, one of the participants was eliminated before starting the experiment because nystagmus had been detected on him and therefore the task was applied to a sample of 39 participants. The participants received no financial nor professional compensation; that is why participants' motivation was high as it was only based on their interest to know how this eye-tracking method works during a learning process related with cultural heritage, specifically the origin of European monasteries.\nTable 2. Characteristics of the sample. Please click here to download this Table.[href=https://www.jove.com/files/ftp_upload/62103/Copia de JoVE_Table_2.xls]",
    "2. Experimental Procedure\nSession 1: Collection of informed consent, personal data, and background knowledge\n\t\nObtain informed consent. Before the test, inform each participant of the aims of the study and the collection, treatment, and storage of their data. The agreement of each participant is given by signing the informed consent form.\n\t\tNOTE: Participation in this study was voluntary and there was no financial reward. This aspect ensured that the completion of the tasks had no economic motivation. Before starting the task, the interviewer, an expert in the field, fills up a questionnaire with questions on age, gender, occupation, and prior knowledge of the subject matter, in this case, the origin and historical development of monasteries in Europe (see Table 3). This study is part of a European Project (2019-1-ES01-KA204-095615-Coordinator 6) on adult learning about the Cultural Heritage of Humanity throughout life; that is why this type of task was chosen. Each investigator will choose the topic depending on his or her work field.\nTable 3. Interview questionnaire. Please click here to download this Table.[href=https://www.jove.com/files/ftp_upload/62103/Copia de JoVE_Table_3.xls]\nSession 2: Calibration\n\t\nInform the participant about how eye-tracking technology works and how the information will be collected and recorded and calibrate: \"We will use eye-tracking technology to observe the completion of the learning task on the origin and the development of European monasteries. Eye tracking is a technology that allows you to follow your gaze while you perform the activity and it has no side effects, nor it is invasive, since in this study only eye tracking is recorded\".",
    "Explain to the participant that a valid test requires proper positioning. Have the participant must sit at a certain distance [45 to 60 cm] from the monitor. The distance will depend on the height of the participant, the lower the height, the shorter the distance.\nInform the participant that a series of points will appear on the cardinal points of the screen and that as each point appears the participant must observe it with the eyes. The participant can move from one point to another by using the \"enter\" cursor. The calibration phase has a duration of 10-15 minutes.\n\t\tNOTE: An Eye-tracking iViewer XTM, SMI Experimenter Center 3.0, and SMI Be Gaze and a monitor with a resolution of 1680×1050 were used for the task-resolution exercise. This equipment registers ocular movements, their coordinates, and pupillary diameters of each eye. In this study, 60 Hz were applied, scan-path metrics and dynamic scan-path metrics were used, and AOI statistics were determined.\nCheck the calibration setting. The professional supervising the test analyzes the calibration setting on the control screen.\n\t\t\nPerform calibration through the calibrating system that is included in the Eye-tracking iViewer XTM. Before starting this task, each participant realizes a visual follow-up of four points on a screen to the four corners (up-right, up-left, down-right, down-left). Afterward, the software has an execution verification process of the right position of these stimuli and gives information on the parameter adjustment in degrees. If this adjustment is situated between 0.6º ± 1 in the right and left eye, it is considered that the calibration is correct, and the task execution starts. An example of the process can be verified in Figure 1.",
    "​NOTE: Correct task completion is considered when the degrees in the right and left eye are set at 0.6º ± 1 standard deviation. In this study, two calibrations were detected among the group of university professors that exceeded the adjustment criterion of 0.6º ± 1 and two participants were therefore removed. The 25 participants in the first sample were therefore reduced to 23 participants.\nimgsrc://cloudfront.jove.com/files/ftp_upload/62103/62103fig01.jpg\nFigure 1. Process of eye-tracking calibration Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/62103/62103fig01large.jpg]\nSession 3: Performing the learning task\n\t\nExplain the contents of the task to the participant. An expert in instructional psychology explains to the participant what the task will consist of and how to perform it: \"The video is 1:14 seconds long and consists of 5 voice-over images. At the end, the participant is invited to complete a small crossword puzzle to check that the information presented in the video has been understood\".\nWatch the video clip. The video used in the task can be viewed at the following link: https://youtu.be/HlGGgrYDTFs.[href=https://youtu.be/HlGGgrYDTFs]\n\t\tNOTE: The task consists in watching a video that offers information on the origins of European monasteries. The information has been elaborated by a specialist, an Art History teacher. The information is organized in two channels, one visual which includes images and written information presented as outlines and another audio one because a SRL specialist teacher is speaking throughout the video insisting on the most significant contents using verbal emphasis.\nPerforming the crossword puzzle on a Moodle-based virtual platform. Clicking on the crossword icon takes the participant to a virtual platform where the crossword may be completed, to check whether the knowledge has been acquired. The crossword puzzle is presented in Figure 2.\nimgsrc://cloudfront.jove.com/files/ftp_upload/62103/62103fig02.jpg",
    "Figure 2. Crossword puzzle to check the acquired knowledge. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/62103/62103fig02large.jpg]\nSession 4: Data analysis\n\t\nChoose the Areas Of Interest (AOI). AOIs are defined in the video and are divided into AOIs that contain relevant information versus AOIs that include non-relevant information.\n\t\tNOTE: The AOI assignation is realized by the experimenter who decides which are the relevant or irrelevant AOIs in relation to the presented information.\nExtract the database relating to the parameters for AOI Fixations (\"Event Start Trial Time\", \"Event End Trial Time\" and \"Event Duration\"; \"Fixation Position X\", \"Fixation Position Y\", \"Fixation Average Pupil Size\", \"Fixation Average Pupil Size Y px\", \"Fixation Average Pupil Diameter\", \"Fixation Dispersion X\" and \"Fixation Dispersion Y\").\nImport the database into a statistical processing software package and select the option analyze and then classify, followed by the option k-means cluster. Then select cross-table in the statistical software package, for example SPSS, followed by the 'ANOVA' option, to analyze the differences between the participants (type of adult groups and degree of prior knowledge) with regard to their AOI Fixation parameters31.",
    "NOTE: Clustering or cluster analysis is an 'unsupervised' machine-learning technique, and, within k-means, it is a grouping method, the aim of which is to partition a set of n observations into k groups, in which each observation belongs to the group with the closest mean value. In this experiment, k-means clustering was used to check the clusters of participants in the learning task. This correspondence is important, because it offers the teacher or therapist information on the homogeneous functional development of users that goes beyond the diagnosis, providing information to propose similar intervention programs in some areas of functional development. This option is expected to facilitate full use of the educational or therapeutic service and its personal and material resources.\nPerform a visualization analysis of the data (descriptive and cluster analysis) that are processed, using a visualization software such as Orange32.\nExtract the data on the parameters of Detailed Statistics: Dwell Time, Glance Duration, Diversion Duration, Glance Count, Fixation Count, Average Fixation, and Duration then import that database into a statistical software package. Select the option 'ANOVA' in the statistical package and then conduct a visualization analysis of the data that were processed (means). Use the spreadsheet to generate a spider chart and specific bar graphs for the groups of participants.\nSession 5: Personalized learning proposals\n\t\nPerform an intervention program to improve learning outcomes among the participants detected in the cluster analysis, due to their lower scores.\n\t\tNOTE: A summary of the phases followed in the experimental Procedure is shown in Figure 3.\nimgsrc://cloudfront.jove.com/files/ftp_upload/62103/62103fig03.jpg\nFigure 3. Phases of the experimental procedure. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/62103/62103fig03large.jpg]Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}