{
  "id": 5470,
  "origin_website": "Bio",
  "title": "Isolation of the Dot/Icm Type IV Secretion System Core Complex from <em>Legionella pneumophila</em> for Negative Stain Electron Microscopy Studies",
  "procedures": [
    "Grow L. pneumophila Lp01 strain on a charcoal-yeast extract (CYE) plate (Recipe No. 1) from a glycerol frozen stock for 3 days at 37 °C.Use a sterile swab to streak a L. pneumophila colony on the entire surface of CYE plates and cultivate for 2 days at 37 °C. Note: Two plates covered with a bacterial lawn are needed to obtain sufficient starting material to prepare 1 L culture.Take the whole bacteria using sterile cell scrapers and suspend it with ~5 ml ACES-buffered yeast extract (AYE) medium (Recipe No. 2) in a sterile tube. Measure OD600. Add the bacterial solution into 1 L AYE medium in a 2 L flask to make the suspension of OD600 0.2.Grow the bacteria for 12 h at 37 °C with rotary shaking (250 rpm).Chill the flask in icy water. Measure OD600. (It should be 2.0-3.0, indicating the late log phase of growth). Transfer the culture solution to chilled centrifuge tubes (2-3 tubes of 500 ml capacity). Harvest the bacteria by centrifugation at 12,000 x g (8,000 rpm) for 15 min at 4 °C (Refrigerated centrifuge: Kubota, model: 7780 or equivalent models; Rotor: Kubota, model: AG-5006).Resuspend the bacterial pellet with 140 ml of cold sucrose solution (Recipe No. 4) containing 1x cOmpleteTM protease inhibitor cocktail. Note: Thoroughly suspending bacterial pellets enhances the efficiency of the detergent lysis in step 11. Transfer the suspension to a 200 ml beaker with a magnetic stir bar on ice.Set the beaker on a magnetic stirrer at room temperature, and stir mildly until uniform suspension is achieved.Add PMSF (final 1 mM, Recipe No. 5), EDTA (final 1 mM, Recipe No. 6) and lysozyme (final 0.1 mg/ml, Recipe No. 7) in this order.Note: This is the process of spheroplast formation. Prepare a 20 mg/ml 200x stock solution. Add 0.",
    "7 ml of this stock solution to the 140 ml sucrose solution, yielding a final lysozyme concentration of approximately 0.1 mg/ml in the bacterial resuspension. Keep stirring for another 30 min at room temperature.Add slowly (drop by drop) 7 ml of 20% (w/v) Triton X-100 stock solution (final 1% w/v, Recipe No. 8) with stirring.Note: This is the most important step for detergent lysis of bacterial membranes. Carefully monitor the change of color and viscosity.Keep stirring until the solution becomes very clear (approximately for 30 min). Add 420 μl of 1 M MgSO4 stock solution (final 3 mM, Recipe No. 9) and 70 μl of 10 mg/ml DNase I stock solution (final 5 μg/ml, Recipe No. 10) in this order. Note: This step is required to digest DNA.Stir for 10 min.Add EDTA (final 10 mM).Monitoring pH using a pH meter, adjust pH to 10.0 by adding 1 N NaOH (Recipe No. 12).Note: During this step, large membrane vesicles and fragments that remain are disrupted. The core complex is stable at this high pH, while loosely associated contaminant proteins can be detached from the core complex. For the purpose of analyzing the loosely associated components of the T4SS, pH value can be modified to maintain these proteins in the complex.Move the beaker on ice. Note: Procedure below should be done at 4 °C. Transfer the lysate to chilled 50 ml centrifuge tubes (divide into 3 tubes).Centrifuge the lysate at 12,000 x g for 20 min at 4 °C to remove non-lysed materials. (Refrigerated centrifuge: Kubota, model: 7780 or equivalent models; Rotor: Kubota, model: AG-6512C).Recover supernatant and transfer to ultracentrifuge tubes (Beckman Coulter).Apply ultracentrifugation at 100,000 x g for 30 min at 4 °C to precipitate protein complexes.",
    "(Ultracentrifuge: Beckman Coulter, model: Optima L-100 XP or equivalent models; Rotor: Beckman Coulter, model: Type 70Ti)Discard supernatant. Soak the pellet with 0.5 ml of cold TET solution (Recipe No. 13) including 1 mM PMSF per tube. To dissolve completely, leave the pellet in TET overnight at 4 °C.Merge the completely dissolved suspensions and transfer them in a new conical or centrifuge tube (total ~5 ml). Use extra 2-3 ml of cold TET solution to completely recover the dissolved proteins from the tubes and merge them into the new tubes. Centrifuge the suspension at 14,000 x g for 15 min at 4 °C to remove precipitate. (Refrigerated centrifuge: Kubota, model: 7780 or equivalent models; Rotor: Kubota, model: AG-6512C).Submit the supernatant to a second round of ultracentrifugation at 100,000 x g for 30 min at 4 °C. (Ultracentrifuge: Beckman Coulter, model: Optima L-100 XP or equivalent models; Rotor: Beckman Coulter, model: Type 70Ti)Resuspend the pellet in ~300 μl of cold TET. The sample is ready for biochemical and electron microscopic analyses (Figures 1A and 1B). (Optional) Further separation by Superose 6 10/300 column chromatography equilibrated with TET plus 50 mM NaCl can be used to remove large aggregates either made of T4SS or contaminant proteins. Collect the fractions and identify the fractions containing the core complex by gel electrophoresis and transmission electron microscopy (as shown in steps 28 and 29) (Figures 1C and 1D).Note: As TET solution contains Triton X-100 that disturbs UV monitoring, the UV peaks do not always accord with the presence of the protein complexes. Alternative approaches like sucrose density gradient ultracentrifugation can be applicable for further purification. For biochemical analysis, apply samples on 12.5% SDS-polyacrylamide gel (PAGE) and stain with ready-made Coomassie Brilliant Blue stain solution, CBB stain One (Nacarai).",
    "For transmission electron microscopy analysis, apply samples on glow-discharged carbon grids and negatively stained with 2% (w/v) PTA pH 7.0 (Recipe No. 14) or 2% (w/v) uranyl acetate (Recipe No. 15). Take micrographs at an accelerating voltage of 80 kV."
  ],
  "subjectAreas": [
    "Microbiology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}