{
  "id": 6406,
  "origin_website": "Bio",
  "title": "Assessing Olfaction Using Ultrasonic Vocalization Recordings in Mouse Pups with a Sono-olfactometer",
  "procedures": [
    "Notes: Gloves should be worn for all steps that involve handling mice, odorants, the sono-olfactometer and its chambers.  Prior to bringing the pups into the sono-olfactometer, prepare the odorants, the chambers (ensure cleanliness, connectivity of wires and odor dispensers, the bat detector and the computer software. Prepare a sheet with all the animal information including animal numbers, feet marking, genotype, treatment and/or inoculum, chamber number, weight, etc. Five minutes prior to testing, pups are moved from the homeroom and eventually from colony isolator to the class II safety cabinets in the testing room, in their home cages with their dams and litter. Two pups were placed into the two detachable chambers of the sono-olfactometer under the class II safety cabinets (one pup per chamber); the chambers with the pups were then put into the laboratory-made sono-olfactometer placed in the BSL-2 room, at proximity to the class II safety cabinets, for USV-recordings. Each test session in the sono-olfactometer lasts 5 min. Pups can be tested two by two, on Days 6 and 8 after birth. There is a maximum of one session per day, with each session comprised of exposure to only one scent. Pups should be weighed after the test every day (balance placed in the safety cabinet) prior to be placed back to the nest. They should be separated from their mother less than 30 min in total (time including transfer to the chamber, testing, weighing and transfer to the home cage). Recording of USV (Figure 5)imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190217/20190217175035_7460.jpgFigure 5. Recordings and quantification of the emission of ultrasonic vocalizations. A and B. The recording of ultrasonic calls began 30 s after placing the pups in the test chamber of the sono-olfactometer.",
    "Ultrasonic vocalizations were detected using an ultrasonic microphone connected to a bat detector that converts ultrasonic sounds into the audible frequency range (from 20 to 20,000 Hz). C. Experimental paradigm. Ultrasonic emissions were recorded during the first period without odorant (1 min), followed by a period of odorant exposure (1 min) and finally the last period of exhaust air (1 min and 30 s. This time duration allows the complete elimination of the exhaust air containing odorants). D. Typical wave traces of spontaneous call series from a pre-weaning 6-day-old pup (for more details, see Lazarini et al., 2018). The majority of vocalizations (vocal units of duration < 100 ms on spectrogram) are produced in series with call intervals > 130 ms.Place the two chambers containing the pups onto the table of the sono-olfactometer. Connect the sono-olfactometer (SO) and the computer. Switch on the bat detector.Thirty seconds after connecting the two chambers to the sono-olfactometer, record the USV by starting the audio recording software. Record simultaneously the USV emitted by the two pups, each in their own sealed chamber. The routine protocol is shown in Figure 6. An example of USV recording is Sound 1 (this audio file[href=https://os.bio-protocol.org/attached/file/20190201/USV%20audio%20files.zip] depicts the USV of two 2-day-old pups).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190217/20190217175051_6833.jpgFigure 6. USV recording in a sono-olfactometer. The successive stages of the experimental procedure. Using the broadband 60 kHz output of the detector, ultrasonic calls were sampled, recorded and analyzed using the Audacity open software.Sixty seconds after the beginning of USV recording, start the odor diffusion software. When the odor diffusion program is finished (duration: 5 min), include the date, experiment number and all other needed information in the file name.Transport the pups to their home cage (transfer from the chambers to the safety cabinet, weight them and transfer to the nest of the home cage).",
    "Clean the chambers using 70% ethanol. After a 5-min interval to allow the elimination of the ethanol odorant, start the next test using the same chambers with other pups. The USV records can now be analyzed using the Audacity software. An example of analysis is displayed in Figure 7.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190217/20190217175108_3693.jpgFigure 7. Sample data of the olfactory USV inhibition test. A. Timetable of the experiments. All pups in the same litter of timed pregnant mice were individually infected in utero at embryonic day 13 (E13) with intraplacental inoculation of murine CMV (Smith strain) under anesthesia. As a control (CTL) group, all pups in the same litter of other timed pregnant mice were intraplacentally injected with PBS at E13 under anesthesia. Animals were analyzed using sono-olfactometers on Days 6 and 8 after birth. B and C. Emission of ultrasonic calls for citral odorant on Day 6 after birth (n = 18 CTL, n = 19 CMV). D and E. Emission of ultrasonic calls for male scent odorant on Day 8 after birth (n = 8 CTL, n = 11 CMV). P values are calculated by Wilcoxon matched-pairs signed rank test. **P < 0.01, ****P < 0.0001; mean ± SEM in B-E. CTL pups decrease their emission of calls in response to exposure to non-social or social odorant molecules, such as citral or male scent, respectively. In contrast, congenital CMV infection impairs the ultrasonic call responses triggered by the two scents, indicating an alteration of olfactory perception induced by the virus (for more details, see Lazarini et al., 2018)."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}