{
  "id": 12231,
  "origin_website": "Jove",
  "title": "Ex Vivo Imaging of Resident CD8 T Lymphocytes in Human Lung Tumor Slices Using Confocal Microscopy",
  "procedures": [
    "Human tumors were obtained with the agreement of the French ethical committee and by the Assistance Publique-Hôpitaux de Paris (AP-HP) in application with the article L.1121-1 of the French law. A written informed consent was obtained from the patients prior to inclusion in the study.\n1. Obtaining human lung tumors\nObtain fresh lung tumor samples from patients with stage I-III non-small cell lung cancer who underwent a complete surgical resection of their lung tumors4.\nTransport the non-fixed fresh tumor in 15 mL conical tube containing ice-cold Roswell Park Memorial Institute (RPMI 1640) medium. Set aside on ice for 30 min until step 2.7.\n\tNOTE: When tumors are received in the afternoon, place them at 4 °C overnight and process the following day. In this case, supplement the RPMI-1640 media with 5% fetal bovine serum (FBS).\n2. Agarose embedding and vibratome slicing of human lung tumors\nNOTE: Perform all steps until 2.10 under sterile conditions.\nPrepare 5% agarose solution for embedding by dissolving 1 g low-melting point agarose in 20 mL sterile of Phosphate-buffered saline (PBS) without calcium and magnesium. Microwave this solution until the agarose is completely dissolved. Allow the agarose to cool at 37 °C by placing the solution in an incubator at 37 °C for 5 min.\nIn a tissue culture hood, prepare complete RPMI-1640 medium (without phenol red) containing 10% fetal bovine serum (FBS), 4 mM L glutamine and 1x penicillin and streptomycin.\nAdd 1.1 mL complete RPMI-1640 medium per well to a 6-well cell culture plate and place a 30 mm cell culture insert in each well. Set the plate aside in an incubator at 37 °C for 30 min until step 2.12.",
    "Place sterilized stainless steel flat washers (inner diameter of 5 mm, outside diameter of 10 mm and thickness of 1 mm) in a 35-mm plastic dish filled with RPMI complete medium. Washers will be further used to concentrate the antibodies on the vibratome-cut slice.\nPlace the tumor biopsy in a 10-cm plastic dish and cut the tumor with a sharp blade into small cube shape fragments of approximately 5x5 mm length.\nTake out the agarose from the incubator and pour the solution into a 35-mm plastic dish.\nUse a pair of forceps to carefully transfer the tumor fragments to a tissue wipe to remove the excess of medium. Insert the fragments into the agarose and position them at the bottom of the plastic dish. Leave the agarose gel on ice for 5 min to solidify.\nOnce the agarose solidifies, invert the plastic dish and use a spatula to release the entire gel.\nUse a sharp blade to trim the excess agarose surrounding the tumor fragment, leaving 3-5 mm of gel around the tissue.\nMount each agarose block on the specimen disk of the vibratome with a drop of non-toxic butyl cyanoacrylate tissue glue. Fill the vibratome buffer tray with sterile ice-cold PBS and Install the specimen disk in the tray.\nCut the agarose embedded tissue into 350 µm thick slices. Adjust the vibratome settings at a slow range speed (0.2-0.3 mm/s) and the vibration frequency at a medium range (1.5 mm).\nUsing fine forceps, carefully collect the tumors slices as they are being cut and place them flat onto the cell culture inserts of a 6-well plate (step 2.3). Transfer 1 slice on each insert. Use great care when handling slices as they can be easily damaged.",
    "Use fine forceps to place stainless steel washers on each individual slice. Make sure washers are well positioned on the agarose surrounding the tumor tissue.\nMaintain the culture plate at 37 °C in a 5% CO2 humidified incubator for 10 min. Proceed to immunostaining.\n3. Immunostaining of resident CD8 T cells and tumor cells\nDilute the antibodies (final concentration 10 µg/mL) and the nuclear dye (final concentration 1 µg/mL) in RPMI-1640 media without phenol red.\n\tNOTE: Use fluorescently-coupled anti-CD8 (murine IgG, clone SK1) and anti-EpCAM (epithelial cell adhesion molecule) (murine IgG HEA-125) antibodies to label CD8 T lymphocytes and tumor epithelial cells, respectively. Use fluorescently-coupled anti-CD90/Thy1 (murine IgG, clone 5E10) antibody to label fibroblasts and activated endothelial cells. Use 4',6-diamidino-2-phenylindole (DAPI) to label the nucleus of cells with a compromised plasma membrane in order to assess tissue viability.\nRemove the culture plates from the incubator and use a pipette to aspirate any liquid inside the stainless steel washers. Do not remove the 1.1 mL RPMI-1640 media placed under the cell culture inserts (step 2.3).\nWithout touching the slice and using a pipette tip, add 40 µL of the solution containing the antibodies onto each tumor slice.\nIncubate the plate at 37 °C for 15 min to allow antibody staining.\nWith fine forceps, remove the washers, take out the slices, and dip them 10 s in RPMI-1640 media without phenol red. Place back the slices onto the cell culture inserts and add a drop of phenol red-free RPMI-1640 medium on each individual slice. Maintain the plate at 37 °C for 10 min. Proceed to imaging.\n4. Imaging and analyzing resident CD8 T cell migration within human lung tumor slices\nNOTE: The confocal microscope used in this protocol is an upright spinning disk equipped with a 25x water immersion objective (25x/0.95 N.A.).",
    "Preparing microscope setup\n\t\nSet the temperature of the microscope heat-chamber at 37 °C a few hours before starting the imaging session.\nSet up a system to constantly perfuse tumor slices with oxygenated (5% CO2, 95% O2) phenol red-free RPMI medium (Figure 1). Use a peristaltic pump to flow the perfusion media into the imaging chamber and to aspirate the solution to a waste collection flask.\nRun the peristaltic pump to allow the oxygenated solution to go through the perfusion tubes.\nWith fine forceps, take out the slice from the 6-well plate and transfer it to the 35-mm plastic dish filled with phenol red-free RPMI medium. Immobilize the slice with a 19.7 mm diameter slice anchor with 2 mm spaced-threads. Place the Petri dish on the imaging stage of the microscope. Connect the inlet and outlet tips of the perfusion system. Turn on the perfusion system and set the media flow rate to 0.8 mL/min.\nLower the water-immersion objective to the slice. Focus on the top of the slice with bright field light. Using appropriate fluorescent light, select a region of interest that contains CD8 T cells, tumor islets (positive for EpCAM) and a stroma area (positive for CD90). Check the viability of cells within the slice by assessing DAPI staining at the cut surface and deeper into the tissue.\n\tNOTE: A healthy slice contains only a minority of DAPI positive cells at several microns from the cut surface.\nSet an imaging session with the following actions.\n\t\nDepending on the intensity of the fluorescent signal of the 3 fluorophores, set the exposure time between 50 to 800 ms and the laser intensity between 20 to 40%.\nSelect the z stack thickness to image within the tumor slice.",
    "NOTE: Here, 10-12 optical planes spanning a total depth of 60-70 µm in the z dimension were captured.\nSelect the start position at approximately 10 µm below the first labeled CD8 T cells.\nDefine the time interval between each z-stack image between 10 to 30 s and the total recording time between 10 to 30 min.\nAnalyze resident CD8 T cell migration as described in reference4.\n\t\nAfter importing the data to a tracking software, create spots for each CD8 T cell in the field. Adjust the diameter of the cells and the threshold of detection according on the imaged fluorescent cells.\nInspect the tracks and remove any irrelevant track by deleting them. Correct tracks by connecting and disconnecting different tracks and different time points of the same tracks. Export the data (track speed, track displacement length) to a spreadsheet software."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}