{
  "id": 9050,
  "origin_website": "Jove",
  "title": "Assays to Detect UV-reflecting Structures and Determine their Importance in Mate Preference using the Sailfin Molly Poecilia latipinna",
  "procedures": [
    "All experiments were conducted with the approval of Ohio Wesleyan University's Institutional Animal Care and Use Committee.\n1. Recording UV Reflectance of Fish using a Spectrophotometer\nCalibrate a spectrophotometer and light source with a known white standard over the range of wavelengths to be measured according the recommendations of the instrument or software.\nAnesthetize fish by placing in a 0.5% solution of ethyl 3-aminobenzoate methane sulfonic acid salt (MS-222) buffered with an equal quantity of sodium bicarbonate until fish becomes unresponsive. Once unresponsive, immediately place the fish on a black, non-reflective background. Note: MS-222 is potentially toxic, and gloves should be worn at all times.\nTake all measurements in a darkened room to minimize excess light beyond that of the spectrometer light source.\nMeasure reflectance using a fiber optic probe held against the body of the organism. Make sure to form a consistent 45° angle between the fiber optics and the body, as is built into some probe designs. Note: For measurement consistency, it may be desirable to average across multiple scans (2 - 5) per body region.\nRecord reflectance data with appropriate reflectance analysis software. Note: The software used here was set to: integration time = 2,000 sec, average scans = 2, and pixel smoothing = 5. Data was copied and pasted to a spreadsheet.\nRepeat on multiple body areas to determine presence or absence of UV reflectance and range of phenotypic variation across organisms. Note: Preliminary scans may be necessary to determine which, if any, body areas consistently show UV markings.\nReturn the fish to a well-oxygenated holding aquarium until fully recovered, as evidenced by normal operculum beats and swimming behaviors. Note: A commercial protectant to restore the mucous coating to the body may be added to aid in skin recovery.",
    "Repeat across multiple individuals, including both sexes if desired.\nOn spreadsheet where all data have been copied, plot data using a scatterplot, with reflectance on the Y-axis and wavelength on the X-axis. Amplitude peaks in the UV range (300 - 400 nm) indicate the presence of UV reflectance on the fish.\n2. Dichotomous Mating Trials\nNOTE: Perform control observations, in which focal fish, UV filters, and opaque filters are in place. In these trials, when the opaque filters are removed, focal fish will be exposed to parts of the tank displaying the presence and absence of UV light, but lacking potential mating partners. For details on the validity of dichotomous choice tests in this experiment see Palmer and Hankison (2015)10, although note that these tests also have drawbacks11.\nUse sexually receptive individuals as focal organisms. Use female P. latipinna < 48 hr postpartum5 and males isolated for at least 24 hr prior to testing to improve the likelihood of sexual motivation.\nPlace a single focal individual into a neutral area adjacent to two choice compartments. For P. latipinna, use a 75.7 L test aquarium (30.5 cm x 30.5 cm x 75 cm; Figure 1) divided into three sections by transparent Plexiglas partitions, forming a central area for the focal individual flanked by two equal-sized choice compartments. Ensure that no water or olfactory cues are shared between individual tank sections. Repeat for each individual to be observed.\nimgsrc://cloudfront.jove.com/files/ftp_upload/54453/54453fig1.jpg",
    "Figure 1. Experimental Aquarium Setup. A rectangular aquarium divided into three sections: a central area that held the focal individual and two end compartments that held object pairs (the figure shows a female in the middle with object males at the ends). Interchangeable filters that either blocked or permitted UV reflectance could be placed over the glass partitions dividing the male and female sections of the aquarium. This figure is modified from Palmer and Hankison (2015) 10. Please click here to view a larger version of this figure.[href=http://cloudfront.jove.com/files/ftp_upload/54453/54453fig1large.jpg]\nUnder full-spectrum lighting conditions (lighting whose spectrum extends into the UV-A range), isolate one potential mating partner in each end compartment (choice compartment) of the test aquarium. Ensure that potential mating partners resemble one another as closely as possible in size, coloration and display characteristics, so that the main difference between the two isolated mating partners is whether they appear behind a filter that blocks or transmits UV light.\n\tNOTE: It may be preferable to record reflectance in the visible spectrum to enable the best possible color matching, although here matching was done by eye.\nAcclimate individuals under visual isolation (opaque filters) for 15 min. Ensure that UV + and - filters are in place at this time. Following acclimation, remove the opaque filters. To ensure that side biases are not present (inherent preference for one side of the tank regardless of object), randomly assign the UV+ and UV- sides of the tank for each each trial.\nRecord the amount of time that the focal individual spends within specific preference zones (areas near the choice compartments, in this case approximately two standard body lengths) by using stopwatches. For female fish, this is the amount of time it spends near each of two males, and vise versa for male focal fish.",
    "NOTE: Event recorder software can also be used for recording. Fifteen minutes trials were used in this experiment and fish that did not visit each preference zone at least once were excluded from the results as being unresponsive.\nRecord and analyze the time that fish spend near empty UV+ and UV- compartments to ensure that there is not an inherent bias towards a particular lighting environment that may influence the mating choice of the fish. Use paired t-tests to determine if individuals prefer a particular UV condition.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}