{
  "id": 11081,
  "origin_website": "Jove",
  "title": "Quantitative and Temporal Control of Oxygen Microenvironment at the Single Islet Level",
  "procedures": [
    "1. Preparing the Mouse Islets\nDissect C57BL/6 mice and isolate islets by collagenase digestion and Ficoll density gradient separation. (Refer to JOVE articles referenced in2,3).\nIncubate islets in RPMI-1640 medium containing 10% FBS, 1% penicillin/streptomycin, and 20 mM HEPES in Petri dishes (37 °C, 5% CO2). Post-isolation, culture islets for 24 hr prior to use in experiments. Use the islets within 1-2 days to ensure consistent results.\n2. Making the Microfluidic Platform\nGenerate the microstructure geometries on transparency photomasks for each device layer: 1) inlet and outlet, 2) Glucose microfluidic layer with perifusion chamber (8 mm diameter x 3 mm, 150 μl), 3) 200 μm membrane with microwells (500 μm diameter, 100 μm deep), and 4) gas microfluidic layers.\nTo fabricate the Inlet and outlet layer, pour degassed, premixed PDMS to a height of 1.5 mm in a blank Petri dish and cure at 80 °C for 2 hr. Punch 2 mm diameter input/out ports.\nTo fabricate the glucose microfluidic layer, spin two 350 μm layers of SU8-2150 to form a single 700 μm layer on a 4 in silicon wafer.\n\t\nExpose UV light through the appropriate photomask to transfer microchannel pattern onto the SU8 after development, producing a 700 μm tall master.\nPour degassed, premixed PDMS onto this master to a height of 3 mm and cure at 80 °C for 2 hr. Cut this PDMS to shape with a razor blade.\nPunch 2 mm diameter input/output ports as well as the 8 mm diameter chamber.\nTo fabricate the 200 μm membrane with microwells, spin SU8-2100 to 100 μm. Apply the same UV-lithography to transfer microwell patterns onto this 100 μm tall master.",
    "Spin degassed, premixed PDMS onto this master at 900 rpm for 30 sec and cure at 80 °C for 10 min. Spin a second layer on top of the first using the same conditions, resulting in a 200 μm PDMS membrane containing microwell patterns.\nPunch 2 mm diameter input/output ports through this membrane\nTo fabricate the gas microfluidic layer, spin SU8-2100 to 100 μm. Apply the same UV-lithography to transfer gas microfluidic patterns onto this 100 μm tall master.\n\t\nPour degassed, premixed PDMS onto this master to a height of 1.5 mm and cure at 80 °C for 2 hr. Cut the PDMS to shape with a razor blade.\nPunch 2 mm diameter input/output ports through this layer\nTo bond the multiple layers, prepare them by cleaning with scotch tape, exposing to corona arc, and then aligning by hand in the following order.\n\t\nBond the membrane to the bottom gas layer with microwells facing up.\nBond the glucose microfluidic on top of the microwell membrane.\nBond the inlet and outlet layer on the very top, encapsulating the whole assembly.\nReinforce the bonding by adding 1 kg weight on top and baking at 100 °C for 3 hr.\nLeak-test the completed device by loading water into the aqueous layer, then submerging the entire device under water. Then, flow air through the gas layer with an empty syringe.\nSterilize leak-free devices with 70% ethanol through the aqueous layer then flush with PBS buffer, in which the device is stored at 4 °C until use.\n3. Microdispenser Setup\nObtain 2 microdispensers, 5 V and 20 V DC power supplies, and a digital I/O board to construct the oxygen mixing and delivery setup.\n\t\nConnect the microdispensers' control leads to the included driver units.",
    "Connect the drivers to the digital I/O board at ports corresponding to Labview controls.\nConnect the 5 V and 20 V power supplies to corresponding contacts on the drive units.\nConnect the digital I/O to a laptop to execute Labview codes for gas control (Appendix).\nConnect one microdispenser to nitrogen while another to compressed air, both with 5% CO2. Set both gases to 2 psi. Hook up the dispensers' outputs in a T-junction prior to entering the microfluidic device.\nUsing a leak-tested device, characterize the transient response of oxygen modulation by cycling the microdispensers between 5-21% oxygen, while measuring dissolved oxygen in water with a fiber optic oxygen sensor (see equipment list and representative results).\n4. Setting Up at the Microscopy\nMount the device to the heated stage on the inverted microscope.\nConnect 0% and 21% O2 gases to the device and calibrate with the oxygen sensor.\nConnect the output port of the glucose microfluidics to a fraction collector.\nPrepare the Krebs Ringer bicarbonate buffer (KRB): 129 mM NaCl, 5 mM NaHCO3, 4.7 mM KCl, 1.2 mM KH2PO4, 1 mM CaCl2·2H2O, 1.2 mM MgSO4·7H2O, 10 mM HEPES pH 7.35-7.40, 2 mM basal glucose, and 5% FBS.\nPrepare two buffer solutions containing 2 mM and 14 mM glucose respectively in 50 ml conical tubes bathed in 37 °C water bath.\nConnect a peristaltic pump to draw buffer at 250 μl/min into tubing. Flow the tubing over a 37 °C hotplate before entering the microfluidic device.\nTo stain the islets, add Fura-2 AM in DMSO and Rh123 in 100% ethanol to 2 ml of KRB to reach final dye concentrations of 5 μM and 2.5 μM, respectively.\nPick up islets with a 10 μl pipette and incubate in dyes for 30 min at 37 °C.",
    "Load approximately 20 islets into the device via the glucose microchannel inlet. Direct the islets into the chamber by priming buffer from the outlet back into the inlet.\nPerfuse the islets in buffer for 10 min to wash away excess dyes.\n5. Running the Simultaneous Oxygen and Glucose Stimulation\nDeliver a glucose stimulation pulse with 5 min of baseline established by KRB2, followed by 15 min of 14 mM stimulation, then wash for 15 min in KRB2.\nRecord 340/380 nm excitation wavelength for Fura-2 and 534 emission for Rh123.\nMake measurements of a normal pulse (14 mM normoxic) before each experiment.\nFor oxygen modulation (hypoxia/intermittent hypoxia), only apply buffer flow during stimulation and washing steps and no flow in other steps, to minimize convective disturbances.\nCollect effluents from glucose outlet at 1 min intervals for ELISA insulin assay.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}