{
  "id": 2971,
  "origin_website": "Cell",
  "title": "Peptide-based siRNA delivery system for tumor vascular normalization and gene silencing in 4T1 cells",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nSynthesis of the chimeric peptide mPEG750-RRRRRRRRRK(Ce6)-LLGPLGVRG-ATWLPPR\nTiming: 10 days\nAdopt Fmoc solid-phase peptide synthesis (SPPS) method to construct the chimeric peptide mPEG750-RRRRRRRRRK(Ce6)-LLGPLGVRG-ATWLPPR.\nChoose 0.32 mmoL/g Fmoc-Arg(Pbf)-Wang Resin as the resin, whose Fmoc protecting group is removed after swelling.\nConjugate amino acids from C-terminal to N-terminal of the peptide sequence NH2-RRRRRRRRRK(Ce6)-LLGPLGVRG-ATWLPPR-COOH until the last amino acid of C-terminal, which is protected as Fmoc-Arg(Pbf)-OH.\nNote: Select Pbf, Dde, tBu and Boc as the side chain protection groups of Arg, Lys, Thr and Trp respectively. The α-aminos of all the amino acids should be protected by Fmoc. After the synthesis process, take off a small amount of the product from the resin for electrospray ionization mass spectrometry (ESI-MS) to verify the correction of the structure.\nRemove the Fmoc protection groups, and add mPEG750 in the reaction. Then wash off the Dde protection group of Lys through hydrazinolysis for further conjugation of Ce6 to obtain the semi-finished peptide which is still linked to the resin.\nNote: The molar ratio of Fmoc-RRRRRRRRRK(Dde)-LLGPLGVRG-ATWLPPR and mPEG750 is 1:3. The molar ratio of mPEG750-RRRRRRRRRK-LLGPLGVRG-ATWLPPR and Ce6 is 1:2.\nCritical: Adopt ninhydrin reaction to monitor the deprotection process in SPPS process. Terminate the PEG conjugation process when the ninhydrin test shows negative and take a small amount of the PEG conjugated-product off for ESI-MS and HPLC examination to verify the successful conjugation of PEG. Terminate the hydrazinolysis process of the Lys’ protection group Dde when the ninhydrin test shows positive, and utilize DMF and DCM to wash the obtained product for three times respectively. Terminate the Ce6 conjugation process when the ninhydrin test shows negative.",
    "Adopt lysis solution which is composed of TFA, triisopropyl silane and ultrapure water (volume ratio = 95: 2.5: 2.5) to wash off all the protection groups and obtain the chimeric peptide mPEG750-RRRRRRRRRK(Ce6)-LLGPLGVRG-ATWLPPR.\nDissolve the above chimeric peptide product in ultrapure water and adopt Semi preparative chromatography for further purification. Then the final product could be obtained after rotary evaporation and lyophilization.\nNote: Filter the crude aqueous solution of straight-chain peptide with a 0.45 μm filter membrane and purify the improved crude peptide using HPLC: adopting gradient elution separation and purification by utilizing the DAC-HB50 dynamic axial compression column, 0.05% aqueous trifluoroacetic acid as mobile phase A and 0.05% acetonitrile trifluoroacetate solution as mobile phase B. Collect peptide solution from the target peak with the assist of ultraviolet detector.\nThe product with purity greater than 95% obtained from HPLC should be further concentrated after rotary evaporation until the liquid volume reached to one third of the original volume. The final product powers could be obtained after 48 h lyophilization.\nCritical: Store the chimeric peptide product mPEG750-RRRRRRRRRK(Ce6)-LLGPLGVRG-ATWLPPR as lyophilized peptide powder to avoid moisture absorption and degradation by protease (refer to troubleshooting 2[href=https://www.wicell.org#sec6.3] for further details), which might accelerate the invalidation of the peptide.\nPreparation and characterization of PA7R@siRNA micelleplexes\nTiming: 1 day\nEmploy nanoprecipitation method to prepare PA7R@siRNA micelleplexes.10[href=https://www.wicell.org#bib10],11[href=https://www.wicell.org#bib11] The detailed preparation is as follows (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2509-Fig2.jpg\nFigure 2. Schematic illustration of the preparation of PA7R@siRNA micelleplexes\nDissolve 1 mg peptide (lyophilized powder) in 10 μL DMSO, and then mix it with 14 μL DMSO solution of lecithin (6 mg/mL).\nNote: The molar ratio of peptide and lecithin is 1: 2.",
    "Add the above mixture stepwise in 1 mL DNase/RNase-free water under ultrasonication (120 W) for 5 min, followed by incubation at room temperature for 2 h to obtain PA7R micelleplexes via self-assembly.\nMix PA7R micelleplexes with 102 μL aqueous solution of siRNA (20 μM, dissolved in DNase/RNase-free water) and vortex for 15 s, then incubate at room temperature for 30 min to acquire PA7R@siRNA micelleplexes.\nNote: The vortex process might cause the liquid to splash onto the centrifuge tube wall, therefore, the liquid is recommended to be collected at the bottom of the tubes using a hand-held centrifuge after the vortex for adequate incubation of PA7R micelleplexes and siRNA.\nTransfer the above solution of PA7R@siRNA micelleplexes to an ultrafiltration device (15 mL, MWCO 100K) and centrifuge at 5,000 rpm for 15 min to remove the organic solvent DMSO.\nDisperse the concentrated product in PBS solution for further use.\nNote: Store the concentrated product in PBS solution at 4°C for no more than two days for short time use, or store the solution at -20°C for no more than one week for long time use.\nUse transmission electron microscope (TEM) and nanoparticle size and zeta potential analyzer to determine the morphology, hydrodynamic diameter and polymer dispersity index of PA7R@siRNA micelleplexes.\nNote: To characterize whether the MMP-2 treatment could result in the collapse of the nanostructure, incubate PA7R@siRNA micelleplexes solution with MMP-2 (the concentration of MMP-2 in this protocol is 2.5 μg/mL) at 37°C for two hours, and adopt negative staining for further TEM examination.\nIn vitro tube formation assay and transwell cell migration assay\nTiming: 3 days",
    "To evaluate the angiogenesis inhibition capability of the antiangiogenic peptide A7R, in vitro tube formation assay and transwell cell migration assay is carried out on HUVECs, which indicates the potential of the peptide-based micelleplexes to induce tumor vascular normalization.\nSeed HUVECs into a Matrigel-coated 96-well plate (4 × 105 per well) with DMEM cell culture medium which contains different drug formulations (Pcon@siRNA, Pcon@siRNA+M, A7R, PA7R@siRNA, PA7R@siRNA+M) and set the untreated HUVECs as the control group.\nNote: Add 50 μL liquid Matrigel which contains 1× Endothelial Cell Growth Supplement (ECGS) into each well of the 96-well plate. After being balanced on ice for 5 min, the Matrigel-coated 96-well plate needs to be placed in cell culture chamber for 30 min incubation to get solidification.\nCritical: Divide the Matrigel into several tubes according to the required dosage for storage at -20°C to avoid repeated freeze-thaw. Before the experiment, melt the divided Matrigel at 4°C overnight and precool the pipette tips as well as 96-well plate in advance since the Matrigel can get solidified very easily at room temperature. In order to form a horizontal plane for better observation of tubule formation, the whole Matrigel-coating process needs to be performed on the ice plane, and be careful not to generate any bubbles during the process of adding Matrigel.\nObserve and image the tubule formation using an inverted microscope after incubating HUVECs with different treatments in a Matrigel-coated 96-well plate at 37°C under humidified 5% CO2 atmosphere for 4 h.\nCritical: The tubule formation generally starts to appear after incubation for 2 h and may disappear 6 h later. Be careful to observe the tubule formation in an appropriate time.",
    "Seed HUVECs (1 × 105 per well) in 100 μL pure DMEM medium which contains different formulations (Pcon@siRNA, Pcon@siRNA+M, A7R, PA7R@siRNA, PA7R@siRNA+M) into the upper chambers, and add 800 μL complete DMEM medium in the lower chambers. Set the untreated HUVECs as the control group.\nNote: Since the cells that possess migration ability tend to migrate to regions where nutrients are abundant, the upper chambers need to stay poor nutrient by adding pure DMEM medium, and the lower chambers should keep nutrient by adding complete DMEM medium that contains 10% FBS.\nAfter incubation at 37°C under humidified 5% CO2 atmosphere for 24 h, fix the HUVECs that migrate through the transwell membrane for 20 min first using 4% paraformaldehyde, then wash twice with PBS.\nStain the transwell membrane for 30 min using crystal violet, and wash twice with PBS. Observe the migration of HUVECs using an inverted microscope.\nsiRNA transfection\nTiming: 2 days\nTo evaluate the gene down-regulation ability of PA7R@siRNA micelleplexes, siRNA transfection assay is performed in 4T1 cells.\nSeed 4T1 cells in confocal dishes (2 × 105 cells per dish) and incubate at 37°C under humidified 5% CO2 atmosphere for 24 h. Treat the cells with different formulations which contain FAM-labeled siRNA (siFAM) in the presence or absence of RNase.\nAfter incubation for 6 h, wash twice with PBS, fix with paraformaldehyde solution and stain with 40,6-diamidino-2-phenylindole (DAPI). At last, use CLSM to examine the fluorescence signals of siFAM and DAPI.",
    "Note: In order to avoid the overlap with the fluorescence of Ce6 (Ex: 400 nm; Em: 653 nm), low wavelength fluorescent dyes such as FAM or FITC are recommended to label siRNA. Herein, FAM is chosen for further experiment. Set free siFAM group and Lipofectamine 2000@siFAM group as the negative and positive group respectively. Since Lipofectamine 2000 needs to function in serum-free medium for its best transfection effect, thus, the serum-free DMEM medium is adopted in siRNA transfection assay."
  ],
  "subjectAreas": [
    "Chemistry",
    "Health Sciences",
    "Biotechnology And Bioengineering",
    "Cancer",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}