{
  "id": 10513,
  "origin_website": "Jove",
  "title": "Rigid Embedding of Fixed and Stained, Whole, Millimeter-Scale Specimens for Section-free 3D Histology by Micro-Computed Tomography",
  "procedures": [
    "All procedures on live animals were approved by the Institutional Animal Care and Use Committee (IACUC) at the Pennsylvania State University.\n1. Day 1: Fixation\nTo improve the fixation and reduce the volume of gut contents, starve the juvenile fish for at least 24 h for a 10 mm specimen, or longer for larger specimens (e.g., 72 h for a 14 mm specimen).\nPre-chill 10% Neutral Buffered Formalin (NBF) and 2x Tricaine-S (MS-222, 400 mg/L) on ice to 4 °C.\nDouble the fish water volume with chilled 2x MS-222 for rapid and humane euthanasia.\nWait for 30 s (larvae) to 60 s (juveniles) after the fish stops moving.\nImmerse the fish in chilled 10% NBF for 10 min.\nFix the fish in chilled 10% NBF solution overnight in flat-bottomed containers at room temperature.\n\tNOTE: Flat-bottomed containers are required to minimize the bending of the specimen. The volume of fixative and solutions of all subsequent steps should be at least 20 times the sample volume unless otherwise specified. For 1-5 larval zebrafish, the recommended solution volume is at least 1 mL. Insufficient fixative results in poor fixation, and a surplus of reagent volume does not negatively impact the outcome of the described procedure. For complete fixation of larger fish, slit the belly starting slightly anterior to the anal pore. Use minimal penetration of scissors or knife and apply gentle force away from the fish while cutting to minimize damage to internal organs. Fixation protocols have been described by others31,32,33.\n2. Day 2: Dehydration & Staining\nRinse fixed specimens 3 times in 1x phosphate buffered saline (PBS) pH 7.4 for 10 min.\nSubmerge the samples in 35% ethyl alcohol (EtOH) for 20 min at room temperature with gentle agitation.",
    "NOTE: For all gentle agitation steps, use a tabletop shaker and set for a mixing effect while carefully avoiding bumping and rubbing of the sample against the container surfaces.\nSubmerge the samples in 50% EtOH for 20 min at room temperature with gentle agitation.\nDissolve phosphotungstic acid (PTA) powder in water to prepare a 1% w/v stock solution.\nDilute the 1% PTA stock solution 3:7 in 100% EtOH to obtain a 0.3% PTA staining solution.\nStain the samples overnight in the 0.3% PTA solution at room temperature with gentle agitation.\n3. Day 3: Infiltration\nPrepare 1:1 v/v mixture of 100% EtOH and LR White acrylic resin and set aside.\nRinse 3 times in 70% EtOH for 10 min.\nSubmerge the samples in 90% EtOH for 30 min at room temperature with gentle agitation.\nSubmerge the samples in 95% EtOH for 30 min at room temperature with gentle agitation.\nSubmerge the samples twice in 100% EtOH for 30 min at room temperature with gentle agitation.\nSubmerge the samples in the 1:1 EtOH and LR White acrylic resin mixture overnight at room temperature with gentle agitation.\n4. Day 4: Embedding\nSubmerge the samples in 100% LR White resin for 2 h at room temperature with gentle agitation.\nReplace the resin in step 4.1 with fresh 100% LR White resin and incubate for 1 h at room temperature with gentle agitation.\nAssemble the embedding apparatus (Figure 1).\nCut polyimide tubing of appropriate diameter and length.\n\tNOTE: The tubing with an inner diameter that is at least 0.1 mm larger than the diameter of the specimen is recommended. For typical specimens, a standard length of 30 mm of tubing is used for each sample. When desired, elongated specimens can be accommodated by using longer tubing.",
    "Attach a P1000 micropipette to the wide end of the embedding adapter and insert the polyimide tubing to the narrow end (Figure 1C). If the embedding adapter is not available, go to Step 4.3.3. Otherwise, continue to Step 4.4.\nClip off the end of a micropipette tip straight across such that the polyimide tubing fits snugly. Cut at 44 mm from the wide end of a 200 µL yellow micropipette tip for the 0.0403\" tubing and 59 mm from bottom of 1 mL blue tip for the 0.105\" tubing. Trim as needed.\nAttach the cut micropipette tip to a micropipette.\nTransfer the samples to a small weigh boat or V-shaped solution basin and fully submerge the samples in 100% LR White resin.\nWith the embedding apparatus from Step 4.3, aim the tubing at the wide end of the fixed sample (or towards the head in the case of animal specimens) and pipette the specimen slowly into the tubing. Position the sample in the middle of the tubing and ensure the tubing above and below the specimen is filled with resin.\n\t\nPipette the sample into the tubing such that the sample is moving in the natural, forward direction.\n\t\tNOTE: Slow pipetting avoids air bubbles and specimen damage caused by abrasion against the tubing edge. Backward movement into the tubing can easily damage extremities (limbs, wings, fins, etc.). It is recommended to allow some resin overflow in the embedding apparatus so that, later, air does not enter the tubing during removal.\nImmediately seal the open end with oil-based soft modeling clay.\n\t\nFlatten the clay into a 1 mm-thick sheet.\nStabilize the tubing between index and middle fingers.\nSlowly press the clay against the end of the tubing with thumb.\nRemove excess clay.\nRemove the embedding apparatus from the micropipette.",
    "Pull out the tubing by gentle rotation and seal the other end with the clay.\n\t\nHold a finger against the sealed end to prevent the ejection of the clay.\nSlowly push the unsealed end of the tubing into the clay.\nPlace the tubing horizontally and polymerize the resin for 24 h at 65 °C.\n\tNOTE: Horizontal placement avoids the sample movement during polymerization. If a small amount of air was trapped in Step 4.8, the end with the air bubble may be elevated slightly to prevent air bubble movement toward the specimen. Importantly, too much elevation during polymerization may cause the specimen to fall towards the low end due to gravity. A properly embedded sample is shown compared to one with an air bubble, which should be avoided because the refraction from air/resin interfaces can degrade image quality (Figure 2).\n5. Day 5: Collection\nCollect the samples for image acquisition at the end of Day 5.",
    "NOTE: The removal of polyimide tubing is possible but not necessary for imaging. Synchrotron-based micro-CT imaging for the zebrafish sample was performed at Beamline 2-BM at Advanced Photon Source (APS) in Argonne National Laboratory (Lemont, IL, USA). For PTA-stained zebrafish, an optimal X-ray energy range of 5-30 keV was determined, and an X-ray energy of 13.8 keV was used for imaging. 1501 projections were obtained at 13.8 keV over 180 degrees (1 projection every 0.12 degrees) with a 2048-by-2048 pixel camera. Additionally, two flat-field (gain) images (one at the beginning and one at the end of the acquisition) and one dark-field image were also acquired. Flat-field and dark-field corrections, ring artifact reduction, and image reconstruction were done using the open source TomoPy toolkit34. PTA-stained Daphnia and Drosophila samples were imaged on an X-ray microscope12,35. Specific micro-CT settings are dependent on the object and the quality of the stain. For example, the Drosophila specimen was scanned at 40 kVp, 74 mA, and 15 s at a voxel resolution of 3.10 × 3.10 × 3.10 µm3."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}