{
  "id": 4645,
  "origin_website": "Bio",
  "title": "Purification of 70S Ribosomes from <em>Bacillus subtilis</em>",
  "procedures": [
    "Crude preparation of 70S ribosomesB. subtilis is streaked out for single colonies and pre-incubated on LB agar plates at 30 °C for 14-16 h.Cells are taken from single colonies on the plates and suspended in approximately 10 ml of LB medium with high turbidity. The cell suspension was diluted into 3 L of LB medium at an OD600 of 0.04, and distributed equally among six 2-liter flasks, each containing 500 ml of the cell culture. The flasks are incubated at 37 °C with shaking at 250 rpm.Note: B. subtilis is routinely cultured in volumes that do not exceed one quarter of the volume of the flask used.Cells are harvested by centrifugation, when the OD600 of the culture reaches 0.2, using six 500-ml centrifuge tubes (7,000 x g; 5 min, 4 °C). Cell pellets are resuspended with small volume of the culture supernatant, transferred from a 500-ml centrifugation tube to six 15-ml sample tubes and pellets are collected (3,500 x g, 5 min, 4 °C). The cell pellets are frozen by liquid N2.Each cell pellet is suspended in 3.5 ml of Buffer I pre-chilled on ice.Cells are disrupted using a French press (8,000 p.s.i.) passing the sample through three times.Cell debris is removed by centrifugation (11,000 x g, 30 min, 4 °C).The supernatant (cell lysate) is centrifuged at 30,000 x g for 30 min at 4 °C, for example in a HITACHI P55ST2 rotor at 18,000 rpm.The resulting supernatant (S30 supernatant) is centrifuged at 200,000 x g for 100 min at 4 °C (e.g. in a HITACHI P55ST2 rotor at 45,000 rpm).Each pellet is resuspended with 200 μl of Buffer I and the suspension stored at -80 °C until required (S100 pellet fraction). Note that the S100 fraction can be seen as amber pellet at bottom of the tube.",
    "Using a glass rod may be preferable to resuspend the pellet because resuspension of the pellet by pipetting is not easy. Note: Care is taken to avoid generating foam while resuspending the pellet. Purification of 70S ribosomesTo further purify the 70S ribosomes, prepare a 10-40% sucrose gradient in SW28 centrifuge tubes using a Gradient Master gradient mixer.10% and 40% sucrose solutions are prepared in Buffer I.The 10 to 40% sucrose gradient is generated in a SW28 centrifuge tube using a Gradient Master gradient mixer.The S100 pellet fraction is applied on the top of the 10 to 40% sucrose gradient and centrifuged at 67,000 x g for 17 h at 4 °C (e.g. in a HITACHI P28S rotor at 22,500 rpm, using 270 A260 units per centrifuge tube).Samples are taken by Piston Gradient Fractionator and Micro collector. Absorbance profiles at 260 nm are determined using a Nano drop 2000. Note: An example of the ribosome profile from crude cell extracts is shown in Figure 1.Collected fractions containing 70S ribosomes are identified as a peak with an absorbance at 260 nm.The ribosomes are recovered from the pooled fractions, which are diluted with Buffer I (1:2 dilutions) and centrifuged at 64,000 x g for 17 h at 4 °C. (e.g. in a HITACHI P40ST rotor at 22,500 rpm).The supernatant is removed completely from the centrifuge tubes.The resulting 70S ribosome pellets are covered with 300 μl of Buffer I and left overnight at 4 °C. The pellet is then gently resuspended in Buffer I using a glass rod and stored at -80 °C until required.Note: Care is taken to avoid generating foam while resuspending the pellet."
  ],
  "subjectAreas": [
    "Microbiology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}