{
  "id": 4827,
  "origin_website": "Bio",
  "title": "<EM>In vitro</EM> Studies: Inhibition of Nevirapine Metabolism by Nortriptyline in Hepatic Microsomes",
  "procedures": [
    "Inhibition of the nevirapine metabolism by nortriptyline in rat hepatic microsomesIsolate rat liver microsomes following these steps:Sacrifice a total of 5 Wistar rats (280-310 g) by isoflurane inhalation.Open the abdominal cavity of each rat, excise the liver and place it into a beaker containing saline solution.Wash the liver with saline solution and place it on a paper towel. Weigh the liver and cut it into small pieces at 4 °C.Place the liver into the glass vessel and add 5x its mass in volume of 50 mM sodium-potassium phosphate buffer (pH 7.4) containing 1.15% (wt/vol) KCl, 2 mM EDTA, and 0.25 M sucrose.Homogenize the liver with the tissue grinder until a complete homogeneous solution is obtained.Transfer the homogenate to 10 ml polypropylene tubes and centrifuge (4 °C) at 9,000 x g for 10 min.Transfer the supernatant to ultracentrifuge tubes and centrifuge (4 °C) at 150,000 x g for 1 h.Resuspend the microsomal pellet in 0.1 M potassium phosphate buffer (pH 7.4).Determine microsomal protein concentration following the method of Lowry et al. (1951):Prepare a series of dilutions of 2 mg bovine serum albumin in water, to give concentrations of 0.1 to 1 mg/ml.Add to 100 µl of each dilution of standard or sample containing microsomes and 2 ml of Lowry reagent to each 10 ml polypropylene tube. Incubate the tubes in the dark at room temperature for 15 min.Add 200 µl of an aqueous solution of Folin-Ciocalteu’s phenol reagent (1/2, vol/vol) to each tube. Incubate the tubes in the dark at room temperature for 30 min.Measure absorbance at 750 nm in 1 cm spectrophotometer cuvettes.Prepare a mixture in a 1.",
    "5 ml screw cap vial that contains the following compounds (per 100 µl): 10 µl of a solution of NVP in a mixture of water, methanol, and DMSO (final concentrations: 5 µg/ml NVP, 0.12% methanol, and 0.08% DMSO)10 µl of NT solutions in water (final NT concentrations of 100, 200, 300, 500, 1,000, 2,000, 3,000, and 10,000 ng/ml) or 10 µl of H2O in the case of controls.5 µl of a 20-mg/ml glucose-6-phosphate aqueous solution5 µl of a 20-mg/ml β-NADP aqueous solution 10 µl of a glucose-6-phosphate dehydrogenase aqueous solution (10 IU/ml) 5 µl of a MgCl2 aqueous solution (13.4 mg/ml) Quantity sufficient to 100 µl of 0.1 M potassium phosphate buffer (pH 7.4) Rat hepatic microsomes previously isolated (equivalent to 0.1 mg of protein). With this addition the metabolic reaction is startedIncubate the test vials for 30 min at 37 °C in a water bath.Terminate the reaction in an ice bath by adding 100 µl of acetonitrile to the test vials.Centrifuge the vials at 2,000 x g for 5 min at 4 °C.Determine the amount of NVP in the supernatant liquid by high performance liquid chromatography (HPLC), using a C18 column and a UV detector set at 240 nm, as described previously (Usach et al., 2014).Inhibition of nevirapine metabolite formation by nortriptyline in human hepatic microsomesPrepare a mixture in a 7.5 ml screw cap tube that contains the following compounds (per 100 µl):20 µl of a solution of NVP in a mixture of water, methanol, and DMSO (final concentrations of 5 µg/ml NVP, 0.12% methanol, and 0.08% DMSO)20 µl of NT solutions in water (final NT concentrations of 100, 1,000 and 10,000 ng/ml) or 10 µl of H2O in the case of controls.",
    "10 µl of a 20-mg/ml glucose-6-phosphate aqueous solution10 µl of a 20-mg/ml β-NADP aqueous solution 20 µl of a glucose-6-phosphate dehydrogenase aqueous solution (10 IU/ml) 10 µl of a MgCl2 aqueous solution (13.4 mg/ml) Quantity sufficient to 0.2 ml of 0.1 M potassium phosphate buffer (pH 7.4) Human hepatic microsomes (equivalent to 0.2 mg of protein). With this addition the metabolic reaction is started.Incubate test tubes for 30 min at 37 °C in a water bath.Terminate the reaction in an ice bath by adding 25 µl of a 2 N sodium hydroxide solution and 5 ml of ethyl acetate to extract NVP and its metabolites. Shake the mixture and wait a few minutes until the two phases are completely separated.Transfer the supernatant to another 7.5 ml screw cap tube and evaporate it in a 40 °C water bath under a nitrogen stream. Repeat the extraction: Add 3 ml of ethyl acetate, shake the tube and evaporate the supernatant as before.Dissolve the dried residue into 100 µl of the mobile phase composed of acetonitrile and sodium phosphate monobasic buffer (50 mM [pH 4.6]) containing 0.1% (vol/vol) triethylamine (12/88, vol/vol).Centrifuge vials at 2,000 x g for 5 min at 4 °C.Determine the amount of NVP and its metabolites in the supernatant liquid by HPLC, using a C18 column and a UV detector set at 240 nm, as described previously (Usach, et al., 2014)."
  ],
  "subjectAreas": [
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}