{
  "id": 19661,
  "origin_website": "Jove",
  "title": "Inter-Brain Synchrony in Open-Ended Collaborative Learning: An fNIRS-Hyperscanning Study",
  "procedures": [
    "All recruited participants (40 dyads, mean age 22.1 ± 1.2 years; 100% right-handed; normal or corrected-to-normal vision) were healthy. Before the experiment, participants gave informed consent. Participants were financially compensated for their participation. The study was approved by the University Committee of Human Research Protection (HR-0053-2021), East China Normal University.\n1. Preparation steps before adopting data\nHomemade NIRS caps\n\t\nAdopt elastic swimming cap to place optode holder grid.\n\t\tNOTE: Considering that the head sizes of the participants are different, two sizes of caps are used. Small caps are prepared for participants with a head circumference of 55.4 ± 1.1 cm, and large caps are for the participants with a head circumference of 57.9 ± 1.2 cm.\nAnchor the location of the EEG electrodes (inion, Cz, T3, T4, Fpz, and P5) as reference optodes according to the standard international 10-10 system on elastic swimming caps (see Table of Materials).\n\t\t\nFirst, place the standard 10-10 EEG cap (see Table of Materials) on the head mold, and put the elastic swimming cap on the EEG cap. Second, mark reference optodes (inion, Cz, T3, T4, Fpz, and P5) with chalk on each cap. Finally, cut two holes about 15 mm in diameter to place the two reference optodes (i.e., Fpz and P5, Figure 1).\n\t\t\tNOTE: Specifically, a 3 x 5 optode probe set and a 4 x 4 optode probe set are separately placed over the prefrontal area (reference optode is placed at Fpz, Figure 1B) and left temporoparietal regions (reference optode is placed at P5, Figure 1B).\nCut holes to place the other optodes. Arrange a swimming cap with two grid holders directly on the head mold. Then, mark the location of other optodes with chalk. After that, cut the rest holes to make sure the grid holder fits in.",
    "Mount two probe sets (i.e., 3 x 5 and 4 x 4) to the swimming caps (see Table of Materials).\n\t\tNOTE: The NIRS measurement system (see Table of Materials) provides these standard probe sets (i.e., 3 x 5 and 4 x 4) with standard holder sockets ensuring the 30 mm optode separation.\nOpen the probe set monitor window at the NIRS measurement system and select four probe sets arranged in 3 x 5 and 4 x 4 for each person, separately.\n\t\tNOTE: The probe arrangements of the two caps should correspond to the structures in the probe set window (i.e., the exact location of the receiver probe numbers and the respective emitter).\nPreparation of the experiment\n\t\nBefore recording data, ensure the NIRS system is keeping a stable operating temperature by starting the system for at least 30 min.\n\t\tNOTE: The stable operating temperature ranged from 5 °C to 35 °C.\nSet the measurement mode to event-related measurement. Ensure the triggers receiver is active (i.e., the RS232 serial input).\n\t\tNOTE: The experiment is programmed in commercially available psychology software (see Table of Materials). The absorption of near-infrared light (two wavelengths: 695 and 830 nm) is measured with a sampling rate of 10 Hz.\nPrepare the lighted fiber optic probe, which can be used to move hair aside.\nSet the experiment environment with one table with two chairs to keep participants' seats face-to-face.\n2. Adopting data by instructing participants\nPrepare the participants\n\t\nInstruct the participants, including the details of NIRS measurement methods.\n\t\tNOTE: All the participants were healthy and were financially compensated for participation. No participants withdrew from the experiment halfway through. The laser beam of the NIRS may be harmful to the participants' eyes, and they were instructed not to look directly into those laser beams.",
    "Make the participants sit face-to-face (apart from a table (0.8 m)) to make sure they can see each other directly. Adjust the chair-to-table distance (i.e., nearly 0.3 m) to make the participants sit comfortably.\nTurn on the laser button, and place the caps with the probe sets on the participants' heads.\n\t\tNOTE: The 3 x 5 probe sets cover the forehead of the participants (middle probe of the bottom row is placed on Fpz); the 4 x 4 probe sets cover the left temporoparietal cortex (the third probe of the third row is placed on P5).\nPut the four optical fiber bundles loosely on the holder's arms without contact with the participants or chairs.\n\t\tNOTE: Here, the NIRS measurement system has four bundles of optical fibers. Additionally, ensure that the participants do not feel too heavy to pull off the caps.\nLet the probe tips touch participants' scalp by carefully pushing each spring load probe further into its socket.\nPerform signal calibration.\n\t\t\nFirst, check the quality of the signal by clicking the Auto Gain in the probe set monitor window of the fNIRS machine. Then, a channel's poor signal and sufficient signal are marked in yellow and green in the probe set monitor window, respectively.\n\t\t\tNOTE: For a channel with insufficient signals, lighted fiber optic probes are used to move the hair under the probe's tip to one side.\nThen, push the probes further into their sockets to get sufficient signals. Repeat this process until all the channels are marked in green in the probe set monitor window of the NIRS measurement system, indicating that the quality of signals is accessible.\nRun the experiment\n\t\nStart the experiment with a 5 min rest state, which serves as the baseline. Then, two participants are required to co-learn the learning materials.",
    "After the experiment, click on Text File Out to export the raw light intensity data and save the data as a text file.\n\t\tNOTE: No filters are applied in the NIRS measurement system.\nUse the three-dimensional (3D) digitizer (see Table of Materials) to determine the locations of emitters, receivers, and other references (i.e., inion, nasion, Cz, and left and right ears) for each participant.\n\t\t\nObtain the MNI coordinates for the recording channels using the commercially available numeric computing platform21 (see Table of Materials). Supplementary Table S1 shows the corresponding anatomical locations of each channel.\nClean probes and probe holders with ethanol. Wash caps with mild detergent and let the caps air dry.\n3. Data analysis\nData preprocessing\n\tNOTE: Previous research has adopted variable non-commercial software packages (e.g., Homer222, AnalyzIR23, or nirs LAB24) with numeric computing platforms (see Table of Materials) on fNIRS data analysis, and they are all available on the website. Here Homer2 was used to do the preprocessing of the NIRS data. Additionally, both fNIRS recording data collected in the rest and collaborative learning phases share the same preprocessing and analysis pipeline.\n\t\nCopy the dataset from the fNIRS machine. Convert the original data formation to the proper formation (i.e., convert cvs file to nirs file).\nConvert raw data to optical density (OD) data with \"hmrIntensity2OD\" function provided in the Numeric computing platform (see Table of Materials).\nDelete the bad channels. Then average the OD value for each participant on each channel and full sample points, respectively.\n\t\tNOTE: Here, 46 averaged OD values are obtained.\n\t\t\nCalculate the standard deviation (SD) for each participant.\nMark as unusable and remove the channels with very low or high OD (which exceeded 5 SDs) from the analysis for each participant.",
    "NOTE: This step can be performed before and/or after fNIRS data preprocessing. In this data analyses pipeline, the bad channels are detected before the fNIRS data preprocessing.\nConvert the OD time data into Oxy-Hb, DeOxy-Hb, and combined signal based on the modified Beer-Lambert Law25.\n\t\tNOTE: Reference25 says, \"All data analysis steps are conducted on Oxy-Hb data, which is an indicator of the change in regional cerebral blood flow having higher signal-to-noise ratio26. Additionally, previous research employed fNIRS hyperscanning in teaching and learning scenarios mainly focused on Oxy-Hb concentration11,12,13,14.\"\nCalibrate Oxy-Hb time series from motion artifacts by the channel-by-channel wavelet-based method.\n\t\tNOTE: Specifically, the Daubechies 5 (db5) wavelet with tuning parameter at 0.1 (see details in Homer2 manual)27,28 is adopted in removing motion artifacts.\nApply the band-pass filter (i.e., 0.01-1 Hz) on the calibrated Oxy-Hb data to reduce the high-frequency noise and slow drift.\nConduct principal components analysis (PCA) on the OxyHb signal to remove non-neural global components (e.g., blood pressure, respiration, and blood flow variation)29.\n\t\tNOTE: The PCA analysis proposed by Zhang and colleagues29 is adopted here.\n\t\t\nFirst, decompose the signal.\n\t\t\tNOTE: The specific formula of decomposition of fNIRS signal is: H = UΣVT. Here, temporal and spatial patterns of fNIRS data are presented in two matrices (i.e., U and V). U is a 2D (sample point x principal component) matrix. V is also a 2D (principal component x principal component) matrix. The column in V indicates one principal component (PC), and the strength of that PC for a particular channel is estimated in each entry of the column. The relative importance of each PC is represented by the value of the diagonal matrix Σ.\nSecond, conduct spatial smoothing.\n\t\t\tNOTE: Gaussian kernel convolution is employed to remove localized signals and get the global component.\nThird, reconstruct the signal.",
    "NOTE: To calculate the global component of the fNIRS data, the smoothed spatial pattern matrix V* is plugged back into the decomposition formula: HGlobal = UΣ(V*)T. Then, localized derived neuronal signal can be obtained using original data H to subtract HGlobal : HNeuronal = H - HGlobal.\nInter-brain synchrony\n\tNOTE: To reveal brain coupling in second-person neuroscience, wavelet transform coherence (WTC) is adopted here. Briefly, WTC measures the correlation between two-time series as a function of frequency and time. The specific formula of wavelet coherence of two-time series x and y is:\nimgsrc://cloudfront.jove.com/files/ftp_upload/62777/62777eq01.jpg\n\t​T and s denote the time and wavelet scale separately, ‹·› indicates a smoothing operation in scale and time. W represents the continuous wavelet transform. Then, a 2D (time x frequency) WTC matrix is generated30. Several toolboxes are used to calculate the WTC value. Here the toolbox created by Grinsted and colleagues was used30.\n\t\nAdopt the WTC function of the numeric computing platform (see Table of Materials).\n\t\tNOTE: Here, the default setting of the mother wavelet (i.e., Generalized Morse Wavelet with its parameters beta and gamma) is used. Mother wavelet converts each time series into the frequency and time domain.\nSet the default setting on the other parameters (i.e., MonteCarloCount, representing the number of surrogate data sets in the significance calculation).\nCalculate the WTC value for two corresponding channels (the same channel in two participants) in a numeric computing platform (see Table of Materials). Following the same procedure, 46 WTC matrices are generated from 46 channels.\nDetermine the frequency band of interest (FOI), which is sensitive to collaborative learning.\n\t\tNOTE: Here, a cluster-based permutation approach is adopted to detect such FOI31, which offers a solution to multiple comparisons in multi-channel and multi-frequency data.",
    "Perform Time-average of the WTC values in the resting and collaborative learning phases, respectively, for each channel combination. Then, conduct paired sample t-tests along with the entire frequency (frequency range: 0.01-1Hz32) on these time-averaged WTC values (collaborative learning vs. rest). Next, identify frequency bins at which the task effect is significant (collaborative learning > rest, p < 0.05).\nObtain significant frequency neighboring points (≥2) as observed clusters and corresponding T values.\nConduct a series of paired sample t-tests on permuted data to generate the T values for each cluster qualified in step 3.2.4.2 for 1000 times.\n\t\t\tNOTE: For forming permuted data, participants are randomly assigned to form new two-member pairs. As the length of datasets varied across dyads for each random pair, the longer dataset is trimmed to the same length as the shorter one33.\nCompare the averaged cluster-based T values from original pairs with the T values of 1000 permutations.\n\t\t\tNOTE: The p values evaluated by this formula34:\nimgsrc://cloudfront.jove.com/files/ftp_upload/62777/62777eq02.jpg , where S0 denotes observed averaged-cluster t-value, μp and σp indicate the mean and standard deviation of permutation values.\nAverage WTC values in the identified FOI in each channel in each dyad. Then, apply fisher z transformation to the WTC values to get a normal distribution of WTC values. Use this value to index the IBS for further statistical analysis.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}