{
  "id": 4441,
  "origin_website": "Bio",
  "title": "Generation and Maturation of Human Monocyte-derived DCs",
  "procedures": [
    "See Notes for a flow chart with the steps to generate DCs.    Take a buffy coat preparation (50 ml) from a healthy donor. Dilute heparinized blood with an equal volume of 1x PBS at room temperature (RT) and put it down slowly over Histopaque to obtain human peripheral blood mononuclear cells (PBMCS).   Add 20 ml of Histopaque (warmed to RT) to 50 ml conical tubes. Then slowly overlay 20 ml of the diluted blood mixture on top of the Histopaque. Centrifuge at 535 x g for 35 min at room temperature with the brake off.   Carefully remove the lymphocyte interface (white ring between the media and Histopaque) with a sterilized serological pipette and transfer to a new 50 ml conical tube (Figure 1).  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140729/20140729083705_9105.jpg Figure 1. A schematic representation of the result of the density gradient stratification (modified by dublinlisacoolsaet.wordpress.com)    Fill the tube with RT PBS to 50 ml and centrifuge at 470 x g for 7 min at room temperature with the brake on (acceleration: 5, deceleration: 5).   Put off the supernatant and re-suspend the cell pellet with 4 ml of Erylyse buffer and incubate at RT for 8 min.   Fill the tube with PBS to 50 ml and centrifuge at 470 x g for 7 min at RT with the brake on.   Resuspend the pellet in 10 ml of PBS, count with dead cell exclusion the PBMCs and centrifuge cell suspension at 470 x g for 10 min.   Isolate human CD14+ cells: Use human CD14+ magnetic microbeads according to the manufacturer’s instructions:   Put off the supernatant and re-suspend the cell pellet in 80 µl of Running Buffer per 2 x 107 total cells in a 50 ml conical tube.   Add 20 µl of CD14 Microbeads per 2 x 107 total cells.",
    "Mix well and incubate for 15 min in the refrigerator (2-8 °C).   Wash cells by adding 1 ml of Running Buffer per 107 cells and centrifuge at 470 x g for 10 min. Put off the supernatant.   Re-suspend up to 108 cells in 500 µl of Running Buffer.   Proceed to magnetic separation with the autoMACS separator.     Collect CD14+ cells, wash with 10 ml complete medium, resuspend the pellet in 10 ml of complete medium and count with dead cell exclusion. CD14+ cells should be 10-15% of PBMC (Figure 2).  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140729/20140729083756_3610.jpg Figure 2. Analysis of CD14+ cells after separation at day 0. A. Histogram: the black peak is the isotype control antibody, the white peak CD14+ cells; B. Dot plot.    Centrifuge at 470 x g for 8 min at room temperature with the brake on and put off the supernatant.   Re-suspend at 5 x 106 cells in 3 ml complete medium supplemented with 100 ng/ml of GM-CSF and 50 ng/ml of IL-4 and then culture cells in 6-well plate. Incubate cells at 37 °C and 5% CO2. (The cytokines are dissolved in DNase/RNase free water and diluted in complete medium.)   Day 3: Added 2 ml/well of fresh complete medium supplemented with 100 ng/ml of GM-CSF and 50 ng/ml IL-4.   Day 6: Monocytes are differentiating into immature dendritic cells, they are in suspension and so be careful when removing the plate from incubator. Take medium with cells out of the 6-well plate into a 50 ml tubes and centrifuge at 210 x g for 10 min at 4 °C. Put off the supernatant and re-suspend cells at 1 x 106 cells/ml in complete medium.",
    "Collect 1 x 105 cells into FACS tube and add 10 µl PE-anti-CD1a and 10 µl FITC-anti-CD14 antibodies for 20 min at 4 °C and then wash with FACS wash buffer at 470 x g for 5 min. Put off the supernatant and re-suspend cells in 200 µl and run samples on CyAn ADP flow cytometer. The percentage of CD1a+ cells should be higher than 90% as measured by flow cytometer analysis (Figure 3). Immature human derived-DC (iDC) are then ready for experimental use. If iDC population is between 70-90% they can be used for experiments, while if they are less than 70%, restart culture.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140729/20140729083917_4500.jpg Figure 3. A: expression of CD1a on iDC at day 6; B: expression of CD14 on iDC at day 6    Place 2 x 106 iDCs/well in a 6-well plate and incubate for 24 h in complete medium only or supplemented with 50 ng/ml TNF-α and 50 ng/ml IL-1β to generate mature DC (mDC).   Day 7: Flow cytometry procedure.   Put 6-well plate on ice for 10 min.   Harvest cells with a micropipette with a volume range from 100 µl and 1,000 µl and wash three times with 2 ml of refrigerated PBS. Transfer iDCs and mDCs in two different 15 ml tubes.   Centrifuge at 210 x g for 10 min, and then put off the supernatant.   Re-suspend them in 100 µl of PBS 1x and block non-specific sites with 5 µl rabbit IgG for 5 min at RT.   Divide cells into FACS tube and incubate with 10 µl fluorochrome-conjugated monoclonal antibody and isotype-matched negative controls for 20 min at 4 °C (The following mAbs were used: FITC-anti-CD83, PE-anti-CD80, APC-anti-CD40.).   Filled with 1 ml FACS wash buffer and centrifuge at 1,500 rpm for 5 min and put off the supernatant.",
    "Re-suspend cells in 200 µl 1x PBS and analyze samples on CyAn ADP flow cytometer.   Cells were gated according to their light scattering properties to exclude cell debris and contaminating lymphocytes, and no dead cells by propidium iodide positive cells exclusion. (Figure 4).  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140729/20140729083955_2644.jpg   Figure 4. A: Dot plot of FS and SS parameter to identify the iDCs; B: gate to exclude the dead cells. We analyzed the cells on gate R1 and gate R3."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}