{
  "id": 6559,
  "origin_website": "Bio",
  "title": "Visualizing Hypoxia in a Murine Model of <em>Candida albicans</em> Infection Using <em>in vivo</em> Biofluorencence",
  "procedures": [
    "Fungal growth and mouse preparation (Days 1-3)Start C. albicans liquid cultures by inoculation frozen stocks with a loop into 10 ml SC medium broth in a 50 ml tube and incubate for 20 h at 30 °C with shaking at a speed of 180 rpm.Take 10 μl of C. albicans culture from the previous day to 10 ml fresh SC medium in a 50 ml tube. Incubate the new mixture for an equivalent time period.At Day 3, count the cells in the cell counter and prepare a fresh subculture in 10 ml SC medium with a starting cell number of 5 x 107 cells/ml and let it grow for 3 h. Centrifuge the fungi at 3,000 x g, 10 min at room temperature and re-suspend in 1 ml 1x PBS and count the fungal cell number using a cell counter. Adjust the fungal concentration to 5 x 108 cells/ml and keep on ice if not used immediately. Calculation example: To prepare 1 ml of yeast suspension with a concentration of 5 x 108 cells/ml from a stock suspension of 8 x 108 cells/ml, add 625 μl of the stock suspension to 375 μl PBS.All mice are injected intraperitoneally with 100 μl HypoxiSense 680 dye (2 nmol/100 μl of HypoxiSense dye per mouse) 24 h before C. albicans subdermal infection.Subdermal infection (Day 4)Place the mouse in an anesthesia box and regulate the level of isoflurane gas to 2.5% on the GI-8 gas anesthesia system. Remove the mouse from the anesthesia box and gently place the mouse with its nose inside an isoflurane delivering cone.With the mouse anesthetized, shave the fur off the dorsal flank using the hair trimmer (Figure 1).Pull and hold the mouse skin over the shaved area with two fingers.",
    "Insert the syringe into the pulled skin and infect the mouse with 100 μl of the C. albicans inoculum prepared (5 x 107 cells). A small liquid bump under the animal skin will be visible for a few minutes.Treat and inject control animals in a similar way using 100 μl 1x PBS.Animals should be placed under a heating lamp until they are fully awake to assure their well-being.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190731/20190731210938_3545.jpgFigure 1. Schematic drawing on how to perform the subdermal infectionBiofluorescent imaging (Days 4-7)Anesthetize the mouse in the anesthesia box using a gas flow of 2.5% isoflurane and transfer them to the camera box of the IVIS imager. Place the mouse facing downwards in the chamber with each animal’s nose inside the cone that delivers the isoflurane.Select the IVIS filter setting that fit the emission and excitation wavelength of the dye (675 ex/720 em).Using guards to prevent signal bleeding from neighboring animals take a time-zero image of animals in both groups on Day 4 after the initial infection (Figure 2). Expose the animals for 0.5 s exposure capturing in vivo biofluorescence generated by the activity of HypoxiSense dye as a marker for hypoxia. In order to image 5 mice, select D field of view.Since the animals might remain under anesthesia for a long period, assure that they are placed under a heating lamp to prevent excessive cooling down of the animal until they are fully awake.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190731/20190731183821_8160.jpgFigure 2. Schematics of the experimental procedure. d: Day."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Microbiology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}