{
  "id": 6709,
  "origin_website": "Bio",
  "title": "Measurement of Chloroplastic NAD Kinase Activity and Whole Tissue NAD Kinase Assay",
  "procedures": [
    "Setting up a conventional in vitro NAD kinase assayProtein extractionGrind freshly detached leaves (200-400 mg) in liquid nitrogen with a mortar and pestle, and add 300 µl of the ice-cold protein extraction buffer (prepared immediately before use, Recipe 1).Note: Our laboratory normally uses three to four week-old rosette leaves, sampled midday. As NAD(P) metabolism could dynamically change during the phase transition from vegetative to reproductive growth (Hashida et al., 2016), be sure to prepare samples before bolting. We recommend at least three biological replicates and two technical replicates to obtain reliable results. Further disrupt leaf sample by ultrasonic processing for 10 s with output control 6 on ice. Repeat this step two times to thoroughly rupture chloroplasts.Note: According to manufacturer’s specifications of the equipment (UR-21P), output control 6 responds to 6 Watts. Ultrasonic frequency is 28 kHz and exponential horn has 2.5 mm diameter. After centrifugation at 14,000 x g, 4 °C for 10 min, transfer supernatant (i.e., crude extract) to a 1.5 ml microcentrifuge tube to remove sample debris.Remove NAD+, NADH, NADP+ and NADPH using ZebaTM Spin Desalting Columns by a 4 °C centrifugation at 14,000 x g for 2 min and collect the flow-through containing the extracted proteins in a new 1.5 ml microcentrifuge tube.Protein measurementPrepare the dye for the Bio-Rad Protein Assay by diluting 1 volume of the dye concentrate with 4 volumes of distilled, deionized (DDI) water.Add 2 and 5 µl of protein extracts into 198 and 195 µl diluted dye reagent, respectively.After 5 min, measure absorbance at 595 nm and estimate the protein concentration with the protein standard II (BSA) from the Bio-Rad Protein Assay Kit (0.2 to 2.0 mg/ml).NAD+ phosphorylation reactionMix the ingredients in a new 1.",
    "5 ml tube bellow in the following amounts:Extracted proteins, 10 µgReaction buffer (Recipe 2), 10 µl50 mM NAD+, 10 µl50 mM ATP, 10 µlIncubate the mixture at 30 °C for 30 min in a water bath.Terminate reaction by heating the sample at 95 °C for 2 min.After centrifugation at 14,000 x g, 4 °C for 5 min, use the supernatant for NADP measurement (designated here as “Measuring solution”).Setting up the chloroplastic NAD kinase assayNAD+ phosphorylation reactionFloat freshly prepared leaf discs in a 12-well plate on DDI water, and place the plate under dark for 1 h (dark acclimation).Note: Our laboratory uses only 12 leaf discs (with 4 mm diameter) per well to avoid cross-shading during light exposure (Figure 1). Transfer the plate under light (80 µmol photons/(s·m2)) and start a time-course for the termination of the reaction, by collecting two discs into a 1.5 ml microcentrifuge tube containing 80 µl of 0.2 N HCl (for the quantification of the oxidized form, NADP+), and another two discs into 80 µl of 0.2 N NaOH (for the quantification of the reduced form, NADPH).Note: Be sure to prepare blank controls (no leaf discs in the tube). Heat the sample for 2 min at 95 °C in a hot water bath, and thoroughly ram the discs by pestle. After adding 8 µl of 200 mM sodium-phosphate solution (pH 5.6), adjust pH between 5 and 6 with the appropriate volumes of 0.2 N NaOH or 0.2 N HCl.Note: Check the pH with a test paper. This pH adjustment usually requires 50 to 60 µl NaOH and HCl solution. After centrifugation at 14,000 x g, 4 °C for 5 min, use the supernatant for NADP measurement, designated here as the “Measuring solution”.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20191226/20191226181814_4232.jpgFigure 1.",
    "Leaf discs for the chloroplastic NAD kinase assayNADP measurementPreparing detection reagent for the NADP/NADPH-GloTM assayFor luminescence-based NADP detection, prepare the required amount of luciferin detection reagent (Recipe 3) before all the assays, and stored it at room temperature (approximately 23 to 25 °C). When you obtain the “Measuring solution” (see above), prepare the NADP/NADPH-Glo detection reagent just before use (Recipe 4).For the calibration curve, prepare the standard using 1 µM NADP+ and 1 µM NADPH. Add 0, 1, 2, 3, 4 and 5 µl of NADP+ or NADPH standard into a series of wells in a half area 96-well microplate and adjust the volume to 50 µl per well with each blank control.Transfer 50 µl of the measuring solution, which was obtained in the Steps A3d or B1d, into the other empty wells.Luminescence-based detection with NADP/NADPH-GloTM assayAdd 50 µl of the NADP/NADPH-Glo detection reagent to each well, and briefly shake plates on a microplate shaker (gently). Incubate for 20 min at room temperature (approximately 23 to 25 °C) in the dark.Detect and record luminescence using a GloMax Navigator System. Set the integration at 0.3 s per well.Note: Repeat the detection after 5 to 10 min and check whether the luminescence count was saturated or not. If the count was saturated, dilute the measuring solution and repeat the detection procedure to avoid underestimation."
  ],
  "subjectAreas": [
    "Plant Science",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}