{
  "id": 6154,
  "origin_website": "Bio",
  "title": "An Improved Method for Measuring Chromatin-binding Dynamics  Using Time-dependent Formaldehyde Crosslinking",
  "procedures": [
    "This version of crosslinking kinetic (CLKv2) analysis is a modified ChIP procedure that yields kinetic measurements for transcription factor binding to specific loci by fitting ChIP data obtained from cells treated with formaldehyde for different periods of time. Before the samples can be collected for kinetic analysis, control experiments should be completed to optimize experimental conditions; the schematic in Figure 1 outlines the general workflow for this process. In this protocol, the required yeast strains are described first (Procedure A), followed by the detailed procedure for CLK data collection (Procedure B). CLK data collection conditions should be validated and may need to be optimized as described in Figure 1. The control experiments used for optimizing the procedure rely on the basic CLK methodology and so are described afterward (Procedure D and E) to minimize redundancy; Procedure C details quantification of the overexpression factor needed for modeling of the data.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180211/20180211173352_2142.jpgFigure 1. CLKv2 workflow. Control experiments are performed to optimize the assay conditions before collection of CLK data and fitting to the CLK model.Yeast strain constructionFor the CLKv2 assay, two strains are used for the analysis of a TF of interest: a wild type (WT) strain and an overexpression (OE) strain. The overexpression strain is isogenic to the WT strain other than driving levels of the TF that are modestly higher (~3-5-fold) over the WT levels. Kinetic analysis of the WT and OE strains in parallel (described below) highly constrains fits of the data by revealing the mass action contribution to the increase in ChIP signal over time. The OE strain can be engineered by introducing into cells an additional copy of the TF gene on a plasmid or by integrating into the genome under control of the native promoter or an appropriate heterologous promoter.",
    "If the TF functions as a stable biochemical entity with more than one type of subunit, the OE strain ought to be engineered to drive balanced expression of each subunit, as for example, was done for the analysis of TFIIE (Zaidi et al., 2017). For a detailed description of OE strain and plasmid construction, see Poorey et al., 2013, Zaidi et al., 2017. To generate strains for kinetic analysis using an OE plasmid, transform WT S. cerevisiae cells in the strain background of interest with either the OE plasmid construct or an empty vector carrying the same selection marker. Select transformants on appropriate agar plates and restreak cells for single colonies. We typically use strains kept on plates for about one month at 4 °C; archive the WT and OE strains by storage at -80 °C using standard yeast glycerol stock methods (Amberg et al., 2005).CLK data collection As mentioned above, the experimental conditions required for analysis of a particular TF should be validated and may need to be optimized as described in Procedure D and E. This section describes the basic CLKv2 procedure as we optimized and recently described (Zaidi et al., 2017).Cell growth and cell sample collection  Inoculate duplicate 5 ml YPD primary cultures with a colony of the desired WT or OE yeast strains; incubate cultures overnight at 30 °C with shaking. Note: If starting the primary cultures in selective media, cells may need to grow for ~24 h instead of ~16 h to obtain enough material to start the larger cultures in the next step. The next day, dilute each primary culture in 450 ml of the desired selective media (SC media with appropriate amino acid drop-out) and incubate with shaking at 30 °C until the OD600 is ~0.8 (~1.3 x 107 cells).",
    "Pellet cells by spinning for 7 min at 4,230 x g and 4 °C in Nalgene centrifuge bottles using an SLA-3000 rotor and Sorvall RC 5B centrifuge.Note: Growing conditions for copper-inducible strains are outlined in Poorey et al., 2013. If the TF of interest is under the control of a GAL-inducible promoter, the cells should be grown in selective media with 2% raffinose until OD600 is ~0.8 is reached; then pellet and resuspend the cells in YEP + 2% galactose and incubate for an hour at 30 °C with shaking.Resuspend each cell pellet in 450 ml YPD (or desired media); incubate at 30 °C with shaking for about one hour until the OD600 is ~1.0 (~1.9 x 107 cells). While the cells are growing, prepare the glycine quench solution. For each time point, 440 ml of 3 M glycine pH 5 is needed. Thus, 4 L of glycine will be required to quench the eight time point samples for one time course; see Recipes for instructions. Pour 440 ml of the 3 M glycine solution into each of eight 500 ml Nalgene centrifuge bottles.Pellet cells as in Step 2, then resuspend cells in 90 ml YPD (or desired media). This step yields a cell suspension that is concentrated five-fold over the initial culture.Note: The cells are concentrated in this way so that in subsequent steps quenching of formaldehyde crosslinking can be made more efficient by dilution of the cell suspension as well as by addition of glycine. Add a 10 ml glass or plastic pipette to a Pipette-Aid; this will be used for removal of an aliquot of the cell suspension at the first time point.",
    "Place flasks with 90 ml culture on a stir plate with a stir bar on medium speed and rapidly add 14 ml 37% formaldehyde to a final concentration of 5%; immediately start the timer. One way to rapidly add formaldehyde is to invert a pre-measured 14 ml aliquot contained in a 15 ml disposable conical tube into the stirring cell suspension. If formaldehyde is added with a Pipette-Aid, then a second Pipette-Aid should be fitted with a 10 ml pipette beforehand for removal of the first time point aliquot.At 5 sec, 20 sec, 60 sec (1 min), 120 sec (2 min), 300 sec (5 min), 600 sec (10 min), 900 sec (15 min), and 1,200 sec (20 min) remove a 10 ml aliquot of crosslinked culture with a Pipet-Aid and 10 ml glass pipette and quench by quickly adding the cell aliquot to a bottle containing the prepared glycine solution; cap each bottle immediately after adding the cell suspension and invert a few times to mix.Pellet cells by spinning at 4 °C for 7 min at 4,230 x g using an SLA-3000 rotor and Sorvall RC 5B centrifuge.Resuspend each cell pellet in 50 ml 4 °C TBS + 300 mM glycine pH 5 and transfer to a 50 ml conical tube; spin for 5 min at 3,220 x g and 4 °C in an Eppendorf 5810 R benchtop centrifuge. Discard supernatant. Wash each cell pellet with 50 ml 4 °C TBS; pellet cells as in the previous step.Resuspend each cell pellet in 1 ml TBS at 4 °C and transfer each sample to a FastPrep tube. Pellet cells by spinning for 2 min at 4 °C and 16,000 x g in an Eppendorf 5810 R benchtop centrifuge. Discard supernatant.Note: Samples can be stored at -80 °C at this step.",
    "Isolation of fragmented chromatin samples  Resuspend each cell pellet in 600 μl 140 mM ChIP lysis buffer with protease inhibitors added. Add acid washed glass beads to each tube until just above the level of the liquid and screw cap on tightly.Bead-beat samples at 4.0 m/sec for 7 cycles, with 45 sec on and one minute off between cycles, using an MP FastPrep-24 Bead beater kept in the cold room. Poke a hole in the bottom of each FastPrep tube with a heated (using Bunsen burner flame) 18-gauge needle and then place each tube in a 13 x 100 mm glass tube. Spin for 3 min at 3,220 x g in an Eppendorf 5810 R benchtop centrifuge at 4 °C to transfer the liquid to the bottom of the glass tube.Briefly vortex the glass tubes containing the flow through material and transfer each cell suspension to an Eppendorf tube; place tubes on ice.Sonicate samples for 7 cycles with 5 pulses/cycle, 30% output, and 90% duty cycles using a Branson Sonifier 250 with microtip probe. Place tubes on dry ice between cycles. Note: By sonicating one sample after another for each of the 7 cycles, the samples will stay on dry ice long enough to keep them cool but not freeze. It may be necessary to alternate samples between wet and dry ice to keep the pellets from freezing if many samples are sonicated at once. The expected fragment size of the sonicated DNA is ~100-600 bp. The first time the experiment is performed, the size of the sonicated DNA should be checked by running samples on a 1% agarose gel with ethidium bromide followed by imaging with an appropriate system. Spin tubes for 5 min at 16,000 x g at 4 °C in an Eppendorf 5415C/D benchtop centrifuge.",
    "Remove the supernatant for each sample to a new 1.5 ml microcentrifuge tube; spin for 20 min at 16,000 x g at 4 °C in an Eppendorf 5415C/D benchtop centrifuge.Transfer each supernatant to a new 1.5 ml microcentrifuge tube and quantify protein with a Bradford assay using a 1 μg/μl bovine serum albumin standard and Bradford protein dye as recommended by the manufacturer of the Bradford reagent.Note: Samples can be stored at -80 °C at this step. Chromatin immunoprecipitation (ChIP) Set up ChIP reactions in microcentrifuge tubes with locking lids. For each time point sample, three tubes are needed: immunoprecipitation (IP), mock, and total (input). The IP is done in one step if antibody-conjugated beads are used (a) or two steps if the chromatin extract is incubated first with the antibody followed by incubation with Protein A beads (b).For antibody-conjugated beads: First prepare the beads used for the IP and mock samples. The IP beads have the desired antibody conjugated to them; the mock beads are either unconjugated beads of the same type used for the IP, or alternatively, if a tag is used for the TF of interest, chromatin from an otherwise identical untagged strain can be used with the same antibody conjugated beads used for the IP. Aliquot the total volume of beads required to process all the samples (45 μl/sample) by adding to a 1.5 ml microcentrifuge tube. Wash the beads three times with 1 ml 140 mM ChIP lysis buffer, with a quick spin in between washes to recover the beads (~6,000 x g for a few seconds). Resuspend the bead pellets in an equal volume 140 mM ChIP lysis buffer with protease inhibitors to make a 50% slurry. Aliquot 40 μl of the bead slurry into one tube for each IP and mock reaction.",
    "Add 1 mg of sample chromatin to each tube on ice and add 140 mM ChIP lysis buffer with protease inhibitors to bring the total volume to 500 μl. For the input samples, aliquot 0.1 mg of the sample chromatin to each tube. Store the input samples at -80 °C; place the IP and mock reaction tubes on a rotating shaker such as the Labquake rotisserie shaker overnight at 4 °C. For antibody incubation followed by bead incubation: For the IP samples, aliquot 1 mg of sample chromatin protein into each tube and add antibody for the TF of interest followed by 140 mM ChIP lysis buffer with protease inhibitors to bring the total volume to 500 μl. For the mock reactions, aliquot 1 mg of sample chromatin then 140 mM ChIP lysis buffer with protease inhibitors to bring the volume to 500 μl (no antibody added). For the input samples, aliquot 0.1 mg of the sample chromatin into each tube. Store the input samples overnight at -80 °C; place the IP and mock tubes on a Labquake rotisserie shaker overnight at 4 °C.Note: The amount of antibody added to the IP varies depending on its concentration and may need to be optimized before processing the CLK samples. Typically, ~5 μg antibody is used for ChIP with 1 mg sample chromatin protein.Skip to the next step if using antibody-conjugated beads. Prepare a 50% slurry of nSepharose Protein A beads in the same way the beads are prepared in Step 1a (Chromatin immunoprecipitation (ChIP)). Aliquot 40 μl of the bead slurry to a new tube for each IP or mock sample. Quick spin the chromatin samples in a benchtop microfuge and transfer each supernatant to a new tube with the nSepharose Protein A bead slurry.",
    "Incubate the chromatin-bead samples for 2 h at 4 °C with mixing as in Step 1.Quick spin tubes. Wash each bead pellet twice with 1 ml each of the following buffers; quick spin in a microfuge between washes:140 mM ChIP lysis buffer500 mM ChIP lysis bufferLiCl wash buffer1x TE pH 8Remove excess liquid after the last wash and add 75 μl ChIP elution buffer to each tube. Mix beads and elution buffer by tapping the tube several times. Incubate samples at 65 °C for 10 min.Quick spin tubes in a microfuge and transfer the supernatant to a new locking lid tube.Add another 75 μl aliquot of ChIP elution buffer to each bead pellet. Mix by flicking the tube as above. Incubate samples again at 65 °C for 10 min.Quick spin the tubes in a microfuge and combine the supernatants in one tube. Incubate samples overnight at 65 °C.Thaw the input samples for a minute or two on the bench. Add 150 μl ChIP elution buffer, mix by briefly vortexing, and incubate the tubes overnight at 65 °C along with the IP and mock samples.The next day, clean up the DNA samples using the QiaQuick PCR purification kit by following the instructions provided by the manufacturer. Briefly, first, add 750 μl Buffer PB to each tube; mix and apply 450 μl of the sample to a column, then spin for 2 min at 9,300 x g using an Eppendorf 5415D benchtop centrifuge at room temperature.Apply the remainder of sample to each column and spin as in the previous step.Apply 750 μl Buffer PE to each column; spin as in the previous step.Discard the flow-through and then spin each column again to remove all residual ethanol.",
    "Place each column in a new microcentrifuge tube then apply 50 μl of 55 °C DEPC H2O to each column. Let the tubes sit on the bench for 1-2 min, then spin as in the previous step. Discard columns and either freeze samples at -80 °C or immediately perform real-time PCR analysis.Real-time PCR quantitationA standard curve is generated from serial dilutions of the input sample, which is then used to determine the ChIP levels for the IP and mock samples. The relative ChIP signal, described below, can be calculated for each time point and plotted before model fitting the data. It is critical to quantify the ChIP signal using a standard curve; using the threshold cycle number directly (for example) to quantify ChIP levels will not provide an accurate estimate of the quantity of the ChIP material unless it accounts for the log relationship with input.First, make a dilution series of input chromatin. Thaw the input samples on the benchtop for a few minutes, then quick spin in a microfuge and place on ice. We refer to the undiluted input as ‘125x’; five-fold dilutions of this material are made to generate 25x, 5x, and 1x input samples for the real-time PCR standard curve. To make the 25x standard, take 2 μl of the undiluted input and add to 8 μl DEPC H2O. Mix, quick spin, and make a dilution of the 25x sample in the same way to yield a 5x sample. With the 5x sample, make a 1x sample in the same way. Keep dilutions of input chromatin on ice.Prepare the real-time PCR reaction mix by adding 10 μl iQ SYBR Green Supermix (2x) for each reaction and forward and reverse primers to a final concentration of 0.2 μM; adjust the volume to 19 μl with DEPC H2O.",
    "As described below, we run technical triplicates for each sample, and the standards are run in duplicate. Make enough mix for a control reaction containing no sample as well. Real-time PCR reactions are run in wells of plates designed for the instrument. Pipette 19 μl of the reaction mix into each well. There will be 17 wells required for each time point: 3 for each IP, mock, and 5x input and 2 for each of the four standards. See Figure 2 below for an example plate set-up.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180211/20180211174550_8742.jpgFigure 2. Template for real-time PCR plate for four time point samples. Each experimental sample is run in triplicate (rows A, C, E, and G) and each of the four standards is run in duplicate (rows B, D, F, H). The same master mix is used for each reaction and one well (H12) has no sample added as a negative control.Thaw the IP and mock samples, then quick spin in a microfuge and place on ice. Add 1 μl of sample to each well as indicated except for the control well. We include the 5x input sample as an unknown as well as a standard; its estimated value as an unknown establishes how well the standard curve captures the ChIP signal quantitatively. Seal the plate with film and spin for 3 min at 1,810 x g/4 °C in an Eppendorf 5810 R benchtop centrifuge.Run the plate in a MyiQ or related instrument using a protocol optimized for the primer set, and with a melting curve to verify that a single product species is generated. The standard quantities are set to values of 125, 25, 5, and 1.",
    "To determine the relative ChIP signal at each time point, subtract the average mock signal from the average IP signal and divide by the average estimated 5x input signal. Plot the average of two data sets for each time point along with the standard deviation. The average values will be used for the next step of model fitting. A representative plot is shown in Figure 3.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180211/20180211174930_9124.jpgFigure 3. Example CLKv2 data for the TATA-binding protein (TBP) interaction with the URA1 locus. The average relative ChIP signal of two biological replicates is shown for the WT (blue circles) and OE (red circles) strains versus formaldehyde crosslinking time; the error bars represent the standard deviation. This is the raw data used to generate the model fit in Figure 8B in Zaidi et al., 2017.Transcription factor overexpression value quantification The overexpression factor is the level of the TF in the OE strain relative to the WT strain and is required for fitting the CLKv2 model to the formaldehyde incubation time-dependent ChIP data. This section describes how to estimate the overexpression factor by performing Western blots using extracts from the WT and OE strains. Cell growth and cell sample collectionThis protocol is similar to the detailed instructions in Procedure B, Cell growth and cell sample collection, with changes to the cell culture volume and wash buffers used as indicated below. In addition, the formaldehyde crosslinking and quenching steps are not necessary and therefore not performed for this section.Inoculate each of two 5 ml YPD primary cultures with a colony of the desired WT and OE yeast strains; incubate cultures overnight at 30 °C with shaking. The next day, dilute each primary culture in 50 ml of the desired selective media and incubate with shaking at 30 °C until the OD600 is ~0.8.",
    "Pellet cells in 2 x 50 ml conical tubes by spinning for 5 min at 3,220 x g and 4 °C in an Eppendorf 5810 R benchtop centrifuge.Resuspend each cell pellet in 50 ml YPD (or desired media); incubate at 30 °C with shaking for about one hour until the OD600 is ~1.0. Pellet cells as in Step 2.Combine cell pellets for each sample and resuspend in 50 ml 4 °C TBS and transfer to a 50 ml conical tube; spin for 5 min at 3,220 x g and 4 °C. Discard supernatant. Wash cell pellets with 10 ml 4 °C Benoit’s buffer with protease inhibitors and β-mercaptoethanol; pellet cells as in the previous step.Resuspend cell pellets in 1 ml Benoit’s buffer (with protease inhibitors and β-mercaptoethanol) and transfer each sample to a FastPrep tube. Pellet cells by spinning for 2 min at 4 °C in an Eppendorf 5810 R benchtop centrifuge. Discard supernatant.Note: Samples can be stored at -80 °C at this step. Preparation of whole cell extract This protocol is similar to the detailed instructions in Procedure B, Isolation of fragmented chromatin extract samples, with changes to the cell pellet resuspension volume, the buffer used, and the omission of sonication.Resuspend cell pellets in 300 μl Benoit’s buffer with protease inhibitors and β-mercaptoethanol. Add acid washed glass beads to each tube until just above the liquid. Tap tubes on the lab bench a few times to remove air bubbles. Bead-beat samples for 7 cycles, with 45 sec on and one minute off between cycles, using an MP FastPrep-24 Bead beater kept in the cold room.Poke a hole in the bottom of each FastPrep tube with a heated (using Bunsen burner flame) 18-gauge needle and then place each tube in a 13 x 100 mm glass tube.",
    "Spin for 3 min at 3,220 x g at 4 °C to transfer the liquid to the bottom of the glass tube.Briefly vortex the glass tubes containing the flow through material and transfer each cell suspension to an Eppendorf tube. Place samples on ice for 30 min. Spin tubes for 5 min at 16,000 x g at 4 °C.Remove the supernatant for each sample to a new 1.5 ml microcentrifuge tube; spin for 30 min at 16,000 x g at 4 °C.Transfer each supernatant to a new 1.5 ml microcentrifuge tube and quantify protein with a Bradford assay as described in Procedure B.Note: Samples can be stored at -80 °C at this step. Quantification of TF levels by Western blotting Pour an SDS-PAGE denaturing gel of appropriate concentration (8-14%) with 30%/0.8% Bis-acrylamide solution.Run the SDS-PAGE gel using, for example, a Bio-Rad mini-PROTEAN tetra cell filled to the corresponding marking with SDS-PAGE running buffer. Load a 2x serial dilution of sample for each strain on the same gel starting with 20 μg; the other amounts loaded will be 10 μg, 5 μg, and 2.5 μg. Each sample is mixed with Laemmli loading buffer and heated for 5 min at 95 °C to denature proteins before loading. Run the gel at 120 V for an appropriate amount of time to resolve polypeptide bands in the size range of interest. Note: More blots may need to be performed with different dilutions if the factor overexpression value is high. Transfer proteins from the gel to an Immobilon-P (PVDF) membrane overnight in transfer buffer using a Bio-Rad mini trans-blot electrophoretic system (or a related system) at 30 V and 4 °C.Note: Visually inspect the membrane the next day before blocking to make sure the ladder has transferred onto the membrane.",
    "The next day, block the membrane with an appropriate solution. We typically use 5% nonfat milk/TBST for 1 h on a shaker at room temperature. Incubate the membrane with primary antibody, typically an hour or more, and then wash the blot 4 times in TBST for 5 min per wash.Incubate the membrane with secondary antibody (incubation time is typically 1 h but may need to be optimized depending on the antibody), and then wash 4 times in TBST for 5 min per wash.Note: An ECL-conjugated HRP-linked secondary antibody can be used for Western development on film. However, fluorescently labeled antibodies, such as those conjugated with Cy2/3/5, are preferred as the fluorescence intensity can be quantified directly and fluorescence imaging has a wider dynamic range than film. Mix 500 μl of Solution A and 500 μl of Solution B from the ECL-Prime kit and spread evenly over blot; seal blot in plastic and expose to film. Note: A fluorescent secondary antibody can also be used instead of the chemiluminescent secondary, such as provided with the ECL-Plex kit. In this case, the blot can be scanned and quantified using a Typhoon scanner or other fluorescence imaging system and a digital copy of the image is saved. Scan the film using a standard color scanner; save images as TIFF files. As Western blots are notoriously difficult to quantify, we typically perform and quantify multiple Western blot images with multiple film exposure times. It is also a good idea to run gels with a dilution series of the extract to assess how the detection system responds to known changes in the relative level of the TF on the blot.",
    "Using ImageJ software, open the TIFF image and quantify the protein band(s) of interest in each lane and normalize to a loading control by drawing a box around each band with the rectangular selection tool and measuring the intensity inside each box. Determine the overexpression factor by dividing the quantified OE band by the corresponding WT band; do this for each dilution and average the values to get one OE factor. We estimate the OE value by averaging the effects observed in at least two biological replicate sets of samples.Measure the effect of formaldehyde crosslinking on the levels of the TF in the soluble protein poolAn assumption in the CLK model is that the levels of the unbound TF do not change with increasing formaldehyde incubation time (Poorey et al., 2013). Before CLK analysis can be performed, it is therefore critical to measure the TF protein levels over the experimental time course to determine whether the TF is depleted from the nuclear pool of soluble proteins. Either whole cell extract or chromatin samples can be used; we’ve found for a number of TFs that either type of extract yields very similar results (Zaidi et al., 2017). The protocols for Procedure D and E are based on the CLKv2 data collection methods in Procedure B. Cell growth and cell sample collectionThis protocol is similar to the detailed instructions in Procedure B, Cell growth and cell sample collection, with changes to the cell culture volume and wash buffers used; a smaller volume is required for this optimization experiment and a different buffer is used for whole cell extract preparation.Inoculate each of two 5 ml YPD primary cultures with a colony of the desired WT yeast strain; incubate cultures overnight at 30 °C with shaking.",
    "The next day, dilute each primary culture in 300 ml of the desired selective media and incubate with shaking at 30 °C until the OD600 is ~0.8. Pellet cells by spinning for 7 min at 4,230 x g and 4 °C.Resuspend each cell pellet in 300 ml YPD (or desired media); incubate at 30 °C with shaking for about one hour until the OD600 is ~1.0. Prepare the glycine quench solution. 4 L of glycine will be required to quench the four time point samples in duplicate; see Recipes for instructions. Pour 440 ml of the 3 M glycine solution into each of 8 x 500 ml Nalgene centrifuge bottles.Pellet cells as in Step 2, then resuspend each pellet in 60 ml YPD (or desired media).Place each flask with 60 ml culture on a stir plate with a stir bar, then remove a 10 ml aliquot from each culture using a Pipet-Aid and glass pipette and quench in a bottle of 440 ml 3 M glycine for the zero minute control samples. Invert the bottles a few times to mix. Turn the stir bar speed to medium. To the remaining 50 ml culture, add 7.8 ml 37% formaldehyde, yielding a final concentration of 5%. At 5, 10, and 15 min (or other time points as needed), quickly remove a 10 ml aliquot of crosslinked culture and quench by adding to a 440 ml aliquot of glycine; cap and invert the bottle a few times to mix.Pellet cells by spinning at 4 °C for 7 min at 4,230 x g.Resuspend each cell pellet in 50 ml 4 °C TBS and transfer to a 50 ml conical tube; spin for 5 min at 3,220 x g and 4 °C. Discard supernatant.",
    "Wash cell pellets with 10 ml 4 °C Benoit’s buffer with protease inhibitors and β-mercaptoethanol; pellet cells as in the previous step.Resuspend cell pellets in 1 ml Benoit’s buffer (with protease inhibitors and β-mercaptoethanol) and transfer each sample to a FastPrep tube. Pellet cells by spinning for 2 min at 4 °C in an Eppendorf 5810 R benchtop centrifuge. Discard supernatant.Note: Samples can be stored at -80 °C at this step. Preparation of whole cell extract This section of the protocol is identical to the detailed instructions in Procedure C, Preparation of whole cell extract. Quantification of TF levels by Western blottingThis protocol is similar to the detailed instructions under Procedure C, Quantification of TF levels by Western blotting, except for the amount of sample loaded and quantification output.Run an SDS-PAGE denaturing gel of appropriate concentration (8-14%). Load 15 μg protein for each sample after mixing with Laemmli loading buffer and heating for 5 min at 95 °C to denature proteins. Run the gel at 120 V for an appropriate amount of time. Transfer proteins from the gel to an Immobilon-P (PVDF) membrane overnight at 30 V and 4 °C.The next day, block the membrane with an appropriate solution optimized for the antibody of interest. Incubate the membrane with primary antibody and then wash the blot 4 times in TBST for 5 min per wash.Incubate the membrane with secondary antibody (incubation time is typically 1 h but may need to be optimized depending on the antibody), and then wash 4 times in TBST for 5 min per wash.Mix 500 μl of Solution A and 500 μl of Solution B from the ECL-Prime kit and spread evenly over blot; seal blot in plastic and expose to film. Scan the film.",
    "Using ImageJ software, open the TIFF image and quantify the protein band(s) of interest in each lane and normalize to the zero minute time point and/or a loading control. We estimate the effects of formaldehyde incubation time on soluble TF levels by averaging the effects observed in at least two biological replicate sets of samples.Note: The relative change in protein level with crosslinking time will guide the implementation of the assay in the next steps. See Zaidi et al., 2017 for a range of results with different factors. If the protein of interest is not depleted with increasing formaldehyde incubation time, then the CLKv2 assay can be conducted using this concentration of formaldehyde and over this range of formaldehyde incubation times. Alternatively, if the protein of interest is depleted from extracts with increasing formaldehyde incubation time, the options are to test a different (reduced) concentration of formaldehyde and/or to confine the crosslinking time course to the period in which the factor is not depleted. If the formaldehyde concentration is reduced, effort should be made to determine the maximum usable concentration in order to maximize the crosslinking rate, such as treating cells with a titration of formaldehyde concentrations at a later time point to find the optimal condition. Validate the quenching conditionsCollection of order-of-addition samplesIt is important to verify that the quenching conditions quantitatively block formaldehyde crosslinking, and in this way ensure that the ChIP signals truly reflect the yield of crosslinked material following incubation with formaldehyde for a given time. We have found that the glycine quench protocol reported here effectively quenches 5% formaldehyde under the conditions described; the experiments in this section should be conducted to validate that this is true in your hands and under your specific conditions.",
    "This protocol is similar to the detailed instructions in Procedure B, Cell growth and cell sample collection, with changes to the cell culture volumes.Inoculate duplicate 5 ml YPD primary cultures with a colony of the desired WT yeast strain; incubate cultures overnight at 30 °C with shaking.The next day, dilute each primary cultures in 200 ml of the desired selective media and incubate with shaking at 30 °C until the OD600 is ~0.8. Pellet cells by spinning for 7 min at 4,230 x g and 4 °C as described above.Resuspend each cell pellet in 200 ml YPD (or desired media); incubate at 30 °C with shaking for about one hour until the culture OD600 is ~1.0. Prepare the glycine quench solution. 3 L of glycine will be required to quench the three time point samples in duplicate; see Recipes for instructions. Pour 440 ml of the 3 M glycine solution into each of 6 x 500 ml Nalgene centrifuge bottles. Pellet cells as in Step 2, then resuspend pellets in 60 ml YPD (or desired media). Transfer 10 ml culture into each of three 500 ml flasks. Place each flask on a stir plate with a stir bar on medium speed.Collect samples as follows:No formaldehyde: add the 440 ml glycine solution to one flask with 10 ml culture and mix for a few seconds; pour solution and cells back into the bottle, cap the bottle and invert a few times to mix thoroughly. This sample can remain on the bench at room temperature while the other samples are processed.Glycine before formaldehyde: to another flask containing a cell sample, add all 440 ml 3 M glycine pH 5 from the prepared bottle. Mix for a few seconds on a stir plate, then add 1.",
    "56 ml 37% formaldehyde (5% final concentration) and allow crosslinking to proceed for 8 min at room temperature on a stir plate. Pour the entire sample back into the bottle.Formaldehyde followed by glycine: to the last flask containing a cell sample, add 1.56 ml 37% formaldehyde (5% final concentration); mix by thoroughly swirling, and incubate on a stir plate for 8 min at room temperature. (The formaldehyde incubation time can be adjusted; 8 min is recommended here as it is in the regime in which the ChIP signal is typically still dependent on formaldehyde incubation time, i.e., not saturated, but incubation for several minutes is easy to handle with high temporal precision.) Add 440 ml 3 M glycine pH 5 to the sample and mix for a few minutes. Pour entire solution back into the bottle. Note: Two sets of samples are collected, but it is easiest to collect one set of samples first (a, b, c) and then the second set if both sets are collected on the same day.Pellet cells by centrifugation as in Step 2.Resuspend each cell pellet in 50 ml 4 °C TBS + 300 mM glycine pH 5 and transfer to a 50 ml conical tube; spin for 5 min at 3,220 x g and 4 °C. Discard supernatant. Wash each cell pellet with 50 ml 4 °C TBS; pellet cells as in the previous step.Resuspend each cell pellet in 1 ml TBS at 4 °C and transfer each sample to a FastPrep tube. Pellet cells by spinning for 2 min at 4 °C and 16,000 x g. Discard supernatant.Note: Samples can be stored at -80 °C at this step. Isolation of fragmented chromatin samples This section of the protocol is identical to the detailed instructions in Procedure B, Isolation of fragmented chromatin samples.",
    "Chromatin immunoprecipitation (ChIP)This section of the protocol is identical to the detailed instructions in Procedure B, Chromatin immunoprecipitation (ChIP).Real-time PCRThis protocol is identical to the detailed instructions under Procedure B, Real-time PCR quantification. To determine the relative ChIP signal at each time point, subtract the average mock signal from the average IP signal and divide by the average estimated 5x input signal. We typically plot the results as a bar graph and perform t-tests to assess statistically significant differences in comparing different samples. With an efficient quench, the ‘glycine only’ and ‘glycine before formaldehyde’ ChIP signals should be quantitatively indistinguishable (Figure 4).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180211/20180211180124_6653.jpgFigure 4. Representative results for an order-of-addition experiment. G = glycine only, GF = glycine quench followed by formaldehyde addition, FG = formaldehyde crosslinking followed by glycine quench. In this example, the relative ChIP signal was calculated following immunoprecipitation of the Gal4 protein and real-time PCR readout for interaction at the GAL3 locus. Error bars represent the standard deviation from two biological replicates."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}