{
  "id": 6694,
  "origin_website": "Bio",
  "title": "Analysis of Monosaccharides from <em>Arabidopsis</em> Seed Mucilage and Whole Seeds Using HPAEC-PAD",
  "procedures": [
    "Growth of seeds for HPAEC analysisGrowing seeds correctly for HPAEC analysis is critical as mucilage release is impaired if seeds do not complete development. It is very important to use standard growth conditions, grow wild type and mutants together, and water until seed development is complete as described below. In addition, see the Notes for details on preparation of biological replicates.Sow seeds of all genotypes onto Arabidopsis AT medium with agar in Petri dishes. Seeds do not need to be sterilized as this medium does not contain sugar.Seal plates with micropore tape.Place in growth chamber 20 °C under continuous light (100-150 μmol/(s m2) photosynthetically active radiation, PAR).Transplant the seedlings after 7-10 days.Prepare one 12 cm pot of soil mix for each genotype (see Notes).Add 30 ml of AT medium without agar to the top of the soil.Use forceps to transplant 8 seedlings from each genotype into one pot of soil.Cover with plastic wrap to maintain humidity.Return to the growth chamber.Remove plastic wrap after 3-4 days.Once the plants have bolted (3-4 weeks), gather the inflorescence stems of all eight plants in each pot and tie them to a bamboo skewer stake using aluminum foil.Water plants until the last siliques are yellow and beginning to dry out.Harvest seeds, and pool seeds of the same genotype together. Be sure to remove all chaff from the seeds. This can be done using a small sieve (being careful to clean it between different seed batches) or by collecting seeds on rough paper (e.g., Whatman 3MM paper) then tilting and gently shaking the paper so that healthy seeds roll onto a second piece of paper leaving the chaff and undeveloped seeds behind. Seeds can be transferred several times between the two pieces of paper until the seeds are free of chaff.",
    "Preparation of Arabidopsis seed extruded mucilage. Wear chemical-resistant gloves and a lab coatDetermine optimal mucilage release for mature seeds hydrated in aqueous solution.Place approximately 50 seeds per genotype (including wild type) into separate 2 ml tubes.Add 1 ml of ultrapure water, and vortex on maximum speed for 5 s to wet seeds.Place tubes in a box large enough for the tubes to roll around freely and place on an orbital shaker at 130 rpm.After 1 h shaking, remove the tubes, place upright in a tube rack and allow the seeds to settle for 1-2 min.Using a plastic Pasteur pipette, remove and discard as much water as possible without disturbing the seeds.Add 1 ml of 0.01% ruthenium red solution and return the tubes to the box on the shaker at 130 rpm.After 1 h, remove the tubes to the rack, allow the seeds to settle for 1-2 min, then remove and discard the ruthenium red as before.Note: Do not let the seeds dry out as once they are stained, the mucilage will not rehydrate to form a halo around the seed. Add 0.5 ml of ultrapure water and transfer the seeds to cavity slide (no need for cover slips).View the seeds using the compound microscope at low magnification (5x) and determine if mucilage is efficiently released using water by comparing halo size between wild-type controls and genotypes of interest [Figure 1, compare wild type (A) with mum2 (B)].If mucilage is not released efficiently using water, repeat the entire process using sodium carbonate solution instead of water. Many genotypes e.g., mum2, will release more mucilage in sodium carbonate than in water [Figure 1, compare mum2 in water (B) with mum2 in sodium carbonate (D). Wild type treated with sodium carbonate (C) is included for comparison].",
    "It is important to determine the minimum concentration of sodium carbonate that will allow efficient mucilage release, as sodium ions interfere with HPAEC-PAD detection of monosaccharides. Mucilage is released from mum2 using 20 mM sodium carbonate. It may also be useful to compare the composition of mucilage released using water with mucilage released with sodium carbonate.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20191216/20191216223351_7875.jpgFigure 1. Mucilage release after treatment with water in wild type (A) and mum2 (B), and after treatment with 20 mM sodium carbonate in wild type (C) and mum2 (D). Scale bars = 500 μm.Note: Non-adherent mucilage has been removed during the staining procedure.Once optimal release of mucilage has been determined, proceed to either Step B2. (Preparation of extruded mucilage in water) or B3 (preparation of extruded mucilage in sodium carbonate) below.Preparation of extruded mucilage in water. Use seeds grown as described in A, and record the batch.Prepare 4 replicates for each genotype by weighing out approximately 20 mg of seed per replicate. Record the exact weight of each replicate.Place each replicate into a 2 ml tube and add 1.4 ml of ultrapure water. Make sure all seeds are suspended in the solution rather than floating on the surface by vortexing for 5 s.Add 5 μl of 5 mg/ml meso-Erythritol internal standard.Prepare the samples for vortexing by taping a plastic box onto a vortex mixer 3-inch platform and fill it with tubes laid on their sides, with all tubes in the same orientation. Fill the box with bubble wrap and tape it in place securely to ensure the tubes do not move. See Notes for further details on mucilage removal.Vortex for 2 h on the “vortex #3” setting of the vortex mixer.While the samples are vortexing, prepare the standards (see Notes for important technical considerations).",
    "New standards must be prepared, processed, and run with each set of samples.Dilute the 100 mM monosaccharide stock to 2 mM and then make a serial dilution to give 1 mM, 0.5 mM, 0.25 mM, 0.125 mM, 0.0625 mM solutions, to give a total of 6 sugar standards (see Recipes).Transfer 0.5 ml of each sugar standard to a KIMAX tube.Add 5 μl 5 mg/ml meso-Erythritol to each standard.Remove the samples from the vortex mixer, place in a tube rack and allow seeds to settle for 1-2 min. Do not centrifuge as mucilage will pellet.Remove 1 ml of the mucilage-containing supernatant to a KIMAX tube. See Notes for proper cleaning of tubes.After mucilage removal, stain the seeds with ruthenium red, as described in Steps B1e-B1i, and photograph to record how much mucilage was removed.Using the Reacti-Vap, dry the samples and the standards (in batches) under a stream of N2 gas at 60 °C. Once dry, the tubes can be capped and stored at -20 °C if required.In the fume hood, wearing safety glasses, add 17.4 μl 72% sulfuric acid to each sample and standard, and cap the tubes.Incubate samples and standards on ice for 2 h, mixing every 30 min by vortexing on maximum for 5-10 s.In the fume hood, add 482.6 μl of ultrapure water to give a final concentration of 4% sulfuric acid.Tighten the caps and autoclave at 121 °C (15 psi/1 Bar/1 ATM) for 1 h.Remove from autoclave and allow to cool.In the fume hood, transfer samples into clean 1.5 ml tubes, and centrifuge at 16,000 x g for 1 min to pellet debris.Filter the samples and standards into clean 1.5 ml tubes using 1 ml syringes and 0.45 μm nylon syringe filters.",
    "Wrap the junction between the syringe and the filter with a Kimwipe in case it “pops”.Note: If the sample is very difficult to filter then the filter is blocked and should be replaced. Load 200 μl of each sample into HPLC vials with caps and septa. Samples and standards can be stored at -20 °C in HPLC vials or 1.5 ml tubes to prevent growth of microbes.Preparation of extruded mucilage in sodium carbonate. The protocol described here is for extrusion of mucilage in 20 mM sodium carbonate. If a different concentration is used, the amount of 72% sulfuric added should be to be adjusted, as some carbonate will react with sulfuric acid and alter the final concentration. See Notes for more details. Use seeds grown as described in A, and record the batch.Prepare 4 replicates for each genotype by weighing out approximately 20 mg of seed per replicate. Record the exact weight of each replicate.Place each replicate into a 2 ml tube and add 1.4 ml 20 mM sodium carbonate. Make sure all seeds are suspended in the solution rather than floating on the surface by vortexing for 5 s.Add 5 μl of 5 mg/ml meso-Erythritol internal standard.Prepare the samples for vortexing by taping a plastic box onto a vortex mixer 3-inch platform and fill it with tubes laid on their sides, with all tubes in the same orientation. Fill the box with bubble wrap and tape it in place securely to ensure the tubes do not move. See Notes for further details on mucilage removal.Vortex for 2 h on the “vortex #3” setting of the vortex mixerWhile the samples are vortexing, prepare the standards (see Notes for important technical considerations). New standards must be prepared, processed, and run with each set of samples.",
    "Dilute the 100 mM monosaccharide stock to 2 mM and then make a serial dilution to give 1 mM, 0.5 mM, 0.25 mM, 0.125 mM, 0.0625 mM solutions, to give a total of 6 sugar standards (see Recipes).Transfer 0.5 ml of each sugar standard to a KIMAX tube.Add 5 μl 5 mg/ml meso-Erythritol and 1 ml 20 mM sodium carbonate. If a different concentration of sodium carbonate is used for mucilage extraction, the amount added here should be adjusted to be the same as in the 1 ml of sample removed in Step B3h below.Remove the samples from the vortex mixer, place in a tube rack and allow seeds to settle for 1-2 min. Do not centrifuge as mucilage will pellet.Remove 1 ml of the mucilage-containing supernatant to a KIMAX tube. See Notes for proper cleaning of tubes.After mucilage removal, stain the seeds with ruthenium red, as described in Steps B1e-B1i to record how much mucilage was removed.Using the Reacti-Vap, dry the samples and the standards (in batches) under a stream of N2 gas at 60 °C. Once dry, the tubes can be capped and stored at -20 °C if required.In the fume hood, wearing safety glasses, add 19.07 μl of 72% sulfuric acid to each sample and standard, and cap the tubes.Incubate samples and standards on ice for 2 h, mixing every 30 min by vortexing on maximum for 5-10 s.In the fume hood, add 480.9 μl of ultrapure water to give a final concentration of 4% sulfuric acid.Tighten the caps and autoclave at 121 °C (15 psi/1 Bar/1 ATM) for 1 h.Remove from autoclave and allow to cool.In the fume hood, transfer samples into clean 1.5 ml tubes, and centrifuge at 16,000 x g for 1 min to pellet debris.Filter the samples and standards into clean 1.",
    "5 ml tubes using 1 ml syringes and 0.45 μm nylon syringe filters. Wrap the junction between the syringe and the filter with a Kimwipe in case it “pops”.Note: If the sample is very difficult to filter then the filter is blocked and should be replaced. Load 200 μl of each sample into HPLC vials with caps and septa. Samples and standards can be stored at -20 °C in HPLC vials or 1.5 ml tubes to prevent growth of microbes.Preparation of Alcohol Insoluble Residues (AIR) from mature whole seeds. Use seeds grown as described in A, and record the batchPrepare 4 replicates for each genotype by weighing out approximately 20 mg of seed per replicate. Record the exact weight of each replicate.Homogenize seeds with one of the following techniques:Place each replicate into a 1.5 ml tube and freeze the seeds in 1.5 ml tubes in dry ice. Cool pestles and mortars with dry ice, and grind the frozen seeds to a fine powder, then transfer the frozen powder back to a 1.5 ml tube and store on dry ice. This procedure gives very good results but is time-consuming.Place each replicate into a 2 ml screw-capped tube with three to five 2 mm zirconia beads, freeze on dry ice and disrupt in a tissue homogenizer at 6,500 rpm for 20 s. It is important to choose tubes that will not break in the tissue homogenizer.Add 1 ml 70% (v/v) ethanol to the tubes containing the frozen, ground seeds, and resuspend the tissue fully by vortexing. If grinding was done with a pestle and mortar, add three to five 2 mm zirconia beads to the tube to help to resuspend the tissue.Incubate at 65 °C (use the heat block in the Reacti-Vap) for 10 min.",
    "Vortex the samples in a box attached to the vortex mixer (as described in Step B2d) for 10-15 min to solubilize metabolic sugars.Centrifuge at 16,000 x g for 15 s. Do not spin for longer or the pellet will become hard to resuspend.Remove the supernatant, and replace with 1 ml fresh 70% (v/v) EtOH in ultrapure water.Vortex for 10-15 min and centrifuge again, as described above.Remove the supernatant, and replace with 1 ml 80% (v/v) HPLC-grade MeOH in ultrapure water.Vortex for 10-15 min and centrifuge again, as described above.Remove the supernatant, and replace with 1 ml 100% HPLC-grade MeOH.Vortex for 10-15 min and centrifuge again, as described above.Remove the supernatant, and replace with 1 ml fresh 100% HPLC-grade MeOH.Vortex for 10-15 min and centrifuge again, as described above.Remove the supernatant, and replace with 1 ml 100% HPLC-grade acetone.Vortex for 10-15 min and centrifuge again, as described above.Remove the supernatant, and replace with 1 ml fresh 100% HPLC-grade acetone.Vortex for 10-15 min and centrifuge again, as described above. Remove most of the acetone, leaving a small amount which can be used to resuspend the pellet by vortexing briefly.Using a micropipette, transfer the resuspended pellet (in acetone) to a clean 2 ml tube, leaving the beads behind.Dry the AIR by leaving the tubes open in the fume hood. Acetone will evaporate quickly, leaving a light brown AIR pellet.Weigh the resulting AIR (there should be over 3 mg of AIR) and record the exact weight, and then transfer the AIR to a KIMAX tube.Add 20-30 1 mm zirconia beads to each tube, cap the tubes, and vortex briefly to break the pellet into powder. The beads will also help with mixing samples in sulfuric acid.",
    "Add 500 μl of 100% HPLC-grade acetone and 20 μl of 5 mg/ml meso-Erythritol to each sample and dry under a stream of N2 gas at 60 °C using the Reacti-Vap. Acetone helps to evaporate the water, leaving a less clumped pellet than evaporating 20 μl of water alone.Prepare the standards (see Notes for important technical considerations). New standards must be prepared, processed, and run with each set of samples.Dilute the 100 mM monosaccharide stock to 2 mM and then make a serial dilution to give 1 mM, 0.5 mM, 0.25 mM, 0.125 mM, 0.0625 mM solutions, to give a total of 6 sugar standards (see Recipes).Transfer 0.5 ml of each sugar standard to a KIMAX tube.Add 5 μl of 5 mg/ml meso-Erythritol to each tube.Using the Reacti-Vap, dry standards under a stream of N2 gas at 60 °C using the Reacti-Vap.Once dry, the tubes containing standards and samples can be capped and stored at -20 °C if required.In the fume hood, wearing safety glasses, add 70 μl of 72% sulfuric acid to each sample, and 17.4 μl of 72% sulfuric acid to each standard, and cap the tubes.Incubate samples and standards on ice for 2 h, mixing every 30 min by vortexing for 5-10 s.In the fume hood, add 1.93 ml of ultrapure water to the samples, and 482.6 μl to the standards, to give a final concentration of 4% sulfuric acid.Tighten the caps and autoclave at 121 °C (15 psi/1 Bar/1 ATM) for 1 h.Remove from autoclave and allow to cool.In the fume hood, transfer samples into clean 1.5 ml tubes, and centrifuge at 16,000 x g for 1 min to pellet debris.Filter the samples and standards into clean 1.5 ml tubes using 1 ml syringes and 0.45 μm nylon syringe filters.",
    "Wrap the junction between the syringe and the filter with a Kimwipe in case it “pops”.Note: If the sample is very difficult to filter then the filter is blocked and should be replaced. Load 200 μl of each sample into HPLC vials with caps and septa. Samples and standards can be stored at -20 °C in HPLC vials or 1.5 ml tubes to prevent growth of microbes.Separation and quantification of monosaccharides using high performance anion-exchange chromatography coupled with pulsed amperometric detection (HPAEC-PAD) using a CarboPac PA1 Guard and Analytical column at 25 °CSeparation of acid sugars.Use a constant eluant flow rate of 0.4 ml/min.Equilibrate the column with 10% 1 M NaOH, 1% 1 M sodium acetate, and 89% ultrapure water for 10 min.Independently inject 10 μl of each sample and standard.Separate acid sugars using a 30-minute linear gradient reaching 40% 1 M sodium acetate, and keeping the 1 M NaOH constant (Figure 2).Clean the column with a linear gradient of 1 M NaOH that reaches 30% over 10 min, while decreasing 1 M sodium acetate to 1% (Figure 2).Re-equilibrate the column for 10 min with the eluents at their starting concentrations for 10 min (10% 1 M NaOH, 1% 1 M sodium acetate, and 89% ultrapure water) before injection of the next sample (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20191216/20191216223455_2307.jpgFigure 2. Eluent gradient for the separation of acid sugarsSeparation of neutral sugars.Use a constant eluant flow of 1 ml/min.Equilibrate the column with 100% ultrapure water for 10 min, and start the post column pump which supplies 200 mM NaOH to the detector for post-column separation of monomeric neutral sugars.Inject 10 μl of each sample.Elute the neutral sugars with 100% ultrapure water for 35 min with post column detection.Clean the column for 10 min with 20% 1 M NaOH.",
    "Re-equilibrate the column with a 10-min rinse of 100% ultrapure water before next injection.Peak integration and data export from Chromeleon.View the files produced in Chromeleon (see examples in Figures 3 and 4).Manually integrate chromatographs, keeping the limits of the peaks in the samples at similar retention times as the limits of the peaks in the standards. Baselines for the meso-Erythritol internal standard and peak of interest (GalA) should have a flat baseline; adjust baseline with the vertical/horizontal tool from the Chromeleon tool ribbon. Save changes to peak integrations.Export values for area under the curve from the integration tab in the Chromeleon software to Excel.Before running further analysis, make sure that the standards show linear response, i.e., for any given monosaccharide, the peak area for the 1 mM standard should be exactly half of the 2 mM standard, and so on. This can be tested by plotting peak area vs. concentration of the standards in Excel and performing linear regression. The intercept should be close to 0 and R2 close to 1 to ensure accurate quantification.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20191216/20191216223521_6433.jpgFigure 3. Separation of neutral sugars (Ara, Rha, Gal, Glu, Xyl, Man) with the CarboPac PA1 analytical column. Fuc is not detectable in this sample but has a retention time of approximately 5.5 min.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20191216/20191216223541_1468.jpgFigure 4. Separation of acid sugars (GalA) with the CarboPac PA1 analytical column"
  ],
  "subjectAreas": [
    "Plant Science",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}