{
  "id": 15183,
  "origin_website": "Jove",
  "title": "Enhanced Yeast One-hybrid Screens To Identify Transcription Factor Binding To Human DNA Sequences",
  "procedures": [
    "1. Preparations\nSc −U −H plates (150 mm Petri dishes) \nNOTE: These plates will be used for growing the DNA-bait yeast strains. \n\t\nDissolve the drop-out mix, yeast nitrogen base (YNB), adenine hemisulfate, and ammonium sulfate in 920 mL of water, and pH to 5.9 with 5 M NaOH (approximately 1 mL per liter of media; see Table 2 for composition). Pour into a 2 L flask and add a stir bar.\nIn a second 2 L flask, add the agar to 950 mL of water (do not add a stir bar as it will cause the agar to boil over in the autoclave). \nAutoclave for 40 min at 15 psi on a liquid cycle. \nImmediately pour the contents of the first flask, including the stir bar, into the agar containing flask. Add the glucose, mix well on a stir plate, and cool to 55 °C in a water bath. \nAdd the leucine and the tryptophan to the media. Mix well on a stir plate and pour into 150 mm sterile Petri dishes (~80 mL per dish). Dry for 3–5 days at room temperature, wrap in plastic bags, and store at room temperature for up to 6 months. \nYAPD rectangular plates\nNOTE: These plates will be used for growing the lawn for the DNA-bait strain and for mating with the TF array collection.\n\t\nDissolve powders (see Table 3 for composition), except for agar, in 950 mL of water in a 2 L flask and add a stir bar.\nIn a second 2 L flask, add the agar to 950 mL of water (do not add a stir bar as it will cause the agar to boil over in the autoclave).\nAutoclave for 40 min at 15 psi on a liquid cycle.",
    "Immediately pour the contents of the first flask, including the stir bar, into the agar containing flask.\nAdd the glucose, mix well on a stir plate and cool to 55 °C. Pour media into the rectangular plates (see Table of Materials; ~70 mL per plate) using a peristaltic pump (5 mL/sec) and a 6 mm tubing. Dry for 1 day at room temperature, wrap in plastic bags, and store in the cold room for up to 6 months. \n\t\tNOTE: Although the suggested media volume is 70 mL per plate, 50–80 mL per plate can be used. The three critical issues to consider when pouring plates are 1) that they are leveled so that the agar media has the same thickness throughout the plate (use a leveled table or surface for plate pouring and do not pour in stacks of more than seven plates), 2) to ensure the absence of bubbles in the agar media (bubbles should be popped using a sterile needle), and 3) drying the plates for only one day and wrapping the plates in plastic bags to avoid failures in pinning yeast.\nSc −Trp and Sc −U −Trp rectangular plates \nNOTE: These plates will be used for growing the TF array collection (Sc −Trp) and to select diploid yeast after mating (Sc −U −Trp).\n\t\nDissolve the drop-out mix, YNB, adenine hemisulfate, and ammonium sulfate in 920 mL of water, and pH to 5.9 with NaOH 5M (approximately 1 mL per liter of media) (see Table 4 for composition). Pour into a 2 L flask and add a stir bar. \nIn a second 2 L flask, add the agar to 950 mL of water (do not add a stir bar as it will cause the agar to boil over in the autoclave).",
    "Autoclave for 40 min at 15 psi on a liquid cycle. \nImmediately pour the contents of the first flask, including the stir bar, into the agar containing flask. Add the glucose, mix well on a stir plate, and cool to 55 °C. \nAdd the leucine, histidine, and uracil (omit the uracil for the Sc −U −Trp plates). \nMix well on a stir plate and pour into rectangular plates (~70 mL per plate) using a peristaltic pump (5 mL/sec) and 6 mm tubing. Dry for 1 day at room temperature, wrap the plates in plastic bags, and store in the cold room for up to 3 months. \nSc −U −H −Trp + 3AT + X-gal rectangular plates\n\t​NOTE: These plates will be used as readout plates for eY1H assays.\n\t\nDissolve the drop-out mix, YNB, adenine hemisulfate, and ammonium sulfate in 850 mL of water (see Table 5 for composition). Do not pH. Pour into a 2 L flask and add a stir bar. \nIn a second 2 L flask, add the agar to 850 mL of water (do not add a stir bar as it will cause the agar to boil over in the autoclave). \nAutoclave for 40 min at 15 psi on a liquid cycle.\nPrepare 10x BU salts (1L) by combining 900 mL of water, 70 g of Na2HPO4∙7H2O, and 34.5 g of NaH2PO4∙H2O. Mix using a stir bar to dissolve powders and adjust the pH to 7.0 using 5 M NaOH. Add water to bring to 1 L and autoclave.",
    "Prepare the X-gal solution by adding 3.5 g of X-gal powder to a 50 mL plastic tube containing 42.5 mL of dimethyl formamide. Add X-gal powder to dimethyl formamide to dissolve more easily (this takes 30 min). Keep stock solution in the dark (either use opaque 50 ml tube or cover in foil). Store at -20 °C.\nImmediately pour the contents of the first flask, including the stir bar, into the agar containing flask. Add the glucose and the 10x BU salts (see Table 5 for composition), mix well on a stir plate, and cool to 55 °C. \nAdd the leucine, 3AT, and X-gal (see Table 5 for composition). \nMix well on a stir plate and pour into the rectangular plates (~70 mL per plate) using a peristaltic pump (5 mL/sec) and a 6 mm tubing. Dry for 1 day at room temperature, wrap in plastic bags, and store in the cold room covered in aluminum foil (3AT and X-gal are light sensitive) for up to 1 month. \n2. Spotting a TF array\nThawing the TF-prey array\nThaw the yeast glycerol stock plates with the TF-prey array on ice. \n​NOTE: TF-prey arrays can be generated as previously published10,12,13,18.\nResuspend the yeast using a 12-channel pipette within 1–3 min before the next step. \nSpotting the yeast into Sc −Trp rectangular plates\nIn the HDA robot (see Table of Materials), select multi-well 96 plates as source, 96 agar plates as target, and 96 long pin pads. \n​NOTE: Pin pads are not reusable and should be discarded.\nSelect the Replicate Many program to make two copies per 96-well plate. Do not use the recycle or revisit options to avoid back contamination of the frozen stocks. \nSelect the option to swirl up and down in the source to mix the yeast.",
    "Bag the spotted array and incubate agar-side up at 30 °C for 2–3 days. \nGenerating 384 colony arrays in Sc −Trp rectangular plates\nIn the robot, select 96 agar plates as source, 384 agar plate as target, and 96 short pin pads. \nSelect the 1:4 Array program. In this way, four 96 colony plates (each containing a different TF) will be consolidated into one 384 colony plate. Do not use the recycle or revisit options to avoid contamination between different plates.\nBag the plates and incubate the spotted 384-colony array agar-side up at 30 °C for 2 days.\nGenerating 1,536 colony arrays in Sc −Trp rectangular plates\nNOTE: This will result in arrays containing four colonies for each TF-prey.\n\t\nIn the robot, select 384 agar plates as source, the 1,536 agar plates as target, and 384 short pin pads. \nSelect the 1:4 assay single source program. The goal is to copy each colony into four colonies to obtain quadruplicates. Use the recycle and revisit options as it involves copying four times each colony. \nBag the plates and incubate the spotted 1536-colony array agar-side up at 30 °C for 3 days.\nAmplifying the 1,536 colony array in Sc −Trp rectangular plates\nIn the robot, select 1,536 agar plates as source, 1,536 agar plates as target, and 1,536 short pin pads. \nSelect the Replicate Many program to replicate 3–4 copies. Use the recycle and revisit option, but throw out the pad when switching to a different plate of the array to avoid cross contamination. \nBag the plates and incubate the spotted 1536-colony array agar-side up at 30 °C for 3 days to use for mating steps (see below). After that, keep the plates at room temperature and copy again after 7 days for a new round of screening.\n3. eY1H screen",
    "Preparing DNA-bait strain lawns for mating\nSpot the yeast DNA-bait strains on a Sc −U −H plate and grow for 3 days at 30 °C. \nStreak the yeast into a 15 cm Sc −U −H plate using a sterile toothpick, so that each plate fits 12–16 different strains. Incubate one day at 30 °C.\nStreak the yeast into a 15 cm Sc −U −H plate using a sterile toothpick, so that each plate fits 4 different strains. Incubate for one day at 30 °C.\nScrape the yeast using a sterile toothpick, making sure not to scrape any agar and add into a 1.5 tube with 500 µL of sterile water. \nAdd 10–15 sterile glass beads onto a YAPD rectangular plate. Add the yeast suspension onto the plate and shake thoroughly in all directions for 1 min to ensure the yeast is spread through all the plate.\nInvert the plate immediately and tap so that the beads go to the lid. Remove and recycle the beads. \nBag the plates and incubate agar-side down for 1–2 days at 30 °C. Then proceed to the mating step.\nMating of yeast DNA-bait and TF array strains\nTransfer the TF array to a YAPD rectangular plate with the robot. Select the 1,536 agar plate as source and target, and the 1,536 short pin pad. Select the Replicate Many program. Each TF array plate can be used to transfer to 3–4 YAPD plates (depending on the number of plates in the array). The TF array plates used for mating must be 2–3 days old but not more as mating may be inefficient.",
    "Transfer the lawn of a DNA-bait strain to the YAPD plates already containing the TF array with the robot. Select the 1,536 agar plate as source and target, and the 1,536 short pin pad. Select the Replicate Many program. Use a random offset in the source with a radius of ~0.6 mm to avoid taking yeast from the same spot, and mix on target to facilitate contact between yeast strains. Use the lawn containing the DNA-bait strains (section 3.1) as source, and the YAPD plates containing the TF array spotted in step 3.2.1 as target.\nBag the plates and incubate agar-side up at 30 °C for 1 day.\nSelection of diploid yeast\nTransfer the mated yeast from the YAPD plates to Sc −U −Trp plates with the robot. Select the 1,536 agar plate as source and target, and the 1,536 short pin pad. Select the Replicate program. Mix on source and on target.\nBag the plates and incubate agar-side up at 30 °C for 2–3 days (longer incubation leads to high background reporter activity).\nTransfer to readout plates\nTransfer the diploid yeast from the Sc −U −Trp plates to the readout rectangular plates Sc −U −H −Trp + 5mM 3AT + 0.4 mM X-gal using the robot. Select the 1,536 agar plates as source and target, and the 1,536 short pin pad. Select the Replicate program.\nBag the plates and incubate agar-side up at 30 °C for up to 7 days.\nImaging of readout plates\nFor DNA-bait strains with high background reporter activity, take pictures on days 2, 3, and 4. Otherwise, take pictures at days 4 and 7. Positive interactions are identified by growth and blue color of the yeast colonies and can be manually determined, or it can be determined using image analysis software.",
    "Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}