{
  "id": 7296,
  "origin_website": "Bio",
  "title": "GeneWeld: Efficient Targeted Integration Directed by Short Homology in Zebrafish",
  "procedures": [
    "The GeneWeld protocol is associated with the publication Wierson et al. (2020).Table of Contents IntroductionSelection of a CRISPR/spCas9 sgRNA target site, ordering sgRNAs, and in vitro synthesis of spCas9 mRNAInjection of sgRNA and spCas9 mRNATesting for sgRNA mutagenesis efficiency and indel productionDesign short homology arms for pGTag targeting vector assemblyOne Pot Cloning of Homology Arms into pGTag VectorsInjection of GeneWeld reagents (spCas9 mRNA, Universal sgRNA (UgRNA), genomic sgRNA, and pGTag short homology vector) into 1-cell zebrafish embryosTest injected embryos for evidence of precision on-target integrationEstablish a new transgenic line of a precision targeted integration alleleIntroductionThe GeneWeld strategy (Figure 1) and pGTag vector series are designed for straightforward assembly of vectors containing short homology arms for efficient CRISPR/Cas9-directed recovery of germline precision targeted integration alleles.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4100/bioprotoc-11-14-4100-g001.jpgFigure 1. Targeted integration of pGTag vector cargo DNA into a 5’ coding exon. Short homology arms complementary to the 5’ (green) and 3’ (blue) sequences of the genomic target site are cloned on the 5’ and 3’ sides of the vector cargo DNA. The short homology arm cargo cassette is flanked by two universal guide RNA UgRNA sites. CRISPR/Cas9 simultaneously targets double-strand breaks at the sgRNA genomic target site and at the UgRNA sites flanking the cargo on the plasmid donor. Exonuclease end resection liberates single-stranded DNA in the vector homology arms that is complementary to the resected strands on the 5’ and 3’ sides of the genomic double-strand break. The complementary sequences direct homology mediated end joining integration of the cargo DNA at the exon target site. PAM sequences are underlined, and small red arrows indicate Cas9 cut sites in the genome and vector.Selection of a CRISPR/spCas9 target site in the gene of interestZebrafish wild-type strains in common use are polymorphic.",
    "Note: It is highly recommended to first sequence the target exon in the genomic DNA from your fish strain and use this sequence to design gRNAs.To identify an sgRNA site for targeting, first, view the gene model on a genome browser and download the gene sequences.At <ensembl.org> Search for the gene name of interest for the species of interest and open the Transcript page (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4100/bioprotoc-11-14-4100-g002.jpgFigure 2. Screenshot of zebrafish hand2 Transcript page on the ensembl.org genome browser (https://useast.ensembl.org/Danio_rerio/Transcript/Summary?db=core;g=ENSDARG00000008305;r=1:38193147-38195012;t=ENSDART00000020409[href=https://useast.ensembl.org/Danio_rerio/Transcript/Summary?db=core;g=ENSDARG00000008305;r=1:38193147-38195012;t=ENSDART00000020409])In the left-hand side bar click on “Exons” to find the first coding exon and initiation ATG (Figure 3).Note: If there are alternative transcripts for the gene, make sure there are not alternative initiation ATGs. If there are alternative start codons, target the first exon that is conserved in all transcripts to generate a strong loss-of-function allele. imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4100/bioprotoc-11-14-4100-g003.jpgFigure 3. Exon sequences and Download page for zebrafish hand2 gene on the ensembl.org genome browser Click on the Download sequence button (Figure 3, red arrow). A list of choices for genomic, coding, untranslated regions, and intronic sequences is shown. Select the cDNA and target exon and download as separate sequence files.Using ApE <http://biologylabs.utah.edu/jorgensen/wayned/ape/[href=http://biologylabs.utah.edu/jorgensen/wayned/ape/]> or SnapGene, annotate the coding sequence with the exons.Design primers to amplify the target exon from fin clip genomic DNA and sequence the amplicon. Use this sequence to identify gRNA sites either manually, by searching for PAM sequences, or using CRISPRScan. Remove additional “Gs” CRISPRScan added to the 5’ end. Select a sgRNA location that does not have an in-frame ATG downstream of the sgRNA target site. Annotate the selected target sequence and NGG PAM in the cDNA sequence files.Synthetic sgRNAs can be ordered from Synthego or IDT.",
    "On the Synthego ordering page, select “2’-O-Methyl at 3 first and last bases, 3’ phosphorothioate bonds between first 3 and last 2 bases” the Modifications tab.Design ~20 bp DNA primers for a PCR amplicon of ~130 bp of DNA surrounding the sgRNA target site. These primers will be used to amplify genomic DNA from embryos after injection of CRISPR reagents to test for mutagenesis at the target site. The presence of indels at the target site can be detected in the PCR products in multiple ways, including gel electrophoresis to visualize heteroduplex formation, resistance to restriction enzyme digestion at a site overlapping the sgRNA target and direct sequencing followed by ICE Analysis.Users can design primers with Primer 3 http://biotools.umassmed.edu/bioapps/primer3_www.cgi[href=http://biotools.umassmed.edu/bioapps/primer3_www.cgi].Paste DNA sequence surrounding the target site into the web interface. It is recommended to use 160-300 bp of exon sequence centered on the cut site for primer design. Intron sequence can be used, but this often contains polymorphisms that can lead to amplification failure.Locate the target sequence, including the PAM sequence NGG (underlined, Bold in the example below), and predict the cut site (3 bp upstream of the PAM represented here by the ‘x’). Mark the targeted exon sequence approximately 65-150 bp on both sides of the cut site by putting [square brackets, highlighted in yellow] around it. Primer3 will design primers outside this sequence. This design allows the primers to be used for both checking of mutagenesis and for junction fragment analysis when checking for integration.Example:CGGCCTCGGGATCCACCGGCC[AGAATCGATATACTACGATGAACAGAGCAAATTTGTGTGTAATACGGTCGCCACCATGGCCTxCCTCGGTTTGCTACGATGCATTTGCACCACTCTCTCATGTCCGGTTCTGGG]AGGACGTCATCAAGGAGTTCATGCGCTTCAAGGTGCGCATGGAGGGCTCCGTGAACSet the “Primer Size” variables to Min = 130, Opt = 170, and Max = 300. Everything else can be left at the defaults.Click on “Pick Primers.”Select primers from the output. Note the “product size” expected and the “tm” or melting temperature of each primer/pair. Mutagenesis is easier to visualize in smaller product sizes.",
    "Preparation of SpCas9 mRNADigest ~5-10 μg pT3TS-nCas9n plasmid (plasmid Addgene #46757) (Jao et al., 2013) with Xba1 to linearize the vector.Purify linearized DNA with a Qiagen PCR cleanup kit or Promega PureYield Plasmid Miniprep System. Elute in RNase-free water.Run 100-500 ng on a 1.2% agarose gel in 1× TAE to confirm the plasmid is linearized.Use 100 ng to 1 μg DNA as template for in vitro transcription reaction with the mMESSAGE mMACHINE T3 kit Life Technologies (AM1348). Follow the manufacturer’s instructions provided with the kit. Save a 1 ul aliquot of the in vitro synthesis reaction.Use the miRNeasy Qiagen kit the purify the nCas9n mRNA according to the manufacturer’s instructions.Verify mRNA integrity by running a sample of the in vitro synthesized mRNA on a gel, before and after the miRNeasy Qiagen kit cleanup. Mix 1 μl of Cas9 mRNA, 4 μl of Molecular Grade RNase/DNase-free water, and 5 μl glyoxal dye (NorthernMax-Gly Sample Loading Dye, Thermo Fisher, AM8551).Heat mixture at 50 °C for 30 min in a water bath or thermal cycler, then place on ice.Clean the gel box, comb, and tray with Decon ElIMINase and rinse with DI water.Run all 10 μl of RNA mixture on a 1.2% agarose gel in 1× TAE at 100 V for 1 h as described above. Image gel in an iBright FL1500 Imaging System or another gel-documentation imaging system. One band should be visible at ~4.5 kb.Determine the concentration of the RNA sample using a Nanodrop. Concentrations between 0.45 and 1 μg/μl are expected.Aliquot and store RNA at -80 °C.Injection of sgRNA and spCas9 mRNADeliver 25 pg sgRNA and 300 pg Cas9 mRNA in a 2 nl volume to embryos at the one-cell stage. Below is a step-by-step protocol for zebrafish embryo injection.",
    "A detailed video of zebrafish embryo injection can be found in Rosen et al. (2009). Cast zebrafish embryo injection trays with custom molds that create 45° troughs for lining up and holding embryos (Figure 4A). Molds are also available commercially (see Materials and Reagents).Melt 1.2% agarose in 1× E2 Medium and pour into a polystyrene Petri dish. The mold is set on top (Figure 4B), and, once the plates have set, gently remove the mold (Figure 4C). Injection trays can be used multiple times and are stored inverted at 4 °C for up to three weeks between use.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210715/20210715172000_1848.jpgFigure 4．Injection tray mold. The injection tray mold (A) is set on top of melted 1.2% agarose (B). Solidified injection plate with troughs to hold embryos (C).Pre-warm injection trays to 28.5°C prior to injection by placing them in a 28.5°C incubator for 20 min.Pull microcapillary glass needles using Kwik-Fill borosilicate glass capillaries on a Sutter Instrument Flaming/Brown Micropipette Puller.Prepare injection samples containing the following diluted in Molecular Grade RNase/DNase-free water:12.5 ng/μl of genomic sgRNA150 ng/μl of mRNA for Cas9Keep injection solution on iceBackload needles with injection solution using microloader pipet tips and attach to a micromanipulator. Connect the needle holder tubing to a Harvard Apparatus PLI-90 Pico-injector. Turn on nitrogen gas or the air compressor to pressurize the system and set injection pressure to 40 PSI with an injection time of 100-200 ms.Calibrate injection needle by first breaking the end of the tip off with sterile tweezers (Figure 5A, B). Use the pedal to expel 10 droplets and capture each droplet with a 30 mm long capillary tube that represents a volume of 1 μl (Figure 5C).",
    "Measure the distance from the end of the capillary to the meniscus of the liquid and convert to a volume of 1 mm = 30 nl; therefore, 2/3 of a mm = 20 nl. The volume of each droplet is adjusted by changing the injection time to achieve 2 nl droplets. There is a linear relationship between volume and time at a set pressure. Avoid injection times lower than 100 ms and higher than 400 ms.Transfer one-cell embryos from collection Petri dishes to the troughs on the pre-warmed agarose injection tray (Figure 5D). Each embryo is encased in a chorion. As the embryos near the first cell division at 45 minutes after fertilization, the single cell is clearly visible atop the yolk (Figure 5D).Use the micromanipulator to pierce the needle through the chorion and into the embryo. Inject 2 nl of sample at the center of the yolk interface/boundary between the single cell and the yolk (Figure 5E, white arrow points to interface where needle tip is placed). Inject embryos before the first cell division begins.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4100/bioprotoc-11-14-4100-g005.jpgFigure 5. Microinjection needle calibration and zebrafish single-cell embryo microinjection. (A) Backloaded injection needle with closed tip. (B) A small portion at the tip of the needle is removed using forceps to create an open end. (C) A single droplet of injection solution is expelled by pressing on the injection apparatus pedal. The tip of a 1 μl Drummond capillary tube that was used to capture 10 drops is shown. (D) Embryos lined up in an injection tray trough with labels indicating the chorion, yolk, and single-cell embryo. (E) Needle inserted through the chorion and into the embryo. The tip of the injection needle is positioned at the yolk interface (white arrow) between the single cell on top and the yolk below.",
    "The image in (E) was published in Almeida et al. (2021).After injection, wash the embryos from the injection tray into a clean Petri dish with embryo media.Keep 20-40 embryos separate to use as uninjected controls.At 3-5 h post injection, remove any unfertilized or dead embryos from the dishes.Test for sgRNA mutagenesis efficiency and indel productionBiallelic inactivation can lead to loss of function of essential genes that may be lethal. After injection, count and remove dead embryos from the dish. If all embryos are defective and unlikely to survive, reduce the amount of guide sgRNA that is injected to 12.5 pg. If embryos still fail to survive, reduce the amount of sgRNA further to 6.25 pg. As we reported previously, for a ubiquitously expressed, essential gene such as the tumor suppressor rb1, the amount of injected sgRNA needs to be reduced to 6.25 pg to recover viable juvenile fish that survive to adulthood and transmit germline gene-edited alleles (Solin et al., 2015).Digestion of embryos for isolation of genomic DNA for mutagenesis analysis.Extract genomic DNA from either individual or pools of five embryos from the same injection, aged between 1 and 5 dpf, using the following protocol previously published (Wierson et al., 2020).Dechorionate embryos if they have not emerged from the chorion.Place embryo into a PCR tube and remove as much of the fish water as possible. Collect at least three injected embryos and one uninjected control embryo.Add 20 μl of 50 mM NaOH per embryo.Heat the embryos at 95°C in a thermocycler for 30 min.Vortex samples and spin the tubes down. The embryos should be completely dissolved.Neutralize the samples by adding 1 μl of 1 M Tris pH 8.0 per 10 μl NaOH. Mix by vortexing, then spin down.Genomic DNA is stored at -20°C.",
    "Analysis of CRISPR/Cas9 mutagenesis efficiency at targeted gene locus.Remove genomic DNA samples from -20°C and place on ice to thaw. Keep thawed genomic DNA on ice at all times.Set up the following PCR reactions for each tube of embryo digested genomic DNA using the gene-specific Forward and Reverse primers that were designed to create an amplicon around the CRISPR/Cas9 target site.12.5 μl of 2× GoTaq Mastermix1 μl of Forward Primer (10 μM)1 μl of Reverse Primer (10 μM)1 μl of gDNA template (digested embryos)9.5 μl of nuclease-free waterFor a 25 μl totalFlick the tubes to mix and briefly spin down the PCR reactions.Run the following PCR program to amplify the targeted locus.95°C 2 min95°C 30 s55°C 30 s   35 cycles72°C 30 s72°C 5 min4°C holdRun up to 7 μl of PCR product on a 2.5 to 3% agarose gel in 1× TAE, for 1 h at 80-100V. Image gel in the iBright FL1500 Imaging System or another gel-documentation imaging system.An example of sgRNA injection and validation targeted exon 1 of the hand2 gene is shown in Figure 6A. The control uninjected embryo PCR amplicon runs as a single, tight band on the gel (Figure 6B, U). The amplicons from eight injected embryos show multiple bands or are diffuse in appearance relative to the control (Figure 6B, 1-8). This indicates heteroduplex formation in the PCR product caused by the presence of indel mutations at the CRISPR target site in the gene of interest.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4100/bioprotoc-11-14-4100-g006.jpgFigure 6. hand2 exon 1 sgRNA validation. A. Sequence of the hand2 reverse strand sgRNA site located in exon 1. B. PCR amplicons with primers flanking the sgRNA target site. Diffuse bands in injected embryos represent heteroduplex DNA caused by indel mutations at the target site.",
    "For quantitative analysis of mutagenesis efficiency, Sanger sequence PCR products to verify the presence of indels. The percentage of indel formation can be analyzed using Synthego’s ICE Analysis. Alternatively, Illumina MiSeq multiplex next-generation sequencing can be used to test the efficiency of multiple gRNAs in parallel.An example of ICE analysis of amplicons from the hand2 exon 1 targeted embryos #3 and #6 from Figure 6 is shown below in Figure 7. Embryo #3 and #6 show 84% and 80% indel alleles after targeting, respectively, indicating high mutagenesis efficiency of the sgRNA.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4100/bioprotoc-11-14-4100-g007.jpgFigure 7. Validation of sgRNA mutagenesis efficiency by ICE analysis. PCR amplicons from hand2 exon 1 targeted embryos #3 (A) and #6 (B) were Sanger sequenced and the results analyzed with Synthego ICE Analysis, revealing 84% and 80% of sequences contained indel mutations. Plots on the right show the range of indel mutations recovered.Design short homology arms for pGTag targeting vector assemblyHomology-directed gene targeting allows the seamless integration of exogenous DNA into the genome with precise repair events at the target site. However, designing and cloning individual targeting vectors and homology arms for each gene of interest can be time consuming. The pGTag vector series and web design tools provide versatility and ease to generate knock-out alleles (Figure 8). The vectors contain BfuAI and BspQI type II restriction enzymes for cloning of short homology arms (24 or 48 bp) using Golden Gate cloning. The pGTag vectors require in-frame integration for proper reporter gene function. The reporter gene consists of several parts. A 2A peptide sequence causes translational skipping, allowing the following protein to dissociate from the locus peptide. The eGFP, TagRFP, or Gal4VP16 reporter coding sequences have several options for localization signals, including cytosolic (no signal), a nuclear localization signal (NLS), or a membrane localization CAAX sequence.",
    "Finally, translation is terminated by one of two different transcription termination polyadenylation (pA) sequences, the 3’UTR region of the zebrafish β-actin gene or the SV40 viral transcription termination sequence.For many genes, the level of endogenous gene expression is not high enough to produce a detectable fluorescence signal from the integrated reporter gene. The Gal4VP16 pGTag vector in combination with the transgenic Tol2<14XUAS/RFP> reporter line (Balciuniene et al., 2013) allows for amplification of the signal. The Tol2<14XUAS/RFP> reporter line is available upon request from the lab of Dr. Darius Balciunas, Temple University.Plasmid sequence maps can be downloaded at www.genesculpt.org/gtaghd/[href=http://www.genesculpt.org/gtaghd/].imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4100/bioprotoc-11-14-4100-g008.jpgFigure 8. The pGTag vectors allow one step cloning of homology arms. All vectors (Figure 8) can be obtained through Addgene (www.addgene.org[href=http://www.addgene.org]). Because the pGTag plasmids contain repeated sequences, vector recombination can occur in bacteria. We recommend using NEB Stable Competent E. coli (New England Biolabs, C3040I). Bacteria should be grown at 30°C to further reduce vector recombination.Homology Arm Design at GTagHDThe web tool GTagHD allows for quick design of oligos to generate short 24 or 48 bp homology arms complementary to the target site in a gene of interest.Two complementary oligos with overhangs are annealed to generate the double stranded homology arm for cloning into the pGTag vector.To use the tool, choose the \"Submit Single Job\" tab. Follow the instructions in the tab.The sequences of two pairs of complementary oligos will be returned, one pair for the 5’ homology arm and the other for the 3’ homology arm. If there are problems with the sequences and values that were entered, the web page will display the errors and advice on how to fix them. Double-check your output as below.",
    "Manual Homology Arm DesignThe following protocol describes how to design homology arm oligos manually:Note: In the following section, orientation of target sites and homology is in the context of the reading frame of the genetic locus of interest. Example: A forward strand CRISPR gRNA means that the gRNA and PAM are encoded on the sense strand of the gene. Upstream homology domains are 5’ to the CRISPR/Cas9 cut site, and downstream homology domains are 3’ to the cut site with respect to the reading frame of the gene being targeted. Also note: Upper case and lower case bases are not specially modified; this is simply a visual marker of the different parts of the homology arms. Upstream Homology Arm Design Open the sequence file for the gene of interest and identify the CRISPR site (in this example, it is a Reverse CRISPR target in Yellow, the PAM is in Orange, and the coding sequence is in purple). Copy the 48 bp 5’ of the CRISPR cut (the highlighted section below) into a new sequence file; this is the upstream homology (Figure 9).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4100/bioprotoc-11-14-4100-g009.jpgFigure 9. Screenshot of a targeted gene displayed in ApE, highlighting the target sequence (yellow), PAM (orange), coding sequence (purple), and the gene sequence of the upstream homology arm (highlighted white). Observe the next three bases immediately upstream of the 48 bp of homology, and pick a base not present to be the 3 bp spacer between the homology and the Universal PAM in the vector. Here, the three bases are “GGA,” so “ccc” was chosen for the spacer. Add the spacer to the new file 5’ (in front) of the homology (see below).",
    "The spacer acts as a non-homologous buffer between the homology and the eventual 6 bp flap from the universal guide sequence that will occur when the cassette is liberated and may improve intended integration rates over MMEJ events (Figure 10).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4100/bioprotoc-11-14-4100-g010.jpgFigure 10. Screenshot of the gene sequence of the upstream homology arm (purple), the PAM (orange), and the remaining target sequence to the cut site (yellow). ccc was added as a spacer with a non-homologous sequence.Determine where the last codon is in the homology. Here, the 3’ G in the homology domain is the first base in the codon cut by this CRISPR target. Complete the codon by adding the remaining bases (called padding on GTagHD) for that codon from your sequence to ensure your integration event will be in frame (Figure 11).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4100/bioprotoc-11-14-4100-g011.jpgFigure 11. Screenshot of the gene sequence of the upstream homology arm (purple), the PAM (orange), and the remaining target sequence to the cut site with the padding nucleotides (tg) to keep the integration in frame (yellow). Add the BfuAI enzyme overhang sequences for cloning to the ends of the homology domain. Here, both overhangs, 5’-GCGG and 3’-GGAT, are added to prevent errors in copying sequence for the oligos in the next two steps (Figure 12).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4100/bioprotoc-11-14-4100-g012.jpgFigure 12. Screenshot of the gene sequence of the upstream homology arm (purple), the PAM (orange), and the remaining target sequence to the cut site with the padding nucleotides (tg) to keep the integration in frame (yellow) and the BfuAI sites added to each end. The Upstream Homology Oligo A will be this sequence from the beginning to the end of the last codon (see highlighted below). Copy and paste this sequence into a new file and save it. In this example, this oligo sequence is 5’-GCGGcccGTTTTCTTACGCGGTTGTTGGATGAAATCTCCAACCACTCCACCTTCGtg-3’ (Figure 13).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4100/bioprotoc-11-14-4100-g013.jpgFigure 13.",
    "Screenshot of the gene sequence of the upstream homology arm (purple), the PAM (orange), and the remaining target sequence to the cut site with the padding nucleotides (tg) to keep the integration in frame (yellow) and the BfuAI sites added to each end. The sequence of Oligo A is in white.The Upstream Homology Oligo B will be the reverse complement of this sequence from the beginning of the spacer to the end of the sequence (see highlighted below in Figure 14). Copy the reverse complement, paste it into a new file, and save it. In this example, this oligo sequence is 5’-ATCCcaCGAAGGTGGAGTGGTTGGAGATTTCATCCAACAACCGCGTAAGAAAACggg-3’.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4100/bioprotoc-11-14-4100-g014.jpgFigure 14. Screenshot of the gene sequence of the upstream homology arm (purple), the PAM (orange), and the remaining target sequence to the cut site with the padding nucleotides (tg) to keep the integration in frame (yellow) and the BfuAI sites added to each end. The sequence of Oligo B is highlighted. Use the reverse complement of the highlighted sequence.Downstream Homology Arm Design Open sequence file for the gene of interest and identify the CRISPR site. The reverse CRISPR target is in Yellow, the PAM in Orange, and coding sequence in purple. Copy the 48 bp 3’ of the CRISPR cut into a new sequence file; this is the downstream homology (Figure 15).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4100/bioprotoc-11-14-4100-g015.jpgFigure 15. Screenshot of a targeted gene, highlighting the target sequence (yellow), PAM (orange), coding sequence (purple), and the gene sequence of the downstream homology arm (in white). Observe the next three bases downstream of the 48 bp of homology and pick a base not present to be the 3 bp spacer between the homology and the Universal PAM in the vector. Here, the bases are “CTG;” therefore, “aaa” was chosen for the spacer.",
    "Add the spacer to the new file 3’ of (after) the homology (Figure 16).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4100/bioprotoc-11-14-4100-g016.jpgFigure 16. Screenshot of the gene sequence in the downstream homology arm from the targeted gene. This comprises part of the target sequence (yellow) and additional 3’ coding sequence (purple). aaa was added as padding nucleotides.Add the BspQI enzyme overhang sequences for cloning to the ends of the homology domain. Here, both overhangs, 5’-AAG and 3’-CCG, are added to prevent errors in copying sequence for the oligos in the next two steps (Figure 17).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4100/bioprotoc-11-14-4100-g017.jpgFigure 17. Screenshot of the gene sequence in the downstream homology arm from the targeted gene with part of the target sequence (yellow) and additional 3’ coding sequence (purple). BspQI enzyme overhang sequences are added to each end.The Downstream Homology Oligo A will be this sequence from the beginning of the sequence to the end of the spacer (see highlighted below). In this example, this oligo sequence is 5’-AAGTGGGCAAGATATGGCTCACGTTATTCATCATCTTCCGCATTGTTTTGAaaa-3’ (Figure 18).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4100/bioprotoc-11-14-4100-g018.jpgFigure 18. Screenshot of the gene sequence in the downstream homology arm from the targeted gene with part of the target sequence (yellow) and additional 3’ coding sequence (purple). The sequence for Oligo A is in white.The Downstream Homology Oligo B (will be the reverse complement of this sequence from the beginning of the homology to the end of the sequence (see highlighted below). In this example this oligo sequence is 5’-CGGtttTCAAAACAATGCGGAAGATGATGAATAACGTGAGCCATATCTTGCCCA-3’ (Figure 19).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4100/bioprotoc-11-14-4100-g019.jpgFigure 19. Screenshot of the gene sequence in the downstream homology arm from the targeted gene with part of the target sequence (yellow) and additional 3’ coding sequence (purple). The sequence for Oligo B is highlighted in white. The reverse complement should be ordered.",
    "An example of correct homology arm design, showing complementary overhangs for cloning into the pGTag and pPRISM BfuAI and BspQ1 sites for a hand2 gRNA site (Figure 20).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4100/bioprotoc-11-14-4100-g020.jpgFigure 20. Example of pGTag and pPRISM vector homology arm design showing complementary 5’ overhangs for cloning into the BfuAI and BspQI type II restriction enzyme sites. Diagram of CRISPR/Cas9 target site in the hand2 gene. gRNA sequence in red and PAM sequence underlined and in bold. Annealed homology arm oligos A and B are shown with overhangs (green) complementary to the vector overhangs after enzyme digestion. n, spacer nucleotides; n., nucleotides included to maintain the reading frame of pGTag integration alleles.One Pot Cloning of Homology Arms into pGTag VectorsNotes: If the homology arm oligos contain the 5’-ACCTGC-3’ or 5’-GAAGAGC-3’ sequences (or their complements), the cloning reaction will be less efficient. If One Plot cloning is unsuccessful, the 5’ and 3’ homology arms can be cloned sequentially into the vector using gel-purified linear plasmids digested with the appropriate enzyme. Homology Arm AnnealingAnneal upstream and downstream homology oligo pairs separately:4.5 μl oligo A at 10 μM4.5 μl olio B at 10 μM4 μl 10× Buffer 3.1 from NEB27 μl dH2OFor a 40 μl totalTo anneal the oligos, run the following program in a thermal cycler: Step 1, incubate at 98°C for 5 minutes; Step 2, incubate at 97°C for 45 seconds; repeat Step 2 for 90 cycles during which the temperature is decreased by 1°C/cycle; hold at 4°C for the final step. Alternatively, boil water in a glass beaker on a hot plate and incubate the tube in the boiling water for 5 minutes. Remove the beaker from the heat source and allow it to cool to room temperature. Store the annealed homology arms on ice or in a -20°C freezer.",
    "1-Pot DigestMix the following solutions:4.0 μl dH2O2 μl Plasmid at 50 ng/μl1 μl 10× Buffer 3.1 from NEB1 μl 5' annealed homology arm1 μl 3' annealed homology arm0.5 μl BfuAI enzyme from NEB0.5 μl BspQI enzyme from NEBFor a10 μl totalIncubate at 50°C for 1 h, place on ice.LigationAdd the following:3 μl 5× T4 quick ligase buffer1.5 μl dH2O0.5 μl T4 quick ligase For a 15 μl totalIncubate 8-10 min at room temperature (to overnight). Store at -20°C.Transformation: To prevent recombination at repetitive elements in the plasmid, grow transformations and overnight cultures at 30°C. Our standard protocol uses NEB Stable Competent E. coli (C3040H) cells for cloning and propagation of the GeneWeld pGTag and pPRISM plasmid series to limit recombination.On ice, thaw 1 (one) vial competent cells (50 μl) for every 2 ligation reactions (approx. 5 min).While cells are thawing, label the microcentrifuge tubes for each ligation and put on ice.Once the cells have thawed, use a pipette to transfer 25 μl of the competent cells into each labeled tube.Add 1.5 μl of a ligation reaction into competent cells to transform.The amount of ligation reaction added should be less than 5% of the volume of competent cells.Mix by tapping the tube several times or gently mixing with the pipet tip.Note: Do NOT mix by pipetting; this will lyse the cells. Incubate on ice for 5 to 20 min.Heat-shock the cells by submerging the portion of the tube containing the cells in a 42°C water bath for 40-50 s.Incubate cells on ice for 2 min.Add 125 μl of room temperature LB or SOC to each transformation.Incubate cells at 30°C for 1-1.5 h in a shaking incubator.While the transformed cells are recovering, spread 40 μl of X-Gal solution and 40 μl IPTG 0.8 M on LB Kanamycin selection plates.",
    "X-Gal is lethal to cells while wet; it is recommended to first label the plates and then place them in a 30°C incubator to dry.After recovery and the X-Gal is dry, plate 150 μl of each transformation on the corresponding correctly labeled plate.Incubate plates overnight at 30°C.Growing coloniesPick three white colonies from each plate and grow in separate glass culture tubes with 3 ml LB/Kanamycin, overnight at 30°C, or to pre-screen colonies by colony PCR:Pick up to 8 colonies with a pipet tip and resuspend them in separate aliquots of 5 μl dH2O. Place the tip in 3 ml of LB/Kan, label, and store at 4°C.Make a master mix for your PCR reactions containing the following amounts times the number of colonies you picked.7.5 μl 2× GoTaq mastermix5.5 μl dH2O0.5 μl primer at 10 μM “F3'-check” 5'-GGCGTTGTCTAGCAAGGAAG-3'0.5 μl primer at 10 μM “3’_pgtag_seq”5'-ATGGCTCATAACACCCCTTG-3' For a 14 μl totalAliquot 14 μl of mixed master mix into separate labeled PCR tubes.Add 1 μl of colony to each reaction as template, or 20 ng purified plasmid as control.Cycle in a thermocycler95°C 2 min95°C 30 s57°C 30 s   35 cycles72°C 30 s72°C 5 min4°C holdRun 5 μl of PCR product on a 1% agarose gel. Image gel on iBright FL1500 Imaging System or another gel-documentation imaging system. There should be bands that are a different size than the control.Mini Prep CulturesFollow Qiagen ProtocolSequencing of PlasmidsThe 5’ homology arm can be sequenced by the 5'_pgtag_seq primer:5'-GCATGGATGTTTTCCCAGTC-3’.The 3’ homology arm can be sequenced with the “3’_pgtag_seq”primer:5'-ATGGCTCATAACACCCCTTG-3'.Injection of GeneWeld Reagents (spCas9 mRNA, Universal sgRNA (UgRNA), genomic sgRNA, and pGTag homology vector) into 1-cell zebrafish embryosPrepare and collect the following reagents for injection:Prepare nCas9n mRNA from pT3TS-nCas9n (Addgene #46757) (Jao et al., 2013) (See Section B 5. Preparation of SpCas9 mRNA).",
    "The UgRNA and genomic sgRNA can be directly ordered from IDT or Synthego and resuspended in Molecular Grade RNase/DNase-free water.The pGTag homology vectors should be purified a second time prior to microinjection under RNase free conditions with the Promega PureYield Plasmid Miniprep System beginning at the endotoxin removal wash. Plasmid DNA is eluted in Molecular Grade RNase/DNase-Free water.Embryo Injections for Integration of pGTag vectors.Injections are performed into single cell embryos at a volume of 2 nl per embryo containing the following concentration of RNAs and vector:In injection solution                     In embryo 75 pg/nl of nCas9n mRNA    150 pg of nCas9n mRNA   12.5 pg/nl of genomic sgRNA     25 pg of genomic sgRNA   12.5 pg/nl of UgRNA             25 pg of UgRNA    5 pg/nl of pGTag DNA             10 pg of pGTag DNA   Test injected embryos for evidence of precision on-target integrationExamine injected embryos for fluorescence under a Zeiss Discovery dissecting microscope with a 1× objective at 70-100× magnification. If weak signals are observed, manually dechorionate the embryos, and view on a glass depression well slide on a standard upright compound microscope with epi-illumination. High resolution confocal live imaging can also be carried out, as shown in Wierson et al. (2020) Figure 3 (https://elifesciences.org/articles/53968/figures#fig3[href=https://elifesciences.org/articles/53968/figures]).The type of light source used for fluorescent protein activation significantly affects the ability to visualize fluorescence signals. The X-Cite 120W metal halide light source with fiber optic cable (Excilitas Technologies) works well to visualize fluorescence after somatic targeting. The TagRFP protein also is shifted in its excitation, and filters optimized for this protein are recommended. Filters optimized for GFP and BFP are also recommended. If no or weak signal is observed, integration of pGTag-Gal4VP16 can be used to amplify reporter expression in the 14XUAS-RFP transgenic line (Balciuniene et al., 2013).",
    "Perform junction fragment PCR analysis on positive embryos that display widespread fluorescence in expression domains consistent with the targeted gene. Isolate genomic DNA from individual embryos and a control embryo (See Section D 2. Digestion of embryos for isolation of genomic DNA for mutagenesis analysis). PCR amplifies the genomic DNA-integrated cassette 5’ and 3’ junctions fragments. An example of F0 embryo junction analysis is shown in Figure 3s1 in Wierson et al., 2020 (https://elifesciences.org/articles/53968/figures#fig3s1[href=https://elifesciences.org/articles/53968/figures]).The following primers are used for junction fragment analysis and must be paired with gene-specific primers (5’ to 3’):5’ pGTag junctions: R-Gal4-5'juncM GCCTTGATTCCACTTCTGTCA and a gene-specific forward primerR-RFP-5'junc CcttaatcagttcctcgcccttagAR-eGFP-5'-junc gctgaacttgtggccgttt3’ pGTag junctions: F-Gal4-3'juncM GCAAACGGCCTTAACTTTCC and a gene specific reverse primerF-Gal4-3'junc CTACGGCGCTCTGGATATGTF-RFP-3'junc cgacctccctagcaaactggggF-eGFP-3'junc AcatggtcctgctggagttcTo control for PCR amplification artifacts as described in (Won and Dawid, 2017), perform PCR junction analysis on embryos injected with all targeting reagents minus the genomic sgRNA.The alternate primers F-Gal4-3'juncM and F-Gal4-3'juncJ may increase primer specificity, depending on the target gene.7.5 μl 2× GoTaq mastermix5.5 μl dH2O0.5 μl primer at 10 μM genomic primer0.5 μl primer at 10 μM pGTag primerFor a 14 μl totalAliquot 14 μl of mixed master mix into separate labeled PCR tubes.Add 1 μl of genomic DNA to each reaction as template.Cycle in a thermocycler with the following steps:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210719/20210719232423_5679.jpg Run 5 μl of PCR product on a 1.2% agarose gel in 1× TAE. Image gel on the iBright FL1500 Imaging System or another gel-documentation imaging system. Putative junction fragments should give bands that are of the predicted size.Establish a new transgenic line of a precision targeted integration alleleRaise to adulthood fluorescence reporter-expressing F0 siblings of injected embryos that showed positive bands on the 5’ and 3’ junction analysis, indicating precision targeted integration.",
    "Outcross F0 adults to wild type and examine the progeny for reporter gene fluorescence as described above to identify F1 embryos that have inherited a stable germline integration allele. For Gal4Vp16 integration alleles, cross the F0 adults to the 14XUAS:RFP reporter line. Silencing of the 14XUAS:RFP reporter may result in mosaic expression patterns in Gal4Vp16 targeted F1 embryos.Test F1 fluorescence positive embryos for precise transgene integration by junction fragment PCR analysis as described above. Raise F1 siblings to adulthood and fin-clip to identify individuals with precise targeted transgene integration as shown in Figure 4s 2-4 of Wierson et al. (2020) (https://elifesciences.org/articles/53968/figures#fig4s2[href=https://elifesciences.org/articles/53968/figures]).Outcross a single positive F1 adult to establish F2 families. F1s can also be sacrificed 3 weeks post-fertilization to the confirm location and precision of targeted integrations by genomic Southern Blot RFLP analysis as inFigure 4s1 of Wierson et al. (2020) (https://elifesciences.org/articles/53968/figures#fig4s1[href=https://elifesciences.org/articles/53968/figures]). Continue to maintain lines by outcrossing to wild type in subsequent generations. Tables 1 and 2 of Wierson et al. (2020) (https://elifesciences.org/articles/53968/figures[href=https://elifesciences.org/articles/53968/figures]) show the range of germline transmission frequencies of precision targeted integration alleles at eight zebrafish loci.To perform an initial assessment of whether the targeted integration allele causes a loss of function phenotype, F0 and F1 identified fish can be incrossed or crossed to a known indel allele of the targeted gene."
  ],
  "subjectAreas": [
    "Developmental Biology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}