{
  "id": 17391,
  "origin_website": "Jove",
  "title": "Iris Fixation via External Pentagram Suturing",
  "procedures": [
    "The study was approved by the Ethics Committee Review Board of Peking University Third Hospital and conformed to the Declaration of Helsinki. The new method of surgery named Pentagram Suturing Anterior Chamber Plasty (PSACP) was approved by the medical technology clinical application management Committee Review Board of Peking University Third Hospital. All the patients undergoing PSACP had provided written informed consent before the surgery.\n1. Preparations before PSACP\nPerform ophthalmic examinations for all the patients, including a visual acuity assessment, rebound tonometer, color slit lamp photography (Figure 1A,B), and ophthalmic ultrasound.\nDisplay the range of anterior synechia by anterior segment optical coherence tomography (ASOCT) and ultrasound biomicroscopy (UBM) to design the position of incisions (Figure 1C,D and Figure 2).\nEnsure adequate availability of 10-0 polypropylene sutures on a STC-6 needle, 29 G syringe, cohesive viscoelastic, and balanced salt solution (BSS) (see Table of Materials).\nProvide general anesthesia with 2% lidocaine hydrochloride injection (2.5 mL) (see Table of Materials).\nPlace the patient in a supine position with routine disinfection, towel laying, film sticking, and palpebral fissure opening by an eye speculum.\n2. Surgical procedure\nMark the five scleral puncture points 1.5 mm posterior to the limbus keeping away from the anti-glaucoma filtration bleb with 1% crystal violet solution. Ensure that the circular degree between the adjacent puncture points is 72° (Figure 3).\nRemove the edematous epithelium of the cornea with a sclera tunnel knife.\n\t​NOTE: Hypertonic glucose solution is recommended to reduce corneal stromal swelling.\nMake a limbus incision (1 mm), inject cohesive viscoelastic to separate the anterior synechia of the iris, and remove the fibrous membranes when necessary.\nPerform blunt separation for peripheral anterior synechia (PAS).",
    "Insert the 16 mm (STC-6) needle from the position 1 mm beside one of the puncture points (Figure 3) into the anterior chamber and retrieve across the surface of the iris within the bore of a 29 G syringe from another side puncture point with a circular distance of 144° (Figure 3).\nWhen the 16 mm (STC-6) needle comes out from the anterior chamber, select the next inserting point 1 mm beside the retrieve point and 1.5 mm posterior to the limbus (Figure 3).\nRepeat steps 2.5-2.6 until the retention sutures in the anterior chamber form a pentagram-like barrier on the surface of the iris and pupil.\nTie a surgical knot from the initial insert point and embed it into the superficial sclera under the bulbar conjunctiva.\nPerform the anterior chamber irrigation with BSS. Ensure removing all the viscoelastic, and then seal the incisions to watertight by a sterile irrigateor (see Table of Materials)."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}