{
  "id": 19485,
  "origin_website": "Jove",
  "title": "Analyzing the Parkinson's Disease Mouse Model Induced by Adeno-associated Viral Vectors Encoding Human α-Synuclein",
  "procedures": [
    "All studies were carried out under the 8th edition of the Guide for the Care and Use of Laboratory Animals. Experimental protocols were approved by the IACUC at the Fundación Ciencia & Vida (Science for Life Foundation), including those involving anesthesia, pain, distress, and euthanasia (Permit number P-035/2022).\n1. The stereotaxic surgery\nPreparation for the surgery (approximately 1 h)\n\t\nTo maintain an aseptic environment, wear appropriate surgical clothes during the whole surgery, including shoe covers, a surgical mask, a sanitary barrier, gloves, and a surgical cap.\nSpray 70% ethanol on the mouse and all the surgical material to maintain an aseptic environment.\nTo induce analgesia, inject the mouse with carprofen 5 mg/kg subcutaneously (s.c.) every 12 h21 starting 1 h before the surgery and continuing until 3 days after the surgery.\nTo anesthetize the mouse, place the animal in an induction chamber. Open the isoflurane flow at a rate of 0.5% and then slowly increase it up to 5% over approximately 5 min until the mouse has lost its righting reflex22.\nRemove the animal from the induction chamber. Immediately transfer the animal to a non-rebreathing circuit with an appropriately sized nose cone. Maintain the mouse anesthesia with isoflurane 1% throughout the whole time of surgery.\nConfirm the mouse is entirely anesthetized by pinching its tail and paws. When the mouse does not react to pinching the tail and paws, it means the mouse is completely anesthetized.\nShave the mouse's head using scissors. Clean the mouse's skin using a cotton swab with chlorhexidine 2% and remove all the hair.\nFix the mouse's head in the stereotaxic frame.\nPlace a corneal protectant in both mouse eyes using a cotton swab. To prevent stress induction in other rodents, avoid the presence of any other mouse in the surgery room23.",
    "The surgery (approximately 30 min)\n\t\nClean the mouse's head with three rounds of 2% chlorhexidine followed by 70% ethanol. Expose the skull using surgical material and make a thin hole with a drill at the following coordinates: anteroposterior −2.8 mm, and mediolateral 1.4 mm with respect to the medial line.\nPut the needle of a 10 µL syringe in the hole and move the needle inside the brain slowly until arriving at −7.2 mm dorsoventral with respect to the dura24.\nLeave the needle in the final position for 2 min to allow the tissue to settle a bit, and then inject 1 µL of AAV5-CBA-hαSyn (AAV-hαSyn), AAV5-CBA-eGFP (AAV-GFP), or vehicle (PBS at pH 7.4; sham surgery) into the right substantia nigra at a rate of 0.2 µL/30 s.\nLeave the needle in the same position for 5 min after the delivery of viral vectors and then withdraw it slowly.\nPost-surgery (approximately 5 min)\n\t\nClose the wound using a sterile silk-braided non-absorbable suture.\nPut the mouse in the home cage prewarmed by placing it over an electric heated mattress (25 °C).\n\t\tNOTE: The mouse must be maintained alone in the home cage until it is able to walk without difficulty and the wound has healed.\n2. Determination of motor performance using the beam test\nTraining (approximately 15 min per mouse)\n\t\nTwelve weeks after the stereotaxic surgery, assess the motor performance using a simplified version of the beam test described before25. For this purpose, use a horizontal beam of 25 cm in length and 3 cm in width. The beam surface must be covered with a metallic grid with squares of 1 cm and elevated 1 cm above the beam.",
    "Take a video of the mouse traversing the grid-surface beam from one end to the opposite end of the beam, where the home cage is located. Train the mouse for 2 days before the determination of motor performance.\nOn the first day, train the mouse to walk through the beam five times without the grid.\nOn the second day, train the mouse to walk through the beam in the presence of the grid five times.\nThe test (approximately 5 min per mouse)\n\t\nOn the third day, evaluate the motor performance. To do this, quantify the number of errors carried out by the left paws or by the right paws separately by watching the videos in slow-motion mode.\n\t\tNOTE: An error is defined as when a paw does not correctly step on the grid and, therefore, becomes visible on the side of the grid or between the grid and the beam surface.\n3. Tissue processing\nTranscardial perfusion (approximately 15 min per mouse)\n\t\nTo anesthetize the mouse, inject a mixture of ketamine (80 mg/kg) and xylazine (10 mg/kg) intraperitoneally (i.p.) using a 1 mL syringe and 27 G needle26.\nOnce the mouse is completely anesthetized (confirmed as in step 1.1.6.), open the thorax with surgical material and expose the heart.\nThen, insert a 21 G needle (make the tip flat using a drill) into the heart's left ventricle.\nBy coupling the needle to a pipe, perfuse 50 mL of PBS (pH 7.4) at a rate of 9.5 mL/min using a peristaltic pump.\nFixing and cryoprotecting the brain (approximately 10 min per brain)\n\t\nRemove the brain using scissors and tweezers, and then fix it by immersion in 5 mL of 4% paraformaldehyde in PBS (pH 7.4) at 4 °C for 24 h.",
    "Afterward, put the fixed brain in 15 mL of 30% sucrose at 4 °C for 48 h.\nThen, put the brain in 4 mL of cryoprotection solution (20% glycerine and 2% DMSO in PBS) and save the brain at −80 °C or use it immediately in the next step.\nObtaining brain slices (approximately 20 min per brain).\n\tNOTE: Ensure that the brain is placed in a cryostat in a proper position to make coronal cuts.\n\t\nTo obtain SN slices, cut the brain into 40 μm thick sections starting at −2.92 mm and finishing at −3.64 mm24.\nHarvest each slice in a well (containing 1 mL of cryoprotection solution) of a 24-well plate following an anteroposterior order as described before25,27,28.\nTo perform immunohistochemical (section 4.) and immunofluorescence analyses (section 5.) in the SN, choose six coronal SN sections taken at uniform intervals (120 µm) that cover the entire rostrocaudal extent of the nucleus (720 μm in total), as described before25,27,28.\nTo obtain striatal slices, cut the brain into 40 μm thick sections starting at +1.34 mm and finishing at −0.26 mm24.\nHarvest each slice in a 2 mL cryotube (containing 1 mL of cryoprotection solution) following an anteroposterior order.\nTo perform immunohistochemical (section 4.) and immunofluorescence analyses (section 5.) in the striatum, choose five coronal striatal sections taken at uniform intervals (320 µm) that cover the entire rostrocaudal extent of the nucleus (1600 μm in total).\n4. Immunohistochemical analysis to quantify dopaminergic neurons and microgliosis (approximately 2 days)\nFor immunohistochemical analysis of striatal or nigral slices, place the set of five (striatum) or six (SN) slices from the same brain in one well of a 24-well plate.",
    "Wash the sections 3x with 1 mL of PBS and then incubate with 0.5 mL of 0.03% H2O2 in methanol at room temperature and with agitation for 30 min to inactivate endogenous peroxidase activity.\nWash the sections 3x with 1 mL of PBS and incubate with 0.5 mL of blocking solution (4% goat serum, 0.05% Triton X-100, and 4% BSA in PBS) at room temperature and with agitation for 40 min.\nAfterward, incubate with 0.5 mL of blocking solution containing the primary antibody (rabbit anti-tyrosine hydroxylase [TH] pAb diluted 1:1000 [see Table 1]; or rabbit anti-Iba1 antibody diluted 1:1000) at room temperature and with agitation overnight.\nWash the sections 3x with 1 mL of PBS and incubate with 0.5 mL of blocking solution containing biotinylated goat anti-rabbit pAb (1:500, see Table 1) at room temperature and with agitation for 2 h.\nThen, wash the sections 3x with 1 mL of PBS and incubate with 0.5 mL of peroxidase-conjugated avidin (1:5000, see Table 1) in blocking solution at room temperature and with agitation for 90 min.\nWash the sections 3x with 1 mL of PBS and incubate with 0.5 mL of substrate solution (0.05% diaminobenzidine in 0.03% H2O2/Trizma-HCl buffer at pH 7.6). Wear gloves and a lab coat for this step, as diaminobenzidine is a potential carcinogen.\nWhen the specific staining is evident (typically 30 sec for TH and 5 min for Iba1), take out the substrate solution and wash the sections 3x with 1 mL of PBS at room temperature and with agitation. Always carry out the immunostaining of slices of all the brains included in the same experiment simultaneously.",
    "NOTE: The specific staining of TH is evident when TH immunostaining appears in the area of the SN, which displays a characteristic shape in the brain. The specific mark of Iba1 is determined when Iba1 immunostaining appears on control brain slices with typical microglial shapes, which are confirmed upon microscope observation. In this way, the exact time of substrate exposition for IHC analysis is determined for every single experiment.\nMount the brain sections on glass slides using a solution of 0.2% gelatin in 0.05 M Tris (pH 7.6). Place each set of five (striatum) or six (SN) slices obtained from the same brain in rostrocaudal order on the same glass slide.\nQuantify the number of TH+ neurons in the SN.\n\t\nTo quantify TH+ neurons in the SN, acquire photos of the six slices at 20x magnification using a bright-field microscope, as described before25,27,28. Use the following adjust of color: color temperature 3200 K, cyan-red 40%, magenta-green 39%, yellow-blue 54%, gamma 0.5, contrast 37, brightness 13, saturation 5.\nUsing the Image J software, select the perimeter of the SN pars compacta in the hemisphere analyzed. Avoid the selection of TH+ neurons from the ventral tegmental area (VTA).\nAfterward, ask the software to calculate the area selected (typically 0.04-0.07 mm2/hemisphere, depending on the rostrocaudal position). Then, using the multipoint tool, tag every single TH+ neuron with a dot.\nUsing the point tool, ask the software to count the total number of dots. With the number of total dots (TH+ neurons) and the area of the SNpc, calculate the density of TH+ neurons/mm2.\nRepeat the same calculation in both hemispheres on the six SN slices and then calculate the mean of TH+ neurons/mm2 on the ipsilateral and the contralateral sides.\nQuantify the number of activated microglia in the striatum",
    "To quantify activated microglia in the striatum, acquire two photos in each hemisphere for all five striatal slices at 20x magnification using a bright-field microscope and the same settings indicated in step 4.10.1. Using the Image J software, in every single photo (displaying an area of 660 μm x 877 μm), tag with a dot every single cell expressing high Iba1 intensity and ameboid shape using the multipoint tool. Using the point tool, ask the software to count the total number of dots.\nWith the number of total dots and the area of the photo, calculate the density of activated microglia (Iba1high cells/mm2) as performed before29.\ntable:\n﻿0,1,2,3,4,5\nTarget antigen,Coupled to,Clonality,Host specie,Specie reactivity*,Dilution**\nTyrosine Hydroxylase,,Polyclonal,Rabbit,\"Mouse, Rat, Human\",1/200 - 1/1000\nIba1,,Monoclonal,Rabbit,\"Mouse, Rat, Human\",1/1000\nalpha-Synuclein,,Monoclonal,Rabbit,Human,1/150\nCD4,,Monoclonal,Rat,Mouse,1/250\nIgG (H+L),Biotinilated,Polyclonal,Goat,Rabbit,1/500\nIgG (H+L),AlexaFluor 546,Polyclonal,Goat,Rabbit,1/500\nIgG (H+L),AlexaFluor 647,Polyclonal,Goat,Rabbit,1/500\nIgG (H+L),AlexaFluor 546,Polyclonal,Goat,Rat,1/500\nTable 1: Antibody dilutions. N/A, not applicable. *, It is only specified if there are reactivities with mouse, rat, and human, irrespective of the reactivity with other species. **, A single dilution or a dilution range is specified.\n5. Immunofluorescence analysis to evaluate T cell infiltration in the nigrostriatal pathway (approximately 2 days)\nFor immunofluorescence analysis of hαSyn or TH/GFP on striatal or nigral slices, put together the set of five (striatum) or six (SN) slices from the same brain in one well of a 24-well plate.\n\t\nWash the sections 3x with 1 mL of PBS and then incubate with 0.5 mL of blocking solution (0.3% Triton X-100, 0.05% tween20, and 5% BSA in PBS) at room temperature and with agitation for 40 min.\nAfterward, incubate with 0.5 mL of blocking solution containing the primary antibody (rabbit anti-TH pAb diluted 1:500; or rabbit anti-hαSyn antibody diluted 1:150, see Table 1) at room temperature and with agitation overnight.",
    "Wash the sections 3x with 1 mL of PBS and incubate with 0.5 mL of blocking solution containing AlexaFluor546-coupled anti-rabbit secondary antibody (1:500, see Table 1) and 4′,6-diamidino-2-phenylindole (DAPI; 1:1000) at room temperature and with agitation for 2 h. Then, wash the sections 3x with 1 mL of PBS.\nMount the brain sections on glass slides as described above (step 4.9.). Images were acquired with an inverted fluorescence microscope coupled to a power supply unit.\nFor immunofluorescence analysis of TH/CD4/GFP(Foxp3) on nigral slices, place the set of six (SN) slices from the same brain in one well of a 24-well plate. Wash the sections 3x with 1 mL of PBS and then incubate with 0.5 mL of blocking solution (0.5% Triton X-100, 0.5% fish skin gelatin in PBS) at room temperature and with agitation for 2 h.\nIncubate with 0.5 mL of blocking solution containing the primary antibodies rabbit anti-TH pAb (1:200, see Table 1) and rat anti-CD4 (1:250) at 4 °C and with agitation overnight.\nWash the sections 3x with 1 mL of PBS and incubate with 0.5 mL of blocking solution containing anti-rabbit coupled to AlexaFluor 647 (1:500, see Table 1) and anti-rat coupled to AlexaFluor 546 (1:500) at room temperature and with agitation for 2 h. Then, wash the sections 3x with 1 mL of PBS.\nPut each set of six (SN) slices obtained from the same brain in rostrocaudal order on the same glass slide and mount them using Fluoromount G. Acquire images using a Leica DMi8 microscope. Use the confocal microscope settings indicated in Table 2 to acquire images from immunofluorescence analysis.\ntable:\n﻿0,1,2,3,4,5,6,7\nChanel Name,Cube,Emission Wavelenght,Lookup Table name,Exposure time,Gain,Resolution XY,Resolution Z\nChannel 1,Y5,700nm,Grey,\"1,011.727 ms\",high well capacity,2.237 um,24.444 um\nChannel 2,GFP,525nm,Green,326.851 ms,high well capacity,2.237 um,24.444 um\nChannel 3,TXR,630nm,Red,406.344 ms,high well capacity,2.237 um,24.444 um",
    "Channel 4,Dapi,460nm,Blue,91.501 ms,high well capacity,2.237 um,24.444 um\nTable 2: Confocal microscope settings used for the acquisition of images from immunofluorescence analysis.\n6. Statistical analysis\nTo compare data obtained from the ipsilateral and the contralateral sides, use a paired two-tailed Student's t-test.\nTo compare data obtained from mice receiving AAV-hαSyn and from mice receiving AAV-GFP or sham surgery, use an unpaired two-tailed Student's t-test. Consider significant differences when P values < 0.05."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}