{
  "id": 10154,
  "origin_website": "Jove",
  "title": "Area-based Image Analysis Algorithm for Quantification of Macrophage-fibroblast Cocultures",
  "procedures": [
    "1. Cell culture and image acquisition\nCulture RAW264.7 macrophages at 37 °C and 5% CO2 in Dulbecco's Modified Eagle Medium (DMEM) supplemented with 10% fetal bovine serum (FBS), 1% penicillin-streptomycin, 1.5 g/L sodium bicarbonate, and 5 µM β-mercaptoethanol.\n\t\nFor monoculture imaging, culture RAW264.7 cells at a density of 25,000 cells/cm2 in a 5 mL cell culture flask with 1 mL of medium.\nCulture NIH/3T3 cells at 37 °C and 5% CO2 in DMEM supplemented with 10% fetal bovine serum and 1% penicillin-streptomycin11.\nFor coculture imaging, culture RAW264.7 macrophages and NIH/3T3 fibroblasts together at varied ratios, at a total density of 25,000 cells/cm2. Use coculture medium that is 1 part RAW264.7 medium (DMEM supplemented with 10% FBS, 1% penicillin-streptomycin, 1.5 g/L sodium bicarbonate, and 5 µM β-mercaptoethanol) and 1 part NIH/3T3 medium (DMEM supplemented with 10% fetal bovine serum and 1% penicillin-streptomycin).\nFollowing seeding, incubate cells at 37 °C and 5% CO2 to reach a viable cell density of 80% cell confluence.\nImage cells with an inverted microscope equipped with a 40x objective. Acquire all images in grayscale and export them in the raw '.czi' file.\n\t\nDetermine the capacity of the algorithm to accurately evaluate images with a range of image qualities. Acquire images with varying foci, producing both 'non-bulbous' images (Figure 2) and 'bulbous' images (Figure 3).\nExport and convert cell images to the 8-bit tiff (.tiff) image format using ImageJ using the 'Batch Convert' function on the raw '.czi' files prior to MATLAB analysis. Store converted images in a local folder and manually transfer these image files to the relevant MATLAB bin.\n2. Image analysis-monoculture utilizing the \"monoculture.m\" file primarily",
    "NOTE: The following steps were performed using MATLAB. Three files were used for the MATLAB protocol: \"process.m\" (Supplemental coding file 1), the file containing the algorithm, \"monoculture.m\" (Supplemental coding file 2), the file to run for analyzing monoculture images, and \"coculture_modified.m\" (Supplemental coding file 3), the file to run for analyzing coculture images.\nUse the area-based method to obtain images of cells showing relative height variations. Image outputs for each substep by utilizing the 'imshow()' function for each subimage. Copy and paste the image file for analysis into the bin and enter the file name in the following command. Press run to start the program.\nimread('filename.tiff')\nAnalyze images by 'opening by reconstruction' followed by 'closing by reconstruction' using source functions8 to magnify the foreground from the background. Use the first command for opening by reconstruction and the second and third sequences to close by reconstruction\n'imopen()'\n'imerode()'\n\t\t'imreconstruct()'\nBinarize the reconstructed images to pure black and pure white pixels utilizing a percentile-based identification system. Note that cells are converted to a pure white pixel value of '255' in this system, whereas background and extraneous (non-cellular) objects are converted to a pure black pixel value of '0'.\n\t\nDistinguish cells from the background by using a percentile difference from the 'maximum relevant pixel,' the largest pixel value comprising at least 0.5% of a given image.\nAnalyze and evaluate the pixel values for RAW264.7 macrophages. If these values are within 4.5% of the maximum relevant pixel, then mark the pixel as cellular.\n\t\tNOTE: This command can be issued using a simple if statement.\nFor images containing bulbous cell profiles, such as those seen in Figure 2, implement an iterative procedure to correct for erroneous binarization at the centers of the cells (termed 'islands;' see below), as follows.",
    "Determine an initial guess for the total cell coverage; 60% was utilized for this study. Note that the number of cells present within the image should be dependent on the cell coverage-the relationship between cell number and cell coverage can therefore be determined experimentally. Using this relationship, determine the variables 'Alpha' and 'kappa.'\n\t\tNOTE: 'Alpha' represents a 3 x 1 vector containing the following relative height percentiles: the height percentile at which cells were identified, the height percentile at which the background was identified, and the height percentile at which islands-regions in which intensity values were significantly lower than cell values-typically resided. 'Kappa' represents the total area covered by cells in the image.\nRun the algorithm, which will (i) analyze images using initial estimates of alpha and kappa to fill a portion of the islands, and (ii) use the postanalysis cell counts and coverage to recalculate kappa. If the kappa value is within 10% of the initial guess, proceed to the next step.\n\t\tNOTE: For images containing RAW264.7 and NIH/3T3 cells, alpha was found to be [4.3, 5.5, 10]. In other words, a difference of 4.3% from the maximum relevant pixel determined the height percentile at which cells were identified, a difference of 5.5% from the maximum relevant pixel determined the height percentile at which the background was identified. A difference of 10% from the maximum relevant pixel determined the height percentile at which islands typically resided.\nFollowing binarization of the image, determine the average cell area automatically using the open-source circle finding algorithm, which performs a Hough transform on the binarized image12,13,14. Use the following command to obtain a vector of all center locations and radii of circles found within the image.\n'[centers, radii] = imfindcircle(A, [minradius, maxradius])'",
    "'A' in this command is the image of choice, and [minradius, maxradius] is the range of radii that the algorithm will attempt to detect.\n\tNOTE: This procedure to determine the average cell area assumes that the morphology of macrophage cells was both circular and consistent among cells10. From experimental data, the radii of macrophages are observed to be most commonly between 30 and 50 pixels at 40x magnification. This pixel range is defined as the acceptable range for the circle finding algorithm. The radii might be significantly different for other cell types and would require determination using experimental analysis.\n\t\nUse the radii outputs to calculate the average cell area by averaging. Analyze at least 10 cells to ensure accurate area identification.\nDetermine the total number of cells within the image using the average cell area.\n\t\nLoop through the image matrix and count the total number of cell pixels. Determine the total cell coverage by dividing the number of cell pixels by the total number of pixels within the image. Determine the total number of cells within the image by dividing the number of cell pixels by the average area of a cell.\n3. Image analysis-coculture utilizing the \"coculture_modified.m\" file primarily\nNOTE: The following steps were performed using MATLAB.\nUse the area-based method to obtain images of cells showing relative height variations. Image outputs for each substep by utilizing the 'imshow()' function for each subimage. Copy and paste the image file for analysis into the bin and enter the file name in the following command. Press run to start the program.\n'imread('filename.tiff')'\nAnalyze images by 'opening by reconstruction' followed by 'closing by reconstruction' using source functions10 to magnify the foreground from the background. Use the first command for opening by reconstruction and the second and third sequences to close by reconstruction.",
    "'imopen ()'\n\t\t'imerode()'\n\t\t'imreconstruct()'\nConduct an analysis of cocultures containing RAW264.7 and NIH/3T3 cells by using two selective binarizations, obtained by exploiting the height differences between the two cell types.\n\t\nExperimentally determine a parameter 'phi' using images of RAW264.7 and NIH/3T3 cells, with phi representing the proportional height difference between the two cell types. Guess an initial phi value and iterate until cell counts and coverage match closely with manual counts, specific to the RAW264.7 and NIH/3T3 coculture.\n\t\tNOTE: The value for phi used in these studies was found to be 3.2. Phi is used to selectively filter an image to appear to contain only RAW264.7 cells, as seen in Figure 4C.\nDetermine RAW264.7 cell counts and total cell coverage in a similar fashion as for monoculture images.\nAnalyze the watershed-transformed image again without the phi parameter, detecting both macrophages and fibroblasts. Acquire NIH/3T3 fibroblast data by selectively subtracting RAW264.7 cell pixels, obtained using the standard thresholding and area-based quantification methods described in step 2.\n\t\nOnce the entire image has been analyzed, determine the total number of NIH/3T3 pixels by subtracting the total number of cell pixels from the number of RAW264.7 pixels. Calculate the coverage of NIH/3T3 and RAW264.7 cells by dividing by the number of cell pixels for each cell line by the total number of image pixels.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}