{
  "id": 4056,
  "origin_website": "Cell",
  "title": "Transcriptional analysis of mouse wounds grafted with human mesenchymal stem cells and platelets",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPlatelet isolation\nTiming: ∼30 min\nFor platelets isolation, human blood samples from healthy donors (Etablissement Français du Sang, EFS located in Créteil) are collected in tubes containing heparin (20 U/mL) or EDTA (1.5 mg/mL) to prevent blood coagulation.\nCritical: Avoid the use of citrate as anti-coagulant if you want to study the effects promoted by platelet mitochondrial citrate on the metabolism and repair properties of MSCs as reported by Levoux et al., 2021[href=https://www.wicell.org#bib6].\nDeposit 8 mL of blood per RegenKit BCT tube and centrifuge the samples at 1800 × g for 5 min at ∼20°C–25°C without brake (to avoid platelet activation).\nNote: The RegenKit BCT tube contains a cell separator gel that allows efficient platelet isolation from a small volume of blood. This cell separator gel drastically reduces red and white blood cell contaminations. After the centrifugation step, red blood cells are kept under the gel while the platelets are sedimented on the gel surface (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/768-Fig1.jpg\nFigure 1. Illustration of a RegenKit® tube filled with blood after centrifugation and plasma separation\nAlternatives: It is not mandatory to use RegenKit BCT tubes to isolate platelets from blood. Platelets can be isolated by centrifugation of blood at 500 × g without brake. This latter method, which is less expensive, generates plasma with lower concentration of platelets and more contaminating red and white blood cells. If this alternative method is chosen, it is possible to significantly reduce the rate of contaminating cells by centrifugation of the plasma at 300 × g during 10 min without brake. After the spinning, collect the supernatant containing the platelets and discard the pellet of red and white blood cells.",
    "After centrifugation, re-suspend the platelets in the plasma layer by gently inverting the RegenKit BCT tube 5–10 times. Remove the cap of the Regenkit tube and collect the platelet-rich plasma (PRP) with a micropipette into a conical 15 mL tube.\nNote: An average of 4.5 mL of PRP containing 1.8×109 platelets are obtained from 8 mL of human blood.\nOptional: The paper of Levoux et al., 2021[href=https://www.wicell.org#bib6] has provided evidence that platelets release respiratory-competent mitochondria to MSCs that stimulate their repair properties, platelet’s mitochondria inhibited for their mitochondrial respiration loosing this effect. If you want to study the role of platelet’s mitochondria on MSCs functionality, it is possible to inhibit the mitochondrial respiration of platelets after their isolation, by adding rotenone (complex I inhibitor) to a final concentration of 2 μM and antimycin A (complex III inhibitor) to a final concentration of 2 μM for 3 h. In this condition, wash the platelets 3 times by adding serum free DMEM medium containing heparin (20U/mL) (1 volume Platelets/9 volume washing medium) and centrifuge at 500 × g without brake. Washing steps are critical to remove rotenone and antimycin from platelets prior to their exposure to MSCs and avoid that these reagents alter the mitochondria of MSCs.\nWash platelets 3 times:\nAdd 10 mL of serum-free DMEM containing 20 U/mL heparin.\nCritical: Use heparin to a final concentration of 20 U/mL in serum-free DMEM to avoid platelet aggregation.\nCentrifuge at 1800 × g for 5 min at ∼20°C–25°C without applying the brake. Discard supernatant.\nRe-suspend platelets in serum-free DMEM containing 20 U/mL heparin.\nRepeat the steps a–c, 2 additional times.\nRe-suspend platelets in Hank's Balanced Saline Solution (HBSS).\nCount platelets with a blood analysis instrument such as the VetScan HM5 and dilute them to a final concentration of 8×107/mL.",
    "Critical: Ensure that PRP preparations are minimally or not contaminated with erythrocyte since these cells release products such as hemoglobin and hemin that counteract with the pro-healing effects of platelets (Everts et al., 2019[href=https://www.wicell.org#bib3]). If platelet preparations are contaminated by red blood cells, these can be removed by a centrifugation step at 300 × g during 10 min with no brake.\nMesenchymal stem cell preparation\nTiming: ∼30 min\nHMADS cells have been expanded in vitro in sufficient number to perform engraftment experiments in mouse wounds.\nDissociate the adherent hMADS cells prior to their delivery into mouse wound:\nWash HMADS cells with 5 mL of DPBS 1× and then add 1.5 mL of cell dissociation enzyme TrypLE for 10 min at 37°C.\nAdd 5 mL of cell culture medium to stop the TrypLE activity and centrifuge the cell suspension at 400 × g for 5 min at RT. Discard the supernatant.\nRe-suspend the pellet in HBSS.\nCount the cells with a disposable counting device such as the Kova® Slide, and distribute 2×105 cells per Eppendorf tube in a final volume of 70 μL, each tube corresponding to a wound graft condition.\nAlternatives: It is possible to manually count the cells with non-disposable counting devices such as the Malassez chamber or to use an automated cell counting device such as the LUNA-FL™ Automated Fluorescence Cell Counter.\nMouse cutaneous wounds and cell grafting\nTiming: for steps 8–15, ∼2 h (per mouse); for step 16, 3 days\nFull-thickness skin wounds are created on the back of 8-week-old male C57BL/6JRj mice (Galiano et al., 2004[href=https://www.wicell.org#bib4]). Immediately after their creation, wounds are treated with either saline solution (HBSS), platelets alone, hMADS cells alone (Rodriguez et al., 2005[href=https://www.wicell.org#bib7]) and hMADS cells (Rodriguez et al., 2005[href=https://www.wicell.org#bib7]) in combination with platelets.",
    "Anaesthetize mice with isoflurane, starting at 3.5 mL/L O2 and keeping at 1.5 mL/L O2.\nAdminister a preventive i.p. injection of buprenorphine analgesic (0.1 mg/kg), 30 min prior to proceed to step 11.\nCritical: Administration of analgesics to relieve pain is made every 12 h for 3 days after step 9.\nShave the mouse dorsal surface with an electric clipper and sterilize with 70% alcohol.\nPinch the skin at the midline of the mouse back to be able to create four full thickness 5 mm diameter circular skin wounds (2 wounds on each side of the midline) using a 5 mm sterile biopsy punch.\nAttach sterile silicone donut-shaped splints to the edge of the surrounding wound with adhesive film and using interrupted sutures with 6-0 silk thread.\nCritical: This step is essential to prevent skin retraction (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/768-Fig2.jpg\nFigure 2. Photograph of a mouse back with four full-thickness skin wounds fixed with silicone donut-shaped splints\nOptional: If you want to measure wound closure, place a millimeter ruler close to the wound and then, take a photography with a digital camera or a smartphone.\nImmediately after the injuries, inject each wound with 100 μL of the following conditions: HBSS, 2×105 hMADS cells, 1.6×106 human activated platelets or 2×105 hMADS cells in combination with 1.6×106 activated platelets. Platelets are activated prior to their delivery in mouse wounds by adding 10% of CaCl2 solution.\nCritical: CaCl2 needs to be added few seconds prior cell engraftment to avoid platelet clotting in the syringe.\nOptional: To study the effect of citrate on hMADS cells exposed to platelets sharing inhibited mitochondrial respiration, the wounds are injected with the conditions mentioned in step 13 using platelets previously treated with rotenone and antimycine supplemented with 10 mM tribasic sodium citrate dihydrate.",
    "Cover wounds with a transparent non-adherent dressing and maintain it with an adherent dressing.\nCritical: This step is important because it prevents removal of grafts due to back scratching by mice.\nPlace the mice in an awakening cage under a heat lamp to allow them to fully recover from the anesthesia, then return them to their cages in the animal facility.\nNote: Do not put more than 3 mice per cage to prevent them from removing their non-adherent transparent bandages and nibbling on their silicone donut splints and sutures.\nIt is necessary to control pain every 12 h for 3 days with i.p. injection of buprenorphine (0.1 mg/kg).\nWound closure and dissection\nTiming: ∼1 h (per mouse)\nThe mice are sacrificed on the third or seventh day after injury and wound treatments. The wounds are then dissected.\nAt day 3 after step 16, gently remove the transparent non-adherent dressing as well as silicone donut-shaped splints and sutures.\nCritical: It is recommended that non-adherent dressings be removed on the third day after injury to minimize wound exudation.\nAfter step 17, mice can be immediately sacrificed or maintained until day 7. Sacrifice mice by administering a lethal dose of isoflurane on day 3 or day 7 after injury.\nAlternatives: It is possible to sacrifice mice by other methods including cervical dislocation. If this latter method is preferred, take care to not damage the healed wounds.\nOptional: If you want to measure wound closure, place a millimeter ruler near the wounds and take pictures. Wound closure can be quantified using ImageJ software in a blinded manner through assessment of wound re-epithelialization on days 3 and 7 post-graft and can be calculated as follows: [1- (wound area on day X/wound area on day 0) × 100].",
    "Dissect and excise with scissors and fine forceps about 1–2 mm around the wound site to collect only scar tissue (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/768-Fig3.jpg\nFigure 3. Photograph showing a full thickness skin wound at day 3 following surgery\nThe blue dotted circle with scissors designs where wound is dissected (blue). Black circle corresponds to the initial wound size.\nNote: The initial wound area would be previously delimited by a marker pen.\nCritical: Collecting more tissue around the initial wound can dramatically alter the results.\nRapidly freeze skin biopsies in liquid nitrogen and store at −80°C.\nPause Point: Tissues can be stored at −80°C up to one year.\nRNA extraction and RT-qPCR assays\nTiming: for steps 21–22, ∼2 h; for step 23, ∼2 h; for step 24–31, ∼half-day\nRNAs (RiboNucleic Acids) are extracted from mouse skin wounds and then analyzed for the transcriptional expression of several human and mouse genes by RT-qPCR assay.\nExtract RNAs from mouse cutaneous wounds using the RNeasy Fibrous Tissue Mini Kit, following the manufacturer's instructions.\nQuantify the amount of RNAs using a spectrophotometer such as the DeNovix DS-11 Spectrophotometer.\nNote: Typically, RNAs is eluted in 30 μL of distilled DNase/RNase free water and a sample of a mouse skin wound yields 1000 ng/μL.\nAlternatives: It is possible to use other RNAs isolation methods, but ensure that the alternative method allows effective lysis of the scared wounds that are very fibrous.\nNote: Manufacturer’s instruction for the RNeasy Fibrous Tissue Mini Kit can be found here.\nPause Point: RNAs can be stored at −80°C for at least several months.\nReverse transcription by using the SuperScript™ III Reverse Transcriptase kit and random primers, following the manufacturer's instructions.\nNote: It is recommended to use 1 μg of RNAs for the reverse transcription.",
    "Alternatives: It is possible to use other methods for reverse transcription. In particular, reverse transcription can be performed with a broad range of reverse transcriptase enzymes. In addition, random primers can be replaced by oligo-dT. This last approach is more specific as it specifically hybridizes the poly(A) tail of mRNA and allows the reverse transcription of the mRNA full length. However, the use of random hexamers allows the synthesis of a more large pool of cDNA (from small mRNA fragments, 5′end mRNA sequences…).\nNote: It is possible to use RNA from mouse wounds to perform global or single cell RNA sequencing.\nNote: Manufacturer’s instruction for the SuperScript™ III Reverse Transcriptase kit can be found here.\nDilute the cDNAs (complementary DeoxyriboNucleic Acids), previously obtained in step 23, at a 1:10 ratio with distilled DNase/RNase free water in a final volume of 200 μL. Mix them by pipetting and store them at 4°C for short storage and −20°C for long storage.\nPause Point: cDNAs can be stored at −20°C for several months.\nDesign primer sequences for reference and interest genes using Primer3 and BLAST software.\nNote: In our study, we used genes encoding for human or mouse TATA-Binding Proteins (TBP) as reference genes for the quantification of human or murine transcripts of interest, respectively. However, it is possible to use other housekeeping genes as reference genes such as β-actin, cyclophilin, β2-microglobulin (Dheda et al., 2004[href=https://www.wicell.org#bib2]). Of note, it is not recommended to use as reference gene, the gene encoding for the glyceraldehyde 3-phosphate-dehydrogenase enzyme (GAPDH) because this gene is involved in the metabolic activity of the cell (Ayanoğlu et al., 2020[href=https://www.wicell.org#bib1]) and in our study, we showed that platelets alter the metabolism of the MSCs.",
    "Critical: Primers must be ∼20 bp (base pairs) and their sequences must be specific to human or mouse to distinguish the gene expression of the transplanted human cells from that of the mouse host cells. The annealing temperature of the primer should be ∼60°C and it is preferable but not mandatory that the primers cover an exon-exon junction. In addition, the size of the PCR product should not exceed 300 bp.\nNote: The species specificity of primers is assessed by using BLAST alignment.\nDetermine the efficiency of each primer before use:\nPerform a series of dilution of cDNA sample at 1:2 in distilled DNase/RNase free water;\nNote: It is recommended to start with the undiluted cDNA sample.\nPrepare, on ice, for each primer pair, the following mix (quantity for 1 well): - 0.25 μL of distilled water free of DNase/RNase. - 0.5 μL of forward primer at 10 μM of reference or interest gene. - 0.5 μL of reverse primer at 10 μM of reference or interest gene. - 6.25 μL of PowerUp™ SYBR™ Green Master Mix.\nAlternatives: It is possible to use another SYBR Green mix, like Master Mix PCR Power SYBR™ Green.\nNote: Do not forget, when you prepare the working solution that you need to work at least in duplicate and preferably in triplicate.\nMix thoroughly each primer-pair mix by pipetting.\nAdd 7.5 μL of each primer-pair mix to wells of a 96-well plate and then add 5 μL of each cDNA sample dilutions to wells of a 96-well plate as in shown in Figure 4[href=https://www.wicell.org#fig4].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/768-Fig4.jpg\nFigure 4. Example of a 96-well plate layout for 1 cDNAs sample with different dilutions and 1 primer-pair mix\nSeal properly the plate with a seal compatible with qPCR, like MicroAmp™ Optical Adhesive Film.",
    "Spin the plate briefly to prevent drops from remaining on the well sides.\nRun the qPCR reaction in detection system StepOnePlus™ associated with the acquisition and analysis software StepOne™ v2.1 using the following cycling conditions:\ntable:files/protocols_protocol_768_5.csv\nAlternatives: It is possible to use another detection system associated with another acquisition and analysis software. For example, a 7900 real-time PCR detection system combined with SDS 2.4 acquisition and analysis software.\nNote: The melting curve at the end of the qPCR Cycling Conditions is useful to check that only one specific product has been generated (Figure 5[href=https://www.wicell.org#fig5]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/768-Fig5.jpg\nFigure 5. Examples of two different melting curves\n(A) a melting curve with more than one peak and (B) a melting curve with only one peak.\nAfter exporting the data (in excel file, for example), calculate the Cycle Threshold (Ct) mean of all sample duplicate for each primer pair.\nThen, calculate the logarithm of each cDNA sample dilution.\nAnd finally, determine the primer efficiency as follows: (10(−1/Slope of the linear regression between the Ct mean and the logarithm of each cDNA sample dilution)−1) × 100. See Table S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/768-Mmc1.xls] that illustrates calculations from step 26.h to 26.j.\nNote: Primer efficiency should be ranged between 90 and 110%.\nNow, for qPCR assay, repeat the same steps from 26.b. to 26.j. using the different cDNAs samples instead of the different dilutions of the same cDNA sample (Figure 6[href=https://www.wicell.org#fig6]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/768-Fig6.jpg\nFigure 6. Example of a 96-well plate layout for 8 cDNAs samples and 5 different primer-pair mixes\nAfter exporting the data (in excel file, for example), calculate the Cycle Threshold (Ct) mean of all sample duplicate for each primer pair.\nThen, calculate the ΔCt as follows: Ctinterest gene – Ctreference gene.\nOnce all the ΔCt are obtained, calculate the ΔΔCt as follows: ΔCtsample Y – ΔCtsample control.",
    "Finally, calculate the Fold Change as follows: 2-ΔΔCt. See Table S2[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/768-Mmc2.xls] that illustrates calculations from step 28 to 31.\nNote: Prior the experiments, species specificity of primers must be tested by RT-qPCR in samples containing only mouse or human mRNA."
  ],
  "subjectAreas": [
    "Stem Cells",
    "Health Sciences",
    "Metabolism",
    "Cell Biology",
    "Molecular Biology",
    "Model Organisms"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}