{
  "id": 6987,
  "origin_website": "Bio",
  "title": "Affinity Purification of GO-Matryoshka Biosensors from <em>E. coli</em> for Quantitative Ratiometric Fluorescence Analyses",
  "procedures": [
    "Preparation of purified ratiometric fluorescent biosensorsTransformation of E. coliThaw the DNA (minipreps of plasmids carrying the biosensors and negative controls. e.g., MatryoshCaMP6 (Ast et al., 2017) and the vector pRSET-B) and aliquots of BL21 GOLD (DE3) competent cells on ice for 10 min.Add 10-50 ng of plasmid to the cells and keep on ice for 30 min.Note: DNA quantification can be performed by using a NanoDrop device.Perform heat-shock by using a heat block at 42 °C for 45-60 s.Keep on ice for 2 min.Recover cells for 1 h with 800 µl of LB medium by shaking at 200 rpm at 37 °C.Note: SOC (Super optimal broth) medium, a nutrient-rich bacterial growth medium, can be used instead of LB medium for higher recovery after transformation.Centrifuge at 11,000 x g for 5-10 s.Remove most of the supernatant and keep about 100-200 µl.Resuspend sedimented cells in remaining LB medium and plate dilutions onto solid LB plates (dilutions depend on transformation efficacy) containing the respective antibiotic, here carbenicillin at 100 μg/ml (see Recipes).Note: To optimize colony density, plate different volumes (i.e., 30 and 170 µl) or dilute.Allow bacteria to grow on solid agar overnight at 37 °C.Store plates at 4 °C overnight to achieve fluorophore maturation.Clone selection and cell cultureVisualize cpGFP fluorescence under a fluorescence stereomicroscope and pick bright colonies (Figure 1).Note: Leaky expression is observed on LB solid plates. Brightness of colonies can be used as a criterion to evaluate the sensor expression levels.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200927/20200927102303_4292.pngFigure 1. E. coli cells transformed with empty vector and GO-MatryoshCaMP6s on solid LB plates. A-B. Colonies obtained after transformation with empty vector. C-D. Cells transformed with GO-MatryoshCaMP6s sensor. Fluorescence of the E. coli cells was recorded using a ZEISS  Axio Zoom.",
    "V16  fluorescence stereo zoom microscope and GFP filter settings (λex 470/40 nm and λem 525/50 nm, with a beam splitter at λem 495 nm). Colonies were visualized using bright-field illumination (A, C) and GFP excitation for fluorescence detection (B, D). Scale bars = 1 mm.For each of the 3 biological replicate, inoculate 5 ml of LB liquid medium (with antibiotics for plasmid selection) with 1 independent bright colony and grow overnight in LB plus antibiotic at 37 °C and at 200 rpm shaking (Figure 2).For each biological replicate, inoculate 200 ml of Auto-induction medium containing antibiotics (see Recipes) with the 5 ml preculture in a large flask and grow at 37 °C for 2 h in the dark on a shaker at 220 rpm (Figure 2). Use sample from the remaining preculture for generating glycerol stocks.Notes:To get optimal protein yield and avoid toxicity, Auto-induction media (details available here[href=http://www.nzytech.com/products-services/molecular-biology/competent-cells-media/cell-preparation-growth/auto-induction-media/mb179/]) should be used instead of IPTG, and cells expressing biosensors should be grown at 20 °C rather than 37 °C. The Auto-induction medium is used for obtaining high-levels of recombinant protein expression of lactose-inducible expression-systems. It does not require the addition of isopropyl β-D-1-thiogalactopyranoside (IPTG) and it avoids the constraints of monitoring optical density (O.D.) for the determination of the IPTG supplementation time. The medium contains glucose and lactose that are metabolized at different rates. Glucose is favored initially and represses promoter activity. Once glucose is consumed, repression will be relieved and lactose leads to induction of transcription.Auto-induction media are used for lactose/IPTG inducible expression systems otherwise this part of the protocol has to be customized.Glycerol stocks are generated by mixing cell culture 1:1 with LB medium containing 50% w/v glycerol.When growing 200 ml cultures, flasks should have a volume of 1 or 2 L.",
    "Do not fill flasks beyond 20% of total volume to ensure optimal oxygenation.The initial incubation at 37 °C is important to initiate faster the growth of large cultures from a single colony. Do not extend the incubation time, as it may later lead to a lower amount of soluble biosensors and an increased occurrence of inclusion bodies. Transfer the culture to 20 °C and grow for 48 h at 220 rpm in the dark to avoid any photo-bleaching of FPs (Figure 2).Centrifuge the culture by using high-speed 50 ml centrifuge tubes for 30 min at 20,000 x g at 4 °C, discard the supernatant and freeze the sedimented cells at -20 °C overnight (Figure 2). Do not skip this freezing step, as it helps the purification process. A yellowish sediment of cells expressing the sensor should be visible.Notes:The yield of purified proteins may be increased by freezing and thawing the pellet, which helps to disrupt the cells.High-speed centrifuge tubes for 20,000 x g should be used to avoid breaking of the tubes during centrifugation. Alternatively: Normal falcon tubes can be used by reducing the speed to 17,000 x g in a way to prevent any leakage.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200927/20200927102320_2549.pngFigure 2. Expression of GO-Matryoshka biosensors in E. coli. Workflow of the experiment starting from the screening of the colonies until the harvesting of the expressed biosensor as a bright yellow sediment.Biosensor purificationThaw the pellet on ice.Immediately resuspend the cells by pipetting up and down in 5 ml of lysis buffer containing protease inhibitor cocktail.Sonicate the cell suspension into the tubes on ice (10-15 cycles, with each cycle consisting of 10 s of sonication and 10-15 s of rest).",
    "Be careful with this step since it is important to optimally break the cells while at the same time preventing overheating samples, which may lead to protein denaturation. This step is critical for the quality of the protein sample.Note: Do not heat the sample (e.g., during sonication), which could lead to undesired protein denaturation and aggregation.Centrifuge the lysate by using high-speed 15 ml centrifuge tubes (4 °C; 20,000 x g) for at least 30 min.During centrifugation, prepare the column by adding 1-2 ml final volume of Ni-NTA agarose bead material into a column (placed on its holder).At room temperature, wash the Ni-NTA beads three times by adding 5-10 ml wash buffer to the column, then let it flow through by gravity.Add the lysate to the column. Allow the lysate to flow through by gravity. The His-tagged biosensors will bind to the Ni-NTA beads.Wash three times by gravity flow with 5-10 ml wash buffer.Elute the sensors by gravity flow with up to 5 successive fractions of 300 µl of elution buffer and store in the dark at 4 °C for at least 24 h before analysis to allow the maturation of all purified biosensors. Alternatively: incubate the elution fraction for 3 h at 37 °C.Note: Due to the longer maturation time of the LSSmOrange compared to derivatives (Shcherbakova et al., 2012), incubation at 4 degrees is crucial to obtain fully matured FPs.To remove imidazole, salt contaminants and bound ligands, the eluate can be further purified with a ZebaTM Spin desalting column in a final volume of 130 µl according to the manufacturer’s instructions.Quality control of purified biosensor Perform a Bradford assay to determine protein concentration according to manufacturer’s protocol.",
    "It is recommended that the concentration is at least about 1 mg/ml otherwise it is recommended to repeat the purification with a reduced elution volume.Note: Biosensors can be stored at 4 °C in the dark for a couple of weeks.Load 10-20 µg of protein samples into the SDS-Polyacrylamide gel (SDS-PAGE) (Figure 3).Mix the samples with 1x SDS Sample buffer and add water to a final volume of 20-40 µl.Boil the sample at 90 °C during 5 min to speed up the process of denaturation. Note: Once denatured, the samples can be kept at room temperature until loading. Load the sample into the wells of SDS-PAGE gel.After electrophoresis, proceed to the staining of 6xHis affinity-tagged protein (Pierce 6xHis Stain Reagent Set) according to the manufacturer’s instructions and to Coomassie staining for total protein visualization.Perform protein detection by using visible light (Coomassie staining) and UV-light excitation at a wavelength 280-310 nm (6xHis affinity-tagged staining).Note: The staining of 6xHis affinity-tagged proteins requires 5.6 pmol of His-tagged proteins per band for detection with a CCD camera or 57 pmol of His-tagged proteins per band for detection with a UV transilluminator.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200927/20200927102339_4417.pngFigure 3. Isolation of GO-MatryoshCaMP6s sensors expressed in E. coli. Timeline of the experiment starting from the sedimented cells until the elution of the biosensor by affinity chromatography. Samples loaded into the SDS-PAGE gel are: MW (prestained molecular mass marker), CE (crude extract), L (lysate), FT (flow-through), W (wash), and E1-E5 (eluates from fractions 1 to 5). Upper gel panel was stained for total protein visualization using Coomassie stain buffer and lower gel panel was stained with 6xHis Protein Tag Stain Reagent Set (Thermo Fisher Scientific). Detection was performed by using UV-light excitation at a wavelength 280-310 nm.In vitro binding assay with purified biosensorsOptimization of the sample dilution in final buffer (i.e.",
    ", 20 mM MOPS, pH 7.0, see Recipes) and fluorescence reading parametersIn this section, protocol users will identify the proper dilutions required for each purified biosensor solution based on individual excitation of cpGFP and LSSmOrange using their respective maximum excitation and emission wavelengths. Users will also identify a single wavelength that provides the greatest simultaneous excitation of both cpGFP and LSSmOrange.Select the fraction with the highest protein content and make a predilution of about 40 times to obtain a final concentration of about 5-10 µM.From the pre-diluted sample, prepare a dilution series (1; 1/2; 1/3; 1/4; 1/5; 1/10; 1/100) in a final volume of 200 µl and load into a 96-well plate suitable for reading fluorescence intensities and spectra in a microplate reader (see note).Note: Although best results are obtained with black transparent bottom 96-well plates, their cost is comparatively high. The use of this black plastic helps preventing signal contamination between wells and is therefore favored when precise measurements are needed. However, for preliminary sensor characterization, we use regular non-sterile 96-well plates to minimize costs. Alternatively, to avoid light emission contamination between wells, empty wells can be placed systematically in-between samples.Measure cpGFP and LSSmOrange fluorescence intensities of dilution series in the plate reader using the SPARKControl software and the following parameters: (1) cpGFP: Excitation at 480 nm with a band width of 20 nm, emission at 515 nm with a band width of 15 nm and (2) LSSmOrange: Excitation at 440 nm with a band width of 10 nm, emission at 570 nm with a band width of 15 nm. Adjust the gain and z-position of the reading so that the measurements fall roughly within the middle of the detector range.",
    "The gain is expected between 50-90 and should never exceed 130 while the Z position, when using 200 µl, is expected at about 20,000 μm.Note: While it is possible to find a compromise by using a single intermediate wavelength to excite both FPs, their excitation maxima are distinct, thus for in vitro characterization in a fast fluorimeter, it is better to excite the two FPs separately.Perform an excitation scan with 2 nm intervals between 440 to 480 nm to verify which excitation wavelength provides the highest amplitude for both GFP and the LSSmOrange emission in your conditions (Figure 4). This is typically around 455 nm for GO-Matryoshka biosensors.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200927/20200927102405_3509.png Figure 4. Excitation parameters for the detection of GO-Matryoshka sensors. Emission spectra of MatryoshCaMP6 reveal that increasing the excitation wavelength from 440 nm to 480 nm results in a rise in fluorescence intensity of cpGFP emission but a decrease in the emission of the stable reference LSSmOrange. A.u.: arbitrary units.Select the optimal dilution factor based on emission intensities obtained in Steps C1c and C1d. The dilution factor depends on each instrument, here the targeted range of intensity is of about 20,000 arbitrary units (a.u.) to stay within the optimal range of the detectors without leading to saturation. Lower gain factors of the instrument will yield higher quality data (less noise).Binding assaysDesign the sample loading pattern of your plate by including technical triplicates and purifications of lysate from 3 biological replicates for each biosensor. Depending on the expected Kd, include suitable concentrations of the ligand (e.g., dilution series from 0 mM up to 5 times the Kd; use sufficient data points to obtain reliable apo and saturated states as well as linear range of binding isotherm).",
    "Make sure that the previously selected dilution factor is compatible with this design, and include control wells that only contain buffer to measure background.Note: The order of components added does not matter. However, we recommend to add the component with the highest volume first, the buffer and end with the lowest volume, the biosensors. Load the 96-well plate according to your loading pattern. Technical triplicates for each of the three colonies will be loaded from a single Master Mix (see notes). Make sure to scale Master Mix for 4 reactions for technical triplicates, to maintain a margin of 1 reaction when pipetting triplicates. In addition, make sure that the final volume in each well remains identical, even with different ligand concentrations. Bubbles in the wells should be avoided, as they might affect the reading.Notes:Since the analysis is quantitative, accurate pipetting is crucial. Use high precision, use best practices when pipetting and handling pipettes, ensure that pipettes are in good state, ensure proper calibration of pipettes, prepare master mix (i.e., to avoid pipetting low volumes) and pipet slowly in order to reduce pipetting errors. Do not snap plunger, never allow any liquid to enter the shaft.Incubation time is recommended to be minimum 5 min. It is necessary to ensure to have reached binding equilibrium before performing the reading. The preparation of the 96-well plate is ususally taking a couple of minutes which is sufficient.It is recommended to include buffer-only wells as blanks. Read fluorescence using the plate reader as described in Step C1 to obtain three sets of data for each well: Emission spectrum and point measurements for cpGFP and LSSmOrange of maximum intensities of the GO-Matryoshka sensor (Figure 5).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200927/20200927102422_3212.pngFigure 5. Screenshot of an excel worksheet displaying an example of data and parameters from one binding assay experiments.",
    "Three set of data are obtained after performing point measurements and emission spectrum scan of GO-MatryoshCaMP6s in biosensor binding assay.Analysis of the data for each biological replicateSet a default Excel worksheet, which can be used as template for automated analysis of data obtained in the previous section (Figure 5). This should be done by entering the required formula for processing data and generating graphs from any experiment by simply pasting its raw values. This template has to include:Calculation of the average value for the technical triplicates.Subtraction of the background fluorescence of the buffer for each condition and each data type (cpGFP and LSSmOrange intensities as well as the emission spectrum).Plotting the data by graphically representing the fluorescence intensity as a function of wavelength and generate emission spectra recorded at different ligand concentrations to quantify intensity changes responding to analyte concentration (Bermejo et al., 2011) (Figure 6).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200927/20200927102441_2684.pngFigure 6. Binding assay using purified Matryoshka (here GO-MatryoshCaMP6s) biosensors. A. 96-well plate with GO-MatryoshCaMP6s plus increasing calcium concentrations, color code from green (without calcium) to red (10 µM of calcium), and in triplicate. B. The spectrum of MatryoshCaMP6, with excitation at 455 nm. Increasing concentrations of calcium result in a rise in the fluorescence intensity of cpGFP emission while the reference LSSmOrange emission stay stable (slight increase due to bleedthrough). [a.u.]: arbitrary units. Data are presented as the average of three technical replicates.Note: It is observed that bleed-through occurs and leads to a slight but significant apparent increase in fluorescence intensity of the reference FP LSSmOrange. However, separate point measurements by using two excitation wavelengths should get rid of this effect.",
    "Measure the affinity by using three biological replicates:Calculate the ratio (R) of intensities at 520 nm/575 nm emission for each ligand concentration by using the following equation:R = FI520nm/FI575nmCalculate R0 as the value of R without substrate.Calculate ∆R the value of R at a specific calcium concentration subtracted by R0 as follows:∆R = R - R0 Calculate ∆R/R0.Plot the data against the concentration by using e.g., MyCurveFit.Use a logarithmic scale for the X axis.Apply a sigmoidal fit by using, e.g., MyCurveFit, and calculate the Kd (Figure 7).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200927/20200927102502_1543.pngFigure 7. In vitro saturation curves of purified GO-Matryoshka. Calcium binding isotherms of MatryoshCaMP6s. Analyses of sensor output at different calcium concentrations was performed using purified sensor. Calcium binding was determined as previously described (Ast et al., 2017). Data are presented as the average of three biological replicates (mean ± S.E.M. from biological replicates with n = 3)."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}