{
  "id": 18941,
  "origin_website": "Jove",
  "title": "A Laser-induced Mouse Model of Chronic Ocular Hypertension to Characterize Visual Defects",
  "procedures": [
    "Procedures\nC57BL/6J mice (Jackson Laboratory, Bar Harbor, ME) are raised at Northwestern University's Animal Care Facility. All animals are used in accordance with protocols approved by Northwestern University Institutional Animal Care and Use Committee and conformed to the guidelines on the Use of Animals in Neuroscience Research from the NIH.\n1. Laser Photocoagulation\nThe procedure of laser photocoagulation is modified from previously published protocols 5-7.\nAnesthetize a 40-60 day old mouse by an intraperitoneal injection of ketamine (100 mg/kg, Butler Schein Animal Health, OH) and xylazine (10 mg/kg, Lloyd Inc. of Iowa, Shenandoah, IA).\nDilate the pupil of the right eye of the experimental animal by topical treatment with one or two drops of 1% atropine sulfate solution (Alcon Labs, Inc., Fort Worth, TX).\nAfter mydriasis, flatten the anterior chamber to enhance laser induction 6. Insert a glass micropipette with sharp tip (World Precision Instruments Inc, Sarasota, FL) into the anterior space under the slit lamp (SL-3E, Topcon, Oakland, NJ) to drain out the fluid in the anterior chamber.\nRestrain the mouse in a plastic cone holder (Braintree Sci Inc., MA) and tied up on a homemade platform (See Figure 1A). Hold the mouse with restrainer and exposes the right eye of the mouse to the light source behind the slit lamp. Align the right eye of the anesthetized mouse under the slit lamp.\nWhile holding the mouse restrainer with both hands, apply the laser illumination to the corneal limbus using an Argon laser (Ultima 2000SE, Coherent, Santa Clara, CA). Deliver about 80-100 laser spots (514 nm, 100 mW, 50 msec pulse, and 200 μm spot) perpendicularly around the circumference of the trabecular meshwork. The C57BL/6 mice have pigmented iris which serves as a barrier for any potential stray energy 7.",
    "Instill topical 0.5% moxifloxacin (Alcon Labs, Inc., Fort Worth, TX) on the ocular surface to disinfect the laser-treated area and 0.5% Proparacaine (Bausch & Lomb, Rochester, NY) to relieve pain.\nKeep the animal on a heating pad (Sunbeam Products Inc, Boca Raton, FL) for recovery for about an hour until it is fully awake.\nThe left eye is untreated to serve as a control.\n2. IOP Measurements\nPlace the awake mouse into a tube to load into the plastic cone holder and then restrain it on the platform (See Figure 2A).\nAllow five to ten minutes to let the mouse get adapted to the holder position. Approach the rebound tonometer (TonoLab, Colonial Medical Supply, Franconia, NH) to the mouse eye until the probe tip is 2-3 mm away from the surface of cornea 14.\nPress the measurement button to let the probe tip hit the center surface of cornea gently. Three consecutive sets of six-measurements of IOP of the same eye are acquired and averaged as the IOP of the eye. The untreated control eye is always measured first to get a baseline reading for the laser-treated eye that is measured next.\n3. Optomotor Test\nVisual acuity and contrast sensitivity are tested 14,15 . The two eyes of individual mice are examined separately by reversing the drifting grating direction; i.e. a clockwise drifting grating is used to identify the visual function of the left eye and a counter-clockwise drifting grating for the right eye 16. Each test takes about 15 min and is repeated by two observers independently.\nPlace the mouse and allow the mouse to move freely on an elevated platform surrounded by four computer monitors (Figure 3A-B).",
    "Set up the monitors so that they display horizontally drifting sinusoidal gratings as visual stimuli with mean luminance of 39 cd/m2. The moving direction of the grating should alternate consecutively between clockwise and counterclockwise.\nAnalyze the animal's movements. The animal's movements in-concert with the drifting gratings are considered \"positive\" within 15 sec after the visual stimulus is on and then gradually increased. The highest response-eliciting visual stimulus is defined as the animal's visual acuity 17.\nExamine the contrast sensitivity at three pre-selected spatial frequencies: 0.075, 0.16, and 0.3 cycles per degree (cpd). The contrast threshold for each eye is defined as the lowest contrast that elicits visual responses at the pre-fixed frequency. The contrast sensitivity is the reciprocal of the threshold 17.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}