{
  "id": 5517,
  "origin_website": "Bio",
  "title": "Analysis of Replicative Intermediates of Adeno-associated Virus through Hirt Extraction and Southern Blotting",
  "procedures": [
    "Transfection of 293T cells and AAV productionSeed 4.3 x 106 293T cells in a 10 cm dish in 10 ml of growth medium (DMEM + 10% FBS) for transfection next day. Include an additional plate to determine cell number at the time of infection with adenovirus. Cells are maintained for 24 h at 37 °C and 5% CO2.Dilute 17.5 µg of pAV2 plasmid in 500 µl of DMEM (no serum added, SF DMEM).Dilute 94 µl of PEI in 500 µl of SF DMEM and gently mix. The transfection reagents should be at room temperature (RT) before mixing. Incubate 5 min at RT.Combine the PEI and DNA and gently mix by pipetting. Incubate at RT for 20 min.Add the mixture to the medium in which the cells are growing. Pipet carefully to avoid detaching the cells.4 h after transfection, determine the cell number (for example using a hemocytometer) in the extra plate.Infect the cells using 5 pfu/cell of adenovirus. Include a condition without adenovirus as a negative control for AAV replication.40 to 50 h post transfection a cytopathogenic effect is expected. Cells will round up and eventually detach (Figure 1).Note: The amount of adenovirus necessary to fully support AAV replication and to cause a cytopathogenic effect at 40 to 50 h post transfection can vary depending on the health of the cell line used and its passage number. This may need to be optimized before starting this protocol: infect cells with increasing amounts of adenovirus and monitor the appearance of a cytopathogenic effect (Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170501/20170501193944_8383.jpgFigure 1. AAV and adenovirus induced cytopathogenic effect. Left panel: 24 h post-transfection cells are adherent and form a monolayer. Right panel: 55 h post-transfection the cytopathogenic is evident; cells have rounded up and are lifting from the plate. Scale bars = 50 µm.",
    "Extraction of low molecular weightCollect cells and supernatant in a 15 ml conical tube. Cells should be loosely adherent and can be detached by pipetting. Wash the plate with 2 ml 1x DPBS and add to the 15 ml tube.Centrifuge for 5 min at 500 x g at RT.Discard the supernatant, and resuspend the cell pellet in 1 ml DPBS. Transfer 250 µl to a new 1.5 ml tube. The remainder of the cells can be harvested for additional analyses, e.g., gene and protein expression.Centrifuge for 5 min at 500 x g at RT in a benchtop centrifuge and discard supernatant. Add 500 µl of Hirt lysis buffer and mix by flicking or inverting the tube. Note: The lysate will be very viscous and mixing by pipetting will create bubbles.Incubate for 10 min at RT.Add 1.25 µl of proteinase K (50 µg/ml final concentration) and incubate for 1 h at 37 °C.Add 120 µl of 5 M NaCl (1 M final concentration). Mix gently by flicking/inverting the tube. Incubate overnight at 4 °C. This step precipitates the high molecular weight (chromosomal) DNA.Centrifuge for 1 h at maximum speed (17,000 x g) at 4 °C in a refrigerated table-top centrifuge.Carefully transfer the supernatant (approximately 500 µl) to a new 1.5 ml tube. Note: If the supernatant cannot be separated sufficiently from the viscous pellet, a longer centrifugation may be required.Under a fume hood, add 1 volume (500 µl) of phenol/chloroform/isoamyl alcohol and mix by inverting the tube until homogeneous.Centrifuge for 10 min at 17,000 x g at 4 °C.Carefully transfer the upper phase to a new 1.5 ml tube (approximately 450 µl).Add 50 µl 3 M sodium acetate (0.3 M final concentration) and mix.Incubate overnight at -20 °C.Centrifuge for 20 min at 17,000 x g at 4 °C.",
    "Carefully remove and discard the supernatant, then wash the DNA pellet with 100 µl of 70% ethanol.Centrifuge for 10 min at 17,000 x g at 4 °C.Remove supernatant and air-dry the DNA pellet. Resuspend the pellet in 80 µl ddH2O. Determine the concentration of DNA in the samples using a NanoDrop spectrophotometer. Typical DNA concentration is around 750 ng/µl.Southern blot assay (gel transfer)Digest approximately 1 µg of the extracted DNA with DpnI, for 2 h at 37 °C. DpnI specifically digests methylated DNA, e.g., DNA amplified in dam+ bacteria strains. This step ensures that the input plasmid DNA is digested while newly replicated AAV DNA will not be affected. Separate the digested DNA on a 0.8% agarose gel overnight at 1 V/cm.Remove the gel from the electrophoresis tank and incubate for 30 min in denaturing solution on a platform shaker at approximately 25 rpm.Rinse the gel twice in ddH2O.Incubate the gel for 30 min in neutralizing solution on a platform shaker at approximately 25 rpm.Replace the neutralizing solution with fresh neutralizing solution and incubate for a further 30 min while shaking.Rinse in ddH2O, and then proceed with the assembly of the transfer set-up as detailed in Figure 2.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170501/20170501194813_6999.jpgFigure 2. Scheme of capillary transfer method for Southern blotting. The support plate is a glass plate resting on the sides of the glass tray containing the 20x SSC. The paper towels layer is approximately 15 cm high. The weight used was approximately 600 g.Incubate overnight to transfer the DNA in the gel to the nylon membrane by the capillary method (Figure 2). To obtain the same sample orientation on the nylon membrane as on the gel, turn the gel upside down.Disassemble the set-up and carefully remove the membrane.Rinse the membrane in 2x SSC, and let it air-dry.",
    "To fix the DNA to the membrane, UV cross-link the membrane with 120,000 µJ/cm2.Pre-hybridize the membrane in 20 ml 0.75x nylon wash solution for at least 1 h at 65 °C in hybridization tubes.Preparation of the Rep and Amp probesThe template to prepare the Rep and Amp specific probes is obtained by PCR on the pAV2 plasmid using the aforementioned primer pairs and the PCR conditions listed below. The PCR products are gel-purified and quantified using a NanoDrop spectrophotometer. The expected size of the PCR products is 338 base-pairs for the Rep PCR and 587 for the Amp PCR. 20 to 25 ng of purified PCR product DNA is used as DNA template to prepare the probes.For both Rep and Amp PCRs, mix in a final volume of 25 µl:table:",
    "﻿0,1\nGoTaq Colorless Master mix (2x),12.5 µl\nFw Rep or Amp primer (10 µM),1 µl\nRv Rep or Amp primer (10 µM),1 µl\nTemplate DNA,25 ng\nddH2O,to 25 µl\nCycling conditions Rep PCR:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170501/20170501223753_4306.jpgCycling conditions Amp PCR:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170501/20170501223841_0090.jpgReconstitute the reaction mixture (provided as 0.2 ml tubes containing dehydrated random primers, dNTPs, buffer and cofactors) using ddH2O containing 20-25 ng of probe DNA to a final volume of 44 µl, as suggested in the Prime-It RmT Random Primer Labeling Kit. Heat at 95 °C for 5 min.Add 1.5 µl of 32P-labelled dCTPs, and 3 µl of Magenta polymerase enzyme (tube with red cap in the labelling kit). Incubate for 8-10 min at 37 °C.Add 2 µl of stop mix (tube with green cap in the labelling kit).Separate labelled DNA (the probe) from unincorporated labelled nucleotides using the Quick Spin Columns for radiolabeled DNA purification. Heat the probe at 95 °C for 5 min to denature the DNA.Place tube on ice for 5 min then quickly spin to collect the probe at the bottom of the tube. Southern blot assay (membrane hybridization)Add the probe to the hybridization tube. Depending on the freshness of the radioactivity, one probe prepared as detailed above is sufficient to label 2-4 membranes.Incubate overnight at 65 °C in a hybridization oven.Wash membrane in 0.5x nylon wash solution for 20 min at 65 °C.Wash membrane in 0.1x nylon wash solution for 20 min at 65 °C. Note: If additional washing is required, repeat washing step using 0.01x nylon wash solution.Expose the membrane to the Phosphoimager screen for at least 2 h. Note: The length of exposure necessary to obtain the best signal can vary depending on the strength of the signal.Acquire images using the Typhoon phosphor imager. Image analysis can be performed using the ImageQuant analysis software (GE Healthcare)."
  ],
  "subjectAreas": [
    "Microbiology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}