{
  "id": 17427,
  "origin_website": "Jove",
  "title": "Intravascular Lithotripsy-Assisted Transfemoral Transcatheter Aortic Valve Implantation",
  "procedures": [
    "The protocol is approved by the human research ethics committee of Copenhagen University Hospital, and the studies are conducted following the guidelines of the said ethics committee. Following local policies, all patients gave informed consent for the TAVI procedure, cardiac CT scanning, and anonymous data for research.\n1. Preprocedural planning\nInspect the aorta-iliofemoral vessels ranging from the aortic valve, over the aortic arch, down to the common femoral artery (CFA) and the femoral bifurcation. For an accurate evaluation, perform a dedicated computed tomography (CT) angiography14 and make an angiography-based three-dimensional (3D) reconstruction using dedicated software15 (see Table of Materials).\n\t\nVisually assess the degree of vessel tortuosity.\nVisually assess the degree and amount of vessel calcification (arc, morphology, etc.)16. Pay specific attention to calcified spots with a calcified circumference of >270°.\nMeasure the minimal luminal diameter (MLD), maximal luminal diameter, and mean luminal diameter at the site of the most critical calcifications and stenoses16.\nDecide upon the feasibility of a TF approach for TAVI. Assess the need for and benefit of an IVL-assisted TF approach. Take into account the recommendations provided in Figure 2.\nDetermine the region of interest for possible IVL-treatment: iliac bifurcation, common iliac artery and/or external iliac artery.\nDetermine the preferred TAVI access/puncture site referring to the preprocedural CT angiography; this concerns the femoral bifurcation and femur head.\nDecide upon the diameter and length of (un)covered stents if this is needed in vascular bailout situations.\n2. Obtaining vascular access\nApply local anesthesia by injecting ~10-20 mL of Xylocaine (10 mg/mL) solution in the skin and subcutaneous tissue at the preferred puncture site for TAVI. Confirm the effect of anesthesia by testing skin sensitivity with a needle.\nPerform an echo-guided puncture of the CFA and insert a 0.035\" guidewire (see Table of Materials).",
    "NOTE: Avoid a CFA puncture too close to the femoral bifurcation as this may complicate and compromise the option for bailout stenting of the CFA in case of vascular closure device failure. Verify this by fluoroscopy.\nMake a skin incision of 2-3 cm and insert a 7 F-8 F dilator (see Table of Materials) over the wire.\nKeep the 0.035\" guidewire into the artery and remove the 7 F-8 F dilator. Decide on vascular closure strategy (e.g., suture-based, plug-based closure, etc.) and perform pre-closure maneuvers if necessary.\nInsert the 7 F-8 F sheath (see Table of Materials) over the wire.\nAdminister intravenous heparin according to the local protocol (e.g., 100 IU/kg).\n3. Usage and positioning of a safety wire\nIn a percutaneous intervention at an IVL-treated site, position a safety wire across the main access site and a wire in the abdominal aorta. Strictly keep this wire even after retraction of the TAVI system and the large bore insertion sheath.\n\tNOTE: If the main TAVI access site is not diseased, there is no absolute need to position a safety wire across the main puncture site.\nIn case of vascular disease at the TAVI access site, consider a safety wire crossing the main puncture site, either introduced by a contralateral (e.g., through a 6 F-8 F long sheath), lower ipsilateral, or transradial secondary arterial access. Use this safety wire to treat vascular complications at the puncture and/or IVL-treated sites.\nChoose a 0.018\" safety wire (which is stiff enough, see Table of Materials) to deliver vascular balloons and/or stents, if needed, but with a floppy, non-traumatic tip. Keep this safety wire in place during the entire TAVI procedure until confirmation of good vascular closure.\n4. IVL system set-up",
    "Introduce a 0.014\" guidewire, preferably with extra supportive characteristics, into the 7F-8F sheath at the main TAVI access site. Do not push this wire across the aortic arch.\nTurn on the IVL generator and get the connector cable (see Table of Materials) connected to it.\nChoose a 110 cm long IVL catheter with a balloon length of 60 mm and diameters ranging from 3.5-8 mm on an over-the-wire (OTW) system (see Table of Materials).\n\tNOTE: There are three ports on the distal end of the catheter: one to connect the IVL connector, one for inflating and deflating the balloon, and one that fits the 0.014\" guidewire.\nPrepare the IVL catheter/balloon following the steps below.\n\t\nAspirate 5 mL of a 50% contrast (see Table of Materials) and 50% saline mixture into a 20 mL syringe. Connect to the inflation/deflation port of the balloon catheter.\nPull-on the syringe to aspirate air and replace this air inside the catheter with the fluid mixture in the syringe. Repeat at least three times.\nFill an indeflator device (see Table of Materials) with 50% saline/50% contrast medium. Disconnect the 20 mL syringe and connect the indeflator to the inflation port of the IVL catheter with a three-way stopcock in an intermediate position, ensuring no air is introduced into the system.\nFlush the guidewire exit port at the distal end of the IVL catheter with a saline solution.\nWrap the connector cable in a sterile cover.\nConnect the IVL catheter in a sterile fashion to the connector cable. Wrap some adhesive tape or a rubber band around the connection between the sterile catheter and the sterile cover to prevent it from sliding.\nPush the therapy button on the IVL generator. The light will switch from orange to green.",
    "NOTE: Do not press the therapy button unless the balloon is filled with 50% saline/50% contrast medium (otherwise, it risks damaging the lithotripsy emitters). The IVL system is now ready for use (Figure 1).\n5. IVL treatment\nMake the balloon and shaft of the IVL catheter wet before insertion to activate the hydrophilic coating.\nInsert the IVL catheter over the wire (OTW) into the 7 F-8 F sheath (main access site).\nUse fluoroscopy to position the marker bands at the region of interest.\nInflate the IVL balloon to 4 atm. Document correct positioning and inflation using fluoroscopy. Ensure no air visible in the inflated balloon.\nPress and hold the activation button on the connector handle. Hold for 10 s to apply one cycle of 30 IVL pulses. Audible clicks and light flashes will confirm that the therapy is delivered.\nAt the end of the 30 IVL pulses, increase the inflation of the IVL balloon to 6 atm. Hold this pressure for 4 s.\nDeflate the balloon and keep the negative pressure for 30 s to ensure it is empty. Repeat this action two more times.\nRepeat steps 5.3-5.7 for a maximum amount of 10 cycles with 30 IVL pulses (300 pulses in total).\nConfirm that the balloon is fully deflated before removing the IVL catheter.\nExchange the 0.014\" guidewire for a 0.018\"-0.035\" guidewire, depending on further planning (steps 5.11-5.12).\nIf needed, perform additional percutaneous transluminal angioplasty (PTA) with a non-compliant balloon (e.g., 6-8 mm).\nEnsure that a 0.035\" stiff guidewire is in place before inserting the large bore TAVI introducer sheath into the main access site.\nContinue the TAVI procedure, as usual.\n6. Vascular closure after TAVI",
    "Before removing the insertion sheath, check the position of the safety wire. Always have a bailout option for percutaneous intervention with balloons and/or (un)covered stents in mind and ready in the cath lab.\nPerform vascular closure employing a suture-or plug-based vascular closure device (see Table of Materials).\nAsses the vascular closure with contrast injection, either from the secondary access site or through a 6 F sheath which replaced the large bore insertion sheath.\n\tNOTE: A digital subtraction angiography (DSA) can be helpful in better identifying possible vascular complications17. Select and use the DSA mode on your module and ask the patient to hold their breath while performing the recording.\nIf a vascular complication occurs, treat accordingly. For example, place a covered stent in case of significant extravasation and an uncovered stent in a spiral dissection, etc.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}