{
  "id": 3809,
  "origin_website": "Cell",
  "title": "Alginate-based 3D cancer cell culture for therapeutic response modeling",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPreparing resazurin sodium salt stock solution for resazurin cell viability assay: Day 1\nTiming: 1:30 h\nWeigh out 1 g of resazurin sodium salt.\nPour 400 mL of pre-warmed RPMI culture media into a vacuum filtration bottle containing a stir bar.\nNote: RPMI is not supplemented with FBS or antibiotic-antimycotic.\nPlace the vacuum filtration bottle on a magnetic hot plate stirrer (35°C and 400 RPM).\nAdd the resazurin sodium salt into the culture media slowly.\nCover the bottle with aluminum foil to protect it from light.\nAllow it to mix for 1 h on the stirrer.\nAfter 1 h of filter the resazurin using another vacuum filtration bottle.\nNote: Store the stock in 4°C for up to one month protected from light.\nResazurin read-out: Day 1 and at the end of each time-point for drug-response test\nTiming: 4:30 h\nDilute 4 mL of pre-warmed resazurin stock with 6 mL of serum-free pre-warmed RPMI culture media.\nNote: The dye is light-sensitive.\nAdd resazurin at 1:10 ratio (15 μL per well of 150 μL culture media) to each well of the 96-well plate containing alginate beads.\nProtect the plates from light by wrapping them in aluminum foil.\nPlace the plates on an orbital shaker at low speed for 5 min.\nIncubate plates for 4 h at 37°C.\nMeasure fluorescence: 555 nm excitation/585 nm emission.\nAfter reading the plates, aspirate the resazurin with a multichannel pipette and wash with PBS twice for 5 min.\nAspirate PBS and replace it with fresh culture media.\nPlace the plates at 37°C if further proliferation measurement is to be taken.\nNote: Resazurin-based assay allows to measure viability across several reads.",
    "Note: The non-fluorescent resazurin dye is irreversibly reduced by viable, metabolically active cells to generate a strongly fluorescent product, resorufin, which can be detected by fluorescence microscopy\nNote: Changing growth culture media, adding resazurin sodium salt, and washing steps are all performed using a multichannel pipette. The pipette tip needs to touch the bottom of the well at an angle of 45° to avoid the aspiration of alginate beads.\nCellTiter-Glo (CTG) cell viability assay: Day 1 and at the end of each time-point for drug-response test\nTiming: 3 h\nThaw and warm the CTG reagent.\nAdd CTG reagent at 1:3 ratio (50 μL per well of 150 μL culture media) to each well of the 96- well plate containing alginate beads by using a multichannel pipette.\nPlace the plates on a shaker at low speed for 30 min in 20°C.\nMeasure luminescence by a luminescence plate reader compatible with CTG-based assay.\nDiscard the plates after reading.\nNote: CTG viability assay uses luciferase as the detection enzyme. Luciferase requires ATP in order to generate luminescent signal. Therefore, the signal is proportional to the amount of metabolically active cells.\nAssessment of resazurin/CTG penetration in alginate beads\nTiming: ∼6 days\nRe-plate the beads containing 3 different concentrations of cells, for example, 2,500, 5,000 and 10,000 cells as well as empty beads in each well of 96-well plates.\nAdd 200 μL of culture media.\nNote: Use 6 replicates for each cell density including DMSO control.\nGrow cells in 3D for 24 h and 72 h until the cells form larger colonies.\nAdminister staurosporine (1 μM) to cells in 3D alginate culture using a dispensing method of choice.",
    "Note: Staurosporine is a cell-permeable alkaloid and a non-selective protein kinase inhibitor which induces apoptosis. Induction of apoptosis and activation of caspase-3 can lead to a decrease in cell-cell contacts by cleavage of E-cadherin. We expect that the potent apoptosis inducer, staurosporine, results in loss of cell viability in loose cell colonies at Day 1 and a subsequent decrease in viability assays signals (Figure 2[href=https://www.wicell.org#fig2]). In contrast, in the compact cell colonies of Day 4, we expect that cells display an increase in resorufin upon staurosporine treatment compared with the DMSO controls only if resazurin dye cannot penetrate into those colonies of cells.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/531-Fig2.jpg\nFigure 2. Expected viability measurement achieved in alginate cultures\n(A) Experimental setup: KP1N cells were cultured in alginate at 3 different concentration of cells, 2500, 5000 and 10000 cells per bead for 24 h and 72 h. Then, 3D cultured cells treated with staurosporine (1 μM) or DMSO for 48 h, before resazurin and CTG assays were performed.\n(B) Bright-field microscopy of KP1N cultured in 3D cultures for 24 h and 72 h before staurosporine treatment. Scale bars represent 500 μm.\n(C) CTG luminescent. and resorufin fluorescence intensities of KP1N cells after growing for 24 h in 3D cultures and subsequent treatment with staurosporine (1 μM) or DMSO for 48 h (n = 6 for each condition) are shown. Data are presented as mean ± SD; fold changes in DMSO controls compared with staurosporine treatment are indicated. C, control; St, staurosporine; Cell-Titer-Blue (Resazurin).",
    "(D) CTG luminescent and resorufin fluorescence intensities of KP1N cells after growing for 72 h in 3D cultures and subsequent treatment with staurosporine (1 μM) or DMSO for 48 h (n = 6 for each condition) are shown. Data are presented as mean ± SD; fold changes in DMSO controls compared with staurosporine treatment are indicated. C, control; St, staurosporine; CTB, Cell-Titer-Blue (Resazurin).\nAfter 48 h of treatment, assess the cell viability and proliferation capacity with the resazurin assay and compare it with the CTG assay (as explained above).\nNormalize the results from resazurin and CTG assays to the reading for negative control (empty beads) and analyze them in GraphPad Prism software.\nLIVE/DEAD cell viability assay: Once every week\nTiming: 3 h\nThaw the assay dyes.\nDilute stock of 4 mM calcein-AM to 2 μM, stock of 2 mM ethidium homodimer-1 to 3 μM, and stock of 16.2 mM Hoechst to 33 μM in the culture media.\nAspirate the culture media from each well containing alginate beads by using a multichannel pipette and add 150 mL of the prepared solution to each well.\nIncubate the cells in 37⁰C for 2 h.\nImage the plates with ImageXpress (or any other fluorescence microscope) using the following settings:\nObjective magnification: 10×\nFilter for Calcein-AM (FITC type set-up): excitation: 475/34 nm & emission: 536/40 nm, Ethidium Bromide dimer (Texas Red type set-up): excitation: 560/32 nm & emission: 624/40 nm, Hoechst 33342 (DAPI type set-up): excitation: 377/54 nm & emission: 447/60 nm\nExposure: FITC: 50 ms, Texas Red: 100 ms, DAPI: 250 ms\nRange: 500 μM\nStep-Size: 50 μM\nNote: The settings have been provided as guidelines, they can be different depending on the specific instrument used.\nDiscard the plates after imaging.\nOptional: Hoechst stain is added to stain all nuclei.",
    "Note: Green-fluorescent calcein-AM indicates the presence intracellular esterase activity of live cells (Figure 3[href=https://www.wicell.org#fig3]) and red-fluorescent ethidium homodimer-1 indicates the loss of plasma membrane integrity of dead cells.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/531-Fig3.jpg\nFigure 3. LIVE/DEAD viability assay of 3D-cultured cells\nCalcein-AM indicates the intracellular esterase activity of live cells in an ER (+) and HER-2 (+) patient-derived breast cancer cell line embedded in one alginate bead at a concentration of A) 10,000 cells/bead, and B) 15,000 cells/bead on day 6 after bead making. Scale bars represent 200 μm.\nDrug-response test: Day 1\nTiming: 1 h\nPrepare a stock concentration for each of the experimental drugs (typically 10 mM or 5 mM).\nAdd drugs to beads at final desired doses.\nPlace the plates on an orbital shaker at low speed for 5 min.\nIncubate the plates at 37°C.\nRead the plates using the resazurin assay at the end of the time-point.\nNote: To compare drug-response in 2D and 3D cultures, cells are also seeded in 96-well plates for 2D experiments. The end time-point for 2D experiments in this protocol is Day 4 when cells generally reach a proliferation rate of at least 4 times their Day 1 of seeding. To eliminate the effect of different proliferation rates in 2D vs 3D on the drug-response test, the treatment for 3D cultures was concluded at a time-point that cells reached a proliferation number (number of divisions) comparable to their 2D cultures on day 4. Given the slower growth rate of cells in 3D compared to 2D cultures, we needed to culture some cell lines in 3D at a higher density of cells and for a longer period of time. Culturing cells at higher densities also corrected the effect of LG culture media on the proliferation rate whenever cells could not grow at lower densities.",
    "Culturing cells in alginate beads —> Starting treatment on day 1 while cells are embedded in alginate —> Measuring cells viability when their proliferation is comparable to 2D cultures on day 4\nRadiation treatment: Day 1\nPlate the beads in 96-well plates with 5–10 replicates for each condition.\nNote: There will be one control plate and one plate per each radiation dosage.\nIrradiate the plates, except for the control plate, on Day 1.\nRead the control plate on Day 1 by using the resazurin assay.\nRead all plates over time by using the resazurin assay.\nRecovering cells from alginate beads for downstream experiments\nTiming: 30 min\nNote: For downstream experiments, beads are cultured in either 6-well plates or 100 mm tissue culture dishes. The culture media need to fully cover the beads in the plates.\nAdd 1:5 UltraPure™ 0.5M EDTA to the culture media containing beads and wait for 5 min in 20°C.\nAspirate the solution using a serological pipette and centrifuge it at 150 g for 5 min.\nAspirate the culture media and resuspend the cell pellet in PBS.\nCentrifuge the cell suspension at 150 g for 5 min.\nAspirate PBS and use the cell pellet for downstream experiments.\nCell lysis for western blot assay\nLabel the tubes accordingly.\nAdd lysis buffer to the cell pellet recovered from alginate beads on ice for 20 min.\nCentrifuge the lysate solution at 16,000 g for 15 min in 4°C.\nTransfer the supernatant into a new tube and store at −80°C."
  ],
  "subjectAreas": [
    "Cell Culture",
    "High Throughput Screening",
    "Cell-Based Assays",
    "Cancer"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology"
  ]
}