{
  "id": 3521,
  "origin_website": "Cell",
  "title": "Detection of the DNA binding of transcription factors in situ at the single-cell resolution in cultured cells by proximity ligation assay",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nCulturing and manipulation of cells\nTiming: 24.5–60 h\nThe following steps describe the procedures of culturing mouse embryonic fibroblasts (MEFs) and perturbing the DNA binding activities of c-Myc and HSF1 in MEFs. To study c-Myc, we treat cells with MYCi361, a small molecule disrupting the MYC-MAX dimerization that is essential for the c-Myc DNA binding.10[href=https://www.wicell.org#bib10] Conversely, we apply serum stimulation to promote the DNA binding of c-Myc.11[href=https://www.wicell.org#bib11] For the HSF1 study, we subject cells to heat shock, which is a classical stressor to induce the DNA binding of HSF1.12[href=https://www.wicell.org#bib12]\nCell culture and modulation of the DNA binding activities of c-Myc and HSF1.\nSeed 5×103 Hsf1 wild type (Hsf1WT) or conditional knockout (Hsf1CKO) MEFs per well in a 96-well glass-bottom microplate in 100 μL of complete DMEM. Allow the cells to grow for 24 h at 37°C in a CO2 cell culture incubator.\nTo prepare serum stimulation, replace complete culture media by serum-free media for 12 h.\nStimulate serum-starved cells by media supplemented with 20% serum for 24 h.\nFor the control, serum-starve cells for 12 h without the subsequent serum stimulation.\nTo block the c-Myc DNA binding, treat cells with 20 μM MYCi361 for 24 h. For the control, treat cells with DMSO.\nTo induce the HSF1 DNA binding, culture cells at 45°C for 30 min. For the control, culture cells at 37°C.\nPreparation of cells for PLA\nTiming: 1 h\nThis step describes the fixation, permeabilization, and blocking procedures necessary for the subsequent incubation with primary antibodies.\nCell fixation, permeabilization, and blocking.\nUsing a vacuum pump or micropipette, aspirate the media from the wells of the 96-well glass-bottom microplate and rinse the cells once with 150 μL 1X DPBS.",
    "Add 100 μL of the fixation solution in each well and incubate for 10–15 min at 20°C–22°C. Avoid more than 15 min fixation with 4% formaldehyde. Troubleshooting problem 5[href=https://www.wicell.org#sec8.9].\nAspirate the fixation solution using a vacuum pump or micropipette and rinse once with 150 μL 1X DPBS.\nPause point: After fixation, the cells can be stored in 1X DPBS for up to one week at 4°C.\nAdd 100 μL of the permeabilization buffer and incubate for 10 min at 20°C–22°C.\nDiscard the permeabilization solution using a vacuum pump or micropipette and rinse once with 150 μL 1X DPBS.\nAdd 50 μL of the blocking solution provided with the Duolink In Situ PLA probe kits. Incubate the samples in a 37°C humidified incubator for 30 min.\nAlternatives: A 5% normal goat serum diluted in 1x DPBS can be used for blocking.\nProximity ligation assay (PLA)\nTiming: 16–20 h\nThis major step includes incubating the samples with the primary antibodies and performing the proximity ligation reaction. After blocking, the cells are incubated with the primary antibodies followed by probe incubation, ligation, and amplification reactions.\nNote: The multiple washing steps in this major step must be carried out gently on a slow rocker, as some cell lines detach easily. Troubleshooting problem 2[href=https://www.wicell.org#sec8.3]. The wash buffers should be made freshly or stored at 4°C for less than one month. Troubleshooting problem 5[href=https://www.wicell.org#sec8.9].\nPrimary antibody incubation.\nDilute the primary antibodies to optimized concentrations in the antibody dilution buffer provided with the Duolink In Situ PLA probe kits. Use the same concentrations of normal rabbit and mouse IgG as the negative controls.\nNote: We use a 1:100 dilution of each antibody (i.e., 2 μg/mL mouse anti-dsDNA antibody, 4.29 μg/mL rabbit anti-c-Myc, or 1 μg/mL rabbit anti-HSF1 antibody).",
    "Remove the blocking solution from the wells and add 100 μL of the diluted primary antibodies to each well. Incubate for 12–16 h on a slow laboratory rocker at 4°C.\nNote: Primary antibodies could also be incubated at 20°C–22°C for 1–4 h or at 37°C for 1–2 h. However, the incubation times need to be optimized for individual antibodies. Troubleshooting problem 5[href=https://www.wicell.org#sec8.9].\nCritical: The two primary antibodies being used must be raised in two different species. Troubleshooting problem 3[href=https://www.wicell.org#sec8.5].\nPLA Probe incubation.\nDiscard the primary antibodies from the wells and gently wash the cells with 150 μL of Wash Buffer A on a slow laboratory rocker for 5 min at 20°C–22°C. Repeat the washing step twice for 2 min each.\nDilute both the 5X Duolink In Situ PLA anti-Rabbit PLUS and 5X Duolink In Situ PLA anti-Mouse MINUS probes together in the 1X antibody diluent provided in the kit to make a 1X working probe dilution.\nCritical: The probe mix must include a PLUS PLA probe with another MINUS PLA probe targeting two separate species corresponding to the primary antibodies (e.g., an anti-rabbit PLUS probe should be combined with an anti-mouse MINUS probe). Troubleshooting problem 3[href=https://www.wicell.org#sec8.5].\nDiscard the Wash Buffer A from the wells using a micropipette and add 40 μL of the diluted PLA probes to each well.\nNote: It is important to fully cover the entire sample with the diluted probes. If needed, the total volume in each well could be increased to 50–60 μL.\nIncubate the plate for 1 h at 37°C in a humidified incubator.\nAlternatives: A CO2 cell culture incubator could be used.\nOligonucleotide ligation reaction.",
    "Discard the probes and wash the cells by adding 100 μL of Wash Buffer A on a slow laboratory rocker at 20°C–22°C for 5 min. Repeat the washing step twice for 2 min each.\nDilute the 5X Ligation Buffer provided with the Duolink In Situ PLA probe kits to 1X working solution using purified molecular biology grade water. Add 1 μL of the DNA Ligase per 39 μL of the 1X Ligation buffer to prepare the ligation reaction mix.\nNote: The 5X ligation buffer should be fully thawed and resolved on ice before dilution. It is important to store the ligase in a −20°C freezer and remove it right before adding it to the reaction mix. Troubleshooting problems 3[href=https://www.wicell.org#sec8.5] and 4[href=https://www.wicell.org#sec8.7].\nAdd 40 μL of the ligation reaction mix to each well and incubate the plate at 37°C for 30 min in a humidified incubator.\nAlternatives: A CO2 cell culture incubator could be used.\nRolling circle amplification reaction.\nDiscard the ligation reaction mix from the wells and wash the cells by adding 100 μL of Wash Buffer A on a slow laboratory rocker for 5 min at 20°C–22°C. Repeat the washing step twice for 2 min each.\nDilute the 5X Amplification Buffer provided with the Duolink In Situ Detection Reagents kit to 1X working solution using purified molecular biology grade water. Add 0.5 μL of the DNA polymerase to prepare the amplification reaction mix in 39.5 μL of the 1X Amplification buffer.\nNote: The amplification buffer should be fully thawed and resolved before dilution. The DNA polymerase should be stored in a −20°C freezer and removed just before adding it to the reaction mix. If possible, aliquot the DNA polymerase and avoid repeated freeze/thaw cycles. Troubleshooting problems 3[href=https://www.wicell.org#sec8.5] and 4[href=https://www.wicell.org#sec8.7].",
    "Add 40 μL of the reaction mix to each well and incubate the plate for 100–120 min at 37°C in a humidified incubator.\nAlternatives: A CO2 cell culture incubator could be used.\nNote: The amplification reaction is light sensitive, so the samples should be covered and protected from light during the amplification reaction. Some weaker interactions may require longer incubation durations. The incubation timings need to be optimized based on the TFs being studied. Troubleshooting problems 3[href=https://www.wicell.org#sec8.5] and 4[href=https://www.wicell.org#sec8.7].\nMounting and confocal microscopy\nTiming: 2–3 h\nThis major step involves nuclear counterstaining, mounting and image acquisition using confocal microscope.\nNuclear staining and mounting.\nDiscard the amplification reaction mix from the wells and wash the cells by adding 100 μL of 1X Wash Buffer B on a slow laboratory rocker for 5 min at 20°C–22°C. Wash two more times using 0.01X Wash Buffer B for 2 min each.\nPrepare 2 μM Hoechst 33342 solution for nuclear staining in molecular biology grade water.\nAdd 100 μL of the nuclear staining solution in each well and incubate on a slow laboratory rocker for 5 min at 20°C–22°C.\nDiscard the nuclear staining solution and wash the cells twice with molecular biology grade water for 2 min each on a slow laboratory rocker at 20°C–22°C.\nAir dry the cells for 2 min at 20°C–22°C and add 60 μL of the Fluoromount-G mounting medium to each well. In the case of multi-well chambers, mark the wells on the reverse side of the glass slides using a marker before removing the chamber for air drying and mounting. Add a coverslip to the slide and avoid air bubbles.",
    "Alternatives: Instead of nuclear staining using Hoechst 33342, a mounting medium with DAPI can be used. In that case, directly proceed to step e after step a. After adding the mounting medium with DAPI, add the coverslip and seal the edges of the coverslip using clear nail polish.\nPause point: The plate or slide may be stored at 4°C protecting from light for up to two weeks before imaging.\nConfocal microscopy and imaging.\nSet up the acquisition parameters depending on the fluorophores and the confocal microscope used. Troubleshooting problem 3[href=https://www.wicell.org#sec8.5].\nUse a 20X lens to first locate the cells on the slide and signal distribution. Use a 63X lens for the acquisition of PLA signals.\nUse the IgG control samples to adjust the photomultiplier tube (PMT) settings for acquiring the images. Acquire images using the DAPI channel (405 nm) and Texas Red (561 nm) for nuclear staining and PLA red signal, respectively.\nNote: We use the Duolink In Situ Detection Reagents Red for our experiments. Use the appropriate channel depending on the PLA detection kit being used for the experiment (e.g., use the FITC or Alexa Fluor 488 channel for the Duolink In Situ Detection Reagents Green).\nCritical: The PMT parameters should be set using the IgG controls and kept uniform across all the samples imaged for data comparison. Use immersion oil for the 63X lens and the coverslip should be facing the lens. Follow proper instructions for operating the confocal microscope."
  ],
  "subjectAreas": [
    "Genomics",
    "Molecular/Chemical Probes",
    "Microscopy",
    "Cancer",
    "Cell Culture",
    "Cell Biology",
    "Molecular Biology",
    "Gene Expression",
    "Single Cell"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}