{
  "id": 14210,
  "origin_website": "Jove",
  "title": "Transcranial Direct Current Stimulation and Simultaneous  Functional Magnetic Resonance Imaging",
  "procedures": [
    "1. Contraindications and Special Considerations\nThoroughly screen participants for MRI contraindications (e.g. pacemakers, claustrophobia, etc.)  and exclude if necessary. Acquire standard questionnaires at clinical or research institutions that operate MRI scanners. Always obey standard safety procedures when entering the scanner room.\nThoroughly screen participants for contraindications for tDCS. These may overlap with contraindications for MRI. See Villamar et al.20 for an example.\nConsult with the operating facility regarding local safety and ethics regulations and obtain necessary permissions. Test for potential imaging artifacts induced by the stimulation current or tDCS equipment prior to commencement of the actual experiment (e.g. by testing the impact of tDCS on signal-to-noise ratio17,18).\n2. fMRI Setup, Experimental Design, and Materials\nNote: The use of tDCS inside an MRI scanner requires special equipment. In particular, specific MRI-compatible cables, filter boxes, electrodes and straps to attach electrodes to subjects’ head are required. Figure 2 illustrates (A) standard tDCS equipment and (B) components for use with MRI. The latter components are necessary to prevent the possibility of heating under the electrodes due to radio-frequency pulses emitted during MRI. In addition, high-frequency imaging artifacts may be induced by the tDCS device. Both can be prevented by using filter boxes positioned outside and inside of the scanner room, cables equipped with resistors and dedicated MRI-compatible conductive rubber electrodes.\nPerform general experimental set-up and sequences for the fMRI experiment. Both depend on the aims of the study. Note: the protocol below is specific to this experiment, but can be revised to apply to a number of different experimental situations.",
    "Use a desktop computer with stimulus presentation software installed for a language task that involves visual presentation of semantic categories inside the scanner. Present these stimuli on a screen inside of the scanner via a projector connected to the computer and a system of mirrors.\nUse an MRI-compatible microphone for transmission of overt verbal responses. Acquire two functional sequences during tDCS: a five-minute task-absent RS-sequence and an overt semantic word-generation task. Note: additional details of the experimental set-up, fMRI sequences and stimuli have previously been described in detail14,15 and Figure 1 illustrates the experiment.\nTo set up the tDCS device, program the device to deliver a constant direct current of 1 mA for 20 min to cover the entire duration of the two functional scans, including short breaks and time for instructions in between scans14,15. Ensure sure that the stimulator is sufficiently charged; otherwise it may shut down during the experiment.\nMake sure that all necessary materials are available (Figure 2).\n3. tDCS Setup Outside and Inside of the Scanner (See Figure 3 for a Schematic Overview)\nPlace the outer filter box close to the radio-frequency filter (RF) tube (i.e. the penetration point in the radio frequency shield of the MRI scanner that can be used to insert cables from outside of the scanner). Connect stimulator with the outer box using stimulator cable. Inner and outer filter box must not be mixed up. Note: Figure 4A illustrates the tDCS set-up outside of the scanner. The outer box is clearly marked in Figure 4B.\nMeasure cable length required to connect inner with outer box using box cable (see next point regarding positioning of cable in scanner room). Insert box cable into RF tube from the outside of the scanner and connect with outer filter box (Figure 4A).",
    "Place inner filter box inside the rear end of the scanner bore (Figure 5); use adhesive tape to keep it in place. Connect box cable with inner filter box and avoid loops in any cables as these may induce RF heating. Note: The cable should be aligned with the walls of the scanner room and attached with adhesive tape (Figure 3).\n4. Participant Preparation and Positioning of Participant in Scanner\nAs with conventional tDCS set-ups, inspect the skin of the participant for any pre-existing lesions, move hair away, clean skin with alcohol to remove hairspray, body lotion, etc. to improve skin conductivity underneath the electrodes12,21.\nSoak sponge pockets with saline solution and insert MRI-compatible electrodes into pockets (see DaSilva21 for general considerations of participant preparation and electrode positioning).\nMark electrode positions on subjects’ heads using a pen that leaves no ferromagnetic traces (e.g. don’t use eyeliner). Determine target position for anode using 10-20 EEG system (here: left IFG, 5 x 7 cm2)14,15. To do so, locate (a) the intersection of T3-F3 and F7-C3 and (b) the midpoint between F7-F3. The target position is at the center of a line connecting points (a) and (b). Place cathode (10 x 10 cm2) over right supraorbital position (for details of electrode placement see Meinzer et al.14,15). Attach electrodes to head using rubber band.",
    "Guide the participant behind the scanner and connect electrode cable with the inner filter box. Turn on stimulator and test impedance by pressing the upper right and lower left button of the stimulator simultaneously. If the impedance limits are reached, then the stimulator will stop automatically. If this occurs, check whether electrodes have contact with the scalp, clean skin again or apply more saline solution if sponges have become too dry, and then check if any cable is broken. Note: Impedance is typically higher compared to conventional set-ups because of additional cables and filter boxes between stimulator and electrodes.\nGuide participant into the scanner room (after a final safety check). Position the participant on the scanner gantry and make sure that electrodes are still in the correct position. Close the head coil. The electrode cable should be fed through the lower left part of the head coil (see Figure 6) or according to recommendations of the manufacturer.\nMove participant into scanner bore. Make sure that the cable does not catch on the gantry and break (see Figure 6 for a possible secure position of the cable during this stage). When the participant has reached the final position inside the scanner, reach for the electrode cable from the rear end of the scanner and connect it to the inner filter box. Hand over emergency button to participant and leave the scanner room.\n5. Starting the Stimulation",
    "Use scanner intercom to inform the participant about the start of scanning session. Start the structural localizer scan (to determine head position of participant in scanner and allow for planning of subsequent functional and structural scans) using scanning console. Inspect localizer scan for high-frequency artifacts: Double-click on localizer scan after the end of the acquisition period and adjust contrast (for Siemens Trio by holding right mouse button and moving mouse to left and right; for examples see Figures 7A and 7B).\nUse scanner intercom to communicate to the subject that the stimulation will commence and that he/she might feel a tingling sensation on the scalp for a short time. Repeat instructions for first functional scan. In this example, instruct the participant to keep the eyes closed for the duration of the scan (5 min), move as little as possible and think of nothing in particular. Make sure that projector is turned off (screen inside the scanner bore is black) to avoid visual stimulation during RS-scan.\nStart stimulation manually approximately 1-2 min prior to the start of the first functional scan (RS-scan). Use scanner console to load RS-sequence. Double click on RS-sequence to open field-of-view (FOV), adjust position to cover the entire brain and align approximately with the anterior-posterior commissure. Start the first scan (using the START scan button).\nMonitor impedance throughout the experiment. Note: If the experiment is conducted in a double-blind mode (participant and researcher are blinded to the stimulation), a second researcher may be necessary to monitor the impedance.",
    "While the RS-sequence is running, load second functional imaging sequence (for subsequent language task) and adjust FOV, using scanner console as above, to reduce time required in between scans. After the end of the RS-sequence, turn on projector to allow for visual display of experimental stimuli during language task. Double click on presentation software icon and load language paradigm. Use scanner intercom to repeat instructions for task-related fMRI paradigm and commence with task14,15.\nAfter the end of the stimulation/fMRI experiment, continue with planned structural scans. Do not disconnect electrode cables until the end of the scanning session.\nAt the end of the experiment, disconnect electrode cable from inner filter box before moving participant out of scanner bore. Remove participant from the scanner, detach head coil and ask the participant to sit up and remove electrodes carefully.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}