{
  "id": 8830,
  "origin_website": "Jove",
  "title": "Monitoring the Effect of Osmotic Stress on Secretory Vesicles and Exocytosis",
  "procedures": [
    "1. Cell Culture of Bovine Chromaffin Cells Isolated by Enzymatic Digestion from Adrenal Glands\nTo isolate chromaffin cells collected from bovine adrenal glands, sterilize cells with 70% ethanol solution. Trim away fat and connective tissue using a scalpel. To remove blood, rinse the adrenal veins using Locke's solution (NaCl 154 mM, KCl 5.6 mM, NaHCO3 3.6 mM, hydroxyethyl piperazineethanesulfonic acid (HEPES) 5.6 mM at pH 7.4) that has been thermostated to 37 °C.\nTo digest the tissue, inflate each gland by injecting approximately 2.5 mL of warm sterile-filtered 0.2% collagenase P solution through the adrenal vein using a syringe and incubate the tissue for 20 min at 37 °C. Examine the glands to ensure the digestion process of the medulla is completed. The tissue should feel soft and not tense.\nCollect the digested medulla by snipping off the glands in the longitudinal direction. Mince the medulla tissue using a scalpel. Filter the tissue suspension over a steel sieve and dilute with Locke's solution to approximately a 50 mL volume to reduce the activity of collagenase P.\nPellet the cells at 300 x g in a centrifuge for 10 min at room temperature and collect into 50 mL sterile test tubes. Re-suspend the obtained pellet in 20 mL Locke's solution and filter the solution over a sterile 100-µm nylon mesh into tubes.\nMix the chromaffin cell suspension with sterile Percoll (1:1) and centrifuge the cell solution at 18,600 x g for 20 min at room temperature. Collect the top layer of the density gradient and filter the solution over a 100-µm nylon mesh into tubes.",
    "To exclude Percoll, dilute the cell suspension with Locke's solution and centrifuge at 300 x g for 10 min at room temperature before re-suspending the pellet in Locke's solution. The estimated cell density of the isolated cell suspension is approximately 4 million cells/mL.\nFor amperometric recording of exocytosis and intracellular cytometry measurements, plate chromaffin cells in collagen IV coated 60 mm plastic dishes at a density of about 17.5 × 103 cells/cm2 and incubate the cells at 37 °C in a 5% CO2 environment. Perform the electrochemical experiments within 1-3 days of cell culture.\nFor the TEM imaging experiments, plate chromaffin cells in 75 cm2 cell culture flasks at a density of 7-8 million cells per flask and incubate at 37 °C in a 5% CO2 environment for 1 day.\n2. Single Cell Exocytosis Amperometry Experiments24\nTo fabricate carbon fiber microelectrodes for these experiments, take a glass capillary with an outer diameter suitable for the electrode holder at the head stage that will be used in these experiments. Use a borosilicate glass capillary with an outer diameter of 1.2 mm and an inner diameter of 0.69 mm.\n\t\nConnect one of the capillary ends to a water aspiration tube. Place 5 µm diameter carbon fibers on something, such as a piece of white paper, to enhance visualization.\nIdentify a single carbon fiber and hold the fiber down on one end with a finger to keep the carbon fiber in place while positioning the open end of the capillary in proximity to the free end of the carbon fiber. Gently aspirate the carbon fiber into the glass capillary so that the carbon fiber sticks out through both ends of the capillary. Move away the aspiration force.",
    "Place the capillary with the carbon fiber into a micropipette puller and pull the glass capillary into two separate glass pipette tips. To disconnect the carbon fiber that is connected between the two glass tips, use a pair of scissors to cut the carbon fiber and gain two carbon fiber microelectrodes.\nUnder a microscope, place the carbon fiber on top of a thicker microscope slide that allows manual cutting of the carbon fiber at the edge of where the fiber is extending from the glass capillary coating using a scalpel.\nAfter cutting the carbon fiber, leaving a glass coated carbon fiber tip, insert a few mm of the electrode tip into an Epoxy solution for 10 min to pull up epoxy and seal any possible open space between the carbon fiber and the surrounding glass. Lift the electrodes slowly out of the epoxy solution to prevent bulky glue drops from forming at the tip of the electrode.\nPlace the electrodes on a holder (e.g., a wooden flat stick) with two-side sticky heat resistant tape to which electrodes can be attached. Bake the epoxy treated electrodes overnight in an oven at 100 °C. The electrode tips easily break if they come into contact with a surface, so ensure the electrodes always are safely stored using a holder where the electrodes are fixed in place and tips do not risk being touched.\nTo obtain a flat disc electrode surface, place the electrode in the holder of a microgrinder and bevel each carbon fiber electrode at an angel of 45°. After beveling, mark the capillary on its topside using a permanent marker to later know how to locate the disc electrode surface at a 45° angle when placing the electrode near cells for the exocytosis measurement.",
    "NOTE: This step is important as in these experiments, the oval disc electrode needs to be placed flat on top of cells with its surface parallel to the surface of the Petri dish. Also, beveling electrodes are done the same day as experiments to ensure a fresh and clean electrode surface.\nBefore use, place each carbon fiber microelectrode in a test solution (e.g., 0.1 mM dopamine in PBS buffer (pH 7.4)) to monitor the steady state current using cyclic voltammetry. For a cyclic voltammetry scan, apply a triangle potential waveform from -0.2 V to +0.8 V vs a Ag/AgCl reference electrode at 100 mV/s to ensure good reaction kinetics data are obtained that are in agreement with theoretically calculated values for a 5 µm diameter disc carbon fiber microelectrode25.\nFor amperometry recording of exocytosis, place the Petri dish with cultured chromaffin cells onto an inverted microscope. It is important to shield the microscope set up with a Faraday cage to eliminate electronic noise during the amperometry recording, due to the very small currents being measured. Use a microscope heating stage to maintain a temperature of 37 °C during the cell experiments .\nUse a low-noise patch clamp instrument to apply a constant potential of +700 mV at the working electrode versus a Ag/AgCl reference electrode that is also placed in the Petri dish away from the working electrode. For recording exocytosis of chromaffin cells, digitalize the signal at 10 kHz and apply an internal low pass Bessel filter at 2 kHz to filter the recorded signal.\nTo perform amperometric recording at single cells, mount the freshly beveled and tested carbon fiber disc microelectrode in the electrode holder of the head stage that is used with the potentiostat.",
    "Gently place the electrode with the flat oval disc shape electrode surface facing down towards the apical surface of the cell and place the electrode in contact with the cell membrane using a micromanipulator.\nAdjust the distance from the electrode to the cell by monitoring the cell deformation caused by the electrode upon placement on top of the cell membrane and then carefully retract the electrode to a distance where the cell regains a shape close to its original cell shape. The ideal for kinetic and quantitative recording is to create a thin liquid film of a hundred nanometers to separate the electrode and cell surface, which are similar conditions for postsynaptic detection of chemical release in a synapse.\nTo stimulate the cells to exocytosis, position a glass micropipette with a tip size of 2-3 µm diameter, filled with 5 mM BaCl2 solution at a distance of at least 20 µm away from the cell, to prevent any solution leaking from the pipette tip to influence the experiment and apply a 5 s injection pulse of 5 mM BaCl2 solution at the cell surface to stimulate the cell to exocytosis.\nTo study the reversible effects of osmotic pressure on the exocytosis process, prepare an isotonic buffer solution (150 mM NaCl, 5 mM KCl, 1.2 mM MgCl2, 5 mM glucose, 10 mM HEPES, pH 7.4) with 310 mOsm/kg iso-osmotic pressure and a hypertonic buffer made by adjusting the NaCl concentration of the isotonic buffer solution with an osmolality corresponding to 730 mOsm/kg.\nPlace the cells in the isotonic buffer and stimulate the cell to exocytosis by applying a barium injection pulse while recording the amperometric current transients during the initiated exocytosis activity for approximately 3 min.",
    "To compare the exocytosis responses in isotonic conditions to hypertonic conditions, incubate the cells for 10 min in hypertonic buffer solution and thereafter apply a barium injection pulse to stimulate exocytosis and perform 3 min of amperometric recording.\nFor the reversible response of cells, incubate cells again for 10 min in isotonic buffer solution and stimulate cells by applying a 5s barium injection pulse and perform 3 min of recording the exocytosis response from the cell.\nAs control experiments to determine the effect on exocytosis activity by multiple barium stimulations, perform an amperometric recording of exocytosis release from three consecutive BaCl2 stimulations on the same cell placed in isotonic buffer and using the same time protocol for the consecutive cell incubation experiments with different osmolarity.\n3. Intracellular Electrochemical Cytometry24,26\nTo fabricate electrodes for vesicle quantal size measurements, use the same materials and start preparing a 5 µm in diameter carbon fiber electrode according to the descriptions in sections 2.1 and 2.2 of microelectrode fabrication for amperometric exocytosis measurements.\nUnder a microscope, use a scalpel to cut the carbon fiber extending out of the glass tip so that a carbon fiber with a length ranging from 30 to 100 µm is left sticking out from the glass tip.",
    "To prepare a flame etched tip of the carbon fiber electrode, use a butane flame. To achieve an evenly etched, cylindrical shaped electrode tip, hold the cylindrical shaped carbon fiber electrode while rotating it and place the carbon fiber extending from the glass into the blue edge of the butane flame until the tip of the carbon develops a red color. This often takes less than 2 s. If successful, this results in an etched electrode tip size of 50-100 nm in diameter (a SEM image of such tip is shown in Figure 5B). After flame etching, place the electrode under a microscope to evaluate the electrode tip.\nInsert the cylindrical nanotip microelectrode in epoxy solution for 3 min followed by a 15 s dipping of the electrode tip into an acetone solution. This allows epoxy to seal the potential gap space between the carbon fiber and the insulating glass capillary wall, while the acetone clears the epoxy off the etched carbon fiber electrode surface. To cure the epoxy, bake the electrodes in an oven overnight at 100 °C.\nBefore use, test the steady state current of each carbon fiber microelectrode, as explained in section 2.7 using cyclic voltammetry. For experiments, only use electrodes that display a plateau current around 1.5-2.5 nA27.\nFor intercellular amperometry measurements, place the cells at the microscope as described in 2.8 and use the same experimental settings of the potentiostat as described in 2.9.\nTo perform intracellular amperometric measurement, and to prevent significant physical damage to the cell, insert the nanotip cylindrical microelectrode into the cell by adding a gentle mechanical force, just enough to push the electrode through the cell plasma membrane and into the cell cytoplasm using a micromanipulator.",
    "After insertion, and with the cell membrane sealed around the cylindrical electrode, start the amperometric recording in situ at the live cell. At the oxidation potential that is applied to the electrode, vesicles will adsorb to the electrode surface and stochastically rupture.  Hence, there is no need for any kind of stimulus to initiate this process.\nTo determine the osmotic effect on vesicle quantal size, collect the intracellular cytometry measurements from a group of cells that have been incubated in isotonic and in hypertonic buffer using the experimental condition as described in section 2.13.\n4. Data Analysis of Amperometry Recordings\nTo analyze the recorded amperometry data from exocytosis and intracellular vesicle quantal size analysis, use a software program that allows analysis of current transients in the recorded current versus time trace so that kinetic peak parameters and the integrated total charge for individual current peaks can be determined. For data analysis, we have used software developed in the Sulzer lab that was written for the data analysis program Igor28.\nWhen analyzing the amperometric spikes, select a threshold limit for peaks of three times the root-mean square (RMS) standard deviation of the noise for each recording.\nCollect the amperometric spikes from each cell recording manually to prevent false spikes that do not follow the Gaussian shape, double spikes which can be the result of merged exocytosis events, and only accept Gaussian shaped spikes with a threshold of three times higher than the RMS noise.",
    "Collect the data for total charge per single amperometric peak and use Faradays law (N=QnF) to calculate the molar amount of catecholamine neurotransmitter detected per exocytosis or intracellular single vesicle rupture event, where N is the moles of neurotransmitters going through a redox reaction at the electrode surface, Q=the total charge detected under each spike, n=number of electrons transferred in the redox reaction (n=2 for catecholamines), and the Faraday´s constant F=96485 C/mol.\nPerform statistical analysis of the data collected by first calculating the average charge detected per event for each cell. Then for variance between cells, calculate the average charge between cells and use a student's t-test between cells assuming unequal variance. This study used the MATLAB program for statistical analysis.\n5. TEM Imaging for Vesicle Size Analysis\nTo perform TEM imaging of cells at the different osmotic conditions, first incubate the cells in isotonic or hypertonic buffer for 10 min at 37 °C in a 5% CO2 environment before chemical fixation of cells.\nPerform cell fixation using the Karnovsky fixative method29. Using this method, incubate the cells with a solution containing 0.01% sodium azide, 1% formaldehyde, and 1.25% glutaraldehyde in which the sample can be stored at 4 °C.\nAfter fixation, wash the cells with 0.15 M sodium cacodylate buffer.\nTo stain the cell samples post fixation, and in preparation for TEM imaging, incubate the cells with a 1% osmium tetroxide solution for 2 h at 4 °C, followed by 1 h incubation in 0.5% uranyl acetate solution at room temperature in the dark.\nIn a final fixation step, dehydrate the cells first by rinsing the cells in 100% ethanol and then rinse cells with acetone.",
    "Embed the cell samples in epoxyresin and thereafter perform centrifugation at 4,000 x g for 30-40 min and allow the cell sample to polymerize at 40 °C for 15 h followed by 48 h incubation at 60 °C.\nIn preparation for imaging, section the cell sample embedded in Agar 100 resin into slices with thickness of 60 nm using an ultramicrotome.\nSubject the cells to a 4% uranyl acetate/25% ethanol solution for 4 min followed by 20 s of rinsing with water. Wash the cells with Reynolds lead citrate for 3 min, followed by 20 s of rinsing with water.\nPerform transmission electron microscopy imaging of cell samples. In our experiments, we have used a transmission electron microscope that has been operated at 120 kV.\nFrom each recorded image of a cell section illustrating the cell ultrastructure that displays a population of the vesicles in the cell cytoplasm, first calibrate the image pixel size by relating pixels to the recorded scale bar in each TEM image. Use imaging software to determine the vesicle sizes at each image of cells exposed to isotonic or hypertonic conditions. In our experiments, we used the software ImageJ for image analysis. It is worth noting that for image analysis of cellular ultrastructure from TEM images of cells, size adjustment of these measurements based on thickness of cell sections needs to be considered and have been previously described by Almers´s lab30.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}