{
  "id": 11128,
  "origin_website": "Jove",
  "title": "Microfluidic-based Electrotaxis for On-demand Quantitative Analysis of Caenorhabditis elegans' Locomotion",
  "procedures": [
    "1. Photolithography for Master Mold Fabrication\nBathe a 3 in. silicon wafer in acetone for 30 sec and then methanol for 30 sec. Rinse with dH20 water for 5 min.\nDry the wafer's surface with a N2 blow gun. Heat the wafer on a hot plate at 140 °C for 2 min.\nPlasma oxidize the surface of the silicon wafer (1 min, 50 W).\nSpin-coat the wafer's surface with 3 ml SU-8 100 photoresist (40 sec; 1,750 rpm).\nPre-bake the coated wafer on a hot plate at 65 °C for 10 min, then ramp the temperature up to 95 °C over 2 min. Maintain this setting for an additional 1 hr.\nAlign a photomask containing the desired channel design. Expose the resist to 550-600 mJ/cm2 of UV light (350-400 nm). Photomasks can be designed in AutoCAD and printed on a transparency with high resolution printing.\nPost-bake the wafer on a hot plate at 65 °C for 1 min and 95 °C for 10 min, ramping the temperature as before.\nImmerse the wafer in SU-8 developer solution for 10-15 min. Check for completion of development by rinsing with isopropanol. If a white precipitate appears, continue developing. The master mold is shown in Figure 2A.\n2. Soft Lithography for Microchannel Fabrication\nMix 35 ml polydimethylsiloxane (PDMS) elastomer base with 3.5 ml PDMS curing agent.\nPlace the fabricated master mold (pattern facing up) and a blank silicon wafer into Petri dishes lined with aluminum foil.\nPour 20 ml PDMS prepolymer into the master mold dish and 15 ml into the second dish. Eliminate air pockets underneath the wafers by gently pressing on them with a disposable wooden applicator.",
    "Cover both dishes and set aside for a day to cure. Alternatively, for faster curing, remove air bubbles from the PDMS using a vacuum degasifier and then leave the dishes on a hot plate at 80 °C for 2 hr.\nRemove the foil and peel the PDMS from the wafers.\nUse the Harris Uni-Core (2.5 mm) to punch fluid access ports at both ends of the channel. Cut the channel and blank PDMS into similarly sized strips.\nLoad the channel, the blank PDMS strip and a glass slide (75×25 mm2) into a plasma oxidizer, likely located in a cleanroom. Expose to oxygen plasma for 40 sec at 40 W power.\nStick the channel piece and glass slide to opposite sides of the blank strip. Set aside for 2 hr to complete the bonding.\nPlace the assembly onto a hot plate at 120 °C. Attach plastic tubing (inner diameter 1/32\", outer diameter 3/32\"), each at least 6 in. long, to the punched reservoirs using PDMS prepolymer. Affix a fluidic plastic connector to one or both tubes to allow syringe attachment, or use commercially available fittings.\nAllow the PDMS securing the tubing to cure. Insert 3\" lengths of 22 gauge insulated copper wire into each reservoir, between the inlet tube and the channel, and secure with PDMS prepolymer. The finished product is shown in Figure 2B.\n3. Electrotaxis Experiment\nPlace the microchannel on the stage (preferably XY-movable) of a microscope with a mounted camera connected to a monitor (Figure 1).\nConnect the power supply or amplifier's output wires to the microchannel's electrodes. A simple DC power supply is sufficient if only a DC signal is desired, but an amplifier connected to a function generator allows application of pulsed DC and AC signals as well.",
    "Attach the microchannel's output tube to a disposable syringe. Submerge the mouth of the inlet tube in M9 physiological buffer and gently aspire liquid into the channel by applying a negative pressure inside the syringe (either manually or using a syringe pump). When the inlet and outlet tubes are both filled with M9, disconnect the syringe from the tube. Level both tubes to the same height to prevent hydrostatically driven flow.\nApply a DC voltage to the channel and ensure that resistance (R= V/I) is around 0.6 MΩ (for a 50 mm long, 0.3 mm wide and ~0.1 mm deep microchannel).\nIf satisfied with the channel's integrity, follow the above steps to load worms from a diluted suspension into the channel.\nDisconnect the syringe and hydrostatically manipulate the flow by adjusting the tubes' relative height. Use this method to place a worm in the center of the channel and then lay both tubes flat at the same elevation.\nSet the power supply to the appropriate voltage: 4-12 V/cm for L3 stage animals, 4-10 V/cm for L4s, and 2-4 V/cm for young adults. Activate the electric signal and allow 1 min of pre-exposure for the worm to acclimatize to the field. The worm should begin moving towards the cathode. When the minute has passed, use the camera to begin recording.\nFor AC and pulsed DC experiments, the maximum responsive electric field can be adopted from above and frequency and duty cycle of the signal can be modulated as desired 7, 8.\nWhen experiment is finished, remove all liquid (and worms) from the channel, rinse it with dH20, and leave the device on a hot plate at 125 °C to dry.\nExtract locomotory data from recorded videos manually using NIH ImageJ (http://rsbweb.nih.gov/ij/[href=http://rsbweb.nih.gov/ij/]) or custom MATLAB-based worm tracking software.",
    "Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}