{
  "id": 8409,
  "origin_website": "Jove",
  "title": "Coculture of Axotomized Rat Retinal Ganglion Neurons with Olfactory Ensheathing Glia, as an In Vitro Model of Adult Axonal Regeneration",
  "procedures": [
    "NOTE: Animal experimentation was approved by national and institutional bioethics committees.\n1. ihOEG (Ts12 and Ts14) culture\nNOTE: This procedure is done under sterile conditions in a tissue culture biosafety cabinet.\nPrepare 50 mL ME10 OEG culture medium as provided in Table 1.\nPrepare 5 mL of DMEM/F12-FBS, as provided in Table 1, in a 15 mL conical tube.\nWarm both media at 37 °C in a clean water bath, for 15 min.\nThaw Ts12 and Ts14 cells vials at 37 °C in a clean water bath.\nResuspend and add cells to the DMEM/F12-FBS culture medium prepared in step 2.\nCentrifuge for 5 min at 200 x g.\nAspire the supernatant.\nAdd 500 µL of ME10 medium and resuspend the pellet.\nPrepare a p60 cell culture dish with 3 mL of ME10 and add the cellular suspension, dropwise.\nMove to distribute the cells uniformly across the plate.\nCulture cells at 37 °C in 5% CO2.\n\tNOTE: After reaching confluence, at least another passage must be done to optimize cells for coculture. 90% confluence is needed before seeding them on the coverslips for coculture. A confluent p-60 has a mean cell number of 7 x 105 for Ts14 and 2.5 x 106 for Ts12 cell lines. Ts12 and Ts14 cell lines should be passaged every 2–3 days.\n2. Preparation of ihOEG (Ts12 and Ts14) for the assay\nNOTE: This step must be done 24 h before RGN dissection and coculture.\nTreat 12 mm Ø coverslips with 10 µg/mL poly-L-lysine (PLL) for 1 h.\n\tNOTE: The coverslips can be left overnight in PLL solution.\nWash the coverslips with 1x phosphate buffer saline (PBS), three times.\nDetach Ts12 and Ts14 ihOEG cells from p60 cell culture dish.",
    "Add 4 mL of DMEM/F12-FBS culture medium (Table 1) to a 15 mL conical tube. Warm at 37 °C in a clean water bath.\nRemove the medium from plates and wash cells with 1 mL of 1x PBS-EDTA, once.\nAdd 1 mL of trypsin-EDTA to the OEG cells and incubate for 3–5 min at 37 °C, 5% CO2.\nCollect cells with a p1000 pipette and transfer them to medium prepared in step 3.1.\nCentrifuge for 5 min at 200 x g.\nAspire the supernatant.\nAdd 1 mL of ME10 medium and resuspend the pellet.\nCount the cell number in a hemocytometer.\nSeed 80,000 Ts14 cells or 100,000 Ts12 cells/well onto the coverslips in 24-well plates in 500 µL of ME10 medium.\nCulture cells at 37 °C in 5% CO2, for 24 h.\n3. Retinal tissue dissection\nNOTE: 2-month old male Wistar rats are used as RGN source. Two retinas (one rat) for 20 wells of a 24-well cell dish. Autoclave surgical material before use. Papain dissociation kit is commercially purchased (Table of Materials). Follow the provider´s instructions for reconstitution. Reconstitute D,L-2-amino-5-phosphonovaleric acid (APV) in 5 mM stock and prepare the aliquots.\nOn the day of the assay, prepare the following media.\n\t\nPrepare a p60 cell culture dish with 5 mL of cold EBSS (vial 1 of the papain dissociation kit).\nPrepare a p60 cell culture dish with reconstituted vial 2 (papain) of the papain dissociation kit plus 50 µL of APV.  Then, add 250 µL ofreconstituted vial 3 (DNase plus 5 µL of APV).\nIn a sterile tube mix 2.7 mL of vial 1 with 300 µL of vial 4 (albumin-ovomucoid protease inhibitor). Add 150 µL of vial 3 (DNase) plus 30 µL of APV.\nPrepare 20 mL of Neurobasal-B27 medium (NB-B27) as provided in Table 1.",
    "Sacrifice a rat by asphyxiation with CO2.\nRemove the head by decapitation with guillotine; place it in a 100 mm Petri dish and spray the head with ethanol 70% before placing it in a laminar flow hood.\nCut the rat´s whiskers with scissors so they do not interfere with the eye manipulation.\nGrip the optic nerve with forceps to pull out the eyeball enough to be able to make an incision across the eye with a scalpel.\nRemove the lens and vitreous humor and pull out the retina (orange-like tissue), while the remaining layers of the eye stay inside (including the pigment epithelial layer).\nPlace the retina in the p60 cell culture dish prepared in step 3.1.1.\nTransfer the retina to the p60 cell culture dish prepared in step 3.1.2 and cut it with the scalpel in small pieces of an approximate size < 1 mm.\nTransfer to a 15 mL plastic tube.\nIncubate the tissue for 30 min, in a humidified incubator at 37 °C under 5% CO2, with agitation every 10 min.\nDissociate cell clumps by pipetting up and down with a glass Pasteur pipette.\nCentrifuge the cell suspension at 200 x g for 5 min.\nDiscard supernatant and to inactivate papain, resuspend the cell pellet in the solution prepared in step 3.1.3. (1.5 mL for 2 eyes).\nCarefully pipet this cell suspension into 5 mL of reconstituted vial 4.\nCentrifuge at 200 x g for 5 min.\nWhile centrifuging, completely remove the ME-10 medium from the OEG 24 well cell plate (previously prepared in step 2) and replace it with 500 µL of NB-B27 medium per well.\nDiscard the supernatant and resuspend the cells in 2 mL of NB-B27 medium.",
    "Plate 100 µL of retinal cell suspension, per well of the m24 plate, onto PLL-treated or OEG monolayers-coverslips.\nMaintain cultures at 37 °C with 5% CO2 for 96 h in NB-B27 medium.\n4. Immunostaining\nAfter 96 h, fix the cells for 10 min by adding the same volume of 4% paraformaldehyde (PFA) in 1x PBS to the culture medium (600 µL) (PFA final concentration 2%).\nRemove the media and PFA from the 24-multiwell plate and once again add 500 µL of 4% paraformaldehyde (PFA) in 1x PBS. Incubate for 10 min.\nDiscard the fixer and wash 3 times with 1x PBS for 5 min.\nBlock with 0.1% Triton X-100/1% FBS in PBS (PBS-TS) for 30–40 min.\nPrepare the primary antibodies in PBS-TS buffer as follows: SMI31 (against MAP1B and NF-H proteins) monoclonal antibody (1:500). 514 (recognizes MAP2A and B proteins) rabbit polyclonal antiserum (1:400).\nAdd primary antibodies to cocultures and incubate overnight at 4 °C.\nNext day, discard the antibodies and wash the coverslips with 1x PBS, 3 times, for 5 min.\nPrepare the secondary antibodies in PBS-TS buffer as follows: For SMI-31, anti-mouse Alexa Fluor 488 (1:500). For 514, anti-rabbit Alexa-594 (1:500).\nIncubate cells with the corresponding fluorescent secondary antibodies for 1 h, at RT, in the dark.\nWash the coverslips with 1x PBS, 3 times, for 5 min, in the dark.\nFinally, mount coverslips with mounting medium (Table of Materials) and keep at 4 °C.\n\tNOTE: Whenever necessary, fluorescent nuclei staining with DAPI (4,6-diamidino-2-phenylindole) may be performed. Before mounting, incubate the cells for 10 min in the dark with DAPI (10 µg/mL in 1x PBS). Wash the coverslips 3 times with 1x PBS and finally, mount the coverslips with the mounting medium.\n5. Axonal regeneration quantification",
    "NOTE: Samples are quantified under the 40x objective of an epifluorescence microscope. A minimum of 30 pictures should be taken on random fields, with at least 200 neurons, to be quantified for each treatment. Each experiment should be repeated a minimum of three times.\nQuantify the percentage of neurons with axon (SMI31 positive neurite) relative to the total population of RGNs (identified with MAP2A/B 514 positive immunostaining of neuronal body and dendrites).\nQuantify the axonal regeneration index or mean axonal length (µm/neuron). This parameter is defined as the sum of the lengths (in µm) of all identified axons, divided by the total number of counted neurons, whether they presented an axon or not. Axonal length is determined using the plugin NeuronJ of the image software ImageJ (NIH-USA).\nCalculate the mean, standard deviation, and statistical significance using the appropriate software.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}