{
  "id": 17349,
  "origin_website": "Jove",
  "title": "Destabilization of the Medial Meniscus and Cartilage Scratch Murine Model of Accelerated Osteoarthritis",
  "procedures": [
    "All experimental procedures were approved by the Ethical Review Panel of the University of Glasgow and the University of the West of Scotland, and carried out following the Animals (Scientific Procedures) Act 1986 (UK) guidelines. 10-week-old C57Bl6/J male mice, weighing around 25 g, were used for the present study. The mice were obtained from commercial sources (see Table of Materials).\n1. Animal preparation\nNOTE: Consider mouse gender in regards to the purpose of the study as post-traumatic OA models display important differences depending on gender8,9,10.\nEnsure that the anesthetic reagent (2% isoflurane) is ready.\n\tNOTE: Injectable anesthesia can also be used11. Given the quick duration of the surgery, the use of inhalant anesthesia is recommended.\nUse a separate sham-operated age-matched group as surgical control.\n\tNOTE: The contralateral knee must not be used as a surgical control (sham operation on the contralateral leg). This may have issues in terms of animal welfare, and it will likely affect gait and gait measurements. The contralateral knee normalizes intrinsic bone parameters12 and acts as a paired comparison on evoked pain tests13.\nUse skeletally mature mice.\n\t​NOTE: Most literature induces OA at 8-12 weeks of age. In the present study, the mice are 10 weeks old.\n2. Pre-operative care (carried out by a surgical assistant)\nIf transported from a different facility, allow at least 1 week prior to surgical intervention for mice to adjust to their new environment.\nCarry out surgery in an appropriately designated sterile room, ensuring all surfaces are sterile (e.g., use sterile drapes to cover areas of surgery).\n\tNOTE: The surgery is aseptic.\nArrange and place sterile instruments on sterile drapes.\nWeigh the mouse.\nInduce anesthesia by introducing the mouse in an anesthetic cage and then introducing 2% isofluorane for upto 15 min using a standard anesthetic rig (see Table of Materials).",
    "NOTE: The cage must not have \"residual\" anesthesia prior to introducing the mouse.\nOnce anesthetized, take the mouse out of the anesthetic chamber and clip the fur over the knee, front and lateral sides from the mid-shin to the mid-thigh with small hair clippers.\n\tNOTE: The choice of hindlimb knee is up to the operator's preference on which side they find easier to conduct the surgery. This protocol operated on the left leg.\nEnsure the mouse is fully anesthetized (non-responsive to pinching the foot).\nDisinfect skin by applying antibacterial skin cleanser (e.g., containing chlorhexidine or iodophor, see Table of Materials) on shaved exposed skin.\nFor analgesia, administer 0.05 mg/kg of buprenorphine subcutaneously.\nPlace the mouse on the dorsal side, leaving the knee to be operated on upwards, and place the mouse nose in the nozzle connected to the anesthetic rig.\nCover the mouse with a sterile drape with a small keyhole opening.\nPosition the leg to be operated on with the knee flexed at less than 90°, with the patellar ligament facing upwards and the foot immobilized with surgical tape.\n3. Destabilization of the medial meniscus procedure followed by cartilage scratch\nAdjust the microscope to focus on the patellar ligament.\nPinch the skin of the knee on the lateral side with serrated forceps (see Table of Materials), make a small cut parallel to the distal patellar tendon using surgical scissors, introduce the scissors and expand the cut to about 1 cm. Move the skin over to the medial side, exposing the patellar ligament and the proximal tibial plateau (Figure 1).",
    "With a number 11 blade, make an incision along the medial side of the patellar ligament, from the top to the bottom of the ligament (Figure 1A). When reaching the bottom of the patellar ligament, turn the blade 90° and extend the incision away from the patellar ligament toward the medial side to gain access to the joint capsule.\n\tNOTE: Bleeding may occur in this or the subsequent steps. If bleeding occurs use a sterile cotton bud and apply pressure a few seconds (5 to 30 s).\nPinch the patellar ligament with blunt tip forceps and rotate the wrist to move the patellar ligament to the lateral side, just enough to expose the infrapatellar fat pad (IFP).\n\tNOTE: To minimize damage to the patellar ligament, do not hold the tweezers too tight, just sufficient to keep the ligament to the side.\nWhile still holding the patellar ligament lightly, pinch the IFP with micro-tweezers (see Table of Materials) to raise it and move it slightly upward. This allows visualizing the medial meniscus ligament.\nIdentify the medial meniscotibial ligament (MMTL) of the medial meniscus, which anchors the cranial horn of the medial meniscus to the anterior tibial plateau (Figure 1B).\nAvoid damage and prolonged cartilage exposure at the tibial plateau or femoral condyle.\nCarefully sever the MMTL with small 2 mm blade Vannas spring scissors, leaving the medial meniscus and other ligaments intact. At this point, the surgical procedure for the DMM model is completed (Figure 1C).\nWith a 3 mm microsurgical knife, mark three evenly spaced indentations on the tibial articular cartilage in a direction from the posterior to the anterior part.\n\tNOTE: The scores are about 1 mm in length and only damage the surface of the cartilage (Figure 2D).",
    "Do not use excessive force with the blade onto the cartilage (i.e., ensure the scratches are superficial). This additional step inflicts cartilage damage, inducing the DCS model.\nClose the skin with two or three small 7 mm wound closure metal clips or absorbable 6-0 subdermal surgical sutures (see Table of Materials).\n\tNOTE: Subdermal surgical sutures are better as they avoid further intervention, but they extend the surgery duration. External sutures increase the risk of wound opening by the gnawing of the mice.\nIdentify the medial meniscotibial ligament of the medial meniscus for sham surgery, but do not sever.\nFor mice only receiving cartilage scratches, make the three superficial scratches without severing the ligament.\n\t​NOTE: Between each mouse, change gloves and sterilize instruments via autoclave. Remember to check the instruments have cooled before re-use.\n4. Post-operative care\nIf bleeding has occurred (>50 uL), inject 500 µL of warm sterile saline subcutaneously (on the back of the mouse).\n\tNOTE: In our experience, although mice have minor bleeds, it never is more than a small drop, and thus fluids do not need to be replenished.\nAfter surgery, place the mouse in a recovery cage on a clean paper tissue and allow recovery from anesthesia (5-10 min).\nTransfer the fully conscious mice into a clean cage with fresh bedding after surgery.\nIn the 72 h after surgical intervention, monitor for any signs of pain or distress. Pay attention to:\n\t\nChanges in body weight. Although body weight may decrease on the first and second day, this is usually no more than 5% of the pre-surgical body weight.\nGeneral lack of grooming or over-grooming around the incision.\nSigns of general health deterioration, such as hunched posture, facial grimacing, and/or abnormal respiration.\nWound infection as indicated by any swelling, discharge, or opening of the wound.",
    "NOTE: Infection may occur if the surgical wound opens. As surgical wound repair (e.g., replacing missing metal clips or re-suturing) is a regulated procedure, ensure relevant approval is obtained prior to performing repairs.\nRemove metal clips between 5-7 days post-surgery.\nMaintain mice typically 2-52 weeks post-operatively depending on the study design.\nEvaluate pain/gait at any point during the study.\n\tNOTE: The present study uses dynamic weight-bearing as described in step 5.1.\nEuthanize the animal by an approved method, according to the national licensing agreements, local guidelines, and experimental approval.\n\t​NOTE: In the present study, the animals were euthanized via exsanguination (cardiac puncture) under terminal anesthesia followed by cervical dislocation14.\n5. Evaluation of osteoarthritic disease\nMeasure dynamic weight bearing as a surrogate measurement of pain following the steps below.\n\tNOTE: As mice are prey animals, they tend to hide pain behaviors. This makes the measurement of pain difficult. There are many ways to measure evoked pain, such as Von Frey15 and gait analysis16. The present study measured the differential load between the operated osteoarthritic leg and the unoperated control leg on a pressure mat while the mouse was in a cage (see Table of Materials, Figure 2A).\n\t\nWeigh the mouse. Tare and calibrate the pressure mat according to manufacturer's specific instructions (see Dynamic weight-bearing equipment in Table of Materials). Introduce the mouse in the cage.\nRecord movement and paw pressure of the mouse in the cage for 5 min. Analyze acquired data to validate 1 min, following manufacturer's instructions.",
    "NOTE: The manufacturer's automated analysis on DWB software (see dynamic weight-bearing equipment in Table of materials) provides measurements on each paw in proportion to the total body weight, the amount of the validated time that each paw remained on the mat, and an estimation of the mat area occupied by each paw. This allows the calculation of the differential load between the two rear paws, the differential load between the front and rear paws, an increase of front paw loading (if the same mouse has been measured over a period of time), the time spent lifting the OA leg in comparison to the contralateral leg and the paw surface.\nQuantify calcified tissue through microcomputed tomography (µCT).\n\tNOTE: Although subchondral bone osteosclerosis and osteophyte formation can be measured in histological sections, µCT offers the opportunity to quantify three-dimensionally. The resolution of image capture in µCT at 5 µm is sufficient, as this allows visualization of smaller structures such as the osteophytes, although the higher the resolution, the better.\n\t\nFix knee joints in 4% paraformaldehyde solution for 24 h, then transfer to 70% EtOH.\nScan knee joints in a µCT scanner.\n\t\tNOTE: In the present study, the samples were scanned on a µCT scanner (see Table of Materials) with a 0.5 aluminum filter set at 50 kV and 200 µA. Samples were examined at a voxel size of 4.5 µm; 2 µm, 0.2° rotation angle for imaging, and 0.5° rotation angle for quantification.\nReconstruct scans to allow 3D visualization. The scans presented here were reconstructed using compatible software (see Table of Materials).\nAnalyze subchondral bone sclerosis (Figure 2B) following the steps below.\n\t\t\nSelect a volume of interest (VOI) of 0.5 mm × 0.9 mm × 0.9 mm in the center of the load of the medial tibial plateau17.",
    "Normalize against the intrinsic bone phenotype of the mouse by analyzing the unoperated leg.\nDetermine the subchondral bone density and micro-architecture by selecting a region of interest (ROI) delineating the trabecular structure within the tibial epiphysis, the subchondral plate, or the total subchondral bone in the two-dimensional coronal view of the stack using CTan software (see Table of Materials).\n\t\t\tNOTE: As the disease progresses, the separation between the subchondral plate and subchondral trabecular region becomes more difficult to distinguish. It is then recommended to analyze the area of subchondral bone selected from the joint space to the growth plate.\nQuantify osteophytes (Figure 2C) following the steps below.\n\t\t\nIdentify osteophytes in the reconstructed three-dimensional image stacks using CTvol software (see Table of Materials).\n\t\t\tNOTE: Mineralized osteophytes are protrusions similar to woven bone visible on the medial side of the subchondral bone18. An example of these is indicated with yellow arrows in Figure 2C.\nManually count the number of identified osteophytes in the medial side of the knee joint.\nMeasure osteophyte volume in 2D sequential image analysis (using the CT analyzer) by delineating the edge of osteophytes manually, protruding from the subchondral plate as the region of interest (ROI) for analysis.\nCalculate osteophyte bone density as the ratio of bone volume over osteophyte volume using the CT analyzer software (see Table of Materials).\nEvaluate cartilage damage and synovitis (Figure 2D) according to the OARSI cartilage damage score19 and synovitis score20 on paraffin-embedded 6 µm sections.\n\t\nAfter scanning, decalcify knee joints in 10% EDTA at 4 °C for a minimum of 2 weeks, changing solution twice a week.\nEmbed samples in paraffin. For treatments and incubation periods, see Supplementary File 1.\nCut 5 µm coronal sections of paraffin-embedded samples on a rotary microtome (see Table of Materials).",
    "Select sections in the area where the tibial and femoral condyles meet (Figure 2D). Select two sections in three equally distanced areas of the joint.\n\t\tNOTE: Sections scored in the present study were selected in areas 80-100 µm apart.\nStain sections with Safranin-O and Fast green (see Table of Materials) following the steps below.\n\t\t\nDeparaffinize sections by submerging them (in the mentioned sequence) in Xylene for 5 min (2x), 100% ethanol for 2 min, 95% ethanol for 2 min, 80% ethanol for 2 min, and 70% ethanol for 2 min.\nStain with filtered Haematoxylin (see Table of Materials) for 30 s. Then rinse in tap water for 5 min (three times).\nWash with Scott's buffer (2 g of sodium bicarbonate and 10 g of magnesium sulfate in 1 L of distilled water) for 2 min. Rinse in 'tap water' for 5 min (three times).\nStain for 4 min with 0.2% Fast green. Dip in 1% glacial acetic acid, five times (freshly made each session). Rinse quickly in tap water.\nStain for 5 min with 0.5% Safranin-O. Rinse in 95% ethanol. Dehydrate sections in 100% ethanol for 3 min followed by 3 min in Xylene.\nScore sections as stated in Glasson et al. for cartilage19 and Jackson et al. for synovitis20.\n\t\tNOTE: Other methods of quantification exist, such as the computer-based quantification by Pinamont et al.21.\nValidate the scoring system with two different scorers, blinded to the experiment."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}