{
  "id": 2333,
  "origin_website": "Cell",
  "title": "Protocol to detect smooth muscle actin-alpha and measure oxidative damage in neonatal mouse intestine",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPart I: Whole mount immunofluorescent detection of αSMA\nTiming: 2–3 days\nαSMA proteins are labeled by fluorescent conjugated antibodies in mouse intestine tissue slices in this part.\nNote: The following protocol is an optimization of a previously published protocol in adult mouse intestine (Bernier-Latmani and Petrova, 2016[href=https://www.wicell.org#bib2]; Suh et al., 2018[href=https://www.wicell.org#bib9]). The following protocol is recommended for younger tissues that are less mature and have better tissue permeability than older tissues. Representative images of the whole mount immunofluorescent stain are available in Figure 4[href=https://www.wicell.org#fig4].\nNote: Conjugated αSMA clone 1A4 antibodies are recommended when staining mouse tissue to minimize background signal.\nNote: Methanol fixation will quench intrinsic fluorescent signal such as transgenic GFP or tdTomato. However, using anti-GFP or anti-RFP antibodies, respectively, to detect quenched fluorescent proteins can circumvent this inconvenience.\nUse spring scissors to separate tissue of interest from methanol-fixed samples into smaller pieces for better penetration. Collect into a round end 2 mL Eppendorf tube in PBS.\nWash the tissue 3 times with ice-cold PBS for 5 min each.\nOptional: If working with intestines collected from mice older than P9: Before transferring to blocking reagent, permeabilize tissues in PBST-100 (0.3% Triton-X-100) for 6 h at 4°C with gentle rocking. Block for 3 h at 4°C with mild agitation. Use enough blocking reagent to completely submerge all tissues to avoid tissue drying.\nIncubate with anti-αSMA antibody and other primary antibodies of interest at 4°C for 12–16 h with gentle agitation. Primary antibodies are diluted in fresh blocking reagent with optimal dilution titers. We use 1:100-1:200 for conjugated αSMA antibody.\nNote: The antibody-blocking solution should be filtered with 0.22 μm filter before adding to the samples. Avoid light when handling conjugated antibodies.",
    "Pause point: Samples can be left in primary antibodies at 4°C for more than 1 day if needed.\n(Go to step 7 if using conjugated antibodies and do not need secondary antibody incubation). Wash with ice-cold PBST-100 (0.3% Triton-100) with gentle rocking at 4°C for five hours, change buffer every hour for 5 times.\nNote: Some primary antibody solutions can be reused if stored at −20°C. However, we do not recommend reusing antibodies that cannot be refrozen after thawing.\nNote: Fluorescent dyes are light sensitive; minimize ambient light exposure when handling fluorescent dye-conjugated antibodies.\nIncubate with secondary antibody at 4°C with gentle agitation for 12–16 h.\nOptional: Can incubate tissues with DAPI (1:1000 dilution in secondary antibody-blocking solution) to visualize cell nuclei if needed.\nNote: Avoid prolonged secondary antibody incubation to minimize background caused by non-specific secondary antibody binding.\nNote: We recommend filtering the secondary antibody with 0.22 μm filter before applying to the tissues.\nWash with ice-cold PBST-100 (0.3% Triton-X-100) every 30 min, 10 times, at 4°C with mild agitation.\nWash with ice-cold PBS for 10 min, 3 times, at 4°C with mild agitation.\nFix with 4% PFA/PBS at 4°C for 12–16 h.\nNote: For tissues thicker than 0.5 cm, we recommend leaving at 4% PFA for two days.\nWash with ice-cold PBS for 10 min, 3 times.\nNote: For tissue embedding, slice the intestine with spring scissors and mount in FocusClearTM/Prolong Gold antifade reagent for confocal imaging (Figure 4[href=https://www.wicell.org#fig4]) (Bernier-Latmani and Petrova, 2016[href=https://www.wicell.org#bib2]). The final thickness of the embedded tissue should be no thicker than 2–3 layers of villi.",
    "Note: If the goal is to visualize details in muscularis externa, we recommend cutting the intestine into pieces and mount with villi facing downward (Figure 5[href=https://www.wicell.org#fig5]). Alternatively, tissues can be embedded and sectioned after whole mount immunofluorescent staining if needed.\nNote: Please refer to (Bernier-Latmani and Petrova, 2016[href=https://www.wicell.org#bib2]; Suh et al., 2018[href=https://www.wicell.org#bib9]) for detailed tissue embedding and confocal imaging instructions.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1824-Fig5.jpg\nFigure 5. Whole mount immunofluorescent staining of αSMA in muscularis externa\nCo-labeling of αSMA (red) and Lyve1 (green) in P9 jejunum muscularis externa, note the arrangement of longitudinal muscles. Scale bar = 30 μm.\nPart II: Tissue protein carbonyl measurement\nProtein extraction\nTiming: 3 h\nExtract total proteins from the intestine for downstream analysis. This is a separate protocol parallel to αSMA immunofluorescent detection described in Part I.\nNote: Carbonyl derivatives (protein-C=O; Figure 6[href=https://www.wicell.org#fig6]A) are irreversible products of ROS-mediated protein oxidation. Protein carbonyl groups are often used as a general biomarker for oxidative injury (Fedorova et al., 2014[href=https://www.wicell.org#bib6]; Dalle-Donne et al., 2003[href=https://www.wicell.org#bib5]; Chevion et al., 2000[href=https://www.wicell.org#bib3]), and we use protein carbonyl as a marker to quantify oxidative injury. There will always be baseline protein carbonyls in the cell, therefore it is essential to include a control sample versus the experimental group.\nHomogenize tissue samples.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1824-Fig6.jpg\nFigure 6. Detection of protein carbonyls\n(A) The biotin conjugated hydrazide reagent reacts with carbonyl group on oxidized proteins and biotinylates carbonylated proteins.",
    "(B) Representative outcome from Part II. Three samples (WT, wildtype; HET, heterozygote; and MUT, homozygotic mutant) collected from P1.5 Pitx2ASE littermates are measured in this experiment. Samples were processed as described in Part II and blotted on three separated membranes (Left: samples purified with streptavidin (SA) pulldown assay, middle: samples purified with αSMA-immunoprecipitation, right: lysates without further purification/enrichment). Note that the same 3 blots are first probed in primary detection (shown on top), then probed in secondary detection (shown in bottom) on the next day. Reagents (red: αSMA antibody, yellow: streptavidin-HRP) used for protein detection in both primary and secondary detections are color-labeled. The red color indicates saturated signal on the blot.\nRetrieve and thaw samples from −80°C on ice for 5–10 min.\nMake homogenization buffer by adding phosphatase/protease inhibitor cocktail to Biotin-Hydrazide homogenization buffer per label description. Add an adequate amount of buffer to the samples. We recommend adding 500 mL to each intestine sample taken from E18.5-P1.5 mouse. Larger tissue may need more buffer.\nUse a tissue grinder pestle to homogenize tissues completely until no visible tissue chunks remain.\nShear genomic DNA by passing the homogenized samples up and down through a 1 mL syringe with a needle <25 G. Do this 30 times on ice.\nNote: Keep the tubes on ice at all times to avoid protein degradation.\nSpin at 150 g for 10 min at 4°C.\nCollect supernatant into a new tube and add SDS to make final concentration of 2%.\nNote: We recommend making 20% SDS stock solution in homogenization buffer with protease inhibitor beforehand. Add 1:10 v/v of the premade SDS stock solution to the collected supernatant to make final SDS concentration of 2% in the sample tubes.\nHeat the sample with SDS at 65°C for 5 min.",
    "Spin at 18,000 g for 1 h at 4°C.\nCollect the supernatant into a new tube and measure protein concentration for each sample.\nNote: SDS interferes with several protein assays. Most commercial protein assays include literature on detergent compatibility, which should be consulted prior to use. Protein concentration can be measured at this step with a protein assay compatible with 2% SDS, if samples are run undiluted. To circumvent SDS interference, samples can be diluted to a level of SDS within the protein assay compatibility range. Alternatively, the protein concentration can be determined prior to SDS addition (step 12), and the final concentration calculation adjusted for the volume of SDS added. For any protein assay, a buffer only control should be run to assess any signal contributed by buffer components.\nBiotin-hydrazide incubation\nTiming: 4 h\nThis step labels protein carbonyl with biotin-hydrazide.\nTake 100–200 μg of protein samples from each tube, top to 400 μL with homogenization buffer with protease inhibitor from step 12.\nAdd 10 μL of EZ-link Hydrazide-biotin (stock solution: 50 mM in DMSO, store at −20°C) to the sample, bringing the total volume of labeling mix to 410 μL.\nIncubate the labeling mix at 20°C–25°C with gentle agitation for 2 h.\nConcentrate sample and remove unreacted Hydrazide-biotin and SDS.\nAdd samples (410 μL) to an Amicon Ultra-0.5 mL centrifugal filter, prepped following manufacturer’s instructions.\nSpin at 14,000 g for 10 min.\nDiscard flowthrough, add 400 μL PBS, then spin at 14,000 g for 10 min. Repeat twice.\nRecover the samples into a clean tube by spinning at 1,000 g for 2 min. The volume of concentrated samples should be around 40 μL. Add another 20 μL PBS to bring sample volume to 60 μL. Measure protein concentration again.",
    "Alternatives: We use Amicon Ultra 0.5 mL DNA/Protein centrifugal filters, UFC501024, Millipore for step 19. Other protein desalting and concentrating columns or methods such as TCA precipitation should be equally effective.\nNote: Concentrated samples should be arranged into three aliquots for streptavidin pulldown assay, αSMA immunoprecipitation (IP), and lysate control. We recommend using roughly 45% of the protein samples for Streptavidin pulldown, 45% for αSMA IP assay, and 10% for the lysate control (step 31).\nStreptavidin pulldown\nTiming: 1.5 days\nThis step isolates all Biotin-Hydrazide labeled proteins (total carbonylated proteins) in the lysate.\nPre-wash Streptavidin beads and equilibrate in PBS.\nMix beads gently by pipetting or inversion of bottle until a homogeneous suspension. Use a cut-off pipette tip to transfer 100 μL of resuspend streptavidin beads to a clean 1.7 mL tube.\nNote: Do not vortex the beads.\nSpin at 500 g for 1 min at 20°C–25°C. Discard supernatant.\nResuspend the beads with 500 μL of PBS (10 volumes of PBS to beads), centrifuge at 500 g for 2 min and discard supernatant. Repeat two more times.\nResuspend the beads in 50 μL of PBS.\nAliquot beads into clean tubes.\nAdd an aliquot of protein samples from step 19 to the tubes with streptavidin beads.\nNote: We use approximately 15 μL of resuspended beads from step 20 for 75–100 μg of biotinylated proteins from step 19, making a 50% beads-sample slurry for step 21.\nGently mix the samples and streptavidin beads. Keep rocking for 12–16 h at 4°C.\nRemove unbound proteins.\nSpin down the beads at 2,000 g for 2 min in 20°C–25°C. Collect supernatant to confirm pulldown efficiency later (see step 32).\nResuspend beads with 1 mL of 0.01% SDS in PBS, centrifuge at 2,000 g for 2 min.",
    "Repeat step 23b four more times. Leave 30 μL of wash buffer in the last wash and resuspend the beads by gentle pipetting.\nProtein elution.\nAdd 30 μL of 2× SDS Laemmli sample buffer to the sample.\nBoil at 98°C on a heating block for 5 min.\nCentrifuge at 2,000 g for 2 min.\nCollect supernatant into a clean tube for SDS-PAGE. Avoid collecting beads.\nPause point: Samples can be frozen and kept at −80°C after step 24b for at least one week.\nαSMA immunoprecipitation (IP)\nTiming: 1.5 days\nThis step isolates all αSMA proteins (regardless of oxidative status) in the lysate.\n(Start from step 19) Take 75–100 μg of protein samples and add 2–4 μL of unconjugated αSMA antibody clone 1A4. Incubate at 4°C with rotation for at least 12 h.\nNote: Leave for 12–16 h with step 22 if doing streptavidin pulldown in parallel.\nNote: The amount of αSMA antibody used for IP immunoprecipitation depends on αSMA abundance in the sample. Please scale up antibody volume if starting with more samples.\nPre-wash protein G Sepharose beads before use.\nTake 100 μL of protein G Sepharose beads suspension with a cut-off pipette tip, spin at 150 g at 4°C for 2 min. Discard supernatant.\nWash with 1 mL PBS, spin down at 150 g at 4°C for 3 times.\nAliquot protein G beads slurry to each tube, each tube should have 15–25 μL of protein G beads slurry. Make sure each tube gets equal amount of protein G beads.\nNote: Do not vortex the beads.",
    "Note: The αSMA antibody clone 1A4 is mouse IgG2a subtype, which would also be compatible with capture by protein A. If a different αSMA antibody is used for the IP, the choice of protein A and/or G beads for antibody capture should be based on the affinity of the antibody IgG subtype for protein A and G. This information is readily available from commercial supplier websites.\nAfter 12–16 h incubation is complete (step 25), add biotin-hydrazide labeled protein-αSMA antibody mix to the tubes with protein G beads. The amount of sample mix to protein G beads slurry should be roughly 1:1 (v/v). Rotate at 4°C for 4 h.\nSpin at 150 g at 4°C for 2 min to collect beads. Save 20 μL supernatant into a separate tube for IP efficiency control. Remove and discard remaining supernatant, containing unbound material.\nWash beads with 500 μL PBST-100 (1% Triton-X-100), spin at 150 g at 4°C for 5 times.\nElution:\nAdd 30 μL of 2× Laemmli sample buffer with 100 mM DTT and boil on a heating block for 5 min.\nSpin at 150 g at 20°C–25°C for 5 min, collect supernatant for SDS-PAGE.\nPreparing controls\nTiming: 30 min\nControl samples are processed in this step.\nLysate control (see step 19):\nTake 1/10 (g/g) of proteins used for pulldown/IP assay from dialyzed biotinylated samples.\nBring the volume to 30 μL by adding PBS.\nAdd 30 μL of 2× sample buffer.\nBoil on a heat block for 5 min, take 30 μL for SDS-PAGE.\nNote: The amount of sample mix to protein G beads should be at a minimum 1:1 (v/v).\nSupernatant control for pulldown efficiency.\n(Start from step 23a and step 28) Take 5 μL of supernatants and add 25 μL of PBS.\nAdd 30 μL of 2× sample buffer.",
    "Boil for 5 min, take 30 μL for SDS-PAGE.\nSDS-PAGE and western blot\nTiming: 1.5 days\nCarbonylated proteins are separated and detected in this step.\nRemove the gel comb and tape if using precast gels. Equilibrate the gel to 20°C–25°C.\nOptional: Researchers can also prepare their own polyacrylamide gels, versus using precast gels. Gel pouring systems (with instructions for preparation) are available from several suppliers (e.g., Bio-Rad min-PROTEAN handcast system).\nRinse/flush the wells thoroughly with running buffer before loading the samples.\nLoad samples and ladder accordingly.\nRun the SDS-PAGE with 110 V for 90 min.\nWhile the SDS-PAGE is running, prepare transfer buffer and cool at 4°C.\nSoak nitrocellulose membrane in transfer buffer for 10 min and mark the orientation of membrane.\nComplete a wet transfer at 60 V for 2 h.\nNote: This protocol uses the CriterionTM cell, blotter, and precast 8%–16% gels for SDS-PAGE. Appropriate running time and voltage for SDS-PAGE and transfer should be adjusted for different percentage gels and/or transfer systems.\nNote: To compare the relative signal between samples, samples must be run and transferred on the same gel. Thus, all αSMA or all streptavidin pulldown samples should be run together on a single gel.\nMake blocking solution during the wait: 5% BSA in TBST or 5% skim milk in TBST.\nOptional: Transfer efficiency and sample loading can be visualized with a Ponceau S staining solution. Wash membrane in TBST until the bands are no longer visible prior to continuing with step 41.\nIncubate the blot in blocking reagent for 1 h at 20°C–25°C with gentle agitation.\nWash the membrane with TBST three times for 5 min each at 20°C–25°C.\nIncubate in primary antibody (dilute in blocking reagent) or streptavidin-HRP (dilute in TBST) for 12–16 h at 4°C with gentle agitation.",
    "Note: In the initial detection, add the corresponding reagent to the blot:\nStreptavidin pulldown blot: αSMA Ab (detect carbonylated αSMA).\nαSMA-IP blot: Streptavidin-HRP (detect all carbonylated proteins in the purified αSMA samples).\nLysate blot: αSMA Ab (detect total αSMA across samples, ideally band intensity at ∼42 kDa should be comparable between samples to demonstrate equal amount of αSMA expression across samples).\nNote: For blots incubated in streptavidin-HRP, skip to step 46.\nNote: Suggested antibody working concentrations are available in the manufacturer’s instructions, which may need to be adjusted for optimal signal. We used a 1:400 dilution for primary antibody (αSMA, A2547) in this step, followed with a 1:2000 dilution for secondary antibody (rabbit anti-mouse HRP, ab6728) in step 45. Blots were incubated with Streptavidin-HRP (016030084) at a concentration of 0.1 μg/mL.\nPause point: Blot can be left in primary antibody for more than 16 h if needed.\nWash the blots with TBST three times for 5 min each at 20°C–25°C.\nIncubate the streptavidin pulldown blot and lysate blot with secondary antibody (HRP conjugated anti-mouse secondary antibody in TBST or blocking reagent from 32) for 1 h at 20°C–25°C.\nWash the blots with TBST three times for 10 min each at 20°C–25°C.\nIncubate the blots in fresh luminol buffer mix.\nNote: Many chemiluminescent western blotting substrates choices are available, and we used the PerkinElmer Western Lightning Plus-ECL substrate. We visualized our proteins with a Bio-Rad ChemiDoc MP system. Proteins can be visualized by exposing the blot to film or any comparable imager capable of chemiluminescence.\nIncubate the blots in fresh luminol buffer mix for 1 h to saturate and deplete remaining HRP activity.\nReturn to step 42 for the secondary detection.\nNote: In the secondary detection, add the corresponding reagents to the blots for “primary Ab incubation”:",
    "Streptavidin pulldown blot: Streptavidin-HRP (for total carbonylated proteins comparison across samples).\nαSMA-IP blot: αSMA Ab (ideally band intensity ∼42 kDa should be comparable between samples to demonstrate comparable αSMA-IP efficiency across samples).\nLysate blot: Streptavidin-HRP (for total carbonylated proteins comparison across samples, should show similar trend as in the Streptavidin pulldown blot).\nNote: The above-described protocol in Part II is an optimized version from previous protocol dealing with cultured cell lysate and crude adipose tissue extract (Grimsrud et al., 2007[href=https://www.wicell.org#bib7]; Xu et al., 2014[href=https://www.wicell.org#bib10]). The previous protocol did not involve specific protein purification steps we described in Streptavidin pulldown and αSMA immunoprecipitation."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Cell Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}