{
  "id": 9740,
  "origin_website": "Jove",
  "title": "Live-imaging of PKC Translocation in Sf9 Cells and in Aplysia Sensory Neurons",
  "procedures": [
    "1. Preparation and Maintenance of Sf9 Cell Monolayer Cultures \nSf9 cell culture and maintenance is performed in a tissue culture hood.\nSf9 cells are derived from Spodoptera frugiperda ovarian cells (Sf21 cells) and can be purchased as frozen cells in Grace's media from Invitrogen.\nPlace 8 mL of Grace's insect medium, supplemented (1X), to which 30% fetal bovine serum (FBS) has been added in a 75 cm2 cell culture flask with a canted neck.\nThaw the frozen tube of Sf9 cells rapidly in a 37°C water bath by moving the tube back and forth (about 1-2 minutes).\nTransfer Sf9 cells to the 75 cm2 cell culture flask and rock plate gently by hand to distribute the cells evenly.\nIncubate 1-2 hours at 27°C until cells have attached.\nRemove old medium and replace with 10 mL of freshGrace's insect medium with 30% FBS.\nIncubate at 27°C until the cells are confluent.\nTo maintain monolayer cultures, remove old medium from the confluent flask of Sf9 cells and add 5 mL of Grace's insect medium with 10% FBS.\nLightly tap on the side of the flask several times to detach Sf9 cells.\nUsing a 10 mL pipette and a pipettor, pipette the media up and down once gently, spraying flask wall while pipetting down. Transfer the cells to a sterile 15 mL Polysterene tube.\nAdd 2 mL of Sf9 cell suspension to 8 mL of Grace's insect medium with 10% FBS (1:5 dilution to maintain log phase growth) in new 75 cm2 cell culture flask and rock plate gently by hand.\nIncubate at 27°C until the cells are confluent.\n2. Expression of Fluorescently Tagged PKCs in Sf9 Cells",
    "For live-imaging experiment, culture Sf9 cells on 35 mm MatTek glass bottom culture disheswith a glass surface of 14 mm and a coverslip thickness of 0.16 to 0.19 mm.\nPKCs tagged with fluorescent proteins are expressed in Sf9 cells using Cellfectin II transfection reagent following recommendation of the manufacturer with the modifications detailed below.\nDay 1: Prior to plating the cells, treat each MatTek dish with Grace's insect medium with 10% FBS for at least 30 minutes.\nCount Sf9 cells from step 11 (above) using a hemacytometer.\nPlate 0.05 x 106 cells on each MatTek glass coverslip in a total volume of 150 μL. Allow the cells to attach for 30 minutes at room temperature.\nAdd 2 mL of Grace's supplemented with 10% FBS to each dish 1 mL at a time slowly to avoid detaching the cells.\nIncubate at 27°C overnight.\nFrom this point on, use manufacturer's recommendation for transfection of Sf9 cells with plasmid DNA.\nDay 2: Transfect Sf9 cells with fluorescently tagged PKCs using Cellfectin II transfection reagent. We have often co-expressed in this system PKCs tagged with enhanced Green Fluorescent Protein (eGFP) and monomeric Red Fluorescent Protein (mRFP) (details for plasmid construction have been previously described 2,5). Expression of one fluorescent protein at a time yields about 70-80% expressing cells 72 hours post-transfection. Co-expression of two fluorescent proteins decreases transfection efficiency to about 30% co-expressing cells. When co-expressing eGFP-tagged PKC and mRFP-tagged PKC, use 2x more plasmid DNA for the mRFP-tagged protein for optimal protein expression.\nPerform live-imaging 48-72 hours post-transfection (for optimal protein expression, wait 72 hours).\n3. Expression of Fluorescently Tagged PKCs in Aplysia Sensory Neurons\nPreparation of Aplysia neuronal cell cultures has been described in a video article by Zhao and colleagues 4.",
    "PKCs tagged with fluorescent proteins are expressed in Aplysia sensory neurons using microinjection procedure detailed below.\nPrepare a stock solution of 1% Fast Green (FCF) in distilled water, filter using a syringe and a 28 mm syringe filter (0.20 μm). Aliquot and store at -20°C. \nMicroinjection of the sensory neurons can be performed on day 1 or day 2 after isolating the neurons but we find that waiting 2 days allows for better cell adherence to the coverslip.\nOn day 2 after isolation of the sensory neurons, thaw an aliquot of Fast Green and filter it again using a syringe and a 28 mm syringe filter (0.20 μm).\nPrepare a solution of plasmid DNA in distilled water containing 0.5% Fast Green. Concentrations of plasmid DNA as high as 0.4 μg/μL can be used but it is not recommended to go above these values. \nFilter the plasmid DNA / Fast Green solution using a 1 mL syringe and a 4 mm syringe filter (0.20 μm).\nCentrifuge the plasmid DNA / Fast Green solution at 16110 x g for 15 minutes using a microcentrifuge.\nPrepare sharp electrodes for microinjection of neurons using a microelectrode puller (Sutter Flaming/Brown Micropipette Puller, Model P-97). Using a box filament, pull glass microelectrodes with 1 mm outer diameter, 0.75 mm inside diameter and 100 mm length using thin wall glass capillaries with a filament inside (World Precision Instruments TW100F-4). For more information about pulling microinjection electrodes please refer to Sutter electrode cookbook.\nFill each electrode with 2 μL of plasmid DNA / Fast Green solution using microloader pipette tip (eppendorf CA32950-050).\nTransfer the MatTek glass bottom culture dish containing Aplysia neuronal cultures to the microinjection station.",
    "The microinjection station consists of the following: a home-made large glass stage to hold the culture dishes on a vibration isolation table (Kinetic Systems vibration isolation workstation), a stereo-scope with external halogen illumination, a micromanipulator (Sutter Huxley Wall Type Micromanipulator which allows both coarse and ultra-fine positioning in the three-axis), a microelectrode holder connected to a pneumatic pump (World Precision Instruments PV820 Pneumatic Pico-Pump). The pressure Input of the pneumatic pump is connected to a compressed Nitrogen tank.   \nInsert a microelectrode into the microelectrode holder.\nViewing under a stereo-microscope, insert the tip of the micropipette into the cell nucleus.\nDeliver short pressure pulses of Nitrogen (10 to 100 ms in duration; 20 lb/in2) until the nucleus becomes uniformely green.\nIncubate the cells for 4 hours at room temperature and keep at 4°C until use. For optimal PKC translocation, perform live-imaging experiment 20 - 24 hours post-injection.\n4. Visualization of PKC Translocation in Living Sf9 Cells and in Aplysia Sensory Neurons\nFor imaging, we use a Zeiss LSM510 inverted confocal microscope with an Axiovert 200.\nImaging protocol is the same for Sf9 cells and for Aplysia sensory neurons except for the following: Sf9 cells are imaged with a x63 oil immersion objective whereas Aplysia sensory neurons are imaged with a x40 oil immersion objective. Sf9 cells are imaged in a temperature-controlled chamber maintained at 26-27oC whereas Aplysia sensory neurons are imaged at room temperature maintained around 18-20oC.\nWe use a 30 mW Argon laser (excitation at 488nm) with 50% laser output to image PKC tagged with eGFP protein and a HeNe laser (excitation at 543nm) to image PKC tagged with mRFP protein. The Argon and HeNe laser lines are attenuated to 4% and 50% transmission output respectively prior to imaging and the pinhole is adjusted to one.",
    "It is important to have the culture dish stabilized on the imaging stage and to avoid movement or vibration.\nRemove 1 mL of culture media from the dish gently using a 10 mL pipette leaving 1 mL total volume in the dish.\nTake pictures in the middle section of the cells where the nucleus can be seen.\nSet up a time series of 10-20 confocal images taking a picture every 30 seconds.\nStart the time series.\nAfter 2 pictures are taken (after the 30 seconds time point), add 1 mL of the drug (2X concentration) gently drop-by-drop on top of the cells using a P1000 pipette. The drug is added continuously for about 30 seconds.\nSome drugs induce a fast translocation which can be visible immediately following drug treatment (at the 60 seconds time point) while others induce a slow translocation which is only optimal 5-10 minutes post-treatment (Movie 1 and Movie 2).\nIf the drug needs to be washed away, use 2 x 10 mL pipets to do the wash, pipetting the wash buffer down gently with one pipette on one side of the dish and pipeting up the media on the other side.\nIf the wash has been effective and if the effect of the drug is reversible, PKC reverts back to the cytosol within 30-60 seconds.\nSave the movie as an LSM file.\nUse NIH Image J software to open the LSM files and quantify the images Pre and Post drug treatment. Quantification has been described elsewhere 1.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}