{
  "id": 17784,
  "origin_website": "Jove",
  "title": "Novel Percutaneous Approach for Deployment of 3D Printed Coronary Stenosis Implants in Swine Models of Ischemic Heart Disease",
  "procedures": [
    "We conducted the experiments according to the guidelines by the Animal Welfare Act, the National Institutes of Health, and the American Heart Association on Research Animal Use. Our Institutional Animal Care and Use Committee approved the animal study protocol.\n1. Preprocedural preparation of 3D printed coronary stenosis implants\nUsing tweezers, dip-coat the printed implants in a 25% heparin solution to prevent thrombus formation and allow to air dry for 24 h.\n2. Preprocedural preparation of animal subjects\nHave male Yorkshire swine (SNS Farms, 30–45 kg) arrive at the institution 1 week prior to the experiment date and allow them to acclimate.\nKeep the swine in a fasting state after midnight the day prior to the procedure.\n3. Procedural anesthesia\nSedate the swine with intramuscular ketamine (10 mg/kg) and intravenous midazolam (1 mg/kg).\nVentilate the animals with an oxygen-isoflurane (1–2%) mixture.\nPerform endotracheal intubation once the animal subject is sedated.\nInfuse intravenous (IV) rocuronium (2.5 mg/kg/h) and give additional boluses (1–3 mg/kg IV every 20–30 min) when needed to achieve diaphragmatic immobilization.\nMaintain a surgical plane of anesthesia throughout the procedure by checking for awakening, movements, wide fluctuation in vital signs, and other signs of distress or discomfort throughout the duration of the experiment. We monitored the swine for roughly 6 h under anesthesia.\n4. Vascular access\nUsing the Seldinger technique, insert the arterial and venous sheaths into the bilateral femoral arteries and veins of the subjects.\nFlush all catheter ports continuously with heparinized normal saline.\n5. Preprocedural medication administration\nAdminister amiodarone intramuscularly (1.5 mg/kg), lidocaine intravenously (2 mg/kg), and esmolol intravenously (1 mg/kg) as needed for prophylaxis against arrhythmia. Give repeat dosages of amiodarone, lidocaine, and esmolol as needed throughout the course of the experiment to suppress ventricular rhythms and control heart rate response.",
    "After vascular access is obtained, administer heparin (5,000–10,000 units) to keep an activated clotting time (ACT) >300 s. Check the ACT every hour during the course of the experiment and give additional intravenous heparin as needed to maintain the ACT goal.\n6. Hemodynamic monitoring\nUse a single lateral electrocardiography (ECG) chest lead for recording changes in ST segment, T-waves, and heart rate during the entire experimental period.\nUse a pressure transducer to record continuous femoral arterial pressure throughout the procedure.\nAttach a pulse oximeter to the animal's ear or lip for continuous pulse oximetry recordings.\n7. Preparation of implant delivery equipment\nPrior to performing coronary angiography, insert a deflated NC Trek over-the-wire coronary balloon through a mother-and-child catheter of the desired size such that the balloon tip extends beyond the tip of the catheter.\nMount the 3D printed implant onto the deflated angioplasty balloon such that the implant is positioned between the markers of the balloon and close to the proximal marker (Figure 1B).\nInflate the balloon with an insufflator to 2–3 atm in order to fix the implant onto the balloon. Verify that the implant is positioned closer to the proximal half of the balloon so it will be closest to the mother-and-child catheter when ready for removal (Figure 1B).\n8. Coronary angiography and deployment of coronary implant\nPosition the fluoroscopic C-arm in the anteroposterior (AP) projection.\nAttach a control valve (see Table of Materials) to a left or right coronary guide catheter (see Table of Materials).\nIntroduce the guide catheter over a J-tipped wire through the right femoral artery sheath and, under fluoroscopic guidance, advance the catheter to the aortic root.",
    "Selectively (or nonselectively) engage the catheter into the left main coronary artery (LMCA) and inject 5 mL of iodinated contrast under fluoroscopy to visualize the left coronary system.\nPosition the guide catheter towards the LMCA for the second angiogram (Figure 2). If coronary artery engagement proves difficult, due in part to the short aortic arch of the swine, consider performing non-selective angiograms as long as they provide adequate visualization of the vessels.\nOnce engaged within, or positioned near the LMCA, under fluoroscopy, advance a 0.014\", 300 cm coronary wire (see Table of Materials) into the LMCA and further advance the wire to the distal left anterior descending artery (LAD) or left circumflex coronary artery (LCX) if desired (Figure 3).\nUnder fluoroscopic guidance, insert the previously assembled mother-and-child catheter with the inflated coronary angioplasty balloon and implant over the coronary wire and advance to the desired location along the coronary vessel. Inject 5 mL of iodinated contrast to visualize a discrete narrowing at the desired location where the coronary implant should be deployed (Figure 4).\nOnce the implant is in position, advance the mother-and-child catheter to the proximal marker of the inflated balloon.\nDeflate the balloon and retract it through the mother-and-child catheter. This process allows the mother-and-child catheter to shear the implant off the balloon as it is retracted and fixes the position of the implant in the designated segment of the vessel.\nRemove the balloon, mother-and-child catheter, and coronary wire.\nPerform final angiograms to document the location of the new artificial stenosis within the vessel. When feasible, angiograms should be performed in two orthogonal views to acquire visual estimation of stenosis severity. A final angiography (Figure 5) can also be performed with subselective positioning of the mother-and-child catheter in the proximal vessel, which provides excellent opacification with minimal contrast.",
    "Immediately transfer the animal to the MR suite to undergo cardiac stress perfusion MRI using gadobutrol (0.1 mM/kg) injected at a rate of 2 mL/sec.\n\tNOTE: The stress agent used was a 4 min infusion of adenosine at 300 µg/kg/min. The imaging protocol included 1) cine imaging (field of view [FOV] = 292 x 360 mm, matrix size = 102 x 126, repetition time [TR] = 5.22 ms, echo time [TE] = 2.48 ms, slice thickness = 6 mm, pixel bandwidth = 450 Hz, flip angle = 12˚); 2) first-pass perfusion at rest and at peak adenosine vasodilator stress using a spoiled gradient echo sequence (FOV = 320 x 320 mm, matrix size = 130 x 130, TR = 2.5 ms, TE = 1.1 ms, slice thickness = 10 mm, pixel bandwidth = 650 Hz, flip angle = 12˚; and 3) late gadolinium enhancement imaging using an ECG-gated, segmented, spoiled gradient-echo phase-sensitive-inversion-recovery sequence (FOV = 225 x 340 mm, matrix size = 131 x 175 mm, TR = 5.2 ms, TE = 1.96 ms, slice thickness = 8 mm, inversion time (TI) = optimized to null the myocardium, pixel bandwidth = 465 Hz, flip angle = 20˚). An illustrative first-pass perfusion image is shown in Figure 6.\nAfter completion of the MRI protocol, euthanize the swine by an infusion of sodium pentobarbital (100 mg/kg).\nPerform a lateral thoracotomy, excise the heart, and dissect the ex vivo heart to expose the coronary vessels. Note the location of the implant in relationship to either the diagonal branches (LAD territory) or obtuse marginal branches (LCX territory), and retrieve the implants.",
    "Using blunted and curved Metzenbaum scissors, open the coronary vessel and inspect the vessel for gross injury (see Figure 7). Photograph the heart tissue for gross pathology and stain with triphenyltetrazolium chloride to exclude myocardial infarction (see Figure 8).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}