{
  "id": 13568,
  "origin_website": "Jove",
  "title": "Assessing Cardiomyocyte Subtypes Following Transcription Factor-mediated Reprogramming of Mouse Embryonic Fibroblasts",
  "procedures": [
    "All experimental procedures involving animal practices were approved by the Institutional Animal Care and Use Committee at UT Southwestern Medical Center.\n1. Isolation of Hcn4-GFP E12.5 Mouse Embryonic Fibroblast (MEFs)\nSet up timed matings between homozygous Hcn4-GFP males and CD-1 females.\nSacrifice pregnant female at E12.5 by carbon dioxide euthanasia and subsequent cervical dislocation.\n\t\nRemove uterine horns with dissecting forceps as described previously22,23, and place them into a Petri dish on ice with 1x phosphate-buffered saline (PBS) without Ca2+ or Mg2+.\nPerform all subsequent steps in the tissue culture hood using sterile technique.\n\t\nRemove the embryos from the uterus and amniotic sac using scissors and dissecting forceps. Keep the placenta attached for better handling. Pregnant CD-1 females typically give birth to between 10 and 14 pups.\nUsing dissecting forceps, take the isolated embryos and quickly rinse them twice in 70% (v/v) EtOH.\n\t\tNOTE: The washes should be fast to minimize cell death.\nRemove the head, limbs, tail, and internal organs, including the heart from the isolated embryos.\nPlace the remaining tissue in a 10-cm dish with 1 mL of 1x PBS and finely mince using a sterile razor blade to approximately 1 mm3 in size.\nTransfer minced tissue into a 50 mL conical tube with PBS.\nSpin at 300 x g for 3 min. Carefully aspirate excess PBS.\nAdd 1 mL of sterile 0.25% trypsin-EDTA per embryo. Incubate cells in a 37 °C water bath for 15 min. Gently mix the tube every 4 min. Over-digestion of the tissue will significantly lower the yield.\nVortex cell mixture at maximum speed (3,200 rpm) for 4 s.",
    "Add 2 mL of fibroblast media per embryo and mix. Filter through a 100 µm cell strainer using a pipette to aid the cells through the strainer. Refer to Table 1 for the formulation of all subsequent mediums.\nSpin at 300 x g for 4 min. Carefully aspirate supernatant.\nAdd 10 mL of fresh fibroblast media per 3 embryos and triturate 6-10 times.\nPlate the cells in 1 15-cm tissue culture dish for every 3 embryos prepared. Culture overnight in a 37 °C, 5% CO2 incubator.\nAfter the overnight incubation, replace the media with fresh 30 mL of media per plate. Place cells back into the incubator overnight.\n\t\tNOTE: Check for Hcn4-GFP+ cell contamination under a fluorescent microscope. The culture should be GFP- and only become GFP+ upon reprogramming.\nThe next day, harvest cells with 3 mL of fresh pre-warmed 0.25% trypsin-EDTA. Count and freeze cells. Typically, freeze cells at 3 x 106 cells per mL. The expected yield should be 3 x 106 cells per embryo.\n2. Retrovirus Production and Reprogramming\nCaution: The following protocol requires production and handling of infectious retroviruses. Perform the following steps in a Biosafety Level 2 cabinet under BSL-2 guidelines and sterile technique. Use 10% bleach to dispose of all materials exposed to retroviruses.\nRetrovirus production and MEFs preparation\n\tNOTE: The following protocol is for retroviral production in 6-well plates and MEF infection in 24-well plates. For other formats, refer to Table 2. MEFs are plated at Day -1, so the timing will need to be coordinated appropriately for each experiment (Refer to section 2.3 and Figure 2).",
    "Maintain Plat-E (PE) cells as per manufacturer's recommendations. Briefly, culture PE cells in DMEM supplemented with 10% FBS, 1 µg/mL puromycin, 10 µg/mL blasticidin, penicillin, and streptomycin. Passage cells 1:4 every two days when the culture reaches 70-90% confluency.\nDay -2: The day before transfection, seed Plat-E cells at 1 x 106 cells/well on a 6-well plate in transfection media. Cells should be 70-80% confluent at the time of transfection.\nTransfection using a commercial transfection agent.\n\tNOTE: The commercial reagents should be at room temperature (RT) before transfection. For the DNA transfection, add each retroviral plasmid DNA individually (G, H, M, and T) to form a GHMT cocktail9.\n\t\nDay -1: In a 15 mL conical polystyrene tube, mix 60 µL of reduced serum media with 6 µL of transfection reagent per reaction for a 6-well plate format. Incubate the mixture for 5 min at room temperature.\n\t\tNOTE: Since the transfection reagent used here binds to plastics, add directly to the reduced serum media to avoid any decrease in transfection efficiency.\nAdd a total of 2 µg of GHMT cocktail per reaction and gently tap to mix it. Do not vortex. Incubate the reaction for 15 min at RT.\nAdd the mixture from step 2.2.3 to the PE cells in a drop wise manner.\nIncubate the transfected Plat-E cells overnight in a 37 °C, 5% CO2 incubator. Record the time of transfection.\nSeeding of Hcn4-GFP mouse embryonic fibroblasts.\n1 h before plating MEFs, prepare a 24-well plate for immunocytochemistry.\n\t\t\nAdd a 12 mm fibronectin coverslip per well.\nCoat wells with 300 µL of bovine collagen solution (e.g., SureCoat) and incubate in a 37 °C incubator for 1 h.\nAspirate coating solution immediately before MEF plating.",
    "Thaw a frozen vial of Hcn4-GFP MEFs and wash x1 with pre-warmed fibroblast media at 500 x g for 5 min.\nDetermine cell viability using trypan blue exclusion or similar dyes. Calculate the number of viable cells per mL of culture using the following formula:\n\t\t% viable cells = [1.00 - (Number of blue cells/ Number of total cells)] x 100\n\t\t\nCalculate total number of viable cells using the following formula:\n\t\t\tViable cells = % viable cells x dilution factor x 10,000 x total volume of cell suspension\nSeed 3 x 104 cells per well onto a 24-well plate with previously prepared bovine collagen solution-fibronectin coverslip.\nTransduction and reprogramming of MEFs\n\tNOTE: According to the manufacturer's notes, properly maintained Plat-E cells produce an average titer of 1 x 107 infection units/mL. Although the titer is not directly measured for each experiment, a GFP control is always included as a surrogate for infection efficiency. High GFP expression and intensity (GFP+ > 95%) typically correlates with successful GHMT-mediated generation of iCLMs.\n\t\nDay 0: 24 h post-transfection, filter the PE retroviral medium through a 0.45 µm-pore size surfactant-free cellulose acetate filter and transfer to a 15 mL conical tube. Add polybrene to a final concentration of 8 µg/mL. Carefully replenish cells with 2 mL of fresh transfection medium.\n\t\tNOTE: Cells easily detach from the plate if media is changed too rapidly.\nAspirate the medium of the cultured MEFs and add the freshly collected retroviral medium; it should yield 1.7 mL of media per well of a 6-well plate. Add ~800 µL per well of a 24-well plate. Return MEF plate to the incubator and incubate overnight.\nDay 1: Repeat steps 2.4.1 and 2.4.2. Discard cells after the 2nd virus collection. Return infected MEFs to the incubator and let them rest overnight.",
    "Day 2: 48 h post-induction, aspirate the cell conditioned media and wash x1 with 1x PBS. Add 500 µL pre-warmed iCLM media per well of a 24 well plate.\nReplace iCLM media every 2 - 3 days. Process plate 14 days after viral induction for immunocytochemistry (ICC) analysis of cardiac reprogramming.\n3. Immunostaining of Reprogrammed MEFs\n14-days post-induction, carefully aspirate the media.\nRinse each well with 300 µL of ice-cold 1x PBS. Aspirate excess solution.\nFix cells with 250 µL of 4% paraformaldehyde (PFA) solution per well of a 24 well plate. Incubate 15 min at RT.\n\tNOTE: Fixed cells can be stored in PBS at 4 °C for 1 - 2 weeks before staining.\nPermeabilize cells by washing wells x3 with 300 µL 0.1% PBS-TritonX 100 (PBST). Incubate 5 min at RT between washes. Aspirate excess solution after the last wash.\nBlock for 10 min at RT with 1x Universal Block Buffer at 300 µL/well.\nPrepare (ICC) staining buffer: Add 1:1 of 1x PBS and 1x Universal blocking buffer. Dilute primary antibodies in ICC staining buffer and incubate antibodies overnight at 4 °C. Refer to the material section for recommended dilutions.\n\t\nStain one pair of slides with mouse α-actinin, chicken αGFP, and rabbit Nppa for iPM and iAM identification.\nStain one pair of slides with mouse α-actinin, chicken αGFP, and rabbit Myl2 for iPM and iVM identification.\nThe following day, wash wells x3 with 300 µL 0.1% PBST. Incubate 5 min at RT between washes. Aspirate excess solution after the last wash.\nPrepare the secondary antibody dilutions in ICC staining buffer. Refer to the material section for recommended dilutions. Incubate secondary antibodies 1 h at RT, protected from light.\n\t\nStain all slides with the following secondary antibodies: mouse Alexa-555, chicken Alexa-488, and rabbit Alexa-647.",
    "Wash wells x3 with 300 µL 0.1% PBST. Incubate 5 min at RT between washes. Protect from light.\nAdd 2.4 µL of mounting media containing 1.5 µg/mL of 4',6-diamidino-2-phenylindole (DAPI) to a glass microscope slide. Carefully remove the coverslip from the well of the 24-well plate, remove excess solution, and transfer to the glass slide with mounting media. Gently press the coverslip to remove excess volume and air.\nSeal slides with preferred nail polish or plastic sealant. Store mounted slides at 4 °C protected from light.\n4. Identification of Cardiac Subtypes Using Confocal Microscopy\nNOTE: For imaging, a confocal microscope equipped with at least 2 fluorescent detectors capable of spectral detection at 405, 488, 555, and 639 nm wavelengths is necessary in order to identify iPMs, iAMs, and iVMs. Image cells using a Plan-Apochromat 20X/0.75 objective or better. Using the manufacturer's image analysis software, scanning zoom images can achieve 40X-oil immersion quality images.\nImage library: take 8-bit images with DAPI, Alexa-488, Alexa-555, and Alexa-647 channels (ch.). Pixel dwell time of 6 s, 1024 frame size, line step at 2, and averaging of 2 is sufficient for high resolution images.\nFor each slide, start from one edge and start scanning up and down in the red fluorescent channel (ch.) for α-actinin+ Sarcomere+ cells (Refer to Figure 3 and Figure 5A for examples). Sarcomere striations are easier to identify visually in the 555 nm wavelength.\n\t\nOnce an α-actinin+ Sarcomere+ cell has been identified, switch to the green ch. and keep note if it is positive (iPM). Switch to the computer to assess the far-red 647 ch. (iAM or iVM).\n\t\tNOTE: Cells that are α-actinin+/Sarcomere+/Hnc4-GFP+/Nppa-/Myl2- are designated as iPMs. GFP expression will be seen throughout the cell (Figure 4A).",
    "Stain slides with α-actinin (mouse-Alexa555), Hcn4-GFP (chicken-Alexa488), Nppa (rabbit-Alexa647), and DAPI. Cells that are α-actinin+/Sarcomere+/Hnc4-GFP-/Nppa+ are iAM. Nppa staining will appear perinuclear and punctate (Figure 4B).\nStain slides with α-actinin (mouse-Alexa555), Hcn4-GFP (chicken-Alexa488), Myl2 (rabbit-Alexa647). Cells positive for α-actinin+/Sarcomere+/Hnc4-GFP-/Myl2+ are iVMs. Myl2 staining will exhibit a striated form along the sarcomere filament. Due to variations in the quality of the staining and the Z-plane, striations may not always be easily visible (Figure 4C).\n5. Quantification\nNOTE: In order to assess the actual number of potentially reprogrammed MEFs, 2 wells of a 24-well plate are seeded in parallel to the experimental wells and are harvested one day after plating. The total number of cells plated is then determined by averaging the two wells. This becomes the actual total cells plated (aTotal).\nSarcomere+ \nVisually inspect each cell on a coverslip for proper α-actinin+/Sarcomere+ (Right panels Figure 3) and record (Figure 5B-i).\nTabulate the total number of α-actinin+/Sarcomere+ on each coverslip and divide by the actual total cells plated (aTotal) (Figure 5B-iii). For example, if aTotal = 12,500 cells, and 100 cells were α-Actinin+/Sarcomere+ then, 0.8% of the plated MEFs were reprogrammed. An average reprograming experiment will yield 1% α-Actinin+/Sarcomere+ cells (Figure 5C).\nSubtype+\n\tNOTE: For the following steps, refer to Figure 5B/C for a representative iCLM quantification workflow. Briefly, for each sarcomere+ cell, tabulate if it is unique for either subtype (Figure 5B-i). Calculate % Subtype (Figure 5B-iii) by dividing the number of subtype+ cells over the average sarcomere+ cells x 100 (Figure 5B-i). To calculate the absolute % subtype efficiency (Figure 5B-iv), divide the subtype+ cell number from Figure 5B-i by the total number of cells seeded x 100 (Figure 5B-ii).\n\t\nFor each of the α-actinin+/Sarcomere+ cells, assess if they are GFP+, Nppa+, or Myl2+.",
    "Tabulate total number of α-actinin+/Sarcomere+/Hnc4-GFP+/Nppa-/Myl2-, actinin+/Sarcomere+/Hnc4-GFP-/Nppa+, and α-actinin+/Sarcomere+/Hnc4-GFP-/Myl2+ cells (Figure 5B-i).\nTo calculate the percentage of each subtype, divide the number of Subtype+ cells by the total number of α-actinin+/Sarcomere+ cells in that well and multiply by 100. GHMT generates iPMs, iAMs, and iVMs at roughly equal ratios (Figure 5B-iii).\nTo calculate the absolute number of subtype+ cells, divide the total number of subtype+ cells for the experimental condition by aTotal and multiply by 100 (Figure 5B-ii). On average iPMs represent 0.3% of the total infected cell population, iAMs 0.3%, and iVMs 0.25% (Figure 5B-iv).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}