{
  "id": 4116,
  "origin_website": "Cell",
  "title": "Protocols for studying bacteriophage interactions with in vitro epithelial cell layers",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nTranscytosis of phages using transwells\nTiming: 2–5 days\nWithin the human body, particularly within the gut, phages continually interact with eukaryotic cell layers and it is known that phage particles can be internalized by mammalian cells (Nguyen et al., 2017[href=https://www.wicell.org#bib5]; Bichet et al., 2021[href=https://www.wicell.org#bib1]). Transwells are a quick and reliable method to study the active uptake and transport of particles, drugs and infectious agents across confluent cell layers grown on a permeable membrane. The Transwell set-up mimics a confluent monolayer of cells exhibiting tight junctions that limit paracellular transport and thereby selectively measure transcellular transport processes. Trans Epithelial Electrical Resistance (TEER) measures allow for live monitoring of cell layer confluency and detection of any disruptions and leaks. By applying particles, drugs or microorganisms, such as viruses, to either side of the cell monolayer, it is possible to quantify their subsequent transcellular uptake and transport. Transwells can be used to study immunological responses, drug transfer, cell metabolism and pathogen interactions with eukaryotic cells (Tugizov, Herrera and Palefsky, 2013[href=https://www.wicell.org#bib8]; Nguyen et al., 2017[href=https://www.wicell.org#bib5]; Otero et al., 2019[href=https://www.wicell.org#bib6]). Inhibitors, drugs or other chemicals can be further used to assess their effect on the uptake and transport of particles. Here we describe the setup used in Nguyen et al., 2017[href=https://www.wicell.org#bib5] research paper to demonstrate the directional transcytosis of phages across confluent cell layers.\nPrepare transwells (one to five days)\nNote: As this assay uses live cells, it cannot be paused before the collection of the samples.\nNote: MDCK-I is considered the gold standard cell line for the study of transcytosis processes and is recommended for use here, but any other cell line forming a confluent cell layer can also be used for this assay.",
    "Note: TEER measures the electrical resistance between the upper and lower chambers in the transwells. If there is a gap in the cell layer then the resistance measurement will be low. If there are no gaps in the cell layer then the resistance will be higher, indicating that the cell layer is confluent and is ready to be used. Note that the final TEER measurements will differ depending on the cell line used.\nSeed MDCK-I cells, at a passage number between 10 to 30 (or any cell line of your choice that can form a confluent cell layer) into the top chamber of the transwell at a cell density of between 5 × 104 to 1 × 105 cells/mL, in a total volume of 500 μL per well. The bottom chamber should contain 1000 μL of media with 10% FBS only (Figure 2[href=https://www.wicell.org#fig2]Ai–2Aiii). To seed the cells in the top chamber, carefully place the pipette tip on the side of the well and avoid touching or damaging the membrane (Figure 2[href=https://www.wicell.org#fig2]B). Incubate cells at 37°C and 5% CO2 until they reach confluency (usually between two to five days depending on the cell line).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/881-Fig2.jpg\nFigure 2. Transwells\n(A) Steps to work with a transwell. (i) Top view of a transwell 3 μm pores, empty. (ii) Top view of a transwell 3 μm pores, with media and cells. (iii) Side view of the transwell with the bottom and top chambers filled with cell media. (iv) Measurement of TEER using the EVOM2 machine. (v) Top view of a transwell with a gradient of EBD transfer.\n(B) Scheme representing the positions of the pipette tip in the transwell chambers to add and/or remove media without disturbing the cell layer.",
    "(C) Transwell steps. (i) Grow cells in the top chamber of the transwell and check for the cell layer resistance. (ii) Once the cell layer reached confluency, wash the cells and incubate in HBSS media. (iii) Add the phages to the top chamber. (iv) After incubation with the phages, collect the top and bottom samples in a 96 well plate. (v) Control cell confluency by adding EBD dye to the top chamber. (vi) After incubation collect samples from both chambers in a 96 well plate, the cells can be collected after these steps and washes.\nNote: We recommend the use of 12 wells transwells with 3 μm pores sizes (Sigma) as smaller pore sizes reduced transport of phages across the filter (Figure 2[href=https://www.wicell.org#fig2]Ai).\nNote: Ensure a homogenous distribution of cells by gently rotating the plate horizontally following an infinity shape (∞) to avoid accumulation of cells on the side or in the middle of the plate. Avoid circular shapes as this will push the cells to the side of the well.\nNote: Visual inspection of the cell layer should be done every day to ensure proper cell growth, density and homogeneity.\nNote: Due to the thickness of the transwell membrane, cell confluency is difficult to determine using light microscopy (see confluency controls below).\nReplace cell culture media every other day. To do so, tilt the transwell plate at 45° angle, gently place a pipette tip on the side of the inner well and carefully remove the media above the cell layer without touching the membrane as this can disrupt the cell monolayer (Figure 2[href=https://www.wicell.org#fig2]B). Add fresh media to the chamber following the same process, do not add media directly into to cells but rather on the wall of the chamber and let it drip slowly on the cells.",
    "Note: Do not attempt to remove all liquid from the well as this may disrupt the cell monolayer. Always leave a few microliters of media in the well.\nReturn the transwell plate to the incubator and continue growing the cells until the required cell resistance is obtained.\nUse the TEER machine following the manufacturer’s recommendations, record daily cell resistances measures until cells reach > 1000 Ω × cm2 for MDCK-I cells (Figures 2[href=https://www.wicell.org#fig2]Aiv and 2Ci).\nNote: The TEER values at confluency will vary depending on the cell type. For MDCK-I cells 1000 Ω × cm2 is typical for a confluent cell layer that can be used for the assay.\nPrepare transwells for transcytosis experiment (five hours) See Figure 2[href=https://www.wicell.org#fig2]C for a visual overview of the following steps.\nUsing the same technique as described above in step 1a (see also Figure 2[href=https://www.wicell.org#fig2]B), wash the top and bottom chamber of the transwell with 1 mL of 1× DPBS, to remove any traces of FBS.\nOnce the cells are washed and all media and DPBS is removed, add 500 μL of Hank’s balanced salt solution (HBSS) + HEPES (pH 7.4) (see media preparation in the key resources table[href=https://www.wicell.org#key-resources-table] and materials and equipment[href=https://www.wicell.org#materials-and-equipment] sections) to the top and bottom chambers (Figure 2[href=https://www.wicell.org#fig2]Cii), following previous recommendation and being careful not to touch the cell layer with the pipette tips (Figure 2[href=https://www.wicell.org#fig2]B).\nNote: Replacing media with HBSS buffer serves to both starve the cells of serum before the experiment and to accustom the cells to this new buffer.\nIncubate the transwells for two hrs at 37°C and 5% CO2 to allow the cells to become accustomed to the new media.",
    "Prepare a solution of phages in HBSS-MES at pH 6 (see media preparation in key resources table[href=https://www.wicell.org#key-resources-table] and materials and equipment[href=https://www.wicell.org#materials-and-equipment] sections) at the desired phage concentration. We recommend preparing a minimum of 3 mL cleaned phage lysate for a 12 well plate assay, with each well containing 250 μL of the phage solution per well.\nNote: If measuring phage transcytosis across cell layers, we recommend using a final concentration between 107 - 109 PFU/mL.\nDiscard media from both chambers without touching the membrane (Figure 2[href=https://www.wicell.org#fig2]B).\nApply 250 μL of HBSS-MES-pH 6 phage solution to the top chamber and 250 μL HBSS-HEPES at pH 7.4 to the bottom chamber (Figure 2[href=https://www.wicell.org#fig2]Ciii).\nIncubate transwell plate for two to four hrs (it is also possible to leave the incubation for longer, even overnight (between 8-12 h) if the cell media is complemented with 10% FBS) at 37°C and 5% CO2.\nNote: The cells are without any FBS at this stage of the experiment, and incubation for more than four hours may cause the cells to shrink, thereby creating leaks in the cell layer.\nNote: The differences in media and pH between the top and bottom chambers is to mimic the pH-dependent uptake between the basal and apical sides of the cells. Media can be switched to induce uptake in the opposite direction (Nguyen et al., 2017[href=https://www.wicell.org#bib5]).\nCollect a minimum of 150 μL of solution from both the top and bottom chambers and store in a labeled 96 well plates until analysis (Figure 2[href=https://www.wicell.org#fig2]Civ).\nFor phage quantification, serially dilute the samples collected in the 96 well plate using SM Buffer, and follow step 6 in the “before you begin[href=https://www.wicell.org#before-you-begin]” section for phage quantification.",
    "Check the integrity of the cell layer (two hours) Evans Blue Dye (EBD) is used post-assay to check the permeability of the cell layer and ensure none leaked during the experiment. EBD is a non-permeating dye that enters plasma-membrane damaged cells. The dye will only pass to the opposite chamber of the transwells if the cell layer was damaged cells or contained leaks.\nPrepare a 5 mL solution of 0.1% (w/v) of EBD in 1× DPBS.\nAdd 250 μL of this 0.1% EBD solution to the top chamber being careful not to touch the membrane, followed by the addition of 250 μL of 1× DPBS to the bottom chamber (Figures 2[href=https://www.wicell.org#fig2]Av and 2Cv).\nIncubate at 37°C and 5% CO2 for one hr.\nCollect 100 μL of the solution from both the top and bottom chambers and transfer to a new labeled 96 well plate (Figure 2[href=https://www.wicell.org#fig2]Cvi).\nMeasure the absorbance at 620 nm using a spectrophotometer.\nPlot an EBD standard absorbance curve by diluting from 0.1 μL to 3 μL of 0.1% EBD (w/v) in 100 μL of 1× DPBS in a 96 well plate and measure the absorbance at 620 nm. The presence of the dye in the bottom chamber is an indication of a non-confluent cell layer with likely paracellular transport and these wells should be discarded from the analysis.\nNote: The cut-off value we used to determine the failure of a well is of an absorbance at 620 nm higher than 0.05.\nNote: The 96 well plate can be stored at 4°C up to one month if sealed with parafilm.\nNote: This technique cannot detect small leaks. It is important to combine these results with the TEER measurements.",
    "Critical: Here we are ensuring that the confluency of the cell layer was maintained throughout the experiment. If the dye applied in the top chamber does not leak to the bottom chamber, then the integrity of the cell layer was maintained throughout the experiment (Figure 2[href=https://www.wicell.org#fig2]C). If the dye leaks then the samples from that well should not be taken into account during the analysis as the cell layer has been disrupted at some point during the experimentation (see potential problem 1 in the troubleshooting[href=https://www.wicell.org#troubleshooting] section).\nPause point: Now that the samples have been collected, it is possible to store the phages and EBD samples at 4°C before analysis.\nData collection (one day)\nNote: As the collected volume will likely be low (∼100 μL), you may need to apply a multiplication factor to calculate PFU/mL.\nNote: The concentration of phages applied in the top chamber is usually known whereas the phages transferred to the bottom chamber is unknown.\nTo measure the concentrations of phages in the applied wells (from the top chamber), serially dilute the samples and quantify PFUs via plaque assay, see step 6 in the “before you begin[href=https://www.wicell.org#before-you-begin]” section.\nNote: Phages or particles can be applied to either the top or the bottom chamber depending on the experimental needs, here phages were added to the top chamber as demonstrated by our previous study (Nguyen et al., 2017[href=https://www.wicell.org#bib5]) where phages were found to have higher rates of transcytosis from apical to basal side of the cells, rather than in the opposite direction.",
    "To measure the concentrations of phages in the transferred wells (here the bottom chamber), it is recommended to quantify an undiluted sample and serial dilutions. If there are too many plaques, then plate at a higher dilution. If there are no plaques, then plate the undiluted sample being sure to factor in the correct dilution factor. See step 6 in the “before you begin[href=https://www.wicell.org#before-you-begin]” section.\nNote: Due to the small sample size (100 μL), the detection limit of the assay is 10 phages/mL.\nVisualization of phages and cells under the microscope\nTiming: 1–3 days\nLive microscopy is commonly used to visualize how cells and different microorganisms interact over time. Little is known about the interaction between phages and mammalian cells and real-time visualization is an important tool to improve our understanding. Here we use this method to visualize phages interacting with tissue culture cells. Utilizing different dyes and labels, phage particles, which are extremely small in comparison to the mammalian cell, can be visualized along with their uptake and intracellular transport. This technique has been extensively used in Bichet et al., 2021[href=https://www.wicell.org#bib1] with the real-time visualization of phage uptake by different cell types under both static and flow rate conditions. The results demonstrated that the rate of phage uptake was highly dependent on both phage and cell type.\nNote: As this assay uses live cells, it cannot be paused prior to acquisition of images.\nCells preparation (one to three days)\nSeed A549 cells onto any microscopy-compatible surface, preferably glass-bottom coverslips/slides. For ease of use we recommend μ-Slide 8 Well glass bottom from Ibidi. Seed cells at a density between 5 × 104 to 105 cells/well in a total volume of 200 μL/well of F-12K supplemented with 10% FBS media (Figure 3[href=https://www.wicell.org#fig3]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/881-Fig3.jpg\nFigure 3. Microscopy",
    "(A) 8 well slide setup. (i) μ-slide 8 well, glass-bottom from Ibidi with cells. (ii) Top view of the μ-slide 8 well with the lid open.\n(B) Microscopy setup. (i) Picture of the full microscopy station, Leica SP8 confocal inverted microscope on the right and the computer with the LAS-X software open on the left. (ii) Zoom-in of the 8 well slides in the microscope setup. (iii) Zoom-in of the LAS-X software.\nIncubate cells at 37°C and 5% CO2 for two to three days until the cells reach the desired density for the experiment, here we used ∼90% confluency (i.e., a subconfluent cell layer).\nNote: Here we use A549 cells, but any other adherent cell line may also be used.\nNote: Some cells auto-fluoresce; therefore, it is important to have correct controls for the microscopy experiment as phage particles can be hard to distinguish from the background fluorescence. As a control, we recommend the use of both unstained cells as well as cells incubated with SYBR Gold-stained, phage-free media.\nNote: It is important to use cells from early passages, not above passage 30, for consistent results.\nNote: It is recommended to perform regular screens for mycoplasma infection as this can interfere with cell activity.\nFluorescence labeling of phages (two hours)\nTo fluorescently label phage particles, add SYBR-Gold stain (1× final concentration) to 1 mL of phage lysate at the desired titer. We recommend a final titer of 109 phages/mL.\nIncubate the solution in the dark at 4°C for a minimum of one hr or overnight (between 8–12 h).\nNote: Any stain or dye that can label the phages can be used. However, it is important to ensure there are no overlaps between fluorescence wavelengths of other stains used.",
    "Note: Some dyes can stain the phage capsid rather than staining the DNA inside it. Both stains can be used depending on the experimental need. Keep in mind that the SYBR stain does not modify the exterior of the phage.\nFollowing incubation, transfer the stained phages to the upper reservoir of a 4 mL - 100 kDa Amicon Ultra centrifugal unit to wash and remove the excess of SYBR Gold stain (see potential problem 2 in the troubleshooting[href=https://www.wicell.org#troubleshooting] section).\nSpin at 3220 g (∼4000 rpm) for between 30 s to two min, ensuring not to spin the filters dry.\nBetween each centrifugation discard the solution from the lower chamber and add fresh HBSS (without phenol red, compatible with microscopy) to the upper chamber.\nRepeat steps 6d-e four times or more as necessary. Stained lysate should appear clear to the eye after washing.\nCritical: Spin times vary depending on initial phage concentration, as lysates with higher titres take longer to pass through the filter. It is important to not spin the centrifugation tube filter dry. Recommended to start with short < 30 s spin times and slowly increase the spin time if needed.\nNote: We use HBSS media to wash phages as it is both compatible with live-cell microscopy and tissue culture cells stay viable for longer in HBSS without serum compared to other buffers, such as DPBS or SM where the cells begin to shrink and die during the fluorescence acquisition.\nFollowing four volume exchanges (the volume of phages being washed four times in HBSS), collect the SYBR gold labeled and washed phages from the inner filter by pipetting back and forth against the membrane to dislodge any phages that may be stuck.",
    "Transfer the filtrate to a new 1.5 mL microcentrifuge tube (around 200 μL) and resuspend up to 1 mL with fresh HBSS. The titer of this clean SYBR-stained phage solution should be close to the initial titer, but it is recommended to check this via plaque assay.\nPause point: This stained phage solution can be stored at 4°C in the dark for up to two weeks, but the fluorescence will be stronger and sharper when the solution is freshly prepared (ideally acquire images on the same day as the staining of the phages).\nLive microscopy (three to five hours)\nOnce cells have reached the desired confluency, wash the cells three times with 500 μL of warm 1× DPBS per well.\nDiscard the 1× DPBS and add 200 μL of warm F-12K media without FBS to each well and incubate for two hours at 37°C and 5% CO2 to serum starve the cells.\nDiscard the media from wells.\nAdd 200 μL per well of 1× Cell-Mask (stains the plasma-membrane) and 1× Hoechst (stains the nucleus) diluted in warm F-12K media without FBS. Incubate again for 20 min at 37°C and 5% CO2.\nNote: At this step, any other label or dye can be used to stain the cells or any of their components, as long as the fluorescence wavelengths do not overlap with the stain used to visualize the phages (here SYBR-Gold).\nNote: It is also possible to start the fixed microscopy at this point of the protocol, the phages can be added to the well and incubated for the desired time before fixing the cells, see step 8 below.\nNote: If the live microscopy is not needed, the nuclei can be stained post-fixation with the DAPI stain which is stronger than the Hoechst but not compatible with live microscopy.",
    "Discard the media and wash cells three times with 500 μL of warm 1× DPBS per well.\nAdd 200 μL per well of warm HBSS to the cells.\nNote: At this point, the cells are starving, if the experiment must go for longer than 4 h, we recommend adding at least 1% FBS to the cell media (see potential problem 3 in the troubleshooting[href=https://www.wicell.org#troubleshooting] section).\nWarm up the microscope chamber at 37°C and 5% CO2, at least two hours before the acquisition.\nAt the confocal microscope, place the slide under the microscope and focus on a field of view, set the laser's parameters to the optimal set-up (Figure 3[href=https://www.wicell.org#fig3]B).\nWe used an inverted Leica SP8 confocal microscope with HC PL APO 63×/1.40 CS2 oil immersion objective with a hybrid detector (HyD) used in sequential mode to visualize SYBR-stained phage DNA. Set the HyD system for the phages channel (480 nm channel) with the highest Line Acquisition number.\nNote: The optimal microscope set-up will depend on the microscope type and operating system.\nNote: Do not set the laser power too high otherwise you might damage your cells and bleach the dyes. See potential problem 3 in the troubleshooting[href=https://www.wicell.org#troubleshooting] section.\nNote: Each acquisition depends on what you are looking for, your cell types and the organism/particles you are applying to the cells. Each of the parameters above can be modified and adapted to each particular assay.\nNote: You can add a refocus step between each frame, as the cells might move slightly during the acquisition. But by doing so you increase the time required between the acquisition of each image.\nNote: Depending on the need, image acquisition can be less than one image per minute and can also be manually acquired if needed.",
    "Prepare the acquisition to get one image every 60 s to 5 min (ideally choosing the shortest time possible without bleaching the sample) for up to 4 h.\nOnce an optimal cell section has been chosen, turn off the lasers, carefully discard the HBSS from the well using a pipette and add 200 μL of the SYBR-stained phages solution at 109 phages/mL, pre-warmed to the microscope temperature.\nNote: For this step, carefully add the SYBR-stained phages without touching the wells to maintain the focus on the cell layer.\nClose the microscope chamber to keep the humidity and temperature stable for the image acquisition. After adding the phages to the well, quickly re-check the focus and begin image acquisition.\nOnce the acquisition has finished, the slide can be either used for fixed microscopy see step 8 below or can be discarded as cells are no longer sterile.\nFixed microscopy (two hours) Microscopy is an excellent tool to visualize where particles are localized within cells. Fixed microscopy has a better resolution than live microscopy as it can acquire high-resolution images with a high degree of precision.\nAfter the live imaging experiment, wash the cells three times with 1× DPBS to remove as many extracellular phages as possible.\nNote: It is also possible to start the fixed microscopy before live microscopy. Instead of real-time monitoring of phage uptake, phages can be added to the wells, incubated for the desired time, followed by washing the samples and fixing as described in steps 8a-c.\nNote: Fluorescence is not stable over time. To get the best images from the samples it is recommended to acquire images from new slides.",
    "To fix the cells, remove the DBPS from each well and add 50 μL of 4% paraformaldehyde (PFA) within a chemical hood and incubate 20 min on ice or at 4°C.\nAfter incubation, carefully wash cells three times with 1× DBS to remove any trace of PFA and leave each well in 200 μL of 1× DPBS.\nCritical: Paraformaldehyde is a toxic chemical and should only be used in a chemical fume hood and waste should be collected and discarded appropriately.\nPause point: Now that samples have been fixed, they can be stored protected from light at 4°C for a few weeks before being imaged, however, the fluorescence will decrease over time.\nData collection Different software can be used for image analysis. Here we use the software FIJI (Schindelin et al., 2012[href=https://www.wicell.org#bib7]).\nOpen the image stack on FIJI.\nArrange the channels, for the nucleus to be blue, the phages green, and the plasma membrane to be magenta (or as desired).\nSplit the channels and remerged the channels to fit the colors chosen.\nAdd the scale bar to the images on top of the overlay.\nAdd the time stamp by setting the time between each frame as you set it up at the microscope.\nSave the movie with 12 frames per seconds (fps) (or as desired) (see microscopy analysis[href=https://www.wicell.org#sec5.1] section for further details on image analysis).\nIntracellular phage preparation for whole-cell analysis and phage quantification\nTiming: 1–3 days",
    "Understanding the fate of intracellular phages is important when considering phages interactions with the eukaryotic cells. By collecting whole-cell lysates following phage exposure it is possible to investigate both broader whole-cell analysis while also quantify intracellular phages using both traditional plaque assays and ddPCR (method described in the following section). A number of techniques are available to analyze a wide range of cellular responses, including protein, RNA, cytokine and metabolite screens, in the cells pre- and post-incubation with phages. Using the same samples for these whole-cell analyses and phage quantification is a good way to ensure the parameters are consistent across the range of experiments. Here we describe a method used to collect cell lysates that can be used for a range of whole-cell analysis as well as intracellular phage quantification.\nNote: This assay uses live cells and cannot be paused before the sample collection.\nNote: It is recommended to use high phage concentration to ensure phage uptake by the cells and phage detection by the ddPCR and PFU assays.\nNote: Other molecular methods can also be used (e.g., semi-quantitative PCR, qPCR) although due to small number of intracellular phages, limit of detection may be an issue. As such, we recommend ddPCR as the most accurate quantification method (method described in the following section).\nNote: In the Bichet et al., 2021[href=https://www.wicell.org#bib1] research paper, we used 30 secs of incubation of the phages with the cells as control of surface-bound versus intracellular phages when compared to 18 hrs incubation. Phages can be incubated for any desired times as long as cells stay healthy.",
    "Cell preparation for whole cell assay and intracellular phage quantification (one to three days) This initial sample preparation is the same for whole cell assay and intracellular phage quantification but the two experiments cannot be combined as some of the steps for the whole cell assay might damage active phages. Once the cells ready, you can choose to either process the cells for the whole cell analysis, or to process them for the intracellular phage quantification.\nNote: If both assays need to be performed, we recommend using two sets of separate flasks in parallel to keep the conditions as similar as possible between the two experiments.\nIt is important to compare samples incubated both with and without phages. We recommend using ‘filtered lysate’ as a no-phage control sample whereby phage particles have been removed from the sample using a 0.02 μm filter. It is important to pass the phage lysate multiple times through the 0.02 μm filter to ensure the complete removal of phages. The ‘lysate’ obtained after filtration should not contain phage particles and will be referred to as ‘filtered lysate’.\nNote: It is good to test the presence of phages in the ‘filtered lysate’ using the PFU method described in step 6 of the “before you begin[href=https://www.wicell.org#before-you-begin]” section.\nNote: Different concentrations of phages can be used, but from our experience higher titres give better results for cellular uptake.\nGrow cells in a T25 flask with 6 mL of complete media until cells are confluent. We recommend a concentration of 8 × 104–1 × 105 cells/mL for A549 cells (Figure 4[href=https://www.wicell.org#fig4]i).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/881-Fig4.jpg\nFigure 4. Whole cell analysis",
    "Scheme representing the steps to collect samples for whole-cell analysis. (i) Split cells into 4 identical flasks. (ii) Add phages or control sample to the flasks. (iii) Incubate the samples for the desired time. (iv) Wash the cells with DPBS to remove the excess phages. (v) Follow the manufacturer instruction for the assay chosen. (vi) Send the samples back to the manufacturer for analysis.\nOnce cells are confluent, prepare a phage solution in cell media of 107 - 109 phages/mL.\nNote: Bigger flasks like T75 or smaller volumes like six well plates can also be used for this assay depending on the specific needs. The volumes and concentrations will need to be adjusted to the adequate flask or well.\nAdd 3 mL of phages or ‘filtered lysate’ at the desired concentrations for each of the experimental condition flasks (Figure 4[href=https://www.wicell.org#fig4]ii).\nIncubate the cells and phages together for two hrs or overnight (between 8–12 h) (or as long as desired) at 37°C and 5% CO2 (Figure 4[href=https://www.wicell.org#fig4]iii).\nOptional step - For the control flask, add phages only 30 s before the start of washing.\nWash the cells at least three times or more with ice-cold 1× DPBS to remove the excess phages (Figure 4[href=https://www.wicell.org#fig4]iv).\nNote: The control flask is useful to measure phage adherence to the cell layer as the 30 secs time frame is too short to facilitate the internalization of phages by the cells (Bichet et al., 2021[href=https://www.wicell.org#bib1]). The earliest time to see phage internalization is ∼10 min as described in Bichet et al., 2021[href=https://www.wicell.org#bib1] with the A549 cells. We recommend incubation times longer than 30 min to ensure sufficient phage uptake and detection by downstream assays.",
    "Critical: From steps 10g to 11e, it is essential to keep the cells cold to avoid the degradation of any cellular products, like proteins or RNA, which are sensitive to cellular enzymes.\nCollect cells for whole cell assay (one hour) This subsection is for whole cell analysis, the use of strong lysis buffer in step 11a and the sonicator in step 11d prevent the quantification of active phages (to collect active intracellular phages, follow the next subsection “collect phages for intracellular phage quantification,\" step 12). Intracellular phage DNA can be quantify using this technique.\nRemove as much 1× DPBS as possible and add between 150 to 200 μL of ice-cold Lysis Buffer (alternatively you can use a lysis buffer provided by a commercial kit, for example the KAM-1325 kit from Kinexus for a protein micro-array) (Figure 4[href=https://www.wicell.org#fig4]v).\nScrap the cells from the flask with a cell scraper.\nCollect the cells in a labeled 1.5 mL microcentrifuge tube.\nTo lyse the cells, either pass three times through a 30 G needle using a syringe or use a cell sonicator four times with between 10 to 15 s intervals.\nOnce the cells are lysed the samples can be processed for a range of downstream whole-cell analysis techniques (Figure 4[href=https://www.wicell.org#fig4]vi) (see potential problem 4 in the troubleshooting[href=https://www.wicell.org#troubleshooting] section).\nNote: This protocol is highly adaptable to a range of whole-cell analysis techniques, including; protein microarray, cytokine array, transcriptomics, etc.\nNote: To collect and lyse the cells we recommend following the manufacturer’s instructions to avoid using incompatible buffers.\nNote: Sonication might damage phages.\nNote: Some reagents used to lyse the cells, like Tx-100, may not be compatible with specific arrays or kit. Before lysing the sample make sure all the reagent used are compatible with the commercial array/kit you plan to use.",
    "Collect phages for Intracellular phage quantification (one hour) Continue previous protocol from step 10 g. This subsection is to collect and quantify intracellular active phages. It uses only gentle lysis buffer and will only break the cells membrane and not the phages.\nTrypsinize the cells with 1 mL of trypsin at 37°C and 5% CO2 until the cells detach (around 3–5 min for A549 cells).\nOnce detached, collect the cells in 5 mL of 1× DPBS and spin the cells for 3 min at 453 g (∼1500 rpm) and discard the supernatant.\nTo remove any non-internalized phages or non-adherent phages, resuspend the cells in 5 mL of 1× DPBS and repeat the step above two more times.\nCollect 1 mL of the supernatant after the last centrifugation in a 1.5 mL microcentrifuge tube, as a wash control.\nResuspend the cells in 1 mL of Lysis Buffer (see media preparation in the key resources table[href=https://www.wicell.org#key-resources-table] and materials and equipment[href=https://www.wicell.org#materials-and-equipment] sections) and transfer to a fresh 1.5 mL microcentrifuge tube, incubate 20 min at RT (Figure 5[href=https://www.wicell.org#fig5]Ai).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/881-Fig5.jpg\nFigure 5. Intracellular phages\n(A) A549 cells during the lysis steps. (i) A549 cells before adding the lysis buffer, with zoom-in. (ii) A549 cells after the incubation 20 min at RT with the lysis buffer, with zoom-in. (iii) A549 cells passing three times through a 30 G needle, with zoom-in. Scale bar represents 1 mm and 0.1 mm for the top images and enlarged images respectively.",
    "(B) ddPCR steps. (i) Sample transferred from the 96 well plate to the middle row of the cartridge. (ii) Removing bubbles using a pipette tip. (iii) Adding ddPCR oil to the bottom row of the cartridge. (iv) The cartridge with a rubber gasket placed in the droplet generator. (v) Droplets appear in the top row of the cartridge and transfer back to the 96 well plate. (vi) Droplets are floating on top of the sample. (vii) Plate sealed with an aluminum foil cover. (viii) After the PCR cycles, the plate is placed in the droplet reader to quantify the DNA concentration in the sample.\nPass the cells three to five times through a 30 G needle with a 1 mL syringe to ensure complete lysis (Figures 5[href=https://www.wicell.org#fig5]Aii and 5Aiii). Some cell lines are harder to lyse with the Lysis Buffer, this step is to ensure all the cells are properly lysed before the next step.\nThe samples are ready for intracellular phage quantification, follow steps using ddPCR described in the subsection bellow to quantify total phage DNA and/or plaque assay in step 6 in the “before you begin[href=https://www.wicell.org#before-you-begin] section” to quantify active phages.\nNote: To ensure that the cells have lysed, place a few microliters on a glass microscope slide with a glass coverslip on top of the drap and check under a light microscope at 10× objective (Figure 5[href=https://www.wicell.org#fig5]A). Only nuclei and cell debris should be present (Figure 5[href=https://www.wicell.org#fig5]Aiii). If not, continue to pass the cells through the syringe until all the cells have lysed.\nNote: It is recommended to quantify the phages via PFU and ddPCR as quickly as possible as phages may not be stable in lysis buffer over a long time.",
    "ddPCR setup to quantify total DNA copies (five hours) Following cell collection and lysis from the subsection above, intracellular phages can be quantified using either traditional plating methods, step 6 in the “before you begin[href=https://www.wicell.org#before-you-begin] section” to quantify active phages or absolute number of phages DNA copies measured using droplet digital polymerase chain reaction (ddPCR). While ddPCR is a useful method to quantify the absolute number of DNA copies in a sample, a range of other molecular or microbiology assays (e.g., semi-quantitative PCR, qPCR, plaque assay) may also be used. The principle of ddPCR is based on traditional PCR amplification coupled with fluorescence probe-based detection to provide absolute quantification of DNA copies in the sample. In this technique, the PCR sample is partitioned into about 20,000 water-oil emulsion droplets that separate DNA molecules, with each droplet containing between zero to five DNA copies. PCR amplification is carried out within each droplet and droplets that contain DNA are detected by fluorescence and scored as positive, while the droplets without the fluorescence are scored as negative. The ratio between positive and negative droplets is calculated by the software and the Poisson Distribution statistics used to quantify the total number of DNA copies present within a sample.\nNote: ddPCR will quantify absolute DNA copies which include both active phages, being those able to infect their bacterial host, and phages that have been inactivated during cellular uptake and are no longer able to infect their bacterial host.\nNote: The droplet generator is set up to run eight samples at a time, it cannot do more or less per run. Always ensure you have multiples of eight to maximise your samples per run.",
    "Note: There are two existing methods to measure DNA with the ddPCR, the SYBR-green method, where you use a non-specific fluorophore that binds to double-stranded DNA or the probe system with a dark quencher that will be removed during the elongation step of the PCR. Either method can be used to measure intracellular phages. The probe method is known to have more precision, but is more expensive and requires the design of a targeted PCR probe for your sample of interest. Here we describe the probe method.\nNote: When making the primers and/or the probe make sure to follow the manufacturer’s instruction. It is further recommended to check the primers by traditional PCR before using them with ddPCR.\nPrepare the probe Super Mix (Table 1[href=https://www.wicell.org#tbl1]). This mix is for one reaction only (22 μL /reaction) and will need to be multiplied for the number of reactions needed:\ntable:files/protocols_protocol_881_9.csv\nDescription of all the reagents needed for the ddPCR mix and their concentrations, adapted for detection of T4 phages using gp23 primers.\nNote: Here we used specific primers targeting the gp23 gene on the T4 phage. Other primers following the manufacturer requirements can be designed to detect any microorganism desired.\nAdd the 22 μL per reaction in each well of the ddPCR deep well 96-well microplate (see Bio-Rad instruction), set up the eight reactions on the far-right column of the microplate.\nTransfer 20 μL per reaction to the middle row of the droplet cartridge (Figure 5[href=https://www.wicell.org#fig5]Bi).\nNote: Take note of the sample identification and localisation in the plate to avoid mixing the samples.\nNote: Avoid creating bubbles during pipetting of the samples and during the addition of oil as these may prevent the generation of droplets by blocking the micro-channels (Figure 5[href=https://www.wicell.org#fig5]Bii).",
    "Add 70 μL of the droplet generation oil to the cartridge row labeled ‘oil’ (Figure 5[href=https://www.wicell.org#fig5]Biii). Close the cartridge with the rubber gasket.\nSet the cartridge in the droplet generator, check if the lights are green, if yes, close the machine and let it run (Figure 5[href=https://www.wicell.org#fig5]Biii). Once the droplet generation is complete, remove the cartridge from the machine and discard the gasket.\nWith a 50 μL pipette and Rainin tips collect 40 μL of droplets from each well (last row of the cartridge) and place the droplets in the far-left column of the 96 wells microplate that was used at the start (FigureS 5[href=https://www.wicell.org#fig5]Biv–5Bvi).\nCritical: The droplets are very fragile and can break easily, it is recommended to pipette slowly and steadily to transfer the droplets from the cartridge back to the 96 well plate without losing their integrity (around 5 secs per pipetting) (Figures 5[href=https://www.wicell.org#fig5]Bv and 5Bvi).\nNote: The Rainin tips have been tested for droplet quality and shown to create less droplet shearing than other tips. Different tips may be used, although there is a risk of droplet loss during the pipetting steps.\nNote: The droplets are visible, and form a cloudy layer on top of the clear oil layer (Figure 5[href=https://www.wicell.org#fig5]Bvi).\nSeal the plate using an aluminum sheet and a plate sealer (Figure 5[href=https://www.wicell.org#fig5]Bvii).\nNote: Be careful to use only cold heating blocks (a PCR block that has not been recently used and is at RT) as you don’t want to warm up your samples at this step, that way only the top of the microplate will be heated for the sealing and not the whole plate.\nOnce sealed, place the plate in the thermal cycler using the guidelines below for T4-gp23 amplification.",
    "Note: This PCR cycle (Table 2[href=https://www.wicell.org#tbl2]) is specific for the T4-gp23 (113 pb amplicon) amplification but can be adapted for any set of primers that fits the manufacturer recommendations. This cycle can also be used for regular PCR as well as ddPCR.\ntable:files/protocols_protocol_881_10.csv\nDescription of the PCR cycle for the ddPCR T4 gp23 primers.\nPause point: After running the PCR cycles, the plate can be stored in the dark, at 4°C for a couple of days before analysis with the droplet reader as the droplets are stable at 4°C.\nFollowing the PCR amplification, place the plate in the droplet reader (Figure 5[href=https://www.wicell.org#fig5]Bviii). Follow the instructions of the QuantaLife software from Bio-rad. Once the run has finished, discard the plate and save the data.\nNote: Make sure the plate is placed flat in the droplet reader as the needle used to read the droplets will pierce the foil and aspirate the samples, if the plate is tilted, the needle will bend and break.\nNote: The plate should be empty at the end of the analysis. If the plate is not empty, it means the droplet reader didn’t correctly read the wells that are not empty and the experiment should be repeated (see potential problem 5 in the troubleshooting[href=https://www.wicell.org#troubleshooting] section).\nFor each well selected check the automatic threshold and manually adjust if necessary, between the positive (top/blue) or negative (bottom/black) droplets (see ddPCR analysis[href=https://www.wicell.org#sec5.2] section and Figure 6[href=https://www.wicell.org#fig6]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/881-Fig6.jpg\nFigure 6. ddPCR analysis\n(A) ddPCR droplet visualization. Example of visualization of positives and negatives droplets in blue and black respectively, with an automatic threshold from the QuantaLife software.\n(B) ddPCR droplet analysis. Example of ddPCR analysis with a “NO CALL” sample.",
    "With the excel spreadsheet given at the end, you can calculate your initial sample concentration depending on the dilutions used for the experiment (see ddPCR analysis[href=https://www.wicell.org#sec5.2] section and Figure 6[href=https://www.wicell.org#fig6]B).\nNote: It is commonly seen that the control sample made with ultra-pure water instead of lysate won’t be entirely negative and will contain some false positive. To overcome this issue, the false positives droplets are subtracted from all the other samples as a blank sample would (see ddPCR analysis[href=https://www.wicell.org#sec5.2] section)."
  ],
  "subjectAreas": [
    "Microscopy",
    "Cell Culture",
    "Cell Biology",
    "Microbiology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}