{
  "id": 7734,
  "origin_website": "Bio",
  "title": "Efficient Generation of Genome-wide Libraries for Protein–ligand Screens Using Gibson Assembly",
  "procedures": [
    "DNA fragmentation and size selection Prepare three microtube-50 AFA fiber screw-cap vials, each containing 5 µg of genomic DNA in 55 µL of AFA-grade water. Sonicate using a focused-ultrasonicator for 3 s at 200 cycles per burst, 25 peak incidence power (W), and 10% duty factor at 7 °C, to obtain fragments of 0.5–3 kb (average gene range). Optimization of this step may be necessary depending on organism genome size, base composition, or DNA extraction method (see Note 1).Combine the fragmented DNA from the three vials for a total of 165 µL in a 1.5 mL Eppendorf tube and analyze 30 µL in 1% agarose/TBE gel with 5 µL of ecostain. Load a well with 1 µg of non-fragmented DNA for comparison (optional). Run at 90 V for 30 min or two-thirds of the gel length and visualize the DNA in a ChemiDocMP imaging system. The fragmented DNA should migrate as a smear between 0.5–3 kb with peak intensity at 1.5 kb (Figure 4A). The peak intensity of fragments may vary depending on fragmentation conditions and genome composition.Size select the DNA to obtain fragments above 500 bp by adding 95 µL of Mag-Bind® TotalPure NGS beads to 135 µL of fragmented DNA (ratio 0.7×, beads volume: fragmented DNA volume). Incubate for 10 min at room temperature with rotation at 50 rpm (see Note 2).Quickly spin (approximately 10 s, 850 × g) the microfuge tube containing beads and DNA mixture, transfer the tube to a magnetic rack, and incubate it at room temperature until the beads separate from the solution (approximately 1 min). Pipette and discard the supernatant.Slowly add 200 µL of 70% ethanol over the beads and incubate for 30 s or until beads separate from the solution. Collect and discard the ethanol. Repeat this wash step twice.",
    "Air-dry the beads and mixture for 2 min at room temperature. Do not dry to the point of cracking the beads.Add 55 µL of elution buffer to the beads, mix gently by flicking the tube, and incubate for 1 min at room temperature.Transfer the Eppendorf tube to a magnetic rack to separate the beads from eluted DNA. Collect the supernatant, now containing the DNA, into a new 1.5 mL microtube tube. Discard the tube containing the beads.Quantify the DNA concentration and purity using NanoDrop. Size selection should recover between 50% and 70% of the DNA. The ideal 260/280 and 260/230 absorbance ratios are 1.8 and 2.0, respectively.Analyze 5 µL of recovered DNA in 1% agarose/TBE gel with 5 µL of ecostain, as described in step A2 to verify size selection and DNA recovery.End-repair reaction and adapter ligation Add 1 µg of DNA (from step A8) to a 0.2 mL tube and mix with 10 µL of NEBNext® end-repair buffer (10×) and 5 µL of end-repair enzyme mix. Add water for a final volume of 100 µL.Incubate for 60 min at 20 °C in a thermocycler.Clean up the end-repaired DNAs by adding 70 µL of Mag-Bind® TotalPure NGS beads (ratio of 0.7×, beads volume:end repair reaction volume). Follow the steps described in steps A3 to A8. Elute the DNA in 31 µL of elution buffer.Quantify the DNA (1 µL of the sample) using NanoDrop. Expected DNA recovery is approximately 90%.Add the remaining 30 µL of end-repaired DNA (approximately 1 µg) into a 0.2 mL tube. Add 20 µL of the Oxford nanopore barcode adapters (BCA reagent from the ligation sequencing kit) to the tube and 50 µL of 2× Blunt/TA ligase master mix. Pipette gently to mix the reaction.Incubate at 25 °C for 2 h in a thermocycler.",
    "Clean up the barcode adapter-ligated DNA by adding 70 µL of Mag-Bind® TotalPure NGS beads (ratio of 0.7×, beads volume:barcode adapter ligation reaction volume), as described in steps A3 to A8. Elute the DNA in 31 µL of elution buffer.Quantify the DNA using NanoDrop. Expected DNA recovery is approximately 90% of the input material (step B5).Primer design and library amplification This step describes the design of primers and fragment amplification by PCR for library cloning into the expression vector using Gibson assembly. Figure 2 shows the primers' sequences and a diagram of the pYD1 plasmid used in this step. The primers should anneal to the barcode adapter ligated to the library fragments in step B5 (Figure 2A, sequences denoted by As) and have overhangs complementary to the expression vector (sequences indicated by Xs).Each primer overhang sequence should be ~20 bp, and the primer melting temperature should be approximately 50 °C. If desired, add restriction enzyme sites in the primers to reconstitute any restriction sites in the plasmid. The restriction site used to linearize the vector will be lost if not reconstituted in the primer (Figure 2A).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4558/bioprotoc-12-22-4558-g002.jpgFigure 2. Design of primers for Gibson assembly. (A) Scheme of forward and reverse primers used for Gibson assembly. (B) Diagram of Bam HI-digested pYD1 vector, barcode adapter-ligated fragment (DNA fragments), and primers. (C) Forward (For) and reverse (Rev) primers used to amplify barcode adapter-ligated fragments for Gibson assembly (see pairing regions in B). The sequences in orange correspond to a ~20 bp vector sequence complementary to the pYD1 vector, the black letters are the Bam HI restriction sites, and the ~20 bp nanopore barcode adapter annealing sequences are in green.",
    "F and R: forward and reverse primers, respectively, that pair to the vector flanking the cloning site and are used to amplify cloned fragments by PCR for cloning validation or sequencing.Prepare six PCR reactions, using the barcode adapter-ligated fragmented DNA as template, as follows: 10 µL of ThermoPol buffer 5×, 200 µM dNTPs, 500 nM primer mix (mix of forward and reverse primers), and 1.25 units of Taq DNA polymerase. Add the barcode adapter-ligated DNA (20 ng) and adjust the final volume to 50 µL with water. Amplify the reaction in a thermocycler with an initial denaturation at 95 °C for 30 s, then 14 cycles at 95 °C for 30 s, 49 °C for 30 s, and 68 °C for 3 min. Add a final extension of 5 min at 68 °C and store the reaction at 4 °C (see Note 3).Combine the PCR reactions and purify the amplicons by adding 210 µL of Mag-Bind® TotalPure NGS beads to the 300 µL of reaction (ratio of 0.7×, beads volume: end repair reaction volume). Follow the procedure described in steps A3–A8. Elute the DNA in 31 µL of elution buffer.Quantify the DNA using NanoDrop. Expected DNA recovery is approximately 80–140 ng/µL.Linearize the vector Digest 4 µg of pYD1 vector DNA by adding 3 µL of 10× reaction buffer r3.1, 2 µL (20 units) of Bam HI restriction enzyme, and water to 30 µL final volume. Incubate at 37 °C for 16 h.Note: Do not dephosphorylate the vector, as it will interfere with the Gibson assembly reaction (see Note 4). Purify the linearized DNA by adding 15 µL of Mag-Bind® TotalPure NGS beads (ratio of 0.5×, beads volume:digestion reaction volume). Follow the procedure described in steps A3 to A8. Elute the DNA in 31 µL of elution buffer.",
    "Quantify the DNA using NanoDrop. Expected DNA recovery is approximately 90%.Gibson assembly reaction and efficiency assessment Add 10 µL of NEBuilder HiFi DNA assembly master mix to a 0.2 mL tube. Then add 50 ng (16 fmol) of digested vector (from step D3), 30 ng (32 fmol, see Note 5) of amplified fragments (from step C3), and water to a total of 20 µL reaction. The concentrations indicated result in a 1:2 ratio of vector:PCR fragments.Incubate the Gibson assembly reaction for 1 h at 50 °C in a thermocycler.Mix 1 µL of the Gibson assembly reaction with 50 µL of competent NEB 5-alpha F'Iq E. coli cells, defrosted in ice, in an ice-cold 15 mL Falcon tube. Incubate on ice for 30 min. We recommend performing additional transformations with 100 pg of pUC19 and 50 µL of competent cells to estimate the efficiency of the competent cells, and with 50 ng of the pYD1 vector as a control for no fragment insertion (to be used in step E9). See Notes 6 and 7.Incubate the mix at 42 °C for 30 s, immediately transfer to ice, and incubate for 2 min.Add 950 µL of SOB medium, incubate at 37 °C, and shake for 1 h.Plate 500 µL of transformed cells into 150 × 15 mm Petri dishes containing LB medium with agar and ampicillin at 50 µg/mL for plasmid selection. For the pUC19 transformed cells, make serial dilutions (1:10, 1:100, and 1:1,000) and plate 500 µL into Petri dishes.Incubate overnight at 37 °C.Quantify the number of colonies obtained with the transformations to estimate the number of Gibson assembly reactions and transformations necessary for library assembly. Use the pUC19 transformation to estimate the efficiency of the competent cells.",
    "A total of 4,000–6,000 colonies per plate should be expected for the Gibson reaction transformation using competent cells with an efficiency of 109 CFU/µg of pUC19 DNA. See Note 8.To check the efficiency of the Gibson assembly, select 10–20 colonies from the transformation for colony PCR to amplify the cloned fragments using primers pairing to the vector and flanking the library fragments (Figure 2B and 2C, primers F and R). In 0.2 mL tubes, prepare 22 PCR reactions using 4 µL of ThermoPol buffer 5×, 200 µM dNTPs, 500 nM primer mix (forward and reverse), and 1.25 units of Taq DNA polymerase in 20 µL. We recommend preparing a master PCR reaction mix, then splitting reactions into 21 tubes. Pick a colony with a 10 µL pipet tip and mix the colony with the reaction in the PCR tube. Prepare one reaction with a colony from pYD1-transformed (no library) bacteria as a control. Amplify the reaction with an initial denaturation at 95 °C for 2 min, then 35 cycles at 95 °C for 30 s, 54 °C for 30 s, and 68 °C for 3 min. Add a final extension of 5 min at 68 °C, and store the reaction at 4 °C.Load 20 µL of the reaction to a 1% agarose/TBE gel with 5 µL ecostain, as described in step A2, to analyze the amplified DNA. The amplicons should appear as a single band with a size in the range of the selected fragments (0.5–3 kb). A higher than 90% efficiency in the assembly should be expected, i.e., 18 positive colonies out of 20. Otherwise, optimize the Gibson assembly reaction (step E1, see Note 9).",
    "To check if fragments cloned are from the desired organism genome, pick ten colonies from the transformation to 15 mL cell culture tubes with 2 mL of LB medium and 50 µg/mL of ampicillin antibiotic for plasmid selection. Incubate at 37 °C, shaking at 225 rpm for 18–24 h.Isolate the plasmid from colonies using a mini-prep kit and perform Sanger sequencing using primers pairing with the vector and flanking the library sequences (Figure 2C, primers F and R).Perform sequence alignment with the basic local alignment search tool (https://blast.ncbi.nlm.nih.gov/Blast.cgi[href=https://blast.ncbi.nlm.nih.gov/Blast.cgi]) against the organism genome or the non-redundant database from the National Center for Biotechnology Information. The sequences should align with sequences from the organism's genome used for the initial DNA fragmentation.Calculation of library size and large-scale transformation Calculate the required number of cloned fragments (N) for each genome sequence to be represented in the library with a probability (P) of 99% using the Carbon and Clarke equation:N=ln⁡(1-P)/ln(1-F) , where F=i/gF is the quotient between insert fragment size (i) and genome size (g) in bp. We recommend multiplying the final value by six to increase the chance that a fragment will be cloned in frame with proteins from the expression system, e.g., Aga2p in the pYD1 vector.Divide the calculated number of required fragments (N) by the number of colonies obtained in step E8 to estimate the number of transformations and Gibson assembly required. One Gibson assembly reaction yields 20 transformations and results in 40 transformation plates. For a 44 Mb haploid genome (e.g., the protozoan Trypanosoma cruzi Sylvio X10/1 strain haploid genome) and 6-fold of the minimum calculated number of fragments at 1.5 kb mean size, expect to harvest approximately 811,000 colonies. Hence, 203 plates at 4,000 colonies each and approximately five Gibson assembly reactions.",
    "Transform the Gibson assembly mix as described in steps E3–E7 to achieve the number of calculated fragments. Consider each colony a cloned fragment if assembly efficiency equals 100%.Extraction of library plasmids DNA Scrape all colonies from the plates and combine them in a 50 mL Falcon tube. Adjust the volume to 50 mL using LB medium with 50 µg/mL of ampicillin. If not extracting DNA immediately, keep the suspension at 4 °C for a maximum of one week.Dilute the culture in LB with 50 µg/mL of ampicillin to obtain an OD between 1 to 2. Incubate at 37 °C for 3 h for cell recovery.Isolate the plasmid DNAs using the NucleoBond® Xtra maxi plus EF according to the manufacturer's instructions.Quantify the plasmid DNA on the NanoDrop. The expected DNA yield should be approximately 0.5–2 mg.Digest 2 µg of plasmid DNA by mixing the DNA with 3 µL of 10× NEBufferTM r3.1 and 0.5 µL of Bam HI (5 units) at a final reaction volume of 30 μL. Incubate at 37 °C for 2–18 h. Other restriction enzymes that cut in the multiple cloning site, e.g., Hind III and Xho I, can also be used.Load the 30 µL reaction to a 1% agarose/TBE gel with 5 µL of ecostain, as described in step A2, to analyze the digested DNAs. The gel should show a 5 kb band (digested pYD1) and a smear between 500 and 3,000 bp (digested library fragments) with a peak around 1.5 kb (Figure 4A).Preparation of the library for Oxford nanopore DNA sequencing Prepare six PCR reactions, each with 20 ng of plasmid, 10 µL of ThermoPol buffer 5×, 200 µM dNTPs, 400 nM barcode primers (included in the Native Barcoding Expansion 1-12 from Oxford Nanopore), 1.",
    "25 units of Taq DNA Polymerase, and water for a 50 µL final reaction volume. Run the PCR reactions in a thermocycler with an initial denaturation at 95 °C for 30 s, then 16 cycles at 95 °C for 30 s, 60°C for 30 s, and 68 °C for 3 min. Add a final extension of 5 min at 68 °C and store the reaction at 4 °C.Mix the PCR reactions to obtain a total of 300 µL reactions. Add 210 µL of Mag-Bind® TotalPure NGS beads (0.7× ratio, beads volume:PCR reaction volume) and purify the DNA according to the steps described in steps A3 to A8. Elute the DNA in 61 µL of elution buffer.Quantify the DNA using NanoDrop. The expected yield is approximately 30–60 ng/µL.Add 1 µg of DNA to a 0.2 mL tube and mix with 3.5 µL of NEBNext® end-repair buffer and 3 µL of NEBNext end-repair enzyme mix, 3.5 µL NEBNext® FFPE DNA Repair Buffer, 3 µL NEBNext® FFPE DNA Repair mix, and 1 µL (approximately 10 ng) of CS DNA (control DNA, ~3 kb phage lambda DNA fragment). Add water for a final volume of 100 µL.Incubate for 60 min at 20 °C in a thermocycler.Clean up the end-repaired DNAs using Mag-Bind® TotalPure NGS beads with a ratio of 0.7× (beads volume:end repair reaction volume) by adding 70 µL of beads and follow the steps A3 to A8. Elute the DNA in 61 µL of elution buffer.Quantify the DNA using NanoDrop. Expected DNA recovery is approximately 90%.Add the end-repaired DNA (0.5–1 µg) in 60 µL volume to a 0.",
    "2 mL tube, then mix with 25 µL of Oxford nanopore ligation buffer (LNB), 10 µL of NEBNext Quick T4 DNA ligase, and 5 µL of Adapter mix (AMX) (LNB and AMX are reagents included in the Ligation sequencing kit from Oxford Nanopore). Mix by carefully pipetting the reaction up and down.Incubate for 2 h at 20 °C in a thermocycler.Add 40 µL of Mag-Bind® TotalPure NGS beads to the ligation reaction (0.4× ratio, beads volume:ligation reaction volume). Mix for 10 min with rotation at room temperature.Quickly spin the sample for 10 s and separate the beads from the solution by incubation on a magnetic stand for 2 min at room temperature. Remove and discard the supernatant.Add 250 µL of short fragmentation buffer and mix gently by flicking the tube.Repeat steps H11 and H12. Then, separate the beads from the solution as described in step H11. Air-dry the beads for 30 s at room temperature. Do not over-dry.Add 12 µL of Oxford nanopore elution buffer. Expect a yield of approximately 10–40 ng/µL, i.e., 200–1,500 fmol of DNA. Between 5 and 55 fmol of DNA are used for sequencing. See Note 5.Load 5–55 fmol of the prepared library into the flow cell (R9.4.1) according to manufacturer’s instruction. Sequence the DNA following the manufacturer's instructions."
  ],
  "subjectAreas": [
    "Microbiology",
    "Systems Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}