{
  "id": 11937,
  "origin_website": "Jove",
  "title": "Modeling Breast Cancer in Human Breast Tissue using a Microphysiological System",
  "procedures": [
    "All human tissues were collected in accordance to protocol #9189 as approved by the Institutional Review Board Office of LSUHSC.\n1. Seeding of Adipose-derived Stem Cells (ASCs) for cell sheets\nPurchase ASCs from commercial sources or isolate from primary human breast tissue by following established protocols8,9. Seed human breast ASCs at 70% density (~80,000 cells/cm2 surface area) onto 6-well standard tissue culture plates in Dulbecco's Modified Eagle Medium (DMEM) supplemented with 10% fetal bovine serum, and 1% Penicillin/Streptomycin (BC-MPS Media). Ensure that the ASCs to be used for forming the cell sheets should be less than passage 10.\n\t\nFor each well of breast cancer microphysiological system (BC-MPS) that will be generated, seed cells in 1 standard tissue culture well and 1 well of similar size on poly(N-isopropylacrylamide) (pNIPAAm)-coated tissue culture plastic plate. One 6-well plate of BC-MPS will require one standard tissue culture 6 well plate (bottom) and one pNIPAAm-coated plate (top). The pNIPAAm plates can be purchased from commercial sources or can be coated in-lab10,11,12.\nCulture ASCs in a tissue culture incubator at 37 ° C and 5% CO2. Change the media every 2-3 days in a biosafety cabinet.\nCulture the ASCs until they become 100% confluent and form a striated pattern. Depending on the confluence at which they were seeded, this will take 7-10 days. Confluent cell sheets are required to anchor the buoyant adipose breast tissue.\n2. Preparation of supplies needed for BC-MPS\nTo prepare gelatin for 6-well plates make a 12% gelatin solution in distilled H2O. Mix 19 g of gelatin type B (gel strength of ~225 Bloom) and 125 mL of H2O in a 250 mL glass media bottle. Add 1.6 mL of 1 M NaOH to the solution to neutralize the pH.",
    "Autoclave the solution under a liquid cycle for 25 min to sterilize the solution.\nAllow the solution to cool to 37 °C. In a sterile biosafety cabinet add 16 mL of sterile 10x Hanks balanced salt solution (HBSS) to the solution to obtain a final volume of 160 mL.\n\t​NOTE: The gelatin solution can be used right away or stored at room temperature for later use. The prepared gelatin is stable at room temperature for 1 month. If only a few plungers will be needed then a 10 mL solution can be made and sterile filtered on the same day as making BC-MPS as previously described7.\n\t\nTo prepare gelatin solution by filter sterilization, dilute 1 mL of 10x HBSS with 9 mL of H2O to make a 1x HBSS solution in a 15 mL conical tube. Add 100 µL of 1 M NaOH to each 10 mL tube and then add 0.7 g of gelatin to the solution. Mix the solution vigorously to dissolve the gelatin.\nIncubate the tube in a 75 °C water bath for 20 min shaking every 5 min. Use a 10 mL syringe and a 0.22 µm syringe filter to filter the gelatin solution. Filter the gelatin solution directly onto the plungers in a biosafety cabinet.\n3D print or use simple acrylic to make the plungers used for transferring the cell sheets. Ensure that the plungers fit loosely in the desired size of well. A standard 3D printed plunger is shown in Figure 1. The plungers can be designed using standard computer aided design software such as TinkerCad and printed using filament 3D printers that are compatible with polylactic acid (PLA)13,14.",
    "To prepare a rack for holding the plungers place a 15 mL tube rack in a biosafety cabinet. Place plungers upside down in the rack, so that the bottom of the plungers is facing up. Place a plastic box with a lid for transporting BC-MPS in the biosafety cabinet. It is recommended that the box be at least 35.5 cm length x 28 cm width x 8.25 cm height to fit 4 plates of BC-MPS. Remove the lid from the box and spray down the rack, plungers, and box with 70% EtOH.\nPrepare sterile razor blades and forceps by autoclaving or by placing them in a biosafety cabinet and washing with 70% EtOH.\nSpray the plungers and box with 70% EtOH and turn on the UV light in the biosafety cabinet for at least 30 min to sterilize the supplies.\n3. Prepare gelatin plungers and apply to the upper cell sheets\nIf the gelatin solution was previously prepared, heat it in a 37 ° C water bath to melt it.\nPipette the gelatin solution onto the plungers in the biosafety cabinet using a 5- or 10-mL serological pipette. A plunger for 1 well of a 6-well plate will require ~2.5 mL of gelatin.\nOnce the gelatin has solidified on the plungers (~30-45 min) move the pNIPAAm-coated ASC plates to the biosafety cabinet. Gently place the plungers into the wells of the pNIPAAm-coated ASC plates so that the gelatin contacts the ASCs. Place a metal washer (~7.5 g) on the plunger to weigh down the plunger so that gelatin is in direct contact with the ASC cell sheet. Leave the plungers on the ASC cell sheets at room temperature for 30 min.",
    "Gently move the plate with the plungers into the sterile box in the biosafety cabinet and place the lid on it. Move the box to a 4 °C fridge for 30 min. If a 4 °C fridge is not available place the plate on ice in an ice bucket in the biosafety cabinet for 30 min.\n4. Preparation of cancer cell lines\nSeed the cancer cell lines in a standard T75 tissue culture dish and keep them in culture so that they are ~80% confluent on the day BC-MPS will be processed. (~200,000 cancer cells will be needed per BC-MPS). Grow the cancer cells in normal media.\n\tNOTE: To identify and isolate the cancer cells it is recommended that the cells are transfected with a fluorescent protein to distinguish them from the ASCs and breast tissue. The number of cancer cells needed per BC-MPS has been optimized for MCF7 and MDA-MB-231 cells. Other cell lines may require further optimization.\nOn the day that the BC-MPS is being prepared move the flask containing the cancer cells to the biosafety cabinet. Aspirate the media from the flask. Wash the flask with 5 mL of PBS.\nAdd 1 mL of cell detachment solution to the flask containing the cancer cells and then incubate the flask in a 37 °C incubator until the cells have detached (~2-5 min).\nIn the biosafety cabinet add 9 mL of PBS to the flask, transfer the cells in PBS into a 15 mL conical tube and count the cell number using a hemocytometer.\nCentrifuge the cancer cells at 500 x g for 5 min at room temperature.\nResuspend the cells in BC-MPS media so that there are 2 x 106 cells/mL.",
    "Place the cancer cells in a 37 °C water bath until they are ready to be added to the human tissue.\n5. Processing of human breast tissue\nIn a biosafety cabinet wash the human breast tissue (HBT) 3x with 10 mL of sterile PBS.\nUse sterile forceps and a razor blade to coarsely mince the BC-MPS and try to remove as much fascia and connective tissue as possible. Failure to remove the connective tissue may result in the ASC upper layer to not properly anchor the HBT.\n\tNOTE: The fascia and connective tissue can be identified by its white or clear appearance compared to the yellow color of the adipose tissue.\nOnce the connective tissue has been removed use a sterile razor blade to finely mince the tissue until it has a homogenous liquid consistency. The tissue is finely minced when it can easily be pipetted using a 25 mL serological tip.\nUse a sterile razor blade to cut the tip off a p1000 pipette tip to assist in pipetting the minced HBT.\nIn a 1.5 mL tube mix the minced HBT, cancer cell lines, and BC-MPS media (for 1 well of a 6 well plate this requires 200 µL of minced HBT, 100 µL of of BC-MPS media, and 100 µL of cancer cells).\nMove the ASC plate that will be used for the bottom cell sheet from the incubator to the biosafety cabinet. Aspirate the media from the bottom ASC plate. Pipette the mixture onto the center of the well of the bottom ASC plate using a p1000 pipette tip that had the distal end cut off from step 5.4",
    "Move the box containing the upper ASC plate with the plungers on it to the biosafety cabinet. Gently remove the gelatin plungers from the pNIPAAm-coated plate and place on top of the HBT mixture. Add BC-MPS media to the well (for 1 well of a 6-well plate add 2 mL of media). Carefully move the bottom ASC plates with the BC-MPS mixture and plungers to the sterile plastic box and place the lid of the box on for transport.\n\tNOTE: The 6-well plate lid will not fit back on the ASC plate while the plungers are on. Care must be taken to avoid contaminating the culture.\nIncubate the bottom plate in the box in an incubator at 37 ° C until the gelatin has melted, and the top ASC layer has begun to adhere to the bottom layer (~30 min).\nMove the box with the plates to the biosafety cabinet. Gently remove the plungers from the bottom plates. The tissue with the cancer cells will be anchored to the bottom of the well.\nPlace the lid of the 6-well plate back onto the bottom plate and incubate at 37 °C to completely melt the gelatin and allow the top layer to completely anchor to the bottom layer (~30-60 min).\nGently move the plates to a biosafety cabinet and aspirate the media with a 10 mL serological pipette. Add 2 mL of fresh media to each well. Aspirate from the edge of the well and pipette onto the edge of the well to avoid dislodging the tissue.\nMaintain the BC-MPS at 37 °C and 5% CO2 for the desired length of time and change media every 2-3 days.\n6. Digestion of BC-MPS for analysis",
    "When the BC-MPS is ready to be analyzed, move the plate to the biosafety cabinet. Remove media with a serological pipette to avoid accidental dislodging of any tissue.\nAdd 1 volume of PBS to each well.\nRemove the PBS with a serological pipette.\nAdd 1 mL of cell disassociation solution to each well. Move the plate back to the incubator and incubate at 37 °C for 5 min to allow the cells to detach. In a biosafety cabinet, use a cell scraper to completely detach the cells and the tissue from the culture plate.\nTransfer the solution with the tissue to a 15 mL conical tube using a serological pipette. Add 2 mL of PBS to each well to collect any remaining cells and transfer this solution to the conical tube. If the cells are fluorescent, wrap the tube in aluminum foil to protect it from light.\nIncubate the tube at 37 °C under constant agitation in an orbital shaker at 1 x g for 10-20 min to completely dissociate cells from the tissue.\nIn a biosafety cabinet use a serological pipette to disrupt any remaining clumps of cells in the tube and filter the sample through a 250 µm tissue strainer into a new 15 mL tube. Pipette the solution slowly through the strainer so that it does not overflow.\nRinse the strainer with 1 mL PBS to collect any cells still in the strainer.\nCentrifuge the samples at 500 x g at room temperature for 5 min. After centrifugation, the adipocytes will be floating on the top layer of the solution while the cancer cells and ASCs will be mixed together in a pellet at the bottom of the tube.",
    "To isolate the adipocytes gently pour the top layer into a new tube or alternatively cut the tip off a p1000 pipette tip and transfer the top layer to a new tube. Centrifuge the sample at 500 x g for 5 min again and use a syringe and needle to remove the solution from below the adipocytes so that only the adipocytes are remaining. The adipocytes are now ready for analysis\nAfter removing the adipocytes from the solution, separate the ASCs and cancer cells from each other for analysis if the cancer cells were previously transfected with a fluorescent protein. Aspirate the remaining solution from the tube containing the ASCs and cancer cells without disrupting the cell pellet. Resuspend the pellet in PBS or BC-MPS media and use flow cytometry to sort the cells based on the fluorescence.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}