{
  "id": 17010,
  "origin_website": "Jove",
  "title": "Laser-free Hydroxyl Radical Protein Footprinting to Perform Higher Order Structural Analysis of Proteins",
  "procedures": [
    "1. Installing the capillary tube\nUsing a silica cleaving stone, cleave 250 µm inner diameter (ID) silica capillary to 27 inches. Check the capillary ends for a clean, straight cut.\nCreate two windows roughly 15 mm in length by burning away the polyimide coating. Starting from the “lower end” make the first photolysis window 90 mm away from the “lower end” and the second dosimeter window 225 mm away from the “lower end”.\n\tNOTE: Once the coating is burned away the capillary is very fragile.\nUnscrew the nut and ferrule at port 5 and insert the “lower end” of the capillary just beyond the conical end of the ferrule (Figure 1A).\nOn the photolysis module, remove the photolysis cell cap by pulling it straight out and then remove the magnetically mounted metal mask which will hold the capillary in place.\n\tCAUTION: Inside the photolysis cell cap is a curved mirror, do not allow anything to touch the mirror.\nOn the dosimeter module, open the dosimeter cell by pushing on the tab on the left and swing the dosimeter cell open to the right. Remove the magnetically mounted clips which will hold the capillary in place.\nPlace the capillary into the grooved channel in the base of the photolysis cell. Center the capillary window with the photolysis cell window. While holding the capillary in position with one hand, add the magnetic mask to hold the capillary in place. Place the photolysis cap back in position.",
    "Place the capillary into the grooved channel in the base of the dosimeter cell. Center the second capillary window on the small aperture at the center of the dosimeter cell base. While holding the capillary in position with one hand, place the two magnetic clips in position to hold the capillary in place. Close the dosimeter cell until it clicks closed.\nInsert the capillary through the knurled nut atop the capillary lift of the product collector (Figure 1B). Extend the capillary to just above the bottom of the vial.\n\tNOTE: It is important for the capillary to reach the bottom of the vial to ensure that the capillary is submerged in the quench solution while running an experiment.\n2. Installing an injection loop\nUse Teflon tubing with an outer diameter 1/16” and an inner diameter of 0.015” (381 µm). Follow equation 1 to calculate the length of tubing needed for the desired volume using equation 1.\nimgsrc://cloudfront.jove.com/files/ftp_upload/61861/61861equ01.jpg\n\tWhere L is the length of the tubing in millimeters, V is the desired volume in microliters and d is the tube inner diameter in millimeters. For an injection volume of 25 µL and an inner diameter of 381 µm, the tubing length needs to be roughly 219.3 mm.\n\tNOTE: For volumes less than 20 µL, use PTFE tubing with an inner diameter of 0.01”.\nCut the Teflon tubing to the necessary length using a tube cutter. Check the ends of the tube for a clean, straight cut.",
    "Insert one end of the new injection loop through one of the nuts and place a new ferrule onto the end of the tube. Hold the ferrule and nut in place and insert the tube into port 3 of the injection valve until it bottoms out in the valve. Hold the tube firmly and tighten the nut finger tight. Using a wrench, tighten the nut ¼ turn further. Remove and inspect the assembly.\n\tNOTE: If the ferrule is not fixed in position, reinstall and tighten 1/8 turn further. Repeat with the other end of the loop.\nOnce both ends have a nut and fixed ferrule, loosely screw one end to port 3 and the other end to port 6 (Figure 1C). Once in position tighten both sides to finger tight then ¼ turn past finger tight with a wrench.\n3. Initialize the photolysis system\nTurn on the photolysis modules in the following order: (1) Fluidics Module (2) Photolysis Module (3) Dosimetry Module (4) Product Collector, and lastly (5) the system computer and launch the control software\n\tNOTE: Allow the Dosimeter Module at least a half-hour to warm up from a cold start.\nFully submerge tubing from the “Valve” position on the syringe pump (Figure 1D) into 10 mL of buffer. Place the tubing from the “Waste” position (Figure 1D) and tubing from port 2 on the syringe port (Figure 1C) to an empty container to collect waste.\n\tNOTE: Use the buffer your protein will be suspended in. A recommended buffer is 10 mM NaPO4.\nOn the Product Collector carousel, place 1.5 mL microcentrifuge tubes at the position marked H and 6.\nIf using 250 µm ID capillary, set the load flow rate to 500 µL/min, processing flow rate to 7.5 µL/min, and waste flow rate to 500 µL/min.",
    "Calculate the flash delay, product time, and waste time to use the Semi-Automatic Mode using equation 2.\nimgsrc://cloudfront.jove.com/files/ftp_upload/61861/61861equ02.jpg\n\tWhere t is the time in minutes, s is the capillary distance in millimeters, d is the inner diameter of the capillary in millimeters, and f is the flow rate in µL/min.\n\t\nFor the flash delay, the distance is from the “lower end” of the capillary to the first window, which should be roughly 90 mm. Using 250 µm ID capillary and a processing flow rate of 7.5 µL/min the sample will arrive to the photolysis window in about 35 seconds. Allow two flashes at 1 Hz to occur before the samples arrive, so set the flash delay to 33 seconds.\nFor the product time, enter the amount of time injected solution will take to flow from the injection valve to the end of the capillary. For a 27” long 250 µm ID capillary, set the product time to 4.5 minutes.\nFor the waste time, enter the amount of time the total volume of injected solution will take to be collected. At this time, the product collector will move from the product position to the waste vial. For an injection volume of 25 µL and a flow rate of 7.5 µL/min, set the waste time to 7.8 minutes.\nRinse out the injection loop five times by injecting 25 µL of HPLC-grade water into the injecting port with the injection valve set to the load position.",
    "Manually turn the injection valve up to ‘inject position’ to flush the rest of the system. Select Process (Out) on the control software to begin flowing water. While flowing, raise the product collector capillary lift by selecting Up under the product collector so that you can see the end of the capillary. Flow water through the capillary until a droplet forms.\n\tNOTE: If a droplet does not form, check the injector valve for leaks. If there is a leak, loosen the nut, reseat the capillary, and retighten.\n4. Determine actual ▪OH yield to test radical scavenging effects from the buffer.\nIn the Control Software, start the flow by selecting Process (Out). In the settings tab, set the flash voltage to 0 V. Under the Manual Control tab in the dosimeter data section, select Start Data + AutoZero.\nSelect the position for the product vial (H) and waste vial (6).\nSelect Ready, manually turn the injection valve down to the load position, and inject 25 µL of 1 mM Adenine with 100 mM H2O2 into the injection port. Once injected, manually turn the injection valve up to the inject position.\n\tNOTE: This automatically triggers the system to begin the flow, turn on the plasma source, and acquire the dosimetry data.\nRamp the voltage up by navigating to the settings tab, and changing the flash voltage. Repeat steps 4.2 and 4.3 using 500 V, 750 V, 1000 V, and 1250 V. Perform the reading of adenine absorbance at each voltage in triplicates.\nSelect calculations tab to determine the average absorbance of each sample. First, click Select, then manually select the beginning and end of the peak absorbance. In the available space, write in a description of the sample. Repeat for all acquired data.",
    "NOTE: Bubbles may form causing a spike in dosimeter reading. When selecting data to determine average absorbance, omit areas with bubbles.\nCopy and paste data in Excel to calculate the average change in adenine absorbance for each voltage, thus determining the effective ▪OH yield.\nRepeat steps 4.1-4.6 if multiple sample conditions (different buffer/additives) are being used to normalize the effective ▪OH yield for each condition.\n5. Modification of protein to detect changes in higher order structure.\nMix 4 mM adenine with 20 µM of protein in a one-to-one ratio to make a solution containing 2 mM adenine and 10 µM protein.\nMake the quench solution using 0.3 mg/mL catalase to break down excess hydrogen peroxide and 35 mM methionine amide to quench any remaining radicals. Aliquot 25 µL of quench solution into a 200 µL microtube so that an equal volume of quench and the labeled product is mixed.\nDilute H2O2 to 200 mM and keep on ice.\nOn the Control Software in the settings tab, start the flash voltage at 0 V to determine any background oxidation.\nIn the manual control tab, select Start Data + AutoZero, followed by Process (Out), then Ready, and finally turn the injection valve down to the load position.\nPlace a quench solution in position 1 on the product collect carousel. On the System Control Software change the product vial to 1.\nImmediately before injection, mix 12.5 µL of the adenine and protein mixture with 12.5 µL of H2O2 to make a final concentration of 1 mM Adenine, 5 µM protein, and 100 mM H2O2. Gently pipette up and down to mix, quickly spin down, and inject 25 µL using the injection port within 10 seconds of mixing.\nSwitch the injection valve to the inject position and wait while sample is being processed.",
    "Repeat acquisition with 500 V, 750 V, 1000 V, and 1250 V. Perform each voltage measurement in triplicate.\nCalculate the average absorbance as described in step 4.5. Copy and paste all data to Excel.\n6. Shut the system down\nAfter all samples have been collected, flush out the syringe port and sample loop by setting the injection valve down to the load position and inject 25 µL of HPLC water five times.\nTurn the injection valve up to the inject position to flush the rest of the system with HPLC water.\nStop the flow, close the system control software, and turn off the modules starting with the product collector, dosimeter module, photolysis module, then finally the fluidics module.\n7. Sample preparation and liquid chromatography-mass spectrometry\nDenature the protein by incubating samples at 80 °C for 20 min in the presence of 50 mM Tris and 1 mM CaCl2. Cool samples to room temperature and add 1:20 trypsin to protein. Digest the protein overnight at 37 °C with sample mixing. Next morning, terminate trypsin digestion by heating samples to 95 °C for 10 minutes.\nDetect peptides using a high-resolution LC-MS/MS system connected with a UPLC system.\nLoad the sample first onto trap column (300 µm ID X 5 mm 100 Å pore size, 5 µm particle size) and wash at 5.0 µL/mL for 3 min with water containing 2% solvent B (acetonitrile and 0.1% formic acid).",
    "Separate the peptides on a C18 nanocolumn (0.75 mm x 150 mm, 2 µm particle size, 100 Å pore size) at a flow rate of 300 nL/min with a gradient between solvent A (water containing 0.1% formic acid) and solvent B. The gradient for peptide elution consists of a linear increase from 2 to 35% B over 22 min, ramped to 95% B over 5 min and held for 3 min to wash the column, and then returned to 2% B over 3 min and held for 9 min to re-equilibrate the column.\nAcquire the data in positive ion mode. Set the spray voltage to 2400 V, and the temperature of the ion transfer tube to 300 °C.\nAcquire the full MS scans from 250-2000 m/z followed by eight subsequent data-dependent MS/MS scans on the top eight most abundant peptide ions. Use collision-induced dissociation at 35% normalized energy to fragment the peptides.\nIdentify all the unmodified peptides detected from MS/MS analysis using an available protein analysis software against the necessary FASTA file containing the protein sequence and the relevant proteolytic enzyme.\nSearch and quantify modified peptides using a HRPF Data Processing Software. The extent of oxidation for each identified peptide is calculated by dividing the summed chromatographic peak area of a modified peptide by the total chromatographic peak area of that peptide modified and unmodified using equation 3.\nP = [I(singly oxidized) X 1 + I (doubly oxidized) X 2 + I(triply oxidized) X 3 + .../[Iunoxidized + I(singly oxidized) + I(doubly oxidized) + I(triply oxidized) ...]\n\twhere P denotes the average number of oxidation events per peptide molecule, and I represents the peak area of the unoxidized peptide (Iunoxidized) and the peptide with n oxidation events.\n8. For a differential study, repeat steps 5-7 on the second condition.",
    "NOTE: To confirm reproducibility, two biological replicates in addition to technical triplicates for each condition are recommended.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}