{
  "id": 6901,
  "origin_website": "Bio",
  "title": "A CRISPR Competition Assay to Identify Cancer Genetic Dependencies",
  "procedures": [
    "Note: In this section, we will introduce the Cas9 transgene into the cell line of interest. If researchers already have stable Cas9-expressing cell lines, they can proceed directly to Procedure B. Generation of Cas9-expressing cell lineSelect a Cas9 expression vectorWe suggest using LentiV-Cas9-Puro (Addgene) to introduce Cas9 into the cell line of interest, although any constitutive SpCas9 expression vector with a mammalian selection marker should suffice.Produce Cas9 virusWe suggest using the lentiviral packaging plasmids psPAX2 and VSVG (Addgene).We provide a brief overview of lentivirus production below. Our lab has made available a more detailed protocol for this process, which can be found in Giuliano et al. (2019).Calcium phosphate transfect HEK293T packaging cells with LentiV-Cas9-Puro, psPAX2, and VSVG.Replace media on the packaging cells approximately 8-14 h post transfection with fresh media.Harvest virus 24 h post-transfection. We recommend filtering the supernatant with a 0.45-µM filter to separate cell debris. Virus can be collected up to three times in the 72-h period post-transfection.Virus can be used immediately or stored at -80 °C.Transduce cell line of interestPlate cells at approximately 50% confluence.Mix viral supernatant with fresh media in a 1:1 ratio.Add polybrene to the diluted viral supernatant to a final concentration of 8 µg/ml. We find this concentration improves transduction efficiency for nearly all cell lines commonly used in our lab. However, this concentration can be adjusted if needed.Replace media on cells to be transduced with the polybrene-containing viral supernatant.Change media on the transduced cells with fresh media 24 h post-transduction.Select for Cas9-expressing cellsThe Cas9 expression vector used in our lab (LentiV-Cas9-Puro) contains a puromycin-resistance marker. The ideal concentration of puromycin for selection is cell-line dependent and should be optimized prior to the start of the experiment.",
    "To optimize the concentration of puromycin for selection, we suggest plating wild-type cells at approximately 50% confluence on 6 or 12-well plates.Replace media on the cells 24 h later with media containing puromycin at a range of 1-4 µg/ml. We generally test in increments of 0.5 μg/ml, with each well containing a different concentration of puromycin.Assess cell survival 3-5 days post drug selection. The optimal concentration of puromycin is the lowest concentration at which there are no surviving cells. For adherent cell lines, dead/dying cells generally detach from the plate, which facilitates identifying surviving cells. Suspension cell lines may require a viability dye for this purpose.While this range of puromycin concentrations is sufficient for most cell lines, some may require higher working concentrations. In that case, test additional concentrations up to 10 µg/ml.Replace media on the transduced cells 48 h post-transduction with media containing puromycin at a concentration of 1-4 µg/ml or as determined to be optimal for the cell line of interest.Maintain selection until Cas9 is stably expressed. We find that for most cell lines, only one round of transduction, followed by 3 to 5 days of puromycin selection, is sufficient for generating stable Cas9 expression. However, some cell lines may require more than one round of transduction and/or a longer selection period.Verify Cas9 expressionResearchers can utilize a variety of approaches to verify expression of Cas9, including:Quantitive PCR (qPCR). Through the use of PCR primers targeting the Cas9 mRNA transcript, expression of the Cas9 nuclease can be confirmed. The qPCR primers our lab utilizes for detecting Cas9 expression are forward: 5′ GGCCTACCACGAGAAGTACC 3′ and reverse: 5′ CTGGCGTTGATGGGGTTTTC 3′.Western Blot. The Cas9 expression vector used in our lab (LentiV-Cas9-Puro) contains a FLAG-epitope tag fused to the N-terminus of Cas9.",
    "As such, researchers can make use of an anti-FLAG antibody in place of a Cas9 specific antibody if needed. The anti-FLAG antibody our lab utilizes can be found in the Materials and Reagents section (Sigma-Aldrich).Transduction with guides targeting essential genes. While this may not be suitable for the first GFP competition assay you conduct, our lab routinely performs control competition assays with several positive and negative control guides (as described later in this protocol) to verify Cas9 functionality in a cell line of interest.It is of note to mention that qPCR and western blotting for Cas9 can confirm Cas9 expression but not functionality. Transduction with guides with known biological activity can serve to confirm Cas9 functionality. For these reasons, we recommend using a combination of these approaches to verify Cas9 expression and functionality in any Cas9-expressing cell lines you generate.Note: In this section, we will design guides targeting the gene of interest, and clone these guides, alongside appropriate positive and negative control guides, into guide plasmids for sgRNA and fluorescent protein expression. We discuss considerations for ideal guide design and provide control guides extensively validated by our lab and our methods for plasmid cloning. Design of sgRNAs and guide plasmidsIdentify target sites within the gene of interestUse an online tool such as Benchling (https://www.benchling.com/[href=https://www.benchling.com/]) to design suitable guides targeting the gene-of-interest.For this protocol, we use single guides with 20 base pairs of homology to the target sequence, as this is best-suited for CRISPR-knockout.The PAM sequence should be NGG on the 3′ side of the guide sequence, as the Cas9 strain we use is SpCas9. The PAM sequence is necessary for Cas9-mediated DNA cleavage and is found 3-4 base pairs downstream of the cut site.Guides targeting functional protein domains produce the most-efficient knockout of the target gene.",
    "For this reason, we highly recommend cross-referencing exons with protein domains to identify which guides are best-suited to disrupt protein function, as guides targeting the first exon alone can lead to false negatives (Figure 2A) (Shi et al., 2015).Additionally, we recommend designing 3 or more guides per gene, ideally targeting different exons.Order oligonucleotides through IDT or your preferred commercial source for DNA synthesis.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200715/20200715104208_8001.jpgFigure 2. Example experimental design and data analysis for the competition assay. A. Example guide RNA design. AURKB (Aurora B) encodes a kinase with key roles in mitosis. Guides are shown targeting multiple exons within Aurora B’s kinase domain. B. Example dropout data. The relative abundance of the transduced population is indicated by % GFP and the calculated fold dropout is shown over the course of five passages. C. Example dropout figure. The fold dropout over the course of five passages is shown for each guide. It can be seen that the negative control guides targeting Rosa26 exhibit minimal depletion and the positive control guides targeting RPA3 display over ten-fold dropout at the final timepoint. Consistent with prior knowledge, these results verify that AURKB is a cancer cell dependency.Identify suitable positive and negative control guidesNegative control guides should target noncoding loci or genes dispensable for cellular fitness such as Rosa26 or AAVS1. These loci are considered canonical safe-harbor sites, and thus introducing indels at these loci will have minimal effects on cancer cell fitness.Positive control guides should target essential genes, such as PCNA or RPA3. These genes are critical for DNA replication, and thus introducing indels at these loci will be detrimental to cancer cell fitness.We have provided our control guides in Table 2.",
    "Note: The sequence provided is the 20 bp spacer sequence and does not include the 4-5 bp adapter sequence for cloning into the guide vector. The adapter for our guide vector is CACC, and a G must be added if the first nucleotide of the spacer sequence is not a guanine. For example, the complete guide sequence for Rosa26 g1 listed below with the adapter added is: 5’- CACCGACAGCAAGTTGTCTAACCCG (adapter in bold). Table 2. Suggested Control Guides imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200715/20200715104240_3912.pngClone sgRNAs into guide vectorWe recommend the use of a lentiviral GFP sgRNA expression vector (Addgene), although any comparable sgRNA expression vector with a fluorescent marker is suitable for this assay. Additionally, our lab has developed and validated several derivatives of this sgRNA expression vector with different fluorescent protein markers, which can be used if needed.We provide a brief overview of the guide cloning process below. Our lab has made available a more detailed protocol for this process, which can be found in Giuliano et al. (2019).Linearize the guide vector backbone with a BsmBI digest.Anneal and phosphorylate guide oligos with T4 PNK.Ligate annealed and phosphorylated guides into guide vector backbone.Transform ligation product into competent cells.Sequence-verify the guide plasmid using the U6 primer (5′- GAGGGCCTATTTCCCATGATTCC).Note: In this section, we will introduce the guide plasmids encoding the sgRNA and fluorescent protein into the Cas9-expressing cell line. We discuss methods of lentiviral production, viral titration, and some considerations for the competition assay set-up. Transduction of Cas9-expressing cell line with guide plasmidsProduce lentivirus with guide plasmidsSee Step A2 for a brief overview of the virus production process, or our more comprehensive virus production protocol in Giuliano et al. (2019).",
    "Determine viral titerAs the guide plasmids used in this assay encode fluorescent proteins, viral titer can be approximated by transducing cells with differing amounts of virus and measuring the percentage of cells exhibiting fluorescence three days post-transduction.Researchers can also utilize a qPCR-based approach to determine viral titer if they prefer (e.g., Lenti-XTM qRT-PCR Titration Kit [Takara], see manufacturer’s protocol for more information). While such an approach may provide a more definitive answer as to the number of virus particles per microliter of supernatant, we find that the approximation provided by measuring the percentage of cells exhibiting fluorescence is sufficient for this assay.Transduce Cas9-expressing cell line with titrated viral supernatant.The ideal transduction efficiency is 50%. However, this assay is flexible in its requirements such that transduction efficiencies ranging from 10-80% are suitable for this assay.See Step A3 for a brief overview of the viral transduction process.We recommend conducting this assay on 12 or 24-well plates. This assay can be scaled up or down if needed. Generally, conducting this assay on larger plates reduces background variation, but if there are constraining factors at play (i.e., not enough virus), this assay can be conducted on a 48 or 96-well plate as well.Note: In this section, we will take our first time-point of the competition assay. We discuss methods for measuring the percentage of cells expressing the GFP marker through flow cytometry, and considerations for conducting the competition assay. Start of competition assayHarvest cellsGenerally, we set our first time-point for three days post-transduction to provide ample time for transgene expression.Seed cells at appropriate confluency for the next passagePerform an appropriate cell split (i.e., 1:2 to 1:10) depending on the cell line’s proliferative capacity.",
    "Depending on the choice of cell line and its doubling time, researchers may choose to passage the cells every three or four days.For example, we generally split the breast cancer cell line MDA-MB-231 1:4 every three days.Measure GFP expression by flow cytometryAfter plating cells for the next passage, prepare leftover samples for flow cytometry. We suggest passing cells through a single cell strainer (Falcon) prior to flow analysis. It is not necessary to utilize any flow cytometry specific resuspension buffer, as cell culture medium should be sufficient for this experiment.Run control GFP- cells to set appropriate voltages for forward scatter and side scatter lasers.Run control GFP- cells and GFP+ cells to adjust flow parameters and determine a gate for GFP-expressing cells.Run experimental samples. Researchers should aim to run at least 10% of the sample volume (i.e., if you harvested 1 ml of cells from a 12-well plate, run at least 100 µl). If possible, we recommend running about 25% of the sample, as a larger sample will yield a more accurate measurement of GFP expression.Record % GFP for all samples.To ensure experimental consistency, we suggest saving a program with your laser voltages and analysis templates to use for successive time-points.Note: In this section, we will continue the competition assay through its completion.Successive timepoints of competition assayHarvest cellsSeed cells at appropriate confluency for next passage.At the fifth timepoint, the assay is complete, and it is not necessary to re-plate the cells for the next passage.Measure GFP expression by flow cytometry."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}