{
  "id": 19816,
  "origin_website": "Wiley",
  "title": "Murine Norovirus: Additional Protocols for Basic and Antiviral Studies",
  "procedures": [
    "The assessment of antiviral activity for putative antiviral drugs in the development pipeline facilitates the discovery of new antiviral compounds. Screening of compound libraries for both 50% cytotoxicity concentrations (CC50) and effective concentrations (EC50) is an important step to ascertain the effectiveness of compounds and to assess the medicinal chemistry path being followed. This process is facilitated by a rapid first screen of antiviral activity that can then be followed up with more expensive or intensive methods that directly quantify the virus, such as qRT-PCR (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-prot-0002]) or 50% tissue culture infectious dose (TCID50; Basic Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-prot-0006] in Hwang et al., 2014[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-bib-0017]). Several methods have been developed to calculate the TCID50 and have been summarized recently (Lei et al., 2021[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-bib-0024]), where the authors also provide a spread-sheet calculator as an electronic supplementary material.",
    "Here, we present a method for indirectly assessing cell viability in the presence of MNV and antiviral compounds using CellTiter-Glo (Promega, WI, USA). The reagent lyses cells to release ATP which is then converted to a stable luminescent signal proportional to the health of the cells at the time of harvest. The sensitivity and linear range of CellTiter-Glo allow for the detection of subtle changes in the cells or virus in response to an antiviral that may go undetected with other reagents. The reagent does not require fixing or washing of cells, thereby significantly limiting loss of cells that lift off the plate during infection. This protocol generates both CC50 and EC50 values in technical triplicate on one 96-well plate. This is achieved by seeding plates with an MNV permissible cell line (Haga et al., 2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-bib-0014]; Lingemann, 2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-bib-0025]; Orchard et al., 2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-bib-0031]; Wobus et al., 2004[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-bib-0046]), treating with a dilution series of the antiviral, and infecting with MNV. The plate is incubated for 24 hr until 90% of virally infected control cells are dead, followed by the addition of the CellTiter-Glo reagent. We also illustrate the utility of indirect measurements of virus replication to observe unexpected effects that compound carriers such as dimethyl sulfoxide (DMSO) can have on norovirus infection.\nMaterials\nRAW 264.7 cells (ATCC no. TIB-71)\nDMEM-GlutaMAX-10 medium (see recipe)\nHuh7mCD300lf cells (a gift from Prof S. Taube, University Lübeck) (Lingemann, 2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-bib-0025])\n2’-C-methylcytidine (2-CMC; reference antiviral) (Sigma-Aldrich, cat. no. M4949)\nMNV-1 virus stock (ATCC no. VR-1937)\nDMSO (Sigma-Aldrich, cat. no. D5879)\nCellTiter-Glo luminescent cell viability assay (Promega, cat. no. G8461)\n75-cm2 flask\nCell scraper\nCell counter\n96-well plate, white flat bottom (Greiner Bio-One, cat. no. 655083)\nMultichannel pipette (capable of volumes up to 100 μl)\nFiltered pipette tips\nOrbital plate rocker\nIncubator, 37°C, 5% CO2",
    "96-well plate, clear flat bottom\nPlate reader capable of reading luminescent signals in a 96-well plate format\nPreparation of cells in the test plate\n1. Take a 75-cm2 flask with RAW 264.7 cells that have reached 70%-80% confluence.\n2. Scrape, count and collect the cells.\n3. Seed the test plate (96-well white flat-bottom) with 2 × 104 RAW264.7 cells/well in 100 μl DMEM-GlutaMAX-10 using a multichannel pipette and filtered tips.\nSet up a clear 96-well plate to visually monitor the cells throughout the experiment. Include antiviral-treated and infected wells in parallel to the test plate. This parallel plate is useful for observing the cell culture directly but can be omitted to reduce time or conserve compound and reagents.\nHuh7 cells expressing the CD300lf receptor (Huh7mCD300lf) can be used as an alternate cell line and are seeded at 1 × 104 cells/well.\n4. Gently rock the plate to ensure an even monolayer of cells.\n5. Incubate the plates overnight at 37°C, 5% CO2.\nSetting up the dilution plate (see Fig. 1A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-fig-0001])\n6. Prepare inhibitor dilutions in a 96-well round-bottom plate at 4× the final concentration.\nFor the reference data, 150 μM 2’-C-methylcytidine (2-CMC) on the test plate would be equivalent to 600 μM (4×) on the dilution plate.\n7. Add 50 μl DMEM-GlutaMAX-10 to all wells of the dilution plate, except column 2 rows B-G.\n8. Add 100 μl 2-CMC at 600 μM to column 2 rows B-G.\n9. Using a multichannel pipette, perform a 2-fold serial dilution of the inhibitor, transferring 50 μl from column 2 into column 3.\nOther serial dilutions can be used (e.g., 3-fold) as appropriate.\nUse of an electronic multichannel pipette is ideal as it speeds up the task.",
    "The plate set-up can be modified for screening of antivirals at a single concentration to identify lead compounds for further validation.\n10. Mix gently up and down three times and repeat the dilution series down to column 10, mix and discard 50 μl from the last column.\nAddition of antiviral and MNV to the test plate (see Fig. 1B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-fig-0001])\n11. Remove 50 μl from wells in columns 2-11 rows B-D of the test plate.\n12. Remove 25 μl from wells in columns 2-11 rows E-G of the test plate.\n13. Using a multichannel pipette transfer 25 μl of inhibitor from the dilution plate into the respective wells of the test plate.\n14. Infect cells with MNV at a final MOI of 0.1 by adding 25 μl virus to columns 2-11 rows B-D of the test plate.\nMake 1 ml of virus stock at 8 × 104 PFU/ml in DMEM-GlutaMAX-10.\nThe CellTiter-Glo assay has shown that MNV infections in RAW264.7 cells are sensitive to DMSO at concentrations >0.07% (Fig. 2B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-fig-0002]). In the presence of MNV (MOI 0.1), increased concentrations of DMSO caused an increase in percent cell viability. This is indicative of a decrease in MNV-induced killing of cells. In comparison, cell viability in the absence of MNV is not impaired until ≥2% DMSO (Fig. 2A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-fig-0002]). Wells currently designated for DMEM-GlutaMAX-10 only can be utilized as paired DMSO + virus controls if DMSO will exceed 0.07%.\nFor Huh7mCD300lf cells infect at an MOI of 0.01 and incubate for 48 hr. We have observed that replication of MNV in Huh7 CD300lf cells does not show the same sensitivity to DMSO as RAW264.7 cells.\n15. Incubate the plate at 37°C, 5% CO2 for ∼24 hr until 90-95% cell death (5%-10% cell viability) is observed in the virus-only control wells (Fig. 2B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-fig-0002]).",
    "Indirect measurement of cell viability using CellTiter-Glo\n16. Thaw CellTiter-Glo reagent and equilibrate the cell plate for 20 min at room temperature.\n17. Using a multichannel pipette, add 100 μl CellTiter-Glo reagent to each well.\nChange tips between samples to avoid ATP cross-contamination.\n18. Incubate plate on an orbital plate rocker at 200 RPM for 2 min to lyse cells.\n19. Incubate the plate in the dark for 10 min to allow luminescent signal to develop.\n20. Measure the luminescence on a plate reader.\n21. Calculate the % cell viability.\nVirus-only sample represents 0% cell viability and the cells-only sample represents 100% cell viability. These values are then graphed to determine the EC50 and CC50 values for the chosen inhibitor. Example EC50 and CC50 curves are shown in Figure 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-fig-0003].",
    "MNV levels can be assessed through reverse transcription quantitative polymerase chain reaction (RT-qPCR). This technique involves purifying viral RNA, reverse transcribing the RNA into complementary DNA (cDNA) using a reverse primer, and then exponentially amplifying the cDNA. RT-qPCR can be conducted as either a single reaction or in combination with quantitative PCR (qPCR). Ct values obtained from the qPCR values will correlate with the cDNA levels. Comparing the Ct values to a known MNV standard can be used to determine genome or cDNA equivalents.\nHere, we describe an updated protocol based on primers and probe previously described for the quantification of murine norovirus genome (Taube et al., 2009[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-bib-0038]). In this protocol, we use guanidinium thiocyanate-phenol-chloroform extraction, also known as TRIzol extraction because it quickly inhibits RNase activity and inactivates infectious virus. Coupled with Zymo-Spin columns this is an extremely fast and streamlined method to extract MNV genomes from a variety of starting materials, including but not limited to, cell culture lysates, homogenized tissues, or stool samples. Alternatively, silica-column based RNA extraction methods are also very reliable and described previously (Alternate Protocol 4 in Hwang et al., 2014[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-bib-0017]). The RNA extraction should involve a DNase I treatment step to remove DNA contamination. After RNA extraction, a one-step RT-qPCR is performed to titrate the MNV cDNA. Linearized plasmid DNA and in vitro transcribed RNA are widely used as a standard and their respective advantages and disadvantages have been described previously (Hwang et al., 2014[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-bib-0017]). The commercial availability of double-stranded gene fragments of sufficient length has now become an easy and highly reproducible alternative to linearized plasmid DNA.\nMaterials\nRNase decontamination solution (15% bleach, 0.05% SDS, 1% NaOH)\nH2O, nuclease-free\n70% and 100% ethanol, nuclease-free\nDirect-zol RNA miniprep kit with TRI reagent (Zymo Research, cat. no. R2051)",
    "iTaq universal probes one-step kit (BioRad, cat. no. 1725140)\nForward primer (5’ to 3’; desalted and/or HPLC purified):\n               \nGTGCGCAACACAGAGAAACG\nReverse Primer (5’ to 3’; desalted and/or HPLC purified):\n               \nCGGGCTGAGCTTCCTGC\nProbe modified at the 5′-end with a 6-carboxyfluorescein (FAM) and at the 3′-end with a quencher, e.g., black hole quencher 1 (BHQ1) (5’ to 3’; HPLC purified):\n[6-FAM]-CTAGTGTCTCCTTTGGAGCACCTA-[BHQ1]\nMNV-1 gBlock (shown is the sequence of the top strand 5’ to 3’; generate as double-stranded DNA):\n               \nGTGCGCAACACAGAGAAACGCAAAAACAAGAAGGCTTCGTCTAAAGCTAGTGTCTCCTTTGGAGCACCTAGCCCCCTCTCTTCGGAGAGCGAAGACGAAATTAATTACATGACCCCTCCTGAGCAGGAAGCTCAGCCCG\nTwo sets of pipettors, one designated for handling RNA and master mix(es) and one designated for handling DNA\n1000-, 100-, and 10-µl nuclease-free filter tips\n1.5-ml microcentrifuge tubes, nuclease-free, designated for RNA or DNA/plasmid work\nIce\nMicrocentrifuge, 4°C\n96-well PCR-plate, white, 100 µl volume (Sarstedt, cat. no. 72.1977.23)\nOptical qPCR-film, DNase-/RNase-free, highly transparent (Sarstedt, cat. no. 95.1999)\nPlate centrifuge\nRT-qPCR machine\nViral RNA isolation\n1. Prepare an RNA-designated workspace cleaned with RNase decontamination solution, incubate for at least 5 min, then rinse with nuclease-free H2O and nuclease-free 70% ethanol.\nUse of a clean designated “RNA only” workspace with its own set of pipettors, tips, and microcentrifuge tubes is highly advisable. Treat your gloved hands with RNase decontamination and thoroughly clean your equipment including pipettors, tip-boxes etc. before use to minimize the presence of nucleases in the work area. Alternative commercial decontamination solutions may also be used such as RNase Away (Sigma, cat. no. 83931).\n2. Extract viral RNA from your sample (i.e., cell culture lysate or homogenized tissue) with the direct-zol RNA miniprep kit with TRI reagent following the manufacturer's recommendations.",
    "For TRIzol extraction it is highly recommended to use the silica membrane-based columns (i.e., Zymo-Spin IICR Column), to remove any phenol contaminants. Treat your sample with TRI-reagent (TRIzol or TRIzol LS). For cell suspensions use 3-4 volumes of TRI-reagent. For direct lysis in a cell culture dish use 100 µl TRI-reagent per square-centimeter surface. Follow the manufacturer's instructions and include the recommended DNase I digest.\nFor any “open-tube” spin-column extraction, such as the QIAamp Viral RNA kit or RNeasy kit an RNA-only microcentrifuge is recommended. A vacuum manifold is not recommended because cross-contamination with plasmid DNA cannot easily be excluded.\n3. Elute or resuspend the RNA in 50 µl nuclease-free H2O. Use an RNase-free microcentrifuge tube.\nThe eluted RNA can be used immediately or stored aliquoted at ‑80°C.\nThis protocol works well without the use of RNase inhibitors. If commercial RNase inhibitors are used, they need to be tested because there is a chance they interfere with the RT-qPCR protocol. The use of spectrophotometry to estimate the purity/integrity of RNA is discouraged, as it will only reliably measure cellular RNA or carrier RNA present in some commercial RNA kits.\nRT-qPCR\nThe RT-qPCR is performed as previously described (see Alternate Protocol 4 in Hwang et al., 2014[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-bib-0017]) using the iTaq universal probes one-step kit. Be aware that the optics of the qPCR machine need to be compatible with your qPCR master mix and the fluorophore used for the probe.\n4. Plan the plate arrangement according to the number of samples, including standard dilutions, a no-template control (NTC) that serves as a general control for extraneous nucleic acid contamination, and a no transcriptase control (NRT) that assesses the amount of DNA contamination present in an RNA preparation.",
    "Each sample and control should be run in duplicate, but preferably in triplicate, to observe for pipetting error.\n5. Thaw reaction components on ice, mix them thoroughly and centrifuge briefly at maximum speed to collect the content at the bottom of the tubes.\nLight-sensitive components should be protected from light (i.e., probe).\n6. Set-up the RT-qPCR reaction by calculating the amount of each component needed (see Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-tbl-0001]). A reaction volume of 20 µl is sufficient.\nTable 1.\n                Pipetting Scheme for the RT-qPCR Master Mixa[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-tbl1-note-0001_57]\ntable:\n﻿Component,Initial concentration,Final concentration,Volume,Master mix\nUnnamed: 0_level_1,Unnamed: 1_level_1,1 reaction,1 reaction,100 reactions\nMaster mix,2×,1×,10 µl,1000 µl\nFwd primer,25 µM,0.3 µM,0.24 µl,24 µl\nRev primer,25 µM,0.3 µM,0.24 µl,24 µl\nProbe,25 µM,0.125 µM,0.1 µl,10 µl\nRNA template,–,–,5 µl,–\niScript RT,40×,–,0.5 µl,50 µl\nNuclease-free H2O,–,–,3.92 µl,392 µl\nTotal,–,–,20 µl,1500 µl\nEach,,,,15 µl\na The volumes and components resemble the recommended reaction setup from BioRad One-Step RT-qPCR kit (cat. no. 1725140, 1725141 and 12013250). To account for pipetting error, a 100-reaction master mix is recommended for a complete 96-well plate.\n7. Prepare a master mix in a 1.5-ml nuclease-free tube, containing each component except for the template. The NRT control-mix can be removed from the master mix before adding the reverse transcriptase.\nThis step can be carried out at room temperature, as the polymerase used in commercial master mixes usually requires heat-activation (hot-start) and the components are stable at room temperature. Alternatively, this step can also be carried out on ice.\n8. Mix thoroughly and pipet 15 µl into the required wells of a 96-well PCR plate.\nComponents of the master mix should be pipetted in the RNA working area while the standard should be pipetted in the DNA working area using a designated set of pipettors.",
    "9. Pipet 5 µl of each sample RNA into the required well. Add nuclease-free H2O to NTC and NRT to match the total volume of the samples.\n10. Add the standard last and make sure the standard contains at least six 10-fold dilutions of a control dsDNA (see Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-prot-0003] on preparing the standard).\nThe standard should be pipetted on a designated DNA working area with its own set of pipettors.\n11. Cover the plate with the optical qPCR film and centrifuge the plate briefly at maximum speed to collect all the volume at the bottom of each well.\nIf no plate-centrifuge is available, tap the plate to remove bubbles and collect all the volume at the bottom of the well.\n12. Load the plate into the RT-qPCR machine and run the RT-qPCR reaction after programming the thermal cycler settings as follows:\n         \nReverse transcription for 25 min, 50°C\nActivation and initial denaturation for 5 min, 95°C\n40 cycles of denaturation for 10 s, 94°C, and annealing and elongation for 30 s, 60°C\n13. Perform data analysis according to the instrument's specific instructions.",
    "Depending on your application, you can use a standard derived from in vitro transcribed RNA, or dsDNA (double-stranded DNA). Both have their advantages and disadvantages. In vitro transcribed RNA needs to be generated, purified, and aliquots must be stored at –80°C. On the other hand, dsDNA standards are easily obtained and highly reproducible but lack the control step for reverse transcription. For dsDNA standards you can use plasmid DNA or commercial custom dsDNA fragments, such as gBlocks from Integrated DNA Technologies (IDT) that comprise the complete amplicon of the qPCR. If you use plasmid DNA, a linearization step followed by column-based purification method is highly recommended, as circular DNA is not as efficiently amplified during cycling because primer/probe binding may be impaired for super-coiled DNA. Copy numbers can be derived from the measured mass of the ssRNA (single-stranded RNA) or dsDNA molecule.\n         \na. Determine the concentration of the linearized plasmid by spectrophotometry and convert the readout to g/L. Accurate measurements are key here to obtain reproducible results.\nb. Calculate the molecular weight (MW) by multiplying the DNA size (in base-pairs) by 662 g/mol, which is the average weight of a nucleotide pair. Alternatively, online calculators can be used to calculate the precise MW of the DNA based on sequence (MW needs to be multiplied by 2 to account for dsDNA).\nExample: a gBlock corresponding to the size of the PCR amplicon of MNV-1 (139 bp) has a MW of 85,758 Da or 85.76 kDa.\nc. Calculate the molar concentration (M) of your linearized plasmid:\n               \nM = mol/L = (mass [gram]/MW)/1 L\nExample: a gBlock of MNV-1 (139 bp) usually has a concentration of 3000 fM\n3000 fM = 3 × 10-12 M\nd. The copy number (cp) can be calculated based on Avogadro's constant:",
    "1 M is ∼6.02 × 1023 copies:\ncp = 1 M × 6.02 × 10²³\ncp = 3 × 10-12 M × 6.02 × 10²³\ncp = 1.8 × 1012\ne. The dsDNA is now adjusted to 2 × 108/µl\nIn this example 1.8 × 1012 cp are resuspended in 9 ml nuclease-free H2O.\nf. The PCR pipetting scheme requires 5 µl template/standard. From a 2 × 108/µl stock this equals 1 × 109 copies per PCR well.\nAdditional Materials (also see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-prot-0002])\n8-strip PCR tubes (optional)\n1. Generate a standard curve by performing a series of at least six 10-fold serial dilution, changing tips between each dilution-step. A suitable dilution range for a standard set is from 107 to 102 copies per well.\nEach dilution is stored as a single-use aliquot at ‑80°C. 8-strip PCR tubes have proven useful for a set of standards.\nMake sure that your standard curve has a correlation coefficient (R2) higher than 0.98 and shows a slope close to -3.3, which ensures that your primers have close to 100% efficiency for amplification (you have double the original amount of template as each cycle progresses). The most dilute standard within the linear range of the standard curve can be as few as 2 genome copies, thus, the reliable limit of detection for this protocol of MNV-1 amplification is 2 genome copies per PCR well.\n2. Calculate the genome copies per well\tif the entire well was used in the RNA extraction. For this, consider that only 1/10 of your RNA extraction (5 µl out of 50 µl elution volume) was analyzed. To obtain the genome-equivalents per well (GE / well) multiply your GE reading from the qPCR machine with your dilution factor, in this case 10.",
    "3. Calculate genome copies per ml if you have used a specific volume for the RNA extraction. Consider that only 1/10 of your RNA extraction (5 µl out of 50 µl elution volume) was analyzed. Additionally, consider the sample volume used in the lysis reaction, e.g., if you used 500 µl of a virus stock together with the TRI-reagent, multiply your copy numbers by 2 to bring it up to 1 ml. In total for this example, multiply by 20 to obtain GE/ml.",
    "Reverse genetics provides an invaluable technique for exploring norovirus biology, allowing for the introduction of specific mutations into a cDNA clone of the viral genome via site-directed mutagenesis (Liu & Naismith, 2008[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-bib-0026]) and subsequent recovery of the recombinant virus through transfection of genomic cDNA or in vitro transcribed RNA into permissive cells. The original DNA-based reverse genetics protocol is based on a publication by Ward et al. (2007[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-bib-0043]). An RNA-based protocol was later developed in the laboratory of Ian Goodfellow (Arias et al., 2012[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-bib-0002]), which allowed minimal passaging by directly transfecting capped RNA transcripts into BV-2 cells using the specialized Neon electroporation system (Life Technologies). An account of the available DNA and RNA based reverse genetics systems has previously been summarized (see Basic Protocols 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-prot-0004] and 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-prot-0005] in Hwang et al., 2014[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-bib-0017]).",
    "Generation of infectious MNV from cDNA is technically challenging in naturally susceptible cell lines such as RAW264.7 cells or BV-2 due to difficulties in efficiently transfecting these cells. The identification of mCD300lf as an entry receptor for MNV (Orchard et al., 2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-bib-0031]) has now enabled the generation of susceptible cell lines from any permissive cell line, thus overcoming the limitation in the choice of easily transfectable cell lines. Huh7 human hepatoma cells are easily transfectable with a variety of transfection reagents and have been transduced to stably express mCD300lf generating Huh7mCD300lf (Lingemann, 2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-bib-0025]). Lentiviruses are the tool of choice for fast and efficient generation of stable homogeneous cell lines for gene expression (Zufferey et al., 1998[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-bib-0048]). A protocol for the lentivirus vector generation (Zufferey et al., 1998[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-bib-0048]) is available from the Trono lab website (Lentivector Toolbox, see Internet Resources). Here, we provide an updated RNA-based reverse genetics protocol for MNV (based on Arias et al., 2012[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-bib-0002]) using Huh7mCD300lf cells with minimal passaging. The protocol can also be easily applied to cDNA from the Ward et al. (2007[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-bib-0043]) system. Transfection of Huh7mCD300lf with MNV.CW1 wild type in vitro transcribed RNA typically yields between 1 × 105 and 1 × 107 TCID50/ml within 48 to 96 hr post transfection while DNA transfection typically yields ∼1 log less.\nAdditional Materials (also see Basic Protocols above)\nMNV cDNA (pT7: MNV 3’Rz) plasmid (a gift from Prof I. Goodfellow, University of Cambridge)\nNheI restriction enzyme (NEB, cat. no. R0131S)\nMAXIscript T7 transcription kit (Thermo Fisher, cat. no. AM1314M), or similar\nScriptCap m7G capping system (CellScript, cat. no. C-SCCE0625) or faustovirus capping enzyme (NEB, cat. no. M2081L)\n0.05% Trypsin in PBS with 0.02% EDTA (GENAXXON bioscience, cat. no. C4261.0110)\nCell culture medium (see recipe)\nOpti-MEM I (Thermo Fisher, cat. no. 31985070)",
    "Lipofectamine MessengerMAX for RNA-based transfection (Thermo Fisher, cat. no. LMRNA003)\nFugene HD transfection reagent for DNA-based transfection (Promega, cat. no. E2311)\nBV-2 cells (a gift from Prof I. Goodfellow, University of Cambridge)\nNanoDrop 2000 spectrophotometer, or similar\n6-well cell culture plate\nAdditional reagents and equipment for phenol/chloroform extraction (see Current Protocols, 1994[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-bib-0004]) and agarose gel electrophoresis (see Voytas, 2000[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-bib-0042]).\nSynthesis of infectious capped MNV transcripts\n1. Digest 10-20 µg of the plasmid containing the wild-type MNV cDNA (pT7:MNV3’Rz) with NheI to obtain linear DNA. Table 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-tbl-0002] shows a typical restriction setup for NheI digestion.\nNheI recognizes a unique restriction site after the 3′-end poly(A) tail of the MNV genome; thus, it defines the 3′ end of transcription with a tolerated addition of a single guanosine to the 3′ end of the genome.\nTable 2:.\n                Reaction Setup for NheI Linearization of MNV cDNA\ntable:\n﻿Components,Final concentration,Volume (µl)\n10× CutSmart buffer (NEB),1×,20\nNheI-HF 20 U/µl (NEB),0.3 U/µl,3\ncDNA (pT7:MNV3’Rz),100 ng/µl,Variable\nddH2O,-,add to 200\n2. Incubate at 37°C for 2 hr. Keep at least 2 µl from the linearized DNA for later electrophoresis analysis.\n3. Purify the linearized DNA by phenol/chloroform extraction, ensuring RNase-free conditions. Determine DNA concentration measuring the absorbance at 260 nm by spectrometry (e.g., NanoDrop).\n4. Ensure complete linearization and condition of purified DNA by gel electrophoresis.\n5. Perform the in vitro transcription from the purified, linearized DNA using T7 RNA polymerase from the MAXIscript T7 transcription kit (Invitrogen). Table 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-tbl-0003] shows a typical reaction for the MAXIscript T7 transcription kit.\nEnsure all centrifuge tubes and filter tips are certified as RNase-free.\nTable 3.\n                Reaction Set Up for in vitro Transcription of Linearized MNV cDNA\ntable:\n﻿Reagent,Final concentration,Volume (µl)\n10× buffer,1×,4\nrNTPs (10 mM each),0.5 mM each,8 (2 each)\nT7 enzyme (15 U/µl),0.75 U/µl,2\nLinear DNA,100 ng/µl,(3-4 µg) ∼10-15",
    "RNase-free ddH2O,–,Up to 40\n6. Incubate at 37°C for 2 hr. Digest the DNA with 1 µl TURBO DNase I (MAXIscript T7 transcription kit, 2 U/µl) at 37°C for 30 min to ensure complete DNA digestion. Keep back at least 2 µl from the in vitro transcription for electrophoresis analysis.\n7. Purify the RNA to remove unincorporated nucleotides, enzymes and other impurities using TRI reagent for RNA extraction (see step 2 of Viral RNA Isolation in Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-prot-0002]). Elute the RNA with 69 µl RNase-free-ddH2O by centrifugation, and determine RNA concentration and purity by measuring the absorbance at 260 nm by spectrometry (e.g., NanoDrop). Keep at least 2 µl RNA for electrophoresis analysis.\n8. Perform capping with the ScriptCap m7G capping system. Alternatively, the faustovirus capping enzyme can be used. Cap the purified RNA by first denaturing at 65°C for 5-10 min and immediately store on ice. A typical ScriptCap reaction is shown in Table 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-tbl-0004].\nThe official ScriptCap protocol states to use 4 µl capping enzyme but 1 µl has been tested and works sufficiently if needed.\nTable 4.\n                Reaction Setup for Capping of in vitro Transcribed MNV RNA\ntable:\n﻿Reagent,Per 100 µl reaction,Notes\nDenatured IVT RNA,(50-60 µg) 69 µl,\n10× capping buffer,10 µl,\"Dissolve at 37°C, thaw at room temperature, vortex before use\"\n10 mM GTP,10 µl,\n2 mM SAM,5 µl,Dilute fresh from 20 mM stock\nRNase inhibitor,2.5 µl,ScriptGuard RNase Inhibitor\nCapping enzyme,4 µl,As little as 1 µl can also be used\n9. Incubate at 37°C for 1.5 hr. Reserve 2 µl for electrophoresis analysis (Fig. 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-fig-0004]). Capped RNA can be used straight away or stored at −80°C.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/10261c75-5a4b-418b-8aa9-874c81b36eb2/cpz1828-fig-0001-m.jpg</p>\nFigure 1",
    "Preparation of the inhibitor dilution (A) and test (B) plates. Wells in green contain only DMEM-GlutaMAX-10. (A) Wells in blue contain dilutions of the inhibitor at the indicated concentrations. (B) Pink indicates wells containing RAW 264.7 cells, MNV and a 2-fold dilution series of inhibitor, for measuring antiviral effects. Yellow indicates wells containing RAW 264.7 cells and a 2-fold serial dilution of inhibitor, for measuring cell cytotoxicity. Inhibitor concentrations range from 150 μM to 0.6 μM with a 0 μM cells only control and virus only control.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/37990478-c41b-4d38-a9ab-ebf078ce7bbb/cpz1828-fig-0002-m.jpg</p>\nFigure 2\nEffect of DMSO on cell viability. RAW 264.7 cells were treated with DMSO at various final percentages and either left uninfected (cells only) (A) or infected with MNV at an MOI of 0.1 (B). Cells were incubated for 24 hr, and viability measured with CellTiter-Glo. (A) Effect of DMSO alone upon RAW264.7 cells. Luminescence signals were normalized to those of the 0% DMSO control to determine the % cell viability. (B) Luminescence signals for MNV infected samples were normalized against those of the 0% DMSO cells only control, representing 100% viable cells.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/f86ddcd0-33c5-414d-8b29-25d1511b2c87/cpz1828-fig-0003-m.jpg</p>\nFigure 3\nReference EC50 and CC50 data with 2-CMC. Luminescence data obtained with CellTiter-Glo was normalized, with virus only and cells only representing 0% and 100% cell viability respectively. Graphs were generated using GraphPad Prism and represent the mean and standard deviation of three technical repeats. (A) Determination of 2-CMC EC50 with MNV. Concentrations of 2-CMC that are cytotoxic to cells were excluded. (B) A CC50 graph was generated for cells in the presence of 2-CMC (150 μM-0.6 μM). Curves were generated with a non-linear regression model, log (inhibitor) versus normalized response–variable slope.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/4b4c25e5-4d01-4bbd-991b-01235159f80d/cpz1828-fig-0004-m.jpg</p>\nFigure 4",
    "Analysis of MNV RNA transcript integrity by nondenaturing gel electrophoresis. In vitro transcribed RNA (IVT), purified RNA (Pure), and capped RNA (Cap) products are run at 120 V for 10 min on a nondenaturing 1% agarose gel (TAE buffer) in parallel to a GeneRuler 1 kb Plus DNA Ladder (1 kb, lane 1, not representative of RNA sizes).\n10. Run the in vitro transcribed, purified, and capped RNA samples together by gel electrophoresis (1% Agarose, 1× TAE) (Fig. 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-fig-0004]). Run the electrophoresis at 120 V for only 10 min to avoid RNA degradation. Bands should be of equal size with decreasing intensity as the RNA becomes more dilute. Smears or multiple bands may indicate degradation at different steps but can be a result of the gel electrophoresis.\nEnsure the electrophoresis chamber is as RNase-free as possible to avoid RNA degradation. An occasional clean with a solution containing NaOH should be sufficient, but repeated use will corrode the components.\n11. One day prior to transfection, trypsinize a monolayer of Huh7mCD300lf cells and seed 2 × 105 cells per well of a 6-well plate, in cell culture medium. Cells should be ∼70% confluent at the time of transfection.\n12. Prepare an RNA- and a transfection-mix:\n         \nFor the transfection-mix, add 3.75 µl Lipofectamine MessengerMAX to 100 µl Opti-MEM and incubate at room temperature for 10 min.\nFor the RNA-mix, add 2.5 µg RNA to 100 µl Opti-MEM (always thaw and store RNA on ice to avoid degradation).\nFor a DNA based reverse genetics system the RNA can be substituted with MNV cDNA from plasmid (Ward system). We recommend the Fugene HD-based transfection protocol (Hwang et al., 2014[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-bib-0017]) with a plasmid to Fugene HD ration of 1:4. However, simple DNA transfection protocols, such as calcium phosphate (Kwon & Firestein, 2013[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-bib-0023]) also work.",
    "13. Combine the RNA (or DNA) and transfection mix with a slight flick and incubate at room temperature for ∼5 min (but do not exceed 30 min). Other transfection reagents may have different incubation times, so adjust accordingly if needed.\n14. Meanwhile, remove the cell culture medium from the seeded 6-well and replace with 800 µl Opti-MEM.\n15. Add the ∼200 µl transfection mix to the cells, drop-wise (carefully allowing the transfection mix to drop directly onto the cells instead of the more common addition of into the well wall).\n16. Incubate at 37°C, 5% CO2, 95% relative humidity (RH) for 3-4 hr.\n17. Replace the Opti-MEM transfection with 2 ml cell culture medium.\n18. Freeze both media and cells at 2 days post-transfection at −80°C. Use cell lysate for titration by end-point dilution assay or plaques assay.\n19. Passage on standard BV-2 cells or RAW246.7 cells to expand the viral stock if necessary.",
    "The use and utility of recombinant virus infectious clones and replicons has revolutionized our understanding of the molecular events of the intracellular replication of many (+)-sense RNA viruses. In addition, it has informed some attributes of protein function and guided the development of antiviral compounds and therapies. Many reverse genetics systems have been employed to derive authentic full-length copies of the MNV genome in addition to mutants and to some extent the development of reporter viruses (also seeo Basic Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-prot-0005] and Alternate Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-prot-0016] in Hwang et al., 2014[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-bib-0017]). The protocol described within is founded on the publication by Amarilla et al. (2021[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-bib-0001]). Essentially, we describe the assembly of PCR fragments encompassing the entire genome that are circularized with a linker containing a poly-A tail, hepatitis D virus ribozyme and a CMV promoter (see Fig. 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-fig-0005]). This assembly is then transfected into NIH3T3 cells whereupon the full-length viral genome is transcribed by the host RNA pol II enzyme before translation and replication in the cytoplasm. In NIH3T3 cells this usually yields ∼103 pfu/ml of MNV which is subsequently transferred and amplified in RAW264.7 cells to generate ∼108 pfu/ml. The advantages of this approach are: (i) rapid recovery of virus, (ii) no requirement for cloning or transformation in bacterial cultures, and (iii) gene blocks can be synthesized from sequence alone to generate the fragments required for the CPER assembly.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/0d7ee2b4-6800-44b4-87ff-01ea21a43cb1/cpz1828-fig-0005-m.jpg</p>\nFigure 5\nSchematic showing the workflow and conceptual design of the CPER approach to generate MNV. The PCR fragments can be produced from isolated viral RNA that has been reverse-transcribed (RT) or from a cDNA plasmid entire MNV genome. The amplified PCR fragment are combined and ligated with the linker fragment for assembly. The reaction is subsequently transfected into cells and infectious virus is recovered.\nMaterials",
    "High-fidelity PrimeSTAR GXL DNA polymerase (Takara Bio, cat. no. R050B)\nPrimers (all listed as sequence 5′ to 3′):\n \n         \ntable:\n﻿0,1,2\nFragment 1,MNV_Frag1.F,GTGAAATGAGGATGGCAACGCCATCTTC\n,MNV_Frag1.R,CTGACACAGTTGACAAGTGTTTTGGGC\nFragment 2,MNV_Frag2.F,GCCCAAAACACTTGTCAACTGTGTCAG\n,MNV_Frag2.R,CACTCATCCTCATTCACAAAGACTGCTGAG\nFragment 3,MNV_Frag3.F,CTCAGCAGTCTTTGTGAATGAGGATGAGTG\n,MNV_Frag3.R,GCAGTAAGCAGAAATCATTTTCACAAAAGGTTTC\nLinker fragment (full sequence below),MNV_Linker.F,GAAACCTTTTGTGAAAATGATTTCTGCTTACTG\n,MNV_Linker.R,GAAGATGGCGTTGCCATCCTCATTTCAC\n5× PrimeSTAR GXL buffer (Takara Bio, cat. no. R050B)\n10 mM dNTP mix (Takara Bio, cat. no. R050B)\nFull-length MNV-containing plasmid (pSPORT-T7-MNV1; received via a materials transfer agreement from Dr. Herbert Virgin)\nPlasmid containing MNV linker sequence and HDV ribozyme (pUC19-MNV-CMV_Linker) (available from Dr. Jason Mackenzie)\nZymoclean gel DNA recovery kit (Zymo Research, cat. no. D4007)\nNIH3T3 (ATCC CRL-1658) or HEK 293T (ATCC CRL-3216) cells growing in culture (low passage number works better)\nLipofectamine 3000 transfection reagent (Invitrogen, cat. no. L3000015)\nOpti-MEM (Gibco, cat. no. 11058021)\nSerum-free DMEM (Gibco, cat. no. 10567022) supplemented with 1% GlutaMAX (Gibco, cat. no. 35050061), and 1% sodium pyruvate (100 mM; Gibco, cat. no. 11360070)\nDMEM supplemented with 4% FCS (Bovogen, cat. no. SFBS), 1% GlutaMAX, and 1% sodium pyruvate (100 mM)\nDMEM supplemented with 10% FCS, 1% GlutaMAX, and 1% sodium pyruvate (100 mM; Gibco), referred to as complete medium\nPCR tubes\nVortex\n100-mm cell culture dish\n15-ml conical centrifuge tubes (e.g., BD Falcon)\nBenchtop centrifuge (Eppendorf 5424R)\nSequencing facility to confirm the MNV fragments (if necessary)\nNOTE: All steps are carried out at room temperature. Media should be warmed to 37°C or equilibrated to room temperature.\nCPER reaction\nAll primers are designed with a 27-33 bp overlap and approximately equal melting temperature (Tm) of 60°C. High-fidelity PrimeSTAR GXL DNA polymerase (Takara Bio) is used for all PCR amplifications.\n1. PCR amplify CPER fragments in PCR tubes using primers listed in the materials list under the following conditions.\nExample: PCR amplification of MNV fragment #1.\nReaction setup:\n         \ntable:\n﻿0,1\n5× PrimeSTAR GXL buffer,10 µl\n10 mM dNTP mix,4 µl",
    "10 µM MNV_Frag1.F,1 µl\n10 µM MNV_Frag1.R,1 µl\n1 µg/µl pSPORT-T7-MNV1,1 µl\nPrimeSTAR GXL DNA polymerase,1 µl\nNuclease-free H2O,32 µl\nTotal volume,50 µl\nAmplification cycles:\n         \n98°C for 30 s\n98°C for 10 s, 55°C for 15 s, for 30 cycles\n68°C for 3 min\nFinal extension at 68°C for 10 min.\n2. Purify PCR reactions by agarose gel electrophoresis and recover DNA using Zymoclean gel DNA recovery kit following the manufacturer's instructions.\n3. Determine DNA concentration of each fragment using NanoDrop 2000 spectrophotometer.\nWhere necessary, these DNA fragments can be sequenced using the primers listed above.\n4. Each CPER reaction requires 0.1 picomole of each respective cDNA fragment and the corresponding linker fragment. Use the online calculator (see Internet Resources) to calculate the amount of DNA (ng) given the size (bp) of each fragment that equates to 0.1 picomole. Using this value, calculate the volume of each fragment required for the CPER reaction.\n         \ntable:\n﻿0,1\nFragment,Size (bp)\nMNV linker,1156\nMNV fragment #1,2398\nMNV fragment #2,2697\nMNV fragment #3,2312\nExample: calculate the amount of MNV fragment #1 required for CPER reaction. Assuming recovered DNA is 109.5 ng/µl and the size of the fragment is 2398 bp, 0.1 picomole equates to 155.87 ng of DNA (at 2398 bp). Thus 155.87 ng divided by 109.5 ng/µl = 1.4 µl of fragment #1 required for CPER reaction.\n5. Prepare the CPER reaction by combining 0.1 picomole of each fragment and linker with PrimeSTAR GXL DNA polymerase (Takara Bio) to a total reaction volume of 50 µl.\nExample: CPER reaction for MNV. Assuming recovered DNA for each fragment is: fragment #1 109.5 ng/µl; fragment #2 86.9 ng/µl; fragment #3 111.4 ng/µl; linker fragment 72.7 ng/µl.\nReaction setup:\n         \ntable:\n﻿0,1\nMNV fragment #1,1.4 µl\nMNV fragment #2,2 µl\nMNV fragment #3,1.4 µl\nMNV linker fragment,1 µl",
    "5× PrimeSTAR GXL buffer,10 µl\n10 mM dNTP mix,4 µl\nPrimeSTAR GXL DNA polymerase,2 µl\nNuclease-free H2O,28.2 µl\nTotal,50 µl\nCycling conditions:\n         \n98°C for 30 s\n98°C for 10 s, 55°C for 30 s, for 12 cycles\n68°C for 10 min\nFinal extension at 68°C for 10 min.\nTransfect NIH3T3 cells with MNV CPER reaction and passaging on RAW264.7 cells\nPrepare NIH3T3 cells the day before by seeding cells into 6-well plate so that they are ∼70%-80% confluent at the time of transfection. It is important to be gentle with NIH3T3 cells as they are easily dislodged from the flask/plate. It is also possible to use HEK 293T cells instead of NIH3T3.\n6. In one 1.5-ml microcentrifuge tube dilute 5 µl Lipofectamine 3000 in 120 μl Opti-MEM, vortex briefly and allow to sit for 5 min.\n7. In a second 1.5-ml microcentrifuge tube combine the entire CPER reaction (50 µl DNA) with 70 μl Opti-MEM and 5 µl P3000 reagent provided with the Lipofectamine 3000 to enhance transfection. Mix well.\n8. Add all 125 µl Lipofectamine 3000 mixture to the 1.5 ml microcentrifuge tube containing CPER DNA and mix well.\n9. Incubate solutions for 15 min at room temperature while preparing cells.\n10. To prepare cells, gently remove cell culture medium and replace with 1000 µl serum-free DMEM.\n11. Carefully tilt 6-well plate containing NIH3T3 cells and add the transfection mix (from step 8) to the cell culture medium (from step 10). To ensure even distribution of the cDNA, gently rock the plates before placing them at 37°C with 5% CO2.\n12. After 3 to 5 hr add 800 µl of DMEM supplemented with 4% FCS.\n13. For the recovery of MNV the transfected cell supernatant is collected at 72 hr post-transfection (h.p.t.).",
    "Prepare RAW264.7 cells the day before by seeding into 100-mm cell culture dish with 10 ml complete medium so that they are ∼80% confluent at the time of infection.\n14. The collected supernatant is then clarified from cell debris by centrifugation in 15-ml centrifuge tubes for 5 min at 500 × g, room temperature. 100 μl clarified supernatant is stored at −80°C (for subsequent virus quantitation by plaque assay) while the remaining supernatant (∼1900 μl) is immediately passaged onto a 100-mm culture dish seeded to 80% confluency with RAW264.7 cells.\n15. After a 1 hr inoculation of RAW264.7 cells with transfection supernatant, add an additional 10 ml DMEM supplemented with 4% FCS to each dish.\n16. Monitor cells daily for cytopathic effect and harvest when CPE is observed (∼3 days).\n17. Cell supernatant from the passaged RAW264.7 cell cultures was collected at 3 days post infection.\n18. Clarify from cell debris by centrifugation for 5 min at 500 × g, room temperature, and store at −80°C.\nUse plaque assay (see Alternate Protocol 3) or TCID50 (see Basic Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-prot-0006] in Hwang et al., 2014[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-bib-0017]) to confirm the presence of viruses both in the cleared lysates from NIH3T3 and RAW264.7 cells.\nSequence of MNV linker fragment\nGACATTGATTATTGACTAGTTATTAATAGTAATCAATTACGGGGTCATTAGTTCATAGCCCATATATGGAGTTCCGCGTTACATAACTTACGGTAAATGGCCCGCCTGGCTGACCGCCCAACGACCCCCGCCCATTGACGTCAATAATGACGTATGTTCCCATAGTAACGCCAATAGGGACTTTCCATTGACGTCAATGGGTGGAGTATTTACGGTAAACTGCCCACTTGGCAGTACATCAAGTGTATCATATGCCAAGTCCGCCCCCTATTGACGTCAATGACGGTAAATGGCCCGCCTGGCATTATGCCCAGTACATGACCTTACGGGACTTTCCTACTTGGCAGTACATCTACGTATTAGTCATCGCTATTACCATGGTGATGCGGTTTTGGCAGTACACCAATGGGCGTGGATAGCGGTTTGACTCACGGGGATTTCCAAGTCTCCACCCCATTGACGTCAATGGGAGTTTGTTTTGGCACCAAAATCAACGGGACTTTCCAAAATGTCGTAACAACTGCGATCGCCCGCCCCGTTGACGCAAATGGGCGGTAGGCGTGTACGGTGGGAGGTCTATATAAGCAGAGCTCGTTTAGTGAACCGGTGAAATGAGGATGGCAACGCCATCTTCGAAACCTTTTGTGAAAATGATTTCTGCTTACTGCTTTCTTTTCTTTGTGGTAGTTAGATGCATTTTAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAGGGTCGGCATGGCATCTCCACCTCCTCGCGGTCCGACCTGGGCATCCGAAGGAGGACGTCGTCCACTCGGATGGCTAAGGGAGAGCCACTTTTCTCTCGATTCTCTATCGGAATCTAGGGAGCTCGGATCCAGACATGATAAGATACATTGATGAGTTTGGACAAACCACAACTAGAATGCAGTGAAAAAAATGCTTTATTTGTGAAATTTGTGATGCTATTGCTTTATTTGTAACCATTATAAGCTGCAATAAACAAGTTAACAACAACAATTGCTCGAGGGGGGGCCCGGTACCTTGAAGCTGTCCCTGATGGTCGTCATCTACCTGCCTGGACAGCATGGCCTGCAACGCGGGCATCCCGATGCCGCCGGAAGCGAGAAGAATCATAATGGGGAAGGCCATCCAGCCTCGCGTCGGCGCTTAA",
    "The expression of mammalian viral proteins in Escherichia coli is commonly undertaken. However, many viral proteins are difficult to express in E. coli and the issues of solubility and lack of post-translational modification remain. Recombinant baculovirus infection in insect cells is an effective, robust, and widely used alternative. This eukaryotic expression system has been used for norovirus virus-like particle production and is available in a range of commercial options, including the bacmid system and homologous recombination systems for recombinant virus construction. The benefits of expressing proteins through baculovirus includes the availability of the host eukaryote post-translational modification systems, such as phosphorylation, and the ability to transduce mammalian cells at high efficiency in the absence of viral replication. The baculovirus expression vector system (BEVS) is therefore a relevant system to express the potentially phosphorylated HuNV NS1-2 protein for recombinant protein production in insect cells, mammalian cells and to generate isotopically labelled proteins for NMR analysis. Herein, we describe the expression of the NS1-2 protein in insect cell suspension cultures in serum-free medium. Using this system, we and others have also expressed NS5 (VPg), NS6 (Pro), NS7 (Pol), NS6/7 (ProPol) and VP1 from GI, GII and GV noroviruses. The generation of the recombinant virus can be performed using any commercially available baculovirus system, for this protocol the FlashBac Ultra system from Oxford Expression Technologies (Oxford, UK) was utilized.",
    "NOTE: The NS1-2 coding sequence used in this protocol for recombinant protein production and purification represents amino acids 3-249 of the NS1-2 protein and is therefore devoid of the C-terminal transmembrane region. The construct includes an N-terminal histidine and/or STREP-II tag for protein purification and with or without an NT* fusion protein (Kronqvist et al., 2017[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-bib-0022]) containing an enterokinase cleavage site for removal. Typically, we express and purify 4-6 mg of NS1-2 per 50 ml of cell culture.\nAdditional Materials (also see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-prot-0001])\nTrichoplusia ni (T. ni) insect cells (Expression Systems, cat. no. 94-002F)\nESF921 insect cell medium (Expression Systems, cat. no. 96-001-01)\n0.1% trypan blue in PBS, pH 6.2 (see recipe)\nTitred NS1-2 expressing recombinant baculovirus (Irons et al., 2018[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-bib-0018])\n250-ml Schott bottle\nInnova 42R incubator shaker, 1.9 cm orbit (New Brunswick Scientific)\nHemocytometer\n50-ml polypropylene tube\n1. Seed T. ni cells into 50-ml ESF921 medium at a final concentration of 8 × 105 cells/ml in a 250-ml Schott bottle.\nOther types of cell culture vessel can be used. Schott bottles are an easily reusable vessel that provides excellent cell viability and can be scaled down to smaller bottles at a culture volume of 20% of the bottle volume.\n2. Incubate at 27°C overnight with orbital shaking at 125 rpm.\n3. Check the cell count and viability of the cells by mixing 10 µl cell suspension with 10 µl 0.1% trypan blue and loading onto a hemocytometer.\nWe recommend a cell density of 1 × 106 cells/ml or greater and a cell viability of >98%.\n4. Infect the 50 ml cell suspension culture by pipetting the recombinant baculovirus containing the norovirus NS1-2 gene directly into the cell suspension at a multiplicity of infection (MOI) of 1.0.\nViral titre can be generated by plaque assay or dilution series.",
    "5. Incubate the infected culture at 27°C for 2-4 days.\nMonitor the culture each day and harvest at 50%-80% cell viability as determined by trypan blue staining. Optimization of MOI and harvest time may be required for some proteins.\n6. Collect the cells from the infected culture by centrifugation for 5 min at 500 × g, room temperature.\nThe cell pellets can be stored at −80°C for extended periods (years) prior to protein purification.",
    "This protocol is to facilitate isotopic labelling of recombinant NS1-2 protein. The analysis of proteins by NMR or metabolomic mass spectrometry is benefited from the use of isotopic labels for the protein of interest. Isotopic labelling is well-established for E. coli but less so for the BEVS. This protocol is based upon the method of Sitarska et al. (Sitarska et al., 2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-bib-0034]) for Spodoptera frugiperda cells and has been adapted to T. ni cells for labelling with either 15N or 15N/13C. On average, 73% of 14N is replaced with 15N for the NS1-2 protein of human GII.4 norovirus after isotope labelling.\nAdditional Materials (also see Basic Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-prot-0006])\nBasal ΔESF921 (all amino acid deficient modified medium, Expression Systems, cat. no. 96-276-01)\n15N-ISOGRO medium (see recipe)\n1. Make 15N-ISOGRO medium (see Reagents and Solutions) and filter into a 250-ml Schott bottle and store at 4°C.\n15N-NH4Cl is included as a nitrogen source, unlabelled D-glucose is included as a carbon source.\nAddition of L-cycloserine inhibits unlabelled-alanine synthesized from the unlabelled-glucose source thus maximizing the incorporation of labelled-alanine from the algal extract. Addition of L-cycloserine is preferential during 13C incorporation but is included in the 15N-labelling protocol.\n2. Seed a 50 ml T. ni culture as in Basic Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-prot-0006] in ESF921 medium.\nNote that the starting point is to use normal ESF921 medium (or equivalent) to grow the cells.\n3. Incubate at 27°C for 24 hr shaking at 125 rpm.\n4. Infect the 50 ml culture with the recombinant baculovirus at an MOI of 2.0 and incubate at 27°C for 16 hr.\n5. Check the cell count and viability by hemocytometer as described in Basic Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-prot-0006], step 3.",
    "Make sure the cell viability remains above 80% before proceeding. It may be necessary to adjust the MOI for different proteins / recombinant baculoviruses.\n6. Collect the infected cells by centrifugation for 5 min at 500 × g, room temperature.\n7. Remove the supernatant and wash the cells by gently resuspending the cell pellet in 10 ml of basal ΔESF921 medium and recollecting the cells by centrifugation for 5 min 500 × g, room temperature.\n8. Remove the basal ΔESF921 medium and gently resuspend the cell pellet in 10 ml 15N-ISOGRO medium.\n9. Add the resuspended cells to 40 ml 15N-ISOGRO medium in a 250-ml Schott bottle.\nIt is recommended to check the cells again for viability at this stage, proceed if the viability remains above 80%.\n10. Incubate the infected culture in 15N-ISOGRO medium at 27°C at 125 rpm and monitor daily until the cell viability drops below 80%, as described in Basic Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-prot-0006].\n11. Harvest the infected cell pellet by centrifugation as described in Basic Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-prot-0006] and store at −80°C.",
    "This protocol describes a small-scale batch purification of the norovirus NS1-2 protein from a 50 ml T. ni suspension culture as described in Basic Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-prot-0005]. While many laboratories will have chromatographic purification systems and these are often the methods of choice, the use of small-scale batch purifications using epitope affinity tags can be used effectively for the extraction of the NS1-2 protein from insect cells.\nAdditional Materials (also see Basic Protocols above)\nNS1-2 purification buffers (see recipe)\ncOmplete, EDTA-free protease inhibitor cocktail (Merck, cat. no. 11873580001)\nRNAse (see recipe)\nDNAse I\n20-G needle and 5-ml disposable syringe\n0.8-micron filter\nStrep-Tactin XT 4Flow high-capacity resin (IBA Lifesciences, cat.no. 2-5030-002)\nGravity flow purification column (Pierce)\nAdditional reagents and equipment for SDS-PAGE and western blot analysis (Ni et al., 2006)\n1. Thaw and resuspend a 50 ml T. ni cell pellet from Basic Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-prot-0006] in lysis buffer containing 1× protease inhibitor at ∼5 × 106–1 × 107 cells/ml.\nFor some recombinant proteins, such as proteases, the protease inhibitor is omitted.\n2. Add RNase and DNase I at a final concentration of 10 µg/ml each and incubate on ice for 10 min.\n3. Shear the sample by passing it through a 20-G needle five times.\n4. Centrifuge the lysate 20 min at 14,000 × g, 4°C.\n5. Collect the supernatant and filter through a 0.8-micron filter.\n6. Add Strep-Tactin resin (0.5 ml per 20 ml) to the clarified supernatant and incubate for 1 hr at 4°C, ensuring the resin remains in suspension.\n7. Load the lysate plus Strep-Tactin onto a gravity flow purification column at room temperature to collect the resin.\n8. Wash the resin with 20 ml wash buffer I, followed by 20 ml wash buffer II.\n9. Add 0.5 ml of elution buffer and collect the eluant.",
    "10. Repeat the elution seven times to collect eight 0.5 ml elution fractions.\nThe eluted protein can be stored at −80°C but avoid repeated freeze-thaw cycles.\n11. Analyze the fractions by SDS-PAGE and western blot analysis to confirm expression and purification.\nA polishing step of size exclusion chromatography can be used if higher purity is desired.",
    "The baculovirus, Autographa californica nucleopolyhedrovirus, is unable to replicate in mammalian cells but can transduce a wide variety of cell types. Commercial vectors for the use of baculovirus in mammalian cell transduction are available. This protocol is to use a recombinant baculovirus expressing the GII.4 NS1-2 protein under the control of a constitutive CMV mammalian cell promoter to express the NS1-2 protein in HEK293T cells, thereby facilitating the analysis of this protein in a mammalian cell.\nAdditional Materials (also see Basic Protocols 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-prot-0001] and 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-prot-0006])\nHEK293T mammalian cells (ATCC, cat. no. CRL-3216)\nDulbecco's A (Ca-free) PBS, pH 7.4 (see recipe)\nRecombinant baculovirus stock\nSodium butyrate (see recipe)\n25-cm2 tissue culture flask\n1. Seed a 25-cm2 flask with 3 × 106 HEK293T cells in 5 ml DMEM-GlutaMAX-10 and incubate overnight at 37°C, 5% CO2.\n2. Remove medium and wash the cell monolayer with 2 ml of Dulbecco's A (Ca-free) PBS, pH 7.4.\n3. Dilute recombinant baculovirus inoculum by adding 600 µl virus to 2.4 ml of Dulbecco's A PBS pH 7.4 (1:4 ratio) to dilute the insect cell medium.\nThe baculovirus titre should be typically 108 pfu/ml or higher. The baculovirus can be concentrated by centrifugation to generate a high titre stock if desired. The above method describes an alternative to centrifugation, which involves diluting the insect cell culture medium, which can reduce transduction efficiency (Hsu et al., 2004[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-bib-0016]). Typically, a 1:4 dilution in PBS is sufficient for direct use on mammalian cells without a loss in transduction efficiency.\nFreshly prepared baculovirus stock is recommended for this protocol. See Irons et al. (2018[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-bib-0018]).\n4. Add 3 ml of the diluted inoculum to the HEK293T cells.\n5. Incubate at room temperature for 8 hr to allow the baculovirus to transduce the cells.",
    "6. Remove the inoculum and wash the cells once with 2 ml Dulbecco's A PBS pH 7.4.\n7. Add fresh DMEM-GlutaMAX-10 containing 5 mM sodium butyrate to the cells and incubate at 37°C for 48 hr.\nSodium butyrate has been shown to enhance expression from the baculovirus system in mammalian cells (Condreay et al., 1999[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-bib-0003]; Fung et al., 2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-bib-0011]).\n8. Wash the cells with 5 ml of Dulbecco's A PBS then detach into 5 ml of fresh Dulbecco's A PBS using a cell scraper.\n9. Collect the cells by centrifugation for 5 min at 300 × g, room temperature, remove the Dulbecco's A PBS and use immediately or store the pellet at −80°C.",
    "This procedure describes the process of infecting mouse small intestinal enteroids with MNV. This protocol offers an ex vivo infection system to interrogate MNV infection in primary epithelial cells, without any immune, stromal, or mesenchymal cellular contributors. Intestinal tuft cells are the exclusive epithelial cell type which expresses the MNV receptor CD300lf. However, CD300lf is expressed apically on tuft cells, while enteroids grown in 3D culture grow with their apical surface facing inward. When enteroids are polarized on a transwell filter, their apical surface becomes exposed to enable viral entry (Strine et al., 2022[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-bib-0036]). Tuft cells can be robustly infected by both MNVCW3 and MNVCR6 in enteroids in vitro (Strine et al., 2022[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-bib-0036]).\nAdditional Materials (also see Basic Protocols 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-prot-0001] and 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-prot-0005])\nMatrigel (Corning basement membrane matrix, cat. no. 354234 or 356231), thawed on ice and aliquoted in small volumes and stored at −20°C\n1× PBS, pH 7.2 (Gibco, cat. no. 20012027)\nDMEM-10 (see recipe)\n50% L-WRN conditioned medium (see Support Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-prot-0011], step 9 or 10)\nY27632 dihydrochloride (ROCK inhibitor) (Tocris, cat. no. 1254)\nIntestiCult organoid growth medium (Mouse, STEMCELL Technologies, cat. no. 06005)\nRecombinant murine IL-4 (Peprotech, cat. no. 214-14)\nTranswell inserts (Costar, 6.5 mm insert, 0.4 μm pore polyester membrane, cat. no. 3470)\n24-well clear TC-treated plates (Corning, cat. no. 3524)\n37°C water bath\nPre-coat the Transwell inserts\n1. Place one Transwell insert per one well of a 24-well plate.\n2. Add 100 μl of 10% Matrigel solution in sterile 1× PBS to each Transwell insert.",
    "Collagen IV (Sigma, cat. no. C5533, 1 mg/ml stock solution) can also be used as a coating reagent at a final concentration of 33 μg/ml diluted in sterile 1× PBS. Incubate at 37°C for at least 90 min or overnight at 37°C. Cultrex RDF basement membrane extract type 2 (R&D system, cat. no. 3533-005-02) is another alternative and can be used at the same concentration as Matrigel.\n3. Incubate at 37°C for at least 20 min.\nDissociate the 3D enteroid cultures\n4. Dissociate 3D enteroids gently in Matrigel bubbles (see Support Protocol 7[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-prot-0013], steps 1-6).\nPlan to use 2-3 wells of enteroids per each Transwell insert in a 24-well plate format. Usually, mouse enteroids are ready to be used around ∼5 days of growth.\n5. Manually disrupt the enteroids by pipetting up and down to produce a single-cell suspension.\nGenerating a single-cell suspension is critical for growth and differentiation on the Transwell insert. Gentle pipetting ∼100 times without generating bubbles may be necessary.\n6. Neutralize the dissociation reaction with ∼10 ml DMEM-10.\n7. Pellet the cells by centrifuging 5 min at 500 × g, 4°C, and aspirate the supernatant without disturbing the pellet.\n8. Resuspend the cells in 50% L-WRN conditioned medium supplemented with 10 mM Y27632 (see Support Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-prot-0011], step 9 or 10).\nResuspension volume will depend on how many Transwell inserts will be seeded. Each insert will require 100 μl of cells. Counting the cells at this stage is not necessary but be sure to use 2-3 densely grown wells per/100 μl to ensure proper monolayer formation.\nPlate the single-cell suspension on the Transwell inserts\n9. Aspirate Matrigel/PBS solution from the pre-incubated Transwell inserts.",
    "10. Add 100 μl resuspended cells into the upper (top) Transwell chamber and add 600 μl 50% L-WRN conditioned medium with 10 mM Y27362 to the lower compartment beneath the insert.\n11. The next day, replace the medium in the upper and lower compartments with fresh mouse IntestiCult organoid growth medium supplemented with 50 ng/ml rIL-4.\nUse 100 μl for the upper compartment and 600 μl for the lower compartment. This step is essential to achieve tuft cell differentiation and subsequent MNV infection. Tuft cell differentiation is supported by supplementation with recombinant murine IL-4 at 50 ng/ml in the differentiation medium added to the apical and lower chambers.\nDifferentiating the enteroids on the Transwell inserts\n12. Replace the medium every 1-2 days.\nDense monolayers may result in medium becoming yellow/orange but be sure to change the medium consistently every 1-2 days even if the medium is not yellow/orange yet. Monolayer establishment can also be tracked using an epithelium volt/ohmmeter by measuring transepithelial electrical resistance (TEER) (Moon et al., 2014[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-bib-0028]).\n13. Maintain the culture for 14 days before infection.\nCulturing for <14 days is not sufficient for effective tuft cell differentiation or MNV infection.\nInfect the enteroids with MNV\n14. On day 14, infect the enteroids apically (i.e., adding virus to the upper chamber) by adding 100 μl L-WRN conditioned medium containing MNVCR6 or MNVCW3 at the desired multiplicity of infection (MOI).\nEach Transwell insert will contain 106 cells/ml at this stage, and MOI can be estimated using this value.\n15. Incubate the virus on the enteroids for 1 hr at 37°C to facilitate viral binding.\n16. After 1 hr, wash off any unbound virus using 100 μl pre-warmed 1× PBS in the apical chamber.",
    "Three washes of 100 μl may be necessary to remove unbound virus, as it may stick to the plastic of the Transwell inserts. Washing the basolateral chamber is not necessary. If infections proceed for >1 day, do not change the medium during this time.\n17. After three washes, add fresh L-WRN conditioned medium to the apical chamber.\n18. Harvest the virus by collecting supernatant from the upper chamber of the Transwell insert at desired timepoints.\nSamples can also be harvested from the lower chamber if desired, but maximal viral shedding will be detected from the apical supernatant. Cells can also be collected for qPCR or other analyses via trypsin or TRIzol treatment.",
    "Additional Materials (also see Basic Protocols above)\nL-WRN cells (available from ATCC, CRL-3276)\nL-cell medium (see recipe)\n0.05% Trypsin-EDTA (Gibco, cat. no. 25300054)\nG418 (Gibco, cat. no. 10131035)\nHygromycin (InvivoGen, cat. no. ant-hg-5)\nPrimary culture medium (see recipe)\n150-cm2 tissue culture treated vented flasks (e.g., Corning)\n0.22-micron filter system (Millipore Stericup)\n50-ml conical centrifuge tube (e.g., Falcon)\nNOTE: This protocol is for small scale preparation and has been adapted from (Miyoshi & Stappenbeck, 2013[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-bib-0027]).\n1. Grow L-WRN cells in L-cell medium (see recipe) at 37°C in a 150-cm2 flask.\n2. When confluent, trypsinize the cells using 0.05% Trypsin-EDTA and incubate at 37°C until they detach (∼1-2 min).\n3. Once detached, neutralize with L-cell medium and re-plate them at ∼1–2 × 106/flask in 150-cm2 flasks containing 500 μg/ml G418 and 2 mM hygromycin in L-cell medium. Incubate at 37°C.\nFor a small-scale preparation, make ten 150-cm2 flasks from 1 confluent 150-cm2 flask (e.g., split 1:10).\n4. When cells are overly confluent (∼2-3 days), wash the flasks twice with 20 ml 1× PBS and once with 10 ml primary culture medium (see recipe).\nBe sure to use primary culture medium here and not the L-cell medium used in step 1.\n5. Add 25 ml fresh primary culture medium to each flask and incubate at 37°C.\n6. Every 24 hr, collect the culture medium (“L-WRN conditioned medium”). Store these fractions at 4°C.\nIn total, change and collect conditioned medium 4 times.\n7. Pool all the L-WRN conditioned medium fractions and clarify them by centrifugation for 5 min at 500 × g, 4°C. Collect the medium, leaving the pelleted cellular debris behind.\n8. Filter the L-WRN conditioned medium through a 0.22-micron filter.\n9. Dilute the L-WRN conditioned medium with an equal volume of fresh primary culture medium, generating 50% L-WRN conditioned medium.",
    "10. Aliquot the 50% L-WRN conditioned medium stocks in 50-ml falcon tubes and store at −80°C until further use.\nMedium can be thawed in a water bath at 37°C before use. If thawed, aliquots should be used within ∼2 weeks and stored at 4°C.",
    "Additional Materials (also see Basic Protocols above and Support Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-prot-0011])\nMouse of desired genotype\nCrypt culture medium (see recipe)\nCollagenase type I (Invitrogen, cat. no. 17100-017)\nGentamicin (Sigma, cat. no. G1397)\nSurgical scissors\nForceps\nWide bore syringe\n40-micron cell strainer (e.g., Fisher)\n1. Sacrifice the mouse according to the Institutional Animal Care and Use Committee protocol. Using surgical scissors and forceps, cut open the mouse abdominal cavity and harvest the distal small intestine (∼10 cm), gently clearing it of fat and connective tissue (Fig. 6[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-fig-0006]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/5be4593f-2298-4254-b10a-6cced6578361/cpz1828-fig-0006-m.jpg</p>\nFigure 6\nDissection process for crypt isolation. (A) The whole gastrointestinal tract was removed from the animal and displayed to identify the distal ileum. (B) The ileum was cleaned by removing its contents, and the part to be used for crypt isolation was identified (see solid lines with scissors).\n2. Using a wide bore blunt syringe or P1000 pipet tip, flush the tissue with cold 1× PBS to remove any contents.\n3. Cut the tissue longitudinally and vortex 15 s in cold 1× PBS.\n4. Mince the tissue and transfer it in a 15-ml conical tube in 1-2 ml crypt culture medium (see recipe) supplemented with 2 mg/ml collagenase type I and 50 μM gentamicin. Incubate at 37°C for 30 min.\nTissue pieces should be small enough to freely pipet using a wide bore P1000 tip. Pipetting up and down every ∼10 min can help with crypt dissociation. In subsequent steps, do not supplement the crypt culture medium with collagenase or gentamicin.\n5. After 30 min, filter the isolated crypts through a 40-micron cell strainer into a 50-ml conical tube. Add 10 ml crypt culture medium and centrifuge 5 min at 500 × g, 4°C.",
    "6. Aspirate the supernatant without disturbing the pellet and add another 10 ml crypt culture medium. Gently resuspend the pellet, transfer to a 15-ml conical tube, and centrifuge 5 min at 500 × g, 4°C.\nThis second wash step is critical to minimize contamination with mesenchymal cells.\n7. Aspirate the supernatant and resuspend the purified crypts in one drop of 30 μl of Matrigel per well of a 24-well tissue plate.\nA good isolation of crypts in steps 4-5 from 10 cm of small intestine should yield ∼6 Matrigel bubbles worth of purified crypts. Poor isolation will be evidenced by a very small pellet in steps 6-7. Continued trouble after this stage (e.g., crypts are too sparse and do not grow well) can be overcome by tweaking collagenase treatment time to improve crypt release and viability.\n8. Invert the plate and incubate it ∼10 min at 37°C to polymerize the Matrigel.\n9. Once the Matrigel is solidified, return the plate to its correct orientation, and add 600 μl 50% L-WRN conditioned medium with 10 mM Y27632 per well of a 24-well plate.",
    "Additional Materials (also see Basic Protocols above)\nPBS-EDTA (see recipe)\n0.05% trypsin-EDTA (Gibco, cat. no. 25300054)\n1. Aspirate the culture medium from each well.\n2. Dissociate 3D enteroids gently in Matrigel bubbles by adding 500 μl PBS-EDTA to each well of the 24-well plate containing Matrigel enteroid bubbles.\n3. Manually scratch and triturate the enteroid bubbles gently by pipetting up and down ∼5 times.\nA single cell suspension is not critical at this stage and pipetting too much at this step may result in cell death and lower viability.\n4. Pool the enteroids and transfer them to a single 15-ml conical tube and centrifuge for 5 min at 500 × g, 4°C.\n5. Aspirate the PBS-EDTA without disturbing the pellet and add 200 μl of pre-warmed (37°C) 0.05% Trypsin-EDTA per 8 dissociated bubbles (e.g., from 8 wells with 30 μl enteroids in one Matrigel bubble in each one).\nThe amount of trypsin will depend on the number of bubbles. Usually, 200 μl trypsin is enough to trypsinize 8 bubbles. The pellet may be loose after centrifugation.\n6. Incubate the cells in a 37°C water bath for 90 s.\n7. Manually dissociate the enteroids by gently pipetting up and down.\n10-15 times is typically sufficient for the mouse distal small intestine.\n8. Neutralize the dissociation reaction with 10 ml DMEM-10.\n9. Pellet the cells by centrifuging 5 min at 500 × g, 4°C, and aspirate the supernatant without disturbing the pellet.\n10. Resuspend the cells in one drop of 30 μl Matrigel per well of a 24-well plate and grown in 50% L-WRN conditioned medium.\nMatrigel exists in a viscous liquid form at 4°C and is solid at 37°C. Matrigel should be placed on ice before use in plating enteroids.",
    "Repeat steps 1-10 any time the enteroids need to be passaged. When the enteroids within the growth medium grow too large, they will eventually become clouded with intracellular debris and die. Enteroids processed from the mouse distal small intestine typically require a passage every 3-5 days.",
    "This procedure outlines the quantification of MNV-induced diarrhea using the neonatal mouse model. We describe the inoculation methodology and disease scoring system. This protocol can be used with neonatal mice 3-6 days post birth (P2-P5) with no significant difference in intestinal disease outcomes, but diarrhea severity is reduced in mice infected at P7 or later (Peiper et al., 2023[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-bib-0032]). The oral gavage method has been validated using BALB/c mice (Roth et al., 2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-bib-0033]) while the intragastric inoculation method has been validated in both BALB/c (Roth et al., 2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-bib-0033]) and C57BL/6J neonatal mice (Peiper et al., 2023[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-bib-0032]). Both inoculation methods can deliver up to 40 µl of volume to the pups. Disease outcomes can be observed 24-72 hr post-infection (hpi). Depending on the application, infection doses of 107 to 108 are useful. Fecal scoring can be performed at multiple time points using the same neonatal mouse, but the mice do not defecate at every timepoint, representing a limitation of this readout. Colon content scores can be used to overcome this limitation, although the mouse must be euthanized to acquire a colon content score (Helm et al., 2022[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-bib-0015]). This model is useful for a wide range of applications including disease kinetics of MNV strains (Peiper et al., 2023[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-bib-0032]; Roth et al., 2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-bib-0033]), identification of virulence determinants and host determinants of protection (Helm et al., 2022[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-bib-0015]), and efficacy of small molecules and therapeutics.\nAdditional Materials (also see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-prot-0001] and 6[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-prot-0010])\nP0-P5 neonatal mice (BALB/c or C57BL/6J)\n1.5-2 ml Eppendorf tubes\n22-G × 25-mm plastic feeding tubes (Instech, cat. no. FTP-22-25-50)\n1-ml insulin syringes (Fisher Scientific, cat. no. 14955462)\nOral gavage inoculation of neonatal mice",
    "It is recommended that only BALB/c pups are used with this method since the relatively small size of C57BL/6J mice make them vulnerable to gavage-induced trauma. In our experience, ∼20% of C57BL/6J pups inoculated at P3-P5 succumb to oral gavage independent of infection, a confounding variable not observed in BALB/c pups.\n1. Make the desired virus inoculum in Eppendorf tubes in a volume of 10-40 µl per mouse. Additional volume should be made for loss of inoculum in the tip of the syringe.\nA MNV stock of 107 to 108 TCID50 units/mouse is recommended.\n2. Attach 22-G plastic feeding tube to the end of syringe and remove any air bubbles. The same tube can be used between each mouse as long as the tube filter remains clear.\n3. Insert feeding tube into the mouth of each pup and thread down to the esophagus. Make sure to insert slowly to avoid punctures in the esophagus.\n4. Deliver up to 40 µl to each mouse.\n5. Carefully withdraw the tube.\n6. Observe the mouse for 5 min to monitor for any signs of distress before returning it to the cage. If signs of distress such as difficulty breathing or lethargy are observed, euthanize the mouse per IACUC protocol.\nScoring intestinal disease in fecal samples\n7. At desired time points, palpate the abdomen of each mouse to induce defecation.\n8. Assess feces based on color and consistency according to a 6-point scale (Fig. 7[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-fig-0007]): 0, no defecation; 1, firm, orange, does not smear; 2, pasty, orange, or mixed color, does not smear; 3, orange or yellow, semi-liquid and smears; 4, yellow, liquid, and smears; 5, clear, liquid, and smears.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/de282565-1708-45f9-8eb3-7b4a0a6608dd/cpz1828-fig-0007-m.jpg</p>\nFigure 7",
    "Scoring scale for fecal samples. Color and consistency are scored on a 6-point scale with 0, no defecation or solid; 1, firm, orange, does not smear; 2, pasty, orange, or mixed color, does not smear; 3, orange or yellow, semi-liquid and smears; 4, yellow, liquid, and smears; 5, clear, liquid, and smears. (Fig. reproduced from Roth et al., 2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-bib-0033]).\n9. Disease severity is reported as the average fecal score per condition, excluding any scores of 0. Disease incidence is reported at the percentage of mice per condition with a fecal score of 3 or higher. For statistical purposes and to control for inter-litter heterogeneity, at least 10 neonates from 3 separate litters should be used per condition tested.",
    "Additional Materials (also see Basic Protocol 7[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-prot-0014])\n30-G (0.3-mm × 25-mm) needles (BD, cat. no. 305128)\nNOTE: This method can be used in BALB/c and C57BL/6J mice up to P7. After P7, the milk spot disappears and intragastric delivery is no longer possible.\n1. Make desired inoculum in Eppendorf tubes in a volume of 10-40 µl per mouse. Additional volume should be made for loss of inoculum in the tip of the syringe.\n2. Attach 30-G needle to the end of syringe and remove any air bubbles. The same needle can be used between each mouse if no blood is present on the tip of the needle.\n3. Restrain the neonatal mouse so the milk spot becomes clear and close to the surface. The milk spot in the stomach is visible through the skin on the abdominal wall. It should appear in the upper right quadrant of the abdomen. It is recommended to do inoculations when the milk spot is clearly visible to ensure accurate injections (Fig. 8[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-fig-0008]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/d3845ab7-e48a-4013-8f75-78f11b6c6170/cpz1828-fig-0008-m.jpg</p>\nFigure 8\nIntragastric inoculation of neonatal mice. (A) Restrain neonatal mouse so milk spot becomes visible on abdominal surface in right upper quadrant. (B) Insert needle parallel to stomach so that the needle enters stomach lengthwise.\n4. Insert the needle parallel to the stomach so that the needle pierces the stomach lengthwise. If the needle is inserted properly, the stomach wall will indent and then bounce back when the stomach is pierced (Fig. 8[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-fig-0008]).\n5. Deliver up to 40 µl to each mouse.\n6. Carefully withdraw the needle. Minimal flowback is expected.\n7. Observe the neonate for 5 min to monitor for any signs of distress before returning it to the cage. If signs of distress are observed, euthanize the mouse per IACUC protocol.",
    "1. At the desired timepoint, euthanize the mouse according to the guidelines of the home institution and IACUC protocol.\n2. Briefly dip the mouse carcass into 70% ethanol. Using forceps and scissors, cut both the skin and peritoneum longitudinally along the midline of the abdomen being careful not to cut the intestines.\n3. Locate the junction of the anus and colon and cut the colon as close to the anus as possible.\n4. Carefully remove the colon without tearing it until you locate the cecum and then cut at the cecum.\n5. Using the scissors in a closed position, squeeze out the contents of the colon by running the closed scissors across the colon.\n6. Score the contents according to the scale in Figure 7[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-fig-0007].\nCalculations for disease severity and incidence are calculated in the same manner as fecal scoring (see Basic Protocol 7[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.828#cpz1828-prot-0014]). For statistical purposes and to control for inter-litter heterogeneity, at least 10 neonates from 3 separate litters should be used per condition tested."
  ],
  "subjectAreas": [
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}