{
  "id": 10624,
  "origin_website": "Jove",
  "title": "Using Extraordinary Optical Transmission to Quantify Cardiac Biomarkers in Human Serum",
  "procedures": [
    "1. Fabrication of the Sensor and Acquisition of the Data\nPreparation of the nickel mold\nCoat a 220 nm-thick layer of negative electron beam resist onto a 600 µm-thick 4-in silicon wafer. Write the designed nanohole array on this wafer using an electron beam lithography system.\n\t\t\nTo accelerate the e-beam writing, write the patterns with a low dotmap (N) of 20k for each 300 µm field size (A) (i.e., there are 0.4 billion dots mapped on each 300 µm2 area, and each dot will either be exposed by the e-beam or not, depending on the pattern design). Set the e-beam resist exposure dose for the resist to 110 µC cm−2 and write at a current (I) of 800 pA.\n\t\t\tNOTE: In e-beam writing, the exposure dose (D) is controlled by the exposure time for each dot (Tdot), calculated by imgsrc://cloudfront.jove.com/files/ftp_upload/55597/55597eq1.jpg. For the exposure dose at 110 µC cm−2, the e-beam dwelling time on each exposed dot is 0.5 µs12. Since the array captures an area of 1.8 mm2, there are a total of 36 patches of 300-µm2 field areas stitched together to form one large, gold nanohole array.\nDevelop the resist by immersing the 4 inch silicon wafer in the developer solution for 10 s and letting the wafer dry in air.\nDeposit a seed layer of a metal, such as nickel, copper, or aluminum, on the silicon wafer.",
    "Electroplate the wafer in a plating system in a nickel sulfamate bath. Carry out the electroplating in two steps. In the first step, lasting 95 min, use a current density of 0.7 A dm−2; this completely fills the nanopatterns with nickel. In the second step, lasting 125 min, use 12 A dm−2 to reach 300 µm as the final nickel mold thickness (20 nm). Ensure that the pH value is at 3.5 - 3.8 and that the temperature is at 52 - 54 °C.\nSeparate the nickel mold from the silicon substrate by applying gentle mechanical force. Soak the nickel mold in about 100 mL of positive photoresist removal reagent overnight to wash away the residue from the e-beam resist.\nFeed the nickel mold into an oven and dry it at 100 °C for 3 h. Clean it in a plasma etching system with O2 gas at 10 sccm and 100 W for 3 min.\nFabrication of the gold nanostructure\nCoat 150 µL of heptadecafluoro-1,1,2,2-tetrahydrodecyl trichlorosilane (FDTS) on the nickel mold in a self-assembly monolayer (SAM) coating machine at 80 °C.\n\t\tNOTE: This will form an anti-adhesive layer, which will enable the separation of the mold from the photoresist (\"demolding\") after the completion of the nanoimprinting step. The vaporizing time should be 180 s, and the reaction time should be 900 s.\nImprint the nanopatterns on a 4-in glass wafer that has been coated with a 300 nm-thick layer of photo-curable NIL resist using a nano-imprinter at a pressure of 10 bar and a temperature of 40 °C for 10 min.\nTransfer the mold, the photoresist, and the glass wafer to a UV light curing system and photocure with 75 mW cm-2 of UV exposure for 30 s.",
    "NOTE: If all steps have been followed correctly, the nickel mold should easily be demolded from the photoresist.\nIn a reactive ion etching (RIE) system, perform a blank etch of the photoresist on the glass substrate, with an O2 gas flow of 10 sccm, at 50 W for 2 s to expose the glass on the indented areas.\nDeposit a 5 nm-thick layer of chromium (Cr) for metal adhesion and a 100-nm layer of gold (Au) for the plasmonic sensor on the glass wafer in an electron-beam deposition machine. Use a deposition rate of 1 Å s−1 for Cr and 2 Å s−1 for Au.\nPerform lift-off of the photoresist by O2 plasma etching for 3 min followed by a 15-s sonification step in acetone.\nDice the sample into 5 mm × 5 mm chips. The nanohole array will occupy the central 2 mm × 2 mm of the chip.\nAcquisition of the data\nSet up the apparatus to make the optical measurements such that a beam of white light exiting through the end of the transmitter optical fiber is collimated and is incident on the sensor surface (nanohole array) at 90°.\n\t\tNOTE: Light is transmitted through the whole nanohole array.\nCollect the transmitted signal with the receiver optical fiber and record it with a UV-visible spectrometer operating within the range of 300 to 1,000 nm.\nSet the acquisition time for each frame to 20 ms. Average 100 frames to obtain the final spectrum to lower the noise in the measurements.\nUse plotting software to analyze the data based on the previously identified transmission peaks (using a Lorentz-based method).\n2. Sensor Bulk Sensitivity Test\nDeposit the standard RI liquid into the liquid cell, with the RI varying from 1.31 to 1.39.",
    "Immerse the sensor chip in the standard RI liquid and align it with the beam of white light. Obtain the transmission spectrum.\nClean the sensor chip after each measurement with a surface-active cleaning reagent and dry it with nitrogen gas.\n3. Sensor Surface Modification\nPrior to any chemical modifications, clean the sensor chips by sequential immersion in isopropanol, acetone, and deionized water. Dry at room temperature in a stream of dry nitrogen gas.\nIncubate the sensor chips in an ethanolic solution of 0.4 mM 10-carboxy-1-decanethiol and 1.6 mM 1-octanethiol for 12 h at room temperature.\n\tNOTE: This will form an amine-reactive self-assembly monolayer (SAM).\nUse ethanol to rinse thoroughly and dry at room temperature.\nMake a mixture of 75 mM sulfo-N-hydroxysuccinimide (sulfo-NHS) and 15 mM 1-ethyl-3-(3-dimethylaminopropyl) carbodiimide (EDC). Immerse the chips in this mixture for 15 min.\n\tNOTE: This will activate the carboxylic group of the SAM.\nSpot 50 µL of 200 µg/mL anti-troponin antibody solution made in a pH 4.5 acetate buffer on the sensor surface and incubate for 30 min.\nDeactivate the unreacted esters by immersing the sensor chip in 1 M ethanolamine-HCl solution for 15 min.\nRinse the chip with deionized water and dry it in a stream of dry nitrogen gas at room temperature.\n4. cTnI Assay\nBlock any non-specific binding by spotting 100 µL of 1% bovine serum albumin (BSA) solution onto the surface. Incubate for 15 min.\nRinse the sensor chips three times in phosphate-buffered saline (PBS) solution. Insert the chip into the measurement cell to record the transmission spectrum.\n\tNOTE: This is the reference spectrum.\nSpot 50 µL of cTnI standard onto the chip surface and incubate in a moist environment for 30 min.",
    "Rinse the sensor chips three times in PBS solution and insert it into the measurement cell to record the transmission spectrum.\n\tNOTE: This is the after-binding spectrum.\nSubmerge the chips in 50 mM glycine-HCl (pH 2) for 1 min and then rinse in PBS solution three times to regenerate the chip surface. Measure the transmission spectrum in PBS to verify the success of the regeneration step.\n5. Surface Plasmon Resonance (SPR) Measurement\nRun the multiplexed SPR sensor chip on the SPR system with PBS-T buffer.\n\tNOTE: The composition of PBS-T buffer is 20 mM Na-phosphate, 150 mM NaCl, and 0.05% Tween 20. The pH is 7.4.\nUse cTnI standard and the antibody, as described in step 4.\nActivate 3 out of the 6 available channels with a mixture of EDC (0.2 M) and sulfo-NHS (0.05 M) for 5 min. Perform a 5 min injection of 50 µg/mL antibody 560 and a 5-min injection of 1 M ethanolamine-HCl solution.\nRotate the sensor chip by 90° and inject the cTnI standards at different concentrations (75, 30, 7.5, and 2.5 ng/mL).\nObserve the conjugation to the antibody at spots of interaction on the chip in real time through the SPR readout.\nRegenerate the chip by injecting 50 mM glycine-HCl (pH 2) for 1 min.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}