{
  "id": 4493,
  "origin_website": "Bio",
  "title": "Detection of Hog1 Phosphorylation in <em>Candida albicans</em> in Response to an Antifungal Protein",
  "procedures": [
    "Treatment of cellsPlate C. albicans wild-type and hog1Δ strains onto YPD agar and grow overnight at 30 °C.Take scraping of both C. albicans strains from agar and inoculate 5 ml YPD in a 50 ml tube. Incubate tube overnight at 30 °C (250 rpm).Dilute both cultures to an OD600 of 0.2 (in 100 ml ½ PDB) and transfer 100 ml to a 500 ml baffled flask. Incubate cells at 30 °C (250 rpm) for 5 h (or until they reach an OD600 of 1.0).Dilute cells to an OD600 of 1.0. Transfer 10 ml aliquots of each culture to 50 ml tubes. One tube will be required per treatment (see Table 1 for treatment conditions).Treat 10 ml aliquots of WT and hog1Δ with NaCl or protein of interest (e.g. 10 μM and 20 μM NaD1 in ultrapure water). Cells will be incubated for 5, 10 or 15 min at 30 °C (250 rpm). For NaCl treatment, add 2.5 ml of 5 M NaCl to the 10 ml of WT or hog1Δ.  For protein treatments, add volume to reach desired protein concentration (e.g. volume of protein for a final concentration of 10 μM or 20 μM). For the hog1∆ control treatments, only the 20 µM treatment concentration is required. If no total Hog1 or phosphorylated Hog1 is detected in the hog1∆ cells treated with 20 µM protein, then none will be detectable at a lower protein concentration.Table 1. Treatment conditions. Treatment conditions of C. albicans WT and hog1∆ cells with the protein of interest. 1 M NaCl is included as a positive control. No-protein and hog1∆ treatments are included as negative controls.table:\n﻿0,1,2\nC. albicans strain,Protein or NaCl concentration,Incubation time\nWT,No treatment,-\nWT,1 M NaCl,10 min\nWT,10 μM protein,5 min\nWT,10 μM protein,10 min\nWT,10 μM protein,15 min\nWT,20 μM protein,5 min",
    "WT,20 μM protein,10 min\nWT,20 μM protein,15 min\nhog1Δ,No treatment,-\nhog1Δ,1 M NaCl,10 min\nhog1Δ,20 μM protein,5 min\nhog1Δ,20 μM protein,10 min\nhog1Δ,20 μM protein,15 min",
    "After incubation spin cells down at 1,800 x g for 5 min (at RT). Discard the supernatant.Resuspend cells in 500 μl ice-cold water. Transfer to a 1.5 ml microfuge tube (Tube A).Centrifuge cells at 3,000 x g for 5 min (at RT). Discard the supernatant.Freeze pellets with dry ice.Protein preparationResuspend cell pellets in 100 μl 20% TCA. Also add approximately 100 μl of 180 μm glass beads. Keep pellets on dry ice. Vortex tubes for 2 min (at highest speed).Transfer supernatant from Tube A to a new tube (Tube B).Wash the remaining beads in Tube A with 500 μl 10% TCA. Transfer the 500 μl TCA and add it to Tube B.Spin Tube B at 18,000 x g for 5 min (at RT). Remove supernatant.Resuspend pellets in 1 ml ice-cold acetone.Spin again at 18,000 x g for 5 min (at RT). Remove supernatant.Resuspend pellets with 50 μl loading buffer (1x NuPAGE LDS sample buffer and 50 mM Bond-Breaker). If the buffer turns yellow, add a few microliters of 1 M Tris (pH 8.0) until the color becomes blue. Heat samples at 70 °C for 10 min.SDS-PAGE and Western blotsLoad 25 μl of each sample into the wells of a Bio-Rad any kD Mini-PROTEAN TGX precast polyacrylamide gels, 15 well (Gel 1). Repeat this for a second gel (Gel 2).Run gel for 30 min at 200 V (with 1x Tris/Glycine/SDS running buffer).Transfer protein to Trans-blot turbo mini PVDF membranes (from trans-blot turbo mini PVDF transfer pack) using the Bio-Rad trans-blot turbo transfer system (1.3 A, 25 V, 7 min).Block PVDF membranes in 5% skim milk (40 ml TBS, in a 50 ml tube) for 2 h at RT (on a circular mixer). Discard skim milk after incubation.",
    "Add primary antibodies and incubate overnight on a circular mixer at 4 °C (in a 50 ml tube).For Gel 1, dilute Hog1 (y-215) antibody to 1 in 200 with 10 ml 5% skim milk in TBST.For Gel 2, dilute Phospho-p38 MAPK (Thr180/Tyr182) antibody to 1 in 200 with 10 ml 5% skim milk in TBST.Remove primary antibodies. Wash membranes with TBST (3x, 10 min per wash). Dilute secondary antibody (ECL rabbit IgG, HRP-linked) to 1 in 20,000 with 10 ml TBST and incubate with membranes overnight at 4 °C.Remove secondary antibodies. Wash membranes with TBST (3x, 10 min per wash). Mix 1 ml ECL detection reagent 1 and 1 ml of ECL detection reagent 2 for each membrane. Add 2 ml of the mixture to each membrane.Expose membranes using chemiluminescent settings on a Bio-Rad ChemiDoc MP imaging system. Expose membranes for ~ 1 min (or longer if the signal is weak).See Figure 1 for an example.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140913/20140913221930_8913.jpgFigure 1. Treatment of C. albicans with NaD1 leads to Hog1 phosphorylation. Western blots showing C. albicans Hog1 phosphorylation (detected using Phospho-p38 MAPK antibody) after treatment with the plant defensin NaD1. Bands corresponding to total Hog1 levels are indicated with an arrow. Total Hog1 levels are consistent across all WT treatments and are absent from the hog1∆ mutant. No phosphorylated Hog1 is detected in the no treatment or hog1∆ negative controls. Hog1 phosphorylation is detected in the 1 M NaCl positive control and in all NaD1 treated samples. In this example only one time point is shown for the 20 µM NaD1 treated hog1∆ control. Image originally published in Reference 1 (Hayes et al., 2013)."
  ],
  "subjectAreas": [
    "Microbiology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}