{
  "id": 5101,
  "origin_website": "Bio",
  "title": "Extraction and Quantification of Polyphosphate in the Budding Yeast <em>Saccharomyces cerevisiae</em>",
  "procedures": [
    "Polyphosphate purification by precipitationProtocol adapted from (Kumble and Kornberg, 1995)Inoculate a single colony of the yeast strain with a sterile inoculation loop from a fresh plate into 5 ml of liquid medium (YPD or appropriate selection medium) and incubate overnight on a rotary shaker at 200-220 rpm and 28 °C.After 16-24 h of growth, determine the OD600 of the yeast culture by using a spectrophotometer. Inoculate cells in 5 ml YPD (final OD600 0.2) and incubate in the shaker at 200-220 rpm and 28 °C until the OD600 reaches 0.6-0.8 (This will take 3 to 5 h.).Collect from 0.5 to 1 OD600 units of yeast exponential culture (1-2 x 107 cells) by centrifugation at 12,000 x g for 1 min at room temperature and discard the supernatant. Resuspend the cell pellet with 400 μl of AE buffer prechilled at 4 °C.Transfer the cell resuspension to previously prepared 1.5 ml screw cap tubes containing 300 µl phenol and 40 μl 10% SDS and securely fasten the lid.Mix by inversion 4 times and vortex 5 sec to homogenize.Incubate at 65 °C for 5 min and chill the tubes for 1 min on ice.Add 300 µl of chloroform, securely fasten the lid, mix by inversion 4 times, and vortex 5 sec to homogenize.Centrifuge at room temperature for 2 min at 13,000 x g to separate the aqueous phase containing the polyP from the organic phase.Carefully transfer the aqueous phase (top) to prepared 1.5 ml screw cap tubes containing 350 µl chloroform. Typically, the recovered volume will be approximately 450 µl. Be sure not to carry over any phenol during pipetting by avoid touching the bottom phase or the white protein containing interphase.Securely fasten the lid, mix by inversion 4 times, and vortex 5 sec to homogenize.",
    "Centrifuge at room temperature for 2 min at 13,000 x g.Recover the aqueous phase, approximately 400 µl, and transfer it to a new 1.5 ml microcentrifuge tube. As before, be sure not to carry over any phenol during pipetting by avoid touching the bottom phase.Add 2 µl of RNase A (10 mg/ml) and 2 µl of DNase I (10 mg/ml) to each tube and incubate 1 h at 37 °C. RNase A and DNase I are added before precipitation to degrade RNA and DNA, respectively, thus avoiding RNA and DNA precipitation with polyP.Transfer the aqueous phase to pre-cold at -20 °C, 1.5 ml microcentrifuge tube containing 1 ml of absolute ethanol and 40 µl of 3M sodium acetate (pH 5.3) and leave 3 h at -20 °C to precipitate polyphosphate.Centrifuge for 20 min at 13,000 x g at 4 °C.Discard the supernatant by decantation and add 500 µl of 70% ethanol.Centrifuge for 5 min at 13,000 x g at 4 °C.Discard the supernatant by decantation and centrifuge 1 min at 13,000 x g to remove traces of ethanol by pipetting.Open the tubes and dry the small translucent-white polyphosphate pellet that can be observed at the bottom of the tube at room temperature for 5 min or until the pellet is completely dry. Resuspend in 50 µl of Milli-Q water.The polyphosphate sample can be directly measured or stored at -20 °C.Polyphosphate purification with silica-gel columns Protocol adapted from (Werner et al., 2005)Inoculate a single colony of the yeast strain with a sterile inoculation loop from a fresh plate into 5 ml of liquid medium (YPD or appropriate selection medium) and incubate overnight on a rotary shaker at 200-220 rpm and 28 °C.After 16-24 h of growth, determine the OD600 of the yeast culture by using a spectrophotometer.",
    "Inoculate cells in 5 ml YPD (final OD600 0.2) and incubate in the shaking incubator at 200-220 rpm and 28 °C until the OD600 reaches 0.6-0.8 (This will take 3 to 5 h.).Collect from 0.5 to 1 OD600 units of yeast exponential culture (1-2 x 107 cells) by centrifugation at 12,000 x g for 1 min at room temperature and discard the supernatant. Add 50 µl of 1 M sulfuric acid over the pellet of cells, mix and leave 5 min at room temperature.Neutralize the suspension with 50 µl of 2 M NaOH and add 100 µl of 1 M Tris-HCl (pH 7.5) supplemented to 6% (v/v) with 0.1% neutral red solution (w/v).Remove the cell debris by centrifugation for 10 min at 800 x g at 4 °C.Recover 200 µl of supernatant, add 600 µl of 6 M NaI and mix well prior adjusting the pH of the sample. The pH should be around 7 (The sample colour becomes orange-red.). Samples too acidic (pink) or too basic (yellow) have to be corrected by addition of 2 M NaOH or 1 M sulfuric acid, respectively. Note: The correct adjustment of pH is a critical step for the reproducibility of polyP extraction.Apply the 800 µl of polyphosphate extract to the QIAquick purification column and centrifuge the column for 1 min at 13,000 x g at room temperature.Discard the flow-through and wash the column twice with 400 µl of wash buffer by centrifugation for 1 min at 13,000 x g at room temperature. After the last wash, discard the flow-through and dry the column by centrifugation for an additional 1 min at 13,000 x g at room temperature.Transfer the column to new 1.5 ml microcentrifuge tube and add 50 µl Milli-Q water.",
    "Let the column stand for 1 min and elute the polyphosphate by centrifugation for 1 min at 13,000 x g at room temperature. It is highly recommended to use Milli-Q water with pH > 7 for a better polyP elution. The eluted polyphosphate can be directly measured or stored at -20 °C.Colum regeneration If necessary, the columns can be reused after regeneration with the following protocol:Wash the column once with 750 µl of 0.2 M acetic acid and 50 mM EDTA (pH 8) by centrifugation 1 min at 13,000 x g at room temperature. Wash three times with 750 µl Milli-Q water by centrifugation 1 min at 13,000 x g each time at room temperature.Normally, a column can be used 3-5 times. New columns must be used if a decrease in the yield of polyP recovery is observed.Polyphosphate digestion and plate preparationUse 96-well plate for the reaction of polyphosphate degradation and the subsequent measure of the released phosphate. An excess of rPpx1 (500 ng of rPpx1 enzyme per reaction) is employed for enzymatic polyphosphate digestion.Add 90 µl of polyphosphate assay buffer to wells that will contain phosphate standard curve, sample background measurements, and blanks. Add 90 µl of the mix of Polyphosphate assay buffer and rPpx1 enzyme to the sample wells.Add 10 µl of the sample (duplicate), phosphate standard curve (0 to 500 µM KH2PO4), and positive control consisting in 200 µM polyP3 or 6 µM polyP45 to the 90 µl of Polyphosphate assay buffer. Mix by pipetting up and down several times.Incubate the plate at 37 °C for 60 min. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160712/20160712230042_9002.jpgFigure 2. Example plate of polyphosphate measurement. Row A contains the phosphate calibration curve.",
    "Rows B and E contain the polyphosphate sample without enzyme (italics) to measure the background and rows C, D, F, & G contain duplicate samples with rPpx1 enzyme. Similarly, the last row contains blanks and positive controls of polyP3 and polyP45 that are incubated with and without enzyme (italics and bold respectively).Phosphate quantification Protocol adapted from (Cogan et al., 1999). Quantification of phosphate is made directly on the PolyP digestion plateTo quantify the released phosphate, add to each well 86 µl of 28 mM ammonium heptamolybdate in 2.1 M H2SO4 and 64 µl of 0.76 mM malachite green in 0.35% polyvinyl alcohol. Mix well by using the shaking option of the microplate reader or by pipetting up and down the samples to ensure a complete mixture of all reagents.After 20 min at room temperature measure the A595 in a multiplate reader. Do not let the reaction proceed more than 1 h as it can cause appearance of small precipitates in highly concentrated phosphate samples and polyP degradation in background samples, thus interfering with the correct phosphate measure.The amount of phosphate is obtained by comparing the absorbance value of each sample with the phosphate standard curve after subtracting the background value for each sample. The polyP3 and polyP45 are used as controls for the rPpx1 reaction over polyphosphates.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160712/20160712230536_0091.jpgFigure 3. Example plate of phosphate quantification"
  ],
  "subjectAreas": [
    "Microbiology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}