{
  "id": 9716,
  "origin_website": "Jove",
  "title": "Whole Cell Recording from an Organotypic Slice Preparation of Neocortex",
  "procedures": [
    "1. Preparations Before the Day of Slicing\nWe find it is more efficient to autoclave the surgical instruments and prepare solutions prior to the day of slicing.\nAutoclave instruments.  (The surgery and slicing are performed under semi-sterile conditions).  Autoclave the following packages, individually wrapped in autoclave paper:\n    \nSurgery package: spatula, #22 scalpel blade handle, scissors,forceps\nSlicing package: 3 knobs (blade-holding knob and 2 bath-securing knobs)and blade guard (holds razor blade from slicer: Campden Vibroslice, #MA572), individually wrapped (because it will be put in freezer) custom made metal chamber (specimen bath) for slicer (the manufacturer's plexiglass one will not withstand repeated autoclaving), hemostat, scissors, forceps.\nGlassware package: two 50 mL beakers and one 25 mL beaker\nAliquot horse serum (Hyclone donor equine  #SH 30074: Thermoscientic).   Aliquot ~11 mL of horse serum into 15 mL conical tubes.  (10mL serum is needed.  Because bubbles will form when serum is thawed, you need 11 mL from which to aspirate the required 10 mL).  Store aliquoted serum in a -20°C freezer.\nAliquot media.  After the media bottles are opened, they are only stable for ~4 weeks (due to pH changes).  The slices survive better with fresh media.\n    \nWe use three types of commercially available media (purchased in 500 mL bottles), plus horse serum.  The media are: HMEM (Lonza Biowhittaker Minimal Essential Media plus HBSS and HEPES, no glutamine: Catalog #12-137F), HBSS (GIBCO Hanks buffered saline, #24020-117), and MEM (GIBCO minimal essential medium, #12360-038). See Table 2.\nFor each of the three types of media (HMEM, HBSS, and MEM), aliquot ~50 mL from a 500 mL bottle of media into each of four 50 mL conical tubes. Parafilm all tubes after aliquoting.  Store MEM in the refrigerator, and store HMEM and HBSS at room temperature.",
    "The culture media consists of a mixture of horse serum, HMEM, and HBSS (see below, Table 2).  MEM is used as wash media.\nMake Cutting Solution (Table 3). The Cutting Solution is composed of (in mM): NaCl 125, KCl 3, NaH2PO4 1.25, NaHCO3 26, 2 mM CaCl2, 2 mM MgCl2, and 20 mM glucose.  We typically make 250 mL (bring to volume in volumetric flask). Check osmolality (should be ~310) and pH (7.2-7.3).\nSubsequent Steps (#2 and #3) are performed on the day of slicing.\n2. Surgery, Slicing, and Organotypic Culture\nIt is important to perform the surgery in a separate location vs. all other procedures.  We use a vacuum (fume) hood for the surgery for removal of the brain.  A laminar flow hood is used for procedures performed under semi-sterile conditions, such as slicing and manipulations of slices and solutions.\nPrepare solutions.  (These procedures need not be performed under sterile conditions as the solutions will be filtered in a later step.).\n    \nPrepare Cutting Solution (Table 3). Bubble the solution with a mixture of 95% O2 / 5% CO2 for at least 20 minutes (to stabilize pH and make sure all salts are in solution).  Add 1 mM Pyruvic acid (metabolic inhibitor) and0.6 mM ascorbate (antioxidant).\nThaw 1 aliquot of horse serum (11 mL).\nPrepare laminar flow hood (wear gloves for all procedures, saturate gloves with EtOH).  In this section, we prepare the work area to provide a clean, semi-sterile work space.  We will also filter the solutions to sterilize them.",
    "Use UV light for ~1 hour to sterilize the work space within the laminar flow hood (UV light will damage plastic parts so we cover theCampden Vibroslice we use for slicing, see below).  Clean all surfaces with 70% EtOH  (except plastic knobs of slicer: EtOH will damage).  Also typically present under the laminar flow hood are the pipetter and pipets, EtOH bottle, glue, and tubing connected to 95% O2 / 5% CO2 and 100 O2.\nPlace the following under laminar flow hood:\n        \nAutoclaved slicing package\n250 mL Cutting Solution\nMillipore express plus filter: 250 mL [0.2 μm filter (#SC6PU02RE)to filter Cutting Solution]:\nCulture Media Components:\n            \n20 mL HMEM\n10 mL HBSS\n10 mL horse serum\nGlassware package: The autoclaved beakers\n50 mL of MEM wash media\nPipetter (Drummond pipet-aid)\nSeven plastic transfer pipettes (Fisher #13-711-20).  These are used to transfer slices and solutions, as well as to serve as conduit for gas solutions (O2; 95% O2 / 5% CO2) for bubbling solutions and media.\nCyanoacrylate glue\nRazor blade or scissors (to cut plastic).\nSterile #22 scalpel blade\nMillicell cell culture inserts (0.4 μm, 30 μm diameter, #PICM 03050)3 inserts for each 6-well plate\n6-well culture plate(s) (Corning: Costar #3516)\nFilter the prepared 250 mL Cutting Solution using a 250 mL Millipore filter (see above).\n        Aliquot 40 mL of Cutting Solution into a 50 mL beaker.  Place the 40 mL aliquot of Cutting Solution and 210 mL remaining Cutting Solution in freezer (-20°C). The goal is to use these solutions as a slushy mixture at ~4°C for receiving the brain after removal from the skull (40 mL in beaker) and for cutting (210 mL).\nPlace metal slicing chamber (covered with autoclave paper) in -20°C freezer.  This helps to keep the Cutting Solution and brain cold during slicing.",
    "Prepare Culture Media and put into wells (Do not bubble Culture Media - it will froth).\n        \nPrepare 40 mL Culture Media in 50 mL plastic centrifuge tube:\n            \nMix 20 mL HMEM + 10 mL HBSS + 10 mL aliquot of horse serum (Table 2)\nFilter Culture Media (to sterilize) using 50 mL Millipore steriflip 0.22 μM filter (#SCGP00525).\nPlace 1.1 mL Culture Media into 3 diagonally spaced wells of a 6-well plate (Corning: Costar #3516 6 well culture cluster).  Place 6-well plate / Culture Media into 37°C incubator for at least one hour.\nWith sterile scissors or razor blade, shorten 4 of the transfer pipets (use for transferring slices).  The cut tube ends are used without further modification to disperse gases for bubbling solutions. These tubes connect the lines from tanks of 95% O2/5% CO2 or 100% O2 to solutions.\nFilter Wash Media (50 mL) using 50 mL Millipore steriflip 0.22 μM filter(#SCGP00525).  Place Wash Media in refrigerator.\nPreparation for surgery.   Solutions must be ready to accept the brain after the surgery (vacuum hood) and to allow rapid slicing and preparation for culture (laminar flow hood).  We perform the surgery under a vacuum hood.  It is important that the surgery be performed in a separate area to keep hair and body fluids away from the semi-sterile laminar flow hood.\n    \nPrepare media and solutions.\n        \nRemove the 50 mL beaker with 40 mL Cutting Solution from freezer and put under vacuum hood to receive brain after removal from skull.  Pour ~10 mL of this cold Cutting Solution in a 25 mL beaker. This will be used to transport brain to laminar flow hood.\nRemove 210 mL Cutting Solution from freezer and put in laminar flow hood (for slicing and slice collection).",
    "Remove metal slicing chamber from freezer and put under laminar flow hood.\nBubble both cutting solutions with 95% O2 / 5% CO2 (use cut plastic transfer pipettes to connect tubing to solution).\nPlace the following items under the vacuum hood (30 mL Cutting solution is already present and bubbling with 95% O2 / 5% CO2):\n        \nautoclaved 25 mL beaker\nAutoclaved surgical instruments, gloves, forceps\nRemove Wash Media from refrigerator and bubble with 100% O2 (use end of cut plastic transfer pipette to connect tubing to solution).\nThe surgery (performed under vacuum flow hood).  This step is required to remove the brain for subsequent slicing.  It is important to minimize the time between sacrificing the animal and placing the brain in cold, oxygenated Cutting Solution.  It is also important to minimize trauma to the brain. All procedures were approved by the Animal Care and Use Committee, University of Tennessee, Health Science Center.\n    \nWe use Sprague-Dawley rats, from P6-P17 (we prefer P8-P10).  Place rat into covered 2-4 L plastic container.  For anesthesia, ~ 1 mL isofluorane is applied to a piece of gauze located under a plastic mesh (so that anesthetic does not contact animal).  Anesthetize rat with isoflurane until the animal is areflexive.  Saturate gloves with EtOH.\nAfter rat is anesthetized, decapitate the animal with large scalpel, and remove brain.  Put brain into the beaker containing 30 mL of cold (~ 4°C) Cutting Solution for ~30 sec.  Carefully transfer brain to 25 mL beaker to minimize transfer of hair or blood to laminar flow hood.\nChange gloves (saturate with EtOH).\nTransfer brain in cold Cutting Solution (25 mL beaker) to laminar flow hood.",
    "Slice the brain and prepare for culture.  In this step, we orient the brain, remove unneeded brain tissue, and cut and collect brain slices.  We then wash the slices, place each slice on a mesh insert, place the mesh inserts in 6-well culture plates, and transfer the plates (with slices) to the incubator for culture.\n    \nOrient and block brain (remove cerebellum and frontal pole, make partial mid-sagital cut ~ half way from frontal cortex end.  This allows simultaneous cutting of two slices - one from each hemisphere - but still retains both hemsipheres together at the caudal end for a stable base to glue to stage).  Glue blocked brain on stage with cyanoacrylate.  Place brain with frontal cortex up and cut coronal slices of frontoparietal cortex.  Make additional scalpel cuts as needed to restrict size of slice.\nPlace the stage with the brain into the sterilized metal slicing chamber (which is attached to the vibrating tissue slicer) and fill bath with ice cold, bubbling Cutting Solution.  Pour ~30 mL of remaining Cutting Solution into a 50 mL beaker (to collect slices in) and bubble with 95% O2 / 5% CO2.\nCut 250-300 μm slices with a vibrating tissue slicer (Campden Vibroslice #MA572: World Precision Instruments, Sarasota, FL, USA).  Place slices into beaker that contains 30 mL Cutting Solution.  Collect the number of slices you wish to culture (typically 3-6), plus a few extra.\nWash Slices:  Place ~2 mL Wash Media in a 35 mm plastic Petri dish.  Transfer all slices from the Cutting Solution to the plastic Petri dish with Wash Media.  Wash slices 3 times, using fresh Wash Media each time.  Use separate transfer pipettes to transfer slices, add media, and aspirate waste solutions.",
    "Transfer slices to Culture Media (in a different 35 mm plastic Petri dish; new transfer pipette).  Remove the tops from the packaging for the mesh inserts, but leave the inserts in the packaging.\nTransfer Slices From Culture Media to mesh inserts (with cuttransfer pipette): Position slices in the middle of the insert (Figure 1A).  A small bit of Culture Media will come along with the slice.  Using an intact transfer pipette, remove the excess Culture Media immediately after placing slice down on the insert.  Try to position slice in center of insert (this facilitates biolistic transfection and makes it easier to remove the slice for later recording).\nPlace mesh insert /slice in Culture Media in 6-well plate (Figure 1B).   Be careful to prevent formation of air bubbles under the mesh.When 3 inserts / slices are in the 6-well plate, place 6-well plate back in incubator.  Incubate slices in 37°C incubator for ~1 hour.\nTransfect slices using Gene Gun (Bio-Rad Helios).  This can be done immediately after slicing and placement on mesh in 6-well plate, however we typically incubate for 1 hour at 37°C to stabilize the slices and then transfect the cells.  For detailed protocols for making cDNA \"bullets\" and using the Gene Gun, see Refs. 17-22.\n    \nLoad plastic \"cartidges\" containing \"bullets\".  (We refer to cDNA-coated gold particles as bullets.  Thus, many bullets are contained in a plastic \"cartridge\".).  Leave the first position free (no \"cartridge\").  Load every other position with cartridge containing cDNA-coated bullets.  Place cartridge holder in gene gun.\nClear gun by firing barrel with no cartridge.\nAdvance barrel to one with cartridge.  Remove 6-well plate from incubator and place under the laminar flow hood.  Hold gun just above top of 6-well plate.  Hold vertical.  Shoot at ~100 psi.\nAdvance barrel, clear, repeat.  One shot per slice.",
    "After shooting, return 6-well plates with slices / inserts to incubator.\nCulture slices (Under semi-sterile conditions).  All manipulations of the slices and 6-well plates should be performed wearing gloves saturated with EtOH and under the laminar flow hood, after cleaning area with EtOH.  We culture the slices for various time periods (generally 2-7 days) to allow recovery from the acute slicing procedure and to allow time for transfection to lead to new protein.\n    \nCulture for 2-7 days (37°C, 5% CO2) in incubator (Forma Scientific model # 3110).\nReplace media every other day:  Add new media to the three unoccupied wells, replace in incubator for at least 1 hour.  Move slice / membrane to new well with EtOH-cleaned curved forceps.  Aspirate old media.  Return plate to incubator.\n3. Record from Pyramidal Cells in Slices\nIt is beyond the scope of this protocol to provide detailed instruction on whole cell recording techniques.  We provide information on how to transfer slices to the recording chamber and provide details of our recording set-up, especially as pertains to identifying transfected cells for recording.\nWe pull electrodes from Harvard GC150TF-10 glass using a Sutter P-87 horizontal puller.  Electrodes are 2-6 MΩ in the extracellular solution.  Electrodes are filled with a KMeSO4 internal (see Table 3).\nWear gloves.  Remove 6-well plate from incubator.  Under the laminar flow hood, carefully remove one slice / mesh insert with EtOH-cleaned, curved forceps.  Replace 6-well plate in incubator and transfer the slice to be recorded from to the recording area.  In our case this is in a different laboratory.  We carry the insert / slice in a covered 35 mm plastic Petri dish.  After this step, gloves need not be worn (no possibility of contaminating cultures or incubator).",
    "Cut away membrane with #11 scalpel.  Cut against tension supplied by forceps or flexible metal bar.  (It may be necessary to finish the final cuts with a scissors).Using forceps, transfer the slice with attached mesh to the recording chamber on the stage of an Olympus BX50 WI upright microscope.\nWe use an Axon Instruments Multiclamp 700B amplifier and data acquisition protocols in PClamp 10.  Electrode position is controlled with Sutter ROE-200 manipulators and PC-200 controller.  We use an Olympus BX-50WI upright microscope with IR-DIC optics to visualize pyramidal neurons in layers II/III or V. We use a single IR-sensitive camera (Olympus OLY-150 or DAGE-MTI) and ProVideo 1201B monitor to visualize the cells in the slice.  Slices are bathed in carbogenated artificial cerebrospinal fluid (aCSF: Table 3) delivered at 2-3 mL/min at 33±1°C.\n    Typically, we find 10-50 transfected cells per slice.  Cells are located by lookingthrough the microscope eyepiece and using epifluorescence with a FITC filter(mounted on a filter wheel in a turret mount located above the objectives and below the eyepiece of the microscope).  This allows us to easily switch between IR-DIC and epifluorescence to determine cell type, that the cell is transfected (cell appears green under epifluorescence and contains a bullet), and that the cell is healthy (cell is 3-dimensional and has smooth surface, nucleus not swollen, cell not swollen or shrunken).",
    "We target pyramidal neurons in layers II/III or V (see Figure 1). Pyramidal cells are identified by the presence of an apical dendrite ascending towards layer I, numerous dendritic spines, and pear-shaped soma. Layer is determined by cell density and location relative to the pia.  Generally transfected cells on the surface of the slice will not be healthy.  Although it is more difficult to visualize cells deep within organotypic slice than with acute slices, we generally can visualize healthy, transfected cells from 20-50 μm below the slice surface. We use standard whole cell recording methods.  We approach the cell under visual guidance and with positive pressure in voltage-clamp. Seals are acquired with gentle suction (using 1 mL syringe) under voltage-clamp. Upon attaining a GΩ seal, additional suction is applied to break in to the cell.  We then perform recordings in either current- or voltage-clamp.\n    At the end of the recording, we verify that the recorded cell is green, contains a bullet, and visibly responds to negative or positive pressure.  To control for variation between slices, cell layers, age at time of surgery, and time in culture, we always pair our recordings of transfected cells with recordings from untransfected control cells from the same layer and located with 50 μm of the transfected cell.\n4.  Representative Results:",
    "Figure 1A shows an acutely prepared slice sitting on the membrane for insertion into a 6-well plate for culturing. This slice includes motor and somatosensory cortex from a P10 rat pup.  The pia is to the right of the figure, with white matter and striatum to the left.  Figure 1B shows the slice /membrane in the well, immersed in  ~1.1  mL Culture Media.  Our goal for the organotypic culture is to retain the normal laminar pattern of cortex, prevent surface drying during culture, and ultimately to produce a high proportion of live cells in the slice after several days in culture that can be recorded from (cells not shrunken or swollen, minimal swollen cell nuclei, shiny and three dimensional appearance of cells in IR-DIC optics).  Figure 1C shows IR-DIC and epifluorescence images of a layer III pyramidal neuron in an organotypic slice of somatosensory cortex after 3 days in culture (from P10 animal).  Figure 1D is an epifluorescence image of a different slice, showing several layer V cells transfected with cDNA for GFP (green cells).",
    "Figure 2 shows representative traces in current- and voltage-clamp recordings from a layer V pyramidal cell after organotypic slice culture for 3 days (P10 animal).  Figure 2A shows an overshooting action potential (AP).  Figure 2B shows repetitive firing in response to a 2 s, 400 pA constant current injection.  These traces indicate normal electrophysiological properties of a regular spiking layer V neuron (see also Table 1).  Figure 1C is a voltage-clamp recording from a layer V pyramidal neuron in the presence of 1 μM tetrodotoxin (TTX) to block voltage-gated Na+ currents.  The traces are a family of currents in response to 500 ms voltage steps from a holding potential of -70 mV to various potentials between -90 mV and +70 mV (at 10 mV between steps).\nimgsrc://cloudfront.jove.com/files/ftp_upload/2600/2600fig1.jpg\nFigure 1.  Organotypic slice culture. A.  Slice of rat sensorimotor cortex from P10 rat on Millicell filter mesh insert.  Pia is to the right, deep white matter and striatum to the left.  The midline is at the upper edge.  B.  Three slice and mesh inserts submerged in ~1 mL Culture Media and placed in nonadjacent wells of 6-well plate (same animal as in A).  C.  IR-DIC (upper) and epifluoresent (lower) images of layer III neocortical pyramidal cell in organotypic culture (P10 animal, 3 days in culture).  Note \"bullet\" visible in DIC image (black sphere).  D.  Fluorescent image of several layer V neurons after biolistic transfection with cDNA for GFP.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2600/2600fig2.jpg",
    "Figure 2.  Recordings from neocortical pyramidal cells in organotypic slice culture. A.  Action potential in layer III pyramidal cell (from P10 animal, after 3 days in culture) in response to suprathreshold 10 ms current injection.  B.  Repetitive firing from a different, layer V pyramidal neuron (P10 rat, 3 days in culture) in response to a 2 s, 400 pA current injection.  This was a regular spiking neuron.  C.  Voltage-clamp record from a different layer V pyramidal neuron (P10 rat, 3 days in culture).  1 μM TTX was present to block voltage-gated Na+ current.  Outward, K+ currents in response to a family of 500 ms voltage steps from a holding potential of -70 mV (protocol at right).  Voltages were corrected for a +10 mV liquid junction potential.  Access resistance was ~ 9 MΩ.  No compensation for series resistance or membrane capacitance was employed.\nTable 1.  Similar electrical properties of control vs. GFP-transfected pyramidal cells (slices from p10 rat; organotypic slice: 3-4 days in vitro).  Mean + Standard Error of the Mean (number of cells).  RMP = resting membrane potential, Rn= input resistance, AP = action potential; Vth = voltage threshold for AP; HW = AP width at half amplitude.\ntable:\n﻿0,1,2,3,4,5\nTreatment,RMP (mV),Rn (MΩ),AP amplitude,Vth (mV),HW (ms)\nControl,-72 ± 1 (21),119 ± 17 (11),84 ± 2 (24),-45 ± 1 (21),1.7 ± 0.1 (19)\nGFP only,-77 ± 1 (9),123 ± 7 (5),87 ± 2 (24),-45 ± 2 (9),2.1 ± 0.2 (7)\nTable 2.  Commercial Media. These media are purchased and used unmodified (Their compositions are available on-line from the manufacturer).\n1Wash Media: MEM (GIBCO#12360)\nCulture Media: 20 mL HMEM1 (Lonza Biowhittaker), + 10 mL HBSS1 (Gibco, 24020-117)  + 10 mL horse serum1 (Hyclone #SH 30074.03)\nTable 3.  Solutions (concentrations in mM).",
    "Cutting Solution: 125 NaCl, 3 KCl, 2 CaCl2, 2 MgCl2, 1.25 NaH2PO4, 26 NaHCO3, 20 glucose  (pH 7.4, 310 MOsm/L).\nArtificial Cerebrospinal Fluid aCSF (external recording): 125 NaCl, 3 KCl, 2 CaCl2, 2 MgCl2, 1.25 NaH2PO4, 26 NaHCO3, 20 glucose  (pH 7.4, 310 MOsm/L).\nInternal Recording (current-clamp): 130.5 KMeSO4, 10 KCl, 7.5 NaCl, 2 MgCl2, 10 HEPES, 2 ATP, 0.2 GTP, 0.1 EGTA (pH 7.2, 285-295 mOsm/L).\nInternal Recording (voltage-clamp): 55 KMeSO4, 55 KOH, 2 MgCl2, 20 HEPES, 6 creatine phosphate, 4 ATP, 0.5 GTP, 10 BAPTA, 0.1 leupeptin (pH 7.2, 285-295 mOsm/L).Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}