{
  "id": 19813,
  "origin_website": "Wiley",
  "title": "Characterization of Klebsiella pneumoniae Extracellular Polysaccharides",
  "procedures": [
    "This protocol describes a method to isolate and purify surface-associated and cell-free (non-attached) extracellular polysaccharides of K. pneumoniae. The protocol is based on a previously reported method and has been well-established for K. pneumoniae (Anderson et al., 2017[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.937#cpz1937-bib-0002]; Favre-Bonte et al., 1999[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.937#cpz1937-bib-0008]; Mike et al., 2021[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.937#cpz1937-bib-0013]). A K. pneumoniae culture is subjected to detergent treatment to release capsular polysaccharides from the bacterial cell surface into the supernatant. Cold ethanol is used to precipitate the extracellular polysaccharides, which are rehydrated to dissolve. This protocol provides a high-throughput method to obtain purified extracellular polysaccharides from a large number of samples at once for quick quantification and/or staining.\nMaterials\nIsolated colonies of any K. pneumoniae strain on a nutrient agar plate [e.g., K. pneumoniae ATCC 43816 (KPPR1) on low-salt Luria-Bertani]\nLow-salt Luria Bertani (LB) broth (see recipe)\n1× Phosphate-buffered saline (PBS; sterile or non-sterile)\n1% Zwittergent 3-14 in 100 mM citric acid (see recipe)\nAnhydrous ethanol (Fisher Scientific, cat. no. A405P-4)\nUltrapure water\nPipettor and sterile pipette tips (200 µl and 1000 µl)\nPipette controller (e.g., MidSci, cat. no. ASMPIP1)\n5- or 10-ml sterile serological pipettes (e.g., Genesee Scientific, cat. no. 12-104)\nSterile applicator sticks (e.g., Fisher Scientific, cat. no. 22-029-491)\n17 × 100-mm sterile aeration culture tubes (or other pertinent culture tube) (e.g., Genesee Scientific, cat. no. 21-131)\n96-well flat-bottom plate (sterile or non-sterile) (e.g., Genesee Scientific, cat. no. 25-104)\n37°C Shaking incubator (e.g., New Brunswick INNOVA 44/44R)\nVortex mixer (e.g., Benchmark Scientific, cat. no. BV1003)\nCentrifuge 24 × 1.5/2 ml, ≥17,000 × g (e.g., Eppendorf Centrifuge 5425)\nRefrigerated centrifuge 24 × 1.5/2 ml, ≥17,000 × g (e.g., Eppendorf Centrifuge 5425R)\nHeat block set at 50°C (e.g., Eppendorf ThermoMixer C)\n1.7-ml sterile microcentrifuge tubes (e.g., Genesee Scientific, cat. no. 24-282C)\nVisible-spectrum microplate reader (e.g., Biotek EPOCH2)\nSetting up overnight cultures of KPPR1",
    "1. Label three 17 × 100-mm culture tubes for three biological replicates. Include one additional tube for a negative growth control.\nWe recommend including three biological replicates per strain or condition for each independent experiment. Include a wild-type strain as a positive control if isolating and purifying extracellular polysaccharides from a mutant strain.\n2. Add 3 ml low-salt LB broth to each tube.\nIf plasmid maintenance is critical, add a plasmid-relevant antibiotic (or other agent) to maintain the selection pressure. However, include appropriate controls to ensure that the added agent does not affect the phenotype under study.\n3. Use a sterile applicator stick or inoculating loop to introduce one bacterial colony to each tube, except the negative growth control tube.\n4. Incubate tubes at 37°C and 200 rpm for 16-18 hr in a 37°C shaking incubator.\nIncubating the tubes at a 60° angle allows for proper aeration, which can impact experimental outcomes.\n[Optional] Measuring overnight culture density\n5. Take a 96-well flat-bottom plate and transfer 270 µl of 1× PBS into three wells. Transfer 300 µl of 1× PBS to three additional wells for blank correction.\n6. Briefly vortex the tubes incubated overnight and pipette 30 µl of the culture into a corresponding well containing 270 µl of 1× PBS. Mix well by pipetting up and down 5-6 times.\nHypermucoviscous K. pneumoniae strains do not readily mix. Thus, ensuring that the culture is properly mixed with PBS is important. If inconsistent culture density readings are recorded, mix the culture by pipetting up and down >5-6 times.\n7. Measure the absorbance of the blank controls and bacterial suspensions at 600 nm (OD600) in a 96-well plate reader.\n8. Calculate the overnight OD600 of the culture as described below.",
    "OD600 = (Sample A600 – Blank A600) × dilution factor × plate-to-cuvette conversion factor\n= (Sample A600 – Blank A600) × 10 × 1.181599\nSample A600: OD600 of the overnight sample at 600 nm\nBlank A600: OD600 of 300 µl 1× PBS at 600 nm\nDilution factor: Ratio of total volume (culture + PBS) to culture volume used (e.g., 300 µl total sample volume/30 µl bacterial culture = 10 dilution factor)\nPlate to cuvette conversion factor: Converts absorbance reading from the path length in a 96-well plate to a standard 1-cm path length in a cuvette (1.181599). This should be experimentally determined for each microplate spectrophotometer. Refer to Support Protocol 5 for conversion factor determination.\nAlternatively, a serial dilution of the sample can be plated to determine the colony-forming units (CFU) per ml for normalization.\nExtracellular polysaccharide purification\n9. Use one clean 1.7-ml tube per sample. Transfer 50 µl of 1% Zwittergent 3-14 in 100 mM citric acid, pH 2, to each tube.\nAdding Zwittergent releases extracellular polysaccharide attached to the cell surface, thus purifying total extracellular polysaccharide (total EPS) in the sample (i.e., cell-attached capsular polysaccharide (CPS) and non-attached extracellular polysaccharide (EPS) in the culture supernatant.)\nAlternatively, transfer 50 µl ultrapure water (not Zwittergent) to purify only non-attached EPS (i.e., extracellular polysaccharide present in the culture supernatant).\n10. Add 250 µl samples of well-vortexed overnight culture to the Zwittergent-containing tubes and mix well by inverting the tubes multiple times.\nTo purify non-attached EPS, the water-sample mixture can be left on the bench until the total EPS samples are ready or immediately proceed to step 12.\n11. Incubate the Zwittergent-sample mixture at 50°C for 20 min, inverting periodically.\n12. Centrifuge the Zwittergent/water-sample mixture for 5 min at 17,000 × g and room temperature.",
    "Meanwhile, label one clean 1.7-ml tube for each sample and add 400 µl ice-cold absolute ethanol. Keep the tubes on ice until you are ready to proceed to the next step.\n13. Carefully transfer 100 µl of the supernatant to the 1.7-ml tube containing 400 µl absolute ethanol (80% final ethanol concentration) and mix by inverting the tube.\nDepending on the amount of polysaccharide in the supernatant, a visible white precipitate of polysaccharide can be observed.\n14. Incubate the supernatant-ethanol-containing tube on ice for at least 20 min.\nTubes can be incubated on ice for longer than 20 min. Longer incubation should not affect final capsule purification.\n15. Centrifuge the tubes for 5 min at 17,000 × g and 4°C.\n16. Decant and discard the supernatant carefully and let the tubes dry at room temperature for 5-10 min.\n17. Add 200 µl ultrapure water to the tubes and vortex for 5-10 s.\n18. Incubate the tubes at 37°C for 30 min to solubilize the polysaccharide and vortex again.\n19. Store the purified, hydrated polysaccharide samples at -20°C or proceed directly to Basic Protocol 3.",
    "This protocol is a modification of Basic Protocol 1 and illustrates the large-scale extraction and purification of K. pneumoniae extracellular polysaccharide. The process involves extracting polysaccharides from the bacterial cell surface using a detergent, followed by ethanol precipitation. The precipitated polysaccharides are dialyzed over several days while treating with nuclease and proteinase to remove the contaminating nucleic acids and proteins (Alvarez & Cobb, 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.937#cpz1937-bib-0001]). The polysaccharide sample can be used for further chemical analysis, such as composition analyses by mass spectrometry or HPLC.\nMaterials\nIsolated colonies of any K. pneumoniae strain on a nutrient agar plate [e.g., K. pneumoniae ATCC 43816 (KPPR1) on low-salt LB]\nLow-salt LB broth (see recipe)\n1% Zwittergent 3-14 in 100 mM citric acid (see recipe)\nIce-cold anhydrous ethanol (Fisher Scientific, cat. no. A405P-4)\nUltrapure water\n5% (w/v) sodium azide (see recipe)\nRibonuclease A (RNase, Worthington Biochemical Corp., cat. no. LS005650)\nDeoxyribonuclease I (DNase, Worthington Biochemical Corp., cat. no. LS002007)\nPRONASE (Millipore, cat. no. 537088-10KU)\n1 M Tris, pH 7.5 (see recipe)\n1 M CaCl2 (see recipe)\n1 M MgCl2 (see recipe)\nPipettor and sterile pipette tips (200 µl and 1000 µl)\nPipette controller (e.g., MidSci, cat. no. ASMPIP1)\n5- or 10-ml sterile serological pipettes (e.g., Genesee Scientific, cat. no. 12-104)\nSterile applicator sticks (e.g., Fisher Scientific, cat. no. 22-029-491)\n17 × 100-mm sterile aeration culture tubes (or other pertinent culture tube) (e.g., Genesee Scientific, cat. no. 21-131)\n37°C Shaking incubator (e.g., New Brunswick INNOVA 44/44R)\nPlastic bucket, minimum 1 L volume (e.g., Eisco Labs 5000 ml plastic beaker)\nVortex mixer (e.g., Benchmark Scientific, cat. no. BV1003)\n2-ml microcentrifuge tubes (e.g., Genesee Scientific, cat. no. 24-283)\n15-ml sterile conical tube (e.g., Griener Bio-One CELLSTAR, cat. no. 181-271)\n50-ml sterile conical tubes (e.g., USA Scientific, cat. no. 5622-7261)",
    "Centrifuge 24 × 1.5/2 ml, minimum speed 17,000 × g (e.g., Eppendorf Centrifuge 5425)\nRefrigerated centrifuge, fixed-angle rotors able to fit 50 ml conical tubes, minimum speed 15,000 × g (e.g., Eppendorf Centrifuge 5910Ri)\nHeat block set at 50°C (e.g., Eppendorf Thermomixer C)\n4°C refrigerator or 4°C cold room\nMagnetic stirrer (e.g., Benchmark Scientific, cat. no. H4000-HS/H4000-S)\nDialysis membrane, ≤18 mm wide, 25 kD molecular weight cut-off (Spectra/Por 6 Regenerated Cellulose Dialysis Membrane, Repligen, cat. no. 128218)\nDialysis tubing closures, ≤35 mm (Spectra/Por 6 Closures, Repligen, cat. no. 132736)\nSterile Syringes, 10 ml (e.g., Fisher Scientific, cat. no. 14-955-459)\nSyringe Filters, 0.2 µm pore size (Fisher Scientific, cat. no. 13-100-106)\nRotating shaker (e.g., Labline Instruments, cat. no. 1314)\nClean borosilicate glass vials with screw cap (Vial volume depends on sample volume)\nLyophilizer (e.g., FreeZone 1 L Benchtop Freeze Dry System, Labconco cat. no. 7740020)\nDay 1: Inoculation and incubation of KPPR1\n1. Inoculate the strains of interest into 3 ml LB broth in a 17 × 100-mm culture tube and incubate at 37°C and 200 rpm for 16-18 hr.\nDay 2: Extraction of extracellular polysaccharide (EPS)\n2. Sub-culture the overnight culture (1:100) in 3 ml LB and incubate at 37°C with shaking (200 rpm).\n3. Incubate the culture until it reaches the mid-log growth phase.\nKPPR1 in LB reaches mid-log growth when OD600 is within the range of 0.4-0.6, which takes around 3 hr at 37°C and 200 rpm.\n4. For each sample, transfer 500 µl of 1% Zwittergent 3-14 in 100 mM citric acid to a clean 2-ml tube.\n5. Add 1.5 ml mid-log phase culture to the corresponding Zwittergent tube. Mix well by inverting.\n6. Incubate the tubes at 50°C for 20 min.",
    "7. Following incubation, centrifuge the tubes for 5 min at 21,000 × g and room temperature.\nMeanwhile, for each sample, transfer 6 ml ice-cold absolute ethanol into a sterile 15-ml conical tube. The final ethanol concentration will be 80% after mixing with 1.5 ml Zwittergent-treated bacterial supernatant.\n8. Carefully transfer 1.5 ml supernatant to the conical tube containing ethanol. Mix by inverting and incubate on ice for 30 min.\nA visible precipitate of extracellular polysaccharides (or opaque solution) can be observed upon mixing ethanol and supernatant (Fig. 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.937#cpz1937-fig-0001]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/f0e03423-2c57-4946-ad21-d64a684b1714/cpz1937-fig-0001-m.jpg</p>\nFigure 1\nA visible precipitate is formed when supernatant containing capsular material is mixed with ice-cold ethanol. (A) White precipitate (yellow arrow) of capsular material formed with ice-cold ethanol in KPPR1. (B) No visible precipitate is formed by extracted product from the acapsular KPPR1 wza mutant.\n9. Centrifuge the conical tube for 5 min at 15,000 × g and 4°C.\n10. Remove the supernatant carefully and discard. Add 2 ml of ultrapure water. Incubate the tube at room temperature for 30 min on a rotator to rehydrate the polysaccharide pellet.\nMeanwhile, prepare 1 L of ultrapure water (per sample) in a bucket to use for dialysis.\n11. Transfer the 2 ml of rehydrated sample to a 25 kD cut-off dialysis membrane and secure with tube closures. Dialyze against 1 L ultrapure water for 1 hr at room temperature with constant stirring.\n12. After 1 hr, transfer the dialysis tubing to 1 L of fresh ultrapure water containing 0.05% sodium azide (add 10 ml of 5% (w/v) sodium azide per 1 L ultrapure water). Dialyze with constant stirring overnight at 4°C.\nDay 3: Nuclease treatment of EPS\n13. Transfer the dialysis tubing to 1 L fresh ultrapure water containing 0.05% sodium azide. Dialyze with constant stirring at room temperature for 8-10 hr.",
    "14. Prepare 2 ml nuclease solution by adding 6 mg RNase A and 1.4 mg DNase to 1 ml of 1 M Tris, pH 7.5, 20 µl 1 M CaCl2, 20 µl MgCl2, and 1 ml ultrapure water. Sterilize by filtering through a 0.2-µm syringe filter.\nStore the leftover nuclease solution at -20°C for up to one year.\n15. Remove the sample from the dialysis membrane and transfer to a clean 15-ml conical tube. Add 20 µl of 5% sodium azide (final concentration 0.05%) and bring the final volume to 2 ml with sterile ultrapure water.\n16. Add 220 µl of the nuclease solution to the 2 ml sample to achieve a final concentration of 0.3 mg/ml RNase and 0.07 mg/ml DNase in 50 mM Tris, 1 mM CaCl2, and 1 mM MgCl2.\n17. Incubate the nuclease-added sample overnight at 37°C with shaking (200 rpm).\nDay 4: Proteinase treatment of EPS\n18. Test the pH of the nuclease-treated sample by placing a few drops of the solution on a pH strip. If the pH is not ∼7.5, adjust by slowly adding either weak acid or base.\nProteinase, added in the next step, requires the sample pH to be within the range of 7-8 for optimal activity.\n19. Prepare 2 ml of proteinase solution by adding 6.6 mg PRONASE to a solution of 100 µl of 1M Tris, pH 7.5, 2 µl of 1 M CaCl2, and 1880 µl sterile ultrapure water to obtain 3.3 mg/ml proteinase in 50 mM Tris, pH 7.5 with 1 mM CaCl2. Sterilize by 0.2-µm syringe filtration and store at 4°C.",
    "20. Add proteinase solution to the nuclease-treated sample at a 1:10 ratio (proteinase:sample). For example, add 240 µl proteinase solution to 2.2-ml nuclease-treated sample. This will achieve a final concentration of 50 mM Tris, 1 mM CaCl2, and 0.33 mg/ml proteinase.\nStore leftover proteinase solution at 4°C for up to 6 months.\n21. Add 2.4 µl of 5% sodium azide to get a final concentration of 0.05% sodium azide.\nThe sodium azide added at this step is to account for the volume of proteinase added in Step 20. Maintaining 0.05% sodium azide ensures that the isolated polysaccharides are not contaminated during the long purification process.\n22. Incubate the proteinase-containing sample overnight at 37°C with shaking (200 rpm).\nThe leftover proteinase can be stored at 4°C for several months.\nDay 5: Ethanol precipitation of EPS\n23. Add another 260 µl proteinase solution and 2.6 µl of 5% sodium azide (0.05% final concentration), then incubate at 37°C for 2 hr with shaking (200 rpm).\n24. Inactivate the proteinase by adding 1 M EDTA, pH 8, to a final concentration of 50 mM EDTA. For example, add 135 µl of 1 M EDTA, pH 8 to ∼2.6 ml nuclease- and proteinase-treated sample.\n25. Mix the EDTA-sample solution on a rotating shaker for 30 min at 4°C.\n26. Add 2 M NaCl to a final concentration of 200 mM. For example, add 273 µl of 2 M NaCl to ∼2.73 ml sample.\n27. Add pre-chilled absolute ethanol at a 1:4 ratio (sample:ethanol) to a final concentration of 80% ethanol. For example, add 12 ml ethanol to ∼3 ml sample.\n28. Leave the sample to precipitate at -20°C overnight.\nSample can be precipitated over several days.\nDay 6: Rehydrating EPS precipitate\n29. Centrifuge the ethanol-precipitated sample for 1 hr at 10,000 × g and 4°C.",
    "30. Carefully remove the supernatant and dry the sample by inverting the tube at a downward angle over clean absorbent paper in a biosafety cabinet for 2 hr.\nInvert the tube in a slanted position to allow air to flow within the tube. The cap of the tube can be used as a base to hold the tube in a slanted position.\n31. Resuspend the pellet in 1.5 ml sterile ultrapure water and incubate at 37°C with shaking (200 rpm) for 1.5 hr to rehydrate the polysaccharides.\n32. [Optional] Transfer the sample to a 25 kD cut-off dialysis membrane and dialyze against 1 L ultrapure water with 0.05% sodium azide for 1-2 hr at room temperature with constant stirring. Use 1 L ultrapure water per 2-3 ml sample.\n33. If dialysis was done in the previous step, change the water with 0.05% sodium azide and dialyze overnight at 4°C with constant stirring. Otherwise, transfer the sample from step 31 to 25 kD cut-off dialysis membrane and dialyze against 1 L ultrapure water with 0.05% sodium azide overnight at 4°C with constant stirring. Use 1 L ultrapure water per 2-3 ml sample.\nDay 7: Freezing of purified EPS\n34. Dialyze the sample again against 1 L ultrapure water with 0.05% sodium azide at room temperature for 8 hr.\nAt this point, take a clean glass vial and record the tare weight.\n35. Transfer the sample to a clean glass vial and freeze at -20°C overnight.\nSample can be stored frozen for several days.\nDay 8: Lyophilization\n36. Remove the tube lid and wrap the opening with parafilm. Then, poke small holes through the parafilm.\n37. Freeze-dry the sample in a lyophilizer for 14-18 hr at ∼0.1 Torr pressure and collector temperature of -40°C.\nDay 9: EPS storage",
    "38. Following freeze-drying, take the dry weight of the lyophilized purified polysaccharide and store at -20°C.\nDry weight of purified extracellular polysaccharide = weight of the vial with the sample – weight of the empty vial",
    "This protocol illustrates a method to quantify extracellular polysaccharides produced by K. pneumoniae. Extracellular polysaccharide purified using Basic Protocol 1 is acid-hydrolyzed by boiling with sodium tetraborate in sulfuric acid. The quantity of uronic acid is detected by conjugating the free hexuronic acids to 3-phenylphenol chromagen. The change in absorbance before and after adding 3-phenylphenol is measured to deduce the concentration of glucuronic acid in the sample (Blumenkrantz & Asboe-Hansen, 1973[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.937#cpz1937-bib-0003]). Measuring the glucuronic acid concentration is an indirect way of quantifying total K. pneumoniae extracellular polysaccharide as it does not quantify neutral sugar content (Anderson et al., 2017[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.937#cpz1937-bib-0002]; Khadka & Ring et al., 2023[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.937#cpz1937-bib-0011]; Mike et al., 2021[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.937#cpz1937-bib-0013]). This protocol provides a quantitative method to measure the amount of extracellular polysaccharide produced by K. pneumoniae.\nMaterials\nPurified extracellular polysaccharides (see Basic Protocol 1)\n3-Phenylphenol (Sigma-Aldrich, cat. no. 262250)\n0.125 M Sodium hydroxide (see recipe)\n0.0125 M Sodium tetraborate in concentrated sulfuric acid (>95%) (see recipe)\nGlucuronic acid standards: 100, 50, 25, 12.5, 6.25, 3.125 µg/ml (see recipe)\nIce-filled bucket\nVortex mixer (e.g., Benchmark Scientific, cat. no. BV1003)\nPipettor and sterile pipette tips (10-20 µl)\nMultichannel pipettor and filter-tips (1000 µl)\nPipette controller (e.g., MIDSCI, cat. no. ASMPIP1)\n10-ml Serological pipettes (e.g., Genesee Scientific, cat. no. 12-104)\nTimer\n1.7-ml microcentrifuge tubes (e.g., Genesee cat. no. 24-282C)\n1.7-ml tube lid locks\nHeat block set to 100°C (e.g., MIDSCI, cat. no. ASDRYBATH5)\n1.5-ml disposable cuvettes (e.g., Fisher Scientific, cat. no. 14-955-127)\nVisible-spectrum cuvette spectrophotometer (e.g., Thermo Scientific GENESYS 30)\nExtracellular polysaccharide purification and preparation\n1. Refer to Basic Protocol 1 for extracellular polysaccharide purification. Record the culture OD600 or determine the colony forming units per ml (CFU/ml) for each sample for downstream normalization. Refer to steps 5 through 8 in Basic Protocol 1 to measure culture OD600.",
    "2. Thaw frozen glucuronic acid standards and stored experimental samples prepared using Basic Protocol 1 at room temperature. In the meantime, prepare 0.3% (3 mg/ml) w/v 3-phenylphenol in 0.125 M NaOH (e.g., 0.003 g 3-phenylphenol in 1 ml of 0.125 M NaOH).\nIMPORTANT! Prepare 3-phenylphenol fresh before the assay. Storage for longer than 1 day can affect the performance of 3-phenylphenol. An alternative name for 3-phenylphenol is 3-hydroxydiphenyl.\n3. Once completely thawed, transfer 200 µl of each glucuronic acid standard to a new, labeled 1.7-ml microcentrifuge tube. Include 200 µl of ultrapure water in a separate tube as a blank.\n4. Vortex the extracellular polysaccharide samples briefly. Then, in a chemical hood, add 1.2 ml of 0.0125 M sodium tetraborate in concentrated sulfuric acid to the 200 µl polysaccharide sample, each glucuronic acid standard, and the blank.\nCAUTION: Follow appropriate safety measures while handling sulfuric acid, such as wearing protective eyewear, gloves, and a lab coat.\n5. Mix by inverting the tubes, then incubate the samples with lid locks at 100°C for 5 min in a heat block.\nIMPORTANT! Proper mixing of solution in the tube is important for consistency in the absorbance measurement.\nCAUTION: Always use lid locks while incubating at 100°C to avoid accidental opening of tubes during incubation.\n6. Cool the samples to room temperature by incubating the tubes in ice for 5 min.\nCAUTION: Do not incubate tubes in ice for too long. Solutions chilled in ice for longer than usual can affect absorbance measurements by producing condensation on the cuvette walls.\n7. Once cooled, transfer the standards and each sample to a labeled cuvette.\n8. Measure the absorbance of the standards and samples at 520 nm after measuring the baseline with the ‘blank’.",
    "9. Add 10 µl of 0.3% (3 mg/ml) w/v 3-phenylphenol in 0.5% (0.125 M) NaOH to each cuvette and mix by gently pipetting up and down.\nCAUTION: Use filter-tips to prevent acid fumes from corroding the pipettor.\nA multichannel pipettor with adjustable tip spacing (e.g., Eppendorf Move It Pipette, cat. no. 3125000206) can speed up the process and improve absorbance reading consistency. A lag time of 20 min or more between the first and the last sample can affect absorbance measurements.\n10. Measure a second round of absorbance at 520 nm for each sample including the ‘blank’.\n11. Calculate the uronic acid concentration as described below:\n         \na. Subtract the first A520 from the second A520 reading to get ΔA520 for every sample, including the blank and standards.\nb. Plot the ΔA520 of each standard and blank on the y-axis and respective uronic acid concentration (in µg/ml) on the x-axis. Calculate the slope and y-intercept from the linear standard curve using y = mx + b, where m is the slope and b is the y-intercept.\nc. Calculate the uronic acid concentration in each sample as:\nUronic acid concentration (µg/ml) = (ΔA520 – y-intercept)/slope\nd. Normalize the uronic acid concentration of each sample to its respective overnight OD600 or CFU/ml.\n12. Calculate total cell-attached and non-attached extracellular polysaccharides (EPS) as described below.\nTotal EPS = Uronic acid in Zwittergent-purified sample\nNon-attached EPS = Uronic acid in ultrapure water-purified sample\nCell-attached EPS = Total EPS – non-attached EPS\n13. Wipe all surfaces that came in contact with sodium tetraborate in sulfuric acid using a damp paper towel and dispose of the hazardous waste following institutional guidelines.",
    "This protocol illustrates an optimized method to visualize purified K. pneumoniae extracellular polysaccharide by SDS-PAGE using a combination of Alcian blue and silver stain. The combination staining protocol was adapted to K. pneumoniae extracellular polysaccharide from previously described methods (Khadka et al., 2023[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.937#cpz1937-bib-0011]; Ovchinnikova et al., 2023[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.937#cpz1937-bib-0014]; Tipton & Rather, 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.937#cpz1937-bib-0016]). Extracellular polysaccharides purified from K. pneumoniae using Basic Protocol 1 are resolved using a gradient SDS-PAGE gel. Polysaccharides are stained with Alcian blue and then enhanced by silver stain. The protocol takes a minimum of 2 days to complete. This protocol is useful for examining extracellular polysaccharide chain length diversity.\nMaterials\nIsolated colonies of any K. pneumoniae strain on a nutrient agar plate [e.g., K. pneumoniae ATCC 43816 (KPPR1) on low-salt LB] (see recipe)\nLow-salt LB broth (see recipe)\n1× phosphate-buffered saline (PBS; sterile or non-sterile)\n1% Zwittergent 3-14 in 100 mM citric acid (see recipe)\nAnhydrous ethanol (e.g., Fisher Scientific, cat. no. A405P-4)\nUltrapure water\n4× SDS-PAGE loading buffer (see recipe)\n4%-15% Mini-PROTEAN TGX Stain-Free Protein Gel (BioRad, cat. no. 4568083)\nTris-glycine-SDS gel running buffer (see recipe)\nPrecision Plus Protein All Blue Prestained Protein Standards (Biorad, cat. no. 1610373)\n0.1% Alcian blue solution (see recipe)\nAlcian blue stain base solution (see recipe)\nPierce Silver Stain Kit (ThermoFisher Scientific, cat. no. 24612)\n10% ethanol (see recipe)\nSilver stain gel fixing solution (see recipe)\nStop solution (5% Acetic acid solution; see recipe)\nPipettor and pipette tips (200 µl and 1000 µl)\n17 × 100-mm sterile aeration culture tubes (or other pertinent culture tube) (e.g., Genesee Scientific, cat. no. 21-131)\n96-well flat-bottom plate (sterile or non-sterile) (e.g., Genesee Scientific, cat. no. 25-104)\n37°C shaking incubator (e.g., New Brunswick INNOVA 44/44R)\nVortex mixer (e.g., Benchmark Scientific, cat. no. BV1003)\nCentrifuge 24 × 1.5/2 ml, ≥17,000 × g (e.g., Eppendorf Centrifuge 5425)",
    "Refrigerated centrifuge 24 × 1.5/2 ml, ≥17,000 × g (e.g., Eppendorf Centrifuge 5425R)\nHeat block set at 50°C (e.g., Eppendorf ThermoMixer C)\nVisible-spectrum microplate reader (e.g., BioTek EPOCH2)\n1.7- and 2-ml sterile microcentrifuge tubes (e.g., Genesee Scientific, cat. no. 24-282C and cat. no. 24-283)\nElectrophoresis cell (e.g., Biorad Mini-PROTEAN Tetra Vertical Electrophoresis Cell; cat. no. 1658004)\nIce-pack able to fit in the electrophoresis cell\nPower supply (e.g., Biorad PowerPac Basic Power Supply; cat. no. 1645050)\nClean staining tray able to fit 8.6 × 6.7 cm gel (glass or plastic)\nBenchtop rotator (e.g., Lab-Line, cat. no. 21580)\nGel imaging system (Syngene G:box Chemi XX6/XX9)\nExtracellular polysaccharide purification and preparation\n1. Refer to Basic Protocol 1, steps 1 through 8, to set up overnight cultures and measure culture density.\n2. Take 1.5 OD600 equivalent of culture in a 1.7- or 2-ml tube.\nFor example, KPPR1 grown in LB for 16 hr has an OD600 of 2.50. The volume of culture equivalent to 1.5 OD600 = 1.5/2.50 = 0.6 ml.\nIf the 1.5 OD600 equivalent culture exceeds 2 ml, consider dividing the sample between two or more 2-ml tubes and proportionately adjust the volume of reagent added to each tube.\n3. Bring the final volume of each sample to that of the largest sample volume used.\nFor example, if the volumes equivalent to 1.5 OD600 of Samples A, B, and C are 0.9 ml, 0.7 ml, and 0.5 ml, then add 0.9-0.7 ml = 0.2 ml and 0.9-0.5 = 0.4 ml of 1× PBS to Samples B and C, respectively.\nGo directly to step 8 if extracting cell-free extracellular polysaccharides. Steps 4 through 7 are required for cell-attached capsular polysaccharides only. These steps wash the cell pellet and remove any extracellular polysaccharide suspended in the supernatant.",
    "4. Centrifuge the normalized samples for 15 min at 21,000 × g and room temperature.\n5. Remove all but 50 µl of the supernatant and resuspend the pellet in 950 µl 1× PBS.\n6. Centrifuge for 15 min at 21,000 × g and room temperature.\n7. Remove 750 µl of the upper supernatant, leaving behind about 250 µl of the pellet and supernatant solution.\n8. Add 50 µl of 1% Zwittergent 3-14 in 100 mM citric acid, pH 2, to a final ratio of 1:5 (Zwittergent:sample) and mix well by inverting the tubes.\nAdding Zwittergent 3-14 in this step extracts cell-attached capsular polysaccharide. Alternatively, add ultrapure water in a 1:5 ratio (water:sample) and go directly to step 10 if extracting cell-free extracellular polysaccharide.\n9. Incubate the Zwittergent-sample mixture at 50°C for 20 min in a heat block.\n10. Centrifuge the mixture for 5 min at 17,000 × g and room temperature.\nMeanwhile, label clean 1.7-ml tubes and add 400 µl ice-cold absolute ethanol. Keep the tubes on ice until you are ready to proceed to the next step.\n11. Carefully transfer 100 µl of the supernatant to the 1.7-ml tube containing 400 µl absolute ethanol (80% final ethanol concentration) and mix by inverting the tube.\nA visible white precipitate may be observed depending on the polysaccharide amount present in the supernatant.\n12. Incubate the supernatant-ethanol containing tube on ice for 20 min.\nTubes can be incubated on ice for longer than 20 min. Longer incubation should not affect the polysaccharide purification.\n13. Centrifuge the tubes for 5 min at 17,000 × g and 4°C.\n14. Decant the supernatant carefully and let the tubes dry at room temperature for 5-10 min.\n15. Add 200 µl ultrapure water to the tubes and vortex for 5-10 s.",
    "16. Incubate the tubes at 37°C for 30 min to solubilize the polysaccharides and vortex again before proceeding to the next step.\n17. In a new set of tubes containing 25 µl of 4× SDS-PAGE loading buffer, add 75 µl purified polysaccharide solution and vortex briefly.\nPause Point: At this point, the purified polysaccharide samples and polysaccharide-containing loading buffer samples can be stored at -20°C or immediately advanced to the next step.\nSDS-PAGE of purified extracellular polysaccharide\n18. Take the tape off the bottom of a pre-cast 4%-15% SDS-PAGE gel and fit the gel in a running module. Insert the running module into the electrophoresis cell.\n19. Add the ice pack to the electrophoresis cell and fill the tank to the top or ‘4 gels’ mark with Tris-Glycine-SDS gel running buffer.\n20. Clean the wells by flushing them with running buffer using a P1000 pipette. Gently pipette the running buffer up and down to clean the wells.\n21. Load 20 µl sample into the respective well and include one well with 12-15 µl Precision Plus Protein All Blue Prestained standards as a molecular weight marker.\n22. Transfer the gel-fitted electrophoresis cell to a bucket filled with ice. Cover the four sides of the electrophoresis cell with ice to keep it cold.\n23. Transfer the ice-filled bucket containing the prepared apparatus with electrophoresis cell to a 4°C refrigerator or cold room.\n24. Connect the electrophoresis cell to a power supply and run the gel at 300 V for 4-5 hr.\nStaining of extracellular polysaccharide with Alcian blue\n25. Following SDS-PAGE, carefully remove the gel from the cassette and transfer it to a box containing 200 ml ultrapure water. Wash the gel in ultrapure water for 10 min, a total of five times.",
    "26. Stain the gel with 25-30 ml of 0.1% Alcian Blue Stain (or volume enough to cover the gel) at room temperature for 1 hr on a shaker.\n27. Quickly wash the gel with Stain Base Solution to remove excess stain.\n28. Once excess stain is removed, de-stain with 100-200 ml Stain Base Solution overnight at room temperature on a shaker.\nSet the shaking speed at minimum to prevent Stain Base Solution from spilling over.\nStaining with Pierce Silver Stain Kit\n29. Prepare Gel Fixing Solution, 10% ethanol, and Stop Solution in advance.\n30. Slowly drain the Stain Base Solution used for de-staining the gel and wash the gel twice in ultrapure water for 5 min.\n31. Remove ultrapure water and add Gel Fixing Solution (30% ethanol:10% acetic acid) for 15 min. Repeat the process a total of two times.\nPause Point: The gel can be kept in the Fixing Solution overnight or immediately advanced to the next step.\nIn step 33 and the following steps, add sufficient reagent volume to cover the whole gel. The volume required will depend on the size of the staining tray and gel. Generally, 25 ml is enough to cover an 8.6 × 6.7-cm gel in a 4.5 × 3.4 × 1.1-in box.\n32. Wash the gel twice in 10% ethanol.\n33. Wash the gel twice in ultrapure water for 5 min.\nWhile the gel is being washed, prepare Sensitizer Working Solution: 25 ml Sensitizer Solution (enough for one mini-PROTEAN gel) is prepared by mixing 50 µl (1 part) Silver Stain Sensitizer and 25 ml (500 parts) ultrapure water.\n34. Incubate the gel in Sensitizer Working Solution for 1 min, then wash twice with ultrapure water for 1 min.",
    "35. Prepare 25 ml Stain Working Solution per gel by mixing 0.5 ml (1 part) Silver Stain Enhancer with 25 ml (50 parts) Silver Stain.\n36. Incubate the gel in Stain Working Solution for 30 min.\nPause Point: The gel can be left in the Stain Working Solution for 5 min to overnight without a significant impact on stain performance.\nWhile the gel is being stained, prepare 25 ml Developer Working Solution by mixing 0.5 ml Silver Stain Enhancer and 25 ml Silver Stain Developer. Also, make sure that the Stop Solution is prepared.\n37. Quickly wash the stained gel twice with ultrapure water for 20 s.\n38. Add Developer Working Solution and incubate with gentle shaking until dark brown bands start to appear.\nBands might start appearing as quickly as 10 s. Keep the Stop Solution close so band development can be stopped immediately. Add Stop Solution shortly before the bands reach the desired band intensity, as the bands will continue to develop briefly after the Stop Solution is added. After 3 min, background signals might reach an undesirable level and mask polysaccharide bands.\n39. When the desired contrast between polysaccharide bands is reached, discard the Developer Working Solution and immediately wash the gel with Stop Solution.\n40. Add 25 ml Stop Solution and incubate the gel for 10 min before imaging.\nGel imaging\n41. Lay the gel on the white reflective plate of a Syngene G:box.\n42. Select the ‘Silver Stain’ imaging program within the ‘Visible Protein Gel’ settings of the Syngene G:box.\n43. Capture the image.\nOnce the image is captured, adjust the settings and/or zoom to get the desired image.",
    "This protocol presents a robust and precise method for quantifying mucoviscosity in K. pneumoniae through a sedimentation resistance assay. Increased mucoidy is speculated to increase the drag forces on the bacteria, increasing sedimentation resistance. However, this hypothesis necessitates experimental validation. The procedure encompasses culturing the bacterium, conducting low-speed centrifugation, and quantifying absorbance at OD600. By adhering to these systematic instructions, researchers can confidently achieve consistent mucoviscosity measurements and discern hypermucoid K. pneumoniae strains. This assay serves as a valuable tool for characterizing the virulence potential and pathogenicity of different bacterial isolates, aiding in studying K. pneumoniae infections.\nMaterials\nIsolated colonies of any K. pneumoniae strain on a nutrient agar plate [e.g., K. pneumoniae ATCC 43816 (KPPR1) on low-salt Luria-Bertani] (see recipe)\nLow-salt LB broth (see recipe)\n1× phosphate-buffered saline (PBS; sterile or nonsterile)\nPipettor and sterile pipette tips (200 µl and 1000 µl)\n17 × 100-mm sterile aeration culture tubes (or other pertinent culture tube) (e.g., Genesee Scientific, cat. no. 21-131)\n37°C shaking incubator (e.g., New Brunswick INNOVA 44/44R)\n2-ml microcentrifuge tubes (e.g., Genesee Scientific, cat. no. 24-283)\n1.5-ml disposable, 1-cm cuvettes (e.g., Fisher Scientific, cat. no. 14-955-127)\nVisible-spectrum cuvette spectrophotometer (e.g., Thermo Scientific GENESYS 30)\nCentrifuge 24 × 1.5/2 ml, ≥17,000 × g (e.g., Eppendorf Centrifuge 5425)\nSetting up overnight cultures of KPPR1\n1. Inoculate a single colony of KPPR1 into three 17 × 100-mm culture tubes containing 3 ml low-salt LB broth. Incubate overnight at 37°C with aeration and continuous shaking (200 rpm) at a 60° angle.\nGrowing the cultures at a 60° angle produces optimal mucoviscosity in strain KPPR1.\nMeasuring overnight culture density\n2. Briefly vortex the overnight cultures and transfer a 100 µl sample to a 1.5 ml disposable cuvette filled with 900 µl of PBS. Mix thoroughly by pipetting.",
    "3. Measure the culture density (OD600) of the sample. Subtract the blank value and multiply by 10 to account for the 1:10 dilution. The resulting value is the OD600 of the overnight culture.\nSedimentation resistance measurement\n4. Gently vortex the overnight cultures and transfer 1 OD600 unit to a 2-ml tube.\nFor example, a KPPR1 wild-type strain grown in LB for 16 hr has an OD600 value of 2.5. The volume of culture equivalent to 1 OD unit = 1/2.5 = 0.4 ml of sample. Use the OD600 measured in step 3 to calculate 1 OD600 unit culture.\n5. Add 1× PBS to the 2-ml tube for a final volume of 1 ml. Mix the contents thoroughly by vortexing.\nAlternatively, if 1 OD600 unit exceeds 1 ml of culture volume, transfer 0.5 OD600 culture in step 4 and add 1× PBS to get a final volume of 1 ml in step 5. At the final step, calculate the sedimentation resistance as supernatant OD600 per 0.5 OD600 unit.\n6. Centrifuge the sample for 5 min at 1000 × g and room temperature to pellet the bacterial cells.\n7. Transfer 900 μl of the upper supernatant into a cuvette.\nHandling the tubes carefully during pipetting without disturbing the pellet is crucial to avoid overestimating the supernatant OD600. To achieve this, maintain the tube at an angle of 40-45°, slightly below eye level, with the corner containing the pellet facing upward. This provides optimal separation of the supernatant and pellet, facilitating pipetting. While pipetting, gradually lower the pipette tip from the top to the bottom of the tube, gently drawing up the supernatant following the top surface of the supernatant. This prevents inadvertent pipetting of the pellet. See Figure 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.937#cpz1937-fig-0002] for an illustration of this process.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/884eb595-75e2-4229-85c8-079980a4a1c3/cpz1937-fig-0002-m.jpg</p>\nFigure 2",
    "Illustration of optimal handling positions to pipette the supernatant in the sedimentation resistance assay. (A) Tube is held at about 40-45° and the pellet-containing side of the tube is facing upwards. (B) Supernatant pipetting is started with the pipette tip just beneath the liquid surface then gradually going down to the tube bottom as the supernatant is pipetted. The pipette tip should always follow the top surface of the supernatant during pipetting.\n8. Measure the OD600 of the supernatant.\n9. Calculate the sedimentation resistance by taking the supernatant OD600 and dividing by the total OD600.",
    "This alternate protocol describes the adaptation of the cuvette-based sedimentation resistance assay (Basic Protocol 5) to a 96-well plate-based format. A K. pneumoniae strain of interest is cultured overnight in liquid growth medium. Following incubation, the culture density represented by absorbance at 600 nm is measured in a 96-well plate reader. An equal density of culture is centrifuged at slow speed, and the density of cells (OD600) remaining in the supernatant is measured using a 96-well plate reader. This protocol requires following appropriate biosafety measures for working with a biosafety level-2 agent, such as K. pneumoniae. Generally, an increase in mucoviscosity is associated with increased sedimentation resistance. This adaption of Basic Protocol 5 provides an efficient way to measure mucoviscosity for a large number of strains.\nAdditional Materials\n96-well flat-bottom plate (sterile or non-sterile) (e.g., Genesee Scientific, cat. no. 25-104)\nVisible-spectrum microplate reader (e.g., Biotek EPOCH2)\nMultichannel pipettor and pipette tips (200 or 300 µl) (e.g., USA Scientific, cat. no. 7112-3300)\n12-well V-bottom reservoir (e.g., USA Scientific, cat. no. 3823-3412)\nSetting up overnight cultures of KPPR1\n1. Take three (for triplicate data measurement) 17 × 100-mm culture tubes and label appropriately. Include one additional tube as a negative growth control.\n2. Add 3 ml low-salt LB broth to each tube.\nIf plasmid maintenance is critical to the strain, add the plasmid-relevant antibiotic (or other agent) to maintain selection pressure. However, it is important to use appropriate controls to ensure that the added agent does not affect the phenotype under study.\n3. Suspend one colony of KPPR1 in each tube except the negative growth control tube. Place the cap in the venting position to allow for aeration.\n4. Incubate the tubes at 37°C and 200 rpm for 16-18 hr in a 37°C shaking incubator.",
    "It is critical to incubate the tubes at 60° inclination to allow for aeration. Changes in aeration can affect mucoviscosity.\nMeasuring overnight culture density\n5. Take a 96-well flat-bottom plate and transfer 270 µl of 1× PBS into three wells. Transfer 300 µl of 1× PBS to three additional wells for blank correction.\n6. Briefly vortex the tubes and pipette 30 µl of the culture into the respective wells containing 270 µl of 1× PBS. Mix well by pipetting up and down 5-6 times.\nHypermucoviscous K. pneumoniae strains may not readily mix. Thus, ensuring that the culture is properly mixed with PBS is important. If required, mix the culture by pipetting up and down for longer than usual.\n7. Take the OD600 of the diluted samples in a 96-well plate reader.\n8. Calculate the overnight OD600 of the culture:\n         \nOD600 = (Sample OD600 – Blank OD600) × dilution factor × plate to cuvette conversion factor\n= (Sample OD600 – Blank OD600) × 10 × 1.181599\nSample OD600: Absorbance of overnight sample at 600 nm\nBlank OD600: Absorbance of 300 µl 1× PBS at 600 nm\nDilution factor: Ratio of total volume (culture + PBS) to culture volume used (i.e., 10, if 30 µl sample is mixed with 270 µl 1× PBS)\nPlate to cuvette conversion factor: Converts absorbance reading from 96-well plate to 1-cm cuvette absorbance (1.181599). This value should be validated for each plate reader. Refer to Support Protocol 5 for conversion factor determination.\nMeasuring sedimentation resistance\n9. Transfer 1 OD600 unit of gently vortexed overnight culture into a 2-ml tube and bring the final volume to 1000 µl with LB or the culture medium used to grow the bacteria.",
    "Use the OD600 calculated in Step 8 to determine the volume of culture equivalent to OD600 = 1. For example, a KPPR1 wild-type strain grown in LB for 16 hr has an OD600 value of 2.327. The volume of culture equivalent to 1.0 OD600 = (1000 * 1.0)/2.327. Here, 1000 (µl) is the final volume of culture when mixed with diluent.\nFor low-yield strains or culture conditions, 0.5 OD600 equivalent of culture volume can be used instead of 1.\n10. Centrifuge the tubes for 5 min at 1000 × g and room temperature.\nIt is important to be careful while removing tubes from the centrifuge to avoid disturbing the pellet, which can affect the mucoviscosity measurement.\n11. Transfer 900 µl of the upper supernatant from the tube to a divided multichannel pipette reservoir. After transferring to the reservoir, pipette the supernatant up and down 5-6 times to mix well.\nIt is crucial to handle the tubes with care during pipetting without disturbing the pellet to avoid overestimating the supernatant OD600. To achieve this, maintain the tube at an angle of 40-45°, slightly below eye level with the corner containing the pellet facing upward. This provides optimal separation of the supernatant and pellet, facilitating pipetting. While pipetting, gradually lower the pipette tip from the top to the bottom of the tube, gently drawing up the supernatant following the top surface of supernatant. This prevents inadvertent pipetting of the pellet. See Figure 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.937#cpz1937-fig-0002] for an illustration of this process.\n12. Take a 96-well plate and transfer 300 µl of the well-mixed supernatant from the reservoir to a clean microplate well. Include 300 µl LB (or any other diluent used in step 9) in three wells as blanks.\n13. Take the OD600 of the samples in a 96-well plate reader.",
    "14. Calculate the supernatant OD600 of the sample as described below.\n         \nSupernatant OD600 = (Sample OD600 – Blank OD600) × plate to cuvette conversion factor\n= (Sample OD600 – Blank OD600) × 1.181599\nSample OD600: Absorbance of supernatant at 600 nm\nBlank OD600: Absorbance of 300 µl LB (or any other diluent used in step 9) at 600 nm\nPlate to cuvette conversion factor: Converts absorbance reading from 96-well plate to 1-cm cuvette absorbance (1.181599). This value should be validated for each plate reader. Refer to Support Protocol 5 for conversion factor determination.\n15. Calculate the average and standard deviation of the triplicate values and plot the mucoviscosity value as ‘supernatant OD600 per 1 OD600 culture’ or ‘supernatant OD600 per 0.5 OD600 culture’ depending on the density of the overnight culture used in Step 9.",
    "This support protocol outlines the method to establish a ‘conversion factor’ that effectively correlates OD600 readings obtained from a 96-well plate and to a 1-cm cuvette. The process involves making a serial dilution of the bacterial culture and measuring the OD600 using both the microplate reader and cuvette spectrophotometer. By comparing the readings from the two instruments across different dilutions, a conversion factor is determined. The protocol involves the use of a biosafety level 2 pathogen, so appropriate biosafety measures must be followed while handling the organism. The protocol provides a valuable means of converting OD600 readings between systems, thereby enabling the adaptation of cuvette-based lab techniques to a 96-well plate format. This adaptation allows assessment of large numbers of samples at a time.\nAdditional Materials\n96-well flat-bottom plate (sterile or non-sterile) (e.g., Genesee Scientific, cat. no. 25-104)\nVisible-spectrum microplate reader (e.g., BioTek EPOCH2)\nMultichannel pipettor and pipette tips (200 or 300 µl) (e.g., USA Scientific, cat. no. 7112-3300)\n12-well V-bottom reservoir (e.g., USA Scientific, cat. no. 3823-3412)\n1.5-ml disposable, 1-cm cuvettes (Fisher Scientific, cat. no. 14-955-127)\n15-ml sterile conical tube (e.g., Griener Bio-One CELLSTAR, cat. no. 181-271)\nVisible-spectrum cuvette spectrophotometer (e.g., Thermo Scientific GENESYS 30)\nConversion of plate OD600 to cuvette OD600\n1. Inoculate a single isolated colony of KPPR1 in 4 ml LB and incubate at 37°C with shaking (200 rpm), overnight.\n2. Transfer 1 ml of well-vortexed overnight culture to a clean cuvette and measure the OD600 in a spectrophotometer; this is what is referred to as ‘100%’.\nLet us assume the OD600 of the ‘100%’ sample is 3.\n3. Serially dilute the sample 1:1 with 1× PBS 10 times to achieve a dilution range from 100% to 0.1953%. Repeat this step to include three sets of dilutions (set A, B, C; triplicate measurement).",
    "Serial dilution: Transfer 3 ml of ‘100%’ OD600 culture to a 15-ml conical tube, then transfer 1.5 ml culture from the ‘100%’ tube to a clean 15-ml tube labeled ‘50%’ containing 1.5 ml of 1× PBS and mix well. Similarly, transfer 1.5 ml diluted culture from the ‘50%’ tube to a 15-ml tube containing 1.5 ml of 1× PBS labeled ‘25%’. Continue halving the dilution until ‘0.1953%’ is achieved.\n4. Transfer 1 ml of each dilution with three replicates to clean 1-cm cuvettes and measure the OD600. Use 1× PBS as a blank.\nSuppose the cuvette OD600 of ‘6.25%’ in sets A, B, and C are 0.172, 0.173, and 0.117, respectively.\n5. From each dilution tube, transfer 300 µl to a clean 96-well plate, then measure the OD600 in a microplate reader. Include 300 µl of 1× PBS in three wells as a blank.\nSuppose the plate OD600 of ‘6.25%’ in sets A, B, and C are 0.175, 0.173, and 0.139, respectively. Similarly, let us suppose the average plate OD600 of all three blanks is 0.038.\n6. Take the average of the three sets for each dilution.\nAverage cuvette OD600 of ‘100%’ = (0.172+ 0.173+ 0.117)/3 = 0.154\nAverage plate OD600 of ‘100%’ = [(0.175– 0.038) + (0.173– 0.038) + (0.139– 0.038)]/ 3 = 0.124\n7. Plot the % dilution on the x-axis and the cuvette OD600 on the y-axis. Identify the linear range.\nRefer to Figure 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.937#cpz1937-fig-0003] for an example plot.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/d2f2efb8-8bb2-415a-b823-d8a44c6d1b06/cpz1937-fig-0003-m.jpg</p>\nFigure 3\nPlot illustrating OD600 of different culture dilutions measured by cuvette spectrophotometer and microplate reader. The gray dotted box represents data points in the linear range with R2 ≥0.9999 used for calculating conversion factor. Red boxes indicate OD600 measured by microplate reader and blue closed circles indicate OD600 measured by cuvette spectrophotometer.",
    "8. Plot the % dilution on the x-axis and the plate OD600 on the y-axis. Identify the linear range.\nRefer to Figure 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.937#cpz1937-fig-0003] for an example of the plot.\n9. For each % dilution that falls in the linear range for both cuvette and microplate measurements, calculate the cuvette OD600/plate OD600 ratio.\nCuvette OD600/plate OD600 of ‘6.25%’= 0.154/ 0.124 = 1.24\n10. Calculate the conversion factor using the following equation.\nConversion factor = Average of ‘average cuvette OD600/plate OD600’ of each dilution in the linear range\n= [Average cuvette OD600/plate OD600 of ‘6.25%’ + ‘3.125%’ + ‘1.5625%’ + …]/N\nThe conversion can then be used to convert 300 μl, OD600 readings from the plate reader to standard 1-cm cuvette readings only if the OD600 falls in the linear range of both instruments."
  ],
  "subjectAreas": [
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}