{
  "id": 2430,
  "origin_website": "Cell",
  "title": "Dissociation and reaggregation of Hydra vulgaris for studies of self-organization",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPrepare Hydra for incubation in dissociation medium\nTiming: ∼4 h\nExperimental animals are collected, thoroughly washed in Hydra media and ice-cold ddH2O, resuspended in ice-cold relatively isosmotic dissociation media, and then incubated at 4°C before dissociation. Methods Videos S1[href=https://www.wicell.org#mmc1] and S2[href=https://www.wicell.org#mmc2] accompany this part of the protocol.\nCollect 50–70 non-budding Hydra (Figure 2[href=https://www.wicell.org#fig2]).\nUsing an unpolished Pasteur pipette, collect Hydra in a 3.5 cm dish or one well of a 6-well plate. Hydra can be detached with gentle pipette aspiration and tend to settle and reattach rapidly once fluid flow has stopped (including reattaching inside the pipette, if the transfer is not immediate).\nSizes should be roughly representative of the distribution of sizes in the parent dish.\nBudding Hydra can be used with no adverse effects on experimental outcome, but are generally excluded to maintain a faster rate of colony growth.\nNote: This protocol is optimized for 50–70 Hydra. With lower densities the dissociation will be more difficult, and with higher densities a larger proportion of ‘clumps’ or chunks of tissue following dissociation complicates the procedure. Troubleshooting 1[href=https://www.wicell.org#troubleshooting] and 3[href=https://www.wicell.org#troubleshooting].\nPause point: Provided they haven’t been fed within the last 24 h, collected Hydra can remain in their new dish another 24 h before proceeding to step 2.\nWash Hydra 5× with 21°C–25°C Hydra media (Methods Video S1[href=https://www.wicell.org#mmc1]).\nRemove ∼75%–90% of the original Hydra media with a clean 15 cm Pasteur pipette.\nUsing a Hydra media squirt bottle, aggressively spray Hydra feet attached to the near-empty dish with the goal of detaching as many Hydra from the surface as possible.",
    "As the well of the dish begins to fill, angle and stabilize the stream of the bottle to form a whirlpool to collect the Hydra in the middle of the dish to make media removal easier.\nCollect and dispose of as much floating debris as possible while the Hydra are grouped in the middle of the dish after the whirlpool. Troubleshooting 2[href=https://www.wicell.org#troubleshooting].\nNote: Hydra foot substrate attachment typically involves secretion of adhesive compounds (Rodrigues et al., 2016[href=https://www.wicell.org#bib12]), and bacterial biofilms have a tendency to form around the feet (Augustin et al., 2017[href=https://www.wicell.org#bib1]). As much of this debris as possible should be removed. In rare cases, during this step a tentacle or two or pieces of Hydra cuticle may detach, and should be removed as well.\nCritical: In addition, scraping the plastic bottom of any culture dishes with the Pasteur pipette during Hydra transfer can shred pieces of highly-autofluorescent plastic into the media, which will reaggregate with Hydra tissue if not removed (Figure 2[href=https://www.wicell.org#fig2]).\nRepeat the process 4 times until Hydra are thoroughly cleaned and debris is removed.\nOptional: Repeat wash steps until all debris is removed from media.\nWash Hydra 4× with 0°C ddH2O (Methods Video S2[href=https://www.wicell.org#mmc2]).\nUse a glass 250 mL Erlenmeyer flask to cool the ddH2O rapidly. Thaw dissociation media in a 500 mL graduated cylinder filled with a bit of warm water or prepare fresh from concentrated 20× stock solutions. Be sure to check any thawed tubes for precipitate and vortex to re-dissolve as needed. Place on ice to bring to 0°C.\nAs above, wash Hydra with decanted 0°C ddH2O using a glass Pasteur pipette to agitate the Hydra, create a whirlpool to collect Hydra in the center of the dish, then remove media.",
    "Critical: It is important to work rapidly during this step to minimize damage to Hydra. Prolonged exposure to low osmolarity media devoid of calcium leads to the animal’s eventual disintegration. Ideally, by the final wash Hydra will be on the verge of disintegration, and perhaps some have lost a tentacle or two, but should otherwise look the same as at the start of the wash.\nCritical: Terminate the experiment if large chunks or wisps of Hydra tissue appear in the media, or if the media clouds, a sign premature disintegration and osmotic shock-induced damage to cells. Troubleshooting 3[href=https://www.wicell.org#troubleshooting].\nNote: A helpful sub-experiment here includes leaving a hydranth or two behind in ddH2O during the next step to see how they respond to extended incubation and manipulation in the lab’s source of ultrapure water. Note that Hydra will appear contracted with a slightly ‘rough/fuzzy’ outline as they begin to disintegrate, at which point it is too late to use them for reaggregation. Anything beyond ‘early depression’ in Johnson and Gabel’s Hydra Health Index should not be used in experiments (Bossert and Galliot, 2012[href=https://www.wicell.org#bib3]; Johnson and Gabel, 1982[href=https://www.wicell.org#bib9]).\nSuspend Hydra in dissociation media and incubate at 4°C (Methods Video S2[href=https://www.wicell.org#mmc2]).\nAfter the last ddH2O replacement, collect Hydra in the center of the dish by gently whirlpooling them with Pasteur pipette and transfer to a pre-chilled 1.5 mL microcentrifuge tube, minimizing ddH2O carryover.\nLet Hydra sediment to the bottom of the tube and remove as much media as possible.\nUsing a Pasteur pipette, bring the volume of the tube to 1.5 mL with ice-cold dissociation media to dilute the remaining H2O and again allow Hydra to settle before removing as much media as possible.",
    "Again bring the volume of the tube to approximately 1.5 mL with ice-cold dissociation media. Aspirate the Hydra approximately 10 times into and from the pipette, ideally just to the point where fragments of cuticle or detached tentacles appear (Refer to the beginning of Methods Video S3[href=https://www.wicell.org#mmc3] for mild trituration technique).\nNote: Detached tentacles are not a cause for concern – some protocols even call for the removal of heads/tentacles and basal disks from Hydra before dissociation, although we have found this unnecessary (Soriano et al., 2009[href=https://www.wicell.org#bib15]; Cochet-Escartin et al., 2017[href=https://www.wicell.org#bib4]). Furthermore, altering the composition of aggregates with biases toward particular body structures (e.g., aggregates composed solely of anterior or posterior halves) produces aggregates with strikingly different phenotypes (Gierer et al., 1972[href=https://www.wicell.org#bib7]).\n    Your browser does not support HTML5 video.\n  \nMethods Video S3. Hydra dissociation (steps 5 and 6)\nAfter incubation Hydra are triturated with ∼20 plunges until the media begins to cloud, indicating the start of the dissociation. Dissociation media is replaced a final time and Hydra are triturated with 60 plunges until the media becomes opaque, monitoring media in the tube and pipette against a bright backdrop. After dissociation, tissue chunks are left to sediment on ice for 1 min.\nAs before, allow the Hydra to settle at the bottom of the tube and remove as much media and debris as possible without disturbing the Hydra. Resuspend in roughly 1.3–1.5 mL fresh, ice-cold dissociation media, leaving empty space at the top of the tube to create a bubble to allow agitation of Hydra with inversion of the tube.\nResuspend and redistribute the Hydra by inverting the closed tube several times. Place the tube on its side in a 4°C refrigerator to avoid collection of Hydra at the bottom of the tube.",
    "As before, replace dissociation media every half hour, a total of three times before completion of the 2-h 4°C incubation. Before every replacement, aspirate the Hydra gently, depending on the amount of tissue debris, around 10 times before allowing the animals to sediment, removing as much media as possible, adding fresh media to 1.3–1.5 mL and redistributing the Hydra by inverting the closed tube, as before.\nNote: During this gentle trituration/aspiration, media should remain mostly clear aside from a slight bit of debris from either detached cuticle or tentacles. Individual cells that would cloud the media should not be liberated at this time.\nPause point: The four thirty-minute breaks between media exchanges allow completion of other tasks, although the last break can be devoted to preparing materials for the next step, initially described in ‘Before You Begin’ step 4c.\nCritical: Work steadily and rapidly during the ice-cold ddH2O washes (Methods Video S2[href=https://www.wicell.org#mmc2]). Prolonged exposure here can lead to disintegration of Hydra into the highly hypoosmotic solution. A moderate amount of rigor during the washes and transfer is thought to loosen tissue to allow relatively isosmotic dissociation media penetrate during the incubation. Troubleshooting 3[href=https://www.wicell.org#troubleshooting].\n    Your browser does not support HTML5 video.\n  \nMethods Video S1. Cleaning Hydra pre-dissociation (step 2)\nHydra are collected from their culture dish and placed in one well of a 6-well plate. Media is aggressively sprayed from a squirt bottle first to detach Hydra, then at a constant angle to create a vortex to guide Hydra to the center of the well. Media is then removed with the pipette, and debris is collected for removal during the process, which is repeated 4 times after the first replacement.\n    Your browser does not support HTML5 video.",
    "Methods Video S2. Washing Hydra with ddH2O and replacing with dissociation media for incubation (steps 3 and 4)\nIce-cold ddH2O is decanted from the flask and Hydra are vortexed with the pipette toward the center of the plate, as before, working at a rapid, constant pace. ∼75% of the ddH2O is removed and the process is repeated 3 times. Hydra are vortexed during the 4th wash, and removed from the well and placed in a pre-chilled 1.5 mL microcentrifuge tube, minimizing ddH2O carryover. Excess ddH2O is removed and ice-cold dissociation media is added to the tube to 1.5 mL. As much of this media is removed and replaced again with dissociation media. Hydra are triturated 10 times and the dissociation media is replaced again before 4°C incubation.\nDissociate Hydra\nTiming: ∼ 1 h\nPre-treated Hydra are partially dissociated, media is exchanged, and then Hydra are fully dissociated by mechanical trituration. Cell suspension is collected, and cells are counted and then seeded into tubes for sedimentation and reaggregation. Methods Videos S3[href=https://www.wicell.org#mmc3] and S4[href=https://www.wicell.org#mmc4] accompany this part of the protocol.\nExchange the dissociation media a final time after a pre-dissociation (Methods Video S3[href=https://www.wicell.org#mmc3]).\nCollect the Hydra-containing tube from the 4°C incubation and place on ice.\nCompressing the bulb, angle the tip of an unpolished, fresh Pasteur pipette toward the bottom of the microcentrifuge tube containing the Hydra, resting the side of the pipette against the lip of the tube opening, and placing the bore of the pipette as close to the bottom as possible without creating a seal.",
    "Note: It is thought that the sharp edge of a fresh pipette provides a measure of standardization and helps shear the Hydra during dissociation, which may not progress as planned if the tip is flame-polished or is gummed with debris from previous use. Substitution of other trituration instruments (e.g., plastic transfer pipettes, P1000 tips) is theoretically possible but will require further optimization. Troubleshooting 1[href=https://www.wicell.org#troubleshooting].\nDraw approximately 90% of the contents of the tube (media, animals) into the pipette, and expel the contents, holding the same angle of the pipette tip, without emptying the entire volume to avoid the production of bubbles.\nNote: More volume can be drawn into the Pasteur pipette by stretching a compressed bulb before insertion into the incubation tube. Ideally one is able to draw approximately 90% of the contents into the pipette, to maximize the trituration of tissue.\nRepeat this process 10–20×, maintaining the angle of the pipette and avoiding the generation of bubbles with the pipette, until the media starts to cloud, indicating the start of the dissociation of the animal. A rate of approximately one complete plunging cycle per second is a good benchmark.\nAllow the animals to sediment and replace the now slightly cloudy dissociation media with fresh dissociation media before the actual dissociation, noting the volume of intact animal tissue at the bottom of the microcentrifuge tube (Figure 4[href=https://www.wicell.org#fig4]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1915-Fig4.jpg\nFigure 4. Hydra before and after dissociation\n(A) ∼70 pre-dissociation Hydra sedimented at the bottom of a 1.5 mL microcentrifuge tube prior to the final pre-dissociation media exchange. Note the volume of cells prior to dissociation and the slight cloudiness of the media from ∼20 pre-dissociation pipette plunges to bring the animals to the verge of dissociation.",
    "(B) Sedimented Hydra tissue fragments post-dissociation. Note again the volume of the fragments. Ideal trituration (in this case, 60 plunges of the Pasteur pipette) aims to dissociate between 2/3 and 3/4 of the initial volume of Hydra. Note also the increased cloudiness of the media compared to A and Figure 6[href=https://www.wicell.org#fig6]A.\nNote: The goal for the next step is to optimally capture the most cells with the fewest number of plunges, beginning the actual cell collection as the rate of cell dissociation begins to rapidly increase. This sacrifices some dissociated cells from this step that would otherwise be over-triturated and potentially not viable in aggregates.\nDissociate the Hydra into individual cells (Methods Video S3[href=https://www.wicell.org#mmc3]).\nAs before, expel air from the plunger and insert the pipette into the tube in the position described above. Draw approximately 90% of the contents into the pipette and expel, as before, avoiding bubbles.\nRepeat the process 50–100×, until the media is nearly opaque.\nNote: A bright background (e.g., performing the dissociation next to an open window) helps monitor progress – the cloudiness of the media is more easily observed in the microcentrifuge tube and pipette.\nCritical: It is important to be firm with the pipetting so the tissue actually dissociates. A fair amount of tissue damage is expected, and in most cases aggregates will recover, even with massive cell death during the process. Dying cells are eventually sorted and excluded from the regenerating animal. Conversely, overly-aggressive pipetting can lead to levels of cell death that cannot be overcome. Again, a rate of approximately one complete plunging cycle per second is a good benchmark. Troubleshooting 3[href=https://www.wicell.org#troubleshooting].\nSediment tissue fragments on ice, collect the cell supernatant (Methods Video S4[href=https://www.wicell.org#mmc4]).\nPlace the tube containing dissociated Hydra on ice for 1 min.",
    "Critical: Check the final volume of the undissociated tissue fragments. A good benchmark is 1/4 to 1/3 of the volume of tissue compared to the volume immediately prior to dissociation (Figure 4[href=https://www.wicell.org#fig4]B). Volumes larger than this may indicate incomplete dissociation and potential unrepresentative ratios of epithelial cells. Volumes less than this may indicate over-trituration with levels of cell death that will not allow regeneration.\nRinse the pipette tip to remove any residual adherent tissue fragments and carefully collect the cell-containing supernatant, taking care to not disturb the tissue sediment.\nNote: Longer sedimentation times will allow increasingly smaller tissue fragments to fall out of suspension, at the expense of individual dissociated cells that sediment during the time period as well.\nCount the cells using the hemocytometer.\nGently resuspend the cell suspension in the 1.5 mL tube with the Pasteur pipette to homogenize and add one drop to each side of the hemocytometer.\nNote: Drops should be placed directly on the counting grid as opposed to using the capillary action of the divots of the hemocytometer as larger chunks of cells, if present, may not be pulled to the measuring grid (Figure 5[href=https://www.wicell.org#fig5]A). Troubleshooting 5[href=https://www.wicell.org#troubleshooting].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1915-Fig5.jpg\nFigure 5. Counting of dissociated Hydra cells\n(A) Cell suspension is placed directly onto the counting chamber, as opposed to using the capillary action of the divots on the top and bottom of the chamber, as might be done with standard laboratory cell lines. This ensures any larger tissue fragments that might not be pulled into the counting chamber via capillary action don’t lead to underestimating the concentration of the cell suspension.\n(B) The coverslip of the counting chamber is placed directly onto the cell suspension gently, as opposed to positioning it before loading cells via capillary action.",
    "(C) Approximately ∼250 cells are present in the 5 × 5 0.1 μL counting grid, leading to a final concentration of 2.5 million cells/mL. Note the diversity of cell types and sizes and that interstitial cells are much smaller and much more transparent than epitheliomuscular cells, the darkest of which are the endodermal cells (highlighted here in red, as the dissociation was performed on a Hydra line expressing RCaMP in the endodermal cell linage. Scale bar 200 μm.\nCount the cells to determine the concentration. Note any clumps of cells, if present.\nA representative result will have 5%–10% of the total number of cells in small clumps of 5–10 cells, sometimes larger. Motile and adhesive cells begin reaggregating immediately after dissociation.\nNote: Some protocols call for the 40 μm filtration of cells. This diameter is already larger than many of the small clumps of cells, given that Hydra cells are relatively small. It has been observed that the distribution of clumps to individual dissociated cells doesn’t change after filtration, unless there are excessively large clumps, in which case the dissociation is incomplete (Figure 5[href=https://www.wicell.org#fig5]C).\nA representative result will give 1.5–5 million cells/mL depending on the initial number of Hydra used in the experiment and the total fraction of tissue dissociated.\nAllocate cells for aggregates of desired size to pre-chilled 0.5 mL microcentrifuge tubes at a final volume of 200 μL and sediment on ice 30 min.\nDetermine the volume to add to achieve aggregates of the sizes required of the experiment.\nAggregates of 80–100 thousand cells fit comfortably in the field of most 10× microscope objectives. Troubleshooting 5[href=https://www.wicell.org#troubleshooting].",
    "Note: Aggregates smaller than 50 thousand cells have a harder time surviving (Gierer et al., 1972[href=https://www.wicell.org#bib7]). In theory aggregates can be made of any number of cells greater than this. If there is massive cell death, viable cells can find each other in larger masses of dying cells to form multiple distinct aggregates within the larger cell mass. Troubleshooting 3[href=https://www.wicell.org#troubleshooting].\nDetermine the volume of ice-cold dissociation media to add to the volume of cell suspension to yield a 200 μL final volume, and add this to pre-chilled 0.5 mL microcentrifuge tubes before adding the cell suspension.\nAdd the cell suspension gently to the bottom of the tube, and allow cells to sediment on ice for 30 min. Troubleshooting 4[href=https://www.wicell.org#troubleshooting].\nPause point: 30 min.\nOptional: If the dissociation did not yield adequate numbers of cells, the remaining tissue fragments can be resuspended in dissociation media and incubated at 4°C for a longer period of time, repeating steps 5 through 9.\n    Your browser does not support HTML5 video.\n  \nMethods Video S4. Cell suspension collection (step 7)\nAfter sedimentation of tissue chunks, the supernatant is carefully collected and placed into a separate tube for cell counting and allocation to individual aggregates.\nCellular aggregate creation and maintenance\nTiming: 8–72 h\nAfter the 30 min sedimentation of the cell suspension on ice, centrifuge the cell suspension slowly for 4 min at 300 g.\nTransfer the tubes to the centrifuge slowly with care so as not to disturb the previous 30-min bout of sedimentation. Troubleshooting 4[href=https://www.wicell.org#troubleshooting].\nCentrifuge without a lid, if possible, to avoid disturbing the cell pellets with attachment and detachment of the lid. At such a low speed as 300 g, this should not damage the centrifuge.\nNote: A non-refrigerated centrifuge can be used here with no adverse effects on preparation quality.",
    "Alternatives: A wide variety of centrifugation speeds and even alternative approaches exist for the generation of aggregates from cell suspension. At the higher end is 1,000 × g for 5 min (Cochet-Escartin et al., 2017[href=https://www.wicell.org#bib4]). At the lower end is 10 × g for 10 min (Soriano et al., 2009[href=https://www.wicell.org#bib15]). Others (Technau and Holstein, 1992[href=https://www.wicell.org#bib16]; Hobmayer et al., 2001[href=https://www.wicell.org#bib8]) have used a rotary shaker on cell suspension in a 24 well plate to create cellular aggregates.\nPause point: 4 min.\nAfter centrifugation, gently place the 0.5 mL microcentrifuge tubes in their rack (the repurposed P1000 tip box), cover, and place at 4°C for 2–6 h to allow the early stages of reaggregation to progress undisturbed.\nInspect the microcentrifuge tubes for cell pellets to ensure sedimentation and aggregation (Figure 6[href=https://www.wicell.org#fig6]A). Shorter post-allocation incubation periods of the cell suspension can lead to streaking of cells in a thin layer along the side of the tube, loss of cells from the aggregate, and oblong aggregates. Troubleshooting 4[href=https://www.wicell.org#troubleshooting].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1915-Fig6.jpg\nFigure 6. Representative Hydra aggregates\n(A) Pelleted cell suspension of 100 thousand cells in 200 μL dissociation media, following a 30-min incubation of the cell suspension on ice and 4-min centrifugation at 300 g in a fixed-angle rotor. Shorter incubations of the cell suspension on ice before centrifugation lead to longer streaks toward the top of the pellet and increasingly oblong aggregates.\n(B) An aggregate 8 h post-dissociation.\n(C) An aggregate 24 h post-dissociation. Note the clearer segregation between the ectoderm (translucent halo) and the endoderm, as well as the hollowing center of the aggregate at 24 h. Some shedding of unintegrated cells is observed in both cases. Scale bar 200 μm.",
    "If desired, add ice to the bottom of the empty 1 mL pipette tip box serving as a 0.5 mL tube holder to slow the temperature transition to 4°C and eventually to 18°C.\nNote: Some protocols call for the collection of aggregates immediately after centrifugation. We have found this difficult, and the process can lead to major cell loss and variable aggregate sizes. Incubation at 4°C gives the aggregate time to develop and detach from the tube, to facilitate the eventual transfer to 24-well plates.\nOptional: The 4°C incubation can be substituted for an 18°C incubation with no severe effects on aggregate health (Lovas and Yuste, 2021[href=https://www.wicell.org#bib10]). However, it has been observed that aggregates are more robust to experimental manipulations and appear to regenerate faster with a slower transition from 4°C back to standard incubation at 18°C. Equilibrating the dissociation medium-containing 24-well plates to 18°C instead of 0°C is performed in the next step if the extended 4°C incubation is omitted.\nAfter 4°C incubation, transfer aggregates to 24-well plates for incubation at 18°C.\nPre-chill the 24-well plate on ice and add 600 μL ice-cold dissociation medium.\nThis minimal volume minimizes media waste and will completely cover the bottom of the 24-well plate.\nGently bounce the bottoms of the tubes in the 1 mL tip holder/tube rack on a flat surface a few times to facilitate detachment of aggregates from the tubes. Take care not to lose tubes from the rack.\nTransfer the 200 μL contents of the 0.5 mL microcentrifuge tube to the 600 μL dissociation medium in a well of the 24-well plate. Inspect the Pasteur pipette to ensure the aggregate is pulled from the bottom before the tube is empty.\nPlace the 24-well plate in an 18°C incubator.",
    "Note: Aggregates usually detach readily with gentle aspiration of the Pasteur pipette, but can be gently nudged with the pipette tip if they don’t immediately detach. Take care to ensure aggregates aren’t exposed to air or surface tension during the process. Troubleshooting 4[href=https://www.wicell.org#troubleshooting].\nGradually dilute dissociation media back to normal Hydra media supplemented with Penicillin/Streptomycin. Troubleshooting 2[href=https://www.wicell.org#troubleshooting].\nA typical schedule is a 50% dilution at 6 h, 22 h, 46 h, and 70 h post-sedimentation.\nTo avoid disturbing the fragile new aggregates, the first 50% dilution at 8 h should involve gently adding another 800 μL Hydra media to the 800 μL dissociation media in the well. Subsequent dilutions should include removal of 800 μL media before replacement.\nAlternatives: The dilution schedule for bringing the aggregates back to low-osmolarity Hydra media varies widely from protocol to protocol. At one extreme, after centrifugation aggregates are left to stabilize in a 50% dilution before transfer to 100% Hydra medium at 2 h (Soriano et al., 2009[href=https://www.wicell.org#bib15]). The protocol presented here is near the other end of the spectrum. We have observed that intact Hydra are content for extended periods of time in ‘Recovery Media’ post-electroporation – 20% dissociation media in Hydra media (Bosch et al., 2002[href=https://www.wicell.org#bib2]) – as evidenced by their exceptionally long tentacles. A more frequent dilution schedule (e.g., every 12 h after the first exchange) has no adverse effects on aggregate health. If massive cell shedding is present a more frequent schedule may be desired to allow the removal of debris."
  ],
  "subjectAreas": [
    "Cell Isolation",
    "Cell Culture",
    "Cell Biology",
    "Cell-Based Assays",
    "Neuroscience",
    "Developmental Biology",
    "Model Organisms"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}