{
  "id": 9932,
  "origin_website": "Jove",
  "title": "A Method for Measuring RNA N6-methyladenosine Modifications in Cells and Tissues",
  "procedures": [
    "NOTE: The total RNA m6A level includes rRNA, mRNA, and other small RNAs. Since ribosomal RNA has abundant m6A modifications, the measurement of m6A levels will need to consider this fact.\n1. RNA Isolation\nUsing the ribonuclease decontamination solution (sprayed onto paper towels), wipe the pipettes and lab bench surfaces. Wet paper towels with nuclease-free water and wipe down pipettes and lab bench surfaces again.\nRNA Extraction\n\t\nTotal RNA Isolation\n\t\t\nUsing an overhead stirrer, homogenize 50-100 mg of tissue or 5-10 x 106 cells in 1 mL of RNA isolation solution maintained at 4 °C.\n\t\t\tNOTE: More tissue (100-150 mg) may be required for adipose tissue samples from mice because of the lower RNA concentrations therein. Samples sourced from mouse heart, liver, skeletal muscle, lung, brain, and macrophages have been employed previously4.\nIncubate the sample homogenates for 5 min at room temperature.\nAdd 100 µL of 1-bromo-3-chloropropane (BCP) per 1 mL of sample homogenate. Shake the tubes vigorously for 15 s and proceed to isolate total RNA according to the manufacturer's instructions24.\nPolyadenylated mRNA Purification from Isolated Total RNA\n\t\t\nPurify polyadenylated mRNA using available kits or protocols.\n\t\t\t\nShake thoroughly to re-suspend each of the following solutions: 2x binding solution, oligo(dT) polystyrene beads, and wash solution. Ensure that the oligo(dT) beads warm to room temperature before use.\nTransfer 120 µL of elution solution per preparation into a tube and heat to 70 °C in a heating block.\nPipette up to 500 µg of total RNA into a microcentrifuge tube. With nuclease-free water, adjust the volume to 250 µL.\nAdd 250 µL of 2x binding solution to the total RNA solution and vortex briefly to mix the contents.\nAdd 15 µL of oligo(dT) beads and vortex thoroughly to mix.\nIncubate the mixture at 70 °C for 3 min.",
    "Remove the sample from the heating block and let it stand at room temperature for 10 min.\nCentrifuge at 15,000 x g for 2 min.\nCarefully remove the supernatant, leaving behind approximately 50 µL.\nAdd 500 µL of wash solution to re-suspend the pellet by pipetting.\nPipette the suspension into a spin filter/collection tube set.\nCentrifuge at 15,000 x g for 2 min. Remove the column from collection tube and discard the flow-through. Return the column to the collection tube.\nPipette 500 µL of wash solution onto the spin filter.\nCentrifuge at 15,000 x g for 2 min.\nTransfer the spin filter into a fresh collection tube.\nPipette 50 µL of elution solution heated to 70 °C onto the center of the spin filter.\nIncubate for 2-5 min at 70 °C. Centrifuge at 15,000 x g for 1 min.\nPipette an additional 50 µL of elution solution heated to 70 °C onto the center of the spin filter.\nRepeat Step 1.2.2.1.18.\nAdd 100 µg/mL glycogen, 0.1 volume of 3 M sodium acetate buffer (pH 5.2), and 2.5 volumes of absolute ethanol. Precipitate overnight at -80 °C.\nCentrifuge at 15,000 x g for 25 min at 4 °C. Discard the supernatant.\nWash the pellet with 1 mL of 75% ethanol. Centrifuge at 15,000 x g for 15 min at 4 °C. Carefully remove the ethanol.\nDry in air for 3-5 min.\nAdd 10 µL of nuclease-free water to dissolve the pellet.\nStore at -70 °C.\nRNA Qualification and Quantification\n\t\nUsing a spectrophotometer, determine the RNA concentration by noting the absorbance at 260 nm and 280 nm. The A260/A280 ratio should be 1.8-2.2.\nCheck the RNA sample quality using 0.8% agarose gel electrophoresis25.",
    "NOTE: The intact eukaryotic total RNA should show intense 28S and 18S rRNA bands. The ratio of 28S versus 18S rRNA band intensity for a good RNA preparation is ~2.\n2. Gel Electrophoresis and Transfer\nNOTE: The buffer preparation protocols are given in Table 1.\nFormaldehyde Gel Preparation (1%)\n\t\nRinse all electrophoresis equipment with diethylpyrocarbonate (DEPC) water.\nMelt 2.5 g of agarose in 215 mL of DEPC water completely in a microwave oven.\nAdd 12.5 mL of 10x 3-(N-morpholino)propanesulfonic acid (MOPS) buffer and 22.5 mL of 37% formaldehyde.\nPour it into the electrophoresis apparatus with a 1.5 mm thick comb.\nEliminate bubbles or push them to the edges of the gel with a clean comb.\nAllow the gel to solidify at room temperature.\nSample Preparation\n\t\nMix 1-10 µg of total RNA and 11.3 µL of sample buffer.\nMix 2 µg of the RNA marker (1 µg/µL) with 11.3 µL of the sample buffer.\nAdd nuclease-free water to the samples from 2.2.1 and 2.2.2 to a total volume of 16 µL.\nHeat at 60 °C for 5 min, and then chill on ice.\nMix 16 μL of the sample from 2.2.3 with 4 μL of tracking dye, which contains 0.1 μg/μL ethidium bromide on ice.\n\t\tCAUTION: Ethidium bromide is possibly teratogenic and toxic if inhaled. Read ethidium bromide safety datasheet.\nElectrophoresis\n\t\nAdd 200 mL of 10x MOPS buffer to 1,800 mL of ddH2O to make a 1x MOPS running buffer.\nUse the 1x MOPS running buffer to rinse the wells of the gel.\nPre-run the gel at 20 V for 5 min.\nLoad the RNA samples into the wells of the gel.\nCover with foil to avoid light exposure. Run at 35 V for about 17 h (overnight)\nExamine and photograph the gel under a UV light.\nTransfer",
    "Cut the gel to remove the unused portion.\nPrepare 500 mL of 10x SSC buffer (250 mL of 20x SSC buffer and 250 mL of DEPC water).\nWash the gel twice with 10x SSC buffer for 20 min with shaking at 50 rpm.\nCut 1 filter paper sheet large enough to serve as a wick paper, which absorbs transfer buffer from the transfer tray (Figure 1).\nCut 4 pieces of filter paper to the same size as the gel.\nCut 1 sheet of positively-charged nylon membrane to the same size as the gel.\nMark a notch on the gel and the membrane as a marker to ensure the proper orientation.\nSoak the membrane in 2x SSC buffer for 15 min.\nPour 500 mL of 10x SSC buffer into the transfer tray.\nLay the large filter paper sheet across the glass plate and wet the filter paper with transfer buffer.\nRoll out any bubbles with a pipette.\nSoak 2 pieces of pre-cut filter paper in transfer buffer and place them on the center of the filter paper from step 2.4.5. Remove any bubbles.\nLay the gel top-side down on the filter paper.\nLay the membrane on top of the gel. Align the notches of the gel and the membrane.\nPlace 2 pieces of pre-cut filter paper on top of the membrane and wet the filter paper with transfer buffer.\nRemove any bubbles between the layers.\nApply plastic wrap around the gel to ensure that the towels only soak up buffer passing through the gel and the membrane.\nStack the paper towels on top of the filter paper.\nPlace an oversized glass plate on top of the towels.\nPlace a weight on the top of the stack.\nKeep overnight to allow the RNA to transfer from the gel to the membrane.",
    "3. Detection of N6-methyladenosine\nMembrane Crosslinking\n\t\nKeep the membrane damp in 2x SSC buffer.\nPlace 2 sheets of filter paper immersed with 10x SSC buffer into UV crosslinker.\nPlace the membrane on top of the filter paper, with the RNA-adsorbed side facing up.\nSelect \"autocrosslink mode\" (120,000 µJ) and press the \"Start\" button to initiate the irradiation.\nExamine the membrane and the gel with a UV gel image catcher to confirm the RNA transfer from the gel to the membrane.\nImmunoblotting\n\t\nBlock the membrane in 5% non-fat milk in Tris-buffered saline with Tween 20 (TBST) buffer at room temperature for 1 hr.\nWash thrice with TBST buffer for 15 min.\nIncubate the membrane overnight in m6A (N6-methyladenosine) antibody solution (1:1,000 in 5% non-fat milk TBST buffer) at 4 °C.\nWash the membrane thrice with TBST buffer for 15 min.\nIncubate the membrane in the HRP-conjugated donkey anti-rabbit antibody solution (1:2,000 in 5% non-fat milk TBST buffer) for 1 h at room temperature.\nWash the membrane thrice with TBST buffer for 15 min.\nApply the enhanced chemiluminescent substrate (0.125 mL per cm2 of membrane).\nCapture the chemiluminescence with the optimum settings of the digital imager, according to manufacturer's instructions26.\nm6A Quantification\n\t\nMeasure the relative m6A chemiluminescent intensity using the ImageJ software.\n\t\t\nUnder the ImageJ software menu, select the \"File\" option to open the pertinent file.\nSelect the \"Rectangle\" tool from ImageJ and draw a frame around the signals.\nIf ribosomal RNA is not the focus of the experiments, avoid the 18S and 28S ribosomal RNA m6A bands for the calculation.\nClick \"Command\" and \"1\" to confirm the selected lane.\nPress \"Command\" and \"3\" to show the selected plot.\nClick the \"Straight\" tool and draw lines to separate the segmented area.\nClick the \"Wand\" tool to record the measurements.\nExport the data.",
    "Normalize the levels of m6A with the 18S ribosomal RNA band from the ethidium bromide staining."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}