{
  "id": 12247,
  "origin_website": "Jove",
  "title": "Identification and Characterization of Metastatic Factors by Gene Transfer into the Novel RIP-Tag; RIP-tva Murine Model",
  "procedures": [
    "Ethics Statement:Experiments on animals were performed in accordance with the guidelines and regulations set forth by the Institute for Animal Care and Use Committee of Weill Cornell Medicine.\n1. Choice of Avian Retroviral Vectors (RCASBP(A)-based or RCANBP(A)-based)\nVectors was derived from Rous sarcoma virus11. Avian retroviral vectors can deliver cDNAs (≤2.5 kb), short hairpin RNAs (shRNAs), microRNAs (miRNAs), and other noncoding RNAs. The commercially available vectors are listed in Materials and others need to be requested directly from the authors.\nTo overexpress genes of interest, use one of the following vectors, RCASBP(A)12 (Figure 1A), RCAS-X (Figure 1B), RCAS-Y13 (Figure 1C), RCASBP-Y DV14, or other ALV-A vectors (https://home.ncifcrf.gov/hivdrp/RCAS/mice.html).\nTo knock genes of interest by shRNA, use one of the following vectors: RCAN-X DV15 or RCAS-RNAi16.\nTo overexpress miRNAs, generate RCAS-miR vector as described in17.\nTransformation into E. coli and DNA requirement.\nPreferably transform DNA into Stbl2 or Stbl3 competent cells, which have unique genotype to stabilize direct repeat and retroviral sequences.Purify plasmid DNA using a method that will yield pure, transfection grade DNA. 5 µg of DNA is needed with minimum concentration of 0.1 µg/µl.\n2. Viral Propagation in Chicken Fibroblast DF1 Cell Line\nThe use of filtered pipette tips for cell culture is required to prevent cross-contaminating viral stocks18.\nMaintain DF1 cells in 6 cm dish with growth medium (DMEM with high glucose, 10% fetal bovine serum, 6 mM (final concentration) L-glutamine, 10 units/ml penicillin, 10 µg/ml streptomycin) at 37 oC and 5% CO2. If DF1 cells are freshly thawed from frozen stocks, culture them for at least 3 days before transfection.\nOne day before transfection, pass DF1 cells to a 6 cm tissue culture dish so that they will be 30-50% confluent at the time of transfection.",
    "Dilute 5 µg of pure viral DNA with DMEM (without serum, penicillin or streptomycin) to a total volume of 150 µl in a microcentrifuge tube inside a tissue culture hood.\nAdd 30 µL of Superfect directly into the diluted DNA tube; vortex this mixture for 10 s; leave the mixture at room temperature for 5-10 min in the tissue culture hood to allow transfection-complex formation.\nWhile complex formation takes place, gently aspirate growth medium from the DF1 cell culture dish, and carefully wash cells with 4 ml PBS-/-.\nPipet 5 ml of growth medium (containing serum and antibiotics); save 4 ml to a Falcon tube for the next step; and add the rest of 1 ml of growth medium to the transfection complexes. Mix by pipetting up and down twice, and immediately transfer the whole transfection complexes to the DF1 cells. Swirl to ensure that the cell layer is covered; incubate for 2-3 hours at 37oC.\nAspirate the transfection mixture; wash cells with 4 ml PBS-/-; add 4 ml of fresh growth medium (containing serum and antibiotics); return cells to a 37oC incubator.\nWhen cells reach confluency, passage cells (transient expression may be assayed 48 to 72 h after transfection).\nContinue to pass cells for about 7 days until all cells are presumably infected; test viral DNA integration by PCR and determine protein expression by Western blotting; and freeze cells in DMEM medium with 10% DMSO and 20% fetal bovine serum.\n3. In Vivo Infection of RIP-Tag; RIP-tva Mice\nVirus collection and concentration\n\tUse freshly concentrated viruses for in vivo infection. The titer of viruses kept in 4 oC within a week is not significantly reduced. However, frozen aliquots of viral stock display 10-fold reduced titer upon thawing.",
    "Expand virus-producer DF1 cells into 15 cm dishes depending on the amount of virus needed. For in vivo mouse infection, prepare an average of one plate per mouse.\nPre-chill the rotor (for example, SW28), the swing bucket, and the ultracentrifuge machine to 4oC.\nCollect supernatant from confluent 15-cm dishes. Remove cell debris by low-speed centrifugation at 1,650 x g for 10 min at 4oC.\nTransfer the viral supernatant to ultracentrifuge tubes (Polyallomer centrifuge tubes). Spin in an ultracentrifuge for 1.5 hours at 95,400 x g 4 oC. For Beckman XL-100 ultracentrifuge machine, use Accel: 1; Decel: 1 settings.\nRemove supernatant from ultracentrifuge tubes as much as possible. Add PBS without calcium and magnesium (PBS-/-) to the ultracentrifuge tube to make final 100 µl viral suspension from one 15 cm dish. Cover the tubes with Parafilm. Resuspend the invisible viral pellet by vortexing the ultracentrifuge tubes for 2 min at medium speed.\nRock the ultracentrifuge tubes at 4 oC for one hour to overnight.\nTransfer the viral suspension into a microcentrifuge tube. Warm up the viral suspension to room temperature before injection into mice.\nViral Titer Determination.\n\tFor every new viral construct, viral titer needs to be determined before in vivo infection.\n\t\nSeed DF1 cells in all wells of a 12-well tissue culture plate (suggestion: 2 x 104 cells/well, 1 ml/well), so that they will be 30% confluent at the time of infection. One 12-well plate is needed for one viral titer determination.\nMake a series of 10-fold dilutions of the viral supernatant in growth medium as following:\n\t\t\nMix 5 µl viral supernatant with 495 µl growth medium for the 102 dilution in a microcentrifuge tube. Vortex briefly for a few seconds.",
    "Take 40 µl from the 102 dilution into 360 µl growth medium in a microcentrifuge tube for the 103 dilution. Vortex briefly for a few seconds.\nFollow step 3.2.2.2 for 104 and 105 dilution.\nSet up 5 of 6-ml polystyrene tubes. Aliquot 2.25 ml growth medium per tube, and label them 106, 107, 108, 109, 1010, respectively.\nMix 0.25 ml from the 105 dilution with 2.25 ml growth medium in the 6 ml Polystyrene tube for the 106 dilution. Vortex briefly for a few seconds.\nFollow step 3.2.2.5 for 107, 108, 109, and 1010 dilution.\nRemove the original culture medium from DF1 cells on the 12-well plate. Put 1 ml diluted viruses to each well in duplicated (uninfected, 1010 to 106 IU/ml).\nAllow cells to grow for at least 7 days (perform trypsinzation when necessary). Collect cells to isolate DNA and check for the presence of viral DNA by PCR as described in \"6. PCR protocols\". If this viral titer is 108 infectious units per ml (IU/ml), a positive 398 bp PCR products from RCASBP will be observed using DNA from cells with 108 to 106 IU/ml viruses, but not from uninfected cells, or cells with 1010 to 109 IU/ml viruses. A titer of >1 x 108 infectious units per ml should be used for in vivo infection.\nIntracardiac injection\n\tHemizygous RIP-Tag mice, not homozygous mice, are used in this study. Hemizygous RIP-Tag mice develop pancreatic neuroendocrine tumors around 10~12 weeks of age, while homozygous mice have a shorter tumor latency. Because cell proliferation is required for the incorporation of the viral cDNA into the host genome, 7-week-old RIP-Tag; RIP-tva mice with hyperplasic pancreatic β cells are used. Please note that most normal β cells are not proliferating in adult mice.",
    "Use 7 week-old RIP-Tag; RIP-tva mice in a pure C57BL/C background for the experiments.\nAnesthetize mouse using a ketamine/xylazine combination (150 mg/kg; 15 mg/kg). Use heat support to maintain the mouse body temperature throughout the entire period of anesthesia.\nApply eye lubricant to both eyes to prevent corneal drying.\nShave hair from the chest cavity of RIP-Tag; RIP-tva mice. Position mouse on its back with chest facing up. A toe-pinch is performed to observe the animal for non-responsiveness to confirm full anesthesia effect.\nExtend the front limb and secure them with tapes. Mark mouse's chest for injection. Mark a location midway between the sternal notch and top of xyphoid process, and slightly left (anatomical) of the sternum (Figure 2).\nScrub the anterior chest wall with either a povidone-iodine scrub or a chlorhexidine scrub followed by a 70% isopropyl alcohol or 70% ethanol soaked gauze sponge.\nDraw 50 µl of air into a sterile 28 g ½ insulin syringe to create space between the plunger and meniscus of a 500 µL syringe, and then draw up 100 µl of viruses. The air space without any liquid on the wall is crucial for seeing cardiac pulse.\nKeep needle upright. Hold skin of mouse taut with one hand, and insert needle to the marked location. When a bright red pulse of blood appears in the syringe, stop advancing the needle and fix the depth of the needle in the mouse with one hand.\nUse the other hand to carefully and slowly push the plunger to deliver viral suspension (~100 µl volume) over a ~60 second period. Deliver 10-20 µl whenever seeing a bright red pulse of blood appear in the syringe. Continuous entrance of red oxygenated blood into the transparent needle hub indicates proper positioning of the needle into the left ventricle.",
    "After the last push of the plunger to deliver viral suspension and before seeing the next red pulse of blood, quickly retract the needle out of the chest cavity.\nApply gentle pressure over the injection site to reduce bleeding for at least 1 min.\nCarefully move the mouse onto a heating pad or under a heat lamp until fully conscious. Mice will be watched until anesthesia wears off so that they can walk away from stimuli, a period usually lasting approximately one hour. Mice will be monitored daily for even and intact coat and any changes in behavior.\n4. Histopathological Analysis of Tumors\nNine weeks after injection, euthanize 16 week-old RIP-Tag; RIP-tva mice. Record sizes and numbers of primary pancreatic tumors and any gross metastases.\nFix pancreas, liver, and/or other organs in 10% buffered formalin overnight at room temperature in a rocking platform.\nTransfer the fixed tissues into 70% ethanol on the next day. Process tissues into paraffin-embedded sections.\nPerform immunohistochemical staining for either synaptophysin (a neuroendocrine marker) or insulin (a β cell-specific marker) following manufacturer's instructions to identify metastases of pancreatic β cells in pancreatic lymph nodes or livers. However, de-differentiated tumor cells or poorly differentiated tumor cells may lose the expression of insulin and only can be detected by synaptophysin immunostaining.\n5. In Vitro Infection of tva-expressing Cells\nIt is not necessary to use concentrated viruses for in vitro infection. The protocol described below is for two rounds of infection. Further rounds of infection can be performed by repeating the following protocol.\nCollect viral supernatant from confluent DF1 cells. Keep the viral supernatant at 4 oC for infection within a week. Before infection, pass the viral supernatant through a 0.45 μm filter to obtain cell-free viruses.",
    "Briefly rinse tva-expressing target cells (i.e. N134 pancreatic β cell tumor cell line from a RIP-Tag; RIP-tva mouse) with PBS-/- to remove all traces of serum, which contain trypsin inhibitor. Briefly rinse tva-expressing target cells with trypsin-EDTA (such as 0.25% Trypsin-2.21 mM EDTA) solution. Add Trypsin-EDTA solution and incubate for 2 minutes. Gently tap the plate. Observe cells under an inverted microscope. Cells usually detach in 2 to 3 min. Seed target cells into a 6 cm plate. Use 3~4 ml filtered viral supernatant as growth medium.\n\tNOTE: The nutrition in the viral supernatant is consumed by DF1 cells, so change the medium the next day.\nOn the next day, warm up enough amount of viral supernatant to room temperature. Remove the medium from target cells, and replace with 3-4 ml viral supernatant.\nOn the third day, passage cells as needed. If cells are not dense enough to be passaged, warm up ~4 ml of regular growth medium (DMEM with high glucose, 10% fetal bovine serum, 6 mM (final concentration) L-glutamine, 10 units/mL penicillin, 10 µg/mL streptomycin) to replace the viral supernatant.\nExpand infected cells and examine the candidate protein expression by Western blotting 19. The effects of the candidate genes on migration and invasion can be analyzed in transwell assays. These cell lines can also be tested for their metastatic potential to the liver in a tail vein assay for metastasis.\n6. PCR Protocols",
    "Solutions should be assembled as quickly as possible on ice. A mastermix without the template can be made for a large number of samples and aliquoted into PCR tubes. Multiply the amount of each reagent needed by the number of samples. Mix the reagents by flicking prior and swirl with pipet tip before taking some to add to the mastermix. After adding each reagent to the mastermix tube, pipet up and down to deliver any residuals inside the tips.\nTo detect the presence of RCASBP in the infected or transfected cells.\n\tThe following protocol calls for 11.5 µL of the mastermix and 1 µL of genomic DNA for each sample. Make sure to swirl before adding each reagent.\n\t\nPrepare a mastermix of 7.68 µL nuclease-free water, 0.75 µL DMSO, 1.25 µl 10x buffer II for AmpliTaq DNA Polymerase, 1.375 µl of 25 mM MgCl2, and 0.125 µl of 25 mM dNTP.\nAdd 0.125 µL of 100 µM forward primer RCAS5626F: (5'-ACCGGGGGATGCGTAGGCTTCA-3') and 0.125 µL of 100 µM reverse primer RCAS6023R: (5'-CCGCAACACCCACTGGCATTACC-3') to the mastermix.\nAdd 0.075 µL AmpliTaq DNA Polymerase to the mastermix.\nMix the mastermix by flicking the tube with fingers. Spin down the matermix in a centrifuge machine briefly for 3~5 seconds.\nAliquot 11.5 µL from the mastermix to each individual PCR tubes. Swirl every time before aliquoting to a new tube.\nSwirl and add 1 µL genomic DNA template to each PCR tube. To prepare genomic DNA:\n\t\t\nLyse cell pellet in 200 µl of 0.05 M NaOH. Pipet up and down to dissolve the pellet.\nHeat the cell lysate to 98 °C for 20 minutes in a PCR machine, then cooled down to 25 °C.\nAdd 20 µL 1.0 M Tris-HCl (pH 7.5) to the tubes, and store the DNA samples at 4°C.",
    "Mix the samples by flicking and centrifuge briefly for 3-5 seconds. Put tubes into a PCR machine.\nThe PCR condition is set for 2 min at 92 °C for initial denaturation, followed by 40 cycles of 30 s at 94 °C for denaturation, 30 s at 67°C for annealing, 30 s at 72 °C for extension, and 10 m at 72 °C for final extension.\nAfter the PCR is finished, add 3 µL of 6x DNA loading dye to each sample. Mix by flicking and centrifuge briefly for 3~5 seconds.\nPCR products are examined by electrophoresis in a 2% (w/v) agarose gel in 1x TAE buffer. The size of its PCR product is 398 bp.\nTag genotyping.\n\tThe following protocol calls for 10.5 µL of the mastermix and 2 µL of genomic DNA for each sample. Make sure to swirl before adding each reagent.\n\t\nPrepare a mastermix of 4.5 µL nuclease-free water and 4.00 µL 5x MyTaq Reaction Buffer for MyTaq DNA Polymerase.\nAdd 0.4 µL of 100 µM forward primer TagF2: (5'-GGACAAACCACAACTAGAATGCAGTG-3') and 0.4 µL of 100 µM reverse primer TagR2: (5'-CAGAGCAGAATTGTGGAGTGG-3') to the master mix.\nAdd 0.8 µL of 10 µM beta-2-microglobulin precursor (B2m) primer mix for the internal control. PCR primers for B2m the internal control, beta-2-microglobulin precursor (B2m), are B2 F (5'-CACCGGAGAATGGGAAGCCGAA-3') and B2 R (5'-TCCACACAGATGGAGCGTCCAG-3').\nAdd 0.4 µL MyTaq DNA Polymerase to the mastermix.\nMix the mastermix by flicking the tube with fingers. Spin down the mastermix in centrifuge machine for 3~5 s.\nAliquot 10.5 µL from the mastermix to each individual PCR tubes. Swirl every time before aliquoting to a new tube.\nSwirl and add 2 µL genomic DNA template to each PCR tube. Genomic DNA is prepared as described above.",
    "Mix the solution by flicking and centrifuge briefly for 3-5 seconds. Put tubes into PCR machine.\nThe PCR condition is set for 3 min at 95°C for initial denaturation, followed by 35 cycles of 15 s at 95 °C for denaturation, 15 s at 65 °C for annealing, 30 s at 72 °C for extension, and 10 min at 72 °C for final extension.\nAfter the PCR is finished, add 3 µL of 6x loading dye to each sample. Mix by flicking and centrifuge briefly for 3~5 seconds.\nPCR products are examined by electrophoresis in 2% (w/v) agarose gel in 1x TAE buffer. The sizes of Tag and B2m PCR products are ~450 bp and 300 bp, respectively.\ntva genotyping.\n\tThe following protocol calls for 10.5 µL of the reagent mix for each sample. Make sure to swirl before adding each reagent.\n\t\nPrepare a mastermix of 5.6 µL nuclease free water, 0.5 µL DMSO, 1.25 µL 10x Buffer II for AmpliTaq DNA Polymerase, and 1.375 µL of 25 mM MgCl2, and 0.125 µL of 25 mM dNTP.\nAdd 0.125 µL of 100 µM tva-3 (5'-GCCCTGGGGAAGGTCCTGCCC-3') and 0.125 µL of 100 µM tva-5 (5'-CTGCTGCCCGGTAACGTGACCGG-3') to the mastermix.\nAdd 1.275 µL of 10 µM B2m primer mix for the internal control to the mastermix.\nAdd 0.125 µL AmpliTaq DNA Polymerase to the mastermix.\nMix the mastermix by flicking the tube with fingers. Spin down the mastermix in centrifuge machine briefly for 3-5 seconds.\nAliquot 10.5 µL from the mastermix to each individual PCR tubes. Swirl every time before aliquoting to a new tube.\nSwirl and add 2µL genomic DNA template to each PCR tube. Genomic DNA is prepared as described above.\nMix the solution by flicking and centrifuge briefly for 3-5 s. Put tubes into PCR machine.",
    "The PCR condition is set for 2 min at 92 °C for initial denaturation, followed by 35 cycles of 30 s at 94 °C for denaturation, 30 s at 60°C for annealing, 30 seconds at 72 °C for extension, and 10 minutes at 72 °C for final extension.\nAfter the PCR is finished, add 3 µL of 6x loading dye to each sample. Mix by flicking and centrifuge briefly for 3-5 s.\nPCR products are examined by electrophoresis in a 2% (w/v) agarose gel in 1x TAE buffer. The sizes of tva and B2m PCR products are 500 bp and 300 bp, respectively.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}