{
  "id": 3095,
  "origin_website": "Cell",
  "title": "Use of Busulfan to Condition Mice for Bone Marrow Transplantation",
  "procedures": [
    "Step-By-Step Method Details\nStep-By-Step Method Details\nConditioning Mice with Busulfan\nTiming: Begin 2 days before bone marrow transplantation\nThis example describes the conditioning of 10 mice with 40 mg/kg of busulfan (administered in 2 doses of 20 mg/kg) per mouse administered over the course of two days. We used 8 - 12 week old female C57BL/6 mice obtained from the Jackson Laboratory in this example. These mice typically weigh between 18 and 22 grams.\nFresh working solutions are prepared each day.\nIn order to achieve a total dose of 40 mg/kg of busulfan, 0.8 mg of busulfan will need to be administered to a 20 gram mouse. In the example we describe, mice were treated with 0.4 mg of drug on days −2 and−1 prior to bone marrow transplantation (day 0). However, as discussed in the “Expected Outcomes[href=https://www.wicell.org#expected-outcomes]” section, there is some, albeit limited, flexibility as to when hematopoietic cells are transplanted after the last busulfan injection.\nTwo days before bone marrow transplantation (day −2), weigh 5 mg of busulfan in a fume hood using a microbalance shielded from drafts. Resuspend the busulfan crystals in 0.5 mL of 20°C–25°C DMSO in a 1 mL sterile tube with screwcap (we use cryogenic vials). We do not recommend using diluted solutions of DMSO, as we encountered difficulty in dissolving drug when this was done. Cap the tube tightly and shake vigorously to dissolve the drug. Even though 4 mg of busulfan will be needed for the 10 mice to be conditioned, excess stock solution is made to account for loss of material during sterilization by filtration. Also, some mice may weigh more than 20 grams, necessitating additional working solution.",
    "Once all the busulfan crystals have dissolved, add the mixture to 4.5 mL of Ca++ and Mg++ free PBS pre-warmed to 37°C in a 15 mL polypropylene screw cap tube. Vortex this solution as needed to dissolve any precipitates that may have formed. This working solution now contains 1 mg/mL of busulfan and a final DMSO concentration of 10%. Ensure that DMSO levels do not exceed 10%, as higher levels of this solvent may not be tolerated by mice.\nSterilize the 1 mg/mL busulfan working solution by filtration though a 0.2 μm syringe filter. Note that the busulfan/DMSO stock solution described in step 2 cannot be sterilized this way as the high DMSO concentration will damage the filter.\nCritical: Busulfan is toxic and only personnel with the appropriate training should work with this drug. All procedures, including weighing of drug, should be performed in a chemical fume hood by experienced laboratory personnel wearing appropriate personal protective equipment. The institution’s office of environmental health and safety should be consulted if laboratory personnel require advice on the use of busulfan. Needles, syringes, plastics, and unused busulfan stock solution should be considered as hazardous waste and should be disposed of according to institutional regulations.\nWeigh each mouse on a portable balance to determine the volume of the busulfan working solution to be injected. For example, the goal is to treat mice with 0.4 mg of busulfan, which would equal a 20 mg/kg dose. Therefore, 0.4 mL of the 1 mg/mL working solution should be loaded into a 0.5 mL insulin syringe fitted with a 29-gauge needle. These specific syringes, described in the Key Resources Table[href=https://www.wicell.org#key-resources-table], are used because they allow delivery of a precise amount of solution.",
    "Critical: Busulfan has an established instability in aqueous preparations and exhibits sensitivity to hydrolysis that is influenced by phosphate buffer components (Hassan and Ehrsson, 1986[href=https://www.wicell.org#bib4]; Houot et al., 2013[href=https://www.wicell.org#bib5]). That is why we prepare the material immediately before injection and do not store these solutions for any length of time. We also avoid cooling the material to 4°C as this will result in precipitation of the busulfan crystals and inaccurate dose delivery. We also do not freeze busulfan solutions in order to avoid potential problems with loss of activity.\nThe calculated volume of drug is delivered via an intraperitoneal injection.\nRepeat steps 3–7 24 h later on day −1 before transplantation.\nTwenty-four hours later, on day 0, transplant donor bone marrow cells into the busulfan-conditioned mice.\nThe precise composition of the donor cells is variable. In some cases, total bone marrow is transplanted, but purified HSCs may also be used. When purified HSCs are transplanted into lethally irradiated recipients, they are usually mixed with a small number of total bone marrow cells. This “carrier marrow” is thought to ensure survival of the myeloablated recipients until the donor HSCs generate enough mature blood cells to do so. Our experience is that carrier marrow is not needed when purified HSCs are transplanted into Busulfan-conditioned recipients (Montecino-Rodriguez et al., 2019[href=https://www.wicell.org#bib10]). The reason for this is discussed in more detail below.\nBusulfan treated mice may be temporarily immunocompromised and should be placed in sterile cages with sterilized bedding, food, and water for 3 weeks following drug treatment and transplantation. We never treat mice with antibiotics because of their potential to inhibit hematopoiesis (Josefsdottir et al., 2017[href=https://www.wicell.org#bib8])."
  ],
  "subjectAreas": [
    "Health Sciences",
    "Immunology",
    "Model Organisms",
    "Stem Cells"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}