{
  "id": 9346,
  "origin_website": "Jove",
  "title": "Biotinylated Cell-penetrating Peptides to Study Intracellular Protein-protein Interactions",
  "procedures": [
    "All experimental procedures were carried out at the University of Salamanca.\n1. Cells\nTwo days before starting the procedure, plate the cells at the required density to be confluent the day of the experiment. Plate the cells in flasks or plates. However, the protein extraction will be easier from plates. It is convenient to prepare at least 4 plates of 78 cm2 or 2 flasks of 150 cm2 per condition per experiment, to be sure that the results are consistent.\nIn this study, plate human G166 GSCs in 4 flasks of 150 cm2, cultured in RHB-A stem cell medium supplemented with 2% B27, 1% N2, 20 ng/mL EGF and b-FGF as described by Pollard et al.22. Process when confluence was reached. For instance, when 5 x 106 G166 cells were plated in a 150 cm2 flask, they were processed 2 days after plating.\n2. Biotinylated CPPs\nSpin the vials containing the lyophilized biotinylated CPPs (BCPPs) at 8200 x g for 30 s, to avoid some of the powder remaining on the lid. Include a control BCPP to be sure that the interactions found are specific of the target sequence. In this study, the control BCPP was TAT-biotin (TAT-B) and the treatment BCPP was TAT-Cx43266-283-B. Other controls could be used, such as TAT fused to scrambled or mutated fragments bond to biotin.\nDissolve the BCPPs in the corresponding culture medium to the stock solution indicated by the manufacturer; for instance, to obtain a stock solution of 2 mg/mL BCPP to treat GSCs add 0.5 mL of GSC culture medium to one vial containing 1 mg of the BCPP. Vortex and make sure the peptide is well dissolved.\n3. Tubes\nNOTE: Prepare at least twelve 1.5 mL tubes per condition required in the Section 7.",
    "Mark the first 3 tubes per condition. They will have the total volume of cellular lysates obtained in step 6.4.\nMark an A in 3 tubes per condition. These tubes will have the first supernatants obtained after lysing and spinning the cellular lysates, step 7.2.\nMark a B in 3 tubes per condition. These tubes will have a small aliquot of the first supernatants. These lysates will serve as the Western blot samples in step 7.3.\nMark a C in 3 tubes per condition. These tubes will have the supernatants obtained after the pull-down with NeutrAvidin, step 7.7.\n\tNOTE: This is important in case the Western blot showed no signal for proteins, meaning the proteins were not pulled down or were lost at some step of the procedure. If this were the situation, repeat the process to pull down the proteins.\n4. Cellular treatment with the BCPPs\nAspirate the culture medium.\nReplace the corresponding volume of fresh medium required to incubate the BCPPs in the smallest possible volume of medium according to the incubation times. It is very important that in any case, the medium covers completely the whole surface of the plate/flask so that the cells do not dry out, for instance, 6 mL per 150 cm2 for a 30 min incubation.\nAdd the volume of the stock solution of BCPP to the cell cultures to reach the concentration that has been proved to be effective. In this study 50 µM TAT-Cx43266-283-B has been proved to reduce GSC proliferation.",
    "Therefore, add 92.8 µL of 2 mg/mL TAT-Cx43266-283-B (MW=3723.34 g/mol) per mL of culture medium to obtain a final concentration of 50 µM TAT-Cx43266-283-B. If the volume to be added is different for control peptides, complete with culture medium up to the same final volume. For instance, 49.1 µL TAT-B (MW=1914.31 g/mol) plus 43.7 µL GSC medium were added per mL of culture medium to obtain a final concentration of 50 µM TAT-B.\nPlace the cells in the incubator at 37 °C and 5% CO2 for 30 min to make sure that the interactions between the BCPP and its intracellular partners take place. If the interaction takes longer, incubate for longer times or adjust times in case the experiment consisted of a time-course. In addition, the interaction of interest can be promoted or prevented by stimulating different intracellular signaling pathways.\n5. Buffers and solutions.\nPrepare PBS pH 7.4: 136 mM NaCl; 2.7 mM KCl; 7.8 mM Na2HPO4·2H2O; 1.7 mM KH2PO4.\nPrepare protein lysis buffer: 20 mM Tris-HCl (pH 8.0), 137 mM NaCl, 1% IGEPAL, Prior to use, add the following: 1/100 (v/v) Protease Inhibitor Cocktail, 1 mM Sodium Fluoride, 1 mM Phenylmethanesulfonyl fluoride (PMSF) and 0.1 mM Sodium orthovanadate.\nPrepare Laemmli buffer: (4x: 0.18 M Tris-HCl pH 6.8; 5 M glycerol; 3.7 % SDS (p/v); 0.6 M β-mercaptoethanol or 9 mM DTT; 0.04 % (v/v) bromophenol blue (BB)).\n6. Protein extraction\nNOTE: Protein extraction was performed as previously described20,23. Carry out this whole section of the procedure at 4 °C.\nAspirate the culture medium completely.\nWash 3 x 10 mL of with ice-cold phosphate buffered saline (PBS) per 150 cm2 very carefully to avoid cell detachment.",
    "To obtain the cell lysate, add 3 mL of lysis buffer per 150 cm2 and thoroughly scrape the surface by using a cell scraper. Tilting the plate/flask to about 45 degrees will make easier to gather the cell lysates into their corresponding tubes.\nPour 1 mL of the cellular lysate per tube in three 1.5 mL tubes. These tubes will be marked with the condition and the replicate as indicated in step 3.1.\n7. Pull-down\nCentrifuge the 1.5 mL tubes at 11,000 x g for 10 min at 4 °C.\nTransfer the supernatants to new tubes (A).\nTake an aliquot of this supernatant per condition to different tubes (B), i.e. 50 µL per tube. Add 4x Laemmli buffer (16.6 µL for 50 µL of lysate) and freeze at -20 °C. These lysates will serve as usual Western blot samples.\nHomogenize very well the NeutrAvidin Agarose by gentle shaking. Cut the tips of the pipette tips to increase their diameter and improve the pipetting of the beads. Add 50 µL of NeutrAvidin Agarose per mL of cell lysate in the (A) tubes.\nIncubate at 4 °C overnight with very gentle shaking to allow NeutrAvidin to interact with BCPPs bound to their intracellular partners.\nCentrifuge at 3,000 x g for 1 min at 4 °C to collect the complex of NeutrAvidin with proteins.\nCarefully remove the supernatants and transfer them to clean tubes (C). Keep them to use them in case the pull-down is not successful.\nWashing steps: add fresh lysis buffer to the pellets (tubes A), resuspend by inversion and repeat the steps 7.6) and 7.7) for 5 more times. All these supernatants can be discarded.",
    "Remove the supernatants and add 2x Laemmli buffer to the desired final volume (40 µL per 1.5 mL tube for pellets obtained from 150 cm2 flasks of confluent cells).\nElute at 100 °C for 5 min to dissociate the interactions between proteins and centrifuge for 30 s at 8,200 x g to pellet NeutrAvidin beads.\nTake the supernatants, containing the dissociated proteins, with capillary tips to new tubes (D). The beads can be kept in case repeating elution steps is required.\n\tNOTE: The supernatants (tubes D) are now ready to be loaded in Western blot or to freeze at -20 °C.\n8. Western Blot\nNOTE: Western blotting was performed as previously described24.\nLoad equivalent volume of each sample per lane on Bis-Tris (4-12%) midigels in a Midi-Cell Electrophoresis System.\nTransblot proteins using a dry blotting system into a nitrocellulose regular stack.\nStain the membrane with 10% Ponceau for 10 min.\nWash the membranes 3 x 5 min with 5 mL of TTBS.\nBlock the membranes with 7% milk in TTBS for 1 h with gentle shaking in tubes or small boxes. Make sure the volume used is enough to cover the membranes and that they do not dry, i.e. 40 mL per whole midi membrane.\nWash 3 x 5 min with 5 mL of TTBS.\nIncubate overnight at 4 °C with the primary antibody against the protein of interest with gentle shaking.\nWash 3 x 5 min with 5 mL of TTBS.\nIncubate the membrane at room temperature with the correspondent peroxidase-conjugated secondary antibody in TTBS for 1 h.\nWash 3 x 5 min with 5 mL of TTBS.\nDevelop with a chemiluminescent substrate in a chemiluminescence system.\n9. Problem Solving",
    "If after developing the Western blot any of the samples showed no signal at all for proteins, check the Ponceau.\n\tNOTE: The membrane in Ponceau should show undefined and numerous bands along the lanes loaded. If the bands are not very noticeable, the quantity of proteins loaded may not be enough or the transference may have gone incorrectly. Consider repeating the Western blot.\nIf there is no stain at all in the Ponceau membrane in any lane, repeat the whole procedure from the step 7.4 in the (C) tubes.\nIf after developing the Western blot a protein signal is very weak but the Ponceau showed proteins, incubate again the membrane with the primary antibody for longer time. If the signal is still rather weak, incubate again at room temperature.\n10. Other Techniques Used in this Article\nImmunocytochemistry of BCPPs\nFix cells in 4% paraformaldehyde (0.2 mL per cm2) for 20 min.\nWash 3x 5 min with PBS (0.2 mL per cm2).\nApply the corresponding antibody (at least 0.15 mL per cm2) diluted in antibody solution at the manufacturer's indicated concentration against your protein of interest overnight at 4 °C.\nIncubate with a fluorophore-conjugated secondary antibody (0.15 mL per cm2) for 2 h at room temperature.\nRepeat steps 10.1.2-10.1.4 with other antibodies against your proteins of interest. Be careful not to use the same species for different primary antibodies or same wavelength fluorophores for secondary antibodies.\nMount the cells using the antifade reagent (0.005 mL per cm2).\nAnalyze on a fluorescence microscope connected to a digital camera.\nMTT assay\nCulture the cells at 37 °C in 24-well plates.\nIncubate the cells in the dark for 75 min with 0.15 mL of culture medium per cm2 containing 0.5 mg/mL MTT.",
    "Aspirate the medium and incubate the cells for 10 min in the dark with dimethyl sulfoxide (0.25 mL per cm2) with mild shaking.\nMeasure the absorbance at a wavelength of 570 nm using a microplate reader."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}