{
  "id": 2660,
  "origin_website": "Cell",
  "title": "Isolation and phenotypic characterization of human and nonhuman primate intestinal lamina propria mononuclear cells",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nTissue collection and transport\nTiming: 30–40 min\nIntestinal tissues collected at animal necropsies or during patient surgery should be processed within 2 h of collection, as to avoid major cellular damages (troubleshooting 1[href=https://www.wicell.org#sec6.1]). If not processed immediately after collection, we recommend storage of the tissue at 4°C in TS.\nColonic tissues should be transported in a sterile container filled with 150 mL of cold TS. This volume can be scaled-up or down according to the size of the intestinal tissue. For instance, if the whole NHP descending colon is collected, transport in 250 mL of TS is recommended. Human tissues of up to 5 cm length, should be transported in 50 mL of TS.\nCritical: Keep the TS in ice during the “waiting” time of surgical retrieval.\nColonic tissue enzymatic digestion to obtain a single cell suspension\nTiming: 3.5–4 h\nThis section provides information for optimal dissection and digestion of the sigmoid colon to liberate LPMCs. An overview of the whole protocol is shown in Figure 1[href=https://www.wicell.org#fig1].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2153-Fig1.jpg\nFigure 1. Step by step illustration of the procedures required to obtain a single-cell suspension of LPMCs\nCritical: For optimal results, ensure that the tissue is kept in solution at each step of this protocol.\nRemove the tissue from the TS and identify the different portions of the intestine. Figure 2[href=https://www.wicell.org#fig2]A helps to identify portions and corresponding size of the distal NHP intestine. We suggest to place the intestine in a 150 mm × 15 mm Petri dish containing 30 mL of TS.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2153-Fig2.jpg\nFigure 2. Representative example of a portion of the lower NHP intestinal tract and of the sigmoid colon resection used for processing\n(A) Identification of the anus, rectum, sigmoid colon and the distal portion of the descending colon.\n(B) Sigmoid colon resection.",
    "(C–G) Initial steps of the protocol: removal of the external fat (C); opening of the intestinal tube (D); view of the mucosa from the luminal side (E); view from the muscularis side (F); removal of the muscular layer (G).\nNote: This step might not be required when processing human colonic tissue. In our experience, portions of sigmoid/descending colon of about 3–5 cm in length were usually provided.\nDissect the sigmoid colon from the rest of the large intestine (Figure 2[href=https://www.wicell.org#fig2]B) and, using sterile forceps, place it inside a 100 mm × 20 mm Petri dish containing 10 mL of TS.\nUsing scissors, remove the external fat (Figure 2[href=https://www.wicell.org#fig2]C) and carefully open the intestinal tube (Figure 2[href=https://www.wicell.org#fig2]D) to expose the luminal side (Figure 2[href=https://www.wicell.org#fig2]E).\nRemove the fecal material by gently washing the tissue with TS.\nTransfer the tissue to a new 150 mm × 15 mm Petri dish filled with 10 mL of TS.\nRepeat the washing steps 2–3 times, until the fecal material is completely removed.\nUsing scissors and forceps, carefully remove the muscular layer, without cutting the mucosae (Figure 2[href=https://www.wicell.org#fig2]G).\nNote: The epithelial luminal side of the tissue (Figure 2[href=https://www.wicell.org#fig2]E) can be easily distinguished from the muscular side (Figure 2[href=https://www.wicell.org#fig2]F) because of the pinkish tinge of the mucosae. The muscular layer appears white (Figures 2[href=https://www.wicell.org#fig2]F and 2G).\nThe removal of the underlying muscular layer will allow a better enzymatic access to the mucosal tissue.\nCut the tissue in two sections no greater than 3 × 4 cm (12 cm2, Figure 3[href=https://www.wicell.org#fig3]A) and transfer each of them in a 50 mL Falcon tube pre-filled with 25 mL of pre-digestion solution (Figures 3[href=https://www.wicell.org#fig3]B and 3C).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2153-Fig3.jpg\nFigure 3. A representative example of the pre-digestion phase of the protocol to liberate intestinal epithelial cells (IECs) at steps 5–7",
    "(A–D) The tissue is cut in two portions of 12 cm2 (A, B), transferred to a Falcon tube pre-filled with digestion solution (C, first enzymatic digestion step), and incubated at 37°C for 20 min (D). (E, F) After the enzymatic digestion, wash the tissue (E) and transfer it to a Falcon tube pre-filled with digestion solution (F, second enzymatic digestion step). (G) IECs are visible as a pellet deposit.\nNote: Treatment with DTT and EDTA during the “pre-digestion” step allows to remove any remaining mucus and to liberate intestinal epithelial cells (IECs).\nIncubate at 37°C for 20 min inside a shaking incubator (Figure 3[href=https://www.wicell.org#fig3]D).\nNote: We used a VorTemp 1550 shaking incubator set at 800 RPM. If not available, a similar instrument can be used.\nUsing forceps, collect the tissue, place it inside a Petri dish.\nWash with 10 mL of 1× PBS (Figure 3[href=https://www.wicell.org#fig3]E).\nTransfer it inside a 50 mL Falcon tube pre-filled with 25 mL of pre-digestion solution (Figure 3[href=https://www.wicell.org#fig3]F) (refers to materials and equipment[href=https://www.wicell.org#materials-and-equipment] section).\nIncubate at 37°C for 20 min inside a shaking incubator.\nCritical: The pre-digestion step here is repeated twice to completely remove mucus and liberate IECs. Those are visible as a pellet deposit in Figure 3[href=https://www.wicell.org#fig3]G.\nFollowing the pre-digestion step, the IECs remain in the pre-digestion solution and can be either discarded, or collected for further phenotypic and functional assays. However, in the latter case, the protocol may require further adjustment because it was not optimized to preserve IECs viability.\nUsing forceps, collect the tissue, place it inside a Petri dish.\nWash with 10 mL of 1× PBS.\nWash with 10 mL of HBSS+Ca/+Mg.\nDissect, using scissors and forceps, each 12 cm2 tissue portions into small pieces no greater than 0.5 × 0.5 cm (Figure 4[href=https://www.wicell.org#fig4]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2153-Fig4.jpg",
    "Figure 4. A representative example of the dissected intestine section in small pieces (step 9) and of the digestion phase (step 10) to liberate LPMCs\nThe tissue is dissected into small pieces (A), that are collected inside a cell strainer (B) and transferred to a Falcon tube filled with enzyme digestion solution (D).\nNote: We suggest to directly cut the tissue inside a cell strainer to facilitate collection and subsequent transfer of the small pieces to a 50 mL tube (Figures 4[href=https://www.wicell.org#fig4]B and 4C).\nTransfer to a 50 mL Falcon tube filled with 25 mL of pre-warmed enzyme digestion solution (Figure 4[href=https://www.wicell.org#fig4]C) (refers to materials and equipment[href=https://www.wicell.org#materials-and-equipment] section).\nIncubate at 37°C for 60 min inside a shaking incubator (Figure 4[href=https://www.wicell.org#fig4]D).\nNote: Prepare the same number of enzyme digestion solution tubes as for the pre-digestion step. Here, we prepared 2 tubes of enzyme digestion solution, one for each 12 cm2 tissue portion.\nAt the end of the incubation:\nPlace a 70-μm cell strainer on top of a new 50 mL Falcon tube.\nTake the tube containing the digested tissue, vortex it and filter the solution through the cell strainer as shown in Figure 5[href=https://www.wicell.org#fig5]A.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2153-Fig5.jpg\nFigure 5. Filtration step after the first enzymatic digestion\nA representative example of the filtration step 12 through a 70-μm cell strainer viewed from different angles (A) to collect LPMC (panel B shows the cell pellet after centrifugation) and transfer of undigested tissue to a Falcon tube filled with enzyme digestion solution (C) in step 18.\nNote: The filtered solution contains the LPMCs whereas the undigested tissue remains inside the cell strainer. Do not discard the undigested tissue (see step 18).\nAdd 25 mL of wash buffer to the 25 mL of LPMCs-containing solution and centrifuge at 500 g for 10 min, 18°C–25°C.",
    "At the end of the centrifugation:\nDiscard the supernatant using a 25 mL pipette.\nResuspend the LPMCs-containing pellet (Figure 5[href=https://www.wicell.org#fig5]B) in 1 mL of wash buffer using 1 mL pipette.\nTransfer it to a new 50 mL Falcon tube and add 49 mL of wash buffer.\nCentrifuge the tube at 500 g for 10 min, 18°C–25°C.\nUsing a 25 mL serological pipette, aspirate and discard the supernatant without disturbing the LPMCs pellet.\nResuspend the LPMCs-containing pellet in 10 mL of wash buffer.\nAny undigested residual tissue in the cell strainer at step 12 should be transferred in a new 50 mL Falcon tube containing 25 mL of digestion solution (Figure 5[href=https://www.wicell.org#fig5]C) and incubated for 30 min at 37°C inside a shaking incubator.\nRepeat steps 12–17.\nPause point: The LPMCs obtained after the first enzymatic digestion at step 17 of the protocol should be keep on ice or at 4°C while completing the second enzymatic digestion of the tissue (steps 18 and 19).\nCritical: Enzymatic digestion allows to liberate cells from the tissue, however the incubation time is a critical factor to be considered. Indeed, surface expression of certain markers can be impacted by digestions longer than 1 h. On the other side, shorter digestions may be not enough to completely liberate cells from the tissue. We have optimized this protocol to perform two sequential digestions (60 min followed by 30 min) rather than one extended digestion to reduce the time cells are exposed to the enzyme, and to replenish the enzyme for optimal activity. Note that the first digestion results in significantly higher yield of LPMCs than the second one.\nAdd the LPMCs obtained after the second digestion to those obtained after the first digestion.\nAdd an appropriate volume of RPMI-1640 medium supplemented with 10% FCS and 1% PSN.",
    "Count the cells.\nNote: We recommend to use an automated cell counter to determine cell count and viability. If not available, trypan blue staining and counting in a hemocytometer is suitable as well.\nLPMCs can be used immediately for culture or can be cryopreserved for long-term storage.\nFor cryopreservation, resuspend the LPMC pellet in freezing media (refer to materials and equipment[href=https://www.wicell.org#materials-and-equipment] section).\nQuickly aliquot 1 mL of the cell suspension per cryovial.\nPlace cryovials into a freezing container and transfer to a - 80°C freezer.\nTransfer cryovials to liquid nitrogen after 24 h.\nNote: For optimal results, we recommend to freeze a minimum concentration of 5 × 106 cells per 500 mL of freezing media and a maximum of 30 × 106 cells per 1 mL of freezing media. Freezing containers, such as CoolCellTM or Mr.FrostyTM, provides the critical 1°C/min cooling rate required for successful cryopreservation of cells.\nStaining of LPMCs for flow cytometry identification of mononuclear phagocyte subsets\nTiming: 1.5 h\nThis section describes how to phenotypically characterize LPMCs by flow cytometry. Staining is performed in a 96 well U-bottom tissue culture treated plate, but canonical 5 mL FACS tubes can be used as well.\nPre-cool centrifuge to 4°C.\nPrepare a viability dye solution in 1× PBS at a suitable concentration – we recommend a dilution factor ranging between 1/1,000 and 1/3,000 for optimal detection of live/dead cells.\nCritical: To obtain a final 1/3,000 dilution, we recommend to prepare an intermediate 1 in 300 dilution by adding 1 μL of the Fixable Dead Cell Stain in 300 μL of 1× PBS. Use 10 μL of this solution to prepare 100 μL of the antibody master mix as described in Tables 4[href=https://www.wicell.org#tbl4] and 5[href=https://www.wicell.org#tbl5].",
    "Note: We recommend to use a marker of cell viability to detect dead cells by flow cytometry analysis. This protocol has been designed for use with the LIVE/DEADTM Fixable Blue Dead Cell Stain kit when working with NHP cells and the LIVE/DEAD™ Fixable Near-IR Dead Cell Stain Kit for 633 or 635 nm excitation, when working with human cells.\nThe dye should be reconstituted with 50 mL of DMSO as per manufacturer’s instructions (https://www.thermofisher.com/document-connect/document-connect.html?url=https://assets.thermofisher.com/TFS-Assets%2FLSG%2Fmanuals%2FMAN0006891_LIVE_DEAD_Fixable_Dead_Cell_Stain_Kits_QR.pdf[href=https://www.thermofisher.com/document-connect/document-connect.html?url=https://assets.thermofisher.com/TFS-Assets%2FLSG%2Fmanuals%2FMAN0006891_LIVE_DEAD_Fixable_Dead_Cell_Stain_Kits_QR.pdf]) and aliquots should be frozen at 20°C protected from light.\nAlternative flow cytometry viability stains can be used with fixable and non-fixable cell samples, but fluorochrome choice and concentration should be adapted by the users.\nPrepare FACS buffer by supplementing 1× PBS with 2%–5% FCS and 2,5 mM EDTA.\nPrepare an antibody master mix to stain cells of interest.\nNote: An example panel of fluorochrome-labeled antibodies to identify MPs among NHP and human LPMCs is shown in Tables 4[href=https://www.wicell.org#tbl4] and 5[href=https://www.wicell.org#tbl5], respectively (the antibody concentrations are titrated for staining in a volume of 100 μL of FACS buffer).\nCritical: Prepare an appropriate volume of master mix according to the number of samples being stained. Always add an extra 1–2 samples to your master mix to account for pipetting error, so a 10× master mix will be good for 8–9 samples.\nNote: The LIVE/DEADTM Fixable Dead Cell Stain can either be used prior to staining cells with the master mix or added directly to the master mix, as shown in Tables 4[href=https://www.wicell.org#tbl4] and 5[href=https://www.wicell.org#tbl5]. We observed a similar separation of live and dead cells by using either protocols.\nAdjust cell concentration to 1–4 × 106 LPMCs per 200 μL of FACS buffer and transfer them to a 96 well U-bottom tissue culture treated plate.",
    "Critical: We recommend to prepare -an unstained control and fluorescence minus one (FMO) controls. Do not add any antibodies to the unstained control. Ideally the FMO cell concentration must be the same as that of the sample concentration, however if unavoidable, lesser cell concentration can be used for the FMOs.\nCentrifuge the plate at 500 g at 4°C for 5 min and aspirate the supernatant by using a multi-channel pipette, without disturbing the cell pellet. Alternatively, supernatant can be removed by flipping the plate.\nResuspend the cell pellet with 100 μL of “saturation solution” per well.\nIncubate for 20 min at 4°C.\nCentrifuge at 500 g at 4°C for 5 min.\nNote: Prepare “saturation solution” by supplementing 1× PBS with 5% macaque serum (if NHP cells are used) or with 5% FCS (if human cells are used).\nAspirate the supernatant and resuspend cells in 100 μL of the antibody master mix prepared in step 25.\nIncubate cells for 15 min at 4°C. Cover the plate with aluminum foil to protect from light.\nAdd 150 μL 1× PBS to each well and centrifuge at 500 g at 4°C for 5 min.\nRemove the supernatant and repeat step 31.\nOptional: If a high contamination by red blood cells (RBC) is observed, a lysis step can be performed by incubating cells during 5 min with 200 μL of 1× BD FACS lysing solution TM (troubleshooting 4[href=https://www.wicell.org#sec6.7]). After incubation wash twice with 200 μL of 1× PBS.\nAspirate the supernatant and resuspend the cell pellet in 200 μL BD CytofixTM buffer per well. To ensure a single cell suspension, pipette up and down several times.\nIncubate for 20 min at 4°C protected from light.\nNote: A solution of 1%–4% PFA can be also used for fixation of samples for flow cytometry.",
    "Critical: For biosafety reasons, fixation of human tissues is mandatory.\nAdd 100 μL 1× PBS to each well and centrifuge at 500 g at 4°C for 5 min.\nAspirate the supernatant and resuspend the cell pellet in 200 μL 1× PBS.\nTransfer the cells into a 5 mL FACS tube for acquisition at a flow cytometer.\nAdd 100–200 μL of 1× PBS according to the number of cells being stained.\nPause point: Samples may be kept at 4°C protected from light and be run the following day if samples have been fixed.\nNote: Samples can be left in the 96-well plate if the flow cytometer is equipped with an HTS attachment for automated sample collection.\nCollect data with a- BD LSRFortessa or a Beckman Coulters NaviosEx flow cytometer and analyze by using FlowJo software."
  ],
  "subjectAreas": [
    "Cell Isolation",
    "Immunology",
    "Flow Cytometry"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology"
  ]
}