{
  "id": 4460,
  "origin_website": "Bio",
  "title": "Assays of Polyphenol Oxidase Activity in Walnut Leaf Tissue",
  "procedures": [
    "Crude protein extract   Collect several leaves from sample tree and gently wash off dirt with deionized (DI) water, then pat completely dry.   Seal leaves into 50 ml centrifuge tube and place in liquid nitrogen to flash freeze. Frozen leaf tissue may be stored at -80 °C.   Grind tissue in a liquid nitrogen cooled mortar and pestle, being sure to keep adding liquid nitrogen to ensure the tissue does not thaw. A fine powder is desired.   Add 6.0 ml of protein extraction buffer and 0.5 g of insoluble PVP to a 30 ml Oak Ridge tube. Place the tube on a balance and tare.   Add ~1 g of ground, frozen leaf tissue to the tube. Tissue can be added using a liquid nitrogen cooled metal spatula, with mass read directly on the balance.    Vortex the tissue slurry immediately to allow the frozen tissue to thaw in the presence of the buffer. Continue vortexing for 2 min.   Centrifuge sample at 20,000 x g for 20 min at 4 °C.   Aliquot ~200 µl volumes of the supernatant into 1.5 ml microfuge tubes and transfer the tubes to -80 °C for storage. (It is ideal to reduce freeze/thaw cycles so only the needed volume should be thawed at one time. If a sample is thawed three times, it should be discarded.)   To determine total protein concentration, perform a Bradford assay according to the reagent manufacturer’s instructions with BSA standard concentrations of 25 µg/ml, 20 µg/ml, 12.5 µg/ml, 10 µg/ml, 5 µg/ml, and 1 µg/ml.   Dilute the crude protein extract to 1/400 with ultrapure water for the Bradford assay. This dilution should be within the range of the BSA standards.       Spectrophotometric assay   Prepare sodium phosphate buffer with phenolic substrate per recipe.   Obtain protein samples from -80 °C and place on ice to thaw.",
    "Warm up the plate reader or spectrophotometer, setting at 490 nm (for tyrosine or L-DOPA substrates) and choosing the kinetic option. Read times range from 3 min (most diphenol substrates) to 3 h (many monophenol substrates). If using a plate reader, it should be set to read every two minutes, with shaking for 15 sec before each read. If using a spectrophotometer, it should be set to read every 15 sec. See notes on latency below.   Determine the buffer quantity needed for the experiment (200 µl/well for plate reader or 1 ml/cuvette for spectrophotometer). 2-3 technical replicates of each sample are typically performed. In addition, parallel assays containing 1 mM Kojic acid should be performed. Kojic acid is a specific inhibitor of PPO, so these experiments provide a negative control, assuring that measured activity derives from PPO enzymes.   Transfer the necessary buffer volume to a centrifuge tube and then add 280 Units of catalase per milliliter of buffer. The catalase eliminates any H2O2, preventing the activity of peroxidases, some of which also oxidize phenolic compounds.    Aliquot buffer samples into a 96-well plate or a cuvette. If using the plate reader, be careful to avoid bubbles caused by the SDS since they can interfere with accurate readings. Bubbles are best avoided by placing the pipette tip against the wall of the well and steadily dispensing the buffer.   Add desired volume of thawed, mixed protein extract to buffer (typically 5 µl per 200 µl of buffer).   Place the plate/cuvette into the plate reader/spectrophotometer and begin the read. If using a spectrophotometer, the sample should be manually mixed between readings (with a pipet tip or stir stick) to aerate. Pre-programmed shaking provides aeration in the plate reader.",
    "Given that the reaction catalyzed by PPO enzyme consumes oxygen (Figure 1), aeration is important to ensure adequate oxygen availability and thus accurate activity data.    Typical PPO activity data (plate reader assay, tyrosine substrate) is provided in Figures 2 and 3.   imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140817/20140817053850_3344.jpg Figure 2. Spectrophotometric PPO activity assay using a microplate reader. A. Assay at time 0 (just after addition of protein extract). B. Assay after two hours. All wells contain tyrosine (4 mM) as substrate. Wells 1-4 also contain 1 mM kojic acid, a PPO inhibitor.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140821/20140821173230_8528.jpg Figure 3. Sample data (Abs490) of well A8 from Figure 2      Oxygen electrode assay   Prepare sodium phosphate buffer with substrate solution as per recipe. Note: Omit catalase in this assay since the catalase can substantially alter dissolved oxygen levels and give inaccurate data. This makes Kojic acid controls especially critical.   Obtain protein samples from -80 °C and place on ice to thaw.   Set up and calibrate the oxygen electrode apparatus according to manufacturer’s instructions.    Pipette 1 ml (may vary depending on equipment) of buffer into the oxygen electrode chamber.   Pipette desired volume of crude protein extract (typically 25 µl) into the chamber and seal.   Measure oxygen consumption. Assay time can range from 10 min-4 h. Monophenol substrates typically require long measurement times due to relatively low activity and long PPO latency times.       Calculating PPO enzyme activity   For spectrophotometric and plate reader assays, calculate change in Abs490/min/mg total protein. Calculate based on initial rate of takeoff because the quinone products of PPO activity will oxidize proteins (including PPO), thus reducing activity over time.    For oxygen electrode assay, calculate nmoles O2 consumed per milliliter per minute per mg total protein.",
    "Again, calculate based on initial rate using software to obtain nmol/ml/min value and then dividing by the amount of protein that was added to the sample in mg.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140821/20140821172342_8074.jpg Figure 4. PPO activity data measured using an oxygen electrode. After a latent period of ~50 min, rapid oxygen consumption commenced. PPO activity was calculated based on this initial rapid rate of oxygen consumption (slope between the two black vertical lines). The rate slows over time due to oxidative damage of proteins (including PPO) caused by the product quinones. X axis is oxygen concentration (nmol/ml), Y axis is time elapsed."
  ],
  "subjectAreas": [
    "Plant Science",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}