{
  "id": 1562,
  "origin_website": "Cell",
  "title": "Application of pseudotyped virus particles to monitor Ebola virus and SARS-CoV-2 viral entry in human cell lines",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nProduction of recombinant MLV-EBOV-GP/MLV-SARS-CoV-2-S replication-incompetent pseudoviruses\nTiming: 4 days\nIn these steps, the MLV-EBOV-GP or MLV-SARS-CoV-2-S pseudovirus particles will be produced by employing co-transfection of three plasmids in HEK293T cells.\nDay 1. Keep HEK293T cells in cell culture for at least 2 passages (Ratnapriya et al., 2020[href=https://www.wicell.org#bib13]) and maximum 20 passages before starting the experiment. The cells should grow exponentially and exhibit healthy morphology (Figure 1[href=https://www.wicell.org#fig1]A). Wash HEK293T cells gently with 1× DPBS and resuspend them in fresh complete DMEM medium.\nDetach the cells with repeated up and down pipetting.\nCount the cells by using a hemocytometer and adjust the cell concentration to 5 × 105 cells/well in a 6-well plate. Ideally, the cells should reach 50–60% confluency at the day of transfection.\nDay 2. Transfection of the cells.\nCritical: At this point, continue the work in a BSL-2 facility. Before starting, make sure that all the required equipment for BSL-2 work, waste management and decontamination are available and properly function. Prepare all the necessary solutions for decontamination in a sufficient amount.\nReplace the medium with 1 mL fresh complete DMEM medium/well.\nPrepare the transfection complex solution in a 1.5 mL tube. Table 1[href=https://www.wicell.org#tbl1] shows the amount of reagents needed for 1 well of a 6-well plate. After mixing the OPTI-MEM and Genejuice, briefly vortex and spin (200 × g, 30 s) the solution, and incubate it for 5 min at room temperature (RT; 20°C–23°C). Components of the transfection mixture. The final amounts for the transfection complex solution are sufficient for 1 well of a 6-well plate. The ratio of total plasmid to Genejuice is 1:3.\nAlternatives: Other commercially available or self-prepared transfection reagents can also be employed. We describe the protocol by employing Genejuice transfection reagent.",
    "Add pCMV-MLV-gag-pol, pCMV-Luc and pcDNA3.1-EBOV-GP or pcDNA3.1-SARS-CoV-2-S to the transfection reagent mix and briefly vortex/spin (200 × g, 30 s) the sample. Table 1[href=https://www.wicell.org#tbl1] demonstrates the amounts of plasmids necessary for efficient pseudovirus production.\nTo produce MLV pseudovirus particles without viral surface glycoprotein (MLV-control) add pCMV-MLV-gag-pol, pCMV-Luc and pcDNA3.1 empty vector to the transfection complex solution and briefly vortex/spin (200 × g, 30 s) the sample.\nAfter 15 min incubation, the transfection complex solution is gently pipetted drop-wise on the cells. The transfection complex solutions are mixed by gentle swirling of the plates to ensure equal distribution. The transfected cells are incubated in a cell culture incubator at 37°C and with 5% CO2.\n6 h later, replace the medium with fresh complete medium by gentle pipetting.\nCritical: It is important to remove the medium with extra caution in order to avoid cell loss, because HEK293T cells tend to detach easily from plastic surfaces.\ntable:files/protocols_protocol_1002_5.csv\nDay 3. Collect the pseudovirus supernatants at 24 h after medium change in 50 mL centrifuge tubes, store them at −80°C and add 1 mL fresh complete DMEM on the cells.\nDay 4. Collect the pseudoviral supernatants of the cells in 50 mL centrifuge tubes at 48 h after medium change, store them at −80°C. The two batches are stored separately.\nNote: Cells tend to round up and detach at this stage.\nNote: In general, the medium does not show significant pH changes at this stage. The color of medium does not turn to yellow or purple.\nPause point: At this point, pseudoviral supernatants can be stored at −80°C until further usage. Alternatively, according to our experiments viral supernatants can be stored in −20°C for a shorter period of time (∼1 week) without losing efficiency.",
    "Thaw the pseudoviral supernatants and pool the two batches. Next, filter them by employing a 0.45 μm PVDF filter unit to remove cell debris. Store the filtered pseudoviral supernatants at −80°C.\nOptional: Centrifugation can be employed prior to filtration to remove cell debris (600–900 × g for 8 minutes at 4°C). This might help to avoid clotting of the cells in the filter.\nNote: Prepare aliquots of the pseudoviral supernatants (e.g. 1-1 mL), which can be completely used up for a single experiment in order to avoid freeze-thaw cycles.\nPause point: At this point, viral supernatants can be kept at −80°C until further usage.\nIn order to confirm efficient transfection, wash and lyse the remaining cells (1 well/6-well) in plate employing 55 μL luciferase lysis buffer. Transfer 50 μL cell lysate to a 96-well white microtiter plate and incubate it for 15 min at RT. Add 90 μL luciferin substrate to the lysates and measure the luciferase activity immediately by a luminometer with 500 ms integration. We typically measure ∼8–10 × 107 Relative Luminescence Unit (RLU) in 1 well of a 6-well plate of HEK293T cells.\nTransduction of EA.Hy926 cells with MLV-EBOV-GP pseudoviruses\nWe employed EA.hy926 endothelial hybridoma cells because they are susceptible to Ebola virus infection (Imre et al., 2021[href=https://www.wicell.org#bib8]). In these steps, human EAhy.926 cells are transduced by MLV-EBOV-GP pseudoviral particles. The pseudovirus entry efficiency is quantified by measuring luciferase activity.\nTiming: 3 days",
    "Day 1. Keep EA.hy926 cells in cell culture. In our experiments, we leave cells in cell culture for at least 2 passages before starting the transduction. The cells should grow exponentially and exhibit healthy morphology (Figure 1[href=https://www.wicell.org#fig1]B). Wash EA.hy926 cells with 1× DPBS and detach the cells by employing Trypsin/EDTA (0.05%) typically incubating less than 5 min at 37°C. Resuspend the cells in 10 mL prewarmed fresh complete RPMI1640 medium and count the cells.\nSeed 2 × 105 cells in 1 mL/well in a 12-well plate to reach 70–80% confluency on the next day.\nDay 2. Thaw MLV-control/MLV-EBOV-GP viral supernatants and prewarm them at 37°C (not longer than 15 min prior to experiment). Completely remove medium on the cells and replace it with 1-1 mL pseudoviral supernatant. Incubate the cells at 37°C in 5% CO2.\nNote: In our experiments, the optimal titer to infect the cells is the undiluted pseudoviral supernatant.\nOptional: Prior to first measurement, it is recommended to titrate the pseudoviruses. Make 1:2 serial dilution of the supernatants as shown in Figure 3[href=https://www.wicell.org#fig3]A. Measure luciferase activity as described at step 12 and plot a Titer/Relative Luminescence Unit (RLU) curve to determine the most efficient volume for transduction (Figure 3[href=https://www.wicell.org#fig3]B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1002-Fig3.jpg\nFigure 3. Two-fold serial dilution of MLV-control and MLV-EBOV-GP pseudoviral supernatants\n(A) Dilution scheme on a 12-well plate using three technical replicates. The increasing darkness of the color represents the increasing concentration of the pseudovirus particles in the actual well. MLV-control is depicted with gray and MLV-EBOV-GP is depicted with orange color. The red numbers represent the volume of the pseudovirus supernatants and the black numbers show the volume of complete medium in one well (total volume is 1 mL/well).",
    "(B) The detected light intensity by employing a 1:2 serial dilution of the viral supernatants measured by luminometer. EA.hy926 cells were transduced with indicated volumes of MLV-control and MLV-EBOV-GP pseudoviral supernatants. The samples were harvested at 24 h and luciferase activity was measured as described in the protocol (n=3). The data represent means +/- sd.\nDay 3. Detection of the luciferase activity\nThaw the Luciferase Lysis Buffer and prepare sufficient amount of 1× solution by adding ddH2O to the concentrate.\nPrepare the Luciferase substrate by dissolving Luciferase Assay Substrate (lyophilized) with Luciferase Assay Buffer. Prepare aliquots to avoid freeze-thaw cycles and store them at −80°C.\nRemove the supernatant of the cells. Wash the cells by using 300 μL 1× DPBS solution and add 200 μL Trypsin/EDTA (0.05%) solution to the cells. Incubate at 37°C for 5 min.\nNote: Some proportion of the infected cells tend to float, therefore it is recommended to keep the removed supernatant and the 1× DPBS that was used for washing the cells, and pool them together with the trypsinized cells (step d.).\nStop the reaction by adding 300 μL complete medium onto the cells. Detach the cells by gently pipetting up and down. Collect the cells in 1.5 mL tubes.\nCentrifuge the cells at 200 × g for 4 min at RT and discard supernatant carefully.\nResuspend the cell pellet with 1 mL 1× DPBS and centrifuge at 200 × g for 4 min.\nCarefully discard the supernatant and use a 200 μL tip to completely remove the rest of the supernatant without disturbing the cell pellet.\nAdd 55 μL Luciferase Lysis Buffer (1×) to the cell pellet and mix by pipetting up and down few times. Avoid bubbles.",
    "Incubate the lysates for 15 min at RT. During incubation time the following steps should be accomplished:\nTransfer 50 μL lysate to 96-well white microtiter plate.\nThaw the Luciferase Substrate 10–15 min prior to detection at RT.\nNote: Colder temperatures can negatively influence luciferase activity therefore make sure that the substrate temperature reaches RT before usage. Protect the Luciferase substrate from light.\nStart the luminometer and setup the detection software. We employ 500 ms integration time.\nNote: We have tested various integration times. Integration times between 5 ms and 1000 ms showed no significance differences. Short, 1 ms integration time results in bigger variability of the data. Too long integration time can cause a delay in the sample detection of the subsequent samples leading to different incubation intervals.\nAdd 90 μL of Luciferase Substrate to 50 μL lysate and mix the samples by carefully swirling the plate.\nStart measurement after 20 s incubation period at RT.\nNote: Alternatively to the use of Luciferase Substrate from Promega, after cell lysis and transfer of the cell lysates into 96-Well microplate (see step 12i.), add 100 μl of Firefly Luciferase Assay Buffer (Solution A, see materials and equipment[href=https://www.wicell.org#materials-and-equipment]) and 50 μl Luciferin Substrate Solution (Solution B, see materials and equipment[href=https://www.wicell.org#materials-and-equipment]). Measure after 20 seconds incubation at RT with luminometer (see step 12k.).\nNote: Since the peak intensity of detected light starts to slowly decline typically in 3–4 minutes after adding the substrate, it is recommended to use multichannel pipette for simultaneous sample detection of multiple samples. Alternatively, plate readers equipped with injectors can be employed, which ensure unified time interval between substrate injection and detection.",
    "Note: In general, longer incubation time than 24 hours results in a minimal increase of the detected luminescence intensity. However, 48 hours incubation leads to higher variability of the results. Therefore, we typically used 24 hours for detection. Figures 4[href=https://www.wicell.org#fig4]A and 4B show the comparison between 24 and 48 hours measurements. Others reported that the luciferase activity peaks at 24 h (Ebola-GP) and 48 h (SARS-CoV-2-S) by employing VSV pseudotyped viruses (Lay Mendoza et al., 2020[href=https://www.wicell.org#bib9]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1002-Fig4.jpg\nFigure 4. Detection of luciferase activity on MLV pseudovirus transduced cell lines\n(A) EA.hy926 cells were transduced with 1-1 mL MLV-control and MLV-EBOV-GP pseudoviral supernatants. The samples were harvested after 24 and 48 h (24 h and 48 h) and luciferase activity was measured as described in the protocol. The data represent means +/- sd. To test significance Student′s t-test was performed. ∗∗∗p<0.001; ∗∗∗∗p<0.0001; ns-non significant. n=4 (24 h) and n=3 (48 h).\n(B) HuH-7 cells were transduced with 1-1 mL MLV-control and MLV-SARS-CoV-2-S pseudoviral supernatants. The samples were harvested and luciferase activity was measured at 24 and 48 h as described in the protocol. The data represent means +/- sd. To test significance Student′s t-test was performed. ∗∗∗p<0.001; ns-non significant. n=4 (24 h) and n=3 (48 h).\nTransduction of HuH-7 cells with MLV-SARS-CoV-2-S pseudoviruses\nHuH-7 cells were selected for transduction experiments because they express angiotensin-converting enzyme 2 (ACE-2), the host binding site of the SARS-CoV-2-Spike protein and therefore these cells are susceptible to infection (Hoffmann et al., 2020[href=https://www.wicell.org#bib7]). In these steps, human HuH-7 cells are transduced by MLV-SARS-CoV-2-S pseudoviral particles. The pseudovirus entry efficiency is quantified by measuring luciferase activity at 24 h.\nTiming: 3 days",
    "Day 1. Keep HuH-7 cells in cell culture for at least 2 passages before starting the experiment. The cells should grow exponentially and exhibit healthy morphology (Figure 1[href=https://www.wicell.org#fig1]C). Wash HuH-7 cells with 1× DPBS and detach the cells by trypsinization typically incubating less than 5 min at 37°C. Resuspend the cells in 10 mL prewarmed fresh complete DMEM medium.\nNote: Here we describe the transduction of HuH-7 cells, which are permissive to corona viruses (Freymuth et al., 2005[href=https://www.wicell.org#bib6]), however other permissive cell lines, such as Caco2 cells can be also transduced by MLV-SARS-CoV-2-S pseudoviruses (Hoffmann et al., 2020[href=https://www.wicell.org#bib7]).\nSeed 2 × 105 cells/well in a 12-well plate to reach 70–80% confluency on the next day.\nDay 2. Thaw MLV-control/MLV-SARS-CoV-2-S pseudoviral supernatants and prewarm them at 37°C. Completely remove medium on the cells and replace it with 1-1 mL pseudoviral supernatant. Incubate the cells at 37°C in 5% CO2.\nDay 3. Detection of the luciferase activity. The next steps are identical to step 12. Please follow the sub-steps described under step 12."
  ],
  "subjectAreas": [
    "Immunology",
    "Cell Culture",
    "Cell-Based Assays",
    "Microbiology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}