{
  "id": 18896,
  "origin_website": "Jove",
  "title": "Quantitative Analysis and Characterization of Atherosclerotic Lesions in the Murine Aortic Sinus",
  "procedures": [
    "The McMaster University Animal Research Ethics Board has preapproved all procedures described herein.\n1. Harvesting Heart and Aorta\nAnesthetize the mouse and carefully open the chest cavity to reveal the heart and proximal aorta.\n\t\nExtract the blood from the mouse by direct punctuation of the right ventricle of the heart.\n\t\tNote: The blood can be stored and used for the analysis of plasma lipids and other blood borne factors.\nEuthanize the mouse by cervical dislocation.\nRinse the vasculature with 5 ml of saline.\n\tNote: This is accomplished by gravity perfusion through a needle puncture into the left ventricle. To permit drainage, a small incision is made in the right atrium. After rinsing the vasculature, tissue samples of liver, muscle and adipose tissue can be collected, flash frozen in liquid nitrogen, and stored at -80 ºC for future analysis.\nThe vasculature is fixed by gravity perfusion into the left ventricle with 10% neutral buffered formalin.\n\tNote: Once the perfusion is started, the flow of 10% neutral buffered formalin is adjusted to a slow drip so that the process takes 1-2 min. Organs and tissues that have been perfusion fixed can be used to the study of protein expression through immunofluorescence or histochemistry, but they generally cannot be used as samples for western blotting or to the study of gene expression.\nCarefully extract the heart and approximately 2 mm of proximal aorta from the carcass. Other tissues including the descending aorta can be collected and stored for subsequent analysis.\n\tNote: The descending aorta (to the iliac bifurcation) can also be used to examine atherosclerosis.\nMake a transversal cut with a scalpel on the removed heart in a manner that is perpendicular to the ascending aorta.",
    "Note: This is facilitated by the use of a dissecting microscope and can be effectively done by cutting along a straight line joining the lower tips of the right and left atria (Figure 1).\nStore the apical (top) part of the heart in an embedding cassette and submerge it in neutral buffered formalin for processing.\n2. Preparation of the Aorta\nPlace the cassette with the dissected tissue into the tissue processor.\nProcess tissue samples.\n\tNote: Generally, tissue processors are programmed to work overnight because of the length of the operation and the solutions involved in this process. Samples are processed following an established protocol:\n\t\n10% neutral buffered formalin for 1 hr at 42 ºC.\n10% neutral buffered formalin for 1 hr at 42 ºC.\n70% ethanol for 30 min at 40 ºC.\n85% ethanol for 30 min at 40 ºC.\n100% ethanol for 45 min at 40 ºC.\n100% ethanol  for 45 min at 40 ºC.\n100% ethanol for 45 min at 40 ºC.\nXylene for 1 hr at 40 ºC.\nXylene for 1 hr at 40 ºC.\nXylene for 1 hr at 40 ºC.\nParaffin wax for 45 min at 63 ºC.\nParaffin wax for 45 min at 63 ºC.\nParaffin wax for 45 min at 63 ºC.\nParaffin wax for 45 min at 63 ºC.\nMelt the paraffin wax overnight at 62 ºC (Figures 1D-E). Estimate the total amount of paraffin wax to be used base on the grams of paraffin wax needed to fill a histology mold and the number of blocks to be prepared.\n\tNote: A deep histology mold is preferred to shallow mold because it provides a wider potential angle of rotation when sectioning. A single deep histology mold requires 11 g of paraffin wax.",
    "Place each processed tissue into a deep histology mold and then pour melted paraffin wax to completely fill the mold (Figure 1F). Cover the mold with a labeled plastic cassette (Figure 1G).\nCool the filled mold on ice, or on a cold surface (Figure 1H), in order to create the solid block and separate the block from the mold (Figures 1I-J).\n\tNote: When placing the dissected heart in the mold, ensure that the inner face of the heart is touching the base of the mold, and then proceed to fill the block with melted paraffin. A labeled plastic cassette covers the mold before it solidifies in order to provide a base to handle the block. Once cooled, the mold is removed and the paraffin blocks can be stored indefinitely at room temperature.\n3. Sectioning of the Aorta\nPosition the block with the heart in the specimen holder of the microtome so that it can be sectioned from the inside toward the top of the heart (Figure 2)\nAdjust the microtome to cut a section thickness of 10 µm and proceed to section the heart.\nCollect sections on a glass slide and examine under a light microscope to determine position and orientation.\nWhen 1 or 2 valves of the aortic sinus become evident adjust the angle of the block as necessary (Figure 3A).\n\tNote: The sinus should appear as three bipartite valve bases with attached leaflets. If only one or two valve leaflets are observed then the cutting angle should be adjusted accordingly.\nAdjust the microtome to cut at 4-5 µm and collect the sections on coated glass slides.",
    "Note: Although the procedure can be varied, a systematic approach is recommended, by which the first 10 sections, from the aortic sinus advancing up the ascending aorta, are collected onto the top portion of a labeled glass slides (slides labeled 1-10). Subsequent sections are collected following the same pattern: #11-20, #21-30, #31-40 until the atherosclerotic lesions are no longer observed (Figure 3B). In this way the atherosclerotic lesions can be examined and characterized at precise locations along the ascending aorta. For example, Slide 1 holds sections 1, 11, 21, 31, 41, and 51, representing atherosclerotic lesions from the aortic sinus up the ascending aorta. Additional slides, labeled 11-20, can be included if the lesion is large, to collect more distal sections following the same pattern.\nContinue to collect sections until no atherosclerotic lesion is observed.\n\tNote: Slides can be stored at room temperature for months, before further analysis.\n4. Staining and Quantification of Atherosclerotic Lesions\nAtherosclerotic lesions can be analyzed in many different ways using a variety of techniques. The most basic analysis involves determination of lesion cross sectional area. In order to accurately compared lesion area, it is important that the starting point for lesion measurement is consistent from sample to sample. This is facilitated by using the valve leaflets for orientation. To facilitate the accurate identification and quantification of the lesion area, select cross sections are stained with hematoxylin and eosin. This involves immersing the slides in a series of solutions for specified times, that will deparaffinize/stain the tissue.\nProtocol for hematoxylin and eosin staining:\nPut the slides in the air drier for 8 min then deparaffinize the sections by washing 4× in xylene, for 3 min per wash.\nWash slides in 100% ethanol 3× for 3 min each.",
    "Wash 3× in 70% ethanol for 3 min each and then 2× in 50% ethanol for 3 min each.\nRinse with distilled water and then immerse in Mayer’s Hematoxylin for 15 min.\nWash in running tap water for 5 min then wash in distilled water for 5 min.\nImmerse in Eosin Y for 1-5 min.\nWash in distilled water 3× for 5 min each, wash in 50% ethanol 2× for 2 min each, then 70% ethanol 3× for 2 min each.\nWash in 100% ethanol 3× for 2 min each then wash in xylene 4× for 2 min each.\nMount sections using xylene based mounting medium and capture images using a digital camera mounted on a light microscope.\nIdentify and quantify lesion area using imaging software.\n\tNote: The lesion area can be determined at specific distances from the aortic sinus at 40-50 μm intervals (depending upon the thickness of each section). A plot of these area measurements versus distance gives a profile of the atherosclerotic lesion (Figure 4). The area under the curve represents an estimate of the total volume of the atherosclerotic lesion. Additional characterization of the lesion can include the determination of necrotic area. The necrotic core (nc) of an advanced lesion is formed by apoptotic foam cells. With practice, this can be determined by examination of the acellular regions of the hematoxylin and eosin stained sections (Figure 4A). Early lesions tend to have very little necrosis while more advanced lesions have increased necrotic areas that may contribute to plaque instability. Serial sections of the same aorta should be examined to confirm the presence of a necrotic region.\n5. Further Characterization of the Atherosclerotic Lesion",
    "Specific details regarding the stage of atherosclerotic development can be determined by staining with antibodies directed against specific cell types or markers. Immunohistochemistry on paraffin sections is a standard technique that is used to identify specific cell types or markers within the context of the surrounding unstained tissue. Antigen detection is generally achieved using a horseradish peroxidase substrate.\nImmunofluorescence staining involves the use of fluorophore-conjugated antibodies and requires a fluorescence microscope and appropriate filters for detection. This technique permits simultaneous staining of two (or more) antigens.\nGeneral Protocol for Immunohistochemical staining:\nPlace slides in the air drier for 8 min.\nDeparaffinize sections in 4 changes of xylene, 3 min each.\nWash in 100% ethanol 3× for 3 min each to remove xylene.\nWash 3× in 70% ethanol for 3 min each, then 2× in 50% ethanol for 3 min each.\nWash in distilled water 5 min each then wash 3× in PBS for 5 min each.\nPerform antigen retrieval. This can be accomplished using the Heat-Induced Epitope Retrieval (HIER) method in a microwave pressure cooker and antigen retrieval solution (10 mM citrate buffer, pH 6.0).\n\tNote: The process of formalin fixation may mask the antigens of interest. In our experience, the HIER significantly improves the performance of some antibodies, but is not required for others. In addition, there are other available alternatives to the HIER method of antigen retrieval.\nWhen the pressure cooker has cooled, place slides in PBS for 15 min.\nIncubate sections in normal serum (from the same species that the secondary antibody was derived from) for 30 min. DO NOT WASH SLIDES - DRAIN SERUM OFF.\nIncubate with primary antibody diluted in normal blocking serum for 2 hr at room temperature or overnight at 4 °C.\nWash with PBS 3× for 5 min each.",
    "Incubate sections with the biotinylated secondary antibody which has been diluted in PBS for 1 hr at room temperature.\nIncubate slides with horseradish peroxidase streptavidin for 30 min then wash with PBS 3× for 5 min each.\nChromogenic reaction- incubate slides in fresh DAB (3,3'-diaminobenzidine) for 5-30 min. This reaction should be monitored using a microscope. Stop the reaction by washing slides in tap water.\nCounter stain with hematoxylin for 1 min. Wash with tap water for 5 min then wash in distilled water 3× for 5 min each.\nRepeat steps 4.7-4.9 for mounting of slides.\n6. General Protocol for Immunofluorescence Staining\nA similar protocol, with minor changes, can be followed for immunofluorescence staining.\nPlace slides in the air drier for 8 min then deparaffinize sections in 4 changes of xylene, 3 min each.\nWash in 100% ethanol 3× for 3 min each to remove xylene.\nWash 3× in 70% ethanol for 3 min each, then 2× in 50% ethanol for 3 min each.\nWash in distilled water for 5 min each then wash in PBS 3× for 5 min each.\nPerform antigen retrieval. This can be accomplished using the Heat-Induced Epitope Retrieval (HIER) method in a microwave pressure cooker and antigen retrieval solution (10 mM citrate buffer, pH 6.0).\n\tNote: The process of formalin fixation may mask the antigens of interest. In our experience, the HIER significantly improves the performance of some antibodies, but is not required for others. In addition, there are other available alternatives to the HIER method of antigen retrieval.\nWhen the pressure cooker has cooled, place slides in PBS for 15 min.\nIncubate sections in normal serum (from the same species that the secondary antibody was derived from) for 30 min. DO NOT WASH SLIDES - DRAIN SERUM OFF.",
    "Incubate with primary antibody diluted in normal blocking serum for 2 hr at room temperature or overnight at 4 °C.\nWash with PBS 3× for 5 min each.\nAdd secondary fluorophore-conjugated antibody that is diluted in normal blocking serum (or PBS). Incubate for 1.5 hr at room temperature.\nWash with PBS 3× for 5 min each.\nCounter stain with DAPI.\nWash in PBS 3× for 5 min each.\nApply a coverslip using antifade mounting media.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}