{
  "id": 13671,
  "origin_website": "Jove",
  "title": "Isolating Hair Follicle Stem Cells and Epidermal Keratinocytes from Dorsal Mouse Skin",
  "procedures": [
    "This study was performed in strict accordance with the recommendations outlined in the Guide for the Care and Use of Laboratory Animals of Israel's Ministry of Health. All of the animals were handled according to the approved institutional animal care protocol IL-02302-2015 of the Technion Israel Institute of Technology.\n1. Experimental Preparation\nPreparation of chelated Fetal Bovine Serum\n\tNote: Epithelial cells are very sensitive to calcium so it is crucial to control the exposure of these cells to calcium. In order to ensure that cells are not exposed to calcium during the isolation process chelation is used to remove any residual calcium from the Fetal Bovine Serum used for preparation of staining buffer 29. The following protocol prepares approximately 1 L of Calcium-free Fetal Bovine Serum required for the preparation FACS staining buffer.\n\t\nAdd 400 g of dry chelating material, e.g., Chelex, into a 4 L beaker and add distilled H2O to a total volume 4 L. Cover and stir continuously using a magnetic stirrer.\nAdjust pH to 7.4 using 10 N HCl solution while stirring. Continue stirring for 20 min and re-adjust the pH as needed until pH remains stable for more than 20 min.\nIncubate beaker at 4 °C overnight to allow the chelating material to form a compact pellet. Carefully aspirate H2O and add fresh distilled H2O to a total volume of 4 L.\nRepeat the pH adjustment as in step 1.1.2.\nPlace the beaker at 4 °C for 1 hr to allow the chelating material to form a compact pellet. Carefully aspirate H2O.\nSlowly add two 500 ml bottles of fetal bovine serum to the chelating material. Stir slowly at 4 °C for 1 hr ensuring that the speed setting does not produce bubbles.",
    "Place the beaker at 4 °C for 1 hr to allow the chelating material to form a compact pellet.\nCarefully transfer the serum into 1 L glass bottle and filter it through a bottle top filter under sterile conditions. Store the chelated serum at -20 °C or use immediately.\nPreparation of Staining Buffer\n\t\nPrepare 100 ml of 3% chelated FBS in PBS without Ca2+ and Mg2+ and keep on ice.\n2. Isolation of Hair Follicles from Adult Epidermis\nAnesthetize mice using 5% isoflurane using an induction box. The protocol described here was optimized using 50-80 day old mice that are in the telogen phase of the HF cycle.\nEuthanize mice according to standard laboratory procedures. Here, euthanize mice using CO2 overdose in a euthanasia chamber.\nShave all hair from the dorsal skin using electric clippers. Avoid head and limbs. Keep the clippers as close as possible to the skin. Avoid damaging the skin and subcutaneous layer.\nWhen all hair is removed, use 70% ethanol to remove any hair residue and to disinfect the dorsal skin.\nPlace the mouse on a dissecting pad, and using forceps pull up the skin near the tail and make a small nick using scissors. Cut the entire dorsal skin in a posterior-anterior direction by carefully cutting away the skin and separating it from the fascia. Avoid damaging the subcutaneous layer.\nPlace the skin on a dissecting mat, hair side facing down, and pin down two adjacent edges of the skin to fix in place. Gently scrape off the fat, using a blunt scalpel until the dermis is clear and neat.\n\tNote: When scraping off the fat, use curved forceps to apply gentle pressure on the skin. Apply pressure on the skin using the curved side of forceps. This will prevent the skin from tearing.",
    "Place the skin, dermis side down, in 100 mm sterile culture dish, and straighten the skin to ensure that there are no folds. Add 10 ml of PBS without Ca2+ and Mg2+ (PBS--) to the culture dish and straighten the skin if needed.\nAspirate the PBS and add 10 ml of 0.25% trypsin. Ensure that the skin is unfolded and is freely floating. Incubate one piece of skin per 10 ml of 0.25% trypsin.\nIncubate samples at 37 °C for 30-120 min or at 4 °C overnight.\n3. Preparation of Single Cell Suspension from Hair Follicles\nScrape all the hair off the skin using curved forceps and a scalpel, in an anterior to posterior direction. Hold the skin in place using the curved side of forceps and use the scalpel to scrape off the hair.\n\tNote: Scrape off the hair into the trypsin solution added in step 2.8. Start at the tail and follow the direction of hair growth. Scraping against the direction of hair growth will result in substantial loss of HFs and reduction in cell yield. HFs tend to adhere to each together and form small clumps; in order to reduce the size of HF clumps try to scrape off a small area at a time.\nTransfer the hairless skin to new culture dish and add 10 ml of PBS-- to prevent it from drying. Inspect the skin and scrape off any remaining hair.\nBreak down the HFs using a scalpel and forceps until a single HF suspension is obtained. Vigorously triturate the HF suspension using 10 ml pipette for a few minutes to break up all hair clumps.\n\tNote: Perform all of the following steps on ice.\nTransfer the HF suspension in pre-labelled 50 ml tube.",
    "Aspirate the PBS-- from the skin and use it to rinse the cell culture dish that contained the HF suspension; transfer to the 50 ml tube.\nWashing\n\t\nFilter the suspension by passing through a 70 µm cell strainer fitted onto a 50 ml tube. Wash the initial 50 ml tube and the strainer with 10 ml of staining buffer (PBS-- with 3% chelated FBS).\nFilter the suspension by passing through 40 µm cell strainer fitted onto a 50 ml tube. Wash the tube with 5-10 ml of staining buffer to ensure that all cells have been transferred to the new tube. Keep the suspension on ice until all animals have been processed.\nCentrifuge for 15 min at 300 x g at 4 °C. Carefully aspirate supernatant without disturbing the pellet and resuspend pellet in 5 ml of staining buffer.\nCentrifuge for 5 min 300 x g at 4°C. Carefully aspirate supernatant and resuspend the cell pellet in 800 µl of staining buffer.\n\t\tNote: The volumes specified above is enough for staining cells derived from two adult mice.\nTransfer Suspension into Pre-labeled FACS Tubes.\n\t\nFor controls tubes, take 25-50 µl of cell suspension (or any residual left from the cell suspension) and make up to a total volume of 300 µl with staining buffer.\n\t\tNote: Prepare control tubes (total volume 300 µl) for unstained (no antibody and no DAPI); DAPI only; Integrin β1; Integrin α6; Sca-1; CD34.\nAdd the primary antibodies and DAPI (see Materials table for appropriate dilutions) at the desired concentrations to the appropriate tube. Gently flick the tubes to mix the cell suspension. Return on ice and cover with aluminum foil to protect from light.\nIncubate for 30 min on ice and gently flick the tubes every 10 min to ensure cells are kept in suspension.",
    "Wash cells by filling up each FACS tube with staining buffer (approximately 4 ml per tube); centrifuge for 5 min at 300 x g at 4 °C.\nCarefully aspirate supernatant and resuspend the cell pellet in 800 µl of staining buffer.\nTransfer cell suspension into FACS tube with cell strainer caps to ensure single cell suspension.\n4. Flow Cytometry Analysis\nProceed to cell sorting immediately using a flow cytometer with appropriate filters for signal detection. Use 405 nm violet (for measurements of DAPI), 488 nm blue (for measurements of FSC, SSC, PE, PE-Cy7 and FITC) and 633 nm red lasers (for excitation of APC)\n\tNote: Ensure that the instrument is recording from detectors for all three fluorescent channels.\nSet fluorescence gates based on unstained samples and compensation for spectral overlap using single stained controls.\n\tNote: Use the single stained controls for adjusting the compensation between channels in order to eliminate any overlap in the fluorescent signals. Compensation adjustment will depend on the FACS sorter used.\nSet up primary gates based on DAPI to exclude dead cells.\nAdjust the scatter plot (SSC-A vs FSC-A) to select for singlet events.\nSet up FSC and SSC height and width parameters to eliminate for doublets and discriminate for singlet events .\nGate cells with high α6 and β1 expression and from this population gate cells with either CD34 high expression or Sca1 high expression.\nSort cells into pre-labeled FACS tube.\n\tNote: Two general populations of cells can be isolated; α6+/β1+/CD34+/Sca-1- and α6+/β1+/ Sca-1+/CD34-. Sorted cells should be kept on ice at all times until they are used downstream applications such as cell culture or RNA isolation\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}