{
  "id": 5737,
  "origin_website": "Bio",
  "title": "Snapshots of the Signaling Complex DesK:DesR in Different Functional States Using Rational Mutagenesis and X-ray Crystallography",
  "procedures": [
    "The use of DesKC mutants to stabilize the histidine-kinase either in its phosphatase or its phosphotransferase stateThe plasmid pACYC-DesKCH188E:DesRREC encoding for the phosphomimetic DesKC variant and for the receiver domain of DesR (DesRREC), both fused to a His-tag and a TEV protease site to cleave the tag, was already available (Trajtenberg et al., 2014). This plasmid pACYC-DesKCH188E:DesRREC is thus used to co-express the following two proteins:DesKCH188E:MGSSHHHHHHGIHMENLYFQGRKERERLEEKLEDANERIAELVKLEERQRIARDLEDTLGQKLSLIGLKSDLARKLIYKDPEQAARELKSVQQTARTSLNEVRKIVSSMKGIRLKDELINIKQILEAADIMFIYEEEKWPENISLLNENILSMCLKEAVTNVVKHSQAKTCRVDIQQLWKEVVITVSDDGTFKGEENSFSKGHGLLGMRERLEFANGSLHIDTENGTKLTMAIPNNSKTheoretical MW = 27.3 kDa (24.9 after TEV-cleavage)Theoretical absorbance (280 nm) of a 1 mg/ml solution after TEV-cleavage = 0.56DesRREC:MRGSHHHHHHGSGSENLYFQGSGSMISIFIAEDQQMLLGALGSLLNLEDDMEVVGKGTTGQDAVDFVKKRQPDVCIMDIEMPGKTGLEAAEELKDTGCKIIILTTFARPGYFQRAIKAGVKGYLLKDSPSEELANAIRSVMNGKRIYAPELMEDLYSEATheoretical MW = 17.4 kDa (15.2 after TEV-cleavage)Theoretical absorbance (280 nm) of a 1 mg/ml solution after TEV-cleavage = 0.40Within the sequences listed in the previous point, His-tags are highlighted with blue fonts, in green, the TEV-recognition sites (cleaved proteins start at the final Gly, including it). Underlined in red, the phosphorylation sites: DesRREC bears the wild-type Asp, while DesKCH188E displays instead a Glu replacing the native His.The phosphatase-stabilized variant of DesKC, DesKCSTAB, is insoluble when expressed by itself in Escherichia coli. This difficulty is solved by co-expressing DesKCSTAB with DesRREC, resulting in excellent yields of both proteins. A co-expression plasmid is generated (pACYC-DesKCSTAB:DesRREC), by sub-cloning DesKCSTAB from pHPKS/Pxyl-desKSTA (Saita et al., 2015) into pACYC-DesKCH188E:DesRREC (Trajtenberg et al., 2014) using restriction-free cloning (Unger et al., 2010), using primers STAB_F (5’-CCTGTATTTTCAGGGATCCGGTATTATAAAACTTCGCAAG-3’) and STAB_R (5’-GTCAGACACTGTAATCACAACTTCCTTCCAG-3’). Both recombinant proteins encoded in pACYC-DesKCSTAB:DesRREC include a His-tag and a TEV protease cleavage site.pACYC-DesKCSTAB:DesRREC co-expresses the following two proteins:DesKCSTAB:MGSSHHHHHHGSGSENLYFQGSGIIKLRKEIERLEEKLEDANERIAELVKLEERQRIARDLHDTLGQKLSLIGLKSDLARKLIYKDPEQAARELKSVQQTARTSLNEVRKIVSSMKGIRLKDELINIKQILEAADIMFIYEEEKWPENISLLNENILSMCLKEAVTNVVKHSQAKTCRVDIQQLWKEVVITVSDDGTFKGEENSFSKGHGLLGMRERLEFANGSLHIDTENGTKLTMAIPNNSKTheoretical MW = 27.8 kDa (25.6 after TEV-cleavage)Theoretical absorbance (280 nm) of a 1 mg/ml solution after TEV-cleavage = 0.55DesRREC:MRGSHHHHHHGSGSENLYFQGSGSMISIFIAEDQQMLLGALGSLLNLEDDMEVVGKGTTGQDAVDFVKKRQPDVCIMDIEMPGKTGLEAAEELKDTGCKIIILTTFARPGYFQRAIKAGVKGYLLKDSPSEELANAIRSVMNGKRIYAPELMEDLYSEATheoretical MW = 17.4 kDa (15.2 after TEV-cleavage)Theoretical absorbance (280 nm) of a 1 mg/ml solution after TEV-cleavage = 0.40Note: the theoretical absorbance (280 nm) of a 1 mg/ml solution of the DesKC:DesR protein complex is approximately 0.",
    "5, which corresponds to both protein sequences together.Within the sequences listed in the previous point, His-tags are highlighted with blue fonts, in green, the TEV-recognition sites (cleaved proteins start at the final Gly, including it). Underlined in orange, the three stabilizing substitutions within the coiled-coil motif of DesK’s DHp domain. Underlined in red, the phosphorylation sites.Over-expression of DesKC:DesR complexesThe co-expression plasmid pACYC-DesKCSTAB:DesRREC (and similarly for pACYC-DesKCH188E:DesRREC), is transformed into 25 µl of competent Escherichia coli BL21 (DE3) cells (approximately 108 cells/ml) using heat shock for 2 min at 42 °C. A pQE80L plasmid including the DesRREC sequence (Trajtenberg et al., 2014) is co-transformed to produce a stoichiometric excess of DesRREC in the cells. 100 μl of transformed cells are spread on LB agar plates containing 100 μg/ml ampicillin and 17 μg/ml chloramphenicol, and grown overnight at 37 °C.Between 5 and 10 single colonies are picked and inoculated in 3 ml LB culture media (to be used as pre-cultures in the next step), 100 μg/ml ampicillin and 17 μg/ml chloramphenicol, and further grown at 37 °C for 16 h with agitation (220 rpm). Pre-cultures are inoculated 1/500 in 250 ml Erlenmeyer flasks containing 50 ml LB media, 100 μg/ml ampicillin and 17 μg/ml chloramphenicol, and further grown at 37 °C for 16 h with agitation (220 rpm). Larger-scale cultures are launched using three 5 L Erlenmeyer flasks, each containing 1 L 2x YT culture media, 2 mM magnesium sulfate, 100 μg/ml ampicillin, 17 μg/ml chloramphenicol and a 1/100 inoculum of pre-cultured bacteria. Cultures are grown at 37 °C with agitation (220 rpm) until absorbance at wavelength 660 nm (Abs660 nm) reaches 0.7-1 (approximately 3 h). Cultures are quickly shifted to a shaker that has been pre-equilibrated at 20 °C, and further growth is continued for 30 min with agitation (220 rpm).",
    "IPTG is added (0.5 mM final concentration) into the cultures. Induction of over-expression is achieved at 30 °C for 4 h (in the case of DesKCSTAB:DesRREC) or at 20 °C for 16 h (for DesKCH188E:DesRREC), with agitation (220 rpm) in both cases.Cells are harvested by centrifugation at 4,600 x g for 20 min at 4 °C in 1 L polypropylene bottles.Pellets are thoroughly resuspended in lysis buffer (see Recipes) (5 ml per g wet weight pellet) in 50 ml Falcon tubes.Lysozyme (0.5 mg/ml final concentration) and Triton X-100 (1% vol/vol final concentration) are added to resuspended pellets, and incubated at room temperature for 30 min, until the extract is viscous due to DNA release. Extracts are then transferred to -80 °C and stored for at least 2 h.Frozen extracts are thawed in a water bath at 37 °C. Thawed extracts are sonicated with pulses of 1 sec (set to 30% amplitude) and resting intervals of 3 sec, completing a total timespan of 4 min. This operation is repeated 3-4 times, until complete reduction of viscosity. During sonication the Falcon tube is kept refrigerated with ice. This is considered the total extract, and 40 μl are stored in electrophoresis sample buffer with β-mercaptoethanol (SBβ) for later SDS-PAGE analyses.Total extracts are centrifuged at 12,000 x g and 4 °C for 45 min. This step separates soluble species (supernatant fraction) from insoluble ones (pellet) such as inclusion bodies, non-lysed cells, insoluble proteins, etc. The supernatants are filtered through a 0.45 μm syringe filter to a new Falcon tube, and imidazole added to 40 mM final concentration (to avoid nonspecific binding to the column during IMAC). 40 μl of supernatants are stored in SBβ for SDS-PAGE analysis. Supernatants are hereafter used as the source of soluble DesKCSTAB (or DesKCH188E) and DesRREC, for structural studies.",
    "Purification of DesKC:DesR complexesZinc is used as the immobilized metal, during the first purification step by IMAC. Nickel is avoided to preclude cysteine oxidation, which previously hampered crystallization due to resulting heterogeneity in DesR samples. The IMAC column is connected to the ÄKTA purifier and pre-equilibrated with binding buffer (see Recipes) (10 column volumes or CV). Samples are injected at a flow rate of 5 ml/min, and target proteins are bound to the column through their N-terminal His-tags.IMAC washing is achieved with 15-20 CV binding buffer, until a stable Abs280 baseline is obtained. Aliquots of the flow-through material are stored in SBβ for SDS-PAGE analysis, to monitor for potential column saturation.IMAC elution is achieved with a linear 0-100% gradient of elution buffer (see Recipes) (30 CV), at 5 ml/min. Absorbance at wavelength 280 nm is used to monitor protein elution peaks. DesKCSTAB, DesKCH188E and DesRREC typically elute at approximately 65 mM imidazole and are collected in 96-deep-well plates. 40 μl of eluted peaks are stored in SBβ for SDS-PAGE analysis. The elution peaks of selected proteins are pooled and incubated with TEV protease (1:40 w/w TEV/target ratio). Proteolysis is performed overnight, in dialysis bags. Dialyses are performed against 200-300 volumes of dialysis buffer (see Recipes) with gentle stirring. Samples are recovered from the dialysis bag, and filtered with 0.45 μm syringe filters. A second IMAC zinc column is used, attached to a peristaltic pump and pre-equilibrated with binding buffer (10 CV). Samples are injected into the column at a flow rate of 5 ml/min. The flow-through is now carefully collected. The TEV protease itself includes an N-terminal His-tag, hence typically excluded from the flow-through.",
    "20 CV of elution buffer is applied to the column to elute TEV (and potentially non-digested target protein, normally absent if the procedure worked correctly) to be monitored by SDS-PAGE. The second IMAC flow-through sample is concentrated by ultra-filtration in Vivaspin centrifuge devices at 6,300 x g and 15 °C for 20 min to a final volume of 10 ml. This is immediately filtered through a 0.22 μm syringe filter, and injected into a size exclusion chromatography (SEC) column Superdex S75 26/600, at a flow rate of 1 ml/min. The SEC column is previously equilibrated with 2 CV SEC buffer (see Recipes).The SEC is eluted isocratically at 1 ml/min with SEC-P buffer in the case of the DesKCSTAB:DesRREC (phosphatase) complex, or with SEC-PT buffer in the case of the DesKCH188E:DesRREC (phosphotransferase) complex. Eluted fractions are collected in 96-deep-well plates. Protein elution is monitored with 280 nm wavelength absorbance (Figures 1A and 2A). 40 μl of eluted peaks are stored in SBβ for SDS-PAGE analysis.The calculated molecular weight (MW) of the complex is approximately 65 kDa taking into account that DesKC is a homo-dimer, and that one monomer of DesRREC could be binding to DesKC. If instead the DesKC:DesRREC ratio is 2:2, the MW is anticipated to increase to ~80 kDa. According to the calibration curves, the SEC chromatograms reveal a MW of 53.5 kDa in the case of DesKCSTAB:DesRREC, and 44.9 kDa for DesKCH188E:DesRREC. The difference with the theoretical MW figures is likely due to tertiary and quaternary structure features deviating from the ideal assumptions for globular species and their hydrodynamic radii. That these SEC peaks correspond indeed to the targeted DesKC:DesR complexes is afterwards confirmed by mass spectrometry analyses and then 3D structure determination.",
    "The final yields approximated 12 mg protein per L of cell culture (or 1-2 mg protein per g of wet weight pellet), for both complexes. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170811/20170811001742_9607.jpgFigure 1. Size-exclusion chromatography and crystallization of the DesKCSTAB:DesRREC complex. A. Elution profile of the DesKCSTAB:DesRREC protein complex in a Superdex S75 pg 26/600 size exclusion chromatography column. The peak at 140.9 ml corresponds to the complex, according to SDS-PAGE analysis. The peak at 201.5 ml corresponds to monomeric DesRREC in excess. B. Trigonal crystal of the DesKCSTAB:DesRREC complex.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170811/20170811001927_2352.jpgFigure 2. Size-exclusion chromatography and crystallization of the DesKCH188E:DesRREC complex. A. Elution profile of the DesKCH188E:DesRREC protein complex in a Superdex S75 pg 26/600 size exclusion chromatography column. The peak at 148.5 ml corresponds to the complex, according to SDS-PAGE analysis. The peak at 198.0 ml corresponds to monomeric DesRREC in excess. B. Monoclinic crystal of the DesKCH188E:DesRREC complex.Selected elution peaks from SEC are pooled and concentrated with Vivaspin centrifuge devices at 6,300 x g and 15 °C for 20 min. Final concentrations of 16 mg/ml for the DesKCSTAB:DesRREC complex, and 19 mg/ml for the DesKCH188E:DesRREC complex, are typically achieved. Protein concentration is determined by UV spectrophotometry at 280 nm and calculated extinction coefficients are derived from ProtParam (ExPASy, SIB Bioinformatics Resource Portal: http://www.expasy.org/tools[href=http://www.expasy.org/tools]). Proteins are stored in 25, 50 and 100 µl aliquots at -80 °C.Prior to crystallization, the purity and integrity of samples are checked by SDS-PAGE. Samples in SBβ are heated at 100 °C for 5 min and separated by electrophoresis in 12% polyacrylamide gels ran at 200 V.Crystallization of DesKC:DesR complexesDI: The DesKCSTAB:DesRREC (phosphatase) complexThe protein stock solution of pure DesKCSTAB:DesRREC complex is prepared according to a recipe where the order in the addition of the reagents is critical. First MIXA is obtained by combining 7.6 μl 100 mM AMP-PCP, 3.",
    "8 μl 1 M Tris pH 8.5 and 44.6 μl buffer SEC-P. Then 95 μl of DesKCSTAB:DesRREC complex (at ~16 mg/ml in buffer SEC-P) is added to the 56 μl of MIXA. The tube is centrifuged at 16,000 x g and 4 °C for 10 min and the supernatant used for further manipulations. In this manner ~150 µl of DesKCSTAB:DesRREC complex stock solution (at ~10 mg/ml final concentration) is obtained, containing approximately 5 mM AMP-PCP, 43.7 mM Tris pH 8.5, 462.2 mM NaCl and 9.25 mM MgCl2.Microseeding is used to speed up the process of crystallogenesis: 2 μl are drawn from drops containing previously grown crystals, and these are crushed by vigorous pipetting with P2 micropipette tips. This is used as the source of microseeds, adding 50 μl of 30% (v/v) PEG 600, 0.1 M MES pH 6, 0.15 M MgSO4 and 5% (v/v) glycerol. This seed stock solution is diluted 1/400 into an additive solution previously prepared containing 27% (v/v) PEG 600, 0.1 M MES pH 6, 0.15 M MgSO4 and 5% (v/v) glycerol. Hanging drop crystallizations are done at 20 °C in Linbro plates. The crystallization drops contain 0.8 μl of mother liquor (30% [w/v] PEG 4000, 0.1 M Tris-HCl pH 8.5, 0.2 M Li2SO4), 2 μl of stock protein solution, and 1.2 μl of additive solution with seeds. Three drops are set on a cover slide to seal each reservoir well. Crystals typically appear in 3-4 days, growing to suitable sizes (0.5 µm) in 10 days (Figure 1B).Crystals are cryo-protected by slowly adding 4 μl of cryo-protection solution: 32% (w/v) PEG 4000, 0.1 M Tris-HCl pH 8, 0.2 M Li2SO4, 20 mM MgCl2, 18 mM BeF3-, 5 mM AMP-PCP and 15% glycerol. BeF3- is prepared by mixing 50 μl of a 0.",
    "9 M stock solution of NaF with 9 μl of a 1 M stock solution of BeCl2, rendering a stock solution of 152 mM BeF3-. Be is extremely toxic; all solutions containing it are handled with particular caution and wastes treated appropriately, according to safety rules. Finally, crystals are briefly soaked in 100% cryoprotection solution, fished out of the drops using cryo-loops of approximately the same size as the selected specimen, flash-frozen in liquid nitrogen and stored in cryo-vials under liquid nitrogen for further use.DII: The DesKCH188E:DesRREC (phosphotransferase) complexThe protein stock solution of pure DesKCH188E:DesRREC complex is prepared according to a recipe where the order in the addition of the reagents is critical. First MIXA is obtained by combining 5.5 μl 100 mM AMP-PCP, 2.75 μl 1 M Tris pH 8.5, 2.2 μl 1 M MgCl2 and 43.35 μl buffer SEC-PT. Then 48 μl of DesKCH188E:DesRREC complex (at ~19 mg/ml in buffer SEC-PT) are added to 8.2 μl DesRREC (at 30 mg/ml in buffer SEC-PT) and the 53.8 μl of MIXA. The tube is centrifuged at 16,000 x g and 4 °C for 10 min and the supernatant used for further manipulations. In this manner ~110 µl of DesKCH188E:DesRREC complex stock solution (at ~8.3 mg/ml final concentration) is obtained, containing approximately 5 mM AMP-PCP, 43.1 mM Tris pH 8-8.5, 271.5 mM NaCl and 20 mM MgCl2.Hanging drop crystallizations are done at 20 °C in Linbro plates. The crystallization drops contain 2 μl of mother liquor (18% PEG 3350, 0.3 M tri-potassium citrate) and 2 μl of stock protein solution. Two drops are set on a cover slide to seal each reservoir well. Crystals appear typically in 5-6 days, growing to suitable sizes (0.5 µm) in 15 days (Figure 2B).Crystals are cryo-protected by quick soaking in 20% PEG 3350, 0.",
    "3 M tri-potassium citrate, 5 mM AMP-PCP, 25% glycerol, 20 or 150 mM MgCl2, and 0 or 5 mM BeF3-. Crystals are fished out of the drops using cryo-loops of approximately the same size as the selected specimen, flash-frozen in liquid nitrogen, and stored in cryo-vials under liquid nitrogen for further use.X-ray diffraction data collection.Single crystal X-ray diffraction experiments are carried out with an in-house copper rotating-anode source (Protein Crystallography Facility, Institut Pasteur Montevideo), or with synchrotron radiation (Soleil, France).DesKCSTAB in complex with DesRREC (PDB Id 5IUN), crystallizes in the trigonal space group P3121. Crystals are measured in the synchrotron (Beamline Proxima I, Soleil, France), collecting 180 images with 1° oscillation range and 30 sec exposure time per image (Figure 3A). The raw data is deposited in the SBGrid Data Bank (DOI: 10.15785/SBGRID/400[href=https://data.sbgrid.org/dataset/400/]).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170811/20170811005255_2449.jpgFigure 3. X-ray diffraction of DesKCSTAB:DesRREC crystals and resulting electron density map. A. Representative frame showing the X-ray diffraction from a single DesKCSTAB:DesRREC crystal (space group P3121). B. Zoom-in on the mid-sector of the DHp domain of the DesKCSTAB:DesRREC (phosphatase) complex, illustrated in stick representation (all atoms for the kinase, and only the Cα trace for the regulator). Oxygen atoms are colored red, nitrogens in blue, and carbons distinguished according to protein and chain: green and yellow, for the two chains in the DesKCSTAB dimer, and orange and magenta for the two bound DesRREC moieties.DesKCH188E in complex with DesRREC with high Mg2+ and BeF3- (PDB Id 5IUL), is collected in a rotating anode X-ray generator (Protein Crystallography Facility, Institut Pasteur de Montevideo, Uruguay). 593 images are collected with 0.3° oscillation range and 10 min exposure per image (Figure 4A). The raw data is deposited in the SBGrid Data Bank (DOI: 10.15785/SBGRID/408[href=https://data.sbgrid.org/dataset/408/]).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170811/20170811005942_2185.jpgFigure 4. X-ray diffraction of DesKCH188E:DesRREC crystals and resulting electron density map. A.",
    "Representative frame showing the X-ray diffraction from a single DesKCH188E:DesRREC crystal (space group P21). B. Zoom-in on the mid-sector of the DHp domain of the DesKCH188E:DesRREC (phosphotransferase) complex, illustrated in stick representation (all atoms for the kinase, and only the Cα trace for the regulator). Oxygen atoms are colored red, nitrogens in blue, and carbons distinguished according to protein and chain: green and yellow, for the two chains in the DesKCH188E dimer, and magenta for the single asymmetrically bound DesRREC molecule.DesKCH188E in complex with DesRREC with high Mg2+ (PDB Id 5IUK), crystallizes in the monoclinic space group P21. Crystals are measured in the synchrotron (Beamline Proxima I, Soleil, France), collecting two different sets of 1,000 frames each. The oscillation range is 0.2° and exposure time is 0.2 sec per image. The raw data is deposited in the SBGrid Data Bank (DOI: 10.15785/SBGRID/401[href=https://data.sbgrid.org/dataset/401/]).DesKCH188E in complex with DesRREC with low Mg2+ (PDB Id 5IUJ), crystallizes in the monoclinic space group P21. Crystals are measured in the synchrotron (Beamline Proxima II, Soleil, France), collecting 110 images with 1° oscillation range and 30 sec exposure per image. The raw data is deposited in the SBGrid Data Bank (DOI: 10.15785/SBGRID/399[href=https://data.sbgrid.org/dataset/399/])."
  ],
  "subjectAreas": [
    "Microbiology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}