{
  "id": 10764,
  "origin_website": "Jove",
  "title": "Manufacture and Drug Delivery Applications of Silk Nanoparticles",
  "procedures": [
    "1. Preparation of a Reverse-engineered Silk Solution from Bombyx mori Cocoons\nNOTE: This methodology is based on protocols described elsewhere 12,27.\nCut 5 g of dried cocoons with scissors into 5 mm x 5 mm pieces. Remove any soiled layers.\nWeigh out 4.24 g of sodium carbonate and add this carefully to 2 L of boiling distilled water.\n\tNOTE: This yields a 0.02 M sodium carbonate solution.\nAdd the cut cocoon pieces to the boiling sodium carbonate solution and boil for 60 min to degum the silk fibers. Stir the silk occasionally to ensure homogenous sample processing.\nRemove the degummed silk and wash with 1 L of distilled water for 20 min; repeat the washing step at least 3 times.\nRemove the washed silk and squeeze it well to remove excess liquid and then untie/pull the silk by hand. Place the untied silk in a fume hood to air dry overnight. This typically yields 3.6 g of degummed silk fibers.\nThe next day, weigh out 5 g air-dried degummed silk fibers and pack the silk tightly into the bottom of a 50 ml beaker.\nPrepare a fresh 9.3 M LiBr solution. Dissolve the silk fibers in LiBr using a 1 g silk to 4 ml LiBr ratio. Cover the silk LiBr sample with aluminum foil to prevent evaporation and allow the silk to dissolve completely at 60 °C. This step takes up to 4 hr and is aided by occasionally stirring.\nWet a dialysis cassette (molecular weight cut-off of 3,500 Da) in water for 5 min. Inject 15 ml the silk LiBr solution into the 15 ml dialysis cassette and use a needle and syringe to remove any air bubbles.",
    "Dialyze against 1 L of distilled water and change the water at 1, 3 and 6 hr (i.e., 3 changes on the first day) and again on the next morning and evening (i.e., 2 changes on the second day), and again on the following morning (i.e., 1 change on the third day).\nCollect the silk solution from the dialysis cassette and centrifuge the solution for 20 min at 5 °C at 9,500 x g. Recover the supernatant and repeat this centrifugation process twice more.\nDetermine the weight of an empty weighing boat (W1) and add 1 ml of the silk solution. Record the weight again (W2) and then dry the sample by leaving the weighing boat at 60 ºC overnight. Next, determine the total dry weight (W3) (dried silk and weighing boat). The concentration of the silk solution (w/v) is: % = (W3-W1/W2-W1) x 100.\n2. Preparation of Silk Nanoparticles from Reverse-engineered Silk Solution\nAdd a 5% (w/v) silk solution dropwise to acetone while maintaining a >75% (v/v) acetone solution. For example, add 9 ml of a 5% (w/v) silk solution dropwise (10 µl/drop at a rate of 50 drops/min) to 34 ml acetone.\nCentrifuge the precipitate at 48,000 x g for 2 hr at 4 °C.\nAspirate the supernatant and resuspend the pellet in distilled water by first dislodging the pellet with a spatula and then adding 20 ml distilled water. Use pipet tips to remove the pellet from the spatula. After vortexing for 20 sec followed by two sonication cycles using an ultrasonic probe at 30% amplitude for 30 sec, top up the centrifuge tube to capacity with distilled water.\nRepeat the centrifugation and resuspension step at least twice.",
    "Resuspend the pellet in 6 ml distilled water, as detailed in 2.3 and store at 4 °C until use. For cell culture studies, silk nanoparticle stocks can be gamma irradiated17.\n3. Determination of Silk Nanoparticle Concentration\nCentrifuge silk nanoparticles at 48,000 x g for 2 hr at 4 °C.\nCollect all nanoparticles in 3 ml of distilled water, followed by two sonication cycles at 30% amplitude for 30 sec.\nDivide the 3 ml stock of silk nanoparticles into 2 ml and 1 ml lots and transfer into pre-weighed 2 ml tubes. Record the total weight of the 2 ml sample. Store the 1 ml lot at 4 °C until use; this 1 ml sample will be used to generate a calibration curve.\nSnap freeze and then lyophilize the 2 ml silk nanoparticle lot in a freeze dryer overnight. After freeze-drying, reweigh the 2 ml tube and calculate the amount of silk nanoparticles (mg) that was originally present in the 2 ml sample.\nDilute the 1 ml silk nanoparticle stock with distilled water to generate a 5-point calibration curve (0.04-7 mg/ml). Ensure that samples do not exceed the absorbance maximum.\nDetermine the absorbance of each standard dilution at 600 nm. This is best done using a 96-well plate setup. Plot absorbance versus concentration (mg/ml) for the standard curve. Then use this standard curve routinely to determine the concentration of silk nanoparticles in suspensions.\n4. Preparation of Doxorubicin-loaded Silk Nanoparticles\nPreparation of the Doxorubicin Solution\n\t\nDissolve 1.2 mg of doxorubicin HCl in 8 ml distilled water.\nMake up to 10 ml with distilled water to yield a working stock of 116 µg/ml (0.2 µmol/ml).\nPreparation of Doxorubicin-loaded Silk Nanoparticles",
    "Mix 2 ml of 0.2 µmol/ml doxorubicin solution with 200 µl of 10, 30 or 50 mg/ml of silk nanoparticles in a 2 ml tube.\nIncubate the silk-doxorubicin suspension at room temperature (25 °C) overnight on a rotating mixer.\nNext, centrifuge the silk-doxorubicin suspension at 194,000 x g for 30 min. Wash the doxorubicin-loaded silk nanoparticles with distilled water and repeat this procedure twice more.\nPool the supernatant and note the total volume (this sample is used to determine the encapsulation efficiency).\nResuspend the doxorubicin-loaded silk nanoparticles in distilled water, protect from light and store at 4 ºC until use.\nDetermination of Encapsulation Efficiency and Drug Loading\n\t\nPipet 200 µl of the supernatant from step 4.2.4 into a black microtiter plate.\nUse a fluorescence microplate reader to measure doxorubicin-associated fluorescence at a fixed photomultiplier setting.\nSet the excitation wavelength to 485 nm and emission wavelength to 590 nm and record the fluorescence values.\nGenerate a doxorubicin calibration curve. Ensure measurements are acquired with identical instrument settings (i.e., with a fixed photomultiplier setting). Using the calibration curve, calculate the doxorubicin concentration in the combined supernatant. Repeat this measurement in three independent experiments.\nUse equation (1) to determine encapsulation efficiency:\nimgsrc://cloudfront.jove.com/files/ftp_upload/54669/54669equation1.jpg\n5. Characterization of Silk Nanoparticles\nAssessment of the Size and Zeta Potential of Freshly Prepared and Stored Silk Nanoparticles.\n\t\nStore silk nanoparticles in distilled water at 4 °C and 25 °C.\nMeasure the size and zeta potential of the silk nanoparticles on days 0, 14 and 28 using dynamic light scattering (DLS). Set refractive indices to 1.33 for distilled water and 1.60 for protein17. Calculate particle sizes with the user interface software.\nMorphological Assessment of Silk Nanoparticles by Scanning Electron Microscopy (SEM).\n\t\nPlace a carbon adhesive disc onto an SEM stub and subsequently attach a silicon wafer.",
    "Dilute silk nanoparticles to a concentration of 1 mg/ml. Pipette 10 µl of the sample onto a silicon wafer, freeze the sample at -80 °C and lyophilize overnight using a freeze drying system as per manufacturer's instructions.\nCoat the sample with a gold layer up to 20 nm thick using a low vacuum sputter coater.\n\t\tNOTE: Instrument settings vary between models. The model used here is fully automated and operates by thickness only.\nImage samples with a scanning electron microscope at 5 kV and a 40,000-fold magnification.\n6. In Vitro Cytotoxicity of Control and Doxorubicin-loaded Silk Nanoparticles\nCell Viability Following Exposure to Silk Nanoparticles.\n\t\nCulture MDA-MB-231 cells in RPMI 1640 with 10% v/v FBS. Plate cells on tissue culture treated polystyrene and incubate in a humidified 5% CO2 atmosphere at 37 °C. Routinely subculture at 80% confluence every 2−3 days.\nPlate MDA-MB-231 cells at a density of 2 x 104 cells/cm2 in 96-well plates. Allow the cells to recover overnight.\nAdd (i) 0.001-1 µg freely diffusible doxorubicin, (ii) 0.001-0.5 mg silk nanoparticles and 0.1 mg silk nanoparticles loaded with 0.001-1 µg doxorubicin into 96-well plates (final volume 100 µl per well).\nDetermine cell viability and the half maximal inhibitory concentration (IC50) by adding (3-(4,5-dimethylthiazol-2-yl)-2,5-diphenyltetrazolium bromide (MTT 5 mg/ml in PBS) at 72 hr. Incubate for 5 hr, carefully drain the wells with a pipette and dissolve the formazan with 100 µl of dimethylsulfoxide. Measure the absorbance at 560 nm. Repeat this measurement in three independent experiments.\n\t\tNOTE: The absorbance values of untreated controls serve as a reference value for 100% cell viability.\nSEM of Cells Exposed to Silk Nanoparticles.",
    "Seed MDA-MB-231 cells on sterile glass coverslips at a density of 2 x 104 cells/cm2. Allow the cells to recover overnight. Expose the cells to the desired treatment conditions for 72 hr.\nFix the cells with 2% v/v glutaraldehyde in PBS for 30 min, wash with distilled water twice, dehydrate with an ethanol series, and critical point dry the samples, as detailed elsewhere28.\nSputter coat the samples with a gold layer up to 20 nm thick using a low vacuum sputter coater.\n\t\tNOTE: Instrument settings vary between models. The model used here is fully automated and operates by thickness only.\nImage the samples by SEM using an electron acceleration of 5 kV and 700-fold magnification.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}