{
  "id": 10387,
  "origin_website": "Jove",
  "title": "In Situ Microscopy for Real-time Determination of Single-cell Morphology in Bioprocesses",
  "procedures": [
    "NOTE: The following steps are necessary to adapt the parameters to the respective microorganism and culture conditions. The adjustment of probe settings lasts about 20 min for an experienced user. A detailed description of tools and steps is given in the corresponding probe manual from SOPAT GmbH. In general, the tools that are presented in the following protocol are needed: (i) Probe Controller for probe adjustments and image acquisition; (ii) Fiji (ImageJ) for annotations on acquired images; (iii) SOPAT support for artificial neural network (ANN) training and workflow creation; (iv) Batcher for data batch processing using already acquired images with a workflow; (v) Result Analyzer for result visualization and evaluation on batch processed images; and (vi) Monitor for automated real-time measurement and result visualization.\n1. Setting Hardware Parameters\nPrepare a culture with the highest cell concentration that might be achieved during the experiment or centrifuge and resuspend the pellet in order to achieve this concentration. In this case, 65 g L-1 of dry biomass concentration was chosen for S. cerevisiae cultivations.\nPrepare different dilutions, which range from the highest to the lowest concentration so that the expected range is fully covered. A minimum of 4 different concentrations are recommended.\nIdentify the cell size range of the microorganism with conventional microscopy. Define the expected maximum diameter (dmax) of respective cells. This value is set to 8 µm in case of S. cerevisiae.\nChoose two measurement gaps of 5x and 10x of the expected dmax of the cells.\nChoose the maximum stroboscope intensity. Choose stroboscope intensities for both gaps with the highest cell concentration so that cells are still visible on the images with the lowest light intensity (darkest images).",
    "Choose the minimum stroboscope intensity, and then choose stroboscope intensities for both gaps so that cells are still visible on the images with the highest light intensity (brightest images). Use the lowest cell concentration, which likely appears during the measurement period.\nChoose one focus position, which yields the sharpest images for each measurement gap, for both stroboscope intensities and for the concentration range that need to be tested (see step 2 for details about focusing). Focus cells appropriately so that the image data can be annotated afterwards (see step 4).\nMeasure the previously prepared dilution series of the cell concentration (see step 2) with both gap widths and stroboscope intensities.\nimgsrc://cloudfront.jove.com/files/ftp_upload/57823/57823fig1.jpg\nFigure 1: Concentration calibration tool. Left GUI: set image directories (minimum of 3) with known concentrations; central GUI: choose features to be calculated on the image directory; right GUI: choose the weighted root mean square error (WRMSE) to identify the minimum. WRMSE and the best correlation between any image feature and the cell concentration. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/57823/57823fig1alarge.jpg]\nEvaluate the dilution series experiment.\n\t\nUse the Concentration Calibration (CoCa) Tool (see Figure 1) to identify the optimal correlation between the extracted image features (brightness or sharpness) and the previously measured concentrations provided by the user, e.g., dry biomass or cell counts. Follow the instructions in the software manual for further details.\nIdentify the optimal correlation between the extracted information from the image features at various concentrations compared to any off line measurements. See the legend of Figure 1.\nChoose the most reasonable measurement gap and stroboscope intensities under consideration of the concentration correlation curve with the features that result in the smallest weighted root mean square error (WRMSE).",
    "NOTE: The measurement gap is fixed during the experiment, whereas the stroboscope intensity can be adapted according to the cell concentration.\n2. Off Line Measurement\nAdjust the desired measurement gap according to step 1 with the help of a thickness gauge.\nOpen the graphical user interface Probe Control in the SOPAT dashboard.\nConnect the desired probe to the amplifier in the software subsection Actions and press Connect.\nPress the Play button to start streaming (Live View).\nClean the measurement gap by spraying ethanol into the gap and carefully wipe any dust or dirt with an optical paper. Check that the glass of the sensor is free of particles with the Live View in the CamControl.\n\tNOTE: Particles and dust disturb measurements and the automatic cell identification.\nPlace a dry optical paper in the measurement gap. Open the tab Probe control and adjust the stroboscope intensity in order to visualize the paper. Turn the binding screw until the single fibers of the paper are clearly seen.\nFill a tube with culture broth. Dip the microscope in the culture broth so that the gap is fully covered with cell suspension. Open the tab Probe control and adjust the desired stroboscope intensity according to section 1. Focus on the cells by fine-tuning the focus binding screw. The focus must not be changed anymore during the experiment\n\tNOTE: 5-6 mL of culture broth are added to a 50 mL conical centrifugal tube to float the measuring gap sufficiently.\nDefine the number of frames per time point [-] in the user interface in the menu Triggering in the GUI Frames per trigger. Set the number of frames to 200 frames per trigger.",
    "NOTE: The number of frames can be reduced to the lowest value, which is necessary for a statistical reliable result. This depends on the sample size required to obtain a representative morphological cell size distribution (see also step 5).\nDefine the frame rate [Hz] in the menu Triggering in the GUI Frame rate. Choose a frame rate that guarantees that moving particles from a previous frame will not appear in the following frame.\n\tNOTE: This can be proven with a test trigger with 200 frames. Inspect the images for particles, which are captured repeatedly. If this is the case, decrease the frame rate. For off line measurements, 1 Hz is recommended.\nSet the directory, in which the acquired images will be saved, in the menu General.\nPerform an image acquisition by activating the Start image trigger acquisition button. Move the tube with culture suspension gently up and down to induce a flow through the measuring gap.\nRepeat step 2.5 after each measurement.\nCheck the acquired images. Cells have to be sharp enough for annotation. Inspect the images for particles, which are captured repeatedly. If this is the case, decrease the frame rate.\nSave the settings by selecting the following pathway: C:\\Program Files\\SOPAT GmbH\\monitoringPrograms\\camcontrol, and press Save.\n3. Particle Identification\nAnnotate particles for the training of the artificial neural network (ANN) (training set).\n\t\nLoad the acquired images into the annotation tool \"Fiji, ImageJ\" by dragging and dropping the file into the Main \"ImageJ\" window (see GUI \"Fiji\" tool in Figure 2)\nOpen the ROI Manager by selecting: Analyze | Tools | ROI Manager.\nChoose a selection tool. Wand (tracing) tool, freehand, oval, or elliptical selections are recommended.\nDraw a circle around the particle that shall be annotated with the selection tools mentioned before and then refine it with the brush tool.",
    "Add the annotation to the ROI Manager by pressing Add [t].\nMark all objects of interest (cells to be identified) on about 15 images.\n\t\tNOTE: In order to cover all necessary information, i.e., different shapes, sizes, concentration of cells, brightness, etc., use five images from the start, five images from in between, and five images from the end of the experiment.\nDecide, if cells need to be classified in different subclasses due to their shape (e.g., different phases of a cell cycle), or if all cells are of the same class.\nChange the name of each selected particles accordingly. Set one name or abbreviation for each class and a counter for each particle of the class (e.g., cell_1, cell_2, etc.). Annotate at least 50 particles per class.\nDo not annotate objects, which should not be detected, because they are not relevant for the process, such as gas bubbles or other particles like undissolved media components.\n\t\tNOTE: Those events will not be included in the training procedure for the ANN and be regarded as background.\nDo not annotate cells that are out of focus.\nAnnotate the images as consistent as possible. If there are doubts, the label Ignore can be applied. It is highly recommended not to abuse its use, since the ANN will only recognize structures that are labeled.\nimgsrc://cloudfront.jove.com/files/ftp_upload/57823/57823fig2a.jpg\nFigure 2: Fiji tool user interface. A training set is created with the annotated images. A manual annotation consisting of two classes is depicted, the list of annotated particles is shown in the ROI Manager. Different names and colors can be set for different classes. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/57823/57823fig3large.jpg]",
    "Save the annotated objects and the image to a ZIP format and send the file to the training network, either via upload to the platform or by sending the ZIP file via e-mail.\n\tNOTE: Usually, it takes a number of iterative training rounds to identify adequate predictions of the classified objects on the images. Each training round leads to a workflow that is returned by the program.\nUse the workflow (*.wf) with the trained object recognition algorithm to analyze test images with the data batch progressing program Batcher that can be started in the dashboard.\nCheck object detection on the test images through the quantification of false positive and negative events.\n\t\nQuantify the detection of false positive events: particles erroneously detected as cells, cells that are not correctly classified, and cells of which the contour has not been well identified.\nQuantify the false negative events (cells that are not recognized as such).\nVisualize the results in the tool Result analyzer by starting the program in the dashboard.\n\t\nImport the desired results files with File | Import file or File | Import folders.\nVisualize the results by Chart | Create chart on the Charts GUI.\nSelect one of the following options: Distribution chart, Sensitivity plot, Characteristic over time, Characteristic over survey points, and Feature vs. feature.\n\t\tNOTE: A manual regarding the utilization of the Result Analyzer comes with the system and is also available from the support.\nIf the results are acceptable, run the workflow in the Batcher on all acquired images of the experiment. At the same time then the monitoring program can be created by combining the saved settings from the Probe Controller (*.pcfg) with the workflow (*.wf), see also the manual.\n\t\tNOTE: The workflow can also be used for monitoring future experiments for this culture media.",
    "If the results are not acceptable, check the annotation on the training set and/or continue with another iterative training round (see step 4.2).\n4. Sample Size Quantification\nSet the standard deviation (σ), which is acceptable among the detected particles.\n\tNOTE: The standard deviation changes in parallel to the cell size homogeneity. The maximum standard deviation indicates the sample with the highest degree of size heterogeneity.\nSet the amplitude of the confidence interval or the desired accuracy in relation to the expected variance of measurements (e).\nSet the admitted error (α) between 5% (z1-α/2 = 1.96) and 10% (z1-α/2 = 1.64).\nCalculate the number of cells to be identified from each class from equation 1.\nimgsrc://cloudfront.jove.com/files/ftp_upload/57823/57823eq1.jpg [Equation 1]\n\tNOTE: Based on the number of cells, the number of images that needs to be acquired can be defined for each data point.\nPerform a sensitivity analysis on random time points of the experiment to check that the analysis of n particles leads to a variability of the mean Feret diameter and the Dv90 of less than 5%. It can be calculated automatically in the Result Analyzer.\n5. On Line (By-Pass) or In Line Measurement\nPerform the off line measurement procedure first (see step 2) in order to set the hardware and software settings as a function of the organism and process (concentration or media).\nUpload the saved settings from the previous section by selecting the button Load and select the following pathway: C:\\Program Files\\SOPAT GmbH\\monitoringPrograms\\camcontrol.\nConnect the probe to the flow cell or to the bioreactor.\n\tNOTE: In situ measurements can be performed with a pinch flange.\nPerform sterilization.\n\tNOTE: Only the probe-wetted material of the instrument is sterilizable through steam sterilization. The probe wetted length can go from 6 to 222 mm (Figure 3).\nimgsrc://cloudfront.jove.com/files/ftp_upload/57823/57823fig3a.jpg",
    "Figure 3: Sketch of the ISM devices. The probe MM-Ho (A) is installable directly in the bioreactor, whereas the probe MM 2.1 (B) can be used as a by-pass. The culture broth circulation is marked with arrows in each picture. The conversion factors are 0.166 µm pix-1 for MM-Ho and 0.087 µm pix-1 for MM 2.1. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/57823/57823fig2large.jpg]\nDefine the image acquisition rate in the GUI Triggering in the field Trigger interval [s].\n\tNOTE: Depending on the process dynamics, the image acquisition rate can be adapted. For example, if a lag-phase of 3 hours is expected, the rate of acquisition can be lower, than if a metabolism shift or the accumulation of a product shall be monitored. Usually, this requires a much shorter acquisition time in the minute range. For example, an image acquisition sequence between 5 and 10 min during a batch yeast cultivation provides sufficient information to capture process dynamics.\nDefine the frame rate as explained in step 2.10.\n\tNOTE: In on line and in line measurements, the frame rate can be increased, since the mechanical stirring can increase the flow rate through the gap.\nStart image acquisition by activating the button Start streaming of selected probe.\nStop acquisition when the experiment is finished with the button Stop streaming of selected probe.\n\tNOTE: For the 1st run, start the acquisition just before the inoculation of the culture and proceed to step 4. For the following runs, open the program Monitoring in the dashboard and select the created workflow (see step 4). Start the monitoring just before the inoculation of the culture by pressing the Play button.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}