{
  "id": 13346,
  "origin_website": "Jove",
  "title": "Generation of Human Primordial Germ Cell-like Cells at the Surface of Embryoid Bodies from Primed-pluripotency Induced Pluripotent Stem Cells",
  "procedures": [
    "1. Cell Culture of hiPSCs in the Primed Pluripotency State\nPreparation of extracellular matrix protein-coated dishes\nThaw Matrigel (extracellular matrix protein) on ice in a refrigerator or a cold room overnight (do not thaw at room temperature or using a warm water bath). Aliquot matrix protein (~200 μL; the volume of an aliquot is determined by manufacturer for each batch and indicated on the label of vial) into sterile low-bind centrifuge tubes or cell cryopreservation tubes on ice. It is important to keep extracellular matrix protein ice-cold during dispensing to avoid solidification. Store the aliquots at -80 °C.\nTo coat cell culture plastic dishes with extracellular matrix protein, dilute one aliquot with 25 mL ice-cold DMEM/F12 and spread to three 10-cm dishes (~8 mL/dish). Incubate dishes at room temperature for at least 1 hour. After coating, dishes can be sealed using Parafilm and stored at room temperature for up to one week.\nAspirate medium from dishes immediately before inoculation of primed pluripotency hiPSCs. It is not necessary to wash the coated dishes with medium or calcium/magnesium-free phosphate-buffered saline [PBS(-)].\nInitiation of hiPSC culture in the primed pluripotency state\nAdd 2 µL of 50 mM Y27632 [inhibitor of Rho-associated protein kinase (ROCK)] to 10 mL of mTeSR1 medium in a 15-mL centrifuge tube. Prepare two tubes of ROCK inhibitor-supplemented 10 mL medium to initiate cell culture in one 10-cm dish from 1 mL frozen cell stock. Use Y27632-supplemented medium on the same day. Prewarm Y27632-supplemented medium in a 37 °C water bath for 5 min.\n\t\tNote: This protocol works well with hiPSCs maintained in mTeSR1. When hiPSCs are maintained in other media supporting human PSC growth with varying degrees of primed or naïve pluripotency, yield of hPGCLCs may significantly vary.",
    "Note: The shelf life of complete mTeSR1 is 2 weeks at 4 °C and 6 months at -20 °C, but re-freezing causes poor performance. We freeze 40 mL aliquots of mTeSR1 at -20 °C until use.\nThaw a vial of primed pluripotency hiPSC frozen stock (1.0 - 3.0 x 106 cells in 1 mL cryopreservation medium) using a 37 °C water bath. Immediately after completion of thawing, transfer the entire content of a vial into one tube (10 mL) of prewarmed Y27632-supplemented medium.\nCentrifuge cell suspension at room temperature, 300 x g for 8 min. Discard supernatant and resuspend cell pellet with 10 mL prewarmed Y27632-supplemented from the other tube.\nEvenly spread cell suspension into an extracellular matrix protein-coated 10-cm dish. Place the dish in a tri-gas CO2 incubator (37 °C, 6.5% O2, 5% CO2). Maintain hiPSC culture under a low oxygen pressure.\nChange medium (mTeSR1 without Y27632) every day. The ROCK inhibitor (Y27632) is critical for hiPSC survival immediately after dissociation to single cells. Once hiPSCs adhere on the extracellular matrix protein-coated surface as evenly distributed small aggregates with >10% confluency (which is typically completed within 16 hours after inoculation), Y27632 is dispensable. Too early medium change after inoculation of dissociated hiPSCs without Y27632 may cause almost complete cell death.\nPassaging primed pluripotency hiPSCs \n\tNote: Passage primed pluripotency hiPSCs when colonies occupy ~80% of the effective growth area. Correct passaging procedures and densities is important for experimental reproducibility. We have seen that efficiency of hPGCLC induction is not significantly different between hiPSC cultures 6 days after initiation from a frozen stock (involving one or two passages) or one month (involving >10 passages). Induction of hPGCLC was successfully performed from hiPSCs maintained for over two months, although the efficiency was not quantitatively assessed.",
    "Take 4 mL of cell dissociation enzyme mixture in a 15-mL centrifuge tube and equilibrate to room temperature for 5 min.\nPrewarm 10 mL PBS(-) in a 15-mL centrifuge tube for >5 min at 37 °C in a water bath.\nAdd 2 µL of 50 mM Y27632 (ROCK inhibitor) to 10 mL mTeSR1 medium in a 15-mL centrifuge tube. Prepare two tubes of the ROCK inhibitor-supplemented 10 mL medium and use in the same day. In another 15-mL centrifuge tube, take 5 mL mTeSR1 without adding Y27632. Prewarm medium +/- Y27632 in a 37 °C water bath for 5 min.\n\t\tNote: All medium aliquots prepared in step 1.3.3 may contain Y27632.\nAspirate old medium from a 10-cm dish and rinse cells once with prewarmed 10 mL PBS(-). Discard PBS(-) and add 4 mL of dissociation enzyme to the dish. Place the dish in a CO2 incubator (tri-gas incubator works but not necessary) for ~4 min until cells detach from the bottom. Gently pipet cells up and down to make single-cell suspension.\nTransfer hiPSC single-cell suspension to the prewarmed tube containing 5 mL medium without Y27632 (total volume in a 15-mL tube is about 9 mL). Centrifuge cell suspension at room temperature, 300 x g for 8 min.\nDiscard supernatant and resuspend cell pellet with 10 mL of the prewarmed medium medium containing Y27632.\nRemove cell aggregates using a 40-µm cell strainer and determine cell density using a Coulter counter.\nDilute cell suspension with prewarmed Y27632-supplemented medium to achieve 3.0 x 106 cells in 10 mL to inoculate an extracellular matrix protein-coated 10-cm dish. Place the inoculated dish in a tri-gas CO2 incubator (37 °C, 6.5% O2, 5% CO2).\nChange medium (mTeSR1 without Y27632) every day.\n2. Generation of hPGCLCs",
    "Note: Initiate the following steps when hiPSC cells in a 10 cm dish (mTeSR1 medium, extracellular matrix protein-coated) reaches to ~80% confluency (approximately 107 cells).\nPreparation of extracellular matrix protein-coated dishes (Day 1)\nThaw one aliquot of extracellular matrix protein on ice and dilute in 25 mL of ice-cold DMEM/F12.\nDispense diluted extracellular matrix protein to 6-well plates (1 mL/well). One aliquot is sufficient to coat 24 wells (4 plates). Incubate plates at room temperature for at least 1 hour. Unused coated plates can be sealed and stored at room temperature for up to one week.\nAspirate medium from plates immediately before inoculation of primed pluripotency hiPSCs. It is not necessary to wash the coated dishes with medium or PBS(-).\nInoculation of primed pluripotency hiPSCs into extracellular matrix protein-coated plates (Day 1)\nTake 4 mL of cell dissociation enzyme in a 15-mL centrifuge tube and equilibrate to room temperature for 5 min.\nPrewarm 10 mL PBS(-) in a 15-mL centrifuge tube for >5 min at 37 °C in a water bath.\nAdd 7 µL of 50 mM Y27632 (ROCK inhibitor) to 35 mL mTeSR1 medium in a 50-mL centrifuge tube. Use Y27632-supplemented medium in the same day. Make two tubes for total 70 mL Y27632-supplemented medium and prewarm the medium in a 37 °C water bath for 15 min.\nAspirate old medium from a 10-cm dish and rinse cells once with prewarmed 10 mL PBS(-). Discard PBS(-) and add 4 mL of cell dissociation enzyme to the dish. Place the dish in a CO2 incubator (tri-gas incubator works but not necessary) for ~4 min until cells detach from the bottom. Gently pipet cells up and down to make single-cell suspension.",
    "Transfer hiPSC single-cell suspension to the prewarmed tube containing 10 mL Y27632-supplemented medium. Centrifuge cell suspension at room temperature, 300 x g for 8 min.\nDiscard supernatant and resuspend cell pellet with 10 mL prewarmed Y27632-supplemented medium.\nFilter cell suspension through a cell strainer (40 µm pore size) to remove cell aggregates and count cells using a Coulter counter.\nDilute hiPSC single cell suspension to 5.0 x 106 cells in 50 mL prewarmed Y27632-supplemented medium.\nInoculate 2 mL cell suspension (2.0 x 105 cells) in each well of the coated 6-well plates (4 plates, 24 wells). Make sure that cells are evenly distributed in each well. Place cell culture plates in a tri-gas CO2 incubator (37 °C, 6.5% O2, 5% CO2).\n\t\tNote: The inoculum cell density and even distribution in each well is critical. Because inoculation of hiPSCs into 10-cm dishes may cause significantly higher cell density than other areas. Even cell density of single-cell hiPSCs can be achieved more easily with 6-well plates.\nChange medium with 2 mL/well mTeSR1 (without Y27632) at 24 hours after inoculation.\nConversion of the primed pluripotency state hiPSCs to the 4i-naïve (ERK-independent) pluripotent cells (Day 3 and Day 4)\nPrepare 4i complete naïve pluripotency medium in a 50-mL centrifuge tube as follows (Day 3 and Day 4): 50 mL of 4i basal medium, 5 µL of 30 mM CHIR99021, 5 µL of 10 mM PD0325901, 5 µL of 20 mM BIRB796, 5 µL of 50 mM SP600125, and 5 µL of 50 mM Y27632.\n\t\tNote: Store 4i basal medium at -80 °C and thaw in a refrigerator overnight. Prepare fresh 4i complete medium immediately before use. Avoid exposure of the 4i chemicals (CHIR, PD, BIRB, and SP) to strong light. Do not store 4i complete medium at 4 °C or frozen overnight or longer.",
    "Warm 50 mL 4i complete medium in a 37 °C water batch for 15 min. Change medium with prewarmed 4i complete medium (2 mL/well) at 48 and 72 hours after inoculation. Exact timing of medium change is important to achieve high hPGCLC yield and experimental reproducibility.\n\t\tNote: Density of the 4i hiPSC culture is high under this condition and become confluent at 48-72 hours after inoculation, but this is normal.\nEB formation using microwell plates (Day 5)\nPrepare 50 mL of 4i complete medium in a 50-mL centrifuge tube and prewarm it in a 37 °C water bath for ~15 min before use.\nPrewarm 35 mL DMEM/F12 in a 50-mL centrifuge tube in a 37 °C water bath for ~15 min before use.\nPrepare a microwell plate\n\t\t\nAdd 5% (w/v) filter-sterilized Pluronic F-127 detergent into 8 active wells of a microwell plate (see Table of Materials; 0.5 mL/well).\nCentrifuge the microwell plate at room temperature, 1,000 x g, for 5 min. Inspect microwells with an inverted microscope to ensure the absence of air bubbles. Leave the microwell plate for 30 min at room temperature to coat microwells with detergent.\nDiscard detergent solution from wells of the microwell plate by pipetting and rinse wells with prewarmed DMEM/F12 (2 mL/well).\nCentrifuge the microwell plate at room temperature, 1,000 x g for 5 min. Inspect microwells with an inverted microscope to ensure the absence of air bubbles.\n\t\t\tNote: When air bubbles are still observed in microwells, examine if the microwell sheet is still firmly glued to the bottom of the well.\nDiscard DMEM/F12 from wells of the microwell plate by pipetting and rinse wells with prewarmed DMEM/F12 (2 mL/well).\nRepeat steps 2.4.3.3 - 2.4.3.4.",
    "Add 4i complete medium into the rinsed wells of the microwell plate (1 mL/well). Keep the remaining 4i complete medium in a 37 °C water bath.\nCentrifuge the microwell plate at room temperature, 1,000 x g for 5 min. Inspect microwells with an inverted microscope to ensure the absence of air bubbles.\nPlace the microwell plate in a tri-gas incubator (37 °C, 6.5% O2, 5% CO2) until inoculation of 4i hiPSCs.\nInoculation of 4i iPSCs into a microwell plate\n\t\t\nTake 13 mL of cell dissociation enzyme in a 15-mL centrifuge tube and equilibrate to room temperature for 5 min.\nPrewarm 50 mL PBS(-) in a 50-mL centrifuge tube for >5 min at 37 °C in a water bath.\nAspirate old medium from 24 wells of naïve hiPSC cell culture and rinse cells once with prewarmed 2 mL/well PBS(-). Discard PBS(-) and add 0.5 mL/well dissociation enzyme. Place cell culture plates in a CO2 incubator (37 °C) for ~4 min until cells detach from the bottom. Gently pipet cells up and down to make single-cell suspension.\nTransfer hiPSC single-cell suspension to prewarmed 20 mL 4i complete medium. Centrifuge cell suspension at room temperature, 300 x g for 8 min.\nDiscard supernatant and resuspend cell pellet with 5 mL prewarmed 4i complete medium.\nFilter cell suspension through a cell strainer (40 µm pore size) to remove cell aggregates. Wash cell strainer 3 times with 1 mL prewarmed 4i complete medium. Count cells using a Coulter counter.\nDilute single cell suspension of 4i naïve hiPSCs to 27.0-32.4 x 106 cells in 9 mL prewarmed 4i complete medium. Note that 4i complete medium already contains Y27632.",
    "Take the microwell plate containing 1 mL of 4i complete medium in 8 well from a tri-gas incubator (2.4.3.9). Inoculate 1 mL 4i naïve hiPSC suspension (3.0-3.6 x 106 cells/well) into each well. This cell density is critical. Make sure that cells are evenly distributed in each well by gently pipetting.\nCentrifuge the microwell plate at room temperature, 100 x g for 3 min.\nPlace the microwell plate in a tri-gas CO2 incubator (37 °C, 6.5% O2, 5% CO2). Do not disturb cells pelleted in microwells. Incubate cells for 24-30 hours. An overnight incubation (~16 hours) is typically insufficient for formation of tight EBs.\nTransfer of EBs to low attachment plates for rocking culture (Day 6)\nPrepare hPGCLC complete medium in a 50 mL centrifuge tube as follows (Day 6 - Day 13):\n\t\t20 mL hPGCLC basal medium, 4 μL of 500 mM 2-Mercaptoethanol, 50 μL of 20 mg/mL L-Ascorbic acid, 4 μL of 50 mM Y27632, 50 μL of 100 μg/mL recombinant human BMP4, 4 μL of 500 μg/mL human SCF, 4 μL of 250 μg/mL human EGF, and 8 μL of 250 μg/mL human LIF.\n\t\tNote: Prepare fresh hPGCLC complete medium immediately before use and avoid exposure to light. Do not store hPGCLC complete medium at 4 °C or frozen overnight or longer.\n\t\tNote: The concentration of BMP4 is very high. The optimal BMP4 concentration may differ between batches of BMP4. The lot-to-lot difference of BMP4 strongly affect hPGCLC production. In the absence of BMP4 in the complete hPGCLC medium, yield of hPGCLCs is very low6. The importance of other cytokine in the complete hPGCLC medium was described by Hanna/Surani6.",
    "Note: In this protocol, the final concentration of human LIF in the complete hPGCLC medium is 100 ng/mL6,10. The final LIF concentration used in previously published studies, including ours, was 1 μg/mL. When the specific activity of human LIF reagent is >10,000 units/μg (ED50 < 0.1 ng/mL), 100 ng/mL LIF is sufficient to support the hPGCLC generation from EBs.\nTransferring EBs\n\t\t\nPrewarm 5 mL hPGCLC basal medium and 20 mL hPGCLC complete medium for >5 min at 37 °C in a water bath.\nCarefully place a cell strainer upside down atop a 50 mL polypropylene conical tube.\nPipet each well of the microwell plate very gently plate to detach EBs from microwells. Filter all contents of each well through the cell strainer to remove cells not incorporated in EBs.\nWash EBs retained on the cell strainer with 1 mL of prewarmed hPGCLC basal medium. Gently repeat wash 5 times.\nWashed EBs are now retained on the membrane of a strainer, which is on a 50-mL conical tube upside-down. Place a fresh 50-mL conical tube on the cell strainer so that the cell strainer is normally positioned in the new tube. Then quickly invert the cell strainer with the new tube. The cell strainer and the tube are now in the normal positions, and EBs are below the membrane of the cell strainer.\nCollect EBs in the conical tube by adding 18 mL prewarmed hPGCLC complete medium from above the membrane of cell strainer. Thus, medium will go through the membrane and collect EBs attached on the lower side of the membrane down to the bottom of the centrifuge tube.\nPlate suspension of EBs into wells of a low-attachment 6-well plate (3 mL/well).",
    "Place the low-attachment plate on a seesaw-move rocker in a tri-gas incubator (37 °C, 6.5% O2, 5% CO2). Set the rocking speed at ~20 turns per min.\n\t\t\tNote: Do not apply swirling movement because EBs aggregate at the center of wells and fuse. Carefully adjust rocking speed so that EBs do not aggregate. Too vigorous rocking will physically damage EBs.\n\t\t\tNote: Low oxygen pressure is strongly recommended for EB culture.\nGeneration of hPGCLCs on the surface of EBs (Day 7 - Day 13)\nFreshly prepare 20 mL hPGCLC complete medium each day. Without rocking, EBs will sink down on the bottom of wells in ~1 min. Remove old medium without drying EBs (~0.2 mL/well old medium may remain) and add fresh hPGCLC complete medium every day (3 mL/well).\n3. Immunohistochemical staining of EBs (Day 10 – Day 13)\nEmbedding EBs in extracellular matrix protein blocks for formaldehyde-fixed, paraffin-embedded (FFPE) immunostaining\nTo identify hPGCLCs as OCT4+ cells, harvest EBs in a 1.5 mL low-bind microcentrifuge tube. Let EBs sink to the bottom or briefly centrifuge (2 seconds) at room temperature and discard medium. Rinse EBs with ice-cold PBS(-).\nRemove PBS(-) and incubate EBs in 1 mL of ice-cold 1%(w/v) sodium azide in PBS(-) for 5 min on ice. Let EBs sink to the bottom or briefly centrifuge (2 seconds) at room temperature. Discard supernatant, and rinse EBs with ice-cold PBS(-).\n\t\tNote: Addition of sodium azide slows down degradation of intracellular proteins and RNA transcripts.\nThaw 200 µL of extracellular matrix protein on ice and add to the microcentrifuge tube containing EBs. Leave the tube at room temperature for ~10 min until the gel is solidified.\nAdd 1 mL of 4% formaldehyde in PBS(-) and incubate at room temperature for 15 min with gentle rocking.",
    "Note: Both EBs and extracellular matrix protein are fixed during this step. Without fixation, the gel blocks may decompose during the process of dehydration. If pre-fixed EBs are embedded in the gel block, EBs are fixed again with the gel block and can be over-fixed.\nDiscard formaldehyde, and rinse EBs once with ice-cold PBS(-). Add 1 mL of 70% ethanol. Gel-embedded EBs can be stored in 70% ethanol at 4 °C for one week.\nProcess the gel-embedded EBs with a standard FFPE protocol. Prepare 5-μm thickness FFPE slides. Let slides dry overnight and store them at room temperature until immunostaining.\n\t\tNote: Our routine FFPE protocol is as follows: 70% ethanol, two changes, 1 hour each; 80% ethanol, one change, 1 hour; 95% ethanol, one change, 1 hour; 100% ethanol, three changes, 1.5 hour each; xylene, three changes, 1.5 hour each; paraffin wax (58-60 °C), two changes, 2 hours each. The dehydrated tissues are embedded into paraffin blocks and cut at 3-10 μm (typically 5 μm).\nFor staining, completely dry slides in 56 °C oven for at least 30 min. Deparaffinize and hydrate slides with xylenes and graded alcohol series. Then wash slides in tap water for 5 min.\nTo inactivate endogenous peroxidases, incubate rehydrated slides with BLOXALL Blocking Solution at room temperature for 10 min. Then wash slides with PBS for 5 min.\nBlock slides with Normal Horse Serum (or normal sera of other species generated secondary antibodies) at room temperature for 20 min.\nIncubate slides with an anti-OCT-3/4 goat primary antibody diluted with 0.1% BSA in PBS(-) at 4 °C overnight (optimize dilution and incubation conditions for each primary antibody). Then wash slides with PBS(-) three times at room temperature, 5 min each.",
    "Incubate slides with the Anti-Goat IgG (horseradish peroxidase-conjugated secondary antibody generated by horse; see Table of Materials) at room temperature for 30 min. Then wash slides with PBS(-) three times at room temperature, 5 min each.\nMix necessary amounts the DAB staining substrates (see Table of Materials) immediately before use and incubate slides in complete DAB staining solution at room temperature for 5 min. Monitor DAB staining using an inverted microscope and stop the reaction when OCT4+ cells are visualized by quickly rinsing slides in flowing tap water.\nDehydrate the slides with graded alcohol and xylenes series. The slides are ready for laser-capture microdissection. Prepare permanent FFPE slides using mounting medium (see Table of Materials) for high-resolution microscopic observations.\n4. FACS enrichment of hPGCLCs from EBs (Day 10 – Day 13)\nPreparing enzyme mix of Embryoid Body Dissociation Kit\n\t\nPrepare Enzyme Mix 1 by adding 50 µL Enzyme P to 1,900 µL of Buffer X and vortex. Prewarm Enzyme Mix 1 in a 37 °C water bath for 15 min.\nPrepare Enzyme Mix 2 by adding 10 µL Enzyme A to 20 µL Buffer Y.\nMix Enzyme Mixes 1 and 2 to prepare Complete EB Dissociation Enzyme Mix.\nDissociating EBs\n\t\nHarvest EBs from low attachment plates and centrifuge at room temperature in a 15-mL centrifuge tube, 300 x g for 2 min. Discard supernatant and resuspend EBs with 10 mL PBS(-). Centrifuge again.\nDiscard supernatant and resuspend EBs with Complete EB Dissociation Enzyme Mix (4.1.3). Incubate EB suspension in a 37 °C water bath for 15 - 20 min until EBs are dissociated. During incubation, gently pipet EBs at every 3 - 5 min to facilitate dissociation. Alternatively, use an automated dissociator with Embryoid Body Dissociation Program.",
    "Add ice-cold 8 mL PBS(-) to dissociated EB cell suspension. Filter the cell suspension through a 40-µm cell strainer. Wash cell strainer with 1 mL ice-cold PBS(-) three times.\nCount cells in filtered cell suspension using a Coulter counter.\nCentrifuge cell suspension at at 4 °C, 300 x g for 8 min and discard supernatant. Resuspend cell pellet with ice-cold 10 mL PBS(-).\nDivide cell suspension into two tubes, one for no-staining control (~105 cells) and the other for anti-CD38 staining (all remaining cells).\nCentrifuge the two tubes at 4 °C, 300 x g for 8 min.\nAnti-CD38 staining and FACS enrichment of hPGCLCs\n\t\nResuspend cell pellet for no-staining control with 200 µL ice-cold 3% (w/v) BSA and 1% (w/v) sodium azide in PBS(-). Place on ice until flow cytometry.\n\t\tNote: Addition of sodium azide slows down internalization of CD38 from cell surface.\nResuspend cell pellet for anti-CD38 staining with ice-cold 3% (w/v) BSA and 1% (w/v) sodium azide in PBS(-) to 1 x 106 cells per 100 µL.\nAdd 10 µL per 1 x 106 cells of a FACS-grade, APC-conjugated anti-CD38 antibody. Cover the tube with aluminum foil to avoid exposure to light. Incubate at 4 °C for 45 min with gentle rocking.\nAdd 5 mL ice-cold PBS(-) and centrifuge at 4 °C, 300 x g for 8 min. Discard supernatant and resuspend cell pellet with 5 mL ice-cold PBS(-). Repeat wash with PBS(-) three times in total.\nResuspend cell pellet with 500 μL ice-cold 3% (w/v) BSA and 1% (w/v) sodium azide in PBS(-) to a cell density adequate for FACS.",
    "Enrich hPGCLCs as CD38+ cells, which typically form clearly distinguished cell population. Use the no-staining control to ensure identification of CD38+ cells. Typical yield of hPGCLCs are 1-5% of all FACS-examined single cells from Day 10 EBs and 20-40% from Day 13 EBs."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}