{
  "id": 18258,
  "origin_website": "Jove",
  "title": "Intrarenal Injection of Escherichia coli in a Rat Model of Pyelonephritis",
  "procedures": [
    "All animal studies were performed according to approved Institutional Animal Care and Use Committee (IACUC) protocols at Case Western Reserve University. The duration of the surgical procedure described below is approximately 45-60 min. The MRI procedure itself is approximately 15 min for each time point.\n1. Anesthesia\nAnesthetize rat in isoflurane chamber set at 2% isoflurane mixed with oxygen to facilitate animal handling and restraint prior to administering injectable anesthesia intra-peritoneally.\nAfter 3-5 min of exposure to isoflurane, check that the animal is anesthetized and exhibits no response to toe pinch.\nFurther sedate rat with an intra-peritoneal injection of a mix of xylazine and ketamine: 75 mg/kg ketamine/10 mg/kg xylazine. When performing intra-peritoneal injections, draw back the needle to ensure that portions of the intestine or other vital organs have not been punctured.\nInject 2 mg/kg of bupivacaine subcutaneously at the site of incision to provide topical pain relief.\n2. Preparation of Surgical Area\nSterilize surgical instruments and supplies before they are used for surgery and lay out on the surgical pad for sterility. Most instruments and supplies can be autoclaved and re-used.\nUse sterile gloves for all surgical procedures.\nUse an electric razor to shave the fur off the animal's right side. Shave the animal from the bottom of the rib cage to the top of the hind leg providing a large hair-free area for the incision.\nPlace the animal on a sterile surgical pad to isolate the disinfected area from surrounding areas.\nScrub the skin with a disinfectant such as povidone iodine or betadine. Start the scrubbing at the center of the surgical site and move to the outside in a circular manner. Repeat at least three times with a new wipe of povidone iodine or betadine.",
    "Scrub the surgical site with 70% alcohol swabs until skin is clear, as iodine may be toxic if absorbed.\n3. Surgical Procedure\nMaintain this procedure under aseptic conditions.\nPosition the anesthetized animal on a warm heating bed in left lateral decubitus position with right flank facing upwards.\n\tNOTE: Care must be taken to maintain the animal's core body temperature at 35-37 °C to prevent hypothermia. This warming bed should also be sterilized as needed to maintain aseptic conditions.\nFeel for the rib cage, and make a small 2-3 cm right dorsal retroperitoneal incision using a sterile size 10 scalpel blade starting at the bottom of the rib cage.\nPlace sterile gauze longitudinally along either side of the incision.\nDissect away the subcutaneous tissue, fat, and muscles in order to visualize and access the abdominal cavity. Use curved-bladed Mayo scissors to allow deeper penetration into wound and cut thick tissues.\nOnce the liver is clearly visible and accessible, use blunt forceps to retract the liver upwards.\nUsing another pair of blunt forceps in the other hand, expose the right kidney so it sits just outside of the abdominal cavity.\nUse the pointer finger and thumb of the left hand to hold the kidney in position. With the right hand, slowly and steadily inject 0.1 ml UTI89 E. coli solution (concentration between 1 x 108-1 x 109) from a sterile syringe into the renal pelvis (which appears as a white bubble)15.\n\tNOTE: Prepare the bacterial titer as described in reference15.\nPlace a strip of absorbable hemostat over the needle to prevent outflow of inoculum into the peritoneum. Slowly pull the needle out of the renal pelvis.\n\tNOTE: Care should be taken not to pierce or infect surrounding tissues resulting in off-target infections and/or complications.",
    "Use a larger syringe to thoroughly rinse the kidney with normal saline before placing it back into the abdominal cavity.\n4. Sutures\nNote: Suture that will be buried in tissues should be 4-0 non-absorbable braided sutures. Absorbable or monofilament sutures may be used for body surfaces.\nPlace the sutures evenly and as close to the tissue edge as possible to prevent obstruction of blood flow; typically no more than 0.3 cm from the edge is necessary.\nGrasp the skin and evert it slightly using a pair of fine toothed forceps, and rotate the needle holder into a pronated position in preparation for piercing the skin.\nDrive the needle through the full thickness of skin by supinating the wrist to rotate the needle and pass it through the skin.\nRepeat this process for the skin edge closest to the individual performing the procedure.\nTighten the sutures enough to oppose the tissue edges. Any tighter will obstruct blood supply, slow wound healing and may result in dehiscence.\nTie off the suture using square knots, as if it were a simple interrupted stitch, except that only the short strand is cut, leaving about a 3-4 mm tail.\nAfter the first stitch has been tied off, prepare to place a second stitch about 3 mm away from the first, and continue the running suture.\nOnce the end of the incision is reached, do not pull the last stitch completely through. Instead, use the loop which is being held with the needle holder here as the short strand in order to tie off the distal end of the suture closure.\nUsing instrument ties, tie off the suture using square knots. This results in 3 strands sticking up from the completed knot at the distal end.\n5. Animal Recovery",
    "Inject 2.1 mg/kg Yohimbine intra-peritoneally after surgery to reverse anesthesia. Animals are expected to fully recover from the surgical procedure after 3-5 hr.\nKeep the animal on a heating pad (to avoid hypothermia) and absorbent soft bedding after surgery.\nProvide rehydration with oral or parenteral fluids until it can return to normal feeding (within 24 hr). Inject approximately 0.6 ml of normal saline solution peritoneally immediately following surgery to limit dehydration effects.\nProvide analgesia as described in the IACUC approved Animal Care and Use Protocol. Inject 5 mg/kg carprofen subcutaneously for pain management.\nMonitor incisions regularly for swelling, exudate, pain, or dehiscence.\n6. Validation via Magnetic Resonance Imaging\nConduct in vivo MRI experiments on high field small animal MRI scanners.\nInduce anesthesia with 3% isoflurane in oxygen and position the animal with the right kidney at isocenter in the MRI scanner and appropriate radiofrequency coil. Provide animals with 1-2% isoflurane anesthesia continuously throughout the imaging procedure via a nosecone.\n\tNOTE: For the in vivo MRI images shown in Figure 1, a rat-sized volume coil (inner diameter = 72 mm) was utilized.\nUse an animal monitoring and control system to maintain each animal's respiration rate (40-60 breaths/min) and core body temperature (35 ± 1 °C).\nUse a multi-slice, multi-echo spin echo MRI acquisition to obtain high resolution, axial T2-weighted images of both the infected and control kidneys. Typical MRI acquisition parameters are repetition time = 5,000 msec, echo time = 40 msec, slice thickness = 2.0 mm, in-plane spatial resolution = 200 µm, 3 signal averages, and an acquisition time of 8 min.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}