{
  "id": 2321,
  "origin_website": "Cell",
  "title": "Protocol for qPCR analysis that corrects for cDNA amplification efficiency",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nCalculate the experimental amplification factor for each qPCR\nTiming: Initial setup - 1 h, subsequent use - 5 min\nThe purpose of this step is to calculate the individual amplification factors for each qPCR and to ensure that the calculated amplification factors are accurate. This is necessary to correct for any differences in amplification efficiency.\nFill out a table as shown in Figure 1[href=https://www.wicell.org#fig1]A based on the results from the standard series.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1813-Fig1.jpg\nFigure 1. Examples for calculating the experimental amplification factor for each qPCR\n(A) Table showing the relationship between a set of standards, their concentrations in arbitrary units, and the associated CT values of 18s.\n(B) Example of the calculation of R2 of the standards based on mean CT values and their concentrations in arbitrary units.\n(C) Example of the calculation of the slope of the standards based on mean CT values and their concentrations in arbitrary units.\n(D) Example of plotting of the standard curve.\n(E) Example calculation of the experimental amplification factor based on the slope of a 2-fold serially diluted standard curve.\nAbbreviations) Amp. F. = Amplification factor (experimental).\nCalculate R2 of a linear correlation between the mean CT values, and the log-transformed standard series concentrations (Figure 1[href=https://www.wicell.org#fig1]B) – any log base will work for this purpose.\nNote: CT values can be viewed as a log2-transformed measure of the target gene amount, and thus should correlate linearly with the log-transformed version of the standard series concentrations.\nNote: The resulting R2-value should exceed 0.99 to ensure that the amplification factor calculated in step 4 is as accurate as possible. If this is not the case, refer to problem 3[href=https://www.wicell.org#sec6.5].\nCalculate the slope between the mean CT values and the log2-transformed standard curve concentrations (Figure 1[href=https://www.wicell.org#fig1]C).",
    "Note: Log base 2 is used here to fit the 2-fold serial dilution. If a 3-fold or 10-fold dilution scheme is chosen, use log base 3 or 10, respectively.\nNote: It is recommended to proceed to analysis only if the slope value lies between -0.9 and -1.1, as the expected slope of a perfect qPCR run has a value of -1. If this is not the case, refer to problem 4[href=https://www.wicell.org#sec6.7].\nOptional: Data can be plotted as shown in Figure 1[href=https://www.wicell.org#fig1]D. Transform the standard curve concentrations using the correct log base (as in step 3) and create a scatter plot with a trendline. Display Equation and R-squared value on chart to read the slope and R2 directly from the resulting figure. R2 and slope values should be as in steps 2 and 3, respectively.\nCalculate the experimental amplification factor of the qPCR run from the slope by raising 2 to the power of -1/Slope (Figure 1[href=https://www.wicell.org#fig1]E).\nNote: In the calculation above, 2 is the factor used for the serial dilution (adjust this according to dilution scheme as in step 3) and -1 is the expected slope of a perfect qPCR run.\nNote: The resulting experimental amplification factor is the factor with which the cDNA was amplified per cycle in each specific qPCR run.\nCalculate the relative expression of the gene(s) of interest\nTiming: Initial setup - 1 h, subsequent use - 5 min\nThe purpose of this step is to use the individual amplification factors to accurately calculate the relative expression of the gene(s) of interest.\nCalculate the linear form expression values for each sample by raising the associated experimental amplification factor to the power of the negative of each sample CT value (Figure 2[href=https://www.wicell.org#fig2]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1813-Fig2.jpg\nFigure 2. Examples for calculating the relative expression of the gene(s) of interest",
    "(A) Example of calculating the linear form expression value of a gene (18s).\n(B) Example of calculating a normalization factor based on multiple housekeeping genes (18s and Gapdh); by taking the geometric mean of the linear form expression values of each gene.\n(C) Example of calculating the relative expression of a gene of interest (Nrmk2) compared to a single housekeeping gene (18s).\n(D) Example of calculating the relative expression of a gene of interest (Nmrk2) compared to a normalization factor based on multiple housekeeping genes (18s and Gapdh).\n(E) Example of normalizing data such that the mean of the control group gets an arbitrary value of 1.\nAbbreviations) Amp. F. = Amplification factor (experimental), Lin. Form = Linear form, GeoMean = Geometric mean, Rel. Exp. = Relative expression, Norm. Exp. = Normalized expression.\nNote: The resulting values are a linear (rather than logarithmic) representation of the amount of replicable cDNA of the target type. If the dataset is from a housekeeping gene, and the housekeeping gene expression is truly stable, the resulting linear form expression values will correlate well with the (unknown) amount of replicable cDNA in each sample. Thus, they can be used as normalization factors.\n(Recommended) Use multiple housekeeping genes to calculate an even more accurate set of normalization factors.\nPerform steps 1–5 for all housekeeping genes\nEnsure that the linear form expression values of the housekeeping genes correlate well (see problem 5[href=https://www.wicell.org#sec6.9]).\nFind the adjusted normalization factors by calculating the geometric means of the linear form expression values from each housekeeping gene (Figure 2[href=https://www.wicell.org#fig2]B).",
    "Note: The geometric mean is used (rather than regular mean) because the data was exponentially transformed. The result is a more robust mean, similar to the regular mean between CT values, except that the experimental amplification factor of each housekeeping gene transcript has been accounted for.\nNote: Statistically, a normalization factor based on multiple housekeeping genes should correlate even more accurately with the amount of replicable cDNA in each sample than a single housekeeping gene.\nCalculate the relative expression values for the gene(s) of interest.\nPerform steps 1–5 for the gene(s) of interest.\nFor each sample, divide the linear form expression value by the normalization factor found in steps 5 or 6 (Figures 2[href=https://www.wicell.org#fig2]C and 2D).\nNote: Irrespective of the chosen type of normalization factor, the result will be the amount of the gene of interest relative to a reference that correlates with the amount of replicable cDNA in each sample. If a single housekeeping gene is used, the resulting values can be reported as gene of interest/housekeeping gene (here Nmrk2/18s), whereas if multiple housekeeping genes are used it should be reported as “relative expression” or “arbitrary units”.\nOptional: Adjust the relative expression values so the control group has a mean of 1 arbitrary unit. To do so, divide the relative expression values found in step 7, with the average relative expression value for all samples in the control group (Figure 2[href=https://www.wicell.org#fig2]E).\nNote: An advantage to this optional adjustment is that it may facilitate visualization of the data. A disadvantage is that when investigating multiple genes, it removes the ability to gauge which genes are highly expressed and which are not. Resulting values should be reported as “relative expression” or “arbitrary units”."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Gene Expression"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}