{
  "id": 17284,
  "origin_website": "Jove",
  "title": "Partial Sciatic Nerve Ligation: A Mouse Model of Chronic Neuropathic Pain to Study the Antinociceptive Effect of Novel Therapies",
  "procedures": [
    "All procedures were approved by the Institutional Animal Care and Use Committee of the University of Arizona and conform to the guidelines for the use of laboratory animals of the National Institutes of Health (NIH publication no. 80-23, 1966). Pathogen-free, adult C57Bl6/J mice (weight at testing: 22-28 g) were housed in standard vivarium mouse cages (five mice per cage) in climate-controlled rooms on a 12 h light/dark cycle and were allowed access to food and water ad libitum. All behavioral experiments were conducted by experimenters blinded to the treatment conditions.\n1. Baseline: the measure of mechanical sensitivity\nUpon arrival of the mice, allow them to habituate to the animal facility for 1 week. Then, habituate the animals to experimenter handling for ≥7 days thereafter.\nHabituate the mice to the von Frey testing apparatus for 1 h prior to testing by placing them in clear Plexiglas boxes, on a wire mesh, in the same room as the testing room-preferably with the experimenter present in the room during habituation.\nEstablish the baseline paw withdrawal threshold via the \"up-and-down\" method using von Frey filaments described in Supplementary Table S1, starting with the 3.61 (3.9 mN) filament.\n\t\nMeasure the withdrawal response to probing the mid-plantar hind paw with a series of calibrated fine (von Frey) monofilaments. Apply each filament perpendicularly once to the plantar surface of the pSNL ipsilateral hind paw of the animals held in suspended wire mesh cages. Evaluate mechanical sensitivity using the \"up-and-down\" method15: determine the withdrawal threshold by sequentially increasing or decreasing the stimulus strength, corresponding to the size of the filament. Sequentially apply each filament once.\n\t\tNOTE: The experimenter must avoid stimulating any of the footpads to obtain consistent results between the animals.",
    "For example, if the animal does not respond to the 3.61 filament, use the thicker 4.08 filament (9.8 mN) (a response is noted visually as withdrawal, shake, or licking of the affected paw); if the animal responded the first time, use the thinner 3.22 (1.6 mN) filament. Continue to use either decreasingly or increasingly thick filaments depending on whether the animal had positive or negative subsequent responses, respectively. Report negative and positive responses in the datasheet presented in Supplementary Table S1. Test the same paw 4x with different filaments following the first positive response.\n2. Baseline: the measure of thermal sensitivity using the Hargreaves test\nUpon arrival of the mice, allow them to habituate to the animal facility for 1 week. Then, habituate the animals to experimenter handling for ≥7 days thereafter.\nHabituate the mice to the Hargreaves testing apparatus for 1 h prior to testing by placing them in clear Plexiglas boxes, in the same room as the testing room-preferably with the experimenter present in the room during habituation.\n\tNOTE: The Hargreaves test requires that the animal stand still for a few seconds. With mice, habituation is key to a successful experiment. Thus, if the mice remain very active after 1 h of habituation, allow them to acclimate for longer as needed.\n\t\nDetermine paw withdrawal latencies as described by Hargreaves et al.16. Acclimate the mice within Plexiglas enclosures on a clear Plexiglass plate.\nFocus a radiant heat source (high-intensity projector lamp) onto the plantar surface of the hind paw ipsilateral to the pSNL. Adjust the intensity of the heat source to obtain a baseline of paw withdrawal latency of approximately 10 s. Then, keep the intensity constant for the remainder of the experiment.",
    "Wait for a motion detector to automatically halt the stimulus and timer when the paw is withdrawn. Use a maximal cutoff of 33.5 s to prevent tissue damage.\n\t\tNOTE: The cut-off is determined based on previous experiments and articles to avoid any additional skin damage11,17,18. With the intensity used in this study, 33.5 is the cut-off, corresponding to a stimulus intensity of 30 (50 W) using the Hargreaves apparatus. The observed behavior is a reflex behavior, not a voluntary one.\nEstablish the baseline paw withdrawal latencies using the Hargreaves apparatus and aiming at the plantar surface of the pSNL ipsilateral hind paw. Start thermal stimulation and record withdrawal latency. To avoid affecting the temperature of the heat stimulus, clean up any urine during the trials.\n3. Baseline: the measure of thermal sensitivity using the hot plate test\nHabituate the animals to the testing room for 1 h prior to testing.\n\tNOTE: As room temperature is important and can affect responses to the hot plate test, ensure the temperature of the room is consistently around 22 °C during the habituation period and through the testing period.\nSet the hot plate to 52 °C, as this temperature has been shown to ideally elicit an aversive thermal response19.\nPlace the animal in the testing chamber and start a chronometer.\nObserve for nocifensive behaviors (i.e., paw withdrawal, licking, shaking). As the pSNL surgery affects the hindlimb, disregard any behaviors observed in the forelimbs (especially forelimb licking).\nStop the chronometer as soon as nocifensive behavior is observed.\nRemove the animal from the chamber and record the latency to this behavior.\n\tNOTE: Remove the animals from the chamber after a maximum of 30 s to prevent tissue damage. Additionally, it is important to note that the observed behavior is a reflex behavior, not a voluntary one.",
    "Clean the testing chamber with 70% ethanol between animals to reduce the behavioral impact of odors. To avoid affecting the temperature of the heat stimulus, clean the apparatus of any urine between each animal tested.\nTo confirm the results, record videos of the animals in the hot plate chamber during testing for review after the animals have been tested.\n\t​NOTE: By using video review to quantify latencies, the experimenter can repeatedly observe the test and closely analyze nocifensive behaviors that may have been missed during real-time observation.\n4. Preoperative preparation\nNOTE: Ensure clean cages are available for recovering the mice after surgery. Clean the surgical area with 70% ethanol, disinfect hands with 70% ethanol, use sterile gloves, wear proper personal protective equipment (PPE) (lab coat, hair net, shoe covers), and practice sterile techniques throughout the surgery.\nPrepare the tools (Supplementary Figure S1) and additional resources (gauze) to be used in surgery by autoclaving them beforehand.\nInduce anesthesia using volatile isoflurane and adjust as needed to maintain a surgical plane. Ensure oxygen is at an appropriate flow rate.\nTo ensure the animal is anesthetized, pinch the toes on a hind paw with tweezers to ensure the absence of paw reflex and check the corneal blink reflex before applying lubricating ophthalmic ointment.\n\t​NOTE: Analgesics cannot be offered in this study as they may alter the pain pathway intended to be analyzed or even neutralize and invalidate the behavior being measured in accordance with pain research goals20,21,22.\nUpon choosing which side to perform the surgery on (left is demonstrated here), shave the animal's hind leg around the thigh region, inferiorly toward the patella, superiorly toward the hip, and above the femur. Wipe 3x with chlorhexidine in one direction with three separate gauzes, alternated with warm sterile saline.",
    "​NOTE: Going forward, ensure every animal has the surgery performed on the same side to maintain consistency.\nSlip the leg through a slit made in a 10 cm x 10 cm sterile drape to create a sterile field around the leg of choice.\n5. Surgical procedure\nUsing fine surgical scissors (Supplementary Figure S1F), make a small 2 mm cut of the skin in the midline of the lateral aspect of the thigh. Slide the scissors under the skin in a circular motion to break through the fascia and create a clearance, enlarging the incision space.\nUsing tying forceps (Supplementary Figure S1H), create a sharp incision vertically at a 90° angle in the thigh muscles, 1 cm deep.\nInsert the fine small scissors (Supplementary Figure S1G) into the same incision, also at a 90° angle, and spread them open gently to separate the muscles. Continue to do this until the sciatic nerve is visualized.\nLocate the sciatic nerve, which can appear glossy and thin, running parallel to the vertical thigh, in the direction of the hip to the knee. Remove the scissors and the tying forceps from the body before proceeding.\nUse the extra fine forceps (Supplementary Figure S1D) and the nerve glass hook (Supplementary Figure S1E) to isolate the nerve from underneath. Carefully free the nerve from surrounding connective tissues at a site near the trochanter of the femur, which is closest to the hip and furthest from the knee.\nAllow the nerve to rest on the glass rod and ensure that the end of the rod prevents the nerve from rolling off.\nPlace a surgical knot to tie 1/3 of the width of the sciatic nerve using a 9-0 nylon suture, prior to it dividing into the common peroneal, tibial, and sural nerve branches3.",
    "NOTE: The branching occurs as the sciatic nerve courses down the knee, away from the hip. Since these three branches of the nerve have three different innervations, it is imperative to place the surgical knot prior to the branching to ensure the same nerve deficits across all animal surgeries.\nTake care to hold the threads close to the knot when pulling the threads tight, so as not to tug on the nerve with excessive force to avoid sliding the nerve off the glass rod and avoid further stretch injury.\nCarefully slip the nerve off the glass rod once the knot is complete and tuck it back into the original location at the level below the separated muscles.\nSuture the muscle incision using an absorbable polyglycolic 5-0 suture. Separately, suture the skin using a non-absorbable polypropylene 6-0 suture.\nRecord the surgery and anesthesia stop time. Allow the mouse to wake up, alone in a recovery cage, before returning it to a new clean cage.\n\t​NOTE: Throughout the surgery, pinch the animal's toes to confirm adequate maintenance of anesthesia and monitor its breathing and bodily perfusion (red, pink, pale). If the breathing is significantly reduced or the animal appears pale, consider reducing the anesthesia flow or increasing the oxygen flow and have a syringe filled with saline ready to inject subcutaneously to rehydrate the animal. At all times, the animal should have a heat source placed below it to maintain body warmth.\n6. Sham surgery procedure for control animals\nFollow steps 5.1-5.11 of the surgical procedure; exclude steps 5.4-5.9.\n7. Postsurgical behavioral tests\nNOTE: Ensure that the experimenter is blinded to any treatment. Chronic neuropathic pain will develop over 2 weeks post-surgery, after which behavioral tests can be conducted following administration of compounds of interest.",
    "Use the von Frey, Hargreaves, or hot plate test to evaluate both thermal and mechanical hypersensitivity and its potential reversal.\nRemove any animal from the study if it meets endpoint criteria as described by the institutional animal care and use committee.\nEuthanize the animals following procedures described by the institutional animal care and use committee at the end of the behavioral testing.\n8. Data analysis\nvon Frey:\n\t\nAnalyze the data using the nonparametric method of Dixon, as described by Chaplan and colleagues23, and express the data as the mean withdrawal threshold.\n\t\t\nOn the main page of the referenced software (see Table of Materials), select all the filaments that were used for the study (2.44, 2.83, 3.22, 3.61, 4.08, 4.31, and 4.56). In the group panel, select the filament corresponding to the last simulation. In the blank box, report the positive (X) and negative (o) responses. Write down the thresholds reported in the box on the left of the observed pattern of responses.\n\t\t\tNOTE: An example of pattern and quantification is presented in Supplementary Figure S2.\nHargreaves and hot plate:\n\t\nReport the latencies in a spreadsheet for further statistical analysis.\nPlot the results as the mean of the sensitivities (thresholds or latencies) as a function of time.\n9. Instructions on how to make the nerve glass hook\nNOTE: Practice fire safety throughout this process. Wear proper protection, such as heat-resistant gloves or eyewear as necessary.\nTurn the Bunsen burner on.",
    "Hold one end of the glass rod (A) to the fire in one hand. As this glass rod melts, use another glass rod (B) in the other hand to guide and pull at the melting glass on rod A. Remove glass rod A from the fire and allow the end of the melted portion to naturally roll inward to form a small ball shape. Use the glass rod B to guide this shape.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}