{
  "id": 17568,
  "origin_website": "Jove",
  "title": "Basophil Activation Test for Allergy Diagnosis",
  "procedures": [
    "The protocol performance was conducted according to the Declaration of Helsinki principles and approved by the local Ethics Committee (Comité de Ética para la Investigación Provincial de Málaga, Spain). All subjects were informed orally about the research study and they signed the corresponding informed consent form.\nNOTE: The present protocol details the BAT procedure that the authors use daily. However, this is not a standardized method and differences with procedures published by other authors exist. The main protocol modifications are related to the use of IL-3 in the stimulation buffer, incubation time with the stimulus, method for stopping basophil degranulation, and flow cytometry strategies. Moreover, different commercially available kits for BAT include specific protocols recommended by the manufacturer.\n1. Sample preparation\nCollect peripheral blood in 9 mL heparinized tubes and maintain the sample at room temperature (RT) in a rotor until it is required for the experimental protocol.\nLabel 5 mL cytometer tubes for negative controls (2 tubes), positive controls (2 tubes) and different concentrations of allergen/drug (1 tube per each allergen/drug concentration tested). Place the tubes in a rack where tubes fit perfectly without slipping.\nPrepare stimulation buffer in double distilled water containing 2% (v/v) HEPES, 78 mg/L NaCl, 3.7 mg/L KCl, 7.8 mg/L CaCl2, 3.3 mg/L MgCl2, 1 g/L HSA. Adjust pH to 7.4 and add IL-3 at 2 ng/mL. Usually prepare 100 mL and divide in 2.5 mL aliquots to be frozen at -20 °C.\nPrepare positive controls in PBS-Tween-20 0.05% (v/v) (PBS-T): Positive control 1, N-Formylmethionyl-leucyl-phenylalanine (fMLP) (4 µM), to confirm quality of basophils; Positive control 2, Anti-IgE (0.05 mg/mL) as a IgE-mediated positive control.\nPrepare the allergen/drug in PBS-T at 2x the desired final concentration.",
    "​NOTE: Optimal allergen/drug concentrations to be used must be previously determined by using a wide range of concentrations, by dose-response curves, and by cytotoxicity studies following the same protocol steps139.\n2. Staining mix preparation\nAdd monoclonal antibodies labelled with fluorochrome to the stimulation buffer following manufacturer´s recommended antibody concentration or by previous antibody titration. In this protocol we add 1 µL of each antibody (CCR3-APC and CD203c-PE for basophil identification; CD63-FITC for basophil activation)140 per 20 µL of stimulation buffer.\n\tNOTE: Protect the staining mix preparation from the light.\nAdd 23 µL of staining mix to each tube.\n3. Blood stimulation\nAdd 100 µL of PBS-T to tubes 1 and 2 (negative control), 100 µL of fMLP to tube 3, 100 µL of anti-IgE to tube 4, and 100 µL of the different allergen/drug concentrations to the following tubes. Incubate for 10 min at 37 °C in a thermostatic bath with medium agitation to prewarm reagents.\nGently add 100 µL of blood to each tube to avoid hemolysis. Gently vortex tubes and incubate for 25 min at 37 °C in a thermostatic bath with medium agitation.\nStop the degranulation, keeping tubes at 4 °C for at least 5 min.\n\t​NOTE: The protocol can be paused here at 4 °C for 30-45 min if required141,142,143.\n4. Erythrocytes lysing\nAdd 2 mL of 1x lysing buffer to each tube to lyse erythrocytes. Vortex each tube and incubate for 5 min at RT.\n\tNOTE: In this step, cells are fixed due to fixative agents (formaldehyde) contained in the buffer.\nCentrifuge at 300 x g at 4 °C for 5 min. Decant the supernatant, overturning the rack into a sink. Cells remain at the bottom of the tubes.\nAdd 3 mL of PBS-T to each tube to wash cells. Vortex each tube.",
    "Centrifuge at 300 x g at 4 °C for 5 min. Decant the supernatant, overturning the rack into a sink.\n\t​NOTE: Keep samples at 4 °C, protected from the light until flow cytometer acquisition.\n5. Flow cytometry acquisition\nAcquire samples by flow cytometer (e.g., BD FACSCalibur Flow Cytometer). Connect the flow cytometer to the computer software and wait for the cytometer to be ready. Load the template and instrument settings (Table 1).\nStart sample acquisition.\nUse the following cytometer strategies for selection of activated basophils139.\n\t\nGate the lymphocytes from the Side Scatter (SSC) - Forward Scatter (FSC) plot.\nGate the basophils from the lymphocyte population as CCR3+CD203c+ cells. Acquire at least 500 basophils per tube.\nShow a CCR3 - CD63 plot to analyze activation using CD63 as activation marker. Set the CD63 negative threshold to approximately 2.5% using the negative control tubes.\nAcquire all the samples.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}