{
  "id": 3908,
  "origin_website": "Cell",
  "title": "Protocol for single-molecule fluorescence recovery after photobleaching microscopy to analyze the dynamics and spatial locations of nuclear transmembrane proteins in live cells",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nsmFRAP experiment: data collection\nThis major step describes how to align the laser as well as single-molecule imaging parameters to perform smFRAP.\nEnsure that the required laser is aligned to precisely strike the center of the detector in a perpendicular manner and is aligned with the center of the detector’s guides. The detector we used is an on-chip EMCCD camera (Cascade 128+, Roper Scientific Inc.). The guides delineate the center of the detector and can be toggled on or off within the capture program, here we will be using SlideBook 6.1. In our case, the 561-nm lasers are aligned as our NETs of interest are fluorescently tagged with mCherry. This setup may be modified to make use of a laser appropriate to the specific fluorophore (Figure 1[href=https://www.wicell.org#fig1]A).\nTo align the laser to strike the detector in a perpendicular manner begin by adjust the laser pathway to strike the center of the mirror positioned on the micrometer stage.\nAt 10× magnification, adjust the micrometer stage so the laser strikes the center of the detector’s guides.\nIncrease the magnification to 100× and adjust the micrometer stage so the laser once again strikes the center of the detector’s guides.\nAdjust the focus to evaluate the laser pattern. If the laser is striking the detector at 90°, the laser should appear to be symmetrical as it is adjusted in and out of focus.\nIf the laser pattern is not symmetrical, gently adjust the mirrors positioned prior to the iris on the laser line until the laser pattern appears symmetrical.",
    "After the laser pattern is symmetrical, adjust the focus until the laser is at the smallest point and capture an image. This is to be used as a reference point to determine where the laser is striking in relation to your sample.\nUtilize a 100× oil immersion objective to visualize cells under a mercury lamp with the corresponding filter sets for mCherry.\nIt is critical to target only cells that exhibit a healthy nuclear morphology, defined here as free from nuclear blebbing or other signs of apoptosis (Figures 2[href=https://www.wicell.org#fig2]B and 2D) as well as sufficient expression of fluorescence fused NETs (Figures 2[href=https://www.wicell.org#fig2]A and 2C). Sufficient expression of fluorescence fused NETs can be determined by capturing an image of the Nucleus using the fluorescence wavelength associated with your protein of interest. This image should clearly display a nuclear ring (illuminated nuclear envelope with a dark nucleoplasm) as NETs are, by definition, embedded in the nuclear envelope. This means that only cells in interphase should be selected, cells in mitosis should be avoided. Bring the focal plane to equator of the cell and then move the left or right edge of the NE (tangent to the edge of NE) to the center of the camera. This ensures that the center of the laser illumination point spread function (PSF) will strike only the edge of the nuclear envelope (Figure 1[href=https://www.wicell.org#fig1]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/631-Fig2.jpg\nFigure 2. Representative cells",
    "Epi-fluorescent (A) and bright-field (B) microscopy images of healthy cells, representative of the types of cells that should be imaged, exhibiting healthy cell shape when adhering to the bottom of the optic dish. Epi-fluorescent (C) and bright-field (D) microscopy images of unhealthy cells, representative of the types of cells that should not be imaged. Note the shrunken GFP-NE rings as well as being poorly attached to optical dish. Scale bar, 10 μm.\nTake a pre-photobleaching image of the cell with 500-ms exposure time with the mercury lamp. Overexposure and saturation of the image should be avoided.\nClose the shutter to the mercury lamp and switch to the laser. If the intended photobleaching area is at the center of laser PSF, begin photobleaching the desired area by opening the corresponding shutter to the laser. If the intended photobleaching area is off the center of laser PSF, move the area to the PSF center and then begin photobleaching.\nPhotobleach a small area of the NE under high laser power for 10-30 s, depending upon your specific fluorophore. The photobleaching area is around 1 μm in diameter (Figure 1[href=https://www.wicell.org#fig1]B).\nTo determine what timeframe is the most appropriate for your fluorophore, set the photobleaching laser power to 10 times that of the excitation laser power.\nPhotobleach a test cell for 10 s. Immediately after photobleaching, capture an image of the photobleached region and use Fiji ImageJ to evaluate for the presence of fluorophores.",
    "To evaluate for the presence of fluorophores, open the image in Fiji ImageJ. Select two ROIs, one in the center of the photobleached region and one on a dark region, the center of the nucleus is a good option. Use the Measure tool under the Analyze window for each ROI. This tool allows you to gain information regarding the diameter of the region measured, the minimum and maximum pixel intensity within the ROI, and the mean intensity. Compare the mean intensity of the photobleached ROI with that of the background ROI. If the photobleached ROI displays a mean intensity value greater than the background ROI by more than 2, there is likely still fluorophores that were not successfully photobleached within the ROI. If this is the case, select another region and increase the photobleaching time by 10 s and evaluate for fluorescence. Repeat these steps until the appropriate timeframe is identified for your fluorophore.\nNext, use the neutral density filter installed in the laser light path to lower the laser power to excitation level to at ~10% of the photobleaching laser power. The laser power may be adjusted to optimize the signal-to-noise ratio (SNR).\nEngage the optical chopper at 2-Hz rotation speed with an on time of 1/10 of the total frames recorded (Figure 1[href=https://www.wicell.org#fig1]B).\nRecord video at a 2 ms per frame for 30 s to produce a video with 15,000 frames. Three total videos are taken consecutively. Here, the SlideBook software is used to record images and videos.\nAfter recording videos, take a post-smFRAP image with 500-ms exposure time mercury lamp. The overexposure and saturation of the image should be avoided. Check whether the NE shifted during the experiment by comparing pre-photobleaching image and post-smFRAP image.\nBulk FRAP experiment (performed with the confocal microscope): data collection",
    "This major step describes how to perform a FRAP experiment at the bulk level.\nPlace the sample on the Olympus FluoView 3000 laser scan confocal microscope.\nTurn on the required lasers. In our case, both the 488-nm and the 561-nm lasers are turned on.\nUtilize a 60× oil immersion objective to visualize cells with the laser and the corresponding filter sets for GFP or mCherry.\nWe target only cells with good nuclear morphology and good expression of fluorescence fused NETs (Figure 2[href=https://www.wicell.org#fig2]). Bring the focal plane to equator of the cell.\nSelect region of interest (ROI). In our case, we select rectangular area including single cell. Then set proper scan size and scan speed for making sure scanning time is short enough. In our case, scan size is 512 × 512 pixel and scan speed is 2 μs/pixel.\nTake a pre-photobleaching image of the cell by corresponding laser for attaining baseline curve of FRAP curve. If the NET of interest is fused to GFP, a 488-nm laser could be used for imaging. Here, need to set laser intensity, sensitivity, gain and offset in advance to taking an image. In our case, laser intensity is 10%; sensitivity is 700V; gain is 1.0; offset is 0%. The overexposure and saturation of the image should be avoided.\nUse the sequence manager module on Olympus Fluoview3000 to conduct bulk FRAP experiment.\nSelect region of photobleaching. In our case, we select a circular area covering a small region at the edge of the NE opposite the endoplasmic reticulum (ER). The laser intensity and photobleaching time is dependent on the NETs of interest. In our case, we did 30 s under 100% intensity of 488-nm laser for NET23.",
    "Next, take time-lapse images of recovery in 0.5 Hz for 1 min. All of parameter setting should be same as step 6. If 1 min is not sufficient for the fluorescence recovery curve to reach a plateau, the time could be prolonged to 2 mins.\nAnalysis of bulk FRAP data\nThis major step describes how to analyze bulk FRAP images captured on the confocal microscope to calculate the proportion of immobile and mobile NETs localized to the Nuclear Envelope.\nUse ImageJ to open bulk FRAP images in sequencing starting with the pre-photobleaching image, followed by the time-lapse images of recovery (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/631-Fig3.jpg\nFigure 3. Bulk FRAP analysis flowchart\nShown here is a step by step flowchart demonstrating the individual tools and methods to utilize FRAP Profiler in order to determine the proportion of mobile fluorescent proteins on the NE.\nOpen the ROI manager (ImageJ/ Analyze/Tools/ROI Manager) and select the two regions of interest. The one ROI is the photobleached region of NE and the second ROI is the edge of NE excluding photobleached area, which must be carefully outlined with the freehand selection tool.\nGenerate FRAP curve by running FRAP Profiler plugin (https://imagej.net/mbf/intensity_vs_time_ana.htm[href=https://imagej.net/mbf/intensity_vs_time_ana.htm]) and determine the immobilized fraction for overall NE by using the normalized output.\nNext, calculate the immobilized fraction of NETs on the INM. This is done by evaluating the FRAP curve generated by FRAP profiler. The fraction recovery at the point the FRAP curve plateaus is the fraction of mobile NETs whereas the difference between the prephotobleached and the plateaued recovery curve represents the fraction of non-mobile NETs (Figure 7[href=https://www.wicell.org#fig7]D).",
    "Determine the final concentration ratio of NETs on the ONM and INM by using the diffusion-based concentration ratio and the immobilized fraction on the INM. For example, if the diffusion-based concentration ratio (ONM: INM) is 1:0.30 and the immobilized fraction on the INM is 0.72. Then, the final corrected concentration ratio 1:1.1 (ONM: INM) is obtained by 1:(0.30 /(1-0.72)).\nAnalysis of smFRAP data\nThis major step describes how to analyze single-molecule FRAP data, including how to fit the INM and the ONM to determine the proportion of fluorophore tagged NETs localized to each discrete membrane.\nConvert videos generated with Slidebook into image sequence .tiff files.\nUse the peak fit (series) function of the ImageJ plugin GDSC SMLM (http://www.sussex.ac.uk/gdsc/intranet/microscopy/UserSupport/AnalysisProtocol/imagej/gdsc_plugins/[href=http://www.sussex.ac.uk/gdsc/intranet/microscopy/UserSupport/AnalysisProtocol/imagej/gdsc_plugins/]) to localize each data point from the .tiff files (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/631-Fig4.jpg\nFigure 4. GDSC single-molecule localization flowchart\nShown here is a flowchart depicting individual settings, tool locations, and parameters for localizing and calculating the diffusion coefficient of Single-Molecules using GDSC. Note the settings are correct only for the smFRAP microscope setup described in this protocol.\nFilter the raw data from GDSC SMLM by using the signal to noise ratio (SNR), localization precision and the width of the Gaussian fitting (wi). In our case, the threshold for SNR is > 10; the localization precision is <20 nm; and the wi is 0.5~2.0. These filters are selected as this method allows for the detection between INM and ONM, which are separated by a perinuclear space of ~40 nm (7). The localization precision of the detected NETs must be, at most, half that of the perinuclear space to ensure that the detected particle is assigned to the appropriate membrane.",
    "Calculate the diffusion coefficient of the filtered points using GDSC SMLM with the built-in trace diffusion tool (Figure 4[href=https://www.wicell.org#fig4]). Ensure that the MSD correction feature is selected as this will account for distances between discrete steps of the trace, and not simply average the distance between the locations of the beginning and end point. It is important to gather sufficient traces to ensure the quality of the calculated diffusion coefficient. Samples with a more consecutive frames are desirable. For our purposes, traces consisting of seven or more consecutive frames are considered separately from traces consisting of two to six consecutive frames. Approximately 50 single-molecule traces of the seven or more class or approximately 500 of the two to six class are required. Finally, an averaged diffusion coefficient is then calculated from the observed traces.\nUse OriginPro 2019 to plot all filtered data points localized via GDSC SMLM. This enables the user to visualize the distribution of data points, and will be plotted in the rough shape of the right or left edge of NE (Figure 5[href=https://www.wicell.org#fig5]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/631-Fig5.jpg\nFigure 5. Analysis of smFRAP data\n(a) Two-dimension (2D) localizations of a NET protein of interest on the NE.\n(b) Frequency distribution histogram for the locations of NETs protein along the X dimension. The background noise (without the data from the two peaks) is fit with a single Gaussian function (red curve). Previous experiments verified that the background-noise distribution was generated by randomly diffusing fluorophores around the NE, rather than the membrane proteins located at the NE (3).\n(c) Background signal is subtracted to generate a histogram with two clear peaks. The peak positions for membrane proteins on the NE can only be precisely determined after subtracting the background-noise distribution.",
    "(d) The resultant data are fit with a two-peak Gaussian function (red curves) to determine the localization of NETs on the NE. N: nucleus; C: cytoplasm; INM: inner nuclear membrane; ONM: inner nuclear membrane.\nFrom here, plot the frequency distribution histogram by using the x coordinates of these data points (Figure 5[href=https://www.wicell.org#fig5]B). In our case, the line perpendicular to the right or left NE edge is parallel to the x axis. Therefore, we use the x coordinates. Use y coordinates to plot frequency histogram if targeting up or down edge of the NE.\nStill using OriginPro 2019, select and mask the binned localizations ±40nm from the two highest peaks of the frequency distribution histogram of x coordinates. This will exclude these data points from the subsequent Gaussian fitting.\nFit the histogram with a single Gaussian function (Figure 3[href=https://www.wicell.org#fig3]B). The area under the curve is representative of background noise. For a complete explanation, please consult Mudumbi et. al. 2016 (Mudumbi et al., 2016a[href=https://www.wicell.org#bib3]).\nUsing the built in subtract function of OriginPro 2019, subtract the area under the curve from the entirety of the x-coordinate histogram (Figure 5[href=https://www.wicell.org#fig5]C).\nFurther fit the background reduced histogram with a two-peak Gaussian, yielding distribution of NETs on inner and outer NE membranes (Figure 5[href=https://www.wicell.org#fig5]D).\nThis information enables you to calculate the ratiosmFRAP of NETs on outer nuclear membrane (ONM) to inner nuclear membrane (INM). This is accomplished by dividing the area under the ONM curve by the area under the INM curve.",
    "The concentration ratio of NETs on the ONM and INM must now be corrected. This is accomplished by factoring in the impact of the diffusion coefficient of NETs protein on both the INM and ONM. The formulas were originally published in our previous works (Mudumbi and Yang, 2017[href=https://www.wicell.org#bib4], Mudumbi et al., 2016b[href=https://www.wicell.org#bib5], Mudumbi, 2020[href=https://www.wicell.org#bib9]; Mudumbi et al., 2016a[href=https://www.wicell.org#bib3]).\nThe equation G(i,D,t) represents the probability of finding a randomly diffusing particle at location i following diffusion at a diffusion constant of D within the time t (Figure 6[href=https://www.wicell.org#fig6]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/631-Fig6.jpg\nFigure 6. Correction of ONM:INM ratios by factoring in the impact of the molecular diffusion coefficient derived from single-molecule trajectories\nThis calculation accounts for discrepancies in diffusion coefficients of transmembrane proteins on the nuclear envelope as they enter the detection area (depicted as a gray circle). The distribution ratio is also corrected to reflect the actual transmembrane protein concentrations along the nuclear envelope. The outer ring (Rmax) is representative of the nuclear envelope circumference. The detected molecule (green) may diffuse into the detection area from any direction within the distance x from the center of the photobleached area (depicted by the inner ring).\n(A) In this equation G(i,D,t) denotes the probability of finding a randomly diffusing molecule at location i with a diffusion constant of D within time t.\n(B) The integrated probability that a molecule with a beginning location at i (green) will diffuse into the detection area (gray).",
    "(C) f(D,t) refers to the summed probability of observing a molecule diffusing into the detection area from any locations within the entire area (Rmax). In the equation, 2R is an approximation for the length of the arc from of a circle of radius i that falls within the gray circle of radius R. This figure was originally published in Nature Communications (Mudumbi et al., 2016a[href=https://www.wicell.org#bib3]) and is redrawn here with permission.\n   (Equation 1)   G  (  i , D , t  )  =  1   4 π D t    ∗  e   −  i 2    4 D t        \nThe equation f(D,t) refers to observing a molecule diffusing into the detection area from any locations within the entire area (Rmax) (Figures 6[href=https://www.wicell.org#fig6]B and 6C), in which 2R is an approximation for the length of the arc from of a circle of radius i that falls within the gray circle of radius R.\n   (Equation 2)   f  (  D , t  )  =   ∫ R  R max    2 π x d x     ∫  x − R   x + R     2 R   2 π i    G  (  i , D , t  )  ∗ d i     \nThe equation V(D) denotes the total area that a particle travels from t1 to t1 + 30 s.\n   (Equation 3)   V  ( D )  =   ∫  t 1   t 1 + 30    f  ( t )  d t       \nFrom this series of equations, the corrected concentrations of the ONM and INM can be derived using the following relationship:\n   (Equation 4)     N  O N M    N  I N M    =    V  O N M   ∗  C  O N M      V  I N M   ∗  C  I N M",
    "where NONM and NINM are the originally derived values from step 10(a), VONM and VINM is calculated using equation 3[href=https://www.wicell.org#fd3]. CONM and CINM represent the actual concentrations of NETs, and can be derived by solving this relationship.\nNext, calculate the fraction of mobile NETs on the INM. Here the actual proportion of the NETs on the ONM is denoted as NONM and the INM is NINM. The immobile fraction of INM is defined as x. Fm denotes the mobile fraction as determined by FRAP in step 3 of bulk FRAP analysis. R represents the corrected concentration ratio after considering the effects of diffusion coefficients on the NETs. These formulas were originally published previously in earlier work (Mudumbi and Yang, 2017[href=https://www.wicell.org#bib4], Mudumbi et al., 2016b[href=https://www.wicell.org#bib5], Mudumbi et al., 2016a[href=https://www.wicell.org#bib3], Mudumbi et al., 2020[href=https://www.wicell.org#bib9]).\n   (Equation 5)    N  O N M   +  (  1 − x  )  ∗  N  I N M   =  F m   (   N  O N M   +  N  I N M    )      \n   (Equation 6)     N  O N M     (  1 − x  )  ∗  N  I N M     = R"
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Biotechnology And Bioengineering",
    "Atomic Force Microscopy (Afm)",
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}