{
  "id": 4098,
  "origin_website": "Cell",
  "title": "Assessment of escape from X chromosome inactivation and gene expression in single human immune cells",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nCritical: Make sure to use tubes, pipette tips, reagents, etc. that are suitable for PCR experiments and are therefore free of DNA and free of DNase/RNase.\nUsing the C1 to generate pre-amplified cDNA of individual captured cells\nTiming: this is variable depending on the processing time of cells for step 1\nTiming: 20 min for step 2\nTiming: 15 min (for the C1 Single-Cell Preamp IFC, 5–10 μm) for step 3\nTiming: depends on the percentage of target cell in cell population for step 4\nTiming: 30–40 min for step 5\nTiming: 20 min, the Preamp program runs for 5–6 h for step 6\nTiming: 60 min for step 8\nTiming: variable, depending on how many donors and conditions will be pooled for step 9\nThe following steps were adapted from the protocol Using C1 to Capture Cells from Cell Culture and Perform Preamplification Using Delta Gene Assays (PN 100–4904 L1) :\nhttps://www.fluidigm.com/binaries/content/documents/fluidigm/resources/c1-delta%E2%80%90gene-pr-100%E2%80%904904/c1-delta%E2%80%90gene-pr-100%E2%80%904904/fluidigm%3Afile[href=https://www.fluidigm.com/binaries/content/documents/fluidigm/resources/c1-delta%E2%80%90gene-pr-100%E2%80%904904/c1-delta%E2%80%90gene-pr-100%E2%80%904904/fluidigm%3Afile]\nThere is the possibility to include RNA spikes as an additional control. Refer to the protocol for more information. Fluidigm reagents should be thawed to 20°C–24°C, vortexed thoroughly and spun down prior to usage. Frozen, non-Fluidigm reagents should be thawed and stored on ice, vortexed thoroughly and spun down prior to usage. Cell Wash Buffer (Fluidigm) and the Single Cell Lysis Solution (Thermo Fisher Scientific) are stored at 4°C and should be kept on ice for the duration of the experiment. Keep non-Fluidigm reagents and mixes containing non-Fluidigm reagents dark and on ice. The Fluidigm reagents used in this section are from the C1 Single-Cell Reagent Kit for Preamp (Fluidigm, Cat#: 100-5319).",
    "Preparation and staining of cells The length of the steps depend on whether you use freshly isolated or frozen cells and whether you would like to investigate unstimulated or stimulated cells. When using cells from a cell line or an organoid culture, it could also be possible to omit the sorting step. In that case determine your cell number and mix your cells with the Suspension Reagent (Fluidigm). For obtaining pDCs from PBMCs it is possible to perform a pre-enrichment before sorting, but that is only necessary if they will be stimulated to exclude the influence from other cell types. Otherwise it is possible to sort from bulk PBMCs, since only 2000–4000 individual cells are needed. Sorting from PBMCs decreases the processing time.\nResuspend 12.5×106 PBMCs (to ensure to be able to sort 2000–4000 pDCs) with 31.25 μL of surface antibodies and viability stain in 250 μL PBS for 20 min at 20°C–24°C in the dark. The volume of the antibody and staining volume were scaled up accordingly (×2.5) from the values in Table 1[href=https://www.wicell.org#tbl1].\ntable:files/protocols_protocol_835_2.csv\nAfter 20 min, add 3 mL PBS and centrifuge (7 min / 500 g).\nDiscard the supernatant.\nCritical: keep the stained cells dark and on ice.\nNote: It is recommended to run the sample at your cell sorter, before starting with the next steps.\npDCs were defined as single and live CD3-CD19-CD56-CD11c-CD14- and HLA-DR+ and CD123+. For the gating strategy refer to Figure 2[href=https://www.wicell.org#fig2].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/835-Fig2.jpg\nFigure 2. Gating strategy to sort human pDCs from human PBMCs\npDCs were defined as single, live and CD3-CD19-CD56-CD11c-CD14-CD123+HLA-DR+. LDM: live-dead marker. The gating strategy was adapted with permission from (Hagen et al., 2020[href=https://www.wicell.org#bib6]).",
    "Preparation of the mixes for cell lysis, reverse transcription and pre-amplification These are the different mixes for the cell lysis, reverse transcription and pre-amplification of the regions of interest.\nCritical: Pipette the mixes in a pre-PCR area.\nPrepare the Reverse Transcription Final Mix and the Preamp Final Mix according to company protocol on p. 16–17 (the pooled primers were prepared before).\nNote: Pay attention when pipetting the Single Cell PreAmp Mix (Thermo Fisher Scientific) as it is difficult to pipette due to the viscosity of the liquid.\nThe Adapted Lysis final mix is prepared as follows:\nPrepare a Lysis/DNase solution: 1.4 μL of DNase I solution 12.6 μL of Single-Cell lysis solution\nAdapted Lysis Final Mix: 12.75 μL Lysis/DNase solution 4.35 μL C1 Lysis Plus Reagent 0.9 μL C1 DNA Dilution Reagent\nStore the prepared mixes dark and on ice until usage.\nPriming of the C1 IFC\nPriming of the C1 IFC is done according to the protocol on page 19.\nAfter priming the C1 IFC should be loaded with the cells within 1 h.\nFor pDCs and cells of a comparable size, use the C1 Single-Cell Preamp IFC, 5–10 μm.",
    "Sorting of the cells into the C1 IFC For calculations and an extended protocol for sorting of the cells into the C1 IFC, refer to the Fluidigm guide Cell Sorting Directly to the C1 IFC (PN 101–5826 A2) and the excel sheet Reagent Calculations_Sorting Into C1 IFC: https://www.fluidigm.com/articles/cell-sorting-directly-to-the-c1-ifc[href=https://www.fluidigm.com/articles/cell-sorting-directly-to-the-c1-ifc] The cell number/concentration and the buoyancy of the cells is very critical in order to achieve a high capture rate of the cells within the C1 IFC. Sorting of the cells gives the best control over purity and cell number and with a small cell population it is recommended to sort directly into the C1 IFC. It is also possible to sort the cells into a different tube (e.g., PCR tube) and then transfer them afterward into the C1 IFC. Use a 70 μm nozzle to ensure small sorting volume (1000 cells will be in roughly 1 μL volume), and keep the sorting speed at 1.0. Make sure to select single cell sort. We sorted with a FACSAria Fusion from BD, please adapt the settings according to your cell sorter. The cells were sorted at 4°C. For pDCs we aimed at cell concentration of 420 pDCs / μL (3360 pDCs in 8 μL), with adding 1 μL Suspension Reagent (Fluidigm) for 3 μL of cell suspension (2 μL of Suspension Reagent in a total volume of 8 μL). Roughly 5 μL of cell suspension will be loaded on the C1 which are under these conditions around 2100 pDCs total.\nIf you have a limited number of cells, it can be helpful to set up the sorting gates with a reference sample.\nFor the gating strategy for human pDCs see Figure 2[href=https://www.wicell.org#fig2].",
    "Remove the C1 Blocking Reagent from the cell inlet and the cell outlet of the C1 IFC (do this shortly before the sort).\nAdd 1 μL of FACS Buffer to the cell inlet.\nSort 3360 pDCs into the cell inlet of the C1 IFC (which will be equivalent to roughly 3.4 μL of volume with the FACSAria Fusion and the settings explained above).\nIf you have more cells you can sort them into a PCR Tube containing 1 μL of FACS buffer and then use those later for the Tube Control (Positive Control).\nAdd 1.6 μL of FACS Buffer.\nThoroughly vortex and spin the Suspension Reagent before adding 2.0 μL to the cell inlet.\nMix the cell suspension by pipetting up and down 15 to 20 times. Make sure to avoid the creation of bubbles.\nMake sure that you have more than 6 μL of volume in the cell inlet (during the loading step 5 μL of the cell suspension will be taken up into the IFC).\nIf you have more cells it is possible to upscale the volume, but make sure to keep the cell concentration around 420 pDCs / μL and the cell suspension to Suspension Reagent ratio constant (1 μL Suspension Reagent for 3 μL of cell suspension).\nLet the cells adjust to the Suspension Reagent for 10 min.\nVisualize the cell inlet under a microscope to make sure that you see your cells of interest in the cell inlet. The cells should be distributed throughout the different levels.\nFollowing the 10 min incubation time place the IFC into the C1 and select the STA: Cell Load program.",
    "Imaging of the cells It is helpful to use the Excel file C1 Sample Attribution from Fluidigm which gives an automatic overview of the individual capture sites in a 96-well plate Layout.\nVisualize each Capture Site under a microscope.\nIt is important that there is only one cell (without any cell debris) in the entire capture site.\nMark capture sites that are completely empty as those can be used as an additional negative control.\nIndicate for each capture site how many cells you observe and whether you can see cell debris. Only capture sites with 1 individual cell will be used going forward, but the information about all capture sites can be used to judge whether the cell concentration should be increased or decreased if the capture rate is not satisfying.\nRun Lysis, Reverse Transcription and Preamplification\nAfter visualization, add the Harvest Reagent, (adapted) Lysis Final Mix, RT Final Mix and Preamp Final Mix to the IFC according to p. 24.\nCritical: Make sure that there are no bubbles in any of the liquids. If you can see bubbles make sure to destroy them, e.g., with a pipette tip.\nPlace the IFC into the C1 and start the Preamp program. The program takes 5–6 h (depending on the IFC).\nPause point: The harvest can be scheduled for up to roughly 21 h - 22 h after the start of the program.\nNegative and positive Control\nUse 1 μL of cells that were sorted into a PCR tube for the positive control.\nUse 1 μL of Cell Wash Buffer for the negative control.\nFollow the steps outlined on p. 32–34 in the protocol.\nHarvest of amplified products\nEject the C1 IFC from the C1 and transfer it into a post PCR environment.",
    "Aliquot 25 μL of C1 DNA Dilution Reagent into each well of a 96 well plate by adding first 190 μL and then 120 μL of C1 DNA Dilution Reagent in an 8er PCR stripe and transferring 25 μL with a 8-channel pipette.\nHarvest the amplicons according to p. 26–30 of the C1 Protocol.\nWhen harvesting the amplicons set the 8-channel pipette to 3.6 μL.\nSeal the plate with a qPCR foil.\nAfter the harvest vortex the plate thoroughly and then spin it down (1000 g / 1 min).\nStore the harvested amplicons (“diluted harvest plate”) at −20°C.\nPause point: After freezing of the amplified cDNAs, the analysis of the cDNA can be done at a later time. It is recommended to pool the different cDNAs; see next step 9. Pooling of cDNA.\nPooling of cDNA\nWhen investigating multiple donors or conditions it is recommended to transfer the harvested amplicons of the different donors / conditions equally over multiple 96 well plates in order to reduce a possible batch effect of the gene expression analysis. While pooling of the cDNA only include wells from capture sites that included one single cell. This reduces the amount of gene expression and SNP Typing IFCs that will need to be run. Include one water control on every plate. Include your positive and negative control for every C1 run. It is possible to include empty capture sites in addition to the negative control as it is possible that a contamination occurred during processing of the tube control (refer to Problem 5).",
    "Critical: When investigating the escape from XCI of a new gene, always perform the SNP typing of the mRNA with a female that is homozygous for the respective SNP or with a male individual (for genes lying outside of the pseudoautosomal region of the X chromosome) to verify specificity of the mRNA SNP typing. For the SNP typing run of the mRNA it is recommended to include gDNAs with a known genotype (without STA performed).\nGene expression of pre-amplified samples with the 96.96 IFC using Delta Gene Assays\nTiming: 5–6 h\nTiming: 1 h (once everything is thawn) for step 10\nTiming: 1 h (once everything is thawn) for step 11\nTiming: 10 min + the protocol “Prime 96.96 GE” takes roughly 21 min for step 12\nTiming: 20–30 min for step 13\nTiming: 20–30 min for step 14\nTiming: The protocol “Load Mix 96.96 GE” takes roughly 92 min for step 15\nTiming: 10 min + this program runs for roughly 75 min for step 16\nThere are different formats for the gene expression analysis. We used the 96.96 IFC for gene expression (analyzing the expression of 96 mRNAs in 96 individual cells). For the gene expression analysis only the Delta Gene primers are employed (see Figure 1[href=https://www.wicell.org#fig1]B).\nThe following steps were adapted from the Quick Reference Guide Gene Expression with the 96.96 IFC Using Delta Gene Assays on Preamplified Samples (PN 100–9792 B1):\nhttps://www.fluidigm.com/binaries/content/documents/fluidigm/resources/96.96-ge-delta-gene-qr-100-9792/96.96-ge-delta-gene-qr-100-9792/fluidigm%3Afile[href=https://www.fluidigm.com/binaries/content/documents/fluidigm/resources/96.96-ge-delta-gene-qr-100-9792/96.96-ge-delta-gene-qr-100-9792/fluidigm%3Afile]\nAlso refer to the Biomark HD Data Collection user guide (100–2451 Rev 14):\nhttps://www.fluidigm.com/binaries/content/documents/fluidigm/resources/biomark-hd-data-collection-ug-100-2451/biomark-hd-data-collection-ug-100-2451/fluidigm%3Afile[href=https://www.fluidigm.com/binaries/content/documents/fluidigm/resources/biomark-hd-data-collection-ug-100-2451/biomark-hd-data-collection-ug-100-2451/fluidigm%3Afile]\nThe steps are written for the Instruments Juno and Biomark HD. When using different instruments, please refer to the guides listed above.",
    "Fluidigm reagents should be thawed to 20°C–24°C, vortexed thoroughly and spun down prior to sample and assay mix preparation. Thaw and store the primer plates on ice and in the dark. Thoroughly vortex the primer plates and spin them down (1000 g / 1 min), prior to use. Frozen, non-Fluidigm reagents should be thawed and stored on ice, vortexed thoroughly and spun down prior to sample and assay mix preparation. Keep non-Fluidigm reagents and mixes containing non-Fluidigm reagents dark and on ice. The Fluidigm reagents used in this section are from the GE 96.96 Dynamic Array™ DNA Binding Dye Sample & Assay Loading Reagent Kit with Control Line Fluid (Fluidigm, Cat#: 100–3415).\nAlways include a water sample.\nCritical: Vortex thoroughly and centrifuge all assay and sample solutions before pipetting into IFC inlets. Avoid bubbles.\nNote: Do not refreeze the Sso Fast EvaGreen Supermix. It is possible to use it for up to 6 month, when it is stored at 2°C–4°C and in the dark (thus it is also possible to thaw the Sso Fast EvaGreen Supermix the day before at 2°C–4°C).\nPreparation of the Assay (Primer) plate (on a 96 well plate)\nNote: If multiple Gene expression runs are planned prepare an Assay plate that can be used for multiple runs. This saves time and reduces potential variability between the runs.\nThe Assay plate consists of the Delta Gene primers, the 2× Assay Loading Reagent and the DNA Suspension Buffer (Teknova, Cat#: T0221).\nNote: The Assay plate can be used for up to three weeks at −20°C or 10 thaw-freeze cycles.\nTake 2× Assay Loading Reagent and DNA Suspension Buffer and vortex both thoroughly and spin them down.",
    "In a new tube combine for the Assay Mix of one plate (we increased the volume of one plate (×1,5), to increase the volume of primer that needs to be transferred from 0.3 μL to 0.45 μL):\ntable:files/protocols_protocol_835_3.csv\nOr for multiple plates (the numbers are for 2 plates – scale up accordingly):\ntable:files/protocols_protocol_835_4.csv\nVortex the Assay Mix and spin it down and then pipette 106 μL (2× 53 μL – use the 100 μL pipette) from the Assay Mix into each tube of an 8 PCR Stripe.\nTake a new 96 Well PCR Plate (Assay Plate) and aliquot 8.55 μL of the Assay Mix from the 8 PCR Stripe into each well of the Assay Plate by using the 8-channel pipette.\nMake sure to stop at the first stop of the pipette and thus avoid the creation of bubbles.\nTransfer 0.45 μL (0.6 μL for two plates – scale up accordingly) from the Primer Plate to the Assay Plate. Make sure to keep the layout of the Primer Plate.\nSeal the plate with a qPCR foil.\nVortex the plate thoroughly (make sure to vortex the entire plate) and spin it down (1000 g, 1 min).\nStore the plate on ice and in the dark.\nPause point: As the Assay plate can be used for up to 3 weeks when stored at −20°C, the Assay plate can be prepared in advance.\nPreparation of the Sample (cDNA) plate (on a 96 Well PCR Plate)\nNote: Always prepare the Sample plate fresh.\nTake SsoFast EvaGreen (very light sensitive + tends to foam a lot) and 20× DNA Binding Dye Sample Loading Reagent and vortex both thoroughly for 20 s.\nIn a new tube combine for the Sample Mix:\ntable:files/protocols_protocol_835_5.csv\nVortex the pipetted Sample Mix and centrifuge.",
    "Pipette 45 μL from the Sample Mix into each tube of a 8 PCR Stripe.\nTake a new 96 Well PCR Plate and aliquot 3.3 μL of the Sample Mix from the 8 PCR Stripe into each well of a 96 Well PCR Plate (Sample Plate) by using the 8-channel pipette.\nTransfer 2.7 μL of cDNA from the pooled cDNA plate (see Pooling of cDNA) or from the diluted harvest plate 96 Well PCR Plate (see Harvest of amplified products) to the Sample Mix. Make sure to keep the layout of the pooled cDNA.\nSeal the Sample Plate with a qPCR foil.\nVortex the plate thoroughly (make sure to vortex the entire plate) and spin it down (1000 g, 1 min).\nStore it on ice and in the dark.\nPrime the 96.96 GE IFC The following steps were adapted from Control Line Fluid Loading Procedure (PN 68000132 r07): https://www.fluidigm.com/binaries/content/documents/fluidigm/resources/control-line-fluid-loading-procedure-68000132-qr/control-line-fluid-loading-procedure-68000132-qr/fluidigm%3Afile[href=https://www.fluidigm.com/binaries/content/documents/fluidigm/resources/control-line-fluid-loading-procedure-68000132-qr/control-line-fluid-loading-procedure-68000132-qr/fluidigm%3Afile]\nCritical: The control line fluid inhibits the read-out of the data, so make sure, that it does not drop on the IFC. If the control line fluid was spilled on the IFC, try to carefully remove it by using 70% Ethanol.\nCritical: Wear safety goggles while applying the control line fluid.\nBefore opening the 96.96 IFC, evacuate carefully the air out of the syringe.\nOpen the package of the 96.96 IFC.\nUsing a 100 μL pipette tip make sure that both valves open easily.\nTake the 96.96 IFC, put it into a horizontal orientation and tilt it 45°.\nStart with the valve that is now situated on the bottom of the plate.\nUsing the syringe to press down the valve.\nVisually confirm that the valve is open.\nInject the control line fluid into the IFC by slowly pushing down the plunger of the syringe.",
    "After completely emptying the syringe, wait a few seconds before removing the syringe.\nIt is normal that there is some liquid remaining in the syringe.\nVerify that the O-ring returns to its normal position after syringe removal.\nMake sure that no liquid was spilled.\nTurn the plate 180°.\nFill up the other valve according to steps f) – l).\nPut the IFC into the Juno and run the following script: Prime 96.96 GE.\nYou have now 1 h time to pipette Assays and Samples on the 96.96 IFC and start the load protocol on the Juno.\nTransferring the Assays (primers) on the 96.96 IFC\nCritical: Vortex the Assay Plate thoroughly and spin down (1 min / 1000 g) before loading them on the 96.96 IFC.\nAlways halt at the first stop of the pipette when pipetting. Try to avoid bubbles.\nPipette 5 μL with an 8-channel pipette from each assay from the Assay Plate on the 96.96 IFC.\nPipette the Assays on the left side of the IFC (see Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/835-Fig3.jpg\nFigure 3. Pipetting scheme for transferring the assays / primers on a 96.96 gene expression IFC\nThe Figure was recreated based on figures and information from the Quick Reference Guide Gene Expression with the 96.96 IFC Using Delta Gene Assays on Preamplified Samples (PN 100-9792 B1): https://www.fluidigm.com/binaries/content/documents/fluidigm/resources/96.96-ge-delta-gene-qr-100-9792/96.96-ge-delta-gene-qr-100-9792/fluidigm%3Afile[href=https://www.fluidigm.com/binaries/content/documents/fluidigm/resources/96.96-ge-delta-gene-qr-100-9792/96.96-ge-delta-gene-qr-100-9792/fluidigm%3Afile] and the protocol Using C1 to Capture Cells from Cell Culture and Perform Preamplification Using Delta Gene Assays (PN 100-4904 L1): https://www.fluidigm.com/binaries/content/documents/fluidigm/resources/c1-delta%E2%80%90gene-pr-100%E2%80%904904/c1-delta%E2%80%90gene-pr-100%E2%80%904904/fluidigm%3Afile[href=https://www.fluidigm.com/binaries/content/documents/fluidigm/resources/c1-delta%E2%80%90gene-pr-100%E2%80%904904/c1-delta%E2%80%90gene-pr-100%E2%80%904904/fluidigm%3Afile]\nDo not leave any wells empty.\nTo every unused assay inlet, add either 3.0 μL assay loading reagent and 3.0 μL DNA-free water or 5.7 μL Assay Mix and 0.3 μL of DNA-free water.",
    "Critical: After pipetting of the Assays on the 96.96 IFC, check for bubbles and destroy all of them using a pipette tip or hollow needle / cannula. Use a fresh pipette tip / cannula for every well.\nTransferring the samples (cDNA) on the 96.96 IFC\nCritical: Reduce light exposure when pipetting the samples, since EvaGreen is light sensitive.\nNote: The samples are more prone to produce bubbles, be extra careful when pipetting.\nCritical: Vortex the Sample plate thoroughly and spin down (1 min / 1000 g) before loading them on the 96.96 IFC.\nAlways halt at the first stop of the pipette when pipetting. Try to avoid bubbles.\nPipette 5 μL with an 8-channel pipette from each sample from the Sample plate to the 96.96 IFC.\nPipette the samples on the right side of the IFC (see Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/835-Fig4.jpg\nFigure 4. Pipetting scheme for transferring the samples / cDNA to a 96.96 gene expression IFC\nThe Figure was recreated based on figures and information from the Quick Reference Guide Gene Expression with the 96.96 IFC Using Delta Gene Assays on Preamplified Samples (PN 100-9792 B1): https://www.fluidigm.com/binaries/content/documents/fluidigm/resources/96.96-ge-delta-gene-qr-100-9792/96.96-ge-delta-gene-qr-100-9792/fluidigm%3Afile[href=https://www.fluidigm.com/binaries/content/documents/fluidigm/resources/96.96-ge-delta-gene-qr-100-9792/96.96-ge-delta-gene-qr-100-9792/fluidigm%3Afile] and the protocol Using C1 to Capture Cells from Cell Culture and Perform Preamplification Using Delta Gene Assays (PN 100-4904 L1): https://www.fluidigm.com/binaries/content/documents/fluidigm/resources/c1-delta%E2%80%90gene-pr-100%E2%80%904904/c1-delta%E2%80%90gene-pr-100%E2%80%904904/fluidigm%3Afile[href=https://www.fluidigm.com/binaries/content/documents/fluidigm/resources/c1-delta%E2%80%90gene-pr-100%E2%80%904904/c1-delta%E2%80%90gene-pr-100%E2%80%904904/fluidigm%3Afile]\nTo every unused sample inlet, add 3.3 μL of sample mix and 2.7 μL of DNA-free water.\nCritical: After pipetting of the samples on the 96.96 IFC, check for bubbles and destroy all of them using a pipette tip or hollow needle / cannula. Use a fresh pipette tip / cannula for every well.\nLoad Mix of the 96.96 GE IFC\nNote: Start the IFC run within 1 h of adding the assays and samples on the IFC.",
    "Depending on the layout of the IFC (96.96 or 192.24) the Juno needs a different interface plate. Refer to p. 27ff of the Juno System user guide (PN 100–7070 r12) on how to change the interface plate:\nhttps://www.fluidigm.com/binaries/content/documents/fluidigm/resources/juno-user-guide-ug-100-7070/juno-user-guide-ug-100-7070/fluidigm%3Afile[href=https://www.fluidigm.com/binaries/content/documents/fluidigm/resources/juno-user-guide-ug-100-7070/juno-user-guide-ug-100-7070/fluidigm%3Afile]\nAfter pipetting of all the assays and samples on the IFC, place the 96.96 IFC into the Juno and run the following script: Load Mix 96.96 GE\nReal-Time PCR of the 96.96 IFC (with the Biomark HD) To switch on the Biomark first press the “on” button on the left side of the machine (for the PCR machine) and then press the green button \"Computer Power\" on the front of the Biomark (for the Computer inside of the Biomark).\nDouble-click on the icon “BioMark Data Collection” on the desktop.\nNote: The lamp needs to be at −5°C before the run can start and it will only start the cooling as soon as the program “BioMark Data Collection” is opened (the cooling takes 5–10 min). Make sure that the status indicator for “Camera Temperature” is green (at −5.0°C).\nClick “Start a New Run”.\nRemove any dust particles from the IFC surface (use clear adhesive tape for that).\nPlace the IFC in the Biomark HD (pay attention to the correct orientation, the barcode needs to face outward), and then click “Load”.\nVerify barcode and chip type, click “Next”.\nSelect “This is a new chip run” or “Use a pre-defined Chip run”.\nName the run and select a storage location.\nClick “Next”.\nChoose the application, passive reference, assay and probe:\nApplication: Gene Expression\nPassive reference: ROX\nAssay: Single probe\nProbes: EvaGreen\nClick “Next”",
    "Browse and select the following thermal protocol: Biomark HD: GE 96×96 Fast PCR+Melt v2.pcl (make sure that you are in the right folder “Protocols” > “GE”. If the protocol file is not visible, switch the settings of what files are displayed from “protocol files” to “all files”.)\nMake sure \"Auto Exposure\" is selected.\nClick “Next”.\nVerify the information, and then click “Start Run”.\nSNP typing of the mRNA with the 192.24 IFC using SNP Type Assays\nTiming: 5–6 h\nTiming: 20–30 min for step 17\nTiming: 5 min for step 18\nTiming: 20–30 min for step 19\nTiming: 40–50 min for step 20\nTiming: 10 min for step 21\nTiming: 60 min for step 22\nTiming: The protocol “Load Mix 192.24 GT” takes roughly 28 min for step 23\nTiming: 10 min + this program runs for roughly 80 min for step 24\nThere are different formats for the SNP Typing analysis. We used the 192.24 IFC for SNP Typing (analyzing 24 SNPs in 192 cDNAs). For the SNP Typing analysis the SNP Type primers (ASP1/ASP2 and LSP) are employed (see Figures 1[href=https://www.wicell.org#fig1]C and 1D).\nThe following steps were adapted from the Quick Reference Guide Genotyping with the 192.24 IFC Using SNP Type Assays (PN 100–3913 C1):\nhttps://www.fluidigm.com/binaries/content/documents/fluidigm/resources/192.24-gt-snp%E2%80%90type-qr-100%E2%80%903913/192.24-gt-snp%E2%80%90type-qr-100%E2%80%903913/fluidigm%3Afile[href=https://www.fluidigm.com/binaries/content/documents/fluidigm/resources/192.24-gt-snp%E2%80%90type-qr-100%E2%80%903913/192.24-gt-snp%E2%80%90type-qr-100%E2%80%903913/fluidigm%3Afile]\nAlso refer to the Biomark HD Data Collection user guide (100–2451 Rev 14):\nhttps://www.fluidigm.com/binaries/content/documents/fluidigm/resources/biomark-hd-data-collection-ug-100-2451/biomark-hd-data-collection-ug-100-2451/fluidigm%3Afile[href=https://www.fluidigm.com/binaries/content/documents/fluidigm/resources/biomark-hd-data-collection-ug-100-2451/biomark-hd-data-collection-ug-100-2451/fluidigm%3Afile]\nThe steps are written for the Instruments Juno and Biomark HD. When using different instruments, please refer to the guides listed above.",
    "Fluidigm reagents should be thawed to 20°C–24°C, vortexed thoroughly and spun down prior to sample and assay mix preparation. Thaw and store the primer plates on ice and in the dark. Thoroughly vortex the primer plates and spin them down (1000 g / 1 min), prior to use. Frozen, non-Fluidigm reagents should be thawed and stored on ice, vortexed thoroughly and spun down prior to sample and assay mix preparation. Keep non-Fluidigm reagents and mixes containing non-Fluidigm reagents dark and on ice. The Fluidigm reagents used in this section are from the SNP Type™ 192.24 Genotyping Reagent Kit with Control Line Fluid (Fluidigm, Cat#: 100–4136).\nAlways include a water sample.\nNote: It is helpful to include gDNA of known genotype as a control during the SNP Typing of the mRNA.\nCritical: Vortex thoroughly and centrifuge all assay and sample solutions before pipetting into IFC inlets. Avoid bubbles.\nPreparation of the SNP Type Assay Mixes\nNote: These prepared SNP Type Assay Mixes can be used for up to one year. Avoid multiple thaw-freeze cycles.\nIn a DNA-free hood, prepare the SNP Type Assay Mixes by combining in each of 24 wells of a fresh 96 well plate (after vortexing and spinning of the reagents) (column 1–3):\ntable:files/protocols_protocol_835_6.csv\nPreparation of the Assay Pre-Mix\nPrepare in a fresh tube (after vortexing and spinning of the reagents):\ntable:files/protocols_protocol_835_7.csv\nPreparation of the SNP Type Assay Plate (Primer Plate)\nNote: The SNP Type Assay Plate can be used for 3 weeks at –20°C or for up to 10 thaw-freeze cycles. So if multiple SNP type runs are planned prepare a SNP Type Assay Plate that can be used for multiple runs.",
    "Vortex the Assay Pre-Mix, spin it down and then add to each of 24 wells (column 1–3) of a new 96 well plate 3.2 μL of the Assay Pre-Mix (for 1 run - upscale as necessary).\nTransfer 0.8 μL (for 1 run – upscale as necessary) from the SNP Type Assay Mixes to the 24 wells of a 96 well plate containing already the Assay Pre-Mix with a 8-channel pipette.\nSeal the SNP Type Assay Plate with a qPCR foil.\nVortex the plate thoroughly and spin it down (1000 g, 1 min).\nStore it on ice and in the dark.\nPause point: As the SNP Type Assay plate can be used for up to 3 weeks when stored at −20°C, the SNP Type Assay plate can be prepared in advance.\nPreparation of the two Sample Plates (cDNA Plates)\nCritical: Vortex thoroughly and centrifuge all substances.\nIn a new tube combine for the Sample Mix:\ntable:files/protocols_protocol_835_8.csv\nVortex the pipetted Sample Mix and centrifuge.\nPipette 72 μL from the Sample Mix into each tube of a 8 PCR Stripe.\nTake two new 96 Well PCR Plates and aliquot 2.6 μL of the Sample Mix from the 8 PCR Stripe into each well of two 96 Well PCR Plate (Sample Plate) by using a 8-channel pipette.\nTransfer 1.9 μL of cDNA from two plates with pooled cDNA to the Sample Mix. Make sure to keep the layout of the original plates.\nSeal the Sample Plates with a qPCR foil.\nVortex the plates thoroughly (make sure to vortex the entire plate) and spin them down (1000 g, 1 min).\nStore them on ice and in the dark.\nPrepare the 192.24 IFC The following steps were adapted from Control Line Fluid Loading Procedure (PN 68000132 r07): https://www.fluidigm.com/binaries/content/documents/fluidigm/resources/control-line-fluid-loading-procedure-68000132-qr/control-line-fluid-loading-procedure-68000132-qr/fluidigm%3Afile[href=https://www.fluidigm.com/binaries/content/documents/fluidigm/resources/control-line-fluid-loading-procedure-68000132-qr/control-line-fluid-loading-procedure-68000132-qr/fluidigm%3Afile]",
    "Critical: The control line fluid inhibits the read-out of the data, so make sure, that it does not drop on the IFC. If the control line fluid was spilled on the IFC, try to carefully remove it using 70% Ethanol.\nCritical: Wear safety goggles while applying the control line fluid.\nBefore opening the 192.24 IFC, evacuate carefully the air out of the syringe.\nOpen the package of the 192.24 IFC.\nUsing a 100 μL pipette tip make sure that the top valve (when the bar code of the IFC is on the left, see Figure 5[href=https://www.wicell.org#fig5]) (Accumulator 2) opens easily.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/835-Fig5.jpg\nFigure 5. Layout of the 192.24 SNP Typing IFC, highlighting the position of the Accumulator 2\nThe Figure was recreated based on information and figures from the Quick Reference Guide Genotyping with the 192.24 IFC Using SNP Type Assays (PN 100-3913 C1): https://www.fluidigm.com/binaries/content/documents/fluidigm/resources/192.24-gt-snp%E2%80%90type-qr-100%E2%80%903913/192.24-gt-snp%E2%80%90type-qr-100%E2%80%903913/fluidigm%3Afile[href=https://www.fluidigm.com/binaries/content/documents/fluidigm/resources/192.24-gt-snp%E2%80%90type-qr-100%E2%80%903913/192.24-gt-snp%E2%80%90type-qr-100%E2%80%903913/fluidigm%3Afile]\nTake the 192.24 IFC, put it into a horizontal orientation and tilt it 45°.\nUsing the syringe press down the valve of Accumulator 2.\nVisually confirm that the valve is open.\nInject the control line fluid into the IFC by slowly pushing down the plunger of the syringe.\nAfter completely emptying the syringe, wait a few seconds before removing the syringe.\nIt is normal that there is some liquid remaining in the syringe.\nVerify that the O-ring returns to its normal position after syringe removal.\nMake sure that no liquid was spilled.\nLoading the 192.24 IFC After the addition of the control line fluid, pipette the assays and the samples on the 192.24 IFC.\nCritical: Vortex the SNP Type Assay Plate and the Sample Plates thoroughly and spin down before loading them on the 192.24 IFC.",
    "Critical: Always halt at the first stop of the pipette when pipetting. Try to avoid bubbles for every liquid that you add to the IFCs. Use a hollow needle (cannula - e.g. 0.8 mm diameter) to destroy bigger bubbles.\nDo not leave any inlets empty.\nVortex the Sample Plate thoroughly and spin down (1 min / 1000 g) before loading them on the 192.24 IFC.\nPipette 3 μL with an 8-channel pipette of each sample from the two Sample Plates on the 192.24 IFC (see Figures 6[href=https://www.wicell.org#fig6] and 7[href=https://www.wicell.org#fig7]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/835-Fig6.jpg\nFigure 6. Pipetting Scheme for transferring Sample Plate 1 to the 192.24 SNP Typing IFC\nThe Figure was recreated based on information and figures from the Quick Reference Guide Genotyping with the 192.24 IFC Using SNP Type Assays (PN 100-3913 C1): https://www.fluidigm.com/binaries/content/documents/fluidigm/resources/192.24-gt-snp%E2%80%90type-qr-100%E2%80%903913/192.24-gt-snp%E2%80%90type-qr-100%E2%80%903913/fluidigm%3Afile[href=https://www.fluidigm.com/binaries/content/documents/fluidigm/resources/192.24-gt-snp%E2%80%90type-qr-100%E2%80%903913/192.24-gt-snp%E2%80%90type-qr-100%E2%80%903913/fluidigm%3Afile] and the protocol Using C1 to Capture Cells from Cell Culture and Perform Preamplification Using Delta Gene Assays (PN 100-4904 L1): https://www.fluidigm.com/binaries/content/documents/fluidigm/resources/c1-delta%E2%80%90gene-pr-100%E2%80%904904/c1-delta%E2%80%90gene-pr-100%E2%80%904904/fluidigm%3Afile[href=https://www.fluidigm.com/binaries/content/documents/fluidigm/resources/c1-delta%E2%80%90gene-pr-100%E2%80%904904/c1-delta%E2%80%90gene-pr-100%E2%80%904904/fluidigm%3Afile]\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/835-Fig7.jpg\nFigure 7. Pipetting Scheme for transferring Sample Plate 2 to the 192.24 SNP Typing IFC\nThe Figure was recreated based on information and figures from the Quick Reference Guide Genotyping with the 192.24 IFC Using SNP Type Assays (PN 100-3913 C1): https://www.fluidigm.com/binaries/content/documents/fluidigm/resources/192.24-gt-snp%E2%80%90type-qr-100%E2%80%903913/192.24-gt-snp%E2%80%90type-qr-100%E2%80%903913/fluidigm%3Afile[href=https://www.fluidigm.com/binaries/content/documents/fluidigm/resources/192.24-gt-snp%E2%80%90type-qr-100%E2%80%903913/192.24-gt-snp%E2%80%90type-qr-100%E2%80%903913/fluidigm%3Afile] and the protocol Using C1 to Capture Cells from Cell Culture and Perform Preamplification Using Delta Gene Assays (PN 100-4904 L1): https://www.fluidigm.com/binaries/content/documents/fluidigm/resources/c1-delta%E2%80%90gene-pr-100%E2%80%904904/c1-delta%E2%80%90gene-pr-100%E2%80%904904/fluidigm%3Afile[href=https://www.fluidigm.com/binaries/content/documents/fluidigm/resources/c1-delta%E2%80%90gene-pr-100%E2%80%904904/c1-delta%E2%80%90gene-pr-100%E2%80%904904/fluidigm%3Afile]\nVortex the assay plate thoroughly and spin down (1 min / 1000 g), before pipetting 3 μL with an 8-channel pipette from each assay from the SNP Type Assay Plate on the 192.24 IFC (see Figure 8[href=https://www.wicell.org#fig8] for the IFC Pipetting Map).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/835-Fig8.jpg\nFigure 8. Pipetting Scheme for adding the assays and the pressure fluid to the 192.24 SNP Typing IFC",
    "The Figure was recreated based on information and figures from the Quick Reference Guide Genotyping with the 192.24 IFC Using SNP Type Assays (PN 100-3913 C1): https://www.fluidigm.com/binaries/content/documents/fluidigm/resources/192.24-gt-snp%E2%80%90type-qr-100%E2%80%903913/192.24-gt-snp%E2%80%90type-qr-100%E2%80%903913/fluidigm%3Afile[href=https://www.fluidigm.com/binaries/content/documents/fluidigm/resources/192.24-gt-snp%E2%80%90type-qr-100%E2%80%903913/192.24-gt-snp%E2%80%90type-qr-100%E2%80%903913/fluidigm%3Afile]\nPipette 150 μL of pressure fluid into the inlets P1, P2 and P3 (see Figure 8[href=https://www.wicell.org#fig8]).\nPipette 20 μL of pressure fluid into the inlets P4 and P5 (see Figure 8[href=https://www.wicell.org#fig8]).\nDo not leave any wells empty.\nTo every unused assay inlet, add 3.2 μL Assay Pre-Mix and 0.8 μL DNA-free water.\nTo every unused sample inlet, add 2.6 μL of Sample Mix and 1.9 μL of DNA-free water.\nCheck for bubbles and destroy them using a pipette tip or hollow needle / cannula.\nUse a fresh pipette tip / cannula for every well.\nLoad Mix of the 192.24 IFC\nNote: Start the IFC run within 1 h of adding the assays and samples on the IFC.\nDepending on the layout of the IFC (96.96 or 192.24) the Juno needs a different interface plate. Refer to p. 27ff of the Juno System user guide (PN 100–7070 r12) on how to change the interface plate:\nhttps://www.fluidigm.com/binaries/content/documents/fluidigm/resources/juno-user-guide-ug-100-7070/juno-user-guide-ug-100-7070/fluidigm%3Afile[href=https://www.fluidigm.com/binaries/content/documents/fluidigm/resources/juno-user-guide-ug-100-7070/juno-user-guide-ug-100-7070/fluidigm%3Afile]\nAfter pipetting of all the samples, assays and pressure fluid, place the 192.24 IFC into the Juno and run the following script: Load Mix 192.24 GT.\nThermal-Cycling of the 192.24 IFC (with the Biomark HD) To switch on the Biomark first press the “on” button on the left side of the machine (for the PCR machine) and then press the green button \"Computer Power\" on the front of the Biomark (for the Computer inside of the Biomark).\nDouble-click on the icon “BioMark Data Collection” on the desktop.",
    "Note: The lamp needs to be at −5°C before the run can start and it will only start the cooling as soon as the program “BioMark Data Collection” is opened (the cooling takes 5–10 min). Make sure that status indicator for “Camera Temperature” is green (at −5.0°C).\nClick “Start a New Run”.\nRemove any dust particles or debris from the IFC surface (use clear adhesive tape for that).\nPlace the IFC in the Biomark HD (pay attention to the correct orientation, the barcode needs to face outward), and then click “Load”.\nVerify barcode and chip type, click “Next”.\nSelect “This is a new chip run” or “Use a pre-defined Chip run”.\nName the run and select a storage location.\nClick “Next”.\nChoose the application, passive reference, and probes:\nApplication: Genotyping\nPassive reference: ROX\nSelect probes manually: Probe 1: SNPtype-FAM Probe 2: SNPtype-HEX\nClick “Next”.\nBrowse and select the following thermal protocol: SNPtype 192.24 v1 (make sure that you are in the right folder “Protocols” > “GT”. If the protocol file is not visible, switch the settings of what files are displayed from “protocol files” to “all files”.)\nMake sure \"Auto Exposure\" is selected.\nClick “Next”.\nVerify the information, and then click “Start Run”.\nQuantification and data processing\nGraphs were generated with GraphPad Prism 9 and schemes were created with PowerPoint 2016. Statistical analysis was done with GraphPad Prism 9. Mann-Whitney test was used for comparison between two unpaired groups.\nThe gene expression data can be analyzed with the Fluidigm Real-Time PCR Analysis software and the SNP Typing data can be analyzed with the Fluidigm SNP Genotyping Analysis software. The softwares can be downloaded here: https://www.fluidigm.com/software[href=https://www.fluidigm.com/software].",
    "For a step-by-step description of how to analyze the gene expression data with the Fluidigm Real-Time PCR Analysis software refer to p. 19ff of the Real-Time PCR Analysis user guide (PN 68000088 Rev 16):\nhttps://www.fluidigm.com/binaries/content/documents/fluidigm/resources/real-time-pcr-analysis-ug-68000088/real-time-pcr-analysis-ug-68000088/fluidigm%3Afile[href=https://www.fluidigm.com/binaries/content/documents/fluidigm/resources/real-time-pcr-analysis-ug-68000088/real-time-pcr-analysis-ug-68000088/fluidigm%3Afile]\nFor a step-by-step description of how to analyze SNP Typing data with the SNP Genotyping Analysis Software refer to p. 29ff of the SNP Genotyping user guide (PN 68000098 Rev.18):\nhttps://www.fluidigm.com/binaries/content/documents/fluidigm/resources/snp-gt-analysis-ug-68000098/snp-gt-analysis-ug-68000098/fluidigm%3Afile[href=https://www.fluidigm.com/binaries/content/documents/fluidigm/resources/snp-gt-analysis-ug-68000098/snp-gt-analysis-ug-68000098/fluidigm%3Afile]\nCapture sites not containing a single, individual cell have already been excluded from further analysis by pooling of the cDNA, if not, exclude them now. As an additional control step the expression of reference genes were employed to verify that a normal, live cell was processed. Next to reference genes that are generally employed in quantitative PCR (Vandesompele et al., 2002[href=https://www.wicell.org#bib14]), it is also possible to employ genes that have a high expression in the target cells. E.g. in pDCs single cell expression of HLA-DR would be a possible target gene. Individual cells without detectable mRNA expression in two out of three reference or target genes (B2M, RPL13A, GAPDH) were excluded from further analysis.",
    "In most qPCR samples the results are normalized to one or more reference genes to control for variations on factors such as extraction or reverse-transcription yield (Bustin et al., 2009[href=https://www.wicell.org#bib2]). However, in a standardized setting working with single cells, normalization is not necessary which has been discussed previously (McDavid et al., 2013[href=https://www.wicell.org#bib11]; Arsenio et al., 2014[href=https://www.wicell.org#bib1]). The Real-Time PCR Analysis software assigns the value of 999 to reactions without detectable mRNA. As suggested by Litvak et al. a limit of detection (LOD) of a ct value of 24 was assigned to every ct value exceeding 24 and the mRNA expression is defined as 2(LOD-ct) (Livak et al., 2013[href=https://www.wicell.org#bib10]). Hence an expression value of 1 specifies a cell without detectable mRNA expression in the analyzed gene. This way of analyzing the data has recently been published (Hipp et al., 2017[href=https://www.wicell.org#bib8]; Hess et al., 2020[href=https://www.wicell.org#bib7]).\nTo control the gene expression data in the Fluidigm Real-Time PCR Analysis Software the Melting Curve peaks are analyzed. A range of +/- 1.2°C was allowed to take into account amplification of the regions containing either the minor or the major allele. When analyzing regions not containing different alleles it is possible to adapt the temperature range. The median of the temperature peak was determined from all non-failed reactions of one gene. The other settings for melting curve analysis (Peak Sensitivity: 7; Peak Ratio Threshold: 0.8) were left unchanged in the Fluidigm Real-Time PCR Analysis Software. For all reactions that were flagged as failed under these settings the ct value was assigned to the LOD.",
    "For the SNP Typing of the mRNA, sometimes individual cells are located in between the clear clusters. Here it is possible to rerun the SNP Typing of the mRNA or to assign them as “no detectable mRNA”. If there are no clear clusters of the populations, refer to Problem 4 below. ASP1 and ASP2 are the primers that differentiate between the minor and the major allele. In the factory setting the results for ASP1 are displayed on the x axis, whereas the results for ASP2 will be shown on the y axis. Which primer represents which nucleotide can be found in the design file that is supplied by Fluidigm."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Gene Expression",
    "Immunology",
    "Flow Cytometry"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}