{
  "id": 7055,
  "origin_website": "Bio",
  "title": "A Quantitative Assay to Measure Stress Granule Association of Proteins and Peptides in Semi-permeabilized Human Cells",
  "procedures": [
    "Prepare recombinant protein of choice by established purification protocols from bacteria (or equivalent expression system)For subsequent detection, the protein should either be fused to a fluorescent protein (e.g., EGFP) or another tag suitable for subsequent immunostaining. We have had good experience using a MBP-tag, as it also serves as a solubility tag for aggregation prone proteins and does not interfere with SG recruitment. Alternatively, proteins can also be labeled using commercially available labeling kits. Peptides can already be purchased fluorescently labeled.Notes:  The recombinant protein should be highly pure, i.e., free of RNA (A260/280 ratio ~0.6-0.7) and of contaminating proteins and/or degradation products. Endotoxin removal is not necessary.  In order to avoid major changes to the buffer composition of the assay, one needs to consider that depending on the storage buffer and concentration of the protein/ peptide stock, additional salt can be introduced into the reaction. If possible, dialyze the recombinant protein(s) into the assay buffer. Alternatively, preparing a highly concentrated stock (e.g., ≥ 100x) of protein/peptide can help to prevent unphysiological salt concentrations in the final assay. Presence of high concentrations of detergent might interfere with cellular physiology and integrity of the nuclear membrane. The storage buffer should therefore not contain any detergents to improve protein/ peptide solubility. Protein stabilizing agents in the protein storage buffer, such as glycerol or sucrose, have not interfered with the assay in our hands, provided the protein stock is sufficiently highly concentrated (see point 2 above). Coat coverslips with poly-L-lysine (optional; 30-60 min)Note: This step can be omitted if working with well adherent cell lines, such as HeLa cells. However, it can improve cell retention on coverslips and hence increase cell numbers for subsequent analysis. Work under sterile conditions in cell culture hood.",
    "Spread out coverslips either directly in appropriate cell culture dish (if subsequently used directly) or on parafilm in cell culture dish (if prepared in advance). If coverslips are not considered to be sterile, dip them once into 70% ethanol or absolute isopropanol before spreading them (on parafilm) in cell culture dish. Wait for EtOH/isopropanol to evaporate before proceeding.Cover each coverslip with 0.1% poly-L-lysine solution using P1000 pipette and incubate for 20-30 min at room temperature.Collect poly-L-Lysine solution using P1000 pipette (solution can be re-used up to 4 times) or aspirate using vacuum pump.Wash coverslips once by covering them with sterile MilliQ water.Aspirate water and let coverslips dry. Coverslips can be stored in a dry and dark place up to 2 weeks. Alternatively, rinse coverslips once with 3 ml medium (in 6 cm dish) if cells are to be seeded directly (Procedure C).Seed cells onto coverslips (15-20 min)Estimate confluency of HeLa cell culture.Aspirate medium and gently wash cells once with sterile PBS. Aspirate PBS and dissociate cells off the dish using pre-warmed 1x trypsin and 2-5 min incubation at 37 °C. Resuspend cells thoroughly in appropriate medium (e.g., DMEM supplemented with 10% FBS and 10 µg/ml gentamicin) to inhibit trypsin activity and to achieve single cells in suspension.Note: In order to ensure optimal and equal permeabilization of all cells, it is important to avoid cell clusters that would interfere with efficient permeabilization by digitonin. Also, cell density should be kept similar between individual replicates to minimize variability in cell permeabilization. Calculate cell concentration following standard procedures (e.g., hemocytometer) or based on cell confluency. Seed cells onto (poly-L-lysine coated) coverslips so they reach ~60% confluency at the time of the assay (e.g., HeLa cells double every 20-23 h, so seed them at ~30% confluency).",
    "Ensure that coverslips do not float on top of the medium.Let cells adhere onto coverslips (overnight [12-20 h]).Stress granule (SG) association assay (~1.5 h)Incubate cells with 10 µM MG-132 for 2-3 h at 37 °C and 5% CO2 to induce SGs.Cool humidified chamber on ice.Place coverslips with cells facing upwards well separated into the humidified chamber (e.g., draw a grid onto the parafilm to keep individual reactions in order).Aspirate left over medium off the coverslips and wash cells once in 50-100 µl reaction buffer. Notes: To cover a 12 mm coverslip completely, 40-50 µl solution are usually sufficient. For the washing steps this however should be increased to at least 100 µl per coverslip.  Choice of the reaction buffer depends largely on the nature of the protein or peptide used. We have made good experience with physiological buffers, such as transport buffer (TPB) or potassium phosphate buffer (KPB) that are also commonly used in nuclear import assays using semi-permeabilized cells (Adam et al., 1990; Arnold, 2006). Choose the buffer that results in the best signal-to-noise ratio, as judged by enrichment of your protein-of-interest in SGs compared to the surrounding cytoplasm.  Selectively permeabilize the plasma membrane of cells for 4-5 min on ice using 0.004-0.01% digitonin diluted in your reaction buffer. For this step, place a drop of the digitonin solution (50 µl per 12 mm coverslip) onto the coverslip. Renewing the digitonin solution after 2 min can improve permeabilization.Note: The exact incubation time and final digitonin concentration largely depends on the digitonin batch, cell type and cell density and needs to be experimentally determined by trypan-blue staining. Insufficient permeabilization will interfere with protein access to SGs.",
    "Overpermeabilization can result in a leaky nuclear membrane and, particularly for RBPs, enrichment of proteins in nuclei, which correlates to an underrepresenation of the protein in the cytoplasm (see Notes 1-3 below). Aspirate the digitonin solution, wash coverslips once briefly and then 4x for 4-5 min on ice in your reaction buffer.Block nuclear pores by applying 40 µl of 0.2 mg/ml wheat germ agglutinin (WGA) diluted in your reaction buffer onto coverslips. Incubate on ice for 15 min.Aspirate the WGA solution and replace with your protein(s) in reaction buffer (40 µl final volume/12 mm coverslip). For subsequent detection of recombinant proteins in SGs, ~100-200 nM final protein concentration in our hands is usually sufficient, but this might need to be optimized on an individual basis. In contrast to recombinant proteins, peptides can require higher concentrations, likely due to smaller molecular size and lack of signal amplification by a direct fluorescent label. If the influence of a second protein (such as a protein suspected to act as a molecular chaperone) on SG association is to be tested, a titration of the second protein with the first one held at a constant concentration is recommended.Note: Include a “buffer only” control to determine bleed-through from the antibody staining for the SG marker (G3BP1) and/or unspecific binding of the antibody used to detect binding of the recombinant protein to SGs. Incubate reactions for 30 min at room temperature by placing the humidified chamber from the ice onto the bench. Avoid evaporation, as this would result in changes in protein/peptide concentration, and/or drying out of coverslips.Place humified chamber back on ice and aspirate reaction mix. Wash cells 3 x for 5 min (100 µl final volume/12 mm coverslip) each with reaction buffer (continue immediately with Procedure E).",
    "Immunostaining of SGs (and recombinant protein) (~3 h or overnight)Fix cells with 3.7% formaldehyde/PBS solution (50 µl final volume/12 mm coverslip) for 7-10 min at room temperature.Note: Formaldehyde is toxic and should be handled and disposed of with necessary caution. Wash cells 2 x in PBS (100 µl final volume/12 mm coverslip). (Possible break point; cells can be stored in PBS overnight and immunostaining continued on the following day, although we prefer to perform the primary antibody incubation step overnight, if the protocol cannot be completed on the same day.)Permeabilize cells using 0.5% TX-100/PBS (50 µl final volume/12 mm coverslip) for 5 min at room temperature. This step ensures access of antibodies and efficient SG staining.Wash cells 2 x in PBS (100 µl final volume/12 mm coverslip).Block unspecific binding sites using 1% donkey serum (50 µl final volume/12 mm coverslip) in PBS/0.1% Tween-20 (or alternative blocking buffer, such as 5% BSA or similar) for 10 min at room temperature.Stain for SGs using G3BP1 antibody (1:1,000 in blocking buffer) and, if required, recombinant protein (e.g., using anti-MBP antibody; 1:1,000 in blocking buffer) for 1-2 h at RT or overnight at 4 °C (50 µl final volume antibody dilution/12 mm coverslip).Wash coverslips 3 x 5 min each in PBS/ 0.1% Tween-20 (100 µl final volume/12 mm coverslip).Incubate with secondary antibodies for 30-60 min at room temperature (diluted 1:1,000 in blocking buffer; 100 µl final volume/12 mm coverslip). If bleed-through is a concern, use spectrally well separated dyes (e.g., Alexa 488 and Alexa 647). Staining for SGs in the visible range, however, allows for easier judgement of permeabilization efficiency (see Notes below).Wash 3x 5 min in PBS/0.1% Tween-20 (100 µl final volume/12 mm coverslip).Stain nuclei using 0.",
    "5 µg/ml DAPI freshly diluted in PBS for 5 min at room temperature (50 µl final volume/12 mm coverslip).Wash cells twice in PBS (100 µl final volume/12 mm coverslip).Place a drop (5-10 µl/coverslip) of ProLong Diamond mounting medium onto microscopy slide, avoid air bubbles.Use fine tip curved tweezers to take individual coverslips, dip excess PBS off using a paper towel and invert coverslips into the mounting medium.Allow mounting medium to polymerize and dry in a dark place in a horizontal position (overnight). Mounted coverslips can be stored at 4 °C for up to several months.Imaging (1-4 h, depending on number of samples)Note: Acquisition settings (laser power, gain, detector settings) need to be determined individually. It is important to avoid pixel saturation in order to allow for quantitative image analysis. Also, samples to be compared directly with each other need to be recorded using identical settings. Check for bleed-through and cross talk applying standard protocols (e.g., by including a “buffer only” control in the subsequent immunostaining or by applying secondary antibody in absence of primary antibody etc). Establish acquisition settings, using the sample showing the strongest SG recruitment of your protein/peptide.Avoid imaging of the coverslip edge, as cells here are prone to dry out more easily, resulting in unspecific signal or leaky nuclei.Choose (equally) well-permeabilized cells. These cells usually display little or no diffuse G3BP1 staining in the cytoplasm and only strong SG enrichment of G3BP1 (Figure 1). Note: If the experiment is performed the first time, it can be helpful to include one MG-132-treated, non-permeabilized coverslip in the first experiment, in order to distinguish well from poorly permeabilized cells (Figure 1). Staining for TIA-1, another commonly used SG marker, is not well suitable to appropriately judge cell permeabilization, due to its predominantly nuclear localization.",
    "Find ideal z-position by focusing on SGs stained by G3BP1 (or alternative SG marker) antibody. Imaging an area of 73.81 x 73.81 µm (0.059 µm resolution) with a 63x objective results in sufficient pixel area per SG for subsequent analysis. Record several independent fields of view as single z-planes in all channels with a total of at least 10 cells per condition.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3846/bioprotoc-10-24-3846-g002.jpgFigure 1. Immunostaining for the SG marker G3BP1 in permeabilized vs. unpermeabilized cells. Unstressed (untreated) cells or MG-132-treated cells were fixed and stained for G3BP1 either before (MG-132) or after the cells have been permeabilized using digitonin (MG-132 + perm). Note that well-permeabilized cells (MG-132 + perm) are characterized by strong SG formation in comparison to untreated cells, but display reduced cytoplasmic staining for G3BP1 in comparison to cells that have been fixed directly after MG-132 treatment. Scale bar, 20 µm."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Biochemistry",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}