{
  "id": 4561,
  "origin_website": "Bio",
  "title": "CytoTrap Two-Hybrid Screening Assay",
  "procedures": [
    "Constructing and testing bait-hSos fusion protein   DNA encoding bait protein is cloned into the pSos vector (plasmid map: http://www.chem-agilent.com/pdf/strata/217438.pdf[href=http://www.chem-agilent.com/pdf/strata/217438.pdf]) by the conventional enzyme-ligation method. The plasmid construct is confirmed by DNA sequencing to ensure the correct reading frame between hSos and bait.    hSos-bait should be tested for auto-activation or interact with the myristylation signal prior to the CytoTrap two-hybrid screen (Aronheim et al., 1997).    The pSos bait plasmid needs to be co-transformed into yeast host cell cdc25H with negative control either pMyr or pMyr-Lamin C using YeastmakerTM Yeast Transformation System 2.     All the yeast culture procedures need to be conducted at room temperature (22-25 °C). After co-transformation, yeast cells are spread on synthetic media plate without leucine and uracil (SC/-LU) containing glucose, and incubate at room temperature for 4-5 days to allow yeast colonies to grow.    Six independent colonies are picked and placed on SC/-LU medium plate containing galactose, and the plates are kept at room temperature for 1 h, and then transferred to 36 °C for 3 to 6 days for yeast growth.   If the yeast cells co-transformed with the tested bait plasmid and empty pMyr or pMyr-Lamin C are able to grow at 36 °C, then it will be considered unsuitable for the CytoTrap two-hybrid system.    Only bait plasmids that do not lead to growth of host yeast cells at 36 °C in the co-transformation test could be suitable to screen for interaction partners using the CytoTrap two-hybrid system.          Generating a CytoTrap two-hybrid cDNA library  CytoTrap two-hybrid cDNA libraries can be constructed using mRNA from various organisms. Here we use the mRNA from the model plant Arabidopsis as an example.",
    "Briefly, mRNA is extracted and purified from leaf tissue of wild-type Arabidopsis plant (Col-0), then first-strand cDNA is synthesized using a hybrid oligo (dT) linker-primer that contains an XhoI restriction site and a high fidelity reverse transcriptase. 5-methyl dCTP is used in place of regular dCTP during the synthesis of first strand cDNA, and the methylated XhoI sites in the resulting cDNA will be resilient to XhoI digestion. The second-strand cDNA is synthesized using DNA polymerase I. An adapter containing a cohesive EcoRI end and a blunt end (see sequence in Note 1) is linked to the polished double stranded cDNA, and then the cDNA was digested with XhoI. The resulting cDNA containing EcoRI at 5’ end and XhoI at 3’ end is ligated into pMyr vector pre-cut by EcoRI and XhoI, so the cDNA is inserted in a sense expressional orientation driven by the Gal1 promoter (PGAL1). The cDNA library carried in pMyr plasmid (plasmid map: http://www.chem-agilent.com/pdf/strata/217438.pdf[href=http://www.chem-agilent.com/pdf/strata/217438.pdf]) is then transformed into high efficiency E. coli XL10-Gold Kan cells for propagation and storage. The detailed procedure is described below.  cDNA synthesis:    mRNA purification. Leaf samples (~2 g) from 4-week-old Arabidopsis Col-0 plants are harvested, and total RNA is extracted from the leaf tissues using RNeasy Plant Mini Kit. Poly (A) mRNA is then purified from 1 mg of total RNA using Oligotex mRNA Mini Kit for cDNA synthesis (Zhang et al., 2014).    First-strand cDNA synthesis is carried out using high fidelity reverse transcriptase AccuScript.   Add the following reagents to an RNase-free microcentrifuge tube: 10x first-strand buffer: 5 μl First-strand methyl nucleotide mixture: 3 μl  Linker-primer (1.",
    "4 μg/μl): 2 μl  RNase Block Ribonuclease Inhibitor (40 U/μl): 1 μl  mRNA: Equal to 5 μg DEPC-treated water: Bring volume to 50 μl   Incubate the reaction at room temperature for 10 min to allow primer to anneal to template.   Add 3 μl of AccuScript reverse transcriptase to the reaction and incubate the reaction at 42 °C for 2 h.     Second-strand cDNA synthesis.   Put the first-strand cDNA reaction tube on ice, and add the following reagents to the tube: 10x second-strand buffer: 20 μl  Second-strand dNTP mixture: 6 μl  Sterile ddH2O: 139 μl RNase H (5 U/μl): 1 μl DNA polymerase I (9.0 U/μl): 11 μl   Mix the reaction gently and spin down the reaction.    Incubate at 16 °C for 3 h, and then put the tube on ice. The resulting double-strand cDNA (ds cDNA) should be ready for adapter ligation.     Blunting cDNA termini and ligating the EcoR I adapter.   Add the following reagents to second-strand cDNA synthesis, and incubate at 72 °C for 30 min.  10 mM dNTP mix: 4 μl Phusion DNA polymerase (NEB): 4 μl   Add 200 μl UltraPureTM phenol: chloroform: isoamyl alcohol (25:24:1) to the reaction and vortex to mix. Spin down the reaction at 14,000 x g at room temperature for 5 min, and then transfer the upper layer (~ 200 μl) to a new tube.    Add 200 μl chloroform and vortex. Spin down the reaction at 14,000 x g at room temperature for 5 min, and then transfer the upper layer (~ 200 μl) to a new tube.    Add the following reagents to precipitate cDNA, vortex and keep the reaction at -20 °C overnight.  3 M sodium acetate: 20 μl 100% (v/v) ethanol: 400 μl    Spin down the cDNA at 14,000 x g for 60 min at 4 °C.",
    "Remove the supernatant carefully and wash the pellet using 70% ethanol (v/v). Spin down the pellet at 14,000 x g for 2 min at room temperature. Remove the ethanol and dry the pellet at room temperature.    Resuspend the pellet in 8 ul EcoRI adapters and incubate at 4 °C for 1 h to ensure the complete dissolve of cDNA.    Add the following reagents to the tube with cDNA and EcoRI adapters to bring volume to 10 μl, and incubate the reaction at 16 °C for overnight.  10x T4 ligase buffer (NEB): 1 μl  T4 ligase (NEB): 1 μl    Incubate the tube at 70 °C for 30 min to terminate the reaction.     Phosphorylating the EcoRI end.   Cool down the reaction at room temperature for 10 min.   Add the following reagents to the tube, and incubate at 37 °C for 1 h.  10x reaction buffer (NEB): 1 μl  Sterile ddH2O: 8 μl T4 polynucleotide kinase (NEB): 2 μl    Incubate the tube at 70 °C for 30 min to terminate the reaction.   Cool the reaction at room temperature for 10 min, and then add the following reagents to the reaction, incubate at 37 °C for 3 h. 10x reaction buffer (NEB): 5 μl  Sterile ddH2O: 22 μl Xho I (NEB): 3 μl   Precipitate the cDNA by adding the following reagents to the tube, and incubate at -20 °C overnight. 10x STE buffer: 5 μl 100% (v/v) ethanol: 125 μl   Spin down the reaction at 14,000 x g for 60 min at 4 °C. Remove the supernatant and dry the pellet at room temperature. Dissolve the pellet in 100 μl sterile ddH2O.     Purify ds cDNA with CHROMA SPINTM+TE-400 columns. (Procedures are performed at room temperature if not specified.)   Resuspend the gel matrix by invert the column several times.",
    "Remove the top cap and take away the break-away end at the bottom. Place the column in a 2-ml collection tube.   Centrifuge at 700 x g for 5 min, and then remove the collection tube and buffer.    Put the column to a new collection tube and add 100 μl cDNA sample to the center of top surface of gel matrix.    Centrifuge at 700 x g for 5 min, collect the elution solution containing cDNA (size >200 bp).   Precipitate cDNA by adding the following reagents to the eluted solution, and incubate at -20 °C freezer for overnight.  3 M sodium acetate (pH5.2): 10 μl Ice-cold 100% ethanol: 250 μl   Centrifuge at 14,000 x g for 30 min at 4 °C. Discard the supernatant, and add 360 μl 70% ethanol, inverted several times, and then centrifuge at 14,000 x g for 5 min at 4 °C. Remove the supernatant and dry the pellet at room temperature. Resuspend the cDNA in 5 μl sterile ddH2O.     Ligating cDNA into pMyr vector and transform into E. coli.   Set up T4 ligation reaction by adding the following reagents, incubate overnight at 16 °C.  10x ligase buffer (NEB): 2.5 μl Resuspended cDNA (1 μg): X μl pMyr vector (precut by EcoRI/XhoI, 500 ng): 5 μl  T4 DNA ligase (NEB): 2.5 μl ddH2O: Bring volume to 25 μl   Transform all the ligation reaction to XL10-Gold Kanr Ultracompetent cells. Use 2 μl ligation reaction for each transformation according to the manufacturer’s instruction.    Plate the transformation on 150-mm LB plates containing chloramphenicol (25 μg/ml), about 50-100 plates in total. Spread appropriate volume of transformation, so that each plate may have 30,000 colonies. Incubate at 37 °C overnight to allow colonies to grow. The total number of colonies should be 3 million.",
    "Add 5 ml LB medium to each plate to scrape the bacteria with a spreader, and wash each plate using additional 1 ml LB medium. Pool all the bacteria in one beaker and mix gently and well. Aliquot 10 ml bacteria culture in 15-ml centrifuge tubes and stored at -80 °C.  Purify plasmid from each 10 ml aliquot for CytoTrap two-hybrid screen.        Screening a CytoTrap two-hybrid cDNA library  The bait and cDNA library plasmids are co-transformed into temperature sensitive host strain cdc25H. The transformation reaction is spread on SC/-LU plates containing glucose at room temperature to allow positive transformants to grow, and then the transformants are replica plated to SC/-LU plates containing galactose and incubated at 36 °C to select clones which expressing the bait and a potential interaction partner genes. The positive clones are further analyzed to confirm the bait-specific protein interaction. The flowchart of library screening is shown in Figure 1.   Co-transformation of bait and cDNA library plasmids into host strain cdc25H. This step is conducted as suggested by YeastmakerTM Yeast Transformation System 2 manual except that all the yeast culture steps must be conducted at room temperature unless otherwise specified to reduce rate of revert mutation of cdc25H. The transformation reactions are spread on SC/-LU plates (150-mm) containing glucose and kept at room temperature for 3 to 4 days until colonies grow to 2-3 mm in diameter. It is ideal to have ~3,000 colonies on each plate, and it is necessary to screen at least 1 million colonies.    Replica plate the colonies grown up to SC/-LU plates (150-mm) containing galactose, and leave the plates at room temperature for one hour before moving to the selective temperature of 36 °C for incubation of 3 to 6 days.",
    "Colonies containing putative interacting partners and reverting mutants will grow up and it is necessary to pick up the colonies when they are 2-3 mm in diameter during selection, and not wait to pick up at the end of selection.   Pick up colonies grown up on SC/-LU plates containing galactose at 36 °C, and dissolve the colonies in 25 μl sterile dH2O. Dot 5 μl of yeast suspension to four plates: Two SC/-LU containing glucose and two SC/-LU containing galactose. Incubate one SC/-LU plate containing glucose and one SC/LU plate containing galactose at room temperature, and the other two plates at 36 °C.  Notes:    The number of plates should be scaled up if there are more yeast colonies.    As shown in Figure 1, yeast colonies that only grow on SC/-LU containing galactose, but not on SC/LU containing glucose at 36 °C are kept as primary positive candidates for further analysis.    The yeast colonies that grow on both galactose and glucose plates at 36 °C are temperature revert mutants, and their growth at selective temperature is caused by revert mutation of cdc25H mutant gene back to wild-type gene, hence their growth at 36 °C is not galactose-dependent.    A large percentage of false positives will be the temperature revert mutants and can be easily identified by testing galactose-dependent growth at 36 °C.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20141204/20141204010933_0436.jpg Figure 1. CytoTrap two-hybrid library screening procedure. A pSos-bait is co-transformed into yeast strain cdc25H with a cDNA library in pMyr. Positive transformants are selected on SC/-LU (glucose) plates at room temperature. Colonies are then replica plated on SC/-LU (galactose) plates and incubated at 36 °C for 3 to 6 days. Colonies grown up at 36 °C are further tested for galactose- and bait-specific growth to identify the true interaction clones.",
    "Analyze positive interaction candidates The primary positive candidates from library screen need to be further tested to see whether the interaction is bait-specific and nature of the prey genes need to be identified for functional analysis.    Isolate prey plasmids from positive candidates.    Inoculate positive yeast candidates in 2 ml of liquid SC/-LU containing glucose and shake at 30 °C for 2 days.    Transfer 1.5 ml yeast culture to a 1.7-ml centrifuge tubes, and spin down the cells at 14, 000 x g for 1 min. Remove the supernatant and add 200 μl yeast lysis solution, resuspend cells by vortexing.    Add 200 μl UltraPureTM phenol: chloroform: isoamyl alcohol (25:24:1, v/v) and 0.3 g of acid-washed glass beads, vortex vigorously for 2 min for each sample.    Centrifuge at 14,000 x g for 5 min at room temperature, and transfer the top layer into a new microcentrifuge tube. Add the following reagents to each tube, and keep the tubes at -20 °C for 30 min.  3 M sodium acetate (pH 5.2): 20 μl Ice-cold 100% ethanol: 500 μl   Spin down the pellet at 14,000 x g for 10 min at 4 °C. Remove the supernatant, and wash the pellet with 70% ethanol. Spin down the pellet at 14,000 x g for 5 min at room temperature. Remove the supernatant and dry the pellet at room temperature.    Resuspend the pellet in 50 μl sterile ddH2O, and then use 1-2 μl of yeast plasmid DNA to transform 10-beta Electrocompetent E. coli competent cells. Spread the transformation reaction on LB/chloramphenicol agar plates. Put at 37 °C for overnight.    Pick up single colonies and inoculate in LB/chloramphenicol liquid medium at 37 °C for overnight. Purify the plasmid for further analysis.",
    "Yeast co-transformation to test bait-specific protein-protein interaction   Transform the purified candidate prey plasmids with either pSos-bait or pSos empty vector into host strain cdc25H.    Inoculate the transformants on SC/-LU containing glucose at room temperature for 4 days. Pick up three individual colonies and transfer to SC/-LU containing glucose and SC/-LU containing galactose plates, and incubate at 36 °C for 3 to 6 days.    Only prey plasmids that show specifically interact with pSos-bait, not with pSos empty vector are kept for sequence analysis.    The identity of cDNA insert is determined by DNA sequencing."
  ],
  "subjectAreas": [
    "Microbiology",
    "Plant Science",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}