{
  "id": 17261,
  "origin_website": "Jove",
  "title": "An Effective Surgical Strategy for Anteromedial Osteoarthritis of the Knee with Simultaneous Popliteal Cysts Drainage",
  "procedures": [
    "The present study was approved by the ethics committee of Second Hospital of Shanxi Medical University and all the patients provided written informed consent.\n1. Inclusion and exclusion criteria for patients\nUse the following inclusion criteria.\n\t\nSelect patients diagnosed with anteromedial osteoarthritis of the knee where conservative treatment failed. Diagnose anteromedial osteoarthritis of the knee by anteroposterior x-ray, based on a narrowed medial compartment of the knee but a normal lateral compartment.\nVerify the presence of an intact anterior cruciate ligament using clinical and intraoperative assessments. Identify the anterior cruciate ligament through preoperative magnetic resonance imaging (MRI) and a negative sign in the anterior drawer test; then, verify its integrity intraoperatively by probing with the hook instrument. An intact anterior cruciate ligament is a prerequisite for the patients undergoing UKA.\nSelect patients having a <10° flexion contracture. Flexion contracture means that the knee is unable to fully extend to 0°, either actively or passively.\nSelect patient with a >90° range of motion (ROM) of the knee. It is also a prerequisite for the patients undergoing UKA.\nSelect patients diagnosed with popliteal cysts after ultrasonography and MRI examinations.\n\t\t\nWith the ultrasound, identify a popliteal cyst as a well-defined and unilocular collection of anechoic or hypoechoic fluid between the tendons of the medial head of the gastrocnemius and semimembranosus.\nWith the MRI, identify a popliteal cyst as a delineated mass with low signal intensity on the T1-weighted image, high signal intensity on the proton density-weighted fat saturation image, and a fluid-filled neck of the cyst communicating with the joint on the axial images.",
    "Classify popliteal cysts based on the Rauschning and Lindgren (R-L) knee grade, which is used to evaluate the severity of popliteal cysts12. Based on the R-L knee grade, classify the cysts as grade 0, grade I, grade II, and grade III. Select pre-operative grade II, and grade III cysts, which are symptomatic, for treatment.\nUse the following inclusion criteria.\n\t\nExclude patients with a history of prior knee joint surgery.\nExclude patients diagnosed as having asymptomatic popliteal cysts.\nExclude patients who dropped out of follow-up or patient with incomplete follow-up data.\n2. Surgical techniques\nNOTE: The same group of surgeons conducted all the operations included in the study. Moreover, ensure that all the participants underwent the standard Oxford UKA surgical procedure with spinal anesthesia10. In case of a symptomatic popliteal cyst, Oxford UKA was performed, along with internal drainage of the popliteal cyst before implantation of the Oxford phase III medial unicondylar knee prosthesis. Perform the internal draining of the popliteal cyst as described below.\nSedate the patient with spinal anesthesia as per the standard operating procedure. Ensure complete loss of sensation below the patient's waist to confirm proper anesthetization.\nUse an oscillating saw blade to excise the plateau. Lever the plateau up with a broad osteotome and remove it. Identify a wide space between the tibia and the femur following which the internal exit of the cyst can be visualized (Figure 1).\nOpen the internal exit of the cyst to 5-8 mm with a knife. This will help in widening and clearing the communication between the joint and the cyst and restore the bidirectional fluid flow.",
    "Squeeze the popliteal cyst by hand outside the skin until all the viscous cyst fluid flows into the joint cavity through the exit of the cyst. Draw out the remaining cyst fluid by applying 30 kPa of negative pressure.\nMill the femoral condyle using the number of spigots required by the ligament balancing technique and a spherical cutter. Cement the prosthesis sequentially from the tibial side to the femoral side when the trial implantation test is satisfactory. Complete the reconstruction by snapping the chosen bearing into place and the procedure is ended.\n3. Postoperative rehabilitation\nAsk the patients to perform straight-leg raises and isometric exercises on the first day after surgery. To improve the knee function, ask the patients to perform full weight-bearing exercises, including standing and walking slowly with the assistance of a walker, 2 days after operation.\nFor postoperative analgesia, ensure that all the patients receive postoperative administration of 40 mg of parecoxib intravenously every 8 h. To prevent blood clots, give patients anticoagulant therapy with a 10 mg dose of rivaroxaban daily at day 1 to 2 weeks post operation.\n4. Efficacy evaluation\nObtain a visual analog scale (VAS) score for all the patients13. Use the VAS score to indicate the degree of pain by asking the patient to make a mark on the horizontal line according to their feeling: 2-4 points represent mild pain, 5-7 points represent moderate pain, and 8-9 points represent severe pain.\nObtain a hospital for special surgery (HSS) score for all the patients14. The HSS score mainly includes six aspects of pain, function, joint mobility, muscle strength, knee flexion deformity, and knee stability. Classify the score as follows: >85 as excellent, 70-84 as good, 60-69 as fair, and <59 as poor.",
    "Obtain a Western Ontario and McMaster Universities Arthritis Index (WOMAC) score for all the patients15. The WOMAC score assesses the knee through three domains: pain, stiffness, and joint function. Scores range from 0 to 96 for the total WOMAC, where 0 represents the best health status and 96 the worst possible status. The higher the score, the poorer the function.\nAssign a Rauschning and Lindgren (R-L) knee grade12 to evaluate the severity of the popliteal cysts. Based on the R-L knee grade, classify the cysts as grade 0, grade I, grade II, and grade III as described below.\n\t\nGrade a cyst as 0 for no swelling or pain, no limitation of range of motion, no instability or weakness, and no limitation in work or sports participation.\nGrade a cyst as I for slight swelling and discomfort after strenuous exercise, some giving-way or weakness, muscular atrophy of <1 cm, negligible limitation of range of motion (<10°), no hard labor, and no strenuous sports such as athletics or a ball game.\nGrade a cyst as II for moderate swelling, pain following moderate exertion, slight or moderate instability, locking, and muscular atrophy of 1-2 cm, limitation of range of motion between 10° and 20°, no physical work, limited participation in sports.\nGrade a cyst as III for considerable and tense swelling, severe pain interfering with activities of daily living, pain at rest, disabling instability, contractures, and muscular atrophy of >2 cm, limitation of range of motion >20°, stopped working due to knee derangement, no participation in sports.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}