{
  "id": 9635,
  "origin_website": "Jove",
  "title": "Easy Manipulation of Architectures in Protein-based Hydrogels for Cell Culture Applications",
  "procedures": [
    "1. Hydrogel Preparation\nMix 200 mg of BSA with 1 mL of deionized H2O to create 20% (w/v) BSA stock (stock solution A).\nMix 165 µL of THPC solution (134 mg/mL) with 4.835 mL of deionized water to create THPC stock solution (stock solution B).\nWeigh 1 mg of KCSSGKSRGDS (1,111.1 g/mol) peptide (or an equivalent cell-adhesive peptide) and dilute it in 100 µL of sterile H2O to obtain a 10 mg/mL solution (stock solution C).\n\tNOTE: This step is optional and only needs to be included if the hydrogel is meant for cell culture application.\nRemove the bottom of a 96-well plate and replace it with removable plastic wrap.\n\tNOTE: For the plates used here, the bottom can easily be removed by applying pressure to the bottom of each well; the thin plastic bottom will simply fall out.\nMix 100 µL of BSA stock solution (A) and 100 µL of THPC stock solution (B) (optional: 4 µL of stock solution C for functionalized, cell-adhesive hydrogels) in the 96-well plate to obtain 200 µL of hydrogel. Mix the components by pipetting up and down at least 5 times to guarantee a uniform hydrogel after polymerization.\nPlace the 96-well plate at room temperature (RT) for about 10 min until all hydrogels are properly polymerized.\nCarefully and slowly remove the plastic wrap from the bottom of the plate.\nPress the hydrogels out of the 96-well plate using a small stamp and transfer them to 1.5 mL tubes with sterile PBS, pH 7.4.\n\tNOTE: The hydrogels have a cylindrical shape, with a diameter of approximately 4 mm and a height of 8 mm.\nStore the hydrogels in phosphate-buffered saline (PBS) at 4 °C for up to several months.\n2. Freeze-drying the Hydrogels",
    "Fill 1.5 mL tubes with 500 µL of sterile deionized H2O and remove the cap. Transfer the hydrogels to the 1.5 mL reaction tubes using a spatula.\nWrap the 1.5 mL tubes tightly with paraffin film-at least three layers for each vial. Use a needle to pierce small holes in the film to enable gas release from the tube.\nProceed to one of the following steps:\nTransfer the vial to liquid nitrogen solution for 5 min to guarantee that the water and hydrogel completely freeze. Immediately after removal from the liquid nitrogen, transfer the vials to the freeze dryer to prevent the material from thawing.\n\t\tNOTE: This procedure results in pores about 10-15 µm in radius.\nKeep the vials at -20 °C overnight to slowly freeze the hydrogels. Immediately after removal from -20 °C, transfer the vials to the freeze dryer to prevent the material from thawing.\n\t\tNOTE: This procedure results in pores about 50-60 µm in radius.\nAfter 24 h (and the complete evaporation of the water in and around the hydrogel), thaw the material by removing it from the freeze dryer.\n\tNOTE: The pore sizes can be analyzed with confocal laser scanning microscopy (step 5, \"Hydrogel Visualization\").\n3. Particle Leaching\nPrepare the hydrogel as described in steps 1.1-1.5.\nDirectly after mixing the components, add NaCl until saturation occurs (36 mg/mL). Add salt until a salt crystal can be seen in the solution as a white precipitate.\nTransfer the 96-well plate to a shaker and shake until polymerization takes place (about 10 min). Remove the hydrogels from the plate, as described in steps 1.7-1.8.",
    "Incubate the hydrogels for at least 24 h at RT in sterile water on a shaker (20 rpm) to elute all salt from the hydrogel template. Store the hydrogels at 4 °C in PBS for up to several months.\n4. Channel Formation\nPrepare hydrogels as described in step 1. Remove a hydrogel from solution using a pincer, remove the excess water with highly absorbent paper, and place it on top of a block of dry ice.\nFreeze the hydrogel for 30 s and carefully remove it from the block. Do not damage the hydrogel; carefully use a spatula to scrape it off the block. Transfer the hydrogel to a 1.5 mL tube and dry it overnight at 37 °C.\n5. Hydrogel Visualization\nPrepare a rhodamine B stock solution by diluting 1 mg of rhodamine B in 10 mL of PBS. Prepare a serial dilution by diluting the rhodamine stock solution in PBS until a concentration of 0.001 mg/mL is reached (dilution factor: 100)\nRemove the hydrogel from the storage solution (e.g., from step 2.4.) and transfer it to a 1.5 mL tube with 1 mL of 0.01 mg/mL rhodamine B solution. Stain the hydrogel overnight in rhodamine B solution at RT.\nThe next day, transfer the hydrogel that is to be visualized to 10 mL of PBS (pH 7.4) and wash for at least 3 h.\nTransfer the hydrogel onto a µ-slide 8 well and cover it with PBS.\nCut small slices out of the hydrogel (about 0.5 mm in height) using a blade.\nUsing a confocal laser scanning microscope, visualize the hydrogel at a wavelength of 514 nm (objective: EC Plan-Neofluar 40x/1.30 Oil DIC M27, plane scan mode: 514 nm, and zoom: 1X).\n6. Cell Culture Feasibility",
    "Sterile-filter all stock solutions (A, B, and C) with a 0.45 µm filter.\nPrepare the hydrogel as described in steps 1.1-1.4, including the cell-adhesive peptide prior to hydrogel polymerization.\nAfter mixing the components, immediately pipette the mixture into a µ-slide 8 well until the bottom is completely covered.\n\tNOTE: This step must be performed quickly and directly after mixing the components, as polymerization takes place within minutes in the slide.\nCulture adhesion cells and passage to obtain a single-cell suspension using standard cell culture techniques. Transfer the cells into pre-warmed, sterile DMEM cell culture medium supplemented with fetal bovine serum (FBS, 10% (w/v)), penicillin-streptomycin (1% (w/v)), and nonessential amino acid solution (MEM, 1% (w/v)).\nCount the cells with a Neubauer counting chamber and carefully pipette 200 µL of the desired number of cells (2 x 105 cells/cm2) onto the hydrogel surface.\nCover the µ-slide 8 well with the lid and transfer it to an incubator (37 °C, 5% CO2). Incubate for at least 4 h at 37 °C.\nAfter at least 4 h of cellular attachment, wash the cells twice with 200 µL of sterile cell culture PBS.\nFix the cells with 200 µL of 3.7% (v/v) formaldehyde for 10 min at RT and wash twice with PBS (~200 µL).\n\tNOTE: Wear appropriate personal protective equipment when handling formaldehyde.\nPermeabilize the cells with 200 µL of 0.1 % Triton X for 5 min. Wash twice with PBS.\nStain the cells with phalloidin-rhodamine by mixing 5 µL of methanolic stock with 195 µL of PBS and adding it to the cells at RT. Stain the cells for 20 min in the dark. Wash twice with PBS.",
    "Investigate the cell adhesion properties using a confocal microscope at 514 nm (objective: EC Plan-Neofluar 40x/1.30 Oil DIC M27, plane scan mode: 514 nm, and zoom: 1X). Analyze the images using appropriate software (see the Table of Materials).\n7. Hydrogel Properties\nSwelling ratio.\nCompletely dry the hydrogels at 37 °C for at least one day.\nWeigh each hydrogel and note the exact weight.\nFill a 2 mL reaction tube with 1.5 mL of PBS.\nTransfer the hydrogel into this 2 mL reaction tube and completely immerse it in PBS.\nLeave the hydrogel for at least two days in PBS at RT to reach equilibrium with the PBS.\nAfter three days, remove the hydrogel from the solution and dry it with a paper tissue to remove excess water from the hydrogel surface.\nWeigh the hydrogel.\nCalculate the swelling ratio using the following formula:\nimgsrc://cloudfront.jove.com/files/ftp_upload/55813/55813eq1.jpg\n\t\twhere Wd is the weight of the dried gel (step 7.1.2.) and Ws is the weight of the wet gel (step 7.1.7). Multiply with 100 to get the swelling ratio percent.\npH and temperature stability.\nTransfer 5 mL of PBS to a 15-mL reaction tube.\nAdjust the solution to the appropriate pH (e.g., pH 2, 7, or 10) with NaOH and HCl. Bring the solution to the appropriate temperature (e.g., RT, 37 °C, or 80 °C).\nTransfer the hydrogel that is to be investigated for its stability into the appropriate solution. Readjust the pH if necessary.\n\t\tNOTE: All hydrogels should be completely swollen at this point (see the swelling ratio) to prevent the incorrect interpretation of the weight due to the swelling of the material.",
    "After certain time intervals, remove the hydrogel from the solution (e.g., each hour for up to 2 days), dry it with a highly absorbent paper tissue to remove excess water, and weigh it.\nEnzymatic degradation.\nPrepare a stock enzyme solution of 300 U trypsin and pepsin, as per the manufacturer's instructions.\nTransfer the hydrogel (e.g., from step 1.8) to the appropriate solution.\n\t\tNOTE: All hydrogels should be completely swollen at this point to prevent the incorrect interpretation of the weight.\nAfter certain time intervals, remove the hydrogel from the solution (e.g., each hour), dry it with a highly absorbent paper tissue to remove excess water, and weigh it.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}