{
  "id": 13640,
  "origin_website": "Jove",
  "title": "Imaging Calcium in Drosophila at Egg Activation",
  "procedures": [
    "Note: Carry out all steps at room temperature unless stated otherwise.\n1. Preparing for Dissection\nNote: The steps described here are in accordance with E. Gavis, Princeton University & Weil et. al. 18. Perform the following steps two days before imaging.\nTake a fly vial containing approximately 10 ml of solid food and add a small amount of dried yeast to one corner, less than 1 g is sufficient.\n\tNote: For information about fly vials or food see 'Drosophila Maintenance' 19.\nAdd 1 - 3 drops of water to hydrate the yeast.\nSet the vial aside at a 45° angle and allow 3 - 5 min for the yeast to take up the water.\nWhile the yeast is absorbing the water, select a bottle of flies expressing UASt-myrGCaMP5 20 driven by tub-VP16GAL4 (referred to as GCaMP5) that have recently emerged (a myristoylated form of the GCaMP5 was chosen to provide a high signal to noise ratio through tethering the GECI to the membrane in the egg).\nAnaesthetize the flies in the bottle with CO2 gas. Be sure to keep the bottle inverted so as not to lose flies in the wet food.\nTip the anesthetized flies onto a CO2 pad and sort 10 - 15 females and 5 males using a paintbrush under a dissecting microscope. Note: It is standard to include males to provide healthy females for dissection.\nWhen the vial from step 1.3 is ready, add the selected flies to the vial. Take care to keep the vial horizontal until the flies become active.\nPlace the vial at 25 °C for approximately 36 hr.\nReturn the remaining flies from the CO2 pad to the bottle or discard.\n2. Dissecting Drosophila Ovaries\nNote: The steps described here are in accordance with Weil et. al. 18.",
    "After 36 hr, anaesthetize the flies from the yeasted vial with CO2.\nOnce the flies inside the vial are anesthetized tip them onto the CO2 pad to be sorted with a paint brush under a dissecting microscope.\nSelect a female.\nIsolate the two ovaries from the female. For full detailed protocol see Weil et. al. 18. In summary:\n\t\nPlace a small drop of oxygenated halocarbon oil (series 95) on a No. 1.5, 22 x 40 mm coverslip.\nGrasp the female with forceps at the anterior of the abdomen.\nHolding the female under the dissecting microscope, use the second set of forceps to gently remove the posterior of the female.\nWipe off the posterior tissue from the second forceps.\nSqueeze on the abdomen cavity with the second forceps from the anterior to the posterior of the abdomen. The two opaque ovaries should stick to the forceps when outside of the female.\nTouch the ovaries into the oil.\nRemove any tissue from the forceps by wiping off the forceps.\nRepeat these steps (2.4.1 - 2.4.7) to obtain three coverslips, each containing ovaries from one fly.\n3. Isolating Individual Mature Eggs\nUnder a standard dissecting microscope with the magnification set to 4X, on the first coverslip from step 2.4, separate the two ovaries by tearing the oviduct.\nIntroduce a pair of closed forceps into the center of a single ovary, taking care not to puncture any egg chambers.\nInsert a standard dissecting probe into the center of the ovary next to the closed forceps.\nGently drag the dissecting probe through the ovary towards the posterior pole, where the mature eggs (stage 14 egg chambers) are located.\nRepeat steps 3.1 - 3.4 2 - 5 times depending on the size of the ovary and number of eggs.",
    "Note: Addition of CO2 typically causes the deposition of a single egg which will appear larger with raised dorsal appendages than pre-deposited eggs. This egg should be discarded for imaging since it has already been activated inside the female.\n\tNote: Mature eggs are likely to separate easily from ovarian connective tissue.\nIf no mature eggs are visible outside of the ovary, continue gently teasing with the dissecting probe.\nOnce the mature eggs are visible on the coverslip outside of the ovary, maneuver 3 - 5 in a line in the center of the coverslip.\n\tNote: For best results, run the probe gently along the side of the eggs.\n\tNote: Avoid pulling on the dorsal appendages as this can damage the egg.\n\tNote: Depending on the future imaging set-up, align the eggs approximately 200 µm apart perpendicular to the coverslip for maximum imaging area.\nOnce aligned, remove the rest of the ovarian tissue by dragging it away from the aligned eggs using the forceps.\nRemove excess oil by dabbing with the corner of a medical wipe. Be careful not to touch the mature eggs with the medical wipe as mature eggs that are contacted will be lost.\nDraw a crosshair on the coverslip with a marker to simplify locating the sample under the microscope.\nSet the coverslip in a safe place and leave the prepared egg chambers on the coverslip to rest for 5 - 10 min. This allows for the egg to settle in the oil. Samples can be used up to 1 hr post dissection.\nRepeat steps 3.1 - 3.11 for the rest of the coverslips with ovaries on them.\n4. Preparing for Imaging\nBring prepared activation buffer 15 to room temperature.",
    "Note: Activation buffer is a hypotonic buffer: 3.3 mM NaH2PO4, 16.6 mM KH2PO4, 10 mM NaCl, 50 mM KCl, 5% polyethylene glycol 8,000, 2 mM CaCl2, brought to pH 6.4 with a 1:5 ratio of NaOH:KOH. For more information see Mahowald, 1983 15. Aliquots of activation buffer can be stored at -20 °C for months and at 4 °C for up to 2 weeks.\nCarefully transport prepared coverslips, activation buffer and glass pipettes to the imaging facility.\n\tNote: A wide-field, confocal, spinning disc or light sheet microscope can be used. We recommend using an inverted microscope. Our representative results were obtained using a confocal microscope.\nAn objective suitable for imaging the entire mature egg should be chosen (here: 20X 0.7 NA).\nMount the first prepared coverslip on to the microscope stage. Take care not to break the coverslips on the stage.\nQualitatively select a field of view with a mature egg chamber for activation. Do not image punctured egg chambers or those with blebbing in the membrane.\n\tNote: For steps 4.6 - 4.7, software commands will vary depending on microscope and manufacturer.\nSet imaging parameters for standard GFP excitation (488 nm) and emission (500 - 580 nm). Also set up a bright-field view in order to visualize and orientate the mature egg and displaced oil.\nSelect the lowest Z-plane where mature eggs are visible and set a full Z-stack to be taken for 40 µm at approximately 2 µm per step. Set the parameters so there is no delay between Z-stack acquisition. Set the time series to capture for approximately 30 min.\n5. Imaging Ex Vivo Egg Activation\nStart image capture.\nWait for 1 - 2 full Z-stacks to be acquired. This shows the mature egg prior to activation.\nWithdraw approximately 300 µl of activation buffer into a glass pipette.",
    "Positioning the tip of the glass pipette containing activation buffer at a 45° angle above the coverslip, slowly move the pipette into the beam path until it is directly above the mature egg being imaged. The glass pipette should be 1 - 2 cm above the oil.\nAdd 1 - 2 drops of activation buffer in less than 5 sec from the glass pipette. This should displace the oil. Avoid adding excess activation buffer or touching the egg with the glass pipette as it can cause displacement of the mature egg. Take care not to touch the coverslip with the pipette as this can cause a change in the focal plane or air bubbles to form in the immersion oil between the objective and coverslip.\nWhilst adding activation buffer during image acquisition, check the bright-field channel to ensure that the oil has been displaced by the activation buffer.\n\tNote: This will first appear as a shadow due to the pipette breaking the beam path but will also result in the appearance of small oil droplets. Some oil droplets can remain associated with the mature egg which will affect experimental outcomes and image quality.\nIf the oil is not displaced from the initial addition of activation buffer repeat steps 5.4 - 5.6.\nOnce the oil is successfully displaced, allow the time series to run until completion.\n\tNote: Due to swelling of oocytes at activation, some egg chambers will move dramatically out of the focal plane or field of view upon addition of activation buffer. In this situation, stop the acquisition and mount the next coverslip.\nAfter the image sequence has completed acquisition, save data.\n6. Post-acquisition Image Processing\nOpen the data set using Fiji (http://fiji.sc/Downloads#Fiji), or equivalent image processing software, and select the relevant files for analysis.",
    "To build a projection of the acquired data select: Image > Stacks > Z-project.\nSelect a start Z-slice and a stop Z-slice, typically the whole section. Select a projection type, typically set to 'Max Intensity'. Check tick box 'All Time Frames' to apply the selected settings to the whole series.\nIf more than one fluorescent channel has been imaged, use the Channels tool to enable movement between colors, make a composite, or make the image grayscale. Select Image > Colors > Channels tool.\nTo adjust the image brightness and contrast select Image > Adjust > Brightness/Contrast.\nTo export a single image, move timescale slider to relevant frame and select File > Save As > Jpeg, or any preferred format.\nChoose a location and title for the exported file, then save.\n\tNote The frame rate from the imaging software will be required to give a time stamp on the image.\nTo export the time series as a movie select: File > Save As > AVI, then select frame rate (~ 7 frames per second).\nChoose a location and title for the exported file, then save.\nTo save the adjusted file in Fiji format, select File > Save."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}