{
  "id": 8692,
  "origin_website": "Jove",
  "title": "Automated Segmentation of Cortical Grey Matter from T1-Weighted MRI Images",
  "procedures": [
    "Note: Ensure that all images are in NifTI format. Conversion to NifTI is not covered here.\n1. Segmentation via SPM 8: Unified Segment\nNOTE: This procedure is performed via the SPM8 GUI which operates within Matlab. The SPM8 guide provides further detail and can be found at: http://www.fil.ion.ucl.ac.uk/spm/doc/spm8_manual.pdf.\nMake sure that SPM8 is installed and set in the software path.\nSPM segmentation is performed using a GUI. To open SPM, open a command window and type 'spm' into the command line.\nPress 'PET & VBM' to open the structural MRI toolbox.\nPress 'Batch' to open the Batch Editor. This allows segmentation to be performed on multiple scans at a time.\nSelect 'SPM | Spatial | Segment'.\nClick 'Data | Select Files'. Choose the T1-weighted scans as input.\n\tNOTE: The files must be unzipped NifTi files, with the extension being '.nii'.\nClick on 'output files | Grey Matter' and ensure that 'Native Space' is selected, do the same for White Matter. If the CSF segmentation is not required leave this as 'None'.\nIf the scans have already been bias-corrected, change the 'Bias Corrected' option to 'Don't Save Corrected'. For the 'Clean up any partitions' option, test the three different options and use visual quality control (QC, Section 8) to determine which works best for the data.\nLeave the other settings as their defaults. Then, click on the green flag to run the segmentation.\n\tNOTE: This takes around 5 minutes per participant, and the command line will say, 'Running Segment'. When finished, the command window will display 'Done'.\nPerform visual QC on the GM (C1*.nii file) as described in Section 8.\n2. Segmentation via SPM 8: New Segment",
    "NOTE: This procedure is performed via the SPM8 GUI. The SPM8 guide provides further detail and can be found at: http://www.fil.ion.ucl.ac.uk/spm/doc/spm8_manual.pdf. Make sure that SPM8 is installed and set in the software path. Open the SPM software, typically performed by typing \"spm\" into a command line. This opens a graphical user interface (GUI) window with a range of options that can be selected to perform analysis. \nPress 'PET & VBM'.\nPress 'Batch' to open the Batch Editor.\nSelect 'SPM | Tools | New Segment' in the Batch window. Select the T1 image files (with extension '.nii').\nSet 'Native Tissue type' to 'Native Space'. As needed, turn off the different tissue classes (such as CSF) - if not required - by setting them to 'None'. Set 'Warped Tissue' to 'None'.\n\tNOTE: All other options can be left as the default setting.\nClick the green flag to run the segmentation.\n\tNOTE: The command line will say, 'Running New Segment'. Once it has finished running the MATLAB command line will say, 'Done New Segment'.\nPerform visual QC on the GM (C1*.nii file) as described in Section 8.\n3. Segmentation via SPM 12: Segment\nNOTE: This procedure is performed via the SPM12 GUI. The SPM12 guide provides further detail and can be found at:http://www.fil.ion.ucl.ac.uk/spm/doc/manual.pdf.\nOpen the SPM software by typing 'spm' into the command window. This opens a graphical user interface (GUI) window with a range of options that can be selected to perform analysis.\nPress 'PET & VBM'. Press 'Batch' to open the Batch Editor.\nClick on 'SPM | Spatial | Segment'. Then, click on 'Data | Volumes'.\nSet 'Native Tissue type' to 'Native Space'. Turn off the tissue classes that are not required (such as CSF) by setting them to 'None'. Set 'Warped Tissue' to 'None'.",
    "NOTE: All other options can be left as default setting.\nClick the green flag to run the segmentation.\n\tNOTE: The command window will display: 'Running Segment'. Once the run is complete, it will display: 'Done Segment'.\nPerform visual QC on the GM (C1*.nii file) as described in Section 8.\n4. Segmentation via FSL FAST\nNOTE: This procedure is done in the command line. The FSL guide provides further detail and can be found at: https://fsl.fmrib.ox.ac.uk/fsl/fslwiki.\nRun BET brain extraction. This may need to be optimized for different datasets, but the basic command is:\n\tbet T1_ID.nii bet_T1_ID.nii\nRun FSL FAST segmentation:\n\tfast bet_T1_ID.nii\n\tNOTE: This will output partial volume maps and binary regions for GM, CSF, and WM.\nPerform visual QC on the GM region (the file ending *_pve_1.nii.gz) as described in Section 8.\n5. Segmentation via FreeSurfer\nNOTE: This procedure is done in the command line. The FreeSurfer guide provides further detail and can be found at: https://surfer.nmr.mgh.harvard.edu/.\nSet the directory where the data is by typing:\n\texport SUBJECTS_DIR=/path/to/nii/files\nRun the segmentation by running the commands:\n\trecon-all -i T1_ID.nii -subjid T1_ID -autorecon1 -cw256\n\trecon-all -subjid T1_ID -autorecon2 -autorecon3\n\tNOTE: The commands take > 10 h per participant. The -cw256 flag is needed to crop scans with fields of view larger than 256 down to this size for processing.\nCheck that processing has completed correctly by looking at the script located in the 'output folder | scripts | recon-all.log'. Check that the last line says 'recon-all -s T1_ID finished without error'.\nPerform visual QC on the GM region as described in Section 8.\n6. Segmentation via ANTs",
    "NOTE: This procedure is done in the command line. ANTs is a more complex software than the other tools and it should be noted that the procedure explained here could be further optimised for each cohort to improve the results. ANTs documentation can be found at: http://stnava.github.io/ANTsDoc/. There are two ways to segment the images into tissue classes as described below. \nTo use the first method, run the command 'antsAtropos.sh' with default settings and without including tissue priors.\n\tNOTE: This often performs well especially when only 3 tissue classes are required: GM, WM, other.\n\t\nSet the path to ANTs software by typing the command:\n\t\texport ANTSPATH=/path/to/ANTs/bin/\nRun the segmentation pipeline by typing the command:\n\t\tantsAtroposN4.sh -d <image_dimension> -a <t1.nii.gz> -c <number of tissue classes> -o <output>\n\t\t\nOptional arguments for this command are:\n\t\t\tBrain mask: -x <mask.nii.gz>;\n\t\t\tTissue priors: -p <segmentationPriors%d.nii.gz>.\nThis will create a folder with the output including partial volume maps and an extracted brain. Perform visual QC on the GM region as described in Section 8.\nTo generate more tissue classes (GM, subcortical GM, WM, CSF, other, etc.) or perform the segmentation on a cohort showing neural pathology, use specific tissue priors. Download tissue priors from different websites. Alternatively, use a study-specific template to make priors - this is much more complex but can be beneficial, especially in cohorts with pathological brain changes.\n\t\nTo create a study-specific template/priors, first create a study-specific template:\n\t\tantsMultivariateTemplateConstruction.sh -d <image_dimension> -o template <other options> <images.nii.gz>\n\t\t\nOptional arguments for this command are:\n\t\t\t-c: control for parallel computation.\n\t\t\tIf running in serial, use a 0; -j: number of cores; -r: do rigid-body registration of inputs before creating template (default 0) -- 0 == off 1 == on. This is only useful when an initial template is not available.",
    "Download a brainmask and priors from the ANTs website.\n\t\tNOTE: This mask may need to be edited to make sure it is a good approximation of the template brain. The brainmask is one of the most important parts of the pipeline; if it is poor, then brain extraction/Atropos will run poorly. Some of the download options are:\n\t\thttps://figshare.com/articles/ANTs_ANTsR_Brain_Templates?915436.\n\t\tThe downloaded template should then be registered to the study template.\nCalculate the registration, which will output a series of warps that can then be applied to the downloaded template to transform it to study-specific template space. To calculate the registration, use the command:\n\t\tantsRegistrationSyNQuick.sh -d 3 -f template.nii.gz -m downloaded_template.nii.gz -o downloaded_to_template -n 6\n\t\t\nThe options in this command are:\n\t\t\t-d: dimension (i.e., 3D scans would be '3'); -f: fixed image (i.e., the space where the images need to end up); -m: moving image (i.e., the image that needs to be moved); -o: output name (no extension needed); -n: number of threads.\nApply the registration to the data:\n\t\tantsApplyTransforms -d 3 -i downloaded_template.nii.gz -r template.nii.gz -o downloaded_to_template.nii.gz -t downloaded_to_template1Warp.nii.gz -t downloaded_to_template0GenericAffine.mat.\n\t\t\nThe options in this command are:\n\t\t\t-d: dimension (i.e., 3D scans would be '3'); -i: input image (i.e., the image that needs to be moved); -r: reference image (i.e., the reference image defines the spacing, origin, size, and direction of the output warped image); -o output name, this is the downloaded template in the study-specific template space (extension needed in this case); -t transform file name, the output file from the registration calculation.\nVisually check the registration for correspondence between the study-specific template and downloaded template (to do this, open the study-specific template on top of the downloaded template).\nIf the registration has worked, apply the transformation to the downloaded priors and extracted template brain, repeating step 6.2.5.",
    "NOTE: Following these steps, there will be a study-specific template, a downloaded template aligned with the study-specific template, along with a downloaded brain extraction mask and tissue priors also aligned with the study-specific template.\nRun the study specific template through antsCorticalThickness.sh; this provides GM, WM, and CSF regions that can be used for study-specific priors:\n\t\tantsCorticalThickness.sh -d 3 -a template.nii.gz -e downloaded_to_template.nii.gz -m downloaded_binarised_template_extracted_brain_in_studyspace.nii.gz -p downloaded_labelsPriors%d.nii.gz -o CT_template\n\t\t\nThe options in this command are:\n\t\t\t-d: dimension (i.e., 3D scans would be '3'); -a: image to be segmented (in this case, the study-specific template); -e: brain template (not skull stripped; in this case, the downloaded template that has been registered to the study-specific template); -m: downloaded brain extraction mask (in this case, the extracted brain from the downloaded template that has been registered to the study-specific template); -p: priors specified using c-style formatting (e.g., -p labelsPriors%02d.nii.gz).\n\t\t\tNOTE: The command assumes that the first four priors are ordered as follows: 1: CSF, 2: cortical GM, 3: WM, and 4: subcortical GM (in this case, the priors from the downloaded template that has been registered to the study-specific template).\nRunning this command will result in generated priors for the template, but they need smoothing prior to use in Atropos segmentation. The smoothing command is part of ANTs software. Smooth all priors using the command:\n\t\tSmoothImage 3 CT_template_BrainSegmentationPosteriors2.nii.gz CT_template_BrainSegmentationPosteriors_smoothed.nii.gz\nPrior to running Atropos, run brain extraction on all native space scans. The study-specific template can be used, and extracted brain generated from running antsCorticalThickness.sh on the template (step 6.2.1):\n\t\tantsBrainExtraction.sh -d 3 -a T1.nii.gz -e template.nii.gz -m template_BrainExtractionBrain.nii.gz -o T1_brain.nii.gz\n\t\t\nThe options in this command are:\n\t\t\t-d: dimensions; -a: anatomical image; -e: brain extraction template (i.e., template created, without skull stripping); -m: study specific brainmask used for brain extraction; -o: output prefix.",
    "Then run Atropos:\n\t\tantsAtroposN4.sh -d 3 -a T1.nii.gz -x T1_brain.nii.gz -c 3 -o Atropos_specific_template\n\t\t\nThe options in this command are:\n\t\t\t-d = dimensions; -a: anatomical image; -x: brain extraction mask generated from the brain extraction; -c: number of tissue classes to segment; -o: output prefix; -p: study-specific segmentation priors <segmentationPriors%d.nii.gz>\nPerform visual QC on the GM region as described in Section 8.\n7. Segmentation via MALP-EM\nTo run MALP-EM, open a terminal window, change the directory into the MALP-EM install directory and type:\n\t./malpem-proot -i T1_scan.nii -o ./ -m optional_brain_mask_final.nii.gz -f 3T -t 6 -c\nOnce the command has been completed, check that there is an output folder with tissue classes and regional segmentations.\nPerform visual QC on the GM as described in Section 8.\n8. Visual Quality Control\nNOTE: Visual quality control should be performed on all segmented regions to be used in the analysis. Quality control ensures that the segmentations are of a high standard and represent reliable segmentation of the CGM. To perform quality control, each scan is opened and overlaid on the original T1 to compare the generated region to the CGM visible on the scan.\nSPM, FSL, ANTs, and MALP-EM Segmentations\nPerform visual QC using FSLeyes:\n\t\thttps://users.fmrib.ox.ac.uk/~paulmc/fsleyes_userdoc/\n\t\tNote: FSLview (an older viewer) can also be used in the same way.\nOpen a terminal window and open the T1 and the GM regions overlaid on the T1. To do this, type:\n\t\tfsleyes T1.nii Region1.nii Region2.nii.\nOnce FSLeyes opens, use the opacity toggle on the top pane to adjust/reduce the opacity and allow visualisation of the T1 image underneath the GM region. Change the color of the segmentation overlay via the 'color dropdown tab' in the top pane.\nScroll through every slice in the brain.",
    "NOTE: Here this is done using the coronal view, but users should use the view that they have most experience with.\nCheck every slice for regions of under- or over-estimation of the region being inspected.\n\t\tNOTE: See the representative results section for examples of good and bad segmentations.\nFreeSurfer QC\nPeform visual QC using FreeView.\n\t\tNOTE: Refer to the documentation here:\n\t\thttps://surfer.nmr.mgh.harvard.edu/fswiki/FreeviewGuide/FreeviewGeneralUsage/FreeviewQuickStart.\nOpen a terminal window. To view the volumetric GM region overlaid on the T1, change directory to the subject folder and type:\n\t\tfreeview ./mri/T1.mgz ./mri/aparc+aseg.mgz:colormap=lut:opacity:.3\nScroll through every slice in the brain.\n\t\tNOTE: Here this is done using the coronal view, but users should use the view that they have most experience with.\nCheck every slice for regions of under- or over-estimation of the region being inspected.\n\t\tNOTE: See the representative results section for examples of the segmentations.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}