{
  "id": 17913,
  "origin_website": "Jove",
  "title": "Preparation Of Gushukang (GSK) Granules for In Vivo and In Vitro Experiments",
  "procedures": [
    "All of the experimental procedures were performed with the approval of Institutional Animal Care and Use Committee of the Shanghai University of TCM (SZY201604005).\n1. Preparation and administration of GSK working solution\nCalculate the equivalent doses of GSK granules for mouse.\n\t\nCalculate body surface based on the Meeh-Rubner equation15: body surface = K x (body weight2/3)/1000, where the K values are 10.6 for human and 9.1 for mouse. Assuming a human body weight of 70 kg, then human body surface (m2) = 10.6 x (702/3)/1000 = 1.8 m2. Assuming a mouse body weight of 20 g (0.02 kg; e.g., 1 month old, female, C57/BL6), then mouse body surface (m2) = 9.1 x (0.022/3)/1000 = 0.0067 m2.\nBased on the calculated body surface, calculate the body transform ratio for human and mouse. Human: 70 kg/1.8 m2 = 39. Mouse: 0.02 kg/0.0067 m2 = 3. GSK granule = 20 g/70 kg x 39/3 = 3.72 g/kg ≈ 4 g/kg.\nBased on a body weight of 20 g per mouse, calculate the equivalent dosage for mouse: 4 g/kg x 0.02 kg = 0.08 g.\nCalculate three equivalent doses of GSK granules based on 20 mice per group and an intervention lasting for 3 months (90 days): (1) GSKL (OVX + low-dose GSK granules [2 g/kg/day]): 0.04 g mouse/day x 20 mice x 90 days = 72 g. (2) GSKM (OVX + medium-dose GSK granules [4 g/kg/day]): 0.08 g mouse/day x 20 mice x 90 days = 144 g. (3) GSKH (OVX + high-dose GSK granules [8 g/kg/day]): 0.12 g mouse/day x 20 mice x 90 days = 216 g.\n\t\tNOTE: Prepare an additional 20% of GSK granules in practice to offset the loss.\nCalculate the volume of GSK granule per mouse based on the body weight15: e.g., volume (V) = 0.24 mL/mouse/day.",
    "NOTE: The volume for intragastric administration for mouse is 0.12 mL/10 g.\nWeigh 10-days’ worth of three doses of GSK granules. Weigh 8 g, 16 g, and 24 g of GSK granules and serve as GSKL, GSKM, and GSKH, respectively.\nCalculate the equivalent dose of calcium carbonate with vitamin D3 (CAL) for mouse based on the Meeh-Rubner equation15 as in steps 1.1.1 and 1.1.2: CAL dosage = 2 tablet/70 kg x 39/3 = 0.372 tablet/kg ≈ 0.4 tablet/kg.\nBased on a body weight of 20 g per mouse (e.g., 1 month old, female, C57/BL6), calculate the equivalent dosage of CAL for mouse: 0.4 tablet/kg x 0.02 kg = 0.008 tablet. Then calculate the equivalent dose of CAL based on 20 mice per group and an intervention lasting for 3 months (90 days): 0.008 tablet x 20 x 90 = 14.4 tablets. Weigh 10-days’ worth of CAL (1.6 tablets).\nDissolution\nPlace 8 g of GSK granules into a 50 mL tube. Add 48 mL of saline and shake tube to completely dissolve.\n\t\tNOTE: The standard for complete dissolution is the absence of sediment. Complete dissolution can be further confirmed if a gavage needle can draw up the working solution and then expel it smoothly.\nRepeat step 1.5.1 with 16 g and 24 g of GSK granules.\nPlace 1.6 tablets (10-days’ worth) of CAL into a 50 mL tube. Add 48 mL of saline and shake tube to completely dissolve.\n\t\tNOTE: The working solutions can be stored at -4 °C and prepared every 10 days.\nIntragastric administration\nGrasp the back of the mouse (1 month old, female, C57/BL6) with the mouse facing forward and ensure that it stays firmly in that position. Keep the mouse calm for 2−3 min before administration.",
    "NOTE: Ensure that the researcher can clearly see the front of the mouse. Wear gloves to prevent mouse bites, particularly for new researchers.\nPlace the gavage needle (size: #12, 40 mm) in the working solution of GSK granules and draw 0.24 mL of the working solution.\nPut the gavage needle into the mouse through one side of its mouth until the gavage needle reaches the stomach.\n\t\tNOTE: To confirm the gavage needle has reached the stomach: (1) The gavage needle encounters the feeling of resistance. Meanwhile, the mouse shows the action of swallowing before the gavage needle passes the physical narrowing of the esophagus. (2) Inject approximately 0.5 mL of the working solution into the mouse and wait for 1 min. If there is no solution coming out of the mouse, this means that the gavage needle has reached the stomach.\nInject the working solution of GSK granule (0.24 mL/mouse) into the stomach and then draw out the gavage needle. Return the mouse into its cage.\nRepeat step 1.6.4 with the CAL solution and inject 0.24 mL of CAL solution per mouse.\n\t\tNOTE: The volume of CAL solution is calculated as in step 1.2.\n2. Micro-CT scanning\nTibia harvesting and preparation\nIntraperitoneally anesthetize mouse with 300 mL/100 g of 80 mg/kg ketamine the day following the 90 day’s intervention. Use a needle pinch of the toes to confirm whether the mouse is completely anesthetized. No response indicates successful anesthesia. Then kill the mouse with cervical dislocation.\nFix the mouse with both the arms and legs on foam with tacks.\nCut off the skin with scissors (size: 8.5 cm) and tweezers (size: 10 cm) of the legs from the proximal to the distal end and then harvest tibias.\nImmediately put the tibias into 70% ethyl alcohol and wash for 3 times.",
    "Wrap the left tibia of the mouse with sponge foam and put it into a sample tube (35 mm diameter, 140 mm length).\n\tNOTE: The long axis of the specimen should be along with that of the sample tube. Ensure the proximal end of the tibia points upwards.\nRunning the micro-CT 80 scan machine\nStart the micro-CT 80 scan machine at room temperature.\nSet the sample tube into micro-CT 80 and start cross-section scanning with the following scanning parameters: pixel size 15.6 μm, tube voltage 55 kV, tube current 72 μA, integration time 200 ms, spatial resolution 15.6 μm, pixel resolution 15.6 μm, and image matrix 2048 x 2048.\n\t\tNOTE: The cancellous bone is distinguished from the cortical bone by pre-scanning. The scan area of the tibia is defined as the cancellous bone area from 5 mm below the tibial plateau to the distal end.\nQuantification of bone parameter\nAfter completing cross-section scanning, obtain the images of the left tibias.\nSet the density threshold to 245−1000. Use the micro-CT evaluation program V6.6 to measure the following bone parameters: bone mineral densities (BMD), bone volume over total volume (BV/TV), trabecular bone number (Tb.N), trabecular bone thickness (Tb.Th), as well as bone trabecular bone separation (Tb.Sp).\n3. Preparation of blood serum for in vitro experiments\nCalculation\nBased on a rat body weight of 0.2 kg (1 month old, female, Sprague-Dawley), calculate the dosage of GSK granule: human dosage/day x body weight of human x K/body weight of rat = 20 g/70 kg/day x 70 kg x K (K = 0.018) /0.2 kg = 2 g/kg/day.\n\t\tNOTE: K is the pharmacological transformation coefficient between human and mouse15 (K = 0.018).\nRepeat step 3.1.1 and calculate the following dosages.",
    "Calculate dosage of GSKL: 10 g/70 kg/day x 70 kg x K/0.2 kg = 1 g/kg/day.\nCalculate dosage of GSKM: 20 g/70 kg/day x 70 kg x K/0.2 kg = 2 g/kg/day.\nCalculate dosage of GSKL: 40 g/70 kg/day x 70 kg x K/0.2 kg = 4 g/kg/day.\nCalculate dosage of CAL: 2 tablet /70 kg/day x 70 kg x K/0.2 kg = 0.2 tablet/kg/day.\nCalculate the total dosage of GSK granule and CAL.\n\t\t\nCalculate the total dosage for GSKL: 1 g/kg/day x 0.2 kg x 6 rats x 3 days = 3.6 g.\nCalculate the total dosage for GSKM: 2 g/kg/day x 0.2 kg x 6 rats x 3 days = 7.2 g.\nCalculate the total dosage for GSKH: 4 g/kg/day x 0.2 kg x 6 rats x 3 days = 14.4 g.\nCalculate the CAL dosage = 0.2 tablet/kg/day x 0.2 kg x 6 rats x 3 days = 0.72 tablet.\n\t\t\tNOTE: A total of 10 mL of GSK granule-containing serum is needed to prepare 100 mL culture medium (20% GSK granule-containing serum). Each rat (6 rats/group) is expected to provide 1.5−2 mL of GSK granule-containing serum after centrifugation.\nCalculate the volume of GSK granules applied per rat based on body weight15: e.g., volume (V) = 2 mL/rat/day.\n\t\tNOTE: The volume for intragastric administration for rat is 0.1 mL/10 g.\nWeigh 3-days’ worth of three doses of GSK granules. Weigh 3.6 g, 7.2 g, and 14.4 g of GSK granules and serve as GSKL, GSKM, and GSKH, respectively. Weigh 0.72 tablet for the CAL group.\nPlace 7.2 g of GSK granules into a 50 mL tube. Add 36 mL of saline and shake tube to completely dissolve. Repeat this with 3.6 g and 14.4 g of GSK granules.",
    "Repeat section 1.6 for intragastric administration with 2 mL of GSK working solution.\n\tNOTE: Administer the same volume of saline (2 mL per rat) to prepare serum and serves as a blank control group for in vitro assays.\nPreparation of the GSK-containing serum \nIntraperitoneally anesthetize the rats with 300 mL/100 g of 80 mg/kg ketamine 1 h after the last administration of GSK granules. Use a needle pinch of the toes to confirm whether the rat is completely anesthetized. No response indicates successful anesthesia.\nExpose the abdomen to the bottom of the thorax of rats using straight operating scissors after incising the skin and peritoneum.\n\t\tNOTE: The surgical instrument must be sterilized at high temperatures and high pressures prior to use. The surgical area must be sterilized with 70% ethanol during blood collection.\nRemove the connective tissue of the abdominal aorta with tissue paper to expose the vessel clearly.\nDraw blood from the abdominal aorta using a 10 mL, 22 G syringe. Then remove the needle and transfer the blood to a 15 mL sterile tube. Usually, 6−8 mL of blood can be obtained from one rat.\n\t\tNOTE: Each rat must be kept living when drawing blood. One indicator is that the abdominal aorta pulsates when the rat is alive. The rat is dead after blood draw.\nKeep the tube upright at room temperature for 30−60 min until the blood is clotted in the tube. Then centrifuge the tube at 500−600 x g for 20 min. Transfer all the supernatant (serum) from one group (6 rats) to one 50 mL sterile tube and shake to mix.",
    "Inactivate the serum by incubating in a 56 °C water bath for 30 min. Filter the serum using a 0.22-μm-pore-size hydrophilic polyethersulfone syringe filter. Store at -80 °C for long-term usage (less than 1 year).\n\t\tNOTE: The filtered serum can be used for in vitro osteoclastogenesis and osteoblastogenesis.\nApplication\nIn vitro osteoclastogenesis\nDilute the three dosages of the GSK-containing serum (GSKL, GSKM, GSKH) at the ratio of 1:4 with minimum Eagle’s medium (α-MEM) containing L-glutamine, ribonucleosides, and deoxyribonucleosides.\n\t\t\tNOTE: Ensure that the final concentration of GSK-containing serum for in vitro osteoclastogenesis and osteoblastogenesis is 20%.\nAdd the diluted GSK-containing serum (200 μL/well) from step 3.6.1.1 to bone marrow macrophages (BMMs) from 4−6 week old C57BL/6 mice for osteoclastogenesis and stimulate BMMs with macrophage colony-stimulating factor (M-CSF, 10 ng/mL) and receptor activator for nuclear factor-κB ligand (RANKL, 100 ng/mL) as previously described2.\nIn vitro osteoblastogenesis\nRepeat step 3.6.1.1.\nAdd the diluted GSK-containing serum (2 mL/well) to bone mesenchymal stem cells (BMSCs) from 4−6 week old C57BL/6 mice to generate osteoblast as previously described16.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}