{
  "id": 3672,
  "origin_website": "Cell",
  "title": "Profiling of mouse macrophage lipidome using direct infusion shotgun mass spectrometry",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nDifferentiating bone marrow-derived macrophages (BMDMs)\nTiming: 1–1.5 h for bone marrow preparation, 6 days for differentiation\nThis section covers the differentiation of bone marrow-derived macrophages (BMDMs).\nSet up a clean workbench with an isoflurane chamber, dissection tray (a piece of polystyrene foam covered with aluminum foil), and two beakers containing water and 70% ethanol (Figure 1[href=https://www.wicell.org#fig1]A). Clean all the tools with 70% ethanol (EtOH). Place a 50 mL centrifuge tube on a rack and filled with 30 mL of ice-cold PBS for bone collection.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/359-Fig1.jpg\nFigure 1. Extraction of bone marrow for macrophage differentiation\nSacrifice mice in prepared isoflurane containing chamber (5% isoflurane concentration) with lid covered for about 5 min. An appropriate alternative method is euthanasia by CO2 asphyxiation. In both cases, cervical dislocation may be used as a secondary means to assure the death of the animal. Assess the death of the animal by and lack of lack of heartbeat and by pedal reflex (firm toe pinch). Sacrificing and assessing the death of the animal should follow ethical guidelines as published by individual institution. Spray the deceased animal with 70% EtOH and place in dissection tray. Secure limbs to tray with 25G x 5/8 inch needles (Figure 1[href=https://www.wicell.org#fig1]B).\nThe skin, fur, and muscle are removed first to facilitate the bone collection. Isolate the femur and tibia using a pair of tweezers and scissor. Use tweezers to grasp bone, and if necessary, cut away excess tissue from around the ends of the bone. Avoid cutting or breaking the femurs. Cut down each leg along the separated skin with the foot still attached to the leg (Figure 1[href=https://www.wicell.org#fig1]C). Remove the foot and place the leg in the PBS-filled centrifuge tube (Figure 1[href=https://www.wicell.org#fig1]D).",
    "Critical: Breaking the bones during this stage of isolation will expose sterile bone marrow to the open air. This will increase the chance of bone marrow losses and contamination.\nInside the tissue culture hood, fill a 10 mL syringe with 10 mL of ice-cold PBS and attach a 26G x 5/8 inch needle. One syringe per leg is recommended for maximum bone marrow recovery (Figure 1[href=https://www.wicell.org#fig1]E). Place the legs on a sterile 10 cm tissue culture dish. It will be necessary to cut the distal end of the tibia in order to flush the marrow.\nPlace the isolated femur and tibia on a separate 10 cm tissue culture dish (Figure 1[href=https://www.wicell.org#fig1]F).\nPlace a 40 μM cell strainer on a 50 mL centrifuge tube. Pierce bone at the ends with syringe and flush bone with PBS into the cell strainer (Figure 1[href=https://www.wicell.org#fig1]G). Bones should be flushed until they become a translucent white color. Each bone should require between 3 – 5 mL of PBS.\nRinse the cell strainer with 5 mL of ice-cold PBS for maximum bone marrow recovery.\nSpin down the bone marrow at 365 × g for 7 min at room temperature (RT, 20°C) and aspirate off the PBS (Figure 1[href=https://www.wicell.org#fig1]H).\nResuspend the bone marrow in 3 mL of red blood cell (RBC) lysis buffer (see Key resources table[href=https://www.wicell.org#key-resources-table]) and place at RT for 3 min. Neutralize the RBC lysis buffer by adding 7 mL of ice-cold PBS.\nSpin down the bone marrow at 365 × g for 5 min at RT.",
    "Aspirate off the PBS and resuspend the bone marrow in 20 mL of BMDM medium for cell counting. Use a hematocytometer or an automated cell counter to determine the number of live macrophages. Cells can be stained with trypan blue for cell counting with a hematocytometer. Live cell count can be assessed with an automated cell counter using the acridine orange (AO) and propidium iodide (PI) dyes.\nTo prevent macrophages from overgrowing by day 6 of differentiation, seed 16 – 20 million monocyte precursors per 15 cm tissue culture-treated culture dishes for differentiation (Figure 2[href=https://www.wicell.org#fig2]A). Add 25 mL of macrophage media per dish.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/359-Fig2.jpg\nFigure 2. Stages of macrophage differentiation and plating density\nCritical: The optimal plating density during the initial stage of macrophage differentiation can be varied due to the choice of reagents. Growth rates of the cells in culture should be empirically assessed. Figure 2[href=https://www.wicell.org#fig2] provides an example of expected confluency of a standard macrophage culture prep.\nOn day 4 of macrophage differentiation (Figures 2[href=https://www.wicell.org#fig2]B and 2C), change the medium by aspirating 20 mL of spent macrophage media and replacing with 20 mL of fresh macrophage media.\nCritical: Do not completely aspirate off all the old macrophage media during refeeding. Complete aspiration of media will impact cell viability and proliferation.\nMacrophage plating for lipidomics experiment\nTiming: 1.5–2 h\nThis section covers plating of BMDMs for lipidomics experiments.\nOn day 6, remove 23 mL of macrophage media and replenish it with 15 mL of fresh media (Figures 2[href=https://www.wicell.org#fig2]D and 2E).\nTilt the plate on an angle without spilling the medium and gently scrape the tissue culture plate with cell lifters.",
    "Transfer the macrophages into a 50 mL centrifuge tube. Use a serological pipette to pipette the cell suspension to ensure cell dissociation. Use a hematocytometer or an automated cell counter to determine the number of live macrophages. Macrophages should be relatively similar in sizes.\nUsing a P1000 micropipette, pipette 9 × 105 BMDMs into each well of a 6 well plate. Top-up the media to a total of 2 mL per well. Disperse the cell equally by gently rocking the plate back and forth.\nCritical: Plating consistency and density is important for subsequent cell number assessment and sample collection. It is highly recommended to use micropipettes rather than pipette-aid for cell plating (Figures 2[href=https://www.wicell.org#fig2]F–2H).\nPlace the plates on a flat surface in a 5% CO2 incubator at 37°C.\nActivation of BMDM\nTiming: 1–1.5 h\nThis section covers plating of BMDMs for lipidomics experiments.\n48 h post-plating, visually inspect individual wells to ensure all wells have reached 85% to 90% confluency (Figure 2[href=https://www.wicell.org#fig2]F). Figures 2[href=https://www.wicell.org#fig2]G and 2H illustrate suboptimal cell density due to improper plating.\nWarm up the BMDM experimental media 15 min prior to macrophage treatment.\nLabel 50 mL centrifuge tubes. Pipette 20 mL of macrophage experimental media to each tube.\nAdd the stimuli or vehicle controls (e.g., TLR ligands) into the labeled tubes. Vortex the tubes to ensure proper mixing.\nAfter aspirating the media, use a P1000 micropipette to transfer 2 mL of the experimental media containing the appropriate stimulus to each well. Gently rock the plate to ensure proper mixing.\nCritical: Rather than using a pipette-aid, using a P1000 micropipette to transfer the stimuli to each well will improve consistency.\nPlace the plates on a flat surface in a 5% CO2 incubator at 37°C.\nImaging for cell count and sample collection\nTiming: 4–6 h",
    "This section details live cell imaging for cell count and the collection of lipidomics samples.\nPrior to live cell staining for cell counts, visually inspect each well under the microscope. Figures 3[href=https://www.wicell.org#fig3]A and 3B shows the ideal density for imaging and collection. Figures 3[href=https://www.wicell.org#fig3]C–3F show suboptimal confluency for lipidomics sample collection due to initial plating issues.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/359-Fig3.jpg\nFigure 3. Effects of plating density on cell count\nTo image the plate for live cell count, stain each well with 1.25 mM Calcein-AM dissolved in DMEM (final centration 1.45 μM). Calcein staining allows the identification of live cells within a well. The plates are then imaged on a Molecular Devices ImageXpress XL instrument. 20 high magnification fluorescence images were captured for sections of each well (covering 24% of total well surface area of a 6 well) using a 10× objective (Nikon Plan Fluor, 0.3 NA). Total live cell number was assessed with MetaXpress Software with Powercore using the Multi-wavelength cell scoring module. (see Materials and equipment[href=https://www.wicell.org#materials-and-equipment] for alternative imaging devices compatible with Calcein-AM staining).\nPrior to sample collection, pre-chill all the glass tubes, PBS and collection tube rack (Figure 4[href=https://www.wicell.org#fig4]A). Samples can be collected directly into Kimble tubes (direct storage) or glass tubes (stored in the aluminum tube rack). Two wells of cells were combined as a single replicate (Figure 2[href=https://www.wicell.org#fig2]B). After removal of culturing media, 1 mL of ice-cold PBS was added into each well and cells were scraped with cell lifters and spun down in glass tubes or 10 mL Kimble tubes (Figures 4[href=https://www.wicell.org#fig4]B and 4C). Collected samples are spun at 365 × g for 10 min at 4°C (Figure 4[href=https://www.wicell.org#fig4]D).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/359-Fig4.jpg\nFigure 4. Lipidomics sample collection",
    "Critical: After aspirating the media, do not perform additional washes to remove residual media using PBS. Additional washes of cells will substantially reduce sample quality and detection sensitivity. Scraping and collecting cells should be conducted on ice.\nAspirate the PBS and the tubes can be snap frozen for −80°C storage (up to 6 months as tested) or proceed directly for lipid extraction (Figure 4[href=https://www.wicell.org#fig4]E).\nLipid extraction\nTiming: 6–8 h\nThis section of the protocol covers Bligh and Dyer lipid extraction for subsequent lipidomics analysis using the Sciex Lipidyzer Mass Spectrometry Platform (Bligh and Dyer, 1959[href=https://www.wicell.org#bib1]). The protocol is a modified version of the Serum Extraction Protocol published in the Lipidyzer Platform user guide (Sciex, 2016[href=https://www.wicell.org#bib5]). For internal standard preparation, see Chemical preparations of the Lipidyzer Platform user guide (Sciex, 2016[href=https://www.wicell.org#bib5]) and (Ubhi, 2018[href=https://www.wicell.org#bib7]).\nCritical: Do not use plasticware to transfer organic solutions of lipids. Glassware (including serological and Pasteur pipettes) should be used throughout the entire lipid extraction process to minimize polyethylene glycol (PEG) and fatty acids contamination (Yao et al., 2016[href=https://www.wicell.org#bib8]).\nWarm frozen cell pellet for 30 min to ambient temperature by placing them on a clean bench top (Figure 5[href=https://www.wicell.org#fig5]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/359-Fig5.jpg\nFigure 5. Bligh and Dyer lipid extraction\nTo each Kimble tube contain the sample add, 0.9 mL of water, 2 mL of methanol, and 0.9 mL of dichloromethane in that order.\nAdd 0.1 mL of the Lipidyzer Internal Standard Mixture to the extracts. Addition of the internal standard mixture helps correct for variation in the extraction efficiency (Figure 5[href=https://www.wicell.org#fig5]B). See Materials and equipment[href=https://www.wicell.org#materials-and-equipment] for alternative internal standards.\nInvert the 10 mL Kimble tubes 4 to 8 times.\nCritical: Over mixing/vortexing samples at this stage will lead to poor phase partitioning (Figure 5[href=https://www.wicell.org#fig5]D).",
    "The extracts are then set on the benchtop at room temperature for 30 min (Figure 5[href=https://www.wicell.org#fig5]C).\nAn additional 1 mL of water and 0.9 mL of dichloromethane are added to the extracts.\nThe extracts are inverted 4 to 8 times and then centrifuged at 1,200 × g for 10 min at room temperature to separate the extract into a bilayer (Figure 5[href=https://www.wicell.org#fig5]D).\nThe bottom organic layer is transferred using a glass Pasteur pipette to a new 10 mL Kimble tube for each extract.\nCritical: It is important to take the lower phase with as little upper phase and interface material as possible.\nTo increase the amount of lipids that can be extracted, add another 1.8 mL of dichloromethane to the original extract Kimble tubes.\nThe original extracts are inverted 4 to 8 times and centrifuged at 1,200 × g for 10 min at room temperature to separate the extract into a bilayer.\nThe bottom layers are taken again and added to the previous aliquots in step 35.\nKimble tubes containing organic bottom layers are capped and gently vortexed for 3 to 5 s. This will help separate any residual unwanted material (from the upper layers) from desired bottom layer by trapping material onto upper glass tube walls.\nThe combined bottom layers for each sample are dried using an EZ-2 Elite evaporator (low boiling point, heat off, room temperature, fixed speed) and reconstituted in 0.25 mL of the lipidomics running solution (dichloromethane [50]:methanol [50] with 10 mM ammonium acetate). Alternatively, samples can be dried using a nitrogen evaporator.\nBriefly vortex the Kimble tubes. Gently pipette the mixture up and down using a glass Pasteur pipette to wash off samples stuck onto the tube.\nUse glass Pasteur pipettes to transfer samples to 1 mL Robovials with 100 μL fixed glass insert.",
    "Centrifuge the Robovials in 931 × g for 10 min at 10°C before loading into autosampler for Lipidyzer mass spectrometry analysis."
  ],
  "subjectAreas": [
    "Immunology",
    "Metabolism",
    "Cell Culture",
    "Mass Spectrometry",
    "Model Organisms",
    "High Throughput Screening"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}