{
  "id": 15156,
  "origin_website": "Jove",
  "title": "Intraventricular Transplantation of Engineered Neuronal Precursors for In Vivo Neuroarchitecture Studies",
  "procedures": [
    "All methods and procedures described here have been approved by the SISSA Organismo preposto al Benessere Animale (SISSA IACUC).\n1. Generation of engineered \"green\" progenitor pools\nPreparation of the \"green\" pool\nMate a wild-type CD1 female with a MtaptEGFP/+ founder16. Euthanize the pregnant dam by cervical dislocation at 12.5 days post-coitum (day 0 is determined by vaginal plug inspection) and harvest the embryonic day 12.5 (E12.5) embryos. Set them in individual wells of a 24 multiwell plate in cold PBS solution.\nQuickly genotype the embryos by visual inspection under a blue light lamp, checking for green fluorescence emission in the brains.\nPlace the \"green\" embryos into a 10 cm diameter Petri dish filled with cold 1x PBS with 0.6% glucose and transfer it to under a stereomicroscope.\nCut the embryo heads using standard scissors and extract the telencephalon from them by means of #3 and #5 forceps.\nSeparate the two telencephalic vesicles and dissect out the neocortices using forceps; make sure to remove the hippocampus and the basal ganglia17.\nCollect neocortices by transferring them with a P1000 pipette into a 1.5 mL tube kept on ice.\nLet the dissected neocortices settle to the bottom of the tube.\nAspirate the supernatant as much as possible.\nResuspend the neocortices in 400 µL of fresh proliferative medium [DMEM-F12, 1x Glutamax, 1X N2, 1 mg/mL bovine serum albumin (BSA), 0.6% glucose, 2 µg/mL heparin, 20 ng/mL basic fibroblast growth factor (bFGF), 20 ng/mL epidermal growth factor (EGF), 1X pen-strep, and 10 pg/mL amphotericin B].\nGently pipette the neocortices up and down, sequentially with P1000, P200, and P20 tips, 4x per tip, to obtain a cloudy cell suspension.\n\t\tNOTE: E12.5 neocortical tissue is very soft; dissociating it to single cells does not require enzymatic digestion at all; repeated pipetting is sufficient.",
    "Let the meninges and residual neocortical clumps settle down for 2 min.\nTransfer 150 µL from the top of the cell suspension (mainly containing single cells) into a new 1.5 mL sterile tube.\nAdd 150 µL of fresh proliferative medium and repeat steps 1.1.10-1.1.12 until no more tissue clumps are evident. While doing this, omit the P1000 pipetting step (in step 1.1.10).\n\t\tNOTE: Three iteration of steps 1.1.10-1.1.12 are usually sufficient to achieve full tissue dissociation.\nCount cells (\"green\" pool) with the trypan blue exclusion method in a Bürker chamber17 and add fresh proliferative medium to adjust the concentration to 103 cells/µL.\n\t\tNOTE: Steps 1.1.7-1.1.14 must be performed under a sterile laminar flow hood disinfected by 70% ethanol and kept ventilated for at least 20 min.\nEngineering the \"green\" sub-pools\nSubdivide the \"green\" pool into two sub-pools in two distinct 1.5 mL tubes for lentiviral infection.\nInfect the sub-pools independently with the two dedicated lentiviral mixes. Each mix contains \"red label\" virus (Pgk1_mCherry) or \"black\" virus (pCAG_lacZ) as a control, as well as viruses for tetOFF driven transgene (Pgk1p_tTA and TRE_transgene) or control (Pgk1p_tTA and TRE_PLAP) expression.\n\t\tCAUTION: Manipulate lentiviruses in a BLS-2 environment with all the protective measurements prescribed by applicable rules and laws.",
    "NOTE: Each lentivirus must be administered at a multiplicity of infection (MOI) of 8, which (as previously shown14) is sufficient to transduce the vast majority of neural cells in such experimental conditions (Figure 1). The lentivirus harboring tet transactivators can be built by employing different neuronal promoters driving tTA/rtTA expression (e.g., pTα1, pSyn, pCaMKII, pGAD1, etc.) (Figure 2). The MOI is the ratio of (a) the number of infectious viral particles delivered to (b) the number of their target cells. Here, the former (a) is calculated according to the conventional procedure described elsewhere14, the latter (b) is simply evaluated using a Bürker chamber.\nPlate 600,000 cells of each infected sub-pool per well of a 12 multiwell plate, in 600 µL of proliferative medium with 2 µg/mL of doxycycline.\n\t\tNOTE: Here, wells are not pretreated with poly-lysine, which prevents neural cell attachment to their bottoms.\nTransfer cells to the incubator in 5% CO2 at 37 °C.\nAfter 2 days, to assess the efficiency of infection and the differential marking of the engineered pools, inspect the cells under a conventional fluorescent microscope. The two sub-pools must appear as suspensions of small neurospheres, homogenously expressing the red fluorescent protein (\"control\" sample) or not (\"test\" sample). Within these neurospheres, the MtaptEGFP transgene is active limited to a minority of cells (post-mitotic neurons) and silent in the majority of them (proliferating precursors) (Figure 3).\n2. Setting up of the surgical instruments and the operating area\nPreparing borosilicate needles\nUse the borosilicate glass capillaries with external and internal diameter equaling 1.5 mm and 1.12 mm, respectively.\nPull the capillary with a P 1000 puller.",
    "Set up the pulling program. Typical program parameters are: heat = 614; vel = 60; time = 1; pressure = 600. They must be adjusted according to the puller model and the heating resistor employed.\nPlace the capillary into the puller holders and tighten them.\nStart the program and take the two pulled microcapillaries.\nCut the capillary tip by hand, with a scalpel, under the stereomicroscope to obtain a tip with an external diameter of ~200-250 µm.\nPlace the capillaries on a modelling clay (e.g., plasticine) support in a closed Petri dish and transfer it to under the hood.\nSetting up the hood and preparing the cell tracer solution\nClean up the horizontal flow hood carefully and disinfect it using 70% ethanol.\nDisinfect optical fibers using 70% ethanol and place them under the hood.\nMix 10 µL of 125 mM EGTA solution and 10 µL of Fast Green to prepare the \"cell tracer solution\" and place it under the hood.\nCut small pieces (4 cm x 2 cm of size) of laboratory sealing film for cell suspension spotting.\nPrepare a solution of 1 mg/mL sterile doxycycline and aspirate it into a 0.3 mL syringe.\nSwitch on the hood and keep the laminar flow on for 20 min before the operation.\nAssembling the injection tube\nTake a hard-plastic mouthpiece, two latex tubes (each about 30 cm long) and a capillary holder from an aspirator tube assembly kit for calibrated microcapillary pipettes.\nFix the hard-plastic mouthpiece to one end of a latex tube.\nFix the capillary holder to one end of another latex tube.\nConnect the free ends of the two latex tubes with a 0.45 µm sterile filter, as a barrier against operator germs.\nPlace the resulting aspirator tube assembly on a modelling clay holder to be kept under the hood.",
    "3. Cell mix and intraventricular transplantation\nMixing \"test\" and \"control\" green cell sub-pools\nCollect \"test\" and \"control\" neurospheres (see step 1.2.5) in separate 1.5 mL tubes.\nCentrifuge neurospheres suspension at 200 g for 5 min.\nCollect and discard the supernatant, avoiding disturbance of the cell pellet.\nGently resuspend neurospheres in 500 µL of 1x PBS.\nCentrifuge them at 200 g for 1 min.\nRemove the supernatant.\nRepeat steps 3.1.4-3.1.6 two more times.\nGently resuspend spheres in 200 µL of 2x Trypsin solution (2x Trypsin, 1x PBS) and pipette cell pellet up and down 4x-5x.\n\t\tNOTE: Pay attention not to make air bubbles.\nLeave cells in the incubator for 5 min at 37 °C to achieve a single-cell suspension.\nBlock Trypsin with 200 µL of Trypsin inhibitor solution (DMEM-F12, 10 µg/mL DNAse I, 0.28 mg/mL Trypsin inhibitor) by pipetting up and down 4x-5x.\nCentrifuge cells at 200 x g for 5 min and resuspend them in 1 mL of fresh proliferative medium (DMEM-F12, 1x Glutamax, 1x N2, 1 mg/mL BSA, 0.6% glucose, 2 µg/mL heparin, 20 ng/mL bFGF, 20 ng/mL EGF, 1x pen-strep, 10 pg/mL amphotericin B).\nCount cells of the two pools with trypan blue exclusion method in a Bürker chamber.\nAdjust their concentration to 100,000 cells/µL in proliferative medium.\nMix 1:1 \"test\" cells with \"control\" ones.\nCheck the resulting mix under a fluorescence microscope (objective magnification: 10x) to ensure that the mix is a single-cell suspension of the two pools (Figure 3C).\nPlace the mix on ice under the hood.\nIntraventricular transplantation\nPrepare the cage with the mother and the P0 pups on a table far away from the surgical operatory area.\nPlace a recovery cage on a cart close to the hood.",
    "Put a mixture of sawdust taken from the mother's cage on the bottom of the recovery cage and place it under a lamp.\nAside, set an ice box covered by an aluminum foil for the anesthesia of P0 pups.\nJust prior to transplantation, add 1/10 volume of cell tracer solution (from step 2.2.3) to 1 volume of cell suspension (from step 3.1.16) and spot 3 µL of the resulting \"injection mix\" on a piece of laboratory sealing film.\nPlace the pup on the cool aluminum foil for 1 min and check that it is fully anesthetized.\n\t\tNOTE: To confirm anesthesia, gently squeeze a paw and monitor the pup for lack of movements, while still breathing.\nMeanwhile, aspirate the 3 µL of injection mix (from step 3.2.5) into the glass capillary.\nGently wipe the head of the anesthetized pup with 70% ethanol.\nPlace the pup's chin on the tip of the optical fiber to clearly identify the cortical hemispheres.\n\t\tNOTE: At P0-P1, the head skin is very thin, allowing for straightforward visual identification of the hemispheres just above the eyeballs and behind the olfactory bulbs.\nKeep the capillary (loaded as described in step 3.2.7) in either one of the two mid-parasagittal planes (left or right), above the olfactory bulb, and puncture the forehead skin at its intersection with the frontal plane containing the eyeballs centers. Pay attention not to damage blood vessels. Enter the capillary into the frontal cortex and access the ventricular cavity (Figure 4A).\nTo prevent accidental damage of the ganglionic eminence, rotate the needle laterally by 30 degrees, pointing its tip caudal-medial-ward (Figure 4B).\nGently inject the cells into the ventricular cavity and monitor their diffusion by means of Fast Green (Figure 4C).\nWait 5-10 s.",
    "Remove the glass needle taking care not to aspirate the cell suspension and discard it in a suitable disposal bin.\nBefore pup recovery from anesthesia inject 150 µL of doxycycline solution intraperitoneally to keep transgene expression still off after the transplantation.\nAfter the injection, place the pup immediately under the lamp for recovery.\nLeave the pups under the lamp for 5-10 min and, once fully awake, place them in the cage with the mother.\nObserve the operated pups for 2-3 h, to ensure that the mother accepts them.\nSupply the cage with drinking water containing 0.5 mg/mL doxycycline and 50 g/L sucrose to maintain transgene expression off.\nReplace the doxycycline-containing water by doxy-free water 4 days after transplantation, thus activating the transgene in post-mitotic neurons. Keep mice in a doxy-free regime for 6 days and euthanize them at P10 by carbon dioxide inhalation followed by decapitation.\n4. Analysis of transplanted brains\nHistology and immunofluorescence\nEuthanize the transplanted pups 10 days after cell transplantation by carbon dioxide inhalation followed by decapitation. Fix brains of euthanized pups in 4% paraformaldehyde (PFA) at 4 °C overnight.\n\t\tCAUTION: PFA is highly toxic; handle it with care, strictly complying with manufacturer's prescriptions, under a chemical fume hood; discard PFA solution residual in a labeled waste container.\nRemove the PFA solution and replace it with 30% sucrose solution.\nLeave the brains at 4 °C or until they sink to the vial bottom.\nTransfer the brains into a disposable embedding mold approximately half-filled with cryo-inclusion medium.\nFreeze the included brains at -80 °C.\nCut 60 µm thick coronal sections using a cryostat.\n\t\tNOTE: Avoid employing thinner sections, as this may result in unacceptable loss of information regarding the whole architecture of single neurons.",
    "Process sections for immunofluorescence18,19, using anti-GFP [1:400] and anti-RFP (mCherry) [1:500] antibodies. Counterstain nuclei with 1 mg/mL DAPI solution [1:200].\nMorphometry\nSet working parameters of the confocal microscope as follows: z-stack height = 40 µm; step = 2 µm.\nCollect pictures of immunoassayed slices selecting GFP positive neuron-rich photographic fields, blind of RFP signal distribution.\nExport the images as .nd2 files.\nGenerate maximum Z-projections of them as .tiff files (Figure 5A).\nTo allow for sub-sequential neuronal skeletonization blind to cells genotype, hide the red signal. To do so, open each .tiff file by a suitable software and add an adjustment layer. Select \"levels\", \"red\", then set \"output\" to zero. Save the file as such.\n\t\tNOTE: Skeletonization is subsequently performed by a new operator who had no previous access to original plain red files.\nFor each hidden red file, add a drawing layer to the primary image and select the pencil tool (white color). Trace the soma on the basis of GFP signal, then trace the neurites.\n\t\tNOTE: the pencil tool may be set at 40 pixels for the soma and at three pixels for neurites.\nSave the multilayer file including neuronal silhouettes (Figure 5B).\n\t\tNOTE: Subsequent analysis of neuronal skeleton can be performed by either operator.\nCreate a new 1024 x 1024 16-bit grayscale file with black background, one per neuron.\nCopy and paste single neuronal silhouettes from the primary image to the new grayscale file. Get back to multilayer file and switch off the adjustment layer to unveil neuronal genotypes. Save the 16-bit grayscale file annotating the corresponding neuronal genotype.\nImport grayscale images in ImageJ one by one and analyze skeletons by NeurphologyJ plugin of ImageJ software20 (Figure 5C).",
    "Copy NeurphologyJ primary data (neurite_length, attachment_points and endpoints; for each, take \"Total Area\" values), paste them into a spreadsheet and employ them to compute secondary morphometric parameters (average neurite length, branching index) (Figure 5D).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}