{
  "id": 15116,
  "origin_website": "Jove",
  "title": "Semiconductor Sequencing for Preimplantation Genetic Testing for Aneuploidy",
  "procedures": [
    "Ethical approval was granted by the Joint Chinese University of Hong Kong―New Territories East Cluster Clinical Research Ethics Committee (Reference Number: 2010.432). Research license was approved by the Council on Human Reproductive Technology of Hong Kong (Number R3004).\n1. Whole genome amplification\nPrior to start, check the volume of magnetic beads (Table of Materials) to ensure that there is no less than 135 µL (with a 20% excess) for each sample. Keep the magnetic beads at room temperature (RT) for at least 30 min. Prepare 720 µL (with a 20% excess) of 70% ethanol for each sample. Equip a thermal cycler (Table of Materials) with heated lid at 105 °C.\n\tNOTE: The newly prepared 70% ethanol (Table of Materials) should be used up within 3 days.\nSample preparation\n\tNOTE: In the routine practice, 5 to 10 trophectoderm cells of the blastocyst are biopsied according to the practice guideline19.\n\t\nSuspend biopsies in 2 µL of 1x phosphate-buffered saline (PBS) in a single 0.2 mL polymerase chain reaction (PCR) tube.\nBriefly spin the tube on a mini centrifuge for 3 s to collect the droplets.\nCell lysis and extraction\nThaw the cell extraction buffer (Table of Materials) and the extraction enzyme dilution buffer (Table of Materials) on ice, vortex and briefly spin on a mini centrifuge for 3 s before use.\nAdd 3 µL of cell extraction buffer to each tube from step 1.2.2.\nPrepare a 5 µL cell lysis master mix for each sample by adding 4.8 µL of extraction enzyme dilution buffer and 0.2 µL cell extraction enzyme (Table of Materials). Mix well and aliquot into each tube from step 1.3.2. Flip the tube gently and briefly spin on a mini centrifuge for 3 s.",
    "NOTE: tips should not touch the liquid containing the cell samples when adding the master mix.\nIncubate the tube from step 1.3.3 in the thermal cycler with heated lid. Run the program with the following settings: 10 min at 75 °C, 4 min at 95 °C, hold at 4 °C.\nPreamplification\nThaw the preamplification buffer (Table of Materials) on ice, vortex and briefly spin on a mini centrifuge for 3 s before use.\nPrepare a 5 µL preamplification master mix for each sample by adding 4.8 µL of preamplification buffer and 0.2 µL of preamplification enzyme (Table of Materials). Mix well and aliquot into each tube from step 1.3.4. Flip the tube gently and briefly spin on a mini centrifuge for 3 s.\n\t\tNOTE: Tips should not touch the liquid containing the DNA samples when adding the master mix.\nIncubate the tube in the thermal cycler with heated lid. Run the program with the flowing settings: 2 min at 95 °C; 12 cycles for 15 s at 95 °C, 50 s at 15 °C, 40 s at 25 °C, 30 s at 35 °C, 40 s at 65 °C, 40 s at 75 °C; hold at 4 °C.\nAmplification\nThaw the amplification buffer (Table of Materials) on ice, vortex and briefly spin on a mini centrifuge for 3 s before use.\nPrepare a 60 µL amplification master mix for each sample by adding 25 µL of amplification buffer, 0.8 µL of amplification enzyme (Table of Materials), and 34.2 µL of nuclease-free water for WGA (Table of Materials). Mix well and aliquot into each tube from step 1.4.3. Flip the tube gently and briefly spin on a mini centrifuge for 3 s.",
    "Incubate the tube in the thermal cycler with heated lid. Run the program with the following settings: 2 min at 95 °C; 14 cycles for 15 s at 95 °C, 1 min at 65 °C, 1 min at 75 °C; hold at 4 °C.\nPurification of the WGA products\nTransfer each WGA product from step 1.5.3 into new 1.5 mL tubes. Add 112.5 µL of magnetic beads into each tube. Vortex and incubate at RT for 5 min.\n\t\tNOTE: Completely mix the magnetic beads before use.\nPlace the tubes onto a magnetic stand (Table of Materials) for 3 min until the supernatant is clear. Discard all the supernatant without disturbing the beads.\nAdd 300 µL of 70% ethanol to each tube. Rotate each tube 180° to let the beads run through the ethanol and rotate back to the original position. Discard all the supernatant after the beads have settled without disturbing the beads. Repeat this step once.\n\t\tNOTE: Keep the tube on the magnetic stand while rotating the tube horizontally.\nBriefly spin each tube on a mini centrifuge for 3 s. Place the tubes onto the magnetic stand until the residual supernatant is clear. Discard all the residual supernatant without disturbing the beads. Air dry the beads at RT for approximately 3 min.\nRemove the tubes from the magnetic stand and resuspend the dried beads by adding 35 µL of low Tris-EDTA (TE) buffer (Table of Materials). Incubate at RT for 5 min.\nPlace the tubes onto the magnetic stand for 3 min until the supernatant is clear. Transfer all the supernatant containing eluted DNA to new 1.5 mL tubes without disturbing the beads.\n2. Quality control of the WGA products",
    "Quantify each purified WGA product from step 1.6.6 by a fluorometer assay (Table of Materials) according to the manufacturer’s manual using 1 µL of WGA product as starting material.\n\tNOTE: The accepted concentration of the WGA product is ≥ 10 ng/µL. Any product below this threshold is not recommended to proceed to the next steps.\n3. Fragmentation of WGA products\nPrior to start, preheat a dry block heater to 37 °C. Prepare 6 µL (with a 20% excess) of 0.5 M EDTA for each sample. Based on the concentration, aliquot 300 ng of DNA from each purified WGA product in step 1.6.6 to new 0.2 mL PCR tubes and bring volume to 16 µL with nuclease-free water for each tube.\nFragmentation\nPrepare a 4 µL double stranded DNA (dsDNA) fragmentation reaction mix for each sample by adding 2 µL of dsDNA fragmentation reaction buffer (Table of Materials) and 2 µL of dsDNA fragmentation enzymes (Table of Materials). Mix well and aliquot into each tube from step 3.1. Vortex and briefly spin on a mini centrifuge for 3 s. Incubate the tubes for 25 min at 37 °C in a thermal cycler with heated lid.\nAdd 5 µL of 0.5 M EDTA immediately to each tube. Mix well by vortexing and briefly spin on a mini centrifuge for 3 s.\nPurification and resuspension\nTransfer each product from step 3.2.2 into new 1.5 mL tubes. Add 37.5 µL of magnetic beads to each tube. Mix by vertexing and incubate at RT for 5 min.\nPurify the products as described from step 1.6.2 to step 1.6.4.\nElute each purified product as described in steps 1.6.5 and 1.6.6 by adding 32 µL of low-TE buffer.\n4. Library construction\nBlunt-end repairment, size selection and purification",
    "Prepare a 20 µL blunt-end repairment mix for each sample by adding 9.5 µL of nuclease-free water, 10 µL of 5x end repair buffer (Table of Materialstube from step 3.3.3. Vortex and briefly spin on a mini centrifuge for 3 s.\nAdd 50 µL of magnetic beads to each tube from step 4.1.1. Vortex and incubate at RT for 5 min.\n\t\tNOTE: Completely mix the magnetic beads before use.\nPlace each tube onto the magnetic stand for 3 min until the supernatant is clear. Transfer all the supernatant to new 1.5 mL tubes where 25 µL magnetic beads are added for each. Vortex the tubes with the transferred supernatant and incubate at RT for 5 min.\nPurify the products in the incubated tubes as described from step 1.6.2 to step 1.6.4.\nElute each purified product as described in steps 1.6.5 and 1.6.6 by adding 32 µL of low-TE buffer.\n\t\tNOTE: This is a safe stop point; the purified DNA from this step is stable at 4 °C for no more than 24 h.\nAdaptor ligation and purification\nPrepare a 17 µL adapter ligation mix for each sample by adding 10 µL of nuclease-free water, 5 µL of 10x ligase buffer (Table of Materials), 1 µL of P1 adapter (Table of Materials), and 1 µL of DNA ligase (Table of Materials). Mix well by vortexing for 5 s and spin on a mini centrifuge for 15 s, and aliquot into each tube from step 4.1.5.\nAdd 1 µL of adapters (Table of Materials) to each tube from step 4.2.1 according to the sample sheet (Supplemental File: Sample sheet for adapter ligation). Vortex and briefly spin on a mini centrifuge for 3 s. Incubate the tubes at RT (20−25 °C) for 20 min.",
    "Add 75 µL of magnetic beads to each tube from step 4.2.2. Mix by vertexing and incubate at RT for 5 min. Then, purify the products as described from step 1.6.2 to step 1.6.4.\nElute each purified product as described in steps 1.6.5 and 1.6.6 by adding 15 µL of low-TE buffer. Transfer all the supernatant containing eluted DNA to new 0.2 mL 8-tube strips.\n\t\tNOTE: This is a safe stop point; the purified DNA from this step is stable at 4 °C for no more than 24 h.\nAmplification and purification\nPrepare a 50 µL amplification master mix for each sample by adding 47.5 µL of super mix (Table of Materials) and 2.5 µL of primer mix (Table of Materials). Mix well by vortexing and briefly spin on a mini centrifuge, and aliquot into the 0.2 mL 8-tube strips from step 4.2.4.\nVortex the strips for 30 s and briefly spin on a mini centrifuge for 3 s. Incubate the strips in the thermal cycler with heated lid. Run the program with the following settings: 20 min at 72 °C; 5 min at 95 °C; 10 cycles for 15 s at 95 °C, 15 s at 62 °C, 1 min at 70 °C; 5 min at 70 °C; hold at 4 °C.\nTransfer each product from step 4.3.2 into new 1.5 mL tubes. Add 97.5 µL of magnetic beads to each tube. Mix by vortexing and incubate at RT for 5 min.\nPurify the products as described from step 1.6.2 to step 1.6.4.\nElute each purified product as described in steps 1.6.5 and 1.6.6 by adding 25 µL of low-TE buffer.\n5. Quality control and dilution of the DNA library",
    "Quantify each prepared DNA library from step 4.3.5 by the fluorometer assay according to the manufacturer’s manual using 2 µL of DNA library as starting material.\nThe accepted concentration of the DNA library is ≥ 0.5 ng/µL and that of the positive control (Table of Materials) is ≤ 15 ng/µL. If the concentration of the positive control varies too much from 15 ng/µL, repeat the quantification of the positive control until the concentration is close to 15 ng/µL. If the concentration of the library is below 0.5 ng/µL, restart from fragmentation (section 3).\n\tNOTE: Ensure that the concentration of the positive control reaches the accepted value before quantifying the DNA library.\nDilute each library to 100 pmol by adding nuclease-free water. Add 1 µL of library to n µL of nuclease-free water; calculate n using the equation below:\nimgsrc://cloudfront.jove.com/files/ftp_upload/59273/59273eq1.jpg\n\twhere Q is the concentration of each library measured by the fluorometer assay and C is the concentration of the positive control measured by the fluorometer assay.\n6. Sequencing\nPrior to start, prepare 48 µL (with a 20% excess) of 1 M NaOH for each sample and one nuclease-free 1.5 mL tube. Thaw the master mix PCR buffer (Table of Materials) (2000 µL in volume) at RT. Bring the sphere particles (Table of Materials) to RT.\nLibrary pooling\nVortex each diluted library from step 5.3 and briefly spin 4x on a mini centrifuge for 3 s each time. Take 5 µL of each library to pool into the nuclease-free 1.5 mL tube. Vortex the mixed library and briefly spin on a mini centrifuge for 3 s.\nEmulsion PCR using an emulsion system \nAdd 150 µL of breaking solution to 2 new recovery tubes (Table of Materials). Install the new recovery tubes, recovery router and amplification plate.",
    "Mix by inverting the oil bottle (Table of Materials) 3 times. Ensure that both the oil and recovery solution (Table of Materials) are at least 2/3 full.\nVortex the master mix PCR buffer for 30 s and briefly spin on a mini centrifuge for 3 s. Vortex the sphere particles and the mixed library from step 6.2.1 for 1 min and briefly spin on a mini centrifuge for 3 s.\nPrepare a 2400 µL ligation mix by adding 172 µL of nuclease-free water, 8 µL of mixed library from step 6.3.3, 120 µL of enzyme mix (Table of Materials), and 100 µL of sphere particles to the tube containing 2000 µL master mix PCR buffer.\nSet a pipette to 800 µL. Load the ligation mix from step 6.3.4 to the reaction filter (Table of Materials) through the sample port. Use a 1000P pipette to add 200 µL of reaction oil to the reaction filter.\nSelect the program Proton: Ion PI Hi-Q OT2 200 Kit, and then, select Assisted button to ensure that the device has been set up correctly by following the instructions on the monitor. Then, click Next to start the program.\nEnrichment by an automatic enrichment system\nWhen the emulsion PCR program is completed, click Next, and then click Final Spin to spin for 10 min. Take out the 2 recovery tubes after clicking Open Lid.\nDiscard the supernatant from the 2 recovery tubes until 100 µL remains in each tube, and label accordingly. Mix the solution well and transfer to a new 1.5 mL tube.\nAdd 200 μL of nuclease-free water to each recovery tube, wash by pipetting up and down several times, and transfer all the solution to the 1.5 mL tube in step 6.4.2. Repeat the wash step once.",
    "Add 200 µL of nuclease-free water to one of the recovery tubes and wash by pipetting up and down several times. Transfer all the solution to the other recovery tube and wash by pipetting up and down several times. Then, transfer all the solution to the same 1.5 mL tube from step 6.4.3. Vortex the 1.5 mL tube for 30 s and centrifuge for 8 min at 15,500 x g.\n\t\tNOTE: The final total volume of the emulsion PCR product in this step should be approximately 1200 µL.\nDiscard the supernatant in the tube and keep 20 µL of the emulsion PCR product. Add 80 µL of resuspension solution (Table of Materials) to the tube. Mix by pipetting up and down.\nPrepare a 320 µL melt-off solution for each chip by adding 280 µL of polyethylene glycol sorbitan monolaurate solution (Table of Materials) and 40 µL of 1 M NaOH.\n\t\tNOTE: 1 M NaOH should be stored at 4 °C or freshly prepared. Vortex before use.\nVortex the tube containing C1 beads (Table of Materials) for 30 s. Take 100 µL of C1 beads to a new 1.5 mL tube. Place the 1.5 mL tube onto the magnetic stand for 2 min at RT. Discard all the supernatant after the beads have settled without disturbing the beads.\nAdd 1 mL of wash solution C1 (Table of Materials) to the tube from step 6.4.7. Vortex for 30 s. Place the tube onto the magnetic stand for 2 min at RT. Discard all the supernatant after the beads have settled without disturbing the beads. Resuspend the beads by adding 130 µL of bead capture solution (Table of Materials).\nEnrichment system (ES) setup",
    "Load the sample (100 µL emulsion PCR product) from step 6.4.5, the washed beads (130 µL) from step 6.4.8, ES wash solution (300 µL) (Table of Materials), and melt-off solution (300 µL) from step 6.4.6 into the 8-tube strip. The layout order is: sample (tube 1), washed beads (tube 2), ES wash solution (tubes 3, 4, 5), and melt-off solution (tube 7). Keep tubes 6 and 8 empty.\nPlace the 8-tube strip from step 6.4.9.1 onto the ES. Install a pipette tip and a new 0.2 mL tube and start the program.\n\t\t\tNOTE: Ensure that pipetting works normal.\nWash the sphere particles after the enrichment is completed.\n\t\t\nCentrifuge the 0.2 mL tube from step 6.4.9.2 for 5 min at 15,500 x g. Discard the supernatant and keep 10 µL of the enrichment product. Add 200 µL of nuclease-free water to the tube. Mix by vortexing.\nCentrifuge the 0.2 mL tube from for 5 min at 15,500 x g. Discard the supernatant and keep 10 µL of the enrichment product. Add 90 µL of nuclease-free water to the tube. Mix by vortexing.\nTemplate preparation\nVortex the positive control and spin briefly. Add 5 µL of positive control to the 100 µL template (the enrichment product from step 6.4.10.2). Vortex and centrifuge for 5 min at 15,500 x g. Discard the supernatant and keep 10 µL of the template.\nAdd 20 µL of sequencing primer (Table of Materials) and 15 µL of annealing buffer (Table of Materials) to the template tube from step 6.5.1. Vortex the tube and briefly spin on a mini centrifuge for 3 s.\nIncubate the tube from step 6.5.2 in the thermal cycler with heated lid. Run the program with the following settings: 2 min at 95 °C, 2 min at 37 °C, hold at 4 °C.",
    "Add 10 µL of loading buffer (Table of Materials) to the tube from step 6.5.3. Mix by pipetting up and down.\nSequencer initialization \nCheck the tank pressure of nitrogen gas (total pressure ≥ 500 psi, output pressure ≥ 10 psi, optimum 20-30 psi). Top-up 100 mL deionized water (18.2 MΩ) to C1 and C2 tubes (Table of Materials) and install them to corresponding C1 and C2 positions on the sequencer.\nPrepare W1 (32 µL of 1 M NaOH) and W3 (40−50 mL of W3 buffer [Table of Materials]) solutions. Prepare W2 solution by adding 1920 mL of deionized water (18.2 MΩ), a whole bottle of W2 buffer (Table of Materials) and 8−12 µL of 1 M NaOH, and invert 4−8 times to mix.\n\t\tNOTE: Because the water quality varies geologically, adjust the volume of 1 M NaOH as needed. The starting pH of W2 is 5.9−6.1, and the optimal range after adjustment is 7.4−7.6. Change and install new reagent tubes and use lately used chip for washing.\nPrepare the 4 new empty tubes from the sequencing supplement kit (Table of Materials). Label the 4 tubes as dGTP, dCTP, dATP, and dTTP, and add 70 µL of dGTP, dCTP, dATP, or dTTP (Table of Materials) to the corresponding tube (i.e., 70 µL dGTP to the tube labeled as dGTP, etc.). Vortex the tubes before use. Install the tubes to the corresponding positions designated on the sequencer (Table of Materials).\nChip wash\nWash the chip (Table of Materials) once by injecting 100 µL of isopropanol into the loading well of the chip. Remove the expelled liquid from the opposite well.\nWash the chip twice by injecting 100 µL of nuclease-free water into the loading well of the chip. Remove the expelled liquid from the opposite well.",
    "Wash the chip once by injecting 100 µL of 0.1 M NaOH into the loading well of the chip. Remove the expelled liquid from the opposite well. Incubate at RT for 1 min.\nWash the chip once by injecting 100 µL of nuclease-free water into the loading well of the chip. Remove the expelled liquid from the opposite well.\nWash the chip twice by injecting 100 µL of isopropanol into the loading well of the chip. Remove the expelled liquid from the opposite well. Dry by blowing nitrogen onto the chip. Keep away from light.\nSample loading and sequencing\nMix the 55 µL sample from step 6.5.4 by pipetting up and down and load the sample to the loading well of the chip.\n\t\tNOTE: Keep the pipette tip and the 0.2 mL PCR tube used in this step.\nPlace the chip onto the chip mini centrifuge (Table of Materials) when\nPrepare two new 1.5 mL tubes for the annealing buffer and flushing solution. Prepare the 50% annealing buffer by adding 500 µL of annealing buffer and 500 µL of nuclease-free water. Prepare the flushing solution by adding 500 µL of annealing buffer and 500 µL of 100 % 2-propanol.\nPrepare two new 1.5 mL tubes and prepare the foaming mixture by mixing 49 µL of 50% annealing buffer and 1 µL of foaming solution (Table of Materials) in both tubes.\nSet a pipette to 100 µL. Make bubbles by pipetting air into the foaming mixture from one of the two tubes from step 6.8.4. Make > 120 µL of bubbles and keep pipetting until no outstanding visible bubbles can be seen. Load 120 µL of bubbles into the loading well.\n\t\tNOTE: Ensure that there are no outstanding visible bubbles. Otherwise, start it over.",
    "Transfer the excessive expelled liquid from the exit well from step 6.8.5 to the loading well by pipetting. Do not pipette bubbles. Centrifuge the chip for 30 s on the chip mini centrifuge.\nRepeat step 6.8.5 by using the second tube containing the foaming mixture from step 6.8.4.\nAdd 55 µL of the 50% annealing buffer to the 0.2 mL tube kept in step 6.8.1. Use the kept pipette tip in step 6.8.1 to pipette up and down. Load all the 55 µL annealing buffer to the loading well. Centrifuge the chip for 30 s on the designated chip mini centrifuge.\nLoad 100 µL of flushing solution into the chip loading well and discard the expelled liquid from exit well. Repeat this loading step once.\n\t\tNOTE: If there are bubbles in the chip, expel small bubbles by big bubbles and flush by flushing solution. This can be achieved by pipetting 100 µL of flushing solution and leaving 5 µL of air below the flushing solution. Therefore, when pipetting the 105 µL into the chip, air will form a big bubble that can expel the small bubbles, and then, the big bubble can be expelled by the following flushing solution.\nLoad 100 µL of the 50% annealing buffer into the chip loading well. Repeat this loading step for a total of 3 times.\nAdd 6 µL of the sequencing enzyme into 60 µL of the 50% annealing buffer into a new 1.5 mL tube. Mix by pipetting up and down. Load 65 µL of this mixed solution into the chip loading well. Pipette slowly to avoid foaming.\nKeep the chip away from light and incubate at RT for 5 min.",
    "After the incubation, immediately load the chip onto the sequencer and click Start the sequencing run on the screen to start sequencing.\n\t\tNOTE: The sequencing raw data and quality control files will be uploaded automatically to the company for data analysis.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}