{
  "id": 17199,
  "origin_website": "Jove",
  "title": "Network Pharmacology Prediction and Experimental Validation of Trichosanthes-Fritillaria thunbergii Action Mechanism Against Lung Adenocarcinoma",
  "procedures": [
    "All the network pharmacology procedures were carried out in accordance with the Guidelines for Network Pharmacology Evaluation Methods18. All the experimental procedures were performed in accordance with the laboratory management regulations of the Beijing University of Chinese Medicine.\n1. Network pharmacological prediction\nSelection of active components\n\t\nOpen the HERB database (http://herb.ac.cn)19, and use \"Gualou\" (the Chinese name for Trichosanthes kirilowii Maxim) and \"Zhebeimu\" (the Chinese name for Bulbus Fritillariae thunbergii) as keywords to obtain the components of the two drugs. Download the list and the canonical SMILES structures of the related components of the two drugs.\nDetermine whether the obtained component is the active component.\n\t\t\nInclude as active components those that have oral bioavailability (OB) and drug-like (DL) values in the HERB group database (i.e., components with OB ≥ 30% and DL ≥ 0.18)20,21.\nIf the component has no OB and DL values, input the component into the Swiss ADME database (http://www.swissadme.ch/index.php)22 to obtain the information on each component. Include components with “high” GI absorption and at least two “Yes” DL values as active components.​\nTarget prediction of the active components\n\t\nOpen the HERB database (http://herb.ac.cn). Search and copy the canonical SMILES structures of the active components.\nOpen the SEA (Similarity ensemble approach, http://sea.bkslab.org) database23. Paste the canonical SMILES structures of the active components into the search box, and click on Try SEA to obtain the Target key, Target name, P-Value, and MaxTC of each active component.\nCopy the data into a spreadsheet, and use the filtering function of the spreadsheet file to filter the targets of the active components by Target key (Human, P < 0.05, and MaxTC > 0.5).\nCopy all the targets to a spreadsheet, and remove the duplicates to obtain the drug targets.\nPrediction of disease targets",
    "Open the GeneCards database (https://www.genecards.org)24 and Online Mendelian Inheritance in Man database (OMIM, https://www.omim.org)25 and use Lung Adenocarcinoma as the keyword to obtain the disease targets of the lung adenocarcinoma.\nDownload the spreadsheets of the disease targets. Delete the repeated targets to obtain the LUAD targets.\nConstruction of a drug-component-disease-target network\n\t\nCopy the LUAD-related targets and drug targets into the same column in a new spreadsheet. Use the Data - Identify Duplicates function in the toolbar to obtain intersection targets of the LUAD-related targets and the Trichosanthes-Fritillaria thunbergii active component-related targets.\nOpen Cytoscape 3.8.0. Click on File in the menu bar, and then select Import > Network from File to import the spreadsheet file. Optimize the size and color of the network nodes through the style bar in the left control panel.\nUse the Analyze Network function for the network topology analysis. Click on Tools in the menu bar, and then select Analyze Network. On the Table panel, click on the Degree in the title bar to arrange the components by degree in descending order. Take the top ten components and targets as the main active components and core targets.\nConstruction of the PPI network and screening of the core proteins\n\t\nOpen the STRING database (https://cn.string-db.org/)26. Paste the text-format list of the potential targets of Trichosanthes-Fritillaria thunbergii against LUAD into the List of Names dialog box. Select Homo sapiens in Organisms, and click on the SEARCH > CONTINUE buttons.\nWhen the results are available, click on Settings, and tick High Confidence (0.700) in Basic Settings > Minimum Required Interaction Score. Tick Hide Disconnected Nodes in the Network in Advanced Settings, and then click on the UPDATE button.\nClick on Exports in the title bar, and download the short tabular text of the PPI relationship in TSV format.",
    "Open Cytoscape 3.8.0. Click on File > Import > Network from File to import the TSV format file for visual analysis.\nUse the Network Analyzer function to conduct the topological analysis. Optimize the size and color of the network nodes through the style bar in the left control panel.\nKEGG enrichment analysis\n\t\nOpen the Metascape (https://metascape.org/)27 platform. Paste the text-format list of the potential therapeutic targets into the dialog box, and then click on the Submit button. Tick H. sapiens in both Input as Species and Analysis as Species, and then click on the Custom Analysis button. Select Enrichment, tick only the KEGG Pathway, and then click on Enrichment Analysis. After the progress bar reaches 100%, click on the Analysis Report Page orange button for the enrichment results.\nClick on All in One Zip File for the download of the enrichment result, and then open the _ FINAL_GO.csv file in the Enrichment_GO folder to obtain the result.\nOpen R software (https://cran.r-project.org/). Type install.package (\"ggplot2\") and library (ggplot2) in R for the installation of the ggplot2 R package. Press Enter to run the KEGG visualization program.\n2. Experimental verification\nDrug preparation\n\tNOTE: Fritillaria thunbergii Miq and Trichosanthes kirilowii Maxim were purchased from Dongzhimen Hospital, affiliated with the Beijing University of Chinese Medicine.\n\t\nMix 50 g of Fritillaria thunbergii Miq and 50 g of Trichosanthes kirilowii Maxim together. Soak the mixture in 1 L of distilled water for 20 min, and then decoct the mixture at 100 °C under normal pressure for 1 h.\nFilter the decoction to obtain a filtrate with a double layer of sterile medical gauze, and then use 80 µm filter paper to further filter the extract. Repeat the above operation three times.",
    "Mix the filtrate together to obtain an approximately 1.2 L decoction. Place the solution in the flask of a rotary evaporator. Set the rotation speed to 50 rpm with a temperature of 37 °C. Mix and condense the decoctions into an extract in the rotary evaporator for 6 h to yield a viscous liquid.\nTurn on the vacuum freeze-drying mechanism to precool the temperature to −40 °C. Put the obtained extract into the material tray, and place it into the cold trap for freezing.\nWhen the cold trap temperature reaches −50 °C and the material has been frozen for 2 h, transfer the frozen materials to a drying rack placed in the cold trap. Turn on the vacuum pump to initiate the lyophilization process. Take out the freeze-dried powder, and store this in the refrigerator at −20 °C for later use.\nCell cultivation\n\t\nConfigure DMEM complete medium with 89% DMEM basic medium, 10% fetal bovine serum, and 1% penicillin-streptomycin.\nAfter removing the A549 cells from liquid nitrogen, incubate the cells in a 37 °C water bath, and stir until the medium in the vial melts.\nAdd a fourfold volume of DMEM complete medium into the melted cells. Centrifuge the cells (4 °C, 679 x g, 5 min), and discard the supernatant.\nResuspend the precipitated cells with 6 mL of DMEM complete medium, plate them in a T25 culture flask, and incubate the flask in a cell incubator at 37 °C, 5% CO2.\nDetection of cell viability",
    "Digest the logarithmic growth-phase A549 cells with 1 mL of 0.25% trypsin for 1 min at 37°C. Add 1 mL of DMEM complete medium to neutralize the trypsin, and gently blow it to promote cell shedding. Centrifuge the mixture to obtain the cell pellet (4 °C, 192 x g, 5 min). Resuspend the obtained cells using DMEM complete medium.\nAdd the cell suspension to a hemocytometer, and count using an automated cell counter. Dilute it to 5 x 104 cells/mL using DMEM complete medium.\nDissolve 1 g of Trichosanthes-Fritillaria thunbergii water extract in 10 mL of PBS solution, and filter-sterilize it through a 0.22 µm filter. Dilute the mixture to 90 mg/mL, 80 mg/ml, 70 mg/mL, 60 mg/mL, 50 mg/mL, 40 mg/mL, 30 mg/mL, 20 mg/mL, and 10 mg/mL using PBS.\nPlate the diluted cells on 96-well plates with 100 µL per well. After cell adherence, add 1 µL of Trichosanthes-Fritillaria thunbergii water extracts of different concentrations to adjust the concentration of each well to 900 µg/mL, 800 µg/mL, 700 µg/mL, 600 µg/mL, 500 µg/mL, 400 µg/mL, 300 µg/mL, 200 µg/mL, and 100 µg/mL.\nDiscard the original medium after 24 h of culture, and add 100 µL of DMEM basic medium for further incubation for 2 h at 37 °C, 5% CO2.\nAfter the above treatment, add 20 µL of MTS solution (Table of Materials), and incubate the cells for another 1 h at 37 °C, 5% CO2.\nTransfer the incubated mixture to a different plate. Measure the absorbance (OD) at a 490 nm wavelength using a microplate reader. Calculate the cell viability using the following formula:\n\t\tViability (%) = 100 × (OD of the treated sample − OD of the medium)/(OD of the control sample − OD of the medium).",
    "NOTE: A minimum concentration close to IC50 is defined as a high dose. The concentration at which the cell proliferation begins to be inhibited is defined as a low-dose concentration, and the intermediate value is defined as a medium-dose concentration for subsequent experimental studies. In this study, 400 µg/mL, 600 µg/mL, and 800 µg/mL were used as the low, medium, and high doses.\nDrug intervention and sample collection\n\tNOTE: Cell growth was plotted against time to determine the log phase.\n\t\nDilute the logarithmic growth-phase A549 cells to 5 x 105 cells/mL. Add 2 mL of the cell suspension to a 6-well plate, and grow for 12 h.\nRepeat step 2.3.3 to obtain 80 mg/mL, 60 mg/mL, and 40 mg/mL PBS dilutions of Trichosanthes-Fritillaria thunbergii water extract. Add 20 µL of the PBS solution, 20 µL of the 40 mg/mL Trichosanthes-Fritillaria thunbergii water extract, 20 µL of the 60 mg/mL Trichosanthes-Fritillaria thunbergii water extract, and 20 µL of the 80 mg/mL Trichosanthes-Fritillaria thunbergii water extract to the blank control group, low concentration group, medium concentration group, and high concentration group, respectively. Discard the supernatant after 24 h of intervention, and clean the cells with PBS three times.\n\t\tNOTE: The concentrations of the blank control group, low concentration group, medium concentration group, and high concentration group of Trichosanthes-Fritillaria thunbergii water extract were 0 µg/mL, 400 µg/mL, 600 µg/mL, and 800 µg/mL, respectively.\nAdd 250 µL of RIPA buffer (containing 1% PMSF and 1% phosphatase inhibitor) to each well, and lyse the cells for 30 min. Collect the lysate for centrifugation (4 °C, 6,714 x g, 10 min), and obtain the supernatant.\nWestern blotting\n\t\nDetect the protein concentration of the samples by the BCA method according to the manufacturer's instructions. Use RIPA buffer to adjust the concentration of each sample to be consistent.",
    "Mix 40 µL of the protein sample with 10 µL of 5x loading buffer, and boil for 5 min at 100 °C. Centrifuge (4 °C, 6,714 x g, 10 min) the mixture to obtain the supernatant for subsequent experiments.\nIsolate the proteins by gel electrophoresis using 120 V vertical electrophoresis.\nPrepare an electrical \"sandwich\" (sponge - filter paper - gel - PVDF membrane - filter paper - sponge). Soak the transfer apparatus in an ice bath, and transfer the protein onto PVDF membranes at 70 V for 60 min.\nUse 100 mL of TBST solution (0.05% [v/v] Tween-20, 10 mM Tris, 150 mM NaCl, pH 7.5) and 5 g of skimmed milk powder to configure 5% milk. Pre-dilute the AKT and p-AKT antibodies with the antibody diluent in a ratio of 1:1,000.\nBlock the PVDF membrane in 5% skimmed milk powder for 1 h with shaking. After blocking, discard the blocking milk, and add the diluted primary antibody for overnight incubation at 4 °C.\nAfter removing the primary antibody, use TBST solution to wash the PVDF membrane five times for 5 min each.\nPre-dilute the secondary antibody with the antibody diluent in a ratio of 1:5,000. Add the secondary antibody, and incubate at room temperature (RT) for 1.5 h. After removing the secondary antibody, use TBST solution to wash the PVDF membrane five times for 5 min each.\nDetect the protein using a chemiluminescence detection system.\n3. Molecular docking\nOpen the UniProt database (https://www.uniprot.org)28. Type the target symbols into the search box, and click on the SEARCH button. In the Structure subheading, click on Download for the 3D structures of the protein targets.\nOpen the RCSB PDB database (https://www.rcsb.org/pdb/home/sitemap.do)29. Type the name of the protein macromolecules into the search box. Download the protein macromolecule structures in PDB format.",
    "Download the installation package of UCSF Chimera 1.16 software (https://vina.scripps.edu/) and AutoDock Vina (https://vina.scripps.edu/). Install and open the UCSF Chimera 1.16 software. Click on File > Open to display the receptor protein.\nClick on Tools > Structure Editing > Dock Prep, and tick Delete Solvent, Add Hydrogens, and Add Charges in the popover to remove water and add hydrogenation and balance charges. Click on Write Mol2 File to save the receptor protein in mol2 format. Perform the same step on the ligand.\nClick on File > Open to display the mol2-format ligand in the UCSF Chimera 1.16 software. In Tools > Surface/Binding Analysis > AutoDock Vina, set the Receptor bar to the name of the receptor protein and the Ligand bar to the name of the ligand. Enter a value in the box behind Center and Size to adjust the newly developed space, making it possible to fully encompass the ligand and the receptor.\nClick on OK for the molecular docking virtual screening to obtain the optimal location for ligand binding to the receptor. Record the binding energy value at the optimal position.\n4. Statistical analysis\nOpen SPSS 26.0 statistical software. Click on File > Import Data for data loading.\nPresent the experimental data as mean ± standard deviation.\nCompare multiple groups using a one-way ANOVA.\n\tNOTE: P < 0.05 was considered statistically significant in this work.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}