{
  "id": 8497,
  "origin_website": "Jove",
  "title": "Elimination of Serotonergic Neurons by Stereotaxic Injection of 5,7-Dihydroxytryptamine in the Dorsal Raphe Nuclei of Mice",
  "procedures": [
    "All surgical interventions and animal care procedures have been approved by the Animal Committee of School of Life Sciences and Technology, Tongji University, Shanghai, China.\n1. Housing of animals\nMaintain male C57BL/6NCrl mice (10 weeks old, 25 g, n = 21) in standard conditions (24 °C temperature; 55% humidity) under a 12 h/12 h light/dark cycle.\nProvide food and water ad libitum.\n\tNOTE: Here, three of the mice are used for confirming the needle track.\n2. Preparation of reagents\nNOTE: All drug preparation steps must be performed in a laminar flow hood to avoid contamination. All prepared solutions are stored in a -80 °C freezer. It is recommended to use one aliquot at a time, thaw completely, mix well before use, discard the leftovers in the tube, and avoid repeated freezing and thawing.\nDissolve 0.25 g of desipramine hydrochloride in 100 mL of 0.9% saline to yield a 2.5 mg/mL solution. Sterilize the solution using a syringe filter with 0.22 μm pore size hydrophilic PES membrane. Then, aliquot the solution (1.8 mL/tube) in 2 mL microcentrifuge (EP) tubes. Label, date, and store in a -80 °C freezer immediately. The recommended dosage for animal use is 25 mg/kg.\nDissolve 5 mg of 5,7-DHT in 1.67 mL of 0.9% saline containing 0.1% ascorbic acid to yield a 3 μg/μL solution. Vortex gently to mix, sterilize the solution using a syringe filter (0.22 μm pore size), and aliquot the solution (10 μL/tube) in 0.5 mL EP tubes. Label, date, and freeze at -80 °C immediately. The recommended dosage for animal use is 2 μL/mouse.",
    "Dissolve ketoprofen (analgesic) following the previously described method17. Dissolve 250 mg of ketoprofen in 15 mL of water and 1 mL of 1 M NaOH, adjust the pH to 7.3 and make up the final volume to 125 mL, which will result in a final concentration of 2 mg/mL. Sterilize the solution using a 0.22 μm syringe filter and aliquot the solution (0.4 mL/tube) in 1.5 mL EP tubes. Label, date, and freeze at -80 °C until use. The recommended dosage for animal use is 5 mg/kg.\n3. Preparation of instruments and mice\nPrepare a surgical pack (containing a scalpel, pair of tissue forceps, pair of scissors, needle holder, 3-0 sutures, ear tags, and ear tag applicator) previously sterilized in high temperature autoclaves. Place 75% ethanol, povidone-iodine, 3% hydrogen peroxide, vehicle solution (0.1% ascorbic acid in 0.9% saline), a cotton swab, ofloxacin eye ointment, and a mouse recovery cage on top of a heating pad, using a Hamilton syringe with a 32 G needle and 1 cc syringe.\nh prior to 5,7-DHT injection, weigh and record body weights of the mice, then subject them to intraperitoneal (i.p.) injections of desipramine (2.5 mg/mL, 10 μL/g weight).\n\tNOTE: The purpose of desipramine administration 1 h prior to 5,7-DHT injection is to prevent catacholaminergic cell loss18.\nAnesthetize mice using isoflurane inhalation anesthesia (3% during induction, 1.5% during maintenance, flow rate = 2 L/min). Administer ketoprofen (2 mg/mL, 2.5 μL/g weight) via subcutaneous (s.c.) injection. Confirm adequate anesthesia depth by the absence of tail pinch response.\n4. Stereotaxic injection\nPlace the anesthetized mouse on the stereotaxic platform, then fix its head with the ear bars and incisor bar of the stereotaxic apparatus.\nShave the mouse's head, then clean the exposed scalp with one scrub of 75% ethanol followed by one scrub of povidone-iodine.",
    "Apply lidocaine ointment on the scalp using a cotton swab to provide local analgesia. Put ofloxacin eye ointment on the eyes to protect the cornea.\nMake an incision on the scalp along the midline using a scalpel from 1 mm posterior to the eyes to the interaural line.\nUse a 3% hydrogen peroxide-soaked swab to remove the periosteum, then dry the skull and expose the cranial sutures. Mark the location of the bregma and lambda.\nAdjust the head position using the incisor bar until the bregma and lambda lay in the same horizontal plane. Adjust the needle tip to touch the bregma or lambda, record the medial/lateral (ML) and dorsal/ventral (DV) coordinates, and adjust the incisor bar so that the DV and ML coordinates of bregma and lambda are equal, respectively.\nUnlock the perpendicular positioning button and lock screw, then set the manipulator arm (z-axis) to 30° in the anterior/posterior (AP) direction as shown in Figure 1A,B. Lock the button.\nFix the Hamilton syringe filled with 2 μL of 5,7-DHT (3 μg/μL) onto the holder (for the sham group, mice are injected with 0.9% saline containing 0.1% ascorbic acid). Adjust the needle tip to touch the bregma landmark, then zero the ML, AP, and DV values using the digital display module.\n\tNOTE: The 5,7-DHT solution is brown colored liquid, making it easy to determine whether the Hamilton syringe is properly filled. If there is no access to a digital display module, record the number displayed on three axes when the needle tip touches the bregma, and the final coordinates represent “the recorded number plus the coordinate provided in this protocol”. For example, if the recorded number on the y-axis (A/P direction) manipulator arm is “a”, then the final coordinate in the A/P direction should be “a - 6.27”.",
    "Move the manipulator arm to adjust the needle tip to the injection position (APa = -6.27, ML = 0; formula for calculating the final coordinates is listed in Figure 1B). Mark the target position using a marker pen.\nDrill the burr hole using portable micromotor high-speed drill, then move the manipulator arm to lower the needle tip to the target (DVa = -4.04). Inject 2 μL of the solution into the brain slowly (0.5 μL/3 min), keeping the needle in situ for an additional 5 min to prevent solution leakage. Remove the needle gently after injection.\nApply interrupted sutures over the incision using 3-0 sutures. Wrap the sutured incision with a cotton swab soaked in povidone-iodine to avoid infection.\nClean the right ear with a povidone-iodine cotton swab, then apply the sterilized ear tag to the base of the ear for identification.\nRemove experimental mice from the stereotaxic apparatus and place in a mice recovery cage on top of a heating pad until full recovery from anesthesia is observed.\n5. Postoperative care of mice\nSubject mice to s.c. injections of ketoprofen 1x/day up to 2 days after surgery.\nInspect mice daily up to 7 days after surgery.\n6. Elevated T-maze test\nNOTE: Perform the test as described previously19,20.\nEnsure that the elevated T-maze (ETM) test is comprised of two open arms (30 cm x 5 cm x 0.5 cm) perpendicular to two enclosed arms (30 cm x 5 cm x 16 cm x 0.5 cm) with a center platform (5.0 cm x 5.0 cm x 0.5 cm). One of the enclosed arms is blocked by an opaque plastic sheet to form a T-shape (Figure 2A).\nThree days before the ETM test, habituate the animals by handling daily for 5 min.\nOn day 30 after surgery, perform the ETM test.",
    "On the day of behavioral testing, expose mice to one of the open arms for 10 min.\nFor inhibitory avoidance testing, place each mouse in the distal end of the enclosed arm and record the time taken to leave this arm with four paws in three trials. The first trial is baseline avoidance, the second trial is avoidance 1, and the third trial is avoidance 2.\nKeep mice in their cages for 30 s between trails and establish a cutoff time (here, 300 s is used for each trial).\n7. Perfusion, fixation, immunohistochemical staining, and quantification\nAt the end of the study (35 days after surgery, after the behavioral test), perform whole body perfusion and fixation once the mouse is under general anesthesia.\n\t\nAnesthetize the mouse as described in step 3.3. Place the deeply anesthetized mouse in dorsal recumbency.\nWet the fur with 75% alcohol over the entire ventral area.\nMake a cut below the sternum followed by a V-shape incision in the rib cage. Grasp the rib cage using the clamp to expose the heart.\nInsert the venous infusion needle into the left ventricle, then cut the atrial appendage immediately with scissors to let the blood flow out.\nTurn on the peristaltic pump to perfuse saline into the whole body through the circulatory system. Switch from saline to 4% paraformaldehyde (PFA) when fluid exiting the right atrium becomes clear and when the liver changes from red to pale red in color. Perfuse another 5 mL of 4% PFA when the mouse tail moves, and the body is stiff.\n\t\tNOTE: Swaying of the mouse tail is the sign of adequate perfusion.\nIsolation of the brain after intracardiac perfusion with 4% PFA\n\t\nDecapitate the mouse using large scissors, then cut the skin to expose the skull.",
    "Make two cuts at the base of the skull (connected to the neck), make one cut along the line linking the eyes, then cut the skull along the sagittal suture. Grasp and peel the skull of each hemisphere outward to expose the brain using forceps.\n\t\tNOTE: Cutting the skull along the sagittal suture must be performed carefully, otherwise the brain may be damaged and separate into parts.\nRemove the brain and place it in 4% PFA at 4 °C overnight for post-fixation, then transfer the brain into 30% sucrose until it sinks to the bottom.\n\t\tNOTE: Dehydration using 30% sucrose is not necessary if sections are cut with a vibratome.\nAbsorb any excess liquid around the tissue using a paper towel prior to embedding. Embed the brain tissue in OCT with the rostral face on the chuck.\n\tNOTE: Orientation of the sample is important. The rostral face of the brain must be attached to the chuck to make sure that the cutting edge is the caudal portion.\nCut a coronal section of the DRN (4.0–4.8 mm posterior from bregma) at 30 μm thickness (four-section intervals) using a cryostat and collect the sections in PBS. Store in brain section cryopreservation solution (SCS) at -20 °C.",
    "NOTE: Identification of the DRN is very important. The consecutive anatomical structures are shown as Figure 3A–H. The characteristic structures are as follows: lateral recess of the fourth ventricle (LR4V, red dash line in Figure 3A,E), fourth ventricle (4V, red dash triangle in Figure 3B,F), second cerebellar lobule (2Cb, red dash diamond-shape structure in Figure 3C/G), and aqueduct (Aq, red dash hole in Figure 3D,H). Start to collect the tissues when structures are observed as shown in Figure 3D,H, then cut in 30 μm thick sections (four-section intervals) to yield 24 total coronal sections. H&E staining of the sections is shown in (Figure 3E–H). The fourth section of each of the four sections will be selected to perform immunofluorescent staining. The remaining sections are stored in the SCS. If it is difficult to recognize the structures, mounting one piece of the sections on the slide is helpful.\nPerform immunohistochemical assay as described previously21,22.\nCount 5-HT-positive cells at different section levels throughout the entire DRN using ImageJ.\n8. Statistical analysis\nUse statistical software for data analysis. Express the results as means ± SEM.\nProcess the values for statistical analysis by two-way ANOVA or unpaired t-test and consider the differences significant at **p < 0.01.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}