{
  "id": 17916,
  "origin_website": "Jove",
  "title": "Visualization of Endogenous Mitophagy Complexes In Situ in Human Pancreatic Beta Cells Utilizing Proximity Ligation Assay",
  "procedures": [
    "Use of de-identified donor human pancreatic islets is via an Institutional Review Board (IRB) exemption and in compliance with University of Michigan IRB policy. Human pancreatic islets were provided by the NIH/NIDDK-sponsored Integrated Islet Distribution Program (IIDP).\n1. Human islet sample preparation\nSingle cell dissociation\nCulture human islet samples (4000–6000 islet equivalents/10 mL media) for at least 1 day at 37 °C in pancreatic islet media (PIM(S)) media supplemented with 1 mM glutamine (PIM(G)), 100 units/mL antimycotic-antibiotic, 1 mM sodium pyruvate and 10 % fetal bovine serum (FBS) or human AB serum.\nUse a dissection light microscope at 3x magnification to count individual human islets from culture. Pick 40 islets per treatment/condition of interest (such as glucolipotoxicity) into 1.5 mL tubes in islet media.\nCentrifuge islets at 400 x g for 1 min at 10 °C to sediment.\nWash samples, by brief inversion of tubes at room temperature, twice with 1 mL phosphate buffered saline (PBS) containing 50 μM PR619 (a deubiquitinase inhibitor; to preserve ubiquitin dependent protein interactions), with centrifugation between each wash at 400 x g for 1 min at 10 °C.\nDissociate islets into single cells with 125 μL of 0.25% trypsin containing 50 μM PR619 by incubating prewarmed trypsin (37 °C) for 3 min with islet pellets. Gently disperse islets during this time with periodic gentle pipetting using a 200 μL pipette.\nQuench the trypsin with 1 mL warmed (37 °C) PIM(S) media containing 50 μM PR619, then sediment cells by centrifuging at 400 x g for 1 min.\nWash cells by centrifugation at 400 x g for 1 min, twice, with PBS + 50 μM PR619.\nFinally, resuspend cells in 150 μL PBS containing 50 μM PR619.\nSingle cell adherence and fixation",
    "After resuspension, spin the cell solution onto frosted, charged, microscope slides using a cytocentrifuge at 28 x g for 10 min.\nFollowing cytocentrifugation, outline the cellular area with a hydrophobic pen (see the Table of Materials) to minimize antibody/PLA solution volumes needed. Fix cells with 4% paraformaldehyde in PBS for 15 min at room temperature.\n\t\tCAUTION: PFA is hazardous and must be handled with care.\nFor best results, carry out staining/PLA immediately, or within 24 h. If necessary, store samples in PBS at 4 °C until staining for no longer than 48 h.\n2. Immunohistochemistry\nBlocking\nWash cells twice with 1x PBS for 5 min at room temperature.\nBlock cell solution, to eliminate background staining, with 10% donkey serum in PBS containing 0.3% detergent (see the Table of Materials) for 1 h at room temperature.\nStaining\nIncubate cells with primary mouse or rabbit antibodies against USP8 (1:250) and NRDP1 (1:250) respectively (see the Table of Materials) diluted in phosphate buffered saline with detergent (PBT, see Table of Materials), at 4 °C overnight, to detect mitophagy complex signaling via PLA.\nCo-incubate cells with a marker specific for beta cell identification that was not raised in mouse or rabbit so as to not interfere with PLA signal. In this case incubate cells with anti-goat PDX1 (1:500) in PBT. Incubate all primary antibodies overnight at 4 °C, using plastic film on top of the solution to prevent evaporation.\n3. Proximity ligation assay\nPLA probe and counterstain\nPrepare the PLA probe solution according to manufacturer’s instructions, i.e., make 20 μL of probe solution per sample by preparing a final concentration of 1:5 solution of both anti-mouse and anti-rabbit probe solution in PBT, and incubating for 20 min at room temperature.",
    "After overnight incubation, wash cells twice with 1x PBS for 5 min each, on a rocker.\nJust before incubation with probe solution, add anti-goat Cy5 secondary at a final concentration of 1:600 to the probe solution (for detection of endogenous PDX1). Add 20 μL probe solution to each cell condition, cover gently with plastic film and incubate at 37 °C for 1 h.\nLigation\nWash cells twice, at room temperature, with Buffer A (see the Table of Materials for the recipe) for 5 min each, on a rocker.\nPrepare ligation solution (part of the detection reagents, see Table of Materials) according to manufacturer’s instructions. For this, dilute ligation stock (5x) 1:5 in diethyl pyrocarbonate (DEPC)-treated water. Immediately before incubation add 0.025 U/mL ligase. Add 20 μL ligation solution to cells. Cover with plastic film and incubate at 37 °C for 30 min.\nAmplification\nWash cells twice at room temperature with Buffer A for 2 min each.\nMake amplification solution (part of the detection reagents, see Table of Materials) according to manufacturer’s instructions. Dilute amplification buffer (5x) 1:5 in DEPC-treated water and keep in the dark until use. Add a 1:80 dilution of polymerase (part of the detection reagents, see Table of Materials) to the solution immediately prior to adding the solution to the cells.\nAdd 20 μL of amplification solution to the cells. Cover with plastic film and place in the dark at 37 °C for between 1 h 40 min to 2 h for maximum signal.\nPreparation for imaging\nWash cells twice with Buffer B (see the Table of Materials for recipe) for 10 min at room temperature, on a rocker.\nFinally, wash cells once in 0.01x Buffer B, for 2 min at room temperature on a rocker.",
    "Mount samples by adding a drop of mounting media containing 4′,6-diamidino-2-phenylindole (DAPI) and carefully placing a coverslip over the samples using a scalpel blade to press out any bubbles formed. Seal coverslips using clear nail polish around the edges.\nImage samples on a microscope capable of capturing multiple focal planes, such as a laser scanning confocal microscope, or an inverted fluorescence microscope with deconvolution capabilities, taking at least 9 different focal plane images.\n\t\t\nCapture images at 100x magnification, with approximately 0.45 μm z-stack height. Capture PLA at 550 nm excitation, 570 nm emission; counter-stain at 650 nm excitation, 670 nm emission; and DAPI at 405 nm excitation, 450 nm emission.\nTo ensure fluorescence image background signals and stray light are minimized for downstream analysis of PLA events (especially on widefield microscopes), process images utilizing a two-dimensional deconvolution (nearest neighbor) algorithm through a standard image processing software of choice.\n\t\tNOTE: For Olympus use CellSens, Nikon use NIS-Elements, Leica use LAS X, Zeiss – ZEN, Metamorph, MATLAB, Huygens Software, as well as several Plugins available through Image-J. For analysis, the total number of interactions over all the z-stacks should be analyzed using Image-J software, ensuring only Pdx-1 positive cells are analyzed (section 3.5).\nQuantification of PLA interactions\nOpen the free Image-J software application, and open the PLA image. Start from the first sharply in-focus PLA image.\nClick the image tab, and select adjust, then threshold (Figure 1A). Adjust the threshold to remove all non-specific PLA signal, make a note of the threshold adjustment and try to keep it consistent throughout analysis.\nClick the process tab, and select binary, then make binary (Figure 1B). Use the binary image to measure particles, by clicking on the “analyze” tab and pressing analyze particles (Figure 1C).",
    "For analysis make sure the settings are as follows: Size = 0–Infinity, Circularity = 0–1.0, Show = Outlines, check boxes for Display results, and Clear results (Figure 1D). Click OK. Take note of the number of particles analyzed in a spreadsheet denoting sample, and z-stack position.\nRepeat steps 3.5.2–3.5.4 until all in-focus z-stacks for the sample have been analyzed. Sum the total number of particles for the sample in the spreadsheet to quantify total number of interactions.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}