{
  "id": 10302,
  "origin_website": "Jove",
  "title": "Generating a Fractal Microstructure of Laminin-111 to Signal to Cells",
  "procedures": [
    "1. Thaw and aliquot laminin-111\nNOTE: Purified laminin-111 is available commercially (typically purified from EHS matrix sold as Matrigel), but not all sources provide intact, nondegraded protein.\nConfirm that Ln1 is not degraded by sourcing Ln1 and running size exclusion chromatography26 or polyacrylamide gel electrophoresis26. Denatured Ln1 should have bands at 337 kDa, 197 kDa and 177 kDa, and native Ln1 should have a single band at 711 kDa.\nThaw Ln1 on ice in a refrigerator overnight, and aliquot into low protein binding microcentrifuge tubes (typically aliquot at 100 µg/tube for culture overlays, or 10 µg for coatings) using low protein binding tips and sterile technique27. Freeze aliquots and store at -80 °C.\n2. Laminin polymerization using low pH buffers\nMake polyLM polymerization buffer: Weigh out and mix 1 mM CaCl2 and 20 mM sodium acetate in ultrapure water. Then adjust the pH to 4.0, using HCl or acetic acid. Sterile filter through 0.2 µm filter, and store at 4 °C.\nMake control polymerization buffer: Mix 1 mM CalCl2 and 20 mM Tris and adjust the pH to 7.0, using 10 N HCl or 12 N NaOH as necessary. Sterile filter through 0.2 µm filter, and store at 4 °C.\n\tNOTE: Protocol can be paused here.\nThaw the needed number of Ln-1 aliquots in a refrigerator overnight.\nUsing sterile cell culture technique, add the appropriate buffer (either polyLM polymerization buffer from step 2.1 or control polymerization buffer from step 2.2) to laminin aliquots at a final concentration of 100 µg/mL (i.e. add 0.5 mL to 50 µg aliquots) and mix gently by pipetting.\nIf using fluorescently tagged laminin for visualization, reconstitute and add at 1:50 wt/wt ratio (e.g. 2 µg/100 µg) and mix gently by pipetting.\n\tNOTE: If using laminins as a substrate for cell attachment, follow steps 2.6-2.8:",
    "Immediately after dilution in appropriate buffer, transfer laminins onto culture plastic or glassware and incubate overnight in a cell culture incubator at 37 °C. Note that when coating coverslips, add a sufficiently large volume as to produce an equilibrated drop (typically, use 50 µL for a 13 mm round coverslip), and keep in a humidified chamber overnight at 37 °C.\nUsing sterile technique27, wash with 1x phosphate buffered saline (PBS).\nRemove the liquid carefully. Do not allow surface to be completely dry.\n\tNOTE: If using laminins to cover cells for milk protein induction, follow steps 2.9-2.12:\nCulture mammary epithelial cells. Culture MepG dystroglycan knock in (DgKI) or MepG dystroglycan knockout cells (DgKO) cells in DMEM-F12 supplemented with 2% FBS, 0.01 mg/mL insulin, 0.005 µg/mL EGF, 0.05 mg/mL gentamycin, and 0.05 g/mL normocin.\nSeed DgKO and DgKI cells for laminin stimulation at 10,500 cells/cm2 in well plates or coverslip bottom dishes\nIncubate diluted laminins in a cell culture incubator at 37 °C for 30 min.\nCentrifuge polyLM aliquots at 2,000 x g for 20 minutes, but centrifuge LM in neutral pH at 20,000 x g for 20 minutes due to the smaller size of the protein entities and need for higher speeds to collect effectively.\nUsing sterile technique27, remove the supernatant gently, and resuspend in an appropriate volume of induction medium of DMEM-F12 supplemented with 3 µg/mL prolactin, 2.8 µM hydrocortisone, and 5 µg/mL insulin\nTransfer laminin in cell culture medium immediately to stimulate cells. We have successfully stimulated cells with 50-800 µg/mL Ln1\n3. Laminin polymerization using isolated glycoproteins\nThaw recombinant nidogen-1 and Ln1 gently on ice in the refrigerator overnight.",
    "Mix Ln1 with nidogen-1 at a 1:1 wt/wt ratio in cell culture medium using low protein binding tips and tubes and using sterile technique. Use pure Ln1 in cell culture medium as a control.\nIf using fluorescently tagged laminin for visualization, reconstitute and add at 1:50 wt/wt ratio (e.g., 2 µg/100 µg). Gently mix by pipetting.\nIncubate Ln1-nidogen or control Ln1 in a cell culture incubator at 37 °C for 30 min.\nCentrifuge Ln1-nidogen copolymers at 2,000 x g for 30 min and the control Ln1 at 20,000 x g for 30 min.\nGently remove the supernatant and resuspend in cell culture medium to a final concentration of 100-800 µg total protein/mL.   \nUse immediately to stimulate cells, or transfer to coverslips and allow to adhere overnight at 37 °C in humidified cell culture incubators.\nRemove culture medium from coverslips, wash coverslips with 1x PBS, and then fix with 10% formalin (i.e., 4% formaldehyde in PBS) for 15 minutes at room temperature.\n4. Laminin polymerization using dystroglycan expressing cells\nCulture mammary epithelial cells. Culture MepG dystroglycan knock in (DgKI) or MepG dystroglycan knockout cells (DgKO) cells in DMEM-F12 supplemented with 2% FBS, 0.01 mg/mL insulin, 0.005 µg/mL EGF, 0.05 mg/mL gentamycin, and 0.05 g/mL normocin.\nSeed DgKI cells at 5,000 cells/cm2, and seed DgKO cells at 8,000 cells/cm2 due to differences in growth rates. Culture at 37 °C in humidified incubators with media changes every 2-3 days and passages every 4-5 days using a rigorous sterile technique. Count cells carefully with a hemocytometer or automated cell counter27 to ensure appropriate growth rates.",
    "Seed cells for laminin stimulation at 10,500 cells/cm2 in well plates or coverslip bottom dishes and culture for 2 days, using DgKI cells to generate fractal Ln1 and DgKO cells as negative controls. Thaw Ln-1 gently overnight on ice in a refrigerator, and then mix with induction medium of DMEM-F12 supplemented with 3 µg/mL prolactin, 2.8 µM hydrocortisone, and 5 µg/mL insulin. For a 35 mm dish, use 1 mL of induction media with 50-800 µg of Ln1.\nIf using fluorescent Ln1, mix in at 50:1 wt/wt ratio.\nRemove media from cells, and cover with laminin and induction media of DMEM-F12 supplemented with 3 µg/mL prolactin, 2.8 µM hydrocortisone, and 5 µg/mL insulin  \nCulture cells for 2 days, and then fix with 10% formalin.\n5. Characterization of laminin microstructure via optical microscopy\nCollect fixed samples and wash 3 times with 1x PBS at room temperature for 5 min.\nBlock and permeabilize samples in 1x PBS with 0.5% Triton X-100, 3% bovine serum albumin, 10% goat serum, and 40 µg/mL anti-mouse blocking antibody fragment for 1 h at room temperature in a humidified chamber.\n\tNOTE: Triton X-100 is hazardous. Handle with gloves and eye protection and dispose of appropriately.\nMix anti-laminin antibody at a dilution of 1:100 with 1x PBS with 0.5% Triton X-100 and 3% BSA and add to samples for 2 h at room temperature or overnight at 4 °C in a humidified chamber (typically use tip boxes with a wet laboratory wipe in the bottom).\nRemove primary antibody and wash 3 times with 1x PBS with 0.5% Triton X-100 and 3% BSA.\nAdd an appropriate secondary antibody at a dilution of 1:500 to samples in 1x PBS with 0.5% Triton X-100 and 3% BSA and incubate at room temperature in the dark in a humidified chamber.",
    "Remove secondary antibody and wash 3 times with 1x PBS with 0.5% Triton X-100 and 3% BSA.\nFor samples containing cells, add 6 µM phalloidin for 45 min, followed by 3 washes with PBS with 0.5% Triton X-100 and 3% BSA, and followed by 3 washes with PBS. Then stain with 0.1 µg/mL DAPI in PBS for 5 minutes.\nMount samples if appropriate.\nImage ln-1 structure using high resolution confocal microscopy. Use a laser scanning microscope equipped with immersion objectives (water immersion Plan Apochromat 40X/1.1NA or oil immersion Plan Apochromat 63X/1.4NA).\n6. Characterization of laminin constructs via box counting dimension\nAnalyze for fractal properties using box counting dimension algorithms available in Matlab toolboxes or in ImageJ. These methods threshold images of laminin and plot on a log-log plot the number of boxes containing Ln1 compared to the size of the boxes. The slope of the relationship between these parameters is the box-counting dimension: non-fractal geometries will have a dimension of 0, 1, or 2, whereas fractal geometries have a non-integer dimension28.\n\tNOTE: Acid-treated, glycoprotein-treated and DgKI cell-attached Ln1 all have a box-counting fractal dimension of ~1.7, whereas control Ln1 has a fractal dimension of 2.0.\n7. Characterization of laminin constructs via electron microscopy\nResuspend laminins in cell culture media and allow to adsorb to silica wafers for 90 min in a humid 37 °C environment.\nFix matrices in 2.5% glutaraldehyde in 0.1 M sodium cacodylate buffer at pH 7.2.\n\tNOTE: Glutaraldehyde is hazardous and should be handled in a fume hood with gloves and eye protection and disposed of as hazardous waste.\nPostfix matrices in 1% osmium tetroxide in 0.1 M sodium cacodylate buffer at pH 7.2.",
    "NOTE: Osmium tetroxide is hazardous and should be handled in a fume hood with gloves and eye protection and disposed of appropriately. Cacodylate is hazardous and should be handled in a fume hood with gloves and eye protection and disposed of appropriately.\nWash 3 times in sodium cacodylate buffer at pH 7.2.\nDehydrate with increasing concentrations of ethanol.\nSputter coat matrices with a thin layer of gold.\nImage using scanning electron microscopy.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}