{
  "id": 4683,
  "origin_website": "Bio",
  "title": "The Use of a Dexamethasone-inducible System to Synchronize <em>Xa21</em> Expression to Study Rice Immunity",
  "procedures": [
    "Rice growth conditions Sow 12-20 rice seeds on filter paper in a petri dish (10 cm diameter) with 10 ml of sterile water and place it in an incubation chamber for one week.Transplant one-week old seedlings into 5 ½ inch pots (three seedlings per pot) and grow them in the green house for approximately another five weeks. For irrigation, keep individual pots in supertubs filled with fertilized water until four weeks then continue filling super tub with reverse osmosis water. Notes: Water level should be maintained near the soil surface but not higher to prevent green algae from covering the soil in the pots.A maximum capacity of 24 pots is possible per supertub, but 12 pots are optimum for these experiments to allow spacing between pots. When the flag leaf is fully extended but before panicle emergence (approximately six weeks after germination) transfer plants to walk-in growth chamber for Xoo inoculation and dexamethasone treatment.Notes: Allow a minimum of three days for plants to equilibrate to chamber conditions before inoculation.Roots often grow out of the bottom of the pots. Take care to minimize root damage while transferring plants to walk-in chambers. Rice inoculation with XooTwo days before transferring plants to the walk-in growth chamber, transfer 30 μl of Xoo from -80 °C to a PSA solid media containing cephalexin and incubate at 28 °C for three days until a biofilm is formed.Note: If needed, after biofilm formation Xoo can be stored at 4 °C until ready to proceed, but should not be stored for more than two weeks. Two days before inoculating rice plants, subculture approximately 1 cm diameter of Xoo from the original PSA solid media containing cephalexin to a new PSA solid media containing cephalexin and incubate at 28 °C for an additional two days until biofilm has formed.",
    "On the day of inoculation, suspend Xoo from the most recent PSA solid media containing cephalexin in sterile H2O to OD600 = 0.5.Inoculate rice leaves by dipping scissor tips into the Xoo suspension and cutting the leaf approximately 2-3 cm away from the leaf tip of the 1st and 2nd leaves, or just 2nd leaf. Expected bacterial load immediately after inoculation is approximately 1 x 105 cfu/ml (Song et al., 1995). Note: For a non-inoculated control, rice leaves should be clipped with scissors dipped into water alone. Allow five to seven days after inoculation for Xoo to spread from the inoculated region and form a more even distribution across the rice leaves.Note: Five to seven days after inoculation was selected because based on previous experiments (Song et al., 1995), Xoo was shown to be completing log growth phase during that period of time. After seven days, disease symptoms begin to be more visibly pronounced. Dexamethasone foliar sprayPrepare 30 μM dexamethasone + 0.01% Tween-20 fresh (400 ml) in 550 ml spray bottle on the day of foliar application.Spray 200 ml of dexamethasone per supertub from a distance of 12-24 inches away from plants, walking around tub as you spray and moving in an up and down motion to ensure spray is being applied evenly to all portions of the plants. Notes: Avoid bumping or disturbing the plants at this step or dexamethasone solution will slide off the leaves. If walk-in growth chamber has a strong circulating fan, plants should be placed in a less windy area within the growth chamber for dexamethasone application as the fans will cause dexamethasone to evaporate too quickly and dexamethasone uptake may not be as uniform.",
    "Plants can be returned after dexamethasone solution is no longer visible on the surface of leaves (after 1 to 2 h). Harvest tissues at the desired time points after dexamethasone treatment. To harvest tissue, 3 to 5 cm at the inoculated leaf tip were cut with sterilized scissors and immediately frozen in liquid nitrogen."
  ],
  "subjectAreas": [
    "Microbiology",
    "Plant Science"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}