{
  "id": 13185,
  "origin_website": "Jove",
  "title": "4D Microscopy: Unraveling Caenorhabditis elegans Embryonic Development Using Nomarski Microscopy",
  "procedures": [
    "1. Grow C. elegans on Petri dishes\nPrepare NGM plates and seed them with E. coli OP50 as the food source (Figure 1). Grow and maintain C. elegans as described17. Store seeded plates at 4 °C for up to one month.\nAdjust the plates to the desired temperature before adding the worms.\n\t\nTo transfer the worms, remove a chunk of agar from an old plate and place it on a fresh plate.\nAlternatively, capture single animals with a sterile worm picker (a 1-inch piece of 32-gauge platinum wire with a flattened tip, mounted onto the tip of a Pasteur pipette) and place them on the new plate.\nGrow the worms at the desired temperature.\n\t\nGrow C. elegans worms at 20 °C, the standard temperature. However, to analyze the development of thermo-sensitive mutants, perform an overnight incubation, usually at 25 °C. Adjust the duration and temperature of this incubation as needed, depending on the specific mutant.\n2. Prepare the 4D microscopy recording before mounting the embryos (Figure 2)\nSet up the microscope and temperature controls before preparing the embryo. C. elegans embryos divide very quickly. Be prepared to begin recording immediately after mounting the embryos.\nAdjust the recording temperature to either 15 °C, 20 °C or 25 °C.\n\t\nRoutinely record the embryos at 25 °C. Record thermo-sensitive mutants at the restrictive temperature to show their phenotypes. Record a WT control (if done in a different preparation) at the same temperature as the mutants.",
    "NOTE: WT embryos develop faster at 25 °C and slower at 15 °C without additional differences in cell lineage. Place microscopes in a temperature-controlled room. Additional control by cooling or heating the slide is highly desirable. This can be achieved by circulating water at a specific temperature through a metal ring around the microscope objective and condenser. The objective and the preparation are in direct contact through the immersion oil and the temperature transfer is efficient. This system allows for precise control of the recording temperature and for performing temperature shifts during embryo development.\nDefine the record parameters in the microscopy software.\n\t\nFor a standard C. elegans recording (without fluorescent scans), select:\n\t\tz-stacks of 30 focal planes, at a distance of 1 micron each.\n\t\t30 second intervals between the beginning of each z-stack.\n\t\t1500 z-stacks (12.5 hours of record).\n\t\tNOTE: Both commercial as well as open source microscope control programs can be used to define this workflow for capturing images. Now the microscope is ready to record.\n3. Prepare and mount the embryos\nPrepare a thin, homogeneous agar pad as the first step in obtaining a nice image (Figure 3).\n\t\nPrepare 50 ml of a 4.5% agar solution in deionized water. Heat to boiling in the microwave and pour 0.5 – 1 ml into 3 ml glass tubes.\nCarefully seal the tubes with wax film to avoid desiccation. Sealed agar tubes can be stored at room temperature for up to two months.\nOn the lab bench, have a heat block at 80 °C with:\n\t\ta test tube of pure petroleum jelly (melted), with a fine paint brush inside.\n\t\ta test tube with distilled water containing a Pasteur pipette.",
    "NOTE: This ensures that all the required materials will be hot, and the agar will not solidify in the process of making the pad.\nRemove the wax film from the top of one of the agar tubes, and carefully heat it over an alcohol burner to melt the agar. Exercise caution as hot agar expelled from the glass tube could cause burns.\nOnce the agar is melted, place the tube in the heat block to keep the agar in liquid form.\nAlternatively, place the agar tubes into the heat block 1h before the experiment to melt them without using a burner. The melted agar should be discarded after one day.\nPlace a microscope slide (Slide A) between two others on a piece of plastic.\nTake another slide (Slide B) and hold it with your fingers in one hand.\nWith the other hand, place a small drop of melted agar in the center of Slide A using the warm Pasteur pipette.\nImmediately press slide B onto the agar drop to create a very thin pad between Slides A and B. Keep these slides sandwiched together until step 3.2.3.\nMount the embryos.\n\t\nCollect 5-10 gravid hermaphrodites with the picker and place them in a watchmaker glass filled with water.\nUse a scalpel to cut open the hermaphrodite nematodes and extract early eggs (1-4 cells) from the uterus, under the stereomicroscope.\nTake the slide from step 3.1.10 and gently slip Slide B off to expose the agar pad on Slide A.\nPlace an early egg in the center of the agar pad by pipetting with a capillary tube.\nAlternatively, pipette a drop containing a set of embryos onto the agar pad and then search for early-stage embryos. Do this step under the stereomicroscope.",
    "If necessary, move the egg by nudging it with an eyelash glued to the end of a toothpick.\nRemove excess water with the capillary pipette.\n\t\tNOTE: A capillary pipette can easily be prepared by heating a Pasteur pipette over an alcohol burner and pulling it from both ends.\nCarefully cover the preparation with a coverslip. To avoid air bubbles, place one edge of the coverslip on the slide and gently slide a scalpel along the adjacent edge to slowly and obliquely drape the coverslip onto the preparation.\nUse a pipette to fill 3/4 of the space surrounding the agar pad with water. Leave 1/4 of the space with air.\nSeal the coverslip with petroleum jelly to avoid desiccation during long recording periods.\nUse the fine brush to extend a thin layer of melted petroleum jelly around the edge of the coverslip.\n\t\tNOTE: Now the preparation is ready for recording.\n4. Adjust the DIC and start the 4D microscopy recording\nPlace the slide on the microscope stage. Focus the embryo using the low magnification objective (5x or 10x).\nChange to the 100x immersion objective.\nAdjust the optical components of the microscope to get a Nomarski image.\n\t\nFocus the condenser.\nCompletely open the aperture of the condenser and close the field diaphragm (this will provide a higher numerical aperture and therefore, greater resolution).\nCheck that both polarizers on the microscope are oriented to cause the maximum light extinction.\nTurn the Wollaston prism to get a nice three-dimensional image of the embryo, illuminated on one side. Turn the prism in the other direction to get the effect of having the embryo illuminated on the other side.\n\t\tNOTE: These steps can be performed on a test sample before the recording so that only fine tuning is required on the specimen being analyzed.",
    "Launch the image capture in the microscope.\n5. Analyze the 4D-movie (Figure 4).\nNOTE: Once the recording is complete, use cell lineage tracing software to reconstruct and analyze cell lineage.\nCell lineage tracing software is a powerful tool for performing detailed analyses of embryonic development or dynamics in cell cultures or tissue fragments. The program extracts and quantifies several data sets on the sample’s cellular dynamics that include generation of the complete cell lineage of each and every recorded cell, including cell divisions, cell cycle length, migration or apoptosis as well as its kinetics. In addition, cell differentiation can be scored by the cell’s morphological changes or by expression of specific markers. Basically, the software screen displays two windows: on the left window, the 4D movie can be played forward and backward or up and down to either the top or bottom levels so that each cell can be followed in time and space throughout the recording. On the right widow, the cell lineage is generated. Clicking on a cell nucleus in the 4D movie generates a point in the lineage window that stores the information of the cell name, fate and spatial coordinates. The cell lineage of a specific cell is generated by playing the 4D movie forward and clicking periodically on the nucleus to mark the mitosis of that specific cell over time. Repetition of this process for each of the recorded cells generates the complete cell lineage of the embryo or sample. The stored information for spatial coordinates of each cell is later used to reconstruct 3D embryo models and cell migration paths.\nOpen the lineage tracing software and create a new project by going to the upper bar menu and selecting:\nFile | New project.",
    "Select the cell lineage template depending on the recording temperature: DB08 for recording at 25 °C, DB10 for recording at 20 °C and DB12 for recording at 15 °C.\nSet the recording parameters in the emerging window: scan count (usually 1500), time between scans (30 seconds), level count (30) and distance between levels (1 micron).\nSelect the image file and format.\n\t\nSelect the image directory where the images were saved.\nChoose whether images should be saved as single images (one image per level and time) or as multi-image z-stacks.\nDetermine the file naming and image format. Routinely, single images are saved under the following names:\n\t\tX0000L00C1 (for scan 0, level 0, channel 1)\n\t\tX0000L01C1 (for scan 0, level 1, channel 1)\n\t\tX0000L02C1 (for scan 0, level 2, channel 1)\n\t\t...\n\t\tX0001L00C1 (for scan 1, level 0, channel 1)\n\t\tX0001L01C1 (for scan 1, level 1, channel 1)\n\t\t...\n\t\tX0300L04C1 (for scan 300, level 4, channel 1)\n\t\t...\n\t\tNOTE: Saving the images in a compressed format saves space on your hard disk.\nDefine the light channels: 1 for DIC optics, 2 for GFP, 3 for RFP, etc. Add those that were used in the 4D-recording. Click on “channel processing enabled” to detect them.\nStart tracing the cell lineage of the embryo. The screen now contains two major windows: the video window and the cell lineage window.\n\t\nOn the lineage window, select a lineage branch and use the mouse to click the cell nucleus corresponding to this cell on the video window.\nFollow the cell spatially and over time by playing the 4D-movie forward, backward, or up or down a level, using the cursor keys.",
    "Periodically click on the cell nucleus. This generates a point in the lineage branch and registers the spatial coordinates of the cell at this time. As a result, cell lineage progresses, and 3D reconstructions of the embryo are possible.\nMark mitosis by clicking the return key. Then select one of the daughter cells and follow it as before.\nRepeat the process (steps 5.6.1 to 5.6.4) for the rest of the embryonic cells to trace the complete cell lineage, or to follow specific cells of interest such as those undergoing apoptosis.\nCompare the mutant lineage with the stereotyped WT C. elegans cell lineage."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}