{
  "id": 16876,
  "origin_website": "Jove",
  "title": "Single Molecule Fluorescence Energy Transfer Study of Ribosome Protein Synthesis",
  "procedures": [
    "1. Preparation of labeled ribosome and tRNA for FRET detection\nIsolate ribosome without L27 from E. coli strain IW312 according to standard protocols20,21. Extract the regular ribosome from E. coli strain MRE600.\nClone the L27's rpmA gene with C-terminal His-tag into pET-21b (+) plasmid, which is transformed and expressed in BL21(DE3)pLysS cells15. Purify the protein via a prepacked sepharose column.\nLabeling of L27\n\t\nIncubate 20-100 μM of purified L27 in 100 μL with 2-10-fold excess of TCEP (Tris-2-carboxyethyl-phosphine) at room temperature (RT) for 30 min. Buffer exchange the solution into PBS buffer (10 mM Na2HPO4, 1.8 mM KH2PO4, 2.7 mM KCl; 0.137 M NaCl), using a nap-5 column. Add 10-fold excess Cy5-maleimide mono-reactive dye in DMSO into the solution and incubate at RT in the dark for 2 h.\nLoad the labeled protein solution (500 μL) mentioned above on a Nap-5 column to remove the excess dye. Ensure that the protein elutes in the first colored band, followed by the free dye elute in the second band, respectively. Collect the eluted protein in 1 mL of TAM10 buffer (20 mM tris-HCl (pH 7.5), 10 mM Mg (OAc)2, 30 mM NH4Cl, 70 mM KCl, 0.5 mM EDTA, and 7 mM BME (2-mercaptoethanol)).\nReconstitute the ribosome with L27. Mix the labeled L27 protein with an equal amount of IW312 ribosome in TAM10 buffer and incubate at 37 °C for 1 h. Remove the free protein by sucrose cushion ultracentrifugation (100,000 x g, overnight) to allow the ribosome to form a blue-colored pellet at the bottom of the tube.",
    "Label the tRNAPhe according to the previously published report22. First, incubate the tRNA (10 A260 in 1 mL of water) with 100 μL of NaBH4 (100 mM stock, adding dropwise) at 0 °C for 1 h. Free the tRNAs from unreacted NaBH4 via three-time ethanol precipitation by adding 1/10 volume of 3 M KAc (pH 5.0) and 2.5x volume of ethanol. Incubate the reduced tRNA with 1 μL of Cy3-NHS dye solution (1 mg in 10 μL of DMSO) in a minimum volume (~20 μL) of 0.1 M sodium formate (pH 3.7). After 2 h of incubation at 37 °C, separate the tRNA from the unreacted dye via a small G25 Sephadex column, and then remove the free dye via two-time ethanol precipitation.\n2. Preparation of the ribosome complexes\nExpress and purify the His-tagged proteins of IF1, IF2, IF3, EF-G, EF-Tu, EF-Ts, and tRNA synthetases using standard methods15.\nPrepare the initiation mix by adding the following ingredients in TAM10 buffer at 37 °C for 15 min: 1 µM of the labeled ribosome; 1.5 µM each of IF1, IF2, and IF3; 2 µM biotinylated mRNA (coding MF for the first two amino acids); 4 µM of charged fMet-tRNAfMet; and 1 mM GTP.\nPrepare the EF-Tu_G mix by mixing the following ingredients in TAM10 buffer at 37 °C for 15 min: 4 µM EF-Tu, 0.4 µM EF-Ts, 2 µM EF-G, 4 mM GTP, 4 mM PEP, and 0.02 mg/mL of Pyruvate Kinase.\nPrepare the EF-Tu_NoG mix similar to step 2.3 without EF-G.\nPrepare the Phe mix by mixing the following ingredients in nuclease-free water at 37 °C for 15 min: 100 mM Tris (pH 7.5), 20 mM MgAc2, 1 mM EDTA, 4 mM ATP, 7 mM BME, 2 mM Phenylalanine-specific synthetase, 2 A260/mL of labeled tRNAPhe, and 50 μM phenylalanine.",
    "Prepare the pre-translocation complex (PRE) by mixing the initiation, EF-Tu_NoG, and Phe mixes in the ratio of 1:2:2, at 37 °C for 2 min. After incubation, purify the PRE by 1.1 M sucrose cushion ultracentrifugation overnight at 100,000 x g.\nPrepare the post-translocation complex (POST) by mixing the initiation, EF-Tu_WG, and Phe mixes in the ratio of 1:2:2, at 37 °C for 10 min. After incubation, purify the POST by 1.1 M sucrose cushion ultracentrifugation overnight at 100,000 x g.\n3. Preparation of sample slides\nClean the microscope glass slides (75 mm x 25 mm) containing six pairs of holes (1 mm in diameter). Each pair forms an inlet-outlet of the sample chamber. Ensure that the distance between each inlet-outlet hole is 13 mm and the center-to-center distance between two channels is 6 mm. Place six slides in a glass crucible.\nFill the crucible with acetone and sonicate them for 5 min. Decant the acetone and rinse the slides three times with ultrapure water. Fill the crucible again with water and 1 mL of 10 M KOH. Sonicate for 20 min.\nRinse the slides three times with ultrapure water. Fill the crucible again with ethanol and sonicate for 5 min. Completely decant the solvent. Let the slides dry in the fume hood.\nClean the microscope glass coverslips (#1.5 thickness, 24 x 40 mm). Perform the cleaning steps as described in steps 3.1-3.3.\nBake the cleaned slides and coverslips at 300 °C for 3 h. Keep them in the furnace overnight to cool.",
    "Coat the coverslip with aminosilane. In the crucible containing coverslips, pour in methanol mix (100 mL of methanol, 5 mL of water, 0.5 mL of HAc, and 1 mL of aminosilane). Warm the crucible in a water bath for 10 min, sonicate it for 10 min, and then warm the crucible in the water bath for another 10 min. Decant the methanol mixture, rinse the coverslip well in three crucibles of clean water. Purge the surfaces with a dry nitrogen stream through a needle.\nCoat the coverslips with biotin-PEG in a laminar clean hood.\n\t\nTo make the PEG solution, use 98 mg of PEG and 2-3 mg of biotin-PEG in 200 μL of 100 mM NaHCO3 solution.\nLay one coverslip flat on a surface. Carefully drop 60 μL of PEG solution on the top edge. Then, lay another coverslip on top of it, letting the capillary effect spread the solution between the two coverslips. Ensure no bubbles are formed.\nRepeat step 3.7.2 for two more pairs of coverslips. Coat six pieces of coverslips with biotin. If more coverslips are needed, adjust the amount of PEG and Biotin PEG accordingly to make more PEG solution.\nStore these coverslips in an empty tip-box filled with water and incubate for 3 h in the dark.\nAfter 3 h, separate the coverslips, rinse with water in three consecutive crucibles and purge with a dry nitrogen stream. Place the coated coverslips on a ceramic rack. Mark the surface with coating.\nAssemble the sample chambers19.\n\t\nPull sharp pipette tips through the holes on the glass slides until they fit tight. Scrape the sharp ends off until it is completely flat to the glass surface. Cut the other end of the tip to be approximately 5 mm for sample loading.",
    "Cut a double-faced tape with the channel pattern on it (25 x 40 mm).\nStick the double-faced tape onto the glass slides on the flat side.\nStick the coated coverslip onto the double-faced tape. Press on it to make a tight seal of the sample chamber. Make sure the coated side is facing inward.\n4. Single molecule FRET imaging\nTurn on the computer.\nTurn on the microscope switch.\nStart the laser control interface and turn on the laser. Push the enable button on the laser control box to warm up the laser.\nTurn on the cameras.\nStart the microscope-associated software program. Click the upper shutter Off and click the lamp On.\nPrepare the TAM10_WT buffer by adding 10 μL of 5% Tween-20 into 1 mL of TAM10 buffer.\nPrepare the deoxy solution by weighing 3 mg of glucose oxidase in a small microcentrifuge tube. Add 45 μL of catalase. Vortex gently to dissolve the solid. Spin at 20,000 x g in a microcentrifuge for 1 min. Take the supernatant.\nPrepare 30% glucose solution in water and 200 mM Trolox solution in DMSO.\nPrepare 0.5 mg/mL of streptavidin solution in nuclease-free water.\nAdd one drop of imaging oil to the TIRF objective.\nPut the sample chambers on the objective.\nFill the chamber with 10 μL of streptavidin solution. Wait for 1 min.\nWash the chamber with 30 mL of TAM10_WT buffer and collect the run-through solution with a folded filter paper. Wait for 1 min.\nDilute the ribosome complexes (PRE or POST) to 10-50 nM concentration with TAM10_WT buffer.\nLoad 20 μL of the ribosome sample into the channel. Wait for 2 min.\nMake the imaging buffer (50 μL of TAM10 buffer plus 0.5 μL each of deoxy, glucose, and Trolox solutions). Mix the buffer well.",
    "Flush the chamber with 30 μL of the imaging buffer.\nSet the camera to acquire 100 ms/frame, 16 bits, 4 x 4 binning.\nClick the upper shutter On and the lamp Off.\nStart camera acquisition. Spread the images into three windows representing two individual cameras and the overlay.\nClick on Auto-focus. Fine-tune to find the best focus.\nClick on a method. Set the field points, file storage, and the loop number.\nClick on Run.\n\tNOTE: A new window appears with real-time imaging. The progress of the time series and field of view series are shown at the top of the window.\nOnce the image acquisition is complete, close the popup window.\nOpen the ND file (acquired file).\nClick on ROI/ simple ROI editor. Choose the option Circle.\nSelect the ROI on the image. Click on Finish when it is complete.\nClick on Measurement/ Time Measurement to show the data either as a plot or as a spreadsheet.\nOpen the Export tab. Set the export parameters.\nClick on Export to save the intensities.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}