{
  "id": 1651,
  "origin_website": "Cell",
  "title": "Differentiation of functional astrocytes from human-induced pluripotent stem cells in chemically defined media",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nDifferentiation of human iPSCs into neural precursor cells\nTiming: 4–5 weeks\nThis section provides the detailed steps for obtaining neural precursor cells (NPCs) from hiPSCs. The first stage is based on the well established dual inhibition of SMAD signaling (Chambers et al., 2009[href=https://www.wicell.org#bib3]), using SB431542 together with Noggin for concomitant inhibition of TGFβ and BMP signaling. Other BMP inhibitors such as LDN193189 or dorsomorphin can be used instead of noggin. The second stage describes the amplification of NPCs leveraging FGF2 and EGF signaling (Boissart et al., 2013[href=https://www.wicell.org#bib1]).\nNote: Ensure of the hiPSC quality before starting the protocol. Human iPSCs should be at 70%–80% confluence and colonies to present an homogeneous aspect without differentiated cells.\nOn day 0, remove culture medium and add 1 mL of neural base medium to remove debris and cells in suspension from the dish.\nRemove medium and add 1 mL of Neural induction medium + Rock inhibitor Y27632 (10μM).\nWith a cell scraper, draw successive vertical lines in the 35 mm dish to cut iPSC colonies as shown below. Then rotate the dish by 90° and redraw the same pattern to obtain squares. Rotate the dish once more by 45° and redraw the same pattern. See Figure 1[href=https://www.wicell.org#fig1].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1114-Fig1.jpg\nFigure 1. Schematic to generate hiPSC clumps for spheroid formation\nUse the cell scraper to lift the clumps of iPSCs by gently scraping the bottom of the dish.\nGently transfer the entire clump suspension into a well of low-binding 6-well plate and add 1 mL of Neural induction medium + Rock inhibitor Y27632 (10μM). Incubate at 37°C for 4–6hrs until the clumps have formed spheroids.",
    "Transfer the entire spheroid suspension to a new 35 mm dishes coated with poly-L-ornithine/Laminin (PO/L). Add 8μL/mL of Laminin to the medium for spheroid attachment. Incubate at 37°C. The next day, most of the spheroids should have adhered to the plate. Troubleshooting 1[href=https://www.wicell.org#sec6.1]\nCritical: We found this way of forming spheroids to give the best results in term of purity of NPCs obtained. However, because it may be technically cumbersome to perform this technique without training, alternative methods can be used at this step: either spheroid formation using Aggrewell plates (STEMCELL Technologies), or induction after single cell hiPSC passaging such as described by Chambers et al.\nChange medium every other day. Check cell morphology every time for rosette appearance (Figure 2[href=https://www.wicell.org#fig2]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1114-Fig2.jpg\nFigure 2. Overview of the protocol generating hiPSC-derived NPCs\nThis timeline recapitulates the main steps to generate NPCs from hiPSCs with representative pictures of the expected cellular morphology at each intermediate: rosette appearance (A and B), clumps one day after rosette harvesting (C and D), NPCs 2 days after splitting (E) and NPCs at 100% confluent before splitting (F). Pictures (G and H) show an NPC population with low purity as assessed by the number of cells negative for PAX6 (G) and SOX2 (H). Conversely, pictures (I and J) show highly enriched NPCs with almost all cells expressing PAX6 (I) and SOX2 (J). The protocol can be paused and cells frozen for further use at P9 after NPC amplification. In the timeline, lozenges represent when an enzymatic passage should be performed (see step 13 for the procedure). Scale bar: 200 μm.\nOn day 10, remove neural induction medium and add 2 mL of NPC expansion medium.\nNote: Rosettes should be numerous by Day 10, either as monolayers or as multiple layers (Figure 2[href=https://www.wicell.org#fig2]B).",
    "On day 13, change medium as of Day 10. Select areas with high density of rosettes, cut them in squares with a needle, and lift them individually with a 200 μL micropipette. Troubleshooting 2[href=https://www.wicell.org#sec6.3]\nCritical: We recommend replating lifted rosettes on the same surface as previously cultured. Overall and after all the amplification steps, one 35mm dish of rosettes generates hundreds of millions of NPCs at the cell banking stage, pause point after step 15.\nCritical: The method described above generates a population of NPCs with the highest degree of purity (>95%). However, this method is time consuming and requires having a microscope under the laminar flow for optimal performance. Alternatively, rosettes can be harvested using the STEMdiff™ Neural Rosette Selection Reagent (STEMCELL Technologies). Please refer to manufacturer’s instructions: link[href=https://cdn.stemcell.com/media/files/pis/29031-PIS_1_1_3.pdf?_ga=2.73202899.175041898.1632491430-1765224757.1631649414]. Keep in mind that the efficacy of this reagent is hiPSC line dependent. A third possibility, in case of very high homogeneity in the culture dish, is to perform an enzymatic passage to harvest all cells at once and then to purify them as described in the troubleshooting 2[href=https://www.wicell.org#sec6.3] section.\nTransfer the clumps from the 35 mm dish to a new PO/L-coated 35 mm dish. From then, the cells are called NPCs and are at passage 1. Add Rock inhibitor Y27632 (10μM) to the medium (Figures 2[href=https://www.wicell.org#fig2]C and 2D).\nOn day 14, change NPC expansion medium and incubate the cells at 37°C.\nChange medium every other day and passage them after 6–7 days or at 80%–100% confluence if earlier. At this stage, we expect a yield of about 70′000 to 100′000 cells/cm2 so one 35 mm dish should yield enough cells for one to two T25 flasks.\nSplit the cells using TrypLE:",
    "Remove the culture medium and add 1 mL of TrypLE express per 35 mm dish (add 5 mL for a T75 flask). Incubate the cells at 37°C minutes for 10 min.\nHarvest the cells in flacon tubes and add twice the volume of DMEM/F-12. Centrifuge 5 min at 300 g.\nResuspend the cell pellet in culture medium and count the cells.\nSeed the cells in NPC expansion medium on matrigel-coated flasks (scale up flask size as needed) at 50′000 cells/cm2. Incubate at 37°C. NPCs are now at P2. Figures 2[href=https://www.wicell.org#fig2]E and 2F show representative pictures of NPC morphology during amplification.\nNote: Cellular identity of NPCs can be assessed from this point: >80% of cells obtained should express PAX6 and SOX2 (Figures 2[href=https://www.wicell.org#fig2]G–2J).\nChange medium every other day. Split NPCs when confluent. Cell growth should allow splitting every 3–4 days. Each splitting increases the passage number by 1.\nNote: Cells can be amplified for a total of 8 passages and banked at P9 at 5 million cells per vial.\nPause point: Pausing at this step allows generating important batches of NPCs with high survival after thawing (>70%) to directly start astrocyte differentiation from this step (troubleshooting 3[href=https://www.wicell.org#sec6.5]). See additional procedures at the end of the protocol for cell freezing. See Figure 2[href=https://www.wicell.org#fig2].\nDifferentiation of hiPSC-derived NPCs into astrocytes\nTiming: 6 weeks",
    "This section describes the steps to differentiate previously obtained NPCs into astrocytes. It relies on activation of the JAK/STAT pathway by concomitant exposure of NPCs to EGF and LIF in order to accelerate the glial switch (Bonni et al., 1997[href=https://www.wicell.org#bib2]) in absence of serum. LIF is instrumental to activate the JAK/STAT pathway while EGF inhibits premature differentiation of NPCs into neurons. Maturation of astrocytes is obtained by exposure to CNTF. This step can be performed after freezing/thawing of NPCs but has to be conducted to the end without pause once started. Thus, counting of days of differentiation restart at 0.\nOptional: In case a pause has been made between steps 15 and 16, cells need to be thawed to perform astrocyte differentiation. See additional procedures at the end of the protocol for cell thawing.\nAt D0 of astrocyte differentiation, change NPC culture medium to Astrocyte induction medium (Figure 3[href=https://www.wicell.org#fig3], left panel).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1114-Fig3.jpg\nFigure 3. Overview of the protocol generating hiPSC-derived astrocytes from NPCs\nThis timeline recapitulates the main steps to generate astrocytes from hiPSC-derived NPCs with representative pictures of the expected cellular morphology at each intermediate: thawed NPCs, differentiating cells and mature astrocytes. Cells can be banked at the end of the protocol after astrocyte maturation. On the central panel, white arrows indicate NPC niches, blue arrows indicate differentiating neurons and green arrows indicate emerging astrocytes. In the timeline, lozenges approximately represent the frequency of enzymatic passages (see steps 13 to 15 for the procedure). Scale bar: 200 μm.\nChange medium every other day for 14 days. Slit cells with TrypLE as described on Step 13 each time they reach confluence during this step (about every 3–4 days).",
    "Note: This step serves to trigger the glial switch in NPCs. It thus decreases the potential of NPCs to generate neurons and changes the epigenetic landscape of the cells to allow astrocyte generation. There is no need for massive amplification of the cells at this stage as the cells retain a certain proliferation potential until D21.\nAt D14, switch medium to Astrocyte medium + CNTF (20 ng/mL). Cells start to differentiate, and neurons and astrocytes can be seen in the culture (Figure 3[href=https://www.wicell.org#fig3], central panel).\nFrom D14 to D28, change medium every other day and passage cells when at confluence (do not passage them if confluence is <90%–100%, however cells can be allowed to overgrow). Seed cells at 40′000 cells/cm2 onto matrigel-coated flasks and incubate at 37°C. Refer to troubleshooting 3[href=https://www.wicell.org#sec6.5] for evaluating how many flasks are needed depending on the expected yield of astrocytes.\nCritical: Proliferation will decrease as NPCs differentiate. The extent of this decrease is dependent upon each iPSC line. Neurons may appear in the culture concomitantly to astrocytes. Overall, neurons will die at each splitting to let only astrocytes in culture at the end of the protocol. Between D14 and D21, cells should mostly have an NPC morphology with some neurons. Between D21 and D28, a mix of NPCs, neurons and immature astrocytes should be present in the culture. From D28, astrocytes should start to represent most of the cells in culture. Some neurons and NPCS may remain until D35 but should be scarce. Troubleshooting 4[href=https://www.wicell.org#sec6.7].\nFrom D29 to D42, change medium once every three to four days and plate cells at 20′000 to 30′000 cells/cm2 passaging them as described in step 13.",
    "Note: As astrocytes mature, they become bigger and have to be plated at a lower density to allow proliferation and obtain a good yield.\nAfter D42, cells are mature and can be used for downstream experiments (Figure 3[href=https://www.wicell.org#fig3], right panel). Culture cells in Astrocyte medium without CNTF from that day onward. Astrocytes retain their phenotype until at least D70 but should be passaged as rarely as possible.\nOptional: Cells can be frozen in Astrocyte medium + 10% DMSO at this stage. Cells retain their phenotype and functionality after thawing. Viability after thawing is usually between 50% to 70%. Troubleshooting 5[href=https://www.wicell.org#sec6.9].\nAdditional procedures:\nCell freezing\nDetach the cells from the plate with TrypLE and harvest them.\nCount them and centrifuge 5 min at 300 g.\nResuspend the cells at 5 million/mL in Astrocyte medium supplemented with DMSO 10%.\nDistribute 1 mL per cryovial and store at −80°C in a Mr FrostyTM container. Transfer the cells in liquid nitrogen after 3 days for long-term storage.\nThawing procedure:\nPrepare a falcon tube containing 9 mL of astrocyte medium per vial to be thawed.\nIncubate one vial of NPCs in a water bath at 37°C for 1 min.\nTransfer the content of the vial into the falcon tube with astrocyte medium.\nCentrifuge for 5 min at 300 g.\nResuspend the cell pellet in 10 mL of cell culture medium supplemented with Y27632 (10 μM).\nPlate the cells in one matrigel-coated T75 flask.\nChange the medium after 24hrs with culture medium to remove Y27632."
  ],
  "subjectAreas": [
    "Stem Cells",
    "Cell Culture",
    "Cell Biology",
    "Neuroscience",
    "Cell Differentiation"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}