{
  "id": 2514,
  "origin_website": "Cell",
  "title": "Transwell migration assay to interrogate human CAR-T cell chemotaxis",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nIsolation of human peripheral blood T cells\nTiming: 3 h\nThis section briefly describes the isolation of peripheral blood mononuclear cells (PBMCs) from whole blood and pan T cell enrichment that follows. When isolating PBMCs a variety of different starting materials may be used (e.g., whole blood, buffy coat, leukoreduction system chamber, etc.). The procedure described here may need to be adjusted depending on the cell density of these alternative products.\nCritical: Follow national regulations as well as institutional guidelines regarding biohazardous materials when handling whole blood.\nNote: Unless otherwise specified, all steps are to be carried out in a laminar flow hood, using proper aseptic technique.\nDetermine the volume of whole blood to be processed.\nCalculate the number of T cells to be transduced on day 2, add one to account for a non-transduced condition and multiply by 1.8.\nIsolate PBMCs using density gradient centrifugation.\nDilute the whole blood by adding one part PBS. Mix gently with a serological pipette.\nDispense 15 mL of density gradient medium (such as Histopaque-1077) into sterile 50 mL conical tubes (each tube can process 35 mL of diluted blood).\nCarefully layer the diluted blood onto the density gradient medium. This is best achieved by holding the tube at a 45° angle, leaning against the side of the tube with the pipette tip and slowly releasing the diluted blood.\nNote: Take care not to disrupt the layer between the density gradient medium and the diluted blood. Over time some red blood cells may have already settled to the bottom of the tube prior to centrifugation. This is expected, proceed with the centrifugation as described.",
    "Centrifuge the samples at 1,000 × g for 20 min at 20°C in a swinging-bucket rotor. Make sure the brake is set to 0 (Figure 1[href=https://www.wicell.org#fig1]).\nUsing a serological pipette carefully transfer each PBMC layer into new 50 mL conical tubes. Fill the tubes with PBS before centrifuging at 520 × g for 15 min at 20°C (default brake settings may be reapplied).\nAspirate the supernatant and discard. Resuspend the cell pellets in 5 mL of PBS each and pool PBMCs from the same donor into a single 50 mL conical tube. Fill the tube with PBS and note the cell count of PBMCs using a hemocytometer or an automated cell counter.\nIsolate pan T cells by magnetic enrichment.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2021-Fig1.jpg\nFigure 1. Whole blood after density gradient centrifugation\nUpon centrifugation there should be four distinct layers in each tube. From top to bottom: plasma, PBMCs, density gradient medium and red blood cells.\nCentrifuge the tube at 520 × g for 10 min at 20°C.\nAspirate the supernatant and discard. Resuspend the cell pellet in 80 μL of cold MACS buffer per 107 cells.\nResuspend CD3 Microbeads thoroughly by vortexing for 15 s and add 20 μL of beads per 107 cells. Mix the sample well by pipetting up and down. Incubate for 15 min at 4°C.\nSubsequently add 2 mL of cold MACS buffer per 107 cells and centrifuge the sample at 300 × g for 10 min at 4°C.\nIn the meantime, prepare for cell separation by attaching an LS Column onto a compatible MACS separator. Put a 50 mL conical tube under the column to catch the flow through and apply 3 mL of cold MACS buffer onto the column.",
    "Once the centrifuge is done, aspirate the supernatant and discard. Resuspend the cell pellet in 500 μL of cold MACS buffer. Add another 50 μL of buffer for every 107 cells exceeding the first 108 cells.\nLoad the cell suspension onto the prepared LS Column.\nAfter it flows through completely wash the column with 3 mL of cold MACS buffer. Repeat this step two more times.\nDiscard the flow through and put a new 50 mL conical tube under the column.\nApply 5 mL of cold MACS buffer and immediately afterwards put on the plunger. Maintain a moderate continuous push to recover the labeled pan T cells.\nAdd 25 mL of cold MACS buffer and perform a cell count.\nActivation of pan T cells\nTiming: 2 days\nThis step enables the efficient transduction of T cells, as γ-retroviruses are able to transduce dividing cells only.\nPrepare pan T cells for transduction by providing them with appropriate stimuli.\nDetermine the amount of medium required to achieve a cell density of 106 cells/mL and prepare enough c-hTcm (complete human T cell medium) by supplementing hTcm (human T cell medium) with 200 U/mL (14.45 ng/mL) IL-2, 5 ng/mL IL-15 and 50 μM 2-ME.\nNote: c-hTcm should be prepared freshly each time.\nResuspend CD3/CD28 T cell Activator Dynabeads by vigorously vortexing the vial for 30 s.\nAiming for a bead-to-cell ratio of 1:3, transfer the volume required into a tube.\nWash by adding an equal amount or 1 mL of PBS, whichever is higher. Put the beads in PBS on a magnet for 1 min and remove the liquid, leaving the beads behind.\nResuspend the beads in the same volume of c-hTcm as initially transferred.\nNote: Alternative activation methods (i.e., stimulatory beads from other vendors or antibody coated plates, etc.) are also viable.",
    "Centrifuge pan T cells at 400 × g for 10 min at 20°C. Aspirate the supernatant and discard.\nResuspend the cell pellet in c-hTcm at a concentration of 106 cells/mL.\nSeed pan T cells in a 6-well plate in a final volume of 3–4 mL/well.\nDispense the prepared beads into individual wells at a final bead-to-cell ratio of 1:3. Make sure that beads are well-dispersed by pipetting up and down.\nIncubate the cells for 48 h at 37°C with 5% CO2.\nTransduction and expansion of pan T cells\nTiming: 2–4 days\nThis section deals with T cell transduction using a γ-retroviral delivery system as an example. Other gene editing techniques, viral or otherwise, might be utilized to achieve similar results. At the end of this section, T cells should stably express the anti-MSLN-CAR along with CXCR6 on their surface. Control cells that only express the anti-MSLN-CAR and non-transduced cells should also be generated (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2021-Fig2.jpg\nFigure 2. Graphical depiction of the transduction workflow\n(A day before transduction) Prepare Retronectin -coated plates.\nPrepare a 6.25 μg/mL solution of Retronectin diluted in PBS.\nDispense 400 μL of diluted Retronectin into wells of a non-tissue treated 24-well plate. Incubate at 4°C for 16–20 h.\n(On the day of transduction) Prepare virus and the Retronectin -coated plates for transduction.\nAspirate and discard Retronectin solution in the 24-well plate prepared the day before. Promptly add 500 μL of blocking buffer (2% BSA in PBS) into each Retronectin-coated well. Incubate on the bench for 30 min.\nIn the meantime, thaw viral supernatant of constructs that will be used.\nAfter 30 min of blocking, remove the blocking buffer and wash the wells with 1 mL of PBS before depositing 1 mL of viral supernatant to wells that will be used for transduction.",
    "Centrifuge the loaded plate at 3,000 × g for 1.5 h at 32°C.\nNote: Check the limitations of the specific centrifuge intended for use beforehand to ensure a safe workplace.\nTransduce and expand T cells.\nExamine the isolated T cells under an inverted tissue-culture microscope. T cells should be blasting and forming clusters.\nResuspend the stimulated T cells well by pipetting up and down. Transfer them into a 50 mL conical tube and perform a cell count.\nCentrifuge the cells at 400 × g for 5 min at 20°C. Aspirate the supernatant and discard.\nResuspend the cell pellet in freshly supplemented c-hTcm at a concentration of 106 cells/mL.\nAfter 1.5 h of centrifugation remove the viral supernatant from wells of the now virus-coated Retronectin plate and promptly deposit 1 mL of T cells suspended in fresh c-hTcm.\nReturn to a 37°C incubator. Every other day perform a cell count and subculture cells in fresh c-hTcm. Check transduction efficiency as early as 72 h after transduction using a flow cytometer.\nNote: Transduction efficiency can be determined using a variety of methods (e.g., a bicistronic vector that codes for a fluorescent protein along with the gene of interest, an epitope tag, etc.). The CAR constructs described in this work incorporate a MYC tag, which enables the identification of transduced T cells by fluorescently labeled antibodies.\nTranswell migration assay\nTiming: 8 h\nThe transwell migration assay evaluates cell migration through the use of a chemotactic gradient. In this form of assay, a cell-permeable membrane is placed between an upper and a lower chamber. Cells of interest are then seeded in the upper chamber, whereas the chemoattractant in question is deposited into the lower chamber. At the end of the assay, cells that have migrated specifically are quantified to derive a chemotactic index.",
    "Note: The number of cells to be disposed into the upper chamber as well as the concentration of the chemoattractant and incubation time may need to be adjusted based on the question that motivates the experiment.\nPrepare required assay media (incl. positive and baseline controls).\nDilute the chemoattractant of interest, in this case, recombinant human CXCL16 in migration medium to a final concentration of 50 ng/mL.\nAs a positive control, prepare migration medium with 10% human serum. Use migration medium alone to establish a baseline. Volume required = 225 μL/well.\nNote: The relationship between the concentration of a particular chemoattractant and its ability to induce migration is not sigmoidal but rather bell-shaped. Therefore, it is crucial to determine the suitable concentration range for the chemoattractant in question prior to this migration assay. The range can be estimated reasonably by reviewing the literature along with the information provided by the vendor of the chemoattractant in question. Test out an order of magnitude above and below as a means of optimization.\nPrepare T cells for the assay.\nHarvest T cells and transfer them into 50 mL conical tubes, pooling cells from the same conditions.\nPerform a cell count of each condition.\nCentrifuge the cells at 400 × g for 5 min at 20°C. Aspirate the supernatant and discard.\nTo minimize serum carryover, resuspend the cell pellet in 30 mL of PBS and centrifuge at 400 × g for 5 min at 20°C. Aspirate the supernatant and discard. Repeat this step one more time.\nResuspend the cells in migration medium at a concentration of 1 × 106 cells/70 μL (∼14.29 × 106 cells/mL).\nSet up the migration assay.\nTake a transwell migration plate into a laminar flow hood.",
    "Remove the lid and deposit 70 μL of cell suspension into the upper chamber (also called the insert) of the transwell plate.\nWithout removing the insert, add 225 μL of assay medium into the lower chamber.\nNote: Employ a reverse pipetting technique to prevent bubble formation. Push the knob all the way down to the second stop, aspirate the sample and dispose by pushing the knob until the first stop. Repeat as often as needed.\nCritical: Bubbles trapped under the insert disrupt cell migration and may lead to inconsistent results.\nPut the lid on gently without applying any pressure and transfer the plate to an incubator. Let the cells migrate for 4 h.\nNote: While moving the assay plate make sure not to make any sudden or jerky movements. Likewise, minimize any disruptions that may take place during the assay (e.g., moving the plate around, agitation of the plate by shutting the incubator forcefully, temperature swings caused by excessive use of the incubator, etc.).\nRead-out by FACS.\nTake out the transwell plate carefully and remove the lid.\nUse cotton swabs to get rid of any remaining liquid in the upper chamber to minimize the risk of spillover. Take care not to damage the membrane.\nDisassemble the transwell plate carefully by holding the plate firmly in place with one hand, while removing the insert with the other.\nLift the cells by pipetting up and down and transfer the cells into a round bottom 96-well plate. Centrifuge at 400 × g for 5 min at 20°C.\nDiscard supernatant. Resuspend the cells in 200 μL of FACS buffer. Centrifuge at 400 × g for 5 min at 20°C. Repeat once more.\nPrepare a master mix of fluorescently labeled antibodies in FACS buffer to stain receptors of interest.",
    "Discard supernatant and resuspend the cells in the prepared master mix. Incubate at 4°C for 20 min.\nCentrifuge at 400 × g for 5 min.\nDiscard supernatant. Resuspend the cells in 200 μL of FACS buffer. Centrifuge at 400 × g for 5 min at 20°C. Repeat once more.\nDiscard supernatant and resuspend the cells in 100 μL of FACS buffer.\nSamples are ready for acquisition.\nOptional: Prior to acquisition, counting beads may be added to the cell suspension to quantify the migrated cells. Ensure accurate cell counts by following the instructions for the specific product you plan to use. Other quantifications methods, such as the use of a volumetric flow cytometer, are also valid.\nMigration cytotoxicity assay\nTiming: 2–4 days\nThis section combines the transwell migration assay with an impedance-based real-time cell analysis (RTCA) tool, which uses impedance as a proxy for the number of target cells and their overall health (Figure 3[href=https://www.wicell.org#fig3]). Impedance readings are processed to derive a unitless cell index that can be plotted against time to visualize cell-mediated cytotoxicity. Using this approach, investigators can introduce a new dimension to their analysis by examining the cytotoxic capacity of CAR-T cells in addition to their migratory potential. The target cell line used in this section is an engineered SUIT-2 clone that overexpresses MSLN and CXCL16. SUIT-2-MSLN-CXCL16 cells are to be cultured in tumor cell line medium and maintained well before use.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2021-Fig3.jpg\nFigure 3. Illustration of a combined migration cytotoxicity assay\nThe upper part of the illustration depicts a migration assay (ref. steps 8–11), whereas the lower part outlines an impedance-based cytotoxicity assay (ref. steps 12–15).",
    "Note: The impedance-based assay described in this section permits the use of adherent as well as non-adherent cell lines. The use of non-adherent cell lines, however, requires additional steps not described in this section.\nEstablish baseline and seed target cells.\nNote: The success of this impedance-based assay depends heavily on the quality of target cells in question. It is crucial that target cells be in logarithmic growth phase and have a low passage number.\nPrewarm reagents required for this step to 37°C (i.e., cytotoxicity medium and 1× trypsin-EDTA).\nTake an E-Plate 96 into a laminar flow hood and deposit 50 μL of cytotoxicity medium or PBS into all wells.\nNote: It is recommended to use up the entire E-Plate 96 for an experiment. Wells that are not needed can be filled with PBS instead.\nPlace the E-Plate into the RTCA cradle.\nUsing the control unit (a laptop) perform background measurement (step 1) on the E-Plate 96. Subsequently, take out the E-Plate 96 and bring it back into the laminar flow hood for cell seeding.\nPrepare target cells (e.g., SUIT-2-MSLN-CXCL16 cells) by removing their medium, washing them with PBS and treating them with 1× trypsin-EDTA. Incubate at 37°C, checking on the cells every minute. Add serum-containing medium as soon as 90% of the cells have detached.\nNote: Trypsin exposure of cells should be kept to a minimum and must be halted promptly with serum-containing medium upon detachment of cells. Prolonged periods of trypsin exposure may compromise the performance of the assay.\nTransfer the cells into a 50 mL conical tube and centrifuge at 400 × g for 5 min at 20°C. Aspirate the supernatant and discard. Resuspend the cell pellet in cytotoxicity medium.",
    "Note: The optimal number of cells per well is dictated by the target cell line in question and other site-specific factors. For most cell lines this number should fall between 5,000 and 100,000 cells per well and must be determined empirically.\nUsing a multichannel pipette and reagent reservoir, add 100 μL of cell suspension into the wells of the E-Plate 96. Resuspend regularly to prevent uneven cell seeding.\nLet the target cells settle by leaving the E-Plate 96 on the bench for 45–60 min.\nReturn the E-Plate 96 to the RTCA cradle. Using the control unit initiate step 2 of the RTCA experiment. Incubate until an appropriate Cell Index has been reached (e.g., 1–2).\nCritical: Be generous with the duration of RTCA steps, as shorter than necessary steps can lead to a pause causing a gap in the cell index curve. Longer than necessary steps can be skipped without any disruption.\nRun a transwell migration assay.\nNote: Following steps have been modified to allow for the use target cells. Be aware that this section requires the use of a tissue culture treated transwell receiver plate, which needs to be obtained separately.\nSeed 2.5 × 104 SUIT-2-MSLN-CXCL16 cells/well in a final volume of 225 μL of cytotoxicity medium in a TC-treated transwell receiver plate. Incubate for 24 h at 37°C with 5% CO2.\nNote: Time the following migration assay based on the slope of the CI curve, so that by the end of the assay the Cell Index reaches a value between 1 and 2.\nAfter 24 h of incubation time, follow previously described instructions with changes to steps 9.e and 10.a–c to run a migration assay (repeated here for readability).\nHarvest T cells and transfer them into 50 mL conical tubes, pooling cells from the same conditions.",
    "Perform a cell count of each condition.\nCentrifuge the cells at 400 × g for 5 min at 20°C. Aspirate the supernatant and discard.\nResuspend the cell pellet in 30 mL of PBS and centrifuge at 400 × g for 5 min at 20°C. Aspirate the supernatant and discard.\nResuspend the cells in cytotoxicity medium at a concentration of 5 × 105 cells/70 μL (∼7.14 × 106 cells/mL).\nTake the TC-treated receiver plate with chemoattractant-secreting cells and a transwell migration plate into a laminar flow hood.\nRemove the lids of both plates. Carefully move the transwell insert and place it onto the TC-treated receiver plate. Deposit 70 μL of cell suspension into the upper chamber.\nPut the lid on gently without applying any pressure and transfer the plate to an incubator. Let the cells migrate for 4 h.\nSeed effector cells.\nConfirm that the Cell Index is in the desired range.\nTake out the transwell plate carefully and remove the lid.\nUse cotton swabs to get rid of any remaining liquid in the upper chamber to minimize the risk of spillover. Take care not to damage the membrane.\nDisassemble the transwell plate carefully by holding the plate firmly in place with one hand, while removing the insert with the other.\nUse the control unit to abort the Step currently running (step 2) and start the next one. After the first sweep pause the experiment immediately.\nCarefully release and remove the E-Plate 96 from the cradle. Subsequently, bring the E-Plate 96 into the laminar flow hood and remove its lid.\nResuspend the cells in the lower chamber of the transwell plate by pipetting up and down and transfer 100 μL of the migrated cells into the wells of the E-Plate 96.",
    "Put the lid back on and return the E-Plate 96 into the cradle.\nPress continue on the control unit to continue the experiment.\nFACS the remaining cells of the completed migration assay.\nUse 100 μL of the remaining cell suspension in the lower chamber and follow steps 11.d to 11.k (repeated here for readability).\nLift the cells by pipetting up and down and transfer the cells into a round bottom 96-well plate. Centrifuge at 400 × g for 5 min at 20°C.\nDiscard supernatant. Resuspend the cells in 200 μL of FACS buffer. Centrifuge at 400 × g for 5 min at 20°C. Repeat once more.\nPrepare a master mix of fluorescently labeled antibodies in FACS buffer to stain receptors of interest.\nDiscard supernatant and resuspend the cells in the prepared master mix. Incubate at 4°C for 20 min.\nCentrifuge at 400 × g for 5 min.\nDiscard supernatant. Resuspend the cells in 200 μL of FACS buffer. Centrifuge at 400 × g for 5 min at 20°C. Repeat once more.\nDiscard supernatant and resuspend the cells in 100 μL of FACS buffer.\nSamples are ready for acquisition."
  ],
  "subjectAreas": [
    "Immunology",
    "Biotechnology And Bioengineering",
    "Cell Isolation",
    "Cancer",
    "Cell-Based Assays"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology"
  ]
}