{
  "id": 18829,
  "origin_website": "Jove",
  "title": "Coordinate Mapping of Hyolaryngeal Mechanics in Swallowing",
  "procedures": [
    "1. Configuring a computer\nFor Macintosh, download the following open source or freeware software: ImageJ, MacX Video Converter Free Edition (Mac), and QuickTime (see table of material/equipment).\nFor a PC, download the following open source or freeware software: ImageJ, MPEG Streamclip (PC), and QuickTime (see table of material/equipment).\n2. Preparing video clips\nFile conversion. Convert raw video files into .mov for data collection in ImageJ. Note: usable videos should include the mandible, hard palate, C1-C4 vertebrae, larynx and pharynx in the field of view. ImageJ processing tools can improve image quality issues.\n\t\nWith a PC, use MPEG Streamclip, load the raw .avi video file via File >> Open Files and selecting the desired clip. Select File >> Export to QuickTime.\nWith a Mac, use MacX Video Converter, click \"Add File\" and choose video(s) for conversion. Multiple videos can be converted at once using this application.\nIn the Output Settings section, click the browse button and choose the desired location to save the converted file.\nClick on the \"to MOV\" tab. Make sure the Output Format under the \"Video Settings\" section is MOV. Click Start.\nEditing clip length. Memory is limited with ImageJ. It is recommended that a file of each swallow be made.\n\t\nOpen MOV. Video file created in step 2.1 using QuickTime (PC or Mac).\nIdentify 5 ml thin-liquid and pudding swallows by audio queues or by swallow sequence outlined by the MBS protocol used during data collection.\nSelect Edit >> Trim and adjust the trimming bar so that the entire 5 ml Thin Fluid swallow is visualized. Click trim.\nSelect File >> Export and create a file name that will be used to link subject data (gender, age, etiology, bolus type) to coordinate mapping results.\nRepeat for the pudding swallow (or for any other bolus of interest).",
    "3. De-identifying images\nIf a file contains any personal health information (PHI) and needs to be de-identified, upload the file using Image J (See 4.1 - 4.2).\nUse the rectangle tool to frame the swallowing study to exclude PHI. Select Image >> Crop. Then Select File >> Save As >> QuickTime Movie.\nConfigure the dialogue box as follows: Compression >> Sorenson 3; Quality >> Maximum, enter the appropriate frame rate (usually 30 fps). \n4. Preparing to measure\nOpen ImageJ. Click on the \">>\" icon on the toolbar. Select >> Arrow Labeling Tools.\nUploading images. Click on QuickTime icon. Select \"Open movie as a stack\" from the drop down menu and locate edited QuickTime clip. Image J will not open the entire swallow study due to memory limits (see step 2.2). Memory can be minimally expanded by selecting Edit >> Options >> Memory & Threads.\nProcessing images to improve image quality. Select Process >> Math >> Add. Check the preview box and adjust numbers to desired image quality. Reply yes to process the entire stack of images.\nSet measurements. Select Analyze >> Set Measurements from the ImageJ menu. At the dialogue box mark \"Stack Position\" and \"Invert Y coordinates\". Unmark everything else.\nSelect the multipoint tool from the toolbar. Click on anatomical landmarks in sequence (see 5.0)\nUsing the multipoint tool.\n\t\nTake a measurement of all points by selecting Analyze >> Measure from the menu or keyboard command+M (control+M for PCs).\nRemove all points with command+A (control+A for PCs).\nRemove single points by hovering over a point, then hold the command-option keys and click on the point to be removed.\nMove singular points by hovering over a point, clicking, dragging and dropping a point to a new location.\nMove all points together with arrow keys.\n5. Mapping Landmarks",
    "Begin at first frame and advance to a clear frame in the pre-oral phase. Observe position of the bolus on the anterior, superior margin of the tongue prior to initiation of oral transport of the swallow. Use this frame to set the first nine coordinates.\nUse the ImageJ multi-point tool to map the first nine coordinates at the following anatomical landmarks (see Figures 3a and 3b)\nRecord first nine coordinates using command+M keys (control+M for PCs).\nAdvance frames until hyoid bone has reached maximum position in anterior and superior directions. Confirm maximum by advancing frames to insure descent of the hyoid begins on the following frame.\nRelocate points 1 - 5 to their new positions. These new positions will be recorded as coordinates 10 - 14.\nRelocate Point 9, which in turn becomes coordinate 18. Note: frames will likely vary for the next two steps.\nLocate frame depicting maximum laryngeal elevation. Adjust points 7 and 8, which will serve as coordinates 16 and 17.\nFind frame(s) representing the maximum excursion of UES, point 6 (coordinate 15). From maximum hyoid frame, locate frame where the bolus is impeded by the UES in the hypopharynx. Adjust coordinate point for UES from minimum frame to represent UES maximum coordinate 18.\nRecord second nine coordinates using command+M keys (control+M for PCs).\nFor coordinates 19 and 20 mark the edges of the scalar (a penny or 1.9 cm ring) at the axis representing the longest diameter of the radiopaque marker.\nRecord scalar coordinates using command+M keys (control+M for PCs).\n6. Transform coordinate data into kinematic measurements of interest using a macro enabled Excel file (the instructions for this macro are included on the file)\nNote: Trigonometric calculations imbedded in the macros calculate kinematic measurements (Figure 4).\nDownload \"CoordinateMapping.xlsm\" from the JoVE article page.",
    "Follow instructions on the spreadsheet to initialize the file. The initialization macro will create three sheets including: results, data, and input sheet. Note: Macintosh users must enable developer tools in Excel to run macros.\nCopy coordinates from the ImageJ results window and paste into the designated cell in the \"input sheet\". Run the \"datacaptureline\" macro.\nResults will appear on the \"results\" sheet. Lines of coordinate data will appear on the \"data\" sheet.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}