{
  "id": 16986,
  "origin_website": "Jove",
  "title": "Lipopolysaccharide Infusion as a Porcine Endotoxemic Shock Model",
  "procedures": [
    "The experiments in this protocol were approved by the State and Institutional Animal Care Committee (Landesuntersuchungsamt Rheinland-Pfalz, Koblenz, Germany, TVA G21-1-080). The experiments were conducted in accordance with the ARRIVE guidelines. For this study, six healthy male German Landrace pigs aged 2-3 months and weighing 30-35 kg were used. The experimental timeline is summarized in Figure 1. The details related to all materials and instruments used in this protocol are listed in the Table of Materials.\nimgsrc://cloudfront.jove.com/files/ftp_upload/66039/66039fig01.jpg\nFigure 1: Experimental timeline. Baseline health measurements were taken after the preparation of the animal and a 30 min stabilization period. Endotoxemia was induced by LPS injection over 30 min and 0 h measurements were taken after another 30 min; after that, hourly measurements were continued for 4 h. Abbreviations: BLH = baseline healthy; LPS = lipopolysaccharide. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/66039/66039fig01large.jpg]\n1. Animal preparation\nKeep the animals in their usual environment for as long as possible to minimize stress. Withhold food for 6 h prior to the administration of anesthesia, while allowing free access to water.\nSedate the animals with an intramuscular injection of azaperone (3 mg∙kg-1) and midazolam (0.5 mg kg-1) while still in their normal environment.\nOnce the sedation takes effect, which typically occurs within approximately 15-20 min after administration, transport the pigs to the laboratory.\n\tNOTE: It is crucial to ensure that continuous sedation is maintained throughout the transfer; depending on the regional legislature, this may require the permanent supervision of a veterinarian.\nPay close attention to maintaining the normal body temperature of the pigs (~38 °C) during transport. For instance, consider covering the animal with a blanket to prevent hypothermia.",
    "NOTE: It is important to limit the transport time to not exceed the duration of sedation, which usually ranges from 30 min to 60 min.\nFollowing disinfection, establish an intravenous access by inserting a 22 G catheter in the auricular vein. Before proceeding with any further movement of the pig or induction of anesthesia, ensure that the catheter is securely fixed to prevent dislocation by any sudden movements.\nContinuously monitor the peripheral oxygen saturation using a sensor clipped to the tail or ear.\n2. Anesthesia and mechanical ventilation\nAdminister intravenous fentanyl (4 µg kg-1) and propofol (3 mg kg-1) to induce anesthesia.\nPlace the pig in a supine position.\nAdminister atracurium (0.5 mg kg-1) as a muscle relaxant and immediately initiate non-invasive ventilation using a dog ventilation mask. Place the mask over the snout and apply firm pressure with the thumbs while pulling the lower jaw forward using the middle/ring finger. Set the ventilator to the following parameters: inspiratory oxygen fraction (FiO2 ) = 100%, tidal volume = 6-8 mL kg-1, Positive End Expiratory Pressure (PEEP) = 5 mbar, peak inspiratory pressure ≤ 20 mbar, respiratory rate = 18-20 min-1.\nMaintain anesthesia by initiating a continuous infusion of a balanced electrolyte solution (5 mL kg-1 h-1), fentanyl (10 µg kg-1 h-1), and propofol (6 mg kg-1 h-1).\nPerform endotracheal intubation using a standard endotracheal tube (ID 6-7 mm), a guidewire, and a laryngoscope equipped with a Macintosh Blade (size 4).\n\t\nHave an assistant open the mouth and hold the tongue to the left side.",
    "Insert the Macintosh Blade until the epiglottis is visible. Then, lift the laryngoscope upwards to move the epiglottis ventrally and visualize the vocal cords. Occasionally, the epiglottis may stick to the soft palate; in this case, mobilize it by gently swiping sideways with the tube or a bougie.\nCarefully insert the endotracheal tube through the vocal cords and remove the inducer. If encountering difficulty, try rotating the tube without applying excessive force. If necessary, use a smaller tube. Once the tube is in place, inflate the cuff with 10 mL of air.\nConnect the endotracheal tube to the ventilator and initiate ventilation. Confirm proper tube positioning by detecting end-expiratory CO2 and performing bilateral auscultation. Use the following ventilation settings: FiO2 = 40%, tidal volume = 6-8 mL kg-1, PEEP = 5 mbar, inspiration to expiration ratio = 1:2, respiratory rate = adjusted to achieve an end-tidal CO2 level of <45 mmHg, typically 30-40 min-1 .\n\tNOTE: If the tube has been placed incorrectly in the esophagus, air will inflate the stomach, causing a visible bulge. In such cases, immediately remove the tube, administer non-invasive ventilation for 1-2 min, and reposition the tube correctly.\nInsert a gastric tube to prevent reflux or vomiting. If insertion proves challenging, use the laryngoscope to obtain a better view of the esophageal entrance.\n3. Instrumentation\nPlace an arterial and a central venous line in the femoral artery and vein, respectively, for hemodynamic monitoring and intravenous volume therapy.\nUse bandages to retract and secure the hind legs, providing better access to the femoral vessels.\nPrepare all necessary materials prior to instrumentation. Fill all catheters with saline solution and ensure easy access to wires and catheters to minimize the need for multiple catheterization attempts and unnecessary blood loss.",
    "Apply an alcoholic disinfectant to the inguinal area and wipe it with a sterile swab. Repeat this process twice. Apply the disinfectant again without wiping and wait for 3 min. Place a sterile fenestrated drape over the inguinal area.\nUse ultrasound to identify the femoral blood vessels. Use an in-plane ultrasound-guided Seldinger's technique for catheterization to minimize tissue damage and blood loss.\nVisualize the femoral artery longitudinally. Puncture the artery with a syringe attached to the needle for continuous aspiration. Bright red, pulsating blood confirms arterial puncture. Remove the syringe and insert the prepared wire. Remove the needle while leaving the wire in place.\nRepeat the same procedure for the femoral vein. Venous puncture is confirmed by slow-flowing, dark red blood.\nConfirm the correct positioning of both wires by visualizing both femoral vessels using ultrasound.\nUse Seldinger's technique to insert the arterial introducer sheath first, followed by the venous introducer sheath. Confirm proper positioning through blood gas analysis of blood samples drawn from the two lines.\nEnsure that blood can be aspirated from all lines. Flush all lines with saline solution to prevent clot formation.\nSecurely fix the lines to the skin using surgical sutures to prevent dislocation.\nConnect the arterial and central venous lines to transducers for the measurement of hemodynamic parameters.\nInsert a pulse contour cardiac output (PiCCO) catheter into the arterial introducer sheath and connect it to the arterial pressure transducer and temperature interface cable of the PiCCO monitor.\nConnect a Swan-Ganz catheter to a transducer.\n\t\nWhile continuously measuring pressure, insert the catheter into the central venous introducer sheath. Inflate the balloon after approximately 30 cm, when a central venous pressure curve becomes visible.",
    "Slowly advance the catheter while monitoring the pressure curve. As the catheter enters the right ventricle, look for a pulse curve with a high systolic and low diastolic value. Further advancement of the catheter will result in a consistent systolic value and an increased diastolic value, indicating placement in the pulmonary artery.\nFix the catheter in this position (usually between 50 and 70 cm). Connect the injectate temperature sensor of the PiCCO system to the proximal lumen of the Swan-Ganz catheter.\nShave the pig's forehead and apply the adhesive sensor electrode to measure Cerebral Regional Oxygen Saturation.\nAfter anesthesia induction and instrumentation, allow the animal to stabilize for 30 min or until hemodynamic parameters have stabilized before conducting baseline measurements and inducing endotoxemic shock.\n4. Shock induction\nNOTE: When working with LPS, always wear gloves, protective goggles, a mask, and a lab coat. Avoid direct contact with LPS.\nPrepare an LPS solution with a concentration of 100 µg mL-1 by dissolving 5 mg of LPS in 50 mL of 0.9% NaCl.\nObtain baseline hemodynamic measurements immediately before initiating LPS infusion.\nAdminister a 150 µg kg-1 dose of LPS over 30 min (equivalent to a continuous infusion rate of 300 µg kg-1∙h-1 for 30 min).\nAfter 30 min, reduce the infusion rate to 15 µg∙kg-1∙h-1 for the remainder of the experiment.\nContinuously monitor hemodynamic parameters, including arterial and pulmonary arterial blood pressure, heart rate, and ventilation parameters. Monitor the body temperature continuously to maintain normothermia.\n5. Treatment of hemodynamic instability\nWhen the mean arterial blood pressure falls below 60 mmHg, use PiCCO to measure cardiac index (CI), Global End-Diastolic Volume Index (GEDI), and Extravascular Lung Water Index (ELWI). Treat the low blood pressure according to the recommendations in the flow chart in Figure 2.",
    "On the PiCCO monitor, press the thermodilution button (TD).\nPress the button for central venous pressure (CVP) input and enter the current CVP value.\nPress the Start button.\nWhen instructed to do so, inject 10 mL of cold saline solution into the injectate temperature sensor connected to the Swan-Ganz catheter.\n\t\tNOTE: Do not inject anything else directly before or during PiCCO measurement as this would compromise the measurement.\nAfter obtaining measurements for CI, GEDI, and ELWI, treat hemodynamic instability according to the flow chart in Figure 2. If Volume loading is recommended, rapidly infuse 200 mL of balanced electrolyte solution. If catecholamine therapy is recommended, increase the rate of norepinephrine infusion by 1 µg kg-1 h-1.\nRepeat this process whenever the mean arterial blood pressure falls below 60 mmHg. In case of severe hemodynamic instability, opt for rapid escalation of therapy.\nimgsrc://cloudfront.jove.com/files/ftp_upload/66039/66039fig02.jpg\nFigure 2: PiCCO-guided therapy of hemodynamic instability. After obtaining measurements for CI, GEDI, and ELWI, apply treatment according to the chart. This figure was adapted from the PiCCO user guidebook12. Abbreviations: PiCCO = pulse contour cardiac output; V+ = volume loading; cat = catecholamine therapy; V- = volume reduction; CI = cardiac index; GEDI = global end-diastolic volume index; ELWI = extravascular lung water index. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/66039/66039fig02large.jpg]\n6. End of experiment and euthanasia\nInject 0.5 mg of fentanyl intravenously. Wait 5 min. Inject 200 mg of propofol.\nEuthanize the pig with a rapid injection of 40 mL of 1 M potassium chloride via the central venous line.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}