{
  "id": 10368,
  "origin_website": "Jove",
  "title": "Dextran Labeling and Uptake in Live and Functional Murine Cochlear Hair Cells",
  "procedures": [
    "The animal care and experimental procedures were performed following the guidelines for the Care and Use of Laboratory Animals, which were approved by the Animal Care and Use Committee of the National Institute of Neurological Disorders and Stroke (Animal protocol #1336 to KJS).\n1. Mice\nSet a couple of breeding pairs of C57BL/6J wild-type to breed in the animal facility to control the date of birth of the litters and keep track of the age of the pups.\n2. Cochleae Dissection\nSet a clean space close to a stereomicroscope to perform the dissections (Figure 1A). Use 70% ethanol to clean the space and surroundings and place a clean bench pad. A Medical Pathological Waste (MPW) plastic bag would be required to discard the animal carcasses.\nPrepare several 35 mm dishes with some Leibovitz's L15 media.\n\tNOTE: Leibovitz's L-15 cell media contains 1–2 mM Ca2+, which is required to maintain the integrity of the tip-links, and contains essential amino acids, vitamins, and sodium pyruvate to improve cell health and survival. Serum was excluded to avoid experimental variability due to its poorly defined composition and potential interference with the dextran.\nEuthanize postnatal-day-6 (P6) mice by decapitation.\n\tNOTE: 6 day old mice are somewhat resistant to inhalant anesthetics. Although isoflurane or prolonged CO2 exposures (up to 50 min) may be used for euthanasia, a secondary physical method is recommended to ensure death.\nUse surgical scissors to remove the skin of the skull by making a superficial cut from the anterior to the posterior end and across the external auditory canals.\nFold the skin towards the nose to expose the cranium (Figure 2B).\nMake an incision from the back to the front of the skull and across the eye line (Figure 2B-C).",
    "Separate the skull in two halves and remove the brain with the use of a small spatula to expose the temporal bones (Figure 2C-D).\nWith small scissors, cut around the temporal bones, and excise the tissue.\nPlace both temporal bones in a 35 mm dish and make sure they are covered with L15 media (Figure 2E).\n\tNOTE: The following steps are performed under the stereomicroscope. A black background usually helps to visualize the tissue during the fine dissection steps.\nUnder a stereomicroscope equipped with a widefield eyepiece (a 10X magnification power (WF10X) and an external alternating current (AC) halogen light source), remove the surrounding cochleae tissue, semicircular canals, and vestibular organs with surgical forceps (Figure 2F).\nTo allow the dextran and L15 media to enter the cochlear duct, perform two puncture bounds on the dissected cochleae, one on the round window and other at the apical cochlear region.\nAdd 300 mL of Leibovitz's L15 media in each well from a 9-well glass depression plate.\nPlace at least three dissected cochleae on each well.\n3. Dextran Labeling\nReconstitute the dextran in Hanks' balanced salt solution without Ca2+ and Mg2+ (HBSS-CFM) at a final concentration of 10 mg/mL. This stock solution must be aliquoted in opaque black tubes (protected from light) and stored at -30 °C until use.\n\tNOTE: The use of lysine-fixable dextran is critical for a successful outcome of this protocol.\nPrepare each dextran at a final concentration of 2 mg/mL in 500 mL of Leibovitz's L15 media.\nRemove the media from the cochlea and add Leibovitz's L15 media containing the dextran of interest at a final concentration of 2 mg/mL.",
    "NOTE: Although a proportion of the MET channels are open at rest41,42, the dextran incubation was performed with a gentle shaking of the explants to increase the open probability of the MET channel.\nIncubate at room temperature for 2 h with gentle shaking (25 rpm) by using a 3-dimensional shaker with a tilted angle of 25°.\n\tNOTE: Fluorescently labeled dextran must be protected from light when possible. To protect the dextran during the 2 h incubation, place the 9-well glass plate inside a cell culture P150 dish wrapped in aluminum foil.\n4. Sample Preparation for Imaging\nAfter incubation with the dextran, wash the tissue for 2 min twice with media and once with HBSS.\nIncubate the tissue at room temperature for 30 min with 4% paraformaldehyde in Hanks' balanced salt solution (HBSS).\n\tCAUTION: Exposure to formaldehyde can be irritating to the eyes, nose, and upper respiratory tract. In certain individuals, repeated skin exposure to formaldehyde can cause sensitization that may result in allergic dermatitis. Formaldehyde is a known human carcinogen and a suspected reproductive hazard.\nQuickly and gently wash the fixed tissue twice with HBSS to remove the paraformaldehyde.\n\tNOTE: Decalcification of the temporal bones is not needed at this developmental stage of the cochlea.\nRemove the spiral ligament and the tectorial membrane with fine tip forceps to dissect the organ of Corti (Figure 2G).\nRemove all the small pieces of tissue and wash the tissue with HBSS.\nPermeabilize the tissue in 0.5% Triton X-100 in PBS containing fluorescently-labeled phalloidin (conjugated to green or red when testing the uptake of TR- or FITC-labeled dextran, respectively) at a 1:200 dilution for 30 min to label F-actin and visualize the actin-based stereocilia.",
    "Wash the tissue 2–3 times for 2 min each time with HBSS buffer to remove the excess of triton and phalloidin, and once with PBS to remove the salts.\nMount the organ of Corti tissues on a microscope slide and cover it with mounting media.\n\tNOTE: When mounting the tissue, make sure that the side of the tissue containing the hair cell stereocilia is facing the coverslip.\nRemove any potential bubbles generated during the addition of the mounting media and prevent the generation of new bubbles during the placement of the coverslip.\n\tNOTE: Aspirate with a pipette any bubble generated during the addition of the mounting media. To prevent air bubbles from being trapped under the coverslip, place an edge of the coverslip close to the sample and carefully and slowly lower the coverslip over the tissue using forceps or a pipette tip.\nCover the tissue in mounting media with a glass coverslip (Figure 2H).\n\tNOTE: Objectives with a numerical aperture above 0.4 are designed to use #1.5 coverslips (0.17 mm thickness). Using the wrong coverslip may have severe implications for the intensity and quality of the images.\nIncubate the mounted tissue overnight at room temperature to let the mounting media dry and store the slides at 4 °C until imaging.\n5. Image Acquisition and Image Processing\nNOTE: The confocal images were taken with a LSM 880 confocal microscope equipped with a 32 channel Airyscan detector in the super-resolution (SR) mode43 and a 63x objective.\nAdd a small drop of immersion oil on the objective.\nPlace the microscope slide containing the mounted tissue sample in the microscope stage with the glass coverslip facing the immersion oil.\nFocus on the sample and set the imaging parameters using the image acquisition software.",
    "Use identical image acquisition settings and optimal parameters for x, y, and z resolution for each independent experiment. A piezo-driven focus system is required to quickly and precisely move the objective when acquiring the z-stack of images.\n\tNOTE: To image the entire apical region of the hair cells, collect a z-stack of images from the stereocilia to the apical half of the hair cell body using the optimal settings. It is crucial to collect a large z-stack along the hair cell to assure the imaging of the vesicle-like particles.\nUse the image acquisition software to process the raw confocal images using the Airyscan 3D reconstruction algorithm with the automatic default deconvolution filter settings.\nOpen the confocal images in an image processing software to adjust the brightness and contrast, add the scale bar, and export the images for the final figures.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}