{
  "id": 9746,
  "origin_website": "Jove",
  "title": "Preparation of Acute Hippocampal Slices from Rats and Transgenic Mice for the Study of Synaptic Alterations during Aging and Amyloid Pathology",
  "procedures": [
    "1.  Preparing Ice-cold Oxygenated Artificial Cerebrospinal Fluid (ACSF)\nPrepare 2 L of \"Ca2+-free\" ACSF.  In a 2L Erlenmeyer flask, add approximately 1.5 L of sterile or double-distilled H2O, and begin stirring vigorously on a stir plate. Add the following ACSF components (in mM): 124 NaCl, 2 KCl, 1.25 KH2PO4, 2 MgSO4, 26 NaHCO3, and 10 dextrose (see Table 1). Bring to a volume of 2 L with distilled H2O.\nUsing an aquarium bubbler and tubing attached to a 95% O2/5% CO2 air tank, oxygenate ACSF vigorously for approximately 20-30 min. Check the pH, and if necessary, adjust to 7.4 using NaOH or HCl.\nPour 750 mL of  oxygenated Ca2+-free ACSF into a separate Erlenmeyer flask, cover the opening with parafilm, and transfer to an ultrafreezer (-80°C) for 20-30 min. This media will be used for dissection of brain and acute hippocampal slices*. Add 2 mM CaCl2 to the remaining 1.25 L volume of ACSF#, stir well, and resume oxygenation with 95% O2/5% CO2. This media will be used for storing brain slices after dissections, and for perfusing slices during electrophysiologic recordings.\n*Ice-cold Ca2+ free media is used to slow metabolism and minimize Ca2+-dependent excitotoxicity during dissection.\n# Changes in Ca2+ dysregulation during aging and AD can have a major impact on the induction of Ca2+-dependent synaptic plasticity 4-9. Conflicting reports on age differences in LTD may be partly attributable to the use of different ACSF Ca2+:Mg2+ ratios during slice recordings (see 2,4,10). The importance of Ca2+ regulation and the ACSF Ca2+ level in aging studies is addressed in greater detail in the Discussion section.",
    "While the Ca2+-free ACSF is freezing, prepare a holding chamber for the maintenance of brain slices before and during electrophysiologic recordings*. We use a custom macro-holding chamber that contains four individual microchambers (see Figure 2). The macrochamber is filled with sterile, oxygenated H2O and the microchambers are essentially islands that protrude above the water's surface. Within each microchamber, slices rest on netted insert in a shallow pool of oxygenated ACSF. Slices are not completely submerged, but sit at an interface with the humidified air. An insulated heating element within the macrochamber allows for temperature adjustment.\n*Several varieties of holding chambers are also commercially available (e.g. Warner Instruments makes a submersion-style \"Pre Chamber #BSC-PC) and should be suitable for use in aging and transgenic mouse slice studies. In a pinch, slices can be maintained for several hours in a small petri dish filled with ACSF. Make a small hole in the petri lid for an oxygen delivery tube. Be careful that oxygen bubbles do not physically agitate the slices. Slices will get sufficient oxygen if the delivery tube is raised to just above the ACSF surface (gas dispersion should cause an indentation in the fluid surface).\n2.  Brain Removal and Hippocampal Dissection in Aged (> 20-month-old-rats)",
    "Prepare the dissection area* next to a large sink (see Figure 1 and Table 2). Place a small animal guillotine in the sink and lay out surgical instruments and materials for brain removal and hippocampal dissection including a folded paper towel, a #11 scalpel blade, beebee scissors, bone rongeurs, a \"Hippocampus tool\" (a specialized dual spatula from Fine Surgical Tools), small surgical scissors, a thin double-ended spatula, plastic Pasteur pipette, 110 mm diameter Whatman Filter paper, a lidded 100 mm glass petri dish filled with ice, and a plastic spoon. Also keep a plastic bag nearby for disposal of the carcass.\n*Brain extraction should be completed as quickly as possible, so it's a good idea to mentally \"walk through\" the procedure and lay your instruments out in the order of use.\nRemove Ca2+-free ACSF from the freezer. Media should be partially, not completely, frozen. Pour about 50 mL of ACSF into a glass beaker, cover with Parafilm, and place next to the dissection area. This media will be used to briefly store the brain once it is removed. The remaining Ca2+-free media will be used to fill the reservoir in the Vibratome for slice preparation. This media can be reoxygenated, or simply covered with parafilm and placed in the refrigerator at 4°C.\nEuthanize the rat using methods approved by the Institutional Animal Care and Use Committee (IACUC). Our animals are placed in a small Plexiglas chamber that is gradually filled with 100% CO2. Loss of consciousness generally occurs within five minutes and is confirmed by the absence of reflex activity following a toe pinch.",
    "Decapitate the rat immediately rostral to the first cervical vertebra and place the head on the folded paper towel. Using the #11 scalpel, quickly make an incision in the middle of the scalp starting near the nasal bone and running caudally to the occipital bone. Be sure to cut completely through the cutaneous muscle, fully exposing the sutures on the dorsal surface of the skull.\nCut through the scull plates with beebee scissors. In young rats and mice, the skull can be quickly removed with the use of bone rongeurs alone. However, aged rats have thicker skulls than young adult rats and mice that can make this procedure difficult. We have found that cutting through the skull greatly facilitates bone removal with rongeurs, lessens injury to the brain, and saves precious seconds. With the rat's head firmly on the counter top, place the cutting edge of the lower sheer of the beebee scissors into the superior region of the foramen magnum at the posterior portion of the skull. Keeping the lower sheer firmly against the skull's inner surface (and away from the brain)*, cut through the occipital plate, and then along the midline suture of the parietal plates. Proceed rostrally until you cut through the frontal skull plates.\n*It is critically important that pressure is directed away from the brain to prevent inadvertent gauging.",
    "Separate the occipital, parietal, and temporal skull plates from the brain. Continue holding the head firmly to the countertop for stability and leverage and slide the bottom jaw of the rongeurs under the left parietal plate maintaining pressure against the inside surface of the skull. Next, squeeze the jaws of the rongeurs together and roll your wrist upward and toward you to pull the parietal and occipital plates away from the brain. This should expose most of the dorsal surface of the left hemisphere. If necessary, use the rongeurs to remove the left frontal plate as well. Repeat this process for the other hemisphere. Once the plates are displaced, quickly inspect for any dura matter that may be attached to the temporal plates and stretched across the surface of the brain. Gently pull these away with the rongeurs or cut away with scissors*. Now, slide the upper jaw of the rongeurs between the brain and the right temporal plate, again keeping the pressure toward the skull and away from the brain. Squeeze and twist the temporal plate away from the brain. You should hear/feel a \"crunch\" as you do this. Repeat for the left side.\n*The dura can be hard to spot, especially if the animal has been transcardially perfused with ACSF. However, if dura are not removed, they will slice through the brain (and most likely the hippocampus) like a razor when temporal plates are removed. Snipping the dura away near the temporal plates will minimize the likelihood of stabbing the brain.",
    "Extract the brain*. Quickly remove the parafilm from the Ca2+-free ACSF \"slushy\". Now slide the broad spatula head of the Hippocampal tool between the ventral surface of the brain and the bottom skull plates until it is completely under the brain. Move the spatula laterally from side-to-side and then forward and backwards a few times to sever intact cranial nerves. Now scoop the brain out with the Hippocampal tool and submerge in Ca2+-free ACSF and cover with parafilm. Let the brain chill for about one minute. This is an opportune time to clean off the guillotine, dispose of the carcass, and reorganize the dissection area.\n*For steps 2.3-2.7, speed is of the essence. We try to complete this procedure (from decapitation to brain submersion in ACSF) in 30-35 sec. In our experience, extractions taking longer than a minute appear to adversely affect hippocampal slice health, especially for aged rats. Using these procedures, we have observed no differences in extraction times between aged and young rats for our studies.",
    "Extract the hippocampi. Place the Whatman filter paper on the lid of the ice-cold petri dish and dampen the paper with ACSF using the plastic transfer pipette. Retrieve the brain from the ACSF using a spoon and place on the dampened Whatman paper. Using the scalpel blade, remove the cerebellum and approximately one quarter of the rostral frontal lobes. Run the scalpel blade through the intrahemispheric fissure to completely separate the two hemispheres. Place one hemisphere back into the ACSF slushy and \"stand\" the other up on the dissecting stage such that the coronal plane of the frontal lobe is facing down. You should clearly be able to distinguish the brain stem and mid brain (which are white) from the overlying cortex (which is pink/grayish). Locate the superior and inferior colliculi on the midbrain; these will look like two white \"knobs\" and will be at the \"top\" of the brain in this orientation. Using the surgical scissors, gently hold the midbrain in place and slide the weighing spatula in the gap between the colliculi and the neocortex. Very gently, continue to slide the spatula down and pull the brainstem/midbrain/thalamus away revealing the inside of the lateral ventricle and the medial surface of the hippocampus. Use the sharp edge of the spatula to smoothly sever the fornix; a white fiber bundle located at the anterior/dorsal portion of the hippocampus. With the scissors, gently continue to pull the brainstem/midbrain/thalamus away without completely severing it from the rest of the brain. The cortex with hippocampus should now lay freely back from the brainstem*. Next, turn the dissecting stage so that you are looking at the medial hippocampus and overlying cortex as if it were a sagittal section (minus the thalamus).",
    "You should now see the white fimbria fibers that form a shallow hyperbola at the bottom of the hippocampus in this plane. Using the plastic transfer pipette, gently squirt some ACSF into the gap underneath the fimbria to help separate the hippocampus from the cortex. Gently slide the spatula into this gap, such that the long side of the spatula runs parallel with the long axis of the hippocampus. Once the spatula is completely under the hippocampus, hold down the brainstem/midbrain/thalamus firmly with the scissors and roll the spatula away from your body to physically separate the hippocampus from the rest of the brain. Once the hippocampus is free, gently trim away any remaining cortex, blood vessels, and white matter. Scoop a small amount of ACSF slushy onto the far side of the dissecting stage.  Gently position the hippocampus next to the slush and douse with a few milliliters of ACSF using the plastic transfer pipette. Next, remove the other hemisphere and repeat the dissection.",
    "*You may need the scissors to snip away additional connective tissue, white matter, or vasculature that prevents separation of the cortex from the brainstem. The points of your scissors will be very close to the hippocampus, so be sure to deliver very precise snips (sharp scissors are a must).\n3.  Brain Removal and Hippocampal Dissection in Aged Transgenic Mice\nEuthanize and decapitate the mouse and make a midline incision on the scalp as described in section 2.3. Mice have much thinner skulls than rats which greatly simplifies brain extraction. Cutting through the skull with scissors is therefore unnecessary. Use bone rongeurs with smaller jaws (Table 2) to pull away occipital, parietal, and temporal skull plates. As with the rat, remember to use controlled movements and firmly pull the lower jaw of the rongeurs into the internal surface of the skull and away from the brain as you remove the plates. Once the plates are removed, use the narrow end of the Hippocampal tool to sever remaining cranial nerves and scoop the brain into ice-cold Ca2+-free ACSF.\nPrepare brain slices. Due to the smaller size of the mouse brain, dissecting the hippocampi can be a bit more challenging (though certainly doable) than when using rats. So, to make things easier, we remove the cerebellum and rostral tips of the frontal lobes, but do not dissect out the hippocampi. Instead, brain hemispheres are physically separated with a scalpel blade and left intact for Vibratome sectioning (see Section 4 below).\n4.  Section Brain Tissue Into Slices using a Vibrating Microtome (Vibratome) and Transfer to Holding Chamber*",
    "Fill the reservoir of the Vibratome with ice-cold Ca2+-free ACSF, such that the cutting stage and blade are completely submerged. For making rat slices, cut off the rostral and caudal tips of each hippocampus with a scalpel blade. These cuts will allow you to vertically position the hippocampi closely together like two columns. This works best if the dentate gyrus of each hippocampus is facing one another and CA3 regions are oriented in the same direction. For making mouse slices, vertically position each hemisphere closely together with frontal lobes facing down.  Glue brain tissue onto a mounting block and transfer to the sectioning stage of the Vibratome. We typically prepare ~400 uM sections for synaptic physiology experiments. Thinner sections should be prepared if fluorescent imaging will be conducted (e.g. investigations of Ca2+ levels and transients). Collect slices with a wide-mouth pipette or a paint brush# and transfer to a small petri dish containing ice-cold Ca2+-free ACSF.",
    "*Use of a Vibratome minimizes damage to the upper and lower surfaces of the slice and is definitely recommended for studies requiring analysis of cells near the slice surface (e.g. voltage clamp and Ca2+ imaging studies). However, cheaper alternatives are available and suitable for generating slices for extracellular physiology experiments. We have used a small gravity-controlled chopper2,11 and a McIlwain Tissue Chopper12 with good success. For this procedure hippocampi are placed on a staged and sectioned with a vertical chopper. A brush is used to transfer slices (one at a time) to a small holding dish filled with ice-cold Ca2+-free ACSF.  One problem with this approach is that the hippocampi can move between chops resulting in uneven sections. Also, be careful to remove as much white matter, and especially as much vasculature, as possible before chopping. This material will stick to the brush, the razor blade, or both, making slice transfer very difficult and increasing the probability of stretching or damaging the tissue.\n#When using a brush, try to rest the slice length-wise across the bristles. Wrapping the slice around the brush tip may cause unnecessary tissue stretching.\nTransfer brain slices to the holding chamber where they are bathed in oxygenated Ca2+-containing ACSF. Gradually bring the chamber temperature from 27° to 32°C  (+1° every five minutes). Allow slices to incubate for 1-1.5 h before electrophysiologic experiments.\n5.  Elicit and Record CA3-CA1 Synaptic Responses\nFor basic extracellular recordings in acute slices, your electrophysiology station will need to include*: a recording chamber; a perfusion system; a microscope with > 4X magnification capability; recording, stimulating, and ground electrodes; macro and micromanipulators; a rigid vibration-resistant table-top and Faraday cage;  a stimulator; amplifier and analog-to-digital  (A/D) converter; oscilloscope (preferably); and personal PC with appropriate acquisition software.",
    "*Kerr Scientific Instruments offers a fantastic and inexpensive electrophysiology system (i.e. the Kerr Tissue Recording System) for conducting a variety of basic slice electrophysiology experiments. This system has a small footprint, portable stimulators and amplifiers, and can be used on a standard lab-bench without the need of a bulky Faraday cage.\nOf course, brain slices can also be used for performing numerous elaborate electrophysiologic and imaging techniques, which will require additional equipment and materials. For instance, our main electrophysiology station contains an amplifier with fast voltage- and current-clamp capabilities, a fluorescent illumination system, and a digital camera. This station is used for extracellular field recordings in brain slices, as well as patch-clamp recordings and fluorescent imaging in slices and cell cultures 3,12,13. See Table 3 for a full listing of equipment and components.\nUsing a wide-mouth pipette or small paint brush, transfer one or more slices to the recording chamber* allowing it to acclimate for 10-15 min before stimulation/recording. For our studies, slices are submerged in ACSF and rest on netting inserted into an RC-22 chamber by Warner Instruments (see Figure 3). ACSF is gravity-fed through a regulator to adjust flow-rate, and prewarmed to 32°C  by an inline micro-heater before reaching the recording chamber. A central vacuum line is used to remove ASCF.\n*Many different varieties of submersible and interface-style recording chambers are commercially available. We have observed that slices exhibit more robust synaptic responses in an interface chamber (i.e. slice sits at an interface with humidified air and ACSF)2,11. However, responsivity is generally more stable when slices are submerged in ACSF. Drug perfusion is also more efficient in submersion chambers.",
    "Position stimulating and recording electrodes. With the stimulator or stimulus isolator turned on, but output dialed down to 0, position a stimulating electrode over the slice in the stratum radiatum region of CA2 near the CA3 border (see Figure 4). We use a twisted platinum iridium wire to deliver 50-100 uS diphasic pulses to CA3 Schaffer collateral (SC) fibers. The use of platinum iridium wire and diphasic pulses can help minimized electrode polarization. Lower a recording electrode into CA1 stratum radiatum, just breaking the surface of the slice. Our recording electrode is a Ag/AgCl wire in an ACSF-filled glass micropipette (tip resistance of ~7 MΩ).  Turn the output on the stimulator up to a moderate level (we set our stimulus isolator to ~150 μA) and begin administering stimulus pulses and acquiring activity using acquisition software, such as Clampex from Axon Instruments, Inc. Slowly lower the stimulating electrode in small intervals until a stimulus artificact is recorded in CA1. Next, continue to slowly lower both the stimulating and recording electrodes in intervals while acquiring CA1 responses until the fiber volley (FV) and the excitatory postsynaptic potential (EPSP) amplitudes reach maximal levels (see Figure 4B).",
    "Establish a synaptic strength curve and investigate synaptic plasticity. To generate a synaptic strength curve, deliver stimulus pulses to SC at increasingly higher intensities and record the corresponding activity in CA1. The range and number of stimulus intensity levels used may vary but should be sufficient to generate a sigmoidal curve when plotted against either FV or EPSP values (Figure 5). The FV amplitude provides a reliable estimate of the proportion of presynaptic fibers activated, while the EPSP slope provides an uncontaminated measure of monosynaptic CA3-CA1 currents. Plotting the EPSP slope against the FV across stimulus intensity levels therefore reflects the size of the EPSP per number of activated afferents and provides an excellent estimate of CA3-CA1 synaptic strength. Typically, synaptic strength levels are significantly reduced in area CA1 of aged rats and APP/PS1 mice, relative to young rats and age-matched wild-type mice e.g. see 4,14.\nSlices that show signs of poor health (i.e. a maximal EPSP amplitude < 1 mV) or hyperexcitability (i.e. the appearance of  2 or more population spikes)  during the synaptic strength curve are excluded from statistical analysis (see Figure 4C). We have found that these slices rarely exhibit stable responses across a 60 min period and/or show highly variable responses following induction of synaptic plasticity. It deserves noting that \"unhealthy slices\" make up only about 10-20% of all slices transferred to the recording chamber. Moreover, in our experience, the frequency of identifying an unhealthy slice is very similar across age, species, and genotype.",
    "Induce long-term potentiation (LTP) or long-term depression (LTD) in slices. LTP and LTD are lasting increases (LTP) and decreases (LTD) in synaptic function in response to different patterns of synaptic activation. Both processes are widely believed to reflect critical mechanisms for learning and memory15 and provide useful outcome measures for investigating cellular mechanisms of neural dysfunction and/or for assessing pharmacologic strategies for ameliorating memory deficits and neurodegeneration16.\nFor synaptic plasticity experiments, reset the stimulus intensity for all slices to 1 mV* and begin baseline stimulation at a frequency of 0.033 Hz. EPSP slope values should be stable for at least 20 min prior to the induction of LTP or LTD. Closely monitor EPSPs during this time and reset the stimulus intensity if the slope fluctuates more than 10% and start a new baseline. Induce LTP using a one second train of 100 Hz stimulation or multiple short bursts (~10 pulses) of 100 Hz stimulation given every 200 ms.  For LTD induction, deliver 900 stimulus pulses at a rate of 1 Hz. After induction of LTP or LTD, collect synaptic responses for an additional 60 min or more. EPSP slope values obtained before and 60 min after high/low frequency stimulation are compared to determine the presence of LTP or LTD.",
    "Aged rats and APP/PS1 mice tend to show deficient LTP and enhanced LTD (see Figure 5), and these changes have been suggested to contribute to impaired cognition in these animal models6,16. However, unlike APP/PS1 mice, changes in LTP/LTD in aged rats are variable across labs. Aged rats generally exhibit similar LTP levels compared to adults in response to \"intense\" (i.e. 100 Hz) stimulation, but show deficits when milder stimulation parameters are used (i.e. lower stimulus frequencies or fewer stimulus pulses) (for review see4,6,16). Also, some labs, including ours, have observed increased susceptibility to LTD induction in aged rats2,17-19, while other groups have found no difference or reduced susceptibility in their aged animals. As discussed briefly below (see Discussion), subtle but critical differences in experimental protocol may account for these discrepancies.\n*The stimulation intensity and EPSP amplitude can influence LTP induction and may be an important cause of discrepant results in the literature. This will be considered further in the Discussion section.\n6.  Representative Results\nOur work, and work from other groups, suggests that changes in astrocyte-based inflammatory signaling may trigger and/or hasten neurologic dysfunction during aging and AD 13,20,21. Recently, we have used synaptic strength, LTP, and LTD as endpoint measures to investigate the efficacy and mechanisms of action of several novel anti-inflammatory reagents in mid-aged APP/PS1 mice (see 22 for description of this model) and aged Fischer 344 rats. The results provided below were obtained using the protocols described in this article.",
    "One of the novel anti-inflammatory adeno-associated viral (AAV) reagents developed by our lab has been shown in pilot studies to significantly increase synaptic strength (p < 0.05) and prevent LTP deficits (p <  0.05) in mid-aged (16-month-old) APP/PS1 mice (n = 4-6 slices per treatment condition). Representative synaptic strength curves and LTP experiments from two different slices, collected from the same 16-month-old APP/PS1 mouse, are shown in Figure 5A-C. One slice was extracted from the hemisphere treated with our novel AAV (Reagent A), while the other slice was treated with a control AAV reagent (Control). LTP was induced in both slices using two 1 sec trains of 100 Hz stimulation (10 sec intertrain interval). Note that the synaptic strength curve for the Reagent A-treated slice is shifted to the left of the control slice, indicative of greater synaptic strength. Also note that, typical for mid-aged APP/PS1 mice, LTP decayed rapidly to baseline in the control slice (e.g.23). Conversely, LTP decayed little in the slice treated with our novel reagent.\nIn a second recent study, we observed significant LTD in vehicle-treated aged rats (85 % of pre-LTD baseline, p < 0.05).  In contrast, no LTD was observed in aged rats treated with novel anti-inflammatory \"Drug A\" (97 % of pre-LTD baseline, not significant). No drug effects on synaptic strength were observed. Representative LTD experiments from this data set (n = 8-10 rats per group) are illustrated in Figure 5D-F.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2330/2330fig1.jpg\nFigure 1. Tools and materials used for brain dissection. A, paper towel. B, scalpel blade. C, Beebee scissors. D, bone rongeurs (for rats). E, bone rongeurs (for mice/rats). F, Plastic spoon. G, plastic transfer pipette. H, Hippocampal tool. I, spatula. J, surgical scissors. K, glass petri dish.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2330/2330fig2.jpg",
    "Figure 2. Custom brain slice holding chamber. A, macrochamber. B, lid. C, H2O reservoir with perforated silicone tubing. D, microchamber. E, ACSF delivery tube (polyethylene). F, O2 delivery tube. G, port for temperature control. H, netted microchamber insert.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2330/2330fig3.jpg\nFigure 3. RC22 submersion chamber. A, Recording chamber. B, Ground electrode. C, Aspiration needle.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2330/2330fig4.jpg\nFigure 4. Hippocampal slice illustration and extracellular waveforms. A, Cartoon of a transverse hippocampal section used in electrophysiology experiments. CA = cornu Ammonis. DG = dentate gyrus. SC = Schaffer collaterals. S radiatum = stratum radiatum. B, Electrical stimulation of the SC (a CA3 axon tract) elicits a stimulus artifact, followed almost immediately by a presynaptic population spike, or fiber volley (FV). The amplitude of FV is directly proportional to the number of SC fibers activated. The slope of the negative-going phase of the field excitatory postsynaptic potential (EPSP) corresponds directly to the activation of depolarizing synaptic currents in CA1 pyramidal neurons in response to glutamate release from SC terminals. C, Overlapping representative extracellular waveforms recorded in CA1 stratum radiatum in response to nine different stimulus intensity levels (30-500 μA) in a \"healthy\" (left panel), \"unhealthy\", and \"hyperexcitable\" slice. Five waveforms were averaged per level. Healthy slices respond dynamically across this stimulus range and exhibit a single positive-going population spike (reflecting CA1 neuronal discharge) at the higher stimulus levels. In the RC22 submersion chamber, maximal EPSPs typically range from 1.5 to 3 mV in amplitude. Unhealthy slices (middle panel) often exhibit a large FV, but a small maximal EPSP (< 1 mV) and usually show poor plasticity. Hyperexcitable slices (right panel) show two or more regenerative population spikes in the ascending limb of the EPSP. Responses in hyperexcitable slices are often labile and are variably affected by LTD/LTP stimulation. \nimgsrc://cloudfront.jove.com/files/ftp_upload/2330/2330fig5.jpg",
    "Figure 5. Representative electrophysiology experiments performed on acute slices from mid-aged (16 mos) APP/PS1 mice and aged (22 mos) Fisher 344 rats. Panels A-B show data collected from APP/PS1 mice treated with a control adeno-associated (AAV) viral construct (Control) or a novel AAV reagent (Reagent A) that has been developed by our lab group. Relative to the control slice, the slice treated with Reagent A exhibits a marked leftward shift in the EPSP:FV curve (A) indicative of greater synaptic strength. The Reagent-A-treated slice also shows robust and stable LTP (B) after the delivery of two 1 sec, 100 Hz stimulus trains, while the control slice exhibits deficient LTP, typical of this animal model. Panels D-F show data collected from two individual aged rats that received chronic (4 week) intrahippocampal perfusions of vehicle or a novel anti-inflammatory drug (Drug A). Basal synaptic strength was relatively unaffected by drug treatment (D). However, Drug A was very effective at preventing the induction of LTD (E).  Panels C and F show representative EPSP waveforms recorded from individual slices before (pre) and 60 min after (post) the delivery of LTP/LTD stimulation. Note that stimulus artifacts are not shown."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}