{
  "id": 7539,
  "origin_website": "Bio",
  "title": "Whole-genome Methylation Analysis of APOBEC Enzyme-converted DNA (~5 kb) by Nanopore Sequencing",
  "procedures": [
    "DNA ExtractionThe MagAttract HMW DNA Kit is used for DNA extraction from cultured cells (<2 × 109 cells) and/or clinical specimens (<25 mg tissues), in accordance with the manufacturer's instructions without modification (Note 1).DNA FragmentationFor fragmentation of genomic DNA, add 150 µL of DNA (<4 µg) diluted with nuclease-free water (NFW) to a g-TUBE, and centrifuge twice at 4,700 × g and room temperature (RT) for 1 min. Using the Bioanalyzer with the Agilent DNA 12000 kit, measure the concentration and the length distribution of the fragmented DNA following the manufacturer’s protocol (Note 2). Apply 10–50 ng of fragmented DNA to the next step, diluted with NFW to a 50 µL volume.End Repair and Adaptor LigationSet up the programs of Steps 3, 5, and 12 in a thermal cycler.Combine 50 µL of the fragmented DNA, 7 µL of NEBNext Ultra II End-Prep Reaction Buffer, and 3 µL of NEBNext Ultra II End-Prep Enzyme Mix in a PCR tube. Mix by pipetting.Incubate at 20°C for 30 min, at 65°C for 30 min, then hold at 4°C in a thermal cycler with the heated lid set to 75°C.Add 2.5 µL of NEBNext EMseq Adaptor, 1 µL of NEBNext Ligation Enhancer, and 30 µL of NEBNext Ultra II Ligation Master Mix to the sample. Mix by pipetting.Incubate at 20°C for 15 min, then hold at 4°C in a thermal cycler with the heated lid off.Add 110 µL of NEBNext Sample Purification Beads to the sample. Mix by pipetting. Incubate at RT for 5 min.Place the tube on a magnetic stand for 0.2 mL tubes until it becomes clear (it takes ~2 min) (Figure 2). Remove and discard the supernatant.Add 200 µL of 80% ethanol to the tube. After 30 s, remove and discard the supernatant.Repeat Step 8 once.",
    "Remove the tube from the magnetic stand and spin down on a tabletop centrifuge (~2,000 × g at RT). Place the tube on the magnetic stand. Remove and discard the remaining supernatant completely.Air dry the pellet for 1 min.Remove the tube from the magnetic stand. Elute the DNA from the beads by adding 29 µL of Elution Buffer from the EMseq kit and incubating at 37°C in a thermal cycler for 10 min.Place the tube on the magnetic stand until it becomes clear (it takes ~2 min) (Figure 2). Transfer 28 µL of the supernatant to a new PCR tube.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20220302/20220302184744_7567.jpgFigure 2. Bead separation by magnetic stand. (A) Suspended beads before magnetic separation. (B) Insufficient separation of beads. The solutions are slightly cloudy. (C) Sufficient separation of beads. The solutions are clear.Oxidation of 5 mC’s/5 hmC’sSet up the programs of Steps 5, 7, and 14 in a thermal cycler.Add 10 µL of TET2 Reaction Buffer with supplement, 1 µL of Oxidation Supplement, 1 µL of DTT, 1 µL of Oxidation Enhancer, and 4 µL of TET2 from the EMseq kit. Mix by pipetting.Dilute 1 µL of 500 mM Fe(II) Solution from the EMseq kit in 1,249 μL of NFW in a new 1.5 mL tube.Add 5 µL of the diluted Fe (II) Solution to the sample. Mix by pipetting.Incubate at 37°C in a thermal cycler with the heated lid set to 45°C for 1 h.Add 1 µL of Stop Reagent to the sample. Mix by pipetting.Incubate at 37°C in the thermal cycler with the heated lid set to 45°C for 30 min.Add 90 µL of NEBNext Sample Purification Beads from the EMseq kit to the sample. Mix by pipetting. Incubate at RT for 5 min.Place the tube on a magnetic stand for 0.",
    "2 mL tube until it becomes clear (it takes ~2 min) (Figure 2). Remove and discard the supernatant.Add 200 µL of 80% ethanol to the tube. After 30 s, remove and discard the supernatant.Repeat Step 10 once.Remove the tube from the magnetic stand and spin down on a tabletop centrifuge. Place the tube on the magnetic stand. Remove and discard the remaining supernatant completely.Air dry the pellet for 1 min.Remove the tube from the magnetic stand until it becomes clear (it takes ~2 min) (Figure 2). Elute the target DNA from the beads by adding 17 µL of Elution Buffer from the EMseq kit and incubating at 37°C in the thermal cycler for 10 min.Place the tube on the magnetic stand until it becomes clear (it takes ~2 min) (Figure 2). Transfer 16 µL of the supernatant to a new PCR tube.Denaturation of CytosinesSet up the program of Step 3 in a thermal cycler.Add 4 µL of formamide to the sample. Mix by pipetting.Incubate at 85°C in a thermal cycler with the heated lid set to 95°C for 10 min, then place on ice immediately.Deamination of CytosinesSet up the programs of Steps 3 and 10 in a thermal cycler.Add 68 µL of NFW, 10 µL of APOBEC Reaction Buffer, 1 µL of BSA, and 1 µL of APOBEC from the EMseq kit to the sample. Mix by pipetting.Incubate at 37°C for 3 h, then hold at 4°C, in a thermal cycler with the heated lid set to 45°C.Add 100 µL of NEBNext Sample Purification Beads from the EMseq kit to the sample. Mix by pipetting. Incubate for 5 min at RT.Place the tube on the magnetic stand for 0.2 mL tubes until it becomes clear (it takes ~2 min) (Figure 2). Remove and discard the supernatant.",
    "Add 200 µL of 80% ethanol to the tube. After 30 s, remove and discard the supernatant.Repeat Step 6 once.Remove the tube from the magnetic stand and spin down on a tabletop centrifuge. Place the tube on the magnetic stand. Remove and discard the remaining supernatant completely.Air dry the pellet for 1 min.Remove the tube from the magnetic stand. Elute the target DNA from the beads by adding 41 µL of NFW and incubating at 37°C in a thermal cycler with the heated lid set to 45°C for 10 min (Note 3).Place the tube on the magnetic stand until it becomes clear (it takes ~2 min) (Figure 2). Transfer 20 µL of the supernatant to two PCR tubes (each tube contains of the supernatant).PCR AmplificationSet up the PCR program of Step 3 in a thermal cycler.Add 5 µL of the custom primer mix (10 µM each, described in Table 1), and 25 µL of KOD ONE PCR Master Mix to each tube. Mix by pipetting.Perform PCR amplification of both tubes using the following PCR program: 13–16 cycles of 94°C for 15 s, at 57°C for 5 s, 68°C for 15 min, then hold at 4°C. The number of PCR cycles depend on the amount of input DNA (16 cycles for 10 ng DNA input, 13 cycles for 50 ng DNA input) and the quality of DNA.Table 1. PCR program table:",
    "﻿0,1,2\nTemperature,Time,Cycles\n94°C,15 s,13–16\n57°C,5 s,13–16\n68°C,15 min,13–16\n4°C,Hold,1\nCombine the separately amplified samples into one tube. Purify the sample by using a purification column of DNA Clean & Concentrator-5, according to the manufacturer’s instructions. Elute the DNA from the column by adding 52 µL of NFW, pre-incubated at 70°C. Repeat the elution step by adding the 52 µL of flowthrough back to the column. The quality of the purified DNA is measured using the Agilent DNA 12000 kit (Figure 3A).Table 2. Custom primer sequences table:\n﻿0,1\nPrimer,Primer\nForward primer,CAAGCAGAAGACGGCATACGAGATCGAGTAATGTGACTGGAGTTCAGACGTGTGCTCTTCCGATCT\nReverse primer,AATGATACGGCGACCACCGAGATCTACACTATAGCCTACACTCTTTCCCTACACGACGCTCTTCCGATCT",
    "Size SelectionSet up the programs of Step 8 in a thermal cycler.Add 41–45 µL of ProNEX Chemistry (0.82–0.9×) to 50 µL of the DNA. Incubate at RT for 10 min.Place the tube on a magnetic stand for 0.2 mL tubes until it becomes clear (it takes ~2 min) (Figure 2). Remove and discard the supernatant.Add 200 µL of wash buffer to the tube. After 30 s, remove and discard the supernatant.Repeat Step 4 once.Remove the tube from the magnetic stand and spin down on a tabletop centrifuge. Place the tube on the magnetic stand. Remove and discard the remaining supernatant completely.Air dry the pellet for 1 min.Remove the tube from the magnetic stand. Elute the target DNA from the beads by adding 51 µL of NFW and incubating at 37°C in the thermal cycler with the heated lid set to 45°C for 10 min.Place the tube on a magnetic stand until it becomes clear (it takes ~2 min) (Figure 2). Transfer 50 µL of the supernatant to a new PCR tube. The quality and quantity of the purified DNA are assessed using the Agilent DNA 12000 kit (Note 2) and the Qubit ds DNA HS Assay kit (Figure 3B) (Note 4).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20220302/20220302185254_9699.jpgFigure 3. Amplicon of base-converted DNA. (A and B) The amplicon distribution of base-converted DNA (A) before and (B) after size selection. DNA was quantified with the Agilent DNA 12000 kit. The reaction was performed with 50 ng of fragmented DNA from a breast cancer cell line BT-474 (Lasfargues et al., 1978). The amplification was performed with 13 cycles of polymerase chain reaction, using the KOD ONE PCR Master Mix and the primers described in Table 1. Size selection of the amplified DNA was performed using the 0.82× volume of ProNEX Chemistry.",
    "Library Preparation for Nanopore SequencingSet up the programs of Steps 3 and 22 in a thermal cycler.Combine 48 µL of the sample, 3.5 µL of NEBNext FFPE DNA Repair Buffer, 3.5 µL of Ultra II End-Prep Reaction Buffer, 2 µL of NEBNext FFPE DNA Repair Mix, and 3 µL of Ultra II End-Prep Enzyme Mix in a new PCR tube. Mix by flicking the tube and spin down on a tabletop centrifuge.Incubate at 20°C for 5 min, then 65°C for 5 min, in a thermal cycler with the heated lid set to 75°C.Add 60 µL of AMPure XP beads to the sample. Mix by flicking the tube and spin down on a tabletop centrifuge.Incubate at RT for 5 min.Place the tube on a magnetic stand for 0.2 mL tubes until it becomes clear (it takes ~2 min) (Figure 2). Remove and discard the supernatant.Add 200 µL of 70% ethanol to the tube. After 30 s, remove and discard the supernatant.Repeat Step 7 once.Remove the tube from the magnetic stand and spin down on a tabletop centrifuge. Place the tube on the magnetic stand. Remove and discard the remaining supernatant completely.Air dry the pellet for 1 min.Remove the tube from the magnetic stand. Elute the DNA from the beads by adding 61 µL of NFW and incubating at 37°C in a thermal cycler with the heated lid set to 45°C for 10 min.Place the tube on the magnetic stand until it becomes clear (it takes ~2 min) (Figure 2). Transfer 61 µL of the supernatant to a new PCR tube. Use 1 µL of the sample for quantification by Qubit ds DNA HS Assay kit.Add 25 µL of ligation buffer, 10 µL of NEBNext Quick T4 DNA Ligase, and 5 µL of Adapter Mix F to the sample.",
    "Mix by flicking the tube and spin down on a tabletop centrifuge.Incubate at RT for 10 min.Add 40 µL of AMPure XP beads to the sample. Mix by flicking the tube and spin down on a tabletop centrifuge.Incubate at RT for 5 min.Place the tube on a magnetic stand for 0.2 mL tubes until it becomes clear (it takes ~2 min) (Figure 2). Remove and discard the supernatant.Remove the tube from the magnetic stand. Wash the beads by adding 250 µL of long fragment buffer to the tube. After flicking the beads to resuspend, return the sample to the magnetic stand. Once the solution is clear, remove and discard the supernatant.Repeat Step 18 once.Remove the tube from the magnetic stand and spin down on a tabletop centrifuge. Place the tube on the magnetic stand. Remove and discard the remaining supernatant completely.Air dry the pellet for 30 s.Remove the tube from the magnetic stand. Elute the DNA from the beads by adding 25 µL of elution buffer from the Ligation Sequencing kit and incubating at 37°C in a thermal cycler with the heated lid set to 45°C for 10 min.Place the tube on a magnetic stand until it becomes clear (it takes ~2 min) (Figure 2). Transfer 25 µL of the supernatant to a new PCR tube. Use 1 µL of the sample for quantification by Qubit ds DNA HS Assay kit. Estimate the molarity of the prepared library by correcting the mass concentration of the library with the mole and mass concentrations of the DNA before library preparation. Apply 5–50 fmol of the eluted library to the next step (Note 5).",
    "If more than 50 fmol of DNA is contained in 24 µL of the library, diluted 5–50 fmol of the library up to 24 µL by elution buffer from the Ligation Sequencing kit.Priming and Loading the PromethION FlowcellAdd 30 µL of Flush Tether (FLT) to one tube of Flush Buffer (FB). Mix by vortexing.Set the flowcell to the PromethION sequencer. Remove air from the inlet port of the flowcell by pipetting, to avoid the introduction of air bubbles.Prime the flowcell with 500 µL of FB/FLT mix. After incubation for 5 min, re-prime with 500 µL of FB/FLT mix.Add 75 µL of Sequencing Buffer II and 51 µL of re-suspended Loading Beads II to the library.Mix by gently pipetting. Immediately load the 150 µL of library to the flowcell and run the program. A video for priming and loading the flow cell of PromethION is available on the community site of Oxford Nanopore Technologies (https://community.nanoporetech.com/protocols/genomic-dna-by-ligation-sqk-lsk110/v/gde_9108_v110_revl_10nov2020/priming-and-loading-the-flow-cell?devices=promethion[href=https://community.nanoporetech.com/protocols/genomic-dna-by-ligation-sqk-lsk110/v/gde_9108_v110_revl_10nov2020/priming-and-loading-the-flow-cell?devices=promethion])."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Systems Biology",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}