{
  "id": 9729,
  "origin_website": "Jove",
  "title": "Optic Nerve Transection: A Model of Adult Neuron Apoptosis in the Central Nervous System",
  "procedures": [
    "1.  Surgical Technique\nExperiments should be carried out using aseptic technique and following the animal use protocols of your specific institution. Instruments and materials (solutions, test substances, tracers, needles, etc.) coming into contact with living tissue must be sterile to prevent infection and adverse impacts on animal welfare and potential negative impacts on the study.\n2.  Anesthesia\nRats will be anaesthetized using a veterinary isoflurane vaporizer system. Use medical grade oxygen at a rate of 0.8 L/min to vaporize the isoflurane gas. Place the animal in the attached anesthesia box and dial in an isoflurane concentration of 4% until the breathing has slowed and the animal is sedate.\nNext, switch the gas flow to the gas mask attachment for the stereotaxic frame and place the animal in the stereotaxic apparatus.  Turn the isoflurane \n\t concentration down to 2% and monitor anesthesia. Larger animals (>300g) may require a higher concentration of isoflurane. Anesthesia should be monitored \n\t during surgery and isoflurane dosage adjusted accordingly. Depth and rate of breathing should be constantly evaluated, and toe pinch evaluation (every 5 min) \n\t for the absence of deep pain should be performed.\nOnce the surgery is complete, turn off the isoflurane and allow the animal to breath oxygen for several minutes prior to removal from the stereotaxic device. Body temperature should be maintained by covering the animal with a surgical blanket and/or using a regulated heating blanket during surgery.\n3.  Surgical Approach",
    "Wet the fur on top of the head with 70% ethanol to make the fur easier to cut. Remove the fur from between the eyes using a clipper or sharp scissors. Clean the incision area three times with alternating applications of iodine detergent solution (Proviodine, Betadine, etc) followed by 70% ethanol. Maintain the cornea moist throughout the surgery by applying ophthalmic eye ointment (Tears Naturale P.M.) to the cornea. Spread the ointment over the surface of the cornea by manually opening and closing the eyelids.\nUsing a No. 11 blade, make an incision along the midline of the head from approximately 0.5 cm in front of the eyes to 1 cm behind the eyes. Retract the flap \n\t of skin over the eye using forceps and gently tease away the underlying connective tissue with the back of the scalpel. Then, retract the flap of skin laterally \n\t and downward and hold in place with a surgical retractor that can be taped to the base of the stereotaxic instrument.\nMake an incision along the superior rim of the orbital bone while pulling on the overlying fascia with sharp forceps. This will withdraw the fascia overlying the orbit of the eye. The rim of the orbital bone can be clearly demarcated by using forceps to push down on the fascia overlying the orbit. Using a cautery device or scalpel, continue the incision backwards towards the posterior limit of the orbit of the eye. Use the bone of the superior orbit as a guide for the incision. Next continue the incision forwards toward the anterior limit of the orbit. The incision of the superior orbit is best done using a small cautery device in order to prevent bleeding from the underlying vessels that communicate with the venous sinuses.",
    "If bleeding occurs several steps can be taken. Firstly, apply pressure using sterile surgical swabs or cotton swabs. If bleeding continues, apply cold, sterile phosphate buffer saline (PBS) to the area using a dropper, and maintain pressure. Minor bleeding will stop after several seconds using this procedure. If bleeding persists, apply traction to the tissue with the surgical swab or cotton swab in order to identify the source of bleeding and rapidly cauterize the compromised vessel. After the bleeding is contained, use cold sterile PBS to clean the surgical area of blood. The surgical area should be periodically cleaned in this fashion in order to better visualize structures in the orbit of the eye.\nOnce the incision has been cleaned, use forceps and the back of the scalpel to clean the connective tissue at the back of the eye that overlies the orbital contents. The back of the No. 11 scalpel works well as the tip is fine. This will open up deeper portions of the orbital cavity providing a larger surgical window to work in. Use Dumont #7b sharp-curved-serrated forceps when working in the eye as their curvature and fine tips are ideal for manipulating structures in the orbit. Furthermore, the serrations help with gripping structures.\nNext, remove the connective tissue that surrounds the ophthalmic division of the trigeminal nerve which sits near the midline, and remove the nerve using forceps. This step is not necessary, however removing the nerve will provide a larger window of access to the optic nerve later on.\nFollowing removal of the nerve, use forceps to retract the blood vessel below and completely cauterize the vessel. This step is also not necessary, however cautery of the vessel allows it to be moved anteriorly, thereby creating a larger window once the optic nerve is reached.",
    "Use a sharp pair of forceps, or forceps that have had their tips bent inward to carefully pick and remove the thin layer of connective tissue over the extraocular muscles and lacrimal gland. Retract the extra ocular muscles from anterior to posterior of the orbit. Grip the proximal part of the muscle with a pair of forceps and use a second pair of curved serrated eye dressing forceps to apply outward traction on the muscle. Make sure that the eye dressing forceps are oriented in the same direction as the muscle when pulling in order to prevent tearing. Remove the most anterior muscle of the orbit (Superior Oblique) in this manner. The muscle will be liberated from deep within the orbit and the remaining length can be retracted in order to rotate the eye outward.\nRepeat Step 3.8 with the next muscle (Medial Rectus) that is located between the lobes of the lacrimal gland and Harderian Gland near the midline of the dorsal surface of the eye. Tape down the retractor to maintain traction on the muscles.\nGently remove any remaining connective tissue over the surface of the lacrimal gland and lift the gland upward using forceps. Do not compress or squeeze the gland. In order to retract the gland, only a single vessel at the posterior pole needs to be cauterized.  Lift the posterior end of the gland upward, and then cauterize the vessel.\nNext, flap the lacrimal gland forward to open the posterior part of the orbit and allow unimpeded access to the muscles that overlie the optic nerve. Keep the area constantly moist using sterile PBS, and drying with surgical swabs or cotton swabs.",
    "Using sharp forceps once again remove the thin connective tissue that surrounds the muscles of the posterior orbit (Levator Palpebrae Superioris and Superior Rectus) and separate the underlying bundles of muscle. Retract the muscles independently or in unison, using the curved serrated eye dressing forceps, once again, pulling in line with the muscle fibers. Attach the remaining muscle lengths to the retractor along with the muscles that were retracted in Steps 3.8 and 3.9 and tape down the retractor to apply traction. A total of 4 muscles will now be attached to the retractor. This will rotate the eye forward and outward in order to reveal the fat containing sheath that surrounds the optic nerve.\n4.  Accessing the Optic Nerve\nUse sharp forceps (Fine tip Dumont) to pull upward on the connective tissue that surrounds the fatty sheath of the optic nerve. Make a longitudinal cut using small Vannas spring scissors. Expand the cut as necessary. The fat contained by the sheath will begin to bulge out once the cut is made. Next remove the flaps of connective tissue by carefully pulling upward from the edge and cutting off the crescent shaped flaps of tissue.\nRemove the fat overlying the optic nerve by using forceps to pull on the fat, while cutting with the Vannas spring scissors. Keep the area clean using sterile PBS and surgical swabs to clean the small amounts of blood that arise from the removal of the tissue.",
    "The optic nerve is now visible. In order to access the nerve, the meningeal sheath that surrounds the nerve must be removed without damaging the ophthalmic artery which feeds the inner retina. Examine the vascular pattern of the meningeal sheath using forceps to gently rotate the sheath. Look for an area devoid of blood vessels, and permitting a longitudinal cut to be made in the meningeal sheath.\nUsing fine tip Dumont forceps, pinch the dura and pull upward. Near the base of the triangular shaped wedge of dura that is created, use the Vannas spring scissors to make a small incision in the sheath. Insert the lower blade of the scissors into the incision and cut the sheath parallel to the direction of the optic nerve, careful not to damage the vasculature  with lateral cuts. Use the forceps and scissors to drape the dura to either side of the optic nerve.\nThe only remaining covering of the nerve is the arachnoid membrane. It is very thin and transparent. In order to determine if the membrane is still present, use sharp forceps to pinch the surface of the nerve. It the arachnoid is present, pinch the membrane and pull upward to create a triangular wedge of tissue. Make a small incision with the tip of the scissors similar to Step 4.4. Then, insert the lower blade of the scissors and make a longitudinal cut in the arachnoid. Next, use your scissors and forceps to drape the arachnoid to either side of the optic nerve.",
    "Using a micro-surgical hook, elevate the optic nerve out of the meningeal sheath. Pass the tip of the hook around the outer edge of the nerve and make sure that the hook stays in contact with the nerve so that you do not catch the meningeal membranes with the hook and accidentally transect them. Gently lift the optic nerve out of the meningeal sheath and completely transect the nerve behind the point supported by the hook. The transected optic nerve stump will now have a free end, allowing for the removal of the hook.\nIf the RGCs are going to be retrogradely labeled in order to quantify survival, place a small piece of gelfoam soaked in 3% Fluorogold (or another retrograde tracer) over the transected optic nerve stump  (see JoVE protocol 2261[href=http://www.jove.com/details.php?id=2261]).\n5.  Closing and Recovery\nRelieve the traction on the extra ocular muscles and return the eye to a neutral position. While doing so, make sure to push the gelfoam down into the orbit of the eye to ensure that as the eye is rotated back into place, the gelfoam remains around the optic nerve stump. Return the lacrimal gland and extra ocular muscles to their natural positions.\nReturn the flap of skin to the midline and suture the wound. Apply ophthalmic eye ointment to both eyes. Then, turn off the isoflurane source and allow the animal to breath oxygen for several minutes. Place the animal in a heated cage or a cage underneath a heat lamp to recover. Do not place any bedding in the recovery cage to eliminate the chance of aspirating bedding during recovery.\nAnimals should be housed independently after surgery. Post surgical analgesics should be administered according to the guidelines of your animal care authorities, and animals should be carefully monitored after surgery.",
    "6.  Representative Results:",
    "Transection of the optic nerve results in the loss of 90% of injured RGCs within 14 days postaxotomy 9-11. The main mechanism of RGC death is apoptosis 9, 12. The normal density of RGCs is approximately 2500 cells/mm2. Epifluorescence or confocal imaging can be used to visualize retrogradely labeled RGCs after axotomy. RGC apoptosis is delayed by approximately 4 days after axotomy, leaving a time window for experimental manipulations. At 1 day after axotomy and retrograde labeling with Fluorogold, RGC cell bodies in the ganglion cell layer of the retina and axon fascicles in the nerve fiber layer of the retina are clearly visible when imaging a flatmounted preparation (Fig 1a). By 14 days after axotomy, the majority of RGCs have died, and a few remaining RGCs are interspersed between retinal microglia (Fig 1b). When RGCs undergo apoptosis, microglia phagocytose the dead cells and as a result become transcellularly labeled with the fluorescent tracer that was used to label the RGCs 13, 14. The appearance of the tracer in the phagosomes of microglia is different from that in surviving RGCs. Microglia contain the tracer in highly concentrated and extremely bright phagosomes that are relatively large and scattered throughout their cytoplasm (Fig 1c). RGCs have a more diffuse pattern of staining (Fig 1c) with small punctate vesicles that have been retrogradely transported down their axons filing the cell cytoplasm. These vesicles are much smaller and have less intense fluorescence allowing one to differentiate surviving RGCs from microglia. Furthermore, microglia have much smaller cell bodies and tend to have a stellate or amoeboid morphology as opposed to RGCs that have relatively large and rounded cell bodies. The dendritic trees of RGCs can also help differentiate them from the short bright processes of microglia, when quantifying cell survival.",
    "Cell survival can be quantified in different regions of the retina and the density (cells/mm2) can be extrapolated from the area of the corresponding micrographs, since RGCs are found in a monolayer within the ganglion cell layer.",
    "imgsrc://cloudfront.jove.com/files/ftp_upload/2241/2241fig1.jpgFigure 1. Epifluorescence micrographs of Fluorogold labeled RGCs after axotomy and application of the tracer to the optic nerve stump.  (A) 1 day after axotomy RGCs and their axon fascicles are labeled with the tracer in a fine punctate manner. (B) By 14 days after axotomy, 90% of RGCs have died and brightly labeled microglia that have phagocytosed dead cells are also labeled with the tracer. (C) Higher magnification illustrating the difference between RGCs and microglia (red arrowheads) at 14 days postaxotomy. Scale bar in A and B is 50 μm. Scale bar in C is 25 μm.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}