{
  "id": 8557,
  "origin_website": "Jove",
  "title": "Multi-Fiber Photometry to Record Neural Activity in Freely-Moving Animals",
  "procedures": [
    "All experiments were done in accordance with the Institutional Animal Care and Use Committees of the University of California, San Diego, and the Canadian Guide for the Care and Use of Laboratory Animals and were approved by the Université Laval Animal Protection Committee. \n1. Alignment of the optical path between the CMOS (complementary metal oxide semiconductor) camera and the individual or branching patch cord\nLoosen all screws on the 5-axis translator (11, Figure 2B).\nScrew in the patch cord (12, Figure 2B) to the adaptor [SMA (sub-miniature A) or FC (fiber optic connector)] that is affixed to the 5-axis translator.\nTurn on the 470 nm excitation light (1, Figure 2B) at low power (100 µW), and place the tip of the patchcord pointing to an autofluorescent plastic slide. This does not have any bearing on future recordings but is solely for visualizing the alignment process.\nRecord from the CMOS camera (13, Figure 2B) in live mode. Increase the gain or adjust the lookup table (LUT) until the image is not entirely black. The point is to be able to see an image at the focal point of the objective (10, Figure 2B).\nAdvance the 5-axis translator towards the objective, ensuring that the 470 nm light is centered on the fiber at the SMA or FC end of the patch cord, until an image can be resolved on the camera.\nAdjust the X and Y axes until the image is centered and well-resolved.",
    "Visualize the light emitted from the ferrule-end of the patch cord. It should appear as an isotropic circle. If a branching patch cord is used, the amount of light emitted at the ferrule-ends of each patch cord should be similar. If the circle is not isotropic or the emitted light is unequal, adjust the 5-axis translator in the X-Y axis.\n2. Setup of ROIs around fibers for measurement of mean fluorescent intensity\nTurn on all the excitation lights to better visualize the fibers. Adjust the camera gain such that no pixels are saturated and a clear image of the fibers are present.\nLive record or take a preliminary image.\nDraw ROIs around the fibers and keep them for the measurement of the mean intensity values during recordings (Figure 2A).\nFor multiple fiber recordings, test for independence in signals.\n\t\nLive record from all fibers.\nPoint one fiber towards a light source and tap with a finger. Very large fluctuations should occur solely in that channel (acceptable leakage 1:1000).\nIf the signals are not independent, redraw more conservative ROIs and repeat the independence test.\nTo label and keep track of which ROI corresponds to which fiber, colored tape or nail polish can be applied to the end of the fibers. Take a picture prior to the start of any experiment as a secondary reminder.\n3. Setup of recording arena\nHang the patch cord above the arena using stands, clamps, or holders.\nMake sure that the animal can freely move throughout the entire arena, uninhibited by the length of the fiber.",
    "Whether an operant box or open field is used, ensure that the patch cord will be able to reach the animal with minimal bending. If this requires a nose poke, ensure that there is enough room overhead to prevent bending of the fiber. Avoid any excessive bending or twisting of the patch cord.\n4. In vivo recordings\nNOTE: The procedure of optic fiber cannula implantation for fiber photometry experiments is identical to the procedure for optogenetics as described in Sparta et al15. We recommend using dental cement (see Table of Materials), which provides robust anchoring of the headcap to the skull bone. Dental cement will be particularly useful in cases where anchoring screws cannot be used.\nVisually inspect the distal end of the fibers of the patch cord by eye and with a minifiber microscope. If the surface of the fibers is scratched, repolish the fibers using fiber polishing/lapping film with fine grit (1 µm and 0.3 µm).\nClean the distal ends of the patch cord with 70% ethanol and a cotton tip applicator.\nClean the fiber-optic cannulas using 70% ethanol and a cotton tip applicator.\nConnect the ferrule end of the patch cord to the implanted fiber using a ceramic split-sleeve covered with a black shrink tube. During the connection, make sure that the sleeve is tight, otherwise use a new sleeve.\n\tNOTE: There will be a large amount of signal loss if there is any space between the patch cord ferrule and the implant, and the recordings will not work.\nAllow the animal to recover for a few minutes prior to the start of behavioral testing.\nStart recording the optical signal and run the experiment.",
    "While recording, keep a careful eye on the live-trace to ensure quality recordings. The signal is expected to rapidly decrease as a function of time in the first 2 min of recording. This effect is caused by heat-mediated LED decay, whereby the increase in heat increases the resistance of the optical element.\nIf a jump in the signal that exceeds the on/off kinetics of GCaMP occurs, this is often an indication that the sleeve is not tight enough and the space between the patch cord and the implant is changing. In this case, stop the experiment and reconnect the animal using a new sleeve.\n5. Fiber photometry data analysis\nNOTE: This is a method for data analysis that works well for most recordings. However, alternative approaches can be implemented. Example code for data analysis can be found here: https://github.com/katemartian/Photometry_data_processing.\nExtract mean fluorescence intensity values recorded from 470 nm (Int470) and 410 nm (Int410) LEDs, corresponding to each individual fiber.\nSmooth each signal using a moving mean algorithm (Figure 3A).\nPerform baseline correction of each signal (Figure 3A and 3B) using the adaptive iteratively reweighted Penalized Least Squares (airPLS) algorithm (https://github.com/zmzhang/airPLS) to remove the slope and low frequency fluctuations in signals.\nStandardize each signal using the mean value and standard deviation (Figure 3C):\nimgsrc://cloudfront.jove.com/files/ftp_upload/60278/60278equ01v2.jpg\nUsing non-negative robust linear regression, fit standardized zInt410 to zInt470 signals (Figure 3D) to the regression function:\nimgsrc://cloudfront.jove.com/files/ftp_upload/60278/60278equ02v2.jpg\nUse the parameters of the linear regression (a, b) to find new values of zInt410 fitted to zInt470 (fitInt410, Figure 3D,E):\nimgsrc://cloudfront.jove.com/files/ftp_upload/60278/60278equ03v2.jpg\nCalculate the normalized dF/F (z dF/F) (Figure 3F):\nimgsrc://cloudfront.jove.com/files/ftp_upload/60278/60278equ04v2.jpg\n6. Simultaneous dual-color recordings\nAdd to the photometry system a 560 nm LED to excite the red fluorescent calcium sensor and appropriate dichroic mirrors and filters (see Kim et al., 2016 for detailed description)12.",
    "Add an image splitter between the objective and the CMOS camera to separate the green and red emission wavelengths (see Figure 5). The image splitter will form two mirrored images on the camera sensor, corresponding to the red and green signals (e.g., a patch cord with 3 branches will create an image with 6 fibers).\nDraw ROIs around all fibers in both colors as detailed above. Make sure to clearly identify each ROI with the corresponding fiber and channel (green and red) (Figure 4A).\nTrigger simultaneous excitation with 470 nm and 560 nm LEDs and alternate them with 410 nm LED (Figure 5A).\n7. Dual color data analysis\nFollow the steps in Section 5 to find fitInt410 for the Int470 signal and calculate z dF/F.\nBecause the isosbestic point for red-shifted GECIs is generally unknown, the signal recorded with 410 nm LED in the green channel can be used for movement correction across both channels. Follow the steps in Section 5 to find fitInt410 for the Int560 signal and calculate z dF/F.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}