{
  "id": 13515,
  "origin_website": "Jove",
  "title": "Differentiating Chondrocytes from Peripheral Blood-derived Human Induced Pluripotent Stem Cells",
  "procedures": [
    "The protocol for the generation of hiPSCs from PBCs can be found in our previous study5. The study was approved by the Institutional Review Board of our institution.\n1. Embryoid Body (EB) Formation\nMake 50 mL of hiPSC medium: Knockout Dulbecco's Modified Eagle Medium (DMEM) supplemented with 15% knockout serum replacement (KSR), 5% fetal bovine serum (FBS), 1× nonessential amino acids, 55 μM 2-mercaptoethanol, 2 mM L-glutamine, and 8 ng/mL basic fibroblast growth factor (bFGF).\nMake 50 mLof EB formation medium: DMEM supplemented with 15% KSR, 5% FBS, 1x nonessential amino acids, 55 μM 2-mercaptoethanol, and 2 mM L-glutamine.\nMake 50 mL of basal culture medium: DMEM supplemented with 20% FBS, 1× nonessential amino acids, 55 μM 2-mercaptoethanol, and 2 mM L-glutamine.\nPrepare 10 mL of dispase solution, 1 mg/mL in knockout DMEM.\nCulture hiPSCs onto 60-mm tissue culture dishes with feeder cells (i.e., a monolayer of irradiated mouse embryonic fibroblast cells). When the cells are 80-90% confluent, disassociate the cells with dispase and passage the hiPSCs 1:3 every 4-5 days. Place the cells into a 37 °C and 5% CO2 incubator.\nDissect the undifferentiated hiPSC colonies into smaller pieces (about 50-100 µm in diameter) using a fire-drawn glass needle when the iPSCs are 80-90% confluent. Generally, use hiPSC colonies in a 60-mm dish to generate EBs in a 100 mm Petri dish.\nCulture less than 100 small pieces of colonies in a 100 mm, non-adherent Petri dish containing 10 mL of EB formation medium. Place the dishes into a 37 °C and 5% CO2 incubator.",
    "Replace approximately 25% of the initial medium with an equal amount of the basal culture medium every 2 days. Tilt the dish to let the EBs settle. Carefully remove 3 mL of upper medium and add 4 mL of fresh basal culture medium. Do not disturb the EBs.\n\tNOTE: The EBs are morphologically characterized by the pieces of colonies, taking on a round appearance with smooth borders under the microscope.\nAfter 10 days of culture in the non-adherent Petri dish, coat a new 100-mm tissue culture dish with 4 mL of 0.1% gelatin for 30 min at 37 °C before use.\nTransfer the medium plus EBs from a 100 mm, non-adherent Petri dish to a 15-mL conical tube. Let the EBs sediment for 4-5 min. Aspirate the supernatant carefully and leave less than 0.5 mL of medium plus EBs\nSeed less than 100 EBs onto a 100 mm, gelatin-coated tissue culture dish with 10 mL of basal culture medium. Place the dishes into a 37 °C and 5% CO2 incubator.\n2. Cell Pellet Formation and Chondrocyte Differentiation\nMake 10 mL of 0.25% trypsin/ethylenediaminetetraacetic acid (EDTA). Make 80 mL of basal culture medium: DMEM supplemented with 20% FBS, 1x nonessential amino acids, 55 μM 2-mercaptoethanol, and 2 mM L-glutamine.\nMake 10 mL of chondrogenic differentiation medium: DMEM (high glucose) supplemented with 10% insulin-transferrin-selenium solution (ITS), 0.1 µM dexamethasone, 1 mM ascorbic acid, 1% sodium pyruvate, and 10 ng/mL transforming growth factor-beta 1(TGF-β1).\nRefresh the medium with 10 mL of basal culture medium after 48 h. Thereafter, refresh the medium every three days with 10 mL of basal culture medium.\n\tNOTE: After 10 days in culture, fibroblastic cell outgrowths should have expanded from the EBs.",
    "Coat the 100 mm dishes with 4 mL of 0.1% gelatin for 30 min at 37 °C before use. Discard the cell supernatant and wash the cells with Dulbecco's Phosphate-Buffered Saline (DPBS) once.\nDigest the cells with 3 mL of 0.25% trypsin/EDTA at 37 °C for 5 min and neutralize with 4 mL of basal culture medium.\nDissociate the cells into single cells by pipetting up and down 5-10 times and passing them through a 70 µm nylon mesh. Centrifuge the cell suspension at 200 x g for 5 min. Re-seed the cells on a new 100 mm, gelatin-coated tissue culture dish with 10 mL of basal culture medium.\nRefresh the medium with 10 mL of basal culture medium after 48 h. Thereafter, refresh the medium every three days with 10 mL of basal culture medium.\n\tNOTE: The cells acquire a homogenous, fibroblast-like morphology.\nWhen ~90-100% confluence is reached (i.e., about 5-7 days), harvest the cells with 3 mL of 0.25% trypsin/EDTA at 37 °C for 5 min. Neutralize with 4 mL of basal culture medium. Dissociate the cells into single cells by pipetting up and down 5 times. Use a hemocytometer to count the cell number.\nPlace 3 x 105 cells in a 15 mL polypropylene tube. Centrifuge at 200 x g for 5 min at room temperature (RT). Re-suspend the cells in 1 mL of chondrogenic differentiation medium.\nRe-centrifuge the cells at 300 x g for 3 min and maintain the cells in small pellet form. Put the tube into the 37 °C and 5% CO2 incubator for 21 days. Do not screw the lid on tightly and let the gas exchange.\nReplace 3/4 of the culture medium every three days with fresh chondrogenic differentiation medium.",
    "NOTE: After 21 days in culture, hiPSC-chondrogenic pellets (hiPSC-Chon) should have formed. Human mesenchymal stem cells (MSCs), as a positive control, are also collected and cultured in the chondrogenic differentiation medium for 21 days to form chondrogenic pellets (hMSC-Chon).\n3. Analysis of Chondrogenic Differentiation\nPrepare 10 mL of 10% neutral-buffered formalin.\nPrepare 50 mL of 0.1% alcian blue reagent and 50 mL of 1% toluidine blue reagent.\nPrepare 1 mL of the primary antibodies: rabbit polyclonal antibodies against collagen II (1:50) or mouse monoclonal antibodies against collagen X (1:50). Also, prepare anti-rabbit or mouse secondary antibodies.\nMake 1 mL of papain solution: 10 U/mL in PBS with 0.1 M sodium acetate, 2.4 mM EDTA, and 5 mM L-cysteine.\nMake 100 mL dimethylmethylene blue (DMMB) dye solution: 100 µL of 16 mg/L 1,9-dimethylmethylene blue, 40 mM glycine, 40 mM NaCl, and 9.5 mM HCl; pH 3.0.\nAssess chondrogenic differentiation by alcian blue and toluidine blue stains of the pellet sections.\nFix one hiPSC-Chon pellet or hMSC-Chon pellet in 1 mL of 10% neutral-buffered formalin for 24 h.\nTransfer the pellet to 1 mL of 70% ethanol in H2O. Dehydrate the pellet with 1 mL of a graded ethanol series (i.e., 25, 50, 75, 90, 95, 100, and 100%, 3 min each).\nClarify the pellet in 1 mL of 100% xylene three times. Infiltrate the pellet with paraffin for 1 h in a 65 °C oven. Embed the pellet into paraffin blocks with a 7 x 7 x 5 mm3 base mold, following routine histological procedures6.\nMake adjacent sections by microtome with a thickness of approximately 4 µm7. Adhere the sections onto glass slides.\nDry the slides for 2 h at 60 °C in an oven. Deparaffinize the sections in three cycles (3 min each) using 100% xylene.",
    "Use a decreasing alcohol series for rehydration (i.e., 100, 100, 95, 95, 70, 50, and 25% in H2O, 3 min each) and then perform a final rinse with deionized water for 5 min.\nStain the sections with 0.1% alcian blue reagent or 1% toluidine blue staining for 4-5 h and then rinse them with distilled water.\nDehydrate with a graded ethanol series (i.e., 25, 50, 75, 90, 95, 100, and 100%, 3 min each) followed by three consecutive steps of clarification in 100% xylene. Mount the slides and visualize them under a microscope.\nPerform immunohistochemistry.\n\tNOTE: Additional pellet sections are further assessed by immunohistochemistry.\n\t\nAfter deparaffinization and rehydration, bring the slides to a boil in 1 mM EDTA, pH 8.0 (waterproof in water boiled by autoclave). Let them sit for 8 min at a sub-boiling temperature and then allow the slides to cool at RT.\nRinse the slides with deionized water 3 times. Incubate the sections in 3% H2O2 solution in methanol at RT for 15 min to block endogenous peroxidase activity.\nRinse the slides with deionized water and immerse them in DPBS for 5 min. Apply 50-100 µL of appropriately diluted (1:50) primary antibody to the sections on the slides and then incubate them in a humidified chamber at RT for 1 h.\nWash the slides 3 times (5 min each) with DPBS. Incubate the samples with the corresponding secondary antibodies (i.e., anti-rabbit or mouse) for 15 min at RT.\nWash the slides 3 times (for 5 min each) with DPBS. Perform DAB detection under a microscope.",
    "Wash the slides with DPBS 3 times (2 min each). Counterstain the cell nuclei by immersing the slides in hematoxylin for 1-2 min. Dehydrate with a graded ethanol series (25, 50, 75, 90, 95, 100, and 100%; 3 min each) followed by three consecutive steps of clarification with xylene. Finally, mount the slides and visualize them under the microscope.\nDetect sGAG content.\nDigest chondrogenic pellets in papain solution at 60 °C for 2 h.\nDetermine the DNA content using the dsDNA assay kit and fluorometer system. Measure the sGAG content by mixing it with DMMB dye solution under measuring absorbance at 525 nm8.\nCalculate the concentration of sGAG against a standard curve of shark chondroitin sulfate.\nPerform the real-time PCR analysis of the chondrogenic differentiation markers in hiPSC-Chon pellets.\nHarvest 3-4 of the same chondrogenic pellets by adding 500 µL of ice-cold extraction reagent to one tube. Vortex thoroughly. Incubate the sample for 5 min at RT.\nAdd 0.1 mL of chloroform. Vortex the sample for 15 s and incubate it at RT for 3 min. Centrifuge the sample for 15 min at 12,000 x g and 4 °C. Transfer the upper aqueous phase (about 250 µL) into a new 1.5 mL microcentrifuge tube.\nAdd 25 µL of sodium acetate and 1 µL of glycogen to the sample. Precipitate the RNA by mixing it with 250 µL of isopropyl alcohol. Mix thoroughly. Incubate the sample at RT for 10 min.\nCentrifuge for 10 min at 12,000 x g and 4 °C. Remove the supernatant completely. Wash the RNA pellet twice with 500 µL of 75% ethanol.\nCentrifuge for 5 min at 7,500 x g and 4 °C. Remove all leftover ethanol and air-dry the RNA pellet for 5-10 min. Dissolve the RNA in 10 µL of nuclease-free water.",
    "Convert the RNA into cDNA using a reverse transcriptase system. Subject the cDNA samples to real-time PCR using qPCR kit master mix (2x) and a real-time PCR system9.\n\t\tNOTE: The primer sequences are:\n\t\thAGGRECAN-F:TCGAGGACAGCGAGGCC;\n\t\thAGGRECAN-R: TCGAGGGTGTAGCGTGTAGAGA;\n\t\thβ-ACTIN-F: TTTGAATGATGAGCCTTCGTCCCC;\n\t\thβ-ACTIN-R: GGTCTCAAGTCAGTGTACAGGTAAGC;\n\t\thCOL2-F:TGGACGATCAGGCGAAACC;\n\t\thCOL2-R:GCTGCGGATGCTCTCAATCT;\n\t\thSOX9-F:AGCGAACGCACATCAAGAC;\n\t\thSOX9-R:CTGTAGGCGATCTGTTGGGG;\n\t\thCOL10-F: ATGCTGCCACAAATACCCTTT;\n\t\thCOL10-R: GGTAGTGGGCCTTTTATGCCT.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}