{
  "id": 2520,
  "origin_website": "Cell",
  "title": "Assembly of plant virus agroinfectious clones using biological material or DNA synthesis",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nProcedures of this protocol are applied to a scenario in which the researcher has access to biological samples as starting materials, as well as to an alternative one in which only a digital sequence of the virus genome is available (e.g., ancient or environmental samples, impossibility to obtain a physical sample from other researchers or countries, etc.).\nStart from step 1 if a sample is available, or step 6 if the virus clone will be assembled using the SynViP synthetic genomics framework. The mini binary vector pLX-AS is used in both approaches (Figure 1[href=https://www.wicell.org#fig1]). Steps common for the two above-mentioned scenarios are then described, which include full-length virus clone recovery from E. coli (steps 9–15), clone transformation into Agrobacterium cells and delivery to plant by agroinfection (steps 16–22), infectivity evaluation (steps 23 and 24), and, finally, complete sequencing of the assembled infectious clones and long-term storage (steps 25 and 26).\nHomology-based clone assembly using biological material\nTiming: 3–5 days\nThis section describes the use of homology-based assembly to generate a full-length clone of wasabi mottle virus (WMoV), a plant RNA virus of the family Virgaviridae (Figure 2[href=https://www.wicell.org#fig2]). Genomic sequences and plant samples infected with WMoV were available. For additional details on the WMoV infectious clone assembly using biological material, please refer to Pasin et al. (2018)[href=https://www.wicell.org#bib55].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2027-Fig2.jpg\nFigure 2. Homology-based clone assembly using biological material\n(A) PCR primers for pLX-AS linearization are designed to allow functional linkage of the vector CaMV 35S promoter and nos terminator (green) with viral sequences.\n(B) The RNA genomic sequence of wasabi mottle virus (WMoV) is retrieved and cDNA synthesis primers are designed (i), a ribozyme sequence is appended (diamond; ii), and RT-PCR products are designed to have terminal homology to each other and with the PCR-linearized pLX-AS.",
    "(C) Amplicons are assembled in vitro by homology-based cloning; cloning primers are depicted and fragment sizes are indicated.\nCritical: This procedure has been optimized for pLX-AS; use of alternative binary vectors is not recommended.\nNote: NEBuilder® HiFi DNA assembly is used in this protocol for homology-based cloning. Gibson assembly can also be used (Gibson et al., 2009[href=https://www.wicell.org#bib24]); the required enzymatic mix can be in-house prepared as detailed (Zhao et al., 2020[href=https://www.wicell.org#bib84]), or purchased from commercial providers (e.g., Gibson Assembly® Master Mix, cat. no. E2611S, New England Biolabs). If Gibson assembly is used, no protocol changes are required and steps 1–5 should be followed as detailed herein.\nNote: pLX-B2-TagRFP-T (GenBank: KY825142) was originally used for WMoV cloning (Pasin et al., 2018[href=https://www.wicell.org#bib55]). pLX-AS is used herein since it includes the E. coli LacZα reporter for white-blue screen of recombinant clones (Figure 1[href=https://www.wicell.org#fig1]).\nPrimer and cloning design (Figure 2[href=https://www.wicell.org#fig2]).\nRetrieve the WMoV genomic sequence from NCBI (GenBank: AB017504, Wasabi mottle virus genomic RNA, complete genome, isolate: Tochigi).\nImport the sequence into a bioinformatics software suitable for nucleic acid sequence editing and cloning design.\nNote: Multiple bioinformatics tools for in silico cloning design are available (Baek et al., 2014[href=https://www.wicell.org#bib3]).\nPrimer design for cDNA synthesis (Figure 2[href=https://www.wicell.org#fig2]B).\nGenerate a WMoV genomic consensus by using GenBank: AB017504 as a query in a nucleotide BLAST (blastn) search against the NCBI GenBank database (https://blast.ncbi.nlm.nih.gov/Blast.cgi[href=https://blast.ncbi.nlm.nih.gov/Blast.cgi], accessed August 2022), and running a multiple sequence alignment with the identified genomic sequences (i.e., AB017503, KJ207375, MK431779).\nCritical: Ensure that ∼30 nt of AB017504 genomic termini are conserved and can be used for primer design.\nDesign the primer W3_R hybridizing to the very 3′ end of AB017504 (6268–6297 nt).\nDesign the primers W1_R and W2_R hybridizing to conserved genomic regions at internal positions (1740–1759 nt, 3927–3950 nt, respectively).",
    "Note: The virus-specific primers are designed to enhance efficiency of viral cDNA synthesis.\nIn silico assembly of the WMoV clone in a T-DNA binary vector.\nIn a bioinformatics software, append to the 3′ end of AB017504 the 46-nt ribozyme sequence from tobacco ringspot virus satellite RNA (GenBank: M14879): GTCACCGGATGTGCTTTCCGGTCTGATGAGTCCGTGAGGACGAAAC.\nNote: Ribozyme is included to remove non-viral nucleotides from the WMoV 3′ end after in planta transcription.\nAppend downstream the ribozyme sequence the 3-nt reverse complement of the WMoV 3′ terminus: TGG.\nNote: The sequence is included to promote ribozyme folding and processing.\nRetrieve the sequence of the binary vector pLX-AS from NCBI (GenBank: MW281334, Cloning vector pLX-AS, complete sequence).\nImport the pLX-AS sequence into a bioinformatics software suitable for in silico cloning, and replace the cloning cassette at positions 1204–1565 with the sequence designed in the step d.ii.\nCloning primer design (Figure 2[href=https://www.wicell.org#fig2]C).\nFor vector linearization, design the primer pair W8_R and W9_F, hybridizing to the cauliflower mosaic virus (CaMV) 35S promoter and nopaline synthase (nos) terminator of pLX-AS, respectively.\nNote: The predicted amplicon size is 4199 bp.\nDesign a first primer pair W4_F and W5_R for RT-PCR amplification of the WMoV genomic 5′ half.\nNote: The predicted amplicon size is 3182 bp and includes a 25-bp overlap with the linearized pLX-AS.\nDesign a second primer pair W6_F and W7_R for RT-PCR amplification of the WMoV genomic 3′ half.\nNote: The predicted amplicon size is 3200 bp and includes a 27-bp overlap with the product of the previous step, and 21-bp overlap with the linearized pLX-AS.\nNote: The ribozyme sequence is included in the cloning primers W7_R and W9_F, and reconstituted by correct clone assembly.",
    "Critical: The WMoV genome is ∼6 kb and can be amplified by a single RT-PCR. It is however preferred to amplify it in two ∼3-kb fragments (i) to limit DNA damage introduced during temperature cycling and increase amplification fidelity (Potapov and Ong, 2017[href=https://www.wicell.org#bib60]), and (ii) to avoid amplification of defective viral molecules with correct termini but an incomplete genomic sequence.\nVerify that the cloning design is correct by in silico simulation of a homology-based assembly reaction including the linearized pLX-AS and the RT-PCR fragments.\nNote: Assembly can be simulated online using NEBuilder® assembly tool (https://nebuilder.neb.com[href=https://nebuilder.neb.com], accessed August 2022).\nNote: Correct assembly will result in a sequence equivalent to pLX-WMoV (GenBank: MH200603) with WMoV genomic variation specific to the Taiwanese isolate used as the starting material (6213/6297 identities to AB017504).\nViral cDNA fragment preparation.\nCollect material samples from a virus-infected plant, and grind them in liquid nitrogen in a pre-chilled mortal to a fine powder.\nCritical: In sample collection consider that some viruses may cause no clear infection symptoms, and be limited to specific plant organs or tissues.\nCritical: Handle liquid nitrogen in well-ventilated areas using protective clothing.\nPause point: Plant material powder can be stored for weeks at −80°C.\nProceed with total RNA purification from ∼100 mg of plant material powder using FavorPrep™ plant total RNA mini kit (FAVORGEN) per manufacturer’s instructions, except that\nafter washing, centrifuge columns to remove the residual liquid and then dry them by incubating at 60°C (5 min) with the tube cap open, and\nuse autoclaved ultrapure water preheated at 60°C for the final elution.\nCritical: Avoid contaminating nucleases that may compromise RNA integrity and yield of the subsequent cDNA synthesis reaction.\nNote: Other commercial plant RNA purification kits can also be used.\nPause point: RNA samples can be stored for weeks at −80°C.",
    "Determine RNA yield and purity using a spectrophotometer (e.g., NanoDrop™, Thermo Fisher Scientific).\nSynthesis of viral genome cDNA.\nPrepare the cDNA synthesis mix.\ntable:files/protocols_protocol_2027_8.csv\naSupplied with the SuperScript™ III RT enzyme.\nNote: Other commercial cDNA synthesis enzymes can also be used.\nNote: A mix of random hexamers and the virus-specific primers are used to enhance recovery of the complete genomic cDNA.\nSequentially incubate the mix at 25°C (20 min), 55°C (2 h), 70°C (15 min), and on ice (2 min).\nDilute the cDNA synthesis reaction by adding 50 μL of autoclaved ultrapure water.\nPause point: Reactions can be stored for several days at −20°C.\nRT-PCR amplification of viral cDNA fragments.\nPrepare the RT-PCR mixes to amplify the two WMoV genomic halves.\ntable:files/protocols_protocol_2027_9.csv\nCritical: Q5® high-fidelity DNA polymerase has an error rate ∼280-fold lower than that of Taq DNA polymerase. Alternative PCR enzymes may work, but their use may affect efforts required to recover error-free clones and total costs.\nNote: Use the primer pair W4_F/W5_R for WMoV genomic 5′ half.\nNote: Use the primer pair W6_F/W7_R for WMoV genomic 3′ half.\nIncubate the mixes according to the RT-PCR cycling conditions.\ntable:files/protocols_protocol_2027_10.csv\nNote: A temperature ramp is included to increase primer annealing specificity and secondary structure melting; alternative cycling conditions may work.\nPause point: Reactions can be stored for several days at −20°C.\npLX vector backbone preparation.\nLinearize the binary vector pLX-AS (Addgene cat. no. 188870[href=https://www.addgene.org/188870/]).\nPrepare the inverse PCR reaction mix.\ntable:files/protocols_protocol_2027_11.csv\nCritical: Q5® high-fidelity DNA polymerase has an error rate ∼280-fold lower than that of Taq DNA polymerase. Alternative PCR enzymes may work, but their use may affect efforts required to recover error-free clones and total costs.\nIncubate the PCR mix tube according to the inverse PCR cycling conditions.\ntable:files/protocols_protocol_2027_12.csv",
    "Note: A temperature ramp is included to increase primer annealing specificity and secondary structure melting; alternative cycling conditions may work.\nRemove the template plasmid of the PCR reaction.\nPrepared a DpnI digestion mix.\ntable:files/protocols_protocol_2027_13.csv\naSupplied with the enzyme.\nIncubate at 37°C (1 h), and on ice (2 min).\nCritical: DpnI cleaves only when its recognition site is methylated and specifically targets template plasmids purified from an E. coli dam+ strain but not PCR products, which significantly reduces the number of vector-only background colonies after of E. coli transformation (step 9).\nPause point: Reaction can be stored for several days at −20°C.\nGel purification of DNA fragments.\nPrepare agarose gel in 0.5× TBE buffer, and run electrophoresis of reactions from steps 2 and 3.\nNote: Agarose D1 medium EEO is used for gel preparation; 0.5% agarose gels provide good electrophoresis resolution of the fragments generated in this protocol and facilitate DNA purification from gel bands.\nCut bands on a blue light transilluminator using single-use disposable scalpels.\nAlternatives: If a blue light transilluminator is not available a UV light transilluminator can used but ensure to avoid prolonged exposure to UV light as it damages DNA samples and dramatically reduces assembly efficiency. If UV light transilluminator is used, wear suitable protection personal protective equipment to avoid UV associated hazards.\nAlternatives: Gel cutting tips and other scalpel surrogates can be used.\nPause point: Gel bands can be stored for several days at −20°C.\nPurify DNA from gel bands using FavorPrep™ MicroElute GEL/PCR purification kit (FAVORGEN). Follow kit manufacturer’s instructions, except that\nwash columns twice with Wash Buffer,\nafter washing, centrifuge columns to remove the residual liquid and then dry them by incubating at 60°C (5 min) with the tube cap open, and\nuse autoclaved ultrapure water preheated at 60°C for the final elution.",
    "Note: Other commercial gel purification kits can also be used.\nCheck 1 μL of the purified DNA fragments by agarose gel electrophoresis alongside DNA standards and estimate DNA fragment concentration.\nNote: Spectrophotometer quantification may also be used.\nPause point: Gel-purified DNA can be stored for several days at −20°C.\nIn vitro homology-based assembly.\nPrepare a reaction mix including equimolar amounts of the gel-purified (RT-)PCR fragments from step 4 and NEBuilder® HiFi DNA assembly master mix according to manufacturer’s instructions, except that a final reaction volume of 3–5 μL is used.\nNote: The manufacturer's recommended total DNA amount is 0.2–0.5 pmol in a 20 μL reaction volume; scale-down the DNA amount according to the volume used.\nNote: The NEBiocalculator® tool (https://nebiocalculator.neb.com[href=https://nebiocalculator.neb.com], accessed August 2022) can be used for molarity calculations.\nNote: If concentration of the gel-purified DNA fragments is below the recommended by the manufacturer, pool in a PCR tube equimolar amounts of all fragments needed for the assembly reaction in a final volume of 10–20 μL. To concentrate the sample, incubate the tube with the cap open at 65°C until ∼2 μL are left (30–60 min; avoid tube drying). Take the tube to ice, add an identical volume (∼2 μL) of NEBuilder® HiFi DNA assembly master mix, mix by pipetting and proceed with the next step.\nIncubate the mix at 50°C (1 h). At the reaction end, place tubes on ice and proceed with step 9.\nNote: To save time, start preparing materials and equipment required for step 9 (Transformation of E. coli cells) before the reaction end.\nSynViP clone assembly using chemically synthesized DNA fragments\nTiming: 2–3 days (plus DNA synthesis time)",
    "This section describes the use of the SynViP synthetic genomics framework to generate a full-length clone of turnip rosette virus (TuRV), a plant RNA virus of the family Solemoviridae (Figure 3[href=https://www.wicell.org#fig3]). A revised, high-confidence sequence of the TuRV genome was reported (Ling et al., 2013[href=https://www.wicell.org#bib44]; Sõmera and Truve, 2013[href=https://www.wicell.org#bib71]). For additional details on the TuRV infectious clone assembly using SynViP and chemically synthesized DNA fragments, please refer to Pasin (2021)[href=https://www.wicell.org#bib53].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2027-Fig3.jpg\nFigure 3. SynViP clone assembly using chemically synthesized DNA fragments\n(A) The RNA genomic sequence of turnip rosette virus (TuRV) is retrieved and ribozyme sequence is appended (diamond; i); linkers (green) are added to allow directional cloning in AarI-digested pLX-AS and functional linkage of vector CaMV 35S promoter and nos terminator with viral sequences (ii); the obtained sequence is split in fragments with size < 1.8 kb and internal linkers for seamless cloning are added (iii); finally, each fragment is flanked with convergent AarI recognition sites (iv). Numbers indicate TuRV genomic fragments.\n(B) The designed DNA fragments are chemically synthesized and assembled by a digestion-ligation reaction including pLX-AS, AarI and T4 DNA ligase; red triangles indicate AarI recognition sites.\nCritical: pLX-AS, the T-DNA binary vector used in SynViP, is compatible with digestion-ligation using AarI, its isoschizomer PaqCI® (cat. no. R0745S, New England Biolabs), or SapI (cat. no. R0569S, New England Biolabs) (Figure 1[href=https://www.wicell.org#fig1]).\nNote: Correct assemblies using up to 24 and 13 fragments have been reported by digestion-ligation with PaqCI® (AarI) and SapI, respectively (New England Biolabs, 2021a[href=https://www.wicell.org#bib50], 2021b[href=https://www.wicell.org#bib51]).\nNote: SynViP design and assembly using AarI is detailed herein; use of SapI is present for illustrative purposes in Method S3[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2027-Mmc1.pdf].\nSynthetic DNA fragment design for seamless cloning (Figure 3[href=https://www.wicell.org#fig3]A).\nRetrieve the TuRV genomic sequence from NCBI (GenBank: KC778720, Turnip rosette virus isolate TRoV-1, complete genome).",
    "Import the sequence into a bioinformatics software suitable for nucleic acid sequence editing and cloning design.\nNote: Multiple bioinformatics tools for in silico cloning design are available (Baek et al., 2014[href=https://www.wicell.org#bib3]).\nAppend to the TuRV genome 3′ end the 46-nt ribozyme sequence from tobacco ringspot virus satellite RNA (GenBank: M14879): GTCACCGGATGTGCTTTCCGGTCTGATGAGTCCGTGAGGACGAAAC.\nNote: Ribozyme is included to remove non-viral nucleotides from the TuRV 3′ end after in planta transcription.\nDownstream the ribozyme sequence, append the 9-nt reverse complement of the TuRV 3′ terminus: CAAAGACAG.\nNote: The sequence is included to promote ribozyme folding and processing.\nInspect the obtained sequence for the presence of AarI and SapI sites. Consider the enzyme with no site or the lowest abundance for subsequent steps.\nNote: AarI recognition site is CACCTGC(4/8).\nNote: SapI recognition site is GCTCTTC(1/4).\nNote: AarI and SapI are not palindromic; forward and reverse complement sequences should be inspected.\nNote: If AarI and SapI show the same abundance, AarI is preferred given its higher efficiency in multiple fragment assembly.\nFragment design for AarI seamless cloning (Figure 3[href=https://www.wicell.org#fig3]A).\nCritical: Use AarI since no recognition sites are present in the TuRV genomic sequence.\nAppend the sequence GAGG to the 5′ terminus, and CCCA to the 3′ terminus of the sequence from step 6.d.\nNote: The appended sequences will allow assembly in AarI-digested pLX-AS and in planta generation of the correct TuRV 5′ end from the CaMV 35S promoter (Figure 1[href=https://www.wicell.org#fig1]).\nSplit the obtained sequence in fragments with a size < 1.8 kb (i.e., compatible with low-cost chemical DNA synthesis). To the 5′ end of each fragment, append 4 bp of the 3′ end of the preceding fragment (internal cloning linker).\nNote: In SynViP assembly of TuRV, three fragments ranging from 1.2 to 1.6 kb are designed.",
    "Note: To ensure efficient SynViP assembly, sequences of internal cloning linkers must be non-palindromic and have ≤ 50% identity to each other, and to GAGG and CCCA.\nFlank each of the obtained fragments with convergent AarI sites by appending the sequence TTCACCTGCTTAT to 5′ termini, and ATTTGCAGGTGTT to 3′ termini.\nRetrieve the sequence of the T-DNA binary vector pLX-AS from NCBI (GenBank: MW281334, Cloning vector pLX-AS, complete sequence).\nVerify that the cloning design is correct by in silico simulation of an AarI-based digestion-ligation including the designed fragments and pLX-AS.\nNote: Assembly can be simulated online using NEBridge™ Golden Gate assembly tool (https://goldengate.neb.com[href=https://goldengate.neb.com], accessed August 2022).\nNote: Correct assembly will result in a sequence identical to pLX-TuRV (GenBank: MW281335).\nPurchase and preparation of synthetic DNA fragments.\nPurchase Gene Fragments with adapters with sequences designed in step 6 from Twist Bioscience (U.S.A., https://www.twistbioscience.com[href=https://www.twistbioscience.com], accessed August 2022).\nCritical: Twist Bioscience provides synthetic gene fragments at an industry leading price and error rate. Alternative products may work (e.g., gBlocks™ Gene Fragments, Integrated DNA Technologies; GeneArt™ Strings DNA Fragments, Thermo Fisher Scientific; etc.), but their use may affect efforts required to recover error-free clones and total costs.\nCritical: Ensure to purchase linear, uncloned DNA fragments; if cloned inserts are preferred, ensure to have them in vectors with ampicillin resistance to avoid interference with the SynViP assembly.\nResuspend in the lyophilized synthetic DNA fragments according to manufacturer’s instructions in autoclaved ultrapure water preheated at 60°C.\nCheck 1 μL of each DNA fragments by agarose gel electrophoresis alongside DNA standards and estimate DNA fragment concentration.",
    "Critical: Supplied amount of synthetic DNA fragments is sufficient for a SynViP assembly reaction. Twist Gene Fragments are flanked by synthesis adapters with standard sequences, which can be used to design a primer pair for their PCR amplification if a larger amount is need.\nNote: Spectrophotometer quantification may also be used.\nPause point: DNA fragments can be stored for several days at −20°C.\nOne-step SynViP assembly by AarI digestion-ligation (Figure 3[href=https://www.wicell.org#fig3]B).\nPrepare the AarI digestion-ligation mix including pLX-AS (Addgene cat. no. 188870[href=https://www.addgene.org/188870/]) and synthetic DNA fragments.\ntable:files/protocols_protocol_2027_14.csv\na∼70 fmol pLX-AS is equivalent to 100 ng.\nbSupplied with the enzyme.\nNote: The NEBiocalculator® tool (https://nebiocalculator.neb.com[href=https://nebiocalculator.neb.com], accessed August 2022) can be used for molarity calculations.\nAlternatives: AarI can be replaced with its isoschizomer PaqCI® (cat. no. R0745S, New England Biolabs).\nAlternatives: A master mix for AarI digestion-ligation is commercially sold as GeneArt™ Type IIs Assembly Kit Aar I (cat. no. A15916, Thermo Fisher Scientific).\nIncubate the mix according to digestion-ligation conditions.\ntable:files/protocols_protocol_2027_15.csv\nNote: Digestion-ligation conditions are based on those reported by van Dolleweerd et al. (2018)[href=https://www.wicell.org#bib77]; alternative cycling conditions may work.\nAssembly reaction transformation and clone selection in Escherichia coli\nTiming: 3–5 days\nIn this section, in vitro assembly reactions from steps 5 or 8 are transformed into chemically-competent E. coli cells for high-efficiency transformation. Selected E. coli cells harboring the binary vectors with full-length virus genome copies are identified by white-blue selection and colony PCR, and verified by restriction enzyme digestion.\nTransformation of E. coli cells.\nThaw on ice aliquots of competent E. coli TOP10 cells (see Method S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2027-Mmc1.pdf]).\nNote: Before starting ensure to have all the required materials and equipment at hand (a water bath at 42°C, LB agar plates with the appropriate antibiotics, etc.).",
    "Alternatives: A block heater with holds for 1.5–2.0 mL tubes can be used; add to each hold 1 mL of water to promote uniform and rapid heat transfer to the cell tubes.\nMix a 100-μL cell aliquot with 2.5 μL of the assembly reactions from steps 5 or 8.\nNote: Prechill assembly reactions on ice prior to transformation.\nSequentially incubate the mix on ice (30 min), at 42°C (1 min 10 s), and on ice (5 min).\nAdd 0.7 mL SOC and incubate at 30°C, shaking at 250 r.p.m. (1.5 h).\nHarvest bacteria by centrifugation at 3000 × g (10 min) and resuspend in 50 μL of SOC.\nPlate the bacterial suspension onto LB agar plates supplemented with 50 mg/L kanamycin and 40 μL of X-Gal (40 mg/mL stock), and incubate at 30°C (20–48 h).\nCritical: Plate the X-Gal solution on agar plates before use for white-blue screen of recombinant clones.\nNote: Addition of isopropyl β-d-1-thiogalactopyranoside (IPTG), a common reagent for white-blue screens, is not required for this protocol.\nCritical: Reduce E. coli culturing temperatures from 37°C to 30°C to improve recovery and propagation of full-length virus clones.\nCritical: Bacterial cells harboring binary vectors with full-length virus clones generally display low growth rates; extend plate incubation time as needed.\nPause point: After colony appearance, plates can be stored for 1–3 days at 4°C.\nIdentification of recombinant binary vectors in E. coli transformants by colony PCR.\nPrepare 2 mL tubes with 0.3 mL of liquid LB supplemented with 50 mg/L kanamycin.\nPrepare a PCR master mix including virus-specific primers.\ntable:files/protocols_protocol_2027_16.csv\nNote: Use the primer pair W83_F/W2_R for pLX-WMoV clone identification; the 935-bp amplicon spans the assembly junction of the two viral RT-PCR inserts.",
    "Note: Use the primer pair W154_F/W155_R for pLX-TuRV clone identification; the 538-bp amplicon spans the assembly junction of the two synthetic DNA fragments.\nAlternatives: Other commercial PCR reagents can also be used; master mixes including dyes for direct gel loading are recommended to streamline the analysis.\nDispense 10-μL mix aliquots into sterile PCR tubes.\nScreen white colonies selected in step 9.f.\nPick an individual colony from the plate with a sterile P10 micropipette tip.\nSoak the tip in the PCR mix tube for 5–30 s.\nDirectly place the tip in a 2 mL tube with LB.\nCritical: Avoid blue colonies.\nCritical: Pick small colonies if a mixture of small and large colonies appears during agar plate selection of transformed bacteria.\nNote: It is recommended to screen 4–10 colonies per construct.\nIncubate the PCR mix tubes according to the colony PCR cycling conditions.\ntable:files/protocols_protocol_2027_17.csv\nCritical: An extended initial denaturation step is used to ensure bacterial lysis.\nNote: Alternative cycling conditions may work.\nIncubate the LB tubes at 30°C, shaking at 250 r.p.m. until PCR results are available.\nResolve 5 μL of PCR reactions by agarose gel electrophoresis.\nCulturing of positive transformants identified by colony PCR.\nUse LB cultures from step 10.f to individually inoculate 10 mL liquid LB with 50 mg/L kanamycin in 50 mL tubes.\nIncubate the tubes at 30°C, shaking at 250 r.p.m. (14–24 h).\nNote: Extended culturing time may be necessary.\nNote: It is recommended to purify plasmid DNA samples from 2–4 colonies per construct.\nGlycerol stock preparation of E. coli transformants.\nAliquot 650 μL of the culture from the previous step to 2-mL screw cap tubes containing ∼200 μL of autoclaved 85% glycerol.\nNote: The final glycerol amount is ∼20%.\nMix by pipetting, freeze the tubes in liquid nitrogen, and store at −80°C indefinitely.",
    "Critical: Tightly close caps to prevent that liquid nitrogen leaks inside the tubes, which can lead to tube explosion while thawing due to nitrogen expansion.\nHarvest bacteria from the culture remainder by centrifugation at 3000 × g (10 min); discard the supernatant, centrifuge again for 30 s and remove medium residues by pipetting.\nNote: Harvested bacterial pellets can be frozen and stored at −80°C for weeks before to proceed with the next step.\nPurify plasmid DNA from the harvested bacterial pellets using Wizard® Plus SV minipreps DNA purification system (Promega). Follow kit manufacturer’s instructions, except that\nUse double volumes of resuspension, lysis and neutralization solutions supplied within the kit to improve clearing of bacterial lysates.\nNote: After addition of the lysis solution incubate until the cell suspension clears (up to 10 min).\nNote: Resuspension (50 mM Tris-HCl pH 7.5, 10 mM EDTA, 100 μg/mL RNase A), lysis (0.2 M sodium hydroxide, 1% sodium dodecyl sulfate), and neutralization (4.09 M guanidine hydrochloride, 0.759 M potassium acetate, 2.12 M glacial acetic acid) solutions can be prepared in house in case of run out of those supplied within the kit.\nTransfer ∼800 μL of the cleared lysate to the column, centrifuge, discard the flowthrough and load again the same column with the remainder of the lysate.\nNote: The volume of the cleared bacterial lysate will exceed the spin column capacity.\nUse autoclaved ultrapure water preheated at 60°C for the final elution.\nNote: Other commercial plasmid DNA purification kits can also be used.\nPause point: Purified plasmids can be stored at −20°C indefinitely.\nIdentification of full-length virus clones by restriction enzyme digestion of plasmids.\nPrepare a digestion mix including enzymes and individual plasmid samples.\ntable:files/protocols_protocol_2027_18.csv\naSupplied with the enzymes.",
    "Note: The sequence of clones obtained from biological materials can differ from the theoretical one. Digest plasmids with at least two restriction enzymes to enhance the confidence of digestion results.\nNote: Simultaneously use FastDigest BamHI, EcoRI, SalI, and SmaI for pLX-WMoV verification.\nNote: Simultaneously use FastDigest EcoRI and Eco32I (EcoRV) for pLX-TuRV verification.\nIncubate reactions at 37°C (30 min).\nResolve reactions by agarose gel electrophoresis.\nPause point: Plasmid DNA samples with the correct digestion profiles can be stored at −20°C indefinitely.\nAgrobacterium-mediated inoculation\nTiming: 4–7 days\nIn this section, binary vectors with the correct digestion profiles (or the expected virus genome size) are transformed into Agrobacterium. Selected bacterial cells harboring the binary vectors are then cultured and prepared for agroinfection, and used to inoculate A. thaliana plants.\nCritical: Ensure to coordinate preparation of host plants and Agrobacterium strains hosting the virus clones.\nTransformation of Agrobacterium cells.\nThaw on ice aliquots of competent Agrobacterium AGL1 cells (see Method S2[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2027-Mmc1.pdf]).\nCritical: Before starting ensure to have all the required materials and equipment at hand (liquid nitrogen, a water bath at 37°C, LB agar plates with the appropriate antibiotics, etc.).\nAlternatives: A block heater with holds for 1.5–2.0 mL tubes can be used; add to each hold 1 mL of water to promote uniform and rapid heat transfer to the cell tubes.\nMix a 50-μL cell aliquot with ∼0.5 μg of plasmid DNA.\nNote: For each construct, use 2–4 plasmid samples obtained from individual E. coli colonies.\nSequentially incubate the mix on ice (5 min), in liquid nitrogen (5 min), at 37°C (5 min), and on ice (5 min).\nCritical: Handle liquid nitrogen in well-ventilated areas using protective clothing.\nAdd 0.7 mL of SOC and incubate at 28°C, shaking at 250 r.p.m. (2–4 h).",
    "Harvest bacteria by centrifugation at 3000 × g (10 min) and resuspend in 50 μL of SOC.\nPlate the bacterial suspension onto LB agar plates supplemented with 50 mg/L kanamycin and 50 mg/L rifampicin, and incubate at 28°C (48–72 h).\nNote: Bacterial cells harboring binary vectors with full-length virus clones generally display low growth rates; extended plate incubation time may be necessary.\nPause point: After colony appearance, plates can be stored for 1–3 days at 4°C.\n(Optional) Confirm the presence of the desired binary vectors in Agrobacterium transformants by colony PCR as detailed in step 10, except that LB is supplemented with 50 mg/L kanamycin and 50 mg/L rifampicin, and LB tubes are incubated at 28°C.\nPick individual colonies harboring the corresponding binary vectors and use them to inoculate 1 mL of liquid LB with 50 mg/L kanamycin and 50 mg/L rifampicin in 10 mL tubes; incubate tubes at 28°C, shaking at 250 r.p.m. (24–48 h).\nCritical: Pick small colonies if a mixture of small and large colonies appears during agar plate selection of bacteria.\nNote: If Agrobacterium transformants were screened by colony PCR use LB tubes of positive colonies from the previous step as the inoculum source.\nPrepare 20% glycerol stocks of Agrobacterium transformants as detailed in step 12.\nUse 0.1-mL culture aliquots from step 18 to inoculate 5 mL of liquid LB with 50 mg/L kanamycin and 50 mg/L rifampicin in 50 mL tubes. Incubate tubes at 28°C, shaking at 250 r.p.m. (12–18 h).\nPreparation of bacterial suspensions for agroinfection.\nHarvest bacteria by centrifugation at 3000 × g (10 min).\nDiscard the supernatant, centrifuge again for 30 s and remove medium residues by pipetting.\nResuspend the cell pellet in 2 mL of Induction Buffer (see media and solutions[href=https://www.wicell.org#sec2.2]).",
    "Incubate at room temperature in the dark (3 h) for induction of bacterial genes required for T-DNA delivery to plant cells.\nPlant agroinfection.\nOrganize, label and water A. thaliana plants.\nCritical: Include untreated or mock-treated plants as infection controls.\nMeasure in a spectrophotometer the optical density at 600 nm (OD600) of the bacterial suspensions, and adjust OD600 to 2 with Induction Buffer.\nDip the tips of dissecting forceps into the bacterial suspensions and then pierce young leaves of soil-grown A. thaliana plants.\nNote: Flame sterilize forceps between suspensions of different bacterial clones.\nTo avoid fast drying of bacterial suspension on the inoculated leaves, cover pot trays with transparent plastic lids overnight (∼14 h).\nNote: To avoid cross-contaminations, ensure that plants infected with different constructs do not touch each other and do not share the same watering tray.\nPlant infection phenotyping and virus detection\nTiming: 2–8 weeks\nIn this section, plants agroinoculated with full-length virus clones are monitored for appearance of infection symptoms. Biochemical assays are used to confirm virus accumulation.\nDaily inspect agroinoculated plants and record appearance of infection symptoms.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2027-Fig4.jpg\nFigure 4. Plant agroinfection and virus recovery\n(A) pLX-TuRV and pLX-WMoV were transformed into Agrobacterium and delivered to Arabidopsis thaliana by agroinfection, and images were taken 3–4 weeks post inoculation; mock condition is shown as a control.\n(B) Transmission electron micrograph of virions purified from A. thaliana plants agroinoculated with pLX-TuRV; scale bar, 50 nm.\n(C) Necrotic lesions in Nicotiana benthamiana leaves treated with crude extract of A. thaliana plants agroinoculated with pLX-WMoV; mock condition is shown as a control.\nNote: A. thaliana plants inoculated with pLX-TuRV will display severe symptoms characterized by a drastically reduced shoot and inflorescence growth starting after ∼2 weeks (Figure 4[href=https://www.wicell.org#fig4]A).",
    "Note: Virus infection can be very mild or symptomless; A. thaliana plants inoculated with pLX-WMoV are almost indistinguishable from the mock control (Figure 4[href=https://www.wicell.org#fig4]A).\nDetection of viral nucleic acids in agroinoculated plants.\nCollect material samples from agroinoculated and control plants, and proceed with total RNA purification as detailed in steps 2.a–c.\nCritical: Agrobacteria are present in inoculated leaves, which host plasmid DNA of the assembled virus clones. Viral RNA molecules and proteins are generated in inoculated cells from T-DNA transcription and translation in absence of viral replication. To prevent false positives, only upper uninoculated plant samples should be analyzed and agrobacteria contamination avoided.\nPrepare a reaction mix to remove DNA contaminants from total RNA samples, and incubate it at 37°C (10 min), and on ice (2 min).\ntable:files/protocols_protocol_2027_19.csv\naSupplied with ezDNase.\ncDNA synthesis.\nPrepare a cDNA synthesis mix including virus- and actin-specific primers.\ntable:files/protocols_protocol_2027_20.csv\naSupplied with the SuperScript™ III RT enzyme.\nNote: The plant actin transcript is used as a template control.\nNote: Other commercial cDNA synthesis enzymes can also be used.\nSequentially incubate the mix at 55°C (1 h), 70°C (15 min), and on ice (2 min).\nDilute the cDNA synthesis reaction by adding 50 μL of autoclaved ultrapure water.\nPause point: Reactions can be stored for several days at −20°C.\nRT-PCR amplification.\nPrepare RT-PCR mixes for virus- or actin-specific amplification.\ntable:files/protocols_protocol_2027_21.csv\nCritical: Carefully run (RT-)PCR assays to prevent false positive results due to contaminations with plasmid DNA of the assembled cloned.\nNote: Use the primer pair W83_F/W2_R for WMoV detection.\nNote: Use the primer pair W154_F/W155_R for TuRV detection.\nNote: Use the primer pair Q9_F/Q10_R for the plant actin transcript detection.\nAlternatives: Other commercial PCR reagents can also be used; master mixes including dyes for direct gel loading are recommended to streamline the analysis.",
    "Incubate the mixes according to the RT-PCR cycling conditions.\ntable:files/protocols_protocol_2027_22.csv\nNote: A low number of total cycles is used to prevent contaminant amplification; alternative cycling conditions may work.\nResolve 5 μL of the reactions by agarose gel electrophoresis.\nNote: 935-bp and 538-bp amplicons are respectively detected in WMoV- and TuRV-infected samples; the 125-bp actin amplicon is detected in all plant samples.\nOptional: To complement phenotypic inspection and nucleic acid analyses of agroinoculated plants, additional assay can be used to detect virus proteins or particles (Figure 4[href=https://www.wicell.org#fig4]B). Recovery of infectious virus particles from inoculated plants can be confirmed by mechanical back-inoculation to a suitable host or by leaf lesion assays in indicator plants (Figure 4[href=https://www.wicell.org#fig4]C).\nVerification by high-throughput sequencing and long-term storage of infectious clones\nTiming: 3–6 days (plus plasmid shipping time)\nIn this section, complete sequence of plasmid DNA samples from step 14 and whose infectivity was confirmed (steps 23 and 24) is determined by high-throughput sequencing.\nSome protocols adopt laborious multi-step cloning approaches that involve fully sequencing of cloning intermediates and final assembly of virus clones with a consensus genomic sequence. Since (i) the infectivity of consensus sequences or the impact of individual mutations on virus infectivity are difficult to know a priori, (ii) agroinfection is easily scalable to simultaneously evaluate multiple clones in parallel, and (iii) agroinfection is usually very efficient and allows to confidently discard clones with deleterious mutations that preclude virus infectivity, I recommend first to test infectivity of assembled full-length clones (steps 23 and 24) and then to fully characterize those with confirmed infectivity, i.e., only those useful in downstream applications.\nFull-length sequencing of infectious clones.",
    "Place a service order for complete plasmid sequencing at MGH CCIB DNA core facility (U.S.A., https://dnacore.mgh.harvard.edu[href=https://dnacore.mgh.harvard.edu], accessed August 2022) and send a plasmid aliquot of identified infectious clones according to service provider’s instructions.\nCritical: Complete sequencing of the cloned viral genomic sequence is critical for clone verification and subsequent viral vector engineering.\nCritical: Compared to Sanger sequencing, high-throughput plasmid sequencing by Illumina and other platforms requires no reference sequences, no custom primers or data analysis pipelines, avoids time-consuming primer walking strategies, and requires limited DNA amount that facilitates verification of plasmids with low/medium copy origin (which are used herein to enhance stability of the assembled virus clones).\nAlternatives: Alternative facilities and companies commercially providing complete plasmid sequencing include seqWell™ (U.S.A., https://seqwell.com[href=https://seqwell.com], accessed August 2022), and Plasmidsaurus (U.S.A., https://www.plasmidsaurus.com[href=https://www.plasmidsaurus.com], accessed August 2022).\nNote: Sequencing technologies and commercial services suitable for complete plasmid sequencing are rapidly evolving (Shapland et al., 2015[href=https://www.wicell.org#bib67]; Emiliani et al., 2022[href=https://www.wicell.org#bib21]); it is recommended to periodically evaluate options available in the market.\nRecord the sequences experimentally obtained in in-house and public databases (e.g., NCBI GenBank).\nCritical: Most commercial services return assembled full-length plasmid sequences as well as assembly statistics, and no bioinformatics skills are needed. Inspect and record any variation of the cloned viral genomic sequence compared to those assembled by in silico cloning.\nSave for long-term storage and prepare backup copies of the E. coli glycerol stocks (step 12) and plasmid aliquots (step 14) of infectious clones."
  ],
  "subjectAreas": [
    "Genomics",
    "Plant Sciences",
    "Biotechnology And Bioengineering",
    "Microbiology",
    "Molecular Biology",
    "Sequencing"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Ecology & Environmental Biology"
  ]
}