{
  "id": 3580,
  "origin_website": "Cell",
  "title": "Optogenetic-mediated induction and monitoring of α-synuclein aggregation in cellular models of Parkinson’s disease",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nTransfection and illumination of mammalian cells overexpressing LIPA plasmids\nTiming: 2 days\nThis step will focus on explaining how to transfect HEK293T cells using the calcium phosphate technique in 35-mm dishes to reach more than 90% of the cells expressing the LIPA constructs. In the described protocol, we use homemade solutions, but it is also possible to order the CalPhos kit from Takara that performs as well. If transfecting other cell lines, you can alternatively use Lipofectamine 2000 or other lipofection-based methods following the manufacturer’s instructions (https://www.thermofisher.com/ca/en/home/references/protocols/cell-culture/transfection-protocol/lipofectamine-2000.html[href=http://www.thermofisher.com/ca/en/home/references/protocols/cell-culture/transfection-protocol/lipofectamine-2000.html] - :∼:text = Add the oligomer-Lipofectamine 2000, changed after 4–6 h) and the same plasmid concentration as described below. If focusing on neuronal cells, we are highly recommending using lentiviral particles with the phosphoglycerate kinase (PGK) promoter (supplemental protocol). In addition to PGK, alternative promoters capable of sustaining transgene expression in both iPSCs and neurons, such as enhancer/chicken β-actin (CAG) and human elongation factor-1α (EF-1α), could also be employed.3[href=https://www.wicell.org#bib3]\nOptional: Immortalized cell lines can be transduced using lentiviral particles obtained from the plasmid Cytomegalovirus (pCMV) blast harboring a puromycin resistance cassette allowing to create stable cell lines (supplemental protocol).\nPlate 0.6 × 105 cells/cm2 of HEK293T cells in a 35-mm plate in 1 mL of DMEM with 10% FBS, 1% Penicillin/Streptomycin (P/S) and incubate 16 h at 37°C and 5% CO2.\nCritical: The greatest transfection efficiency was observed when cell confluency reached 60%.\nAfter 16 h incubation, replace media with fresh DMEM with 10% FBS, 1% P/S 2 h prior to transfection.\nPrepare three individual transfection mixes (LIPA-α-syn, LIPA-α-synΔNAC and LIPA-empty) in 1.5-mL Eppendorf tubes by adding the following reagents in the defined order:\nAdd plasmid DNA to the tube (LIPA-α-syn: 1 μg or LIPA-α-synΔNAC: 1.6 μg or LIPA-empty: 0.8 μg).",
    "Note: In order to achieve uniform protein expression levels across the various LIPA constructs, we adjusted the quantity of DNA utilized for transfection of each plasmid and subsequently confirmed equal protein levels by Western blot, as we previously reported.1[href=https://www.wicell.org#bib1]\nAdd 25 μL of sterile ddH2O.\nAdd 25 μL of 0.5 M CaCl2 (materials and equipment[href=https://www.wicell.org#materials-and-equipment]) and mix well by pipetting.\nWhile vortexing, add 50 μL of 2× HeBS (materials and equipment[href=https://www.wicell.org#materials-and-equipment]) dropwise.\nCritical: Use a high-speed shaking vortex to ensure efficient DNA-calcium phosphate co-precipitation.\nLeave the precipitate from step 3 at 20°C–22°C for at least 10 min, and do not exceed an incubation time of 15 min.\nAdd the mix from step 4 dropwise to the cells (100 μL/dish). Mix by gently swirling the plate until the medium color goes back to a uniform red color.\nNote: The total volume of added mix should not exceed 10% of the total volume of the culture media in the well.\nIncubate the plate with the transfection mix for a minimum of 5 h or for a maximum of 16 h.\nCritical: For both optimal transfection efficacy and the maintenance of cell health, it is advisable to incubate cells with the transfection mix for a duration ranging from 5 h to 6 h. However, it is crucial to emphasize that while incubation for up to 16 h is permissible, any incubation period exceeding this limit is not recommended, as prolonged exposure to the transfection mix may potentially result in cell damage.\nFollowing an incubation time of 5 h, aspirate the medium, and slowly add fresh medium to the plate.\nTwenty-four hours post-transfection, 95% of the cells are expected to express the LIPA constructs and are ready for the light stimulation.",
    "Illuminate the cells under a blue light (469 nm) at 0.8 mW/mm2 for (0, 6, 12 and 24 h).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3149-Fig1.jpg\nFigure 1. Set-up of blue light stimulation placed below the cell culture plate in the incubator\nNote: Blue light can be used at an intensity between 0.3 mW/mm2 and 0.8 mW/mm2 with time ranges starting from 1 min to 48 h, using UHP-T-DI-LED series Ultra High-Power LEDs (materials and equipment[href=https://www.wicell.org#materials-and-equipment]) (Figure 1[href=https://www.wicell.org#fig1]).\nNote: Light intensity is measured at of the culture plate bottom, using the light power meter LPM-100 (materials and equipment[href=https://www.wicell.org#materials-and-equipment]).\nCritical: Light stimulation duration and intensity has been tested. Stimulating the cells using blue light at an intensity of 0.8 mW/mm2 for up to 48 h, is below the phototoxicity threshold as confirmed in the study by Bérard et al.1[href=https://www.wicell.org#bib1]\nCritical: The aggregation rate and the inclusions size are positively correlated to the light intensity and the duration of light stimulation. Both parameters play a role on the kinetics, reversibility and maturation of the aggregates and must be optimized. For instance, when illuminated at an intensity of 0.8 mW/mm2, inclusion formation occurs significantly faster compared to an intensity of 0.3 mW/mm2. Furthermore, illumination at 0.8 mW/mm2 for up to 6 h results in reversible aggregates, while continued illumination for 24 h yields mature aggregates displaying key biochemical features akin to authentic Lewy bodies. Our optimization experiments in mammalian cells and iPSC-derived neurons demonstrated that employing a light intensity of 0.3 mW/mm2 was sufficient to induce LIPA-α-syn inclusions in cells for up to 48 h without causing significant toxicity.\nBiochemical characterization of the LIPA-α-syn aggregates – Western blot\nTiming: 2 days",
    "After induction of LIPA-α-syn aggregates, we proceed with the biochemical characterization of the light-induced α-syn inclusions. We start with the detection of the high molecular weight (HMW) α-syn aggregated species (Figure 2[href=https://www.wicell.org#fig2]), which appear as a protein smear spanning approximately from 180 to 370 kDa in the Western blot and correspond to different α-syn oligomeric forms.1[href=https://www.wicell.org#bib1],4[href=https://www.wicell.org#bib4]\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3149-Fig2.jpg\nFigure 2. Time course formation of high-molecular LIPA aggregates using Western blot\nWB analysis of aggregate formation of the LIPA constructs (LIPA-α-syn, LIPA-empty and LIPA-α-synΔNAC) at the different time points post-stimulation (0 h, 6 h, 12 h, and 24 h) with blue light (0.8 mW/mm2) using anti-α-syn and anti-mCherry antibodies respectively. β-actin was used as the loading control.\nHere we describe the steps of a quantitative Western blotting procedure using a LI-COR Odyssey Imager. The protocol could also be applied to any other standard Western blot procedure.\nRemove the media of cells exposed to the blue light (from step 9) and wash them twice with 2 mL of ice-cold dPBS (Ca+/Mg+).\nCritical: The use of cold dPBS is recommended to minimize possible destabilization of LIPA-α-syn aggregates. Moreover, the addition of (Ca+/Mg+) is used to preserve cell-matrix interaction and avoid cell loss during the washing process.\nCells are directly lysed in 2× Laemmli buffer, by adding 250 μL of 2× Laemmli Buffer to a 35 mm plate (materials and equipment[href=https://www.wicell.org#materials-and-equipment]).\nScrape the cells and collect the cells lysate and transfer into a microcentrifuge tube.",
    "Alternatives: Other lysis buffers such as Radioimmunoprecipitation Assay (RIPA) buffer can be used for protein extraction from cells. The RIPA buffer can be stored at 4°C for up to 6 months. It is recommended to add protease and phosphatase inhibitors, phenylmethylsulfonyl fluoride (PMSF), as well as 1 mM of dithiothreitol (DTT) prior to cell lysis to minimize protein degradation and prevent the oxidation damage. Moreover, proceed with cell lysis on ice and use gentle cell trituration to help minimize aggregates destabilization. When collecting in RIPA buffer, heat the samples at 70°C for 10 min prior to loading into Western blot gel to denature proteins for a proper migration in the gel.\nPause point: Although we always recommend the use of freshly collected cell lysate, protein samples can be stored for 7 days at −20°C after a snap freeze on dry ice. For longer storage periods, store the samples at −80°C.\nUse 4%–20% precast polyacrylamide gradient gels for proper visualization of LIPA-α-syn HMW species.\nAlternatives: Home-made 10% acrylamide SDS-PAGE gels can also be used to visualize LIPA-α-syn aggregates (materials and equipment[href=https://www.wicell.org#materials-and-equipment]). Troubleshooting 1[href=https://www.wicell.org#sec6.1].\nAlternatives: Alternative membrane types, such as PVDF, can also be employed for Western blot detection of LIPA aggregates. However, we recommend the use of nitrocellulose membranes or FL-PVDF membranes to minimize background noise when using a LI-COR Odyssey Imager.\nHeat the samples for 15 min at 95°C to help denature the proteins as well as DNA.\nLoad 5–10 μL (corresponding to 10–20 μg of protein) per well of each sample and allow the samples to migrate for 45 min at 160 V in 1× Running Buffer (materials and equipment[href=https://www.wicell.org#materials-and-equipment]).",
    "Note: Quantifying the exact total protein amount in Laemmli buffer can be challenging. An alternative approach involves using Ponceau red staining to quantify dot blots with known increasing concentrations of BSA, generating standard curves and estimate the protein concentration in our samples. Moreover, normalization to a housekeeping protein, such as β-actin, is also required.\nUse a protein molecular weight marker (i.e., Chameleon Duo ladder) to estimate the molecular weight of proteins of interest and to monitor the progress of electrophoresis.\nAfter the SDS-PAGE gel electrophoresis, follow a wet-transfer protein transfer protocol to transfer the protein from the gel to a 0.2 μm pore nitrocellulose membrane.\nAlternatives: The wet transfer protocol is more appropriate for transferring larger proteins (>100 kDa), making it the recommended choice for effectively visualizing high molecular weight (HMW) α-syn oligomers. Alternatively, semi-dry transfer or Bio-Rad’s Turbo transfer can be used but optimizing transfer time and voltage might be necessary. Troubleshooting 1[href=https://www.wicell.org#sec6.1].\nAll the components (Whatman filter papers, sponges, and membranes) are mounted and soaked in a cold 1× transfer buffer (materials and equipment[href=https://www.wicell.org#materials-and-equipment]):\nTo assemble the transfer “sandwich” in a transfer cassette, the pre-wet nitrocellulose membrane and gel are packed together inside one pre-wet sponge followed by one Whatman filter paper. The gel needs to face the negative electrode while the nitrocellulose membrane faces the cathode.\nAfter assembling the transfer stack components, remove air bubbles with a roller or pipette.\nPlace the transfer cassette inside the transfer tank.\nAdd a magnet to the bottom of the apparatus to allow for constant stirring at low speed to maintain an even buffer temperature buffer distribution in the tank.\nPlace an ice block in the transfer tank to maintain an even and cold buffer temperature.",
    "Put the transfer tank in a bucket and add ice to ensure that the tank temperature does not increase during the transfer protocol.\nPerform the transfer protocol at 4°C.\nAlternatives: PVDF membranes can be used, membranes must be wet in methanol. However, methanol-free transfer buffers can be used downstream.\nAlternatives: Transfer of the protein can be performed at 4°C, on ice, overnight at 90 mA.\nRun the transfer for 2 h at 350 mA.\nAfter the transfer, rinse the membrane in 1× PBS.\nHeat the membrane in a microwave by submerging it in a microwave-safe container filled with approximately 50 mL of PBS.\nThe container containing the membrane and PBS is then irradiated using a household microwave oven set at 500 W for a duration of 1 min.\nThis step will result in unfolding the proteins on the membrane, thus allowing for the proper exposure of epitopes and a better detection of the protein of interest.\nCritical: Avoid overheating the membranes by going over the 1 min duration suggested. Prolonged heating can lead to damage to the nitrocellulose membrane, thereby impeding proper protein detection.\nAllow the membrane to cool down to 20°C–22°C before proceeding with the blocking step.\nPause point: Membranes can be stored for 16 h at 4°C in 1× PBS, protected from light.\nBlock the membranes for 1 h at 20°C–22°C in WB blocking buffer (materials and equipment[href=https://www.wicell.org#materials-and-equipment]) under constant rocking.\nAfter blocking, incubate the membranes for a minimum of 2 h at 20°C–22°C with anti-α-syn antibody (BD Lab) at 1:1000 diluted in WB blocking buffer (materials and equipment[href=https://www.wicell.org#materials-and-equipment]).\nPause point: Membranes can be incubated with primary antibody for 16 h at 4°C under constant rocking.\nWash the membrane with WB washing buffer (materials and equipment[href=https://www.wicell.org#materials-and-equipment]) 3 times for 5 min each under constant rocking.",
    "Incubate the membrane for a minimum of 1 h with an anti-mouse 680RD LI-COR secondary antibody diluted at 1:10000 in WB blocking buffer (materials and equipment[href=https://www.wicell.org#materials-and-equipment]).\nWash the membrane with WB washing buffer (materials and equipment[href=https://www.wicell.org#materials-and-equipment]) 3 times for 5 min each under constant rocking.\nDetect the protein bands using an Odyssey CLx Infrared Imaging System using the IR680 channel.\nCritical: Always image both channels (IR680 and 800) to visualize all the bands of the molecular weight marker.\nRepeat steps 22–23 using the anti-mCherry antibody as primary antibody, diluted at 1:2000.\nUse an anti-rabbit 800CW LI-COR secondary antibody diluted at 1:10000 in WB blocking buffer (materials and equipment[href=https://www.wicell.org#materials-and-equipment]).\nEvaluate and quantify the smear corresponding to the LIPA-α-syn aggregates using the Image Studio Software or the Empiria Studio Software from LI-COR.\nAlternatives: Alternatively, we can use an antibody raised against the pathological form of α-syn phosphorylated at the residue serine 129 (pS129) diluted at 1:2000 (materials and equipment[href=https://www.wicell.org#materials-and-equipment]).\nNote: For loading control, repeat steps 22–23 using the same membrane, and incubate with anti-β-actin antibody, diluted at 1:5000. Use an anti-mouse 800CW LI-COR antibody diluted at 1:10000 in WB blocking buffer (materials and equipment[href=https://www.wicell.org#materials-and-equipment]).\nAlternatives: β-actin is a popular choice as a Western blot loading control due to its high and ubiquitous expression, as well as its stability under various experimental conditions. Alternative loading controls can be beta tubulin and GAPDH since they are constitutively expressed in high quantities in all model systems.\nBiochemical characterization of the LIPA-α-syn aggregates – Filter retardation assay\nTiming: 2 days\nAnother characterization step to validate the insoluble status of the generated aggregates is the filter retardation assay. We describe below the steps that allow for the detection and differentiation of LIPA-α-syn aggregates from empty (control) aggregates and the non-aggregatable form LIPA-α-synΔNAC (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3149-Fig3.jpg",
    "Figure 3. Time course formation of high-molecular LIPA aggregates using filter retardation assay\nFilter retardation assay on cellulose acetate membrane showing the time course of the LIPA aggregation formation at the different time points post-stimulation (0 h, 12 h, and 24 h), as examined using anti-α-syn and anti-mCherry antibodies respectively. Prior to introducing SDS, samples were filtered through a nitrocellulose membrane for loading control. This step enables the retention of both monomeric and aggregate proteins, facilitating the assessment of total protein levels in each experimental condition. Membrane was examined using the anti-mCherry antibody.\nRemove the media of cells exposed to the blue light (from step 9) and wash them twice with 2 mL of cold dPBS (Ca+/Mg+).\nTo a 35-mm plate add 250 μL of Lysis buffer (materials and equipment[href=https://www.wicell.org#materials-and-equipment]).\nUsing a cell scrapper, scrape cells off the dish and transfer the cell suspension into a microcentrifuge tube.\nPause point: Samples can be stored at −80°C for 2–4 days after a snap freeze on dry ice.\nNote: It is always recommended to use fresh samples and avoid freeze/thaw cycles.\nLyse the cells using a Dremel tissue homogenizer.\nOptional: Cells can be lysed using a water bath sonicator at 20% Amplitude (30 s with pulses every 2 s (1 s on/off).\nCentrifuge the samples at 500 × g for 5 min to pellet the nuclear fraction. LIPA-α-syn aggregates should remain in the supernatant (soluble fraction).\nCollect the supernatant and centrifuge at 1000 × g for 10 min to clarify the fraction.\nCollect the supernatant and place it on ice.\nMount the vacuum manifold (materials and equipment[href=https://www.wicell.org#materials-and-equipment]) using two thin Whatman filter papers pre-soaked with 1× PBS, 1.5% SDS and assemble them on the vacuum manifold.",
    "On top of the filter paper, place a 0.2 μm pore size acetate membrane pre-soaked in 1× PBS containing 1.5% SDS.\nTightly close the manifold and apply the vacuum to check for the proper tightening of the vacuum manifold. Turn off the vacuum.\nPrepare the samples:\nPut aside 20% of the volume of cell lysate collected from each experimental condition (step 34), which will be used as follow:\nLoading control: Half of this volume will be run in Western blot and analyzed on a nitrocellulose membrane (step 45) to evaluate the total amount of the LIPA protein in the starting material.\nNegative control: The other half of the volume will be depleted from the LIPA-α-syn aggregates by adding SDS to the sample to reach 1.5% SDS final concentration. Heat this sample for 15 min at 95°C to denature the protein.\nAdd SDS to the samples from step 34 to reach 1.5% SDS final concentration and incubate for 10 min at 20°C–22°C.\nWhile the samples are incubating in SDS, load 100 μL of 1.5% SDS solution in each well and apply vacuum until the buffer passes through the filter. Wait until the filtration is complete.\nCAUTION: Ensure that the wells are not entirely dried before loading the sample. Complete drying can lead to an uneven sample distribution, causing halos formation during protein detection.\nQuickly load the samples from step 34 into the manifold (samples incubated with SDS at 20°C–22°C and the negative controls) into each well (50 μL is the recommended volume per sample).\nNote: Load the samples as duplicates or triplicates for proper quantification.\nCritical: Fill the empty wells with a 1.5% SDS solution. This step is crucial for maintaining consistent vacuum pressure across the entire membrane.",
    "Apply the vacuum to filter the samples until complete passage. This step lasts typically from 30 s to 2 min.\nLoad 100 μL of 1.5% SDS solution into the wells and apply vacuum again to filter the solution. Wait until complete passage.\nImmediately turn the vacuum off to prevent excessive drying. Repeat this washing step at least 1 time.\nNote: This wash step may be repeated as necessary when the background signal may appear to be too high in the control samples. This high background is often dependent on the cell type, the expression levels of the LIPA mCherry aggregates, and the number of aggregates Troubleshooting 2[href=https://www.wicell.org#sec6.3].\nUnmount the vacuum manifold, take the acetate membrane and rinse it in Milli-Q water.\nPlace the membrane in PBS at 4°C while running the loading controls.\nTo run the loading controls, follow steps 41 to 45 but instead:\nUse a 0.2 μm pore Nitrocellulose membrane. This membrane will capture the total protein fraction, offering insights into loading control for each experimental condition.\nUse PBS without SDS as buffer for all the subsequent steps 38–42.\nFor the acetate membrane containing the samples and the negative control from steps 41–45, perform the blocking and incubation with antibodies as described in the Western Blot protocol (step 19 to step 26).\nFor the Nitrocellulose membrane from step 45 used for the loading controls, reveal for the total protein using a Ponceau red solution (materials and equipment[href=https://www.wicell.org#materials-and-equipment]):\nPlace the membrane into a flat-bottom container, protein side up.\nStain the membrane in Ponceau red solution and place on a rocker.\nNote: Nitrocellulose membranes saturate in around 5 min.\nQuickly rinse the membrane with distilled H2O (dH2O).\nReduce the Ponceau red staining through repeated washes in 1× PBS until achieving a clear total protein stain.",
    "Image the membrane and assess total protein levels in each condition.\nVisualize and quantify the filter retardation signal using the LI-COR Odyssey Imager and Image Studio Software.\nBiochemical characterization of the LIPA-α-syn aggregates– SDD-AGE\nTiming: 2 days\nAnother significant step in the characterization of LIPA-α-syn aggregates involves employing the semi-denaturing detergent–agarose gel electrophoresis (SDD-AGE) technique to provide additional confirmation of the presence of insoluble high molecular weight (HMW) α-syn aggregate species5[href=https://www.wicell.org#bib5],6[href=https://www.wicell.org#bib6],7[href=https://www.wicell.org#bib7] (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3149-Fig4.jpg\nFigure 4. Time course formation of high-molecular LIPA aggregates using SDD-AGE\n(A) SDD-Age analysis showing the formation of high-molecular LIPA-Empty and LIPA-α-syn aggregates at different times points post-stimulation (0 h, 6 h, and 12 h) with blue light (0.8 mW/mm2), as examined using anti-α-syn and anti-mCherry antibodies respectively.\n(B) For loading control, samples were run on WB and protein expression was examined using anti-mCherry and anti-β-actin antibodies respectively.\nRemove the media of cells exposed to the blue light (from step 9) and wash them twice with 2 mL of cold dPBS Ca+ Mg+.\nFollow the lysis and centrifugation steps as described for the filter retardation (steps 29–34).\nNote: Keep 10% of the sample volume for the detection of the total protein levels by Western blot.\nFrom the remaining samples, determine the volume of the supernatant and mix the supernatant with the SDD-AGE sample buffer (materials and equipment[href=https://www.wicell.org#materials-and-equipment]).\nIncubate the sample mix at 20°C–22°C for 7 min.",
    "Note: A 7 min incubation period is necessary to observe the smearing bands for both α-syn and mCherry signals. This duration proved to be the optimal time for achieving the desired smearing effect in the samples. Using shorter incubation times may not yield the desired smearing effect. While some protocols have recommended incubating samples for up to 10 min, it's important to note that we have not tested this specific incubation time in the context of this protocol.\nLoad the samples onto a 1.8% agarose gel (materials and equipment[href=https://www.wicell.org#materials-and-equipment]) prepared in buffer G (materials and equipment[href=https://www.wicell.org#materials-and-equipment]) containing 0.02% SDS.\nNote: Allow the liquid agarose to cool down to a temperature ranging between 60°C–65°C before slowly adding the SDS while avoiding solidification or air bubble formation.\nRun the SDD-AGE in buffer G containing 0.01% SDS at 12V/cm at 20°C–22°C for 2 h until the dye front reaches the end of the gel. Troubleshooting 3[href=https://www.wicell.org#sec6.5].\nAlternatives: Gels can be run at 4°C to minimize the effect of the heat generated from the high voltage.\nTransfer the gel into a nitrocellulose membrane using the Turbo transfer method provided from Bio-Rad.\nNote: Here, we suggest utilizing the Turbo transfer method from Bio-Rad, benefiting from the machine’s reliable and compact membrane stacking. This approach ensures effective protein transfer onto the membrane.\nAlternatives: Wet transfer methods can be performed as described by Dr. Lindquist group.8[href=https://www.wicell.org#bib8]\nFollowing the transfer step, follow the steps described in Western blot protocol for the visualization and quantification of the aggregates (steps 19–26).\nIn vitro seeding experiment using RT-QuIC (real-time quaking-induced conversion)\nTiming: 7 days",
    "One of the prominent features of α-syn aggregates is their ability to self-propagate through the recruitment of monomeric counterparts, a phenomenon referred to as seeding capacity. Here, we evaluate the seeding capacity of LIPA-α-syn aggregates, using the RT-QuIC assay. This assay allows for the monitoring of the formation of seeded aggregates from recombinant monomeric α-syn through a template-seeded aggregation process using LIPA-α-syn aggregates as the seeding template material. As the newly formed aggregates develop, they interact with an amyloid-sensitive dye called thioflavin T (ThT), leading to an observable increase in fluorescence signal. The RT-QuIC protocol we outline here offers the advantage of facilitating high-throughput assessment of the kinetics of LIPA- α-syn aggregate seeding capacity in real-time (Figure 5[href=https://www.wicell.org#fig5]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3149-Fig5.jpg\nFigure 5. Real-time quaking-induced conversion (RT-QuIC) analysis for the validation of the seeding capacity of purified LIPA-α-syn aggregates in vitro\nRT-QuIC analysis illustrating the kinetics of recombinant monomeric α-syn aggregation in the presence of purified LIPA-α-syn aggregates (+light), and monomeric LIPA-α-syn (−light). The average Th-T fluorescence intensity was plotted against time, data are presented of triplicate wells. The data are presented as the means ± SEM.\nRemove the media of cells exposed to the blue light (from step 9) and wash them twice with 2 mL of cold dPBS Ca+ Mg+.\nAs a negative control, cells not exposed to the blue light can be used for validation of the seeding capacity of the LIPA- α-syn aggregates.\nFollow the lysis and centrifugation steps as described in steps 29–34.\nThe clarified lysate from step 57 is then subjected ultracentrifugation at 150,000 × g for 1 h at 4°C.\nThe pellet from step 58 gets resuspended in 150 μL of PBS.",
    "The pellet from step 59 is then subjected to sonication at: 30% intensity, 1 s on and 1 s off, for 45 s using a Fisherbrand Model 505 sonicator.\nNote: If the pellet remains visible in the tube, you may repeat the sonication step up to two times until the pellet becomes no longer visible by eye. It may be necessary to perform additional pipetting to confirm the absence of the pellet.\nCritical: It is important not to add any additional lysis buffer to prevent excessive sample dilution.\nDetermine the protein concentration of the cell pellet using colorimetric assay kits such as: Pierce BCA Protein Assay Kits.\nDilute the samples to reach a final concentration of 2 μg/mL.\nIn a black clear bottom 96-well plate add 200 μL of the RT-QuIC reaction mixture (materials and equipment[href=https://www.wicell.org#materials-and-equipment]) containing monomeric α-syn.\nTo the mixture add 2 μg/mL of LIPA-α-syn aggregates by carefully pipetting the sample into each well.\nNote: The volume of the sample at 2 μg/mL should not exceed 10% of the total reaction volume.\nFor the negative control condition, carefully pipette 2 μg/mL of LIPA-α-syn monomers purified from the cells that were not exposed to the blue light.\nAnother experimental control will include wells of the RT-QuIC reaction mixture (materials and equipment[href=https://www.wicell.org#materials-and-equipment]) containing recombinant monomeric α-syn alone.\nPlates are covered with sealing film, and creases are removed manually.\nPlates are placed in a plate reader and the program is setup as described in Table 1[href=https://www.wicell.org#tbl1].\ntable:files/protocols_protocol_3149_8.csv\nCPM, cycle per minute.\nNote: The preheat option of the plate must be set to allow the plate to reach the optimal temperature (41°C) before starting the experiment.\nAlternatives: Alternative plate readers, such as the FLUOstar OMEGA plate reader (BMG Labtech, Germany), can also be used for the RT-QuIC experiment.",
    "Critical: The kinetics of LIPA-α-syn aggregation using RT-QuIC can be influenced by various factors, including the temperature used for the plate reader, the shaking time, and the resting period. Additionally, the chemical factors of the reaction mixture such as the pH, the concentration of monomeric α-syn, and the percentage of the detergent such as SDS need to be followed based on the optimized protocol we describe here.\nAlternatives: Silica beads can be added to the plates, which have been suggested to help shorten the assay incubation period. However, in the present protocol we did not test the addition of beads to the plates.\nAllow the program used in step 64 to run for up to 1 week.\nThe Th-T fluorescence is measured (excitation 435 nm; emission 485 nm) every 30 min using (BioTek Cytation 5 Multi-Mode Readers) plate reader.\nFluorescence is recorded and graphed against time in h, and depicts a typical exponential curve characterized by a lag phase and a plateau. Troubleshooting 4[href=https://www.wicell.org#sec6.7].\nFor standardizing the data, a positive RT-QuIC seeding reaction is recorded when the observed TH-T fluorescence intensity is equal to or higher than a predefined threshold.\nThe threshold can be set at three times the fluorescence intensity observed after the initial amplification phase recorded at time 0 h.\nNote: RT-QuIC, experiments need to be performed at least 3 times with 3 replicates per experiment.\nNote: The Rt-QuIC assay was performed in at least 3 independent experiments with 3 technical replicas per experiment. The average ThT fluorescence intensity was plotted against time (n = 3). The data are presented as the means ± SEM.\nDetection of the key biochemical markers of authentic Lewy bodies using immunocytochemistry approach\nTiming: 2 days",
    "Subsequently, we explored if light-induced LIPA-α-syn inclusions could replicate essential biochemical characteristics of genuine LBs. This was achieved through the application of a range of LB markers identified in PD-affected brains, namely phosphorylation of α-syn at serine 129 (pS129), ubiquitin, SQSTM1 (p62) and hsp70 (Figure 6[href=https://www.wicell.org#fig6]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3149-Fig6.jpg\nFigure 6. LIPA-α-syn inclusions are positive to authentic Lewy body (LB) markers\nConfocal images of HEK293T cells overexpressing LIPA-α-syn exposed to blue light for 12 h (0.8 mW/mm2) and stained with LB markers: ubiquitin, p62, Hsp70, and phosphorylated α-syn at S129 (pS129). (Scale bar = 10 μm).\nPlate 0.8 × 105 cells/cm2 of HEK293T cells on poly-L-lysine-coated 12-mm coverslips (see before beginning) in a 24-well plate in DMEM 10% FBS 1% P/S. Incubate for 16 h at 37°C 5% CO2.\nTransfect the cells following the previously described method (step 2 to step 8), using 0.25 μg LIPA-α-syn, 0.40 μg LIPA-α-synΔNAC and 0.20 μg LIPA-empty. DNA was adjusted for each LIPA construct to obtain equal protein expression levels in the different conditions.\nIlluminate the cells for 16 h under the blue light, at the intensity of 0.8 mW/mm2, to induce LIPA aggregation.\nFollowing illumination, fix the cells for 15 min at 20°C–22°C in a solution of 4% (w/v) paraformaldehyde (PFA) and 3% (w/v) sucrose.\nWash the cells three times with 1× PBS for 5 min each.\nPermeabilize the cells using a solution of 0.3% (v/v) Triton X-100 in 1× PBS for 10 min at 20°C–22°C.\nRinse the cells once with 1× PBS to remove any remaining Triton.\nIncubate cells for 1 h at 20°C–22°C in ICC blocking buffer (materials and equipment[href=https://www.wicell.org#materials-and-equipment]).\nIncubate cells with primary antibodies raised against pS129, ubiquitin, p62 or hsp70 diluted in blocking solution (materials and equipment[href=https://www.wicell.org#materials-and-equipment]) at 4°C for 16 h.",
    "Optional: Incubation with the primary antibodies can be shortened to 2 h at 20°C–22°C.\nPerform three 10-min washes with fresh blocking buffer (materials and equipment[href=https://www.wicell.org#materials-and-equipment]).\nIncubate cells in secondary antibodies (Alexa Fluor 488 or 633) diluted at 1:400 for 1 h at 20°C–22°C.\nPerform two 10-min washes with 1× PBS.\nStain the cell nuclei with DAPI at 1:5000 to reach 1 μg/mL in 1× PBS for 2 min.\nPerform two quick washes with 1× PBS.\nBefore mounting, quickly rinse the coverslips with dH2O to remove any residual salt.\nMount the 12-mm coverslips onto a microscope slide using 4.5 μL of mounting media.\nImage LB-markers staining using confocal microscope, as we previously reported.1[href=https://www.wicell.org#bib1]\nReal-time monitoring of LIPA-α-syn inclusion formation – Live-cell imaging\nTiming: 2 days\nA key benefit of optogenetics is its ability to provide precise spatiotemporal resolution in light stimulation, enabling real-time monitoring of LIPA-α-syn aggregation process. Here, we present a live imaging protocol allowing for the continuous observation of LIPA-α-syn inclusion formation using confocal microscopy (Methods video S1[href=https://www.wicell.org#mmc1]).\nNote: The following protocol has been optimized on a confocal Stimulated emission depletion (STED) microscope Leica Dmi8 TCS SP8 STED 3D X using a x63 objective (1.40 NA). Moreover, the microscope is equipped with a White Light laser (WLL) that can be set at any wavelength, set at 70% power (input power), and then used in a range of 5%–30% power (software end laser power).\nPlate 0.8 × 105 cells/cm2 of HEK293T cells on a pre-coated glass-bottom imaging chamber such as a 35-mm MatTek dish.\nAlternatives: If multiple conditions are required, cells can be plated in a chamber containing multiple wells (ibidi chambers), and any glass-bottom fitting your microscope setup would work.\nTransfect the cells following steps 2–8.",
    "One hour prior to the start of the experiment replace the cell culture media with pre-warmed (37°C) live-cell imaging medium (DMEM FluoroBrite, 10% FBS and GlutaMAX).\nNote: If working with primary neurons or iPSC-derived neurons, we recommend using Neurobasal medium without phenol red.\nWhile the cells are incubating, prepare the microscope live-imaging setup:\nMount the stage-top incubator on top of the Super Z Galvo stage.\nFill the stage-top incubator with 15 mL of sterile ddH2O.\nOpen the CO2 cylinder, linked to the heating and gas mixing controller, and adjust the percentage to 5% CO2. Wait for 10 min for CO2 stabilization.\nTurn-on the stage heating and top heating. Set the stage at 40°C and the top at 43°C.\nNote: When using the above suggested parameters, the sample temperature will be maintained at 37°C. Depending on the system used and the environment, these values can be adjusted once the sample temperature has been measured.\nOptional: Attach the lens heater to the objective and turn-on the controller to allow it to reach 37°C.\nNote: The use of a lens heater will stabilize the system temperature, thus maintaining the immersion oil at 37°C, avoiding any Z-drift during imaging.\nPlace a drop of immersion oil (type F) on the lens and immediately place the live-cell chamber inside the holders of the stage-top incubator.\nClose the stage-top incubator and use the cursor to get the object into focus.\nCritical: At this point, do not start the imaging session since the system is not yet stabilized. Instead, wait for 15–30 min and redo the focus (the sample would have drifted away of the immersion oil, through a phenomenon called thermal drift).\nTo induce and image the aggregation in real time:",
    "Set one sequence of image acquisition meant to stimulate and record the mCherry signal corresponding to the LIPA.\nSet the WLL at 587 nm.\nOpen a HyD detector to capture signals ranging from 595 to 650 nm.\nDuring the same image acquisition sequence, add a WLL laser at 470 nm to stimulate the LIPA aggregation.\nNote: If there is no WLL laser available to be set at exactly 470 nm, it is possible to use a 488 nm laser. We do not recommend using argon laser (405 nm) since this wavelength is toxic. Troubleshooting 5[href=https://www.wicell.org#sec6.9].\nChoose a cell that is expressing a high level of mCherry and start an image trial, playing with the laser power at 470 nm.\nNote: A laser power of 5% or less will induce a slow aggregation pattern, while a 30% laser power induces robust aggregation with aggregates appearing as early as the stimulation starts. Troubleshooting 6[href=https://www.wicell.org#sec6.11].\nStart acquiring a Z-stack overtime, using a scan speed between 400 and 8000 Hz and a resolution adapted to the optical zoom used.\nCritical: Imaging should be done continuously since LIPA-α-syn aggregates are reversible at early time points. The imaging parameters should be optimized to obtain a good resolution, while minimizing the phototoxicity during imaging.\nNote: We recommend starting with 700 Hz scan speed. A resonant scanner at 8000 Hz is more adapted to track quick interactions between the aggregates and organelles for example inside the cell.\nNote: Using the above-described protocol, we were able to induce and monitor LIPA-α-syn aggregation in HEK293T and COS-7 cells, as well as in human iPSC-derived dopaminergic neurons. We were also able to perform up 12 h of continuous live imaging without inducing cell death, by using high-speed laser scanning microscopy (resonant scanner).",
    "Note: If a GFP-like reporter is present in the green channel, it is possible to acquire both channels simultaneously, minimizing the crosstalk. For this purpose, use HyD detectors while narrowing the band pass. If the microscope is not set up to acquire the two wavelengths simultaneously, create two sequences of imaging and make a sequential Z-stack at high-speed scanning.\nSupplement protocol to transduce cells with the LIPA plasmids\nTransduction of hiPSC-derived dopaminergic neurons\nTiming: 7–10 days\nWhile immortalized mammalian cells are prevalent for α-syn aggregation studies, employing iPSC-derived human neurons present distinct advantages. These neurons closely mimic human neuronal physiology, enhancing the fidelity of neurological disorder investigations. However, transfecting iPSCs is challenging, necessitating lentivirus-mediated transgene overexpression. Here, we outline the sequential stages involved in transducing iPSC-derived neurons with lentiviruses carrying LIPA constructs.\nNote: Using plasmids with a phosphoglycerate kinase 1 (PGK) promoter is crucial for the proper transduction of iPSC-derived neurons, as CMV tends to be repressed as hiPSC are differentiated towards neurons.9[href=https://www.wicell.org#bib9],10[href=https://www.wicell.org#bib10]\nNote: For a complete and detailed protocol on how to differentiate iPSCs into mature dopaminergic neurons, please follow our recently published protocol.11[href=https://www.wicell.org#bib11]\nFollowing the protocol of 9 days in vitro (DIV) culture that allows for the differentiation of iPSCs to immature dopaminergic neurons, thaw a lentiviral tube from −80°C, and place it on ice.\nNote: Lentiviral particles are generated from HEK293T following the protocol from Tiscornia et al.12[href=https://www.wicell.org#bib12] Viral particles are titrated using HIV-1-based qPCR kits ABM (ABM; cat. no. LV900).11[href=https://www.wicell.org#bib11]\nPrepare a master mix of cell culture medium (STEMdiff Maturation media) coupled with lentiviral particles to reach a multiplicity of infection of 10 (MOI = 10).",
    "Note: The suggested dilution is only an example, it may be necessary to experiment with higher or lower dilutions. These dilutions can be adjusted based on the viral titration results obtained.\nSlowly add the maturation media containing the viral particles to the neurons.\nIncubate for 7–10 days, changing half the media every 4 days.\nCritical: Seven days post infection, check the cells every day for expression detection. The viral expression peak should be reached 2 days after the first expression of the mCherry signal.\nNote: Analysis should start when the peak of expression is observed (usually 2 days after the first expression of the mCherry signal appears) . Do not wait for longer than 4 days, as cells will be stressed and stress granules might appear and preclude the detection and observation of LIPA aggregates.\nCreation and use of stable cell lines expressing the LIPA backbones\nTiming: 10–15 days\nOpting for a stable expression of the LIPA backbone in immortalized cell lines, instead of transient transfection, is advised for efficiency, cost effectiveness, and enhanced data reproducibility. The forthcoming protocol elucidates the procedure for establishing, sustaining, and utilizing stable cell lines that express the LIPA constructs.\nNote: We use the pCMV lentivirus which allows for a high level of expression in mammalian cell lines. Cells with stable transgene expression can be selected by applying puromycin selection pressure.\nNote: Prior to starting an experiment for the creation of a stable line, it is necessary to establish the ideal dosage of puromycin for the specific target cell line. This can be achieved by subjecting the target cells to a series of puromycin doses and identifying the lowest dose that effectively kills off all the cells.",
    "FACS sorting can also be used in parallel following puromycin selection to enrich and collect for the highest expressing mCherry cells.\nAlternatives: The SIN-PGK lentiviral backbone can be used. However, it lacks a puromycin resistance cassette for the selection pressure and the use of FACS to select cells with stable transgene expression is necessary.\nPlate cells at 20% confluency in 6-well plate and incubate them at 37°C and 5% CO2 for 16 h.\nThaw a tube of lentiviral particles from −80°C on ice.\nThe next day add the following in the cell culture media with:\nPolybrene, to reach 10 μg/mL (1000-fold dilution from the stock prepared at 10 mg/mL) final concentration.\nLentiviral particles diluted to reach a MOI of 1, 10 or 100.\nNote: The suggested dilutions are only examples, it may be necessary to experiment with higher or lower dilutions. These dilutions can be adjusted based on the viral titration results obtained.\nIncubate the cells with the medium from step 97 for 3 days at 37°C and 5% CO2.\nAfter 3 days, split each confluent well into 6 wells of a 6-well plate in complete cell culture medium, and incubate at 37°C and 5% CO2 for 16 h.\nThe next day, expose the cells to increasing concentrations of puromycin (1–1.5–2–2.5–3–5 μg/mL).\nAfter 3–5 days, when cells reach confluency, sort the cells using a flow cytometer for mCherry expressing cells, while keeping the 30% highly expressing cells.\nNote: Steps 95–101 describe a protocol that will allow for the selection of a polyclonal cell line, but the mCherry will remain unequal between cells. A high expression of the LIPA backbone is necessary to allow for an efficient Cry2olig oligomerization under blue light stimulation.",
    "Plate the sorted cells in two T25 flasks; One will be used for cryopreservation, and the second one will be used for monoclonal selection.\nNote: To ensure stability of the line created, it is advisable to generate monoclonal cell lines from the polyclonal pool at the early stages of the protocol.\nWhen the T25 flask is 70% confluent, passage the cells to plate 100 cells in a 10-cm dish. Incubate for 3–5 days at 37°C and 5% CO2 to allow the colonies to grow.\nUnder a fluorescent microscope, look for colonies with the highest expression of mCherry that are well spaced to ensure no contamination from surrounding colonies. When a desired colony is found, circle the colony with a pen.\nUsing a 20 μL pipette set to a volume of 15 μL, scrape the colony with the pipette tip and then aspirate the colony.\nNote: The colony should be visible inside the tip.\nTransfer the selected colony to an empty well of a 96-well plate.\nAdd 150 μL of medium to the well of a 96-well plate.\nRepeat this step until at least 20 colonies have been selected from the 10-cm plate.\nIncubate the 96-well plate for 5–7 days at 37°C and 5% CO2 until the cells recover, changing media every 3 days.\nWhen the cells reach confluency, expand the culture, and cryopreserve the cells as soon as 70% confluency is reached in a T75 flask.\nCritical: Once the monoclonal LIPA clones are isolated and grown, it is important to keep the cells protected from ambient white light since it may trigger Cry2olig oligomerization. We recommend turning off the direct white light in the sterile hood while maintaining and plating the cells.",
    "Critical: Cells should never reach 100% confluency and medium should never turn yellow. We observed that when cells become overconfluent, or when the cell culture media turns yellow, this trigger self-aggregation of the LIPA-α-syn construct. Therefore, we recommend passaging the cells every 3–4 days.\nCells stably expressing the LIPA backbones should be plated 12–16 h before being exposed to blue light.\nCritical: To obtain the best levels of aggregation, it is important to illuminate cells 12 h post plating and no more than 16 h to avoid the cell division event. Indeed, we suspect that cell division might interfere with the aggregation process, reducing the aggregation propensity and kinetics."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Neuroscience",
    "Microscopy"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}