{
  "id": 17675,
  "origin_website": "Jove",
  "title": "A Quantitative Detection Method for MicroRNAs in the Kidney of an Ischemic Kidney Injury Mouse Model",
  "procedures": [
    "All animal experimental protocols were approved by the animal ethics committee of Jichi Medical University and performed in accordance with the Use and Care of Experimental Animals guidelines from the Jichi Medical University Guide for Laboratory Animals.\n1. IRI model\nNOTE: Carefully monitor for hypothermia, intestinal moisturization, and depth of anesthesia throughout the procedure.\nPrepare the following items: a 50 mL centrifuge tube containing cotton drenched in isoflurane, a heated surgical pad, a Petri dish with phosphate-buffered saline (PBS), surgical scissors, and forceps. Maintain the PBS at 37 °C.\n\tNOTE: This IRI model was generated using male C57BL/6 mice (9 weeks; 20–25 g) housed in a room with controlled temperature, humidity, and a 12 h light-dark cycle.\nAnesthetize the animal using isoflurane: induction concentration 3%–5%, maintenance concentration 2%–3%, and concentration during clamping 1%–1.5%. Confirm the depth of anesthesia by the loss of reflexes. Inhalation anesthesia has the advantage that the time can be adjusted. The procedure might take a significant amount of time because of the exfoliation of the tissue surrounding the kidney. However, the disadvantage of inhalation anesthesia is that the body temperature tends to fall. Throughout the procedure, avoid unnecessary anesthesia.\nMount the anesthetized mouse on a heated surgical pad on its back, remove the hair surrounding the incision area, and spray the abdominal skin of the mouse with 70% ethanol.\nMake a midline incision in the abdominal skin, muscle, and peritoneal membrane using scissors and forceps.",
    "Using a cotton swab moistened with PBS, gently push the bowel toward the left side of the extra-abdominal cavity, exposing the right kidney and ureter. The long procedure time is likely to cause postoperative intestinal injury. Thus, it is better to operate without removing the intestines from the abdominal cavity when a visual field can be obtained. Avoid drying out the intestines. Dry swabs or gauze can cause intestinal damage.\nLift the right ureter with angled forceps. Ligate the right ureter twice using 4/0 silk-braided sutures. Cut between the sutures, leaving the suture that is closer to the kidney longer.\nCarefully hold the remaining suture without pulling too much, and bluntly dissect the connective tissue and fat along the kidney. Performing surgery from behind reduces the risk of liver damage.\n\t\nIdentify a blood vessel, other than the renal arteries and veins, that supplies blood to the right kidney, and then ligate or clip it. When the right kidney is sufficiently detached, ligate the right renal artery and vein using a 4/0 silk-braided suture. Instead of suturing, use a hemostatic clip.\nUsing a cotton swab moistened with PBS, gently push the intestine towards the right side of the extra-abdominal cavity to expose the left kidney, and then cover the intestine with a moistened drape to prevent it from drying out. Dissect the connective tissue and fat around the left kidney.\nIdentify a blood vessel, other than the renal arteries and veins, that supplies blood to the left kidney, and then ligate or clip it. Clamp the renal artery and renal vein to induce left kidney ischemia. Position the hemostatic clip approximately 1 cm from the kidney to avoid damage to the renal parenchyma. Successful ischemia can be visually confirmed by a gradual uniform darkening of the kidney.",
    "Return the intestines to the abdominal cavity, taking care to avoid intestinal twisting; temporarily close the abdominal skin and drape to maintain a moist environment. Reduce the concentration of inhalation anesthesia as much as possible and try to keep the animal warm. The clamping time is 25–45 min. A longer clamping time induces more severe renal damage but also increases long-term mortality. Adjust by analyzing the pathology results.\nRemove the clamp after the period of ischemia has concluded. Ensure that blood flow reperfusion and kidney color improve. Confirm that the bowel is not twisted before closing the abdominal skin. Instill PBS intraperitoneally as a volume supplement before the abdomen is closed in two layers. Close the abdominal skin using 4-0 nylon sutures. For longer renal removal periods, the possibility of intestinal adhesions may be reduced by separately closing the abdominal wall and peritoneum.\nTo minimize the risk of post-operative infection, apply an antiseptic (e.g., iodine/alcohol solution) to the surgical area.\n2. Kidney sample collection\nNOTE: This video has a 45 min clamping time, collecting the kidneys 24 h later.\nAnesthetize the animal with 5% isoflurane and confirm the depth of anesthesia by the loss of reflexes.\nMake a midline incision in the abdominal skin, muscle, and peritoneal membrane using scissors and forceps. Collect the blood from the inferior vena cava punctured by a 27 G needle.\nMake a midline incision in the chest wall and insert a 23 G needle into the left ventricle. Confirm backflow. Make an incision in the liver and inject 20 mL of PBS. As the blood drains, the liver changes color from red to pink, confirming that sufficient blood has been drained.",
    "Remove the left kidney using forceps and scissors and wash it with PBS in a Petri dish. Remove the renal fascia using forceps, being careful not to dry out the kidney.\nCut the kidney in half and use one half for histopathology and the other half for the next step. Avoid the renal pelvis, and harvest 30 mg of the kidney. Store this at −80 °C before use.\n3. Purifying miRNAs from kidney samples\nNOTE: Here, kidney samples weighing 30 mg are homogenized using a glass homogenizer and a biopolymer-shredding system in a microcentrifuge spin column. Subsequently, miRNA from the kidney sample is isolated using a silica-membrane-based spin column.\nPrepare the following items: 1.5 or 2.0 mL microcentrifuge tubes, 100% ethanol, chloroform, a glass homogenizer, ice, a biopolymer-shredding system in a microcentrifuge spin column9, silica-membrane-based spin columns9, phenol/guanidine-based lysis reagent, wash buffer containing guanidine and ethanol (wash buffer 1), and wash buffer containing ethanol (wash buffer 2).\nPlace a 30 mg kidney sample into a glass homogenizer and add 700 µL of phenol/guanidine-based lysis reagent. Perform this step on ice because the tissue is denatured by heat.\nHomogenize the kidney sample by slowly pressing the pestle onto the sample by twisting it. Repeat this process several dozen times on ice until the kidney sample has completely dissolved into the phenol/guanidine-based lysis reagent. When miRNA is not obtained in subsequent measurements, this is likely because of insufficient dissolving.\nFor further homogenization, transfer the homogenized lysate to the biopolymer-shredding system in a microcentrifuge spin column placed in a 2.0 mL collection tube. Centrifuge this at 14,000 × g for 3 min at room temperature.\nTransfer the homogenized lysate to a new microcentrifuge tube.",
    "Add 140 µL of chloroform to the homogenized lysate and cap the tube securely. Mix the tube by inversion for 15 s.\nIncubate the samples for 2–3 min at room temperature. Then, centrifuge them at 12,000 × g for 15 min at 4 °C.\nTransfer the supernatant (normally 300 µL) to a new microcentrifuge tube without disturbing the precipitate and add 1.5 volumes (normally 450 µL) of 100% ethanol. Mix the sample by vortexing for 5 s.\nPipette up to 700 µL of the sample into a silica-membrane-based spin column placed in a 2.0 mL collection tube. Close the column cap, and centrifuge at 15,000 × g for 15 s. Following centrifugation, discard the flow-through in the collection tube.\nAdd 700 µL of wash buffer 1 to the silica-membrane-based spin column to thoroughly wash the sample. Close the cap of the column, and centrifuge it at 15,000 × g for 15 s. Following centrifugation, discard the flow-through in the collection tube.\nAdd 500 µL of wash buffer 2 to the silica-membrane-based spin column to remove any traces of salt. Close the cap of the column, and centrifuge at 15,000 × g for 15 s. Following centrifugation, discard the flow-through in the collection tube.\n\t\nRepeat step 3.11.\nCentrifuge the silica-membrane-based spin column again at 15,000 × g for 1 min. Following centrifugation, discard the flow-through in the collection tube.\nPlace the silica-membrane-based spin column in a new 1.5 mL collection tube. Transfer 25 µL of RNase-free water into the column, and close the column cap. Leave the sample at room temperature for 5 min, and then centrifuge it at 15,000 × g for 1 min.",
    "Transfer the 25 µL eluate containing miRNAs to a new microcentrifuge tube. Because miRNA is degraded by repeated dissolution, it is recommended to dispense the sample into 2 or 3 tubes. Store these at −80 °C before use.\n4. Reverse transcription of miRNA\nNOTE: Here, 1.0 µg of isolated RNA is reverse-transcribed using reverse transcriptase, poly(A) polymerase, and oligo-dT primers.\nPrepare the following items: 1.5 mL microcentrifuge tubes; 8-well strip tubes; RNase-free water; ice; a 10x Nucleic Acid Mix containing deoxynucleotides, ribonucleotide triphosphates, and oligo-dT primers; a poly(A) polymerase and reverse transcriptase mix; and activating buffer, including Mg2+, deoxyribonucleotides, oligo-dT primers, and random primers10.\nPrepare a master mix solution containing 2.0 µL of 10x Nucleic Acid Mix, 2.0 µL of poly(A) polymerase and reverse transcriptase mix, and 4.0 µL of 5x activating buffer, including Mg2+, deoxyribonucleotides, oligo-dT primers, and random primers, for a total of 8.0 µL per tube.\nDispense 8.0 µL of the master mix solution into each tube.\nAdd 1.0 µg of isolated miRNAs purified from the kidney sample to each tube.\nAdd RNase-free water to each tube to a total of 20 µL. Mix thoroughly by pipetting, and centrifuge at 1,500 x g for 15 s.\nIncubate the samples for 60 min at 37 °C, followed immediately by incubation for 5 min at 95 °C. This step can be performed in a thermal cycler.\nTransfer the cDNA to a new microcentrifuge tube and dilute 10 times (1:10) with RNase-free water.\nStore the diluted cDNA short term on ice and long term at −80 °C before use.\n5. qRT-PCR of miRNA\nNOTE: qRT-PCR of miRNA is performed using an intercalating dye. Here, primers for U6 small nuclear 2 (RNA-2), miRNA-17-5p, miRNA-18a-5p, miRNA-21a-5p, miRNA-132-3p, miRNA-212-3p, miRNA-223-3p, and miRNA-574-5p were used.",
    "Prepare the following items: 1.5 mL microcentrifuge tubes, 96-well reaction plates for qRT-PCR, adhesive film for the 96-well reaction plate, miRNA-specific primers, PCR Master Mix comprising Taq DNA polymerase, PCR buffer, deoxynucleotides, and universal primers10, and a real-time PCR Instrument.\nPrepare a master mix containing 12.5 µL of 2x PCR Master Mix, 2.5 µL of each miRNA primer (5 µM) dissolved in nuclease-free water, and 1.25 µL of 10x universal primers for each well.\nDispense 22.5 µL of the master mix into each well of the 96-well plate.\nAdd 2.5 µL of template cDNA to each well.\nSeal the plate with the adhesive film for the 96-well reaction plate. Then, centrifuge the plate at 1,000 × g for 30 s.\nUsing the real-time PCR instrument and software, run the PCR cycling program as follows.\n\t\nPlace the plate in the real-time PCR instrument. Assign a name to the sample and target miRNA in each well using the Real-Time PCR software.\nInput the following PCR cycling conditions in the real-time PCR software according to the instructions: preincubation at 95 °C for 15 min, followed by 40 cycles of denaturation at 94 °C for 15 s, annealing at 55 °C for 30 s, and extension at 70 °C for 30 s.\nAnalyze the qRT-PCR data using the software of the real-time PCR instrument. Check for non-specific reactions. Analyze the Dissociation curve or the Melt curve to confirm that amplification other than the intended one has not occurred.\n\t\nNormalize the expression level of target miRNAs to RNU-6 as an endogenous control. Calculate the relative expression level of target miRNAs using the 2−ΔΔCT method11.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}