{
  "id": 8834,
  "origin_website": "Jove",
  "title": "Establishing a Mouse Model of a Pure Small Fiber Neuropathy with the Ultrapotent Agonist of Transient Receptor Potential Vanilloid Type 1",
  "procedures": [
    "All the procedures described are in accordance with ethical guidelines for laboratory animals30, and the protocol has been approved by the Animal Committee of Kaohsiung Medical University, Kaohsiung, Taiwan.\n1. Establishment of RTX Neuropathy\nCAUTION: RTX is neurotoxic and hazardous. On contact, it acts as an irritant to the eyes, mucous membranes, and upper respiratory tract. Avoid inhalation and wear lab eyeglasses and coats during RTX preparation. Rinse with plenty of water in case of skin contact or after handling.\nAdd 1 mg of RTX powder to a 200 µL of mixture of equal volume of Tween 80 and absolute ethanol (100 µL for each solvent).\nAliquot the RTX solution (12 µL/vial) and store at -20 °C, for up to 3 months. This constitutes the RTX stock; discard the remaining RTX solution at expiration.\nDilute the RTX stock with normal saline to a final volume of 600 µL. The final concentration of the RTX solution should be 0.01%, which equals 1 µg RTX in 10 µL vehicle solution.\nUse 8-week-old adult male ICR mice (35-40 g) as experimental animals and administer a single dose of RTX solution (dose: 200, 50, and 10 µg/kg, respectively) intraperitoneally (i.p.) with a microinjection syringe to the mice. Mice was anesthetized by inhaler with 5 % isoflurane for deep anesthesia. If mice showed withdrawal action of extremities during RTX injection, mice should take longer inhalation of anesthesia.  \n\tExample: If the mouse weighs 40 g, then it will receive 20 µL of the RTX solution, representing the dose of 50 µg/kg.\nGive one group of mice an equal volume of vehicle (10% Tween 80 and 10% absolute ethanol in saline solution), as a control.",
    "After RTX injection, return the mice to a plastic cage on a 12-h light/12-h dark cycle and provide food and water ad libitum.\n2. Evaluation of Neuropathic Behavior\nNOTE: Maintain the animals in a comfortable environment (step 1.6) to allow recovery after injection. At day 7 post RTX injection (D7), each animal performs the hot plate and von Frey hair filament tests on the same day to reduce time bias and promote the efficiency of the behavioral tests. Bring the animals to a quiet room that is maintained at a stable humidity (40%) and temperature (27 °C) for optimizing animal acclimatization and reducing environmental effects during the behavioral testing. Do not disturb the animals during test periods; the behavioral tests are scheduled weekly.\nMeasurement of thermal latencies with the hot plate test\n\t\nPlace the animal gently on a metal hot plate (27 cm × 29 cm) with a transparent Plexiglas cage (length × width × height: 22 cm × 22 cm × 25 cm; Figure 1A). Set the temperature of the metal hot plate to 52 °C.\nStart measuring the duration of the animal's thermal latency on the hot plate with the step-on, built-in timer of the hot plate once the animal's hindpaws touch the hot plate, and observe the responses of the animal's hindpaws. If the animal shows shaking, licking of hindpaws, or jumping while on the hot plate, remove it and record the duration that the animal remained on the hot plate. This time duration defines the thermal latency of an individual animal. Record the thermal latency to the nearest 0.1 s.",
    "For each test session, perform three trials with 30-min intervals for response normalization after the last hot plate test. If the animal shows no response on the hot plate, stop the session after 25 s to avoid potential tissue damage.\nMeasurement of mechanical threshold with the von Frey hair filament test\n\t\nPut the animal on the customized metal mesh (mesh size: 5 mm × 5 mm) with a semi-transparent cylinder Plexiglas cage (diameter: 13 cm; height: 12 cm) (Figure 1B) for acclimatization for at least 2 h.\nApply the different calibers of the von Frey hair filaments to the plantar region of the hindpaw with the up-and-down method31. Start initial application from the middle force of a set of von Frey hair filaments for a duration of filament application of 5-8 s.\nUse a 2 min interval between filament applications to optimize animal normalization. Change the applied filament force based on the animal's last response.\n\t\tNOTE: A set of von Frey hair filaments consists of 0.064, 0.085, 0.145, 0.32, 0.39, 1.1, and 1.7 g force application. For example, if hindpaw withdrawal occurred with an initial force of 0.32 g, then apply 0.145 g. In the absence of paw withdrawal, a 0.39 g force is then applied. Then four additional filaments of varying forces are applied based on the preceding responses and the mechanical threshold is calculated according to a published formula31.\nFor each test session, include the bilateral hindpaws. Perform three trials for each hindpaw. Express the average of these six mechanical thresholds as the mean mechanical threshold (mg) of each animal.\nimgsrc://cloudfront.jove.com/files/ftp_upload/56651/56651fig1.jpg",
    "Figure 1. Custom-made Plexiglas cage and metal mesh for the evaluation of neuropathic pain in the mouse model of resiniferatoxin (RTX)-induced small fiber neuropathy. (A, B) These graphs show the equipment used to measure (A) the thermal latencies by a metal hot plate (27 cm × 29 cm) with a transparent Plexiglas cage (length × width × height: 22 cm × 22 cm × 25 cm) and evaluate (B) the mechanical threshold by a customized metal mesh (mesh size: 5 mm × 5 mm) with a semi-transparent cylinder Plexiglas cage (diameter: 13 cm; height: 12 cm) in the mice with RTX-induced small fiber neuropathy. Please click here to view a larger version of this figure.[href=https://www.jove.com//cloudfront.jove.com/files/ftp_upload/56651/56651fig1large.jpg]\n3. Skin Biopsy Preparation and Evaluation of IENFs Innervation\nAfter behavior testing, anesthetize the animals with 5% isoflurane and sacrifice the animals by intracardiac perfusion with 0.1 M phosphate buffer (PB) (pH 7.4) followed by 4% paraformaldehyde (4P) in 0.1 M PB.\nCut the first footpads of the two hindpaws after perfusion and post-fixate them in 4P for another 6 h. Transfer the footpad tissue to 0.1 M PB at 4 °C for long-term storage.\nCryoprotect footpads with 30% sucrose in PB overnight and cut in a vertical to plantar surface manner in 30-µm thick slices. Label the footpad sections sequentially, and then store in antifreeze at -20 °C.\n\tNOTE: The antifreeze composition is as follows: distilled water, ethylene glycerol, glycerol, and 2x PB in a 3:3:3:1 ratio.\nTo ensure adequate sampling, select every third section of the footpad.\n\t\nPut the chosen footpad sections on coated glass slides and air-dry them.\nCover a plastic coverplate on the slide and process with standard immunostaining procedures.",
    "Quench the footpad sections with 1% H2O2 in methanol for 30 min and block with 0.5% nonfat dry milk and 0.1% Triton X-100 in 0.5 M Tris buffer (Tris) for 1 h.\nIncubate footpad sections with antisera against pan axonal marker, PGP 9.5 (raised in rabbit; 1:1,000), overnight at 4 °C.\nIncubate footpad sections with a biotinylated goat anti-rabbit IgG secondary antibody at room temperature (RT) for 1 h, and then incubate with the avidin-biotin complex at RT for 45 min.\nVisualize the reaction product with 0.05% 3,3'-diaminobenzidine (DAB) solution for 45 s. Then wash footpad sections with distilled water and air-dry them for mounting.\n\t\t\tNOTE: The primary and secondary antisera are diluted with 0.5% nonfat dry milk in 0.5 M Tris.\n4. DRG Section Preparation and Evaluation of Injured Small-diameter Neurons\nDissect the 4th and 5th lumbar DRG and post-fix for another 2 h.\nCryoprotect DRG tissues with 30% sucrose in PB overnight and cut to an 8-µm thickness sequentially, place on microscope slides, and label. Store DRG sections in a -80 °C freezer.\nImmunostain DRG sections in 80 µm-intervals to ensure adequate sampling.\n\t\nPerform DRG immunostaining procedures as those of the footpad sections, except for the double-labeling immunofluorescent procedures. Alternatively, include ATF3 (raised in rabbit; 1:100), an injury marker, and peripherin (raised in mouse; 1:800), a small-diameter neuronal marker in the primary antisera.\nIncubate DRG sections with the mixture of primary antisera overnight at 4 °C.\nIncubate DRG sections with either Texas red or fluorescein isothiocyanate (FITC)-conjugated secondary antisera (1:200), corresponding to the appropriate primary antisera at RT for 1 h, and then mount for quantification.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}