{
  "id": 4810,
  "origin_website": "Bio",
  "title": "Transverse Sectioning of <em>Arabidopsis thaliana</em> Leaves Using Resin Embedding ",
  "procedures": [
    "Fixation: Dissect and fix whole Arabidopsis leaf blades under a vacuum in a solution of 5% acetic acid, 5% formaldehyde and 50% ethanol for an hour. Alternatively, ethanol:acetic anhydride (3:1) with a drop of Tween-20 can be used for fixation. Fixation is preferentially performed in glass vials to allow visualization of the leaves and multiple replicate leaves from a single stage/treatment can be treated in the same volume. The samples should sink as this is indicative of a good penetration of the fixative. Store the leaves overnight in the same fixation solution at 4 °C.   Rinse: Rinse the fixed leaf samples with phosphate buffer (pH 7.2).   Dehydration: Dehydrate the tissues by sequential incubations (Note 1) in a volume of ethanol sufficient to submerge freely specimens floating, without being constricted by the side walls of the container: - 30% ethanol for 4 h - 50% ethanol for 4 h - 70% ethanol for 4 h, overnight or sample can be stored at 4 °C for a maximum of 2 weeks - 80% ethanol for 4 h - 90% ethanol for 4 h - 95% ethanol for 4 h or overnight at 4 °C - 98% ethanol for 1 h - 99% ethanol for 1 h - 100% ethanol for 1 h. Repeat this step one more time.   Pre-infiltration: To replace the ethanol with Technovit 7100 resin (Figure 1a) perform following steps (Note 2): - 30% Technovit solution and 70% ethanol (consisting of 100% ethanol) for 15 h - 50% Technovit solution and 50% ethanol (consisting of 100% ethanol) for 15 h - 70% Technovit solution and 30% ethanol (consisting of 100% ethanol) for 15 h   Infiltration: Replace the above solution with 100% Technovit solution and incubate for 15 h at room temperature.",
    "Polymerization: Place the leaf samples in molds (Figure 1b-f) or microcentrifuge tubes (Figure 1g-h) and add Technovit solution with hardener-II. Let it polymerize overnight at 37 °C in a closed environment i.e. cover the molds or cap microcentrifuge tubes to avoid evaporation (Note 3). Samples can be embedded horizontally in the molds as shown in Figure 1e or flat molds can be made between 2 overhead projection transparencies (Beeckman and Viane, 1999), which are then re-embedded vertically in microcentrifuge tubes.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150917/20150917030700_2443.jpg Figure 1. Subsequent steps of the protocol. a. overview of the work space; b-c. preparing and adding Technovit solution with hardener–II to the molds; d-e. placing the sample at the desired orientation; f. polymerized resin block containing sample (arrow); g-h. alternatively PCR tubes can be used as molds; i. resin block attached to microtome sample holder; j. samples on a slide placed on the heated plate; k. transverse, stained section of leaf visualized using a bright field microscope.    Position the polymerized samples horizontally (Figure 1i) in the microtome to obtain the transverse sections. Make the sections of required thickness (in this case 2 μm) with a glass knife on the rotary microtome.   Take the piece of section with tweezers and place it into a drop of water on an object slide.   Place the object slide on the heated plate at 30-40 °C and let it dry (Figure 1j).   Staining: Stain the sections on the object slide with a 0.05% (w/v) solution of toluidine blue for 10 min and rinse with distilled water for 1 min.   Dry the sections on the object slide at 30-40 °C on the heated plate and mount the cover slip using DEPEX as a mounting agent.",
    "Take pictures of the sections at 20x or 40x magnification with a bright field microscope fitted with a digital camera (Figure 1k)."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Plant Science"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}