{
  "id": 16499,
  "origin_website": "Jove",
  "title": "Evaluating the Effect of Pesticides on the Larvae of the Solitary Bees",
  "procedures": [
    "1. Preparation of the feeding tube\nPunch a hole (~0.3 mm diameter) into the lid of a 2 mL centrifuge tube using an electric winding iron (see Table of Materials). Use such a centrifuge tube to maintain an O. excavata larva and its provision mass.\n2. Preparation of pesticide\nDissolve the technical-grade pesticide (see Table of Materials) in acetone to acquire stock solutions of 1 x 104 µg a.i. mL-1. Then, perform gradient dilutions of the solution to more than five concentrations.\n\tNOTE: Chlorpyrifos at 0.1, 0.2, 0.4, 0.8, 1.6, 3.2, 6.4 µg a.i. mL-1 were used in this study.\n3. Preparation of the provisions\nAcquire plastic bee tubes containing provisions (see Table of Materials) and newly hatched larvae of O. excavata from a mass-rearing program.\n\tNOTE: No pesticides were used from 20 days before flowering to the entire flowering period; chemical analysis results showed that commonly used pesticide contents in randomly selected fifty provisions were both below the minimum test levels.\nSeparate provisions and larvae gently using a soft brush. Select female larvae based on provision size and cell position within the nest9. Then, place uniform-sized provisions and selected female larvae in Petri dishes (60 mm diameter) and set them aside for use.\n\tNOTE: Fifty provisions were randomly selected to analyze the contents of commonly used pesticides: chlorpyrifos, imidacloprid, fendifenuron, phoxim, avermectin. The soft brush parameters are (a) diameter of the brush: 0.3 mm, (b) length of the brush: 2 cm, (c) length of the pen: 18 cm.\n4. Provision treatment with pesticide\nSoak the selected evenly sized provisions (from step 3.2) in diluted pesticide (from step 2.1; chlorpyrifos at 0.1, 0.2, 0.4, 0.8, 1.6, 3.2, 6.4 µg a.i. mL-1) for 10 s using a cage. Soak the control check (CK) in 0.2% solvent (acetone in this study).",
    "NOTE: There are three replicates per concentration treatment, and each replicate consisted of 60 provisions. The difference of dosage of each provision can be reduced by selecting evenly sized provisions.\nMeasure the volume of pesticide solution before and after treating the provisions with the pesticide. Then, calculate the immersed volume of insecticide in each treatment, including 60 mass provisions (Supplementary Table 1). Place the provisions in separate centrifugal tubes with holes (from step 1.1) after air-drying on a sterile worktable.\n\tNOTE: Before the experiment, put the cages containing the provisions into the pesticide solution, and then measure the volume of pesticide solution before and after soaking to eliminate the error.\nTransfer female larvae individually to the surface of naturally dried provisions using a soft brush.\n\tNOTE: One larva in one tube.\n5. Growth conditions\nRear the larvae of O. excavata in a growth chamber in the dark, 65%-75% relative humidity, and 25 ± 2 °C16.\n6. Examination of the results\nThe acute lethal toxicity test\n\t\nMeasure the mortality of the larvae after placing them onto the treated and the control (CK) provisions for 48 h.\n\t\tNOTE: The death criteria: when the larvae did not respond to mild touch using a soft brush under black-light lamps22. Black-light lamps were used to simulate the dark growth conditions of larvae and avoid the influence of light on the larvae when checking growth indicators. For eliminating human error, the mortalities with and without removal of larvae from the provisions after 48 h in control groups were also measured.\nWeigh 60 provisions before and after 48 h of insect rearing trials to determine the amount of provision consumed by each larva.",
    "Calculate the dose of pesticide at each concentration consumed by each larva according to the percentage of provision eaten and the pesticide content in each provision.\n\t\tNOTE: The equation for dose calculation is23:\nimgsrc://cloudfront.jove.com/files/ftp_upload/62946/62946eq01.jpg\n\t\twhere, D is the consumed dose of pesticide by each larva; W1 is the weight of 60 provisions before infusion of pesticide; W2 is the remaining weight of 60 provisions after 48 h; V1 is the volume of pesticide before immersion for 60 provisions; V2 is the volume of pesticide after immersion for 60 provisions; C is the concentration of the pesticide.\nThe sublethal toxicity test\n\t\nWeigh the larvae before rearing trials and after 14 days of treatments to determine the larval weight gain.\nObserve O. excavata daily during cocooning under black-light lamps to measure the larval development duration.\nWeigh the remaining portions of provisions after 14 days of feeding on treated and CK provisions to calculate the consumption and the efficiency of conversion of ingested food (ECI)24.\nExamine the number of eclosions by sniping the cocoons using a small scissor when the control bees emerge into adults.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}