{
  "id": 11008,
  "origin_website": "Jove",
  "title": "Longitudinal Measurement of Extracellular Matrix Rigidity in 3D Tumor Models Using Particle-tracking Microrheology",
  "procedures": [
    "1. Culturing Tumor Spheroids\nMix 10 ml of cell culture grade water with 0.1 g of agarose to obtain a 1% agarose solution.\nHeat agarose solution to above 70 °C (roughly 14 sec in a standard microwave or by using a heating plate) before aliquoting 40 μl of agarose solution into a well on a 96-well plate.\nIncubate plate at 37 °C for at least 1 hr while harvesting cells using standard techniques.\nUse a hemacytometer to determine the concentration of cells in the suspension.\nDilute cell suspension to 1,000 cells/ml and add 100 µl of this dilution to the well containing the cured agarose bed.\nPlace the sample on a shaker overnight in an incubator set at 37 °C and 5% CO2.\nRemove sample from shaker and add 100 µl of cell culture media.\nIncubate spheroids until desired diameter is reached. For example, after 9 days, a spheroid will be approximately 450 µm in diameter. During this time, fresh growth media can be added to the wells but aspiration should be avoided since this will result in removal of the spheroid.\n2. Preparing 3D Tumor Spheroids Embedded in ECM\nPrepare a work station with needed materials inside a laminar flow hood.\nPrepare a diluted mixture of carboxylate-modified 1 μm diameter fluorescent tracer probes by adding 2 parts stock probes (2% solids) to 25 parts sterile water.\nRemove a bottle of 3.1 mg/ml bovine collagen from the refrigerator and place it on ice.\nAliquot 125 μl of collagen into an empty 2 ml vial.\nAdd 50 μl of diluted tracer probe solution to the vial containing the collagen and vortex briefly to distribute probes.",
    "Add 235 μl of appropriate cell culture media containing phenol red (which will turn yellow) for a total volume of 410 ml and vortex briefly before removing 205 ml (half the total volume) and placing it in a new 2 ml vial. Vial 1 will contain the tumor spheroid and Vial 2 will be a control mixture.\nAdd ~2 μl of 1 M NaOH to Vial 1 to bring the solution back to neutral pH (culture media containing phenol red should return to red). Note that this will cause the mixture to begin curing if it is not kept on ice. Vortex briefly to mix, then return to ice rack immediately.\n\tNOTE: The spheroid is barely visible to the naked eye after 9 days of culture and its removal from the agarose bed is a delicate task. Use of a dissection microscope may be helpful for some users. Maintaining the integrity of the spheroid during transfer is paramount.\nUsing a wide-mouth pipette tip, gently remove 40 μl of media from the well containing the tumor spheroid. Retain this 40 μl while conducting the next step.\nCheck the well to see if the spheroid was removed in the previous step. If it was, add the 40 μl containing the spheroid to Vial 1. If not, place the 40 μl back into the well and repeat the previous step.\nGently stir Vial 1 (do not risk vortexing, it may damage the spheroid) before transferring the mixture in 60 μl portions into three separate wells of a 96-well plate. Inspect each well with a microscope after adding mixture to determine which well contains the spheroid.",
    "Add ~2 μl 1 M NaOH and 40 μl of cell culture media to Vial 2 and vortex before aliquotting 60 μl of this mixture to an empty well in the 96-well plate and labeling as a control.\nPlace the plate in a 37 °C incubator to cure for at least 1 hr.\n3. Construct Grid of Sample Points and Take a Video at Each Point\nTransfer the sample plate from the incubator to the microscope stage. Allow 10 min for the sample to equilibrate with the room temperature if a heated stage is not available.\nObserve the sample with low powered objective lenses to make sure it is intact and ready for imaging. Determine the tumor position within the well.\nDecide how many sample points to take. Typically, 20 sample points in each well, distributed in concentric rings around the spheroid will produce adequately detailed results.\nMove the stage to each desired position and use microscope interfacing software to record the x and y coordinates (or record coordinates manually if interfacing software is unavailable).\nSwitch the microscope to a high powered objective lens (typically 100X), and select the appropriate filter cube for the excitation wavelength of the tracer probes. Use the list of points created in step 3.4 to move to the first point in the grid.\nAdjust the focus to find the bottom of the well, then move up to find a field of view (fov) containing several in-focus tracer probes.\nObserve the intensity histogram and adjust the exposure intensity and time to give the greatest dynamic range possible while ensuring that the image does not become saturated.",
    "Obtain a video sequence at a frame rate of 20-30 msec per frame (approximately 800 frames or 16-24 sec in length is recommended to provide sufficient statistics for robust MSD calculation balanced with the need for minimizing acquisition time at each spatial grid point) and save with an appropriate convention. During the recording, do not touch the microscope or table.\nRepeat steps 3.6 to 3.9 for each sample point in the grid.\nRepeat steps 3.3 to 3.10 for each well in the experiment.\n4. Analyze Video Data to Compute Rheological Properties at Each Sample Point\nCopy all video data to an analysis folder (possibly on a different computer).\nImport image data into MATLAB or other analysis software.\n\tNOTE: Extensive documentation regarding the set of MATLAB particle tracking routines adopted here is available at http://people.umass.edu/kilfoil[href=http://people.umass.edu/kilfoil/]. The use of a custom calling function for automating processing of multiple files at different positions is recommended.\nCalibrate the software by analyzing several frames of the video to appropriately determine selection and rejection parameters (size, bandpass, etc) for identifying probe center positions. Extensive background for these crucial steps is described by Crocker and Grier.\nUse the software to automatically determine each probe position for all video frames and then link these positions into trajectories.\nUse the trajectory data to compute the mean squared displacement (MSD) as a function of lag time, being sure to apply the appropriate spatial calibration factor (μm per pixel) for the specific objective lens, any pixel binning, etc (typically carried in meta-data).\nCalculate G*(using the generalized Stokes-Einstein relation taken into consideration the limits of applicability of GSER for a particular sample24,28,43. Alternatively, users may wish to interpret ECM properties directly from MSD by simply comparing power law scaling, plateau values, indices of heterogeneity or other parameters.",
    "Repeat steps 4.2 through 4.6 for each fov in the experiment.\nCo-register position data from step 3.4 with viscoelastic modulii at a particular frequency of interest. Depending on the manufacturer of the microscope used, this step can be facilitated by a custom routine which reads microscope metadata or position data can be tabulated manually.\nUse 3D interpolation functions to generate a spatial rheology map of the ECM.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}