{
  "id": 18089,
  "origin_website": "Jove",
  "title": "Application of End-to-end Anastomosis in Robotic Central Pancreatectomy",
  "procedures": [
    "Written informed consent was obtained from the patient for the publication of this report and any accompanying videos and images.\n1. Preoperative Preparation\nCarefully evaluate the preoperative images of CT or MRI for the exact location of the tumor and its relation to the surrounding tissues.\nGive the patient a soft diet one day before the operation and begin fasting at midnight before the operation.\nPlace the patient on the operating table. Then, place a peripheral venous catheter and induce general anesthesia using standard procedures. Introduce a central venous catheter through the right internal jugular vein for medication fluids and a peripheral arterial catheter for blood pressure monitor.\n2. Patient's Position and Port Placement\nPlace the patient in supine and 20° reverse Trendelenburg position with the legs split. Drape in normal sterile fashion for upper abdominal surgery.\nPosition the surgeon console at the left side of patient. Place the patient cart over the patient's head and the vision cart at the right side of the patient, respectively. Have the assistant surgeon stand between the patient's legs to perform the procedures. Position the back table for the instruments and supplies (see Table of Materials) at the left rear of the assistant.\nMake a 1-cm incision with the scalpel 3 cm inferior and right lateral to the umbilicus. Insert a Veress needle into the abdominal cavity through this incision, and establish a CO2 pneumoperitoneum of 14 mmHg with the automatic insufflation instrument.\nRemove the Veress needle and then insert a 12-mm trocar through the 1-cm incision as the camera port. Insert the robotic endoscope and perform a diagnostic laparoscopy (have the assistant surgeon hold the robotic endoscope) to confirm the abdominal adhesion status and operative feasibility. Insert the remaining 4 trocars as follows under the view of the endoscope.",
    "Place an 8-mm trocar in the left anterior axillary line (Figure 2) at the level of the umbilicus for the first robotic arm. Place a 12-mm trocar 2 cm inferior and left lateral to the umbilicus (Figure 2) as the assistant port.\nPlace a 12-mm trocar in the right midclavicular line (Figure 2) at the level of the umbilicus. Insert an 8-mm trocar into this 12-mm trocar in a \"trocar in trocar\" fashion for the second robotic arm. Place an 8-mm trocar under the costal margin in the right middle axillary line for the third robotic arm (Figure 2). After the docking of robotic army, dock the robotic endoscope in the camera arm.\n3. Mobilization of the Pancreas Neck and Body\nGrasp and keep elevating the anterior wall of the stomach by forceps on the third robotic arm to expose the gastrocolic ligament.\nTension the gastrocolic ligament with the bipolar forceps in the second robotic arm and the grasping forceps in the assistant's hand. Divide the gastrocolic ligament to enter the lesser sac and expose the anterior surface of the pancreas with the laparoscopic ultrasonic scalpel on the first robotic arm. Perform hemostasis with bipolar forceps on the second robotic arm, until reaching the level of the right gastroepiploic vein.\nCarefully dissect the pancreatic neck from the superior and inferior direction with the cautery hook. Proceeding from the inferior to superior direction, divide the posterior wall of the pancreatic neck from the portal vein (PV), superior mesenteric vein (SMV), inferior mesenteric vein (IMV), and splenic vein (SV) with the cautery hook. Afterwards, create a tunnel between the PV-SMV-IMV-SV and posterior wall of the pancreatic neck.\nDissect the pancreatic body from the splenic vessels and connective tissues towards the pancreatic tail with the cautery hook and ultrasonic scalpel.",
    "4. Transection of the Pancreatic Parenchyma\nInsert the laparoscopic ultrasound probe through the assistant trocar and perform the ultrasonography on the pancreas to reconfirm the location and size of the lesion. According to the result of the ultrasonography, mark two transection lines at about 1 cm away from the lesion, on the pancreatic surface with the cautery hook.\nLift the pancreatic body with the forceps inserting through the inferior margin of the pancreas and further detach the proximal part of pancreatic body from the splenic vessels and connective tissues with the cautery hook or ultrasonic scalpel.\nAfter mobilizing the pancreatic neck and proximal pancreatic body form the posterior vessels and tissues, incise the pancreas parenchyma along the distal and proximal transection line with the ultrasonic scalpel and expose the pancreatic duct. Then transect the parenchyma around the pancreatic duct.\nCarefully protect and mobilize the pancreatic duct from the transected pancreatic parenchyma. Then sharply transect the pancreatic duct about 1 cm away from the stump, using laparoscopic scissors from the assistant port.\n5. Reconstruction of the Pancreatic Continuity\nTo reduce the tension of anastomosis, further mobilize the pancreatic stump from the posterior vessels and connective tissues, using the cautery hook and bipolar forceps.\nBased on the size of the pancreatic duct stumps, choose a 10-cm plastic pancreatic stent with a proper diameter (1.2 mm in diameter in this case). Cut both ends of the stent to oblique planes and make several side perforations. Implant the stent into the abdominal cavity through the assistant port.",
    "Hold the side wall of pancreatic duct stump in the pancreatic body with micro forceps, and insert the stent caught by the needle driver into the distal pancreatic duct stump gently. Suture the pancreatic duct with the stent by using 5-0 absorbable suture, so that the stent is closely encircled by the pancreatic duct.\nInsert the other end of the stent into the proximal pancreatic duct stump using a similar approach but without suture.\nSuture the proximal and distal pancreatic stumps using the horizontal mattress suture (4-0 non-absorbable suture).\nPull the two pancreatic stumps closer, and continue to insert the proximal end of stent into the proximal pancreatic duct stump. Finally, keep the whole stent within the pancreatic duct and do not bring it into the duodenum lumen.\nPerform the end-to-end anastomosis of the pancreatic duct stumps using interrupted suture with 5-0 non-absorbable suture.\nKnot the remaining ties on the pancreatic stumps.\nSuture the anterior portion of the pancreatic stumps using continuous suture with 4-0 non-absorbable suture (Figure 3).\n6. Hemostasis and Drainage\nCarefully check for bleeding sites and conduct thorough hemostasis. Encircle the anastomosis site with absorbable hemostatic gauze.\nPut the resected specimen in the plastic bag and remove the bag from an enlarged incision in the camera port.\nPlace two drains along the superior and inferior border of the anastomosis site and extract the drains from the port for the third robotic arm.\n7. Posteoperative Care",
    "After surgery, give the patient intravenous antibiotics (ceftriaxone sodium), parenteral nutrition (glucose, compound vitamin, compound amino acid, fat emulsion, insulin, KCl, and NaCl), analgesic (sufentanil, ondansetron), somatostatin, proton pump inhibitors (lansoprazole) and other treatment as the same as that of conventional central pancreaticectomy. Keep the patient fasting, then remove the nasogastric tube and feed a clear fluid diet on the 2nd postoperative day. Gradually transition to normal diet if the patient can tolerate it.\nTest the drain fluid for the amylase and bacterial culture after the 3rd postoperative day. When there is no evidence of pancreatic fistula and infection, and the drain volume is less than 10 mL/day, remove the drains.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}