{
  "id": 15068,
  "origin_website": "Jove",
  "title": "Exon Skipping in Directly Reprogrammed Myotubes Obtained from Human Urine-Derived Cells",
  "procedures": [
    "The Ethics Committee of the National Center of Neurology and Psychiatry approved this study (approval ID: A2017-018, A2018-029). All individuals gave informed consent before providing urine. All experiments were performed under the relevant guidelines and regulations.\n1. Isolation and primary culture of UDCs\nNOTE: UDCs were isolated according to a previously published protocol8,9,10 with some modifications.\nCollect urine samples during spontaneous micturition in sterilized plastic bottles.\n\tNOTE: Sterilization of the external urethral orifice is not needed. Midstream urine is desirable to reduce the risk of viral contamination. If the stock time before the next procedure is >1 h, urine samples should be transferred to 4 °C to preserve the cell viability. However, a temperature of <4 °C should be avoided because insoluble precipitates may appear.\nCentrifuge the entire urine sample at 400 x g for 10 min at room temperature.\nAspirate the supernatant, leaving 1 mL in the tube.\nResuspend the pellets individually in the remaining 1 mL of urine and then collect those in a single 50 mL tube.\nAdd 10 mL of washing buffer consisting of 99 mL of PBS without calcium and magnesium, 1% penicillin/streptomycin (P/S), 0.5 µg/mL amphotericin B, and centrifuge the samples at 200 x g for 10 min at room temperature.\nAspirate the supernatant, leaving 0.2 mL in the tube.\nResuspend the cell pellets in 4.5 mL of primary medium composed of a 1:1 mixture of high glucose Dulbecco's modified Eagle medium (DMEM)without sodium pyruvate and Ham's F-12 nutrient mix supplemented with recombinant human epidermal growth factor (EGF), insulin, hydrocortisone, epinephrine, T3, transferrin, 10% tetracycline-free fetal bovine serum (FBS), 1% P/S, and 0.5 µg/mL amphotericin B.",
    "Seed the cells in three wells of gelatine-coated six well plates (total volume of each well, 1.5 mL). Culture humidified at 37 °C and 5% CO2 for 24 h.\nAdd 1.5 mL of the primary medium daily for the next 3 days.\nOn day 4, replace the medium with 1.5 mL of growth medium supplemented with recombinant human EGF, insulin, hydrocortisone, epinephrine, T3, transferrin, 15% tetracycline-free FBS, 0.5% L-alanine-L-glutamine, 0.5% nonessential amino acids, and 2.5 ng/mL fibroblast growth factor-basic (bFGF), recombinant human platelet-derived growth factor (PDGF), EGF, and 1% P/S.\nChange the growth medium every other day.\n\tNOTE: UDC colonies appear within a week.\nWhen the UDC culture becomes 80−90% confluent, remove the medium and wash cells with PBS, split all the cells using 0.25% trypsin-EDTA and seed at 3,000-5,000 cells/cm2 onto a new gelatine-coated 60 mm dish (passage 1).\n\tNOTE: The UDCs can be stored in liquid nitrogen. UDCs are usually divided at 60−70% confluency in 60 mm culture dish into three stock tubes.\n2. Retroviral construct\nAmplify the coding region of MYOD1 (NM_002478.4) plasmid by polymerase chain reaction (PCR).\n\tNOTE: The mixture for MYOD1 amplification and conditions for the thermal cycler are shown in Table 1 and Table 2, respectively.\nDetect a single band of about 1,000 bp size by 0.7% agarose gel electrophoresis using 1 µL of the amplified PCR product to confirm that the MYOD1 sequence is amplified successfully.\nClean the PCR product using the clean-up kit and determine its concentration with a spectrophotometer.\nIncubate the mixture as shown in Table 3 at 37 °C overnight to digest retroviral vector with a Tet-on system and puromycin resistant gene at restriction enzyme-targeted regions in the multiple cloning site.",
    "Detect a single band by 0.7% agarose gel electrophoresis using 1 µL of the digested product to confirm that the retroviral vector was digested successfully.\nClean the digested product using clean-up kit and determine its concentration by spectrophotometer.\nTo clone the amplified MYOD1 fragment (produced by steps 2.1−2.3) into the digested retroviral vector (produced by steps 2.4−2.6), perform an in-fusion cloning reaction. Set up the reaction as shown in Table 4, incubate the reaction for 15 min at 50 °C, and then place on ice.\nPerform transformation using E. coli competent cells according to the manufacturer's instructions (Table of Materials).\nSelect the transformed competent cells by culturing on an LB culture plate consisting of 10 g/L bacto tryptone, 5 g/L bacto yeast extract, 5 g/L NaCl, 15 g/L bacto agar, and 50 mg/L ampicillin.\nPick up the selected colony and culture in LB culture medium without bacto agar at 200 rpm at 37 °C overnight.\nPurify the MYOD1-inserted retroviral vectors using a plasmid purification kit (Table of Materials) and quantify using a spectrophotometer.\nConfirm that MYOD1 is correctly inserted into the retroviral vector by direct sequencing of the PCR product amplified by the forward and reverse primers targeted respectively on both sides across the inserted MYOD1 sequence.\n\tNOTE: The MYOD1 sequence can be detected sandwiched between retroviral vector sequences when in-fusion cloning is successful.\nFor retroviral production, seed the packaging cells at 50,000 cells/cm2 on 10 cm collagen-coated plates and culture in DMEM with 10% FBS humidified at 37 °C and 5% CO2 for 24 h.\nWhen the packaging cells proliferate to 80% confluency, mix 30 µg of MYOD1-inserted retroviral vectors, 30 µg of packaging vectors, and transfection reagent containing cell-penetrating peptide (Table of Materials) by vortexing, and incubate them for 10 min.",
    "Add the incubated mixture to the medium of packaging cells and culture humidified at 37 °C and 5% CO2.\n\tNOTE: Collagen coating is necessary. Transfection may be better at 24 h or more after seeding because packaging cells easily detach from the culture plate.\nAfter 4 h or overnight, change the medium to fresh growth medium.\nCollect the viral supernatant and replace with fresh medium at 24 and 48 h after cotransfection and combine the supernatant.\nTo concentrate the viral supernatant, mix it with the concentrator reagent and incubate at 37 °C overnight, then centrifuge at 1,500 x g for 45 min at 4 °C.\nFilter the retrovirus supernatant through a PVDF filter with 0.45 µm pores.\nCheck the titer of the retroviral vector using a quantitative PCR kit and thermal cycler system according to the manufacturer's instructions.\nDivide the viral supernatant into small aliquots and stock them at -80 °C.\n3. Infection with MYOD1-retroviral vector in UDCs\nSeed the UDCs at 3,000-5,000 cells/cm2 on a gelatine-coated 60 mm dish.\nAfter 24 h of seeding, infect the thawed retrovirus (step 2.21) at a multiplicity of infection of 200 by adding hexadimethrine bromide at a concentration of 8 µg/mL.\nAfter a 24 h incubation humidified at 37 °C and 5% CO2, replace the culture medium with fresh growth medium containing 1 µg/mL puromycin to select the MYOD1-transduced cells. Change the medium every other day.\n\tNOTE: When selecting for MYOD1-positive cells, 1 µg/mL puromycin is usually used for selection. The appropriate dose should be determined. Use a plate containing untransfected cells and choose the dose that kills all the cells in 3−5 days. MYOD1-positive cells should be selected within 7−10 days after adding puromycin. The MYOD1-transduced UDCs can be stored in liquid nitrogen.",
    "4. Myogenic differentiation of MYOD1-transduced UDCs treated with 3-deazaneplanocin A hydrochloride (DZNep)\nNOTE: Recently, it has been reported that DZNep, a histone methyltransferase inhibitor, could significantly promote the expression of MYOGENIN, one of the late muscle regulatory factors, and also lead to myotube differentiation7.\nPlate MYOD1-transduced UDCs in the collagen-coated wells at a density of 3.5 x 104 cells/cm2. Culture humidified at 37 °C and 5% CO2.\nAfter 24 h, change the growth medium to differentiation medium composed of high glucose DMEM with L-alanine-L-glutamine, 5% horse serum, ITS supplement, 1 µg/mL doxycycline, and 5 µM DZNep.\n\tNOTE: The 10 mM DZNep solution can be stored at -80 °C for 3 months. Use a defrost freezer and avoid repeated freeze-thaw cycles. Both MYOD1 activated by doxycycline and DZNep suppress proliferation and promote the myogenic differentiation of UDCs. Therefore, it is recommended that doxycycline and DZNep are added after the induction of myogenic differentiation. DZNep promotes myogenic differentiation of the MYOD1-UDCs in a dose-dependent manner. On the other hand, it shows cytotoxicity at a high concentration. Therefore, determine the appropriate concentration of DZNep, ranging from 1−10 µM depending on its effects on myogenic differentiation and cellular bioavailability.\nAfter 3 days, change the differentiation medium to fresh differentiation medium without DZNep. Then, change the medium every 3 days.\n\tNOTE: UDCs fuse to each other and form myotubes within 1−2 weeks after differentiation.\n5. Exon skipping in MYOD1-converted UDCs\nNOTE: Here, three protocols are described to evaluate exon skipping in patient-derived cells: 1) reverse transcriptase polymerase chain reaction (RT-PCR) of dystrophin mRNA; 2) semiquantification of restored dystrophin protein signal by Western blot; and 3) semiquantification of restored dystrophin fluorescence signal by immunocytochemistry. All the methods can detect exon skipping in a dose-dependent manner.\nEvaluation of exon skipping efficiency by RT-PCR",
    "To transfect antisense oligonucleotide (ASO) into MYOD1-converted UDCs obtained from DMD patients on the day 7 after differentiation, mix ASO, transfection reagent (Table of Materials), and differentiation medium to a final concentration of 1−10 µM. Culture humidified at 37 °C and 5% CO2.\nAfter 72 h of incubation with ASO, change the medium to fresh differentiation medium without ASO.\nFrom 3−7 days after ASO transfection, remove differentiation medium and wash 1x with PBS. Add cell lysis buffer, lyse the UDCs and harvest the total RNA using an RNA extraction kit.\nMeasure the RNA concentration with a spectrophotometer.\nCombine the required reagents for one-step RT-PCR reaction in PCR tubes according to Table 5.\nPlace the PCR tubes with the mixture in a thermocycler. Run the thermocycler, according to Table 6.\nPerform microchip electrophoresis and calculate the exon skipping efficiency using the molar concentration as below.\n\t\tExon skipping efficiency (%) = skipped band / (skipped band + non-skipped band) x 100\n\t\tNOTE: Store the PCR product in a refrigerator at 4 °C for short-term storage or -20 °C for long-term storage.\nDetection of dystrophin after exon skipping by Western blotting\n\t\nTransfect ASO and culture MYOD1-UDCs according to steps 5.1.1 and 5.1.2.\nChange the medium every 3 days.\nAfter 2 weeks of differentiation, extract the total protein from the cultured cells using radioimmunoprecipitation assay (RIPA) buffer containing protease inhibitors.\nSonicate the lysates on ice and centrifuge at 14,000 x g for 15 min at 4 °C.\nCollect the supernatant and determine protein concentrations using a BCA protein assay kit.\nAdd 15 µg of total protein in a 0.5 mL tube and dilute by adding the RIPA buffer containing protease inhibitors to a total volume of 10 µL. Run 15 µg of total protein per lane.",
    "Add sample buffer, reducing agent, and deionized water as shown in Table 7. Denature the cell lysates at 70 °C for 10 min.\nPrepare the tris-acetate running buffer containing 8.95 g/L tricine, 6.06 g/L tris base, 1.0 g/L sodium dodecyl sulfate (SDS).\nLoad the sample (20 µL) onto tris-acetate 3−8% gel and perform electrophoresis at 150 V for 75 min.\nPrepare the blotting buffer without methanol.\nSoak the PVDF membrane for 20 s in methanol and then in the blotting buffer until use (at least 10 min). Cut the PVDF membrane to a size of 6 x 8 cm using mini gels and 8 x 12 cm using midi gels.\nCut the blotting papers to the same size as that of the PVDF membrane and soak those in the blotting buffer until use.\nAfter electrophoresis, cut the gel to the same size as that of the PVDF membrane and soak the gel in distilled water.\nPlace the blotting papers, PVDF membrane, and gel on the semidry transfer apparatus (Figure 1). Transfer at 4 mA/cm2 for 30 min.\nRinse the membrane 2x with distilled water.\nPrepare anti-dystrophin (1:500) and anti-α-tubulin (1:1,200) antibody as the primary antibodies.\nPrepare HRP-conjugated anti-mouse antibody (1:100) as a secondary antibody.\nIncubate the membranes with the primary antibodies, wash with wash buffer, then incubate with the secondary antibody using an automated Western-processing device (Table of Materials) at room temperature.\n\t\tNOTE: Anti-α-tubulin antibody is usually used as a loading control. The mixed primary antibody solutions, including 1:500 anti-dystrophin and 1:1,200 anti-α-tubulin antibodies work well when the antibody reaction is performed simultaneously.\nRinse the membrane in distilled water.\nDetect the proteins using chemiluminescent detection reagent and a charge-coupled device (CCD) camera-based imager.\nAnalyse the data using appropriate software.\nDetection of dystrophin after exon skipping by immunocytochemistry",
    "Directly reprogram the UDCs into the myotubes in collagen-coated 96 well plate according to steps 4.1−4.3.\nTransfect the ASO and culture MYOD1-UDCs according to steps 5.1.2 and 5.1.3.\nAfter 2 weeks of differentiation, wash the cells with PBS and fix them in 4% paraformaldehyde for 10 min at 4 °C.\nPermeabilize MYOD1-UDCs in 0.1% nonionic detergent for 10 min at room temperature and block those with 10% goat serum for 15 min at 37 °C.\nIncubate the cells with a primary antibody overnight at 4 °C.\nWash the cells with PBS and incubate those with the secondary antibody for 30 min at room temperature.\n\t\tNOTE: Here, mouse anti-dystrophin (1:30) is used as the primary antibody, anti-mouse IgG is used as the secondary antibody, and Hoechst (1:10,000) is used for nuclei staining.\nImage the plates using a fluorescent microscope and use an analyzer to semiquantify the fluorescence signal automatically in every well under the same condition."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}