{
  "id": 5316,
  "origin_website": "Bio",
  "title": "Pilot-scale Columns Equipped with Aqueous and Solid-phase Sampling Ports Enable Geochemical and Molecular Microbial Investigations of Anoxic Biological Processes",
  "procedures": [
    "Sample bag design for non-invasive retrieval of representative solid-phase substrate: Permeable substrate bags were deployed in each of the 3 solid-phase ports (Figure 1 and Figures 4D and 4E) to facilitate spatial and temporal inquiry. After a sample bag was retrieved it was replaced with an identical bag to circumvent any disturbance to column operation between time points.Determine the mass of material needed for analyses, and ensure sample bags contain at least that amount. In this case 3 inch by 3 inch bags are sufficient for the 1 g of material used for digests and 0.5 g x 3 for DNA extraction. The remaining material was anaerobically archived in Whirl-Paks in the anaerobic chamber, sealed in a secondary vacuum evacuated bag and then stored at -20 °C.Pack material homogenously in porous nylon bags (i.e., mosquito netting or window screen) and ensure the sample material is consistent with the rest of the column material. Four bags are put in each sample port at the beginning of the experiment.Record dry mass of each of the sample bags. Prepare extra bags for replacing harvested samples during experimental operation in order to minimize resultant flow perturbations.Pre-soak bags in experimentally-relevant water (in this case MIW) before packing them into sample ports to account for expansion, record wet mass.Liquid sample retrieval for aqueous metal analysis using Inductively Coupled Plasma (ICP-AES) Spectroscopy with a dual view PerkinElmer Optima Model 5300 spectrometer.At least 2 people are needed for sample retrieval. Ensure pumps are turned off and liquid is flowing freely to avoid pulling a vacuum. Harvest liquid samples before substrate to circumvent any flow effects. Flush a 10 ml syringe with N2/CO2 gas mix 3 times, letting the gas push the plunger up.Attach funnel to tubing to ensure gas is dispersed over the area of concern.",
    "Continually flush a 15 ml conical with N2/CO2 mix while collecting 10 ml of liquid with a flushed syringe.Attach 0.45 µm filter to the syringe containing the sample and dispense the filtered sample into the 15 ml tube while it is being flushed.For ICP-AES analysis lower the pH of the sample to 2 with nitric acid (in our case, several drops of 70% nitric acid).Screw on the cap and Parafilm over lid for transportation.Liquid collection for geochemical analyses Flush a syringe three times with the gas mix.Flush 50 ml tubes while collecting liquid with the flushed syringe.Fill 50 ml tube allowing no headspace.Screw on lid and Parafilm for transportation.Wrap in aluminum foil to prevent photooxidation of sulfides if appropriate.Tubes contained ~3 ml of gases headspace to prevent cracking during freezing.Run these samples as soon as possible (within 48 h).Solid substrate retrieval for geochemical and molecular analysesEnsure influent water flow is turned off.Tilt the column using the hinged rack assembly so that it is parallel to the ground in order to sample substrate bags without substantial fluid loss (Figure 6).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20161228/20161228025116_4007.jpgFigure 6. Intact columns and supporting hardware in use during sampling process. One of the columns is being tilted horizontally for sample bag retrieval to enable analysis during the experiment.Have one person hold the gas line over the sample port before it is open.The second person will open the sample port, and using flame sterilized forceps/pliers retrieve the sample bag.Forceps, pliers, and other sample handling tools were flame sterilized by being sprayed with 70% ethanol and then lit with a handheld lighter (i.e., Bic) until the alcohol burns off.Place the sample bag into a pre-flushed Whirl-Pak®.Push out most of the air and ‘whirl’ the bag around the wire per instructions.Place Whirl-Pak-ed sample into vacuum bag and seal using vacuum sealer.",
    "Put the anoxically sealed sample on ice immediately for molecular analyses.Replace the harvested sample with a marked extra sample bag as a placeholder.Replacement bag should not be collected as a sample, as it would not have been in contact with the reactive substrate as long as the other sample bags.Separation of substrate samples for geochemical and molecular analysesBring defrosted solid-phase samples into the anaerobic chamber (95%:5% N2:H2) with ethanol spray bottle, 50 ml tubes, 15 ml tubes, forceps, pliers, scissors, weigh boats, and scale. Loosen 50 ml and 15 ml tube tops before putting them in the evacuation unit so the oxygen inside the tube is also purged during evacuation. Use sterilized scissors inside the anaerobic chamber to cut open vacuum seal bags. Remove sample bag from Whirl-Pak®, keeping the Whirl-Pak® intact.Cut open nylon sample bag with sterilized scissors. Put substrate in large disposable weigh boat and homogenize by mixing with forceps.Retrieve substrate from sample bag for DNA extraction with sterilized forceps/pliers. Place the substrate inside a pre-tared 50 ml tube, until there is 5 g wet weight in the tube. While only 0.5 g x 3 was used for DNA extraction, collecting 5 g allows for redundancy.Set aside DNA extraction tube, and collect 1 g of material for geochemical extractions and place in pre-tared 15 ml tube.Seal the 15 ml tube with Parafilm. Replace the remaining material back in the Whirl-Pak®.Vacuum seal the Whirl-Pak® after coming out of the anaerobic chamber and archive remaining material at -20 °C for extra analyses etc. Freeze material for molecular analyses at -20 °C, unless performed immediately."
  ],
  "subjectAreas": [
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}