{
  "id": 19862,
  "origin_website": "Wiley",
  "title": "RNA Extraction from Plant Tissue with Homemade Acid Guanidinium Thiocyanate Phenol Chloroform (AGPC)",
  "procedures": [
    "Here we describe the extraction of RNA using homemade AGPC, which is a versatile solution used to solubilize DNA, RNA, or protein. Proteins, such as RNases, are denatured by guanidinium thiocyanate and phenol. The crucial steps involved in this protocol are phase separation, extraction, precipitation, and resuspension in different solutions. Phase separation is initiated by adding chloroform, which separates DNA, RNA, and proteins from each other. After a centrifugation step, the RNA is maintained in the aqueous (top) phase, while the proteins and DNA remain largely in the interphase (middle) and organic (lower) phase. The aqueous phase is transferred to a new tube, and the RNA is then precipitated with isopropanol. Finally, the pellet is washed with 70% ethanol, dried, and resuspended in RNase-free water.\nMaterials\nFrozen tissue sample\nLiquid nitrogen\nHomemade AGPC (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.351#cpz1351-rec-0001])\n100% chloroform\nBuffer-saturated phenol, pH 8 (e.g., Millipore Sigma, cat. no. 77607)\n1:1 phenol:chloroform prepared with buffer-saturated phenol\n100% isopropanol\n70% ethanol prepared with RNase-free water\nRNase-free ultrapure water (e.g., DEPC-treated water, Thermo Fisher Scientific, cat. no. 4387937, or Milli-Q water)\nAgarose (CAS no. 9012-36-6)\nTBE or TAE buffer (e.g., Millipore Sigma, cat. nos. T7527-1L and T8280-1L, respectively)\nTissue grinder (e.g., mortar and pestle, CryoMill, Eppendorf Autoclavable Safe-Lock Micropestle, or equivalent)\n1.5-ml microcentrifuge tubes, RNase-free\nSpatula, sized for tubes\nMicrocentrifuge, 12,000 to 16,000 maximum speed\nSpectrophotometer (e.g., NanoDrop)\nAdditional reagents and equipment for agarose gel electrophoresis (see Current Protocols article: Armstrong & Schulz, 2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.351#cpz1351-bib-0002])",
    "CAUTION: Because of the use of organic compounds, all steps must be performed in a suitable fume hood with efficient ventilation. Safety glasses and reagent-impermeable protective gloves should be worn. Avoid contact of the solutions with eyes or skin. Before starting, be aware of the safety protocols of your institution in case of inhalation or contact of the reagent with eyes or skin.\nSample preparation\n1. Grind tissue to a fine powder in the presence of liquid nitrogen.\nTo exemplify the protocol, we used Petunia hybrida flowers and leaves.\nDepending on the origin of the plant tissue, different approaches can be used. A mortar and pestle can be used to grind tissues in general, but when the starting material consists of several grams of fruit, a grinding machine that is resistant to liquid nitrogen could be a better alternative. On the other hand, small amounts of tissue could be ground in a microcentrifuge tube using an Eppendorf micropestle or comparable instrument.\nAnother good way to grind is to use a 12-ml polypropylene tube (e.g., Greiner, cat. no. 163270). To do this, first freeze the tissue (up to 0.5 g) in a tube by submerging the closed tube in liquid nitrogen. Use a glass or metal rod of about half the tube diameter and 20 to 30 cm in length to disrupt the tissue on a vortex mixer while holding the tube and rod. Repeat in short bursts until a fine powder is obtained. Freeze the tissue again in between if needed.\n2. Weight 100 to 200 mg resulting powder, and transfer to a cold 1.5-ml microcentrifuge tube. Avoid thawing sample.",
    "First, prechill the 1.5-ml tube and a spatula in liquid nitrogen. Weight 100 to 200 mg tissue, and close the tube. Leave the tube in liquid nitrogen until the next step.\nWork fast to prevent the sample from warming up. Alternatively, to skip the weighting step, simply fill the inside of a microcentrifuge tube cap with ground powder. This is often a perfect amount of ∼100 to 200 mg. Doing this will speed up the work and also prevent thawing of the sample while working. When the sample has been weighed, close the tube, and freeze it again in the liquid nitrogen. Collect all samples in liquid nitrogen until all samples have been processed.\nFor convenience, we describe below the method for the extraction of RNA from 100 to 200 mg of tissue using 1.5-ml microcentrifuge tubes. Starting with 200 mg will yield about 5 µg/µl total RNA. Depending on the required amount of RNA, scale appropriately.\nCell lysis and protein precipitation\n3. Add 1 ml cold (4°C) AGPC solution and close tube. Mix tissue with the solution by inversion six times.\nIt is important that the tissue is thawed and homogenized in the AGPC solution. This allows the buffer to inactivate all RNase activity. After this step, the rest of the protocol can be carried out at room temperature.\n4. Shake vigorously for 15 s.\nDo not use a vortex because it shears genomic DNA and can increase DNA contamination in the RNA fraction.\n5. Incubate sample at room temperature for 5 min.\n6. Add 0.25 ml chloroform.\n7. Shake vigorously for 15 s.\nDo not use a vortex.\n8. Centrifuge 5 min at maximum speed, room temperature, in a microcentrifuge.\n9. Transfer aqueous (upper) phase to a new tube.",
    "The aqueous phase will be ∼0.5 ml. Taking less than the complete upper phase is advised to avoid carrying along any interphase contamination. Do not be greedy; it is acceptable to leave some upper phase behind to avoid contamination, as having a lower volume of pure RNA is better than a larger volume of a contaminated one. Many downstream applications need only 1 to 5 µg of RNA, which is much lower than the typical yield from this method (see below). If you take <0.5 ml, make sure to adjust the volumes in the downstream steps accordingly.\n10. Optional: Perform 1:1 phenol:chloroform treatment of the (upper) aqueous phase, followed by chloroform treatment:\n         \nAdd 1 volume (i.e., 0.5 ml) phenol:chloroform to the aqueous phase.\nShake vigorously for 15 s.\nCentrifuge 5 min at maximum speed, room temperature, in a microcentrifuge.\nTransfer aqueous (upper) phase to a new tube.\nThis step is recommended when the interphase is a thick band and/or debris can still be seen floating in the upper phase.\nWash and solubilization\n11. Add 1 volume (i.e., 0.5 ml) isopropanol at room temperature to precipitate.\n12. Mix well by inverting.\n13. Incubate at room temperature for 10 min to precipitate RNA.\nLonger times and colder temperatures during precipitation could increase yield but also contamination. Depending on the tissue, you can make changes to the temperature and length of incubation.\nWhen using tissues that contain high volume of carbohydrates or secondary metabolites, such contamination may occur. When the contamination is too high, consider using the Alternate Protocol[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.351#cpz1351-prot-0002].\n14. Centrifuge 5 min at maximum speed, room temperature, in a microcentrifuge.\n15. Discard supernatant.",
    "It is easiest to pour off the supernatant as the pellet is stuck to the bottom. If you prefer to use a pipet, be careful not to touch the pellet (nebulous white material in the lower part of the tube).\nDo not worry about leaving some isopropanol behind, as it can easily be washed in the next step; so again, do not be greedy.\n16. Wash pellet with 1 volume room temperature 70% ethanol, and pour off supernatant.\nAfter pouring off ethanol, we recommend a short centrifugation step to spin down excess liquid, such that it can then be removed with a pipette tip. This way, the pellet should be perfectly dry and ready for resuspension in just 5 min.\n17. Dry pellet at room temperature.\nPut the tube upside down on a clean paper towel in a well-ventilated area (i.e., fume hood) to reduce drying time.\n18. Resuspend pellet in the appropriate volume of RNase-free ultrapure water.\nDepending on the nature of the tissue and the subsequent use of the RNA, the appropriate volume may vary; we advise 25 to 50 µl. In our example protocol, we started with 100 mg material (leaves and petals), and we resuspended in 50 µl water.\n19. Quantify RNA using a spectrophotometer, and inspect quality using a 1% (w/v) agarose gel in TBE or TAE buffer.\nSpectrophotometric measurement (e.g., using a NanoDrop) can be used to determine RNA concentration. The concentration can be calculated with the optical density at 260 nm (OD260). One OD260 unit equals 40 µg RNA per ml (OD260 = 1 = 40 µg/ml). Because the absorption of nucleic acids is not linear above an absorption of 1.0, it is advised to dilute your RNA 1:10 in RNase-free water when measuring.",
    "Determine the OD260/OD230 and OD260/OD280 ratios, which should be close to 2.\nBecause degradation cannot be accurately determined via spectrophotometric methods, check RNA integrity on a 0.5× TBE 1% (w/v) agarose gel stained with ethidium bromide, loading 1 µl of the product. A 1× TAE 1% (w/v) agarose gel could also be used. It is practical to use the leftover from the 1:10 dilution that was used for the spectrophotometric analysis and load that on a gel with RNA loading dye. Electrophoresis of the RNA should yield clear ribosomal bands without any smear (Fig. 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.351#cpz1351-fig-0001]). If you are worried about possible RNase contamination and potential degradation, it is good to let your RNA sit on your bench at room temperature for 15 to 30 min before loading and running the gel. Clean RNA is stable at room temperature, but if there are any residual RNases present, the RNA will be degraded, and this will be visible on the gel. It is better to know this at this point before you continue with reverse transcription reactions or other (expensive) downstream applications during which activity of RNase may not be that obviously visible.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/ebb957bf-3288-4e73-bfcf-e92548c82952/cpz1351-fig-0001-m.jpg</p>\nFigure 1\nElectrophoresis gel for total RNA after acid guanidinium thiocyanate-phenol-chloroform (AGPC) extraction. Lanes 1 and 2: Two independent samples of petunia leaves (200 ng). Lanes 3 and 4: Two independent samples of petunia flowers (200 ng). Lanes 5 and 6: Petunia leaves (same as lanes 1 and 2 but 400 ng). Lanes 7 and 8: Petunia flowers (same as lanes 3 and 4 but 400 ng). Run on 1% (w/v) agarose gel (0.5× TBA buffer) in 0.5× TBA buffer for 1 hr at 80 V.\n20. Store RNA at ‒20°C or ‒80°C.",
    "For short-term storage, ‒20°C is recommended. For long-term storage, such as months or years, ‒80°C is recommended.",
    "For some extractions, especially from high carbohydrate‒ and/or secondary metabolite‒containing tissues, the Basic Protocol[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.351#cpz1351-prot-0001] can result in RNA that exhibits significant contamination with these compounds. Such is the case when using, for instance, fruits and some other complex plant tissues. In those cases, we advise following an alternate method, which uses a combination of the NTES buffer and APGC. This method follows the same general procedure as the Basic Protocol[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.351#cpz1351-prot-0001] but features an initial phenol-chloroform phase separation step that reduces the amount of interfering contaminants. The method was used by Holding et al. (2007[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.351#cpz1351-bib-0015]) and Reyes et al. (2011[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.351#cpz1351-bib-0022]) for RNA extraction from maize kernels, which contain high levels of starch, and has been used in our laboratory to isolate good-quality RNA from several high carbohydrate‒containing tissues such as tomato fruit, mango fruit, and marigold petals (J. C. Verdonk, personal communication).\nAdditional Materials (also see the Basic Protocol[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.351#cpz1351-prot-0001])\nNTES buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.351#cpz1351-rec-0002])\nRefrigerated microcentrifuge\nSample preparation\n1. Follow steps 1 and 2 in the Basic Protocol[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.351#cpz1351-prot-0001].\nCell lysis and protein precipitation\n2. Add 200 µl NTES buffer and 200 µl of 1:1 phenol:chloroform (4°C).\n3. Thaw while shaking vigorously.\nIt is important that the tissue is thawed and homogenized in the NTES buffer and phenol:chloroform solution. This allows the buffer to inactivate all RNase activity.\nDo not vortex.\n4. Centrifuge 10 min at maximum speed, 4°C, in a microcentrifuge.\n5. Add 200 µl of 1:1 phenol:chloroform (4°C).\n6. Shake well to mix, and centrifuge 10 min at maximum speed, 4°C, in a microcentrifuge.\n7. Add 200 µl chloroform (4°C) and shake well.\n8. Place tubes on ice for 5 min.\nMix halfway by inverting six times.\n9. Centrifuge 10 min at 10,000 × g, 4°C.\n10. Take aqueous phase (upper) to a new tube.",
    "When taking the aqueous phase, be careful not to disturb the interphase or mix the phases. Using 200-µl micropipettes tips could prevent large volume movements in the tube solution. Do not be greedy; it is acceptable to leave some upper phase behind to avoid contamination.\n11. Add 600 µl AGPC solution.\nAfter this step, you can start working at room temperature.\n12. Shake well for 15 s, and incubate for 5 min at room temperature.\n13. Add 200 µl chloroform. Shake well and incubate at room temperature for 2 to 3 min.\n14. Centrifuge 10 min at 10,000 × g, room temperature.\n15. Take upper aqueous phase to a new tube.\nWhen taking the aqueous phase, be careful not to disturb the interphase or mix the phases.\nWash and solubilization\n16. Add 1 volume isopropanol and mix well. Continue with the Basic Protocol[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.351#cpz1351-prot-0001] from step 12 onward."
  ],
  "subjectAreas": [
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}