{
  "id": 8757,
  "origin_website": "Jove",
  "title": "Measuring the Functional Abilities of Children Aged 3-6 Years Old with Observational Methods and Computer Tools",
  "procedures": [
    "This protocol was performed in compliance with the procedural regulations of the Bioethical Committee of the University of Burgos (Spain). Prior to their participation, both the students and their parents and in some cases legal tutors had all provided their informed consent and had been fully made aware of the objectives of study. No financial compensation was offered for their participation.\n1. Participant recruitment\nRecruit children between 0-6 years of age with a history of special educational needs related to alteration in the areas of motor development, cognitive, personal autonomy, and socialization and with moderate to severe intellectual disabilities. A total of 11 participants (7 boys and 4 girls) were recruited for the present study.\nInclude children who have been diagnosed with an intellectual disability (moderate or severe) in accordance with the Diagnostic and Statistical Manual of Mental Disorders (DSM-5)16 and attend a Special Education Center for their schooling (Table 2).\n\tNOTE: In each case (depending on the detection of the problem and the place where the intervention is performed), the diagnosis should have been confirmed by a pediatric neurologist at a hospital or a psychologist within a multidisciplinary team, in accordance with DSM-5. Ideally, there should be no fewer than 15 participants, since the insertion of the observation results is laborious.\ntable:\n﻿0,1,2,3,4,5,6,7,8\nSex,n,Mage,SDage,Rank age (months),Disability•,Disability•,Schooling,Schooling\nSex,n,Mage,SDage,Rank age (months),degree,degree,Schooling,Schooling\nSex,n,Mage,SDage,Rank age (months),a,b,c,d\nBoys,7,95.2,11.77,86-114,4,3,2,5\nGirls,4,83.5,23.56,45-112,1,3,2,2",
    "NOTE:* Degree of disability: a = moderate intellectual disability; b = severe intellectual disability; Type of Schooling: c = Combined Schooling; d = Schooling in a Specific Special Education Center; M = Mean age in months; SD = Standard Deviation. * The children were diagnosed using the criteria of DSM516,NOTE:* Degree of disability: a = moderate intellectual disability; b = severe intellectual disability; Type of Schooling: c = Combined Schooling; d = Schooling in a Specific Special Education Center; M = Mean age in months; SD = Standard Deviation. * The children were diagnosed using the criteria of DSM516,NOTE:* Degree of disability: a = moderate intellectual disability; b = severe intellectual disability; Type of Schooling: c = Combined Schooling; d = Schooling in a Specific Special Education Center; M = Mean age in months; SD = Standard Deviation. * The children were diagnosed using the criteria of DSM516,NOTE:* Degree of disability: a = moderate intellectual disability; b = severe intellectual disability; Type of Schooling: c = Combined Schooling; d = Schooling in a Specific Special Education Center; M = Mean age in months; SD = Standard Deviation. * The children were diagnosed using the criteria of DSM516,NOTE:* Degree of disability: a = moderate intellectual disability; b = severe intellectual disability; Type of Schooling: c = Combined Schooling; d = Schooling in a Specific Special Education Center; M = Mean age in months; SD = Standard Deviation. * The children were diagnosed using the criteria of DSM516,NOTE:* Degree of disability: a = moderate intellectual disability; b = severe intellectual disability; Type of Schooling: c = Combined Schooling; d = Schooling in a Specific Special Education Center; M = Mean age in months; SD = Standard Deviation.",
    "* The children were diagnosed using the criteria of DSM516,NOTE:* Degree of disability: a = moderate intellectual disability; b = severe intellectual disability; Type of Schooling: c = Combined Schooling; d = Schooling in a Specific Special Education Center; M = Mean age in months; SD = Standard Deviation. * The children were diagnosed using the criteria of DSM516,NOTE:* Degree of disability: a = moderate intellectual disability; b = severe intellectual disability; Type of Schooling: c = Combined Schooling; d = Schooling in a Specific Special Education Center; M = Mean age in months; SD = Standard Deviation. * The children were diagnosed using the criteria of DSM516,NOTE:* Degree of disability: a = moderate intellectual disability; b = severe intellectual disability; Type of Schooling: c = Combined Schooling; d = Schooling in a Specific Special Education Center; M = Mean age in months; SD = Standard Deviation. * The children were diagnosed using the criteria of DSM516",
    "Table 2: Characteristics of the sample.\nExclude children with normal development in functional areas (motor, cognitive, personal autonomy and socialization development) and children with an Intellectual functioning limitation.\n2. Data collection\nCollect data on the development of the children in different functional areas (Food Autonomy, Personal Care and Hygiene, Dressing and Undressing Independently, Sphincter Control, Functional Mobility, Communication and Language, Daily Life Routines, Adaptive Behavior and Attention).\nPerform the observation using the Scale for the measurement of functional abilities (SFA)5 in children between 0-6 years old (SFA) (Table of Materials) and conduct the observation in a natural context (e.g., school settings).\nRecord observations throughout the week in different natural environments that reflect the daily life of the students at the center (Table 1) (e.g., while playing, etc.).\n\t\nLet the teacher or the therapist directly attending the children at the educational institutions record the observations. Gather the observations for each functional area.\n\t\tNOTE: Prior to data observation, three training sessions should be conducted for teachers or therapists. These sessions must be conducted by a psychologist or a professional with experience in early-childhood assessment.\nInput the results into the software for the assessment of functional abilities in early childhood between 0-6 years old. The details on how to use the software is provided in step 3.\n3. Experimental procedure\nAssigning a student to a teacher in the software\n\tNOTE: This step has to be carried out by the director or coordinator of the center where the intervention takes place.\n\t\nLog in to the software package with a username (professional) and password and select the language: English or Spanish.\nEnter the student data information from the records held by the director of the center.",
    "Fill in the following fields for each student: Name, Surname, Code, Sex, Date of Birth, Developmental Age, Primary Diagnosis, Secondary Diagnosis, where appropriate, and observations that are relevant to medication data, allergies, and other information of interest to the management of the center.\nEnter the teacher or therapist information from the records held at the center.\nAssign the students to a group with a teacher (or therapist) by clicking on Classroom. Go to the column Students, choose the student to be assigned to the classroom, and click on Teachers and select one.\nAllocate each group of students and their teacher (or therapist) to a classroom by clicking on Teachers, input dates, name, surname, identification code, mail, passwords and observations. Click Accept.\n\t\tNOTE: The director or coordinator of the center assigns a role for each teacher or therapist to carry out the evaluations of each student or patient (as explained above, it depends on the type of center). The director or coordinator of the center can also consult the evaluations that the teacher or therapist has made.\nUse of the software by the teacher\n\tNOTE: The teacher or therapist performing the assessment can then select an academic year and/or a term. The scale offers the possibility of selecting different functional areas for each term (Table of Materials).\n\t\nLog in to the software with the username (professional) and the password previously assigned by the director of the center.\nEnter the results of the assessments completed in natural environments for each participant assigned to the classroom.\nChoose a student in the software by clicking on his/her name, and start the assessment of the different functional areas (detailed in step 2.3.1).",
    "NOTE: The teachers or therapists can stop the assessment of each student at any time and continue at another time, having saved the data that they have registered.\nPerform the comparative analysis between the development of each user and the expected development at that chronological age.\n\t\t\nOnce the data is registered, select the column Evaluation by right clicking. Then select the year and the trimester.\nSelect the column Students and select the students of a class of whom to make the evaluation. Select the column Areas clicking on the area or subarea that needs to be evaluated.\nClick on the Maximum tab. It gets the information about the students and the comparison with the development expected for their age.\n\t\t\tNOTE: This offers a user (student or patient) or development profile for a given functional area with a comparative link to the highest expected scores for the chronological age of the user (student or patient).\nCompare the different functional areas of each user from the classroom. An analysis of the functional areas of each user can be performed with the software. Following step: once the data is registered, select the column Evaluation by right clicking. Then select the year and the trimester. Select the column Students and select the students of all classes. Select the column Areas and click on the area or subarea to evaluate.\n\t\t\nClick on the Maximum tab. It gets the development of the students and the comparison with the development expected for their age.\nExporting data from the software\nSelect the user data and functional areas, and export the database. Select the column Excel to get the database. Export the database in the statistics program or library of choice.",
    "Import the data into statistical packages and libraries such as SPSS, Weka, Python's scikit-learn, etc. and perform clustering analysis. Here, analysis with SPSS is detailed as below.\n\t\tNOTE: Clustering or cluster analysis is an ‘unsupervised’ machine-learning technique, and, within k-means, it is a grouping method, which aims to partition a set of n observations into k groups, in which each observation belongs to the group with the closest mean value. In this experiment, k-means clustering was used to check the clusters of children and their functional development measured with SFA.\n\t\t\nSelect the option Analyze and Classify followed by the option k-means cluster in the statistical package.\nSelect crosstabs under Descriptive Statistics, and the following two variables: the cluster variable of ‘belonging to a group’ and the degree variable (‘moderate’ or ‘severe’).\n\t\t\tNOTE: This correspondence is important, because it offers the teacher or therapist information on the homogeneous functional development of users that goes beyond the diagnosis, providing information to propose similar intervention programs in some areas of functional development. This option is expected to facilitate full use of the educational or therapeutic service and its personal and material resources.\nSelect the Descriptive Statistics option and select crosstabs and the Cohen Kappa Coefficient option.\n\t\t\tNOTE: The Cohen Kappa coefficient is a statistic which measures inter-rater agreement for qualitative (categorical) items. It is generally thought to be a more robust measure than simple percent agreement calculations, as k accounts for the possibility of the agreement occurring by chance. This coefficient provides an indicator of the reliability of the relationship found between the diagnostic classification in moderate-to-severe intellectual disabilities and the clustering of the developmental results obtained with the software.\nUse the spreadsheet to generate the spider chart and specific bar graphs for the groups of children with moderate and severe intellectual disabilities.",
    "Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}