{
  "id": 6662,
  "origin_website": "Bio",
  "title": "Isolation and Quantification of Metabolite Levels in Murine Tumor Interstitial Fluid by LC/MS ",
  "procedures": [
    "Study designHow many biological replicates are recommended?The number of biological replicates needed for studies will depend on the variability between samples. For animal studies, where a large number of variables can be controlled (i.e., tumor genetics, tumor size, animal genetics, animal diet, time of interstitial fluid isolation), variability will likely be smaller than for human samples. Additionally, the number of replicates required will depend on the intended purpose of the experiment to be performed. For example, if the intended purpose is to determine if there is a nutritional difference in the interstitial fluid between two tumor types, it is important to determine an effect size between the groups in addition to variability between samples in order to estimate sample sizes needed. We recommend generating pilot data or utilizing previously published data on TIF composition differences (Sullivan et al., 2019) to estimate effect sizes and utilizing power analysis software in Metaboanalyst (Chong et al., 2018) or other statistical analysis software to estimate the number of biological replicates needed.Additionally, when determining the number of biological replicates needed, it is important to note that not every tumor will necessarily yield interstitial fluid. In our experience, roughly 75% of murine pancreatic adenocarcinomas yielded tumor interstitial fluid (TIF) with volumes ranging from 5 to 180 μl of fluid (Sullivan et al., 2019). Therefore, additional samples may be required to achieve the required number of replicates determined from power analysis.We recommend harvesting TIF at the same time from all animals involved in a study. Circadian rhythm and food intake can alter plasma metabolite levels and therefore TIF metabolite levels, introducing additional variability (Dallmann et al., 2012; Abbondante et al., 2016). If TIF must be harvested from animals on different days, we recommend harvesting TIF at the same time during the day.",
    "We recommend two people work together to isolate TIF and cardiac blood to increase the speed of TIF harvest to prevent alterations in TIF composition due to prolonged periods of ischemia occurring between euthanasia and TIF harvest. In our own experiments, dissection was completed in ~2 min. and we found limited evidence of ischemia altering tumor metabolite levels (Sullivan et al., 2019).We have successfully isolated TIF using the protocol described in Procedure B from multiple genetically engineered and implantation mouse models of breast, lung, prostate, pancreas and melanoma cancers and others have isolated TIF from murine models of melanoma and breast cancer (Ho et al., 2015; Eil et al., 2016; Spinelli et al., 2017; Zhang et al., 2017) using similar protocols. Additionally, similar protocols have been used to isolate TIF from renal (Siska et al., 2017) and ovarian carcinomas (Haslene-Hox et al., 2011). Thus, we anticipate the TIF isolation protocol can be used successfully for a variety of tumor types, of mouse and human origin.The analysis described in Procedure C uses 7 separate chemical standard pools as described in (Sullivan et al., 2019) that enable the quantification of 149 metabolites commonly measured in biofluids (Lawton et al., 2008; Evans et al., 2009; Mazzone et al., 2016; Cantor et al., 2017). However, depending on experimental goals, the full analysis utilizing all 7 standard pools may not be required. Subsets of the chemical standard pools can be used that cover analytes of interest if the full analysis is not needed. Note though that individual metabolites in the standard pools provided in this protocol have been carefully selected so as to avoid metabolites with the same m/z (isomeric and isobaric species) being in the same pool. In addition, metabolites that could be generated by in-source fragmentation from larger metabolites have been separated.",
    "The description of the liquid chromatography-mass spectrometry analysis in this protocol (Procedure D) is a rough guideline for experienced operators of such instruments to perform the analysis described. Successful mass spectrometry analysis of the samples will require a trained UHPLC and Thermo Scientific hybrid quadrupole-Oribtrap mass spectrometer operator.Isolation of TIF and plasma from tumor bearing animalsPrepare a TIF isolation tube (Figure 1 A).Take a nylon filter and place it over the top of a 50 ml conical tube.Tape the filter down using lab tape. Make sure the filter is affixed somewhat loosely to the top of the conical tube, such that the tumor can push the filter down slightly into the tube.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20191117/20191117221207_6240.jpgFigure 1. Collecting TIF using nylon mesh filters attached to conical tubes. A. The filter is loosely affixed to the top of the conical tube using laboratory tape, so that the filter will sag slightly into the conical tube when a sample is placed on top of the filter. B. A sample on top of the filter and conical tube. C. After adding the sample to the filter, the lid of the conical tube is placed on top, but not screwed onto the conical. Instead, it is taped using laboratory tape in place. D. ~30 μl of tumor interstitial fluid (colored blue to here for contrast) collected in the conical tube after centrifugation.Prepare materials in advance to allow for rapid mouse dissection.Put pre-chilled (4 °C) saline (~25 ml) into a Petri dish for washing the tumor.Make a ~4 cm square piece of Whatman paper for drying the tumors after the saline rinse.Have a 25G TB syringe ready for cardiac blood collection.Label and pre-chill one EDTA-coated plasma collection tubes on ice for 10 min prior to mouse dissection.Euthanize the mouse by cervical dislocation.",
    "Spray around the incision site with 70% ethanol to prevent contamination of samples with hair.Quickly and cleanly dissect the tumor away from the animal. The exact procedure for the dissection will depend on the anatomical location of the tumor. One person should continue with the following steps while the other person can start on plasma isolation (Step B6).Place the tumor into the saline containing Petri dish to rinse the tumor.Blot the tumor dry on Whatman paper. Take care at this step to ensure all saline is blotted from the tumor, so that saline does not contaminate the TIF.If concerned about saline contamination during TIF isolation, we suggest the following additional step: add a non-natural metabolite such as norvaline to the saline. Continue with the remainder of the protocol as normal. Subsequently, when analyzing TIF samples, determine if the non-natural metabolite is present in the TIF sample. If the non-natural metabolite is detected this indicates saline contamination, whereas if the metabolite is not detected saline contamination is unlikely.Optional: Weigh the tumor if this information is needed. Tumor volume can also be determined by caliper measurements if needed.Place the tumor on top of the nylon mesh filter that is affixed to the conical tube (Figure 1B). Place the 50 ml conical lid over the tumor and tape the lid in place (Figure 1C).Centrifuge the tumor at 4 °C for 10 min at 106 x g using a refrigerated clinical centrifuge (e.g., Sorvall Legend X1R).Remove the 50 ml conical tube. If the isolation worked, there will be 10-50 μl of fluid in the bottom of the conical tube (Figure 1D). Keep the tube on ice.Note: Human tumors have been found to yield 5-150 μl of fluid per gram of tumor (Haslene-Hox et al., 2011).",
    "Similarly, we isolated 10-50 μl of fluid from murine pancreatic tumors weighing ~0.3-2.5 g (Sullivan et al., 2019). There is not an exact correlation between tumor size and TIF volume, as many factors likely influence interstitial volume. However, larger tumors are more likely to yield TIF in larger volumes. Tumors with large fluid filled cysts can give hundreds of μl of fluid per gram of tumor. Disregard these from analysis as it is unclear if the cystic fluid is representative of interstitial fluid. Remove the isolate fluid to a fresh Eppendorf tube. The fluid can be extracted directly for LC/MS analysis or frozen and stored at -80 °C for future analysis.We have analyzed TIF samples both before and after 2 months of storage at -80 °C (avoiding freeze-thaw cycles) and detected similar metabolite concentrations after storage (Sullivan et al., 2019). Thus, TIF samples can be stored for at least 2 months without freeze-thaw cycles prior to analysis.The tumor from which TIF was isolated can be used for additional analysis using other appropriate protocols.Note: We have successfully used tumors from which TIF was isolated for immunohistochemical, immunoblotting and flow cytometric analyses. Use the 25G TB syringe to isolate blood from the mouse heart by cardiac puncture. Cardiac puncture can be a difficult technique to perform. Detailed protocols with video documentation of cardiac puncture blood isolation have been previously published (Schroeder, 2019). If unfamiliar with this technique, we recommend utilizing these resources for more detailed information on isolating blood in this manner.Dissect open the thoracic cavity.Insert the syringe into the ventricle.Slowly withdraw blood to prevent collapse of the heart.Remove the needle from the syringe to prevent cell lysis when expelling the cells from the syringe.Expel the blood into the EDTA-coated plasma collection tube.Keep plasma on ice.",
    "Spin the EDTA-coated plasma collection tubes at 845 x g in benchtop centrifuge (e.g., Sorvall Legend Micro 21) for 15 min at 4 °C.Remove the plasma from the pelleted blood cells and put into fresh Eppendorf tube.Extract this plasma directly for LC/MS analysis or freeze and store at -80 °C for future analysis.Note: Previous studies have found that plasma samples can be stored at -80 °C (without freeze-thaw cycles) for up to 30 months without significant alterations in the levels of many metabolites (Stevens et al., 2019). Thus, plasma samples can be stored for many months prior to analysis.Extraction of metabolites from TIF and plasmaPrepare libraries of pooled chemical standards that include the metabolites to be quantified. See Recipes section and Tables 5-11 for details on how libraries were compounded in (Sullivan et al., 2019).Prepare metabolite extraction buffer (EB) (Recipe 5) with appropriate isotopically labeled internal standards. See Recipes section for details on making EB with isotopic standards as described in (Sullivan et al., 2019).Note: Make enough EB for the number of samples and standards you have plus an additional 10%, so as not to run out of EB before extracting metabolites from every sample. 45 μl of EB is needed for each sample and standard pool dilution. Isotopically labeled metabolite standards in the EB are not indefinitely stable. Prepare EB fresh prior to each experiment. Prepare dilutions of chemical standard libraries in HPLC grade water. The highest concentration should be 5 mM.Next, make dilution series of each standard pool in HPLC grade water as listed below in Step C5. Keep these on ice prior to extraction. Note that multiple dilutions of the chemical standard libraries are required for construction of standard curves relating known metabolite concentration to LC/MS response, which is necessary for downstream analysis of metabolite concentrations.",
    "Below we recommend a scheme to generate 8-point standard curves covering physiological concentrations of metabolites, but variations are possible.The 5 mM pool will not be always in solution for each pool, therefore vortex vigorously and immediately pipette from this mixture in order to prevent error from settling particles:Take 20 μl of 5 mM stock and dilute into 80 μl HPLC grade water to yield a 1 mM solution.Take 30 μl of 1 mM stock and dilute into 70 μl HPLC grade water to yield a 300 μM solution.Take 33.33 μl of 300 μM stock and dilute into 66.67 μl HPLC grade water to yield a 100 μM solution.Take 30 μl of 100 µM stock and dilute into 70 μl HPLC grade water to yield a 30 μM solution.Take 33.33 μl of 30 μM stock and dilute into 66.67 μl HPLC grade water to yield a 10 μM solution.Take 30 μl of 10 μM stock and dilute into 70 μl HPLC grade water to yield a 3 µM solution.Take 33.33 μl of 3 μM stock and dilute into 66.67 μl HPLC grade water to yield a 1 μM solution.Thaw the TIF and plasma samples on ice.Add 5 μl of each TIF sample, plasma sample and chemical standard library dilution (Recipe 6) to a fresh Eppendorf tube. Keep on ice.Add 45 μl of EB to each sample/standard. Keep on ice.Vortex all the samples for 10 min at maximum speed at 4 °C.Spin down all samples for 10 min at 21,000 x g at 4 °C.Take 20 μl of the mixtures from the Eppendorf tube and add to an LC/MS sample vial. Cap the vial. Note: A minimum of 15 μl is needed in the LC/MS vial to ensure correct and accurate injection by the autosampler.",
    "The vials described in Materials and Reagents contain fused inserts. Vials without inserts will require larger volumes.  Freeze the remaining sample in the Eppendorf tubes and store at -80 °C. This sample can be run later if the initial LC/MS is not successful.Liquid chromatography-mass spectrometry analysis of extracted metabolitesStart off with a clean system (use appropriate LC cleaning methods in place in your lab).Calculate the amount of Mobile Phase A (Recipe 1) required and prepare fresh on the day of analysis. Store this for no more than one week.Note: Depending on your system, you will use ~2 ml per injection and require an additional 50-100 ml in the bottle. Do not forget to make enough Mobile Phase A for additional injection types such as solvent blanks and system suitability tests that must be run in addition to the samples. Calculate the amount of Mobile Phase B (Recipe 2) required and prepare more if needed. Depending on your system, you will need ~2 ml per injection plus an additional 50-100 ml in the bottle.Check the level of rear seal wash (Recipe 3) and top up if needed.If using an UHPLC system that has a separate needle wash, fill this with acetonitrile.Connect a SeQuant® ZIC®-pHILIC 5 μm 150 x 2.1 mm analytical column to the Guard column using the connector supplied in the Guard kit.Connect the column and guard to your UHPLC system using standard techniques.Set the column oven temperature to 25 °C. Set the autosampler temperature to 4 °C.Set initial conditions: set the flow rate to 0.150 ml/min with 80% B. Record initial pressure value. Note: ZIC-pHILIC columns cannot tolerate such high back pressures and injection volumes as typical reverse phase columns.",
    "Keep an eye on the back pressure and do not let it exceed the maximum pressure recommended by the manufacturer. It is good practice to set a maximum pressure in your method that is below that set by the manufacturer to avoid damage to the column. Equilibrate the column with starting conditions (80% B) for 30 min prior to running anything on the system. Check the mass calibration on the mass spectrometer. If the mass has not been calibrated within the last week, or if it fails the mass check, recalibrate using the standard calibration mixes recommended by the manufacturer. In addition, perform a custom low-mass calibration by spiking glycine and aspartate into the calibration mix, or as recommended by the manufacturer. Ensure your entire LCMS system performance is acceptable by running system suitability tests, such as injecting a mixture of amino acids onto your column and into the MS. Check for signal intensity as well as peak shape and separation.Use the conditions shown in Table 1 below for the UHPLC gradient:Table 1. LC parameterstable:",
    "﻿0,1,2\nTime (min),Flow rate (ml/min),%B\n0.00,0.150,80\n20.0,0.150,20\n20.5,0.150,80\n28.0,0.150,80\nOperate the mass spectrometer in full-scan, polarity-switching mode, with a scan range of 70-1000 m/z. Include an additional narrow-range scan from 220 to 700 m/z in negative mode to improve detection of nucleotides. Use the parameters shown below in Tables 2 and 3 for the MS:Table 2. MS source parameters table:\n﻿0,1\nParameter,Setting\nSpray voltage,3.0 kV (pos); 3.1 kV (neg)\nHeated capillary,275 °C\nHESI probe,350 °C\nSheath gas,40 units\nAux gas,15 units\nSweep gas,1 unit\nTable 3. MS scan parameterstable:\n﻿0,1\nParameter,Setting\nResolution,70000\nAGC target,1E6\nMax IT,20 ms",
    "Note that in this particular study, we had previously collected MS/MS data for each metabolite being quantified, and used this to confirm retention times using a library of chemical standards. If adding new metabolites to your standard pools, collect MS/MS data on the standard itself, as well as on a pooled biological sample to help confirm peak identification. Write your sequence (sample run order) using Thermo Scientific Xcalibur Sequence Setup View.Note: Given the extremely low volume of samples used in this method, the sequence differs from typical sequences which will include column conditioning injections, as well as quality control pooled samples. As multiple standard curves are run and each sample includes 13C-labeled internal standards, we chose to forgo using precious sample to create QC pools and instead determine linearity and consistency of metabolite detection using the standard curves and the 13C internal standards.Start off by injecting several water blanks to ensure system is clean from carry over and contaminants.Include solvent blanks, using the 75/25/0.1 acetonitrile/methanol/formic acid mix that was used to make the extraction mix.Follow with a system suitability test (SST) injection. We use 80% methanol containing 13C-15N labeled amino acid mix (Recipe 4).Add the samples to your sequence and follow with the standard curves, starting with the lowest concentration and working up to the highest concentration for each curve. Separate each curve with solvent blank and check for carry-over.Insert additional SST injections every 8-10 samples. These will be used as QCs to ensure no loss of signal over time.Set the injection volume to 2 μl for each injection type.Set the instrument method to the appropriate method.Save the sequence file.Randomize sample running order to decrease the chance of signal loss over time. Export the sequence as a .csv file.",
    "Open in Microsoft Excel, cut and paste the samples into a new tab, leaving behind the blanks, STTs and standard curves. Add an additional column and use the = rand () function to create random numbers for each of the samples. Now sort the samples from smallest to largest using the random number values. Cut and paste back into the previous sequence containing the blanks, SSTs and the standard curves. Save the .csv file with “random” in the file name. Import the new randomized sequence back into Xcalibur Sequence View and save using “random” in the file name.Place your sample vials in the autosampler in the vial positions according to the sequence. Use the non-randomized sequence to check vial positions for your samples.Ensure the solvent blank vials and SST vials contain enough volume for multiple injections. Run the sequence. Note: For examples of expected outputs from the LC/MS analysis of TIF and plasma samples, LC/MS data from (Sullivan et al., 2019) is available at https://www.metabolomicsworkbench.org/data/DRCCMetadata.php?Mode=Project&ProjectID=PR000750.[href=https://www.metabolomicsworkbench.org/data/DRCCMetadata.php?Mode=Project&ProjectID=PR000750.]"
  ],
  "subjectAreas": [
    "Systems Biology",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}