{
  "id": 15251,
  "origin_website": "Jove",
  "title": "Adaptation of Hybridization Capture of Chromatin-associated Proteins for Proteomics to Mammalian Cells",
  "procedures": [
    "1. Capture Oligonucleotide Design\nDesign a panel of oligonucleotides to be used during the hybridization capture of the target region/s.\nAim to design 4–8 oligonucleotides per target region, but as a minimum, design at least one oligonucleotide targeting each end of the target region.\nIf the target sequence is long (>500 base pairs), design the oligonucleotides as spread out as possible to assure effective enrichment of chromatin across the entire target region.\n\t\tNOTE: We have observed optimal captures with 4–8 oligonucleotides. Even though this process can work well with more oligonucleotides, it is not uncommon to observe a decrease in enrichment yields when too many oligonucleotides are used.\nDesign oligonucleotides with similar melting temperatures, and make sure that they do not form strong hairpins nor have strong interactions (taking into account that hybridizations will be carried out at 42 ᵒC).\n\tNOTE: If a toehold elution is chosen (4.12.3), an additional external 8 base sequence must be added to the oligonucleotide and will require complementary 'release' oligonucleotides at the time of the elution17. Several commercial software tools can be used to select and analyze the oligonucleotides. 25 mers have shown good results, but depending on the genome size and sequence, capture oligonucleotides can contain somewhere between 20–80 bases. Typically, capture oligonucleotides have a melting temperature close to 62 ᵒC, but that can change depending on their length. Consistent melting temperatures and/or oligonucleotide length throughout the capture mix can help avoid unwanted biases in enrichment.\nDesign the capture oligonucleotides with a biotin moiety (preferably separated by a spacer from the capture sequence) on the 3' end.\n2. Cell Culture",
    "Grow human lymphoblastoid cells (such as GM12878 shown here) or other cell lines in RPMI 1640 media supplemented with 1% penicillin-streptomycin, 2 mM L-glutamine and 5% fetal bovine serum (FBS), at 37 ᵒC and 5% CO2.\nSeed initial frozen aliquots (2–5 x 105 cells) in a T-25 flask with 6 mL of RPMI 1640 media prepared in 2.1.\nMonitor cell density and viability.\n\t\t\nTake a representative aliquot of cells and stain them with an appropriate dye such as trypan blue.\nMeasure the cell density using a hemocytometer or an automated cell counter.\nBefore the cell reaches density of 1 x 106 cells/mL, spin the cells down at 100 x g for 5 min and transfer the cells to a T-75 flask with 25 mL of RPMI 1640 media prepared in 2.1. Grow the cells until cell density approaches 1 x 106 cells/mL.\nTransfer the cells to a T-150 flask in 38 mL of RPMI 1640 media (2.1) and grow the cells for an additional two days.\n\t\tNOTE: Lymphoblastoid cells grow in suspension. General guidelines for growing lymphoblastoid cells recommend cell densities to be kept between 0.2–1 x 106 cells/mL. Because of the large amount of material required in this technology, the present protocol is purposely written to grow cells to a cell density beyond what is commonly used. Cell growth protocols can be revised and adapted by the reader depending on the cell types to be used.\nSpin the cells down at 100 x g for 5 min, resuspend the cells in 10 mL of RPMI 1640 media (2.1) and pour the suspension into an 850 cm2 roller bottle containing 500 mL of media. Incubate the cells under the same conditions as before but at this point start using constant rotation (~0.5 rpm).",
    "Monitor the cell growth and change the media when needed (Typically every 3–4 days). Let the cells grow to a density as close as possible to 2 x 106 cells/mL (1 x 109 cells in total).\nOnce the desired cell count is reached, harvest the cells by spinning the cells down at 100 x g for 5 min and resuspend the cells in 36 mL of RPMI 1640 media (2.1). Transfer the cell suspension to a 50 mL conical tube. Take small aliquots for cell counting and DNA extraction.\nCrosslink by adding 1 mL of 37 % formaldehyde to reach a final concentration of 1%.\n\tCAUTION: Formaldehyde is a carcinogen and should be handled in a fume hood.\n\t\nIncubate the cells with rotation (~30–60 rpm) for 10 min at room temperature (RT).\nQuench the crosslink reaction by adding 2 mL of a 2.5 M glycine solution, for a final concentration of 125 mM.\nIncubate the cells with rotation (~30–60 rpm) for 5 min at RT. Pellet the cells by centrifuging at 100 x g for 5 min and wash the cells twice with ice cold 1x PBS.\nContinue to next step or resuspend the pellet in 5 mL of Cell Lysis Buffer (5 mM Hepes, 85 mM KCl, 0.5% Igepal, protease inhibitors (PI)) and snap-freeze the suspension drop by drop in liquid nitrogen. Store the samples at -80 ᵒC.",
    "NOTE: Prepare >25 mL of Cell Lysis Buffer without Igepal and PI and add those reagents fresh when ready to use. Avoid long-term storage of Cell Lysis Buffer once Igepal and PI have been added. Store Cell Lysis Buffer at 4 ᵒC for up to 3 months. Igepal is a nonionic, non-denaturing detergent. NP-40 can be potentially used as an alternative to Igepal but we have not used it in this context as NP-40 is not recommended when samples are eventually analyzed by mass spectrometry to characterize the DNA binding proteins.\n3. Lysis and Shearing\nPrepare >15 mL of Nuclei Lysis Buffer (10 mM EDTA, 50 mM Tris pH 8.0, 1 % SDS, PI).\n\tNOTE: Add PI fresh, just to the amounts to be used. Avoid long-term storage of Nuclei Lysis Buffer once PI has been added. Nuclei Lysis buffer can be stored at RT for up to 1 month.\nResuspend the pellet in 20 mL of Cell Lysis Buffer (containing Igepal and PI). Let the pellets thaw on ice and mix well once thawed. Let samples sit for an additional 10 min on ice. Centrifuge the cells at 400 x g at 4 ᵒC for 5 min.\nDiscard the supernatant and resuspend the cells in 6 mL of Nuclei Lysis Buffer with PI (volume can be increased if cells do not form a suspension).\nIn preparation for sonication, divide the sample evenly in ~6–8 microfuge tubes (600 to 1,000 µL for each tube).\nPlace the samples on ice or a cold rack and sonicate the sample using a sonicator with a microtip. Use 65% amplitude with 5 x 20 s constant bursts, allowing the suspension to cool down for at least 40 s between pulses.",
    "NOTE: If volumes increase >10 mL per sample, a glass cooling cell can be used instead. More and longer bursts would be required then. Sonicators differ greatly. Conditions might have to be optimized by the reader. Other sonication alternatives can be used as well.\nCentrifuge the cells at 12,000 x g for 10 min at 4 ᵒC, transfer the supernatant to a new tube, and discard the pellets.\nEstimate total recovery using a fluorometric method.\nContinue to next step or snap-freeze and store the sample at -80 ᵒC.\nOptional: Take an aliquot, reverse crosslinks by incubating it overnight at 67 ᵒC in 0.3 M NaCl. Clean DNA and run it in Bioanalyzer to determine fragment lengths. The bulk of the fragments should be between 500 and 1,000 bp.\n\tNOTE: It is OK to stop at this point and store the samples at -80 ᵒC.\n4. Hybridization Capture\nPrepare 500 mL of 2x Hybridization (Hyb) Buffer (200 mM MES, 2M NaCl, 40 mM EDTA, 0.02 % Tween-20) and 500 mL of Wash Buffer (200 mM NaCl, 0.2 % SDS, 50 mM Tris pH 8). Store the Hyb and Wash Buffers at 4 ᵒC and room temperature, respectively, for up to 3 months. Use half of the 2x Hyb buffer to prepare a 1x Hybridization Buffer. Also store it at 4 ᵒC for up to 3 months.\n\tNOTE: The total volume of the hybridization capture will be twice the volume of the resulting sample in the previous step (as described so far, the sample volume would be around 6 mL and thus the total hybridization volume would be 12 mL).",
    "Set aside beads equal to 5 % of the total hybridization capture volume (600 µL in this case). An appropriate and suitable magnet is needed to work with the beads in the following steps.\nWash the beads three times with 1x Hyb Buffer using twice the beads volume (1200 µL). Resuspend the beads in 1,200 µL of 2x Hyb Buffer. Place the tubes on the magnet until the solution clears and remove the buffer.\nPerform pre-clearing reactions in 1.5 mL microfuge tubes with a maximum of 700 µL of sample per tube. Add enough beads (5%) and 2x Hyb Buffer to dilute the Hyb buffer to 1x (10 tubes with 600 µL of sample, 120 µL of washed beads resuspended in 2x Hyb Buffer, and 480 µL of 2x Hyb Buffer). Incubate them for 10 min at 31 ᵒC with end over end rotation (~30–60 rpm).\nPlace the tubes on a magnet until beads are immobilized and transfer the samples to new tubes. Discard the beads.\n\tNOTE: From this point forward, low-binding tubes are recommended.\nResuspend the capture oligonucleotides to a working solution of 10 pmol/µL and add 4 µL of this solution to each tube.\n\tNOTE: Different regions can act as control for each other, but it is recommended to include a capture oligonucleotide with its sequence scrambled to serve as a true negative control.\nIncubate the tubes for 40 min at 42 ᵒC with end over end rotation (~30–60 rpm).\nDuring the incubation, set aside the beads needed (0.3 µL/pmol of capture oligonucleotide). Wash the beads three times as described in step 4.3, but resuspend the cells in 1 x Hyb Buffer.",
    "Add the washed beads to the sample and incubate the samples for 30 min at RT with end over end rotation (~30–60 rpm). Place the tubes on the magnet and remove the supernatant once the beads have been immobilized.\nWashing the beads\nAdd 1.2 mL of Wash Buffer and incubate the sample for 5 min with end over end rotation (~30–60 rpm) at RT. Place tubes on the magnet and wait a couple of min until solution clears. Remove the buffer and repeat this step.\nAdd 1.2 mL of Wash Buffer and incubate it for 1 h with end over end rotation (~30-60 rpm) at RT. Place the tubes on the magnet and wait a couple of min until solution clears. Remove the buffer and repeat this step reducing the incubation time to 30 min the second time.\nAdd 200 µL of Wash Buffer and incubate it for 15 min with end over end rotation (~30–60 rpm) at 31 ᵒC. Place the tubes on the magnet and wait a couple of min until solution clears. Remove the buffer.\nAdd 200 µL of PBS and incubate it for 5 min with end over end rotation (~30–60 rpm) at RT. Place the tubes on the magnet and wait a couple of min until solution clears. Remove the buffer and repeat this step.\nSimple elution\nAdd 40 µL of molecular grade water to the beads and incubate it at 94 ᵒC for 5 min.\nPlace the tubes on the magnet and wait a couple of minutes until the solution clears.\nTransfer the supernatant into a new tube. Discard the beads.\nProceed to the proteomic analysis or store the sample at -80 ᵒC.",
    "NOTE: This type of elution works well for later qPCR analysis and some proteomics measurements, but in other instances two alternative approaches described below yield \"cleaner\" eluates.\nDNase elution.\nAdd 40 µL of 1x DNase Buffer and 2 U of DNase to each tube.\nIncubate the tubes for 15 min at 37 ᵒC.\nPlace the tubes on a magnet and wait a couple of min until the solution clears.\nRemove the eluted samples from the beads and place the samples in a new low-binding tube.\nIncubate the tube at 94 ᵒC for 7 min to inactivate the enzyme and proceed to proteomic analyses.\n\t\tNOTE: Lower DNase concentrations can be used if interference with proteomic analyses is observed. It will not be possible to calculate the capture enrichments by qPCR if this elution method is used since the DNase treatment completely destroys the DNA material in the sample.\nProceed to proteomic analysis or store the sample at -80 ᵒC.\nToehold elution17.\n\tNOTE: This method is not recommended for longer oligonucleotides (>40 bases). This method requires for the capture oligonucleotides to contain an additional 8 bases that do not overlap with the genomic sequence and complementary release oligonucleotides in order to displace the target from the capture oligonucleotides.\n\t\nDilute 2 nanomoles of release oligonucleotides in 40 µL of SSC buffer.\nIncubate it for 20 min at RT.\nPlace the tubes on a magnet and wait a couple of minutes until the solution clears.\nRemove the solution from the beads.\nProceed to proteomic analysis or store the sample at -80 ᵒC.\n5. Evaluation of Capture Yield by qPCR with Primers for the Target Capture Region of Interest\nUse an appropriate software or online tool to design primers and probes for the target region.",
    "NOTE: In this experiment, the promoter region of the DUSP3 and DUSP5 were targeted. The primers and probes used are the following. DUSP3: Primer 1 - GTG TTT AGG TTC CCT GAT CC, primer 2 - CGG AAT GTC TGC CTT CG, FAM-labeled probe - TCC ATG CCC GAA TTG TGA CGT CGG; DUSP5: Primer 1 - TGA GAA AGC CCT GAT GTG TC, primer 2 - GCC TTC AGA AAC CCC AAA AG, FAM-labeled probe TGC ATT TAG AGC AGC CAG ATG AGG TT.\nTake an aliquot of the eluate (no more than 10 µL), and dilute 1:10 with molecular grade H2O.\nExtract the DNA of one of the aliquots taken in step 2.1.7 and use that DNA sample to make a standard curve by doing five serial 1:10 dilutions in molecular grade H2O.\nPrepare a qPCR master mix (wide variety of commercial alternatives), add primers and probes and dispense appropriate amount (15 µL if running a 20 µL reaction) in each well.\nAdd 5 µL of either: a) diluted sample, b) the standard curve or c) molecular grade H2O (to serve as no template control) to each well.\nSeal the plate and centrifuge it at 100 x g for 1 min.\nRun in a qPCR system with the following parameters: 5 min at 95 ᵒC followed by 40 cycles of 95 ᵒC for 20 s, 59 ᵒC for 20 s and 72 ᵒC for 25 s.\nUse the standard curve to asses yields and scrambled capture to assess capture specificity.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}