{
  "id": 12229,
  "origin_website": "Jove",
  "title": "Using CRISPR/Cas9 Gene Editing to Investigate the Oncogenic Activity of Mutant Calreticulin in Cytokine Dependent Hematopoietic Cells",
  "procedures": [
    "1. sgRNA Design Using Online Tools13\nDesign sgRNAs targeting the gene of interest using freely available online tools.\nCopy and paste the NCBI reference sequence of the gene of interest into the Broad Institute sgRNA designer web tool: (http://portals.broadinstitute.org/gpp/public/analysis-tools/sgrna-design).\n\t\tNOTE: This tool identifies sgRNA sequences with cleavage sites within exons and those that span the intron/exon boundary but still cleave within the exon.\nDownload and open the text output file in excel.\nFocus on the columns populated with the sgRNA sequences and the sgRNA context sequences. Note that the sgRNA sequences do not contain the protospacer adjacent motif (PAM) but the context sequences do.\nNote that the on-target efficacy score lists the predicted cleavage efficiency score on a scale of 0 to 1 where a score of 1 denotes a higher cleavage efficiency.\nUse the 'sort' function of excel to either order the targets by the efficacy score or by location within the gene of the target through the 'Target Cut %' column.\n\t\tNOTE: Sorting by location within the gene is useful for identifying sgRNAs that target a specific domain or exon of interest.\nSelect 3-6 sgRNAs that target the area of interest with high (>0.6) on-target efficacy scores. It can be useful to know what kinds of mutations may be responsible for the phenotype that is desired (Please see Figure 1 explaining the targeting strategy used for calreticulin).\n\t\tNOTE: sgRNAs below the suggested 0.6 efficacy score threshold should be considered when there is a lack of other good candidates.\nUse the MIT gRNA analysis web tool to screen for potential off-target effects (http://crispr.mit.edu/). For each sgRNA selected, run the target sequence (including the PAM).\n\t\tNOTE: The Broad Institute sgRNA designer web tool could also be used to screen for off-target effects (http://portals.broadinstitute.org/gpp/public/analysis-tools/sgrna-design).",
    "Note that the MIT sgRNA analysis tool scores each sgRNA on a scale of 1-100 where a score of 100 denotes higher specificity. A score greater than 70 is ideal and represents a sgRNA with minimum off-target effects. This website also generates a list of off-target hits with their location within the genome and how many mismatches they each have with the candidate guide.\n\t\t\tNOTE: Off-target hits with four mismatches or greater are considered safe14. Off-target hits with less than four mismatches may be problematic if they fall within exons14.\nChoose 2-3 sgRNAs which target distinct locations within the region of interest for the target gene, and which have the highest paired cleavage efficiency and off-target scores (See Table 1 for sgRNA sequences targeting exon 9 of Calr).\n\t\tNOTE: Depending on the experimental goals, greater emphasis may be placed upon the different values obtained from the mentioned tools.\n2. Cloning sgRNA Oligos13\nGenerate the forward oligo\nCreate a list of sgRNA sequences without the PAM site.\nAdd a G to the 5' end of the sequence if the 5'end of the sgRNA sequence is not a G.\n\t\tNOTE: This G is necessary for maximizing U6-driven sgRNA transcription level. Addition of a G is necessary for m1 sgRNA (Table 1).\nAdd the sequence \"CACC\" to the 5' end of the G-optimized guide sequence (no PAM) (Table 2) in order to generate the overhangs required for ligation of annealed oligos into BsmBI digested lentiGuide vector ( see step 3).\nGenerate the reverse oligo\nReverse complement the G-optimized guide sequence (no PAM).\nAdd the sequence \"AAAC\" to the 5' end of the reverse complemented G-optimized guide sequence (Table 2).\nOrder the designed oligos from a primer synthesis company.\nAnneal and phosphorylate oligos",
    "Add 1 µL of forward oligo (100 µM), 1 µL of reverse oligo (100 µM), 1 µL of 10x T4 ligation buffer, 0.5 µL of T4 polynucleotide kinase (PNK) and 6.5 µL of H2O to a PCR tube (Total = 10 µL).\nRun the following program in the thermocycler: 37 ˚C for 30 min, 95 ˚C for 5 min , ramp from 95 to 25 at 0.1 °C/s.\nDilute the reaction product at 1:250 in H2O.\n3. Digestion of lentiGuide-Puro Vector13\nDigest lentiGuide-Puro vector\nAssemble a 50 µL digestion reaction with the following components: 5 µg of circular plasmid, 2 µL (30 units) of BsmBI restriction enzyme, 5 µL of restriction enzyme buffer and up to 50 µL of H2O.\nRun the reaction for 2 h at 55 °C. After the first hour, add 1 µL more of BsmBI restriction enzyme.\nDephosphorylate the cut backbone\nAdd 7 µL of phosphatase reaction buffer and 2 µL of phosphatase enzyme to the digested vector.\nIncubate for 30 min at 37 °C.\nPCR purify the cut and dephosphorylated backbone using a commercial kit.\n\tNOTE: Substitute the provided pink colored columns with the miniprep kit blue colored columns since these can better accommodate large plasmid sizes. The yield can be increased by heating the elution buffer in a 90 ˚C heat block prior to elution and by eluting the DNA from the column twice at the end (run the eluted DNA from the first elution back through a second time).\n4. Ligation ofAnnealed Oligos into Digested Backbone13\nAdd 50 ng of digested backbone, 1 µL of annealed oligo dilution, 1 µL of 10x T4 ligation buffer, 1 µL of T4 ligase and up to 10 µL of H2O to a PCR tube. Incubate for 1 h at room temperature",
    "Transform Stbl3 cells with 2 µL of the ligation reaction. Plate onto a lysogeny broth (LB) agar plate with 100 µg/mL ampicillin and incubate overnight at 37 °C.\nPick 3 colonies and inoculate into a mini-prep culture.\nValidate correct oligo insertion\nPerform a miniprep for each culture and sequence through the oligo insertion site starting from a primer in the U6 promoter using a commercial kit.\nPerform a midi-prep or a maxi-prep of the sequence-verified culture.\n5. Generation of Cell lLines Stably Expressing SpCas9\nNOTE: This protocol involves the delivery of pLX_TRC311-Cas9 plasmid by lentiviral infection. This protocol is described in detail for murine interleukin-3 (mIL-3) dependent pro-B (Ba/F3) cells, a suspension cell line and could be adapted to other cell types using the preferred culture conditions for each cell type. The culture medium for Ba/F3 cells consists of RPMI supplemented with 10% fetal bovine serum, 1% penicillin/streptomycin/ L-glutamine and 10 ng/mL of murine interleukin 3.\nTransfect HEK-293T cells\nSeed 3 x 106 HEK-293T cells per 10 cm tissue culture dish. Keep seeded cells overnight before transfection.\n\t\tNOTE: HEK-293T cells are an adherent cell line and are routinely used for virus production. The cells are maintained in DMEM supplemented with 10% fetal bovine serum, 1% penicillin/streptomycin/L-glutamine. Cells should be 80% confluent at time of transfection.\nPre-warm reduced serum media (Opti-MEM) and growth medium.\nAdd 500 µL of reduced serum media, 7 µg of pLX_TRC311-Cas9 construct, 4 µg of pCMV-VSV-G lentiviral packaging plasmid and 4 µg of psPAX2 lentiviral packaging plasmid into a tube\n\t\tNOTE: Total DNA per 10 cm dish of 293T cells is 15 µg.\nMix the DNA well and add 45 µL of transfection reagent. Mix gently and let it stand for 20 min.",
    "NOTE: It is important to use reduced serum media because serum will inhibit the complex formation between the transfection reagent and plasmid DNA.\nAspirate the old medium in the 293T plate and add 5 mL of new growth medium.\nAdd the DNA and transfection reagent mix in a drop wise manner to the 293T plate. Swirl gently and incubate at 37 °C and 5% CO2 for 24 h.\nHarvest viral supernatants at 24 and 48 h post transfection. Pass through a 0.22 µm filter and aliquot into a cryovial tube (1.6 mL/tube and 1.5 mL will be used for infection).\nStore viral supernatant at -80 °C.\n\t\tNOTE: lentiviral supernatant can be used within 6 months. If possible, spinfection transductions should be performed with fresh virus).\nLentiviral infection of Ba/F3 cells\nThaw the viral supernatant on ice, if frozen.\nCentrifuge cells at 300 x g for 4 min.\nAspirate supernatant and resuspend the cells at a concentration of 3 x 106 cells/mL.\nAdd 500 µL of resuspended cells, 1.5 mL of viral supernatant, 4 µL of polybrene (stock: 2 mg/mL) and 10 ng/mL of m-IL3 in a 6-well tissue culture plate. Make sure to include an uninfected well with 1.5 mL of media instead of viral supernatant as a control.\n\t\tNOTE: The amount of viral supernatant added should correspond to a multiplicity of infection (MOI) <1.\nCentrifuge the plate at 440 x g for 120 min at 37 °C.\nTake the plate out of the centrifuge and place in 37 °C and 5% CO2 incubator and allow to grow overnight.\nSpin down the cells after 24 h, and resuspend with 5 mL of fresh warm media in a 6-well plate.\nSelection of Cas9 infected cells",
    "Spin down the cells and resuspend with fresh warm media supplemented with 5 µg/mL of blasticidin, 48 h post spinfection.\nSelect the cells for 9 days with blasticidin or until uninfected (negative) control cells are dead.\nOnce the selection is complete, transfer the resistant cells to medium with lower concentration of blasticidin.\n6. Reporter Assay for Cas9 Activity15\nTransduce parental cells and cells stably expressing Cas9 with pXPR-011 by lentiviral infection (see steps 5.1-5.2).\n\tNOTE: This vector contains both GFP and a guide targeting GFP. Cells containing active Cas9 will result in a reduction of GFP (Figure 2).\nSelect the cells for 3 days with 2 µg/mL of puromycin, 48 h post spinfection .\nAnalyze the samples for GFP expression by flow cytometry.\n\tNOTE: A GFP reduction of 50% or more represents optimal Cas9 activity. A higher concentration of blasticidin selection could be used to increase Cas9 activity if less than a 50% reduction is observed. Not all cell lines can tolerate blasticidin selection. In this case, use of Cas9 vectors with other selection cassettes may be necessary. In addition, not all cell lines can tolerate stable expression of Cas9. In this case, transient transfection of Cas9 may be used.\n7. Spinfection of sgRNAs into Cas9 Expressing Cells\nFollow steps 5.1-5.2 for lentiviral infection of sgRNAs into cells of interest.\n\tNOTE: In step 5.1.3, replace pLX_TRC311-Cas9 construct with the lentiGuide-Puro construct validated from Section 4.\n48 h post spinfection, select the cells for 3 days with 2 µg/mL of puromycin.\nTransfer the resistant cells to medium with lower concentration of antibiotics and continue selection for another 4 days to allow for sufficient editing.\n8. Ba/F3 Cellular Transformation and Positive Selection Using m-IL3 Withdrawal",
    "NOTE: This assay is described for mIL-3 dependent Ba/F3 cells but could be applied to any cytokine dependent cell line.\nSpin down exponentially growing Ba/F3 cells ectopically expressing Cas9 and the sgRNA of interest.\nAspirate supernatant and wash the cells with 5 mL of Phosphate Buffered Saline (PBS).\nSpin down the cells and repeat the wash step in 8.2 four times (this step ensures that the media is free of IL-3).\nAspirate the PBS and resuspend the cells in 5 mL of fresh media without IL-3.\nCount the cells using a hemocytometer or a cell viability analyzer.\nSeed the cells in triplicate in a 6-well tissue culture plate at a concentration of 1 x 105 cells/mL in a total volume of 2 mL of fresh media without IL-3.\nMonitor and count the cells every 2 days for a total of 8 days.\n\tNOTE: Ba/F3 cells lacking IL-3 typically die 2 days post IL-3 starvation. It is important to include a negative control in the assay (typically a non-targeting guide is used as a control).\n9. Screening for CRISPR On-target Editing\nDesign CRISPR screening primers upstream and downstream of the sgRNA cleavage site\n\tNOTE: use primers at least 100 bp from the predicted cleavage site to ensure detection would not be impacted by a large insertion and/or deletion (indel) at the sgRNA target site.\nIsolate genomic DNA (gDNA) from transformed cells (at the end of the growth curve) and from cells pre-cytokine withdrawal.\n\tNOTE: Always include cells overexpressing the non-targeting guide as a control for gene editing. Isolating gDNA from cells before and after transformation will identify clones that were positively selected for and have a proliferative advantage.",
    "Assemble a 50 µL PCR with the following components: 25 µL of 2x PCR mix, 1 µL of forward primer (10 µM), 1 µL of reverse primer (10 µM), 50-100 ng of gDNA, and H2O up to 50 µL.\n\tNOTE: Numerous high-fidelity polymerases may be used in step 9.3.\nRun samples in a thermocycler using the following parameters: 95°C for 1 min, 30 cycles of (94 °C for 1 min, 52 °C for 30 s, 72 °C for 30 s), and 72 °C for 10 min. This PCR is optimized for the Calr primers listed in Table 3. Optimize PCR conditions for the primer pair designed in step 9.1 based on testing it on gDNA.\nRun 5 µL of the samples on a 2% agarose gel at 10 V/cm using 1x Tris-acetate-EDTA (TAE) buffer. Examine samples for the presence/ absence of an amplified band corresponding in size to the gene of interest.\nUse the rest of the PCR reaction (45 µL) to perform a PCR purification.\nClone the amplicons with a PCR cloning kit into a plasmid vector. For example, pGEM T-easy vectors are typically used.\nTransform the plasmid into Stbl3 cells or other compatible cells and plate onto LB agar plates with the relevant antibiotic. Select 10-20 colonies, mini-prep each one, and subject each clone to Sanger sequencing to characterize the indels created from CRISPR/Cas9 editing.",
    "NOTE: If desired, single cell fluorescence activated cell sorting (FACS) could be performed on the bulk edited population to isolate a clone with a specific indel. Moreover, next generation sequencing (NGS) methods can be used to more robustly quantify on-target editing using deep sequencing of PCR amplicons spanning the sgRNA target region. For example, Tracking of Indels by Decomposition or TIDE can be used instead of subcloning to precisely determine the spectrum and frequency of targeted mutations generated in a pool of cells (https://tide.nki.nl/#about)16.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}