{
  "id": 15316,
  "origin_website": "Jove",
  "title": "Sequence-specific and Selective Recognition of Double-stranded RNAs over Single-stranded RNAs by Chemically Modified Peptide Nucleic Acids",
  "procedures": [
    "1. Manual Solid-phase Peptide Synthesis of PNAs Using Boc Chemistry\nNOTE: For the success and ease of the desired PNA oligomer synthesis, all the solvents and reagents should be anhydrous. Add the appropriate molecular sieves (4A, 1-2 mm diameter pellets) and occasionally purge dry nitrogen gas into bottles. For the synthesis of modified PNA monomers, the reported protocols in respective references30,31 can be used. Unmodified PNA monomers can be purchased from commercial sources. In each of the washing steps, the appropriate amount of solvent is added to the resin, forming a slurry, before it is drained off.\nLoading of the first monomer and capping the excess free primary amines on the resin\nWeigh 30 mg of 4-methylbenzhydrylamine hydrochloride (MBHA·HCl) polystyrene resin (commercially available; loading value 0.7-1.4 mmol/g; 100-200 mesh size), and transfer to a 5 mL solid phase peptide reaction vessel fitted with a stopcock and glass stopper.\nSoak the resin in an appropriate amount of DCM for 1 h, allowing the resin to swell and expose the amines (HCl salt).\n\t\tNOTE: Resin beads should always be fully submerged in solvents throughout the synthesis.\nDrain off the DCM by applying a gentle flow of dry nitrogen gas over the top of the flask. Add 1 mL of 50% (v/v) N,N-diisopropylethylamine (DIPEA) in DCM and leave it for 15 min. This neutralizes the HCl salt attached to the free amines on the resin.\nRepeat step 1.1.3. Meanwhile, weigh 6 µmol of monomer and 6 µmol of (benzotriazol-1-yl-oxy)tripyrrolidinophosphonium hexafluorophosphate (PyBOP), and transfer into a 1.5 mL tube. Add 200 µL of dimethylformamide (DMF) and 12 µmol of DIPEA. Vortex the coupling solution for 3-5 min.",
    "NOTE: Desired loading value used is 0.2 mmol/g. The first monomer added is the monomer on the C-terminal of the desired PNA sequence. The loading value of the first amino acid can be calculated by the picric acid method46.\nDrain off the DIPEA from the DCM solution. Wash the resin with DCM (x 3), followed by DMF (x 3), and close the stopcock. Add the prepared coupling solution to the resin and shake gently. Push the resin along the inner walls of the vessel into the coupling solution with the use of a clean stainless steel spatula. Attach the glass stopper and secure the vessel in an incubator shaker for 3 h at 40 °C.\n\t\tNOTE: Alternatively, the reaction vessel can be kept steady at room temperature for 6-8 h to allow the completion of the peptide coupling reaction.\nPrepare the capping solution by mixing 240 µmol of acetic anhydride and 360 µmol of DIPEA into 200 µL of DCM. Drain off the coupling solution and wash the resin with DMF (x 3) and DCM (x 3). Add in the capping solution and leave the vessel for 30 min, occasionally shaking the vessel gently. Capping masks the excess free primary amine groups on the resins by acetylation.\nRepeat step 1.1.6. Drain the capping solution and wash the resin with DCM (x 3).\nRemove a small aliquot of resin beads using a thin capillary tube, and place them into a 1.5 mL small glass vial. Perform the Kaiser test43. Add 15 µL of each of the Kaiser test solutions into the glass vial and heat using a heat gun. Observe the color of the beads after heating. The color of the beads should remain unchanged, indicating the lack of free amine groups on the resin.",
    "NOTE: The Kaiser test kit is commercially available or can be prepared according to the reported protocol. Solution A: ninhydrin in ethanol; solution B: phenol in ethanol; solution C: potassium cyanide (KCN) in pyridine.\n\t\tCAUTION: KCN is highly toxic; proper protective clothing should be worn and heating should be performed in a well-ventilated fume hood, in the absence of flammable solvent or reagents.\nRepeat step 1.1.6 if the resin beads display blue or faint blue color.\nRemoval of N-terminal amine protecting group\nDrain the solvents from the reaction vessel and add a solution of 50% (v/v) of trifluoroacetic acid (TFA) in DCM, ensuring that the resins are fully submerged. Leave the vessel for 15 min, occasionally shaking to facilitate the deprotection of the amine groups. Repeat 2 more cycles.\n\t\tCAUTION: TFA is highly corrosive. Proper protective clothing should be worn when handling.\nWash the resin with DCM (x 3), DMF (x 3), and DCM (x 3). Add a solution of 5% DIPEA in DCM. Leave the vessel for 15 min. This step activates the free amines by neutralizing the TFA counter anions. Repeat once more.\nFlush out the DIPEA from the DCM solution. Wash the resin with DCM (x 3). Perform the Kaiser test (step 1.1.8).\n\t\tNOTE: Successful deprotection of the amine groups will yield blue discoloration of the beads. Once deprotection is successful, subsequent coupling of monomers by peptide coupling can be carried out.\nCoupling of subsequent monomers\nWeigh 18 µmol of desired monomer (for the Boc-PNA-Q-OH monomer, 13.2 mg of monomer is weighed) and 18 µmol of PyBOP into a 1.5 mL tube. Add 200 µL of DMF and 36 µmol of DIPEA into the 1.5 mL tube. Vortex until all solid compounds are dissolved.",
    "Wash the resin with DMF (x 3). Add the coupling solution into the reaction vessel and shake gently. Push the resin along the inner walls of the vessel into the coupling solution with the use of a clean stainless steel spatula. Attach the glass stopper and secure the vessel in an incubator shaker for 3 h at 40 °C.\nDrain off the coupling solution and wash the resin with DMF (x 3) and DCM (x 3). Perform step 1.1.8. If the color of the beads remains unchanged, repeat steps 1.2.1-1.3.3 until the desired PNA sequence is completed. If blue discoloration of beads is observed after the coupling of a monomer, repeat steps 1.3.1-1.3.3. If discoloration still persists, perform the capping again (step 1.1.6).\n\t\tNOTE: Extended coupling time (3-12 h) and/or use of excess equivalent of monomer and coupling reagents are recommended if problems with coupling arise.\nOnce the desired PNA sequence is completed, wash the resin with DMF (x 3) and DCM (x 3). Completely dry the resin by applying a continuous flow of dry nitrogen gas for 15 min. This dry resin can be split and used to attach lysine or a fluorescent tag such as cyanine 3 (Cy3) and carboxyfluorescein at the N-terminus of the PNA.\nAttachment of lysine or fluorescent tag (Cy3, Cy5, or carboxyfluorescein) to the N-terminus of PNA\nWeigh 10 mg of resin, pre-loaded with the desired PNA sequence. Transfer into a 5 mL reaction vessel. Soak the resin in DCM for 1 h.\nFor the attachment of lysine, perform steps 1.2.1-1.3.3, replacing the monomer with either Boc-Lys(Z)-OH or Fmoc-Lys(Boc)-OH.",
    "For the attachment of carboxyfluorescein, perform steps 1.2.1-1.3.3, with 10-fold excess of 5(6)-carboxyfluorescein as the monomer, and N,N'-diisopropylcarbodiimide (DIPC) and hydroxybenzotriazole (HOBt) as the coupling reagents in DMF. Leave the coupling reaction overnight in the incubator shaker at 40 °C.\n\t\tNOTE: As carboxyfluorescein is light sensitive, the reaction vessel should be covered with aluminum foil.\nFor the attachment of Cy3 or Cy5 dye, label by the click chemistry method, perform steps 1.2.1-1.3.3, replacing the monomer with N-Boc-2-propargyl-L-glycine. This functionalizes the N-terminus of the PNA with an alkyne group. Perform the copper-catalyzed click reaction to attach the azide-containing Cy3 or Cy5 fluorescent dye12,47,48,49\nPNA cleavage from solid support, purification, and characterization\n\tNOTE: If any amine group is protected with the Fmoc protecting group, first deprotect the amine group by treating with 20% piperdine in DMF solution for 15 min (2 cycles). Wash the resin thoroughly with DMF (x 3) followed by DCM (x 3). Dry the resin completely by applying a continuous flow of dry nitrogen gas for 15 min.\n\t\nTransfer 5 mg of dry resin into a small vial. Add 10 µL of thioanisole and 4 µL of 1,2-ethanedithiol, ensuring that the resin is submerged in the reagents. Leave the tube at room temperature for 5 min.\n\t\tNOTE: These reagents act as scavengers, which trap reactive cationic species that are formed during the removal of protecting groups in the PNA. Appropriate scavengers can be chosen based on the side chain protecting groups.\nAdd 100 µL of TFA into the tube containing the resin and scavengers. Gently vortex the mixture and subject to brief centrifugation. Leave the tube at room temperature for 10 min.\n\t\tCAUTION: TFA is highly corrosive. Proper protective clothing should be worn when handling.",
    "Carefully add 20 µL of trifluoromethanesulfonic acid (TFMSA) to the tube. Gently agitate the reaction mixture before subjecting to brief centrifugation at room temperature. Leave the tube steady at room temperature for 2 h.\n\t\tCAUTION: TFMSA is highly corrosive. Proper protective clothing should be worn when handling.\nFilter off the cleavage cocktail into a 5 mL round-bottom flask (RBF) with the use of a glass Pasteur pipette fitted with cotton. Use a small amount of TFA to wash the resin.\nPurge the dry nitrogen gas to the collected filtrate until all volatile solvents are evaporated. Add 1 mL of cold diethyl ether into the RBF.\n\t\tNOTE: The diethyl ether will cause the PNA to precipitate.\n\t\t\nRinse the RBF with the diethyl ether several times before transferring the cloudy solution into a 1.5 mL tube. Subject the tube to centrifugation to allow the PNA precipitate to settle. Decant the solvents and add 300-500 µL of autoclaved water to the precipitate. Vortex thoroughly to dissolve the PNA.\nPurify the crude PNA sample via RP-HPLC using water-acetonitrile-0.1% TFA as the mobile phase. Collect the corresponding fractions, evaporate all solvents using a vacuum concentrator before re-dissolving the purified PNA in autoclaved water.\nCharacterize the purified PNA via MALDI-TOF analysis with the use of α-cyano-4-hydroxycinnamic acid (CHCA) as the sample crystallization matrix.\nMeasure the UV absorbance (260 nm) of the PNA at 65 °C. Calculate the concentration of the PNA with the equation:\nimgsrc://cloudfront.jove.com/files/ftp_upload/56221/56221eq1v2.jpg",
    "NOTE: Here c is the concentration, A is the absorbance reading obtained, ε is the extinction coefficient of the RNA sequence, and l is the optical path length of the cuvette (1 cm). The extinction coefficient of the PNA sequence is the summation of the extinction coefficient of individual monomers50. The extinction coefficients of adenine, cytosine, guanine and thymine are 15.4, 7.3, 11.7 and 8.8 mL/µmol·cm, respectively. The extinction coefficient of the L and Q monomers used is assumed to be the same as that of the cytosine (C) base.\n2. Non-denaturing PAGE\nPreparation of required buffer solutions\nPrepare Incubation buffer (10 mL) using 116.88 mg NaCl (200 mM), 50 µL of 100 mM ethylenediaminetetraacetic acid (EDTA) (0.5 mM), 200 µL of 1M stock HEPES (20 mM), 9.75 m H2O; adjust buffer to pH 7.5.\nPrepare 1x Tris-Borate-EDTA (TBE) running buffer (1 L) using 100 mL 10x Tris-Borate-EDTA at pH 8.3 and 900 mL H2O.\nPrepare 10% Ammonium persulfate (APS) solution (300 µL) using 30 mg ammonium persulfate, and 300 µL H2O.\nPreparation of 12% polyacrylamide gel\nClean the well-forming comb, glass casting plates, and spacers with ethanol; the well-forming comb and spacers are 1 mm thick. Set up the gel assembly and seal with gel-sealing tape.\nFor a polyacrylamide gel of 22 cm x 16.5 cm x 1 mm dimension, 50 mL of gel solution is adequate. Weigh out 5.7 g of acrylamide and 0.3 g of N,N'-methylenebisacrylamide (19:1) and transfer into a 50 mL centrifuge tube.\n\t\tCAUTION: Acrylamide is carcinogenic. Avoid breathing in dust fumes from acrylamide and ensure that proper protective clothing is worn when handling.",
    "Dissolve solid compounds in 50 mL 1X TBE running buffer by placing the centrifuge tube into a 50 °C water bath for 15 min or until all solid compounds have dissolved. Carry out centrifugation (3,000 rpm, 5 min, 25 °C) to remove all air bubbles within the solution. Allow the solution to cool to room temperature.\nAdd 250 µL of 10% APS solution and 50 µL of tetramethylethylenediamine (TEMED) into the gel solution and mix gently using a spatula. Immediately pour the solution between the glass plates, making sure not to introduce any air bubbles. Insert the well-forming comb and leave the gel setup at room temperature for at least 60 min to allow polymerization to occur, before storing at 4 °C until ready to use.\nPreparation of samples\nRemove required quantity of RNA hairpin (1 µM) from the main stock into a clean 1.5 mL tube. Dry the RNA solution using a vacuum concentrator.\n\t\tNOTE: Each sample contains 1 µM of RNA in 20 µL incubation buffer. Typically, 13 samples of RNA are prepared for one PAGE experiment. The RNA for all samples can be prepared together in a single tube.\nRemove the required volumes of targeted PNA (with the final concentration of up to 50 µM) from the main stock and transfer into separate 1.5 mL tubes. Evaporate the water of the PNA solutions using a vacuum concentrator.\nAdd 260 µL of incubation buffer into the 1.5 mL tube containing dried RNA and mix thoroughly to ensure all RNA is dissolved. Subject the RNA to snap cooling: Place the tube into a heat block (preheated to 95 °C) for 5 min. Immediately transfer into an ice bath and leave for 10 min.",
    "Add 20 µL of RNA into each of the 1.5 mL tubes containing dried PNA and mix thoroughly. Perform annealing: Place the tube containing RNA and PNA mixture into a heat block (preheated to 65 °C) for 10 min. Turn off the power of the heat block and let the samples cool slowly to room temperature. Incubate the samples at 4 °C overnight.\nRunning and processing of gel\nRemove the gel-sealing tape on the bottom side of the glass plate. Mount and secure the glass plate onto the vertical gel stand using plastic clamps.\n\t\tNOTE: The gel running is carried out in a cold room at approximately 4 °C. All the equipment, samples, and buffers are cooled at 4 °C before running the gel.\nFill the lower buffer reservoir with 1x TBE running buffer until the plate is submerged in approximately 1-2 cm of running buffer. Fill the upper buffer reservoir with running buffer until the level of buffer exceeds the top of the gel by 1-2 cm. Slowly and gently remove the well-forming comb, allowing the running buffer to fill the wells.\nConnect the gel stand to a power supply. Pre-run the gel for at least 30 min with a constant voltage of 250 V, which is optimized for a 22 cm x 16.5 cm x 1 mm gel.",
    "Meanwhile, add 4 µL (20% of sample volume) of 35% glycerol solution to each of the samples and mix gently. Once the pre-run is completed, load 20 µL of each sample (including one RNA alone sample plus samples containing RNA and PNA mixture) carefully into the bottom of the well using a micropipette and gel loading tips, making sure not to introduce any air bubbles. Run the gel at a constant voltage of 250 V, similar to the pre-run, for 5 h.\nStop the power supply after 5 h and remove the glass plate from the stand. Remove the remaining gel-sealing tape and disassemble the glass plate. Gently remove and immerse the gel into a container filled with 350 mL of deionized water. Carefully add 35 µL of ethidium bromide (10 mg/mL) and place the container on a platform shaker (low speed) for 30 min.\n\t\tCAUTION: Ethidium bromide is a mutagen. Proper protective clothing should be worn when handling.\nDispose the ethidium bromide solution into a designated waste container. Rinse the gel with 1.5 - 2 L of distilled water. Scan the gel using an imager (see Table of Materials) with a green laser of 532 nm and the emission filter set at 610 nm.\nGel analysis\nQuantify the gel band intensities using a free software, GelQuant.NET (http://www.biochemlabsolutions.com/GelQuantNET.html). Normalize the band intensities according to:\nimgsrc://cloudfront.jove.com/files/ftp_upload/56221/56221eq2v3.jpg\n\t\tNOTE: Here Iduplex max is the band intensity of the RNA hairpin alone without the addition of PNA, and Itriplex max is the triplex band intensity with the highest concentration of PNA added.\n\t\t\nCalculate the fraction of triplex formation according to:\nimgsrc://cloudfront.jove.com/files/ftp_upload/56221/56221eq3v2.jpg\nPlot the fraction of the triplex formation (Y) against the concentration of PNA added (µM). Fit the data to the equation to obtain the dissociation constant (Kd):\nimgsrc://cloudfront.jove.com/files/ftp_upload/56221/56221eq4v4.jpg",
    "NOTE: Here R0 is the RNA hairpin concentration (1 µM). Here Y0 and B are the initial and the maximum change of the triplex fraction, respectively. Y is the fraction of triplex at varied PNA concentration. X is the total PNA concentration and Kd is the dissociation constant.\n3. 2-Aminopurine Fluorescence Binding Assay\nPreparation of samples (containing dsRNA)\nRemove the required quantity of 2-aminopurine (2AP) labeled dsRNA (1 µM for each strand) from the main stock into a clean 1.5 mL tube. Evaporate water in the RNA solutions using a vacuum concentrator.\n\t\tNOTE: Each sample contains 1 µM of RNA in 75 µL incubation buffer. Typically, 13 samples of RNA are prepared. RNA for all samples can be prepared together in a single tube.\nRemove the required volumes of the targeted PNA for various concentrations from the main stock and transfer into separate 1.5 mL tubes. Evaporate the water of the PNA solutions using a vacuum concentrator.\nAdd 975 µL of incubation buffer into the 1.5 mL tube containing dried RNA and mix thoroughly to ensure all RNA is dissolved. Centrifuge the RNA solution briefly and subject it to annealing: Place the tube into a heat block (preheated to 95 °C) for 10 min. Turn off the power of the heat block and let the samples cool slowly to room temperature.\nAdd 75 µL of RNA into each of the 1.5 mL tubes containing dried PNA and mix thoroughly. Leave the samples at room temperature for at least 1 h. Incubate the samples at 4 °C overnight.\nPreparation of samples (containing ssRNA)",
    "Remove required quantity of 2AP-labeled ssRNA (1 µM) from the main stock into clean 1.5 mL tubes. Extract the required volumes of targeted PNA for various concentrations from the main stock and transfer into the respective 1.5 mL tubes that contain the ssRNA. Dry the RNA and PNA mixture using a vacuum concentrator.\nAdd 75 µL of incubation buffer into each of the 1.5 mL tubes and mix thoroughly. Subject the mixture to annealing: Place the tube into a heat block (preheated to 95 °C) for 10 min. Turn off the power and let the samples cool slowly to room temperature. Incubate the samples at 4 °C overnight.\nMeasurement and analysis\nUse a fluorescence spectrophotometer to measure the emission over a wavelength range of 330-550 nm. Use an excitation wavelength of 303 nm.\n\t\tNOTE: The samples are measured at room temperature and each sample is measured 3 times, in which the average is taken.\nTransfer 70 µL of incubation buffer into the 1 cm square cuvette. Start the measurement.\nRemove the buffer from the cuvette. Rinse the cuvette with distilled water and purge nitrogen gas to dry. Repeat for all samples. Subtract the buffer measurements from all samples.\nPlot the fluorescence intensity (a.u.) against wavelength (nm). Record the fluorescence intensity at 370 nm for all samples. Plot the fluorescence intensity at 370 nm (a.u.) against the corresponding concentration of the PNA added (µM).\nFit the data to the equation from step 2.5.2 to obtain the dissociation constant (Kd): Y = Y0 + (B/(2R0))(R0 + X + Kd- ((R0 + X + Kd)2- 4R0X)1/2), where R0 is the 2AP-labeled dsRNA concentration (1 µM).",
    "NOTE: Here Y0 and B are the initial and maximum change of fluorescence intensity at 370 nm, respectively. Y is the fluorescence intensity at 370 nm at varied PNA concentration. X is the total PNA concentration and Kd is the dissociation constant.\n4. UV-Absorbance-detected Thermal Melting Experiments\nPreparation of samples\n\tNOTE: Measure the UV absorbance (260 nm) of the RNA at 95 °C (to make sure the RNA secondary structures are disrupted). Calculate the concentration of the RNA with the equation:\nimgsrc://cloudfront.jove.com/files/ftp_upload/56221/56221eq5v2.jpg\n\t​where c is the concentration, A is the absorbance reading obtained, ε is the extinction coefficient of the RNA sequence, and l is the optical path length of the cuvette (1 cm). The extinction coefficient of the RNA is calculated based on a nearest-neighbor model using MeltWin51,52. The program package may be provided upon request.\n\t\nRemove the required quantity of ssRNA (5 µM) from the main stock into clean 1.5 mL tubes. Remove the required volumes of targeted PNA (5 µM) from the main stock and transfer into the respective 1.5 mL tubes that contain the ssRNA. Dry the RNA and PNA mixture using a vacuum concentrator.\nAdd 130 µL of incubation buffer into each of the 1.5 mL tubes and mix thoroughly. Subject the mixture to annealing: Place the tube into a heat block (preheated to 95 °C) for 10 min. Turn off the power and let the samples cool slowly to room temperature. Incubate the samples at 4 °C overnight.\nMeasurement and analysis\nUse a UV-Vis spectrophotometer to measure the absorbance at 260 nm using an 8-microcell cuvette with a path length of 1 cm. Measure the samples' absorbances at increasing temperature from 15 to 95 °C, followed by decreasing temperature from 95 to 15 °C at a ramp rate of 0.5 °C/min.",
    "Transfer 130 µL of sample into each of the well, making sure that one well contains the incubation buffer. Start the measurement. Repeat as required.\nNormalize the absorbance values with the high temperature reading normalized to unity, and plot the normalized absorbance reading against temperature (°C). Plot the first derivative of the curves. Obtain the melting temperatures by fitting the first derivative curves to a Gaussian function."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}