{
  "id": 1645,
  "origin_website": "Cell",
  "title": "Simultaneous analyses of clutch coupling and actin polymerization in dendritic spines of rodent hippocampal neurons during chemical LTP",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nTMR ligand treatment (on DIV14)\nTiming: 2 h\nThe pFN21-HaloTag-actin protein covalently binds with fluorescent tetramethylrhodamine (TMR) ligand. The fluorescent TMR ligand allows to monitor the retrograde flow of HaloTag-actin speckles within dendritic spines.\nDilute 1 μL of TMR ligand in 200 μL of PBS as a working stock.\nNote: Diluted TMR ligand can be stored in the dark at 4°C for up to one week.\nCollect 180 μL of the conditioned medium from cultured neurons and mix it with 20 μL of the TMR ligand working stock.\nReplace the remaining conditioned medium of cultured neurons with the 200 μL TMR ligand-medium mixture.\nIncubate at 37°C with 5% CO2 for 1 h.\nWash the TMR ligand 3 times with pre-warmed PBS.\nIncubate neurons with 500 μL of pre-warmed ACSF containing MgCl2, 0.5 μM tetrodotoxin (sodium channel blocker), 1 μM strychnine (glycine receptor antagonist), 20 μM bicuculline (GABAa receptor antagonist) at 37°C with 5% CO2 for 1 h.\nTime-lapse imaging of dendritic spines before and after chemical long-term potentiation (cLTP)\nTiming: 1 h\nWe use an epi-fluorescence microscope Axio Observer Z1 (Zeiss) equipped with a complementary metal oxide semiconductor (CMOS, ORCA Flash 4.0 V2, Hamamatsu) camera and a Plan-Apochromat 100x immersion oil lens with numerical aperture 1.40 (Zeiss). We also use ZEN imaging software to acquire images. Other Epi-fluorescence microscopes and imaging software with equivalent performances can be also used in this analysis.\nAlternatives: CMOS camera and a plan-Achromat 100x lens are preferable components in standard epi-fluorescence microscope to monitor a retrograde flow of actin speckles in dendritic spines. However, epi-fluorescence microscopes with equivalent components are also applicable.\nSet the stage-top incubator of the microscope at 37°C.",
    "Note: Epi-fluorescence microscope is equipped with stage-top incubator without CO2 regulation system. During live imaging, cultured hippocampal neurons are maintained in ACSF solution containing 10 mM HEPES which enables the pH maintenance without CO2. Thus, the neuronal conditions are not affected substantially in the absence of 5% CO2.\nTransfer the TMR ligand-treated neurons in the incubator.\nSelect neurons that are strongly expressing Lifeact and weakly expressing HaloTag-actin.\nNote: Lifeact visualizes F-actins in dendritic spines, while HaloTag-actin allows to monitor the speckles of actin molecules along F-actins. A high level of Lifeact expression ensures visualization of spine morphology; a low level of HaloTag-actin expression is essential for tracing single actin molecules.\nAdjust the optimum exposure times of the two filter channels and close the field of the diaphragm to illuminate a minimum area including a dendritic spine (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1109-Fig1.jpg\nFigure 1. Representative fluorescence images of HaloTag-actin under a full-opened and reduced field of diaphragm\n(A) HaloTag-actin signals are dim in a fully illuminated field.\n(B) When the field of the microscope diaphragm is reduced to illuminate a minimum area including the spine, clear HaloTag-actin speckles (yellow arrowheads) will be seen in the spine (right). Scale bars: 1 μm for (A) and (B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1109-Fig2.jpg\nFigure 2. Dual-color fluorescence images of F-actin and HaloTag-actin in mushroom spine\n(A–C) Representative images of HaloTag-actin (A), Lifeact (B) and an overlay (C) in a mushroom spine.\nScale bar: 2 μm. See also Methods video S1[href=https://www.wicell.org#mmc1].\nCritical: Illumination of a minimum area is a key for successful speckle imaging (Figures 1[href=https://www.wicell.org#fig1] and 2[href=https://www.wicell.org#fig2], and Methods video S1[href=https://www.wicell.org#mmc1]). To increase the S/N ratio, we recommend to illuminate the target spine without reducing the light by neutral density (ND) filters.",
    "Acquire single plane time-lapse images of a spine for both HaloTag-actin and Lifeact every 2 s for 100 s.\nTo induce cLTP, replace ACSF solution containing MgCl2 to freshly prepared glycine stimulation solution and incubate for 4 min.\nCritical: To avoid a shift of the spine location, replace the solution without touching the dish.\nNote: To minimize a focus drift due to thermal changes of the microscope, pre-warm glycine stimulation solution and ACSF without MgCl2 before replacing.\nReplace glycine stimulation solution with ACSF without MgCl2 and immediately acquire time-lapse images every 2 s for 100 s.\n    Your browser does not support HTML5 video.\n  \nMethods video S1. Dual-color live imaging of mushroom spine expressing Lifeact and HaloTag-actin, related to Figure 2 and step-by-step method details: step 10\nSee Figure 2. Images were acquired 2 s for 66 s. Scale bar, 2 μm."
  ],
  "subjectAreas": [
    "Cell Culture",
    "Cell Biology",
    "Neuroscience",
    "Microscopy"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}