{
  "id": 19859,
  "origin_website": "Wiley",
  "title": "CRISPR/Cas9-enhanced Targetron Insertion for Delivery of Heterologous Sequences into the Genome of Gram-Negative Bacteria",
  "procedures": [
    "The native Ll.LtrB intron inserts into the ltrB gene of L. lactis (Mills, McKay, & Dunny, 1996[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-bib-0024]; Shearman, Godon, & Gasson, 1996[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-bib-0031]). In pSEVA6511-GIIi, this intron has been modified to recognize a different target, and this region can be further modified to use this intron to integrate into other loci of interest. Three regions within Ll.LtrB interact with the target sequence and start the retrohoming process: EBS1, EBS2, and ∂. To alter Ll.LtrB target recognition, these three components can be modified along with the corresponding IBS1 and IBS2 sites, which are homologous to the target site and are present next to the 5′ intron sequence to help with intron folding and splicing (Karberg et al., 2001[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-bib-0017]; Mohr, Smith, Belfort, & Lambowitz, 2000[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-bib-0025]). For retargeting, EBS1 and ∂ can be considered a single region because they are next to each other, so they are normally called EBS1d. Accordingly, IBS1 and IBS2 are usually referred to as the IBS region and are complementary to EBS1d and EBS2. Since three different regions need to be modified (EBS1d, EBS2, and IBS), three primers bearing the desired changes are included in the PCR reaction, along with a fourth primer that carries a short overlap region at 5′ (the EBS universal primer). After two smaller PCR products are generated, this overlap allows the coupling and amplification of both fragments in a single amplicon. This is called splicing by overlap extension or splicing by overhang extension PCR (SOEing PCR; Horton et al., 1989[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-bib-0014]) and is used here to yield a single PCR fragment with retargeted EBS and IBS sequences that will later be cloned into Ll.LtrB (Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-fig-0002]).",
    "In this protocol, the user will alter EBS1d, EBS2, and IBS by cloning the new targeting sequence generated by SOEing PCR into pSEVA6511-GIIi via Gibson assembly (Gibson et al., 2009[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-bib-0011], 2010[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-bib-0010]). As an example, we implement the steps to generate an Ll.LtrB intron that targets a region within the pyrF gene of P. putida (Galvao & de Lorenzo, 2005[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-bib-0009]). First, the ClosTron website (http://clostron.com/[href=http://clostron.com/]; Heap, Pennington, Cartman, Carter, & Minton, 2007[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-bib-0013]) is used to design primers for generating a PCR product with the retargeted region via SOEing PCR (Horton et al., 1989[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-bib-0014]). Then, this fragment is reamplified for introducing the homology regions needed to assemble the generated PCR amplicon into the linearized pSEVA6511-GIIi via Gibson cloning. The resulting plasmid will carry an intron that is able to insert into the selected region of pyrF, allowing either the generation of disruption mutants or insertion of specific sequences in this locus.\nMaterials\nQIAprep Spin Miniprep Kit (Qiagen, cat. no. 27106), including columns and buffers P1 and P2\nLB liquid medium (Nelson et al., 2002[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-bib-0026]; see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-rec-0001])\n10 mg/ml gentamycin (Gm; Sigma-Aldrich, cat. no. G1264)\nE. coli strain CC118 carrying pSEVA6511-GIIi (Manoil & Beckwith, 1985[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-bib-0019])\nMilli-Q H2O\n10× Cutsmart buffer (New England Biolabs, cat. no. B7204S)\nHpaI (New England Biolabs, cat. no. R0105S)\nHindIII (New England Biolabs, cat. no. R0104S)\nAgarose D1 medium (Condalab, cat. no. 8019)\n50× TAE buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-rec-0006])\nSYBR safe DNA gel stain (Invitrogen/Thermo Fisher Scientific, cat. no. S33102)\n5× Nucleic Acid Sample Loading Buffer (Bio-Rad, cat. no. 161-0767)\nMolecular standard (EZ Load 500-bp Molecular Ruler, Bio-Rad, cat. no. 1708354)\nNucleoSpin Gel and PCR Clean-up Kit (Macherey-Nagel, cat. no. 740609.250)\nRetargeting primers (Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-tbl-0001]; Merck or similar):\n               \nUniversal primer pEBSuniv\nSpecific primers (in our example, pyrF_165a-EBS2, pyrF_165a-EBS1d, and pyrF_165a-IBS)\nPrimers for adding homology regions: pRetarget-rev and pRetarget-fwd\nTable 1.",
    "List of Oligonucleotides Used\ntable:\n﻿Use,Name,Sequence (5′→3′),Tm (°C)\nRetargeting of Ll.LtrB group II intron to insert into the selected locus inside pyrF gene (Between nucleotides 165 and 166 in the antisense orientation),pyrF_165a-EBS1d,CAG ATT GTA CAA ATG TGG TGA TAA CAG ATA AGT CGA AGC CCT TAA CTT ACC TTT CTT TGT,80.3\n,pyrF_165a-EBS2,TGA ACG CAA GTT TCT AAT TTC GGT TAA GTG TCG ATA GAG GAA AGT GTC T,79.6\n,pyrF_165a-IBS,AAA GCT TAT AAT TAT CCT TAC ACT TCG AAG CCG TGC GCC CAG ATA GGG TG,82.9\n,pEBS universal,CGA AAT TAG AAA CTT GCG TTC AGT AAA C,66.2\nPrimers to add homology regions to the retargeting PCR fragment in order to clone it through Gibson assembly,pRetarget-rev,GTT CTC CTA CAG ATT GTA CAA ATG TGG TGA TAA CAG ATA,73.0\n,pRetarget-fwd,AGA GTC GAC CTG CAG GCA TGC AAG CTT ATA ATT ATC CTT A,77.6\nSequencing primer to verify correct retargeting of Ll.LtrB,R24,AGC GGA TAA CAA TTT CAC ACA GGA,67.3\nPrimers to build the specific spacer through annealing for its cloning into pSEVA231-CRISPR,Spacer_S,AAA CTT CGG GCA TTG TCG AAA CCC TGT GTG ACA AG,\n,Spacer_AS,AAA ACT TGT CAC ACA GGG TTT CGA CAA TGC CCG AA,\nSequencing of pSEVA backbone from Terminator T1,pS1,AGG GCG GCG GAT TTG TCC,71.7\nSequencing of pSEVA backbone from Terminator T0,pS2,GCG GCA ACC GAG CGT TC,70.6\nAmplification of Lux2 cargo,pLux_fwd,TTA TTA TAC GCG TAT GAC TAA AAA AAT TTC ATT CAT TAT TAA CGG,71.7\n,pLux2_rev,TTA TTA TAC GCG TCT CTA GCT TAG CCA TTT CTT CTG,71.5\nPrimers to check positive clones after cloning cargo sequences into the Mlu site inside Ll.LtrB,pgII_cargo_fwd,TAG TAG TCT GAG AAG GGT AAC G,52.8\n,pGIIi_cargo_rev,GTA TAC GGC TCT GTT ATT GTT C,51.0\nPrimer to check Ll.LtrB insertion into pyrF gene in combination with primer pgII_cargo_fwd,pyrF_F,ACT TGC CAA GAG ACC CTG,60.5",
    "Q5 High­Fidelity DNA Polymerase (New England Biolabs, cat. no. M0491L)\nQ5 Reaction Buffer Pack (New England Biolabs, cat. no. B9027S)\n10 mM dNTPs: prepared from individual 100 mM stocks (Roche, cat. no. 11969064001)\n2× Gibson Assembly Master Mix (New England Biolabs, cat. no. M5510AVIAL)\nCompetent E. coli CC118 cells (see Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-prot-0002])\nR24 sequencing primer (100 µM; Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-tbl-0001]; Merck)\nLB agar plates (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-rec-0002]) with 20 μg/ml Gm\nLB with 20% (v/v) glycerol (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-rec-0003])\n100-ml Erlenmeyer glass flask\n2-ml microcentrifuge tubes (e.g., Eppendorf Safe-Lock, Merck, cat. no. 0030 120.094)\n37°C orbital shaker incubator\nSpeedVac concentrator (DNA120, ThermoSavant, Thermo Fisher Scientific)\nSpectrophotometer (NanoVue Plus, GE Healthcare)\nSterile surgical blade (B. Braun, cat. no. BB520)\nClosTron website (http://clostron.com/[href=http://clostron.com/])\n0.2-ml 8-tube PCR strips and 8-cap strips (Bio-medical Laboratory Supplies, cat. nos. K77101 and B79501)\nThermocycler (Bio-Rad)\nHeating block at 42° and 50°C\n1.5-ml microcentrifuge tubes (Sarstedt, cat. no. 72.690.001)\n4-mm sterile glass plating beads or Drigalski spatula\n1.8-ml cryogenic tubes (Thermo Fisher Scientific, cat. no. 375418)\nAdditional reagents and equipment for agarose gel electrophoresis\nPrepare plasmid DNA\n1. Inoculate a 100-ml flask containing 20 ml LB plus 20 µg/ml Gm with E. coli strain CC118 from a frozen stock. Grow aerobically (shaking at 170 rpm or 11 × g) overnight at 37°C.\nTo save time, a loop can be used to directly add a few μl of frozen stock to the culture medium. Alternatively, single colonies can be isolated first by streaking the frozen stock on an LB-Gm plate, and then a single colony can be used to inoculate the medium.\n2. Split culture into four 2-ml microcentrifuge tubes, spin in a benchtop centrifuge for 1 min at ∼15,900 × g, and discard the supernatant. Repeat for a total of three spins to concentrate the cells.",
    "3. Add 250 µl buffer P1 from the QIAprep plasmid extraction kit to each tube and pipette up and down to resuspend the pellets.\nWe usually employ the Qiagen QIAprep Spin Miniprep Kit according to manufacturer's instructions. The same kit is applied for all plasmid extractions in the rest of the protocols. The volume of culture provided is recommended, but can be scaled up or down as needed.\n4. Add 250 µl buffer P2 and proceed by following manufacturer's instructions. Elute plasmid DNA using 100 µl Milli-Q H2O for each extraction column.\n5. Concentrate DNA in a SpeedVac for 30 min.\nA DNA concentration kit can be used instead of the SpeedVac, or the DNA can be eluted in a smaller volume.\n6. Combine DNA from the four tubes and quantify spectrophotometrically.\nLinearize pSEVA6511-GIIi\n7. Set up the following double digestion with HindIII and HpaI (Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-fig-0002]):\n         \n5 µl 10× CutSmart buffer\n1 µg pSEVA6511-GIIi DNA\n1 µl HpaI\n1 µl HindIII\n42 µl Milli-Q H2O\nAlternatively, linearized pSEVA6511-GIIi can be prepared by PCR using primers bearing homology regions with the retargeting fragment.\n8. Incubate 2 hr at 37°C.\n9. Prepare a 0.8% (w/v) agarose gel in 1× TAE buffer with SYBR safe DNA gel stain.\n10. Add 10 µl of 5× loading buffer to digestion and mix well. Split the 60 µl across separate wells in the gel, and add 5 µl molecular standard in a separate well. Run at 100 V until the molecular ladder is sufficiently separated.\n11. Visualize DNA fragments on a transilluminator.\nHindIII/HpaI-digested pSEVA6511-GIIi should generate a 9.95-kb fragment and a much smaller ∼300-bp fragment.\n12. Excise the 9.95-kb fragment from the gel using a razor blade and then purify the DNA using a gel purification kit.",
    "We usually employ the NucleoSpin Gel and PCR Clean-up Kit.\n13. Quantify the gel-extracted linearized vector and concentrate if the yield is >20 ng/µl.\nSelect the Ll.LtrB insertion site\n14. Select the genomic region that Ll.LtrB should recognize and to which it should retrohome (>200 bp is recommended).\nIn our example, the pyrF ORF (702 bp) was selected.\n15. Go to http://clostron.com/[href=http://clostron.com/]. Select the first “ClosTron” tab and then “Go to intron design tool”.\n16. Accept the terms and conditions, select “Perutka algorithm implemented at ClosTron.com”, and click “Start design tool”.\n17. Enter a query name (e.g., pyrF) and click “OK” (Fig. 3A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-fig-0003]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/5a59ab2e-7075-4914-93fd-ecd10fb61ab2/cpz1532-fig-0003-m.jpg</p>\nFigure 3\nMain steps of the ClosTron algorithm for designing retargeting primers. In our example, the pyrF locus was chosen as the target for Ll.LtrB insertion. (A) After accessing the ClosTron website, a name is provided for the locus to be examined (pyrF) for retargeting of Ll.LtrB. (B) The sequence of the locus needs to be added so the algorithm can calculate the best retargeting options within that sequence. (C) The algorithm then generates a ranked list of loci. The first locus corresponds to the algorithm-calculated optimal site for retargeting of Ll.LtrB. The intron insertion point is highlighted (arrow) as well as the SpyCas9 PAM sequences (5′-NGG-3′) in the correct orientation for counterselection of Ll.LtrB insertion (red boxes). The highest-ranked locus with the closer PAM sequence to the insertion site should be chosen. Lowercase s and a indicate sense and antisense.\n18. Enter the sequence of the selected genomic region (e.g., the 702-nt sequence of pyrF) and click “OK” (Fig. 3B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-fig-0003]).",
    "A list of insertion loci will be shown (Fig. 3C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-fig-0003]). Insertion loci for the sense (s) and antisense (a) strand of the query DNA sequence are listed in the 5′ →3′ orientation. This shows the DNA strand that will be recognized by Ll.LtrB and the orientation in which the intron will insert.\n19. Select the insertion locus that has the highest score and is close to a SpyCas9 CRISPR PAM sequence (5′-NGG-3′).\nIn Figure 3C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-fig-0003], the second locus (165/166a) was selected for our study. The nomenclature indicates that the retargeted intron will insert between nucleotides 165 and 166 of the query sequence in the antisense orientation.\nTo select insertion sites compatible with SpyCas9, the 5′-CCN-3′ sequence should be identified upstream of the insertion site, while 5′-NGG-3′ sequences should be identified in the region downstream of the insertion site (Fig. 3C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-fig-0003], red boxes). For further discussion, see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-prot-0003].\n20. Introduce a name for the selected locus (e.g., pyrF165a) and click “OK”.\n21. Introduce the sequence of the selected locus and click “OK”.\nFor our selected locus, the sequence is GAACTTGAGGTCCAGGAACACTTCGAAGCCCTTGTCACACAGGGT. The algorithm will return a list of four primers for retargeting Ll.LtrB. In our example, these are pEBSuniv, pyrF_165a-EBS, pyrF_165a-EBS1d, and pyrF_165a-IBS.\n22. Download the generated text file with the four primer sequences and the rest of the information (sequence used as query, whole list of target sites with scores, selected locus, and the fragment that will be generated after SOEing PCR).\nPerform first-round PCR\n23. Order the four primers (standard desalting purification, 0.025-µmol scale) and resuspend in Milli-Q H2O to the following concentrations:\n         \n100 μM pyrF_165a-IBS\n100 μM pyrF_165a-EBS1d\n20 μM pyrF_165a-EBS2\n20 μM pEBSuniv\npEBSuniv is a universal EBS primer common for all retargeting sequences, and thus only needs to be ordered once.",
    "24. Prepare a primer mix by adding 2 µl of each diluted primer to 12 µl Milli-Q H2O in a 0.2-ml PCR tube (total 20 μl).\n25. Prepare the following SOEing PCR mix in another 0.2-ml PCR tube:\n         \n1.25 µl primer mix\n1 ng undigested pSEVA6511-GIIi DNA\n5 µl 5× Q5 Reaction Buffer\n0.5 µl 10 mM dNTPs\n0.25 µl Q5 High­Fidelity DNA Polymerase\nMilli-Q H2O to 25 µl\nOne PCR reaction should be enough to obtain the necessary amount of DNA for the next step, but this can be scaled up as needed.\n26. Run in a thermocycler with following program:\n         \nDenaturation: 30 s at 98°C\n30 cycles:\n         \n10 s at 98°C (denaturation)\n10 s at 60°C (annealing)\n15 s at 72°C (extension)\nFinal extension: 2 min at 72°C\nReactions can be kept at 10°C in the thermocycler until the next step.\n27. Run product on a 0.8% agarose gel, purify the 350-bp band using a DNA extraction kit (Fig. 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-fig-0004], first gel), and quantify the purified fragment spectrophotometrically.\nA typical yield is 20-40 ng/µl.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/78e7dc6b-d540-4664-b365-2c5ccf7e60d1/cpz1532-fig-0004-m.jpg</p>\nFigure 4\nSOEing PCR to retarget Ll.LtrB in pSEVA6511-GIIi to insert into the 165a locus of pyrF. Primers designed by the ClosTron algorithm (pIBS, pEBSuniversal, pEBS2, pEBS1d) are used in SOEing PCR to produce the retargeting fragment. An intense 350-bp band is generated, along with subproducts of lower intensity. After gel purification of the retargeting fragment, a second PCR is carried out with the primers pRetarget-fwd and pRetarget-rev. These introduce homology regions (∼20 nt) at both ends of the retargeting fragment so it can be directly ligated to the HindIII/HpaI-digested pSEVA65111-GIIi through a Gibson assembly reaction.\nPerform second-round PCR",
    "The goal of the second PCR is to add homology regions that flank the SOEing PCR fragment for cloning into the linearized vector. An alternative is to add homology regions to the IBS (5′-AGAGTCGACCTGCAGGCATGC-3′) and IBS1d (5′-GTTCTCCTACAGAT-3′) primers generated by the ClosTron website after the HindIII site (AAGCTT) in the case of the IBS primer or after the BsrGI site (TGTACA) in the case of IBS1d.\n28. Prepare the second PCR mix as in step 25, but replace the primer mix and vector template with the following:\n         \n1.25 µl 5 μM pRetarget-rev primer (final 0.25 μM)\n1.25 µl 5 μM pRetarget-fwd primer (final 0.25 μM)\n0.5-1 ng purified amplicon from step 27\n29. Run with the following program:\n         \nDenaturation: 30 s at 98°C\n30 cycles:\n         \n10 s at 98°C (denaturation)\n10 s at 70°C (annealing)\n10 s at 72°C (extension)\nFinal extension: 2 min at 72°C\nAgain, reactions can be kept at 10°C in the thermocycler until the next step.\n30. Purify product using a PCR clean-up kit (e.g., NucleoSpin) and quantify spectrophotometrically.\nElectrophoresis can be performed to ensure correct amplification and to gel purify the product, but we generally see no need, as we have never encountered problems in the performance of this PCR round. A PCR clean-up protocol is sufficient to eliminate enzymes and other reagents. If electrophoresis is performed, a clear and single band should be observed (Fig. 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-fig-0004], second gel).\nPerform Gibson assembly\n31. Mix the following reagents in a 0.2-ml tube:\n         \n7.5 µl 2× Gibson Assembly Master Mix\n100 ng digested pSEVA6511-GIIi (step 13)\n10 ng PCR fragment (step 30)\nMilli-Q H2O to 15 µl\n32. Incubate 1 hr at 50°C in a heating block.",
    "The NEB protocol for Gibson assembly specifies a final reaction volume of 20 µl, but we have obtained good results and enough positive clones when scaling down to 15 or even 12 µl. The NEB protocol also states that a 15-min incubation at 50°C is enough to clone a single fragment, but we suggest always increasing the incubation time to 1 hr, although it can be shortened if needed.\nTransform bacteria, isolate plasmid DNA, and verify clone\n33. Mix 7 µl of the reaction with 70 µl competent E. coli CC118 cells in a 1.5-ml microcentrifuge tube.\nWe normally use chemically competent E. coli CC118 cells prepared in-house (see Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-prot-0002]), but a different strain or electrocompetent cells can be used. The transformation protocol should be adapted to the transformed cells.\n34. Incubate 30 min on ice (4°C), then 1 min at 42°C in a heating block, and finally 2 min on ice (4°C).\n35. Add 1 ml fresh LB and incubate 1 hr aerobically in a 37°C shaker incubator at 170 rpm.\n36. Centrifuge 1 min at ∼15,900 × g to pellet cells.\n37. Discard most of the supernatant (∼900 µl) and plate the rest on LB-Gm plates (or other appropriate antibiotic) using glass plating beads or a Drigalski spatula. Incubate overnight at 37°C.\n38. Select several colonies, extract plasmid DNA (see steps 1-6), and send for sequencing to ensure that Ll.LtrB was modified as desired.\nPrimer R24 is recommended to sequence the whole insert. In some cases, mixed sequences are found, in which only two regions of the recognition site were modified. Thus, we recommend sending at least three or four clones to ensure the desired clone is identified.\n39. Name the pSEVA6511-GIIi derivative plasmid(s).\nWe named ours pSEVA6511-GIIi-pyrF.\nPrepare glycerol stock",
    "40. Re-streak a colony of a sequence-confirmed clone onto a fresh LB-Gm plate (or appropriate antibiotic) and incubate overnight at 37°C in the case of E. coli (P. putida should be grown at 30°C).\n41. Add 3 ml LB with 20% (v/v) glycerol to the plate and scrape all cells using a bent 20-µl pipette tip or Drigalski spatula.\n42. Transfer supernatant (∼1.5 ml) to a 1.8-ml cryogenic tube and store long-term at −80°C.",
    "Competent E. coli cells are needed for transformation of Gibson assembly and ligation reactions in Basic Protocols 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-prot-0001]–3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-prot-0005]. Below is the protocol we routinely use to prepare chemical competent E. coli CC118 cells with enough transformation efficiency to carry out the cloning procedures in each protocol. Any other protocol or commercial E. coli cloning strain can be used (e.g., DH5α) provided the resulting cells have high transformation efficiency.\nAdditional Materials (also see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-prot-0001])\nE. coli CC118 cells in frozen LB-glycerol stock (Manoil & Beckwith, 1985[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-bib-0019])\nLB agar plates (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-rec-0002])\nSolution 1 (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-rec-0004])\nSolution 2 (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-rec-0005])\nSpectrophotometer\n500-ml Erlenmeyer flask\n50-ml Falcon tubes (VWR, cat. no. 525-1099)\n1. Scrape E. coli CC118 cells from a frozen stock and streak onto an LB plate to isolate single colonies. Incubate overnight at 37°C.\n2. Scrape a single colony and use to inoculate 7 ml LB. Incubate overnight at 37°C with shaking (170 rpm or 11 × g).\n3. Measure the OD600 of the overnight culture.\n4. Inoculate 100 ml LB in a 500-ml Erlenmeyer flask with enough overnight culture to give a final OD600 of 0.05.\n5. Grow at 37°C with shaking to an OD600 of 0.4 to 0.5.\nIt is important that the culture does not grow beyond an OD600 of 0.5. Incubation for 1.5 hr is usually enough.\n6. Place the flask on ice for 10 min.\nFrom this step forward, cells should be kept on ice as much as possible and all solutions should be at 4°C.\n7. Transfer culture to two 50-ml Falcon tubes and centrifuge 5 min at ∼3200 × g, 4°C.\n8. Discard supernatant and gently resuspend each pellet in 15 ml cold solution 1.\n9. Centrifuge again for 5 min at ∼3200 × g.",
    "10. Discard supernatant and gently resuspend each pellet in 2 ml cold solution 2.\n11. Dispense 150-μl aliquots into 1.5-ml microcentrifuge tubes on ice.\nEach aliquot can be used for two transformation reactions. A different volume can be aliquoted, if preferred (e.g., 70 µl/tube to add a Gibson assembly or ligation reaction directly to the tube).\n12. Close tubes and store long-term at −80°C.",
    "This protocol explains how to design and clone the specific spacer that recognizes the chosen Ll.LtrB insertion site to mediate CRISPR/Cas9-mediated counterselection. It is based on two different plasmids, pSEVA231-CRISPR and pSEVA421-Cas9tr. pSEVA231-CRISPR is the backbone plasmid for cloning the designed spacer and for expressing the corresponding crRNA. The spacer is cloned between two direct repeats (DRs) that contain sequences required for processing of the pre-crRNA and for interaction with the tracrRNA (Deltcheva et al., 2011[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-bib-0006]). pSEVA421-Cas9tr expresses both the SpyCas9 and tracrRNA.",
    "After transforming both plasmids into the desired strain, the crRNA::SpyCas9 complex is formed and the designed crRNA will direct SpyCas9 nuclease activity to the selected insertion locus of Ll.LtrB in the bacterial genome. If the SpyCas9 PAM (5′-NGG-3′) is adjacent to the recognized sequence, the endonuclease introduces a DSB that is lethal if not repaired (Cui & Bikard, 2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-bib-0005]; Jiang et al., 2013[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-bib-0015]). However, if the Ll.LtrB intron is inserted in its target sequence, the crRNA will no longer recognize this region and mutated cells will survive. Therefore, the first step to design a spacer is always to identify a PAM sequence in the immediate vicinity of the insertion locus. The further away the PAM is located, the lower the efficiency of the counterselection system, since there is a possibility that the crRNA could still bind to a part of its target and enable SpyCas9 to induce the DSB. To avoid this, a distance no greater than 6 nt is recommended (Aparicio, de Lorenzo, & Martinez-Garcia, 2018[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-bib-0002]). After finding the PAM sequence, the next step is to select the corresponding nucleotides that will compose the spacer and to design the correct sense (S) and antisense (AS) oligonucleotides that will be annealed and cloned directly into BsaI-digested pSEVA231-CRISPR. In Support Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-prot-0004], we explain how to perform an interference assay to test the efficiency of the designed spacer to kill the bacterial population, since it has been reported that this varies depending on the spacers (Aparicio et al., 2018[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-bib-0002]).",
    "In the example described here, the resulting plasmid, pSEVA231-C-pyrF1, will bear a spacer that recognizes the vicinity of the insertion locus in pyrF. This way, if Ll.LtrB retrohomes and inserts itself into its selected locus, the crRNA will no longer recognize its target and SpyCas9 will not cleave the genomic DNA. Otherwise, the cells that did not incorporate the group II intron at the expected location will have their genomes cleaved by SpyCas9.\nThis protocol was adapted from (Aparicio et al., 2018[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-bib-0002]).\nAdditional Materials (also see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-prot-0001])\npSEVA231-CRISPR plasmid DNA (Addgene, plasmid no. 138712)\nBsaI (New England Biolabs, , cat. no. R0535S)\n1.0 M NaCl\nQuick Ligation Kit (New England Biolabs, cat. no. M2200L), including Quick Ligase and 2× buffer\nLB agar plates (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-rec-0002]) with kanamycin (Km, 50 μg/ml) (Panreac Química S.L.U., cat. no. A4789.0010)\npS1 and/or pS2 sequencing primers (100 µM; Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-tbl-0001]; Merck)\nDesign spacer sequences\n1. Scan the possible insertion locus and manually identify PAM sequences (Fig. 3C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-fig-0003], red boxes).\nIt is advisable to select more than one insertion locus to have the possibility of using the spacer with the best efficiency to counterselect the WT sequence. The first 5′ nucleotide in Ll.LtrB is a G and the last 3′ nucleotide is a C, so the insertion point cannot be located between the two mandatory GG residues of the PAM recognized by SpyCas9; otherwise, after Ll.LtrB insertion, the PAM sequence would be reconstituted and Cas9-mediated cleavage will still occur (Fig. 5A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-fig-0005]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/5831b969-5899-43ae-a519-47214db0d686/cpz1532-fig-0005-m.jpg</p>\nFigure 5",
    "Design and cloning of specific spacers for CRISPR/Cas9-mediated counterselection. (A) Schematic of target locus for Ll.LtrB insertion and CRISPR/Cas9 recognition. The SpyCas9 PAM sequence (5′-GGG-3′) is highlighted in red. The selected Ll.LtrB insertion site must be near this PAM sequence for the CRISPR/Cas9 system to work. Therefore, the presence of a PAM sequence in the vicinity of the Ll.LtrB insertion site is the first feature the target locus must contain to be selected. The specific crRNA will be identical to the first 20 nt of this sequence and will consequently be complementary to the 20 nucleotides in the opposite DNA strand. (B) The first 30 nt in the 5′ direction from the PAM are selected to conform the sense (S) oligonucleotide. Likewise, the corresponding 30 complementary nt are selected to conform the antisense (AS) oligonucleotide. Additional nucleotides are added to oligos S and AS to perform the cloning procedure and to regenerate the corresponding direct repeat (DR, light green). First, 5′-aaac-3′ and 5′-aaaac-3′ sequences are added to the 5′ end of the S and AS oligos, respectively. These sequences generate sticky ends compatible with BsaI-digested pSEVA231-CRISPR. An additional G is added to the 3′ end of the S oligo that will be complementary to the last C added in the AS oligo (red asterisks). This G-C pair is needed to regenerate the DR sequence placed after the spacer sequence. After annealing, the S and AS oligos will form the spacer sequence that will be cloned into BsaI-digested pSEVA231-CRISPR.\n2. For the spacer, select the 30 nucleotides adjacent to the PAM sequence in the 5′ direction, i.e., 5′-N30-NGG-3′, where N is any of the four nucleotides.",
    "See Figure 5A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-fig-0005], where the PAM sequence is highlighted in red and the selected 30-nt spacer sequence is highlighted in green. This 30-nt sequence will comprise the S oligo, and its complementary sequence will comprise the AS primer (Fig. 5B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-fig-0005]). Do NOT include the PAM sequence in the 30-nt spacer.\n3. Add the sequence AAAC to the 5′ end and a G to the 3′ end of the S oligo (Fig. 5B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-fig-0005]). Add AAAAC to the 5′ end of the AS oligo.\nTo clone the spacer into BsaI-digested pSEVA231-CRISPR, it is necessary to add the corresponding nucleotides to both ends of the S and AS oligonucleotides to generate the proper overhang sequences to anneal with the linearized plasmid. The G added to the 3′ end of the S oligo and the C incorporated to the 5′ end of the AS oligo (Fig. 5B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-fig-0005], red asterisks) are necessary to reconstruct the downstream direct repeat in pSEVA231-CRISPR that is lost after BsaI digestion. Our spacer_S and spacer_AS sequences are shown Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-tbl-0001].\n4. Order oligos S and AS (standard desalting, 0.025-µmol scale).\nLinearize pSEVA231-CRISPR\n5. Set up the following BsaI digestion:\n         \n1 µg pSEVA231-CRISPR\n5 µl 10× CutSmart buffer\n1 µl BsaI\nMilli-Q H2O to 50 µl\n6. Incubate for 1 hr at 37°C\n7. Purify the linearized fragment on a 0.8% (w/v) agarose gel as described (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-prot-0001], steps 9-13).\nLinearized pSEVA231-CRISPR should appear as a 3.3-kb band.\nAnneal spacer S and AS oligonucleotides\n8. Add Milli-Q H2O to each spacer oligo (S and AS) to make a 100 µM stock.\n9. Prepare the following annealing mix in a 0.2-ml PCR tube:\n         \n45.5 µl Milli-Q H2O\n1 µl each 100 μM oligo (S and AS)\n2.5 µl 1.0 M NaCl",
    "10. Place in a thermocycler and run the following annealing program:\nInitial denaturation:\n         \n5 min at 95°C\nRamp down:\n         \n1 min at 95°C\ndecrease 1°C per cycle (1 min each) for 70 cycles\nHold at 12°C.\n11. Make a 1:10 dilution by adding 5 µl annealed S:AS oligos to 45 µl Milli-Q H2O.\nAnnealed oligonucleotides can be stored at −20°C.\nLigate annealed oligos and pSEVA231-CRISPR\n12. Set up the following ligation reaction:\n         \n50 ng BsaI-digested and purified pSEVA231-CRISPR (step 7)\n6 µl Milli-Q H2O\n1 µl diluted S:AS oligos (step 11)\n10 µl 2× Quick Ligation Buffer\n1 µl Quick Ligase\nAny ligase and protocol can be used.\n13. Incubate 5 min at room temperature (25°C).\nAfter room temperature incubation, ligation reactions can be stored at 4°C or –20°C if transformation will not be performed immediately.\nTransform cells\n14. Transform 7 µl ligation reaction directly into 70 µl competent E. coli CC118 cells as described (see Basic Protocol, steps 33-37), but plate cells on LB-Km plates.\n15. Re-streak several colonies on LB-Km plates to isolate individual colonies.\n16. Do a plasmid miniprep from isolated clones (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-prot-0001], steps 1-6) and send for sequencing of the cloned spacer using primer pS1 and/or pS2 (Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-tbl-0001]).\n17. Select a correct clone, prepare a frozen LB-glycerol stock, and store at −80°C (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-prot-0001], steps 40-42).",
    "Spacers exhibit different efficiencies at guiding the SpyCas9 endonuclease to the target sequence for reasons that are not well understood (Aparicio, de Lorenzo, & Martinez-Garcia, 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-bib-0003]). This protocol describes how to test the efficiency of the selected spacers (Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-prot-0003]) to guide SpyCas9 and kill the population of unmutated WT cells, allowing users to choose the best spacer before proceeding to Basic Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-prot-0006]. If a spacer is very efficient at guiding SpyCas9, the nuclease will kill a larger fraction of WT bacteria, making it easier to identify mutated clones with Ll.LtrB integrated in the right genomic locus. To this end, the P. putida strain bearing pSEVA421-Cas9tr is transformed with pSEVA231-CRISPR (control plasmid) or its derivative plasmid(s) bearing the designed spacer(s). pSEVA231-CRISPR has a spacer that is not operative in the P. putida genome, so its product will produce a crRNA that is not effective at guiding Cas9. On the other hand, derivative plasmids will produce crRNAs that are able to direct Cas9 to a target region in the P. putida genome, causing Cas9 to induce DSBs in the bacterial genomic DNA and cause cell death. The interference protocol is also adapted from Aparicio et al. (2018[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-bib-0002]).\nAdditional Materials (also see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-prot-0001])\nP. putida or desired strain previously transformed with pSEVA421-Cas9tr (Addgene, plasmid no. 138709)\n50 mg/ml streptomycin (Sm, Sigma-Aldrich, cat. no. S6501)\n300 mM sucrose (Merck, cat. no. 1.07687.1000)\n100 ng pSEVA231-CRISPR and derivative plasmid(s) (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-prot-0003])\nLB agar plates (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-rec-0002]) with Sm (100 μg/ml) and with Sm (100 μg/ml) plus Km (50 μg/ml)\n30°C orbital shaker incubator\n50-ml Falcon tubes (VWR, , cat. no. 525-1099)\nElectroporator (Bio-Rad, , cat. no. 1652100)\n2-mm gap electroporation cuvettes (Bio-Rad, cat. no. 1652086)\n10-ml culture tubes (Deltalab, cat. no. 300904)\nPrepare electrocompetent cells",
    "1. Inoculate 20 ml LB with 100 µg/ml Sm in a 100-ml flask with the P. putida strain bearing pSEVA421-Cas9tr. Grow aerobically (170 rpm or 11 × g) overnight at 30°C.\n2. Transfer culture to a 50-ml Falcon tube and centrifuge 10 min at 3200 × g, room temperature.\n3. Gently discard supernatant and resuspend pellet in 1 ml of 300 mM sucrose by pipetting up and down.\nThe bacterial pellet could be loosely attached to the tube after centrifugation. Removing the supernatant gently with a pipette is recommended to avoid an excessive cell loss.\n4. Transfer culture to a 1.5-ml microcentrifuge tube and spin cells 1 min at ∼15,900 × g in a benchtop centrifuge.\n5. Repeat steps 3-4 for a total of at least five washes. Resuspend the final pellet in 400 µl of 300 mM sucrose.\nThe final volume of competent cells is usually more than 400 µl because the pellet is loosely attached, making it challenging to remove all the supernatant without losing cells. Add 400 µl sucrose after removing as much of the supernatant as possible.\n6. Divide competent cells into 100-µl aliquots in 1.5-ml microcentrifuge tubes.\nAll steps for preparation of electrocompetent P. putida cells are performed at room temperature.\nPerform transformation\n7. Add 100 ng of the desired plasmids (pSEVA231-CRISPR control or derivatives) to separate aliquots of electrocompetent cells and mix gently.\n8. Transfer each mixture to a separate 2-mm-gap electroporation cuvette.\n9. Electroporate at 2.5 kV and immediately add 1 ml fresh LB with 100 µg/ml Sm. Mix well and transfer to separate 10-ml culture tubes.\n10. Allow electroporated cells to recover 2 hr at 30°C with shaking at 170 rpm.",
    "11. Plate appropriate dilutions of each electroporation reaction on two plates: LB-Sm plates to assess viability after electroporation and LB-Sm-Km plates to count transformant clones.\nWe recommend 100 µl of 10–6 and 10–7 dilutions of each reaction on LB-Sm plates, 100 µl of 10–1 and 100 (direct) dilutions for pSEVA231-CRISPR derivative plasmid(s) on LB-Sm-Km plates, and 100 µl of 10–5 and 10–6 dilutions for control pSEVA231-CRISPR on LB-Sm-Km plates. These volumes and/or dilutions should be adjusted if an appropriate number of colonies (30-300 CFU) is not found.\n12. Incubate plates at 30°C until colonies appear (16-32 hr) and count CFU.\nColonies may take longer to grow on plates with two antibiotics. At a glance, there should be a clear difference between the number of transformants from control plasmid (pSEVA231-CRISPR) and its derivative(s), but the viability of both should be similar.\nEvaluate transformation efficiency\n13. Calculate transformation efficiency:\n         \nDivide CFU on LB-Sm-Km (transformant clones) by CFU on LB-Sm (viable cells).\nNormalize to 109 viable cells to be able to compare the two conditions.\nAny other type of normalization is fine.\n14. Divide the transformation efficiency of pSEVA231-CRISPR by the transformation efficiency of the derivative(s) to obtain the ratio of efficiency.\nThis ratio should be close to 100 to ensure an efficient counterselection.",
    "This protocol describes the basic steps for inserting the desired cargo sequence (in this example, a 300-bp fragment) into Ll.LtrB. The best region for this within Ll.LtrB is domain IVb (Plante & Cousineau, 2006[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-bib-0028]). In pSEVA6511-GIIi, Ll.LtrB has been engineered to contain an MluI restriction site at this location. By performing a simple PCR step to add MluI sites to the cargo of interest, users can clone heterologous sequences into Ll.LtrB that will be delivered to the bacterial genome of choice.\nAdditional Materials (also see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-prot-0001])\nPlasmid DNAs:\n               \npSEVA256 (available upon request from the SEVA collection, http://seva-plasmids.com/[href=http://seva-plasmids.com/])\nPlasmid DNA of retargeted pSEVA6511-GIIi (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-prot-0001])\nPlasmid DNA of original pSEVA6511-GIIi (if this protocol is performed before retargeting; see Strategic Planning)\nMluI (New England Biolabs, cat. no. R01985S)\nNEBuffer 3.1 (New England Biolabs, cat. no. B7203S)\nQuick Ligation Kit (New England Biolabs, cat. no. M2200L), including Quick Ligase and 2× buffer\nPrimers pgII_cargo_fwd and pGIIi_cargo_rev (100 µM; Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-tbl-0001]; Merck)\n2× AmpliTools Green Master Mix (Biotools, cat. no. 10.432-4750)\nPrepare cargo with MluI sites\n1. Select the sequence of the fragment to be delivered.\nWe chose a 300-bp sequence of the luxC ORF in Ll.LtrB that we call the Lux2 fragment (Fig. 6[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-fig-0006]). There is a limit to the size of cargo that Ll.LtrB introns can carry, and this varies between species and insertion locus. In general, cargos longer than 1 kb can be difficult to deliver using this system.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/a02ba65f-8baf-48b9-b8a7-2dfe9b769e7a/cpz1532-fig-0006-m.jpg</p>\nFigure 6",
    "Cloning of cargo fragments into the Ll.LtrB intron. In our example, a 300-bp fragment from luxC was chosen as cargo to be delivered by Ll.LtrB. Primers bearing MluI sites (5′-ACGCGT-3′) are used to amplify the cargo through a simple PCR reaction. After cleaning of the PCR amplicon, MluI is used to digest the fragment and generate sticky ends compatible with MluI-digested pSEVA6511-GIIi plasmid or a retargeted derivative (in our example, spSEVA6511-GIIi-pyrF). Finally, ligation of the digested fragment and plasmid will generate a pSEVA6511-GIIi derivative carrying the cargo of interest.\n2. Design forward and reverse primers for amplification of the cargo and add MluI sites at the 5′ end of both primers.\nIn our example, we designed and ordered primers pLux_fwd and pLux2_rev (Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-tbl-0001]).\n3. Order primers (standard desalting purification, 0.025-µmol scale) and resuspend in Milli-Q H2O to a concentration of 100 μM. Then prepare a separate stock of each primer by diluting an aliquot in Milli-Q H2O to a final concentration of 5 µM.\n4. Set up the following PCR reaction:\n         \n1 ng template DNA (in our case, pSEVA256 plasmid DNA)\n10 µl forward primer (final 1 µM) (in our case, pLux_fwd)\n10 µl reverse primer (final 1 µM) (in our case, pLux2_rev)\n0.5 µl Q5 polymerase\n10 µl 5× Q5 reaction buffer\nMilli-Q H2O to 50 µl\n5. Run in a thermocycler with the following program:\n         \nDenaturation: 30 s at 98°C\n30 cycles:\n         \n10 s at 98°C\n10 s at the annealing temperature (61°C in our case)\n10 s at 72°C for extension\nFinal extension: 2 min at 72°C\nThe annealing temperature was chosen using the NEB Tm calculator tool (https://tmcalculator.neb.com/#!/main). Reactions can be kept at 10°C in the thermocycler until the next steps are performed.",
    "6. Purify PCR fragment on a 0.8% (w/v) agarose gel and quantify the DNA spectrophotometrically (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-prot-0001], steps 9-13).\nLigate cargo and vector\n7. Set up two separate digestions, one with retargeted pSEVA6511-GIIi (in our case, pSEVA6511-GIIi-pyrF) and one with purified cargo PCR fragment (step 5):\n         \n5 µl 10× NEBuffer 3.1\n1 µg pSEVA6511-GIIi derivative or cargo\n1 µl MluI\nMilli-Q H2O to 50 µl\n8. Incubate 2 hr at 37°C.\n9. Purify both DNAs and quantify spectrophotometrically.\n         \na. For MluI-digested pSEVA6511-GIIi derivatives, gel purify on a 0.8% (w/v) agarose gel (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-prot-0001], steps 9-13) to ensure high purity of the linearized vector.\nb. For MluI-digested cargo, use a PCR clean-up kit (e.g., NucleoSpin).\n10. Set up the following ligation reaction (1:3 molar ratio of vector to insert):\n         \n50 ng MluI-digested pSEVA6511-GIIi\n4.5 ng MluI-digested cargo\n10 µl 2× Quick Ligation Buffer\n1 µl Quick Ligase\nMilli-Q H2O to 20 µl\nAny other ligation protocol and kit can be used.\n11. Incubate 5 min at room temperature (25°C).\nPerform transformation and select desired transformants\n12. Transform 7 µl ligation reaction into chemically competent E. coli CC118 cells (or other E. coli cloning strain) as described (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-prot-0001], steps 33-37), plating transformed cells on LB-Gm plates.\n13. Set up colony PCR reactions to identify positive clones using the following volumes per reaction:\n         \n4.8 µl Milli-Q H2O\n0.6 µl 5 μM pgII_cargo_fwd (final 0.25 µM)\n0.6 µl 5 μM pGIIi_cargo_rev (final 0.25 µM)\n6 µl 2× DNA AmpliTools Green Master Mix",
    "14. Use a 20-μl pipette tip to scrape out a single colony from an LB-Gm plate and make a small patch on a fresh, labeled LB-Gm plate. Next, introduce the tip to a correspondingly labeled tube with the reaction mix and swirl or pipette up and down to release the cells. Repeat with all colonies to be checked.\nWe recommend testing at least eight different colonies.\n15. Place PCR tubes in a thermocycler and run the following program:\n         \nDenaturation: 5 min at 95°C\n30 cycles:\n         \n30 s at 95°C\n30 s at annealing temperature (50°C in our case)\n60 s per kb at 72°C for extension (40 s in our case)\nFinal extension: 5 min at 72°C\nThe time needed for extension depends on the length of the insert. Primers pgII_cargo_fwd and pGIIi_cargo_rev anneal in vector pSEVA6511-GIIi flanking the MluI site. If the 300-bp insert is not cloned, this colony PCR will yield a 351-bp fragment. If it is cloned, the final fragment will be 651 bp. For this reason, the amplification time is 40 s.\nThe annealing temperature was chosen using the NEB Tm calculator tool (https://tmcalculator.neb.com/#!/main). Reactions can be kept in the thermocycler at 12°C until use.\n16. Run 6 µl of each reaction on a 0.8% (w/v) agarose gel to check for clones with the right amplicon size.\nWith the suggested primers, the amplification product will generate a band of 357 bp plus the length of the cargo (in our case, 357 + 300 = 657 bp). Negative clones will generate a band of 357 bp.",
    "Alternatively, PCR can be performed using a primer annealing inside the fragment to be cloned in combination with a primer annealing in the corresponding flanking sequence within the intron. In this case, an amplicon will only be generated if the fragment was successfully cloned in the desired orientation.\n17. Select positive clones and start overnight cultures in 6-ml LB with 20 µg/ml Gm.\n18. Prepare a miniprep of plasmid DNA and send for sequencing with either the pgII_cargo_fwd or pGIIi_cargo_rev primer.\nSince only one restriction enzyme (MluI) is used to linearize the backbone, cargo fragments can be cloned in the sense or antisense orientation. Consequently, we advise sending at least two positive clones for sequencing, as there should be a 50% probability of finding the desired clone.\n19. Identify clones with no mutations and with the cargo inserted in the desired orientation.\n20. Prepare stocks in LB-glycerol and store at −80°C (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-prot-0001], steps 40-42).",
    "This protocol describes how to perform an Ll.LtrB insertion assay in combination with CRISPR/Cas9-mediated counterselection employing the plasmids generated in Basic Protocols 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-prot-0001]–3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-prot-0005]. After completing those protocols, users will have the following two plasmids: (1) a pSEVA6511-GIIi derivative plasmid (in our case, pSEVA6511-GIIi(Lux2)-pyrF) that has an Ll.LtrB intron retargeted to the desired insertion locus (in our case, the 165a locus of pyrF) and a cargo fragment (in our case, a 300-bp fragment from luxC gene) cloned into the MluI site within the Ll.LtrB sequence, and (2) a pSEVA231-CRISPR derivative with a specific spacer to counterselect the WT insertion locus (in our case, pSEVA231-C-pyrF1) (Aparicio et al., 2018[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-bib-0002]). Once these two vectors are ready, the insertion experiment can be carried out as described here (Fig. 7[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-fig-0007]). It should be noted that the induction conditions can be adapted based on users’ needs and constraints and are not necessarily optimal.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/7a57855d-b62b-44c0-8663-861aa1f48bec/cpz1532-fig-0007-m.jpg</p>\nFigure 7",
    "Schematic of Basic Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-prot-0006] for a general insertion assay with the Ll.LtrB/CRISPR/Cas9 system. After transforming pSEVA421-Cas9tr and the corresponding pSEVA6511-GIIi derivative into the selected P. putida strain, an overnight culture is grown at 30°C with shaking. Then, cyclohexanone (Cyc) is added to the cells at a final concentration of 1 mM, and cells are incubated for an additional 4 hr at 30°C to induce Ll.LtrB expression. This will yield two populations of cells: wildtype cells (WT) that did not incorporate Ll.LtrB and engineered cells with Ll.LtrB incorporated at the target locus. Next, cells are washed with 300 mM sucrose to make them competent and then electroporated with the pSEVA231-CRISPR derivative. LB plates supplemented with both Km and Sm are used to select clones that survived the CRISPR/Cas9-mediated DSB created in their genome. These clones are later surveyed to find insertion mutants with the Ll.LtrB inserted in the right position. Finally, the resulting engineered strain should be cured of the three plasmids it contains.\nAdditional Materials (also see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-prot-0001] and Support Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-prot-0004])\nPlasmid DNAs:\n               \npSEVA6511-GIIi derivative with cargo (see Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-prot-0005]; in our case, pSEVA6511-Gii(Lux2)-pyrF)\npSEVA421-Cas9tr (Aparicio et al., 2018[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-bib-0002])\npSEVA231-CRISPR derivative (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-prot-0003]; in our case, pSEVA231-C-pyrF1)\nSelection antibiotics:\n               \n10 mg/ml gentamycin (Gm, Sigma-Aldrich, cat. no. G1264)\n50 mg/ml streptomycin (Sm, Sigma-Aldrich, cat. no. S6501)\n50 mg/ml kanamycin (Km, Panreac Química S.L.U., cat. no. A4789.0010)\n9.6 M cyclohexanone (Sigma-Aldrich, cat. no. 29140)\nPrimers to detect Ll.LtrB insertion (in our case, pgII_cargo_fwd and pyrF_F; Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-tbl-0001]; Merck)\n30°C orbital shaker incubator\n50-ml Falcon tubes (VWR, cat. no. 525-1099)\nTransform cells with plasmids",
    "1. Prepare electrocompetent P. putida cells and sequentially transform with pSEVA6511-GIIi derivative (e.g., pSEVA6511-Gii(Lux2)-pyrF) and pSEVA421-Cas9tr (see Support Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-prot-0004], steps 1-12), selecting transformants on LB plates with the corresponding antibiotic (100 µg/ml Sm and/or 30 µg/ml Gm).\nWe advise to perform sequential transformations of each plasmid separately. The order in which you transform the plasmids is not important, but if different pSEVA6511-GIIi derivatives are going to be tested, it is easiest to first transform pSEVA421-Cas9tr and use this strain as the parental strain for transforming each pSEVA6511-GIIi derivative.\n2. Check the integrity of both plasmids by performing a miniprep and enzyme digestion.\nIn our example, a double digestion with PacI and SpeI will generate a single 8.5-kb band from pSEVA421-Cas9tr and 5- and 5.5-kb bands from pSEVA6511-GIIi(Lux2)-pyrF.\n3. Prepare glycerol stocks of the generated strain containing both plasmids and store at −80°C (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-prot-0001], steps 40-42).\nPerform insertion of Ll.LtrB\n4. Inoculate a 100-ml flask containing 20 ml LB with Gm (30 µg/ml) and Sm (100 µg/ml) with the generated strain (Fig. 7[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-fig-0007], top).\nWe recommend stocking each strain generated after plasmid transformation, but a single colony from step 3 can be used to start this culture to save time.\n5. Incubate aerobically (170 rpm or 11 × g) overnight at 30°C.\n6. Induce Ll.LtrB expression by adding cyclohexanone at a final concentration of 1 mM and incubating 4 hr in a 30°C shaker incubator (170 rpm).\nCyclohexanone activates expression of Ll.LtrB in pSEVA6511-GIIi from the ChnR-PChnb repressor-promoter system. The induction time can be tuned to the users’ needs.\nUsing the 9.6 M cyclohexanone from Sigma-Aldrich, add 2.1 µl per 20 ml to obtain a concentration of 1 mM. If a smaller volume of culture is to be induced, cyclohexanone can be first diluted in DMSO.",
    "7. Transfer cells to a 50-ml Falcon tube and centrifuge 10 min at 3200 × g, room temperature.\n8. Prepare electrocompetent cells (see Support Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-prot-0004], steps 3-6).\n9. Add 100 ng pSEVA231-CRISPR derivative (in our case, pSEVA231-C-pyrF1) to 100 µl electrocompetent cells in a 1.5-ml tube.\n10. Transfer mixture to a 2-mm-gap electroporation cuvette and electroporate at 2.5 kV.\n11. Immediately add 1 ml LB with Sm (100 µg/ml), transfer to a 10-ml culture tube, and incubate aerobically (170 rpm) for 2 hr at 30°C\n12. Plate 100 µl of appropriate dilutions (we recommend undiluted and a 1/10 dilution) on LB-Sm-Km plates using glass plating beads or a Drigalski spatula. Grow overnight to 2 days at 30°C.\nAfter electroporation, and because of the presence of two antibiotics in the medium, cells may grow more slowly and should be incubated longer if no colonies can be seen after 16 hr. Dilutions can also be plated on LB with Sm alone to check viability after electroporation and to check the efficiency of the insertion process.\nCells that survive electroporation of pSEVA231-C-pyrF1 and grow in LB-Sm-Km plates are potential mutated cells that have incorporated Ll.LtrB::Lux2 in the correct locus (Fig. 7[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-fig-0007], bottom). A higher number of Sm/Km-resistant clones should be observed compared to the number in Support Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-prot-0004] after testing the selected spacer. Nevertheless, Ll.LtrB insertion efficiency can be low, so this increment may be difficult to detect.\nIdentify correct insertion by colony PCR\n13. Test Sm/Km-resistant colonies by colony PCR as described (see Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-prot-0005], steps 13-16), but use the following primers in step 13 and an amplification time of 1 min:\n         \n0.6 µl 5 µM pgII_cargo_fwd (final 0.25 µM)\n0.6 µl 5 µM primer pyrF_F (final 0.25 µM)",
    "To detect insertion in the chromosome, one primer should be in the vicinity of the selected target locus. Because our target is in the pyrF gene, we designed primer pyrF_F (Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-tbl-0001]). The second primer should anneal inside the cargo sequence or Ll.LtrB intron (in our case, primer pgII_cargo_fwd).\nIn our example, and with the suggested primers, the amplification product will be a 928-bp band if there is indeed an insertion. No band will be seen from negative insertion clones (Fig. 8[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-fig-0008], bottom).\nBecause the efficiency of each insertion may differ, there is no clear number of clones that should always be tested. We advise checking at least 16 different colonies, and increasing this number with the size of the insert (i.e., the bigger the insert, the more clones should be screened).\nAlternatively, a PCR reaction using both flanking primers can be performed and purified to send for sequencing to corroborate the correct insertion of the Ll.LtrB and cargo sequences.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/ff9b7a9d-64b2-41f4-affa-aa023d8609e6/cpz1532-fig-0008-m.jpg</p>\nFigure 8\nPCR assay to check the presence of Ll.LtrB in the genome of cells that survived CRISPR/Cas9-mediated cloning. In our example, an Ll.LtrB derivative with a 300-bp cargo (Lux2) was delivered into the selected 165a locus of the pyrF gene in the P. putida genome. Colony PCR was performed to check the presence of Ll.LtrB::Lux2 in this locus. In the clones where Ll.LtrB retrohomed correctly, a 928-bp fragment is generated. No amplicon is generated from wildtype (WT) clones with no insertion, and a shorter fragment (629 bp) is generated from clones with empty Ll.LtrB inserted in the same place. The positions of primers used is shown with blue and yellow arrows.\n14. Prepare an LB-glycerol stock of the final strain and store at −80°C (Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-prot-0001], steps 40-42).",
    "At the end of the insertion protocol, a resulting bacterial strain harbors three plasmids that should be eliminated to avoid interference in future applications, e.g., if new plasmids are to be introduced for different purposes. This protocol explains the main steps to remove the plasmids from bacterial cells and can be adapted to species other than P. putida. The general idea is to carry out several passages without selection pressure (i.e., without antibiotics) until a cell can be found that is sensitive to all the antibiotic markers in the plasmids.\nMaterials\nSequence-confirmed insertion strain (see Basic Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-prot-0006]), plate or frozen stock\nLB medium (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-rec-0001])\nLB agar plates (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-rec-0002]) with Km (50 µg/ml), Gm (30 µg/ml), or Sm (100 µg/ml)\nPrimers to detect Ll.LtrB insertion (in our case, pgII_cargo_fwd and pyrF_F; Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-tbl-0001])\n10-ml culture tubes\n30°C orbital shaker incubator\n1. Inoculate 3 ml LB in a 10-ml culture tube with the desired strain and incubate overnight at 30°C with shaking (170 rpm or 11 × g).\n2. Dilute overnight 1/1000 in fresh LB and then inoculate 3 ml fresh LB in a second 10-ml tube with 3 µl diluted culture. Incubate 6 hr at 30°C with shaking.\n3. Inoculate 3 ml fresh LB in a third 10-ml tube with 3 µl culture and grow overnight at 30°C.\nIt is common not to observe visible growth after the 6-hr incubation.\n4. Repeat steps 2-3 at least ten times.\nAn additional passage can be performed by streaking part of the culture onto an LB plate and starting again from step 1 by picking a single colony grown overnight at 30°C or over the weekend at room temperature.\n5. Streak final culture on an LB plate to obtain individual clones.",
    "6. Streak individual clones on separate LB-Gm, LB-Km, and LB-Sm plates.\nWe recommend streaking at least 50 clones.\n7. Select one colony that is sensitive to all antibiotics and confirm by PCR that the desired modification is present (see Basic Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-prot-0006], step 13).\nIt is also advisable to check by PCR that the plasmids are not present and have been successfully removed.\n8. Prepare a glycerol stock and store at −80°C (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.532#cpz1532-prot-0001], steps 40-42).\nIf all checked colonies are still resistant to any antibiotic, repeat the process from step 1 to 5 and check new clones."
  ],
  "subjectAreas": [
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}