{
  "id": 11416,
  "origin_website": "Jove",
  "title": "A Visual Guide for Studying Behavioral Defenses to Pathogen Attacks in Leaf-Cutting Ants",
  "procedures": [
    "1. Escovopsis isolation\nIsolate Escovopsis strains from Acromyrmex echinatior laboratory colonies, by placing fungus garden fragments, with ants removed, on a Petri dish with moist cotton wool for several days until Escovopsis germinates and sporulates. Transfer spores to potato dextrose agar plates (PDA, 39 g/L) and incubate at ca. 23°C for approximately two weeks.\n\tNote: One strain was used in the current study.\nUse a sterile needle to pick out mature spores from these first plates. Pick enough spores to cover the tip of the needle.\nInoculate spores on new plates under sterile conditions and incubate at ~ 23 °C for approximately two weeks.\nWhen hyphae have covered the entire plate and grown into mature brown spores, repeat step 1.3 but this time with spores from the new PDA plate.\nRepeat the process until a clean stock of Escovopsis for each strain is acquired (no visible contaminants growing on or below the plate surface).\n2. Experimental set-up\nUse three A. echinatior colonies.\n\tNote: Here the colonies Ae160b, Ae322 and Ae263 were used.\nFrom each colony, make 12 sub-colonies. Make six sub-colonies for observation after 0 h and six sub-colonies for observation after 72 h. This gives a total of 36 sub-colonies; mark half of the sub-colonies from each ‘parent’ colony as control, and the other half as ‘Escovopsis treatment’.\n\tNote: While in parent colonies the presence of a queen affects worker behavior, we expect (although this cannot be guaranteed), that queen-less sub-colonies are likely to behave as queenright colonies for the short period of time that the experiment runs.\nFor each sub-colony, use a square box of length: ~ 3.15 in (8 cm), width: ~ 2.17 in (5.5 cm) and depth ~ 1.77 in (4.5 cm).",
    "Note: The important point is to provide enough space for ants outside the fungus fragment to forage and dump waste, but at the same time to make the box small enough that filming and behavior recognition is feasible.\nFor each sub-colony, add a tea-spoon sized (approximately 2.2 cm3 and 1.2 g) piece of the central part of the fungus garden (L. gongylophorus) from the original colony, a couple of bramble leaves, and a piece of cotton wool soaked in water.\n\tNote: The cotton wool provides humidity. It should not be dripping with water, and should not touch the fungus garden.\nFor sub-colonies treated with Escovopsis, use an inoculation loop and fill the opening so it is just covered by Escovopsis spores. Inoculate the spores by gently tapping a small, localized part of the fungus garden ten to twenty times so that spores are not too clustered.\nFor sub-colonies used as controls, mimic the application of Escovopsis to the fungus garden with a sterile inoculation loop.\n\tNote: Although this was not done in the present experiment, the inoculation of a sterile powder (like graphite or talcum powder) can be done at this stage to differentiate between an infection with a pathogen and an inert agent.\nFor 72 h observations, leave half of the sub-colonies (both controls and infected) for 72 h after introduction of Escovopsis before adding ants or initiating video recording.\n\tNote: Waiting 72 h in the absence of ants makes it likely that Escovopsis spores will germinate (unpublished in vitro data); although this also increases the chance of other infections (for example, from a fungus already present in the fungus garden), this time period is preferable for this treatment to represent the early stage of an established infection.",
    "For 0 h observations, directly after step 2.6 and approximately 30 min before recording, add two brood, four minor workers and four major workers simultaneously from the parent colony to each box.\n\t\nUse two major workers from within the garden that are young with light pigment, with Actinobacteria covering most of the cuticle. Take the other two from outside the garden, with dark pigment and Actinobacteria only covering the laterocervical plates.\nFor 72 h observations, repeat 2.8 and 2.8.1 at 30 min before recording, i.e., 71.5 h after inoculation with Escovopsis.\n\tNote: Experimental sub-colonies are significantly smaller than established natural Acromyrmex colonies. This is necessary in order to accurately record behavior. While this may influence the frequency of some behaviors qualitatively, the composition of sub-colonies was chosen to reflect the mix of workers in natural colonies to more likely qualitatively reflect the behavioral interactions.\n3. Video recording and scoring behaviors\nUse a USB endoscope attached to a laptop (or equivalent) and provide sufficient light.\nFor each sub-colony, perform video recording for 4 h (starting at either 0 h or 72 h post-infection).\nAfter recording the 36 sub-colonies, review the total of 144 h of footage and score all behaviors of interest for all individuals in each sub-colony.\n\tNote: In the current experimental example, we had to exclude two sub-colonies (a control from colony Ae160b and a treatment sub-colony from colony Ae322) due to infection with fungi other than Escovopsis, reducing the total number of hours of observations to 136.\nEach time a behavior is observed, record it as 1 occurrence.\nNote: A behavior can be of short or long duration, but only score it as > 1 if it is interrupted by another behavior, or if the ant is passive for a period of time.\n4. Behaviors",
    "Note: Behavioral definitions were made using a combination of descriptions from previous studies23,27,28,31,45 and personal observations. For a detailed illustration showcasing important morphological structures used in the protocol for recognition of behaviors, see Figure 1.\nSelf-grooming and antenna cleaning (Video 1)\n\t\nNotice if the ant stops leg movement to initiate self-grooming. Check that the antennae are pulled through the antenna cleaners on the front legs (Figure 1), a clamp-like structure located on the tibia-tarsus joint consisting of a notch facing a spur with different sized bristles and combs45,46.\nAfter cleaning the antenna, observe that the ant will clean the legs and the antenna cleaners, by pulling the legs through the mouthparts, removing particles and potential pathogens with the glossa (Figure 1).\n\t\tNote: Self-grooming can consist of cleaning the antenna and subsequently the antenna cleaners (Figure 1), but also using mouthparts to clean the legs. When an ant is cleaning its legs, it most often cleans all six legs in succession.\nFungus grooming (Video 2)\nNotice if the ant stops leg movements at a fixed point on the fungus garden. Observe that the antennae are motionless and parallel pointed towards the fungus so that the angle between the scape and funiculus (Figure 1) is approximately 45°, and the tip of the antennae are almost touching each other, close to the tips of the mandibles (Figure 1).\nNote that the upper (maxillae) and lower (labium) mouthparts are open, with the glossa (Figure 1) emerging to lick the fungus.\nAllogrooming (Video 3)\nObserve this behavior when one or more ants have approached another (recipient) ant or vice versa. During the behavior, the ants stop movement and stand closely together with physical contact. The grooming ant(s) may move slightly to cover a larger area of the recipient ant’s body.",
    "Observe that the antennae of the actor(s) can be motionless and pointed towards a specific point of the receiving ant or moving and lightly tapping the receiver. The angle between the scape and the funiculus (Figure 1) is approximately 45° depending on whether they are fixed on a specific point or tapping. The tips of the actor’s antennae are usually close to each other and the tips of the mandibles (Figure 1).\nNote that the upper (maxillae) and lower (labium) mouthparts are open, with the glossa (Figure 1) emerging to lick the receiver ant.\nMetapleural gland grooming (Video 4)\n\t\nObserve when the ant stops movement to initiate metapleural gland (Figure 1) grooming. Note that the ant leans to one side to reach one of its front legs back to rub the opening (meatus) of the metapleural gland (for example, the right front leg).\n\t\tNote: The other front leg is simultaneously (in this example the left front leg) licked by the glossa (Figure 1).\nCheck that the ant leans to the opposite side and switches legs and repeats the same motion with the opposite legs. The ant continues to move the front legs to the metapleural glands and subsequently to the glossa constantly switching between legs (Figure 1).\n\t\tNote: In this example, the ant will now pass the left front leg to the metapleural gland and the right front leg to the glossa (Figure 1). After metapleural gland (Figure 1) grooming, the ant often initiates self-grooming (Step 4.1).\nSpore weeding (Video 5)",
    "Observe this behavior when the ant stops leg movements at a fixed point on the fungus garden. Observe that the antennae are motionless and parallel, pointed towards the fungus so that the angle between the scape and funiculus is approximately 45°, and the tips of the antennae are almost touching each other and the tips of the mandibles (Figure 1).\nCheck that the ant opens its mandibles (Figure 1) to grab visible Escovopsis spores and detach them from the fungal crop by pulling them off. The ant carries the cluster of spores out of the nest, while the antennae are gently moving for orientation. The antennae may be cleaned through the antenna cleaners (Figure 1; see Video 1) while holding the cluster of spores. The ant drops the spores off in a waste pile.\n\t\tNote: Recording of activity around the waste pile was not done in the current experiment but would be a suitable extension of the current protocol.\nFungus weeding (Video 6)\nObserve this behavior when the ant stops leg movements at a fixed point of the fungus. The antennae are loosely pointed towards the part of the fungus the ant is attempting to remove, while slightly tapping the fungus piece.\nObserve that the ant uses its mandibles to either cut through the fungal crop to detach a specified area, or to grab a part of the fungus piece with its mandibles (Figure 1). The ant will simultaneously rock from side to side on its legs, while it pulls off the fungus piece.",
    "Note: Weeding can be done by multiple workers and by both minors and majors. If so, some ants do the fungus cutting, others carry out the rocking and pulling motion. The detached part of the fungus is carried outside the nest and dropped off in the waste pile. Recording of the waste deposit was not done in the current experiment but would be a suitable extension of the current protocol.\nFecal fluid grooming (Video 7)\nObserve this behavior when the ant stops leg movements at a fixed point on the fungus garden. The ant bends its gaster (Figure 1) and head towards each other to apply a droplet of fecal fluid to the mouthparts.\nObserve that the ant pulls the front legs through the mandibles (Figure 1), one at a time. Subsequently, the ant moves the antennae through the antenna cleaners (Figure 1) located on the tibia-tarsus joint of the front legs.\nDroplet regurgitation (Video 8)\nObserve this behavior when the ant stops leg movements at a fixed point of the fungus. The antennae are motionless and parallel, pointed towards the fungus so that the angle between the scape and funiculus is approximately 45°, and the tips of the antennae almost touch each other and the tips of the mandibles (Figure 1).\nObserve that the ant regurgitates a droplet of liquid on to the fungus, varying from being transparent to light yellow or even brown, from its mouthparts."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}