{
  "id": 18611,
  "origin_website": "Jove",
  "title": "Use of Electromagnetic Navigational Transthoracic Needle Aspiration (E-TTNA) for Sampling of Lung Nodules",
  "procedures": [
    "A protocol was approved by the local Institutional Review Board (IRB). Participants provide signed informed consent prior to completing the protocol.\n1. Pre-procedure\nEnsure that the candidates for the electromagnetic navigational transthoracic needle aspiration have a peripheral pulmonary nodule. Determine the pulmonary nodule use of imagining studies.\n\tNOTE: The most common one and needed for this protocol is by evaluating previously obtained chest CT.\nOn the day of the procedure attach the electronic reference point pads to the contralateral hemithorax of the target lesion to minimize pad overlap with the TTNA biopsy entrance point. Obtain a baseline inspiratory and expiratory non-contrast chest tomography with 0.5 mm intervals and 0.67 - 0.75 mm thickness.\nTransfer the digital imaging and communication in medicine (DICOM) data from the CT scanner to the planning software. If DICOM is unavailable, a compact disk (CD) copy of the CT can be directly loaded onto the system for planning. Digitally select the target lesion and reconstruct a three-dimensional virtual airway map.\nTransport the patient by stretcher from the CT scanner to the bronchoscopy suite with electronic reference points in place.\nEvaluate the patient for anesthesia, establish I.V. access and attach standard anesthetic monitoring.\n class=\"jove_title\"2. Procedure (Bronchoscopic Phase)\nTransfer the patient to the bronchoscopy suite. Administer deep sedation anesthesia using a propofol infusion (100 - 200 mcg/kg/min). An airway is established with laryngeal mask airway (LMA) or endotracheal tracheal tube (ETT).\n\tNOTE: Anesthesia can only be administered by a certified provider.\nPerform a white light bronchoscopy (WLB) inspection in the standard fashion examining the tracheobronchial tree to the segmental level.",
    "Perform an EBUS-TBNA following the International Association for the Study of Lung Cancer (IASLC) lymph node map for lung cancer staging. If available, fine needle aspiration (FNA) specimens are cytological analyzed on-site. If not, the sample is place in formalin for later evaluation.\nUse the WLB bronchoscope with the EMN bronchoscopy program phase following the previously computer recognized or manually planed endobronchial pathway to the target lesion with an instrument of choice at the proceduralists discretion (Cytology brush, jaw biopsy forces, FNA Needle).\nAdvance the R-EBUS through the working channel and attempt to confirm the location of the lesion.\nOnce in the target, sample the lesion with the operator selected trackable instrument used to navigate. (Cytology brush, jaw biopsy forces, FNA Needle).\nIf the target is unable to be verified by radial EBUS or the airway anatomy prohibits endobronchial navigation remove the bronchoscope and prepare the patient for a transthoracic approach.  If the lesion cannot be diagnosed bronchoscopically prepare the patient for a transthoracic approach.\n3. Procedure (Electromagnetic Transthoracic Needle Aspiration)\nAllocate all supplies needed for the TTNA. (see Material Table)\nPosition the patient supine in a similar fashion used for chest CT scan imaging acquisition.\nUsing a test electromagnetic navigational needle select the entrance point to the chest cavity and mark it on the skin surface. Entrance point should be superior to the surface of the nearest rib and avoid osseous structures and any vascular structure.\nPrepare the skin with the 2% chlorhexidine solution, drape the field using sterile technique and anesthetize locally (subcutaneous infiltration of about 1 to 2 cc of 1% lidocaine).",
    "Place the sterile electromagnetic navigational needle on top of the entrance point and select the angle to the target based on observation of the transverse and coronal views seen on the electromagnetic system screens. (Crosshair marks in at least two different planes.)\nStabilize the needle and firmly advanced through the chest wall into the target lesion.\nRemove the guidance needle stylet from the needle and take care to avoid needle movement. At this point extreme care should be use to prevent inadvertent needle displacement. Cover the needle hub with your finger. Insert the 20 G FNA needle through the 19 G needle. Sample the lesion and provide the specimen for ROSE. \nProgram the automatic needle biopsy to the desired distance or throw based on the size of the lesion, and then insert it through the 19 G needle. Stabilize both needle and biopsy gun, trigger the needle biopsy gun mechanism to perform the biopsy and remove from the inside of the electromagnetic navigational guide needle making sure it remains in appropriate position.\nGently advance the guidance probe back into the lumen of the percutaneous needle and keep it stable.\nWhile the needle is continuously stabilized, the assistant uses the scalpel blade to gently remove the specimen from the inner cannula of the core biopsy needle and place it on the 1/2 x 1/2 inch previously cut non adherent pad. Immerse the pad in a formalin solution.\nReconfirm appropriate placement of the needle within the lesion and then repeat the operation 4 to 5 times making sure the core needle is rotated clockwise or counterclockwise to sample different areas.\nOnce satisfied with the specimens remove the needle, apply pressure and place a small bandage over the puncture site.\n4. Post Procedure",
    "If available, perform bedside ultrasonography to assess for the presence of lung sliding (absence of pneumothorax) or use any other imaging modality (fluoroscopy,etc) .\nTransfer the patient to the recovery area and observe under standard ambulatory surgical unit protocols until fully awake.\nObtain a chest radiograph to rule out complications.\nDischarge patient home after education is provided regarding the potential post procedure complications including bleeding and pneumothorax."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}