{
  "id": 13155,
  "origin_website": "Jove",
  "title": "Neuro-rehabilitation Approach for Sudden Sensorineural Hearing Loss",
  "procedures": [
    "Ethics Statement: Procedures have been approved by the Ethics Committee of the Medical Faculty, University of Muenster, the Ethics Committee of the Osaka University Hospital, and by the Ethics Committee of the Osaka Rosai Hospital.\n1. Preparation of Equipment\nObtain ear mold, portable music player, closed-type headphone, equalizer, and headphone amplifier as shown in Figure 2.\nPrepare libraries of different types of music (pop, rock, classical etc.) on portable music player.\n\t\nObtain CDs of different types of music.\nTransfer music from CDs to computer using a sound editing application (e.g., Adobe Audition 3.0 or similar).\n\t\t\nPlace an audio CD in the computer's CD-ROM drive. Choose File > Extract Audio from CD. Choose the maximum speed option from all the extraction speeds that the selected drive supports.\nConfirm that the music covers a wide frequency range (i.e., 125-8,000 Hz or wider) using a sound editing application (e.g., Adobe Audition 3.0 or similar).\n\t\t\nSelect all of a waveform, by choosing Edit > Select Entire Wave. Choose Window > Frequency Analysis. View frequency along the horizontal axis, and amplitude along the vertical axis in the frequency analysis panel.\nTransfer music files from computer to a portable music player via a connection cable.\n\t\t\nConnect portable music player and computer using the USB cable. Save music files in the [MUSIC] folder of the portable music player as .mp3 files at a bit rate of 192 kbps.\n2. Participants\nMeasure hearing threshold levels (air and bone conduction) in both ears using a step size of 5 dB in accordance with the modified Hughson-Westlake procedure24, by means of a pure tone audiometer.\n\t\nSet the frequency control of an audiometer to 1,000 Hz and set the intact ear to be tested to the earphone.\nSet the intensity level to 50 dB.",
    "Press the sound presentation button for 1 sec to give the patients the 1,000 Hz tone. Wait for their response (e.g., via button press or hand raising).\nIf the patients respond to the tone, present a 10 dB softer tone in the manner described in step 2.1.3. If the patients do not respond, go to step 2.1.6.\nRepeat step 2.1.4 until the patients cannot respond any longer.\nPresent a 5 dB louder tone and wait for the patients to respond.\nRepeat step 2.1.6 if the patients do not respond.\nNote the softest intensity level that the patients respond to.\nRepeat steps 2.1.4-2.1.8 until the same intensity level is noted two or three times. This is the established hearing threshold at 1,000 Hz.\nRepeat steps 2.1.2-2.1.9 for test frequencies 2,000, 4,000 and 8,000 Hz.\nRetest the hearing threshold for 1000 Hz and confirm that the first and second thresholds at 1,000 Hz agree within 5 dB.\nRepeat steps 2.1.2-2.1.9 for test frequencies 500, 250 and 125 Hz.\nSet the affected ear to be tested to the earphone and repeat steps 2.1.2-2.1.12. Present an appropriate narrowband masking noise to the untested ear via the earphone using the plateau method25 if the difference between left and right hearing thresholds equals or exceeds 25 dB in the lower frequencies (125, 250, and 500 Hz), or equals or exceeds 40 dB at or above 1,000 Hz.\nMeasure bone conduction hearing thresholds with masking noise in a similar way as in steps 2.1.1-2.1.13. To measure the bone conduction hearing, use the bone-conduction vibrator instead of headphones. Apply an appropriate narrowband masking noise25 to the untested ear in order to avoid crosstalk.\nPlot hearing threshold levels on an audiogram form. An exemplary audiogram of an SSHL patient is shown in Figure 3.",
    "Check the criteria for participation in CIST.\n\t\nCheck that the number of days since SSHL onset is less than 5 based on self-reporting.\nConfirm that the hearing level difference between ears averaged across 500, 1,000, and 2,000 Hz is less than 50 dB based on the air-conducted pure tone audiogram obtained in step 2.1.\n\t\tNote: In case of the audiogram shown in Figure 3, the hearing level difference is (40 + 40 + 45)/3 - (5 + 0 + 5)/3 = 38.3 dB.\nConfirm that the patients can comfortably listen to the music with their affected ear.\nConfirm that the patients suffer from acute unilateral hearing loss (based on self-reporting) and idiopathic condition of acute unilateral sensorineural hearing loss of at least 30 dB at three or more adjacent frequencies on a pure tone audiogram1 obtained in step 2.1. For example, in case of the audiogram shown in Figure 3, the hearing levels at and above 250 Hz in the right ear indicate sensorineural hearing loss of at least 30 dB.\nConfirm that the patients have no previous history of SSHL based on self-reporting and medical history. Also confirm that they have no neurological or psychiatric complications based on self-reporting and medical history.\nConsider differential diagnoses and exclude the patients who have received other diagnoses such as Ménière's disease26, head trauma, autoimmune inner ear disease8,9, Cogan's syndrome27,28, genetic diseases29, ototoxic drugs30, retrocochlear disorders related to vestibular schwannoma31, auditory neuropathy32, or stroke33.\n3. Starting CIST\nNote: Hospitalization is recommended for the patients' safety. Since the patients are sealed from environmental sounds due to the plugging and music listening inherent to the CIST procedure, the risk of accidents in their everyday life is expected to increase.",
    "Plug the outer canal of the unaffected ear of the patients using an ear mold. Tightly pack the ear mold into the outer canal to ensure that no space exists in the external auditory meatus.\nIf the patients feel pain or if the sealing is incomplete, remove the ear mold promptly and then reinsert.\nAsk the patients to choose an enjoyable type of music from the libraries.\n\tNote: They are also permitted to listen to their own music if the latter covers a sufficiently wide frequency range (125-8,000 Hz or wider).\nAsk the patients to wear a closed type headphone. Present the selected music only to the affected ear as shown in Figure 1.\nUse an equalizer to increase or decrease the sound level of each frequency according to a \"half-gain rule\", which states that the gain level is equated to half the amount of hearing level difference between ears at each frequency.\n\t\nFor example, if the hearing level differences between ears are X125, X250, X500, X1,000, X2,000, X4,000, and X8,000 at 125, 250. 500, 1,000, 2,000, 4,000, and 8,000 Hz respectively, set the equalizer at 1,000 Hz to \"X1000/2 - (X125 + X250 + X500 + X1,000 + X2,000 + X4,000 + X8,000)/14\".\n\t\tNote: In case of the audiogram shown in Figure 3, the equalizer setting for 125, 250, 500, 1,000, 2,000, 4,000, and 8,000 Hz is -5, -3, 0, +2, +2, +5, and 0 dB, respectively.\nAsk the patients to perform fine adjustments of the sound level and equalizer settings by themselves such that the music sounds as natural and comfortable as possible. If the internal equalizer of the music player is not sufficiently effective, use a hardware equalizer, as shown in Figure 2.",
    "Ask the patients whether they perceive the music with the affected ear in order to confirm that cross hearing34 does not occur. Exclude the patients who hear music with the plugged unaffected ear due to cross hearing.\n4. Procedure After Starting CIST\nInstruct the patients that they are permitted to receive standard therapy for SSHL such as corticosteroids in addition to the CIST protocol.\nHave the patients listen to music for 6 hr per day with the affected ear using the closed-type headphone (Figure 1). Instruct the patients that the time they spend listening to music can be segmented. Furthermore, allow the patients to perform other tasks (including reading a book and surfing the internet) during the time spent listening to music.\nInstruct the patients to use the ear mold all day until they leave the hospital.\nMeasure the air conduction threshold levels of the affected ear every two days in the same way as in step 2.1. Adjust volume and equalizer settings as mentioned in steps 3.5 and 3.6.\nWhen the patients are discharged from hospital and when they return as outpatients, measure the hearing threshold levels in the same way as in step 2.1.\n5. Cessation of CIST\nRemove the ear mold if the patients report discomfort regarding the plugged intact ear (such as tinnitus or pain).\nMeasure hearing threshold levels in the intact ear in the same way as in step 2.1.",
    "Stop the CIST procedure if the hearing levels averaged across 500, 1,000, 2,000 Hz obtained in step 4.4 and/ or 5.2 deteriorate more than 5 dB compared to those obtained in step 2.1. For example, in case of the audiogram shown in Figure 3, the hearing levels averaged across 500, 1,000, 2,000 Hz are (40 + 40 + 45)/3 = 41.7 dB in the affected ear and (5 + 0 + 5)/3 = 3.3 dB in the intact ear."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}