{
  "id": 17894,
  "origin_website": "Jove",
  "title": "The Chick Chorioallantoic Membrane In Vivo Model to Assess Perineural Invasion in Head and Neck Cancer",
  "procedures": [
    "Ethics statement: All experiments using rats in this protocol are done in accordance with IACUC (Institutional Animal Care and Use Committee) rules from our institution. Experiments with eggs in this study are exempt from IACUC regulation.\n1. Egg Incubation (estimated timing: 5 min, day zero)\nGet pathogen-free fertilized commercial Lohmann White Leghorn eggs, preferably on the first day post-fertilization. Incubate six eggs per experimental group in an egg humidifying incubator at 38 °C and 54% humidity for 8 days with hourly rotation. Use regular rotation of the eggs to prevent the embryo from sticking to the egg membranes. \n\tNOTE: Before incubation, keep the eggs in an 18 °C refrigerator to halt embryo development for a maximum of 1 week. \n2. Harvest and preparation of DRGs (estimated timing: 2 h, day 8)\nNOTE: Experiments with mice and rats require approval from the (IACUC). In some countries, the use of chicken eggs also requires approval.\nGet six to seven week-old Sprague Dawley rats ( ~200 g in weight) to extract DRGs. \n\tNOTE: One rat should yield  ~40 cervical and thoracic DRGs. Mouse DRG also integrates in the CAM, however the conditions for this species need to be optimized independently. \nIn a laminar flow cabinet, harvest DRGs from cervical and thoracic regions following the protocol for mouse DRG extraction published elsewhere22. Follow Figure 2 for orientation on how to harvest DRGs.\n\t\nEuthanize the rat by cardiac puncture after administration of Ketamine/ Xylazine injected intraperitoneally. Clean the rat skin with 70% ethanol and remove the rat spine using a scissor. Do not perform cervical dislocation because this would damage the cervical DRGs.",
    "Separate the cervical, thoracic and lumbar regions with the same scissor, following the schematic anatomic representation and gross images provided in the Figure 2A-D. Place the spine sections in a 10 cm culture dish with 1x PBS to keep tissues wet.\nWith a delicate bone scissor, open the vertebral bones in the dorsal and ventral aspects, separating the spine in two lateral halves (Figure 2E-F).  Place the tissue sections in a clean 10 cm dish with fresh 1x PBS.\nUsing forceps, gently detach the spinal cord from the vertebral bones to visualize the DRGs (Figure 2G). \nWith fine forceps held underneath each DRG, grasp it and pull it out from the bone cavity in which it is lodged. Do not hold the DRG directly because this will cause tissue damage. Do not trim the axon bundles from the DRG (Figure 2H). \n\t\tNOTE: Avoid using lumbar DRGs since these have reduced integration in the CAM. For DRG region location, follow the schematic illustration and gross anatomic images on Figure 2A-D.\nImmediately after harvesting, place each DRG into DMEM culture medium supplemented with 2% Penicillin/Streptomycin (Pen/Strep) and 10% heat-inactivated Fetal Bovine Serum (FBS) to help prevent bacterial contamination of the DRGs. Group all DRGs in the same 6 cm culture dish with 4 mL of culture medium.\nAfter harvesting all DRGs, transfer them to a new culture dish with DMEM culture medium supplemented with 2% Pen/Strep plus 10% FBS and containing 1.25 µg/mL of red fluorescent dye. Incubate for 1 h in the cell culture incubator. During this time, prepare the eggs to receive the DRG as described below (step 3).\n\tNOTE: The interval between harvesting DRGs and completion of fluorescence labeling should be sufficient to prepare the eggs; DRGs can be kept for a few hours in the incubator.",
    "3. Preparation of eggs for DRG grafting (estimated timing: 1 h for a dozen eggs, day 8)\nIn a laminar flow cabinet, dim the light and transilluminate the eggs to check for viability and embryonic phase. Exclude eggs with poor vasculature, non-fertilized eggs, or eggs not consistent with day 8 post-fertilization. Hold the egg gently with the naturally-occurring air sac toward the light source (Figure 3A). \nWith a pencil, mark the egg shell to receive the openings (Figure 3A-B). \n\t\nFirst, identify the attachment of the developing embryo to the CAM as a dark moving vessel attached to the egg membrane and mark this area to avoid interventions in this region.\nSecond, choose the operating window area as a well vascularized area at least 2 cm from the embryo attachment and draw a 1.5 cm diameter circle. Approximately 1 cm from the operating window, draw a 0.5 cm square in a less vascularized area.\nThird, draw the air sac region to exclude it from the operation area. Mark the middle of the air sac with a cross. \nWith a rotary tool and engraving drill, 3 mm in diameter, drill the egg shell in the marked square (Figure 3C). Use blunt forceps to remove the egg shell without removing the outer egg shell membrane (the white membrane right under the shell) (Figure 3D). Work carefully to avoid accidental perforation of this membrane. \nUsing the same drill as in step 3.3, make a pinpoint perforation in the marked cross in the air sac area to allow air flow into the egg (Figure 3E). Be careful not to apply too much pressure to the egg, to avoid breaking or damaging it.",
    "Place 30 µL of HBSS in the square opening, over the intact outer egg shell membrane (Figure 3E). With a 30-G syringe needle, make a pinpoint perforation in the outer membrane in this square area (Figure 3F). \nPlace the egg in the light source to visualize the air sac. Apply pressure to an eyedropper rubber bulb and place it in the small perforation made in the air sac area (step 3.4). Release pressure in the bulb until you see separation of the two membranes in the operating window area (Figure 3G); repeat this step as many times as you need to achieve complete separation of the membranes in the operating window area.\nRepeat steps 3.1-3.6 for all eggs.\nUsing the same drill as in step 3.3, drill the circular operating window being careful not to rupture the outer egg shell membrane (Figure 3H). Clean the egg surface by gently sticking an adhesive tape to remove all loose particles. \nWith blunt forceps, remove the egg shell from the drilled area (Figure 3I-J). Next, with the same forceps, remove the outer egg shell membrane (Figure 3K), being careful not to introduce small shell particles inside the egg to minimize contamination. \nIdentify the CAM approximately at 1 cm depth from the egg surface. Cover each opened egg temporarily with paraffin wax membrane to avoid contamination (Figure 3L).\nRepeat steps 3.8-3.10 for all the eggs. Place the eggs back in the egg incubator without rotation until the DRGs are ready for grafting.\n4. Grafting DRG on the CAM (estimated timing: 40 min, day 8)\nPrepare a 6 cm culture dish with HBSS medium, to wash the DRGs before implantation. Bring the prepared eggs to the cell culture laminar flow cabinet. Remove the paraffin membrane from the egg (Figure 4A).",
    "With fine sterile forceps, gently grasp one DRG from inside the culture medium. Dip it into the HBSS medium to remove the excess medium that contains the fluorescent dye. Hold the DRG very gently; otherwise, it will stick to the forceps. \nPlace the DRG on the CAM, being careful not to puncture the membrane (Figure 4B-C). If necessary, use another pair of forceps to help detach the DRG from the tip of the forceps when placing it on the CAM. \n\tNOTE: Keeping the DRG wet with HBSS medium will also facilitate detachment from the forceps.\nCover the egg with a sterile transparent film dressing. Cover all the windows and punctures made in the egg shell to avoid bacterial contamination (Figure 4D).\nAfter grafting DRGs in all eggs, incubate the eggs in a humidifying incubator at 38 °C and 54% humidity for 2 days, without rotation.\n5. Grafting tumor cells on the CAM (estimated timing: 1 h 30 min, day 10)\nAt 48 h before grafting the cells, plate the cells needed in culture plates. Calculate 0.5 to 1 x 106 cells per egg for UM-SCC-1 cells in order to generate three dimensional tumors in the CAM. Be aware that cell number may vary by cell line.\nAspirate medium and add DMEM culture medium supplemented with 1% Pen/Strep plus 10% FBS and 2.5 µg/mL of green fluorescent dye. Incubate for 1 h at 37 °C in the cell culture incubator. Then, check fluorescence intensity on the microscope, aspirate medium, wash once with 1x PBS, and add 0.25% trypsin for up to 10 min. Neutralize trypsin with DMEM supplemented medium. \nCentrifuge at 250 x g for 4 min to form a cell pellet. Aspirate DMEM medium and re-suspend in HBSS to wash the excess fluorescent dye. Count cells using a hemocytometer.",
    "Bring the eggs to the cell culture laminar flow cabinet. With scissors and forceps, open the transparent film dressing that covers the egg (Figure 4E-F).\nCentrifuge the calculated number of cells again, aspirate the HBSS medium and re-suspend at a final concentration of 0.5 to 1x106 cells per 5 µL of the same medium (Figure 4G). Prepare the amount needed for the total number of eggs (5 µL of cell suspension per egg).\nPlace 5 µL of cell solution onto the CAM, about 2 mm from the DRG (Figure 4H). Keep uniform distances between the DRG and cells. Be very careful not to disturb the egg to minimize spreading of the cells. \n\tNOTE: To start cell implantation, choose eggs on which the CAM surface is visually dry. If the surface is too wet, cells can spread and do not form regular tumors.\nCover the egg with a new film dressing as in step 4.4. Graft the cells in all eggs. Incubate the eggs in a humidifying incubator at 38 °C and 54% humidity for 7 days, without rotation.\n6. Harvesting the CAM (estimated timing: 1 h for dozen eggs, day 17)\nPrepare 6-well plates with 4% PFA (paraformaldehyde) pH7.0, one well per egg, 2 mL per well.\nBring the eggs to a laboratory bench. Using a needle attached to a syringe to perforate the film dressing, drop around 300 µL of PFA over the CAM to slightly stiffen the CAM, thus facilitating the harvesting process. Repeat this for all eggs.",
    "With a scissor, remove the upper half of the egg shell (where the operating window is located) with the CAM attached to it (Figure 4I). Reduce the size of this half to approximately 3 cm in diameter, keeping the portion of the CAM where DRG and tumor cells were grafted in the center (Figure 4J). Grasp the CAM with fine forceps and detach it from the egg shell while placing it into the PFA. Orient the DRG and cancer cells facing upwards (Figure 4K-L).\n\tNOTE: The 3 cm area should include both the DRG and cells. The DRG is easily seen as a small lump attached on the CAM, however tumor cells are sometimes difficult to identify on gross exam. \nAlternatively, with a scissor, widen the operating window removing the egg shell from the top of the egg while keeping the CAM in place; remove approximately 1 cm beyond the operating window (Figure 4M) and identify the DRG and cells on the CAM (Figure 4N-O). With delicate fine forceps, hold the CAM at one of the edges and lift it gently. With sharp delicate scissors, gently cut the CAM to remove a circular area, approximately 3 cm in diameter (Figure 4P), and place the CAM in PFA with DRG and cancer cells facing upwards.\n\tNOTE: Avoid stretching or holding the CAM with forceps in multiple places to minimize tissue damage that may generate microscopy artifacts. \nPlace each CAM membrane in one well (Figure 4L). Gently grasp the edges of the CAM to spread the tissue open in the PFA or gently shake the plate until the CAM is unfolded, to avoid fold artifacts.",
    "Euthanize the embryo (day 17) by quick decapitation. Fix the harvested tissues in PFA for 4 h at room temperature. After fixation, replace PFA with 1x PBS and store tissues in PBS at 4 °C until embedding in paraffin for sectioning. Avoid over-fixation that will damage the delicate vasculature of the CAM. \nUsing a fluorescence stereomicroscope, photograph the membranes within 2 days after harvesting to avoid losing fluorescent signals."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}