{
  "id": 4387,
  "origin_website": "Bio",
  "title": "Identification of Helminth-induced Type 2 CD4<sup>+</sup> T Cells and ILC2s",
  "procedures": [
    "Work on ice.Remove mesenteric lymph nodes (MLNs) and spleens from Hp infected mice and place them in complete RPMI on ice (make sure to remove all fat tissue of the MLNs and spleens before you store them in complete RPMI). Smash MLNs and spleens trough a 70 μm cell strainer placed on an 50 ml Falcon tube by using a 3 ml syringe plunger and rinse with 20 ml complete RPMI.Count live cells in smashed cell suspensions.Transfer up to 1 x 106 cells in 200 μl PBS with 0.2% BSA in a single round bottom 96 well.Centrifuge at 400 x g for 5 min at 4 °C. Discard supernatant after centrifugation.Resuspend with 200 μl PBS with 0.2% BSA.Centrifuge at 400 x g for 5 min at 4 °C. Discard supernatant after centrifugation.Resuspend with 50 μl/well 24G2 (1:800 dilution from stock 1 mg/ml stock solution) for 10 min.Centrifuge at 400 x g for 5 min at 4 °C. Discard supernatant after centrifugation and resuspend in 200 μl PBS with 0.5% BSA.Centrifuge at 400 x g for 5 min at 4 °C and resuspend in 100 μl PBS with 0.5% BSA supplemented with live /dead fixable aqua dead cell stain kit, according to the manufacturer instructions. Incubate in the dark, e.g. cover with aluminum foil for 20 min.Centrifuge at 400 x g for 5 min at 4 °C. Discard supernatant after centrifugation and resuspend in 200 μl PBS with 0.5% BSA.Centrifuge at 400 x g for 5 min at 4 °C. Discard supernatant after centrifugation and resuspend in 50 μl PBS with 0.5% BSA including the biotin labeled cell surface antibodies (CD3, CD4, CD11b, CD11c, CD19, Nk1.1, Ly6G and IgE) for the lineage negative gating and c-kit (Pacific Blue), sca-1 (PE-Cy7), T1/ST2 (FITC), ICOS (PerCp/Cy5.5).Incubate in the dark, e.g.",
    "cover with aluminum foil for 30 min.Centrifuge at 400 x g for 5 min at 4 °C. Discard supernatant after centrifugation and resuspend in 200 μl PBS with 0.5% BSA.Centrifuge at 400 x g for 5 min at 4 °C. Discard supernatant after centrifugation and resuspend in 50 μl PBS with 0.5% BSA including the streptavidin Texas red labeled antibody.Incubate in the dark, e.g. cover with aluminum foil for 30 min.Centrifuge at 400 x g for 5 min at 4 °C. Discard supernatant after centrifugation and resuspend in 200 μl PBS with 0.5% BSA.Centrifuge at 400 x g for 5 min at 4 °C. Discard supernatant after centrifugation and resuspend in 50 μl PBS with 2% PFA for 20 min for fixation.Centrifuge at 400 x g for 5 min at 4 °C. Discard supernatant after centrifugation and resuspend in 200 μl PBS with 0.5% BSA.Repeat step 20.Centrifuge at 400 x g for 5 min at 4 °C. Discard supernatant after centrifugation and resuspend in 75 μl FACS buffer.Filter cells in a 70 μm cell strainer.Acquire cells at the LSRII.Gating strategy is shown in Figure 1:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140605/20140605231835_7585.jpgFigure 1. Gating strategy used to identify ILC2s. ILC2 cells were identified as lineage-negative (Gr-1, CD3, CD19), Sca-1, c-kit, T1/ST2 and ICOS positive live cells present in the spleen of mice at 6 days post infection with the helminth parasite Heligmosomoides polygyrus. Y-axis represents counts if not otherwise indicated."
  ],
  "subjectAreas": [
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}