{
  "id": 9973,
  "origin_website": "Jove",
  "title": "Development and Characterization of Decellularized Lung Extracellular Matrix Hydrogels",
  "procedures": [
    "Fresh native lungs from young (1-2 years old) bovine donors were obtained from a local slaughterhouse and transported in a sealed plastic container on ice to the laboratory. Animal sacrifice is performed for general meat consumption (lungs discarded as waste) and is not related to or due to the study. We confirm that the slaughterhouse complies with the national laws and regulations of animal sacrifice. Furthermore, we confirm that we only used waste material and the research project did not have an effect on the number of animals sacrificed.\n1. Harvest of organs and tissue preparation\nStore freshly obtained bovine lung tissues at -80 °C until the experiment.\nOn the day of the experiment, wait for frozen lung tissues to thaw at room temperature.\nDissect the tissues with sterile scalpels and scissors to remove trachea and cartilaginous airways, and further mince into small pieces (5 mm3).\nWash thoroughly with ultrapure water containing 2% penicillin/streptomycin (P/S) at least 3x.\n2. Decellularization of tissues\nNOTE: Native bovine lung tissues were decellularized using two distinct protocols.\nFreeze-thaw method\n\t\nPrepare tissue samples according to step 1. Immerse minced tissues in 2% iodine solution in sterile distilled water (dH2O) for 1 min. Perform two consecutive washes in sterile dH2O.\nTransfer minced tissue pieces into a 50 mL tube up to the 15 mL level and implement five manual freeze-thaw cycles using a portable liquid nitrogen container. Fill tubes to the top with sterile dH2O and freeze tubes for 2 min in liquid nitrogen. After 2 min, immediately transfer them to a 37 °C water bath for 10 min. This constitutes 1 cycle of freeze-thaw.\nIncubate the samples with 30 mL of DNase solution (10 U/mL) in 10 mM MgCl2 buffer (pH 7.5) for 1 h at 37 °C under constant shaking at 100 rpm.",
    "Continue with an extensive wash with sterile dH2O for 3 days under constant shaking at 100 rpm, with solution replenishment every 24 h.\nPerform lyophilization and cryomilling as follows20: Freeze the wet dECM samples at -80 °C for 24 h. Transfer frozen samples into a lyophilizer and operate in drying mode under vacuum for 3 to 4 days until fully dried. Upon completion of freeze-drying, perform milling of the samples into a fine powder form using a grinding apparatus and dry ice.\n\t\tNOTE: This fine powder state is deemed necessary due to its enhanced solubility properties during subsequent stages of the digestion process.\nTriton-X-100 method\n\t\nPrepare tissue samples according to step 1. Treat lung tissues with 1% Triton-X-100 for 3 days under gentle rotation at 4 °C. Exchange solution every 24 h.\nIncubate the samples with DNase solution (10U/mL) in 10 mM MgCl2 buffer (pH 7.5) for 1 h at 37 °C under constant shake.\nContinue with an extensive wash with sterile dH2O for 3 days under gentle rotation, with solution replenishment every 24 h.\nPerform lyophilization followed by cryo-milling as described in step 2.1.\n3. Pepsin digestion\nDigest powdered dECM samples at a concentration of 15 mg/mL (w/v) in pepsin solution (1 mg/mL pepsin in 0.01 M HCl, pH 2). Carry out the sample digestion process at room temperature under constant stirring for 48 h and maintain the pH of the solution frequently for effective digestion.\nTransfer the digests into a tube and centrifuge at 5000 x g for 10 min.\nCollect the supernatant and neutralize and buffer them to physiological conditions (pH 7, 1x phosphate buffer saline (PBS)) through the addition of 5M NaOH and 10x PBS.",
    "NOTE: It is suggested to use concentrated alkaline solutions for pH adjustment of the acidic digest, as this approach avoids undesired volume expansion that could detrimentally impact the gelation in the subsequent steps.\nStore the pre-gel digests at −20 °C for further studies.\n4. Histological staining\nFix a small portion (5 mm3) of decellularized tissue sample in 1 mL of 3.7% formaldehyde solution at 4 °C overnight.\nIncubate tissues in tubes containing 1 ml of 30% sucrose solution in PBS for 12 h at 4 °C on a steady rock.\nTo embed tissues in optimal cutting temperature compound (OCT), pour 1 mL of OCT in a cryomold, place tissue in the middle of the cryomold, then pour 2 mL of OCT on top of the tissue.\nPlace cryomolds containing tissues on dry ice and snap-freeze using liquid nitrogen. Samples are ready when OCT turns all white, which usually takes 3 min. Store OCT-embedded tissues at -20 °C until use.\nObtain 10 µm sections in the cryostat at -25 °C on a poly-L-lysine-coated glass slide and transfer the slide to room temperature to allow the tissue section to melt on the slide. Store the slides at -20 °C until use.\nIn order to confirm the absence of nuclei after decellularization, perform a Hematoxylin and Eosin (H&E) staining as described below.\n\t\nIncubate slides at room temperature for 10 min. Immerse slides in PBS and stain them with ready-to-use 50 mL of hematoxylin solution in a staining jar for 3 min, followed by a 3 min wash with tap water.\nImmerse the slides in 95% ethanol and stain with 50 mL of 0.5% alcoholic Eosin solution in a staining jar for 45 s.\nPerform Sirius red staining to show the retaining of collagen content after decellularization.",
    "Hydrate the slides with PBS and immerse them in 50 mL of 0.1% Sirius red in saturated aqueous solution of picric acid in a staining jar for 1 h.\nRinse slides in 0.5% acetic acid solution for 5 s and dehydrate all slides by soaking them in 70%, 95%, and 100% ethanol sequentially for 1 min each.\nTo analyze sGAG content in tissue samples, perform Alcian blue staining as described below.\n\t\nImmerse the slides in 50 mL of 1% Alcian blue in 3% acetic acid solution (pH 2.5) in a staining jar for 30 min. Wash the slides with running tap water for 2 min.\nDehydrate all slides by soaking them in 70%, 95%, and 100% ethanol sequentially for 1 min each. \nAdd 0.1 mL of mounting medium on top of the samples, and visualize using light microscopy using 10x magnification.\n5. Mechanical characterization\nImplement oscillatory rheology measurements using a rheometer with parallel plate geometry.\nPour 250 µL of pre-gel solution kept on ice onto a pre-cooled (4 °C) lower plate to avoid rapid gelation.\nLower the 20 mm parallel plate until the pre-gel solution forms a disk with a 1 mm gap width between the two plates.\nStart the measurement immediately. Measure storage and loss moduli over time with a fixed frequency and strain while heating the lower plate to 37 °C for 30 min to observe gelation kinetics. Use a fixed frequency of 0.5 Hz and 0.1% strain.\nPerform a creep-recovery test after the storage modulus value stops increasing and reaches a plateau.\nApply 1 Pa shear stress to the hydrogel for 15 min, measure the strain, unload the sample from the stress, and record the change in strain value for 15 min.",
    "Draw a strain versus time graph to show the stress-relaxing behavior. Repeat measurements for three different dECM digests as replicates.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}