{
  "id": 14992,
  "origin_website": "Jove",
  "title": "Isolation and Processing of Murine White Adipocytes for Transcriptome and Epigenome Analyses",
  "procedures": [
    "All animal experiments were approved by the Institutional Animal Care and Use Committee (IACUC), protocol number: 18-10-028. 12-week-old male C57BL/6J mice were euthanized with CO2 and dissected to collect the fat pads from the epididymal white adipose tissue (eWAT).\n1. Adipocyte isolation\nPrepare the digestion buffer (Table 1) and warm to 37 °C in a water bath.\nPut the fat pad from the epididymal white adipose tissue (eWAT) in a petri dish. Cut the tissue into small pieces (5 mm x 5 mm) using forceps and a scalpel in 5 mL of DMEM.\n\tNOTE: A Petri dish that does not contain a cell adhesion coating is preferred. It is also important to hold the fat pad gently to avoid damaging the cells. The more the adipose tissue is handled, the more the yield is compromised. A scalpel/forceps method is preferable to cutting the fat pads with scissors or forceps alone as they can damage the adipocytes.\nDrain the excess DMEM without disturbing the tissue debris.\n\tNOTE: Do not pick the tissue debris off the Petri dish's surface.\nAdd 5 mL of digestion buffer to the Petri dish, swirl to release tissue fragments from the dish, and pour the entire content into a 50 mL centrifuge tube. Repeat the process until all the tissue fragments are transferred to the centrifuge tube.\nAdd the remaining digestion buffer to the centrifuge tube so that the final volume is ~20 mL.\nIncubate the tissue fragments in a 37 °C shaking water bath at 100 rpm for 20-30 min, or until the tissue fragments are smaller than 1 mm x 1 mm.\nAdd 0.4 mL of 0.5 M EDTA and 0.2 mL of 0.5 M EGTA to the centrifuge tube, and continue shaking at 37 °C for 10 min.",
    "Transfer the cell suspension with a 10 mL pipette through a fine matrix filter (420 µm, see Table of Materials) on top of another 50 mL centrifuge tube to remove the undigested tissue.\nCentrifuge the 50 mL centrifuge tube at 200 x g for 5 min at room temperature to separate pure adipocytes (floating on the top) from the stromal vascular fraction (pellet at the bottom) (Figure 2A).\nPour the floating adipocyte layer into a new 50 mL tube, being careful not to disrupt the pellet.\n\tNOTE: Avoid using pipette tips to transfer floating adipocytes because they can stick to the pipette tip wall (hence, reducing yield). Some digestion buffer will carry over into the new tube; use a syringe and needle to remove residual digestion buffer from under the adipocyte layer.\nUse the purified adipocytes for total RNA extraction (step 2.) and/or ChIP-seq (step 3. and step 4.) immediately.\n\t​NOTE: The user can decide to use the whole adipocyte extract for step 2. or step 3., depending on the research purpose. The user can also split the entire adipocyte extract into two portions and continue step 2. and step 3. in parallel to obtain analysis results from the biologically identical samples.\n2. Total RNA extraction\nNOTE: Perform this step in a chemical hood.\nAdd RNA isolation reagent (1 mL) (see Table of Materials) to the purified adipocytes in the 50 mL centrifuge tube (step 1.11.).\nPipette up and down using a 1 mL pipette tip to thoroughly dissolve the adipocytes in the RNA isolation reagent and transfer to a 2 mL microcentrifuge tube.\nIncubate the tube for 15 min at room temperature.\nAdd 0.5 mL of heptane into the centrifuge tube and vortex at full speed for 30 s.\n\tNOTE: The lipids will dissolve in the heptane (Figure 2B).",
    "Centrifuge the tube at 1,000 x g for 10 min at 4 °C.\nAcquire the bottom layer of RNA isolation reagent with a syringe and 30 G needle, and transfer to a new 1.5 mL tube.\nAdd 0.1 mL of 1bromo-3chloropropane (see Table of Materials) to the RNA isolation reagent extract and vortex at full speed for 30 s. Incubate the tube at room temperature for 15 min.\nCentrifuge the tube at 12,000 x g for 15 min at 4 °C. Use a pipette to collect the upper aqueous phase and transfer it to a new tube.\nAdd 0.5 mL of isopropanol and incubate for 10 min at 4 °C. Centrifuge the tube at 12,000 x g for 10 min at 4 °C.\n\tNOTE: The RNA will be precipitated as a pellet at the bottom of the tube.\nUse a pipette to remove the supernatant, being careful to avoid touching the pellet.\nAdd 1 mL of 75% EtOH and vortex at full speed briefly.\nCentrifuge the tube at 7,500 x g for 5 min at 4 °C. Carefully remove the supernatant with a pipette tip. Do not disturb the pellet.\nAir-dry the pellet at room temperature for 10 min or until the pellet becomes clear/transparent.\nDissolve the pellet in 50 µL of nuclease-free water.\n3. Adipocyte fixation for ChIP-seq\nNOTE: Perform step 3. in a chemical hood.\nAdd 0.3 mL of 0.5 M EDTA, 0.2 mL of 0.5 M EGTA, 14.8 mL of DMEM, and 10 mL of heptane into the 50 mL tube containing isolated adipocytes (step 1.11.).\nAdd 0.7 mL of 16% formaldehyde (final 0.7%) and rotate on a tube rotator (see Table of Materials) at 10 rpm for 5 min at room temperature.",
    "NOTE: Set up a timer and count for 5 min. If processing multiple samples, add formaldehyde sequentially at 30 s intervals to enable precise and comparable timing of fixation across all samples.\nAdd 1.78 mL of 1.25 M glycine (final 0.125 M) and mix on the rotator at 10 rpm for no more than 5 min at room temperature.\n\tNOTE: Formaldehyde remains active even after adding glycine. Therefore, it is important to separate the layers by centrifugation (step 3.4.) immediately after the 5 min incubation step. If there is more than one sample, add glycine to each sample to stop the reaction sequentially in 30 s time gaps.\nNext, centrifuge at 200 x g for 5 min at room temperature.\n\tNOTE: There must be three obvious and discrete liquid layers (Figure 2C). The middle white layer contains the fixed adipocytes.\nUse a 1 mL pipette tip to transfer the adipocyte (white) layer to a fresh 15 mL centrifuge tube, minimizing the amount of fixative and heptane carried into the new tube.\nFill the tube with 10 mL (room temperature) DMEM supplemented with the protease inhibitor cocktail (PIC, see Table of Materials) tablet. Mix thoroughly by inversion.\nCentrifuge the tube at ≤200 x g for 5 min at room temperature. Keep the centrifugation force at 100 x g to minimize cell bursting.\nRepeat steps 3.5.-3.7. 1x before moving forward to step 3.9.\nUse a 1 mL pipette tip to transfer the adipocytes (white) layer into a 1.5 mL or 2 mL microcentrifuge tube.\nCentrifuge the tube at 100-200 x g for 5 min at room temperature, and use a 1 ml pipette tip to remove the heptane (top layer) and the DMEM (bottom layer).\nStore the fixed adipocytes at −80 °C for up to 6 months until use.",
    "4. Nuclei extraction and chromatin shearing\nNOTE: This procedure is adapted from Arrigoni et al.19.\nTurn on the sonicator (see Table of Materials) and set the peak power to 75 W, the duty factor to 2%, and 200 cycles/burst, with the water bath chiller set to 20 °C.\nAdd protease inhibitor cocktail (PIC) to the Farnham lab buffer and the shearing buffer (Table 1).\n\tNOTE: Please check out a few more suggested sonicators and parameters in Arrigoni et al.19.\nResuspend the fixed adipocytes (from step 3.) with 750-800 µL of ice-cold Farnham lab buffer in a 1 mL sonication tube (see Table of Materials).\n\tNOTE: It is recommended not to fill the tube to its full capacity. Otherwise, the adipocytes will float to the topmost part of the tube, which reduces the sonication efficiency.\nSonicate the sample for 2.5 min.\n\tNOTE: Check the nuclei extraction on a phase-contrast microscope to determine if further sonication is needed. The nuclei must be round and intact, as shown in Figure 2D.\nBefore proceeding further, set the sonicator peak power to 140 W, the duty factor to 5%, and 200 cycles/burst, with the water bath chiller set to 4 °C.\nUse a pipette to transfer the supernatant to a 1.5 mL microcentrifuge tube. Centrifuge the tube at 1,000 x g for 5 min at 4 °C.\nCarefully remove the supernatant from the pellet (nuclei) and keep the pellet.\nWash the pellet with 1 mL of Farnham lab buffer on ice.\nCentrifuge the tube at 1,000 x g for 5 min at 4 °C, use a pipette to remove the supernatant, and keep the pellet.\nRepeat steps 4.8.-4.9. 1x before moving forward to step 4.11.\n\tNOTE: The isolated and washed nuclei can be stored at −80 °C for 3 months until further use.",
    "Resuspend the isolated nuclei in 1 mL of shearing buffer, and transfer them into a new 1 mL sonication tube. Ensure that there are no bubbles in the tube.\nSonicate the nuclei in the sonicator with a peak power of 140 W, a duty factor of 5%, and 200 cycles/burst for 12 min to shear the chromatin at 4 °C.\nTransfer the lysate into a 1.5 mL microfuge tube.\n\tNOTE: The sheared chromatin is released from the nuclei and is contained in the buffer (lysate).\nCentrifuge the tube at 10,000 x g for 5 min at 4 °C to pellet insoluble debris. Transfer the supernatant (chromatin) into a new 1.5 mL microcentrifuge tube.\nThe sheared chromatin can be stored at 4 °C for 10 days or at −80 °C for 3 months until further use.\n\tNOTE: Additional quality check: Aliquot 25 μL of the sheared chromatin to de-crosslink and remove the RNA with a DNase-free RNase following the previously published report19. For the present study, the resulting DNA was purified with a DNA purification kit as per the manufacturer's instructions, the DNA was quantified with a DNA quantification kit on the DNA quantification instrument, and the fragment size was evaluated by the automated electrophoresis instrument (see Table of Materials). The sheared chromatin size should be in the range of 100-800 bp. The rest of the shear chromatin can proceed for downstream ChIP-Seq application."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}