{
  "id": 5910,
  "origin_website": "Bio",
  "title": "Rolling Circle Amplification to Screen Yam Germplasm for Badnavirus Infections and to Amplify and Characterise Novel Badnavirus Genomes",
  "procedures": [
    "Total nucleic acid extraction from yam leaves modified from Lodhi et al. (1994).Note: Work in a fume hood for most steps (at least Steps 1j-1l). Prepare CTAB extraction buffer (Recipe 5) and preheat buffer to 60 °C in a water bath.Select individual leaf samples and collect fresh leaves in small gauge bags (10 x 15 cm). Process leaves immediately (Figures 2A and 2B).Weigh approximately 300 mg of leaf sample and place into a fresh small gauge bag (Figure 2C).Briefly snap freeze leaf material by dipping the gauge bag into liquid nitrogen. No liquid nitrogen should enter the bag (Figure 2D).Immediately grind frozen leaf tissue manually into a fine powder using homogenizer (Figure 2E).Grind until thawing begins and tissue forms a ‘smooth paste’. Add 1 ml preheated CTAB extraction buffer and briefly grind again using homogenizer (Figures 2F and 2G).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171227/20171227193059_4044.jpgFigure 2. Sampling and grinding of yam leaves for total nucleic acid extractions. A. Yam leaf showing viral symptoms; B. Collecting yam leaf in small gauge bag; C. Weighing ~300 mg of fresh yam leaf material; D. Snap freezing leaf material in liquid nitrogen; E. Grinding frozen leaf tissue into fine powder using homogenizer; F. Grinding until thawing begins and tissue forms a ‘smooth paste’; G. Further grinding after the addition of CTAB extraction buffer.Add a further 2 ml CTAB extraction buffer (final volume 1 ml per 100 mg fresh weight leaf material) and mix thoroughly using homogenizer.Aliquot 700 µl of sap each into three fresh 1.5 ml microcentrifuge tubes using wide bore or cut 1 ml pipette tips (Figures 3A and 3B). Keep on ice until all samples are processed.Briefly vortex samples and incubate at 60 °C for 30 min in a water bath. Occasionally mix samples by inverting the microcentrifuge tubes 20 times (approximately every 10 min) (Figure 3C).",
    "Allow samples to reach room temperature and add an equal volume (700 µl) of phenol:chloroform:isoamyl alcohol (25:24:1) (Figure 3D). (Optional: Chloroform:isoamyl alcohol (24:1) can be used instead.) Mix to emulsion by inverting the tubes 50 times and centrifuge at 15,000 x g for 10 min (Figure 3E).Carefully transfer the upper aqueous phase (~600 µl) (Figure 3F) into a fresh 1.5 ml microcentrifuge tube without disturbing the interphase and add an equal amount of chloroform:isoamyl alcohol (24:1), mix and spin as before.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171227/20171227193150_4787.jpgFigure 3. Sampling and grinding of yam leaves for total nucleic acid extractions. A-B. Aliquot 700 µl of sap each into three fresh 1.5 ml microcentrifuge tubes using wide bore or cut 1 ml pipette tips. C. Incubate samples at 60 °C for 30 min in a water bath and mix samples by inverting the microcentrifuge tubes. D. Allow samples to reach room temperature and add an equal volume of phenol:chloroform:isoamyl alcohol (25:24:1). E. Mix to emulsion by inverting the tubes. F. After centrifugation, carefully transfer the upper aqueous phase without disturbing the interphase.Carefully transfer the upper aqueous phase (~400 µl) into a fresh 1.5 ml microcentrifuge tube taking extra care not to disturb the interphase.Precipitate DNA by adding 75 µl of 5 M NaCl (Recipe 4) and 450 µl of ice-cold isopropanol. Mix samples well and incubate at -20 °C for 1 h. Work on ice from here on.Centrifuge samples at 15,000 x g and 4 °C for 10 min and discard the supernatant.Wash the pellet twice in 500 µl of 70% ethanol with centrifugations at 15,000 x g and 4 °C for 5 min.Remove the 70% ethanol by decanting and air dry the pellet using a vacuum concentrator. Do not dry completely as the pellet will become difficult to resuspend.",
    "Resuspend pellet in 100 µl nuclease-free, sterile distilled deionized water (SDW) at 4 °C overnight.Optional: For optimal RCA detection, DNA pellets can be resuspended in 2 ml resuspension buffer (Recipe 6) instead and combined (three aliquots from the beginning), followed by purification through QIAGEN Genomic-tip 20 G or 100 G columns according to the manufacturer’s instructions. Inclusion of this column purification step was found to increase the efficiency of RCA. The final pellets were resuspended in 200 µl nuclease-free SDW at 4 °C overnight.Screen the yam DNA samples for badnavirus sequences by PCR using the generic badnavirus primer pair Badna-FP/-RP (Yang et al., 2003).Set up a 20 µl PCR reaction per extracted DNA sample as follows. Final concentrations are indicated in brackets:2 µl 10x DreamTaq Green buffer (1x)0.5 µl dNTPs (0.25 mM)1 µl Badna-FP (0.5 µM)1 µl Badna-RP (0.5 µM)0.2 µl DreamTaq DNA polymerase (0.05 U/ µl)1 µl template DNA (1 ng/ µl)14.3 µl deionized waterThe cycle conditions for PCR amplification are 95 °C for 5 min (initial denaturation), followed by 30 cycles of 94 °C for 20 sec (denaturation), 56 °C for 30 sec (annealing), 72 °C for 30 sec (elongation) and a final extension of 72 °C for 7 min.Load 5-20 µl of the PCR reaction on a 1.5% (w/v) agarose gel including 1x SYBR Safe DNA gel stain in 0.5x TBE buffer. The expected amplicon is 579 bp (Figure 4).Optional: To confirm the suitability of DNA for PCR amplification, all DNA samples can be first screened using primers targeting the yam actin gene, as described by Silva et al. (2015).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171227/20171227193428_6406.jpgFigure 4. Screening yam DNA samples for badnavirus sequences by PCR. Typical agarose gel showing the expected amplicon size of 579 bp for Badna-PCR positive DNA samples from yam.",
    "Lane 1 = TDr 89/02475-A, Lane 2 = TDr 89/02475-B, Lane 3 = TDr 89/02677, Lane 4 = TDr 95/18544, Lane 5 = TDr 96/00629, Lane 6 = TDr 1892-A, Lane 7 = TDr 1892-B, Lane 8 = Pona, Lane 9 = TDr 00/00362-B, Lane 10 = TDr 94/01108-B, Lane 11 = Adaka-B, Lane 12 = TDr 03/00196-A, Lane 13 = TDr 00/00403, Lane 14 = Adaka-B, Lane 15 = TDr 00/00362-B, Lane 16 = TDr 00/00362-C, Lane 17 = TDr 94/01108-B, Lane 18 = TDr 03/00196-B. Adaka and Pona are yam landraces and yam accession numbers followed by A-C depicts clones of the same yam lines. -ve = PCR negative control which was included on a second gel.Screen Badna-PCR positive yam DNA samples by RCA using IllustraTM TempliPhi 100 Amplification Kit.Set up an RCA reaction (final volume 10 µl) in PCR reaction tubes as follows. Final concentrations are indicated in brackets:3.5 µl Kit sample buffer0.25 µl Badna-FP (0.5 µM)0.25 µl Badna-RP (0.5 µM)1 µl undiluted DNADenature sample at 95 °C for 3 min (e.g., in a thermocycler) and chill immediately on ice.Prepare a master mix as follows:5 µl Kit reaction buffer (per reaction)0.2 µl Kit enzyme mix containing Phi29 polymerase (per reaction)Incubate RCA reactions at 30 °C for 18 h using a thermocycler.Inactivate RCA reactions at 65 °C for 10 min.Note: Do not freeze DNA samples before using them as templates in the RCA reactions but keep at 4 °C instead. This improves RCA reaction efficiencies.Digest RCA products with restriction enzymes identified in silico (ideally single cutters, for example using software NEBcutter V2.0 [Vincze et al., 2003]) based on the viral genome sequence expected, or use for example HindIII or PstI when the viral genome sequence is unknown to generate useful restriction profiles.",
    "Digest 2 µl of RCA product according to the manufacturer’s instructions.Mix the digest with DNA-loading dye and load it on a 0.6% (w/v) agarose gel. Separate digested RCA restriction fragments by gel electrophoresis (Figure 5).Cut and purify RCA restriction fragments of interest from the gel. Use minimal UV exposure when cutting bands of interest. This will improve downstream cloning efficiency. Note: A single cutter will produce an RCA restriction fragment of around 7.5 kbp, the typical size of a badnavirus genome. Mixed infections with unknown badnaviruses digested with HindIII and PstI will potentially produce very complex restriction patterns. See Figure 1 within Bömer et al. (2016) as an example of this.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171227/20171227193709_6704.jpgFigure 5. Separation of PstI-digested RCA restriction fragments from six Dioscorea species by gel electrophoresis. Restriction digestion patterns suggest the presence of different episomal badnavirus sequences as well as mixed infections in Dioscorea alata (TDa) and Dioscorea rotundata (TDr) accessions (Bömer et al., 2016). Some RCA products appear to be only partially digested. M = 1 kb DNA ladder, Lane 1 = TDr 89/02475, Lane 2 = TDa 00/00005, Lane 3 = TDa 85/00250, Lane 4 = TDr 95/18544, Lane 5 = TDa 95/00310, Lane 6 = TDr 1892.(Optional) Screen purified RCA restriction fragments by PCR using the generic badnavirus primer pair Badna-FP/-RP (Yang et al., 2003). Sequence positive Badna-PCRs to assess the badnavirus diversity. This way, the focus can be channeled towards novel badnaviruses.Perform Badna-PCR reaction as described in Step 2 using a purified RCA restriction fragment as template.Purify positive Badna-PCRs and analyse the partial RT-RNaseH sequence by Sanger sequencing in both directions using the Badna-FP/-RP primer pair. The expected sequence is 579 bp long.Optional: PCRs can be cloned before sequencing using the pGEM®-T Easy Cloning Kit according to the manufacturer’s instructions, or equivalent.",
    "The insert can then be sequenced with SP6 or T7F primer in one direction only.Digest suitable cloning vector (e.g., pUC19 or pGEM®-3Zf (+)) with the same restriction enzyme chosen in Step 4 according to manufacturer’s instructions to linearize the vector.Mix the digest with DNA-loading dye and load it onto a 1% (w/v) agarose gel. Separate digested from undigested bands by gel electrophoresis.Optional: Treat the linearized vector with alkaline phosphatase according to manufacturer’s instructions to prevent self-ligation.Purify the linearized vector backbone (2.7 kbp for pUC19; 3.2 kbp for pGEM®-3Zf (+)) from the gel.Ligate the digested RCA fragment and the linearized vector.Set up a 10 µl ligation reaction in a 1.5 ml microcentrifuge tube as follows. Final concentrations are indicated in brackets:1 µl T4 DNA ligase 10x buffer (1x)1 µl T4 DNA ligase (3 U)Linearized vector (10 ng to 50 ng)RCA restriction fragment (10 ng to 25 ng depending on size of insert and insert:vector ratio, e.g., 1:1 or 3:1)Nuclease-free, sterile distilled deionized water ad 10 µlMix the reaction and incubate at room temperature for 1 h or at 4 °C overnight.Use 2-4 µl of the ligation reaction to transform chemically competent NEB® 5-alpha E. coli (for pUC19) or JM109 E. coli (for pGEM®-3Zf (+)) cells according to the manufacturer’s instructions. Select transformants on LB plates (Recipe 7) with 100 µg/ml ampicillin, 0.5 mM IPTG and 80 µg/ml X-Gal (LB-amp, IPTG, X-Gal).Do colony-PCR to genotype transformants. Usually testing 5 to 10 colonies is sufficient to obtain positive transformants.Set up a 20 µl PCR reaction per colony as follows. Final concentrations are indicated in brackets:2 µl 10x DreamTaq Green buffer (1x)0.5 µl dNTPs (0.25 mM)1 µl M13F (for pUC19; use SP6 for pGEM®-3Zf (+) instead) (0.5 µM)1 µl M13R (for pUC19; use T7F for pGEM®-3Zf (+) instead) (0.5 µM)0.",
    "2 µl DreamTaq DNA polymerase (1 U)15.3 µl deionized waterUse a pipette tip to pick a white colony and restreak the cells on an LB-amp, IPTG, X-Gal plate. Afterwards, directly dip the tip into the PCR reaction to transfer a small amount of cells. Incubate the plate at 37 °C for approximately 5 h (or overnight) and run the PCR in the thermocycler.Optional: The cells can be dipped into 20 µl sterile deionized water instead of the PCR reaction. The ‘colony-water’ is then incubated at 95 °C for 5 min and used as template (1 µl) for the colony-PCR. This approach allows repeating the PCR in case of failure.The cycle conditions for PCR amplification were 95 °C for 5 min (initial denaturation), followed by 30 cycles of 94 °C for 30 sec (denaturation), 52 °C for 30 sec (annealing), 72 °C for 1 min/kbp insert size (elongation) and a final extension of 72 °C for 7 min.Load 5-20 µl of the PCR reaction on a 1.5% (w/v) agarose gel including 1x SYBR Safe DNA gel stain in 0.5x TBE buffer. The expected amplicon depends on the RCA restriction fragment size cloned.Prepare 5 ml of LB-amp and pick the PCR-positive clones from the restreak plate. Incubate overnight at 37 °C, 200 rpm.Isolate the plasmid from positive clones and analyse insert by Sanger sequencing using M13F/R or SP6/T7F primers to start with, as well as specific primers designed to walk the badnavirus genome.Note: Colony-PCR will be inefficient if a complete badnavirus genome of around 7.5 kbp has been cloned due to the large size of the insert. Checking the presence and size of the insert can also be achieved by performing plasmid restriction digestion instead."
  ],
  "subjectAreas": [
    "Plant Science",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}