{
  "id": 11178,
  "origin_website": "Jove",
  "title": "Postproduction Processing of Electrospun Fibres for Tissue Engineering",
  "procedures": [
    "1. Electrospinning of Random and Aligned Fibres\nElectrospinning creates fine fibrous networks by using electric potential to draw a polymer solution towards an earthed collector. Collectors can be in very many shapes and can be static or, more commonly, rotating.  The solvent evaporates before the solution arrives at the collector and the jet solidifies into a fibre.\nEach polymer requires its own set of conditions to produce a given type of fibre.  The concentration of the polymer, the solvent, the distance between the pumped solution and the earthed collector, the potential difference between the two, the velocity of the rotating collector, the flow rate, temperature and humidity will all affect electrospinning.  There are many studies describing the selection of electrospinning parameters and how these impact on the scaffolds produced (e.g. fibre diameter, morphology, and orientation).5, 6, 7, 8 In these experiments scaffolds were spun based on conditions selected in our previous studies.2, 9\nThe following methods are suitable for the production of electrospun scaffolds from PLGA, poly lactic acid (PLA), poly ε-caprolactone (PCL) and poly hydroxybutyrate-co-hydroxyvalerate (PHBV) using a rotating collector as shown in Figure 1.  Throughout the solvent dichloromethane (DCM) is used. The method here produces microfibrous PLGA, PLA and PCL and nanofibrous PHBV scaffold with micro-sized beads ('pearl necklace' morphology).\nCoat the rotating mandrel collector with aluminium foil, with the polished/shiny side facing outwards.  Our mandrel was 20 cm wide, and 10 cm in diameter.\nPrepare polymer solutions; PLA, PCL and PHBV are made up as a 10 wt% solution in DCM. PLGA is made up as a 20 wt% solution in DCM.\nPlace 4 syringes of 5 ml volume on a syringe pump.  Syringes are loaded to contain 5 ml of the polymer each, giving 20 ml in total.",
    "For PLA, PCL and PHBV use a flow rate of 40 μLmin-1 per syringe.\nFor PLGA use a flow rate of 30 μLmin-1 per syringe.\nFor PLA, PCL and PLGA use a working distance of 17 cm from needle tip to mandrel.\nFor PHBV use a working distance of 10 cm from needle tip to mandrel.\nCharge the syringe needles to +17000 V (73030 P, Genvolt, Shropshire, UK) and electrospin from the appropriate distance onto the aluminium foil coated mandrel.\nFor random fibres rotate the mandrel at 200 rpm.\nFor aligned fibres rotate the mandrel at 1000 rpm.\nScaffolds can be stored on the aluminium foil under dry conditions. Recommended storage is in a sealed container at 4 °C in the presence of desiccant. In our experience scaffolds remain stable for at least 4 months (possibly much longer) under these conditions (we are not aware of any published studies on long term storage conditions for scaffolds).\n2.  Production of Complex Scaffolds by Sequential Spinning\nSequential spinning provides a method of combining the properties of different materials to create a material that has the best of both properties. PHBV produces a flat, dense, brittle sheet whereas PLA or PCL spinning produces low density elastic sheets. Both materials support cell attachment.  Consecutively spinning these materials results in a dense cell-impermeable membrane that is elastic.\nSet up the electrospinning rig as per Section 1, with PHBV spinning conditions.\nElectrospin PHBV as above.\nWithout changing the aluminium foil, electrospin a second polymer on-top using the parameters and normal conditions for that polymer (e.g. 17 cm drum to needle, 17000 V, 200 rpm for PLA). This additive process builds up a double layer of scaffold producing a bilayer.\n3. Production of Multilayered Scaffolds by Annealing Several Layers Together",
    "Scaffolds can be multilayered through the use of heat annealing.  To do this 4 sheets of PLGA are placed on top of each other and then heat annealed at 60 °C for 3 hours.\nScaffolds can also be annealed by vapour annealing.  Here 4 sheets of PLGA are placed on top of each other and suspended 2 cm above a pool of DCM (10 ml) for 1 hour.  This is performed in a sealed container at room temperature.\n4. Aseptic Production and Postproduction Sterilisation of Electrospun Scaffolds\nAseptic scaffold production can be achieved by electrospinning in an aseptic environment of a laminar flow hood inside a clean room environment.  To do this either sterile polymers of medical grade or polymers sterilised by incubation in DCM can be used.  Once dissolved, polymers are electrospun onto sterile foil wrapped around a sterilised mandrel.  Scaffolds are then handled aseptically.  Sterility is verified by incubating samples of the scaffold in antibiotic-free growth media for the appropriate period.\nFor ethanol disinfection (this is of use experimentally but is not a recognised methodology of sterilisation which could be taken to the clinic) scaffolds are placed briefly (15 min) in a 70% v/v solution of ethanol in distilled water.  For practical experimental purposes this is usually sufficient to disinfect scaffolds so that they can then be combined successfully with cultured cells.\nFor peracetic acid sterilisation scaffolds are immersed in peracetic acid (0.1% v/v in phosphate buffered saline (PBS)) and incubated for 3 hours at room temperature as described in Selim et al.9\nFor gamma sterilisation scaffolds are irradiated with a dose of 3 kGy using a caesium source as described in Selim et al.9\n5. Biomechanical Testing of Scaffolds",
    "Scaffolds are cut into rectangles 5 mm x 20 mm, measured for thickness using a micrometer, and placed into a Bose Electroforce 3100 instrument. This machine applies a force of 0-22 N up to a displacement of 6mm and plots the load vs. displacement as a stress/strain curve. This allows the Young's modulus and elasticity to be calculated.\n6. Visualising Cells on Scaffolds and Assessing ECM Production\nCells can be stained with vital fluorescent dyes which allow one to see cells on the scaffolds as they attach, migrate and proliferate. Post culture the presence of cells on scaffolds can be determined by staining for cell nuclei with 4',6-diamidino-2-phenylindole dihydrochloride (DAPI). The production of ECM by cells on the scaffold can be assessed by staining cells for a range of ECM proteins including elastin as shown in this example. All scaffolds used were measured to have a thickness of at least 0.2 mm and cut into squares 1.5 cm x 1.5 cm prior to seeding.\nIn these studies human dermal fibroblasts are used throughout because of the role they play in soft tissue reconstruction which is our laboratory's primary research interest.",
    "Cells are obtained from skin samples from patients  undergoing elective surgery for breast reduction or abdominoplasty (consent was  given for their tissue to be used for research purposes). Tissues are collected and used anonymously  under Research Tissue Bank Licence 12179. Tissues are washed with PBS containing streptomycin (0.1 mg/ml) and penicillin  (100 IU/ml) and amphotericin B (0.5 μg/ml). Tissue samples are incubated in 0.1%  w/v trypsin and 0.1% glucose in PBS (12-18 hours, 4 °C). The dermis is peeled  off, minced finely and incubated with 10 ml of collagenase (0.5% w/v in DMEM and 10% FCS, 37 °C for 18 hours). Centrifugation of the resulting cell suspension  (400 g for 10 mins), produces a pellet of cells that can be cultured and subcultured  in DMEM supplemented with fetal calf serum (FCS, 10% v/v), streptomycin  (0.1 mg/ml), penicillin (100 IU/ml) and amphotericin B (0.5 μg/ml). Only  fibroblasts of passage 4-9 are used in experiments.\nHuman  dermal fibroblasts, once confluent in a T75 (EasyFlask, Nunc, New York, US)  are seeded by adding trypsin/EDTA (5 ml, 5 mg/ml trypsin, 2 mg/ml EDTA in saline),  incubating for 5 minutes at 37 °C. The suspension is centrifuged for 10 minutes (150 g). The cells are resuspended in 5 ml of DMEM (supplemented with FCS (10% v/v), streptomycin (0.1 mg/ml), penicillin (100 IU/ml) and amphotericin B  (0.5 μg/ml)) and counted using a haemocytometer, and the concentration is  adjusted for seeding. Cells are normally seeded at 50,000 cells per well.",
    "If  required, prior to seeding cells on the scaffold, cells can be pre-labelled using  CellTracker red or green. The cells are washed with 3 x 5 ml PBS. A solution of 10 mM CellTracker in serum free, cell-appropriate, medium (10 ml) is added and  the cells are incubated for 45 minutes at 37 °C. After incubation, the cells are  washed in 3 x 5 ml PBS following which they are seeded onto scaffolds. Following this the surface of the scaffolds  can be imaged in an Axon ImageExpress  microscope (Molecular Devices, Sunnyvale, US) at 570 nm λex - 620 nm λem  (CellTracker red) and 480 nm λex - 533 nm λem (CellTracker green). To  investigate the penetration of cells deeper into scaffolds a multiphoton  confocal microscope can be used. This can achieve around 200 micron penetration  into most scaffolds with or without cells.\nPost  culture samples are fixed in 1 ml 3.7% formaldehyde in PBS at 37 °C for 20 minutes and then washed with 3 x 1 ml PBS.\n200 μL of elastin primary antibodies are added to each sample (5% v/v in PBS, rabbit anti-human alpha  elastin, AbDserotec, Kidlington, UK) and incubated at 37 °C for 30 minutes.\nSamples  are washed with 3 x 1 ml PBS and then incubated in a solution of secondary  antibody (0.5% v/v goat anti-rabbit IgG (FC):FITC) in PBS containing DAPI  (1 μg/ml) for 30 minutes.\nFollowing  this the samples are washed with 3 x 1 ml PBS.\nDAPI and secondary antibody stained samples are then imaged on an Axon ImageExpress  fluorescent microscope, 365 nm λex - 460 nm λem for DAPI and 480 nm λex - 533 nm λem for the secondary antibody. DAPI stains the nuclei and allows one to see the distribution of cells within the fibres very readily.",
    "7. Subjecting Cells on Scaffolds to Biaxial Dynamic Conditioning\nTo examine the effect of dynamic conditioning on fibroblast ECM production we developed a simple proof-of-concept bioreactor to explore this. \nAssemble balloon and flow regulation apparatus and prepare system so it can be readily  placed into a sterile vessel suitable for cell culture once it is coated.\nAutoclave the apparatus including the balloon (122 °C, 220 mBar for 1 hour). We can confirm that balloons survive autoclaving without adversely affecting their function by inflating and deflating them repeatedly.\nIn a clean room, unpack the apparatus in a laminar flow hood in position to be electrospun onto.\nInflate the balloon to the required surface area (remember the balloon still needs to fit into the culture vessel) with phosphate buffered saline and connect the PBS to an electrical earth at a point in the apparatus that does not need to be sterile (branch pipe on 3-way tap).\nElectrospin the required polymer onto the balloon using the normal spinning conditions, using a working distance of 10 cm.  Allow the scaffold to dry for 1 hour. The 'wet' fibres are 'sticky' enough to adhere to the surface of the balloon without subsequently detaching.\nPlace the balloon into a sterile vessel and transport it to a laminar flow hood suitable for cell culture.\nRemove the balloon from the vessel and place onto a sterile surface (Petri dish) and repeatedly (every 20 seconds) pipette a cell suspension (1 x 106 cells in 5 ml of DMEM) onto the coated balloon for 20 minutes to attempt to distribute cells evenly over the surface.\nPlace balloon into the culture vessel, and add pre-warmed media appropriate to the cell type.",
    "Connect the inflation apparatus to a syringe pump (Kent Scientific, Genie Plus, Connecticut, US) and inflate/deflate the balloon as required to give biaxial distension. A computer controlled syringe pump can be used to achieve a more complex distension regime.\n8. Representative Results\nThe following figures are representative results that can be expected if the above methods are followed.\nElectrospinning can be utilised to create scaffolds with random and ordered architectures (Figure 1), this is repeatable and the fibres are uniform. Many types of polymers can be electrospun with characteristics which can vary considerably as shown in Figure 2 for PHBV, PLA or PCL. Electrospinning can produce light fluffy scaffolds or dense cell impenetrable membranes (see Figure 3). All scaffolds shown here facilitated cell attachment and proliferation. Previous work has shown that cells can migrate through these scaffolds up to a depth of at least 500-600 μm.9 For PLA the average fibre diameter is 3 μm; for PHBV it is 0.3μm with pearls ranging from 5-20 μm; for PCL it is 3 μm; and for PLGA it is 11 μm. Other studies using other solvent systems report that PHBV can be electrospun as fibres without beads or polymer pearls.10,11\nIf thicker scaffolds are required vapour and heat annealing can be employed to anneal layers of scaffolds together (see Figure 4). These scaffold layers do not delaminate and it can be very difficult to find the junction between layers.",
    "We show that bilayer membranes can be made where cells A and B can each be cultured on a separate membrane without intermingling as shown in Figure 5. Here we demonstrate this by using human dermal fibroblasts coloured with two different fluorescent cell tracker dyes.  Such a bilayer membrane would be useful when culturing cells to form a hard tissue such as bone or cartilage on one side separated from cells designed to form a soft (and usually faster growing) tissue on the other side such as cleft palate repair or reconstructive periodontal surgery.12, 13\nWith respect to the impact of sterilisation on electrospun scaffolds we have previously reported that the method of sterilisation impacts on the scaffold and subsequent cell culture.9 This is illustrated in Figure 6 which shows the effects of peracetic acid, gamma irradiation and ethanol on the fibre diameter and ultimate tensile strength and Young's modulus of a PLGA scaffold.\nGamma irradiation has no significant effect on fibre diameter whereas peracetic acid and ethanol reduce fibre diameter by approximately 50%.  With respect to ultimate tensile strength each of the methods of sterilisation changed the ultimate tensile strength and the elasticity of the scaffolds.  Culture of cells on these scaffolds further reduced the ultimate tensile stress, but increased the elasticity.\nFinally, a method of testing the effect of dynamic biaxial distension on cells cultured on electrospun scaffolds is presented. This proof-of-concept approach shows that cells remain viable during dynamic distension but also produce increased amounts of elastin under these conditions.  This contrasts markedly to the lack of elastin when the same cells on the same scaffold are maintained under static conditions (see Figure 7).\nimgsrc://cloudfront.jove.com/files/ftp_upload/4172/4172fig1.jpg",
    "Figure 1.  Shows a cartoon of an electrospinning rig and of the  spinning of random and parallel fibres and then layers of fibres placed over  each other. Perpendicular fibres can be created by electrospinning a set of  aligned fibres onto aluminium foil, rotating the foil by 90° and then  immediately electrospinning a second set of aligned fibres on top of these.\nimgsrc://cloudfront.jove.com/files/ftp_upload/4172/4172fig2.jpg\n Figure 2.  Shows the morphology of  random electrospun mats of (A) PLA (scale bar is 100 μm), (B) PHBV (scale bar is 100 μm), (C) PCL (scale bar is 100 μm) and (D) PLGA (scale bar is 200 μm). Note that PLA, PCL  and PLGA are all microfibrous uniform scaffolds. PHBV is spun as a 'pearl necklace' with nanofibres connecting 5-20 μm sized beads.  Click here to view larger figure[href=http://www.jove.com/files/ftp_upload/4172/4172fig2large.jpg].\nimgsrc://cloudfront.jove.com/files/ftp_upload/4172/4172fig3.jpg\n Figure 3.  Production of a multilayered scaffold. Here the scaffolds are initially spun using PHBV  and then syringes filled with PLA or PCL are used. These are spun on top of the  PHBV scaffold. The figure shows the  appearance of these multilayered scaffolds, (A) A single PHBV layer, (B) A cross  section of a PHBV-PLA bilayer, showing the dense nanofibrous, 'pearl necklace' PHBV  layer (left) and more open microfibrous PLA layer (right) and (C) A single PLA  layer.  Click here to view larger figure[href=http://www.jove.com/files/ftp_upload/4172/4172fig3large.jpg].\nimgsrc://cloudfront.jove.com/files/ftp_upload/4172/4172fig4.jpg",
    "Figure 4.  Thicker scaffolds can be produced by heat annealing  and vapour annealing. (A) and (B) show a  section through a vapour annealed PLA scaffold where initial fibrous scaffolds  of approximately 150 μm are been placed together and dichloromethane vapour is  used to make much thicker scaffolds of up to 500 μm. In (C) and (D) one can see that the scaffold  consists of layers of much thicker fibres interspersed with layers of thinner  fibres created by heat annealing layers of thin and thick fibres together. This approach can be used to produce  scaffolds of complex mechanical properties.  Click here to view larger figure[href=http://www.jove.com/files/ftp_upload/4172/4172fig4large.jpg].\nimgsrc://cloudfront.jove.com/files/ftp_upload/4172/4172fig5.jpg\n Figure 5.  Appearance of cells on a bilayer scaffold. In all cases the cells present are human  dermal fibroblasts. (A) Fibroblasts on  electrospun PLA where the cells are fixed and stained with DAPI. (B) DAPI  stained cells on PHBV. In (C) the  fibroblasts are pre-stained with a vital dye, CellTracker green, and you can  see the appearance of them on the PLA side of the bilayer. (D) A section through the bilayer with red  stained fibroblasts on the lower PHBV surface and green stained fibroblasts on  the upper PLA surface. (E) Fibroblasts  pre-stained with CellTracker red grown on the PHBV surface. The use of vital fluorescent dyes provides a  convenient methodology for looking at the distribution of cells on the scaffold  while the cells are still growing. One  can routinely use these dyes for at least 7 days. However the concentration of dye becomes diluted as the cells divide. Scale bars are equal to 0.1 mm.\nimgsrc://cloudfront.jove.com/files/ftp_upload/4172/4172fig6.jpg",
    "Figure 6.  Biomechanical  properties of electrospun scaffold are obtained using a Bose Electroforce  tensiometer device (A). (B) Stress/strain curves of PLGA scaffolds sterilised by gamma irradiation, alcohol, peracetic acid, or aseptically  produced. Three measurements can be obtained from such a graph: the  ultimate tensile stress (UTS) to which the fibre can be subjected before it breaks,  the ultimate tensile strain and the Young's modulus. The latter gives an  indication of the elasticity of the scaffold. (C) The effect of each sterilisation method on PLGA fibre diameter in μm. Each sterilisation  methodology decreased UTS. Both  peracetic acid and gamma irradiation decrease the Young's modulus giving a more  elastic scaffold, alcohol makes the scaffold particularly brittle.  Click here to view larger figure[href=http://www.jove.com/files/ftp_upload/4172/4172fig6large.jpg].\nimgsrc://cloudfront.jove.com/files/ftp_upload/4172/4172fig7.jpg",
    "Figure 7.  This figure shows the use of a simple balloon to provide a biaxial bioreactor on which scaffolds (and cells growing within the scaffolds) can be subjected to biaxial distension for periods of time.  (A) A deflated balloon onto which electrospun fibres, PHBV, have been deposited.  At this stage the balloon is partially covered with fibres.  (B) A balloon fully coated with PHBV and PLA fibres. (C) A cell suspension is repeatedly pipetted onto the balloon. (D) A balloon placed within a bottle of sterile media where the balloon is connected to a syringe pump and PBS (used as a conducting electrolyte) is used to gently inflate and allow deflation of the balloon against a programmed schedule.  (E) Cells on scaffolds being removed from the balloon at the end of the experiment and analysis undertaken for cell viability shown in (F) where viable cells develop a dark blue colour using the metabolic indicator 3-(4,5-dimethylthiazol-2-yl)-2,5-diphenyltetrazolium bromide.  (G) Shows that cells (blue) cultured on this balloon and subject to biaxial distension develop elastin fibres (green, stained using elastin specific antibodies), whereas the same cells on an identical scaffold (H) cultured under static conditions have negligible elastin production. Scale bars are equal to 0.025 mm.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}