{
  "id": 18865,
  "origin_website": "Jove",
  "title": "Identifying Amino Acid Overproducers Using Rare-Codon-Rich Markers",
  "procedures": [
    "1. Construction of the plasmids expressing the rare-codon-rich marker genes\nSelect a marker gene that contains an appropriate number of the common codons for the targeted amino acid.\n\tNOTE: For L-leucine, the kanamycin resistance gene kanR, which contains 29 leucine codons, of which 27 are common codons, is used for the construction of the selection system13. The gfp gene, which contains 17 common codons out of 19 leucine codons, or the purple protein-encoding gene prancerpurple (ppg), which harbors 14 leucine common codons, is used for the screening system (Supplementary Table 1).\nReplace the common codons in the marker genes with the synonymous rare codon. For L-leucine, replace its codons in kanR, gfp, or ppg with the rare codon CTA, generating kanR-RCs, gfp-RC, or ppg-RC, respectively13 (Supplementary Table 1).\n\tNOTE: The frequency of the rare codon in the marker genes will affect the stringency of the selection or screening system. In general, increasing the number of rare codons will increase the stringency of the selection or screening system. To achieve the appropriate selection or screening strength, design a series of marker genes that harbor different numbers of rare codons and compare their effects.\nGenerate building blocks of the rare-codon-rich marker genes using tools such as GeneDesign14 (http://54.235.254.95/gd/) for gene synthesis. Alternatively, order the marker genes from commercial gene synthesis services.\n\t\nOn the GeneDesign page, choose Building block design (constant length overlap).\nPaste the sequences of the rare-codon-rich marker genes in the Sequence box.\nDefine the overlap length between the assembly oligos; keep in mind that the default 40 bp works fine for most sequences.\n\t\tNOTE: See the online manual for more instructions on the settings of the other parameters.\nClick the Design building blocks button and order the oligonucleotides listed on the page.",
    "Synthesize the rare-codon-modified genes by polymerase chain reaction (PCR)-based accurate synthesis15.\nLigate the rare-codon-rich kanR-RC to vector pET-28a, gfp-RC to pSB1C3, and ppg-RC to CPB-37-44116.\n\tNOTE: The pET-28a and pSB1C3 plasmid maps are available on the SnapGene online plasmid database (Supplementary Table 1); the CPB-37-441 plasmid map is available on the ATUM chromogenic protein website.\n\t\nOn ice, add the vector and the marker fragments in a molar ratio of 1:1 to 7.5 μL of assembly mix (see Table of Materials) to a total volume of 10 μL. Incubate the sample at 50 °C for 1 h.\nTransform 5 μL of the assembly product into 50 μL of competent cells (see the Table of Materials) at 42 °C for 30 s.\nRecover the cells in SOC (Super optimal broth with catabolite repression) medium at 37 °C for 1 h, plate them on LB (lysogeny broth) agar medium, and incubate them at 37 °C overnight.\nInoculate the colony into LB medium and incubate at 37 °C for 8 h.\nIsolate the plasmid using a preferred commercial kit.\n2. Optimizing the selection conditions\nMake the parent strain used for mutagenesis into competent cells17.\nTransform 50 μL of the competent cells with 1 μL of plasmid that carries the wild-type kanR, and transform another set of the competent cells with the plasmid containing kanR-RC29 with all leucine codon replaced by the rare codon CTA.\nAdd 950 μL of SOC medium and incubate the sample in a shaker at 250 rpm at 37 °C for 1 h.\nPlate 100 μL of the cell culture onto the LB agar medium containing 50 μg·mL-1 kanamycin, and incubate it at 37 °C for approximately 8 h until colonies appear.",
    "Pick the colonies that harbor the wild-type kanR and the leucine rare-codon-rich kanR-RC29 and use each to inoculate 5 mL of fivefold diluted LB medium (0.2x LB) containing 50 μg·mL-1 kanamycin. Incubate the samples in a shaker at 250 rpm at 37 °C.\n\tNOTE: The medium is crucial for the selection system. It should contain just enough carbon and nitrogen to allow expression of the antibiotic resistance protein from the wild-type gene rather than from the rare-codon-modified derivatives. In this case, the L-leucine concentration in 1x LB medium is too high to completely inhibit the protein expression from the rare-codon-rich kanR. Thus, a diluted LB medium with a dilution factor such as 5 is used to generate a clear difference in protein expressions from the wild-type and the rare-codon-rich genes.\nTransfer 200 μL of each of the cell cultures to a 96-well plate in triplicate at defined time points (e.g., 8 h, 16 h, and 24 h). Measure the OD600 (optical density at 600 nm) using a plate reader.\n\tNOTE: If a decrease in the cell OD600 cannot be detected for strains harboring the rare-codon-rich marker genes in comparison to the OD600 of the strain harboring the wild-type marker genes, try to increase the amount of rare codon in the marker genes or use a more diluted medium.\nPerform the amino acid feeding assay to test if the expressions of the rare-codon-rich marker genes (e.g., kanR-RC29) can be restored by increasing the concentration of the targeted amino acids.\n\tNOTE: For the selection of L-leucine overproducers, L-leucine is used for feeding.",
    "Inoculate the strains harboring the kanR-RC29 marker gene into 5 mL of the 0.2x LB (containing 50 μg·mL-1 kanamycin) with or without the supply of 1 g·L-1 L-leucine. Inoculate another 5 mL of the 0.2x LB with strains that harbor the wild-type kanR as control. Incubate the samples in a shaker at 250 rpm at 37 °C.\nMeasure the OD600 for each culture at defined time points (e.g., 15 h, 17 h, 19 h, and 22 h).\n3. Optimizing the screening conditions\nTransform 50 μL of the parent strain used for mutagenesis with 1 μL of plasmid (~50 ng·μL-1) that carries the wild-type gfp or the wild-type ppg. Also, transform the parent strain with the rare-codon-rich derivatives of the marker genes.\nAdd 950 μL of SOC medium and incubate the sample in a shaker at 250 rpm at 37 °C for 1 h.\nPlate 100 μL of the cell culture onto the LB agar medium containing the appropriate antibiotics (25 μg·mL-1 chloramphenicol for the gfp plasmid carrying a cmR marker, or 50 μg·mL-1 kanamycin for the ppg plasmid carrying a kanR marker) and incubate overnight at 37 °C.\nPick one colony that harbors the wild-type gfp or ppg and one colony that harbors the corresponding rare-codon-rich derivative, and transfer them to 5 mL of the properly diluted LB medium individually. Incubate the samples in a shaker at 250 rpm at 37 °C.\n\tNOTE: For E. coli strains harboring the leucine rare-codon-rich gfp-RC or ppg-RC, the undiluted LB medium (1x LB) can be used to create significant differences in the expressions of the wild-type and the rare-codon-rich marker genes. Also, inducible promoters are used to drive the expressions of the screening marker genes. Begin the induction when the cells enter the exponential phase to achieve better discriminations.",
    "For fluorescence markers, transfer 200 μL of each of the cell cultures into a 96-well clear-bottomed black plate in triplicate at defined time points (e.g., 2 h, 4 h, and 6 h). Measure the OD600 and the fluorescence and calculate the fluorescence intensity (the ratio of fluorescence to OD600). For chromogenic markers, measure the color development of the cell cultures.\n\tNOTE: If lower fluorescence intensities cannot be detected for strains harboring the gfp-RC in comparison to that of the strains harboring the wild-type gfp, or if a lighter color cannot be detected for cells expressing the purple protein from the ppg-RC than from the wild-type gene, try to increase the number of rare codon on the marker genes or use a more diluted medium.\nPerform the feeding assay (see steps 2.7.1 and 2.7.2). Measure the fluorescence intensity or the color development at defined time points (e.g., 12 h, 18 h, and 24 h).\n4. Identification of the amino acid overproducers\nInoculate 100 μL of the culture of the mutants into 5 mL of LB medium (2% v/v) and incubate it in a shaker at 250 rpm at 37 °C until the values of OD600 reach 0.4.\nMake the mutants into competent cells17.\nTransform 50 μL of the mutant cells with 1 μL of the plasmid (~50 ng·μL-1) carrying the selection marker kanR-RC29 or the screening markers gfp-RC or ppg-RC. Add 950 μL of SOC medium and rotate the sample in a 37 °C shaker for 1 h.\nSelect amino acid overproducers.\n\t\nCentrifuge the cell culture at 4,000 x g for 5 min, discard the supernatant and add 5 mL of 0.2x LB medium containing 50 μg·mL-1 kanamycin. Incubate the sample in a 37 °C shaker overnight.",
    "Plate the overnight culture (e.g., 100 μL, depends on the cell density of the culture) onto 0.2x LB agar medium containing 50 μg·mL-1 kanamycin and incubate at 37 °C for 12 h.\n\t\tNOTE: The colonies developed are the candidates of the targeted amino acid overproducers and, in this case, the L-leucine overproducers.\nScreen the amino acid overproducers.\n\t\nPlate the appropriate number of cells (e.g., 100 μL) harboring the screening marker (as described in step 4.3) onto the LB agar medium containing the appropriate antibiotic (25 μg·mL-1 chloramphenicol for screening with gfp-RC and 50 μg·mL-1 kanamycin for screening with ppg-RC) and incubate at 37 °C for 8 h.\nInoculate the LB medium containing the appropriate antibiotic (see step 4.5.1) with each single colony from the plate. Incubate the samples in a shaker at 250 rpm at 37 °C.\nMeasure the OD600 and the fluorescence and calculate the fluorescence intensity if gfp-RC is used. Measure the color development of the cell cultures if ppg-RC is used. Note that the strains exhibiting a higher fluorescence intensity or a deeper color than that of the parent strain are the candidate amino acid overproducers and, in this case, the L-leucine overproducers.\n\t\tNOTE: The fluorescence-activated cell sorting is also suitable for identifying single-cell high-producers when the rare-codon-rich fluorescent protein genes are used for screening.\nVerify the amino acid productivities of the candidate strains.\n\t\nInoculate 5 mL of LB medium with each of the candidate strains and let the cells grow overnight in a shaker at 250 rpm at 37 °C.\nHarvest the cells from 1 mL of the cell culture by centrifugation at 4,000 x g for 2 min. Discard the supernatant and resuspend the pellet with 1 mL of sterile water.",
    "Inoculate 20 mL of M9 medium containing 4% glucose with 200 μL of the cell suspension and incubate in a 250 mL shaker at 250 rpm at 37 °C for 24 h.\nCentrifuge 1 mL of the culture medium at 4,000 x g for 5 min. Transfer 200 μL of the supernatant to a clean 1.5 mL tube. Prepare L-leucine solutions (HPLC (high-performance liquid chromatography) grade) of 0.01, 0.05, 0.1, 0.5, and 1 g·L-1 as standards.\nAdd 100 μL of 1 mM triethylamine and 100 μL of 1 M phenyl isothiocyanate to the supernatant and the standards, mix them gently, and incubate them at room temperature for 1 h18.\n\t\tCAUTION: Triethylamine and phenyl isothiocyanate can cause severe skin burns and eye damage and is harmful if inhaled. Wear gloves and a mask and, if possible, perform this step in a fume hood.\nAdd 400 μL of n-hexane to the same tube and vortex it for 10 s. Filter the lower phase containing the amino acid derivatives through a 0.2 μm polytetrafluoroethylene membrane.\n\t\tCAUTION: n-hexane can cause skin irritation. Wear gloves and protective clothing. If it comes in contact with skin, rinse the skin with plenty of water.\nPrepare mobile phase A by mixing 0.1 M sodium acetate (pH 6.5) and acetonitrile in a 99.3:0.7 volumetric ratio. Prepare acetonitrile (80% v/v) as mobile phase B. Filter all mobile phases through 0.2 μm polytetrafluoroethylene membranes.\n\t\tCAUTION: Acetonitrile is harmful if inhaled and can cause skin and eye irritations. Wear gloves and protective clothing and perform this step in a fume hood.",
    "Run 1 μL of the sample on an ultra-HPLC equipped with a C18 column according to the elution program in Table 1 with a flow rate of 0.42 mL·min-1 and a column temperature of 40 °C. Detect the targeted amino acids at 254 nm with a diode array detector and calculate their concentrations by mapping the peak areas to the standard curve.\ntable:\n﻿0,1,2\nTime (min),Mobile phase A (%),Mobile phase B (%)\n0,98,2\n3.5,70,30\n7,43,57\n7.1,0,100\n11,98,2\nTable 1: Elution program for the quantification of amino acids.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}