{
  "id": 8894,
  "origin_website": "Jove",
  "title": "Exploring Deep Space - Uncovering the Anatomy of Periventricular Structures to Reveal the Lateral Ventricles of the Human Brain",
  "procedures": [
    "All methods described here have been approved by the Human Research Ethics Committee of the Australian National University. To create the ventricular model we used the Klingler fiber dissection technique12,14. The Klingler technique is a tactile dissection method that involves removing small portions of the gray matter of the cortex and peeling off bundles of nerve fibers, thus providing a step-by-step guide through the tissue layers from the surface to the deep structures of the brain.\nNOTE: The brain specimen used to demonstrate this protocol in the accompanying video and images was carefully removed from a formalin-embalmed human cadaver obtained from the body donor program of the Medical School, Australian National University. The donor had no known history of neuropathological disease. After removal of the dura mater, the brain was stored in 10% ethanol solution at room temperature for three years.\n1. Preparation\nObtain a whole brain from an embalmed human cadaver and remove the dura mater and store the brain in 10% ethanol at room temperature prior to dissection.\n\tCaution: Use personal protection equipment in a well-ventilated room in accordance to local guidelines when handling. Ensure all participants are familiar with the institutional procedures for the safe handling and disposal of a scalpel and sharp objects before commencing the dissection protocol.\nPrepare the following instruments: scissors, forceps, scalpel blades (No. 15 and No. 22), metal probe, and the blunt end of a metal scalpel handle (Figure 1). Use the blunt end of the scalpel handle to minimise damage to the delicate nerve fibers and conserve the major white matter fiber tracts (Figure 2)13.\nPosition the brain so that its ventral surface is facing upwards.\n2. Dissection Procedure\nNOTE: The dissection takes approximately 2 to 3 h to complete",
    "Remove the arachnoid mater and associated vasculature from both cerebral hemispheres using a pair of atraumatic (blunt) forceps.\nGently lift the cerebellum and locate the inferior colliculi. Place the scalpel blade (No. 15) attached to a long scalpel handle just caudal to the inferior colliculi and cut axially through the brainstem. Keep the blade as close to horizontal as possible to avoid damaging the cerebellum. Take care to preserve the tectum of the midbrain.\nPosition the brain to view the left or right lateral fissure. Starting at the supramarginal gyrus, use the blunt end of the scalpel handle to gently remove the superficial cortical layers. Gently move forward first above, then below the lateral sulcus to reveal the horizontal association fiber bundles running in the parietal, frontal, and temporal lobes, respectively.\nFollow the direction of the fibers arching around the posterior border of the insula connecting the superior and inferior longitudinal fasciculi to reveal the arcuate fasciculus.\nAnteriorly, gently remove the remaining superficial cortical layers of the middle temporal and inferior frontal gyri to reveal the uncinate fascicular fibers that connect the temporal and frontal lobes\nIdentify the short gyri of the insular cortex and then remove the insula. Next remove the extreme capsule and claustrum to reveal the underlying external capsule. Note the bulge formed by the lentiform nucleus deep to the capsule. Moving towards the dorsal surface of the cortex, reveal the fibers of the corona radiata (Figure 4).\nRemove the remaining cortex and underlying white matter on the dorsal surface of the brain to reach the cingulate gyrus. Continue to use the blunt-end of the scalpel handle to remove the cingulate cortex to reveal the cingulum, the white matter tracts connecting the anterior perforated substance with the parahippocampal gyrus.",
    "Use the same technique to remove the cingulum from posterior to anterior to reveal the corpus callosum, composed of commissural fibers connecting the two cerebral hemispheres. The dorsum of the body (trunk) of the corpus callosum will now be visible (Figure 6).\nRepeat steps 2.3 to 2.8 on the contralateral cerebral hemisphere.\nPalpate and identify the extent of the lateral ventricle on one of the hemispheres. Using a probe, puncture the lateral wall of the ventricle at the site of the collateral trigone. Using a size 24 blade (attached to a No. 4 scalpel handle) enter through the puncture-site and cut inferiorly to open up the entire length of the inferior horn of the lateral ventricle.\nNow return to the ventricular collateral trigone to extend the cut superiorly towards the splenium of the corpus callosum (dotted line in Figure 5).\nRepeat steps 2.10 and 2.11 on the other hemisphere.\nOpen the body of the lateral ventricle by continuing the incision from the trigone rostrally using a cut approximately 3 cm parallel to the corpus callosum in both hemispheres (dotted lines in Figure 6).\nJoin the two parallel incisions in each hemisphere rostrally at the level of the genu and caudally at the level of the splenium of the corpus callosum. Using forceps, held in the non-dominant hand, gently lift the corpus callosum at the splenium. With a small sharp pair of scissors, held in the dominant hand, separate the splenium from the underlying septum pellucidum. Once you have reached the rostral end of the body, cut the corpus callosum and remove it.",
    "Nestle the ventral surface of the brain lengthwise on the palm of your non-dominant hand to stabilize the occipital and temporal areas (posterior part). At the same time, use your dominant hand to firmly but gently hold the anterior end of the brain by placing your opposed fingers and thumb on the lentiform nuclei of both sides of the brain.\nUsing gentle pulling and twisting motions, physically separate the anterior and posterior parts of the brain taking special care to keep the choroid plexus intact. It is recommended that a colleague be present to guide the separation and gently section any remaining connecting tissues during the process using a scalpel.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}