{
  "id": 999,
  "origin_website": "Nature",
  "title": "Ex-vivo characterization of Drosophila heart functional parameters",
  "procedures": [
    "Procedure \nPreparation of samples and physiological analysis\n1) Anesthesia.\nAnesthetize the insects with FlyNap® according to the instructions by the provider. Avoid the use of CO2 because it can affect cardiac parameters. \nCRITICAL. Do not expose flies to the anesthetic for longer than 5 min because they can die.\n2) Dissection.\n2.1) Take a petri dish and coat it with a thin layer of petroleum jelly. Petroleum jelly allows to immobilize the flies. \n2.2) Paste flies dorsal side down with the wings outstretched \\(Fig 1A). \n2.3) Put the scissors behind the third pair of legs with an angle of 45º with respect to the surface of the petri dish and cut to remove the head, the legs and part of the thorax.\n2.4) Add oxygenated artificial hemolymph and cut the genial portion to create an opening. \n2.5) Introduce the scissors through the previous opening and cut through the whole abdomen to the thorax. As a result, abdomen splits in two halves. \n2.6) Use forceps to take out the intestine, reproductive organs and fat \\(Fig 1B). After this step, the heart and the nephrocytes should be tightly attached to the dorsal cuticle. \n2.7) With a suction pump and a patch pipet, take out any extra fat or non-cardiac tissue remnants near the heart without touching the organ \\(Fig 1C). Finally, replace the hemolymph with new one. The preparation can be used for approximately 1 h. Change AH hourly.\nNOTE. Female flies are easier to dissect because of their bigger size.",
    "CRITICAL. Take extra care removing fat surrounding the heart. If you physically touch the heart, the preparation must be discarded because it compromises the reliability of the subsequent physiological analyses. Place the beating hearts under bright field microscopy. Record 20 s videos of each beating heart with a high-speed camera at a frame rate of at least 160 frames/s. Videos are to be processed using the software program described in Ocorr et al. 2014, which will generate a number of cardiac parameters including heart period \\(HP), heart rate \\(HR), arrhythmia index \\(AI), systolic interval \\(SI), diastolic interval \\(DI), percentage of fractional shortening \\(%FS), end systolic diameter \\(EDD), and end diastolic diameter \\(EDD).\nNOTE. To ensure proper statistical power, record a minimum of 20 fly hearts per experimental condition or genotype. \nCRITICAL. Quality of videos is critical so ensure a good contrast of heart walls. \n? Troubleshooting\nAfter obtaining the above physiological parameters, dissected hearts can be processed for a number of downstream applications such as in situ hybridization to detect a specific transcript \\(A), immunofluorescence to detect a protein at subcellular resolution \\(B), staining with phalloidin to reveal heart muscle fibres \\(C), and molecular methods to extract RNA \\(D) or proteins \\(not described here), and to generate cDNA for transcriptome analysis \\(E). \nA. Fluorescence In situ Hybridization \\(FISH)\nIn our case, we detected CUG-RNA transcripts in control and DM1 flies. For this purpose, FISH was done with a Cy3-labeled CAG probe. \n1. Transfer the dissected flies dorsal side down in 96-well plate and fix them with 4% PFA for 20 min at RT. \n  2. Wash the samples 3 times for 10 min each with 1X PBS. \n  3. Wash the samples with ice-cold 70% ethanol. \n  4. Replace the ethanol with washing solution for 30 min at RT.",
    "5. Add hybridization solution \\(without the probe) to prehybridize the samples for at least 1 h in darkness.\n  6. Denature the probe at 80°C for 5 min. Add it to the hybridization solution at a 1:100 dilution and replace the prehybridization solution with the diluted probe.\n  7. Hybridize the samples overnight in dark at 37ºC.\n  NOTE. Different probes may require different hybridization temperatures.\n8. Next day, wash the samples with washing solution for 30 min at hybridization temperature. \n  9. Transfer the samples to slides and cover with mounting medium including DAPI. Finally, put on a coverslip.\n  NOTE. 96-well plates allow to use less volume. Use approximately 200 µl of volume from each solution in each well.\n? Troubleshooting\nB. Immunofluorescence \nIn particular, we detected Muscleblind protein in control and DM1 model flies. \n1. Transfer the dissected flies dorsal side down \\(Fig 1C) to a 96-well plate and fix them with 4% PFA for 20 min at RT.\n  2. Wash the samples with PBT 3 times for 10 min each one. \n  3. Block the samples with blocking solution for 30 min at RT. After blocking, add preabsorbed primary antibody solution.\n  4. Incubate overnight with primary antibody \\(1:200) at 4°C.\n  5. After overnight incubation, wash the samples with PBT, 3 times for 10 min each. \n  6. Add 200 µl of biotinylated anti-sheep secondary antibody \\(1:200) and incubate it for 30 min at RT. \n  7. Wash the samples with PBT, 3 times for 10 min each. \n  8. Add ABC mixture, following the manufacturer’s instructions, to amplify the signal and incubate it for 30 min. \n  NOTE. This step is only necessary if the antibodies are conjugated with biotin.\n9. Wash 2 times with PBT for 15 min each. \n  10. Incubate the samples with streptavidin-FITC \\(1:1000) solution for 1 h at RT.",
    "11. Wash with 1X PBS 3 times for 10 min each. \n  12. Mount the samples with mounting medium with DAPI. \n  NOTE. All incubations and washes must be with gentle agitation. Do not put more than 6 flies per well.\n? Troubleshooting\nC. Phalloidin staining\n1. Take the dissected flies \\(Fig 1C), transfer them to a 96-well plate and incubate them with 4% PFA for 20 min.\n  2. Wash the samples with 1X PBS 3 times for 10 min each.\n  3. Incubate the samples with Phalloidin \\(1:1000) solution for 20 min at RT. \n  4. Wash the samples with 1X PBS 3 times, 10 min each.\n  5. Transfer the samples to slides using forceps, add mounting medium and put a coverslip. \n  D. Total RNA extraction\nNote: For an approximate yield of approximately 150 ng of total RNA, collect 18-20 fly hearts \\(only with the cuticle attached, nephrocytes can remain attached to the heart so it causes a contamination). For RNA extraction we use miRNeasy® mini kit protocol with some modifications.\n1. Transfer the dissected hearts to 1.5 ml microcentrifuge tubes.\n  2. Add 200 µl of Qiazol solution to each tube and homogenize the samples with homogenizer pestles. \n  3. Add 500 µl of Qiazol and leave the samples at RT for 5 min. \n  4. Add 200 µl chloroform to each tube and shake vigorously for 15 s. \n  5. Leave the samples at RT for 3 min. \n  6. Centrifuge the samples at 4°C for 15 min at 12000 g.   \n  7. Take the upper phase and transfer it to new 1.5 ml tube.\n  Note: Lower phenol phase contains proteins, middle thick white interphase contains DNA and lipids and upper aqueous phase contains RNA.\n8. Add 1 ml of absolute alcohol and mix gently.",
    "9. Load 700 µl in the kit column and centrifuge it for 15 s at 12000 g at RT. Repeat this step again with the remaining alcohol mixture. \n  10. Add 500 µl of RPE buffer and centrifuge for 15 s at 12000 g. Add again the same volume of RPE buffer and centrifuge the columns for 1 min at the same speed. \n  11. Transfer the kit column to a new 1.5 ml tube and add 25 µl of RNase-free water and centrifuge for 1 min at 12000 g. Repeat the same step and obtain 50 µl of total eluate. \n  12. Check the concentration. \n  NOTE. All the above mentioned solutions and buffers are available with the kit. \nCRITICAL. Homogenize the samples thoroughly for a good RNA extraction yield. During collection of aqueous phase, be particularly careful not to take any interphase or phenolic phase since this will strongly contaminate the extracted RNA. \n? Troubleshooting\nE. Reverse transcription\nStarting material will be the total RNA previously extracted. \n1. Use 1 µg of total RNA in a volume of 8 µl. Add 1 µl of DNase buffer and 1 µl of DNase.\n  2. Incubate the samples at 37°C for 30 min. \n  3. Stop DNase by heating all the samples at 75°C for 10 min. \n  4. Add 1 µl of dNTPs and 1 µl hexamers and incubate all the samples at 65°C for 5 min. \n  5. Add 4 µl of 5x buffer, 1 µl of DTT, 1 µl of RNase out and 1 µl of Superscript II to all the samples.\n  6. Set the following program in the thermocycler: 25°C for 10 min, 42°C for 50 min, 70°C for 15 min and 4°C.\n  7. Save the samples at -20°C for future use.",
    "NOTE. This cDNA sample can be used for several molecular applications such as checking splicing events or gene expression levels. \n? Troubleshooting"
  ],
  "subjectAreas": [
    "Biotechnology",
    "Biological Techniques",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}