{
  "id": 17621,
  "origin_website": "Jove",
  "title": "PCR Mutagenesis, Cloning, Expression, Fast Protein Purification Protocols and Crystallization of the Wild Type and Mutant Forms of Tryptophan Synthase",
  "procedures": [
    "1. Fast protocol to purify the α- and β-subunit and the recombined α2β2 StTS complex\nDNA subcloning into pETSUMO expression vector\n\t\nObtain the translationally coupling gene (trpA and trpB) encoding the α- and β-subunits of the tryptophan synthase from bacterium Salmonella enterica serovar typhimurium cloned in the pEBA-10 expression vector22. Use pEBA-10 vector as a DNA template.\n\t\tNOTE: Alternatively, the listed primers below can be used to amplify both genes from the Salmonella enterica serovar typhimurium genome. All molecular biology steps were followed as described in Molecular Cloning: A Laboratory Manual23.\nUse polymerase chain reaction (PCR) to amplify individually the full-length polynucleotide sequence of the α-subunit (αStTS) with primers αStTS-FW-Bam and αStTS-Rev-Eco and the full-length sequence of β-subunit (βStTS) with primers βStTS-FW-Bam and βStTS-Rev-Hind. Use a melting temperature of approximately 55 °C and a polymerase extension time of 2 min.\n\t\t\nUse high-fidelity DNA polymerase (e.g., Phusion) and the manufacturer’s protocol to amplify the DNA sequences. For a 50 µL PCR reaction add 34 µL of nuclease-free water, 10 µL of 5x reaction buffer, 1 µL of 10 mM dNTPs, 1 µL of 10 µM forward primer, 1 µL of 10 µM reverse primer, 1 µL of Template DNA (200 ng), 1.5 µL of DMSO, 0.5 µL of Phusion DNA polymerase.\nFor the PCR program, use a hot start (180 seconds at 98 °C) followed by 30 amplification cycles (30 seconds at 98 °C, 30 seconds at 55 °C and 120 seconds at 72 °C), and a final extension (300 seconds at 72 °C).\n\t\t\tNOTE: The italicized sequences correspond to the BamHI, EcoRI, BamHI and HindIII restriction sites, respectively. Enzyme cleavage efficiency close to the termini of PCR fragments were enhanced by adding extra bases (lowercase sequences).\nαStTS-FW-Bam: 5′-cgcGGATCCATGGAACGCTACGAAAA-3′\nαStTS-Rev-Eco: 5′-ccgGAATTCTTATGCGCGGCTGGC-3′\n\t\t\tβStTS-FW-Bam: 5′-cgcGGATCCATGACAACACTTCTCAAC-3′\n\t\t\tβStTS-Rev-Hind: 5′-cccAAGCTTTCAGATTTCCCCTC-3′",
    "Load PCR product on 0.8% agarose gel in 1x TAE buffer (40 mM Tris, 20 mM acetic acid and 1 mM EDTA) at 6 V/cm, gel extract the DNA band of interest, and gel purify the PCR fragment using a silica bead kit following the instructions from the manufacturer.\n\t\t\nDigest at least 200 ng of each DNA fragment with appropriate restriction enzymes and conditions recommended by the manufacturer for 2 hours at 37 °C.\nTo set up a 50 μL restriction digestion reaction add 34 µL of nuclease-free water, 10 µL of DNA (200 ng), 5 μL of 10x reaction buffer, 0.5 µL of restriction enzyme 1, and 0.5 µL of restriction enzyme 2.\nLoad the digestion product on 0.8% agarose gel on 1x TAE at 6 V/cm, gel extract, and gel purify the digested fragment using a commercial kit.\nSubclone individually each fragment into the E. coli expression modified vector pET SUMO, previously digested with appropriate enzymes and gel purified.\n\t\tNOTE: This vector is a modified version of the commercial pET SUMO. This vector has been optimized for restriction enzyme cloning. The multi cloning site (MCS) of pET28b vector (BamHI, EcoRI, SacI, SalI, HindIII, NotI, and XhoI) was inserted in the pET SUMO cloning site. This vector contains an N-terminal 6x-Histidine tag in frame with the Small Ubiquitin-like Modifier protein (SUMO) and multiple cloning sites.\nLigate 100 ng of modified pET SUMO and 50 ng of PCR fragment with T4 DNA ligase for 2 hours at 25 °C.\nTransform the constructed plasmid into competent cells of E. coli strain DH10Bα cells. Plate cells on LB agar plates containing 35 μg/mL kanamycin. Incubate the plate inverted overnight at 37 °C.",
    "Select a single colony from each transformation, prepare ultra-pure plasmid DNA, and perform DNA sequencing to verify that αStTS or βStTS were cloned in frame with the N-terminal His6-SUMO tag.\n\t\tNOTE: Prepare glycerol stocks of cell culture (turn cell suspension in 16% final concentration of sterile glycerol) and store them long-term at -80 °C.\nTransform the expression plasmid SUMO-αStTS or SUMO-βStTS individually into competent cells of E. coli expression strain Rosetta (DE3) pLysS with a T7 promoter-based system. Plate the recombinant cells on Luria Bertani (LB) agar plates containing 35 μg/mL kanamycin and chloramphenicol. Incubate the plate inverted overnight at 37 °C.\nAfter successful colony formation, pick one single colony (without any satellite colonies) and disperse it in 5 mL of LB medium with both antibiotics. Culture cells overnight with shaking at 200 rpm at 37 °C.\n\t\tNOTE: Prepare glycerol stocks of cell culture, store long-term at -80 °C or use immediately for recombinant protein expression.\nExpression of the SUMO-αStTS and SUMO-βStTS subunits\n\t\nInoculate fresh E. coli strain Rosetta (DE3) pLysS cells harboring SUMO-αStTS or SUMO-βStTS constructs or scrape some of the frozen glycerol stock into a 50 mL culture of LB containing 35 μg/mL kanamycin and chloramphenicol. Grow cells overnight with shaking at 200 rpm at 37 °C.\nNext morning, inoculate 5 mL of the overnight cell culture in a fresh and sterile 2x 1000 mL of LB containing 2% glycerol plus kanamycin and chloramphenicol (2.8 L Fernbach flask). Grow cell culture with shaking at 200 rpm at 37 °C.\n\t\tNOTE: The expression of SUMO-αStTS or SUMO-βStTS in LB broth yields 125-150 mg of tagged protein per liter. Consider scaling protocol up or down to fulfil specific demands.",
    "Induce recombinant protein expression when the OD600 reaches 0.6-0.8 by addition of isopropyl β-D-1 thiogalactopyranoside (IPTG) at a final concentration of 0.4 mM followed by incubation at 30 °C overnight with shaking at 200 rpm.\nHarvest the cells by centrifuging at 4,000 x g at 4 °C for 20 min. Remove the supernatant and re-suspend the cell pellets with cold lysis buffer 1 (50 mM Tris-Cl, pH 8.0, containing 500 mM NaCl, 5% glycerol, 10 mM 2-mercaptoethanol, and 40 mM imidazole-Cl) to a final volume of 60 mL.\n\t\tNOTE: Cells can be stored long-term at -80 °C or used immediately for protein purification. To store cells, split the cell suspension into 2 x 50 mL disposable centrifuge conical tubes and keep cell pellets at -80 °C until the protein purification step.\nPurification of the α- and β-subunits of tryptophan synthase\n\tNOTE: All procedures are to be conducted at 4 °C unless otherwise stated. To reduce purification time, equilibrate Ni-NTA agarose nickel-charged affinity columns and size exclusion column in buffer prior to protein purification or during recombinant protein expression.\n\t\nDisrupt cell pellet by sonication using a digital sonifier with 1/2\" Horn probe (or a similar equipment). Perform 20 cycles at 80% amplitude duty cycle on ice water bath using 10 s pulse and 20 s rest or until complete cell disruption.\nCentrifuge the cell lysate at 30,000 x g for 30 min. Aspirate supernatant, ensuring the pellet does not dislodge from tube. Filter the supernatant with a 0.45 μm filter unit on ice and flow it through a 15 mL Ni-NTA agarose nickel-charged affinity column pre-equilibrated in lysis buffer 1.",
    "NOTE: Each Ni-NTA agarose column will be used to purify either SUMO-αStTS or SUMO-βStTS recombinant protein. Purification can be performed in a 2x 5 mL Ni-NiTA column attached to a fast protein liquid chromatography system. Purify one protein at a time.\nWash Ni-NTA agarose column in 100 mL of lysis buffer 1.\nProceed with an 80 mL one-step elution with buffer E1 (25 mM Tris-Cl buffer, pH 7.8, containing 200 mM NaCl, 5% glycerol, and 400 mM imidazole-Cl).\n\t\tNOTE: SUMO-protease tolerates up to 300 mM imidazole and the membrane of centrifugal filter devices tolerates up to 100 mM imidazole. We recommend performing an ammonium sulfate precipitation to remove high amounts of imidazole and decrease the purification time instead dilute the protein sample and waste time with protein concentration.\nAssess the initial volume of the supernatant fraction. Slowly add small amounts of ammonium sulfate at a time, until a 60% saturation (39.48 g/ 100 mL) at 25 °C is reached. Gently stir the solution for 30 min and avoid bubbles. Centrifuge at 10,000 x g for 15 min.\nAspirate and discard the supernatant fraction carefully. Resuspend the pellet fraction in 20 mL of sample buffer (20 mM Tris-Cl, pH 8.0, 300 mM NaCl and 5% glycerol).\nFor His-SUMO-tag cleavage with SUMO-protease, add the recombinant fragment of Ubl-specific protease 1 from Saccharomyces cerevisiae in a 1:1000 ratio and incubate the mixture for 2 hours at 4 °C.\nCentrifuge the digestion product at 10,000 x g in 25 °C for 20 min to remove protein aggregates prior to load the sample through an affinity chromatography column.\nRemove traces of His6-SUMO tag passing the 20 mL resuspended sample on a 15 mL Ni-NTA agarose column, previously equilibrated in lysis buffer 1.\nCollect the pass-through sample containing the non-tagged αStTS or βStTS.",
    "Wash the Ni-NTA column in 20 mL of buffer 1 to collect leftovers of non-tagged αStTS or βStTS.\nConcentrate each subunit separately with a 15 mL 10 kDa cutoff centrifugal filter unit by spinning at 3,000 x g at 4 °C. Transfer the concentrated protein to a fresh 2.0 mL tube and microcentrifuge (10,000 x g, 10 min, 4 °C) to remove aggregates. Determine protein concentration24, prepare 1 mL aliquots at 20-25 mg mL-1, label, flash-freeze in liquid nitrogen, and store them at -80 °C.\n\t\tNOTE: Pre-purified protein samples can be stored long-term at -80 °C or used immediately for protein purification on a size exclusion chromatography column (SEC).\nTake a protein aliquot (20 mg) and microcentrifuge at 10,000 x g for 10 min to remove aggregates prior SEC.\nLoad sample on a size exclusion chromatography column (e.g., HiPrep 16/60 Sephacryl S-200 HR) attached to a fast protein liquid chromatography at a flow rate of 0.5 mL min-1, previously equilibrated in SEC buffer (10 mM Tris-Cl, pH 7.8, 100 mM NaCl, 5% glycerol, 0.1 mM pyridoxal phosphate).\n\t\tNOTE: To purify higher amounts of isolated αStTS or βStTS subunit and decrease the number of SEC rounds, load a 5 mL sample at 20-25 mg mL-1 on a size exclusion chromatography column at a flow rate of 1.5 mL min-1.\nAssess the quality of αStTS or βStTS in the peak fraction using a 12% or a 15% sodium dodecyl sulfate-gel electrophoresis (SDS-PAGE), respectively, stained with Coomassie brilliant blue stain25.\nConcentrate protein with fresh 15 mL 10 kDa cutoff centrifugal filter units, determine protein concentration24, prepare 0.5 mL aliquots at 20-25 mg mL-1, label, flash-freeze in liquid nitrogen, and store them at -80 °C.\nPurification of the α2β2 StTS complex from the α- and β-subunits",
    "NOTE: Equilibrate the size exclusion chromatography column (Sephadex S-200 HR or Superdex 200 pg) in SEC buffer (10 mM Tris-Cl, pH 7.8, 100 mM NaCl, 5% glycerol, 0.1 mM pyridoxal phosphate).\n\t\nTo purify the wild-type α2β2 StTS complex from the α- and β-subunits, thaw concentrate samples of αStTS and βStTS subunits at 4 °C.\nCombine aliquots (1.2 αStTS: 1.0 βStTS molar ratio) and incubated at 4 °C for 1 h.\n\t\tNOTE: Excess of αStTS is necessary to ensure that most of βStTS will be incorporated into the α2β2 StTS complex.\nRemove protein aggregates by microcentrifugation (10,000 x g, 10 min, 4 °C).\nLoad the clarified supernatant onto the size exclusion column.\nAssess the quality of αStTS or βStTS in the peak fraction using a 12% or a 15% sodium dodecyl sulfate-gel electrophoresis (SDS-PAGE), respectively, stained with Coomassie brilliant blue stain25.\nDetermine protein concentration24, prepare 250-1000 μL aliquots at 15-20 mg mL-1, flash-freeze in liquid nitrogen, and store at -80 °C.\n2. Purification of the wild type or mutant form of the α2β2 StTS complex\nSite-directed mutagenesis to prepare mutant βStTS\nUse construct pEBA-10 expression vector22 as the DNA template during two-steps of polymerase chain reaction to introduce specific point-mutations in the β-chain TS polynucleotide sequence.\n\t\tNOTE: This protocol can be used to introduce a single point mutation in either α-or β-subunit from Salmonella typhimurium tryptophan synthase. For additional, new oligonucleotide primers containing the desirable mutation must be appropriately designed. In this work, mutations βQ114A, βK167T, βS377A are listed.\nPerform PCR reactions using pairs of nucleotide primers TS-FW-NcoI/Q114A-Rev, TS-FW-NcoI/K167T-Rev, and TS-FW-NcoI/S377A-Rev to generate fragments A1, B1, and C1, respectively.\n\t\tNOTE: Oligonucleotide TS-NcoI-FW and TS-SacI-Rev, respectively, anneals upstream and downstream of the αβ StTS polynucleotide sequence cloned in the pEBA-10 vector.",
    "Use high-fidelity DNA polymerase (e.g., Phusion) and the manufacturer’s protocol to amplify the DNA sequences. For a 50 µL PCR reaction, add 34 µL of nuclease-free water, 10 µL of 5x reaction buffer, 1 µL of 10 mM dNTPs, 1 µL of 10 µM forward primer, 1 µL of 10 µM reverse primer, 1 µL of Template DNA (200 ng), 1.5 µL of DMSO, 0.5 µL of DNA polymerase.\nFor the PCR program, use a hot start (180 seconds at 98 °C) followed by 30 amplification cycles (30 seconds at 98 °C, 30 seconds at 55 °C and 120 seconds at 72 °C), and a final extension (300 seconds at 72°C).\n\t\t\tNOTE: All molecular biology steps were followed as described in Molecular Cloning: A Laboratory Manual23. While a lowercase sequence corresponds to a restriction site, a bold and italic sequence corresponds to a mutation.\n\t\t\tTS-FW-NcoI: 5’-CAA TTT CAC ACA GGA AAC AGA cca tgg-3’\n\t\t\tQ114A-Rev: 5’-C AGA GGC GAC GCC GTG CGC ACC GGC GCC GGT TTC-3’\n\t\t\tK167T-Rev: 5’-CTC GTT ACA GGC ATC TGT TAG CGT AGC GGA GCC-3’\n\t\t\tS377A-Rev: 5’-C TTT ATC TCC GCG GCC AGC GAG ATT GAC CAC CAG-3’\nPerform PCR reactions using pairs of nucleotide primers TS-Rev-SacI/Q114A-FF, TS-Rev-SacI/K167T-FF, and TS-Rev-SacI/S377A-FF to generate fragments A2, B2, and C2, respectively.\n\t\tTS-Rev-SacI (5’-TTA tgc gcg GCT GGC GGC TTT CAT GGC TGA G-3’\n\t\tQ114A-FF 5’-GAA ACC GGC GCC GGT GCG CAC GGC GTC GCC TCT G-3’\n\t\tK167T-FF 5’-GGC TCC GCT ACG CTA ACA GAT GCC TGT AAC GAG-3’\n\t\tS377A-FF 5’-CTG GTG GTC AAT CTC GCT GGC CGC GGA GAT AAA G-3’\nUse polymerase chain reaction to individually amplify the partial fragments. Use a melting temperature of 55 °C and a polymerase extension time of 2 min.",
    "To perform the second round of PCR reactions, load the PCR product above on 0.8% agarose gel on 1x TAE at 6 V/cm and gel extract and gel purify the fragments of interest.\n\t\t\nMix fragments A1/A2, B1/B2, and C1/C2 separately in equimolar amounts, heat denature the mixture for 10 min at 96 °C, and anneal at 25 °C. Extend the recombinant strands with a high-fidelity polymerase and deoxyribonucleotides according to the manufacturer’s protocol.\nTo generate a high copy number of the full-length mutant DNA fragment, add oligo primers TS-FW-NcoI and TS-Rev-SacI to perform a second PCR.\nLoad PCR product on 0.8% agarose in 1x TAE buffer at 6 V/cm, gel extract the DNA band of interest, gel purify the PCR fragment, and proceed with appropriate restriction digestion for 2 hours at 37 °C following the appropriate buffer and conditions recommended by the manufacturer.\n\t\t\nDigest at least 200 ng of each DNA fragment with appropriate restriction enzymes and conditions recommended by the manufacturer for 2 hours at 37 °C. To set up a 50 μL restriction digestion reaction add 34 µL of nuclease-free water, 10 µL of DNA (200 ng), 5 μL of 10x reaction buffer, 0.5 µL of restriction enzyme 1, and 0.5 µL of restriction enzyme 2. Load digestion product on 0.8% agarose in 1x TAE buffer at 6 V/cm and purify the digested PCR fragment.\nDigest 200 ng of pEBA-10 construct with restriction enzymes NcoI and SacI following the manufacturer’s recommendation. Load the digestion product on 0.8% agarose gel in 1x TAE buffer at 6 V/cm, excise the band correspondent to the vector, and gel purify the digested vector.",
    "Ligate 100 ng of vector with 50 ng of PCR fragment, previously digested and purified, with T4 DNA ligase for 2 hours at 25 °C. Transform the constructed plasmid into competent cells E. coli strain DH10B cells. Plate cells on LB agar plates containing 50 μg/mL ampicillin. Incubate the plate inverted overnight at 37 °C.\nPick a single colony (without any satellite colonies) from each cell transformation and disperse it in 5 mL of LB medium containing ampicillin. Grow cells overnight with shaking at 200 rpm at 37 °C. Prepare 10 μg of ultra-pure plasmid DNA from each engineered construct. Prepare glycerol stocks of cell culture (turn cell suspension in 16% final concentration of sterile glycerol) and store long-term at -80 °C.\nPerform DNA sequencing to confirm the full-length sequence encoding the α- and β-subunits of tryptophan synthase. Confirm each individual single mutation and discard any plasmid construct containing undesirable random mutation. The oligonucleotide primers used in this study are listed below.\n\t\tTS-1F: 5’-ATGACAACACTTCTCAAC-3’\n\t\tTS-1R: 5’-GAAATGCCAGAACATTAC-3’\n\t\tTS-2F: 5’-CAGTCGCCGAACGTC-3’\n\t\tTS-3F: 5’-GATGATGCAAACAGC-3’\n\t\tTS-4F: 5’-CTGGCATTGAACAGTC-3’\n\t\tTS-5F: 5’-CGTTGCATCATCTCATTG-3’\n\t\tNOTE: Oligonucleotide primers TS-1F, TS-1R, TS-2F, and TS-3F anneal on the polynucleotide sequence of the β-subunit (GenBank accession code: CP051286.1). Primers TS-4F and TS-5F anneal on the polynucleotide sequence of the α-subunit (GenBank accession code: CP053865.1).\nUse 200 ng of each plasmid construct (pEBA-10-βQ114A, pEBA-10-βK167T, and pEBA-10-βS377A) to transform competent cells of E. coli expression strain CB149, lacking the trp operon26. After successful colony formation, pick one single colony and grow the cells in 5 mL of LB medium containing 50 μg/mL ampicillin. Culture in the bacterial incubator at 37 °C overnight. Prepare glycerol stocks of cell culture, store long-term at -80 °C or use immediately for recombinant protein expression.",
    "NOTE: A single a single point mutation in either α-or β-subunit from Salmonella typhimurium tryptophan synthase may impair enzyme function or lower synthesis of L-Tryptophan in E. coli strain CB149. Please consider using either E. coli strain BL21(DE)pLys-S or Rosetta (DE3)pLys-S if no expression or lower amounts of recombinant α2β2 StTS complex is detected in a SDS-PAGE gel.\nExpression of wild type and mutant form of α2β2 StTS complex in E. coli\nGrow E. coli expression strain harboring the desirable construct in a fresh and sterile 50 mL of LB medium containing 50 μg/mL ampicillin. Grow cells overnight with shaking at 200 rpm at 37 °C.\nAdd 5 mL of the overnight cell culture in a fresh and sterile 2x 1000 mL of LB containing 2% glycerol plus ampicillin (2.8 L Fernbach flask). Grow cell culture with shaking at 200 rpm at 37 °C.\nInduce recombinant protein expression when the OD600 reaches 0.6-0.8 by addition of IPTG at a final concentration of 0.4 mM followed by incubation at 30 °C overnight with shaking at 200 rpm.\nHarvest the cells by centrifuging at 4,000 x g in 4 °C for 20 min. Remove the supernatant and re-suspend the cell pellets with cold lysis buffer 2 (50 mM Tris-Cl, pH 7.80, containing 100 mM NaCl, 5 mM dithiothreitol, 1 mM EDTA, and 1 mM PMSF) to a final volume of 50 mL buffer.",
    "NOTE: Cells can be stored long-term at -80 °C or used immediately for protein purification. To store cells, split the cell suspension into 2 x 50 mL disposable centrifuge conical tubes and keep cell pellets at -80 °C until the protein purification step. The expression of mutant and wild type form of α2β2 StTS complex in LB broth yields 125-150 mg of protein per liter. Consider scaling protocol up or down to fulfill specific demands.\nPurification of wild type or mutant form of α2β2 StTS complex\n\tNOTE: The following protocol is intended to purify the non-tagged recombinant wild type or mutant form of the recombinant α2β2 StTS complex within 1 day, depending on skill set and efforts. To reduce purification time, equilibrate size exclusion column in buffer prior protein purification/expression. Purification of wild type or mutant α2β2 StTS complex is carried out by a two-step purification comprising ammonium sulfate fractionation and a size exclusion chromatography. This protocol yields 60-100 mg of pure complex from 1 L of LB medium.\n\t\nDisrupt cell pellet by sonication using a digital sonifier with 1/2\" Horn probe (or a similar equipment). Perform 20 cycles at 80% amplitude duty cycle on ice water bath using 10 s pulse and 20 s rest or until complete cell disruption.\nCentrifuge the cell lysate at 30,000 x g for 30 min at 25 °C. Aspirate supernatant, ensuring the pellet does not dislodge from tube. Filter the clarified supernatant fraction with a 0.45 μm filter at room temperature.\nAssess the initial volume of the clarified supernatant fraction. Slowly add small amounts of ammonium sulfate at a time, until a 20% saturation is reached (11.51 g / 100 mL). Carry out ammonium sulfate fractionation out at 25 °C. Gently stir the solution for 10 min and avoid bubbles.",
    "Centrifuge at 30,000 x g for 10 min at 25 °C. Transfer the 20% supernatant fraction into a clean flask. Gently resuspend 20% pellet fraction in 20 mL of sample buffer 2 (50 mM Tris-Cl, pH 7.80, containing 100 mM NaCl, 1 mM EDTA, and 2 mM dithiothreitol) and prepare a sample to run SDS-PAGE gel. Discard the 20% pellet fraction.\nAssess the initial volume of the 20% supernatant fraction. Add ammonium sulfate to 30% saturation is reached (5.94 g / 100 mL), stir solution, avoid bubbles, and centrifuge as before. Transfer the 30% supernatant fraction into a clean flask. Gently resuspend 30% pellet fraction in 20 mL of sample buffer 2 and prepare a sample to run SDS-PAGE gel. Discard the 30% pellet fraction.\nAssess the initial volume of the 30% supernatant fraction. Add ammonium sulfate at a 40% saturation is reached (6.14 g / 100 mL), stir solution, avoid bubbles, and centrifuge as before. Transfer the 40% supernatant fraction into a clean flask. Gently resuspend 40% pellet fraction in 10 mL of sample buffer 2 and prepare a sample to run SDS-PAGE gel. Discard the 40% supernatant fraction.\n\t\tNOTE: Assess the quality of αβStTS complex using samples of the 30% and 40% supernatant and pellet fractions in a 12% SDS-PAGE gel25. If you verify that any other mutant αβStTS complex is in the 40% supernatant fraction, proceed with  a 60% saturation of ammonium sulfate (13.0 g / 100 mL). Pre-purified protein aliquots of the pre-purified α2β2 StTS complex can be stored long-term at -80 °C or used immediately for protein purification on a size exclusion chromatography column (SEC).",
    "Microcentrifuge the protein sample at 10,000 x g, 20 min, 4 °C and load the supernatant fraction on a HiPrep 16/60 Sephacryl S-200 HR column attached to a fast protein liquid chromatography at a flow rate of 0.5 mL min-1, previously equilibrated in SEC buffer (10 mM Tris-Cl, pH 7.8, 100 mM NaCl, 5% glycerol, 0.1 mM pyridoxal phosphate).\n\t\tNOTE: To purify large amounts of complex, load a 5 mL sample at 20-25 mg mL-1 on a HiLoad 26/600 Superdex 200 pg column at a flow rate of 1.5 mL min-1.\nAssess samples collected along the ammonium sulfate fractionation and peak fractions from the SEC column on a 12% SDS-PAGE gel stained with Coomassie brilliant blue stain25.\nConcentrate the wild type or mutant α2β2 StTS complex with a 15 mL 100 kDa cutoff centrifugal filter unit by spinning at 3,000 x g at 4 °C. Transfer the concentrated protein to a fresh 2.0 mL tube and microcentrifuge (10,000 x g, 10 min, 4 °C) to remove aggregates.\nDetermine protein concentration24, prepare 0.5 mL aliquots at 20-25 mg mL-1, label, flash-freeze in liquid nitrogen, and store them at -80 °C.\n3. Optimized crystallization for wild type and mutant form of the α2β2 StTS complex\nNOTE: The initial crystallization condition for the α2β2 StTS complex was previously reported in conditions containing 12% PEG 8,000 and 2 mM spermine22.\nPrepare stock solutions prior to the crystallization assays to achieve a better crystallization reproducibility. To perform structural studies with TS, crystallize protein with Na+ or Cs+ ion at the metal coordination site of the bienzyme complex.\n\t\nPrepare 5 mL stock solution of 200 mM spermine in water and keep 500 µL aliquots at -20 °C.",
    "Prepare 50 mL stock solution of 30% (w/v) PEG 8000 in water and keep 25 mL aliquots in a 50 mL disposable centrifuge conical flasks at 25 °C.\nPrepare a 25 mL stock solution of 1 M CsCl in water and keep at 25 °C.\nPrepare 25 mL stock solution of 1 M NaCl in water and keep at 25 °C.\nPrepare 3x 50 mL stock solution of 1 M bicine and titrate with CsOH or NaOH to obtain buffered solutions at pH 7.6, 7.8, and 8.0. Keep 25 mL aliquots at 4 °C.\nThaw a sample of α2β2 StTS complex (20-25 mg mL-1) on an ice bath.\nMicrocentrifuge sample at 10,000 x g for 10 min at 25 °C to remove protein aggregates.\nTransfer the cleared supernatant fraction into a clean microcentrifuge tube.\nEstimated protein concentration24 and dilute protein aliquots (150-200 µL) at 15 mg mL-1 with 50 mM bicine-CsOH or -NaOH, pH 7.8 containing 50 mM CsCl or NaCl. Keep protein sample at 25 °C.\nPrepare the 500 µL reservoir solutions for 3x 24-well sitting drop plates in sterile 1.5 mL labeled microcentrifuge tubes. The reservoir solution contains 50 mM bicine-CsOH or -NaOH, 50 mM CsCl or NaCl, and PEG 8000. Vary the concentration of PEG 8000 (6-11%) on the plate columns and the concentration of spermine (2-8 mM) on the plate rows. Change buffer pH (pH 7.6, 7.8 and 8.0) for each set.\nCap the tubes and vortex vigorously at least 10 sec. Centrifuge tubes at 10,000 x g for 10 min at 25 °C to remove bubbles. Dispense 500 µL buffered solution in each labeled reservoir.",
    "Use a P-10 micropipette and dispense 5 µL of protein solution at 15 mg mL-1 per each sitting drop well. Avoid bubbles. Add 5 µL of each correspondent reservoir solution to the protein drop. Avoid bubbles during mixing and do not pipette up and down to homogenize the mixture.\nTape the plate with a transparent adhesive tape and store the plate at 25 °C. Crystals appear in 2-5 days and grow to their full dimensions within two weeks.\n4. X-ray diffraction data collection and α2β2 StTS complex structure solution\nNOTE: Prior to X-ray diffraction data collection, prepare cryoprotectant solution for each crystal in advance. Use the specific reservoir solution to prepare 3 aliquots containing increasing concentrations of dimethyl sulfoxide in solution (10, 20, and 30% v/v) and specific ligand (s). Dimethyl sulfoxide was found to be a better cryoprotectant than glycerol, ethylene glycol, and PEG 200-300.\nHarvest a large single crystal using a cryoloop under the stereoscopic microscope.\nPipette 2 μL of each cryoprotectant solution containing the precipitation solution plus higher concentrations of dimethyl sulfoxide and ligand (s) onto a new cover slide.\nSequentially, soak crystal in each drop and let the crystal equilibrate for 30 s in the cryoprotectant solution.\nFlash-cooling the cryoprotected crystal using a gaseous nitrogen stream at -173 °C (100 K) or immerse in liquid nitrogen for long-term storage in pucks.\n\tNOTE: Fill a foam Dewar with liquid nitrogen, pre-cool a crystal puck, store crystals in the cryogenic storage Dewar, and ship crystals to the synchrotron using a dry shipper.\nProceed with X-ray diffraction data collection at -173 °C. Record X-ray diffraction data using a 0.5-4.0 s exposure time and 0.5° oscillations. Rotate crystal 180-360°.",
    "Process the X-ray diffraction images with iMosflm27 to generate reflection file in the appropriate space group. Generally, α2β2 StTS crystals belong to the space group C 121 (C2).\nScale together multiple observations of reflections with Scala28, implemented in the CCP4 package29.\nSolve the structure of the high-resolution α2β2 StTS complex by molecular replacement using MolRep30 and an appropriate search model. Inspect the model and the electron density map in Coot31 after a successful structure solution.\n\tNOTE: There are many TS crystals structures deposited in the Protein Data Bank with different ligand (s). For a better molecular replacement step and decreased time fitting the newer crystal structure, use the best search model containing ligand (s) of interest. Proceed with crystal structure refinement in CCP429,30 or Phenix31.\nMake manual adjustments to the model using Coot32, followed by automatically refinement with Refmac29,33 or phenix.refine31,34. Build and refine the final model by running iterative rounds of model building in Coot32 and automated refinement.\nProceed with coordinate and structure factors deposition in the Protein Data Bank web site.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}