{
  "id": 3601,
  "origin_website": "Cell",
  "title": "Protocol for quantitative proteomic analysis of heterogeneous adipose tissue-residing progenitor subpopulations in mice",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nIsolation of stromal vascular fraction cells from gonadal and inguinal white adipose tissue\nTiming: 2.5 h\nDissect gonadal and inguinal WAT from 6‒8-week-old male mice and place isolated fat depots in ice-cold 1x DPBS solution.\nNote: Dissected WAT depots can be placed in the cold DPBS for a few hours prior to the following steps.\nCombine isolated fat depots (2–4 depots from 1‒2 mice recommended) and mince the tissue in a 10 mL beaker containing 200 μL digestion buffer using spring scissors.\nNote: The depots should be minced completely and chopped into pieces less than 1 mm diameter.\nTransfer the minced tissue to a new 50 mL centrifuge tube containing 10 mL digestion buffer.\nIncubate at 37°C in a water bath for around 1 h (gonadal WAT) or 1.5 h (inguinal WAT) with shaking (100 rpm).\nNote: Vortex the tube gently every 15 min during the digestion. WAT tissue is sufficiently digested when there is no apparent tissue debris and the digested tissue reaches a “soup-like” consistency (Figure 1[href=https://www.wicell.org#fig1]B).\nAfter incubation, filter the digested tissue through a 100 μm cell strainer to remove undigested tissue.\nNote: Well-digested tissue samples contain little residual material on the filters.\nDilute filtered samples to 30 mL with flow buffer, and centrifuge at 600 × g for 5 min at 4°C.\nAspirate the supernatant which contains floating mature adipocytes and keep the pellet which contains SVF cells.\nProceed immediately to Fluorescence Activated Cell Sorting (FACS) steps.\nIsolation of adipose PDGFRβ+ subpopulations using FACS\nTiming: 3 h\nDissolve the pellet in 1 mL of 1x RBC lysis buffer by shaking the tube gently.\nIncubate at room temperature (RT) for 1 min.\nNote: Prolonged incubation may reduce the viability of the cells.",
    "Add 10 mL of flow buffer to stop the lysis and filter the cell mixture through a 40 μm cell strainer into another new 50 mL centrifuge tube.\nCentrifuge the cell mixture at 600 × g for 5 min at 4°C.\nAspirate supernatant and resuspend the pellet in flow buffer. Adjust the cell concentration to around 106 cells per mL (400–800 μL per sample in total).\nAdd Fc block (1:200) Incubate at 4°C for 10 min. Centrifuge the cell mixture at 600 × g for 5 min at 4°C.\nResuspend the pellet by gentle pipetting in the flow buffer and transfer 400–800 μL a new 1.5 mL tube for the further flow antibody incubation as follows.\nPrepare control tubes for i, unstained cells, ii, single-color controls, and iii, fluorescence minus one (FMO) controls, respectively.\nFor gonadal WAT SVF cells staining, the cells were incubated with the following flow antibodies and dilutions: anti-CD45 (1:400), anti-CD31 (1:400), anti-CD140b (PDGFRβ) (1:100), anti-LY6C (1:400), anti-CD9 (1:200).\nFor inguinal WAT SVF cell staining, the cells were incubated with the following flow antibodies and dilutions: anti-CD45 (1:400), anti-CD31 (1:400), anti-CD140b (PDGFRβ) (1:100) and anti-DPP4 (1:200).\nIncubate at 4°C for 15 min and all the tubes should be protected from light.\nOptional: It is advisable that the tubes are placed on a shaking platform or shaken by hand every 5 min during the incubation.\nPellet by centrifugation at 600 × g for 5 min at 4°C.\nAspirate buffer and resuspend cells in 400 μL of flow buffer.\nPellet by centrifugation at 600 × g for 5 min at 4°C.\nAspirate buffer and resuspend pellets in 400 μL of flow buffer.\nPass through 40 μm filter caps into 5 mL round bottom polystyrene FACS tubes.\nTake the following steps for FACS gating strategies.",
    "Use unstained and single-color controls for fluorescence compensation.\nUse FMO controls to set experimental gates.\nUse the gating strategy shown in Figure 2[href=https://www.wicell.org#fig2]A to obtain adipocyte precursor cells (APCs) and fibro-inflammatory progenitors (FIPs) within gonadal WAT SVF cells.5[href=https://www.wicell.org#bib5] Gate APCs as CD45- CD31- CD140b+ LY6C- CD9- and FIPs as CD45- CD31- CD140b+ LY6C + cells.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3168-Fig2.jpg\nFigure 2. Isolation of PDGFRβ+ stromal cell subpopulations from gonadal and inguinal white adipose tissue by FACS\n(A) Representative FACS collection gates for isolating FIPs and APCs from SVFs of gonadal WAT.\n(B) Representative FACS collection gates for isolating DPP4+ and DPP4- APCs from SVFs of inguinal WAT.\nNote: CD45 is a common marker for hematopoietic immune cells and CD31 is the marker for endothelial cells. CD140b is used to label the PDGFRβ+ cells. Therefore, FIPs were sorted from CD45-CD31-PDGFRRβ+ cells with additional maker LY6C+ and APCs were defined as CD45-CD31-PDGFRRβ+LY6C-CD9-. Details for subpopulation gating are described in Figure 2[href=https://www.wicell.org#fig2]A.\nUse the gating strategy shown in Figure 2[href=https://www.wicell.org#fig2]B to obtain DPP4+ and DPP4- APCs within inguinal WAT SVF cells.13[href=https://www.wicell.org#bib13],15[href=https://www.wicell.org#bib15] Gate DPP4+ APCs as CD45- CD31- CD140b+ DPP4+ and DPP4- APCs as CD45- CD31- CD140b+ DPP4-.\nNote: CD45 is a common marker for hematopoietic immune cells and CD31 is the marker for endothelial cells. CD140b is used to label the PDGFRβ+ cells. Therefore, DPP4+ APCs were sorted from CD45-CD31-PDGFRRβ+ cells with additional maker DPP4+ and DPP4- APCs were defined as CD45-CD31-PDGFRRβ+DPP4-. Details for subpopulation gating are described in Figure 2[href=https://www.wicell.org#fig2]B.\nCollect 105 sorted cells in each collection tube containing 200 μL flow buffer and keep sorted cells on ice.\nCentrifuge at 600 × g for 5 min at 4°C.",
    "Wash by resuspending cell pellets in ice-cold DPBS and centrifuge again at 600 × g for 5 min at 4°C. Discard the supernatant and keep the pellets.\nRepeat the wash 3 times. Keep the pelleted cells at ‒80°C until use.\nProtein extraction and mass spectrometry sample preparation\nTiming: 2 days\nCritical: Wear gloves, clean lab coat, face mask, and use clean plasticware and equipment to minimize any contamination from keratin.\nSamples are prepared for mass spectrometry following the Phase Transfer Surfactant (PTS) method,16[href=https://www.wicell.org#bib16],17[href=https://www.wicell.org#bib17] with modifications as follows:\nSuspend cell pellets (105 cells) in 15 μL PTS protein extraction buffer and sonicate for on ice using a Bioruptor water bath sonicator on high power with five 1-min on/1-min off cycles. Afterwards, adjust the volumes to 20 μL with PTS protein extraction buffer.\nDetermine the protein concentration of each sample using a Pierce BCA Protein Assay Kit, with the following adjustments:\nPrepare the working reagent (WR) solution by mixing 1000 μL reagent A with 20 μL reagent B. A 50:1 ratio of reagent A to reagent B is as per the manufacturer’s protocol, however, these volumes are smaller than the manufacturer’s protocol, because a smaller volume of sample is used for quantification.\nPrepare a series of albumin standards by diluting the supplied albumin standard (2000 μg/mL) with water at the following concentrations (μg/mL): 0; 125; 250; 500; 750; 1000; 1500; and 2000.\nAliquot 30 μL WR solution into 0.5 mL microcentrifuge tubes for the standards and samples.\nAdd 2 μL PTS protein extraction buffer to the tubes with WR solution for the standard reactions.\nAdd 2 μL water to the tubes with WR solution for the sample reactions.\nAdd either 2 μL standard or 2 μL sample to the appropriate tubes and mix.\nIncubate at 37°C for 30 min.",
    "Measure the absorbance of 2 μL of each reaction at 562 nm using a NanoDrop for determination of the protein concentration.\nAdjust the protein amounts and samples volumes in PTS protein extraction buffer, so that the volumes are 20 μL and the protein amounts are the same across samples with a protein amount up to 10 μg.\nAdd 2.5 μL 100 mM DL-dithiothreitol (DTT) to a final concentration of 11 mM DTT with incubation at 50°C for 30 min with shaking at 600 rpm in a ThermoMixer C to reduce cysteine-cysteine disulfide bonds.\nAdd 2.5 μL 400 mM iodoacetamide (IAA) to a final concentration of 40 mM IAA, followed with incubation in the dark for 30 min at room temperature to alkylate free thiol groups.\nAdd 4.0 μL 400 mM cysteine to a final concentration of 55 mM cysteine followed with incubation at RT for 10 min to quench the alkylation reactions.\nDilute the samples with 80.0 μL of 50 mM ammonium bicarbonate, i.e., a five-fold dilution of PTS buffer.\nAdd 200 ng lysyl endopeptidase (Lys-C), so the amount is at least 1:50 (w:w) enzyme:sample and mix.\nAdd 200 ng trypsin, so the amount is at least 1:50 (w:w) enzyme:sample, and mix.\nDigest the samples for 14 h overnight at 37°C with shaking at 600 rpm.\nAfter overnight digestion add 200 μL ethyl acetate. Mix the samples and spin them down.\nAdd 16.5 μL 10% (v/v) trifluoroacetic acid (TFA) to a final concentration of 0.5% (v/v) TFA to acidify the samples. Mix the samples vigorously for 5-min at RT.\nNote: The pH of the samples can be confirmed to be between 2 to 3 with 1–2 μL sample using pH indicator paper.",
    "Centrifuge the samples at 12,000 × g for 5 min at RT to separate the samples into two phases; an upper organic phase and lower aqueous phase.\nDiscard the upper phase containing detergent.\nDry the lower aqueous phase containing digested tryptic peptides using a centrifugal vacuum concentrator (miVac DUO Concentrator, -OH setting, without heating for about 1.5 h).\nDesalt the samples with ZipTip C18, 0.6 μL Pipette Tips:\nNote: According to manufacturer's instructions, the binding capacity of ZipTip C18, 0.6 μL pipette tips is typically ≤ 5.0 μg peptides.\nDissolve each tryptic peptide sample in 10 μL 0.1% (v/v) TFA, 3% (v/v) acetonitrile, 97% (v/v) water.\nCondition the ZipTip C18 with 3 washes of 10 μL 100% acetonitrile\nEquilibrate the ZipTip C18 with 3 washes of 10 μL 0.1% TFA.\nLoad the sample by slowly pipetting the sample up and down 10 times.\nDesalt the sample with 5 washes of 10 μL 0.1% (v/v) TFA, 3% (v/v) acetonitrile, 97% (v/v) water.\nElute the samples into clean tubes twice with 10 μL 0.1% (v/v) TFA, 50% (v/v) acetonitrile, 50% (v/v) water.\nVacuum dry the desalted peptides (miVac DUO Concentrator, -OH setting, without heating for about 30 min).\nNote: Other solid-phase extraction methods may be used in place of ZipTips, such as MonoSpin columns (GL Sciences, Japan), Pierce Peptide Desalting Spin Columns (Cat. No. 89851, Thermo Fisher), or StageTips,18[href=https://www.wicell.org#bib18] however, these should be tested beforehand since different types of membrane can affect peptide recovery.\nTo prepare samples for generation of a spectral library, a Pierce High pH Reversed-Phase (HPRP) Fractionation Kit can be used:",
    "Take an aliquot from each of the tryptic peptide samples and combine them so that the peptide amount is at least 10 μg. (We usually do this after the individual samples have been measured, as described below Vacuum dry the combined sample to evaporate organic solvent.\nDissolve the combined peptide sample with 300 μL 0.1% (v/v) TFA.\nUse the HPRP Fractionation Kit according to manufacturer’s instructions: Collect eight fractions in solution with increasing acetonitrile concentration from 5% (v/v) to 50% (v/v) mixed with 0.1% (v/v) triethylamine in water.\nAfterwards, dry all fractions with vacuum centrifugation (miVac DUO Concentrator, -OH setting, without heating for about 2.5 h).\nMass spectrometry measurement\nTiming: 3 h per sample\nLC-MS/MS measurements can be made using a Q Exactive Plus Orbitrap Mass Spectrometry System or other suitable equipment. At least three biological replicates for each sample type should be prepared and measured. The following description applies to a Q Exactive Plus Orbitrap Mass Spectrometer with a Nanospray Flex ion source and an EASY-nLC 1200 liquid chromatography system.\nConditions common to measurements with data-independent acquisition (DIA) and data-dependent acquisition (DDA):\nAn Acclaim PepMap 100 trap column with 3-μm C18 particles, inner diameter of 75-μm, and a filling length of 2-cm to concentrate and further desalt the tryptic peptides. Usually, we measure about 600 ng tryptic peptides per sample, although 400–1000 ng should generate data of sufficient quality and quantity.\nAn analytical column with 3-μm C18 particles, 75-μm inner diameter and 12-cm filling length (Nikkyo Technos, Co., Ltd., Japan).\nLC/MS grade solvents: LC solvent A consists of 0.1% (v/v) formic acid in water and LC solvent B consists of 0.1% (v/v) formic acid, 80% (v/v) acetonitrile in water.\nThe mass spectrometer ion transfer tube temperature is 250°C with 2.0 kV spray voltage.",
    "A flow rate of 300 nL/min is used with a 2-h gradient: 2% solvent B to 34% solvent B in 108 min, 34% solvent B to 95% solvent B in 2 min, with a final wash at 95% solvent B for 10 min, i.e., Gradient Information:\ntable:files/protocols_protocol_3168_4.csv\nNote: the length of gradient can be adjusted according to the sample, e.g., a shorter gradient can be used for less complex samples.\nFor DIA measurements:\nIf the tryptic peptides are prepared from ≤ 105 cells, then dissolve in about 10 μL of 0.1% (v/v) formic acid, 3% (v/v) acetonitrile, 97% (v/v) water with sonication for 1 min. The peptide concentrations can be quantified here using a Pierce Quantitative Colorimetric Peptide Assay Kit. The following is according to the manufacturer’s User Guide, but with the volumes scaled down to save precious samples:\nMix 250 μL Colorimetric Peptide Assay Reagent A, 240 μL Colorimetric Peptide Assay Reagent B, and 10 μL Colorimetric Peptide Assay Reagent C to make the working reagent (WR).\nPipette 18 μL WR into 0.5 mL microcentrifuge tubes for the standards and samples.\nPrepare a series of digest standards by diluting the supplied digest standard (1000 μg/mL) with water at the following concentrations (μg/mL): 0; 15.6; 31.3; 62.5; 125; 250; 500; and 1000.\nAdd 2 μL sample, 2 μL standard, or 2 μL water for the blank.\nIncubate at 37°C for 15 min.\nMeasure the absorbance of 2 μL of each reaction at 480 nm using a NanoDrop for determination of the peptide concentration.\nThe sample concentrations should be adjusted to a similar concentration. We usually inject 3 μL with 0.2 μg/μL sample for 600 ng peptide.",
    "Note: We have found that 400–1000 ng is a suitable range of peptide amount for DIA analysis using this protocol. The chromatograms should always be examined to make sure that the MS1 and MS2 TIC signal intensities are similar across samples, and the signal profile is similar. Also, software (e.g., Spectronaut) used to analyze the DIA data can apply normalization, and the graphs displaying the normalization should be checked. Also, since the sample volumes put in the MS vials are only around 8 μL, the volume should be checked to make sure that evaporation is not significant and additional solvent should be added as required.\nThe following MS parameters are applied:\nData are acquired with 1 full MS and 32 overlapping isolation windows constructed covering the precursor mass range of 400–1200 m/z.\nFor full MS, resolution is set to 70,000, AGC target is set to 5e6, and the maximum injection time (IT) is set to 120 ms.\nDIA segments are acquired at a resolution of 35,000 with an AGC target of 3e6 and an automatic maximum IT. The first mass is fixed at 150 m/z. HCD fragmentation is set to normalized collision energy of 27%.\nFor DDA measurements to generate a spectral library:\nIf about 10 μg tryptic peptides are fractionated with HPRP fractionation, dissolve each fraction in 7.0 μL of 0.1% (v/v) formic acid, 3% (v/v) acetonitrile, 97% (v/v) water and inject 5.0 μL for measurement. Alternatively, determine the peptide concentration with a Pierce Quantitative Colorimetric Peptide Assay Kit, and inject 600 ng peptides from each fraction for measurement.\nThe following MS parameters are applied:\nFull MS spectra are acquired from 380 to 1500 m/z at a resolution of 70,000, the AGC target of 3e6 and a maximum IT of 100 ms.",
    "MS2 scans are recorded for the top 20 precursors at a resolution of 17,500; an AGC target of 1e5; a maximum IT of 60 ms; normalized collision energy of 27%; intensity threshold is set to 1.3e4; charge states 2–5 are included; and the dynamic exclusion is set to 20 s.\nNote: To minimize and compensate for batch effects, the samples should ideally be measured using the same analytical column, with calibration of the mass spectrometer prior to measurement of samples. Quality control samples (e.g., Pierce HeLa protein digest standard, Thermo Fisher Cat # 88328) should be measured at the beginning and end of the sequence. The sample order should be randomized before putting the MS vials into the liquid chromatography system. Also, we recommend that at least two standard samples should be measured at the beginning and end of the loading sequence for every batch of samples measured, which can be a combined sample or technical replicates of designated samples, to assess for batch effects."
  ],
  "subjectAreas": [
    "Proteomics",
    "Stem Cells",
    "Systems Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}