{
  "id": 18275,
  "origin_website": "Jove",
  "title": "Murine Short Axis Ventricular Heart Slices for Electrophysiological Studies",
  "procedures": [
    "Animal handling has to be conform to guidelines of the local animal welfare committee and to the Directive 2010/63/EU of the European Parliament.\n1. Prepare Solutions\nPrepare Tyrode's solution without Ca2+ (composition in mM): NaCl 136, KCl 5.4, NaH2PO4 0.33, MgCl2 1, glucose 10, HEPES 5, 2,3-butanedione monoxime (BDM) 30. Adjust pH to 7.4 with NaOH at 4 °C.\nPrepare Tyrode's solution with Ca2+ (composition in mM): NaCl 136, KCl 5.4, NaH2PO4 0.33, MgCl2 1, glucose 10, HEPES 5, BDM 30, CaCl2 0.9. Adjust pH to 7.4 with NaOH at 4 °C.\nPrepare 4% low-melt agarose: Put 0.6 g low-melt agarose in 15 mL Tyrode's solution without Ca2+. Heat the mixture in a microwave oven two times at 750 W for 10-15 s until the agarose is dissolved. Keep the solution at a constant temperature of 37 °C and stir continuously.\nKeep Dulbecco's Modified Eagle Medium (DMEM) without serum at 37 °C bubbled with carbogen (5% CO2, 95% O2).\n2. Prepare the Microtome\nSwitch on the microtome.\nFill the outer microtome chamber with ice.\nFill the inner microtome chamber with ice cold Tyrode's solution without Ca2+ and continuously oxygenate the solution with 100% O2.\nPlace a steel blade into the blade-holder of the microtome.\n3. Mouse Heart Isolation\nInject 2,500 U Heparin subcutaneously. Wait 15 min.\nSacrifice the animal by cervical dislocation.\nOpen the chest by sternotomy.\nCarefully dissect the pericardium using small scissors and a forceps #5.\nInsert a cannula into the ascending aorta and perfuse the coronary arteries in situ with ice cold Tyrode's solution without Ca2+ until remaining blood is removed.\nGently resect the heart with a forceps and scissors and transfer the heart in ice cold Tyrode's solution rode without Ca2+.\nSeparate the atria from the ventricles with a scalpel or scissors.",
    "4. Embedding of the Ventricles in 4% Low-melt Agarose\nPlace the ventricles with the apex facing upwards in the agarose mold (Figure 1). Place the pin in the middle of the mold in the left ventricular chamber.\nFill the mold with 4% low-melt agarose at 37 °C, until the heart is completely covered.\nPlace the mold on ice for faster hardening of the agarose preventing floating of the tissue.\nRemove the agarose block containing the ventricles from the mold with a scalpel.\nTurn the block upside down and fill ventricular chambers and the gap on the backside of the agarose block, which is left by the pin of the molt, with 4% low-melt agarose using a syringe with a 20 G needle.\nTrim the agarose block with a scalpel to achieve a flat bottom of the block and upright position of the cardiac apex.\n5. Slicing the Ventricular Tissue\nFix the block on the specimen holder of the microtome with a drop of cyanoacrylate glue. Face the cardiac apex upwards.\nPlace the specimen holder into the inner specimen chamber of the microtome, which is filled with ice cold Tyrode without Ca2+. Completely cover the agarose block with Tyrode's solution.\nPrepare short-axis slices at a thickness of 150-400 µm, depending on the further application (for sharp electrode recordings 150-200 µm), keep vibration frequency of the blade at 60-70 Hz and move the blade forward as slowly as possible.\nUse a fine brush to carefully remove the remaining agarose from the slices.\nGently transfer slices with a Pasteur pipette into the Tyrode's solution with 0.9 mM Ca2+ aerated with 100% O2 and store them for at least 30 min on ice to recover from the slicing procedure.",
    "Afterwards, keep slices for 30 min in DMEM at 37 °C, aerated with carbogen, to wash out BDM before further use.\n6. Preparing the Sharp Electrode Setup\nFor pre-heating, switch on all electric devices 30 min before the recordings start.\nPut a 3 cm cell culture dish on the heating plate placed on the inverted microscope.\nPlace the custom-made ring electrode (Figure 2) in the dish and connect grounding wires of the pre-amplifier and the stimulation electrode.\nConnect the flexible tubes of the perfusion system to the dish.\nFill the reservoir of the perfusion system with DMEM, aerated with carbogen.\nSwitch on the perfusion pump and set the perfusion rate to 2-3 mL/min.\nAdjust the temperature of DMEM in the dish to 37 °C by regulating the flow heater and the heating plate.\n7. Action Potential Recordings\nPlace a ventricular slice into the DMEM filled dish.\nCheck the structural integrity and viability (based on contractile function) of the tissue with the inverted microscope.\nFill a recording glass electrode with 3 M KCL.\nFill a stimulation electrode with DMEM.\nPlace the recording electrode and the stimulation electrode on the electrode holders.\nPlace the stimulation electrode carefully on the slice and switch on the electric stimulator. Start with a stimulation frequency of 1-2 Hz.\nMove the recording electrode with the micromanipulator over the intended recording position.\nSlowly lower the recording electrode until the tip touches the tissue.\nApply a short rectangular electric pulse through the recording electrode to penetrate the cell membrane.\nCarefully reposition the recording electrode until a stable signal is ensured.\nStart recording of action potentials.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}