{
  "id": 3318,
  "origin_website": "Cell",
  "title": "Semi-automated colony-forming unit counting for biosafety level 3 laboratories",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPart 1: Crop agar plates into quadrants using Fiji\nTiming: 2–4 min per plate\nThis part separates all the plates from each photograph and extracts the dilution quadrant from each plate that contains the 10–200 CFU within the limit of detection. Each quadrant is saved along with an overlay mask of the countable region of the photograph for subsequent processing in Part 2. Additional pre-processing steps of background subtraction and median filtering ensure more accurate CFU counts in Part 2.\nThe lossless TIFF image format is well-suited for image processing because it is recognized by both CellProfiler and Fiji. If the photographs are not in the TIFF format, some tools that can help convert to TIFF from a wide variety of other lossless image formats include Fiji, Preview on macOS, Photos on Windows, or ImageMagick on GNU/Linux and other platforms.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2906-Fig3.jpg\nFigure 3. Quick search in Fiji shows where to find commands in the menu path and any available keyboard shortcuts\nUsing the ‘L’ key focuses the cursor in the Fiji main window “Quick search” box. During typing, the matching commands are listed on the left side of the window and the right side of the window shows more information about the top match such as the menu path and any available keyboard shortcut. The “Run button” allows running the top matching commands or one can simply use the “Enter” key.",
    "Note: Fiji contains a lot of functionality organized in submenus that can be time consuming without the use of keyboard shortcuts. Therefore, throughout Part 1, when a command is introduced, the corresponding keyboard shortcut is also mentioned. However, the exact keyboard shortcut varies depending on the operating system and Fiji calls this varying key the “meta” key: on macOS meta is Command key, and on Windows meta is the Control key. As shown in Figure 3[href=https://www.wicell.org#fig3], use the ‘L’ key to quick search commands to save time hunting through submenus and execute the command with the “Enter” key. Additionally, custom keyboard shortcuts can be added to commands which do not have a default shortcut using “Plugins > Shortcuts > Add shortcut”.\nNote: To save your image processing progress, use “Image > Duplicate” (or meta + shift + D) in case of a mistake, because the “undo” operation does not work for many Fiji operations.\nFind the channel with the highest contrast\nTiming: 2–4 min per batch of plates with the same type of media\nFinding the channel with the highest contrast between the colony and the background of the plate needs to be performed for the one image of a given type of media and does not need to be repeated for any of the other images of that given media as this property is assumed to be the same across all such images.\nOpen the TIFF image in Fiji using “File > Open”. If you do not see the “channel slider” at the bottom of the image illustrated in Figure 4[href=https://www.wicell.org#fig4], separate the channels using “Image > Color > Make Composite”.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2906-Fig4.jpg\nFigure 4. Line tool with corresponding Profile Plot to find the highest contrast channel",
    "Drawing with the line tool (yellow line) with a large Line Width (light yellow shading around the line) helps find the channel with the most contrast between a colony and the background. The red, green, and blue channel profiles are plotted. The red channel has the highest signal-to-background difference and is therefore most suitable for processing the example data set. Scale bar: 0.5 cm.\nDetermine which of the three channels has the best contrast between the colonies and surrounding background using the line tool and the Profile window as shown in Figure 4[href=https://www.wicell.org#fig4]. To do this:\nDraw a yellow line over a colony that is long enough to also cover its neighboring background on both sides.\nOpen the Plot Profile window using the shortcut meta + K or from “Analyze > Plot Profile” and click on the “Live” button.\nTo smooth the line plots to be able to better discern the differences between the channel colors, double click on the line tool and increase the “Line Width” to completely cover the colony.\nNote: You will see a light-colored region extend from the line showing the increased width. Figure 4[href=https://www.wicell.org#fig4] illustrates increased Line Width plots.\nAssess which color channel has the greatest difference between the colony signal and background:\nMove the image channel slider at the bottom of the image window.\nIn the Profile window click on “More > Set Range > Fix Y Range While Live” so that the scale is not auto fit while moving the image channel slider.\nIf a signal goes beyond the range of the window, click on “More > Set Range to Fit All” for that channel.",
    "In the example data, the red channel has the best contrast, therefore, in the subsequent steps the red channel is kept, and the remaining blue, green, and gray channels are discarded.\nNote: The example data in Figure 4[href=https://www.wicell.org#fig4] shows four channels instead of the three RGB color channels discussed. This fourth channel is an empty alpha channel caused by converting the Sony RAW image to RGBA instead of RGB. The empty alpha channel is of no use to this protocol and is therefore ignored.\nConvert to grayscale\nTiming: 5–10 s per image using macro1\nNote: Processing only one image at a time is recommended due to the large image file size and the additional memory required for some image processing steps.\nConvert the image to grayscale using the single channel with the highest contrast, determined in step 2. Several GUI steps can be skipped by running Fiji macro scripts. Therefore, the option to use the macro script is first mentioned, followed by the GUI instructions which may be skipped when using the macro. ImageJ macros can be found in “resource availability[href=https://www.wicell.org#resource-availability]” to partially automate the Fiji steps detailed below by “Run macro…”.\nDrag the channel bar located at the bottom of the image to the highest contrast channel determined in step 2.\nRun ColonyMacro1.ijm after editing the channel variable as shown in Figure 5[href=https://www.wicell.org#fig5] or follow the remaining steps 5–6 to obtain the result shown in Figure 6[href=https://www.wicell.org#fig6]. Skip to step 7 if you used macro1. To run macro1:\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2906-Fig5.jpg\nFigure 5. Run macro1 for a single image to extract the highest contrast channel from the color image",
    "The Fiji script editor window shows the macro1 file open with line 7 (highlighted in yellow) containing the highest contrast channel (outlined in blue) that may need to be changed to the channel determined in step 2. After setting the channel value, convert the color image to grayscale using the Run button (outlined in blue).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2906-Fig6.jpg\nFigure 6. Convert the RGB color image to grayscale\nThe conversion simplifies image processing by choosing the color channel that has the most contrast between the colonies and the background. Scale bar: 1 cm.\nOpen the script editor using the [left-bracket keyboard shortcut or from “File > New > Script” and “File > Open” and choose ColonyMacro1.ijm in the code/01-Fiji-imagej-macros/ subdirectory.\nChange the number of the channel variable in the highlighted line to either 1, 2, or 3 corresponding to the channel color red, green, or blue to extract, as explained in the preceding green comment lines.\nClick the “Run” button.\nNote: Figure 5[href=https://www.wicell.org#fig5] uses the “setBatchMode()” command and should not be confused with batch processing. Enabling BatchMode in the macro hides intermediate images from being displayed which allows macros to run up to 20 times faster. On the other hand, batch processing in “Process > Batch > Macro” automates running the macro for several images and saves time from not graphically interacting with the software. However, batch processing is not useful in this protocol because it only can be used for macro1 and not the remaining three interactive macros and comparably as much time can be saved using keyboard shortcuts to run the macros.",
    "Subset the color image to its red component channel using “Image > Hyperstacks > Reduce dimensionality …” and uncheck both the boxes so that the newly created image does not have multiple channels and so that the operation changes the original opened image.\nColorize the channel with the highest contrast found in step 2 as grayscale using “LUT > Grays” in the icon toolbar.\nRotate and copy each plate into a separate image\nTiming: 20–40 s per plate using macro2\nFor experiments using quarter- and bi-plates, it is necessary to correct for any plate rotation so that colonies in a given quadrant or half can be cropped to prevent any colonies from across the divider from being incorrectly counted. Several plates may be photographed in a single image, therefore the first step below is to make a copy of the image for further quantification.\nMake a copy of the image with the shortcut meta + shift + D or from “Image > Duplicate”:\nWhen you are prompted set the “Title”, include the name of the plate you are duplicating and the quadrant that will be quantified.\nNote: If the image name is “HC-T24-E-R1.tiff”, a new title could be “HC-T24-E1-R1-Q-2.tiff” where E1 is the plate or treatment label, and Q-2 indicates the quadrant with the 10−2 dilution will be counted.\nOnly duplicate the image for one plate; any remaining plates in the image will be duplicated following step 29.\nIf your experiment uses full plates instead of quarter- or bi-plates, skip to step 12. Align the plate you chose above to the 0°/90° axes by selecting the line tool shown in Figure 4[href=https://www.wicell.org#fig4] and draw a line from top to bottom along the vertical divider inside the plate of interest as shown in Figure 7[href=https://www.wicell.org#fig7].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2906-Fig7.jpg",
    "Figure 7. Rotate the image so the plate’s vertical division is orthogonal to the top edge of the image\nRotating the image will make cropping the quadrant of interest easier. This figure shows the top-left plate being rotated; each of the plates needs to be rotated separately. The drawn line remains at its original position because it is not rotated with the image. Scale bar: 1 cm.\nNote: If you need to draw a more precise line, zoom into the image with the + and - keys or hold down the meta key and scroll with your mouse or trackpad.\nRun ColonyMacro2.ijm from the script editor or follow the remaining steps 10–11 to rotate the image to the drawn vertical line. Unlike macro1, none of the remaining macros require editing the script variables. Skip to step 12 if you used macro2.\nNote: Running this macro may rotate the image away from the center of the plate divider instead of aligning the plate divider to the 90° axis. If this happens, the line was drawn from bottom to top. To confirm if the line was drawn in such a way, note the yellow box at the edge of the line representing the origin; if the yellow box is at the bottom, the line was drawn from the bottom. Undo the incorrect rotation using the shortcut meta + Z or from “Edit > Undo”, re-draw the line from top to bottom, and re-run macro2.",
    "Determine the deviation from the center axis. This measurement only appears when moving the drawn line in the status bar as the number following “angle = ”, therefore move your cursor to the white rectangular point at the center of the vertical line until it turns into the hand icon. The position of the line is no longer relevant because we are only interested in the angle.\nRotate the plate of interest using “Image > Transform > Rotate…”:\nAdd 90° to the angle determined in step 10 and enter it into the “Angle” text box.\nObtain a smoother output image by also changing “Interpolation” to “Bicubic”. This non-default interpolation method more closely matches the original image pixel values.\nThe final rotated transformation is shown in Figure 7[href=https://www.wicell.org#fig7].\nNote: The image was duplicated before rotating it because multiple rotations of the same image could introduce aliasing artifacts.\nSubtract the background and remove speckle noise\nTiming: 10–20 s per plate using macro3\nCritical: This section assumes you are using uncalibrated images. Using the shortcut meta + shift + P or “Image > Properties…” your Pixel width and Pixel height should both be 1.0 as shown in Figure 8[href=https://www.wicell.org#fig8]; the pixel unit type – in this case \"inch” – has no effect for the purposes of this protocol. If instead you have pixel calibration values other than 1.0, then the measurements and suggested values below do not apply and so you should change your pixel calibration values to be 1.0.\nDraw a line to measure the diameter of the largest colony in the quadrant of interest. To draw a more precise line, zoom into the image with the + and - keys. The line drawn across the diameter of the largest colony of the zoomed-in image is shown in Figure 9[href=https://www.wicell.org#fig9].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2906-Fig8.jpg",
    "Figure 8. Image pixel calibration must be 1.0\nThe image “Properties…” window allows one to check and change the pixel calibration values, which affect image length measurements and other commands.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2906-Fig9.jpg\nFigure 9. Measure the diameter of the largest colony\nThe rolling ball radius should be as large as the largest colony in the quadrant of interest. Scale bar: 0.1 cm.\nNote: The next step of background subtraction uses the rolling ball filter algorithm; this step is necessary to tune the rolling ball filter algorithm to the largest object of interest.\nRun ColonyMacro3.ijm or follow steps 14–16 to remove the background and speckle noise. Skip to step 18 if you used macro3.\nWhile drawing or moving the line, note the number next to the “length = ” in the status bar. Zoom out of the image with the - key to be able to better see the effect on the whole image.\nMaximize the contrast between the colonies and the background of the plate using “Process > Subtract background…” as shown in Figure 10[href=https://www.wicell.org#fig10].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2906-Fig10.jpg\nFigure 10. Subtracting the background\nThis maximizes the contrast between the colonies and their neighboring background for more reliable object detection. Scale bar: 1 cm.\nSet the rolling ball radius to half the length of the largest colony measured previously in step 14.\nUnselect “Light Background” and click “OK”.\nRemove speckle noise from the image using “Process > Filters > Median”. Keep the radius as 2 pixels.\nOptimize the brightness and contrast using the shortcut meta + shift + C or from “Image > Adjust > Brightness/Contrast…” and click on the button “Reset” and then “Auto”.",
    "Note: This does not change the image data, but the way the data is displayed with the lookup table. Adjusting the contrast at this step will make it easier to see artifacts so that they can be excluded from the mask in the next two sections.\nCrop the plate and add the mask channel\nTiming: 30–60 s per plate using macro4\nNext, add an image mask of the plate region to prevent false positive counts of artifacts outside the plate.\nExclude regions surrounding the plate:\nSelect the “Oval” tool and hold down the shift key to draw a circle around the plate you want to count.\nAvoid including the bright artifacts from the edges of the plate.\nTo exclude the plate edges, start drawing the circle at any of the four corners at which the plate divider inside the media meets the plate edge as shown in Figure 11[href=https://www.wicell.org#fig11].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2906-Fig11.jpg\nFigure 11. Create a mask using the oval tool for the single-plate photo\nThe mask will be used later in CellProfiler to identify the region of interest for colony counting. The word “photo” is used as shorthand to distinguish the image with colonies from the mask. Scale bar: 1 cm.\nIf the circle is offset, click anywhere inside the yellow circle and drag to move.\nTo readjust the size of the circle, hold shift and click on any of the eight white squares surrounding the circle. If you do not see any white squares surrounding the circle, see the troubleshooting[href=https://www.wicell.org#troubleshooting] section Solution 1.\nRun ColonyMacro4.ijm or follow steps 19–21 to crop the plate and add the mask channel. Upon running this macro4 you will see a channel slider appear underneath the image with the corresponding mask. Skip to step 22 if you used macro4.",
    "Crop the image to a single plate using the shortcut meta + shift + X or from “Image > Crop”.\nCreate a mask of the plate for later use in CellProfiler by adding another image to the stack that uses your drawn circle with “Image > Stack > Add Slice”.\nUse the “Color Picker” tool to ensure the foreground and background are white and black respectively. These should be the default settings.\nFill the outside of the circle to the background color using “Edit > Clear Outside”.\nFill the inside of the circle to the foreground color using the shortcut meta + F or from “Edit > Fill”. Choose “No” when prompted for “Process all 2 Images? …” to not fill all channels. The resulting second channel in the stack should appear as in Figure 11[href=https://www.wicell.org#fig11].\nDeselect the circle by clicking anywhere outside the circle in the image because the circle has now been captured as the mask.\nCrop the quadrant and correct the mask if necessary\nTiming: 20–40 s per image\nCritical: Only one quadrant of colonies per plate must be quantified as shown in Figure 1[href=https://www.wicell.org#fig1]. This protocol is optimized for quadrants with 10–200 colonies. Fewer colonies than this range compromises the accuracy of CFU counts and risks falling below the limit of detection and more colonies than this range may miscount from too many overlapping colonies.\nDraw a square in the photo using the “Rectangle” tool by holding the shift key and clicking the corner of the photo containing the quadrant you would like to count and dragging toward the center, being careful to avoid the plate dividers. As with drawing the circle, move and resize the square as necessary.",
    "Note: If you do not see the white squares around the drawn square to resize it, see Troubleshooting section Solution 1.\nCrop the image to the single quadrant using the shortcut meta + shift + X or from “Image > Crop”.\nIn our example images, some quadrants may include the plate label, which may obstruct some colonies. Outline the obstruction with the “Rectangle” tool, select the mask channel, and remove the rectangle from the allowed colonies area using “Edit > Clear” and choose “No” when prompted for “Process all 2 Images? …” to not clear both channels. The quadrant with the mask removed is shown in Figure 12[href=https://www.wicell.org#fig12].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2906-Fig12.jpg\nFigure 12. Single-quadrant mask corresponding to photo\nThis quadrant required the additional step of cropping the label from the mask channel. These are the resulting processed images that will be input into CellProfiler for colony counting. Scale bar: 1 cm.\nIf you ran step 25, deselect the rectangle by clicking anywhere outside the rectangle.\nSave the quadrant and its mask\nTiming: 15–30 s per image\nThe first image to save will be the template and the second will be the image.\nConvert the stack into individual images using “Image > Stacks > Stack to Images”.\nSave both the single-quadrant photo and mask as separate TIFF files with “File > Save As > Tiff…” using consistent names so that CellProfiler can assign the correct image type and treatment across all the images.\nNote: In the example dataset, the original image “HC-T24-Unt-R2.tiff” would be saved with suffixes for the photo and mask as “HC-T24-Unt-R2-photo.tif” and “HC-T24-Unt-R2-mask.tif”.",
    "Critical: The suffixes “photo” and “mask” must be consistent for all the images so that the images can be imported correctly in step 33. Furthermore, the remainder of the image name before “photo” and “mask” must be exactly the same for a given image for the images to be considered the same set as shown in Figure 15[href=https://www.wicell.org#fig15]. If your image names differ from this example format of “{Media}-T{Day}-{Treatment}-{Replicate}-{Channel}.tif” that will can be adapted to your needs by following the instructions in step 33.\nRepeat for the remaining agar plates\nIf the image contains multiple plates, return to step 7 to repeat the quadrant cropping for the remaining plates within the image.\nReturn to step 3 to repeat the quadrant cropping for the plates in the remaining images.\nPart 2: Count the colonies using CellProfiler\nTiming: ∼60 min\nThis part identifies both CFU objects and artifacts from the image-mask pairs saved in the previous part. Any CFU objects overlapping artifacts are removed to leave high confidence CFUs that form the final counts. Three parameters are tuned for identifying CFUs and artifacts. Besides the spreadsheet of counts, also saved are images of identified CFUs to identify any artifacts being falsely counted as CFUs.\nThe CellProfiler pipeline file ColonyCounter.cpproj provided in “resource availability[href=https://www.wicell.org#resource-availability]” is necessary for these steps.\nImport the image files and set the output locations\nTiming: 1–10 min\nOpen the ColonyCounter.cpproj pipeline file from under the code/02-cellprofiler/ subdirectory in CellProfiler using “File > Open Project…”.",
    "Due to differences in absolute paths between computers, clear the existing image list in the “Images” list in the main CellProfiler window as shown in Figure 13[href=https://www.wicell.org#fig13] by right-clicking near the existing list of image files and choosing “Clear File List”. Then drag and drop all the photo and mask TIFF files of image quadrants created above using Fiji into that area.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2906-Fig13.jpg\nFigure 13. CellProfiler main window with the image file list selected\nDue to differences in image paths between computers, clear the existing file list and instead drag and drop your TIFF files produced with Fiji into the image list.\nNote: Example processed images are provided in the results/01-Fiji-images/ subdirectory.\nIn the “Metadata” window, click the “Update” button as shown in Figure 14[href=https://www.wicell.org#fig14].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2906-Fig14.jpg\nFigure 14. Metadata extracted from image name\nClick the “Update” button to extract metadata from the image file names. The Channel column only impacts image processing, the remaining metadata columns are necessary to label outputs for downstream analysis.\nThe “Quadrant”, “Replicate”, and “Treatment” columns are critical for downstream analysis to produce the drug-CFU plot.\nNote: If the columns are not extracted as illustrated in Figure 14[href=https://www.wicell.org#fig14], rename your images in the format of the images in the screenshot.\nIf your experimental design requires different metadata from the image filename, change the contents of the text box next to “Regular expression to extract from file name”.\nNote: Consult the ? help button on the right of the text box for an explanation of how the metadata extraction works.\nUnder “NamesAndTypes” click “Update” to see two columns that show the paired mask and photo TIFF files as shown in Figure 15[href=https://www.wicell.org#fig15].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2906-Fig15.jpg\nFigure 15. Pairing of Photo with Mask images in NamesAndTypes",
    "Click the “Update” button to pair each Photo with its corresponding Mask image. This step uses the metadata “Channel” columns to pair these images for processing steps.\nNote: These pairings are necessary for the mask to be associated with the photo image so that in subsequent computations, the colonies are only searched for within the mask.\nOptionally, change the “Output file location” as desired in the “ExportToSpreadsheet”, “ExportToDatabase”, and the three “SaveImage” modules.\nThe “ExportToSpreadsheet” output is necessary for creating the final log-log drug-CFU concentrations plot.\nThe “ExportToDatabase” step is only necessary for running the optional step for using CellProfiler Analyst explained in troubleshooting[href=https://www.wicell.org#troubleshooting] section in Solution 3.\nThe “SaveImage” modules save the detected object outputs to supplement the spreadsheet summary measurements.\nTune parameters in test mode and inspect the results\nTiming: 5–20 min\nInteractively determine which parameters to adjust by clicking on “Start test mode” in the bottom left of the window, opening the “Eye” buttons next to the relevant image processing modules illustrated in Figure 16[href=https://www.wicell.org#fig16], and then using either the “Step” or “Run” button to generate the pop-up preview images. Below is the rationale for adjusting the parameters to improve detecting colonies and rejecting artifacts:\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2906-Fig16.jpg\nFigure 16. Run “Start Test Mode” to tune parameters",
    "Click on the “Start Test Mode'' button in the bottom left corner to preview the output of the image processing modules. When clicking the “Step” or “Run” buttons, preview output images are generated for any modules which have their corresponding “Eye” buttons open. When optimizing parameters to improve consistency across additional images using the “Next Image Set” button, some of the “Eye” buttons illustrated may need to be closed to limit the number of pop-up preview output images to only those relevant to the parameter being adjusted. The exclamation mark signs next to the “ExportTo∗” modules indicate that these modules produce no output during Test Mode.\nIf there are many small colonies that are not being captured, decrease the minimum value of “Typical diameter of objects, in pixel units” shown in Figure 16[href=https://www.wicell.org#fig16] for both the IdentifyPrimaryObjects modules to as low as 1 pixel. If there are too many small artifacts being captured, increase the value to as many as 7 pixels. The initial value of this parameter is 3 pixels.\nNote: If this parameter varies inconsistently across images, check the consistency of the plate diameter across photographs described in Troubleshooting section Solution 2.\nIf there are artifacts such as streaks, condensation, or glare being counted as colonies, decrease the minimum “Eccentricity” shown in Figure 17[href=https://www.wicell.org#fig17]. If there are many merged colonies being excluded, increase the Eccentricity minimum. The initial value of this parameter is 0.8. The detection and removal of artifacts is shown in Figure 18[href=https://www.wicell.org#fig18].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2906-Fig17.jpg\nFigure 17. Adjustable parameters in the “FilterObjects” module\nThe locations to adjust the values for eccentricity and minor axis length are highlighted.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2906-Fig18.jpg\nFigure 18. Extract non-colony artifacts for later removal",
    "Tune the three parameters of typical diameter, eccentricity, and minor axis length to separate colonies from non-colony artifacts. The “Filtered: Artifacts” in the middle are the resulting artifacts that will be removed in a subsequent module in the CellProfiler pipeline. Images are from the “FilterObjects” module. Scale bar: 1 cm.\nIf there are many merged colonies and few streaks, click the “Remove this measurement” button shown in Figure 17[href=https://www.wicell.org#fig17] under the MinorAxisLength in the “FilterObjects” module. The initial value of this parameter is 0.15. An example of merged colonies is shown in Figure 18[href=https://www.wicell.org#fig18].\nAnytime a parameter is changed, click “Exit Test Mode”, then click “Start test mode” and then click either “Step” or “Run”. The final colonies identified are shown in Figure 19[href=https://www.wicell.org#fig19].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2906-Fig19.jpg\nFigure 19. Remove non-colony artifacts previously identified\nVerify that the artifacts have been removed. Removed objects are indicated by purple outlines in CellProfiler. Images are from the “MaskObjects” module. Scale bar: 1 cm.\nSave the project changes using “File > Save Project”.\nClick “Exit Test Mode”.\nNote: Do not spend too much time optimizing the three parameters described in step 36. Typically, only certain images will not be counted correctly due to systemic sources of error such as streaking artifacts in the background or too large active area of a mask which introduces artifacts from the plate edges and dividers as shown in Figure 19[href=https://www.wicell.org#fig19]. To correct the high background error, choose another dilution quadrant in Part 1, and to correct the mask large active area error, regenerate the quadrant with a smaller paired mask.\nRun the full pipeline\nTiming: 5–10 s per image\nClick “Analyze Images'' to run the full pipeline. The “Images.csv” file generated by the “ExportToSpreadsheet” module contains a “Count_Colonies'' column with the final colonies count.",
    "Note: The full pipeline takes about four minutes for the 78 input images (39 image pairs) on an 8 core MacBook or about six seconds per image pair.\nNote: The exported spreadsheet will be merged with the experiment metadata spreadsheet in Quantification and Statistical Analysis.\nOpen the PNG files output by the “SaveImages” modules and check them for artifacts that were incorrectly counted as colonies and colonies that were missed. The default location of the PNG “SaveImages” modules is the results/02-images-colonies-overlay subdirectory. If necessary, adjust the parameters and recompute the number of colonies by re-running steps 36–39.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2906-Fig20.jpg\nFigure 20. Comparison of the semi-automated count against manual count\nLog-log plot of semi-automated and manual counts fitted with a linear model y ∼ x with zero-intercept indicated by the blue line. The shading around the fitted blue line represents the standard error. To increase the number of data points, 134 quadrants were counted from the larger dataset rather than limiting this analysis to the 39 quadrants in the images.zip example dataset. The semi-automated counts shown in this comparison did not use the optional CellProfiler Analyst step.\nCritical: When adjusting parameters, prefer false positives to false negatives. If there are many false positives, further automated refinement of parameters is possible to separate false from true colonies using CellProfiler Analyst as described in the Troubleshooting section in Solution 3. Using CellProfiler Analyst is not formally a part of the protocol because good results are possible with CellProfiler alone as shown in Figure 20[href=https://www.wicell.org#fig20], and it is much more important to gather well-tuned, segmented colonies with CellProfiler because CellProfiler Analyst is effective only when it has high quality data from CellProfiler."
  ],
  "subjectAreas": [
    "Microbiology",
    "High Throughput Screening"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}