{
  "id": 18173,
  "origin_website": "Jove",
  "title": "Discovering Middle Ear Anatomy by Transcanal Endoscopic Ear Surgery: A Dissection Manual",
  "procedures": [
    "The present study was approved by the local institutional review board (KEK-BE 2016-00887).\n1. Preparation of the Specimen\nPosition a vacuum mattress on the dissection table and cover it with a sterile blanket. Lay the anatomical specimen in a surgical position on the mattress with the head slightly rotated to the contralateral side.\nRetract the tragus with a flexible hook to the contralateral side.\nCover the specimen with a blanket sparing the external ear, just as in the operating room.\n\tNOTE: Please see the Table of Materials for a complete list of equipment required.\n2. Getting Started\nAdopt a comfortable standing or sitting position and adjust the endoscope screen. This is an important issue to prevent hardening of the neck muscles and therefore faster exhaustion.\nPerform the white balancing in your camera menu and apply a drop of anti-fog solution on the endoscope tip.\nHold the surgical instruments in your dominant hand and the endoscope in the other hand. \nIntroduce the 0°, 3 mm diameter, and 15 cm length endoscope into the EAC. As a first task, clean the EAC thoroughly from eventually present ear wax using the suction tube. Rinse the EAC with water. Cut the hair inside the EAC with a pair of small scissors to prevent the endoscope from becoming dirty during every passage.\nOnce the EAC is clean, inspect the tympanic membrane (TM). Identify:\n\t- Malleus with short process, manubrium and umbo\n\t- Annulus of tympanic membrane\n\t- Pars flaccida (Shrappnel membrane)\n3. Elevation of the Tympano-Meatal Flap (TMF)\nNote: In endoscopic ear surgery, the TMF is performed slightly smaller and in a triangular shape. The reason is the limited space inside the EAC.\nIncise the EAC skin superiorly, slightly anterior to the short process of the malleus using a sickle or a round knife.",
    "Extend the incision to the posterior superior portion of the EAC and prolong the incision to the anterior and inferior border of the TM to configure a triangular shaped flap.\nWith the 45° angled round knife, expose the bone and elevate the skin until reaching the annulus. It is important to strictly adhere to the bone.\nElevate the annulus with the round knife to access the tympanic cavity (TC). The mucosa of the TC is slightly more transparent than the skin and is incised at the level of the chorda tympani using a hook.\nMobilize the annulus inferiorly and anteriorly using the Thomassin dissector.\nIdentify superiorly the posterior lateral ligament of the malleus (PLML). This ligament represents the inferior limit of the Prussak space. Grasp the ligament with the Hartmann forceps and pull it gently anteriorly in the direction of the umbo until uncovering the short process of the malleus.\nGently dissect the anterior Prussak space until reaching the anterior superior insertion of the annulus. Now identify:\n\t- Annulus\n\t- Chorda tympani\n\t- Posterior malleolar ligament\n\t- Lateral malleolar ligamental fold\n\t- Anterior malleolar ligamental fold\n\t- Prussak space\n4. Detachment of the TMF from the Handle of the Malleus\nFrom the short process of the malleus, continue the dissection and incise the periostium of the malleolar handle towards the umbo with a needle dissector. It is important to detach the TM in the right plane to prevent accidental perforations.\nDetach the TM completely from the manubrium. A dry cottonoid may be helpful, since it facilitates the identification of the correct layer and its dissection.\nOnce the umbo is reached, cut the remaining fibrous layer of the TM using a micro-scissor.",
    "Now position the whole flap on the anterior wall of the EAC to allow free access to the TC. Identify:\n\t- Fibrous layer of tympanic membrane\n\t- Anterior superior annulus\n\t- Malleus short process, manubrium and umbo\n\t- Chorda tympani anterior to the malleus\n5. Middle Ear Exploration\nNOTE: This part of the dissection aids in the recognition and rehearsal of the middle ear anatomy. Each subdivision of the TC should be explored separately using 0° and 45° endoscopes. Eventually present folds or adherences should carefully be removed.\nEpitympanum. Identify:\n\t- Malleus: Neck, short process, manubrium and umbo\n\t- Incus: Body, long process, lenticular process, incudostapedial joint\n\t- Epitympanic diaphragm: anterior and lateral malleolar ligaments, lateral incudomalleolar ligamental fold\n\t- Anterior and posterior spine\n\t- Chorda tympani\n\t- Tympanic isthmus and ventilation patterns to the antrum\n\t- Cochleariform process\n\t- Tensor tympani muscle, tendon and bony canal\n\t- Tensor fold\nMesotympanum. Identify:\n\t- Stapes: Capitulum, anterior and posterior crus, footplate\n\t- Tendon of stapedial muscle\n\t- Pyramidal eminence\n\t- Promontory bone\n\t- Jacobson nerve with inferior tympanic artery\nRetrotympanum: If adherences are present they should be thoroughly removed. Changing the position of the surgeon to the contralateral side facilitates accessing the retrotympanum by angulated optics (45°). Identify:\n\t- Facial recess\n\t- Posterior sinus\n\t- Ponticulus\n\t- Sinus tympani\n\t- Subiculum\n\t- Styloid eminence\n\t- Subtympanic sinus\n\t- Fustis bone\n\t- Area concamerata\n\t- Round window niche with tegmen, anterior and posterior pillar\n\t- Round window membrane\n\t- Subcochlear canaliculus\n\t- Finiculus\nHypotympanum\n\t- Hypotympanic cells\n\t- Estimate localization of the JVB if not visible\nProtympanum. Identify:\n\t- Protiniculus\n\t- Internal carotid artery\n\t- Eustachian tube (ET)\nDisarticulate the incudostapedial joint and remove the incus. With a curette remove the scutum. Identify:\n\t- Tympanic segment of the facial nerve",
    "- Lateral semicircular canal\n\t- Antrum\n\t- COG or transverse crest\n\t- Tegmen tympani\nCut the tendon of the tensor tympani muscle and remove the malleus. Identify:\n\t- Anterior Epitympanum\n\t- Geniculate ganglion"
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}