{
  "id": 17348,
  "origin_website": "Jove",
  "title": "Precision of In Vivo Quantitative Tooth Wear Measurement Using Intra-Oral Scans",
  "procedures": [
    "Institutional ethical approval for the protocol was obtained (ABR code: NL31401.091.10).\nNOTE: The following steps describe the 3DWA protocol.\nimgsrc://cloudfront.jove.com/files/ftp_upload/63680/63680fig01.jpg\nFigure 1: Visual representation of the steps for superimposition and quantitative wear measurement. This figure has been modified from K. Ning et al.23. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/63680/63680fig01large.jpg]\n1. Acquisition\nNOTE: The following procedure was used to scan dentitions.\nIsolate the dentition using lip retractors, dry pads, and curly saliva ejectors.\nLightly powder the dentition before scanning if required for the intra-oral scanner used.\nScan the dentition according to the manufacturer's instructions. Refer to the Table of Materials for the products used.\n2. Superimposition\nNOTE: The following procedure was used for superimposition and quantitative wear measurement.\nOpen the 3D software program (see Table of Materials). Open (or import) the old and new scans (STL-/PLY-file) of the upper and lower jaws.\nSelect the separated teeth.\n\t\nSelect a scan, and then use Lasso Selection and Select Through to select a tooth. Save the separated tooth using Tools > New Object > From Selection. Select Copy and Paste and give the object a name (e.g., 17_2016_Original).\nRepeat this procedure for each tooth of the upper and lower jaws, as well as for the old and new scans. Before selecting a new tooth, first deselect the previously selected tooth (click on the right mouse button, and then on Clear All).\nSelect a specific tooth in Model Manager (e.g., 17_2016). Change Select Through with Select Visible. Use the Lasso tool to select soft tissue and contact areas and delete (right-click > Delete, or press Delete button on the keyboard) these parts. Repeat this for all individual teeth.\nCalculate best fit per tooth.",
    "Select in Model Manager the old scan and (by right-clicking the mouse) set this as Set Reference. Similarly, set the new scan as Set Test. Select the Reference scan and, in the Alignment tab, choose Best Fit Alignment, set Deviator Elimination to 1, press Apply, and then OK.\nCheck the quality of the best fit. Go to Analysis > Selection Through Object and create an intersection perpendicular to the surface from the buccal to the palatal side. Press on Compute. A cross-section of both scans (red and black lines) will become visible. Check if the Best Fit is correct and that the new scan is not superpositioned (higher) compared to the old scan.\nPress OK to go back to the scan.\n\t\tNOTE: Optionally, the best fit might need to be improved when areas with too much wear interfere with obtaining a proper best fit. This step is described in 2.3.3.1.\n\t\t\nDeselect areas on the old and new scans with severe material loss using the Lasso tool. Select areas on, if possible, at least three surfaces (buccal-palatinal/lingual-occlusal). Repeat step 2.3.1 through step 2.3.3.\nSelect Analysis > 3D Compare to create a colorized model of the wear. In order to obtain wear facets as negative values in the results, perform the following steps.\n\t\nChange spectrum as follows: Color Segment: 21; Max. Critical: 0.2 mm; Max. Nominal: 0.02 mm; Min. Nominal: -0.02 mm; Min. Critical: -0.2 mm; Decimal Places: 3.\nClick on Apply and then OK. The result of the 3D Compare is presented in the Model Manager.",
    "​NOTE: Height decrease (wear) is shown in blue, and height increase is shown in yellow-red. Surfaces with no changes are shown in green. Surfaces the software was unable to compute due to severe loss are shown in grey. In that case, step 3.2 is followed instead of step 3.1.\n3. Quantitative wear measurement: Height\nMeasure the vertical height loss.\n\t\nClick on Set Result on the fitted and compared tooth. Go to Create Annotations in the Analysis tab. Change the Deviation Radius to 0.1 mm. Select the area with the largest amount of wear (darkest blue point) and click on OK to go back to the scans.\nUse Edit Spectrum to raise or decrease the value of Max Critical when the darkest blue area is too large to determine the point of highest wear. It changes the color, resulting in one clear point of darkest blue.\nExport the value from the Annotation on the point of highest wear to the data system.\nDetermine the vertical material loss on 2D images with 2D Dimensions (2D Compare method).\n\t\nSet the old scan as the reference scan and the new scan as the test scan.\nMake multiple cross-sections (Analysis > Section Through Object > Compute > OK) on the locations/cusps with the largest loss of material (use the 3D Compare result to determine the location).\nClick on Test scan, and then select 2D Dimensions under the Analysis tab. In View Control, select the cross-section showing the highest height difference in the to-be-measured area.\nSelect Parallels for Dimension Type.",
    "In the Pick Methods, click on Test. Make a mark on the Test scan at the location of the largest wear, then click on REF in the Pick Methods and make a mark on the Reference scan. Click on one selected point (highest amount of wear) to obtain the result and export this to the data system, and then click on OK.\n4. Quantitative wear measurement: Volume\nTrim the teeth\n\t\nSelect the tooth to be compared. Right-click on the scan and then click on Duplicate to make copies of the old and new scans of the to-be-measured tooth. Remove the automations from the copy by selecting Automations, right-clicking it, and then clicking on Delete. Select both copies of the old and new scans of the tooth.\nGo to Polygons and select Trim with Plane. Trim interdental areas and then cervical areas by creating intersections, leaving only a closed occlusal surface. Trim by drawing the intersection, resulting in a red selected area and a blue unselected area divided by the intersection.\nClick on Intersect Plane, Delete Selection, and then Close Intersection and OK to cut off the selected area on the interdental and cervical surfaces and create a closed off volume. If necessary, first reverse the selected area if the software selects the occlusal side to be deleted.\n\t\tNOTE: In case the error \"the intersection cannot be closed\" appears, there is a hole in the chosen intersection preventing it from being closed. Slightly adjust the chosen intersection to solve this.\nClose the remaining (small) holes.\n\t\nClose small holes in the scans by selecting Fill all. Selected holes are marked with a green border, and, after filling, those will become red.\nIf there are too many or too large holes preventing measurement of volume, exclude the tooth.",
    "Measure the volumes of both objects.\n\t\nGo to Analysis > Compute Volume. If the volume is 0, then this means that a hole is still present in the object.\nExport the values of the old and new volumes to the preferred data system.\n5. Statistical analysis\nCalculate the protocol precision with a one-sample T-test, determining the structural and random error for both the height (mm) and volume (mm3).\n\tNOTE: The random error has a zero mean and is referred to as the duplicate measurement error (DME). As the DME is present twice in repeated measurements, the DME was calculated as the standard deviation of the differences divided by √2.\nCalculate the intra- and inter-precision with the paired T-test, from which the correlation, structural error, and DME are reported.\nTo visualize the agreement, obtain Bland-Altman and violin plots.\nTo compare and interpret results, use the trimmed ranges (P90 minus P10) calculated from the larger group of 55 patients regarding tooth wear after 0-1-, 0-3- and 0-5-year intervals for height (mm) and volume (mm3).\n\tNOTE: These ranges were slightly trimmed to emphasize the range of more normal or less normal observations, whereas a full range would be determined by very specific observations."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}