{
  "id": 13253,
  "origin_website": "Jove",
  "title": "Quantification of Self-renewal in Murine Mammosphere Cultures",
  "procedures": [
    "In vivo procedures were performed in accordance with EU directive 2010/63 and after approval from our institutional ethics committee (Organism for Animal Wellbeing--OPBA) and the Italian Ministry of Health (IACUC Numbers 762/2015 and 537/2017).\n1. Murine Mammary Gland Collection and Digestion\nFor a typical experiment, sacrifice 8-10 weeks-old virgin female mice by CO2 inhalation. Depending on the aims of the experiment, use 5-30 mice. Place the mice on dissection boards under a hood. Use needles to stretch the forelimbs and wash down the fur of the animal with ethanol.\nLift the skin with forceps and perform a vertical incision starting at the level of the pelvic area and moving all the way to the cervix, leaving the peritoneum intact. To avoid rupturing the skin or the peritoneum, use round-edged scissors.\nCarefully detach the skin from the body with gentle movements of the scissors across the lateral axis of the body.\nOnce the skin is fully detached from the thoracic and abdominal area, perform four incisions across the four limbs of the animal and pin down the skin with needles. Use the scissors and forceps to fully detach the body of the animal from the extended skin.\nUse the forceps to gently lift the mammary fat pads that are now fully exposed and carefully detach them from the skin with the aid of the scissors. Collect the lower thoracic and abdominal mammary glands of each mouse and immerse them in Dulbecco's phosphate buffered saline (DPBS), in a 50 mL conical tube. Collect up to 20 glands per tube. Keep the tissues on ice.\nNOTE: If needed, the glands can remain on ice overnight. This is a safe stopping point. The following steps should be performed under sterile conditions.",
    "Prepare and filter the digestion medium: Dulbecco's modified Eagle's medium (DMEM) supplemented with 2 mM glutamine, 100 U/mL penicillin, 100 µg/mL streptomycin, 200 U/mL collagenase and 100 µg/mL hyaluronidase (see Table of Materials).\nTransfer up to 20 glands to a 100 mm Petri dish and mince the tissue using a scalpel or curved scissors. Avoid transferring large volumes of DPBS to the dish.\nAdd 10 mL of digestion medium to each Petri dish and transfer the minced tissue to a 50 mL conical tube, using a 25 mL serological pipette.\nSeal the tubes with parafilm and place them on a rotator. Set the rotator at a low speed (0.03 x g) and incubate for 2.5 h at 37 °C in a humid atmosphere containing 5% CO2.\nVisually inspect the suspension before proceeding to the next steps. If large pieces of tissue remain undigested, prolong the incubation at 37 °C for another 30 min.\nNOTE: As an alternative, the digestion can be performed overnight at 37 °C, 5% CO2, using a gentle collagenase/hyaluronidase enzyme mix13.\n2. Isolation of Primary Murine MECs\nStop the rotator and remove the tubes from the incubator. Adjust a P1000 tip at the opening of a 5 mL serological pipette. If the suspension passes through the P1000 tip, proceed to the next steps. Otherwise, prolong the incubation at 37 °C for another 30 min.\nCentrifuge at 100 x g, for 5 min at 4 °C. Carefully decant the supernatant and resuspend the pellet of each tube in 3 mL of DPBS.\nNOTE: The low centrifugation speed allows the removal of lymphocytes and adipose tissue cells. Gentle manipulation is required to avoid dislodging the pellet at this step.",
    "Filter the cell suspension in each tube separately, using 100, 70 and 40 µm cell strainers. At each filtering step, wash the strainers with 2 mL of DPBS before collecting the pass-through.\nNOTE: From this point on, the cell suspensions can be pooled and processed together.\nCentrifuge at 300 x g, for 5 min at 4 °C. Carefully decant the supernatant and resuspend the cells in the remaining volume of DPBS.\nProceed to the red blood cell (RBC) lysis by adding an equal volume of ammonium-chloride-potassium (ACK) lysis buffer (see Table of Materials). Mix by pipetting and incubate on ice for up to 5 min.\nAdd 10 mL of DPBS and centrifuge at 300 x g, for 5 min at 4 °C. Carefully decant the supernatant and visually inspect the pellet. If the pellet is white, proceed to the next step. Otherwise repeat the RBC lysis step (step 2.5).\nResuspend the cell pellet in 1-5 mL of mammosphere media: mammary epithelial cell growth basal medium (MEBM), supplemented with 2 mM glutamine, 100 U/mL penicillin, 100 µg/mL streptomycin, 5 µg/mL insulin, 0.5 µg/mL hydrocortisone, 2% B27, 20 ng/mL epidermal growth factor (EGF), 20 ng/mL basic fibroblast growth factor (bFGF) and 0.4 IU/mL heparin (see Table of Materials).\n3. Serial Mammosphere Re-plating\nFor the establishment of mammosphere cultures, plate the cells onto non-tissue culture treated (ultra-low adhesion) 6-well plates at a density of 200,000 viable cells/mL in mammosphere medium. Incubate the cells for 7-10 days at 37 °C, 5% CO2.\nPrepare and filter 1% poly-HEMA solution in 95% ethanol (see Table of Materials). Coat ultra-low adhesion 6-well plates for the following passages, by adding 400 µL of 1% poly-HEMA solution per well and allowing the ethanol to dry completely. For better results, repeat the coating twice.",
    "NOTE: The use of non-coated plates during the first passage allows the selective removal of fibroblasts from the culture.\nAt the end of the 7-10 days culture, collect the primary mammospheres from all the wells and centrifuge at 300 x g, for 5 min at 4 °C.\nCarefully decant the supernatant and proceed to the mechanical dissociation of the mammospheres using a P200 pipette with filtered tips. Pipette for approximately 100 times and visually inspect the suspension for the presence of large spheroids.\nNOTE: A short incubation (2-5 min) of the sphere pellet in a low volume (0.2-0.5 mL) of trypsin or Accutase at 37 °C, 5% CO2, can be used to facilitate mechanical dissociation. Prepare fresh mammosphere medium (step 2.7) for the plating of each passage.\nResuspend in 1-5 mL of fresh mammosphere medium and count the viable cells. If applicable, split the cells in treatment groups or culture conditions.\nPlate 20,000 viable cells/mL on poly-HEMA-coated ultra-low adhesion 6-well plates and incubate at 37 °C, 5% CO2.\nNOTE: Mammospheres reach their maximum size within 5-7 days after cell plating. When possible, distribute the cells of each sample or condition to multiple wells to obtain technical replicates. Plating density should be kept low to avoid cell aggregation. A maximum of 20,000 cells/mL is recommended for 6-well plates and 5,000 cells/mL for 24-well plates.\nAfter 5-7 days, count the number of spheres per well. This can be done either manually, using a microscope equipped with a 10x magnification lens, or using digital image analysis (see step 4).\nCollect the mammospheres of each well separately and centrifuge at 300 x g, for 5 min at 4 °C.",
    "Carefully decant the supernatant and proceed to the mechanical dissociation of the mammospheres using a P200 pipette with filtered tips. Pipette for approximately 100 times and visually inspect the suspension for the presence of large spheroids.\nResuspend in 1 mL of fresh mammosphere medium and count the viable cells. Pool the cells of each sample or condition and repeat steps 3.6-3.10. Record the number of cells plated and the number of spheres and cells counted per well for each passage. Proceed to step 5 for the cumulative growth calculation.\n4. Sphere Enumeration Using Digital Image Analysis (DIA)\nAt the end of each passage, scan the entire surface of all the wells and acquire images of the spheres using a digital camera mounted on a stereoscope. Save the images as .tif files.\nImport the stereoscope images as an Image Sequence using ImageJ14. Set the scale and the type of image to 8-bit.\nDuplicate the stack of images and select Subtract Background from the tab Process on the menu bar. Check the options Light background and Sliding paraboloid and click on the button OK. Process all the images of the stack.\nSelect Adjust and then Threshold from the tab Image of the menu bar. By clicking on Apply, a dialogue window titled Convert Stack to Binary will appear. Select Default as method and Light as background. Check the box Calculate threshold for each image and click on the button OK.\nSelect sequentially the commands Watershed, Open and Erode from the Binary list under the tab Process of the menu bar. Process all images of the stack by clicking on the button Yes of the dialogue box that appears.\nNOTE: These processes allow for visual segmentation of objects that touch, object smoothing and removal of pixels from the edge of the objects.",
    "Select the function Analyze Particles from the menu Analyze. Set the minimum size threshold at 10,000 µm2 and circularity between 0.50 and 1.00. Select the option Ellipses from the Show drop-down menu. Check Summarize, Exclude on edges and In situ Show and click on the button OK. Process all images of the stack.\nVisually inspect the correspondence of the ellipses with spheres and, if needed, correct the particle count accordingly. Sum the counts from all the frames of each well to obtain the total count of mammospheres per well.\n5. Cumulative Growth Curve Calculation\nNOTE: The number of mammospheres counted in each well at the end of each passage (PN) reflects the number of mammosphere-initiating cells seeded at the beginning of PN.\nFor each passage (PN), register the number of plated cells and the number of cells and spheres counted per well. Calculate the sphere size at the end of each passage:\n\tsphere size PN (cells / sphere) = cells counted PN / spheres counted PN\nNOTE: The sphere size at PN is a measure of the proliferative potential of each mammosphere-initiating cell seeded at PN.\nInfer the number of plated spheres by dividing the number of cells plated for PN by the sphere size calculated at the end of the previous passage (PN-1):\n\tspheres plated PN = cells plated PN / sphere size PN-1\nNOTE: By convention, the sphere size is assumed stable during the first passage of the culture (i.e., sphere size P0 = sphere size P1). If multiple wells are used as technical replicates, use the average sphere size at PN-1 as denominator.\nCalculate the cumulative cell and sphere number for each well per passage:\n\tcumulative number PN = (count PN / plated PN) X cumulative number PN-1.",
    "NOTE: By convention, cumulative number P0 = plated P1. If multiple wells are used as technical replicates, calculate the average cumulative number per sample or condition for each passage.\nPlot the data points on a semi-logarithmic scale. Display the passage number (P0 to PN) on the x axis (linear scale) and the cumulative cell or sphere number on the y axis (logarithmic scale).\nFit an exponential trend-line to the data points and calculate the coefficient of determination (R2) to measure the goodness of the fit.\nNOTE: The trend-line fitted to the data points should approximate an exponential curve, as expected for a cell population that grows or dies with a constant rate. R2 takes values between 0 and 1, with values closest to 1 indicating a better fit.\nDepict the equation of the trend-line as a natural exponential function to infer the growth rate (GR) of the culture:\ny = y0 e(GR)x, where y0 is the value of y when x = 0."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}