{
  "id": 8224,
  "origin_website": "Bio",
  "title": "Neutral Comet Assay",
  "procedures": [
    "Prepare agarose solution and slides.At least 24 h before the experiments:Prepare 0.8% solution of Seakem® Agarose in PBS.Pre-coat Super Frost slides by dipping in a vertical jar containing melted agarose, stirred with a magnetic stirrer and kept at 100 °C (Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20130914/20130914080009_0381.jpgFigure 1. Coating of the slides with agarose Drain off the agarose in excess by wiping the back of the slides (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20130914/20130914080022_0485.jpgimgsrc:https://en-cdn.bio-protocol.org/attached/image/20130914/20130914080032_1729.jpgimgsrc:https://en-cdn.bio-protocol.org/attached/image/20130914/20130914080042_3597.jpgFigure 2. Slides coating with agarose. Removing of the agarose on the back of the slides.Let the slides dry and then store at room temperature until use.At least 2 h before the experiments: prepare 0.7% solution of LMP agarose in PBS and place it at 37 °C in a water-bath until use.Prepare cellsThe number of harvested cells can be adjusted according to the size of the cells. Cells could be numbered either by an automated cell counter or a counting chamber (e.g. Malassez chamber).If cells used are adherent, cells must be carefully detached with trypsin/EDTA and isolated before centrifugation and further use.Embed cells in LMP agarose (in a dark room):After cell centrifugation, discard the supernatant and resuspend the pellet of cells (150,000 to 200,000 cells) by gently pipetting with 200 μl of 0.7% LMP agarose.Lay 65 μl of agarose containing the cells on each pre-coated glass slide.Immediately cover with a 24 x 32 mm coverslip.Put the slide on an ice-pack for solidification during 5-10 minutes.Slide off the coverslip to remove it.Finally cover with 80 μl of LMP agarose (top agarose layer) and cover again with a 24 x 32 mm coverslip.Put the slide again on an ice-pack for solidification during 5-10 minutes.Remove the coverslip.Lysis and electrophoresis (in a dark room):Place the slides in lysis solution for at least 1 h at 4 °C.Wash three times for 5 min with the electrophoresis buffer.",
    "Transfer the slides in the electrophoresis tank filled with electrophoresis solution (Figure 3).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20130918/20130918015044_9366.jpgFigure 3. Electrophoresis of the slides. Disposition of the slides in the tank. In this case eight slides are subjected to electrophoresis, four by row.Proceed to electrophoresis at 18 V (0.5 V/cm) during 1 h.Wash in PBS for 2 x 5 min.Dehydration, staining and analysis:Fix the cells with 2 x 10 min washes in absolute ethanol, air-dry for at least 2 hours at room temperature.Add 50 μl ethidium bromide (2 μg/ml in water) on the microscope slide and cover with a 22 x 22 mm coverslip for staining.Analyze the cells: score 50 cells per slide, 2 slides per condition with the fluorescence microscope equipped with a camera and adapted software (Figures 4 and 5).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20130918/20130918015436_2382.jpgFigure 4. Representing analysis of each cella = head lengthb = tail length% tail DNA = fraction of DNA in the tailTail moment = % tail DNA x bComet tail length can be calculated by different ways depending on the authors. Tail moment is a common parameter used to characterize the comet. For this, the fraction of DNA in the tail is evaluated by the fluorescence in the tail and divided by the total fluorescence (in the head and in the tail) to be expressed in percentage. Tail moment is the product of % tail DNA and tail length.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20130918/20130918020709_1111.jpgFigure 5. Images representing nucleus of undamaged cells, negative for the presence of comet (left panel) and nucleus of damaged cells presenting comet (right panel)As a positive control, cells irradiated with ionizing radiations at 20 Gy and examined just after irradiation are a good control as shown in the photographs above."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}