{
  "id": 18498,
  "origin_website": "Jove",
  "title": "A Customizable Approach for the Enzymatic Production and Purification of Diterpenoid Natural Products",
  "procedures": [
    "CAUTION: The protocols described here include the use of hazardous chemicals, sharp objects, electrical devices, hot objects, and other hazards that may result in injury. Appropriate personal protective equipment should be worn, and the appropriate safety procedures, including safety trainings, should be followed.\n1. Preparation of materials and solutions\nPrepare and autoclave lysogeny broth medium (LB) for 30 min: Per 1 L of medium, mix 10 g of tryptone, 5 g of bacterial yeast extract, and 10 g of NaCl and dissolve in 1 L of deionized (DI) water.\nFor 1 L co-expression cultures, prepare and autoclave Terrific Broth (TB) medium for 30 min: In a 2.8 L Erlenmeyer flask mix 12 g of tryptone, 24 g of bacterial yeast extract, and 40 mL of 10% (v/v) glycerol and dissolve in 860 mL of DI water. Prepare and autoclave 1.3 L of 10x phosphate buffer [1.3 L of DI water, 30.03 g of monopotassium phosphate (KH2PO4), and 163.02 g of dipotassium phosphate (K2HPO4)] and add to the above medium.\nPrepare Super Optimal broth with Catabolite repression (SOC) media.\n\t\nPrepare and autoclave for 30 min a solution containing 2% (w/v) tryptone, 0.5% (w/v) bacterial yeast extract, 8.5 mM NaCl, and 2.5 mM KCl.\nAdd sterile MgSO4 and glucose both with a final concentration of 20 mM. Use 1 M NaOH to adjust to pH 7.0. Store the SOC media at -20 °C.\nPrepare 1 L of 1 M sodium pyruvate. Autoclave for 15 min and store at 4 °C.\nPrepare 20 mL of 1 M isopropyl β-D-1-thiogalactopyranoside (IPTG) in sterile DI water. Store 1–2 mL aliquots at -20 °C.\nPrepare infiltration buffer: 10 mM MES (1.952 g) and 10 mM MgCl2 (2.033 g) dissolved in 1 L of DI water. Store at 4 °C.",
    "Prepare and autoclave LB agar for 30 min: Per 100 mL of DI water, add 1 g of tryptone, 0.5 g of bacterial yeast extract, 1 g of NaCl, and 1.5 g of agar. Once LB agar is cool enough to handle the bottle, add antibiotics as required for the desired plasmid combinations. Pour agar plates using petri dishes and store at 4 °C.\n\t\nSee Table 1 for specifications regarding compound production in E. coli and N. benthamiana, respectively. Wrap plates containing rifampicin in foil to prevent degradation upon storage.\ntable:\n﻿0,1,2,3,4,5\n,,,Working concentration (µg/mL),Working concentration (µg/mL),Working concentration (µg/mL)\nAntibiotic,Stock (mg/mL),Solvent,1 plasmid,2 plasmids,3 or 4 plasmids\nCarbenicillin,50,H2O,50,25,20\nChloramphenicol,30,EtOH,30,20,20\nKanamycin,50,H2O,50,25,20\nSpectinomycin,30,H2O,30,25,20\nGentamycin,50,H2O,30,,\nRifampicin,10,MeOH,10,,\nTable 1: Antibiotic concentrations for plasmid co-expression in E. coli or N. benthamiana.\n2. Production of diterpenoid metabolites in E. coli\nNOTE: The protocol described here for producing diterpenoid metabolites in E. coli has been adapted from a previously reported enzyme co-expression platform developed by the group of Dr. Reuben J. Peters (Iowa State University, IA, USA)13,32.\nTransformation of competent cells with plasmid combinations.\nThaw chemically competent E. coli cells on ice (BL21DE3-C41 cells were used in this protocol).\nAdd 1 µL of a 100 ng/µL solution of each construct used for co-expression to 25 µL of competent cells in a 1.5 mL microtube. Do not vortex or mix by pipetting.",
    "NOTE: For optimal expression and activity of TPS and P450 enzymes, several sequence modifications need to be considered. For TPS, removal of the N-terminal plastidial transit peptide is often essential. Specifically, plastidial mono- and di-TPS typically require removal of the predicted transit peptide (using common prediction algorithms37), whereas cytosolic sesqui-TPS can usually be used as full-length genes. With regards to P450s, codon optimization as well as removal or replacement with the leader sequence MAKKTSSKGK of the N-terminal transmembrane domain has proven effective in many cases38,39. In addition, when co-expressing P450 enzymes a cytochrome P450 reductase (CPR) should be included to ensure sufficient P450 activity.\nIncubate the mixture on ice for 30 min. Mix every 10 minutes by gently scraping the tube across a microtube rack.\nPre-incubate SOC media and LB agar plates at 37 °C containing antibiotics as required for the desired combination of constructs.\n\t\tNOTE: Each construct to be co-transformed must have a distinct antibiotic resistance, as well as distinct origins of replication to ensure optimal protein expression.\nHeat shock the cell mixture at 42 °C for 1 minute, and then incubate on ice for at least 2 min.\nAdd 200 µL of warm SOC media.\nShake the cell mixture for 1 h at 37 °C and 200 rpm.\nAdd approximately 10 autoclaved glass beads to the warmed LB agar plate. Add 100 µL of the cell mixture and replace the lid. Shake plate horizontally with the lid on to distribute the cells evenly. Remove the glass beads by tapping them off into a waste container. Alternatively, use other preferred plating methods.",
    "Incubate the LB agar plate at 37 °C overnight with the coated surface face down. The plate with transformed E. coli colonies can be used the following day or stored at 4 °C sealed in paraffin film for up to 2 weeks.\nPreparation of inoculation cultures\nOn the following day, prepare a solution of LB medium with antibiotics required for the transformed plasmid combination using the concentrations provided in Table 1.\nIn a sterile hood, transfer 5 mL of LB medium to a 15 mL sterile glass test tube with a plastic breathable cap. Prepare one small culture tube for each desired large (1 L) culture.\nSelect individual E. coli colonies from the LB agar plate using a pipette tip. Inoculate each tube of LB with an E. coli colony by ejecting one pipette tip containing a selected colony into each tube.\nCap each inoculation culture test tube with a breathable plastic cap. Place the capped E. coli small cultures in a 37 °C shaking incubator for 12–24 h.\nPreparation and induction of co-expression cultures \nOn the following day, add 100 mL of prepared 10x phosphate buffer to 900 mL of prepared TB for a final phosphate buffer concentration of 1x. Add necessary antibiotics with concentrations according to Table 1.\nShake at 140 rpm at 37 °C until warm (approximately 30 min).\nInoculate each flask of media for 1 L cultures with 5 mL of the inoculation culture. Retain the pipette tip used for inoculation culture inoculation in the inoculation culture tube so that, upon extraction with organic solvent in subsequent steps, there are no extracted plastic contaminants.",
    "Incubate with shaking at 200 rpm until the optical density at 600 nm (OD600) reaches 0.6, approximately 3 h. To measure the OD600 with a spectrophotometer, use a mixture of sterile TB with phosphate buffer as a blank.\nAt the desired OD600, set the incubator settings to 16 °C.\nWhen co-expressing P450s, freshly prepare riboflavin and aminolevulinic acid, which are essential for sufficient P450 co-factor production. For every experiment, make 4 g/L riboflavin and 150 g/L aminolevulinic acid. Keep solution wrapped in foil until use, as riboflavin is light sensitive.\nAfter the incubator has reached 16 °C (approximately 30 min), add 1 mL of 1 M IPTG, 1 mL of 4 g/L riboflavin, and 1 mL of 150 g/L aminolevulinic acid to each culture. For diterpenoid production, 25 mL of 1 M sodium pyruvate should be added to each culture to assure sufficient precursor formation.\n\t\tNOTE: All constructs used in this assay were under the same IPTG-inducible promoter. Different promoters can be used as desired.\nIncubate at 16 °C and 140 rpm for 72 h. Add 25 mL of sodium pyruvate each subsequent day after induction if producing diterpenoids. Immediately use cultures are immediately used for separatory funnel extraction of metabolites; do not harvest or store cultures.\n3. Separation and purification of metabolites\nSeparatory funnel extraction of metabolites\n\tNOTE: It is important to use only glassware and glass pipettes when using organic solvents to prevent plasticizer contaminations.\n\t\nIn a fume hood, secure the separatory funnel onto a ring stand. Place a waste beaker underneath the separatory funnel.\nPour 500 mL of 50/50 (v/v) ethyl acetate/hexanes into the separatory funnel.\n\t\tNOTE: Solvent mixture should be adjusted based on the solubility and polarity of the targeted metabolites. Water-miscible solvents should be avoided to ensure suitable phase separation.",
    "Add 500 mL of the E. coli culture to the separatory funnel and place on the glass stopper.\nShake the funnel to mix the culture with the extraction solvent, approximately 5–10x. Frequently de-gas the funnel by opening the spigot while the funnel is held upside down and pointed into the fume hood to release pressure. Repeat the shaking and de-gas procedure 2x.\nPlace the funnel upright in the ring stand and wait until the solvent layer (top) has separated from the aqueous (culture) layer (bottom), approximately 1 min.\n\t\tNOTE: When a large amount of bubbles is observed in the interphase, addition of a small volume of 5–10 mL EtOH can be added to improve phase separation.\nRemove the stopper. Drain the E. coli layer into a waste beaker, retaining the solvent layer in the funnel.\nRepeat the procedure using the remaining 500 mL of E. coli culture and the same 500 mL solvent used for the first extraction.\nDrain the solvent containing the extracted metabolites into a clean flask. Avoid contamination with E. coli culture.\nRotary Evaporation Concentration \nPrepare the rotary evaporation (rotovap) equipment: fill the water bath and set the temperature to 25 °C. For heat sensitive compounds, use a lower temperature setting or add ice to the water bath. Fill the condensing chamber with dry ice and set the rotating speed to 60–80 rpm.\nAdd approximately 700 mL of extracted metabolites to a 1 L evaporating flask, attach to the rotovap, and lower into the water bath. Turn the water bath heater on and set to 25 °C.\nStart rotation of the evaporating flask, turn on the vacuum system, and gradually increase the suction to avoid rapid boiling of the metabolite solution into the waste flask. Evaporated solvent should begin condensing and dripping into the condensate-collecting (waste) flask.",
    "When only a few mL of the metabolite solution remains in the evaporating flask, stop rotations and turn off the vacuum system. Raise the evaporating flask and depressurize by closing the vacuum line. Retain concentrated metabolite solution remaining in the evaporating flask. Dispose of the waste in the waste flask.\nContinue rotary evaporation by adding up to 700 mL of additional extracted metabolite solution to the evaporating flask. Repeat process until all of the extracted metabolite solution has been concentrated.\nRemove the concentrated metabolites from the evaporating flask by transferring with a glass pipette to new test tube. Rinse evaporating flask with 5 mL of 50/50 (v/v) ethyl acetate/hexanes or desired solvent mixture two times, transferring the rinsing solution to the test tube.\nStore concentrated metabolites at -20 °C or -80 °C (depending on product stability) until further use.\nSilica Column Purification \nPrepare glassware by rinsing a 1 L beaker, glass funnel, 50 mL test tubes, and 3.2 L chromatography column (equipped with a glass fret) once with hexane and once with ethyl acetate. Label the 50 mL test tubes, which will be used to collect fractions.\nAdd 2 L of silica gel (230–400 mesh, grade 60) to a 3.2 L chromatography column with a 2 L reservoir capacity and a fritted disk, then load sand to form a 5 cm layer at the top of the column.",
    "Prepare the column for chromatography by flushing it thoroughly with 2 L of hexane. At all times, there should be a thin (~0.5 cm) layer of the solvent liquid above the sand layer of the column to ensure the column does not dry out or acquire air pockets. A glass inlet adaptor connected to an air hose can be used to gently increase the flow rate through the column rather than gravity alone.\nLoad the concentrated metabolite extract (see section 3.2) onto the column. Rinse the bottle that contained the sample 3x with hexane and add to the column to ensure all of the sample has been transferred.\nUsing the following gradient, load 100 mL at a time and collect 50 mL fractions in labeled test tubes: 100% hexanes 3x, 10% (v/v) ethyl acetate in hexanes 3x, 12.5% (v/v) ethyl acetate in hexanes 3x, 15% (v/v) ethyl acetate in hexanes 3x, 20% (v/v) ethyl acetate in hexanes 3x, 40% (v/v) ethyl acetate in hexanes 3x, 60% (v/v) ethyl acetate in hexanes 3x, and 100% ethyl acetate 4x.\n\t\tNOTE: Gradient should be adjusted based on compound size and polarities and desired separation.\nUsing a glass pipette, transfer 1 mL from each fraction into a labeled GC vial. Analyze each sample via GC-MS to determine which fractions contain the desired metabolites and their level of purity.\n\t\tNOTE: The GC-MS method suitable for the metabolites produced in this method has been described in Mafu et al. 201839. In brief, all analyses were performed on an GC with an XL MS detector using an HP-5MS column (see Table of Materials), a sample volume of 1 µL, and oven temperature ramp from 50 °C to 300 °C at 20 °C min-1.",
    "After determining which fractions contain the compound(s) of interest, combine all fractions that contain the same compound. Properly dispose of fractions that do not contain any compounds into a waste container. Repeat the rotary evaporation procedure if necessary to concentrate the purified metabolites.\nIf additional purification is necessary, use (semi-)preparative HPLC to improve product purity. HPLC protocols should be adapted based on individual equipment specifications and compounds of interest.\n\t\t\nResuspend dried silica chromatography samples in 1 mL hexane (diterpene hydrocarbons) or acetonitrile (oxygenated diterpenoids), and filter through a filter syringe to prevent contamination with small particles.\nFor non-polar diterpenoids, use a CN column (see Table of Materials) with a recommended flow rate of 1 mL/min and a hexane:ethyl acetate gradient, with fractions collected every 1 minute.\nFor polar diterpenoids, use a C18 column (see Table of Materials) with a recommended flow rate of 3 mL/min and an acetonitrile:water gradient, with fractions collected every 1 minute.\nDry all HPLC purified fractions under a nitrogen stream and resuspend in 1 mL hexane before GC-MS analysis to assess product abundance and purity.\n4. Production of diterpenoid metabolites using N. benthamiana\nNOTE: The protocol described here for producing diterpenoid metabolites in N. benthamiana has been adapted from previously reported studies35,36,40,41. The below protocol is specific to syringe-infiltration of N. benthamiana leaves. Other infiltration methods, such as vacuum infiltration are equally suitable. Binary T-DNA vector systems, such as pCAMBIA130035Su (pLIFE33) or pEAQ-HT40,41,42, that enable propagation in E. coli and A. tumefaciens and gene expression in plant hosts are suitable for this protocol.\nPlanting Nicotiana benthamiana\nFill one 750 mL pot with potting soil and water the pot. Add ~20 tobacco seed and gently tap with finger so that they are in the soil. Do not cover with soil.",
    "NOTE: Seeds can be generated through self-pollination for seed propagation. Seeds for this experiment were obtained from the UC Davis Department of Plant Biology, and are publicly available through USDA germplasm repository (https://npgsweb.ars-grin.gov/gringlobal/accessiondetail.aspx?id=1450450).\nLeave pot in a growth chamber with the following conditions, watering every other day to ensure the soil does not dry out. Grow plants at 26 °C and 60% humidity with 16:8 h day:night cycle for all steps in this protocol.\nAfter 1 week, fill ~20 pots with potting soil and water the pots. Using forceps, grasp a tobacco seedling by the stem and gently remove from the source pot, placing one seedling in each new pot and carefully burring the roots. Do not damage the leaves or roots.\nWater the plants every other day by placing water in the tray the pots are in (also called “bottom watering”). Every fourth watering, include generic fertilizer in the water according to package instructions.\nFreeze-thaw transformation of Agrobacterium tumefaciens strain GV3101 competent cells\nThaw Agrobacterium tumefaciens strain GV3101 (or other preferred strain) competent cells on ice (~1 h). Pre-chill 0.2 mL microcentrifuge tubes on ice. Warm SOC media at 28 °C.\nGently mix cells with the pipet tip (do NOT pipet up and down) and aliquot 15 µL of cells for each transformation into the chilled 1.5 mL microtubes.\nAdd 1-5 µL (~400 ng) of DNA to each tube of competent cells and mix gently by scraping tube along a tube rack.\n\t\tNOTE: Desired constructs need not have different antibiotic resistances because they are each being transformed separately and will be mixed before infiltration.\nPlace microtubes in liquid nitrogen for 5 min.\nRemove microtubes from liquid nitrogen and place the tubes on the room-temp rack. Thaw tubes for 5 min in 37 °C incubator.",
    "Add 250 µL of the pre-warmed (28 °C) SOC to each microtube. Shake at 28–30 °C, 225 rpm, for 3 h.\nPlate 50 µL of transformed cells onto LB agar plates containing the necessary antibiotics described in Table 1 using sterile glass beads, as described in step 2.1.8.\nIncubate plates inverted at 28–30 °C for 48 h. Growth within the 1st day of incubation may be a sign of contamination. Transformed A. tumifaciens can be used following the 2-day incubation or stored at 4 °C sealed in paraffin film for up to 2 weeks.\nAgrobacterium-mediated transient enzyme co-expression in Nicotiana benthamiana\nPrune 4-week-old Nicotiana benthamiana plants 2 days before infiltration by removing lower leaves. Leave 4 uppermost leaves. Water the plants. Do not water the plants 24 h before infiltration in order to allow for open stomata and easier infiltration.\nAdd 10 mL of LB with working concentrations of the appropriate antibiotics for chosen constructs and Agrobacterium strain (described in Table 1) to a 50 mL sterile glass test tube with a foil lid.\nInoculate using a pipette tip to swab a single colony of transformed Agrobacterium and eject the tip into the LB media. Each Agrobacterium transformant should have at least 2 small cultures.\nIncubate overnight at 28 °C and 220 rpm.\nMeasure optical density at 600 nm (OD600) of the overnight cultures using a spectrophotometer. Dilute the overnight cultures to an OD600 of 1.\n\t\tNOTE: Optimal OD600 values may vary when using other Agrobacterium strains.\nDistribute 10 mL of diluted overnight culture into 50 mL conical tubes.\nHarvest the bacteria by centrifugation at 3500 rpm for 15 min at room temp. Pour off and discard the supernatant.",
    "Re-suspend the cultures in 10 mL infiltration buffer by gently shaking the tube and rolling on a tube rack. The OD600 should equal 1 for each construct.\nGenerate the combinations desired for infiltrations by combining equal volumes of each transformed cell line. The OD600 should equal 1 for each infiltration. Estimate 5 mL of infiltration solution per leaf, 2 leaves per plant.\nAttach tubes horizontally to a rocker and rock gently for 2 h at room temperature.\nInfiltrate ~2 leaves per N. benthamiana plant using approximately 5 mL of infiltration mixture per leaf. Infiltrate healthy leaves with a needleless syringe on the underside of the leaves while exerting a counter-pressure with a finger on the top side of the leaf to ensure infiltration solution suffuses the leaf tissue.\nMark all infiltrated leaves with a black marker or other indicator. Place infiltrated plants in the growth chamber for 5 days. Keep plants well-watered.\n\t\tNOTE: An incubation time of five days has proven sufficient for reaching diterpenoid levels sufficient for most downstream analyses, while maintaining time-efficiency of product formation. Longer incubation periods can be tested, where higher product amounts are required.\nMetabolite extraction and purification from transformed Nicotiana benthamiana\nHarvest infiltrated leaves from plants by clipping them from the plant. Add ~100 mL of liquid nitrogen and a single leaf to a mortar, then grind using a mortar and pestle or tissue mill until obtaining a fine powder.\nAdd powdered tissue to a GC-MS vial to the 500 µL demarcation. Add 1.5 mL of 50/50 (v/v) ethyl acetate/hexane or desired solvent mixture to the vial and cap tightly.",
    "For expressions that have been tested to provide the desired products, pool ground tissue into a larger flask or test tube, then add ~2x the amount of solvent than tissue volume and shake overnight. Proceed to step 4.4.5 for purification.\nPlace all vials in a microtube rack and tape down tightly to secure. Extract under vigorous shaking overnight at room temperature.\nTransfer 400 µL of extract and 600 µL of hexane into a fresh GC-MS vial. Do not aliquot any leaf tissue. Analyze samples using GC-MS using the method described in step 3.3.6.1.\nAfter analysis via GC-MS for presence of desired metabolites, pool leaf extracts together and proceed through rotary evaporation, silica column chromatography, and HPLC to obtain pure compounds as described in sections 3.2 and 3.3."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}