{
  "id": 13593,
  "origin_website": "Jove",
  "title": "Pluripotent Stem Cell Derived Cardiac Cells for Myocardial Repair",
  "procedures": [
    "All experimental procedures are performed in accordance with the Animal Guidelines of the University of Alabama at Birmingham.\n1. Differentiating hiPSCs into hiPSC-CMs\nCoat the wells of a 6-well plate with pre-cooled growth-factor-reduced gelatinous protein mixture at 4 °C for overnight. Aspirate the gelatinous protein mixture before use. Seed the hiPSCs onto the pre-coated plates, and culture the cells (1 x 105 cell per well) at 5% CO2 and 37 °C in mTeSR1 medium supplement with 10 µM ROCK inhibitor.\nRefresh the medium daily until the cells reach 90% confluence; then, add growth-factor-reduced gelatinous protein mixture to the medium (0.5 mg gelatinous protein mixture per 6-well plate, 2 ml medium per well), and culture the cells for 5% CO2 and 37 °C two more days.\n\t\nTo replace the medium, gently suck out the medium from the petri dish via vacuum without touching the cells, and add new medium using a transfer pipette.\nInitiate differentiation by replacing the medium with RPMI1640 medium supplemented with growth-factor-reduced gelatinous protein mixture, B27 without insulin, and 100 ng/ml Activin A; culture the cells at 5% CO2 and 37 °C for 24 hr.\nReplace the medium with RPMI1640 medium that has been supplemented with B27 without insulin, 10 ng/ml bone morphogenic protein 4 (BMP-4), and 10 ng/ml basic fibroblast growth factor (bFGF); culture the cells at 5% CO2 and 37 °C for 96 hr.\nReplace the medium with RPMI1640 medium supplemented with B27 and continue culture the cells at 5% CO2 and 37 °C; refresh the medium every 3 days.\nObserve clusters of contracting cells under the microscope ~3 days after initiating differentiation. Collect the clusters ~7 days after first observing contractions and wash them in Hanks Balanced Salt Solution.",
    "Dissociate the clustered-cells in the plate by incubating them in Hanks buffer containing 100 U/ml collagenase IV for 10 min at 37 ºC with gentle shaking; then, add 0.25% trypsin in ethylenediaminetetraacetic acid (EDTA) for 5 min.\nNeutralize the enzyme solution with 10% fetal bovine serum in RPMI/B27 medium and then resuspend the cells in RPMI/B27 medium.\nCount the number of cells by hemocytometer. Culture the cells on 10 cm dishes at 5% CO2 and 37 °C for at least 3 hr, which will allow the non-cardiomyocyte cells to adhere to the surface of the culture dish.\nCollect the cell suspension, which contains the hiPSC-CMs, and maintain the cells (around 1 x 106 cells per 10 cm dish) by culturing them on a gelatinous protein mixture -coated surface.\n2. Differentiating hiPSCs into hiPSC-ECs\nDissociate the hiPSC population into single cells by incubating them with chelating agent at 5% CO2 and 37 °C for 5 min. Transfer the cells to a 15 ml centrifuge tube containing fresh mTeSR1 medium.\nSpin down the cells at 200 x g for 5 min. Resuspend the cells in mTeSR1 medium supplemented with 10 µM ROCK inhibitor. Determine the cell density with a hemocytometer.\nAdd 250 µl of 20 NIH units/ml thrombin solution to one well of a 24-well plate.\nAdd 1 x 106 hiPSCs to 250 µl of a 12.5 mg/ml fibrinogen solution. And add the 250 µl of cell-containing fibrinogen solution to the thrombin-loaded well. Observe the mixture solidify to form a hiPSC-containing fibrin scaffold within min.",
    "Transfer the solidified, cell-containing scaffolds into the wells of a 6-well plate with the cover glass forceps, and initiate differentiation by culturing the scaffolds in 2 ml EBM2 medium supplemented with 2% B27 without insulin, activin-A (50 ng/ml), and BMP-4 (25 ng/ml) for 24 hr at 5% CO2 and 37 °C.\n\t\nReplace the medium by gently sucking out the old medium via vacuum without touching the cells. Add new EBM2 medium supplemented with B27 without insulin, vascular endothelial growth factor (VEGF, 50 ng/ml), erythropoietin (EPO, 100 ng/ml), and transforming growth factor β1 (TGFβ1, 10 ng/ml), and culture the scaffolds at 5% CO2 and 37 °C for 48 hr.\nRefresh the medium and culture the scaffolds at 5% CO2 and 37 °C for another 48 hr; then, release the cells from the scaffold by adding 200 U collagenase IV (100 U/ml) to the medium.\nSpin down the cells after they are released. Replace the medium with 2 ml EGM2-MV medium supplemented with 2% of B27, VEGF-A (50 ng/ml), and SB-431542 (10 µM); refresh the medium every two days.\nApproximately 10 days later (i.e., on ~Day 14 after differentiation was initiated), dissociate the cells with 100 U/ml collagenase IV, isolate hiPSC-ECs from the population of differentiated cells via flow-cytometry analyses for the expression of EC-specific marker proteins (e.g., CD31, CD144)3.\nExpand the isolated hiPSC-ECs via an established protocol3.\n3. Differentiating hiPSCs into hiPSC-SMCs\nSeed the hiPSCs onto plates that have been coated with gelatinous protein mixture, and culture the cells in mTeSR1 medium at 5% CO2 and 37 °C, with daily medium changes, until confluent (~2 days).\nInitiate differentiation into mesodermal-lineage cells by culturing the cells with CHIR99021 (5 µM) and BMP-4 (10 ng/ml) in RPMI1640 medium and 2% B27 plus insulin for 3 days.",
    "To produce hiPSC-SMCs with a predominantly synthetic phenotype:\nCulture the cells with VEGF-A (25 ng/ml), fibroblast growth factor β (FGFβ, 5 ng/ml) in RPMI1640 medium, and 2% B27 minus insulin at 5% CO2 and 37 °C for 4 days.\nCulture the cells in VEGF-A (25 ng/ml), FGFβ (5 ng/ml) in RPMI1640 medium, and 2% B27 plus insulin at 5% CO2 and 37 °C for 2 days.\nCulture the cells in platelet-derived growth factor β (PDGFβ, 10 ng/ml), TGFβ (3 ng/ml) in RPMI1640, and 2% B27 plus insulin at 5% CO2 and 37 °C for 4 days.\nTo produce hiPSC-SMCs with a predominantly contractile phenotype:\nCulture the cells for 4 days with VEGF-A (25 ng/ml) and FGFβ (5 ng/ml) in RPMI1640 and 2% B27 minus insulin.\nCulture the cells for 7 days with PDGFβ (5 ng/ml) and TGFβ (2.5 ng/ml) in RPMI1640 and 2% B27 plus insulin.\nPurify the final hiPSC-SMC populations by culturing the cells in lactate (4 mM) containing RPMI1640 metabolic medium for ~6 days.\n4. Creating the IGF-containing Microspheres\nHeat olive oil to 45 °C in a water bath.\nHeat 5 ml of 10% gelatin solution to 50 °C.\nAdd the gelatin to the olive oil, stir, and then rapidly cool to 5 °C by adding ice to the water bath.\nTwenty-five minutes later, add chilled (4 °C) acetone to the olive oil to induce microsphere formation.\nMaintain the temperature at 5 °C for 1 hr; then, collect the microspheres, wash them 5 times with pre-cooled acetone to remove the olive oil, and allow them to air-dry at 4 °C.\nResuspend the microspheres in a solution of 70% ethanol and 0.25% glutaraldehyde overnight at 4 °C to induce cross-linking, and then neutralize the mixture with 100 mM glycine.",
    "Load IGF into the microspheres by mixing 5 mg microspheres with 15 µl distilled H2O containing 5 µg IGF and 0.1% bovine serum albumin for 30 min.\n5. Creating the Patch over the Site of Injury and Injecting the Cells\nSuspend the hiPSC-derived CMs (2 million), SMCs (1 million), and ECs (1 million) together in 1 ml Minimum Essential Medium (MEM).\nSuspend 5 mg of microspheres in 1 ml fibrinogen solution (25 mg/ml).\nFill one syringe with the cell-containing solution, another syringe with the fibrinogen/microsphere solution, and a third syringe with 1 ml of thrombin solution (80 NIH units/ml, supplemented with 2 µl 400 mM CaCl2 and 200 mM ε-aminocaproic acid).\nSurgically induce myocardial infarction in swine heart via ligation of left anterior descending coronary artery as described before2.\n\tNOTE: In brief, female Yorkshire swine (~13 kg, 45 days of age) are sedated with intramuscular injection of Telazol/Xylazine (4.4 mg/kg), and intubated under general anesthesia with isoflurane (0.5-5%). A 4th intercostal thoracotomy is performed and left anterior descending coronary artery is exposed. The coronary artery is occluded by a ligature for 60 min and then the ligature is removed. Immediate electrical defibrillation is performed in the case of ventricular fibrillation.\nPosition a sterile plastic ring (~2.5 cm) on the epicardium of the infarcted region of swine hearts, and then simultaneously inject the microsphere/fibrinogen and thrombin solutions into the ring.\nAllow the mixture to solidify (~30 sec), and then insert the needle of the cell-containing syringe through the solidified mixture into the infarcted myocardium and inject the cells. Close the muscle layers, subcutaneous tissue, and the chest wall with 3-0 or 2-0 Monocryl suture depending on animal size. Buprenorphine 0.01-0.02 mg/kg intramuscular injection every 8 hours will be used to control pain for the first 3 days after surgery.",
    "Evaluate cardiac function using a cardiac magnetic resonance imaging (MRI) before surgical procedure, one week and four weeks after the surgical procedure2,3,4. After the final MRI studies, sacrifice the animal and process their hearts for histology and molecular analysis2,3,4.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}