{
  "id": 9128,
  "origin_website": "Jove",
  "title": "Sequential Extraction of Soluble and Insoluble Alpha-Synuclein from Parkinsonian Brains",
  "procedures": [
    "Post-mortem brain tissue was donated to Queen Square Brain Bank for neurological disorders, University College London, Institute of Neurology using ethically approved protocols and stored for research under a license issued by the human tissue authority (HTA) UK (no. 12198). See list of cases used for this protocol (Table 1).\n1. Preparation of Buffers\nPrepare 1X TBS (Tris-buffered saline) buffer:\n\t\nPrepare 10X TBS as stock solution with 500 mM Tris-HCl pH 7.4 and 1,500 mM NaCl.\n\t\t\nWeigh out 60.5 g Tris-Cl pH 7.6 and 87.6 g of NaCl in 800 ml of high purity water. Adjust pH with 1 M HCl and make the final stock volume to 1 L.\nPrepare the final concentration of 1X TBS by diluting the stock 10 times in distilled water.\nAdd protease inhibitors (PI), (1 tablet per 50 ml buffer) and Phos-stop phosphatase inhibitor tablets (1 tablet per 10 ml of buffer) to abrogate the effects of non-specific enzymatic actions of proteases and phosphatases.\n\t\tNote: Here we have used the enzyme inhibitor tablets from Roche but equally other commercially available inhibitors can be used according to the manufacturer's instructions.\nPrepare TBS-SDS buffer by adding 5% w/v Sodium dodecyl sulphate (SDS) to 1X TBS (pH 7.4) buffer. Heat the solution to 60 °C with constant stirring using a magnetic stirrer to solubilize SDS.\nPrepare TBS-SDS-Urea buffer by adding urea to a final concentration of 8 M w/v to 1X TBS-SDS buffer (pH 7.4). Heat the solution to 60 °C with constant stirring on a magnetic stirrer to dissolve urea.\n2. Sample Homogenization and Differential Ultracentrifugation",
    "Note: The following part of the work involves handling of human brain tissue according to the rules of HTA UK. Local standard operating procedures are followed at all times. Brain samples are dissected from frozen brain blocks and tissue material homogenized in a microcabinet maintained at negative pressure. Disposable gowns gloves, face-masks, over-shoe protectors and safety goggles are worn throughout the procedure. Human tissue waste is discarded after autoclaving at 121 °C for 20 min for safe disposal. Sharps (scalpel blades) are disposed in an appropriate sharps container for containment and safe disposal.\nTake a chunk of frozen human tissue (approximately 0.5 g in weight from the basal ganglia region) and rapidly mince into small fragments (approximately 1 mm2) on ice using a small petri-dish and a sterile scalpel blade. Use a separate petri-dish and scalpel blade for each sample. Collect the minced tissue in a 15 ml tube and add 10 volumes of ice-cold 1XTBS buffer to the tube.\nHomogenize the samples using a mechanical homogenizer at 20,000 rpm for 10 sec. Cool on ice for 2 min. Repeat this step three times.\n\tNote: This is done so that the samples are not heated up while homogenizing.\nClarify by centrifugation at 1,000 x g for 5 min at 4 °C. Discard pellet of non-homogenized material.\nTake supernatant (crude homogenate), add to polycarbonate centrifuge tubes (size of tube depends on rotor size) and balance carefully. Centrifuge at 100,000 x g for 1 hr at 4 °C.\nRetain supernatant as this is the TBS-soluble fraction.\nWash pellet twice in five volumes of 1X TBS buffer and centrifuge each time at 100,000 x g for 15 min at 4 °C. Discard the supernatants.",
    "Resuspend the final pellet by sonicating the pellet for 10 sec at 20 KHz in approximately 5 volumes of 1X TBS-SDS at RT.\n\t\tNote: Before addition of the SDS containing buffer samples should be brought at 10 °C to avoid SDS precipitation.\nUltracentrifuge at 100,000 x g for 30 min at 25 °C.\nRetain supernatant as this is the SDS soluble fraction.\n\t\nWash pellet twice in 5 volumes of 1X TBS-SDS buffer at RT. Centrifuge each time at 100,000 x g for 15 min at 25 °C.\nSolubilize the final pellet in 50 μl of 1X TBS-SDS-UREA buffer using a sonicator set at 20 KHz for 10 sec to attain complete solubilization; this is termed the urea soluble fraction.\nAssay each fraction for total protein content using a commercial protein assay kit according to manufacturer's protocol. Dilute TBS-SDS-Urea samples 1:1 with 1X TBS buffer to allow compatibility with protein assay reagents. Freeze samples in small aliquots (20 μl) at -80 °C to reduce freeze-thaw cycles.\n\tNote: Adding 10% glycerol to samples is recommended for long-term storage at -80 °C.\n3. Immunoblotting of Samples and Analyzing Results\nRun samples from TBS, TBS-SDS and TBS-SDS-Urea extracts on 10-well 4-12% Bis-Tris polyacrylamide gel with MOPS as running buffer using standard techniques. See Gallagher and Chakravarti (2008)29 for a detailed western blot protocol.\nLoad 10 µg of protein from each sample onto each lane along with a molecular weight marker for TBS and SDS and urea fractions.\nRun gel at 200 V for 1 hr or until the blue dye from loading buffer has reached the bottom of the gel.",
    "Transfer proteins from gels electrophoretically onto nylon membranes28, pre-wetted first in 100% methanol and then into transfer buffer containing 20% methanol. Provide an identification mark on the blot to determine the protein side and the orientation of the Molecular-Weight size markers.\n\t\nSandwich the gel with the membrane alongside wet filter paper. Correct placement of membrane is crucial with the membrane between the gel and the anode. Perform the transfer for 2 hr at 40 V.\nMake up 1X PBS-tween (1X PBS-T) buffer: Dissolve 1 tablet of PBS in 200 ml water to yield 0.01 M phosphate buffer, 0.0027 M potassium chloride and 0.137 M sodium chloride, pH 7.4.\nBlock the membrane in 5% BSA solution in 1X PBS-T for 30 min with shaking at 70 rpm. This prevents non-specific binding of primary antibody to the membrane.\nProbe the protein blot with 6 ml of α-syn primary antibody Syn-1 (BD Biosciences; mouse monoclonal antibody) at 1:750 dilution (O/N at 4 °C) followed by a series of washes with 1X PBS-T (3 x 5 min each time)28.\nIncubate the blot with the appropriate HRP conjugated secondary antibody at 1:2,000 dilution for 30 min. Perform a series of washes (3 x 5 min each time) with 1X PBS-T.\n\t\nImmerse blots in enhanced chemiluminescence solution for 15 sec in a dark room. Cover blots with a cling film and place autoradiography films against the blot with protein side up in a light-proof cassette to capture the appropriate signals (appropriate size bands).\nDevelop autoradiography films in an automated developer.\n\t\tNote: Blots can also be developed manually using developer and fixer from a commercial source in case an automated developer machine is not available.",
    "Incubate the western blot with 6 ml of western blot stripping buffer for 10 min with constant shaking to strip the blot of α-syn antibody signal. Follow steps 3.43 through to 3.6.2 using beta-actin primary antibody (Mouse monoclonal) at 1: 8,000 dilution.\nScan and convert the final image into a Tiff image and measure densities using NIH ImageJ for quantitation purposes (a free downloadable software).\n\tNote: The software allows reading of densities of relative area of interest (the appropriate size bands) and the data can be expressed either as a ratio of α-syn density / β-actin (a house-keeping gene) as arbitrary units or on its own when a house keeping gene is not valid (as in the case of urea-soluble samples)."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}