{
  "id": 9166,
  "origin_website": "Jove",
  "title": "Observation of the Ciliary Movement of Choroid Plexus Epithelial Cells Ex Vivo",
  "procedures": [
    "The protocols and use of experimental animals were approved by the institutional animal care and use committees at the University of Yamanashi and Waseda University. Animal care was performed in accordance with institutional guidelines.\n1. CPEC Preparation\nPrepare the following apparatuses and materials: a stereo microscope, preferably capable of transmitting illumination from the bottom; a pair of watchmaker forceps (Dumont #3 or #4), flame-sterilized, straight operating scissors, flame-sterilized; two sterile 10 cm plastic dishes containing 20 ml ice-cold Leibovitz L-15 medium; 35 mm glass-bottom dishes containing 2 ml RT Leibovitz L-15 medium; a 100 ml beaker containing 70% ethanol; neonatal mouse pups.\nBriefly immerse a neonatal mouse in 70% ethanol and euthanize quickly by decapitation using the operating scissors.\nPlace the head immediately in ice-cold Leibovitz L-15 medium in the sterile 10 cm dish.\nRemove the skin from the calvaria using the pair of watchmaker forceps, cut open the skull to expose the brain, and then cut the cranial nerves to isolate the whole brain.\nTransfer the brain to a new dish containing ice-cold Leibovitz L-15 medium and observe under the stereo microscope, making sure that the brain is completely immersed in the medium.\nSet the dorsal aspect of the brain facing up, and orient the brain so that the olfactory bulbs reside at the three o’clock position (for right-handed persons). Hold the brain gently with the forceps in the left hand.\nUsing the fine dissection forceps (Dumont #3 or #4) in the right hand, cut the corpus callosum and underneath the parenchyma connecting the cerebral hemispheres, along the longitudinal fissure of the cerebrum.\nGently push the cerebral hemispheres away to the lateral sides and expose the transverse cerebral fissure.\nSeparate the hemispheres by pinching out the parenchyma between the hemisphere and thalamus.",
    "Gently pull out the lateral ventricular choroid plexus that is attached to the lateral side of the hippocampus by the lamina affixa.\nTransfer the isolated choroid plexus to the 35 mm glass-bottom dish containing fresh Leibovitz L-15 medium, and overlay a weight (Materials List) gently to hold the tissue in place.\n2. Live Imaging of CPEC Cilia\nConfirm proper ultraviolet (UV) and inferred (IR) cut filter(s) to block light shorter than 400 nm and longer than 700 nm, and that neutral density (ND) filters (25% and 6%) are inserted in the light path of the inverted microscope.\nAdjust the focus of the objective lens roughly by eye, and then adjust the condenser so that the center and focus to conform to the Köhler illumination. Insert an appropriate differential interference contrast (DIC) prism, a DIC element, as well as analyzer and polarizer elements in the light path to conform to the DIC optics.\nAdjust the contrast of view by the DIC prism position so that the structure of the tissue surface is most recognizable. If all cilia of the target cells are motile, a clear view of motile cilia cannot be obtained by eye because of their movement.\nChange the light path to the video camera, and remove the ND filters to increase the light power.\nUse the camera in focusing mode to adjust the field of view and focus. During focusing, in which video images are displayed at real-time on the monitor, a clear view of motile cilia is not available.\nUse the camera at 200 Hz with an exposure time of 0.1 msec for the desired period (seconds to minutes). After acquisition of the image stack, single frames will display clear ciliary structures. If ciliary edges are blurred, increase the frame rate or use a shorter exposure time.",
    "Record the motion of CPEC cilia within 25–60 min after euthanasia in Leibovitz L-15 medium.\n3. Analysis of Ciliary Motion\nManually track beating patterns of each cilium on the computer monitor. Mark ciliary tip positions in each frame with the mouse pointer, which are assembled for trajectory information of each cilium. Either analyze the trajectory information using the same software or export to other more general applications for further analysis. The efficiency of this analysis step is described in the Discussion.\nClassify the trajectories into two modes of motion, back-and-forth or rotational, by eye.\nCalculate the ciliary beating frequency (CBF) using the following formula: [CBF = (number of frames per second)/(average number of frames for a single beat)]14, which can be obtained from a ciliary tip motion diagram (Figure 3). Repeat this calculation for multiple ciliary beating cycles, because other cilia on the same cell can interfere with the motion of each cilium, resulting in irregularity.\nTo analyze the angular uniformity of the ciliary beating axes within a single cell, define the beating angle θ for each trajectory (Figure 4). For back-and-forth trajectories, fit the positions of the cilia tip to a straight line, and define θ as the angle the line makes with x-axis. For rotational trajectories, fit the positions to an ellipse, and define θ as the angle the major axis of the ellipse makes with x-axis. Details of the fitting are described in the Representative Results section.\nFor quantitative description of each trajectory, calculate generalized aspect ratio AR. Briefly, rotate the trajectory by -θ and define AR as the ratio between the widths of the distribution along x- and y-axes (Figure 4B). Details are shown in the Representative Results section, and the interpretation, significance, and the limitation of the parameter are described in the Discussion.",
    "4. Sample Preparation for SEM\nNote: SEM is an important method to evaluate the status of cilia on CPECs in a comprehensive manner. To prepare specimens for SEM, a standard procedure reported previously15 is employed with slight modifications.\nBefore dissecting the tissue from the brain, prepare the fixative in a 5 ml glass vial with a polyethylene cap. The fixative consists of 2% paraformaldehyde, 2.5% glutaraldehyde (half Karnovsky’s solution16) in 0.1 M phosphate buffer, pH 7.4.\nDissect out the tissue from the brain as described in step 1.\nBriefly rinse the isolated tissue with Hank’s balanced salt solution (HBSS) in a new dish and then fix the tissue in the fixative in the glass vial for 1 hr at room temperature. Use disposable transfer pipettes and handle the specimens gently. After rinsing in HBSS, the tissue becomes sticky.\n\t\nTo transfer the specimens into the fixative solution, slowly expel a small amount of solution containing the tissue from the transfer pipette as a droplet and add to the fixative.\nAfter fixation, discard the fixative and rinse the tissue with phosphate buffer three times.\nImmerse the tissue in a 10% sucrose solution to wash out the remaining aldehydes. To ensure complete elimination of aldehydes, immerse the samples in the solution for 10 min and then repeat twice with fresh 10% sucrose. This step is important to achieve proper post-fixation in subsequent steps.\nImmerse the tissue in a solution of 1% osmium tetroxide in phosphate buffer for 30 min and then place on ice for post-fixation. Judge the degree of osmification by the sample color: when aldehydes are completely removed, the sample is black.\nWash the post-fixed tissue samples extensively with double distilled water several times.",
    "Dehydrate the samples by immersion in graded concentrations of ethanol, usually 65%, 75%, 85%, 95%, 99%, and 100%, for 10 min each. Obtain anhydrous ethanol by placing molecular sieves into 99.5% ethanol from a newly purchased bottle. Repeat dehydration with anhydrous ethanol three times.\nPlace the dehydrated samples into isoamyl acetate, a substitution reagent for critical point drying, for 10 min. Repeat this step twice. This reagent evaporates rapidly and the sample can become dry, resulting in destruction by surface tension. Therefore, do not dry the sample completely.\nAfter the final exchange of isoamyl acetate, remove most of the solvent, immediately wrap the open glass vial with aluminum foil, and place the vial on dry ice. Using a needle or fine forceps, make several holes in the foil covering the mouth of the vial, so that liquid carbon dioxide flows easily into the vial in the critical point dryer. Proceed to the next step as quickly as possible.\nIn this step, minimize the carryover of isoamyl acetate into the chamber of the dryer, but do not let the sample dry out completely before critical point drying. In addition, do not leave the sample on dry ice for an unnecessarily long time to avoid the formation of frost on the vial.\nTransfer the foil-wrapped glass vials containing the tissue samples into the critical point dryer that ensures the surface structure of the tissue remains intact while removing water contained in the tissue. Detailed information on operating the critical point dryer can be obtained from the manufacturer’s instructions.\nHandle the samples carefully using a toothpick to minimize mechanical damage. The resulting dried tissue samples are fragile. Mount the samples on metal stubs and coat with gold-palladium using an ion sputter.\n5. Observation by SEM",
    "Observe by SEM and record images with a digital camera equipped to scanning electron microscope.\nTransfer digital image data to a PC for analysis.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}