{
  "id": 7380,
  "origin_website": "Bio",
  "title": "Isolation of Primary Cytotrophoblasts From Human Placenta at Term",
  "procedures": [
    "See the video 1 joined to this protocol to get a complete overview of the procedure.<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. How to isolate of primary cytotrophoblasts from human placenta at term: an overview of the procedure accompanied by Summer vibes Discontinuous Percoll Gradient PreparationPrepare all the solutions and the gradient under a laminar flow hood.Prepare one solution of 90% Percoll by mixing 19.8 ml of stock Percoll (100%) with 2.2 ml of 10× HBSS.Prepare the following dilutions in 15 ml tubes as indicated in Table 1. Briefly centrifuge the solutions and store them at 4°C. The Percoll dilutions can be prepared several days before the isolation procedure.Table 1. Preparation of the Percoll dilutions for the discontinuous gradient table:\n﻿0,1,2\n%,90% Percoll (ml),1× HBSS (ml)\n70,2.8,0.8\n65,2.6,1\n60,2.4,1.2\n55,2.2,1.4\n50,2,1.6\n45,1.8,1.8\n40,1.6,2\n35,1.4,2.2\n30,1.2,2.4\n25,1,2.6\n20,0.8,2.8\n15,0.6,3\n10,0.4,3.2\n5,0.2,3.4",
    "In a 50 ml tube, delicately drop off 3 ml of each dilution, layer-by-layer, starting with the 70% dilution. To facilitate the process, use a 5 ml serological pipet with the pipet controller set on the passive mode and let the solution descend very slowly.Keep the gradient at 4°C for optimal separation of the cells. It must be freshly prepared the day of the isolation.Placenta CollectionOnly include placentas retrieved from strictly normal singleton pregnancies at term (37-41 weeks of gestation), without any fetal (growth restriction, malformations, genomic abnormalities, or infection), placental (unique umbilical artery, placenta praevia, or placenta accreta), or maternal (chronic diseases, gestational diabetes, preeclampsia, medications, alcohol, or drugs) complications.Collect material on ice immediately after cesarean section and proceed with digestion within one hour.Tissue PreparationPut the placenta in the stainless steel container and roughly remove the amniotic membranes with the pair of big scissors.Cut the placenta into 2 × 2 cm pieces and put them in the 2 L beaker (Figure 1A).Wash the tissue by adding 500 ml of NaCl 0.9%. Mix well and drain the pieces in the big sieve placed on the bucket (Figure 1B).Repeat this operation until the wash solution remains clear (4 L to 8 L needed).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4185/bioprotoc-11-19-4185-g001.jpgFigure 1. Washing step. A. After cutting the placenta into pieces, put them in the 2 L beaker and add 500 ml of NaCl 0.9%. B. Shake the beaker vigorously and drain the tissue in the sieve. Repeat this operation several times. After 4 to 8 L of NaCl 0.9%, the pieces must turn light red, and the wash solution must remain clear.Place the pieces in the glass container and delicately dry the tissue with paper towels (Figure 2A).",
    "With the pair of little scissors and the tweezer, remove the big blood vessels (Figure 2B), the chorionic plate and the remaining amniotic membranes (the white side) (Figure 2C and 2D), the decidua (the pearly opposite side), and the blood clots to facilitate the digestion and to reduce the amount of debris.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4185/bioprotoc-11-19-4185-g002.jpgFigure 2. Cleaning step. Prepare the pieces for digestion. A. After drying with paper towels, B. Remove big blood vessels and C-D. the chorionic plate. This step can be time-consuming, but reducing the amount of debris improves digestion and protocol yield.Using the scale, weigh 72 g of tissue and chop the fragments with the pair of big scissors (Figure 3A).Enzymatic DigestionIn the water bath, preheat 300 ml of 1× HBSS in the 500 ml baffled flasks with screw closure.Dissolve 720 units of lyophilized dispase I in the preheated 1× HBSS to obtain a solution at 2.4 units/ml.Add the finely minced placental tissue to the dispase solution and incubate 1 h in the water bath under strong shaking (Figure 3B).Add 1.2 ml of DNAse I 10 mg/ml to the digested tissue to obtain a final concentration of 100 units/ml.Incubate in the water bath under strong shaking for another 15 min.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4185/bioprotoc-11-19-4185-g003.jpgFigure 3. Digestion step. Dissolve 720 units of dispase I in 300 ml of preheated HBSS. A. Chop the pieces with the pair of big scissors and transfer the pulp to the baffled flask. B. Incubate the mixture 1 h in the water bath under strong shaking. Add predissolved DNAse I and incubate for another 15 min.Cell Isolation and PurificationPrefilter the suspension using in the little sieve placed on the 1 L beaker (Figure 4A).Fix the three test sieves in decreasing order (pore diameter: 200 µm-100 µm-40 µm) on the stand with the clamp.",
    "Place the stainless steel funnel and the 500 ml baffled flasks with a straight neck below the filters.Let the suspension pass through the filtration system. If the filtration is difficult, agitate the test sieves to move debris and draw air. Alternatively, a porcelain spoon can also be used to remove blocking dirt (Figure 4B).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4185/bioprotoc-11-19-4185-g004.jpgFigure 4. Filtration step. A. After the digestion, the suspension is first prefiltered by using the little sieve. B. The suspension is then passed through the three test sieves, fixed on the stand by decreasing order. The filtrate is finally centrifuged; the pellet contains red blood cells, lymphocytes, debris, and cytotrophoblasts.Divide the filtrate into two centrifugation bottles and complete with IMDM or DMEM medium supplemented with gentamicin (final concentration 50 µg/ml). This will be referred to as “wash medium” in the rest of the procedure.Centrifuge 20 min at 500 × g.Aspirate the supernatant. The pellet contains red blood cells, lymphocytes, debris, and cytotrophoblasts. Be careful not to aspirate the pellet, as it is friable at this step of the procedure.Resuspend the pellet with 10 ml of wash medium and transfer to a new 50 ml tube.Complete to 50 ml with wash medium and centrifuge 5 min at 500 × g.Aspirate the supernatant and resuspend the pellet in 6 ml of wash medium.Delicately lay down these 6 ml on the surface of the gradient with the pipet controller (Figure 5A and 5B).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4185/bioprotoc-11-19-4185-g005.jpgFigure 5. Gradient step. The 6 ml contains a mix of debris, red blood cells, lymphocytes, and cytotrophoblasts. The discontinuous Percoll gradient allows separating the cell type by density. A. The gradient was freshly prepared on the day of isolation and stored at 4°C until use. B. After the filtration step, the cell suspension is meticulously deposited at the surface of the gradient.",
    "It is then centrifuged to separate the cells between the different layers.Centrifuge 20 min at 1,200 × g without brake.After centrifugation, place the gradient in front of the surgical lamp (cold light) to visualize the cells. The cytotrophoblasts form a thick layer localized between 12.5 ml and 25 ml, which corresponds to a density of 1.048-1.062 g/ml (layers 45%-40%-35%) (Figure 6). This has been previously determined with density marker beads. The debris must be localized in the low-density layers, whereas the lymphocytes can be visualized below the cytotrophoblasts. Some red blood cells may be observed within the cytotrophoblast layer, but the majority of them should be located at the bottom of the tube.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4185/bioprotoc-11-19-4185-g006.jpgFigure 6. The discontinuous Percoll gradient after centrifugation. The cells form a compact cloud between 12.5 and 20 ml. The debris (red) are above, while the red blood cells form a pellet at the bottom of the tube. Some lymphocytes can be observed around the 12 ml graduation.Remove by aspiration the upper layers corresponding to the debris with a 50 ml syringe and a blunt-end 15 G needle.With a new 20 ml syringe and the other blunt-end 15 G needle, aspirate the cell layer corresponding to the cytotrophoblasts and put them in a new 50 ml tube.Complete the volume to 50 ml with wash medium and centrifuge 5 min at 300 × g.The cytotrophoblasts form a white pellet at the bottom of the tube. Some red blood cells can be occasionally observed.Remove the supernatant and thoroughly resuspend the pellet with 6 ml of 0.05% trypsin.Manually agitate the tube 1 min in the water bath and stop the reaction by immediately placing the tube on ice.Add wash medium rapidly to 50 ml and centrifuge 5 min at 300 × g.",
    "Remove the supernatant and resuspend the cell pellet in 10 ml of wash medium.Filtrate the solution with a 40-µm disposable cell strainer.Complete the volume to 50 ml with wash medium and proceed to counting.Cell Counting and CultureDilute 60 µl of the cell suspension in 260 µl of wash medium.Add 100 µl of 0.4% Trypan blue.Count the cells with a hemocytometer (Bürker) and determine the percentage of viability.Centrifuge the cell suspension 5 min at 300 × g.Resuspend the pellet in complete culture medium (IMDM-10% FBS, gentamicin 50 μg/ml). From now, the cytotrophoblasts must be cultured with IMDM.Plate the cells at a density of 4.0 × 105 cells/cm2 to achieve immediate confluence (for example, 1.5 × 106 cells/well in a 12-well plate).Place the cells in an atmosphere-controlled humidified incubator under 21% O2-5% O2.The day after, wash the cells with preheated 1× DPBS to remove debris, syncytial knots, and unattached cells.Aspirate the DPBS and add preheated culture medium. Change the medium every 24 h.The cells can be cultured for several days (up to 21 days). Some syncytiotrophoblasts can already be observed after 24 h, and the maximum syncytialization is achieved 72-96 h after isolation.We advise checking the purity of the culture the first few times the protocol is performed (Supplementary file[href=https://os.bio-protocol.org/attached/file/20210927/4185 Supplementary file s1.docx])."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}