{
  "id": 17669,
  "origin_website": "Jove",
  "title": "Halogenated Agent Delivery in Porcine Model of Acute Respiratory Distress Syndrome via an Intensive Care Unit Type Device",
  "procedures": [
    "The study protocol was approved by the Animal Ethics Committee of the French Ministère de l’Education Nationale, de l’Enseignement Supérieur et de la Recherche (approval number 01505.03) before being registered at preclinicaltrials.eu (Pre-clinical registry identifier PCTE0000129). All procedures were performed in the Centre International de Chirurgie Endoscopique, Université Clermont Auvergne, Clermont-Ferrand, France, in accordance with the Animal Research: Reporting In Vivo Experiments (ARRIVE) guidelines36.\n1. Animal preparation and anesthesia\nPiglet mode\n\t\nEnsure that the experimental protocol is consistent with guidelines for animal experiments, including the 3R principles (replacement, reduction, and refinement) and national/international regulations.\nObtain approvals from the ethics committee for care and use of experimental animals at the relevant institution before starting the protocol.\nUse a male white Landrace piglet (2–4 months old; weighing 10–15 kg).\nPlace the piglet in the supine position after premedication using intramuscular azaperone (described in 1.2.2).\nAnesthesia induction\n\t\nRestrict animals from having food for overnight while allowing free access to water.\nAdminister anxiolytic premedication to the piglet using intramuscular azaperone (2 mg.kg-1) behind the ear.\nApply a finger pressure on the soft tissues of the auricular base of the piglet to identify the medial and lateral auricular vein.\nInsert a peripheral intravenous 22 G catheter in the medial or lateral auricular vein of the piglet. Follow with the catheter at a shallow angle of 45˚ through the skin and advance until blood appears through the catheter.\nInduce general anesthesia with intravenous propofol (3 mg.kg-1) and sufentanil (0.3 µg.kg-1)37. Check the depth of the anesthesia by lack of response to pedal reflex.\nTracheal intubation38,39\nPrepare the laryngoscope using a size 4 straight Miller laryngoscope blade.\nPass the laryngoscope into the pharyngeal cavity and depress the tongue with the laryngoscope blade, making the epiglottis visible.\nVisualize the larynx opening of the piglet prior to orotracheal intubation.",
    "Insert a 6 mm internal diameter cuffed endotracheal tube.\nInflate the endotracheal tube cuff to reach a cuff pressure around 20–30 cmH2O.\nFix the endotracheal tube to the piglet’s nose with micropore surgical tape.\nConnect to the ventilator and initiate mechanical ventilation following the settings described in section 3.\nSedation maintenance\n\t\nMaintain anesthesia with continuous intravenous infusion of propofol (5 mg.kg-1.h-1) before acid-induced lung injury. The infusion of propofol will be stopped when halogenated agents are started.\nAdd a continuous intravenous infusion of remifentanil (10–20 μg.kg−1.h−1 = 0.15–0.33 μg.kg−1.min−1) for pain management.\nAdd continuous intravenous infusion of cisatracurium (0.2 mg.kg-1.h-1) for a neuromuscular blockade.\nKeep the body temperature of the piglet at approximately 38 °C using warm blankets.\nMonitor electrocardiogram activity, the peripheral oxygen saturation (SpO2), and arterial pressure continuously using an external monitor.\nSurgery\n\t\nInsert central venous access using a surgical exposure of the right internal jugular vein and the Seldinger method to insert a 3-lumen catheter (7 French, 16 cm).\n\t\t\nMake a cutaneous midline incision on the ventral aspect of the neck, 2 cm lateral from the trachea. Use surgical forceps to dissect the tissues.\nLocalize the internal jugular vein (approximately 1–2 cm deep, lateral to the internal carotid artery) and, using the needle (18 G, 6.35 cm), make a puncture with a craniocaudal direction orientation.\nWith the hand, insert the “J” guidewire (0.81 mm diameter, 60 cm) through the needle. Gently remove the needle and quickly insert a venous catheter with three lines into the internal jugular vein along the “J” guidewire. Remove the “J” guidewire while maintaining the venous catheter in place.\nAspirate blood through each line of the venous catheter to remove the air from the different lines and flush with 5 mL of saline solution (0.9% NaCl) to rinse the three lines.",
    "Suture the skin with a 3.0 non-absorbable suture thread following the continuous Lembert pattern and fix the catheter to the skin with a single stitch and triple knots on each lateral perforation of the central venous catheter.\nInsert an arterial line via surgical exposure of the right femoral artery and use the Seldinger method to insert the thermodilution catheter (3–5 French, 20 cm).\n\t\t\nPlace the right forelimb of the piglet in extension.\nMake a cutaneous incision on the right groin area of the piglet. Use surgical forceps to dissect the subcutaneous and muscular tissues.\nLocalize the right femoral artery by palpating the femoral pulse (approximately 3–4 cm deep) and, using the needle (19 G, 54 mm), make a puncture with a caudocranial direction orientation.\nInsert the “J” guidewire through the needle. Gently remove the needle and quickly insert an arterial catheter into the femoral artery up along the guidewire. Remove the guidewire while maintaining the catheter in place.\nRemove the air from the arterial catheter and flush with saline solution to rinse the line.\nSuture the skin with a 3.0 non-absorbable suture thread following the continuous Lembert pattern and fix the catheter to the skin with a single stitch and triple knots on each lateral perforation of the arterial catheter.\nPlug the catheter on an arterial line tubing to allow retrieval of serial blood samples and continuous hemodynamic monitoring (arterial pressure, cardiac index, and extravascular lung water, as indexed to body weight) with a pulse contour cardiac output monitor device.\n2. Acid-induced acute lung injury\nCAUTION: Use gloves and glasses during this step to avoid any risk of contact of the acid with the skin or the eyes)\nMake 100 mL of HCl at 0.05 M and pH 1.4.",
    "Using the anatomical landmark of the last segment of the sternum, measure the distance between the tip of the endotracheal tube and the carina of the piglet.\nMark this distance with a black pen on a Ch14 suction catheter.\nInsert the suction catheter through the endotracheal tube up to the black landmark.\nGently instill 4 mL.kg-1 (bodyweight) of acid through the suction catheter for over 3 min.\nRemove the suction catheter.\n3. Mechanical ventilation\nUse volume-controlled ventilation on an intensive care ventilator.\nUse a tidal volume of 6 mL.kg-1, a positive end-expiratory pressure (PEEP) of 5 cmH2O, and an inspired oxygen fraction (FiO2) of 40%.\nAdjust the respiratory rate to maintain the end-tidal carbon dioxide between 35 and 45 mmHg.\n\tNOTE: Based on previous studies37,40,41, lung injury is considered established when the arterial oxygen tension (PaO2)-to-FiO2 ratio decreases to 25% from the baseline, approximately 1 h after airway HCl instillation.\n4. Halogenated anesthetics\nNOTE: Start sedation using halogenated anesthetics (sevoflurane or isoflurane) once acid-induced lung injury is achieved. The intravenous sedation using propofol should then be interrupted.\nFilling the syringe (Figure 1A): Attach the filling adapter provided by the manufacturer to the 250 mL bottle of the halogenated agent and a 60 mL syringe to the filling adapter. Turn the bottle upside down and fill the syringe by pushing and pulling the plunger. Turn the bottle upright and remove the syringe.\nScavenging (Figure 1B)\n\t\nPlace the charcoal filter, used to remove halogenated hydrocarbon anesthetic gases, close to the ventilator.\nRemove the protective cap from the charcoal filter.\nConnect the charcoal filter to the expiratory valve of the ventilator with a flex tube.\nUse the anesthetic conserving device (device used for inhaled ICU sedation) (Figure 1C) as described below.",
    "Connect the ionomer membrane dryer line to the gas sampling port of the anesthetic conserving device.\nConnect one side of the gas sampling line to the ionomer membrane dryer line.\nConnect the other side of the gas sampling line to the gas analyzer.\nInsert the anesthetic conserving device between the Y-piece of the respiratory circuit and the endotracheal tube.\nEnsure that the anesthetic conserving device has the black side up and is sloped down toward the piglet.\nDeliver inhaled sedation through the anesthetic conserving device (Figure 2).\n\t\nPlace the specific syringe in the syringe pump.\nConnect the anesthetic agent line to the syringe.\nPrime the agent line with a bolus of 1.5 mL of the halogenated agent.\nAdapt the initial pump rate in mL.h-1 (initial syringe pump rate settings of isoflurane and sevoflurane are 3 and 5 mL/h, respectively) to the targeted expired sevoflurane fraction (FEsevo) or the expired isoflurane fraction (FEiso) value, as displayed on the gas analyzer.\nEnsure that the gas analyzer displays a FEsevo %–FEiso % or equivalent minimal alveolar concentration value greater than zero. If necessary, give an additional bolus of 0.3 mL of the halogenated agent.\nAdapt the syringe pump rate necessary to reach a certain concentration depending on the minute volume and the targeted concentration, with rates of 2–7 mL.h-1 and 4–10 mL.h-1 being, in general, associated with expired fractions of 0.2%–0.7% and 0.5%–1.4% for isoflurane42 and sevoflurane28,43, respectively.\nDuring the experiment, continue administration of the halogenated agents with FEsevo and FEiso targets of 0.8–1.1 and 0.5–0.8, respectively.\n5. Measurements\nMonitoring\n\t\nCollect different parameters as measured by the external monitor: heart rate, blood pressure, and peripheral oxygen saturation.",
    "Record parameters as measured by the ventilator: tidal volume, respiratory rate, set PEEP, auto-PEEP (by applying an expiratory hold maneuver of 5 s on the ventilator), compliance of the respiratory system, airway resistance, inspiratory plateau pressure (by applying an inspiratory hold maneuver of 2 s on the ventilator), peak inspiratory pressure, and driving pressure.\nCalculate the lung functional residual capacity using the Nitrogen Wash In/Wash Out method if integrated in the ventilator.\nUse the thermal indicator previously inserted in the femoral artery to measure the extravascular water volume of the lungs, cardiac index, and systemic vascular resistance.\nUndiluted pulmonary edema fluid sampling to measure the net AFC rate.\n\t\nInsert a soft 14 Fr suction catheter into a wedged position in the distal bronchus through the endotracheal tube.\nSample edema fluid into a suction trap by applying gentle suction.\nCentrifuge all samples at 240 x g at 4 °C for 10 min in a refrigerated centrifuge.\nCollect the supernatants.\n\t\tNOTE: Total protein concentration in undiluted pulmonary edema fluid is measured with a colorimetric method. Because the rate of clearance of edema fluid from the alveolar space is much faster than the rate of protein removal, the net AFC rate was calculated as Percent AFC = 100 × [1 - (initial edema protein/final edema total protein)] and thereafter was reported as %/h37. Undiluted pulmonary edema fluid samples are collected from the animals at baseline and 4 h later, as previously described34,44,45,46,47,48,49.\nMini bronchoalveolar lavage sampling.\n\t\nInsert a soft 14 Fr suction catheter into a wedged position in a distal bronchus through the endotracheal tube.\nInstill 50 mL of a 0.9% sodium chloride solution into the suction catheter.\nPromptly sample the fluid into a suction trap.\nCollect the mini bronchoalveolar lavage.",
    "NOTE: Total protein concentration in mini BAL is measured with a colorimetric method and, for example, the levels of proinflammatory cytokines, such as TNF-α, IL-6, IL-1β, and IL-18, are measured using a multiplex immunoassay method. Samples are collected 4 h after the acid-induced lung injury.\nBlood gas analysis\n\t\nCollect arterial blood gases through the arterial line in a 3 mL BD Preset syringe with BD Luer-Lok tip at baseline. Immediately measure PaO2/FiO2, PaCO2, pH, serum lactate, and serum creatinine using a point-of-care blood gas analyzer.\nRepeat this step every hour for 4 h after acid instillation.\nLung sampling\n\t\nSacrifice the piglet with an intravenous injection of pentobarbital (150 mg.kg-1) at the end of the experiment (4 h after acid-induced lung injury).\nDissect and remove the whole lungs. Fix with alcohol acetified formalin.\nEmbed in paraffin and slice at a 10 μm thickness.\nStain with hematoxylin and eosin.\n\t\tNOTE: Histological evidence of lung injury can be assessed using a standardized histology injury score50.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}