{
  "id": 7443,
  "origin_website": "Bio",
  "title": "Production of Recombinant Replication-defective Lentiviruses Bearing the SARS-CoV or SARS-CoV-2 Attachment Spike Glycoprotein and Their Application in Receptor Tropism and Neutralisation Assays",
  "procedures": [
    "Generation of SARS-CoV-2 and SARS-CoV pseudotyped virus particlesMaintain HEK293T cells for pseudoparticle production in 25 ml of DMEM-10% (see Recipes) in a 75 cm2 tissue culture flask.Seed HEK293T cells at a concentration of 7.5 × 105 cells per well in a 6-well plate in 3 ml of DMEM-10%, for the total number of wells required.Agitate cells in the plate using a rapid up-down, left-right movement. This will ensure cells are evenly distributed and do not clump. Incubate at 37°C, 5% CO2 overnight.The next day, set up transfection mixes in the afternoon. The seeded HEK293T cells should be between 60-80% confluent for optimal transfection efficiency. Set up transfections for the SARS-CoV-2 S or SARS-CoV S plasmid, alongside an empty vector negative control (no glycoprotein, no GP) and a positive control. For instance, if the SARS-CoV-2 S and SARS-CoV S plasmids are in a pcDNA3.1 backbone, use an empty pcDNA3.1 plasmid as your no GP control. Generally, a VSV-G plasmid is used as a positive control, as it is trans-encapsidated into the HIV-1 particle efficiently (i.e., it pseudotypes well).In a sterile 1.5 ml Eppendorf tube, add 100 µl of Opti-MEM along with 0.6 µg of p8.91 plasmid (encoding for HIV-1 gag-pol), 0.6 µg of CSFLW plasmid (lentivirus backbone expressing Firefly luciferase), and 0.5 µg of glycoprotein (SARS-CoV-2 S, SARS-CoV S or VSV-G) or empty vector (pcDNA3.1) per well. Incubate for 5 min at room temperature.In a separate 1.5 ml Eppendorf tube, add 100 µl of Opti-MEM plus and 10 µl of PEI (1 µg/ml) per transfection and incubate for 5 min at room temperature.For each 100 µl transfection mix of DNA in Opti-MEM, add 100 µl of PEI in Opti-MEM and mix vigorously with a pipette ten times. Incubate at room temperature for 20 min.",
    "Add 200 µl of the volume of the transfection mix in a dropwise manner to each well of the 6-well plate and incubate overnight at 37°C, 5% CO2.The next morning, use a serological pipette to gently remove the media from wells containing the transfection mix by tilting the dish towards you and aspirating from the edge of the well, being careful not to disturb the monolayer. Replace with 3 ml of DMEM-10%. Incubate overnight at 37°C, 5% CO2 for 24 h.Harvest cell supernatants containing pseudotyped virus particles and transfer to a 50 ml Falcon, pooling similarly transfected wells, and store at 4°C. Replace the media with 3 ml of DMEM-10% per well, and incubate at 37°C, 5% CO2 for 24 h.Harvest the cell supernatants containing pseudotyped virus particles and pool with pseudoparticles harvested the day before. Centrifuge at 2,500 × g for 10 min at 4°C to remove cellular debris.Aliquot 4-5 ml of pseudoparticles into bijous and freeze at -80°C until further use.NB: Larger volume of pseudoparticles can also be prepared in 10 cm2 culture dishes. The necessary cell seeding density, DNA concentrations and volumes required for this setup can be found in Table 1, with the corresponding values for the 6-well plate format noted alongside. Steps A9-A12 remain the same regardless of the dish size used, changing only the volume of media required. Table 1.Quick-guide to generating lentiviral-based pseudotyped virusesimgsrc:https://en-cdn.bio-protocol.org/attached/image/20211102/20211102195057_6370.jpg Testing SARS-CoV-2 and SARS-CoV pseudoparticle infectivitySeed HEK293T cells at a density of 7.5 × 105 per well in a 6-well plate in a total of 3 ml of DMEM-10%. Incubate overnight at 37°C, 5% CO2.Ensure plated cells are at 60-80% confluency to ensure optimal transfection efficiency. Set up transfection mixes to test pre-generated SARS-CoV-2 pseudoparticles. In a sterile 1.",
    "5 ml Eppendorf tube, add 200 µl of Opti-MEM along with 500 ng of human ACE2 plasmid per well to be transfected. Bring the TranIT-X2 transfection reagent to room temperature before use, add 2 µl (for every 1 µg of DNA) directly to the tube, and gently flick the tube to mix. Incubate at room temperature for 20 min.Add 200 µl of the transfection mix dropwise to each well of the pre-plated cells and incubate overnight at 37°C, 5% CO2.Remove the media containing the transfection mix from the wells by tilting the dish towards you and aspirating from the edge of the well using a serological pipette, being careful not to disturb the monolayer. Add 1 ml of DMEM-10% per well and harvest the transfected cells. HEK293T cells have low adherence and come off the plate easily. As such, using the force of the pipetted liquid is sufficient to harvest cells, although care should be taken to ensure a single cell suspension is achieved without clumps. Trypsin should be avoided as this will unnecessarily cleave off the receptors, hampering future experimentation. Transfer to a 50 ml Falcon and dilute cells to 2 × 105/ml with DMEM-10%.Seed 100 µl of diluted cells (2 × 104 per well) into a flat, white-bottomed 96-well plate and incubate overnight at 37°C, 5% CO2.The next day, thaw an aliquot of SARS-CoV-2 and/or SARS-CoV pseudoparticles, along with the negative (pcDNA3.1, no GP) and positive (VSV-G) controls. Titrate the pseudoparticles in a clear-bottomed 96-well plate, starting with undiluted virus in the top row, and titrating 10-fold in DMEM-10%, for a final volume of 100 µl.Gently remove the media from the white-plate seeded with human ACE2-transfected cells and add 100 µl titrated pseudoparticles. Incubate for 48 h at 37°C, 5% CO2.",
    "Remove the media from the wells by tilting the dish towards you and aspirating from the edge of the well using a multi-channel pipette and add 50 µl Bright-GloTM diluted 1:1 with serum free, phenol red free DMEM. Incubate the plate in the dark for 5 min and then measure the luciferase signal on a GloMax Multi+ Detection System under the luminescence protocol with 0.5 s integration.Export the CSV file generated on a USB flash drive for analysis using Microsoft Excel and plot data on GraphPad Prism.ACE2 receptor usage screen using SARS-CoV-2 and SARS-CoV pseudotyped virus particles (Conceicao et al., 2020)Maintain BHK-21 cells in 25 ml DMEM-10% in a 75 cm2 tissue culture flask. Seed BHK-21 cells in 24-well plates at 1 × 105/well in DMEM-10%. Incubate overnight at 37°C, 5% CO2.Ensure plated cells are at 60-80% confluency to ensure optimal transfection efficiency. Set up transfection mixes in 100 µl of Opti-MEM along with 500ng of different species of ACE2-expressing constructs or an empty vector control (e.g., pDISPLAY). Bring the TranIT-X2 transfection reagent to room temperature before use and add 3 µl for every 1 µg of DNA directly to the tube and gently flick the tube to mix. Incubate at room temperature for 20 min.Add 100 µl of the transfection mix dropwise to each well of the pre-plated BHK-21 cells and incubate overnight at 37°C, 5% CO2.Remove the media containing the transfection mix from the wells and add 0.5 ml of 2 mM EDTA in PBS per well to harvest the transfected cells. Transfer to a bijou and dilute cells to 2 × 105/ml with DMEM-10%.Seed 100 µl of diluted cells (2 × 104 per well) into a flat, white-bottomed 96-well plate and incubate overnight at 37°C, 5% CO2.",
    "Remove media from cells and infect with SARS-CoV-2 or SARS-CoV pseudoparticles equivalent to 106-107 relative light units (RLU), or the no GP control at the same dilution and incubate for 48 h at 37°C, 5% CO2.Remove the media from the wells and add 50 µl of Bright-GloTM diluted 1:1 with serum free, phenol red free DMEM. Incubate the plate in the dark for 5 min then read on a GloMax Multi+ Detection System under the luminescence protocol with 0.5 s integration.Export the CSV file generated on a USB flash drive for analysis using Microsoft Excel and plot data on GraphPad Prism.Neutralisation assay using SARS-CoV-2 and SARS-CoV pseudotyped virus particlesPrior to setting up neutralization assays, seed HEK293T cells at a density of 7.5 × 105 per well in a 6-well plate in a total of 3 ml of DMEM-10%. Incubate overnight at 37°C, 5% CO2.Ensure plated cells are at 60-80% confluency to ensure optimal transfection efficiency. In a sterile 1.5 ml Eppendorf tube, add 200 µl of Opti-MEM along with 500 ng of human ACE2 plasmid per well to be transfected. Bring the TranIT-X2 transfection reagent to room temperature before use and add 2 µl for every 1 µg of DNA directly to the tube and gently flick the tube to mix. Incubate at room temperature for 20 min.Add 200 µl of the transfection mix dropwise per well of pre-plated cells and incubate overnight at 37°C, 5% CO2.Set up neutralisation assays by diluting sera/monoclonal antibodies (mAbs)/inhibitors considering the dilution series to be used and the final volume after addition of pseudoparticles. For example, sera to be titrated using a 2-fold dilution series starting at a 1:10 dilution would require 10 µl sera per well in 100 µl serum free DMEM.",
    "The same is applicable for mAbs or inhibitors with a known concentration.Add 100 µl of diluted sera/mAbs/inhibitors in triplicate to the top row of a flat white-bottomed 96-well plate. Add 50 µl of serum free media to all remaining wells. Remove 50 µl from the top row and titrate 2-fold down the plate, mixing well before each titration. Do not titrate into the bottom row. This whole row will be used as the untreated control.Thaw an aliquot of SARS-CoV or SARS-CoV-2 pseudoparticles and dilute in serum free DMEM, equivalent to ~106 RLU and add 50 µl per well, including the untreated controls. Incubate for 1 h at 37°C, 5% CO2.Remove the media from the 6-well plates transfected with human ACE2. Add 1 ml of DMEM-10% per well and harvest the transfected cells. HEK293T cells have low adherence, so come off the plate easily; therefore, the force of the pipetted liquid should be sufficient to harvest cells (see B4 above). Transfer to a 50 ml Falcon and dilute cells to 2 × 105/ml with DMEM-10%.Seed 100 µl of diluted cells (2 × 104 per well) onto each well containing sera/mAb/inhibitor with pseudoparticles and the untreated controls. Incubate for 48 h at 37°C, 5% CO2.Remove the media from the wells and add 50 µl of Bright-GloTM diluted 1:1 with serum free, phenol red free DMEM. Incubate the plate in the dark for 5 min then read on a GloMax Multi+ Detection System under the luminescence protocol with 0.5 s integration.Export the CSV file generated on a USB flash drive for analysis using Microsoft Excel and plot data on GraphPad Prism."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}