{
  "id": 8821,
  "origin_website": "Jove",
  "title": "Monitoring Cell-to-cell Transmission of Prion-like Protein Aggregates in Drosophila Melanogaster",
  "procedures": [
    "1. Coupling Gal4- and QF-mediated Htt Transgene Expression in Drosophila\nCollect and/or generate transgenic Drosophila melanogaster lines containing tissue-specific Gal4 or QF \"drivers,\" as well as lines containing wild-type or mutant Htt transgenes downstream of the Gal4-UAS38 or QF-QUAS39. Ensure that the proteins that are expressed from these transgenes are fused to fluorescent proteins or epitope-tagged to allow for differentiation of mutant and wild-type Htt transgene products in the same fly. See Figure 1.\n\t​NOTE: We typically use exon 1 fragments of the human Htt gene27. However, transgenic flies can instead be generated to express longer Htt fragments or other genes if desired.\nPlan the genetic strategy such that mutant and wild-type Htt transgenes will be expressed in distinct, non-overlapping cell populations.\n\t\nIf any expression overlap occurs, mutant and wild-type Htt proteins synthesized in the same cells will co-aggregate and prevent detection of prion-like events. To avoid this, use the Gal4 and QF specific repressors, Gal80 and QS40, respectively (Figure 1). Selecting developmentally-controlled Gal4 and/or QF drivers can help to restrict expression of mutant Htt to post-mitotic cells, eliminating the possibility that cell division might contribute to cell-to-cell aggregate spreading.\nUsing standard culturing conditions, mate the flies to generate progeny that express mutant Htt via QF (or Gal4) in a \"donor\" cell population and wild-type Htt via Gal4 (or QF) in a \"recipient\" cell population. See Figure 1 for a schematic showing a possible genetic combination.\n\tNOTE: The QF and Gal4 drivers that were used to generate the data shown in Figures 1 - 4 and in our previous publication27 include the DA1 olfactory receptor neuron (ORN) driver, Or67d-QF, and the pan-glial driver, repo-Gal4.\nGenerate control flies in parallel that express wild-type Htt in both QF- and Gal4-labeled cell populations.",
    "Collect progeny of the desired genotype, and age the animals as appropriate.\nimgsrc://cloudfront.jove.com/files/ftp_upload/56906/56906fig1.jpg\nFigure 1. Genetic approach for coupled expression of mutant and wild-type Htt transgenes using the QF-QUAS and Gal4-UAS binary expression systems. In \"cell A,\" an mCherry-tagged mutant Htt protein containing a pathogenic-length polyQ stretch (Q91) is expressed using a QF driver located downstream of a tissue-specific promoter A (\"PA\"). In \"cell B,\" a YFP-tagged wild-type Htt containing a normal polyQ stretch (Q25) is expressed via a Gal4 driver controlled by tissue-specific promoter B (\"PB\"). In Figures 2-4, Or67d-QF was used to drive QUAS-HttQ91-mCherry expression in DA1 ORNs, and repo-Gal4 was used to express UAS-HttQ25-YFP in all glia27. Importantly, HttQ91-mCherry is only expressed in QF-expressing cells by virtue of the QUAS sequence placed upstream of the transgene. Similarly, HttQ25-YFP is only expressed via Gal4, which specifically recognizes the UAS. If any overlap in the tissue distribution of the QF and Gal4 drivers is detected, transgenes encoding QS in Gal4-expressing cells and Gal80 in QF-expressing cells can be introduced. Appending fluorescent protein tags onto wild-type and mutant Htt allows for differentiation of the two proteins during imaging and the ability to measure FRET between appropriate donor/acceptor pairs (e.g., CFP/YFP or YFP/mCherry). Please click here to view a larger version of this figure.[href=https://www.jove.com//cloudfront.jove.com/files/ftp_upload/56906/56906fig1large.jpg]\n2. Micro-dissection and Fixation of Adult Drosophila Brains\nNote: This dissection procedure has been modified from a previous publication44, and can be used to prepare brains for imaging direct fluorescence signal from Htt-fluorescent protein fusions. Modifications to the procedure that can be made for immunostaining the brains are discussed in the next section.",
    "Collect the following materials and place on ice: phosphate-buffered saline containing 0.03% Triton X-100 (PBS/T); microcentrifuge tubes containing 970 µL of 4% paraformaldehyde (PFA) fixative solution prepared by adding 200 µL 20% PFA to 770 µL PBS/T; a clear glass dish containing well; a disposable transfer pipet; two dissecting forceps (one no. 3 and one no. 5).\nAnesthetize the adult flies using CO2 and transfer them to one well of the glass dish on ice.\nUsing a transfer pipet, add a small amount (~ 500 µL) of cold PBS/T to the well containing the flies as well as to an empty well. Avoid introducing too many bubbles as they can interfere with the dissection.\nPlace the glass dish on a flat surface below a dissecting microscope and adjust the magnification until the fly body fills the field of view and is in focus.\nPosition a pair of gooseneck light sources so that light is illuminating both sides of the glass dish. Anchor a folded lab tissue under the glass dish to discard body parts/cuticle during the dissection.\nUsing the no. 3 forceps in the non-dominant hand, transfer a single fly into the well containing PBS/T. Immobilize the fly by grabbing hold of its abdomen with the ventral side facing up.\nKeeping the fly fully submerged in PBS/T, remove the fly head with the no. 5 forceps in the dominant hand. Insert one tip of this forceps under the cuticle in the small space adjacent to the proboscis on one side of the fly head. Secure the grip on the head by pinching the forceps to grab hold of the eye from both sides.",
    "Remove the fly head from its body by pulling the two forceps apart. Dispose of the fly body on a lab tissue positioned nearby. Maintain pressure on the dominant-hand forceps so that the fly head is not lost.\nPosition one tip of the no. 3 forceps in the non-dominant hand in the same small space under the cuticle on the other side of the proboscis. Once positioned, pinch the forceps to grip the eyes in the same location on both sides of the head.\nOnce the grip on the cuticle is secure, gently pull the forceps apart at 180°. This action will break apart the head cuticle without damaging the brain. Discard cuticle residue on a lab tissue.\n\t\nThough ideal, the head cuticle may not be fully removed in one step. In this case, remove the cuticle piece-by-piece until the brain is fully exposed. Take care not to damage the brain by avoiding direct contact with the forceps.\nRemove the dissected brain from the PBS/T either by grabbing ahold of an attached trachea, or by aspirating the brain into the space between the forceps tips by capillary action.\n\tNOTE: Trachea removal is optional, as it tends to not obscure the antennal lobes on the anterior surface of the brain where we typically image. However, if the trachea interfere with imaging, remove them carefully so the brain is not damaged by this manipulation.\nTransfer the fly brain into one of the microcentrifuge tubes containing fixative solution on ice. Ensure that the brain detaches from the forceps and is submerged in the fixative solution.\nOnce all of the brains have been dissected, subject them to a \"short-fix\" by placing the closed tubes on a nutator for ~ 5 min at room temperature in the dark.",
    "​NOTE: This short fixation step ensures that the brains are easier to handle in subsequent steps and do not adhere to the sides of the microcentrifuge tube.\nRemove the majority of the fixative solution with a P1000 pipette and discard it.\n\t\nAvoid aspirating brains from the tube during this and any subsequent wash step. Set the P1000 to a lower volume (e.g., 650 µL) and remove the supernatant in two steps. In addition, hold the microcentrifuge tubes in line with a light source (e.g. overhead lights) while aspirating to better visualize the brains.\nAdd 1 mL of fresh PBS/T to the brains. Wash quickly (< 1 min) in the dark, aspirate the supernatant from the brains, and discard.\nRepeat the washing with PBS/T in the dark at room temperature according to the following schedule: 2 quick (< 1 min) washes, 1 X 5 min, 3 X 20 min, and 1 X 1 h wash. Secure tops on microcentrifuge tubes and place the tubes on a nutator in between washes.\n\t\nIf DAPI staining is desired, replace the final 1 h wash with 1 X 30 min incubation with 250 ng/mL DAPI diluted in PBS/T, followed by 2 X quick and 1 X 20 min washes.\nAfter the last wash, remove the majority of the wash buffer supernatant, taking care not to disturb the brains, and add 30 µL of glycerol-based antifade reagent to the brains. Incubate at 4 °C in the dark without movement for at least 1 h and up to 24 h.\n3. Modifications to Section 2 for Immunostaining Adult Brains\nNote: Use this protocol for imaging non-fluorescent proteins or for fluorescent protein fusions with weak fluorescence.",
    "Increase the concentration of Triton X-100 in PBS/T by 10-fold (PBS + 0.3% Triton X-100) for every step. This ensures that enough detergent is present to permeabilize cell membranes and allow antibodies to access intracellular spaces.\nFix the brains in 4% PFA in PBS/T for 20 min at room temperature.\nAfter performing all of the washes, incubate the brains in freshly-prepared blocking buffer (PBS/T + 5% normal goat serum (NGS)) for 30 min at room temperature in the dark.\nRemove and discard the blocking buffer. Add 0.5 mL of primary antibody solution per tube prepared as a master mix by diluting primary antibodies as appropriate in fresh blocking buffer (see Table of Materials for commonly used antibodies and dilutions). Incubate the brains in primary antibodies on a nutator for at least 24 h at 4 °C in the dark.\nRemove the primary antibody solution from the brains using a P1000 and reserve in a fresh tube. Add 1 mL of PBS/T to wash the brains.\n\tNOTE: The reserved primary antibody solution can be stored at 4 °C for up to four weeks. We have successfully recycled primary antibodies up to two times in subsequent experiments.\nWash the brains quickly (< 1 min) in PBS/T, aspirate the supernatant from brains, and discard. Repeat this quick wash once more.\nContinue washing with 1 mL PBS/T at room temperature according to the following schedule: 1 X 5 min, 3 X 20 min, and 1 X 1 h wash. Secure tops on microcentrifuge tubes and place the tubes on a nutator during washes.",
    "After the last wash, remove the majority of the PBS/T supernatant and add 0.5 mL of secondary antibody solution prepared as a master mix by diluting the antibodies as appropriate in fresh blocking buffer (see Table of Materials for commonly used antibodies and dilutions). Incubate brains in secondary antibodies for 24 h at 4 °C in the dark.\nRepeat wash steps in steps 3.5, 3.6, and 3.7 after incubation with secondary antibodies.\nAfter the final wash, remove the majority of the wash buffer and make sure that all brains are located at the bottom of the tube. Add 30 µL antifade reagent to the brains. Incubate at 4 °C in the dark without movement for 16-24 h.\n4. Whole Brain Mounting\nPlace a glass microscope slide under a dissecting microscope and label with identifying information.\n\t​NOTE: Alternatively, the brains can be mounted directly onto a cover glass to access both sides of the brain during imaging. A protocol describing this mounting procedure has been previously published45.\nRemove the brains from each microcentrifuge tube using a blunted pipet tip (prepared using a razor blade to remove the bottom ~ 1 cm off a 1-200 µL tip) and transfer them into the middle of the slide. Transfer as little antifade reagent with the brains as possible.\nUse forceps to position the brains in the desired orientation (e.g., dorsal pointing towards the top of the slide and anterior surface facing up for imaging the antennal lobe). When orienting the brains, consider the light path of the microscope to be used for imaging them.\nRemove excess antifade reagent from the slide using the pointed corner of a folded lab tissue without disturbing the brains. Let the slide sit for ~ 5-10 min in the dark to allow the brains to adhere to the slide.",
    "Surround the fly brains with four small pieces of broken cover glass placed on each side of the brains to form a square that is ~ 19 mm x 19 mm. Place one edge of a 22 mm x 22 mm No. 1.5 cover glass just outside one of these small pieces of glass, and gently lower the coverslip over the brains to complete the bridge-mount.\nSlowly dispense fresh antifade reagent to fill the surface beneath the coverslip, being careful not to disturb the coverslip or the brains. Wipe off any excess antifade using the pointed corner of a folded lab tissue without directly contacting the coverslip.\nAdd a drop of clear, quick-drying nail polish to each of the four corners of the coverslip. Allow to dry for ~ 10 min. Then, seal the four edges of the coverslip with nail polish to completely enclose the brains.\nImage brains immediately, or store at 4 °C until ready.\n\t\nIf imaging intrinsic fluorescence from Htt-fluorescent protein fusions, image the brains within 24 h for the best signal.\n5. Imaging and Quantifying Prion-like Transmission of Aggregates\nImage the mounted brains using a confocal microscope equipped with a 40X or 60/63X oil objective to collect z-slice images through the region of the brain where the selected Gal4 and QF drivers are expressed (Figure 2A, B).\n\t\nExcite the fluorescent protein fusions or immunolabeled proteins using the appropriate lasers (e.g., 488 nm for GFP/YFP/FITC or 552 nm for mCherry/Cy3). Set detection windows that capture maximum fluorescent signal while eliminating channel cross-talk using either a spectral detection system or band/long pass emission filters specific for each fluorophore.",
    "NOTE: Be attentive when imaging protein aggregates. It is easy for pixels in the center of each aggregate to become saturated, especially in larger aggregates. Attempt to minimize saturation in the image, but be aware of the risk of losing signal from smaller aggregated species (Figure 2B, C, D). Too much saturation will increase the image background, making it more difficult to identify isolated puncta. Test different imaging settings to optimize before taking the final images in each data set.\nAnalyze the data by quantifying individual puncta either manually by moving through individual z-slices (e.g., Figure 2C and Figure 4A) or after rendering the confocal slices in 3 dimensions (Figure 3A, B).\n\t​NOTE: This can be done in Image J or other image processing software.\n\t\nIf the aggregates are well-separated and there is minimal background fluorescence, use image analysis software to systematically identify, quantify, and analyze the aggregates as distinct \"objects\" or \"surfaces\" in a 3D reconstruction of the confocal stack (Figure 3B).\n\t\tNOTE: Software actions described are specific to the instrument and software used here (see the Table of Materials).\n\t\t\nVisualize a confocal z-series in 3D viewing mode. Use the \"Analysis\" wizard to identify individual spots in a selected channel (e.g. the red channel for HttQ91-mCherry aggregates in Figure 3). Adjust the thresholding and filters to accurately represent all heterogeneously-sized aggregates as individual objects in the image.\nEnable \"Split objects\" under \"Binary Processing Pre-Filter\" to separate closely-associated aggregates that are aberrantly merged by the software algorithm. Note that the total number of objects and their associated measurements is reported under \"Measurements.\"",
    "NOTE: This method for quantifying mutant Htt aggregates is not amenable to the immunostaining protocol because the center of amyloid aggregates, is impenetrable to antibodies. As a result, the aggregates appear on the microscope as ring-like structures, and image analysis software is unable to accurately identify and distinguish these individual \"spots\".\nQuantify wild-type Htt aggregates by manually moving through the z-stack and scoring wild-type Htt aggregates, making sure no aggregates are double-scored if they appear in more than one slice (Figure 4A).\n\t\tNOTE: This manual quantification approach can be used when the number of aggregates in each confocal stack is reasonable (e.g., 20-50). It is also helpful when image analysis software cannot distinguish individual puncta from surrounding signal in the same channel (e.g., signal from diffuse wild-type Htt in nearby cells) (Figure 2B, C and Figure 4A). Quantifying wild-type Htt aggregates can also be challenging because many normal structures in the brain appear punctate (e.g., cell processes and synapses). Co-localization of wild-type and mutant Htt signals can be used as a selection criterion; however, it is possible that some mutant Htt \"seeds\" fall below the limit of detection of the confocal. A protein other than Htt that does not aggregate in the recipient cells (e.g., GFP) can be used to label unrelated punctate structures in the brain.\nUse image analysis software to perform further characterization of individual aggregates. For example, determine the size distribution of the aggregates (Figure 3C), percent co-localization between mutant and wild-type Htt proteins (Figure 4A), or directly measure protein-protein interactions using FRET (Figure 4B).",
    "Determine the size distribution of individual puncta using a spot or surface detection algorithm that accurately identifies all visible aggregates in a particular channel. Use the image analysis software to take relevant measurements of the spots or surfaces, for example obtain 'aggregate diameter' (Fig. 3C), 'volume', or 'intensity' information from 'Measurements' in the software \"Analysis\" wizard described in step 5.2.1.\n\t\tNOTE: In Figure 3C, we report the distribution of diameters for all HttQ91-mCherry puncta identified in a single DA1 glomerulus.\nDetermine the percent co-localization between HttQ25-YFP and HttQ91-mCherry aggregates by manually moving slice-by-slice through a confocal z-stack (most accurate method). However, take care not to count any aggregates twice. To prevent this, only count aggregates in a particular z-slice if the plane of focus is through the center of the aggregate (Figure 4A).\nCalculate FRET efficiency for induced HttQ25-YFP aggregates with colocalized HttQ91-mCherry signal using the acceptor photobleaching method.\n\t\t\nFirst, eliminate potential cross-talk between YFP and mCherry channels by establishing detection windows for mCherry-only and YFP-only signals that produce no signal in the other channel. Using these settings, take a 'before image' of individual HttQ25-YFP puncta and their associated HttQ91-mCherry signal ( Figure 4B).\nThen, photobleach the mCherry signal by adjusting the red laser (e.g., 552 nm) to 100% intensity and scan until the signal is gone. Revert to the settings used for the 'before image,' and take an 'after image' of the same puncta (Figure 4B).\nCalculate fluorescence intensity measurements for each punctum before and after photobleaching using image analysis software.\nCalculate FRET efficiency by subtracting YFP donor fluorescence measured in the 'before image' (YFPinitial) from YFP donor fluorescence in the 'after image' (YFPfinal). Divide this value by YFPfinal, and multiply by 100.",
    "NOTE: FRET efficiency can be calculated pixel-by-pixel or overall for each HttQ25-YFP aggregate (Figure 4B). Acceptor photobleaching is a particularly useful technique for calculating FRET efficiency when the mCherry signal associated with each HttQ25-YFP punctum is sufficiently high to produce detectable YFP dequenching after mCherry photobleaching.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}