{
  "id": 15255,
  "origin_website": "Jove",
  "title": "Purification of Active Photosystem I-Light Harvesting Complex I from Plant Tissues",
  "procedures": [
    "1. Preparation of thylakoid membranes from spinach leaves\nWork on ice and avoid exposure to light where possible in this preparation. A low light environment is sufficient if high chlorophyll concentrations are maintained, and care is taken to keep the samples covered as much as possible. Perform all centrifugation steps at 4 °C unless specified otherwise.\nRemove stems from the spinach leaves (500 g) using scissors, gently press the leaves into a blender and completely cover with ice-cold sucrose, tricine, NaCl (STN) buffer (Table 1). Homogenize plant tissue in STN buffer for 10 s twice (total 20 s), leaving 10 s between pulses to prevent overheating using the pulse setting.\n\tNOTE: A typical ratio of buffer to leaves is 1 L of STN buffer for 500 g of spinach leaves.\nFilter cell debris through eight layers of cheesecloth by securing the layers of cheesecloth over a large, chilled beaker or other receptacle and pouring the blended mixture through the cloth. Use a glass rod or spoon to stir the cell debris in the filter to allow lysate to flow through.\nPellet chloroplasts from the cell lysate by centrifugation at 1000 x g for 9 min. Resuspend chloroplasts in 1 L of hypotonic buffer (Table 1). To resuspend chloroplasts, use a pipette or swirl chloroplast pellet in buffer and transfer to a tissue grinder or a similar homogenizer at an appropriate size.\n\tNOTE: Exposure to hypotonic solution and resuspension in a tissue grinder lyses the chloroplasts.",
    "Centrifuge for 2 min at 500 x g to remove starch (collected as a white pellet). Gently resuspend any green material that has pelleted back into the supernatant using a pipette or a small paint brush while avoiding starch resuspension as much as possible. Centrifuge the solution at 12,000 x g for 10 min to pellet thylakoid membranes.\nResuspend the pelleted membranes in minimal amounts of the high salt resuspension buffer (Table 1), only enough to resuspend the membranes, using a pipette or small paint brush and homogenize using a homogenizer as in step 1.4. Centrifuge at 8000 x g for 10 min.\nResuspend as before in minimal amounts of STN2 buffer (Table 1), only enough to resuspend membranes and measure chlorophyll content using a UV-Vis spectrophotometer. Determine chlorophyll concentration by diluting the sample 1/1000 in 80% acetone solution and using the method of Porra et al.31.\nAdjust to a desired chlorophyll concentration, typically 3 mg/mL, by adding STN2 buffer and aliquot evenly into two or three centrifuge tubes. The expected yield from 500 g of leaves is around 200 mg of chlorophyll, but variation based on the state of the starting material is expected. Freeze at -80 °C until ready for membrane solubilization. Membranes frozen at this stage are stable for at least 6 months.\n2. Membrane solubilization\nSolubilize thylakoid membranes with β-DDM. Add enough detergent from a 10% β-DDM stock to achieve a 6:1 β-DDM to chlorophyll ratio. Incubate on ice for 30 min. Gently mix every 5-10 min by slowly inverting the tube several times.\nCentrifuge at 120,000 x g for 30 min using an ultracentrifuge to remove insoluble material. Discard the pellet and save the supernatant for subsequent steps.\n3. Elution using diethylaminoethyl (DEAE) column",
    "Prepare the anion exchange column using 1.5 mL bed volume for 1 mg of total chlorophyll in the solubilized sample. Prepare the column and run at 4 °C. Pour the resin into a column secured onto a ring stand. Allow the resin to settle while adding water or column low salt buffer to prevent the column from running dry. Ensure the column is free of bubbles and the top is flat and level.\nWash the column using two column volumes (CV) of column low salt buffer (Table 1) and load the supernatant from step 2.2 onto the column. Allow the supernatant to completely run into the column before moving on.\nWash the column in one CV of column low salt buffer.\nElute using a linear NaCl gradient with the low salt and high salt column buffers (5-250 mM NaCl; Table 1) made in a total volume of six CV (i.e., if the column bed volume is 30 mL, use 90 mL of low salt buffer and 90 mL of high salt buffer).\n\t\nFill two beakers with the low and high salt buffers. While dripping low salt buffer into the column, create a salt bridge between the high and low salt buffers using a tube filled with water to gradually mix them. Use a stir bar to ensure that the high salt buffer moving into the low salt buffer is being mixed before it is dripped into the column. This ensures that the NaCl gradient is linear. Begin collecting fractions.\nCollect 4 mL fractions (for a typical experiment starting with about 35 mg of chlorophyll) and combine the dark green fractions eluting around the last one-third of the gradient (Figure 2A).\n4. Polyethylene glycol (PEG) precipitation",
    "To the combined chlorophyll fractions, slowly add PEG6000 to a final concentration of 8%. The PEG concentration can vary a bit; if precipitation is not seen after reaching 8%, increase the PEG concentration in 2% increments until precipitation is seen (the solution will turn cloudy).\nCentrifuge at 3,214 x g for 5 min. Discard the supernatant completely; complete removal of all residual PEG is essential to achieve good solubilization at the next step. Resuspend the green precipitate in 2-5 mL of post-column resuspension buffer (Table 1).\nTo verify that thylakoids have been completely washed of PEG, spin a small aliquot of the resuspended material in a benchtop centrifuge at 18,407 x g at 4 °C for 5 min to ensure the material is soluble. A small green precipitate is acceptable at this stage, but most, if not all, the chlorophyll should remain in the solution. Keep the soluble fraction.\n5. Preparation of sucrose gradients\nPrepare 10%-30% discontinuous sucrose gradients in five layers (10%, 15%, 20%, 25%, and 30% layers) with sucrose gradient buffer (Table 1). Assemble the sucrose gradients by carefully layering sucrose fractions in a polyallomer centrifuge tube, starting with the 30% layer and ending with the 10% layer. Adjust the volume of every layer so that there is enough headspace at the top of the tube to load the desired volume of sample.\nLoad samples from the soluble material from step 4.2 into sucrose gradients. Load enough sample to equal 170 µg of chlorophyll into one tube, and 420 µg of chlorophyll into another to obtain gradients at different concentrations to assess each band's homogeneity (Figure 3A).\n\tNOTE: The amount of sample added is arbitrary but a range of about 150 to 500 µg of chlorophyll is usually appropriate.",
    "Centrifuge the gradients at 100,000 x g for 16 h to separate the different complexes within the sample.\n6. Removal of sucrose fractions and PEG precipitation\nAfter centrifugation, remove the gradients from the rotor and take pictures of the tubes using a digital camera or cellphone. Isolate the fractions by piercing the tubes at the bottom with a needle and then slowly draining the contents. Collect the different chlorophyll-containing fractions in centrifuge tubes.\n\tNOTE: The samples can be aliquoted and frozen for subsequent analysis if desired.\nFor some applications removal of sucrose is desirable. To remove sucrose, use a second step of PEG precipitation (or gel filtration). Adjust the NaCl concentration in the PSI-LHCI fraction to 120 mM and add PEG6000 to a final concentration of 10%.\nCentrifuge the sample in a benchtop centrifuge at 18,407 x g at 4 °C for 5 min. Resuspend the green pellet in 30 mM Tricine-NaOH pH 8.0, 50 mM NaCl and 0.05% β-DDM.\nCentrifuge the sample in a benchtop centrifuge at 18,407 x g at 4 °C for 5 min to ensure all the material remains in solution.\n7. Measuring P700 content of PSI\nNOTE: This method can be used to quickly assay PSI.\nDilute the samples to an OD680 of 1-1.5 and incubate in the dark with 10 mM ascorbic acid for 1 h to reduce P700 completely.\nMeasure the absorption spectrum of the sample using a UV-Vis spectrometer. Measure absorbance from only 650 nm to 750 nm with a data interval of 0.50 nm and a scan rate of 60 nm/min for assaying P700 content.\nExpose the sample to bright light (350 µmols photons/m2/s) and measure the spectrum again during exposure.\nSubtract the dark spectrum from the light spectrum to observe P700 bleaching at around 702 nm in plants.",
    "Determine the P700 content using the absorption at 700 nm and an extinction coefficient of 64/mM/cm as described in Hiyama and Ke32,33,34.\nMeasure the total chlorophyll amount (chlorophyll A and chlorophyll B) using the method described in Porra et al.31. Use these concentrations to determine the chlorophyll to P700 ratio.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}