{
  "id": 17560,
  "origin_website": "Jove",
  "title": "A New Model of Heart Failure Post-Myocardial Infarction in the Rat",
  "procedures": [
    "The protocol was approved by the Animal Ethics Research Committee of Shandong University of Traditional Chinese Medicine.\nNOTE: Adult male Sprague-Dawley rats, 10-weeks-old weighing 180-220 g, were randomly divided into 2 groups, sham (n = 25) and MI (n = 35). Animals were kept on a 12/12 h light/dark cycle and received water and food ad libitum.\n1. Anesthesia and continuous supply of oxygen\nPlace rats into an induction chamber and anesthetize with 3% isoflurane.\n\t\nTo confirm whether the anesthetization was ready, observe the toe pinch reflex. The anesthetization is sufficient when the toe pinch reflex disappears.\nIndividually move the rats to a small temperature-controlled surgery board. Tape the rat's paws to the board.\nAttach a mask to the rat face that provides a constant supply of 3% isoflurane and 1% oxygen.\n2. Induction of MI without ventilation or exteriorization of heart\nUse depilatory creams to remove the thorax hairs for sterilization.\nUse a sterile drape with a 1 cm x 3 cm hole at the surgical field of the rat.\nConfirm sufficient depth of anesthesia with a toe pinch before operating.\nOpen the chest with a transverse 2.5 cm incision between the third and fourth intercostal space on the left edge of the sternum without cutting the ribs.\nSeparate the pectoralis major and pectoralis minor muscles by using two vascular forceps without cutting the tissue or small blood vessels. Position the Weitlaner self-retaining retractor into the thorax to separate the third and fourth ribs to gain enough exposure of the heart while keeping rib integrity.\nDelicately dissect the pericardium with two forceps.",
    "Use a 6/0 nylon suture with a curved needle to permanently ligate the LAD 2.0-2.5 mm below the midpoint of the conus arteriosus and left atrial appendage connection. LAD can be easily recognized and found in some rats.\n\t\nConfirm appropriate ligation of the LAD after the anterior wall of the left ventricle turned pale.\nIn the sham group, pass only the suture under the LAD, but do not ligate.\nRemove the retractor and squeeze the air in the thorax out before suturing the muscle and skin layer by layer.\nAfter surgery, place the rats on a 37 °C heating pad for recovery. Monitor all animals, and provide ketoprofen (5 mg/kg SC) for analgesia every 24 hours up to 72 hours.\n\t​NOTE: For technical reasons, rats with smaller body weights (less than 250 g) are preferred for this operation. The time of keeping chest open, from step 2.4-2.8, was limited to 5 minutes.\n3. Assessment of cardiac function\nNOTE: To confirm whether HF developed successfully, the cardiac function was measured 4 weeks post-procedure using a TE7 ultrasound system equipped with a 13 MHz electronic transducer. During the echocardiography test, the rats were under the same anesthesia protocol used for the initial procedure.\nAfter shaving the anterior chest hair, position the rats on the board used for the previous operation.\nPlace the probe on the anterior chest wall and obtain images from the left parasternal long-axis (PLAX) views of the left ventricle (LV) (at the level of papillary muscles).\nMeasure the left ventricular internal dimensions at end-diastole (LVIDd) and end-systole (LVIDs) by M-mode from three consecutive cardiac cycles.\nCalculate the LV ejection fraction (LVEF) and the LV fractional shortening (LVFS) by the software of the machine.\n4. Further analysis of the HF model 4 weeks after LAD ligation",
    "Sacrafice the rats 4 weeks after LAD ligation by administering an overdose of isoflurane. Measure the serum concentrations of CK-MB, N-terminal pro-brain natriuretic peptide (NT-proBNP), Renin, Angiotensin (AngII), Aldosterone (ALD), TNF-α, VEGF, IL-6, and HIF-1α by using the ELISA kits according to manufacturer's protocol.\nTo harvest the hearts for histopathological analysis, perfuse the rat hearts with 4 °C physiologic saline before being removed.\nSet the hearts in 10% formalin for 24 hours, embed in paraffin, and slice at 5.0 µm thick sections transversely along the left ventricular axis.\nMount all sections of the heart on glass slides and individually stain with Hematoxylin and Eosin (HE) and Masson's trichrome.\nFor the purpose of infarct size measurement, stain hearts with 2,3,5-Triphenyl tetrazolium chloride (TTC).\n\t\nSlice the hearts transversally at 3 mm thick from apex to base in a semi-frozen state and incubated in 2% TTC solution for 20 minutes at 37 °C.\nWhen the color was established, fix slices in 4% paraformaldehyde solution for 15 minutes and take pictures.\nMark the infarct size and calculate by using ImageJ. Express the infarct size as a percentage of the infarct area versus the total LV area.\nTo quantitatively analyze the collagen content in the middle of the infarcted area of LV, stain the rat heart tissue sections with Masson's trichrome.\nAfter staining, scan the images and analyze. Evaluate the degree of fibrosis by the collagen volume fraction (CVF) which was expressed as a percentage of the fibrotic area versus the total LV area."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}