{
  "id": 17582,
  "origin_website": "Jove",
  "title": "Intra-Abdominal Pressure Measurements in Neurocritical Patients",
  "procedures": [
    "This protocol has been approved by the Institutional Review Board of Renji Hospital affiliated with the Shanghai Jiao Tong University School of Medicine.\n1. Patient inclusion and exclusion criteria\nInclude patients with Glasgow coma scale (GCS) ≤ 8, 18-85 years of age who have been diagnosed with TBI or ICH. The diagnosis of traumatic brain injury or cerebral hemorrhage was performed by clinicians using clinical manifestations and radiographic features.\nExclude patients who cannot tolerate catheterization. Also, exclude patients who have urinary tract infections, gastrointestinal system diseases, coagulopathy, and immune metabolic diseases.\n\tNOTE: In the present study, enrolled subjects were all adults, and there was no sex bias. If patients experience pain during catheterization, inject 2 mL of 1% lidocaine hydrochloride into the patient's lower urinary tract to relieve the discomfort.\nLay the patient in a supine position with genitals exposed and use iodophor to thoroughly disinfect the patient's perineum and urethral orifice three times.\nLubricate the Foley catheter (16 Fr) in the catheter bag and insert the whole catheter into the patient's urethra. Inject 20 mL of sterile normal saline into the balloon of the Foley catheter. Then slowly pull out the Foley catheter until the urine flows out of the catheter.\n\t​NOTE: If the patient needs surgery on admission, perform catheterization in the operating room. If not, perform catheterization in the neurologic intensive care unit.\n2. Preparations and connections\nNOTE: The IAP monitoring system consists of three components: disposable pressure sensors, a urodynamic monitor, and intra-abdominal pressure and urine volume data management software (see Table of Materials).\nConnect the urinary catheter to the collection bag with a sensor and fix the midline of the tee fittings at the same level as the patient's axilla's midline plane (Figure 1).",
    "Check that the entire tube is unobstructed to ensure that it can be filled with urine.\nInstall the sensor on the urine collection bag onto the IAP monitoring device  Figure 2).\n\tNOTE: The IAP monitoring device has a unique card slot for the sensor, and the sensor can be inserted into the slot to work.\nHang the urine collection bag below the IAP monitoring device.\n\tNOTE: When the urine collection bag reaches 2000 mL, the IAP monitoring device will sound an alarm. Empty the urine collection bag to continue monitoring.\nPress the Power button to turn on the IAP monitoring device.\nEnter the timing mode, set the mode parameters as required, and enter the standard display interface to determine the closed valve.\n\tNOTE: Timing mode sets a certain time interval to open the valve to release urine in the catheter. For this experiment, the time to open the valve was set to every 0.5 h and the duration was set to 3 min because, in this way, the IAP can be measured without affecting the patient's urination. The valve is located in the sensor and is usually closed in the mode setting.\nRotate the tee fitting, point the OFF end to the patient's urinary duct's direction, and unscrew the Luer joint sealing cap.\n\tNOTE: This step is similar to the invasive arterial pressure zeroing. There is a knob on the tee to rotate and close the catheter segment and loosen the sealing cap at the air end of the connection. The sensor on the equipment contacts the air to obtain the value of atmospheric pressure.\nLong press the return key for 3 s to enter the sensor setting interface, press OK to reset to zero, and press OK after \"reset to zero completed\" is displayed.",
    "Screw back the sealing cap and rotate the tee so that the OFF points towards the Ruhr cap's direction.\nAfter IBP in the standard display interface becomes positive and stable, the IBP displayed is the IAP value of the patient (Figure 3).\n\t​NOTE: If the displayed value is negative or greater than 30 mmHg, it means that it was not zeroed correctly and needs to be reset again.\n3. Recording and storing data of IAP\nNOTE: An intra-abdominal pressure and urine volume data management software is used to record and store IAP data. Ensure that the software is correctly installed on the work computer.\nConnect the IAP monitor and a computer via a wireless network on a router.\nOpen the intra-abdominal pressure and urine volume data management software on the laptop with the key inserted and enter the password to log in.\nWait for a few seconds until the software runs automatically.\n3.4.Click the Medical Record button and enter the patient's information, including the age, ID, bed number, gender, diagnosis.\nClick the Save button and wait 10 s to start data collection and storing. Figure 4 shows real-time data displayed in the software.\nClick the Layout Settings button to display the real-time monitoring of multiple patients as required (max=64). Adjust the window interface to see multi-patient monitoring and adjust the timeline to see the requirements' details, including the daily urine volume, daily changes in intra-abdominal pressure trend, demonstrated in Figure 5.\nClick the Trend Review button to see the detailed parameter changes,including the recorded parameter values and the trend chart for the duration.",
    "NOTE: Since the pressure sensor is valid for one week, ensure the patient's urine collection bag is replaced with a regular one. The data recorded by the software can be used for further analysis. It can be combined with other physiological data such as correlation analysis with intracranial pressure monitored at the same time to determine the effect of intra-abdominal pressure on intracranial pressure. To facilitate the calculation, 0.5 h mean IAP and 0.5 h mean ICP were selected to perform correlation analysis and plot the scatterplot using a statistical software."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}