{
  "id": 9004,
  "origin_website": "Jove",
  "title": "In Utero Electroporation Approaches to Study the Excitability of Neuronal Subpopulations and Single-cell Connectivity",
  "procedures": [
    "All animal procedures were approved by the Community of Madrid Animal Care and Use Committee, in compliance with national and European legislation (PROEX 118/14; PROEX 331/15). Maintain sterile conditions during the procedure.\n1. In Utero Electroporation\nNOTE: This protocol for IUE is adapted from others that have been previously published5,6,7. This manuscript describes a protocol for the IUE of E15.5 embryos, with modifications in the reporter strategy that allow for the study of the morphology of single neurons8 and their electrophysiological properties in a separate experiment using standard GFP reporter plasmids.\nPreparing the DNA\n\t\nPrepare DNA plasmids using an endotoxin-free isolation kit as per the manufacturer's instructions and dilute them in 1x phosphate-buffered saline (PBS).\n\t\t\nFor single-cell labeling, prepare 10 µL of DNA mixture per surgery (1 µL per embryo) using the following constructs and final concentrations: plasmid encoding a fluorescent protein reporter (e.g., CAG-DsRed29), 1 µg/µL as a control for electroporation efficiency; experimental plasmid to be tested, typically at 1 µg/µL; LoxP-stop-LoxP-fluorescent protein plasmid (CALNL-GFP10), 1 µg/µL; and construct-encoding Cre10, 1 - 4 ng/µL. Add 1 µL of 0.1% Fast Green in water (weight/volume) to visualize the injected DNA.\n\t\t\tNOTE: Cre recombination of the GFP construct occurs only in a few neurons, which allows the visualization and reconstruction of individual axonal projections (Figure 1A).\nFor standard patch-clamp studies, prepare 10 µL of DNA mixture per surgery (1 µL per embryo) of the following plasmid encoding a fluorescent protein (e.g., CAG-GFP11), 1 µg/µL as a reporter control; experimental plasmid, generally 1 µg/µL; and 1 µL of 0.1% Fast Green in water (weight/volume).\n\t\t\tNOTE: These are the standard electroporation conditions that analyze acute slices containing a large number of labeled excitatory neurons within the desired lamina. To perform patch-clamp studies in single cells, prepare the DNA as described in step 1.1.1.1.",
    "2. Preparation for Surgery\nPerform a survival surgery by using aseptic procedures. Ensure sterile conditions, including masks, gloves, instruments, and surgical field. Sterilize surgical instruments (scalpel, Adson forceps, hardened fine scissors, curved scissors, Dumont forceps, and needle holder).\nSelect borosilicate glass capillaries of 1/0.58-mm outer/inner diameter. Pull capillaries3. Target for an optimal tip length of 1 cm after pulling. Cut the needle tip at approximately a 30° angle using fine forceps (Figure 1B).\nPrepare 500 mL of sterile isotonic solution (1x PBS or Hank´s Balanced Salt Solution (HBSS)). Add penicillin-streptomycin 1:100 and warm this solution to 37 °C. It can be stored at 4 °C after the surgery.\nSubcutaneously inject a preoperative dose of analgesics (e.g., carprofen, 5 mg/kg bodyweight).\nKeep the animals warm for surgery by placing them on a heating pad. Warm a clean cage to 37 °C for postoperative recovery.\n3. Surgery\nAnesthetize a C57BL/6 E15.5 pregnant mouse with isoflurane. First, infuse a closed chamber with 3% isoflurane at 0.8 L/min oxygen and leave the mouse inside until it is asleep. Transfer the mouse to a heating pad and place the nose and mouth within a mask for delivery of isoflurane. Gradually decrease the anesthesia over the course of the surgery to 1.5% isoflurane via mask. Confirm proper anesthetization by observing a loss of the pedal reflex (toe pinch). The optimal procedure takes approximately 20 min and not more than 45 min.\nApply eye ointment to prevent the eyes from drying during the procedure.\nRemove the hair from a ~ 3-cm region of the abdomen (using either an electric razor or depilatory cream). Wash the surgical area with cotton swabs infused with 70% ethanol, followed by an iodine-infused cotton swab. Repeat three times.\nCover the surgical area with sterile gauze to prevent infections.",
    "Use the scalpel to make a vertical opening through the skin 2 cm long and parallel to the midline. Separate the skin and muscle of the abdomen using blunt curved scissors. Hold the muscle with the forceps and cut it through the linea alba to expose the abdominal cavity.\nLocate the embryos with the help of the forceps. Moisten two wet cotton swabs with the sterile saline solution prepared in step 2.3 and use them to manipulate an accessible embryo out of the opening. Place the cotton swabs around the embryo and gently extract both uterine horns from the abdominal cavity. Keep the embryos and the opened abdominal cavity hydrated with warm saline solution throughout the procedure to prevent them from drying out.\n4. Injection of DNA and Electroporation\nManipulate the embryos gently with fingers to locate the telencephalon (can be clearly visualized by the eye as the two more anterior vesicles of the brain). Place a prepared borosilicate capillary in a mouth pipette. Pass the tip of the needle through the uterus, avoiding blood vessels, until it reaches one lateral ventricle. Slowly inject approximately 1 µL of Fast Green-colored DNA solution until a large blue spot is observed.\nPlace the 7-mm platinum electrodes laterally on the head of the embryo (Figure 1C).\n\tNOTE: DNA is negatively charged; therefore, it moves toward the positive electrode when voltage is applied between the platinum electrodes. By varying the location of the electrodes, different areas of the brain can be targeted.\nApply voltage via the platinum electrodes (for E15.5 embryos: 5 pulses, 38 V, 50-ms interval cycle length, 950-ms interval pause. These conditions vary depending on the developmental stage)12.\n\tNOTE: See Table 1 for voltage conditions and electrodes for different embryo stages.\nRepeat steps 4.1 - 4.3 for each embryo.",
    "5. End of the Surgery and Postoperation\nUse cotton swabs to manipulate the uterus back into the mother. Fill the abdominal cavity with the warmed saline solution (add about 2 mL).\nSuture the muscle with simple interrupted stitches or a continuous stitch. Use #6-0 sutures.\nUse staples to close the external wound. Be careful to separate the skin from the muscle before stapling. Remove the nose mask.\nAllow the mouse to recover for 30 min in the heated, clean cage before placing it in the animal facility room. Do not leave an animal unattended until it has regained sufficient consciousness to maintain sternal recumbency. Do not place an animal that has undergone surgery in the company of other animals until fully recovered.\nSupervise the animal during the days following the surgery. Apply analgesics subcutaneously (carprofen, 5 mg/kg bodyweight) every 12 h for 2 days or according to animal legislation. No additional postoperative care is required for the pups.\n6. Preparation and Analysis of the Samples\nOptional: On P2, check for the expression of fluorescence in the electroporated pups using a fluorescent microscope; when the IUE is successful, fluorescence can clearly be seen in the head13. Mark or separate the mice that are positively electroporated for use in the following steps. Keep the dam and pups in standard animal facility conditions.\nAt the desired stage of study, perfuse the mice transcardially. Typically, the most active phase of dendritic and axonal growth corresponds to the first three postnatal weeks2,14,15.\n\t\nPrepare 30 mL of 4% paraformaldehyde (PFA) in 1x PBS per mouse and chill it on ice.\n\t\tCAUTION: PFA is a known allergen and carcinogen. It is toxic. Wear appropriate personal protective equipment.",
    "NOTE: The amount of PFA needed depends on the age of the mouse (e.g., for P16, 20 mL for the perfusion and 10 mL for the postfixation are needed).\nPrepare a ketamine-xylazine mix to anesthetize the animal with a 1:1:8 volumetric ratio of 100 µg/mL ketamine:100 µg/mL xylazine:PBS (prepare around 0.2 mL per mouse).\nAnesthetize the mouse by intraperitoneally injecting 0.2 mL of the mix prepared in step 6.2.2.\nPlace the anesthetized mouse on its back. Make a horizontal incision above the thorax using a scalpel. Cut the muscle and the diaphragm with fine scissors until the heart can be observed.\n\t\t\nMake an incision in the right atrium with the fine scissors. Slowly inject 20 mL of PBS in the left ventricle with a 25-gauge needle in order to remove the blood. Inject 20 mL PFA (step 6.2.1) until the mouse is rigid and the organs become white.\nImmediately remove the head and make a midline incision in the skin from the neck to the skull. Gently peel away the skull using curved forceps and extract the brain. Take special care not to puncture or damage the brain during the removal of the skull. Put the brain in 10 mL of 4% PFA at 4 °C overnight to postfix it.\nCryoprotect fixed brains in 10 mL of 30% sucrose in PBS at 4 °C for 1 - 2 days, until they sink. Prepare 1-cm3 aluminum foil cubes. Fill the cubes 2/3 of the way with OCT. Put the brains inside and freeze them by putting the cubes on dry ice. Store the frozen brains at -80 °C.",
    "Place drop of OCT on the surface of the specimen disc, peel the aluminum foil from the histology cube, and position the cube at the desired orientation to the specimen disk on top of the liquid OCT. Apply firm pressure until it is fixed. Insert the specimen disc into the specimen head of the cryostat. Orient the specimen (move it into a favorable position relative to the knife/blade).\n\t\nSection the brains on the cryostat. Select 50 - 100 µm-thick floating cryosections16 using a fine brush and place them in PBS.\nStain if desired.\n\tNOTE: For the study of axonal morphology, staining with a GFP antibody is strongly recommended2.\n\t\nBlock the sections for 1 h at room temperature with 5% fetal bovine serum in PBS containing 0.5% Triton-X 100 (blocking solution). Incubate overnight at 4 °C with 1:500 primary antibody (e.g., rabbit anti-GFP) diluted in blocking solution.\nWash the sections three times in PBS. Add 1:500 secondary antibody (e.g., goat anti-rabbit Alexa Fluor 488) diluted in blocking solution and incubate for 1 h at room temperature. Wash the sections three times in PBS.\nCounterstain with DAPI (1:10,000) in PBS containing 0.5% Triton-X 100 for 10 min. Rinse the sections with PBS. Mount the sections in an aqueous mounting medium16.\n7. Imaging and Analysis\nFluorescence or confocal microscopy\n\t\nTo reconstruct complete neurons, acquire the images with a high magnification (at least 40X) and high resolution (minimum 1,024 x 1,024). Select the \"Tile scan\" or equivalent option in the acquisition software to cover the area of interest, spanning all dendrites and axonal processes. Acquire a sufficient number of stacks on the z-axis to avoid a loss of information.",
    "NOTE: Generally, the microscope's software has an \"Optimized stack\" option, but if this is not the case, test manually to determine how many steps are necessary for the images to overlap in order to correctly define individual projections. Two crucial parameters are the pinhole and the objective; take into account \"higher magnification, more resolution, and more necessary z-steps.\"\nAnalysis\n\tNOTE: Although several parameters can be analyzed, step 7.2.1 focuses on two: dendrite morphology and axon branching. Download Fiji (http://fiji.sc/[href=http://fiji.sc/]).\n\t\nOpen the image, select the \"Segmented line\" option from the menu. Draw a line (moving up and down along the z-axis by scrolling the mouse) following the structure of the neuron. Go to \"Analyze, Tools, ROI Manager, Add\" (alternatively, press \"t\") to save the line. Repeat this process for every axon or dendrite of the analyzed neuron2.\nIn the ROI Manager Menu press the \"Measure\" button to get the length (or additional parameters). Export the measurements to a text file or spreadsheet to analyze them.\n8. Electrophysiology\nNOTE: The goal of this protocol is to obtain whole-cell current-clamp recordings from layer II/III pyramidal cell neurons identified visually by GFP expression in GFP-electroporated mouse brains (or any other fluorescent protein previously electroporated). It is an adaptation of previously published methods17,18. Using this protocol it is possible to study the effect of a genetic modification introduced by IUE on the electric properties of the neuron. The acquisition of specific firing modes is a gradual process of differentiation that involves the dynamic expression of a wide repertoire of ion channels and that results in the expression of transient firing modes before late postnatal stages. For example, mature electrical responses are not observed in layer II/III of the somatosensory mouse cortex before P162,19.\nPrerequisites for the acute slices",
    "Prepare sterile surgery tools to remove the brains from the mice: a guillotine, to remove the head; small scissors, to cut through the skull; forceps, to separate the skull from tissue; a spatula, to delicately remove brain tissue from its casing; a metallic slicer, to dissect the cortex into two equal halves; and a Pasteur pipette, to move slices from the vibratome (place them into a solution containing artificial cerebrospinal fluid (ACSF) for inspection, and then transfer the slices from ACSF to an incubation holding area).\nPrepare 1 L of ACSF using water of high purity (double-distilled water) containing 119 mM NaCl, 26 mM NaHCO3, 11 mM glucose, 2.5 mM KCl, 1.2 mM MgCl2, 2.5 mM CaCl2, and 1 mM NaH2PO4. Titrate the pH to 7.3 - 7.4 with HCl or NaOH. Adjust the osmolarity to 290 mOsm.\nBubble ACSF with carbogen (95% O2/5% CO2) for 15 - 20 min using Teflon tubes (~ 1 mm), to stabilize the pH to 7.3 - 7.4.\nFreeze 200 mL of ACSF solution saturated with carbogen at -80 °C for 10 - 15 min to generate a slushy dissection solution. Place a 100- x 20-mm tissue culture dish on ice for slicing the brain.\nPrepare 100 mL of 1% low-melting point agarose solution just before the start of the experiment. Cool the solution, cut out a square piece of agarose (dimensions: 1 x 1 x 0.5 mm), and superglue it to the back of the platform, right behind where the brain is sliced (agarose gel provides support for the brain during slicing). Make the front as flat as possible.\nObtaining acute slices",
    "Immobilize the mouse and anesthetize it with isoflurane 2%. Place the head into the guillotine opening and decapitate it swiftly. Remove its skull as fast as possible with the use of bone rangers or fine forceps. Put the brain into chilled ACSF.\n\t\tNOTE: It is important to perform this step quickly.\nPlace the brain in the chilled culture dish. Cut off the cerebellum with small scissors.\nPick up the brain with a spatula and blot it dry on a paper towel.\nGlue the ventrocaudal plane of the brain on a vibratome holder. Place the holder on a vibratome filled with ice-cold ACSF.\nObtain acute slices by cutting 300-µm coronal sections (ensure continued carbogenation throughout the procedure, e.g., place a bubbler (1-mm polytetrafluoroethylene tube) in the vibratome chamber) using the following vibratome settings: 0.06-mm amplitude and 0.08 - 0.10-mm/s speed. Set the advance to the slowest possible speed (~ 22 s per pass). Modify these optimal settings and obtain optimal conditions for each machine empirically if necessary.\nIncubate the acute slices for at least 60 min in ACSF supplemented with 3 mM myo-inositol, 0.4 mM ascorbic acid, and 2 mM sodium pyruvate while bubbling with 95% O2/5% CO2 gas. Maintain the temperature at 25 °C.\nPerform the slicing procedure in less than 15 min. If desired, the slices can be stored for 1 - 7 h before being transferred to the recording chamber for use.\nPrerequisites for the whole-cell recording\n\t\nMake sure that the electrophysiology station is equipped with a recording chamber, a perfusion system, a microscope, electrodes (recording, stimulating, and ground), macro- and micromanipulators, a rigid vibration-resistant table-top and Faraday cage, a stimulator, an amplifier and analog-to-digital (A/D) converter, a computer with acquisition software, and a GFP (or any other fluorochrome) filter for analyzing genetically modified neurons18 (Figure 2A).",
    "Prepare the intracellular solution, containing 115 mM potassium gluconate, 2 mM MgCl2, 10 mM HEPES, 20 mM KCl, 4 mM Na2ATP, and 0.3 mM Na3GTP, adjusted to pH 7.2 by KOH and to 290 mOsm by KCl.\nMake patch pipettes by pulling borosilicate glass capillaries. Prepare patch electrodes using a micropipette puller. Use borosilicate capillaries (1.5-mm outer diameter, 0.86-mm inner diameter, 10-cm length). Make patch electrodes showing resistances of 3-10 MΩ when filled with intracellular solution.\nPerfuse the recording chamber with ACSF at a rate of 2 mL/min. Maintain the temperature of the chamber at approximately 33 °C.\nWhole-cell recording\n\t\nTransfer the slices into the recording chamber using a Pasteur pipette (cut off the long tip) or a small brush. Hold down the slice with a harp. Perfuse the slices constantly with ACSF at a rate of 2 mL/min.\nPatch a GFP-positive neuron.\n\t\t\nPut the slice into the recording chamber and find the area of interest through the microscope at low magnification (10X). Then, find a GFP-positive cell to patch using the 60x objective.\nFill the recording electrode with intracellular solution. Use the syringe linked to the filter (4-mm filter) and micro-loader tip to fill the recording electrode with intracellular solution.\nPlace the glass pipette in the pipette holder. Place the pipette tip in the bath and focus on the tip. Once the pipette is in the bath, apply positive pressure through the back pressure control system.\nPatch a neuron that is fluorescent (Figure 2B).\n\t\t\t\nApproach the cell of interest under visual guidance while maintaining back pressure in the pipette. Upon the appearance of a small dimple on the cell surface, release the pressure. At this point, a tight seal (resistance larger than 1 GΩ) may be formed. Otherwise, apply a light negative pressure (suction) to facilitate it.",
    "While the seal is being formed, bring the holding voltage clamp to -60 mV. Once the GΩ seal is formed, apply a pulse of suction to rupture the cell membrane beneath the pipette and go into whole-cell mode. See reference20 for more details.\nRecord the activity using current-clamp conditions21. Once in whole-cell mode, switch from voltage-clamp to current-clamp mode and start recording. For example, to record cell excitability, apply 500 ms-long depolarizing current injections (100 - 400 pA).\n\t\t\t\nCalculate the firing rates by plotting the number of action potentials along the train for increasing input currents.\n\t\t\t\tNOTE: Resting membrane potential, input resistance, and membrane capacitance may also be calculated from the recordings21.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}