{
  "id": 3977,
  "origin_website": "Cell",
  "title": "Differentiation of human pluripotent stem cells to brain microvascular endothelial cell-like cells suitable to study immune cell interactions",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPreparing hESC/hiPSC cultures for endothelial progenitor cell (EPC) differentiation\nTiming: 10–14 days\nThis step describes the expansion of hPSC lines for producing healthy colonies of human embryonic stem cells (hESCs) or human induced pluripotent stem cells (hiPSCs) suitable for endothelial progenitor cell (EPC) differentiation. hPSCs are cultured under feeder-free conditions and passaged when reaching 80% confluency. hPSCs are passaged at least twice or cultured 2 weeks before starting the EPC differentiation.\nTiming: 1–1.5 h\nThis step describes the preparation of Matrigel-coated 6-well plates for hPSC culture. This Matrigel coating procedure is also used to prepare plates for use in hPSC differentiation.\nPrepare Matrigel-coated 6-well plates before starting the hPSC culture.\nAdd 30 mL cold DMEM/F-12 to a 50 mL tube. Using a micropipette, remove 1 mL of DMEM/F-12.\nUsing 1 mL of DMEM/F-12, pipet up and down to thaw and dissolve a Matrigel aliquot (containing 2.5 mg Matrigel).\nAdd thawed Matrigel to the 50 mL tube, containing 29 mL cold DMEM/F-12.\nAdd 1 mL of the resulting Matrigel solution to each well of the 6-well plates.\nAgitate each plate to ensure coverage of the complete bottom of each well with Matrigel solution and place in incubator (37°C, 5% CO2) for at least 1 h.\nNote: If all Matrigel-coated wells will not be needed immediately for culture, add 1 mL DMEM/F12 instead to the wells not needed and store in incubator (37°C, 5% CO2) up to 1 week.\nTiming: 30–60 min\nThis step describes the method of thawing hPSC lines. If hPSCs are in continuous culture in your laboratory, skip this step and proceed directly to step 3.\nThaw hESC/hiPSC lines.\nPrepare a 15 mL centrifuge tube containing 4 mL mTeSR1 medium at 20°C–25°C.",
    "Thaw 1 vial of cryopreserved hESCs/hiPSCs by rapidly rubbing the tube between your hands or swirling it in a 37°C water bath until there is only a small piece of ice remaining.\nSlowly add 500 μL of mTeSR1 medium to the cryotube and gently pipet up and down once to completely thaw hPSCs, then slowly transfer hPSCs to the centrifuge tube containing mTeSR1 medium.\nNote: At the first signs of thawing, hPSCs should immediately be transferred into 15 mL tube containing 4 mL of mTesR1 medium to reduce cryopreservation-mediated damage to the cell membranes.\nCritical: Avoid singularization of the hPSCs as hPSCs will attach and survive better if maintained as cell clumps.\nCentrifuge hPSCs at 200 g, 5 min, at 20°C–25°C. While hPSCs are centrifuging, label a Matrigel-coated plate with the name of the cell line, passage number, and passage date.\nRemove the supernatant and carefully resuspend the pellet in 2 mL of mTeSR1 medium + 10 μM ROCK inhibitor Y-27632 (add ROCK inhibitor stock solution at 1:1000) per well of a 6-well plate. Aspirate Matrigel coating solution from the 6-well plate and seed the hPSCs suspension onto Matrigel-coated wells.\nNote: Consult documentation from the source of hESCs/hiPSCs for the recommended number of wells one vial should be thawed into.\nCritical: Avoid too intense resuspension as hPSCs will better attach and survive if maintained as cell clumps.\nTransfer 6-well plate into the incubator (37°C, 5% CO2) and gently move the plate back and forth and from side to side on the incubator shelf to evenly distribute the cells.\nNote: Avoid circular motions to prevent cells from pooling in the center of the well. It is important to place the plate onto the incubator shelf first and move the plate using the shelf as support inside the incubator.",
    "One day later, remove ROCK inhibitor Y-27632 by replacing medium in each well with 2 mL of mTeSR1 medium.\nTiming: 3–7 days (when you use hPSCs already thawed previously)\nTiming: 2–3 weeks (when you use freshly thawed hPSCs)\nThis step describes the maintenance of hPSCs, which is essential before starting EPC differentiation.\nMaintenance of hPSCs (passage before start of differentiation)\nChange mTeSR1 medium every day to reduce probability of spontaneous differentiation.\nNote: Because the proliferation rate is hPSC line-dependent, hPSCs will be ready for the first passage in 4–7 days.\nOnce hPSCs reach approximately 80% confluency, typically when individual colonies begin to touch, prepare a Matrigel-coated 6-well plate for passaging.\nAspirate medium from one well of hPSCs, wash hPSCs with 1 mL Versene, and subsequently aspirate Versene from well.\nAdd 1 mL of Versene to the well of hPSCs. Incubate at 37°C, 5% CO2 in the incubator for 4–7 min, depending on cell line.\nWhile hPSCs are dissociating, label a new Matrigel-coated plate with the name of the cell line, passage number, passage date, and split ratio (usually 1:6 ratio). Aspirate Matrigel coating solution from 3 wells and add 1 mL of mTeSR1 medium per well of the 6-well plate.\nPrepare a 15 mL centrifuge tube containing 2 mL of mTeSR1 medium at 20°C–25 °C.\nObserve the detachment process of the hPSCs under the microscope. Once hPSCs start to detach (Methods video S1[href=https://www.wicell.org#mmc1]), remove Versene and dissociate hPSCs by vigorously pipetting 2 mL of mTeSR1 medium.\nNote: If hPSCs do not detach well, gently scrape hPSCs using the tip of a 5 mL pipet and pipetting mTeSR1 over the hPSCs again. Gentle scraping yields larger clumps of hPSCs than prolonged Versene treatment, which may improve hPSC maintenance.\n    Your browser does not support HTML5 video.",
    "Methods video S1. Stop timing of Versene incubation during hPSCs passage, related to step 3 “g”\nCollect 1 mL of the resulting hPSCs suspension in mTeSR1 medium and transfer to the 15 mL conical tube containing 2 mL of mTeSR1 medium.\nDistribute 1 mL of hPSC suspension into each well of the plate prepared in step “e” (for a total volume 2 mL per well). In this way, hPSCs are passaged at a 1:6 ratio.\nNote: Split ratio may need to be optimized for individual hPSCs lines or based on the hPSC number needed for EPC differentiation.\nTransfer 6-well plate into the incubator (37°C, 5% CO2) and gently move the plate back and forth and from side to side on the incubator shelf to evenly distribute the cells.\nNote: Avoid circular motions to prevent cells from pooling in the center of the well. It is important to place the plate onto the incubator shelf first and move the plate using the shelf as support inside the incubator.\nIf using a newly thawed hPSC line, maintain hPSC in culture and passage at least once more before initiating an EPC differentiation. This allows hPSCs recover from freezing.\nCritical: Usually the newly passaged hPSCs reach 80% confluency in 4–7 days. If it takes longer, the risk of spontaneous differentiation increases. In this case, we recommend increasing split ratio.",
    "Critical: Make sure that the hPSC cultures used for EPC differentiation (section “differentiation hPSCs into endothelial progenitor cells (EPCs)”) lack spontaneous cell differentiation events. To eliminate cells that have undergone spontaneous differentiation, either (i) passage undifferentiated hPSC colonies by picking colonies using a sterile pipette tip or (ii) treat cultures with Versene for a reduced time (2–3 min) as explained in step “d,” which often facilitates selective detachment of hPSC colonies while spontaneously differentiated cells remain attached to the plate. For the details on the maintenance of hPSC colonies, please refer to manufacturer’s instructions (https://cdn.stemcell.com/media/files/manual/10000005505-Maintenance_of_Human_Pluripotent_Stem_Cells_mTeSR1.pdf?_ga=2.138301808.1976489461.1615541621-432292338.1615280857[href=https://cdn.stemcell.com/media/files/manual/10000005505-Maintenance_of_Human_Pluripotent_Stem_Cells_mTeSR1.pdf?_ga=2.138301808.1976489461.1615541621-432292338.1615280857]).\nDifferentiation of hPSCs into EPCs\nTiming: 9 days\nThis step describes the differentiation of hPSC lines into endothelial progenitor cells (EPCs). For background information on the development of the protocol, please refer to Nishihara et al. (2020a)[href=https://www.wicell.org#bib6], Baoet al. (2016)[href=https://www.wicell.org#bib1], and Lian et al. (2014)[href=https://www.wicell.org#bib5].\nTiming: 3 days\nThis step describes the first phase of the EPC differentiation protocol: seeding and expansion of hPSCs prior to EPC differentiation.\nSingularized hPSC seeding and expansion for CD31+CD34+ EPC differentiation (Day -3 – Day -1)\nInitiate differentiation once hPSC colonies reach 80% confluency (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/696-Fig1.jpg\nFigure 1. Protocol overview\nSchematic of protocol steps, typical brightfield image of cells, and snapshot of medium color during differentiation is shown. Scale bar = 100 μm.\nPrepare Matrigel-coated 12-well plates using the method in step 1, except use 0.5 mL of Matrigel solution per well of each 12-well plate. Incubate at least 1 h at 37°C.\nAspirate mTeSR1 medium from one well of hPSCs in a 6-well plate.\nNote: Typically, we collect hPSCs from one well of 6-well plate (2.5 – 3.5 ×106 cells) for differentiation.\nAdd 1 mL Accutase to the well and incubate at 37°C until all the hPSCs have completely detached (approximately 7 min).",
    "Using a micropipette, collect hPSCs, and pipette gently over surface 2–3 times to dislodge any remaining hPSCs and obtain a single cell suspension. Transfer hPSCs into a 15 mL centrifuge tube containing 4 mL of mTeSR1 medium.\nResuspend well and take 10 μL of the hPSC suspension and pipet into a Neubauer Chamber.\nCentrifuge hPSCs for 5 min at 200 g, at 20°C–25 °C.\nCount hPSCs on Neubauer Chamber and calculate appropriate volume of cells to add to each 12-well plate (range 75–400 ×103 hPSCs per well of a 12-well plate).\nNote: We recommend seeding at least 6 wells of a 12-well plate for EPC differentiation.\nCritical: The seeding density must be optimized for each individual hPSC line and for each passage number depending on the growth rate of the hPSCs. When using a hPSC line for the first time, we recommend seeding at several different seeding densities (e.g., 75 ×103, 100 ×103, 200 ×103, 400 ×103 hPSCs per well of a 12-well plate) and evaluating the resulting yield of CD31+ EPCs.\nAfter centrifuging down the hPSCs, remove the supernatant and resuspend the pellet in 1 mL of mTeSR1.\nAdd appropriate volume of hPSCs calculated in step “h” to each well of a 12-well plate containing 1 mL mTeSR1 + 10 μM ROCK inhibitor Y-27632 (add ROCK inhibitor stock solution at 1:1000).\nTransfer 6-well plate into the incubator (37°C, 5% CO2) and gently move the plate back and forth and from side to side on the incubator shelf to evenly distribute the cells.\nNote: Avoid circular motions to prevent cells from pooling in the center of the well. It is important to place the plate onto the incubator shelf first and move the plate using the shelf as support inside the incubator.",
    "Approximately 24 h later (i.e., Day -2), remove mTeSR1 + ROCK inhibitor and replace medium with 2 mL of mTeSR1 medium per well.\nNote: Stem cells treated with the ROCK inhibitor should have a mesenchymal morphology (Figure 1[href=https://www.wicell.org#fig1]).\nApproximately 24 h later (i.e., Day -1), replace medium with 2 mL of mTeSR1 medium per well.\nNote: After withdrawal of the ROCK inhibitor, hPSCs should regain their typical hPSC morphology of tightly packed cells with well-defined edges (Figure 1[href=https://www.wicell.org#fig1]).\nCritical: Seeding density of hPSCs at Day -3 is critical for successful EPC differentiation. Seeding density needs to be optimized for each hPSC line, as well as for each passage. For example, seeding 75–100 ×103 hPSCs per well of a 12-well plate works well for the commercially available IMR90-4 line. The range of seeding density varies from 75–400 ×103 hPSCs per well of a 12-well plate (20–100 ×103/cm2).\nTiming: 6 days\nThis step describes the second phase of the EPC differentiation protocol. Briefly, mesoderm differentiation is initiated by adding the GSK3 inhibitor for 2 days, and the cells are subsequently expanded for 3 days.\nEndothelial progenitor differentiation with GSK3 inhibitor CHIR99021 (Day 0–Day 5)\nAt Day 0, prepare LaSR basal medium supplemented with 8 μM CHIR99021 and allow to warm to 20°C–25 °C. Remove mTeSR1 and add 2 mL of LaSR basal medium supplemented with 8 μM CHIR99021 to each well of 12-well plate.\nAt Day 1, aspirate the medium and replace with 2 mL of LaSR basal medium supplemented with 8 μM CHIR99021 at 20°C–25°C.\nAt Day 2, 3, and 4, aspirate the medium and replace with 2 mL of LaSR basal medium (without CHIR99021) prewarmed to 20°C–25°C.",
    "Critical: hPSCs should be confluent by Day 1, or at the latest Day 2 (Figure 1[href=https://www.wicell.org#fig1]). If the hPSCs do not reach confluency by Day 2, the differentiation usually fails. In this case, we recommend increasing the seeding density of hPSCs.\nCritical: If many cells are detached from the surface at Day 3–Day 5, we recommend decreasing the initial hPSCs seeding density. See troubleshooting problem 1[href=https://www.wicell.org#sec6.1].\nCritical: Though we identified 7–8 μM CHIR99021 is optimal for the hPSC lines that we tested, other hPSC lines may respond to CHIR99021 treatment differently. Therefore optimization of CHIR99021 concentration may be required.\nCritical: The effect of CHIR99021 may change between different lots, therefore the CHIR99021 concentration should be validated when switching the CHIR99021 lot.\nTiming: 3–4 h\nThis step describes the final phase of the EPC differentiation protocol: purification of EPCs by MACS.\nPurification of EPCs by magnetic activated cell sorting (MACS) using positive selection for FITC-labeled CD31+ cells.\nAt Day 5, aspirate the medium, add 1 mL Accutase to each well, and incubate at 37°C, 5% CO2 in the incubator for 6–8 min.\nPipette 5–10 times with a micropipette to obtain a single-cell suspension and then filter the cell suspensions through a 40 μm Falcon cell strainer into a 50 mL Centrifuge tube containing 12 mL DMEM/F-12-10 medium.\nNote: We use 50 mL Centrifuge tube from nerbe plus because the diameter fits well to the 40 μm Falcon cell strainer.\nFill DMEM/F-12-10 medium up to 50 mL to stop Accutase reaction, resuspend cells and take 10 μL of the cell suspension and place onto Neubauer Chamber.\nNote: If you use more than two 12-well plates (more than 24 mL of Accutase), transfer cell suspension into two 50 mL tubes.\nCentrifuge the cells at 200 g for 5 min at 20°C–25°C.",
    "Count cell number.\nAfter centrifugation, aspirate the supernatant and add 15 mL DMEM/F-12-10 medium to resuspend the pellet. Transfer the resulting cell suspension into a fresh 15 mL centrifuge tubes.\nCentrifuge the cells at 200 g for 5 min at 20°C–25°C.\nAspirate the supernatant and resuspend the cell pellets at a concentration of 1 × 107 cells per 100 μL Flow Buffer-1.\nAdd 1:100 of FcR blocking reagent (provided from EasySep FITC Positive Selection Kit II) and incubate for 5 min.\nAdd 1:200 of FITC-conjugated CD31 antibody.\nNote: Manufacturer recommends 1:50 dilution for FITC-conjugated CD31 antibody without providing antibody concentration, however we have found that 1:200 dilution works as well. You may need to adjust appropriate dilution of FITC-conjugated anti-CD31 antibody depending on lot number (range from 1:50 -1:400).\nIncubate the mixture in the dark at 20°C–25°C for 30 min.\nAfter incubation, add 10 mL FlowBuffer-1 and take a 10 μL sample to perform flow cytometry analysis (Figure 2[href=https://www.wicell.org#fig2]) and centrifuge the remaining cell suspension at 200 g for 5 min at 20°C–25°C.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/696-Fig2.jpg\nFigure 2. Flow cytometry analysis of pre-MACS and post-MACS sorted cells at day 5 of EPC differentiation\nSamples were examined for the fraction of CD31+ cells using a flow cytometer.\nNote: If you cannot perform flow cytometry analysis immediately, store the sample for flow cytometry at 4°C until finished with the MACS.\nCritical: It is recommended that the pre-sort cell mixture contain more than 10% of CD31+ EPCs before proceeding to MACS. If the EPC percentage is less than 6%, optimize initial seeding density and/or CHIR99021 concentration.",
    "Aspirate the supernatant, resuspend the cell pellet at a concentration of 1 × 107 cells per 100 μL Flow Buffer-1, and add EasySep FITC Selection Cocktail at 5 μL per 100 μL antibody labeled cell suspension. Resuspend well and incubate at 20°C–25°C for 15 min.\nVortex Magnetic Nanoparticles and add Magnetic Nanoparticles at 5 μL per 100 μL cell suspension, resuspend well by pipetting and incubate at 20°C–25°C for 10 min.\nBring the cell suspension to a total volume of 2.5 mL Flow Buffer-1, resuspend the cells, and then transfer into a 5 mL round-bottom flow cytometry tube.\nPlace the flow cytometry tube (without cap) into the magnet and incubate for 5 min.\nPick up the magnet, and in one continuous motion invert the magnet and flow tube, pouring off the supernatant fraction, containing FITC-CD31 antibody unlabeled cells. Leave the magnet and tube inverted for 2–3 s allowing supernatant drop off, remove the drop at the edge of the tube by careful aspiration with a Pasteur pipet attached to a vacuum pump, then return tube containing the CD31+ cells to an upright position (Methods video S2[href=https://www.wicell.org#mmc2]).\nCritical: The EasySep manufacturer’s instructions (https://cdn.stemcell.com/media/files/pis/DX22365-PIS_1_0_0.pdf?_ga=2.180300580.1448779528.1614351881-737646090.1614351881[href=https://cdn.stemcell.com/media/files/pis/DX22365-PIS_1_0_0.pdf?_ga=2.180300580.1448779528.1614351881-737646090.1614351881]) do not recommend shaking or blotting off any drops that may remain hanging from the mouth of the tube, however we have found that careful aspiration of these last drops increases EPC purity after MACS.\n    Your browser does not support HTML5 video.\n  \nMethods video S2. Tips for increasing post-MACS EPC purity during washing procedure of MACS, related to step 6 “q”\nRemove the flow cytometry tube, containing the CD31+ cells from the magnet, add 2.5 mL FlowBuffer-1, and resuspend the cell suspension by gently pipetting up and down 2–3 times.\nPlace the flow tube back into the magnet and incubate for 5 min.",
    "Repeat steps “q–s” three times and then step “q” once more (for a total of 4 washes).\nRemove the flow cytometry tube from the magnet and resuspend the purified CD31+ cells in an appropriate amount of desired medium (hECSR for extended EC culture or Freezing medium for freezing).\nResuspend CD31+ cells and take a 10 μL sample of cell suspension for counting.\nTake an additional 10 μL sample of cell suspension for flow cytometry analysis. Use a flow cytometer to assess the percentage of CD31+ cells in the pre-MACS (step “l”) and post-MACS samples (Figure 2[href=https://www.wicell.org#fig2]).\nCritical: For successful selective EC passaging described below, we recommended post-MACS purity of > 95%. If the purity is low, see troubleshooting problem 2[href=https://www.wicell.org#sec6.3].\nExtended endothelial cell culture method to differentiate brain microvascular endothelial cell-like cells (EECM-BMEC-like cells) and smooth muscle-like cells (SMLCs)\nTiming: 10–15 days\nThis step describes the culture of EPCs and induction of BMEC-like cells by the extended endothelial cell culture method, as well as SMLC culture and preparation of SMLC-derived conditioned medium (CM). SMLCs are a biproduct of EECM-BMEC-like cell differentiation and their co-culture or the CM derived from SMLCs is essential to achieve optimal VCAM-1 expression on EECM-BMEC-like cells.\nTiming: 30–60 min\nThis step describes the preparation of collagen IV coated plates for the EECM-BMEC-like cell culture.\nPrepare 10 μg/ml collagen IV (Collagen IV for tissue culture plate coating)-coated 6-well plate\nDilute a 300 μL aliquot of collagen IV (1 mg/mL) in 30 mL sterile water (Water, sterile, cell culture from Sigma) and add 1 mL of the colloidal solution to each well of the 6-well plates. Incubate plates with collagen IV for at least 30 min at 37°C and for up to 1 week.\nTiming: 3–5 days",
    "This step describes the culture of EECM-BMEC-like cells on collagen IV-coated plates before selective EC passage.\nSeeding hPSC-derived EPCs for extended endothelial cell culture\nAspirate collagen IV coating solution from the 6-well plate. Add 1–2 × 105 purified CD31+ EPCs in 2 mL hECSR supplemented with 5 μM ROCK inhibitor Y-27632 (add ROCK inhibitor stock solution at 1:2000) per well of the 6-well plate.\nNote: Seeding density must be optimized for individual hPSC lines. We recommend seeding CD31+ EPCs at a density such that CD31+ cells reach 100% confluency in 3–7 days.\nTransfer 6-well plate into the incubator (37°C, 5% CO2) and gently move the plate back and forth and from side to side on the incubator shelf to evenly distribute the cells.\nNote: Avoid circular motions to prevent cells from pooling in the center of the well. It is important to place the plate onto the incubator shelf first and move the plate using the shelf as support inside the incubator.\nApproximately 24 h later, remove ROCK inhibitor by aspirating hECSR medium and replacing with 2 mL fresh hECSR medium pre-warmed to 20°C–25°C.\nThereafter, change hECSR medium every second day until CD31+ cells reach 100% confluency (Figure 1[href=https://www.wicell.org#fig1])\nNote: If the regular cell-feeding schedule cannot be accommodated over the weekend, we recommend changing medium on Friday evening and again Monday early morning.\nOnce CD31+ cells reach 100% confluency, perform selective passaging as described below (step 9).\nCritical: In general, waiting until CD31+ cells reach 100% confluency will lead to successful selective passage. However, for some hPSC lines, smooth muscle-like cells (SMLCs) also detach if cultures are 100% confluent. In this case, we recommend attempting selective passage with a less confluent (80% or less) culture.\nTiming: 3–5 days",
    "After initial expansion of EPCs, resulting cultures typically contain both ECs and SMLCs. This step describes a method to separate the two cell types and generate pure cultures of ECs (to establish EECM-BMEC-like cells) and SMLCs (for preparation of SMLC-derived CM).\nSelective EC passage to establish EECM-BMEC-like cells and SMLCs (Methods video S3[href=https://www.wicell.org#mmc3])\nPrepare a collagen IV-coated 6-well plate as described in step 7.\nAspirate hECSR medium from 6-well plate containing CD31+ cells and add 1 mL of Accutase to each well of the 6-well plate.\nCarefully monitor cell morphology under a microscope. Once ECs (but not non-ECs) appear round (Figure 9[href=https://www.wicell.org#fig9], Methods video S3[href=https://www.wicell.org#mmc3]), tap the edge of the 6-well plate to detach ECs. After tapping, many ECs should detach and non-ECs remain attached to the plate (Figure 9[href=https://www.wicell.org#fig9]).\nNote: The procedure normally takes 2–5 min.\nCollect detached ECs by avoiding resuspending non-ECs and transfer to a 15mL centrifuge tube containing 4 mL of hESFM.\nAdd 2 mL hECSR medium to each well containing remaining attached non-ECs to obtain smooth muscle-like cells (SMLCs). Return the plate to the incubator.\nResuspend the EC suspension in the 15 mL tube well and collect 10 μL of EC suspension for counting.\nCentrifuge ECs at 200 g, 5 min, at 20°C–25°C.\nAspirate supernatant and resuspend the pellet in 2 mL of hECSR medium per 1–2 × 105 ECs.\nAspirate collagen IV coating solution from the new 6-well plate. Add 2 mL EC suspension per well.\nTransfer 6-well plate into the incubator (37°C, 5% CO2) and gently move the plate back and forth and from side to side on the incubator shelf to evenly distribute the cells.",
    "Note: Avoid circular motions to prevent cells from pooling in the center of the well. It is important to place the plate onto the incubator shelf first and move the plate using the shelf as support inside the incubator.\nThereafter, change hECSR medium every second day until ECs reach 100% confluency (typical EC growth is shown in Figure 1[href=https://www.wicell.org#fig1]).\nNote: If the regular cell-feeding schedule cannot be accommodated over the weekend, we recommend changing medium on Friday evening and again Monday early morning.\nNote: Usually, 2–3 selective passages will yield nearly pure cultures of ECs (Figure 1[href=https://www.wicell.org#fig1]), which are ready for functional assays (steps 13–16). In general, we consider ECs at passages 3–5 as EECM-BMEC-like cells. Proliferation typically slows after further passaging, however this is variable between different hPSC lines.\nNote: If selective passaging is unsuccessful, see troubleshooting problem 3[href=https://www.wicell.org#sec6.5].\nFor SMLC culture, change hECSR medium every other day (typical SMLC growth is shown in Figure 1[href=https://www.wicell.org#fig1]). To produce SMLC-conditioned medium (CM), instead of aspirating hECSR medium when changing medium, collect hECSR medium and filter using a 0.22 μm filter. This CM can be used for enhancing VCAM-1 expression on EECM-BMEC-like cells.\n    Your browser does not support HTML5 video.\n  \nMethods video S3. Selective passage, related to step 9\nNote: We usually pool SMLC-CM until SMLCs reach 100% confluency.\nCryopreservation and thawing of EPCs, EECM-BMEC-like cells, or SMLCs\nTiming: 30 min–1 h\nAfter MACS, resulting EPCs can be cryopreserved for future use. Frozen EPCs can be used for extended endothelial cell culture (step 8) after thawing (step 12). This step describes the method of freezing EPCs.\nFreezing EPCs",
    "Immediately after the last MACS wash (step 6 “q–s”), resuspend the EPCs in freezing medium at a concentration of 1–2 × 106 cells per mL. Transfer 1 mL of EPCs suspension to each cryotube.\nTransfer cryotubes to a controlled-rate freezing device and immediately place at −80°C.\n24 to 48 h later transfer to liquid nitrogen tank for long-term storage.\nNote: EPCs can be stored in liquid nitrogen for at least 2 years.\nTiming: 30 min–1 h\nAfter selective passage, resulting EECM-BMEC-like cells or SMLCs can be cryopreserved for future use. Frozen EECM-BMEC-like cells and SMLCs are ready to use for quality control analyses (steps 13–16) after thawing (step 12). This step describes the method of freezing of EECM-BMEC-like cells and SMLCs.\nFreezing EECM-BMEC-like cells and SMLCs\nAspirate hECSR medium from 6-well plate containing EECM-BMEC-like cells or SMLCs and add 1 mL of Accutase per well of a 6-well plate.\nIncubate at 37°C, 5% CO2 in the incubator until cells detach (approximately 7 min for EECM-BMEC-like cells and 20–30 min for SMLCs).\nCollect cells in a 15 mL centrifuge tube containing 4 mL of hESFM or DMEM/F-12-10 per 1 mL Accutase.\nResuspend EECM-BMEC-like cells or SMLCs suspension well and collect 10 μL of cell suspension for counting.\nCentrifuge EECM-BMEC-like cells or SMLCs at 200 g, 5 min, at 20°C–25°C.\nAspirate supernatant and resuspend the EECM-BMEC-like cells or SMLCs pellet in freezing medium at a cell number of 1–2 × 106 cells per mL. Transfer 1 mL of cell suspension to each cryotube.\nTransfer cryotubes to a controlled-rate freezing device and immediately place at −80°C.\n24 to 48 h later transfer cryotubes to liquid nitrogen tank for long-term storage.\nNote: EECM-BMEC-like cells and SMLCs can be stored in liquid nitrogen for at least 2 years.",
    "Note: Fresh cultured EECM-BMEC-like cells and thawed EECM-BMEC-like cells show comparable permeability values for sodium fluorescein and adhesion molecule phenotype.\nCritical: If EECM-BMEC-like cell proliferation is slow before freezing, EECM-BMEC-like cells may not form good confluent monolayers when cultivated on Transwell filters.\nTiming: 30 min–1 h\nThis step describes the method for thawing EPCs, EECM-BMEC-like cells and SMLCs.\nThawing EPCs, EECM-BMEC-like cells and SMLCs\nPrepare a collagen IV-coated 6-well plate as described in step 7.\nPrepare a 15 mL Centrifuge tube containing 4 mL of hESFM or DMEM/F-12-10.\nThaw a cryotube containing EPCs, EECM-BMEC-like cells, or SMLCs rapidly rubbing the tube between your hands it in your hand or swirling in a 37°C water bath until there is only a small piece of ice remaining.\nSlowly add 500 μL of hESFM or DMEM/F-12-10 medium to the cryotube, and then transfer the cell suspension to the centrifuge tube and resuspend.\nRinse the cryotube once with 1 mL hESFM or DMEM/F-12-10 and transfer to the centrifuge tube.\nCentrifuge cells at 200 g, 5 min, at 20°C–25°C.\nRemove supernatant and resuspend the pellet in 2 mL hECSR medium supplemented with 5 μM ROCK inhibitor Y-27632 at a cell count of 2–3 × 105 cells. Add 2 mL cell suspension to each well of a 6-well plate.\nTransfer 6-well plate into the incubator (37°C, 5% CO2) and gently move the plate back and forth and from side to side on the incubator shelf to evenly distribute the cells.\nNote: Avoid circular motions to prevent cells from pooling in the center of the well. It is important to place the plate onto the incubator shelf first and move the plate using the shelf as support inside the incubator.\nOne day later, remove ROCK inhibitor Y-27632 by replacing medium in each well with hECSR medium.",
    "Note: We recommend waiting until EECM-BMEC-like cells become 100% confluent before starting functional assays and molecular characterization. EECM-BMEC-like cells typically become 100% confluent at 2-3 days after thawing.\nQuality control analyses of EECM-BMEC-like cells\nBelow, we provide protocols for quality control analyses of EECM-BMEC-like cells, including functional assays for small molecule permeability and immune cell adhesion, and molecular assays for key endothelial junctional and immune cell adhesion molecule expression. These quality control analyses are critical to ensure that the differentiation has proceeded successfully and that EECM-BMEC-like cells derived from different hPSC lines and in different laboratories are substantially similar and have expected phenotypes.\nTiming: 6 days for EECM-BMEC-like cell culture and 1.5–2 h for permeability assay\nThis step describes methodology for quality control of the diffusion barrier properties of EECM-BMEC-like cells by performing a permeability assay for a small molecular tracer.\nMeasuring sodium fluorescein permeability (Methods video S4[href=https://www.wicell.org#mmc4]) (sample raw data and calculations are shown in Table 1[href=https://www.wicell.org#tbl1] and expected results are shown in Figure 11[href=https://www.wicell.org#fig11])\ntable:files/protocols_protocol_696_27.csv\nPrepare 200 μL of 4:1:5 collagen IV/fibronectin/water coating solution (see materials and equipment[href=https://www.wicell.org#materials-and-equipment]) per Transwell filter (PC Membrane, 0.4 μm, 12 mm, TC-Treated from Costar). Add 200 μL to each Transwell filter and incubate in the incubator (37°C, CO2 5%) for at least 4 h. We recommend incubating coated filters more than 8 h.\nAspirate hECSR medium from EECM-BMEC-like cells at passage 3–5 and add 1 mL of Accutase per well of a 6-well plate.\nIncubate at 37°C, 5% CO2 in the incubator until EECM-BMEC-like cells detach (approximately 7 min).\nCollect EECM-BMEC-like cells in a 15 mL centrifuge tube containing 4 mL of hESFM or DMEM/F-12-10.\nResuspend EECM-BMEC-like cell suspension well and take 10 μL of cell suspension for counting.\nCentrifuge EECM-BMEC-like cells at 200 g, 5 min, at 20°C–25°C.",
    "Aspirate supernatant and resuspend the EECM-BMEC-like cell pellet in 500 μL hECSR medium with a cell count of 1.12 × 105 cells. Aspirate the collagen IV/fibronectin/water coating solution from Transwell filters and add 500 μL of the EECM-BMEC-like cell suspension to each Transwell filter. Add 1.5 mL of hECSR medium to the bottom chamber.\nNote: We recommend preparing triplicate Transwell filters for measurement and one blank filter without cells.\nTransfer 6-well plate into the incubator (37°C, 5% CO2) and gently move the plate back and forth and from side to side on the incubator shelf to evenly distribute the cells.\nNote: Avoid circular motions to prevent cells from pooling in the center of the well. It is important to place the plate onto the incubator shelf first and move the plate using the shelf as support inside the incubator.\nThereafter change hECSR medium every second day until day 6.\nAt day 6, prepare a new 12-well plate containing 1.5 mL warm hECSR medium per well. Use forceps to carefully transfer the Transwell filters intended for permeability assay (including the blank Transwell filter) to this new 12-well plate.\nIn a 15 mL centrifuge tube, prepare 500 μL of 10 uM sodium fluorescein solution in hECSR medium (add sodium fluorescein stock solution at 1:1000) per Transwell filter (including the blank Transwell filters).\nRemove hECSR medium from the top chamber and replace with 500 μL hECSR medium containing 10 μM sodium fluorescein in all samples (including the blank Transwell filters).",
    "At 15, 30, 45, and 60 min, collect 150 μL of medium from the bottom chamber of each Transwell and place into a 96-well plate (flat bottom). Go into the bottom chamber at the side of the filter and pipette gently up and down 2–3 times with micropipette before extracting 150 μL. Replace the missing volume with 150 μL pre-warmed hECSR medium into the bottom chamber.\nAt the 60-minute time point, also collect 150 μL of medium from the top chamber of each Transwell and transfer to a 96-well plate.\nPlace an additional 150 μL of hECSR medium without sodium fluorescein in the 96-well plate for background subtraction.\nNote: Samples from the top chambers may need to be diluted to prevent an oversaturated signal.\nRead the fluorescence intensity using a fluorescent plate reader (485 nm excitation/530 nm emission) (example of raw data measured on a plate reader and example of Pe calculation is found in Table 1[href=https://www.wicell.org#tbl1]).\nCorrect the signal by removing background and accounting for signal loss from sampling the bottom chamber. For example, after subtracting the background, the 15-minute sample exhibits a signal of 1000 relative fluorescence units (RFU) and the 30-minute sample exhibits a signal of 1500 RFU. The corrected signal at 30 min is (1500 RFU + (1000 RFU × 150 μL/1500 μL)) = 1500 RFU + 100 RFU = 1600 RFU. When calculating the 45 minute corrected value, use 1600 RFU as the 30-minute sample value.",
    "Calculate the clearance volume at each time point (Coisne et al., 2005[href=https://www.wicell.org#bib3]; Cecchelli et al., 2014[href=https://www.wicell.org#bib2]). Clearance volume = (V B × (SB,t)) / (ST, 60 min), where VB is the volume of bottom chamber (1500 μL); SB,t is the corrected signal of the bottom chamber at time, t; ST,60 min is the signal of top chamber at 60 min.\nCalculate the linear slope of clearance volume vs. time using linear regression for each of the triplicate culture Transwell filters (mc) and the blank filter (mf).\nCalculate sodium fluorescein permeability for each of the triplicate culture Transwell filters by subtracting the “resistance” of the blank Transwell filter (reciprocal slope of clearance volume vs. time) from the “resistance” of the cell-containing Transwell filter using the following formula: 1/Pe = 1/mc-1/mf.\nThe slope of reciprocal clearance volume vs. time should have units min/μL; to convert to typical units, use the area of the Transwell filter (1.12 cm2): Pe [cm/min] = (1/Pe)–1 [μL/min] / (1000 μL/cm3 × 1.12 cm2).\n    Your browser does not support HTML5 video.\n  \nMethods video S4. Permeability assay, related to step 13\nNote: After the permeability assay, Transwell filters can be fixed with −20°C precooled methanol (150 μL top chamber/1 mL bottom chamber) for 20 s. After rehydrating and washing, cut filters out using a scalpel (Methods video S5[href=https://www.wicell.org#mmc5]), transfer to a 24-well plate and add 150 μL of blocking buffer for blocking and cell membrane permeabilization. Then stain for junctional molecules to evaluate monolayer confluency as described below. After staining, transfer filters to a glass slide, mount with Mowiol, and coverslip.\nTiming: 2 days (24-well plate) or 6 days (Transwell filter) for cell culture and 2–3 h for immunofluorescence staining\n    Your browser does not support HTML5 video.",
    "Methods video S5. Cutting Transwell filter for immunocytochemistry, related to steps 13 and 14\nThis step describes immunofluorescence staining methods for quality control of EECM-BMEC-like cells and SMLCs. Specifically, EECM-BMEC-like cells are stained for junctional proteins to confirm maturation of cell-cell junctions, and for key endothelial adhesion molecules. SMLCs are stained for key components of smooth muscle cell contractile machinery.\nImmunofluorescence staining of EECM-BMEC-like cell monolayers and SMLCs (expected results are shown in Figures 3[href=https://www.wicell.org#fig3], 4[href=https://www.wicell.org#fig4], and 5[href=https://www.wicell.org#fig5])\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/696-Fig3.jpg\nFigure 3. Immunofluorescence staining of EECM-BMEC-like cells grown on 0.4 μm pore Transwell filters for 6 days\nVE-cadherin (red), claudin-5 (red), occludin (red), and nuclei (DAPI; blue) are shown. Staining was performed after permeability assays. Scale bar = 50 μm.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/696-Fig4.jpg\nFigure 4. Immunofluorescence staining of SMLCs grown on chamberslide\nα-SMA (red), SM22a (red), calponin (red), and nuclei (DAPI; blue) are shown. Scale bar = 50 μm.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/696-Fig5.jpg\nFigure 5. Immunofluorescence staining of EECM-BMEC-like cells grown on 0.4 μm pore Transwell filters in the presence of SMLC-derived CM\nICAM-1 (red), VCAM-1 (red), and nuclei (DAPI; blue) are shown for non-stimulated and inflammatory cytokine-stimulated (1 ng/mL TNF-α + 20 IU/mL IFN-γ) conditions. Scale bar = 50 μm.\nNote: Immunofluorescence staining can be performed on chamber slides, 96-well plates, or Transwell filters. We here describe the method for EECM-BMEC-like cells or SMLCs cultured on 16-well chamber slides or 96-well plates. For cultivation of EECM-BMEC-like cells on Transwell filters, see step “13”.\nPrepare collagen IV-coated chamber slides or 96-well plates as described in step 7, except use a volume of 60 μL of coating solution per well of a 16-well chamber slide or 96-well plate.\nAspirate hECSR medium from the 6-well plate containing EECM-BMEC-like cells or SMLCs and add 1 mL of Accutase per well of the 6-well plate.",
    "Incubate at 37°C, 5% CO2 in the incubator until cells detach (approximately 7 min for EECM-BMEC-like cells and 10–20 min for SMLCs).\nCollect EECM-BMEC-like cells or SMLCs in a 15 mL centrifuge tube containing 4 mL of hESFM or DMEM/F-12-10 per 1 mL of Accutase.\nResuspend EECM-BMEC-like cells or SMLCs suspension well and take 10 μL of cell suspension for counting.\nCentrifuge EECM-BMEC-like cells or SMLCs at 200 g, 5 min, at 20°C–25°C.\nAspirate supernatant and resuspend at 2.5 × 105 EECM-BMEC-like cells or SMLCs per mL of hECSR medium. Aspirate the collagen IV coating solution and add 100 μL of EECM-BMEC-like cells or SMLCs suspension to each well of the 16-well chamberslide or 96-well plate (2.5 × 104/well).\nTransfer 16-well chamber slide or 96-well plate into the incubator (37°C, 5% CO2) and gently move the plate back and forth and from side to side on the incubator shelf to evenly distribute the cells.\nNote: Avoid circular motions to prevent cells from pooling in the center of the well. It is important to place the plate onto the incubator shelf first and move the plate using the shelf as support inside the incubator.\nOnce EECM-BMEC-like cells or SMLCs attach to the slide or plate (1–2 h later), replace hECSR medium with 100 μL hECSR medium and remove nonadherent EECM-BMEC-like cells or SMLCs.\nApproximately 24 h later, change hECSR medium again for feeding. To investigate adhesion molecule expression on EECM-BMEC-like cells, change hECSR medium to CM derived from SMLCs (for preparation of CM, see step “9l”) in the presence or absence of 0.1 ng/mL TNF-α + 2 IU/mL IFN-γ for 16–24 h.\nThe primary antibody staining procedure depends on the target antigen (see key resources table[href=https://www.wicell.org#key-resources-table]: Antibodies used for immunofluorescence staining, for suggested antibody dilutions).",
    "To stain for junctional molecules (e.g., claudin-5, occludin, VE-cadherin), fix EECM-BMEC-like cells with 100 μL of −20°C precooled methanol for 20 s and rehydrate by washing 3 times with 100 μL of dPBS. Block and permeabilize cell membrane with 100 μL of blocking buffer for 10 min at 20°C–25°C, and then stain with 100 μL of primary antibodies diluted in blocking buffer for 1 h at 20°C–25°C.\nNote: Although paraformaldehyde fixation permits detection of some junctional molecules (e.g., VE-cadherin), methanol fixation is superior in maintaining epitopes of tight junction molecules (e.g., claudin-5 and occludin).\nTo stain for adhesion molecules ICAM-1 and VCAM-1, dilute primary antibodies in 100 μL of hECSR medium, add to live EECM-BMEC-like cells, and incubate at 37°C, 5% CO2 in the incubator for 15 min. Live cell-labeling allows for selective detection of cell surface-expressed adhesion molecules, which are functionally available for immune cell interaction. After washing with dPBS, fix EECM-BMEC-like cells with 100 μL of 1% (w/v) paraformaldehyde in dPBS for 10 min at 20°C–25°C. Wash cells with dPBS and block EECM-BMEC-like cells with 100 μL of blocking buffer for 10 min at 20°C–25°C.\nTo stain for α−smooth muscle actin, calponin, and SM22a, fix SMLCs with 100 μL of 1% (w/v) paraformaldehyde in dPBS for 10 min at 20°C–25°C. After washing with 100 μL of dPBS, block and permeabilize SMLCs with 100 μL of blocking buffer for 10 min at 20°C–25°C. Then incubate SMLCs with 100 μL of primary antibodies diluted in blocking buffer for 1 h at 20°C–25°C.",
    "Wash EECM-BMEC-like cells or SMLCs three times with 100 μL of dPBS and incubate with 100 μL of secondary antibodies diluted in blocking buffer (see key resources table[href=https://www.wicell.org#key-resources-table]: Antibodies used for immunofluorescence staining, for appropriate secondary antibodies and suggested concentrations) for 1 h at 20°C–25°C. Add DAPI at 1 μg/mL or Hoechst 33342 at 4 μM to secondary antibody solutions to stain the cell nuclei.\nWash EECM-BMEC-like cells or SMLCs three times with 100 μL of dPBS. If using a chamber slide, remove plastic chamber from the glass slide, mount with Mowiol, and coverslip.\nExamine slide/plate under a fluorescence microscope.\nTiming: 2 days (24-well plate) or 6 days (Transwell filter) for EECM-BMEC-like cell culture and 2–3 h for flow cytometry assay\nThis step describes a flow cytometry-based method for quality control of the adhesion molecule phenotype of EECM-BMEC-like cells. This assay is especially important to ensure expression of a panel of endothelial adhesion molecules, which is a unique and characteristic feature of EECM-BMEC-like cells when compared to other hPSC-derived blood-brain barrier (BBB) models.\nFlow cytometry analysis of adhesion molecule expression of EECM-BMEC-like cells (Expected results are shown in Figure 6[href=https://www.wicell.org#fig6])\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/696-Fig6.jpg\nFigure 6. Flow cytometry analysis of EECM-BMEC-like cells grown on 24-well plate in the presence of SMLC-derived CM for adhesion molecules\nIsotype control, non-stimulated (NS) and 16 h pro-inflammatory cytokine-stimulated condition (stim, 1 ng/mL TNF-α + 20 IU/mL IFN-γ) are represented respectively in gray, blue, and red lines in a histogram overlay.\nNote: Flow cytometry analysis can be performed on EECM-BMEC-like cells cultured in 24-well plates or Transwell filters. We describe here the method of EECM-BMEC-like cells cultured on 24-well plates. For the cultivation of EECM-BMEC-like cells on Transwell filters, see step “13”.",
    "Prepare a collagen IV-coated 24-well plate as described in step 7, except use a volume of 300 μL of coating solution per well of 24-well plate.\nAspirate hECSR medium from 6-well plate containing EECM-BMEC-like cells and add 1 mL of Accutase per well of the 6-well plate.\nIncubate at 37°C, 5% CO2 in the incubator until EECM-BMEC-like cells detach (approximately 7 min).\nCollect EECM-BMEC-like cells in a 15 mL centrifuge tube containing 4 mL of hESFM or DMEM/F-12-10 per 1 mL of Accutase.\nResuspend EECM-BMEC-like cells suspension well and collect 10 μL of cell suspension for counting.\nCentrifuge EECM-BMEC-like cells at 200 g, 5 min, at 20°C–25°C.\nAspirate supernatant and resuspend at 9.5 × 104 EECM-BMEC-like cells per ml of hECSR medium. Aspirate the collagen IV coating solution and add 1 mL of EECM-BMEC-like cells suspension to each well of the collagen IV-coated 24-well plate (9.5 × 104/well).\nNote: Seed EECM-BMEC-like cells onto at least 2 wells of 24-well plate for non-stimulated and pro-inflammatory cytokine-stimulated conditions.\nTransfer 24-well chamber slide or 96-well plate into the incubator (37°C, 5% CO2) and gently move the plate back and forth and from side to side on the incubator shelf to evenly distribute the cells.\nNote: Avoid circular motions to prevent cells from pooling in the center of the well. It is important to place the plate onto the incubator shelf first and move the plate using the shelf as support inside the incubator.\nApproximately 24 h later, change hECSR medium to CM derived from SMLCs (for preparation of CM, see step “9l”) in the presence or absence of 1 ng/mL TNF-α + 20 IU/mL IFN-γ for 16–24 h.",
    "After pro-inflammatory cytokine stimulation, aspirate CM from 24-well plate containing EECM-BMEC-like cells and add 200 μL of Accutase per well of the 24-well plate. Incubate at 37°C, 5% CO2 in the incubator until EECM-BMEC-like cells detach (approximately 7 min).\nCollect EECM-BMEC-like cells in 15 mL centrifuge tubes containing 4 mL of hESFM or DMEM/F-12-10.\nResuspend EECM-BMEC-like cells suspension well and collect 10 μL of cell suspension for counting.\nCentrifuge EECM-BMEC-like cells at 200 g, 5 min, at 20°C–25°C.\nAspirate supernatant and resuspend at 1 × 106 EECM-BMEC-like cells per ml of FACS buffer. Add 100 μL of EECM-BMEC-like cell suspension to each well of a 96-well plate (round bottom) (1 × 105/well).\nNote: We recommend preparing 3 wells (unstained control, isotype control mixture, adhesion molecules staining mixture)/sample (non-stimulated and pro-inflammatory cytokine stimulated condition).\nCentrifuge EECM-BMEC-like cells in the 96-well round bottom plate at 330 g, 3 min, at 4°C.\nCritical: From now on, maintain EECM-BMEC-like cells at 4°C to avoid antibody internalization.\nPrepare adhesion molecule antibody staining mixture, and isotype control antibody mixture solutions in FACS buffer (total volume 100μL/sample) (see key resources table[href=https://www.wicell.org#key-resources-table]: Antibodies used for flow cytometry analysis).\nDiscard buffer by inverting the 96-well plate in one quick forceful shake of motion and then resuspend EECM-BMEC-like cells in 100 μL of prepared antibody solutions (adhesion molecules staining mixture and isotype control antibody mixture) or FACS buffer for the unstained control. Stain EECM-BMEC-like cells with fluorescent labeled antibodies at 4°C for 20 min.\nNote: After centrifugation, cell pellets remain sufficiently attached to the bottom of the 96-well plate. A single quick and forceful shake of the inverted 96-well plate discards the supernatant and avoids any cell loss.",
    "Prepare compensation beads for compensation. Add 1 drop of positive beads and negative beads into 2 mL of FACS buffer and aliquot compensation beads suspensions into 7 separate flow tubes, then add respective volume (see key resources table[href=https://www.wicell.org#key-resources-table]: Antibodies used for flow cytometry analysis) of each fluorophore-conjugated antibody (see key resources table[href=https://www.wicell.org#key-resources-table]: Antibodies used for flow cytometry analysis). Store at 4°C protected from light until the measurement.\nNote: We recommend using antibody compensation beads for single antibody staining for compensation since EECM-BMEC-like cells do not necessarily contain both negative and positive cells for all antigens of interest.\nAfter 20 min of antibody incubation, centrifuge EECM-BMEC-like cells at 330 g, 3 min, at 4°C.\nDiscard buffer containing antibodies by inverting the 96-well plate in one continuous motion and add 200 μL of FACS buffer and resuspend EECM-BMEC-like cells for washing.\nNote: After centrifugation, cell pellets remain sufficiently attached to the bottom of the 96-well plate. A single quick and forceful shake of the inverted 96-well plate discards the supernatant and avoids any cell loss.\nCentrifuge EECM-BMEC-like cells at 330 g, 3 min, at 4°C.\nDiscard buffer by inverting the 96-well plate in one continuous motion.\nNote: After centrifugation, cell pellets remain sufficiently attached to the bottom of the 96-well plate. A single quick and forceful shake of the inverted 96-well plate discards the supernatant and avoids any cell loss.\nResuspend EECM-BMEC-like cells in 200 μL of FACS buffer and analyze on a flow cytometer.",
    "Note: We use the Attune NxT Flow Cytometer (Thermofisher Scientific) and the following settings: FSC (voltage 50), SSC (voltage 280), BL1 filter (voltage 300) for FITC detection, RL1 filter (voltage 360) for APC detection, RL3 filter (voltage 340) for APC-Cy7 detection, VL1 filter (voltage 220) for BV421 detection, VL2 filter (voltage 240) for BV510 detection, YL1 filter (voltage 320) for PE detection, and YL4 filter (voltage 340) for PE-Cy7 detection.\nTiming: 2 days for EECM-BMEC-like cells culture and 3–4 h for T-cell adhesion assay\nThis step describes a T-cell adhesion assay under static conditions to assess functional expression of endothelial adhesion molecules on EECM-BMEC-like cells. This assay is especially important since EECM-BMEC-like cells with their mature immune phenotype are the first hPSC-derived BBB model suitable to study immune cell interactions.\nT-cell adhesion assay under static condition (expected results are shown in Figure 7[href=https://www.wicell.org#fig7])\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/696-Fig7.jpg\nFigure 7. Adhesion assay using EECM-BMEC-like cells with T cells\nThe number of cell tracker-labeled T cells adherent to non-stimulated (NS) and 0.1 ng/mL TNF-α + 2 IU/mL IFN-γ stimulated EECM-BMEC-like cell monolayers were shown. Bars show the mean, and error bars show SD. Statistical analysis: unpaired t test. (P< 0.001 = ∗∗∗).\nNote: We here describe the method using human Th1 cells sorted from peripheral blood based on their chemokine receptor expression and expanded for 20 days with periodic restimulation with phytohemagglutinin and irradiated allogeneic peripheral blood mononuclear cells and human IL-2 exactly as described before (Nishihara et al., 2020a[href=https://www.wicell.org#bib6], 2020b[href=https://www.wicell.org#bib7]; Sallusto et al., 1998[href=https://www.wicell.org#bib9]; Engen et al., 2014[href=https://www.wicell.org#bib4]). The T-cell culture medium and number of T cells added to EECM-BMEC-like cells needs to be optimized for the T cells of your interest.\nPrepare EECM-BMEC-like cell monolayers as described in section 14 steps “a–i”.",
    "Note: We usually prepare at least 8 wells (4 wells for non-stimulated and 4 wells for pro-inflammatory cytokine-stimulated conditions).\nApproximately 24 h later, change hECSR medium to CM derived from SMLCs (for preparation of CM, see step “9l”) in the presence or absence of 0.1 ng/mL TNF-α + 2 IU/mL IFN-γ for 16–24 h.\nPrepare a 15 mL centrifuge tube containing 10 mL T-cell wash buffer at 37°C.\nThaw 1 vial (8 ×106 cells) of cryopreserved T cells by rapidly rubbing the tube between your hands or swirling in a 37°C water bath until there is only a small piece of ice remaining.\nUsing a micropipette, carefully drop the cell suspension into the 15 mL centrifuge tube containing 10 mL T-cell wash buffer.\nNote: At the first signs of thawing, T cells should immediately be transferred into the 15 mL tube containing 10 mL of T-cell wash buffer to reduce cryopreservation-mediated damage to the cell membranes.\nCentrifuge T cells at 280 g, 5 min, at 20°C–25°C. While T cells are centrifuging, label a 24-well plate with the name of the T cell and date.\nRemove the supernatant and carefully resuspend the pellet in 2 mL of T-cell medium and seed the T cells suspension onto 2 wells of 24-well plate.\nTransfer 24-well plate into the incubator (37°C, 5% CO2).\nAt the day of the experiment, label T cells with 1 μM CMFDA (add CMFDA stock solution at 1:3000) at 37°C, 5% CO2 in the incubator for 30 min.\nAfter CMFDA labeling, collect T cells into 15 mL centrifuge tube and fill up to 12 mL with T-cell wash buffer.\nCentrifuge T cells at 280 g, 5 min, at 20°C–25°C.\nAspirate supernatant and resuspend T cells in 6 mL of T-cell wash buffer.",
    "Carefully add 3 mL of Ficoll-Paque PLUS below the T cell suspension.\nCentrifuge at 770 g, 20 min at 20°C–25°C with minimum brake and acceleration.\nUsing micropipette, collect live T cell interphase between the T-cell wash buffer and the Ficoll-Paque PLUS into a new 15 mL centrifuge tube and fill to 12 mL using T-cell wash buffer.\nNote: For the details on usage of Ficoll-Paque PLUS, please refer to the manufacturer’s instructions https://www.sigmaaldrich.com/technical-documents/protocols/biology/isolation-of-mononuclear-cells/recommended-standard-method.html[href=https://www.sigmaaldrich.com/technical-documents/protocols/biology/isolation-of-mononuclear-cells/recommended-standard-method.html]\nCentrifuge T cells at 280 g, 5 min, at 20°C–25°C.\nAspirate supernatant and resuspend T cells in 5 mL of migration assay medium.\nResuspend T cell suspension well and take 10 μL of cell suspension for counting.\nCentrifuge T cells at 280 g, 5 min, at 20°C–25°C.\nAspirate supernatant and resuspend at 2 × 105 T cells per ml of migration assay medium.\nCarefully remove CM from chamber slide containing EECM-BMEC-like cells and add 100 μL of T cell suspension (2.0 × 104 cells/well).\nCritical: We recommend not washing the EECM-BMEC-like cell monolayer before adding the T cells to avoid disruption of the EECM-BMEC-like cell monolayer.\nIncubate EECM-BMEC-like cells with T cells on an orbital shaker platform for 30 min at 20°C–25°C with protection from light.\nAfter 30 min of T cell-EECM-BMEC-like cell interaction, remove plastic chambers from the glass slide.\nWash the slide containing T cell and EECM-BMEC-like cells twice by gently dipping the slide into a jar with dPBS to remove non-adherent T cells.\nFix adherent T cell and EECM-BMEC-like cells with 2.5% (v/v) glutaraldehyde solution diluted in dPBS at 4°C for 2 h.\nNote: We recommend using glutaraldehyde solution to fix cells after the adhesion assay since glutaraldehyde is a stronger fixative compared to paraformaldehyde and thus reduces the risk of T cells detaching from the EECM-BMEC-like cells.",
    "After 2 h of fixation, wash slides containing adherent T cells and EECM-BMEC-like cells twice by dipping into a jar with dPBS and examine the slide using a fluorescence microscope.\nNote: We image adherent T cells using the 10 × objective of the fluorescence microscope Nikon Eclipse E600 microscope connected to a Nikon Digital Camera DXM1200F with Nikon NIS-Elements BR3.10 software (Nikon, Egg, Switzerland). Acquire images from the center of the well. Analyze images with FIJI software (Version 2.0.0, Image J, USA) using following macro (Threshold and particle size must be manually adapted depending on signal intensity.):\nrun(\"8-bit\");\nsetAutoThreshold(\"Default dark\");\n//run(\"Threshold...\");\nsetThreshold(35, 255);\nrun(\"Convert to Mask\");\nrun(\"Watershed\");\nrun(\"Analyze Particles...\", \"size=50-Infinity circularity=0.1-1.00 show=Overlay summarize\")"
  ],
  "subjectAreas": [
    "Immunology",
    "Stem Cells",
    "Cell Culture",
    "Neuroscience",
    "Cell Differentiation"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}