{
  "id": 3998,
  "origin_website": "Cell",
  "title": "Protocol for microglia replacement by peripheral blood (Mr PB)",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nFor clinical trials, Mr PB is conducted by exchange transfusion. For the lineage tracing for Mr PB by mouse models, it can be conducted by either CX3CR1-CreER::Ai14 mice or parabiosis. In this protocol, we will introduce these two lineage tracing approaches one by one.\nProtocol I: Mr PB lineage tracing by CX3CR1-CreER::Ai14 mouse\nThe overall procedure of Mr PB by CX3CR1-CreER::Ai14 mouse is outlined in Figure 1[href=https://www.wicell.org#fig1].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/715-Fig1.jpg\nFigure 1. Scheme of Mr PB by CX3CR1-CreER::Ai14 mice\nPLX5622: PLX5622-formulated AIN-76A diet; CD: control AIN-76A diet.\nLabeling the CNS endogenous microglia\nTiming: 4 days\nIn this procedure, we utilize CX3CR1-CreER::Ai14 mice for lineage tracing. A subpopulation of monocytes also express CX3CR1 (Jung et al., 2000[href=https://www.wicell.org#bib4]; Yona et al., 2013[href=https://www.wicell.org#bib8]), which will be replaced by the differentiation of CX3CR1-negative cells. To specifically label the CNS endogenous microglia without affecting peripheral blood cells, we induce tdTomato expression in the CX3CR1-CreER::Ai14 neonatal mouse from P1 to P4 with tamoxifen administration. At 2-month-old, almost all endogenous microglia express tdTomato while the circulating blood cells are tdTomato-negative (Huang et al., 2018a[href=https://www.wicell.org#bib2]; Huang et al., 2018b[href=https://www.wicell.org#bib3]; Parkhurst et al., 2013[href=https://www.wicell.org#bib6]; Xu et al., 2020[href=https://www.wicell.org#bib7]).\nNote: A period of at least 15- to 30-day is necessary to allow the tdTomato pre-labeled circulating monocytes to turnover.\nDilute tamoxifen stock solution of 20 mg/mL to working solution 2 mg/mL with corn oil.\nIntragastrically inject 25 μL tamoxifen working solution each day from P1 to P4.\nClean the oil outflows of the pups with 75% ethanol. Mix the pups with feces from the parents before returning them to the home cage.\nMicroglial depletion\nTiming: 14 days",
    "This procedure achieves efficient microglial depletion (usually > 99% in the brain cortex and 100% in the retina) in the adult mouse CNS with the CSF1R inhibitor PLX5622 (Huang et al., 2018a[href=https://www.wicell.org#bib2]; Huang et al., 2018b[href=https://www.wicell.org#bib3]; Xu et al., 2020[href=https://www.wicell.org#bib7]).\nAt 2-month-old, feed the tamoxifen-administered CX3CR1-CreER::Ai14 mouse with PLX5622-formulated chow diet from D0 to D14 ad libitum.\nReplace and supply the PLX5622-formulated chow diet every 3 days.\nBefore the irradiation treatment, treat the mouse with neomycin containing acid water (1.1 g/L, adjust pH to 2–3 by HCl) ad libitum from D11. The acid water prevents most bacterial contaminations (Duran-Struuck and Dysko, 2009[href=https://www.wicell.org#bib1]).\nNote: According to our experience, at the specific pathogen free (SPF) animal facility, more than 95% of microglia in the brain cortex and 100% of retinal microglia in the outer plexiform layer (OPL) are able to be ablated at day 7 of PLX5622 administration. At day 14, more than 99% of brain microglia in the cortex and all retinal microglia are ablated (Huang et al., 2018a[href=https://www.wicell.org#bib2]; Huang et al., 2018b[href=https://www.wicell.org#bib3]). In contrast, microglial depletion efficiency will be dampened in a non-SFP animal facility. The efficiency of microglial depletion is critical for the replacement efficiency. We strongly recommend a 14-day microglial depletion.\nCritical: The animals should be kept at a specific pathogen-free (SPF) animal facility. Otherwise, the microglial depletion efficiency is relatively low in the “dirty environment”, which will influence the replacement efficiency.\nHead irradiation to the CX3CR1-CreER::Ai14 mice\nTiming: 4 hours\nChange the PLX5622-formulated chow with sterilized AIN-76A control diet (CD) 2–3 h before the irradiation at D14.\nDeeply anesthetize the CX3CR1-CreER::Ai14 mouse by the mixture of ketamine (100 mg/kg) and xylazine (10 mg/kg) through the intraperitoneal injection.",
    "Use soft lead piece (3 mm thickness) (Figure 2[href=https://www.wicell.org#fig2]A) to cover the body of CX3CR1-CreER::Ai14 mice, only exposing the head of the mouse (from nose tip to the ear tips) (Figure 2[href=https://www.wicell.org#fig2]B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/715-Fig2.jpg\nFigure 2. Head irradiation to the CX3CR1-CreER::Ai14 mouse\nMouse body is shielded by the soft lead piece (A). Only the mouse head is exposed to the X-ray irradiation (B).\nNote: The lead piece weight should not be imposed upon the mouse.\nSet the X-ray irradiation dosage to 9 Gy on the irradiator (Radsource, RS-2000). Put the mouse cage into the irradiator and initiate irradiation.\nCritical: Please make sure the irradiation is X-ray. We found that the replacement efficiency by Gamma-ray is quite low. The typical irradiation time is around 7 min.\nAfter the irradiation, remove the lead piece from the mice and put them to the home cage.\nFeed the irradiated mouse with sterilized CD for recovery of 30 days ad libitum. Meanwhile, treat the mouse with neomycin containing acid water for the first 2–3 weeks after irradiation.\nProtocol II: Mr PB lineage tracing by parabiosis\nThe overall procedure of Mr PB by parabiosis is outlined in Figure 3[href=https://www.wicell.org#fig3].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/715-Fig3.jpg\nFigure 3. Scheme of Mr PB by parabiosis\nWBI: whole-body irradiation; PLX5622: PLX5622-formulated AIN-76A diet; CD: control AIN-76A diet.\nParabiosis surgery\nTiming: 14 days\nThe procedure is mostly following (Kamran et al., 2013[href=https://www.wicell.org#bib5]) with minor changes. For those who wish to check the step-by-step details, we recommend to refer to the video of this paper.\nTo ensure the cohabitation of harmony, co-house a female C57BL/6J mouse with an age and body weight matched female CX3CR1+/GFP mouse for 2 weeks before the surgery. Typically, we utilized 1.5-month-old to 6-month-old mice for parabiosis experiment.\nFlanks on opposite sides of two mice were shaved one day before the surgery.",
    "Clean the operation bench and heating pad with 75% ethanol.\nCover the operation bench with a clean drape.\nSterilize the following surgical tools by a bead sterilizer for 20 s: toothed forceps, smooth forceps, ophthalmic scissors and needle holder. Put the tools on sterile paper towel. Wait for around 5 min till the tools cooling down before the experiment.\nAfter deeply anesthetized by isoflurane or the mixture of ketamine (100 mg/kg) and xylazine (10 mg/kg), flanks from the elbows to the knees on the opposite sides of the two mice were carefully cleaned by Betadine and ethanol solution, before the incisions are made. Put the mouse pair on a heating pad to maintain the body temperature.\nCut the skin at the knee joints of the mice. Insert the smooth forceps tips into the cut and detach the skin from the subcutaneous fascia from caudal to rostral until reaching the elbow joints with the help of tissue forceps. Cut the skin and expose approximately 1 cm tissues free of skin.\nNote: Use the scissor tips to detach the skin by expanding the tips. Try to avoid bleeding as much as possible, especially when reaching the armpit of the mouse, by carefully enlarging the space between skin and subcutaneous fascia using the tip of scissors, and cut the skin with scissors thereafter. Keep the exposed tissue moistened with the sterile saline.\nCritical: Arrange the mouse pair on their unshaved side down and with their backs towards to each other.",
    "Surgically connect the exposed elbow joints of two mice with non-absorbable 3-0 sutures. Lift and bend the elbow of the mouse on your right side. From right to left, pierce the suture needle through the muscle on the olecranon. Lift and bend the elbow of the mouse on your left side. Also, from right to left, pierce the suture needle through the muscle on the olecranon.\nCritical: Use the non-absorbable suture. We start from the mouse on the right side because most of the experimenters were right-handed.\nRepeat step 20. With the suture thread tightly around the elbow and do not hurt the muscle. Firmly tighten a surgical knot.\nRepeat step 20 to 21 for the knee joints.\nCritical: Pay attention not to rupture the major blood vessels near the femur.\nSuture ventral skins of the two mice by 5-0 absorbable sutures from the elbow to the knee.\nCritical: To prevent from hurting the skin, areas around the elbows and the knees should be sutured tightly with double knots and using the interrupted stitch type.\nPut the mouse pair stomach down and continue suture the dorsal ends with the double surgical knot. Verify the continuity of the suture and confirm the lack of openings.\nApply erythromycin ointment to sutured areas. Subcutaneously inject 0.5 mL sterilized normal saline to each mouse near the joint skin. Keep the mouse partners on the heating pad until they are recovered.\nPut the mice (Huang et al., 2018b[href=https://www.wicell.org#bib3])back to a cage with clean monolithic bedding material (paper towel for example), and put enough sterile water-soaked wet chow on floor of the cage. To prevent bacterial infections, add neomycin in the drinking water (1.1 g/L). Return the cage to the animal facility.",
    "Administer meloxicam (1 mg per kg body weight, Sigma) to relieve pain and limit potential infection for at least 48 h.\nKeep supplying sterile chow on the floor of the cage for one week.\nThe mouse pair were able to feed and drink without difficulty by the time of 14 days post-surgery (D0-D14). One can easily verify the successful equilibration of the blood of the parabiotic WT and GFP positive mice by flow cytometric analysis (Huang et al., 2018b[href=https://www.wicell.org#bib3]). After 14 days of recovery, the blood cells are thoroughly exchanged (∼50% exchange rate).\nMicroglial depletion\nTiming: 14 days\nThis procedure achieves efficient microglial depletion in the adult mouse CNS with the CSF1R inhibitor PLX5622 (Huang et al., 2018a[href=https://www.wicell.org#bib2]; Huang et al., 2018b[href=https://www.wicell.org#bib3]; Xu et al., 2020[href=https://www.wicell.org#bib7]).\nAfter 14 days post parabiosis surgery, feed the parabiotic mice with PLX5622-formulated chow diet at D14 to D28 ad libitum. Replace the PLX5622-formulated chow diet every 3 days.\nBefore the irradiation treatment, treat the mouse with neomycin containing acid water (1.1 g/L, pH 2 to 3) ad libitum from D25.\nCritical: The animals should be kept at a specific pathogen-free (SPF) animal facility. Otherwise, the microglial depletion efficiency is relatively low, which may influence the replacement efficiency.\nX-ray irradiation to the parabiotic C57BL/6J mouse\nTiming: 1 h\nChange the PLX5622-formulated chow with sterilized AIN-76A control diet (CD) 2–3 h before the irradiation at Day 28.\nDeeply anesthetize the parabiotic mice by the mixture of ketamine (100 mg/kg) and xylazine (10 mg/kg).\nUse soft lead piece (3 mm) to cover the whole body of the parabiotic CX3CR1+/GFP mouse, while expose the parabiotic C57BL/6J mouse (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/715-Fig4.jpg\nFigure 4. The wildtype parabiotic mouse is exposed to the X-ray irradiation while the CX3CR1+/GFP mouse is protected by the lead shield\n(A) The soft lead piece.",
    "(B) A pair of mice joint by parabiosis operation.\n(C) Before irradiating the parajoint mouse pair, cover the donor partner with the soft lead piece and expose the host partner only. Then irradiate the mouse pair by X-ray.\nNote: The lead piece weight should not be imposed upon the mouse.\nSet the X-ray irradiation dosage to 9 Gy on the irradiator (Radsource, RS-2000). Put the mouse cage into the irradiator and initiate irradiation.\nCritical: Please make sure the irradiation is X-ray. We found that the replacement efficiency by Gamma-ray is quite low.\nAfter the irradiation, remove the lead piece and put the mouse to the home cage.\nFeed the irradiated mouse with sterilized CD for recovery of 30–60 days ad libitum. Meanwhile, treat the mouse with neomycin containing acid water for the first 2–3 weeks after irradiation."
  ],
  "subjectAreas": [
    "Neuroscience",
    "Cell Biology",
    "Model Organisms"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}