{
  "id": 8281,
  "origin_website": "Bio",
  "title": "Transport Assays in <em>Aspergillus nidulans</em>",
  "procedures": [
    "Inoculate a petri dish of CM with the strain of interest and let it reach full growth at 37 °C for 96 h.    Using a spatula transfer one quarter of the fully grown colony (~4 cm) in a 50 ml Falcon tube containing 2 ml of 0.01% v/v Tween 80 in water. This amount usually corresponds to 108 conidiospores. The accurate amount of conidiospores can be estimated using a Neubauer counting-chamber slide or by measuring viable conidiospores after standard serial dilutions and plating on CM.   Vortex well the sample for separating the conidiospores.    Inoculate a 100 ml flask containing 25 ml MM supplemented with appropriate carbon (C) (e.g. Glucose 1% w/v) and nitrogen (N) (e.g. NaNO3 10 mM) sources and necessary vitamins (e.g. D-biotin 0.02 μg/ml) with the conidiospores filtered through a Nylon net filter 60 μΜ. (All necessary supplements and concentrations for A. nidulans strains can be found at www.fgsc.net[href=https://bio-protocol.org/www.fgsc.net].)   Incubate for 3-5 h at 37 °C, shaking with 140 rpm, for the germinating conidiospores to reach a stage just before germ tube emergence. The time and temperature of incubation can change depending on the expression profile of the transporter of interest and the auxotrophic requirements of the strain. All transporters studied up to date in our lab (for example the purine/pyrimidine transporters UapA, UapC, AzgA, FcyB, FurD) reach maximum expression before germ tube emergence, driven by an unknown developmental control, irrespectively of the presence or absence of their substrates or other physiological conditions (Amillis et al., 2004; Vlanti and Diallinas, 2008; Amillis et al., 2007). In mycelia, transporter expression is very much dependent on physiological conditions (e.g. induction by substrates or/and N or C catabolite repression).",
    "While conidiospores germinate, prepare the stock solution of radiolabeled (usually 3H or 14C) substrate of interest in water or MM so that for each assay 25 μl of the stock will be used.    Collect the conidiospores by centrifuging the culture in a 50 ml Falcon tube for 5 min, at 3,000 x g, room temperature.   Discard the supernatant and resuspend the pellet in 5 ml standard MM.    Distribute the spores in 75 μl aliquots in eppendorf tubes and use as many as needed. Conidiospore suspensions can be kept at 4 °C for at least 24 h without loss of transport activity.    Incubate conidiospore aliquots at 37 °C in a heat block for 5 min before addition of radiolabeled substrate.    Radiolabeled substrate is added for different periods of time. Most transporters show linearly increased activities for at least 1 min. For measuring initial uptake rates, which are necessary for determining Km and apparent Vmax values, the proper time of incubation must be defined for each transporter through a time-course experiment. For steady state substrate accumulation a period of 5 min is used. Usual time points are 10, 20, 30, 60 and 120 sec. For each time point, measurements are performed in triplicate. The temperature used for the incubation with the radiolabeled substrate depends on the transporter being studied at each experiment and the experiment being held, temperature for most experiments is 37 °C. The transport reaction is stopped by adding an equal volume (100 μl) of cold unlabeled substrate at 100-1,000 fold excess concentration, related to radiolabelled substrate, and direct transfer of the assay/eppendorf tube in an ice bucket.    Centrifuge the samples at 11,000 x g for 3 min at 4 °C.   Remove the supernatant through aspiration under vacuum using a Pasteur pipette.",
    "It is important to remove all the supernatant without losing any cells.   Wash the pellet of cells once with 1 ml ice cold MM and centrifuge at 11,000 x g for 3 min. Remove the supernatant as before.   Resuspend the pellet in 1 ml of scintillation fluid and put the eppendorf tubes into scintillation vials. Use a scintillation counter to measure substrate accumulation in the cells.    Analysis of transport measurements is performed using GraphPad Prism software. Radioactive counts should be converted to substrate concentration/min/conidiospores, based on the concentration and specific activity of the stock of radioactive substrate used.    For Km determination of a transporter, different substrate concentrations should be used, for a fixed incubation time, previously determined to reflect initial uptake rates. This is usually 1 min. The range of concentrations used is determined at first empirically. In the final experiment, at least three concentration points below and above the apparent Km value should be used. For each concentration point measurements are performed in triplicate.   The stock solutions are prepared using a mixture of fixed radiolabeled substrate and increasing concentrations of non-radiolabeled substrate, so that for each assay 25 μl of the stock will be used.    Terminate transport assays and perform measurements as described above.   For Ki determination of a transporter, the method is identical to the one for Km determination, but stock solutions are prepared using a mixture of fixed radiolabeled substrate and increasing concentrations of non-radiolabeled putative inhibitors. For each concentration point measurements are performed in triplicate.",
    "Km and Vmax determination is carried out using typical Lineweaver-Burk plot analysis that is based on the Michaelis-Menten equation for enzyme kinetics V = Vmax[S]/(Km + [S]), where V is the reaction velocity (the reaction rate), Km is the Michaelis–Menten constant, Vmax is the maximum reaction velocity, and [S] is the substrate concentration. The Lineweaver-Burk plot depicts the linear expression of the previous equation which is transformed to the following: 1/V = (Km/Vmax).(1/[S]) + 1/Vmax. The data obtained by this experiment correspond to the apparent velocity of the transporter for each substrate concentration. Ki measurements are determined by estimating IC50 values (inhibitor concentration for obtaining 50% inhibition) of given substrate/inhibitor, using the formula Ki = IC50/1 + [S]/Km, where [S] is the fixed concentration of radiolabeled substrate used. Another way to analyse the data is by using the GraphPad Prism Software through a non linear regression curve fit and sigmoidal dose response analysis. The IC50 value corresponds to the Km/i of the transporter. Quality factors for the analysis result are: R2 which should be > 0.99 and the Hill co-efficient which should be approximately -1 for a transporter with one binding site.   The method described can be modified and adapted for most filamentous fungi that produce asexual spores, e.g. A. fumigatus. (Goudela et al., 2008)"
  ],
  "subjectAreas": [
    "Cell Biology",
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}