{
  "id": 6272,
  "origin_website": "Bio",
  "title": "CRISPR/Cas9-mediated ssDNA Recombineering in <em>Corynebacterium glutamicum</em>",
  "procedures": [
    "Design mutation strategy and prepare ssDNA editing templatesSelect the target position where the mutation will be introduced. Upload the sequence of the target region (23 mer upstream and downstream the target position, respectively, totally 47 mer) and the genome sequence of C. glutamicum to sgRNAcas9 software (Xie et al., 2014) to design gRNAs and evaluate the potential off-target sites.Choose a proper gRNA with no potential off-target sites and make sure that the target mutation position locates in its seed region (green letters in Figure 1) or the “GG” region of the PAM sequence (Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180924/20180924201753_4836.jpgFigure 1. Design of protospacer, PAM site and ssDNA. A. Introducing mutations (red letters) with a protospacer and a PAM sequence (5’-NGG-3’, blue letters) in the leading strand of C. glutamicum genome. B. Introducing mutations (red letters) with a protospacer and a PAM sequence (5’-NGG-3’, blue letters) in the lagging strand of C. glutamicum genome. The target mutation position should locate in the seed region (green letters) or the “GG” region of the PAM sequence. The ssDNA (90 mer) editing templates should be complementary to the lagging strand.Design a 90 mer ssDNA using the 40-50 mer upstream and downstream the target position, respectively. Make sure that the 90 mer ssDNA is complementary to the lagging strand (Figure 1).Note: A previous study demonstrated that ssDNA that is complementary to the lagging strand results in a higher recombination efficiency (Binder et al., 2013). According to the genome sequence of C. glutamicum ATCC 13032 published by Kalinowski et al. (2003), the bi-directional replication of the genome starts at the proposed oriC sequence near the dnaA gene (cg0001) and ends near to the calculated replication terminus at around 1.6 Mb. Therefore, regarding to genes located in 0-1.6 Mb, just copy the genome sequence to get the lagging strand sequence.",
    "For genes located in 1.6-3.3 Mb, the reverse complementary sequence of the genome sequence is the lagging strand sequence. Synthesize PAGE-purified ssDNA (10 μg is used for each transformation).Construct plasmid pgRNA-targetTo construct plasmid pgRNA-target that is required for expression of specific gRNA, replace the original 20 bp spacer sequence of pgRNA5 with the target spacer sequence designed previously (Figure 2). Use Vazyme ClonExpress® II One Step Cloning Kit to construct the plasmid (this cloning technology is based on homologous recombination and overlapped sequences of 15-20 bp on both 5’- and 3’-end of PCR fragments are needed). Add the 20 bp spacer sequence in the primer and use the 20 bp spacer sequence as the overlap. Detailed procedure is as follows:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180924/20180924201811_2565.jpgFigure 2. Construction of plasmid pgRNA-targetDesign primers for construction of plasmid pgRNA-target.Primer gRNA-1: 20 bp spacer sequence + GTTTTAGAGCTAGAAATAGCAAGPrimer gRNA-2: TGCTCTTTCATTGATGGCTGG (permanent sequence)Primer gRNA-3: CAGCCATCAATGAAAGAGCAAC (permanent sequence)Primer gRNA-4: reverse complement of 20 bp spacer sequence + TGAATTACACTGTACCTGTTGCGTCAmplify Fragment A (3421 bp) and Fragment B (2812 bp) via PCR using pgRNA5 as a template and primer pairs gRNA-1/gRNA-2 and gRNA-3 and gRNA-4, respectively.PCR program using Q5® High-Fidelity DNA polymerase:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180924/20180924202353_5442.jpgPurify PCR products by 1% agarose gel electrophoresis in 1x TAE electrophoresis buffer followed by gel extraction using AxyPrepTM DNA Gel Extraction Kit (Corning, Axygen®). Store the purified PCR product at -20 °C until used.Note: GoldView I Nuclear Staining Dyes (10,000x) are used for DNA staining. According to the manufacturer’s instructions, GoldView I should be protected from light and stored at room temperature. For 100 ml agarose gel solution, 10 μl GoldView I Nuclear Staining Dyes (10,000x) is used. Construct pgRNA-target plasmidUse Vazyme ClonExpress® II One Step Cloning Kit to construct pgRNA-target plasmid.",
    "The recombination reaction mixture (20 μl) contains 60-120 ng Fragment A, 60-120 ng Fragment B, 4 μl 5x CE II Buffer, 2 μl Exnase II. Incubate the reaction mixture at 37 °C in a thermocycler for 30 min and immediately place it on ice.Transform 100 μl chemically competent E. coli strain DH5α with 10 μl of the recombination products (make sure the transformation efficiency of competent cells is > 107 cfu/μg). Plate the transformation mix on LB solid medium containing kanamycin (25 μg/ml). Incubate the plate at 37 °C overnight.Verify the transformants via PCR using an upstream primer specific to the 20 bp spacer sequences and a downstream primer gRNA-5 (AGTCTTTCGACTGAGCCTTTCG) that locates on the plasmid backbone. The size of the expected fragment generated by PCR is approximately 150 bp.Cultivate the correct colonies and extract plasmids using AxyPrepTM Plasmid Miniprep Kit. Store the purified pgRNA-target plasmid at -20 °C until used.CRISPR/Cas9-mediated ssDNA recombineering in C. glutamicumThe procedure for CRISPR/Cas9-mediated ssDNA recombineering is shown in Figure 3.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180924/20180924201826_2414.jpgFigure 3. The procedure for CRISPR/Cas9-mediated ssDNA recombineeringTransform C. glutamicum with pgRNA-target plasmidPrepare competent cells for C. glutamicum and transform plasmids according to the protocols described previously (Ruan et al., 2015).Activate C. glutamicum strain by cultivation on LBHIS solid medium at 30 °C for 24 h.Inoculate a pre-culture of 20 ml BHI medium (in 100 ml shake flask) from a single colony and incubate at 30 °C with vigorous shaking (220 rpm) overnight.Dilute the overnight culture to an OD600nm of 0.3 in NCM medium (100 ml) containing 0.46% INH, 0.11% Tween 80, 1.11% DL-Thr and 3.59 % Gly, and incubate at 30 °C with vigorous shaking (220 rpm) until the OD600nm value reaches 0.9-1.0 (ca. 5-6 h).",
    "Chill the culture on ice for 15 min and harvest cells by centrifugation at 4 °C, 4,000 x g for 10 min.Discard the supernatant and resuspend the pellet in 50 ml ice-cold, sterile 10% glycerol. Centrifuge the resuspended cells at 4 °C, 4,000 x g for 10 min. Repeat this wash step four times.Discard as much supernatant as possible. Immediately resuspend the cell pellet in 0.4 ml ice-cold, sterile 10% glycerol, and divide the resuspended cells into 100 μl aliquots.Add 0.5-1 μg pgRNA-target plasmid (up to 5 μl) to the competent cells and transfer the mixture to a 2 mm electroporation cuvette (Bio-Rad Laboratories). After electroporation at 2.5 kV, 5 msec, add 1 ml BHIS medium to the cuvette immediately, transfer the mixture into a 1.5 ml tube, and incubate the tube at 46 °C for 6 min. Then incubate the tube at 30 °C with vigorous shaking (220 rpm) for 2 h.Spread 50-100 μl of the mixture on LBHIS solid medium containing 25 μg/ml kanamycin. Incubate the plates at 30 °C for 24-36 h. The transformants are C. glutamicum (pgRNA-target) strains.Transform C. glutamicum (pgRNA-target) with pCas9 plasmid and ssDNAPrepare competent cells for C. glutamicum (pgRNA-target). Follow the procedures described above except that add 1 g/L sodium propionate into NCM medium to induce RecT recombinases expression.Transform C. glutamicum (pgRNA-target) competent cells with 1-2 μg pCas9 and 6-15 μg synthetic ssDNA (total volume up to 10 μl). After electroporation at 2.5 kV for 5 msec, add 1 ml BHIS medium to the cuvette immediately, transfer the mixture into a 1.5 ml tube, and incubate the tube at 46 °C for 6 min. Then incubate the tube at 30 °C with vigorous shaking (220 rpm) for 5-6 h.Collect the cells by centrifugation at 5,000 x g for 1 min.",
    "Remove the supernatant and resuspend the cells using 100 μl BHIS medium. Spread all the cells on LBHIS solid medium containing 25 μg/ml kanamycin, 5 μg/ml chloramphenicol and 0.01 mM IPTG. Incubate the plates at 30 °C for 48-72 h until colonies appear.Screen edited mutantsDesign a primer pair that locates at approximately 200 bp upstream and downstream of the mutation site, respectively (Figure 4). Amplify the target fragment by using colony PCR and the above-mentioned primer pair. Sequence the PCR product by Sanger sequencing to verify the mutation was introduced and no other unexpected mutations were introduced.Note: According to our experience, the editing efficiency is over 80%. Therefore, screening 5 colonies can ensure the acquisition of edited mutants.For colony PCR, pick a speck of colony using a 10 μl pipette tip and mix it with the PCR reaction mixture to introduce DNA template.Colony PCR program using 2x EasyTaq PCR SuperMix (+dye):imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180924/20180924202456_2263.jpgimgsrc:https://en-cdn.bio-protocol.org/attached/image/20180924/20180924201843_7074.jpgFigure 4. Verification of the mutants by Sanger sequencing Plasmid curingTo remove pCas9 and pgRNA-target plasmids from the edited cells, inoculate the edited colony into 100 ml of BHI medium without antibiotics and cultivate it at 30 °C, 220 rpm for 12 h. Transfer 100 μl of the culture into 100 ml fresh BHI medium without antibiotics and cultivate it at 30 °C, 220 rpm for 12 h. Repeat this step for another time. Dilute the culture and spread 100 μl on LBHIS solid medium without antibiotics. Pick 10 to 20 isolates and inoculate LBHIS solid media with and without 25 μg/ml kanamycin (or 5 μg/ml chloramphenicol). Cultivate the plates at 30 °C overnight. The isolates that do not grow on LBHIS solid medium with 25 μg/ml kanamycin and LBHIS solid medium with 5 μg/ml chloramphenicol have been cured of the editing plasmid.",
    "Note: According to our experience, the efficiency observed for curing strains of the plasmids is approximately 25%."
  ],
  "subjectAreas": [
    "Microbiology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}