{
  "id": 18174,
  "origin_website": "Jove",
  "title": "Study of In Vivo Glucose Metabolism in High-fat Diet-fed Mice Using Oral Glucose Tolerance Test (OGTT) and Insulin Tolerance Test (ITT)",
  "procedures": [
    "All methods described here have been approved by the Animal Care and Use Committee of the Medical University of Vienna and conducted according to the Federation of European Laboratory Animal Science Associations (FELASA). Please note that all procedures described in this protocol should only be performed after institutional and governmental approval as well as by staff that are technically proficient.\n1. HFD-fed mice\nNOTE: Maintain all C57BL/6J mice on a 12-h light/dark cycle with free access to food and water.\nAt 6 weeks of age, place mice for 8-12 weeks on an HFD (40-60% fat calories) to induce obesity, while feeding the lean control-group a low-fat diet (LFD) (10% fat calories).\nDetermine the body weight of the mice on a weekly basis. The weight curves should show similar patterns in both groups, with a higher slope in the HFD-fed group.\n2. OGTT\nNOTE: If blood sampling time points are chosen during OGTT every 15 min, the experiment should be performed with a maximum of 15 mice in parallel, in order to have at least 1 min handling-time per mouse.\nPreparations on the day before OGTT\n\t\nTransfer the mice into a cage with fresh bedding and fast them overnight before testing (14 h), while ensuring that the mice have access to drinking water (e.g., remove the food at 6:00 pm for a start time on the next morning at 8:00 am).\n\t\tNOTE: Fasting mice overnight is the standard approach, however a shorter fast (5-6 h) is more physiological for mice (see Discussion for details).\nPreparations on the day of the experiment (but prior to the experiment)\n\t\nPrepare 10 mL of 20% glucose solution (dissolve D-(+)-Glucose in distilled water).\n\t\tNOTE: All reagents that are administered to the animals have to be pharmacological grade and sterile.",
    "Prepare a 96-well plate for plasma collection, by filling one well for each sampling time point and each mouse, with 5 µL NaEDTA (0.5 M EDTA, pH 8.0 in 0.9% NaCl, storage at RT). During the experiment, store this plate on ice.\n\t\tNOTE: See Supplementary Figure 1 for a detailed checklist.\nMeasure the body weight of all mice and mark their tails with a permanent marker in order to make the mice easily distinguishable (e.g., mouse 1 = 1 dash, mouse 2 = 2 dashes, etc.).\nGlucose measurement and blood sampling (Figure 2)\n\t\nCarefully cut off 1-2 mm of the tail tip using sharp scissors (\"Variant A\" in Figure 2). Always wipe off the first drop of blood to avoid hemolysis or contamination with tissue fluid before taking new blood samples for blood glucose determination. Draw a small blood sample (~3 µL) for the measurement of the basal blood glucose level (= time point 0) with the glucometer.\n\t\tCAUTION: Check and adjust the charge number of test strips on a glucometer.\n\t\tNOTE: As an alternative blood sampling method, nick the lateral tail vein of a mouse with a sharp scalpel blade (\"Variant B\" in Figure 2). The lateral tail vein is usually accessed approximately one-third along the length of the tail from the tail tip, moving towards the base of the tail for multiple samples. The use of a local anesthetic cream is recommended. Stop blood flow by applying finger pressure on the soft tissue for at least 30 s before the animal is returned to its cage.",
    "Collect a blood sample (around 30 µL) using a fresh capillary tube (keep the capillary tube horizontal). Empty the capillary tube using a pipette by putting the pipette tip at the top of the capillary tube end and carefully pushing the collected blood into a well of the 96-well plate, while avoiding air bubbles. Repeat this procedure for all mice - one at a time.\n\t\tNOTE: As an alternative for blood collection via a capillary tube, use a pipette adjusted to the correct volume (e.g., 30 µL) to collect blood, or collect a drop of blood from the tail on paraffin film, and pipet it into the EDTA-solution. Strictly avoid the contact of petroleum jelly with blood or glucometer test strips, as it may influence subsequent glucose and insulin measurements.\n\t\tCAUTION: The OGTT is very stressful for mice: lean mice can lose around 15% of their body weight during an overnight fast. Additionally, blood sampling at different time points leads to a considerable loss of blood. For easier blood sampling, it is possible to carefully massage the mouse-tail with petroleum jelly.\n\t\tNOTE: Institutional guidelines may limit the allowable amount of blood collected within a set period. The sampling volumes and timepoints should be adjusted to not exceed the allowed maximums. The body weight of the mice should be used to calculate the total blood withdrawal permitted.\nCalculate the required volume of glucose solution based on body weight (1 g glucose/kg body weight; this can be increased up to 3 g/kg) to be administered by oral gavage for every mouse. For example, a mouse with a body weight of 30 g would need 150 µL of a 20% glucose solution to administer 30 mg of glucose.",
    "NOTE: To base the dose of glucose on the weight of the mouse is the standard procedure. If body composition data are available, the dose of glucose for OGTT should be calculated based on the lean body mass (see Discussion for details).\nGlucose administration\n\t\nPrepare everythingthat is needed during the whole experiment in advance (timer, experiment record sheet, glucose monitor and strips, capillaries, syringes, glucose solution, 96-well plate, scalpel, calculator, balance, permanent marker, bench papers, a pipette with a tip, and gloves).\nFor glucose application, restrain the mouse by firmly grasping it by the scruff. Apply enough firmness to the skin around the neck to prevent the mouse from twisting out of the restrain and to properly tilt its head back. Also ensure that the mouse can breathe properly.\n\t\tNOTE: Once glucose administration is started, good time management is very important.\nCarefully administer the glucose solution (based on step 2.5) directly into the stomach using a feeding needle. Cautiously direct the feeding needle through the mouth towards the esophagus. Allow the mouse to swallow the needle: the needle entirely sinks into the lower esophagus/stomach of the mouse. Then inject the glucose solution (Figure 3a).\n\t\t\nIf any resistance is met or if the animal struggles immediately, withdraw the needle and reposition it.Start the timer immediately after the first gavage and administer glucose to all other mice in 1 min intervals.\n\t\t\tNOTE: It may be helpful to apply a drop of glucose solution directly from the feeding needle to the mouth of the mouse, which will stimulate licking and swallowing, thus facilitating easier insertion of the feeding needle. Do not apply pressure when inserting the feeding needle as this may seriously injure the animal.",
    "After 15 min, measure blood glucose levels with the glucometer and additionally take blood samples (~30 µL) (as described in detail in step 2.4) of each mouse in the same order as they were injected.\n\tNOTE: The time management is very important; follow as closely as possible using the same time intervals as for gavage. Let the mice move as freely as possible and limit restraining to a minimum during the whole procedure to reduce stress, which may modify the results. Milk tail with one hand and collect the blood with the other.\nRepeat step 2.7 at selected time points depending on the expected results (e.g., at 30, 45, 60, 90, 120, 150, and 180 min after glucose administration). If the selected time points are longer than 120 min, ensure that the mice have access to drinking water. Ensure that the mice have always access to drinking water. When finished with the experiment, return the mice to their home cages equipped with food and water.\n\tCAUTION: The OGTT is very exhausting for the mice. Therefore wait at least 1 week before performing the next metabolic test, such as an ITT.\nAfter the experiment, centrifuge blood samples at 2,500 x g, 30 min, 4 °C. Transfer the supernatant (plasma) to empty wells of the plate and store it at -20 °C until analysis.\n\t\nRecord hemolysis of samples if present (see Section 3).\nDetermine plasma insulin levels using a commercially available ELISA kit (see the Table of Materials) following the manufacturer's instructions of the kit.",
    "NOTE: Depending on the fasting state as well as on the metabolism of the investigated mice, difficulties during this assay may occur: overnight fasting insulin levels (time point 0) are very low and therefore close to the detection limit. To avoid this issue, double the quantity of recommended plasma volume and accordingly halve the result of the ELISA assay. On the other hand, if mice reach the insulin peak during OGTT, especially in HFD-fed mice, the insulin levels may exceed the detection limit: dilute the sample (e.g., 10-fold with 0.9% NaCl) and repeat the ELISA assay. Hemolysis in plasma samples may lead to the degradation of insulin, resulting in a decrease of the readout values. The degradation depends on time, temperature, and the hemoglobin concentration in the sample. Always keep hemolyzed samples cold or on ice to reduce insulin degradation.\n3. ITT\nNOTE: The same precautions described for OGTT (handling of mice, blood, glucometer, and petroleum jelly use) also have to be applied when performing the ITT. For example, all injections should be carried out within 15 min in 1 min intervals if 15 mice are tested in parallel. For the ITT, subsequent collection of blood samples with capillary tubes is optional.\nPreparations before the experiment\n\t\nFast mice for at least 2 h before insulin injection, while ensuring that the mice have access to drinking water (e.g., remove food at 8:00 am, test mice 2-5 h later).\nDilute insulin 1:1,000 in 0.9% NaCl (Stock: 100 U/mL insulin; working concentration 0.1 U/mL) and prepare 20% glucose (D-(+)-Glucose solution dissolved in distilled water) to be administered if the mice become hypoglycemic.",
    "NOTE: The ITT is typically performed after a short fast to avoid the hypoglycemia which may otherwise occur in overnight fasted animals. All reagents that are administered to the animals have to be pharmacological grade and sterile.\nMeasure the bodyweight of mice, mark tail, cut the tail tip using sharp scissors, and measure basal blood glucose levels as described previously for the OGTT in step 2.4.\nInsulin injection\n\t\nTo inject insulin intraperitoneally (0.75 U insulin/kg body weight, calculated beforehand), restrain the mouse by the scruff method.\nUse a fresh, sterile 27 or 30 gauge needle for each animal to avoid discomfort and the risk of any injection-site infection.\n\t\tNOTE: Sterilization of the skin can prolong the duration of insulin administration, and thus can cause additional disturbances to the animal. Therefore, it is not recommended.\nTilt the mouse head down at a slight angle to expose the ventral side of the animal. Place the sterile needle with the bevel up and at a 30 ° angle in the lower right quadrant of the animal's abdomen (Figure 3b). Start the timer immediately after the first mouse is injected.\n\t\tNOTE: Low-dose ITTs (0.1 U/kg) may be performed to specifically assess hepatic insulin sensitivity. As for the OGTT, calculating the injection volume based on body weight is the standard procedure, while basing the dose on lean body mass is preferred if body composition data are available.\nMeasure blood glucose levels at selected time points (e.g., after 15, 30, 45, 60, and 90 min).",
    "NOTE: As insulin has a short half-time of ~10 min in mice13, late differences after insulin administration (e.g., after 2 h) may not reflect a direct effect of insulin action. Administer 20% glucose solution in case a mouse becomes hypoglycemic (blood glucose levels below 35 mg/dL) and is in risk of dying.\nAfter the final time points, place the mice back into their home cages prepared with plenty of food and water.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}