{
  "id": 5558,
  "origin_website": "Bio",
  "title": "Photometric Assays for Chloroplast Movement Responses to Blue Light",
  "procedures": [
    "Principle of the experimentThe photometric method is based on the measurement of changes in leaf transmittance that result from chloroplast relocations in the cells. In terrestrial angiosperms, chloroplast movements are activated only by blue light and depend on its fluence rate and direction. In weak blue light, chloroplasts redistribute to cell walls perpendicular to the direction of incident light. This response, called accumulation, leads to a decrease in the leaf transmittance. Strong blue light induces chloroplast avoidance. Chloroplasts redistribute to cell walls parallel to the light direction, which results in an increase of the leaf transmittance. Photoreceptors responsible for chloroplast movements are called phototropins. Two phototropins are encoded in the genome of Arabidopsis thaliana: phototropin1 and phototropin2. While the accumulation response is mediated by both phototropins, the avoidance response is primarily controlled by phototropin2 (Jarillo et al., 2001; Kagawa et al., 2001; Sakai et al., 2001). Red light does not induce chloroplast movements in terrestrial angiosperms, thus it is used as measuring light. The measuring red light intensity (0.3 µmol m-2 sec-1) is ca. 40 times less than the light compensation point of photosynthesis (12.8 µmol m-2 sec-1 for red light, Takemiya et al., 2005). Thus, the activity of photosynthesis induced by the measuring light is negligible. Description of the equipmentTransmittance measurements are carried out using a custom-made photometer (Figure 1). A detached leaf is mounted on a holder (Figure 2) fitting the measuring chamber (Figure 1C). Two concentric light beams are delivered perpendicular to the dorsal surface of the leaf. These are the actinic blue light of 460 nm from a Luxeon Royal Blue LXHL-FR5C LED (Philips Lumileds Lighting Comp.) (Figure 1A) and the measuring red light of 660 nm, 0.3 µmol m-2 sec-1, from an L-793SRD-B LED (Kingbright) (Figure 1B).",
    "Fluence rate of the actinic beam is controlled electronically using voltage-controlled current-source electronics (Figure 1F). An aperture in the sample holder limits the diameter of the transmitted light beam to about ½ of the incident one to ensure uniform illumination of the measured tissue fragment. The aperture diameter of 3.5 mm is used for Arabidopsis thaliana (Figure 2). Note: Measurements on leaves of other plant species, such as aquatic angiosperms (Banaś and Gabryś, 2007) and mosses (e.g., Lemna trisulca and Funaria hygrometrica, respectively), may require smaller apertures.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170530/20170530222326_6346.jpgFigure 2. An Arabidopsis leaf on the sample holderAn opal glass–topped light guide is used to deliver the transmitted light to the signal detector (Figure 1E). This is a planar Silicon PN photodiode, model BPW20RF (Vishay Semiconductor) designed for high precision linear applications. The photodiode is integrated with a 660 nm interference filter and a double lens system (Figure 1D). The measuring beam is square-wave modulated with the frequency of 2 kHz to eliminate contributions from the photodiode dark current and external light sources. This also allows to supplement the actinic blue light with other selected wavelengths (Gabryś, 1985) or to use white light to activate chloroplast movements. The device selectively records changes in the modulated beam due to the application of the lock-in detection technique. The actinic beam intensity can be set to a desired level at any time after the start of the experiment. The device can also generate short pulses of actinic light. Pulse generation is hardware-controlled to ensure repeatability of the pulse duration. The software used to run the photometer is written in LabVIEW (National Instruments)–a software environment for deployment of measurement and control systems.Calibration of the equipment Before measurements, the instrument must be calibrated.",
    "The receiver photodiode signal is measured with the measuring light path blocked by an opaque lid. This value corresponds to 0% transmittance. Next, the signal is measured with the sample holder inside the measuring chamber, but without the leaf. This value corresponds to 100% transmittance. The receiver photodiode signal depends linearly on the fluence rate of the transmitted light.Plant growth conditionsNote: Leaves used for chloroplast movement measurements should be optically thin. Each cell layer absorbs light, so that a fluence rate gradient is formed across the leaf blade. The distal cell layer receives less light. Thus, its chloroplasts respond to weaker light than those in the layer facing the light source. Optically denser layers produce a steeper gradient. To minimize light attenuation through the leaf blade, the transmittance of leaves used for experiments is at least 8%. It is possible to measure thicker leaves after infiltration with water or buffer using a syringe, which increases leaf transmittance. It is also a convenient way of applying inhibitors (Aggarwal et al., 2013) or other chemicals (Anielska-Mazur et al., 2009).For Arabidopsis thaliana, moderate transmittance levels of leaves are assured by growing at 80-100 µmol m-2 sec-1 of white light in a short day (10 h light/14 h dark).Leaves from 4-5-week-old plants are used for photometric measurements. Sample preparationPlants are dark-adapted in a darkroom for at least 7 h to allow chloroplasts to obtain the stationary dark position. Dark adaptation is necessary to ensure that chloroplasts start from the same positions in the cell, which is crucial for quantitative comparison of chloroplast responses in various leaves. Otherwise transmittance changes correspond to different phases of redistribution and cannot be compared. Routinely, leaves are transferred to darkness at the end of the photoperiod light cycle. All experimental manipulations are performed under dim green light (< 0.",
    "05 µmol m-2 sec-1).Following dark adaptation, a single leaf is detached from the plant and placed on a thin microscope slide mounted on the holder (Figure 2). The leaf is flattened and positioned in the middle of the slide directly above the measuring aperture. It is important to avoid putting the major vein into the measuring area.The leaf is covered with cling film stretched over a metal ring and its petiole is wrapped in a piece of water-soaked tissue paper to avoid drying during the experiment.Note: Big leaves, e.g., Nicotiana tabaccum, may be cut into small fragments and immersed in a drop of water for the measurement. In that case, the leaf fragment is placed in a chamber formed by a Parafilm ring and the cling film (Anielska-Mazur et al., 2009). To prevent evaporation, the chamber is sealed with a high viscosity silicon grease.The holder with the leaf is placed inside the measuring chamber and the initial transmittance level is recorded immediately. Note: Ideally, the dark transmittance values of all leaves used in the same study should be similar. As the photometric method is an indirect method of chloroplast movement assessment, the reliability of the results may be adversely affected by differences in leaf anatomy. This must be taken into account while comparing chloroplast responses in mutant and wild type leaves (Eckstein et al., 2016). Variation in leaf anatomy is often reflected in different dark transmittance. The effect of dark transmittance on the movement parameters calculated from the photometric curves (e.g., amplitudes and velocities, see below) should always be determined. Thus, it is advisable to plot the parameters against the dark transmittance. This effect can also be taken into account at the stage of statistical analysis of results (see the Data analysis section).",
    "Measurements under continuous light–multiple illumination steps of increasing intensityNote: Chloroplast relocations in response to increasing light intensities can be measured in one leaf. The outcome is a fluence rate–response curve. For Arabidopsis, typical light intensities used start from 0.1 µmol m-2 sec-1 and increase stepwise up to 120 µmol m-2 sec-1 (Jarillo et al., 2001) (Figure 3A). imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170530/20170530222814_8688.jpgFigure 3. Typical curves obtained using the photometric method. A. A fluence rate–response curve. A dark-adapted leaf of A. thaliana with initial transmittance of 12% was exposed to continuous blue light of fluence rates 0.4-120 µmol m-2 sec-1. Each irradiation step lasted 50 min. B. A typical recording trace, explaining the way in which amplitudes and velocities are calculated. Arrows indicate start of illumination with weak (↓1.6 µmol m-2 sec-1) or strong (↑120 µmol m-2 sec-1) blue light. ΔTac, ΔTav–amplitudes, and (dT/dt)ac, (dT/dt)av–velocities of transmittance changes corresponding to the accumulation and avoidance response, respectively.The transmittance of a dark-adapted leaf is recorded for several minutes in physiological darkness to make sure that its level is stable. Blue light of the desired fluence rate is turned on and the changes in transmittance are recorded for at least 45 min. Note: This is a compromise time, usually too short to obtain the stationary phase of the response. However, the transmittance drift in the final stage of the response is very small and can be neglected. In the case of slow responses, e.g., at low temperature, the time of light exposure/measurement should be increased (Łabuz et al., 2015).After the response reaches a plateau, the blue light intensity can be changed. Note: To measure only the maximal accumulation and avoidance, saturating light for each response can be used. A typical experiment consists of recording the dark transmittance level for 5 min, followed by weak blue light (1.",
    "6 µmol m-2 sec-1) for at least 45 min and strong blue light (120 µmol m-2 sec-1) for at least 45 min (Figure 3B). Measurements under continuous light–one intensity at a timeAnother approach is to measure chloroplast responses only to one light intensity at a time. In this case, we always illuminate a dark-adapted leaf and obtain a family of curves, each corresponding to one intensity (Jarillo et al., 2001). This is a standard approach if we want to compare the kinetics of chloroplast responses in various samples under various fluence-rates, as it ensures that chloroplasts start from the same position in the cell. For response amplitudes, both approaches are equivalent provided that amplitudes do not depend significantly on previous illumination but only on the current fluence-rate. This must be verified experimentally for the studied species. In the case of A. thaliana wild type, amplitudes depend only on the current illumination. However, mutants may behave differently. For example, the phot2 mutant shows practically no response to strong blue light when chloroplasts have already reached the accumulation position, while a biphasic response is observed when strong light is applied directly after dark adaptation (Jarillo et al., 2001).Measurements of responses to light pulsesNote: Transmittance changes after light pulses are lower in magnitude than responses to continuous light, therefore they require a good signal-to-noise ratio of the recording system.The dark transmittance level is recorded for 5 min. A very short pulse of blue light is applied and chloroplast relocations are recorded in darkness for the following 45 min. For experiments with A. thaliana, we typically use a series of strong blue light (120 µmol m-2 sec-1, saturating the avoidance response) pulses for 0.1, 0.2, 1, 2, 10 and 20 sec (Sztatelman et al., 2016).",
    "Note: The pulse duration and light intensity can be adjusted in broad ranges. For pulses resulting only in transient accumulation, the chloroplast response follows the Bunsen-Roscoe reciprocity law. Thus, it is determined by the total amount of radiant energy delivered (product of fluence rate and the exposure time) (Gabryś et al., 1981). If the goal of the experiment is to compare effects of different pulse durations on chloroplast movements in the same plant line, it is convenient to record the whole series on the same leaf. After the transmittance curve is recorded, the leaf is transferred back to darkness for recovery and the response in a second leaf is measured. This dark recovery may be shorter than the initial adaptation period because the responses to pulses and the respective transmittance changes are small and usually level off within 1.5 h. Next, the first leaf is taken back and challenged with a light pulse of increased duration."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Plant Science"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}