{
  "id": 19122,
  "origin_website": "Jove",
  "title": "Quantification of Atherosclerotic Plaque Activity and Vascular Inflammation using [18-F] Fluorodeoxyglucose Positron Emission Tomography/Computed Tomography (FDG-PET/CT)",
  "procedures": [
    "1. Patient Preparation and Obtaining Images\nSecure at least a one hour imaging time slot on a PET/CT scanner, preferably one with time-of-flight capabilities for improved image quality. At our institution, we use a Gemini TF scanner, which is the newest PET/CT system from Philips Medical Systems and combines a PET scanner based on LYSO detectors with a 16-slice Brilliance CT system.\nHave subjects fast for 8 hours prior to the FDG-PET/CT scan. Check fasting serum glucose (FSG) levels using a fingerstick to assure serum glucose < 200 mg/dL prior to FDG administration. This ensures that glucose within the body does not compete with FDG.\nIf FSG < 200 mg/dL, insert no smaller than a 20-gauge intravenous (IV) line to administer the radiotracer (FDG) IV. Administer approximately 5.2 MBq/kg of FDG.\n~60 minutes after intravenous administration of FDG, perform low dose CT imaging of the whole body. Then acquire PET emission images from the skull vertex to the toes. On the particular PET/CT listed in 1.1), image reconstruction is typically performed using a list-mode maximum-likelihood expectation-maximization (ML-EM) algorithm with 33 ordered subsets and 3 iterations, where the system model includes time-of-flight as well as normalization, attenuation, randoms, and scatter corrections. Rescaled low-dose CT images are utilized for attenuation correction of PET images in an automated fashion, leading to decreased examination time and improved image quality relative to external radioactive source attenuation correction used on PET only machines.\n2. PET Image Qualitative Evaluation\nInterpret axial, sagittal, and coronal PET reconstructions with and without attenuation correction using low dose non-contrast CT images for spatial delineation of vascular structures of interest as well as for precise anatomical localization of areas of increased radiotracer uptake seen on PET images.\n3. PET Image Quantitative Evaluation",
    "After qualitative review of the images, identify boundaries to divide the aorta into the following sections: ascending aorta, aortic arch, descending thoracic aorta, suprarenal abdominal aorta, and infrarenal abdominal aorta. For simplicity, the aortic arch can be defined by those portions of the thoracic aorta that appear as a contiguous segment on transverse images when moving in a craniocaudal direction, where the ascending and descending portions of the thoracic aorta will not appear to be connected. The origin of the celiac artery can be used as the anatomical landmark between the descending thoracic aorta and abdominal aorta and the renal arteries serve as the anatomical landmark between the suprarenal and infrarenal segments of the abdominal aorta.\nArterial FDG uptake (as a measure of arterial inflammation) in the legs and neck is measured by placing a region of interest (ROI) around each artery of interest on slices of the coregistered transverse PET/CT images that pass through the artery. In the case of the aorta, beginning with the most superior aortic slice, carefully draw each ROI to include the entire area of FDG uptake on that slice while avoiding other surrounding tissues with increased radiotracer uptake (Figure 1). This image was taken from a patient in our aging and atherosclerosis study20.\nNext, using dedicated PET/CT image analysis software to calculate the SUV per slice [at our institution, we use Extended Brilliance Workstation, Philips Healthcare, Bothell, WA] the maximum and mean standardized uptake value (SUV) of each ROI is measured (Figure 2). This image was taken from a patient in our aging and atherosclerosis study20.",
    "Repeat this procedure for PET scan slices that pass through arteries of interest at regular intervals (e.g., every 5 - 20 mm). The total numbers of slices will differ from subject to subject depending on body habitus and anatomical variation.\nLocate the inferior vena cava (IVC) in the abdomen where at least 6-8 contiguous slices can be visualized. Place an ROI around the IVC on each transverse slice to obtain at least 8 venous mean SUV measurements which will be used for tissue-to-background ratio (TBR) calculation as described later.\n4. Imaging Outcome Calculations\nAverage arterial slice SUVs (using mean and maximum values) over all slices passing through an artery (e.g., carotid artery) or arterial segment of interest (e.g., ascending aorta, aortic arch, descending thoracic aorta, suprarenal abdominal aorta, infrarenal abdominal aorta) to generate mean SUV and maximum SUV measurements for each artery or arterial segment of interest. These parameters serve as one outcome measure of average burden of atherosclerosis within an artery or arterial segment of interest. Record the standard deviation of SUVs obtained from the slice measurements for statistical analyses.\nNext, divide the arterial or arterial segment mean SUV by the venous mean SUV obtained in step 3.4 for normalization purposes. The result is an arterial or arterial segment TBR measure, which serves as another outcome for atherosclerotic plaque activity.",
    "Finally, in an effort to understand the global burden of atherosclerotic disease within an artery or arterial segment of interest, multiply each arterial mean SUV obtained per slice ROI by the slice ROI volume (calculated by multiplying the area of the ROI by the slice thickness) and sum over all slices passing through an artery or arterial segment of interest. This yields arterial or arterial segment mean metabolic-volumetric product (MVP) as a third outcome for measurement of plaque activity and burden. Of note, regions in a vessel of interest that have no metabolic activity will contribute little to the MVP and therefore, this parameter is still valid as a measure of active plaque.\nIf one performs the summation of aortic mean MVPs listed in 4.3 over all slices passing through the aorta, the result will be the global inflammatory burden (GIB), which will serve as a fourth outcome for measurement of atherosclerotic plaque activity and atherosclerosis within the aorta.\nAn example of values for these four outcomes that have been derived from a single patient as part of an ongoing study18 in psoriasis is shown in Table 1.\n5. Representative Results\nThe table below shows various methods of determining outcomes for atherosclerotic plaque activity and vascular inflammation detected by FDG-PET/CT in a single patient with psoriasis.\ntable:\n﻿0,1,2,3,4\nArterial Segment (number of slices),SUVmean (SD),TBR (SD),MVP (SD),GIB(SD)\nAscending Aorta (n=8),1.43 (0.24),1.31 (0.18),5.68 (3.08),53.99 (19.50)\nAortic Arch (n=5),1.38 (0.25),1.30 (0.22),8.88 (4.94),59.85 (18.66)\nDescending Thoracic Aorta (n=20),1.42 (0.20),1.29 (0.19),3.11 (0.98),125.66 (53.11)\nSuprarenal Abdominal Aorta (n=29),1.40 (0.19),1.26 (0.17),2.37 (0.66),50.75 (17.64)\nInfrarenal Abdominal Aorta (n=26),1.38 (0.21),1.20 (0.16),1.72 (0.54),45.80 (10.86)\nimgsrc://cloudfront.jove.com/files/ftp_upload/3777/3777fig1.jpg",
    "Figure 1.  PET images. A series of representative results of initial PET reconstruction images from a patient in our study of aging and atherosclerosis20 which demonstrate FDG uptake in: A) the iliac and femoral arteries; B) popliteal arteries; C) abdominal aorta; D) aortic arch.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3777/3777fig2.jpg\nFigure 2. Region of interest (ROI) placement.  A transverse fused FDG-PET/CT image is shown at the level of the proximal descending thoracic aorta from a patient in our study of aging and atherosclerosis20. The ROI is placed around the descending thoracic aorta, and the software will calculated mean SUV, maximum SUV, and area of ROI in mm2. This is for one slice of data through this arterial segment of interest, and the technique is then repeated for all slices passing through each segment of the aorta.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}