{
  "id": 19498,
  "origin_website": "Jove",
  "title": "Studying Protein Import into Chloroplasts Using Protoplasts",
  "procedures": [
    "1. Growth of Arabidopsis Plants\nPrepare 1 L Gamborg B5 (B5) medium by adding 3.2 g of B5 medium including vitamins, 20 g of sucrose, 0.5 g of 2-(N-morpholino) ethane sulfonic acid (MES) to approximately 800 mL of deionized water, and adjust the pH to 5.7 with potassium hydroxide (KOH). Add more deionized water bring the total volume to 1 L. Add 8 g of phytoagar and autoclave for 15 min at 121 °C.\nAllow the medium to cool down to 55 °C and pour 20 – 25 mL of the B5 medium into a Petri dish (9 cm in diameter, 1.5 cm in height) at a clean bench. Dry plates for 2 – 3 days, pack them with clean wrap, and keep them in a refrigerator until use.\nSterilize Arabidopsis thaliana seeds with 1 mL of 70% (v/v) ethanol in a centrifuge tube (e-tube) by continuously shaking for 2 – 3 min. Remove the supernatant, add 1 mL of 1% (v/v) sodium hypochlorite solution, and shake continuously for 2 – 3 min. Prepare 100 – 150 seeds per Petri dish.\n\t\nRemove the supernatants and wash the seeds with 1 mL of distilled water. Repeat this step 4x. Place the sterilized seeds at 4 °C for 3 days to synchronize seed germination.\nSow 100 – 150 seeds onto B5 plates using a micropipette and seal the plate with surgical tape.\nGrow plants in a growth room with a 16 h/8 h light/dark cycle at 100 µmol·m-2·s-1 light intensity, 70% relative humidity and 20 °C temperature for 2 weeks.\n2. Preparation of the Plasmid\nNOTE: High-purity plasmids should be used for transformation; the use of a commercial plasmid purification kit is recommended.",
    "Purify the plasmid (RbcS-nt:GFP) using a DNA isolation kit. To concentrate DNA, perform ethanol precipitation in a 1.5 mL tube and dissolve the DNA pellet in 100 µL of distilled water. Determine the concentration of the plasmid using a spectrophotometer at 260 nm. Dilute the plasmid to a final concentration of ~ 2 µg/µL. Keep the plasmid at -20 °C until use.\n3. Isolation of Protoplasts\nPrepare the following solutions.\n\t\nPrepare the enzyme solution to contain 0.25% (w/v) macerozyme, 1.0% (w/v) cellulase, 400 mM D-mannitol, 8 mM calcium chloride (CaCl2), 0.1% (w/v) bovine serum albumin (BSA), and 5 mM MES. Adjust the pH to 5.6 with KOH.\n\t\t\nFilter the enzyme solution using a cellulose acetate filter unit with a 0.45 μm pore size. Aliquot 25 mL of the enzyme solution into 50 mL conical tubes and keep at -20 °C. Thaw the enzyme solution at room temperature (RT) and mix well just before use.\nPrepare a 21% (w/v) sucrose solution by dissolving 21 g of sucrose in 100 mL of deionized water and autoclave the solution.\nPrepare W5 solution to contain 154 mM sodium chloride (NaCl), 125 mM CaCl2, 5 mM potassium chloride (KCl), 5 mM glucose, and 1.5 mM MES. Adjust the pH to 5.6 with KOH and autoclave the solution.\nPrepare MaMg solution to contain 400 mM D-mannitol, 15 mM magnesium chloride (MgCl2), and 5 mM MES. Adjust the pH to 5.6 with KOH and autoclave the solution.\nPrepare 1 M D-mannitol and 1 M calcium nitrate stock solutions to make the PEG solution. Autoclave these solutions.",
    "Harvest intact leaf tissues from 2 weeks-old plants from ~ 1 – 2 B5 plates using a surgical knife and place the harvested leaves into a 50 mL conical tube containing 25 mL of enzyme solution. Place the conical tube containing the enzyme solution and leaf tissues horizontally on a rotary shaker with gentle agitation in the dark. It takes 8 – 12 h for full digestion of leaf tissues.\nAt 8 – 12 h after incubation, pour the enzyme solution (containing protoplasts released from leaf tissues) into a fresh Petri dish through a mesh with 140 µm pore size. Carefully layer the protoplast-containing enzyme solution on top of 15 mL of 21% (w/v) sucrose solution and centrifuge it at 98 x g for 10 min with the lowest acceleration and deceleration settings in a swinging-bucket rotor.\nUsing a Pasteur pipette, carefully transfer the protoplasts from the upper-most layer (enzyme solution) and at the interface between the enzyme solution and sucrose solution to a 50 mL conical tube containing 30 mL of W5 solution. Centrifuge this tube at 51 x g for 6 min. At this stage, protoplasts will be in the pellet at the bottom of the conical tube.\nDiscard the supernatant carefully using a pipette without disturbing the protoplasts pellet. Add 25 mL of W5 solution, and gently resuspend the protoplasts. Incubate the protoplast solution in a 4 °C refrigerator for at least 1 h for stabilization.\n4. Protoplast Transformation using Polyethylene Glycol",
    "Prepare a 40% PEG solution by adding 4 g of PEG 8000, 4 mL of 1 M mannitol solution, 1 mL of 1 M Ca(NO3)2, and 1.8 mL of distilled water into a 50 mL conical tube and mix well. Dissolve PEG by heating in a microwave oven for 20 – 30 s. Place the 40% PEG solution at RT for cooling down.\n\tNOTE: The 40% PEG solution should be prepared freshly every time. If protoplasts are not pelleted completely during the 4 °C incubation in the refrigerator, centrifuge the material at 46 x g for 2 min.\nRemove the supernatant carefully but completely and add MaMg solution to the protoplast pellet to yield the concentration of 5 x 106/mL.\n\tNOTE: The number of protoplast can be determined by a hemocytometer viewed under a microscope.\nPlace 10 µg of the plasmid DNA each empty 13 mL round-bottom tube and add 300 µL of protoplast solution using a pipette.\n\tNOTE: The end of the pipette tip should be cut off. Whenever protoplasts are sampled, the protoplast-containing solution should be resuspended right before pipetting so that the same number of protoplasts is added to each tube.\nMix the plasmid DNA with protoplasts by gently rotating the tubes and immediately add 300 µL of 40% PEG solution using a pipette. Mix gently but completely by rotating tubes and incubate for 30 min at room temperature; tilt the tube almost horizontally and rotate it several times.\nAdd 1 mL of W5 solution and mix gently but completely by rotating the tube by hand in a similar manner. Incubate the sample for 10 min at room temperature.\nRepeat this step two times more using 1.5 mL and 2 mL of W5 solution, respectively. Incubate for 30 min after the final addition of W5 solution.",
    "Centrifuge at 46 x g for 4 min. Discard the supernatant and add 2 mL of W5 solution. Mix gently but completely. Incubate at 22 °C in a dark chamber.\n5. Analysis of the Protein Import into Chloroplasts\nNOTE: After PEG-mediated transformation of protoplasts, incubation time ranges from 8 to 24 h.\nFluorescence Microscopy\nPlace 10 µL of the protoplast solution on a slide glass using a pipette with a trimmed tip and carefully cover with a coverslip to avoid damaging the protoplasts.\nPlace the slide on the stage of a fluorescence microscope equipped with excitation/emission filter sets for observing green fluorescent protein (GFP) and chlorophyll auto-fluorescence.\nCapture images with a cooled charge-coupled device (CCD) camera and process images using an image-editing software to produce pseudo-color images.\nTotal Protein Extraction and Immunoblotting\nPrepare denaturation buffer containing 2.5% (w/v) sodium dodecylsulfate (SDS), and 2% (v/v) 2-mercaptoethanol.\n\t\tNOTE: Protein import into chloroplasts can be quantified by measuring the degree of transit peptide processing via immunoblot analysis using anti-GFP antibody.\nTransfer protoplasts into a centrifuge tube and centrifuge at 46 x g for 4 min.\nRemove the supernatant and add 80 µL of denaturation buffer. Vigorously vortex for 5 s and add 5x SDS sample buffer (250 mM Tris-Cl (pH 6.8), 0.5 M DTT, 10% (w/v) SDS, 0.05% (w/v) Bromophenol blue, and 50% (v/v) glycerol). Mix well and boil for 10 min.\nSubject this protein sample to standard SDS-PAGE and immunoblotting with anti-GFP antibody.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}