{
  "id": 4414,
  "origin_website": "Bio",
  "title": "Determination of Rifampicin-resistance Mutation Frequency and Analysis of Mutation Spectra in Mycobacteria",
  "procedures": [
    "Determination of rifampicin-resistance mutation frequency   Streak Mycobacterium smegmatis culture on 7H11 agar plate (does not contain rifampicin) and culture at 37 °C for 3 days until colonies are visible.  For Mtb, streak it on 7H11OADC agar plate and culture at 37 °C for 4 weeks.   Inoculate a single colony in 5 ml 7H9 medium (for Mtb, use 7H9OADC medium) and grow at 37 °C with shaking (150 rpm) until the culture is saturated (OD600~2.0).    The culture is sub-cultured (1% v/v inoculation) into 20 ml 7H9 medium (for Mtb, use 7H9OADC medium) in a 100-ml flask and grown at 37 °C with shaking to exponential phase (OD600=0.4~0.5). Note: Culture at this growth stage can be used for stress induction, e.g., oxidative stress (H2O2 treatment) or starvation.    For CFU determination, the culture is serially diluted 1: 100,000 in PBST. 50 μl of the 10-5 dilution is plated on LBG agar plate (for Mtb, use 7H11OADC agar plate). Incubate the plates at 37 °C for 4 days. CFU/ml = (the number of colonies on each plate) x 2 x 106. Note: At least three independent dilutions are required for each sample.   3 ml of the cell culture from step 3 is centrifuged at 3,000 x g for 5 min and the cell pellet is resuspended in 100 μl PBST (The bacilli may form clumps in liquids without Tween 80.). To isolate rifampicin-resistant mutants, the resuspended pellet is spread with sterile glass beads on LBG agar plates containing 250 μg/ml rifampicin and incubated at 37 °C for 4 days.  For Mtb, the resuspended cell pellet is spread on 7H11OADC agar plate containing 10 μg/ml rifampicin and incubate at 37 °C for 4 weeks.",
    "Note: Glass or metal spreader is not recommended in this step because the mycobacterial cell may adsorb and clump onto the spreader during plating, which may affect the accuracy of the result.   The spontaneous rifampicin-resistant mutation frequency is calculated by dividing the number of rifampicin-resistant colonies on each plate by the total viable cell count per plate (Figure 1).  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140706/20140706165751_6680.jpg Figure 1. The antimutator role of MazG in Msm (A) and Mtb (B). The frequencies conferring resistance to rifampicin in wild-type (wt), mazG-null (ΔmazG) and the complemented mutant (compl) strains were determined in exponential phase (OD600~0.5) with or without oxidative stress and in the stationary growth phase. Oxidative stress was induced by treating exponential phase cultures with 10 mM H2O2 for 5 h (Msm) or 24 h (Mtb). Stationary phase was at the 5th-day or 28th-day of culture for Msm or Mtb, respectively. The numbers shown are mean ± S.E. of 3 independent experiments totalling 15 cultures of Msm and 6 of Mtb.      Mutation spectrum analysis   A single rifampicin-resistant Msm colony is inoculated into 1 ml 7H9 media containing 100 μg/ml rifampicin in a 96-well flat bottom plate. The plate is then sealed with an adhesive film and incubated at 37 °C for 7 days. Note that at least 30 colonies are required per bacterial sample for statistically significant results. To inoculate rifampicin-resistant Mtb colony, use 7H9OADC with 4 μg/ml rifampicin, incubate at 37 °C for 3 weeks.   Cells are then pelleted (4,000 x g, 5 min) and suspended in 50 μl TE buffer and the cell suspension is transferred to a 96-well PCR plate.   The plate is heated in a PCR instrument at 95 °C for 20 min.",
    "The PCR plate is then centrifuged at 12,000 x g for 5 min and the supernatant is transferred to a new 96-well PCR plate.   A region of the genome sequence containing the cluster I region of rpoB is amplified using primers Rpo-forward (5’-CGACCACTTCGGCAACCG-3’) and Rpo-reverse (5’-CGATCAGACCGATGTTGG-3’). For Mtb, using primer RpoTB-forward (5’-ATCACACCGCAGACGTTG-3’) and RpoTB-reverse (5’-TGCATCACAGTGATGTAGTCG-3’). PCR mix: 2 μl DNA template, 0.4 ul of each primer (10 μM), 1 U Pfu DNA polymerase, 0.6 μl DMSO, 0.4 μl dNTPs (10 mM each), H2O to 20 μl.  PCR cycling: 95 °C 60 s, 30 cycles of 95 °C 20 s, 58 °C 10 s and 72 °C 40 s. Note: Most of the rifampicin-resistance mutations are occurred in the cluster I region of rpoB. If no mutation is detected in this region, it may need to amplify the whole rpoB gene (~3.5 Kbp) for sequencing.   The PCR products are then bi-directionally sequenced and the mutation spectrum of the sequenced region is identified by BLAST or ClustalW.   Calculate the mutation frequency of each specific mutation spectrum (Table 1). Mutation frequency of a given mutation spectrum = (the proportion of the mutation spectrum in strain A) x (the mutation frequency of strain A). For example, the mutation frequency of Msm is 10 x 10-8, the proportion of CG-TA mutation in Msm derived rifampicin-resistant mutants is 80%, therefore, the CG-TA mutation frequency will be 0.8 x 10 x 10-8=8 x 10-8.  Table 1. mazG-null Msm exhibited elevated CG to TA mutation under oxidative stress conditions and in stationary phase. Spontaneous rifampicin-resistant colonies were collected from 3 independent experiments . Cluster I region of rpoB were PCR-amplified using Pfu DNA polymerase and sequenced bi-directionally. All of the sequenced colonies contain single non-synonymous mutations. wt, wild-type Msm; ΔmazG, mazG-null Msm. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140706/20140706201357_3646.jpg"
  ],
  "subjectAreas": [
    "Microbiology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}