{
  "id": 5135,
  "origin_website": "Bio",
  "title": "Chromium-51 (<sup>51</sup>Cr) Release Assay to Assess Human T Cells for Functional Avidity and Tumor Cell Recognition",
  "procedures": [
    "Cytotoxic T Lymphocyte (CTL) Assay with peptide titration at an E:T ratio of 10:1This first section describes the different steps needed to perform a cytotoxic T lymphocyte (CTL) assay. Radioactive labelling of target cells with 51Cr (step A1). Preparation of the peptide dilution (step A2). Preparation of the effector CD8 T cells (step A3). Loading procedure into 96 wells plate (step A4). Determination of 51Cr radioactivity (step A5). Analysis of results (step A6).Radioactive labelling of T2 target cells with Chromium 51 (51Cr)Calculate the number of T2 target cells needed for the CTL assay. You will need 1,000 target cells for 1 well of a 96-well plate. Consider adding 20% more cells to account for volume loss during pipetting. Note: We usually label 0.5 x 106 T2 cells, which is enough for 500 wells.Harvest the correct number of T2 target cells in 15 ml Falcon tubes and spin them for 5 min at 530 x g at room temperature (RT).Wash the cells in 1 ml RT RPMI/10% FBS medium.Spin down, remove all liquid and incubate T2 cells with 50 μl of pure 51Cr solution (activity 1 mCi/ml) for 45 min at 37 °C in a water bath. Take the necessary precaution and protection when manipulating radioactive material (e.g., lead shields, rapid manipulation). Contact your radiosafety officer for detailed procedures.At the end of 51Cr labeling time, add 10 ml of RPMI/10%FBS and spin 5 min at 530 x g. Discard the supernatant with the required safety precautions (contact your radiosafety officer for details).Repeat the washing step with 10 ml of RPMI/10%FBS two more times.After the third wash, resuspend the cells at a concentration of 0.02 x 106/ml in RT RPMI/10% FBS.",
    "50 μl (1,000 cells) of freshly labelled 51Cr cell solution is added at the last step (see step A4) in each well of a 96-V-bottom plate.Preparation of the peptide dilutionsDissolve the antigenic peptide of interest [here NY-ESO-1157-165 peptide (SLLMWITQC)] in PBS to prepare a stock solution of 1mg/ml (~1 mM) for a 10-AA peptide.From the stock solution, prepare a 500x dilution in RPMI/10% FBS to get a starting concentration of 2 μM for the following serial dilution steps. This represents a 2x concentrated solution of antigenic peptide, given the 1:2 dilution step occurring during the plating step (step A4). Note: To calculate the volume of antigenic peptide solution required for the serial dilutions, consider that each condition is tested in duplicate and that spare volume is needed. 200 μl [100 μl peptide per well x 2 (duplicates)] of peptide solution are required per T cell tested. Be sure to have at least 20% spare volume. Example for 4 CD8 T cells: 4 x [100 μl peptide x 2(duplicates)] = 800 μl required + spare volume → prepare 1 ml of initial 2 μM solution.Prepare 7 tubes (15 ml Falcon) with RPMI/10% FBS and make serial 10x-dilutions from the 2 μM peptide solution, making sure to thoroughly vortex the tube and to change the pipet tips each time. Note: Example for 4 CD8 T cells: 100 μl (2 μM) + 900 μl RPMI/10% FBS → 100 μl (0.2 μM)+ 900 μl RPMI/10% FBS → 100 μl (0.02 μM) + 900 μl RPMI/10% FBS and so on.Pipette 100 μl of the 2x concentrated peptide solution per well of a 96-V-bottom plate, starting from the bottom (lowest concentration) to the top (highest concentration) using a 12-multichannel pipette and a bassin. This will avoid changing the tips each time.",
    "For controls, prepare one solution without peptide and one with an irrelevant peptide (e.g., a class I Flu-specific peptide) at the highest concentration (2 μM) for each T cell clone to be tested.Preparation of CD8 T cell clones (effector cells)Calculate the number of cells needed for the test:For each T cell clone, you will need 10,000 x 2(duplicates) = 20,000 x 8 dilutions = 160,000 cells and 40,000 cells for the controls w/o peptide and irrelevant peptide, making a total of 0.2 x 106 cells for each T cell clone to be tested.Accounting for volume loss, prepare 0.25 x 106 T cells and resuspend them in 1.25 ml RT RPMI/10% FBS (0.2 x 106 cells/ml).Add 50 μl of the prepared effector cells (= 10,000 cells/well) to each well that already contains 100 μl of the serial peptide dilutions.Steps to load the samples in assay plates (Figure 1)1st Step: Peptide dilutions (100 μl) (step A2)2nd Step: CD8 T cell clones (10,000 cells in 50 μl) (step A3)3rd Step: 51Cr-labelled T2 (1,000 cells in 50 μl) (step A1)Controls: Spontaneous Release (SR): 4 wells with 150 μl of medium and 50 μl 51Cr- labelled T2. Total Release (TR): 4 wells with 150 μl of 1 M HCl and 50 μl 51Cr-labelled T2.When the plate is filled, incubate it for 4 h at 37 °C in an incubator with 5% CO2.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160810/20160810200646_1956.jpgFigure 1. Steps to load the CTL test samples into V-bottom 96-well plates. Step 1: Load 100 μl of the 2x peptide solution with a multichannel pipette, from low concentration (bottom, light blue) to high concentration (top, dark blue). Step 2: Individually add 50 μl of effector CD8 T cell clones in duplicate (here clones A and B), from bottom to top (black dots). You can test up to six clones per 96-well plate.",
    "Step 3: Load 50 μl of freshly 51Cr-labelled target cells into every well using a multichannel pipette. The control wells are prepared in the last plate of the experiment. Avoid touching the liquid present in the wells while introducing the different components of the test.Determination of 51Cr radioactivity At the end of the 4 h incubation, spin the plate for 2 min at 234 x g and transfer 50 μl of the supernatant from each well to a LumaPlate-96 using a multi-channel pipette. The amount of radiation emitted by 51Cr present in each supernatant is determined as Counts per Minute (CPM) using a TopCount NXT reader.Calculation of specific lysis: EC50 and EMaxTo calculate the amount of specific lysis that occurred in each well, use the following formula: 100x [experimental counts per minutes (cpm) - SR (average cpm)/(TR(average cpm) - SR (average cpm)] = % specific lysis. The antigen sensitivity and maximum killing capacity of each clone can be quantified as EC50 and EMax, respectively. EC50 is defined by the peptide concentration producing half maximal lysis of target cells and can be derived by fitting a dose response curve analysis using the Prism software for example (Figure 2). EMax is defined as the relative maximal lysis capacity of the effector T cells (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160810/20160810200930_3235.jpgFigure 2. The relative functional avidity of five NY-ESO-1157-165-reactive CD8 T cell clones expressing distinct αβTCRs assessed by measuring the lysis capacity of T2 target cells pulsed with graded concentrations of the natural NY-ESO-1157-165 peptide (SLLMWITQC). Also shown is an example of EC50 (i.e., the peptide concentration required to achieve 50% of maximal lysis) and EMax [i.e., maximal lysis at high (saturating) antigen dose)] for the clone producing highest maximal lysis (black round). Details can be found in Hebeisen et al., 2015.",
    "Tumor killing (TK) Assay with tumor target cell titrationThe following section describes the different steps needed to perform a tumor killing (TK) assay: Radioactive labelling of tumor target cells with 51Cr (step B1). Preparation of the effector CD8 T cells (step B2). Preparation of the peptide solutions (step B3). Loading procedure into 96-well plate (step B4). Determination of 51Cr radioactivity (step B5). Analysis of results (step B6).Radioactive labeling of tumor cell line with 51CrCalculate the number of target cells (e.g., Melanoma cell line Me275) needed for the TK assay. You will need 1,000 target cells for 1 well of a 96-well plate. Consider adding 20% more cells to account for volume loss during pipetting. Note: We usually label 0.5 x 106 target cells, which is enough for 500 wells.Harvest the correct number of tumor target cells in 15 ml Falcon tubes and spin them for 5 min at 530 x g at room temperature (RT). Wash the cells in 1 ml RT RPMI/10% FBS medium. Spin down, remove all liquid and incubate the tumor cells with 50 μl of pure 51Cr solution (activity 1 mCi/ml) for 45 min at 37 °C in a water bath. After the 51Cr labeling, add 10 ml of RPMI/10% FBS and spin 5 min at 530 x g. Discard the supernatant with the required safety precautions (contact your radiosafety officer for detailed procedures).Repeat the washing step with 10 ml of RPMI/10%FBS two more times.After the third wash, resuspend the cells at a concentration of 0.02 x 106/ml in RT RPMI/10% FBS.50 μl (1,000 cells) of this cell solution is added at the last step (see step B4) in each well of a 96-V-bottom plate.Preparation of T cell clonesFor the tumor killing assay done in duplicate, 0.1 x 106 T cells are needed per clone.",
    "If the test includes conditions with and without peptide pulsing on the target (see step B4), a minimum of 0.2 x 106 T cells are needed.CD8 T cell clones are counted and resuspended at a concentration of 0.6 x 106/ml in RT RPMI/10% FBS.From that solution, prepare a serial dilution directly in 96-V-bottom plates as follows:Add 75 μl (45,000 cells) in the first well for the first condition [effector (E) to target (T) ratio 30:1] and 50 μl of RPMI/10% FBS in the three wells located underneath. Remember to do it twice for the duplicate. Proceed by transferring 25 μl of the first well in the second, mix well by pipetting up and down, and proceed likewise for the successive dilutions. At the end, all the wells contain 50 ul of medium with the number of cells indicated in brackets. Note: A multi-channel pipet can be used to proceed entire 96-well plates rapidly.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160810/20160810203449_5009.jpgPeptide solutionDilute peptide stock solution (1 mM) in RPMI/10% FBS medium to make a 2x concentrated 2 μM solution. Final concentration per well with peptide will be 1 μM. For example, put 10 μl peptide stock solution (1 mM) in 5 ml RPMI/10% FBS (enough for 500 tests).Add either 100 μl RPMI/10% FBS (condition without peptide) or 100 μl 2x concentrated peptide solution to the appropriate wells.Note: Per 96-well plate, we prepare the “no peptide” condition in the top 4 lines (A to D) and a “+ peptide” condition in the 4 bottom lines (E to H).",
    "Steps to load the samples in assay plates (Figure 3)1st Step: CD8 T cell clones serial dilution (50 μl) (step B2)2nd Step: Solution with or without peptide (100 μl) (step B3)3rd Step: 51Cr-labelled Me275 (1,000 cells in 50 μl) (step B1)Controls: Spontaneous Release (SR): 4 well with 150 μl of medium and 50 μl 51Cr-labelled T2 .Total Release (TR): 4 well with 150 μl of 1 M HCl and 50 μl 51Cr-labelled T2When the plate is filled, incubate the test samples for 4 h at 37 °C in an incubator with 5% CO2.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160810/20160810202159_9360.jpg Figure 3. Steps to load the TK test samples into V-bottom 96-well plates. Step 1: Perform the serial dilution of CD8 T cell clones to get 50 μl of cells in each wells. For each clone (here A and B), reproduce the serial dilutions in the two conditions, with or without peptide. Step 2: Add 100 μl of 2x peptide solution (red) or medium (blue) in the corresponding halves of the plate using a multichannel pipette. Step 3: Load 50 μl of freshly 51Cr-labelled target cells into every well using a multichannel pipette. The control wells are prepared in the last plate of the experiment. Avoid touching the liquid present in the wells while introducing the different components of the test.Determination of 51Cr radioactivity At the end of the 4 h incubation, spin the plate for 2 min at 234 x g and transfer 50 μl of the supernatant from each well to a LumaPlate-96 using a multi-channel pipette. The amount of radiation emitted by 51Cr present in each supernatant is determined as Counts per Minute (CPM) using a TopCount NXT reader.",
    "Calculation of specific lysisTo calculate the amount of specific lysis that occurred in each well, use the following formula: 100x [(experimental counts per minutes (cpm) - SR (average cpm)/(TR (average cpm) - SR (average cpm)] = % specific lysis. The efficacy by which the effector CD8 T cell recognize and lyse tumor cells at the distinct effector to target ratios can be represented as shown in Figure 4 by using the Prism software.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160810/20160810202535_2320.jpgFigure 4. The relative tumor cell lysis capacity of five NY-ESO-1157-165-reactive CD8 T cell clones expressing distinct αβTCRs assessed using the melanoma cell line Me275 (A2pos/NY-ESO-1157-165pos) at the indicated effector:target ratios. For details, see Hebeisen et al., 2015."
  ],
  "subjectAreas": [
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}