{
  "id": 8963,
  "origin_website": "Jove",
  "title": "Rewiring Neuronal Circuits: A New Method for Fast Neurite Extension and Functional Neuronal Connection",
  "procedures": [
    "All procedures detailed below were approved by McGill University's Animal Care Committee and conformed to the guidelines of the Canadian Council of Animal Care.\n1. Standardization of Neuronal Cultures Using Microfluidic Devices: Device Assembly\nSelect a suitable microfluidic device for the desired experiment. To connect neurons within the same population, use the Neuro Devices (Figure 1) and to connect neurons in different populations use the Co-Culture Devices (Figure 6).\nClean and prepare the desired number of sterile coverslips or glass bottom dishes. For best results on plastic surfaces use 35 mm dishes, on glass use 25 mm coverslips, or 35 mm glass bottom dishes. Select glass thickness based on the imaging system, for instance 0.15 mm.\nCoat the dishes or coverslips with 0.5-1 mL of 100 µg/mL PDL for 2 h or overnight at room temperature.\n\tNote: Protocol can be paused here and resumed the following day if desired. Furthemore, dishes can be coated with borate buffer-diluted PDL, Poly-L-Lysine (PLL), laminin or any other cell adhesion molecule.\nWash the dishes twice with water (do not use phosphate-buffered saline (PBS) as salt crystals may block the channels), remove all the liquid and let it dry in a sterile environment such as a biosafety cabinet for 5-10 min or until the surface is completely dry.\n\tNote: Be careful to ensure that the coverslips are absolutely dry, as any remaining liquid will interfere with the adherence of the microfluidic systems.\nPlace microfluidic devices with patterns facing up under UV light in a sterile environment (biosafety cabinet) for 10 min. Be sure to follow sterile procedures when working in the biosafety cabinet10.\nUsing tweezers place a microfluidic device with pattern facing down in contact with the clean coverslip/dish. Use the tweezers to softly press the device so that it adheres to the glass.",
    "Note: The transparency of the adhered region will be visible when looking against the light. Make sure all corners are contacting the glass. Do this to all microfluidic devices. See Figure 1a .\nTo fill the single population device with medium, point the pipette towards the channels and add 50 µL of complete cell medium supplemented with serum-free B-27 (volume ratio 1:50) and 500 µg/mL penicillin/streptomycin/glutamine (collectively called NBM) to the right upper well, and then add another 50 µL to the well lying diagonally to it. Do this for all devices, making sure that the medium flows between wells. Next, add 50 µL of medium to the remaining 2 wells. See Figure 2a .\nTo fill the multiple population device with medium, point the pipette towards the channels and add 30 µL of complete NBM to the right wells, refer to Figure 6a. Do this for all devices, making sure that the medium flows between wells. Next, add 50 µL of medium to the remaining 4 wells.\nPlace the devices in a bigger plate with an open dish with autoclaved water (wet chamber) and place in the incubator (37 °C, 5% CO2 and 95% humidity) for 1-2 h while preparing the cell culture. See Figure 2b .\n2. Plating Neurons in Microfluidic Systems\nFollowing the protocol outlined in Ref.8, obtain dissociated hippocampal or cortical neurons from Sprague Dawley rat embryos (either gender).\nResuspend embryonic neurons in NBM at a concentration of 1-2 million neurons/mL. Verify cell concentrations in the microscope using a hemocytometer and following reference8. Adjust the cell concentration according to the desired cell density. To increase the chances of obtaining single hippocampal axons per channel, plate 10,000 neurons per device. To have multiple axons in the same channel, plate 60,000 neurons per device.",
    "Note: These numbers vary according to the neuronal type used.\nRemove the medium from the microfluidic devices without emptying the wells. Leave approximately 5 µL in each.\nTo plate cells in the single population device, add 50 µL of NBM to the lower right well. At this point the medium flows by itself to fill the other lower well. Add 20 µL of the concentrate cell solution into the top right well of the microfluidic device, as indicated in Figure 1b .\nTo plate cells in the multiple population device add 20 µL of the concentrate cell solution into each of the right wells in Figure 6a.\nCheck in the microscope if cells are inside the chambers and place the devices in the incubator for 15-30 min to promote cell attachment to the substrate.\nCheck in the microscope if there are enough cells in the chambers. If more are needed, repeat steps 2.4 and 2.5.\nAdd 50 µL of NBM to the 2 top wells of the single population device and 20 µL of NBM into the same well as the cells were injected in the multiple population device. The media protrudes slightly to form a positive meniscus giving the wells a muffin top aspect. Again, see Figure 2a.\nMaintain the cells at 37 °C, 5% CO2 and 95% humidity.\n3. Maintaining the Neuronal Cultures\nRemove NBM (roughly 30 µL with a pipette) from the cells and apply new pre-warmed NBM the day following their introduction to the devices (that is 1 d after step 2).\nCheck every 2 days if there is enough medium in each channel. If the muffin top is low just add more medium to the top wells.",
    "Culture cells for at least 7 d before removal of the microfluidic devices. The cells can survive in these devices for several weeks. Remove the devices 1-2 days before experiments are performed on samples.\n4. Removal of Microfluidic Devices\n1 - 2 d before removal of microfluidic devices, add 2 mL of NBM prewarmed to 37 °C to each sample dish, flooding the chambers, and maintain the devices in the incubator.\nUse sterile tweezers and one tip to remove the microfluidic devices from the coverslips leaving a patterned configuration of neurons. Use the tip to hold the coverslip in place and the tweezers to clasp the edge of the device at the bottom left corner of the well. Delicately apply torsion, raising the device up with the tweezers so that it peels off the coverslip. See Figure 2c-2d.\nEvery 2-3 days, replace half the NBM until the sample is used for experiments.\nBefore performing rewiring experiments on the sample, verify that neurites in the single population device channels and the neuronal populations in the multiple population device are isolated by examining the gaps between them in the microscope to ensure there are no filaments linking neuronal populations.\n5. Preparing PDL-coated Beads\nAdd 2 x 50 µL drops of either 4, 10 or 20 µm polystyrene beads diluted in water (1:500) to 1 mL of PDL (100 µg/mL). Leave for at least 2 h at room temperature.\n\tNote: Protocol can be paused here and resumed the following day.\nCentrifuge the solution at 8,820 x g for 1 min. Carefully remove supernatant without disturbing the beads accumulated at bottom of container.\nWash the beads twice with 1 mL of sterile 10 mM HEPES pH 8.4 solution.\nResuspend the PDL-coated beads in 200 mL of 10 mM HEPES pH 8.4 solution.",
    "6. Preparing Micropipettes\nPrepare pipettes from glass capillary tubes (1 mm inner diameter, 1.5 mm outer diameter) using a horizontal electrode puller. Adjust settings so the outer tip of the pulled micropipette is ~ 2-5 µm. Before pulling, ensure the glass tubes are clean.\nFix pipettes to glass slides for storage, and ensure that the tip does not contact the surface of the slide as the tip is fragile. Store at room temperature in a covered container to protect from dust. Use pipettes the same day they are pulled.\n7. PDL-bead Adhesion to Neurons\nAdd 40-60 µL of PDL-coated beads prepared in step 5 to a cell culture prepared in step 4. Center the pipette tip over the neurons, which are faintly visible on the coverslip, and add the beads (See Figure 3).\nReturn the sample to the incubator for 1 h to promote the formation of synaptic contacts8,9.\nAfter the incubation, remove any un-adhered beads by gently washing the culture with pre-warmed NBM.\n8. Preparing Physiological Saline Solution (for Room Temperature Experiments)\nPrepare physiological saline solution by combining the ingredients listed in references7,8. This is to regulate the cell environment outside the incubator.\nVerify osmolarity and pH levels as indicated in references7,8.\nContinuously infuse solution with O2 to minimize pH fluctuations while conducting experiments.\nHeat to room temperature.\nSet up the perfusion system by inserting one end of a plastic tube (optional dimensions) in O2-infused physiological solution and fixing the other end to a needle inserted in the sample holder. Place the tubing and solution higher than the sample (See Figure 4).\nDisconnect the tube from the needle and connect it to a syringe. Use the syringe to exert pressure and draw liquid, filling the tube. Seal with a roller clamp and reconnect the needle.\n9. Bead Micromanipulation",
    "Install sample in an experimental set-up such that cells can be accessed from above by two micropipettes mounted in micromanipulators and accessed optically below, for instance with the 40X-phase objective (numerical aperture of 0.6) of an inverted optical microscope. In this configuration, mount a CCD camera for image capture on the side port of the microscope. Connect each pipette to 1 mL syringes via plastic tubing. At this step, replace NBM with physiological saline solution (1-2 mL) (See Figure 4).\nDuring experiments, continuously perfuse cells with the physiological saline solution prepared in step 8 at a rate of 0.5-1 mL/min.\nSelect a PDL-bead NOT attached to a neuron in the field of view. Align the bead with a micropipette tip by focusing onto the bead then up to the micropipette. Bring the tip down as close as possible to the bead by monitoring it through the microscope.\nApply negative pressure with the 1 mL syringe connected to the pipette to pick up the bead. Maintain negative pressure throughout the experiment.\n10. Pulling Neurites\nSelect a PDL-bead attached to a neuron in the field of view and attach it to the second micropipette using suction as described in steps 9.3-9.4.\nPull the PDL-bead-neuron complex by slowly (~0.5 µm/min) moving either the micromanipulator or the sample stage by 1 µm and pause for 5 min to allow neurite initiation.\nRepeat step 10.2 twice.\n\tNote: The first 3 µm have to be pulled very slowly to guarantee experimental success, which occurs over 95% of the time.\nPull the PDL-bead-neuron complex by slowly (~0.5 µm/min) moving either the micromanipulator or the sample stage by 2 µm and pause for 5 min to allow neurite elongation.",
    "After successful initiation and neurite extension for the first 5 µm, pull the neurite at 20 µm/min over millimeter-scale distances.\n\tNote: Pulling can be performed continuously or in steps and at varying rates. See Figure 5b-5c .\n11. Connecting Neurons\nSelect a region rich in neurites and lower the PDL-bead-neurite complex so that it physically contacts it. Use other beads to gauge tip height above coverslip surface. See Figure 5d.\nLeave the PDL-bead-neurite complex in contact with the target neurite while manipulating the second micropipette. Lower the second pipette with the second PDL-bead on top of the newly formed neurite about 20 µm form the first bead. Use the second PDL-bead to push the new neurite filament towards the target cell.\nHold both beads in place for at least 1 h. Verify the absence of focal swelling, a thickening of the neurites contacting the bead, with the microscope16.\nDuring this time, use perfusion to slowly change the medium of the sample from physiological saline to pre-warmed, CO2-equilibrated NBM.\nRelease the bead from the second pipette by releasing suction. If the new neurite remains attached, release the first bead as well. See Figure 5e .\nGently remove saline solution and replace with NBM (~2 mL).\nCarefully place the sample back in the incubator to strengthen the neuronal connection for future experiments. This connection is stable for >24 h7.\n12. Verifying the Functionality of the New Connection via Whole-cell Paired Patch Clamp Recordings\nFollow references7,18,19. to assemble an electrophysiology set-up.\nFollow references7. to prepare the pre- and postsynaptic electrodes.\nGather patch clamp data, again following references18,19.\nCompare the results to naturally occurring signals7 to determine the connection type.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}