{
  "id": 7522,
  "origin_website": "Bio",
  "title": "Femtoliter Injection of ESCRT-III Proteins into Adhered Giant Unilamellar Vesicles",
  "procedures": [
    "The complete protocol is summarized in a flow chart shown in Figure 1.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4328/bioprotoc-12-04-4328-g001.jpgFigure 1. Flow chart of the complete protocol for femtoliter injection of ESCRT-III proteins into adhered GUVs. Formation of GUVs by PVA gel-assisted swellingClean a 26 mm × 56 mm glass slide by rinsing it consecutively with water, ethanol, and water; dry it under a N2 flow. A separate slide is needed for each tested condition.Place 50 µL of 5% w/v PVA solution (see Recipe 1) on the cleaned glass slide and spread it with the micropipette tip.Incubate the glass at 50°C in the oven for at least 30 min.Depending on the protein type to be examined, prepare a mixture of POPC:POPS:DSPE-PEG 2000 Biotin:DPPE-Rhodamine or POPC:POPS:chol:PI(3)P:DSPE-PEG 2000 Biotin:DPPE-Rhodamine (see Recipes 2 and 3) in chloroform at 1 mg·mL-1 final concentration.Clean thoroughly a Hamilton syringe with chloroform and spread 10 to 15 µL of the lipid mixture on the PVA film dried on the glass (taken from the oven without cooling it down) using the needle of the syringe and until the slide appears dry.Place the glass slide for 1 h under vacuum to eliminate the excess chloroform.Glue the Teflon spacer (via silicone grease) to the glass with the dried lipid film (see Figure 2A).Fill the chamber with 1,800 µL of 1× protein buffer (see Recipe 4) and place a glass coverslip on top of the Teflon spacer (see Figure 2B) to avoid unwanted evaporation.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4328/bioprotoc-12-04-4328-g002.jpgFigure 2. GUV chamber for gel-assisted swelling. The Teflon spacer is between two cover glasses (seen in panel B). The bottom glass is coated with PVA where lipids are deposited. The white oval roughly indicates the area with the deposited lipid mixture.Incubate for 10 min at room temperature, to allow swelling and GUV formation.",
    "After this time, tap gently a few times on the bottom of the growing chamber, remove the upper coverslip by sliding it to the side and collect the GUVs using a 1,000 µL pipette tip without touching the PVA film, to avoid collecting PVA debris. Collected GUVs must be placed in a glass container, protected from light to avoid oxidation, and stored at room temperature (~21°C). The solutions should be used fresh, even though no differences in the behavior were observed for GUV solutions used on the following day after preparation.Fabrication and loading of the micropipetteTake a borosilicate capillary and carefully apply N2 flow through it, to make sure that the capillary is not clogged.Place the capillary at the holder of the micropipette puller (Figure 3).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4328/bioprotoc-12-04-4328-g003.jpgFigure 3. Capillary placed in the micropipette puller. Pull the capillary using the one-line program, to achieve a bee-needle orifice of ~250 nm (HEAT Ramp; PULL 100, VEL 10, TIME 250, PRESSURE 500´) in the micropipette puller.Filter the injection solution (2.4 µM PfBro1, and 4.8 µM of either PfVps32 or PfVps60 dissolved in 0.8× protein buffer, or 0.6 µM EhVps20t and 2.4 µM EhVps32, and 3 × 10-2 mg·mL-1 PEG-FITC, to monitor the injection; omit the addition of PEG-FITC in case one of the proteins is fluorescently labelled) through the 0.22 µm filter.Fill the micropipette with 10 µL of the filtered protein solution, using a microloader pipette tip (Figure 4).Gently tap the filled micropipette and leave it for 30 min in a vertical position to eliminate air bubbles.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4328/bioprotoc-12-04-4328-g004.jpgFigure 4. Loading of ESCRT proteins into the injection micropipette. The filament of the microloader tip is inserted as deep as possible into the injection micropipette. Pipette the loading solution into the micropipette and slowly pull out the microloader after loading 10 µL.",
    "Coating of coverslip glasses with avidin and immobilization of GUVsClean a 26 mm × 56 mm coverslip by rinsing consecutively with water, ethanol, and water; dry it under N2 flow.Functionalize the coverslips with 100 µL of a 1:1 (v/v) mixture of BSA (1 mg·mL-1) and biotin-BSA (1 mg·mL-1), dissolved in 1× protein buffer, following the previously reported protocol (Maan et al., 2018).Incubate for 20 min at room temperature.Rinse the glass with water and spread 100 µL of 5 × 10-3 mg·mL-1 avidin solution (in 1× protein buffer).Incubate for 5 min at room temperature.Rinse the glass with water to remove the unbound avidin.Glue the Teflon spacer (with silicone paste) to the glass, to form an observation chamber.Transfer the collected GUVs to the observation chamber with a pipette and let them sediment for at least 10 min. DSPE-PEG 2000 Biotin (in the vesicle membrane) binds to the avidin on the coverslip, resulting in vesicle immobilization.Note: Increased concentrations of avidin result in higher binding of the GUV to the glass surface, which later hinders budding, as the vesicle excess area is consumed for adhesion (see Figure 5). imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4328/bioprotoc-12-04-4328-g005.jpgFigure 5. Side view of immobilized vesicles (here, POPC:POPS:chol:PI(3)P:DSPE-PEG 2000 Biotin:DPPE-Rhodamine in molar ratio 60.9:10:25:3:1:0.1). The coverslips were coated with a 1:1 mixture of biotin-BSA (1 mg·mL-1) and BSA (1 mg·mL-1), and then avidin was deposited. The vesicles are visualized via vertical confocal cross sections. The color is inverted. The scale bars correspond to 10 µm.Injection and observation of GUVsPlace the observation chamber with the immobilized GUVs on the microscope stage.Connect the filled micropipette to the holder of the microinjector (Figure 6).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4328/bioprotoc-12-04-4328-g006.jpgFigure 6. Attachment of the micropipette holder of the microinjector to the micromanipulator. Attach the holder with the pipette to the mechanical arm of the micromanipulator.",
    "Set the angle of injection as large as the microscope setup allows (see Figure 7).Note: The ideal angle of injection would be 90°, to avoid lateral displacement of the vesicles during puncture attempts. However, this cannot be achieved since the condenser of the microscope occupies the space above the sample. imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4328/bioprotoc-12-04-4328-g007.jpgFigure 7. Micropipette setup of the injection procedure. A: Top-view of the setup; for clarity the observation chamber was removed. B: A close-up side-view of the injection angle. Note that the micropipette holder is as close to the condenser of the microscope as possible to ensure high angle of injection.With the micromanipulator, introduce the micropipette into the solution of the observation chamber and focus on the tip of the pipette.Set the microscope to the desired observation settings. For the measurement presented here, they were the following:The DPPE-Rhodamine dye (integrated in the membrane of the GUVs) was excited with a 561 nm diode-pumped solid-state laser, and the signal was collected in the 570–650 nm range.The PEG-FITC dye was excited with a 488 nm argon laser, and the signal was collected in the 495–530 nm range.To avoid crosstalk between the different fluorescence signals, sequential scanning was performed.Place the micropipette in a site where no GUVs are observed and purge it (by pressing the “Clean” bottom of the microinjector) to confirm that the micropipette is not clogged; a signal from the fluorescent dye leaving the pipette tip should be detected.Lower the micropipette close to, but still above the focal plane of the GUVs.Approach a selected GUV with the tip of the micropipette from above; the selected vesicle should be clean and without defects (to ensure this, examine the selected GUV with a XYZ scan).Lift the micropipette a few micrometers above the vesicle (the micropipette tip goes out of focus).",
    "Puncture the GUV, by moving the micropipette towards the vesicle in both Z and X directions.Perform a XYZ scan to make sure that the micropipette penetrates into the GUV.Start recording a time sequence.Inject the vesicle (see Figure 8 and Figure 9) using the following parameters of the microinjector: pressure of injection: 150 hPa; time of injection: 5 s; compensation pressure: 1 hPa. These parameters ensure that injected volumes are in the sub-picoliter range (a few hundreds of femtoliters).Pull the micropipette out from the interior of the GUV (lift the micropipette in Z direction).Perform a XYZ scan to detect in which focal plane the outward buds formed (Figure 8, Figure 9).Note: Tense vesicles are easier to puncture than fluctuating ones. imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4328/bioprotoc-12-04-4328-g008.jpgFigure 8. Horizontal (XY) confocal cross sections overlayed with phase-contrast images showing injection of GUVs with PEG-FITC solution (top row) or purified P. falciparum ESCRT-III proteins (bottom row). The membrane is presented in red and PEG-FITC in green. The tip of the injection pipette can be noticed on the membrane in the first two frames in each sequence. The upper row represents the control experiment (ESCRT-free buffer is injected, so outward buds were not observed). In contrast, when ESCRT-III recombinant proteins were injected, outward buds formed; see also Video 1. The arrows on the last frame point to the outward buds. Adapted from Avalos-Padilla et al. (2021b).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Injection of a GUV with purified P. falciparum ESCRT-III proteins. Real-time recording. The specific information describing the system is indicated in the caption of Figure 8.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4328/bioprotoc-12-04-4328-g009.jpgFigure 9. Horizontal (XY) confocal cross sections of injection of GUVs with PEG-FITC solution (top row) or purified E. histolytica ESCRT-III proteins (bottom row). The membrane is shown in magenta and PEG-FITC in cyan.",
    "The tip of the injection pipette can be seen on the first two frames in each sequence. The arrows on the last frame point to the outward buds; see also Video 2. The inset in the last snapshot shows a zoomed-in view of outward buds from the same vesicle but at another XY plane.<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 2. Injection of a GUV with purified E. histolytica ESCRT-III proteins. Real-time recording. The specific information describing the system is indicated in the caption of Figure 9."
  ],
  "subjectAreas": [
    "Biophysics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}