{
  "id": 17325,
  "origin_website": "Jove",
  "title": "Drug Treatment by Central Venous Catheter in a Mouse Model of Angiotensin II Induced Abdominal Aortic Aneurysm and Monitoring by 3D Ultrasound",
  "procedures": [
    "Animal experiments were approved by the local ethics committee and the Austrian Ministry of Science (BMWFW-66.009/0355-WF/V/3b/2016), conforming to the European Directive 2010/63/EU on the protection of animals used for scientific purposes and the Austrian Animal Experiment Act 2012. Humane endpoints were set as follows: loss of ≥15% body weight, avoiding food and/or water intake, reduced activity (hypokinesia) or dyskinesia, or prolonged shaking, scratching, labored respiration, or hunched posture despite pain/symptom management. If necessary, an animal is euthanized under deep anesthesia, i.e., an overdose cocktail of ketamine (approx. 100 mg/kg) and xylazine (approx. 5 mg/kg), or by cervical dislocation. For surgical procedures, aseptic technique and sterile/clean gloves are used throughout.\n1. Pump implantation\nAnesthesia\n\t\nKeep ApoE deficient mice (B6.129P2-Apoetm1Unc/J) on a normal diet and preferably include 12-14 week old male animals in the experiments to represent the male predominance in human disease3.\n1 day before surgery (d-1, pre-OP), prepare and fill the osmotic pumps with the desired concentration of angiotensin II according to mouse weight following the manufacturer's protocol and incubate the pumps in saline at 37 °C overnight15.\n\t\t​Example: For a 25 g mouse, using osmotic pumps (see Table of Materials) with a 1000 ng/kg/min delivery rate and a 0.25 µL/h pump rate for 28 days, dissolve 1.8 mg of Ang-II in 300 µL of saline (6000 ng/µL concentration for delivering 1500 ng/h of Ang-II). Load the solution with the blunt filling needle into the pump and then insert the flow moderator to close the pump.\nPlace the mouse in the anesthesia chamber at 3%-4% isoflurane mixed with 2 L/min O2 until unconscious. Move the mouse to a heated table (37 °C) in a prone position and maintain isoflurane anesthesia at 1.8%-2% through a nose cone.\nApply eye lubricant to both eyes to prevent dryness.",
    "Inject the mouse with 2.5% buprenorphine in saline at 10 µL/g of mouse subcutaneously and verify the depth of anesthesia by a toe pinch.\nShave a small area on the upper left side of the mouse back over the shoulder blade. Apply 10% (w/v) povidone-iodine solution for disinfection of the shaved area.\nPump insertion (5-7 min, performed without a microscope)\n\t\nCheck that the mouse is completely anesthetized by toe pinch and make a 1 cm transversal incision in the skin of the upper back with a scalpel between the midspinal and left scapular line.\nHold the skin up with forceps and use blunt, curved scissors to make a subcutaneous pocket by pushing toward the left hind limb. Open the scissors, pull the opened scissors out of the cut and repeat to widen the pocket.\nGently insert the pump into the pocket with the flow moderator toward the tail (to minimize potential interference of Ang-II release by the incision site).\n\t\tNOTE: The pocket should not only be wide enough for the pump insertion but also for the skin to not be tight around the pump, and there should be at least 5 mm between the pump and incision site to allow for optimal wound healing.\nClose the wound with 4-0 absorbable interrupted sutures.\nInject the mouse with 10% glucose in saline at 10 µL/g of mouse subcutaneously.\nApply povidone-iodine wound spray to the closed wound and allow the mouse to recover consciousness under a heating lamp, then return it to the cage with 7.5 mg of piritramide (for extended pain management) and 20 mL of 5% glucose in 200 mL of drinking water for 3 days post operation.\nCheck on the mice several times per day for signs of pain or distress.",
    "​NOTE: Since aortic ruptures occur at a 20%-40% rate and predominantly within the first 3-10 days post operation, the risk of prolonged severe pain or distress needs to be minimized by frequent animal monitoring. The main indications for imminent rupture include: separation from the group, hunched posture, decreased mobility (to the extent of hind limb paralysis), and decreased or non-responsiveness during handling.\n2. Jugular vein catheterization\nNOTE: This surgical procedure requires a microscope with 8x-10x magnification.\nUsing the vascular access system (see Table of Materials), prepare the catheter by cutting the 3Fr side to the desired length (~5-7 mm before the silicone anchor) and pushing the catheter over the 22 G metal connector of the vascular access system (VAS) with at least 3 mm overlap. Place the aluminum cap on the button to protect the port.\nPrepare 1-1.5 cm long 6-0 silk ligatures.\nPlace the mouse in the anesthesia chamber at 3%-4% isoflurane mixed with 2 L/min O2 until unconscious.\nMove the mouse to a heated table (37 °C) in a supine position and maintain isoflurane anesthesia at 1.8%-2% through a nose cone.\nApply eye lubricant to both eyes to prevent dryness.\nInject the mouse with 2.5% buprenorphine in saline at 10 µL/g of mouse subcutaneously.\nShave the fur from the right side of the neck on the ventral side and on the right side of the upper back (the left side will have the implanted osmotic pump).\nApply the povidone-iodine solution for disinfection of the shaved area.\nCheck that the mouse is completely anesthetized by toe pinch.\nJugular vein preparation (5-10 min, performed under the microscope)\n\t\nMake a 0.5 cm transversal supraclavicular skin incision at the right side of the neck over the right clavicle.",
    "Use blunt microsurgical tweezers to separate the connective tissue and fat, exposing the external jugular vein. Avoid tearing apart small blood vessels in the fat.\nIsolate at least 5 mm of the vessel, close to the pectoral muscles.\nBlunt dissect tissue under the vein using bent micro tweezers and pass through 2-3 of the 6-0 ligatures.\n\t\t​NOTE: If any side branches are identified in the area of interest, either the ligature should be inserted to be caudal to the side branch or the side branch should be permanently ligated by isolating and tying off with a 6-0 ligature.\nTuck in the ligatures and add a drop of saline to the site.\nButton implantation (5-7 min, performed without a microscope)\n\t\nFlip the mouse over and place it in the prone position; verify the depth of anesthesia by a toe pinch and apply the povidone-iodine solution to disinfect the shaved area.\nMake a 1 cm sagittal incision on the upper back with a scalpel between the midspinal and right scapular lines.\nUse blunt curved scissors to make a circular pocket only slightly larger than the size of the VAS around the incision site by blunt dissection.\nUse the blunt curved scissors to tunnel cranially over the right shoulder toward the ventral incision at the neck by slightly opening the scissors, then pulling the opened scissors out, and repeating the action as it is pushed further in.\n\t\tNOTE: The mouse can be turned on its left side for this step.\nOnce the tunnel has reached the ventral incision, pass through surgical clamps from the ventral to the dorsal incision.",
    "Attach the 3Fr end of the catheter to the clamp and pull the catheter through the tunnel so that it is out of the ventral neck incision and the VAS is in place at the dorsal incision.\nInsert the VAS's surgical felt disk subcutaneously at the incision at the back.\nUnclamp the catheter and flush with saline or phosphate-buffered saline without calcium and magnesium (PBS-/-), check for patency by using the fork end of the handling tool to remove the protective aluminum cap, and then use the magnetic end to hold the button and inject with a 1 mL syringe attached to the corresponding injector until the liquid leaks from the 1Fr end.\n\t\tNOTE: Catheter flushing may alternatively be conducted in step 2.1.\nPush the button caudally in the pocket and close the skin over the felt disk of the VAS, under the flange of the VAS, with at least two 4-0 interrupted sutures cranially.\n\t\tNOTE: Ensure no tension on the skin around the button.\nVein catheterization (7-10 min, performed under the microscope)\n\t\nFlip the mouse back to the supine position, verify the depth of anesthesia by a toe pinch, and add a drop of saline to the cut site.\nTie the first ligature around the catheter and the jugular vein with 2-3 knots as far cranially as possible to ligate the vein and anchor the catheter to the outside. Move the second ligature as close as possible to the pectoral muscles.\nShorten the catheter to the required length so that ~3-5 mm of the catheter is in the vein by cutting with micro-scissors at a diagonal angle to create a sharp end.",
    "Pierce a hole in the vein using a 27 G needle attached to a 1 mL syringe filled with saline by pulling on the secured cranial ligature and pushing the needle parallel to the vein.\n\t\tNOTE: If blood from backflow leaks from the vein, use a cotton swab to apply pressure until the bleeding stops.\nInsert the catheter into the vein in the same manner by pulling on the secured cranial ligature and sliding the catheter into the vein using the bent tweezers. Push the catheter until it is aligned with the vein.\nTie the second ligature over the region where the catheter is inserted into the vein with 2-3 knots and check that there is no blood leakage. A third ligature and some of the local fat tissue may be used to additionally secure the catheter.\nCut off the excess end of both ligatures with micro-scissors and add a drop of saline.\nClose the skin with 4-0 absorbable interrupted sutures.\nInject the mouse with 10% glucose in saline at 10 µL/g of mouse subcutaneously.\nInject the mouse with the desired volume of inhibitor or PBS/saline by using the fork end of the handling tool to remove the protective aluminum cap and then the magnetic end to hold the button and inject with a 1 mL syringe attached to the injector.\n\t\tNOTE: Make sure there is no air or air bubbles in the injection syringe by pressing the plunger until a drop of liquid comes out before injecting. Maintain positive pressure on the plunger while disconnecting the syringe with the injector from the VAS to prevent pulling blood into the catheter tip and causing catheter blockage.",
    "Apply a povidone-iodine wound spray to the closed wound and allow the mouse to recover consciousness under a heating lamp, then return it to the cage with 7.5 mg of piritramide (for extended pain management) and 20 mL of 5% glucose in 200 mL of drinking water for 3 days post operation.\nCheck on the mice several times per day for signs of pain or distress.\nDaily injections (<5 min)\n\t\nFor daily injection, place the mouse in the anesthesia chamber at 3%-4% isoflurane mixed with 2 L/min O2 until it is unconscious and its breathing rate is slowed down, then inject as in step 2.12.10. Check the neck for signs of swelling post-injection, which would indicate that the catheter is no longer inserted in the vein. Also, note that injection will not be possible if the catheter is occluded.\n\t\t​NOTE: A 10 µL/g of mouse weight 1x per day injection is well tolerated by the mice.\n3. 3D ultrasound\nPrepare the ultrasound imaging system, heating table, and gel warmer, attach the transducer to the system, and set up above the stage in a transverse position (i.e., perpendicular to the mouse spine).\nUsing the ultrasound software, adjust the settings to gain of 30 dB, image depth of 9.0 mm, and image width of 8.08 mm.\nPlace the mouse in the anesthesia chamber at 3%-4% isoflurane mixed with 2 L/min O2 until unconscious. Move the mouse to a heated table (37 °C) in the supine position and maintain isoflurane anesthesia at 1.8%-2% through a nose cone.\nApply eye lubricant to both eyes to prevent dryness.\nShave the fur on the mouse abdomen. Apply hair removal cream for 1 min if needed, then wipe off and clean with damp gauze.",
    "Add a drop of electrode gel to each of the four electrocardiogram (ECG) electrodes on the stage and tape the mouse extremities to them.\nSpread warm ultrasound gel on the mouse's abdomen and lower the transmitter to set it in contact with the animal.\nIdentify the aorta as a circular fast pulsating vessel.\n\tNOTE: The inferior vena cava (IVC) will be located next to the aorta, and if the probe is pressed down firmly, the IVC will be compressed while the aorta remains stable. Confirmation that the analyzed vessel is the aorta rather than the IVC can be obtained using the pulse wave Doppler (PW-mode), with an angle of 65°. The aorta will have a high pulse wave velocity.\nLocate the left renal artery and survey the area manually up to 12 mm cranially to ensure there is no interference in the area of interest (i.e., suprarenal aorta). Return to the left renal artery then set the probe at 6 mm cranially from the left renal artery.\n\tNOTE: The 3D ultrasound will record the specified length (i.e., 12 mm) starting halfway (6 mm) caudally from the point of origin and up the specified length (12 mm) cranially. Troubleshooting steps for interference include pressing down slightly with the transducer, lifting then lowering the transducer again, applying more ultrasound gel, and tilting the angle of the stage.\n3D ultrasound acquisition\n\t\nSet the respiratory gating to 25% delay and a window of 50% and the ECG trigger (T1) to 50 ms (to record peak systolic dilation of the aorta).\n\t\tNOTE: Respiratory gating can be optimized for each animal based on the respiratory rate and effort to ensure movement artifacts are removed.",
    "From the 3D options, set the scan distance to 11.96 mm with a step size of 0.076 mm, which results in 157 frames.\nThe program will automatically acquire the 157 frames in approximately 1-2 min. Scroll through to check for image quality, repeat if subpar, then save the image.\n2D diameter acquisition\n\t\nTurn off the respiratory gating and ECG trigger, and manually locate the area with the largest diameter in the 12 mm stretch of the suprarenal aorta.\nAcquire a B-mode image16.\nAdditionally, without moving the transducer, acquire an ECG-gated kilohertz visualization (EKV) image with the system's standard settings at the same site.\nEnding the scan\n\t\nWipe the ultrasound gel from the abdomen and return the mouse to its cage. Monitor the mouse until it fully recovers.\n4. Ultrasound analysis\nVolume analysis\n\t\nIn the analysis software, open the 3D Mode image, and under the Image Processing menu, press on Load into 3D, which will compile the 157 2D frames into a 3D image (i.e., cube).\nIn the Volume Measurement menu, choose Parallel & Rotational Methods, and then the software will display the 3D image in a single pane.\nUnder Volume, press Start, and draw the first contour around the aorta's inner wall by clicking to add the first point, moving the cursor around the aorta, and then right-clicking to complete the contour.\nSkip 9-10 frames (0.75-1 mm), then draw another contour in the same manner. Repeat these steps until the last frame is reached. This should result in 16-17 contours.\n\t\tNOTE: The first and last frames have to have contours drawn in order for the correct volume over 12 mm to be calculated.",
    "Select the first contour from the menu and choose Refine. This will initiate the edge detection algorithm to closely fit the line to the vessel wall. Move the points on the contour by dragging them to a new position so that the contour accurately lines the aorta's inner wall edge.\n\t\tNOTE: In the Ang-II model, an intramural thrombus might be present. Since this is a common feature of this model, volume measurement should include the thrombus.\nRefine all the contours and press Finish to save the analysis. The calculated volume will be displayed in the bottom left corner.\nDiameter analysis\n\tNOTE: Diameter measurements may be conducted inner-to-inner wall, outer-to-outer wall, or inner-to-outer wall but must be consistent for all measurements. However, in the Ang-II model, an intramural thrombus might be present, which should be included in the analysis.\n\t\nFrom the 3D mode image: Evaluate the 157 frames to identify the maximum diameter by visual inspection. Then, from the Measurement menu, choose Linear and draw multiple lines across the aorta to determine the largest diameter.\nFrom the B-mode or EKV (ECG-gated kilohertz visualization) image: In the cine loop, identify the maximum expansion of the aorta (at systole) by visual inspection. Then, from the Measurement menu, choose Linear and draw multiple lines across the aorta to determine the largest diameter.\n\t\tNOTE: The ECG can be used to determine the cardiac cycle, but visual identification yields accurate results."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}