{
  "id": 19943,
  "origin_website": "Wiley",
  "title": "Fixation and Laser Capture Microdissection of Plant Tissue for RNA Extraction and RNASeq Library Preparation",
  "procedures": [
    "Tissue preparation for LCM involves infiltration, fixation, and embedding of tissue. Preparation of harvested tissue is performed in a cold, RNase-free environment to maintain stability of the RNA. Then, the tissue is dehydrated using a series of fixative solutions to simultaneously preserve enough visual details to identify specific cells for harvesting and allow maximum recovery of DNA, RNA, or protein from the harvested cells (in this case, RNA). Although there are several histological methods available for infiltration and fixation, it is important to understand the differences in structure between plant and animal cells to select the appropriate technique. Cryosectioning, commonly used for animal tissue, is undesirable for plant tissue due to the difficulty in stabilizing the vacuolated cells and the loss of tissue integrity caused by freezing and thawing (Kerk et al., 2003[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.844#cpz1844-bib-0020]). Plant tissues lose their histological integrity in cryosections even with prior fixation and treatment with cryoprotectants, which makes the identification of target cells difficult (Nelson et al., 2006[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.844#cpz1844-bib-0026]). The most commonly used fixatives are acetic acid, ethanol (EtOH), and xylene, but methanol and increasing concentrations of EtOH are an alternative; removing water from the plant cell and infusing the cell with methanol and EtOH will stabilize and maintain the integrity of the cellular contents. We use these fixative reagents for infiltration to increase the recovery of RNA because the cross-linking fixative formaldehyde–acetic acid–ethanol (FAA) reduces this recovery. The choice of infiltration and fixation methods should be a balance between the preservation of histological detail and maximum recovery of cellular contents, whether DNA, RNA, or protein (Kerk et al., 2003[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.844#cpz1844-bib-0020]).",
    "After infiltration and fixation, the tissue is embedded in either paraffin or polyester wax. Embedding of tissue enables better visual observation during cell harvesting and maintains the stability of tissue. The embedded block serves as an archive that can be resampled or re-sectioned even after an extended period (Kerk et al., 2003[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.844#cpz1844-bib-0020]). Paraffin embedding is commonly used, but in the current protocol, polyester wax is used. Paraffin melts at 55° to 65°C, whereas polyester wax melts at 38° to 40°C. The modifications to the embedding protocol avoid degradation of RNA at high temperatures, thus maximizing recovery of RNA.\nMaterials\nDiethyl pyrocarbonate (DEPC)-treated water (see recipe)\nRNase AWAY (Thermo Fisher Scientific) and spray bottle if purchased in bulk\nSeedlings of the plant of interest—e.g., Medicago truncatula\nFixative solution (see recipe), 4°C\nEtOH/polyester wax solution (see recipe), 37°C\n100% methanol (anhydrous, ultra-pure grade), 4°C\n70% (v/v) EtOH solution (see recipe), 4°C\n96% (v/v) EtOH solution (see recipe), 4°C\n100% EtOH (anhydrous, molecular biology grade), 4°C\nPolyester wax (e.g., Steedman's wax, Electron Microscopy Sciences, cat. no. 19312)\nDrierite\nGlass slide-staining box\nAutoclave\nSlimsette plastic biopsy cassettes with recessed cover (Thermo Scientific)\nAluminum foil\nTissue forceps (4.5 in.)\nCooling plate that can maintain −20°C (e.g., Tissue-Tek Cold Plate)\nNo. 2 pencil\nSingle-edge razor blades, individually wrapped\nSealed chamber and vacuum pump capable of pulling and holding 20-kPa vacuum\nRNase-free pipet tips (filter tips recommended)\nRNase-free beaker\n37°C incubator\nIndividually wrapped plastic drinking straws\nParafilm\nDisposable transfer pipet\nAirtight container (e.g., plastic food storage box with airtight lid) or sealable plastic bag\nPreparation for infiltration and fixation before tissue harvest",
    "1. Submerge a clean glass slide-staining box in DEPC-treated water overnight. The following day, remove all water from the box, close lid, wrap with aluminum foil, and autoclave. Cool to room temperature and store at 4°C until ready for use.\n2. Submerge Slimsette plastic biopsy cassettes with a recessed cover in DEPC-treated water overnight. The following day, remove excess water from cassettes, wrap each cassette individually with aluminum foil, and autoclave. Cool to room temperature and store at 4°C until ready for use.\n3. Submerge tissue forceps in DEPC-treated water overnight. The following day, remove forceps from the solution, wrap with aluminum foil, and autoclave. Cool to room temperature and store at 4°C until ready for use.\n4. Prepare a cooling plate for infiltration by storing overnight at −20°C.\nInfiltration and fixation of tissue\n5. Cover cooling plate from step 1 with aluminum foil, spray with RNase AWAY, and clean according to directions on the RNase AWAY bottle. Then, pour approximately 5 to 10 ml DEPC-treated water onto cooling plate.\nThis ensures an RNase-free, cool environment, and the water prevents the tissue from dehydrating.\n6. Label plastic biopsy cassette from step 2 with a No. 2 pencil.\n7. Collect clean plant tissue of choice from Medicago truncatula seedlings and place into cold DEPC-treated water on the RNase-free cooling plate. Align tissue as desired for sectioning (such as alignment of root tips from seedlings; Fig. 1A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.844#cpz1844-fig-0001]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/55f4c12e-8350-40a8-8053-db87f0e831ed/cpz1844-fig-0001-m.jpg</p>\nFigure 1",
    "Fixation of tissue. (A) Placing the tissue on the cooling plate for harvesting and alignment. (B) The aligned tissue in a biopsy cassette, still on the cooling plate. (C) The biopsy cassette containing tissue after being placed in the glass slide-staining box and covered with fixative. Note that the cassette is completely submerged, and that the apparatus sits on ice, where it will remain throughout infiltration.\n8. Cut portions of tissue intended for fixation (e.g., the maturation zones from each root) with a single-edge razor blade and place them in the labeled biopsy cassette (Fig. 1B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.844#cpz1844-fig-0001]). Immediately place the cassette in the cold fixative solution inside the slide-staining box, kept at 4°C by placing on ice (Fig. 1C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.844#cpz1844-fig-0001]), making sure that the cassette is completely immersed in the fixative solution. Keep slide-staining box on ice throughout infiltration to maintain the temperature at 4°C.\n9. Apply a 20-kPa vacuum. Quickly release and reapply vacuum every 10 min for a total of 30 min to force the solution into the tissue.\nThis protocol should be sufficient for soft tissue such as seedling roots, leaves, and floral organs. There must be sufficient room in the cassette for the fixative to freely enter the plant tissue; therefore, the amount per cassette will vary depending on the tissue. Woody tissue or hard tissue such as dry seed may require more vacuum applications. Properly infiltrated tissue tends to sink when it is ready for embedding (steps 18 to 23), but this characteristic can be difficult to determine at this point in the protocol; hence, preliminary experimentation is suggested for more challenging tissues.\n10. Prepare EtOH/polyester wax solution 2 to 4 hr prior to step 16 (Fig. 2A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.844#cpz1844-fig-0002]).",
    "The melted wax will appear cloudy. It should not be clear; clear wax is too hot and can damage the RNA.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/3f7301e1-a534-47fe-ac07-9183c6667640/cpz1844-fig-0002-m.jpg</p>\nFigure 2\nEmbedding of tissue. (A) Melted polyester wax. Note the cloudy color. (B) Cooling plate prepared for embedding. (C) Plastic drinking straw with ends sealed with Parafilm to make a “boat” for embedding. (D) Orienting the tissue inside the biopsy cassette in polyester wax at 37°C before removing gently to the boat. (E) The boat filled with wax on a biopsy cassette, placed on the cooling plate to harden. (F) Storage of the embedded tissue, wrapped in Parafilm and placed in a sealable plastic bag along with Drierite before being stored in a freezer.\n11. Replace fixative solution in the box with cold 100% methanol. Place the box in a cold room or refrigerator and incubate for 2 hr at 4°C.\nOccasional gentle rotation by hand may help this step, but we have not found it necessary for success with soft tissue.\n12. Pour off methanol, removing the last drops with an RNase-free pipet tip. Replace with cold 70% EtOH solution and incubate for 30 min at 4°C.\n13. Pour off 70% EtOH, removing the last drops with a pipet. Replace with cold 96% EtOH solution and incubate for 30 min at 4°C.\n14. Replace 96% EtOH with cold 100% EtOH and incubate for 30 min at 4°C. Repeat this step twice, for a total of three changes of EtOH.\nThe process can be paused after this step and the samples can be left in EtOH at 4°C for several days. This is useful if you are processing multiple samples in a time course, as they can then be embedded all at once.",
    "15. Replace 100% EtOH with the EtOH/polyester wax solution from step 10 and incubate overnight at 37°C.\nAfter the overnight wash, properly infiltrated tissue will sink. This can be difficult to see in a cassette, so preliminary experimentation is suggested for more challenging tissues.\n16. The following day, melt pure polyester wax at 37°C for 2 to 4 hr before replacing the EtOH/polyester wax solution in the box with the melted wax. Cover box with aluminum foil and store at 37°C for 2 hr. Repeat this step twice for a total of three changes of wax.\n17. Proceed immediately to embedding.\nEmbedding of tissue\n18. Melt polyester wax in an RNase-free beaker at 37°C 2 to 4 hr prior to embedding (Fig. 2A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.844#cpz1844-fig-0002]).\n19. Cover the −20°C cooling plate with aluminum foil and clean it with RNase AWAY but do not add DEPC-treated water.\nThis will serve as the cooling station during embedding of infiltrated root tissue (Fig. 2B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.844#cpz1844-fig-0002]).\n20. Using a razor blade and gloved hands, cut a plastic drinking straw to ∼4 cm in length and then cut it horizontally and wrap it with Parafilm to seal the ends of the straw, resulting in a boat-like structure (Fig. 2C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.844#cpz1844-fig-0002]). Place this boat on the −20°C cooling plate.\nThis allows embedding of root samples in a horizontal orientation, which aids in generating cross-sections for LCM. The boat can be designed differently for other tissues depending on their shape. Instead of using straw boats for embedding, commercially available base molds in a variety of sizes can be used. It is essential that these molds be made RNase free. RNase-free disposable polycarbonate molds are also commercially available.",
    "21. Heat the forceps from step 3 by placing them inside a 37°C incubator for 2 to 5 min. Remove the cassette from the wax (step 16) and open it inside the 37°C incubator, using the glass lid of the box as an RNase-free platform. Orient roots or other tissue in a single bundle using the RNase-free forceps (Fig. 2D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.844#cpz1844-fig-0002]).\nIf the forceps are not at 37°C, the tissue will stick to the forceps, and this will break the very fragile tissue. Care needs to be taken to handle everything gently during the entire embedding process.\n22. Pour a few drops of melted wax into the cut straw boat using a disposable transfer pipet and let the boat and wax cool for a few minutes by placing it on the −20°C cooling plate. Then, carefully place the bundle of roots in the boat, immediately pouring enough wax to cover the roots and fill the straw. Place the boat in the labeled cassette that originally contained the tissue on top of the −20°C cooling plate (Fig. 2E[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.844#cpz1844-fig-0002]). Allow embedded samples to solidify on the −20°C cooling plate for 2 to 4 hr.\nThe wax will harden into a plug that will keep the samples from directly touching the straw boat. If the samples are not prevented from touching the boat by pouring a wax plug first, they will stick to the straw and will be damaged during removal for sectioning.\n23. After the embedded samples are hardened, cover them with Parafilm, label them, and store them in an airtight container or sealable plastic bag at 4°C or −20°C until ready for sectioning (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.844#cpz1844-prot-0002]). Add Drierite to the container or bag to combat moisture and mold (Fig. 2F[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.844#cpz1844-fig-0002]).",
    "We initially reported that embedded samples can be stored at −20°C for 6 to 12 months without loss of RNA integrity, but over the course of several years of this protocol, our experience varied with storage longer than 6 months and we recommend no longer than 6 months. It is important not to repeatedly freeze and thaw the embedded samples. To remain stable, the samples must be dry and cold. The choice of cold temperature must be balanced with the need to minimize the condensation that may occur when a sample is removed from the cold for sectioning. It is advised to move a sample from long-term storage at −20°C to 4°C when processing for Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.844#cpz1844-prot-0002].",
    "Sectioning of tissue involves cutting embedded tissue into ribbons of sections and arranging the ribbons on polyethylene naphthalate (PEN) slides. Traditionally, during sectioning, the cut ribbons are floated in a warm-water bath and then loaded onto PEN membrane slides, which are then kept on a slide warmer at 32°C overnight (Gomez et al., 2009[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.844#cpz1844-bib-0016]). However, we have made modifications to the regular sectioning technique to maximize RNA recovery. The major change is loading the wax ribbons containing tissue directly onto pre-wetted PEN slides and then drying the slides for 2 to 5 min at 28°C. The lower temperature and reduced time used avoid exposure of the RNA to heat but still allow affixing of the polyester wax–embedded sections to the membranes while reducing the risk of RNA contamination and degradation posed by the water bath and overnight incubation of the slides at 32°C. The procedure still allows maximum coverage of the PEN slides by permitting loading of multiple ribbons onto a single slide.\nMaterials\nPolyester wax (e.g., Steedman's wax, Electron Microscopy Sciences, cat. no. 19312)\nRNase AWAY (Thermo Fisher Scientific)\nDEPC-treated water (see recipe)\nEmbedded root tissue (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.844#cpz1844-prot-0001])\nDrierite\n37°C incubator\nPEN membrane slides appropriate to LCM microscope (see Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.844#cpz1844-prot-0003]), either regular or RNase free\nNo. 2 pencil\nTissue forceps (4.5 in.)\nCamel hairbrush (size 2)\nMicroslide box(es)\nSterile hood with UV lamp (only required if PEN slides are not purchased RNase free)\nMicrotome and appropriate PTFE-coated high-profile microtome blades\nSlide warmer with lid and ability to hold 28°C\nSingle-edge razor blades, individually wrapped\nRNase-free plastic biopsy cassette with recessed cover (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.844#cpz1844-prot-0001], step 2)\nPreparation for sectioning and laser capture\n1. Melt polyester wax at 37°C 2 to 4 hr prior to sectioning.",
    "2. Label 5 PEN membrane slides with a No. 2 pencil. On the day of use, treat PEN slides, tissue forceps, a camel hair brush, and an open microslide box with UV light in a sterile hood for 30 min to reduce RNase contamination and then store everything in microslide box (Fig. 3A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.844#cpz1844-fig-0003]).\nNote that PEN slides have a membrane on one side; this side should face the UV light. If a sterile hood with a UV lamp is unavailable, based on prior work (Kleber & Kehr, 2006[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.844#cpz1844-bib-0021]), the PEN slides can be immersed in RNaseZap (Thermo Fisher Scientific) for 30 s and then washed thrice for 30 s each in autoclaved DEPC-treated water and dried at room temperature in an RNase-free space. However, do not immerse the slides for >30 s, as the adhesive membrane will start to dissolve, causing leaks in the membrane that prevent successful laser capture. It is also possible to purchase PEN slides that are already RNase free.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/d546da3e-f209-4b3b-90f5-aa9303b381fb/cpz1844-fig-0003-m.jpg</p>\nFigure 3\nPEN slide preparation. (A) Layout of materials for RNase treatment under UV light. (B) Brushing the PEN slide with DEPC-treated water before adhering ribbons. (C) Alternatively spraying the PEN slide lightly with DEPC-treated water before adhering ribbons.\n3. Clean the microtome and slide warmer with RNase AWAY. Wipe any surface that will come in contact with gloves, wax, slides, or tissue with RNase AWAY as well, focusing on the microtome's universal cassette clamp, hand rest, handwheel with a centering handle, standard specimen clamp, and knife holder for disposable blades. Set the slide warmer to 28°C.\nSectioning",
    "4. Pre-wet membranes on the PEN slides with approximately 10 to 12 µl DEPC-treated water using the camel hairbrush (Fig. 3B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.844#cpz1844-fig-0003]). Alternatively, if preferred, spray DEPC-treated water on the slides so that the water covers the entire slide and forms a uniform coating (Fig. 3C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.844#cpz1844-fig-0003]).\nExcess water on the membranes on the PEN slides will cause the ribbons to float too freely and thus result in poor adherence of the ribbons to the PEN slides.\n5. Using a single-edge razor blade, cut ∼1 cm off the block of embedded root tissue, remove the Parafilm and plastic straw coating from the embedded sample, and affix the sample in the center of an RNase-free plastic biopsy cassette with a recessed cover using melted polyester wax from step 1 (Fig. 4A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.844#cpz1844-fig-0004]). Place a new PTFE-coated high-profile microtome blade on the microtome.\nDo not use glass microtome blades.\nMake sure to use the blade from one end to the other; this allows sharp cuts and the production of long ribbons while making efficient use of the blade. The microtome blade should be replaced prior to every cutting session to reduce contamination. Moreover, given that polyester wax sticks to the blade slightly, do not reuse the blade. Note that PTFE-coated high-profile microtome blades are not as expensive as glass microtome blades.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/4c25db40-5ecb-49d9-9abf-029eaa656fc1/cpz1844-fig-0004-m.jpg</p>\nFigure 4",
    "Sectioning of tissue. (A) Affixing embedded tissue to a biopsy cassette with Steedman's wax. (B) Manipulating ribbons of sections with forceps. Note that the surface was treated with RNase AWAY before sectioning. (C) Ribbons drying on a slide warmer for a few minutes. Note that these are practice sections; it is possible to obtain two to three straight ribbons the length of a slide for maximum efficiency and cost savings. (D) Storage of sections. Sections should be stored at 4°C for ≤1 month.\n6. Place the cassette on the microtome and begin sectioning the embedded sample at the desired thickness, using the RNase-free forceps to manipulate the ribbons as they are cut (Fig. 4B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.844#cpz1844-fig-0004]). Load the cut ribbons containing tissue sections onto the wetted PEN slides (step 4) using forceps and/or the brush.\nMultiple ribbons can be placed on a single slide.\nThe thickness chosen will depend on the tissue being sectioned. For example, Medicago truncatula root ribbons can be cut at thicknesses between 8 and 12 µm when using polyester wax. Thicker samples allow for capturing more tissue in a single laser cut, but if the sections are too thick, a thickness of more than one cell may be captured, which might be an issue depending on the tissue. Thicker sections may also generate issues with removing ribbons from the microtome and with performing clean laser cuts using the microscope.\nExperimentation with a variety of thicknesses is highly recommended before undertaking a large experiment.\nThe temperature and humidity in the room used for sectioning can affect the quality of the ribbons; in humid climates, especially during summer, the polyester wax can soften if the room is not adequately air conditioned.",
    "7. Once a slide is covered with ribbons, place it on the slide warmer for approximately 3 to 5 min or until the slide is dry (Fig. 4C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.844#cpz1844-fig-0004]).\nThis allows the water to evaporate and the ribbons to attach to the PEN membrane. Ribbons are affixed when they are dry. The time for which the slides need to be on the slide warmer will depend on the thickness of your sections, with less time required for thin sections. Do not keep slides on the slide warmer for longer than 5 to 10 min to minimize exposure of the RNA to high temperatures. Extended time on the warmer will also cause the polyester wax to melt, preventing laser capture.\n8. Once the ribbons have adhered to the PEN slides, place the slides in the microslide box along with Drierite and store at −20°C (Fig. 4D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.844#cpz1844-fig-0004]).\nSlides with sections in polyester wax can be stored for ≤1 week at this temperature without significant loss of RNA.",
    "After sectioning, the PEN slides are de-waxed for LCM. Paraffin-embedded samples are treated with xylene prior to LCM to remove the paraffin, which allows the laser to cut cells of interest. However, there are reports of paraffin embedding and xylene causing significant RNA damage (Evers et al., 2011[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.844#cpz1844-bib-0010]). Employing polyester wax instead allows the use of 100% EtOH to remove the wax and perform LCM. After LCM, RNA can be extracted from the harvested cells using commercially available kits specific to LCM tissue.\nMaterials\nPEN slides carrying sectioned root tissue (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.844#cpz1844-prot-0002])\n100% EtOH (anhydrous, molecular biology grade)\nRNase AWAY (Thermo Fisher Scientific)\nDistilled water\nAmbion RNAqueous-Micro Kit (Life Technologies, cat. no. AM1931)\n               \n50 micro filter cartridge assembly\n50 micro elution tubes\n15-ml wash solution 1 concentrate\n28-ml wash solution 2/3 concentrate\n25 lysis solution\n200-μl LCM additive\n55-μl DNase 2U/μl\n600-μl 10X DNase I buffer\n150-μl DNase inactivation reagent\n5-ml elution solution\nRNase-free petri dish\nRNase-free microscope slide box\nSealable plastic food container\nLCM microscope (e.g., Leica LMD6500 microscope)\n0.2-ml thin-walled 8-tube strip with domed caps (handled to keep RNase free)\nPermanent marker\nRNase-free pipet tips (filter tips recommended)\nStandard tabletop centrifuge with tube-strip adaptor\nDe-waxing prior to LCM\n1. Remove a PEN slide carrying sectioned root tissue from −20°C. Place slide in ∼10 ml of 100% EtOH in an RNase-free petri dish) and gently swirl for ≤3 min to dissolve the wax on the slide (Fig. 5A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.844#cpz1844-fig-0005]), removing the slide as soon as it is clear of wax (Fig. 5B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.844#cpz1844-fig-0005]).\nA rocking platform shaker may be used for swirling.",
    "The procedure can be repeated with new EtOH if the wax is not removed completely in the first 3 min, and again, the slide should be removed as soon as it is clear of wax. Do not leave the slide in EtOH for >6 min, as EtOH will seep between the PEN membrane and the glass slide, interfering with tissue capture during LCM.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/3dc30fff-d2df-41b9-b1c4-d0ee5ce70048/cpz1844-fig-0005-m.jpg</p>\nFigure 5\nDe-waxing slides. (A) Swirling a slide slowly in a small petri dish of EtOH. (B) De-waxed slide. In this picture, five sections containing multiple root cross-sections are visible as clusters of dots.\n2. Evaporate any excess EtOH from the PEN slide at room temperature in an RNase-free space. Use the PEN slide immediately for LCM or store it in an RNase-free microscope slide box inside an airtight container (a sealable plastic food container) for ≤5 days at room temperature.\nBecause de-waxed slides can only be used within 5 days, process only the number of slides that will be used for LCM in this period to avoid RNA degradation. We recommend processing 2 to 4 slides at a time due to the stability-related time limits for laser-captured RNA buffer (see step 6 annotation).\nLCM\n3. Clean the LCM microscope and adjacent workspace with RNase AWAY, including the universal collector for 8-tube strip caps, the holder for slides, the motorized stage of the microscope, and any other parts of the microscope that will come in contact with the slides or tissue.\nThis and the following steps will depend on the type and manufacturer of the LCM microscope used. However, the concepts presented here can be adapted to any commercially available system with some adjustments, and we encourage consultation with customer technical support for a given microscope.",
    "4. Label a 0.2-ml thin-walled 8-tube strip with domed caps with a permanent marker and load it onto the tissue collector of the microscope. Using an RNase-free pipet tip, load 1 cap with 40 µl distilled water (Fig. 6A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.844#cpz1844-fig-0006]). Following the microscope manufacturer's instructions, calibrate the collector tube to make sure that cut samples fall inside the tube cap.\nThis water-containing tube cap used for calibrating the microscope is also used for collecting tissue that is cut but not captured (i.e., it is the trash tube).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/5d04b764-949b-4617-a1e6-6b3e3cd0819b/cpz1844-fig-0006-m.jpg</p>\nFigure 6\nCutting of tissue. (A) Loading of a single cap with distilled water for calibration of the microscope. This will become the “trash” receptacle. (B) Placing tubes onto caps before spinning down the material.\n5. Load a PEN slide onto the microscope and calibrate the laser beam on a blank section of the slide before cutting tissue. In the case of a Leica microscope, adjust for power, magnification, aperture, speed, specimen balance, and light intensity to ensure sharp cuts and rapid descent of the sample into the collector tube cap. Once you have determined the settings to be used, record them for future work. Then, load 40 µl lysis solution from the Ambion RNAqueous-Micro Kit in each collector tube cap.\nFor example, on a Leica LMD6500 LCM microscope with a lens objective of 40×, a power of 36, an aperture of 19, a speed of 32, a specimen balance of 16, and a light intensity of 76, we can cut outer cortical cells from Medicago truncatula root cross-sections (12 µm thickness). Adjustments of the microscope will vary with the type of tissue being cut and the type of microscope being used. Preliminary experiments will be required to determine the best calibration of the microscope.",
    "6. Begin cutting desired tissue from the PEN slide into the caps. When all tissue on the slide has been cut or 100 to 120 min have passed (whichever comes first), remove the tube holder and place 0.2-ml thin-walled 8-strip tubes on the caps (Fig. 6B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.844#cpz1844-fig-0006]). Fix caps tightly on the tubes and centrifuge for 30 s at 5724 × g to force the lysis solution containing the cut tissue to fall into the tube. Immediately label tubes and store them at −80°C until RNA extraction (see Basic Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.844#cpz1844-prot-0004]).\nThe lysis solution will crystallize within 2 hr, so it is essential to pause tissue collection every 100 to 120 min.\nThe RNA should be stable in the lysis solution at −80°C for ≤1 month. Multiple tubes containing laser-captured tissue can be collected and combined at extraction. If the LCM microscope records the area cut for each tube, retain this information after each capture session to determine how many tubes to combine in the next step based on RNA yield. If material remains on the PEN slide that still needs to be cut, the slide can be stored in an airtight microslide box at room temperature and reused, but only within 5 days of de-waxing; after this, the RNA begins to degrade.",
    "Typically, RNA yields will be ultra-low (picogram amounts) and will require the use of high-sensitivity, low-abundance assays. The purity of nucleic acids can be determined by UV spectroscopy using a NanoDrop 8000 (Thermo Fisher Scientific). Purity is considered acceptable when both the 260/280 and the 260/230 values are >2.0. RNA integrity can be determined using an Agilent 2100 Bioanalyzer system along with the Agilent RNA 6000 Pico assay. RNA quantity is best determined with a dsRNA dye-binding assay to avoid quantification of trace amounts of residual DNA. The preferred technique is to use a Qubit fluorometer and a high-sensitivity assay kit (Qubit® RNA HS Assay Kit, Thermo Fisher Scientific, cat. no. Q32852). If the RNA integrity number (RIN) is above 6 but the quantity is too low for downstream library preparation, the original RNA can be stored at −80°C until you have amassed sufficient quantity and quality for your application, and all the RNA can then be combined during library preparation. There is some debate about how long low-concentration samples can be stored, but ≤6 months is recommended. Olivieri et al. (2014[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.844#cpz1844-bib-0028]) reported storing a 25-ng/µl human RNA sample at −80°C for 8 months without loss.",
    "The quantity and quality of RNA required for library preparation for RNASeq will vary depending on the processing methodology used to generate the library. RINs are an unambiguous assessment of RNA integrity, and RIN values between 6 and 10 (as determined on a bioanalyzer) are appropriate for most RNASeq applications; however, if the quantity is low, higher quality (RIN ≥8.0) is better. It is important to note here that if RNAs with RIN values <8.0 are used, the results can be significantly impacted by 3′ biases because of general 5′ degradation of the transcripts. Caution should thus be taken regarding splice-form and isoform analyses, and this issue should also be considered prior to expression profiling analyses.",
    "Using the TruSeq Stranded mRNA Library Prep Kit (Illumina, cat. no. RS-122-2103), the manufacturer's suggested minimum total amount of RNA to generate a library with sufficient complexity to include rare transcriptional events (∼25 M read pairs) without amplification is 100 ng. In our experience, libraries can be successfully generated with as little as 25 ng RNA, and analysis of libraries generated from even lower amounts of input RNA (Schuierer et al., 2017[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.844#cpz1844-bib-0035]) suggest that 10 ng of high-quality RNA is sufficient to produce high-quality results. For situations where inputs are <50 ng, ribosomal depletion can be used, or RNA can be amplified to generate cDNA in sufficient amounts for sequencing using the SMART-Seq v4 Ultra Low Input RNA Kit (Clontech, cat. no. 634888); the lower limit of input suggested by the manufacturer is 60 pg. Thus, amplification of RNA can be used to produce a sequencing library from lower-abundance samples but requires an RIN value in the range of 7 to 10. To compare libraries, the same protocol must be used for all libraries, and yield varies by tissue; in our case, one tissue drove the need to amplify all libraries.\nIrrespective of whether the RNA is amplified before library construction or used directly, commercial spike-in standards should be used to enable an objective, quantitative assessment of the sequencing results, including determining amplification biases, if appropriate. The exogenous spike-ins used in our experimentation are the Ambion ERCC RNA Spike-In Control Mixes (Life Technologies, cat. no. 4456740 and 4456739) (Devonshire et al., 2010[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.844#cpz1844-bib-0007]; Jiang et al., 2011[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.844#cpz1844-bib-0019]; Reid, 2005[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.844#cpz1844-bib-0030]).\nMaterials\nRNA collector tubes containing LCM sample, stored at −80°C (see Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.844#cpz1844-prot-0003], step 4)\nAmbion RNAqueous-Micro Kit (Life Technologies, cat. no. AM1931)\n               \n50 micro filter cartridge assembly\n50 micro elution tubes\n15-ml wash solution 1 concentrate",
    "28-ml wash solution 2/3 concentrate\n25 lysis solution\n200-μl LCM additive\n55-μl DNase 2U/μl\n600-μl 10X DNase I buffer\n150-μl DNase inactivation reagent\n5-ml elution solution\n1. Remove a collector tube kept at −80°C and let it thaw on ice.\nThe contents of multiple tubes containing the same tissue type can be pooled to increase the amount of starting tissue for RNA extraction. The area of tissue used to create an RNA library depends on the thickness of the sections, tissue type, and library preparation kit used, including whether the kit protocol includes amplification of the library. See Anticipated Results for some examples and kit instructions for further information.\n2. Perform RNA extraction using the RNAqueous-Micro Kit according to the manufacturer's instructions.\nThis kit is suited to RNA isolation from microscale and LCM samples.\n3. Remove a 5-µl aliquot of the extracted RNA for quantification and integrity analysis and store it and the remaining extracted RNA at −80°C until RNASeq library preparation.\nRemoving an aliquot at this time for quality control limits excessive freezing and thawing of the sample, which would cause degradation of the RNA."
  ],
  "subjectAreas": [
    "Plant Biology"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}