{
  "id": 9830,
  "origin_website": "Jove",
  "title": "Gene Delivery to Postnatal Rat Brain by Non-ventricular Plasmid Injection and Electroporation",
  "procedures": [
    "1. Introduction\nCreation of transgenic animals is a powerful method of investigation of gene functions in living animals1 and for unraveling disease mechanism2,3 as well as for manipulating properties of cells4. However, the procedure is rather laborious, extremely time consuming and expensive, thus warranting the use of alternative gene delivery methods such as viral injection5, neonatal ventricular injection with electroporation6 and in utero electroporation7,8. The method of postnatal non-ventricular injection and electroporation has a unique set of advantages: use of non-viral genetic constructs; possibility to create a local expression pattern in the area of interest; in situ transfection of non-migratory cell types, e.g. cortical astrocytes.\nIn this video, we demonstrate the detailed procedure of postnatal gene delivery to the neonatal rat brain using a plasmid encoding for the enhanced green fluorescent protein under chicken beta actin promoter with CMV enhancer (pCAG-EGFP)9. We illustrate the preparation of the plasmid-containing injection solution, manufacturing of thin glass pipettes and assembling of the microinjector on a stereotactic instrument. Then we talk about anaesthetizing rat pups with isoflurane, about performing the surgery, about the injection procedure and about the electroporation using forceps electrodes and the in vivo porator. Finally, we briefly discuss the anticipated results, perspectives and difficulties that may arise during these experiments.\n2. Plasmid Preparation for Electroporation\nWe usually prepare 10 μl of the plasmid injection solution in a 200 μl thin wall tube. This solution is sufficient for several experiments.\nWe mix 8 μl of the plasmid solution (see Materials and equipment) with 1 μl of the 10X  PBS (see Materials and equipment) and 1 μl of 0,1% Fast Green water solution (see Materials and equipment).",
    "The final concentration of the plasmid in the injection solution should be between 1 and 3 μg/μl. Lower concentrations of plasmid DNA will reduce the transfection efficiency, while the higher DNA concentration will be too viscous for injection through the thin tip of the glass capillary.\n3. Glass Needle Preparation\nFor the glass pipette preparation, we use borosilicate glass capillary with a filament (see Materials and equipment) and a vertical electrode glass puller (see Materials and equipment) on maximum pulling and heating parameters.\nWe then break the tip of the pipette using a piece of paper to achieve a tip 10-20 μm in diameter.\nWe check the tip diameter and shape under the microscope objective.\n4. Microinjector Assembling\nUsing a thin polymer capillary (see Materials and equipment) we fill approximately 1/3 of the volume of a 10 μl Hamilton syringe (see Materials and equipment) with mineral oil (see Materials and equipment). Avoid air bubbles!\nThen we fill the glass pipette with mineral oil and insert the pipette into the Hamilton syringe. Avoid air bubbles!\nThe syringe with glass pipette is then fixed on the microinjector connected to a controller (see Materials and equipment).\nThe microinjection setup fixed on a stereotactic instrument (see Materials and equipment) allows us to safely immerse the tip of the glass pipette into the tube with the plasmid injection solution.\nWhen the tip touches the surface of the solution, dip it further by 1 or 2 mm and fill the pipette with approximately 1 μl of the injection mix using the micro injector controller.\n5. Anaesthetizing animal\nAll the procedures presented here were performed according to the University of Helsinki regulations for animal experiments.\nFor each experiment, we fill a gas-tight syringe (see Materials and equipment) with approximately 2 ml of isoflurane (see Materials and equipment).",
    "Than the syringe is fixed on the anesthesia unit (see Materials and equipment) connected to the air flow source, the animal box and the mask fixed on stereotactic setup.\nOn the anesthesia unit, we adjust the airflow to approximately 250 ml/min and the isoflurane level to 4 %.\nWe place the rat pup into the animal box for 2-5 minutes.\nWhen the pup stops moving, place it on the heating pad (see Materials and equipment) attached to the stereotactic setup.\nPlace a rostral part of pup's head into the anaesthetizing mask.\nIt takes 5 to 10 minutes for the pup to enter the deep anesthesia.\nCheck anesthesia deepness with a tail pinch and decrease the isoflurane inflow to about 1.5 to 2.0 %.\n6. Surgery, Microinjection and Electroporation\nTreat the skin on the pup's head with the 70% ethanol.\nUsing small scissors (see Materials and equipment) and thin forceps (see Materials and equipment), cut the skin from a scruff of the pup to its forehead.\nBend skin pieces sideways and pull ear bars slightly into aural orifices of the skull for head and skin fixation.\nUsing a binocular microscope, we locate the bregma point on the skull.\nIdentify the region of interest using the stereotactic coordinates.\nPosition the injection pipette above this region and mark it by dropping 25-50 nl of the injection solution onto the skull surface.\nDrill the skull gently and carefully at the marked point using a high speed surgical drill (see Materials and equipment) under the microscope until liquid appears in the drilled area.\nFix an electropotation forceps electrodes (see Materials and equipment) on the sides of the skull with current conductive gel (see Materials and equipment) to achieve better conductivity.",
    "Remove the liquid drop from the drilled hole using small tampon (see Materials and equipment) and dip the glass needle to the hole according to the coordinates of the injection site.\nInfuse 25 to 100 nl of the injection solution at the rate of 5 to 20 nl/sec.\nQuickly remove the pipette and electroporate immediately. Electroporation is done by applying five rectangle pulses with the duration of 50 ms and amplitude of 99 V at the frequency of 1 Hz.\nRemove electrodes and ear bars.\nSew the cut skin using a combination of a dumb (see Materials and equipment) and sharp forceps and surgical threads (see Materials and equipment).\nPlace the pup into the warm chamber for 15-30 minutes to aid its recovery after anaesthesia.\nThen put the pup back to its mother's cage.\n7. Representative Results\nThe expression of the transgene in the successfully transfected cells will appear approximately 10 hours after the electroporation, and it will remain stable for several weeks.\nWe microinjected the plasmid either into deep cortical layers or striatum region of postnatal day 2 (P2) Wistar rat pups and performed in vivo electroporation as described above. Brain slices (400 μm in thickness) were cut after 2 to 6 days (P4-P8) using a vibrotome in cold slicing medium (Hepes buffered Earle's Balanced Salt Solution)10. Image acquisition was performed using Zeiss Axioplan 2 LSM5 Pascal confocal microscope (Zeiss, Germany) in the slicing medium at room temperature.",
    "The injection sites in deep cortical layers and striatum contained many transfected cells expressing EGFP that were located in a compact region of approximately 200-300 μm in diameter (Figure 1A, B). Within transfected cells, the EGFP expression level is sufficiently high to allow imaging of thin cellular processes (Figure 1C) including dendrites with spines of different shapes (Figure 1D) and axon bundles (Figure 1E). The robust stability of EGFP as well as cell viability after electroporation allowed tracing distal parts of axons (up to 1.5-2 mm from cell bodies) such as cortical terminals (Figure 1F).\nimgsrc://cloudfront.jove.com/files/ftp_upload/2244/2244fig1.jpgFigure 1. (A) Successfully transfected cells in the striatum region of P4 rat brain delineating the plasmid injection site. (B) Transfected cells in deep cortical layers (approximately 1000 μm below cortical surface) of P5 rat brain. (C) A transfected cell in the striatum region of P8 rat brain. (D) Dendritic processes of a transfected cell in the striatum region of P8 rat brain; arrows indicate different types of dendritic spines and filopodia. (E) Axons of transfected cells within collateral pathway. (F) Axons terminating at the pial surface of P8 rat cortex (arrowhead). Scale bars are 100 μm on A, B, E and F; 10 μm on C and D.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}