{
  "id": 3817,
  "origin_website": "Cell",
  "title": "Protocol for measurement of calcium dysregulation in human induced pluripotent stem cell-derived dopaminergic neurons",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nCalcium imaging\nTiming: 2–3 h\nPrepare HEPES-buffered ACSF.\nRefer to materials and equipment[href=https://www.wicell.org#materials-and-equipment] for buffer recipe.\nDissolve 1 mM stock solution of Fluo-4-AM with neurobasal medium to a final concentration of 2 μM (1:500 dilution).\nCritical: This Fluo-4-AM working solution is prepared freshly in the hood and protected from light.\nLoad 1 mL of Fluo-4-AM working solution (2 μM) to human DA neurons (at differentiation day 68–75) plated on cover glasses.\nIncubate neurons in a 37°C, 5% CO2 incubator for 30 min.\nRemove Fluo-4-AM working solution from neurons, and wash neurons three times with HEPES-buffered ACSF.\nIncubate neurons at 22°C–25°C in the dark for additional 20–25 min to allow for complete dye de-esterification.\nPlace neurons in a 30°C–32°C heated adaptor, and live-cell imaging is performed by inverted confocal microscope LSM880 with a 40×/1.35NA oil-immersion objective.\nCritical: Perfuse imaging chamber with warm HEPES-buffered ACSF solution (30°C–32°C). High temperature (>40°C) or low temperature (<22°C) could affect the intracellular calcium level. Cells exposed to temperature range 28°C–40°C essentially maintain stable intracellular calcium level. Basically, temperature at 28°C–37°C is recommended for calcium imaging based on researcher’s own choice. In our study, we keep neurons at 30°C–32°C to avoid the temperature effect on intracellular calcium and also to maintain physiological activities of neurons.\nCritical: Keep ACSF perfusion at a low rate of 1 mL/min.\nLive-cell imaging is conducted with excitation wavelength of 485 nm and emission wavelength of 525 nm. Images are taken every second during the time of experiment.\nCritical: The frequency of acquisition we use is 1.0 Hz. Depending on the exposure time, latency between images can be from 1 to 5 s. More than 5 s is not recommended because fast calcium transitions can be missed.",
    "Critical: For good results, finish live-cell imaging within 2 h after transferring neurons to the microscope. Neurons after calcium imaging are not recommended for further culture.\nRecord basal activity for at least 5 min before applying stimuli.\nUsing Zen software to generate the profile of fluorescence intensity for each cell over time (Figure 2[href=https://www.wicell.org#fig2] and Methods video S1[href=https://www.wicell.org#mmc1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/539-Fig2.jpg\nFigure 2. Calcium imaging of human DA neurons\n(A) LSM880 setup for calcium imaging.\n(B) Human iPSCs-derived DA neurons loaded with Fluo-4-AM. Scale bar, 50 μm.\n(C) Recording of somatic calcium level in two neurons (as marked in B) during spontaneous activity.\n(D) Changes in intracellular calcium in response to KCl (10 mM) in human DA neurons loaded with Fluo-4-AM. Scale bar, 50 μm.\n(E) Changes of fluorescent intensity in human DA neurons induced by KCl (10 mM).\nOpen acquired image sequence in Zen software.\nSelect regions of interest (ROI) by drawing the outline of cell soma. When defining ROIs, it is useful to play the movie to verify that the cells do not move during the course of experiment.\nMeasure fluorescence intensity values for each time point.\nTransfer data to other statistical program (e.g., GraphPad Prism) for further analysis.\n    Your browser does not support HTML5 video.\n  \nMethods video S1. Dynamic changes in intracellular calcium in human DA neurons\nCalcium sparks represent neurons during spontaneous activity related to calcium imaging step 9\nCa2+ current recording\nTiming: 3–4 h\nPrepare external solution on the day of experiment.\nRefer to materials and equipment[href=https://www.wicell.org#materials-and-equipment] for buffer recipe.\nTake intracellular solution out from −80°C and thaw the solution on ice.\nCritical: Keep the intracellular solution on ice throughout the recording.\nPrepare patch-clamp pipettes (3–5 MΩ).\nRefer to materials and equipment[href=https://www.wicell.org#materials-and-equipment] for more information.",
    "Turn on all the equipment and set the pump to perfuse external solution through the recording chamber.\nCritical: The external solution is continuously bubbled with 95% O2 and 5% CO2.\nCritical: The speed of external solution should be kept at 1–2 mL/min. A perfusion speed over 2 mL/min might lead to movements of the recording pipette and lifting of the cells from the coverslip.\nCritical: Temperature controller and in-line solution heater are used to keep external solution at 32°C during the recording.\nTransfer the coverslip with human DA neurons to the recording chamber with the cells facing up.\nFill a 1 mL syringe with 200 μL of intracellular solution, connect a 0.2 μm pore filter to the syringe and attach a micro-loader tip to the filter. Use the syringe linked to the filter and micro-loader tip to fill the patch-clamp pipette with intracellular solution.\nCritical: Tap the pipette a few times to eliminate any air bubbles that might present in the tip.\nPlace the pipette in the pipette holder. Put the pipette tip in the bath.\nOnce the pipette is in the bath, apply a very light positive pressure and hold the pressure in the pipette by using a three-way valve.\nSearch and focus on a healthy neuron with 40× water immersion objective.\nSet the amplifier to voltage-clamp mode and correct the pipette offset so the currents measured at that point are considered as 0 pA.\nMove the patch-clamp pipette by multi-micromanipulator to carefully approach the selected soma. Once the pipette tip touches the cell, a very small dimple is seen in the cell’s membrane.\nRelease the positive pressure and apply a gentle suction to achieve gigaseal formation.",
    "Once a gigaseal is obtained, change the voltage clamp to a negative voltage close to the expected resting membrane potential (−60 mV or −70 mV).\nRupture the membrane by applying light and short suction pulses using a syringe (or by using the “zap” function on the amplifier).\nHold the cell at −60 mV in voltage-clamp configuration. Record Ca2+ currents by stepping to various potentials from −60 mV to +50 mV for 250 ms in 10 mV increments.\nData are acquired by PatchMaster software, sampled at 10 kHz, and filtered at 2.9 kHz.\nOnce the recording is done, slowly and carefully detach the pipette from the neuron to let the membrane reseal.\nNote: Recorded neurons are labeled with fluorescent dye and the cell type will be further validated by immunostaining.\nCa2+ currents are analyzed using Clampfit 10.5 software (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/539-Fig3.jpg\nFigure 3. Calcium current recording of human DA neurons\n(A) Whole-cell patch-clamp setup for Ca2+ current recording.\n(B) Electrophysiological characteristics of hiPSCs-derived DA neurons. Rp, pipette resistance; Rin, input resistance; Rseries, series resistance which is typically 10–30 MΩ; Leak, leak current during recording, RMP, resting membrane potential.\n(C) Representative whole-cell Ca2+ current traces.\n(D) Ca2+ current density-voltage relationships. Data are presented as mean ± SEM."
  ],
  "subjectAreas": [
    "Cell Differentiation",
    "Microscopy",
    "Neuroscience",
    "Stem Cells"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}