{
  "id": 5531,
  "origin_website": "Bio",
  "title": "Nucleosome Positioning Assay",
  "procedures": [
    "Purification of mononucleosomal DNA from cellsFix NIH/3T3 cells on a 10 cm-dish (80% confluency) by adding 270 μl of 37% formaldehyde solution to 10 ml culture medium (1% formaldehyde final) for 10 min at room temperature. Quench excessive formaldehyde by adding 1/20 volume of 2.5 M glycine solution (125 mM glycine final) for 5 min. After two washes with PBS, permeabilize cells at 37 °C for 1 min in permeabilization buffer on the culture dish.Remove the permeabilization buffer and directly incubate cells in MNase digestion buffer for 20 min at room temperature. Inactivate MNase by adding EDTA and EGTA to a final concentration of 10 mM each. Discard the solution and harvest cells in PBS by scraping and transfer them to a microcentrifuge tube.To revert formaldehyde-mediated crosslinking by heating, incubate cells in PBS containing 300 mM NaCl at 65 °C for 6 h. Mix DNA solution with the same volume of phenol:chloroform:isoamyl solution and spin in a standard microcentrifuge (13,523 x g, room temperature) for 5 min. Transfer the upper aqueous phase into a fresh tube and repeat extraction. Add 1/10 volume of 3 M sodium acetate (pH 5.2) and 2.5 volumes of ethanol to the DNA solution and precipitate DNA at -20 °C for 30 min. Spin down the precipitate in a standard microcentrifuge (13,523 x g, 4 °C) for 15 min, carefully remove supernatant, and wash once with 70% ethanol. Air dry the pellet and dissolve in 50 μl TE buffer.To isolate mononucleosome-sized fragments, separate DNA on 2% agarose gels. Excise the ~150 bp band from the gel and purify DNA with a QIAquick Gel Extraction Kit according to manufacturer’s instruction. Elute in 30-50 μl elution buffer. Measure DNA concentration on a NanoDrop 2000 spectrophotometer and store at -20 °C.",
    "The yield of mononucleosomal DNA from a 10 cm-dish of NIH/3T3 cells is between 4-8 μg.Ligation of linkers to mononucleosomal DNATo generate blunted and phosphorylated DNA ends, set up the reaction as described below using the Quick Blunting Kit. Incubate at room temperature for 30 min followed by enzyme inactivation at 70 °C for 10 min.table:",
    "﻿0,1\n10x blunting buffer,2.5 μl\n1 mM dNTP,2.5 μl\nEnzyme mix,0.5 μl\nDNA,2.0 μg\nH2O,to 25 μl\nDilute linkers S and L in TE buffer at a final concentration of 20 µM each (mass concentration of ~0.3 µg/µl). Anneal S and L by the following program on a PCR machine:95 °C, 15 min65 °C, 15 min (slope 0.01 °C/sec)55 °C, 15 min (slope 0.01 °C/sec)45 °C, 15 min (slope 0.01 °C/sec)37 °C, 15 min (slope 0.01 °C/sec)25 °C, 15 min (slope 0.01 °C/sec)4 °C, 5 minTo ligate double-stranded linker L+S (from step B2) to mononucleosomal DNA (from step B1) set up the reaction as described below, and incubate the reaction at 16 °C overnight. Inactivate the enzyme at 65 °C for 20 min, purify the DNA with the QIAquick PCR Purification Kit and elute in 20 µl TE buffer.table:\n﻿0,1\n10x ligation buffer,2 μl\n100 mM ATP,1 μl\nT4 DNA ligase,1 μl\nDNA (from step B1),1 μg\nLinker L+S (from step B2),1 μg\nH2Oto,20 μl\nLM-PCRLabel the PCR primer specific for the nucleosomal region of interest radioactively by setting up the reaction below and incubating for 1 h at 37 °C. After inactivating PNK at 65 °C for 20 min purify the primer with the QIAquick Nucleotide Removal Kit and elute in 20 µl TE buffer.table:\n﻿0,1\n10x PNK buffer,2 μl\nPNK,3 μl\n[γ-32P]-ATP (3.3 µM),9 μl\nPrimer (20 μM),1 μl\nH2O,8 μl\nSet up LM-PCR reaction containing linker-ligated mononucleosomal DNA (from step B3), linker primer L and the 32P-labeled specific primer (from step C1) as follows:table:\n﻿0,1\nGoTaq PCR Master Mix,7.5 μl\nDNA (from step B3),2 μl\nLinker L (10 μM),0.5 μl\n32P-primer (from step C1),2 μl\nDMSO,0.5 μl\nH2O,2.5 μl",
    "Run the following ‘Touchdown’-PCR program:Denaturation 94 °C 5 min94 °C 30 sec, 65 °C 30 sec, 72 °C 30 sec; x 3 cycles94 °C 30 sec, 64 °C 30 sec, 72 °C 30 sec; x 3 cycles94 °C 30 sec, 63 °C 30 sec, 72 °C 30 sec; x 3 cycles94 °C 30 sec, 62 °C 30 sec, 72 °C 30 sec; x 3 cycles94 °C 30 sec, 61 °C 30 sec, 72 °C 30 sec; x 3 cycles94 °C 30 sec, 60 °C 30 sec, 72 °C 30 sec; x 15 cyclesComplete extension 72 °C 10 minGel electrophoresisPrepare 6% denaturing urea-polyacrylamide gel (see Recipes).Assemble electrophoresis and pre-run the gel in 1x TBE for 30 min at 250 V. The pre-run allows equilibration of the gel/buffer system and heats up the gel to the operating temperature of 45-55 °C.After the pre-run, rinse gel pockets by flushing with fresh buffer using a syringe. Add an equal volume of formamide loading buffer to the LM-PCR reaction (from step C3) and incubate for 5 min at 95 °C, then quickly chill on ice. This step should be carried out during the pre-run of the gel so that the LM-PCR/loading buffer mix is on ice while rinsing the gel pockets. Thereby the time between pre-run and sample loading is minimized to avoid cooling down of the gel.Load 5 µl of the LM-PCR/loading buffer mix. Restart the electrophoresis and run for 1.5-2 h. Disassemble the gel set-up, put the gel on a Whatman paper and cover the opposite gel side with plastic wrap. It does not matter which side of the gel faces down. However, it is helpful to clip off one upper corner of the gel to locate its position after drying. Dry the gel at 80 °C for 1-2 h under vacuum.",
    "Expose gel to phosphor imaging plate overnight.Scan screen with phosphor imaging instrument and quantify bands representing different nucleosomal positions with appropriate software (e.g., AIDA Image Analyzer)."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}