{
  "id": 5635,
  "origin_website": "Bio",
  "title": "Vaginal HSV-2 Infection and Tissue Analysis",
  "procedures": [
    "Vaginal infectionMice are pretreated by subcutaneous injection of 200 µl (2 mg/mice, diluted in PBS) of Depo-Provera. Five days later mice are anesthetized with isoflourane and carefully inoculated with a pipette intra vaginally with 20 μl HSV-2 (6.7 x 104 PFU) suspended in PBS, see Figure 1. It is important not to destroy or damage the vaginal epithelial layer during inoculation as this can interfere with the natural infection.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170630/20170630003729_6666.jpegFigure 1. Inoculation of virus intravaginally with a pipetteSubsequently, the mice are placed on their back and maintained under anesthesia for 10 min. Vaginal washes/fluids can be collected at desired time points post infection by pipetting a volume of 40 µl PBS in and out of the vagina 12-15 times, repeated twice, and diluted to a final volume of 250 μl also in PBS. For harvest of vaginas, mice are euthanized by cervical dislocation (c.d.) and vaginas are removed surgically and used for RNA extraction, flow analysis or immunohistochemistry. The genitally infected animals should be observed and examined daily and scored for vaginal inflammation, neurological illness, weight loss and death. The severity of disease is scored using the following criteria: 0, healthy; 1, genital erythema; 2, moderate genital inflammation; 3, purulent genital lesion/or generally bad conditions; 4, hind limb paralysis or general very poor conditions. Mice must be sacrificed by c.d. when reaching score 4 according to institutional guidelines.Collection of vaginal washings for measuring viral titers and cytokine productionAt desired days post infection, the vagina of the mice are washed by pipetting 2 x 40 μl of PBS in and out of the vagina, which is then further diluted in PBS to a final volume of 250 μl per mouse. Be careful not to damage vaginal epithelial layer.Mice are anesthetized with isoflurane during the washing procedure.",
    "Viral titers and cytokine concentrations in the vaginal wash are usually highest at day 2 post infection.After the washing, mice can be sacrificed for harvest of whole vaginal tissue for other analysis or continued for survival or disease score recordings.Virus plaque assayPlace vaginal washes immediately on dry ice and store at -80 °C until analysis. Virus titers of the vaginal washes are determined on monolayers of Vero cells. Cells are seeded in DMEM supplemented with 5% FCS at a density of 1.2 x 106 cells/tissue culture plate (58 x 15 mm) and left overnight to settle.The next day the media is discarded and 400 µl fresh DMEM with 5% FCS is added to each tissue culture plate. Subsequently add 100 μl of vaginal washes per culture plate diluted in 10-fold serial dilutions in DMEM with 2% FCS so the total volume is 500 µl in each culture plate. Each culture plate represents one dilution of a vaginal wash. Make duplicates of each dilution. Incubate cells for 1 h and rock the plates every 15 min to ensure even distribution of the virus. After 1 h 5 ml of DMEM 5% FCS supplemented with 0.2% human immunoglobulin is added. The tissue culture plates are then further incubated for 2-3 days and stained with 0.03% methylene blue in order to count the plaques.Immunohistochemistry (IHC)Note: Paraffin is preferred in contrast to frozen sections in order to preserve morphology. We do not use perfusion fixation because the blood circulation in the vagina seems to be low. The vaginas are instead surgically removed and fixed by immersion in 2% formaldehyde in PBS for 24 h. Work at room temperature if nothing else is stated. Vaginas are dissected and placed in 2-4% formaldehyde in PBS and fixed for 24 h.",
    "The fixed tissue is placed in tissue processing/embedding cassettes.Dehydration of fixed tissue: 70% ethanol for 2 h, 96% ethanol for 2 h and 99% for 2 h.The dehydrated tissue is then placed in xylene for 2 h. The tissue is embedded in warm (60 °C) paraffin for 2 h. Cut two-micrometer sections from tissue blocks on a microtome and mount the sections on Super Frost+ slides.The slides are the dewaxed in xylene 2 x for 4-5 min. Sections are rehydrated in a series of ethanol: 3 x 99% ethanol (30 min in total), 2 x 96% ethanol (20 min in total) and finally 10 min in 70% ethanol. Then the sections are rinsed in MilliQ water 3-4 times. Endogenous peroxidase enzymes are blocked using absolute methanol with 0.5% hydrogen peroxide (H2O2) for 10-15 min. Sections are boiled in microwave oven in 10 mM Tris, 0.5 mM EGTA (pH 9.0) to reveal antigens. The boiling time depends on the microwave oven ~6 min. full power and then 10 min on half power. This will provide a soft interval-boiling.Cool down on ice using a rocking platform.The free aldehyde groups are blocked by 50 mM NH4Cl in PBS for 30 min. Sections are then washed 3 times (3 x 10 min) in buffer A (see Recipes) and incubated with primary antibody against HSV-2 diluted in buffer B (see Recipes) overnight at 4 °C in a humidity chamber.The next day take the sections out of the fridge and allow to reach room temp.Wash with buffer C (see Recipes) (3 x 10 min.) and incubate the sections with HRP-conjugated secondary antibody (P448, 1:200) in buffer B for 1 h. Rinse in buffer C 3 x (total 30 min).Antibody binding is visualized by use of 3,3’-diaminobenzidine (DAB) (Kem-En-Tec) in 0.03% H2O2.",
    "DAB is freshly made by dissolving 1 tablet in 10 ml MilliQ water and just before use, add 10 µl 35% H2O2. Rinse in PBS 3 xThe sections are counterstained with Mayer’s or Harris’s hematoxylin solution for 2 min and rinsed for 20 min under running tap water. The sections are mounted using Eukitt reagent.Flow cytometrySingle cell suspension of mouse vagina can be obtained by enzymatic and mechanic processing. The dissected vaginas are cut in to small pieces with a scalpel and transferred to a small culture flask (T25). Add 4 ml collagenase/dispase (stock: 1 mg/ml) and 2 ml DNase I (stock: 2 mg/ml) in total 6 ml and incubate under constant stirring at 37 °C for 45 min. The tissue suspension is then gently mashed using a mortar pestle and filtered through a 70 µm pore size mesh and then passed through a 40 µm pore size mesh (if cells of interest are smaller than 40 µm) and washed with PBS with 0.02% EDTA to stop enzyme activity. Cells are then centrifuged for 8 min at 300 x g and re-suspended in 200 μl PBS/vagina. The following staining can be done in a round bottom 96-well plate. Prior to staining the cells are blocked for 10 min on ice with anti-mouse CD16/CD32 Ab (1:100) and mouse and rat IgG (1 µg/ml). Wash with cold PBS and centrifuge the plate at 300 x g for 4 min at 4 °C. Stain for LiveDead (7-AAD) (1:1,000 in PBS). Incubate for 15 min on ice. Wash twice with PBS.The cells are incubated with primary antibodies in 100 µl for 30 min on ice in the dark and washed in FACS buffer (see Recipies).The following primary anti-mouse antibodies can be used for flow identification of cell populations: CD45-APC (clone 30-F11), NK1.",
    "1-FITC (clone PK136), Nk1.1-PE (clone PK136), CD11b-PE (clone M1/70), Ly-6g-APC (clone 1A8), APC RAT IgG2b, κ Isotype, FITC RAT IgG2a, κ Isotype and PE RAT IgG2a, κ Isotype and 7-AAD (Live/dead cell marker). Flow-count beads can be added to the flow samples just before analysis for determining cell counts.The cells are resuspended and fixed in 250 μl 1% formaldehyde in PBS. Detection of cytokines in vaginal washesNote: In order to determine the amount of cytokines in the vaginal washes, we utilized ELISA and Luminex technology and for detection of IFN-α/β we used an L929 cell-based bioassay. Cytokines CXCL10, CXCL9, CCL5 (Rantes), IL-6, IFN-λ and IFN-γ can be easily detected by ELISA kits from any supplier. IFN-α/β bioactivity can be measured by use of an L929 cell-based bioassay in a 96-well plate.  Prior to use HSV-2 in the vaginal samples must be inactivated on ice by UV-light treatment for 6 min.Add 50 µl DMEM 5% FCS to each well in a flat bottom 96-well plate. Each plate can hold 8 different samples/controls (A2-H2) as the samples are diluted across the plate. Column 1 (A1-H1) serves as a cell control and column 12 (A12-H12) as a virus control. Add 50 µl of vaginal washes or murine IFN-α/β to each well in row 2 (A2-H2). Make successive two-fold dilutions with an 8 arm multipippette down to row 11 (A11-H11).L929 cells (2 x 104 cells/well in 100 µl) in DMEM supplemented with 5% FCS are added to each well and the plates incubated overnight at 37 °C. L929 cells are grown in DMEM supplemented with 200 IU/ml penicillin, 200 µg/ml streptomycin and 5% FCS.The next day 50 µl of Vesicular Stomatitis Virus (VSV/V10) (1.",
    "6 x 104 PFU/ml) is added to each well EXCEPT row 1 (A1-H1) (serve as a cell control) and the plates are further incubated for 2-3 days. If there is IFN-α/β in the samples being tested the IFN-α/β will protect the cells against the cytotoxic effect of VSV as observed in the bright field microscope. The dilution mediating 50% protection from virus induced cell death is defined as 1 U of IFN-α/β/ml. The bioassay has a lower detection limit of 6 U/ml.RNA extraction from tissue and quantitative Real-Time PCR Total RNA from isolated vaginas is extracted with TRIzol, according to the recommendations of the manufacturer.Set the centrifuge with rotor for Eppendorf tubes at 2-3 °C. Add 100-150 µl DEPC water and a 5 mm steel beads to each sample/vagina and homogenize the tissue using the homogenizer/shaker. Use safety lock Eppendorf tubes. Repeat if needed.After homogenization immediately place the samples on ice.Add 500 µl TRIzol to each sample and vortex. (According to Invitrogen use 1 ml TRIzol to 50-100 mg of tissue). Incubate at RT for 5 min.Add 1:5 chloroform (100 µl in case of 500 µl TRIzol) and vortex until the mixture is ‘candyfloss’ colored. Incubate for 5 min at RT or until two phases can be detected.Centrifuge for 15 min at 10,000 x g at 4 °C. Pipet the upper clear phase to new Eppendorf tubes. Avoid the white protein film on the side of the tubes.Add isopropanol (1:1). VortexPlace the tubes at -20 °C for 2 h or at RT for 10 min.Centrifuge for 12 min at 10,000 x g at 4 °C.Discard the supernatant. The RNA precipitate forms a white gel-like pellet at the bottom of the tube.Add 0.5 ml ice-cold ethanol (80 %) and vortex briefly. Centrifuge for 4 min at 10,000 x g.",
    "Repeat wash step.Discard the supernatant. Next, air-dry the pellet. If needed use a heating block at 80 °C. Note: It can be difficult to dissolve the RNA pellet. Pellet is re-suspended in 20-50 µl DEPC-water. Vortex. DNase-free treatment: (Invitrogen Ambion DNA free kit)Add 0.1 volume 10x DNase I buffer and 1 µl rDNase I to the RNA, and mix gently. Incubate at 37 °C for 20-30 min.Re-suspend DNase Inactivation Reagent and add 0.1 volume (min. 2 µl) to each sample and mix.Incubate the samples for 2 min at RT. Mix occasionally. Prepare new Eppendorf tubes. Centrifuge for 1.5 min at 10,000 x g at 4 °C.Transfer the suspensions to new Eppendorf tubes. Store the samples at -80 °C.Notes:  The RNA concentration can be measured by use of a NanoDrop, A260 for nucleic acid and 280 for protein.For RNA the 260/280 ratio ≈ 2 is considered pure."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Microbiology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}