{
  "id": 9372,
  "origin_website": "Jove",
  "title": "A Procedure for Implanting Organized Arrays of Microwires for Single-unit Recordings in Awake, Behaving Animals",
  "procedures": [
    "The utmost care must be taken to maintain aseptic conditions (as described in the Guide for the Care and Use of Laboratory Animals9) while preparing for and conducting the following procedure. The following protocol is in compliance with the Guide for the Care and Use of Laboratory Animals and has been approved by the Institutional Animal Care and Use Committee, Rutgers University. It is estimated that the subsequent procedures will require 3-6 hr to complete.\nImplanting the Microwire Array:\nPlace animals under anesthesia using 50 mg/kg sodium pentobarbital (i.p) and administer 10 mg/kg of atropine methyl nitrate (IP; Glycopyrrolate may be substituted) and 0.25 mg penicillin (300,000 U/ml i.m.) to maintain respiratory function and prevent infection, respectively.\n\tNote: With the 3-6 hr length of this implantation surgery, sodium pentobarbital is used because it is cost-effective and limits human exposure to anesthetics (as might occur with prolonged use of gas anesthetics) while still providing long-lasting anesthesia. Substitution of other anesthetics is acceptable.\nVerify that the anesthesia has taken effect using the tail pinch test before proceeding.\nAs necessary, give alternating injections of ketamine hydrochloride (60 mg/kg IP) and sodium pentobarbital (5-10 mg/kg IP) to maintain anesthesia throughout the surgery.\nShave the scalp using a #22 scalpel blade.\nDisinfect the shaved scalp with povidone iodine.\nGive subcutaneous injections of bupivacaine (~1 mg/kg SC spread over 4 injection sites) to locally anesthetize the scalp. Allow 5-10 min for the local anesthetic to take effect.\nPlace an ophthalmic lubricant over the eyes to maintain moisture during anesthesia.\nSecure the animal into the ear bars and nose clamp of a stereotaxic apparatus.\nUse visual landmarks (e.g. a horizontal bar on the stereotaxic frame) to approximately level the animal's head. This step is only meant to approximately level the skull.",
    "Make an incision along the midline of the scalp using a #11 scalpel blade mounted on a scalpel holder. The incision must extend from just behind the ears to the posterior portion of the nasal bone.\nUsing a dissection spatula, clear the skull of all remaining tissue until both lateral skull ridges and the posterior skull ridge have been reached.\nPull back the skin around the incision using a number of hemostats (6x).\nClean the skull of any blood and allow it to dry. If any remaining bleeding occurs, terminate the residual bleeding with a small cauterizing tool. Ensuring that the skull remains clean and dry allows the dental acrylic used in subsequent steps to bind to the skull permanently.\nMark bregma and lambda (Figure 2D) by interpolating the intersection of the skull sutures. A dissecting microscope is necessary to accurately mark these positions.\nAttach a small pointed item (e.g. a pin or dental drill bit) to a stereotaxic arm and lower it to determine the dorsal/ventral (DV) coordinate of bregma and lambda.\nAdjust the nose clamp until the DV coordinates for bregma and lambda are within 100 µm (0.1 mm) of each other.\nOnce leveled, record the anterior/posterior (AP), medial/lateral (ML) and DV coordinates of bregma along with the position of the nose clamp. Double check the coordinates for accuracy, as the remainder of the surgery depends on the precision of these coordinates.\nUse the measured coordinates to calculate the ML and AP coordinates for the four corners of the \"skull window\" relative to bregma (i.e. craniotomy; Figure 1). The skull window is a precisely positioned rectangle through which the microwire array will pass.",
    "Use the calculated coordinates to mark the skull window coordinates on the skull using a pointed stereotaxic attachment and fountain pen ink. To obtain precise marks, apply only a small amount of ink to the tip of the marking tool using a cotton applicator.\nDrill out the skull window by removing the bone in a series of small layers.\n\t\nStart by drilling the marked corners of the window where the marks have been placed.\nNext, connect the corners and outline the window.\nFinally, clear out the area within the outline down to the depth of dura mater. The hole must be wider (i.e. beveled) below the superficial layers of the skull to ensure that the window maintains an appropriate width from top to bottom.\nUse microforceps to carefully remove any remaining bone chips, debris, or dura mater inside the skull window. This step is extremely important, as these bits of material can compromise the integrity of the array during lowering. Once cleared, one must keep the window moist with bacteriostatic saline for the remainder of the surgery.\nPlace markings on the skull for 5 skull screws and 1 ground wire (Figure 1). These positions will vary depending on the targeted brain region. The headstage will be most secure if one screw is placed on each of the 5 skull bones. Place both the skull screws and ground wire in locations that will not interfere with the microwire array placement.\nDrill holes for the skull screws and secure the screws in place. Screws must be lowered until only 3-4 threads are showing (or, if using screws other than those recommended, deep enough to traverse the thickness of the skull to promote array stability but not too deep so as to damage cortex). Clean the threads of the screws after placement.",
    "Drill a hole for the ground wire. Lower the wire slowly (over 1-2 min) to the target DV coordinate and fix the wire in place using dental acrylic.\nAdd acrylic around the threads of the skull screws. Before the acrylic dries, remove any excess cement that flows away from the ground wire or skull screws. Allow 15 min for the dental acrylic to dry/harden.\nAttach the array to the stereotaxic arm. Level the array and orient it so that it will squarely pass through the confines of the skull window.\nPlace saline in the skull window so that it is level with the skull. Lower the array until it creates a dimple in the saline. This coordinate is used as skull level for the array. Use this value to calculate the final DV coordinate of the array.\nLower the array slowly until it reaches its final DV coordinate. Stop every 1mm of lowering and wait for several minutes in order to allow brain tissue to recover from dimpling and to dissolve the bottom portion of the polyethylene glycol (PEG) on the array (PEG is used to temporarily keep the wires in their conformation while lowering, and dissolves slowly in saline).\nWhen the array is 1mm away from the target, lower it more slowly until the final target is reached. Lowering at 0.1-0.2 mm at a time before allowing the tissue to rest for a period of 5 min is intended to preserve the tissue at the target site as well as proximal synaptic connections. If the equipment is available, precision lowering of the array can be assisted using a motorized manipulator.",
    "Dissolve the remaining PEG and use dental acrylic to cement the microwires in place. Add multiple layers of cement to ensure that the wires are secure and then allow 15-20 min for the cement to harden before proceeding. This ensures that the wires will not be jostled from their final placement.\nBuild the remainder of the animal's headstage using dental acrylic. Use the acrylic to encase the skull screws, ground wire, and connector for the microwires. Allow the acrylic hat to harden sufficiently before proceeding.\nSuture the scalp incision using absorbable sutures and administer 2 ml of bacteriostatic saline (s.c.) to restore hydration from surgery.\nRemove the animal from the ear bars and place the subject in a clean area. Observe the animal frequently during the post-operative recovery until thermoregulation and locomotion have recovered. Following recovery from anesthesia, move the animal into single-housing for the remainder of post-surgical recovery.\nGive animals daily postoperative monitoring and care in the days following the procedure. Recovery from this procedure is optimal when seven or more days are allowed.\nGive animals injections of Carprofen (5mg/kg) and Enrofloxacin (5-10 mg/kg) or their equivalents during recovery per the schedule recommended by the attending veterinarian.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}