{
  "id": 4330,
  "origin_website": "Bio",
  "title": "Virus Infection and Titration of SARS-CoV in Mouse Lung",
  "procedures": [
    "Infection   Arrange materials in a ventilated hood. When using SARS-CoV, all procedures are performed in a biosafety hood in a BSL3 laboratory. When using isofluorane, always anesthetize animals in a fume or biosafety hood.   Thaw virus on ice then dilute in DMEM to the appropriate concentration. Each mouse receives 50 μl of virus.    Place several ply of gauze in the bottom of a plastic dessicator followed by 10 ml of isofluorane.  Note: Make sure to tape over the center hole in the plastic dessicator grate because small mice are sometimes able to squeeze through this hole and jump into the bottom, isofluorane filled chamber.   Load a P200 micropipette with 50 µl of virus and then secure it in a safe position while placing a mouse on the grate inside the dessicator.    Immediately after the rate of respiration slows, pick up the mouse, hold it vertically and then slowly deliver 50 µl of virus to both nostrils of the mouse. When mice are lightly anesthetized breathing will be deep enough that liquid on the nostrils should be completely aspirated into the lungs.  Note: The orifice size of the pipetman tips used matters significantly; tips with too small an orifice make it difficult to smoothly dispense virus onto the nostrils.      Removal and processing of lung tissue   A mouse is euthanized by intraperitoneal injection of 300 μl ketamine/xylazine solution. To inject fluid into the intraperitoneal cavity, secure a mouse in the palm of the hand and hold it horizontally. Insert a 25 G x 5/8 g needle at a shallow angle tangential to the mouse and slowly dispense ketamine/xylazine into the peritoneal cavity.",
    "Once the mouse is fully anesthetized, place it on a square of absorbant padding on polystyrene foam and immobilize the mouse by pinning each limb with a 25 G x 5/8 gauge needle.    Use a spray bottle filled with 70% ethanol to sterilize the fur of the mouse.   Use scissors to cut open the abdominal and thoracic cavities by first making an incision from the lower abdominal to the throat of the animal. Opening the abdominal cavity exposes the underside of the diaphragm. Use scissors to pierce through the diaphragm. Cut away the ribcage of the mouse and fully expose the heart and lungs. Cut the heart away from the lungs, and then remove the lungs by cutting the trachea and any remaining connective tissue.    After the lungs are removed from the thoracic cavity, use a 5 ml syringe filled with PBS to wash the blood from the outside of the lungs.   Place the lungs in a tissue grinder and grind them coarsely. Add 3 ml of PBS to the grinder and continue grinding the tissue to a homogenate.    Aliquot 1 ml of homogenate into 2 ml micro tubes, place on dry ice and then transfer to a -80 °C freezer.      Virus titration   Vero E6 cells are split every 2 or 3 days at 1:4 or 1:6 dilutions respectively. Cells are maintained in a CO2 incubator at 5% CO2 and 37 °C. Plan to have confluent T75 flasks ready the afternoon before tittering experiments. Split cells at a 1:4 dilution and then add media containing 200,000 cells to each well of a 12 well plate.   The next day, make dilutions of the virus in DMEM filled wells of a 48 well plate.",
    "Dilute 100 µl of sample in 900 µl of DMEM and so on until the sample is appropriately diluted. Plan to infect duplicate wells for each virus, at each dilution. When initially characterizing a SARS-CoV strain try testing the range of 1:10 dilutions from undiluted to 107. Negative control wells are not required.   Prepare overlay medium as described below.    Remove media from the Vero E6 cells and then add 125 µl of each sample dilution to be tested. This must be done rapidly so that the agarose mixture does not solidify before addition to the wells.   Return plates to the CO2 incubator and then gently rock the plate back and forth several times every ten min for 30 min. Observe that rocking is sufficient so that the monolayer remains moist.   Remove the inoculum and add 500 µl of overlay medium per well. When the agarose solidifies add 500 µl of 2% serum culture media per well and return plate to the incubator.   On day three post-infection, remove plates from the incubator and add 1 ml of 25% formaldehyde diluted in PBS to each well. Fix cells for 20 min at room temperature and then suction off liquid using a pipet and pipet-aid. Remove agarose layer using a small spatula, being careful not to accidentally disrupt the monolayer.   Stain cells with 200 µl of 0.1% crystal violet per well for at least 5 min, remove dye, wash once with ddH2O, and count plaques.   imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140313/20140313021211_4376.jpg Figure 1. Visualization of plaques Monolayers of indicator cells and dilutions of virus were prepared. Samples were inoculated onto cells and plaques visualized as described above. Wells on right hand side of figure contain no plaques while the upper two rows in the first 2 columns illustrate nearly complete destruction of the monolayer.",
    "Clearly delineated plaques are shown in the bottom row.       Quantification of lung viral titer   Viral titers are expressed as Log10 PFU/gram of tissue, calculated using the following equation: Log [(number of plaques x 10dilution factor x 1/volume used to overlay cells x 3)/weight of lungs]. 3 is the volume of PBS used to homogenize the tissue. For example let’s hypothesize that there were 5 plaques in a well that had received a sample that was diluted by a factor of 1000. We add 0.125 L of sample to each well and assume a mean weight of 0.14 g for each mouse lung. The titer is then calculated as follows: Log [(5*103*1/0.125*3)/0.14] = 5.9 Log10PFU/gm"
  ],
  "subjectAreas": [
    "Cell Biology",
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}