{
  "id": 19097,
  "origin_website": "Jove",
  "title": "Computed Tomography-guided Time-domain Diffuse Fluorescence Tomography in Small Animals for Localization of Cancer Biomarkers",
  "procedures": [
    "1. Animal Preparation\nAnesthetize nude mouse (Charles River, Wilmington, MA) with intra-peritoneal injection of ketamine-xylazine (100 mg/kg:10 mg/kg i.p.).    \nPlace mouse in stereotactic frame, make an incision into the scalp on the left-side of the skull and, using an 18-gauge needle, create a 1 mm-diameter hole into the skull 2 mm from the central line and 2 mm behind the bregma. \nInject 5×105 U251 human neuronal glioblastoma cells (kindly provided by Dr. Mark Israel at Dartmouth College, Hanover, NH) in 5 μl of phosphate buffer solution into the left cerebral hemisphere at a depth of approximately 2 mm below the surface of the brain. Use a Hamilton micro-syringe18 and a blunt ended 27-gauge needle for cell implantation and insert the tip of the needle 3 mm from the outer surface of the skull and then withdraw 1 mm to create a pocket for the cells. \nSuture incision site and allow recovery from surgery. \nWait ~14 days to allow the tumor to grow before imaging. \n2. Fluorescence Tomography System Calibration\nOn the day of mouse imaging, initiate system and allow lasers and light detectors to warm-up for approximately 20 minutes to avoid drifts in system sensitivity.    \nPlace a 100°-by-4° engineered line diffusor (Thorlabs, Newton, NJ) at the direct center of the imaging gantry, normal to the excitation laser: a picosecond-pulsed 80-MHz multimode 635 nm laser diode (PicoQuant Photonics North America Inc., Westfield, MA). Adjust the angle of the diffusor to maximize the amount of signal detected by all five light collection channels. A complete description of the imaging geometry is provided elsewhere11,14,15.",
    "Place OD 2 neutral density filters (Thorlabs, Newton, NJ) in front of all fluorescence detection photomultiplier tubes (PMT) and OD 1 neutral density filters (Thorlabs, Newton, NJ) in front of all transmittance detection PMTs. Collect 100 temporal pulse spread profiles (TPSF) of the laser, each with a 1-s integration time. \nNormalize each TPSF by the laser reference, correct for temporal drift in the laser reference, and average over all iterations for each detector. These averaged TPSFs are the detector-specific instrument response functions (IRF) used in the optical image reconstruction. \n3. Imaging Protocol\nAnesthetize the mouse with 2% isoflurane in oxygen (1 L/min).    \nInject 1 nanomole of IRDye 800CW-EGF and 1 nanomole of Alexa Fluor 647 in 100 μl of phosphate buffer solution, intraperitoneally, 12 h prior to imaging to target epidermal growth factor receptor overexpression in the tumor. \nPlace the mouse onto the fiberglass supports of the imaging bed, arranging the mouse so that its nose remains in a cone delivering isoflurane anesthesia. \nEnsure that the mouse is positioned appropriately on the bed: i.e., that when the bed is secured into the fluorescence tomography system the mouse is at the approximate center of the imaging gantry. This positioning can be guided by rotating the excitation laser 180° about the mouse, ensuring that the focal point of the laser illuminates a point roughly on the center of the mouse from the perspective of the laser at all angles. \nOnce positioned, carefully transfer the imaging bed and mouse to the microCT (eXplore Locus, GE Healthcare, London, ON) scanner and collect anatomical information at a resolution of 93-μm isotropic for the whole head of the mouse. \nVisualize the CT image stack and choose the slice(s) to be imaged with the fluorescence tomography system.",
    "Carefully transfer the imaging bed and mouse back to the fluorescence tomography system. Choose the number of source positions to collect data about the mouse for each imaging slice (32), the integration time for each TPSF measurement (1 s), the number of iterations for each source position (10), and the position and number of desired imaging slices from the CT image stack from Step 3.6. The numbers in parentheses are typical values for each imaging parameter yielding ~ 5 minutes of data acquisition per imaging slice. \nPlace triple notch filters (Chroma Technology Corp., Bellows Falls, VT) in front of the fluorescence detection PMTs, to restrict any laser light from reaching the fluorescence detectors, and OD 2 neutral density filters in front of the transmittance detection PMTs to avoid saturation of those detectors.    \nRun the data acquisition software, collecting fluorescence and transmittance TPSFs at each defined source detector position and for each excitation wavelength (635 nm and 755 nm to excite the Alexa Fluor 647 and IRDye 800CW-EGF tracers, respectively). For every set of TPSFs collected, monitor and record the laser intensity with a reference PMT channel. \n4. Image Reconstruction\nDetermine the outer surface of the mouse and the location of the imaging bed support rods from the CT images and create masks that covers the confines of the mouse and the imaging rods separately.\nUse the mouse mask to produce a finite-element mesh of the animal using the NIRFAST software19. \nLocalize the source and detector positions from the fluorescence tomography system on the surface of the mesh based on microCT and fluorescence spatial registration co-ordinates20. \nRemove optical data points associated with source or detector positions that interact with the location of the imaging bed support rods.",
    "Normalize data collected at each source detector position by the laser reference, correct for temporal drift in the laser reference, and correct for filter sensitivities, which were determined by experimental testing at time of purchase15. \nTake the Born Ratio of the data (fluorescence divided by transmittance) for each source-detector position and multiply with a forward model simulation of transmittance based on the finite-element animal mesh for uniform optical properties. This is done to mitigate errors associated with source- or detector-tissue coupling21, to calibrate the data to the model22, and to adjust data for other aspects of model-data mismatch23,24. \nConstruct a data vector composed of the scaled difference of the born ratio data collected at both wavelengths. The scaling factor is chosen to maximize EGFR binding contrast. Perform time-domain image reconstruction with the calibrated difference data using the TPSF for each detection channel as an input, and create fluorescence maps of the contrast-enhanced targeted tracer15. \n5. Representative Results\nAn example of a fluorescence reconstruction overlaid with a co-registered CT anatomical image from the head of a mouse with a U251 orthotopic glioma tumor is presented in Figure 1b. The center of mass of the glioma determined by the fluorescent reconstruction (Figure 1b) was within 1 mm of the tumor center of mass determined by contrast-enhance magnetic resonance imaging (Figure 1a). The CT and MRI images were co-registered based on a mutual-information transformation.\nimgsrc://cloudfront.jove.com/files/ftp_upload/4050/4050fig1.jpg",
    "Figure 1.  Contrast-enhanced (Gadolinium) magnetic resonance image of mouse head (a). The mouse was inoculated orthotopically with a U251 human glioma cell line. The location of the tumor, which absorbs more contrast agent than the normal brain, can be seen in the left cerebral hemisphere (right in image) and indicated by the white arrow. The corresponding computed tomography image (from the same location on the mouse head) is depicted in (b) with the epidermal growth factor targeted fluorescence minus the untargeted fluorescence reconstruction overlaid. The units of fluorescence are in inverse mm and relate to the absorption coefficient of bound targeted fluorescence multiplied by its quantum efficiency and by its concentration."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}