{
  "id": 8637,
  "origin_website": "Jove",
  "title": "Compartmentalization of Human Stem Cell-Derived Neurons within Pre-Assembled Plastic Microfluidic Chips",
  "procedures": [
    "NOTE: Figure 1A,B shows a schematic of the pre-assembled COC chip, including the locations of the main channels or compartments, wells, and microgrooves. The compartmentalized chip can establish distinct fluidic microenvironments within a compartment as demonstrate by the isolation of food coloring dye (Figure 1C). The protocol for preparing the pre-assembled multi-compartment chip is given in Nagendran et al., Section 112.\n1. Coating of multi-compartment chips for hSC-neurons\nNOTE: Figure 2A shows an overview of the coating procedures.\nDissolve poly-L-ornithine in cell culture-grade distilled water to make 600 µL of solution per chip of a 20 µg/mL working solution.\nAspirate the remaining PBS left after preparing the chips from the wells. When aspirating, ensure that the pipet tip is away from the channel opening.\n\tNOTE: The microfluidic channels must remain filled for the entirety of this procedure. Do not aspirate liquid from the channels/compartments, only the wells.\nLoad 150 µL of poly-L-ornithine working solution in the upper right well. Wait for 90 s or until liquid begins to fill the lower right well. Add 150 µL of media to the lower right well and wait for 5 min to let the liquid pass through the microgrooves.\nAdd 150 µL of media to the upper left well. Wait 90 s and then add 150 µL to the lower left well. Wrap the holder of the chip(s) with parafilm and place at 4 °C overnight.\n\tNOTE: Alternatively, place the chip and holder at 37 °C for 1 h.",
    "Aspirate the media from the wells, ensuring that the pipet tip is placed away from the channel opening. Add 150 µL of sterile water to the upper right well. Wait for 90 s and then add 150 µL to the lower right well. Wait for 5 min to let the liquid pass through the microgrooves.\nAdd 150 µL of sterile water to the upper left well, wait 90 s and then add another 150 µL to the lower left well.\nRepeat steps 1.5-1.6.\nThaw laminin slowly at 2 °C to 8 °C and prepare a 10 µg/mL working solution.\nLoad 150 µL of the laminin working solution to the upper right well. Wait for 90 s or until liquid begins to fill the lower right well. Pipet 150 µL to the lower right well. Wait for 5 min to let the laminin go through the microgrooves.\nAdd 150 µL of laminin to the upper left well. Wait 90 s and then add 150 µL to the lower left well. Incubate the chip within its holder for 2 h at 37 °C.\nRinse the chip with PBS (without Ca2+ and Mg2+). Load 150 µL of PBS to the upper right well. Wait for 90 s or until liquid begins to fill the lower right well. Add 150 µL of PBS to the lower right well and wait for 5 min to let the PBS go through the microgrooves.\nPipet 150 µL of PBS to the upper left well. After 90 s pipet 150 µL to the lower left well.",
    "Aspirate PBS from the chip and then rinse the chip with NSC media (see Table of Materials). Load 150 µL of media to the upper right well. After 90 s or when liquid passes through the right channel into the lower right well, add 150 µL to the lower right well. Wait for 5 min to let the media flow through the microgrooves.\nAdd 150 µL of media to the upper left well and another 150 µL to the lower left well. Incubate the chip in a 37 °C incubator with 5% CO2 to pre-condition the chip until ready to seed NSCs.\n\tNOTE: Chips can be pre-conditioned overnight if needed.\n2. Seeding NSCs into the multicompartment chip\nNOTE: This protocol used commercially purchased NSCs, unlike our previous publication which began with human embryonic stems cells5. In this protocol neural stem cells are plated directly into the plastic chips where they differentiate into neurons. The cells can be allowed to proliferate as NSCs (without differentiation) for up to 2 passages and stored in vials in liquid N2 for further use. This protocol uses NSC vials stored in liquid N2 after passage 1 or 2. Figure 2B shows an overview of the coating procedures.\nThaw NSCs according to manufacturer’s instructions.\n\tNOTE: This procedure applies to H9-derived NSCs. Other cell lines will require cell density optimization.\nCount the cell concentration using a hemocytometer and adjust using NSC media to get a concentration of 7 x 106 cells per mL.\nAspirate media from each well of the chip. Avoid aspirating media from the main channels.",
    "Pipet 5 µL of the cell solution to the upper right well, followed by 5 µL to the lower right well (70,000 cells total). Ensure that the cells are pipetted towards the main channel openings. Use a microscope to check that cells have entered the channel. Wait 5 min for cells to adhere to the bottom of the chip.\n\tNOTE: Either or both compartments can be used to load cells.\nPipet ~150 µL of NSC media to the upper right well and then 150 µL to the lower right well. Repeat on the left side. Incubate at 5% CO2, 37 °C within a suitable humidified container.\nAfter 48 hours, aspirate NSC media from the wells and replace with neural differentiation media by adding 150 µL to each top well and each bottom well.\nCulture neurons within a 5% CO2, 37 °C incubator within a suitable humidified container.\n\tNOTE: Media should be replaced every 2-3 days. Because of the small volumes used in the chip, evaporation even within a humidified incubator can substantially impact cell viability. Use a suitable secondary container to provide additional humidity for long-term culture of cells with the chip (see Table of Materials).\n3. Viral fluorescent labeling of hSC-neurons within the chip\nNOTE: Multiple virus can be used to label neurons within the chip. Instructions below describe the use of G-deleted Rabies-mCherry or –eGFP virus. Potentially infectious materials must be handled according to applicable rules and regulations, and may require additional training and institutional approval.\nWarm ~400 µL of fresh neural differentiation media per chip to 37 °C.\nRemove 50 µL of media from one well of the axon compartment into a centrifuge tube and then add 100,000 viral units of modified rabies virus to the tube.",
    "NOTE: Properly dispose spent pipet tips and centrifuge tubes containing virus.\nRemove the remaining neural differentiation media from the axonal compartment and place into a centrifuge tube. Store at 37 °C.\n\tNOTE: Make sure that the channels remain filled with liquid.\nMix the 50 µL of virus solution with 150 µL of warmed media. Pipet 100 µL to one well of the axon compartment and 100 µL to the other axon compartment well. Incubate for 2 h within a 37 °C incubator.\n\tNOTE: The difference in volumes between the axonal and somatic compartments helps ensure the virus stays in the axonal compartment during infection/incubation times.\nWithdraw and dispose of virus-containing media.\n\tCAUTION: Do not remove liquid within the enclosed microfluidic channels.\nGently pipet 75 µL of fresh media to one axon compartment well and let the media flow through the channel into other axon well.\nRemove media from the axon compartment and dispose properly.\nRepeat steps 3.6 and 3.7.\nFill the axon compartment with the saved media. Pipet an additional 50 µL fresh media, if needed, and then return the chip to the incubator. This additional fresh media is to count towards loss of media during liquid transfer and evaporation during the process.\n\tNOTE: Visible fluorescent labeling using these modified rabies viruses occurs by 48 h and up to 8 days after which cell death of infected neurons generally occurs due to virus toxicity. Neuron imaging can be performed as with other standard culture platforms (e.g., glass bottom dishes), but special consideration is needed to maintain sufficient humidity to prevent evaporative losses.\n4. Fluidic isolation, axotomy, and immunostaining within the chip\nFollow fluidic isolation, axotomy, and immunostaining with the chip as described in Nagendran et al.12."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}