{
  "id": 18776,
  "origin_website": "Jove",
  "title": "Multimodal Protocol for Assessing Metacognition and Self-Regulation in Adults with Learning Difficulties",
  "procedures": [
    "The research ethics committee of the Principality of Asturias and the University of Oviedo approved this protocol.\n1. Session 1: diagnosis assessment\nNOTE: In this session of the protocol, evaluation tests from different publishers are used, which have their own specific application and interpretation manuals. Since these tests, or other similar ones, are widely known by the scientific community in the field of psychology and education, the procedure to apply them is not detailed step by step (for example, given the aim of this paper, it does not make sense to detail each step of the WAIS-IV35 application).\nInformed consent\n\t\nExplain to the participants the ethical and confidentiality aspects of the research and ask them to acknowledge and sign the individual informed consent.\nStructured interview\n\t\nExplain the following instructions to the participant: \"Now, I´m going to interview you in order to get important information about your life and academic issues. There are open and closed questions but you can interrupt me whenever you want. Please, let me know if you need me to clarify any point. After this initial interview, I may ask you to do some evaluation tests and questionnaires. I will tell you the specific instructions for each one. Are you ready?\"\nCollect the biographical information along with the presence of symptoms related to SLD and exclusion criteria that are referred in the DSM-51 following the interview script (see Supplemental File A[href=https://www.jove.com/files/ftp_upload/60331/Supplemental_documents_A.pdf] ).\nFirst decision point in relation to the structured interview (exclusion criteria)\n\t\nFinish the assessment if the participant meets the initial exclusion criteria, that is, they explain that they have a motor disability (upper segments), sensory disability (visual or auditory), a diagnosis of intellectual disability or a serious mental disorder.",
    "Continue the assessment if it seems that the participant has or thinks he/she has an SLD and does not meet exclusion criteria.\nIntellectual ability\n\t\nApply the WAIS-IV35 test to collect information about participant’s intellectual ability following the instructions in the manual.\nSecond decision point in relation to intellectual ability (exclusion criteria)\n\t\nFinish the assessment if the participant does not understand the instructions of the test, if cannot be evaluated, or they have an IQ of less than 70.\nContinue the assessment if the person has normal or limited intellectual ability.\n\t\tNOTE: The limit of the IQ accepted in the present study has been set as a score of over 70.\nADHD\n\t\nAsk the participant to complete the six items of the Self-reported Screening Questionnaire of the Adult-v1.1. (ASRS39) of the World Health Organization (WHO) International Composed Diagnostic Interview.\n\t\tNOTE: This questionnaire provides information on the presence of symptoms related to ADHD that are referred to in the DSM-IV54.\nApply the Nesplora Aquarium test40 if the participant scores 12 or more in the previous ASRS36 questionnaire.\nReading difficulties\n\t\nApply the PROLEC SE-R Screening Test of reading difficulties37 follow the instructions in the manual.\nAutism spectrum disorder (level 1)\n\t\nAsk the participant to complete the 28 items of the Autism Spectrum Quotient (AQ-Short) questionnaire from Hoekstra et al.41\n\t\tNOTE: This questionnaire provides information on the presence of symptoms related to social behavior, social skills, routine, switching, imagination and numbers/patterns.\nAnalyze the results.\n\t\nAnalyze each participant’s interview, questionnaires and test results and decide if they have significant learning difficulties or not or are at risk of having them.",
    "NOTE: Two members of the expert committee (the evaluator and another member of the research team) analyze each participant’s learning profile and decide if they is a student with SLD, ADHD and/or ASD or not or are at risk of having them. No test can substitute the expert´s judgment.\nFinal decision point\n\t\nFinish the assessment if the participant is clearly not a student with learning difficulties.\nContinue the assessment if the participant is a person with LDs (or at risk) and go to Session 2.\n2. Session 2: multimodal assessment\nNOTE: Session 2 must be done between 1 and 7 days after Session 1.\nPrepare the participant.\n\t\nRemind the participants that the session lasts approximately 2 hours, and that they are going to complete some questionnaires and tasks in the MetaTutor learning environment while some devices are recording their performance throughout the session.\nAsk the participants tie back their hair, clear their neck, remove their glasses and remove chewing gum if applicable.\n\t\tNOTE: If the participant is wearing glasses, has long hair or bangs that cover part of their face, the eye tracker will not be able to read their eyes movements.\nIntroduce MetaTutor to the participants. Explain that the objective of the session is to autonomously learn about the circulatory system using the tool.\nMake sure the speakers are connected and working.\n\t\tNOTE: The participant can also use headphones if preferred.\nGalvanic skin response preparation and calibration\n\tNOTE: Remember that there are many types of GSRs manufactured by different companies. Use it according to the supplier's specifications.\n\t\nClean the GSR and the participant´s fingers with alcohol.\nPut the finger/wristband GSR sensors on the index and ring fingers with the connectors on the fingertip side or according to the manufacturer's instructions.",
    "Ask the participant to rest their hand on the table quietly and try to relax for 5 min.\nOpen the software in the computer.\nMake sure the registration graph is working. Check the registration graph is registering.\nClick Run experiment > Rate 10 per second > Duration > 10 > Minute. Record the information for ten minutes to establish the baseline.\n\t\tNOTE: Rate 10 per second means the frequency with which measures are taken.\nMinimize the screen.\nContinue with the calibration of other devices, and after 10 minutes save the information in a .csv file.\nEye tracking and webcam preparation and calibration\n\tNOTE: Remember that there are many types of eye tracking and webcam manufactured by different companies. Use them according to the supplier's specifications.\n\t\nOpen the software in the side laptop and in the computer.\n\t\tNOTE: The eye movements are captured on the PC the participant is working on, but the data is recorded on the side laptop. In addition, in the side laptop, the experimenter can see the movements that the participant is making and correct the participant’s position if necessary.\nIndicate which session will be recorded (Metatutor in this case) and the participant’s registration data: File > Recent Experiment > Metatutor > Include Registration data of the participant > OK.\nCheck that the two computers are connected to each other and that the eye tracking infrared lights are on and ready to capture the movement of the eyes.\nAdjust the webcam on the computer to the participant’s position.\nAsk the participant to sit facing forward and be as neutral as possible, although it is expected that their facial expressions will vary during the learning session.",
    "NOTE: During the learning session a video of the participant´s face is recorded with the webcam which is later analyzed using a desktop app55.\nAsk the participant to be still and to stare at the different points of the screen with their nose put in line with/slightly over the edge of the desk (at 90°).\nClick Record > Write the registration data of the participant > Ok to start the calibration process.\nAsk the participant to press the space bar and follow the points on the screen with their eyes.\nMake sure that the participant’s eyes, when looking at the screen, are centered before moving on to the next step, using the side laptop to check this information.\n\t\tNOTE: The participant's gaze is centered when the movements of their eyes are registered on the side laptop screen with two white circles. When the gaze leaves the registration area, the software warns with yellow arrows (if slightly deviated), with red arrows (if deviated a lot) or without white circles (if not registering). The path of the movement of the eyes is reflected with a yellow light (attentional focus) and the track through the screen with a green line.\nAsk the participants to avoid touching their face or resting their head in their hands as much as possible.\nMinimize the screen.\nMultimodal tracking of the learning session\n\t\nMaximize the GSR screen and click Run experiment > Rate 10 per second > Duration > 5 > hours > Record and minimize the screen again.\nMaximize the eye tracking and webcam screen, make sure the software is working correctly, click Record on the computer and on the side laptop to register and record the session and minimize the screen again.",
    "NOTE: Once the devices have been calibrated, do not forget to start recording the evaluation session in each of them. From this point, the entire participant interaction with the learning tool will be recorded until the end of the session.\nQuestionnaires and learning session in MetaTutor\n\t\nOpen the software in the PC and complete the participant’s registration data. Complete ID > Experimenter > Day > Questionnaires yes > Continue.\n\t\tNOTE: All the logs will be registered during the session in a file-data log.\nExplain to the participant that they must follow the instructions in the tool and that they will only be interacting with the computer during the learning session. Explain that the researcher will be in the next room in case anything happens.\n\t\t\nAsk the participant for sociodemographic and academic information. Complete Name > Gender > Age > Ethnic group > Educational level > University > Degree > GPA > Information about biology courses taken if applicable > Continue. Before clicking Continue, explain to the participants that they must follow all the instructions that the tool will give them. Also, that they will only interact with the computer during the learning session.\nAsk the participant to complete some questionnaires.\n\t\t\tNOTE: The participant has to complete five metacognitive and self-regulated learning questionnaires: a) The Mini International Personality Item Pool49; b) The Connotative Aspects of Epistemological Beliefs50; c) The Rosenberg Self-esteem Scale51; d) The Emotion Regulation Questionnaire52; e) The Achievement Emotions Questionnaire (AEQ)53 and one questionnaire about general knowledge about the circulatory system.\nShow the participant the interface of MetaTutor and its different parts.\n\t\t\t\nExplain the participant that the content area is where the learning content is displayed throughout the session in text form.",
    "Show the participant that they can navigate through a table of contents at the side of the screen to go to different pages.\nShow the participant that the overall learning goal is displayed at the top of the screen during the session.\nShow the participant that the sub-goals learners set are displayed at the top in the middle of the screen, and they can manage sub-goals or prioritize them here.\nShow the participant that there is a timer located at the top left corner of the screen displays the amount of time remaining in the session.\nShow the participant the list of self-regulating processes, which are displayed in a palette on the right hand side of the screen, and the participant can click on them throughout the session to deploy planning, monitoring and learning strategies.\nShow the participant the static images relevant to content pages are displayed beside the text to help learners coordinate information from different sources.\nShow the participant the text entered on the keyboard and how students´ interactions with agents are displayed and recorded in this part of the interface.\nShow the participant the four artificial agents who help students in their learning throughout the session.\n\t\t\t\tNOTE: These agents are Gavin the Guide, Pam the Planner, Mary the Monitor, and Sam the Strategizer.\nAsk the participant to click Start to begin the learning session whenever they are ready.\n\t\t\tNOTE: The participant interacts with the tool.\nOnce the session is finished, ask the participant to complete the knowledge questionnaire again.\n3. Logoff\nAt the end of the session save the recorded data from GSR, eye tracking/webcam and Metatutor along with the registration data of the participant. Extract the data in a .csv file for easier use.",
    "Remove the GSR sensors from the participant's hand and clean the galvanic sensors with alcohol again.\nThank the participants for their collaboration and say goodbye.\n4. Analysis of learning difficulties\nAnalyze each participant’s learning performance based on the different reports produced (see Results section) to obtain a multimodal profile.\n\tNOTE: At least two members of the expert committee analyze each participant’s learning process. Although the evaluation can be done exhaustively using new instruments and tools, no report can replace the expert's judgment.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}