{
  "id": 15256,
  "origin_website": "Jove",
  "title": "Enhanced Genome Editing with Cas9 Ribonucleoprotein in Diverse Cells and Organisms",
  "procedures": [
    "1. RNP Assembly\nDesign the experiment well in advance, acquiring all the RNA, DNA, and protein components ahead of time. As a first pass, try one of the positive controls listed in Table 1 and use the commercial reagents described in the Table of Materials to ensure a reliable experimental design and the integrity of the materials. For additional tips on planning a new genome-editing experiment, see papers on this topic12,42,43.\n\t​NOTE: Once assembled as described in the subsequent steps, RNPs prepared in advance may be stored at -80 °C.\n\t\nAfter choosing which gene to target, use one of the free online tools to design an optimal gRNA44,45,46,47,48. Be sure to target an exon if hoping to generate a knockout.\n\t\tNote: These tools will help to identify a target site with an adjacent S. pyogenes PAM sequence, high-quality score, and low off-target score.\nPurify the S. pyogenes Cas9 protein through published methods8, or purchase it from a commercial vendor.\nPrepare a typical Cas9 buffer for the RNA dilution, RNP preparation, and protein storage, which contains 20 mM of HEPES pH 7.5, 150 mM of KCl, 10% glycerol, and 1 mM of TCEP. Always use nuclease-free water in buffers that will be used to resuspend or dilute RNA to prevent degradation.\nProduce the guide RNA (tracrRNA and crRNA or sgRNA) through an in vitro transcription using published methods, or purchase it from a nucleic acid synthesis company17,21,49,50,51.\nIf inserting a gene, synthesize or purchase a donor DNA template.\nStore the protein and RNA aliquots at -80 °C and thaw on ice immediately before use.\n\t\t​NOTE: Each freeze-thaw slightly lowers the efficiency. Detailed, open-access protocols for Cas9 purification52 and the in vitro transcription of sgRNAs53 are available elsewhere.",
    "If working with C. elegans, skip to step 1.5. For the P. hawaiensis protocol, skip to step 1.6. If using sgRNA, skip to step 1.4. Proceed to step 1.3 to assemble a gRNA for primary cell editing.\nAssemble a gRNA by mixing equimolar amounts of tracrRNA and crRNA. Make 100 µL of 80 µM gRNA stock, for about 50 genome editing experiments.\nIncubate the gRNA at 37 °C for 30 min and then allow it to slowly cool to room temperature.\nRNP prep for HSPC and T cell editing: Assemble an RNP complex by mixing a 1 - 2x molar amount of gRNA to 200 pmol of Cas9 protein in a total volume of 10 µL. Very slowly, add concentrated Cas9 to the gRNA (pre-diluted in the Cas9 buffer) for about 30 s, making quick circles with the pipette, bringing the final Cas9 concentration to 20 µM.\nPrepare the electroporation cuvettes.\n\t\tNOTE: This protocol is specific to the commercial system referred to in the Table of Materials, but RNP editing can also be achieved with other electroporation devices.\nAdd 5 µL (100 pmols, T cells) or 10 µL (200 pmol, HSPCs) of RNP to each cuvette.\nIf inserting new DNA rather than making a knockout, add 1 µL of 100 µM (100 pmol) single-stranded oligonucleotide donor DNA (ssODN)25,54,55 to the cuvettes or wells of the plate.\nSkip to step 2 for the next instructions in the primary cell editing protocol.",
    "RNP prep for C. elegans editing: Assemble the RNP complex by adding the following reagents in order to create a final volume of 20 µL (the final concentrations are noted in parentheses): Cas9 (2 µM), HEPES pH 7.5 (10 µM), KCl (115 µM), crRNA (12 µM), tracrRNA (40 µM), and the repair templates if needed (0.5 µM ssDNA or up to 350 ng/µL dsDNA).\n\t​NOTE: The efficiency of a Cas9-mediated DSB-templated repair is proportional to the concentration of the dsDNA repair construct; thus, the higher the concentration of the repair template, the more efficient the templated repair. However, an injection of mixes containing greater than 350 ng/µL of dsDNA has been shown to reduce the viability of the injected worms. Thus, it is best to use up to, but no more than 350 ng/µL of dsDNA in the mix to maximize the repair efficiency while minimizing its lethality.\n\t\nAdd multiple crRNAs to target multiple loci simultaneously, as needed for the co-CRISPR/co-conversion screening approach described in step 5.4. When adding more than one crRNA, add each sequentially to the master mix.\n\t\t​NOTE: The amount of each crRNA does not need to be the same, and even doubling the total concentration of crRNAs in the master mix without changing the concentration of Cas9 does not appear to interfere with the frequency of mutagenesis at a specific locus. Examples are described in detail in Paix et al.56.\nMix by pipetting and spin the RNP solution at 16,000 x g for 5 s to ensure that the solution is collected at the bottom of the tube.\nIncubate the solution at 37 °C for 15 m.\nCentrifuge the sample at 16,000 x g for 1 min to pellet any particulates that could clog the thin-bored microinjection needle. Use the supernatant in the subsequent steps.",
    "Skip to step 4 for the remainder of the C. elegans protocol.\nRNP prep for P. hawaiensis editing: Prepare single-use Cas9 aliquots by diluting them with nuclease-free water and phenol red (for visualizing injections) to a final concentration of 6.25 µM of Cas9 and 0.15% phenol red.\nAssemble the RNP complex by mixing a 2-5x molar excess of gRNA to the Cas9 protein in a total volume of 6 µl. Add 12 pmol of Cas9 to gRNA, bringing the final Cas9 concentration to 2 µM, gRNA concentration to 4 - 8 µM, and phenol red concentration to 0.05%.\nIncubate the mixture at room temperature for 10 min to complex the RNP.\nSkip to step 6 for the next instructions in the P. hawaiensis editingprotocol.\n2. Cell Culture and Preparation\nNOTE: Perform steps 2.1.1 to 3.3.3 in a biological safety cabinet.\nPurchase cryopreserved human mobilized peripheral blood CD34+ HSPCs from a vendor.\nThaw ~1 x106 HSPCs in a 37 °C water bath for 3 min and transfer them to a 15 mL conical tube. Add 10 mL of a serum-free expansion medium from a commercial source and spin the mixture at 100 x g for 10 min. Remove the supernatant and resuspend the cells in 2 mL of supplemented SFEM. Plate the cells in 6-well plates and culture them in a 37 °C incubator for 24-48 h prior to the RNP electroporation.\nCount the cells with a hemocytometer and transfer the total number of HSPCs needed (150,000-200,000 HSPCs per cuvette to be electroporated) to a centrifuge tube.\nSpin the tube at 100 x g for 10 min to pellet the cells.\nPurchase human primary CD4+ T cells from a vendor or isolate them from human whole blood by the density gradient centrifugation29.",
    "Prior to the T cell activation, pre-coat 48-well culture plates with αCD3 (UCHT1) and αCD28 (CD28.2). Coat the plates with 500 µL of 10 µg/mL αCD3 and 10 µg/mL αCD28 in PBS for at least 2 h at 37 °C.\n\t\tNOTE: For some loci, NHEJ can be achieved without pre-stimulation, but including this step maximizes its efficiency.\nCulture the T cells for 48 h at 37 °C on αCD3/αCD28 antibody-bound plates in a RPMI complete medium [RPMI-1640 supplemented with 5 mM of HEPES, 2 mM of commercial alternative to L-Glutamine, 50 µg/mL of penicillin/streptomycin, 50 µM of 2-mercaptoethanol, 5 mM of non-essential amino acids, 5 mM of sodium pyruvate, and 10% (vol/vol) FBS]. Culture the T cells at a density of 2,000,000 T cells in 500 µL of media per well of a 48-well plate.\nCount the T cells using a hemocytometer and transfer the total number of T cells necessary for the electroporation experiment (100,000-1,000,000 T cells per cuvette to be­­­ electroporated) to a centrifuge tube.\nSpin the tube at 90 x g for 8 min to pellet the cells. If the cells have been density gradient-separated within 2 days, spin them at 200 x g for 8 min.\nFor both cell types, aspirate the supernatant with a pipette/vacuum, removing any bubbles.\nGently resuspend the cells with 20 µL of electroporation buffer per cuvette.\nAdd 20 µL of the cells (150,000-200,000 HSPCs or 100,000-1,000,000 T cells) to each cuvette, which already contains 10 µL of the RNP, and mix well by pipetting up and down without creating bubbles.\n3. RNP Electroporation\nElectroporate the cuvettes after placing them in a nucleofector. For the HSPCs, use the pulse code ER100. For the T cells, use the pulse code EH-115.",
    "HSPCs only: Add 100 µL of a supplemented SFEM medium (warmed to 37 °C) to each cuvette immediately after electroporation and let the cells recover for 10-15 min.\nTransfer the cells to culture them in a 96-well round-bottom plate and add an additional 100 µL of the supplemented SFEM medium for 24 h.\nChange them to a fresh supplemented SFEM medium and incubate them for an additional 24 - 72 h.\nRemove the cells for genotyping them 48-96 h post-electroporation. Spin the cells at 300 x g for 5 min and remove the supernatant before beginning the DNA extraction (step 8.2).\nT cells only: Add 80 µL of RPMI complete culture media pre-warmed to 37 °C from the reservoir to each cuvette or well, using a multi-channel pipette (if necessary).\nIncubate them at 37 °C for 15 min.\nAdd the appropriate media, antibodies, cytokines, etc. to the destination plate(s) and pre-warm them in a 37 °C incubator.\nTransfer 107 µL of the electroporated cells from the wells to a round-bottom 96-well plate using a multi-channel pipette (if necessary).\nFor information on assessing the editing outcomes, skip to step 8.\n4. C. elegans Preparation\n1 day prior to microinjection: Prepare the agarose pads for the microinjection.\nMake a 3% (w/v) agarose solution in water by adding agarose to water and bringing the solution to a boil on a hot plate or in a microwave.\nArrange 24 mm x 50 mm x 1.5 mm cover glass slides on a table and use a glass Pasteur pipette to place a small (~15 µL) drop of agarose solution onto the slide. Quickly flatten the agarose drop by placing another coverslip on top. Allow the agarose to solidify and then remove one of the coverslips.",
    "Leave the agarose-coated coverslip face-up on a tabletop overnight to dry. After 24 h, store the agarose pads in a clean, dry container.\n\t\tNOTE: These can be used indefinitely.\nPull the microinjection needles: using borosilicate glass capillaries with filaments (outer diameter 1.0 mm and inner diameter 0.58 mm), pull the needles based on Mello and Fire57 and other resources58. The needles can be used immediately or can be stored in a clean, dry container, braced by clay supports.\nFor the maintenance of the worms, prepare a Nematode Growth Media (NGM) agar poured into Petri plates and spotted with OP50 bacteria (for protocols on standard C. elegans maintenance and recipes for growth media, see Stiernagle59).\nStage the worms for microinjection: 12-24 h prior to the microinjection, pick L4-staged hermaphrodites to a new NG-agar plate with OP50 bacteria and incubate them overnight at 20 °C. For each Cas9 target/injection mix, pick ~30 worms to the plate.\nDay of microinjection: Load the pulled microinjection needle with the RNP solution supernatant prepared in step 1.5.\nPipette the supernatant from step 1.5.4 into a pulled capillary pipette and backfill the solution from the capillary pipette into the prepared microinjection needle (generally loading less than 0.1 µL).\nMount the loaded needle onto the microinjection apparatus attached to a micromanipulator. Set the injection apparatus pressure to 250 kPa and the balance pressure to 25 kPa.\nBreak back the loaded needle tip to generate a sharp needle edge. Place a 15 mm x 15 mm x 1.5 mm square coverslip on the top of a 24 mm x 50 mm x 1.5 mm coverslip.\nOverlay one edge of the square coverslip with halocarbon oil 700.\nPosition the needle in the oil, at the edge of the 15 mm square coverslip.",
    "Using a hand to guide the microscope stage and coverslip, brush the slide up and along the edge of the needle while depressing the injection pedal/button. Break the needle tip back, increasing the flow of the liquid out of the needle. Achieve an optimal flow rate by making the injection mix flow up along the edge of the needle, forming ~1 bubble/s.\nConfirm that the L4 worms picked 12-24 h prior to microinjection are developmentally staged young adults on the day of injection. Pick the young adult worms to an NG-agar plate that lacks OP50 bacteria and allow them to crawl around for 5 min. This reduces the quantity of bacteria transferred to the injection pad, minimizing needle clogs.\nPlace an agarose injection pad/coverslip onto a dissection scope. Using a worm pick, lay a small track of halocarbon oil along one edge of the pad.\nUsing the worm pick coated in oil, lift several worms off the NG-agar plate and into the track of oil. With a fine hair attached to a pipette, such as an eyelash or cat whisker, position the worms in parallel, gently pushing the worms into the agarose pad. Until comfortable with the microinjection procedure, only mount and inject one worm at a time.\n\t​NOTE: The dry agarose will wick the moisture from the worms, causing them to adhere to the pad. Consequently, one must work quickly as the worms can desiccate.\n\t\nOnce in position and attached to the pad, overlay the worms with another few drops of halocarbon oil (~20 µL) from the tip of the worm pick.\n5. C. elegans Gonad Microinjection with RNPs and Post-injection Care\nNOTE: The microinjection protocol is adapted from Mello and Fire57and described in detail elsewhere60,61.",
    "Place the coverslip with the mounted worms onto the injection microscope. Under a low magnification (5X objective, 10X ocular), position the worms perpendicular to the injection needle.\nSwitch to a high magnification (40X objective, 10X ocular), reposition the needle adjacent to the gonad arm corresponding to the region near the nuclei in mid- to late-pachytene.\nUsing the micromanipulator, move the needle against the worm, depressing the cuticle slightly. Then, with one hand, tap the side of the microscope stage to jolt the needle through the cuticle. Depress the injection pedal/button and slowly fill the gonad arm with the injection mix and remove the needle.\nRepeat this step with the other gonad arm.\nOnce the worms are injected, remove the coverslip/agarose pad and place it under a dissecting microscope.\nUsing a pulled capillary pipette, displace the oil from the worms by pipetting an M9 buffer over them. Perform this treatment to release the worms from the agar.\nAfter 10 min, when the worms are thrashing around in the buffer, move them to an NG-agar plate with OP50 bacteria using the pulled capillary pipette. Place the plate at 20 °C for 2-3 h until the worms have recovered and are moving around.\nOnce recovered, individually transfer the worms to NG-agar plates with OP50 and transfer the plates to a 25 °C incubator.\nAllow the P0-injected worms to grow and lay progeny for 3 days. Screen the F1 offspring.\nIf using co-CRISPR or co-conversion62,63,64,65, then select the candidate worms for screening based on whether they have the mutant phenotype of the reference gene. Individually transfer these marked worms to new NG-agar plates with OP50 and allow them to lay F2 progeny at 20 °C.",
    "NOTE: The phenotype used for a co-CRISPR screening or selection should provide an early estimate for the success of Cas9 editing.\nIf the co-CRISPR phenotype is not present, microinject a positive control plasmid to assist in improving the microinjection efficiency.\n\t\tNOTE: For instance, including a plasmid in the injection mix that encodes mCherry-tagged MYO-2 will help assess the injection efficiency. Worms successfully injected with pCFJ90 will have some offspring with fluorescent pharynxes.\nExamine the F1 worms for the presence of the desired edits. Pick the F1 mother to an individual well of a 96-well plate, lyse her, and examine her DNA by either insert-specific PCR amplification, DNA sequence analysis, or surveyor nuclease assay (CEL-1)66.\n\tNOTE: These assays can be performed when using a co-CRISPR/co-conversion or other screening or selection regimes65,66,67,68.\nFor information on assessing the editing outcomes, skip to step 8.\n6. P. hawaiensis Preparation\n1 day prior to the microinjection, enrich for the early embryos by setting up a 'pair tank' the night before; newly separated females will contain freshly-fertilized embryos. See Rehm et al.69 for details.\nOn the day of microinjection, collect the single-cell Parhyale embryos (0-4 h post-fertilization) by anesthetizing gravid females with 0.02% clove oil in seawater and gently scraping the embryos out of her ventral brood pouch using a flame-pulled and rounded glass pipette and a dull pair of #3 forceps.\n7. P. hawaiensis Embryo Microinjection with RNPs and Post-injection Care\nBackfill a pulled capillary tube with approximately 1 µL of the RNP injection mix described above.\nUse compressed nitrogen to microinject each embryo as described in Rehm et al.69.",
    "Inject the Parhyale embryos under a dissecting microscope using a microinjector and a micromanipulator. Load 1.5 µL of the injection mix into the back of a pulled capillary tube (4 inches-1.0 mm with filaments, pulled using a micropipette pulling apparatus) using a microloader pipette tip.\nSet up the needle on the injection apparatus and break the tip of the needle (a very small amount) using a pair of forceps under the dissecting scope. Calibrate the volume delivered by injecting into halocarbon oil 700 and measuring the diameter of the bubble.\nCut a 'trough' out of the curing agent using a razor blade. Fill it halfway with filter-sterilized sea water, and line the Parhyale embryos up in the trough to stabilize.\nInject the embryos using the microinjection setup, stabilizing each embryo with a pair of forceps during the injection. After injection, use a glass transfer pipette to transfer the embryos over to a fresh 60 mm culture dish filled halfway with filter-sterilized sea water.\nIf the first division has already occurred to form a 2-cell embryo (4-6 h post-fertilization), generate fully-mutant animals by injecting both blastomeres. To ensure a total cleavage of the 2-cell stage, co-inject the blastomeres with FITC or TRITC dextran and observe that the signal is restricted to a single blastomere under a fluorescent dissecting scope after the injection.\nAlternatively, generate 'half-mutant' animals by injecting just one of the two blastomeres at the 2-cell stage (roughly divided left-right depending on the tissue and position along the A-P axis).\nInject one cell in an 8-cell embryo (7.5-9 h post-fertilization) to restrict the editing to a single germ layer. See Gerberding et al.70 for a map of early blastomere lineages.",
    "Incubate the embryos in 60 mm culture dishes (no more than 25 per dish), filled halfway with filter-sterilized seawater, 'pre-oxygenated' using an aquarium bubbler or by shaking vigorously.\nPlace the dishes of embryos in a loosely-sealed plasticware lined with wet paper towels to maintain humidity and place them in a 26 °C incubator with a 12 h light-dark cycle.\nTransfer the surviving embryos to clean seawater dishes every few days.\n\t\t​NOTE: Embryos may be cultured at room temperature, although they will develop much more slowly.\nDissect and fix the embryos at various stages for an expression analysis by in situ hybridization or antibody staining (see Browne et al.71 for a staging guide, and additional references for dissection and fixation72, in situ hybridization73, and antibody staining74).\nMake dissection needles by threading a bent piece of tungsten wire approximately 0.5 in in length into the end of an insulin needle. Sharpen the needle in sodium hydroxide under a current. Use a 1 mL syringe as the handle of the dissection needle.\nFill one well of a 3-well glass dish halfway with a freshly-made solution of 9 parts PEM Buffer (0.1 M of PIPES pH 6.95, 2 mM of EGTA, 1 mM of MgSO4), 1-part 10x PBS, and 1 part 32% PFA. Place 3-5 embryos into the dish and poke a small hole into each embryo, using a sharp tungsten needle to poke and a slightly dulled one to stabilize, allowing the yolk to flow out and the fixative to run in.",
    "Using a pair of sharpened tungsten needles, gently tease away the outer two membranes surrounding the Parhyale embryo. Dissect them in fixative to make the embryos more robust but work quickly to keep the membrane from becoming fixed to the embryo, which makes membrane removal more difficult. Allow the embryos to fix for a total of 15-20 min. for antibody staining or 40-50 min for in situ hybridization.\nImage live hatchlings and analyze them for morphological and behavioral phenotypes or fix and stain them for more detailed analyses. Raise the hatchlings to sexual maturity in 2-3 months to establish knockout and transgenic lines (see Kontarakis and Pavlopoulos75 for hatchling care and other useful details).\n8. Assessing Editing Outcomes\nIf applicable, look for a visual or functional phenotype in the edited cells or organisms.\n\tNOTE: This process will vary widely by application, and some examples are described at the end of their relevant protocol steps above. After correcting the sickle cell mutation in HSPCs, analyze the hemoglobin production by differentiated erythroblasts using HPLC (Figure 1A). A knockout of the IL-2 receptor gene in T cells can be confirmed by surface staining and flow cytometry (Figure 1B). To assess C. elegans and P. hawaiensis phenotypes, observe the animal morphology and behavior under a light or fluorescent microscope (Figures 1C and 1D).\nTo determine the efficiency and type of the genomic edits generated, lyse the pools of edited cells and extract their genomic DNA using a commercial extraction kit21.\nFor a quick estimation of indel formation, PCR-amplify at least 200 base pairs around the cut site and perform a T7 endonuclease1 (T7E1)76 or surveyor (CEL-1 nuclease) assay77.",
    "If an indel formation at the Cas9-cut site or successful HDR will create or remove a known restriction site, consider using a restriction enzyme digestion to estimate the editing efficiency6. The restriction fragment length polymorphism (RFLP) assay can be a convenient way to check the efficiency if it happens to be available.\nFor an accurate quantification of the editing efficiency and determination of predominant editing outcomes, send the PCR amplicon for a standard Sanger sequencing with both forward and reverse primers.\n\t\tNOTE: If analyzing a single clone or organism, the analysis of Sanger results is simple, as demonstrated in Figure 2A. If analyzing a pool of cells, then analyze the chromatograms with the online tool78, as shown in Figure 2B.\nFor a full quantification and sequences of editing outcomes, perform deep sequencing27,54, as depicted in Figure 2C.\nTo assess a particular set of off-target changes, PCR-amplify the predicted off-target sites and send them for NGS. To enable the detection of chromosomal translocations, perform GUIDE-seq79 or high-throughput, genome-wide translocation sequencing (HTGTS)80. For a complete picture of the off-target edits in a clonal population, perform whole-genome sequencing (WGS)81,82,83.\n\t\tNOTE: There are a variety of methods for quantifying on- and off-target genome edits, explained further in various review articles84,85,86."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}