{
  "id": 9683,
  "origin_website": "Jove",
  "title": "Lateral Fluid Percussion: Model of Traumatic Brain Injury in Mice",
  "procedures": [
    "1. Craniectomy\nA sterile surgical site is prepared including a stereotaxic alignment instrument (Kopf Instruments) for mice with a mouse gas anesthesia head holder (Kopf Instruments) connected to an anesthesia machine with O2 flush (Parkland Scientific) to allow for continuous inhalation of isoflurane during surgery. A warming pad kept at 37°C is positioned under the mouse during surgery. A surgical microscope and light source is needed. The experimenter should wear a lab coat, surgical mask, foot covering, gloves, and head covering. All tools and materials that contact the surgical site should be sterilized.\nAn injury hub, consisting of the female end of a Luer-lok, is created by cutting off the metal end of a 20 g 1 ½\" needle (Becton Dickinson) with a razor blade. The hub should be cut with a slight bias and have an approximately 3mm inner diameter opening. The trephine (see step 1.10) can be used to measure and fabricate an injury hub of the correct diameter. One hub is required per animal. The hub will be attached to the skull and connected to the LFP device to deliver the pulse of pressure.\nSolid nylon cord (1.7 mm diameter, e.g. weed trimmer line) is cut into ~1 mm thick disks using a razor blade. Again, one disk is required per animal. This is used to stabilize the trephine while performing the craniectomy (see step 1.10).",
    "Mice can be of any strain and age (we primarily use C57BL/6 ages 1 - 9 months). The mouse is weighed and anesthetized in a small induction chamber (pre-filled with 4-5% isoflurane in 100% O2) for at least 1 minute. For preemptive analgesia, an injection of buprenorphrine (0.1 mg/kg) is given intraperitoneally and the mouse is placed back into the chamber for another minute. Analgesic regimen should be confirmed by consultation with local animal use and care committee.\nThe hair on the top of the mouse's head is trimmed as close to the skin as possible. The mouse is positioned in a stereotaxic alignment instrument fitted with bite-plated designed to administer volatile gas anesthesia (Kopf Instruments). The level of the isoflurane gas is reduced to 2% or to effect. Breathing rate is monitored visually during the surgery. Other physiological parameters such as blood gases (pO2, pCO2), blood pH or blood pressure can be measured using appropriate equipment during the procedure.\nArtificial tears lubricant eye ointment is put on the eyes of the mouse using a cotton applicator to keep them from drying. Povidone-iodine is applied to the skin between the eyes and neck with a cotton applicator followed by 70% alcohol. The application of povidone-iodine and alcohol is repeated for a total of 3 times.\nA midline scalp incision is made from the eyes to the neck using a scalpel (#15 blade) and the skin retracted with a small bulldog clamps (Fine Science Tools #18050-28) to expose the skull and provide a clear surgical field. The bulldog clamps hang off the lateral edges of the skull.",
    "Topical anesthetic bupivacaine (0.025% in saline) is applied to the skull with a cotton applicator and the fascia is scraped from the skull with tip of dental tool or bone scraper (e.g., Fine Science Tools, #10075-16).\nA permanent marker is used to mark the skull halfway between bregma and lambda and between the sagittal suture and lateral ridge over the right hemisphere (~2 mm right of midline). A drop of Loctite cyanoacrylate glue (Loctite Tak Pak 454) is put in a plastic weigh boat and side grasping forceps (Fine Science Tools, Dumont #6) are used to dip a disk of weed solid nylon cord (see 1.3 above) into the glue and then press the disk on the mark on the skull. One to two drops of the Loctite Accelerator is delivered on top of the disk using a 1ml syringe and 26 3/8 G needle to cause the hardening of the glue. Test adherence of the disc to the skull before proceeding.",
    "Place a 3 mm outer diameter trephine (Research Instrumentation Shop, University of Pennsylvania) over the disk and spin clockwise until you have cut through skull. Check the trephine's progress frequently to avoid drilling too far into the skull and breaching the dura. There will be a thinning of the skull around the perimeter of the disk and the skull flap will feel loose when pressed lightly. Place the dental tool parallel/horizontal to the skull's surface to pry under the skull and lift the bone flap up. Detach the bone from the skull with forceps. If there is a small amount of bleeding, without compromise of the dura, use a cotton applicator to apply pressure until the bleeding stops and prevent bone dust from getting onto the dura. However, if there is a breach in the dura such that herniation is visible, the animal should be eliminated from the experiment by humane euthanasia. This step requires sufficient practice to achieve the surgical skill required.\nUsing forceps, maintain the injury hub in position over the craniectomy in the skull so that the bias of the hub is aligned with the curvature of the skull (i.e. the longer edge of the hub lies near the lateral ridge of the skull). Meanwhile, using a wooden stick, cut at an angle with a razor blade to have a sharp tip, apply super glue gel around the outside edges of the hub with the opposite hand and stabilize the hub until it is affixed upright over the hole. Care must be taken not to get glue on top of the dura. Glue on the dura will cause an attenuation of the injury.",
    "Using a small paper cup, mix methyl-methacrylate dental acrylic (Jet Acrylic Liquid with Perm Reline/Repair Resin, Butler Schein) to create a viscous solution. Use a 1 cc syringe with no needle attached to apply cement all around the injury hub. The cement should cover the bottom 2 mm of the injury hub as well as the surrounding exposed skull. The skull sutures are sealed with the cement to ensure that the fluid bolus from the injury remains within the cranial cavity.\nFill the hub with sterile 0.9% NaCl (saline) using a syringe and blunted needle. The saline will keep the dura moist during the recovery phase. In addition, if the injury hub does not stay filled, that will indicate a leak in the hub connection to the skull and a new hub should be attached. The mouse should be given a 0.25 ml injection of sterile saline IP, removed from the stereotaxic alignment instrument and placed in an empty cage with no wire bar lid on a warming plate. Place some hydragel on the bottom of the cage and allow the mice to recover for 1-2 hours.\n2. Induction of injury",
    "Turn on the oscilloscope (Tektronix TDS 1001B, Two Channel Digi Storage Oscilloscope 40 mHz, 500Ms.s) and amplifier (Trauma Inducer Pressure Transducer Amplifier) that is connected to the LFP device. Confirm that the LFP device (Custom Design and Fabrication, Virginia Commonwealth University) and the high-pressure tubing (length 41cm, volume 2ml, Baxter #2C5643) connected to it are filled with sterile water and free of air bubbles. At the end of the tubing is a male Luer-lok piece. With the Luer-lok end of the tubing closed, deliver test pulses by releasing the pendulum. The device should be primed by delivering approximately 10 test pulses. Confirm that pendulum gives smooth signal on the oscilloscope and amplifier. A noisy signal indicates air in the system that must be removed prior to delivering the injury pulse. The duration of the pulse should be about 20 msec. The transducer amplifier supplied with the LFP device is calibrated such that 10 mV = 1.0 pounds per square inch (PSI). One atmosphere (ATM) = 14.7 PSI. Injury pressures delivered are typically in the range of 0.9 - 2.1 atmospheres to produce a range of righting reflex times and an increasing mortality associated with pulmonary edema. Mild injury is considered a righting reflex time of 2 - 4 min and a 0 - 5% mortality rate. Moderate injury is considered a righting reflex time of 6 - 10 min and a 10 - 20 % mortality rate. If necessary, adjust the angle of pendulum to increase or decrease the intensity of the pulse. The angle of the pendulum's starting position is approximately 10 degrees. After adjusting the LFP device, be sure to open the Luer-Lok end of the tubing.",
    "The mouse is placed in the 4-5 % isoflurane anesthesia chamber (pre-charged) until a surgical plane of anesthesia is reached. The mouse is placed on a platform next to the LFP device and the hub is filled with sterile saline. The tubing of the LFP device with a male Luer-lok is attached to the female Luer-lok fitting of the hub. The animal is placed on its side and once a normal breathing pattern resumes but prior to the animal regaining complete consciousness (~2 min), the pendulum of the LFP device is released to cause a single pulse of injury. It is important to not induce the injury while the animal is too anesthetized as it could cause respiratory failure and death. The exact pressure of the pulse should be recorded. Uninjured, sham animals undergo all of the same procedures with the exception of the actual fluid pulse to induce injury.\nThe animal should be immediately removed from the LFP device and placed on its back to monitor the righting reflex time. After the mouse has righted itself, it is then briefly anesthetized again and the cement and hub removed together from the skull by hand.  The scalp is then closed with Vetbond tissue adhesive (3M), suture or staples. Any herniation of the dura or occlusion of the hub is noted. An occluded hub will produce an attenuated injury of unknown magnitude. The animal is placed back in the cage on a warming pad until ambulatory and then returned to its home cage.\n3. Assessment of motor, cognitive and histological outcomes",
    "The motor deficits caused by LFP can be determined by using the rotarod test, an indicator of integrated vestibulomotor and sensorimotor function 21. All animals must be tested prior to injury to determine a baseline reading and to acclimate the mice to the paradigm. Mice are trained on the rotarod device 3 times per day with 1-hour intertrial intervals for the two days prior to the injury. The latency to balance on a 36-mm outer diameter, rotating rod, which has a rubber surface is measured. The velocity increases from 4 to 40 rpm over a 180 sec interval. Each trial ends when the animal falls off the rotarod.\nAt different time points following injury (typically 1, 7 and 21 days), the mice are again tested on the rotarod device. Evaluation of rotarod tests after the injury is based on the individual scores relative to their baseline latencies 22. The average latency to fall of injured mice is compared to that of sham mice.",
    "Cognitive function following LFP can be tested on a separate set of mice using the Morris Water Maze (MWM), a sensitive measure of posttraumatic spatial learning and working memory in rodents 23. Mice are acclimated to the paradigm and tested for baseline response using a visible platform test 4 days prior to injury. A white circular pool (1 m diameter) is filled with water and non-toxic white paint. The platform is made visible using a flag or marker and no visual cues are on the walls. Over 4 trials, the mouse is placed in the quadrant opposite that of the visible platform, and the latency to find the platform is measured. Maximum trial time is 60 sec and the mouse remains or is placed on the platform for 15 sec at the end of each trial. The intertrial interval is 5 min during which the mouse is warmed on a heating pad. The platform is moved to a different quadrant for each trial and four trials are performed.",
    "To assess learning, mice are trained on the MWM using a hidden platform fixed in one of 4 quadrants at various time points following injury (typically 1, 7 and 21 days). Black and white cues are placed on the walls. The quadrant in which the mouse is placed is pseudorandomly varied throughout training and the time to locate the platform is recorded. Maximum trial time is 60 sec and the mouse remains or is placed on the platform for 15 sec and warmed for 5 min between trials. Mice are subjected to 8 trials/day for 3 consecutive days. To assess memory retention, the animals are subjected to a 60 sec probe trial the day following the last training. During the probe trial, the platform is removed to determine the time spent and distance swum in the quadrant where the platform used to be. Finally, a visible platform test is done to rule out possible motor and visual deficits that developed post-injury.\nTo determine the histological consequences of LFP injury, tissue is fixed by intracardial perfusion in 0.9% NaCl followed by 4% paraformaldehyde at desired time points after injury. Tissue is postfixed overnight at 4°C and then cryoprotected in 10% and 30% sucrose and embedding solution. Frozen serial sections are cut on a cryostat and processed using various immuohistochemical and histological techniques.\n4. Representative Results:",
    "The injury induced by the LFP device is reproducible from animal to animal, particularly with sufficient surgical training. To maintain the consistency of the injury, the amount of pressure delivered to the dura by the device is monitored. The pendulum strikes a water-filled acrylic cylinder with high-pressure tubing and Luer-lok fitting which is connected to the injury hub affixed to the craniectomy site on the animal (Figure 1A). For a mild to moderate injury, the angle of the pendulum is set to generate a pressure ranging from 0.9 - 2.1 atm and an oscilloscope connected to an amplifier is used to visualize the pressure pulse (Figure 1B). Injury produces a range of righting reflex times and an increasing mortality associated with pulmonary edema. Mild injury is considered a righting reflex time of 2 - 4 min and a 0 - 5% mortality rate. Moderate injury is considered a righting reflex time of 6 - 10 min and a 10 - 20 % mortality rate. Furthermore, mice subjected to LFP may exhibit tonic posturing that may be indicative of seizure. Seizure is often associated with a compromised dura. Together, these findings suggest that the injury is causing neurological damage. Sham animals are connected to the LFP device but the pendulum is not released.",
    "To visualize the damage induced by LFP, we have performed immunocytochemistry using antibodies which recognize astrocytes and macrophages both of which are cell types associated with a response to injury. Glial Fibrillary Acidic Protein (GFAP) staining reveals increased gliosis throughout the cortex in the region of injury whereas sham mice do not display increased astrocytosis in the equivalent site below the craniectomy (Figure 2A, B). Similarly, MAC1 staining demonstrates more macrophages surrounding the site of injury compared to mice subjected to sham surgery. In addition, there is frequently physical damage to the cortical tissue visible in mice subjected to LFP but not in sham mice (Figure 2C, D).",
    "Behavioral testing following mild LFP can be used to assess both cognitive and motor outcomes. MWM is used to determine effects on learning and memory. Using visual cues in the testing room, sham mice rapidly became more efficient at locating the platform with each subsequent day of training in the water maze. Mice subjected to mild LFP take longer to locate the hidden platform on the first two days of testing relative to sham mice but then appear to learn the task by the third day (Figure 3A). These findings suggest that the injury reduces the rate at which the mice can acquire spatial learning. To determine the effect of injury on memory retention, a probe trial is performed 1 day after the last training session. Sham mice spend more time in the target quadrant compared to the mice subjected to mild LFP suggesting that the injury has affected the ability of the mice to recall the location of where the platform used to reside (Figure 3B). To assess locomotor function, mice are tested on the rotarod device. Mice subjected to mild LFP have shorter average latency to fall compared to the sham mice at 1, 7 and 21 days post injury (dpi) (Figure 3C). These data suggest that injured mice have impaired integrated vestibulomotor and sensorimotor function.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3063/3063fig1.jpg\nFigure 1. LFP device and a representative trace from the oscilloscope obtained during injury. A) The components of the LFP device are: the pendulum fixed to a stand and set at an angle predetermined to deliver the desired force, a water filled acrylic cylinder with high-pressure tubing and a male Luer-lok fitting attached, an amplifier, and an oscilloscope. B) Representative trace of pressure pulse from oscilloscope. The peak-to-peak value is 2.16 volts indicating a pressure of 1.47 atm.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3063/3063fig2.jpg",
    "Figure 2. Enhanced gliosis and an inflammatory response following LFP demonstrates the extent of injury. Frozen transverse sections (20μm) through the brain of a mouse subjected to sham surgery (A, C) or LFP injury (B, D) 7 days post injury (dpi). Cortical images are taken at the epicenter of the craniectomy. (A, B) Tissue is stained with an antibody to identify astrocytes. Glial Fibrillary Acidic Protein (GFAP) antibody (MAB360, Chemicon, 1:400) reveals a higher number of astrocytes throughout the cortex of the mouse subjected to LFP injury (arrows) compared to sham surgery. Secondary antibody is goat anti-mouse 594 (1:1000). (C. D) Tissue is stained with an antibody to identify macrophages. MAC1 antibody (MAC1-alpha chain CD11b, BD Biosciences, 1:50) reveals more macrophges and/or activated microglia around the site of injury in the cortex (arrows) compared to sham surgery. Secondary antibody is goat anti rat CY3 (1:50). Scale bar = 200μm in A and B, 100μm in C and D.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3063/3063fig3.jpg",
    "Figure 3. Behavioral testing following mild LFP demonstrates deficits in injured compared to sham mice. A) Mice subjected to mild LFP take longer to learn the task of finding the platform in the MWM than sham mice. Sham vs LFP (ave seconds ± SEM) 1 day 34.21 ± 3.02 vs 38.64 ± 2.63; 2 day 24.52 ± 2.84 vs 27.21 ± 2.11; 3 day 22.47 ± 2.00 vs 22.08 ± 2.52 (1 dpi, n = 9 sham, 10 LFP). B) Mice subjected to mild LFP spend less time in the target quadrant during the probe trial 24 hr after the last training in the MWM relative to sham mice (21 dpi, n = 10). C) Mice subjected to mild LFP fall off the rotarod device sooner than sham mice (1, 7, and 21 dpi, n = 5 sham, 8 LFP). Error bars represent SE."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}