{
  "id": 8479,
  "origin_website": "Jove",
  "title": "3D Modeling of Dendritic Spines with Synaptic Plasticity",
  "procedures": [
    "NOTE: Please see the Supplementary file 1 for the glossary of terms used in this protocol.\n1. Install Blender, CellBlender, and MCell\nNOTE: This protocol requires installation of MCell, Blender, and Cell Blender.\nDownload and install the software on the MCell homepage (https://mcell.org/tutorials_iframe.html). Go to downloads on the top of the page and then follow the step-by-step instructions to download and install the software in the environment of choice (e.g., Linux, Mac OSX, or Windows).\n\tNOTE: All computational models and simulations described in this protocol were tested on a CellBlender 1.1 bundle that includes Blender 2.78 with MCell 3.4 and CellBlender 1.1. It worked also on Blender 2.79b. All these software programs are open access and do not require reprint permission to be used. The instructions for the construction and simulation of the model can change slightly from one version to another. Parts of this protocol have been adapted from Czech et al.16.\n2. Create a single dendritic spine\nNOTE: This procedure creates a mesh of a single dendritic spine with a spine head and a spine neck using a modified sphere.\nSet up Blender 3D view at the Main Panel.\n\t\nOpen Blender with CellBlender already installed. Press 5 on the keypad to change from Perspective to Orthogonal view and press 1 to change to front view. The perspective view has depth, but this is not needed now. Changing from Perspective to Orthogonal view allows better visualization of the mesh. Press Shift+C to center the cursor (Figure 1A).\nCreate the spine head.",
    "Press Shift+A to open the mesh palette. Select the Mesh and then select UV Sphere. A UV sphere is a mesh mapped to the 3D surface of a sphere. The UV sphere represents the spherical head of a mushroom dendritic spine. The software assumes the units of the UV sphere are micrometers.\nChange the parameters on the Add UV Sphere panel. Change Size to 0.25 and Rings to 32 (Figure 1B). Press + or – on the keypad to respectively zoom in and zoom out of the visualization of the mesh. Alternatively, use the scroll button in the mouse to zoom in and out (Figure 1C).\n\t\tNOTE: The parameter size scales the size of the original sphere and the parameter rings define the resolution of the mesh.\nMake the top of the head flat.\n\t\nPress Tab to switch Blender from the Object Mode, the standard object interaction mode, to Edit Mode. Work in Edit Mode for modifying the components of an existing mesh.\nOnce the created mesh has been automatically selected, press a to deselect the created mesh. Press z to make the mesh transparent, which helps in visualizing the parts that will be edited. Zoom in on the mesh. Press b to select the top ¾ of the sphere with the mouse (Figure 2A). Press delete, select vertices, and enter to remove the vertices (Figure 2B).\nPress b and select the top. Press e, s, 0, and enter to seal the top with the vertices still selected. Move the blue arrow down to align to the top of the spine head (Figure 2C). Press z to change to solid view (Figure 3A). Press 7 to change to top view.\n\t\tNOTE: The top of the sphere is made flat to model the PSD region of the spine head.",
    "To increase the mesh resolution at the top of the spine first select Tool and Knife. Cut a circle with the knife around the center of the top (Figure 3B). Select Tool and Loop Cut and Slide. Repeat this step four times to create four concentric circles around the center of the top (Figure 3C).\n\tNOTE: The concentric circles are used to add new voxels that will increase the resolution of the PSD.\nCreate the spine neck.\n\t\nPress a to deselect the mesh. Press 1 to change to the front view. Press z to make the mesh transparent. Press b and then select the bottom of the mesh (Figure 4A). Press delete and vertices (Figure 4B). Press b and select the bottom of the mesh (Figure 4C). Press e and z, -0.45 to create an extrusion (Figure 4D).\n\t\tNOTE: This creates an extrusion to the z axis position at -0.45 μm. Press a to deselect the whole mesh.\nPress b and select the bottom of the neck. Press e, s, and 0 to seal the bottom (Figure 4E). Press a to select the whole mesh.\nMake the mesh compatible with MCell.\n\t\nPress Crtl+T to triangulate the mesh. The mesh is transformed into a set of interconnected triangles. This is a required procedure to make the mesh compatible with MCell. Select Tool and Remove Doubles. Use the Remove Doubles tools to remove duplicated vertices, if any, that have the same coordinates or are very close to each other, to make the mesh compatible with MCell.\n\t\tNOTE: Double superposed vertices may have been accidentally created during the process of mesh creation and editing.",
    "Select Model Objects on the CellBlender panel. Change the name of the Active Object to spine and press + to create the object spine. On the CellBlender panel, select Mesh Analysis and then click on Analyze Mesh (Figure 4F). This procedure will analyze the properties of the created mesh, including the number of vertices, edges, faces, surface area, volume, and mesh topology.\n\t\tNOTE: The analysis will print the information in the Mesh Analysis Panel and it should be Watertight, Manifold, and Outward-Facing Normals. This step is required to ensure that the mesh will work on MCell. Otherwise, a step was probably missed. In this case, delete the mesh and start from step 2.1 again.\nPress z to visualize the solid view of the spine. Press File and Save to have a copy of your blender file with the spine on the disk.\n\t\tNOTE: The dimensions (i.e., length, diameter, size) of the meshes are in micrometers. See the glossary for the meaning of each keyboard shortcut.\n3. Creating a dendrite with multiple spines\nGenerate a spine as described previously in sections 2.1–2.6. Press a to deselect the spine. Type Shift+C to center the cursor.\nCreate a dendrite. Press Shift+A to open the mesh palette. Select Mesh and then Cylinder. Change the parameters on the Add Cylinder menu: Radius = 0.3 μm, Depth = 2 μm. Press Enter.\n\tNOTE: The parameters radius and depth are defined according to the geometric characteristics of the dendrite.\nInsert a spine in the dendrite.\n\t\nPress r and type 90 to rotate the cylinder 90° (Figure 5A). Use the blue arrow to drag the cylinder down to the bottom of the spine. Press 3 on the keypad to have a front view of the cylinder.",
    "Press z to make the mesh transparent. Use the mouse to move the blue normal arrow of the cylinder downwards to move the base of the spine to the interior of the cylinder (Figure 5B). Press a to deselect all objects.\nUse the right button of the mouse to select the dendrite (Figure 5C). Select Modifier on Blender panel (Figure 5D), select Add Modifier. Then select Boolean, select Operation Union, and select Object spine. Press Apply to create a joint mesh of the dendrite and the spine (Figure 5E). This operation creates a new mesh merging two meshes into a single one.\n\t\tNOTE: The new mesh will be the combined dendrite and spine. The isolated dendrite disappears when the different meshes are combined, but the isolated spine mesh remains overlapped with the new mesh and is used to generate multiple copies of the same spine. Delete all the isolated spines after finishing the mesh. It is critical to have a complete overlap between the spine neck and the dendrite, otherwise, the mesh will not be watertight.\nSet the dendrite object into the CellBlender environment.\n\t\nPress a to deselect the meshes. Right-click in the dendrite with the mouse to select the dendrite only. Select CellBlender, Model Objects, and change Active Object to Dendrite and press + to create the Dendrite object.\nInsert new spines in the dendrite.\n\t\nPress 1 to change to the side view of the cylinder. Use the mouse to select the mesh of the isolated spine. To insert more spines, follow step 3.3, changing the position and the angle to insert each one to obtain a physiological distribution.",
    "Make the mesh compatible with MCell. To do so, press Tab to go to edit mode. Press a to select the whole mesh. Press Crtl+T to triangulate the mesh. Select Tool on the Blender panel and select Remove Doubles.\nStylize the meshes.\n\t\nSmooth the mesh. Press Tab to change to object mode. Select Tool on the Blender panel and select Smooth. Select CellBlender, Model Objects, and select Add a Material.\nMake the mesh transparent by selecting Object Transparent and Material Transparent. Change alpha to 0.5 and enter to make the mesh partially transparent. Press z to change to solid view.\nConfirm whether the mesh is still compatible with MCell. To do so, select Mesh Analysis on the CellBlender panel to make sure that the mesh is still watertight, manifold mesh, and outward-facing normal.\nSave the blender file as dendrite_with_spines.blend.\n4. Define surface regions\nNOTE: This procedure creates the surface regions of the mesh that later will be used to set up how the regions interact with the molecules.\nOpen the file dendrite_with_spines in the Blender environment. To do so, select File, Open, dendrite_with_spines.blend, and Open Blender File.\nPrepare the mesh for defining the surface regions. To do so, press Tab to change to edit mode. Press z to change to transparent view (Viewport shading, wireframe). Press a to select the whole mesh of the dendrite with spines. Select Model Objects. Select Dendrite. Press t to hide the CellBlender panel and better visualize the whole mesh in the main panel.",
    "Use + and – on the keypad to zoom in and out or scroll with the mouse. This is required for better visualization of the top of the spines to select and define the surface regions. Press a to deselect the object. Press Tab to change to Edit Mode. Press t to show the CellBlender panel again.\nDefine the PSD surface region. To do so, press b and select the top of a dendritic spine with the mouse (Figure 6A,6B). Press + on Defined Surface Regions. Change the Region Name to PSD1 and click Assign (Figure 6C). Press a to deselect the object.\nDefine the extrasynaptic surface region. To do so, press b and select the region around the top of the dendritic spine with the mouse (Figure 6D). Repeat step 4.3 for the Region Name to Extra_syn1. Repeat the step 4.3 for the other spines to define the other regions of the mesh (PSD2, PSD3, PSD4, Extra_syn2, Extra_syn3, and Extra_syn4) (Figure 6F). Press a to deselect the object.\nDefine the surface regions of the ends of the dendrite. To do so, press b and select the left end of the dendrite. Change the Region Name to Left_end and click Assign. Press a to deselect the object. Press b and select the right end of the dendrite (Figure 6E). Change the Region Name to Right_end and click Assign.\n\tNOTE: Move the mesh to find the best position to select each Defined Region.\n5. Create molecules\nCreate AMPARs. To do so, select Molecules on the CellBlender Panel. Select + on Defined Molecules to insert a new molecule and change Name to AMPAR. Change Molecule Type to Surface Molecule and Diffusion Constant to 0.05e-8 cm2/s14 to define the diffusion constant of AMPARs in the membrane (Figure 7A).",
    "Create Anchors. To do so, select Molecules on the CellBlender Panel. Select + on Defined Molecules to insert a new molecule and change Name to anchor. Change Molecule Type to Surface Molecule and change Diffusion Constant to 0.001e-8 cm2/s14 to define the diffusion constant of anchors in the membrane (Figure 7A).\nTo create Anchors Bound to AMPARs, select Molecules on the CellBlender Panel. Select + on Defined Molecules to insert a new molecule. Change Name to anchor_AMPAR. Change Molecule Type to Surface Molecule. Change Diffusion Constant to 0.001e-8 cm2/s14.\nCreate the anchor_LTP and anchor_AMPAR_LTP. To do so, repeat step 5.2. Name the molecule anchor_LTP. Repeat step 5.3. Name the molecule anchor_AMPAR_LTP.\n\tNOTE: The anchor_LTP has a high affinity for AMPAR; thus, AMPARs increase in the synaptic regions.\nCreate the anchor_LTD and anchor_AMPAR_LTD. To create an anchor_LTD, repeat step 5.2. Name the molecule anchor_LTD. Repeat step 5.3. Name the molecule anchor_AMPAR_LTD.\n\tNOTE: The anchor_LTD has a low affinity for AMPAR; thus, AMPARs decrease in the synaptic region.\n6. Define surface classes\nNOTE: This procedure defines the classes with the properties that are associated with the surface regions. The extrasynaptic regions reflect the free anchors and anchors bound to AMPAR. The lateral ends of the dendrite reflect all the molecules.\nDefine the properties of the extrasynaptic regions.\n\t\nPress Tab to change to object mode. Select Surface Classes on the CellBlender Panel. Press + on the Surface Class to define a new surface class.\nMake the extrasynaptic region reflect the AMPAR bound to the anchor molecules.\n\t\tNOTE: This procedure will trap the anchors and everything bound to them within the synaptic region.",
    "Change Surface Class Name to reflective_extra_syn. Press + on reflective_extra_syn Properties to associate it with a molecule. Select Molecules | Single Molecule. Select anchor_AMPAR. Select Orientation = Ignore. Select Type = Reflective to make the region show the anchor_AMPAR molecules.\nRepeat step 6.1.2.1 for anchor_AMPAR_LTP and anchor_AMPAR_LTD.\nMake the extrasynaptic region reflect the anchors.\nPress + on reflective_extra_syn Properties to associate it with a molecule. Select Molecules | Single Molecule. Select anchor. Select Orientation = Ignore. Select Type = Reflective to make the region reflect the anchor molecules.\nRepeat step 6.1.3.1 for anchor_LTP and anchor_LTD.\nDefine the properties of the dendrite ends. To do so, press + on Surface Class to define a new surface class. Change Surface Class Name to reflective_ends. Press + on Properties to associate it with a molecule. Select Molecules | All Surface Molecules. Select Orientation | Ignore. Select Type | Reflective to make it reflect all surface molecules.\n7. Assign the created classes to each surface region\nNOTE: This step assigns the surface classes to the surface regions.\nAssign the properties of the ends of the dendrite.\nPress + to assign a surface class with a region. Select reflective_ends for Surface Class Name (Figure 7C). Select Dendrite for Object Name. Select Specified Region for Region Selection. Select Left_end for Region Name.\nRepeat step 7.1.1 for the Right_end (Figure 7D).\nAssign the properties of the extrasynaptic regions.\n\t\nPress + to assign a surface class with a region. Select reflective_extra_syn for Surface Class Name. Select Dendrite for Object Name. Select Specified Region for Region Selection. Select Extra_syn1 for Region Name.\nRepeat step 7.2.1 for Extra_syn2, Extra_syn3, and Extra_syn4.\n8. Place molecules on the mesh\nNOTE: This step places the AMPARs, anchors, and AMPAR bound to anchors on the mesh.",
    "To place AMPAR Molecules on the Mesh, select Molecule Placement on the CellBlender Panel. Press + on the Release/Placement Sites to create a new release site. Change Site Name to relAMPAR (Figure 7B). Select Molecule = AMPAR. Object/Region = Dendrite[ALL]-(Dendrite[Left_end]+Dendrite[Right_end]). Quantity to Release = 1,000.\nPlace anchor molecules on the Mesh.\n\t\nSelect Molecule Placement on the CellBlender Panel. Press + on the Release/Placement Sites to create a new release site. Change Site Name to rel_anchor_PSD1. Select Molecule anchor. Object/Region = Dendrite[PSD1]. Quantity to Release = 200.\nRepeat step 8.2.1 for PSD2, PSD3, and PSD4.\nPlace anchor_LTP Molecules on the Mesh. To do so, select Molecule Placement on the CellBlender Panel. Press + on the Release/Placement Sites to create a new release site. Change Site Name to rel_anchor_LTP_PSD1. Select Molecule = anchor_LTP. Object/Region = Dendrite[PSD1]. Quantity to Release = 0.\n\tNOTE: anchor_LTP is an anchor with high binding affinity for AMPARs.\nPlace anchor_LTD Molecules on the Mesh by repeating step 8.3 for anchor_LTD.\n\tNOTE: anchor_LTD is an anchor with low binding affinity for AMPARs.\n9. Create the chemical reactions\nCreating the reaction between anchor and AMPARs.\nSelect Reactions (Figure 7D) to create the reactions. Press + to include a new reaction. Reactants = anchor’ + AMPAR’. Reaction Type = <->. This defines a bidirectional reaction. Products = anchor_AMPAR’. Forward Rate = 0.03. Backward Rate = 0.05.\nCreate the reaction between ANCHOR_LTP and AMPARs. To do so, repeat step 9.1, but replace anchor with anchor_LTP, and use a Backward Rate = 0.005 to increase the affinity between the reactants.\nCreate the reaction between anchor_LTD and AMPARs and save the file. To do so, repeat step 9.2, but replace anchor with anchor_LTD, and use a Backward Rate = 0.5 to decrease the affinity between the reactants. Then Save the file.",
    "10. Plot the output of the model\nPlot anchors bound to AMPARs at the PSD1 during the basal condition. To do so, select Plot Output Settings. Press + to define the molecules. Select anchor_AMPAR on Molecule. Select dendrite on Object. Select PSD1 on Region. Repeat step 10.1 for all PSD regions.\n\tNOTE: It is useful to observe the basal number of trapped AMPARs to the PSD of each dendritic spine. The number of anchors bound to AMPARs can increase or decrease in comparison to the basal conditions during LTP and LTD.\nPlot anchors bound to AMPARs at the PSD1 during LTP. Do this by repeating step 10.1. Replace anchor_AMPAR with anchor_AMPAR_LTP, then plot anchors bound to AMPARs at the PSD1 during LTD and finally repeat step 10.1, but replace anchor_AMPAR_LTP with anchor_AMPAR_LTD.\n11. Run the simulations\nTo run the basal condition, select Run Simulation. Select Iterations = 30,000. Set Time Step = 1e-3 s. Press Export & Run. Wait until the simulation ends. It may take from minutes to hours.\n\tNOTE: In the basal condition, there is no release of anchor_LTP and rel_anchor_LTD molecules. Regarding the parameters of the simulation, the number of iterations needs to be long enough to be able to observe the diffusion of AMPARs from the dendrites and their anchoring at PSD. Small time-steps are more precise but slower to complete the simulation.\nSelect Reload Visualization Data. Select play animation to visualize the spatiotemporal results (Figure 8). Select Plot Output Settings. Press Plot.\n\tNOTE: The graphs generated by CellBlender are isolated time series of the selected chemical species. Third-party programs can be used to import the data saved from multiple simulations to create overlaid plots of several conditions (e.g., basal, LTP, LTD; see Figure 8).",
    "Run the homosynaptic potentiation condition (i.e., LTP; see Figure 8). To do so, select Molecule Placement on the CellBlender Panel. Select rel_anchor_LTP_PSD1 on the Release/Placement Sites.\nChange quantity to release = 200. Select rel_anchor_LTD_PSD1 on the Release/Placement Sites. Change quantity to release = 0. Select rel_anchor _PSD1 on the Release/Placement Sites. Change quantity to release = 0. Repeat steps 11.1–11.2.\nRun the homosynaptic depression condition (i.e., LTD; see Figure 8). To do so, Release 200 rel_anchor_LTD_PSD1 instead of rel_ANCHOR_LTP_PSD1. Set rel_anchor and rel_anchor_LTP_PSD1 to zero. Repeat steps 11.1–11.2.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}