{
  "id": 10280,
  "origin_website": "Jove",
  "title": "Manipulation of Single Neural Stem Cells and Neurons in Brain Slices using Robotic Microinjection",
  "procedures": [
    "All animal studies were conducted in accordance with German animal welfare legislation, and the necessary licenses were obtained from the regional Ethical Commission for Animal Experimentation of Dresden, Germany (Tierversuchskommission, Landesdirektion Dresden). Organotypic slices were prepared from E14.5 or E16.5 C57BL/6 mouse embryonic telencephalon (Janvier Labs).\n1. Installation of software\nFollow instructions to install the software from https://github.com/bsbrl/Autoinjector.\n2. Preparation of reagents and pipettes\nAgarose: Prepare 3% agarose by separately dissolving 3 g of wide range agarose and 3 g low-melting point agarose in 100 mL of cell culture-grade PBS in two separate 200 mL glass bottles, respectively. Store at room temperature for up to 3 months.\nTyrode solution: Dissolve 1 g of sodium bicarbonate and Tyrode’s salt (use the content of the entire bottle) and 13 mL of 1 M HEPES in 1 L of distilled water. Adjust the pH to 7.4. Filter the solution through a 0.2 µm bottle-top filter.\nSlice culture medium (SCM): Add 10 mL of rat serum, 1 mL of 2 mM glutamine, 1 mL penicillin-streptomycin (100x), 1 mL of N-2 supplement (100x), 2 mL of B27 supplement (50x) and 1 mL of HEPES (pH 7.3) buffer into 84 mL of Neurobasal medium. Aliquot 5 mL of SCM into 15 mL tubes. Store at -20 °C.",
    "CO2-Independent Microinjection Medium (CIMM): Prepare 5x DMEM modified low-glucose solution (without phenol red) by dissolving the powder in 200 mL of distilled water. Filter solution through a 0.2 µm bottle-top filter (for the DMEM powder, use the content of the entire bottle). To prepare 100 mL of CIMM, mix 20 mL of 5x DMEM modified solution, 1 mL of HEPES buffer, 1 mL of N2 supplement (100x), 2 mL of B27 supplement (50x), 1 mL of penicillin-streptomycin (100x), 1 mL of 2 mM glutamine and 74 mL of distilled water. Store the solution at 4 °C.\nReconstitution buffer: Prepare the reconstitution buffer by dissolving 262 mM NaHCO3, 0.05 N NaOH, 200 mM HEPES in distilled water. Sterilize the solution by filtration through a bottle-top 0.22 µm filter system into a sterile glass bottle. Aliquot 500 µL of reconstitution buffer into airtight microcentrifuge tubes. Store at 4 °C.\nMicroinjection dye stock: Dissolve the fluorescently labeled Dextran in RNase free distilled water (final concentration 10 µg/µL). Prepare 5 µL aliquots and store at -20 °C until use.\nPull the microinjection pipettes from borosilicate glass capillaries (1.2 mm outer diameter, 0.94 mm inner diameter) using the micropipette puller. Protect the pipettes from dust. Do not store pipettes for more than 2 – 3 days. For this experiment, the pulling parameters were HEAT: ramp temperature +1 – 5; PULL: 100; VEL: 110; DEL: 100. HEAT and VEL are the parameters that affect the most shape and size of the pipette.\n\tNOTE: The optimal microinjection pipette has a long and flexible tip, to avoid cell damage during microinjection.\n3. Tissue slice preparation",
    "Melt the 3% wide range agarose using a microwave oven prior to the brain tissue dissection. Do not let the agarose solidify by keeping in a water bath at 37 °C prior to embedding. Ensure that the pipettes are protected from dust. Do not store pipettes for more than 2 – 3 days.\nThaw an aliquot of SCM and warm 10 – 12 mL CIMM and 20 mL of Tyrode’s solution to 37 °C using a water bath.\nMix the fluorescent tracer (Dextran-3000 or Dextran-10000-Alexa conjugated; final concentration 5 – 10 μg/μL) with the other chemical(s) to be injected. Centrifuge the microinjection solution at 16, 000 x g for 30 min at 4 °C. Collect the supernatant and transfer into a new tube. Keep the microinjection solution on ice until use.\nUse the heads from E13.5 – E16.5 mouse embryos to prepare organotypic tissue slices of the telencephalon. Remove the skin and open the skull using the forceps, moving along the midline. Dissect out the embryonic brain from the open skull and remove the meninges covering the brain tissue starting from the ventral side of the brain. Leave the dissected whole brain in Tyrode’s solution on a 37 °C heating block.\n\tNOTE: All dissection steps described in 3.4 must be performed in prewarmed Tyrode’s solution.\nPour the wide range melted agarose into a disposable embedding mold. When the agarose is cooled to 38 – 39 °C, carefully transfer the brains (a maximum of 4) into it using a Pasteur pipette. Always use cut tips for this step.\nStir the agarose around the tissue either using a spatula or a pair of Dumont #1 forceps without touching the tissue. Let the agarose solidify at room temperature. Once the agarose has solidified, trim the excess agarose surrounding the tissue.",
    "Fill the buffer tray with PBS. Orient the brain with the rostro-caudal axis of the tissue perpendicular to the tray (use as landmark the olfactory bulbs, representing the rostral-most part of the brain). Cut 250 µm slices using a vibratome.\nFill a 3.5 cm Petri dish with 2 mL of prewarmed media. Using a plastic Pasteur pipette, transfer slices (10 - 15) to this dish. Once done, shift the Petri dish with the slices into the slice culture incubator. Maintain slices at 37 °C in a humidified atmosphere containing 40% O2 / 5% CO2 / 55% N2 until use.\n4. Microinjection\nTurn on the computer, microscope, microscope camera, manipulators, pressure rig, and pressure sensor. Load the application by clicking the file “launchapp.py” in the main folder downloaded from GitHub and specify the device settings in the popup screen (see step 1.1 for install instructions).\nCreate an outward pressure to prevent unwanted clogging before submerging the pipette into the solution. To apply pressure to the pipette, slide the compensation pressure bar to 24 – 45% and click Set Values. Next, tune the pressure to a sufficient pressure by turning the mechanical pressure valve knob to 1 – 2 PSI (69 – 138 mbar) as indicated by the pressure sensor.\nTransfer the slices to a 3.5 cm Petri dish containing 2 mL of pre-warmed CIMM. Place the slices to be microinjected in the centre of the Petri dish. Transfer the Petri dish to the preheated (37 °C) microinjection stage.\nLoad the microinjection pipette with 1.4 –1.6 µL of microinjected solution (from step 3.3) using a long-tip plastic pipette. Insert the microinjection pipette onto the pipette holder.",
    "Using the lowest magnification on the microscope, bring the slice into focus and guide the micropipette to this field of view (FOV) so that it is focused on the same plane as the slice target. Switch the output of the microscope to the camera to see the FOV in the application.\nClick the magnification button in the top left of the interface to initiate device calibration. A window will prompt to select the magnification. Select the 10x magnification, or whatever magnification the lens is set to (e.g., 4x, 10x, 20x, 40x) and press Ok. The software assumes the internal objective lens is 10x (the most common objective lens magnification).\nRefocus the pipette tip using the micrometric wheel of the microscope and click the pipette tip with the cursor. Next, press the step 1.1 button and press OK in the popup window. The pipette will move in the Y direction. Click the tip of the pipette and press the step 1.2 button. Lastly, enter 45 into the Pipette angle box and press the Set angle.\nEnter desired parameters into the Automated microinjection controls panel. For microinjection into apical progenitors set the injection distance to 20 – 40 µm and depth to 10 – 15 µm. For microinjection into neurons set the injection distance 30 – 40 µm from the basal side, and depth to 10 – 30 µm depending upon what is being targeted. Always set speed to 100%. Click Set values.\n\tNOTE: The approach distance is the distance the pipette pulls out of the tissue before moving to the next injection distance, depth is the depth into tissue the microinjection goes, spacing is the distance along the line between sequential injections, speed is the speed of the pipette in µm/s.",
    "Click the Draw edge button and drag the cursor along the desired trajectory in the popup window to define the trajectory of injection. For microinjecting progenitor stem cells, the ventral side of the telencephalon surface is targeted as shown in Figure 2A. Bring the pipette to the start of the line and click the tip of the pipette. Click Run trajectory to start microinjecting. Repeat this step for every plane of injection targeted (usually done for 3 – 4 planes with 40 – 75 injections per plane).\n5. Tissue culture and tissue slice processing for immunofluorescence\nPrepare the collagen mixture (1.5 mg/mL): To a tube add 1.25 mL of the matrix solution, 0.5 mL of distilled water, 0.5 mL of 5x DMEM-F12 solution and 0.25 mL of reconstitution buffer. Keep it on ice until use.\nObtain the Petri dish containing the microinjected slices from the slice culture incubation chamber and immerse the slices into the collagen mixture.\nTransfer the slices together with 200 – 300 µL of collagen mixture into a 14 mm well of a 35 mm glass-bottom dish. Ensure that the slices are covered in very less collagen. This set up allows for the optimal conditions for nutrients and oxygen uptake.\nOrient the slices while ensuring that there is enough space between the slices using two pairs of forceps. Incubate the Petri dish for 5 min at 37 °C using a heating block to allow for the collagen to solidify. Consider this time as t = 0 of slice culture.\nMove the Petri dish back to the slice culture incubator for an additional 40 min. Then add 2 mL of the prewarmed SCM. Slices are kept in culture until the desired time point.",
    "Take the slices out of the slice culture incubator and aspirate the SCM. Wash the collagen-embedded slices with 1x PBS. Add 4% (wt/vol) paraformaldehyde (in 120 mM phosphate buffer, pH 7.4) and leave the tissue at RT for 30 min. Then move it to 4 °C to allow for overnight fixation.\nAspirate the paraformaldehyde solution the next day and perform 1x PBS washes. To remove the slices from the collagen, use two pairs of forceps to gently extract the slices under a stereomicroscope.\nUse a microwave to melt the 3% (wt/vol) low melting point agarose for processing the microinjected slices. Pour the melted agarose into a disposable embedding mold and let it cool to around 38 – 39 °C.\nTransfer the tissue slices from step 5.7 into this mold containing low melting agarose using a plastic Pasteur pipette. Ensure that the pial side of the slice is up and the ventricular surface faces down. If needed orient accordingly. Let the agarose cool down to RT to solidify.\nTrim the extra agarose surrounding the slices. Orient the agarose block to ensure that the cut surface is parallel to the vibratome’s cutting blade. Using vibratome, cut 50 µm thick sections.\nFill a 24 well dish with 1x PBS. Transfer the sections into this dish using a fine-tip paintbrush. Perform immunofluorescence as per the standard protocols."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}