{
  "id": 17123,
  "origin_website": "Jove",
  "title": "Clinical Application of Microscope-Assisted Minimally Invasive Anterior Lumbar Interbody Fusion",
  "procedures": [
    "This study was reviewed and approved by the Hebei Medical University Third Affiliated Hospital ethics committee, and written informed consent was obtained from all the patients. In addition, no images are identifiable to any patients.\n1. Preoperative preparation\nSelect appropriate cases based on the patient history, including symptoms, signs, history of previous lumbar and abdominal surgery, abdominal examination, and imaging, such as lumbar X-ray, computed tomography (CT), and magnetic resonance imaging (MRI).\nAdvise the patients to undergo preoperative CT angiography of the abdominal aorta and CT angiography of the inferior vena cava to rule out vascular malformations, as well as fasting and enemas the day before surgery for gastrointestinal preparation.\n2. Surgical procedures\nFigure 1 depicts the surgical procedure for Mini-ALIF. After general anesthesia, place the patient in the supine position with the hands either flat or on the chest to accommodate an intraoperative lateral X-ray.\n\tNOTE: If the abdominal wall and psoas major muscles are too tight, padding under the thighs is added, and the patients are maneuvered into the bladder stone position.\nLocate the surgical lumbar segment by abdominal palpation of the iliac crest and the location of the Kirschner needle under X-ray.\nUse a right side incision for the operation of the L5-S1 segment, and use a left approach for the rest of the segments. Use a scalpel to cut the skin and subcutaneous tissue in turn. Make a transverse incision in the lateral rectus abdominis muscle next to the lower abdomen, with a single segment length of ~5 cm. Use oblique or vertical incisions of about 8 cm in double-segment surgery.",
    "Identify and incise the anterior rectus abdominis sheath with the aid of a microscope (with a working distance of 535 mm). Then, separate the rectus abdominis muscle bluntly to its outer edge, and retract the outer edge of the rectus abdominis toward the midline using a pulling hook to reveal the posterior rectus abdominis sheath.\nAdjust the appropriate distance and magnification from the microscope to the operating area during the operation. Then, separate the anterolateral abdominal wall of the peritoneum with gauze balls under a microscope, and push contralaterally into the retroperitoneal space to reach the anterior aspect of the vertebral space.\nSeparate the prevertebral soft tissue bluntly with gauze and vascular forceps. Explore the sacral vascular space microscopically. Use vascular forceps and nerve strippers to separate the iliac arteriovenous vein. Furthermore, ligate the median sacral artery using silk thread depending on its occlusion.\n\tNOTE: Take care to avoid having to use electrocoagulation, which can damage the inferior ventral plexus.\nUse the spreader to expose the surgical field in all directions. Fix the pulling hook to the vertebral body using a K-wires positioning tube on either side of the vertical section. Figure 2A shows the pull hook part of the spreader.\nFigure 2B, C shows the second part of the spreader, which is designed as a combination of two draw-off tabs with a puller and a push-rod. Connect the retractor on one side to the straight-grip pull-rod to provide a pulling force on the soft tissue. The other retractor piece has three attachment holes at different depths; have the assistant attach these holes with a T-pusher on the opposite side to assist the surgeon in pushing away the soft tissue.",
    "Then, use a 3.2 mm diameter positioning tube to secure the spreader to the two adjacent vertebral bodies of the operated segment using K-wires on either side of the retractor.\nExpose the intervertebral space, and incise the disc annulus fibrosus. Remove the diseased disc, and then decompress the spinal canal guided by a microscope.\nScrape the endplate with an endplate rugine. Select anterior lumbar fusion apparatus of an appropriate size using a trial model. Fill autogenous bone fragments or bone mud and bone particles into the fusion apparatus and implant them into the surgical intervertebral space. Use an appropriate internal fixation according to the bone quality and diagnosis.\n3. Post-surgery\nUse 1 g of cefazolin sodium per 6 h to prevent infection for 24 h after the operation, and restrict the patient from eating until intestinal exsufflation.\nAfter the patient gets out of bed the next day, advise them to gradually undergo rehabilitation training. Instruct the patient to wear a brace to walk and to use the waistline brace continuously for 3 months.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}