{
  "id": 17775,
  "origin_website": "Jove",
  "title": "A Training Program Using an Agility Ladder for Community-Dwelling Older Adults",
  "procedures": [
    "The study was approved by the Research Ethics Committee of the University of Campinas (UNICAMP) under Protocol Number 2479761. Written informed consent was obtained in-person from all study participants. Sixteen participants of both sexes were recruited from the community of the metropolitan region of Campinas by searching the database of the Applied Kinesiology Laboratory (AKL). The inclusion criteria were 1) individuals aged 60 and older; 2) ability to answer the questionnaires used in this study; 3) ability to walk independently without difficulty; 4) availability to participate in the intervention during 3 months with at least 90% attendance. The exclusion criteria were 1) severe cardiovascular or pulmonary diseases; 2) orthopedic diseases that prevented performing daily activities; and 3) diseases that increased the risk of falls such as Parkinson's and Alzheimer's. All assessments were performed by researchers and professional physical trainers from the AKL.\n1. Assessment\nAssess physical fitness using the following functional tests: Illinois agility, five times sit-to-stand, timed up-and-go, walking usual speed, and one-leg stand. Perform all tests before and after training.\n\tNOTE: Here, the participants repeated each test 2x, and the best result was used.\n\t\nIllinois agility test: Have the participants move through obstacles in multiple directions.\n\t\t\nThe length of the course is 10 m and the width is 5 m. Place a marking cone in each corner of the course: a start and finish cone at one end, 5 m apart; two at the turning points on the other end of the course, 5 m apart; and four cones in the center of the course spaced 3.3 m apart from each other.",
    "Have the participants jog in a straight line from the start line to the first turning point and then in the opposite direction towards the first center cone. They should weave back and forth through the four center cones from one end of the course to the other. Then, they should run diagonally from the first center cone to the second turning point located on the far right and then in the opposite direction towards the finish line14.\nFive times sit-to-stand test: Have the participants rise from a chair 5x as quickly as possible with the arms crossed in front of the body, lifting the hips from the chair when the timer is started. The participants should stand up completely by extending the knees and sit down completely by maintaining the back against the chair15. Stop the timer after the participant sits down for the fifth time.\nTimed up-and-go (TUG) test: Have the participants get up from a chair without pushing up with their arms, walk as quickly as possible along a 3 m line demarcated on the floor upon hearing the command \"Go,\" return to the same position, and sit down on the chair again. Timing starts as the participants get up from their chair and stopped when the participant sits down16.\nWalking usual speed test: Have the participants walk 10 m at their usual gait. Start the timer when a foot reaches the 1 m line and stop when a foot reaches the 11 m line. Do not include the first and last 1 m stretches in the analysis because they are used to measure acceleration and deceleration, respectively17. Present the results as velocity in m/s (Figure 2).",
    "One-leg stand test: Have the participants stand on the foot from the dominant leg while flexing the contralateral knee at 90°, folding the arms across the chest, and maintaining the head straight. Have the participants lift one foot from the floor when the timer is activated. Stop the timer when the foot touches the floor again. The maximum balance time is 30 seconds for each side. Test both legs18.\n2. Training program design\nHave the participants perform agility training for 12 min, including four 3 min sets with a 1 min rest between each set (i.e., the first set starts with sequence 1). Each set is composed of four 30 s subsets, a 15 s rest between subsets (Figure 3), and 1 min rest between sets.\n\t\nIn addition to the four exercise sequences, include a 10 min warm-up and 5 min cool-down, using whole-body low-intensity stretching.\n\t\tNOTE: During this program, each participant trained 2x per week for 14 weeks.\nIncrease the level of difficulty by augmenting exercise complexity and volume, depending on individual adaptation to the program. The level of adaptation dictates the level of increase in the velocity of the drills.\n\t\nIncrease training complexity after 6 weeks of training with four sequences of coordination. After a period of adaptation, substitute sequences 2 and 3 for more challenging drills.\nIncrease the training time after 10 weeks of training. Start with 12 min of exercise (four 3 min sets) and end with 15 min (five 3 min sets).\n\t\tNOTE: At the end of each 30 s subset, the time taken to perform the activity is recorded. This procedure allows comparison of the distance travelled by each participant during each session of the training program.\n3. Agility ladder",
    "Perform the exercises using a ladder with a length of 4.8 m and 12 transverse rungs forming 12 squares (areas delimited by the rungs) measuring 40 cm 40 cm (Figure 1). Instruct the study subjects to step in the squares and not on the rungs.\n4. Familiarization period\nPerform four sequences of the training program (1, 2A, 3A, and 4) during the 2 week familiarization period. Exercise sessions were spaced at least 48 h apart, and there was no time limit to complete the sequences in each session. Instruct the participants to practice these sequences to perform as well as possible during the training period.\n5. Training program\nNOTE: All drills start with both feet together on the start line.\nSequence 1: Have participants place their left foot in the first square, the right foot in the second square, and so forth (Figure 4). Each sequence should be performed in both directions on the ladder for 30 s.\nSequence 2A: Have participants position their right foot in the first square, then position the toes of the left foot in the first square, move the left foot to the second square, place the toes of the right foot on the second square, and so on (Figure 5).\nSequence 2B: Increase the level of difficulty depending on individual adaptation to sequence 2A (Figure 6) by having participants move through the ladder in small jumps, with toe-tapping movements.\n\t\nHave participants jump to the first square with both feet together such that the sole of the right foot touches the ground while the toes of the left foot touch the ground.\nThen, have them jump to the second square with both feet together, ensuring that the sole of the left foot touches the ground while the toes of the right foot touch the ground.",
    "Have subjects repeat this sequence until the end of the ladder.\nSequence 3A: Have participants perform the drill with diagonal and lateral movements.\n\t\nHave them place their left foot, followed by the right foot, outside the first square to the left.\nThen, have them put the right foot in the first square, followed by the left foot. They will then place the right foot outside the second square to the right, followed by the left foot.\nHave subjects continue this sequence until the end of the ladder (Figure 7).\nSequence 3B: Use this sequence to increase the difficulty level depending on individual adaptation to sequence 3A.\n\t\nHave participants position their left foot outside the ladder next to the first square to the left, and then the right foot in the first square, followed by the left foot, maintaining both feet together. Then, they will put the right foot outside the second square to the right and then the left foot in the second square, followed by the right foot, keeping both feet together (Figure 8).\nSequence 4: Have participants place their right foot in the first square, the left foot outside the ladder to the left next to the rung separating the first and second squares, and the right foot outside the ladder across from the left foot.\n\t\nHave participants put the left foot in the second square, the right foot outside the ladder to the right next to the rung separating the second and third squares, and the left foot outside the ladder opposite the right foot. Have the subjects follow this pattern until the end of the ladder (Figure 9).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}