{
  "id": 13104,
  "origin_website": "Jove",
  "title": "Analysis of Cell Differentiation, Morphogenesis, and Patterning During Chicken Embryogenesis Using the Soaked-Bead Assay",
  "procedures": [
    "This research was reviewed and approved by the Institutional Review Board for the Care and Use of Laboratory Animals of the Instituto de Investigaciones Biomédicas, Universidad Nacional Autónoma de México (UNAM, Mexico City, Mexico).\n1. Egg incubation and embryo staging\nNOTE: Fertilized hen eggs can be obtained from local farms. Fertilized White Leghorn chicken eggs are most commonly used. Store the freshly fertilized chicken eggs at 15 °C for up to 1 week prior to incubation.\nIncubate the fertilized chicken eggs vertically with the pointy side down in a humidified incubator at 38 °C and 70% relative humidity until they reach the 28 HH stage (approximately 5.5 days according to Hamilton and Hamburger, 1951)22. Rotate the eggs during the incubation to prevent the embryo from adhering to the shell membrane.\n\tNOTE: The choice of the developmental stage is informed by the experimental aims. In this case, the 28 HH stage is optimal for interdigit bead implantation to induce an ectopic digit or promote cell death.\nRemove the eggs from the incubator, swab them with 70% ethanol, and allow them to air dry. Disinfect the working area, microscopes, and instruments with 70% ethanol.\nCandle the egg to identify blood vessels and locate the embryo. Discard eggs that do not have an embryo.\nUsing the end of non-toothed forceps, open a window in around five eggs by tapping the blunt end of an egg, and remove a 1-cm2 section of the shell with the forceps.\nTransfer the egg into a carton or plastic holder and place it under the stereomicroscope. Remove the air membrane by puncturing and pulling it out with fine surgical forceps. Remove any small piece of eggshell that could contact the embryo.\n\tNOTE: The air membrane is the white, opaque membrane observed immediately after windowing the egg.",
    "Observe under the microscope while opening the amniotic sac slightly, tearing it using the fine surgical forceps. Be careful not to damage the vasculature of the chorioallantoic membrane.\n\t​NOTE: The amnion is the transparent membrane closely surrounding the embryo that encapsulates it in amniotic fluid.\nStage the embryos in ovo to determine whether they are in the desired stage. Embryos in earlier stages can be returned to the incubator after sealing the eggshell window with tape.\n2. Bead preparation\nNOTE: Depending on the experimental aim and treatment in question, alternative bead types (e.g., Affi-Gel, AG1-X2, heparin) may be more suitable. Affi-Gel beads are optimal for proteins (e.g., TGF-ß1), while heparin beads are ideal for growth factors (e.g., FGFs, WNT) and AG1-X2 beads for chemicals solubilized in organic solvents (e.g., DMSO).\nAffi-Gel and heparin bead preparation\n\t\nCut a square of parafilm to fit a 45-mm Petri dish. Place the parafilm across the bottom of the petri dish to cover it and fix it to the bottom of the Petri dish by pushing each vertex using the end of non-toothed forceps. Set aside.\nUsing a pipette or spatula, transfer the beads into a microcentrifuge tube and wash them twice in 1x PBS by settling and pipetting.\nTransfer ~40-50 beads with a micropipette to the center of the parafilmed Petri dish from step 1.\nUsing the microscope, select ~30 Affi-Gel or heparin beads ~100 µm in diameter for use. Use a microscope eyepiece reticle to size the beads or use the third interdigit of an HH 28 embryo as a reference; the bead must be smaller than the interdigit.\nCarefully remove as much of the excess PBS surrounding the beads as possible and soak them in 2-5 µL of the treatment solution. Assure that the solution completely covers beads.",
    "In parallel, prepare control beads by soaking in a solution that contains the same amount of vehicle as used in the experimental treatment solution.\n\t\tNOTE: Concentrations need to be calculated for each treatment according to the experiment. Use the appropriate personal protective equipment when handling potentially harmful reagents.\nIncubate the beads in the solution for 30 min at room temperature. To prevent the beads from drying out during the incubation, pipette a few drops of 1x PBS or water around the beads to humidify the local atmosphere and cover the dish with parafilm to slow evaporation.\nPlace the Petri dish on ice and implant the beads within the same day.\nAG 1-X2 bead preparation\n\t\nCut a square of parafilm to fit a 45-mm Petri dish. Cover the bottom of the Petri dish with parafilm and affix by pushing each vertex using the end of non-toothed forceps. Set aside.\nUse a spatula to transfer the AG 1-X2 beads into a microcentrifuge tube. Add 30-50 µL of the treatment solution at the desired final concentration.\nIn parallel, incubate the control beads in a solution with the vehicle alone, prepared without the experimental chemical or protein of interest.\nIncubate the beads for 20 min while slowly shaking at room temperature. Wrap the microcentrifuge tubes with foil to protect from light during all incubation, given that many of these molecules are light-sensitive\nRemove as much of the solution as possible using a pipette and stain with 2% phenol red dissolved in water at room temperature for 2 min with mild agitation in a vortex.\n\t\tNOTE: Dyeing the transparent AG 1-X2 beads facilitates their implantation in the embryo.\nRemove the 2% phenol red and wash the beads twice in 1x PBS to remove any excess dye.",
    "With a micropipette tip, transfer ~40-50 AG 1-X2 beads to the center of the parafilm-covered Petri dish prepared in step 1 and soak these in 5 µL of 1x PBS. Under the microscope, select around 30 beads that are ~100 µm diameter in size. Discard the unused beads.\nBeads are ready to implant. Ensure the beads are submerged in the PBS throughout the implantation by pipetting a few drops of 1x PBS or water around the beads to humidify the local atmosphere and/or cover the dish with parafilm to slow evaporation.\n3. Embryo manipulation and interdigit implantation\nBefore manipulating the embryos, arrange two stereomicroscopes next to each other on a benchtop. One is for embryo manipulation and bead implantation, and the other is for maintaining the treated beads ready to implant into the embryo.\nUsing non-toothed forceps, create a window in the remaining eggs as described in the egg incubation and embryo staging section.\nUnder the microscope, open the amniotic sac by tearing the amniotic membrane with fine surgical forceps near the right hindlimb only by the amount needed to accomplish the procedure (i.e., as little as possible).\nUsing fine forceps, hold the embryo by the amniotic membrane to expose the right hindlimb. Using a fine tungsten needle, make a hole centered in the distal-most of the third interdigit of the hindlimb.\nWithout releasing the embryo and the exposed hindlimb, take one treated bead from the other microscope using one of the tips of the forceps. The forceps must be in the open position for one bead to adhere to the forceps tip.\nTransfer the bead into the chick embryo near the hindlimb and position it on top of the interdigit hole.\nClose the forceps to apply pressure to the bead until it enters the hole.",
    "Release the embryo and seal the eggshell window with tape.\nReturn the eggs to the incubator until they have reached the required stage. Repeat the procedure until the required number of manipulated embryos is reached. It is imperative to ensure that the beads do not dry out at any point.\n\tNOTE: To observe a complete ectopic finger, incubate for ~72 h after bead implantation. In contrast, early differentiation genes (e.g., Sox9) are expressed ~30 min after the implantation of a TGF-ß1-soaked bead.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}