{
  "id": 18376,
  "origin_website": "Jove",
  "title": "PeptiQuick, a One-Step Incorporation of Membrane Proteins into Biotinylated Peptidiscs for Streamlined Protein Binding Assays",
  "procedures": [
    "1. Preparation and solubilization of membrane receptor FhuA\nExpress His6-tagged FhuA in Escherichia coli strain AW740. Grow cells for 18 h at 37 °C in M9 media (Table 1). See Mills et al.16 for a detailed expression protocol.\nHarvest cells by centrifugation (5,000 x g, 10 min, 4 °C) and resuspend them in 50 mL of Tris-salt-glycerol (TSG) buffer (Table 1). Dounce the resuspended cells and add phenylmethanesulfonylfluoride (PMSF) to a final concentration of 1 mM just prior to lysis.\n\tCAUTION: PMSF is toxic and corrosive.\nLyse the cells using a microfluidizer (three passages) at 15,000 psi or a French press (three passages) at 8,000 psi. Pellet the unlysed cells and other insoluble material by low-speed centrifugation (5,000 x g, 10 min, 4 °C).\nUltracentrifuge the supernatant (200,000 x g, 40 min, 4 °C) to isolate the crude membrane fraction. Discard the supernatant, resuspend the membrane pellet in a minimum amount of TSG buffer, and dounce using a glass or metal douncer apparatus to ensure homogeneity.\nPerform a Bradford assay to check the protein concentration of the resuspended crude membrane. Dilute the crude membrane to a final concentration of 3 mg/mL using TSG buffer prior to solubilization.\nAdd detergent Triton X-100 to a final concentration of 1% (v/v) to selectively solubilize the bacterial inner membrane for 1 h at 4 °C with gentle rocking. Pellet the insoluble material (outer membrane fraction) by ultracentrifugation (200,000 x g, 40 min, 4 °C).\nDiscard the supernatant containing the solubilized membrane and resuspend the pellet in TSG to a final concentration of 3 mg/mL. Add lauryldimethylamine oxide (LDAO) to a concentration of 1% (v/v) to the resuspended outer membrane fraction and solubilize for 1 h at 4 °C with gentle rocking.",
    "Perform a final centrifugation step to pellet all insoluble material (200,000 x g, 40 min, 4 °C).\n\tNOTE: The resultant supernatant contains the solubilized outer membrane proteins, including the target his-tagged FhuA.\n2. Purification and reconstitution of FhuA using the PeptiQuick workflow\nPre-equilibrate a prepacked Ni-NTA column (5 mL resin volume) with two column volumes of immobilized metal affinity chromatography (IMAC) wash buffer (Table 1).\nDilute the solubilized outer membrane from 1% LDAO to 0.04% LDAO using TSG. Then, add imidazole to a final concentration of 5 mM.\n\tCAUTION: Imidazole is toxic and corrosive.\nLoad the solubilized outer membrane proteins onto the Ni-NTA resin and collect the flowthrough. Reload the flowthrough onto the resin to increase the resin binding of FhuA and collect the secondary flowthrough.\n\tNOTE: Keep a 20 µL aliquot of solubilized material as a reference for later sodium dodecyl sulfate polyacrylamide gel electrophoresis (SDS-PAGE) analysis.\nWash the resin with 250 mL of IMAC wash buffer and collect the first 50 mL of eluate. Drain the wash buffer to the height of the resin bed volume and close the stopcock on the column.\nAdd 1 mL of concentrated 10 mg/mL Bio-Peptidisc peptide solution (Table 1) to the column. Add 50 mL of dilute 1 mg/mL Bio-Peptidisc peptide solution in TSG and stir the resin with a glass rod to resuspend the beads in TSG.\nFollowing peptidisc trapping, allow the resin to settle and drain the excess 1 mg/mL Bio-Peptidisc solution through the resin.\nWash the Ni-NTA attached peptidisc particles with 50 mL of TSG. Elute the peptidisc particles with 15 mL of IMAC elution buffer (Table 1) containing 600 mM imidazole in TSG. Collect 1 mL fractions and immediately add 10 µL of 0.5 M EDTA to chelate leached nickel ions.\n\tCAUTION: EDTA is an irritant.",
    "3. Evaluation of the PeptiQuick reconstitution\nSDS-PAGE analysis\n\t\nLoad 10 µL aliquots of the start material, flowthrough, wash(es), and eluted fractions from the PeptiQuick reconstitution onto a 12% SDS-denaturing gel and electrophorese for 30 min at a constant current of 60 mA.\nStain the gel with Coomassie blue dye, destain the gel, and visualize on a scanner.\nSize-exclusion chromatography (SEC)\n\t\nBased on the 12% SDS-PAGE analysis of the PeptiQuick reconstitution, isolate and pool the relevant fractions, and concentrate them using a 30 kDa cut-off centrifugal concentrator.\n\t\tNOTE: In the accompanying video, fractions F3–F7 are pooled together and concentrated below 1 mL (the injection loop volume on the SEC instrument).\nInject ~1 mL of the pooled IMAC elution fractions onto a gel filtration S200 (300/10) column at a flow rate of 0.25 mL/min in TSG buffer. Collect 1 mL fractions and run them on a 12% SDS gel to determine which SEC fractions to pool and concentrate.\n\t\tNOTE: The eluted PeptiQuick fractions may be pooled without concentration, and an aliquot may be injected onto the SEC to check quality of the reconstitution. This is an important control for membrane proteins that are potentially sensitive to aggregation during centrifugal concentration.\n4. Biolayer interferometry\nBLI experimental setup\n\t\nSet up the 96 well plate by hand.\n\t\tNOTE: All wells are filled to a final volume of 200 µL.\nIn column 1, rows A−E, load 200 µL of kinetics buffer to allow the tips to equilibrate and form a baseline signal.\nDilute the ligand (FhuA in Bio-Peptidisc) to a concentration of 2.5 µg/mL in kinetics buffer (Table 1). Load 200 µL of this dilution into rows A−D in column 2.\nAdd 200 µL of kinetics buffer only to E2 (the reference sensor).",
    "Add 200 µL of kinetics buffer to column 3, rows A−E to wash excess FhuA from the tip.\nIn column 4, conduct two-fold serial dilutions of the analyte (ColM) down the plate from A4 to D4. Start with 28 nM (8*Kd) in A4 to 3.5 nM (1*Kd) in D4.\nAdd 28 nM ColM to E4 to measure for non-specific binding (the highest ColM concentration used).\nAdd 200 µL of kinetics buffer to column 5, rows A−E.\n\t\tNOTE: Here, the ColM will dissociate from the tip, and the dissociation is measured.\nPlace the setup plate in the BLI instrument.\nPlace the sensor tip tray in the BLI instrument.\nOpen the BLI data acquisition software and select New Kinetics Experiment on the software wizard.\nUse the plate definition tab to input the layout of the 96 well plate into the software.\n\t\tNOTE: The wells containing the ligand, FhuA are inputted as the “Load”. Wells containing buffer only are inputted as the “Buffer”. Wells containing the analyte, ColM, are inputted as the “Sample”.\nUse the assay definition tab to define the length of time and plate rotation speed for each step in the experiment.\n\t\tNOTE: The experimental steps are set up as: 1) baseline: 60 s; 2) loading: 250 s; 3) baseline2: 300 s; 4) association: 450 s; and 5) dissociation: 900 s. Leave the shake speed as default (1,000 rpm). The above steps are individually assigned to each column in the 96 well plate by selecting the desired step and right-click Add Assay Step on each column.\nAssign the first step by right-clicking on the first column and select Start New Assay. Ensure the baseline step is correctly assigned using the bottom righthand window and change with the drop-down menu as needed.",
    "Assign the subsequent steps to each column by right clicking along the plate and selecting Add Assay Step. Assign these to the appropriate column, as set in step 4.1.13.\nUse the sensor assignment tab to ensure that the octet instrument is taking BLI pins from the correct location in the sensor tray.\n\t\tNOTE: In the sensor assignment tab, only A1−E1 should be highlighted blue. Ensure a sensor tip is present in these locations in the sensor tray and ensure that F1−H1 are empty.\nHighlight F1−H1 on screen, then right-click and select Remove to mark these as empty. Tick Replace sensors in tray after use to retain the used sensors.\nIn the review experiment tab, which provides a final overview of the experiment prior to execution, go over the experimental steps to ensure that the entire setup is correct.\nIn the run experiment tab, select a file location to save the method files.\nChange the plate temperature to the room temperature.\nSelect GO to run the experiment.\nBLI data analysis\n\t\nOpen the Octet BLI data analysis software.\nUse the data selection tab to locate the experiment and to check the experimental summary. Import the project file from its save location defined during step 4.1.19.\nInput the concentrations of the analyte (here, ColM) by selecting the sensor information for each experiment.\nAssign the tip in E1 as the reference tip.\nUse the processing tab to subtract the reference signal (E1) from the experimental data. Check the raw data from the reference tip for nonspecific analyte binding. If none is observed, proceed.\n\t\tNOTE: This is an important negative control. If nonspecific binding is observed, this will be accounted for in step 4.2.7.\nAlign the y-axis to the second baseline step. Do not tick the interstep connection. Select Savitzky-Golay filtering. Select Process Data!.",
    "In the analysis tab, select the experimental data in the table below the plot to see the association and dissociation curves with the signal from the reference sensor subtracted.\nSelect the 1:1 binding model and select a partial curve fit. Select Fit Curves!.\nAnalyze the residual view plot to check the curve fitting.\nScroll through the table to see the calculated Kd.\nSelect Save Report… to save a spreadsheet document detailing the setup, plots of the raw and analyzed data, and the calculated dissociation constants."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}