{
  "id": 19850,
  "origin_website": "Wiley",
  "title": "Proteome-Derived Peptide Libraries for Deep Specificity Profiling of N-terminal Modification Reagents",
  "procedures": [
    "This protocol describes how to generate N-terminally diverse peptide libraries from the E. coli proteome. Cells are lysed and proteins are extracted and digested with the desired digest protease(s). Peptide libraries generated according to this protocol will contain thousands of peptides with a known conserved sequence at the C-terminus and diverse sequences at the N-terminus (Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.798#cpz1798-fig-0002]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/ee0886d7-f459-4ca7-accb-ac69368dc2e5/cpz1798-fig-0002-m.jpg</p>\nFigure 2\nExample data for characterization of E. coli proteome-derived peptide libraries. (A) Sequence logo for an E. coli proteome-derived peptide library generated with trypsin. Observation of >20,000 peptides is typical for a trypsin peptide library generated an analyzed according to Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.798#cpz1798-prot-0001]. (B) Sequence logo for an E. coli proteome-derived peptide library generated with chymotrypsin. Observation of >10,000 peptides is typical for a chymotrypsin peptide library generated according to Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.798#cpz1798-prot-0001]. (C) Sequence logo for an E. coli proteome-derived peptide library generated with GluC. Observation of >8000 peptides is typical for a GluC library generated according to Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.798#cpz1798-prot-0001].\nMaterials\nLuria-Bertani (LB) Broth\nEscherichia coli XL10 (or other E. coli strain)\nPhosphate-buffered saline (PBS; see recipe)\nE. coli lysis buffer (see recipe)\n1 M HEPES, pH 7.5 (Fisher Scientific, cat. no. AC172570010)\n1 M dithiothreitol (DTT; Goldbio, cat. no. DTT100)\n500 mM iodoacetamide (Sigma-Aldrich, cat. no. I1149-5G; make fresh and protect from light)\n100% (w/v) trichloroacetic acid (TCA; Sigma-Aldrich, cat. no. T6399)\nMethanol (Fisher Scientific, cat. no. A456-4), prechilled to –20°C\n20 mM sodium hydroxide (NaOH; Sigma-Aldrich, cat. no. 415413-500ML)\nBicinchoninic acid (BCA) protein assay kit (Thermo Scientific, cat. no. 23228)\nSequencing-grade trypsin (Promega, cat. no. V5113), GluC (Promega, cat. no. V1651), or chymotrypsin (Promega, cat no. V1061)\nSDS-PAGE gels (Invitrogen, cat. no. NP0321BOX)\n1 M phenylmethanesulfonylfluoride (PMSF) in DMSO (make fresh before use)\n8 M guanidine hydrochloride (Chem-Impex, cat. no. 00152)",
    "Trifluoroacetic acid (TFA; Optima LC-MS grade; Fisher, cat. no. A116)\nAcetonitrile (Optima LC-MS grade; Fisher, cat. no. A955)\nWater (Optima LC-MS grade; Fisher, cat. no. W64)\n0.1% TFA in water (use LC-MS-grade chemicals)\n0.1% TFA/50% acetonitrile in water (use LC-MS-grade chemicals)\n0.1% formic acid in water (use LC-MS-grade chemicals)\nUltrapure Milli-Q water\nBaffled culture flask that can accommodate 1 L (such as a 2.8-L Fernbach flask, Sigma-Aldrich, cat. no. CLS44242XL)\nShaker-incubator, 37°C\nRefrigerated centrifuge capable of operating at 10,000 × g\n50-ml conical tubes\nHomogenizer, microfluidizer, or French press (such as the Avestin EmulsiFlex-C3, Avestin, cat. no. C321220)\nProbe ultrasonicator (such as the Qsonica Q700, Fisher Scientific, cat. no. 15-338-281)\nRocker or rotisserie mixer (such as the Labnet Mini Lab Roller, Labnet, cat. no. H5500)\nBCA protein assay kit (Thermo Scientific, cat. no. 23228)\nChemical fume hood\nBenchtop microcentrifuge\nMicroplate reader suitable for reading absorbance at 562 nm (such as the Tecan Infinite M200)\nIncubator, 37°C\nApparatus to run SDS-PAGE gel\npH strips (EMD Millipore, cat. no. 1.09535.0001)\nWaters Sep-Pak C18 cartridge, 360 mg sorbent (Fisher Scientific, cat. no. 50-818-645)\n1.5-ml microcentrifuge tubes (Axygen, cat. no. MCT-150-L-C)\nVacuum centrifuge (e.g., SpeedVac)\nUltra-low-temperature (–80°C) freezer\nDionex UltiMate 3000 RSLCnano system (Thermo Scientific)\nAcclaim PepMap RSLC column (Thermo Scientific, cat no. 164942)\nOrbitrap Exploris 480 Mass Spectrometer (Thermo Scientific)\nComputer with the following minimum requirements: 2 GHz processor, 2 GB RAM, video card and monitor capable of 1280 × 1024 resolution, screen resolution of 96 dpi, 1 TB available on C drive, New Technology File System format)\nProteome Discoverer 2.4 analysis software (Thermo Scientific)\nGrowth and harvesting the proteome source\n1. Using a sterile inoculation loop or sterile wooden stick,, inoculate 1 L of autoclaved LB medium in a 2.8-L flask with E. coli XL10.",
    "We have typically used E. coli XL10, but any E. coli strain is suitable.\n2. Grow the E. coli for 14-16 hr at 37°C, shaking at 200 rpm.\n3. Harvest the cells by centrifugation for 15 min at 5000 × g, 4°C.\n4. Pour off the supernatant into a liquid waste container and retain the cell pellet.\n5. Resuspend the cell pellet in 50 ml PBS by pipetting up and down with a serological pipet.\n6. Weigh an empty 50-ml conical tube and note the weight.\n7. Transfer the resuspended cells into the 50-ml conical tube.\n8. Centrifuge 5 min at 5000 × g, 4°C.\n9. Pour off the supernatant into a liquid waste container and retain the cell pellet.\nPotential pause point: harvested cell pellets can be stored for several weeks at –80°C.\n10. Determine the pellet mass by subtracting the mass of the empty 50-ml conical tube from the mass of the tube containing the cell pellet.\nA typical 1-L E. coli culture grown for 14-16 hr will yield ∼5-6 g of cells.\n11. Resuspend the cell pellet in 50 ml E. coli lysis buffer.\n12. Lyse the cells by three passes through a homogenizer, microfluidizer, or French press at 15,000 psi.\nCells may also be lysed by probe ultrasonication on ice. In this case, the cell pellet should be resuspended in 5 ml lysis buffer. Use a program of 10 s sonication interval and 20 s resting interval repeated for ten cycles at 25% amplitude.\n13. Centrifuge 30 min at 10,000 × g, 4°C.\n14. Transfer the clarified supernatant to a fresh 50-ml conical tube. Discard the insoluble pellet.",
    "15. Add the appropriate volume of 1 M HEPES to the supernatant to achieve a final concentration of 100 mM HEPES. Save a sample to measure the protein concentration using the BCA protein assay kit according to the manufacturer's instructions using a microplate reader.\nFirst reduction and alkylation\n16. Proceed with 50 ml of the supernatant from step 15. Add 250 µl of 1 M DTT to achieve a final concentration of 5 mM and incubate at room temperature on a rocker or rotisserie mixer for 30 min.\nTris(2-carboxyethyl)phosphine (TCEP) may be used as an alternative to DTT.\n17. Add 1 ml of 500 mM iodoacetamide to achieve a final concentration of 10 mM and incubate for 60 min at room temperature in the dark on a rocker or rotisserie mixer.\nIodoacetamide should be prepared fresh daily. Iodoacetamide is light sensitive and must be protected from light. This can be achieved by wrapping the tube in aluminum foil.\n18. Quench any unreacted iodoacetamide by adding 250 µl of 1 M DTT to achieve an accumulated final DTT concentration of 10 mM. Incubate at room temperature for 15 min.\nThis step is a potential pause point; protein extract can be stored at –80°C for several months.\nProtein isolation\n19. Using the BCA assay results from step 15, transfer aliquots of the protein extract from step 18 containing 10 mg protein into 15-ml conical tubes.\nMake one 10-mg aliquot for each proteome-derived peptide library that you plan to prepare. The remaining protein extract from step 18 can be stored at –80°C for several months for use in future proteome-derived peptide library preparation starting from this step.\n20. Precipitate protein adding 100% (w/v) TCA to a final concentration of 15% (w/v) TCA.",
    "TCA should be handled with care inside a chemical fume hood. A white precipitate should form immediately upon TCA addition.\n21. Incubate the precipitated protein samples at –20°C for a minimum of 2 hr. After 2 hr, continue to step 22 or use this as a pause point.\nPotential pause point: Precipitated protein samples can be stored frozen at –20°C for up to a week.\n22. Thaw the precipitated protein samples.\n23. Centrifuge 30 min at 10,000 × g, 4°C.\n24. Pour off the supernatant into a liquid waste container and retain the protein pellet. Centrifuge briefly to collect residual supernatant at the bottom of the tube. Use a pipet to carefully remove residual traces of supernatant.\nThe supernatant will be very acidic and should be handled carefully. Pipetting off residual supernatant is important to avoid producing an overly acidic protein extract.\n25. Overlay the pellet with 200 µl of –20°C methanol to wash the pellet.\nIf protein has been pelleted in a fixed-angle centrifuge rotor, the protein pellet will be on the side of the tube. Holding the tube at angle, gently pipet the cold methanol directly onto the pellet, being careful not to disturb it. If the pellet loosens, centrifuge the tube for 2 min at 10,000 × g, 4°C.\n26. Holding the tube upright, carefully remove the methanol with a pipet.\nPipetting is preferable over pouring to avoid traces of methanol being left behind.\n27. Repeat steps 25 and 26.\n28. After removing the second methanol wash from all of the samples, use a fresh pipet tip to carefully remove any visible traces of methanol.\n29. Let the pellet air dry for 20 min.\nOver-drying the pellet can make resolubilization difficult and result in sample losses.",
    "30. Add 5 ml of 20 mM NaOH to the protein pellet to achieve an assumed protein concentration of 2 mg/ml (based on aliquoting 10 mg per tube in step 19).\nNaOH is added to neutralize any remaining TCA. Check the pH of the solution to ensure that it is close to neutral. If the pH is acidic, see Troubleshooting.\n31. Use probe ultrasonication (20% amplitude, 10 cycles of 5 s on/5 s off) to help dissolve the pellet.\nIf the pellet does not dissolve readily, check the pH again after ultrasonication to ensure that the solution remains close to neutral after breaking up the pellet; see Troubleshooting.\n32. Add 1 M HEPES, pH 7.5, to a final concentration of 200 mM.\n33. Centrifuge 30 min at 10,000 × g, 4°C.\nIf the protein dissolved well, there may not be a visible pellet.\n34. Transfer the supernatant to a fresh 15-ml conical tube. Discard the insoluble pellet.\n35. Determine the protein concentration and total protein mass using the BCA assay method. Save a 100 µl pre-digestion sample.\n36. Digest with chymotrypsin, GluC, trypsin, or other suitable protease. Use a protease-to-proteome ratio of 1:100 (wt/wt) and incubate 16-20 hr at 37°C.\nIf desired, the protein solution can be split into different tubes to enable digestion with different proteases.\n37. Run 10 µg of protein from the sample saved in step 35 and 10 µg of the digested protein sample on an SDS-PAGE gel. No bands above 10 kDa should be visible in the digested sample.\nComplete digestion of the proteins is critical for the successful generation of a proteome-derived peptide library. If bands above 10 kDa are visible, add additional protease and digest for another 16-20 hr.",
    "38. Add 1 M PMSF in DMSO to a final concentration of 1 mM to inhibit protease digestion. Invert several times to mix and heat the sample at 95°C to completely inactivate the protease.\nPMSF will only inhibit serine proteases. If a different type of protease is used to generate the library, use a suitable inhibitor.\n39. Add 8 M guanidine hydrochloride to a final concentration of 1 M.\n40. Centrifuge 30 min at 10,000 × g, 4°C.\nThere may not be a visible pellet.\nSecond reduction and alkylation\n41. Transfer the supernatant to a fresh 15-ml conical tube. Discard the insoluble pellet.\n42. Add DTT to a final concentration of 5 mM and incubate at 37°C for 1 hr.\n43. Add iodoacetamide to a final concentration of 10 mM and incubate at 37°C for 1 hr in the dark.\n44. Add DTT to a final concentration of 15 mM and incubate at 37°C for 10 min to quench excess iodoacetamide.\nDesalting peptide libraries using C18 solid-phase extraction\n45. Prepare the peptide library for desalting by acidifying the sample to a pH <3 by adding 100% TFA to a final concentration of 5% (v/v).\nThe pH must be <3 for peptides to bind efficiently to the C18 cartridge. Use pH paper to verify that the pH is <3. If the pH is >3, add TFA until it is <3. TFA is a strong acid and should always be handled in a fume hood.\n46. Condition a Sep-Pak cartridge by pushing 3 ml acetonitrile through the cartridge dropwise using a 3-ml syringe. Collect the flowthrough in a waste breaker.\nTake care not to allow air to enter the cartridge after performing the conditioning step.",
    "47. Equilibrate the cartridge by pushing 3 ml of 0.1% TFA through dropwise using a 3-ml syringe. Collect the flowthrough into a waste beaker.\n48. Repeat step 46.\n49. Load 4 mg of the peptide library onto the equilibrated C18 cartridge using a syringe. Collect flowthrough into waste beaker or save if desired.\nThe capacity of the Sep-Pak C18 cartridge containing 360 mg sorbent is ∼4 mg. For larger amounts of peptide library, larger cartridges or multiple cartridges may be used.\n50. Equilibrate the cartridge by pushing 3 ml of 0.1% TFA through dropwise using a 3 ml syringe. Collect the flowthrough into a waste beaker.\n51. Repeat step 50.\n52. Elute the peptide library by pushing 1.5 ml of 80% acetonitrile/20% water through the cartridge. Collect the eluted peptide into a 1.5-ml microcentrifuge tube.\nAvoid using 0.1% TFA in the elution buffer to maintain the peptide library at neutral pH.\n53. Repeat step 52.\n54. Use a vacuum centrifuge (e.g., SpeedVac) to remove acetonitrile from the peptide libraries. Concentrate the peptide library until the volume is reduced to half of the original volume (750 µl in each tube).\nDo not evaporate the peptide libraries to dryness as the pellets may be difficult to redissolve.\n55. Add 500 µl LC-MS-grade water and concentrate the peptide library until the volume has again been reduced to 750 µl.\n56. Repeat step 55 two additional times.\nAdding water and concentrating three times will ensure that all acetonitrile has been removed from the samples.\n57. Pool the concentrated elution fractions. Determine the final peptide concentration by BCA assay.\n58. Adjust the concentration of the peptide libraries to 2 mg/ml using LC-MS-grade water. Store peptide libraries in water in 50- to 100-µl aliquots at –80°C.\nPeptide libraries can be stored for several years at –80°C.",
    "LC-MS/MS analysis of proteome-derived peptide libraries\n59. Dilute a sample of proteome-derived peptide library to a concentration of 0.1 mg/ml in 0.1% formic acid.\nA sample volume of 15 µl is sufficient for LC-MS/MS analysis.\n60. Analyze peptides by LC-MS/MS.\nA typical analysis is performed using an Acclaim PepMap RSLC column (75 μm × 15 cm, 2 μm particle size, 100-Å pore size, Thermo Scientific) on a Thermo Dionex UltiMate 3000 RSLCnano liquid chromatography system with an aqueous mobile phase (mobile phase A) of 0.1% formic acid and an organic mobile phase (mobile phase B) of 0.1% formic acid/80% acetonitrile. Samples (5 µl, 500 ng) are loaded over 15 min at 0.5 µl/min in 97% mobile phase A and separated at 0.3 µl/min with a linear gradient from 97% mobile phase A to 50% mobile phase B over 120 min. Data-dependent acquisition of MS data is performed on an Orbitrap Exploris 480 mass spectrometer (Thermo Scientific) using the parameters given in Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.798#cpz1798-tbl-0001].\nTable 1.\n                Orbitrap Exploris 480 Settings for LC-MS/MS Analysis of Proteome-derived Peptide Libraries\ntable:\n﻿Parameter,Setting\nSource,Nano-ESI\nIon transfer tube temperature,325°C\nPositive spray voltage,2000 V\nFull scan mass range,300-1200 m/z\nFull scan parameters,Full scan parameters\nOrbitrap resolution,\"60,000 at 200 m/z\"\nScan range,300-1200 m/z\nRF lens,40%\nNormalized AGC target,300%\nMaximum injection time,Auto\nIntensity threshold,5 × 103\nCharge state,2-6\nDynamic exclusion,20 s; precursor mass tolerance ±10 ppm\nTop-N MS2,20\nddMS2 parameters,\nIsolation window,1.4 m/z\nCollision energy mode,Fixed\nCollision energy type,Normalized\nHCD collision energy,30%\nOrbitrap resolution,\"15,000 at 200 m/z\"\nScan range mode,Define first mass\nFirst mass,110 m/z\nAGC target,Standard\nMaximum injection time,22 ms",
    "61. Analyze raw files using Proteome Discoverer software. Search data using the human or E. coli SwissProt database, depending on the proteome used to generate the library. Select the appropriate protease specificity and set it to full cleavage with up to 2 missed cleavages. For data collected on a Thermo Orbitrap Exploris, set the precursor ion mass tolerance to 10 ppm and fragment ion mass tolerance to 0.02 Da. Set cysteine carbamidomethylation as a static modification. Set acetylation, methionine loss, and methionine loss plus acetylation as dynamic N-terminal protein modifications.",
    "This protocol is performed instead of Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.798#cpz1798-prot-0001] if human-derived N-terminally diverse peptide libraries are desired. Peptide libraries derived from human sources will have post-translational modifications that E. coli-derived peptide libraries do not have. Human-derived peptide libraries can be used as a complement to E. coli-derived peptide libraries, or on their own. Successful completion of this protocol will result in thousands of N-terminally diverse human peptides with a conserved C-terminal sequence (Fig. 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.798#cpz1798-fig-0003]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/9afdf5eb-f5bf-42ef-b9e4-6241269d7101/cpz1798-fig-0003-m.jpg</p>\nFigure 3\nExample data for characterization of human proteome-derived peptide libraries. (A) Sequence logo for a human proteome-derived peptide library generated with trypsin. Observation of >20,000 peptides is typical for a trypsin peptide library generated an analyzed according to the Alternate Protocol. (B) Sequence logo for a human proteome-derived peptide library generated with chymotrypsin. Observation of >5000 peptides is typical for a chymotrypsin peptide library generated according to the Alternate Protocol. (C) Sequence logo for a human proteome-derived peptide library generated with GluC. Observation of >4500 peptides is typical for a GluC library generated according to the Alternate Protocol.\nAdditional Materials (also see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.798#cpz1798-prot-0001])\nHEK293T cells (ATCC, cat. no. CRL-3216, RRID:CVCL_0063)\nComplete DMEM (see recipe)\nPhosphate-buffered saline (PBS; VWR, cat. no. 45000-448)\nVersene (Thermo Scientific, cat. no. 15040066)\nMammalian cell lysis buffer (see recipe)\nLaminar-flow hood (BSC Class II)\n225-cm2 cell culture flasks\n5% CO2, 37°C tissue culture incubator\nVacuum aspirator\nTissue culture microscope\nGrowing and harvesting the proteome source\n1. Grow one 225-cm2 flask of HEK293T cells in complete DMEM medium to 90% confluence in a 5% CO2, 37°C tissue culture incubator, with 85% humidity.\n150-cm2 dishes are also suitable, but will provide somewhat less protein after cell lysis.\n2. Remove the medium using a vacuum aspirator, being careful not to disturb the cells.",
    "3. Carefully wash the cells with 20 ml PBS. Remove the PBS with a vacuum aspirator.\n4. Add 10 ml Versene to detach the cells. Incubate in 5% CO2, 37°C tissue culture incubator for 15 min, occasionally tapping the sides of flask to help cells detach.\nAvoid using a protease for detachment.\n5. Transfer the Versene cell suspension to a 15-ml conical tube.\n6. Centrifuge cells 5 min at 300 × g, 4°C. Remove the supernatant with a vacuum aspirator.\n7. Resuspend cells gently in 10 ml PBS.\n8. Centrifuge resuspended cells 5 min at 300 × g, 4°C. Remove the supernatant with a vacuum aspirator.\n9. While step 8 is running, aliquot 800 µl of mammalian cell lysis buffer into a 1.5-ml microcentrifuge tube and preheat to 95°C.\n10. Resuspend the cell pellet in the preheated lysis buffer from step 9. Heat at 95°C for 10 min in a 1.5-ml microcentrifuge tube.\nThe cell pellet may be stringy and is easiest to transfer if lysis buffer is added on top without pipetting up and down and then pipetted out of the tube, in one smooth motion, into a 1.5-ml microcentrifuge tube.\n11. Complete the lysis by probe ultrasonication at 20% amplitude using 10 cycles of 5 s on/5 s off.\n12. Centrifuge the lysate for 10 min at 20,000 × g, 4°C, in a benchtop microcentrifuge.\n13. Transfer the clarified supernatant to a fresh 2.0-ml microcentrifuge tube. Discard the insoluble pellet.\n14. Continue with Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.798#cpz1798-prot-0001] starting from step 19 (protein isolation).",
    "This protocol is performed to profile the labeling specificity of a chemical N-terminal labeling reagent: 2-pyridinecarboxaldehyde (2PCA; MacDonald et al., 2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.798#cpz1798-bib-0006]). Proteome-derived N-terminally diverse peptide libraries are incubated with 2PCA to label the N termini. The labeled peptide sequences are then identified by LC-MS/MS and the labeling preference is analyzed (Fig. 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.798#cpz1798-fig-0004]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/568df3e0-6744-4d8b-a49c-9de05f3c8357/cpz1798-fig-0004-m.jpg</p>\nFigure 4\nExample data for 2PCA specificity profiling using E. coli proteome-derived peptide libraries. E. coli proteome-derived peptide libraries were incubated with 50 mM sodium phosphate, pH 7.5, and 10 mM 2PCA for 4 hr at 37°C, and then desalted and analyzed by LC-MS/MS according to Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.798#cpz1798-prot-0003]. The left panel compares the total number of peptides observed in each experiment to the number of 2PCA-modified peptides. The right panel shows a heatmap of z-scores (standard scores) that describe over- or under-representation of each sequence among the modified peptides compared to the total peptide population. (A) 2PCA specificity profiling with an E. coli trypsin library. (B) 2PCA specificity profiling with an E. coli chymotrypsin library. (C) 2PCA specificity profiling with an E. coli GluC library.\nMaterials\nUltrapure Milli-Q water\n400 mM sodium phosphate, pH 7.5\n2 mg/ml proteome-derived peptide library (from Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.798#cpz1798-prot-0001])\n500 mM 2-pyridinecarboxaldehyde (2PCA; Sigma-Aldrich, cat. no. P62003-100G) in Milli-Q water\nWater (Optima LC-MS grade; Fisher, cat. no. W64)\nAcetonitrile (Optima LC-MS grade; Fisher, cat. no. A955)\n0.1% formic acid in water (use LC-MS-grade chemicals)\n1.5- and 2-ml microcentrifuge tubes (Axygen, cat. no. MCT-150-L-C)\nIncubator (37°C)\nSera-Mag Speedbeads Carboxyl magnetic beads, hydrophobic (Cytiva, cat. no. 65152105050250)\nSera-Mag Speedbeads Carboxyl magnetic beads, hydrophilic (Cytiva, cat. no. 45152105050250)\nVortex\nMagnetic stand (such as MagRack 6, Cytiva, cat. no. 28-9489-64)\nBenchtop microcentrifuge\nWater bath sonicator\nThermomixer C (Eppendorf)\nSpectrophotometer (such as a Nanodrop microvolume spectrophotometer)\nDionex UltiMate 3000 RSLCnano system (Thermo Scientific, cat. no. ULTIM3000RSLCNANO)",
    "Acclaim PepMap RSLC column (Thermo Scientific, cat no. 164942)\nOrbitrap Exploris 480 Mass Spectrometer (Thermo Scientific)\nProteome Discoverer 2.4 software (Thermo Scientific)\nLabeling of proteome-derived peptide libraries with 2-PCA\n1. Prepare a 100-µl reaction mixture in a 1.5-ml microcentrifuge tube by combining 27.5 µl Milli-Q water, 12.5 of µl 400 mM sodium phosphate, pH 7.5, 50 µl of 2 mg/ml peptide library, and 10 µl of 500 mM 2PCA. Mix well.\nFinal concentrations are 50 mM sodium phosphate, pH 7.5, 1 mg/ml peptide library, and 10 mM 2PCA.\n2. Allow the reaction to proceed for the desired length of time (2-24 hr for 2PCA) at 37°C.\nSample desalting and cleanup\n3. Desalt the samples using the single-pot, solid-phase-enhanced sample-preparation (SP3) method. Aliquot 20 µl hydrophilic Sera-Mag Speedbeads and 20 µl hydrophobic Sera-Mag Speedbeads into the same 2-ml microcentrifuge tube. Vortex briefly to mix.\nWe have found that desalting 2PCA reactions with C18 reverse-phase cartridges does not efficiently remove 2PCA from the reaction, leading to inconsistent LC-MS/MS results. Using SP3 is therefore critical for reproducible results.\n4. Place the tube on a magnetic stand for 2 min to collect the beads. Aspirate the supernatant.\nAfter beads have been aliquoted, avoid touching them with a pipet tip as they can stick, leading to sample losses.\n5. Remove the tube from the magnetic stand. Add 1 ml water and vortex for 10 s to mix.\n6. Centrifuge for 2 s to collect liquid from the cap and sides of the tube. Place on a magnetic stand for 2 min to collect the beads. Aspirate the supernatant.\n7. Repeat steps 5 and 6 two additional times.\n8. Aliquot 1900 µl of LC-MS-grade acetonitrile into a 2-ml microcentrifuge tube. Add the 2PCA reaction mixture to the tube.",
    "The final concentration of acetonitrile must be ≥95% for efficient peptide precipitation onto the beads to occur in the next step.\n9. Transfer the acetonitrile/peptide mixture from step 8 to the tube containing the washed beads from step 7. Vortex immediately.\nIf beads aggregate quickly onto the side of the tube, sonicate for 1 min using a water bath sonicator.\n10. Incubate samples on a Thermomixer at 1000 rpm at room temperature for 10 min.\n11. Centrifuge for 2 s to collect liquid on the sides of the tube and cap. Place the tube on a magnetic stand for two minutes to collect the beads. Aspirate the supernatant.\n12. Wash the beads by adding 1 ml LC-MS-grade acetonitrile. Vortex immediately, and then place on a Thermomixer at 1000 rpm at room temperature for 30 s.\n13. Centrifuge for 2 s to collect liquid on the sides of the tube and cap. Place the tube on a magnetic stand for two minutes to collect the beads. Aspirate the supernatant.\n14. Repeat steps 12 and 13 two additional times.\n15. Air dry the beads for 2 min to ensure that no acetonitrile remains.\nVisually inspect the tube for drops of acetonitrile. If acetonitrile remains after 2 min, air dry for longer.\n16. Elute the peptides by adding 100 µl LC-MS-grade water. Sonicate the samples in a water bath sonicator for 1 min, and then place the tube in a Thermomixer at room temperature at 1000 rpm for 5 min.\n17. Centrifuge for 2 s to collect liquid from the sides of the tube and cap. Place the tube on a magnetic stand for 2 min.\n18. Transfer the supernatant, which contains the eluted peptides, to a clean 1.5-ml microcentrifuge tube.\nQuantification and analysis of peptides",
    "19. Quantify the peptides by measuring the absorbance at 280 nm on a Nanodrop spectrophotometer.\nAssume that an A280 nm of 1 corresponds to a peptide concentration of 1 mg/ml peptide.\n20. Dilute the sample to a concentration of 0.1 mg/ml in 0.1% formic acid.\nIf peptides are not concentrated enough, concentrate in a vacuum centrifuge.\n21. Analyze 5 µl of 0.1 mg/ml sample by LC-MS/MS.\nA typical analysis is performed using an Acclaim PepMap RSLC column (75 μm × 15 cm, 2 μm particle size, 100-Å pore size, Thermo Scientific) on a Thermo Dionex UltiMate 3000 RSLCnano liquid chromatography system with an aqueous mobile phase (mobile phase A) of 0.1% formic acid and an organic mobile phase (mobile phase B) of 0.1% formic acid/80% acetonitrile. Samples (5 µl, 500 ng) are loaded over 15 min at 0.5 µl/min in 97% mobile phase A and separated at 0.3 µl/min with a linear gradient from 97% mobile phase A to 50% mobile phase B over 120 min. Data-dependent acquisition of MS data is performed on an Orbitrap Exploris 480 mass spectrometer (Thermo Scientific) using the parameters given in Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.798#cpz1798-tbl-0001].\n22. Analyze raw files using Proteome Discoverer software. Search data using the human or E. coli SwissProt database, depending on the proteome used to generate the library. Select the appropriate protease specificity and set it to full cleavage with up to 2 missed cleavages. For data collected on a Thermo Orbitrap Exploris, set the precursor ion mass tolerance to 10 ppm and fragment ion mass tolerance to 0.02 Da. Set cysteine carbamidomethylation (+57.0215 Da) as a static modification. Set acetylation (+42.0106 Da), methionine loss (–131.0404 Da), and methionine loss plus acetylation (–89.0299 Da) as dynamic N-terminal protein modifications. Set 2PCA (+89.0265 Da) as a dynamic modification at peptide N termini.",
    "This protocol describes how to profile the specificity of subtiligase using proteome-derived peptide libraries. Detailed protocols for purification of subtiligase and synthesis of its substrate have been previously published in another Current Protocols paper (Weeks & Wells, 2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.798#cpz1798-bib-0018]). Libraries are modified with a biotinylated peptide ester subtiligase substrate (Tev Ester 6) that also contains a tobacco etch virus (TEV) protease cleavage site and an aminobutyric acid (Abu) mass tag (Weeks & Wells, 2018[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.798#cpz1798-bib-0016], 2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.798#cpz1798-bib-0018]). Subtiligase-modified peptides are enriched on neutravidin resin and then selectively eluted using TEV protease, leaving Abu at the N terminus of each subtiligase-modified peptide. Analysis of the eluted peptides by LC-MS/MS reveals the sequences of the labeled peptides, enabling the user to identify the sequence preferences and biases of the subtiligase variant tested. This protocol is expected to result in the enrichment and identification of thousands of peptides from each peptide library (Fig. 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.798#cpz1798-fig-0005]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/bca75630-d8a4-4fd7-9569-55bf358f0263/cpz1798-fig-0005-m.jpg</p>\nFigure 5\nExample data for subtiligase specificity profiling using E. coli proteome-derived peptide libraries. E. coli proteome-derived peptide libraries were incubated with 1 µM subtiligase, 200 µM Tev Ester 6, and 100 mM tricine, pH 8, for 2 hr at room temperature. Biotinylated peptides were then enriched and selectively eluted according to Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.798#cpz1798-prot-0004], leaving behind an aminobutyric acid (Abu) mass modification at the N terminus of each subtiligase-modified peptide. The left panel compares the total number of peptides observed in each experiment to the number of subtiligase-modified peptides. The right panel shows a heatmap of z-scores (standard scores) that describe over- or under-representation of each sequence among the enriched peptides compared to an input library control that was analyzed separately. (A) Subtiligase specificity profiling with an E. coli trypsin library. (B) Subtiligase specificity profiling with an E. coli GluC library.\nMaterials\nMilli-Q water",
    "1 M tricine, pH 8 (Bio-Rad, cat. no. 1610713)\n2 mg/ml trypsin, GluC, and/or chymotrypsin proteome-derived peptide libraries (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.798#cpz1798-prot-0001])\n20 mM Tev Ester 6 (TE6) in DMSO (Weeks & Wells, 2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.798#cpz1798-bib-0018])\nSubtiligase or subtiligase mutant, 50 µM stock solution (Weeks & Wells, 2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.798#cpz1798-bib-0018])\n8 M and 4 M guanidine hydrochloride (GdnHCl; ChemImpex, cat. no. 00152)\nHigh-capacity Neutravidin Agarose resin (Thermo, cat. no. 29202 or 29204)\n100 mM ammonium bicarbonate (Sigma-Aldrich, cat. no. 09830-500G; make fresh on day of use)\n1 M DTT (Goldbio, cat. no. DTT100)\nTEV protease (New England BioLabs, cat. no. P8112S, or purified in-house)\nAcetonitrile (Optima LC-MS grade; Fisher, cat. no. A955)\n0.1% TFA (use LC-MS-grade water [Fisher, cat. no. W64] to prepare)\n0.1% formic acid (use LC-MS-grade chemicals to prepare)\n0.1% TFA/50% acetonitrile (use LC-MS-grade chemicals to prepare)\n1.5-ml microcentrifuge tubes (Axygen, cat. no. MCT-150-L-C)\nMicrocentrifuge\nRotisserie mixer (such as the Labnet Mini Lab Roller, Labnet, cat. no. H5500)\n1-ml-volume spin columns (Pierce Snap-Cap, Thermo, cat. no. 69725)\nVacuum centrifuge (e.g., SpeedVac)\nSOLA HRP Cartridges (Thermo, cat. no. 60109-001) or similar reverse-phase desalting devices\nSpectrophotometer (such as a Nanodrop microvolume spectrophotometer)\nLabeling peptide libraries\n1. Prepare a 100-µl reaction mixture by combining 37 µl Milli-Q water, 10 µl of 1 M tricine, pH 8, 50 µl of 2 mg/ml peptide library, and 1 µl of 20 mM TE6.\nFinal concentrations are 100 mM tricine, pH 8, 1 mg/ml peptide library, and 200 µM TE6.\n2. Initiate the reaction by adding 2 µl of 50 µM subtiligase or variant. Mix well by pipetting up and down several times.\nFinal concentration of subtiligase is 1 µM.\n3. Allow the reaction to proceed for 1 hr at room temperature.",
    "4. Add 100 µl of 8 M GdnHCl to achieve a final concentration of 4 M GdnHCl. Vortex to mix.\nEnrichment of biotinylated peptides\n5. Prepare High-Capacity NeutrAvidin Agarose resin for enrichment. Invert bottle several times to generate a uniform slurry, and then aliquot 250 µl slurry into a 1.5-ml reaction tube for each sample.\nA sufficient quantity of NeutrAvidin resin must be used to capture all TE6 added to the reaction to avoid losses of modified peptides. Based on the stated capacity of High-Capacity NeutrAvidin agarose resin (8 mg/ml of biotinylated bovine serum albumin [BSA]) and the molecular weight of BSA (66,430 Da), we estimate that the resin capacity is 0.12 µmol biotin/ml.\n6. Centrifuge resin for 2 min at 500 × g, room temperature, in a microcentrifuge. Aspirate the supernatant.\n7. Resuspend resin in 500 µl of 4 M GdnHCl.\n8. Centrifuge resin for 2 min at 500 × g, room temperature, in a microcentrifuge. Aspirate the supernatant.\n9. Repeat steps 7 and 8 two more times.\n10. Dilute the reaction mixture from step 4 with 100 µl of 4 M GdnHCl. Add the mixture to the prepared NeutrAvidin resin from step 9.\n11. Place the tubes on a rotisserie or end-over-end mixture and incubate 30 min-20 hr.\nThis step is a potential pause point.\n12. Centrifuge resin for 2 min at 500 × g, room temperature, in a microcentrifuge. Aspirate the supernatant.\n13. Resuspend resin in 500 µl of 4 M GdnHCl. Vortex briefly to mix.\n14. Centrifuge resin for 2 min at 500 × g, room temperature, in a microcentrifuge. Aspirate the supernatant.\n15. Repeat steps 13 and 14 two more times.\n16. Add 500 µl 100 mM ammonium bicarbonate to the resin. Vortex briefly to mix.",
    "17. Centrifuge resin for 2 min at 500 × g, room temperature, in a microcentrifuge. Aspirate the supernatant.\n18. Repeat steps 16 and 17 two more times.\n19. Resuspend the resin in 250 µl 100 mM ammonium bicarbonate. The total volume of buffer and slurry is now 375 µl.\n20. Add 1 µl 1 M DTT to achieve a final concentration of 2.7 mM DTT.\nAddition of DTT is a critical step. TEV protease is a cysteine protease that requires a reducing agent to maintain activity.\n21. Add 5 µl of 2 mg/ml (10 µg total) TEV protease. Incubate at room temperature on a rotisserie or end-over-end mixer for 2-6 hr at room temperature or for 16-20 hr at 4°C.\nTEV protease may be purified in-house or purchased from commercial sources. This step represents a potential pause point.\n22. Centrifuge resin 2 min at 500 × g, room temperature, to collect droplets that may have accumulated on the cap.\nDo not discard supernatant at this step. Centrifugation is used to spin down any liquid that may have accumulated on the cap during incubation back into the tube.\n23. Resuspend resin in the supernatant, and transfer to a snap-cap spin column. Place column in a clean 1.5-ml microcentrifuge tube.\n24. Centrifuge column 2 min at 500 × g, room temperature. Save flowthrough, which contains the eluted N-terminal peptides.\n25. Wash resin once with 125 µl of 100 mM ammonium bicarbonate. Combine wash with the flowthrough from step 24.\nThis solution contains the eluted N-terminal peptides.\n26. Dry sample in a vacuum centrifuge.\n27. Resuspend pellet in 50-100 µl of 5% TFA to precipitate the TEV protease. Incubate on ice for 10 min. Add 1 µl solution to a strip of pH paper to check that the pH is below 3.",
    "If pH is above 3, continue to add 5% TFA until the pH is below 3.\n28. Centrifuge using a benchtop microcentrifuge 10 min at 21,000 × g, 4°C, to pellet precipitated TEV protease.\nThe pellet may not be visible. Note the orientation of the tube in the centrifuge to avoid disturbing the pellet in the next step.\n29. Transfer supernatant to a fresh 1.5-ml microcentrifuge tube.\nTake care to avoid disturbing the pellet.\n30. Desalt the sample with a SOLA HRP Cartridge according to the manufacturer's instructions.\nSimilar C18 cartridges from other vendors or StageTips constructed in house are also suitable for desalting.\n31. Dry the peptide in a vacuum centrifuge.\n32. Resuspend dried peptides in 12-20 µl of 0.1% formic acid.\nQuantification and analysis of peptides\n33. Quantify the peptides by measuring the absorbance at 280 nm on a Nanodrop spectrophotometer.\nAssume that an A280 nm of 1 corresponds to a peptide concentration of 1 mg/ml peptide.\n34. Dilute the sample to a concentration of 0.1 mg/ml in 0.1% formic acid.\n35. Analyze 5 µl of sample by LC-MS/MS.",
    "A typical analysis is performed using an Acclaim PepMap RSLC column (75 μm × 15 cm, 2 μm particle size, 100-Å pore size, Thermo Scientific) on a Thermo Dionex UltiMate 3000 RSLCnano liquid chromatography system with an aqueous mobile phase (mobile phase A) of 0.1% formic acid and an organic mobile phase (mobile phase B) of 0.1% formic acid/80% acetonitrile. Samples (5 µl, 500 ng) are loaded over 15 min at 0.5 µl/min in 97% mobile phase A and separated at 0.3 µl/min with a linear gradient from 97% mobile phase A to 50% mobile phase B over 120 min. Data-dependent acquisition of MS data is performed on an Orbitrap Exploris 480 mass spectrometer (Thermo Scientific) using the parameters given in Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.798#cpz1798-tbl-0001].\n36. Analyze raw files using Proteome Discoverer software. Search data using the human or E. coli SwissProt database, depending on the proteome used to generate the library. Select the appropriate protease specificity and set it to full cleavage with up to 2 missed cleavages. For data collected on a Thermo Orbitrap Exploris, set the precursor ion mass tolerance to 10 ppm and fragment ion mass tolerance to 0.02 Da. Set cysteine carbamidomethylation (+57.0215 Da) as a static modification. Set acetylation (+42.0106 Da), methionine loss (–131.0404 Da), and methionine loss plus acetylation (–89.0299 Da) as dynamic N-terminal protein modifications. Select Abu (+85.05276 Da) as a dynamic modification at peptide N termini."
  ],
  "subjectAreas": [
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}