{
  "id": 7547,
  "origin_website": "Bio",
  "title": "Small Molecule Screening of Primary Human Acute Myeloid Leukemia Using Co-culture and Multiplexed FACS Analysis",
  "procedures": [
    "AML phenotypingRecover viable AML cellsRemove a vial of leukemia primary cells from storage and place it on dry ice or in liquid nitrogen.Carefully wipe the still-frozen vial with 70% ethanol.In the LAF bench, use a 1 mL sterile tip to scrap frozen bits of the sample directly into a FACS tube, previously filled with 4 mL of thawing medium and kept on ice.Spin down at 250 × g and 4°C for 5 min, and carefully aspirate the supernatant, by slowing tilting the tube and letting the liquid run on the tube wall into the aspiration pipette.During the centrifugation, transfer the vial back to storage.Add 2 mL of wash buffer, and repeat the centrifugation step, at 350 × g this time.Stain the cellsAdd 50 μL of LSC staining solution.Incubate in the dark at 4°C for 30 min.Add 1 mL of wash buffer.Spin down at 350 × g and 4°C for 5 min.During the staining time, prepare the compensation controls with beads.FACS and analyze.Note: The goal is to establish which epitopes are expressed by each individual sample, when this information is not provided by the clinic. The cell numbers/recovery at the surface of the frozen vial is generally poor and does not necessarily reflect the overall sample. Even over a short period of time, the use of liquid nitrogen for transport is better than dry ice to preserve the cells. Stroma thawingOn ice, cool down 20 mL of OP9-M2 medium in a 50 mL tube.Collect and transport a vial of frozen OP9-M2 (or OP9) on dry ice. Carefully wipe the still-frozen vial with 70% ethanol.In the LAF bench, pipette about 0.5 mL of ice-cold OP9-M2 medium on the frozen cells. Immediately, collect and pipette the cells back into the tube of thawing solution, which was kept on ice.",
    "Repeat until complete thawing of the cell pellet.Spin at 300 × g, and 4°C for 5 min.Aspirate supernatant.Resuspend the cell pellet, first with 1 mL of OP9-M2 medium, then up to 5–10 mL.For cell count, collect 50 μL in an Eppendorf tube prefilled with 50 μL of trypan blue.Spin at 350 × g and 4°C for 5 min .Count cells during spinning.Resuspend the cell pellet first with 1 mL of ice-cold OP2-M2 culture medium.For seeding a 10 cm2 dish, collect about 850,000 cells in a 15 mL tube. Add up to 10 mL of OP2-M2 culture medium.Mix well, seed, and transfer to an incubator overnight.Check for survival the day after. If cells are over 50% confluent, replate (see section C).Stroma maintenanceAspirate the supernatant by gently tilting the dish to one side. Avoid touching the cells, but stay as far away as possible from the dish’s rim.Wash away any trace of FCS by gently adding 10 mL of PBS at room temperature (RT)/ pre-warmed at 37°C .Aspirate as described in step C1.Add 1 mL of Trypsin EDTA. Transfer to an incubator.After 4–5 min, check for cell rounding under a microscope.Gently tap the side of the dish to help detaching cells.As soon as all cells are detached, use a 1 mL pipette to quickly break down cell clusters.Add 1 mL of FCS, and transfer to a 50 mL tube. Complete the volume up to 10 mL with PBS.For cell counting, collect 50 μL in an Eppendorf tube prefilled with 50 μL of trypan blue.Spin at 350 × g and 4°C for 5 min.Count cells during spinning.For seeding a 10 cm2 dish, collect about 500,000 cells in a 15 mL tube. Add up to 10 mL of OP2-M2 culture medium.Mix well, seed, and transfer to an incubator.",
    "Note: Doubling time is approximately 24 h. Cells must be kept under 90% confluence, as they are sensitive to cell-cell contact inhibition that triggers adipocytic differentiation (Figure 1A) and loss of hematopoietic support potential. On the other hand, too few cells will present the risk of clonal selection.  Stroma platingPrepare single cell suspension as described in steps C1–C11.Aspirate supernatant.Resuspend pellet with 1 mL of ice-cold OP9-M2 media into a single cell suspension, fill up to 2.5 mL with ice-cold OP9-M2 media, and transfer to a 15 mL tube.Keep on ice and irradiate with 2000 rad.Add OP9-M2 medium to a total of 10 mL, and filter the resuspended cells through a 40 μm cell strainer into a 50 mL tube.For cell counting, collect 50 μL in an Eppendorf tube prefilled with 50 μL of trypan blue.Spin at 350 × g and 4°C for 5 min. Aspirate supernatant.Ressupend pellet with 1 mL of ice-cold OP9-M2 media into a single cell suspension.Collect the appropriate cell number for the experiment and adjust the volume with OP9-M2 medium to a cell concentration of 5 × 105 cells/mL.Transfer cell suspension into a sterile reservoir and, using a digital multichannel stepper, distribute 50 μL/well in 96 half-area well plates.Incubate at 37°C for 4–16 h prior to AML plating. Note: Half-area 96 wells plates will help in limiting corner effect by reducing evaporation, as well as reducing cell numbers, which often is limited, still being compatible with standard multichannel pipettes. After irradiation, the OP9-M2 should be close to confluence (90%) since we observed that the hematopoietic cell to stromal cell contact is essential for the supportive effect of OP9-M2 cells (Figure 1B). To best this, each individual researcher has to establish their own cell concentration before plating.  AML platingThaw cells as described in steps B1–B6 using thawing medium.",
    "Resuspend cell pellet with 1 mL of cold PBS, then fill up to 5–10 mL.For cell count, collect 50 μL in an Eppendorf tube prefilled with 50 μL of trypan blue.Spin at 350 × g and 4°C for 5 min. Aspirate supernatant.Resuspend cell pellet first with 1 mL of ice-cold 3× LIC culture medium into a single cell suspension. Adjust the volume to the desired cell concentration (0.04 × 106 –2 × 106 cell/mL).Transfer cell suspension into a sterile reservoir and using a digital stepper, carefully distribute 25 μL/well in 96 half-area well plates.Place the plates in a humid chamber (built by placing an opened 10 cm dish filled with PBS) within the incubator and grow at 37°C for 36–48 h prior to compound addition, to avoid culture shock (Magnusson et al., 2013).Compound additionPrepare serial dilutions of the libraries in LSC medium so that each compound is 4× the assay concentration.Using a multichannel pipette, dispense 25 μL/well.Place plates back in the humid chamber, and keep them in the 37°C incubator for 4 days. Note: If possible, randomly distribute the control wells over the 96 well plate (a minimum of 4 wells/plate) to avoid any bias. At this level of irradiation, OP9-M2 cells continue to grow and will present signs of differentiation at the time of analysis (Figure 1C). When considering compound concentration, bear in mind that the co-culture appears to have a clearance/dilution effect, as illustrated by the increased IC50 of cytarabine in the presence of OP9-M2 cells (Figure 1D).  imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4353/bioprotoc-12-06-4353-g001.jpgFigure 1. Stromal co-culture alters the ex vivo behaviour of healthy and malignant hematopoietic cells.  OP9-M2 cells were photographed at A) optimal confluence (left) and one week later (right).",
    "B) Representative change in hematopoietic stem and progenitor cells (HSPC) markers from CD34+ umbilical cord blood cells cultured for 10 days with OP9-M2 or BFC012 cells and/or supernatant (S.N.). Statistical significance was calculated with a t-test. *P < 0.05, **P < 0.001. C) Hematopoietic cells (arrow) were cultured for 6 days in the presence of irradiated OP9-M2 cells. D) Graph shows the non linear fit regression of normalized cell number of primary pediatric AML cells after 4 days of treatment with cytarabine in the presence or absence of irradiated OP9-M2 cells. Volumetric cell count was acquired by FACS and the IC50 of cytarabin was calculated using Prism software. Scale bars: 100 μm.FACSPrepare staining and control mixThe day before analysis, visually check for live cells on the control plate and prepare staining and control mixes according to Tables 1 and 2.Sample collectionOn the day of analysis, collect the entire well content by pipetting up and down using a multichannel pipette, to a 96 V-shape plate. Carefully mark lids and collecting plates.With a multichannel stepper, add 100 μL of ice-cold wash buffer to each well.Spin at 350 × g and 4°C for 5 min.Empty the plates by returning them ONCE over absorbing paper placed in a biological waste bin in a swift but firm move.Samples stainingTransfer the staining mix to a reagent reservoir.With a multichannel stepper, add 25 μL/well of LSC staining solution from a 10 mL reagent reservoir. Prepare the single stain and FMO controls in tubes or a separate plate.Gently shake plates on a shaker until pellets are re-suspended and incubate at 4°C in the dark for 30 min.With a multichannel stepper, add 125 μL of ice-cold wash buffer to each well.Spin at 350 × g and 4°C for 5 min.",
    "Empty the plates by returning them ONCE over absorbing paper placed in a biological waste bin in a swift but firm move.With a multichannel stepper, add 150 μL of ice-cold 7AAD solution from a reservoir to each well.Keep plates on ice/4°C in the dark until FACS.FACSWhen setting the HTS unit, set the stopping gate on a very high event (1,000,000) to acquire the same volume (100 μL for HTS connected to BD analyzers), and therefore extract the volumetric count at the analysis."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}