{
  "id": 9388,
  "origin_website": "Jove",
  "title": "Sex Stratified Neuronal Cultures to Study Ischemic Cell Death Pathways",
  "procedures": [
    "All procedures in this protocol were conducted according to the National Institute of Health guidelines for the ethical treatment and care of animals, and according to an approved IACUC animal use protocol.\n1. Preparation of Tissue Culture Dishes, Culture Media, and Dissection Instruments to be Performed at Least One Day Before Dissection\nPrepare 1 L borate buffer: 3.1 g/L boric acid and 4.75 g/L Borax in double distilled H2O. Adjust pH to 8.4. Filter-sterilize and store at 4 °C until use.\nDilute poly-D-lysine to 0.1 mg/ml.\n\t\nUnder a laminar-flow tissue culture hood, place enough diluted poly-D-lysine to generously cover the bottom of each well of a multi-well, culture-treated, sterile tissue culture plate. (If desired, precleaned, sterile, glass-cover slips can be added to the bottom of each well before the addition of poly-D-lysine. Cover slips can float after the addition of poly-D-lysine, so they should be pushed down with sterile forceps if necessary.)\nIncubate the plates overnight in the incubator at 37 °C.\nPrepare 1 L of dissection buffer: 350 mg/L NaHCO3, 2.38 g/L HEPES, 1.44 g/L MgSO4, and 300 mg/L BSA in 1x Hanks Balanced Salt Solution without Ca, Mg, sodium pyruvate, or phenol red. Adjust pH to 7.3. Filter-sterilize and store at 4 °C until needed.\nPrepare 500 ml plating medium: 10% Fetal Bovine Serum, 100 units/ml each of penicillin and streptomycin, and 2.5 mM glutamine in MEM without phenol red. Filter-sterilize. Store at 4 °C until needed. Discard any unused medium after 1 month.\nPrepare 500 ml feeding medium: 2% B-27 supplement, 100 units/ml each of penicillin and streptomycin, and 2.0 mM GlutaMAX (not glutamine) in Neurobasal without phenol red. Filter-sterilize. Store at 4 °C until needed. Discard any remaining feeding medium after 1 month.",
    "Prepare 10 ml of 100 mM CaCl2, 500 mM EDTA, and 1 M NaOH as needed according to standard methods.\nAutoclave the surgical/dissection instruments and store under sterile conditions until needed. This procedure requires two sharp extra-fine tipped angled forceps, a fine tipped curved forceps, a serrated curved forceps, a small rat-toothed forceps, one pair of micro-surgical scissors, one pair of fine, narrow tipped surgical scissors, one pair of medium tipped scissors, and a blunt-ended dissection probe. Additional sterile instruments can be added according to personal preference.\n2. Preparation of Tissue Culture Dishes, Culture Media, Dissection Instruments, and Dissection Area to be Performed on the Day of Dissection\nWash the poly-D-lysine coated tissue culture plates. Under the laminar flow biosafety cabinet, aspirate the poly-D-lysine with a vacuum line or pipette, add water to each well, and incubate at room temperature for ~5 min. Aspirate the water and replace it with clean, sterile water. Repeat 3x.\n\t\nAllow the plates to fully dry at room temperature.\nPrepare the dissection area by wiping down the counter and dissection scope with 70% ethanol.\n\t\nSaturate a large Kimwipe with 70% ethanol, and lay out the autoclaved dissection tools. Cover with another Kimwipe.\nFill a large, flat dish with ice. Label and fill an appropriate number of 60 mm culture dishes with cold dissection solution. Prepare enough dishes to keep the male and female heads, brains, and hippocampi separate (if applicable).\nFill two larger 100 mm culture dishes with cold dissection buffer.\nSet aside a separate 100 mm dish without buffer (dry).\nEstablish an area for biohazard waste and another for animal tissue (to be disposed of appropriately after the dissection, according to institutional standards).",
    "Warm 30 ml plating media in a 37 °C water bath. This warm solution will be used in the cell disassociation phase of the protocol.\nPlace 1 ml of plating media into each well of 24-well, poly-D-lysine coated, tissue culture plate. Use an appropriate smaller volume if smaller plates are used. Place the covered plate into a 37 °C incubator at 5% CO2 to warm and equilibrate to the CO2 during the dissection.\nPrepare the papain solution.\n\t\nLabel two 15 ml sterile conical tubes, one as \"male\", and the other as \"female\".\nAdd the following to each tube: 10 ml of dissection buffer, 150 μl 100 mM CaCl2, 10 μl 500 mM EDTA, 10μl 1 M NaOH, and 150 U of papain.\nGently mix by inverting the tube three times, then warm in a 37 °C water bath. Note: Each vial of papain will have a different unit of activity per mg of papain, thus the volume of papain added to solution will differ from vial to vial. The papain will be cloudy initially, but the solution will clear as the papain dissolves completely.\n3. Harvesting, Sexing, and Dissection of E18 Embryos\nAnesthetize the pregnant female mouse with isoflurane or other appropriate anesthesia. Euthanize the mouse under deep anesthesia by decapitation or cervical dislocation.\nWorking quickly, clean the female's abdomen with 70% ethanol. If desired, the abdomen can be shaved before being sprayed with ethanol to reduce risks of contamination. Lift the abdominal skin with the rat-toothed forceps. Make a large incision in the abdomen with the medium-tipped scissors, cutting through skin and abdominal muscles, exposing the internal organs.",
    "Carefully remove the embryos, lifting each entire uterine horn clear of the abdomen, being careful not to let it contact any external tissue if possible (to avoid contamination). Place the uterine horns containing the embryos into a dish with cold dissection saline and transfer to ice.\nCarefully remove each pup from the uterine horns and the embryonic sac. The pups are fragile, so this is best done by cutting the uterine tissue between each embryo to expose the embryonic sac, and then carefully slicing the sac on the surface with the edge of the small, narrow scissors. The embryonic fluid and the pup can then be gently pushed through the opening without damage to the embryo.\n\t\nIf the incision in the embryonic sac is not large enough for the fluid and pup to come out easily, then enlarge the incision carefully until the pup slides out with minimal force.\nDo not squeeze the sac too forcefully to force the embryo out, as this too could damage the embryos.\nRemove the head from a single embryo. Leave the head in a dish of dissection saline on ice. Place the body of the embryo on its back on the dry 100 mM dish under the dissection scope. Using the curved medium-tipped forceps in one hand and the serrated curved forceps in the other, gently flatten the pup out, pushing the back legs down and ventral, the front legs down and dorsal.\nRemove the tail with scissors if necessary; the tail tends to curl up over the abdomen and can get in the way of the dissection.",
    "Release the back legs and pinch the abdomen at the root of the umbilical cord, called the umbilicus. Lift up gently. Release the front legs and with the other hand and the micro-scissors, make a small inverted \"v\" in the abdomen just above the umbilicus with the point of the \"v\" pointing cranial.\nExchange the scissors for the curved forceps again. Turn the forceps over so that the point is up and away from the animal. With gentle force, push down and dorsal on the rib-cage with the closed, rounded edge of the curved forceps, while pulling down and ventral with the other forceps, spreading the pup out ventral to dorsal. This spreading motion will open the abdominal cavity, exposing the intestines, liver, and other internal organs.\nUsing the curved forceps, very gently push the intestines and liver cranially using repeated sweeping motions. This will gradually expose the kidneys, bladder, and most importantly, the internal sex organs.\n\t\nMale pups are identified by the presence of striated testes found just below the kidneys on each side. The testes are approximately ⅓-½ the size of the kidneys and occasionally will have dropped to sit just above the bladder.\nFemales are most readily identified by a lack of testes, but can also be identified by the small uterus that sits above the bladder, and fallopian tubes that extend up toward the kidneys. Under high-power on the dissection scope, the ovaries can also be identified as small, dark organs at the end of the fallopian tubes immediately below and sometimes underneath the kidneys bilaterally.\nOnce the sex is determined, discard the body and place the head in an appropriately labeled dish (male or female). Keep the heads on ice in dissection solution.",
    "Repeat steps 3.5-3.10 until each pup has been sexed. For best results, wipe the dish clean with a Kimwipe between each dissection; fluid makes the pups slippery and difficult to grasp for the dissection.\nOnce all embryos have been sexed and the male and female heads have been separated, proceed with the rest of the dissection taking especial care to keep all male and female-derived tissue separate.\nTransfer one brain at a time to a 100 mM dish filled with cold dissection buffer. Under the dissection scope, use the curved forceps to pierce the eyes of the embryo to anchor it for dissection. Using the microsurgical scissors, make a shallow midline incision, splitting the skin and skull down the midline, from base of skull to top of the head just above the nasal passage.\nGently push aside the skin and skull bilaterally and very gently extract brain by carefully scooping it from the forebrain towards the brainstem with the base of the micro-surgical scissors or with a closed, angled forceps.\n\t\nCarefully use the forceps to transfer the extracted brain to a clean, labeled dish filled with cold dissection buffer. Keep the dish on ice.\nRepeat this process until all brains have been harvested.\nThis step should yield two plates of whole brains in dissection buffer, one for male and one for female tissue.",
    "Place a clean dish beneath the dissection scope and fill with dissection buffer. Pour just enough solution to keep the brains moist throughout the dissection of the hippocampus; too much will cause the brain to float and make handling difficult. If desired, precoat the dissection dish with sterile wax. The wax provides nonslip surface upon which to work and protects the tips of delicate dissection instruments; scratching the bottom of a noncoated dish can bend or dull the sharp edges of the tools.\nChange the dissection scope to a high-power setting, and adjust the focus accordingly. Carefully transfer one brain at a time to dissection dish. Using the extra-fine tipped forceps, tease apart each brain hemisphere and pinch them off of the brainstem.\nVery carefully, remove the meninges from each hemisphere. (The meninges are a pinkish membrane, rich with blood vessels, and are a common source of glial contamination in a neuron culture.)\n\t\nTo remove the meninges, delicately pinch, lift, and pull at the membrane, being careful not to pierce the brain tissue beneath.\nPull the meninges away from the brain, allowing the brain to roll a bit beneath the forceps but keeping it in place so that the membrane can be pulled away.\nAt this point, you may further dissect the brain to use the tissue of choice.  For example, dissect the hippocampus from each hemisphere. Place one hemisphere with the lateral side down. Observe the large ventricle cavity, which creates a flap covering the hippocampus. Gently tease this flap back until the crescent-shaped hippocampus can be observed. The hippocampus is slightly raised and sits between the mid-brain and cortex.\nUsing two pair of sharp, extra-fine forceps, hold the brain hemisphere open with one hand and cut the hippocampus away from the cortex and mid-brain with the other.",
    "Place the hippocampus in a correctly labeled dish (male or female) filled with dissection buffer and kept on ice.\nDissect the hippocampus from the remaining hemisphere and repeat this process with each brain.\nTransfer the hippocampi into appropriately labeled 15 ml conical tubes.\n\t\nGently wash twice with cold dissection buffer. Use vacuum suction very carefully at this stage. The hippocampi are small and can be irrecoverably lost to the vacuum. Prevent this by allowing the tissue to settle to the bottom of the tube, remove as much liquid as possible from the tube with a pipette, discard the solution, and replace with fresh, clean dissection buffer.\nRepeat step 3.20.1.\n4. Neuronal Dissociation\nTransfer the hippocampi to appropriately labeled, prewarmed papain solution. Place in a 37 °C water bath and incubate for 8-10 min, gently inverting the tubes to mix every 2-3 min.\nRemove the papain mix and tissue from the water-bath. Allow the tissue to settle, and then carefully remove as much of the papain solution as possible with a pipette, leaving the tissue at the bottom of the tube. Wash the tissue 3x with plating media. The serum in the plating media quenches the papain enzymatic digestion. Trypsin inhibitor is needed if serum is not used in the plating media.\nRemove the plating media.\n\t\nAdd 2 ml of fresh neurobasal medium and gently dissociate tissue using a 5 ml serological pipette set on the slowest speed.\nDissociation is performed by gently pipetting up and down 8x. Be careful not to introduce bubbles into solution. For best results, pick the solution and tissue up in the pipette and then release the solution onto the side of the conical tube, allowing the tissue to slide down the side and back to the bottom of the tube.",
    "After the 8th trituration, allow the tissue to settle and collect the cloudy media on top. This media contains disassociated cells.\n\t\nTransfer it to a new, labeled tube.\nAdd an additional 2 ml to the undisassociated tissue.\nTriturate again another 8x.\nHarvest the cloudy media.\nRepeat this process 3-5x. Some undissociated tissue will remain. While it is possible to triturate until all tissue is dissociated, excessive trituration results in poor neuronal health and is not recommended.\nAdd extra medium to the conical tubes as necessary to equalize the volumes and weights between male and female tissue. Centrifuge the cells in a spinning bucket centrifuge at 228 x g for 5 min. Carefully remove the supernatant.\nGently resuspend the cells in 2 ml fresh plating media and filter the solution through a mesh cell strainer into a clean, labeled, 50 ml conical tube.\nAdd 50 μl cell suspension to 450 μl of 0.4% Trypan Blue. Incubate the cells for 2 min in Trypan Blue, mix gently, and load 10 μl onto a hemocytometer. Count the cells excluding those that have taken up the Trypan Blue dye; dark blue cells are dead or dying.\n5. Plating and Culture Maintenance\nCalculate the correct volume of cell suspension to add to each well of the tissue culture plate to yield the desired cell density. Neuron cultures are very sensitive to cell density and do best at medium to high density unless cocultured with glia or fed with glial conditioned media. In this protocol, cells are plated at 150,000-200,000 cells/cm2.\nRemove the tissue culture plate prefilled with plating media from the incubator (prepared in step 2 above).",
    "Gently swirl the cell suspension in the 50 ml conical tube, then pipette the desired volume of cell suspension (calculated above in step 5.1) to the center of each well.\nRepeat, swirling the cell suspension each time before pipetting to ensure equal cell density in each well. Cells settle quickly and cell density can change from well to well if the swirling step is skipped.\nOnce cells have been added to each well, gently swirl the plate to disperse the cells, and then immediately replace the dish in the incubator. Leave the cells undisturbed for at least 24 hr.\nAt least 24 hr after plating the cells, warm complete neurobasal feeding media to 37 °C. Aspirate the plating media from each well and replace it with feeding media. Aspirate and replace from one well at a time to minimize neuronal stress and improve cell survival.\nNeuron cultures should be fed every 4-7 days by carefully removing half of the medium and adding back an equal volume of fresh medium. Under these conditions, cultures can be maintained for two weeks. With primary neuronal cultures, some cell death is expected. Thus, as the cultures mature, the density will decrease. In this protocol, cell density decreases by approximately 30% by day 10 in vitro.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}