{
  "id": 17315,
  "origin_website": "Jove",
  "title": "Establishment of a Simple and Effective Rat Model for Intraoperative Parathyroid Gland Imaging",
  "procedures": [
    "All animal studies have been approved by the Institutional Animal Care and Use Committee (IACUC) of the Institute of Basic Medicine and Cancer, Chinese Academy of Sciences. This is a non-survival surgery.\n1. Animal\nUse a 6-8-week-old female SD rat, weighing 250 g, for intraoperative PG imaging.\n2. Anesthesia\nTurn on the anesthesia machine.\nBefore beginning, ensure the isoflurane level is full in the anesthesia vaporizer. Then, turn on the oxygen and set the flow rate to 0.4-0.8 L/min. Induce anesthesia with 3-5% isoflurane and maintain at 2% isoflurane (flow rate: 0.4-0.8 L/min).\nPut the SD rat into the box of the anesthesia machine and select the Channel model to begin animal anesthesia.\nObserve the rat activity in the box. When the rat falls into a coma, move it to the nose cone to maintain anesthesia (unconscious supine position without pain reflex and corneal reflex).\nUse the anesthesia mask to cover the nose of the rat and switch the anesthesia machine into Mask mode to keep the animal under anesthesia during the surgery.\n3. Posture and fixation\nTransfer the anesthetized rat onto a surgical drape on a surgery operation table. Place a prewarmed heating pad under the animal to sustain the animal's body temperature during the surgery.\nUse rubber bands to fix the rat's limbs to the operation table. Place a cylindrical pillow made of drape under the rat's shoulder to lean its head back, completely exposing the neck area. \nApply artificial tears ointment on both eyes of the rat to prevent dryness during anesthesia.\n4. Hair removal\nApply depilatory cream to the neck area: up to the submandibular space, down to the xiphoid process, and on both sides to the outside of the sternocleidomastoid muscle.\nAfter 3 min, gently wipe the hair and depilatory cream with a tissue.",
    "5. Sterilization\nUse an Iodophor cotton ball to disinfect the operation area 3 times from the middle of the neck to the surrounding area. Only disinfect the area from which hair was removed.\n6. Surgical drape laying\nUse a surgical drape to cover the operation area of the rat's neck. Keep the hole of the surgical drape aligned with the disinfection area of the animal.\n7. Incision\nConfirm the surgical plane of anesthesia via lack of a toe pinch reflex before making the incision. Then, fit the blade into the scalpel and use the scalpel to make a longitudinal incision in the anterior midline of the rat's neck. Ensure that the incision length is approximately 5 cm and only in the dermis.\n8. Dissection of subcutaneous tissue from the anterior cervical muscle\nLift the skin along both sides of the incision.\nUse a scissor to longitudinally cut along the linea alba cervicalis.\nUse forceps to separate the sternohyoid muscle and the sternothyroid muscle.\n9. Fix the anterior neck muscles to both sides\nUse vascular forceps to clamp the separated sternohyoid muscle and sternothyroid muscle in front of the neck and pull the clamped tissue outside.\nUse a retractor or the needle to pass the suture (3-0#) through the clamped tissue, make a knot, and fix the suture to the surgical drape of the operation table.\n10. Thyroid gland localization\nLocate the thyroid cartilage and cricoid cartilage as the upper boundary in the operation area. Identify the thyroid cartilage based on its shield shape and the cricoid cartilage based on its ring shape.\nLocate the trachea as the lower boundary in the operation area. Look for the trachea in the front and middle of the neck, based on its tubular cartilage ring shape.",
    "Locate the thyroid gland between the upper and lower boundaries-a red gland in the shape of a butterfly on the opposite side of the trachea.\n11. Visual identification of the PG\nLocate the PG on the upper and outer sides of the thyroid gland. Look for two PG in a fusiform shape of about 1.2-2 mm in length and 1.0-1.5 mm in width that are reddish but lighter than the surrounding thyroid gland with a certain boundary.\nTake a frontal photograph of the PG with the trachea, thyroid, and larynx to quantitatively compare the effects of IONP before and after injection. \nDissect the back of the esophagus, then use the retractor to expose the right side of the PG. Take a right-side photograph of the PG with the thyroid gland and trachea.\nSwap the retractor to expose the opposite side of the PG and take a left-side photograph of them with the thyroid gland and trachea.\n12. Thyroid injection of the IONPs\nUse an insulin syringe to locally inject 10 µL of IONPs suspension (20 mg/mL in phosphate-buffered saline) into the center of the thyroid gland. Gently press the injection site with gauze for 5 s.\n13. Identification of the PG after IONPs injection\nAfter injection, observe the rapid diffusion of the IONPs within the thyroid glands but not the PG, as it negatively stains the PG and differentiates them from the surrounding thyroid.\nTake a front photograph of the negatively stained PG together with the trachea, thyroid gland, and larynx.\nTake left- and right-side photographs of the negatively stained PG using the same procedures as mentioned above.\n14. Resection of the throat and trachea with the thyroid gland and PG",
    "Once the rats have inhaled excess isoflurane (5% isoflurane for more than 5 min) and are under deep anesthesia, euthanize them by intracardiac injection of 0.5 mL of saturated potassium chloride solution.\nPostmortem, remove the throat, trachea, thyroid gland, and PG.\nUnder a fume hood, place the removed throat, trachea, thyroid gland, and PG specimens into 4% paraformaldehyde solution for 24 h.\n15. Histopathology studies\nDehydrate the tissues and embed them in paraffin. Slice into 5 µm thick sections. Bake the sections at 37 °C in an oven overnight and at 65 °C for 1 h.\nStain the sections with hematoxylin and eosin (H&E) after washing 3 x 5 min with 75%, 95%, 100% gradient alcohol, and water washing at room temperature.\nHave pathologists examine the H&E-stained sections under a light microscope.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}