{
  "id": 7741,
  "origin_website": "Bio",
  "title": "Analysis of N<sup>6</sup>-methyladenosine RNA Modification Levels by Dot Blotting",
  "procedures": [
    "Isolation of total RNA For mammalian cells we recommend using approximately 1 × 107 cells for mRNA purification.Remove the medium and rinse the cells twice with 1–2 mL of ice-cold PBS.Remove PBS and lyse the cells directly in the culture dish by adding 1 mL of TRIzol reagent per 100 mm culture dish and scraping with a cell scraper.Pass the cell lysate through a pipette several times. Then, transfer to 1.5 mL RNase-free microcentrifuge tubes. Vortex thoroughly.Incubate the homogenized samples for 5 min at room temperature.Add 0.2 mL of chloroform, vortex for 30 s, and incubate for 2–3 min at room temperature.Centrifuge at 12,000 × g and 4 °C for 15 min.Carefully transfer the upper, aqueous phase to a fresh tube without disturbing the interface.Add 0.5 mL of isopropanol to the aqueous phase and mix well. Incubate the samples for 10 min at room temperature.Centrifuge at 12,000 × g and 4 °C for 10 min.Decant the supernatant and completely remove any traces of liquid by aspiration.Wash the pellet with 1 mL of ice-cold 75% ethanol.Centrifuge at 12,000 × g and 4 °C for 15 min.Remove all traces of ethanol. Air-dry or vacuum-dry the RNA pellet for 5–10 min.Resuspend the pellet in 10–30 μL of RNase-free water.mRNA purification Isolate mRNA from total RNA using the GenElute mRNA miniprep kit following the manufacturer’s instructions (other brands can also be used for the purification of mRNA).Mix the oligo (dT) beads thoroughly by vortexing and inverting until resuspended and homogenous.Add the resuspended oligo (dT) beads to the total RNA, cap the tube, and mix thoroughly by vortexing.Incubate the mixture at room temperature for 10 min. No mixing or rocking is necessary.Resuspend the pellet in 350 μL of wash solution by vortexing.Transfer the suspension into a GenElute spin filter–collection tube assembly by pipetting.",
    "Spin for 1–2 min at maximum speed.Remove the spin filter, discard the flow through liquid, then place the spin filter back into the same collection tube.Pipette 350 μL of low salt wash solution into the column. Spin for 1–2 min at maximum speed.Remove the spin filter, discard the flow through liquid, then place the spin filter back into the same collection tube.Pipette another 350 μL of low salt wash solution into the column. Spin for 1–2 min at maximum speed.Transfer the spin filter into a fresh collection tube. Pipette 10–20 μL of preheated (65 °C) elution solution onto the spin filter, ensuring that it comes into contact with the bead–mRNA complex. Incubate for 2–5 minutes at 65 °C. Spin for 1–2 min at maximum speed. Save the flow through liquid; it contains most of the purified mRNA.Determine the concentration of purified mRNA with NanoDrop.Dilute different concentrations of mRNA to 50 ng/μL.Dot blotting The isolated mRNA is first denatured by heating at 95 °C for 5 min to disrupt the secondary structure.Chill on ice for 5 min immediately after denaturation to prevent re-formation of the mRNA secondary structure.Have the nitrocellulose membrane ready.Using a narrow-mouth pipette tip, drop 2 μL of mRNA sample directly onto the Hybond-N+ membrane at the center of the grid (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4565/bioprotoc-12-23-4565-g002.jpgFigure 2. Dot sample example Air dry at room temperature for 5 min.Crosslink spotted RNA to the membrane using the UV cross linker (irradiate under ultraviolet lamp with 254 nm wavelength for 5 min).Incubate the membrane with blocking buffer for 1 h at room temperature.After blocking, incubate the membrane with anti-m6A antibody (1:1,000 dilution) in 5 mL of antibody dilution buffer overnight at 4 °C with gentle shaking.Wash three times with PBST (3 × 5 min).",
    "Incubate the membrane with HRP goat anti-rabbit IgG (1:10,000 dilution) in 5 mL of antibody dilution buffer for 1 h at room temperature with gentle shaking.Wash three times with PBST (3 × 5 min).Incubate with ECL substrate for 1 min (according to the manufacturer’s instructions, 0.125 mL ECL solution per cm2 of the membrane is recommended), cover with Saran wrap aiming to remove the excess solution from the surface, and expose the film in the darkroom (Figure 3B). Try different exposure times to get clear results.After exposure, transfer the membrane to a solution containing 10 mL of 0.02% methylene blue dye buffer, gently shake the membrane at room temperature, and incubate for 30 min.Lastly, clean the membrane with dH2O until the background is clean (Figure 3C).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4565/bioprotoc-12-23-4565-g003.jpgFigure 3. Representative data of m6A level detected by dot blot. (A) Western blotting assay of METTL3 in the METTL3-KD stable cell lines in MCF-7. (B) Dot blot to detect the m6A level of mRNA isolated from total RNA of METTL3-KD MCF-7 cells. (C) Methylene blue (MB) staining served as a loading control. (D) Measurement and normalization of m6A levels in ImageJ."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}