{
  "id": 3518,
  "origin_website": "Cell",
  "title": "Visualizing Cellular Dynamics and Protein Localization in 3D Collagen",
  "procedures": [
    "Step-By-Step Method Details\nStep-By-Step Method Details\nIsolation and Expansion of Immune Cell Subsets from PBMCs\nTiming: 5–10 days to isolate and expand CD4+ T cells\nCells of interest are isolated and expanded in cell culture. Confirmation of cell purity and subset analysis are determined by flow cytometry.\nIsolation and Expansion of Activated CD4+ T Cells\nDay 0. Thaw out cryovial(s) of PBMCs by placing them in the 37°C water bath. Typically, 50–100 × 106 cryopreserved PMBCs will yield approximately 2–5 × 106 naive CD4+ T cells. Once partially thawed, add warmed media to the cell suspension and place into a 50 mL conical tube at a 1:9 ratio (1 mL cells:9 mL RPMI medium).\nCritical: Once cells are resuspended in freezing media, work quickly to place cryotubes in the freezer. Cell viability is reduced when in contact with DMSO containing solution for an extended period of time.\nCentrifuge cell suspension for 10 min at 400 × g at 20°C–22°C. Decant supernatant and add 10 mL of fresh complete RPMI media. Repeat two times.\nCount the cells and assess cell viability using trypan blue. Ideal viability at this stage is 80% or higher. Resuspend cells with EasySep Buffer at 50 × 106 cells/mL concentration. Perform negative selection to isolate naive CD4 T cells using the EasySep human naive CD4 T cell isolation kit (STEMCELL Technologies), following manufacturer’s protocol.\nDecant selected T cells into a 15 mL conical tube and wash with 5 mL complete RPMI medium.",
    "Count isolated CD4+ T cells using a hemocytometer and resuspend at 106 cells/mL in complete RPMI medium. Pipette 1 mL of the cell suspension into each well of a 24 well plate (106 T cells per well) and add 25 μL of anti-CD3ε/CD28 antibody-coated Dynabeads and mix gently by pipetting up and down (1:1 beads to cells ratio). Place culture plate in the 37°C/5% CO2 incubator for 48 h.\nDay 2. Remove beads by placing cell suspension in a 5 mL Falcon tube and placing it into the EasySep magnet (STEMCELL technologies) for 2 min. Carefully decant T cells into a fresh 15 mL conical tube and wash with 3 mL of complete RPMI media.\nCount cells and adjust cell concentration to 0.1–0.2 × 106 cells/mL in complete RPMI medium with 8 ng/mL recombinant human (rh) IL-2 into a T25 or T75 flask, standing up. This cell concentration allows T cells to expand over the next 3 days without changing the media.\nDay 5. Change media and re-adjust cell concentration to 106 cells/mL in complete RPMI medium + 8 ng/mL rh IL-2. Adjust the final culture volume according to the number of activated T cells needed for experiments.\nDays 6–9. Perform phenotypic analysis of T cell cultures using flow cytometry, using fluorochrome-tagged anti-CD3, CD4, CD8, CD62L, CD45RO, and CCR7 antibodies to distinguish between effector and central memory T cell subsets. Cells from days 6–9 in culture are typically used for downstream imaging and HIV infection experiments.",
    "Note: The starting number of naive T cells will dictate how many activated cells are obtained at days 6–9. Although T cells undergo exponential proliferation after anti-CD3/CD28 stimulation, ensure that you start with a sufficient naive CD4 T cell numbers to obtain the required number of activated cells for imaging experiments. Activation and expansion of 1 million naive CD4 T cells results in 20–40 × 106 resting memory cells at day 7.\nNote: The number of phenotypically central memory (CD45RO+CD62L+CCR7+) and effector memory (CD45RO+CD62LnegCCR7neg) T cells at day 7 can vary between blood donors. It is important to take this into consideration for all downstream imaging studies.\nNote: Naive T cells can be directly isolated from fresh PBMCs, typically yielding cells that have high viability.\nTiming: 5–7 days to isolate and culture MDDCs\nIsolation and Differentiation of Monocyte-Derived Dendritic Cells (MDDCs)\nDay 0. Thaw out cryovial(s) of frozen PBMCs by placing them in the 37°C water bath. Once partially thawed, add warmed media to the cell suspension and place into a 50 mL conical tube at a 1:9 ratio (1 mL cells:9 mL RPMI medium).\nCentrifuge PBMCs at 500 × g at 20°C–22°C for 10 min. Decant supernatant and add 10 mL of fresh complete RPMI media. Repeat twice and count cells using a hemocytometer.\nResuspend PBMCs at 100 × 106 cells/mL in EasySep Buffer and perform a positive selection for CD14+ monocytes using the EasySep human CD14 positive selection kit, following manufacturer’s protocol.\nResuspend monocytes at 1–2 × 106 cells/mL in complete RPMI media supplemented with 50 ng/mL of rhGM-CSF and 50 ng/mL rhIL-4. Place cells in a T25 or T75 ultra-low attachment NuncSphera flasks and place in a 37°C/5% CO2 incubator.",
    "Day 2. Collect and centrifuge cells at 400 × g for 10 min. Resuspend cells in fresh complete RPMI media + 50 ng/mL of rhGM-CSF and 50 ng/mL rhIL-4 and maintain cell concentrations at 1–2 × 106 cells/mL. Return flasks to the incubator.\nDay 5. Cells have differentiated into mostly immature DCs. Phenotypic analysis can be performed at this point, using anti-CD11c, CD80, CD86 and MHC-II antibodies where immature MDDCs are CD11c+CD80lowCD86lowMHC-IIlow. To obtain mature MDDCs, cells are resuspended at 0.8 × 106 cells/mL in complete RPMI medium supplemented 25 ng/mL rhGM-CSF, 25 ng/mL rhIL-4 and 100 ng/mL of LPS (S. Minnesota) for 24 h. Phenotypic analysis by flow cytometry should be performed at this point to confirm their maturation, characterized by upregulation of CD80, CD86, and MHC-II expression.\nNote: The use of attachment free Nunc Sphera flasks is optional, but highly recommended to improve recovery of MDDCs by keeping cells in suspension. This removes the requirement for cell detachment solutions, such as using accutase, when harvesting cells for experiments and maintains high cell viability and yield.\nNote: Similar to naive T cell isolations, the viability and cell yield is high when using freshly isolated PBMCs compared to frozen cells. This is particularly the case for CD14+ monocytes, where their viability after freeze/thaw is lower compared to lymphocytes.\nCell Labeling and Embedding into Collagen Matrix for Live-Cell Microscopy Studies\nTiming: 1–6 h for cell labeling and imaging in collagen gels\nCommercially available cell-labeling dyes are used to visualize cells in live-cell imaging studies within a fibrillar 3D collagen network that support robust immune cell migration.\nDifferential Labeling of T Cell and Dendritic Cells Using Celltracker Dyes",
    "Count each cell type, centrifuge and resuspend in 1 mL of sterile cell staining buffer (1% FCS in PBS) at a maximum concentration of 107/mL in a 15 mL conical falcon tube. Ideal amount of T cells and DCs to stain in a single tube is 4 and 8 million, respectively. If more cells need to be stained, use multiple falcon tubes.\nThe following cell tracker dye concentrations work well for T cells and dendritic cells, but should be titrated for other cell types to achieve the desired level of brightness.\ntable:files/protocols_protocol_309_3.csv\nMake a 1 mL solution of Celltracker dye at 2× concentration with pre-warmed staining buffer and place in a 15 mL conical tube. Add 1 mL of cell suspension and mix well by pipetting up and down.\nPlace cells in a 37°C water bath for 15–20 min. To remove excess dye after incubation, underlay cell suspension with 2 mL of ice-cold 100% FCS, resulting in two distinct liquid phases (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/309-Fig2.jpg\nFigure 2. Removal of Excess Dye after Staining\nLeft: underlaying cells with 100% FCS. Right: representative image of the two liquid phases (red labeled cells, top; and the FCS layer, bottom). Centrifuging cells through the FCS layer quenches excess dye and removes them from solution.\nCentrifuge cells at 400 × g for 5 min. Aspirate out the culture supernatant without disturbing the cell pellet. Resuspend in 10 mL of complete RPMI media and centrifuge again at 400 × g for 5 min.\nPrior embedding into collagen, these cells were kept in the complete RPMI supplemented with either GMCSF/IL-4 or IL-2 at 37°C for 30–60 min.\nOptional: cells can be incubated in complete RPMI for 20–60 min to remove any excess dyes instead of passing them through the FCS solution.",
    "Note: There are numerous commercially available cell dyes with a wide fluorescence spectrum that can be utilized for each microscopy setup. Some dyes will label specific cell structures, such as the cell membrane (CellLight Plasma-Membrane GFP [Thermo Fisher] or CellMask Deep Red [Themo Fisher]) or the nucleus (NucSpot [Biotium] or Biotracker Nuclear Dye [Sigma]), that can be helpful when identifying cell structures in real-time.\nConstruction of Gel Chambers and Embedding Cells into Collagen Matrices\nAssemble the chamber slides by placing the adhesive silicone isolators (1 mm thickness) onto a microscope glass slide. Peel the adhesive from the top and adhere a 18 × 18 mm cover slip, leaving a 2–3 mm gap at one end. Ensure that there are no bubbles/holes for the collagen mixture to leak from (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/309-Fig3.jpg\nFigure 3. Construction of a Collagen Chamber\nLeft: materials used. Right: up to two chambers can be placed on a single microscope slide.\nPrepare collagen gel mixture in a 1.5 mL Eppendorf or 5 mL FACS tube.\nCritical: All reagents are stored in 4°C fridge and collagen-cell solution is quickly mixed at 20–22°C with cold reagents to prevent premature gel solidification.\ntable:files/protocols_protocol_309_4.csv\nMix the collagen solution by pipetting up and down, careful not to introduce bubbles (Figure 4[href=https://www.wicell.org#fig4]C). Add the cell suspension and mix without forming bubbles (Figure 4[href=https://www.wicell.org#fig4]D). Carefully pipette into each slide chamber through the gap created with the cover slip.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/309-Fig4.jpg\nFigure 4. Representative Images of Collagen-Cell Mixture Preparation\n(A) 10× MEM solution.\n(B) MEM + sodium bicarbonate.\n(C) Addition of collagen solution.\n(D) Final collagen-cell solution.",
    "Place the collagen chambers into the incubator (37°C, 5% CO2), standing the chamber up vertically and allowing gel to polymerize for 45 min – 1 h. Once solidified, collagen gels become opaque and has a pinkish orange color (Figure 5[href=https://www.wicell.org#fig5]). Embedded cells are also visible under light microscope. Chambers are now ready for live-cell imaging studies.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/309-Fig5.jpg\nFigure 5. Image of a Properly Poured Collagen Gel\nCells were embedded into collagen solution and poured into chambers. Left: properly solidified collagen matrix. Right: non-optimal collagen chamber that has not solidified and contains large bubbles.\nPlace collagen gel slides onto a heated platform and plug the heating resistors into the temperature controller. A thermocouple is placed into the gel to ensure temperature of the setup is maintained at 37°C (Figure 1[href=https://www.wicell.org#fig1]).\nTurn on two-photon femtosecond lasers and adjust to the optimal wavelength for maximal excitation of the Celltracker dye or fluorescent protein. We have found that Celltracker blue, green, orange, and red dyes are brightly excited at wavelengths between 780–830 nm. Images were acquired using a 20× water-immersion objective lens (Olympus, 1.0 N.A, 2.0 mm WD; XLUMPLFLN). Two-photon microscope allows for maximal imaging depth and less phototoxicity/photodamage to cells compared to conventional confocal microscopy.\nSelect image acquisition parameters and record time-lapse images. Typical parameters used for evaluating DC:T cell interactions are: 13 z-stacks at 4 μm spacing, 30 s per cycle, 121 total cycles. The length of movies depends the migratory behavior of T cells and DCs, as DCs migrate a much slower rate than T cells (Methods Video S1[href=https://www.wicell.org#mmc1]). Acquisition parameters should be optimized for each experiment to balance acquiring sufficient data and potential cytotoxic effects from repeated imaging.",
    "Note: Cells can be transduced with lentivirus-expressing fluorescent proteins as an alternative to fluorescent dyes. Advantage of this approach is that specific proteins and/or organelles can be visualized. Isolating cells from fluorescent reporter transgenic mice will eliminate the need for labeling cells prior to imaging studies.\nNote: Optimal voltage settings on the temperature controller should be determined for each heating platform prior to the experiment. A thermocouple should be used to ensure temperature of the collagen matrix gels are maintained at 37°C ± 0.5°C by inserting the probe into the gel. Humidity or CO2 control is not required for this collagen chamber setup.\n        Your browser does not support HTML5 video.\n      \nMethods Video S1. Visualizing DC:T Cell Contact Dynamics in Collagen (Related to Step 28)\nMature MDDCs (green) and activated CD4 T cells (blue) isolated from a healthy blood donor were embedded into collagen gels prepared for live-cell imaging. Time stamp are in minutes:seconds. Scale bar, 20 μm.\nData Analysis for Cell Motility, Morphology, and Cell-Cell Interaction Dynamics\nTiming: 1–2 weeks\nTime-lapse microscopy images will be processed using available 4D image rendering software to quantitatively analyze cellular migration parameters. Comparison of cellular behaviors and cell-cell interaction dynamics can describe biological processes and responses. Here we used Imaris 8.2 software to track T cells and DC migration behaviors in 3D. The below protocol is meant to be a basic approach to track cells, and to highlight some issues with tracking (Figure 6[href=https://www.wicell.org#fig6]). For a more complete set of instructions, please refer to the Imaris built-in program and operation manual.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/309-Fig6.jpg\nFigure 6. Imaris Analysis Flowchart\nStep-by-step flowchart describing how to analyze cell tracks with Imaris software.\nImage Processing and Cell Migration Analysis Using Imaris 8 Software\nConvert the original .xml file into .ims file using the Imaris FileConverter Software.",
    "Open the .ims file in the Imaris 8.2 software.\nOpen Image Properties under the Edit tab and correct minimum X, Y, and Z values to 0. Adjust the Voxel size for the z value used to acquire the images (e.g., 4 μm). Under the Time Point section, select the “All Equidistant” tab and adjust the Time Interval to the experimental time period. If the image disappears, press “Fit” at the bottom left corner of the program (Figure 6[href=https://www.wicell.org#fig6]).\nTo start tracking T cells over time, select “Add new Spots” (Orange circles).\nInput algorithm instructions and press next. Select a small region of interest to implement the algorithm, which channel to analyze, and the approximate XY diameter.\nAdjust the detection intensity by sliding the highlighted bar to the left or right to ensure that only one cell is spotted at any one time. It is also important to ensure each spot locates at the cell body. Click next.\nCell tracks where the entire cell is not in the field of view should be deleted from the analysis. Select the cell track in question by selecting the Edit tracks tab.\nInspect each cell tracks and ensure that they are accurately depicting the same cell over time. Separate tracks belonging to the same cell can be manually connected by selecting Object and selecting two objects (depicted as yellow balls) while holding the command/control key and pressing “Connect.” A single cell track after combining two separate tracks is shown below.\nCritical: it is important to visually inspect all cell tracks for accuracy. Migration analysis of DCs and T cells are done separately.",
    "Once cell tracking is complete, select the statistics tab to export all cell migration parameters as an excel file. Further cell migration parameter analyses(Beltman et al., 2009[href=https://www.wicell.org#bib1]) can be done using a custom script using MATLAB software, and will be made available upon request.\n3D Immunohistochemistry in Collagen\nTiming: 7–8 days for embedding, staining, and imaging of 3D collagen blocks\nCells of interest are embedded into 3D collagen gels, fixed in situ and prepared for immunohistochemistry (IHC). This approach preserves the 3D morphological features of migrating cells, allowing studies into protein expression/localization profiles in polarized cells.\nCell Embedding, Fixation, and Preparation for IHC\nEmbed cells of interest into collagen as detailed above. We recommend preparing 540 μL of cell:collagen mixture with no more than 3 million total cells (2 × 270 μL recipe above).\nDispense 540 μL of cell:collagen suspension into a 24 well plate, to create a cell bubble. Place the culture plate in the 37°C incubator to solidify.\nAfter the desired incubation time, add 2 mL of pre-warmed 4% paraformaldehyde in 5% sucrose solution to each well and leave in the incubator for 24 h.\nCritical: Using fixation buffer warmed to 37°C for 30 min, and quickly adding it to collagen gels while in the incubator is important to maintain cell polarity. Any delay at this step will result in rounded cells.\nRemove PFA solution and wash the gel gently with 2 mL of PBS containing 0.2% Tween-20, three times for 5 min per wash. Carefully aspirate the washing buffer.\nAdd 2 mL of 0.15 M glycine buffer (pH 7) to quench excess PFA by placing it in the 4°C fridge for 18–24 h. Make sure the gels are completely submerged in the glycine buffer.",
    "Rinse gels with wash buffer (PBS containing 0.2% Tween-20) three times and carefully aspirate using a pipette.\nTo permeabilize the cells prior to staining, add 2 mL of 0.5% Triton X solution for 48 h in the fridge. Rinse gels three times with wash buffer and carefully aspirate using a pipette.\nA blocking step is performed to reduce non-specific binding by antibodies. Add 2 mL of 1% bovine serum albumin (BSA) in PBS and leave for 18–24 h in the 4°C fridge. Rinse gels with wash solution three times and proceed to staining.\nStaining for F-Actin Using Fluorescently Conjugated Phalloidin\nTransfer each collagen gel blocks into a new 24-well culture dish using a plastic spoon, and add 300–500 μL of 1.65 μM Texas red conjugated phalloidin solution (to cover entire gel), prepared according to manufacturer’s recommendation. Incubate the gels for 24 h in the 4°C fridge in the dark.\nRinse gels with wash buffer three times, 5 min per wash. Gently aspirate buffer with a pipette.\nUsing a plastic spoon, place the gels onto a glass microscope slide. Remove as much liquid as possible using a Kimwipe so that the gel remains in place.\nSurround each gel with sufficient vacuum grease (dispensed using a 5 mL syringe) to create an airtight seal. Apply enough grease to match the height of the gel itself.\nPlace a small amount of PBS into the grease well and gently place a coverslip on top of the gel, slightly pushing down on the grease ring to form a seal (Figure 7[href=https://www.wicell.org#fig7]). The preparation should be free of any large air bubbles: to remove these, inject additional PBS using an insulin syringe.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/309-Fig7.jpg\nFigure 7. Workflow to Mount Collagen Gels for Microscopy\nIllustration was created with BioRender.com[href=http://BioRender.com].",
    "Place the mounted gels under the microscope and collect 3D stack images. We recommend taking z-stack spacing of 1–2 μm for 3D cell reconstruction. Images can be imported into Imaris software, as described above or other image analysis software (e.g., ImageJ) for expression/localization analysis.\nNote: This approach is amenable for staining using fluorescently conjugated antibodies or cell expressing fluorescent proteins such as GFP or RFP. If secondary antibodies are used to improve the signal-to-noise ratio, rinse gels five times, 5 min per wash between addition of primary and secondary antibody."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Cell-Based Assays",
    "Immunology",
    "Microscopy"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}