{
  "id": 3463,
  "origin_website": "Cell",
  "title": "Chronic Cranial Window for Imaging Cortical Activity in Head-Fixed Mice",
  "procedures": [
    "Step-By-Step Method Details\nStep-By-Step Method Details\nPreparation of the Mouse for Chronic Cranial Window Surgery\nTiming: 15 min\nPrepare the 2–3 months old mouse for the surgery, before fixing it to the stereotaxic frame.\nCritical: The procedure and drugs should be adapted according to your IACUC approved protocol.\nWeigh the animal.\nInduce anesthesia.\nGently transfer the mouse into an anesthesia induction chamber and induce deep anesthesia with 3% isoflurane.\nNote: Anesthesia should induce within 1–1.5 min.\nAlternatives: Researchers experienced with mouse handling can skip this step.\nInject main anesthetics; here, mixture of Medetomidine (dissolved in 0.9% saline; 0.3 μg/g body weight), Midazolam (dissolved in 0.9% saline; 4 μg/g), and Butorphanol (dissolved in 0.9% saline; 5 μg/g intraperitoneal [i.p.]) before isoflurane wears off.\nNote: Anesthesia will be induced within 3–5 min. Therefore, leave the mouse in its cage for 5 min for a smooth transition to deep anesthesia.\nAlternatives: Researchers using isoflurane as the main anesthesia should fix the mouse in the stereotaxic frame (here, step 8) and proceed with step 4.\nTransfer the mouse onto a sterile paper towel.\nInject immunosuppressants; here, Carprofen (dissolved in 0.9% saline; 7.5 μg/g body weight, i.p.) and Dexamethasone sodium phosphate (dissolved in 0.9% saline; 2 μg/g body weight, into the quadriceps muscles, 1 μg/g each).\nCritical: Without immunosuppressants, a strong background autofluorescence in the dura and brain tissue will be caused by a strong immune system response to the introduced foreign bodies (for example, glass coverslip or fluorescent tracer) and healing. This will substantially reduce the imaging quality. Troubleshooting Problem 1[href=https://www.wicell.org#sec6.1].\nApply ophthalmic ointment to the eyes for physical protection and to prevent dehydration using small cotton-tips.",
    "Critical: Extensively applied highly viscous ophthalmic ointment (for example, Mycochlorin) will protect the eyes from cut hair as well as accidental contact with hair-removal cream, iodine, or ethanol (steps 6 and 8).\nRemove the scalp hair.\nShave the head with a veterinary hair clipper (KM2, Model 9757-200, Wahl).\nNote: Use a clipper blade specifically for small animals with fine hair.\nApply hair-removal cream over the shaved scalp and clean it off (here, after 5 min) using small cotton-tips.\nCritical: Keep hair-removal cream away from the eyes of the mouse.\nCritical: Check instruction of the cream. Also note, that the application time can be less than indicated and therefore should be adjusted. Too long application might irritate or damage the skin.\nNote: Use hair-removal cream for sensitive skin.\nNote: Avoid excessive usage of hair-removal cream.\nOptional: The iodine or 70% ethanol can be applied for immediate disinfection and wash-off residual hair-removal cream (see also step 8)\nPreparation for the Craniotomy\nTiming: 40–60 min\nCritical: The craniotomy is the most critical part of the cranial window surgery. Correctly performed, it will lead to a chronic cranial window which enables long-term, high-quality imaging (see Expected Outcomes[href=https://www.wicell.org#expected-outcomes]) while imperfections lead to dissatisfactory imaging quality or even animal death (see Troubleshooting[href=https://www.wicell.org#troubleshooting] Problems 1–4).\nFixate the head in a stereotaxic frame using blunt ear bars.\nWipe the scalp with cotton swabs soaked in iodine.\nCritical: Keep iodine away from the eyes of the mouse.\nNote: Avoid excessive usage of the iodine.\nApply Lidocaine topically for local anesthesia using a cotton swab. Wait 3–5 min for induction of local anesthesia (Figure 2[href=https://www.wicell.org#fig2]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/304-Fig2.jpg\nFigure 2. Major Steps of the Chronic Cranial Window Surgery\n(A) Clean the scalp.\n(B) Remove the scalp skin and clean the skull.\n(C) Define the position of the craniotomy.",
    "(D) Engrave around the area of the craniotomy.\n(E) Thin the bone around the craniotomy area.\n(F) Glue the wooden stick for lifting the craniotomy bone.\n(G) Clean the exposed dura.\n(H) Clean craniotomy area prepared for the injection.\n(I) Injection.\n(J) Glued chronic cranial window.\n(K) Temporally fixed headplate.\n(L) Headplate glued with dental acrylic. The orientation: a, anterior; p, posterior; l, lateral; m, medial.\nRemove the scalp skin (Figure 2[href=https://www.wicell.org#fig2]B).\nOpen the skin above the skull making one midline stroke with a scalpel. The cut should start just behind the eyes (2–3 mm anterior to bregma) and end at the posterior end of the skull (above the neck).\nNote: The length and position of the incision should be adapted for craniotomies at other locations.\nCut away the scalp skin on both sides of the incision.\nNote: Only skin without hair should be removed. Otherwise cut hair will irritate the wound.\nPush remaining skin to the side using Lidocaine-soaked cotton-tips.\nScrape connective tissue and muscles away from the lateral and posterior bone ridges using tweezers.\nCritical: The large open-bone area (Figure 2[href=https://www.wicell.org#fig2]B) is necessary for a sufficient bone thinning around the craniotomy as well as secure fixation of the headplate using dental acrylic (see steps 12 and 22–25; Troubleshooting Problem 4[href=https://www.wicell.org#sec6.7]).\nDefine the position of the craniotomy (Figure 2[href=https://www.wicell.org#fig2]C).\nLevel the skull along the midline axis at the suture intersection points bregma and lambda using a reference pipette (a relatively short-shank injection pipette as in Figures 1[href=https://www.wicell.org#fig1]A and 1B; the tip of this pipette can be colored with a water-resistant marker for better visibility) orthogonally fixed on a micromanipulator (Figures 1[href=https://www.wicell.org#fig1]D and 2[href=https://www.wicell.org#fig2]C). Also make sure that the skull is not tilted in the horizontal plane if your stereotactic apparatus allows to tilt the ear bars.",
    "Lower the pipette onto bregma. Zero the coordinates.\nLocate the center of the future cranial window over V1 with the reference pipette: 3.5 mm posterior and 2.4 mm lateral of bregma. Go up with the pipette and mark the location below the pipette with a fine-tip water-resistant marker.\nCritical: All coordinates should be adapted for different target regions.\nMark anterior, lateral, and medial points 1.5 mm and posterior point about 3 mm from the center.\nCritical: Here, the posterior mark is behind the transverse sinus (asterisk in Figure 3[href=https://www.wicell.org#fig3]). Otherwise, the drilling around the future craniotomy area or bone breaking during the craniotomy (see steps 12 and 14) would likely damage this large vein, which would lead to strong bleeding and ultimately death of the animal. Troubleshooting Problem 2[href=https://www.wicell.org#sec6.3] and Problem 3[href=https://www.wicell.org#sec6.5].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/304-Fig3.jpg\nFigure 3. Key Aspects of the Chronic Cranial Window Surgery\n(A and B) (A) Before and (B) after the thinning of the skull bone. Notice the different thickness of the bone closer and further away from the engraved area of the craniotomy.\n(C) The craniotomy after cleaning; enlarged image (right). Black arrow indicates the edge of the craniotomy.\n(D) Glued chronic cranial window; enlarged image (right). Black arrows indicate the glue on the bone/dura below the coverslip. Notice that the achieved craniotomy area is larger than defined initially (see asterisks as reference points). White arrow points at the transverse sinus. Scale bars, 2 mm. The orientation: a, anterior; p, posterior; l, lateral; m, medial.\nMove the pipette out of the workspace without changing the bregma zero coordinates.\nNote: Keeping the bregma zero position, especially the ventral zero position, is essential if the bone under bregma will be thinned (see step 12).",
    "Engrave the skull bone with a circle connecting the marked points around the center point using the dental drill with a 0.5 mm diameter drill bit (Figures 2[href=https://www.wicell.org#fig2]D and 3[href=https://www.wicell.org#fig3]A).\nNote: Do not drill deep. This groove is only for marking the future craniotomy.\nThin the bone around the engraving with a 1- or 1.2-mm diameter drill bit using a drill speed of 3×104 rpm. The bone should be thinned most around the engraving while bone further away should be thinned less (Figures 2[href=https://www.wicell.org#fig2]E and 3[href=https://www.wicell.org#fig3]B). Stop thinning when tiny cracks appear around the engraving or when the bone inside the engraving can be easily pushed when applying gentle force with the tweezers.\nCritical: Here and anytime when drilling: Do not break through the bone. Since the dura in mice is very thin, the drill bit will sink into the brain immediately, causing strong bleeding and big damage to the brain. The mouse should be sacrificed in such a case. Troubleshooting Problem 2[href=https://www.wicell.org#sec6.3] and Problem 3[href=https://www.wicell.org#sec6.5].\nCritical: Drill carefully, with smooth motion, keeping the drill at a shallow angle and applying minimal pressure with the drill bit. Drilling for too long at the same position will cause over-heating and damage the dura, blood vessels, and the brain. Such damage can be noticed as bruises or bleeding below the bone in the thinned-skull area. Periodically cool and clean the bone with saline and gentle spray with compressed air. Reckless drilling will cause long-lasting inflammation leading to high autofluorescence in the brain tissue, neuronal death, and, accordingly, strongly reduced two-photon image quality. Troubleshooting Problem 1[href=https://www.wicell.org#sec6.1].\nNote: In our experience, only hands should move, while arms should remain immobile and pressed against the stereotactic frame for better control of the drill.",
    "Note: A small cotton-tip or a flat-tip forceps in the contralateral hand, slightly pressing the skull also helps for control and stability.\nNote: The area of thinned bone and the thickness of the remaining bone depends on the age of the animal (older mice have thicker skulls) and the size as well as the position of the headplate. Keep in mind that larger area ensures strong fixation of the headplate (see step 22–25, Figures 2[href=https://www.wicell.org#fig2]K and 2L). Troubleshooting Problem 4[href=https://www.wicell.org#sec6.7]. Also, the headplate should be as close to the dura as possible to prevent the steric problems with large, short working distance imaging objectives.\nNote: The cranial window can be glued directly on the dura (see step 21). This and the very thin bone at the edge of the craniotomy (Figures 3[href=https://www.wicell.org#fig3]B–3D) prevent the re-growth of the bone under the glass. Troubleshooting Problem 1[href=https://www.wicell.org#sec6.1].\nThe Craniotomy\nTiming: 15–20 min\nWith minor modifications we are following a procedure described earlier (Roome and Kuhn, 2014[href=https://www.wicell.org#bib6]).\nGlue a wooden stick (about 3 mm diameter, as, for example, the wooden part of a cotton swab) vertically to the center of the craniotomy bone with gel superglue. Press it slightly against the bone for 10–15 s and let it set for 5 min (Figure 2[href=https://www.wicell.org#fig2]F).\nNote: Gel or high-viscosity superglue should be used to avoid leakage onto the thinned bone area and to fill the space between the bone and the stick for maximal bonding.\nNote: Use a stick with a diameter slightly smaller than the craniotomy bone. The glue will spread over the thinned bone area if using a stick with larger diameter, although a too thin stick might get de-attached from the bone when pulled.",
    "Gently lift and slightly tilt the stick backward to separate the attached bone patch from the dura while pressing the anterior part of the skull downwards with a cotton swab or the flat side of the tweezers. The resulting craniotomy should have a diameter of 4–5 mm.\nCritical: If the bone does not break, but some cracks are visible, additionally use fine-tip tweezers when lifting the stick. Pulling the bone up will minimize the risk of dura damage with forceps and help to cut-open the skull. If no cracks are visible, or appear when lifting, remove the stick by scraping the glue from the bone using tweezers and proceed with more thinning of the bone around the engraving.\nCritical: Lifting the bone might damage blood vessels and cause bleeding. Be prepared to use a sterile sponge (Sugi, Questalpha) and gel-foam sponge (No. 12, Pfizer) moisturized with saline or Carprofen.\nCritical: Damage to the large blood vessels or sinuses will cause strong bleeding which can lead to death during or up to 48 h after the surgery. Troubleshooting Problem 2[href=https://www.wicell.org#sec6.3] and Problem 3[href=https://www.wicell.org#sec6.5].\nClean the dura with gel-foam sponge (No. 12, Pfizer) moisturized with saline or Carprofen (Figure 2[href=https://www.wicell.org#fig2]G). No bleeding should be observed after adding a drop of saline on the dry dura (Figures 2[href=https://www.wicell.org#fig2]H and 3[href=https://www.wicell.org#fig3]C).\nCritical: Gluing the window before the damaged blood vessels are cured will cause bleeding during the recovery period. Residual blood below the cranial window will seriously affect the quality of two-photon imaging. Troubleshooting Problem 1[href=https://www.wicell.org#sec6.1].\nRetrograde Tracer Injection\nTiming: 15 min\nThe following steps provide instructions on how to inject a solution into a specific brain area. Here, we explain how to inject retrogradely transported fluorescent beads (FluoSpheres, Molecular Probes) and viral vector (AAV1.hSyn.TurboRFP.WPRE.rBG, Addgene) into dorsal lateral geniculate nucleus (dLGN).",
    "Note: These steps can be omitted if the solution of interest (for example, a viral vector, dye, drugs, or beads) will be injected through an access port of the chronic cranial window at a later time point (Roome and Kuhn, 2014[href=https://www.wicell.org#bib6], Roome and Kuhn, 2018[href=https://www.wicell.org#bib7], Augustinaite and Kuhn, 2020[href=https://www.wicell.org#bib1]).\nInstalling the injection pipette.\nReturn the reference pipette (step 11e) to the zeroed bregma coordinates. If the bone was thinned over the bregma point, record the difference in ventral direction between 0 and the bone surface by lowering the pipette tip onto the bone (you will need this offset in step 16e).\nRemove the reference pipette.\nConnect the silicone tubing to the end of the injection pipette and fix it in the holder.\nNote: Select a pipette with short shaft if injecting into the upper cortex. If the injection is aiming for deep cortex (layers 5 or 6) or sub-cortical areas, use a pipette with long shaft to minimize tissue damage during insertion (Figures 1[href=https://www.wicell.org#fig1]A and 1B).\nCarefully lower the pipette tip onto the bone of the bregma. Zero the coordinates.\nLift the pipette up the recorded distance from 0 in step 16a. Zero the coordinates.\nCritical: Wrong zeroed bregma coordinates will lead to an inaccurate injection location and to failure of the labeling. Troubleshooting Problem 5[href=https://www.wicell.org#sec6.9].\nTip-fill the pipette with a tracer containing solution.\nCut a 5×10 mm piece of parafilm with the protective wax paper attached.\nMix a 2 μL drop of tracer solution (mixed 1:1 with PBS and sonicated for 5–10 s (ultrasonic processor VCX 500, Sonics) immediately before the filling) with 2 μL drop of AAV solution on the parafilm.\nRemove the protective wax paper and place the parafilm on the ear-bar, within the working distance of the micromanipulator.",
    "Apply weak positive pressure (10–14 hPa) and lower the pipette tip into the drop under visual guidance.\nNote: Since the tracer solution has a high viscosity, such weak positive pressure is enough to keep the tip clean while in the air and at the droplet surface, but without making air bubbles when in the droplet.\nTip-fill the pipette with up to 300 nL of solution using negative pressure (typically −150 to −200 hPa). The volume is judged by the tick marks on the pipette.\nCritical: Replace the pipette in case of clogging (remove the clogged pipette and go back to step 16c). Try a larger tip diameter pipette and/or additional dilution with PBS.\nApply weak positive pressure (10–14 hPa) and lift the pipette up. Maintain this pressure until the injection of the solution into the brain (step 18c).\nCritical: The positive pressure is kept to counteract the capillary effects. It prevents air or cerebrospinal fluid (step 18a, b) to tip-fill the pipette. If air is taken up, it will be injected into the brain; if cerebrospinal fluid is taken up, the tracer solution will be diluted. On the other hand, if too high positive pressure is applied, the tracer solution will be ejected, emptying the pipette before entering the brain, or causing strong labeling along the pipette tract in the brain. Therefore, the pressure should be adjusted depending on the viscosity of the solution as well as inner diameter of the injection pipette. Troubleshooting Problem 5[href=https://www.wicell.org#sec6.9].\nWipe the pipette tip with a PBS-soaked sterile sponge (Sugi, Questalpha).\nNote: Fluorescent particles/viral vectors outside the glass wall might label neurons/tissue along the insertion track and thus compromise the labeling and/or the imaging quality. Troubleshooting Problem 5[href=https://www.wicell.org#sec6.9].\nInject the tracer (Figure 2[href=https://www.wicell.org#fig2]I).",
    "Locate the pipette above the target and smoothly lower it into the brain using bregma as the origin of the coordinate system (2.45 mm posterior, 2.4 mm lateral, 2.9 mm ventral for dLGN).\nWait for 3–5 min at the target location allowing the tissue to seal around the pipette wall before the injection.\nCritical: Immediate injection will cause the spread of the tracer solution up along the pipette instead of into the tissue at the injection site. Troubleshooting Problem 5[href=https://www.wicell.org#sec6.9].\nUnder visual observation of the meniscus in the pipette, if possible, with the surgery microscope, pressure inject (typically 35–70 hPa) about 150–200 nL of solution within 10–15 min.\nReduce the positive pressure to initial 10–14 hPa and wait for 10 min to allow the injected solution to spread into the tissue.\nCritical: Visual observation allows the accurate control of the injection speed and the amount. Slow injection (50 nL/3–5 min) and a waiting period before and after the injection, allows the solution to spread locally at the injection site instead of going up along the outer walls of the pipette during injection or follow the pipette track during retraction. Troubleshooting Problem 5[href=https://www.wicell.org#sec6.9].\nSlowly and smoothly retract the pipette.\nFixing the Cranial Window\nTiming: 10 min\nThe following steps provide instructions on how to cover the craniotomy with the cranial window (round glass coverslip MINI, 0.17 mm thick, 5 mm diameter; W.P.I.; Figures 2[href=https://www.wicell.org#fig2]J and 3[href=https://www.wicell.org#fig3]D).\nOptional: Due to the curvature of the skull, the lateral side of the craniotomy is lower than the medial one (Figure 2[href=https://www.wicell.org#fig2]I). Tilt the head of the mouse by 5°–10° in the horizontal plane to level the edges of the craniotomy on the latero-medial axis (compare Figure 3[href=https://www.wicell.org#fig3]C with 3D) if your stereotactic apparatus allows to tilt the ear bars.",
    "Note: The leveling makes it easier to glue the coverslip and, afterwards, to mount the headplate parallel to this coverslip.\nBefore covering the craniotomy, clean the coverslip with alcohol and compressed air.\nPlace the coverslip on the dura and slightly press it with a small cotton-tip so that the glass attaches to the dura on a large area of the craniotomy.\nCritical: If the brain surface appears concave (because of low blood pressure due to blood loss or deep anesthesia), add a drop of saline onto the center of the craniotomy. The water will prevent the glue from filling the space below the coverslip. Troubleshooting Problem 1[href=https://www.wicell.org#sec6.1].\nCritical: Do not proceed if bleeding starts. Remove the coverslip and clean the dura as explained in step 15. Troubleshooting Problem 1[href=https://www.wicell.org#sec6.1].\nCritical: The dura should be kept intact throughout the surgery. Attempts of dura removal can lead to bleeding and brain damage (Troubleshooting Problem 1[href=https://www.wicell.org#sec6.1] and Problem 2[href=https://www.wicell.org#sec6.3]). In mice, the dura is transparent and thin, and therefore allows two-photon imaging even at a depth of 600–800 μm (Augustinaite and Kuhn, 2020[href=https://www.wicell.org#bib1]). If, however, the dura must be removed, special care must be taken to prevent damage of the brain, especially of cortical layer 1. For example, the dura can be separated from the pia mater using hydroperoxide (Dalphin et al., 2020[href=https://www.wicell.org#bib2]) before opening it with fine-tip forceps.\nWhile pressing in the center with a small cotton-tip, glue the coverslip by applying small drops of a liquid superglue to the edges of the glass (Figures 2[href=https://www.wicell.org#fig2]J and 3[href=https://www.wicell.org#fig3]D). To do this, put a drop of regular superglue on a piece of parafilm and pick up droplets with a narrow but flat end wooden stick (for example, broken cotton swab or shaven toothpick).",
    "Critical: Pressing the coverslip prevents the spread of the superglue under the glass (Figure 3[href=https://www.wicell.org#fig3]D). Spread of glue under the glass, despite applying pressure on it, usually indicates too thick and uneven bone around the craniotomy. This will obscure and/or reduce the imaging area. Additionally, it might lead to fast bone re-growth. Troubleshooting Problem 1[href=https://www.wicell.org#sec6.1].\nCritical: Make sure that the glass perimeter is completely sealed by adding extra drops of glue around the window coverslip without the pressure from above. Note, that the glue can be added on the dura directly (in case the craniotomy area is not fully covered by the coverslip; Figure 3[href=https://www.wicell.org#fig3]D).\nFix the Headplate\nTiming: 10 min\nPosition the aluminum headplate over the coverslip parallel to the eye-line.\nCritical: It is important that the headplate is mounted at about the same level as the glass coverslip (Figure 2[href=https://www.wicell.org#fig2]K). If the headplate rests much higher than the glass, the thinning of the skull (step 12; Figures 2[href=https://www.wicell.org#fig2]E and 3[href=https://www.wicell.org#fig3]B) was not enough. This might cause steric problems for imaging with bulky or short working distance objectives.\nNote: The headplate and coverslip planes should be as parallel as possible.\nNote: Make sure that the cut edge of the central hole is on the upper side (Figure 2[href=https://www.wicell.org#fig2]K).\nAttach the headplate to the skull with a small drop of superglue.\nPrepare the dental acrylic according to the instruction of the producer.\nGlue the headplate with dental acrylic to the skull by filling all the space under and around the headplate, including the edges of the glass window and exposed skull (Figure 2[href=https://www.wicell.org#fig2]L). To do this, as in step 21, pick up droplets of dental acrylic with a narrow but flat end wooden stick (for example, broken cotton swab or shaven toothpick).",
    "Critical: Cover all the exposed bone. Otherwise the open wound might get infected. Typically, the mouse will have to be removed from the stereotaxic frame toward the end, since the ear bars block the access to the space below the headplate. So, continue filling dental acrylic under the headplate with the mouse in your hand.\nCritical: The large area of bone covered with dental acrylic ensures strong fixation of the headplate. Otherwise, the headplate might tear off when the mouse is head-fixed. Troubleshooting Problem 4[href=https://www.wicell.org#sec6.7].\nOther Steps during and after the Surgery\nTiming: 1–5 min per step\nThese steps ensure animal welfare during and after the surgery as well as faster recovery.\nIf the mouse shows reflexes or reactions to a procedure or signs of waking, add temporally 0.5%–1% isoflurane anesthesia. Typically, this additional anesthesia is applied during the drilling (step 12).\nDuring the surgery, inject saline (10–20 μL/g, s.c.) every hour to avoid dehydration.\nIf medetomidine was used for anesthesia (step 2b), after the surgery, inject Atipamezole hydrochloride (0.3 μL/g, i.p.) for faster waking.\nPrior to waking, inject analgetic (here, Buprenorphine dissolved in 0.9% saline; 0.1 μg/g, s.c.) to ease the pain and so reduce distress.\nAdd recovery food supplement (DietGel 76a, Clearh2o) to the cage.\nCheck the mouse regularly in the days following the surgery for any sign of pain and omission of grooming. In such a case, inject analgetic (for example, Buprenorphine 0.1 μg/g, s.c.). Troubleshooting Problem 3[href=https://www.wicell.org#sec6.5].\nIf the brain shows any sign of inflammation (foggy view, high autofluorescence) or blood under the window during the 2 weeks following the surgery, inject immunosuppressant (for example, Carprofen 10 μg/g body weight, i.p.) for 2–3 consecutive days to suppress the immune response. Troubleshooting Problem 1[href=https://www.wicell.org#sec6.1]."
  ],
  "subjectAreas": [
    "Neuroscience",
    "Microscopy",
    "Model Organisms"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}