{
  "id": 6054,
  "origin_website": "Bio",
  "title": "Quantification of Bacterial Twitching Motility in Dense Colonies Using Transmitted  Light Microscopy and Computational Image Analysis",
  "procedures": [
    "Preparation of slidesSterilize each glass slide by holding it over a Bunsen flame with tweezers (also sterilized).Place slides (up to 4) in a large Petri dish.Quickly pour 1 ml of twitching medium (kept at ~60 °C) onto one surface of each slide and let it spread evenly (by gravity). The approximate thickness of the medium should be 1.5-2 mm.Place the slide(s) in a biosafety cabinet (BSL2) to cool and dry (20 min). Then, gently clean the underside of the slide with a dry Kimwipe to remove any residual twitching medium. Draw a circle (~5 mm diameter) on the backside of the slide to mark where to adsorb the substance to be tested (see Figure 1). Up to 3 circles can be drawn per slide. Drop 5 µl of the substance to be tested onto the medium overlying the circle (Figure 1). Make sure not to touch the medium. A 5 µl volume usually covers a ~5 mm circle.Dry the slide in a biosafety cabinet (BSL2) (15 min).If more samples are needed, Steps A6 and A7 can be repeated.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180415/20180415202304_0167.jpgFigure 1. Experimental setup and images of the twitching assay. A. Schematic showing the experimental setup. Twitching medium (~60 °C) is poured onto a glass slide and allowed to cool and dry in a biosafety cabinet (BSL2) for 20 min. After adding the substance to be tested, the slide is dried again in the biosafety cabinet for 15 min before inoculation with bacteria. A coverslip is then placed over the inoculated substance to be tested, and the slide incubated for 4 h at 37 °C in a moist environment. B. Example of an inoculated slide with coverslip showing three circles, within each a replicate of the substance being tested. C. Example of a large Petri dish containing four inoculated slides with coverslips (e.",
    "g., a control slide versus three slides comparing different substances, or different concentrations of the same substance). Two wet paper towels are included to prevent drying of the twitching medium during the 4 h incubation. Although not shown, the Petri dish is covered with its lid during incubation to maintain moisture. Inoculate twitching mediumFrom an overnight growth on TSA plates, scrape a few colonies with an inoculation loop and mix together on the plate. This helps to make sure that all inoculations originate from a homogeneous mix of bacteria, and not a single clone, reducing possible motility differences due to phenotypic variation. However, single colonies can be tested if suited to study goals. Transfer a very small amount of bacteria (~0.5 mm diameter) to the tip of a sterile toothpick.Use the toothpick to apply the bacteria lightly on the slide in the center of the circles, without piercing the twitching medium. A single, central point of inoculation is required. Use sterile tweezers to lay a coverslip over the medium and point of inoculation (don’t press down onto the inoculated point) (Figure 1).Wet a rolled paper towel with deionized water. Put in the large Petri dish with the slides to keep them moist (Figure 1). Cover the Petri dish.Incubate for 4 h at 37 °C.ImagingAfter the incubation in Step B6, acquire time-lapse movies of the bacteria at the edge of the point of inoculation (10 sec interval for 5 min duration) at 37 °C, using a 60x/1.4NA oil-immersion lens with differential interference contrast (DIC)."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}