{
  "id": 1593,
  "origin_website": "Cell",
  "title": "Genome editing in archaeal viruses and endogenous viral protein purification",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nThis protocol provides detailed guidelines for performing genome editing of archaeal lytic viruses, exemplified here with the virus SIRV2. Essentially, the entire procedure relies on the construction of a genome editing plasmid, based on the shuttle vectors pGE1/pGE2. S. islandicus LAL14/1 carries one subtype I-A, one subtype I-D and two subtype III-B (Cmr-α and Cmr-γ) systems along with five CRISPR arrays. Arrays neighboring subtype I-A encompass repeat sequences (referred to as type I-A repeats) that are utilized by subtype I-A and subtype III-B (Cmr-α), the other three arrays encompass repeat sequences (referred to as type I-D repeats) utilized by subtype I-D and subtype III-B (Cmr-γ) (Bhoobalan-Chitty et al., 2019[href=https://www.wicell.org#bib2]). Once transformed into S. islandicus LAL14/1 Δarrays, a fully assembled pGE1/pGE2 allows the endogenous type I and type III CRISPR-Cas systems of the host cell to be repurposed to perform genome editing of SIRV2 during infections.\nTwo variable DNA elements in pGE1/pGE2 make this genome editing possible:\nA spacer DNA element that promotes targeting of the original virus but not the mutant virus. This is made possible by the mini-CRISPR array harbored on the genome editing plasmid. Briefly, the spacer is inserted between two type I-A repeats (for pGE1) or two type I-D repeats (for pGE2) located downstream of an arabinose-inducible promoter (Figure 1[href=https://www.wicell.org#fig1]), causing CRISPR RNA (crRNA) species to be produced. The crRNAs will in turn guide the endogenous CRISPR-Cas effector proteins towards the cognate protospacer in the original virus, leading to mostly fatal breaks in its DNA genome.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1031-Fig1.jpg\nFigure 1. The concepts of the CRISPR-Cas based genome editing of lytic archaeal viruses",
    "Genome editing of lytic archaeal viruses takes place during infection of a host cell that carries the appropriate genome editing plasmid (pGE1/pGE2). The genome editing plasmid harbors a mini-CRISPR array constituted by a single repeat-spacer-repeat unit located downstream from an arabinose-inducible promoter (ParaS). The resulting CRISPR RNA (crRNA) will help the endogenous CRISPR-Cas systems to recognize and cleave the protospacer of the infecting virus, as determined by the spacer sequence defined by the researcher. Some viruses will followingly repair their genomes through a double-crossover event with the donor DNA element present on pGE1/pGE2 (highlighted in gray), thus giving rise to a mutant virus that will not be targeted. This method has been used previously to delete the gene gp48 from SIRV2M (A) and to insert an affinity tag onto the C-terminus of gp48 (B). Primers are indicated above/below the regions of the virus genome to which they anneal.\nA donor DNA element, which represents the desired virus mutation. This mutant allele is flanked by regions perfectly homologous to the regions flanking the corresponding wild-type allele in the virus. This shared homology allows the donor DNA to be inserted into the viral genome via a double-crossover event (Figure 1[href=https://www.wicell.org#fig1]), thus generating the mutant virus.\nThe result is that the original virus is eliminated while the mutant virus remains untargeted and is allowed to propagate.\nThroughout this protocol, we will occasionally help explain selected steps by giving examples from two previous works: the targeted deletion of gp48 from the genome of SIRV2M (Figure 1[href=https://www.wicell.org#fig1]A), and the insertion of an octahistidine (8xHis)-tag onto the C-terminus of gp48 in the genome of SIRV2M (Figure 1[href=https://www.wicell.org#fig1]B) (Bhoobalan-Chitty et al., 2019[href=https://www.wicell.org#bib2]).\nConstruction of the genome editing plasmid\nDesign, assembly, and insertion of the spacer DNA element\nTiming: 4 days",
    "Within the region of interest in the virus genome, select a 39- to 45-bp protospacer (Figure 2[href=https://www.wicell.org#fig2]A) that fulfills the following criteria:\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1031-Fig2.jpg\nFigure 2. Design of the spacer DNA element and sequence features of pGE2\nThe region of interest in the virus genome (A, top) is screened for a non-redundant protospacer with a 5′-end flanked by a 5′-GTN-3′ protospacer adjacent motif (PAM) compatible with the type I-D CRISPR-Cas systems of the host. Here, ‘N’ can assume any nucleotide. Based on the selected protospacer, the spacer DNA element is assembled from two ssDNA oligonucleotides with sequences complementary to each strand of the protospacer (A, bottom). Furthermore, each ssDNA oligonucleotide includes 3-nt 5′-overhanging sequences, allowing the final spacer DNA element to be cloned in between the type subtype I-D repeats found in pGE2. The backbone of pGE2 (A, top) contains an ampicillin resistance marker (AmpR) and the pyrEF operon which allows for stable maintenance of pGE2 in E. coli DH5α and S. islandicus LAL14/1, respectively. The multiple cloning site of pGE2 (A, bottom) consists of an insertion site for the donor DNA (between the PaeI and XhoI restriction sites) as well as a type I-D mini-CRISPR-array where the insertion site for the spacer is located (between the two oppositely oriented LguI sites). An arabinose promoter (ara-box), B recognition element (BRE), and TATA-box ensure that the mini-CRISPR-array is transcribed. Please note, the multiple cloning site shown here neither contains a spacer nor a donor DNA. TSS = Transcriptional Start Site.\nThe protospacer should be absent or disrupted in the desired mutant virus.\nIdeally, the protospacer should be chosen from the template strand, as type III CRISPR-Cas systems can only recognize and bind transcript-RNA rather than DNA.",
    "The 5′-end of the protospacer should be flanked by a protospacer adjacent motif (PAM) compatible with the subtype I-A or subtype I-D CRISPR-Cas systems of S. islandicus LAL14/1, i.e., 5′-CCN-3′ or 5′-GTN-3′, respectively (Gudbergsdottir et al., 2011[href=https://www.wicell.org#bib4]; Lin et al., 2020[href=https://www.wicell.org#bib8]). Here, ‘N’ can assume any nucleotide.\nTo create the spacer element, design and order a pair of single-stranded (ss)DNA oligos that are complementary to the two strands of the selected protospacer. The two ssDNA oligos should have 3-nucleotide (nt) 5′-overhangs with sequences AAG/AGC or AAC/TAC to match the oppositely oriented LguI sites of pGE1 or pGE2, respectively (Figure 2[href=https://www.wicell.org#fig2]B).\nAdd equal volumes of the two ssDNA oligos (10 μM stocks) to a microcentrifuge tube, mix by vortexing, and incubate at 95°C for 10 min in a heat block.\nOnce incubation is done, turn off the heat block and allow the mixture to cool down to RT gradually to promote the hybridization of the two ssDNA oligos.\nThe resulting double-stranded (ds)DNA spacer element will be 39 bp in length with 3-nt 5′-overhangs that allows it to be inserted in pGE1 or pGE2. Store at −20°C until needed.\nNote: The backbones of pGE1 and pGE2 contain mini-CRISPR arrays made with type I-A repeats and type I-D repeats, respectively, but apart from this the two plasmids have identical sequences. For clarity, the map and sequence of the multiple cloning site (MCS) of pGE2 is shown in Figure 2[href=https://www.wicell.org#fig2]B. For the rest of the protocol, we will keep using pGE2 as an example.\nClone the dsDNA spacer element (from step 2) into a linearized (FD LguI) sample of pGE2 to construct a plasmid encoding a mini-CRISPR array expressing a spacer targeting the original SIRV2 genome (pGE2-Spcgp48).\nThe purified pGE2-Spcgp48 sample should be stored at −20°C until needed.",
    "Design, assembly, and insertion of the donor DNA element\nTiming: 6 days\nThe donor DNA element is assembled via fusion PCR by overlap extension (Figure 3[href=https://www.wicell.org#fig3]). To do this, design and order two pairs of primers which will anneal to and amplify the regions of the virus genome located immediately up and downstream, respectively, from the target gene (deletions) and target site (modifications). The resulting amplicons are referred to as the left and right arm of the donor DNA. Each arm should be 200–500 bp in length. Importantly, every primer used for donor DNA assembly should include a 5′-overhang of a particular sequence:\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1031-Fig3.jpg\nFigure 3. Assembly of donor DNA elements via fusion PCR by overlap extension\nThe examples shown illustrate how the donor DNA elements were generated that promote (A) the deletion of gp48 and (B) the insertion of a histidine tag onto the C-terminus of gp48, as originally performed by (Bhoobalan-Chitty et al., 2019[href=https://www.wicell.org#bib2]). Here, the SIRV2 genome serves as template in the first round of PCRs [1], by which two DNA fragments are formed, denoted as the left and right arm of the donor DNA. Due to the specific sequences included in the 5′-overhangs of the inner (fusion) primers, the left and right arms will contain overlapping sequences that allow the arms to hybridize when mixed [2]. In these hybrids, the strand from either arm can use the strand from the opposite arm as a template for extension in the second round of PCR [3], thus yielding a complete, double-stranded donor DNA. This is further amplified by the outer primers, which are also responsible for integrating restriction sites PaeI and XhoI in the ends of the donor DNA. PS = protospacer.",
    "The two outer primers (e.g., gp48 Kn PaeI F and gp48 Kn XhoI R, as shown in Figure 3[href=https://www.wicell.org#fig3]A) should include sequences for the restriction sites PaeI and XhoI in their 5′-overhangs such that the donor DNA will have restriction sites matching those found in the MCS of pGE2 (Figure 2[href=https://www.wicell.org#fig2]).\nThe two inner (fusion) primers should contain a shared sequence in their 5′-overhangs, thus allowing the left and right arms of the donor DNA to overlap and fuse. The specific sequence of the 5′-ends of these inner primers also determine the kind of mutation made:\nFor deletions (Figure 3[href=https://www.wicell.org#fig3]A), the 5′-overhanging sequence of each inner primer should be identical to the sequence on the opposite side of the region intended for deletion.\nFor insertion of affinity tags (Figure 3[href=https://www.wicell.org#fig3]B), the genetic sequence encoding the tag should be included within the 5′-overhanging sequences of both inner primers.\nSet up the first round of PCR reactions according to the tables below. To exemplify, we here describe how the arms for the donor DNA promoting the insertion of the 8xHis-tag on the C-terminus of gp48 (Figure 3[href=https://www.wicell.org#fig3]B) were made:\nTwo individual PCR mixtures, one for each arm of the donor DNA:\ntable:files/protocols_protocol_1031_19.csv\nThe PCR program is the same for either PCR:\ntable:files/protocols_protocol_1031_20.csv\nThe annealing temperature is equal to the salt-adjusted melting temperature of the primers, as calculated by OligoCalc (Link: OligoCalc: Oligonucleotide Properties Calculator (northwestern.edu[href=http://northwestern.edu])).\nVerify the length/purity of the left and right arm PCR fragments by agarose gel electrophoresis.\nPurify the PCR fragments of the left and right arm with the GeneJET™ PCR Purification Kit.\nSet up the second round of PCR according to the tables below:\nThe PCR mixture should contain both arms of the donor DNA at equal concentrations.\ntable:files/protocols_protocol_1031_21.csv",
    "aThe two outer primers should not be added to the reaction mixture until after the hold at 4°C.\nThe PCR program is split into two stages, the two outer primers are not added until the completion of the first stage. This is because the left and right arms of the donor DNA should first denature, mix, and reanneal, thus allowing for DNA polymerase extension from the exposed 3′-ends of the overlapping sequences (as shown in Figure 3[href=https://www.wicell.org#fig3]).\ntable:files/protocols_protocol_1031_22.csv\nThe annealing temperature is equal to the salt-adjusted melting temperature of the primers/overlapping sequences, as calculated by OligoCalc (Link: OligoCalc: Oligonucleotide Properties Calculator (northwestern.edu[href=http://northwestern.edu])).\nAnalyze the fusion PCR fragment by agarose gel electrophoresis to verify that the left and right arms have fused together and made a full-length donor DNA element.\nPurify the donor DNA element with the GeneJET™ PCR Purification Kit and digest the donor DNA element (FD PaeI/XhoI).\nClone the digested donor DNA element into the linearized (FD PaeI/XhoI) and dephosphorylated (Fast AP) sample of pGE2-Spcgp48, resulting in a plasmid carrying both the donor DNA and a spacer-harboring mini-CRISPR array (pSIRV2Mgp48his). We routinely used Escherichia coli DH5α for cloning work and for purifying plasmids at high yields. Plasmid preparations of high yield and purity are crucial for successful electroporation into S. islandicus LAL14/1.\nAs a final validation to mark the end of the cloning efforts, send a sample of the purified pSIRV2Mgp48his for sequencing at an external partner (e.g., Eurofins Genomics, Germany).\nThe purified pSIRV2Mgp48his should be stored at −20°C until needed.\nElectroporation of the genome editing plasmid\nTiming: 13–18 days\nThe electroporations should be performed with the Gene Pulser Xcell™ electroporation system with parameters set to 1.5 kV, 600 Ω and 25 μF (Deng et al., 2009[href=https://www.wicell.org#bib3]; Schleper et al., 1992[href=https://www.wicell.org#bib11]).",
    "Note: Transforming plasmid DNA into S. islandicus LAL14/1 cells by electroporation is a difficult task that depends on the purity of the plasmid sample, the density of the competent cells, and the timing of each step in general.\nFor each constructed plasmid to be electroporated, prepare the following materials:\nCast a 0.7% gelrite/SCV plate.\nTransfer 5 mL 2×SCV medium and 5 mL 0.4% gelrite into separate glass tubes and preheat them in an incubator set to 78°C.\nTransfer 950 μL of 1× medium salts solution to a microcentrifuge tube and preheat it to 78°C on a heat block placed next to the Gene Pulser Xcell™ electroporation system.\nUnpack the Gene Pulser/MicroPulser electroporation cuvettes (0.1 cm gap) and place them within reach on the same workbench as the Gene Pulser Xcell™ electroporation system.\nFrom the −80°C freezer, take out the microcentrifuge tubes containing the 50-μL aliquots of electrocompetent S. islandicus LAL14/1 Δarrays cells (described in previous sections) and thaw the cells on ice for ∼5 min.\nOnce thawed, transfer 1 μL of a purified plasmid sample (corresponding to 300–500 ng of plasmid DNA) to the 50 μL aliquot of cells. Gently flick the microcentrifuge tube a few times to ensure proper mixing. As a negative control, make a mixture with milliQ-H2O instead of the plasmid.\nTransfer the mixture to a Gene Pulser/MicroPulser electroporation cuvette (0.1 cm gap), place the brown cap back on, and tap the cuvette on the desk a few times to thoroughly collect the mixture in the bottom of the gap. Place the loaded cuvette in the shockpod of the GenePulser Xcell™ electroporation system.\nPulse the mixture and note the time of conductance.\nNote: Successful electroporations of plasmid DNA into S. islandicus LAL14/1 cells usually have a time of conductance around 9.6–9.8 milliseconds.",
    "Immediately after electroporation, rescue the cells by transferring ≅ 600 μL of the preheated medium salts solution to the cuvette, mix briefly by pipetting up and down, and then transfer the cells and the medium salts back into the microcentrifuge tube on the heat block, set to 78°C. Allow the cells to recover and incubate for 30 min.\n10 min before incubation is done, place the 0.7% gelrite/SCV plates (with their lids still on) in the 78°C incubator.\nAdd 100 μL of the electroporated cell suspension into the 5 mL of preheated 2×SCV medium, then add the 5 mL of preheated 0.4% gelrite, and swirl the tube thoroughly to ensure proper mixing. Gently distribute this mixture onto the preheated 0.7% gelrite/SCV plate.\nOnce the top layer has solidified (after approx. 30 min), stack the plates in sealed plastic bags and place them in an air-tight container. Incubate the plates for 7–10 days at 78°C.\nSingle colonies will have emerged on the plates (Figure 4[href=https://www.wicell.org#fig4]A). They appear as sparks of an irregular shape. Use a pipette to inoculate individual colonies into 15 μL of 1× medium salts solution and resuspend the cells by vigorous pipetting.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1031-Fig4.jpg\nFigure 4. Electroporation of genome editing plasmid into S. islandicus LAL14/1 Δarrays and verification of transformants",
    "Colonies of Sulfolobus transformed with plasmid (A, left panel) become visible after 10 days of incubation at 78°C. Transformations performed with milliQ-H2O instead of plasmid (A, right panel) is a useful negative control to identify possible false positives. To obtain a decent amount of cells, the transformants are inoculated, resuspended, and spotted onto a new Gelrite/SCV plate followed by incubation for another 3–5 days at 78°C (B). Any spots showing growth (e.g., Col. 1) are tested for plasmid presence by PCR (C), using Seq-F and Seq-R primers that anneal to the backbone of pGE2. As negative control (–), the PCR was performed with milliQ-H2O instead of cells.\nOnce resuspended, spot the cell suspension onto a fresh 0.7% gelrite/SCV plate (Figure 4[href=https://www.wicell.org#fig4]B). Pack these plates as described previously and incubate for 3–5 days at 78°C.\nIn case of growth, scrape a small amount of the Sulfolobus cells from the spot with a pipette tip or inoculation loop and resuspended in 20 μL milliQ-H2O. Dilute the resuspension 50-fold with milliQ-H2O.\nPerform a PCR to confirm the presence of the plasmid pSIRV2Mgp48his within the inoculated colonies using the primers Seq-F and Seq-R (Figure 4[href=https://www.wicell.org#fig4]C).\nTransfer positive spots into 20 mL of 1× SCV medium and incubate at 78°C for 1–2 days.\nFor long-term storage of the constructed strains, we recommend preparing glycerol stocks:\nSubculture transformants at a starting OD600 of 0.05.\nAfter incubation for 36 h or when OD600 ≅ 0.6–0.7, centrifuge 10 mL of the culture at 6,300 × g for 5 min.\nResuspend the pellet in 670 μL of 1× medium salts solution and add 200 μL of sterile 87% (v/v) glycerol in a microcentrifuge tube.\nThe glycerol stocks of the cells can be stored at −80°C.\nGenome editing of SIRV2\nTiming: 12 days",
    "Inoculate the S. islandicus LAL14/1 Δarrays strain carrying the genome editing plasmid (hereafter, referred to as Δarrays/pSIRV2Mgp48his) into 30 mL fresh SCV medium in an Erlenmeyer flask such that the initial OD600 will be around 0.05. Start incubation.\nOnce the culture of Δarrays/pSIRV2Mgp48his has reached OD600 = 0.6–0.8 (after approx. 36 h), transfer a specific volume of the suspension into fresh SCV medium to a final volume of 30 mL, such that the OD600 of the new culture starts at 0.05. This volume is calculated by Equation (1)[href=https://www.wicell.org#fd1] as used in previous sections. Allow this culture to incubate for 1 h at 78°C.\nAdd a specific volume of the titrated virus sample to the 30-mL culture of Δarrays/pSIRV2Mgp48his such that the MOI of the culture will be around 0.1.\nIn general, the volume Vvir of virus sample required to reach any given MOI is calculated according to Equation (4)[href=https://www.wicell.org#fd4]:\n   (Equation 4)    V  v i r   =   M O I ⋅ O  D 600  ⋅    10 8     C F U   m l    0.2  ⋅  ( 30  m l  −  Y )   X      \nHere, OD600 is the measured optical density of the 30-mL culture after 1 h, Y is the volume (in ml) that was removed from the 30-mL culture to measure the OD600, and X is the titer (given in PFU/mL) of the virus sample, as determined by plaque assay in a previous section.\nIn addition, prepare the following two cultures:\nA culture of plasmid-free Δarrays infected with the virus sample at an MOI around 0.1\nAn uninfected culture of Δarrays/pSIRV2Mgp48his where the virus sample is replaced by a similar volume of sterile 1× medium salts solution.",
    "Incubate the suspensions for two days while monitoring the OD600 regularly (Figure 5[href=https://www.wicell.org#fig5]A). Around 24 and 48 h post infection (hpi), take out 1-mL samples from the culture and store them at RT.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1031-Fig5.jpg\nFigure 5. Genome editing of SIRV2\nGrowth curves (A) of a genome editing host (Δarrays/pΔSIRV2gp48) in the presence and absence of an infecting virus. Results from three biological replicates are shown and error bars indicate the corresponding standard deviations. The double-headed arrows indicate the crucial difference in OD600 that should be observed between infection of the genome editing host and infection of a CRISPR deficient (Δarrays) host. A plaque assay (B) is performed to allow for the isolation of viruses with a single genotype. The genotype of each inoculated plaque is verified by PCR (C). For illustration, we here show the PCR fragments amplified from the original virus (SIRV2M) as well as the two mutant viruses (SIRV2MΔ48 and SIRV2Mgp48his) mentioned throughout this protocol. The PCRs check for the presence of the genomic region of interest containing gp48 (C, left panel), the absence of gp48 in the virus genome (C, middle panel), and the presence of an octahistidine (8xHis)-tag in the virus genome (C, right panel). The primer pairs are shown below each panel and are further illustrated in Figure 1[href=https://www.wicell.org#fig1].\nIsolate the virus particles by centrifuging the collected samples at 10,000 × g for 6 min and transfer the supernatant into new microcentrifuge tubes.",
    "Analyze the virus samples by PCR to point out the positive virus sample. The PCR mixture should contain a primer that anneals specifically to the donor DNA that has been inserted (e.g., virus his chkF) and another primer that anneals to the flanking region in the virus genome (e.g., gp48 out chkF). This setup is illustrated in Figure 1[href=https://www.wicell.org#fig1]B. Importantly, the latter primer should not anneal to pSIRV2Mgp48his, as this would give rise to false positives.\nNote: If the band corresponding to the mutant virus is either absent or faint, repeat the genome editing protocol from step 33 by propagating an aliquot of the latest virus sample for a further two days in a fresh culture of Δarrays/pSIRV2Mgp48his.\nUpon confirmation, the supernatants containing the positive virus mutants should be employed in a plaque assay, following the protocol described in step 20 of the “before you begin[href=https://www.wicell.org#before-you-begin]”-section.\nNote: While the purpose of the plaque assay in the “before you begin[href=https://www.wicell.org#before-you-begin]”-section was to determine the virus titre, the purpose of the present plaque assay is to isolate individual plaques with the mutant genotype.\nUsing the 1000-μL pipette, pick 10–20 individual plaques that have emerged from the 0.7% Gelzan CM/SCVU plates (Figure 5[href=https://www.wicell.org#fig5]B) and inoculate them individually into 20 μL of 1× medium salts solution. Resuspend the plaques thoroughly by pipetting up and down a few times.\nRepeat the PCR from step 36, this time using individual, resuspended plaques as template. Analyze the amplicons by agarose gel electrophoresis in order to identify the plaques with the desired mutant genotype (Figure 5[href=https://www.wicell.org#fig5]C).",
    "As a final validation of the selected virus, send the amplified genomic fragments for sequencing at an external service (e.g., Eurofins Genomics, Germany). Align the mutant virus sequence with the reference genome using pairwise sequence alignment tools (BLAST) to confirm the accuracy of the desired virus modification.\nPull-down of a genomically tagged virus protein expressed during infection\nAs a proof-of-concept of the methods presented above, we will end this protocol by giving an example of how the constructed mutant viruses can improve research within the field of archaeal host-virus interactions. Specifically, we will describe how a virus protein such as gp48/AcrIIIB1, which has been genomically tagged with an 8xHis-tag, can be purified from an infected host culture. Compared to having the virus protein expressed from an expression vector inside the host, expressing and purifying the protein from the virus itself during infection ensures accuracy in terms of expression levels and native interaction partners.\nVirus preparation\nTiming: 5–7 days\nInoculate the Δarrays/pSIRV2Mgp48his strain from the −80°C glycerol stock (described in step 30) into 30 mL fresh SCV medium in an Erlenmeyer flask. Allow the culture to incubate for two days at 78°C and 150 rpm.\nOnce the 30-mL culture has reached OD600 ≅ 0.8–1.0, dilute the culture with fresh SCV medium to a final volume of 1 liter. Measure the initial OD600 (should be around 0.025) and allow the 1-liter culture to incubate until OD600 ≅ 0.1.\nPrepare a 10−3 dilution of the latest SIRV2Mgp48his sample in 1× medium salts solution and transfer 300 μL into the 1-liter Δarrays/pSIRV2Mgp48his culture to start the virus propagation. Incubate the host-virus suspension for 36 h while monitoring the OD600 regularly every 12 h.",
    "Note: If the OD600 of the host-virus suspension is above 0.4 at 36 hpi, repeat the procedure from step 43 with a fresh 1-litre host suspension and a less diluted virus sample.\nIsolate the SIRV2Mgp48his virus particles by centrifuging the 1-liter culture at 10,000 × g for 6 min and transfer the supernatant into a new flask.\nPerform a plaque assay to determine the virus titer in the infected culture supernatant, following the instructions described previously in step 20 of the “before you begin[href=https://www.wicell.org#before-you-begin]”-section.\nInfection and harvesting of cells\nTiming: 6 days\nInoculate the S. islandicus LAL14/1 ΔCas6(I-D) and S. islandicus LAL14/1 ΔCas6(I-D)/pCmr6α-HA host strains from their respective −80°C glycerol stocks into individual Erlenmeyer flasks each filled with 20 mL fresh SCV(U) medium. Allow the two cultures to incubate for two days.\nNote: Be aware that S. islandicus LAL14/1 ΔCas6(I-D) should be grown in SCVU medium whereas S. islandicus LAL14/1 ΔCas6(I-D)/pCmr6α-HA should be grown in SCV medium due to its plasmid.\nOnce the 20-mL cultures have reached OD600 ≅ 0.8–1.0, transfer each culture into fresh, pre-heated medium to final volumes of 120 mL. Incubate the cultures for approximately 24 h.\nSplit each 120-mL culture in two and transfer each half into fresh, pre-heated medium to a final volume of 1 liter (i.e., two liters of culture is started per strain in this step). Allow these cultures to incubate for ∼20 h.\nNote: When incubating large batches of an S. islandicus culture, we recommend dispersing the culture volume into 1-litre aliquots and growing each aliquot in parallel in 2-litre Duran® bottles which can fit in an incubator large enough to contain and heat all flasks to 78°C simultaneously. In our case, we have used two New BrunswickTM INNOVA 44 incubator shakers.",
    "When the four 1-liter cultures have reached OD600 ≅ 0.4, transfer 150-mL of each culture into new 2-liter Duran® bottles containing 850 mL fresh, pre-heated medium. In total, 12 liters will be made for each host strain. The initial OD600 of these cultures should be around 0.06. Allow all parallel cultures to incubate in the same incubator overnight (approx. 12–14 h).\nOnce the cultures have reached early exponential growth phase (OD600 = 0.2–0.3), infect each culture with a specific volume of the SIRV2Mgp48his sample (from step 44) to arrive at a MOI = 1. This volume is calculated by Equation (4)[href=https://www.wicell.org#fd4], remembering to replace “30 mL” with “1000 mL” in the formula. Allow the infected cultures to continue their incubation for 3 h.\nNote: The incubation time depends on the expression phase of the target protein. Purification of target proteins corresponding to early expressed genes should be harvested 2–3 hpi, those corresponding to middle/late expressed genes should be harvested at a later time point, but prior to cell lysis (8 hpi).\nRemove the bottles from the incubator and allow the cultures to cool down to RT.\nOnce cooled, harvest the cells from the 2×12 liters of culture by centrifugation at 6,300 × g and 16°C for 10 min. We recommend using the Sorvall LYNX 6000 superspeed centrifuge.\nDiscard the supernatants and weigh the cell pellets.\nResuspend the cell pellets in cool (4°C) lysis buffer, using 5 mL of buffer per gram of pellet. This step should be performed on ice. Resuspend by pipetting, not by vortexing.\nTransfer the resuspended cell pellets into Falcon tubes and store at −80°C until needed.\nProtein purification/protein pull-down\nTiming: 2 days\nThaw the resuspended cell pellets by placing the Falcon tubes in a water bath for ∼ 30 min.",
    "Lyse the archaeal cells by the following steps:\nFirst, a round of sonication (30 cycles of 3-s pulses intervened by 3-s pauses).\nThen, two rounds of homogenization with a French press equilibrated with the lysis buffer.\nFinally, end with another round of sonication, using the same program as above.\nCritical: To avoid contamination between the two host strain suspensions, rinse the sonicator rod with 70% ethanol and run some 20% ethanol through the French press several times between individual samples. This clean-up should also be done before and after the instruments are used.\nRemove all cell debris from the lysed cell samples by centrifugation at 16,000 × g and 4°C for 45 min. The precipitate will be dark brown/gray, while the supernatant appears beige. Move both supernatants to new Falcon tubes and repeat the centrifugation until the precipitates become smaller than a fingernail and the supernatants become slightly transparent.\nMeanwhile, equilibrate 2×2 mL of nickel nitrilotriacetic acid (Ni-NTA) agarose resin (QIAGEN):\nSpin down the agarose resins at 800 × g for 3 min in a swinging-bucket centrifuge.\nDiscard the storage buffer and resuspend each resin bed in 10 mL of lysis buffer.\nRepeat substeps 57.a and 57.b at least five times.\nFilter the supernatants (from step 56) through sterile, non-pyrogenic, hydrophilic filters (0.45 μm) and mix with the equilibrated Ni-NTA agarose resins (from step 57) in 50-mL Falcon tubes. Allow both mixtures to incubate overnight (approx. 14 h) at 4°C on a rotary wheel set to 10 rpm.\nNote: The slow rotation speed is applied to minimise the generation of foam, which is a potential source of protein loss in this protocol. Furthermore, use the two Falcon tubes as counterweights for each other to stabilise the rotor speed.",
    "Spin the protein-bound Ni-NTA resins at 800 × g for 3 min in a swinging-bucket centrifuge.\nDiscard the supernatants and wash the protein-bound Ni-NTA resins:\nAdd 10 mL of lysis buffer to each resin bed and incubate for 5 min on the rotary wheel set to 10 rpm to ensure proper mixing.\nSpin down the agarose resins at 800 × g for 3 min in a swinging-bucket centrifuge and remove the supernatant.\nRepeat substeps 60.a and 60.b at least five times to remove all unbound proteins.\nAfter the last centrifugation, resuspend the resin beds in 0.8–1.0 mL lysis buffer each and transfer the mixtures from the Falcon tubes to microcentrifuge tubes.\nSpin down the microcentrifuge tubes at 800 × g for 3 min and discard the supernatant.\nElute the proteins that are bound to the Ni-NTA resins:\nAdd an equal volume of elution buffer to the protein-bound Ni-NTA agarose resin beds and incubate the tubes for 5 min on a rotary wheel set to 10 rpm.\nSpin down the microcentrifuge tube with the elution mixture at 800 × g for 3 min and transfer the supernatant to a new microcentrifuge tube. Refill the microcentrifuge with a fresh bed volume of elution buffer.\nRepeat substeps 61.a to 61.b at least five times to extract all proteins from the resin.\nCombine the collected eluates into one volume and concentrate the proteins via spin filtering, e.g., by using the Pierce™ Protein Concentrator PES (10K MWCO). Briefly, the protein solutions are added to separate spin columns and centrifuged at 10,000 × g in rounds of 4 min until only 100 μL is left in each spin column. Transfer the retentates into new microcentrifuge tubes and store them at 4°C until needed.",
    "Resolve the concentrated protein samples by SDS-PAGE using the mini-PROTEAN® Electrophoresis system (Bio-Rad, USA).\nPrior to gel loading, mix 15 μL of each concentrated protein sample with 5 μL of 4× SDS loading buffer, incubate for 5 min on a heat block set to 95°C, and collect the mixtures at the bottom of the microcentrifuge tube by a brief spin down.\nThe samples were separated on a 12% SDS-PAGE gel at 16 mA for up to 2 h with the voltage set to a maximum of 120 V.\nAfter the run, remove the gel from the chamber and stain it for 1 h with a Coomassie Brilliant Blue (R-250)-based staining solution.\nDestain the gels repeatedly in destaining solution until the protein bands can be distinguished clearly from the background (as shown best in Figure 6[href=https://www.wicell.org#fig6]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1031-Fig6.jpg\nFigure 6. SDS-PAGE and Western Blots showing virus protein expressed and purified during infection\nThe His-tagged copy of gp48/AcrIIIB1 was expressed from the virus SIRV2Mgp48his during infection and subsequently used as bait in a protein pull-down. The proteins in the pull-down samples were separated on a 12% SDS-polyacrylamide gel (left panel). The migrations and relative intensities of the bands that appear in the gel correspond well to the size and stoichiometry of the six subunits of the Cmr-α complex (indicated to the right of the gel). The concentrated pull-down samples were separated on a 12% SDS-polyacrylamide gel, the presence of human influenza hemagglutinin (HA)-tag on the target protein (Cmr6α) was detected using the primary and secondary antibodies, HA Tag Monoclonal Antibody (2–2.2.14) and Goat anti-Mouse IgG (H+L) Secondary Antibody, HRP respectively (right panel).\nWestern blot analysis\nTiming: 1–2 days",
    "Resolve the concentrated protein samples on another 12% SDS-PAGE gel, this time without staining and destaining the gel after the run. Instead, wash the separation gel with distilled H2O.\nTransfer the proteins from the SDS-PAGE gel to a Nitrocellulose membrane by Semi-Dry transfer:\nPrepare the blotting papers and the Nitrocellulose membrane (AmershamTM ProtranTM 0.45 μm NC) by soaking them individually in the transfer buffer.\nThe transfer assembly should be arranged top-to-bottom in the following order: cathode, blotting paper, SDS-polyacrylamide gel, nitrocellulose membrane, blotting paper, anode.\nRemember to remove any air bubbles during this assembly by gently rolling a cylindrical object over the setup before placing it between the cathode and anode.\nConnect the transfer assembly to the power source and perform the protein transfer at 70 mA for 75 min. The voltage should be set to any value >20 V to prevent the voltage from being the limiting factor during the transfer.\nOnce the transfer is complete, carefully separate the nitrocellulose membrane from the gel and the blotting papers, and incubate the membrane in wash buffer (WB) for 2 min.\nPrepare blocking buffer by dissolving 1.5 grams of skim milk in the WB.\nReplace the WB with 30 mL of blocking buffer (the exact volume depends on the size of the membrane incubation tray) and incubate for 30 min at RT on a shaking platform.\nPause point: The membrane soaked in the blocking buffer can be placed overnight (approx. 14 hours) at 4°C (no shaking).\nWash the nitrocellulose membrane three times with the WB for 3 min each. Incubate at RT on a shaking platform.\nIf the membrane was incubated at 4°C overnight, it should first be allowed to incubate at RT for 30 min on a shaking platform before this washing step.",
    "Prepare the primary antibody solution by mixing “HA Tag Monoclonal Antibody (2–2.2.14)” and WB at 1:10000 (v/v) final ratio.\nDiscard the WB and incubate the membrane in the primary antibody solution for 1–4 h at RT on a shaking platform.\nRepeat step 69.\nPrepare the secondary antibody solution by mixing “Goat anti-Mouse IgG (H+L) Secondary Antibody, HRP”, and WB at 1:3000 (v/v) final ratio.\nDiscard the WB and incubate the membrane in the secondary antibody solution for 1 h at RT on a shaking platform.\nRepeat step 69. After the final wash, mix equal volumes of Stable Peroxide Solution and the Luminol/Enhancer Solution from the SuperSignalTM West Pico PLUS Chemiluminescent Substrate Kit (Substrate mixture).\nAfter the final wash, remove the WB as much as possible without drying the membrane and transfer the Nitrocellulose membrane into a dry container. Spread the substrate mixture uniformly across the membrane and incubate for 2–3 min.\nPlace the membrane between two transparent plastic sheets, remove any air bubbles, and bind it within a Kodak BioMax Cassette.\nSignal development:\nIn a darkroom, place an X-ray film (AGFA CP-BU, Kruuse) directly on top of the plastic-wrapped membrane.\nAfter 30–60 s, develop the film using the developer and fixer solutions. The resulting image is supposed to look like that shown in Figure 6[href=https://www.wicell.org#fig6]B."
  ],
  "subjectAreas": [
    "Protein Expression And Purification",
    "Crispr",
    "Microbiology",
    "Genetics",
    "Molecular Biology",
    "Protein Biochemistry"
  ],
  "bigAreas": [
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}