{
  "id": 650,
  "origin_website": "Nature",
  "title": "Modeling evolution of insect resistance to genetically modified crops",
  "procedures": [
    "1)  Create a new workbook in Microsoft Excel.  Rename worksheet 1 \"Input\" and worksheet 2 \"Output.\"\n2)  If Microsoft Excel 2007 is used, open the Developer tab \\(right click on the main toolbar, select \"Customize Quick Access Toolbar\", select \"Popular\" from menu, and check box that says \"Show Developer Tab on the Ribbon\").  In earlier versions of Excel, open the Visual Basic Toolbar \\(Tools...Customize...Visual Basic)\n3)  Open the Visual Basic Editor \\(Button on toolbar).  Insert a module to the editor.  This can be done using the menus on top:  Insert...Module, or by right-clicking on Microsoft Excel Objects in the directory on the left of the screen.  Make sure the module \\(Module1 is the default) is shown as a Microsoft Excel Object.\n4)  The full computer program SERBt and comments are attached in a file and listed below.  Paste into the module screen the full text from the attached file \\(click download at bottom)or from immediately below:\nOption Explicit                                 ' Requires all variables to be declared\n'   Variable definitions\nDim Fss, Frs, Frr As Double                     ' Frequency of three genotypes \\(ss, rs, rr)\nDim RefWss, RefWrs, RefWrr As Double            ' Fitness of three genotypes in refuge\nDim BtWss, BtWrs, BtWrr As Double               ' Fitness of three genotypes in Bt field\nDim Wss, Wrs, Wrr As Double                     ' Fitness of each genotype \\(across both fields)\nDim PRef, PBt As Double                         ' Proportion of habitat planted to refuge and Bt fields\nDim Inits, Initr, Freqs, Freqr As Double        ' Initial frequency of alleles and frequency over time\nDim Wm As Double                                ' Population weighted mean fitness\nDim Deltar As Double                            ' Change in r allele frequency each generation\nDim GenYear As Integer                          ' Number of generations per year\nDim GeneCrit As Double                          ' Genotypic Criterion \\(FREQr = 0.5 is standard)",
    "Dim Gen, A, Years As Integer                    ' Loop Counters\n' Beginning of program code\nSub BtResistance\\()\n    Sheets\\(\"Input\").Select      ' Input data on worksheet \"Input\" \\(Worksheet must be named \"Input\")\n     \n'   All input variables are drawn from worksheet \"Input\".  Values could be entered below directly if desired.\n    Inits = Cells\\(3, 1)         ' Initial frequency of s allele \\(Input taken from Row 3, Column A)\n    Initr = Cells\\(3, 2)         ' Initial frequency of r allele in \\(Input taken from Row 3, Column B)\n    Freqs = Inits               ' Frequency of s allele\n    Freqr = Initr               ' Frequency of r allele\n    PRef = Cells\\(6, 1)          ' Proportion refuge \\(Input taken from Row 6, Column A)\n    PBt = 1 - PRef              ' Proportion Bt\n    GenYear = Cells\\(6, 5)    ' Number of generations per year \\(Input taken from Row 6, Column E)\n    Years = Cells\\(6, 10)        ' Number of simulated years\n    Gen = Years  ==*== GenYear       ' Number of simulated generations\n    \n    RefWss = Cells\\(3, 5)        ' Fitness of ss in refuge \\(Input taken from Row 3, Column E)\n    RefWrs = Cells\\(3, 6)        ' Fitness of rs in refuge \\(Input taken from Row 3, Column F)\n    RefWrr = Cells\\(3, 7)        ' Fitness of rr in refuge \\(Input taken from Row 3, Column G)\n    BtWss = Cells\\(3, 10)        ' Fitness of ss in Bt field \\(Input taken from Row 3, Column J)\n    BtWrs = Cells\\(3, 11)        ' Fitness of rs in Bt field \\(Input taken from Row 3, Column K)\n    BtWrr = Cells\\(3, 12)        ' Fitness of rr in Bt field \\(Input taken from Row 3, Column L)\n     \n'   Values of generation counter determine number of generations to run unless stop point is reached\n     \n    For A = 1 To Gen\n    \n'   Calculate genotype frequencies at beginning of generation\n    \n        Fss = Freqs  ==*== Freqs",
    "Frs = 2  ==**== Freqs  ==**== Freqr\n        Frr = Freqr  ==*== Freqr\n        \n'   Calculate fitness of each genotype and population weighted mean fitness\n        Wss = BtWss  ==**== PBt + RefWss  ==**== PRef\n        Wrs = BtWrs  ==**== PBt + RefWrs  ==**== PRef\n        Wrr = BtWrr  ==**== PBt + RefWrr  ==**== PRef\n        \n        Wm = Frr  ==**== Wrr + Frs  ==**== Wrs + Fss  ==*== Wss\n        \n'   Calculate change in r allele frequency in each generation\n        Deltar = \\(Freqr  ==**== Freqs  ==**== \\(Freqr  ==**== \\(Wrr - Wrs) + Freqs  ==**== \\(Wrs - Wss))) / Wm\n        \n'   Calculate allele frequencies after each generation\n        Freqr = Freqr + Deltar\n        Freqs = 1 - Freqr\n        \n' Delete old output \\(Requires a worksheet named \"Output\")\n        Sheets\\(\"Output\").Select\n        \n        If \\(A = 1) Then\n        \n        Cells.Select\n        Selection.ClearContents\n        Range\\(\"A1\").Select\n        \n        End If\n        \n' Output initial conditions to Row 2, Columns A-C \\(Requires a worksheet named \"Output\")\n        Cells\\(1, 1) = \"Generation\"\n        Cells\\(1, 2) = \"Years\"\n        Cells\\(1, 3) = \"s Freq\"\n        Cells\\(1, 4) = \"r Freq\"\n        Cells\\(1, 5) = \"ss Freq\"\n        Cells\\(1, 6) = \"rs Freq\"\n        Cells\\(1, 7) = \"rr Freq\"\n        Cells\\(1, 9) = \"Years to Reach Genotypic Criterion\"\n        Cells\\(1, 13) = \"Dominance, h\"\n        Cells\\(4, 9) = \"Frequency of r allele in Year 20\"\n        Cells\\(4, 13) = \"Frequency of rr genotype in Year 20\"\n        Cells\\(2, 1) = 0\n        Cells\\(2, 2) = 0\n        Cells\\(2, 3) = Inits\n        Cells\\(2, 4) = Initr\n        Cells\\(2, 5) = Inits  ==*== Inits\n        Cells\\(2, 6) = 2  ==**== Inits  ==**== Initr\n        Cells\\(2, 7) = Initr  ==*== Initr\n        Cells\\(2, 13) = \\(\\(BtWrs - BtWss) / \\(BtWrr - BtWss))\n        \n' Output conditions of model runs to Row 3+, Columns A-G, Worksheet \"Output\"\n        \n        Cells\\(A + 2, 1) = A\n        Cells\\(A + 2, 2) = A / GenYear\n        Cells\\(A + 2, 3) = Freqs\n        Cells\\(A + 2, 4) = Freqr",
    "Cells\\(A + 2, 5) = Freqs  ==*== Freqs\n        Cells\\(A + 2, 6) = 2  ==**== Freqs  ==**== Freqr\n        Cells\\(A + 2, 7) = Freqr  ==*== Freqr\n        \n' Output years in which genotypic and phenotypic criteria are reached, Worksheet \"Output\"\n        If \\(Cells\\(A + 2, 4) &gt;= 0.5 And Cells\\(A + 1, 4) &lt; 0.5) Then\n        \n            Cells\\(2, 9) = Cells\\(A + 2, 2)\n            \n        End If\n        \n        If \\(A = Gen And Cells\\(A + 2, 4) &lt; 0.5) Then\n        \n            Cells\\(2, 9) = \"Not Reached\"\n    \n        End If\n        \n' Output r allele frequency and rr genotype frequency after simulated number of years\n        If \\(A = Gen) Then\n        \n            Cells\\(5, 9) = Freqr\n            Cells\\(5, 13) = Frr\n            \n        End If\n        \n    Next A\n        \nEnd Sub\n5)  The values of the several variables are input to the program from the worksheet \"Input\".  The values can be entered directly into the program code, but we find it is easier to manipulate the variables on the spreadsheet.  The best way to do this is to format the Input Screen as Follows \\(corresponds with code above):\nRow 3, Column A:  Initial s allele frequency \\(Value from 0 to 1)\nRow 3, Column B:  Initial r allele frequency \\(Value from 0 to 1; 1 &#x2013; Initial s)\nRow 3, Column E:  Fitness of ss genotype in refuge \\(Value from 0 to 1)\nRow 3, Column F:  Fitness of rs genotype in refuge \\(Value from 0 to 1)\nRow 3, Column G:  Fitness of rr genotype in refuge \\(Value from 0 to 1)\nRow 3, Column J:  Fitness of ss genotype in Bt field \\(Value from 0 to 1)\nRow 3, Column K:  Fitness of rs genotype in Bt field \\(Value from 0 to 1)\nRow 3, Column L:  Fitness of rr genotype in Bt field \\(Value from 0 to 1)",
    "Row 6, Column A:  Proportion Refuge \\(Value from 0 to 1)\nRow 6, Column E:  Number of generations per year \\(Integer greater than or equal to 1)\nRow 6, Column J:  Number of simulated years \\(Integer greater than or equal to 1)\nWe used Rows 1, 2, and 5 of the worksheet \"Input\" to label the variables.  No values from these rows are used as inputs to the program, but they are helpful for reference.\n6)  To run the program in Microsoft Excel 2007, click on Macros \\(Button on developer tab).  BtResistance should be highlighted.  Click on run.  In earlier versions of excel, click on Run macro \\(Button on Visual Basic Toolbar). Bt resistance should be highlighted.  Click on run.  All output of the program is displayed on the worksheet \"Output\".  Note:  the program automatically replaces old output.  If you are in design mode the program will not work.  You can exit design mode using button on Visual Basic Toolbar.\n7)  On future use of the program, when you open Excel, it will ask you about Macros.  Click \"Enable Macros\" upon opening Excel to use the program."
  ],
  "subjectAreas": [
    "Plant Sciences",
    "Genetics",
    "Computational Biology And Bioinformatics"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology",
    "Molecular Biology & Genetics"
  ]
}