{
  "id": 7509,
  "origin_website": "Bio",
  "title": "Amber Suppression Technology for Mapping Site-specific Viral-host Protein Interactions in Mammalian Cells",
  "procedures": [
    "Design and construction of plasmid vectors for the wild type and TAG-mutated viral protein Clone a gene encoding the viral protein into a vector encoding an N-terminal 3× FLAG tag.Perform cell transformation, plasmid purification, and confirmation by DNA sequencing according to standardized protocols in individual labs.Design primers to replace a selected codon of the wild type viral gene with the amber codon TAG, ideally located in the centre of the both forward and reverse primers.Note: First select aromatic amino acids such as tyrosine, phenylalanine, and tryptophan (The Bpa resembles tryptophan). Other residues such as aliphatic amino acids (isoleucine, or leucine) may also be replaced. Prioritize those within evolutionary-conserved regions. Perform oligonucleotide-based site-directed mutagenesis using QuikChange multisite-directed mutagenesis kit (Agilent Technologies) according to the manufacturer’s instructions.Preparation of the Bpa solution Freshly prepare a Bpa solution by first dissolving Bpa (Molecular weight: 269.29 g/mol) in 1 M NaOH in a weighing boat. Example: 54 mg of Bpa (Molecular weight: 269.29 g/mol) in 220 µL of NaOH solution for 100 mL of culture medium. This mother solution should be limpid.Note: Prepare an adequate amount of Bpa solution every time prior to experiments. Preparation can be at room temperature without protection from light. Sterilization is not necessary for the NaOH solution or Bpa in the NaOH solution. Leave the weighing boat covered with cling film on an orbital shaker. Bpa takes a few minutes to completely dissolve resulting in a yellow-greenish solution. Then, add the Bpa solution to 100 mL of culture medium to obtain a final concentration of 2 mM.Gently mix the medium.Add 220 µL of 1 M HCl to neutralize the culture medium (pH 6.8-7.2). Gently mix the medium again.",
    "Co-expression Note: For each new mutant derivative, it is advisable to first perform co-expression in 6-well plates and validate the incorporation of Bpa by western blot. Add the Bpa-containing medium to HEK293 cells at 70-80% confluency.Note: Prepare sets of Petri dishes with wild type or mutated derivatives in the absence or presence of Bpa. Quantify all plasmid vectors before transfection. Use standard transfection reagents, such as jetPRIME® transfection reagent (PolyPlus) to co-transfect the three plasmid vectors encoding the viral gene, tRNASup, and aaRS, at a 1:2:1 ratio.Note: The optimal ratio may change depending on the transfection efficiency and how well the proteins are expressed. However, these ratios worked in HEK293 cells for ICP22. Add transfection solution to the side of the plate, gently rock the dishes, and place the cells back in the incubator.After 24 h, replace medium with fresh Bpa-containing medium. Grow overnight.Lyse cells and affinity purify the viral protein for western blot to screen the mutant derivatives for expression (Figure 1).Note: Follow Section E for affinity purification. imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4315/bioprotoc-12-03-4315-g001.jpgFigure 1. Affinity-purified HSV-1 ICP22 viral protein from HEK293 cells cultured with and without Bpa. Wild type (WT) has no amber codons in the gene. (a) In untransfected (Untr.) cells, the bands seen at about 55 kDa is the IgG heavy chain. Specific western blot signals are obtained from immunoprecipitated samples. (b) Protein extracts from cells expressing full-length wild-type viral protein without any amber codons migrates at about 70 kDa in the presence or absence of Bpa. The wild type viral protein serves as a point of reference for selection of good mutant derivatives. (c) Protein extracts from cells co-transfected with mutated viral protein L205TAG(*). Blot looks like (a), which indicates a failure of expression. Exclude these mutants from downstream experiments.",
    "(d) Protein extracts from cells co-transfected with mutated viral protein L243TAG(*). The expressed truncated viral protein migrates at about 40 kDa. However, the mutant failed to incorporate Bpa. Exclude from downstream experiments. (e) Protein extracts from cells co-transfected with mutated viral protein Y193TAG(*). The expressed truncated protein migrates at about 30 kDa. A portion of the truncated viral protein incorporates Bpa and full-length viral protein migrating at about 70 kDa is detected [corresponding to (b)]. Select derivatives that display this pattern for live cell UV crosslinking.Live cell UV crosslinking Note: Prepare sets of Petri dishes including non UV-irradiated versus UV-irradiated wild-type or mutated derivatives of the viral gene. Experiments are performed in 10-cm dishes to obtain sufficient crosslinked products for immunoprecipitation and mass spectrometry. Gently remove the culture medium.Briefly wash off any residue with 5 mL of room-temperature PBS.Gently add 5 mL of PBS to the side of the plate.For UV crosslinking, the experiment is ideally performed in a cold room, as sterility is not necessary from this step onwards, although clean conditions are.Place the cells horizontally and stably on top of a chilled metal plate.Note: Alternatively, place the cells on ice, but ice needs to be frequently changed due to prolonged UV exposure causing it to melt. Place a clean handheld UV irradiator on top of lid-less Petri dishes. Set the irradiator to 365 nm UV and completely cover the irradiator and the Petri dishes with aluminum foil. Irradiate the cells for 45 min.Note: A portable handheld UV irradiator is convenient. However, it can only accommodate a limited number of 10-cm dishes at a time. A benchtop UV irradiator can be used, but it may have a different UV intensity. In this case, check exposure time every 20 min to see if cells remain viable.",
    "Lysis and fractionation Note: Two lysis buffers are used: the stringent RIPA buffer for total cell lysis or nuclear lysis, and the gentle RIPA buffer for cytoplasmic fractionation. Pre-equilibrate anti-Flag M2 beads by washing with the respective buffers 2-3 times, at 5 min intervals. Work on ice.Detach UV-irradiated cells and control non-UV irradiated cells by gentle scraping.Note: If cells are detached, collect by gentle pipetting. Spin the suspension at 200 × g at 4°C for 3 min.Remove PBS completely.Resuspend the cell pellets in 900 μL of gentle lysis buffer, to obtain the cytoplasmic fraction. Alternatively, resuspend the cell pellets in 900 μL of stringent lysis buffer, to obtain total cell lysates and proceed to step 10.Add 1× protease inhibitors and homogenize by pipetting.Note: Avoid frothing. Spin down at 12,000 × g at 4°C for 10-15 min.Transfer the non-pelleted solution (the cytoplasmic fraction) into 15 μL of pre-equilibrated beads in a fresh microcentrifuge tube for immunoprecipitation. Alternatively, freeze the recovered cytoplasmic fraction at -20°C until later.Resuspend the nuclear pellet in 900 μL of stringent lysis buffer.Sonicate for 10 cycles of 10 s on/off in a chilled water bath.Note: Avoid frothing. Add 8 μL of benzonase, rotate for 30 min in cold room for 1 h or until cell lysate viscosity is reduced.Spin down at 12,000 × g at 4°C for 10-15 min.Add the nuclear fraction or the total lysates to pre-equilibrated beads in a fresh microcentrifuge tube for immunoprecipitation. Alternatively, freeze the recovered supernatant at -20°C until further use.Incubate the beads overnight at 4°C on a tube rotator.Crosslink analysis Wash the beads with the respective buffer.Perform SDS-PAGE and western blot according to standardized protocols in individual labs. Probe with anti-Flag M2.Note: For proteins that may migrate the same as heavy and light chain, perform Flag elution prior to western blot.",
    "Smaller proteins can be resolved by SDS-PAGE with Tris Tricine-SDS running buffer. Analyse results as follows (Figure 2):imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4315/bioprotoc-12-03-4315-g002.jpgFigure 2. Affinity-purified HSV-1 ICP22 viral protein from HEK293 cells with or without UV exposure. (a) In untransfected (Untr.) HEK293 cells, the band seen at about 50 kDa is the IgG heavy chain. The western blot signals from immunoprecipitated samples are specific. (b) Protein extracts from cells expressing full-length wild-type (WT) viral protein, which migrates at about 70 kDa with or without UV irradiation. The wild-type viral protein serves as a point of reference for identification of crosslinked protein complexes. (c) Protein extracts from cells co-transfected with mutated viral protein Y193Bpa. Blot is comparable to (b) which indicates no visible crosslinked protein complex. Exclude these mutants from downstream analysis. (d) Protein extracts from cells co-transfected with mutated viral protein L191Bpa. A crosslink product is visible at about 250 kDa. Select derivatives that display this pattern for mass spectrometry. (e) Protein extracts from cells co-transfected with mutated viral protein W240Bpa. Several crosslinked products are visible at about 150-250 kDa. Derivatives that display this pattern are promising and can be considered for mass spectrometry."
  ],
  "subjectAreas": [
    "Microbiology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}