{
  "id": 2381,
  "origin_website": "Cell",
  "title": "TOP1 CAD-seq: A protocol to map catalytically engaged topoisomerase 1 in human cells",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nCell treatment and harvest\nTiming: 1 h\nBecause the TOP1ccs are short-lived, treat cells with the proteasome inhibitor MG132 and TOP1 poison camptothecin (CPT) to trap the TOP1ccs and prevent their proteolytic degradation (Sciascia et al., 2020[href=https://www.wicell.org#bib25]). After treatment, harvest the cells in Buffer M containing a high concentration of chaotropic salts (GTC) to stabilize the protein-DNA adducts (including the TOP1 molecules engaged with the DNA) and to remove all non-covalently bound proteins.\nCritical: Due to the transient nature of TOP1ccs, small differences in handling samples during this step might result in high variability. It is very important to be consistent with the time of treatment and harvest.\nCritical: While it is recommended to work at cold temperature (10°C), it is also important to not place the sample in direct contact with ice since Buffer M easily precipitates (troubleshooting 1[href=https://www.wicell.org#troubleshooting]).\nNote: As this is the most crucial and time-sensitive step, make sure you have the following reagents prepared and thawed before starting: MG132, CPT, Buffer M (without precipitates). Consider the time needed for transporting the cells from/to the incubator. Stagger the samples to improve consistency.\nNote: Replace MG132 and CPT with an equivalent volume of DMSO for negative control sample.\nAfter counting the K562 cells, transfer the appropriate amount (10 mL of ∼1 × 106 cell/mL per IP) in a 50 mL falcon tube and perform all the treatments/incubations (steps 2–4) in that tube.\nTreat the cells with 10 μM MG132 (Sigma, SML1135) or with an equivalent volume of DMSO for the negative control sample.\nAdd 4 μL of MG132 (50 mM stock) [or DMSO] to the media (20 mL of ∼1 × 106 cell/mL, 2 × 107 cells in total) and resuspend by inverting the tube.",
    "Incubate at 37°C, 5% CO2 for 30 min.\nTreat with 20 μM CPT (Sigma, C9911) [or DMSO for the negative control].\nAdd 40 μL of CPT (10 mM stock) [or DMSO] directly to the media and resuspend by inverting the tube.\nIncubate at 37°C for 5 min.\nPellet the cells and add Buffer M + protein inhibitors cocktail (1× final concentration, Sigma, 04693132001) to the tube.\nSpin down the cells at 300 g for 3 min.\nRemove the supernatant, by pouring out the media and (while the tube is still upside down) quickly blot the excess of the media on a paper tissue. Be careful not to disturb the cell pellet.\nImmediately add 5 mL of Buffer M + protein inhibitors cocktail.\nCarefully mix the sample with a 5 mL serological pipette and split into two 15 mL falcon tubes, aliquoting ∼2.5 mL sample in each. Place the tubes in a rack on top of ice.\nCritical: Do not let the tubes directly touch the ice to avoid precipitation of Buffer M.\nCritical: Although very viscous, try to evenly distribute the suspension in the tubes.\nAlternative if you are working with adherent cells:\nTreat the cells with 10 μM MG132 or with an equivalent volume of DMSO for the negative control sample (Methods video S1[href=https://www.wicell.org#mmc1]):\nTransfer the media from the flask into a 50 mL falcon tube.\nAdd 4 μL of MG132 (50 mM stock) [or DMSO] to the media (20 mL) and resuspend by inverting the tube.\nCarefully add the media back into the flask.\nIncubate at 37°C for 30 min.\nTreat with 20 μM CPT [or DMSO for the negative control] (Methods video S2[href=https://www.wicell.org#mmc2]):",
    "Tilt the flask on the side to collect the media in a corner close to the lid and directly add 40 μL of CPT (10 mM stock) [or DMSO] to that media.\nMove the flask gently to evenly distribute CPT within media.\nIncubate at 37°C for 5 min.\n    Your browser does not support HTML5 video.\n  \n      Methods video S1. MG132 treatment of adherent cells, related to Cell treatment and harvest: step 6\n    \nRemove all the media from the flask and add Buffer M + protein inhibitors cocktail as quick as possible (Methods video S3[href=https://www.wicell.org#mmc3]):\nPour out the media from the flask.\nTilt the flask to collect the leftover media in one corner and remove it with a serological pipette.\nAdd 5 mL Buffer M + protein inhibitors cocktail and make sure that it distributes evenly in the flask.\nScrape the cells and collect the suspension into 15 mL falcon tubes. Place the tubes in a rack on top of ice.\n    Your browser does not support HTML5 video.\n  \n      Methods video S2. CPT treatment of adherent cells, related to Cell treatment and harvest: step 7\n    \nCarefully mix the sample with a 5 mL serological pipette and split into two 15 mL falcon tubes, aliquoting ∼2.5 mL sample in each. Place the tubes in a rack on top of ice.\nCritical: Do not let the tubes directly touch the ice to avoid precipitation. Do not place the cell culture flasks with Buffer M + protein inhibitors cocktail on ice for longer than 30 s, because the buffer will precipitate.\nCritical: Although very viscous, try to evenly distribute the suspension in the tubes.\n    Your browser does not support HTML5 video.\n  \n      Methods video S3. Removal of media and addition of buffer M to adherent cells, related to Cell treatment and harvest: step 8",
    "Pre-sonication with a probe\nTiming: 5 min × (number of samples)\nTo solubilize the samples and facilitate the following precipitation, fragment the DNA. Several short pulses with a Sonopuls HD 2070.2 probe sonicator (Bandelin, 2451) with MS-73 probe (Bandelin, 529) significantly increase the precipitation efficiency.\nAlternatives: You can use other probe sonicators, upon previous optimization.\nCritical: Avoid heating the sample. Do not sonicate for more than 30 s at a time. Include 30 s pause in between sonication cycles for the temperature to cool down. Add more ice to the water if it melts completely.\nSonicate the samples at 20% amplitude in a 1 s ON 1 s OFF mode for 3 × 30 s with a 30 s pause in between each sonication cycle.\nCritical: During the sonication, put the falcon tube in a rack in cold water and add ice around the rack. Avoid having direct contact of ice with the tube, as Buffer M can easily precipitate. If this happens, follow troubleshooting[href=https://www.wicell.org#troubleshooting] Problem 1: Precipitation.\nCritical: Place the tip of the probe about 0.5 cm from the bottom of the tube and avoid foaming of the sample. If foam forms, follow troubleshooting[href=https://www.wicell.org#troubleshooting] Problem 2: Foaming.\nNote: Between the sonication of the different samples, rinse the probe sonicator first with SDS 0.1% in ultrapure water and then with ultrapure water.\nNote: With probe sonicators, 2.5 mL in a 15 mL Falcon allows for optimal sonication. Do not increase the volume of the sample above this threshold. Divide samples with bigger volumes in 2.5 mL aliquots.\nNote: Over time probe tips degrade and the sonication efficiency decreases. If this happens, increase the amplitude of sonication or replace the probe.",
    "After sonicating pulse-spin the tubes in a pre-cooled centrifuge to collect all material and pool both 2.5 mL aliquots in the same tube.\nPrecipitation\nTiming: 1 h\nAdd 0.5 volume of 100% cold Ethanol to precipitate the DNA-covalent adducts.\nPause point: Optionally after precipitation and resuspension in TE-SDS 0.1% you can freeze the samples at −80°C and continue later.\nNote: Always keep the samples on ice or in cooled racks.\nNote: If you freeze the sample, do not store it for longer than 5 days.\nPrecipitate all the samples with 0.5 volumes of 100% cold Ethanol (VWR, 437435L).\nAliquot 1.3 mL of the samples in 2 mL Eppendorf tubes.\nAdd 650 μL of 100% cold Ethanol to each tube.\nMix and incubate at −20°C for at least 10 min.\nSpin the samples at 21,000 g (or maximum speed), 4°C for 10 min.\nRemove the supernatant and wash the pellet three times with 800 μL of cold Wash Buffer.\nRemove the supernatant by pouring it out.\nAdd 800 μL of cold Wash Buffer and vortex the pellet shortly (until it detatches) at high setting to facilitate mixing with the Wash Buffer.\nSpin down the sample at 21,000 g (or maximum speed) and 4°C for 10 min.\nRepeat steps 13a–13c two more times.\nPour out the supernatant and remove as much Wash Buffer as possible. Specifically, after the final wash, decant the supernatant, keep the tube inverted and drain the excess of liquid on a tissue. Finally, delicately aspirate the remaining liquid with a vacuum device (Methods video S4[href=https://www.wicell.org#mmc4]):\nCritical: Be careful not to touch the pellet during aspiration with the vacuum device. Avoid shaking or inverting the tube after decanting.\nDry the pellet for 5 min at 25°C.",
    "Note: Be careful to not over-dry the pellet. Longer drying might impair the resuspension of the pellet.\nNote: When dry, the pellet becomes transparent.\nResuspend each pellet in 500 μL of TE-SDS 0.1% + protein inhibitors cocktail + AEBSF (0.5 mM, Sigma, A8456).\nLeave the aliquots on ice for 5 min (the pellet will start to dissolve) and then mix with a pipette to resuspend the pellet. Pool the aliquots from the same samples together and rotate the sample at 4°C for 30 min or until they become completely resuspended.\nNote: In case of problems with resuspension follow troubleshooting[href=https://www.wicell.org#troubleshooting] Problem 3: Resuspension.\n    Your browser does not support HTML5 video.\n  \n      Methods video S4. Using vacuum source to remove residual Ethanol from the pellet, related to Precipitation: step 14\n    \nSonication with Covaris\nTiming: 10 min × (number of samples)\nFor efficient IP and further library preparation sonicate to achieve an optimal fragment size below 1000 bp. Sonication with Covaris ME220 (Covaris, 500506) has been proven very effective for fragmentation of samples prepared for sequencing.\nAlternatives: Other sonicators with similar properties might work upon optimization.\nNote: While you wait for the samples to sonicate, we advise to start preparing the antibody-beads complexes. In that case, after you start the sonication, follow Immunoprecipitation with anti-TOP1 antibody, part I[href=https://www.wicell.org#sec3.5]:\nNote: Always keep the samples on ice or in cooled racks.\nPause point: Optionally, after sonication you can freeze the samples at −80°C and continue with the IP on the next day or within up to three days. However, if you decide to freeze the sample, we suggest doing it before sonication with Covaris, as the TOP1ccs are more stable.\nSonicate each sample for 5 min with Covaris.\nTransfer 1 mL samples into Covaris milliTUBE 1 mL with AFA Fiber (Covaris, 520130).",
    "Note: Fill up the tube to the very top and remove bubbles. If necessary, add more TE-SDS 0.1% + protein inhibitors cocktail + AEBSF before carefully screwing the cap.\nCritical: It is important to not have any bubbles inside the tube because they can decrease the efficiency of sonication. Check for absence of bubbles by gently inverting the tube.\nSet up the “High Cell” protocol for Covaris ME220 and sonicate the samples for 5 minutes.\ntable:files/protocols_protocol_1868_15.csv\nAfter sonication, transfer 20 μL of each sample into 1.5 mL Eppendorf tube. Use this material to assess the size of the DNA fragments on an agarose gel, follow Assessing fragmentation on an agarose gel[href=https://www.wicell.org#sec3.6]:. Keep the remaining sample on ice or at 4°C in the fridge.\nImmunoprecipitation with anti-TOP1 antibody, part I\nTiming: 4 h\nOptional: Perform this step during the sonication, so that you will have the antibody-beads complexes ready to start the IP once the samples are sonicated and the fragment size is verified.\nNote: Always keep the samples on ice or in cooled racks.\nTransfer 25 μL × (number of samples + 10%) of Protein A/G beads (Thermo Fisher Scientific, 88803) to a 1.5 mL Eppendorf tube.\nNote: Do not transfer more than 150 μL of beads (6 samples) in one 1.5 mL tube because the beads will be later diluted in 200 μL × (number of samples + 10%).\nNote: Mix the stock of beads by inverting at least 20 times and vortexing gently (until visually homogenous) before pipetting.\nNote: Perform all pipetting of Protein A/G beads using filter tips with the tip cut off using sterile/clean scissors to prevent clogging of the tip and avoid shearing forces on the beads.",
    "Note: Preparing 10% extra beads will also limit the possibility of running out of beads in the last aliquot due to pipetting variability. For this reason, the protocol says “number of samples + 10%” in some steps.\nPlace the tube with beads in a magnetic rack, wait until beads are collected and remove the clear supernatant.\nWash the beads with RIPA thrice.\nAdd 800 μL of RIPA.\nResuspend beads by inverting tubes 30 times and vortex 3–4 s at low setting. Pulse spin to eject buffer from the lid (no more than 1000 g for 5 s). Place in the magnetic rack until solution clears and remove the supernatant.\nRepeat steps 22a and 22b two more times.\nAdd 200 μL × (number of samples + 10%) of RIPA buffer to the tubes with beads, resuspend by inverting tube 30 times and vortex 3–4 s at low setting. Pulse spin to eject buffer from the lid (no more than 1000 g for 5 s).\nFor every sample, aliquot 200 μL of beads solution into labeled Eppendorf tubes.\nAdd 2 μg of anti-TOP1 antibody (ab109374) to each tube with beads and incubate them by gentle rotation (20 rpm) at 4°C for at least 3 h.\nNote: If you have prepared material for negative control, instead of the TOP1 antibody, add 2 μg of IgG antibody to the corresponding tubes.\nAssessing fragmentation on an agarose gel\nTiming: 2 h\nOne of the easiest ways to check DNA fragmentation is by agarose gel electrophoresis.\nAlternatives: Other approaches, for examples capillary-based methods such as Agilent Bioanalyzer or TapeStation can be used as well, but they will take longer and are more expensive.\nPrepare 0.6% agarose (Thermo Fisher, 16500500) in Tris-acetate-EDTA (TAE) buffer and cast a gel suitable for your number of samples.",
    "To each 20 μL sample aliquot (from step 19) add 20 μL of TE-SDS 0.5% supplemented with 1 μL of Proteinase K (NEB, P8107S).\nNote: For convenience prepare a master mix with 20 μL of TE-SDS 0.5% × (number of samples + 10%) + 1 μL of Proteinase K × (number of samples + 10%) and add 20 μL of the master mix.\nIncubate in a thermal mixer for 10 min at 60°C and 1500 rpm to release the DNA.\nRemove the tubes from the thermal mixer. Add 4 μL of TE-NaCl (0.5 M) to neutralize the SDS, incubate at 25°C for 1 min.\nAdd 45 μL Phenol:Chloroform:Isoamyl Alcohol (Sigma P2069).\nCritical: Handle Phenol:Chloroform with extra care. Work only within a fume hood. Dispose contaminated tubes in a specialized chemical waste container.\nVortex the samples at the maximum setting for 5 s at 25°C.\nCentrifuge at 6000 g for 5 min at 25°C to separate the phases.\nCarefully collect 40 μL of the aqueous phase in a new Eppendorf tube.\nNote: Start by putting the tip of the pipette perpendicular to the surface of liquid and lean it while collecting the aqueous phase with the pipette tip. At some point the aqueous phase will form a bubble on the side of the tube, which is easier to collect with a pipette. If you accidentally collect the lower organic phase or interface, follow troubleshooting[href=https://www.wicell.org#troubleshooting] Problem 4: Organic phase.\nDilute RNase (Roche, 11119915001) 1:10 in TE, add 2 μL to each sample and incubate for 10 min at 37°C.\nTake 18 μL of each sample and add 2 μL of DNA gel loading buffer 10×.",
    "Note: We recommend using a reduced amount of dye in the DNA gel loading buffer because during the gel run the bromophenol blue can overlap with the fragments of interest, interfering with the visualization under UV light.\nLoad 6 μL of gene ruler mix (1 μL of gene ruler (Thermo Fisher, SM0311), 1 μL of DNA gel loading buffer 10 × and 4 μL of deionized water) into the first well and 15 μL of samples + DNA gel loading buffer into the other wells.\nNote: Scale down the amount of loaded sample if you have lower volume of wells.\nRun the gel at 200 V for 20 min in Bio-Rad Wide Mini-Sub Cell GT System (adjust the time and voltage for other gel chambers accordingly) or until the bromophenol blue reaches about 2/3 of the gel.\nStain the gel with Ethidium Bromide (EtBr) (Sigma, E1510).\nNote: Post-staining is preferable as it results in a clearer image.\nAlternatives: You can also use SYBR™ Green I Nucleic Acid Gel Stain (Thermo Fisher Scientific, S7563) instead of EtBr as a safer and more sensitive alternative for DNA staining.\nTransfer the gel in special EtBr container (work under the fume hood). Pour approximatively 100 mL of TAE + EtBr (1 μg/mL) in the container with the gel.\nNote: Adjust the volume depending on the size/height of the gel to cover the gel completely with TAE + EtBr.\nIncubate for 30 min on a rocking platform.\nCritical: Cover the container with aluminum foil as EtBr is light sensitive and make sure that the rocking is gentle, to avoid spills of EtBr.\nImage the stained DNA in a Bio-Rad Gel Doc EZ Imager and check the fragment size.\nAlternatives: You can use other gel imagers.",
    "Critical: Do not touch anything with the gloves you used to work with EtBr and trash them every time you are not working with EtBr.\nTrash the gel in a specialized EtBr chemical disposal. Rinse with water and 70% Ethanol all the containers contaminated with EtBr.\nThe DNA fragment size should be below 1000 bp (Figure 1[href=https://www.wicell.org#fig1]). If the fragment size is bigger than 1000 bp, follow troubleshooting[href=https://www.wicell.org#troubleshooting] Problem 5: Sonication.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1868-Fig1.jpg\nFigure 1. Example of fragment size distribution after sonication analyzed by gel electrophoresis\nIn samples A and B, most of the fragments are below 1000 bp (highlighted by green). The band highlighted in orange represents digested RNA products. RNA is known to precipitate together with DNA and protein-DNA adducts during steps 12–14 (Kiianitsa and Maizels, 2013[href=https://www.wicell.org#bib15]).\nImmunoprecipitation with anti-TOP1 antibody, part II\nTiming: includes 1 h hands-on time, 10 to 14 h incubation (which we suggest to perform overnight), on the next day 1 h hands-on time and 4 h incubation\nThe immunoprecipitation step is similar to what it is performed in a standard ChIP protocol except that the washing steps are done in solutions with SDS 0.1%, to preserve the TOP1ccs.\nIf you haven’t already prepared the antibody-beads complexes from the section immunoprecipitation with anti-TOP1 antibody, part I[href=https://www.wicell.org#sec3.5]: then follow this section first before continuing.\nPrepare sample for IP.\nSpin the sonicated sample for 10 min, max speed at 4°C and transfer the supernatant to a fresh 1.5 mL tube.\nFill up all samples to 1040 μL with TE-SDS 0.1% + protein inhibitors cocktail + AEBSF.\nTransfer 40 μL of sonicated sample to a new tube and add 2 μL SDS 10%. This will be used as Input (4%) to generate a standard curve for the qPCR.",
    "Take the rest (1000 μL) of sonicated sample and add 250 μL of RIPA 5× to equilibrate to RIPA buffer. Store on ice until addition to the beads.\nWash the antibody-beads complexes (from step 25) with 800 μL of cold phosphate buffered saline (PBS).\nPulse spin tube and place it onto a magnetic rack. Once the solution clears remove supernatant with unbound antibody and add 800 μL of cold PBS.\nWash the beads by inverting the tube 30 times and vortex 3–4 s at low setting. Pulse spin to eject buffer from the lid.\nPlace tube onto the magnetic rack, wait until the solution clears and beads are collected on the side of the tube and remove supernatant.\nNote: The PBS wash is very important to increase the efficiency of the IP by removing the unbound antibody.\nCritical: Make sure to have the samples prepared and ready before you remove the PBS to avoid drying of the beads.\nAdd the samples (already diluted in RIPA in step 41d) to the antibody-beads complexes.\nIncubate for 10–14 h at 4°C.\nPause point: We suggest performing the incubation overnight. Do not incubate longer than 16 h.\nWash the immunocomplexes.\nNote: This step strongly affects the yield and ratio    (   M G 132 + C P T   u n t r e a t e d   )    of the IP. Make sure to treat all the samples consistently and to work on ice, avoiding warming up the samples.\nPlace the tube onto the magnetic rack, remove supernatant and wash the beads with 800 μL of cold RIPA. Resuspend the beads by inverting the tube 30 times and vortex 3–4 s at low setting. Pulse spin to eject buffer from the lid. Put the tubes on the magnetic rack and discard the supernatant.",
    "Repeat step 45a but with RIPA300.\nRepeat step 45a but with LiCl-SDS 0.1%.\nRepeat step 45a but with TE-SDS 0.1%.\nPlace the tubes on the magnetic rack and remove as much buffer as possible without disturbing the beads. Add 100 μL of TE-SDS 0.5% buffer + 2 μL Proteinase K to the beads. Add 60 μL of TE-SDS 0.5% buffer + 2 μL Proteinase K to the input samples.\nNote: For convenience prepare a master mix with 100 μL (60 μL for input) of TE-SDS 0.5% × (number of samples +10%) + 2 μL of Proteinase K × (number of samples +10%) and add 100 μL (60 μL for input) of the master mix.\nIncubate the beads and inputs in a thermal mixer at 60°C and 1500 rpm for at least 4 h.\nDNA purification and quantification\nTiming: 3 h\nPerform DNA purification with PCR purification kits and quantify DNA concentration with Qubit Fluorometer (Invitrogen, Q33216). Before going forward with library preparation, it is important to ensure a sufficient DNA yield. Based on our experience, we suggest at least 1–10 ng of DNA for every sample, and a ratio    (   M G 132 + C P T   u n t r e a t e d   )    above 7 based on qPCR results (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1868-Fig2.jpg\nFigure 2. TOP1ccs enrichment determined by TOP1 CAD-qPCR in HCT116 cells represented as percentage of input (n=2, error bars denote standard deviation, SD)\nPrimers amplify a region in the MYC promoter. The signal from IP with IgG is on average 0.001%.\nPause point: Purified DNA is very stable and can be kept at −20°C for long term storage.\nNote: DNA purification can be also performed by Phenol: Chloroform and Ethanol precipitation. This will add one extra day to the protocol.",
    "Purify the samples with a MiniElute PCR purification kit (QIAGEN, 28006) (link[href=https://www.qiagen.com/us/resources/download.aspx?id=521feb84-9cfa-45ea-9a8f-54c2999aa9a9&lang=en]).\nAdd 500 μL of PB buffer to each 100 μL sample (directly on the beads) and input, mix well and pulse spin to eject buffer from the lid.\nPlace on a magnetic rack, let the beads collect on the side of the tube and once the solution clears transfer 600 μL mixture of buffer and sample to the QIAquick column placed in a 2 mL collection tube.\nNote: Due to the viscosity of the buffer, the collection of beads to the side of the tube will take longer than in previous steps.\nApply the sample to the column and centrifuge at 17,900 g for 60 s.\nDiscard the flow-through and place the column back in the tube.\nAdd 750 μL of PE buffer to the tube and wash the column by spinning at 17,900 g for 60 s.\nRemove the flow-through and centrifuge once more to remove any residual PE.\nPlace the column in a 1.5 mL Eppendorf tube to collect the purified sample.\nNote: Cut off the cap from the tube before placing a column in it. If not removing the cap, make sure to transfer the eluted sample in a fresh tube to avoid contamination by the dirty lid.\nAdd 10 μL of EB buffer to the center of the column membrane and let the membrane soak for 5 min at 25°C.\nCentrifuge the sample through a column at 17,900 g for 60 s to collect the purified sample at the bottom of the tube.\nRepeat steps 48h–i once in the same tube, to recover eventual traces of DNA from the column membrane.\nTransfer each purified sample to a new 1.5 mL Eppendorf or a PCR tube.",
    "Quantify the DNA concentration with Qubit® dsDNA HS Assay Kit (Thermo Fisher Scientific, Q33230) (link[href=https://assets.thermofisher.com/TFS-Assets/LSG/manuals/MAN0017455_Qubit_1X_dsDNA_HS_Assay_Kit_UG.pdf]). If the yield is too low (<1 ng) see troubleshooting[href=https://www.wicell.org#troubleshooting] problem 6: Low yield.\nNote: Quantification with Qubit is recommended as this step is important to calculate the volume needed for library preparation.\nRun a qPCR using primers for the MYC promoter and calculate the ratio    (   M G 132 + C P T   u n t r e a t e d   )    (Figure 2[href=https://www.wicell.org#fig2]). If the ratio is low, see troubleshooting[href=https://www.wicell.org#troubleshooting] Problem 7: Low ratio    (   MG 132 + CPT  untreated  )   .\nNote: MYC promoter is defined as the region within 300 bp upstream of the TSS.\nNote: Elevated levels of TOP1ccs are known to engage with DNA upstream TSSs of highly expressed genes (Baranello et al., 2016[href=https://www.wicell.org#bib3]; Kouzine et al., 2013a[href=https://www.wicell.org#bib16]). Therefore, the MYC promoter was chosen as a positive control.\nNote: The MYC promoter should work as a positive control in all cell lines where MYC is highly expressed.\nNote: When designing additional primers for qPCR before library preparation, we advise to select regions upstream the TSSs of highly expressed genes.\nNote: The qPCR will work with conventional primers. In the first qPCR cycle the strand complementary to the TOP1cc (with free ends) will anneal with the primer and will be subjected to polymerase synthesis.\ntable:files/protocols_protocol_1868_16.csv\ntable:files/protocols_protocol_1868_17.csv\ntable:files/protocols_protocol_1868_18.csv\nLibrary preparation and sequencing\nTiming: 3 h\nWe provide an example of one of the library preparation strategies, ThruPLEX DNA-seq kit, which we have used with this protocol. You can skip this section if you choose another library preparation kit. However, please read the information below marked CRITICAL.",
    "Critical: During the catalytic cycle TOP1 cleaves the phosphodiester backbone of the DNA and forms a covalent link between its tyrosyl residue and the 3′ end of the DNA molecule. This covalent link can block adapter ligation during library preparation. Thus, it is required a suitable kit for library preparation. In case of ThruPLEX DNA-seq protocol, stem-loop adapters are ligated to the 5′ end of DNA. Even with 3′ end blocked by a covalently bound tyrosyl residue, the library preparation will work for the complementary strand (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1868-Fig3.jpg\nFigure 3. ThruPLEX library preparation works with TOP1 tyrosyl residue bound to the 3′ of a DNA molecule\nNote: If you aim to detect TOP2ccs, after IP with anti-TOP2 antibody and DNA purification, an additional step of Exonuclease VII (NEB, M0379S) treatment and purification is required for removing the covalently bound tyrosyl residue which can block both 5′ ends of DNA and completely prevent adapter ligation and amplification during library preparation (Das et al., 2022[href=https://www.wicell.org#bib5]).\nBased on the Qubit DNA quantifications (step 49) take equal DNA amounts of each sample and transfer to 200 μL PCR tubes. The volume should not exceed 10 μL and the optimal DNA amount is 1–10 ng. Fill up all the samples to 10 μL with EB (10 mM Tris-Cl, pH 8.5).\nProceed with library preparation following ThruPLEX DNA-seq kit (Takara, R400676) protocol (link[href=https://www.takarabio.com/documents/User%20Manual/ThruPLEX%20DNA/ThruPLEX%20DNA-Seq%20Kit%20User%20Manual_112219.pdf]).\nNote: One TOP1cc IP with 1×107 cells usually requires 10–12 cycles of PCR amplification during library preparation.\nAnalyze the samples via capillary electrophoresis using a Bioanalyzer (Agilent, G2939BA) with the Agilent High Sensitivity DNA Kit (Agilent, 5067-4626) and check the fragment size distribution. If there is no visible DNA population, follow troubleshooting[href=https://www.wicell.org#troubleshooting] Problem 8: DNA amplification.\nPerform library size selection using AMPure XP beads (Beckman, A63880).",
    "Note: Before starting, keep the beads at 25°C for at least 30 min and mix them well before pipetting.\nAdd EB buffer to the library to obtain a final volume of 100 μL.\nAdd 65 μL of AMPure XP beads to each sample.\nNote: Perform all pipetting of AMPure XP beads using filter tips with the tip cut off using sterile/clean scissors to prevent clogging of the tip and applying shearing forces on the beads.\nMix carefully by pipetting up and down at least 10 times.\nNote: As the beads are viscous, pipette the entire volume slowly and do not vortex. Vortexing can generate bubbles and affect downstream handling.\nIncubate at 25°C for 8 min.\nPlace the tube on the magnetic rack for at least 10 min or until the solution clears completely.\nCollect the supernatant (fragments < 700 bp) and transfer into a fresh tube prefilled with 40 μL of beads.\nMix carefully by pipetting up and down at least 10 times.\nIncubate at 25°C for 8 min.\nPlace the tube on the magnetic rack for at least 10 min or until the solution clears completely.\nRemove the supernatant containing small DNA fragments including primers and primer dimers.\nAdd 200 μL of freshly prepared 80% Ethanol to the remaining beads, wait 30 s and remove the Ethanol.\nRepeat step 54k once.\nSpin briefly and remove any remaining drops of Ethanol.\nLet the pellet dry for 12 min or until tiny cracks become visible in the beads.\nRemove from the magnetic rack and resuspend the beads in 20 μL of EB by mixing carefully with a pipette until the solution becomes homogenous without beads clumps.\nPlace the tube on a magnetic rack for at least 5 min or until the solution clears.",
    "Transfer the supernatant containing the library to a new tube avoiding beads carry over. This process should have selected for library fragments between 200–700 bp (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1868-Fig4.jpg\nFigure 4. Bioanalyzer electropherogram (left) and gel (right) after library size selection\n96% of the DNA is in the range 200–700 bp (blue lines).\nNote: With some magnetic racks it is extremely difficult to avoid beads carryover, therefore reduce the volume of transferred supernatant and leave some supernatant with beads in the tube or pass through the magnetic rack 1-2 more times (step 54p-q) if the beads are still in the solution.\nCheck the efficiency of size selection via capillary electrophoresis using a Bioanalyzer and Agilent High Sensitivity DNA Kit (link[href=https://www.agilent.com/cs/library/usermanuals/Public/G2938-90321_SensitivityDNA_KG_EN.pdf]).\nNote: If primers/dimers or longer fragments were not properly filtered, follow troubleshooting[href=https://www.wicell.org#troubleshooting] Problem 9: Primers/dimers.\nQuantify final libraries using the Qubit dsDNA HS kit (link[href=https://www.agilent.com/cs/library/usermanuals/Public/G2938-90321_SensitivityDNA_KG_EN.pdf]).\nMake an equimolar pool of libraries based on the fragment size and DNA concentrations from Bioanalyzer and Qubit respectively. The optimal molarity of the final library pool for NextSeq550 (Illumina, SY-415-1002) is 4 nM.\nNote: Here we describe how to perform sequencing using NextSeq550. If you are sequencing with another machine, follow the manufacturer’s manual.\nNote: The final diluted libraries have low molarity, we advise to prepare the library pool right before sequencing and avoid storage for long periods. The library pool can be stored for a day at −20°C.\nTake an aliquot of library pool for sequencing with NextSeq550.\nFollow NextSeq550 Denature and Dilute Libraries Guide from Illumina (link[href=https://support.illumina.com/content/dam/illumina-support/documents/documentation/system_documentation/nextseq/nextseq-denature-dilute-libraries-guide-15048776-09.pdf]).\nAt the end of a sequencing run, download BCL or fastq files for further processing."
  ],
  "subjectAreas": [
    "Bioinformatics",
    "Antibody",
    "Cancer",
    "Chipseq",
    "Molecular Biology",
    "Sequencing"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioinformatics & Computational Biology"
  ]
}