{
  "id": 17606,
  "origin_website": "Jove",
  "title": "Multi-system Monitoring for Identification of Seizures, Arrhythmias and Apnea in Conscious Restrained Rabbits",
  "procedures": [
    "All experiments were carried out in accordance with the National Institutes of Health (NIH) guidelines and Upstate Medical University Institutional Animal Care and Use Committee (IACUC). In addition, an outline of this protocol is provided in Figure 1.\n1. Preparing recording equipment\nConnect the computer to an amplifier with a 64-pin headbox.\n\tNOTE: Each animal has four straight subdermal scalp pin electrodes (7 or 13 mm) for EEGs from the 4 quadrants of the head, 3 bent subdermal chest pin electrodes (13 mm, 35˚ angle) for ECG (Einthoven’s triangle), 1 bent subdermal pin ground electrode on the right leg, and 1 straight subdermal scalp pin electrode on the center of the head serves as the reference.\nTo make every 8th pin on the headbox a reference, update the acquisition software settings, acquisition tab, so the Reference Electrode is “Independent” (i.e., research mode).\n\tNOTE: This enables recordings from up to 7 animals simultaneously, each with 7 electrodes plus a dedicated reference electrode and a ground electrode, all through one amplifier, digitizer, and computer. All electrodes are acquired as unipolar channels and compared to the reference (center of the head.) Additional bipolar and augmented lead configurations/montages can be setup during or after the recording. As the setup has the capability to record from multiple animals simultaneously, a ground electrode from each animal is connected in parallel to the ground input on the amplifier (Figure 2).",
    "Remove rabbits from their cage and weigh them to calculate the appropriate drug dose for each animal. Place the rabbits in a transport carrier and bring them to a separate room in order to minimize stress to non-experimental animals. In this study, male and female New Zealand White rabbits, and their subsequent offspring were used. Experiments were performed on rabbits > 1 month of age. At the time of the experiment, these rabbits weighed between 0.47 – 5.00 kg.\n\tNOTE: Since the rabbits need to be in the same room and in view of the camera, do not completely isolate the rabbits. There is the potential for visual and auditory manifestations from one rabbit stressing another rabbit. Therefore, it is ideal to have one rabbit in the room at a time, which is done for the photic stimulation experiments. For all other experiments, the rabbits are spaced out as much as possible, while keeping all of them within the view of the video camera. Ideally, barriers are used or only one animal is studied at a time. This was not a major confounder as the rabbits’ heart rates remained fairly stable during the experiments and there was the frequent presence of sleep spindles. Recordings from multiple animals simultaneously assures that both control and test animal data are acquired under the same environmental conditions.\n2. Implanting EEG-ECG electrodes and attaching respiratory monitors\nRemove one rabbit from the transport carrier and place in the lap of a seated investigator.\nHold the rabbit vertically and keep it close to the investigator’s body.\nLower the rabbit into a supine position, with the rabbit’s head at the investigator’s knees, and the rabbit’s head lower than the rest of its body.",
    "NOTE: This maneuver relaxes the animal and minimizes the likelihood of it trying to move or escape while placing the electrodes.\nNow that the rabbit is secured in a supine position, ask a second investigator to spread the fur until the skin can be identified and isolated from the underlying tissue.\nInsert 35˚ bent electrodes subdermally in each axilla (Figure 3A).\n\tNOTE: The electrodes should be pushed through so that they are securely hooked into the skin, but do not penetrate deeper structures. Having the electrode enter and then exit out of the skin (through-and-through) reduces the chance of the leads becoming dislodged when placing the rabbit in the restrainer or if it moves during the experiment (Figure 3B). All electrodes are sterilizaed with 70% ethanol prior to placement.\nPlace leads on the chest posterior to the right and left forelimbs and on the abdomen anterior to the left hind limb. Place a ground pin-electrode anterior to the right hind limb on the abdomen (Figure 4A).\nOnce all of the ECG leads are properly placed, return the rabbit to a prone position, with the leads running up one side of the rabbit abdomen, and transfer the rabbit into an appropriately sized restrainer (e.g., 6\" x 18\" x 6\").  When placing the rabbit in the restrainer, pull the loose wire upward to minimize the rabbit from pulling out the electrodes with its legs. Tape the wires to the side of the restrainer so that they do not get caught under the rabbit during the experiment (Figure 4B).\nSecure the rabbit in the restrainer by lowering the restraint around the neck and locking it into place. Additionally, move the hind limbs up underneath the animal and secure the rear restraint.",
    "​NOTE: One should be able to fit 1-2 fingers within the space under the neck to assure it is not too tight. Particularly during experiments where there may be motor movement, it is important to tighten down the restraint to minimize movement, potential spinal injuries, limb dislocation, and the ability to kick out the rear restraint (Figure 4B). Rabbits have been maintained in the restrainer for ~5 h without any issues related to increased movement or signs of dehydration.\n\t\nFor small rabbits (e.g., less than 2 months) place a rubber booster pad under the animal to raise the rabbit up, which prevents the rabbit from resting its neck on the bottom of the head restraint (Figure 4C).\n\t\tNOTE: A sudden drop in respiratory and heart rate may be secondary to neck impingement. If this occurs, loosen the neck restrainer and lift the rabbit’s head to relieve any neck compression.\nWhen the rear restraint does not closely trace the back/spine of the rabbit, place a PVC spacer to prevent any movement that could cause spinal injuries.\n\t\tNOTE: For example, ~14 cm long x 4” inner diameter PVC pipe, with the lower 25-33% removed can be placed over the rabbit with foam to provide appropriate restraint (Figure 4C).\nNow that the rabbit is securely placed into the restrainer, insert the 7-13 mm subdermal straight pin-electrodes into the scalp (Figure 3A). Using a 45˚ angle approach of entry, run the wires up between the ears, and loosely tether the wires to the restrainer behind the head to maintain lead placement. Place 5 EEG leads in the following positions: right anterior, left anterior, right occipital, left occipital and a central reference (Cz) lead at the point between the other 4 leads (Figure 4D).",
    "NOTE: Electrodes are properly placed when they are positioned into subcutaneous tissue against the skull. This placement minimizes artifact from the nose, ears, and other surrounding muscles. Some artifact from rhythmic nose movement is unavoidable. The anterior EEG leads should be placed medial to the rabbit’s eyes and point anteriorly. The occipital leads should be placed anterior to the ears and will point in the medial direction. Cz is placed in the center of the top of the head at a point that is between all 4 electrodes (half-way between Lambda and Bregma, along the suture line). The pin of the Cz electrode points anteriorly.\n\t\nPass the EEG wires up between the ears, to avoid the rabbit trying to bite the wires.\nAttach the pulse oximeter plethysmograph to the rabbit’s ear over the marginal ear vein.\n\tNOTE: It may be necessary to shave excess hair from the ear to improve signal or use some gauze to keep the sensor in place.\n\t\nEnsure that the heart rate on the plethysmography correlates with the heart rate from the ECG and that the oxygen saturation is displayed (Figure 5C).\nGently place the facemask with capnography tubing over the rabbit’s mouth and nose (Figure 4H). Secure the facemask with string wrapped around the mask and attach both ends of the string to the restrainer. Attach the other end of the capnography tubing to the vital signs monitor.",
    "NOTE: It is important to prevent the string from laying over the rabbit’s eyes during the experiment. To do this, tape the string to the middle of the restrainer between the rabbit’s ears. In order to improve the capnography signal, create a one-way valve using tape and a thin piece of nitrile that will allow oxygen to enter the T-piece, and will direct exhaled CO2 into the capnography tubing (Figure 4I).\n3. Recording of video-EEG-ECG\nPerform video-EEG-ECG recording using a commercially available EEG software.\n\tNOTE: The biopotential leads and video are time locked to later correlate the electrical and video signals (e.g., EEG spike with a myoclonic jerk).\nConfirm optimal connectivity, with no baseline drift, no 60 Hz electrical noise, and high signal-to-noise ratio. Specifically, ensure that each phase of the cardiac waveform can be visualized on the ECG and that the delta, theta, and alpha waves are not visually obscured by high frequency noise on the EEG.\n\t\nIf all of the electrodes are producing excessive amounts of noise, then adjust the central reference lead. If only one electrode is excessively noisy, then push that electrode deeper into the skin or reposition it until there is no metal exposed.\nAdjust the video so that all rabbits can be seen simultaneously, which allows for the correlation of motor activity with EEG findings (Figure 5A).\n\tNOTE: The system accommodates simultaneous EEG/ECG/oximetry/capnography recordings from up to 7 rabbits.",
    "Start the baseline recording from each animal for a minimum of 10-20 min or until the heart rate stabilizes to a calm relaxed state (200-250 bpm) and the rabbits do not exhibit large movements for at least 5 min. Acquire full bandwidth electrographic data without any filters. In order to better visualize data set the low frequency filter (=high pass filter) at 1 Hz and the high frequency filter (=low pass filter) at 59 Hz.\n\tNOTE: Another sign that the rabbit is relaxed is the onset of EEG sleep spindles (discussed later).\nAdd time-locked notes during the experiment in real-time to indicate the timing of interventions (e.g., drug delivery) and neuro-cardiac events (e.g., EEG spike, motor seizures, ectopic beat, and arrhythmias), and motor/investigator artifacts.\n\tNOTE: Due to the frequency that the investigator needs to apply an intervention (e.g., photic-stimulation, drug delivery), to minimize the stress of an investigator entering and exiting the room and opening/closing the door, the investigator remains on the opposite side of the room throughout the experiment. The investigator sits as far from the animal as possible, and remains still and quiet to minimize potentially disturbing the animals.\n4. Experimental protocols\nNOTE: Each of the following experiments are performed on separate days if they are performed on the same animal. There is a 2-week delay between the oral tests compound drug studies, and the acute terminal pro-convulsant drug study. When necessary, the photic-stimulation experiment is performed, followed by a 30 min wait, and then the PTZ drug study.\nTo enable the rabbits to acclimate in the restrainers and for the investigator to objectively confirm stabilization of cardiorespiratory rates, instrument all rabbits with the cardiorespiratory and neuronal sensors and perform continuous video monitoring for > 1 hour, 1 - 3 times per animal. \nPhotic stimulation experiment",
    "In addition to the method described above, place a light source with a circular reflector 30 cm in front of the rabbit at eye level, with the flash intensity set to the maximum (16 candela)29. The light source is indicated by a white dot in Figure 4E.\n\t\t​NOTE: A dimly lit room should be used to elicit the photosensitive response37.\n As the rabbit’s eyes are on the side of the head instead of the front of its head (as in humans), place 2 mirrors on either side of the rabbit, and 1 behind the rabbit so that the light enters the rabbit’s eyes.\n\t\tNOTE: A flat mirror that is ≥ 20 cm tall, by ≥ 120 cm long creates a triangular enclosure around the rabbit to ensure that the flashing light enters the rabbit’s eyes, as seen in Figure 4E.\nConnect the light source to a controller that has an adjustable rate, intensity, and duration.\nRecord video using a camera with a red light and infrared recording capabilities.\nExpose the rabbits to each frequency for 30 s with their eyes open and then another 30 s with a surgical mask covering their face to simulate or cause eye closure at each frequency.",
    "NOTE: Previous studies have shown that eye closure is the most provocative maneuver for eliciting photosensitivity to seizure29. In addition, 10% of photosensitive patients only exhibit electroencephalographic signs while their eyes are closed29. A seizure can be identified clinically by observing the presence of head and whole-body myoclonic jerks, clonus, or a tonic state. The EEG recording is more thoroughly analyzed for electroencephalographic correlation (e.g., spikes, poly-spikes, and rhythmic discharges) with motor manifestations for a definitive diagnosis of seizure activity. Movements in which the EEG is obscured by muscle artifact or waves of indeterminant epileptogenicity should be reviewed by an epileptologist for confirmation.\n Increase the photic stimulator frequency from 1 Hz to 25 Hz in 2 Hz increments. Then perform the same photo-stimulation protocol, but this time decrease the frequency from 60 Hz to 25 Hz in 5 Hz increments.\n\t\tNOTE: If a rabbit has a seizure, the experiment should be stopped. Continue to monitor the rabbit for 30 min. Then return the rabbit to the housing room and monitor every 1 h for 3 h for full recovery. However, if the photic stimulation induces a photoparoxysmal response, then the remainder of ascending frequencies are skipped and the series is started again by descending from 60 Hz until another photoparoxysmal response occurs. This will allow for the determination of the upper and lower photic stimulation thresholds. No delay is necessary as the photoparoxysmal response will cease after the photic stimulation is discontinued. If it is unclear whether a photoparoxysmal response has occurred, the frequency is repeated after a 10 s delay38.\n After the experiment is completed, remove EEG and ECG leads from the rabbit and return it to its home cage for routine care by husbandry staff.\nOral administration of medications",
    "As many drugs are taken orally, prepare oral compounds by mixing with food-grade apple sauce. Mix 0.3 mg/kg of E-4031 in 3 mL of apple sauce and load into a 3 mL oral/irrigation syringe without a needle.\n\t\tNOTE: Several medications can be administered in this fashion including, test compounds, drugs that are known to alter the QT duration (moxifloxacin or E-4031), and a negative control or vehicle. Some drugs are not available in an intravenous formulation. In addition, many medications are prescribed in an oral formulation and therefore an intravenous administration may have less clinical relevance.\nLift the upper lips and slide the tip of the oral syringe into the side of the rabbit’s mouth, which is unobstructed by the rabbit’s teeth, and inject all of the medication and apple sauce into the rabbit’s mouth.\nContinue the video-EEG-ECG recording for 2 h and then return the animal to its home cage for routine care.\nOn the experimental day 2 and 3, connect the rabbit to the video-EEG-ECG, record 10-20 min of baseline, then inject the same medication and record for 2 h.\nAfter 1 week of washout, perform 10-20 min of baseline, and then give each rabbit a single dose of placebo for 3 consecutive days and record for 2 h.\n\t\tNOTE: Administration of oral medications may be designed as a crossover study, in which the placebo is given during week 1 and the medication in week 2.\nIntravenous medication experiment (Pentylenetetrazol, PTZ)\n\t\nIn order to visualize the marginal ear vein, shave the posterior surface of the rabbit’s ear. Use a 70% ethanol wipe to disinfect the site and dilate the marginal ear vein. This is indicated by the black dashed oval in Figure 4F.",
    "At this point, have one experimenter cover the rabbit’s face with their hand in order to decrease the stress of the procedure to the rabbit. A second experimenter carefully cannulates the marginal ear vein with a  sterile 25-G angiocatheter.\nOnce the catheter is in the vein, place a sterile injection plug at the end of the catheter so that a needle can introduce medication intravenously. The location of the injection plug is indicated by a blue circle in Figure 4G.\nMake a splint by wrapping 4 x 4 inch gauze with tape so that it forms a tube shape and placing it inside the rabbit’s ear. Then tape the splint to the ear so that the catheter is secured in place and remains upright, similar to the non-catheterized ear.\nInject 1 mL of 10 USP units per mL of heparinized saline.\n\t\tNOTE: The catheter and vessel should be visibly cleared of air and remain patent. If the catheter is not in the vessel, the syringe will not push easily and there will be accumulation of saline in the subcutaneous tissue.\nGive rabbits incremental doses of PTZ intravenously from 1 mg/kg to 10 mg/kg in 1 mg/kg increments every 10 min. Make a note at the start of each dose to indicate which animal is being injected and the concentration of the medication.\n\t\tNOTE: This enables assessments of the acute and additive effects of PTZ administration. Alternatively, to further assess the chronic effects of low dose PTZ, the rabbit is given repeated doses at each low dose concentration, 7 doses at 2 mg/kg, 3 doses at 5 mg/kg, then 3 doses at 10 mg/kg, each dose is separated by 10 min.",
    "After each dose, carefully monitor the video-EEG-ECG-capnography-oximetry for any neuro-cardiac electrical and respiratory abnormalities and visual evidence of epileptiform activity. Note these changes in real-time and during post-analysis.\n\t\tNOTE: Seizure activity often begins within 60 s of PTZ administration.\n5.Conclusion of Non-Survival Experiments.\nIf the rabbit did not experience sudden death during the course of the PTZ experiment, administer 1mL of 390 mg/mL of sodium pentobarbital for every 4.54 kg of body weight (or 1.5 mL to all rabbits), followed by a 1 mL flush of normal saline. Monitor the ECG to ensure that the rabbit undergoes cardiac arrest.\nOnce the rabbit experiences cardiac arrest, quickly perform a necropsy to freshly isolate various organs, including the heart, lungs, liver, brain, skeletal muscle, and any other tissue necessary for subsequent molecular/biochemical analyses.\n Dispose of the rabbit according to institutional policies.\n6. Analysis of ECG\nUse commercially available ECG analysis software to visually inspect the ECG, and to identify periods of tachycardia, bradycardia, ectopic beats and other arrhythmias (Figure 6). To reduce the amount of data to review, create a tachogram, which will increase the ease with which periods of tachycardia, bradycardia, or irregularities of the RR interval can be identified. \n\tNOTE: ECG abnormalities (e.g., QTc prolongation) and arrhythmias are manually identified by reviewing the ECG for abnormalities in the rate (e.g., brady-/tachy-arrhythmias), rhythm (e.g., premature atrial/ventricular complexes), conduction (e.g., atrio-ventricular block), and waveform (e.g., non-sinus atrial/ventricular tachycardia and fibrillation.) Arrhythmias can be detected by reviewing the tachogram for irregularities in the RR interval. Tachycardia can be identified by sections of the tachogram in which the heart rate is above 300 beats per minute. Bradycardia is identified when the heart rate is less than 120 beats per minute on the tachogram.",
    "Using commercially available ECG analysis software, perform standard ECG measurements (heart rate, cardiac cycle intervals) at baseline and upon provocation (e.g., investigator manipulating the animal, administration of test agents, and seizure induced ECG changes).\n7. Analysis of video-EEG\nVisually scroll through the video and EEG tracing using commercially available software to identify the baseline signal (Figure 7) and the presence of expected EEG discharges such as sleep spindles (Figure 8) and vertex waves (Figure 9).\n\tNOTE: Although full bandwidth electrographic data is acquired without any filters, data should be displayed with the low frequency filter (i.e., high pass filter) set at 1 Hz, and based on Nyquist’s theorem, the high frequency filter (i.e., low pass filter) is set at 120 Hz to avoid missing any signal. The filters can be adjusted to allow for better visualization and noise reduction (e.g., 1-59 Hz) when reviewing lower frequency (<25 Hz) EEG activity.\nIn addition to capnography waveforms, use nose movement artifact on the EEG to determine the presence versus absence of breathing. This can also be correlated with nose movements seen on the video recording.\nVisually scroll through the video and EEG tracing using commercially available software to distinguish epileptic vs. non-epileptic (e.g., conscious) movements for at least 1 min after each dose of PTZ (Figure 10). Scan for interictal epileptic discharges and for EEG changes before, during, and after seizures. A seizure can be identified clinically by observing the presence of head and whole-body myoclonic jerks, clonus, or a tonic state with an EEG correlate. The EEG changes may include EEG spikes, poly-spikes, and rhythmic discharges.",
    "NOTE: Movements in which the EEG is obscured by muscle artifact or waves of indeterminant epileptogenicity should be reviewed by a neurologist for confirmation. It may be advantageous to focus the video on one rabbit to view its behavior, as well as its EEG and ECG recordings, more closely (Figure 5B).\nScore the video-EEG for seizures based on the type and severity of motor manifestations, which typically occur within 1 min after PTZ injection (Table 1).\nAfter a photic stimulation experiment, analyze the occipital leads of the EEG for the presence and absence of the occipital driving rhythm by creating a spectral analysis plot in commercially available EEG analysis software. The occipital driving rhythm will create a peak in the spectral analysis that corresponds to the frequency of the photic stimulator (Figure 11).\n\tNOTE: Photic stimulation may produce harmonic frequency peaks in addition to the peak of the fundamental frequency.\n7. Analysis of respiratory function\nReview the output from the vital signs monitor (Figure 4I) and export the signal for further analysis.\nNote the change in respiratory pattern during a seizure and after a seizure, especially the timepoint when apnea begins.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}