{
  "id": 11296,
  "origin_website": "Jove",
  "title": "Fabrication of Electrochemical-DNA Biosensors for the Reagentless Detection of Nucleic Acids, Proteins and Small Molecules",
  "procedures": [
    "1. Setting the Stage \nPurchase the relevant, chemically modified probe DNA from a custom oligonucleotide synthesis company such as Biosearch Technologies (Novato, CA) or Midland Certified (Midland, TX). The probe is modified during synthesis by the addition of a C6 thiol at its 3’-end and a redox-active methylene blue at its 5’-end.\nDissolve the probe DNA in phosphate buffered saline pH 7.4 to a concentration of 200 μM and verify its concentration by measuring its absorbance at 260 nm using a spectrophotometer. Due to the methylene blue moiety on the DNA probe the solution should have a visible blue tint. \nFreshly prepare 1 mL of a 10 mM solution of tris(2-carboxyethyl)phosphine TCEP in distilled, deionized water (DI-water). In our experience, these TCEP solutions remain fresh for one week when stored in the dark at 4°C.\nTo reduce any disulfide bonds that might be present in the probe DNA solution, combine 1 μL of the probe DNA stock solution with 2 μL of the TCEP solution and mix gently with a pipette. Incubate the mixture for one hour in a dark, refrigerated container. The initially blue solution should become clear as the TCEP reversibly reduces the methylene blue. If the solution does not become clear, repeat the procedure using a fresh TCEP solution or, possibly, at room temperature.\nAfter one hour dilute the reduced DNA probe solution with 1 mL of buffer; this will dilute it to a concentration of 200nM. Later on, you will incubate a set of gold disk electrodes in 200 μL portions of this diluted probe solution.\nFreshly prepare at least 2 mL of 2mM mercaptohexanol in phosphate buffered saline.\n2. Sensor Preparation",
    "Combine 0.05 micron alumina powder with water on a fine polishing cloth. Polish a set of gold disk electrodes (CH Instruments, Austin, TX) by pressing the gold surface firmly into the wet cloth, and moving them in a figure eight pattern for approximately three minutes per electrode.\nRinse the polished electrodes with DI-water and immerse them into Eppendorf tubes filled with the same. Sonicate for five minutes to remove any residual alumina powder.\nPlace the electrodes into a 0.5 M sulfuric acid solution, attach them to a potentiostat along with a platinum counter and silver/silver chloride reference electrode, and run a series of voltammograms to oxidize, reduce, and electrochemically clean their surfaces. Following this perform a second electrochemical cleaning in a solution of 0.01 M KCl in 0.1 M sulfuric acid. The fine details of these cleaning procedures can be found in our Nature Protocols paper1, and in the supplement to this video.\nArrange a set of 2 mL Eppendorf tubes in a rack and fill each with 200 μL of the probe DNA solution. The concentration of the probe DNA in this solution will define the density with which the probe DNAs pack on the sensor surface.  Sensor performance is strongly dependent on probe density, with the optimal density varying from one sensor architecture to the next.  The probe concentration used at this step should thus be optimized for each new type of sensor2.  For the probe architectures we have investigated to date, the probe DNA concentrations we employ in this step range from 15 nM to 2 μm, with 200 nM being a typical value.",
    "Rinse the gold disk electrodes with DI-water, and then immerse them in the relevant probe DNA solution in an Eppendorf tube for one hour. At this point, the probe DNA will attach to the gold electrode surface via the formation of a thiol-on-gold self assembled monolayer.\nRinse the electrodes with DI-water, immerse them in 2mM mercaptohexanol in an Eppendorf tube and store them in a dark place  for 3 hours to overnight at room temperature to ensure complete formation of the self assembled monolayer. This step incorporates the mercaptohexanol as part of a mixed monolayer to ensure the formation of a stable monolayer. To prevent evaporation you may want to seal the electrode into the Eppendorf tube with parafilm. Sensors can be stored in this solution for several days if necessary.\nWhen you are ready to use the sensor, rinse it with DI-water and then soak it in buffer for at least ten minutes. Sensors aimed at antibody detection must also be immersed in a 100 nM solution of the relevant recognition strand prior to use, followed by an extremely quick rinse with buffer.\n3. Sensor Testing, DNA Detection \nIn this protocol, a 17 nucleotide probe strand is affixed to a gold electrode. It has a methylene blue redox reporter at its 3’-end (Figure 1). When the probe molecule hybridizes with a capture strand, the current through the sensor circuit decreases.\nRinse a fresh sensor with DI-water and immerse it in a blank sample lacking the target in order to record the background signal it produces. Attach the sensor to the working electrode lead of a potentiostat. Place a platinum counter electrode and a silver/silver chloride reference electrode into the solution.",
    "Run a square wave measurement from 0 to -0.6 V with an amplitude of 25 mV and a step size of 1mV.  The optimal square wave frequency will depend on the details of the probe architecture2,3; for the probe architectures we have employed the optimal values are typically in the range 60 to 600 Hz. You should see a rounded peak at approximately -0.35 V, the redox potential of methylene blue (the peak potential may shift slightly depending on the precise pH of your test solution). The height from baseline current to this peak is proportional to the efficiency electron transfer between the methylene blue and the gold electrode (Figure2). Save this background measurement.\nMove the electrodes to a solution that contains the target DNA molecule of interest, equilibrate (5 to 120 min depending on the size, structure and concentration of the target4,5) and collect a second square wave voltammagram. The height of the peak at -0.35 V will change from the initial, background measurement. The magnitude of this change is related to the concentration of the analyte. It is the main output data of this sensor (Figure 3).\nMeasuring relative signal change, the percentage decrease or increase in signal relative to the background peak, is often more reproducible than measuring the absolute change in current, as this corrects for variations in the surface area of the electrode. To do this, the difference between the peak current and the background peak current are divided by the background peak current.\n4. Sensor Regeneration",
    "Once your measurements are complete, move the sensor into a container filled with DI-water for 30 s, or squirt it with a steady stream of DI-water for 30 s. Repeat this two more times with fresh deionized water.  Note: some analytes are resistant to this approach; for them try aggressive rinsing in 6 M guanidine hydrochloride or 70% ethanol.\nPut the sensor back into a solution where measurements will be made. Within a minute, the peak height should have returned to its original value.  It is worth noting that these sensors often exhibit a slightly larger signal change during their first test and regeneration cycle, and highly consistent results during the subsequent cycles6. \n5. Sensor Testing, Antibody Detection \nIn this protocol, the methylene-blue and thiol-modified DNA probe used in these sensors serves as an \"anchor\" strand7. It is attached directly to the gold electrode.  This is then hybridized with a second, \"recognition\" DNA strand that has been covalently conjugated to the relevant antigen (Figure 4).  We have had good luck with commercial synthesis houses, such as Biosearch Technologies and Panagene, for the synthesis of the needed DNA-antigen chimeras.  The hybridization step is carried out by transferring a pre-fabricated sensor into an Eppendorf tube containing 100 nM of the relevant recognition DNA strand in PBS for 1 hour.\nPlace the sensor in the relevant blank solution. Attach it to the working electrode lead of a potentiostat and place a platinum counter electrode and silver/silver chloride reference electrode into the solution.\nPerform square wave voltammetry as described above.  For the particular probe architecture we have employed here the optimal square wave frequency is 60 Hz. You should see a rounded peak around -0.35 V. Save this background measurement.",
    "Transfer the electrodes to a solution containing the target analyte, incubate for 5 to 60 min, and collect a second square wave voltammagram. If the target antibody is present the peak at -0.35 V will decrease. The magnitude of this change is related to the antibody concentration.\n6. Sensor Testing, Small Molecule Detection \nIn this case, the probe molecule on the sensor surface is an aptamer, a DNA or RNA molecule that has been selected in vitro to bind a specific molecular analyte, that changes its structure (folds) upon binding to its target analyte8,9 (Figure 5).  Here we employ a cocaine-binding, DNA aptamer developed by the Stojanovic10,11 lab.\nRinse a fresh sensor with DI-water and immerse it in a blank sample lacking the target in order to record the background signal it produces. Attach the sensor to the working electrode lead of a potentiostat. Place a platinum counter and a silver/silver chloride reference into the solution.\n Perform square wave voltammetry as described above.  For the particular probe architecture we have employed here the optimal square wave frequency is 200Hz (But 60 Hz also works). You should see a rounded peak around -0.35 V. Save this background measurement.\n Transfer the electrodes to a solution containing the target analyte, incubate for ˜5 min, and collect a second square wave voltammagram. The height of the peak at -0.35 V will change. The magnitude of this change is related to the concentration of the target analyte. If you cannot obtain a cocaine sample, procaine, the use of which is unregulated, can be used as a substitute. \n7. Representative Results: \nWhen used to detect DNA using the first architecture, the signal should decrease by at least 60% when equilibrated at 200 nM target.",
    "After three brief rinses in deionized water, the signal should return very close (within 0.1-5%) to its original value. Antibody detection sensors should undergo \na signal decrease of 40 to 80%. Aptamer-based sensors for the detection of cocaine exhibit a signal increase of up to 200% depending on the frequency and surface \ncoverage at which they operate. For the cocaine sensor, a low surface coverage is best3.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2922/2922fig1.jpg\nFigure 1. Detection of DNA with an electrochemical DNA biosensor.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2922/2922fig2.jpg\nFigure 2. Screen shot showing the signal produced by an E-DNA biosensor during square wave voltammetry. \nimgsrc://cloudfront.jove.com/files/ftp_upload/2922/2922fig3.jpg\nFigure 3. Screen shot showing the signals produced by an E-DNA biosensor during square wave voltammetry, before \nand after hybridization with an analyte.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2922/2922fig4.jpg\nFigure 4. Detection of antibodies with a scaffold biosensor.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2922/2922fig5.jpg\nFigure 5.  Detection of cocaine or procaine with an electrochemical aptamer biosensor. \ntable:\n﻿0,1,2\nCustom Oligo,Sequence,Comments\nLinear Probe DNA (LP17),5′-HS−(CH2)6−TGGATCGGCGTTTTATT−(CH2)7−NH−MB-3′,\"HPLC Purified, can be ordered with S-S\"\nTarget Analyte DNA,AATAAAACGCCGATCCA,Unmodified\nRecognition Strand,5'-Antigen-TEG- CAGTGGCGTTTTATTCTTGTTACTG-3',\nScaffold Anchor,5'-HS-(CH2)6-GCAGTAACAAGAATAAAACGC CACTGC-(CH2)7-MB,\"HPLC Purified, can be ordered with S-S\"\nA4 Cocaine Aptamer,5'-HS-AGACAAGGAAAATCCTTCAATGAAGTGGGTCG-MethyleneBlue-3',\"HPLC Purified, can be ordered with S-S\"\nTable 1. Probe and Target DNA Sequences."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}