{
  "id": 12083,
  "origin_website": "Jove",
  "title": "Extraction of Aqueous Metabolites from Cultured Adherent Cells for Metabolomic Analysis by Capillary Electrophoresis-Mass Spectrometry",
  "procedures": [
    "1. Cell culture on day 1\nNOTE: Each sample for metabolite extraction should be prepared from a single 100 mm tissue culture dish that is moderately but not fully confluent (containing approximately 2–5 million cells). Calculate the number of dishes needed for the assay and prepare them accordingly.\nCulture HCC827 and PC-9 cells in 5% CO2 at 37 °C in RPMI-1640 medium supplemented with 10% fetal bovine serum (FBS).\nAspirate the cell culture media from the 100 mm culture dishes.\nWash cells on each dish using 2 mL of phosphate buffered saline (PBS) solution without calcium and magnesium. Gently rock each dish so that the PBS solution completely covers the surface of the dish.\nAspirate the wash buffer from the culture dishes.\nWarm 0.25% trypsin-EDTA solution to 37 °C and add 2 mL of trypsin-EDTA solution with a 5 mL serological pipette. Gently rock each dish so that the trypsin completely covers the surface of the dish.\nIncubate the culture dishes at 37 °C for approximately 5 min.\nAdd 4 mL of pre-warmed complete growth medium per dish. Resuspend the cells in medium by gently pipetting several times.\nTransfer each cell suspension to a separate 15 mL conical tube and centrifuge at 800 × g for 5 min.\nResuspend each cell pellet in 2 mL of pre-warmed complete growth medium.\nDetermine the total number and percent viability of the cells using the automated cell counter and 0.4% trypan blue solution.\n\t\nMix 10 μL of cell suspension and 10 μL of 0.4% trypan blue solution.\nLoad 10 μL of sample into the cell counting chamber slide through capillary action.\nInsert the chamber slide into the automated cell counter. The transmitted light automatically illuminates and the instrument auto focuses on the cell.",
    "Press the capture button to capture the image and display the results.\nIf necessary, add further growth medium to obtain the desired cell concentration.\nSeed approximately 1–2.5 million cells per 100 mm cell culture dish.\n\tNOTE: Metabolite concentrations determined by CE-MS analysis will be normalized based on the number of viable cells. For the purpose of cell counting, it is necessary to prepare at least one extra seeded culture dish for each group.\nIncubate the culture dishes in 5% CO2 at 37 °C for 18 h.\n2. Preparation of reagents\nDilute a commercial internal standard solution including L-methionine sulfone and d-camphor-10-sulfonic acid 1000-fold in ultrapure water.\n\tNOTE: For fewer than 80 samples, simply mix 50 μL of the Internal Standard Solution 1 and 45 mL of ultrapure water in a 50 mL volumetric flask, then bring the solution up to 50 mL with ultrapure water.\nPrepare a 0.05 g/mL mannitol solution in ultrapure water as wash buffer.\n\tNOTE: For fewer than 30 samples, simply dissolve 25 g of mannitol in 500 mL of ultrapure water. Approximately 15 mL of wash buffer is required per 100 mm culture dish, so prepare a sufficient volume of wash buffer according to the number of samples.\n3. Pre-washing centrifugal filter units\nPipette 250 μL of ultrapure water into the filter cup of each centrifugal filter unit (see the Table of Materials).\n\tNOTE: Two filter units per sample are required.\nCap the filter units tightly and centrifuge at 9,100 × g at 4 °C for 5 min.\nCheck the volume of each filtrate—if significant filtrate has accumulated during the first short spin, the filter unit may be defective. In this case, discard the filter unit and use a new filter unit instead.",
    "Close the lids of the filter units tightly and centrifuge again at 9,100 × g at 4 °C for 30 min.\nEnsure that no ultrapure water remains in any of the filter cups; remove the filtered ultrapure water in each collection tube with a pipette and discard.\n\tNOTE: Do not try to remove residual water in a filter cup with a pipette as it may damage the filter.\nReplace the filter cups into their collection tubes.\n\tNOTE: Use the centrifugal filter units within an hour since the filters may become damaged upon drying.\n4. Cell culture on day 2\nTake out the 100 mm culture dishes from the incubator.\n\tNOTE: The recommended cell culture duration is 18 h.\nAspirate the cell culture medium from each 100 mm culture dish.\nAdd 10 mL of cell culture medium that includes the appropriate concentrations of compounds or drugs to each dish, taking care to not disturb the cell layer.\n\tNOTE: For demonstration purposes, we added 10 μL of 250 mM diamide dissolved in PBS (final concentration of 250 μM) in this experiment.\nIncubate the culture dishes at 37 °C for 30 min in the presence of diamide or PBS as a control.\nAspirate the cell culture medium from each 100 mm culture dish.\nWash cells by gently adding 2 mL of 5% mannitol solution to the edge of each dish, taking care to not to disturb the cell layer, then slightly tilt the dish.\n\tNOTE: PBS or saline solution interferes with CE-MS-based metabolomic analysis and adversely affects measurement results, and thus should not be used as wash buffer.\nAspirate the wash buffer from each culture dish, then wash cells again by gently adding 10 mL of wash buffer per dish and slightly tilting the dish.",
    "Completely aspirate the wash buffer from the edge of each culture dish.\n\tNOTE: Aspirate as much wash buffer as possible, while paying attention to not aspirate the cells. Residual mannitol may interfere with CE-MS analysis; aspiration of cells will decrease the number of cells and thus become a source of error in data normalization.\n5. Extraction of metabolites from cultured cells\nAdd 800 μL of 99.7% methanol per culture dish. Gently rock each culture dish back and forth to cover its entire surface. Leave the dishes at room temperature for 30 s.\nSlowly add 550 μL of the diluted internal standard solution per dish by immersing the tip of the pipette into the methanol and gently pipetting up and down several times.\nGently rock each culture dish back and forth to cover its entire surface.\nLeave the dishes at room temperature for 30 s.\n6. Ultrafiltration of cell extracts\nTransfer the extracted solution from each culture dish to a separate 1.5 mL microcentrifuge tube.\nCentrifuge the tubes at 2,300 × g at 4 °C for 5 min.\nTransfer 350 μL of each supernatant into two centrifugal filter units per sample.\n\tNOTE: From each culture dish, a total of 700 μL of the extracted solution is transferred into two filter tubes (350 μL/tube).\nCentrifuge the filter tubes at 9,100 × g at 4 °C for approximately 2 h until no liquid remains in the filter cups.\nRemove the filter cups and tightly close the lids of the collection tubes.\n7. Sample evaporation\nPrepare a centrifugal evaporator—typically, this consists of an evaporator, a cold trap, and a vacuum pump.\nPlace the collection tubes in the centrifugal evaporator.\n\tNOTE: Leave the lids of the tubes open.\nEvaporate the extracted sample solutions under vacuum conditions at room temperature.",
    "NOTE: Typical configurations for the number of rotations and pressure are 1,500 rpm and 1,000 Pa, respectively, and it usually takes approximately 3 h to completely evaporate the samples.\nConfirm that no liquid remains in any of the collection tubes and close the lids of the tubes tightly.\nStore the collection tubes in an ultra-low temperature (−80 °C) deep freezer until metabolomic analysis.\n8. Metabolomic analysis by CE-MS\nResuspend the filtrate in 50 μL of ultrapure water immediately before CE-MS analysis.\nPerform CE-MS analysis by methods described previously12,13 using capillary electrophoresis system and time-of-flight mass spectrometer system equipped with an isocratic pump, a CE-MS adapter, and a CE-ESI-MS sprayer.\n\tNOTE: Both systems can be controlled by the software of the system vendors and are connected by a fused silica capillary (50 μm internal diameter × 80 cm total length).\n\t\nSet up instruments and sample vials, prepare the capillary with a capillary cassette, replenish sheath liquids and appropriate electrophoresis buffers depending on anion or cation analysis mode, and then apply voltages.\n\t\tNOTE: Instrumentation and analytical conditions are described in detail elsewhere12,13.\nOpen the software and prepare a worklist containing data acquisition methods and sample information.\nStart a test run and check the data such as the signal intensity and the peak shape of internal standards and the peak resolution of other standard compounds.\nFine-tune the analytical conditions if necessary.\nInject the sample solutions at 50 mbar for 3 s and a voltage of 30 kV.",
    "NOTE: CE-MS was conducted either in the positive or negative ion mode. Set the spectrometer to scan the mass range m/z 50–1000. The capillary voltage was set at 4 kV; the flow rate of nitrogen gas (heater temperature 300°C). For positive mode, the fragmentor, skimmer and OCT RFV voltage were set at 75, 50 and 125 V, respectively. For negative ion mode, the fragmentor, skimmer, and OCT RFV voltage was set at 100, 50, and 200 V, respectively.\nAnalyze spectrum data.\n\t\nExtract peaks from the mass spectral data using automatic integration software in order to obtain peak information including m/z, peak area, and migration time (MT).\n\t\tNOTE: The method is described in detail elsewhere14.\nExclude signal peaks corresponding to isotopomers, adduct ions, and other product ions of known metabolites.\nAnnotate remaining peaks with information from the HMT metabolite database according to m/z values and MTs.\nNormalize areas of the annotated peaks to internal standard levels and numbers of cells per sample.\nEvaluate the concentration of each metabolite in the cultured cells (pmol/106 cells) using standard curves prepared for each metabolite.\nUse the quantified metabolite concentrations for subsequent statistical analyses and biological interpretations14."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}