{
  "id": 11154,
  "origin_website": "Jove",
  "title": "Generation and Recovery of β-cell Spheroids From Step-growth PEG-peptide Hydrogels",
  "procedures": [
    "A. Macromer and Peptide Synthesis\nSynthesize 4-arm PEG-norbornene (PEG4NB) and photoinitiator Lithium arylphosphanate (LAP) using established protocols.18,19\nSynthesize bis-cysteine containing chymotrypsin-sensitive peptide CGGY↓C (arrow indicates chymotrypsin cleavage site) using standard solid phase peptide synthesis in a microwave peptide synthesizer (CEM Discover SPS).\n\t\nCalculate the amount of resin (Rink-amide MBHA resin) needed based on the substitution ratio of the resin and the synthesis scale. Swell the resin in dimethylformamide (DMF) in a reaction vessel (RV) for 15 min.\nRemove Fmoc-protecting group from the resin using a deprotection solution containing 20% Piperidine and 0.1 M HOBt in DMF. Use the parameters listed in the table below for microwave-assisted Fmoc-deprotection (for all Fmoc-amino acids):\n\t\ttable:\n﻿0,1,2\nSynthesis scale,0.1 mmole,0.2 mmole\nPower,20 W,50 W\nTemperature,75 °C,75 °C\nTime,3 min,3 min\nFollowing deprotection, rinse the resin with DMF and perform Ninhydrin test to confirm the removal of Fmoc (exposure of N-terminal amine). Resin should turn blue after 2 min at 95 °C.\nAfter successful deprotection, couple the first Fmoc-amino acid at the C-terminus (synthesis runs from C- to N-terminus) in an activator base solution (0.28 M Diisopropylethylamine (DIEA) in DMF) with the parameters listed in the table below.\n\t\ttable:\n﻿0,1,2\nSynthesis scale,0.1 mmole,0.2 mmole\nPower,20 W,50 W\nTemperature*,75 °C,75 °C\nTime*,5 min,5 min\n\t\t* For Cyst and His, use 50 °C and 10 min to reduce racemization.\nRinse the resin and perform Ninhydrin test to qualitatively confirm the completion of coupling (disappearance of N-terminal amine). Resin should be clear after 5 min at 95 °C. Repeat coupling step (A.2.d) if Ninhydrin test returns positive result (blue color).\nRepeat deprotection (step A.2.b) and coupling (step A.2.d) for additional amino acids in the sequence ending with a final deprotection step.",
    "Drain the RV, rinse resin with 25 ml of dichloromethane (DCM). This step is to rinse off DMF, which is a base and will hinder peptide cleavage.\nPrepare cleavage cocktail by mixing 250 mg phenol in 4.75 ml Trifluoroacetic acid (TFA), 0.125 ml Triisopropylsilane (TIS) and 0.125 ml ddH2O.\nAdd cleavage solution into the RV and cleave for 30 min in the microwave peptide synthesizer (Power = 20 W; Temperature = 38 °C).\nCollect the peptide solution in a 50 ml centrifuge tube using vacuum manifold.\nPrecipitate cleaved peptide in 40 ml of ether, vortex the tube and centrifuge at 3,000 rpm for 5 min to collect the peptide.\nDrain the supernatant and repeat step A.2.k twice.\nCollect and dry peptide in vacuum.\nPurify the peptide using HPLC and characterize it with mass spectrometry.\nB. Material Preparation and Sterilization\nPrepare 20 wt% PEG4NB solution in PBS, vortex the mixture until the macromer dissolves completely, and sterilize the macromer solution using a syringe filter. Store the sterilized solution at -20 °C (prepare aliquots for long-term storage).\nPrepare and sterilize 2 wt% photoinitiator (LAP) solution in PBS. Store the sterilized solution at room temperature protected from light.\nDissolve the peptide (CGGYC) in PBS, vortex the mixture and syringe filter the solution for sterilization. Aliquot the peptide solution and store at -20 °C until use (prevent freeze-thaw cycles).\nDetermine thiol (-SH) concentration in the prepared peptide solution using Ellman's reagent (follow the manufacturer's protocol). This step will give accurate peptide concentration (i.e., [SH]/2) that is required for calculating the peptide amount to be used in thiol-ene photo-click reactions.\nPrepare gelation molds by cutting the top portion off of sterile 1 ml disposable syringes using a razor blade (open tip for gel removal). Sterilize the syringe molds by autoclave.",
    "Based on the desired gel formulation (thiol to ene ratio = 1) and concentrations of stock materials, calculate the required volume of polymer, peptide crosslinker, photoinitiator, and buffer solutions required.\nC. Cell Preparation\nEquilibrate cell culture medium (high glucose DMEM containing 10% fetal bovine serum; Antibiotic-Antimycotic with 100 U/ml penicillin, 100 μg/ml streptomycin, 250 ng/ml Fungizone; and 50 μM β-mercaptoethanol), Hank's balanced salt solution (HBSS, Ca2+, Mg2+ free), and Trypsin-EDTA to 37 °C.\nRemove flasks containing MIN6 β-cells from CO2 incubator and place the flasks in the laminar flow hood.\nAspirate cell culture media from the flasks and rinse the cell with HBSS.\nTrypsinize the cells using 3 ml of 2X (0.1%) Trypsin-EDTA and incubate the flasks for 4 min at 37 °C and 5% CO2.\n\t\nNote: Use 2X trypsin solution allows complete dissociation of MIN6 β-cells into single cell suspension.\nAfter incubation, tap the flasks on the surface of the hood gently to completely detach the cells. Confirm the detachment and dissociation of the cells using a microscope.\nAdd equal volume of cell culture medium to neutralize the trypsin. Mix the solution well by gentle pipetting, then transfer the mixture to a canonical tube and centrifuge for 5 min at 1,000 rpm.\nAspirate the supernatant and gently re-suspend the cells in 4 - 5 ml of culture media.\nDetermine cell density using 50% Trypan blue buffer in a hemocytometer.\nD. Hydrogel Fabrication and Cell Encapsulation\nOnce the cells are ready, mix (based on a 1:1 thiol to ene ratio) the required volumes of PEG4NB, CGGYC, LAP, cell solution, and HBSS in a microcentrifuge tube.",
    "Mix the solution gently using a pipette to obtain a homogeneous mixture and add 25 μl of the resulting solution to a syringe mold. Expose the syringe to UV light (365 nm, 5 mW/cm2) for 2 min.\nFollowing photopolymerization, plunge gels into a sterile 24-well plate containing cell culture medium and incubate the hydrogels in 37 °C and 5% CO2.\nWash the cell-laden hydrogels in cell culture medium for 30 min to rinse off loosely attached cells and un-crosslinked macromers. Transfer the gels into fresh medium.\nRefresh cell culture media every 2 to 3 days.\nE. Cell Viability Assay\nEncapsulated cell morphology can be observed using light microscope (since the synthesized hydrogels are transparent). Cell viability can be visualized and measured qualitatively using Live/Dead staining and quantitatively using AlamarBlue reagent.\nE.1. Live/Dead staining\nThaw Live/Dead staining reagents at room temperature.\nIn a canonical tube add PBS according to the number of samples (n) to be stained:\nTotal volume of PBS=n × 500 μl\nPipette 0.25 μl of Calcein AM and 2 μl of EthD-1 per 1 ml of PBS to the canonical tube containing PBS. Vortex the solution to mix the components.\nIncubate cell-laden hydrogels in Live/Dead staining solution (0.5 ml/sample) for 1 hr at room temperature on an orbital shaker.\nUsing a pasteur pipette, remove the dye solution and rinse the sample twice with PBS.\nPlace sample on a cover slip or glass slide. Observe and image cells using a confocal microscope.\nE.2. AlamarBlue Assay\nPrepare 10 v/v% AlamarBlue solution in cell culture medium.\nRemove hydrogels from incubator and aspirate the media out of each well without making any contact with the hydrogel.\nIncubate cell-laden hydrogels and an empty well (negative control) in 500 μl of 10% AlamarBlue solution for 16 hr.",
    "Following incubation, pipette 200 μl of the AlamarBlue solution in a 96 well plate and measure fluorescence using a microplate reader (excitation: 560 nm, emission: 590 nm).\n\t\nHigher cellular metabolic activity reduces the dye to give higher fluorescence reading.\nBe sure to include at least two wells of 10% Alamarblue solution as blanks. When analyzing the data, subtract the averaged blank fluorescence value from the fluorescence reading of the samples.\nF. Chymotrypsin Mediated Gel Erosion and Spheroid Recovery\nPrepare 1 mg/ml of Trypsin-free α-chymotrypsin solution in HBBS and sterile filter the solution.\nIncubate hydrogels in chymotrypsin solution (500 μl for each gel) at room temperature with gentle shaking until complete gel erosion is achieved.\n\t\nFor a 25 μl gel, the time for complete erosion is approximately 5 min.\nPlace the plate on ice for a few minutes to reduce the activity of chymotrypsin.\nTransfer the cell solution in 1 ml tube and centrifuge at 300 rpm, 4 °C for 2 min.\nCarefully remove the supernatant using a pasture pipette and gently resuspend the spheroids in HBSS.\nTransfer the recovered spheroid solution to a 24-well plate and place the plate on ice to allow the spheroids to settle down.\nFor size analysis, acquire phase contrast images of the settled spheroids using a light microscope. Measure recovered spheroid diameters using software such as Nikon Element software or ImageJ.\nG. Functional Assay of Recovered Spheroids\nG.1. Glucose stimulated insulin secretion from the recovered cell spheroids\nIn a 24 well plate, incubate the gels in 500 μl of 2 mM low glucose Kerbs-Ringer buffer (KRB) for 1 hr.\nErode the gel and recover cell spheroids using steps F.1 to F.6.",
    "Aspirate the supernatant carefully without making any contact with the cell spheroids and resuspend the spheroids in 500 μl of 2 mM low glucose KRB.\nTransfer 100 μl of cell spheroids solution to a 0.6 ml tube and place it on ice for intracellular ATP quantification.\nSplit the remaining cell spheroid solution in half (into two microcentrifuge tubes) and centrifuge for 2 min at 300 rpm and 4 °C.\nAspirate supernatant (almost to the bottom) and resuspend the first half of cell spheroids in 1 ml of 25 mM high glucose KRB and second half in 1 ml of 2 mM low glucose KRB.\nGently pipette and transfer the solution containing recovered cell spheroids to a 24-well plate. Incubate the plate for 1 hr at 37 °C and 5% CO2.\nFollowing incubation, transfer the solution to a microcentrifuge tube and centrifuge for 2 min at 1,000 rpm and 4 °C.\nTransfer 500 μl of the supernatant from the centrifuged tube to another microcentrifuge tube and store at 4 °C for insulin ELISA.\nPerform insulin ELISA following manufacturer's protocol.\nG.2. CellTiter Glo Assay\nATP standards: Prepare a 10 μM ATP solution and perform serial dilutions to obtain a series of 8 standard solutions.\nTo a white 96 well plate, add 50 μl of cell spheroid solution (from step G.1.6) and standards.\nTo each well containing samples and standards, add 50 μl of CellTiter Glo reagent and incubate at room temperature for 15 min.\nFollowing incubation, measure luminescence count of the samples and standards using a microplate reader and calibrate sample ATP concentrations using a linear regression curve generated by the ATP standards.\nDetermine the total ATP concentration in sample and multiply by the sample dilution factor to get the intracellular ATP concentration in one cell-laden hydrogel.\nG.3. Determine insulin secretion",
    "Calculate the amount of insulin secreted from the recovered spheroids by taking the ratio of the amount of insulin secreted in high glucose medium to amount of insulin secreted in low glucose medium.\nNormalize the quantified insulin content of cell spheroids with respective amount of intracellular ATP of the recovered cell spheroids.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}