{
  "id": 3896,
  "origin_website": "Cell",
  "title": "An optimized two-step chromatin immunoprecipitation protocol to quantify the associations of two separate proteins and their common target DNA",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nTransfecting the cells with Flag-tagged expression plasmid\nTiming: 24 h–30 h\nSeed about two million 293T cells each 10 cm dish. 12–15 h later, the cell density will be up to 30%–50%, and this is an ideal density range for the transfection. Then transfect 293T cells with 10 μg Flag-tagged expression plasmid (For example, pcDNA 3.1-Flag-TEAD4) by the Lipofectamine 2000 according to the transfection protocol (https://www.thermofisher.com[href=https://www.thermofisher.com]).\nNote: 293T cells are easy to be suspended, so gentle operation is required for each step.\nNote: We need at least 107 cells, so preparing a 10 cm dish cells is recommended.\nCritical: Test the expression level of your protein of interest prior to ChIP assay. See troubleshooting 1[href=https://www.wicell.org#sec6.1].\nCritical: The cell density will affect the expression profile of some proteins. Controlling the cell density to an ideal range is strongly recommended. Please see troubleshooting 2[href=https://www.wicell.org#sec6.3].\nFixing the cells\nTiming: 1 h∼2 h\n30 h after transfection, remove medium and wash once with 2 mL DPBS (at about 25°C) per 10 cm dish.\nDilute 37% Formaldehyde to a final concentration of 1% with DPBS (at about 25°C) and shake to mix.\nImmediately add 1% formaldehyde 4 mL to cell culture dish and cover the cells.\nNote: If the users use 15 cm dish, we recommend that you should add 1% formaldehyde 8 mL. Just remember, whatever size of dish you use, ensure that all of the cells are covered by the formaldehyde solution.\nCritical: Do not add high concentration formaldehyde to the cell culture dish directly! This operation will make a damage to the antigen.\nCritical: In order to avoid any change in expression profiles, we fix the cells in natural or physiological status before digesting or scraping off the cells.\nIncubate at 37°C for 15 min.",
    "Critical: The duration of fixation is very important as over-fixation will affect the antigen recognition, while under-fixation will reduce the cross-linking efficiency. See troubleshooting 5[href=https://www.wicell.org#sec6.9]. \nStop the fixation by adding 1:20 volume (200 μL) of 2.5M Glycine. Shake the cell culture dish gently to mix it. Put the dish back to 37°C incubator for 5 min.\nPellet cells in 1.5 mL tube by scraping off the cells from the dish and spinning down at 1000 × g for 5 min at 4°C.\nNote: Some cell lines are difficult to scrape off. See troubleshooting 3[href=https://www.wicell.org#sec6.5]. \nNote: After this step, keep the cells on ice or 4°C unless otherwise indicated.\nCarefully tip off supernatant, wash pellet with 1 mL cold DPBS with pipetting gently, and centrifuge the tube at 1000 × g for 5 min at 4°C.\nRepeat step 8 twice then make a cell suspension in DPBS.\nTake 10 μL of cell suspension for cell counting.\nNote: If the cell density is too high, that will result in inaccurate cell counting, so you may need to dilute the sample to bring the concentration within an appropriate range. The cell number will affect the efficiency of sonication. See troubleshooting 4[href=https://www.wicell.org#sec6.7]. \nCentrifuge at 1000 × g for 5 min at 4°C and discard the supernatant.\nPause Point: This step you can record cell number and store the pellets at −80°C for several months.\nShearing the chromatin into a suitable size range\nTiming: 1 h∼2 h\nAdd ChIP Lysis Buffer with fresh protease inhibitor cocktail (1:100) to get a cell concentration of 2×106/mL, and rotate the samples for 30 min at 4°C.",
    "Critical: Cell concentration affects the following chromatin shearing efficiency, so the volume of ChIP Lysis Buffer added should be optimized. See troubleshooting 4[href=https://www.wicell.org#sec6.7]. Besides, this step ensures the equal cell concentration of input aliquots among samples.\nNote: Take 10 μL aliquot per sample for western blotting using Flag-tagged primary antibody (1:5000) to confirm the expression of the proteins that you over-expressed by transfection.\nTake another 5 mL aliquot per sample and divide it equally into 5∗1.5 mL Axygen tubes (each tube contains 1 mL sample).\nShear them for 25 cycles one by one by sonication (10 s on, 20 s off with power of 25% at 4°C).\nNote: In order to ensure the shearing efficiency, we may need to adjust the parameters in terms of different cell lines used and different sonication equipment.\nCritical: This step we must make sure all the sample tubes are placed on a mixture of ice and water to protect the protein from degradation (Figure 1[href=https://www.wicell.org#fig1]A). Long time continuous sonication would heat samples, so the interval between “on” and “off” should not less than 20 s to recover the temperature of the samples. See troubleshooting 5[href=https://www.wicell.org#sec6.9].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/619-Fig1.jpg\nFigure 1. Schematic diagram of shearing the fixed chromatin into a suitable size-range\n(A) Picture showing the sonication tube put on ice.\n(B) Agarose gel picture showing the distribution of DNA fragment after chromatin sonication of different cycles.\nOptional: If your proteins of interest are easy to degrade, enzymatic fragmentation may be a good option instead of sonication.\nSpin down all samples for 15 min at 16,800 × g speed at 4°C. \nCombine the supernatants of 5 tubes from the same sample into a new 5 mL tube.",
    "Take 50 μL aliquot as 5% Input 1 control sample (in comparison with the volume of step 18) and store at −20°C.\nNote: Before performing immunoprecipitation, it is required to check the fragmentation pattern of the chromatin. The ideal DNA fragmentation for ChIP is that most of the DNA fragments are ranging from 200∼600 bp after sonication. If not, we need to optimize the cell concentration, sonication time and cycle (Figure 1[href=https://www.wicell.org#fig1]B), or SDS concentration until it shows an allowable range. See troubleshooting 4[href=https://www.wicell.org#sec6.9].\nPerforming the first-step ChIP\nTiming: 15 h\nTake four 1.5 mL EP tubes for the following IP, and each is approximately 1 mL.\nAdd 2 μg primary antibody targeting Flag-tagged fusion protein A and IgG (In this study, three tubes with mouse anti-Flag and one with mouse IgG as a control). Rotate overnight at 4°C.\nOptional: Cell samples transfected with an empty vector or not-transfected can be also used as a negative control.\nNote: The species for IgG antibody is recommended the same with Flag tag antibody.\nOptional: As appropriate, use other tag antibodies as control, such as mouse anti-V5.\nPrepare ChIP Lysis Buffer with sperm DNA and BSA to 1 mg/mL final concentration, and block Protein A/G Plus Agarose beads by adding prepared ChIP Lysis Buffer with same volume as beads and incubating for one hour at 4°C.\nNote: This step is to block the beads and avoid the nonspecific binding between agarose beads and proteins or genomic DNA fragments.\nPrepare four 1.5 mL tubes added with 60 μL buffer (containing 30 μL beads) for each tube, centrifuge the agarose beads at 1000 × g for 1 min, and remove the supernatant from the tubes. Then add the cell lysate-antibody to the tube loaded with 30 μL beads, and rotate at 4°C for 2 h.",
    "Centrifuge the tube for 1 min at 2,000 × g and remove the supernatant.\nWash beads three times with 1 mL ChIP Wash Buffer at 2,000 × g for 2 min.\nWash beads with 1 mL ChIP Final Wash Buffer at 2,000 × g for 2 min.\nNote: The ChIP Final Wash Buffer with high salt concentration can remove the nonspecific binding.\nEluting the immunocomplexes from the first step and performing the second-step ChIP\nTiming: 15 h\nElute two tubes of the immunocomplexes (added with anti-Flag antibody) from beads by adding 0.5 mg/mL 3×Flag peptide (Sigma) in 100 μL ChIP Lysis Buffer rotating at 4°C for one hour. The rest two tubes have finished their process of first-step ChIP. Please store them at −20°C for elusion step (step 32).\nNote: If you used the other tags instead of Flag, please elute the immunocomplexes from the beads by adding the same concentration (0.5 mg/mL) peptide of your tag in 100 μL ChIP Lysis Buffer.\nNote: In this step, elution by rotating the tubes is required to sufficiently elute the proteins-DNA complex from the beads.\nCentrifuge at 2,000 × g for 2 min and collect the supernatant.\nTwo sequential elutions are performed as steps 25 and 26.\nCollect the eluent together from three times and take 15 μL aliquot as 5% Input 2 sample.\nDilute the eluted 285 μL protein-DNA complex by adding 855 μL ChIP Lysis Buffer (1:3), supplemented with 1% Triton X-100.\nIncubate the samples in the two tubes with 3 μg of normal IgG or anti-Protein B antibody (such as mouse anti-CHD4 antibody) respectively, and rotate overnight at 4°C.\nRepeat steps 20–24 for these two tubes.\nEluting and reversing cross-link\nTiming: 1 day\nAdd 400 μL ChIP Elution Buffer to the beads and incubate at 65°C for 30 min.",
    "Note: From this step, take all the samples out including Input 1 from step 17, first-step ChIP immunocomplexes from step 24, Input 2 from step 28, and second-step ChIP immunocomplexes from step 31.\nNote: Supplement the Input samples to a final volume of 400 μL with ChIP Elution Buffer.\nAdd 16.8 μL NaCl (from 5 M stock) to each tube, andincubate at 65°C for at least 4 h or overnight.\nNote: Ensure sufficient incubation for at least 4 h.\nAdd 4 μL EDTA (from 0.5 M stock) and 5 μL Proteinase K (from 20 mg/mL stock) to each tube and incubate at 55°C for 2 h.\nCentrifuge at 16,800 × g for 15 min and collect the supernatant which contains the eluted DNA from immunoprecipitation.\nPurifying the DNA from the immunocomplexes\nTiming: 2 h\nPurify DNA from immunoprecipitation or input with QIAQUICK PCR Purification Kit (250) (cat N.O., 28106, QIAGEN) according to the manual’s instruction.\nThe purified DNA are resuspended in 30 μL ddH2O and the concentration is measured by NanoDrop.\nTake 5 μL aliquot of Input 1 sample and run DNA agarose gel electrophoresis to verify the shearing efficiency before qPCR.\nNote: We check the shearing efficiency again just for verifying the shearing efficiency of this time to ensure the reliability of our results.\nCritical: The ideal DNA fragment size should range between 200 and 600 bp. Do not test chromatin fragmentation by running the crosslinked chromatin-protein complex. See troubleshooting 4[href=https://www.wicell.org#sec6.7].\nNote: The DNA concentration of Input 2 and ChIP is possibly less than 2 ng/μL, which is acceptable.\nNote: Purified samples can be stored at −20°C.\nRunning ChIP-qPCR and analyzing the data\nTiming: 3 h\nDilute DNA sample from Input 1 with more 120 μL ddH2O to get a 1% input 1.",
    "Note: The DNA concentration of Input 1 sample should be higher than ChIPed DNA with many folds, so we need to dilute the DNA from Input 1 accordingly.\nRun qPCR of all of the samples in the following system with qPCR Machine (Roche, LC96).\ntable:files/protocols_protocol_619_5.csv\nCritical: Besides investigating the gene loci that you interested in, it is necessary to verify your ChIP quality by checking the positive loci that can be enriched by the protein of interest which has been demonstrated, as well as the negative loci that is far away from the positive one.\nAssessing the enrichment of the proteins of interest on the targeting region by calculating the value of “fold over IgG” of each step ChIP using the following equations:\nFold over IgG (first-step) = 2Ct (IgG from first-step ChIP) - Ct (first-step ChIP)\nFold over IgG (second-step) = 2Ct (IgG from second-step ChIP) - Ct (second-step ChIP)\nNote: The value of fold over IgG is used to assess the ChIP efficiency. Usually, the fold over IgG of positive control is supposed to be more than 10, and the negative control is approximately 1 (barely enriched). Additionally, the Ct value is also an important parameter to verify the ChIP quality. The negative control should ideally have a Ct value with more than 30, whereas the Ct value of the target genes for 1% Input 1 is in the range of 20–26, and ideally <28 for the positive control. The Ct value of the target genes for Input 2 is in the range from IgG to Flag of step one ChIP (Figures 2[href=https://www.wicell.org#fig2]A and 2B). Please see troubleshooting 5[href=https://www.wicell.org#sec6.9].",
    "Optional: We can also assess the enrichment of the proteins of interest on the targeting region by calculating the value of “% of input” of each step ChIP using the following equations:\n% of input (first-step) = 1% ∗ 2Ct (Input 1) - Ct (first-step ChIP)\n% of input (second-step) = 5% ∗ 2Ct (Input 2) - Ct (second-step ChIP)\nNote: If you choose this equation, usually, the % of input absolute value of the positive control is supposed to be more than 0.5, and the negative control is less than 0.1. The relative value of positive loci signal/IgG signal should be more than 10 times, and the relative value of negative loci signal/ IgG signal should be about 1."
  ],
  "subjectAreas": [
    "Chromatin Immunoprecipitation (Chip)",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}