{
  "id": 4261,
  "origin_website": "Bio",
  "title": "<em>In vitro</em> Nematode Infection on Potato Plant",
  "procedures": [
    "Plant growthIn a sterile environment, cut nodal stem segments (approximately 1 cm long) (Figure 1), and push the stem piece firmly into the 6-well plate containing 6 to 7 ml of propagation medium per well with timentin (100 μg/ml), leaving the top part of the stem exposed (Figure 2).Label plates and seal them with micropore tape.Cultivate in a growth incubator at 24 °C under a 16-h/8-h light/dark cycle for two weeks until roots have emerged for several days.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20131230/20131230031356_9967.jpgFigure 1. Potato plantlet growing in the propagation medium. Nodal section is indicated as shown.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20131230/20131230031431_1764.jpgFigure 2. 6-well plate with potato nodal segments embedded in propagation mediumNematode egg hatching and sterilization (all the following steps are performed at room temperature)One week before inoculation, soak nematode cysts at room temperature in a small (20-30 ml) beaker covered loosely with aluminum foil and check daily to ensure that cysts are fully soaked in water during the 7-day hydration period.Crush the cysts using the following method:Nest the sieves with the No. 60 sieve on top, No. 200 sieve in the middle and the No. 500 sieve on the bottom.Pour the cysts from their beaker to the sieve stack and rinse out the beaker with water to collect the remaining cysts.With a rubber stopper, grind the cysts through the No. 60 sieve using a circular motion, washing frequently with tap water to keep cysts off the sides. Grind until no more cyst pieces will go through the screen.Wash the No. 60 sieve thoroughly with water.Remove the top sieve and discard the contents. Wash the No. 200 sieve thoroughly with water and remove it. Nematode eggs are collected on the No. 500 sieve.Use a water bottle to rinse eggs from the No. 500 sieve into a clean 250 ml glass beaker.Add sodium azide solution (caution: TOXIC!",
    "Wear nitrile gloves) to beaker containing nematode eggs and make up to 100 ml with water. The egg suspension should have a final concentration of 0.02% sodium azide.Stir the egg suspension for 20 min on a stirplate.Pour the egg suspension back onto the previously used No. 500 sieve and rinse the eggs well with constant flow of tap water for about two min to remove all traces of sodium azide.Set up the hatching chamber (Figure 3). Nest a large mesh screen pan on a solid pan and place a 30-μm mesh on the screen pan. Rinse the nematode eggs from the No. 500 sieve onto the 30-μm mesh carefully using PRD containing gentamycin (1.5 mg/ml) and nystatin (0.1 mg/ml) antibiotics. Make sure to add enough PRD with antibiotics into the hatching chamber to cover the 30-μm mesh. Cover with an inverted solid pan and place in a tray. All the pans and the 30-μm mesh must be autoclaved before use.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20131230/20131230031514_1233.jpgFigure 3. Nematode egg hatching chamber assemblyAllow eggs to hatch at room temperature for 3-4 days, making sure there is enough PRD (with appropriate antibiotics).Pour hatched juveniles (J2s) (Figure 4) into a small glass beaker several hours before using to let the worms settle down at the bottom of the beaker.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20131230/20131230031533_4049.jpgFigure 4. Hatched nematode juvenile (J2)Check the J2 suspension under the dissecting scope for signs of heavy bacterial or fungal contamination. If heavily contaminated, do not use for inoculation work.Take out PRD as much as possible (without disturbing the settled J2s on the bottom) using a glass pipette and spin down the J2s at 13,400 x g for 2 min in 1.5 ml low retention centrifuge tubes. Resuspend J2s in 1 ml sterile water.Take counts of J2s by making 1:10 dilution and count J2s in five 10-μl drops.",
    "Calculate the total number of J2s in 1 ml according to the average number of J2s in a 10-μl drop, and spin down the amount of J2s needed for inoculation at 13,400 x g for 2 min (spin down more J2s than needed for infection, since some nematodes will die after sterilization). Proceed with sterilization.SterilizationAdd 1 ml of diluted sterilization solution (0.004% mercuric chloride/0.004% sodium azide; Caution: TOXIC! Wear nitrile gloves) to each tube containing J2s. Close tubes and incubate on a rocking shaker for 10 min.Spin down the J2s at 13,400 x g for 2 min. Remove sterilization solution and discard in a special waste container (solutions containing mercury must not be discarded in a sink).Wash J2s with 1 ml sterile distilled water, incubate on the rocking shaker for 5 min and then centrifuge to remove water. Repeat washing steps for three more times.Resuspend J2s in 1 ml of sterile distilled water and take out 10 μl suspension to count. Calculate the volume needed to obtain the desired number of J2s for infection.Centrifuge to spin down the J2s and remove water as much as possible. Add calculated volume of 0.1% agarose to get the desired density of J2s for infection (recommend to use 1 - 3 J2 per μl).Infection of S. tuberosum with potato cyst nematode G. rostochiensis Cut off the tops of the potato plantlets in the 6-well plates using a sterile technique.Inoculate each potato plantlet with 100 - 200 nematode J2s depending on experiments. Pipette out a desired volume of J2 agarose suspension and punch the pipet tip into the medium and release the nematode suspension around the root tips (perform the inoculation within half an hour after J2s are suspended in 0.1% agarose since long suspension in this agarose solution can reduce nematode infectivity).",
    "Seal with micropore tape and return plates in the growth chamber (24 °C, dark condition).Monitor the development of G. rostochiensis on potato plantlet roots each week for the next four to five weeks. After two weeks of infection nematodes at J3 stage should be visible.Count nematode females four to five weeks post infection Take out each plantlet (including medium) and put on the lid of a petri dish (100 mm in diameter). Cut off the top of the plantlet and just keep the roots, add several drops of water on the plate, cover with another half of the petri dish on top. Gently press the top petri dish until the medium and the roots fully expanded on the bottom petri dish (Figure 5).Count the females on this plate under a dissecting microscope.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20131230/20131230031715_5071.jpgFigure 5. Nematode females formed on a potato root (some were detached from the root due to handling)"
  ],
  "subjectAreas": [
    "Cell Biology",
    "Plant Science"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}