{
  "id": 10378,
  "origin_website": "Jove",
  "title": "A Freeze-Thawing Method to Prepare Chitosan-Poly(vinyl alcohol) Hydrogels Without Crosslinking Agents and Diflunisal Release Studies",
  "procedures": [
    "1. Preparation of chitosan-PVA hydrogels\nPrepare 2% (w/w) chitosan and 10% (w/w) PVA solutions. Dissolve 0.2 g of chitosan in 10 mL of 0.1 M CH3COOH solution (previously filtered) at room temperature and maintain continuous mechanical stirring overnight. Dissolve 1 g of PVA in 10 mL of distilled water and stir at 80 °C for 1 h.\nMix both solutions 1:1 using a magnetic stirrer until they are homogeneous at room temperature, and pour the mixtures on Petri dishes. Leave the samples for 2 h at atmospheric pressure to degas.\nFreeze the hydrogels at -4 °C, -20 °C or -80 °C for 20 h and 4 cycles (samples CP4-4, CP4-20 and CP4-80, respectively). Freeze another hydrogel at -80 °C for 20 h using 5 or 6 freezing cycles (samples CP5-80 and CP6-80). After the third freezing cycle, wash the hydrogels with deionized water. At the end, freeze-dry the hydrogels at -46 °C for 48 h and store for further characterization (methodology adapted from2).\n2. FT-IR characterization\nPlace a little piece (1 mm x 2 mm) of hydrogel in the FT-IR spectrometer in ATR mode. Take the FT-IR spectra from 4000 to 600 cm-1 (2 cm-1 of resolution and average of 32 scans).\n3. Swelling assays\nCut out discs (13 mm in diameter and 10 mm in height) from the hydrogel and weigh them. Incubate the discs in 50 mL of deionized water with shaking at 25 °C. Repeat three times.\nEvery 30 min remove the sample from the medium, blotter to eliminate the excess of water, and weigh. Calculate the swelling degree using the equation 1 and calculate the equilibrium state of swelling, imgsrc://cloudfront.jove.com/files/ftp_upload/59636/59636eq1.jpg, at 24 h using the equation 2.\nimgsrc://cloudfront.jove.com/files/ftp_upload/59636/59636eq2.jpg)\n\tWhere imgsrc://cloudfront.jove.com/files/ftp_upload/59636/59636eq3.jpg is the weight of the dry hydrogel and imgsrc://cloudfront.jove.com/files/ftp_upload/59636/59636eq4.jpg is the weight of the wet hydrogel.",
    "imgsrc://cloudfront.jove.com/files/ftp_upload/59636/59636eq5.jpg\n4. Electronic Microscopy\nCover a little piece of hydrogel with a thin gold layer (30 s and 10 mA) in a sputter coater.\nPut the sample in a scanning electron microscope (SEM). Analyze the samples under vacuum at 20 kV and take the images with a 500x and 1500x magnification.\n5. Porosimetry\nPlace discs 15 mm in diameter weighing around 0.26 g into the penetrometer (a solid penetrometer, having a bulk volume of 0.3660 mL and 5.7831 mL of stem volume). Analyze the porosity and pore size by Mercury Intrusion Porosimetry (MIP).\nConduct the experiment in the hysteresis mode (intrusion-extrusion). Measure the total intrusion volume (mL/g), total pore area (m2/g), pore diameter (µm), porosity (%), permeability (mDarcy) and tortuosity. Repeat twice.\n6. Drug loading and release\nBefore loading, prepare 4 L of 15 mg/L diflunisal solution and stir overnight. Confirm the concentration of the solution by UV-Vis spectroscopy (initial concentration). Indeed, swell 400 mg of freeze-dried samples of hydrogel in 6 mL of distilled water for 24 h.\nFor loading, fill a flask with 50 mL of diflunisal solution and maintain at 25 °C with constant stirring. Submerge each swelled hydrogel in the flask.\n\t\nTake aliquots of remaining diflunisal solution (2 mL) at different times in order to determine the plateau region of the curve, for example: 3, 6, 24, 27, 30 and 48 h. After 24 h replace the solution with a fresh one.\nMeasure the absorbance at 252 nm of each aliquot, and determine the concentration of diflunisal present in the solution, using a calibration curve of diflunisal. Calculate the amount of diflunisal retained in the hydrogel at 24 and 48 h, as the difference of initial and final concentrations, taking into account the total volume (56 mL).\n\t\nDetermine the encapsulation efficiency (EE) using the equation 3.",
    "imgsrc://cloudfront.jove.com/files/ftp_upload/59636/59636eq6.jpg\nFreeze the loaded hydrogels at -80 °C and lyophilize them at -50 °C.\nFor drug release, submerge 300 mg of freeze-dried diflunisal loaded hydrogels in 50 mL of phosphate buffer (pH 7.4) at 25 °C. Maintain constant stirring. Withdraw aliquots of 2 mL at different times and replace with fresh medium to keep a constant volume.\n\t\nDeterminate the diflunisal released spectrophotometrically at 252 nm, according to a calibration curve.\nDeduce the predominant drug release mechanism in the hydrogels adjusting the drug release data corresponding to the first 60%, to the Korsmeyer-Peppas model (Equation 4), to obtain the kinetic (k) and the diffusion (n) constants. The n values indicate the mechanism of drug release24,25. Then, n values close to 0.5 are related to Fickian diffusion, meanwhile values of 0.5-1.0 for anomalous transport, where are involved diffusion and relaxation chains, and finally, values of 1.0 are related to case II transport.\nimgsrc://cloudfront.jove.com/files/ftp_upload/59636/59636eq7.jpg\nTo confirm the results, use the Higuchi, First order, and Zero order mathematical models (Equations 5 to 7) and select the better fit.\nimgsrc://cloudfront.jove.com/files/ftp_upload/59636/59636eq8.jpg\nimgsrc://cloudfront.jove.com/files/ftp_upload/59636/59636eq9.jpg\nimgsrc://cloudfront.jove.com/files/ftp_upload/59636/59636eq10.jpg\n\t\twhere t represents the release time, Mt the amount of drug delivered at a given time, and M∞ the total amount of drug delivered at the end of the process.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}