{
  "id": 18937,
  "origin_website": "Jove",
  "title": "Protocols for Assessing Radiofrequency Interactions with Gold Nanoparticles and Biological Systems for Non-invasive Hyperthermia Cancer Therapy",
  "procedures": [
    "A complete experimental overview is depicted in Figure 1.\nFurther details are depicted in steps 1-3 below.\n1. Assessing RF Heating of NP Colloids: AuNPs as an Example\nIn general, for each NP sample being investigated, first wash the sample several times through a centrifugation filter with deionized (DI) water to remove background ions and contaminants. All ions and contaminants will have been removed from the AuNP suspension when the liquid being washed out has similar RF heating rates (HRs) as DI water. This purification process also allows for higher concentrations of NPs to be obtained. It is worth noting that although using AuNPs in this example, the fundamental principles can be applied to other NP materials.\nAs an example, purify a 500 ml bottle of commercially available AuNPs of diameter 5 nm and then subject them to a 13.56 MHz RF field of electric-field strength 90 kV/m.\n\t\nTake ~125 ml from the stock AuNP solution and split between six 50 kDa centrifuge filter tubes. Centrifuge at 3,000 rpm. for 2 min 5 sec. Remove filtered buffer and refill filters with more stock solution. Repeat until all 500 ml has been filtered.\nReplace the filtered buffer with a similar volume of DI water and repeat approximately 8 times (or until the filtered buffer RF HRs are equivalent to DI water). Note, UV-Vis analysis can also be used to monitor contaminant absorption peaks. Once the buffer contaminants have been fully removed, pipette approximately 0.5 ml DI water into each filter and resuspend the AuNPs by repeated pipetting. This should completely remove the AuNPs from the filter and allow for full resuspension. Combine all six suspensions into one 15 ml Eppendorf tube.",
    "Once the AuNPs have been purified and concentrated, analyze the sample using ICP-OES and/or ICP-MS, UV-vis and Zeta potential for data on concentration and NP stability, respectively. SEM and/or TEM analysis can also be used to obtain morphological data. Detailed sample preparation for these techniques can be found in the literature4.\nUsing the Kanzius RF system described in previous studies8, or derivations of this system, place a 1.3 ml cylindrical quartz cuvette so that the RF electric-field in air (with no sample present) would be ~90 kV/m inside the cuvette. For a standard saline sample (0.9 % NaCl) the electric-field would be reduced to ~1.1 kV/m. These are the approximate conditions used to allow comparisons to be made between different systems.\n\t\nPipette 1.3 ml of a 1,000 mg/l sample of purified AuNP colloid into the quartz cuvette and introduce this into the RF-field. This can be done by using a custom-built Teflon sample holder. Expose sample to the RF-field for a period of 120 sec or until the sample reaches 70 °C to prevent electrical arcing or rapid boiling. Capture the thermal imaging data (as well as control areas) using an IR camera & associated software. Repeat this procedure three times.\nFilter the sample through another 50 kDa centrifuge filter to extract the AuNPs from the DI water buffer. Re-expose the buffer to the RF-field, again three times. The difference in HRs between the AuNP colloid and the background DI water buffer determines the HR due to the AuNPs themselves. Expect to obtain HRs of ~0.3 °C/sec and 0.05 °C/sec to give an AuNP dependent HR of ~ 0.25 °C/sec. Resuspend the remaining AuNPs from the filter in 1.3 ml water for in vitro/vivo experiments.\n2. Nanoparticle-assisted RF-induced Hyperthermia: In vitro Studies",
    "These in vitro studies can be applied to any type of cancer cell type that form 2D monolayers. In this experiment use human hepatocellular carcinoma derived Hep3B cells.\n\t\nPlate ~50,000 cells in the front three wells of a 12-well plate with 1 ml of growth media. Repeat this 6 times (use three plates for NP studies and three plates as controls). Incubate at 37.5 °C for 24 hr before introducing the NPs. Sterilize NPs first using BioSafety Cabinet UV-light exposure for 5 min.\nInto each well introduce 0.1 ml of a 1,000 mg/L AuNP solution and leave for another 24 hr. Add 0.1 ml of water into each well of the three control cell plates and also leave for 24 hr.\nAfter 24 hr have passed, aspirate the cell media and wash with PBS to remove any surface-bound AuNPs. Replace the cell media. Cells are now ready for RF exposure.\nPlace each 12-well cell pack within the RF-field. Wait until the cells have cooled to 31 °C. Turn on the RF generator and expose for 3.5 min. The final temperature of the cell media will be ~37 °C. Turn off the RF field. Remove the cells and place them in an incubator for 24 hr before analysis.",
    "Remove cells from the incubator and aspirate cell media. Add 1.6 ml of cell media to each well as well at 0.4 ml of MTT reagent. Incubate cells for 4 hr. Aspirate media and replace with 2 ml of Dimethyl sulfoxide (DMSO). Place the cell plates on a bench rocker and leave for 10 min to allow the DMSO to solubilize the MTT reagents. Finally, pipette 100 μl of each well into a 96-well plate and optically read the well at 570 nm using a plate reader such as the SPECTROstar Nano plate reader.\n3. Nanoparticle-assisted RF-induced Hyperthermia: In vivo Studies\nThese in vivo studies can be applied to any type of cancer that forms solid tumors in an orthotopic or ectopic murine model. This experiment uses Hep3B liver cancer cells in an ectopic tumor BALB-C Nude mouse model.\nNote: all in vivo experiments are executed in compliance with all relevant guidelines, regulations and regulatory agencies. Also, the protocol being demonstrated was performed under the guidance and approval of University of Texas M.D. Anderson Cancer Centers Institutional Animal Care and Use Committee (IACUC).\n\t\nGrow an appropriate number of cells (~100 k) in a tissue culture flask with the appropriate growth medium. Incubate in a 37 °C incubator with 5 % CO2 for the duration of cell culture.",
    "Treat cells with trypsin (to detach from the flask) and produce a solution of 2 million cells for every 25 μl. Add an equal quantity of Matrigel (on ice) and mix thoroughly to prepare the final injection solution. Inject this solution into the desired position on the mouse's back and wait an appropriate amount of time for the tumors to grow to the desired size (2-4 weeks for most cells). Before RF exposure, BALB-C Nude mice should bear solid ectopic tumors 0.5-1 cm diameter.\nPrepare the mice to be used (in this case BALB-C Nude mice) by anaesthetizing them with a solution of ketamine and xylazine by IP injection. While the mice are falling asleep, keep them in a temperature controlled chamber at 37 °C. 20 mice in total will be needed, all bearing similar size tumors. Ten mice will be used in conjunction with and without AuNPs (the latter being PBS injections only) while the remaining 10 mice will be split between RF-exposed and non RF-exposed controls: both groups with no AuNP injections.\nOnce properly anaesthetized, inject the AuNPs directly into the tumor using a 1-cc syringe with a 27 G needle. The AuNP solution should be at a Au concentration of 200 mg/L in 0.1 ml of PBS. After injection, use a surgical swab to absorb blood and wipe the injection site with an alcohol wipe.",
    "Then mount the mouse to be treated on the receiving head of the RF generator. The mouse must be positioned so that the tumor is closest to the transmission head. Shield the areas that are not to be treated, as well as sensitive areas such as eyes, ears, and toes, with copper tape. Be sure that the copper tape is appropriately contacting the grounding plane so that no charge buildup occurs. Also, the exposure area must have a gap of at least 1 cm greater than the size of the desired treatment site.\nPosition IR thermal camera so that the tumor and treatment area are visible. Turn on RF for 5 min. Record the resulting temperature curve. If therapy achieves temperatures greater than 42 °C stop treatment immediately.\nAfter RF exposure recover the mice from anesthesia in a warm chamber until they are conscious.\nRepeat the experiment with the same mice 48 hr later (steps 3.3.1 - 3.4.1).\nAfter the experiment, euthanize the mice in accordance with institutional protocols and procedures. Record the weight of the tumor. For histological analysis fix the tumors using formalin and embed them in paraffin. Tumor sections are typically stained with hematoxylin and eosin and for targets relevant to gauging therapeutic efficacy, e.g. Ki-67, cleaved caspase-3, etc.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}