{
  "id": 7358,
  "origin_website": "Bio",
  "title": "An Inexpensive Imaging Platform to Record and Quantitate Bacterial Swarming",
  "procedures": [
    "Part I: Set up the photographing incubator Assemble the camera standSet up the Yaheetech hydroponic tent according to the instruction manual. The manual comes with the product package. Assemble the skeleton first and then cover it with the polyester material.Use M5 bolts and nuts to assemble the camera frame, as illustrated in Figure 1. Connect the Zinc-plated slotted angles first and then the aluminum bars. The slotted angles have holes by the side, but the aluminum bars do not. Drill holes by the ends of the aluminum bars using a hand or table drill. Since the aluminum bars are used to stabilize the structure, their positions do not have to be precise.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4162/bioprotoc-11-18-4162-g001.jpgFigure 1. Schematic showing the structure of the camera frame. Four pieces of 36-in. zinc-plated slotted angle stand perpendicular to the ground and are connected by 10 pieces of 18-in. zinc-plated slotted angle using M5 bolts and nuts. The aluminum bars are to stabilize the whole structure with no specific position requirements. When using the light shield, the distance between the ground and the sample platform is 18 in. When using LED light illumination, the sample platform can be elevated by several inches for photography.Use an acrylic cutter to cut the sides of 18 in. × 18 in. acrylic sheets slightly to fit in the sample platform.Use a circular cutter to cut a circle of 9 inches in diameter out of one of the 18 in. × 18 in. acrylic sheets “A” from the center; leave the other sheet “B” uncut.Fix sheet “A” on the sample platform. Drill the appropriate holes on the side to allow the bolts to go through all the way down to the holes of the slotted angles.Fix the camera on the camera fixer, with its lens facing downward.",
    "Adjust the fixer back and forth to align the camera with the circle on the acrylic sheet.Tape the LED strip around the sample platform 1 inch above the acrylic sheet on the slotted angle. The position of the light cannot be too high because we want to avoid reflections of the light from the plates.Cut two pieces of black cloth, around 20 in. × 20 in. Place one of them on the bottom of the tent as a black photography background. For the other piece, cut a hole in the center to allow the camera lens through, and hang the cloth onto the camera platform to shield the reflection from the top.Place the camera stand inside the tent.Load the batteries into the LCD timer remote control and connect it to the camera through the hole on the top of the tent. Tighten the hole using the elastic cords around it.Make the light shieldCut circles of 3.62 in., 5.75 in., and 9.50 in. diameter out of three pieces of acrylic sheets. Drill 0.25-in. holes in each of the corners, 1.2 in. from both edges. Assemble the light shield according to Figure 2. Place the circular fluorescent light bulb between level I and the sample platform. Stick the starter ballast under the sample platform using tape.Pause point: There are two modes of illumination: one uses a backlight, and the other uses a side light (Figure 3). When taking close-up images of a one-plate event, it is preferable to use the light shield with its own light source below a light sheet. To take photos, place the light shield on the sample platform and align it with the camera. Turn off the LED light when using the light shield.",
    "On the other hand, when taking photos of more than one plate, the light shield is removed, and the uncut 18 in. × 18 in. acrylic sheet is placed on top of the circularly cut sample platform. As many as 9 agar plates can be placed on the uncut sheet for imaging. To take photos, turn on the LED light as the side light source.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4162/bioprotoc-11-18-4162-g002.jpgFigure 2. Image showing a light shield assembly for single-plate imaging. Three pieces of 12 in. × 12 in. a hollow acrylic sheet are connected by four pieces of 12 in. zinc-threaded rod and fixed using hex-plated nuts. The distance between the Level I sheet and the ground is about 1.5 in., leaving just enough space to place the circular fluorescent bulb to fit in. The heights of Level II and Level III can be adjusted to optimize illumination.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4162/bioprotoc-11-18-4162-g003.jpgFigure 3. Taking photos using the light shield or LED light strip. (A) Taking photos using the light shield assembly. The circular fluorescent bulb is placed between Level I and the sample platform (noted in Figure 2). The distance between Level II and Level I is about 0.8 in., while the distance between Level II and Level III is 3.5 in. (B) Taking photos using the LED light strip. The LED light is fixed 1 inch above the sample platform on the horizontal zinc-plated slotted angles. If the light is too strong, one can insert a white paper belt to diffuse and reflect the light. The black cloth near the camera is necessary to block reflections from the plates.Install the temperature and humidity control systemPlace the heat control module inside the tent, on the side at the bottom, such that it will not show up in the swarming photos when using the light shield.",
    "Adjust the temperature setting to the desired temperature for the swarming assay.Set the humidifier outside the tent and connect the power cord to the humidity controller outlet. Extend the extractable plastic mist tube through the hole on the tent wall into the tent beneath the sample platform.Note: Check the camera preview and make sure that the tube and the mist do not show up in the image. Fill the humidifier tank with water. Plug the humidity controller into the power strip, and adjust the humidity value with a tolerance range according to the controller manual. As an example, for Enterobacter sp. SM3 (see the corresponding main article), set the humidity to 40% ± 5% tolerance (tol).Place a 500-ml beaker under the mist tube to collect water droplets.Fix the AC fan on one of the slotted angle legs facing the beaker using the bolts and nuts that come with the fan. The fan is used not only to blow the mist from the humidifier to prevent fog from showing up in the photos but also to improve ventilation and uniformity of the temperature and humidity in the chamber.Tighten all the holes and seal the zip of the tent.Part II: Perform the swarming assay Take the bacteria glycerol stock out of the -80°C freezer. Use a piece of sterilized wooden stick to scratch the bacteria-containing ice surface and then dip the stick into the LB broth. Place the glycerol stock back into the freezer and shake the inoculated LB broth overnight (~16 h) in a shaker. The temperature is set to 37°C and the shaking frequency to 200 revolutions per min (rpm). Start the overnight growth around 5 p.m. so that it will be ready for use around 9 a.m. the next morning.",
    "Use a micropipette to inoculate 2 μl overnight bacterial suspension on the center of each agar plate. Transfer the plates to the incubator after the inoculation drop has been absorbed by the agar (the spread of the circular drop has become nearly invisible).Part III: Time-lapse photo taking and swarming rate quantitation To use the light shield, place one swarming plate inverted on the plate holder. Turn on the fluorescent light bulb and the camera. The LED light strip should stay off.In the preview of the camera, you should see the plate sitting in the center of the screen. Otherwise, move the light shield around to align the camera with the sample.Rotate the nuts on the threaded rod to adjust the position of the acrylic sheets. The distance between the sample platform and Level I is about 1.5 inches. The distance between Level I and Level II is about 0.8 inches, while Level II and Level III are separated by 3.5 inches. If you see a round light spot on the Petri dish, lift Level III slightly. If the Petri dish is too dark, lower Level III slightly. If you cannot get a good image by adjusting Level III, then adjust Level II slightly up or down (see Note 3).Set the camera focal length to 35-65 mm. Adjust the zoom ring so that the sample occupies the full screen but does not exceed the border. Use “M,” the manual mode, to focus on the bacterial colonies. Set the aperture to F5.6-F7.1 and adjust the shutter speed until the resulting exposure value is 0 or -, because overexposed images will result in loss of detail in the images (Figure 4A).",
    "For a multi-plate assay, remove the light shield, turn on the LED light strip, and place the uncut acrylic sheet on the sample platform. Place the swarming plates inverted on the acrylic sheet so that water will not form condensate on the lid. Check the camera preview to make sure that all the plates are within the range of the screen (Figure 4B).Set the frame rate and frame number of the LCD camera timer control according to the manual. For example, in the case of Enterobacter sp. SM3, we set the frame number to 50 and the time interval between frames to 15 min. Press the “start” button to start the time-lapse photo shooting.Zip the tent to form a good seal. The swarming assay may take about 10 h. You can leave the camera on overnight and collect the images the next morning. During the photo taking process, DO NOT shake the incubator; otherwise, the optical setup may be disturbed.Stop the timer controller when the swarming is finished. Download the images by connecting the camera to a laptop using a USB data wire or by pulling out the memory card of the camera and placing it into a computer to download the images.Check the images taken on your computer. If the brightness of the images varies, you can use the “Stack Deflicker” plugin in ImageJ to calibrate the brightness. If the sample position in the images varies over time, you can apply the “Image Stabilizer” plugin to fix it."
  ],
  "subjectAreas": [
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}