{
  "id": 12219,
  "origin_website": "Jove",
  "title": "A Method to Define the Effects of Environmental Enrichment on Colon Microbiome Biodiversity in a Mouse Colon Tumor Model",
  "procedures": [
    "All methods described here were performed in accordance with protocols approved by the Institutional Animal Care and Use Committee (IACUC) at the University of Utah.\n1. Experimental Design and EE and Control Cage Setup\nNote: For reference, an outline of the experimental design is illustrated (Figure 1).\nSet up control (NE) and EE cages (Figure 2).\nTo set up NE cages, use autoclaved conventional control cages (Table 1) that lack enrichment devices.\nFor large cages, drill one hole per cage that is large enough to accommodate a grommet and tunnel (Table of Materials).\nTo set up pup rearing and EE cages, connect two large autoclaved cages with a sterilized grommet secured tunnel and 2 sterilized platforms to increase floor space (Table 1). For EE experiments, provide sterilized running wheels, tunnels, igloos, huts, crawl balls, and nesting material within the EE cages.\nPlace both EE and NE cages in a ventilated rack to provide equal ventilation.\nNote: Two large cages with 2 platforms (Table 1) allow for a maximum of 12 pregnant females per pup rearing setup15 (see Table of Materials, step 3.2 in document, and Table 2).\nFeed mice ad libitum irradiated standard chow and autoclaved reverse osmosis water.\nProvide mice with sterile bedding materials.\nNote: All manipulations of empty cages and cages with animals must be done in the hood to prevent contamination. For cage manipulation of large cages, cover the hole in the cage with an adhesive film.\nPrepare animals for breeding. Group house 15 2-month old females in a single large cage (Table 1) for 2 weeks prior to mating. Separately house 2-month old littermate males for 2 weeks prior to mating.",
    "Note: The number of females for breeding is dependent on the experiment and the number of animals required. In this study, 15 females were utilized to obtain 12 plugged females, which is the maximum number allowed in the pup rearing setup described in 1.1.2 (Table 2).\nFor breeding, combine sire and dam animals, 1 male per 2 females. The first check in the morning should be for vaginal plugs, which may be a visual sign that the animals have mated during the night.\nNote: House males and females together until each female has plugged. A vaginal plug can be identified visually, if it is external.\n\t\nTo detect internalized plugs, a probe is inserted into the vaginal opening and if the vaginal plug is present, the probe is not easily inserted (16; see section 4.3.6).\nNote: Record the morning a plug is detected as ½ day, since the mating occurred in the night.\nOnce females have vaginal plugs, transfer them to a large pup rearing cage for group housing with other mated females (Setup in step 1.1.2 without enrichment devices).\nReplace mated females with new unmated group housed females for mating and continue mating to obtain a maximum number of litters in a 7-day period.\nNote: All animals must have a delivery date within 7 days of each other.\nAllow pregnant females to give birth in group housing so that all litters are raised within one large pup rearing cage (Setup in step 1.1.2 without enrichment devices).\n\t\nKeep track of pup numbers and birthdates, and begin genotyping pups at 7 days of age.\n\t\t\nTattoo pups on their toes at 7 days of age with a number code to identify them13,17.",
    "Clean the toe with 70% ethanol and gently insert a micro-tattoo device containing ink into the skin surface parallel to the toe17 (see Table of Materials).\nCollect tissue with scissors for genotyping from the tail tips by incising a small piece of tissue from 7-day old neonates.\nIsolate genomic DNA from tissue and perform PCR using a conventional HotSHOT method as described in 18.\nSeparate animals by sex at 14-21 days into large cages with mothers.\nNote: Ensure that the older pups are able to feed on their own, and that younger pups continue to nurse until old enough to feed on their own.\nAt 21-28 days, distribute male and female animals separately by genotype into NE or EE environments, making sure to keep equal proportions of each genotype per cage (Figure 2A).\nNote: Ensure that the total number of animals allowed in each NE or EE cage is based on the maximum number allowed by IACUC (Table 2). The NE cages have at most 5 animals (Table 2). In EE cages, for social stimulation, no fewer than 20, and with space restrictions, no more than 41 animals should be allowed in the EE cage (Table 2).\n2. Stool Collection at 16 Weeks of Age\nBegin stool collection 1 to 2 days prior to sacrifice, and separately collect stool on the day of sacrifice during dissection using sterile tools.\nNote: Collecting stool at the same time 1-2 days prior to collection may help to avoid the loss of a sample due to the possibility that no stool is present at the time of collection.\n\t\nTo collect stool from live animals, carefully scruff the animal over a clean cage. Collect stool using sterile forceps into a sterile microfuge tube.",
    "Note: Animals will typically eliminate stool when immobilized, which allows for rapid stool collection directly into a sterile microfuge tube. If an animal does not immediately defecate when immobilized, place it into a clean cage and wait for the animal to defecate (typically up to 1 h).\nCollect stool on the day of sacrifice.\n\t\t\nFor euthanizing the animal, place the animal in a bell jar containing a small container with a cotton ball soaked in isoflurane. Once cessation of breathing is observed (usually after 2 min), lay the animal on its back to allow colon dissection.\nApply 70% ethanol to the mouse abdomen.\nLift the skin anterior to the urethral opening with forceps, and use scissors to cut along the ventral midline until reaching the ribcage, and cut from the base of the first incision towards each leg. Fold back the skin and use scissors to cut through the peritoneal wall in the same pattern.\nUse forceps to grasp the distal colon at the anus to dissect and detach the distal colon from the rectum. While pulling the colon vertically with forceps, use scissors to cut through the mesentery to release the colon.\nCut the colon just below the cecum and lay it on filter paper. Use forceps to lift the top of the colon tube, opening the lumen to allow one side of open scissors to be inserted. Cut longitudinally, distal to proximal, and splay open the colon lengthwise.\nCollect stool from the distal colon into a sterile microfuge tube using sterile forceps.\nStore stool in a microfuge tube at -80 ˚C until time of bacterial DNA isolation.",
    "Note: On the day of sacrifice, in addition to the stool, collect other samples such as whole blood, serum, plasma, normal and tumor tissue from colon and small intestine, microsomes, adipose tissue, etc. to address defined questions in the study.\n3. Genomic DNA Isolation from Stool\nNote: Utilize a commercial kit to isolate microbial DNA from stool following a stool pathogen detection protocol. Remove samples directly for the -80 ˚C freezer and store on dry ice while weighing.\nTransfer up to 220 mg of stool to a clean microfuge tube containing 1.4 mL of room temperature (RT) stool lysis buffer (see Table of Materials).\nVortex sample for 1 min to thoroughly homogenize solids (Figure 2B). Heat the suspension to 95 ˚C for 5 min to lyse all bacteria (including Gram-positive bacteria).\nVortex samples for 15 s and then centrifuge at 20,000 x g for 1 min to pellet the stool solids. Transfer supernatant to a 2-mL microfuge tube. Add one tablet to each sample to absorb PCR inhibitors, vortex until the tablet is dissolved, and incubate the sample at RT for 1 min.\nCentrifuge the sample at 20,000 x g for 3 min and transfer the supernatant to a new microfuge tube. Centrifuge at 20,000 x g for 3 min. Aliquot 15 μL of proteinase K (20 mg/mL stock) into a new 1.5 mL microfuge tube. Pipette 200 μL of the sample into the tube containing proteinase K.\nAdd 200 μL of guanidinium chloride lysis buffer to the tube, vortex thoroughly for 15 s (see Table of Materials) and incubate the sample at 70 ˚C for 10 min. Add 200 μL of ethanol (96-100%) to the tubes and mix well by vortexing.",
    "Place a silica based spin column in a 2-mL collection tube and apply the samples to the column. Close the lid and centrifuge for 1 min at 20,000 x g.\nTransfer the column to a new 2 mL collection tube and add 500 μL of wash buffer 1 to the column, cap the column and centrifuge for 1 min at 20,000 x g. Transfer the column to a new 2 mL collection tube and add 500 μL of wash buffer 2 to the column, close the cap and centrifuge at 20,000 x g for 3 min.\nWith the cap closed, transfer the column to a new 2 mL collection tube, and centrifuge for an additional 1 min at 20,000 x g to remove residual wash buffer. Transfer the column to a 1.5 mL labeled microfuge tube and elute sample by adding 200 μL of elution buffer containing EDTA to the membrane (see Table of Materials).\nClose the cap and incubate at RT for 1 min. Centrifuge the sample for 1 min at 20,000 x g. Discard the column.\n4. DNA Concentration Determination and Sample Preparation for PCR\nNote: Utilize a fluorometer and a commercially available dsDNA fluorescent assay to determine genomic DNA concentration in each sample (see Table of Materials). The fluorescent dye must bind double stranded DNA specifically.\nPrepare a 1:200 dilution of each sample (1 µL of each sample in 199 µL dsDNA master mix) and a 1:50 dilution of standards. Analyze on a fluorometer using the dsDNA setting.",
    "Note: A high volume of DNA in PCR can be inhibitory, therefore, the volume of DNA used must not be more than 10% of the final volume of the PCR. A fluorometer enables accurate measurement of DNA in the sample, as only DNA bound to the fluorescent dye will fluoresce, eliminating the possible contribution of contaminants to the final calculated DNA concentration. This level of accurate quantitation is essential for the downstream sequencing application.\nPrepare PCR templates diluted to 5 ng/μL with the appropriate volume of 10 mM Tris, pH 8.5 to make working template stocks of each sample.\nStore samples at -20 °C.\n5. Design Primers to the 16S Desired V Regions\nDesign primers to selectively amplify the desired V 16S rRNA regions.\nAnalyze primers with Probe Match, from the Ribosomal Database Project19, to determine the approximate hit rate for various phyla.\nNote: For V1-V3 regions, the current study used published primers Bosshard forward20, which bind at position 8 within the V1 region, and 533 reverse21, which binds at position 533 within the V3 region. Primers must include overhang adapter sequences for indexing.\nWhen designing primers, include adapter sequences at the 5' ends of each primer, as recommended for 16S metagenomics sequencing library preparation22 (Table 3).\nSynthesize these large primers with cartridge purification. Reconstitute desiccated primers and dilute a PCR working stock to 1 μM in 10 mM Tris, pH 8.5.\n6. Amplicon PCR to Amplify the V Region(s) with Overhang Adapter Sequences Attached 22\nSet up the amplicon PCR reaction mix as described in Table 4.\nPlace an adhesive clear PCR plate seal on the plate and run the amplicon PCR using the parameters in Table 5.",
    "(Optional) Run amplicon PCR products on an agarose gel or a high sensitivity DNA assay that enables quantitative measurement of amplicon size (see Table of Materials).\nNote: The amplicon size from this study is 550 bp (Figure 3A).\n7. PCR Cleanup Using Magnetic Beads 22\nCentrifuge the amplicon PCR plate quickly at 1,000 x g for 1 min to collect condensation.\nNote: PCR tube strips can be used instead of PCR plates to minimize contamination. Discard tube lids and never reuse.\nVortex the magnetic beads to evenly disperse them, and add 20 μL of magnetic beads to each amplicon PCR well, then pipette the entire volume up and down slowly 10 times.\nIncubate at RT for 5 min. Place the PCR plate on a magnetic stand for 2 min until magnetic beads are collected and the supernatant is clear. Remove and discard the supernatant.\nWash beads with 200 μL fresh 80% ethanol while the PCR plate is on the magnetic stand and incubate for 30 s at RT on the magnetic stand. Carefully remove the supernatant.\nRepeat the wash for a second time. Now, use a fine pipette tip to remove any residual ethanol from the wells and allow air drying for 10 min.\nRemove the PCR plate from the magnetic stand and add 52.5 μL of 10 mM Tris pH 8.5 to each well. Pipette up and down 10 times to suspend beads and incubate at room temperature for 2 min.\nTransfer the PCR plate to the magnetic stand to collect magnetic beads and transfer 50 μL of the supernatant to a clean PCR plate. Place an adhesive clear PCR plate seal on the plate and store at -20 ˚C for up to one week.\n8. Preparation of a Plate Scheme for Index PCR",
    "Note: To generate a V1-V3 library, a second PCR was performed with an index kit (see Table of Materials). A default indexing scheme was used to map out unique dual index combinations for each sample (Figure 3B and 23).\nEnsure that each sample has a unique combination of 2 index primers (i.e., dual indexing).\n9. Perform Index PCR to Attach Barcodes to the Adaptor Sequences as Described 22 .\nTransfer 2.5 μL of PCR amplicons (clean amplicons) to a new 96 well plate and place in an index plate fixture to aid in indexing.\nArrange the index 1 and index 2 primers as in the example of the prepared plate graphic (Figure 3B).\nNote: Visual cues are provided to avoid primer mix-ups: index 2 primer tubes should have white caps and clear solution, while index 1 primer tubes should have orange caps and yellow solution.\nAssemble the index PCR Mix reaction as described in Table 6. Mix by pipetting up and down 10 times.Cover with an adhesive clear PCR plate seal and centrifuge to collect at 1,000 x g at room temperature for 1 min.\nRun the index PCR using the parameters in Table 7.\n10. Purify Final PCR Library\nNote: This PCR clean-up is identical to step 7 above, and uses magnetic beads to perform PCR Clean-Up of the index PCR22.\nCentrifuge the PCR plate from step 10 quickly at 1,000 x g for 1 min to collect condensation.\nVortex the magnetic beads to evenly disperse them, then add 20 μL of magnetic beads to each amplicon PCR well, then pipette the entire volume up and down slowly 10 times to mix.\nIncubate at RT for 5 min.",
    "Place PCR plate on a magnetic stand for 2 min until magnetic beads are collected and supernatant is clear. Remove and discard the supernatant.\nWash beads with 200 μL fresh 80% ethanol while the PCR plate is on the magnetic stand and incubate for 30 s at room temperature on the magnetic stand. Carefully remove the supernatant.\nRepeat the wash for a second time.\nFollowing the second wash, use a fine pipette tip to remove any residual ethanol from the wells and allow air drying for 10 min.\nRemove the PCR plate from the magnetic stand and add 52.5 μL of 10 mM Tris pH 8.5 to each well. Pipette up and down 10 times to suspend beads and incubate at room temperature for 2 min.\nTransfer the PCR plate to the magnetic stand to collect magnetic beads and transfer 50 μL of the supernatant to a clean PCR plate. Place an adhesive clear PCR plate seal on the plate and store at -20 ˚C for up to one week.\n(Optional) Run index PCR products on an agarose gel or a high sensitivity DNA assay that enables quantitative measurement of amplicon size (see Table of Materials).\nNote: The final indexed library size from this study was 668 bp (Figure 3C-D).\n11. Quantify, Normalize, and Pool the Indexed Libraries for Sequencing\nDetermine the DNA concentration of each sample with a fluorometer and a dsDNA fluorescent assay kit (see Table of Materials).\n\t\nPrepare a 1:200 dilution of the sample (1 µL of each sample in 199 µL dsDNA master mix, which includes buffer and reagent) for each of the indexed samples and standards (190 µL dsDNA master mix and 10 µL of standard). Analyze on a fluorometer using the dsDNA setting.",
    "Following the DNA concentration calculation, normalize the libraries by calculating the average library size. Do this by summing adapter lengths, index lengths, and V amplicon size from primers, and view products by agarose gel to be certain the actual size is similar to the calculated size (Figure 3C, see 22).\n\t\nAlternatively, utilize a high sensitivity DNA assay that enables quantitative measurement of DNA integrity, amplicon size, and concentration (Table of Materials, Figure 3D).\nNote: In this study, the average library size was calculated based on summing adapter lengths, index lengths, and V1-V3 amplicon size from primers. The average size was 668 bp.\nConcentrations of samples are normalized using the formula in Table 8.\nDilute samples to 4 nM and pool 5 μL from each 4-nM sample into a single tube for sequencing.\n12. Sequence the Library using a Next Generation Sequencing System and Parse the Data\nSequence the library.\nNote: For this study, the University of Utah High Throughput Genomics Core performed library denaturation and sample sequencing (as described in 6,22).\nParse the data.\nNote: To separate data from pooled samples, index reads were identified and separated (as described in 22).\nGenerate FASTQ files and utilize this for subsequent data analysis.\n13. Analyze Sequenced Data from the 16S Amplicon Library\nNote: This step is performed as described in Bice et al., 20176.\nInstall freely available data analysis tools (see Table of Materials;24).\nAssemble demultiplexed fastq files from the sequenced data (as described in25,26). Discard all unassembled sequences.\nPerform analyses following a de novo open taxonomic unit (OTU) picking protocol (as described in 27).",
    "Bin sequences into a single fastq file by sampleID and group sequences with 97% or greater similarity into OTUs, as described in 28. Align representative sequences of core set with minimum sequence length of 150 and 75% percent identity29,30. Assign taxonomy as described28.\nNote: Samples can be binned and analyzed31, followed by taxonomic assignment and OTU table construction32.\nCreate a mapping file that identifies descriptive names and characteristics of samples to link to sample identification and validate the mapping file33,34.\nMake an OTU network that links OTUs to sample descriptions using a mapping file35.\nCalculate taxonomy summaries in terms of relative abundance by summarizing taxa through plots36.\nExplore alpha diversity of samples at uniform sequencing depth appropriate to samples. To define the appropriate depth for alpha diversity, summarize total counts observed in each sample by using the biome summarize-table command, as described in 37.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}