{
  "id": 6609,
  "origin_website": "Bio",
  "title": "Conjugation of Fab’ Fragments with Fluorescent Dyes for Single-molecule Tracking on Live Cells",
  "procedures": [
    "This procedure describes generation of Fab’ fragments from IgG and their subsequent conjugation to fluorescent dyes (here, we use Qdot), as summarized in Figure 1. We optimized the digestion and reduction schemes using a mouse IgG1, and then applied these procedures (see Note 8) to further optimize the conditions for conjugating Fab’ fragments of an αEGFR antibody (rat IgG2a) with Qdots to perform SMT.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190917/20190917212721_4462.jpgFigure 1. Overview of the procedure with cartoon schematic. The reaction conditions may vary between different antibodies (see Notes 5 and 11).Preparation of acetate digestion buffer and pepsin solutionPrepare acetate digestion buffer (Recipe 1).Prepare a 10 mg/ml pepsin solution in acetate digestion buffer (see Notes 2 and 3). IgG sample preparation (see Note 4)Twist off the bottom closure of a Zeba Spin Desalting Column and loosen cap. Place the column in a 15 ml centrifuge tube.Centrifuge the column at 1,000 x g for 2 min to remove storage solution. Discard the flow-through.Add 1 ml of acetate digestion buffer to the column. Centrifuge at 1,000 x g for 2 min and remove the flow-through. Repeat this step three times.Place the equilibrated column in a 15 ml Protein LoBind Conical Tube. Remove the cap and slowly add 0.5 ml of antibody sample to the center of the resin bed in the column. Be careful not to disturb the resin bed.Replace the cap and centrifuge at 1,000 x g for 2 min. Collect the IgG sample. Figure 2 shows that the total IgG amount was slightly decreased (Lane 2) relative to the original amount (Lane 1) from this buffer exchange step.Pepsin digestion of IgG into F(ab’)2Transfer 0.5 ml of the prepared IgG sample to a 1.5 ml Protein LoBind Conical Tube.For 1 mg/ml IgG, add 2.5 μl of 10 mg/ml pepsin solution to the tube. Antibody/pepsin w/w ratio is 20:1.",
    "Let the digestion reaction proceed for 16 h on a thermo mixer at 37 °C with agitation at 1,000 rpm. This condition can vary for different IgG molecules (see Note 5). The band of ~100 kDa in lane 3 in Figure 2 shows F(ab’)2.Termination of the digestion reaction (see Note 6)Twist off the bottom closure of a Zeba Spin Desalting Column and loosen the cap. Place the column in a 15 ml centrifuge tube.Centrifuge the column at 1,000 x g for 2 min to remove storage solution.Add 1 ml of PBS (pH 7.4) to the column. Centrifuge at 1,000 x g for 2 min and discard the flow-through. Repeat this step three times.Place the equilibrated column in a 15 ml Protein LoBind Conical Tube. Remove the cap and slowly apply 0.5 ml of the digested IgG sample to the center of the resin bed. Be careful not to disturb the resin bed. Pepsin digestion of IgG will be terminated at this step.Replace the cap and centrifuge at 1,000 x g for 2 min to collect the flow-through. See Lane 4 in Figure 2.Purification of F(ab’)2 sampleAllow the NAb Protein A Plus Spin Column and PBS to come to room temperature. Set the centrifuge speed to 1,000 x g.Loosen the top cap on the NAb Protein A Plus Spin Column and snap off the bottom closure. Place the column in a 15 ml centrifuge tube and centrifuge for 1 min to remove storage solution. Disperse the resin by adding 2 ml of PBS. For a 0.5 ml sample, use half of the resin. Equilibrate the resin in the column with 2 ml of PBS. Centrifuge for 1 min and discard the flow-through. Repeat this step once.Cap the bottom of the column with the included rubber cap.",
    "Apply the digestion mixture to the column and cap the top tightly. Resuspend the resin and sample by inversion. Incubate at room temperature on an end-over-end mixer for 15 min.Loosen the top cap and remove the bottom cap. Place the column in a 15 ml Protein LoBind Conical Tube and centrifuge for 1 min. Save the flow-through (this fraction contains F(ab’)2). See Lane 5 in Figure 2.For optimal recovery, wash the column with 0.5 ml PBS. Centrifuge for 1 min and collect the flow-through. Repeat and collect two wash fractions containing additional F(ab’)2 (see Lanes 6 and 7 in Figure 2 and Notes 7 and 8).Measure protein concentration using BCA protein assay.Prepare the BCA reagents and a serial dilution of the protein standard following the manufacturer’s instruction. Mix 200 μl of the BCA reagents with 10 μl of either the standards or the samples collected above. After incubation at 37 °C for 30 min, the color of the mixture will turn from pale green to purple in response to the protein concentration. See Figure 3. Measure the absorbance at 562 nm with a spectrophotometer or a plate reader to estimate the protein concentration by comparison to the standard curve. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190917/20190917212750_6164.jpgFigure 2. SDS-PAGE analysis of samples from each step before and after pepsin digestion of mouse IgG1. Lane 1: The whole IgG1 sample that was originally stored in PBS (pH 7.4). Lane 2: The IgG1 sample after a buffer exchange to bring it to the acetate digestion buffer (pH 4.0). Lane 3: The sample resulting from a 16 h digestion on a thermo shaker at 37 °C (a strong band at ~100 kDa position indicates F(ab’)2). Lane 4: The sample after a buffer exchange to bring it to PBS (pH 7.4) to terminate the reaction.",
    "Lane 5: The flow-through from a Protein A column after a 15-min incubation at room temperature. Lanes 6 and 7: Two consecutive portions collected from washing the protein A column to maximize the output.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190917/20190917212811_4912.jpgFigure 3. BCA assay for determining the protein concentrations after purification. A. The degree of green-to-purple color conversion of BCA solutions is proportional to the protein concentration. B. A standard curve of absorbance (at 562 nm) versus known protein concentrations (y = 0.507x + 0.0188) is used to determine the concentrations of F(ab')2 samples collected from the Protein A column flow-through.Preparation of the separation column for Fab’-Qdot conjugateNote: This segment is a modification of the Qdot® Antibody Conjugation protocol by Invitrogen. Suspend the separation medium (Superdex G200) in the bottle by gentle shaking or vortexing. Ensure the medium is fully suspended before starting column preparation with Pierce disposable columns.Mark the column with two lines, one at 45 mm above the top of the frit, and a second at 55 mm above the frit (Figure 4A).Wet the frit with pure water before loading the media. After ensuring that the separation medium is a uniform suspension, load media into the column with a 1 ml pipette to the second line at the 55 mm mark (Figure 4B) and let it settle into a packed gel bed that is ~45 mm high (Figure 4C).Gently add 0.5 ml distilled water to the top of the gel while maintaining a level bed surface. As the solvent level drops to near the top of the settled gel bed, fill the column with PBS, and allow the PBS level to drip down to just above the top of the gel bed. Repeat this two more times.",
    "Replace the bottom and the top caps when the PBS level from the last fill drops to 2 to 3 mm above the top of the settled gel bed.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190917/20190917212838_7389.jpgFigure 4. Preparation of the separation column. A. The image shows two marks (45 and 55 mm) above the frit. B. The gel suspension fills the column to the upper mark (55 mm). C. The gel settles to the lower mark (45 mm). Activation of Qdot nanocrystals (see Note 9)Prepare a freshly dissolved 20 mM solution of sulfo-SMCC in DMSO. To do this, dissolve 2 mg Pierce No-Weigh Sulfo-SMCC in 229 μl of DMSO.Add 1.75 μl of 20 mM solution of sulfo-SMCC in DMSO to 62.5 μl of an 8 μM stock solution of amino-PEG-QDot605. Vortex briefly.Incubate for 1 h at room temperature with agitation at 500 rpm to activate the Qdots. Avoid light.Prepare desalting columns while the activation step is proceeding.Equilibration of desalting columnsPrepare exchange buffer (see Recipe 2).Label the NAP-5 desalting columns. Mark one with “reduced Fab’” and the other with “activated Qdot”.Remove the top and bottom caps from both columns and allow the storage liquid in the columns to drain. Just as the liquid in each column is approaching the top of the column gel bed, begin adding exchange buffer.Equilibrate each column with 10 ml of exchange buffer.While there is still exchange buffer visible above the gel bed in each column, cap the bottom of each column and set that aside until the F(ab’)2 reduction and activation of Qdot are completed.Generation of Fab’ fragmentsPrepare 100 μg of F(ab’)2 in 300 μl of PBS by dilution or concentration, as necessary.",
    "When the Qdot activation is almost finished, incubate the F(ab’)2 sample with cysteamine (5 mM) and EDTA (2 mM) at 10 °C for 5 min, mixing them at 500 rpm (see Note 8 and 10). The bands in Lane 2 of Figure 5 represent Fab’ (50 kDa) and further reduced fragments (25 kDa); the latter fragments are unlikely to retain antigen binding capacity. To maximize Fab’ yield, we recommend testing various reduction conditions (see Notes 11 and 12) for different F(ab’)2 samples using small aliquots (~5-10 μl each lane) for gel analysis.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190917/20190917212907_5731.jpgFigure 5. SDS-PAGE analysis of F(ab’)2 reduction to Fab’ with cysteamine. Lane 1: The F(ab’)2 sample from Lane 5 in Figure 2. Lane 2: The sample after a reduction with 5 mM of cysteamine for 5 min at pH 7 and 10 °C (see Note 11), before buffer exchange. The band at ~50 kDa indicates Fab’.Desalting and collection of the reduced Fab’ fragmentAdd 40 μl of distilled water to one vial of the dye-labeled marker and mix. This makes enough dye-labeled marker for two conjugation reactions. Store at 2-6 °C when not in use.Add 500 μl of water to a 1.5 ml microcentrifuge tube and mark the outside of the tube at the meniscus. Add another 500 μl of water and make a second mark on the outside of the tube corresponding to a 1,000 μl volume. Discard the water. This tube is used to collect the reduced Fab’ in Step J7 and the activated Qdot nanocrystals in Step K4.When the F(ab’)2 reduction is completed (Step I2), add 20 μl of dye-labeled marker (prepared in Step J1) to the reduced Fab’.Uncap the desalting column labeled “reduced Fab’” and allow the remaining exchange buffer to enter the gel bed.",
    "Immediately following this, add the reduced mixture (prepared in Step J3) to the top of the gel bed.Allow the reduced Fab’ mixture to completely enter the gel.Add 1 ml of exchange buffer to the top of the gel bed to elute the Fab’.Begin collecting reduced Fab’ into a centrifugation tube (marked in Step J2) when the first colored drop elutes (see Figure 6); collect no more than 500 μl (to the lower marked line). imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190917/20190917230613_3670.jpgFigure 6. Collection of the reduced Fab’ fragment from the desalting column. A. One milliliter of exchange buffer was added to the desalting column after the mixture of the reduced Fab’ with the dye marker entered the column completely. B. The first stained drop is being collected in the tube marked in Step J2.Desalting and collecting the activated Qdot nanocrystalsUncap the desalting column labeled “activated Qdot”. Allow remaining exchange buffer to enter the gel bed. Immediately after this, add the activated Qdot nanocrystals (from Step G3) to the top of the gel bed.Allow the activated Qdot nanocrystals mixture to completely enter the gel bed.Add 1 ml of exchange buffer to the top of the gel bed to elute the Qdot nanocrystals.When the first drop of colored material elutes from the column, begin collecting directly into the centrifugation tube containing the reduced and desalted Fab’. See Figure 7.Stop collecting when the final volume reaches 1 ml (up to the top line marked in Step J2; 500 μl of activated Qdot nanocrystals).Mix briefly.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190917/20190917230650_4060.jpgFigure 7. Collection of the activated Qdot from the desalting column. A. One milliliter of exchange buffer was added to the desalting column after the activated Qdots completely entered the gel. B. The first stained drop is being collected in a tube.",
    "Conjugation reactionAllow the reduced Fab’ and activated Qdot nanocrystals to react for 2 h at room temperature. Avoid light.Concentrating the sampleSplit the volume (from Step L1) into two protein concentrators.Concentrate each volume to ~20 μl by centrifuging at 4,000 x g for 15 min. If the volume is > 20 μl after the centrifugation, continue centrifuging for another 5 min.Separation of the Qdot-conjugated Fab’ from unconjugated Fab’Uncap the separation column (from Step F6) and allow the remaining PBS to enter the gel bed by gravity. Immediately following this, add the concentrated conjugate reaction solution combined from the two protein concentrators (~40 μl total volume) to the top of the column. Avoid disturbing the gel bed.Allow the conjugate reaction solution to enter the gel and then gently add 50 μl PBS. Let this buffer run into the gel bed.Gently fill the reservoir above the column with PBS and allow the sample to elute by gravity. Visually monitor the “dead space” between the frit and the column tip.When color appears in the “dead space,” collect only the first 8-10 drops of colored solution in a centrifugation tube. See Figure 8. Determine the Qdot concentration by absorbance measurements at the first absorption peak of the Qdot.Bring the final conjugate pool to 50% v/v of glycerol and store at 4 °C.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190917/20190917230713_6472.jpgFigure 8. Collection of the Qdot-conjugated Fab’ from the separation column. A. The separation column is filled with PBS after the conjugation mixture completely enters the column. B. The collection of the eluate begins when the color appears in the dead space.Single-molecule tracking of EGFR on live cells using αEGFR Fab’-Qdot605 conjugatesDigest αEGFR antibodies into F(ab’)2 using pepsin [20:1 antibody/pepsin (w/w ratio)] in acetate digestion buffer (pH 4.",
    "0) at 37 °C for 16 h with agitation, followed by a Protein A column purification (Figure 9A).Reduce the resulting F(ab')2 to Fab' with 5 mM cysteamine at 10 °C for 5 min (Figure 9B).Conjugate Fab’ with activated Qdot605 for generating αEGFR Fab’-Qdot605 conjugates.Allow 2 nM conjugates in the full growth medium to bind to target proteins (EGFR) for 10 min at room temperature on live cells (MDA-MB-468 breast cancer cell line that overexpresses EGFR) plated on glass bottom dishes. Wash three times with full growth medium (See Note 13).Perform single-molecule tracking (SMT) (we followed the methods described in Chung and Mellman, 2015; Chung, 2017) with light excitation at 488 nm using the TIRFM on an inverted microscope with a 100x/1.49NA Plan Apo objective. Image acquisition was done at ~11 Hz using an EMCCD camera. One snapshot image of individually labeled Qdots that was rendered using ImageJ is shown in Figure 9C.Estimate the binding specificity of the conjugates by determining the density of bound conjugates after saturating the epitope binding with original antibody (~100 times the Kd will suffice), relative to the density without the saturation. The binding specificity of the Fab’-QD conjugates was ~89%.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190917/20190917230735_7915.jpgFigure 9. Generation of Fab’-Qdot conjugates for SMT using αEGFR antibodies (IgG2a). A and B. An αEGFR IgG2a was used to demonstrate the applicability of the Fab’-Qdot605 conjugates in SMT on live cells. SDS-PAGE analyses of the pepsin digestion (A) and cysteamine reduction (B) of αEGFR rat IgG2a. (B) The Fab’ throughput of the IgG from the reduction showed similar dependencies to changes of temperature, cysteamine concentration, and pH to those for the mouse IgG1 F(ab’)2 shown in Figure 5 (see Note 11). C. One snapshot (10.",
    "72 Hz) SMT image (488 nm illumination, 100x oil objective) by a total internal reflection fluorescence microscope (TIRFM) after labeling EGFR with the αEGFR Fab’-Qdot605 conjugates on ~ 60% confluent MDA-MB-468 cells."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Biochemistry",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}