{
  "id": 19822,
  "origin_website": "Wiley",
  "title": "Efficient Electrotransformation of Bacillus thuringiensis for Gene Manipulation and Expression",
  "procedures": [
    "In this protocol, we describe preparation of super-competent B. thuringiensis cells for transformation by electroporation (Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.588#cpz1588-prot-0002]). Briefly, cells are grown to approximately mid-exponential phase, followed by addition of a glycine solution to a final concentration of 2%. After 1 hr of incubation with glycine, the cells are harvested, thoroughly washed, resuspended in an electroporation solution, and flash-frozen. Aseptic techniques are strictly followed throughout this procedure.\nMaterials\nB. thuringiensis (subsp. kurstaki) strain (GEVI1716, acquired from Prof. Henri De Greve's lab, VUB, Belgium)\nLB agar (or blood agar) plates (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.588#cpz1588-rec-0005])\nBrain-heart infusion (BHI) broth (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.588#cpz1588-rec-0002]), 30°C\n20% (w/v) glycine solution (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.588#cpz1588-rec-0004]), 30°C\nWashing/electroporation solution (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.588#cpz1588-rec-0009]; make fresh)\n95% to 100% ethanol (Antibac, #600068)\nDry ice\n1-µl inoculating loops (VWR, #89126-808)\n30°C incubator (e.g., FRIOCELL 222-Eco line)\nSterile 50-ml conical tubes (Falcon, #352070)\nVortex (e.g., Stuart SA8)\n30°C shaking incubator (e.g., Innova 42 incubator shaker series)\n500-ml Erlenmeyer flasks (VWR, #1214-1133)\nSpectrophotometer (e.g., Ultraspec 10 cell density meter, Biochrom)\nCuvettes (e.g., Brand UV cuvette micro, Merck, #BR759220)\nStandard tabletop centrifuge (e.g., Heraeus Megafuge 16, Thermo Scientific)\nStyrofoam box or another suitable container\nLow-temperature thermometer (e.g., FLUKE 51 II digital thermometer, RS, #353-4449)\nSterile 1.5-ml microcentrifuge tubes (Eppendorf AG, #0020125.150)\n1.5-ml tube rack\nCAUTION: Work in a well-ventilated area and avoid inhaling fumes generated from the dry ice during preparation of the dry ice/ethanol bath (see steps 8 and 11). Avoid frostbite by using insulated gloves when handling dry ice or supercooled ethanol and wear safety glasses.\nNOTE: Note that steps 1 to 5 require strict sterile conditions, and therefore, inoculation and pipetting are preferably carried out inside a Class II biosafety cabinet (e.g., NinoSAFE class II).\nCultivate Bacillus strain to exponential phase",
    "1. To prepare a starter culture, streak out B. thuringiensis (subsp. kurstaki) strain from a −80°C glycerol stock onto an LB agar (or blood agar) plate using a 1-µl inoculating loop and incubate at 30°C.\n2. The next day, make an overnight culture by transferring a single colony into 10 ml pre-warmed (30°C) BHI broth in a 50-ml conical tube and mix well by vortexing. Incubate overnight at 30°C with shaking (200 rpm) in a shaking incubator.\n3. Prepare a larger culture by transferring 1 ml overnight culture into 100 ml pre-warmed (30°C) BHI broth in a 500-ml Erlenmeyer flask and incubate at 30°C with shaking (200 rpm).\n4. Monitor bacterial growth by measuring the optical density at 600 nm (OD600) regularly by removing 0.5 to 1 ml culture aseptically every 0.5 to 1 hr and measuring the absorbance using a spectrophotometer and cuvettes (Fig. 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.588#cpz1588-fig-0001]). Use sterile BHI broth as a blank.\nBe aware that the OD600 may suddenly exceed 0.6. Therefore, it may be necessary to measure the OD600 every 10 to 15 min after the OD600 has reached ∼0.4.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/4e89a290-7b3d-4646-8359-f880ffce27b1/cpz1588-fig-0001-m.jpg</p>\nFigure 1\nGrowth curve of B. thuringiensis (subsp. kurstaki). First, 1 ml overnight culture was inoculated into 100 ml BHI broth and incubated at 30°C with shaking at 200 rpm. The absorbance (OD600) was measured every 0.5 to 1 hr. Errors bars depict standard deviations (SDs) from two independent batches. When the OD600 was ∼0.6, glycine was added to a final concentration of 2%.\nAdd glycine solution\n5. When the OD600 reaches about 0.5 to 0.7, add pre-warmed (30°C) 20% glycine solution to a final concentration of 2% to the culture and continue incubating at 30°C and 200 rpm for one more hour.",
    "It takes approximately 3 to 4 hr to reach an OD600 of 0.5 to 0.7 for the B. thuringiensis strains we tested.\nFor ∼96 ml volume of culture, add ∼10.6 ml of 20% glycine.\nHarvest and wash cells\n6. To harvest cells, divide the approximately 100- to 106-ml culture into multiple sterile 50-ml conical tubes and centrifuge 10 min at 1690 × g at room temperature. Discard supernatant.\nDuring steps 6 to 11, aim to work quickly. When possible, minimize vortexing.\n7. Wash cell pellets three times using washing/electroporation solution:\n         \nResuspend cells in 10 ml solution per tube by pipetting up and down or by gentle vortexing.\nOnce resuspended, combine samples into one 50-ml conical tube and adjust volume to 40 ml with the same solution.\nCentrifuge 5 min at 3005 × g at room temperature and discard supernatant.\nRepeat resuspension (in 40 ml) and centrifuge as in step 7c two more times.\nRemove any traces of supernatant by pipetting.\nBe aware that the cell pellet could be loosely attached to the tube because of the glycerol.\n8. During one of the centrifugations in step 7, prepare a dry ice/ethanol bath in a styrofoam box or another suitable container by mixing 95% to 100% ethanol and pieces of dry ice. Continue adding dry ice until temperature is below −70°C, monitoring the temperature with a low-temperature thermometer.\nThe dry ice/ethanol bath should be prepared approximately 15 to 20 min prior to step 9 to allow sufficient time for cooling of the ethanol. The temperature of the dry ice/96% ethanol bath can reach as low as about −75°C.\nResuspend cells in washing/electroporation medium, snap-freeze, and store\n9. Resuspend cell pellet in ∼1 ml washing/electroporation solution by pipetting up and down.\n10. Aliquot 100 μl cells into sterile 1.5-ml microcentrifuge tubes.",
    "At this stage, the competent cells can be used directly for electrotransformation, or they can be stored after snap-freezing (see step 11).\nFrom 100 ml culture, we get 10 to 12 aliquots of competent cells. If you need more competent cells, run a parallel culture.\n11. Snap-freeze cells by submerging the cell aliquot tubes in a 1.5-ml tube rack in the dry ice/ethanol bath (see step 8) for ∼5 min. Store at −80°C until use.\nCompetent cells must be frozen immediately and stored at or below −80°C. Snap-freezing improves cell viability by reducing the formation of ice crystals during freezing.",
    "In this protocol, a plasmid DNA construct is electroporated into the B. thuringiensis competent cells prepared in Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.588#cpz1588-prot-0001]. The shuttle vector pMAD has been used for genetic manipulation of Gram-positive species, including B. cereus, Staphylococcus aureus, and Listeria monocytogenes (Arnaud, Chastanet, & Débarbouillé, 2004[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.588#cpz1588-bib-0002]). A slightly modified version of pMAD, pMAD-I-SceI, in which a restriction site for I-SceI has been inserted to promote double crossover (Janes & Stibitz, 2006[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.588#cpz1588-bib-0007]; Lindbäck et al., 2012[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.588#cpz1588-bib-0008]), has been widely used for genetic manipulation of B. thuringiensis, B. cereus, and B. licheniformis (Borch-Pedersen et al., 2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.588#cpz1588-bib-0004]; Lindbäck et al., 2012[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.588#cpz1588-bib-0008]; Pradhan et al., 2021[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.588#cpz1588-bib-0015]). In this protocol, we electroporate the pMAD-I-SceI-Δena2B construct, which contains the start and stop codons of the ena2B (ATGTAA) gene (Pradhan et al., 2021[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.588#cpz1588-bib-0015]) flanked by 577-bp upstream and 634-bp downstream homology sequences (Fig. 2A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.588#cpz1588-fig-0002]), into B. thuringiensis.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/4edae1cc-dcbf-4646-a2e7-d28b002a2bdc/cpz1588-fig-0002-m.jpg</p>\nFigure 2\nPlasmid maps of the constructs used in transformation experiments. (A) pMAD-Δena2B. (B) pHT315. The plasmid maps were prepared using SnapGene® Version 6. The plasmid map of pHT315 was obtained from http://mbio.bas-net.by/cager/en/cloning-vectors/38-pht315.html[href=http://mbio.bas-net.by/cager/en/cloning-vectors/38-pht315.html].\nThe plasmid pHT315 is a low-copy-number shuttle vector derived from B. thuringiensis (Fig. 2B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.588#cpz1588-fig-0002]). It is stably maintained in B. thuringiensis and B. cereus (Arantes & Lereclus, 1991[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.588#cpz1588-bib-0001]) and has hence been widely used for gene expression from plasmids in various Bacillus spp. (Borch-Pedersen et al., 2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.588#cpz1588-bib-0004]; Pradhan et al., 2021[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.588#cpz1588-bib-0015]; Wang et al., 2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.588#cpz1588-bib-0021]). In this protocol, we also transform B. thuringiensis with pHT315 to demonstrate the enhancement of electrocompetence resulting from supplementation of the growth medium with 2% glycine. The plasmid maps used for the transformation and the corresponding DNA sequences of the DNA fragments are shown in Figure 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.588#cpz1588-fig-0002] and the Supporting Information (Files 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.588#support-information-section] and 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.588#support-information-section]), respectively.\nMaterials",
    "Shuttle plasmid construct of interest [e.g., pMAD-I-SceI-B. thuringiensis Δena2B (10,894 bp; available from Prof. Marina Aspholm's lab on request); pHT315 (6531 bp; Center of Analytical and Genetic Engineering Research, Institute of Microbiology, the National Academy of Sciences of Belarus, #038.A.I3-4)]\nOne ShotTM INV110 chemically competent Escherichia coli (Thermo Fisher Scientific, #C717103)\nLB-ampicillin (100 µg/ml) agar plates (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.588#cpz1588-rec-0006])\nOne ShotTM Top10 chemically competent E. coli (Thermo Fisher Scientific, #C404010)\nQIAprep Spin Miniprep Kit (Qiagen, #27115)\nNuclease-free water (Qiagen, #129117)\nB. thuringiensis (subsp. kurstaki) competent cells (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.588#cpz1588-prot-0001])\nBHI broth (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.588#cpz1588-rec-0002])\nLB-erythromycin (5 µg/ml) agar plates (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.588#cpz1588-rec-0008])\nLB-erythromycin/X-gal agar plates (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.588#cpz1588-rec-0008]; make fresh)\n2× Dream Taq PCR master mix (Thermo Scientific, #K1071)\npMAD primers (5'-3') (10 µM):\n               \nForward: CCATCAGACGGTTCGATCTT\nReverse: GTCCCTGATGGTCGTCATCT\npHT315 primers (5’-3’) (10 µM):\n               \nForward: GGAGAAAATACCGCATCAGG\nReverse: TTTATGCTTCCGGCTCGTAT\n30°C and 37°C incubators (e.g., FRIOCELL 222-Eco line)\n1-µl inoculating loops (VWR, #89126-808)\nMicro-volume spectrophotometer (e.g., mySPEC, VWR, #732-2533)\nHorizontal electrophoresis system (e.g., Mini-Sub Cell GT, Bio-Rad, #1704406)\nGel imaging instrument (e.g., C300, Azure Biosystems)\nElectroporation cuvettes, 0.2-cm gap (Gene Pulser, Bio-Rad, #1652086)\nElectroporator (e.g., Eppendorf Eporator)\nSterile 5-ml centrifuge tubes (VWR, #525-0666)\n30°C and 37°C shaking incubators (e.g., Innova 42 incubator shaker series)\nSterile 1.5-ml microcentrifuge tubes (Eppendorf AG, #0020125.150)\nVortex (e.g., Stuart sA8)\nMicrowave oven (e.g., Electrolux)\nPCR tubes (SARSTEDT, #72.991.002)\nThermocycler (Veriti Thermal Cycler, Thermo Fisher Scientific)\nAdditional reagents and equipment for 0.7% and 1% agarose gel electrophoresis (see Current Protocols article: Voytas, 2000[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.588#cpz1588-bib-0020]), such as agarose (Lonza, #50004), gel stain (SYBR® Safe DNA gel stain, Invitrogen, #S33102), gel-loading dye (NEB, #B7024S), and a DNA ladder (GeneRuler 1 kb, Thermo Scientific, #SM0313)\nNOTE: Experiments involving PCR require careful technique to prevent contamination. Use DNase-free pipet tips.\nPrepare unmethylated DNA",
    "1. Transform shuttle plasmid construct of interest (e.g., the pMAD-I-SceI-Δena2B or pHT315 construct) into One-ShotTM INV110 chemically competent E. coli cells according to the manufacturer's recommendations. At the last step, plate on an LB-ampicillin (100 µg/ml) agar plate. As a control, prepare methylated DNA by transforming plasmid of interest into One ShotTM Top10 chemically competent E. coli.\nUnmethylated plasmid constructs are often required for efficient transformation of B. thuringiensis (Macaluso & Mettus, 1991[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.588#cpz1588-bib-0010]). To prepare unmethylated DNA, the plasmid construct of interest needs to be propagated in E. coli strains deficient in DNA adenine methylase (Dam) and DNA cytosine methylase (Dcm), such as One-ShotTM INV110 E. coli cells (Thermo Fisher Scientific) or Dam-/Dcm- competent E. coli (NEB, #C2925).\n2. Pick one transformant colony and streak it onto an LB-ampicillin (100 µg/ml) agar plate. Incubate overnight at 37°C.\n3. Take approximately two loopfuls of cells (using a 1-μl inoculating loop) from agar surface and purify plasmid with a QIAprep Spin Miniprep Kit according to the manufacturer's recommendations. At the last step, use about 30 to 35 µl nuclease-free water to elute the plasmid DNA.\n4. Measure concentration of the plasmid DNA using a micro-volume spectrophotometer.\nIf the DNA concentration is too low, consider concentrating or purifying again. The ideal target volume is about 2 to 5 µl (about 1 to 2 µg DNA) per transformation.\n5. Check quality of the purified DNA by performing 0.7% agarose gel electrophoresis (Fig. 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.588#cpz1588-fig-0003]) using a horizontal electrophoresis system and gel imaging instrument.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/286fec54-4f4a-4c33-bc8a-3c8aa1f667a4/cpz1588-fig-0003-m.jpg</p>\nFigure 3",
    "Agarose gel analysis of plasmid DNA constructs used in transformation experiments. About 200 ng DNA was applied to a 0.7% agarose gel stained with SYBR® Safe DNA gel stain (Invitrogen) and separated at 100 V for 50 min. M, methylated DNA propagated in Top10 E. coli (Thermo Fisher Scientific); U, unmethylated DNA propagated in INV110 E. coli (Thermo Fisher Scientific).\nPerform electroporation\n6. Chill electroporation cuvettes on ice prior to electroporation.\n7. Thaw an aliquot of B. thuringiensis (subsp. kurstaki) competent cells from −80°C freezer on ice for ∼5 min.\n8. Add 1 to 2 µg plasmid DNA (2 to 5 µl) from step 3 into tube containing the competent cells and gently flick side of the tube a few times to mix. For a negative-control tube, add an equivalent amount of nuclease-free water.\n9. Incubate DNA/cell mixture for 1 to 2 min on ice.\n10. Transfer DNA/cell mixture to the pre-chilled electroporation cuvette from step 6. Avoid air bubbles during pipetting.\n11. Wipe surface of the electroporation cuvette with a paper towel.\n12. Pulse at ∼11 kV/cm (∼5 ms) with an electroporator.\nFor a 0.2-cm-gap cuvette, this corresponds to 2200 V.\n13. Immediately add 500 µl room-temperature BHI broth and transfer into a sterile 5-ml centrifuge tube.\nYou may use a 200-µl gel-loading pipet tip (Corning, #CLS4884-400EA) to pipet any remaining sample into the electroporation cuvette.\n14. Allow cells to recover by incubating at 30°C (for pMAD constructs) or 37°C (for pHT315) for 3 to 3.5 hr with shaking (200 rpm) in a shaking incubator.\n15. Make serial dilutions (1:10) using BHI broth for pHT315 transformation and plate cells on an LB-erythromycin (5 µg/ml) agar plate.\nFor blue-white screening of pMAD transformants, prepare LB-erythromycin/X-gal agar plates (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.588#cpz1588-rec-0008]) prior to plating the cells.\nVerify transformation by colony PCR",
    "16. For pMAD constructs, select a few isolated blue colonies (Fig. 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.588#cpz1588-fig-0004]), transfer them to new LB-erythromycin/X-gal agar plates, and incubate overnight at 30°C. For pHT315 transformants, select a few isolated colonies, transfer them to new LB-erythromycin agar plates, and incubate overnight at 37°C.\nAmong pMAD transformants, the light blue colonies may represent clones with a single crossover of the vector (Arnaud et al., 2004[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.588#cpz1588-bib-0002]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/2b838e56-ba19-4ff3-afe0-30fe773cce09/cpz1588-fig-0004-m.jpg</p>\nFigure 4\nBlue/white screening of pMAD transformants on LB-erythromycin/X-gal agar plates. The picture shows blue colonies of B. thuringiensis transformed with pMAD-Δena2B after incubation for 2 days at 30°C.\n17. Prepare cell lysates by transferring a tiny amount of cells, using a 1-µl inoculating loop, into sterile 1.5-ml microcentrifuge tubes containing 100 µl nuclease-free water. Vortex well and boil in a microwave oven for 3 min at 900 W.\nUse untransformed B. thuringiensis cells as a negative control.\n18. To run colony PCR on the transformants, prepare the following PCR mixture in a PCR tube, with pMAD or pHT315 primers:\n         \ntable:\n﻿0,1\nComponent,Volume (µl)\n2× Dream Taq PCR master mix,12.5\nForward primer (10 µM),0.5\nReverse primer (10 µM),0.5\nCell lysate (step 17),2\nNuclease-free water,9.5\nTotal,25\n19. Run PCR using a thermocycler according to the manufacturer's recommendations. For the pMAD and pHT315 primers, follow the thermal cycling conditions below:\n         \ntable:\n﻿0,1,2\nInitial step:,2 min,95°C\n30 cycles:,30 s,95°C\n,30 s,52°C\n,1.5 min,72°C\n1 cycle:,5 min,72°C\nFinal step:,indefinitely,4°C.\n20. Resolve PCR products by 1% agarose gel electrophoresis for 1 hr at 100 V.\nExpected PCR products from transformants are 1792 bp (pMAD-Δena2B) and 320 bp (pHT315) (Fig. 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.588#cpz1588-fig-0005]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/9dd5f4c8-9ebf-41d8-b2a5-91d781be9790/cpz1588-fig-0005-m.jpg</p>\nFigure 5",
    "Screening of pMAD and pHT315 transformants using colony PCR. (A) Seven blue colonies (lanes 1-7) and a white colony (lane 8) were randomly selected, transferred to new LB-erythromycin/X-gal agar plates, and incubated overnight at 30°C. Lysates were prepared in nuclease-free water, and 2 μl was added per PCR tube containing pMAD primers and Dream Taq PCR master mix (Thermo Scientific). (B) Screening of pHT315 transformants with PCR. Colony PCR was conducted on four randomly picked colonies as described in (A) using pHT315 primers. Lysate from an untransformed B. thuringiensis colony was used as a negative control (lane 5). The PCR products were separated using 1% agarose gel electrophoresis at 100 V for 50 min. Expected band sizes are 1792 bp and 320 bp for pMAD-Δena2B (A) and pHT315 (B), respectively."
  ],
  "subjectAreas": [
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}