{
  "id": 9371,
  "origin_website": "Jove",
  "title": "Deep Brain Stimulation with Simultaneous fMRI in Rodents",
  "procedures": [
    "Ethics Statement: This procedure is in accordance with the National Institutes of Health Guidelines for Animal Research (Guide for the Care and Use of Laboratory Animals) and is approved by the University of North Carolina Institutional Animal Care and Use Committee.\n1. Electrode Implantation\nThe first step is electrode implantation. In this step, an electrode is unilaterally implanted into the subthalamic nucleus (STN), a small nucleus with translational significance for Parkinson’s disease treatment using the following methods:\nSterilize all surgical equipment using an autoclave, or antiseptic solution where autoclaving is not possible (e.g. for electrode sterility). Note: this is a short-term survival surgery, and thus aseptic technique is essential. Following surgery, animals can be imaged after a brief recovery period (48 hr) or up to several weeks later.\nAnesthetize the rat (Adult Sprague-Dawley rats 250-400 g) using 2.5% isoflurane administered via endotracheal intubation and a small animal ventilator. Fix the rat to a stereotactic surgical frame and prepare the surgical site using aseptic techniques.\nPrepare and ensure that the electrode is sterile. A homemade 2-channel tungsten microwire electrode is used for this procedure, though many MRI-compatible electrode types will work. The electrode type used may affect the area of tissue mechanically damaged by the procedure, the area of tissue stimulated, and the accuracy of implantation, thus affecting the overall experimental result. If the electrode type is not able to be autoclaved, use povidone-iodine antiseptic to sterilize the electrode as far as is possible.\nUsing scissors remove the scalp over the site of implantation with a diameter of approximately 1.5 cm, to uncover bregma and lambda on the skull. Remove the muscle and fascia overlying the skull and stop all bleeding using electrocautery.",
    "Scratch the skull surface in multiple directions with a scalpel to improve dental cement adhesion (step 1.8). Level Bregma and Lambda in the horizontal direction.\nTo target STN, at 3.6 mm posterior to Bregma and 2.5 mm lateral to midline, use a small-tipped electric drill to create a burr hole measuring approximately 1.5 mm in diameter. Note: The exact location of the STN in reference to stereotaxic coordinates may vary by rat strain, weight, and gender. Adult rats of the same gender should be used to minimize any variation in location. If possible, pre-operational anatomical scans or intraoperative electrical recordings should be used to identify the STN location on an individual subject basis. Further, electrode termination sites should be histologically verified to ensure target accuracy.\n\t\nCarefully make an incision in the dura, and use small blunt forceps to move the dura to the sides of the hole. Stop any bleeding using sterile cotton soaked in saline. Create holes for one or more MR-compatible screws) and insert them gently in the skull until they are stable. Screws may be placed in any location where they will not disrupt the placement of the external connector for the DBS electrode (e.g. not directly behind the STN ipsilateral to the electrode). We recommend placements at the lateral edges of the skull, ideally directly posterior to the lambda suture. At this point, the skull is relatively thick, reducing the likelihood that screws will damage the cortex.” Note: Brass screws cut to 4-5 mm in length are used in this protocol, although plastic screws are also suitable.",
    "Place the electrode on the stereotactic arm, ensuring that it is straight and vertical. Touch the electrode to Bregma, then move the electrode exactly 3.6 mm posterior to Bregma and 2.5 mm lateral to midline and touch the cortical surface with the electrode. From the cortical surface, insert the electrode 7.8 mm ventrally. These coordinates are determined by reference to a neuroanatomical atlas1.\nPlace a layer of dental cement over the skull including the skull screws and electrode insertion point. Wait until the cement is completely hardened prior to removing the electrode from the stereotactic frame. Bend the electrode backward and use additional cement to cover the rest of the electrode tract and connector for durability.\n2. fMRI Preparation\nThe second step is the setup for fMRI, including positioning of the coil and setup of physiological monitoring equipment.\nSecure the animal’s head to prevent motion during the scan. Note: A custom plastic intraauricular bar system is used here for head fixation. Place the bars into the ear canals and secure to the headpiece so that the head rotates smoothly in the vertical direction with no horizontal rotation. Secure the head position by fixing the upper teeth to the apparatus.",
    "Anesthetize the rat completely and monitor end tidal CO2 to ensure stability throughout all scans. To maintain anesthesia, ventilation and control end tidal CO2 levels during the scan, an MR-compatible small animal ventilation system combined with an isoflurane vaporizer is used here, though a variety of anesthetic and sedation agents may be used in a similar fashion. Set the ventilator to 45 breaths/min with a moderate volume, approximately 500 ml/min of air as a starting volume. Set the isoflurane to 2% and transfer the rat into the scan room. Attach the ventilator’s output to the rat’s endotracheal tube and press firmly to secure. Capnometry should be acquired using a tube connected as closely to the endotracheal tube connector as possible. Adjust ventilation volume to produce an end-tidal CO2 of 2.6% to 3.3%.\nUse an MR-compatible small animal holder to insert the rat into the scanner with a circulating hot water bath for temperature control. Tape the pad of the bath onto the holder and cover it with clean absorbent paper. Place the rat onto the hot water bed.",
    "Monitoring of temperature and carbon dioxide levels are essential to BOLD fMRI, while arterial oxygen saturation and heart rate are also useful physiological parameters. Insert an MR-compatible rectal temperature probe and tape it to the base of the tail, and then adjust the temperature of the water bath to maintain normal body temperature at 37 °C. Monitor arterial oxygen saturation and heart rate using a small animal pulse oximetry system, maintaining them at 95-98% and 250-350 bpm, respectively, which may vary depending on the type of anesthetics used. Oxygen saturation and heart rate are both influenced by depth of anesthesia, ventilation volume and ventilation rate. Ventilation volume and rate may need to be carefully balanced to maintain adequate end-tidal CO2 levels and adequate oxygen saturation.\nA surface coil is needed for BOLD fMRI acquisition. Place the surface coil as close to the surface of the head as possible. Once secured, place toothpaste on the surface of the head on the cement cap in order to reduce susceptibility artifacts near the brain surface. Note: We use a homemade transceiver surface coil with an internal diameter of approximately 1.6 cm, though larger surface coils may be used to optimize the BOLD response in deeper subcortical regions.\nConnect the stimulating electrode to a programmable electrical stimulator system. Note: We use a custom-made programmable TTL triggering system connected to a bipolar stimulator to deliver electrical pulses synchronized to the RF excitations from the MR scans.",
    "For sedation and paralysis during fMRI data acquisition, use a cocktail of dexmedetomidine (0.1 mg/kg/hr, i.p.) and pancuronium (1 mg/kg/hr, i.p.), combined with low dose isoflurane at 0.5% to prevent epileptic activity2. For drug infusion, an MR-compatible syringe pump must be used if the pump is to be placed in the magnetic environment. Alternatively, a noncompatible pump may be placed outside the magnetic environment provided that extended catheter tubing is used.\n3. fMRI Data Acquistion\nThe third step is fMRI acquisition, including positioning, shimming, anatomical scans, and functional scans. A 9.4 Tesla system with a homemade surface coil is used here, though this technique may be adapted to other high-field systems and commercially made MRI coils.\nInsert the rat into the scanner and position in the center of the magnet. Use a three-plane scout image to precisely center the rat within the magnet with respect to the brain regions of interest, and FASTMAP shimming to homogenize the magnetic field at the regions of interest.\nUse a sagittal T2-weighted RARE sequence (FOV, 2.56 x 2.56 cm2; matrix size, 256 x 256; slice thickness, 1.5 mm; TR/TE, 1500/11 ms; RARE Factor, 8; Flip Angle, 180°) to find the location of the anterior commissure, and align the subsequent images to this location. Align eight-slice single-shot GE-EPI scans (FOV, 2.56 x 2.56 cm2; matrix size, 96 x 96, reconstructed to 128 x 128; slice thickness, 1mm; TR/TE, 1000/14 ms) to this point with coronal orientation.",
    "For functional scans, use 70 consecutive EPI scans with 1 second temporal resolution synchronized to the stimulation output, set to 20 sec rest, 10 sec stimulation, followed by 40 sec rest. Allow a minimum of 90 sec between scans to allow for neurovascular recovery. Acquire multiple repeated scans at each stimulation parameter to improve the signal-to-noise ratio by averaging. Use a series of dummy scans (typically 4-8) immediately prior to scanning for noise reduction. Confirm the BOLD response at the time of image acquisition to ensure success of the experiment using the method described in section 4, though averaging, coregistration and skull-stripping may be skipped in this setting.\nAfter functional scanning is complete, use a T2-weighted RARE spin-echo sequence (FOV, 2.56 x 2.56 cm2; matrix size, 256 x 256; slice thickness, 1 mm; TR/TE, 2500/33 ms; averages, 8) to measure the anatomical position of the electrode in vivo. Acquire multiple coronal and sagittal sections to measure the tip of the electrode artifact along anterior/posterior, medial/lateral and dorsal/ventral axes and confirm electrode placement. High resolution magnetic resonance microscopy (FOV, 1.8 x 1.28 cm; matrix size, 360 x 256; slice thickness, 0.5 mm; TR/TE, 2500/12.6 ms; RARE factor, 8; averages, 280) may be used to examine the precise location of the electrode tract after removal with respect to nearby neuroanatomical structures and confirm the accuracy of electrode placement3.\n4. fMRI Data Processing and Analysis\nThe fourth step is processing and analysis of fMRI data, including generation of response maps and calculation of percent BOLD signal change. Custom programs running within a computing environment (e.g. MATLAB) or commercial fMRI software tools (e.g. SPM, FSL, or AFNI) may be employed.\nBegin with image coregistration and averaging of data first within-subject by frequency, followed by across-subject. Note: We accomplish this using SPM codes.",
    "Perform skull stripping to remove nonbrain tissue using manually defined region of interest (ROI) with signal thresholding. Automatic skull stripping algorithms may be employed.\nCompile response maps by calculating the correlation coefficient of the relationship between BOLD response over time and the stimulation paradigm for each voxel. Delaying the paradigm several seconds to account for delay in hemodynamic response may be necessary. Set significant level at P < 0.05 after Bonferroni correction. Other statistical methods may be employed. Correcting for multiple comparisons using Random Field Theory or cluster-level correction based on Gaussian Random Field may be performed in place of the Bonferroni correction for more sensitive analysis4. Note: The hemodynamic delay may vary based on brain regions targeted, pharmacologic agents used, and physiological parameters. It is crucial to control these parameters in order to prevent variability within-subject and between-subjects.\nQuantify the BOLD response by defining a ROI to extract time-course data. Average the percent signal change across all voxels within the same anatomical structure. Voxel-wise analysis using the General Linear Model may also be used5.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}