{
  "id": 18559,
  "origin_website": "Jove",
  "title": "Design, Fabrication, and Administration of the Hand Active Sensation Test (HASTe)",
  "procedures": [
    "1. Design and Fabrication of Visual Screen and HASTe (See \"Table of Materials\" for All Required Equipment and Materials):\nAssemble Visual Screen (Figure 1):\n\t\nCut four pieces of 0.5-inch PVC pipe (material a) to 10 inches (these form the base of the screen). Cut three pieces of 0.5-inch PVC pipe to 20 inches (these form the upright portion of the screen).\nInsert two pieces of 10-inch pipe into both PVC Tee’s (parallel openings) (material b). Insert two pieces of 20-inch pipe into each of the remaining holes of the PVC Tee’s (perpendicular to the 10-inch pieces). Insert PVC elbows (material c) on each of the open ends of the 20-inch pipes.\nInsert each end of the third 20-inch PVC pipe into each of the open PVC elbows. Do not glue PVC joints if easier folding/storage of visual screen is desired. Glue PVC joints for a permanent visual screen, if desired. Drape pillow case (material d) over top pipe. Secure with binder clips (material e) or safety pins.\nimgsrc://cloudfront.jove.com/files/ftp_upload/53178/53178fig1.jpg\nFigure 1: Set-up of the HASTe. Participants should be seated at a table. The visual screen between the participant and the test objects. The objects for one trial are removed from the test kit and offered to the participant in the following order: test object first, then each of the three possible matches, in the order indicated in Appendix 1: Administration Instructions and Score Sheet. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/53178/53178fig1large.jpg]\nAssemble HASTe Testing Kit (includes 9 test objects, a duplicate set of 9 sample objects, and 3 example objects) (Figure 2)",
    "Cut 21 pieces of 1.5-inch diameter PVC pipe (material f) into 4-inch lengths. Cut cork (material g) into 21 strips, each 4 x 7 inches. Overlay each cork over PVC to ensure no overlap at seam or ends of pipe.\nTrim excess cork flush to edge. Coat each of the 21 pieces of pipe (one-by-one) with all purpose cement (material h) and wrap with cork.\nMeasure and cut six 4 x 7-inch pieces of self-adhesive laminate (material i) and six 4 x 7-inch pieces of brown paper (material j). Trim excess. Wrap six pieces with self-adhesive laminate.\nCoat six pieces with all purpose cement and wrap with brown paper wrapping. Coat one piece with all purpose cement and wrap with sandpaper (material k). Coat two pieces with all purpose cement and wrap with glossy cardstock (material l).\nMeasure and lay out eight pieces of clay (material m), each weighing 2.2 ounces. Measure and lay out six pieces of clay, each weighing 3.2 ounces. Measure and lay out seven pieces of clay, each weighing 4.2 ounces.\nMold two 2.2-ounce, 3.2-ounce, and 4.2-ounce pieces of clay into a solid block to fill the diameter of the pipe. Insert each into the center of a pipe covered in brown paper wrapping. Repeat step with pipes covered with cork and self-adhesive laminate.\nMold two 2.2-ounce pieces of clay into a solid block to fill the diameter of the pipe. Insert one into the center of a pipe covered in glossy cardstock and one into the pipe covered in sand paper.\nMold one 4.2-ounce piece of clay into a solid block to fill the diameter of the pipe. Insert into the center of a pipe covered in glossy cardstock .",
    "Fill each pipe to capacity with closed-cell packing foam (material n). Weigh components to ensure accuracy of weight to 0.1 ounce.\nCoat each end cap (material o) with all purpose cement and firmly insert into both ends of each pipe.\nLabel each object with weight (on the bottom) and number (on the top) as to be visible to the examiner.\nCover test objects 1T, 2T and 3T with cork, then brown paper, and weigh to 6, 7, and 8 ounces, respectively. Cover test objects 4T, 5T, and 6T only and weigh to 6, 7, and 8 ounces, respectively. Cover test objects 7T, 8T, and 9T with cork, then self-adhesive laminate, and weigh to 6, 7, and 8 ounces, respectively.\nLabel sample objects 1-9 (exact duplicates of the test objects).\nLabel the three example objects A, B, and C. Cover example objects A and B with glossy card stock (weighing 6 and 8 ounces, respectively). Cover example object C in sand paper (weighing 6 ounces). (Example objects are not shown in Figure 2.)\nSore and transport all test items in a plastic storage box (material p).\nimgsrc://cloudfront.jove.com/files/ftp_upload/53178/53178fig2.jpg\nFigure 2: Organization of the HASTe Test Objects.  The test objects are ordered 1-9 and marked with a ‘T’. The nine sample objects, which participants match to the test objects by weight or texture, are also numbered 1-9 and ordered, as shown.\n2. Administration of HASTe:\nSeat participants at a standard height table (~29 inch) and chair (~18 inch). Adjust the heights such that the participant can rest and move the test arm comfortably on the table. Place the test arm under a visual screen, as shown in Figure 3, to prevent participant from seeing the test arm, the objects, or the examiner.",
    "Note: Test the less impaired upper extremity first, if the participant being tested has a more impaired upper extremity.\nInstruct participant to grasp and lift the example objects to freely determine differences between weight and texture. Provide feedback for the two demonstration trials only.\nAdminister two demonstration trials prior to scoring. Have participant compare objects A and B to illustrate differences in weight. Have participant compare objects A and C to illustrate differences in texture.\nDo not offer feedback on the patient’s performance during trials of the scored test. Do not assist the patient with manual exploration of the objects. Organize test materials for all 18 trials by keeping objects in numerical order. (Figure 2)\nProvide verbal instructions to the participant: “Use one hand to manually explore the test object first. Then, explore each of the three possible matches, which vary by either weight or texture but never both within one trial.  Find the match. Touch each object as many times as needed to determine the answer. There will be 18 trials. With a maximum of 5 min for each trial.”\nRepeat test instructions during test administration at the discretion of the examiner or upon request of the participant. Do not inform participant as to which object property (weight or texture) they are matching within a trial.\nSlide objects to and away from the participant’s hand, per the participant’s request, if his or her elbow or shoulder movement prevents them from moving between objects (Figure 3).\nHave the participant indicate their choice verbally or by pointing to their choice upon finding the match. Administer the next trial. Do not have participant describe, in any manner, the object properties or explain why they chose the match that they did.",
    "Score the test by determining the number of correct matches from a total of 18 trials per hand. Use Appendix 1: Administration Instructions and Score Sheet and the overall organization shown in Figure 2 in order to reduce examiner error.\nAnalyze and interpret HASTe scores as a measure of haptic performance with the following considerations.  \n\tNote: The intervals between ranks on the HASTe, an ordinal scale, may not be consistent and may not be known. However, like many clinical measures, it may be meaningful and appropriate to apply statistical inference as though the data were interval, as shown in Figure 4.\nimgsrc://cloudfront.jove.com/files/ftp_upload/53178/53178fig3.jpg\nFigure 3: Offering the HASTe Objects to the Participant. The objects can be placed in the participant’s hand, but the examiner should avoid assisting the participant with object manipulation.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}