{
  "id": 9629,
  "origin_website": "Jove",
  "title": "Analysis of Trunk Neural Crest Cell Migration using a Modified Zigmond Chamber Assay",
  "procedures": [
    "1. Day 1: Isolation of trunk neural tubes for overnight culture on coverslips\nIncubate chick eggs for 56 h at 38° C. Remove the eggs from incubation, mildly spray them with 70% Ethanol, and then allow them to dry. Break the eggs open into a UV-sterilized glass tray.\nExtract each embryo from its yolk and place it in chick Ringer's. Do this by first cutting around its blood islands with curved scissors; then, with blunt forceps, pick the embryo up by its extraembryonic membrane and place it in a sterile plastic Petri dish containing chick Ringer′s solution.\nIsolate the trunk of each embryo by trimming off excess extraembryonic membranes as well as cranial, vagal, and sacral axial levels using a tungsten needle (Fig. 1). First, select about 9 embryos that are between stages HH15-17 11. For stages HH15 and up, the forebrain and hindbrain axes form an acute angle and therefore the head appears to tilt caudally. At stage HH17, the tail bud is present and tilts ventrally but does not yet contain somites. With a tungsten needle, trim off extraembryonic membranes to about 2 mm from the embryo and cut off any embryonic tissues anterior to somite 10. Also remove all caudal embryonic tissues starting from around the fifth most newly formed somite.\nPlace the isolated embryonic trunks in Dispase (0.24 U/ml DMEM) and incubate them for 1 h 15 min at 37° C and 5% CO2. Once the trunks begin incubation, start preparing 6 coverslips (CS) for culturing NT explants (steps 1.5-1.8).",
    "Rinse 6 CS in 70% ethanol (diluted in sterile, ultrapure water), and then allow them to dry. Using a lab marker, draw a circle in the center of each CS that is about 1 cm in diameter (this circle will later help you identify where a fibronectin coat has been applied). On the same face of each CS, write the word \"be\" (or some other asymmetrical word or shape) outside the drawn circle (this will help you identify whether the marked side of the CS is facing up or down).\nPlace each CS in a separate 40 x 10 mm sterile dish with the marked surface facing down and allow the dish to sit open underneath a germicidal UV lamp for 10 min.\nApply 60 μl fibronectin (FN; 10 μg/ml DMEM) to the unmarked surface of the CS while making sure the entire area within the 1 cm circle is coated. Place the dishes to incubate at 37° C for 30 min and then carefully aspirate the fibronectin from each CS.\nAdd 250 μl \"culture\" medium [DMEM with L-Glutamine (2 mM), Penicillin (100U/ml), Streptomycin (100 mcg/ml), and 8% fetal bovine serum (FBS)] to the FN-coated area of the CS. Place the dishes containing each CS at 37° C and 5% CO2 again until the NTs have been isolated.\nTransfer all the incubated embryo trunks to one 5 cm glass Petri dish containing L15 medium and start dissecting out each NT using fine forceps and a tungsten needle (Fig. 1). Carefully slice along the border of the NT and somites with a sharp tungsten needle while being cautious not to damage the NT. It is often easier to begin isolating each NT from the caudal-most end of the trunk.",
    "Select 6 of the straightest and longest NTs to culture overnight (NTs between roughly 8 and 15 somites long are recommended). Using a micropipette tip primed with culture medium, transfer each of the 6 NTs to its own previously prepared CS (from steps 1.5 through 1.8). Be sure that the NT does not remain floating at the surface. If the NT is floating, drip medium onto it until it sinks using a micropipette.\nPlace each dish at 37° C and 5% CO2 overnight. Be careful to ensure each NT is within the FN-coated area of its respective CS immediately prior to placing the dish in the incubator (by using the circle drawn in step 1.5 as a reference). A micropipette can be used to better adjust the position of each NT if needed.\nPlace at least 2 ml of culture medium (without serum) into a sterile 15 ml centrifuge tube and incubate overnight at 37° C and 5% CO2. Leave the cap slightly unscrewed to allow the pH of the medium to adjust overnight. Pre-incubating the medium is important to help prevent bubble formation in your chamber, which may disrupt the establishment of a molecular gradient. Such \"preincubated \" medium should be used in all future steps. When not being used, this medium should be incubating at 37° C.\n2. Day 2: Loading the modified Zigmond chamber and time-lapse analysis of cell migration",
    "Out of the 6 NTs cultured, select the 3 cultures best suited for analysis. Generally, NCC cultures that have at least one long, straight edge should be selected (Fig. 2A). The 3 best cultures will be used to load and film 3 modified Zigmond chambers throughout the day, each with a different treatment. Out of the 3 cultures, choose one for loading the first chamber and return the others to the incubator for later use.\nUsing a cotton swab, apply a thin, even layer of petroleum jelly surrounding the reservoirs and bridge of one modified Zigmond chamber.\nWith a tungsten needle, gently remove the NT from the CS, while leaving the surrounding NCCs attached to the surface of the CS. Mark the dish with a pen to remember the orientation of the straightest edge of the NCC culture.\nPlace a few drops of preincubated medium onto the bridge. Pick up the CS with fine forceps, dab the edge of the CS against a Kimwipe to remove most of the old culture medium, then immediately place the CS on the modified Zigmond chamber so that the straight edge of the culture to be filmed is centered over the length of the bridge and roughly perpendicular to the bridge-reservoir border (Fig. 2A,B).\nUsing an inverted microscope, move the straight NCC border to be on the side of the bridge closest to the reservoir that will contain the suspected chemotactant (Fig. 2B; for controls this will correspond to whichever reservoir is loaded second). Also, more finely align the straight edge of the culture to be perpendicular to the bridge-reservoir border.",
    "Carefully, but securely press the CS into the petroleum jelly present on the Zigmond chamber, making sure it is completely sealed on to the chamber, then place additional petroleum jelly along the edge of the CS to further ensure it will be airtight. Fine-adjust the angle of the NCC border again to correct for any movement during the sealing process.\nLoad the reservoir that will not contain the suspected chemotactant first (Fig. 2B). Do so by loading a 1 ml syringe (25 G x 1.5 in. attached needle) with roughly 300 μl preincubated medium and inject the medium into the reservoir until full (while being careful not to generate any bubbles in the reservoir). Plug the reservoir on both sides with a sufficient amount of petroleum jelly prior to loading the next reservoir.\nRepeat step 2.7, except this time using preincubated medium containing the candidate chemotactant. It is critical when generating a molecular gradient across the culture to always load the reservoir containing the molecule to be tested after loading the reservoir lacking the tested molecule.\nPlace the loaded Zigmond chamber at 37° C to incubate for 1 h prior to filming. Image the straightest border of the NCC culture for 3 h at 90 s intervals while incubating at roughly 37° C (Fig. 2A,B). Prior to creating any movie, be sure to align the camera so that the edge of the images to be obtained are aligned with and touching the edge of the bridge that borders the last reservoir loaded (Fig. 2B, upper panel; dashed box represents ideal position for imaging). This will facilitate later software analysis by standardizing the directionality of the molecular gradient applied and the distance from the reservoir filmed in each movie produced.",
    "For controls, repeat steps 2.2-2.9 for each of the two other NCC cultures selected (in step 2.1), but fill each reservoir with an appropriate medium. For one type of control fill both reservoirs with preincubated medium not containing the molecule to be tested. For a second control treatment, prime the bridge with a few drops of preincubated medium containing the suspected chemotactant prior to mounting the CS. Then, load both reservoirs with the same medium containing the suspected chemotactant.\nUse ImageJ (NIH) Manual Tracking (rsb.info.nih.gov/ij/plugins/track/track.html)[href=http://rsb.info.nih.gov/ij/plugins/track/track.html] and Chemotaxis and Migration Tool v1.01 (www.ibidi.de/applications/ap_chemo.html)[href=http://www.ibidi.de/applications/ap_chemo.html] plugins to track the migration of peripheral NCCs along the straight border of the culture just imaged and to analyze various parameters of the migratory trajectories obtained (Fig. 2B-C).\n3. Representative Results:\nA sample of cell trajectories from a movie where many trunk NCCs were responsive to a candidate chemoattractant using the above technique is shown (Fig. 2D). Most cells in this example of a positive response displayed a net movement up the chemoattractant gradient (as shown in red). Trajectory data can be used to analyze other properties of cell migration as well.\nIn order to visually evaluate an applied gradient in a modified Zigmond chamber, an Alexa Fluor 488 IgM conjugate (MW ~ 900 kDa) was loaded into the second reservoir of a modified Zigmond chamber (at roughly 40 μg/ml H2O). A gradient was established by 1 h and still somewhat present after 26 h, but greatly diminished by 50 h (Fig. 3). If the molecule to be tested is smaller, then the applied gradient will degrade faster than what is shown.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3330/3330fig1.jpg",
    "Figure 1. Explantation of trunk-level NTs for overnight culturing on fibronectin-coated coverslips. Because trunk NCCs delaminate from the dorsal NT located adjacent to somites 8-28, this segment of the NT is isolated by microdissection and cultured overnight on a fibronectin-coated CS to allow for emigration of NCCs from the NT explant. Isolated NTs that are between 8-15 somites long and relatively straight are best suited for overnight culturing as they tend to yield NCC cultures with longer straight borders. Regions of the neural tube that give rise to other neural crest axial levels are shown in a smaller font. s, somite.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3330/3330fig2.jpg",
    "Figure 2. Method for evaluating the migration of explanted trunk NCCs using a modified Zigmond chamber. (A) Elongated trunk NCC cultures are prepared by overnight culturing of NTs and resultant NCC cultures with at least one long, straight border are selected for experimentation. The longest straight border of a selected culture is then positioned perpendicular to the bridge-reservoir border, and therefore parallel to the vector of the future applied gradient. (B) After fine-adjusting the position of the NCC culture on the Zigmond chamber and sealing the coverslip to the chamber, the chamber is loaded. When testing chemotaxis, the reservoir that will not contain the suspected chemotactant (-) is loaded first and sealed. Then, the other reservoir is loaded with the suspected chemotactant (+) and sealed. Peripheral NCCs along the previously selected border can then be imaged and tracked using the Manual Tracking plugin for ImageJ (bottom panel). (C) Numerous migratory characteristics in response to the applied gradient can be assessed based on tracking data. For instance, a chemotaxis index can be derived by dividing a cell's displacement along the x-axis by the total distance it has migrated. (D) An example of an attractive response is shown by a cell trajectory plot initially generated by the Chemotaxis and Migration Tool plugin for ImageJ. The starting point of each trajectory is set to the origin (0,0). Note how many more cells migrate toward the chemoattractant source.The center of mass of all cells at their final position (blue cross; all cells equally weighted) is also closer to the chemoattractant source. NCCs, neural crest cells; Red tracks, cells that migrated toward the reservoir loaded with a suspected chemoattractant; Black tracks, cells that migrated away; (+), higher chemotactant concentration; (-), lower chemotactant concentration.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3330/3330fig3.jpg",
    "Figure 3. Intensity profiles across the bridge of a modified Zigmond chamber at different times following the addition of an Alexa Fluor 488 IgM conjugate.  The chamber was loaded in a similar manner to that described in the protocol with the main exceptions that preincubated water (instead of preincubated medium) was used to dilute the antibody to 40 μg/ml, and small air pockets were present at the ends of the bridge (away from the slice where the above intensity profiles where taken). Initially, no gradient was present across most of the bridge. By 1 h a gradient was established and remained present through to 26 h. By 50 h the presence of the gradient was inconsistent at different areas of the bridge, and when present, the steepness of the gradient was greatly diminished. All profiles were generated from an identical slice across the bridge (from one bridge-reservoir border to the other) using AxioVision 4.6 software. Note that even while air pockets were present, the gradient was not disrupted. High, high intensity; Low, low intensity; x-axis, distance across entire width of bridge (2 mm); (+), reservoir loaded with the Alexa Fluor 488 IgM conjugate; (-), reservoir not loaded with the conjugate.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3330/3330fig4.jpg\nFigure 4. Modified Zigmond chamber specifications. Shown is a diagram of the modified Zigmond chamber used here along with its dimensional specifications (±0.2 mm). Measurements can be moderately adjusted in order to match individual preferences.\nSupplemental Protocol: Fabrication of a Modified Zigmond Chamber\nPlease refer to Figure 4 as a reference for the protocol below:\nPurchase a sheet of 3/16″ thick polished acrylic (4.45 mm actual thickness).\nUsing a table saw, cut chamber blanks oversized to the rough dimensions of 33.25 mm x 64.57 mm. This allows 3.175 mm extra material for machining.",
    "Set the chamber blank on a vise. With a milling machine and a 6.35 mm (1/4″) end mill bit, finish machining the sides of the chamber to their exact dimensions: 30.07 mm x 61.39 mm.\nPosition the chamber blank on the milling machine and locate the center of the blank along both the x and y axes with an edge finder; then zero the center location.\nAcquire the chamber height (z-axis) by touching the end mill bit to the top surface and zero the height.\nUsing a 3.91 mm (0.154″) end mill bit, offset the bit 3.03 mm along the x-axis (positive direction) for the first reservoir. Begin machining into the chamber to a depth of 2.84 mm while moving along the y-axis (positive direction) to 7.62 mm (0.300″) and then traverse to 7.62 mm (0.300″) in the opposite (negative) direction to a complete reservoir length of 15.24 mm (0.600″). Offset the bit to 3.03 mm (0.119″) along the x-axis (negative direction) and repeat the same process for the second reservoir.\nPosition the chamber on its edge and drill a hole using a 1.09 mm (0.043 in.) drill bit on the end of each reservoir (4 total) that connects the end of the reservoir to the side of the chamber for loading medium during experimentation.\nSoak the chamber well in warm soapy water to help remove any chemical contaminants.\nSoak and rinse the chamber well in double-distilled water to remove any soap. The chambers are now ready to use as described above.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}