{
  "id": 15165,
  "origin_website": "Jove",
  "title": "Human Mesenchymal Stem Cell Processing for Clinical Applications Using a Closed Semi-Automated Workflow",
  "procedures": [
    "1. Preparation of the culture media and coating the culture vessels\nMedia preparation\n\t\nComposition of the classic serum-containing medium: Prepare the classic serum-containing medium by mixing αMEM (445 mL), fetal bovine serum (FBS) (50 mL), and 100x penicillin-streptomycin (5 mL).\nPrepare the complete SFM XF medium.\n\t\t\nMake a 500 mL bottle by aseptically adding 5 mL of SFM XF supplement (100x), and 5 mL of 100x L-alanyl-L-glutamine (see Tables of Materials) to the SFM XF basal medium (500 mL).\nMake a 2 L media bag by aseptically adding 20 mL of custom MSC SFM XF supplement (100x) and 20 mL of 100x L-alanyl-L-glutamine (see Tables of Materials) to the SFM XF basal medium bag (2 L) by connecting a 50 mL syringe to the appropriate port of the bag.\n\t\t\tNOTE: Before using in culture, add growth factors or cytokines (not supplied with the medium) to the complete SF XF medium: PDGF-BB (20 ng/mL), FGF basic (4 ng/mL), and TGFβ (0.5 ng/mL).\nCoating the cell culture vessels with vitronectin for use with serum-free media\n\t\nThaw a stock of vitronectin (VTN-N; 0.9 mg/mL) at 4 °C.\nUse sterile Dulbecco's buffered saline without calcium and magnesium (DPBS) to dilute the thawed VTN-N to a working concentration of 5 µg/mL.\n\t\tNOTE: Dilute the VTN-N immediately before use, and do not store the diluted vitronectin solution.\nAdd 1 mL/10 cm2 of the diluted VTN-N solution to the corresponding culture vessel; the final concentration is 0.5 µg/cm2. For example, add 7.5 mL of diluted VTN-N solution to a T-75 flask (75 cm2); add 17.5 mL of diluted VTN-N solution to a T-175 flask (175 cm2); add 250 mL of diluted VTN-N solution to a standard four-layer multi-layered flask (2,528 cm2); and add 630 mL of diluted VTN-N solution to a 10-layer multi-layered flask (6,320 cm2).",
    "Under sterile conditions, incubate the vessels for 1 h at room temperature (RT).\n\t\tNOTE: The coated culture vessel can be stored in 4 °C for up to 1 week. Wrap the culture vessel with laboratory film to prevent it drying out. Before use, pre-warm the culture vessel to room temperature for at least 1 h.\nAspirate the VTN-N solution, discard, and immediately add a sufficient volume of culture medium to prevent the coated vessel surface from drying.\n\t\t​NOTE: It is not necessary to rinse off the culture vessel after the removal of the VTN-N.\n2. WJ-hMSC expansion\nThaw WJ-hMSCs (p2) rapidly by placing the cryovial in a 37 °C water bath; slowly swirl the vial until the contents start to defrost.\nUpon thawing, seed the WJ-hMSCs at 5,000 cells/cm2 in a T-175 flask (without VTN-N coating), and incubate in the classic serum-containing medium at 37 °C in a humidified atmosphere of 5% CO2 for cell expansion. After two passages (p4), bank down the expanded cells in the desired cryopreservation medium as a working cell bank (WCB).\nCarry out cell counting using an automated cell counter following the viability and cell count method to determine the total cell count, cell viability, and cell size29.\nFrom p4, culture the WJ-hMSCs at 5,000 cells/cm2 in T-75 flasks in either classic serum-containing medium or SFM XF medium (use VTN-N-coated flasks with SFM XF medium).\nMaintain the cells in both culture media for a total of three passages (12 days), and measure the cell expansion (fold increase) at each passage by dividing the number of viable cells counted at the end of the culture of each passage by the number of viable cells at the beginning of the culture (day of cell seeding).\n3. Seed train scale-out expansion\nWJ-hMSC expansion in a T-175 flask",
    "Thaw the WJ-hMSCs at p4 rapidly by placing the cryovial in a 37 °C water bath; slowly swirl the vial until the solution starts to defrost.\nSeed 5,000 cells/cm2 into a VTN-N-coated T-175 flask. Allow the cells to grow in an incubator at 37 °C with 5% CO2.\nReplace the spent culture medium every 2-3 days with freshly prepared pre-warmed complete SFM XF medium for optimal performance and cell growth.\nHandling the multi-layered flasks (Figure 1A, B)\n\t\nAll aseptic connections need to be done in a sterile environment.\nUnpack the multi-layered flask inside a biological safety cabinet.\nConnect the pre-sterilized air filter (0.2 µm) to one port to allow pressure to be released during the fluid transfer using the counterflow centrifuge.\nFit the multi-layered flask connector from the custom tubing set into the other port (Figure 1B).\nWeld the PVC line of the custom tubing set to the 2 L PVC transfer bag containing complete SFM XF medium.\n\t\tNOTE: Mix the medium bag completely before adding it to the multi-layered system by gravity flow. Ensure that the PVC transfer bag is hanging higher than the multi-layered flask.\nPlace the multi-layered flask on its long side, with the air filter at the top (Figure 1B).\nOpen the clamp on the PVC tubing to start filling the multi-layered flask. Ensure that the medium is level between the trays during filling.\nOnce the medium has fully leveled out in all the trays, turn the multi-layered flask onto its short side with the ports upright.\nClose the clamp on the PVC line, and remove the transfer bag by replacing the tubing connection with the MPC blue closure cap.\n\t\tNOTE: Do not remove the air filter, as this allows gas exchange during cell expansion.\nTurn the multi-layered flask into the incubation position.",
    "NOTE: The filter and the tubing connection should be facing upward.\nEmpty the multi-layered flask by connecting it to an aspirator bottle; place it above the aspirator bottle, and the liquid will flow out.\n\t\tNOTE: Tilt the multi-layered flask on its side to completely drain out the spent medium by gravity. Alternatively, the spent medium can be poured into a waste bottle using a custom tubing assembly.\nRepeat steps 3.2.5-3.2.11 to replenish the fresh medium.\nSubculture of WJ-hMSCs in the multi-layered flask (T-175 > 4-layer > 10-layer)\n\t\nPre-warm cell dissociation reagent (TrypLE) and complete SFM XF medium inside a 37 °C incubator before use.\nAspirate the spent medium from the T-175 flask and discard.\nWash the cell monolayer with pre-warmed DPBS, aspirate, and discard.\nAdd TrypLE to each flask, ensure complete coverage of the cell monolayer, and incubate for 5-10 min at 37 °C.\nTransfer the suspension to a sterile 50 mL conical tube.\nCentrifuge the tube at 100-200 x g for 5 min at RT. Aspirate and discard the DPBS, and be careful not to disturb the cell pellet.\nResuspend the cell pellet in a minimal volume (10 mL) of pre-warm complete SFM XF medium for cell counting.\nFill a VTN-N-coated four-layer culture vessel with about 800 mL of complete SFM XF medium, as mentioned in section 2 above. Add 5,000 cells/cm2 (i.e., 1.26 x 107 viable cells/flask). Gently swirl the cell suspension to ensure an even distribution.\nIncubate in a 37 °C incubator with 5% CO2 in a humidified atmosphere.\nReplace the spent culture medium every 2-3 days with fresh, pre-warmed complete SFM XF medium for optimal cell growth until the cells reach 60%-80% confluency or are ready to be sub-cultured into the 10-layer multi-layered flask.",
    "Fill a VTN-N-coated 10-layer multi-layered flask with about 2 L of complete SFM XF medium, as mentioned in section 2. Add 5,000 cells/cm2 (i.e., 3.1 x 107 cells/flask). Gently swirl the cell suspension to ensure an even distribution.\nIncubate in a 37 °C incubator with 5% CO2 in a humidified atmosphere.\nReplace the spent culture medium every 2-3 days with fresh, pre-warmed complete SFM XF medium for optimal cell growth until the cells reach 60%-80% confluency or are ready to be harvested.\n4. Closed semi-automated WJ-hMSC dissociation and harvesting using closed counterflow centrifugation\nSingle-use counterflow centrifugation kit assembly\n\t\nConnect the single-use kit with the single-use PVC transfer bags via tube welding, similar to the configuration shown in Figure 1A.\n\t\tNOTE: The default flow rate of the single-use kit is 30-165 mL/min.\nAttach a 10-layer multi-layered flask containing confluent WJ-hMSCs to the custom tubing assembly inside a biosafety cabinet.\nTransfer the attached 10-layer culture vessel with the custom tubing assembly to a bench, and weld to Line E (3/32 in ID PVC) of the single-use kit, as shown in Figure 1B.\nMake sure to weld a sterile sample port to Line G of the high-flow single-use kit.\nNext, connect the harvest Line H to a sterile Luer fitted with a 50 mL syringe.\n\t\tNOTE: In all the above steps, ensure that the manual clamps are closed to secure the fluid in each kit bag.\nSetting up the instrument run\n\t\nPower the instrument \"ON\" by switching on the toggle switch at the rear of the instrument.\nConnect the laptop to the USB-C port on the instrument using the provided USB-C cable (Figure 1B).\nRun the counterflow centrifuge graphical user interface (GUI) software from the desktop or start menu.",
    "After signing in, load the protocol by clicking on the Select a Protocol button on the main welcome page.\n\t\tNOTE: The counterflow centrifugation harvesting protocol (Table 1) was created using the Protocol Builder software and stored locally.\nPress the blue unlock button on the instrument, and open the glass door.\nLoad the assembled single-use kit onto the counterflow centrifugation system.\nStart by hanging the bags suspended on hanger hooks in an order that best lines them up with the tube ports on the bubble sensor strips, with the 10-layered multi-layered flask placed at an angle, as shown in Figure 1B.\nLine up the kit with the two kit location buttons, stretch the pump tubing around the peristaltic pump, and press the white bulb-shaped connector into place.\n\t\tNOTE: Make sure the tubing over the pressure sensor is correctly placed in the tubing track.\nAttach the centrifuge chamber by lifting the silver lever of the counterflow centrifuge chamber carrier and securing it by returning the lever to its upright position.\nPress the tubing from each port on the kit into the tracks along the bubble sensor strips.\n\t\tNOTE: Make sure the bags are not tangled so the protocol process can easily be followed.\nClose the door by pressing down on the door latch.\n\t\tNOTE: The pump clamp arm will close, the centrifuge chamber will spin, and the valves will close. Without closing the door, the system will not be able to initiate and run the protocol.\nHit the Initiate button on the GUI. A checklist will appear; the first four items are instrument checks, and the last two items are user checks (ensure the bags and connections match the kit image, and ensure the manual clamps are open).",
    "NOTE: For instrument checks, red Xs instead of blue check marks are shown if something is not right.\nPress Confirm to show the protocol inputs screen.\nSet the data entry (Harvest Volume) dialog box value as 45 mL, and press Confirm.\n\t\tNOTE: The protocol input screen will be prompted if any variable data inputs are set in the user-created protocol. The harvest volume is set as a variable in this protocol, and the user can choose to test different volumes depending on the final cell density requirements. The minimum harvest volume that the system allows is 5 mL. The system allows a maximum of only four data variables to be set for each protocol.\nRunning the protocol\n\t\nClick on Initiate on the GUI, and press the green Start button on the instrument to start the protocol run (refer to Table 1).\n\t\tNOTE: The system will initiate the steps according to the protocol starting with the priming sequence by replacing the air in the system with a buffer.\nOnce the priming is completed (Table 1, step 8) ensure that the spent medium is completely pumped out into the waste bag.\n\t\tNOTE: Once the 10-layer multi-layered flask is empty, the system will prompt the user in the GUI to confirm if the vessel is empty. Press the \"Skip\" button on the instrument if the vessel is empty; if not, press the green \"Play/Pause\" button to continue to drain any residual fluids from the vessel.\nIn pause steps 15, 19, and 22 (Table 1) make sure to lift up the multi-layered flask and shake to distribute the buffer equally to all the trays. Once completed, place the 10-layer multi-layered flask back in its original draw position for the next steps.",
    "NOTE: For step 19 in Table 1 only, after shaking, make sure to place the multi-layered flask flat, and incubate for 10-15 min at RT to dissociate the cells.\nIn step 20 and step 23 (Table 1), ensure that the trypsinized cells are transferred completely into the intermediate bag.\nMix the intermediate bag well manually in step 25 (Table 1).\nIn step 26 (Table 1), use a 2 mL Luer syringe to sample through the sampling port.\n\t\tNOTE: It is recommended to sample at least thrice for accurate cell counts.\nIn step 29 and step 30 (Table 1), check the stable formation of the fluidized cell bed; it should be similar to the fluidized cell bed as shown in Figure 1C.\n\t\tNOTE: If the stable fluidized cell bed is not formed similar to that shown in Figure 1C, optimizing the ratio of the g-force to the flow rate (G/F) is critical for achieving a stable fluidized cell bed (high cell recovery) in the chamber during the cell loading and washing steps. The G/F ratio depends on the size of the cells and the density of the medium. A high G/F ratio is needed for a high-density sample/wash buffer, while a low G/F ratio can be used for a low-density sample/wash buffer.\nThe run is complete at the Ramp to Stop step (step 35 in Table 1), and all the pinch values on the counterflow centrifugation system will close automatically.\n\t\tNOTE: Lastly, ensure that the manual clamps are closed to secure the fluid in each kit bag before opening the door.\nAfter the protocol run is complete, press the blue unlock button on the instrument, and open the glass door. Take the single-use kit with the harvested concentrate out of the instrument.",
    "Aseptically seal the harvest line using a hand-carry tube sealer. Carefully transfer the sealed syringe filled with the concentrated cell harvest into the biological safety cabinet for cell counting and cryopreservation.\nDetach the chamber again using the lever, pull the bulb connector out of its fitting and carefully lift the kit away, and dispose into a biohazard bag.\nClean the instrument using ethanol wipes, and make sure to close the door.\nClose the GUI application first before turning off the switch at the rear of the instrument.\n\t\t​NOTE: The cell harvesting protocol was tested in biological triplicates (n = 3).\n5. Critical quality attributes (CQA) assessment\nCell identity surface markers (CD73, CD90, and CD105) and non-stromal markers (CD34 and CD45)\n\t\nDilute the harvested WJ-hMSC cell suspension to a concentration of 1 x 106 viable cells/mL by adding an appropriate volume of flow cytometry buffer (DPBS with 1% BSA or 2% FBS).\nAdd 100 µL of the cell suspension to each microcentrifuge tube or 96-well plate. Make sure a minimum of 0.1 x 106 cells are present per 100 µL of cell suspension.\nAdd fluorophore-conjugated antibody to the sample at an appropriate dilution, as recommended by the antibody vendor.\nIncubate for 20 min in the dark.\nAfter the incubation, add 100 µL of flow cytometry buffer to wash the samples by centrifugation at 380 x g for 3 min.\nDiscard the supernatant, leaving the pellet behind.\nResuspend the cell pellet in 200 µL of flow cytometry buffer, and subject to flow cytometry analysis30.\nColony-forming units fibroblastic assay (CFU-F)\n\t\nDilute the cell suspension to a concentration of 1,000 viable cells/mL of complete culture medium.\nPlate ~500 cells per well in a 6-well tissue culture plate in complete culture medium.",
    "Incubate for 10-14 days at 37 °C in 5% humidified CO2, wash with PBS, and stain with 0.5% Crystal violet in methanol for 30 min at RT.\nEnumerate the colonies in each well.\nCalculate the CFU-F efficiency: Divide the number of colonies formed by the original seeding number to obtain the percentage efficiency of colony formation, and express it as a percentage.\nTrilineage differentiation potential\n\t\nSeed 5 x 103 cells/cm2 into osteogenesis and adipogenesis differentiation medium in 12-well plates as per the manufacturer's protocol. For chondrogenesis, prepare 1.6 x 107 viable cells/mL, and generate micro mass cultures by seeding 5 µL droplets of the cell solution in the centers of the wells of 96-well plates, as per the manufacturer's protocol.\nDuring differentiation, make complete medium changes every 3-4 days.\nAfter 14 days (for adipogenesis) or 21 days (for osteogenesis and chondrogenesis), monitor the cultures for differentiation by using lineage-specific biologic stains as per the manufacturer's protocol. For adipogenic differentiation, stain the cultures with 0.5% Oil Red O solution. For osteogenesis, perform staining by using a 2% Alizarin Red S solution. For chondrogenic differentiation, stain the micro mass pellets with 1% Alcian Blue.\nCytokine secretion profiles\n\t\nThaw the cryopreserved cells harvested manually or using the counterflow centrifugation system, and seed 5,000 cells/cm2 in a T-175 flask with SFM XF media.\nAfter 4 days, collect the spent culture medium, and store it at −80 °C until analysis.\nQuantify the expression of cytokines using a cytokine expression profiles 19-plex panel kit on a multiplex reader.\nPerform the multiplex immunoassays as per the manufacturer's recommendations."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}