{
  "id": 13578,
  "origin_website": "Jove",
  "title": "Isolation of Mouse Endometrial Epithelial and Stromal Cells for In Vitro Decidualization",
  "procedures": [
    "AlexaFluor\nAll animal experiments for this study were approved by the ethical review committee of the KU Leuven (Belgium) (Project P174/2013). Mice were housed under standard conditions, with ad libitum access to food pellets and tap water, and kept under controlled conditions (23 ±1.5 °C, relative humidity 40 - 60%, 12/12 light/dark cycle).\n1. Mice\nUse commercially available mouse strain (i.e. C57Bl/6, female 8 - 12 weeks old). Typically, 4 - 5 mice will yield an appropriate amount of cells for further experiments.\nInject intact mice subcutaneously with 100 µL of the 17β-estradiol (E2) solution (100 ng/100 µL) for 3 consecutive d prior to the isolation in order to standardize the phase of the estrous cycle of the animals and to induce proliferation of endometrial cells. The need for checking the cycle phase of the mice before starting the protocol is avoidable because of the 3 d' estradiol treatment.\n2. Preparations\nMake a solution of 100 ng/100 µL E2 in arachis oil. For the injections of five mice (as described in 1.2), an amount of 1.5 mL is needed.\n\t\nDissolve 1 mg E2 in 1 mL ethanol to have a stock solution of 1 mg/mL.\nDilute this stock solution 1:1,000 in arachis oil.\nMake 500 mL of Hank's Balanced Salt Solution (HBBS) 1x complemented with 100 U/mL penicillin and 100 µg/mL streptomycin (further referred to as HBSS+).\nMake 500 mL of filtered Mouse Endometrial Stromal Cell (MESC) medium to culture MESC: Dulbecco's Modified Eagle Medium/Nutrient Mixture F12 (DMEM/F12) with phenol red, L-glutamine and 4-(2-Hydroxyethyl)piperazine-1-ethanesulfonic acid, N-(2-Hydroxyethyl)piperazine-N′-(2-ethanesulfonic acid) (HEPES) containing 10% FBS, 0.5 µg/mL amphotericin B, and 100 µg/mL gentamicin (further referred to as MESC medium).",
    "Make 500 mL of filtered 2% MESC medium to culture MESC during decidualization: DMEM/F12 with phenol red, L-glutamine and HEPES containing 2% FBS, 0.5 µg/mL amphotericin B, and 100 µg/mL gentamicin.\nPrepare 500 mL of filtered Mouse Endometrial Epithelial Cell (MEEC) medium: DMEM containing 10% FBS, 0.5 µg/mL amphotericin B, 100 µg/mL gentamicin, 25% MCDB-105 medium, and 5 µg/mL insulin (further referred to as MEEC medium).\nPrepare Poly-L-Lysine (PLL) coated coverslips for MESC culture.\n\t\nDissolve 25 mg of PLL in 250 mL of distilled water. Filter the solution using a 0.22 µm filter.\nAdd sterile coverslips in a 12-well plate. Add 300 µL of dissolved PLL on the coverslips.\nRemove the solution after 30 min of incubation. The plates can be stored at 4 °C until further use (up to 1 - 2 months).\nPrepare a 10 mg/mL stock solution of collagenase type IA and store aliquots of 300 µL at -20 °C. Filter before use.\n3. Preparations Required 24 h before Isolation\nPrepare collagen coated coverslips for MEEC culture.\n\t\nPrepare a 0.02 M acetic acid solution in distilled water (1 mL per coverslip).\nAdd 150 µL collagen in 12 mL of 0.02 M acetic acid to obtain a final concentration of 50 µg/mL.\nAdd sterile coverslips in a 12-well plate.\nAdd 1 mL of the collagen solution (see 3.1.2).\nIncubate O/N (minimum 12 h) at 37 °C.\nDuring isolation:\nRemove the collagen solution off the coverslips by suction and let it air-dry in a sterile environment (in the laminar flow cabinet).\nWash the coverslips twice with Phosphate-buffered Saline (PBS).\nPrepare a 2.5% pancreatin solution by adding 0.25 g pancreatin in a 15 mL canonical tube containing 10 mL of HBSS+. Shake (200 rpm) the solution at 37 °C for 1 h to increase the solubility. Store at 4 °C.",
    "4. Isolation and Culture of Mouse Endometrial Epithelial Cells (MEEC) and Mouse Endometrial Stromal Cells (MESC)\nAdd 25 mg of trypsin in a 15 mL tube containing 2.5% pancreatin solution (see 3.2) to end up with a final solution containing 0.25% trypsin (further referred to as MESC digestion mix).\nIsolation of uteri\nCheck the cycle phase of the animals with a vaginal smear examination.\n\t\t\nRestrain the animal and flush the vagina gently with 50 µL PBS 3 - 5 times.\nCollect the final flush on a glass slide.\nExamine the material under a bright field microscope using a 10X or 20X objective.\nOnly use mice that are in the estrus phase. This stage is characterized by the presence of cornified epithelial cells in the vaginal lavage (Figure 1).\nEuthanize the animals using an appropriate method such as cervical dislocation or CO2-induced narcosis.\nSpray the carcasses with 70% ethanol in order to generate a sterile environment.\nUsing sterile surgical tools, open the abdomen and push the intestines aside to visualize both uterine horns.\nGrab the uterine horn at the most distal end under the fallopian tube. Dissect the uterine horns from the fallopian tube and remove adipose and connective tissue. Cut out the horn at the distal end above the uterine body and place it in a 35 mm Petri dish with 3 mL of HBSS+.\n\t\t\nRepeat this step for the other horn and for the other animals until all uterine horns are collected.\nClean the uterine horn (in HBSS+) further under a stereoscope and remove all residual adipose or connective tissue.\nCut the uterine horns open longitudinally to expose the uterine lumen and replace the horn in a new Petri dish with fresh HBSS+.\nTransfer all uterine horns to the 15 mL tube containing pancreatin and trypsin.",
    "Incubate horizontally for 60 min at 4 °C on an orbital shaker (50 rpm).\nIncubate horizontally for 45 min at 23 °C (RT), without shaking.\nIncubate horizontally for 15 min at 37 °C (water bath), without shaking.\nMeanwhile make the MESC digestion mix by dissolving 300 µL of the 1 mg/mL collagenase stock in 2.7 mL of 0.05% Trypsin-Ethylenediaminetetraacetic Acid (EDTA) solution.\n\t\tNOTE: From now on, further isolation steps are performed in a sterile environment under a laminar flow cabinet.\nMouse Endometrial Epithelial Cell (MEEC) Culture\nAfter 2 h of incubation, carefully pour away the supernatant solution.\nTransfer the uteri into a Petri dish containing cold MEEC medium and incubate for 5 min in order to inactivate trypsin activity.\nTransfer the uteri to a 15 mL tube containing 3 mL of cold HBSS+.\nVortex for 10 s to release the epithelial sheets.\nRinse the uteri in a clean Petri dish with 3 mL HBSS+.\nRepeat step 4.3.2 - 4.3.4 to obtain a total of three suspensions containing epithelial sheets.\nTransfer the uteri to the MESC digestion mix and incubate for 30 min at 37 °C while shaking (200 rpm) (go to step 4.4 for further isolation of MESC).\nRecover the epithelial sheets by pipetting the three cell suspensions gently on a 100 µm nylon mesh in order to remove tissue debris.\nCentrifuge the collected cell suspension at 500 x g for 5 min.\nResuspend the pellet in 12 mL of MEEC medium and mix well.\nSettle the solution for 5 min in order to separate remaining MESC using gravity sedimentation.\nRemove carefully the upper 2 mL by using a 5 mL pipette.\nCentrifuge the cell suspension at 500 x g for 5 min.\nResuspend in MEEC medium by gently pipetting up and down.",
    "Plate the cells on collagen-coated coverslips in the desired density for further experiments (Figure 2a).\nIncubate the cells at 37 °C in a 5% CO2 incubator for a minimum of 12 h.\n\t\tNOTE: For immunostaining or functional experiments like fluorescent calcium imaging, it is advised to plate the cells directly on the coverslips, while seeding in a 6-well plate is recommended when RNA or protein isolation is desired. Isolation of mouse endometrial stromal cells is divided into two rounds as the purity of the cells after only one digestion can be insufficient. The uteri are digested twice for an optimal cell recuperation and purity. In both rounds the technical interventions are identical. Cells collected from both rounds can be kept for further experiments, as desired by the researcher.\nMouse Endometrial Stromal Cell (MESC) Culture: 1st Round\nBefore the start of the first digestion round, prepare a second digestion mix by dissolving 300 µL of the 1 mg/mL collagenase stock in 2.7 mL 0.05% Trypsin-EDTA solution. This mix is needed in step 4.4.8.\nPrepare three small Petri dishes with cold (4 °C) HBSS+ and 3 x 15 mL tubes with 3 mL of MESC medium (tube X1, X2 and X3).\nAfter 30 min of incubation, shake the uteri-containing trypsin solution gently for 10 s. MESC cells will detach from the uterine tissue and will remain in the trypsin solution.\nTransfer the uteri to the first Petri dish containing 3 mL cold (4°C) HBSS+ and rinse well.\nAdd 3 mL of MESC medium to the tube originally containing the uterine horns (tube in step 4.4.3) to inhibit trypsin activity.\nTransfer the uteri from the Petri dish with cold (4 °C) HBSS+ to tube X1 containing 3 mL of MESC medium and shake gently for 10 s.",
    "Repeat steps 4.4.4 (transfer to a Petri dish with cold (4 °C) HBSS+) and 4.4.6 (transfer to tube X2 and X3) twice.\n\t\tNOTE: Finally, this protocol will result in 4 cell suspensions: one tube containing the trypsin solution and 3 tubes with MESC medium containing MESC (tubes X1, X2 and X3).\nTransfer uteri in the new MESC digestion, as described in step 4.4.1 and incubate for 30 min at 37 °C, vertically.\nCollect the stromal cells by passing the four cell suspensions through a 40 µm nylon mesh. Rinse the mesh with an additional 5 mL of MESC.\nCentrifuge the cell suspension at 500 x g for 7 min.\nResuspend the pellet in MESC and plate on PLL-coated coverslips for further experiments with the desired density.\nIncubate for a minimum of 4 - 6 h or O/N at 37 °C in a 5% CO2 incubator.\nMouse Endometrial Stromal Cell (MESC) Culture: 2nd Round\nPrepare three small Petri dishes with cold (4 °C) HBSS+ and 3 x 15 mL tubes with 3 mL of MESC medium (Tubes Y1, Y2 and Y3).\nRepeat steps 4.4.3 - 4.4.7.\nTransfer the last cell suspension together with the uteri to a 40 µm nylon mesh.\nCollect the stromal cells by passing the content of tube Y1, Y2 and Y3 through the nylon mesh. Rinse the mesh with an additional 5 mL of MESC.\nCentrifuge the cell suspension at 500 x g for 7 min.\nResuspend the pellet in MESC medium and plate on PLL-coated coverslips for further experiments (Figure 2b).\nIncubate for a minimum of 4 - 6 h at 37 °C with 5% CO2.",
    "NOTE: For immunostaining or functional experiments like fluorescent calcium imaging, it is advised to plate the cells on coverslips, while seeding in a 6-well plate is recommended when RNA or protein isolation is desired.\n5. Vimentin/Cytokeratin Double Staining for Validation of Pure MEEC and MESC Cultures\nSeed the cells on coverslips.\nWash 3 x 5 min with PBS containing calcium and magnesium on an orbital shaker (50 rpm).\nFix the cells with 4% paraformaldehyde (PFA) (CAUTION!) for 10 min, not on shaker.\nWash 3x with PBS without calcium and magnesium on shaker (50 rpm).\nPermeabilize the cells with 0.2% Triton X-100 for 10 min on a shaker (50 rpm).\nWash 3x with PBS on a shaker.\nBlock with 5% goat serum (GS) in PBS for 2 h on a shaker (50 rpm)\nIncubate cells with monoclonal rabbit anti-human vimentin (1:500) and monoclonal mouse anti-human pancytokeratin (1:1,000) at 4 °C on a shaker (50 rpm). Antibodies are diluted in PBS with 0.5% GS.\nWash 3x with PBS on a shaker (50 rpm).\nIncubate cells with secondary antibodies (1:1,000 in 0.5% GS) Alexa Fluor 488-conjugated anti-rabbit IgG and Alexa Fluor 488-conjugated anti-mouse IgG on a shaker.\nWash 3x with PBS on a shaker.\nMount slides with aqueous mounting medium containing DAPI and dry O/N.\nSeal the slides with nail polish and keep on 4 °C for further use (Figure 2a, b).\n6. In Vitro Decidualization in a Coculture System\nNOTE: Four to five animals are required to establish a coculture system in a 24-well plate. Continue with the following protocol in a sterile environment, preferably under a laminar flow cabinet.\nPrepare the cell culture inserts during the centrifugation and/or incubation steps of the epithelial cell isolation (as described in 4.3) in an additional 24-well plate.",
    "Add 200 - 400 µL of MESC medium into the desired amount of wells in the 24-well plate.\nPlace the inserts in the prefilled 24-wells using sterile forceps.\nResuspend the MEEC pellet (step 4.3.14) in MEEC medium and divide over the inserts (working volume: 150 - 300 µL per insert). Culture the cells at 37 °C in a 5% CO2 incubator.\nSeed the stromal cells in another 24-well plate (compatible with the cell culture inserts) after the second round of stromal cell isolation (step 4.5.6). Use a working volume of 400 µL cell suspension per well.\nAllow the stromal cells to attach for minimum 4 - 6 h at 37 °C in a 5% CO2 incubator.\nTransfer the cell culture inserts covered with epithelial cells from the first 24-well plate into the second 24-well plate covered by stromal cells. Use sterilized forceps or touch the inserts only at their hanging foot.\nCulture the cells at 37 °C in 5% CO2 incubator for a period of 3 - 5 d until the epithelial cells form a monolayer and the stromal cells achieve 80 - 90% confluency. Additionally, use the Transepithelial Electrical Resistance (TEER) to monitor the epithelial monolayer by use of a Volt/Ohm epithelial meter as described by Grant et al.7. Values of 800-1,000/well were sufficient to consider the epithelial monolayer confluent.\nIf necessary, replace the medium every 2 - 3 d using glass pipettes or fine pipet tips. Start with the replacement of the medium of the stromal cells (seeded at the bottom), before replacing the medium in the inserts. It is recommended to use preheated cell culture medium at 37 °C.\nPrepare the decidualization medium to induce in vitro decidualization before starting the experiment. Use a working volume of 400 µL per well of stromal cells.",
    "Prepare the following stock solutions and store aliquots at -20 °C.\n\t\t\nPrepare 250 µM medroxyprogesterone 17-acetate (MPA) in ethanol.\nPrepare 100 mM stock solution 8-Bromoadenosine 3′,5′- cAMP in ultrapure water.\nMake the decidual medium containing 1 µM MPA and 0.5 mM cAMP in MESC medium containing 2% FBS.\nGently remove the medium from the wells and add the decidual medium onto the stromal cells. If a control condition is needed, use the MESC medium containing 2% FBS.\nRemove the medium from the cell culture inserts and add 300 µL of MEEC medium onto the cells.\nIncubate the cells for 5 d in an incubator at 37 °C in 5% CO2.\nAfter the fifth day, assess the extent of decidualization in stromal cells by RT-qPCR (see below).\nValidate the viability of the epithelial cells using the Resazurin-based viability reagent.\n\t\nPrepare a 1:10 solution of viability reagent in MEEC medium.\nTransfer the cell culture inserts into a new 24-well plate.\nAdd 150 - 300 µL of the viability reagent - MEEC solution onto the cells.\nIncubate at 37 °C in 5% CO2 for at least 4 - 5 h or overnight and assess cell viability by observing a color shift (blue to purple/pink).\n\t\tNOTE: Decidualization can also be evaluated using a mouse prolactin-specific ELISA, as preferred by the researcher.\n7.Validation of Decidualization by qRT-PCR\nNOTE: For validation of the decidualization by qRT-PCR, it is recommended to perform all test-conditions in duplicate in order to receive a sufficient amount of cells for RNA analysis.\nQuantitative RT-PCR is performed as described previously in De Clercq et al.8.\nIn brief:\nIsolate the total RNA using a commercial RNA isolation kit.\n\t\nAssess the quantity and quality of the RNA using commercial methods according to manufacturer's protocol, respectively.",
    "Synthesize cDNA, according to manufacturer's protocol starting from 1 µg of total RNA.\nUse a commercial kit according to manufacturer's protocol to carry out the qRT-PCR reaction.\n\t\nRun all samples in triplicate.\nMake use of the commercial TaqMan Master Mix and specific TaqMan probes for the desired housekeeping genes and prolactin (prl8a2) to carry out the reaction."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}