{
  "id": 18204,
  "origin_website": "Jove",
  "title": "Creation of a Rodent Model of Abdominal Aortic Aneurysm by Blocking Adventitial Vasa Vasorum Perfusion",
  "procedures": [
    "Animal care and experiments were performed in accordance with the guidelines of the Hamamatsu University School of Medicine Animal Care Committee at the Center for Animal Care.\n1. Surgical Procedure for Creating the Model\nNOTE: Place the surgical instruments into a bead sterilizer for 10 s preoperatively. Use sterile gloves intraoperatively.\nUse male rats weighing 300 - 400 g. Allow the rats access to food and water ad libitum.\nAnesthetize the rat with isoflurane inhalation (2.0 - 3.0 mL/L). Confirm proper anesthetization by toe pinch.\nShave hair on the abdomen with an electric razor, and scrub the abdomen with alcohol and a povidone-iodine solution.\nPlace the rat in the supine position on the operation table. Use vet ointment on the rat's eyes to prevent dryness while under anesthesia.\nPerform a laparotomy with a ventral midline abdominal incision using a scissors. To secure a clear surgical field, pack the abdominal contents inside the abdominal cavity with sterile gauze using a wound retractor.\nTo detach the aorta from the perivascular tissue, gently pick up and tear the retroperitoneum with tweezers to expose the aortic wall and exfoliate the infrarenal aorta in the retroperitoneal space from the level of the left renal vein to the bifurcation from the perivascular tissue (Figure 1A).\nLigate the vessels branching from the abdominal aorta with a 5-0 silk string to block blood supply at a point away from the aorta that does not narrow the aortic lumen.\nTo block aortic blood flow, place vascular clips just below the renal artery and just above the bifurcation of the aorta.\n\tNOTE: The size of the clips should be larger than the aortic diameter to block the blood flow completely. A temporary 5-0 silk string ligature is also sufficient for blocking blood flow instead of the clips.",
    "Similar to creating a dot hemorrhage on the surface of the aortic wall, cut the anterior aortic wall using a micro-scissor 5 mm distally from the aortic clip, adjacent to the renal artery branches, to insert a polyurethane catheter.\nInsert a polyurethane catheter (outside diameter 0.55 mm, inside diameter 0.37 mm) using a 24-gauge indwelling needle shallowly through the incision to wash away blood in the aorta with water. Administer a 1-mL syringe filled with water into the polyurethane catheter, and wash away the remaining blood in the aorta with water. After irrigation, remove the catheter from the aorta.\nBefore inserting a polyurethane catheter (outside diameter 1.20 mm, inside diameter 0.94 mm) using an 18-gauge indwelling needle, cut the polyurethane catheter to 10 mm long (Figure 1B).\n\t\nInsert the cut piece of the polyurethane catheter into the aortic lumen from the incision made in step 1.9. Completely place the 10-mm catheter into the aortic lumen, and reposition the midpoint of the catheter to match the location of the incision (i.e., cover the incision with the catheter).\nRepair the incision with interrupted sutures using an 8-0 monofilament string (Figure 1C).\nLigate the abdominal aorta using a combination of 5-0 silk string and the polyurethane catheter (Figure 1D).\n\tNOTE: The aortic lumen can be maintained by the indwelling catheter. Ligate the aorta firmly to prevent misaligning the catheter position. The surgeon's knot is recommended, because it adds an extra twist when tying the first throw of the knot, forming a double overhand knot, and an additional turn provides more friction and can reduce loosening.\nAfter ligation, remove the vascular clip at the aortic bifurcation, and then, remove the vascular clip below the renal artery to restore the antegrade blood flow. Confirm gross aortic pulsation.",
    "Close the abdominal incision in two layers, the peritoneum and other layers, with a 4-0 polypropylene suture. Tightly suture the incision to prevent a protruded organ.\nApply topical lidocaine on the abdominal incision. Place the rat on a heating pad until consciousness returns. Do not leave a rat unattended until it has regained sufficient consciousness to maintain sternal recumbency. Do not return a rat that has undergone operation to the company of other rats until it has fully recovered.\nMonitor the rat closely after the operation. Inject a bolus of sterile saline (1.0 - 2.0 mL) subcutaneously if a rat shows signs of distress or body weight loss.\nPostoperatively, observe the time-course development of the enlarged aorta on an ultrasound echogram. Measure the maximum diameter from the inside edge to the outside edge of the abdominal aorta as described5.\n2. Harvesting, Fixing, and Elastica-van Gieson (EVG) Staining\nTwenty-eight days postoperatively, administer sodium pentobarbital ≥ 100 mg/kg intraperitoneally to euthanize the rats.\nCut open the rat's abdominal cavities ventrally. Make the initial incision using a scalpel. Harvest the aneurysm using scissors and place the harvested aortas in 10% neutrally buffered formalin for 24 - 48 h.\n\tNOTE: The surgeon must be careful to prevent injury to the aorta and other organs when exposing the aneurysm. An elevated abdominal organ should be observed, indicating AAA formation. Figure 2 shows an in vivo image and ex vivo image; this representative sample of AAAs is not ruptured.\nEVG staining9\nSolution Preparation\nPrepare Verhoeff's hematoxylin by mixing the following in the given order: alcoholic hematoxylin 20 mL, 10% ferric chloride 8.0 mL, and Lugol's iodine 8 mL. Mix the solution between each addition. This solution can be prepared fresh as needed.",
    "Prepare Van Gieson's solution by mixing 1% acid fuchsin 1 mL and saturated picric acid 45 mL. Allow to stand overnight and mix well. This solution is stable for 2 weeks.\nPrepare differentiating solution (2% ferric chloride) by mixing 10% FeCl3 10 mL in 40 mL distilled water. This solution may be prepared fresh as needed.\nPrepare 5% hypo by dissolving 5.0 g sodium thiosulfate in 100 mL distilled water. This solution is stable for 1 year.\nStaining procedure\n\t\tNOTE: See reference9 for details.\n\t\t\nBriefly, hydrate the fixed paraffin sections of the harvested aortas in distilled water for 10 min. Place the aortas in Verhoeff's hematoxylin for 25 min. Wash with water and dip 10-30 times in differentiating solution (2% FeCl3). Rinse in water. Place in 5% hypo for 1 min. Wash in water. Place in Van Gieson's solution for 5 min.\nDehydrate in alcohol in the following order: 75%, 90%, 95%, 100%, and 100% alcohol for 30 s each. Then, clear in xylene for 5 min, twice. Place on a coverslip with resinous mounting medium.\n\t\t\tNOTE: Elastic fibers appear blue-black to black; nuclei: blue to black; collagen: red; and other tissue elements: yellow."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}