{
  "id": 2216,
  "origin_website": "Cell",
  "title": "Evaluating the glycolytic potential of mouse costimulated effector CD8+ T cells ex vivo",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPreparation of OT-I donor-derived cells\nTiming: 2–3 h (Day -1)\nEuthanize OT-I mice according to your approved animal protocol.\nNote: Always follow your institution’s IACUC guidelines for all animal procedures.\nPlace mice on a clean dissection board.\nSpray mice with 75% ethanol to reduce bacterial contamination of cells.\nCollect spleen (troubleshooting 1[href=https://www.wicell.org#sec7.1]):\nMake a sub-cutaneous incision using sterile scissors.\nUsing sterile forceps remove the spleen from the abdomen, excising any excess of fat.\nPlace the spleen in a 12 well-plate filled with 2 mL of ice-cold BSS (see recipe in materials and equipment[href=https://www.wicell.org#materials-and-equipment]).\nNote: BSS can be stored at 4°C for up to 1 year.\nOptional: To increase the number of OT-I transgenic CD8+ T cells, lymph nodes (e.g., cervical, axillary, brachial and inguinal) can also be harvested.\nNote: The subsequent steps must be performed on ice to prevent cell death.\nObtain OT-I donor-derived splenocytes:\nPlace a 100 μm strainer on a 50 mL tube and crush spleen using a syringe plunger.\nRinse the strainer with ice-cold BSS and fill the 50 mL tube.\nCentrifuge at 400 g for 5 min at 4°C.\nDiscard the supernatant and resuspend the pellet with 5 mL of NH4Cl for RBC lysis (see recipe in materials and equipment[href=https://www.wicell.org#materials-and-equipment]) for 1 min (perform this step at RT).\nNote: NH4Cl can be stored at 4°C for up to 1 year.\nFill the 50 mL tube with BSS and gently mix.\nCentrifuge at 400 g for 5 min at 4°C.\nAlternatives: Other commercially available RBC lysis buffers can be used.\nNote: At this step, all red blood cells should be lysed. If a red pellet is still present, repeat steps d-g.\nResuspend pellet in 200–500 μL of BSS.\nCount splenocytes.\nNote: A hemocytometer or any automated cell counter can be used.",
    "Flow cytometry analysis (Figure 1[href=https://www.wicell.org#fig1]A):\nTransfer a small aliquot (at least 104 cells/well) to a flat-bottom 96 well plate.\nSpin the plate at 400 g × 3 min at 4°C, then flick buffer off while the cell pellet remains.\nWash by adding 200 μL of FACS buffer, spin, then flick.\nNote: FACS buffer can be stored at 4°C for up to 1 year.\nAdd 10 μL of Fc block 42 μg/mL (see materials and equipment[href=https://www.wicell.org#materials-and-equipment]) and incubate for 1 min at 21°C–25°C.\nNote: Fc block is necessary to prevent non-specific binding of primary antibodies to Fc receptors. Several aliquots can be made and stored at −20°C for up to 1 year. Once thawed, aliquots can be stored at 4°C for up to 1 year.\nAdd 50 μL of the surface staining mix (Table 1[href=https://www.wicell.org#tbl1]) and incubate 30 min at 4°C.\nWash twice by adding approximately 200 μL of FACS buffer.\nResuspend in 200 μL of FACS buffer.\nAcquire cells on a Flow Cytometer (we used an LSR II, BD).\nAnalyze using FlowJo.\nCritical: Always check that:\nAll CD8+ T cells are CD45.1+ and TCR Vα2+ TCR Vβ5+ (transgenic TCR) to ensure that the cells express the congenic marker (CD45.1) necessary to distinguish them from the recipient mice cells (CD45.2) and that the TCR transgene is conserved. This analysis will work as a rigorous quality control for the OT-I colony;\nOnly a minor percent of CD4+ cells are present (<5%); this analysis will also work as quality control. If a higher percentage of CD4+ cells is observed, either mice are not in the Rag−/− background or other cells expressing CD4 (e.g., some dendritic cell sub-populations) might have unexpectedly expanded. If this is the case we strongly suggest not to use those cells.\nWe find undetectable B cell levels (B220/CD45R+);",
    "None or very little cell activation (CD44+) (<10%) is observed;\nLess that 20%–25% of cell death is observed. If higher cell death is observed, mistakes during the cell preparation step have been made. We strongly encourage to discard the cells if this is the case.\nCalculate the number of single live CD8+ OT-I cells using the following formula (Figure 1[href=https://www.wicell.org#fig1]B): No. of CD8+ OT-I = total cells × (% lymphocytes) × (% single cells) × (% live) × (% CD8+) × (% Vα2+ Vβ5+).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1690-Fig1.jpg\nFigure 1. Gating strategy to phenotype OT-I cells\n(A) Flow cytometry analysis of surface stained splenocytes from CD54.1+ Rag −/− OT-I mice. This gating strategy allows to phonotype OT-I mice and calculates the percentage of single, live CD8 OT-I cells (top panel). A representative plot is shown.\n(B) Example of how to calculate the percentage of single live CD8+ OT-I cell based on flow cytometry analysis shown in Figure 1[href=https://www.wicell.org#fig1]A.\ntable:files/protocols_protocol_1690_6.csv\nAdoptive transfer and immunization\nTiming: adoptive transfer 10–20 min (Day -1)\nTiming: immunization 10–20 min (Day 0)\nImmediately after the flow cytometry analysis, splenocytes from CD45.1+ Rag−/− OT-I mice are adoptively transferred to CD45.2+ C57BL/6J recipient mice. One day after, the ovalbumin (OVA) peptide specific for the transgenic CD8+ T cells (SIINFEKL) is i.p. injected, leading to the activation of antigen-specific CD8+ T cells. At the same time, the costimulatory agonists α-CD134 (OX-40)/CD137 (4-1BB) mAbs are injected to induce antigen-specific CD8+ T cell effector differentiation followed by their survival (Lee et al., 2004[href=https://www.wicell.org#bib3], 2007[href=https://www.wicell.org#bib4]).\nPrepare the splenocyte suspension from OT-I mice such that each recipient mouse will receive 0.5 × 106 CD8+ OT-I cells in 50–100 μL.\nPrepare a 1 mL syringe with the splenocyte suspension and a 27 G × 1/2″ needle (Figure 2[href=https://www.wicell.org#fig2]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1690-Fig2.jpg\nFigure 2. Retro orbital injection",
    "(A) Prepare a 1 mL syringe and a 27 G 1/2″ needle.\n(B) After anesthesia, the index and the thumb of the non-dominant hand are used to draw back the skin above the eye to allow the eye to slightly protrude.\n(C) Carefully insert the needle (bevel up) at an angle of about 45ᵒ to the conjunctival membrane.\nCritical: Longer or thicker needles must be avoided to prevent eye damage.\nAnesthetize C57BL/6J mice using isoflurane or other appropriate anesthetic, such as ketamine.\nNote: Always follow your institution’s IACUC guidelines for anesthesia procedures.\nCarefully inject about 50 μL of the splenocyte suspension i.v. by retro-orbital injection or other preferred i.v. injection routes (e.g., tail vein injection):\nPut the mouse on its side.\nWith the index and the thumb of the non-dominant hand, draw back the skin above the eye to allow the eye to protrude (Figure 2[href=https://www.wicell.org#fig2]B).\nInsert the needle (bevel up) at an angle of about 45ᵒ to the conjunctival membrane (Figure 2[href=https://www.wicell.org#fig2]C).\nInject into the retro-bulbar sinus.\nPause a second or so to avoid back pressure reflux.\nGently remove the needle to prevent bleeding or any eye injury.\nWait for the mice to recover form anesthesia.\nAfter 18–20 h, immunize the recipient mice with SIINFEKL and costimulatory antibodies (α-CD134/CD137):\nPrepare the injection solution in sterile PBS such that each recipient mouse will receive 50 μg of SIINFEKL, 20 μg of α-CD134 and 10 μg of α-CD137.\nAlternatives: to maintain antigen-specific CD8+ T cell differentiation and survival, other adjuvants, such as TLR agonists, can be used (Myers et al., 2006[href=https://www.wicell.org#bib7]).\nInject 100 μL of this solution i.p.\nAlternatives: The immunization step can be done the same day of the adoptive transfer. In this case we recommend to wait for at least 2 h after the adoptive transfer.",
    "Critical: Perform the immunization step within 24 h after the adoptive transfer, as unstimulated CD8+ OT-I cells do not survive long in vivo.\nCD8+ OT-I cell isolation\nTiming: 4–5 h (Day 4)\nWe suggest to start the isolation step on day 4 post-immunization, since at this time, effector CD8+ T cells are highly glycolytic (Agliano et al., 2022[href=https://www.wicell.org#bib1]; Tsurutani et al., 2016[href=https://www.wicell.org#bib10]), whereas at longer time points their glycolytic potential decreases (Tsurutani et al., 2016[href=https://www.wicell.org#bib10]). Moreover, on day 4, antigen-specific CD8+ T cells are greatly expanded, as confirmed by total splenocyte number of immunized mice compared to non-immunized mice (Figure 3[href=https://www.wicell.org#fig3]A). Isolation of total CD8+ T cells has been performed using a bead-based negative selection (Dynabeads untouched mouse CD8 cells kit; Cat# 11417D, Thermo Fisher). A cocktail of rat antibodies against CD4+ T cells, B cells, NK cells, monocytes/macrophages, dendritic cells, erythrocytes, and granulocytes (non-CD8+ cells) is added to the sample. Next, magnetic beads coated with anti-rat antibodies are added to bind the antibody-labeled non-CD8+ cells. After a short incubation, the bead-bound cells are then separated from unbound cells in 1–2 min using a magnet. A second negative selection step, using a biotinylated α-CD45.2 mAb is necessary to obtain highly enriched CD45.1+ CD8+ OT-I cells (Figure 4[href=https://www.wicell.org#fig4]A). The use of negative selection steps will avoid bouts of CD8+ OT-I activation due to antibody binding. If preferred, CD45.1+ CD8+ OT-I cells can be isolated by sorting via flow cytometry.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1690-Fig3.jpg\nFigure 3. Cell number expected outcome\n(A) Number of splenocytes from non-immunized C57BL/6 mice and immunized C57BL/6 mice that previously received naïve CD45.1+ OT-I cells.",
    "(B) Number of CD8+ OT-I cells isolated from immunized C57BL/6 mice that previously received naive CD45.1+ OT-I cells. An average of three independent experiments is shown. Each dot represents an individual mouse. Data are represented as mean ± SEM. ∗∗∗p<0.001 by two-tailed unpaired t test.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1690-Fig4.jpg\nFigure 4. CD8+ OT-I cell isolation timeline and expected outcome\n(A) Schematic timeline showing how to isolate CD8+ OT-I cells from a mouse splenocyte suspension, using two negative selection bead-based steps.\n(B) Percentage of OT-I cells out of total CD8 T cells at day 4 post-immunization with SIINFEKL.\n(C) Purity yield after CD8 T cell isolation with beads.\n(D) Purity yield after CD45.1 isolation with beads. Data show representative plots.\nNote: The following steps are for isolation of 5 × 107 cells. Scale all volumes depending on cell number.\nSplenocyte isolation.\nIsolate splenocytes as described in steps 4 and 5.\nNote: At this step, the spleen of recipient mice should appear highly enlarged due to the clonal expansion of antigen-specific CD8+ T cells.\nResuspend splenocytes in 500 μL of isolation buffer (see recipe in materials and equipment[href=https://www.wicell.org#materials-and-equipment]) in a 50 mL tube.\nNote: Store isolation buffer at 4°C for up to 6 months.\nCount cells and save an aliquot for flow cytometry analysis (see step 7) (troubleshooting 2[href=https://www.wicell.org#sec7.3]).\nFor the remaining cell suspension add 100 μL of heat-inactivated FBS.\nAlternatives: Heat-inactivated (fetal calf serum) FCS can also be used.\nAdd 100 μL of antibody mix (cocktail containing rat IgGs that bind mouse CD4+ T cells, B cells, NK cells, monocytes/macrophages, dendritic cells, erythrocytes, and granulocytes).\nMix and incubate for 30 min at 4°C with rotation.\nWash the cells by adding 10 mL of isolation buffer and mix well.\nCentrifuge at 350 g for 8 min at 4°C.",
    "Wash depletion beads (coated with an anti-rat IgG antibody):\nResuspend beads by vortexing for >30 s.\nTransfer 1 mL of beads to a 15 mL tube.\nAdd 1 mLof isolation buffer and mix (If cells are > 5 × 107 scale up volume. If cells are <5 × 107 still use 1 mL).\nPlace the tube in the magnet (DynaMag-15, Cat# 12301D, Thermo Fisher Scientific) for 1 min.\nDiscard the supernatant.\nResuspend the washed beads in the same volume used in step b.\nResuspend the cells in 4 mL of isolation buffer.\nAdd 1 mL of pre-washed beads.\nIncubate for 30 min at 4°C with rotation.\nAdd 5 mL of isolation buffer.\nResuspend by gently pipetting 5 times. Avoid foaming.\nPlace the 50 mL tube in the magnet (DynaMag-50, Cat# 12302D, Thermo Fisher Scientific) for 2 min.\nPour the supernatant containing the untouched CD8+ T cells into a new sterile 50 mL tube.\nCentrifuge at 400 g for 5 min at 4°C.\nResuspend pellet in 1 mL of isolation buffer and count.\nSave an aliquot for flow cytometry analysis to test for purity.\nNote: The following steps are for isolation of 1 × 107 cells. Scale all volumes depending on cell number.\nTransfer the cell suspension in a 15 mL tube and add 10 μg (adjust antibody amount if cells are > or < 1 × 107) of the biotinylated α-CD45.2 mAb (#13-0454-85, Thermo Fisher).\nIncubate for 20 min at 4°C with rotation.\nWash cells by adding 2 mL of isolation buffer.\nCentrifuge at 350 g for 8 min at 4°C.\nResuspend the cells in isolation buffer to 1 × 107/mL.\nWash biotin binder beads (coated with recombinant streptavidin) (#11047, Thermo Fisher):\nResuspend beads by vortexing for >30 s.\nTransfer 100 μL of beads to a 1.5 mL tube.",
    "Add 1 mL of isolation buffer and mix (If cells are > 1 × 107 scale up volume. If cells are <1 × 107 still use 1 mL).\nPlace the tube in the magnet (DynaMag-15) for 1 min.\nDiscard the supernatant.\nResuspend the washed beads in the same volume used in step b.\nIncubate for 30 min 4°C with rotation.\nAdd 1 mL of isolation buffer to limit trapping of unbound cells.\nPlace the 15 mL tube in the magnet (DynaMag-15) for 2 min.\nPour the supernatant containing the untouched CD45.1+ CD8+ T cells into a new tube.\nCount cells.\nSave an aliquot for flow cytometry analysis (troubleshooting 3[href=https://www.wicell.org#sec7.5]).\nCheck cell viability (troubleshooting 4[href=https://www.wicell.org#sec7.7]).\nMeasurement of glycolytic potential\nTiming: 3–4 h (Day 4)\nSet up the Seahorse Analyzer:\nIn the Wave software, open the glycolysis stress test template.\nAdd your experimental details. Instructions on how to fill the template can be found on the Agilent website: https://www.agilent.com/en/product/cell-analysis/how-to-run-an-assay[href=https://www.agilent.com/en/product/cell-analysis/how-to-run-an-assay].\nMedium preparation.\nSupplement the Seahorse XF DMEM medium pH 7.4 with no phenol red (# 103575 100, Agilent) with 2 mM glutamine.\nRemove the sensor cartridge from the 37°C non-CO2 incubator, aspirate the dH2O from the utility plate and add 200 μL/well of warm calibrant. Leave in the incubator for 45–60 min.\nCritical: the 37°C non-CO2 incubator is absolutely necessary to prevent a pH alteration of the Seahorse reagents.\nCount the isolated CD8+ OT-I cells.\nCentrifuge cells at 400 g for 5 min at 4°C and resuspend in Seahorse medium at a concentration of 6 × 106 cells/mL.\nDispense 50 μL of the cell suspension to each well. We suggest to plate 0.3 × 106 cells/well and to use three technical replicates per sample.",
    "Critical: Dispense 50 μL of medium with no cells in the background wells (four corners of the plate). Plating less than 0.3 × 106 CD8+ T cells/well may result in weak ECAR detection.\nCentrifuge plate at 200 g for 1 min without brake.\nPlace the plate in a 37°C non-CO2 incubator for 15–25 min.\nTake the sensor cartridge out from the incubator and add the compounds (for optimized compound dilutions, see Table 2[href=https://www.wicell.org#tbl2]). Instructions on how to correctly load the sensor cartridge can be found at: https://www.agilent.com/cs/library/usermanuals/public/DAY%20OF%20LOADING%20CARTRIDGE%20XFe96-XF96.pdf[href=https://www.agilent.com/cs/library/usermanuals/public/DAY%20OF%20LOADING%20CARTRIDGE%20XFe96-XF96.pdf].\ntable:files/protocols_protocol_1690_7.csv\nCritical: When loading the compounds to the injection ports ensure to not touch the bottom of the port with the pipette tips and avoid air bubbles.\nRemove the plate from the incubator and check with a microscope that the cells are attached to the bottom of the wells (troubleshooting 5[href=https://www.wicell.org#sec7.9]).\nSlowly add 125 μL of Seahorse medium without disturbing the cells.\nNote: At this step, inhibitors, drugs or metabolites can be added to the cells as pre-treatment.\nReturn the plate to the 37°C non-CO2 incubator for 15–25 min.\nInsert the sensor cartridge with the utility plate in the Seahorse analyzer and start calibration (duration ∼ 30 min).\nOnce calibration is over, discard the utility plate and insert the cell plate into the machine.\nStart the assay (duration ∼ 2 h).\nRemove the plate from the machine.\nAnalyze data. We recommend using GraphPad Prism (troubleshooting 6[href=https://www.wicell.org#sec7.11] and troubleshooting 7[href=https://www.wicell.org#sec7.13]).\nIf users suspect that wells do not contain the same number of cells or if a treatment or manipulation that affects cell proliferation is used, normalization must be performed (e.g., using protein quantification or DNA content Hoechst staining). For more details on how to perform normalization please refer to: https://www.agilent.com/cs/library/technicaloverviews/public/Methods_and_Strategies_for_Normalizing_Tech_Overview_022118.pdf[href=https://www.agilent.com/cs/library/technicaloverviews/public/Methods_and_Strategies_for_Normalizing_Tech_Overview_022118.pdf].",
    "Note: Oligomycin should be titrated to select the minimum concentration needed to achieve a maximal increase in ECAR (glycolytic reserve capacity)."
  ],
  "subjectAreas": [
    "Immunology",
    "Metabolism",
    "Cell Isolation",
    "Flow Cytometry",
    "Cell Biology",
    "Cell-Based Assays"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}