{
  "id": 19074,
  "origin_website": "Jove",
  "title": "Modeling Colitis-Associated Cancer with Azoxymethane (AOM) and Dextran Sulfate Sodium (DSS)",
  "procedures": [
    "1. Colitis-associated Cancer Induction \nSet aside cages of sex and age-matched 6-8 week old mice to be used for experimental and control groups. Mice can be individually labeled with tail markings or ear clips.  \nOn day 0, record baseline weights and inject each mouse intraperitoneally (IP) with 10 mg/kg of AOM working solution (1 mg/ml in isotonic saline, diluted from 10 mg/ml stock solution in dH2O kept at -20 deg C). Based on experience, this dose can be adjusted between 7-14 mg/kg and/or repeated early in the experiment. \nCaution: AOM is a volatile genotoxic agent and should be handled carefully according to the accompanying MSDS. Dilutions should be prepared in a chemical hood, maintained on ice, and discarded following institution specific protocols.\nMake a 2.5% (2.5 g/100 ml) DSS solution in distilled water and pass through a 0.22 μm cellulose acetate filter by vacuum. This dose can be adjusted between 1-3.5% depending on mouse strain and environment. Once prepared, DSS solution can be kept refrigerated for up to 1 week.    \nOn day 7, supply DSS solution to mice as their drinking water. Approximately 250 ml/cage will be needed every time new DSS is provided for a maximum of 5 mice/cage; however, these are only estimations and will vary depending on the type of water bottles used in your animal facility. \nTo provide a continuous supply of DSS for seven days, DSS solution should be replaced in clean bottles three times (every 2-3 days) during this period.  Some investigators measure the amount of DSS consumed prior to replacing with new solution as a measure of exposure. \nOn day 14, switch cages back to standard drinking water for two weeks.",
    "Repeat steps (1.4) - (1.6) on days 28 and 49 to provide a second and third cycle of DSS. A DSS \"cycle\" consists of one week of DSS in the drinking water followed by 2 weeks of regular (autoclaved) water. \n2. Clinical Assessment Colitis and Tumor Progression\nMice should be weighed/observed 2-3 times per week. Percent weight loss relative to baseline is used as a surrogate measure of colitis severity. Regular assessments of rectal bleeding, diarrhea, or prolapse can be made depending on experimental goals and reported according to various scoring systems.9, 10 \nA weight loss of up to 10% along with 2-3 days of diarrhea and rectal bleeding can be expected in the week following a full cycle of DSS (daily observation may be useful during this immediate post-DSS period).  \nIt is possible that some mice may not recover; mice losing greater than 20% of their weight are less likely to survive and may require early euthanasia. A single IP injection of 0.5 - 1.0 ml saline in such mice can be a useful supportive measure towards correcting fluid volume lost due to diarrhea.\n3. Murine Endoscopy (Optional)\nEndoscopy following the second or third cycle of DSS can be performed to confirm tumor growth in vivo prior to sacrifice. As the AOM/DSS model is quite reliable in producing tumors, this step is generally not necessary. Only a few mice should evaluated using this method, as it has the potential to disrupt mouse tumors.11 \nAnesthetize the mouse with inhaled or injectable sedation.    \nAfter mouse is anesthetized, secure the mouse to a flat board with tape at the tail and chest.",
    "Advance the murine endoscope into the mouse rectum gently using saline to inflate and irrigate to improve intraluminal view and remove fecal contents.  (Note that endoscopy can also be performed using air insufflation as an alternative to saline and this technique may offer improved visualization of the tumor.12)  \n4. Mouse Sacrifice and Colon Harvesting\nOn day 70, each AOM/DSS treated mouse should harbor multiple colon tumors and be ready for assessment. This date can be delayed weeks to months if larger tumors are desired.   (Of note, mice with severe rectal prolapsed may need to be euthanized early to avoid excessive discomfort to animals as per institutional animal care committees.) \nPrior to necropsy, individually euthanize mice with isoflurane and cervical dislocation (or other institutionally-approved method). Final weight and other measurements can be made at this time. \nLay the mouse with its ventral side exposed on a cutting board. Cover the abdomen with 70% ethanol to prevent hairs from contaminating the abdominal contents during extraction of the colon. \nUse forceps to grasp the midline of the abdomen and make a small incision to expose the peritoneum. \nExtend this incision on each side of the abdomen along the costal margin. \nUse scissors to cut through the pelvis so that the colon can be harvested down to the anorectal junction. This is important because DSS colitis injury is greatest at the distal rectum and correspondingly, this is the region of greatest tumor development. \nAdditional tissues such as mesenteric lymph nodes may also be harvested at this time. \n5. Preparing the Colon for Macroscopic Analysis",
    "Using an 18G gavage needle attached to a 5 ml syringe, flush the colon with ice-cold phosphate-buffered saline (PBS) such that fluid exits in the physiologic direction. If colon tissue will be used for RNA or protein-based analysis, it can be kept cold by employing pre-chilled work trays.    \nOpen the flushed colon longitudinally along its mesentery and paint onto the cold tray. Tumors are more easily visualized when the colon is placed on a dark surface.  Alternatively, 1% Alcian blue dye can be applied to highlight tumors. Assess tumor number and size with a ruler or digital caliper. \nSmall sections of tumor and adjacent normal tissue can be excised at this point for future analysis by RNA, protein, or immunohistochemical (IHC) methods, leaving some portion of the remaining colon for histological assessment. \nDigital photography of the gross colon specimens immediately following step 5.2 can be helpful for precise analysis of tumor burden, especially if significant portions of the colons are excised for other forms of analysis as described above. Tumor burden (%) can be calculated as tumor area/total colon area using free software such as ImageJ.\n6. Preparing the Colon for Histological Assessment\nApply 10% formalin to the remaining colon on the cold tray via syringe or finger. Allowing the tissue to fix for at least 30 sec in this manner facilitates transfer to the fixation basin. Ensure residual formalin is wiped off prior to painting a new opened colon on the same tray.    \nTransfer colons to a basin filled with 10% formalin and pin down at edges. \nAfter 3 hr of fixation, transfer colons to 70% ethanol. Colons can be preserved in 70% ethanol indefinitely.",
    "Three longitudinal sections of colon (proximal, mid, distal/rectum) can be stabilized in 2% agar and submitted for paraffin embedding. Assure that the proximal colon and distal colon/rectum are oriented in a uniform manner for each mouse. \nDysplasia, crypt damage, and inflammation can be described and assessed by an experienced individual according to previously published protocols.10, 13-15 Mice can be sacrificed prior to day 70 if the experimenter is interested in detecting early dysplastic events. \n7. Representative Results\nThe AOM/DSS model described herein allows the researcher to reliably generate colon tumors in mice.  Tumor growth in this model is directly influenced by the associated inflammatory process.  Colitis severity should be monitored clinically by following weight loss and presence of diarrhea/hematochezia (Figure 2). These signs of disease activity tend to begin by day 5 of the DSS cycle and for four or more days after DSS is removed. Rarely, mice with a significant rectal tumor burden can develop rectal prolapse. After the second or third DSS cycle diarrhea may become persistent.  Typically tumors are present and identifiable by murine colonoscopy prior to the third cycle of DSS (Figure 3). Additional time and a third course of DSS results in larger tumors at the time of harvest (Figure 4). Use of topically applied Alcian blue stain may be used to highlight tumors (Figure 5). Photographs of colonic tumors will assist in generating tumor measurements which can be used to quantitatively compare tumor production and size between experimental groups (Figure 6). Fixed and paraffin embedded colon specimens can then be evaluated for histology or with the use of immunohistochemical staining (Figure 7 and 8).\nimgsrc://cloudfront.jove.com/files/ftp_upload/4100/4100fig1.jpg",
    "Figure 1.  Schematic of AOM and DSS administration. AOM (10 mg/kg) is injected on day 0. At the beginning of the second week (day 7),  2.5% DSS solution is administered to mice in their drinking water. Seven days of DSS is followed by two weeks of autoclaved water. An additional two cycles of DSS are administered prior to sacrifice. \nimgsrc://cloudfront.jove.com/files/ftp_upload/4100/4100fig2.jpg\nFigure 2.  Mouse weight relative to baseline during AOM and DSS administration. Note that in the week following each DSS cycle, mice lose 5-10% of their body weight. Weight loss in this experiment is a surrogate marker for colitis severity. \nimgsrc://cloudfront.jove.com/files/ftp_upload/4100/4100fig3.jpg\nFigure 3.  View of tumors in distal colon via murine endoscopy at day 50 of AOM/DSS treatment. Note the multiple polypoid masses obstructing the lumen of the distal colon (b, c) in comparison to the normal colon (a).\nimgsrc://cloudfront.jove.com/files/ftp_upload/4100/4100fig4.jpg\nFigure 4.  Longitudinally opened mouse colon illustrating gross appearance of tumors. Note the higher tumor burden in the distal colon/rectum (left upper image), and the characteristic rugated texture of the proximal colon (right upper image) with little tumor growth. A close up view of the distal colon shows numerous tumors of varying sizes (below). \nimgsrc://cloudfront.jove.com/files/ftp_upload/4100/4100fig5.jpg\nFigure 5.  Tumors highlighted by application of Alcian blue stain. Note how the dye emphasizes the normal texture of the colon as well as the borders of each individual tumor. Such staining can be helpful in the precise measurement of tumor areas by ruler or digital measurement. \nimgsrc://cloudfront.jove.com/files/ftp_upload/4100/4100fig6.jpg\nFigure 6.  Representative distribution of the average number of tumors per mouse treated with AOM/DSS. Note the majority of tumors are located in the distal colon and are <2 mm in size. \nimgsrc://cloudfront.jove.com/files/ftp_upload/4100/4100fig7.jpg",
    "Figure 7.  Paraffin-embedded longitudinal sections of colon in cassette (above) and on slide following H&E stain (below). Note that residual Alcian blue stain does not interfere with H&E staining. A large tumor is circled on the slide image (circled). The designations \"distal,\" \"middle,\" and \"proximal\" result from sectioning the entire colon in thirds between the cecum and anus.\nimgsrc://cloudfront.jove.com/files/ftp_upload/4100/4100fig8.jpg\nFigure 8.  Representative histology of a tumor resulting from AOM/DSS administration in the distal colon. H&E, BrdU, and β-catenin stained slides at 50X (Top panel) and 400X (Bottom panel) respectively demonstrate dysplastic changes similar to human adenocarcinomas of the colon. Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}