{
  "id": 7350,
  "origin_website": "Bio",
  "title": "Construction of DNA/RNA Triplex Helices Based on GAA/TTC Trinucleotide Repeats",
  "procedures": [
    "Initial Construction of a DNA Triple HelixOpen Discovery Studio Visualizer.First, build up a homopurine/homopyrimidine B-DNA double helix with the desired sequence. The basic strategy of building a triple helix model is shown in Figure 2.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4155/bioprotoc-11-18-4155-g002.jpgFigure 2. Scheme illustrating the construction of a triple helix For example, suppose we want to build up the parallel sequence as shown in Figure 3(a).Change the display style to arrows and rings and turn off the atom display style.Select the wanted strand (all purine or all pyrimidine) and then select copy and paste. If a shifted triplex sequence is desired, then change the residues name on the third strand to the desired sequence. Next, copy and paste the pyrimidine strand from the duplex, as shown in Figure 3(b), to get the sequence Figure 3(c).As the desired triplex involves a shifted sequence, rename the residue name to obtain Figure 3(d).Carefully put the pasted strand into the major groove of the DNA duplex with the desired orientation, as shown in Figure 4 and in Video 1. Then our example sequence thus becomes Figure 3(e).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4155/bioprotoc-11-18-4155-g003.jpgFigure 3. Sample sequence for our procedure. (a) represents the triplex we want to build. (b) is initial duplex from which we obtained the strand shown in (c).The shifted strand obtained from the previous step is shown in (d). This shifted strand is placed into the major groove of the duplex as shown in (e). Protonating the cytosines in the third strand finally leads to (a).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4155/bioprotoc-11-18-4155-g004.jpgFigure 4. Snapshot for the placement of the third strand into the major groove of the DNA duplex <p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. A short illustration of how we build up the initial model of a triple helix Roughly adjust the position of each residue to avoid any overlap between the residues, as shown in Video 1.",
    "For example, when the oxygen atoms on the phosphate groups are too close, we manually slightly move the position of one of the oxygen atoms.Change the name of the third-strand bases to construct the desired sequence. Name protonated DC just DC, protonated DA just DA, etc. (same for RNA). We will illustrate how to deal with the protonated cases later.Change the display style back to atom/ball and stick.Precisely adjust each atom on the third strand to avoid high potential energy collisions during subsequent MD runs and to construct the hydrogen bond structure as illustrated in Figure 5 and Figure 6.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4155/bioprotoc-11-18-4155-g005.jpgFigure 5. Final conformation for the example given in Figure 3 and built through steps 1-14. imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4155/bioprotoc-11-18-4155-g006.jpgFigure 6. Initial hydrogen bond constraints for a DNA triple helix Select edit, select. Change the property to be element, then select hydrogen. After selecting all hydrogen atoms, type Del to delete all hydrogen atoms as some of the hydrogen atoms’ names are different than those in Amber and will cause errors.Save the structure as PDB.Edit the PDB file, deleting all the connection relations at the end of the PDB file.If there are protonated bases in the desired sequence, change the corresponding residue name DC to DCP, DA to DAP. If the protonated C is at 5’, rename it as D5C. If the protonated C is at 3’, rename it as D3C. If the protonated A is at 5’, rename it as D5A. If the protonated A is at 3’, rename it as D3A, etc. While this nomenclature seems somewhat arbitrary and inconsistent, it is mandated by the fact that tLeap (included in Amber) only recognizes three letters at most. Then our example sequence will be Figure 3(a). The configuration is shown in Figure 5.Go to section E.",
    "Initial Construction of DNA·RNA:DNA Hybrid Triple HelixOpen Discovery Studio Visualizer.Build up a homopurine/homopyrimidine B-DNA or A-DNA double helix with the desired sequence.Change the display style to arrows and rings and turn off the atom display style.Repeat steps 4-7 in section A.Select the desired strand and change it from DNA to RNA. This is done by selecting the desired part of nucleic acid and then clicking the “Ribose” on the options manual “Modify Sugar.”Repeat steps 8-14 in section A.Initial Construction of RNA·DNA:DNA Hybrid Triple HelixOpen Discovery Studio Visualizer.Load the DNA triple helix that has been stabilized after MD (in our case, at the end of 1 µs MD simulation [Zhang et al., 2020]) with the desired sequence (where T’s will be exchanged by U’s as described below). Possible initial hydrogen bond patterns for this structure are given in Figure 7.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4155/bioprotoc-11-18-4155-g007.jpgFigure 7. Initial hydrogen bond constraints for RNA·DNA:DNA and RNA triple helices Change the terminal residue, such as DG5, back to DG in order to avoid errors.If there are protonated bases, change them back to ordinary bases.Change the wanted part from DNA to RNA.Repeat steps 10-12 in section A.If there are protonated bases in the wanted sequence, change the corresponding residue name C to CP and A to AP. If the protonated C is at 5’, rename it as C5P. If the protonated C is at 3’, rename it as C3P. If the protonated A is at 5’, rename it as A5P. If the protonated A is at 3’, rename it as A3P.Go to section E.Initial Construction of RNA Triple HelixRepeat all steps of section C.Details of Molecular Dynamics SimulationsUse tLeap in the Amber package to generate the topological file, initial coordinate file, and complete PDB file. We use the BSC1 force field (Ivani et al., 2016), BSC0 (Pérez et al.",
    ", 2007) + OL3 (Zgarbová et al., 2011) force field, and protonated Amber forcefield (Weiner et al., 1986).Use periodic boundary conditions.The unit cell size should be large enough to avoid the self interaction between nearest nucleic acids, whose distance must be larger than the electrostatic and van der Waals cutoff (9 Å). In our example, there are about 840-870 atoms in each triplex, and we need to create an octahedral box that respects this distance. For this, we set the minimum distance between the nucleic acid and the box boundary as 8 Å, which results in a box size ~90,000 Å3. After this, TIP3P (Jorgensen et al., 1983) water molecules are added randomly to the box. (Figure 8)imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4155/bioprotoc-11-18-4155-g008.jpgFigure 8. Illustration of an octahedral box of triplex We use Na+ ions (Joung et al., 2008) to neutralize the system. The number of Na+ equals the number of negative charges in the triplex.Add hydrogen bond constraints, as shown in Figure 6 (with some T replaced by U) or Figure 7. Add the hydrogen bond constraints as instructed by the website: https://ambermd.org/tutorials/advanced/tutorial4/index.htm[href=https://ambermd.org/tutorials/advanced/tutorial4/index.htm]. Edit: ${AMBERHOME}/dat/map.DG-AMBER if there is any error reported. Add some sentences like this to the file:RESIDUE C3PMAPPING H3 = H3Example hydrogen bond constraint input file can be written as:1 DG5 H21     18 DC3 O2             1.9     1.91 DG5 H1       18 DC3 N3             1.9      1.91 DG5 O6       18 DC3 H41           1.9      1.91 DG5 O6       18 DC3 N4              2.9      2.91 DG5 N1       18 DC3 N3              2.9      2.91 DG5 N2       18 DC3 O2              2.9      2.99 DA3 N1         10 DT5 H3             1.9      1.99 DA3 H61       10 DT5 O4             1.9      1.99 DA3 N6          10 DT5 O4            2.9      2.99 DA3 N1          10 DT5 N3             2.9      2.927 D3A H1        1 DG5 O6              1.9      1.927 D3A N1        1 DG5 O6              2.9      2.927 D3A H61       1 DG5 N7              1.9      1.",
    "927 D3A N6         1 DG5 N7              2.9      2.919 DG5 H21       10 DT5 O4             1.9      1.919 DG5 N2         10 DT5 O4             2.9      2.919 DG5 H1         10 DT5 O4             1.9      1.919 DG5 N1         10 DT5 O4             2.9      2.919 DG5 O6          9 DA3 H62            1.9      1.919 DG5 O6          9 DA3 N6              2.9      2.9Perform MD simulations to optimize the initial structures. Set the electrostatic cutoff to be 9.0 Å. Set the van der Waals cutoff to be 9.0 Å. Use Langevin dynamics with a coupling parameter of 1.0 ps-1 to control the temperature. Use the SHAKE algorithm to deal with bonds involving hydrogen atoms. The MD simulation for nucleic acids is explained in detail in Šponer and Filip (2006).Minimize the energy for the initial conformations obtained by modeling: initially, keep the nucleic acid and ions fixed; then, slowly (in steps) lift the constraints, allowing them to move.Then gradually raise the temperature from 0 to 300 K over a 50 ps run with a 1 fs time step with the nucleic acid and ions constrained.Then use a 100 ps run at constant volume to gradually reduce the restraining harmonic constants for nucleic acids and ions.Then use a 1 µs run at constant pressure to gradually optimize the volume of the unit cell; the Berendsen pressure coupling method is the one used.The final structure of the MD simulation may be used as the initial structure for further research."
  ],
  "subjectAreas": [
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}