{
  "id": 3710,
  "origin_website": "Cell",
  "title": "Isolation and characterization of extracellular vesicles produced by cell lines",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nNote: This protocol is modified from (Latifkar et al., 2019[href=https://www.wicell.org#bib4]).\nSerum starve cells: day 1\nTiming: 10 min per experimental condition to exchange the growth medium with serum-free medium (i.e., serum starve two 150-mm tissue culture dishes of cells); 6–14 h of serum starvation to generate the conditioned medium\nCulturing cells in medium devoid of serum is critical for the isolation of EVs produced by a given cell type. FBS and calf serum (CS) contain large amounts of vesicles that, if not removed from the culturing medium, will be present together with the EVs isolated from cells.\nCritical: Caution: All steps described in this section must be carried out in a biosafety cabinet under sterile conditions.\nAspirate the serum-containing (i.e., growth) medium from two nearly confluent 150 mm plates of cells and rinse them with 15 mL of sterile, 37°C PBS per dish.\nAspirate the PBS.\nRepeat the rinse step two additional times.\nNote: Serum-free medium can also be used for the wash steps.\nRinse each plate of cells with 10 mL of serum-free medium that had been warmed to 37°C. For MDA-MB-231 cells this is RPMI-1640 medium.\nAspirate the medium from the cells.\nNote: All rinsing steps should be performed gently, as to not cause cell detachment.\nAdd 20–22 mL of serum-free RPMI-1640 medium that was warmed to 37°C into each 150 mm dish of cells and culture them in a cell incubator (37°C, 5% CO2) for a minimum of 6 h to as long as 14 h. We suggest a minimum of 6 h of serum starvation be used, so that the cells release enough EVs for isolation purposes. Longer duration of serum starvation can result in better EV yields.",
    "Critical: The length of serum starvation used to generate the conditioned medium can vary depending on how sensitive the cells being used are to dying when deprived of nutrients (i.e., serum starved). It is important to make certain that the serum-starved cells are still viable when collecting the conditioned medium (see below), as fragments of dead cells can contaminate the MV and exosome preparations.\nCollecting conditioned medium and cell lysis: day 2\nTiming: 1–1.5 h\nThe conditioned medium is collected from cells and placed in 50 mL conical tubes. The samples are subjected to low speed centrifugation to remove intact cells and cell debris from the conditioned medium. At this point, the partially clarified medium contains soluble factors (i.e., growth factors), MVs, and exosomes.\nNote: The transfer of medium between tubes (i.e., conical and ultracentrifuge tubes) must be carried out in a sterile tissue culture hood. All centrifugation steps should be performed at 4°C. The reagents and collected samples need to be maintained on ice.\nThe conditioned medium from two-150 mm dishes of serum-starved cells is collected and placed in sterile 50 mL conical tubes on ice.\nTreat the cells with trypsin to detach them from the plate. The cells are subsequently counted and lysed.\nTrypsin treat the cells by adding 5 mL of trypsin to each 150 mm plate of cells. Once the cells have completely detached from the plate, add 5 mL of growth medium (serum-containing medium) to inactivate the trypsin. The cells are pipetted up and down repeatedly until a single-cell suspension is achieved. The cells are then transferred to a 15 mL conical tube.\nDetermine the number of cells present in the solution using an automated cell counter or hemocytometer.\nCentrifuge the cells at 500 × g at 4°C for 5 min to pellet the cells.",
    "Rinse the cell pellet with 5 mL of ice cold PBS.\nCentrifuge the cells at 500 × g at 4°C for 5 min to pellet the cells and remove the PBS.\nLyse the cells using 2.0 mL of ice cold lysis buffer and pipet the cells up and down several times. As our lysis buffer contains 1% Triton X-100, it effectively disrupts cell and EV membranes. Thus, there is no need for sonication. Transfer the lysate to a 1.5 mL microcentrifuge tube.\nIncubate the samples on ice for 15 min.\nCentrifuge the samples at 16,000 × g for 10 min and place the clarified cell lysate in a new 1.5 mL microcentrifuge tube on ice for use later.\nNote: This is considered to be the whole cell lysate (WCL).\nNote: Determining the number of cells from which the conditioned medium was derived is important because it allows for the determination of the numbers of EVs that are produced per cell when performing Nanoparticle Tracking Analysis (NTA) (see below).\nThe conditioned medium in 50 mL conical tubes is centrifuged at 1,000 × g for 5 min at 4°C to remove intact cells and debris.\nThe supernatant is carefully removed using a 25 mL serological pipet and transferred to a new 50 mL conical tube.\nSteps 6 and 7 are repeated.\nCritical: When removing the supernatant from the centrifuged conditioned medium, it is important to leave a small volume (i.e., ∼1 mL) behind, to avoid disrupting the pellet.\nNote: This is referred to as the partially clarified medium. A small aliquot (1.5 mL) of the medium can be added to a 2 mL microcentrifuge tube. Store the sample at 4°C for NTA (optional; see below).\nMV isolation: day 2\nTiming: 1–2 h, depending on the number of samples",
    "In this step of the procedure, filtration is performed to isolate the large EVs (i.e., the MVs) from the partially clarified medium.\nNote: Each step should be carried out in a sterile tissue culture hood. All centrifugation steps should be performed at 4°C. The reagents and collected samples need to be maintained on ice.\nSet up the 0.22 μm Steriflip filter unit as shown in Figure 1[href=https://www.wicell.org#fig1]. Ensure that the unit is vertical.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/429-Fig1.jpg\nFigure 1. Filtration system setup for MV isolation\nThe 0.22 μm Steriflip filter unit is connected to the vacuum system. The partially clarified conditioned medium is slowly added to the filter unit. The MVs are retained by the filter, while the filtrate (i.e., the flow-through) contains soluble factors and exosomes.\nNote: We use the Steriflip filtration system (Millipore) for MV isolation, but similar 0.22 μm filter systems can also be used.\nAdd the partially clarified conditioned medium to the filter, and slowly begin to apply the vacuum. Keep increasing the strength of the vacuum until a drip-rate of ∼one drop/s is achieved.\nCritical: It is critical to control the strength of the vacuum that is applied to the filter unit, because too strong of a vacuum can cause the MVs to pass through the filter. The desired vacuum pressure applied should not result in a flow-rate that exceeds more than one drop per second throughout the entire filtration process. If it does, the tubing connecting the vacuum to the filtration unit should be immediately disconnected to stop the flow of the medium through the filter. Then, it can be reattached and the vacuum can be applied again.\nContinue to add the partially clarified conditioned medium to the filter unit until all the medium has been filtered.",
    "Critical: Do not let the filter dry out. The MVs tend to adhere to the filter when it becomes dry, making it difficult to resuspend them.\nRinse the filter with 5 mL of PBS and apply the vacuum to remove any residual medium and exosomes from the filter.\nRepeat step 12\nWhen all the PBS had passed through the filter, immediately disconnect the vacuum tubing from the filter unit, and remove (unscrew) the filter from the tube containing the filtrate.\nPlace the filtrate on ice.\nNote: The filtrate has been depleted of MVs but contains exosomes and soluble factors.\nRemove 1.5 mL of the filtrate and put it in a new 2 mL microcentrifuge tube. Store at 4°C for NTA. (optional; see below)\nAdd 250 μL of ice cold lysis buffer to the top of the filter unit.\nThoroughly rinse the entire surface of the filter with lysis buffer by pipetting the solution up and down at least 20 times (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/429-Fig2.jpg\nFigure 2. Rinsing the 0.22 μm filter unit to collect the MVs\nThe filter unit is rinsed thoroughly with 250 μL of lysis buffer or sterile PBS by pipetting up and down multiple times to collect the MVs retained on the filter following filtration.\nCritical: Be sure not to puncture the filter with the pipette tip, as this will result in the loss of sample. If yields of MV lysates are low, the amount of lysis buffer can be reduced.\nTransfer the lysate to a 1.5 mL microcentrifuge tube, and place it on ice.\nIncubate the samples on ice for 15 min.\nCentrifuge the samples at 16,000 × g at 4°C for 10 min and place the clarified MV lysate in a new 1.5 mL microcentrifuge tube on ice for later use.",
    "Note: This sample is considered the MV lysate.\nAlternatives: If the MVs are to be used for functional studies, instead of adding lysis buffer to the top of the filtration unit, the MVs can be resuspended in 500 μL of sterile ice cold PBS and transferred to a sterile 1.5 mL microcentrifuge tube.\nNote: The MVs resuspended in PBS can be frozen at −80°C and used for functional studies at a later time. A small aliquot of this sample can also be subjected to NTA to quantify the MVs. (optional; see below)\nExosome isolation: day 2\nTiming: 6–8 h\nUltracentrifugation is used to isolate the exosomes from the filtrate.\nNote: These steps should be carried out in a sterile tissue culture hood. All centrifugation steps should be performed at 4°C. The reagents and collected samples need to be maintained on ice.\nThe filtrate in the collection tube (see step 14) is transferred to polycarbonate ultracentrifuge tubes that had been cleaned and sterilized (see Preparation of reagents[href=https://www.wicell.org#sec1.2]). The lids are attached to the tubes.\nWeigh the ultracentrifuge tubes containing medium and normalize their weight using sterile PBS.\nCritical: Caution: Take care that the centrifuge tubes are properly balanced.\nPlace the ultracentrifuge tubes into a pre-cooled Type 45 Ti fixed-angle rotor.\nNote: Prior to placing the ultracentrifuge tubes in the rotor, it is helpful to indicate (using a marker) the sides of the tubes that will face the outer edge of the rotor (Figure 3[href=https://www.wicell.org#fig3]). This will be used to help locate where the exosome pellets will be following centrifugation. Make sure the rubber O-rings on the lid of the rotor are evenly coated with silicon vacuum grease. Place the lid on the rotor and tighten it firmly.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/429-Fig3.jpg\nFigure 3. Placing the ultracentrifuge tubes containing the filtrate in the rotor",
    "The part of the tube that is facing the outer edge of the rotor is indicated with a marker (circled above).\nSpin samples at 100,000 × g, 4°C for 4 h.\nImmediately remove the tubes from the rotor following centrifugation and carefully place them on ice.\nNote: The exosome pellet will be located toward the bottom of the tube, below where the indication was made. It is often difficult to see at this point.\nCarefully remove the lids from the ultracentrifuge tubes and transfer all the supernatant to a 50 mL conical tube using a 25 mL serological pipet. Store this tube on ice.\nNote: The resulting supernatant has been depleted of MVs and exosomes, and is considered as the vesicle-free medium (VFM).\nCritical: Do not disturb the exosome pellets. Keep the pipet being used to remove the supernatant on the opposite side of the tube from where the exosome pellet is located.\nAspirate any remaining medium from the tube without disturbing the pellet.\nNote: At this point, an off-white to transparent exosome pellet will be visible on the lower wall of the marked side of the ultracentrifuge tube.\nCircle the pellet with a marker (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/429-Fig4.jpg\nFigure 4. The location of the exosome pellet in the ultracentrifuge tube\nFollowing centrifugation, the exosome pellet (see arrow above) will be located toward the bottom of the tube.\nWash the exosome pellet by resuspending it in 30 mL of ice cold sterile PBS. Weigh the ultracentrifuge tubes again and normalize their weight using sterile PBS. Centrifuge the samples at 100,000 × g, 4°C for 2 h.\nRemove the PBS and lyse the pellet with 250 μL of ice cold lysis buffer.\nResuspend the pellet by scrapping the pellet with a pipet tip and extensive pipetting.",
    "Transfer the sample to a new 1.5 mL microcentrifuge tube.\nIncubate the samples on ice for 15 min.\nCentrifuge the samples at 16,000 × g at 4°C for 10 min, and place the clarified lysate in a new 1.5 mL microcentrifuge tube on ice for later use.\nNote: This is considered the exosome lysate.\nThe WCL, MV and exosome lysates, and VFM can be stored at −80°C for future use.\nAlternatives: If the exosomes are going to be used for functional studies, instead of adding lysis buffer to the exosome pellet, 500 μL of sterile PBS can be added. The exosome pellet is thoroughly resuspended and moved to a 1.5 mL microcentrifuge tube.\nNote: The exosomes resuspended in PBS can be frozen at −80°C and used for functional studies at a later time. A small aliquot of this sample can also be subjected to NTA to quantify the exosomes (optional; see below).\nConcentration of the VFM Day 3 (optional)\nTiming: 3 h\nThe VFM contains soluble factors (i.e., growth factors) that have been secreted by cells. It can be concentrated using an Amicon centrifugal concentrator with a 10 kDa pore size to reduce the volume such that it can be analyzed by immunoblot analysis.\nTransfer 15 mL of the VFM collected (see step 21) into the reservoir of a 15 mL 10 KDa Amicon centrifugal concentrator.\nCentrifuge the sample at 2,700 rpm, 4°C for 25 min.\nCritical: Caution: To minimize protein degradation in the VFM, perform all centrifugation steps at 4°C. Also, make certain the tubes containing the VFM sample are stored on ice.\nContinue adding the VFM to the same concentrator until all the medium has been concentrated to less than 250 μL.\nAdd 8 mL of sterile PBS to the concentrator, and centrifuge again.\nRepeat step b.",
    "Continue to centrifuge the sample until its volume is less than 250 μL.\nPipet the concentrated sample in the concentrator extensively (at least 10 times) to remove any proteins that might have adhered to the filter.\nTransfer the solution to a 1.5 mL microcentrifuge tube.\nNote: This is the concentrated VFM, which can be used immediately or stored at −80°C until a later time.\nCharacterization of EVs by immunoblot analysis: day 3 and day 4\nTiming: 2 days for immunoblot analysis\nIn this section, the WCLs, the MV, and exosome lysates, as well as the VFM samples, will be subjected to immunoblot analysis. Various antibodies can be used as specific markers to distinguish each of these different fractions. The expression levels of various proteins of interest in EVs can also be assessed using this approach.\nDetermine the protein concentrations of the WCLs, the MV lysates, the exosome lysates, as well as the concentrated VFM using the Bradford assay and normalize their concentrations. Add 5× protein sample buffer to each sample and incubate them at 95°C for 5 min.\nNote: The total amount of protein present in the EVs and VFM preparation can vary depending on the cell type from which the samples are collected. Assuming that the EVs isolated from two dishes of MDA-MB-231 cells are lysed in 250 μL of lysis buffer, we typically get ∼ 50–75 ng/μL of protein for MVs and ∼ 150–200 ng/μL of protein for exosomes.\nPause Point: Lysates prepared for immunoblot analysis can be stored at −20°C for several weeks.\nResolve the lysates by SDS-PAGE under reducing conditions to resolve proteins base on their size.\nTransfer the gel to a PVDF membrane with a 0.45 μm pore size using a wet transfer system; 1.5 h.",
    "Note: The PVDF membrane needs to be rinsed with methanol prior to transferring.\nAlternatives: PVDF membranes with a smaller pore size (i.e., 0.22 μm) are also available, and can be used to more efficiently transfer smaller molecular weight proteins.\nThe membrane is blocked in 1× TBST containing 5% bovine serum albumin (BSA) and rocking for 1 h at 20°C–25°C.\nThe membrane is incubated with various primary antibodies diluted in 1× TBST at concentrations recommended by the manufacturer. The blot is then rocked at 4°C for 12 h.\nThe CD63 antibody is used at a 1:2,000 dilution and is considered an exosome marker. This protein should only be detected in the WCLs and exosome fractions.\nThe annexin antibody is used at a 1:1,000 dilution and is a MV marker. It should be detected only in the WCLs and MV fractions.\nThe flotillin-2 and HSP90 antibodies are used at 1:1000 dilutions and are considered general EV markers (found in both MVs and exosomes). These proteins will be present in all lysates.\nThe IκBα antibody is used at a 1: 1,000 dilution and is expressed by all cells, but is largely absent in EVs, as well as VFM samples. The lack of detectable levels of this protein in exosome, MV, and VFM preparations shows that they are devoid of cellular contaminants.\nWash the membrane using 1× TBST with rocking for 5 min at 20°C–25°C.\nRepeat two additional times.\nThe membrane is incubated with HRP-conjugated secondary antibody diluted in 1× TBST for 1 h at 20°C–25°C.\nThe membrane is washed using 1× TBST and rocking for 10 min at 20°C–25°C.\nRepeat two additional times.",
    "For protein detection, the membrane is incubated with the enhanced chemiluminescence (ECL) reagent for 1 min and exposed to autoradiography film in a dark room, or imaged with chemiluminescent imaging device.\nCharacterization of EVs by nanoparticle tracking analysis: day 3\nTiming: 30 min per sample\nThe amount and size of MVs and exosomes present in the partially conditioned medium, or in the isolated MVs or exosomes, can be determined using nanoparticle tracking analysis (NTA). This approach allows for the capturing movies of EVs as points of diffracted light moving under Brownian motion.\nNote: The NanoSight NS300 (Malvern, Malvern, UK) is used to perform NTA in this protocol. Green laser with a wavelength of 532 nm is used. Detailed procedures can be found in NS300 Operating Manual from Malvern.\nMount the top-plate of the flow cell top-plate on the laser module and connect the inlet and outlet tubing with the flow cell (Figure 5[href=https://www.wicell.org#fig5]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/429-Fig5.jpg\nFigure 5. Setting up for nanoparticle tracking analysis (NTA)\n(A) The laser module (left) and the flow cell top-plate (right).\n(B) Image showing how to connect the inlet and outlet tubing with the flow cell.\n(C) The beam bath is rinsed with water/PBS/medium using a 1 mL syringe.\nRinse the beam path of the device with ∼900 μL ultrapure water using a 1 mL syringe.\nRinse the beam path again with ∼900 μL of either serum-free RPMI-1640 medium or PBS using a 1 mL syringe (Figure 5[href=https://www.wicell.org#fig5]).\nNote: It is important to rinse the device of impurities before experimental samples are analyzed.\nCritical: It is important to analyze EV samples within 48 h of their collection to minimize vesicle aggregation and lysis.",
    "Use a syringe to draw 1.5 mL of a given sample (i.e., partially clarified conditioned medium, MV preparations, or exosome preparations), and remove any air bubbles from the syringe by holding it upright and tapping it with your finger to move the bubbles to the top of the syringe. Then apply gentle pressure to the plunger to push the air bubbles out of the syringe.\nAlternatives: The NanoSight syringe pump can be used for sample loading.\nSlowly inject the sample into the beam path until many particles are visible on the screen.\nFocus the NS300 camera to obtain a clear image of the particles on the screen.\nCapture a 60 s digital movie of the EVs under Brownian motion.\nSlowly inject more (∼100 μL) sample into the beam path, record another 60 s digital video.\nRepeat step 47 three more times until a total of five movies have been captured. The numbers and sizes of EVs present in each sample will be determined by the NTA software.\nNote: If multiple samples will be analyzed, repeat steps 41–48."
  ],
  "subjectAreas": [
    "Cell Membrane",
    "Cell Biology",
    "Cancer"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}