{
  "id": 6013,
  "origin_website": "Bio",
  "title": "<em>In situ</em> Hybridization (ISH) in Preparasitic and Parasitic Stages of the  Plant-parasitic Nematode <em>Meloidogyne</em> spp.",
  "procedures": [
    "PCR digoxigenin (DIG)-labeled cDNA antisense and control (sense) probe synthesis and purificationPCR amplify a selected specific fragment from the targeted gene (~200 bp) using cDNA or, in absence of introns, genomic DNA as a matrix, with forward and reverse primers 1 µM each, dNTPs 250 µM and proof-reading Pfu polymerase.Purify the PCR1 fragment with QIAquick PCR Purification Kit if a single band is obtained or purify the band from the gel with QIAquick gel extraction kit, elute with 10 µl elution buffer and quantify on gel or using NanoDrop.Perform the DIG labeling step through a second PCR by using DIG labeled dUTPs using 50-100 ng of PCR1, 2 µM forward or reverse primer for sense or anti-sense probe, respectively, DIG-dUTP/dNTP mix (DIG DNA labeling kit).Purify PCR product with QIAquick PCR Purification Kit and resuspend in 10 µl TE buffer at pH 8.0.For quality control, run small amount (1 µl) of the labeled probe (PCR2) on an agarose gel. In addition, probes can be tested using dot blot to analyze the sensitivity or Northern blot for specificity (Liao et al., 2014), prior to in situ hybridization (ISH).DIG-labeled cDNA probes are stored at -20 °C. They are stable for more than a year.Day 1. Preparasitic or parasitic root-knot nematode (RKN) extraction from roots and fixation for ISHTo extract parasitic stages from infected roots, rinse roots with tap water, cut them into ~1 cm sticks.Immerse roots in the Pectinex® and Celluclast® mix and incubate the mixture for 4 h (to overnight) at RT under gentle agitation (orbital shaker, 50 rounds per minute).Prepare 2 Corning tubes containing 40 ml of 50% sucrose/M9 and store them in the fridge at 4 °C.After digestion, pour the liquid through a 2.5 mm sieve and collect the filtrate.",
    "Pour the liquid through a 250 µm sieve and collect the filtrate.Pour the liquid through a 40 µm sieve.Collect the parasitic RKNs on the 40 µm sieve with a minimum volume of tap water (~8 ml).Purify the nematodes by sucrose gradient centrifugation: add slowly 4 ml of the collected nematode on the top of cold 50% sucrose/M9 mix (2 tubes) (Figure 1).Centrifuge at 720 x g, at 4 °C for 5 min, without a break.Collect the layer of nematodes with a P1000 and wash them carefully adding 40 ml M9 buffer in a 50 ml glass beaker (Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180313/20180313234238_8820.jpgFigure 1. Extraction of parasitic stages by sucrose gradientTo remove sucrose, wash them twice with 50 ml M9, on the 10 µm sieve, in a 50 ml glass beaker and finally transfer to a 50-ml Corning tube.Collected nematodes are at the parasitic juvenile’s stage 2 (J2), 3 (J3) or 4 (J4), or adult females. Freshly hatched RKN preparasitic J2 are obtained from eggs as described in Caillaud and Favery (2016).Under a fume hood, with gloves, resuspend the nematodes (10,000 J2s or at least 50 parasitic stages) in 10 ml of fixative buffer in a 50-ml Corning tube. The fixation lasts overnight (16 h) for the preparasitic J2 and 48 h for parasitic stages at RT.Day 2. (or Day 4 for parasitic stages) Nematode cutting and permeabilization for ISHWipe down bench top and pipettors with RNaseZap®.Clean a glass plate with soap, rinse with nuclease-free water, spray RNaseZap® and rinse with 70% ethanol. Dry well with a paper towel.Centrifuge the 50 ml tube containing nematodes soaked in fixative buffer at 1,620 x g, slow deceleration.Withdraw fixative buffer but keep 500 µl and transfer to 1.5 ml Eppendorf tubes.",
    "Under the fume hood, wearing gloves, spread the nematodes on the glass plate, and cut the nematodes into two to three pieces using the cutting system (vibrating aquarium pump + autoclaved razor blades) described in Figure 2 and Video 1. Hold it with both hands. Check under the microscope the efficiency of the cutting. Do not cut too much, in particular the parasitic stages.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180313/20180313234415_4071.jpgFigure 2. Nematode cutting before ISH. Diagram (A) and picture of the experimental device (B).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Nematode cutting for ISH Add few drops of 1x RNase-free PBS buffer to collect the nematode sections on the glass plate and transfer into an Eppendorf tube.Spin down the sample (15,000 x g, 1 min, slow deceleration). Remove the buffer.Suspend in 1 ml of 1x RNase-free PBS, and then centrifuge the tube at 15,000 x g for 1 min with slow deceleration. Repeat Steps C7 and C8 three times.For nematode permeabilization, add 1 ml of cold 1 mg/ml Proteinase K solution to the nematodes. Keep Proteinase K in a cold block and do not vortex.Incubate the tube at 37 °C for 1 h under rotation (in a hybridization oven).Spin down the sample (15,000 x g, 1 min, slow deceleration). Keep the pellet.Wash the sample in 1 ml of 1x PBS and centrifuge the tube at 15,000 x g for 1 min with slow deceleration. Keep the pellet. Repeat this step three times. In the last wash, remove as much 1x PBS as possible to obtain a dry pellet. Place the pellet at -80 °C for 15 min.Add 1 ml cold methanol (precool at -80 °C).Vortex to suspend the nematodes and leave them 2 min at RT.Spin down the sample (15,000 x g, 1 min, slow deceleration).Remove methanol.Add 1 ml cold acetone (precool at -80 °C).",
    "Place the tube at -80 °C for 15 min.Spin down the sample (15,000 x g, 1 min, slow deceleration).Day 2 (or Day 4 for parasitic stages): (in situ) hybridizationSet the temperature of the hybridization oven up to 50 °CPreheat the hybridization buffer (HB) at 50 °C.Remove acetone.Add 500 µl of pre-heat HB on the nematode pellet.Spin down the sample (15,000 x g, 1 min, slow deceleration) and remove the supernatant.Add 500 µl of pre-heated HB on the nematode pellet.Incubate for 30 min at 50 °C under rotation in the oven.Meanwhile, denature the probes at 100 °C for 5 min (water bath) and transfer onto ice immediately (let the temperature drop swiftly to prevent re-annealing). Keep them on ice for 3 min.Spin down the sample (15,000 x g, 1 min, slow deceleration).Set the temperature of the oven at 42 °C.Suspend the nematodes in 100 µl HB per probe (e.g., 500 µl for 5 probes).Dispatch 100 µl HB into individual nuclease free tubes.Add 5 µl of each probe.Perform the hybridization overnight at 42 °C (40-50 °C, see Notes) under agitation in the oven.Day 3 (or Day 5 for parasitic stages): Washes and revelationSpin down the sample (15,000 x g, 1 min, slow deceleration). Discard supernatant.Wash the pellet with 1 ml washing buffer 1 (4x SSC, 0.1% SDS), 10 min at RT under rotation. Spin down the sample (15,000 x g, 1 min, slow deceleration). Discard supernatant.Repeat Steps E2 and E3 twice.Wash the pellet with 1 ml washing buffer 2 (0.1x SSC, 0.1% SDS), 10 min at 50 °C under rotation. Spin down the sample (15,000 x g, 1 min, slow deceleration). Discard supernatant.Repeat Steps E5 and E6 twice.Spin down the sample (15,000 x g, 1 min, slow deceleration). Discard supernatant. Wash 30 sec with 1 ml of filtered maleic acid buffer (1x).",
    "Spin down the sample (15,000 x g, 1 min, slow deceleration). Discard supernatant.Incubate the nematodes at 37 °C for 30 min (oven) in 1 ml of 1x Boehringer blocking reagent (see Recipes).Incubate the nematodes at 37 °C for 3 h in 1 ml of the anti-DIG antibody coupled with Alkaline Phosphatase (1:500) in 1x Boehringer blocking reagent.Spin down the sample (15,000 x g, 1 min, slow deceleration). Discard supernatant.Wash three times each with 1 ml 1x filtered maleic acid buffer at 37 °C during 15 min.Wash briefly with 1 ml Alkaline Phosphatase detection buffer (APB).Reveal the signal by incubating the nematodes for 6 to 8 h at RT in 1 ml APB + 3.75 µl BCIP + 5 µl NBT without agitation.Put a drop on a microscope slide, add a cover slip.Observe under a microscope (Axioplan2, 10x objective).If no signal is detected, continue the incubation overnight at 4 °C.Wash the nematode with nuclease-free water once.Put a drop on a microscope slide, add a cover slip.Observe under the microscope and image nematodes."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Microbiology",
    "Plant Science"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}