{
  "id": 8420,
  "origin_website": "Jove",
  "title": "Horizontal Hippocampal Slices of the Mouse Brain",
  "procedures": [
    "All animal experiments for this study were approved by the ethical review committee of the KU Leuven (Belgium) (P021/2012).\n1. Preparation of high-sucrose slice solution and artificial cerebrospinal fluid (ACSF)\nPrior to experimental day\n\t\nPrepare 1 L of 10x slice pre-solution with laboratory grade Type 1 water containing (in mM): 25 KCl, 20 CaCl2, 10 MgSO4, 12.5 KH2PO4 (Table 1). In order to prevent calcium phosphate precipitation, slowly mix the chemicals in a beaker pre-filled with 800 mL H2O while constantly stirring with a magnetic stirrer. Store the solution at 4 °C or room temperature (RT).\nOn the experimental day\n\t\nPrepare 1 L of 1x ACSF with laboratory grade Type 1 water containing (in mM): 125 NaCl, 2.5 KCl, 2 CaCl2, 1 MgSO4, 1.25 NaH2PO4, 26 NaHCO3, 25 Glucose (Table 2). Use a vapor pressure osmometer to validate the osmolarity between 305–315 mOsm (pH ~ 7.55–7.6).\n\t\tNOTE: In order to prevent calcium phosphate precipitation, slowly mix all solid chemicals in a beaker pre-filled with 800 mL of H2O while constantly stirring with a magnetic stirrer. Add MgSO4 and CaCl2 at the very end, slowly dripping in the necessary amount from 1 M stock solutions.\nContinuously bubble 1x ACSF solution at RT with carbogen to set pH between 7.3–7.4.\n\t\tNOTE: If the pH is slightly too high or too low, small adjustments in the carbogenation strength would be sufficient. If the pH is higher than 7.45 with carbogenation, adjust it by adding few drops of 1 M NaH2PO4 solution.\nPrepare 250 mL (per brain) of 1x high-sucrose slice solution in a beaker containing 25 mL of 10x slice pre-solution and (in mM): 252 Sucrose, 26 NaHCO3, and 10 Glucose (Table 3). Verify that the osmolarity is between 320–325 mOsm (pH ~ 7.55–7.6).",
    "Bubble the high-sucrose slice solution for 10–15 min with carbogen to control the pH between 7.3–7.4.\n\t\tNOTE: If the pH is higher than 7.45 with carbogenation, adjust it by adding a few drops of 1 M KH2PO4 solution.\nStore the high-sucrose slice solution for 20–30 min in the ultra freezer (-80 °C) until it is partially frozen.\n2. Preparation of the workspace for the brain dissection\nDuring the cool-down of the high sucrose slice solution, prepare the following.\n\t\nWarm up the water bath to 32 °C.\nFill the recovery chamber (Figure 2A) with the carbogenated ACSF solution and place the chamber in the water bath. Continuously apply carbogen to the main ACSF bottle and the ACSF in the recovery chamber.\nUsher the animal to the experimental room.\n\t\tNOTE: The age, sex, and strain of the animal have to be determined by the individual experimenter and is dependent on the specific study question. However, the parameters of the animal should stay constant within one study in order to guarantee comparability between the different experimental days. This protocol was designed for the use of C57BL/6J male mice at the age of 2–6 weeks. If older animals will be used, slice and recovery solutions may have to be adapted accordingly4,27 (e.g., NMDG+-based solutions23,28) in order to preserve the brain health of the acute slices.\nPrepare the anesthesia chamber.\nLay out tissue paper, plastic Pasteur pipette with wide opening (cut open), 90 mm culture dish filled with ice, a square of filter paper on top of the chilled culture dish, strong scissors for decapitation, dissection scissors, curved forceps, spatula, 35 mm culture dish, fine brush, blade, specimen plate (comes with vibratome), super glue, pipette tip, four straps of filter paper (~ 2 cm x 0.5 cm) (Figure 2A).",
    "Set up the vibratome: First, program the vibratome for the correct settings (blade travel speed: 0.08 mm/s, cutting amplitude: 1.4 mm, cutting frequency: 85 Hz) and attach the carbogen line in the slice chamber. Next, place the slice chamber in the holder, fill the holder surrounding the slice chamber with ice and attach everything to the vibratome. Finally, place the razor blade in the vibratome blade holder (Figure 2B).\nAfter freezing of the high-sucrose solution perform the following steps.\n\t\nAfter 20–30 min, take the high-sucrose slice solution out of the -80 °C ultra-freezer and keep the beaker on ice.\nPlace the high-sucrose solution next to the vibratome on your bench, crush and mix the partially frozen solution with a spatula to get a nice slush and start bubbling with carbogen.\nTake up some high-sucrose slice solution with the plastic Pasteur pipette to soak the squared filter paper on top of the chilled 90 mm culture dish.\nFill the 35 mm culture dish (or any equivalent small container that is suitable to store the whole brain) up to 75% with the high-sucrose slice solution (sufficient to cover the whole brain) and cool the culture dish on ice kept next to the beaker with the rest of the solution. Carbogenate the solution in the 35 mm culture dish.\n3. Dissection and positioning of the murine brain\nAnesthetize the animal with 5% isoflurane. Determine the proper depth of anesthesia by pinching the paw. No paw withdrawal reflex should occur.\nTransfer the animal on tissue paper and decapitate it with strong scissors or a small animal guillotine.\nUse dissection scissors to cut open the scalp.\nCut open the calvaria along the sagittal suture and remove it with the help of curved forceps until the whole brain, including the olfactory bulbs, is visible.",
    "NOTE: Be careful to not damage the brain with the sharp edges of the calvaria or forceps.\nUse a spatula to carefully scoop out the brain (olfactory bulbs should stay attached).\nTransfer the brain in the chilled 35 mm culture dish and remove all hair or blood particles from the tissue by gently washing the brain with an ACSF-filled Pasteur pipette (blood has cytotoxic effects on brain tissue29).\nTransfer the brain with the help of the spatula on the soaked filter paper on top of the chilled 90 mm culture dish (Figure 2A).\nUse a blade to cut the brain in half, separating the two hemispheres, and place both hemispheres on the freshly cut medial side.\nUse a blade to remove the dorsal part (5%–10%) of the brain from each hemisphere with a parallel cut to the dorsal top (Figure 2C)30 and place both hemispheres on the freshly cut side with the ventral part of the brain facing upwards.\nPosition a drop of super glue on the specimen plate and spread out properly with a pipette tip to accommodate both the hemispheres.\nUse a filter paper strap to pick up one hemisphere with capillary forces by touching the ventral side with the filter paper strap, thereby not damaging the tissue.\nUse another filter paper strap to carefully semi-dry the dorsal side of the brain before positioning the hemisphere with the dorsal side down on top of the glue on the specimen plate. Repeat the same procedure with the second hemisphere.",
    "NOTE: The hemispheres should be positioned in horizontal alignment in a mirrored fashion on the vibratome plate, with the rostral sides pointing toward the outside and the caudal sides facing (but not touching) each other in the middle. The medial sides of both hemispheres should point toward the vibratome blade and the lateral sides toward the experimenter (Figure 2D).\nPlace the specimen plate in the slicing chamber and quickly, but carefully, cover it with ice-cold high-sucrose slice solution slush. As soon as the solution touches the glue, it will solidify and properly glue the hemispheres to the specimen plate.\nAssure that the hemispheres are properly covered with high-sucrose slice solution and confirm that the solution is bubbled with carbogen.\n\tNOTE: The entire dissection procedure should be performed as fast as possible. Please ensure that the brain does not stay without the supply of oxygen for a very long time. It should take only around 1–1.5 min from decapitation to brain submersion in the high-sucrose slice solution slush. This is the most critical requirement for acute brain slice preparations in order to warrant high quality of the slice.\n4. Horizontal slicing of the brain\nPosition the vibratome blade in front of the medial side of the hemispheres and lower it to the same height as the ventral sides of the hemispheres that are now facing upwards. Lower the blade with the help of the vibratome control to 600 µm further in the dorsal direction and start slicing. The blade should hit the tissue (if not, reverse the blade and lower it a bit more). Slice until the first two slices are completely separated from the two hemispheres.\nReverse the blade and lower another 300 µm and slice again.",
    "When the hippocampus becomes visible (use the mouse31 brain atlas for help, if necessary) (Figure 2E) collect the slices with the widened plastic Pasteur pipette. Collect the slices until the caudate putamen becomes visible next to the hippocampus. Typically, between 8–12 slices of 300 µm (4–6 per hemisphere) can be collected for the mouse brain.\nUse the plastic Pasteur pipette to collect the slices and transfer them to the recovery chamber in the water bath (Figure 2F) (collect slices after each round of slicing to prevent them from floating around in the slice chamber).\n\tNOTE: Work as fast as possible and ensure that the high-sucrose slice solution is ice-cold and carbogenated during the entire procedure. If necessary, refill the ice surrounding the slice chamber.\n5. Recovery of brain slices for electrophysiological recordings\nLeave the slices in the ACSF-filled recovery chamber in the 32 °C water bath for 1 h.\n\tNOTE: Recovery chambers are also commercially available.\nTake the recovery chamber out of the water bath.\nPlace the slices at RT for at least another 30 min for recovery before starting any further application.\n6. fEPSP recordings in the medial perforant path (MPP) of the hippocampus\nPull recording pipettes from borosilicate glass capillaries with a horizontal pipette puller to receive pipettes of the size of ~2 MΩ when filled with ACSF solution and immersed in the ACSF-filled recording chamber.\nFill ACSF bath solution and ACSF solution containing the appropriate chemicals (e.g., Bicuculline) in a gravity-controlled multi-barrel perfusion system that is connected to the recording chamber. Continuously carbogenate all the solutions.",
    "Turn on a peristaltic or vacuum pump that is connected to a suction tubing that ends opposite of the perfusion line in the recording chamber. Open the ACSF-filled barrel and start to establish a continuous flow (1–2 drops per second). Verify that the reference electrode is submerged in the ACSF solution.\nSwitch on the setup computer, the amplifier, the micromanipulator, the stimulator, the microscope light(s), the camera, and the monitor (if applicable).\nOpen the appropriate software for electrophysiological recordings (several different hardware and software providers for electrophysiological equipment exist).\nTransfer one brain slice hemisphere from the recovery chamber to the recording chamber of the slice setup and position it in the correct orientation with the dentate gyrus granule cell layer and the molecular layer in the field of view. Make sure that the stimulation electrode can reach the MPP in the slice from the direction of the entorhinal cortex and that the recording electrode has access to the MPP from the exact opposite side from the direction of CA3.\nStabilize the slice in the recording chamber with a paper clip (Figure 3A) or a commercially available brain slice grid.\n\tNOTE: It can be helpful to turn off the perfusion during slice transfer and positioning. However, this should not take too long in order to guarantee the quality of the brain slice.\nLower and position the recording and stimulation electrodes in the MPP in the lower third of the molecular layer close to the granule cell layer (Figure 3B), facing each other at a distance of approximately 100–150 µm. The stimulation electrode should minimally contact the surface, while the recording electrode should slightly infiltrate the upper slice layer.",
    "Apply a low intensity stimulus (30–50 µA for 0.1 ms) to the brain slice in order to obtain the fEPSP signal. Adapt the position of the electrodes if necessary (e.g., low or atypical shaped fEPSP signal).\nStart recording Input-Output curves: apply increasing stimulus intensities to the brain slice in intervals of 30 s.\nSet the stimulus intensity to 50% of the maximal fEPSP response and start baseline fEPSP recordings applying the 50% stimulus intensity for 20–40 min in 30 s intervals to the brain slice.\nIf the baseline appears to be stable, proceed with additional recordings (e.g., LTP/LTD protocols and/or drug applications). (For LTP induction in the MPP, here a protocol consisting of four times 1 s 100 Hz pulses applied in an interval of 5 min was used. Bicuculline was applied 10 min before and during the conditioning phase.)\n\tNOTE: All recordings should be performed in the current clamp mode with appropriate low-pass filtering (<5 kHz) and sampling rates (>10 kHz).\nExtract the data in an appropriate file format and analyze fEPSP parameters, such as fiber volley, fEPSP amplitude, and fEPSP slope.\n7. Calcium imaging recordings of brain slices\nTransfer one brain slice hemisphere in a 12-well chamber and load it for 30 min to 1 h with an appropriate calcium dye. Continuously carbogenate the loading solution by inserting a carbogenation tube through a self-made hole (with a hot 18G needle) in the lid of the 12-well plate.\n\tNOTE: This step is not necessary in case of brain slice preparations from genetically modified animals that endogenously express a fluorescent reporter such as GCaMP.\nPrepare the recording setup as described in steps 6.2–6.5.\n\tNOTE: No amplifier or micromanipulator are necessary for microfluorimetric imaging experiments. The use of a stimulator is experiment dependent. Specific software for fluorescence imaging experiments is essential.",
    "Adjust the software to the correct imaging settings: this includes camera amplifier and binning setting, setting of the wavelength, exposure time, and timing protocol. Settings can vary depending on the exact experiments. (For the example traces, 1 x 1 binning, 2.4x pre-amplifier gain, 300 EM camera gain, exposure of 50 ms at 488 nm repeated every 500 ms for the duration of the experiment was used.)\nAfter loading with the calcium dye, transfer the brain slice hemisphere from the 12-well to the recording chamber and position it on the microscope stage.\nStabilize the slice in the recording chamber with a paper clip (Figure 3A) or a commercially available brain slice grid similar to the one described in step 6.7.\nAssure that the area of interest is in the correct microscopic field and in focus.\nUse the fluorescence imaging software to select several regions of interest (ROIs) on your slice.\n\tNOTE: It can be useful to select the whole field of view to follow the general fluctuations in brightness, due to photobleaching.\nStart the recording and apply the experimental test-drugs at chosen time points.\n\tNOTE: It is advisable to apply a high K+ solution at the end of each experiment to verify the neuronal character of the cells and the slice quality.\nExtract the data in an appropriate file format and analyze the fluorescence signal changes that occur in the ROIs over the entire measurement. ROIs can also be adapted during the off-line analysis.\n\tNOTE: Other protocols that describe fEPSP recordings and calcium microfluorimetry in brain slices are available in literature24,32,33,34,35."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}