{
  "id": 2578,
  "origin_website": "Cell",
  "title": "Protocol for Probing Regulated Lysosomal Activity and Function in Living Cells",
  "procedures": [
    "Step-by-Step Method Details\nStep-by-Step Method Details\nThis protocol is divided into three main sections that will each offer a unique readout for monitoring lysosomal function.\nLysoLive Assay for Measuring β-Glucosidase Activity In Vivo\nTiming: 1–2 h\nThis assay provides a quantitative measure of the activity of a lysosomal enzyme, β-Glucosidase, which is involved in diseases such as Gaucher’s and Parkinsons. LysoLive uses a sensitive substrate of β-glucosidase, GlucGreen, that becomes fluorescent upon enzymatic cleavage proportional to enzyme activity in a living cell (Harlan et al., 2016[href=https://www.wicell.org#bib7]) (Figure 1[href=https://www.wicell.org#fig1].).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/208-Fig1.jpg\nFigure 1. LysoLive Traces β-Glucosidase Activity Where Enzyme Substrate Fluoresces upon Degradation in Lysosomes of Living Cells\n(A–C) Images above depict representative example of regulated-lysosomal activity in Hepatocellular Carcinoma HCC cells, which can be quantified using ImageJ and the protocols described here. Error bars denote SEM (n ≥ 3) (∗∗p>0.01). Scale bar is 10 μm.\nOn the day of the experiment, prepare staining medium by diluting the β-glucosidase substrate (stock concentration of 5 mM) to a working concentration of between 5 – 20 μM in DMEM with or without 10% FBS, in the absence of antibiotics. We recommend starting with the smallest concentration of probe necessary of 5 μM (0.5 μL probe per 500 μL DMEM). Troubleshooting 2",
    "Note: In deciding whether to use FBS in these assays, one should be aware that serum starvation is frequently applied to decrease effects that could be exerted by growth factors in the serum. Additionally, serum starvation can serve as a way to synchronize cell cycle phases of plated cell populations as lysosomal activity may change with the cell cycle. As this can increase autophagy, we include FBS (10%) in most of our studies. If serum starvation is performed, cells should be incubated in serum free medium for at least 4 h prior to experimentation.\nFor fixed cell imaging: use cells plated in a 12-well dish (30%–60% confluency) with one coverslip per well.\nIncubate cells with β-Glucosidase substrate in DMEM for 20 min at 37°C in 5% CO2 atmosphere (500 μL per well). Troubleshooting 3\nWash 3 times with ice-cold PBS (pre-made from Sigma) to remove probe (0.5 mL per well).\nNote: Ice-cold PBS washes should be performed gently to not disturb or displace the plated cells and rapidly to decrease time between removing the substrate and cell fixation.\nFix cells for 15 min in 4% PFA diluted in PBS (0.5 mL per well) at 20°C with limited light exposure. Troubleshooting 4\nPause Point: Cells can be left in PBS at 4°C following fixation with limited light exposure for 16 h.\nWash with PBS three times to remove PFA (0.5 mL per well).\nOptional: Block cells for 1 h in blocking buffer containing 5% goat serum, 5% bovine serum albumin, PBS, sodium azide to reduce background from nonspecific binding.\nMount cells in mounting media with DAPI onto a standard mounting glass slide. Make sure that the microscope slide is clean of fingerprints or dust.",
    "Apply mounting medium with DAPI onto glass microscope slide using 20 μL per each coverslip. Check that there are no air bubbles in the pipette tip and lay down coverslip onto the mounting medium slowly to avoid air bubbles from forming.\nDry in dark area at 20°C for 16 h prior to imaging.\nAfter coverslips have dried they should be stored at 4°C where staining remains at its optimal intensity for at least two weeks.\nFor live-cell imaging, use cells plated in an 8-well glass-bottom chamber slides (30%–60% confluency):\nIncubate cells with β-Glucosidase substrate in DMEM for 20 min at 37°C in 5% CO2 atmosphere (500 μL per well).\nWash with ice-cold PBS three times to remove the probe (0.5 mL per well).\nImage cells for in live-cell imaging chamber with temperature and cell culture conditions of 37°C in 5% CO2 atmosphere.\nSiR-Lysosome Assay for Measuring Active Lysosomal Cathepsin D\nTiming: 1–2 h\nThis assay step monitors changes in the amount of the active form of lysosomal Cathepsin D protease (Figure 2[href=https://www.wicell.org#fig2].). SiR-lysosome is a cell-permeable peptide with the sequence of pepstatin A that is known to bind specifically to active Cathepsin D and has been conjugated to a fluorescent photostable silicon rhodamine (SiR) dye. Importantly, its far-red emission (imaged in standard Cy5 filter sets) decreases phototoxicity and autofluorescence with compatibility for GFP- and mCherry-tagged proteins.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/208-Fig2.jpg\nFigure 2. SiR-Lysosome Traces Cathepsin D Activity in Living Cells and Can Be Monitored by Live-Cell Imaging\n(A and B′) Images here are stills of a movie taken of SiR-Lysosome in HCC cells. Left images are in DIC while right images are from the red fluorescence filter. Images were captured with an exposure time of 500 ms and a light intensity of 95%. See corresponding Methods Video S1[href=https://www.wicell.org#mmc1]. Scale bar, 10 μm.",
    "Dilute SiR-Lysosome (1 mM stock concentration) to a working concentration of 1 μM in DMEM (0.5 μL probe per 500 μL DMEM), with or without 10% FBS in the absence of antibiotics.\nOptional: Addition of the calcium channel blocker, verapamil (working concentration of 1 μM), to SiR-Lysosome DMEM solution can enhance signal intensity. This reagent is provided with the kit, as noted in the Table above. Final concentrations of DMSO should not exceed 2%.\nFor fixed cell imaging: Use cells plated in a 12-well dish (30%–60% confluency) with one coverslip per well.\nPause Point:\nIncubate cells with SiR-Lysosome in DMEM for 5 – 60 min at 37°C in 5% CO2 atmosphere (500 μL per well).\nWash with ice-cold PBS three times to remove the probe (0.5 mL per well).\nFix cells for 15 min using 4% PFA diluted in PBS at 20°C with limited light exposure (0.5 mL per well).\nWash with PBS three times to remove PFA (0.5 mL per well).\nMount cells in mounting media with DAPI onto a standard mounting glass slide. Make sure that the microscope slide is clean of fingerprints or dust.\nApply mounting medium with DAPI onto glass microscope slide using 20 μL per coverslip. Check that there are no air bubbles in the pipette tip and lay down coverslip onto the mounting medium slowly to avoid air bubbles from forming.\nDry in dark area at 20°C for 16 h prior to imaging.\nAfter coverslips have dried, they should be stored at 4°C where staining does not fade for at least two weeks.\nPause Point:\nFor live-cell analyses (as seen in Methods Video S1[href=https://www.wicell.org#mmc1]): Use cells plated in a 8-well chamber (30%–60% confluency).",
    "Incubate cells with 1 μM SiR-Lysosome in DMEM for 5 – 60 min at 37°C in 5% CO2 atmosphere (500 μL per well).\nWash with ice-cold PBS three times to remove the probe (0.5 mL per well).\nInsert cell chamber for live imaging with conditions of 37°C in 5% CO2\nImage cells for 1 h where with an image acquisition rates of 1 frame per 30 s. Live-cell imaging microscopy approaches detailed below.\nCell viability can be maintained for 12 h, depending on cell type.\n        Your browser does not support HTML5 video.\n      \nMethods Video S1. SiR-Lysosome (Far Red) Traces the Enzymatic Activity of Cathepsin D in Lysosomes, Related to Figure 2\nDuration of time-lapse film was 30 min and is related to Figure 2. Alexander hepatocellular carcinoma (HCC) cells reconstituted with Axin1 protein were incubated for 1 h with Sir-Lysosome (1 μM). Images were collected in DIC and red fluorescence filter, acquired every 30 s, and images were acquired using the Zeiss Observer.Z.1 inverted microscope with Apotome.2. Fluorescence filters were controlled by Axiovision 4.8 software.\nLysoSensor Yellow-Blue Assay for Measuring Physiological pH Shifts\nTiming: 1–2 h",
    "This step accomplishes a way to monitor changes in lysosomal pH in living cells (Figure 3[href=https://www.wicell.org#fig3].). pH is a fundamental aspect of lysosomal biology and a central target for drug design (Diwu et al., 1999[href=https://www.wicell.org#bib5]). As one example, chloroquine operates as a mechanism to decrease the lysosomal acidity essential for enzymatic activity. Similar to the commonly used Lysotracker reagent, LysoSensor Yellow/Blue DND-160 is an acidotropic probe that accumulates in acidic lysosomes following protonation. However, while Lysotracker only marks acidic organelles, LysoSensor has the additional advantage of tracking fluctuations in pH. LysoSensor serves as a ratiometric marker of lysosomal pH (pKa of ~4.2) as it is conjugated to the compound, 2-(4-pyridyl)-5-((4-(2-dimethylaminoethylaminocarbamoyl)-methoxy)-phenyl)oxazole (PDMPO) that exhibits pH-dependent dual-excitation and dual-emission spectral peaks. Thus, LysoSensor produces a blue fluorescence in weakly acidic organelles and shifts to yellow in more acidic lysosomes (Albrecht et al., 2020[href=https://www.wicell.org#bib1]). Additional advantages including high photostability of PDMPO fluorescence facilitate image-based assays.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/208-Fig3.jpg\nFigure 3. LysoSensor Traces Lysosomal pH Gradients in Living Cells\n(A–C) Images depicted here demonstrate an increase in lysosomal activity visualized as increased yellow fluorescence following treatment with GSK3 inhibitor, CHIR, in HeLa cells. Yellow fluorescence can be quantified as a marker of lysosomal activity. Error bars denote SEM (n ≥ 3) (∗∗p > 0.01). Scale bar, 10 μm.\nDilute LysoSensor (stock concentration of 1 mM) to a working concentration in the range of 1 – 200 μM in DMEM (for 1 μM use 0.5 μL probe per 500 μL DMEM) with or without 10% FBS in the absence of antibiotics. LysoSensor aliquots can be thawed at room temperature.",
    "Note: We recommend starting with probe concentration of 1 μM to reduce artifacts of overloading, which can appear as nonspecific binding of the probe throughout the cell. This can be assessed by co-labeling cells with Lysotracker Deep Red, which should colocalize with acidic lysosomal vesicles. For Lysotracker co-staining, probes should be used as described here with the addition of 50 nM Lysotracker, from a stock concentration of 1 mM, to DMEM (2.5 nL probe per 500 μL DMEM) with LysoSensor probe.\nFor fixed cell imaging: use cells plated in a 12-well dish (30%–60% confluency) with one coverslip per well.\nIncubate cells with LysoSensor in DMEM for 5 min at 37°C in 5% CO2 atmosphere (500 μL per well). Troubleshooting 4\nOptional: Lysotracker Far Red, which only marks the acidic lysosomes can be performed side-by-side, as a positive control for confirming pH gradient shifts. While PFA fixation is typically used for lysosomal studies using standard probes, we recommend that comparing the pH changes of fixed cells with those seen by live-cell imaging could provide a powerful method to directly determine whether fixation conditions impact pH shifts within individual experiments. pH calibration curves should be performed prior to imaging, as described previously (Diwu et al., 1999[href=https://www.wicell.org#bib5]).\nWash with ice-cold PBS three times to remove the probe (0.5 mL per well).\nWash with PBS three times to remove PFA (0.5 mL per well).\nMount cells in mounting media (without DAPI) onto a standard mounting glass slide. Make sure that the microscope slide is clean of fingerprints or dust.\nApply mounting medium (without DAPI) onto glass microscope slide using 20 μL per each coverslip. Check that there are no air bubbles in the pipette tip and lay down coverslip onto the mounting medium slowly to avoid air bubbles from forming.",
    "Dry in dark area at 20°C for 16 h prior to imaging.\nAfter coverslips have dried, they should be stored at 4°C where staining does not fade for at least two weeks.\nPause Point:\nFor live-cell analyses: use cells plated in an 8-well glass-bottom chamber (30%–60% confluency).\nIncubate cells with LysoSensor in DMEM for 5 min at 37°C in 5% CO2 atmosphere (500 μL per well).\nWash with ice-cold PBS three times to remove the probe (0.5 mL per well).\nInsert cell chamber for live imaging with conditions of 37°C in 5% CO2.\nImage cells for 1 h where with an image acquisition rates of 1 frame per 30 s. Live-cell imaging microscopy approaches detailed below.\nCell viability can be maintained for 12 h, depending on cell type.\nDrug Treatments or Growth Factor Signaling Studies (Optional Steps)\nTiming: 2–4 h or 24 h",
    "The protocols described above will be particularly useful for studies of lysosomal regulation by tumor suppressors (such as Adenomatous Polyposis Coli or Axin1), oncogenes (such as activated Ras mutations) or following treatment with growth factors (such as Wnt or EGF). As one example, canonical Wnt signaling, a pathway implicated in many cancers (Nusse and Clevers, 2017[href=https://www.wicell.org#bib16]), was found to be a key regulator of lysosomal function. These studies uncovered that lysosome function is normally repressed by GSK3 via the tumor suppressor Axin1 (Albrecht et al., 2020[href=https://www.wicell.org#bib1]). Endocytosed Wnt receptor complexes result in the sequestration of GSK3 and Axin1 from the cytosol inside membrane-bounded multivesicular bodies (MVBs)/lysosomes through the membrane invagination process known as microautophagy (Taelman et. al., 2010[href=https://www.wicell.org#bib18]; Vinyoles et al., 2014[href=https://www.wicell.org#bib20]). Significant increases in lysosomal activity followed activation of the Wnt pathway initiated by short treatments with recombinant Wnt3a growth factor protein or pharmacological GSK3 inhibitors and in cells with mutations in the tumor suppressor protein Axin1. Within minutes of Wnt stimulation, the cortical actin machinery is activated and results in typical plasma membrane ruffling associated with macropinocytosis (Albrecht et al, 2020[href=https://www.wicell.org#bib1]) and endocytosis of Bovine Serum Albumin (Albrecht et al., 2018[href=https://www.wicell.org#bib2]), both through β-catenin dependent and independent mechanisms (Redelman-Sidi et al., 2018[href=https://www.wicell.org#bib17]; Tejeda-Muñoz et al., 2019[href=https://www.wicell.org#bib19]). GSK3 inhibition (or Wnt3a) triggered macropinocytosis within minutes, resulting in a dramatic increase in lysosomal activity within 20 min or less, even in the absence of new protein synthesis.\nWhile optimal concentrations and timeframes will need to be determined for different cell types and physiologic contexts, the following steps outline protocols for studies of Wnt signaling as a reference starting point for studies on regulated lysosome activity.\n24 h following cell plating onto coverslips before/during incubation with lysosomal tracers:",
    "Drug treatments: GSK3 inhibitors (40 mM LiCl or 8 nM CHIR99021) or controls (40 mM NaCl or DMSO) can be added a few minutes prior or together with medium plus lysosomal tracers (LysoLive, Sir-Lys, LysoSensor).\nGrowth factor treatments: Wnt3a (100 ng/mL) and control buffer in DMEM can be added together with lysosomal tracer, according to the probe recommendations above. Total time with Wnt3a was typically 20 min.\nProtein synthesis inhibition: cycloheximide (20 μg/mL) should be added to cells at least 4 h prior to incubation with DMEM + lysosomal tracer.\nTransfection: 24 h prior to lysosomal assays, the desired DNA transfections can be tested as is standard following lipofectamine 2000 manufacturer protocols.\nAdditional insight into regulated lysosomal function in relation to endocytosis\nTo study extracellular protein degradation in lysosomes with lysosomal activity tracers: dilute Bovine Serum Albumin DeQuenched (BSA-DQ) (5 μg/mL), or Ovalbumin-DQ (5 μg/mL) in DMEM and incubate with cells for 30 min. BSA-FITC (5 μg/mL) can be used as a fluid-phase marker of endocytosis that fluoresces without requiring lysosomal degradation (Albrecht et al., 2018[href=https://www.wicell.org#bib2] and 2020[href=https://www.wicell.org#bib1]).\nTo study specifically macropinocytosis with lysosomal tracers: dilute TMR-Dextran 70 kDa (1 mg/mL) in culture medium and incubate with cells for 30 min or less.\nProceed with 3 times PBS washes and fixation in 4% PFA diluted in PBS (0.5 mL per well), as above.\nFor antibody co-staining:\nWash with PBS three times to remove PFA (0.5 mL per well).\nPermeabilize cells with either digitonin (6.5 μg/mL) or Triton X-100 (0.15%) diluted in PBS with 0.5 mL per well).\nWash with PBS three times to remove detergent (0.5 mL per well).\nBlock cells for 1 h in blocking buffer containing 5% goat serum, 5% bovine serum albumin, PBS, and sodium azide (0.5 mL per well).",
    "Primary antibodies diluted in blocking buffer should be incubated with cells for 1 h at 20°C with limited light exposure (0.5 mL per well).\nNote: The use of antibody staining with lysosomal proteins such as Lysosome Associated Membrane Protein 1 (LAMP1) with standard fluorescent lysosomal markers is routinely performed to confirm lysosome localization and could be applied with any of the reagents described here (Klionsky et. al., 2008[href=https://www.wicell.org#bib12]).\nWash in 3 times with PBS (0.5 mL per well).\nSecondary antibodies diluted in blocking buffer should be incubated with cells for 40 min at 20°C (0.5 mL per well).\nWash 3 times with PBS (0.5 mL per well).\nMount cells in mounting media without DAPI.\nDry in dark area at 20°C for 16 h prior to imaging.\nPause Point:"
  ],
  "subjectAreas": [
    "Molecular/Chemical Probes",
    "Metabolism",
    "Microscopy",
    "Cancer",
    "Cell Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}