{
  "id": 9126,
  "origin_website": "Jove",
  "title": "Acrylic Resin Molding Based Head Fixation Technique in Rodents",
  "procedures": [
    "Ethics Statement: \nThis experiment was approved by the Kyungpook National University Institutional Animal Care and Use Committee, and was performed according to Guide for the Care and Use of Laboratory Animals (National Institute of Health, 1996). After experiment, animals were sacrificed under carbon dioxide euthanasia.\n1. Design of the Head-fixation Bar for Rats\nNOTE: This step is a general guideline for a fixation bar design. Any modification about the dimension and material is possible depending on animals or implants. Designing a head-fixation bar using CAD software is recommended but not necessary.\nUse CAD software to design a fixation bar.\n\t\nDesign a fixation bar of a rectangular shape (123 × 35 × 6 mm) (Figure 1A). Make a rectangular notch (16 × 20 mm; port) in the middle of the fixation bar. Add slopes or indentations which serve as a guide rail on the borders of the port (Figure 1A-a, Figure 1B-arrows).\n\t\tNOTE: Ensure that the area of the port covers the estimated rectangle of rat’s skull over the brain to allow vertical accesses using a stereotaxic manipulator to most of the brain areas through a craniotomy.\nAttach plates (50 × 20 × 6 mm) with two elongated anchoring holes on both sides of the fixation bar. Ensure that these holes pass screws of 6 mm diameter (Figure 1A-d). Make a hole of diameter 3 mm in front of the port for a locking hook (Figure 1A-b).\nMake a box having a floor (135 × 305 mm) and side walls (305 × 76 mm). Drill two 6 mm diameter holes as shown in Figure 1A (inset). Add supporting walls on the fixation bar (Figure 1A-e).",
    "Manufacture the designed bar and box and assemble each of them using cyanoacrylate as shown in Figure 1A (inset). Assemble the bar on the box using screws of 6 mm diameter. Apply slope by adjusting the screw position of the bar for ergonomic head fixation (Figure 1A-inset).\n\tNOTE: For mice, the dimension of the fixation bar is 60 × 20 × 4 mm (consisting of two layers of 2 mm thick acrylic panels). The port is square of 8 mm width (upper) and 9 x 10 mm (lower) as shown in Figure 1C. Anchoring plates are the same size of rats’. The box plate and side walls are 100 × 72 mm and 100 × 50 mm, respectively.\n2. Head Mounter Construction during Implantation Surgery\nCAUTION: Be cautious when dealing with dental acrylic resin. Liquid may cause skin irritation. Put on a mask and wear gloves. Work in a well-ventilated area.\nPreparation before surgery\n\t\nTightly wrap the border of the port of the fixation bar using a paraffin film to prevent adhesion of applied acrylic resin to the bar (see Figure 1B and Figure 2A). Coat the boarder of the port covered by the paraffin film with a thin layer of acrylic resin.\nUse sterilized surgical instruments. Thoroughly disinfect stereotaxic frame and its surrounding using 70% ethyl alcohol.\nPerform stereotaxic implantation surgery\n\t\nAnesthetize an animal by intraperitoneal injection of a cocktail mixture (2 ml/kg) of ketamine 10 ml (50 mg/ml), xylazine hydrochloride 1.5 ml (23.32 mg/ml), and saline 2.5 ml. Confirm that the animal fully anesthetized and does not respond to tail and toe pinches. Inject cocktail mixture of 1 ml/kg during surgery when necessary.",
    "Fix the animal to the stereotaxic apparatus. Apply ophthalmic ointment on eyes to prevent dryness during surgery. Shave and clean the scalp with 70% ethanol. Give subcutaneous injection of 2% lidocaine and incise the scalp along the midline of the skull. Completely scrape off periosteum. Rinse with saline several times.\nMake burr-hole drilling near the rim of the skull. Implant screws 4-5 turns (up to 1 mm depth) from the skull surface to prevent a breach of the dura mater.  Make sure no leakage of CSF and blood on the skull surface after screw implantation. Rinse with saline and dry the skull surface using air-puff, especially around the screws.\nCoat skull surface with a thin layer of “dental adhesive (Super-Bond C&B)”. Do not entirely cover the surface of the skull including the bregma if additional electrode implantation is scheduled. Use the bregma for marking craniotomy coordinates. Implant electrodes and/or microdrive and fix it on the skull by applying acrylic resin around it.\nApply additional acrylic resin on top of the dental cement. Use appropriate amount of acrylic resin to leave sufficient fill-out space between bar-coated resin and initial mounting resin when fixating the screws and/or electrodes (Figure 2A).\nPlace head-fixation bar 5 mm or more above the skull surface and align its center (Figure 2A-Left).\nApply acrylic resin into the gap between the base of the skull and initial mounting resins. (Figure 2A-Center). Wait until the resin become hard.\nRemove ear-bar and pull the molded mounter out of the fixation bar port. (Figure 2A-Right). Carefully apply additional acrylic resin around the edge rails of the molded mounter if necessary.",
    "Rinse the wound surface of the scalp with sterile saline. Inject an antibiotic (enrofloxacin, 5 mg/kg s.c.) and an analgesic (butorphanol tartrate, 2 mg/kg s.c) immediately after surgery. House the animal individually in a single cage.\n3. Habituating Animals to Head-fixation\nNote: This step describes habituation schedules based on authors’ empirically successful assessments. For an overview of habituation procedure for head-fixation, see Schwartz’s10 or Guo’s11 work.\nGive sufficient recovery period (a week or more) to animals. On Day 1, Handle animals frequently on divided short sessions.\nOn the next day (Day 2), expose the animal to the fixation environment (box). Do not insert their head mounter into the port of the fixation bar. Leave animals to get accustomed to the environment. Securely grab the head mounter using hand for 1 to 2 sec and release it immediately. Repeat short term fixation by hand-grab several times.\nOn Day 3, habituate animals to head-fixation.\n\t\nBring animals from the home cages and settle them in the box directing heads toward the port of the fixation bar. Grab the head mounter and insert it into the port of the fixation bar.\nBind the mounter (animal’s head) to the locking hook of the fixation bar using a rubber band. Stand for 5 min.\n\t\tNOTE: Do not touch the trunk or tail of the animal after fixation, which leads the animal to squeak and struggle increasing animal’s stress. When the animal continues struggling more than 1 min, release it and try later. From this step, animals show urine and feces excretion whenever exposed to head fixation but this gradually gets reduced as habituation proceeds.",
    "Retrieve the locking rubber band and eject the mounter out of the port. Put the animals back to the home cage and provide a piece of cereal or a sunflower seed into the home cage as a reward. The next trial begins in 30 min. Repeat 3.4.1 to 3.4.4 five or more within a day.\nOn Day 4 to 7, expose the animal to head fixation as described in Protocol 3.4. Gradually increase the duration of head fixation (10 min, 20 min, 30 min, and 50 min as habituation proceeds).\n\tNOTE: If animals do not feed the food reward, it can be a sign of a high level of stress. Do not increase the fixation time. If animals show repeated struggling behavior, habituate them for a longer period.\nCheck animal’s body weight daily. Consider unsuccessful habituation when body weight is decreasing. Proceed to behavioral tasks with head fixation after successful habituation.\n\tNOTE: Successful habituation facilitates subsequent behavioral training (Figure 3E and F).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}