{
  "id": 1635,
  "origin_website": "Cell",
  "title": "An Optimized Protocol for ChIP-Seq from Human Embryonic Stem Cell Cultures",
  "procedures": [
    "Step-By-Step Method Details\nStep-By-Step Method Details\nFixation of Cells\nTiming: 1–1.5 h\nFigure 1[href=https://www.wicell.org#fig1] This part dissociates hESCs and immediately fixes them with formaldehyde to capture proteins on the DNA. At the time of fixation, pluripotent hESC colonies should be dense monolayers with tight borders, but not overgrown. Differentiated hESCs (for example, with Bone Morphogenetic Protein 4, BMP4) may have changed morphology but should likewise not be overgrown. See Figure 2[href=https://www.wicell.org#fig2] for examples of recommended hESC cultures at the time of fixation.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/110-Fig1.jpg\nFigure 1. Schematic Summary of Part 1: Fixation of Cells, Which Starts with hESC Cultures and Ends with Snap-Frozen, Formaldehyde-Crosslinked Samples that Can Be Stored at −80°C\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/110-Fig2.jpg\nFigure 2. Example Images of hESC Cultures Used for ChIP-Seq\nThis protocol has been used successfully with the hESC line H1 as pluripotent cells, or differentiated with BMP4 (50 ng/mL) for 6 h, 24 h, 48 h, and 72 h. Scale bar represents 100 μm.\nNote: Volumes given in brackets are for a 6-well plate. A 6-well plate that is approximately 70% confluent will provide roughly 7E+06 cells. This is sufficient for 2 aliquots of 3E+06 cells, with each aliquot used for 1 ChIP sample.\nRemove media and wash once with room temperature (20°C–21°C) room-temperature Dulbecco’s Phosphate Buffered Saline (DPBS) (2 mL per well)\nAdd just enough TrypLE Express Enzyme to cover the cells (250 μl per well)\nIncubate at 37°C until the cells appear to be mostly single cells under a microscope. Tap the edge of the tray every 2–3 min to help shift the cells.",
    "Critical: ESCs grow in dense colonies which, if insufficiently dissociated, can lead to high levels of heterogeneity in chromatin shearing with sonication and hence impact data quality. However, cells will lyse if incubated with TrypLE for too long; 4–5 min is typical for pluripotent cells. See Troubleshooting 2[href=https://www.wicell.org#sec7.3].\nAdd growth media (e.g., mTeSR1) to 3× the volume of TrypLE (750 μl per well), and briefly pipette the suspension up and down against the base of the plate to break up remaining clumps. Wash off any cells still stuck to the tray.\nPipette cell suspension into a screw-cap tube, pooling cells that have been grown under the same conditions (6 wells = 6 mL). Immediately add fresh, methanol-free formaldehyde to a final concentration of 1% (375 μL of 16% stock) and shake to mix.\nCritical: Add fresh media to the cells in TrypLE without pelleting and resuspension before adding formaldehyde, to minimize the time that cells spend in suspension before fixation, in order to prevent changes in expression profiles.\nCritical: Do not add formaldehyde directly to the 6-well culture plate, as it would result in very heterogeneous shearing patterns with both high and low molecular weight fragment smears. This may be due to cells in a dense colony potentially having different exposure to the fixative depending on their position within the colony, or it may be a result of heterogeneous clumps of cells in the sonication reaction since fixed colonies become very difficult to lyse and dissociate. For this reason, we use dissociation prior to fixation.\nPlace on rocker at room temperature (20°C–21°C) for 10 min.\nCritical: The duration of fixation before quenching is important, as over- or under-fixation will affect the results. See Troubleshooting 4[href=https://www.wicell.org#sec7.7].",
    "Quench the formaldehyde by adding 1:10 volume (640 μl) of cold 1.25 M Glycine. If the growth media contains phenol red, the suspension should become bright yellow. Let it rock at room temperature (20°C–21°C) for 5 min.\nNote: After this step, cells should always be kept on ice unless otherwise indicated.\nPellet cells by spinning at 760 × g for 5 min at 4°C. Carefully tip off supernatant and resuspend pellet in an equivalent volume of cold DPBS with gentle pipetting (6 mL).\nPellet cells by spinning at 760 × g for 5 min at 4°C. Repeat wash step with cold DPBS (6 mL).\nRemove supernatant and resuspend pellet in 1 mL of cold DPBS with gentle pipetting, then transfer to a 1.5 mL microfuge tube on ice.\nTake 5 μl of cell suspension and perform a cell count to determine concentration. You may need to dilute this sample to bring the concentration within a range to be accurately counted.\nNote: The cell count (and subsequent aliquots of 3E+06 cells) are to control the concentration of the cell suspension used in the sonication reaction, as cell density can affect the efficiency of shearing. In this protocol, we also use cell count to determine an equal input between samples as a simpler option in comparison to measuring the specific amount of chromatin. Freezing a defined number of cells per aliquot can also make it easy to thaw exactly enough cells for your experiment.\nFrom your 1 mL suspension, pipette aliquots of 3E+06 cells into 1.5 mL microfuge tubes on ice.",
    "Note: DNA yield from a ChIP experiment is dependent on various things, such as the efficacy of the primary antibody and the abundance and activity of your protein of interest – a ChIP for a modified histone, for example, will yield a lot more DNA than a ChIP for a transcription factor with relatively few binding sites. We have recommended 3E+06 cells as a default amount in this protocol because this gave at least 1 ng of DNA for all of the transcription factors we tested (SMAD1, SMAD2, GATA3), which is a good input amount for sequencing library generation. For highly abundant targets (e.g., pluripotency transcription factors POU5F1, SOX2, NANOG) we speculate that 1E+06 or even 5E+05 cells will still yield sufficient DNA.\nPellet cells by spinning at 380 × g for 5 min at 4°C. Remove the supernatant with a pipette, taking care not to disturb the pellet.\nResuspend cells in 300 μl of High Salt Lysis/Sonication Buffer with freshly added Protease Inhibitor Cocktail.\nSnap freeze cells in a dry ice and ethanol bath, and store at −80°C.\nNote: Snap freezing helps preserve the integrity of the samples by preventing ice crystal formation.\nPause Point: Snap-frozen fixed cells may be kept at −80°C for several months.\nShearing and Immunoprecipitation of Chromatin\nTiming: 3 days\nFigure 3[href=https://www.wicell.org#fig3] This part of the protocol will shear the fixed chromatin into a size-range suitable for sequencing, then use a specific antibody to pulldown fragments of chromatin that are cross-linked to your protein of interest. The crosslinks will then be reversed and the DNA fragments purified.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/110-Fig3.jpg\nFigure 3. Schematic Summary of Part 2: Shearing and Immunoprecipitation of Chromatin, Which Starts with Thawed Formaldehyde-Crosslinked Samples and Ends with Purified, ChIP-ed DNA that Can Be Stored at −20°C",
    "Day 1: Shearing of chromatin and incubation with primary antibody\nIncubate primary antibody with Dynabeads (Protein G or Protein A, depending on the species of your primary antibody) by doing the following:\nResuspend Dynabead slurry with pipetting and gentle swirling as beads will have settled out during storage.\nAliquot 20 μl of Dynabead slurry per ChIP and place in a microfuge tube (0.2 mL or 0.5 mL)\nAdd 2–5 μg of primary antibody per ChIP to the Dynabeads and add Chromatin Dilution Buffer to a final volume of 40 μl\nIncubate with rotation or gentle agitation at room temperature (20°C–21°C) for 3 h.\nNote: 20 μl of Protein G Dynabeads has a binding capacity of roughly 4.8 μg of IgG. Check the binding capacity and slurry concentration of your Dynabeads stock to confirm.\nNote: Incubating the antibody with the Dynabeads prior to incubation with the chromatin sample (a Direct IP) is recommended for conserving antibody. For lower affinity antibodies, it may help to incubate the sample with the antibody first, followed by the Dynabeads (an Indirect IP). See Troubleshooting 4[href=https://www.wicell.org#sec7.7] for more details.\nCritical: The amount of primary antibody required for good signal:noise in a ChIP is usually 2–5 μg, but this varies and may need to be tested and optimized for each antibody. See Troubleshooting 4[href=https://www.wicell.org#sec7.7].\nThaw 1 aliquot of 3E+06 fixed cells per ChIP experiment on ice for at least 30 min. While samples are thawing, start the Diagenode Bioruptor and water bath system to give it time to cool to 4°C.\nTransfer the cell aliquot to a Diagenode TPX tube (1.5 mL) on ice for sonication.",
    "Sonicate samples in the Diagenode Bioruptor for 30 s on, 30 s off on High. We have found 10 - 12 cycles to be best for a size range of 100 bp to 500 bp from 3E+06 cells.\nCritical: The optimal number of cycles can vary with sonicator make and model, so it is highly recommended that this is tested first. The range of chromatin fragment sizes is critical for good coverage and resolution of data, without losing material due to over-fragmentation. See Troubleshooting 3[href=https://www.wicell.org#sec7.5].\nAdd 1 mL of cold Chromatin Dilution Buffer with fresh Protease Inhibitor Cocktail to each sonicated sample, and spin at 13,600 × g for 30 min at 4°C. This will pellet any insoluble material.\nRemove the supernatant containing soluble chromatin and place in a protein low-bind tube (2 mL).\nTake 65 μl of soluble chromatin as a 5% Input sample and store at −20°C.\nNote: 5% Input will provide plenty of chromatin for all tests described in this protocol, but a larger or smaller input sample could also be taken as required.\nNote: It may be necessary to check the fragmentation pattern of the chromatin prior to continuing with the IP. In this case, snap freeze the remaining soluble chromatin sample as in step 15 and continue with the 5% Input sample from steps 17g–18e before checking the fragmentation as described in Test 1 (step 19). Then thaw the chromatin sample on ice before continuing with the protocol. However, if the shearing by sonication has been optimized and appears to be highly reproducible (as we have found), it is recommended to avoid subjecting the chromatin to an extra freeze/thaw cycle.",
    "Add Dynabead + Primary Antibody mix to the soluble chromatin and incubate at 4°C for at least 12 h, with rotation such that the samples mix and the Dynabeads remain suspended (e.g., 15–20 rpm on a circular rotator).\nDay 2: Washing and Elution\nRemove the unbound supernatant from the beads (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/110-Fig4.jpg\nFigure 4. Schematic Showing Separation and Washing of Magnetic Beads with Bound Antibody and Protein-DNA Complexes\nWhen placed in a magnetic holder for approximately 2 min, beads will separate to the side of the tube eventually leaving a clear supernatant. While leaving the tube in the magnetic holder, the supernatant can be removed with a pipette without touching the beads. The next wash should be added immediately to avoid drying the beads.\nPlace the tubes in the magnetic holder and let sit for 2 min or until all the Dynabeads have separated to the edge of the tube.\nWhile keeping the tubes in the holder and without touching the beads, carefully remove the supernatant with a pipette.\nWash by adding 1 mL of Wash Buffer to the beads before removing the tubes from the holder and incubating with rotation at 4°C for 5 min, for the following washes:\nWash Buffer A\nWash Buffer B\nWash Buffer C\nTE Buffer (first wash)\nTE Buffer (second wash)\nRemove the final wash and add 100 μl of Elution Buffer to the beads. Briefly vortex to resuspend, then incubate at 65°C for 5 min.\nNote: For this step, a water bath or heating block can be used as an alternative to an incubator or oven.\nNote: . Incubating for 30 min at 65°C would likely also work, although we would still recommend performing two rounds of elution to improve yield.",
    "Incubate samples at room temperature (20°C–21°C) for a further 15 min with rotation or agitation.\nSeparate the Dynabeads using the magnetic holder and remove the eluate to a new 1.5 mL tube.\nAdd a fresh aliquot of 100 μl of Elution Buffer and repeat steps 17c to 17e. Pool the first and second round eluates together (final volume is 200 μl).\nAdd 135 μl of Elution Buffer to the 65 μl Input sample from Day 1 (final volume is 200 μl).\nFor both Input and ChIP samples, increase NaCl to 160 mM (add 8 μl of 4 M stock) and add RNase A to a final concentration of 20 μg/mL (add 0.4 μl of a 10 mg/mL stock). Briefly vortex to mix.\nIncubate samples at 65°C for at least 8 h to reverse crosslinks and digest any contaminating RNA.\nDay 3: Protein Digestion and DNA Purification\nFor both Input and ChIP samples, increase EDTA concentration to 5 mM (add 2 μl of 0.5 M stock) and add Proteinase K to a final concentration of 200 μg/mL (add 2 μl of 20 mg/mL stock).\nIncubate at 45°C for 2 h to digest proteins.\nPurify ChIP and Input samples using a Zymo ChIP DNA Clean & Concentrator Kit and following manufacturer’s instructions. Elute in 26 μl of Kit Elution Buffer.\nTake 0.5 - 1 μl from each sample for quantification of DNA concentration using a Nanodrop or Qubit fluorometer or equivalent technology.\nNote: The concentration of ChIP DNA will vary depending on your antibody and protein of interest but is commonly <2 ng/μL. The Input DNA will be many times higher, roughly in the range of 50 ng/ μL.\nStore eluted samples at −20°C.\nPause Point: DNA samples may be kept long-term at −20°C or −80°C.\nChecking Quality of ChIP Samples",
    "Timing: 0.5–1 day\nFigure 5[href=https://www.wicell.org#fig5] Before committing to the time and expense of sequencing, it is best to check the quality of your samples for (1) size range of DNA fragments, (2) relative enrichment of areas of DNA known to be bound by your protein of interest, and (3) non-specific enrichment of other areas, including highly transcribed regions that have previously been reported to be enriched by some antibodies (‘hyper-ChIPable’ regions). These tests will consume a minimal amount of your purified DNA.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/110-Fig5.jpg\nFigure 5. Schematic Summary of Part 3: Checking Quality of ChIP Samples\nThese steps use a minimal amount of purified, ChIP-ed DNA. The remaining sample can be used to generate sequencing libraries and then sequenced.\nTest 1: Chromatin Fragmentation\nNote: It is important that crosslinks have been reversed and chromatin has been purified before assessing fragmentation patterns, as DNA migration through the gel can be affected\nAnalyse the fragment size distribution of the purified chromatin samples by taking 1–2 μl from each sample and running it on an Agilent TapeStation according to manufacturer’s instructions (Figure 6[href=https://www.wicell.org#fig6]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/110-Fig6.jpg\nFigure 6. Example Sonicated Chromatin (Input Samples) from H1 hESC Cultured in mTeSR1 on Matrigel, Separated on an Agilent Tapestation System with a High Sensitivity D1000 ScreenTape\nBoth the pseudo-gel image (A) and the plot of signal intensity vs predicted fragment size (B) show that the majority of the DNA lies in the 100 bp to 500 bp range, with an intensity peak at 260 bp and an average size of 352 bp for signal over the 50–1,000 bp range. Upper (1,500 bp) and Lower (25 bp) size markers are indicated.",
    "Alternatives: Take 5 μl from the Input sample and run it on a 1.8% Agarose electrophoresis gel at 100 V or less. Make sure to use a DNA ladder with sufficient resolution at the <500 bp range (e.g., NEB 1 kb+ DNA Ladder).\nCritical: The majority of DNA should fall between 100 and 500 bp for good resolution in ChIP-seq. See Troubleshooting 3[href=https://www.wicell.org#sec7.5].\nTest 2: qPCR of Positive and Negative Control Sites\nIn order to assess the success of the ChIP, it is best if at least one canonical binding site for your protein of interest is known – if not, it is still possible to test that negative control regions are not significantly enriched (ideally CT value of >30) , and Test 3 should still be performed.\nTake 5 μl of the Input Sample and add it to 20 μl of nuclease-free water to make a diluted Input sample that is now roughly 1% of the original total input. This will make analysis easier later.\nSet up a QPCR assay in triplicate using your positive control primers and negative control primers (see Table 1[href=https://www.wicell.org#tbl1] for reaction mix; note that the amount of sample per reaction can be increased if enrichment is low), for:\ntable:files/protocols_protocol_110_8.csv\nChIP sample(s)\nDiluted 1% Input sample\nRun the assay according the recommendations of the manufacturer of the qPCR Machine and SYBR Green Mastermix.\nCalculate signal of each product for each ChIP sample as a percentage of total input chromatin using the following equations (primer amplification coefficient is estimated as 2):\nCT(Input) = CT(1% Input) – log2(100)\nΔCT = CT(Input) – CT(ChIP)\n% of Input = 2ΔCT × 100\nCompare the enrichment of positive and negative control regions.",
    "Note: The positive control amplicon should be more enriched than the negative control amplicon. For good quality ChIP-seq data, we recommend aiming for a positive: negative ratio (% Input of Positive Region / % Input of Negative Region) of at least 10. Additionally, the negative control ChIP sample reaction should ideally have a CT value of >30, whereas we expect a 1% Input reaction CT in the range of 22 - 25, and the positive control ChIP sample reaction CT ideally <27. See Troubleshooting 4[href=https://www.wicell.org#sec7.7].\nTest 3: qPCR of a Highly Transcribed tRNA Gene\nWe have found that enrichment of highly transcribed regions such as tRNA genes is an issue for some primary antibodies, which has also been reported in the literature (Teytelman et al., 2013[href=https://www.wicell.org#bib9]) (Park et al., 2013[href=https://www.wicell.org#bib5]). Indeed, in a prior experiment we discovered that up to 80% of our sequencing reads were mapped to tRNA regions, to the extreme detriment of signal at other sites. We therefore recommend testing for enrichment relative to a negative control at least once for every new antibody used for ChIP. This is important because not only will these regions provide a false impression of the target protein binding profile, this enrichment will consume sequencing reads and reduce signal from sites that are legitimately bound.\nSet up a qPCR assay in triplicate using tRNA-Gln Primers (see Table 1[href=https://www.wicell.org#tbl1] for reaction mix), for ChIP sample\nDiluted 1% Input sample (test 2, step 20a)\nRun the assay according the recommendations of the manufacturer of the qPCR Machine and SYBR Green Mastermix\nCalculate signal of tRNA for each ChIP sample as a percentage of input chromatin as in test 2, step 20d\nCompare to % enrichment of positive and negative control regions from Test 2 (Figure 7[href=https://www.wicell.org#fig7])\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/110-Fig7.jpg",
    "Figure 7. An Example qPCR of ChIP Samples Using Different Antibodies against SMAD1 in H1 hESCs Treated with BMP4 (50 ng/mL) for 1 h\nID1 Promoter (green) is the positive control region, HPRT Promoter (yellow) is the negative control region, tRNA-Gln (red) is a highly transcribed region that is significantly enriched by the first antibody (SMAD1, Cell Signaling Technology #6944) but not the second (phospho-SMAD1/5/9, Cell Signaling Technology #11971). Left histogram shows signal as % Input for n = 1 sample, right histogram shows mean signal as % Input for n = 3 biological replicates, error is standard deviation.\nCritical: Levels of the tRNA-Gln amplicon should be similar to levels of the negative control amplicon. Additionally, the tRNA-Gln ChIP sample reaction should ideally have a CT value of >30. If not, see Troubleshooting 5[href=https://www.wicell.org#sec7.9]."
  ],
  "subjectAreas": [
    "Chromatin Immunoprecipitation (Chip)",
    "Sequencing",
    "Chipseq",
    "Stem Cells"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}