{
  "id": 2661,
  "origin_website": "Cell",
  "title": "Processing and cryopreservation of human ureter tissues for single-cell and spatial transcriptomics assays",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nUreter tissue retrieval and preparation for digestion\nTiming: 20 min\nThis protocol begins with the retrieval of ureter tissues from the operating room, which vary in size. Use of surgical energy devices such as electrocautery should be avoided during tissue collection. The tissue should be brought back to the lab immediately, keeping it in a container of PBS and on ice the whole time. It is best to minimize the time between collection and processing, and record any potential variations. While this protocol has only been used for downstream 10X Genomics scRNA-seq platform, it is hypothesized to be universally applicable to additional scRNA-seq platforms requiring an input of high-viability single-cell suspensions. Papain has proven to be a less-damaging proteolytic enzyme in a variety of tissue types.2[href=https://www.wicell.org#bib2],3[href=https://www.wicell.org#bib3],4[href=https://www.wicell.org#bib4]\nRecord any necessary details and observations about the tissue in your lab notebook.\nInclude information such as the date, time of retrieval, variations in elapsed time from transporting the tissue, sample identifiers, and length of the ureters.\nWash tissue with enough PBS to cover in 50 mL conical (Figure 1[href=https://www.wicell.org#fig1]), centrifuge at 1,000 × g for 5 min at 20°C–25°C, and aspirate PBS.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2154-Fig1.jpg\nFigure 1. Physical appearance of ureter specimen\nExample of a ureter tissue sample post-cystectomy (left) and after being transferred to a new 50 mL conical in PBS.\nTransfer tissue to a sterile 10 cm tissue culture dish using tissue forceps.\nIf the tissue is large, cut a piece that is approximately 1 cm in length for each separate aliquot of papain.\nThoroughly mince the tissue at 20°C–25°C using a sterile blade.\nFirst start by cutting it with razor blades into as small of pieces as possible.",
    "Once the pieces are too small to slice, mince the tissue until a paste-like consistency is achieved (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2154-Fig2.jpg\nFigure 2. Initial micing of ureter specimen\nBefore (left) and after (right) thoroughly mincing a 1 cm long section of human ureter.\nTransfer minced tissue to a 50 mL conical containing 5 mL papain and 500 μL DNase (make sure there is enough volume to submerge the tissue).\nCritical: To prevent tissue from drying while mincing it, you can add a few drops of the papain/EBSS solution on to the dish.\nUreter tissue enzymatic digestion and cell clean-up\nTiming: 1.5–2 h\nDuring this step, the ureter tissue is enzymatically digested using papain, DNase, and gentle shaking to release single cells. The aliquot of DNase should be kept on ice until this step.\nWrap cap with parafilm and incubate horizontally with gentle shaking (100 rpm) at 37°C for 1 h.\nNote: Keeping the tube horizontal is important for maintaining a homogenous mixture and minimizing the settling of tissue onto the bottom of the conical tube, contributing to the overall efficiency of the digestion.\nOptional: Shaking can be achieved with a standard bacterial shaker or by placing a rotating shaker inside of a 37°C incubator.\nGently triturate using P1000 pipette to check if tissue is digested (can cut the tip if there are chunks).\nOptional: The incubation time can be prolonged to 90 min in order to increase the cell yield. Additionally, you can take the tube out and gently vortex every 15 min.\nAfter incubation, add 5.5 mL of ovoid inhibitor to the tissue suspension to stop the digestion.\nFilter the mixture by passing the entire volume (∼11 mL) through a 70 μm cell strainer to remove large debris (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2154-Fig3.jpg\nFigure 3. Removal of large debris",
    "Post-digestion filtering through a 70 μm cell strainer (panels 1–3) and an example of residual tissue left in the filter afterwards (far-right panel).\nPlace a new 70 μm filter onto the top of an open 50 mL conical tube.\nCarefully and slowly pipette up the cell suspension and expel it through the middle of the filter, being careful not to overflow.\nOnce the cell suspension has passed through the filter, discard the filter and cap the 50 mL conical.\nNote: There will be clumps of indigestible tissue left in the filter. If you started with a large piece of tissue, there may be a propensity to clog the filter. Use a sterile pipette tip to move the extra tissue around the filter so there is a clear path for the liquid to flow through.\nCentrifuge cell suspension at 1,000 × g for 5 min at 20°C–25°C in a rotating bucket centrifuge to pellet cells and carefully discard supernatant.\nNote: The pellet may be small, loose, and hard to see so be careful when aspirating the supernatant to avoid accidently sucking up any of the pellet. It helps to leave a few hundred microliters of supernatant in the bottom to avoid removing any of the pellets by accident. The safest way to minimize cell loss is to gently aspirate and avoid decanting.\nResuspend cell pellet in 3 mL ACK lysis buffer and incubate at 20°C–25°C for 3 min, centrifuge at 1,000 × g for 5 min at 20°C–25°C, and carefully discard supernatant.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2154-Fig4.jpg\nFigure 4. Elimination of red blood cells\nAn example of the cell pellet color and size before (left) and after (right) ACK lysis buffer treatment and centrifugation.\nOptional: Transfer the ACK/cell suspension to a new 15 mL conical. A smaller conical will help in visualizing the pellet.",
    "Note: The pellet should go from a red color to nearly white/colorless after the incubation with ACK lysis buffer (Figure 4[href=https://www.wicell.org#fig4]). Maintain the same careful aspiration of the supernatant as in the previous step.\nResuspend the cell pellet with 5 mL PBS at 20°C–25°C, centrifuge at 1,000 × g for 5 min at 20°C–25°C, and carefully discard supernatant.\nResuspend the pellet in 200 μL of PBS at 20°C–25°C and transfer to a 1.5 mL Eppendorf tube.\nNote: Larger pellets may need to be resuspended in 500 μL–1 mL of PBS in order to obtain a countable cell density. On the other hand, smaller pellets may require a smaller volume. For 10x Genomics scRNA-seq sequencing, the optimum cell density is 1,000 cells/μL, and the pellet depicted in Figure 4[href=https://www.wicell.org#fig4] (right side) was resuspended in 250 μL PBS.\nPass the PBS/cell suspension through a 40 μm Flowmi tip (Figure 5[href=https://www.wicell.org#fig5]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2154-Fig5.jpg\nFigure 5. Passage of cells through Flowmi tip\nThe proper attachment of a 40 μm Flowmi tip (left panel) and expelling the sample through the Flowmi tip (right panel).\nFirst, pull the PBS/cell suspension into the tip of a p1000 pipette.\nOnce the suspension is inside the tip, attach a 40 μm Flowmi tip to the tip of the pipette tip.\nOnce firmly in place, slowly expel the cell mixture into a new 1.5 mL Eppendorf tube. Do not go past the first stop on the pipette when expelling the liquid.\nTake an aliquot of cells (10 μL) and mix 1:1 with Trypan blue to determine cell viability, concentration, and extent of cellular aggregation. (Figure 6[href=https://www.wicell.org#fig6]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2154-Fig6.jpg\nFigure 6. Cell suspension QC\nAn example of the cell viability, count, and relative lack of cell aggregation, optimal for downstream 10x Genomics scRNA-seq sequencing.",
    "Note: Counts can be performed manually using a hemocytometer or an automated cell counter such as the Countess (Figure 6[href=https://www.wicell.org#fig6]). It is generally advisable to do a manual count regardless.\nNote: For 10x Genomics scRNA-seq, there should be minimal cell “clumps” (defined as two or more cells aggregated together). If there are substantial clumps, the sample can be passed through a new Flowmi tip.\nOptional: BSA can be added to the PBS at a concentration of 0.04%–2% to decrease aggregation and minimize cell loss.\nAt this stage, the cells in PBS should be kept on ice for up to 30 min until they are ready to be processed for scRNA-seq or other downstream applications. If cryopreserving the cell suspensions, move on to step 18.\nCryopreservation and thawing of ureter single cell suspensions\nTiming: 30 min\nThis portion of the protocol is performed in order to store single cell suspensions in the −80°C freezer for long-term (several months) storage, that, when thawed, retain similar cell viability, heterogeneity, and can be used for downstream scRNA-seq and other applications. This method has also been used for preserving and thawing cells for successful organoid generation.\nDetermine the total number of cells to cryopreserve in order to approximate the best volume of freezing media to use.\nFrom the example cell count in Figure 6[href=https://www.wicell.org#fig6], with the given resuspension volume of 250 μL and factoring in the volume of Trypan blue, the total number of cells from 1 cm piece of ureter is roughly 250,000.\nFor cell numbers less than 1 million total cells, resuspend the pellet in 1 mL of freezing media, enough for one cryovial.\nFor higher cell yields, keep the cells at a concentration of 1 million/mL of freezing media.",
    "Note: Multiple simultaneous dissociations can be performed if the section of ureter is long enough. It is most efficient to break it into 1 cm long sections for each separate dissociation. This will maximize the cell yield from each ureter sample.\nPrepare the correct number of labeled cryovials.\nResuspend the cell pellet in the appropriate volume of freezing media and aliquot into the pre-determined number of cryovials for freezing.\nQuickly transfer the vials of cells into a Styrofoam box or an isopropanol cooler and place in the −80°C freezer.\nTo thaw the frozen cells, remove the desired number of vials from the −80°C freezer and quickly transfer the vial to a 37°C water bath.\nOnce the majority (>75%) of the sample is thawed and only a small chunk of ice remains, resuspend the cells in 10 mL of pre-warmed DMEM/F-12 media that has been supplemented with 10% FBS and transfer the liquid to a 15 mL conical.\nCentrifuge at 1,000 × g for 5 min at 20°C–25°C and gently remove the supernatant.\nTo wash, resuspend the cell pellet in 10 mL of PBS and centrifuge at 1,000 × g for 5 min at 20°C–25°C.\nDepending on the downstream application, resuspend the cell pellet in 250 μL-1 mL of PBS and keep on ice.\nTake a 10 μL aliquot of cell suspension and mix 1:1 with Trypan blue for a viability assessment.\nNote: If the cells have become aggregated during the cryopreservation, the user can pass the suspension through a 40 μm Flowmi tip if the downstream application requires a homogenous mixture of single cells.",
    "Note: Handling time during dissociation, length of time in the freezer, and general batch effects are all factors that dictate cell viability after thawing. Long-term storage (> 8 months) results in a significant drop in cell viability (< 70% viable) following this protocol, whereas short-term storage of 1 week to several months maintains similar viability as the cells prior to freezing.\nO.C.T. embedding of ureter tissue sections\nTiming: 30 min\nThis tangential portion of the ureter processing protocol is performed in order to cryopreserve whole pieces of tissue for downstream sectioning and spatial analysis using Visium or other methodologies such as immunofluorescence and immunohistochemistry. This protocol can be performed in parallel with the dissociation if there are multiple people processing the tissue. If there is only one person processing, this portion of the protocol can be performed during the one hour incubation period (step 7), as long as the piece of ureter for embedding has been kept on ice in PBS. From each 5 mm thick imbedded ureter tissue, approximately 500 × 10 μm sections, the optimum thickness for Visium, can be reached, with >75% of the sections usable for staining and Visium.\nBegin by taking a horizontal cross section of the ureter approximately 5 mm in length and typically < 0.5 cm in width (Figure 7[href=https://www.wicell.org#fig7]) and rinse in PBS.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2154-Fig7.jpg\nFigure 7. Removal of excess liquid from tissue\nAn example of a ureter cross section approximately 5 mm in length on a paper towel to remove excess moisture.\nUsing non-toothed forceps, gently pick up the tissue and wick off excess moisture using a paper towel (Figure 7[href=https://www.wicell.org#fig7]).\nObtain a pre-labeled cryomold and fill halfway with O.C.T., being careful not to introduce any bubbles.\nGently place the ureter tissue in the middle of the O.C.T./cryomold (Figure 8[href=https://www.wicell.org#fig8]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2154-Fig8.jpg",
    "Figure 8. Freezing tissue in O.C.T.\nAn example of ureter embedding and freezing in O.C.T, followed by wrapping in aluminum foil and transferring to a bucket of dry ice.\nLayer more O.C.T. on top of the ureter tissue to fill the mold and completely cover the tissue.\nTransfer the filled cryomold to the pre-chilled isopentane bath for freezing (Figure 8[href=https://www.wicell.org#fig8]).\nNote: the isopentane is cold enough when you add a small piece of dry ice and see no bubbles/boiling.\nThe O.C.T. will quickly start to turn opaque white around the edges until the whole sample is opaque white. This happens < 5 min for smaller tissues as described in this protocol.\nOnce the whole sample is frozen, wrap the sample in aluminum foil and place it in dry ice until it is ready to be transferred to the −80°C freezer.\nSeal the foil-wrapped samples in a plastic bag and place in a pre-chilled box in the −80°C freezer.\nCritical: The vapors from the isopentane are harmful when inhaled in large quantities, always make sure to have the isopentane covered when it is not being used and store the isopentane in a proper cabinet for flammable liquids."
  ],
  "subjectAreas": [
    "Cell Isolation",
    "Single Cell"
  ],
  "bigAreas": [
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}