{
  "id": 12106,
  "origin_website": "Jove",
  "title": "Three-Dimensional Bone Extracellular Matrix Model for Osteosarcoma",
  "procedures": [
    "Animal care and use are conducted according to the National Institutes of Health Guide for the Care and Use of Laboratory Animals (NIH publication NO.80-23, revised in 1996) after approval from the Animal Ethics Committee of Sun Yat-sen University.\n1. Bone preparation\nObtain 4 to 6-week-old BALB/c mice (without sex-specific requirement). Euthanize a mouse aseptically by cervical dislocation and cut off fresh fibula, tibia and femur from a hindlimb with sterile surgical scissors. Peel off the epithelial tissue and then remove as much of the soft tissue as possible using scissors and tweezers.\nRinse the leg bones with sterile 10 mM phosphate buffered saline (PBS) twice to remove blood in a 6 cm dish. Immerse the bones in 75% ethanol for 3 min, then rinse with PBS twice. The clean bones can be stored in a sterile 50 mL centrifuge tube with sterile PBS at -80 °C for months until required.\n\tNOTE: PBS used in all the following steps has 10 mM PO43−.\n2. Bone demineralization and decellularization\nThaw the frozen bones at room temperature, and then freeze again at -80 °C for 1 h. Subject the bones to more than 2–3 freeze-thaw cycles for cell lysis and tissue breakdown.\nIncubate the bones in a sterile 50 mL centrifuge tube with 0.5 N HCl overnight at room temperature on a rocking platform or orbital shaker with gentle rocking/shaking to ensure complete and even coverage of bones.\n\tNOTE: Make sure the bones are entirely immersed during motion in the acid and do not settle during the process. The volume of HCl solution should be more than ten times as that of the bones.",
    "After decalcification, decant the HCl solution completely and rinse under running water for 1 h. Then, wash the bones twice for 15 min per wash with distilled water on a rocking platform or orbital shaker.\n\tNOTE: Make sure to completely remove the solution or water between washes and after the final wash with distilled water.\nExtract the lipids in the demineralized bones with a 1:1 mixture of methanol and chloroform in a 50 mL centrifuge tube wrapped with tin foil for 1 h at room temperature10.\nThen, transfer the bones into another tube of methanol wrapped with tin foil for 30 min. Remove the methanol completely and rinse with distilled water twice for 15 min with gently shaking. Decant final wash water and proceed with the following steps under sterile condition.\n\tNOTE: During the extraction step, light must be avoided to prevent chloroform decomposition. The mixture can be stored in light-resistant container or a centrifuge tube wrapped with tin foil. Perform all treatment and wash steps under modest rotation or rocking motion.\nRinse the bones in a 6 cm dish with sterile PBS for 3 min, and then transfer the bones into a new 50 mL centrifuge tube. Add 40 mL sterile 0.05% trypsin-EDTA (TE) into the tube and incubate bones for 23 h in a CO2 incubator at 37 °C18.\nDiscard the TE solution and rinse twice with sterile PBS supplemented with 90 μg/mL ampicillin and 90 μg/mL kanamycin. After decanting the final wash PBS completely, replenish with 40 mL sterile PBS. Wash thoroughly for 24 h at room temperature with gentle rocking or shaking for antibiotic soak.",
    "NOTE: All the sterile PBS used in this and the following steps contains 90 μg/mL ampicillin and 90 μg/mL kanamycin. Overnight wash under rotation or rocking motion are performed for long periods thorough immersion with antibiotics to achieve effective sterilization of pore spaces.\nRemove the PBS and transfer the bones into a fresh 50 mL centrifuge tube filled with sterile PBS. The prepared demineralized and decellularized bones are called bone extracellular matrix (BEM) and can be stored at 4 °C for 2 months until required.\n3. Cell seeding and culture\nTake out the BEM from 4 °C refrigerator and immerse it in 75% ethanol for 30 s, then rinse with PBS twice. Transfer the BEM onto a clean 6-well cell culture plate. Add 2 mL complete culture medium (Dulbecco’s modified Eagle’s medium/F12 (DF12) containing 5% fetal bovine serum, 90 μg/mL ampicillin and 90 μg/mL kanamycin). Incubate the BEM overnight in a CO2 incubator at 37 °C.\nObtain human OS cell lines (MNNG/HOS and MG-63). Suspend approximately 1.0 x 105 OS cells with 100 μL PBS containing phenol red as indicator.\n\tNOTE: To better track and observe multi-layer cells within the three-dimensional BEM model, MNNG/HOS and MG-63 are infected with lentiviral vector expressing fluorescent mCherry and green fluorescent protein (GFP).\nAfter the BEM is fully soaked in the medium, inject OS cells into BEM from proximal or distal epiphysis when the needle reaches the medullary cavity of BEM. Incubate the OS-BEM model for a minimum of 2 h in a humidified 5% CO2 atmosphere at 37 °C to ensure the injected cells firmly adhere to BEM.\n\tNOTE: Pre-warm all the media used for cell culture. The incubator used for cell culture has a humidified 5% CO2 atmosphere at 37 °C.",
    "Add 1 mL complete culture medium into the plate to completely coat the surface of the BEM culture overnight in a CO2 incubator at 37 °C.\nGently transfer the OS-BEM model into a new well of 6-well plate with a sterile tweezer and refeed 1 mL fresh culture medium. Culture the model for 14 days in a CO2 incubator at 37 °C and refresh the culture medium according to the proliferation situation of OS cells.\nKeep monitoring medium color and cell status under the inverted fluorescence microscope during the culture process. When OS cells expand to plate, gently transfer the OS-BEM model to another new well with sterile tweezer.\n\tNOTE: The culture medium is bright red at pH 7.4, which is the optimum pH value for most mammalian cell culture. If the medium turns into orange or even yellow, immediately refresh the medium to maintain a healthy environment for OS cells.\nTransfer the OS-BEM model into a new well with tweezers and gently rinse with PBS to remove the culture medium. Then, transfer into a 15 mL centrifuge tube and fix with 10% buffered formalin for histological identification.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}