{
  "id": 2632,
  "origin_website": "Cell",
  "title": "Protocol for evaluating antitumor activity of KIR3DL3 blockade in an NK cell-based xenogeneic lung tumor model",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nEnriching NK cells from PBMCs\nTiming: 12–16 h for recovering frozen PBMCs, 1.5 h for NK cell enrichment\nThis section describes how to enrich NK cells from frozen PBMCs. We use a MicroBead-based human NK cell isolation kit generally following the recommendations of Miltenyi Biotec with some modifications.\nThaw frozen PBMCs.\nThaw PBMCs quickly with gentle agitation by hand in 37°C water bath.\nDilute thawed cells to 10 mL with PBMC media in a 15 mL conical tube.\nCentrifuge at 500 × g for 5 min at 20°C–22°C. Aspirate supernatant.\nResuspend cells with fresh PBMC media and transfer to a T-75 flask at a cell density of 5–10 × 106 cells/mL.\nMaintain cells in humidified incubator at 37°C and 5% CO2 for 12–16 h.\nCritical: We have found that 12–16 h incubation of PBMCs can resolve cell clumps formed during thawing, which may improve the number of recovered cells.\nCollect PBMCs.\nRun cells through a 40 μm cell strainer into a 50 mL conical tube.\nCount cells, centrifuge for 5 min at 500 × g, 4°C.\nWash cells once with MACS buffer, spin cells down for 5 min at 500 × g, 4°C.\nCritical: Before NK cell enrichment, reserve 1/10 autologous PBMCs as feeder cells for subsequent KIR3DL3+ NK cell expansion. These cells can be maintained in PBMC media before use.\nEnrich NK cells with MicroBead-based human NK cell isolation kit.\nResuspend cell pellet in 40 μL MACS buffer per 107 cells.\nAdd 5 μL NK cell Biotin-Antibody Cocktail per 107 cells.\nMix well and incubate for 10 min at 4°C.\nAdd an additional 30 μL MACS buffer per 107 cells.\nAdd 10 μL NK cell MicroBead Cocktail per 107 cells.\nMix well and incubate for 20 min at 4°C.",
    "Place a LS column onto QuadroMACS™ Separator attached to MACS MultiStand, rinse column with 3 mL MACS buffer.\nApply cells onto the column.\nCollect flow-through containing NK cells in a 15 mL conical tube.\nWash column twice with 3 mL buffer and collect in the same tube.\nCount cells, spin cells down for 5 min at 500 × g.\nResuspend at 5 × 106 cells/mL in MACS buffer.\nNote: We have found that a comparable NK cell purity can be achieved when using half of the recommended amount of reagents and extending the incubation time. If desired, assess NK cell purity by flow cytometry staining with CD3 and CD56 antibodies. The purity should be >95%.\nNote: If the total amount of PBMCs exceeds 1 × 108, use one LS column per 1 × 108 PBMCs.\nPause point: Enriched NK cells can be used immediately to proceed to subsequent KIR3DL3+ cell sorting, or maintained in PBMC media at 3–5 × 106 cells/mL in the incubator for 1 d.\nSorting and expanding KIR3DL3+ NK cells\nTiming: 3.5 h for sorting, 2–3 week for cell expansion\nIn this section, we describe how to sort KIR3DL3+ NK cells from enriched NK cells and expand cells for in vivo establishing a human NK cell-based mouse model. This method is adapted from previous research (Granzin et al., 2017[href=https://www.wicell.org#bib3]; Lim et al., 2013[href=https://www.wicell.org#bib7]; Siegler et al., 2010[href=https://www.wicell.org#bib8]; Zhuang and Long, 2019[href=https://www.wicell.org#bib11]) and developed by us (Wei et al., 2021[href=https://www.wicell.org#bib9]). After cell sorting, KIR3DL3+ NK cells are co-cultured with irradiated feeder cells (autologous PBMCs) for 5–6 days. Feeder cells are irradiated to impede their growth in culture. Afterward, cells are expanded without feeder cells for additional 1–2 weeks to obtain desired amount of cells.\nResuspend cells at 5 × 106 cells/mL in MACS buffer.",
    "Block NK cells in a 15 mL conical tube with human FcR blocking reagent diluted 1:10 in MACS buffer for 10–15 min at 20°C–22°C.\nWithout washing, add PE anti-KIR3DL3 mAb 26E10 (1:300) and APC anti-human CD3 (1:300), stain cells for 30–40 min at 4°C.\nNote: Prepare corresponding fluorophore-conjugated isotype controls to determine the accurate cell population for sorting.\nWash cells twice with MACS buffer.\n1st wash – Add 10 mL buffer to stained cells, spin down at 500 × g for 5 min at 20°C–22°C, aspirate supernatant.\n2nd wash – Resuspend cell pellet in 10 mL FACS buffer, spin down at 500 × g for 5 min at 20°C–22°C, aspirate supernatant.\nResuspend at 5 × 106 cells/mL in FACS buffer and transfer to a 5 mL tube with cell strainer cap.\nCollect CD3- KIR3DL3+ cells based on the gating strategy (Figure 1[href=https://www.wicell.org#fig1]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2128-Fig1.jpg\nFigure 1. Sorting and expansion of KIR3DL3+ NK cells\n(A) Gating strategy for sorting KIR3DL3+ NK cells. Doublets and dead cells were excluded from MicroBead-enriched NK cells based on FSC-W/FSC-A and DAPI staining. KIR3DL3+ NK cells were sorted from CD3- cell population.\n(B) Expansion of KIR3DL3+ NK cells. Growth of KIR3DL3+ NK cells from two donors was expressed as fold increase of input KIR3DL3+ NK cell number at different timepoints (mean ± SD).\nWe use the BD FACSAria for cell sorting.\nPrepare feeder cells.\nCollect reserved feeder cells (autologous PBMCs) from step 2 in a 15 mL conical tube.\nIrradiate feeder cells (30 Gy) with Cesium-137 radioactive source.\nWash irradiated feeder cells with PBMC media once.\nNote: The timing required for irradiation should be calculated specifically based on the properties of the irradiator available. In this case, cells were irradiated for 3 min 7 s using the Shepherd Mark I irradiator with a Cs137 radiation source.",
    "Expand KIR3DL3+ NK cells.\nMix sorted CD3- KIR3DL3+ cells with irradiated feeder cells at a ratio of 1:10–20 (NK:feeder cells).\nSpin cell mixture down at 500 × g for 5 min at 20°C–22°C, aspirate supernatant.\nResuspend at 2–3 × 106 cells/mL in NK cell feeding media and culture in the incubator.\nAfter 5–6 days, transfer cells to a larger flask and culture in NK cell expansion media without feeder cells for additional 1–2 week.\nCheck cell number and viability twice a week.\nNote: Replenish fresh NK cell expansion media every 1–2 d to maintain cells at a density of 2–3 × 106 cells/mL during reminder of expansion. The number of NK cells is expected to be doubled every 2–3 d starting from day 6. The cell viability should be > 95%.\nPause point: Alternatively, the expanded KIR3DL3+ NK cells can be frozen and stored in liquid nitrogen on days 10–14 after sorting. Typically, we store 10–30 × 106 cells per mL of freezing media.\nValidating KIR3DL3 expression following NK cell expansion\nTiming: 2 h\nThis section will describe the examination of KIR3DL3 expression on expanded NK cells by flow cytometry on day 10 after sorting.\nCollect NK cells and place 0.1–0.5 × 106 cells per well in a 96-well round bottom plate.\nWash cells once with 200 μL of FACS buffer.\nSpin cells down at 650 × g for 2 min at 4°C.\nResuspend cells with 50 μL of human FcR blocking reagent diluted 1:10 in FACS buffer, incubate for 10 min at 20°C–22°C.\nWithout washing, add PE anti-KIR3DL3 mAb 26E10 (1:300), FITC anti-human CD56 (1:200) and APC anti-human CD3 (1:300).\nNote: Prepare corresponding fluorophore-conjugated isotype controls to determine the cell population when analyzing by flow cytometry.\nIncubate for 30–40 min at 4°C.",
    "Wash twice with 200 μL of FACS buffer.\nResuspend cells in 200–300 μL of FACS buffer supplemented with DAPI (1:1,000).\nProceed to flow cytometry.\nWe use BD LSRII for flow cytometry.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2128-Fig2.jpg\nFigure 2. Validation of KIR3DL3 expression on expanded NK cells\nExpanded NK cells were co-stained with PE anti-KIR3DL3 (26E10), FITC anti-human CD56, and APC anti-human CD3 antibodies on day 10 after sorting. Gate settings were determined using isotype controls.\nNote: A representative example of the analysis is shown in Figure 2[href=https://www.wicell.org#fig2].\nFunctional characterization of anti-KIR3DL3 blocking mAb in vitro\nTiming: 7–8 h\nThis section describes the evaluation of the effect of KIR3DL3 blockade on NK cell function by a flow-cytometry based NK cytotoxicity assay (Kim et al., 2007[href=https://www.wicell.org#bib6]; Wei et al., 2021[href=https://www.wicell.org#bib9]). Basically, target cells are prelabeled with PKH26 red fluorescent cell membrane dye to differentiate from effector NK cells. By gating on PKH26+ target cells and using a live/dead stain 7-AAD, the specific lysis of the target cells is quantified. This methodology is translatable to multiple target cell types. Here we describe the assay using HCC827 cells.\nPre-incubate NK cells with isotype control mIgG1 or anti-KIR3DL3 mAb 26E10.\nHarvest 2 × 106 expanded KIR3DL3+ NK cells into a 15 mL conical tube, centrifuge cells for 5 min at 500 × g at 20°C–22°C, discard supernatant.\nResuspend cells in HCC827 media at 1 × 106 cells/mL. Divide cells into 3 parts and add 10 μg/mL of mIgG1 or 26E10, or equal volume of PBS to each part.\nIncubate for 45 min at 20°C–22°C.\nMove forward without washing cells.\nLabel HCC827 cells with PKH26 dye.\nHarvest HCC827 cells.\nWash cells with PBS once, centrifuge cells for 5 min at 500 × g at 20°C–22°C, discard supernatant.",
    "Resuspend cells in Diluent C buffer (in PKH26 Red Fluorescent Cell Linker Kit) at a concentration of 5–10 × 106 cells/mL.\nAdd an equal volume of PKH26 working solution to HCC827 cell suspension and incubate for 2 min at 20°C–22°C.\nAdd 10 × volume of HCC827 media and incubate 3–5 min at 20°C–22°C.\nWash cells with 5 mL of HCC827 media three times, centrifuge for 5 min at 500 × g, 20°C–22°C.\nResuspend cells with HCC827 media at a cell density of 1 × 105 cells/mL.\nProtect labeled cells from light.\nAlternatives: Other lipophilic membrane dyes such as PKH67 green fluorescent dye (Sigma-Aldrich) can be used in place of PKH26.\nCritical: To increase the cell viability before cytotoxicity assay, cells should be passaged the day prior to experimental setup.\nCo-culture PKH26-labeled HCC827 cells with NK cells (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2128-Fig3.jpg\nFigure 3. Coculture of KIR3DL3+ NK cells with HCC827 cells in 96-well plate\nEffector KIR3DL3+ NK cells pre-incubated with PBS, mIgG1, or 26E10 were seeded at 50,000, 100,000, 200,000 cells per well, followed by addition of 10,000 PKH26-labeled HCC827 target cells. Cells are mixed with gentle pipetting and cocultured for 4 h at 37°C. Duplicate for each condition.\nSeed prepared cells at indicated effector:target (E:T) ratios into a 96-well round bottom plate in duplicate (Table 1[href=https://www.wicell.org#tbl1]).\ntable:files/protocols_protocol_2128_11.csv\nMix cells by gently pipetting.\nCentrifuge plate for 2 min at 110 × g.\nIncubate plate in the incubator for 4–5 h.\nAnalyze by flow cytometry.\nCentrifuge plate for 2 min at 650 × g at 20°C–22°C after incubation.\nResuspend cells in 200 μL/well with FACS buffer supplemented with 7-AAD (1:150).\nProceed to flow cytometry.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2128-Fig4.jpg\nFigure 4. NK cell cytolytic activity upon KIR3DL3 blockade assessed by flow cytometry based-cytotoxicity assay in vitro",
    "(A) Gating strategy for the flow cytometry based-cytotoxicity assay. PKH26-prelabeled HCC827 target cells were gated from coculture for analyzing specific lysis based on 7-AAD staining.\n(B) Specific lysis of HCC827 target cells after coculture with KIR3DL3+ NK cells pre-incubated with PBS (gray), isotype control mIgG1 (black), or 26E10 (blue) at indicated E:T ratios.\nNote: The fluorescence of PKH26 and 7-AAD have an excitation/emission spectrum of 551/567nm and 546/647nm, respectively. Choose proper detection channels for PKH26 and 7-AAD according to the flow cytometer used. In the case of the BD LSR II cytometer, the fluorescence maxima of PKH26 and 7-AAD is detected in PE and PerCP/Cy5.5 channel, respectively.\nNote: A representative example of the analysis is shown in Figure 4[href=https://www.wicell.org#fig4].\nEvaluating therapeutic effect of KIR3DL3 blockade in NK cell-reconstituted NSG mouse models of human lung cancer\nTiming: 3–4 weeks\nThis method adapted from previous studies (Dong et al., 2019[href=https://www.wicell.org#bib2]; Kamiya et al., 2019[href=https://www.wicell.org#bib5]) determines in vivo anti-tumor activity of KIR3DL3 blockade with mAb 26E10 in a challenging intravenously (i.v.) xenograft model of human lung cancer, established using HCC827 tumor cells (Figure 5[href=https://www.wicell.org#fig5]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2128-Fig5.jpg\nFigure 5. Workflow of in vivo testing therapeutic efficacy of KIR3DL3 blockade in vivo\nNote: 6–10 weeks old NSG mice are used for the experiment. Group size should be determined prior to the experiment. In general, equal numbers of male and female mice should be used.\nCritical: Prepare and expand KIR3DL3+ NK cells ahead to ensure there are enough cells for treatment. Determine the timings to obtain required number of NK cells according to NK expansion data (Figure 1[href=https://www.wicell.org#fig1]B) from previous experiments in step 10. In general, at least 500 × 106 cells can be generated from 1 × 106 KIR3DL3+ NK cells over two weeks.\nDay 0.\nEstablish HCC827-Luc2 human lung tumor xenograft in NSG mice.",
    "Trypsinize and harvest HCC827-Luc2 cells at approximately 80%–90% confluency into 50 mL conical tubes.\nCentrifuge cells for 5 min at 500 × g, 4°C.\nWash cells 3 times with sterile PBS, centrifuge cells for 5 min at 500 × g, 4°C.\nResuspend cells in PBS at a cell density of 2.5 × 106/mL. Prepare an excess of 20% of cells. Keep cells on ice until inoculation.\nMix the cell suspension and inject i.v. 200 μL of cells (5 × 105 cells) into the tail vein of each mouse using 1 mL syringe with 30-gauge needle.\nNote: To ensure enough cells prior to the inoculation, tumor cells should be expanded one week ahead. It is recommended to use tumor cells that have been passaged less than 20 times.\nCritical: Filter resuspended cells through a 40 μm cell strainer before counting cells to ensure single cell suspension. Mix the cell suspension before each injection.\nDay 4.\nPerform bioluminescence imaging (BLI) of mice.\nPlace mice into an anesthetic induction chamber (isoflurane 2.0%, with flow rate 2 L/min) until fully anesthetized.\nInject mice i.p. with 150 mg/kg D-luciferin.\nThree minutes after the D-luciferin injection, image the mice with an IVIS Spectrum Imaging platform (Perkin Elmer) every 3 min for a total of 15 min with Living Image software, using the serial imaging setting and auto-exposure function.\nDetermine total flux (p/s) by creating a region of interest (ROI) over the lungs of each mouse.\nAfter imaging, return the mice to their cages and monitor until fully recovery from anesthesia.\nAllocate mice to 26E10 and mIgG1 treatment groups with similar average tumor burden.\nDay 5–9.\nTreat tumor-bearing mice with KIR3DL3+ NK cells and mIgG1 or 26E10.\nCollect KIR3DL3+ NK cells into 50 mL conical tubes, centrifuge cells for 5 min at 500 × g, 4°C.",
    "Wash cells 3 times with sterile PBS, centrifuge cells for 5 min at 500 × g, 4°C.\nResuspend cells in PBS at a cell density of 7–8 × 107/mL. Prepare an excess of 20% of cells. Keep cells on ice until inoculation.\nPrepare mixture of antibody and cytokine for in vivo treatment (see materials and equipment[href=https://www.wicell.org#materials-and-equipment]).\nAdd equal volume of mixture of antibody and cytokine (1 μg rhIL-2, 1 μg rhIL-15, and 200 μg 26E10 or mIgG1 per mouse) to cell suspension (7–8 × 106 cells/mouse), mix well and inject i.v. 200 μL into the tail vein of each mouse using 1 mL syringe with 30-gauge needle.\nRepeat treatment on day 7 and day 9.\nDay 10–24.\nTo monitor tumor status, bi-weekly bioluminescence imaging is performed for the duration of the study.\nCritical: Prior to starting in vivo experiments, it’s highly recommended to determine the D-luciferin kinetic curve for the tumor models of interest by following PerkinElmer protocols (https://resources.perkinelmer.com/labsolutions/resources/docs/SOP_Determine_Luciferin_Kinetic_Curve.pdf, accessed January 2nd, 2022[href=https://resources.perkinelmer.com/lab-solutions/resources/docs/SOP_Determine_Luciferin_Kinetic_Curve.pdf]). Optimal timings between D-luciferin injection and imaging should be determined before starting. Three min after D-luciferin injection, we perform serial imaging every 3 min for a total of 15 min."
  ],
  "subjectAreas": [
    "Immunology",
    "Health Sciences",
    "Cell Isolation",
    "Cancer",
    "Cell Biology",
    "Cell-Based Assays"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}