{
  "id": 11823,
  "origin_website": "Jove",
  "title": "Generating and Imaging Mouse and Human Epithelial Organoids from Normal and Tumor Mammary Tissue Without Passaging",
  "procedures": [
    "All mouse tissue utilized in this manuscript has been ethically collected in accordance with the Institutional Animal Care and Use Committee (IACUC) regulations and guidelines of the University of Texas Southwestern Medical Center. Likewise, all the patients consented prior to tissue donation under the oversight of an Institutional Review Board (IRB), and the samples were deidentified.\nNOTE: This protocol describes the generation of organoids from primary tissue.\n1. Overnight preparation of materials\nFor embedding in basement extracellular matrix (BECM), thaw the BECM aliquot by leaving it at 4 °C.\n2. Preparing collagenase and bovine serum albumin (BSA) coating solution\nPrepare 2.64% BSA/PBS coating solution (BSA Solution): Sterile filter 50 mL of phosphate-buffered saline (PBS) and 4.10 mL of 30% BSA solution using a 50 mL/0.2 µm filter flask. This BSA solution can be filtered and used again.\nPrepare collagenase solution for mouse mammary tissue: Sterile filter 27 mL of basal cell medium, 1.5 mL of fetal bovine serum (FBS), 30 µL of 50 mg/mL gentamicin, 15 µL of 10 mg/mL insulin, 600 µL of 0.1 g/mL collagenase A, and 600 µL of 0.1 g/mL trypsin using a 50 mL/0.2 µm filter flask. Allocate between 10 mL and 30 mL of collagenase solution per mouse, depending on tissue mass.\nPrepare collagenase solution for human breast tissue: Sterile filter 18 mL of RPMI-1640, 200 µL of 100x penicillin-streptomycin solution (pen/strep), 200 µL of 10 mM 4-(2-hydroxyethyl)-1-piperazineethanesulfonic acid (HEPES) Buffer, 1 mL of FBS, and 400 µL of 0.1 g/mL Collagenase A using a 50 mL/0.2 µm filter flask. Allocate between 10 mL and 20 mL per tissue sample, depending on the tissue mass.\n3. Preparing media",
    "Prepare organoid media: Sterile filter basal cell medium with 1% pen/strep, and 1% Insulin-Transferrin-Selenium (ITS) using a 50 mL/0.2 µm filter flask. To make organoid growth factor media, add basic fibroblast growth factor (bFGF) to a final concentration of 2.5 nM.\nPrepare mammary epithelial media: To make 100 mL of mammary epithelial media, sterile filter high-glucose common basal medium with 1 mL of 100x glutamine supplement, 1 mL of pen/strep, 1 mL of 10 mM HEPES buffer (7.3 pH), 250 µL of 30% BSA stock, 1 µL of 1 mg/mL cholera toxin stock, 1 mL of 50 µg/mL hydrocortisone stock in PBS, 50 µL of 10 mg/mL human insulin solution, 10 µL of 50 µg/mL epidermal growth factor (EGF) stock, and 1% FBS using a 150 mL/0.2 µm filter flask. Store the media at 4 °C and use for up to 2 weeks.\nPrepare amphotericin wash: Sterile filter PBS with 2% pen/strep and 2% amphotericin B. Store at 4 °C.\n4. Collecting and digesting tissue\nMouse mammary tissue\n\t\nEuthanize the mouse by placing in a CO2 chamber for 2-5 min, and then follow with cervical dislocation. With the ventral side facing upward, splay mouse limbs and use four 19 G needles to pin the mouse by the paws to a board covered with an absorbent pad. Spray with 70% ethanol to smooth the fur down and sanitize the skin. Wipe away feces with a gauze pad or tissue.\nStarting just above the anogenital region, cut upward from the midline using surgical scissors, taking care not to pierce through the peritoneum. Upon reaching the chin, make lateral cuts down both clavicles and down hind legs, and pin the skin of the mouse taut to the board to expose mammary fat pads.",
    "Locate the inguinal mammary fat pads on wild-type mice by identifying the inguinal lymph node located near the hindlimbs. Locate the thoracic mammary fat pads on wild-type mice as the thicker, vascularized tissue beneath the front limbs.\nUse forceps to elevate the mammary fat pad. Avoid collecting underlying muscle. Using the blunt end of sharp-blunt scissors, create a pocket underneath the mammary fat pad, away from the skin. Cut away the mammary fat pad in one complete piece.\nOnce mammary fat pads have been removed, rinse in PBS before placing them in a sterile tissue culture dish. Quickly transfer to a tissue culture hood.\n\t\tNOTE: For mammary tumors, use a cotton swab wetted with PBS to gently roll the tumor away from the skin. Be certain to avoid darkened or soft areas, as dark discoloration indicates necrosis, which will not yield healthy organoids.\nMince the mammary tumors with a #10 or #11 scalpel to loosen tissue until it reaches a paste-like consistency. Transfer the minced tissue into a conical tube containing 10-30 mL of collagenase solution using a scalpel. To ensure all tissue is collected, pipette 1 mL of collagenase solution onto the tissue culture plate and back into the conical tube.",
    "NOTE: To produce larger organoids, mechanical digestion should be minimized, leaving some small visible pieces of tissue intact. Alternatively, tissue can be stored frozen for later organoid preparation with minimal loss in viability. To do so, wash tissue in a solution of PBS or basal cell media + 1% FBS, and then coarsely mince to increase surface area (keeping the tissue in one or two solid pieces). Move the tissue to a cryo-vial, top with freezing media (90% FBS + 10% dimethyl sulfoxide (DMSO)). Freeze the vials in a controlled-rate freezing container overnight before moving to storage in liquid nitrogen.\nPlace the conical tube into a 37 °C benchtop shaking incubator at 180 RPM until the tissue becomes stringy and the collagenase solution becomes cloudy. For example, a large tissue mass (around 500-800 mg) from a tumor takes 30-60 min. A smaller tissue mass (around 100-300 mg) from wild-type mammary fat pads takes about 20-30 min. If uncertain, check at 5 min intervals.\nAfter incubation, centrifuge the conical tube for 10 min at 550 x g at room temperature (RT).\nCarefully aspirate the supernatant from the conical tube.\n\t\tNOTE: Moving forward, pre-coat all pipette tips, serological pipets, and conical tubes with BSA solution to avoid loss of organoids due to adhesion to plastic.\nAdd 8 mL of basal cell media and 80 µL of DNase solution [2 U/µL] to the tube. Invert gently for 1-3 min.\nAdd 12 mL of basal cell media to the tube and carefully mix by pipetting or gently rotate the tube 15 times to mix.\nCentrifuge for 10 min at 550 x g at RT.\nAspirate the supernatant, and then resuspend the pellet in 12 mL of basal cell media.",
    "Let the heaviest tissue fragments settle to the bottom. Collect the supernatant with a serological pipet and transfer to a 15 mL conical tube. This suspension contains epithelial organoids and stromal/immune cells.\nHuman breast tissue\n\t\nProcess the human breast tissue samples for organoids or store them within 24 h of collection. Store the samples at 4 °C in CO2-Independent media with 1% 100x antibiotic-antimycotic.\nTransfer the tissue into a tissue culture plate. Tilt the plate and aspirate the excess storage media, and then rinse the tissue with 5 mL of the amphotericin B wash. Remove the amphotericin B wash immediately.\nMince the tissue sample with a #10 or #11 scalpel to loosen the tissue until it reaches a paste-like consistency. Transfer the minced tissue into a conical tube containing 10-30 mL of collagenase solution using a scalpel. To ensure all tissue is collected, pipette 1 mL of collagenase solution onto the tissue culture plate and return to the conical tube.\n\t\tNOTE: To produce larger organoids, mechanical digestion should be minimized, leaving some small visible pieces of tissue intact. Starting tissue mass for this protocol ranged between 100-250 mg. Alternatively, tissue can be stored frozen for later organoid preparation with minimal loss in viability after step 4.2.2 in 90% FBS + 10% DMSO as above.\nPlace the conical tube into a 37 °C benchtop shaking incubator at 180 RPM until the tissue becomes smaller and collagenase becomes cloudy. Check the tissue at 5 min intervals. Collagenase dissociation of human samples takes roughly 5-20 min.\nAfter incubation, spin down the conical tube for 10 min at 550 x g at RT.\nCarefully aspirate the supernatant from the conical tube.",
    "NOTE: Moving forward, pre-coat all the pipette tips, serological pipets, and conical tubes with BSA solution to avoid loss of organoids due to adhesion to plastic.\nAdd 4 mL of basal cell media and 40 µL of DNase solution [2 U/µL] to the conical tube. Invert gently for 3 min.\nAdd 6 mL of basal cell media to the tube and carefully mix by pipetting or gently rotate the conical tube 15 times to mix.\nCentrifuge for 10 min at 550 x g at RT.\nAspirate the supernatant, and then resuspend the pellet in 10 mL of basal cell media.\nLet the heaviest tissue fragments settle to the bottom. Collect the supernatant and transfer it to a 15 mL conical tube. This suspension contains epithelial organoids and stromal/immune cells.\n5. Differential centrifugation\nPulse to 550 x g for 3-4 s at RT, aspirate the supernatant, and resuspend the pellet in 10 mL of basal cell media. Repeat this step three more times (a total of four spins).\nAfter each centrifugation, ensure that the pellet becomes increasingly opaque. This remaining pellet will be epithelial organoids.\n6. Collecting small organoids\nPulse to 80-100 x g for 3 s at RT. Collect the supernatant into a fresh BSA-coated tube, and then pulse to 550 x g for 3 s at RT to pellet the small organoids.\n7. Embedding organoids in BECM\nAliquot appropriate suspension of organoids into microcentrifuge tubes according to the organoid density relative to the amount of BECM per well (Table 1). For example, use 50-100 organoids for 20 µL of BECM in one well of a 96-well plate.\n\tNOTE: Organoid density can be counted using the following formula: ((Average number of organoids)/50 µL) x dilution factor.",
    "Perform all the steps on ice. Place the thawed BECM on ice in a tissue culture hood. While preparing the hood, place all the pipette tips on ice to cool.\nCentrifuge the microcentrifuge tubes for 10 min at 300 x g at RT. Discard the supernatant from the tubes. Move the tubes with organoid pellets to ice and add the appropriate volume of BECM to each microcentrifuge tube (Table 1).\n\tNOTE: Since BECM is viscous, add in additional volumes (approximately 10%-20% extra of dome volume) of BECM to account for the loss in the pipet tip.\nGently pipette up and down to resuspend the organoids in BECM, taking care not to produce bubbles.\nSlowly and carefully pipette the BECM-suspended organoids onto the plating surface. While pipetting, slowly bring up the pipette to create a dome. Fill all the empty wells with PBS to maintain humidity.\nPlace the plate into a 37 °C incubator for 1 h to allow BECM to solidify, and then cover with the appropriate volume of media (Table 1).\n8. Embedding organoids in collagen\nPerform all the steps on ice. Prepare the collagen solution by combining, in sequential order, 375 µL of 10x DMEM, 100 µL of 1 N sodium hydroxide (NaOH), and 3 mL of rat tail collagen I solution in a 15 mL conical tube. Pipette mix, taking care not to make bubbles. Titrate the solution to a pH of 7.2-7.4 with small amounts (increments of 1-3 µL) of NaOH or 10x DMEM as needed.",
    "Coat the bottom of the wells with the minimum amount of collagen required to fully cover the bottom of the well. One approach is to place a small amount of collagen and rock the plate from side to side to coat. Allow the collagen underlays to set at 37 °C for 30 min-2 h.\nAliquot the appropriate suspension of organoids into microcentrifuge tubes according to the organoid density relative to the amount of collagen per well (Table 1). Place in a 37 °C incubator.\nStore the collagen solution at 4 °C and monitor polymerization by checking for fiber formation under a microscope every 10 min. Collagen will reach appropriate polymerization between 30 min-2 h.\n\tNOTE: Proper polymerization can be determined by the presence of fibers branching throughout the matrix. Proceed to step 8.5 immediately once a few fibers are observed in the field of view.\nCentrifuge the microcentrifuge tubes at 300 x g for 10 min at RT. Discard the supernatant from the tubes. Move the organoid pellets to ice and add the appropriate volume of collagen to each microcentrifuge tube (Table 1).\n\tNOTE: Since collagen is viscous, add in additional volumes (approximately 10%-20% extra of dome volume) of collagen to account for the loss in the pipet tip.\nGently pipette up and down to resuspend organoids in collagen, taking care not to produce bubbles.\nSlowly and carefully pipette the collagen-suspended organoids onto the plating surface. While pipetting, slowly bring up the pipette to create a dome. Fill all the empty wells with PBS to maintain humidity.\nPlace the plate into a 37 °C incubator for 1 h to allow collagen to solidify, and then cover with the appropriate volume of media (Table 1).",
    "NOTE : Organoids maintain viability in 3D matrix for up to 7 days. If imaging is being used for analysis, proceed to steps 9 and 10.\n9. Fixing embedded organoids\nUse a pipette to remove all media from the wells without making contact with ECM domes.\nFix with 4% paraformaldehyde (PFA)/PBS solution for 5 min.\nWash two to three times by applying PBS to wells after placing them on a slowly moving shaker. After washes, apply fresh PBS to the domes and store the plate at 4 °C.\n10. Immunofluorescent staining of embedded organoids\nPreparing solutions for immunofluorescent staining\n\t\nPermeabilization buffer: Prepare a PBS solution with 10% Triton X-100.\nBlocking buffer: Prepare a PBS solution with 10% FBS and 0.2% Triton X-100.\nAntibody dilution buffer: Prepare a PBS solution with 2% FBS and 0.2% Triton X-100.\nPermeabilization and blocking\n\t\nPipette enough permeabilization buffer to cover the ECM domes. Incubate for 1 h at RT on a slowly moving shaker.\nRemove the permeabilization buffer with a pipette and apply the same volume of blocking buffer for 3 h.\nPrimary antibody incubation\n\t\nRemove the blocking buffer with a pipette and apply the antibody dilution buffer containing the primary antibody at manufacturer-specified concentrations. Incubate the sample at 4 °C for 12-16 h on a slowly-moving shaker.\nRemove the primary antibody solution and wash the samples three times for 10 min with PBS at RT on a slowly moving shaker.\nSecondary antibody incubation and nuclear stain\n\t\nAspirate the remaining PBS wash and apply the antibody dilution buffer containing secondary antibody at manufacturer-specified concentrations. Additionally, add DAPI or Hoechst (to label nuclei) or phalloidin (to label actin) to the buffer at a 1:250 ratio. Incubate for 2-4 h at RT on a slowly-moving shaker.",
    "Remove the secondary antibody solution and wash samples three times for 10 min in PBS at RT on a shaker. Store the samples in PBS at 4 °C until imaging.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}