{
  "id": 8134,
  "origin_website": "Bio",
  "title": "DNase I Footprinting to Identify Protein Binding Sites",
  "procedures": [
    "Preparation of the labeled DNA fragmentLabel the 5' end of one of the oligonucleotides to be used to make the fragment to footprint. Choose the oligo so that the suspected binding site is not too far from the labeled end. Normally the footprint should be performed on both strands of the DNA, i.e. using two DNA fragments labeled at either end. Use a 0.5 ml tube suitable for PCR. 3 μl Oligo 1, 10 pmoles/μl 2 μl 10x PNK buffer (supplied by manufacturer of PNK)3 μl [γ- 32P] ATP (3,000 Ci/mmole)11 μl H2O1 μl (10 units) PNKIncubate 30 min 37 °C  N.B. Take suitable precautions for use of radioactivity. Perform in approved location.Precipitate the labeled oligo. Add80 μl 0.1 M Sodium acetate (natural pH about 9.0)1 μl 10 mM Sodium phosphate buffer, pH 7.4250 μl ethanol (96%)Incubate in dry ice for 30 min (or at -80 °C for > 1 h).Centrifuge 15 min 4 °C 12,000 x g.Carefully remove the supernatant. N.B. Very radioactive, Discard accordingly.Rinse the (tiny) pellet with 100 μl 96% ethanol (or 70% ethanol at -20 °C). Centrifuge 5 min 4 °C 12,000 x g. Carefully remove the supernatant. Dry in vacuo 5 min.Resuspend the labeled Oligo 1 in 35 μl H2O. Vortex well and give a quick centrifugation to place all labeled oligo in bottom of tube. Add 5 μl Thermopol buffer (Biolabs or other suitable Taq polymerase buffer).5 μl deoxyNTP mix containing 2.5 mM each dATP, dCTP, dGTP, DTTP.4 μl Oligo 2 10 pmoles/μl (Oligo 2 corresponds to the other end of fragment to be amplified).1 μl template DNA (e.g. plasmid DNA carrying the cloned region to be amplified, about 50 ng depending on size of plasmid. We usually use 1 μl 1/10 dilution of standard mini plasmid DNA preparation).",
    "Mix well, quick centrifugation and add 0.5 μl (2.5 units) Taq polymerase (5 units/μl) and immediately start PCR. PCR cyclingDenature 94 °C for 2 min94 °C for 30 sec55 °C* for 30 sec 72 °C for 30 sec* Repeat b-d 25 timesFinal extension 5 min 72 °C* The temperature of annealing depends upon the oligonucleotides used and the extension time at 72 °C on the length of the fragment amplified. Footprints on fragments greater than 500 bp are not recommended and so 30 sec is usually good for most fragments.Test 1-2 μl on small agarose gel (containing ethidium bromide or other suitable DNA detection reagent) for amplification of a fragment of the correct size and check you have a fragment of the correct size in good yield (i.e. most or all of the oligos have been used up) 30 pmoles of oligos can give maximally 2 μg of a fragment of 100 bp and 10 μg of a fragment 500 bp. Proceed to purification. In theory you can use the PCR as it is or after passage through a spin column. However any minor, shorter length contaminants will produce artifactual bands in the footprint and the presence of unincorporated radioactivity will not allow you to estimate the amount of radioactive DNA in the footprinting reactions. So we always proceed to purify the labeled DNA from an agarose gel. In exceptional cases e.g. to eliminate a close running contaminant band from a short (100-200 bp) fragment, the fragments can be purified on a native acrylamide gel (see step I-14 below). Run the PCR mixture, mixed with 10 μl of loading dyes, on a small 1% agarose gel in 50 mM TBE buffer. Usually the whole 50 μl PCR can be loaded in 3 wells.",
    "Visualize the gel on a long wavelength (365 nm) transilluminator (to minimize damage to the DNA by short wavelength) and cut out the agarose containing the radioactive fragment. Discard rest of gel as radioactive waste.Extract the DNA from agarose using a gel purification kit (e.g. Machery-Nagel Nucleo-spin Gel and PCR clean-up). Elute in 50 μl elution buffer.To purify the DNA from an acrylamide gel: Run the PCR mix on a native acrylamide gel (5-8% depending upon size in 50 mM TBE at room temperature i.e. do not allow the gel to heat up. Depending upon the size of the apparatus used 100-200 volts should be adequate). Locate the radioactive DNA by short exposure of the wet gel wrapped in Saran wrap to a phosphorimager screen (or X-ray film). The piece of acrylamide containing the radioactive band is cut out and the radioactive DNA eluted by shaking overnight at 37 °C in 1 ml of 0.5 M ammonium acetate, 0.1% SDS, 1 mM EDTA. Separate the aqueous phase from the acrylamide gel piece by centrifugation and transfer to another tube. Extract with 0.5 ml phenol/CHCl3 and precipitate the DNA with 2.5 volumes ethanol in dry ice for at least 30 min. Centrifuge 10 min 4 °C, remove all the supernatant, dry in vacuo 2-3 min) Resuspend in 50 μl elution buffer (as for DNA eluted from agarose.).Run 1 μl on a new small agarose gel and estimate the quantity by comparison to the staining intensity of marker DNAs (e.g. 100 bp ladder). Count 1 μl by Kerenkov radiation in a scintillation counter or estimate using a Geiger counter. Expect to have 50,000-150,000 cpm/μl with about 5-50 ng DNA/μl (yield in range 10-50% of the moles of starting oligonucleotide).",
    "You can calculate the molar concentration of the DNA fragment from the length of the fragment in bp and using 1 bp corresponds to a molecular mass of 660. The footprinting reactionAll protein and DNA dilutions are made in 1x binding buffer. Protein dilutions are made at 4 °C to minimize any instability of the protein in dilute solutions. Binding reactions can be made at RT or at 30 °C or 37 °C depending upon the experiment. E.g. Most prokaryotic transcription factors bind DNA at RT. E.coli RNA polymerase will only form open complexes at 37 °C. The binding buffer we usually use is Hepes-Glutamate. The concentration of K glutamate can be increased or decreased according to the experiment; generally higher salt favors specificity but decreases affinity. Mg++ salts (1-10 mM) can be added according to the experiment, e.g. Mg++ is required for RNA polymerase binding. The BSA is added to stabilize dilute proteins and prevent non-specific absorption to the microfuge tube. The reaction mix in general consists of 20 μl DNA solution to which we add 20 μl of the diluted protein (if several components need to be tested at the same time the volume for each component can be reduced accordingly to give a final volume of 40 μl).To test a range of protein concentrations for binding to the labeled DNA. Make a suitable volume of binding buffer and keep on ice. Prepare a series of dilution tubes for the protein to test over a range of concentrations. This range depends entirely on the protein under study as binding constants can vary from nM to nearly mM. E.g. for 10 serial dilution of 1/2 concentration each step, Prepare 10 tubes with 25 μl binding buffer on ice.Prepare a suitable volume of labeled DNA e.g.",
    "For 12 reactions prepare 240 μl binding buffer and add labeled DNA fragment to have about 20,000 -100,000 cpm/reaction. Mix well. Ideally this should give a final concentration of the DNA of about 1 nM in the 40 μl footprinting reaction, if binding constants of protein to DNA are in the nM range. Dispense 20 μl of the DNA mix into 12 1.5 ml microtubes at RT.Make the protein dilutions on ice and immediately mix the diluted protein with the DNA at RT. E.g. Dilute the protein to 1 μM in 50 μl binding buffer. Add 20 μl to one tube of DNA (to give final concentration of 500 nM). Mix by pipetting. Leave at RT until finished all mixes. Take 25 μl of the 1 μM dilution and mix with 25 μl binding buffer in next dilution tube. Add 20 μl of this dilution to the next DNA tube (final concentration 250 nM).Take 25 μl of the 0.5 μM dilution and mix with 25 μl binding buffer in next dilution tube. Continue for the whole series of 10 dilutions.Add 20 μl 1x binding buffer to two DNA samples for the (essential) controls without protein. Incubate for 10 min at RT (or at chosen temperature for chosen time).Meanwhile prepare a suitable dilution of DNase I in DNase I dilution buffer. It is crucial to find the correct DNase I concentration to get limited DNase attack so that not all the DNA is degraded. As there should in theory be no more than 1 break/DNA strand, the majority (80-90%) of the DNA should be full length.",
    "It is usually necessary to make a pilot experiment with each new stock of DNase I to test a series of dilutions of DNase I with a DNA fragment (in the absence of binding proteins) to find the concentration which gives an adequate ladder but leaves full length DNA at the top of the gel. The amount of DNase I used should be lower for longer DNA fragments. The amount given below is a guideline only.DNase I stock of 5 mg/ml in DNase I storage buffer (store in aliquots at -20 °C).Dilute about 10,000 fold (e.g. 2 μl to 200 μl, in DNase I dilution buffer, then take 2 μl of the first dilution to 200 μl DNase I dilution buffer) to give 0.5 μg/ml. To make the footprint reactions:T= 0 add 4 μl dilute DNase I to the footprint mix 1. Mix gently by pipetting. T= 15 sec Add 4 μl dilute DNase I to the footprint mix 2. Mix gently by pipetting.T= 30 sec Add 4 μl dilute DNase I to the footprint mix 3. Mix gently by pipetting.T= 45 sec Add 4 μl dilute DNase I to the footprint mix 4. Mix gently by pipetting.T= 60 sec Add 100 μl phenol pH 8.0 to the footprint mix 1. Vortex to stop reactionT= 75 sec Add 100 μl phenol pH 8.0 to the footprint mix 2. Vortex to stop reaction.T= 90 sec Add 100 μl phenol pH 8.0 to the footprint mix 3. Vortex to stop reaction.T= 105 sec Add 100 μl phenol pH 8.0 to the footprint mix 4. Vortex to stop reaction.Repeat until all the tubes have been treated.Precise timings are crucial to get precise and comparable DNase I digestions in each lane (some researchers prefer to use longer times and more dilute DNase I).",
    "Add 200 μl DNase I STOP solution to each reaction. Vortex well.Centrifuge 10 min RT.Transfer the aqueous upper phase (careful not to take any phenol) to a clean 1.5 ml microfuge tube.Add 600 μl 96% ethanol. Mix well and incubate in dry ice for 1 h (or overnight at -80 °C).Centrifuge 15 min, 4 °C, 12,000 x g. Remove the supernatant carefully with a pipette and 1 ml pipette tip. Depending upon the number of cpm used per reaction and the sensitivity of the available Geiger counter, verify that some radioactivity is in the (invisible) pellet with a Geiger counter. If the herring sperm DNA, used in the DNase I STOP to aid precipitation, has not been sufficiently sonicated or too much has been used, the DNA pellet might not adhere to the microfuge tube and can be lost with the ethanol. Centrifuge again, 5 min 4 °C. Remove the rest of the liquid with a 20 μl pipette tip. Verify that the radioactivity is still in the tube.Dry in vacuo 5 min.Resuspend in 5 μl H2O and add 6 μl gel loading formamide dyes (deionized formamide with Bromophenol blue and Xylene cyanol). Vortex well. Quick centrifuge to put all liquid in bottom of tube.Heat to 90 °C for 2 min. Quench in ice and immediately load (5 μl) onto a denaturing (7 M urea) acrylamide sequencing gel, acrylamide (19:1 acrylamide: bis-acrylamide), which has been prerun for 30 min to 1 h to get hot. Voltage and wattage depends upon the apparatus used. We use 60 watts for the Model S2. Use with 5-10% final concentration acrylamide depending on the size of the fragment under investigation.To locate the site of protein binding it is necessary to calibrate gels with molecular weight markers. E.g.",
    "DNA marker pBR322 digested with MspI, treated with alkaline phosphatase (e.g. Antarctic alkaline phosphatase) and labeled with [γ-32P] ATP and PNK or a sequencing ladder prepared using the same Oligo 1, which was used for the radioactive labeling of the fragment.Electrophorese at 60 watts for a 30 x 30 plates and 1 mM thick gels using the Model S2 apparatus. Adjust volts and power for other sized gels. Time of migration depends upon the size of the fragment and expected position of protein binding sites (generally 80 min to 3 h). After migration, allow to cool slightly, open plates, transfer the gel to Whatman 3 mm paper. Cover with Saran wrap and dry on a gel drying apparatus.Put the dried gel, still covered with Saran to expose in a Phosphorimager cassette overnight (alternatively expose to X-ray film with an intensifying screen).The pattern of DNase I cleavages with and without protein indicates the site of protein binding (Figure 1). Deformations such as bent or looped DNA are indicated by hypersensitive cleavages compared to the control (free DNA), since bending of the DNA has facilitated attack by DNase I in the wider minor groove formed on the outside of the loop or bend (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20130712/20130712041800_8890.pngFigure 1. Principle of DNase I footprinting imgsrc:https://en-cdn.bio-protocol.org/attached/image/20130712/20130712042048_8233.pngFigure 2. Example of DNase I footprintingUsing the Image Quant program, it is possible to quantify the amount of radioactivity in specific bands or regions, corresponding to protein protected sites and non-protected regions, and hence to derive binding constants for the proteins."
  ],
  "subjectAreas": [
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}