{
  "id": 8343,
  "origin_website": "Jove",
  "title": "Analysis of Translation in the Developing Mouse Brain using Polysome Profiling",
  "procedures": [
    "All animal use was supervised by the Animal Care Committee at the University of Calgary. CD1 mice used for the experiment were purchased from commercial vendor.\n1. Preparation of solutions\nNOTE To prevent RNA degradation, spray workbench and all equipment with RNase decontamination solution. RNase-free tips are used for the experiment. All solutions are prepared in RNase-free water.\nPrepare cycloheximide stock solution (100 mg/mL) in DMSO and store at -20 °C.\nPrepare 2.2 M sucrose stock solution by adding 75.3 g of sucrose to RNase-free water and topping up the volume to 100 mL (for ~16 gradient preparation). The solution can be kept at -20 °C for long-term storage.\nPrepare 10x salt solution (1 M NaCl; 200 mM Tris-HCl, pH 7.5; 50 mM MgCl2).\nPrepare 60% (w/v) sucrose chase solution, containing 30 g of sucrose, 5 mL of 10x salt solution and top the volume up to 50 mL with RNase-free water.\nOptionally, add a speck of bromophenol blue or approximately 5 µL of 1% bromophenol blue in RNase-free water to the chase solution. 1.6. Store solutions at 4 °C.\n2. Preparation of sucrose gradient\nNOTE: Accuracy in preparation of sucrose gradients is critical in obtaining consistent and reproducible results.\nTo prepare six 10-50% sucrose gradients, dilute 2.2 M sucrose solution as in Table 1.\ntable:\n﻿0,1,2,3,4,5\nSucrose solution,10%,20%,30%,40%,50%\n2.2 M sucrose,2 mL,4 mL,6 mL,8 mL,10 mL\n10X salt solution,1.5 mL,1.5 mL,1.5 mL,1.5 mL,1.5 mL\nCycloheximide,15 µL,15 µL,15 µL,15 µL,15 µL\nWater,11.5 mL,9.5 mL,7.5 mL,5.5 mL,3.5 mL\nTotal volume,15 mL,15 mL,15 mL,15 mL,15 mL\nTable 1: Sucrose dilutions for preparations of sucrose gradients.\nNOTE: Always prepare sucrose gradients in multiples of two to balance weight during ultracentrifugation.",
    "Wipe the metal blunt end needle with RNase decontamination solution. Briefly rinse the ultracentrifuge tubes, tubing and the syringe using RNase-free water. Air-dry the tubes such that no water drop remains in the tubes as any remaining water will alter the sucrose concentration.\nPlace the metal needle on the clamp holder and the centrifuge tube on the motorized stage. To prepare gradients consistently, a home-assembled system was used that contains a motorized stage to hold the ultracentrifuge tube and a syringe pump to inject sucrose solutions (Figure 1, see step 9 for details).\nFill a 30 mL syringe with ~16 mL of 10% sucrose (enough for six gradients), place it on the syringe pump and connect it to the needle. Make sure that there are no air bubbles in the syringe, tubing, and needle. Wipe the tip off the needle to remove any residual solution.\nMove the motorized stage up such that the tip of the needle touches the centre of the tube at the bottom.\nSet the syringe pump at a flow rate of 2 mL/min for a volume of 2.3 mL.\nAfter dispensing 2.3 mL of 10% sucrose solution, move down the motorized stage and repeat the process for all six gradients.\nRepeat steps 2.4-2.7 to add 20% sucrose solution to the bottom of the tubes, followed by 30%, 40% and 50% sucrose solutions similarly.\nAfter preparation of the gradient, seal the ultracentrifuge tube using a paraffin film.\nLeave the tubes overnight at 4 °C such that the different sucrose layers diffuse together to give a continuous gradient.\n3. Tissue dissection\nNOTE: Pregnant mice were euthanized by cervical dislocation preceded by anesthesia with 5% isoflurane.",
    "Collect CD1 mouse embryos at embryonic day 12, or other timepoints as needed, and place embryos in a Ø 10 cm plate containing ice-cold Hank's Balanced Salt Solution (HBSS) on ice to retain cell viability.\nUnder the dissection scope, transfer one embryo to a Ø 6 cm plate containing ice-cold HBSS.\nUse 21-23 G needles to fix the position of the head by penetrating through eyes at an approximately 45° angle and apply force to make sure the needles are fixed on the plate (Figure 2A).\nUse No.5 forceps to remove skin and skull, from the middle to the sides.\nUse forceps to cut the olfactory bulbs and remove the meninges to expose the cortical tissues.3.6.Use curved forceps to cut the cortical tissues into 2-3 mL of neurobasal medium on ice (Figure 2B). Pool cortical tissues from different embryos as needed. Tissues from 8-10 embryos usually give ~200 µg total RNA.\n4. Cell lysis\nOn the day of tissue dissection, prepare fresh cell lysis buffer as described in Table 2.\ntable:\n﻿0,1,2\nSolution,Final concentration,Volume\nTris-HCl (pH 7.5),20 mM,100 µL\nKCl,100 mM,250 µL\nMgCl2,5 mM,25 µL\nTriton X-100,1% (v/v),500 µL\nSodium deoxycholate,0.5% (w/v),500 µL\nDithiothreitol (DTT),1 mM,5 µL\nCycloheximide,100 µg/mL,5 µL\nRNase free water,,Top up to 5 mL\nTotal,5 mL,5 mL\nTable 2: Preparation of polysome lysis buffer.\nNOTE: Supplement lysis buffer with protease and phosphatase inhibitors.\nAdd cycloheximide to the neurobasal medium with dissected tissues to a final concentration of 100 µg/mL and incubate at 37 °C for 10 min. Cycloheximide blocks translation elongation and, therefore, prevents ribosome run-off 15.\nCentrifuge at 500 x g for 5 min at 4 °C and discard the supernatant.\nWash the tissues twice with ice-cold phosphate-buffered saline (PBS) supplemented with 100 µg/mL cycloheximide.",
    "Add 500 µL of cell lysis buffer supplemented with 4 µL of RNase inhibitor. Pipette up and down to resuspend the tissue in lysis buffer. Use an insulin needle to gently lyse the tissue.\nIncubate the tissues on ice for 10 min with brief vortexing every 2-3 min.\n\tNOTE: To prevent tissue degradation, ensure that all steps of tissue lysis are carried out on ice.\nCentrifuge at 2,000 x g for 5 min at 4 °C.\nTransfer the supernatant to a new centrifuge tube on ice.\nCentrifuge at ~13,000 x g for 5 min at 4 °C.\nTransfer the supernatant to a new centrifuge tube on ice.\nMeasure the RNA concentration in the tissue lysate using a UV-Vis spectrophotometer.\n\tNOTE: If multiple samples are included in the experiment, dilute samples to the same concentration with extra cell lysis buffer to minimize variation.\n5. Sample loading and ultracentrifugation\nPre-cool the ultracentrifugation rotor and swing buckets at 4 °C, and set the temperature of the ultracentrifuge to 4 °C.\nKeep 20 µL of the tissue lysate as total RNA input.\nLoad samples (50-300 µg RNA with an equal volume) on the top of the sucrose gradients by slowly dispensing the lysate to the walls of the ultracentrifuge tubes.\nGently place the ultracentrifuge tubes in the swing bucket. Ensure that all diametrically opposite buckets are balanced.\nLoad the swing buckets on the rotor. Set the ultracentrifuge to 190,000 x g (~39,000 rpm) at 4 °C for 90 min.\nGently place the gradients on ice after centrifugation.\n6. Fractionation and sample collection\nNOTE: A home-assembled fractionating, recording and collecting system is used for the analysis and collecting samples from the gradients (Figure 3, see Device components).",
    "Place an empty ultracentrifuge tube on the tube piercer and gently penetrate the tube with the needle from the bottom.\nSwitch on the UV monitor, and open the digital signal recording software.\nFill a 30 mL syringe with 25 mL of 60% sucrose chase solution. Gently press the syringe such that the chase solution fills up the empty tube and go through the 254 nm UV monitor to set the baseline for detection.\nPress auto-zero on the UV-monitor to register a baseline for detection. Press play on the software to begin recording.\nOnce the system establishes a baseline, pause recording on the software and retract the chase solution. Ensure that no residual chase solution remains in the system.\n\tNOTE: Rinse the system with RNase-free water to remove residual sucrose solutions remaining from the previous run.\nLoad one sample tube to the tube piercer. Gently penetrate the tube with the needle from the bottom.\nBegin recording on the software. Start the syringe pump (flow rate of 1 mL/min for a volume of 25 mL) and the fraction collector to collect polysome fractions. Set fractionator settings to 30 s.\n\tNOTE: Before each run, ensure no air bubbles in the syringe or the tubing by gently pressing the syringe to let the chase solution flow continuously through the needle.\nCollect the fractions into 1.5 mL tubes (500 µL each) using a fraction collector.\nThe fractions can be processed immediately or stored at -80 °C.\nAfter fraction collection, rinse the system with RNase-free water to remove any remnant sucrose.\n7. Extraction of RNA\nTo each fraction, add 10 ng of luciferase mRNA spike-in control.\nAdd three volumes of guanidium hydrocholride based commercial RNA isolation reagent to each fraction.\nVortex briefly for 15 s.",
    "Extract RNA using an RNA extraction kit compatible with the solution used in 7.2.\n8. Reverse transcription and real-time PCR\nMeasure the concentration of the RNA using UV-Vis spectrophotometer.\nSubject RNA to reverse transcription using a cDNA synthesis kit, according to manufacturer's protocol.\nUse quantitative real-time PCR (qPCR) to examine the polysomal distribution of gapdh mRNA as an example. qPCR was performed using a qPCR detection system and a qPCR mastermix reagent, with the following cycling conditions: 95 °C for 10 min, then 40 cycles of 95 °C for 15 s, 60 °C for 30 s, 72 °C for 40 s, followed by 95 °C for 60 s.\nObtain Threshold cycle (Ct) values from the amplification plots and used to calculate fold change using ΔΔCt method.\n9. Sucrose gradient making system assembly\nNOTE: Follow the steps to assemble each component (as described in Table 3) of the sucrose gradient maker (Figure 1).\nMount two vertical brackets (A2) on the base breadboard (A1).\nUse two slim right-angle brackets (B2) to mount the linear stage actuator to the base breadboard (A1).\nUse the setscrew on the Ø12.7 mm aluminum post (C2) to fix it on the tube holder base breadboard (C1) as a stand for the tube holder.\nAssemble the right-angle Ø1/2\" to Ø6 mm post clamp (C3) with the post (C2) and the mini-series optical post (C4).\nUse the setscrew on the optical post (C4) to connect a small V-clamp (C5) as the tube holder.\nPut a centrifuge tube in the tube holder and adjust the angle to make it vertical. Mark the position of the tube and mount the pedestal post holder (C6) on the base breadboard (C1) to support the tube.",
    "On the other side of the breadboard (A1), use the setscrew of the Ø12.7 mm aluminum post (D1) to fix it and connect a mini-series optical post (D3) using a right-angle Ø1/2\" to Ø6 mm post clamp (D2).\nConnect the miniature V-clamp (D4) with blunt-end needle (D5) to the post (D3). Adjust the angle of the clamp to set the needle vertical, and adjust the length of post to ensure the needle meets the centrifuge tube.\nConnect the actuator (B1) to the stepper motor driver (E1) and use the UNO R3 controller board and the joystick module from the UNO starter kit (E2) to control the actuator. A power adaptor (e.g., 9-24 V AC/DC adjustable power adaptor) can be used to drive the motor separately.\nPlace the syringe pump (F) next to the gradient making station and connect the syringe with the needle.\nControl the tube holder stage up and down using the joystick.\ntable:\n﻿0,1\nComponent,Item\nB1,Linear stage actuator\nE1,Stepper motor driver\nE2,UNO project super starter kit\nA1,Breadboard\nA2,Vertical bracket\nB2,Slim right-angle bracket\nC1,Mini-series breadboard\nC5,Small V-clamp\nD4,Miniature V-clamp\nC2,Ø12.7 mm aluminum post\n\"C4, D3\",Mini-series optical post\nD1,Ø12.7 mm aluminum post\n\"C3, D2\",\"Right-angle Ø1/2\"\" to Ø6 mm post clamp\"\nC6,Mini-series pedestal post holder base\nD5,Blunt end needle\nF,Syringe pump\nTable 3: Gradient making system components.\n10. Fractionating and detecting system assembly (Figure 2).\nUse a regular round jaw burette clamp to mount the optics module of the UV monitor on the tube piercer. Attach one end of the tubing (1 cm long and 0.56 mm internal diameter) to the connecter of the tube piercer and the other end to the Fluid In port of the optics module. Connect the Fluid Out port to the fractionator.",
    "Connect the optics module with the control unit of the UV monitor according the manual of the manufacturer.\nUse a breakout cable to connect the signal output socket to the digital converter at the ground and analog input connections, according to the manufacturer's manual.\nConnect the digital converter to a laptop using a regular USB cable, and record the converted digital signals using data acquisition software.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}