{
  "id": 5845,
  "origin_website": "Bio",
  "title": "Generation and Selection of Transgenic Olive Plants",
  "procedures": [
    "Note: All this protocol must be conducted under strictly sterile conditions in a laminar flow hood; except B7 step and molecular analysis.    Agrobacterium-mediated transformation of olive embryogenic callus   Obtain an embryogenic olive culture, derived from radicle of mature seed (Orinos and Mitrakos, 1991). Embryogenic friable callus (Figure 1A), containing globular embryos, is maintained and multiplied on ECO medium (see Recipes), transferring to fresh medium at 4-week intervals in darkness at 25 ± 2 °C (Pérez-Barranco et al., 2009).   Grow Agrobacterium tumefaciens AGL1 strain, containing a binary plasmid harbouring the gene of interest and the selection gene nptII (pBINUbiGUSInt as example; containing uidA and nptII genes), in LB medium at 28 °C and 250 rpm for 24 h (with suitable antibiotics for the plasmid used), to obtain a culture of 40 ml at 0.5 OD600 nm. Then, centrifuge the culture at 4,000 x g, wash the pellet with 10 mM MgSO4 without shaking and dilute it in liquid ECO medium, keeping a final 0.5 OD600 nm.   Inoculate globular somatic embryos 1-2 mm diameter, isolated from embryogenic callus, in the diluted Agrobacterium suspension for 20 min under mild agitation; about 20 embryos into 10 ml of Agrobacterium suspension with a total of 80 embryos, approximately (Figure 1B). Then, dry the embryos out on sterile filter paper (Figure 1C).    Co-culture the infected somatic embryos on ECO solid medium for 48 h in darkness, 15-20 embryos per plate (Figure 1D).    Afterwards, wash the somatic embryos with ECO liquid medium supplemented with 250 mg/L cefotaxime and 250 mg/L timentin (Figure 1E). Blot the embryos dry on filter paper (Figure 1F) and transfer them onto selection medium; i.e., ECO solid medium supplemented with 250 mg/L cefotaxime, 250 mg/L timentin and 200 mg/L paromomycin (Figure 1G).",
    "Re-culture the explants onto fresh selection medium weekly during the first month and bi-weekly thereafter.    When the explants show proliferation of paromomycin resistant embryogenic callus on selection medium (Figure 1H), after 3 months of culture approximately, transfer those calli individually to 250 ml culture flasks with 40 ml of ECO liquid medium supplemented with 25-50 mg/L paromomycin (Figure 1I). Incubate the suspensions in an orbital shaker at 120 rpm for 3 weeks in darkness.    Afterwards, sieve the suspensions through a 3 x 3 mm screen (Figure 1J) and culture the small globular embryos separately in a plate on ECO selection medium with 200 mg/L paromomycin. After two months, proliferating callus is transferred to test tubes (Figure 1K).    Calli growing on selection medium can be analysed through PCR to obtain a preliminary verification of transformation (Figure 1L).  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171114/20171114214112_8654.jpg Figure 1. Sequence of olive somatic embryos transformation via Agrobacterium tumefaciens. A. Isolated somatic embryos; B. Inoculation of somatic embryos in a diluted Agrobacterium tumefaciens suspension; C. Somatic embryos drying onto sterile paper after inoculation; D. Co-culture of somatic embryos with Agrobacterium on solid medium; E. Somatic embryos washing in liquid medium supplemented with antibiotics; F. Somatic embryos drying onto filter paper after washing; G. Culture of somatic embryos onto selection medium, supplemented with antibiotics; H. Growth of resistant embryogenic callus on selection medium; I. Incubation of the resistant embryogenic callus in liquid selection medium; J. Obtainment of the fine fraction of the embryogenic callus (1-3 mm); K. Growth of putative transgenic callus on solid selection medium for multiplication; L. PCR verification in an electrophoresis gel. Scale bars = 10 mm.",
    "Regeneration of transformed olive plants   Once the transgenic nature of the paromomycin resistant embryogenic calli has been confirmed by PCR, the process of transgenic plants regeneration from these calli can be started, following the protocol described by Cerezo et al. (2011). Firstly, grow each independent embryogenic calli in ECO liquid medium to obtain globular embryos of small size, 1-3 mm, e.g., culture 0.5 g of callus into 50 ml of medium at 120 rpm for 4 weeks in darkness and later filter through a 3 x 3 mm screen (Figures 2A-2C).    Culture the isolated small globular embryos onto ECO maturation medium for a 4 weeks period (without hormones or cefotaxime and supplemented with 1 g/L active charcoal) in Petri dishes. Incubate the embryos in darkness, 20 globular embryos per plate (Figure 2D).   Transfer the embryos directly on top of 4 x 4 cm dialysis tubing cellulose membrane sections lied onto fresh ECO maturation medium and incubate them for another 4 weeks period in darkness (Figure 2E). These membranes are prepared according to the manufacturer’s instructions and sterilized by autoclave.    Afterwards, culture mature embryos at cotyledonary stage in germination medium (see Recipes) under light conditions (16 h photoperiod, 40 µmol m-2 sec-1 irradiance level). (Figure 2F)    Transfer the shoots obtained to medium supplemented with 5.6 μM ZR (Figure 2H) for further proliferation.   To induce rooting, transfer shoots with two or three nodes (2-3 cm) to DKW rooting medium (see Recipes) supplemented with 0.5 μM IBA (Figures 2G-2I).  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171114/20171114214408_5371.jpg Figure 2. Sequence of regeneration of olive transformed plants. A. Growth of transformed embryogenic callus on selection medium; B. Incubation of the transgenic callus in liquid medium; C. Obtaining a fine fraction embryogenic culture (1-3 mm); D. Culture of small transformed isolated embryos onto ECO maturation medium; E.",
    "Culture of transformed pre-maturated embryos onto cellulose acetate membrane lied on ECO maturation medium; F. Culture of transformed maturated embryos in germination medium; G. Transformed olive plantlets; H. Transformed plant growing in multiplication medium; I. Transformed olive plant in rooting medium. Scale bars = 10 mm.    Acclimate rooted plants to ex vitro conditions in a greenhouse. Wash roots with distilled water and transfer the plants to a jiffy tray with 1:1 peat moss:perlite substrate and cover the tray with a translucent plastic top. Gradually, adapt the plants to ex vitro conditions by increasing exposure to ambient humidity opening the cover. Transfer the plants to larger pots as they grow (Figures 3A-3D).   Carry out a Southern or Northern analysis to confirm the transgenic nature of regenerated plants.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171114/20171114214525_9629.jpg Figure 3. Sequence of recovery of transformed olive plants in a greenhouse. A. A well-developed transformed olive plant; B. Transformed olive plants acclimated into a jiffy tray with 1:1 peat moss:perlite substrate; C. Transformed olive plants in 12.5 cm pots; D. Transformed olive plants in 15 cm pots. Scale bars = 25 mm."
  ],
  "subjectAreas": [
    "Plant Science",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}