{
  "id": 2044,
  "origin_website": "Cell",
  "title": "Assessment of dopaminergic neuron degeneration in a C. elegans model of Parkinson’s disease",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nAgarose pad preparation\nTiming: 15 min\nThis step describes how to prepare 2% agarose pads combined with M9/levamisole buffer that will be used for mounting the nematodes. Several methods (e.g., agarose pads, polystyrene nanoparticles, microfluidic chips and anesthetics) have been developed and utilized to immobilize and mount nematodes for long- or short-term imaging (Dong et al., 2018[href=https://www.wicell.org#bib5]; Kim et al., 2013[href=https://www.wicell.org#bib9]; Mondal et al., 2016[href=https://www.wicell.org#bib14]; Mondal and Koushika, 2014[href=https://www.wicell.org#bib15]). The use of agarose pads is the most common methods because it is a simple, low-cost and versatile technique.\nWeigh 0.5 g of agarose in a 50 mL glass beaker.\nAdd 25 mL of M9 buffer.\nPlace and heat the mixture in a microwave until the agarose will be dissolved.\nStir the mixture periodically and keep it warm on a heating plate.\nPlace an empty microscope slide on the bench.\nAdd a drop of 30 μL of agarose solution (2% final concentration) in the middle of the slide.\nTake a second microscope slide and place it on the top of the agarose drop and press down gently to flatten it.\nAfter 30 s remove carefully the top microscope slide.\nNote: Several agarose pads can be prepared (Ramachandran et al., 2015[href=https://www.wicell.org#bib19]; Rieckher and Tavernarakis, 2017[href=https://www.wicell.org#bib21]; Walston and Hardin, 2010[href=https://www.wicell.org#bib29]; Wang et al., 2021[href=https://www.wicell.org#bib30]). Leave the top microscope slide as a cover to eliminate the evaporation and preserve the agarose pads humidity longer (∼ 30 min).\nProceed with the sample preparation.\nMounting nematodes\nTiming: 5–10 min\nThis step describes the mounting process of transgenic nematodes on the agarose pads before the image acquisition.\nAdd 10 μL 20 mM M9/levamisole buffer on the agarose pad.",
    "Note: Levamisole is an agonist of cholinergic receptors and influences directly neuronal function and physiology (Culetto et al., 2004[href=https://www.wicell.org#bib4]; Fleming et al., 1997[href=https://www.wicell.org#bib6]; Kim et al., 2001[href=https://www.wicell.org#bib10]; Podbilewicz and Gruenbaum, 2006[href=https://www.wicell.org#bib18]). Thus, lower concentration of levamisole (e.g., 1 or 5 mM) can be used, especially for experiments that require extended periods of live-cell imaging.\nUse an eyelash, which is glued on a toothpick or platinum wire worm picker, to pick and transfer the transgenic nematodes into the M9/levamisole droplet. Transfer 15–20 animals per drop.\nNote: Transfer carefully the transgenic animals one by one into the droplet to avoid nematodes injury or even death. Old nematodes are more sensitive to mechanical forces.\nAlternatives: A worm pick can be used instead of eyelash to transfer the transgenic animals into the droplet.\nPlace gently a coverslip on the top of the transgenic nematodes. Troubleshooting 1[href=https://www.wicell.org#sec6.1].\nUse nail polish and seal the coverslip on the agarose pad.\nCritical: Sealing of the coverslips is required for the maintenance of humidity during the imaging process. Sealing is highly recommended for long-term imaging experiments.\nProceed to microscopic examination of the specimens.\nImage acquisition\nTiming: 1–2 h\nUse an epifluorescence (e.g., EVOS FL AUTO 2) or a confocal (e.g., Zeiss LSM 710) microscope combined with a camera.\nPlace the prepared slides under the microscope.\nProperly focus and detect single transgenic nematodes co-expressing green fluorescent protein (GFP) and α-syn in dopaminergic neurons.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1527-Fig1.jpg\nFigure 1. Dopaminergic neuronal circuit in C. elegans\n(A) Dopaminergic neuronal circuit consists of 8 neurons the C. elegans hermaphrodite. Transgenic nematodes expression cytosolic GFP under the dat-1 promoter display two pairs of CEPs and a pair of ADE neurons in the anterior part and a pair of PDE neurons in the posterior part of the nematode body.",
    "(B) CEPs and ADEs neurons form a well-structure network in the head region (i). Dopaminergic neuronal circuit is gradually deteriorated with age in transgenic animals expressing α-synuclein. CEPs and ADEs neurons present dendritic or outgrowths loss (ii), entire loss of their cell bodies (iii), axonal and some blebbing (iv). Remnants of neuronal cell bodies (asterisks), intact neuronal processes (arrows) and axonal beading (arrowheads) are depicted. Scale bars, 500 μm and 50 μm.\nNote: The hermaphroditic nematode C. elegans has 8 dopaminergic neurons, 6 (CEPs and ADEs) in the head region and 2 (PDEs) in the middle body (Figure 1[href=https://www.wicell.org#fig1]A). The male nematodes display additional 6 dopaminergic neuronal cells, which are located in the tail (Sulston et al., 1975[href=https://www.wicell.org#bib26]).\nCapture z-stack images of the head and the middle body region by using 20× objective lens. Troubleshooting 2[href=https://www.wicell.org#sec6.3].\nNote: EVOS FL AUTO 2 software and Zeiss ZEN (black edition) were used for image acquisition.\nCritical: Use the same imaging settings (e.g., lens, magnifiers, filter exposure time, laser intensity, gain etc.) during the entire microscopic examination for all the condition that will be used for analysis.\nSave the acquired images.\nProcess the acquired z-stack images with the Zeiss ZEN software (black version), to obtain the maximum intensity projection (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1527-Fig2.jpg\nFigure 2. Maximum intensity projection by using the Zeiss ZEN software\nStep 1. Open an acquired Z-stack image (.czi file) with the Zeiss ZEN software (black version; https://www.zeiss.com/microscopy[href=https://www.zeiss.com/microscopy]); Step 2. In the processing tab under Method section select “Maximum intensity projection”; Step 3. Select the Z-stack image and press select button followed by apply button to create the Maximum intensity projection image; Step 4. Export the maximum projection intensity image to your respective drive.\nProceed to the analysis of the acquired images.\nScoring degeneration of dopaminergic neurons\nTiming: 1 h",
    "Open the acquired images by using ZEN software.\nExamine the transgenic nematodes and evaluate dopaminergic neuronal loss by the following complementary methods:\nMeasure average fluorescence pixel intensity from dopaminergic neurons (CEPs, ADEs, PDEs) expressing GFP under the dopaminergic neuron specific promoter using the Zeiss ZEN software (blue version).\nOpen an acquired image with ZEN Blue software, click graphics, select draw spine contour, mark the GFP positive neuronal cell body, and note the mean intensity value.\nNote: Create similar shape or size of region of interests (ROIs) to improve and increase the measurements’ accuracy.\nFollow this step to score the intensity for each CEP, ADE and PDE neurons (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1527-Fig3.jpg\nFigure 3. Measure average fluorescence pixel intensity by using the Zeiss ZEN software\nStep 1. Open an acquired maximum intensity projection image with the Zeiss ZEN software (blue version; https://www.zeiss.com/microscopy[href=https://www.zeiss.com/microscopy]); Step 2. Click the graphics tab and select “draw spine contour”; Step 3. Draw the contour around CEPs or ADEs neurons expressing cytosolic GFP; Step 4. The pen symbol marks the end of contour and provides area and intensity mean values, which can be noted in excel file for further analysis.\nAlternatives: Image analysis software, such as FIJI (https://imagej.net/software/fiji/[href=https://imagej.net/software/fiji/]) or Qupath (https://qupath.github.io[href=https://qupath.github.io]), could be alternatively utilized to quantify the average fluorescence pixel intensity from dopaminergic neurons.\nCritical: Use transgenic animals (IR2514) expressing only the cytosolic GFP under the dat-1 promoter to examine whether its activity is affected by the respective treatments or genetic backgrounds.",
    "Score neurodegeneration by monitoring specific morphological features of dopaminergic neurons in the head region. C. elegans contains 3 pairs of head dopaminergic neurons, which form well-structured neuronal processes (Figure 1[href=https://www.wicell.org#fig1]Bi). Nematodes expressing α-synuclein in dopaminergic neurons display age-dependent degeneration that is characterized by dendritic or outgrowths loss (Figure 1[href=https://www.wicell.org#fig1]Bii), entire loss of neuronal cell bodies (Figure 1[href=https://www.wicell.org#fig1]Biii), axonal and some blebbing (Figure 1[href=https://www.wicell.org#fig1]Biv). Count the neuronal cells bodies with wild type morphology to signify the survival of dopaminergic neurons in the total number of imaged animals. Use 3 different plates with 15–20 animals per strain/condition in each experimental set up. Troubleshooting 3[href=https://www.wicell.org#sec6.5], 4[href=https://www.wicell.org#sec6.7], and 5[href=https://www.wicell.org#sec6.9].\nNote: The assessment of the morphological alterations in dopaminergic neurons is a subjective method. Thus, (1) positive controls should always be included in each experimental set up and (2) each experiment must be conducted in a double-blind manner.\nImport and analyze the data by using a statistical software package (e.g., GraphPad Prism).\nNote: Repeat each assay at least three times."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Neuroscience",
    "Cell Biology",
    "Model Organisms"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}