{
  "id": 9692,
  "origin_website": "Jove",
  "title": "Mosaic Analysis of Gene Function in Postnatal Mouse Brain Development by Using Virus-based Cre Recombination",
  "procedures": [
    "1. Preparing viruses for injection\nrAAVs were purchased from the recommended commercial vendor, but they can also be produced in one's own lab (see discussion below). The virus solution is typically produced at a titer of ˜1x1012 genome copies per milliliter (GC/ml) and may be used at full titer to manipulate a large number of cells. Alternatively, they may be diluted to produce the desired level of sparse labeling. The appropriate dilution must be determined by the user, but a 1:10 dilution is recommended to start.\nThaw viruses on ice immediately before use. Transfer the desired pre-dilution volume of virus solution into a small (˜250μl) PCR tube. Dilute the virus solution using an appropriate volume of sterile DPBS in a tissue culture hood. Store diluted virus solution on ice until it is needed.\nNOTE: handling of all viruses should be conducted in accordance with a biosafety protocol approved by your institution\n2. Syringe loading and equipment assembly\nConnect the loading needle to the glass syringe and draw up the virus solution from the PCR tube by gently pulling the plunger. Pull the plunger until a very small bubble of air can be seen in the syringe; this indicates that all of the solution is in the syringe and is not left in the loading needle. Alternatively, a small amount of inert dye can be added to the solution to make it visible.\n NOTE: A small PCR tube should be used as the loading needle is typically not long enough to reach the bottom of most other tubes.\nRemove the loading needle and place the syringe on the syringe block of a syringe pump, securing it with the syringe retainer.",
    "Gently insert one end of the connective tubing into the syringe; insert the other end into the needle holder. Insert the injection needle into the needle holder. The end of the injection needle should directly contact the end of the connective tubing inside of the needle holder.\nSlowly depress the plunger manually to push the solution through the connective tubing. Push until a tiny drop of solution is visible at the tip of the injection needle.\nCarefully position the plunger next to the pusher block and secure it in place with the pusher block bracket.\nSet the injection parameters: injection rate should be approximately 8μl/min (˜130nl/s); injection volume is typically 1-2ul; select the appropriate syringe diameter for the syringe size you are using (see the syringe pump manual for guidelines).\nSet the hotplate to ˜38°C and cover with a paper towel or other thin barrier to protect the pups during the recovery phase.\n3. Injection procedure and pup recovery\nPrepare P0 or P1 mouse pups for injection by subjecting them to cold anesthesia following an IACUC approved protocol. Dampen a few paper towels with water and place on ice. Place the desired number of pups (4-5) on the paper towel (keep them well separated) and gently fold the paper towels over the pups so they are covered by damp paper towel. Gently place a small amount of crushed ice on top of the paper towels and incubate the pups for approximately 5 minutes. The pups can be kept on ice for up to 15 minutes and recover fine afterwards.",
    "After the pup is sufficiently anesthetized, place it on a mounting block (we use a Styrofoam block that normally holds 15ml tubes) and position it for best access to the injection site. For the cortex it is easiest to lay the animal flat on its belly, while for the cerebellum it is helpful to position the pup's head over the edge of the block to provide better access to the rear of the skull. The pup may be secured in place with a band-aid, if desired.\nHold the pup's head in place with one hand while the needle is manually inserted through the skull at the desired site with the other hand. It is helpful to pull the skin tight to prevent it from moving during injection. For the cortex it is useful to make the injections relative to a well-defined anatomical landmark, such as the lambda suture of the skull, as this will aid in future injections. The cerebellum can be seen through the skull as a thin strip of tissue lying directly caudal to the colliculus. The depth to which the needle should be inserted varies slightly between individual animals and strains and can be gauged by predetermined markers on the needle, however for cortex and cerebellum we find that a depth of ˜0.5 - 1mm from the surface is usually suitable. The insertion depth for other sites should be determined experimentally by the end user.\n NOTE: The needle should easily penetrate the skull; if it does not, DO NOT push too hard as this can injure the animal. Reposition the needle and gently try again.",
    "Inject the virus solution. The injection is started by pressing the START button on the pump or depressing a foot pedal, depending on the model of pressure injector used. In the absence of a foot pedal it is recommended to have a colleague assist with pressing the button to minimize unnecessary hand movements that may affect the injection.\nAfter the selected volume has been injected, keep the needle in place for a few seconds and then gently remove the needle by sliding it out smoothly. Be sure to hold the pup's head in place to minimize extraneous movements. Since the injection equipment is cleaned and sterilized between experiments with ethanol and the wound is small, the use of antiseptic is unnecessary.\nPlace the pup on the covered hotplate with the temperature set at ˜38°C to warm it up for recovery, typically 5-10 minutes. During this time you may continue injecting other pups.\nAfter all of the pups have recovered (they should be pink and moving) take a portion of the home bedding and gently rub the pups with it. Return the pups to the mother as a group.\nNOTE: It is very important to make sure the pups are warm and exposed to home bedding prior to returning them to the mother and to return them as a group. Failure to do so may result in the mother injuring or killing the pups.\n4. Equipment cleaning\nAfter the injection is complete and the pups have been returned to their mother, clean the injection setup by fully loading the syringe with acetone or 70% ethanol. Flush the solution through the injection setup several times, using fresh solution each time. This will remove any remaining virus solution and precipitates. The acetone or ethanol will then evaporate.",
    "NOTE: Acetone is preferred for cleaning, but if your setup uses any acetone-sensitive components, such as cyanoacrylate adhesives, then use 70% ethanol for these steps.\nDisinfect the working area with bleach and discard waste in an appropriate biohazard container.\n5. Analysis\nSacrifice the animals at the desired age using an IACUC approved euthanasia method. Perfusion fixation is recommended to aid in later visualization of infected neurons, particularly in adult animals.\nStandard immunostaining procedures may be used to amplify the fluorescent signal. Briefly, 100 μm floating vibratome sections are permeabilized with PBS+1% Triton X-100 and blocked in PBS+1% Triton X-100+10% normal goat serum. Sections are incubated in blocking solution with primary antibodies overnight at 4°C, followed by additional washing and blocking. Sections are then incubated in blocking solution with secondary antibodies for 2 hours at room temperature, washed thoroughly, mounted on slides and coverslipped with anti-fade mounting media. Cryosections can be also used to visualize labeled neurons, however the endogenous fluorescence might be lost.\n6. Representative Results:",
    "A successful injection procedure will produce robust infection of neurons in the region of the injection site with no observable tissue damage or other ill effects on the animal. As illustrated in Figure 1, the spread of the infection can be observed in Cre-reporter mice (ROSA26R)12 injected with rAAV8-Cre in various anatomical sites. Injections into specific regions, such as cortex and superior colliculus, typically generate local infections with minimal spread to adjacent regions (Fig. 1A-B). Use of high titer virus solution makes infection of adjacent areas, such as the hippocampus, more likely (Fig. 1A). Injection with low titer virus solution results in sparse infection, which typically remains near the injection site, as shown in the cerebellar injection of rAAV8-Cre at the midline of ROSA26R reporter mice (Figure 1C-D). We have observed recombination in ROSA26R reporter mice within 2 days after injection of rAAV8-Cre, suggesting that infection, recombination, and expression of reporter genes can all occur relatively rapidly. Additionally, we have successfully used this technique to study the effects of gene deletion at a non-ROSA locus using a floxed conditional allele, the results of which will be published elsewhere.",
    "The number of cells infected should correlate with the titer of the injected viral solution. For example, injecting a mix of high titer solutions of two rAAV8 viruses expressing different fluorescent proteins into the cerebellum infects many Purkinje cells that are differentially labeled (Fig. 2A). Conversely, injecting a low titer virus solution can result in sparse infection to aid in visualizing single cells (Fig. 2B). Fluorescently labeled neurons can be observed directly in fresh cut, live tissue (Fig. 2B) or can be subjected to immunostaining to enhance the endogenous fluorescent signals for later image acquisition by wide-field or confocal fluorescent microscopy (Fig. 2A, Fig. 3A-C). Lastly, rAAV8 is capable of infecting a variety of neuron types in the cortex with strong labeling of fine processes (Fig. 3A-C).\nimgsrc://cloudfront.jove.com/files/ftp_upload/2823/2823fig1.jpg\nFigure 1: LacZ staining in the brain of ROSA26R reporter mice that were injected with rAAV8-Cre at P0 demonstrates Cre activity and the location of infection.\nWide-field sagittal view of a P14 brain showing high titer (1x1012 GC/ml) injections into cortex and superior colliculus. The use of high titer virus makes it more likely that adjacent areas will also be infected.\nSagittal section of P14 cortex injected with lower titer (1x1011 GC/ml) virus demonstrates a local infection with less spreading.\nA wholemount view of a P28 cerebellum injected at the midline with low titer (1x109 GC/ml) virus solution shows that the infection is sparse and typically remains near the injection site.\nSagittal view of the midline of the cerebellum in C). Note that generally only Purkinje cells are infected by rAAV8.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2823/2823fig2.jpg\nFigure 2: Cerebellar labeling by injection with high and low titers of rAAV8 expressing fluorescent proteins.",
    "A sagittal section of P21cerebellum infected with a mix of two viruses expressing EGFP (green) and DsRed (red). A high titer mix of viruses was used to infect a large number of Purkinje cells.\nA purkinje cell in live P14 cerebellum from very low titer viral infection imaged immediately after dissection.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2823/2823fig3.jpg\nFigure 3: Cortical labeling by rAAV8-DsRed.\nExamples of the variety of cortical neuron types in the coronal sections of a P21 cortex that was infected by rAAV8-DsRed at P0.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}