{
  "id": 9467,
  "origin_website": "Jove",
  "title": "Selective Tracing of Auditory Fibers in the Avian Embryonic Vestibulocochlear Nerve",
  "procedures": [
    "1. Prepare the Following Dissection Tools and Reagents\nArtificial cerebrospinal fluid (aCSF; 130 mM NaCl, 3 mM KCl, 1.2 mM KH2PO4, 20 mM NaHCO3, 3 mM HEPES, 10 mM Glucose, 2 mM CaCl2, 1.3 mM MgSO4) continuously infused with 95% O2 / 5% CO2 at room temperature. For infusion, fill to 2/3 a 500 ml wide-mouth Nalgene jar with a hole drilled in the lid. Tank will be attached by tubing to a glass stem bubbler, which penetrates the aCSF through the hole in the jar lid. Adjust pressure to obtain a constant stream of bubbles that reach about 1/3 of the liquid but are not forceful enough to cause splashing over the rim. Submerge 5 ml glass vials (up to 6) into the Nalgene jar to separate individual samples from each other and from the gas flow turbulence. ACSF should be oxygenated for at least 20 min prior to any tissue incubation.\nSmall silicone dissection dish (35 mm x 10 mm Petri coated using Sylgard Elastomere Kit) with two dissection pins placed into small hexagonal polystyrene (47 mm bottom) weigh boat.\nTwo fine-tip forceps, one curved-tip forceps, a 50 ml beaker, and a container for tissue waste.\nPulled glass micropipette (1.2 OD / 0.9 ID) broken to approximately 20-50 μm opening at the tip and filled with rhodamine dextran amine (RDA, MW = 3,000, Invitrogen) in a 6.25% solution with 0.4% Triton X-100 in PBS. Attach by fine tubing to picospritzer and stabilize to micromanipulator.\n2. Micro-dissection to Reveal Basilar Papilla at E8 4,5\nWith curved forceps, cut E8 embryo just below the brainstem, placing head directly onto silicone-coated dissection dish within weigh boat.",
    "Using dissection pins, position the head with a ventral view so the ear on the side of interest is slightly visible, the head tilted slightly dorsally and pointing 10-30 degrees away from center (Figure 2A). Immediately secure the head with pins. If bilateral tracing is desired, center the head at 0 degrees, or a full ventral view so both sides can be accessed. Similarly, for a left-sided injection, secure the head at -10 to -30 degrees from center so the left side is accessible.\nUsing the 50 ml beaker, transfer 30 ml of oxygenated aCSF into the dish, fully submerging the tissue.\nGently grasp and peel down the lower jaw using fine-tip forceps, then remove the lower eyelid on the side of interest.\nRemove the overlying vascular tissue, including any remaining palate and gullet. These soft tissues should peel away revealing the smooth surface of developing chondrocranium with the distinctive vertebral arteries at its surface. By this point, the characteristic white otoconial mass should be visible.\nCarefully dissect the skin around the external meatus, cartilage of the jaw joint, and the middle ear while leaving the inner ear intact.  Use the forceps to gently cut away these cartilaginous structures.\nRemove vertebral arteries and pooling blood using a gentle sweeping motion with the fine forceps tips. Blood can obscure view and coagulation may plug the injection pipette opening.",
    "The cochlear duct with adjacent sensory epithelium (basilar papilla) and acoustic ganglion lies directly beneath the chondrocranium 6 and can be visualized as an elongated finger-like projection extending from the inner ear ventrally, with the distal-most tip (apex) near the anterior midline 5. There may be a small pooling of blood (red) from the dissection and/or otolithic calcifications (white) at the apex of the cochlear duct (Figure 2B) that can aid in visualization. At the apex is the lagenar macula, a sensory patch thought to be of vestibular function 7,8.\n3. Selective Labeling of CN VIII Auditory Fibers\nPlace the injection pipette near the embryo surface at the cochlear duct and basilar papilla region.\nSlowly lower the micropipette to first puncture the cranium. This cranial region is thinner than surrounding areas and requires less force to penetrate. The micropipette should now be inside the cochlear duct. Optional: a small injection of tracing dye can be made here to aid in visualizing the basilar papilla.\nWithout repositioning the micropipette, continue lowering until it just breaches the deep border of the cochlear duct (Figure 1). Perform an injection here and repeat in multiple regions along the length of the basilar papilla (Figures 2C, 2D), excluding the most proximal tip where the vestibular lagena is located. With the picospritzer set between 10-30 psi, several injections are made. The volume of injected dye fluid varies, and depends on the extent of labeling desired. Each injection should result in a fluorescent dye-labeled spot of approximately 200 - 400 μm diameter (Figure 2D).\nOnce the injection is complete, use forceps to transect the sample above the brainstem and use a transfer pipette to place the caudal portion into a small jar within the container of aCSF continually being perfused with 95% O2 / 5% CO2.",
    "For each embryo, allow 20-30 min for dye transfer, depending on the distance of central tracing desired.\nRemove tissue and prepare for histological sectioning. In the example shown here, tissue is immersed in 4% paraformaldehyde (in 1X PBS) overnight, 30% sucrose (in 1X PBS) overnight. \n4. Counterstaining and Analysis\nCounterstaining is useful to help orient the observer to anatomical location as well as identify particular regions of interest. An effective counterstain in this preparation is neurofilament immunolabeling (Figures 1, 3B, 3E), which strongly labels axons and allows for demarcation of axonal tracts in the CNS.\nAnalysis should be performed throughout the labeled region, as the projections can extend several hundred microns or more along the rostrocaudal axis. Some examples of basic analyses are: targeting error rates, timing and/or changes in divergence of projection patterns. RDA-labeled axons are visualized in the peripheral and central nervous system with high resolution (Figures 3A, 3D).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}