{
  "id": 17116,
  "origin_website": "Jove",
  "title": "Tuina Manipulation to Reduce Inflammation and Cartilage Loss in Knee Osteoarthritis Rats",
  "procedures": [
    "This study has passed the animal ethics review conducted by the experimental animal ethics committee of Yueyang Hospital of integrated traditional Chinese and western medicine affiliated with Shanghai University of Traditional Chinese Medicine (YYLAC-2022-166).\n1. Experimental animal preparation and grouping\nAnimal Preparation\n\t\nRear a total of 10 healthy SPF SD female rats of 200-220 g at room temperature (18-21 °C), humidity 40%-50%, 12 h: 12 h circadian rhythm alternations. Conduct pain-related animal experiments in strict compliance with the relevant provisions of animal ethical guidelines and guidelines.\nGrouping of animals\n\t\nRandomly divide the rats into the Tuina group and control group. Treat rats of the Tuina group with press and kneading manipulation for 21 days after modeling. Put rats of the control group in the same Tuina room and place them in a black cloth bag simultaneously while the Tuina group is undergoing treatment.\n2. Modeling of animals\nAnesthetizing the animal\n\t\nUse isoflurane for gas anesthesia. Place the rat in the induction box with an induction concentration of 3%. Wobble the box after laying the rat down and confirm the anesthetization when the rat rollover with no attempt to return to the prone position.\nRemove the rat from the induction box and fix its nose in the anesthetic mask. Adjust the isoflurane concentration to 2% to maintain anesthesia. Confirm the anesthetization when the rat does not respond when pinching its paws. Apply eye ointment to the rats to prevent dryness when rats are anesthetized, as the eyelids cannot be closed.\nModeling method21​",
    "Use shaving machine to remove the hair of the right hind limb. Place a medical cotton pad between the right ankle and hip joint of the rat. Fix the right knee joint at 180° extension with 5-6 layers of wet plaster bandage evenly. Spiral wrap the plaster bandage starting from the ankle and covering 1/3 of the previous one. Use a hair dryer to dry and harden the plaster.\nExternal wrap the plaster with denture base material after the plaster bandage dries and hardens to fix the plaster and prevent it from gnawing.\nMix the denture base materials to make it sticky and adhere the mixture to the outside of the plaster (the mixture should not exceed the edge of the bandage, Figure 1). After the mixture becomes hard, turn off the anesthesia machine and wait for the animal to wake up naturally. Supervise the rats to prevent anesthesia accidents before the rats wake up.\nFix the plaster appropriately on the right hind limb of the rat, as a tight fixation restricts blood circulation, while a loose fixation tends to fall off. Observe the blood circulation in the terminal limb. If swelling of the terminal extremity or a purple complexion is detected, promptly cut off part of the plaster to help restore circulation. Remake the plaster if it is broken and fails to maintain the lower limb extension.\nRemove the plaster after 3 weeks of continuous immobilization. Use surgical scissors to cut off the denture base material outside and plaster bandage. Rinse the lower limb of the rat with saline and dry it with gauze. If there are local skin lesions, sterilize with iodophor.\nModel verification22\nX-ray-based verification",
    "Perform an X-ray examination of the right knee 1 day after the end of modeling. Take anteroposterior radiographs in the supine position with hip flexion at 30°, knee extension at 0°, and hip abduction at 15°. Keep the patella directly in front of the knee and put the radiator tube 110 mm from the knee joint.\nTake lateral radiographs in the right lateral decubitus position with right hip flexion at 30° and right knee extension at 0°. Make the left limb hip flexion at 70°, and knee flexion at 45°, and put the radiator tube 110 mm away from the knee joint. Set the detection parameters as exposure voltage 50 kV, current 250 mA, exposure dose 32 mAs, and exposure time 128 ms.\nCompare with normal rats' X-ray, check that the modeled knee X-ray shows narrower joint space with osteophyte hyperplasia at the edge.\nOsteoarthritis Research Society International (OARSI) scoring23\nPlace the rat in the euthanasia box and perfuse CO2 at the rate of 30%-70% cage volume per minute. Stop perfusing CO2 after detecting that the rat is immobile, not breathing, and that the pupil is dilated. Observe for another 2 min to confirm death.\n\t\t\t​NOTE: Cervical dislocation can be performed after CO2-based euthanasia as a secondary form to confirm death. Fix the rat on the table and grasp its tail with one hand. Press down on the head of the rat with the thumb and index finger of the other hand. Confirm death when hearing the sound of a crack, and the rat loses movement and heartbeat at the same time.",
    "Fix the rat in a supine position with a syringe needle on a foam board with the right hind limb flexed in abduction and external rotation. Pinch up the skin around the knee joint with surgical scissors. Expose the muscles around the knee joint by cutting the skin and then cutting the subcutaneous fascia.\nCut off the femur and tibia diaphysis with bone scissors and remove the right knee joint. Gently remove the extra soft tissues, such as muscles and ligaments, outside the joint.\nFix the joint in 4% paraformaldehyde for 24-48 h at 4 °C. Decalcify the joint in 10% formic acid solution for 3 days until the bone tissue can be easily poked with a needle.\nPlace and trim the decalcified tissue in the fume hood and transfer it to a dehydration box in the dehydration machine. Add 75% ethanol for 4 h, then 90% ethanol for 2 h, followed by 95% ethanol for 1 h, absolute ethanol for 30 min, another round of fresh absolute ethanol for 30 min, alcohol benzene for 5-10 min, xylene for 5-10 min, another round of fresh xylene for 5-10 min, wax for 1 h, another round of fresh wax for 1 h, and final round of fresh wax for 1 h for dehydration and transparent wax immersion.\nThen, place the tissue into the machine for embedding. Cut the wax block into wax slices of 4 µm after the paraffin has set and flatten the slice in warm water. Place the slice on a glass slide and dry. Store it at room temperature.\nObserve the cartilage sample and score it according to the OA cartilage histopathology grade assessment (Table 1)23. If the score of rats after modeling is significantly higher than that of the normal rats, modeling was successful.",
    "Table 1. OA cartilage histopathology grade assessment. Grade is depth progression into cartilage. Total score = Grade x Staging. 0 for normal joints, 24 for severe arthritis. Please click here to download this Table.[href=https://www.jove.com/files/ftp_upload/65451/Table.1_RE.xlsx]\nimgsrc://cloudfront.jove.com/files/ftp_upload/65451/65451fig01.jpg\nFigure 1. Rats immobilized in plaster. After the rats were anesthetized, their right lower limbs were wrapped with plaster bandages, fixed in the hyperextended position, and covered with a layer of denture base materials outside. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/65451/65451fig01large.jpg]\n3. Tuina manipulation\nApplication area\n\t\nSelect a total of 5 acupoints on the right hind limb of rats, including ST34, ST35, SP10, EX-LE4 and BL40 (Figure 2). Locate the acupoints according to the principles of acupoint positioning in 24. \nPosition for application\n\t\nCut a black cloth into a 9 cm x 15 cm bag with one side opening and tighten the opening with a rope. Before the Tuina manipulation, gently pull the rat's tail to make it burrow into the bag and expose its hind limbs outside the bag.\nUse one hand to keep the rat in the prone position, holding its tail and hind leg while the other hand applies press and kneading manipulation on a specific acupoint (Figure 3).\nTuina manipulation\n\t\nOperate press and kneading manipulation on the 5 acupoints on the right hind limb for 2 min each. Place the performers thumb on the selected acupuncture point to perform rhythmic press and kneading, driving the skin and subcutaneous tissue together in a circular motion.\nUse finger pressure recordings (units in Newton) to ensure consistent intensity and frequency of the manipulation. Keep the intensity between 3-5 N and the frequency at 2 Hz (Figure 4). Apply the manipulation once a day for 21 days.\nimgsrc://cloudfront.jove.com/files/ftp_upload/65451/65451fig02.jpg",
    "Figure 2. Acupoints position. SP10 is located 5 mm above the inner knee joint in rats. ST34 is located 5 mm above the outer knee joint in rats. EX-LE4 is located in the medial side of the knee ligament in rats. ST35 is located in the lateral side of the knee ligament in rats. BL40 is located at the midpoint of the transverse popliteal stripe. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/65451/65451fig02large.jpg]\nimgsrc://cloudfront.jove.com/files/ftp_upload/65451/65451fig03.jpg\nFigure 3. Tuina manipulation applied on rats. The rats were kept in a black bag with their hind limbs exposed. The performer held the rat's tail with the left hand while the right hand performed the manipulation. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/65451/65451fig03large.jpg]\nimgsrc://cloudfront.jove.com/files/ftp_upload/65451/65451fig04.jpg\nFigure 4. Finger pressure recordings. A device that records the force and frequency of finger pressure is used for real-time feedback on the intensity and frequency in the process of Tuina manipulation. (A) Pressure sensor and transmission equipment. (B) Finger pressure recordings. (C) The force recorded during Tuina manipulation. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/65451/65451fig04large.jpg]\n4. Pain Behavior Tests\nTest pain behavior before and after modeling, and at 1 day after (D1), 7 days after (D7), 14 days after (D14) and 21 days after (D21) the Tuina manipulation, including mechanical withdrawal threshold and paw withdrawal latency tests.\nMechanical withdrawal threshold (MWT)\n\t\nPlace the rats in a 20 cm x 10 cm x 20 cm transparent tempered glass cubicle located on a 40 cm high stage which is made up of a wire lattice with a size of 10 mm x 10 mm aperture. Keep the room temperature at 23 °C ± 2 °C.",
    "Settle the rats in the behavioral laboratory for at least 2 h per day during the behavioral test phase to avoid interference with the test results due to the animals' lack of adaptation to the environment at the beginning of the formal test. Place the rats in the behavioral laboratory for 30 min before the start of the formal test to facilitate their adaptation to the environment and to reduce distracting factors.\nUse electronic Von Frey fibers to measure the MWT. Stimulate the rat with the fiber at the center of its foot and withdraw the fiber when the rat shows obvious movements such as raising the leg and avoiding. The machine can automatically record the maximum pressure value (N) at this moment.\nStart the next stimulation in the same rat at least 15 s after the current stimulation. Do not exceed 5 s during each stimulation to prevent sensitization to tactile stimuli in the paws of rats. Repeat the test 5x until the difference between the three consecutive measurements is insignificant (within 10 N).\nDelete the values with large differences (the maximum and the minimum values) and take the average of the remaining three values as the mechanical withdrawal threshold.\nPaw withdrawal latency (PWL)\n\t\nPlace the rats in a small compartment of transparent tempered glass with a size of 20 cm x 10 cm x 20 cm. Cover the top of the compartment with a transparent glass cover with ventilation holes. Keep the temperature of the transparent glass plate at 28-30 °C, on which the compartment is placed.",
    "Settle the rats in this environment for at least 30 min to acclimatize before the start of each formal test. If rats urinate or defecate in the compartment, clean it with absorbent paper in time to avoid affecting the subsequent light radiation heat transfer.\nFocus the spotlight on the center of the rat's foot and press the Start button. Press the Stop button when the rat shows obvious behaviors such as foot retraction or paw licking and record the time at this point. The spotlight irradiation time should not exceed 20 s to avoid damage to the rat's skin.\nPerform the next irradiation on the same rat after at least 10 min to prevent sensitization. Measure 5x on each rat.\nRemove the values with large differences (the maximum and the minimum value). Take the average of the remaining values as the PWL.\n5. Sample preparation\nPerform euthanasia on the mouse as described in 2.3.2.1.\nSynovial membrane preparation\n\t\nFix the rat in the supine position with a syringe needle on a foam board with the right hind limb flexed in the abduction and external rotation. Pinch up the skin around the knee joint with surgical scissors and expose the muscles around the knee joint of rats by cutting the skin and then cutting the subcutaneous fascia.\nTake the patellar ligament as a landmark to strip the muscle groups above the patellar ligament. Incise the ending of the patellar ligament (at the tibial tuberosity) carefully and find the synovial membrane when the ligament is pinched upwards from below.\nCarefully cut off the synovial tissue with ophthalmic scissors and wash off the blood and synovial fluid with pre-cooled saline. Fix the synovial membrane in 4% paraformaldehyde for at least 48 h after absorbing water from the tissue surface with clean gauze.",
    "Prepare the sample as in steps 2.3.2.5- 2.3.2.6. Perform scoring as in step 2.3.2.7.\nPerforming hematoxylin and eosin staining\n\t\nDewax to water with xylene for 20 min, replace with another round of fresh xylene for 20 min, followed by treating with anhydrous ethanol for 5 min, replace with another round of fresh anhydrous ethanol for 5 min, then add 90% ethanol by volume for 5 min, 80% ethanol by volume for 5 min, 70% ethanol by volume for 5 min, and finally distilled water for 5 min.\nImmerse the slide in hematoxylin staining solution for 3-8 min. Remove the slide and rinse off the stain with distilled water. Move it into the differentiation fluid (1% hydrochloric acid alcohol) for almost 30 s, so that the slide fades to pale blue. Rinse it with distilled water, and place in eosin staining solution for 1-3 min.\nDehydrate the slide with 95% ethanol volume fraction for 5 min, replace with another round of fresh 95% ethanol for 5 min, followed by anhydrous ethanol for 5 min, replace with another round of fresh anhydrous ethanol for 5 min.\nMake the slide transparent by adding xylene for 5 min, replace it with another round of fresh xylene for 5 min, and then seal it with neutral resin.\nTerminal-deoxynucleotidyl transferase-mediated nick end labeling (TUNEL) on cartilage\n\t\nDehydrate the cartilage sample in anhydrous ethanol, 90% ethanol, 85% ethanol and 75% ethanol until the dewaxing hydration is complete. Soak in PBS for 5 min. Add 3% H2O2 dropwise for 10 min.",
    "Add proteinase K working solution dropwise and digest at 37 °C for 10 min. Add 20 µL of labeling buffer per slice to keep it moist and shake off excess liquid after preparing the working solution. Add 20 µL of working solution to each slide and incubate for 2 h at 37 °C in a wet box.\nAdd 50 µL of the closure solution drop by drop and close for 30 min. Then add 50 µL of diluted biotinylated anti-digoxin antibody (1:100 dilution) dropwise and incubate at 37 °C for 2 h in a wet box. Add 10 µL of SABC antibody diluent (1:100 dilution) dropwise and incubate at 37 °C for 2 h in a wet box.\nAdd DAB color development solution (50 µL each of reagents A, B and C in 1000 µL of distilled water) dropwise for 10-15 min. The color development completes when it is brownish-yellow granular.\nRe-stain with hematoxylin for 3 s. After gradient dehydration and transparent treatment, dry at room temperature and seal the slide carefully with neutral gum. Pay attention to avoid leaving bubbles and overflowing glue.\nImmunohistochemical analysis of IL-1β and TNF-α\n\t\nDewax the slides routinely in xylene and hydrate them in gradient alcohol. Inactivate the endogenous peroxidase in the sections with 3% H2O2. Place the slide holder in 95 °C citrate buffer (pH 6.0) and incubate in a water bath above 95 °C for over 20 min. Take out the incubation box and leave it at room temperature for at least 20 min.",
    "Incubate 5% normal goat serum with PBS for 10 min at 37 °C and shake off excess liquid. Add 150 µL of antibody I drop by drop and let stand at 37 °C for 1 h, then store overnight at 4 °C. Next day, re-warm at 37 °C for 45 min.\nWash 3x with PBS for 5 min each. Cover the tissue on the slide with 3% BSA and seal it at 37 °C for 30 min. Add 150 µL of antibody II drop by drop and let stand at room temperature for 1 h. Wash 3x with PBS for 5 min each and add 150 pL of DAB color development liquid dropwise. Observe the degree of staining under the microscope until the sample becomes brownish-yellow even to the naked eye.\nImmediately, rinse with PBS for 10 min. Stain again with hematoxylin, dehydrate in gradient alcohol, make slides transparent in xylene, and seal with neutral gum.\nStatistical analysis\n\t\nImmunohistochemically stained sections with positive expression of the associated protein are yellow or brownish-yellow. Score the intensity of positive expression by Image J software for each group of immunohistochemical sections and use the evaluation criteria of average optical density (AOD), calculated by IOD divided by area.\nUse analysis software for statistical analysis. Use t-test if the data conformed to normal distribution and chi-square and use non-parametric test if they did not conform to normal distribution. Analyze repeated measurement data by generalized estimating equations.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}