{
  "id": 4738,
  "origin_website": "Bio",
  "title": "Complex <em>in vivo</em> Ligation Using Homologous Recombination and High-efficiency Plasmid Rescue from <em>Saccharomyces cerevisiae</em>",
  "procedures": [
    "To begin, oligonucleotides are designed that allow for the amplification of each of the necessary gene fragment(s), epitope or fluorescent protein tags, nutritional markers, and/or drug-resistance cassettes and their recombinational assembly in the desired order (Figure 1B). The latter objective is achieved by \"tails\" of homology [(typically 30 nucleotides (Baudin et al., 1993)] on each primer that permit the joining of each amplified fragment to its neighbors by HR. Overlap sequences of 30 nucleotides in the 5'-tail on the N-terminal-most fragment and in the 3'-tail of the C-terminal-most fragment with the corresponding flanking sequences in the plasmid DNA also suffice for recombinational insertion into the vector.The desired fragment sequences can be amplified using as the template either genomic or plasmid DNA (see step 3) as a template. For purified plasmid DNA from most commercial kits (see Materials and Reagents), less than 0.25 μl is required as template DNA; for chromosomal DNA, approximately 2-3 μl is recommended per 50 μL PCR reaction using standard genomic DNA preparations from yeast (Amberg et al., 2006). We have found that optimal production of PCR fragments with overhanging tails is achieved using a two-phase PCR procedure: 5 cycles at a lower annealing temperature, followed by 25 cycles at a higher annealing temperature. To determine the initial temp., the Tm (in °C) for the non-overhanging portion of each of the two primers is determined (for this purpose, we use an algorithm available on-line (http://www.basic.northwestern.edu/biotools/oligocalc.html[href=http://www.basic.northwestern.edu/biotools/oligocalc.html]) and the recommended initial annealing temperature is determined from the formula [(Tm forward + Tm reverse) / 2] - 5. To determine the second temp., Tm's for each of the full primers are determined and the same formula applied.",
    "Depending on the DNA polymerase, the sequences being amplified, the thermocycler, and even the tubes used, the PCR reactions may need to be optimized. The critical point is that a single clean PCR product of the expected length needs to be generated. Hence, a sample of the resulting PCR product should be examined on a DNA agarose gel to ensure (i) a product of the correct size was created and (ii) there are not multiple DNA bands corresponding to mispriming.If any sequence amplification used as the template a yeast-based plasmid propagated in E. coli, subsequent digestion with DpnI (New England Biolabs) allows for destruction of the methylated template DNA and virtually eliminates the recovery of potential false positives in those cases where a marker being selected in the constructed vector of interest is the same as that contained in the template DNA. Digestion with DpnI is performed at 37 °C overnight (no heat-inactivation required) directly in the PCR tube mixture (no buffer required).The desired yeast vector of interest (Figure 1B) should be digested with a single unique restriction endonuclease; this site should be downstream of any inserted fragment that is already present in the vector. One strategy includes cloning beforehand a promoter sequence (5’-UTR) into the desired yeast-based plasmid (we prefer CEN vectors). Digestion of the resulting vector on the 3’-end of the promoter should be performed using an appropriate restriction enzyme and incubated overnight. Note: This digested product does not have to be extracted or gel purified because even uncut vector will not yield any false positives whenever the marker for selection of the desired construct (e.g., hygromycin-resistance) is distinct from any marker in the parent plasmid (e.g.",
    ", URA3) (however, nonetheless, it might be prudent to ensure that the plasmid has indeed been linearized by running a small sample on an agarose gel).A yeast strain that results in efficient assembly and subsequent high yield of the desired plasmid DNA is SF838-1Dα (MATα ura3-52 leu2-3,122 his4-519 ade6 pep4-3 gal2) (Rothman and Stevens, 1986). However, for construction of plasmids in which HIS3 will be the selected marker (and not hygromycin-resistance), a derivative THS4218 (SF838-1Dα HIS4 his3Δ::HygR) is available. We have found that isolation of plasmids from strains of this background reproducibly results in higher plasmid yields and is more reliable than from other laboratory strains, including BY4741 (MATa leu2Δ ura3Δ met15Δ his3Δ) and its derivatives (Brachmann et al., 1998), especially when combined with ultra-chemically competent TOP10 bacterial transformation (see below).The yeast should be grown overnight to saturation in rich (YPD) medium at 30 °C, back-diluted to A600 nm ~0.25 in 10 ml of YPD and grown at 30 °C with shaking for roughly 4-5 h until A600 nm ~1. For each plasmid construction by this in vivo ligation procedure, a 10 ml culture of yeast is required. Hence, if multiple plasmid constructions are to be done in parallel, then commensurately more culture will be needed.Yeast should be collected by sedimentation in a clinical centrifuge for 5 min at 6,000 rpm and the YPD medium poured off. Resuspend the resulting pellet in 500 μl of sterile water with gentle pipetting and sediment again in a microfuge for 1 min at 6,000 rpm.For yeast transformation, a modified lithium acetate-based high-efficiency protocol should be used (Eckert-Boulet et al., 2012).",
    "For this purposed, remove the water with a pipet and resuspend the yeast pellet in 500 μl of sterile 100 mM lithium acetate solution and re-collect the cells for 1 min at 6,000 rpm and remove the supernatant solution and keep the yeast pellet.To each yeast pellet, add the following to the tube: 240 μl of 50% polyethylene glycol (PEG; autoclaved and sterile), 36 μl of sterile 1 M lithium acetate, 50 μl of 10 mg/ml single-stranded salmon sperm DNA (ssDNA in water). A high amount of ssDNA is included to (i) serve as an efficient carrier of the transformed DNA and (ii) the ssDNA is extremely viscous (and can clump into globs that resist transferring via micropipette) at concentrations of 10 mg/ml and therefore, a significant amount is lost in pipetting the solution into each tube (or a master mix solution). Therefore, to ensure that adequate ssDNA is included, we suggest the approximate amount of 50 μl with the understanding that some amount will be lost in solution preparation. Ingredients should be added in this order with the PEG solution added to the yeast first. Alternatively, should multiple transformations be performed at the same time, a “master mix” of the PEG, lithium acetate, and ssDNA can be mixed together and vortexed vigorously for 30 sec prior to adding to each yeast pellet. Two aspects of these reagents are important. First, the stock of salmon sperm DNA should be boiled for 10 min and cooled on ice for 10 min every time that it is used. Second, if the \"master mix\" is used, it must be made fresh for each experiment (it cannot be stored and reused).",
    "Add the appropriate DNA fragments (15-20 μl from each PCR reaction; the concentration will be dependent on the efficiency of the PCR reaction the length of the fragment, but generally this corresponds to roughly 3-5 μg of each PCR reaction) and cleaved vector (15-20 μl from the restriction enzyme digest; and approximately 2 μg total DNA content depending on the size of the parent vector being used) to the tube of lithium acetate- and PEG-treated yeast. Vortex the tube for 30 sec at maximum speed to resuspend the yeast into solution and incubate at exactly 42 °C for 45 min.Collect the yeast for 1 min at 6,000 rpm in a microfuge, remove the supernatant solution, and gently resuspend the yeast pellet in 550 μl sterile YPD medium and incubate overnight standing in a rack in a 30 °C incubator. This overnight incubation step is absolutely required for any constructs using a drug-resistance cassette (KanR, NatR or HygR); yeast require a sufficient amount of time to express the drug-resistance cassette and become resistant before they are challenged with the drug present in the selection medium. Standing overnight incubation, as opposed to aeration by shaking or rotation, allows for slow and largely anaerobic growth reducing the rate of production of CO2 and other volatiles, which, in our experience, can pop the lids off of standard Eppendorf tubes.Plate the full tube of yeast on the appropriate agar medium (YPD + drug, or synthetic drop-out medium), and incubate the plates for at least two days at 30 °C. Optional controls include transforming the same yeast strains with (i) only digested vector and/or (ii) only each PCR fragment-both of these should result in no plasmid constructs being generated and no growth on the selection plates.",
    "For recovery of plasmid DNA, scrape yeast off the plate (avoid agar)-use at least 25% of the surface area of the entire Petri dish (150 mm diameter dish; assuming there is a full lawn of coverage). Ideally, this high-efficiency in vivo ligation technique coupled with the high-efficiency yeast transformation should result in a complete lawn on the selective medium, although other factors (such as the complexity of the assembly) can reduce the final colony count. It is advised to only proceed with the protocol with constructs that resulted in ample coverage on the selection plate. If there are only single colonies on the initial selection plate, it is recommended to collect all of them and replate onto a fresh (selective) plate to grow up a sufficiently dense lawn of yeast for use in this protocol.The yeast scraped from the plate are resuspended in 500 μl of 1 M sorbitol, 0.1 M Na2EDTA (pH 7.5) (Amberg et al., 2006), briefly vortexed (maximum speed) to ensure full resuspension (expect that the solution will be very thick and concentrated), and then 5-7.5 μl of a stock (final concentration of 25 mg/ml in 50% glycerol) of Zymolyase 100T (stored at 4 °C) is added. After incubation at 37 °C on rotator for at least 1 h (but not more than 2 h), the resulting spheroplasts are collected at 12,000 rpm in a microfuge.After removal of the supernatant solution, the spheroplast pellet is resuspended in 250 μl of the proprietary bacterial plasmid isolation solution (see Materials and Reagents). Triturate by drawing the solution in and out of a pipet; at this point, the solution of lysed spheroplasts is extremely viscous and it takes significant effort to ensure very thorough resuspension.Add a roughly equal volume (roughly 100-250 μl) of glass beads (0.5 mm diameter).",
    "Briefly spin in microfuge at 2,000 rpm for 5 sec (to ensure all glass beads are mixed with the yeast solution rather than stuck to the walls of the tube). Vortex on maximum for 5 min (if you are doing multiple constructions in parallel, a vortexing adaptor that can house multiple tubes at once can be used).After completion of lysis by the glass bead breakage, proceed with the subsequent steps of your preferred commercial bacterial plasmid isolation protocol- for the Thermo Scientific system, add 250 μl of “Lysis buffer” and mix by inversion at least 10 times= and incubate at room temperature for 5 min. Add 350 μl of “Neutralization buffer” and mix by inversion at least 10 times immediately. Subject the resulting solution to centrifugation at maximum (13,200 rpm) in microfuge for 5 min.Transfer by pipetting the supernatant DNA-containing solution into a fresh, labeled tube and centrifuge at maximum speed for an additional 2 min (to remove any residual precipitate/cell debris). Transfer by pipetting the clarified supernatant solution into the plasmid-capturing spin column provided in the commercial bacterial plasmid isolation kit (see Materials and Reagents), centrifuge at maximum speed for 1 min and discard the flow-through.Wash the spin column with the commercial ethanol wash solution (500-750 μl), centrifuge at maximum speed for 1 min, and discard flow-through. Repeat (although this second wash step varies with the commercial plasmid prep kits and may be optional).",
    "To remove any residual wash solution, place the empty spin column in the microfuge and spin at maximum speed for 1 min, then place the spin column in a fresh Eppendorf tube and elute the bound DNA in the spin column by adding 25-30 μl of the “elution buffer” provided by the commercial supplier, incubating 1-2 min at room temperature, and then collecting the eluate by centrifugation at maximum speed for 2 min.To recover the desired constructed plasmid, a sample (10 μl) of the DNA-containing solution eluted from the spin column is gently mixed in a tube containing 100 μl of ultrachemically competent TOP10 bacterial cells (Materials and Reagents) that was taken from the -80 °C freezer and thawed on ice for ten minutes. After combining the DNA with the competent cells, the solution was left on ice for another ten min, then placed in a 42 °C water bath for 40 sec to subject the cells to a heat shock, returned to ice for two additional min, mixed with 500 μl of sterile SOC medium, and incubated on a rotator at 37 °C for 1 h.The resulting bacterial transformants (50-100 μl of the bacterial culture in SOC medium) are plated onto appropriate LB + drug (typically ampicillin or kanamycin) plates (prewarmed at 37 °C) and incubated at 37 °C overnight. Typically, 100-500 single colonies per plate grow out. Plasmid DNA from several representative single colonies are then isolated by standard molecular biology methods and tested using diagnostic PCR and DNA sequencing to ensure that the assembled gene fragments are all present and do not harbor any mutations or other alterations. This overall in vivo ligation process is so incredibly robust and efficient, it usually only requires 1-2 colonies to be analyzed to obtain the desired construct (see Notes).",
    "Important advice for avoiding pitfalls: Application of the above procedures for a multitude of different constructs (n > 1,000) over many years (a decade) indicates that the most common cause of any difficulty in successfully obtaining the desired constructs arises from the degree of sequence impurity in commercially purchased synthetic oligonucleotides. We have found that when mutations are observed, they reside in the junctions between gene fragments that correspond directly to the primer sequences used in the initial PCR amplifications. Thus, ensuring the high purity/quality/homogeneity of the initial oligonucleotide primers is critically important for maximizing the efficiency of this method of DNA assembly."
  ],
  "subjectAreas": [
    "Microbiology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}