{
  "id": 10399,
  "origin_website": "Jove",
  "title": "Biomechanical Testing of Murine Tendons",
  "procedures": [
    "Animal studies were approved by Columbia University Institutional Animal Care and Use Committee. Mice used in this study were of a C57BL/6J background and were purchased from The Jackson Laboratory (Bar Harbor, ME, USA). They were housed in pathogen-free barrier conditions and were provided food and water ad libitum.\n1. Development of custom-fit 3D printed fixtures for gripping bone\nBone image acquisition and 3D bone model construction\n\t\nDissect the bone of interest in preparation for 3D model creation and 3D bone grip printing; the humerus and the calcaneus are used as examples in the current protocol.\n\t\tNOTE: Detailed instructions to dissect bone-tendon-muscle specimens for mechanical testing are provided in step 2.1.1. The following steps should be followed to isolate bones for the purpose of creating 3D-printed bone grips.\n\t\t\nDissection of the humerus: Euthanize a mouse per IACUC-approved procedure. Remove upper extremity skin, remove all muscles over the humerus, disarticulate the elbow and glenohumeral joints, and carefully remove all connective tissues attached to the humerus.\nDissection of the calcaneus: Euthanize a mouse per IACUC-approved procedure. Remove lower extremity skin, disarticulate the Achilles tendon-calcaneus joint and joints between calcaneus and other foot bones, and carefully remove all connective tissues attached to the calcaneus.\nPerform a microcomputed tomography scan of the entire bone, e.g., scan the humerus and calcaneus samples.\n\t\tNOTE: Depending on the scanner used, the settings will be different. For the scanner used in the current study (Table of Materials), the recommended settings are: scan at an energy of 55 kVP, Al 0.25 filter, at a resolution of 6 μm.",
    "Mix agarose powder in ultrapure water and microwave for 1-3 min until the agarose is completely dissolved. It is helpful to microwave for 30-45 s, stop and swirl, and then continue towards a boil. Fill cryotubes up to three-quarters full with agarose. Let the agarose cool for about 5-10 min.\nInsert bone into the agarose gel (this will prevent movement artifacts during scanning). Insert a cryotube with bone into the scanner.\n\t\t\tNOTE: For the scanner used in the current study, a 16-position automatic sample changer was used for all scans. This scanner can automatically select magnification according to a sample’s size and shape. \nReconstruct microcomputed tomography scan projection images into cross-section images. Use recommended parameters for the experimenter’s scanner/software combination.\n\t\tNOTE: For the program used in the current study (Table of Materials) it is recommended to use the following reconstruction parameters: Smoothing: 0-2, Beam Hardening Correction: 45, Ring Artefact Reduction: 4-9 and to reconstruct slices in 16-bit TIFF format.\nCreate a 3D model and save into a standard STL format compatible with most 3D printers and rapid prototyping. For the program used in the current study (Table of Materials), do the following:\n\t\t\nSelect the command File > Open to open the file dataset. Open the dialog File > Preferences and select the Advanced tab.\nUse the adaptive rendering algorithm to construct the 3D models. This algorithm minimizes the number of facet triangles and provides smoother surface detail. Use 10 as the locality parameter; this parameter defines the distance in pixels to the neighboring point used for finding the object border. Minimize tolerance to 0.1 to decrease file size.\n\t\t\tNOTE: After opening the dataset, the images are shown in the “Raw Images” page.",
    "To specify the volume of interest (VOI), manually select two images to set as the top and bottom of the selected VOI range.\nMove to the second page, Region of Interest. Manually select the region of interest on a single cross section image.\n\t\t\tNOTE: The selected region will be highlighted in red (i.e., the humerus cross-sectional area).\nRepeat the previous step every 10–15 cross-section images.\nMove to the third page Binary Selection. On the histogram menu, click From Dataset. The histogram distribution of brightness from all images of the dataset will be shown. Also on the histogram menu, click the Create a 3D Model file menu.\nSave a 3D model of the bone in STL file format.\nRefine the mesh: Manipulate the mesh to reduce the size of the STL file and make it compatible with any solid modeling computer-aided design program. For the program used in the current study (Table of Materials), follow the steps below:\n\t\t\nImport mesh and select all to edit. Choose Reduce from the toolset Edit. Then, select Triangle Budget from the toolset Reduce Target. Reduce the Tri Count and accept changes. Resave the newly reduced file in STL format by choosing Export as…\nDesign of custom-fit bone fixtures\n\t\nSupraspinatus tendon-humeral bone\n\t\t\nUse a solid modeling computer-aided design program to create a custom-fit model of humerus gripping fixture (Figure 1, Supplemental Files).\n\t\t\tNOTE: The program used in the current study is listed in the Table of Materials.\nOpen the STL format file of the humerus bone in a solid modeling program and save as a part file.\n\t\t\tNOTE: For the software used in the current study (Table of Materials), the 3D bone object was saved in SLDPRT format.\nOpen the part file and manually create three anatomically relevant planes (i.e., sagittal, coronal, transverse).",
    "Manually define the sagittal plane to cut through the supraspinatus tendon attachment at the greater tuberosity. Ensure that the 3D block contains the sagittal plane as a plane of symmetry. To achieve this, add or cut material from the block if needed.\n\t\t\t\tNOTE: This plane of symmetry ensures that when the specimen is inserted into the fixtures the tendon and tendon attachment are located in the central axis of the fixture.\nMeasure dimensions of the bone along each of the three planes (i.e., height, width, length).\nMeasure the dimensions of the mechanical testing grips where the 3D printed fixture will be attached.\nBegin by designing a solid block part (e.g., a solid cylinder).\n\t\t\t\nEnsure that each dimension of the block is at least 5 mm greater than the dimensions of the humerus.\nAccount for design constraints from mechanical testing grips (i.e., ensure that the 3D printed fixture can be assembled and disassembled freely in the mechanical testing grips).\nCreate an assembly model with two components: the solid block and either the right or left humerus bone. Define the orientation of the bone within the block (i.e., the angle between the tendon and bone). Ensure that the entire bone volume fits inside the block.\nCreate a cavity in the block using the humerus bone as the mold. If using the software specified in the Table of Materials, follow the following steps:\n\t\t\t\nInsert the design part (humerus) and the mold base (cylinder block) into an interim assembly. In the assembly window, select the block, and click Edit Component from the Assembly toolbar.\nClick Insert > Features > Cavity. Select Uniform Scaling and enter 0% as the value to scale in all directions.\nSuppress the bone part and save the assembly as a part.",
    "Open part (cylinder with cavity). Cut the part along the sagittal plane to create two symmetrical components that fit the bone anteriorly and posteriorly (e.g., two half cylinders, as seen in Figure 1).\n\t\t\tNOTE: Two components are designed that fit the bone anteriorly and posteriorly. The anterior component includes a half spherical-shaped cavity extended from the anterior side of the humeral head up to the supraspinatus tendon attachment. The posterior component cavity is shaped like the posterior part of the humerus (i.e., posterior side of the humeral head, deltoid tuberosity, and medial and lateral epicondyle).\nSave each component as a separate file part.\nFor the anterior component, ensure that the humeral head is embedded in the cavity of the part by defining appropriate tolerances.\n\t\t\tNOTE: In the current study, using the software specified in the Table of Materials, it is suggested to follow the steps below:\n\t\t\t\nCreate a revolved cut to smooth the mesh geometry of the cavity. Create a sketch for the cut by emulating the cavity geometry and adding a locational clearance.\n\t\t\t\tNOTE: The clearance allows for free assembly and disassembly between the bone and the anterior component.\nModify the posterior component to imitate the cavity geometry to create a cut that adds clearance, as described above for the anterior component.\nMake a cut in the transverse plane starting from the top of the posterior component up to the crest of the greater/lesser tubercle.\n\t\t\tNOTE: As seen in Figure 1 and Figure 2, the posterior component includes a cut that creates an opening at the tendon attachment.\nCreate a snug fit between the two components to allow for free assembly and disassembly.\n\t\t\tNOTE: A hole-shaft fit with a loose running clearance was created for the fixtures in the current study.",
    "Create 3D mirror models for each component of the fixture for the opposite limb (i.e., left or right).\nAdd an etch on the bottom of the fixtures to distinguish between the left and right sides.\nSave all fixture parts in STL standard file format in preparation for 3D printing.\nAchilles tendon-calcaneus bone\n\t\t\nFollow the same steps as described above for supraspinatus-humeral head fixture.\n\t\t\tNOTE: Only one set of fixtures is necessary for the Achilles-calcaneal, since the anatomy of the left and right calcaneus bones is nearly symmetrical.\n2. Biomechanical testing of murine tendons\nSpecimen preparation and cross-sectional area measurement\n\t\nDissect the muscle-tendon-bone of interest in preparation for tensile mechanical testing. In the current study, supraspinatus muscle - tendon - humerus bone specimens (N=10, 5 male, 5 female) and gastrocnemius muscle - Achilles tendon-calcaneus bone specimens (N=12, 6 male, 6 female) were isolated from 8 week old C57BL/6J mice.\n\t\t\nDissection of the supraspinatus muscle - tendon - humerus bone specimen\n\t\t\t\nEuthanize a mouse per IACUC-approved procedure. Position the mouse in a prone position. Make an incision in the skin from above the elbow of the forepaw towards the shoulder.\nCarefully remove the skin with blunt dissection so that the musculature of the shoulder is visible. Remove the tissue surrounding the humerus until the bone is exposed and can be held securely with forceps.\nHold the humerus with forceps and carefully remove the deltoid and trapezius muscles to expose the coracoacromial arch. Identify the acromioclavicular joint and carefully separate the clavicle from the acromion with a scalpel blade.",
    "Taking care not to damage the supraspinatus tendon and its bony attachment, remove the muscle from its scapular attachment using a scalpel blade. Taking care not to damage the supraspinatus tendon and its bony attachment, detach the humeral head from the glenoid; using a scalpel blade, lacerate the joint capsule and the infraspinatus, subscapularis, and teres minor tendons.\nDisarticulate the elbow joint to separate the humerus from the ulna and radius. Isolate the humerus - supraspinatus tendon - muscle specimen and clean off excess soft tissues on the humerus and humeral head.\nDissection of the Achilles tendon - calcaneus bone sample\n\t\t\t\nEuthanize a mouse per IACUC-approved procedure. Position the mouse in a prone position. Taking care not to damage the Achilles tendon and its bony attachment, remove the skin with blunt dissection so that the musculature around the ankle and knee joints is exposed.\nUsing a scalpel blade, starting at the Achilles tendon - calcaneus attachment, carefully detach the gastrocnemius muscle from its proximal attachments.\nCarefully disarticulate the calcaneus from the various adjacent bones. Isolate the Achilles tendon - calcaneus specimen and clean off excess soft tissues.\nDetermine the cross-sectional area of the tendon using microcomputed tomography.\n\t\tNOTE: For the scanner used in the current study (Table of Materials), the recommended settings are: scan at an energy of 55 kVP, Al 0.25 filter, at a resolution of 5 μm.\n\t\t\nMix agarose powder in ultrapure water and microwave for 1-3 min until the agarose is completely dissolved. It is helpful to microwave for 30-45 s, stop and swirl, and then continue towards a boil. Fill cryotubes up to three-quarters full with agarose. Let the agarose cool for about 5-10 min.\nSuspend the specimen in the cryotube by inserting the bone upside down.",
    "NOTE: Only the bone should be in the agarose gel. The tendon and muscle should be suspended outside.\nAfter the scan, gently remove muscle from tendon using scalpel blade. Insert the specimen into the 3D-printed fixture.\n\t\tNOTE: The grips are reusable for each test. Do not use glue or epoxy in the fixture; the bone is held in a press fit.\nInsert and glue the tendon between a folded thin tissue paper (2 cm x 1 cm) and clamp the construct using thin film grips. Attach the 3D printed fixture with the specimen into the testing grips.\nInsert the sample and the grips into a testing bath of phosphate buffered saline (PBS) at 37 °C (i.e., mouse body temperature23).\nTensile testing\n\t\nPerform tensile mechanical test on a material testing frame.\n\t\tNOTE: For the testing frame used in the current study (Table of Materials), the recommended protocol is:\n\t\t\nDefine the gauge length as the distance from the tendon attachment to the upper grip.\nPrecondition with 5 cycles between 0.05 N and 0.2 N.\nHold for 120 s.\nUse a tension to failure of 0.2%/s.\nCollect load-deformation data.\nCalculate the strain as the displacement relative to the initial gauge length of the tendon.\nCalculate the stress as the force divided by the initial tendon cross-sectional area (as measured from microCT).\nIf interested in viscoelastic behavior, perform a stress relaxation prior to the tension test to failure and use the data to calculate parameters such as A, B, C, tau1, and tau2 from the quasilinear viscoelastic model24.\nFrom the load deformation curve, calculate the stiffness (slope of linear portion of curve), the maximum force, and the work to yield (the area under the curve up to yield force).",
    "Identify the linear portion by choosing a window of points in the load-deformation curve that maximizes the R2 value for a linear least squares regression25.\nDetermine the stiffness as the slope of the linear portion of the load-displacement curve25,26.\nFrom the stress strain curve, calculate the modulus (slope of linear portion of curve), the strength (maximum stress), and the resilience (area under the curve up to yield stress).\n\t\tNOTE: Using the RANSAC algorithm, the yield strain (x-value) is defined as the first point when the y-fit has deviated more than 0.5% of the expected stress value (y-value). Yield stress is the corresponding y-value of the yield strain.\n\t\tNOTE: In addition to the monotonic tensile loading to failure described in the current study, cyclic loading can provide important information about tendon fatigue and/or viscoelastic properties. For example, Freedman et al. reported fatigue properties of the murine Achilles tendons27.\nAfter completion of tensile testing, perform a microcomputed tomography scan of the entire bone, e.g., scan the humerus and calcaneus samples.\n\t\tNOTE: For the scanner used in the current study (Table of Materials), the recommended settings are: scan at an energy of 55 kVP, Al 0.25 filter, at a resolution of 6 μm.\n\t\t\nRepeat steps 1.1.2.1–1.1.2.2.\nRepeat step 1.1.3.\nUse a 3D visualization program compatible with the scanner to create a volume-rendered 3D model of the scanned object.\n\t\tNOTE: The program used in the current study is listed in the Table of Materials.\nDetermine the failure mode and failure site area by inspecting the 3D object.\nStatistical analysis: Show all sample results as mean ± standard deviation (SD). Make comparisons between groups using student’s t-tests (two-tailed and unpaired). Set significance as p < 0.05.\n\tNOTE: The statistical software used in the current study is listed in the Table of Materials.",
    "Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}