{
  "id": 10310,
  "origin_website": "Jove",
  "title": "Characterization of Intra-Cartilage Transport Properties of Cationic Peptide Carriers",
  "procedures": [
    "University approvals were obtained for conducting the experiments with dead tissues. Bovine joints were obtained commercially from a slaughterhouse.\n1. Cartilage explant extraction\nUsing a scalpel (#10 blade), cut and remove fat, muscles, ligaments, tendons and all other connective tissue to expose the cartilage from the femoropatellar groove of bovine knee joints.\nUsing 3 mm and 6 mm dermal punches, make perpendicular punches into the cartilage to extract cylindrical plugs. Immediately place the plugs in individual wells of a 48-well plate containing 500 μL of 1x phosphate buffered saline (PBS) supplemented with 1% v/v antibiotic-antimycotic.\nPlace the superficial side of a cartilage plug facing down into a well in the slicing fixture (Figure 2). Using a razor blade, slice the plug along the surface of the slicing fixture to obtain a 1 mm thick cartilage explant that is inclusive of the superficial zone. Repeat for each cartilage plug.\nStore cartilage explants individually in polypropylene tubes containing 500 μL of 1x PBS supplemented with protease inhibitors (PBS-PI, 1 PI mini-tablet per 50 mL 1x PBS) at -20 °C.\nPrior to conducting each of the following transport experiments, thaw the explant-containing vials for 30 min in a 37 °C water bath.\nimgsrc://cloudfront.jove.com/files/ftp_upload/61340/61340fig02.jpg\nFigure 2: Custom-designed slicing fixture. Design parameters of stainless steel slicing fixture used for slicing cartilage explants of 3 and 6 mm diameter. Plastic inserts of varying thickness were placed inside wells to adjust the thickness of sliced explants. Stainless steel cylindrical pin of <1 mm diameter was used to push explant out of fixture. All numerical values are presented in mm. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/61340/61340fig02large.jpg]\n2. Equilibrium uptake of CPCs in cartilage",
    "Gently dab cartilage explants (3 mm dia. X 1 mm thick.) with a delicate task wipe to remove excess 1x PBS from the explant surface. Using a balance, quickly record the wet weight of each explant and then immediately place in a 1x PBS bath to prevent dehydration.\nPrepare 30 μM solutions (300 μL per explant) of fluorescently labeled CPCs in 1x PBS-PI. Use RNase-free polypropylene tubes for reconstitution.\nIn a 96-well plate, pipette 300 μL of each 30 μM CPC solution into separate wells. Avoid using wells near the edge of the plate to prevent evaporation. Using a spatula, transfer each explant to the solution containing wells.\nFill surrounding wells with 300 μL of 1x PBS and cover the well plate with lid. Seal the edges of the plate with flexible film to minimize evaporation.\nInside of a 37 °C incubator, place the plate on a plate shaker to limit the particle sedimentation. Incubate for 24 h under gentle rotation (50 rpm with a 15 mm orbit) to allow for the equilibrium uptake of CPCs in the cartilage (Figure 3).\nGenerate a standard curve for correlation of fluorescence to CPC concentration\n\t\nPrepare serial dilutions of CPC solutions from 30 μM – 0 μM (10 2-fold dilutions) in 1x PBS-PI in polypropylene tubes. Ensure that at least 500 μL of each dilution is present.\nAdd 200 μL of each dilution to consecutive wells in a black 96-well plate. Duplicate in another row to increase sample size.\nObtain fluorescence readings of each sample using a plate reader at the excitation and emission wavelengths of the fluorescent label using a plate reader.\nPlot fluorescence reading vs. CPC concentration and derive an equation for the linear portion of the curve.",
    "NOTE: To limit the variability in fluorescence readings, incubate the CPC stock solution under the same conditions as the sample plate prior to generation of the standard curve.\nAfter 24 h of incubation, collect the equilibrium bath from each well in separate polypropylene tubes.\nTransfer 200 μL of each solution into separate wells of a black 96-well plate. Obtain fluorescence readings of each sample under the same fluorescent settings as for the standard curve. If necessary, dilute the sample in 1x PBS-PI to ensure readings fall within the linear portion of the standard curve.\nimgsrc://cloudfront.jove.com/files/ftp_upload/61340/61340fig03.jpg\nFigure 3: Schematic of equilibrium uptake experiments. Cartilage explants (3 mm dia. x 1 mm thick) were placed in individuals wells in a 96-well plate containing fluorescently tagged CPC solution. After 24 h CPCs were uptaken by the cartilage, thereby reducing the fluorescence of the surrounding bath. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/61340/61340fig03large.jpg]\n3. Depth of penetration of CPCs in the cartilage\nPrepare 30 μM solutions (300 μL per explant) of fluorescently labeled CPCs in 1x PBS-PI. Use RNase-free polypropylene tubes for reconstitution.\nUsing a scalpel, cut cartilage explants (6 mm diameter x 1 mm thickness) in half to make half-disks. Keep the explant hydrated with a layer of 1x PBS-PI while cutting.\nGlue a half-disk explant into the middle of one well of the custom-designed 1-dimensional transport chamber using an epoxy (Figure 4, Figure 5). Ensure epoxy is applied to the circumferential (curved) side of the explant. Remove excess glue from the well to prevent contact with the diffusion surface area of cartilage and make a note of the superficial side of the explant.",
    "Add 80 μL of 1x PBS-PI to both sides of the explant. Pipette the liquid up and down from one side of the explant to check for leakage to the other side. If leakage occurs, readjust explant and apply epoxy as needed.\nReplace the 1x PBS-PI from the side facing the superficial surface of cartilage (upstream) with 80 μL of 30 μM CPC solution. Maintain 80 μL of 1x PBS-PI on the side facing the deep zone of cartilage (downstream).\nCarefully place the transport chamber in a coverable container. Cover the base of the container with a layer 1x PBS to avoid evaporation of solutions. Ensure that there is no direct contact between solutions from upstream and downstream chambers.\nPlace the covered container on a plate shaker to limit particle sedimentation. Incubate for either 4 or 24 h at room temperature under gentle rotation (50 rpm with a 15 mm orbit).\nAfter incubation, remove the explant from chamber and cut ~100 μm slice from the center of the explant.\n\tNOTE: This cross-section is inclusive of the superficial, middle and deep zones of cartilage.\nPlace the slice between a glass slide and a coverslip. Hydrate the slice with a layer of 1x PBS-PI.\nAt 10x magnification, image through the full thickness of the slice to obtain z-stack of fluorescent images using a confocal microscope.\nUsing ImageJ project the average intensity of the images within the z-stack to determine the depth of penetration of CPCs in cartilage.\n\t\nOpen the image stack by clicking on File | Open.\nClick on ‘Image’ on the task bar and click Image | Stacks | Z Project from the dropdown menu.\nInput slice numbers from 1 to the final slice. Select ‘Average Intensity’ under Projection Type. Click ‘OK.’\nimgsrc://cloudfront.jove.com/files/ftp_upload/61340/61340fig04.jpg",
    "Figure 4: Custom-designed 1-D transport chamber. Design parameters of PMMA 1D transport chamber with 6 individual wells. All numerical values are presented in mm. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/61340/61340fig04large.jpg]\nimgsrc://cloudfront.jove.com/files/ftp_upload/61340/61340fig05.jpg\nFigure 5: Schematic of depth of penetration studies. Cartilage explants (6 mm diameter x 1 mm thickness) were cut in half and fixed to the center of 1-D diffusive transport wells. Fluorescently tagged CPC solution was added to the side of the well in contact with the superficial zone (SZ) of cartilage. 1x PBS-PI was added to the side of the well in contact with the deep zone (DZ) of cartilage. Following diffusion, a cross-section of cartilage (3 mm x 1 mm) was imaged using confocal microscopy. This figure has been modified from Vedadghavami et al.4 and Bajpayee et al.3 Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/61340/61340fig05large.jpg]\n4. Non-equilibrium diffusion rate of CPCs in the cartilage\nBring the two halves of the custom-designed transport chamber (Figure 6) together to assemble and close the chamber. Use washers, nuts and bolts to tightly close the chamber with a wrench.\n\tNOTE: The transport chamber must be translucent as to not interfere with fluorescent readings. The transport chambers used in this protocol are made from polymethylmethacrylate (PMMA).\nCoat the inner space of the chamber with 0.5% w/v non-fat bovine milk solution in 1x PBS (2 mL for each chamber) for 15 min to prevent non-specific binding of CPCs to chamber walls. Then rinse the chamber with 1x PBS (2 mL for each chamber).\nUsing the custom-designed slicing fixture (Figure 2) and a razor blade, slice a 6 mm diameter cartilage explant (transverse plane) to a thickness of 500-800 μm, inclusive of the superficial zone. Keep the explant hydrated with 1x PBS.",
    "Using hammer-driven and dermal punches, create gaskets from rubber sheets as shown in Figure 7.\nAssemble each half transport chamber to include 1 large rubber gasket, 1 PMMA insert and 1 small rubber gasket each. Place the explant in the wells of the plastic insert, with the superficial zone facing the upstream chamber. Sandwich the two halves together to complete the assembly and screw tightly using a wrench (Figure 7).\nFill the upstream chamber with 2 mL of 1x PBS-PI and observe the downstream chamber for leakage of fluid from the upstream chamber. If leakage is present, reassemble the chamber, adjusting gasket position and tightness of screws. If no leakage, fill the downstream chamber with 2 mL 1x PBS-PI as well.\nAdd a mini-stir bar to both up and downstream chambers and place the chamber on a stir plate. Align the chamber so that laser from the spectrophotometer is focused towards the center of the downstream chamber. Place the signal receiver portion of the spectrophotometer behind the downstream chamber (Figure 8).\n\tNOTE: The laser and receiver of the spectrophotometer must be equipped with the appropriate filters to excite, emit and transmit signals from the fluorescently labeled protein. Protect the transport chamber from light using a black box during experimentation to avoid interference in fluorescence signal. It is best practice to seal the openings on top of the chamber with flexible film to avoid evaporation.\nCollect real-time downstream fluorescence emission readings and ensure a stable signal for at least 5 min.\n\tNOTE: Aliquots from the downstream chamber can be obtained and assessed for fluorescence using a plate reader if a custom-designed spectrophotometer or translucent transport chamber is not available.",
    "Pipette a pre-calculated volume of stock solution of fluorescently tagged CPCs into the upstream chamber to ensure a final concentration of 3 μM inside the upstream chamber. Observe the downstream fluorescence signal and allow for solute transport to reach a steady increase in slope.\n\tNOTE: A thicker cartilage explant will require longer time to reach steady-state.\nOnce the steady state has been reached, take 20 μL from the upstream chamber and add to the downstream chamber (“spike test”).\n\tNOTE: A spike in the downstream fluorescence will be observed. This will allow for correlation between fluorescence readings and CPC concentration.\nCollect real-time downstream fluorescence readings.\nimgsrc://cloudfront.jove.com/files/ftp_upload/61340/61340fig06.jpg\nFigure 6: Custom-designed non-equilibrium diffusion transport chamber. Design parameters of PMMA non-equilibrium diffusion transport chamber. The chamber must be translucent as to not interfere with fluorescence readings. The complete transport chamber consisted of two identical halves of the fixture shown. Two cylindrical stainless-steel pins (~2.94 mm diameter, ~18 mm long) were required to ensure alignment and complete closure of the halves of the chamber. Four identical slots for 6-32 thread screws were made in each corner of the chamber for screw tight assembly. All numerical values are presented in millimeters. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/61340/61340fig06large.jpg]\nimgsrc://cloudfront.jove.com/files/ftp_upload/61340/61340fig07.jpg\nFigure 7: Assembly of non-equilibrium diffusion transport chamber. Design parameters of (A) black PMMA inserts and (B) large and small rubber gaskets. Thickness of rubber gaskets was adjusted to ensure tight closure of the chamber. All numerical values are presented in mm. (C) Schematic showing the order of assembly for two halves of transport chamber with cartilage explant placed in the center. SZ indicates superficial zone of cartilage which was facing the upstream chamber. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/61340/61340fig07large.jpg]\nimgsrc://cloudfront.jove.com/files/ftp_upload/61340/61340fig08.jpg",
    "Figure 8: Schematic of non-equilibrium diffusion experiments. Cartilage explants (6 mm diameter x 1 mm thickness) were placed in the center of the transport chamber with the superficial surface facing the upstream chamber. Both up and downstream sides of the chamber were filled with 1x PBS-PI and mixed using a mini stir bar. With a laser pointed towards the downstream chamber to collect fluorescent readings, fluorescently tagged CPC solution was added to the upstream chamber. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/61340/61340fig08large.jpg]Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}