{
  "id": 7581,
  "origin_website": "Bio",
  "title": "Single Molecule Tracking Nanoscopy Extended to Two Colors with MTT2col for the Analysis of Cell-Cell Interactions in Leukemia",
  "procedures": [
    "imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4390/bioprotoc-12-08-4390-g001.jpgFigure 1. Overview of the experiment. (A) Steps of the experimental procedure: preparation, acquisition, and data analysis. (B) Of note, labeling molecules of interest can be performed by a broad range of strategies.Cell preparation 24 h or 48 h before videonanoscopy Pass MS5 cells (adherent): spread in a 1-cm2 area Ibidi glass-bottom well at 30,000 cells in a 300-µL culture volume overnight. This cell density allows reaching about 50% confluence (about 50,000 cells) the day of the experiment, according to DSMZ guidelines. Of note, glass-bottom wells may need specific treatment, such as extracellular matrix coating, for proper adhesion of some cell lines.Pass KG1 cells (in suspension) at the appropriate culture density, between 100,000 and 1,000,000 cells/mL, according to ATCC guidelines.Incubate the cultures in a 37°C 5% CO2 air humidified incubator.If using other types of chamber, they must have a glass bottom to allow fluorescence imaging, and cell numbers should be adjusted to the area.Immunofluorescence staining of MS5 cells (Figure 1) Dilute the primary and secondary antibodies in 100 µL of fresh cell culture medium, according to the determined optimal concentration. The optimal antibody concentration gives the best staining with minimum background. It is determined by using a series of dilutions in a titration experiment: 10 nM for anti-JAM-B 829 and for Alexa Fluor 488 conjugated anti-rabbit antibodies (or equivalent, such as quantum-dot conjugated antibodies) in IMDM supplemented with serum, which is necessary to saturate and limit non-specific binding.Aspirate the culture medium from the well of the live cells to be stained and add 100 µL of the medium containing the diluted antibody directly to the well.Incubate the cells at room temperature for 10 min.Aspirate the supernatant and gently wash the cells twice with HBSS with 1% HEPES (or fresh culture medium—to limit autofluorescence, use culture medium without phenol red).",
    "Immunofluorescence staining of KG1 cells Dilute the primary antibody, blocking or not, and secondary antibody in 100 µL of fresh cell culture medium, according to the determined optimal concentration: 10 nM for anti-JAM-C (blocking: mouse RnD 208206, non-blocking: homemade rat 19H36), and for Alexa Fluor 594 conjugated anti-mouse (or equivalent, such as quantum-dot conjugated antibodies) in supplemented IMDM.Determine the total number of cells and percent of cell viability using a hemocytometer: mix 0.4% trypan blue with the cell suspension, in a 1:1 proportion (or in other proportions, using the appropriate dilution factor for your calculations). Thoroughly mix the two solutions and pipette 20 µL of this mix into one hemocytometer chamber. Place the hemocytometer under the microscope. Count the unstained (live) and stained (dead) cells (according to the datasheet of the hemocytometer used). Multiply the total number of live cells by two (or by the appropriate dilution factor, if using a different dilution for trypan blue).Pipette the appropriate volume to have either 50,000 cells (low density: as many as MS5 cells to image one KG1 cell per field of view, allowing cell by cell measurement) or 500,000 cells (high density: 10 times more than MS5 cells, to image several KG1 cells per field of view, enabling more statistics per video).Transfer the cells to a 1.5-mL Eppendorf tube.Briefly centrifuge at 88 × g for 3 min.Resuspend in 1 mL of medium and saturate with 10% rabbit serum, in a 5% CO2 incubator at 37°C for 60 min.Briefly centrifuge at 88 × g for 3 min.Resuspend in 100 µL of medium containing the diluted antibodies (see step 1).Incubate the cells at room temperature for 10 min.",
    "Briefly centrifuge at 88 × g for 3 min, aspirate the supernatant, and gently wash the cells twice with 1 mL of HBSS with 1% HEPES (or fresh culture medium without phenol red). Resuspend the cell pellet in 200 µL of HBSS with 1% HEPES.Remove the supernatant from the MS5 cells, and add the 200 µL of KG1 cell suspension.Examine the cells using a spinning disc fluorescence microscope with a thermostated incubator set to 37°C, and appropriate filters (see Equipment, items 7 to 15). Cells should be imaged immediately after staining, to limit endocytosis (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4390/bioprotoc-12-08-4390-g002.jpgFigure 2. Representative videonanoscopy acquisition and MTT2col trajectory maps. (A) First image of a videonanoscopy acquisition, with the two colors combined into an RGB image. JAM-B staining on MS5 cells is in the green channel, and JAM-C staining on the KG1 cell is in the magenta channel. (B) Maximum projection of the video. (C) JAM-B and JAM-C single molecule trajectories are represented by green and magenta gradients, respectively, according to time, and superimposed on the transmission image of the cells (right). Inserts show magnifications of the framed areas around a leukemic KG1 cell. Spatiotemporal colocalizations are denoted by white circles, with a size proportional to duration. Several concentric circles correspond to successive colocalization events at nearby locations.Representative videos can be seen from the supplementary data of the related article (Gorshkova et al., 2021).Performing acquisitions on a confocal microscope Create a folder, usually named with the date and a brief description of the experiment.Select a field of view with KG1 cells on top of spread MS5 cells.First, acquire a brightfield image that allows for further checking of cellular aspects and spatial limitations (as used, in combination with all trajectories, in Figure 2C).",
    "Save this image using the same name as the video (time-stack), in a subfolder named “trans”. With this convention, the algorithm can automatically find the matching brightfield image for each stack.Next, acquire one (or several) video (time-stack), typically at a 36-ms or 100-ms rate. Save the video file in the folder created for the experiment, as either tif or stk file format. For each video, 300 frames were usually acquired (see Figure 2A for an example). Video rate and length may be adapted for a given experiment. For instance, an experiment may require faster video rate or longer trajectories.Last, optionally, acquire a z-stack ranging over the entire height of both MS5 and KG1 cells (typically more than 10 µm). Save the z-stack in a subfolder named ‘z’.Repeat steps 2–5 as many times as needed. Cells should be kept less than an hour in HBSS with 1% HEPES."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Biophysics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}