{
  "id": 11094,
  "origin_website": "Jove",
  "title": "Short Session High Intensity Interval Training and Treadmill Assessment in Aged Mice",
  "procedures": [
    "All studies and experimental protocols were approved by and in compliance with guidelines of the University at Buffalo and VA Western New York Animal Care and Use Committees.\n1. Experiment Setup and General Advice\nNOTE: A total of twenty-four female mice on a C57BL/6J background were used in this protocol starting at 23 months of age. The mice carried a conditional SIRTloxp-exon4-loxp mutation29, however, this was not induced in this experiment.\nEnsure that mice receive permanent identifiers such as ear tags, RFID chips, or tail tattoos.\nNOTE: It is recommended to also use temporary markings (e.g., permanent marker to mark tails) for quick identification during assessment periods.\nClean the treadmill with 0.25-0.5% bleach (v/v) or 70% (v/v) ethanol at the end of the day or to remove feces or urine between experimental trials. Dry solutions completely before initiating a new trial.\nNOTE: Ethanol may increase wear to the treadmill belt. It is recommended that the treadmill be cleaned between each run if working with group-housed male mice in order to minimize in cage fighting. It is recommended to perform treadmill assessments at the same time of day at each time point in longitudinal studies30,31,32, and if other assessments are being performed, the order should remain the same. The investigator running the experiment should also be blind to the group designations of the mice.\n2. Acclimatizing Mice to Treadmill Apparatus\nNOTE: Initiate acclimatization of mice 1 month prior to baseline experiments.\nSet up the initial training program using the treadmill software (v3.4.7) in Manual mode (Figure 1 and Table 1).\nOpen the treadmill software. Then, click on the file and open the experiment.\nInput the values indicated in Table 1 on the Manual tab (Figure 1) under Acclimation.",
    "Input the session number as 1, the number of active channels as 1 to 6 depending on the number of mice, the number of visits to the grid as 10, and the number of shocks as 20.\nNOTE: Shock intensity for this initial run is set at level 1 (0.46 mA).\nSet the inclination of the treadmill to 0° (flat).\nHold mice by the tail when placing in the treadmill and place mice directly on the belt to avoid starting mice on the shock grid.\nUse a brush or tongue depressor to keep mice away from the shock grid when training or assessment begins. Nudge mice to begin running to avoid unintended shocks.\nAfter each mouse is given the initial training program, repeat the program as above with the shock intensity increased to level 2 (0.59 mA) with at least 15 min between trainings.\nOne to two days after the initial training program administer the uphill treadmill acclimatization.\nOpen the treadmill software. Then click on the file and then open the experiment.\nInput the values on the Basic tab as indicated in Table 2 under Acclimation.\nUnder Shock Detection, input the session number as 1, the number of active channels as 1 to 6 depending on the number of mice, the number of visits to the grid as 10, and the number of shocks as 20.\nClick on the Profile Mode tab (Figure 2) and for Step 1, input a start speed of 0 m/min and an end speed of 5 m/min with a period of 5 s.\n\t\t\nAdd a warm up step 2 with a start speed of 5 m/min and end speed of 5 m/min for 30 seconds. Add a transition step that starts at 5 m/min and an end speed of 6 m/min for 5 s.",
    "Add a test speed step that starts at 6 m/min and ends at 6 m/min for 20 s. Add a transition step that starts at 6 m/min and ends at 5 m/min.\nAdd a recovery interval that starts at 5 m/min and ends at 5 m/min for 20 s (Figure 2).\nRepeat step 2.6.4 to add test speed steps as indicated in Table 2 under acclimation.\nTwo weeks prior to baseline assessments, continue acclimatization by providing two treadmill flat aerobic capacity assessments as described in section 3, given on consecutive days.\nOne to two days after the second endurance training, provide two treadmill uphill anaerobic capacity assessments as described in section 4, given on the same day with a minimum of 30 min between trainings.\n3. Flat Continuous Treadmill Assessment\nCreate a treadmill program as described in step 2.1, using values indicated in Table 1 under Assessment. Under Shock Detection, set the session number as 1, the number of active channels as 1 to 6 depending on the number of mice, the number of visits to the grid as 10, and the number of shocks as 20.\nMonitor the mice throughout the trial and remove mice from the instrument that reach the endpoint criteria.\nNOTE: This step is to avoid mice inadvertently touching the shock grid of neighboring mice and affecting data. Parameters include the total time on belt, the distance travelled, and the shocks to visits ratio. It is recommended to perform two assessments at each time point, separated by at least one day between assessments.\n4. Uphill Interval Treadmill Assessment",
    "Create a treadmill program as described in step 2.6, using values indicated in Table 2 under Assessment. Under Shock Detection, set the session number as 1, the number of active channels as 1 to 6 depending on the number of mice, the number of visits to the grid as 5, and the number of shocks as 10.\nSet the interval field in the treadmill program to 0.5.\nNOTE: This allows for data points to be collected every second instead of every minute, which aids in identifying the speed at endpoint for each mouse. The program will automatically stop after the 50 m/min stage due to software limitations. Parameters include the time on belt, the distance travelled, and the test speed of the last successfully completed stage before endpoint. The latter is used for determining baseline intensity for the HIIT regimen described in step 5. It is recommended to perform two assessments per time point, separated by at least 30 min.\n5. Short session High Intensity Interval Training\nSet the treadmill uphill (25°) and remove the plastic cover.\nDetermine the intensity for each mouse. Use the speed of the last successfully completed stage (Step 4.5) and find the intensity group and corresponding Base, Sprint, and Dash speeds using Table 3.\nOpen the treadmill software and click on file to create a new program.\nClick on the Profile Mode tab and for Step 1, input a start speed of 0 m/min and an end speed as indicated under Base speed as indicated in Table 3 with a period of 5 s.\nAdd a warm up step 2 with a start speed at Base speed and end speed at Base speed for 180 s.",
    "Input 3 intervals each with 1) a transition step that goes from Base to Sprint for 5 s, 2) an step at Sprint speed for 60s, 3) a transition step that goes from “sprint” to Base over 5 s, and 4) a step for a recovery interval at Base speed for 60 s.\nAdd a transition step that goes from Base to Sprint speed over 5 s and a final step that goes from Sprint to Dash speed over 60 s.\nNOTE: Programs can be saved, modified, and reloaded.\nPerform exercise three days a week with at least one day of rest between sessions (i.e., Monday, Wednesday, Friday).\nRewrite exercise programs to increase Base, Sprint, and Dash speeds 1 m/min every two weeks.\nNOTE: No electric shocks are given during the exercise.\nMotivate mice to run using a makeup brush (recommended) or tongue depressor to lightly motivate mice that fall near or on the shock grid. If a mouse does not respond retry in 5 s, then 10 s, and then retry every 30 s or during a recovery interval until the end of the session.\nNOTE: consider removing mice from the study that do not run on the treadmill at any intensity or are unable to complete the first three intervals at the intensity defined for the lowest intensity group (Table 3)\nMove mice that cannot be motivated to complete the first three intervals in two consecutive exercise sessions to lower intensity groups (Table 3).\nMove mice that do not require motivation in two consecutive exercise sessions to higher intensity groups (Table 3).\nTake sedentary control mice in cages place beside the treadmill as it runs. Alternatively, sedentary controls can be placed in the lanes of a non-moving treadmill for 10 min.",
    "Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}