{
  "id": 2500,
  "origin_website": "Cell",
  "title": "Endogenous protein interactomes resolved through immunoprecipitation-coupled quantitative proteomics in cell lines",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nIP of proteins\nTiming: 2–3 days\nIP of proteins can be broken down into three major steps including conjugating the antibody to beads (typically Protein Sepharose G beads or magnetic beads), generating a protein lysate, and the IP in which the antibody-conjugated beads are incubated with the lysate. The specific interaction between the target protein and the antibody permits capturing of the target protein and its protein-binding partners (the interactome) whilst non-interacting proteins are removed.\nConjugate antibodies to Protein G Sepharose beads\nIncubate 50 μL packed volume of Protein G Sepharose beads with 5–50 μg of antibody or control IgG in phosphate buffered saline (PBS, pH7.2) to a total volume of 1.2 mL in 1.6 mL screw-capped Eppendorf tubes for 16 h on a rotator at 20 rpm at 4°C. In the example of Johnson et al. (2020)[href=https://www.wicell.org#bib6], the antibodies used were 5 μg of rabbit anti-USP9X (Bethyl Laboratories A301-351A; USP9X-IP samples) and 5 μg of rabbit IgG (Sigma-Aldrich; control IgG samples).\nCentrifuge tubes at 1,000 × g for 1 min and remove the supernatant.\nWash beads 3 times with 1 mL of 0.2 M triethanolamine (Sigma-Aldrich), diluted in ddH2O water and pH adjusted to 8.2 with HCl.\nResuspend beads in 1 mL of 0.2 M triethanolamine.\nCentrifuge tubes at 1,000 × g for 1 min and remove the supernatant.\nRepeat three times.\nResuspend beads in 1 mL of a freshly made solution of 20 mM dimethyl pimelimidate-2HCl (DMP, Thermo Fisher Scientific), 0.2 M triethanolamine, pH 8.2 (5.2 mg DMP per mL of 0.2 M triethanolamine). This solution cross links the antibodies to the beads.\nMix tubes on rotator at 20 rpm for 60 min at 20°C–22°C, making sure the beads remain in suspension.",
    "Centrifuge tubes at 1,000 × g for 1 min and remove the supernatant.\nResuspend beads in 1 mL 0.2 M ethanolamine pH 8.0 (dissolve 12 mL ethanolamine in 900 mL water and adjusted pH with conc. HCl).\nCentrifuge tubes at 1,000 × g for 1 min and remove the supernatant.\nResuspend beads in 1 mL 0.2 M ethanolamine pH 8.0 and mix tubes on rotator at 20 rpm for 30 min at 20°C–22°C.\nCentrifuge tubes at 1,000 × g for 1 min and remove the supernatant.\nWash beads twice with 1 mL of PBS.\nStore the beads in PBS at 4°C and use within 48 h.\nIsolate and quantify protein lysates from cell lines.\nCulture ∼3 × 106 cells for each IP. Number of cells required may vary depending on cell line. The aim is to extract >700 μg of protein for each IP.\nCollect cells from culture.\nRemove media from cells and wash with 10 mL PBS.\nRemove PBS and add 2 mL pre-warmed (37°C) 0.05% Trypsin-EDTA Tissue Culture Solution. Incubate at 37°C until cells detach (∼5 min).\nAdd 5 mL of culture media to neutralize Trypsin and transfer cells to a 10 mL centrifuge tube.\nNote: If using non-adherent cells, steps 2bi–iii can be omitted.\nCentrifuge cells at 300 × g for 5 min.\nRemove supernatant and resuspend cells in 10 mL of PBS.\nCentrifuge cells at 300 × g for 5 min.\nRemove supernatant and resuspend cells in 1 mL of PBS.\nTransfer cells to a 1.6 mL screw-capped Eppendorf.\nCentrifuge at 300 × g for 5 min.\nRemove supernatant. Use the cell pellets immediately for isolating protein lysates.\nAll subsequent steps in the isolation and quantification of protein lysates must be performed in a cold room or on ice. To lyse cells:",
    "Resuspend and lyse cells in 250 μL ice cold Protein Lysis Buffer.\nSonicate solution using a Vibra-Cell VCX 130 sonicator (or similar device) fitted with a 3 mm tip set at 30% amplitude for 12 s.\nReturn tube to ice for 2 min.\nRepeat sonication for 5 s.\nFollowing sonication, add 250 μL lysis buffer to each tube and centrifuge at 15,000 × g at 4°C for 15 min.\nTransfer supernatants to new 1.6 mL screw-capped Eppendorf tubes.\nQuantitate protein concentration using a Bicinchoninic Assay kit (e.g., Pierce™ BCA Protein Assay Kit, Thermo Scientific) as per manufacturer’s instructions.\nImmunoprecipitate target protein complexes from lysates.\nSplit each lysate into two samples, an Input sample, and an IP sample.\nTo make the IP Sample, add 600 μg of lysate (of variable volume based on protein concentration) to lysis buffer to a make a final volume of 500 μL.\nThe remaining lysate is referred to as the Input Sample. The Input sample can be stored at −80°C at this stage.\nPreclear the IP sample. This step removes proteins from the IP samples which bind non-specifically to Protein G Sepharose beads.\nWash a new lot of 50 μL packed volume of Protein G Sepharose beads with 1 mL Protein Lysis Buffer in 1.6 mL screw-capped Eppendorf tubes at 4°C.\nCentrifuge the beads at 1,000 × g for 5 min at 4°C and remove the supernatant.\nAdd the 500 μL IP sample to the beads and incubate at 4°C for 15 min on a rotator at 20 rpm.\nCentrifuge tubes at 1,000 × g at 4°C for 5 min. The supernatant is now considered a ‘pre-cleared’ IP sample.\nCentrifuge the pre-prepared antibody or control IgG-conjugated Protein G Sepharose beads (see step 1 above) at 1,000 × g for 5 min.",
    "Remove the supernatant and add the 500 μL pre-cleared IP Sample. Incubate on a rotator at 4°C for 16 h.\nPrepare a Microspin G50 columns for each IP sample.\nRemove the pre-packed Sephadex G-50 beads, remove fixed snap-off plug from the column tip, and add 1 mL of low-salt wash buffer.\nCentrifuge the columns using a low speed capsulefuge (e.g., Tomy Capsulefuge MC-86P0 Mini Centrifuge or similar).\nDiscard the flow through. Transfer each IP Sample (lysates and beads) to the MicroSpin G50 columns.\nCentrifuge using a low speed capsulefuge and discard the flow-through.\nWash the IP beads in the Microspin G50 column 3 times as follows.\nAdd 500 μL of Protein Lysis Buffer.\nCentrifuge using a low speed capsulefuge.\nDiscard the flow-through.\nWash the IP beads in the Microspin G50 column 3 times as follows.\nAdd 500 μL of IP Low Salt Wash Buffer.\nCentrifuge using a low speed capsulefuge.\nDiscard the flow-through.\nElute the IP sample.\nClose one end of each column with a snap-off plug, add 40 μL IP Elution Buffer (= 1× Laemmli Buffer without β-Mercaptoethanol) into each column.\nIncubate at 20°C–22°C for 7 min.\nUnplug ends of the columns place them in a collection tube containing 0.3 μL 100 mM Dithiothreitol (DTT).\nSpin using a low speed capsulefuge to collect eluate.\nRepeat steps i-iv using 20 μL IP Elution Buffer.\nPool the two elutions (40 μL and 20 μL from step v) for each IP-Samples from step and store at −80°C.\nPause point: Samples can be stored at −80°C indefinitely.\nWestern blot analyses of immunoprecipitated proteins\nTiming: 2 days",
    "The analysis of immunoprecipitated proteins by western blot at this stage is a key step that validates that the IP was successful. The aim is to detect the protein targeted by the antibody in the target protein IP sample, and not in control IgG IP samples (see troubleshooting[href=https://www.wicell.org#troubleshooting]). Probing for proteins known to interact with the targeted protein can serve as an additional positive control.\nAnalyze the Input and IP Samples by Western blotting to confirm IP.\nPrepare aliquots of both Input and IP Samples for western blotting.\nTransfer 8 μg aliquots of each Input Sample, and 2.5 μL aliquots of each IP Sample, into new tubes.\nAdd an amount of 20 mM Tris-HCl (pH 7.5) to create aliquot volumes of 7.5 μL each, and then add 2.5 μL of 4× Laemmli Buffer and mix by pipetting. The final volume of each aliquot is 10 μL.\nIncubate aliquots at 95°C for 5 min and then place on ice.\nSeparate proteins using sodium dodecyl sulfate poly-acrylamide gel electrophoresis (SDS-PAGE). We provide details for the XCell SureLock Mini-Cell system (Thermo Scientific) although alternative systems will achieve similar results.\nAssemble the XCell SureLock Mini-Cell system with a pre-caste NuPAGE 3%–8% Tris-Acetate 1.5 mm Mini Protein Gel as per manufactures instruction.\nAdd 250 μL NuPAGE Antioxidant to 250 mL of 1× NuPAGE Tris-Acetate SDS Running Buffer and pour into inner buffer chamber.\nFill the outer chamber of the XCell SureLock Mini-Cell with 1× NuPAGE Tris-Acetate SDS Running Buffer to a level ∼3 cm above the bottom of the gel.\nRemove gel comb and wash wells using 1 mL pipette tip.",
    "Load all 10 μL of the Input and IP Sample aliquots using gel loading tips. Also load 5 μL of Precision Plus Protein Dual Color Standards (add 5 μL 1× Laemmli Buffer) in flanking wells.\nRun samples at 100 V for 2 h.\nTransfer proteins to nitrocellulose membrane.\nCarefully remove the precast gel from cassette and soak in cold Western Transfer Buffer for 5 min.\nPre-soak ‘cut-to-gel’ sized nitrocellulose membrane (BioTrace NT), and two Whatman filter papers (3 mm CHR) and blotting pads in cold Western Transfer Buffer.\nAssemble the transfer blot ‘sandwich’ in the XCell II Blot Module.\nFill the transfer chamber with cold Western Transfer Buffer.\nTransfer at 15 V for 16 h in a 4°C cold room.\nConfirm transfer by incubating the nitrocellulose membrane with Ponceau S Stain for 5 min.\nRepeatedly wash of excess stain using TBST.\nAfter confirming transfer of protein to nitrocellulose membrane, remove remaining protein-bound Ponceau S Stain using repeated washes with TBST.\nConduct western immunoblotting.\nBlock the nitrocellulose membrane with TBST containing 10% skim milk for 1 h.\nPause point: Blocked membranes can be stored in TBST for weeks at 4°C.\nRemove blocking solution and incubate the membrane for 16 h at 4°C in TBST containing primary antibody (in the example of Johnson et al., 2020[href=https://www.wicell.org#bib6], the primary antibody was rabbit anti-USP9X, 400 ng/mL) and 2% skim milk.\nWash the membrane with TBST buffer 3× 10 min each wash.\nIncubate the membrane at R/T for 2 h with TBST containing 2% skim milk and Horseradish Peroxide (HRP)-conjugated secondary antibodies (in the example of Johnson et al., 2020[href=https://www.wicell.org#bib6], this was goat anti-rabbit immunoglobulins/HRP secondary antibody used at 1:1,000 dilution).\nWash the membrane with TBST buffer 3× 10 min each wash.",
    "Remove TBST and use a Whatman filter to further remove any excess TBST from the membrane.\nIncubate the membrane with Clarity Western ECL Substrate reagent for 2 min.\nRemove excess ECL reagent and capture emission using ChemiDoc MP Imaging System (See expected outcomes[href=https://www.wicell.org#expected-outcomes] for an example result).\nCritical: Failure to detect the protein of interest at the end of this step indicates a no-go event and the experiment should be abandoned. See troubleshooting[href=https://www.wicell.org#troubleshooting] for additional information.\nIn-gel digestion of immunoprecipitated proteins\nTiming: 2 days\nGel electrophoresis, commonly used for the preparation of proteomic samples for mass spectrometric analysis, enables selective capturing of proteins and elimination of agents that interfere with downstream analysis. Following gel separation, an in-gel digestion of proteins is performed. The procedure involves excising gel regions containing the protein, reduction of protein disulphide bonds, alkylation of free unreacted thiols, and proteolytic digestion of the protein samples. Resultant peptides can be used for TMT labeling or subjected to LC-MS/MS for label-free quantitative analysis.\nIn-gel digestion of immunoprecipitated proteins with trypsin.\nCritical: Use fresh gloves and wipe down sample preparation areas with 80% ethanol solution to clean surfaces prior to processing the gels to avoid keratin contamination which interferes with downstream proteomics analysis.\nPrepare a 35 μL aliquot of each IP sample for SDS-PAGE by adding 12 μL of 4× Laemmli Buffer. Incubate the samples at 95°C return to ice.\nPrepare the SDS-PAGE apparatus as per step 4. A single IP sample may need to be loaded across multiple wells depending on well volume capacity. Run the gel at 200 V for 10 min.\nConduct a Coomassie stain of the proteins.\nCarefully remove the precast gels from cassettes.\nWash gels with Fixing Solution for 5 min.\nRemove Fixing Solution and incubate with Coomassie Stain for 16 h.",
    "Discard Coomassie Stain and remove any remaining traces using three 5 min incubations in Coomassie Wash Solution with slight agitation.\nRemove the solution and rehydrate the gel by incubating in Gel Rehydration Solution for 1 h.\nRemove suspended particulate matter by immersing the entire gel in ddH2O water for 1 h, while changing the water every 20 min.\nExcise all gel regions containing protein.\nPlace the gel on a clean surface.\nUse a scalpel to excise all gel regions containing protein of each sample.\nPool multiple wells of the same sample together where relevant.\nDice the gel regions further into smaller pieces of 1 × 1 mm and place them inside a Protein LoBind microcentrifuge tube.\nCentrifuge tubes at 1,000 × g for 1 min to collect the gel pieces in the bottom of the tube.\nWash gel pieces with acetonitrile.\nAdd 500 μL of acetonitrile (LC-MS grade) to each gel sample.\nIncubate for 10 min at 20°C–22°C. At this stage, the gel pieces may turn opaque and shrink. To avoid gel pieces sticking together, pulse vortexing is used to separate pieces.\nCentrifuge at 1,000 × g for 1 min to collect the gel pieces in the bottom of the tube.\nDiscard the supernatant.\nAdd 30 μL of the 10 mM DTT Solution in TEAB to each sample, ensuring that the gel pieces are fully submerged. If necessary, additional 10 mM DTT Solution in TEAB can be added. Incubate the samples in a heating block/incubator for 30 min at 56°C. Cool the sample tubes to 20°C–22°C.\nWash gel pieces with acetonitrile.\nAdd 500 μL of acetonitrile (LC-MS grade) to each sample.\nIncubate tubes for 10 min at 20°C–22°C.\nCentrifuge tubes at 1,000 × g for 1 min to collect the gel pieces in the bottom of the tube.",
    "Discard the supernatant.\nAdd 30 μL of 55 mM iodoacetamide (IAM) in TEAB solution to the sample ensuring that the gel pieces are fully submerged. If necessary, additional 55 mM IAM in TEAB solution can be added. Incubate the samples in the dark at 20°C–22°C for 20 min.\nWash gel pieces with acetonitrile.\nAdd 500 μL of acetonitrile (LC-MS grade) to each sample.\nIncubate tubes for 10 min at 20°C–22°C.\nCentrifuge tubes at 1,000 × g for 1 min to collect the gel pieces in the bottom of the tube.\nDiscard the supernatant.\nDe-stain the gel pieces.\nAdd 500 μL of Destaining Solution to each sample.\nIncubate the samples at 20°C–22°C for 20 min. Incubation time can be varied as per the color intensity of the gel pieces. For darker stained gel samples, longer incubation can be performed.\nCentrifuge tubes at 1,000 × g for 1 min to collect the gel pieces in the bottom of the tube.\nDiscard the supernatant.\nWash gel pieces with acetonitrile.\nAdd 500 μL of acetonitrile (LC-MS grade) to each sample.\nVortex samples for 10 s.\nIncubate tubes for 10 min at 20°C–22°C.\nCentrifuge tubes at 1,000 × g for 1 min to collect the gel pieces in the bottom of the tube.\nDiscard the supernatant.\nNote: Although it is also not necessary to remove all traces of the Coomassie Stain from the gel, steps 5j and 5k can be repeated if significant amounts of stain remains.\nCritical: Remove all remaining acetonitrile at this step, as it can hinder the proteolytic activity of trypsin. Visually inspect the gel to ensure the absence of acetonitrile along with the gel. If necessary, the left over traces of acetonitrile can be removed by subjecting the gels to brief vacuum centrifugation up to 10 min.",
    "Pause point: The excised and destained gel bands are now ready for digestion. However, if necessary, they can be stored at −20°C for up to 4 weeks.\nAdd 100 μL of Trypsin Peptide Digestion Solution to each sample and incubate on ice or in the fridge at 4°C for 30 min to allow absorption of the solution into the gel. Ensure the gel pieces are fully submerged. If necessary, additional Trypsin Peptide Digestion Solution can be added.\nNote: Addition of trypsin on ice is recommended as it helps in reduction of autolysis of trypsin, thus ensuring efficient digestion of proteins.\nAfter the incubation, ensure that all gel pieces have absorbed the Trypsin Peptide Digestion Solution and are completely submerged in the solution, and perform the digestion for 16 h in a heating block at 37°C.\nCritical: Complete digestion is essential as undigested, or partly digested peptides reduce the number of total peptide free N-termini through which TMT labeling occurs. To ensure good digestion efficiency, it is important to maintain constant temperature across the sample tube. As the uncovered heating blocks can expose the sample tubes to non-uniform temperatures, ensure the heating block is covered with aluminum foil to minimize the loss of heat and help keep temperatures uniform, or incubate the sample tubes in an enclosed incubators with uniform surface temperatures.\nRemove the samples from heat block and chill the sample tubes on ice.\nCentrifuge the samples at 1,000 × g for 1 min to gather the solution and gel pieces in the bottom of the tube and carefully transfer the supernatant containing the peptide to a fresh Protein LoBind tube.",
    "Extract residual peptides from the remaining gel pieces by adding an additional 100 μL of Peptide Extraction Buffer to the gel pieces and incubate on a heating block for 15 min at 37°C. Repeat steps 5n–o and pool supernatants at step 5o together.\nNote: It is advised to retain the extracted gel pieces. The same gel pieces can be re-digested with the same enzyme or any alternative enzyme in case the digestion fails.\nDry the final combined sample at step 5o in a SpeedVac vacuum concentrator at 45°C. Under these conditions, samples are typically dried with 2–3 h.\nPause point: The digested, dried peptides can be stored at −20°C or −80°C freezer for up to 4 weeks.\nNote: The volumes of reagents used for destaining, digestion and extractions can be varied proportionally, depending on the size of the gel matrix.\nLabeling digested peptides with Tandem Mass Tags\nTiming: 1 day\nIn this step, digested peptides are labeled with Tandem Mass Tags (TMTs) and a ‘Label Check’ is performed to assess labeling efficiency, and to normalize peptide amounts, before the samples are pooled for further analyses.\nTMT Labeling of Peptides.\nResuspend each of the dried peptide samples.\nTo each sample, add 105 μL of 200 mM HEPES (pH 8.8).\nVortex for 10 s.\nSpin the samples down at 1,000 × g for 1 min.\nCritical: Reagents/buffers containing primary amines must be avoided, as they competitively bind TMT reagents resulting in poor labeling efficiencies. Buffers such as HEPES or EPPS are recommended. Any residual acid from incomplete drying of samples post-digestion could alter the sample pH, hence it is important use higher concentration of buffers (e.g., HEPES≥200 mM).\nMeasure the peptide concentration using the PierceTM Quantitative Colorimetric Peptide Assay (Thermo Fisher Scientific), as per manufacturer’s instructions.",
    "Aliquot 100 μg peptide of each sample into to fresh Protein LoBind tubes for labeling in a 10-plex TMT reaction.\nNote: If 100 μg is not available for any one sample, make all aliquots equal to the amount of the most limiting sample. A minimum of 20 μg is required. Lower amounts of starting material needs further optimization of amount of TMT label to be added to the sample.\nEqualize all sample volumes to that of the largest sample volume through addition of 200 mM HEPES (pH 8.8).\nPrepare TMT 10-plex Isobaric Label Reagents.\nImmediately before use, add 42 μL of anhydrous acetonitrile to each 0.8 mg TMT label vial.\nVortex for 5 min.\nCentrifuge at 1,000 g for 1 min.\nAdd a different TMT Label to each respective peptide sample (up to 10 samples) and incubate at 20°C–22°C for 1 h with occasional vortexing.\nNote: Upon optimization, amount of total TMT label used can be reduced.\nNote: If more than ten samples are to be analyzed then strategies for multi-batch TMT designs need to be considered including inter-batch controls.\nCritical: TMT labeling cannot be performed in buffers containing primary amines (e.g., Tris-HCl buffer).\nQuench excess TMT label.\nadd 8 μL of TMT Reaction Quenching Solution to each sample.\nVortex for 10 s.\nIncubate at 20°C–22°C for 15 min.",
    "Perform TMT Label Check. To ensure equal amounts of TMT labeled peptides from each individual sample are combined in the final large scale pooled sample subjected to two-dimensional liquid chromatography/mass spectrometry (LC-MS/MS), a small scale pilot study known as a “Label Check” experiment is first performed. In the Label Check experiment, a test sample is created by pooling small, equal volumes of each sample, and assessed by LC-MS/MS, and ion intensities of each sample analyzed. The ion intensities results of the Label Check experiment form the basis of a normalization step that ensures that each TMT labeled sample contributes a similar total reporter ion intensity when pooled for LC-MS/MS.\nCreate a small scale pooled sample.\nCombine approximately 1 μg (2 μL) of each sample into a single fresh Protein LoBind tube.\nVacuum dry the combined sample.\nDesalt the combined sample via the SDB Stage-tip clean up procedure using Empore™ SDB SPE Disks (Rappsilber et al., 2007[href=https://www.wicell.org#bib15]).\nDry the desalted sample.\nNote: The volume of each sample used to generate the pool needs to be identical, and the remaining sample volume will also be equal.\nReconstitute the small scale pooled sample in LC-MS Loading Buffer.\nAnalyze approximately 1 μg of peptide mixture on the Orbitrap mass spectrometer (refer to steps 10-g and 11 for LC-MS/MS settings).\nUse the resulting data file (.raw format) for performing a database search by MaxQuant (refer to step 11 for search parameters).\nCalculate the total TMT reporter ion intensity for each individual samples in the small scale pooled sample.",
    "Calculate the volume of each TMT labeled peptide sample required to generate the large scale pooled sample for LC-MS/MS: Each sample in this pool must contribute equal levels of total TMT reporter ion intensity. Thus the total TMT reporter ion intensity of each sample is limited by, and must be equal to, that of the sample with the lowest total TMT reporter ion intensity. The volume of each sample to be added to the large scale pool is therefore calculated as follows: Sample volume to be added to pool = (total of TMT reporter ion intensity in the lowest abundant sample / total of TMT reporter ion intensity in the individual sample) ∗ remaining sample volume.\nCreate a large scale pooled sample by combining the samples using volumes calculated in step f.\nNote: Store the samples in 4°C until Label Check is complete, as LC-MS/MS analysis can typically take 2–6 h.\nDry the final combined sample in a SpeedVac vacuum concentrator.\nPause point: The TMT labeled, dried peptides can be stored at −20°C or −80°C freezer for up to 6 weeks until further processing.\nNote: After drying, the sample pellet may look like viscous or oily due to the presence of salts.\nDesalting of TMT labeled peptides\nTiming: 1 day\nFollowing the TMT labeling procedure, some of the unbound TMT reagents and buffer components may remain in the sample and interfere in downstream processing including, separation of peptides during chromatography, electrospray ionization and mass spectrometry analysis. Hence samples are desalted using Sep-Pak Light C18 cartridge before performing any further sample processing.\nDesalting TMT labeled peptides by Solid Phase extraction.\nResuspend the dried TMT labeled peptide sample.\nAdd 1 mL of Sep-Pak Wash Solution to the sample.\nVortex rigorously for 1 min.\nCentrifuge at 1,000 g for 1 min.",
    "Check that peptides are fully resuspended and total volume collected at bottom of the tube. Repeat steps 8aii–iv if necessary.\nAssemble the Sep-Pak Light C18 cartridge on the vacuum manifold.\nFix a Sep-Pak Light C18 cartridge at the top of the vacuum manifold.\nAttach a 5 mL collection tube under the Sep-Pak Light C18 cartridge in the suction manifold to collect the flow through from the Sep-Pak.\nConnect the entire assembly to a vacuum line.\nNote: If access to a vacuum manifold is unavailable, solution can be passed through cartridge using positive air pressure.\nWash the Sep-Pak with 100% methanol (HPLC grade; >99.9% purity).\nDispense 1 mL of methanol into the Sep-Pak Light C18 cartridge.\nStart the suction pump and let the methanol pass through the Sep-Pak Light C18 cartridge.\nCritical: Methanol is a highly flammable liquid, an eye irritant, and considered an acutely and chronically toxic solvent. Wear appropriate protective gear (lab coat, gloves, eye, and goggles) and handle large volumes in a well-ventilated chemistry hood.\nWash the Sep-Pak Light C18 cartridge with Sep-Pak Elution Solution (80% acetonitrile, 0.5% acetic acid, in ddH2O).\nDispense 1 mL of Sep-Pak Elution Solution into the Sep-Pak Light C18 cartridge.\nStart the suction pump and let the Sep-Pak Elution Solution pass through the Sep-Pak Light C18 cartridge.\nWash the Sep-Pak Light C18 cartridge with Sep-Pak Wash Solution to equilibrate the column.\nDispense 1 mL of Sep-Pak Wash Solution into the Sep-Pak Light C18 cartridge.\nStart the suction pump and let the Sep-Pak Elution Solution pass through the Sep-Pak Light C18 cartridge.\nRepeat the equilibration procedure twice more to remove all traces of organic solvent.\nPlace a fresh collection tube under the equilibrated Sep-Pak Light C18 cartridge for the collection of the flow-through.",
    "Fill the Sep-Pak Light C18 cartridge with the sample (from step 8a) and let the sample pass through very slowly at approximately 0.5 mL/min.\nNote: The final flow through from the sample may be collected and stored for subsequent analysis to check for unbound peptides, if desired.\nWash the Sep-Pak Light C18 cartridge with 1 mL Sep-Pak Wash Solution (as per steps 8ei–ii) (collect wash solution if necessary).\nElute peptides into a fresh 1.5 mL tube with 1 mL of Sep-Pak Elution Solution (as per step 8d).\nDry peptides in a vacuum centrifuge.\nPause point: Desalted, TMT labeled peptides can be store at −80°C until required.\nFractionation of the peptide mixture using high pH reverse phase chemistry\nTiming: 1 day\nIn this section the TMT labeled peptide sample is subjected to fractionation using high pH (HpH) reverse phase chemistry. The fractionation serves as an orthogonal separation method prior to downstream low-pH reversed-phase LC-MS/MS analysis. These two in-line orthogonal fractionation approaches increase the likelihood of peptide detection in mass spectrometers by decreasing the sample complexity thus reducing the ion suppression effect commonly observed in TMT based quantification (Di Palma et al., 2012[href=https://www.wicell.org#bib4]).\nHigh pH Fractionation of TMT labeled peptides.\nNote: If access to an LC system with fraction collector is unavailable, centrifugal HpH columns can be used as an alternative (e.g., Pierce™ High pH Reversed-Phase Peptide Fractionation Kit, Thermo Fisher Scientific, P/N: 84868).\nReconstitute sample in 600 μL of HpH Mobile Phase A Solution and vigorously vortex.",
    "Inject the sample onto the column (Zorbax 300 Extend-C18, 2.1 × 150 mm, 3.5 μm, 300A, HPLC column (Agilent), operated at 25°C) and separate the peptides into a total of 96 fractions using an Agilent 1260 HPLC system equipped with quaternary pump, a degasser and a Multi-Wavelength Detector (MWD) (set at 210, 214 and 280-nm wavelength).\nElute the peptides off the column using a gradient of HpH Mobile Phase B Solution at a flow rate of 0.3 mL/min according to Table 1[href=https://www.wicell.org#tbl1].\ntable:files/protocols_protocol_2008_27.csv\nCollect the eluate into a 96-well plate (2 mL deep well, round bottom, polypropylene collection plate; Axygen), using the fraction collector, at 2 min per fraction for the first 16 min and then 1 min per fraction through end of the program at 100 min.\nConcatenate the 96 well fractions into 20 fractions in the pattern indicated in Table 2[href=https://www.wicell.org#tbl2].\ntable:files/protocols_protocol_2008_28.csv\nPeptides from the wells indicated with the same number can be pooled to form a fraction as indicated in the table. For example, sample -3 can be prepared by pooling Ai, Bi, Ci and Di.",
    "Note: The fractionation control settings and concatenation pattern may need adjusting depending on LC chromatogram features to ensure that peptides are collected depending on chromatography observed and fraction collection order on individual systems. Under the conditions for this study, Fractions -3 to -1 (first 14 fractions) collect the void volume of the column prior to injection, until the wash-out of unbound material (primarily unreacted TMT label). Subsequent fractions collect peptides eluting from the column, until the end of the gradient run (i.e., high Buffer B). This pattern optimizes the peptide amounts and fractionation in the sample based on the elution pattern observed, but collection times and windows may need adjusting for individual instruments. Factors to consider include the void volume of the instrument so that fraction collection begins as peptides begin to elute, the volume collected in each fraction does not exceed the collection volume available and the collection of fraction should finish as peptides are completely eluted from the column.\nPlace the samples into an evaporative concentrator and concentrate under vacuum at 45°C to dryness.\nPause point: The dried peptide samples are ready for mass-spectrometry analysis and can be stored at −80°C for up to 2 months.\nLiquid chromatography mass-spectrometry analysis\nTiming: 1 day\nThis section describes LC-MS/MS analysis procedure for TMT labeled peptide fractions on a Quadrupole-Orbitrap mass-spectrometer (Q Exactive HF-X, Thermo Fisher Scientific) coupled to a Nano-flow liquid chromatography (Thermo Scientific™ UltiMate™ 3000 RSLCnano system). Alternative mass spectrometers and liquid chromatography of other brands represent valid options for analysis of the samples.\nLiquid chromatography mass-spectrometry LC-MS/MS analysis of TMT labeled peptides.\nReconstitute each of the peptide fractions.\nAdd 6 μL of LC-MS Loading Buffer to each fraction.\nVortex for 10–30 s.\nSonicate for 2–5 min (e.g., using a Vibra-Cell Sonicator with 3 mm tip; Sonics).",
    "Centrifuge the samples at 10,000 × g for 2 min at 20°C–22°C to pellet any particulate matter.\nTransfer the samples into vials compatible with the liquid chromatography system of choice.\nCritical: Any particulate matter that is not removed at this step can block and damage LC columns and instruments.\nNote: Exact volume of the sample reconstitution buffer and peptide sample loading volume can differ depending on the total peptide amount that is available and sensitivity of the mass spectrometers. A small amount of the peptide sample can first be injected to test the response, before injecting the samples. Label Check analysis performed in step 7 can be used as a guide to expected intensity.\nPause point: TMT labeled samples, can be stored in MS loading buffer for up to 6 days at 4°C, 6 weeks at −20°C, or 6 months at −80°C.\nPlace the samples in the auto-sampler of the liquid chromatography system.\nCritical: To ensure longer shelf life of the peptide samples, it is important to maintain the auto-sampler system in cooler temperature between 4°C–8°C.\nSet the column heater temperature to 35°C and apply a voltage of 1.9 kV to the nano-LC electrospray ionization source.\nInject each of the individual samples onto the peptide trap column.\nDesalt the peptide trap column by washing it with 15 μL LC-MS Mobile Phase A Solution for 10 min.\nSwitch the valve in-line with the column.\nElute peptides from the peptide-trap into the analytical column with the linear gradients of LC-MS Mobile Phase B Solution with a stepped gradient of 120 min including elution of peptides, wash and re-equilibration of the columns. A recommended mobile phase gradient has been suggested in Table 3[href=https://www.wicell.org#tbl3].\ntable:files/protocols_protocol_2008_29.csv\nNote: Shorter gradients can be used for less complex samples.",
    "Analyze LC eluent on a Quadrupole-Orbitrap mass-spectrometer (Q Exactive HF-X, Thermo Fisher Scientific) on a MS2-based TMT method as outlined in Table 4[href=https://www.wicell.org#tbl4].\ntable:files/protocols_protocol_2008_30.csv\nIdentification and quantification of proteins from the raw mass spectrometry data\nTiming: 2 days\nIn this section the raw data file is analyzed using MaxQuant to produce an output file of protein list and label intensities that can be normalized and used for identification of proteins which are enriched in the IP in comparison to control samples. This data provides identification of the target IP proteins interactome.\nAnalysis of raw mass spectrometry data.\nProcess the raw data files using MaxQuant (Version_1.6.10.43 and above) (Cox and Mann 2008[href=https://www.wicell.org#bib3]).\nNote: For more details on setting up MaxQuant and conducting a data search, follow steps described in (Tyanova et al., 2016[href=https://www.wicell.org#bib18]). Latest version of MaxQuant (version v2.0.3.1, May 2022) offers isobaric match between run (MBR) options that is reported to enhance the quantitative depth of the proteome as oppose to the search conducted without MBR (Yu et al., 2020[href=https://www.wicell.org#bib19]). Alternatively, a whole suite of other software can also be used including Proteome discover (Orsburn 2021[href=https://www.wicell.org#bib10]) (with embedded Mascot or Sequest search functions), and MSFragger (Kong et al., 2017[href=https://www.wicell.org#bib7]), among others.\nSpecify the parameters for searching TMT proteomics data on the MaxQuant software.\ntable:files/protocols_protocol_2008_31.csv\naRecommended setting. For increased confidence of identification and quantification of proteins, minimum unique peptide cut off can be set in the search engine.\nNote: Default settings in MaxQuant software are typically optimal to use, with a few exceptions such as defining variable modifications and TMT labeling bias correction value substitution. Typical parameters for MS2-DDA-TMT-MS data are outlined in Table 5[href=https://www.wicell.org#tbl5].",
    "Input the TMT kit lot specific reporter ion isotopic distribution correction factors to account for natural carbon isotopes (+1, +2) and incomplete stable isotope incorporation (-1, -2).\nNote: This value is specific to the kit and can be retrieved from information catalog provided along with the kit.\nOutput and analyze data to assess proteins interacting with the targeted IP protein.\nOutput search and TMT intensity raw data. This data identifies peptides and protein groups detected in each sample and provides their quantities as reported by TMT-channel intensities at either peptide or protein levels. These intensities provide relative quantitation of peptides and proteins between samples. MaxQuant output provides list of proteins identified (Gene names or FASTA headers), and their associated “Reporter Intensity Corrected” and “Reporter Intensity Count” metrics for each TMT channel. “Reporter intensity corrected” metrics are used for quantification.\nNormalize TMT quantitation data by total abundance.\nSum the total ion intensities for each channel.\nFor each channel, divide the total intensity sum by that of the total intensity sum of the highest total intensity channel. This ratio is used as a normalization factor.\nNormalize each individual proteins abundance in a channel by multiplying the channels normalization factor to the protein TMT quantitation data.\nUse the normalized protein abundance data to identify proteins enriched in target protein IP samples (e.g., USP9X wildtype and mutant IP samples in Johnson et al., 2020[href=https://www.wicell.org#bib6]) compared to control IgG IP samples.\nCalculate the mean normalized protein abundance of the triplicate samples of each experimental group (control IgG IP and target protein IP groups).",
    "For each protein, divide target protein IP mean by control IgG IP mean. Proteins with increased normalized abundance (Figure below) in the target protein IP sample compared to the IgG control IP sample can be considered enriched in the target protein IP sample, and as such a part of the target proteins interactome. Similar comparisons can be made between other experimental groups (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2008-Fig1.jpg\nFigure 1. Conceptual representation of data obtained from an IP-coupled TMT based proteomics\nIn this example, cells express either the wild-type target protein (TargetWT) or a mutant version of the target (TargetMUT) unable to interact with certain binding partners. A triplicate experiment is shown with all samples run using a single TMT (9-plex). The TMT peaks for a non-specific interactor, and target specific interactor are shown.\nConduct t-tests between target protein IP sample groups using normalized data triplicates. Differences between groups with p < 0.05, and with fold-change of 1.5 are considered biologically significant.\nNote: TMT method will usually have a quantitative value for each channel, though a very low value may be indicative of peptide/protein absence in the sample. Caution should be taken when interpreting very high fold-change results (absolute log2(fold-change) > 4–5), as this may indicate absence of peptides or proteins in sample groups where peptide intensity is very low. Absence/presence of signals may be enough to indicate complex participation and not require statistical analysis. For example, if the protein is confidently detected in at least two out of three replicates in the target protein IP sample and none of the replicates in the control IgG IP, this may be considered sufficient evidence that it is an interacting partner.",
    "Note: Visualization of results can be achieved through heat maps filtered for statistically significant proteins (x-axis = Sample or Sample group, y = Protein, fill = Abundance or mean abundance), or using a volcano plot (x = Fold change, y = -log10 (p value from ANOVA).\nConduct Gene Ontology enrichment analysis (or other types of pathway enrichment) on lists of differentially expressed proteins. Multiple freely available web-based resources represent convenient tools to perform such analysis, including enrichR (https://maayanlab.cloud/Enrichr/[href=https://maayanlab.cloud/Enrichr/]) and DAVID (https://david.ncifcrf.gov/[href=https://david.ncifcrf.gov/]). Using these tools on IP derived proteomic data needs consideration, as interacting pathways are likely to be overrepresented in the data initially."
  ],
  "subjectAreas": [
    "Protein Expression And Purification",
    "Proteomics",
    "Mass Spectrometry",
    "Cell Biology"
  ],
  "bigAreas": [
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}