{
  "id": 13398,
  "origin_website": "Jove",
  "title": "Preparing Developing Peripheral Olfactory Tissue for Molecular and Immunohistochemical Analysis in Drosophila",
  "procedures": [
    "The following protocol is consistent with the ethics guidelines established by the Duke University Research Ethics Committee.\n1. Tissue Preparation and Developmental Staging of Drosophila melanogaster Pupa\nFirst, identify how many flies will be necessary for the dissection. For RT-PCR and RNAseq, collect 100 - 200 antennal discs and antennae from individuals which are necessary at prepupal, 8 h APF, 40 h APF, and adult stages. For immunohistochemistry, dissect 10 - 20 individual.\nClean all materials, including dissection pads and forceps, using wipes with 70% EtOH. If the dissected material is to be used for RNA extractions, clean everything with RNase neutralizers and make all solutions using either nuclease-free or diethyl pyrocarbonate (DEPC) treated water.\n\tNOTE: This protocol uses silicone dissection pads instead of glass for the dissections. Silicone pads are friendly to ultra-fine forceps and promote fast and high-quality dissections.\nCollect pupa at the 0 h APF/prepupal stage.\n\t\nTo ensure the most precise staging, monitor the larvae at 30 min to 1 h intervals.\n\t\tNOTE: Wandering third instar larvae in a moderately crowded bottle will likely pupate within a few hours.\nOnce the larvae become immobile and are surrounded by a very light (almost white) colored pupal case, transfer them into a small 2-in Petri dish with a moist filter paper.\nContinue for 1 - 2 h, occasionally monitoring, identifying, and transferring prepupae.\n\t\tNOTE: Alternatively, clear a bottle of all pupae and allow the larvae to develop for 2 h. All pupae collected after 2 h will be within a 0 - 2 h APF range.",
    "Immediately move to step 3.1 to dissect the prepupal antennal disc for the 0 h APF stage. If the prepupa needs to be aged, collect them into a dish, cover the dish and place a paraffin film around the edges to inhibit dryness, and place the Petri dish at 25 °C.\n\tNOTE: The pupae can now be aged to eclosion.\nFor pupae collected in a 2 h range, age the prepupae for 2 h less than the desired age in order to ensure that the pupae do not overage.\nUse ultra-fine forceps (Dumont 55) as the tissue is very small and fragile.\n2. Tissue Preparation and Developmental Staging of Pupa from Other Drosophila Species\nTo determine the length of the pupal development in other Drosophila species, place the samples at the optimum temperature, record the dates when prepupae are observed, sort them into a fresh vial, and record the number of days from prepupa to adulthood.\nRecord the ratio of time for pupal development for non-melanogaster species and for melanogaster. Multiply the ratio of the developmental time by the number of hours used for staging melanogaster to obtain the number of hours to age the non-melanogaster species.\n3. Dissection of D. melanogaster  Pupal Antennal Disc\nNote: All the aging times and dissection protocols are described for Drosophila melanogaster. For all other species, a modification of the aging protocol based on species-specific developmental time points will be required, as described above.\nFor pupal antennal disc dissections, collect 50 - 100 0 - 2 h or 6 - 8 h old pupae using a spatula and place them on a dissection pad.\nPipette 150 µL of RNA isolation solution into an RNase free 1.5-mL microfuge tube using a 200-µL pipette and place the tube on ice.",
    "Dissect the pupae in 150 - 200 µL of 1x PBS (phosphate buffered saline, nuclease-free). Place multiple droplets of PBS (150 - 200 µL per droplet) on the dissection pad.\nOn the dissection pad, place the 0 - 2 h or 6 - 8 h aged pupae (one pupa per drop) to be dissected in one of the 1x PBS droplets. Use forceps in one hand to stabilize the body.\nFor the 0 - 2 h aged pupae, using forceps in the other hand, hold on to the most anterior part (the mouth hooks) of the prepupa and pull it out to expose the brains and the imaginal discs attached to the anterior pupal case.\nFor the 8 h APF pupae, first gently peel off the pupal case from the most anterior quarter of the pupa, exposing the head within the membrane sack that surrounds the body.\n\tNOTE: The body, at this stage, looks like a degenerating larva.\nRemove the head at the neck joint.\n\tNOTE: This ensures that the antennal discs will not be lost, which at this stage are connected primarily to the optic lobes of the brain.\nTransfer the tissue with the brains and the imaginal discs to another 1x PBS droplet using forceps or a 20-µL pipette.\nIdentify the eye-antennal disc connected to the brain at the optic lobes. Using forceps, disconnect the eye-antennal disc from the brain and the pupal case. Transfer it to a new 1x PBS droplet using forceps or a 20-µL pipette.\n\tNOTE: The prepupal eye-antennal disc is a flat tissue. However, by the 8 h pupae, the eye discs are rotated cupping the antennal discs, which sits anterior to the central brain.",
    "Using forceps, cut the tissue at the site of connection between the eye and the antennal disc. Use a 20-µL pipette to gently transfer the dissected tissue into the RNA isolation solution reagent. Minimize the amount of liquid transferred by pipetting an amount as small as possible.\nRepeat until all pupae have been dissected.\n4. Dissection of D. melanogaster Mid-pupal and Adult Antennae\nNote: By 40 h APF, the majority of the metamorphosis is complete, and the adult structures are becoming apparent, but are still white and nondescript. At this developmental time point, the adult antenna has taken its final shape yet still is transparent and the majority of the olfactory receptors, except for a few, have not started expression.\nFor pupal antennal dissections, collect 50 - 100 prepupae as described in step 1 and age them for 40 h at 25 °C.\nPipet 150 µL of RNA isolation solution into an RNase free 1.5-mL microcentrifuge tube using a 200-µL pipet and place the tube on ice.\nOn the dissection pad, place the pupa to be dissected into one of the 1x PBS droplets. Use forceps in one hand to stabilize the body. Using forceps in the other hand, gently peel off the pupal case from the most anterior quarter of the pupa, exposing the head within the membrane sack that surrounds the body.\nUsing forceps, carefully cut off the head from the rest of the pupal body by holding the body with one set of forceps and ripping the head off at the neck joint with another set of forceps. Gently transfer the head into another 1x PBS droplet using forceps. Pipette up and down to clean out the contents of the head (the brain, etc.) to obtain a clear membrane that used to surround the developing Drosophila head.",
    "NOTE: At 40 - 50 h APF, the antennae are connected to the anterior-most section of the membrane. They will become apparent for dissection when the contents of the head are cleared with pipetting.\nUsing forceps, disconnect the pupal antennae from the membrane. Disconnect the 2nd segment of the antenna from the 3rd using forceps to slice at the segmental joint, as only the 3rd segment will house the olfactory receptor neurons.\nUse a 20-µL pipette to gently transfer the dissected tissue into the RNA isolation solution reagent. Minimize the amount of liquid transferred by pipetting an amount as small as possible. Repeat until all pupae have been dissected.\nFor adult antennal dissections, collect approximately 50 adults and age them for a week post-eclosion.\n\tNOTE: The expression of olfactory receptor genes and other genes peak a week after eclosion. The adults are aged for a week to ensure biologically relevant genes with low abundance transcripts to rise above the detection threshold.\nFor RNA extractions, dissect flies while they are still alive on a CO2 pad. Treat the CO2 pad with RNase inhibitors. For confocal imaging, dissect the flies on a dissection pad in 1x PBS or PBS + 0.2% Triton.\nFirst, put the adults to sleep on the CO2 station pad under the dissection scope. On the CO2 station pad, using forceps in one hand to stabilize the body, use forceps in the other hand to gently pull/pinch out the third antennal segment from the second.\nTransfer the antennae into an RNA isolation solution, using forceps to place the antennae directly into the liquid. Repeat until all adults have been dissected.",
    "NOTE: Ensure that the antennae are submerged in RNA isolation solution. The antennae may become stuck on the side of the tube. This will cause an increased degradation of the RNA, reducing RNA quality and quantity.\nDirectly proceed to the RNA extraction or place the tube at -80 °C for long-term storage.\n5. RNA Isolation from Dissected Tissues\nRemove all samples from the -80 °C storage and thaw them on ice.\nBriefly spin (5 - 6 s, ~6,000 x g) each sample to collect the material at the bottom of the tube.\nGrind each sample using an autoclaved plastic pestle and an electric motor for 10 s on ice.\nRepeat steps 5.2 and 5.3 4.\nPerform the RNA extraction using commercially available kits and following the manufacturer's protocols for an optimal yield.\nPerform qRT-PCR using commercially available reagents and specific primers against genes of interest and following the manufacturer's protocols.\n\t\nCarry out all PCR reactions using the following conditions: 95 °C denaturation for 10 min followed by 40 cycles of 95 °C for 15 s, 55 °C for 30 s, and 60 °C for 30 s.\n\t\tNOTE: Primer pairs for DIP and dpr genes are listed in Table 1, and primers for olfactory receptor genes are listed in Hueston CE et al.8.\n6. Fixation of the Pupal Antennal Discs and Antennae for Immunohistochemistry\nNOTE: Fix the tissues in batches from 10 - 20 individuals to ensure the tissues are fixed for the same amount of time. Minimize the amount of time the samples stay in PBT (PBS with detergent) prior to transferring them to a fixative to maximize the integrity of the tissues.",
    "Collect the dissected antennal discs or pupal antennae in a 200-µL PCR tube containing 200 µL of 0.2% PBT on ice to maintain tissue integrity, and to avoid the sample from sticking to the wall of 200-µL PCR tubes which will lead to an incomplete fixation.\n\tNote: Pupal antennae and antennal discs can be difficult to see as they are quite translucent. It is advisable to use a dissection scope for all washing steps to prevent any loss of tissue. Alternatively, 96-well Terasaki plates may be used for the fixation and staining to best track the tissue.\nFix the dissected antennal disc and antennal samples from pupae in approximately 200 µL of 4% PFA (Paraformaldehyde) for 30 min at room temperature. For this and subsequent steps, keep the tubes with the samples on a nutator to properly mix the samples in the solution. Progress to step 6.7.\nFor the adult antenna, dissect the entire head first and fix it in approximately 200 µL of 4% PFA (paraformaldehyde) for 1 h at room temperature.\nWash 3x with 200 µL of 0.2% PBT for 10 min each. Keep the samples on the nutator during the incubation.\nGo back to the dissection microscope for a finer dissection of the second antennal segment from the fixed heads. Using forceps to stabilize the head, gently pull/pinch out the third antennal segment from the second.\nTransfer the dissected third antennal segments into approximately 200 µL of 4% PFA (paraformaldehyde) and fix them for 30 min at room temperature.\nWash 3x with 200 µL of 0.2% PBT for 10 min each. Keep the samples on the nutator during the incubation.\nStore the samples at 4 °C or continue directly with whole mount immunohistochemistry.",
    "Note: The efficiency of staining might change when the antibody is being used. This method should be appropriate for less abundant protein tags or weaker antibodies. However, at times, it might require an optimization of the protocol (either the identity or amount of the fixative or the time of fixation).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}