{
  "id": 18043,
  "origin_website": "Jove",
  "title": "Human Peripheral Blood Neutrophil Isolation for Interrogating the Parkinson's Associated LRRK2 Kinase Pathway by Assessing Rab10 Phosphorylation",
  "procedures": [
    "According to local UK regulation all manipulations and pipetting of human blood are undertaken in a category 2 biological safety cabinet. All procedures were performed in compliance with local ethics review board and all participants have provided informed consent.\n1. Preparation\nPrepare 0.1 mL of EDTA Stock Solution 1 containing 100 mM EDTA in phosphate-buffered saline (PBS).\nPrepare 60 mL of EDTA Stock Solution 2 containing 1 mM EDTA in PBS.\nPrepare lysis buffer containing 50 mM Tris-HCl (pH = 7.5), 1% (v/v) Triton X-100, 1 mM EGTA, 1 mM Na3VO4, 50 mM NaF, 10 mM β-glycerophosphate, 5 mM sodium pyrophosphate, 0.27 M sucrose, 0.1% (v/v) β-mercaptoethanol, 1x protease inhibitor cocktail, 1 μg/mL microcystin-LR, and 0.5 mM diisopropyl fluorophosphate (DIFP).\n\tNOTE: The authors routinely use an EDTA-free product, but an EDTA-containing protease inhibitor cocktail should also work. The lysis buffer can be made in advance without the β-mercaptoethanol, protease inhibitors, microcystin-LR, and DIFP, and stored at 4 °C until use. Ensure that the β-mercaptoethanol, protease inhibitors, microcystin-LR, and DIFP is only added immediately before use.\n\tCAUTION: DIFP is toxic and should be handled with care in a fume hood following local health and safety risk assessment. DIFP can be added to the lysis buffer and used immediately. Alternatively, the complete lysis buffer containing all other components, including DIFP, can be aliquoted and stored at -80 °C for subsequent use for at least 4 weeks.\n2. Neutrophil isolation from whole blood\nCollect 10 mL of blood into a blood collection tube. Mix gently by inverting tubes 7−8x.\nTransfer 10 mL of blood into a 50 mL conical tube.\nAdd 100 μL of EDTA Stock Solution 1 to the blood. Mix gently.",
    "Add 500 μL of the isolation cocktail (50 μL/mL) from the neutrophil isolation kit (Table of Materials) to the whole blood sample.\nVortex the magnetic beads from the neutrophil isolation kit for 30 s before use in order to resuspend the very fine magnetic beads.\nAdd 500 μL of the magnetic beads to the blood sample and mix gently by inverting the tube several times.\nIncubate at room temperature (RT) for 5 min.\nFill the tube to 50 mL with EDTA Stock Solution 2. Mix by very gently pipetting up and down 2–3x.\nPlace the tube into the magnet and remove the lid to avoid subsequent agitation of the tube.\nIncubate for 10 min at RT.\nCarefully pipette the enriched cell suspension that contains the neutrophils into a new 50 mL conical tube.\n\tNOTE: Do not touch the side of the tube that is in contact with the magnet and avoid collection and perturbation of the red blood cells at the bottom of the tube. Leave approximately 10 mL of the red blood cell suspension behind at the bottom of the tube.\nVortex the magnetic beads for 30 s before use and add 0.5 mL of the magnetic beads to the tube containing the enriched neutrophils. Mix gently by inverting the tube.\nIncubate at RT for 5 min.\nPlace the tube into the magnet and remove the lid to avoid subsequent agitation.\nIncubate at RT for 5 min.\nCarefully pipette the enriched cell suspension that contains the neutrophils into a new 50 mL conical tube.\n\tNOTE: Do not touch the side of the tube that is in contact with the magnet. Leave approximately 5 mL of the suspension at the bottom of the tube.",
    "To ensure the complete removal of magnetic beads from the cell mixture, place the tube containing the enriched cells into the magnet.\nIncubate for 10 min at RT.\nCarefully pipette the enriched cell suspension that now contains pure neutrophils into a new 50 mL conical tube.\n\tNOTE: Do not touch the side of the tube that is in contact with the magnet. Leave approximately 5 mL of the suspension at the bottom of the tube.\nMix the isolated cells with 1 mM EDTA Stock Solution 2 to a final volume of approximately 41 mL. Pipette up and down to mix.\nDivide the solution equally into two tubes with approximately 20 mL in each tube.\nCentrifuge both tubes at 335 x g for 5 min.\nDuring this centrifugation take MLi-2 inhibitor stock (200 µM/1,000x concentration) out of the -80 °C freezer and leave at RT for subsequent use.\nImmediately after the centrifugation step and without agitation of the tubes, pour off the supernatant without disturbing the neutrophil pellets. Resuspend each cell pellet in 10 mL of cell culture media (Table of Materials) at RT by gently pipetting cells up and down 4x.\n3. LRRK2 kinase inhibitor treatment of pure neutrophils\nLabel one tube \"DMSO\" and the other tube \"MLi-2\".\nTo the \"DMSO\" labeled tube, add 10 µL of DMSO and mix gently by pipetting up and down 2x with a 10 mL pipette. To the \"MLi-2\" labeled tube, add 10 μL of 200 μM MLi-2 stock solution (final concentration 200 nM) and mix gently by pipetting up and down 2x with a 10 mL pipette.\nIncubate the samples for 30 min at RT. Mix gently by inversion every 10 min during the incubation.",
    "During the incubation period, remove 0.5 M DIFP stock from the -80 °C freezer and place in a fume hood on ice. Remove 1 mg/mL microcystin-LR stock solution from the -80 °C freezer and leave at RT to thaw. Take an aliquot (0.25 mL) of the lysis buffer out of the freezer, allow it to defrost at RT, and then place it on ice for subsequent use.\nPrepare 1 mL of cell culture medium containing 1 μL of DMSO and call this DMSO resuspension buffer. Prepare 1 mL of RPMI media containing 1 μL of 200 μM MLi-2 and call this MLi-2 resuspension buffer.\nAfter the 30 min incubation period, centrifuge both tubes at 335 x g for 5 min.\nCarefully discard the supernatant in each tube without disturbing the neutrophil pellet.\nFor the DMSO labeled sample gently resuspend the pellet in 1 mL of the DMSO resuspension buffer and for the MLi-2 labeled tube, resuspend the pellet in 1 mL of the MLi-2 resuspension buffer.\nTransfer the resuspended cell pellets to corresponding centrifugation tubes labeled \"DMSO\" and \"MLi-2\" and centrifuge both tubes at 335 x g for 3 min.\nDuring the centrifugation step, prepare the lysis buffer. In the fume hood carefully add 0.25 μL of 0.5 M DIFP solution as well as 0.25 μL of 1 mg/mL microcystin-LR to the 0.25 mL lysis buffer. Mix and leave on ice until use.\n\tNOTE: Add DIFP to the lysis buffer within 15 min of cell lysis, because DIFP is relatively unstable in an aqueous solution.\nImmediately after the centrifugation, carefully and completely remove all the supernatant with a pipette without disturbing the neutrophil pellet and place the tubes on ice.",
    "Immediately add 100 µL of lysis buffer containing DIFP and microcystine-LR to each tube. Using a 100–200 μL pipette, resuspend the cell pellets by pipetting up and down about 5–10x.\nLyse the cells on ice for 10 min.\nCentrifuge tubes at 20,000 x g for 15 min at 4 °C to remove cell debris.\nTransfer the \"DMSO\" and \"MLi-2\" supernatants containing the neutrophil lysates into new centrifugation tubes. Discard the debris pellet.\n\tNOTE: The neutrophil lysates are now ready for use or can be snap frozen in liquid nitrogen and stored at -80 °C for future analysis.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}