{
  "id": 2918,
  "origin_website": "Cell",
  "title": "Detecting RNA-protein proximity at DNA double-strand breaks using combined fluorescence in situ hybridization with proximity ligation assay",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nFor an overview of the FISH-PLA workflow, see Figure 3[href=https://www.wicell.org#fig3].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2456-Fig3.jpg\nFigure 3. Diagram of a workflow of the FISH-PLA protocol\n(A) DNA probe hybridization.\n(B) Primary antibody incubation.\n(C) Illustration of the humidity chamber and the sample coverslip reaction during DNA probe hybridization, antibody incubation, and Duolink PLA steps.\n(D) Recognition of the target RNA by the DNA probe and the RNA binding protein by the primary antibody.\n(E) Incubation of the MINUS Duolink PLA probe.\n(F) Duolink ligation step between the PLUS DNA probe and the MINUS Duolink PLA probe.\n(G) Duolink Amplification step resulting in the formation of FISH-PLA foci.\n(H) Imaging analysis using ImageJ and CellProfiler softwares.\nPreparation of cells\nTiming: 24 h\nThe following steps describe the cell seeding procedure on poly-l-lysine coated coverslips in a 6 well plate format.\nNote: The use of coating reagents such as poly-l-lysine is optional. Other coating reagents could also potentially be used such as Matrigel®, gelatin, or collagen.\nInsert one sterile coverslip (20 mm diameter) into each well of a 6 well plate.\nAdd 2 mL of 0.01% poly-L-lysine solution in PBS into each well of a 6 well plate and incubate at 37 °C for 30 min.\nVacuum aspirate the poly-l-lysine solution and wash twice with 2 mL PBS.\nSeed 3 × 105 U2OS-AsiSI-ER cells in 2 mL of complete DMEM (1× Pen/Strep, 10% FBS).\nCells should be allowed to attach on coverslips for 24 h incubating at 37°C with 5% CO2.",
    "Critical: After poly-l-lysine incubation, wells should be washed at least twice with PBS as residual poly-l-lysine is toxic and may cause cell death. To ensure a successful FISH-PLA assay, cells should be maintained in a transcriptionally active state, and therefore the confluency should reach no more than 60%–70% after 24 h.\nDSB induction, cell fixation, blocking\nTiming: 6 h\nThe steps below describe DSB induction, cell fixation and blocking.\nCritical: Before starting the DSB induction, switch on the hybridization oven and a thermoblock, setting the temperature at 95 °C. Additionally, pre-warm a humidified chamber to 37°C.\nVacuum aspirate the culture media.\nAdd 500nM of 4-hydroxytamoxifen (4-OHT) in 2 mL of complete DMEM (1× Pen/Strep, 10% FBS) and incubate 37°C with 5% CO2 for 4 h.\nWash twice with 2 mL ice cold PBS.\nAdd 2 mL of PFA (4% in PBS) and incubate for 15 min at room temperature to fix the cells, then wash 3 times with 2 mL ice cold PBS and permeabilize with 0.2%–0.5% Triton X100 for 10 min.\nWash 3 times with PBS. Add 80 μL of FISH-PLA Blocking Buffer (per coverslip) to a pre-warmed humidified chamber and place the coverslip face down on the FISH-PLA blocking solution. Incubate for 1 h at 37°C.\nFISH-PLA DNA probes buffer preparation and oligonucleotide hybridization\nTiming: 16–18 h\nThe following steps summarize FISH-PLA probes hybridization, washing steps and primary antibody incubation.\nFISH-PLA DNA probe buffer should be prepared in two steps.\nFirstly, add SSC, diluted DNA probes, and DEPC-H2O to an RNAse-free 1.5 mL tube. Incubate at 95°C for 3 min followed by immediate snap-cooling on ice.\nAfter cooling, add Triton X-100, RNAsin plus, and sssDNA, keeping the solution on ice.",
    "Critical: The denaturation and snap-cooling steps are important to preserve the linearization of the DNA probes and avoid the formation of DNA secondary structure.\nAdd 60 μL of FISH-PLA probe buffer onto glass slides and place them in the humidified chamber. Incubate in a hybridization oven at 95°C for 3 min, followed by 12–18 h incubation at 37°C.\nFISH-PLA DNA probe washing\nTiming: 30 min\nTake the coverslip from the humidified chamber and place into new 6 well plate. Add 2 mL of 2× SSC washing buffer and incubate at 20°C for 5 min with gentle rocking. Repeat the SCC washing step twice more.\nWash twice with 2 mL PBS for 5 min, gently rocking.\nPLA blocking and primary antibody incubation\nTiming: 16–18 h\nAdd 80 μL of Duolink Blocking Solution to each coverslip and incubate at 37°C for 1 h.\nDilute the primary antibody (see key resources table[href=https://www.wicell.org#key-resources-table]) in Duolink Antibody Diluent and add 60 μL of the primary antibody solution to each coverslip. Incubate 12–18 h at 4°C in a humidified chamber.\nCritical: Do not allow sample to dry out. To remove the excess buffer, quickly tap the coverslip on a tissue.\nPLA Duolink protocol\nTiming: 4 h\nThe steps herein describe PLA part of the protocol using Duolink KIT components.\nNote: Prewarm PLA wash buffers A and B to room temperature in a water bath set at 37°C.\nAdd 2 mL of Wash Buffer A in each well of a 6 well plate, tap off the excess primary antibody solution from the coverslips and place the coverslips cell side up in the wash buffer. Incubate at 20°C for 5 min with gentle rocking. Repeat this step twice.\nDilute the Minus PLA probe 1:5 in Duolink Antibody Diluent.",
    "Add 60 μL of the probe solution onto the parafilm in the humidity chamber.\nTap off the excess buffer from the coverslips and place coverslips cell side down onto the probe solution in the humidity chamber and incubate at 37°C for 1 h.\nNote: Thaw the Duolink ligation buffer during the minus PLA probe incubation. The buffer contains DTT which can precipitate. Resuspend the buffer by pipetting to dissolve any precipitates.\nAdd 2 mL of Wash Buffer A to each well of a 6 well plate, tap off any excess probe solution and place the coverslips cell side up in the wash buffer. Incubate at 20°C for 5 min with gentle rocking. Repeat this step twice.\nDilute the Duolink ligase buffer at a 1:5 ratio in DEPC-H2O.\nFor 60 μL of ligase reaction solution, add 1.5 μL of ligase enzyme to 58.5 μL of the diluted Duolink ligase buffer.\nNote: Prepare the ligation reaction solution during the washing step.\nAdd 60 μL of ligase buffer onto the parafilm in the humidity chamber.\nTap off the excess buffer from the coverslips and place cell side down in the humidity chamber, incubating at 37°C for 30 min.\nNote: Thaw the Duolink amplification buffer during the ligation reaction incubation.\nAdd 2 mL of Wash Buffer A to each well of 6 well plate, tap off the excess ligase reaction solution and place the coverslips cell side up. Incubate at 20°C for 5 min with gentle rocking. Repeat this step twice.\nDilute the Duolink amplification buffer at a 1:5 ratio in DEPC-H2O and protect from light.\nFor a 60 μL ligase reaction, add 0.75 μL of polymerase enzyme to 59.25 μL of the diluted Duolink ligase buffer.\nNote: prepare the amplification reaction solution during the washing step and protect from light.",
    "Add 60 μL of the amplification solution onto the parafilm in the humidity chamber.\nTap off the excess buffer from the coverslips, place coverslips cell side down in the humidity chamber, and incubate at 37°C for 1 h and 40 min (protecting from light).\nAdd 2 mL of Wash Buffer B in each well of a 6 well plate, tap off the excess probe solution and place the coverslips cell side up. Incubate at 20°C for 10 min with gentle rocking. Repeat this step twice, protecting from light.\nPerform the last wash with 0.01× washing buffer B at 20°C for 1 min, protecting from light.\nAdd 50 μL of Duolink in situ Mounting medium with DAPI to a microscope slide.\nTap off the excess of washing solution and mount the coverslip on the microscope slide, sealing the edges of the coverslip with clear nail varnish.\nNote: avoid producing air bubbles during the coverslip mounting.\nCritical: Wait 15 min before the acquisition of images at the microscope.\nPause point: The slides can be stored at 4°C in the dark. However, to ensure good image quality, it is recommended to image the slides within 3–4 days after mounting.\nConfocal microscope setup\nTiming: variable, mainly depends on the slide number and microscope-specific acquisition parameters (2–6 h)\nThe steps below describe image acquisition and analysis using an Olympus Confocal Microscope and CellProfiler software.\nCritical: Sample slides should be imaged maintaining constant microscope parameters (e.g., laser power).\nAll imaging was performed using an Olympus Confocal Microscope FV1200, with a 60× objective. The filters DAPI (405nm) and Texas Red (559nm) were used, with speed settings at fast and an area of 1024 × 1024. The images were acquired using Z stacks at a 1 μm step size.",
    "FISH-PLA image analysis using Fiji Image J and CellProfiler software\nTiming: variable from 2–6 h\nCritical: Confocal images acquired by the confocal microscope can be saved in oib format (Olympus Image Binary) and should be processed using Fiji Image J software.\nOpen the image in Fiji Image J software. In the options for “Bio-formats import options”, tick the box “Split channels”. Two windows corresponding to the DAPI signal (e.g., sample_name.oib – C = 0) and FISH-PLA signal (e.g., sample_name.oib – C = 1) will open.\nNote: Split images can be visualized in greyscale or in arbitrary colours that can be set by selecting from the main menu ‘Image/Colour/Channels tool’.\nIn the main menu of ImageJ, select Image/Stacks/Z Project to stack all the z stacks acquired at the microscope. In the window ‘ZProjection’ insert values for “Start slice” and “Stop slice” and select Max intensity from the from the drop-down menu “Projection Type”. Save the processed images as TIFF files.\nFor examples, see Figures 4[href=https://www.wicell.org#fig4] and 5[href=https://www.wicell.org#fig5] for FISH-PLA on 53BP1 and TIRR at DS1 and DS2.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2456-Fig4.jpg\nFigure 4. FISH-PLA showing 53BP1 proximity to nascent RNA at DSBs\n(A) Left, FISH-PLA of 53BP1 and DS1 probes, with and without 4-OHT (500 nM, 4 h) or α-Amanitin (2 μg/mL, 24 h). Right, quantification of right, (mean ± SD, n = 2), ∗∗∗∗p < 0.0001.\n(B) Left, FISH-PLA of 53BP1 and DS2 probes, with and without 4-OHT (500 nM, 4 h) or α-Amanitin (2 μg/mL, 24 h). Right, quantification of right, (mean ± SD, n = 2), ∗∗∗∗p < 0.0001. Images and quantification shown here were taken from1[href=https://www.wicell.org#bib1] and adapted for the purposes of this protocol.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2456-Fig5.jpg\nFigure 5. FISH-PLA showing TIRR proximity to nascent RNA at DSBs",
    "(A) Left, FISH-PLA of TIRR and DS1 probes, with and without 4-OHT (500 nM, 4 h) or α-Amanitin (2 μg/mL, 24 h). Right, quantification of right, (mean ± SD, n = 2), ∗∗∗∗p < 0.0001.\n(B) Left, FISH-PLA of TIRR and DS2 probes, with and without 4-OHT (500 nM, 4 h) or α-Amanitin (2 μg/mL, 24 h). Right, quantification of right, (mean ± SD, n = 2), ∗∗∗∗p < 0.0001. Images and quantification shown here were taken from1[href=https://www.wicell.org#bib1] and adapted for the purposes of this protocol.\nCritical: Saved images should maintain the C = 0 and C = 1 terms in the file name, as this is important for the image processing in CellProfiler software.\nAnalysis of FISH-PLA images with the CellProfiler software\nTiming: variable from 2–24 h\nDownload the Speckle Counter Pipeline (cellprofiler.org/examples#speckle-counting) and open the pipeline with the CellProfiler Software (File/Import/Pipeline from File).\nNote: The Speckle Counter Pipeline consists of several modules, each module is responsible for a specific image-processing step in the pipeline.\nCritical: The Speckle Counter pipeline should be optimized on a few images, ideally on positive and negative control images. The optimization step should evaluate the relationship between the foci and the nuclei, resulting in the automated identification of the number of foci per nucleus.\nCellprofiler settings can be modified by selecting specific input modules at the top left of the CellProfiler window (i.e., Images and Name And Types), as described below.\nSelect the Images module and upload the images to be analyzed (e.g sample_name.oib – C = 0 and sample_name.oib – C = 1) by dragging and dropping the files into the Images tab.",
    "Select the NameAndTypes module and select “Images matching rules” next to the “assign a name to” section. Next to the “Select the rule criteria” and “File/Does/Contain” insert the value “C = 0”. In the box “Name to assign these images” insert “DAPI”. Select “Color image” or “Grayscale image” in the “image type” section, depending on the saved file after the Image J processing.\nRepeat for the foci images, setting “C = 1” in the “Select the rule criteria”/“File/Does/Contain” and assign the name “FISHPLA”\nClick “Update” at the bottom of the window to list the selected files.\nNote: this module assigns a name to each image, by which the following modules will refer to it.\nSet the following settings in the downstream analysis modules (i.e., Identify Primary Objects, Mask Image, Measure Object Intensity, Relate Objects):\nIn the “Identify Primary Objects” section, select the input image value as “DAPI” for the identification of the nuclei and name the primary objects to be identified as “Nuclei”. Maintain the typical diameter of objects, in pixel units (Min, Max) within the range 30–200.\nSelect the input image as “FISHPLA” in the Mask Image and name the output image as “MaskedFoci”\nIn the second “Identify Primary Objects” section, select the input image value as “MaskedFoci” for the identification of the foci using per-object thresholding, and name the primary objects to be identified as “Foci”. Set the appropriate pixel units based on the size of the foci generated (usually between 4–35).\nIn the “Relate Objects” module identify the “Parent Objects” as Nuclei and the “Child Objects” as Foci.\nFor examples of the CellProfiler outputs see Figure 6[href=https://www.wicell.org#fig6].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2456-Fig6.jpg\nFigure 6. Screenshots of the CellProfiler output for the identification of the primary objects\n(A) Identification of the Nuclei (green circles).\n(B) Zoomed area from (A).",
    "(C) Identification of the Foci (green spots).\n(D) Zoomed area from (C).\n(E) Definition of the related objects (Nuclei + Foci).\nNote: To visualise the results of each module, select “Start Test Mode” located in the menu bar at bottom of the CellProfiler window. Pause and play icons will appear next to the different analysis modules. Select “Step” to visualize the outputs from each of the analysis modules (Figure 4[href=https://www.wicell.org#fig4]).\nFinally in the section “Export to Spreadsheet”, select the output folder and plot the Children Foci Count values present in the excel file “Nuclei” using GraphPad Prism software.\nCritical: For the accurate identification of both the nuclei and foci, some manual optimization in the input analysis settings may be required. Additional settings such as the threshold strategy, thresholding method, method to distinguish clumped objects, and method to draw dividing lines between clumped objects, can be optimised. In order to evaluate the results of the chosen settings, Test Mode can be used."
  ],
  "subjectAreas": [
    "Molecular/Chemical Probes",
    "Microscopy",
    "Cell Biology",
    "In Situ Hybridization",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}