{
  "id": 10872,
  "origin_website": "Jove",
  "title": "Multi-Modal Signals for Analyzing Pain Responses to Thermal and Electrical Stimuli",
  "procedures": [
    "The study was conducted in accordance with the ethical guidelines laid down in the World Medical Association Declaration of Helsinki (ethical committee approval was granted: 196/10-UBB/bal) and approved by the ethics committee of the University of Ulm (Helmholtzstraße 20, 89081 Ulm, Germany).\n1. Subject recruitment and selection\nRecruit an equal number of healthy female and male subjects between 18 and 50 years of age through posters, handouts, local press advertisements, and social media to achieve a mostly general sample. Advertise the scientific benefit of the study and offer a monetary compensation. Provide telephone number or contact email address for further information.\n\tNOTE: Age-related effects in pain sensitivity are well reported22 and should be considered in the sample selection. To avoid confounding the results with age effects, we choose a younger group as considered by Lautenbacher et al.22.\nExclude potential subjects who meet any of the following criteria: suffering from chronic pain, depression, or a history of psychiatric disorders; having neurological conditions, headache syndrome, or cardiovascular disease; regularly taking pain medication or using painkillers directly before the experiment.\n2. General preparations of the pain elicitation experiment\nNOTE: The pain elicitation experiment consists of two temporally successive parts: the calibration part and the pain stimulation part. The calibration part determines a participant’s individual pain threshold and pain tolerance level in terms of thermal and electrical stimuli. The pain stimulation part performs the pain induction adjusted to the individual thresholds. Each part of the experiment takes place in a different room: the calibration room and the experimental room. The calibration room also serves as a monitoring room for the experimenter during the pain stimulation part (see Figure 1). \nimgsrc://cloudfront.jove.com/files/ftp_upload/59057/59057fig1.jpg",
    "Figure 1: Schematic representation of room setup. The right side shows the calibration/monitoring room where the calibration part takes place. Later on, it also serves as a signal monitoring room during the pain stimulation part, which follows the calibration part. The left side shows the experimental room where the pain stimulation part takes place. Both rooms are connected by a conduit pipe, which the thermode, the electrodes’ cable of the electrical stimulator and computer wires can be passed through. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/59057/59057fig1large.jpg]\nWelcome the arriving subject and lead her/him to the calibration room. Inform the participant in detail about the 3 h experiment and the possibility of termination at any time without any negative consequences. Obtain a written informed consent for the experiment and a written confirmation that none of the exclusion criteria apply. Prepare a receipt and the monetary compensation.\nUse CE-marked stimulators that allow for inducing highly controlled thermal and electrical stimuli. Use analogue-to-digital converters that convert the analog thermal and electrical stimuli into digital signals to capture. Turn on the thermal and the electrical stimulator.\nFor the calibration and the main part of the experiment, employ appropriate software, which enables the manual and/or automatic triggering of thermal and electrical stimuli. Launch the software of the thermal and electrical stimulator. Prepare pencil and paper to write down stimuli intensities and the corresponding pain intensities reported by the participant.",
    "Let the subject sit down comfortably on a chair with a right-sided armrest. Place a printed rating scale going from 0 to 100 in steps of 5 with, on the left, anchor point 0/no pain and, on the right, anchor point 100/intolerable pain in front of the subject. Instruct the subject to verbally rate the pain intensity of a stimulus immediately when asked to do so, using the scale provided. Accurately explain that only zero means “no pain” while 100 equals a stimulus that cannot be tolerated anymore.\n\tNOTE: In this study, “pain tolerance” is understood as the intensity of a stimulus that a subject cannot bear anymore, meaning here: cannot tolerate anymore. Thus, the anchor point 100 is marked as intolerable pain in contrast to a numerical rating scale used in clinical practice.\n3. Calibration of electrical pain threshold and tolerance (parts 1 and 2)\nNOTE: Only one experimenter should conduct the calibration part to minimize the social effects on pain sensitivity. Choose an experimenter with the same sex as the participant to minimize cross-sex effects on pain sensitivity23. Part 1 determines pain threshold and tolerance in terms of short (phasic) electrical stimuli and part 2 in terms of longer lasting (tonic) electrical stimuli. Those values serve as a basis for calculating the phasic and tonic electrical pain stimuli applied in the pain stimulation part.\nClean the participant’s skin of the right index and middle finger with alcohol solution. Place one disposable Ag/AgCl electrode (skin contact size: 34 mm in diameter) on the upper side of the intermediate phalanx of the right index finger (anode) and another one on the upper side of the proximal phalanx of the right middle finger (cathode). Connect the electrodes to the electrical stimulator.",
    "Ask the subject to rest their right arm comfortably on the armrest and provide them with instructions for the following procedure.\n\tNOTE: Here is an example of how to formulate the instruction for the electrical calibration part 1: “You are going to experience short electrical stimuli of different intensities. We start with a very low intensity. First, you are required to indicate the first time you feel low pain. This will be your ‘Pain Threshold’. In order to determine this threshold, I will start an electrical stimulus, and shortly before it ends, I’m going to say ‘Now.’ When this happens, you should immediately report whether the stimulus was painful or not by rating it on a scale from zero to one hundred. If the stimulus was not painful, please report ‘Zero.’ I will then go on with an increased intensity. After the first time you report a number greater than zero, I will reduce the intensity a few levels and we repeat the whole procedure until you indicate a number greater than zero again. We do this to validate the ‘Pain Threshold’. After that, I will slowly increase the intensity to the point where you rate the stimulus with ‘One hundred,’ meaning you cannot tolerate or stand the pain anymore. This will be your ‘Pain Tolerance Level’. Again, to validate this level, I will go back a few levels and we will repeat the procedure until you report ‘One hundred’ for the second time. As soon as you say ‘One hundred,’ I will immediately stop the stimulus.”\nBegin electrical calibration part 1 by starting a stimulus of 0.5 mA (400 V) with a duration of 5 s by clicking the start button of the electrical stimulator (software).",
    "NOTE: Each electrical stimulus of the electrical calibration part 1 has a duration of 5 s. The stimulus consists of 100 single electroshocks of 2 ms duration, each distributed equally over the 5 s.\n\tCAUTION: The electrical calibration always starts with 0.5 mA and has a cutoff at 25 mA in order to prevent unconsciousness and life threatening situations.\nSay “Now” at the 4th second of the stimulus. Write down the number the subject reports for the corresponding stimulus intensity. Conduct a pause of 10 s long.\nIf the subject reports zero, increase the intensity by 0.5 mA, start the stimulus, and go back to step 3.4. Otherwise, reduce the intensity by 1.5 mA (minimum: 0.5 mA), start the stimulus, and go back to step 3.4. When the subject reports a number greater than zero for the second time, calculate the mean of the two intensities corresponding to zero, write it down and mark it as “phasic Electrical Pain Threshold” (pEPTh). Afterward, continue with step 3.6.\nIncrease the current intensity by 0.5 mA and start the stimulus.\nSay “Now” after 4 s from starting the stimulus. Write down the number the subject reports for the corresponding stimulus intensity. Pause for 10 s.\nIf the subject reports a value below 100, increase the intensity by 0.5 mA, start the stimulus, and go back to step 3.7. Otherwise, reduce the intensity by 1.5 mA (minimum: 0.5 mA), start the stimulus, and go back to step 3.7. When the subject reports 100 for the second time, calculate the mean of the two intensities corresponding to 100, write it down, and mark it as “phasic Electrical Pain Tolerance” (pEPTo). Continue with step 3.9.\nInform the participant about part 2 of the electrical calibration.",
    "NOTE: This is a possible instruction for electrical calibration part 2: “Again we are starting with a low intensity, but this time, the stimuli will be longer. I am going to say ‘Now’ two times, right after the beginning and shortly before the ending of a stimulus. Every time I say ‘Now,’ you report a number as you did in the first part. After the first time you report a number greater than zero, I will reduce the intensity a few levels and we repeat the whole procedure for validation purposes, until you indicate a number greater than zero again. Following that, I will slowly increase the intensity to the point where you rate the stimulus with ‘One hundred.’ Again, to validate this threshold, I will go back a few levels and we will repeat the procedure until you report ‘One hundred’ for the second time. As soon as you say ‘One hundred,’ I will immediately stop the stimulus.”\nBegin electrical calibration part 2 by starting a stimulus of 0.5 mA (400 V) with a duration of 10 s by clicking the start button of the electrical stimulator (software).\n\tNOTE: Each electrical stimulus of the electrical calibration part 2 has a duration of 10 s. The stimulus consists of 200 single electrical shocks of 2 ms of duration each, distributed equally over the 10 s.\nSay “Now” after 1 s from starting the stimulus. Write down the number the subject reports for the corresponding stimulus intensity. Say “Now” 1 s before the stimulus ends and, again, write down the number the subject now reports for the corresponding stimulus intensity. Pause for 10 s.",
    "If both of the subject’s reports are zero, increase the intensity by 0.5 mA, start the stimulus, and go back to step 3.11. Otherwise, reduce the intensity by 1.5 mA (minimum: 0.5 mA), start the stimulus, and go back to step 3.11. When the subject reports a number greater than zero for the second time, calculate the mean of the two intensities corresponding to zero, write it down, and mark it as “tonic Electrical Pain Threshold” (tEPTh). Afterward, continue with step 3.13.\nIncrease the current intensity by 0.5 mA and start the stimulus.\nSay “Now” after 1 s from starting the stimulus. Write down the number the subject reports for the corresponding stimulus intensity. Say “Now” 1 s before the stimulus ends. Again, write down the number the subject now reports for the corresponding stimulus intensity. Pause for 10 s.\nIf both of the subject’s reports are below 100, increase the intensity by 0.5 mA, start the stimulus, and repeat steps 3.14‒3.15. Otherwise if any of the subject’s reports is exactly 100, reduce the intensity by 1.5 mA (minimum: 0.5 mA), start the stimulus, and repeat steps 3.14‒3.15. When the subject reports 100 for the second time, calculate the mean of two intensities corresponding to 100, write it down, and mark it as “tonic Electrical Pain Tolerance” (tEPTo). Continue then with step 3.16.\nDisconnect the electrodes from the electrical stimulator and remove both Ag/AgCl electrodes from the participant’s fingers. Clean the fingers with alcohol solution to wash off the electrode gel remains.\n4. Calibration of thermal pain threshold and tolerance (parts 1 and 2)",
    "NOTE: The thermal pain calibration is divided into two parts. Part 1 determines pain threshold and tolerance in terms of short (phasic) thermal stimuli and part 2 does so in terms of longer lasting (tonic) thermal stimuli. Those values serve as basis for calculating the phasic and tonic thermal pain stimuli applied during the pain stimulation part.\nApply a 30 mm x 30 mm thermode to the upper side of the subject’s right forearm, about 30 mm proximal to the wrist, by a hook-and-loop fastener strap. Ask the subject to rest their right arm comfortably on the armrest.\n\tNOTE: A thermode is the probe/part of the thermal stimulator which is attached to the subject’s skin and induces the actual thermal stimulus.\nInform the subject about the procedure of the thermal calibration part 1.\n\tNOTE: A formulation for the instruction for thermal calibration part 1 might be: “You are now going to experience short but constant thermal stimuli of different intensities. We start with a temperature just above your body temperature. A thermal stimulus will start and shortly before it ends, I will say ‘Now.’ When this happens, you should quickly report whether the stimulus was painful or not by rating it on a scale from zero to one hundred, like you did in the electrical calibration part. Similarly, if the stimulus was not painful, please report ‘Zero.’ I will then go on with an increased intensity. There is always a pause of a few seconds between two stimuli. The calibration phase is finished when you report ‘One hundred’ or the cutoff temperature is reached.”\nBegin thermal calibration part 1 by starting a stimulus of 39 °C with a duration of 5 s by clicking the start button of the thermal stimulator (software).",
    "CAUTION: The thermal calibration part 1 has a cutoff temperature of 50 °C in order to prevent skin burns.\n\tNOTE: Each thermal stimulus of the thermal calibration part 1 has a duration of 5 s.\nSay “Now” at the 4th second of the stimulus. Write down the intensity number the subject gives for the corresponding temperature. Pause for 10 s.\nIf the indication of the subject is below 100, increase the temperature by 1 °C, start the stimulus, and repeat steps 4.4‒4.5. Otherwise, if the indication is 100, or the cutoff temperature of 50 °C is reached, terminate thermal calibration part 1 by continuing with the next step.\nCheck the noted numbers and mark the first temperature with a corresponding intensity number greater than zero as “phasic Heat Pain Threshold” (pHPTh). Mark the temperature with an indication of 100 as “phasic Heat Pain Tolerance” (pHPTo).\n\tNOTE: If the subject reports a number below 100 at the cutoff temperature (50 °C), mark 50 °C as pHPTo.\nInform the participant about part 2 of the thermal calibration.\n\tNOTE: Here is an exemplary formulation for the instruction for this thermal calibration phase: “We start with a temperature above your body temperature, but this time the thermal stimuli will be longer. I will say ‘Now’ two times: right after the beginning and shortly before the ending of the stimuli. Every time I say ‘Now,’ you report a number that equals your pain experience. If the stimulus was not painful, please report ‘Zero.’ I will then go on with an increased temperature. There is always a pause of a few seconds after each stimulus. The calibration phase is finished when you report ‘One hundred’ or the cutoff temperature is reached.”",
    "CAUTION: The thermal calibration part 3 has a cutoff temperature of 49.5 °C in order to prevent skin burns, due to the longer stimulus duration.\nBegin thermal calibration part 2 with a stimulus of 39 °C for 10 s long by clicking the start button of the thermal stimulator (software).\n\tNOTE: Each thermal stimulus of the thermal calibration part 2 has a duration of 10 s.\nSay “Now” after 1 s from starting the stimulus. Write down the intensity number the subject reports for the corresponding temperature. Say “Now” 1 s before the stimulus ends. Again, write down the intensity number the subject now reports for the corresponding temperature. Pause for 60 s.\nIf both indications of the subject are below 100, increase the temperature by 1 °C (exception: see note below), start the next stimulus, and repeat step 4.16. Otherwise, if any of the reports is exactly 100 or the cutoff temperature of 49.5 °C is reached, terminate thermal calibration part 2 by continuing with the following step.\n\tNOTE: In this calibration phase, the temperature steps are: 39 °C, 40 °C, 41 °C, 42 °C, 43 °C, 44 °C, 45 °C, 46 °C, 47 °C, 48 °C, 49 °C, 49.5 °C.\nCheck the noted numbers and mark the first temperature at which at least one of the corresponding numbers is greater than zero as “tonic Heat Pain Threshold” (tHPTh). Mark the temperature with a first noted report of 100 as “tonic Heat Pain Tolerance” (tHPTo).\n\tNOTE: If the subject reports both numbers below 100 at the cutoff temperature (49.5 °C), mark 49.5 °C as tHPTo.",
    "Remove the thermode from the participant’s underarm. Ask the subject whether they need a short break and/or want to use the sanitary facility. To perform a check if the participant is suitable for the pain stimulation part in terms of thermal stimuli, follow the instructions described in Supplementary File 1.\n5. Preparation of the pain stimulation experiment\nConduct the pain stimulation in a camera-monitored, temperature-controlled, and low-noise experimental room next to the calibration/monitoring room (see Figure 1). Connect both rooms via a conduit pipe (80 mm in diameter). \n\tNOTE: Camera monitoring provides information about the subject’s health status and allows for rapid intervention in case of sudden unconsciousness or circulatory collapse.\nSet up an examination couch on which the subject lies during the experiment. Place it with the long side next to a wall near the conduit pipe. Provide a pillow for the head.\nAttach a mirror to the wall next to the examination couch where the head of the subject will rest.\nFor capturing physiological data (ECG, 3 x EMG, and SCL), audio, videos (frontal and side view of the face, the facial skin temperature, and a full body view), and thermal and electrical stimulator outputs during the experiment, use appropriate recording computers, software, and recording devices (a biosignal recorder, three high-resolution color cameras, one thermal camera, and one directional microphone). \n\t\nDevelop a solution for synchronizing the recorded modalities. It may comprise a hardware triggering of devices, a recording of trigger signals by the biosignal and audio recorders, computer clock synchronization (e.g., via NTP) and a recording of timestamps along with the data streams, and postprocessing of the recorded data streams to compensate for temporal offsets and clock drift.",
    "Install the full body view camera in a way that it captures the whole body of the subject. Install the frontal face view camera approximately 1 m above the head of the participant. Mount the microphone on the left side and the thermal camera on the right side, next to the frontal face camera. Attach the side view camera to the ceiling. Adjust it to a point where it is able to record one side of the subject’s face, as well as the opposite side reflected in the mirror (see Figure 2).\nimgsrc://cloudfront.jove.com/files/ftp_upload/59057/59057fig2.jpg\nFigure 2: Schematic representation of camera and microphone setup. The frontal face camera, thermal camera and microphone are set up approx. 1 m above the head of the participant. A side view camera captures both sides of the face with the help of a mirror. A body view camera mounted to the wall allows for the recording of body movement. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/59057/59057fig2large.jpg]\nNOTE: Due to a small experimental room, combining a side view camera with a mirror is a very elegant solution to capture both sides of the subject’s face with just one camera.\nDuplicate the graphical output of the biosignal recording computer to a computer monitor set up in the calibration/monitoring room. \nSet up active PC speakers in the calibration/monitoring room. Connect them via the conduit pipe with the audio-recording computer. Make sure to hear the participant via the microphone in case they need assistance during the experiment.\nPass the thermode and the electrodes’ cable of the electrical stimulator through the conduit pipe to the experimental room. Put rolled up acoustic foam in both sides of the conduit pipe (or a similar material that absorbs sound).",
    "NOTE: Leave the thermal stimulator in the calibration/monitoring room. It contaminates the audio signal recording due to regularly starting its internal ventilator in order to cool down. \nSet the recording sampling rates as follows: (a) audio at 44.1 kHz; (b) frontal and side view cameras at 25 Hz; (c) full body view camera at 30 Hz; (d) thermal camera at 120 Hz; (e) SCL, EMG, and ECG at 1,000 Hz. Save all settings.\nGet a cold gel pack (100 mm x 100 mm) and put it into a freezer. Prepare a 200 mm x 200 mm hygienic nonwoven towel or something similar (e.g., a thin paper towel) and an ointment.\nCalculate 12 individual stimulus intensities, six each for the heat and electrical pain induction, as follows: (a) phasic electrical pain intensity 3 (pE3) = 90% of pEPTo; (b) phasic electrical pain intensity 2 (pE2) = (pE3 + pEPTh)/2; (c) phasic electrical pain intensity 1 (pE1) = pEPTh; (d) tonic electrical pain intensity 3 (tE3) = 90% of tEPTo; (e) tonic electrical pain intensity 2 (tE2) = (tE3 + tEPTh)/2; (f) tonic electrical pain intensity 1 (tE1) = tEPTh; (g) phasic heat pain intensity 3 (pH3) = pHPTo - 0.5 °C if the subject reported 100 for pHPTo—otherwise, pH3 = pHPTo; (h) phasic heat pain intensity 2 (pH2) = (pH3 + pHPTh)/2; (i) phasic heat pain intensity 1 (pH1) = pHPTh; (j) tonic heat pain intensity 3 (tH3) = tHPTo - 0.5 °C if the subject reported 100 for tHPTo—otherwise, tH3 = tHPTo; (k) tonic heat pain intensity 2 (tH2) = (tH3 + tHPTh)/2; (l) tonic heat pain intensity 1 (tH1) = tHPTh.",
    "Enter the values of the phasic electrical (pE1‒pE3) and heat pain intensities (pH1‒pH3) and tonic electrical (tE1‒tE3) and heat pain intensities (tH1‒tH3)—calculated in step 5.11 based on the calibration performed as per sections 3 and 4—into the software of the thermal and electrical stimulator. Set the baseline (no pain) temperature to 32 °C and the temperature rate of increase to 8 °C/s. Save all settings.\nUse a scripting language-based computer software, which communicates with the thermal and electrical stimulator. Make sure it allows for controlling and triggering pain stimuli based on a pain elicitation script.\n\tNOTE: A pain elicitation script triggers the randomized pain stimuli and controls timing and duration. In this study, the software of the thermal stimulator provides the possibility for preparing a pain elicitation script. The software triggers thermal stimuli automatically and sends signals when an electrical stimulus shall be triggered. Electrical stimuli are triggered by a script prepared in a second software.\nPrepare the pain elicitation script (see Figure 3) as follows. Set the number of each phasic stimulus intensity (pE1, pE2, pE3, pH1, pH2, and pH3) to 30 and the number of each tonic stimulus intensity (tE1, tE2, tE3, tH1, tH2, and tH3) to 1. Set the duration of each phasic stimulus to 5 s and the duration of each tonic stimulus to 60 s. Randomize the order of all stimuli. Randomize the pauses between the phasic stimuli to 8–12 s. Set the pauses after the tonic stimuli to 300 s. Save all settings.\n\tNOTE: Due to the longer duration, the number of the different tonic heat stimuli is set to 1 to avoid skin burns. All pauses after tonic stimuli must be 300 s in order to allow physiological signals to return to baseline and, thereby, not contaminate subsequent signals. \nimgsrc://cloudfront.jove.com/files/ftp_upload/59057/59057fig3.jpg",
    "Figure 3: Graphical illustration of the pain stimulation part. (A) Exemplary pain elicitation script with randomized phasic (blue) and tonic (red) pain stimuli. (B) Excerpt from the pain elicitation script above: Three phasic stimuli with a duration time of 5 seconds and subsequent pauses. The duration of pauses varies between 8 and 12 seconds. (pH1, pH2, pH3 = phasic heat pain with intensity 1, 2, 3; tH1, tH2, tH3 = tonic heat pain with intensity 1, 2, 3; pE1, pE2, pE3 = phasic electrical pain with intensity 1, 2, 3; tE1, tE2, tE3 = tonic electrical pain with intensity 1, 2, 3; s = seconds). Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/59057/59057fig3large.jpg]\n6. Pain stimulation\nLead the participant to the experimental room and tell them about the upcoming procedure. Explain the experimental setup and the functionalities of the instruments. Inform the subject again about the possibility to abort the experiment anytime by either pressing a provided emergency button or asking to stop.\nAsk the subject to lie down comfortably on the examination couch. Instruct them to keep lying on their back during the experiment.\nClean all skin areas where the electrodes will be attached with alcohol solution. Remove any dead skin cells on the surface of the left cheek, behind the left ear, and above the left eyebrow with abrasive gel. Reclean these areas with an alcohol solution.\nFor the measurement of the SCL, attach two pregelled, nonpolarizable Ag/AgCl electrodes to the underside of the distal phalanx of the right index and middle finger by Velcro straps. Make sure the straps are not too tight. They are too tight if the subject reports a throbbing sensation in their fingertips.",
    "To record the ECG, use three pregelled, adhesive Ag/AgCl snap electrodes with circular contact areas (34 mm in diameter). Place one electrode (cathode) on the chest, approximately 6 cm below the right collarbone. Place the second one (anode) on the left ninth and tenth rib. Attach the third electrode (ground/reference) to the right-side waist next to the pelvic bone.\nTo record the EMG of M. trapezius, also use three pregelled, adhesive Ag/AgCl snap electrodes with circular contact areas (34 mm in diameter). Place two electrodes (cathode and anode) side by side on the trapezius muscle left of the neck. Place the third one (reference) below on the left collarbone.\nUse six reusable, shielded Ag/AgCl electrodes with 4 mm in recording diameter to measure the EMGs of M. corrugator supercilii and M. zygomaticus major. Fill the cavities of the electrodes with electrolyte gel. \n\t\nAttach the electrodes by means of double-sided adhesive collars as follows: for the corrugator supercilii, place one electrode (anode) directly above the left eyebrow, next to the (left) glabella line. Place the second electrode (cathode) 1 cm lateral to the first one. \nAttach a third electrode (reference) to the middle of the frontal bone just below the hairline. For the zygomaticus major, draw an imaginary line from the left oral commissure to the left earlobe. Place one electrode (anode) slightly below the middle of the line and a second one (cathode) 1 cm medial next to it. Attach the third electrode (reference) to the left mastoid. Connect all electrodes to the corresponding inputs of the biosignal recording device.\nPerform a visual check by means of the biosignal recording software if all physiological signals are of good/excellent quality. Ask the subject to move certain muscles and check the respective signal. Adjust/improve any unsatisfying signals by appropriate means/actions.",
    "Place one Ag/AgCl electrode (34 mm diameter) on the upper side of the intermediate phalanx of the left index finger (anode) and another one on the upper side of the proximal phalanx of the left middle finger (cathode). Fixate the electrodes with medical tape as subjects might sweat during the procedure, reducing the adhesiveness of the electrodes. Connect the electrodes to the electrical stimulator.\nApply the thermode to the upper side of the subject’s left forearm about 30 mm proximal to the wrist by a Velcro strap. Ensure that the strap does not constrict the skin.\nStart all cameras. Ensure that the participant is perfectly visible in the camera images. If necessary, ask the subject to adjust the position. Especially take care of facial cameras with a small field of view. Ideally, the face should be in the center of the image to reduce risk that the participant moves the head out of the field of view during the experiment.\nCheck if microphone is on and the recording volume is satisfactory.\nAsk the subject if she has any further questions and if she is ready for the experiment. Instruct her to act completely naturally and not to suppress and exaggerate any pain reactions during the experiment.\nStart all recording devices (cameras, microphone, biosignal recorder) complying with requirements for data synchronization. \nLeave the experimental room and enter the calibration/monitoring room. Wait 5 minutes in order to allow physiological signals of the subject to normalize. Run the pain elicitation script.\nCarefully monitor the subject and the progress of the pain stimulation part. Write down any timestamps of obvious unusual/unnatural behavior, technical problems or biosignal artifacts due to extreme movement, coming-off of electrodes, etc.",
    "After the ending of the pain elicitation script, stop all recording devices. Save/export all data in a preferred format. Turn off the thermal and electrical stimulator.\nCheck if the participant is alright and detach all electrodes and the thermode. Clean all skin areas with alcohol solution to remove electrode gel remains.\nGet the cold gel pack from the freezer and wrap it into the hygienic non-woven towel (or something similar, e.g. thin paper towel). Ask the participant to apply it for at least 5 minutes to the skin area where the thermode was placed. \nOffer the subject the opportunity to have their individual pain levels demonstrated and explained.\nApply ointment to the skin area where the thermode was placed.\n\tNOTE: Cold gel pack and ointment is used to minimize (a potential) redness and irritation of the skin.\nHand over the monetary compensation and have it acknowledged with a receipt. Provide contact information in case of emerging issues. Thank the participant and say goodbye.\nRemove the acoustic foam from both sides of the conduit pipe. Pass the thermode and the electrodes’ cable of the electrical stimulator back to the calibration/monitoring room. Dispose all disposable electrodes, clean all reusable electrodes of gel remains and clean the examination couch with a suitable surface sanitizer. Put the cold gel pack back into the freezer."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}