{
  "id": 18692,
  "origin_website": "Jove",
  "title": "High-definition Fourier Transform Infrared (FT-IR) Spectroscopic Imaging of Human Tissue Sections towards Improving Pathology",
  "procedures": [
    "1. Setting up an FT-IR Microscope and Acquiring Tissue Images\nSection a formalin-fixed paraffin-embedded tissue block at 4 μm thickness on to an IR compatible slide using a microtome. Alternately, section a liquid nitrogen frozen tissue at 4 μm thickness onto an IR compatible slide using a cryostat.\n\tNOTE: Typically, a serial section will also be acquired on a glass slide and stained with a special (such as Haematoxylin and Eosin (H&E)) or immunohistochemical stain. In addition, cultured cell lines can be grown on IR compatible slides. IR compatible slides can be IR reflective slides for reflection mode imaging (e.g., MirrIR slide, gold) or IR transparent slides for transmission mode imaging (e.g., BaF2, CaF2).\nPurge the FT-IR microscope and spectrometer using either dry air or dry nitrogen gas to remove atmospheric water from the system. Wait at least 45 min before imaging to ensure a thorough purge.\nCool both the FPA detector (to 79 K) and the internal MCT detector in the FT-IR microscope using liquid nitrogen. Cool the detectors approximately every 6 hr.\n\tCAUTION! Liquid nitrogen is a cryogenic fluid and can cause cold burns, frostbite and in enclosed spaces asphyxiation.\nMount the sample slide on the microscope stage for FT-IR imaging.\nEnsure the visible light is “ON” and then either using the binoculars or the sample capture program (which provides a real-time visible image of the tissue), focus on the sample.\nOpen the bundle software package such as resolutions pro and click ‘Collect’, then click ‘Diagnostics’ and then select ‘Align Spectrometer’. Ensure that the beam path to the spectrometer internal detector is not obstructed.\nClick on ‘Imaging Setup’.\nIn the ‘Electronics’ tab, select the appropriate ‘Speed’, ‘Under Sampling Ratio (UDR)’ and ‘Filters’ settings depending on the system.",
    "NOTE: In this example, the setting is Speed = 2.5 KHz, UDR = 4 and Filters = None.\nIn the ‘Optics’ tab ensure that ‘Mid-IR source’, ‘Open aperture’ and ‘100% beam attenuator’ are selected.\nTo calibrate the system, in the ‘Optics’ tab, select ‘Detector’ as ‘Ground’, ‘Microscope Detector’ as ‘Left’, and then select either ‘Transmittance’ or ‘Reflectance’ under ‘Optics mode’ depending on the type of slide being used.\nClick Setup, which will open up the ‘Lancer Control’ window.\n\tNOTE: For reflection mode follow instructions in 1.12 and 1.13 and for transmission mode follow instructions in 1.14 to 1.16. Continue from 1.17 for both reflection and transmission.\nFor reflection mode, in ‘Lancer Control’ click on ‘Raw’. Using the stage control joystick and watching the live view of the FT-IR interferogram image (top right image), move to a clean area on the slide.\nAdjust the integration time to approximately 8,000 counts. Next, move the stage to find a piece of tissue with structure, preferably the edge of a tissue, and perfect the focus of the image. Change ‘Warmth’ and ‘Contrast’ options to help form an image to improve focusing, this will have no effect on the IR data. Continue from 1.18.\nFor transmission mode, in ‘Lancer Control’ click on ‘Raw’. Using the stage control joystick and watching the live view of the FT-IR interferogram image (top right image), move to a clean area of the slide.\nAdjust the integration time to approximately 8,000 counts.\nAdjust the bottom focusing/condenser objective to increase the number of counts to its maximum. Watch the shape of the bottom right image in Lancer Control to ensure that it is Gaussian in appearance and relatively uniform. Adjust the integration time again to approximately 8,000 counts.",
    "NOTE: If any of the pixels in the FT-IR interferogram image turn white, reduce the integration time.\nMove the stage to find a piece of tissue with structure, preferably the edge of a tissue and perfect the focus of the image. Optionally, change the warmth and contrast options to help form an image to improve focusing, but will have no effect on the IR data.\nUsing the stage control joystick, move to a clean area of the slide. Press the ‘Calibrate’ button. Ensure the ‘Out Of Range (OOR)’ value is less than 50 and the difference between the ‘High Flux’ and ‘Low Flux’ counts is at least 4,000 counts.\nSelect ‘OK’ twice. In the optics tabs select; ‘Detector’ = ‘MCT’, ‘Microscope Detector’ = ‘Right’ and then click ‘Setup’. At this point there will be a FT-IR interferogram on the screen. Click on ‘Find Centerburst’. Click ‘Okay’.\nIn the ‘Optics’ tab, reselect ‘Detector’ = ‘Ground’, ‘Microscope Detector’ = ‘Left’ and select ‘Setup’.\nIn Lancer Control — ensure the image is still on a clean area and click ‘Calibrate’ again. Click ‘Okay’.\nNext, collect a background FT-IR image to correct for absorbance from the atmosphere, system and slide. Go to the ‘Electronics’ tab and select an appropriate spectral resolution, typically of 4 cm-1 or 8 cm-1 for tissue.\nGo to the ‘Background’ tab and type 128 in ‘Scans to co-add’. Select the ‘New File…’ button and place the background file in appropriate folder. Check the ‘Imaging’ tab to ensure mosaicing is 1 by 1. Click ‘Background’, wait for the scan to finish and confirm where to save the file. Click a region on the background FT-IR image and check the spectrum.",
    "To take a large mosaic image of the sample, select the ‘Imaging’ tab and insert the number of X and Y frames for the mosaic size you wish to acquire.\nClick ‘Setup’ and in Lancer Control use the live IR view to find the area of interest. If taking a mosaic, center the live feed in the middle of the area of interest. Click ‘Okay’. Go to the ‘Electronics’ tab and type the number of scans to co-add (typically a value between 2 and 16 scans for tissue). Click ‘Scan’.\nCheck the collected FT-IR image on the screen to ensure it looks focused. Click on the image to bring up an IR spectrum from that location and check that it looks to have an acceptable signal to noise. Acquire a visible image of the sample.\nSave the image and export it to the required format, such as ENVI-IDL.\n2. Adapting an FT-IR Microscope for High-definition Capabilities\nNOTE: Most FT-IR systems are equipped with an objective approximately 15X magnification and 0.5 numerical aperture (NA). To image in high-definition mode, an IR compatible 36X or 74X objective can be used to give diffraction limited imaging capabilities.\nRemove the system’s 15X objective by unscrewing counter clockwise.\nScrew in either the 36X or 74X objective in its place. Align the objective prior to use. Use lens extension tubes to bring the objective close enough to the sample.\nPlace tissue under the new objective and focus using visible light using either the binoculars or Sample Capture program.\n\tNOTE: High-definition imaging must be done in transmission mode. The very close working distance of these objectives (1-2 mm) and very shallow depth of focus requires focusing slowly and carefully, taking time to lower the objective without touching the sample.\nFollow instructions from 1.6 to 1.11.",
    "NOTE: Due to being significantly more difficult to focus and much less light reaching the detector, the following protocol is adjusted based on 1.14.\nIn transmission mode, click on ‘Raw’. Using the stage control joystick and watching the live view of the FT-IR interferogram image (top right image), move to the tissue and focus (ideally on an edge).\n\tNOTE: This may be difficult, therefore adjust the ‘Warmth’ and ‘Contrast’ options to help form an image to improve focusing (these options have no affect on the IR data).\nOnce focused, using the stage control joystick and the live IR view move to a clean area of the slide. Adjust the integration time to approximately 8,000 counts. Adjust the bottom focusing objective to increase the number of counts to its maximum. Adjust the integration time again to approximately 8,000 counts.\nMove the stage to find a piece of tissue with structure, preferably the edge of a tissue, and perfect the focus of the image.\nIf mosaicking an image at high resolution, adjust the stage to allow correct movement required across distances for accurate mosaicing. To change the stage distance settings, go to ‘Setup stage’ in Lancer Control and adjust the horizontal and vertical alignment settings to allow for correct mosaicking.\nUsing the stage control joystick move to a clean area of the slide. Press the ‘Calibrate’ button. Ensure the Out Of Range (OOR) value is less than 50 for both 36X and 74X objectives. Ensure the difference between the High Flux and Low Flux values is at least 1,000 counts for the 74X objective and 2,000 counts for the 36X objective.",
    "Continue from 1.19 to 1.27. The number of scans in 1.23 and 1.25 will need to be adjusted due to reduced signal to approximately 256 scans for the background image and 16 to 128 scans for the tissue image.\n3. Visualizing and Classifying IR Spectral Datasets\nNOTE: In this section, we will discuss how to visualize and extract data from spectral images using geospatial image processing and analyzing software such as ENVI+IDL, however the process is very similar for any alternate software such as MATLAB, free software such as CytoSpec, or the instrument developer’s own software. There are a few different spectral processing techniques that may be performed on the IR data.\nOpen geospatial image processing and analyzing software and load the IR data file.\nApply a baseline correction algorithm to the IR data by selecting “Spectral tools” and scroll down and click “Absorbance spectra”. Observe a pop-up menu and select “Baseline correction”\n\tNOTE: Baseline correction will remove a baseline offset slope from the data due to scattering\nPerform Spectral normalization, by ratioing the data to a certain spectral peak (typically Amide I (1,650 cm-1) or Amide II (1,550 cm-1)) or area under a defined region of the spectra. Do this by selecting “Normal spectra” under the “Absorbance Spectra” menu options.\n\tNOTE: Spectral normalization is performed so that any differences in spectra are real biochemical differences and not due to thickness or density differences between samples.\nUse a noise reduction algorithm to remove noise from the spectra if necessary28.",
    "NOTE: There are multiple approaches available by which baseline correction, spectral normalization and noise reduction can be achieved, with most software having automated algorithms built in. In addition, there are an emerging number of approaches that will correct for spectral aberrations, which have been discussed in detail29-42; however, the community does not yet agree on which of these are needed.\nObserve a list of all the IR frequencies collected within the image (typically of a spectral range from 900 to 4,000 cm-1). Click on the frequencies that correspond to specific biomolecules to observe an image of the tissue at the selected frequency.\n\t\nFor example, click on 1,650 cm-1 band to observe the distribution of proteins in the sample. Alternatively click on 1,080 cm-1 band to observe the distribution of nucleic acids in the sample. Use wavenumber 1,650 cm-1.\nCreate additional images by computing spectral peak height ratios, peak area ratios etc. that will allow for visualization of different biomolecular components. Click on ‘Spectral Tools’ and then select either ‘Peak Height Ratios’ or ‘Calculate Image Area’ to create images.\nScan the corresponding adjacent tissue section which is stained using a separate whole slide imager system that captures brightfield images. Alongside the IR image, bring up the digital image of the stained tissue with a visible image program.\nRight click on the image at a region of interest and select ‘Z profile’. This will give the spectral information at the selected pixel.",
    "Look at the IR spectra of multiple pixels from multiple classes, such as comparing cell types, disease states. Mark specific pixels on the image using the ‘Regions Of Interest’ (ROI) tool. To perform this, right click on the image and select ‘ROI tool’. Create the classes that are to be labeled, for example normal, dysplasia, and cancer classes. Then select, ‘ROI type’ — ‘Point’. Then select the class to select pixels for and draw on the appropriate pixels on the IR image. Derive the average spectra for each of the classes using the ‘Average ROI’ tool.\nCompare derived spectra by plotting in graphing software."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}