{
  "id": 13888,
  "origin_website": "Jove",
  "title": "Community-based Adapted Tango Dancing for Individuals with Parkinson's Disease and Older Adults",
  "procedures": [
    "NOTE: The Institutional Review Board at Emory University School of Medicine approved this work. Participants provided written informed consent before participating.\n1. Recruitment of Teacher Trainees\nRecruit 5-10 teacher trainees from the available population of therapists, professional dance and fitness instructors in the referent area.\nTeacher Trainee Qualifications\n\t\nEnsure that teachers have 2 years professional dance teaching experience, clear understanding of movement principles as well as how to convey them, and effective classroom management.\nVerify teachers' past experience working with older and impaired populations.\nEnsure teachers have a reputation for compassionate demeanor, attentiveness, understanding, reliability, maturity, willingness to teach impaired populations and patience.\n2. Training of Teacher Trainees in Adapted Tango Methods\nProvide all teacher trainees with the Adapted Tango Manual (unpublished, created for the workshop). Instruct trainees to read the manual prior to the training workshop and to refer frequently to the manual to plan classes and troubleshoot.\nImplement the Adapted Tango Teacher training program (developed by MEH) as a 15 hr workshop (12 hr group instruction in workshop format with 3 hr of individual instruction with the trainer), with a strictly followed agenda, guided by the Adapted Tango Manual which delineates all aspects of adapted tango.\n\t\nUse the manual to provide information about people with movement disorders and motor impairments, falls risk and prevention and to serve as a guideline for didactic instruction during the adapted tango teacher training workshop.\nAt the workshop, describe the sections and theory of the Adapted Tango class.\nIn group and pairs, breakdown and practice the adapted tango syllabus, published elsewhere, 13 for the adapted tango program, which includes a series of 24 unique lesson plans that describe the rhythms, steps of the day, and embellishments.\nExplain classroom management tips and techniques\nExplain and practice partnering enhancement tips and techniques.",
    "Explain basic music theory and practice rhythmic entrainment/music comprehension guide, as detailed in the manual.\nExplain methods for maintaining safety in the class, with exercises designed to promote effective balance management, including falls detection through evaluating limits of stability and falls prevention techniques.\nInstruct trainees to follow the syllabus closely to ensure program fidelity.\nAfter the 12 hr workshop, spend 3 hr individually with each teacher in additional training, to answer questions, and to ensure that each teacher fully comprehends adapted tango methods and importance of strict adherence to safety protocol and the detailed syllabus.\nRequest weekly reports from teachers about progress in classes.\n3. Select Sites to Host Classes.\nNOTE: Senior living communities (SLCs) often have facilities appropriate for classes. Administrators are interested in providing enrichment activities for their SLC residents, and are often happy to host classes that may include some non-residents in exchange for the provision of high quality exercise classes to residents free of charge.\nApproach senior living community administrators to inquire about hosting classes at their facilities. Gain support from the administrators with letters of support. Offer the classes free of charge to all residents within a particular community.\nEstablish clear rules of procedure, i.e., advertisement, classroom setup and breakdown, visitor expectations, etc.\nCommunicate frequently with SLC administrators, staff, instructors, and class coordinators for feedback and to maintain a positive relationship.\n4. Participant Recruitment\nRecruit older adults and individuals with PD through flyers, referral, PD newsletters, support groups, senior living communities, and websites.\n\t\nEnsure that Individuals with PD have received a diagnosis of idiopathic 'definite PD' (Hoehn and Yahr (H&Y) stages I-III)23 and demonstrate benefit from anti-parkinsonian medication.\nEnsure that both individuals with PD and older adults have no history of other neurological insult, and are able to walk 3+ meters with or without assistance.",
    "5. Participant Pre-test Evaluation\nNOTE: Conduct pre-tests within 1 week before starting classes.\nSchedule each participant for an initial testing session (pre-test) at a participant preferred time of day to minimize medication related performance fluctuations and to ensure all individuals with PD are tested while 'ON' medications.\nObtain written informed consent from each participant prior to their participation.\nRequest participants to complete a questionnaire regarding their age, education, medical history, fall history, use of assistive devices such as canes/walkers, and current medications within a week prior or during their initial testing session. Review the form with all participants to ensure completeness/accuracy.\n\t\nClassify participants as 'fallers' if they report an unintentional loss of balance that resulted in landing on a lower surface or the ground one or more times in the previous year.\nProvide questionnaires to participants to complete within a week prior or during their initial testing session, detailed below.\n\t\nThe Fear of Falling (FoF) and Quality of Life (QoL) Measures, which are single items included in a general health questionnaire.\nThe Composite Physical Function Index (CPF).\nThe Beck Depression Inventory-II (BDI-II). 24\nAdminister measures of cognition, PD severity (if applicable), mobility, and fall risk according to standard procedures, detailed below. Train two or more research assistants who are not teacher-trainees to help administer assessments. Videotape all assessments for blinded ratings by qualified research assistants, i.e., doctorate of physical therapy and medical students.\n\t\nThe The Unified Parkinson's Disease Rating Scale motor subscale III (UPDRS-III). 25\nThe Montreal Cognitive Assessment (MoCA). 26\nThe Berg Balance Scale (BBS). 27\nThe Timed Up and Go. 28",
    "Gait Speed assessment by timing gait speed with a stopwatch over a 20 foot straight path. Begin the stopwatch when the first heel passes the start line, and stop the stopwatch when the second heel passes the finish line.\nThe 30-Second Chair Stand: Count the number of times one can rise from a chair, with arms crossed over the chest, without lifting the feet from the ground, in 30 sec.\nThe Tandem Stance by timing the length of time the participant can stand with one foot directly in front of the other in a straight line. The cutoff time will be 60 sec.\nAt the conclusion of the testing session, provide participants with a calendar that details their adapted tango dance class schedule.\n\t\nInstruct participants not to change habitual exercise routines during the course of the six-month study. Instruct participants to record on the calendar any major medical or adverse events, including any 'falls', i.e., a slip or trip, in which they unexpectedly lost their balance and landed on the ground or a lower level.\n\t\t\nOn the date that such an event happens instruct participants to jot a brief note on their calendar detaining circumstances and outcome of the event (e.g.: 'Tripped on cat resulting in fall to knees, no medical attention sought.' or 'Attended regularly scheduled neurology appointment; Sinemet dosing increased from 4 to 5 tablets per day.')\nInstruct participants that their calendars will be reviewed twice: once at the conclusion of the dance classes and again 10-12 weeks after that. In the interim remind participants to continue to attend all regularly scheduled medical appointment and seek medical attention as needed for adverse events that occur outside class time.\n6. Volunteer Recruitment",
    "NOTE: This section describes methods for volunteer recruitment. Given the high fall risk of participants, able-bodied volunteers are crucial to the success of the adapted tango program.\nRecruit student volunteers from local undergraduate and graduate pre-health list-serves and local community volunteer organizations to serve as dance partners and assistants.\nRequire all student volunteers fulfill CITI requirements of human research, so as to ensure that they understand human research principles.\nInvite able-bodied family members (spouses, children, grandchildren) to participate in the classes as volunteer dance partners. Explain they will not always be partnered with their loved one but will be expected to rotate through dance partners several times per class.\n7. Safety Training Procedure\nNOTE: Given participants' mobility limitations falls are an ever-present threat before, during, and after each class. Vigilant safety procedures must be enacted to minimize risk of harm. This section describes methods for ensuring safe classes.\nMeet with volunteers in small groups of 5-10 individuals for 1.5 hr. Educate them about aging-related posture and gait problems. Instruct them on falls detection/prevention and adapted tango methods. More details are provided elsewhere.10\nReview the charts of all participants.\n\t\nIdentify participants with higher risk for falls to the research assistants, student volunteers and teachers, who are responsible for their safety.\nFollow this approach to partnering:\n\t\nPartner new volunteers first with higher functioning individuals with PD and older adults (e.g. low fall risk as determined by falls history, and standard clinical instruments) and observe the volunteers for attentiveness to their partner, ability to support the partner if necessary, and their ability to grasp and apply adapted tango concepts. Partner lower functioning individuals at higher fall risk with these volunteers after they have demonstrated satisfactory understanding of these concepts.",
    "NOTE: Never partner two individuals with PD or two older frail individuals together, because of their mobility limitations. Always partner individuals with PD with able-bodied volunteers or family members/friends.\nPartner together high-functioning older adults without PD who have been determined to have low risk of falls after their initial mobility assessment, only if volunteers, family, friends are unavailable.\nKeep weekly contact with the teachers, and the study assistants to address issues of the most vulnerable in the dance classes and ensure appropriate partners are assigned to them.\nAllow no more than 10 older adults with motor impairments and/or individuals with PD to attend class with accompanying healthy partners at any given time to maintain a manageable class size.\nInstruct teacher trainees and healthy volunteer assistants to monitor all participants' safety vigilantly. Frequently remind assistants to monitor participants for fatigue and postural instability.\nEncourage participants to take regular breaks ad libitum. Instruct the teacher to institute frequent timed breaks for participants during each class if participants fatigue easily but are reluctant to initiate their own break.\n8. Adapted Tango Classes\nAssign participants, after the pre-test evaluation, to 1.5 hr of progressive adapted Argentine tango 2 days a week for 12 weeks at a local community center or SLC. The classes are taught by teacher trainees trained in adapted tango methodology as described in the Adapted Tango manual.\nOffer the classes in adapted tango 4 times per week to give participants 48 opportunities to attend a class. Require participants to attend at least 20 lessons to receive a previously demonstrated therapeutic dose.\nExplain the general class structure, which consists of the following guidelines for the classes led by the teacher-trainee:\n\t\nLead a warm-up consisting of breathing, limbering and postural alignment performed individually and to upbeat music.",
    "Introduce a novel step element and practice one of the following 'partnering enhancement exercises.'\n\t\t\nInstruct both partners to close their eyes, while in the closed practice position, and practice shifting weight from one foot to the other, alternating who 'leads' and who 'follows.'\nInstruct the partners to stand side by side, and practice walking around the room, first on the same foot, (i.e., both step on the right foot), then on opposite feet (either both on the 'outside' leg, or both on the 'inside' leg).\nInstruct partners to place their palms together (but not gripping hands) and to choose a leader. Instruct the leader to move his/her hands randomly in front of him/her and instruct the 'follower' to mirror the motions of the leader by maintaining continual hand contact.\nInstruct the 'follower' to close their eyes while the partnership is holding elbows.\n\t\t\tNOTE: The 'leader' should practice shifting the weight of their follower through first shifting their own weight, and then through guiding the follower to shift weight through a movement of the chest and arms.\nInstruct the leader to walk towards the follower, as the follower walks backward. Ensure that the leader walks to the outside of the partner (OP), and then back in front of the partner, but without looking at the feet, looking only at the shoulders of their partner.\nIntroduce several different rhythms and instruct participants to practice with a partner. Amalgamate the novel step of the day to previously learned steps and practice with a partner.\nFollow general principles guiding partnering and group flow:\n\t\nInstruct participants to perform all steps in either an adaptation of the ballroom frame, i.e., holding each other's bent elbows and maintaining forearms parallel to the floor or the 'best-friends position,' i.e., walking side by-side with inside arm around partner's shoulder.",
    "Designate leader and follower roles within each partnered pair. Instruct leaders to choose direction, timing and size of each successive step, and communicate this information to their partner through moving their frame and center of mass. Instruct followers to attend to sensory cues for movement direction, timing and amplitude of steps, communicated from their partner to them via the frame and center of mass. Instruct Followers to wait to receive the movement cue before moving.\nInstruct participants and volunteers to dance both the leader and follower roles every class, i.e., switching roles every other song with their partners. Enhance learning by rotating partners every 15 min, a widely practiced method in ballroom and social dancing class.\nVisit the classes frequently to ensure safe practice, adherence to the syllabus, and availability to assist the teacher trainees as needed.\nInstruct teachers and volunteers to remind participants every two weeks to use theircalendars to record any adverse events (falls, medical problems) during the study (6 months total).\nEnsure a trained research assistant is present at every class to help monitor training fidelity, record participant attendance, and record the number and details of incidents within class (falls, other accidents, near-misses).\nIf a fall or other adverse event occurs, utilize the following protocol to ensure participant safety and allow for subsequent retrospective analysis.\n\t\nEnsure that a trained research assistant or class teacher assesses the individual or individuals involved in the event and determine if medical attention is needed. Interview the individual who fell to determines possible mechanisms of injury (e.g.: trip, crumple, which body part hit first, was there a head strike?).\n\t\tNOTE: Any headstrike, loss of consciousness, confusion, or focal injury warrants immediate medical attention.",
    "If the participant (s) are alert and oriented, and not complaining of any focal pain, assist them to a chair and mandate a 10 min rest period. After this time, assess participant preference for continuing in class versus continued rest. Ensure that participants dictate their own level of readiness to return to dancing and if they opt to do so ensure that they pair with the teacher or a trusted volunteer who has demonstrated competency at fall prevention.\nAfter the class, ensure that the teacher and trained research assistant debrief and accurately record all of the details of the adverse event. Send the fall details to PI for root cause analysis. Based upon the analysis, implement changes to prevent future adverse events (eg: room restructuring, different partnering, modifications of certain tango step, mandated rest breaks for certain participants).\n9. Participant Post-test Evaluations\nNOTE: Conduct this evaluation within one week after the 20th class the participant attended.\nSchedule a testing session with each participant within one week of finishing the required class dose.\nRe-The questionnaires and measures detailed in step 5.5. Ensure that the same trained research assistant helps to The assessments.\nQuestion participants about medical/exercise changes during the preceding 10-12 weeks, and review participants' calendars with them. Record the number of falls or other adverse events they experienced during the course of the study.\nRequest participants complete an Exit Questionnaire including 1) items about class enjoyment, desire to continue, and improvements in physical and mental well-being rated on a 5-point Likert scale (1 = strongly agree to 5 = strongly disagree) and 2) open ended questions regarding what participants liked best/least about the program and recommendations for program improvements.\n10. Participant Follow-up Evaluations\nNOTE: Conduct this evaluation within 10-12 weeks after the 20th class the participant attended.",
    "Schedule a testing session with each participant.\nRe-The questionnaires and measures detailed in step 5.5. Ensure that the same trained research assistant helps to The assessments.\nQuestion participants about medical/exercise changes during the preceding 10-12 weeks and review participants' calendars. Record the number of falls or other adverse events they experienced from the conclusion of the classes to the follow-up evaluation.\n11. Statistical Analysis\nCalculate descriptive statistics for all baseline variables.\nUse Chi square tests to determine differences between groups on dichotomized data (e.g., attendance and fall occurrence).\nCalculate Cohen's d effect sizes, i.e., a standardized measure of the strength of a phenomenon, for changes from pre to post and pre to follow up on the measures of efficacy.\n\tNOTE: As this protocol is primarily concerned with dissemination and implementation of the methodology of this program, hypothesis testing is inappropriate for making inferences about efficacy in this context."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}