{
  "id": 10248,
  "origin_website": "Jove",
  "title": "Microfluidic Model to Mimic Initial Event of Neovascularization",
  "procedures": [
    "1. Wafer preparation\nNOTE: This protocol is specific for the SU-8 2075 negative photoresist used during this research.\nClean the silicon wafer 3 to 5 times with methanol and isopropanol on a spin coater as follows: first spin for 15 s at 500 rpm, and then spin for 60 s at 3,000 rpm.\nTransfer the silicon wafer to a hotplate, which is preheated to 180 °C and bake the wafer for 10 min.\nRemove the silicon wafer from the hotplate and cool it to room temperature. Clean the wafer again with compressed air before proceeding with the spin coating. Apply 4 mL of the SU-8 2075 photoresist to the center of the wafer.\nObtain a feature height of 70 µm on the spin coater as follows: first spin for 12 s at 500 rpm, and then spin for 50 s at 2,100 rpm.\nSoft bake the wafer on a hotplate as follows: first bake for 8 min at 65 °C, then bake for 20 min at 95 °C. Next, remove the silicon wafer from the hotplate and cool it to room temperature before lithography.\nPlace a photomask onto the photoresist film. Expose the wafer with a lithography equipment to achieve a total exposure of 200 mJ/cm2.\n\tNOTE: The photomask contains nine sets of patterns of the chip, so it can fabricate nine microfluidic sprouting chips each time.\nPost expose the wafer on a hotplate as follows: first bake for 5 min at 65 °C, and then bake for 20 min at 95 °C. Next, remove the silicon wafer from the hotplate and cool it to room temperature before developing.\nTransfer the wafer to a glass Petri dish filled with SU-8 developer (PGMEA) to start developing.",
    "CAUTION: The developer is irritating to the eyes and respiratory tract. Perform developing in a fume hood. Wear splash goggles, nitrile gloves, and airline mask during the operation.\nShake the dish gently along the direction of the flow channel and change the developer after 10 min.\nRepeat step 1.9 3-5 times until the patterns can be clearly observed.\n\tNOTE: Make sure there is no photoresist residue left on the wafer, otherwise rinse the wafer in the developer again.\nTransfer the wafer to a preheated hotplate set to 120 °C and bake it for 30 min.\nPipet 35 µL of silane onto a coverslip, then put the coverslip along with the wafer into a desiccator and pull vacuum. Seal the desiccator and leave the wafer under vacuum for 4 h to silanize the wafer to prevent the adhesion of PDMS during the soft-lithography processes.\n\tCAUTION: The silane is toxic. To prevent poisoning, perform silanization in the fume hood and wear nitrile gloves while handling.\nRelease the vacuum from the desiccator. Remove the silanized wafer onto a preheated hotplate and bake it at 65 °C for 2 h.\nStore the wafer in a clean Petri dish until required.\n2. Microfluidic sprouting chip fabrication\nCombine 20 g of base agent and 2 g of curing agent (10:1 ratio) in a plastic beaker and mix them thoroughly with a mixing rod.\nPlace the beaker into a desiccator and pull vacuum for 1 h to remove air bubbles in the PDMS mixture.\nPour the PDMS mixture onto the wafer in the Petri dish and place the Petri dish back into the desiccator, degassing for another 30 min.",
    "NOTE: It is helpful to use double-sided adhesive tape to glue the wafer onto the bottom of the Petri dish to ensure the wafer is kept horizontal during degassing and curing.\nRemove the Petri dish from the desiccator and place it into an 80 °C dry oven for 3 h to cure.\nCarefully separate the PDMS layer from the wafer and cut the layer to nine chips with a scalpel according to the pattern.\n\tNOTE: Keep the feature side up after separation.\nPunch two hydrogel injection ports and four media injection ports out of each chip using a 1 mm and a 3.5 mm biopsy punch, respectively.\nClean the punched chips with residue-free tape to remove PDMS residue. Place the chips and nine glass coverslips into a plasma cleaner and treat them with oxygen plasma for 30 s to form covalent bonding on the surface.\nTake out the chips and coverslips. Attach the feature side of the chips onto the coverslips.\nPlace the attached chips into an 80 °C dry oven for 1 h to intensify the bonding.\nAutoclave the chips before use and keep them sterile for the rest of the procedure.\n3. Surface modification and hydrogel injection\nFor each chip, pipet 40 µL of 1 mg/mL poly-D-lysine (PDL) and inject it into channels in the chip from hydrogel injection port.\n\tNOTE: Make sure the PDL fills channels, especially in narrow channels near the ports.\nIncubate the chips at 37 °C for 4 h to modify the surface of the PDMS .\nPipet 200 µL of sterile water and inject it into channels in the chip from hydrogel injection port to wash out PDL.\nRemove the chips into a 120 °C dry oven for 3 h to restore hydrophobicity.",
    "Place on ice a sterile tube and calculate the volume of Type I collagen to be used as the following equation.\n\tFinal volume (50 µL) x Final collagen concentration (3 mg/mL in this research) / Concentration in bottle = volume collagen to be added\nCalculate the volume of NaOH to be used as the following equation.\n\t(volume collagen to be added) x 0.023 = volume 1 N NaOH\nPrepare 50 µL of hydrogel in the tube as the following protocol: add 5 µL of 10x PBS, 0.5 µL of phenol red, calculated volume of 1 N NaOH, 4 µL of 1 mg/mL Fibronectin, calculated volume of Type I collagen in turn. Add the proper amount of dH2O so that the total volume reaches 50 µL. Mix all the contents in the tube thoroughly.\n\tNOTE: Perform all the operations on ice. Use phenol red as an acid-based indicator to assist in visual determination of the pH of the hydrogel. The final hydrogel ends up orange when the pH is about 7.4 and the stiffness is about 15 kPa49.\nPipet 2-3 µL of hydrogel for each chip and slowly inject it into the central hydrogel channel from hydrogel injection port.\nIncubate the chips at 37 °C for 30 min to allow gelation.\n\t​NOTE: Seal the chips into a sealed box with 1 mL of sterile water if they are not used immediately. Sealed chips can be stored at 37 °C for at most 24 h.\n4. Cell seeding\nPipet 20 µL of 125 µg/mL Fibronectin into one media injection port of the cell culture channel.\nCut a pipette tip to fit the port of the cell culture channel with scissors.",
    "Insert the pipette tip into the other media injection port of the cell culture channel. Then, pipet out air from the cell culture channel to fill it with Fibronectin.\nIncubate the chips at 37 °C for 1 h.\nBefore cell seeding, pipet 20 µL of ECM media into each media injection port and incubate the chips at 37 °C for 30 min.\nThen, pipet out all the media in all media injection ports.\nNext, pipet 5 µL of cell suspension into one media injection port of cell culture channel. Then, endothelial cells quickly spread over the entire channel under differential hydrostatic pressure.\n\tNOTE: Prepare the cell suspension by trypsinizing human umbilical vein endothelial cells (HUVECs) from the culture flask and centrifuging them at 400 x g. Then, resuspend the cells to 107 cells/mL in a tube.\nAdd about 4-6 µL of ECM media to the other port to adjust the hydrostatic pressure and stop cell moving.\nRemove the chips to the cell incubator. Then, turn over the chips every 30 min until endothelial cells coat around the internal surface of the cell culture channel 2 h later (Figure 1).\n\tNOTE: To make the chip upside down, pipet a little water on the back of the coverslip. Then the chip can attach to the cover of the Petri dish.\nUse the pipette tip to remove the attached cells in the injection ports very carefully.\nThen, insert four barbed female Luer adaptors into the media injection ports and fill with ECM media.\n\t​NOTE: The adaptors can function as fluid reservoirs to provide nutrients for the cells in the channel.\nRemove the chips to cell incubator. Change ECM media in Luer adaptors every 12 h.\n5. Measurement of FITC-dextran diffusional permeability",
    "NOTE: To assess barrier function of the micro-vessel, diffusional permeability of the EC culture channel with or without cell lining is assessed.\nTake out a microfluidic sprouting chip with hydrogel injected.\nRepeat steps 4.1-4.6.\nRemove all the Luer adaptors and pipet out all the media in four media injection ports.\nPlace the chip onto the confocal laser scanning microscope.\nPipet 5 µL of culture media containing 500 µg/mL 40 kDa FITC-dextran to one port of cell culture channel.\n\tNOTE: 40 kDa FITC-dextran has similar molecular size to VEGF-165 (39-45 kDa).\nCapture images every 3 s for 30 s. Thus, the diffusional permeability without cell lining is measured.\nTake out the microfluidic sprouting chip after HUVECs are confluent in the cell culture channel.\nRepeat steps 5.3-5.5.\nCapture images every 3 s for 30 s. Thus, the diffusional permeability with cell lining is measured.\nCalculate the diffusional permeability by quantifying changes of fluorescent intensity over time using the following modified equation50.\n\tPd= (I2- I1) / ((I1- Ib)·Δt) ·S/d\n\twhere, Pd is the diffusional permeability coefficient, I1 is the average intensity at an initial time point, I2 is the average intensity after delta time (Δt), Ib is the background intensity, S is the area of the channel in fluorescence images, and d is the total interval of micro-posts in fluorescence images. In the present work, Δt is set as 9 s.\n\t​NOTE: The present equation is slightly different from the original50, due to the diffusion direction of the fluorescence in the chip is only from the EC channel to hydrogel channel, which is not like the circular tube diffusing in all the radial direction.\n6. Microfluidic control system setup",
    "NOTE: The microfluidic control system in the present study is consisted of a micro-syringe pump, an electromagnetic pinch valve, a bubble trap chip, a microfluidic chip, a micro-peristaltic pump, and a reservoir. Each part of the system can be replaced by alternatives able to perform the same function.\nBubble trap chip fabrication\n\tNOTE: The bubble trap chip is used to remove air bubbles in circulation. The chip consists of three PDMS layers. The top layer is constructed using soft lithography to form grid structure as the liquid chamber. Each channel of the grid structure is 100 µm wide. The bottom layer is a PDMS chunk with a hole. Between the two layers, a 100 µm thin PDMS film is laid.\n\t\nRepeat step 1 to prepare the wafer for bubble trap chip.\nRepeat steps 2.1-2.5 to fabricate the top layer and bottom layer of the bubble trap chip.\n\t\tNOTE: The photomask of the top layer contains three sets of patterns, so cut the PDMS layer to three chips according to the pattern.\nPunch six holes on the end of inlet and outlet channels of the top layer using a 3.5 mm biopsy punch.\nPunch two holes on the corresponding position of bottom layer using a 6 mm biopsy punch according to the pattern on the top layer.\nRepeat steps 2.1-2.2 to prepare 10 g of PDMS mixture and pour it on the center of a cleaned silicon wafer.\nFabricate a 100 µm PDMS film by applying the following spin protocol: spin for 15 s at 500 rpm, increase the spin speed to 1,300 rpm and hold here for 45 s.\nTransfer the wafer to a preheated hotplate set to 180 °C and bake it for 30 min.",
    "Clean the punched layers with residue-free tape to remove PDMS residue. Place the top layers and wafer into a plasma cleaner and treat them with oxygen plasma for 30 s to form covalent bonding on the surface.\nTake out top layers and wafer. Attach the feature side of top layers onto the PDMS film.\nCut the film carefully along the edge of the top layers with a needle.\nSlowly separate the film from the wafer and turn over the chips to make the film side up after separation.\nPlace the bottom layers and attached chips into a plasma cleaner and treat them with oxygen plasma for 30 s again.\nTake out bottom layers and attached chips. Attach the bottom layers onto the PDMS film and the bubble trap chips are done.\n\t\tNOTE: Align the holes on the bottom layer with the patterns on the top layer when attaching.\nPlace the chips into an 80 °C dry oven for 1 h to intensify the bonding.\nAssemble the microfluidic control system\n\tNOTE: All the parts of the system, such as bubble trap chip, reservoir, tubes, and connectors are used after autoclave sterilization, except electronic equipment. Assemble the microfluidic control system on a clean bench.\n\t\nTo assemble the microfluidic control system, prepare two polytetrafluoroethylene tubes, two short silicone tubes, three long silicone tubes, one barbed female Luer adaptor, one Y type connector, and three L type connectors.\n\t\tNOTE: The advantage of polytetrafluoroethylene tube is low elasticity, therefore, less media is needed in pipeline. Silicone tube, in contrast, has high elasticity, therefore, it is suitable for the pinch valve and peristaltic pump.\nFill the syringe with 10 mL of preheated (37 °C) ECM medium.\n\t\tNOTE: Preheating helps the medium release dissolved gas.",
    "Connect a polytetrafluoroethylene tube to the syringe by a barbed female Luer adaptor. Then, connect the other end of polytetrafluoroethylene tube to a Y type connector.\nNext, connect two long silicone tubes to the other two ends of Y type connector with one tube connecting to the reservoir and the other tube connecting to the bubble trap chip.\nConnect another long silicone tube to the reservoir.\nNext, use two short silicone tubes to connect all inlet and outlet holes on the top layer of the bubble trap chip. Connect a polytetrafluoroethylene tube to the backend of the chip.\nNext, fix the syringe onto the micro-syringe pump.\nClip two long silicone tubes into the electromagnetic pinch valve.\nNext, switch the electromagnetic pinch valve to open the pipeline between the syringe and the reservoir. Inject the media to the reservoir using a micro-syringe pump to exhaust air in the tube.\nThen, switch the valve again to open the pipeline between the syringe and the bubble trap chip. Inject the media to fill the liquid chamber and the backend tube of the bubble trap chip.\n7. Endothelial sprouting assay\nNOTE: A stage top incubator assembled with phase contrast microscope is used in the present study to observe the process of sprouting in real time. The stage top incubator can maintain the temperature, humidity, and CO2 control on microscope stages, being good for live cell imaging. But the equipment is not necessary for the assay. The protocols provided here can also be worked in a basic cell incubator.\nTake out endothelial sprouting chips from the cell incubator.\nThen, remove Luer adaptors on the cell culture side. Insert two pipe plugs into the hydrogel injection ports of the microfluidic sprouting chip.",
    "NOTE: The plugs can transform from needles and their main function is to prevent media from spilling.\nConnect the backend tube of bubble trap chip to one port of cell culture channel.\n\tNOTE: Make sure there are no bubbles in the tube before connection.\nInsert a T type connector to the other port and connect it to long silicone tube connected with the reservoir.\nClip the long silicone tube into the micro-peristaltic pump.\nThen, insert an air filter to the reservoir.\nNext, assemble the microfluidic sprouting chip to the stage top incubator.\nNext, connect the vacuum pump to the holes in the bottom layer of bubble trap chip with a TPU tube.\nSet up the circulation volume and flow rate in the custom program, which controls the micro-syringe pump and electromagnetic pinch valve simultaneously (Figure 2).\n\tNOTE: The flow rate across the endothelial cell culture channel is calculated according to the classic equation.\n\tτ = 6µQ / Wh2\n\twhere, τ is shear stress (dyn/cm2), µ is viscosity of the medium (8.8 x 10-4 Pa•s), Q is the flow rate across the endothelial cell culture channel (ml/s), h is channel height (70 µm), and W is channel width (1,000 µm). The viscosity of the medium is measured using a coaxial cylinder type rotational viscometer. The height and width of the channel are predetermined and manually confirm using a phase contrast microscope at 4x magnification. The circulation volume is 5 mL and flow rate is 85 µL/min (average 0.2 m/s in cell culture channel) for 15 dyn/cm2 shear stress according to calculation.\nNext, set up the flow rate of micro-peristaltic pump.\n\tNOTE: The flow rate of micro-peristaltic pump is slightly higher than micro-syringe pump, in order to prevent the media from spilling.",
    "Turn on the micro-syringe pump. Then, the circulation control system is established.\n8. Data analysis\nNOTE: To quantify the sprouts, the normalized area of sprouting, average sprout length, and longest sprout length were calculated. Results represent mean ± SEM obtained from three independent studies. Statistical significance (P < 0.05) is assessed by Student's t-test.\nFix cells and sprouts in the microfluidic sprouting chip after experiments with 4% paraformaldehyde in PBS for 15 min. Stain nuclei with 4′,6-diamidino-2-phenylindole dihydrochloride (DAPI; 1: 1000; Sigma-Aldrich) for 10 min and then stain cytoskeleton with TRITC phalloidin (P5285, 1: 100; Sigma-Aldrich) for 1 h. Wash cells with PBS three times at 5 min intervals between each step.\nTake confocal images of the chips in a tiling mode and stitch them using image editing software.\nCount the number of fluorescent pixels of Z-projection images using a custom code in programming software to quantify normalized area of sprouting (See Supplemental File).\nManually identify and label each tip of sprouts in Z-projection images and calculate distances between sprouts tips to ECs basement membrane using another custom code to quantify average sprout length and longest sprout length (See Supplemental File).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}