{
  "id": 1898,
  "origin_website": "Cell",
  "title": "Protocol for accelerated skeletal muscle regeneration and hypertrophic muscle formation in mice",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nIn this step, muscle stem or satellite cells are isolated from skeletal muscle tissues of mice, cultured to form myoblasts and differentiated further to generate hypertrophic myotubes. LPA is added to differentiating satellite cells to induce hypertrophy as reported in Ray et al. (2021)[href=https://www.wicell.org#bib2].\nIsolation of satellite cells from skeletal muscle tissues\nTiming: 1–2 h\nPrepare a collagen coated 6-well plate and 4 or 8 well chambered slides (refer to collagen plate coating) and keep the culture medium warmed to 37°C ready.\nTibialis anterior, gastrocnemius and extensor digitorum longus (EDL) muscles of C57BL/6 mice are subjected to enzymatic dissociation 0.2% collagenase solution for 45 min after which non-muscle tissues are gently removed and the muscle is minced under a dissection microscope, followed by 45-min incubation in the same collagenase solution.\nThe cell suspension is filtered through a 70-μm nylon filter to get a single cell suspension, followed by red blood lysis (RBC) lysis and washing.\nFollowing washing, cells are isolated using a negative selection kit (130-104-268, Miltenyi Biotec) according to the manufacturer’s protocol.\nIsolated satellite cells are cultured in growth medium consisting of DMEM, 20% FBS, 10 ng/mL basic fibroblast growth factor (bFGF) (Invitrogen), and penicillin and streptomycin. We typically use 10,000–15,000 cells/well for culture of satellite cells in 4 or 8 chambered slides.\nNote: FBS can markedly enhance the proliferation of satellite cells. Tissues can be incubated in collagenase medium for a maximum of 2 h with frequent observation for tissue dissociation. The isolated cells are >92% pure and we usually get approximately 50,000–70,000 satellite cells from the skeletal muscle tissues of the hindlimbs of an adult mouse.\nCritical: Do not incubate the tissues in an enzymatic solution for more than 2 h.\nFeeding satellite cells\nTiming: 30 min",
    "The next day warm culture medium and DPBS to 37°C. Remove the spent medium and wash the cells once with 1 mL prewarmed DPBS to remove debris, then add 2 mL (35 mm dish) or 400 μL (for 4/8 well chambered slides) fresh and prewarmed culture medium to continue feeding. Refresh culture medium every alternate day until cells become 50%–60% confluent.\nCritical: Cell morphology is monitored under an inverted microscope. Proliferating satellite cells display round colony or polygonal morphology, while the differentiated cells exhibit changed morphology (e.g., enlarged cells with cylindrical morphology). Scrape off large, differentiated colonies with a P200 pipette tip by visual recognition. Small fibroblasts cells will spontaneously disappear upon replenishment of satellite cell specific culture medium (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1378-Fig1.jpg\nFigure 1. Light microscopy showing satellite cells and differentiated myotubes\n(A and B) Light microscopic images of (A) mouse satellite cells and (B) differentiated myotubes from the satellite cells. Scale bar, 100 um.\nProceed to differentiation of satellite cells and induction of hypertrophic myotubes when they reach 50%–60% confluency (approx. 4–5 days).\nNote: For optimal results, cells should be approximately 50%–60% confluent after 4–5 days in culture. If cells do not reach this confluency, adjust the timing to start the differentiation later.\nPrewarm satellite cells differentiation medium and DPBS to 37°C.\nAspirate the spent medium from the satellite cells to be induced for differentiation. Rinse the cells with 2 mL DPBS, and then add 2 mL (35 mm dish) or 400 μL (for 4/8 well chambered slides) of differentiation medium supplemented with 10 μM LPA per well for inducing hypertrophic myotubes.\nIncubate the cells in hypertrophy inducing medium for 3–4 days with replenishment of LPA containing differentiation medium every day to the differentiating cells.\nAccelerated regeneration of cardiotoxin injured skeletal muscle tissues\nTiming: 2–4 weeks",
    "Skeletal muscle regeneration is induced by initiating skeletal muscle injury by the intramuscular injection of cardiotoxin (CTX), a snake venom toxin that induces myofiber damage and a strong regenerative response (Chargé and Rudnicki, 2004[href=https://www.wicell.org#bib3]; Goddeeris et al., 2013[href=https://www.wicell.org#bib1]; Price et al., 2014[href=https://www.wicell.org#bib4]). Here we describe the steps in induction of muscle injury and initiation of accelerated repair by injecting LPA to regenerating muscles as reported in Ray et al. (2021)[href=https://www.wicell.org#bib2].\nC57BL/6 mice between the ages of 6–8 weeks are injected with Cardiotoxin (CTX) injections for skeletal muscle injury.\nWipe the hindlimbs of C57BL/6 mice with ethanol wipes.\nInject 10 μM (50 μL) cardiotoxin (CTX) diluted in PBS intramuscularly (i.m.) into tibialis anterior muscles with approximately 25 μL volume injected at two different sites in the TA muscles. CTX is injected in both legs. The needle for injection is inserted into the center of the TA avoiding it from going too deep or beyond muscle. (The needle can be inserted 2/3 mm deep and at an approximately 20° angle).\nMice are left for 48 h for the induction of muscle injury or myofiber damage and initiation of regenerative process.\n20 μM LPA is injected (i.m.) every alternate day in regenerating muscles until tissues are harvested for histological analysis.\nTissues are harvested at different time intervals (day 7, 14 or as required in experiments) for histological analysis.\nInduction of hypertrophic skeletal muscle formation\nTiming: 2–4 weeks\nDirect intramuscular (i.m.) injection of 3 μg Atx (in 50 mL PBS-BSA) or 10 μM final concentration of LPA in 50 μL PBS-BSA (50 μL PBS-BSA used as a vehicle control) is conducted into skeletal muscles of C57BL/6 mice.\nAtx or LPA is injected for five consecutive days or until tissues are harvested for analysis.",
    "Skeletal muscle tissues are harvested 7 and 14 days after CTX injury for histological analysis.\nPause point: Harvested tissues can be stored in formalin for 24–48 h. Paraffin embedded tissues can be stored for extended periods."
  ],
  "subjectAreas": [
    "Stem Cells",
    "Cell Isolation",
    "Microscopy",
    "Cell Biology",
    "Model Organisms"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}