{
  "id": 10658,
  "origin_website": "Jove",
  "title": "Dry Film Photoresist-based Electrochemical Microfluidic Biosensor Platform: Device Fabrication, On-chip Assay Preparation, and System Operation",
  "procedures": [
    "1. Fabrication of the Microfluidic Biosensor Using DFR Technology\nPreparation of the PI wafers.\nCut a PI substrate into 6-in round wafers. Put the PI wafer in an oven at 120 °C for roughly 1 h for a dehydration bake.\nFirst photolithography step for the lift-off process.\nProgram the spin-coater to a 30-s spinning time at 3,000 rpm, with an acceleration of 2,000 rpm/s. Place the PI wafer on the spin-coater and fix it, applying a vacuum. Dispense 2 mL of a resist, enabling the lift-off process, and start the spin-coater program. Remove the wafer from the spin-coater and soft-bake the PI wafer on a hot plate for 2 min at 100 °C.\nAdjust the desired mask for patterning the electrodes on the PI wafer with the naked eye and expose it to 400 mJ/cm2 UV light (365 nm). Place the wafer in a bowl filled with a resist-matching developer on an orbital shaker and let it shake slightly for 1 min.\nAfter the excess resist is removed, use a shower to rinse the PI wafer with deionized water (DI-water) on a wet bench and dry it afterwards using compressed air.\nDeposition of platinum for the formation of the electrodes.\nUse a standard physical vapor deposition process to deposit 200 nm of platinum onto the wafer19.\nPlace the wafer in a bowl. Add the matching remover to the bowl and remove the lift-off resist while slightly shaking the wafer on an orbital shaker until all excess platinum is removed. Rinse and dry the PI wafer as described in step 1.2.3.\nSecond photolithography step: Forming the insulation layer.\nPut the PI wafer in an oven preheated to 120 °C for 5 min to dehydrate it.",
    "Program the first step of a spin-coater to 5 s of spinning time at 500 rpm. Program the second step for 30 s at 4,000 rpm, with an acceleration of 700 rpm/s.\nPlace the PI wafer on the spin-coater and fix it, applying a vacuum. Dispense 4 mL of an appropriate epoxy-based photoresist before starting the spin-coater program.\nSoft-bake the coated wafer for 3 min at 95 °C on a hot plate.\nAdjust the mask for the insulation layer on the wafer using the respective alignment marks and an ocular lens. Expose the wafer to 100 mJ/cm2 UV light (365 nm).\nFor a post-exposure bake, place the wafer on a preheated hot plate for 2 min at 95 °C.\nPlace the wafer into a bowl and develop the resist with a suitable developer (e.g., 1-methoxy-2-propyl-acetat for 2 min, in the case of SU-8) on an orbital shaker.\nRinse the PI wafer first with isopropanol and then rinse and dry it as described in step 1.2.3.\nHard-bake the photoresist in an oven for 3 h at 150 °C.\nPlasma-assisted cleaning of the electrodes.\nTo remove the photoresist residues, use oxygen plasma with a standard plasma unit. Start the cleaning program, using 200-W low frequency power with 100% O2 flow, a rate of 250 sccm, and a total time of 3 min.\nPlace the PI wafer into the plasma chamber, fix the wafer on the grounded plate using glass lids, and start the plasma process.\nSilver and silver chloride deposition: Creating the on-chip reference electrode.\nPassivate the platinum contact pads of the wafer with a UV-sensitive adhesive tape. Cut the foil in to 5 mm-wide and 11 cm-long stripes and attach them to the wafer, protecting the parts not to be deposited with silver.",
    "For the silver deposition, put a sonic bath (35 kHz) into a fume cupboard and insert a container of silver electrolyte solution (100 g/L Ag, pH 12.5) into the bath. Set the sonic bath to room temperature and the power to 10%.\n\t\tCaution: Silver electrolyte solutions are highly toxic and should be handled with extreme care. The fumes should never be inhaled.\nConnect the bulk contact of the reference electrodes to a constant current source. Connect the counter electrode, a silver wire that is immersed in the silver electrolyte solution, to the current source using standard connecting cables.\nSet the current source to DC and to a current density of -4.5 mA/cm2, resulting in a silver deposition rate of approximately 0.3 µm/min. Start the sonic bath and let the current source run for 10 min. Rinse the wafer with DI-water\nFor the chlorination of the reference electrode, insert a vessel of 0.1 M potassium chloride (KCl) solution into the sonic bath. Connect the bulk contact of the wafer and a platinum electrode that is immersed in the KCl solution with the constant current source.\nSet the current source to DC and to a current density of +0.6 mA/cm2, resulting in a deposition rate of approximately 0.075 µm/min. Start the sonic bath and let the current source run for 7.5 min.\nRinse and dry the PI wafer, as described in step 1.2.3.\nRemove the UV-sensitive tape after a UV (365 nm) exposure of 300 mJ/cm2 and rinse and dry the PI wafer, again as described in step 1.2.3.\nThird photolithography step: Using DFRs to create the microfluidic channels.",
    "Cut the needed DFR layers to a size similar to that of the wafer (20 x 20 cm2). Fix the desired mask onto the exposure unit and align the DFR layer onto the mask using the naked eye. Illuminate the resist with 250 mJ/cm2 UV light (365 nm).\nRemove the protective foil of the photoresist and develop the resist for roughly 2 min (depending on the structures) in a 1% sodium carbonate (Na2CO3) solution using a standard sonic bath (35 kHz) preheated to 42 °C and a sonic power of 100%. To stop the reaction immediately, shake the resist for 1 min in a 1% HCl bath on an orbital shaker. Rinse and dry each DFR layer, as described in step 1.2.3.\n\t\tNOTE: In total, four DFR layers need to be processed as mentioned in step 1.7: one channel layer, one cover layer, and two backside layers (preventing the biosensor from bending at the end).\nLamination of the DFR layers on the PI substrate.\nPlace the PI wafer onto a transparency overhead foil and fix it using standard adhesive tape. Adjust the channel DFR layer on the PI wafer under a microscope, using the respective alignment structures.\nFor the lamination, use a standard hot roll laminator and preheat the top roll to 100 °C and the bottom roll to 60 °C. Set the pressure to 3 bar, with a forward speed of 0.3 m/min. Place the wafer with the fixed DFR layer in the middle of the laminator and start it; the DFR is pushed through the laminator. Repeat the step after rotating the wafer by 180°.\nTo prevent the bending of the biosensor, laminate the two developed backside layers onto the wafer following steps 1.8.1-1.8.2.\nEmploying a hydrophobic stopping barrier and sealing the chip.",
    "Remove the protective layer from the front side of the DFR channel layer by placing standard adhesive tape at one end of the DFR and pulling it upwards. Use a hand dispenser with 0.004-in tubes to dispense small droplets of dissolved polytetrafluoroethylene into the wells of the insulation layer. To seal the microfluidic chip, laminate the cover DFR layer onto the channel layer, as described in step 1.8.\nHard-baking the microfluidic biosensor.\nRemove all protective foils on the cover and backside DFR layers. Cut the biosensors into strips using an ordinary pair of scissors. Cure the chips in an oven at 160 °C for 3 h.\n2. On-chip Assay Immobilization Procedure\nAdsorption of avidin in the immobilization area of the channel.\nPrepare a 100 µg/mL avidin solution in 10 mM phosphate-buffered saline (PBS) at a pH of 7.4.\nDispense 2 µL of the avidin solution onto the inlet of the biosensor.\n\t\tNOTE: The channel is filled by capillary forces until the fluid reaches the hydrophobic stopping barrier.\nTo ensure that the fluidic keeps stopping at the barrier during the whole incubation time, dispense 2 µL of DI-water on the outlet of the chip. Incubate the chip at 25 °C for 1 h in a closed container.\nRemove excess reagents through the inlet of the chip by applying a vacuum. Wash the channel with 50 µL of wash buffer (PBS with 0.05% Tween 20), dispensed on the outlet while the vacuum is being applied. Dry the channel for 30 s while the vacuum is being applied.\nBlocking the channel surface to inhibit unspecific binding.\nPrepare a 1% bovine serum albumin (BSA) solution in 10 mM PBS at a pH of 7.4.",
    "Pipette 2 µL of the 1% BSA solution on the inlet and 2 µL of DI-water on the outlet of the channel. Incubate the chip at 25 °C for 1 h in a closed container. Remove excess reagents and dry the channel as described in step 2.1.4.\nIncubation of DNA oligos labeled with biotin and 6-FAM.\nPrepare different concentrations (0.001-5 µM) of the DNA solution in 10 mM PBS at a pH of 7.4.\nDispense 2 µL of one concentration of the DNA solution on the inlet and 2 µL of DI-water on the outlet. Incubate the chip at 25 °C for 15 min in a closed container.\nRepeat step 2.3.2 for the other DNA concentrations using additional biosensor chips.\nRemove excess reagents and dry the channel as described in step 2.1.4.\nImmobilization of GOx-labeled 6-FAM antibodies.\nFormulate a 5 µg/mL concentration of 6-FAM antibodies in 10 mM PBS at a pH of 7.4.\nIntroduce 2 µL of the antibody solution to the inlet and 2 µL of DI-water to the outlet ofthe channel. Incubate the labeled antibodies at 25 °C for 15 min in a closed container. Remove the excess reagents, as described in step 2.1.4.\n3. Amperometric Signal Detection Using the Stop-flow Technique\nPreparation of the substrate solution for electrochemical detection.\nFormulate a 40-mM glucose solution in 0.1 M PBS at a pH of 7.4 in ultra-pure water.\nFor the preliminary treatment, prepare a 0.1 M PBS solution at a pH of 7.4 in ultra-pure water.\nPreliminary treatment of the working electrodes.\nUse the custom-made chip holder to allow for the easy placement of the chip and a fluidic and electric connection.",
    "Electrically connect the biosensor to the potentiostat. Ensure the fluidic contact of the microfluidic channel to a syringe pump and to the reagent reservoir using the custom-made adapter and tubes. Start the laptop that is connected to the potentiostat and start the syringe pump controller, controlling the fluidic flow through the chip.\nStart the syringe pump manually, with 0.1 M PBS at a flow rate of 20 µL/min. At the working electrode versus the on-chip reference electrode, apply an alternating voltage of 0.8 and -0.05 V for 5 s each for 30 cycles. Following this, oxidize the working electrode by applying a voltage of 0.8 V for 60 s.\nAssay readout using the stop-flow technique.\nTo start the assay signal readout, wait until the measured current signal stabilizes. Stop the syringe pump and switch the reagent from 0.1 M PBS to the 40-mM glucose solution and start the software at the syringe pump controller; it will automatically stop the flow for 1, 2, or 5 min and will then restart the flow again. Observe the resulting current peak.\n\t\tNOTE: For the analysis of the data, either the current peak or the charge of the peak can be considered, as described in the model of an electrochemical signal readout (Figure 2).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}