{
  "id": 15297,
  "origin_website": "Jove",
  "title": "Assessment of DNA Contamination in RNA Samples Based on Ribosomal DNA",
  "procedures": [
    "NOTE: Any tissue can be used.\n1. Nucleic Acid Extraction\nPut 100 mg of tissue samples in a 2.0 mL tube, add two 5 mm stainless steel beads and homogenize the tissue at 25 - 30 Hz for 30 s (homogenization duration and frequency depending on tissue type) for both RNA and DNA.\nIsolate total RNA according to the manufacturer's instructions.\nIsolate total DNA according to the manufacturer's instructions.\nControl the purity and quantity of the RNA samples by measuring absorbance at 260 and 280 nm.\nControl the purity and quantity of the DNA samples by measuring absorbance at 260 and 280 nm.\n\tNOTE: While nucleic acids absorb light with a wavelength of 260 nm (A260), the absorbance of light at the wavelength 280 (A280) can be used to quantify the amount of proteins and phenols present in the sample. Therefore, the ratio of A260/A280 nm can be used to evaluate the purity of DNA and RNA extracted from a sample. A260/280 values in the range of ≥1.8 and >2.0 are generally considered to be \"pure\" for DNA and RNA, respectively. Lower A260/280 values may indicate contamination by protein or organic chemicals.\nTest the quality of DNA by running a 0.7% agarose gel electrophoresis. Prepare the gel and run in 1x TRIS-boric EDTA-buffer (TBE: 89 mM Tris, 89 mM boric acid, and 2 mM EDTA) at 100 V for 30 min. High quality gDNA appears as a sharp, high-molecular-weight (HMW) band with no smears in the range of low molecular weight (LMW) molecules.\nCheck isolated RNA for quantity, purity, and integrity under denaturing conditions by a guanidine thiocyanate (GTC) agarose gel electrophoresis or by capillary electrophoresis chip, according to the manufacturer's instructions.",
    "Prepare the GTC gel by adding 5 mM GTC to a standard 1x TBE 1% agarose gel after cooling the agar to 60 °C.\n\t\tNOTE: GTC is toxic, so dispense it in a fume hood, and wear appropriate personal protective equipment.\nPrepare RNA denaturing loading buffer: 95% formamide, 10 mM EDTA pH 8.0, 0.1% bromophenol blue, 0.1% xylene cyanole, and 10 µL ethidium bromide.\n\t\tNOTE: Formamide and ethidium bromide are toxic, and should be dispensed in a fume hood.\nLoad 1 - 5 µg of total RNA in RNA denaturing loading buffer, heat the mixture for 5 min at 70 °C, place it on ice before loading it onto a gel, and then separate RNA on GTC gel at 100 V for 45 min. Load DNA or RNA molecular weight marker as a standard alongside the RNA sample.\nStain the gels with ethidium bromide and visualize the bands using image capture systems under ultraviolet light. In eukaryotes, intact total RNA run at denaturing conditions will show at least two sharp and clear rRNA bands (28S and 18S) with a 2:1 intensity ratio.\nRemove traces of gDNA by treatment with DNase (DNase I RNase-free). Add to an RNase-free tube in 10 µL total volume: 0.1 - 1 µg of total RNA, one unit of DNase I, and 1 µL of 10x reaction buffer with MgCl2. Incubate the mixture for 30 min at 37 °C. Terminate the reaction by adding 1 µL of 50 mM EDTA and incubating at 65 °C for 10 min.\nRemove traces of RNA from gDNA extracts using DNase free RNase A, according to the manufacturer's protocol. Add 5 µL of RNase 10 mg/mL to the total DNA and incubate at 37 °C for 1 h. Store RNA and DNA extracts at -80 °C.",
    "2. Primer Design from rDNA Region for gDNA Assay\nNOTE: The rDNA full-length sequence contains two regions (ITS1 and ITS2), which are removed in the mature rRNA molecule by a series of endonucleolytic cleavages and then degraded (Figure 1).\nRetrieve the rDNA nucleotide sequence from NCBI (http://www.ncbi.nlm.nih.gov) for the species of interest. The best keyword for searching the database is “internal transcribed spacer.”\nInput the target nucleotide sequence into a BLASTn search for finding internal transcribed spacer regions (ITSs), SSU, and LSU conserved regions.\nSelect primers that either flank an ITSs sequence or that amplify ITSs sequences that are not present in the mature rRNA.\n\t\nDesigning primers flanking the ITS1 or ITS2 sequences: Align the conserved regions from various species by ClustalW. Design primers specific for ITS flanking region after taxa specific/cross-species analysis with AlleleID software. The two primer pairs amplifying SSU-5.8S and 5.8S-LSU amplicons can be designed based on the flanking regions of ITS1 and ITS2, respectively. Because these amplicons are spanning across the ITS region, the amplicon length will be increased for at least 300 bp in amplicons from gDNA. This increase reduces the sensitivity.\n\t\t\nFlanking ITS1: Select SSU and 5.8S rRNA sequence. Selected primers for Poaceae are: SSU, SF: CGTAACAAGGTTTCCGTAGGTG, R: GGTTCACGGGATTCTGCAAT. This primer pair (SF: forward and R: reverse) amplifies the partial region of SSU, the full-length of ITS1, and the partial region of 5.8S rDNA.\nFlanking ITS2: Select 5.8S and LSU sequence. Selected primers for Poaceae are: F: ATTGCAGAATCCCGTGAACC LSU consensus sequence, LR: TGCTTAAAYTCAGCGGGTAGYC. This primer pair amplifies the partial region of 5.8S, the full-length of ITS2, and the partial region of LSU (Figure 1).",
    "NOTE: In the case of primer design based on ITSs flanking region, the highly conserved areas of SSU, 5.8S, and LSU were identified. The forward and reverse primers of 5.8S rRNA were designed based on a conserved motif in flowering plants14. The forward and reverse primers were designed based on SSU and LSU conserved regions in Poaceae, respectively. The divergence of SSU and LSU primers for each species is given in Table 1.\nPrimers amplifying an ITSs sequence: In this protocol, design ITS1 primers based on Aeluropus ITS sequence (NCBI taxid number: 110873). For primers, use: Forward: GGTATGGCGTCAAGGAACACT, Reverse: ATAGCATCGCTGCAAGAGGT. According to the amplicons generated by the primer pairs in silico, the size should range from 60 to 200 bp. This is also the recommended size for qPCR analysis.\nPick the primers while considering these recommendations: GC content: 40 - 60%, primer length: 18 - 23 base, PCR product length: 60 - 160 bp (specially for ITS primer), melting temperature (Tm): 60 °C, the final Tm for both primers do not differ more than 5 °C, and the primers are not complementary to themselves or partner primers.\nCheck primer specificity and copy number. Perform in-silico analysis of the selected primer sequence by primer-blast program (https://www.ncbi.nlm.nih.gov/tools/primer-blast/).\n\t\nOpen the Primer-BLAST submission page. Enter both primer sequences in the primer parameters section of the form. In the primer pair specificity checking parameters section, enter an organism name (or organism group name) and select the genome Database. These settings give the specificity information about target sequence and primer parameters including product length, position on chromosome, and copy number.\n3. Perform qPCR Step for Validation of rDNA-based Primers with DNA Templates",
    "NOTE: The functionality of the designed primers should be validated by performing qPCR using gDNA as a template. To perform several parallel reactions and reduce pipetting errors, the preparation of a master mix is recommended. For a master mix, prepare a volume equivalent to the total number of reaction mix plus ~10%.\nPrepare a master mix by mixing all reaction components except the DNA template in a PCR-reaction tube. Upscale as needed from one reaction to prepare the Master mix: 5 µL SYBR green (SYBR) master mix (2x), 0.3 µL primer (0.3 µM each of forward and reverse primer), and adjust the final volume to 10 µL with RNase-free water. Use approximately ≤200 ng in 1 µL of template gDNA for analysis.\n\tNOTE: Thaw, assemble, and keep all reagents, components, and reaction mixes on ice.\nAliquot the Master mix into an optical 96-well plate. Pipette 1 µL of gDNA to each well, and then cover it with optical plate sealing film. Spin and place in cycler.\nRun the qPCR assay on a real-time thermal cycler under the following conditions: 10 min at 95 °C followed by 40 cycles of 95 °C for 15 s and 60 °C for 1 min. Perform data acquisition at the 60 °C annealing/extension step.\nAfter the amplification procedure, subject all PCR reactions to a melting curve analysis with continuous fluorescence measurement from 55 °C to 95 °C. Typically, collect one data point each cycle by a stepwise increase of the temperature by 0.5 °C per cycle.\n\tNOTE: Include at least 2 non-template controls (NTC) for each primer pair master mix. Perform all assays in at least three replications.\nConfirm the primer specificity via the melt curve analysis. Analyze curves with the single threshold cycle and subtracted curve fit method.",
    "NOTE: The appearance of a sharp individual peak indicates a uniform individual amplicon. Primer dimer products can appear as individual peaks at lower temperatures.\nValidate the size of each amplicon by agarose gel electrophoresis.\n\t\nPrepare a 3% agarose gel by mixing 3 g agarose with 100 mL of TBE buffer (TBE: 89 mM Tris, 89 mM boric acid, and 2 mM EDTA).\nMix 5 - 10 µL of PCR product with DNA and 1 - 2 µL of 6x loading buffer. Load PCR product alongside a DNA ladder on 3% agarose gel. Perform an electrophoretic separation in 1x TRIS-boric EDTA-buffer at 100 V for 45 min.\nStain the gels with ethidium bromide or any other intercalating agent and visualize the bands using image capture systems under ultraviolet light.\n\t\tNOTE: DNA intercalating agents (e.g., ethidium bromide) are cancerogenic and should be handled with care and separately dispensed. The appearance of a unique sharp band (with respect to size and without primer-dimer or artificial background amplification) confirms the specificity of the amplicon.\n4. gDNA Contamination Assay Procedure with RNA Templates\nNOTE: After treatment with DNase, the purified RNA sample is tested by rDNA-specific primers. Due to the processing of the intron-like feature of ITSs when these regions are used for amplification, no amplification signal should be detected in DNA-free RNA samples. Based on this, if an amplification signal in qPCR is detected or a band in the agarose gel observed with the expected size (estimated by in silico analysis), this should be due to gDNA contamination. The steps performed in this section, are similar to section 3, except that cDNA of all samples is used as template instead of gDNA.",
    "Prepare a master mix by mixing all reaction components except RNA template in a PCR-reaction tube. Master mix combination for one reaction: 5 µL SYBR master mix (2x), 0.3 µL primer (0.3 µM each of forward and reverse primer mix), and adjust the final volume to 10 µL with RNase-free water. Use approximately 500 ng template RNA in 1 µL volume for analysis.\nAliquot the master mix into an optical 96-well plate. Pipette 1 µL RNA to each well, and then cover it by optical plate sealing film. Centrifuge and place in cycler.\n\tNOTE: Include at least two NTC controls and two positive gDNA controls for each assay. Perform all assays in three technical replications.\nRun the qPCR assay on a Real-time thermal cycler under the following conditions: 10 min at 95 °C followed by 40 cycles of 95 °C for 15 s and 60 °C for 1 min. Perform data acquisition at the 60 °C annealing/extension step.\nAfter the amplification procedure, subject all PCR reactions to a melting curve analysis with continuous fluorescence measurement from 55 °C to 95 °C. Usually, collect one data point each cycle by a stepwise increase of the temperature by 0.5 °C per cycle.\nCheck all PCR products by running on 3% agarose gel electrophoresis.\n\tNOTE: The appearance of any band or peak in the NTC reaction is probably related to primer-dimer formation that is usually seen at low temperatures in the melting curve, while the presence of any band or peak in RNA samples is the result of gDNA contamination. It is recommended to first test all RNA samples by rDNA-based primers, and then non-DNA contaminated samples are used for downstream applications such as cDNA synthesis, gene expression analysis, etc.\n5. RT-PCR Step for cDNA Synthesis and qPCR Analysis",
    "Thaw DNase-treated RNA and the cDNA synthesis reagents at room temperature. After thawing, spin down the reagents. Add 1 µg of RNA and 1 µL of Oligo (dT)18 primer into a nuclease-free tube. Adjust the total volume of 12 µL with RNase-free water, mix gently, and then store on ice.\nMelt secondary structures of RNA template by incubating the reaction at 65 °C for 5 min. Spin down and cool the vial on ice.\nPrepare the reaction master mix (final volume 20 µL for each reaction) as follows: 1 µL of reverse transcriptase (200 U/µL), 4 µL of reaction buffer (5x), 1 µL of RNase inhibitor (20 U/µL), and 2 µL of dNTP Mix (10 mM). Mix gently and cool the vial on ice. Add 19 µL into the prepared tube containing the RNA.\nIncubate the reaction for 60 min at 42 °C, and then incubate at 70 °C for 5 min to terminate reverse transcriptase activity. Place the RT reactions on ice and proceed to gene expression analysis by routine qPCR procedure (as explained in section 3 and 4)."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}