{
  "id": 12242,
  "origin_website": "Jove",
  "title": "Preparation of Primary Acute Lymphoblastic Leukemia Cells in Different Cell Cycle Phases by Centrifugal Elutriation",
  "procedures": [
    "NOTE: This protocol has been optimized for primary B-ALL cells which range in diameter from approximately 8 µm (G1 phase) to 13 µm (G2/M phases). Thus, the specific centrifuge speeds and pump flow rates may not be applicable to cells with different size ranges. Nevertheless, appropriate elutriation parameters can be estimated using the sedimentation rate equation. Cells are cultured in a defined serum-free medium as described16 at an optimal density of 1 - 3 x 106 cells/mL. With the exception of the collection of fractions which is conducted at 4 °C using ice-cooled tubes, all steps are conducted at room temperature and the centrifuge set at 20 °C with a maximum of 24 °C.\n1. Preparation of Elutriation Buffer and Materials\nIn order to reduce clumping of cells, prepare an elutriation buffer of Hank's balanced saline solution (HBSS) with phenol red supplemented with 2% fetal bovine serum (FBS), to protect cells from mechanical stress during the elutriation process, and 1.6 g/L of 2-naphthol-6,8-disulfonic acid dipotassium salt (NDA), which renders the cell exterior negatively charged and reduces clumping.\n\t\nAdd 1.6 g of NDA to a 50 mL conical tube.\nUnder sterile conditions, add 35 mL of HBSS from a 1 L bottle to the 50 mL conical tube containing NDA. Swirl the tube until the NDA has dissolved.\nUsing a 0.2 µm filter, transfer the dissolved NDA into a new sterile 50 mL conical tube. Then add the NDA to the remaining 1 L of HBSS.\nFinally, add 21 mL FBS to the HBSS to obtain a final concentration of 2% (v/v).\n\t\tNOTE: The elutriation buffer can be prepared and stored at 4 °C until the expiration date on the HBSS or until there is a major change in the pH as indicated by a yellowing of the indicator dye.",
    "Label 50 mL conical tubes for collection of fractions so that there are tubes labeled wash 1 and 2 (W1 and W2), fractions 1 - 20 (F1 - F20), and STOP.\n\t\nPre-chill these tubes on ice before collecting fractions.\n2. Assembly of the Elutriation System\nFirst, install the strobe assembly into the centrifuge so that the power cord is fed out of the chamber through the port on the left side. Ensure that the strobe flash lamp is at the front of the chamber so it will line up with the viewing window when the centrifuge is closed.\n\t\nSecure the assembly in place by first tightening two Phillips-head screws into the two holes at the top of the each bracket and then by tightening the thumbscrews at the bottom of each bracket.\nPlug the power cord into the strobe power port at the back of the centrifuge.\nNext, set the rotor straight down onto the centrifuge drive hub and secure with a T-handle hex wrench.\n\tNOTE: If the centrifuge is not needed for non-elutriation purposes, the strobe assembly and the rotor can be kept in the centrifuge between runs.\nOnce the rotor is secured, place the quick-release assembly containing the elutriation chamber, counter balance, rotating seal assembly, and a mounting plate into the rotor.\n\t\nPush down evenly with one hand on the elutriation chamber and the other hand on the counter balance until the bolts in the rotor snap into the holes on the mounting plate.\nFinally, attach the anchoring cable by placing the pin on one side of the cable into the hole in the rotating seal assembly and securing the eyehole on the other side of the cable with one of the Phillips-head screws (mentioned in 2.1.1) on the bracket on the left side of the chamber.",
    "Next, assemble the flow system using a variable speed pump and tubing to pump buffer into the elutriation chamber and collect buffer as it flows out of the elutriation chamber.\n\t\nInsert the size 16 input tubing coming from the variable speed pump through the port at the top left of the centrifuge chamber so that it enters into the chamber.\nAttach a fitting to the free end of the input tubing and insert the fitting into the input hole on the side of the rotating seal assembly.\nInsert the size 16 output tubing through the port and attach it to the transfer tube at the top of the rotating seal assembly.\n\t\tNOTE: The flow system can also remain assembled between elutriation runs.\nLastly, turn the centrifuge on and set the specifications necessary for the experiment.\n\t\nChange the rotor ID.\nIf the centrifuge requires a time input, set for 2 h, which is more than sufficient to complete an elutriation run.\nSet the temperature to 20 °C with a max temp of 24 °C.\nSet the acceleration for max and the deceleration for slow.\nFinally, set the speed to 867 x g.\n3. Priming of the Elutriation System\nFirst in order to sterilize the elutriation system, place the reservoir tubing into a 500 mL plastic bottle containing 5% bleach and place the output tubing into an empty 1 L plastic waste bottle.\n\t\nTurn the pump on and set the speed to 25 mL/min and allow the 5% bleach to flow all the way through the elutriation system until it is pumped out of the output tube into the waste bottle.\nTurn the centrifuge on and allow it to come to the maximum designated speed (867 x g) in order to release bubbles and backpressure.",
    "Stop the centrifuge. Once the rotor has stopped rotating, open the lid and inspect the chamber for any leaks.\nIf there are no leaks, let the bleach solution flow through the system for at least 5 min.\nNext, flush the system with autoclaved water as bleach can lead to formation of precipitates from the elutriation buffer which may lead to clumping of the cells, as well as cause harm to the cells.\n\t\nPlace the reservoir tubing into a 1 L bottle of autoclaved water and allow it to flush through for at least 10 min.\nAfter flushing with water, introduce elutriation buffer into the system. Use a 150 mL glass bottle which has been autoclaved to create a reservoir for the elutriation buffer and cells.\n\t\nAdd 100 mL of elutriation buffer to the bottle and move the reservoir tubing to the glass bottle so that the tube is at the very bottom.\nStart the centrifuge and allow the buffer to flow through the system to flush out the water.\nOnce the reservoir bottle is almost empty and the water is completely flushed out of the system, move the output tubing from the waste bottle to the reservoir so that the buffer is being recycled through the system.\nFinally, adjust the viewing window so that the elutriation chamber can be seen at the current speed.\n\t\nPress the strobe lamp power button on the outside of the centrifuge so that the lamp turns on. Turn the elutriation knob also on the outside of the centrifuge all the way to the left.\nWhile looking through the viewing window, slowly turn the knob to the right until the elutriation chamber comes into view and the strobe light is in time with the rotation of the rotor.",
    "NOTE: The elutriation system can be left in this state until the cells are prepped.\n4. Preparation of the Cell Sample\nCount cells and aliquot 300 to 400 million in growth medium into several 50 mL conical tubes. Spin down the cells at 1210 x g for 3 min.\nAspirate off growth media and resuspend cells in 25 mL of elutriation buffer by pipetting up and down gently.\nIn order to reduce cell clumping, pass cells twice through a 25 gauge needle.\n\t\nUsing a 10 mL syringe draw up the cells and then attach 25 gauge needle and pass the cells through onto the inside wall of a sterile 50 mL conical tube. Repeat this until all 25 mL have passed through the needle.\nObtain a new needle and syringe and repeat the process above once.\n\t\tCaution: Syringe needles should be placed in sharps containers.\n\t\tNOTE: It is critical that the cells are pushed through the needle immediately before introducing them to the elutriation system to keep cell clumping to a minimum.\n5. Introduction of Cell Sample into the Elutriation System and Collection of Fractions\nIntroduce the cell sample into the elutriation system by pouring the cell sample into the reservoir tank which has the remaining elutriation buffer recycling through.\n\t\nLet the cells enter into the system and reach equilibrium within the elutriation chamber.\n\t\tNOTE: This process will take about 5 min and progress can be tracked by watching the cells as they enter the chamber via the viewing window. To ensure all cells are in the chamber, take a drop of eluent, place on a glass slide, and view under a microscope. If the sample is free of intact cells, this confirms their retention in the chamber.",
    "Start collecting fractions once all the cells have entered into the chamber and there is a distinct boundary at the widest part of the chamber in which the cells are in equilibrium.\n\t\nBegin by moving the output tube to the 50 mL conical tube labeled W1. Collect 50 mL of elutriation buffer for this fraction, making sure to keep an eye on the reservoir tank and replenish with elutriation buffer when necessary.\n\t\tNOTE: In order to make sure that all cells have entered into the system, allow the reservoir tank to become almost empty before refilling the reservoir the first time. After the first refill it will not be necessary to wait for the reservoir to become almost empty. Also, DO NOT ever allow the tank to become empty as this will create bubbles and back pressure in the system.\nOnce 50 mL have been collected for W1, simultaneously change the speed to 821 x g and move the output tube to the conical tube labeled W2 and collect 50 mL more at this speed.\nContinue changing the speed and collecting fractions as indicated in Table 1. Make sure there is media in the reservoir tank and keep the conical tubes on ice at all times. Finally, adjust the viewing window by slowly turning the knob to the right as the speed decreases.\nOnce all 20 fractions have been collected, stop the centrifuge and collect 50 mL in the conical tube labeled STOP.\n6. Flushing of the Elutriation System\nAfter the centrifuge has stopped completely flush the system by putting the reservoir tube in the 1 L bottle of autoclaved water and the output tube back in the waste bottle.",
    "Turn the pump speed up to 50 mL/min and allow the water to run through the system until it is depleted.\nTurn off the pump, remove the input and output hose from the quick-release assembly, and pull out the pin from the anchoring cable.\n\t\nRemove the quick-release assembly from the rotor.\n\t\tNOTE: Depending on what the centrifuge will be used for, the elutriation system can now be left as is. Otherwise, the whole assembly can be taken down in the opposite order as described above.The elutriation chamber can be removed from the quick-release assembly and cleaned between runs using an ultrasonic water bath. This removes debris and contaminants from the chamber wall which may negatively affect later runs.\n7. Analysis of Fractions and Collection of the G1 or G2/M Pools.\nNote: In order to demonstrate the effectiveness of elutriation, each fraction is analyzed for cell count, cell diameter, and DNA content, and pools are created of cells in the G1 or G2/M phases for immunoblot analyses, as described in Representative Results. This protocol section will describe how to create these pools and prepare them for experimental use.\nSpin each fraction at 2000 x g for 5 min at 4 °C and aspirate off elutriation buffer.\nCombine fractions together in order to obtain both a G1 phase pool and a G2/M phases pool.\n\t\nFor the G1 phase pool, resuspend fractions which were collected in the speed range of 788 x g to 661 x g (F1 - F5) in a total 1 mL of phosphate buffer saline solution (PBS) and transfer to a 15 mL conical tube. For the G2/M phases pool, resuspend fractions which were collected in the speed range of 387 x g and 333 x g (F17 - F20).",
    "Spin down cells at 2000 x g for 5 min at 4 °C and aspirate off PBS.\nResuspend cells in 10 mL of growth media and take a cell count.\nTake an aliquot from each pool to be analyzed for DNA content via propidium iodide staining and flow cytometric analysis15.\n\tNOTE: The remainder of each pool can be used for further experiments.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}