{
  "id": 4202,
  "origin_website": "Cell",
  "title": "EU-RNA-seq for in vivo labeling and high throughput sequencing of nascent transcripts",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nEU labeling\nTiming: 45 min\nEU-labeling allows for the incorporation of 5-ethynyluridine (EU) into nascent transcripts as they are being generated. For most cell lines, it takes approximately 30–40 min for EU to cross both the cell and nuclear membranes and begin to be incorporated at detectable rates.\nPrepare fresh Labeling Media\nPrepare 1 mL per 10-cm plate of cells.\nUse pre-warmed Growth Media.\nInvert the solution several times to thoroughly resuspend the EU.\ntable:files/protocols_protocol_961_6.csv\nAdd 1 mL of pre-warmed Labeling Media to the 5 mL of Growth Media in which you’ve cultured your cells on a 10 cm plate to 80% confluency.\nSwirl the plate gently to mix for a final concentration of 0.5 mM EU.\nIncubate at 37°C for 40 min.\nNote: The incubation time in labeling media should be optimized for the cell line in use and should occur under normal culturing conditions. See Troubleshooting Problem 2[href=https://www.wicell.org#sec5.3].\nHarvest total RNA, including EU-RNA\nTiming: 30 min\nTotal RNA is harvested from the cells. This includes all cellular RNA, including that which was labeled with EU during the 40-min labeling step.\nGently aspirate the Labeling Media from the cells.\nAdd 1 mL PBS to the side of the plate and gently swirl around to rinse the remaining media off of the cells.\nGently aspirate the PBS from the cells.\nAdd 700 uL TRIzol reagent directly to the cells and use a cell lifter to spread around the TRIzol and dislodge the cells from the plate.\nTransfer the cells in TRIzol to a 1.5 mL microcentrifuge tube\nVortex on maximum speed for 1 min.\nSnap freeze in liquid nitrogen.\nPause point: Samples can be stored at −80°C.\nPurify RNA with the miRNeasy Kit, as per manufacturer’s protocol.",
    "Note: Other RNA isolation kits may also be used, but we chose the miRNeasy kit to capture as many forms of nascent RNAs as possible.\nQuantify the total RNA recovered.\nPause point: Samples can be stored at −80°C after completion of step 7.\nBiotinylation of cellular EU-RNA\nTiming: 45 min\nThis step conjugates biotin-azide to the EU in any EU-labeled RNAs present in the total RNA harvested from the cells. Be sure to perform this step on an unlabeled, “NoEU” control as well.\nPrepare 2.3 ug of total RNA in a final volume of 15.75 uL water.\nPerform the click reaction as per manufacturer’s protocol in 50 uL total volume.\nProceed immediately to RNA precipitation.\nCritical: Perform the 30-min incubation of the click reaction on a rotator or vortexer to keep the beads moving. We suggest 30 min with gentle agitation.\nRNA precipitation\nTiming: 1 h (after an 12–20 hr incubation)\nThis part of the protocol is largely from the Invitrogen Click-iT Nascent RNA Capture kit, with some small modifications. The purpose is to clean up the samples following the click reaction.\nAdd 1 uL of glycogen, 50 uL of 7.5 M ammonium acetate, and 700 uL of chilled 100% EtOH, invert the tube to mix and incubate at −70°C for 12–20 h.\nPause point: While the manufacturer’s protocol states that the −70°C incubation can be performed for a minimum of 3 h or on dry ice for 30 min, we recommend a 12–20 hr incubation for optimal recovery.\nSpin at 13,000 × g for 20 min at 4°C.\nRemove the supernatant from the tube without disturbing the pellet and add 700 uL of chilled 75% EtOH.\nVortex briefly to mix and spin at 13,000 × g for 10 min at 4°C.\nRepeat the 75% EtOH wash.",
    "Let the pellet air dry at 20°C–22°C.\nThoroughly resuspend the pellet in 10 uL water.\nQuantify RNA by Qubit.\nPause point: The RNA can be stored at −80°C after completion of step 18.\nBiotin-EU-RNA and biotin-spike-in pull-down\nTiming: 3 h\nThaw sample RNA and biotin-control RNAs on ice.\nAdd 5e-5 ug spike-in control #1 and 5e-4 spike-in control #2 to 1.7 ug of sample RNA in a total volume of 5 uL.\nDispense 5 uL beads per sample into 1.5 mL microcentrifuge tubes.\nCritical: Use only 5 uL of bead solution for the pull down instead of the manufacturer’s recommended 50 uL. The reaction volumes have been adjusted by 0.1× to account for this reduction in bead volume.\nPer sample:\nWash the beads 3× with 9 uL Wash Buffer 2.\nResuspend beads in 5 uL Wash Buffer 2.\nDilute RNaseOUT 1:10 then prepare Master Mix as follows per reaction.\ntable:files/protocols_protocol_961_7.csv\nAdd 15 uL of master mix to each 10 uL sample.\nIncubate on heat block at 69°C for 5 min.\nAdd 5 uL pre-washed beads to each reaction.\nPipet up and down to mix.\nIncubate at 24°C for 30 min with gentle agitation.\nSuggestion: tap tubes every few minutes to keep beads in suspension.\nCritical: Perform the incubation on a rotating heat block to keep the beads moving.\nPlace samples on a magnetic rack and wash the beads, as per manufacturer’s protocol.\n5× with 50 uL wash buffer 1\n5× with 50 uL wash buffer 2\nResuspend beads in 5 uL Wash Buffer 2.\nOptional, but recommended: proceed to Troubleshooting Problems 3[href=https://www.wicell.org#sec5.5] and 4[href=https://www.wicell.org#sec5.7].\ncDNA library generation\nTiming: 3 Days\nThis section of the protocol is largely based on the manufacturer’s protocol, with some small modifications to account for using beads as the starting template.",
    "Perform the library generation with NuGen’s Ovation Human FFPE RNA-Seq Kit, as per the manufacturer’s protocol, with the following adjustments:\nBegin with the 5 uL of resuspended beads from step 26.\nBriefly remove the sample from the PCR machine every 5 min during PCR programs 2 and 3 and tap/flick the side of the tube to keep the beads from settling at the bottom.\nAfter adding the Second Strand Stop Buffer (B3), transfer the tube to a magnetic rack, let stand for 2 min to clear the solution, and carefully remove the supernatant from the beads with a pipette while the tube is still on the rack.\nOptional, but recommended: proceed to Troubleshooting Problem 5[href=https://www.wicell.org#sec5.9].\nCritical: Keep the supernatant and discard the beads.\nSequencing\nPaired-end sequencing to 75 bp was performed on the Illumina NextSeq500 High Output Kit v2.5 75 Cycles. Reads were trimmed to 35 nucleotides and aligned to human genome build hg19, as described below.\nBackground subtraction and spike-in normalization\nSequencing data must be aligned to the genome and processed to produce per-gene tag counts adjusted for library size, interphase contamination, and spike-in proportion. Data may be visualized by the use of bigWig format track files on UCSC Genome Browser or IGV.\nAlign reads to the genome using bowtie2 / tophat with command-line parameter --very-sensitive in end-to-end mode. Sort aligned tags by tag ID using samtools sort -n, then remove PCR duplicates using PICARD MarkDuplicates with command-line parameters REMOVE_DUPLICATES=True and ASSUME_SORT_ORDER=queryname.",
    "To quantify tag levels at transcript models, first download transcript models in BED format from an online database such as UCSC Genome Browser. Critically, the file should have the chromosome / contig, TSS, and TES of each transcript model in columns 1, 2, and 3, respectively. If spike-in controls were used, include the coordinates of the relevant loci in this file. Use deepTools multiBamSummary in BED-file mode and write counts for all samples to a file with option --outRawCounts. Calculate the RPM for each sample as 1,000,000 / number of aligned tags and then adjust each count as itself multiplied by the RPM, divided by the number of kilobases in the transcript model, defined as (max(TSS,TES)-min(TSS,TES))/1000. Subtract NoEU samples from experimental samples, then zero out negative values. Where spike-ins were added, sum the tags aligned to all spike-in loci and adjust for RPM, then divide all counts by this scalar.\nTo make bigWig track files, use deepTools bamCoverage to obtain bigWigs with command-line parameter --normalizeUsing CPM. Do this for experimental and NoEU control samples, then subtract NoEU using deepTools bigWigCompare --operation subtract. If a spike-in was used, control the spike-in ratio using the --scaleFactors parameter and the scalar calculated above."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Gene Expression",
    "Sequencing",
    "Rnaseq"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}