{
  "id": 7673,
  "origin_website": "Bio",
  "title": "Von Willebrand Factor Multimer Analysis by Low Resolution SDS-Agarose Gel Electrophoresis",
  "procedures": [
    "Prepare the glass cassette for hand-made agarose gel On a plane glass plate, glue rectangular rubber seals (10 mm long; 4 mm wide; 1.5 mm thick) on the long side of the glass plate (1.5 cm under the longitudinal edge)—14 pieces at regularly spaced distance. These will form the loading wells for samples (Figure 2A).Place a separate plane glass plate on the bench (11.5 × 23.0 × 0.2 cm). Cut gelbond film to a length of 23 cm. With a few drops of purified water, fix the gelbond film with its hydrophobic side on the glass plate, avoiding air bubbles (Figure 2B).Wet the U-shaped rubber seal and place it on the gelbond film (Figure 2C). Place the other glass plate with the loading rubber seals on top, so it forms a casting mold (cassette) (Figure 2D).Fix the glass cassette with clamps (Figure 2E).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4495/bioprotoc-12-16-4495-g002.jpgFigure 2. Preparation of the gel cassette. Casting of separation gel Caution: Hot liquids, handle with care. Wear protective equipment to prevent injury. Prepare a 1% agarose gel. Suspend 0.5 g agarose SEAKEM HGT with 50 mL of separation gel buffer and heat the solution in a microwave oven (e.g., 900 W; interrupt heating when liquid starts to foam, remove from oven, and gently agitate; repeat procedure until complete dissolution). Draw this solution into a 50 mL syringe, close the syringe with a cone, and incubate it in a water bath at approximately 90 °C for approximately 30 min.Place the glass cassette upright in a pre-warmed water bath at 60 ± 5 °C. To cast the gel, place a cannula on the syringe and slowly fill the hot agarose into the glass cassette (on one upper side of the glass cassette) until approximately 1 cm below the loading wells.",
    "Take the glass cassette out of the water bath and allow the gel to set. Keep at room temperature (RT) for approximately 1 h, standing upright.Casting of stacking gel Caution: Hot liquids, handle with care. Wear protective equipment to prevent injury. Suspend 0.2 g agarose SEAKEM HGT with 25 mL of stacking gel buffer in the microwave oven until complete dissolution. Cool to approximately 60–70 °C, and pipette the agarose on top of the separation gel until reaching the upper end of the cassette.Once the cassette is fully filled, keep a small volume of stacking gel for Procedure F.Allow the gel to set for approximately 1 h at RT. Open the glass cassette by carefully removing the clamps and the upper glass plate. Take out the gelbond film with the adhesive agarose gel.Preparing the electrophoresis apparatus Turn on the cryostat to cool down the flatbed ceramic plate at approximately 10 °C.Add the running buffer (approximately 1 L per flatbed chamber) to the reservoirs at each end of the gel chamber.Pipette a few drops of running buffer on the ceramic plate, and place on top the gelbond film with the gel, with the loading wells on the cathodic side.Filter papers (1CHR) soaked with running buffer are placed as follows: five layers of paper (23 cm × 15 cm), one end in the cathodic buffer vessel, the other end attached to the cathodic end of the gel (do not overlap the gel), and on top another five layers slightly overlapping the agarose gel (keep at approximately 1 cm distance to the sample application wells). Repeat the same procedure on the anodic end of the gel, with five layers of 23 cm × 15 cm paper and five layers of 23 cm × 23 cm paper.",
    "Sample preparation/loading Caution: Hot liquids, handle with care. Wear protective equipment to prevent injury. Dilute samples and assay control to the same VWF concentration (preferably 1 IU VWF:Ag/mL), using 0.9% NaCl as diluent.Mix 0.2 g Biozym Plaque Agarose with 10 mL of sample buffer, and heat in the microwave oven until completely dissolved. Cool down in water bath to approximately 60 °C.Mix 50 µL of diluted sample, 50 µL of sample buffer, 10 µL of bromophenol blue solution, and 100 µL of Biozym Plaque Agarose.Incubate at 60 ± 5 °C for 20 ± 5 min.Load a volume of 50 µL per loading well.Electrophoresis Close the lid and start the electrophoresis.Running time: 15–20 h.Running conditions: 25 mA constant for 1–3 h, until samples are fully run out of the wells. Interrupt the run to fill the empty wells with stacking gel (30 µL). Continue the separation with 8–10 mA for 14–16 h, until the bromophenol blue line has reached the end of the gel.After separation, VWF multimers are visualized by either direct in-gel staining or after blot transfer. The protocol below describes the in-gel procedure only.In gel immuno-staining Drying the gel After finishing the gel run, remove the filter papers and wash the gel with purified water on a horizontal shaker for approximately 1–3 h, changing the water for a minimum of five times. The bromophenol blue line should no longer be visible.Press the gel for 45 min: Place two chromatography paper sheets (3CHR) soaked with purified water on the gel, two more dry papers, and five more kitchen towels. Place one glass plate on top, and press with approximately 2 kg (e.g., place two 1 L bottles with water on top).",
    "After pressing, remove all paper sheets, fix the gel on the bench, and carefully dry the gel with a hair dryer for approximately 30 min.Immuno-staining Note: The following procedure is for detection of human VWF. For visualization of VWF from other species, appropriate antibodies need to be selected. Primary antibody: rabbit anti-human-VWF (A0082) Place the gel in a tray.The antibody is diluted to 1 µg/mL in washing buffer/antibody dilution buffer. Prepare a solution of 100 mL per gel, and add to the tray.Incubate the gel under gentle agitation (shaker) for approximately 16 h.Pour off the antibody solution and wash the gel with washing buffer/antibody dilution buffer for 5 h.Secondary antibody: goat-anti-rabbit-IgG-ALP-conjugated Dilute the secondary antibody with washing buffer/antibody dilution buffer to 0.6 µg/mL (100 mL per gel).Place the gel into the diluted secondary antibody and incubate under gentle agitation for approximately 16 h.Pour off the secondary antibody and wash the gel for 1 h in washing buffer/antibody dilution buffer.Repeat the washing procedure for a further 3–4 h in PBS buffer for immunostaining (without Triton X100), by changing the buffer a minimum of five times.Immuno-staining according to package insert from AP-Kit (Bio-Rad) Prepare a solution with 4 mL of kit buffer, 1 mL of reagent A, and 1 mL of reagent B from the AP-Kit. Fill up to 100 mL with purified water.Use a fresh tray. Place the gel in the staining solution and incubate on a shaker at RT for approximately 10–30 min. The incubation time depends on the band intensity. The bands must be clearly visible, without significant background stain.Place the gel in purified water to stop staining. Wash with purified water for approximately 20 min.Fix the gel horizontally on the sides with adhesive strips, and dry the gel either by air drying or with a hair dryer."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}