{
  "id": 17715,
  "origin_website": "Jove",
  "title": "Noninvasive Electrocardiography in the Perinatal Mouse",
  "procedures": [
    "The following protocol follows the standards of the Institutional Animal Care and Use Committee of the University of New England. Close observation of the protocol should deliver satisfactory ECG reads in all examined neonates (n > 70).\n1. Device preparations\nPlug the device into the USB port of a computer with the ECG software downloaded on it. The measuring device will automatically begin heating up to (37 °C/98.6 °F). The internal heating unit is contained within the measuring unit and heats only the plastic surface. The silver wire electrodes are not heated.\nAllow approximately 15 min for the surface to reach the temperature. Use this time to gather and set up animals.\n\tNOTE: The protocol may be paused at this point and the platform can remain plugged in and heating for an extended period of time. In the absence of a self-heating electrode platform, an animal safe heating pad may also be used to keep mother and pups from becoming hypothermic.\n2. Animal preparations\nCollect the mother and pups and keep within the housing cage until ready to collect.\nOnce the measuring unit has heated to the temperature, remove the mouse pup from the cage and wipe the thorax with 70% ethanol sprayed on a wipe. Place the pup on the heated surface of the plastic.\nAllow the mouse to acclimate to the surface in the dark for approximately 2-5 minutes.\n3. Mouse and electrode platform setup (electrode application)\nUse a metal spatula, probe, or wooden dowel to collect a small droplet of adhesive, electrical conducting gel (a quick-drying high-conductivity electrode gel commonly used for placement of rodent electrodes).",
    "NOTE: Any nonfibrous, solid object can be used to apply the conducting gel, as long as the object will not leave behind synthetic fibers or similar material on the electrodes that could interfere with the quality of the electrical signal.\nUsing the spatula/dowel, gently touch the top of each of the four, flattened electrode surfaces by pressing gently down and pulling the conducting gel at an oblique angle away from the center of the electrode construct. Make sure that each individual electrode is completely covered with the gel.\n\tCAUTION: This step is extremely important to ensure that the conductive, electrode gel does not adhere to more than a single electrode. Adhesive strands that form between electrodes can conduct charge and potentially interfere with or short out the desired electrical signal. The protocol should not be paused at this time as the gel will begin to solidify and become adherent. Make sure to set up the mouse to the platform within 5-10 minutes of applying conducting gel (or equivalent conductive electrode gel substitution).\nPlace the metal spatula or wooden dowel with the remainder of the gel to the side.\nPlace the neonatal mouse pup sternum down and prone with the head of the pup facing the outgoing USB edge of the platform. Make sure that a portion of the pup’s chest is covering each of the four electrodes. Gently restrain the pup’s forearms by their side while simultaneously holding down for approximately 1 min to allow the conducting gel to set.",
    "Place rubber silicone bumpers on the right and left sides of the pup. Bumpers should secure the pup on each side and provide stability to prevent excessive movements of the mouse but should NOT prevent all movement of the mouse. Once installed, watch the mouse for a moment and adjust bumper placement as needed.\n\tCAUTION: Do not compress the mouse too tightly as this can interfere with respiratory mechanics and respiratory rate.\nUse the dowel that was set aside to apply remaining conducting gel to the grounding tail electrode and place on the rump of the pup. Apply gentle pressure to allow the gel to set before releasing the pup.\nPlace the final silicon bumper on top of the rump of the mouse to hold the grounding electrode in place.\n\tCAUTION: Do not apply excessive force while placing the final bumper as this could cause discomfort to the pup and/or displace the grounding electrode.\nGrab ahold of the entire platform and gently place inside the Faraday cage.\n\tCAUTION: Use caution and ensure the top silicone bumper does not become displaced once the Faraday cage is in place.\nPrior to recording, make sure the mouse pup is not moving excessively and make sure the body and head of the mouse appears secure.\n\tCAUTION: Make sure the mouse pup’s head is able to move somewhat freely within the bumpers and is not completely snout down into the platform. The raised platform is designed to elevate the mouse thorax slightly and prevent suffocation, but this should be closely monitored.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}