{
  "id": 3950,
  "origin_website": "Cell",
  "title": "Measuring the effect of drug treatments on primary human CD8+ T cell activation and cytolytic potential",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nLabeling and isolation of primary CD8+ T cells from whole blood\nTiming: [2 to 2.5 h]\nThis section describes how to process human whole blood to obtain the buffy coat. We recommend processing the blood shortly after or within the same day of blood draw. All work in this section needs to be performed in a sterile biological safety cabinet (or tissue culture hood). All equipment (pipettors), plastic ware (serological pipettes, pipette tips, conical tubes) need to be sterile. All work surfaces need to be cleaned with 70% ethyl alcohol before beginning.\nAliquot 12 mL Lymphoprep into 50 mL conical tubes.\nDilute whole blood using non-supplemented RPMI 1640 media.\nIn a sterile flask, dilute blood at roughly 1:1 ratio with non-supplemented RPMI 1640 media.\nMix well by pipetting up and down using a 25 mL serological pipette.\nNote: In our experience, we obtain 80–100 mL of whole blood collected in 10mL K2-EDTA BD Vacutainer tubes. All tubes are pooled into a sterile flask. Each tube is rinsed with 10 mL of non-supplemented RPMI 1640 and added to the sterile flask. In the end, about 200mL of diluted blood is prepared for layering onto 6 Lymphoprep conical tubes.\nCritical: Make sure to set the pipettor to its slowest dispense rate prior to next step. It is critical that the diluted blood does not mix with the Lymphoprep to prevent red blood cell contamination and proper separation of blood components.\nCarefully layer up to 36 mL of diluted whole blood onto Lymphoprep aliquots.\nCarefully place and balance the conical tubes in the centrifuge.\nCentrifuge for 25 min at 600 g, zero or lowest acceleration and deceleration, room temperature.",
    "Critical: The centrifugation settings at zero or lowest acceleration and deceleration are critical to ensure proper separation of blood components (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/671-Fig1.jpg\nFigure 1. Layers of blood components after centrifugation of blood on density gradient medium\nImage made with BioRender.\nNote: After centrifugation, carefully transport the tubes back to the sterile biological safety cabinet. A clear layering of the different blood components should be seen, with a large white band of cells in the middle of the conical tube.\nAfter centrifugation, set the centrifuge back to highest acceleration and deceleration, and 4°C temperature settings.\nAspirate and dispose of the plasma component (top layer) from the conical tube.\nSlowly aspirate the buffy coat and place in clean 50 mL conical tube.\nNote: Buffy coats from 2 centrifuged conical tubes may be combined into 1 clean 50 mL conical tube. For example, 6 tubes that were layered with whole blood can be pooled into 3 tubes containing buffy coats.\nTop up the conical tubes containing pooled buffy coats with non-supplemented RPMI 1640 media.\nCentrifuge at 300 g for 10 min, at 4°C.\nAspirate and discard supernatants.\nWash cell pellet by adding 40 mL of non-supplemented RPMI 1640 media and centrifuge at 300 g for 10 min, at 4°C. Aspirate and discard supernatant.\nRepeat step 11.\nNote: Washing steps are critical to remove the Lymphoprep to ensure clean labelling and isolation of CD8+ T cells.\nDuring centrifugation, prepare 10 mL of 1× Red Blood Cell (RBC) lysis solution from 10× stock.\nMix 1 part of 10× RBC lysis solution in 9 parts of sterile water.\nResuspend each cell pellet slowly, with 2 mL 1× RBC lysis solution.\nIncubate for 2 min at room temperature.",
    "Add 5 mL of MACS buffer to each tube and pool all cell suspensions into a singular 50 mL conical tube.\nTop up to 50 mL with MACS buffer and count the number of cells and the viability with ready-to-use trypan blue (0.4%) solution.\nCentrifuge at 300 g for 10 min at 4°C and discard supernatant.\nProceed to CD8+ T cell magnetic labeling following the manufacturer recommendations.\nCritical: There are different cell isolation systems that can be used to purify human CD8+ T cells from a mixture of cells. We recommend the systems from Miltenyi Biotec: “CD8+ T Cell Isolation Kit” or the “CD8 MicroBeads” isolation kit. Catalogue number for both kits is provided in the key resources table[href=https://www.wicell.org#key-resources-table]. We also recommend setting up the QuadroMACS magnets prior to starting or during centrifugation waiting times.\nAfter collecting purified CD8+ T cells, centrifuge at 300 g for 10 min at 4°C and discard MACS buffer supernatant.\nResuspend in 2 mL of supplemented T cell culture media with IL-2.\nCentrifuge at 300 g for 10 min at 4°C and discard supernatant.\nResuspend purified CD8+ T cells in 5 mL of supplemented T cell culture media with IL-2.\nCount the number of cells and viability with ready-to-use trypan blue (0.4%) solution.\nOptional: Measure purity of CD8+ T cell populations by staining with 1:100 concentration of CD3, CD4, CD8 antibodies diluted in 100 μL FACS Buffer; incubate for 30 min at room temperature, wash with FACS buffer and proceed for flow cytometry. See Table 1[href=https://www.wicell.org#tbl1] for a panel to measure CD8+ purity with minimal flow cytometry compensation steps. A recommended minimum of 100,000 cells are needed to measure CD8+ T cell purity.\ntable:files/protocols_protocol_671_7.csv\nMeasuring drug response during in vitro activation of human CD8+ T cells\nTiming: [1 to 5 days]",
    "This section describes the T cell culture conditions to activate human CD8+ T cells to assess responses to drug treatments of choice.\nUpon obtaining the total CD8+ T cell count, resuspend the CD8+ T cells at 200,000 cells per mL in supplemented T cell media with IL-2.\nTransfer resuspended CD8+ T cells into a sterile reagent reservoir.\nUsing a multichannel pipette, transfer 50 μL of the resuspended CD8+ T cells to U-bottom 96-well plates designed to culture suspension cells.\nNote: Resuspending CD8+ T cells at 200,000 cells per mL and transferring 50 μL to each well of a U-bottom 96-well plate corresponds to 10,000 cells per well.\nTransfer sufficient of CD3/CD28 Human T-Activator Dynabeads, at 1 bead to 2 T cells ratio to a sterile 1.5 mL microcentrifuge. This translates to 5,000 Dynabeads for 10,000 T cells in each well.\nCritical: The Dynabeads Human T-Activator CD3/CD28 stock is at 40 million beads per mL in phosphate buffered saline (PBS), pH 7.4, with 0.1% human serum albumin. Prior to adding Dynabeads to the seeded T cells, the magnetic beads need to be washed in the T cell culture media. This can be performed either by centrifugation (300 g, 5 min) or using a magnet (e.g., DynaMag2 Magnet).\nExample: If 1 million CD8+ T cells resuspended in 5 mL of T cell media were seeded in 100 U-bottom wells, 0.5 million Dynabeads should be resuspended in 5 mL of T cell media. Then, add 50 μL of resuspended Dynabeads for each well.\nResuspend CD3/CD28 Human T-Activator Dynabeads at 100,000 beads per mL in supplemented T cell media with IL-2.\nTransfer resuspended Dynabeads into a sterile reagent reservoir.\nUsing a multichannel pipette, transfer 50 μL of the Dynabeads to the T cells seeded in the U-bottom 96-well plates.",
    "Note: CD3/CD28 Human T-Activator Dynabeads at 100,000 beads per mL and transferring 50 μL to each well of the U-bottom 96-well plate corresponds to 5,000 beads per well. Since 10,000 T cells were seeded prior to bead addition, this ensures 1 bead to 2 T cells in vitro activation conditions.\nCritical: Prepare and add the T cells and beads in two separate steps. Combining these two steps together will result in uneven distribution of Dynabeads and T cells as the Dynabeads tend to stick to T cells immediately.\nPrepare working stock of drug of choice.\nPrepare 2× working stock solution of drug treatments.\nTransfer drug of choice to a sterile reagent reservoir.\nAdd 100 μL of 2× working stock solution to appropriate wells.\nFor the non-treatment wells, add 100 μL of supplemented T cell media with IL-2 with vehicle control.\nNote: In Loo Yau et al., we expanded T cells with 100 nM and 300 nM decitabine based on previous work published by our group. Thus, 200 nM and 600 nM working stocks were prepared from 10 mM stocks prior to adding to T cells. It is important to note that drug of choice treatments may have apoptotic effects which can impact T cell number at the time of functional read-outs.\nNote: Final volume per well, after sequentially adding CD8+ T cells, beads and drug treatments, should be 200 uL.\nCritical: Initial optimization experiments with these culture conditions should include a dosage titration of concentrations that include nanomolar doses to micromolar doses of drug treatments. It is recommended to test several doses. See Figure 2[href=https://www.wicell.org#fig2] for a recommendation on how to set up the culture plate.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/671-Fig2.jpg\nFigure 2. Recommended 96-well set up to test the effects of range of drug treatments on T cell activation and cytolytic potential",
    "Image made with BioRender.\nNote: Depending on the half-life of the compound in question, supplemented T cell media with IL-2 containing fresh drug may need to be replenished. See Figure 3[href=https://www.wicell.org#fig3] as an example of CD8+ T cell activation in the presence of the pharmacological inhibitor, decitabine.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/671-Fig3.jpg\nFigure 3. Schematic of ex-vivo activation of primary human CD8+ T cells using α-CD3/CD28 beads in the presence or absence of nanomolar concentrations of decitabine (DAC)\nImage made with BioRender. Figure reprinted with permission from Loo Yau et al. (2021)[href=https://www.wicell.org#bib3].\nFunctional assessment of human CD8+ T cells: Measuring cytokine and activation marker expression\nTiming: [8 to 24 h]\nThis section details how to harvest the CD8+ T cells for functional assessment of cytotoxicity markers in CD8+ T cells via flow cytometry.\nGenerally, extracellular expression of CD25, CD69, HLA-DR are upregulated upon T cell activation with α-CD3/CD28 antibodies (Legat et al., 2013[href=https://www.wicell.org#bib2]). The expression of cell surface receptor markers can be assessed immediately after harvesting of the T cells. In addition, intracellular expression of cytokines (e.g., TNF and IFNɣ), as well as cytolytic enzymes (e.g., Granzyme B) are markers to measure cytolytic potential of CD8+ T cells (Seder and Ahmed, 2003[href=https://www.wicell.org#bib5]). To detect intracellular expression of cytokines however, additional re-stimulation protocols are required.\nUsing a multichannel pipette, harvest the CD8+ T cells by pooling each of the respective treatment conditions into conical tubes.\nSpin cells at 200 g for 10 min at room temperature. Discard supernatant.\nNote: The pellet after centrifugation will contain T cells and magnetics beads, which will need to be removed using the DynaMag2 Magnet.\nResuspend pellet in 500 μL of supplemented T cell media with IL-2 and transfer into a 1.5 mL microcentrifuge tube.\nPlace 1.5 mL microcentrifuge tube in the DynaMag2 magnet and leave for 1 min.",
    "Note: The magnetic beads will collect to the side of the microcentrifuge tube, while the T cells will remain in suspension.\nTransfer the suspension cells into a new 1.5 mL microcentrifuge tube or 15 mL conical tube.\nCount the number of cells and the viability with ready-to-use trypan blue (0.4%) solution.\nResuspend T cells at 1×106 cells per mL in T cell media.\nPreparing cells for intracellular staining for flow cytometric analysis\nTiming: ~6 h\nFor intracellular marker staining of functional cytokines TNF and IFNɣ, CD8+ T cells need to be further stimulated with stimulants such as PMA/ionomycin, which are commercially available as optimized cocktail formats. However, intracellular Granzyme B can be detected without additional stimulants.\nNote: Fc receptor blocking solution (e.g., anti-CD16/CD32 antibodies) is recommended to block non-antigen specific binding of antibody before specific antibody staining. However, this step is not necessary as the cells used here are purified CD8+ T cells.\nTransfer 250 μL of media containing 250,000 T cells for each condition to a V-bottom 96-well plate, including controls (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/671-Fig4.jpg\nFigure 4. Recommended 96-well set-up for restimulation to detect functional cytokines TNF and IFNɣ\nCocktail 1: Cell Stimulation plus Protein secretion inhibitor cocktail. Cocktail 2: Protein secretion inhibitor cocktail. Image made with BioRender.\nSeed 2 wells for each treatment condition.\nOne set of cells will receive Cocktail 1: “Cell Stimulation plus Protein secretion inhibitor cocktail” (see “key resources table[href=https://www.wicell.org#key-resources-table]) for detection of functional cytokines TNF and IFNɣ.\nAnother set will receive Cocktail 2: “Protein secretion inhibitor cocktail” (see “key resources table[href=https://www.wicell.org#key-resources-table]) only to detect the expression of cytolytic enzymes Granzyme B.\nControls\nUnstained controls.\nUnstimulated controls for gating controls for TNF and IFNɣ; cells that receive Cocktail 2: ‘Protein secretion inhibitor cocktail’ only.\nFluorophore labeled isotype controls for each cocktail condition.",
    "Spin the plate at 200 g for 2 min to pellet the cells.\nRemove 150 μL of media from each well\nLeave behind 100 μL of media containing the 250,000 T cells seeded at step 40.\nPrepare a working 1:500 working stock of the Cocktail 1 and Cocktail 2, respectively..\nNote: Add 2 μL of Cocktail 1 or Cocktail 2 in 998 μL of T cell media, respectively. Mix well.\nAdd 100 μL of Cocktail 1 or Cocktail 2 working stock to each corresponding well, bringing the final volume to each well to 200 μL, and the final dilution to 1:1000.\nNote: The manufacturer recommends the Cell Stimulation and Protein secretion inhibitor Cocktails at 1:500. However, using these cocktails at 1:1000 final concentrations have yielded consistent results.\nMix well components using a multichannel pipette.\nIncubate at 37°C, 5% CO2 for 4 h.\nNote: After the 4 h incubation of T cells with 1:1000 dilution of Cocktail 1 or 1:1000 dilution of Cocktail 2, proceed to the next sections describing steps for flow cytometry staining for analysis. See Table 2[href=https://www.wicell.org#tbl2] for the recommended flow cytometry staining panel.\ntable:files/protocols_protocol_671_8.csv\nNote: We recommend having a T cell marker in the panel for flow cytometry gating purposes. Some compounds can alter the expression of CD8, whereas CD3 expression is more stable in T cells. In our experience, the flow cytometry panel present here has yielded consistent results and require minimal compensation steps.\nSpin the plate at 200 g for 5 min to pellet the cells and discard supernatant.\nWash cells with PBS, spin the plate at 200 g for 5 min and discard PBS.\nPrepare 1:2000 dilution of cell viability dye in PBS.\nAdd 100 μL of cell viability dye to each well.\nIncubate for 30 min at 4°C, in the dark.",
    "Add 100 μL of cold FACS buffer to each well, spin the plate at 200 g for 5 min to pellet the cells and discard supernatant.\nPrepare 1× Fix Concentrate.\nMix 1 part of True-Nuclear Fix Concentrate with 3 parts of the Fix Diluent.\nAdd 100 μL of 1× Fix Concentrate to each well.\nIncubate for 30 min at 4°C, in the dark.\nPause Point: After cell fixation, the user may stop here and continue the following steps the next day. In this case:\nWash each well with 200 μL of cold FACS buffer twice by spinning the plate at 200 g for 5 min to pellet the cells and discard supernatant.\nResuspend cells with 200 μL of cold FACS buffer and store plate at 4°C in the dark overnight (16–18 h).\nPrepare 1× Perm Buffer.\nMix 1 part of True-Nuclear 10× Perm Buffer with 9 parts of distilled water.\nAdd 100 μL of 1× Perm Buffer to each well.\nNote: Prepare both the 1× Fix Concentrate and 1× Perm Buffer fresh each time when staining cells.\nSpin the plate at 200 g for 5 min to pellet the cells, and discard supernatant.\nAdd 200 μL 1× Perm Buffer to wash the cells.\nSpin the plate at 200 g for 5 min to pellet the cells, and discard supernatant.\nPrepare antibodies for intracellular markers at 1:50 dilution in 1× Perm Buffer. See Table 2[href=https://www.wicell.org#tbl2] for antibody dilution.\nAdd 100 μL of antibodies cocktail diluted in 1× Perm Buffer to each well\nIncubate 4°C for 30 min in the dark\nAdd 100 μL of cold FACS buffer wash to each well, spin the plate at 200 g for 5 min to pellet the cells, and discard supernatant\nRepeat step 64.",
    "Prepare antibodies for CD8 or CD3 surface expression at 1:100 dilution in FACS buffer.\nNote: Typically, cell surface marker stain is performed prior to cell fixation (step 53 in this protocol). However, for the particular panel on Table 2[href=https://www.wicell.org#tbl2], CD3 and CD8 epitopes are not altered after fixation. Thus, we recommend staining for CD3 or CD8 at this step.\nNote: For a list of cell surface markers and epitopes that are not altered by fixation, visit https://www.biolegend.com/en-us/fixation[href=https://www.biolegend.com/en-us/fixation]\nAdd 100 μL of antibodies cocktail to each well.\nIncubate for 30 min at 4°C in the dark.\nAdd 100 μL of FACS buffer wash to each well, spin the plate at 200 g for 5 min to pellet the cells, and discard supernatant.\nRepeat step 69.\nResuspend cells in FACS buffer and transfer to flow cytometry appropriate reading vials.\nPlace on cells in the 4°C in the dark and acquire samples on the flow cytometer within 2 h of staining.\nCritical: Cells should be analyzed as soon as possible following staining. In our hands, tandem dyes like APC-Cy7 will lose intensity overnight (16–18 h) at 4°C\nPreparing cells for cell surface marker staining for flow cytometric analysis\nTiming: ~1 h\nTransfer 250 μL of media containing 250,000 T cells for each condition to a V-bottom 96-well plate, including controls. See Table 3[href=https://www.wicell.org#tbl3] for the recommended flow cytometry staining panel.\ntable:files/protocols_protocol_671_9.csv\nControls\nUnstained controls\nFluorescence minus one (FMO) control (see Table 4[href=https://www.wicell.org#tbl4]).\ntable:files/protocols_protocol_671_10.csv\nFMO controls are the experimental cells stained with all the fluorophores minus one fluorophore.\nAlternatives: Viability Dye Fixable Aqua can be substituted by SYTOX Blue Viability Dye while keeping same fluorochrome panel.",
    "Note: In our experience, the flow cytometry panel presented here has yielded consistent results and requires minimal compensation steps. Include single color compensation controls using compensation beads, as well as unstained control and Fluorescence minus one (FMO) control. Refer to Tung et al., 2007[href=https://www.wicell.org#bib6] and Maecker and Trotter, 2006[href=https://www.wicell.org#bib4] for best flow cytometry practices.\nSpin the plate at 200 g for 5 min to pellet the cells.\nWash cells with 200 μL of FACS buffer in each well, spin the plate at 200 g for 5 min to pellet the cells and discard supernatant.\nPrepare 1:2000 dilution of cell viability dye in PBS.\nAdd 100 μL of diluted cell viability dye to each well.\nIncubate for 30 min at 4°C in the dark.\nAdd 100 μL of FACS buffer to each well, spin the plate at 200 g for 5 min to pellet the cells and discard supernatant.\nPrepare antibodies for cell surface markers at 1:100 dilution in FACS buffer.\nAdd 100 μL of antibodies cocktail to each well.\nIncubate for 30 min at 4°C in the dark.\nAdd 200 μL of FACS buffer wash to each well, spin the plate at 200 g for 5 min to pellet the cells, and discard supernatant.\nRepeat step 83.\nResuspend cells in FACS buffer and transfer to flow cytometry appropriate reading vials.\nPlace on cells in the 4°C, in the dark and acquire samples on the flow cytometer within 2 h of staining.\nCritical: Cells should be analyzed as soon as possible following staining. In our hands, tandem dyes like APC-Cy7 will lose intensity overnight (16–18 h) at 4°C."
  ],
  "subjectAreas": [
    "Molecular/Chemical Probes",
    "Immunology",
    "Cell Isolation",
    "Flow Cytometry",
    "Cell-Based Assays"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}