{
  "id": 8175,
  "origin_website": "Bio",
  "title": "Natural Killer Cell Transfer Assay",
  "procedures": [
    "Treatment of donor mice – mouse model of surgical stress   Donor mice (6-8 weeks of age, each weighing approximately 20 g) were treated with abdominal left nephrectomy (surgical stress) 18 h prior to harvesting spleen NK cells for transfer into recipient mice.   3 C57Bl/6 mice are usually sufficient in order to get 2.0 x 106 NK cells. However, for any in vivo treatment (i.e. in vivo virus infection) that might result in lymphopenia or lymphocyte migration to the periophery, more mice may be needed.    Prepare dissection instruments for harvesting splenocytes.      Harvest donor splenocytes   1 h before starting the harvest, remove Lympholyte from 4 °C. Lympholyte needs to be used at room temperature and protected for light (handle under biosafety cabinet with lights off).   Prepare one 50 ml tube and two 15 ml tubes for each spleen. Place a 70 μM cell strainer on each opened 50 ml tube. Prime each strainer with 1 ml of cold 1x PBS. Add 5 ml of Lympholyte into each 15 ml tube (protect tubes from light).  Note: 1 spleen will need two 15 ml tubes, each containing 5 ml Lympholyte.   Euthanize mice by cervical dislocation, remove spleen and place on 70 μM strainer    Crush 1 spleen on a 70 μM cell strainer over a 50 ml tube, rinse twice with 10 ml of 1x PBS (I often rinse the underside of the filters as well if visible clumps of spleen are observed). Filter again with 10 ml of 1x PBS using the same filter if needed. Spin at 500 x g, 5 min, 4 °C.   Discard supernatant and resuspend splenocyte pellet in 10 ml 1x PBS.",
    "Carefully layer 5 ml of resuspended splenocytes on top of the Lympholyte layer (5 ml of the 1st 15 ml tubes, then the remaining 5 ml on the 2nd 15 ml tube). Spin 1,500 x g, 15 min, room temperature, acceleration at 1, deceleration at 2 (minimal speed).    Carefully pipet lymphocyte layer (blurry interface layer between Lympholyte at the bottom and PBS on top) and transfer to a new 50 ml tube. You can combine mice treatments here (e.g. all the same treatments together).   Fill 50 ml tube with 1x PBS (first wash to remove excess Lympholyte). Spin down 500 x g, 5 min, 4 °C.   Discard supernatant. Resuspend pellet in 10 ml AutoMACS buffer. Spin down as in step B-7. Discard supernant.      NK cell sort (with DX5 microbeads)   Resuspend splenocytes pellet in 300 μl AutoMACS buffer per spleen (we usually pool 3 spleens per tube).   Add 100 μl of DX5 microbeads per spleen (manufacturer recommends 100 μl beads volume for 1 x 108 or less cells) and mix well. Incubate for 15 min at 4 °C.    Add 10 ml of AutoMACS buffer to stop DX5 incubation. Spin as in step B-7.   Discard supernatant. Resuspend pellet in 500 μl AutoMACS buffer per spleen (e.g. 1.5 ml for 3 pool spleens).   Proceed to sort. Turn AutoMACS Pro sorter on during last spin and do a rinse before starting.   Place tubes (input in A, negative fraction in B, positive fraction in C) in rack holder. The size of the tubes used for sort depends on the AutoMACS rack holder used. Usually a standard 50 ml tube for the 3 holder rack, 15 ml tube for 5 holder rack, and 5 ml flow cytometry tubes for 6 holder rack. “Negative fraction” denotes the eluate after the sort, which contains DX5- non-NK cells.",
    "“Positive fraction” denotes the eluate after the sort, which contains DX5+ NK cells.   Select program: Possel with a quick rinse (qrinse) between each tube and rinse after the last tube. Start the sort.   After the sort, count the number of DX5+ cells in the positive fraction tube (2 ml total volume) and determine the cell concentration. Spin down. NK cell purity as determined by flow cytometry (DX5+, TCRb-) is usually > 90%.       NK cell transfer and tumor injection   Resuspend 1.0 x 106 DX5+ NK cells in sterile 1x PBS cells and inject via tail vein injection (100 μl total volume) into NK-deficient mice.   1 h post NK cell injection, 3 x 105 B16lacZ tumor cells resuspended in 100 μl serum free DMEM (greater than 90% viability as determined by trypan blue), inject via tail vein injection (100 μl total volume) into the same NK-deficient mice. Note: For mouse model of surgical stress experiments, recipient NK-deficient mice received NK cells from surgically stressed and untreated control donor mice.   Allow mice to survive for 3 days post tumor cell injection.      B16lacZ lung tumor quantification   3 days post NK and tumor cell injection, euthanize recipient mice and extract all 5 lobes of the lungs.   To extract lungs, expose the thorax by cutting through the skin and subcutaneous layer along the ventral midline of the chest cavity of the mouse. Next, make lateral incisions through skin and tissue on each side up to the neck of the mouse. Then, gently grasp lungs with surgical forceps and gently dissected by snipping away the connective tissue above and below the lungs.   Rinse lungs in Phosphate buffer (pH 7.3).   Place lungs into scintillating vial containing 5 ml ice-cold Phosphate buffer (pH 7.3). Keep on ice until next step.",
    "Pour out Phosphate buffer, being careful not to lose lungs. Fix lungs for 20 min by adding in fixative solution (8 ml/vial).   Wash twice for 10 min in wash buffer solution (8 ml/vial).   Stain with X gal overnight at 37 °C (12-18 h–2 ml/vial).   Wash once with wash buffer (5 ml/vial for 10 min), then add fresh wash buffer (10 ml/vial) and store at 4 °C overnight. Staining will intensify.   Aspirate wash buffer and add 15 ml/vial of 10% buffered Formalin for preservation.    Quantify lung metastases with light microscope.   See Figure 1: Representative lung picture depicting B16lacZ lung metastases at day 3 post tumor cell intravenous injection is shown.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20130818/20130818185554_1934.jpg Figure 1. Representative lung pictures showing B16lacZ lung tumor metastases at day 3 post-tumor cell intravenous injection"
  ],
  "subjectAreas": [
    "Immunology",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}