{
  "id": 10714,
  "origin_website": "Jove",
  "title": "Transmission of Multiple Signals through an Optical Fiber Using Wavefront Shaping",
  "procedures": [
    "1. Assembling the Experimental Setup\nPreparing the proximal side\nPlace and fix the laser providing a collimated light beam – or use a fiber-coupled laser with collimation optics at the exit facet of the fiber.\nPut the polarizing beam splitter (PBS) to split the laser beam into reference and object beam. Turn the orientation of the half wave plates (HWP) by rotating the HWP in its rotation mount until the power of reference beam and object beam (at the distal side) is roughly the same. Check this by putting a screen into both reference and object beam. Choose the orientation of the PBS so that the polarization of the reference beam fits the polarization-sensitive spatial light modulator (SLM).\nPut a beam splitter (BS) into the reference beam to split the reference beam into two beams. Place the optical modulators (OM) such that these two beams coming from BS1 can pass OM1 and OM2, respectively.\nCombine the two beams passing OM1 and OM2 at BS2 employing two mirrors. Adjust the beam splitters and mirrors so that both beams are spatially separated.\nCarefully align BS5 to ensure that the direction of incidence of both beams is perpendicular to the pixel plane of the SLM, ignoring BS3 and BS4 at first. At first, nothing is displayed on the SLM, i.e., it acts like a mirror until the end of the calibration (throughout step 2).\nAdjust the position and the distance between the two lenses (L) constituting a Keplerian telescope in order to get a sharp image of the SLM plane on the complementary metal-oxide semiconductor (CMOS) camera. Watch the correct orientation of L1 and L2 (flat sides are facing each other) to minimize aberrations.\nPreparing the distal side",
    "Use BS7 to split the object beam into two beams and combine them at BS8 employing two mirrors. Again, adjust the beam splitters and mirrors so that both beams are spatially separated.\nDeflect both beams using BS9 to aim them to the microscope objective (OBJ). Focus OBJ2 on the distal end of the multimode fiber (MMF). Check the focus by observing the back reflection from the MMF employing L3 and a charge-coupled device (CCD) camera.\nConnecting proximal and distal side\nCollimate the light from the object beam exiting the MMF employing OBJ1.\nSplit the object beam using BS6, ignore the linear polarizer (LP) at first. Combine both object beams with both reference beams at BS3 and BS4 employing a mirror. Adjust the beam splitters and mirrors so that each pair of reference and object beam overlap at the SLM, intersecting with a small angle (less than 1°).\nEnsure that the power of the reference and the object beam are approximately equal by turning the orientation of the HWP, according to step 1.1.2.\nCheck the interference pattern (off-axis hologram) at the CMOS camera and adjust the intersection angle accordingly. Increase the angle, until the interference fringe spacing roughly equals the size of two pixels on the CMOS camera.\nAdjust the orientation of the LP to match the polarization of object and reference beam in order to get a maximum contrast of the interference pattern in the CMOS camera image, so that the camera image shows distinct fringes.\n2. Calibrating the System\nCalibrating the pixel relation between SLM and CMOS\nIlluminate the whole SLM using only one of the reference beams and block the other reference and objects beams.\nCapture an image of the SLM with the CMOS camera.",
    "Get the coordinates of the upper left corner of the SLM in the CMOS camera image, e.g. using graphics software and the mouse cursor at the PC. Use these pixel coordinates as the point of origin regarding the SLM.\nRemove all beam blocks.\nCalibrating the signal paths\nBlock both reference beam 2 and object beam 2.\nCapture an image of the hologram with the CMOS camera. Evaluate the phase in the recorded hologram using angular spectrum method19. Calculate the inverted phase in the corresponding region of beam 1.\nRemove the former beam blocks and now block both reference beam 1 and object beam 1.\nCapture an image of the hologram with the CMOS camera. Measure the phase in the recorded hologram using angular spectrum method again. Calculate the inverted phase at the corresponding region of beam 2.\nRemove all beam blocks.\n3. Transmitting the Signals\nBlock the object beam.\nStitch the calculated inverted phase images at the corresponding regions of beam 1 and 2 together and display the entire image on the SLM, typically using the computer graphics port.\nStart the modulation of the input signals 1 and 2 by activating OM1 and OM2.\nObserve the output signals 1 and 2 on the CCD camera.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}