{
  "id": 6988,
  "origin_website": "Bio",
  "title": "TetR Regulated <em>in vivo</em> Repression Technology to Identify Conditional Gene Silencing in Genetically Engineerable Bacteria Using <em>Vibrio cholerae</em> Murine Infections as Model System",
  "procedures": [
    "General ProtocolsPCR to amplify fragments for plasmid constructionFor PCR reactions follow the individual manufacturer's protocols. Briefly, the temperature was calculated as follows: 2 °C for every hybridized AT-pair and 4 °C for every GC-pair were added to the melting temperature. The elongation time was calculated after the length of the amplified fragment and the cycle amount was 30. A standard recipe for a PCR reaction to amplify fragments for plasmid construction based on the agents used herein would be:table:\n﻿0,1\nReagents,Volume (µl)\nchromosomal DNA,8\ndNTP’s,5\nPrimer I (1 µg/ml),5\nPrimer II (1 µg/ml),5\nGC enhancer,20\nQ5 Polymerase,3\nQ5 Polymerase buffer,25\nddH2O,32\nPerform PCR reaction.Add appropriate volumes of loading dye to the PCR reaction and separate bands by horizontal gel electrophoresis using a 0.8 to 1% agarose gel and apply approx. 10 V per cm gel.Excise band from the agarose gel and purify respective PCR fragments via the QIAGEN gel extraction kit following the manufacturer's instructions.Colony PCRFor PCR reactions follow the individual manufacturer's protocols. The template for the colony PCR originates from a colony picked form an agar plate using a pipette tip. The selected colony is resuspended in 50 µl ddH2O and boiled at 100 °C for 10 min. A standard recipe for a PCR reaction to amplify fragments for plasmid construction based on the agents used herein would be:table:\n﻿0,1\nReagents,Volume (µl)\nTemplate (boiled colony resuspension),3\ndNTP’s,0.5\nPrimer I (1 µg/ml),0.5\nPrimer II (1 µg/ml),0.5\nThermo Polymerase Buffer,2.5\nTaq Polymerase,0.25\nddH2O,17.75\nPerform PCR reaction.Add appropriate volumes of loading dye to the PCR reaction and separate bands by horizontal gel electrophoresis using a 0.8 to 1% agarose gel and apply approx. 10 V per cm gel.Restriction digestionFor restriction digests follow the individual manufacturer's protocols. Standard recipes for restriction digests based on the agents used herein would be:table:\n﻿0,1\nReagents,Volume (µl)",
    "Plasmid (isolated via a QIAGEN Plasmid Midi Kit; 100 ng/µl),5\nRestriction Enzyme I,1.5\nRestriction Enzyme II,1.5\n10x buffer (appropriate to Enzyme),10\nddH2O,81\nortable:\n﻿0,1\nReagents,Volume (µl)\nPCR Fragment (gel-purified via a QIAGEN gel extraction kit; 100 ng/µl),15\nRestriction Enzyme I,1.5\nRestriction Enzyme II,1.5\n10x buffer (appropriate to enzyme),10\nddH2O,71\nPerform overnight (ON) digestion using the appropriate restriction enzyme combinations and temperatures according to the manufacturer's instructions. In case of the PCR fragments appropriate restriction enzymes herein are indicated by the name of the oligonucleotide (see oligonucleotide lists above).In case of restriction digestion using plasmids, dephosphorylate 5′-ends by adding 1 µl antarctic phosphatase to the mix and incubate for 1 h at 37 °C.Add appropriate volumes of loading dye to the samples and separate the bands by horizontal gel electrophoresis using a 0.8 to 1% agarose gel and apply approx. 10 V per cm gel.Excise band from the agarose gel and purify the linearized, dephosphorylated plasmid from the gel via the QIAGEN gel extraction kit following the manufacturer's instructions.In case of restriction digestion using the PCR fragments, inactivate the enzymes at 65 °C for 10 min.Subsequently purify the digested PCR fragments using the QIAGEN PCR purification kit following the manufacturer's instructions.LigationFor ligations follow the individual manufacturer's protocols. Standard recipes for restriction digestion based on the agents used herein would be:table:\n﻿0,1\nReagents,Volume (µl)\nPlasmid (digested + dephos.; 30 ng/µl),5\nPCR fragment I (digested; 30 ng/µl),5.75\nPCR fragment II (digested; 30 ng/µl),5.75\n10x DNA ligase buffer,1.5\nT4 DNA ligase,1",
    "Perform ligation at room temperature for 1 h.Inactivate the ligase at 65 °C for 10 min.PhoA AssayCultivate strains to late logarithmic growth phase under in vitro test conditions [e.g., herein LB at 37 °C and 180 rpm (supplemented with 2,2'-bipyridyl or FeSO4 in case of the irgA-fusion strains)].Pellet 1 ml of each culture using a microcentrifuge (5 min, 6,000 x g, RT).Wash cells once in P1 buffer (10 mM Tris-HCl, pH 8.0, 10 mM MgSO4) and resuspend the pellet in 1 ml P1 buffer.Dilute 0.1 ml of resuspended cells from Step A5c in 0.9 ml P1 buffer and measure OD600.Add 0.1 ml of resuspended cells from Step A5c into 0.9 ml P2 buffer (1 M Tris-HCl pH 8.0, 0.1 mM ZnCl2). In parallel, prepare a negative control without cells.To each sample add 50 µl of 0.1% SDS and 50 µl of chloroform, vortex and incubate at RT for 10 min to permeabilize cells.To start the enzymatic reaction, add 0.1 ml of 0.4% p-nitrophenyl phosphate (in 1 M Tris-HCl, pH 8.0) to each tube, vortex, and note time.Incubate each tube until a light-yellow color appears, then add 120 µl of 0.1 M EDTA, pH 8.0, 1 M KH2PO4 to stop the reaction and note time.Measure OD420 for each sample, using the negative control sample as a blank.Calculate the duration between start and stop of the reaction.Calculate PhoA activity using the formula stated in the chapter data analysis.Random approach to identify in vivo repressed (ivr) genes of V. cholerae Construction of the TRIVET componentsThe TRIVET system requires construction of several elements partially based on components of the RIVET (Osorio et al., 2005).Construction of the tetR-phoA-cat (tpc) cassette for random integration in the bacterial chromosome via transposon mutagenesis.For optimal PCR results, calculate optimal Tm for all given oligonucleotides.",
    "PCR amplify the promoterless tetR-fragment using chromosomal DNA from E. coli XL-1 and oligonucleotide pairs tetR-5′-BamHI and tetR-3′-Kpnl (see Step A1 for details).PCR amplify the promoterless phoA-fragment using chromosomal DNA from SM10λpir oligonucleotide pairs phoA-5′-KpnI and phoA-3′-XbaI (see Step A1 for details).PCR amplify cat from pA C1000  . The oligonucleotide pairs cat-5′ to XbaI and cat-3′ to BamHI (see Step A1 for details).Gel-purify PCR fragments followed by restriction digestion and second purification (see Steps A1 and A3 for details).Digest (using BamHI), dephosphorylate and gel-purify pTrc99A-Km (see Step A3 for details)Ligate the digested tetR-, phoA- and cat-fragments into a BamHI-digested and dephosphorylated pTrc99A-Km to obtain the pTrc-tpc plasmid (see Step A4 for details).Transform into competent E. coli DH5αλpir cells and select by plating on LB agar supplemented with Kanamycin (Km) and Chloramphenicol (Cm).Incubate plates overnight at 37 °C.Confirm correct pTrc-tpc construct via colony PCR using the oligonucleotide pairs tetR-5′-BamHI and cat-3′-BamHI.Grow verified colonies with correct pTrc-tpc construct in LB-Km/Cm + 2% glucose (Glc), overnight at 37 °C and 180 rpm.Isolate pTrc-tpc using a QIAprep MidiprepKit.PCR amplify the entire tetR-phoA-cat (tpc)-cassette using oligonucleotide pairs tetRphoAcat-5′-NotI and tetRphoAcat-3′-NotI (see Step A1 for details).Gel-purify PCR fragments followed by restriction digestion with NotI and second purification (see Steps A1 and A3 for details).Ligate the purified, NotI-digested tpc-cassette into a NotI-digested, dephosphorylated pLOFKm to obtain pLOF::tpc (see Steps A1, A3 and A4 for details).Transform ligation products into competent E. coli DH5αλpir cells and select by plating on LB agar supplemented with ampicillin (Ap) and Cm.Incubate plates overnight at 37 °C.Confirm correct pLOF::tpc construct via colony PCR using the oligonucleotide pairs tetR-5′-BamHI and cat-3′-BamHI (see Step A2 for details).Grow verified colonies with correct pLOF::tpc construct in LB-Ap/Cm + 2%Glc, overnight at 37 °C and180 rpm.Isolate pLOF::tpc using the QIAprep Spin Miniprep Kit following the manufacturer's instructions.",
    "Transform pRES and pRES1 into competent SM10λpir cells and select by plating on LB agar supplemented with Ap.Incubate plates overnight at 37 °C.Construction of the pTRIVET and pTRIVET1 plasmidsPCR amplify the lacZ-fragment from V. cholerae WT chromosomal DNA using oligonucleotide pairs lacZ-5′-SacI and lacZ-3′-NheI.PCR amplify tnpR-fragment from pGOA1193 using oligonucleotide pairs tnpR-5′-BgIII and tnpR-3′-XbaI.Gel-purify PCR fragments followed by restriction digestion and second purification (see Steps A1 and A3 for details).Mix oligonucleotide pairs PtetA-5′-3′ and PtetA-3′-5′ or Ptet1-5′-3′ and Ptet1-3′-5′, boil oligonucleotide mix for 5 min to ensure denaturation and cool at RT. This will allow hybridization of the oligonucleotide pairs with a compatible NheI- and BglII-site on each end. The generated dsDNA sequence comprises the original tetA promoter sequence ptet (in case of PtetA-5′-3′ and PtetA-3′-5′) or for a less stringent transcriptional regulation a slightly altered tetA promoter sequence ptet1 with mutated TetR-binding sites (in case of Ptet1-5′-3′ and Ptet1-3′-5′).Ligate the digested lacZ-fragment, the digested tnpR-fragment and one of the two tetA promoter sequence versions (ptet or ptet1, obtained via Step B1bviii) into a SacI/XbaI-digested, dephosphorylated pGP704 resulting in either pTRIVET containing the promoter ptet or pTRIVET1 containing the promoter ptet1, respectively (see Step A4 for details).Transform ligation products into competent DH5αλpir cells and select by plating on LB agar supplemented with Ap.Incubate plates overnight at 37 °C.Confirm correct pTRIVET or pTRIVET1 constructs via colony PCR using the oligonucleotide pairs lacZ-3′-SacI and tnpR-3′-XbaI as well as restriction analyses.Grow verified colonies with correct pTRIVET or PTRIVET1 in LB-Ap + 2% Glc overnight at 37 °C and 180 rpm.Isolate the pTRIVET and pTRIVET1 plasmids via the QIAprep Spin Miniprep Kit by following the manufacturer’s protocol.Transform pTRIVET and pTRIVET1 into competent SM10λpir cells and select by plating on LB agar supplemented with Ap.Incubate plates overnight at 37 °C.",
    "Construction of the pRes and pRes1 according to Osorio et al. (2005)PCR amplify the res sequence via PCR using pRR51 as a template and oligonucleotide pairs1RES-F and 1RES-R (see Step A1 for details). Alternatively, PCR amplify the res1 sequences via PCR using pSL134 and oligonucleotide pairs1RES1-F and 1RES1-R (see Step A1 for details).Gel-purify PCR fragments followed by restriction digestion (using EcoRI and XhoI) and second purification (see Steps A1 and A3 for details).Ligate the digested PCR fragments into an EcoRI/XhoI-digested, dephosphorylated pPCR-Script Amp SK(+) (Stratagene) to generate plasmids pGOA2 and pGOA3 (see Step A4 for details).Use a 2nd set of oligonucleotide pairs (2RESF and 2RESR or 2RES1F and 2RESR) to PCR amplify a second copy of res or res1. Subclone them immediately next to their counterparts in pGOA2 and pGOA3 to generate plasmids pGOA4 and pGOA5, which harbor two res or res1 sequences, respectively.Generate pGOA6 and pGOA7 via subcloning of the sacB-neo genes from pGOA1 into XbaI-digested pGOA4 and pGOA5.Amplify the res- and res1-cassettes via PCR from pGOA6 and pGOA7 using oligonucleotide pairs T3 and T7 and ligate them into KpnI-digested pSL111 treated with T4 DNA polymerase to generate pRES and pRES1.Transform ligation products into competent DH5αλpir cells and select by plating on LB agar supplemented with Ap.Incubate plates overnight at 37 °C.Confirm correct pRES and pRES1 constructs via restriction analyses and sequencing.Isolate the pRES and pRES1 plasmids via the QIAprep Spin Miniprep Kit by following the manufacturer’s protocol.Transform pRES and pRES1 into competent SM10λpir cells and select by plating on LB agar supplemented with Ap.Incubate plates overnight at 37 °C.Construction of the TRIVET libraryInsertion of the res-cassetteMobilize suicide plasmids pRES and pRES1 into V. cholerae WT by conjugation and allelic exchange to place each cassette into the lacZ-locus to obtain Vc_res and Vc_res1 as described below.",
    "Mobilize suicide plasmids pRES or pRES1 into V. cholerae by conjugation of E. coli SM10λpir pRES or pRES1 obtained by Step B1c with V. cholerae WT [(streptomycin-resistant (SmR)]. This was performed by cross-streaking sufficient cell material of both strains on the same LB agar plate and incubating plate for 6 h at 37 °C. Via homologous regions present on pRES or pRES1 an allelic exchange of the suicide plasmids and the lacZ-locus on the V. cholerae chromosome is possible at low frequency via homologous regions present on pRES or pRES1.V. cholerae with integrated pRES and pRES1 are then selected by streaking the single colonies form the conjugation mixtures on LB-Sm/Ap/Km agar plates.Incubate plates overnight at 37 °C.Streak-purify colonies on LB-Sm/Ap/Km agar plates at least twice.Grow purified colonies in LB-Sm/Km overnight at 37 °C, 180 rpm and plate appropriate dilutions on LB-Sm/Km plates supplemented with 5-Bromo-4-chloro-3-indolyl beta-D-galactopyranoside (40 µg/ml dissolved in DMSO, X-Gal).Incubate plates overnight at 37 °C.White colonies are potential candidates for double recombination events and allelic exchange of the lacZ-locus with the res- or res1-cassette.Confirm loss of suicide vector backbone by streaking on LB-Sm/Km (growth) and LB-Ap (no growth).Incubate plates overnight at 37 °C and proceed with SmR/KmR, but ApS colonies.Validate correct insertion of the res or res1-cassette in the lacZ-locus via colony PCR and/or sequencing resulting in strains Vc_res and Vc_res1.Transposon mutagenesis in Vc_res and Vc_res1.Transposon mutagenesis is achieved by mobilization of the pLOF::tpc transposon plasmid into V. cholerae via conjugation as described below. Along the incubation period, transfer of plasmid results in spontaneous transposition events in V. cholerae.Mobilize suicide vector pLOF::tpc into V. cholerae by conjugation of E. coli SM10λpir pLOF::tpc obtained from Step B1a with either Vc_res and Vc_res1 obtained from Step B2a via filter mating on LB agar plates.",
    "To do so, grow strains to an OD600 of approx. 1 and mix recipient and donor in a 2:1 ratio with a final volume of 2 ml.Pellet mixture by centrifugation (5,000 x g, 5 min, RT) and gently resuspend cells in 100 µl LB broth.Place bacterial suspension in the center of a LB plate and incubate plate for 1.5 h at 37 °C to allow conjugation.Pick up the bacteria of the plate using a pipet tip and resuspend them in 1 ml LB broth.Select for transposon mutants by plating appropriate dilutions of the resuspended conjugation mixture to reach approximately 50-200 colonies per LB-Sm/Km/Cm plate.Incubate plates overnight at 37 °C.Purify colonies by streaking on LB-Sm/Km/Cm agar plates and in parallel on LB-Ap agar plates. After overnight incubation at 37 °C, pursue only with LB-Sm/Km/Cm-resistant, but Ap-sensitive colonies representing bona fide transposon mutants (loss of pLOF backbone).Pool ~500 bona fide colonies to generate heterogeneity by adding 1-2 ml of LB on top of the plate and rinsing multiple times over the colonies.Repeat Steps B2bi to B2bvi about 20 times for Vc_res as well as Vc_res1 to obtain several independent transposon pools for Vc_res or Vc_res1, respectively.Integration of pTRIVET and pTRIVET1Mobilize suicide plasmids pTRIVET or pTRIVET1 into V. cholerae transposon pools obtained by Step B2b to insert the TRIVET or pTRIVET1 via homologous recombination downstream of the lacZ-locus as described below.To do so, cross-streak sufficient cell material of E. coli SM10λpir pTRIVET or E. coli SM10λpir pTRIVET1 obtained from Step B1b with V. cholerae transposon pools obtained by Step B2b (see Step B2aii for details).Resuspend conjugation mixture in 1 ml LB broth and select for insertion of the pTRIVET or pTRIVET by plating appropriate dilutions of the resuspended conjugation mixture on LB-Sm/Km/Ap plates.Incubate plates overnight at 37 °C.",
    "Pool ~2,000 colonies to maintain heterogeneity by adding 1-2 ml of LB on top of the plate and rinsing multiple times over the colonies. These pools represent the final TRIVET-pools.Identification of ivr genesPrescreen for elimination of fusion strains with high resolution frequency due to low TetR expression.Let each TRIVET-pool grow to late log phase in LB-Sm/Ap broth without Km as a selection marker for maintenance of the res or res1-cassette. This allows resolution of the fusion strains with insufficient TetR-expression to silence tnpR.Plate serial dilutions on LB-Sm/Km/Ap plates and incubate overnight at 37 °C to select for non-resolved strains in the TRIVET pool (res- or res1 cassette is stably maintained under in vitro conditions).Pool ~1,000-2,000 colonies to maintain heterogeneity by adding 1-2 ml of LB on top of the plate and rinsing multiple times over the colonies. (Optional: To confirm heterogeneity, detect restriction fragment length polymorphism of the tpc-fusion loci from 50 randomly picked colonies using Southern blot analysis.)Screening for ivr genes of V. cholerae using the infant mouse model (in vivo).Spread an aliquot of each pool of the library in triplicate on LB-Sm/Km/Ap plates and incubate overnight at 37 °C.Collect ~5,000 colonies from each plate and dilute in LB to a concentration of ~106 cfu/ml.Use 50 µl of the bacterial suspension to intragastrically inoculate 5-d-old CD-1 mice (anesthetized by isoflurane).Euthanize mice 22 h post infection by cervical dislocation, remove small intestine and homogenize in 1 ml LB media containing 20% Glycerol using a tissue homogenizer at medium power for 30 s while moving up and down.Plate serial dilutions of the homogenate on sucrose agar to select for loss of sacB (selection for in vivo resolved strains now lacking the res or res1 cassette).Incubate up to 48 h at RT.",
    "Confirm resolution (loss of res or res1 cassette by streaking in parallel on LB-Sm/Ap (growth) and LB-Km (no growth).Incubate plates overnight at 37 °C and proceed to identify the tpc-cassette insertion site according to Step B3d with Sm/Km-resistant, but Km-sensitive colonies.PhoA assays as refinement step of in vivo resolved strainsBased on previous studies using the resolution technology, the in vivo screen has a substantial false positive rate of spontaneous resolution due to low in vitro expression levels of TetR in some strains of the TRIVET library. The implementation of phoA as a second reporter enables confirmation of substantial expression levels during in vitro growth for each of the in vivo resolved strains identified in Step B3b. We highly recommend this refinement step to eliminate false positives.To reduce the relatively high false positive rate of resolvase based screens of approximately 15% a spontaneous in vitro resolution frequency has to be defined as a cut-off. Reanalysis of the combined data acquired by previous resolvase-based screens (Osorio et al., 2005; Schild et al., 2007; Seper et al., 2014) reveal that strains with in vitro resolution frequencies below 30% have only a 5% chance to be false positive. As the tpc cassette remains stably integrated in the chromosome PhoA activity of in vivo resolved strains can be measured under in vitro conditions and correlate the obtained activity to a resolution frequency. According to the results obtained for the irgA-fusion test strain, an in vitro resolution frequency of 30% or lower correlates with PhoA activities of 10 Miller units or higher. Thus, we used this cut-off in the original study describing TRIVET (Cakar et al., 2018).Identify a promoter, which is differentially regulated under controllable in vitro cultivation conditions. Herein, we use the iron-regulated irgA promoter of the V.",
    "cholerae, which is highly expressed at low iron levels and repressed at high concentrations of iron. Differential iron availability in vitro can be mimicked in LB by adding varying amounts of the iron chelator 2,2'-bipyridyl or FeSO4.Construct a V. cholerae TRIVET reporter strain Vc_res_TRIVETirgA::tpc with a specific transcriptional fusion of the tpc-cassette to the iron-regulated irgA promoter (see Step C1 for details).Assess in parallel the resolution frequency and PhoA activity of the Vc_res_TRIVETirgA::tpc reporter after growth for 8 h in LB supplemented with varying amounts of iron chelators such as 2,2'-bipyridyl or FeSO4 (see Steps C2 and C3 for details). We recommend to test a range of 0 to 150 µM final concentrations in 50 µM increments for both agents.Correlate PhoA activity and resolution frequency of the Vc_res_TRIVETirgA::tpc strain grown in LB with different iron-availability. Choose the growth condition closest to the cut-off (less than 30% resolution frequency) and use the associated PhoA activity as refinement criterion (in our case 10 Miller Units).Cultivate in vivo resolved strains in LB for 8 h at 37 °C and 180 rpm.Perform PhoA assay as described above (see Step A5 for details).Proceed only with in vivo resolved strains showing PhoA Activities equal or higher than the refinement criterion (determined above).Identification of tpc fusion by subcloning and sequencingIsolate chromosomal DNA from overnight cultures of the in vivo resolved strains of interest.Digest chromosomal DNA with EcoRI and use the digested chromosomal DNA for ligation with an EcoRI-digested, dephosphorylated pBR322 plasmid (see Steps A3 and A4 for details).Transform ligation product into E. coli DH5αλpir and plate on LB-Cm plates to select for the cat-gene of the tpc-cassette including downstream chromosomal DNA of the tpc-fusion site.Isolate plasmids of CmR-colonies using a QIAprep Spin Miniprep Kit.Sequence with oligonucleotide seqPrimer-cat to obtain downstream sequence tpc-fusion site.",
    "BLAST sequence against the V. cholerae N16961 genome database using blastN to identify insertion site of the tpc-cassette.Resolution assays to measure gene silencingConstruction of suicide plasmids for transcriptional fusions of the tpc cassette to specific promoters, exemplified by an irgA-tpc or yrb-tpc fusion.Construction of suicide plasmids.In case of the irgA-tpc fusion, PCR amplify the tpc-cassette using the oligonucleotide pair tetRphoAcat-5′-SacI and tetRphoAcat-3′-SalI as well as pTRc-tpc as template (see Step A1 for details).PCR amplify 800 bp fragments located upstream and downstream of the irgA-insertion site (irgA promoter) using the oligonucleotide pairs irgA-SphI-1 and irgA-SacI-2 as well as irgA-SalI-3 and irgA-XbaI-4 (see Step A1 for details).In case of the yrb-tpc fusion, PCR amplify the tpc-cassette using the oligonucleotide pair tetRphoAcat-5′-SacI and tetRphoAcat-3′-SalI as well as pTRc-tpc as template (see Step A1 for details).PCR amplify 800 bp fragments located upstream and downstream of the yrb-insertion site (yrb promoter) of the tpc-cassette using the oligonucleotide pairs, yrb_SacI_1 and yrb_SphI_2 as well as yrb_SalI_3 and yrb_XbaI_4.Gel-purify PCR fragments followed by restriction digestion and second purification (see Steps A1 and A3 for details).In case of the irgA-tpc fusion, ligate the digested tpc-cassette as well as the up- and downstream fragments (see Steps C1ai and ii) into an SphI/XbaI-digested, dephosphorylated pCVD442.In case of the yrb-tpc fusion, ligate the digested tpc-cassette as well as the up- and downstream fragments (see Steps C1aii and iv) into an SphI/XbaI-digested, dephosphorylated pCVD442.Transform ligation products into competent DH5αλpir cells and select by plating on LB agar supplemented with Ap.Incubate plates overnight at 37 °CConfirm correct pCVD442irgA::tpc or pCVD442yrb::tpc constructs via colony PCR using the oligonucleotide pairs irgA-SphI-1 and irgA-XbaI-4 or yrb_SphI_2 and yrb_XbaI_4 , respectively.Grow verified colonies with correct pCVD442irgA::tpc or pCVD442yrb::tpc in LB-Ap overnight at 37 °C and 180 rpm.",
    "Isolate the pCVD442irgA::tpc or pCVD442yrb::tpc plasmid via the QIAprep Spin Miniprep Kit by following the manufacturer’s protocol.Transform pCVD442irgA::tpc or pCVD442yrb::tpc into competent SM10λpir cells and select by plating on LB agar supplemented with Ap.Incubate plates overnight at 37 °C.Construction of TRIVET strains harboring a specific tpc-fusion to a gene of interest.To obtain Vc irgA::tpc and Vc yrb::tpc, mobilize suicide plasmids pCVD442irgA::tpc or pCVD442yrb::tpc into V. cholerae by conjugation and allelic exchange to place the tpc-cassette downstream of the respective promoter.Mobilize suicide plasmids pCVD442irgA::tpc or pCVD442yrb::tpc into V. cholerae by conjugation of E. coli SM10λpir pCVD442irgA::tpc or pCVD442yrb::tpc obtained by Step C1a with V. cholerae WT [(streptomycin-resistant (SmR)]. To do so, cross-streak sufficient cell material of both strains on the same LB agar plate and incubate plate for 6 h at 37 °C. Via homologous regions present on pCVD442irgA::tpc or pCVD442yrb::tpc an allelic exchange of the suicide plasmids and the respective locus on the V. cholerae chromosome at low frequency is possible.Streaking of single colonies form the conjugation mixtures on LB-Sm/Ap agar plates selects for V. cholerae with integrated pCVD442irgA::tpc or pCVD442yrb::tpc. Incubate plates overnight at 37 °C.Streak-purify colonies on LB-Sm/Ap agar plates at least twice.Grow purified colonies in LB-Sm overnight at 37 °C, 180 rpm and plate appropriate dilutions on sucrose agar.Incubate plates for up to 48 h at RT.Confirm loss of suicide vector backbone by streaking on LB-Sm (growth) and LB-Ap (no growth)Incubate plates overnight at 37 °C, proceed with SmR, but ApS colonies.Validate correct insertion of the tpc-cassette via colony PCR and/or sequencing resulting in Vc irgA::tpc and Vc yrb::tpc.Insert res- or res1-cassette into Vc irgA::tpc or Vc yrb::tpc to obtain Vc_res irgA::tpc, Vc_res1 irgA::tpc, Vc_res yrb::tpc or Vc_res1 yrb::tpc as described above (see Step B2a for details).",
    "Integrate pTRIVET or pTRIVET1 into Vc_res irgA::tpc, Vc_res1 irgA::tpc, Vc_res yrb::tpc or Vc_res1 yrb::tpc to obtain Vc_res_TRIVET irgA::tpc, Vc_res1_TRIVET irgA::tpc, Vc_res_TRIVET yrb::tpc or Vc_res1_TRIVET yrb::tpc as well as Vc_res_TRIVET1 irgA::tpc, Vc_res1_TRIVET1 irgA::tpc, Vc_res_TRIVET1 yrb::tpc or Vc_res1_TRIVET1 yrb::tpc as described above (see Step B2c for details).Quantification of gene silencingIn vivo and in vitro resolution assay usingGrow TRIVET strain with a transcriptional fusion of the tpc-cassette to the promoter of interest [e.g., Vc_res1_TRIVET yrb::tpc as used in Cakar et al. (2018)] on LB- Sm/Km/Ap plates; overnight at 37 °C.Harvest bacterial cells from plate and resuspend them in LB-Sm/Km/Ap.Measure OD600 and adjust OD600 to 1 using appropriate dilutions to generate the inoculum.To assess the in vivo resolution, infect 5-d-old CD-1 mice (anesthetized by isoflurane) with 50 µl of the inoculum (∼106 cfu). At a post infection time point of interest [e.g., 6 and 22 h as used in Zingl et al. (2020)] euthanize mice by cervical dislocation, remove small intestine and homogenize in 1 ml LB media containing 20% Glycerol. Plate appropriate serial dilutions of the homogenate on LB-Sm/Km and LB-Sm/Ap plates and incubate overnight at 37 °C.To assess the in vitro resolution, inoculate 5 ml of LB-Sm/Ap with 50 µl of the inoculum and incubate parallel to the mouse infection at 37 °C and 180 rpm. Plate appropriate serial dilutions of the homogenate on LB-Sm/Km and LB-Sm/Ap plates and incubate overnight at 37 °C.Assess the amount of single colonies on plates and calculate the Sm/Km-resistant and Sm/Ap-resistant cfu in the original sample.Calculate resolution (%) for in vivo and in vitro formulas described in the chapter data analysis.In vitro PhoA Assays as alternative quantification of transcriptional activity.Grow the strains using cultivation conditions of interest.Perform PhoA assay as described above (see Step A5 for details)."
  ],
  "subjectAreas": [
    "Microbiology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}