{
  "id": 11560,
  "origin_website": "Jove",
  "title": "Virtual Reality Experiments with Physiological Measures",
  "procedures": [
    "The following protocol was conducted in accordance with guidelines approved by the Ethics Commission of ETH Zürich as part of the proposal EK 2013-N-73.\n1. Recruit and Prepare Participants\nSelect participants with particular demographics (e.g., age, gender, educational background) using a participant recruitment system or mailing list (e.g., UAST; http://www.uast.uzh.ch/).\nContact selected participants by e-mail. In this e-mail, remind the participants of the session time and requirements. Let the participants know that they must wear a loose-fitting top (for blood pressure monitoring), refrain from alcohol for 12 h before the experiment, and refrain from several other activities (i.e., caffeine, smoking, eating, and exercise) for 3 h before the experiment.\n2. Prepare the Experiment and Physiological Devices Using EVE\nBefore each experimental session, start the computer, the experimenter monitor, and the testing monitor.\nEnsure that the room fan, the thermometer and the humidity monitor are on.\nSwitch on the machine measuring the electrodermal activity (EDA) and the electrocardiography (ECG; e.g., PowerLab from ADInstruments). See Table of Materials.\nOpen the EDA/ECG software (EVE currently supports Labchart from ADInstruments) and create a new settings file. Select a sampling rate of 1,000 Hz and the appropriate number of channels (e.g., one for EDA and one for ECG). Save this settings file and re-save a version with a different name for each experimental session.\nFor the EDA electrodes, perform an open-circuit zero (i.e., without the electrodes attached to anything) to obtain a baseline measure of system conductivity.\nEnsure that the control interface (e.g., joystick) is connected to the computer.\nOn the experimenter monitor, open the executable Unity file for the experiment.\nOpen the \"Experiment Settings\" menu in EVE, and enter the experiment parameters (e.g., participant ID number, physiological measurement file, experimental condition, room temperature and humidity).\nClick \"Start Experiment\".\n3. Experimental Procedure",
    "Introduction and consent procedure\nPick up the participant at the agreed meeting location and guide him/her to the laboratory.\nIndicate that the session will take approximately 90 min and ask the participant to store his or her watch and/or mobile phone.\nAsk the participant to sit in the experimental chair and explain the experimental procedure according to the prepared verbal script.\nAsk the participant to read the information sheet and sign the informed consent form.\nConnection of EDA and ECG sensors\nClean the index finger and the ring finger of the non-dominant hand with a wet tissue without soap. Ensure that they are dry and connect the two EDA electrodes to the medial phalanges.\nClean the skin on the chest where the ECG electrodes will be placed with a wet cloth.\nPlace the white, black, and red electrodes on the participant's body between the ribs according to Figure 2. Place the white electrode on the upper right abdomen (UR), and the black electrode on the upper left abdomen (UL). Place the red electrode on the lower left abdomen (LL). Ensure that the three electrodes are not directly over a rib.\nConnect the three color-coded ECG wires to the corresponding electrodes attached to the participant's body.\nPre-experiment questionnaires\nProvide the participant with a keyboard and a mouse that will be used to answer the questionnaires (e.g., demographic questions, the first part of the Short Stress State Questionnaire, the Santa Barbara Sense of Direction Scale), and inform him or her that they will be asked a series of questions on the computer.\nInform the participants that they can ask the experimenter questions regarding the questionnaires at any time.\nClose the two side walls of the cubicle while the participant is completing the questionnaires.",
    "Preparations for physiological measurement. These steps can be conducted while the participant is completing the questionnaires.\nInform the participant that the experimenter will now prepare the physiological devices.\nCheck that the electrodes are attached to the correct locations.\nAttach the blood pressure cuff to the non-dominant arm.\nProvide instructions to the participant regarding the accurate measurement of blood pressure. Tell the participant to minimize arm and body movements, keep the blood pressure cuff at heart level, and maintain an upright posture with his or her feet flat on the floor.\nConnect the two EDA wires to the electrodes on the fingers.\nTurn off the light above the monitor and dim all other overhead lights to the lowest setting.\nHand the joystick to the participant and ensure that the mouse is off the screen of the testing monitor.\nZero the EDA channel in order to obtain a measure of an individual's starting level of skin conductance.\nIn the EDA/ECG software, open the \"Bio Amp\" dialog box. Choose the signal range in which the heart beat signal covers around one third of the preview window (5 mV in most cases).\nStart recording with the EDA/ECG software, and check whether a signal is visible in the EDA/ECG software window on the experimenter monitor.\nStart blood pressure recording by pressing the appropriate button in the blood pressure machine.\nSwitch to the open Unity program, and press \"Start Measurements\". A fixation cross should appear.\nJoystick training and baseline video\nAsk the participant to watch and follow the training video that instructs him or her how to use the joystick.\nAsk the participants to complete the training maze in order to practice using the joystick. In this training maze, participants are instructed to follow the arrows that indicate a route and collect floating gems.",
    "If the experiment includes sound, place the headphones on the participant's head.\nAsk the participant to watch the baseline nature video without moving. This video is used to account for a baseline measurement of the participant's physiological data during the subsequent analysis.\nNavigation task\nEnsure that the participants have read the instructions regarding the to-be-completed navigation task. Inquire as to whether the participant has any questions before the navigation task begins. Tell the participant that they should not ask questions during the navigation task.\nAsk the participant to press the trigger on the joystick when he or she is ready to begin the navigation task.\nFinal physiological measures and detachment of physiological sensors\nWait until the system has completed the final blood pressure measurement.\nStop recording EDA and ECG by pressing the stop button in the EDA/ECG software.\nRemove the blood pressure cuff.\nRemove the EDA electrodes from the participant.\nAsk the participants not to remove the ECG electrodes until the end of the experiment.\nRemove the joystick and headphones.\nPost-experiment questionnaires\nProvide the participant with a keyboard and a mouse for the post-experiment questionnaires (e.g., the second part of the Short Stress State Questionnaire, the Self-Assessment Manikin, the Simulator Sickness Questionnaire).\nInform the participants that they will be asked another series of questions on the computer and that he or she can ask questions if necessary.\nEnd of the experimental session\nInform the participant that the experimental part is now finished. Thank her or him for participating in the experiment.\nTell the participant that he/she can now remove the ECG electrodes.\nPay out the participants and ask them to sign the printed receipt.\nAsk if the participant has any questions regarding the purpose of the experiment, and escort him or her outside of the experimental room.",
    "4. After Each Experimental Session\nOpen the \"Evaluation\" menu in EVE in order to conduct experiment diagnostics (e.g., replay trajectories), and save the physiological measurement files in the EDA/ECG software.\nIn the \"Evaluation\" menu in EVE, press the \"Add Event Marker\" button to mark events in the physiological measurement files. This step is critical for the analysis of the physiological data in terms of particular experimental phases.\nSave the EDA/ECG file in the physiological measurement file in the EDA/ECG software.\nExport the experimental data for backup using the evertools package.\nSwitch off the EDA/ECG machine and clean the EDA electrodes with alcohol pads.\nMark that the participant showed up in the participant recruitment system.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}