{
  "id": 11819,
  "origin_website": "Jove",
  "title": "Surgical Technique for Superior Cervical Ganglionectomy in a Murine Model",
  "procedures": [
    "The animal procedures described here were approved by the Institutional Animal Care and Use Committee at the Memorial Sloan Kettering Cancer Center. Eight-week-old male and female NSG mice were used here. The animals were obtained from a commercial source (see Table of Materials). The instruments are sterilized, the surgical working surface is disinfected, the animal's skin surface is disinfected, and the surgeon wears sterile gloves throughout the procedure.\n1. Preparation of the mice and preoperative setup\nOn the day before surgery, anesthetize the mouse with 2% isoflurane in an induction chamber (3.75 in width x 9 in depth x 3.75 in height, see Table of Materials).\n\t​NOTE: A surgical plane of anesthesia is usually achieved in 3-5 min, depending on the individual animal. Assess the adequacy of anesthesia by toe pinch, and increase the isoflurane percentage as appropriate.\n\t\nShave the ventral aspect of the neck or use a chemical hair removal agent according to the manufacturer's instructions (see Table of Materials).\nOn the day of the surgery, anesthetize the mouse with 2% isoflurane in an induction chamber. Assess the adequacy of anesthesia by toe pinch, and increase the isoflurane percentage as appropriate.\nAdminister 2 mg/kg of meloxicam subcutaneously for preemptive systemic analgesia. Apply topical ophthalmic ointment (see Table of Materials) to prevent ocular injuries and dryness under anesthesia.\nPlace the mouse under a dissecting microscope on its dorsal side and provide thermal support. Maintain inhalational anesthesia with 2%-2.5% isoflurane using a precision vaporizer and nose cone. Gently secure both forelimbs with hypoallergenic tape (see Table of Materials).\nClean the shaved, ventral aspect of the neck with povidone-iodine, and then wipe with 70% alcohol. Repeat this process two more times. Ensure that the surgical site is free from any loose hair.",
    "NOTE: A pair of short curved forceps may also be used. Ensure to use a pair of fine or ophthalmic forceps to adequately work in this confined space. Additional pre-operative setup can be included as per the institutional guidelines. \n2. Dissection\nMake a 1.5 cm midline skin incision on the ventral aspect of the neck using small scissors from approximately 2 mm below the chin to 2 mm above the sternal notch.\nRetract the edges of the skin laterally with forceps to expose the underlying fascia and submandibular salivary glands. Separate the skin from the underlying fascia by inserting pointed scissors under the skin on each side and spreading. Pull down the submandibular glands caudally with forceps to reveal the underlying muscles.\nLocate the junction of the posterior belly of the digastric muscle and omohyoid muscle (Figure 1A, black circle). The anterior jugular vein is seen running longitudinally and lateral to the omohyoid muscle.\n\tNOTE: The omohyoid muscle covers the trachea longitudinally, while the digastric muscle lies transversely at the cranial aspect of the trachea (Figure 1C).\n\t\nInsert the tip of 45° angled forceps at this junction, lateral to the anterior jugular vein, to pierce and spread an opening in the overlying deep cervical fascia.\nKeep this window created in step 2.3.1 open with the 45° angled forceps. Expand this opening wider by performing spreading maneuvers with a pair of curved forceps in the other hand.\n3. Identification and resection of the ganglion\nLocate the superior cervical ganglion (SCG) on the lateral wall of the revealed space. It appears as a round, pearly tissue.",
    "NOTE: If the SCG is not identified, the tissues in this space need to be examined more laterally and superiorly. The SCG may be easily confused with fat, which is often present in this region. Fat has a slightly yellow tinge, while in contrast, the SCG appears pearl white.\nWhile maintaining the opening with forceps with the other hand, gently grasp the SCG with forceps, and pull it out of the opening to bring it into better view.\nOnce the SCG is in view, grasp the lateral base of the SCG, where it is still attached to the surrounding tissues. Using the other hand, slowly and gently retract the SCG in a ventral and caudal direction.\n\t\nRetract the SCG multiple times to gradually avulse the ganglion little by little. Keep the ganglion intact during this maneuver to ensure no residual ganglion remnants are left behind.\n\t\tNOTE: Pull the ganglion gently, as bleeding may occur during this step. If minor bleeding occurs, use oxidized regenerated cellulose or a small strip of sterile gauze to hold pressure over the opening for 30 s to 1 min. Then, slowly lift the gauze and reassess. Repeat the process of holding pressure over the opening as necessary until the bleeding has stopped.\nSlowly release the other forceps holding the base of the ganglion. Check for bleeding by looking for blood pooling.\n\tNOTE: Slight oozing at this time is normal. Monitor and ensure there is no persistent or significant bleeding before closing and finishing the procedure. If this occurs, hold pressure over the opening, as described in step 3.3.1.\nMove the salivary glands back into their normal anatomic positions. Approximate and close the skin using simple interrupted 5-0 nylon sutures (see Table of Materials).",
    "Place the mouse in a clean cage by itself to allow for full recovery from the anesthesia.\n\tNOTE: It may take 5-15 min for the mouse to awaken fully from the anesthesia. Do not leave the mouse unattended until it has regained sufficient consciousness to maintain sternal recumbency. Do not place the mouse in a cage with other mice until it has fully recovered. Assess the mouse for postsurgical recovery at least once every 24 h for 72 h.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}