{
  "id": 17963,
  "origin_website": "Jove",
  "title": "Ablation of Ischemic Ventricular Tachycardia Using a Multipolar Catheter and 3-dimensional Mapping System for High-density Electro-anatomical Reconstruction",
  "procedures": [
    "The following protocol complies with the guidelines of the human research ethics committee of the department for internal medicine/cardiology of the Hietzing Hospital in Vienna.\n1. Preliminary Measures\nAdminister the patient for whom VT ablation is planned at the ward at least 2 days prior to the procedure.\nAcquire blood sampling, X-ray of the chest and transthoracic echo-cardiography. In case of known atrial fibrillation (persistent or paroxysmal), perform a transesophageal echocardiography one day prior to the procedure.\nOn the day of VT ablation, discontinue oral anticoagulants (in case the patient takes some for atrial fibrillation or other co-morbidities requiring the use of oral anticoagulants) and administer i.v. antibiotics.\n2. Patient Preparation During the Procedure\nApply self-adhesive ECG electrodes for 12-lead ECG (on the front chest - see Supplementary Figure 1 - and extremities in a standard position) as well as surface patches, neutral electrode and a system reference electrode compatible with the designated 3D mapping system (see Table of Materials) and a neutral electrode for the ablation catheter in a standard position to the patient´s skin (see also Supplementary Figure 2).\nApply self-adhesive defibrillator patches to the patient´s skin in the advised position (below the right clavicle and at the left ventricular apex) and switch on the defibrillator.\nDeactivate the tachycardia therapies of the ICD with the appropriate programmer, optionally deactivate all device functions that might interfere with the ablation current.\nNOTE: Tachycardia therapies of the ICD will stay deactivated throughout the procedure. Guarantee close monitoring and consistent readiness of the external defibrillator.\nUse a pulse oximeter to monitor the oxygen saturation.\nIntroduce a sheath via the left radial artery for invasive blood pressure monitoring, either via Seldinger technique6 or with an arterial puncture system with an integrated cannula (see Table of Materials).",
    "Disinfect patient´s skin in both groins with 75% propanol (see Table of Materials) and cover the patient´s body with a sterile cloth, sparing the groins.\nNOTE: At this point, all persons entering the catheter laboratory and working in close proximity to the patient have to wear hoods and masks.\n3. Groin Puncture and Catheter Positioning\nApply local anesthesia (xylocaine) in both groins by subcutaneous injection and introduce a central venous catheter via the left femoral vein and 3 sheaths (5, 6 and 12 Fr) via the right femoral vein with Seldinger technique6.\nPlace a quadripolar catheter in the right ventricular apex and an 8-polar steerable catheter in the coronary sinus by means of fluoroscopy (beam positions: AP, RAO 30°, and LAO 60°).\nNOTE: As soon as the x-ray equipment is activated, all persons entering the catheter laboratory have to wear lead protection.\nConnect diagnostic catheters to the electrophysiology system and stimulator (see table of materials).\nVerify that the quadripolar catheter in the right ventricle has sufficient capture by stimulating with a cycle length of 600 ms (or less, if the patient is tachycardic) and look for the adequate response.\nAdminister 5000 IU heparin via a venous sheath in the groin. Perform activated clotting time (ACT) measurements every half hour with an appropriate device (see Table of Materials, ACT goal: above 300 s).",
    "Introduce a long steerable sheath (see Table of Materials) via the right femoral vein into the right atrium of the heart and perform trans-septal puncture using an appropriate needle connected to a pressure sensor line (beam positions AP and LAO 90° or RAO 20° and LAO 50° depending on the investigator). After puncturing the inter-atrial septum of the heart, disconnect the pressure sensor line and apply contrast agent via the needle to check the correct position inside the left atrium. Then advance the sheath over the dilator under fluoroscopy control and place the distal end of the long steerable sheath in the left atrium pointing towards the left ventricle.\nInitiate general anesthesia by administration of propofol and remifentanil.\n4. Electro-anatomical Reconstruction of the Left Ventricle\nIntroduce a multipolar mapping catheter (steerable 16 pole catheter, electrode spacing 3-3-3, electrode length 1 mm, see Table of Materials) in the left ventricle via the steerable sheath and collect anatomical and electrical data of the endocardial left ventricle using the 3D mapping system (see Table of Materials) and the multipolar catheter.\nDefine voltage of ventricular signals as follows: scar area under 0.5 mV, low voltage area between 0.5 and 1.5 mV and normal voltage area above 1.5 mV. Be careful to take into consideration only ventricular beats of the same type: either intrinsic ventricular activation in sinus rhythm or stimulated ventricular beats if the patient is pacemaker-dependent. Do not use premature ventricular complexes. Use the morphology matching feature to sort out unwanted ventricular complexes (see Figure 1).\nOptionally, turn down the lower voltage limit to 0.2 mV to identify viable conducting tissue inside the scar (see Figure 2 and 3).",
    "Pay close attention to fractionated (ventricular activation with more than one component) and late (second ventricular activation clearly separated from the first ventricular activation on a given electrode) potentials and annotate them separately (e.g. with special tags, see Figure 4A).\nOptionally, pace from the right ventricle to clearly separate the late potential from the first ventricular activation (see Figure 4B).\nRemove the multipolar mapping catheter and introduce an irrigated tip ablation catheter with sensor (electrode spacing 2-2-2, see Table of Materials) connected to a cooling pump into the left ventricle. Complete the electroanatomical map with the ablation catheter by adding missing anatomy (collect electroanatomical points at places where the multipoloar catheter could not be placed) and verifying zones of high interest (i.e. zones with very fractionated and late potentials — tag those zones separately, see Figures 1-2).\n5. Programmed Ventricular Stimulation (PVS)\nPerform PVS7 via the catheter in the right ventricular apex and the EP stimulator (see Table of Materials) using a predefined protocol of up to 9 steps or until a sustained VT is induced:\nBegin with a 6-beat drive train (10 V over 2 ms) with 500 ms cycle length and add an extra-stimulus of 350 ms coupling interval after the last stimulus of the drive train. Then, after a pause of at least 5 s, repeat this maneuver by decrementing the coupling interval of the extra-stimulus every cycle by 10 ms until the refractory time of the right ventricle is reached.\nThen, add a second extra-stimulus (beginning with 350 ms coupling interval) and repeat the above-mentioned protocol until ventricular refractory time. Couple the first extra-stimulus with the following interval: refractory time plus 20-30 ms, as appropriate (make sure the first extra-stimulus captures the right ventricle).",
    "Reduce the drive train to 430 ms, then 370 ms and at last 330 ms and repeat the above-mentioned steps.\nAt last, add a 3rd extra-stimulus to the drive train of 500 ms and repeat the above-mentioned protocol.\nRepeat the protocol in the right ventricular outflow tact (RVOT) if no sustained VT can be induced.\nMake sure that the external defibrillator is ready to deliver a shock at any time during the whole procedure, and re-check it before PVS.\nIn case a sustained monomorphic VT can be induced (the following also applies if VT occurs during mapping or ablation):\nCreate an activation map of the left ventricle using the 3 D mapping system (LAT-map: local activation time) if the VT is hemodynamically stable. Optionally, perform entrainment mapping.\nStop the VT by overdrive stimulation via the catheter in the right ventricular apex or, if that fails, by external cardioversion/defibrillation, if the VT is hemodynamically unstable.\nMark and annotate every VT that can be induced and compare them to spontaneously occurring VTs or use it for pace mapping.\nIf no sustained VT can be induced, continue with substrate modification (point 6) in case of a well-defined scar in ischemic cardiomyopathy. However, without inducible VT at the beginning of the procedure, there is no clear endpoint and control of success of the ablation therapy.\n6. Catheter Ablation\nStart irrigated radio frequency ablation with 35 to 45 W using the ablation catheter. Optionally, use a contact force catheter that provides information on tissue contact. Apply energy per lesion until a force-time-integral of 450 gs. Encircle scar areas by ablation lesions. Then, ablate all previously mapped abnormal potentials (substrate modification). Match pace mapping in electrically interesting regions to previously marked VTs.",
    "Pay close attention to ablation catheter impedance (usually between 90 and 150 Ohm), catheter temperature (max. 43 °C) and patient´s blood pressure (compared to the initial value). Immediately stop ablation if impedance drops or rises substantially compared to the initial value.\n7. Post Ablation\nAfter ablation, repeat PVS.\nIf ventricular arrhythmias can be induced, re-evaluate the substrate and continue ablation (see points 5 and 6).\nIf no arrhythmia can be induced, stop the procedure.\nStop general anesthesia (optionally an anesthesiologist takes care of general anesthesia and gradually discontinues all sedative agents at the end of the procedure).\nRemove all catheters and sheaths from the heart.\nRe-activate the tachycardia therapies of the ICD and restore all formerly de-activated functions.\nPerform transthoracic echocardiography to exclude pericardial effusion.\nTake a final ACT measurement and administer protamine, if appropriate.\nRemove the sheaths of the right groin and apply a compression bandage. The central venous catheter in the left groin remains.\nAs soon as the patient is awake and extubated, bring him to the intensive care unit for further surveillance."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}