{
  "id": 6392,
  "origin_website": "Bio",
  "title": "Flip-flop Mediated Conditional Gene Inactivation in <em>Drosophila</em>",
  "procedures": [
    "Choosing the MiMIC and determining the appropriate phase of the MiMIC linesPublicly available MiMIC lines are listed in Bloomington Drosophila Stock Center (BDSC) database and can be accessed from FlyBase (http://Flybase.org[href=http://flybase.org/]) or at the stock center website (https://bdsc.indiana.edu[href=https://bdsc.indiana.edu/]).Choose a MiMIC insertion that tags your gene of interest, preferably one that tags all of the transcriptional isoforms of the gene (called “gold” MiMICs in Nagarkar-Jaiswal et al., 2015). As an example, in this protocol, we are using MiMIC lines that tag the genes SNF4Agamma and Trim9.Using RMCE resources page (http://flypush.imgen.bcm.tmc.edu/pscreen/rmce/[href=http://flypush.imgen.bcm.tmc.edu/pscreen/rmce/]) from the Bellen lab at Baylor College of Medicine, determine the phase for the chosen MiMIC line. The proper functioning of the Flip-flop cassette is dependent on the in-frame translation of the Flip-flop cassette with the preceding exon. The in-frame translation is determined by the last codon of the preceding exon (preceding codon) and can result in one of the three phases of translation for Flip-flop: Phase 0 or Phase 1 or Phase 2. Choose the corresponding plasmid donor for the Flip-flop as dictated by the MiMIC insertion. Also, determine the relative orientation of the MiMIC element with that of the recipient gene. This information is necessary for the molecular validation of Flip-flop cassette insertion using PCR.Generation of Flip-flop fly linesIn this section, we describe the generation of the Flip-flop alleles by co-injecting the Flip-flop cassettes with the PhiC31 integrase plasmid into embryos carrying the MiMIC insertion. Using a stock of flies carrying gene specific MiMIC (yellow+) inserted in a coding intron [F0], set up a small fly cage (~150-300 adult flies, about 50-100 males and 100-200 females that are less than 15 days old) and collect 0.5-1 h old embryos of on grape juice plates supplemented with yeast paste. Prepare embryos [F1] for microinjection as described in Kiehart et al.",
    "(2007). Briefly, collect the embryos from the grape juice plate and wash with water. Resuspend them in 50% bleach and stir continuously for about 2 min. Wash off the bleach and align the embryos in a line on a small piece of grape juice agar. Stick the embryos on a coverslip with double-sided tape by gently lowering the coverslip onto the embryos. Cover them with Halocarbon oil 700. Co-inject the phase-specific Flip-flop plasmid (concentration 400 ng/µl) and PhiC31 integrase expressing vector (concentration 300 ng/µl) along with the food color into embryos using the Femtotips and FemtoJet 4x as described in Kiehart et al., 2000. Let the embryos develop at 18 °C.Collect individual male/female adults from F1, and cross them to appropriate balancer stock depending on the chromosomal location of the MiMIC insertion. From these crosses, screen for flies that have lost the MiMIC-yellow marker (yellow-) indicating successful RMCE event [F2]. Self-cross transgenic F2 flies and establish Flip-flop stocks. Confirmation of orientation of the Flip-flop cassetteThe Flip-flop cassette is flanked by two inverted attB that allow replacement of the MiMIC core located between two inverted attP sites (Figure 2). Since recombination can occur between any of two attP and attB sites, the Flip-flop cassette can be inserted in either a PT or a GT orientation (Figure 2). In this section, we will determine the orientation of the Flip-flop transgenic line. From the stock of Flip-flop flies that was established in the previous section, extract genomic DNA from 8-10 flies using the PureLinkTM Genomic DNA Mini Kit (Invitrogen).",
    "Perform four PCR reactions for each Flip-flop line to confirm the orientation of the Flip-flop cassette (protein trap versus gene trap): (1) First PCR reaction with MiL-F and EGFP-TAG-Rev primers (2) second reaction with Mil-F and mCherry-TAG-Fwd primers, (3) third reaction with MiL-R with EGFP-TAG-Rev primers and (4) the fourth reaction with MiL-R and mCherry-TAG-Fwd primers. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190129/20190129173847_2786.jpgFigure 2. RMCE event screening. By knowing of the orientation of the MiMIC insertion with respect to the gene using Step A3, the PCR products as shown in (A), (B), (C) and (D) can be used to determine the orientation of the Flip-flop cassette with respect to the gene: when the MiMIC cassette is inserted in the same orientation as the gene (A) and (B), and when MiMIC is inserted in the opposite orientation of the gene (C) and (D). Gel images on the left hand side show amplification in different PCR reactions that distinguish between integration of Flip-flop in PT or GT orientations: (1) First PCR reaction with MiL-F and EGFP-TAG-Rev primers (2) second reaction with Mil-F and mCherry-TAG-Fwd primers, (3) third reaction with MiL-R with EGFP-TAG-Rev primers and (4) the fourth reaction with MiL-R and mCherry-TAG-Fwd primers. When the MiMIC insertion is in the same orientation as the gene (SNF4Aγ), a positive amplification in reactions 1 and 4 will confirm the PT orientation (A), while positive bands in 2 and 3 will confirm the GT orientation (B). If the MiMIC insertion and the gene are in the opposite orientation (Trim9), positive reactions in 2 and 3 will confirm the PT insertion (C) and 1 and 4 will confirm the GT insertion (D).",
    "Induction of Flip-flop cassette inversion to facilitate conditional knock-downIn this section, we provide generic schemes for generating experimental animals that can be used for Flip-flop mediated mosaic analysis in different tissues using different sources of FLPs (Figure 3). We refer to the gene of interest as “gene” in these schemes. Consequently, genenull is used to refer to a strong loss of function allele that is derived from a different source other than the Flip-flop stock. Flip-flop stocks are indicated with geneEGFP-T2A-mCherry- indicating that they are in the PT orientation. We also provide selected examples of results of mosaic tissue generated using Flip-flop in mitotic as well as post-mitotic cells from our previous study. We track the formation of mosaics using genetically encoded fluorescent markers that are expressed from the genomic location of the corresponding genes.   For mosaic analysis using Flip-flop, we recommend using a combination of Flip-flop and a strong loss of function allele (genenull) in order to prevent the confounding effects of secondary mutations that may be present in the Flip-flop line. This is standard practice in Drosophila genetics, as an independently derived allele of the gene, it is unlikely to also have the same secondary mutations as Flip-flop. We also recommend the use of fluorescent balancers, such as TM3,Kr-GAL4 UAS-GFP or TM3,P{w[+mC]=sChFP}3,Sb[1] which permit easy identification of non-balancer-carrying animals (inferred as geneEGFP-T2A-mCherry/genenull larvae) through the absence of GFP or mCherry signal. Conditional gene inactivation in mitotic cellsIn this section, we describe Flip-flop mediated gene inactivation in mitotically active cells in a tissue-specific manner as well as in random mosaics. We used a Flip-flop insertion in a gene encoding AMP kinase gamma subunit, SNF4Aγ, as an example. To reverse the Flip-flop insertion in SNF4Aγ in a tissue-specific fashion we used eyeless promoter driven FLP (ey-FLP).",
    "This promoter drives the expression of FLP in the presumptive eye-antenna imaginal disc as well as part of the optic lobe of the larval brain. For random mosaics generation throughout the animal’s body, we used heat-shock inducible FLP (hs-FLP) expression. The expression of FLP from this source is stochastic and induced upon a heat shock to the larvae at 37 °C. Flip-Flop cassette inversion in eye antenna discUsing standard genetic crosses create appropriate fly stocks carrying a transgenic source of eyeless FLP and a severe loss of function allele and null mutants of the gene (ey-FLP/Y;genenull/CyO,Kr-GAL4 UAS-GFP or TM3,Kr-GAL4 UAS-GFP) and cross them with geneEGFP-T2A-mCherry/geneEGFP-T2A-mCherry carrying flies. A schematic of cross strategy is shown in Figure 3A. Raise these crosses at 25 °C.Collect larvae 48 h post-egg-laying and select non-GFP third instar larvae. Dissect the eye-antenna disc under the dissecting microscope and stain with anti-GFP and anti-mCherry antibodies as described in Nagarkar-Jaiswal et al., 2017. Briefly, fix the dissected larvae with 4% formaldehyde for 30 min, wash three times with PBS-0.2% Triton X-100 and block with 10% Normal Goat Serum for 1 h at room temperature. Incubate samples with anti-GFP and anti-mCherry at 4°C overnight. Wash samples three times with PBS-0.2% Triton X-100 and incubate with Secondary antibodies for 2 h at room temperature. Mount the sample in mounting media.Mosaic generation in the adult gutCreate fly stocks hs-FLP/Y;genenull/CyO,Kr-GAL4 UAS-GFP or TM3,Kr-GAL4 UAS-GFP using conventional genetic approach and then cross them with y1w*;geneEGFP-T2A-mCherry/geneEGFP-T2A-mCherry Flip-flop flies and keep at 18 °C. A schematic of cross strategy is shown in Figure 4A. Collect appropriate progeny carrying the Flip-flop allele and the null allele (hs-FLP/y1w*;genenull/geneEGFP-T2A-mCherry) and maintain them at 18 °C for 3 days. Heat shock adult females on Day 3 for 2 h at 37 °C and keep them at 25 °C.",
    "Optional: Starvation assay or drug feeding assay could be performed to compare the effect of starvation or drug on the mutant gut cells.Dissect guts and stain with anti-GFP and anti-mCherry antibodies as described in Nagarkar-Jaiswal et al., 2017.Conditional gene inactivation in mitotically inactive cellsNeurons are mitotically inactive cells. This precludes the use of traditional mosaic analysis techniques such as MARCM, which depend on mitotic separation of mutant and heterozygous cells. Application of Flip-flop, however, does not require mitotic separation of the mutant cells and therefore can be used to conditionally inactivate genes in adult neurons. To demonstrate the applicability of Flip-flop to non-mitotic cells such as neurons, we describe conditional inactivation of Trim9 in adult neurons by using neuronal driver nSyb-GAL4 and UAS-FLP (Figures 5A and 5B). We chose nSyb-GAL4 as it is a well-characterized driver of GAL4 expression in mature neurons. However, it is constitutively expressed in neurons. To achieve conditional inactivation in adult neurons and not in larval neurons, we limited the activity of nSyb-GAL4 during development using a temperature sensitive GAL80 (GAL80ts). GAL80 is a well-known inhibitor of GAL4 and can be used to suppress the expression of GAL4/UAS-driven FLP during development. Maintaining the suppressed FLP (GAL4/UAS-FLP, GAL80ts) carrying stocks at low temperature and then switching to a higher temperature in adults will restrict FLP expression at low temperature and drive the expression of FLP at high temperature. Hence, a temperature shift post-development will lead to Flip-flop cassette inversion predominantly in the adults. This approach can be used for the identification of adult neuronal functions of genes which are essential for proper development.",
    "Below, we describe a generic scheme wherein any neuronal GAL4 can be used to generate stocks that permit conditional gene inactivation in neurons during development as well as in adult brain using Flip-flop (Figure 5A).Gene inactivation in neurons Create fly stocks tubP-GAL80ts;genenull/CyO,Kr-GAL4 UAS-GFP or TM3,Kr-GAL4 UAS-GFP;UAS-FLP/UAS-FLP and cross them to geneEGFP-T2A-mCherry/geneEGFP-T2A-mCherry;Neuronal-GAL4/Neuronal-GAL4 using conventional genetic approach. Maintain the crosses at 18 °C until eclosion.Shift the adults to 29 °C on Day 4 after eclosion. Dissect the brains on Day 4 after shifting to 29 °C and stain as described in Nagarkar-Jaiswal et al., 2017.Note: The same strategy can be used to study the developmental role of the genes in larval neurons. In such a case, above-mentioned crosses can be kept either at 29 °C throughout or animals can be shifted from 18 °C to 29 °C at a specific time point during development. A description of such an analysis of the larval brain is also provided in Nagarkar-Jaiswal et al., 2017."
  ],
  "subjectAreas": [
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}