{
  "id": 18542,
  "origin_website": "Jove",
  "title": "Synthesis of a Deuterated Standard for the Quantification of 2-Arachidonoylglycerol in Caenorhabditis elegans",
  "procedures": [
    "1. 1-AG-d5 preparation\nNOTE: For obtaining 1-AG-d5 as a deuterated internal standard for quantification assays, follow the protocol as detailed below.\nDifferential protection\n\t\nTo only protect primary alcohols, first add 38 mg of glycerol-d8 to a 10 mL reaction tube using a Pasteur pipette and add a magnetic stirrer.\nAdd 5 mL of anhydrous dichloromethane (DCM) using a 5 mL Hamilton syringe, and fill the tube with dry N2 to yield an inert atmosphere.\nPrepare a bath using a shallow Dewar flask filled with distilled ethyl acetate.\nFit the hermetically closed reaction tube inside the bath and cool it by slowly adding liquid N2 to the ethyl acetate until the solvent is frozen.\n\t\tCAUTION: Liquid violently boils at room temperature (RT) and can cause severe burns when contacting eyes and skin.\nAdd 54 mg of anhydrous collidine using a Hamilton syringe.\n\t\tCAUTION: Collidine is volatile and has a very strong and unpleasant scent.\nAdd 70 mg of tert-butyldimethylsilyl chloride and stir the entire solution for 3 h at -78 °C on a magnetic stirrer.\nAfter 3 h, leave the reaction to warm at RT and keep stirring for an additional 12 h.\nAdd 2 mL of brine to quench the reaction.\nExtract the solution 3x with 2 mL of distilled dichloromethane using a separating funnel, saving the organic extract each time.\nCombine the three organic extracts and dry them over sodium sulfate.\nEvaporate the dichloromethane under reduced pressure in a vacuum rotary evaporator carefully to avoid solvent projections.\nPurify the crude mixture by column chromatography using silica gel as the stationary phase and a 10% increasing hexane/ethyl acetate gradient, starting from 100% hexane and finishing with 100% ethyl acetate.",
    "Combine the product-containing fractions and remove the solvent under reduced pressure in a vacuum rotary evaporator to obtain the pure 1-O,3-O-bis-(TBDMS) glycerol-d5 as a colorless liquid.\nEsterification\n\t\nAdd 10 mg of the 1-O,3-O-bis(TBDMS)-glycerol-d5 (previously synthesized) to a 10 mL reaction tube using a Pasteur pipette and add a magnetic stirrer.\nAdd 2 mL of anhydrous dichloromethane using a 5 mL Hamilton syringe, and fill the tube with dry N2 to yield an inert atmosphere.\nCool the solution to 0 °C using an ice bath.\nAdd 36 mg of arachidonic acid using a multi-volume adjustable micropipette and stir.\nAdd 15 mg of 4-dimethylaminopyridine and stir.\nAdd 15 mg of N,N'-diisopropylcarbodiimide using a multi-volume adjustable micropipette and stir.\nLet the mixture react at 0 °C for 3 h.\nAfter 3 h, leave the reaction to warm at RT and keep stirring for an additional 12 h.\nAdd 2 mL of water to quench the reaction.\nExtract the organic solution 3x with 2 mL of distilled dichloromethane (DCM) using a separating funnel.\nPlace the three organic extracts in the same tube and dry them over sodium sulfate.\nEvaporate the dichloromethane under reduced pressure in a vacuum rotary evaporator carefully to avoid solvent projections.\nPurify the crude mixture by column chromatography using silica gel as the stationary phase and a 10% increasing hexane/ ethyl acetate gradient, starting from 100% hexane and finishing with 50% hexane/50% ethyl acetate.\nCombine the product-containing fractions and remove the solvent under reduced pressure in a vacuum rotary evaporator to obtain the pure 1-O, 3-O-bis(TBDMS)-2-AG-d5 as a yellowish liquid.\nDeprotection\n\t\nAdd 15 mg of the 1-O,3-O-bis(TBDMS)-2-AG-d5 (previously synthesized) to a 10 mL reaction tube using a Pasteur pipette and add a magnetic stirrer.",
    "Add 2 mL of anhydrous THF using a 5 mL Hamilton syringe, and fill the tube with dry N2 to yield an inert atmosphere.\nCool the solution to 0 °C using an ice bath.\nAdd 150 µL dropwise of 1 M tetrabutylammonium fluoride solution in THF using a Hamilton syringe.\nLet the reaction warm to RT and stir for 1 h.\nAfter 1 h, add 2 mL of water to quench the reaction.\nExtract the solution 3x with 2 mL of distilled dichloromethane using a separating funnel.\nCombine the three organic extracts and dry them over sodium sulfate.\nEvaporate the dichloromethane under reduced pressure in a vacuum rotary evaporator to obtain the pure 1-AG-d5 as a yellowish liquid.\nMonitor all reactions by thin layer chromatography performed on silica gel 60 F254 pre-coated aluminum sheets. Visualize the bands under a 254 nm UV lamp after staining with an ethanolic solution of 4-anisaldehyde.\n2. Preparation of standard stock and measuring solutions\nDissolve 1 mg of the internal standard 1-AG-d5 in 1 mL of ACN and sonicate for 1 min to obtain the 1,000 ppm standard stock solution.\nTo prepare the 1,000 ppb solution used for quantification in worms, first prepare a 10 ppm solution: take 10 µL of the stock solution using a Hamilton syringe and dilute it to a final volume of 1 mL by adding 990 µL of ACN.\nTake 100 µL from the solution produced in step 2.2 using a Hamilton syringe, and dilute it to a final volume of 1 mL by adding 900 µL of ACN to obtain the 1,000 ppb solution used for the quantification.",
    "Sonicate for 1 min between each step to ensure complete solubilization. Store the solutions at -78 °C to maintain the concentrations and integrity of the standards. After the standard solution is used, flow some nitrogen before closing the vial to prevent oxidation.\n3. Growth and maintenance of C. elegans\nNOTE: Seed the nematode growth medium (NGM) agar plates with E. coli OP50 and propagate the worms on these plates.\nMix 3 g of NaCl with 17 g of agar.\nAdd 2.5 g of peptone, then add 975 mL of H2O.\nAutoclave for 50 min, then cool the flask to 55 °C.\nMix the following: 1 mL of 1 M CaCl2, 1 mL of 1 M MgSO4, 25 mL of 1 M KH2PO4 buffer (all of which have been previously autoclaved), and 1 mL of 5 mg/mL cholesterol in ethanol.\nWhile maintaining a sterile environment, dispense the NGM solution into 60 mm Petri plates, filling the plates to two-thirds of their volume. Store the plates at 4 °C.\nStreak the E. coli bacterial culture from a -80 °C glycerol stock onto the LB agar plate. Let it grow on the plate overnight at 37 °C.\nPick up a single colony to inoculate 100 mL of liquid LB overnight at 37 °C with agitation.\n\tNOTE: It is not necessary to check the O.D. because this strain can reach stationary phase over this time.\nRemove the stored NGM plates, remove the lids in the laminar flow hood, and leave open to allow evaporation of excess moisture from the plates.\nOnce the plates are dried, use a Pasteur pipette to add 100 µL of OP50 E. coli to the center of the plate without spreading.\nLeave the OP50 E. coli lawn to grow overnight at RT or at 37 °C for 8 h.",
    "Add the desired number worm embryos obtained by hypochlorite treatment or \"bleaching\" (Section 4).\n\tNOTE: Cool the plates to RT before the addition of worms.\n4. Bleaching technique for synchronizing C elegans cultures\nSeed and chunk worms onto 6 cm NGM plates.\nLeave the worms growing for 2-3 days to obtain sufficient numbers of eggs and gravid adults on the plate.\nOnce there are enough eggs/adults, pour 5 mL of M9 onto the plate.\nTransfer the worms to a 15 mL centrifuge tube using a glass pipette.\nCentrifuge the tube for 2 min at 2,000 x g and pellet the worms.\nSuction out most of the M9, avoiding disturbance of the worm pellet.\nAdd 3 mL of bleaching solution (2:1:1 ratio of NaOH:NaOCl:H2O).\nInvert gently to mix the solution for 5 min or until the number of intact adult worms decreases.\n\tCAUTION: Do not bleach for more than 5 min.\nCentrifuge for 1 min at 2,000 x g and suction most of the bleaching solution without disturbing the worm pellet.\nAdd 15 mL of M9 and mix well.\nCentrifuge again at 2000 x g for 1 min.\nSuction out most of the M9 without disturbing the worm pellet.\nRepeat steps 4.10-4.12 one or two more times.\nAdd 5 mL of fresh M9 and agitate.\nLet the eggs hatch overnight with gentle rocking.\n5. Worm sample preparation\nLet the N2 embryos obtained by the bleaching procedure hatch overnight in M9 buffer (5 mL in a 15 mL centrifuge tube) at 20 °C.\nHarvest the synchronized L1s by centrifuging the tube for 2 min at 2,000 x g.\nWash the worms with M9 buffer 1x, then quantify the number of live L1 worms.\nSeed approximately 10,000 worms into NGM plates (10 cm diameter) with 1 mL of OP50 E. coli (previously dried).",
    "Incubate the plates for 48 h at 20 °C until worms reach the L4 stage.\nHarvest the worms using cold M9 buffer in a 15 mL centrifuge tube, wash them 1x, then and transfer them to a 1.5 mL tube.\nPellet the worms by centrifugation at 2,000 x g for 1 min, eliminate most of the supernatant, immerse the tubes in liquid nitrogen, and store at -80 °C.\n6. Lipid extraction\nThaw approximately 100 µL of frozen worm pellets belonging to N2 on ice, add 1.3 mL of methanol, and sonicate the sample for 4 min.\nAdd 2.6 mL of chloroform, and 1.3 mL of 0.5 M KCl/0.08 M H3PO4 to a final ratio of 1:2:1, 1,000 ppb of the internal standard 1-AG-d5, and butylated hydroxytoluene as an antioxidant agent at a final concentration of 50 µg/mL.\nVortex the samples for 1 min and sonicate in an ultrasonic water bath for 15 min on ice.\nVortex the samples 2x for 1 min and centrifuge for 10 min at 2,000 x g to induce the phase separation.\nCollect the lower phase and collect it in a clean tube, dry it under nitrogen, and resuspend the solid residue in 100 µL of ACN.\n7. Endocannabinoid analysis by HPLC-MS/MS\nUse liquid chromatography coupled with an ESI triple quadrupole mass spectrometer to detect and quantify 2-AG from nematode samples.\nUse the following ratio for reversed-phase HPLC: from 0.0-0.5 min H2O:ACN (40:60), 0.5-6.5 min H2O:ACN (40:60) to (25:75), 6.5-7.5 min H2O:ACN (25:75), 7.5-8.0 min H2O:ACN (25:75) to (40:60), 8.0-12.0 min H2O:ACN (40:60).\nMaintain the column temperature at 40 °C and set the autosampler tray temperature to 10 °C.",
    "Set the following ionization conditions: positive-ion mode; drying gas (N2) temperature = 300 °C; drying gas flow rate = 10 L/min; nebulizer pressure = 10 UA; and cap. voltage = 4 kV.\nFor the analyte detection, use MRM with the following transitions: 379.2 m/z to 289.2 m/z for 2-AG; and 384.2 m/z to 289.2 m/z for 1-AG-d5.\n8. Endocannabinoid quantification in worms\nUse deuterated internal standard 1-AG-d5 and calculate the peak area ratios of the analyte to the internal standard.\nUse the following transitions: 384.2 m/z to 287.2 m/z for 2-AG; and 379.2 m/z to 287.2 m/z for 1-AG-d5.\nCalculate the concentration of the endogenous 2-AG by comparing to the peak area ratios of the deuterated standard using the concentration value of the standard.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}