{
  "id": 11923,
  "origin_website": "Jove",
  "title": "Evaluation of the In vivo Antitumor Activity of Polyanhydride IL-1α Nanoparticles",
  "procedures": [
    "All the in vivo procedures used in this study were approved by the Institutional Animal Care and UseCommittee (IACUC) of the University of Iowa.\n1. Preparation and maintenance of HNSCC cell line\nNOTE: In this study, the murine oropharyngeal epithelial cell line stably transformed with HPV E6 and E7 together with hRas and luciferase (mEERL) will be used. This cell line was developed from C57BL/6J mouse strain and was a gift from Dr. Paola D. Vermeer (Department of Surgery, University of South Dakota Sanford School of Medicine, South Dakota, USA).\nThaw a frozen vial of mEERL cells in a pre-heated (37 °C) water bath and then transfer to a 15 mL conical tube containing warm culture media (Dulbecco's Modified Eagle Medium [DMEM] supplemented with 40.5% 1:1 DMEM/Hams F12, 10% Fetal Bovine Serum [FBS], 0.1% gentamicin, 0.005% hydrocortisone, 0.05% transferrin, 0.05% insulin, 0.0014% tri-iodothyronine, and 0.005% epidermal growth factor).\nCentrifuge the conical tube at 277 x g for 5 min at 25 °C to remove the media. Then, resuspend the cell pellet in 3-5 mL fresh media and transfer it to a T-25 cell culture flask. For optimal recovery from frozen storage, plate cells at high density.\n\tNOTE: T-25 flasks were used because of their smaller size, results in faster recovery times from frozen storage when cells are in close proximity compared to T-75 flasks.",
    "Let the cells grow in a humidified incubator at 37 °C and 5% CO2, expand to larger flasks (i.e., T-75 or T-150), and passage every 3 days. When there are enough cells for the desired implantation into all mice, remove the flasks, discard the media, and gently rinse the cells with phosphate buffered saline (PBS). Then, add 4 mL (if using T150 flasks) of 0.25% trypsin-EDTA, and incubate at 37 °C for 2 min. Scale the amount of trypsin up or down depending on the dish/flask size being used.\n\tNOTE: The type of cell line and degree of confluency may affect trypsinization times. Long trypsinization periods can damage cells resulting in low viability. Use the minimum amount of time needed for trypsinization.\nUnder the microscope, the detached cells on trypsinization move freely. If some cells are still attached, very gently tap the flask to mobilize the remaining adherent cells. Add fresh media (scale amount of media as desired) to stop the trypsin reaction and collect the cell suspension in 50 mL conical tubes. Centrifuge at 277 x g for 5 min at 25 °C to remove the media.\nResuspend the cells in fresh media and count the cells. Centrifuge once more (as described above), and then add cold PBS to the cells to make a final concentration of 10 × 106 cells/mL. Keep the cell suspension(s) on ice before injection to mice.\n2. Tumor implantation, drug treatment, and measurement\nNOTE: The experimental animals were kept in the Animal Care Facility at the University of Iowa and followed appropriate aseptic procedures to handle them.\nAnesthetize C57Bl/6J mice with ketamine (80 mg/kg) and xylazine (10 mg/kg) mix. Carefully shave the flank area or desired injection site with an electric razor.",
    "NOTE: Remember to document the use of controlled substances as required by institutional (or other) rules and regulations.\nDisinfect the flank area with an ethanol pad and slowly inject 100 µL (containing 1 x 106 cells) of the cell suspension subcutaneously using a 25-28 G syringe. Anesthetize the mice before injection to prevent sudden movements and cell loss. Before each injection, gently mix the cell suspension to prevent cells from settling to the bottom of the vial or conical tube.\nAfter taking up the cell suspension into the syringe, remove all the bubbles and dead space from the top. Inject the cell suspension in a slow and steady manner. Do not use the same needle on multiple mice. Always make extra cell suspensions to account for accidental loss.\nPlace the animal in their respective cages and monitor them until they recover from anesthesia. During anesthesia, animals are at risk of hypothermia; therefore, provide supplemental heat or place the mice close to each other to keep warm (if housed in the same cage).\nWhen tumors reach 3 mm in any direction, randomize the mice (by tumor size and/or weight) in the treatment groups and then start the drug treatment. Inject the mice intraperitoneally (i.p.) with NPs15 containing 3.75 µg rIL-1α/mouse on Days 4 and 9. Measure and record the tumor volume ((length x width2) / 2) and the mouse weight daily or every other day until the tumor size or the mice reach euthanasia criteria.\n\t​NOTE: Even with an experienced researcher, it is difficult to implant the same-sized tumor in all mice. Randomize animals into experimental groups based on the tumor size and mouse weight.\n3. Blood collection and serum separation",
    "NOTE: Blood collection from a submandibular vein is an easy and effective technique that allows blood collection from conscious animals or animals under anesthesia. For this study, blood was collected from the animals when they were under anesthesia.\nAnesthetize the mice with an injection of ketamine/xylazine mix as mentioned above.\nGrasp the loose skin over the shoulder using the non-dominant hand and puncture the submandibular vein with an 18 G needle or lancet, slightly behind the mandible (a white spot at that area).\nPuncture the vein to ensure blood flow immediately. Collect 200-300 µL of blood (depending on mouse weight) into a 1.5 mL polypropylene microcentrifuge tube or serum separator tube. After blood collection, apply gentle pressure to the puncture site until the bleeding has stopped. Return the mice to their respective cages and observe until they recover from anesthesia.\n\tNOTE: Do not collect more than 1% of the mouse body weight in one collection or over a 24 h period.\nLet the collected blood clot at room temperature for 20-30 min. Place the tubes on ice until they are ready to be centrifuged.\nCentrifuge the clotted blood at 1540 x g for 15 min at 4 °C.\nCollect the upper layer (serum) without disturbing the red blood cells. Store at -80 °C until use.\n4. Multiplexing of collected serum\nThaw the serum or plasma samples while keeping them on ice.\nCentrifuge the samples at 1540 x g for 5 min at 4 °C to sediment any cell debris and carefully collect the serum layer from the top.\nBring out the multiplex kit at room temperature.\n\tNOTE: There are several commercially available multiplex kits that are designed for specific cytokines, chemokines, or growth factors. Also, it is possible to customize the kit based on the protein of interest.",
    "Perform the assay as per the manufacturer's protocol to detect cytokines.\n\t​NOTE: Most of the multiplex kits use magnetic beads to bind the captured antibody. So, it is essential to use an automated or handheld magnetic washer during washing. Otherwise, the magnetic beads will wash off from the plate, and one will not have enough events to take the reading.\n5. Collection of tumor and inguinal lymph node and preparation of single-cell suspension\nAnesthetize the mice with ketamine/xylazine mix. To ensure complete sedation, use pedal reflex (firm toe pinch). If the mice are not responsive, euthanize the mice by cervical dislocation.\nLay each mouse on its back and spray 70% ethanol on the abdominal area skin. Use forceps and scissors to cut the tumor out from the left side of the mice and the lymph node from the right side. If the tumor is big, cut into small pieces and take 500-600 mg of the tissue. For the lymph node, collect the whole organ.\n\tNOTE: There are two lymph nodes on both sides of the inguinal region. Depending on the experimental goals, the lymph node and the tumor can be isolated from the same side. However, if the tumor becomes very large, it will not be easy to collect the lymph node from the same side.\nPlace the tissues onto the respective dissociator tubes containing 3-5 mL of RPMI media. Homogenize the tissue using an automated dissociator.\n\tNOTE: Other automated or handheld homogenizers can be used.\nAfter homogenization, transfer the cell suspension through a 70 µm filter into a 50 mL conical tube. Centrifuge at 277 x g for 5 min at 25 °C to remove the media. Wash and resuspend the cells in 1-2 mL of cold PBS.\n6. FACS staining of single-cell suspension",
    "Use 0.4% trypan blue staining to count the viable cells in a hemocytometer. Calculate the volume required to get 2-3 million cells and transfer them to the respective FACS tube.\nUse viability dye to gate on live cells; otherwise, nonspecific binding of the antibody with dead cells may occur that can yield a false-positive result.\n\tNOTE: Zombie dye was used for live and dead cell staining in this experiment. Several fixable and non-fixable dyes (e.g., propidium iodide) are commercially available.\nCentrifuge (277 x g for 5 min at 25 °C) the counted cells. Decant the supernatant and resuspend the cells into 300 µL of PBS. Add 0.5-1 µL of zombie dye/tube. Incubate at room temperature for 20 min in the dark.\nCentrifuge (277 x g for 5 min at 25 °C) and wash the cells with 1-2 mL of FACS buffer and resuspend them into 200 µL of FACS buffer.\nAdd Fc-receptor blocker (2 µL per 200 µL or according to the manufacturer's protocol) and incubate the cells for 10 min.\nCentrifuge (277 x g for 5 min at 25 °C) and wash the cells with 1-2 mL of FACS buffer. Add the antibody cocktail and incubate for 30 min at 4 °C in the dark.\nAfter the incubation, centrifuge (277 x g for 5 min at 25 °C) and wash the cells with 1-2 mL FACS buffer. Add 300-400 µL of 2% paraformaldehyde solution and resuspend for fixation. Store the cells at this step for a couple of days at 4 °C or analyze immediately by multicolor flow cytometer.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}