{
  "id": 2600,
  "origin_website": "Cell",
  "title": "Protocol for Single-Molecule Fluorescence In Situ Hybridization for Intact Pancreatic Tissue",
  "procedures": [
    "Step-by-Step Method Details\nStep-by-Step Method Details\nCryosectioning, Fixation, and Permeabilization of the Sections\nTiming: 1-2 h; 2 h incubation\nThis step describes how to section the frozen tissue and then fix and permeabilize the sections. See Figure 5[href=https://www.wicell.org#fig5].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/21-Fig5.jpg\nFigure 5. Cryosectioning\nPrepare the coverslips as outlined in BEFORE YOU BEGIN.\nPrepare dry ice in an appropriate container. We use Styrofoam boxes with lids.\nSet up the cryostat (Equipment Setup) and clean the stage. Use a new knife for sectioning.\nCritical: Keep frozen blocks on dry ice. Do not let the blocks thaw or even soften.\nKeep the prepared coverslips at room temperature (RT, 22-26°C). Cut 5- to 10-μm sections. A fine paint brush helps to keep the tissue sections in place. Mount them onto the coated coverslips. The frozen sections will immediately melt on the coverslip due to the temperature difference. Use sharp-ended forceps to pick up the coverslips. Let the sections air-dry for 5 min (1 min/1 μm).\nNote: The drying time is important to properly mount the tissue sample onto the coverslip. Insufficient drying may cause section detachment. To avoid RNA degradation, the drying time should not exceed 1 min/μm tissue.\nPlace the mounted sections facing up in a six-well plate on dry ice. Close the six-well plate and keep the lid of the ice box closed to avoid condensation caused by the room temperature. Keep the sections on dry ice until fixation.\nPrepare the fixative solution (3.7% formaldehyde (vol/vol) in RNase-free 1X PBS). Place the six-well plate with the tissue sections at room temperature for up to 1 min before adding 3-5 mL fixative to each well. Incubate the sections for 15 min at room temperature in a fume hood. See Figure 6[href=https://www.wicell.org#fig6].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/21-Fig6.jpg\nFigure 6. Fixation and Permeabilization of the Sections",
    "Rinse the coverslips with RNase-free 1X PBS. Then replace with cold RNase-free 70% (vol/vol) ethanol. Incubate at 4°C for a minimum of 2 h before proceeding to hybridization.\nNote: All washes can be done in 6-well plates. Solutions should be poured carefully on the side of a well to avoid tissue detachment from the coverslip. Make sure that the sections are always covered and do not dry out at any time.\nPause Point: The coverslips can be kept in 70% ethanol in a fridge for up to 3 days.\nOptional Step: Proteinase K Digestion\nTiming: 20 min\nThis part describes a treatment to enhance the permeability of probes into the tissue. It is recommended for cryosections > 10 μm thickness. See Figure 7[href=https://www.wicell.org#fig7].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/21-Fig7.jpg\nFigure 7.\nPrewarm RNase-free 2X SSC in a 37°C water bath (for step 3 only) and add proteinase K.\nRehydrate the sections by placing them into 2X SSC for 5 min at room temperature.\nReplace 2X SSC with prewarmed proteinase K working solution and incubate at 37°C for 10 min.\nWash the sections with 2X SSC for 5 min.\nRNA Denaturation\nTiming: 5 min; 3-5 h incubation\nThis part describes the incubation with formamide containing wash buffer. See Figure 8[href=https://www.wicell.org#fig8].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/21-Fig8.jpg\nFigure 8. Critical Step: RNA Denaturation\nCritical: The incubation with fresh wash buffer (30% formamide) for at least 3 h shows a dramatic improvement of smFISH signal for in-situ  endocrine and exocrine pancreatic tissue.\nFor studies on the exocrine pancreas, we recommend to extend incubation further to 5 h (Figures 15[href=https://www.wicell.org#fig15] and 16[href=https://www.wicell.org#fig16]). Incubations can be extended to at least 8 h with no compromise in smFISH signal quality.\nWash the sections with 2X SSC for 5 min.",
    "Replace the 2X SSC with 3-5 mL of freshly made wash buffer (with 30% formamide) and incubate at 30°C for for at least 3 h.\nCritical: Handle formamide containing solutions in a fume hood.\nHybridization\nTiming: 20 min; overnight (10-16 h) incubation\nThis section describes the process of hybridization with the probe libraries. See Figure 9[href=https://www.wicell.org#fig9]. Note there are two options for overnight hybridization. Option A is recommended when handling small tissue sections but necessitates a hydrophobic pen that dries fast and comes with the risk that the tissue will dry during the process. See Figure 10[href=https://www.wicell.org#fig10]. For Option B, the coverslip is placed upside down on parafilm. See Figure 11[href=https://www.wicell.org#fig11].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/21-Fig9.jpg\nFigure 9. Preparation of the Hybridization Mix\nThaw the required quantity of hybridization buffer (150 μL per 22 × 22-mm coverslip).\nCritical: Hybridization buffer contains formamide. Handle the buffer in a fume hood while wearing protective gloves.\nIn a 1.5 mL microcentrifuge tube combine the hybridization buffer and the coupled probes with a final concentration of 0.1 ng/μl (intermediate dilutions can be diluted in Tris-EDTA).\nNote: Keep probes protected from light.\nNote: Prepare an extra slide with a mock hybridization to distinguish between true smFISH and autofluorescent signal of the tissue.\nVortex vigorously and spin the mixture briefly.\nNote: Hybridization buffer is highly viscous and needs to be vortexed vigorously after adding the probes.\nAdd the hybridization mix on the sample (according to Option A or Option B).\nOption A is recommended when handling small tissue sections (e.g., isolated islets), but necessitates a hydrophobic pen that dries immediately. This option is not recommended, if the handling time causes the tissue to dry along the process. See Figure 10[href=https://www.wicell.org#fig10].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/21-Fig10.jpg\nFigure 10. Option A",
    "Discard the wash buffer and remove the remaining liquid with a Kimwipe without touching the tissue sections. Mark the borders around the tissue with a hydrophobic pen and proceed immediately to the next step.\nNote: Work fast, so that the tissue will not dry out.\nImmediately add the hybridization mix directly on the tissue. Avoid air bubbles.\nClose the 6-well plate and incubate overnight at 30°C protected from light.\nCritical: From now on keep the tissue sections protected from light.\nOption B is a good alternative to Option A. The benefit of this option is a low risk for the tissue to dry out but as a disadvantage it can cause tissue detachment from the coverslip. When handling small tissue samples (e.g., isolated islets) this option is not recommended. See Figure 11[href=https://www.wicell.org#fig11].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/21-Fig11.jpg\nFigure 11. Option B\nSpread a clean piece of parafilm on the bottom of a 15 cm Petri dish.\nFor each sample pipette 150 μL of the hybridization mix on the parafilm.\nTake the coverslips from the wash wells with fine forceps, pat a corner and wipe the back with a Kimwipe.\nPlace the coverslip section down onto the drop of the hybridization mix. Avoid air bubbles.\nClose the lid of the Petri dish and incubate overnight at 30°C protected from light.\nCritical: From now on keep the tissue sections protected from light.\nDay 2: Washing\nTiming: 1 h 20 min\nThis section describes the steps to wash off unbound probes, optionally to apply nuclear and membrane stains, and finally to mount the slides for imaging. See Figure 12[href=https://www.wicell.org#fig12]\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/21-Fig12.jpg\nFigure 12. Washing\nRemove excessive hybridization mix.",
    "Option A: Hold the 6-well plate in a ∼60° angle and the hybridization mix will from a drop on the lower wall of each well. Remove the mix with a Kimwipe without touching the tissue section.\nOption B: If the hybridization was performed on parafilm, carefully lift a corner of the parafilm so that the coverslip comes easily off from the hybridization solution (or pipette wash buffer to the edge of the coverslip to peel the parafilm off without damaging the sample). Place the coverslips back into a 6-well plate.\nWash twice in wash buffer for 15 min at 30°C.\nPrepare 50 mL GLOX buffer and GLOX buffer with 10 μg/mL DAPI working solution.\nRemove the wash buffer and add 5 mL of DAPI working solution to stain for nuclei. Incubate for 5 min at room temperature protected from light. Make sure the tissue is completely covered.\nOptional Step\nIf using phalloidin membrane staining, prepare fresh phalloidin in GLOX buffer. Replace DAPI with phalloidin solution and incubate for 15 min at room temperature protected from light.\nMounting\nReplace with 3-5 mL GLOX buffer for each well and let stand for a few minutes before mounting. See Figure 13[href=https://www.wicell.org#fig13].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/21-Fig13.jpg\nFigure 13. Mounting\nPause Point: Sections can be stored in GLOX buffer at 4 °C for few hours.\nFor mounting we recommend using 7 μL prolong gold antifade or 15 μL fresh GLOX anti-bleach mounting medium for each section.\nPrepare the mounting medium, circular coverslip, Kimwipe, and forceps. Put a gasket on a rectangular microscope slide. Lift the coverslip with the tissue section. Wipe the back of the coverslips and dry the edges with a Kimwipe and place it on the bench top.",
    "Note: it is important to remove any excess liquid around the tissue sections. However, the tissue sections themselves should never dry out.\nPlace the mounting medium (7 μL prolong gold antifade or 10-15 μL fresh GLOX anti-bleach mounting medium) onto the sections; place a circular coverslip (13 mm diameter) on top of the sample. Avoid producing air bubbles in this process. For GLOX anti-bleach mounting medium use Whatman paper to suck off as much of the excess liquid as possible to avoid sliding the circular coverslip. For prolong gold use small amounts.\nNote: Moving or lifting the circular coverslip after placing it on top of the tissue sections can lead to tissue damage.\nNote: Prolong gold solution is highly viscous and excessive amounts cannot be reabsorbed.\nPlace the microscope glass with the gasket on top of the coverslip. Proceed to imaging.\nPause Point: Slides mounted with prolong gold can be frozen at −20 °C to image later. However, the best signal will be achieved when imaging directly after mounting. Slides mounted with GLOX mounting medium cannot be frozen and should be imaged the same day."
  ],
  "subjectAreas": [
    "Molecular/Chemical Probes",
    "In Situ Hybridization"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}