{
  "id": 5006,
  "origin_website": "Bio",
  "title": "Extraction and Quantification of Tryptophan and Kynurenine from Cultured Cells and Media Using a High Performance Liquid Chromatography (HPLC) System Equipped with an Ultra-sensitive Diode Array Detector",
  "procedures": [
    "Tryptophan and kynurenine extractionThe protocol requires a minimum of 1 x 106 cells to accurately detect tryptophan and kynurenine levels. If tryptophan and kynurenine quantification is desired from fresh media, collect 2 ml of fresh media prior to cell addition for subsequent analysis and freeze at -80 °C. This sample will be used to measure the baseline levels of tryptophan and kynurenine in the media. If cells of interest are adherent cells, then proceed to step A2a. If cells of interest are suspension cells, then proceed to step A2b. If desired, the cell culture can be spiked with an internal standard such as 3-nitro-L-tyrosine (a final concentration of 20-50 µM is generally appropriate) at this time. The internal standard can be used to quantify metabolite recovery.At the completion of the treatment schedule, collect 2 ml media in 2 ml microcentrifuge tubes. Centrifuge at 2,000 x g at 4 °C in centrifuge to pellet cells/debris from the media. Without disturbing the pellet, transfer media into two labeled tubes of equal volume. One will be used for immediate analysis while the other will serve as a backup. At this point, cell-free, centrifuged culture media can be stored at -80 °C until analysis. Media can be analyzed by HPLC without the need for extraction. Next, aspirate off remaining media in plate/flask where cells are grown. Wash cells with cold (4 °C) phosphate buffered saline (PBS) twice. Afterwards, dislodge cells from culture plate/flask by scraping. Collect liberated cells and place into 2 ml microcentrifuge tubes. Centrifuge at 2,000 x g at 4 °C in centrifuge. Proceed to step A3.At the completion of the treatment schedule, collect all media containing cells into appropriate volume conical tubes. Centrifuge at 2,000 x g at 4 °C in centrifuge to pellet cells/debris from media.",
    "Without disturbing the pellet, transfer 1 ml of media into two labeled tubes. One will be used for immediate analysis while the other will serve as a backup. At this point, cell-free, centrifuged culture media can be stored at -80 °C until analysis. Media can be analyzed by HPLC without the need for extraction. Next, wash pelleted cells with cold (4 °C) phosphate buffered saline (PBS) twice. Proceed to step A3.Centrifuge cells at 2,000 x g at 4 °C and aspirate PBS without disturbing the cell pellet. Keep cells on ice while pipetting PBS. To quench metabolism and extract metabolites, add 200 µl ice-cold 50% methanol/50% PIPES-EDTA to the cell pellet. To the quenched cell mixture, add 200 µl ice-cold chloroform and vortex vigorously for 45 min at -20 °C. (Note: This extraction length is important when extracting metabolites from organisms with cell walls including bacteria and yeast. A shorter extraction time of 5-10 min is adequate for mammalian cells. Vigorous vortexing is most effective for metabolite extraction. Use of a multi-tube vortex mixer head is recommended.) Afterwards, centrifuge at 21,000 x g at 4 °C for 10 min. Collect upper, water/methanol phase in a clean labeled tube. This is the first metabolite extract. Place tube on ice. Re-extract the chloroform phase by adding 200 µl of ice-cold 50% methanol/ 50% PIPES-EDTA. Vortex for 1 min and centrifuge again at 21,000 x g at 4 °C for 10 min. Just as before collect the upper, water/methanol with the extract from step A5. Freeze the extract until analysis.Detection and quantification of tryptophan and kynurenineAnalyze metabolites from cell culture media and from cell extracts by HPLC.",
    "To separate and quantify tryptophan and kynurenine, inject 5-20 µl (Note: The required injection volume will vary depending on the concentration of metabolite in the sample and is a recommended range.) of the cell extract obtained from step A7, spent culture media collected in step A2, or the cell-free media collected from step A1 in an HPLC equipped with an ultra-sensitive diode array detector and a Hypersil GOLD C18 column (50 x 2.1 mm, 3 µm), which is a reverse phase column packed with spherical, fully porous ultrapure silica. Set column temperature to be maintained at 30 °C. Use an isocratic mobile phase of 15 mM potassium phosphate (pH 6.4), with 2.7% (v/v) acetonitrile with a flow rate of 0.8 ml/min. The run time should be set for 10 min. Quantify the area under the peaks that display absorbance at 286 nm and 360 nm to calculate the concentration of tryptophan and kynurenine, respectively, in the samples. Generate standard curves ranging from 0 to 200 µM for both tryptophan and kynurenine and other metabolites of interest as well as any internal standard (if applicable) using authentic standards. Standards of each concentration should be prepared in triplicate and measured in triplicate. A recipe for a standard mix is included in the Recipes section. Note: Details of standard curve generation will vary depending on the chromatography system and data analysis software used. Consult the manufacturer’s documentation to generate a standard curve with your instrument’s software."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Biochemistry",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}