{
  "id": 9562,
  "origin_website": "Jove",
  "title": "Monitoring Changes in the Intracellular Calcium Concentration and Synaptic Efficacy in the Mollusc Aplysia",
  "procedures": [
    "1. Preparation\nAnesthetize the animal by injecting 75-100 ml isotonic magnesium chloride solution.  The Aplysia we use for imaging are generally 150-200 grams and are obtained from Marinus Scientific.    \nPin the anesthetized animal to a wax covered dish. Syringe needles work well for this purpose; sterile techniques are not necessary.  Using gross forceps and standard scissors make an incision in the animal's foot and expose the buccal mass.  Locate the buccal ganglion.  Using spring scissors and fine forceps, carefully free the ganglion by cutting all buccal nerves. \nRemove the ganglion and place it in a Sylgard coated dish containing artificial seawater.  Place a few insect pins through the buccal nerves to stabilize the ganglion. Desheath the buccal ganglion using ultrafine forceps and spring scissors, so as to expose the neurons for intracellular recording.  Then re-pin the ganglion using about 15 fine insect (minutien) pins.  The ganglion must be held firmly in place as any movement will be problematic during imaging. \n2. Prepare Electrodes\nPull electrodes using glass capillary tubing with filament (e.g. WPI TW100F-4) and a puller.  Settings should be individually determined to create electrodes of the required resistance.  When filled with 3 M KAc (potassium acetate) our electrode resistance is generally about 10 MOhms if the electrodes are to be beveled, or about 5 MOhms if the beveling step is omitted.    \nFill one set of electrodes with a solution containing 3 M KAc/30 mM KCl using a syringe and microfil needle.  These electrodes will be used for electrophysiology.",
    "Fill a second set of electrodes with the calcium indicator dye by dipping the back end of the electrode in dye, previously reconstituted with approx. 40 μl distilled water for 500μg dye. When the tip of the electrode has filled, back fill about 1/4 inch of the end of the electrode with 200 mM KCl to ensure good electrical contact. \nIt is beneficial to bevel the electrodes, as this facilitates dye injection and reduces the damage done by multiple membrane penetrations. We use a custom beveler that generates a stream of a salt water / alumina powder suspension. The electrode is mounted in a holder and its tip enters the stream at a 45° angle. Electrode resistance is continuously monitored and the beveling terminated when the resistance reaches about 5 MOhm for KAc filled electrodes. The dye filled electrodes are beveled for an equal amount of time and typically have resistances of 15-20 MOhm. \n3. Loading the Calcium Indicator Dye\nPlace the preparation on an electrophysiology rig and visually locate the presynaptic neuron of interest.  Many of our experiments are done with an identified sensory neuron utilized during feeding, B21 5, 6. The relatively fixed position, size (~100 μm), and elongated shape of B21's soma make it easy to locate.\nImpale the neuron of interest with an electrode containing the calcium indicator dye. B21's identity can be verified by impaling the post-synaptic neuron B8. Depolarization of B21 with  ~8 nA current will trigger spikes and result in facilitating PSPs in B8 7.",
    "Inject dye in the presynaptic neuron of interest by passing hyperpolarizing pulses (typically -15 nA, 1 Hz, 75% duty cycle) for approximately 30 minutes.  If dye loading is successful, the neuron's soma will acquire a faint pink color.  Remove the dye-containing electrode by slowly withdrawing it from the neuron. \nLeave preparations for approximately 30 minutes to allow the dye to diffuse into the fine processes that make synaptic contact with follower neurons. \n4. Calcium Imaging and Electrophysiological Recording \nPlace the preparation on the imaging microscope. The dish with the preparation is held on a cooling platform with pieces of Permagum sealing cord which, unlike clay, remains sticky when wet. The fixed stage microscope focuses by moving the objective. The stage remains stationary, which allows attaching magnet mounted manipulators. As the high magnification makes vibrations (especially lateral movement) a problem, the entire imaging setup should be placed on a vibration isolation platform.    \nImpale presynaptic and postsynaptic neurons with electrodes containing normal electrolyte solution.",
    "Select a filter block suitable to image Calcium Orange (excitation 549 nm, emission 576 nm) 8 and adjust the camera.  Most scientific CCD cameras allow the investigator to choose a subset of CCD cells that are read out.  Additionally, cells can be combined (binned).  Selecting a smaller subset increases speed, while binning increases sensitivity. These two settings, together with the exposure time, determine the frame rate i.e. how many images can be acquired per second. Suitable settings will image an area of 580 x 350 μm2 with 500 x 300 pixels (using a 10x lens and a 0.5x camera adapter). Add neutral density filters to the light path to adjust the illumination intensity to the minimal amount that provides correct exposure with an exposure time <25 ms. These settings should result in a frame rate of about 30 Hz - which in Aplysia is fast enough to image single spike evoked calcium alterations. Finally, close the field aperture so that only the imaged area is illuminated.    \nIn the imaging software mark the neuron's regions you want to measure. In the Elements AR software this is done in the \"Time Measurement\" section by placing regions of interest (ROIs). B21 is a bipolar neuron and previous work has demonstrated that its lateral process contacts the postsynaptic neuron of interest 9.  We generally image primary, secondary, and tertiary branches of the lateral process by placing a ROI over each part of the neuron.  An additional ROI next to the dye filled neuron is measured to provide a background value that is later subtracted from all other data points.",
    "Instruct the electrophysiology acquisition (in these experiments Spike II) to wait for a trigger signal provided by the \"frame readout\" signal of the camera.  Start the image acquisition (Elements AR); Spike II will now automatically start recording when the camera takes its first frame.  You can also use a TTL output of the Power 1401 to briefly turn on a LED mounted in the microscope's camera port.  This will provide a signal to subsequently synchronize imaging and electrophysiological data.    \nStimulate the presynaptic neuron by injecting a series of brief depolarizing current pulses at the desired frequency.  It is important to monitor each pulse (e.g. with a stimulus triggered oscilloscope) to determine whether an action potential is successfully generated.  While Calcium Orange is very photo-stable compared to other dyes, it is a good idea to record a control trial without stimulation to check how much dye bleaching occurs. \nIn experiments in which intracellular calcium concentrations are manipulated, a drug such as EGTA is introduced into the presynaptic neuron and the stimulation and data acquisition steps described above are repeated. \n5. Analysis of Representative Data\nExport the imaging data (the list of measured intensity values for each ROI) by writing it into a text file.  A custom script in Spike II can then import the text file.  This script also normalizes the values with the individual probe's area, and subtracts the value of the background probe.  The data points are then plotted alongside the electrophysiology data as a \"virtual RealWave\" channel.  The \"channel process / time shift function\" in Spike II is used to precisely align the imaging data points, using the LED signal as reference.",
    "To obtain values as percent change, analyze the imaging data by calculating the relative change in fluorescence as dF/Fo= (F-Fo)/ Fo.  Fo denotes the fluorescence level just before the stimulus and F the fluorescence during the stimulus. \n6. Representative Results\nimgsrc://cloudfront.jove.com/files/ftp_upload/3907/3907fig1.jpg\nFigure 1.  Overall scheme of the experiment. Experiments are conducted in a ganglion preparation of Aplysia.  Changes in intracellular calcium are imaged with a fluorescent dye, which is iontophoretically introduced into the presynaptic neuron.  Pre- and postsynaptic neurons are then impaled with sharp electrodes so that synaptic transmission can be induced and monitored.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3907/3907fig2.jpg\nFigure 2.  Calcium imaging and intracellular recording from identified neurons in the buccal ganglion of Aplysia.  (A)  Photo of the imaged lateral branch of neuron B21. The box indicates the measured region of interest. (B1)  Intracellular stimulation of B21 evokes action potentials (bottom trace) and facilitating postsynaptic potentials (PSPs) in the postsynaptic follower neuron B8 (middle trace) causing it to also fire action potentials.  Increases in presynaptic calcium fluorescence are shown in the top trace.  (B2)  Effect of presynaptic EGTA on homosynaptic facilitation.  EGTA was intracellularly injected into B21 ~ 15 minutes before intracellular stimulation.  It is thought that EGTA is a slow acting calcium chelator, which at low concentrations is not fast enough to suppress synaptic transmission. Note the reduction in the widespread calcium signal and the corresponding decrease in PSP amplitude. (C) The PSP amplitude correlates with the presynaptic calcium signal.  Click here to view larger figure[href=http://www.jove.com/files/ftp_upload/3907/3907fig2large.jpg].Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}