{
  "id": 15954,
  "origin_website": "Jove",
  "title": "Identification of Hemolytic and Phospholipase Activity in Crude Extracts from Sea Anemones by Straightforward Bioassays",
  "procedures": [
    "The sea anemones were collected according to guidelines of the National Commission for Aquaculture, Fisheries, and Food of the Federal Government of Mexico (permit number PPF / DGOPTA 07332.250810.4060). Bioethics Committee of the Institute of Biotechnology, National Autonomous University of Mexico approved all the experiments with sea anemones. The sheep blood sample was purchased at the Center for Practical Teaching and Research in Animal Production and Health (CEPIPSA, National Autonomous University of Mexico).\n1. Organism collection\nCollect sea anemone A. dowii.\n\tNOTE: Here, the organisms were collected during low tide periods in the intertidal zone off the coast of Ensenada Baja, California, Mexico (Figure 1A,B).\nTransport the organisms to the laboratory in containers with seawater (Figure 1C).\nIn the laboratory, clean the organisms with distilled water by hand to remove the big substrate particles adhering to the body.\nImmediately freeze the organisms at -80 °C in an ultra-freezer for 72 h.\nPlace the organisms in special glasses for freeze-drying, with lyophilization conditions of -20 °C, 0.015 psi, for 48 h.\nStore the lyophilized organisms at -20 °C until use.\n2. Tissue hydration\nReconstitute 20 g dry weight of lyophilized organisms with 60 mL (1/3 w/v) of 50 mM sodium phosphate buffer, pH 7.5, and 1 inhibitor cocktail tablet (Table of Materials).\nIn a magnetic stirrer, continuously stir the sample at ~800 rpm, 4 °C, for 12 h.\n3. Toxin release\nTo induce cell lysis and nematocyst discharge, freeze the sample at -20 °C for 12 h, and then place the container in water at room temperature (RT) until it thaws up to 90%. Repeat this procedure three times.\n\tNOTE: The sample does not thaw 100%; it is crucial to maintain the sample at ~4 °C to prevent protein degradation.",
    "Observe the nematocyst discharged under a confocal microscope. Take 10 µL of the sample on a slide and place a coverslip over it. Observe under a confocal microscope at 100x and 60x magnification. Here a dye was not necessary.\nProcess the images captured in the confocal microscope in ImageJ software (version 1.53c, Wayne Rasband, National Institutes of Health, USA, https://imagej.nih.gov/ij).\nIf the tubule inside the nematocyst uncoils and is outside, the nematocysts are discharged; then, continue with the next step. Otherwise, only conduct one more freeze-thaw cycle.\nTo clarify the extract, centrifuge the sample at 25,400 x g for 40 min, 4 °C, recover the supernatant, and centrifuge it again. Repeat this step 3-4 times.\nRecover the supernatant and discard the pellet. The supernatant or crude extract contains the venom components (toxins) and other cell molecules, such as lipids, carbohydrates, and nucleic acids.\n4. Quantitation of total protein\nDetermine the protein concentration of the crude extract using a commercial Bradford colorimetric assay15 kit (Table of Materials).\nDilute the dye reagent (one part of dye with four parts of distilled water).\nPrepare bovine serum albumin (BSA) Fraction V (Table of Materials) solution at 1 mg/mL concentration in phosphate buffer (50 mM sodium phosphate, pH 7.5).\nPrepare the solutions listed in Table 1 in triplicate.\nVigorously mix each solution in a shaker for 4 s.\nIncubate the samples for 5 min at RT, without shaking.\nMeasure absorbance (AU) at 595 nm.\nPlot the averages of the sample BSA absorbances (AU vs. protein concentration), and determine the equation of the graph (Equation 1).\nimgsrc://cloudfront.jove.com/files/ftp_upload/63630/63630eq01.jpg     Equation 1\n\twhere y is the absorbance, m is the slope of the line, x is the protein concentration, and b is the y-intercept. To calculate crude extract concentration, solve for the x as follows:\nimgsrc://cloudfront.jove.com/files/ftp_upload/63630/63630eq02.jpg     Equation 2",
    "5. Determine polypeptide venom complexity\nAssemble the glass container for vertical gel electrophoresis according to the manual.\nPrepare acrylamide mix (30%): 29.2 g of acrylamide, 0.8 g of bis-acrylamide, the final volume of 100 mL. Filter the solution using a 0.45 µm membrane. Store the solution in a dark bottle at 4 °C. Then, prepare the mixture for the resolving gel (Table 2).\nThe SDS-PAGE gel consists of a resolving gel and a stacking gel. Prepare the gels as per the solution volumes defined in Table 2. During preparation, ensure to maintain each mix at 4 °C to reduce polymerization time.\n\tNOTE: The volume of each mixture varies depending on the brand of equipment used; for this protocol, the volumes correspond to the preparation of 15% acrylamide gel, 0.75 mm thick, for a vertical electrophoresis chamber (Table of Materials).\nAfter the acrylamide has polymerized, ~10 min, add the mixture of stacking gel.\nPrepare the mixture for the stacking gel, immediately add it to the glass plates, and place a comb to form the wells for loading the samples.\nOnce the stacking gel has polymerized (~15 min), remove the comb and place the glass container in a chamber for vertical electrophoresis.\nPlace 200 mL of electrode buffer (0.25 M Tris, 0.192 M glycine, 0.1% SDS) in the electrophoresis chamber.\nAnalyze the crude extract: Mix 30 µg of crude extract with 5 µL of protein loading buffer (25% glycerol, 15% sodium dodecyl sulfate, 25% 2-mercaptoethanol, 0.125 mM Tris pH 7, bromophenol blue 0.1 mg/mL) to denature proteins. The final volume must be <50 µL.\nHeat at 90 °C for 5 min, cool, and centrifuge for 3 s at 1,400 x g.\nLoad the samples in the wells of the stacking gel. Load a standard molecular weight ladder.",
    "Run electrophoresis at 25 mA constant for 1 h 30 min.\nRemove the glass containers from the electrophoresis chamber to proceed with the staining of the gel proteins.\n6. Protein staining\nRinse the gel in 50 mL of distilled water to remove debris from the buffer electrode.\nDiscard the water.\nTo avoid the diffusion of the gel proteins, add the fixation solution (60 mL of ethanol, 20 mL of acetic acid, and 20 mL of distilled water, final volume 100 mL). Incubate at RT for 40 min with shaking at 80 rpm. Decant the solution.\nAdd the protein crosslinking solution (15 mL of ethanol, 0.25 mL of glutaraldehyde, 50 mL of distilled water, final volume 65.25 mL), and incubate for 30 min at RT with shaking at 80 rpm. Remove the solution.\nWash the gel with 100 mL of distilled water for 5 min, and remove the water. Repeat this procedure four times.\nCarry out protein staining with 50 mL of Coomassie brilliant blue R-250 filtered solution (40% methanol, 10% acetic acid, 50% distilled water, 0.1% dye, final volume 100 mL), stirring at 60 rpm in a laboratory rotary oscillator at RT for 15 min.\nRecover the solution, which can be used to stain other gels.\nTo eliminate the excess dye, add a destaining solution (40 mL of methanol, 10 mL of acetic acid, 50 mL of distilled water). Keep stirring (80 rpm) at RT until the bands (stained proteins) visualize.\nKeep the gel in 50 mL of distilled water and scan the image in a Gel documentation system.\n7. Prepare red blood cell solution\nExtract 1 mL of blood from the jugular vein of a sheep.",
    "Remove the needle from the syringe and immediately drain blood into a tube with 50 mL of Alsever solution (0.002 M citric acid, 0.07 M NaCl, 0.1 M dextrose, and 0.027 M sodium citrate as an anticoagulant, pH 7.4).\nSlowly invert the solution three times.\nKeep at 4 °C for transfer to the laboratory.\nCentrifuge at 804 x g for 5 min at 4 °C and discard the supernatant.\nResuspend the pellet in 30 mL of Alsever solution. Add the solution by sliding it along the tube's inner walls and, using a Pasteur plastic pipette, slowly resuspend the cells. Centrifuge again at 804 x g for 5 min, 4 °C. Repeat this procedure until the supernatant is clarified.\nAdd 15 mL of Alsever solution; resuspend the pellet slowly with a Pasteur plastic pipette.\nMaintain the final volume of Alsever solution to achieve a concentration of 2 x 106 cells/mL, approximately. Then, use a Neubauer chamber or hemocytometer to count the cells.\n\tNOTE: Count the erythrocytes in the hemacytometer slide (Improved Neubauer). The slide is a 30 mm x 70 mm x 4 mm slide. The center has two silver footplates (Figure 2A) (one top and one bottom grid), each 3 mm x 3 mm, and two channels on the sides of the grid. Counting cells is in the corner and center squares (red squares in Figure 2B). The optimal concentration of cells for counting should be in the order of 106 cells. The central box has a surface area of 0.1 cm2, which is equivalent to 0.0001 mL.\nPlace a coverslip over the slide.\nPlace 10 µL of the sample between the slide and the coverslip and wait for the sample to disburse.",
    "In an optical microscope (magnification 60x), perform the count in the first square box. Count only the cells in the center grid and those that touch the upper or the left margin of the box.\nDetermine cell concentration using the following equation:\nimgsrc://cloudfront.jove.com/files/ftp_upload/63630/63630eq03v4.jpg Equation 3\n\tIf the sample is very concentrated and dilution is required, then use the following equation:\nimgsrc://cloudfront.jove.com/files/ftp_upload/63630/63630eq04v3.jpg Equation 4\n\tNOTE: When taking the erythrocyte solution for the hemolysis test, slowly homogenize the solution with a plastic Pasteur pipette.\nPerform the steps in triplicate to reduce error.\n8. Hemolysis assay\nPrepare the solution mixtures (in triplicates) indicated in Table 3 in conical 96-well plates.\n\tNOTE: Mix the erythrocytes slowly to maintain a homogeneous suspension.\nIncubate for 1 h at 37 °C, without shaking.\nCentrifuge the plate at 804 x g for 5 min at 4 °C.\nRecover the supernatant in another 96-well plate with a flat bottom.\nIf the crude extract contains cytolysins, erythrocytes will lyse and release hemoglobin. Read the absorbance at 415 nm.\nCalculate hemolysis percentage, using the following equation:\n\t% Hemolysis = ((Acrude extract-AAlsever buffer) / (AH2O-AAlsever)) x 100\n\tNOTE: Acrude extract, AAlsever buffer, and AH2O correspond to the absorbance of erythrocytes with the crude extract, absorbance of Alsever solution, and absorbance of distilled water, respectively.\nPerform a hemolysis test before and after each freezing and thawing cycle with 50 µg of total protein from the crude extract.\nDetermine the number of freezing and thawing cycles required to reach 100% hemolytic activity.\nCalculate the amount of extract that produces hemolysis in 50% of the erythrocytes (HU50); follow the same protocol described in Table 3, increase the amount of sea anemone crude extract, and design the plot with sigmoidal adjustments using appropriate software (e.g., Origin, Table of Materials).\n9. Phospholipase assay",
    "Wash one chicken egg with 1% SDS in distilled water.\nSeparate the egg yolk from the egg white under sterile conditions.\nPrepare 50 mL of 0.86% NaCl solution, and filter through a 0.22 µm filter. Then, prepare Solution A: Add 12 mL of egg yolk and 36 mL of 0.86% NaCl solution.\nPrepare Solution B: Mix 300 mg of agarose in 50 mL of buffer (50 mM Tris, pH 7.5), filter through a 0.22 µm filter. Heat the solution in a microwave until boiling. Cool down in warm water to reach 43-45°C.\nPrepare Solution C: Prepare 10 mM CaCl2 and filter it with a 0.22 µm filter.\nPrepare Solution D: 10 mg of rhodamine 6G in 1 mL of distilled water.\nUnder sterile conditions (laminar flow hood), add 500 µL of solutions A and C to solution B and 100 µL of solution D, mix, and pour 25 mL into each Petri dish (90 x 15 mm).\nWait for the solution to solidify under sterile conditions (30 min).\nMake wells (~2-3 mm diameter) with a thin tube.\nAdd a total of 20 µL of phosphate buffer (negative control) in one well and 20 µL of a determined phospholipase (positive control) in another well.\nPlace different amounts of the crude extract protein, 5, 15, 25, 35, 45 µg, in the remaining wells, each in a final volume of 20 µL.\nWait for the agar to adsorb all the samples (30 min).\nIncubate at 37 °C for 20 h.\nIf a halo forms around the well, this indicates phospholipase activity. Measure the halo formed with a vernier caliper.\n\tNOTE: Perform the experiment in triplicate (steps from 9.1-9.14).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}