{
  "id": 19171,
  "origin_website": "Jove",
  "title": "Spheroid Assay to Measure TGF-β-induced Invasion",
  "procedures": [
    "1. Preparation of the methocel solution (500 mL)\nAutoclave 6 g of methylcellulose in a 500 ml bottle containing a magnetic stirrer.\nDissolve the methylcellulose in 250 ml of preheated DMEM/F12 without serum (60°C) for 20 min.\nAdd 250 ml of DMEM/F12 (RT) containing 10% horse serum. Mix overnight (4°C).\nClear the solution by centrifugation (5000g, 2h, 4°C).\nTake the clear highly viscous solution to a new tube (about 90-95% of the stock solution).\nStore at 4°C until use.\n2. Spheroid culture\nPrepare a 20% methocel solution (10 ml methocel and 40 ml growth medium).\nWash cells twice with PBS, add 0.1% trypsin and incubate cells at 37 °C\nResuspend cells in growth medium and count the cells.\nPrepare a suspension of 10 000 cells per ml in 20% methocel.\nAdd the cell suspension to the 96 well round bottom suspension plates (100 μl per well).\nNext day, check the spheroid formation in the suspension plates. Spheroids will be ready for use after 1-3 days.\n3. Preparation of collagen\nPrepare on ice a solution of 8 ml collagen, 1 ml 10x PBS, 1 ml 0.1 N NaOH and 3 drops 0.1 N HCl. Check if pH is 7.4 by spotting some of the solution on pH indicator strips. Adjust pH if out of range.\nAdd 50 μl of neutralized collagen solution in the wells of a 96 well plate\nIncubate at 37°C until the collagen is solidified (90 min).\nPrepare methocel-collagen-ligand solutions on ice: for each ligand pipette 1 part of of collagen solution. Add 20 ng per ml of collagen TGF-β. After dilution with methocel and diffusion over the different layers, the final concentration of TGF-β will be 5 ng/ml Mix by vortexing. Add 1 part of methocel- solution. Mix by vortexing.\n4. Spheroid embedding",
    "Place a 200 μl tip which has approximately 5 mm of the tip cut off, on a 200 μl pipette.  Suck up one spheroid with the pipette and carefully dispense the medium into an empty plate. Watch if the spheroid stays inside the tip. The spheroid is visible as a white dot. Without releasing the plunger, suck up 100 μl collagen-methocel mixture and dispense the spheroid in the collagen mixture into a collagen-coated 96 well. Do this for 12 spheroids for each condition.\nLet collagen solidify at least 30 minutes at 37°C\nRemove air bubbles with a 200 μl tip.\nAdd 50 μl of medium with 1.6 % serum and inhibitors dissolved in DMSO. For SB-431542 add 4 μl of stock solution (10 mM) to 1 ml of medium. After diffusion, the final concentration of the inhibitor will be 10 μM. TGF-β and inhibitors will stay the course of the experiment. Take pictures of the spheroids under the microscope using 40X magnification.\nAfter 48h of stimulation with TGF-β and/or inhibitors, take pictures of the spheroids under the microscope using 40X magnification.",
    "Measure the area of the invading spheroids after 2 days and subtract the starting area. Measuring the area of a spheroid: Open the picture from the spheroid in Adobe Photoshop Extended (figure 2A) and select the Quick Selection tool (figure 2B). The mouse pointer changes into a circle with a 'plus' (+) sign (figure 2C). While dragging the cursor over the spheroid, Photoshop will recognize the borders of the spheroid. If an area outside the spheroid is selected, this region can be excluded from the selection by pressing the Alt key or by using the negative selection tool which is indicated by a (-) sign in the toolbar. The cursor changes into a circle with a 'minus' (-) sign and by dragging the cursor over the wrongly selected area, this area is removed from the selection (figure 2D). If necessary, multiple regions can be selected by pressing the Shift button. To work more accurately, the size of the mouse pointer can be adjusted by changing the brush diameter in the toolbar (figure 2E). When the whole spheroid is selected, the area of the selection is calculated via ANALYSIS-MEASURE in the menu bar or by pressing Ctrl + Shift + M (figure 2F). The measurement recording window will appear showing the file name and the area of the selection in pixels, as well as other data (figure 2G). If multiple selections are measured, the first line shows the sum of all the areas. The measurements of the individual selections are presented in the lines below. The data of all the measurements can be exported into a text file and opened in Excel.\n5. Representative results:",
    "An example of the spheroid assay with MCF10A1 (M1) normal breast epithelial cells, H-RAS transformed MCF10AneoT (M2) cells and M2-derived MCF10CA1a (M4) is given in Figure 3. M1 cells showed only weak invasion without stimulation, but invaded significantly better upon stimulation by TGF-β. In contrast, the RAS-transformed M1-derivative M2 invaded already efficiently without addition of stimuli, and this was further increased 4-5 fold upon TGF-β treatment. M4 cells showed the strongest invasion, both with and without TGF-β addition.\nNext, we examined whether we could interfere with TGF-β-induced invasion in this spheroid model using chemical inhibitors. For this purpose we used SB-431542, an ATP analogue and selective inhibitor of the kinase activity of TβRI, as well as activin type IB receptor (ActRIB) and activin receptor-like kinase (ALK)712. As expected, SB-431542 potently inhibited TGF-β-induced invasion of M1, M2 and M4 cells (Fig 4), indicating that TGF-β-induced invasion is TβRI-kinase dependent. In addition, the basal invasion of the spheroids was also strongly inhibited, suggesting that basal invasion is also dependent on TGF-β.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3337/3337fig1.jpg\nFigure 1. Flow chart of the 3D spheroid assay. First, cells are plated under non-adherent conditions in u-shaped suspensions plates. Cells aggregrate into multcellular spheroids and can be embedded into a collagen matrix. Into this collagen matrix, they are able to invade.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3337/3337fig2.jpg",
    "Figure 2. Quantification of the area of the spheroids using Adobe Photoshop Extended. (A) The picture of the spheroid is opened in Adobe Photoshop Extendend (B) Selection of the Quick Selection tool (C) Dragging the cursor over the spheroid to select the area of the spheroid (D) Removal of a wongly included area using the negative Quick Selection tool (E) Adjustment of the brush size of the Quick Selection tool to more accurately select the area (F) Selection of the measurement command to record (G) Example of a measurement record.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3337/3337fig3.jpg\nFigure 3. TGF-β-induced invasion of spheroids of spontaneously immortalised MCF10A1 (M1) (A), RAS-transformed MCF10AneoT (M2 (B) and its metastatic derivative MCF10CA1a (M4) (C). M1, M2 and M4 spheroids embedded into collagen were treated with 5ng/ml of TGF-β for 48h as indicated. A-C Representative pictures taken at the day of embedding and two days later. D Relative invasion was quantified as area difference on day 2 minus day 0. The results are expressed as mean ± s.d. Adapted from13.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3337/3337fig4a.jpg\nimgsrc://cloudfront.jove.com/files/ftp_upload/3337/3337fig4b.jpg\nFigure 4. Basal and TGF-β-induced spheroid invasion is inhibited by SB-431542. M1, M2 and M4 spheroids were embedded into collagen and treated with 5ng/ml TGF-β and/or 10 μM SB-431542 as indicated. Representative pictures taken after 2 days (A). Relative invasion was quantified as area difference on day 2 minus day 0 (B). The results are expressed as mean ± s.d. Adapted from13.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}