{
  "id": 19790,
  "origin_website": "Wiley",
  "title": "Isolation, In Vitro Differentiation, and Culture of Murine Megakaryocytes From Fetal Liver and Adult Bone Marrow",
  "procedures": [
    "This protocol describes the isolation of murine BM MKs by MACS with CD61 MicroBeads from Miltenyi Biotec. MKs are rare BM cells that have to be enriched and purified for mRNA or protein studies. There are several hematopoietic compartments that can be used to isolate stem and progenitor cells (hematopoietic stem cells [HSCs]) for in vitro MK differentiation. However, simple suspension culture does not mimic the complex in vivo MK niche leading to differences in, for example, polyploidy or DMS characteristics. Studies that aim to decipher in vivo conditions of MK biology thus require their direct isolation from the BM or spleen. MACS represents a method to harvest cells based on minimal labeling of cells with superparamagnetic beads combined with a strong magnetic field in MACS columns. The MicroBeads used in this protocol are biologically inert and therefore do not interfere with downstream analyses, such as flow cytometry or even in vivo use for HSC transplantation.\nDirect positive selection is described in this protocol of MKs from murine BM with CD61 MicroBeads and Large Cell Separation Columns from Miltenyi Biotec. Alternatively, cells can be labeled and isolated by using a sandwich approach with a primary antibody (either unconjugated or fluorophore/biotin conjugated) combined with the respective MicroBeads. The choice of which type of separation column should be used depends on the isolation method (positive selection or depletion), the target cell size, and cell number. Isolation of MKs with Large Cell Columns provides the best yield and purity in our hands, but isolation can also be done with LS columns (Miltenyi Biotec). This protocol can be adapted for equivalent magnetic labeling reagents from other manufacturers.\nMaterials\nMACS buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.783#cpz1783-rec-0002])\nAdult mice\nDulbecco's phosphate-buffered saline (DPBS; e.g., Sigma-Aldrich)\nTrypan blue (e.g., Thermo Fisher Scientific)",
    "Surgical equipment for harvesting bones including forceps and scissors\n0.5- and 1.5-ml reaction tube\n18-G cannula\nMicrocentrifuge\n70-µm cell strainer (e.g., Pluri Select)\n15- and 50-ml conical tubes\nNeubauer hemocytometer\nCentrifuge\nCD61 mouse and rat MicroBeads (e.g., Miltenyi Biotec)\nLarge Cell Separation Column (e.g., Miltenyi Biotec)\nMagnetic separator (e.g., MiniMACS Separator, OctoMACS Separator; Miltenyi Biotec)\n23-G needle\nAdditional reagents and equipment for mouse euthanasia (see Current Protocols article: Donovan & Brown, 2006[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.783#cpz1783-bib-0007])\nDissect mice and isolate bone marrow\n1. Prepare MACS buffer as described in Reagents and Solutions.\nMACS buffer should be freshly prepared and kept cold at 2°C to 8°C. Higher temperature may increase unspecific binding of beads.\nEDTA may be replaced by other anticoagulants such as citrate dextrose formula-A.\n2. Euthanize adult mice, and dissect femurs and tibiae. Clear bones from adherent muscle tissue, and cut open femurs and tibiae at one epiphysis. Punch a hole into the bottom of a 0.5-ml reaction tube using an 18-G cannula, and place bones with the open end down in the tube. Pipette 100 µl DPBS into a 1.5-ml reaction tube, and put 0.5-ml reaction tube into it.\nBM can also be isolated by cutting femurs and tibiae at both ends and flushing with buffer using a 20-G needle attached to a 5-ml syringe.\nIn order to increase the number of isolated cells and to keep mouse numbers low, BM from both femurs and tibiae can be used for MK isolation.\n3. Centrifuge 1 min at 2600 × g, room temperature, to spin out BM (Heib et al., 2021[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.783#cpz1783-bib-0011]), which should be visible as a red pellet. Resuspend BM pellet in 1 ml MACS buffer.",
    "4. Place 70-µm cell strainer on a 50-ml conical tube. Equilibrate strainer with 1 ml MACS buffer. Pass BM suspension through the cell strainer, and wash two times with 1 ml MACS buffer.\nSeparate MKs by MACS\n5. Determine cell number with a Neubauer hemocytometer and trypan blue.\nBoth femurs and tibiae yield ∼0.5–1 × 108 cells. To be able to determine the cell count properly, 10 µl BM samples should be diluted 1:100 with trypan blue.\n6. Centrifuge cell suspension 5 min at 200 × g, room temperature. Discard supernatant and resuspend BM pellet in 80 µl MACS buffer per 1 × 107 total cells.\nThe volumes for all reagents used depends on the Miltenyi protocol for efficient magnetic labeling and should be adjusted accordingly when reagents from another manufacturer are used.\n7. Add 20 µl MicroBeads per 1 × 107 cells, and incubate 15 min in the dark at 4°C.\n8. Adjust total volume to 500 µl per 1 × 107 cells with MACS buffer.\n9. Place Miltenyi Large Cell Separation Column in an appropriate MACS separator, and attach 23-G needle as a flow resistor to the column. Place 15-ml conical tube under the column to collect the flow through. Equilibrate column with 500 µl MACS buffer, and discard flow through.\n10. Load column with up to 2 × 108 total cells, and let cell suspension run through. Collect unlabeled cells as flow through.\nThe flow rate with flow resistor is low and may take a few minutes.\n11. Wash column three times with 500 µl MACS buffer, and collect unlabeled cells as flow through.\nApply buffer as soon as the column is empty.\n12. Remove column from magnetic separator and flow resistor. Place column on a new 15-ml conical tube.",
    "13. Pipette 1 ml MACS buffer on the column. Immediately use plunger supplied with the columns to flush out labeled cells.",
    "This protocol describes the preparation of an unsynchronized mouse MK suspension culture derived from fetal liver cells. The same protocol can be adapted for BM cultures (see Support Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.783#cpz1783-prot-0004]).\nBoth fetal liver and BM-derived MKs can be used for RNA or protein analyses and are suitable for typical MK assays, such as proplatelet formation (Fig. 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.783#cpz1783-fig-0001]) or spreading. However, there are a few differences between both types of MK culture that need to be considered when choosing which one to use.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/75eb15b7-86eb-466f-beb4-8def0609bb5b/cpz1783-fig-0001-m.jpg</p>\nFigure 1\nBright field images of murine megakaryocytes (MKs) cultured from adult bone marrow in liquid suspension. (A) Typical appearance of MKs, recognized by their large size, on culture day 4 after enrichment by bovine serum albumin density gradient. (B and C) Representative images of proplatelets extruded by single terminally differentiated MKs (arrows). These structures (inset) are <1 μm in width and are punctuated by swellings of 1 to 2 μm in diameter. Scale bars represent 50 μm.\nHarvesting fetal livers involves a substantial breeding effort that must be carefully timed. Fetal liver cells can therefore not be readily analyzed at any given time. In addition, these cells represent fetal hematopoiesis, which differs from adult hematopoiesis in several features. Fetal liver–derived MKs, for example, show a reduced degree of polyploidy, have an increased proliferative potential, and release more proplatelets compared with BM-derived MKs under identical conditions. One advantage is the generation of littermate controls, which are not influenced by environmental factors after birth. BM-derived MKs are not dependent on breeding and can therefore be isolated at any desired time, while representing adult hematopoietic cells. However, BM-derived MKs have a much lower capacity to form proplatelets compared with fetal liver–derived MKs and furthermore depend on the addition of hirudin for proplatelet formation.\nMaterials",
    "Single-cell suspension of mouse fetal liver cells (see Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.783#cpz1783-prot-0003]) or lineage-depleted BM (see Support Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.783#cpz1783-prot-0004])\nDulbecco's modified Eagle medium (DMEM) containing 10% (v/v) fetal bovine serum (FBS), with and without 50 U/ml penicillin and 50 μg/ml streptomycin\nRecombinant TPO (e.g., R&D Systems)\n1.5% and 3% (w/v) bovine serum albumin (BSA; e.g., Sigma-Aldrich, Serological) in DPBS, sterile and prewarmed to 37°C\n10-cm tissue culture dishes or 75-cm2 tissue culture flasks, sterile\n37°C, 5% CO2 humidified incubator\n15-ml conical tubes, sterile\nInverted microscope\nCentrifuge\nAdditional reagents and equipment for flow cytometry analysis (see Support Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.783#cpz1783-prot-0005]) or immunofluorescence staining (see Support Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.783#cpz1783-prot-0006])\n1. Transfer a single-cell suspension of mouse fetal liver cells or lineage-depleted BM in DMEM supplemented with 10% (v/v) FBS, antibiotics, and 50 ng/ml recombinant TPO at a density of 1–5 × 107 cells/ml to sterile 10-cm tissue culture dishes (10 ml) or 75-cm2 flasks (20 ml). Incubate 2 to 5 days at 37°C in a humidified 5% CO2 incubator.\nWe recommend using a single-cell suspension derived from ten 13.5 days postcoital (dpc) livers or six 14.5 dpc livers. For BM-derived MKs, three mice (8 to 12 weeks old) usually yield enough cells.\nThe day of tissue harvest and initial plating is regarded as day 0.\nThere is no need to change the medium or supplement with additional TPO over the culture period. The duration of culture depends on the desired degree of MK differentiation, which can be judged visually using an inverted microscope.\nMost subsequent manipulations should be performed in a laminar flow hood using aseptic technique.\n2. Prepare a two-step density gradient in a 15-ml conical tube: Pipet 1.5 ml prewarmed sterile 3% (w/v) BSA in DPBS first, and then gently overlay 1.5 ml prewarmed sterile 1.5% (w/v) BSA in DPBS.",
    "Pipette the second BSA layer very slowly with the tube tilted to ensure that the phases are not mixed. A good step gradient is visible as a difference in diffraction between the two liquid layers.\nFor larger cell cultures, a more-effective gradient can be constructed with 4 to 5 ml of each BSA solution in a 50-ml conical tube, which provides a larger surface area.\nThe quality of BSA is important for these experiments because low-grade albumin purifications often contain endotoxin and other impurities that are toxic to hematopoietic cells.\nThe gradient density is temperature dependent, and the best cell separation is achieved when the cell suspension and BSA solutions start at 37°C and equilibrate naturally to room temperature.\nWhen heterozygous animals are interbred, every fetus and liver has to be treated individually. DNA for genotyping can readily be isolated from a limb bud. A single liver becomes disintegrated by use of a 21-G needle, and the cell suspension is plated in 24 or 48 wells. On day 3 to 4 of culture, cells are resuspended in 0.2 ml medium, and the BSA gradient is performed in a microcentrifuge tube using 0.5 ml of each BSA solution with good yield.\n3. Aspirate cell suspension from culture days 2 to 5 into 15-ml conical tubes using a sterile 5- or 10-ml pipet. Rinse the bottom of each dish with 5 ml fresh DMEM supplemented with 10% (v/v) FBS to include cells that may adhere weakly to the plastic surface. Control the efficiency of this step by monitoring the dish under an inverted microscope.\nMost suspended round and ovoid cells should be recovered, whereas adherent fibroblast-like cells will remain behind.",
    "If preservation of proplatelet morphology is important, aspiration and flushing steps should be especially gentle, and pipets with a wide opening should be used. Standard tissue culture pipets are adequate.\n4. Centrifuge cell suspension 5 min at 200 × g, room temperature, and resuspend cell pellet in 1 ml DMEM supplemented with 10% (v/v) FBS. Overlay this solution on the 1.5% to 3% BSA step gradient with minimal agitation. Incubate 30 to 45 min at room temperature.\nWithin 15 min, white cells sedimenting through the lower BSA phase should be observed with the naked eye as the tube is gently moved so as not to disturb the gradient.\n5. Remove upper phase consisting of all but the lowest (sedimented) 0.5 to 0.8 ml.\nThe amount of BSA that should be left in the conical tube depends on the size of the MK pellet, as to not swirl it up during pipetting.\nThis collection represents small cells, including non-MKs and immature MK progenitors. The interphase is typically enriched for proplatelet-forming MKs and can be isolated separately.\nFor larger cell cultures with a gradient prepared in a 50-ml conical tube, all but 1 to 1.5 ml of the upper phase should be removed.\n6. Optional: Wash cells from the upper phase in DMEM once, and culture for an additional 3 to 5 days in the presence of TPO to generate a second wave of MKs.\nThis step should be carried out if the maximal number of MKs is required. Otherwise, the upper phase should be discarded. Cells can be replated into the used culture dishes, typically at the doubled concentration (i.e., supernatant of two dishes plated on one of the old ones).\n7. Resuspend harvested cells in 10 ml DMEM, and centrifuge again 5 min at 200 × g, room temperature.",
    "Mature MKs are significantly enriched in a nonpigmented cell sediment, which can contain >80% large, GPIX-positive cells. The most-advanced, proplatelet-forming cells are slightly less dense, however, and frequently sediment less efficiently under these conditions. These cells are often enriched in the central phase of the albumin gradient, separated from both the sedimented mature MKs and the floating small cells. If the experiment requires inclusion of low-density proplatelet-forming cells, they may be recovered from the intermediate phase of the density gradient, either separately from the sedimented pellet or in combination with it.\nBecause the yield of mature MKs can vary considerably between independent cultures, each culture should be analyzed for cell types.\n8. Analyze cells in the lower phase for MK-specific surface receptor proteins (see Support Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.783#cpz1783-prot-0005]) or by immunofluorescence staining (see Support Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.783#cpz1783-prot-0006]).\nMKs can be incubated at 37°C with 5% CO2 for an additional 1 to 2 days, although the total incubation time should not exceed 6 days. The addition of FBS and antibiotics to the medium is necessary only if cells are incubated >1 hr. A BSA gradient set up on day 3 or 4 allows the enrichment of proplatelet-forming MKs the following day.\nThe MKs can now be used for RNA or protein isolation and other cellular studies or can be cultured for 12 to 18 hr (overnight) in the presence of TPO to enrich for proplatelets and released nascent platelets. To facilitate proplatelet formation BM-derived MK cultures need to be additionally supplemented with 100 U/ml hirudin (e.g., Hyphen Biomed).\nCells tend to accumulate at the center of plates. Since proplatelet formation is dependent on the cell density, it will usually occur in the periphery of the culture.",
    "MKs can be plated on wells coated with different proteins present in the extracellular matrix like collagen, fibronectin, laminin, or other supporting (feeder) cell lines, but if this is not the primary scientific question, we recommend keeping the system simple for reasons of reproducibility.",
    "There are several waves of hematopoiesis in the mouse fetus, initially taking place in the yolk sac. During further development, the aorta-gonad mesonephros region is the next site of hematopoietic activity. Beginning from 10 dpc, HSCs colonize and proliferate in the fetal liver, which is therefore a rich source for HSCs during the time frame. This protocol describes the isolation of fetal liver tissue and the generation of MKs from fetal liver–derived HSCs. In order to achieve a maximum MK yield, livers from 14.5 dpc should be used over 12.5 dpc (lower MK yield) or 15.5 dpc (increased red blood cell contamination).\nDissection of pregnant mice and removal of fetal livers do not need to be performed under sterile conditions. However, we recommend subsequently moving to a sterile laminar flow hood for preparation of single-cell suspensions and culture of isolated cells in the presence of antibiotics.\nMaterials\nPregnant mice, 13.5 to 15.5 dpc\nHanks’ balanced salt solution (HBSS; e.g., Sigma-Aldrich) without calcium chloride, magnesium chloride, or magnesium sulfate, sterile\nDMEM containing 10% (v/v) FBS, 50 U/ml penicillin, and 50 μg/ml streptomycin\nRed blood cell lysis buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.783#cpz1783-rec-0004])\nRecombinant TPO (e.g., R&D Systems)\nSurgical instruments including sharp scissors and no. 5 fine-tip forceps\n10-cm petri dishes, sterile\n18-, 21-, and 23-G needles, sterile\n10-ml syringes, sterile\nInverted microscope\n15- or 50-ml conical tube, sterile\nCentrifuge\nAdditional reagents and equipment for mouse euthanasia (see Current Protocols article: Donovan & Brown, 2006[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.783#cpz1783-bib-0007]) and red blood cell lysis (see Current Protocols article: Kruisbeek, 2000[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.783#cpz1783-bib-0014]; for 15.5 dpc fetal livers only)\nDissect pregnant mice and collect fetuses\n1. Euthanize pregnant mice between 13.5 and 15.5 dpc. Use sharp scissors to make a small vertical mid-abdominal incision, and then gently tear the skin to expose the peritoneal and pelvic cavities.",
    "Outbred CD1 mice have a higher number of fetuses (usually 10 or more) compared with classical inbred strains (e.g., C57B6/J mice). Sv/129 have an overall low number of fetuses.\nAdult mice are anesthetized and sacrificed according to institutional guidelines, most commonly by CO2 asphyxiation or by cervical dislocation (often after isoflurane inhalation), as recommended by the Panel on Euthanasia of the American Veterinary Medical Association.\nAlthough an experienced person can prepare two or three mice at a time, we suggest processing one mouse at a time until step 4.\n2. Place uterus in a 10-cm petri dish containing sterile HBSS, and use sharp scissors to dissect it open on the side opposite the linear array of placental implantations.\nThe amniotic membrane is frequently ruptured at this step, without affecting the experiment adversely.\n3. Sever umbilical vessels with sharp scissors to isolate individual fetuses. Allow rapid, partial exsanguination of the fetuses, and then move them to a fresh petri dish containing sterile HBSS.\nPartial exsanguination avoids clouding of the subsequent dissection field by whole blood.\nRemove fetal livers\n4. Cut open fetal skin from the left side using a gentle tearing motion with two pairs of sterile fine-tip forceps. Using the same fine-tip forceps, isolate liver from any adhering connective tissue or gut segments, and transfer to a new dish containing DMEM supplemented with 10% (v/v) FBS, 50 U/ml penicillin, and 50 μg/ml streptomycin. Collect up to ten livers from 13.5 dpc fetuses or six livers from 14.5 or 15.5 dpc fetuses in 10 ml medium per 10-cm petri dish.\nThe liver is easily recognized as a large, deep red multilobed organ, filling nearly the whole abdominal cavity.",
    "The presence of antibiotics is recommended, as this does not seem to impair cell growth or differentiation but is certainly dispensable to suit experimental demands.\nPrepare single-cell suspension\n5. Attach a sterile 18-G needle to a sterile 10-ml syringe, and alternately aspirate and expel each tissue eight to ten times until it fragments into small pieces.\n6. Replace 18-G needle with a sterile 21-G needle, and aspirate tissue another eight to ten times.\n7. Inspect suspension under an inverted microscope to confirm that most of the tissue has been broken up into single cells. If there are still many cell clumps (i.e., tissue fragments), aspirate again using a 23-G needle.\n8. Pipet cell suspension into a sterile 15- or 50-ml conical tube, and allow any contaminating connective tissue or residual large cell clumps to sediment for 3 to 5 min. Transfer suspension into a fresh tube, and centrifuge 5 min at 200 × g, room temperature or 4°C.\nAlternatively, connective tissue and cell clumps can be removed with a 70-μm cell strainer on a 50-ml conical tube. The cell suspension is applied, and then the strainer is washed with 5 ml DMEM supplemented with 10% (v/v) FBS to avoid losses.\n9. For 15.5 dpc fetal livers, perform lysis of red blood cells. To do so, discard supernatant and resuspend cells in 1× red blood cell lysis buffer. Incubate suspension 10 min at room temperature, and centrifuge suspension 5 min at 200 × g, room temperature.\nSuccessful red blood cell lysis is indicated by a white cell pellet and red supernatant.\n10. Discard supernatant and resuspend cells in 10 ml DMEM supplemented with 10% (v/v) FBS, appropriate antibiotics, and 50 ng/ml recombinant TPO. Continue immediately with Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.783#cpz1783-prot-0002].",
    "MACS cell separation can be performed by positive selection of the target cells based on immunolabeling of a surface antigen or by negative selection of untouched cells through the depletion of unwanted cells. This protocol describes the generation of a BM stem and progenitor cell culture by MACS depletion of lineage-positive cells from a BM single-cell suspension by using a “lineage cocktail” for magnetic labeling.\nThis protocol describes the isolation of lineage-marker negative cells with the Lineage Cell Depletion Kit for murine BM and LS columns from Miltenyi Biotec. This protocol can be adapted for equivalent magnetic labeling reagents from other manufacturers.\nMaterials\nMACS buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.783#cpz1783-rec-0002])\nAdult mice\nDPBS (e.g., Sigma-Aldrich)\nTrypan blue (e.g., Thermo Fisher Scientific)\n1 ml biotin-antibody cocktail (i.e., lineage cocktail of biotin-conjugated monoclonal antibodies directed against lineage-specific cell surface markers): \n               \nCD5 (T cells)\nCD45R (B220; B cells)\nCD11b (macrophages)\nGr-1 (Ly-6G/C; granulocytes)\nLy6B.2 (neutrophils/monocytes)\nTer-119 (reticulocytes and erythrocytes)\nAnti-biotin MicroBeads (clone Bio3-18E7.2, mouse IgG1)\nDMEM containing 10% (v/v) FBS, 50 U/ml penicillin, 50 μg/ml streptomycin, and 50 ng/ml TPO\nSurgical equipment for harvesting bones including forceps and scissors\n0.5- and 1.5-ml reaction tube\n18-G cannula\nMicrocentrifuge\n70-µm cell strainer (e.g., Pluri Select)\n15- and 50-ml conical tubes\nNeubauer hemocytometer\nLS columns (e.g., Miltenyi Biotec)\nMagnetic separator (e.g., MidiMACS separator; Miltenyi Biotec)\nDissect mice and isolate bone marrow\n1. Prepare MACS buffer as described in Reagents and Solutions.\nMACS buffer should be freshly prepared and kept cold at 2°C to 8°C. Higher temperature may increase unspecific binding of beads.",
    "2. Euthanize adult mice, and dissect femurs and tibiae. Clear bones from adherent muscle tissue, and cut open femurs and tibiae at one epiphysis. Punch a hole into the bottom of a 0.5-ml reaction tube using an 18-G cannula, and place bones with the open end down in the tube. Pipette 100 µl DPBS into a 1.5-ml reaction tube, and put 0.5-ml reaction tube into it.\nEuthanasia of mice should be reduced to the lowest possible number. Follow your national and institutional guidelines.\nBM can also be isolated by cutting of femurs and tibiae at both ends and flushing with buffer using a 20-G needle attached to a 5-ml syringe.\nIn order to increase the number of isolated cells and to keep mouse numbers low, BM from both femurs and tibiae can be used for MK isolation.\n3. Centrifuge 1 min at 2600 × g, room temperature, to spin out the BM, which should be visible as a red pellet. Resuspend BM pellet in 1 ml MACS buffer.\n4. Place 70-µm cell strainer on a 50-ml conical tube. Equilibrate strainer with 1 ml MACS buffer. Pass BM suspension through the cell strainer, and wash two times with 1 ml MACS buffer.\nSeparate lineage-positive cells by MACS\n5. Determine cell number with a Neubauer hemocytometer and trypan blue.\n6. Centrifuge 5 min at 200 × g, room temperature, and discard supernatant.\n7. Resuspend cell pellet in 80 µl MACS buffer per 2 × 107 cells.\n8. Add 20 µl direct lineage depletion antibody cocktail per 2 × 107 cells.\n9. Incubate cells 10 min at 4°C to 8°C.\n10. Place Miltenyi LS columns in a suitable MACS separator, and place a 15-ml conical tube underneath. Equilibrate column with 3 ml MACS buffer, and discard flow through.",
    "11. Apply cell suspension to the column, and let cells pass through. Collect lineage-negative cell fraction in a 15-ml conical tube.\n12. Wash column three times with 3 ml MACS buffer, and collect flow through in the same tube as in step 11.\n13. Centrifuge flow through 5 min at 200 × g, room temperature, and resuspend cells in DMEM with 10% (v/v) FBS, 1% penicillin/streptomycin, and 50 ng/ml TPO. Immediately proceed with Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.783#cpz1783-prot-0002].",
    "This protocol describes the assessment of MK culture purity in response to Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.783#cpz1783-prot-0001] or comparable purification methods by using flow cytometry.\nCell number and purity are readily controlled by flow cytometry, which requires overall low number of cells. Mature MKs are readily recognized by their large size and high granule content, which can be detected by their scatter properties. MKs are high for both forward scatter and side scatter. The detection is typically set to linear settings, but depending on the type of flow cytometer used, a logarithmic setting might be better. MK progenitors are smaller and cannot be exclusively separated by light scatter properties. At least one lineage-specific marker should be added, which is typically fluorophore conjugated (Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.783#cpz1783-fig-0002]). We recommend antibodies directed against the fibrinogen receptor complex GPIIb/IIIa (CD41a) or the von Willebrand factor receptor complex GPIb/IX/V (CD42a-d). Of note, antibodies recognizing GPIIIa (CD61) alone are not recommended, as some leukocyte progenitor cells express CD61, in part with CD51. Flow cytometers should thus have at least two lasers, comprising the argon laser at 488 nm and one or more additional lasers (i.e., 640 nm). There might be specific consideration for the selection of new generation (tandem) fluorophores: 405-nm laser or 561-nm laser in case of protein-based fluorophores (e.g., dsTomato, Cherry). Compensation of fluorescence signals should be performed according to the manufacturer's instructions.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/b7c6e489-fa47-4aa0-9599-170988a3d6f1/cpz1783-fig-0002-m.jpg</p>\nFigure 2",
    "Flow cytometric analysis of bone marrow–derived megakaryocytes (MKs) during differentiation. (A) Side scatter (SSC) and forward scatter (FSC) properties for the detection of MKs directly after isolation (d0) and after 2 days of culture (d2). (B) MKs in culture are a heterogeneous cell population in terms of their maturation status. A clear separation of the distinct developmental stages during megakaryopoiesis based on the expression of surface receptors is challenging. Nonetheless, immature MKs can be distinguished from terminally differentiated MKs based on their expression of CD41 and CD42a. CD41highCD42ahigh MKs are considered to be more mature than CD41lowCD42alow cells. They are usually bigger and represent the proplatelet-forming MK population.\nMaterials\nMK sample (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.783#cpz1783-prot-0001])\nCATCH buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.783#cpz1783-rec-0001])\nFcγR block (clone 2.5G2; e.g., Cell Signaling)\nAnti-CD41/CD61 antibody, Alexa Fluor 647 conjugated (clone Leo.H4; e.g., Emfret)\nAnti-CD42a antibody, Alexa Fluor 405 conjugated (clone Xia.B4; e.g., Emfret)\n5-ml round-bottom FACS tubes (e.g., Corning)\nFlow cytometer\n1. Resuspend MK sample in 250 µl CATCH buffer in 5-ml round-bottom FACS tubes. Add 5 µg FcγR block, and incubate 15 min at room temperature.\n2. Add 1 µg anti-CD41/61 fluorophore-conjugated antibody and anti-CD42a fluorophore-conjugated antibody. Incubate 15 min at room temperature in the dark.\nWe recommend using the antibodies listed above for MK staining. In addition, a cocktail of lineage-specific antibodies (lineage cocktail) is recommended to stain for non-MK progenitor cells. Of note, CD45 is not suited for this, as it still expressed on MK precursors and shows a complex pattern of expression during fetal and adult hematopoiesis (Cortegano et al., 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.783#cpz1783-bib-0004]).\n3. Centrifuge cells 5 min at 300 × g, room temperature. Discard supernatant and resuspend pellet in 500 µl CATCH buffer.",
    "Use caution when pipetting the supernatant as the MK cell pellet is loose. Depending on the size of the MK pellet, we recommend leaving 200 to 500 µl buffer in the tube.\n4. Proceed with flow cytometry.\nMKs are not only very large cells, but they also show a broad spectrum of sizes. It is thus recommended to modify the initial settings and gains of all lasers to make sure that the signals do not accumulate in the first or last channel. Total BM cells might be used for the initial setup. Fluorescence channels are typically set in a logarithmic setting. Electronic threshold settings need to be considered in case cells of interest are lacking in the analysis window. Some flow cytometers provide the option of biexponential setting, which allows for better identifying very small or very large cells.",
    "This protocol describes immunofluorescence staining of cultured or directly isolated MKs for confocal laser scanning microscopy. The identification of MKs and MK progenitors has been made by immunohistochemical and immunofluorescence staining of cells or tissue sections. MKs of rodents express acetylcholinesterase, but this staining protocol is time and labor intensive and has nowadays been replaced with antibody-based markers. Surface markers are mostly used (Fig. 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.783#cpz1783-fig-0003]), but other lineage-specific markers (like β1-tubulin) can also be used.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/c26c5aaf-ffc5-4b08-baca-f031de8f8bbd/cpz1783-fig-0003-m.jpg</p>\nFigure 3\nConfocal images of immunofluorescently stained bone marrow (BM)-derived megakaryocytes (MKs). Murine BM-derived MKs were enriched by bovine serum albumin gradient and stained with antibodies raised against CD41/CD61 (magenta) and CD42a (cyan). Nuclei were counterstained with DAPI (blue). Images were acquired using a TSC SP8 confocal laser scanning microscope (Leica) with a 63×/NA 1.4 oil objective. Scale bar represents 20 μm.\nMaterials\nParaformaldehyde\nTriton X-100\nPHEM buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.783#cpz1783-rec-0003])\nMKs (see Basic Protocols 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.783#cpz1783-prot-0001] and 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.783#cpz1783-prot-0002])\nDPBS (e.g., Sigma-Aldrich)\nAnti-CD42a antibody, Alexa Fluor 647 conjugated (clone Xia.B4; e.g., Emfret)\nAnti-CD41/CD61 antibody, Alexa Fluor 546 conjugated (clone Leo.H4; e.g., Emfret)\nPhalloidin-Alexa 647 (e.g., Invitrogen)\nFluoroshield containing DAPI (e.g., Sigma-Aldrich)\nCentrifuge\nChambered cover slips (e.g., Ibidi)\nInverted confocal laser scanning fluorescence microscope (e.g., Leica TCS SP8)\n1. Prepare 2% (w/v) paraformaldehyde and 0.1% (v/v) Triton X-100 in PHEM buffer.\n2. Resuspend MKs in 500 µl PHEM buffer containing paraformaldehyde and Triton X-100.\n3. Fix and permeabilize cells for 20 min at room temperature.\n4. Centrifuge samples 5 min at 300 × g, room temperature.\n5. Discard supernatant and resuspend cells in 500 µl DPBS.\nUse caution when pipetting the supernatant, as the MK cell pellet is loose.",
    "6. Add 1 µg anti-CD42a and anti-CD41/61 fluorophore-conjugated antibodies to the cells. Add 0.75 U/ml Alexa Fluor 647–conjugated phalloidin, and stain sample for 1 hr at room temperature in the dark.\nThe amount of antibody used may differ between antibodies and needs to be titrated for optimal staining.\nAntibodies that are known to show no interference with one another can be added simultaneously for staining. However, when testing new antibodies, we recommend adding these in sequence with DPBS wash steps in between.\nFor antigens with low expression, the combination of an unlabeled primary antibody with a fluorophore-conjugated secondary antibody can be used, since this approach leads to signal amplification due to multiple secondary antibodies that bind to their target.\n7. Centrifuge samples 5 min at 300 × g, room temperature, and discard supernatant.\n8. Resuspend cells in 100 µl DPBS, and add one drop of Fluoroshield with DAPI to counterstain nuclei.\n9. Transfer samples to a chambered cover slip, and image cells with an inverted confocal laser scanning microscope."
  ],
  "subjectAreas": [
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}