{
  "id": 2443,
  "origin_website": "Cell",
  "title": "Detection of m6A in single cultured cells using scDART-seq",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nProduction of lentivirus\nTiming: 1 week\nThe main purpose of lentiviral transduction is to obtain clonal cell lines with transgene induction that is consistent from cell-to-cell. However, as an alternative, these plasmids can be used to perform transient transfection, followed by single-cell sorting of only GFP+ cells to perform scDART-seq. This may result in greater variation of transgene expression within each cell but would be much faster and easier than generating clonal cell lines. In addition, if using a heterogenous cell line, the process of selecting clones may eliminate most or all of the heterogeneity, which may be of interest in a single-cell experiment. In this case, transient transfection is advised. Plasmid sequences and detailed plasmid maps are available at Addgene (see key resources table[href=https://www.wicell.org#key-resources-table]).\nCulture HEK293T cells on a 15 cm plate in growth medium until they are at approximately 80% confluency.\nOptional: HEK293T cells are easily disrupted from the plate. If this is an issue, the plates can be coated with gelatin or fibronectin so that they adhere more strongly.\nTransiently transfect viral vectors.\nIn a sterile 15 mL tube, add 1 mL OPTI-MEM. Then add plasmids: 26.75 μg of TLCV2-APOBEC1-YTH (or TLCV2-APOBEC1-YTHmut), 20 μg of psPAX2, and 6.25 μg of pMD2.G. Then add 3 μg of jet-PEI solution, gently mix. Incubate at 23°C for 30 min.\nApply to cells dropwise and culture cells at 37°C with 5% CO2 for 24 h.\nAfter 24 h, aspirate and add 20 mL of fresh growth medium.\nCulture cells at 37°C with 5% CO2 for a further 48 h. GFP fluorescence should be visible.\nAfter 48 h, sterilize ultracentrifuge tubes with 70% ethanol and allow them to air dry in a biosafety cabinet. Aspirate to dry any residual ethanol if necessary.",
    "Remove medium from cells and pipette into a 50 mL conical. Centrifuge at 5,000 × g for 10 min.\nRemove supernatant and filter with 0.45 μm nylon filter.\nNote: The following steps are to concentrate purified virus. These steps are optional, but recommended. If storing unpurified supernatant, 1 mL aliquots should be stored at −80°C.\nAdd filtered medium to ultracentrifuge tube.\nCarefully add 4 mL of sucrose solution to the bottom of the ultracentrifuge tube to create distinct layers. Use a 5 mL serological pipette for this and remove slowly. There should be 2 distinct layers.\nNote: To make 20% sucrose solution, dissolve sucrose in 150 mL of PBS. Once dissolved, add enough PBS to make 200 mL of solution, then filter-sterilize. Store solution at 4°C for up to 1 year.\nFill tubes to about ¾ of their height with PBS and use a balance to ensure tubes are of the same weight. Take care not to mix layers.\nCentrifuge at 19,700 rpm for 2 h at 4°C in a Beckman sw28 swinging bucket rotor.\nDecant supernatant into 10% bleach. Leave tube inverted on Kimwipes for ∼5 min. Use vacuum carefully to remove beads of supernatant on the bottom of the tube without aspirating the viral pellet.\nAdd 100 μL of PBS to the bottom of each tube.\nResuspend by incubating 16–18 h at 4°C in the dark, with rocking.\nCentrifuge at 7,000 × g for 1 min at 4°C.\nTransfer to a new tube, and aliquot into 30 μL aliquots on ice.\nFreeze in dry ice/ethanol bath and store at −80°C.\nGeneration of stable cell lines\nTiming: 3 weeks in generating single-cell clonal cell lines",
    "Here, the purified lentivirus made in the previous section is applied to HEK293T cells to insert either the APOBEC1-YTH or APOBEC1-YTHmut transgene. Then cells are diluted and plated at less than one cell per well in 96-well plates and allow to form clonal cell lines. The resulting clonal cell lines will have more consistent transgene induction than heterogenous mixture of virally transduced cell lines.\nCulture HEK293T cells on 60 mm plate in DMEM +10% FBS until the cells are at about 70% confluency in 3 mL of medium.\nApply 30 μL of resuspended virus to medium and culture cells at 37°C with 5% CO2 for 24 h.\nAspirate medium and add 2 mL of selection medium and culture cells at 37°C with 5% CO2 for 7 days, replacing with fresh selection medium daily.\nAfter 7 days of puromycin selection, add 500 μL of trypsin and incubate at 37°C for 5 min to make a single cell suspension and resuspend in 10 mL of growth medium.\nCount cells using a hemacytometer or automated cell counter.\nMake serial dilutions using growth medium until cells are at a concentration of 1 cell per 200 μL.\nPlate 150 μL of the cell suspension per well on 10 96-well plates.\nNote: As an alternative to clonal selection, single cells can be directly sorted from this pool of transgenic cells. Direct sorting of GFP+ cells from this pool may be beneficial if using a more heterogenous cell line that contains multiple subpopulations. Clonal selection is recommended when consistent induction within all cells is important.\nUsing inverted microscope, identify and label wells containing only a single cell. Culture cells at 37°C with 5% CO2.\nIdentify and culture colonies growing from wells containing single cells.",
    "The cells should be expanded until at least a confluent 10 cm plate is obtained.\nTesting of stable cell lines\nTiming: 3 days\nThe major goal of generating clonal cell lines is to obtain consistent induction of APOBEC1-YTH in all cells within the population. This section describes testing of candidate cell lines to ensure consistent induction of APOBEC1-YTH and detectable C-to-U editing before preparing sequencing libraries. It may be necessary to screen 10–15 potential clonal cell lines to identify a high-quality candidate. After clonal cell line identification, we recommend proceeding with a single APOBEC1-YTH and APOBEC1-YTHmut line, as this will ensure sequenced cells have as consistent transgene induction as possible.\nPlate 200,000 cells of each inducible APOBEC1-YTH- and APOBEC1-YTHmut-expressing clonal stable cell line to be tested on separate 10 cm plates and culture for 24 h.\nTreat with 1 μg/mL of doxycycline and culture for 24 h.\nAssess percentage of cells expressing GFP using fluorescent microscopy. Only select cell lines with ∼100% fluorescent cells (Figure 1[href=https://www.wicell.org#fig1]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1927-Fig1.jpg\nFigure 1. Validation of stable cell lines expressing inducible APOBEC1-YTH\n(A) Fluorescence imaging showing transgene induction in all cells of a clonally selected cell line.\n(B) Sanger sequencing traces showing expected C-to-U mutations at ACTB C1223 in cells expressing APOBEC1-YTH (top), but not those expressing APOBEC1-YTHmut (bottom).\nNote: Cell lines with highly variable induction of transgene or GFP signal suggest that they may not be truly clonal and deriving from a single cell. It is possible to sort GFP+ cells from such a cell line, however more variable transgene induction may be observed. We observed a high rate of cell lines with 100% of cells displaying GFP signal, and this should not be a rare event if a majority of clones are truly derived from a single cell.",
    "Assess C-to-U mutations at a known site in ACTB mRNA (Figure 1[href=https://www.wicell.org#fig1]B).\nRNA isolation.\nAspirate medium, rinse plates with cold PBS, and pour off excess PBS.\nUse a cell scraper to harvest cells and pipette into a 1.5 mL tube.\nCentrifuge at 2,000 × g for 1 min to pellet cells.\nRemove PBS and add 1 mL of Trizol. Pipette to mix and homogenize.\nIncubate at 23°C for 5 min.\nAdd 200 μL of chloroform and vortex for 10–15 s.\nCentrifuge at 13,000 × g for 15 min at 4°C.\nTransfer 400 μL of top aqueous layer to a new tube.\nAdd 500 μL of isopropanol, mix by inverting, and incubate for 10 min at 23°C.\nCentrifuge at 13,000 × g for 10 min at 4°C.\nRemove supernatant and resuspend pellet in 70% ethanol. Vortex to dislodge pellet from bottom of tube.\nCentrifuge at 13,000 × g for 5 min at 4°C.\nRemove all of supernatant and air dry for ∼5 min.\nResuspend pellet in 90 μL of RNase-free water.\nRemoval of contaminating DNA.\nUse RNase-free DNaseI to eliminate contaminating DNA fragments. To each tube with RNA solubilized in 90 μL of water.\nAdd 10 μL of DNaseI 10× buffer.\nAdd 2 μL of DNaseI.\nIncubate at 37°C for 15 min.\nEthanol precipitation to recover RNA.\nAdd 10 μL of sodium acetate solution.\nAdd 250 μL of 100% ethanol.\nIncubate at −80°C for 1 h.\nCentrifuge at 13,000 × g for 15 min at 4°C to pellet RNA.\nCompletely remove supernatant and air dry for ∼5 min.\nResuspend pellet in 90 μL of RNase-free water.\nCritical: After isolation, RNA should be kept on ice while thawed, and it should be stored at −80°C when not in use.\nQuantify RNA using Qubit RNA BR Assay.",
    "Synthesize cDNA using iScript Supermix in 0.2 mL PCR tubes. The thermocycler lid should be set to 105°C.\nNote: Though 200 ng of total RNA are listed, as little as 10 ng can be used without affecting the ability to detect C-to-U mutations.\ntable:files/protocols_protocol_1927_7.csv\ntable:files/protocols_protocol_1927_8.csv\nPCR amplify region surrounding ACTB C1223 in 0.2 mL PCR tubes, with the thermocycler lid set to 105°C.\ntable:files/protocols_protocol_1927_9.csv\ntable:files/protocols_protocol_1927_10.csv\nSeparate amplified fragment using 1% agarose gel (w/v) and use razor blade to extract the ∼150 bp fragment.\nNote: A suitable DNA ladder (ideally containing a 100 bp and 200 bp marker) should be run adjacent to the samples so the band size can be properly estimated, ensuring that the correct band is excised.\nPurify DNA using QIAquick Gel Extraction Kit.\nSend for Sanger sequencing using the ActinFwd primer.\nObserve induction of C-to-T mutation at C1223 only in doxycycline-treated APOBEC1-YTH-expressing cell lines, but not in APOBEC1-YTHmut-expressing cell lines (Figure 1[href=https://www.wicell.org#fig1]B).\nCritical: We recommend collecting RNA less than 36 h after transgene induction, as prolonged APOBEC1-YTH expression (longer than 48 h) can negatively impact cell health.\nTransgene induction and sorting of single cells\nTiming: 2 days\nIn this step, expression of the APOBEC1-YTH or APOBEC1-YTHmut transgenes is induced with doxycycline, resulting in C-to-U mutations in mRNAs adjacent to sites of m6A methylation. After doxycycline induction, single cells are sorted into 384-well plates prior to the preparation of sequencing libraries.\nPlate 200,000 cells of inducible APOBEC1-YTH- and APOBEC1-YTHmut-expressing stable HEK293T cells from clonal cell lines selected in the previous section on separate 10 cm plates for a total of 2 plates.\nWhen cells are approximately 70% confluent, aspirate medium and add 10 mL of growth medium with 1 μg/mL doxycycline and incubate at 37°C for 24 h.",
    "Note: Flow buffer should be prepared the day before and stored at 4°C until ready for use.\nThe next day, prepare 3 mL of SMART-seq HT lysis buffer and aliquot 1 μL into each well of 7 384-well PCR plates.\nNote: The lysis buffer should be prepared on the same day as the cell sorting. After making the solution and aliquoting into 384 well plates, the plates should be covered with foil adhesive plate covers and kept on ice until ready for use. Use within the same day as aliquoting.\nGenerate a single cell suspension for sorting individual cells. The APOBEC1-YTH and APOBEC1-YTHmut cells should be kept separate throughout this process and the tubes should be sorted sequentially.\nAspirate medium and add 10 mL of sterile PBS.\nRepeat step 40a.\nAspirate PBS and add 2 mL of TrypLE and incubate at 37°C with 5% CO2 for 5 min to dissociate the cells.\nAdd 12 mL of flow buffer and gently pipette cells with 10 mL pipette up and down 5–10 times to break up clumps. Transfer to 15 mL conical tubes.\nCritical: Cells should be pipetted to generate single cells and avoid clumps. However, vigorous pipetting will lead to reduced viability, potentially compromising the sample.\nCount cells using hemacytometer or automated cell counter.\nAdd 2 million cells to a 1.5 mL tube and pellet by centrifuging at 1,000 × g for 3 min at 23°C.\nCritical: It is important not to centrifuge cells above 1,000 × g to maintain high cell viability. Centrifugation at lower speeds may improve viability but lead to greater cell loss. Use polypropylene tubes during these steps.\nRemove as much supernatant as possible without disturbing the pellet.",
    "Resuspend pellet in 200 μL of flow buffer. Gently dissociate the pellet using a wide-bore P1000 pipette tip with pipette set to 150 μL.\nCritical: Gently resuspending cell pellets using wide-bore pipette tips is recommended, as vigorous dissociation can damage cells, increase cellular debris, and decrease viability. Avoid creating large amounts of bubbles.\nNote: Instead of wide-bore tips, it is possible to cut the bottom of standard P1000 pipette tips using sterilized scissors or a razor blade to expand the bore size.\nAdd 2 μL of near-IR LIVE/DEAD viability dye and incubate in the dark for 5 min at 23°C.\nAdd 2 μL (4 units) of DNaseI. Gently mix by pipetting with a wide-bore P1000 pipette tip. Incubate for 15 min at 23°C in the dark.\nPellet the cells by centrifugation at 1,000 × g for 3 min.\nRemove as much supernatant as possible without disturbing the pellet.\nAdd 1 mL of flow buffer and gently dissociate the pellet with a wide-bore P1000 pipette tip.\nFilter cells using 40 μm nylon filter.\nUse a FACS Aria II to sort 1 viable cell per well of each plate. Immediately after a plate is finished sorting, cover with a foil adhesive plate cover, spin plate at 1,000 × g for 1 min in a swinging bucket centrifuge, and immediately place on dry ice.\nNote: Cells should be gated on forward/side scatter, with doublet discrimination using forward scatter area vs. log settings. Single cells should be further gated on GFP expression. Only cells with a similar amount of GFP signal should be sorted to improve consistent transgene expression from cell-to-cell. Therefore, it is recommended to set a narrow gate on GFP expression, collecting cells with moderate levels of GFP (i.e., not a low or high extremes).",
    "Note: Cells should not be highly concentrated, to reduce the rate of accidental double sorting and prevent doublets. Therefore, the suspension of single-cells to be sorted should be made to about 500,000 cells per 1 mL. Sorting can be stressful on the cells, so the largest nozzle size with the lowest pressure is recommended, we used a 100 μm nozzle with 20 psi of pressure.\nNote: Although a FACS Aria II was used to sort, any cell sorter capable of sorting human cells can be used.\nPause point: Cells may be stored at −80°C for at least 3 weeks.\nSMART-seq2 cDNA synthesis\nTiming: 1–2 days for a single 384-well plate\nHere, the cDNA libraries that will be used to prepare sequencing libraries are created. In particular, this section outlines the protocol for reverse transcription followed by cDNA amplification and post-PCR clean-up.\nNote: The reverse transcription and cDNA amplification steps are accomplished according to the manufacturer’s protocol (Takara SMART-seq HT Kit User Manual[href=https://www.takarabio.com/documents/User%20Manual/SMART/SMART-Seq%20HT%20Kit%20User%20Manual.pdf]). However, the reaction volumes have been decreased 12.5-fold.\nNote: It is highly recommended to use a well-calibrated, electronic multichannel pipette with adjustable spacers for all PCR-related steps if performing these steps by hand. Adjustable spacers are optional, but useful for transferring between 384-well plates and 96-well plates. However, pipetting small volumes with manual pipettes will result in inaccuracies and increased variability in PCR efficiency from well-to-well and therefore electronic pipettors are highly recommended. Manual multichannel pipettes may be used for DNA purification steps using AmpPureXP beads. Additionally, if accessible, robotic liquid handlers may be used. It is also recommended that the library construction steps are performed in a clean hood or biosafety cabinet to reduce likelihood of contamination. Additionally, multichannel pipettes are recommended for bead purification steps.",
    "Note: Do not re-use tips at any step, this could lead to sample cross-contamination. Additionally, filter tips should be used at all steps to reduce the risk of cross-contamination. The DNA purification steps with AmpPureXP beads require the use of many p20 and p200 tips, ensure that enough tips are readily available before starting.\nThaw one of the 384-well plates with sorted single cells on ice. Centrifuge at 2,000 × g for 5 min at 4°C.\nIncubate plate in a thermocycler set to 72°C for 3 min.\nImmediately remove the plate from the thermocycler and incubate on ice for 2 min.\nWhile on ice, add 1 μL of One-step mastermix (provided in SMART-seq HT Kit) and briefly mix by pipetting.\nCover plate with adhesive plate cover and incubate in thermocycler with lid set to 105°C to perform reverse transcription immediately followed by cDNA amplification steps.\ntable:files/protocols_protocol_1927_11.csv\nPause point: Plate may be stored at −20°C for at least 4 weeks. Plates should be covered with foil adhesive plate covers.\nAdd 5.5 μL nuclease-free water per well (7.5 μL total). Transfer samples from 384-well plate to four 96-well 0.2 mL PCR plates.\nNote: Perform steps 42–53 on each 96-well plate, keeping the other three plates on ice and covered.\nAdd 7.5 μL AMPure XP beads to each well and mix by pipetting.\nIncubate at 23°C for 8 min.\nPlace on a 96-well plate magnetic rack for 5 min or until solution is clear.\nRemove supernatant and add 200 μL of freshly prepared 80% ethanol.\nNote: Perform this step using a multi-channel pipette on several rows (if using 12-channel pipette) or columns (if using 8-channel pipette) of wells at a time for efficiency but avoid letting the beads dry.",
    "Critical: Do not allow tips that have entered a sample well to enter any other sample well to avoid sample cross-contamination.\nIncubate in ethanol for 30 s.\nRemove supernatant and add 80% ethanol.\nUsing a multichannel P200 pipette, remove supernatant from one row. Then, use a P10 multichannel pipette to remove as much ethanol as possible from the same row.\nCritical: Do not over-dry the beads, as it may affect yield. Change tip on aspirator between wells.\nUsing a multichannel pipette, add 17 μL elution buffer and mix by pipetting.\nRepeat steps 42–49 for all rows on plate. After elution buffer is added to the last row, incubate at 23°C for 5 min.\nPlace on a 96-well plate magnetic rack for 2 min or until supernatant is clear.\nTransfer 15 μL from each well to a new plate.\nPause point: Plates can be stored at −20°C. Plates should be covered with foil adhesive plate covers.\nUse the Qubit 1× dsDNA HS Assay Kit to quantify the concentration of cDNA.\nNote: A minimum concentration of 100 pg/μL for each sample should be used. Concentrations below this should not be used as it may affect the efficiency of the following steps.\nNote: There will be wells with insufficient material to continue with tagmentation. These wells should not be used. If using an adjustable-spacer pipette, cells can be easily transferred directly to a 384-well plate (step 61), skipping over these wells.\nVerify the expected size distribution of cDNA fragments of several randomly selected cells using the Agilent High Sensitivity DNA Kit on the Agilent 2100 Bioanalyzer (Figure 2[href=https://www.wicell.org#fig2]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1927-Fig2.jpg\nFigure 2. Assessment of fragment size distribution of cDNA and sequencing libraries\n(A) cDNA libraries should have a broad distribution of fragment lengths with a peak around 1–2 kb.",
    "(B) Final sequencing libraries should consist of an average fragment size of approximately 600 nt.\nNote: There should be an enrichment of fragments in the 1–2 kb range.\nTagmentation and final library preparation\nTiming: 0.5 days for each 96-well plate\nHere, final sequencing libraries are prepared from amplified cDNA. This protocol is designed to process each 96-well plate of purified cDNA from the previous section successively.\nNote: The following steps are performed with the Illumina Nextera XT Library Preparation Kit[href=https://support.illumina.com/content/dam/illumina-support/documents/documentation/chemistry_documentation/samplepreps_nextera/nextera-xt/nextera-xt-library-prep-reference-guide-15031942-06.pdf] using the protocol presented with the Takara SMART-seq HT Kit. The reaction volumes have been reduced 2-fold from those presented in the Takara SMART-seq HT Kit instructions[href=https://www.takarabio.com/documents/User%20Manual/SMART/SMART-Seq%20HT%20Kit%20User%20Manual.pdf]. 400 Custom Illumina-compatible CDI indexes were purchased from IDT. These dual indexes each consist of 2 indexing primers in the same tube at 10 μM, and can be used in the protocol below as supplied. The sequences of each of these indexes can be found in Table S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1927-Mmc1.xlsx].\nNote: Each 96-well plate of purified cDNA should be performed sequentially.\nDilute the cDNA in each well to a concentration of 200 pg/μL using elution buffer.\nCritical: The amount of cDNA in each reaction can influence the efficiency of the tagmentation reaction. Highly variable amounts of input cDNA can result in libraries with different average fragment sizes and result in some libraries outcompeting others in the sequencing reaction. If the concentration of cDNA is between 100–200 pg/μL do not dilute the sample.\nAs quickly as possible, use a multichannel pipette to add 1.875 μL of the tagmentation premix (provided in Nextera XT Library Preparation Kit) to each well in top-left quadrant of a 384-well plate.",
    "Note: Due to the scaled-down volumes used in this protocol, 384-well plates are used. 96-well plates may be substituted while using double or triple the indicated volumes. If using fewer than all 96-wells in the top-left quadrant due to dropout samples with too little cDNA, those wells can be ignored to save reagent.\nAdd 0.625 μL of 200 pg/μL cDNA to each well.\nQuickly seal the plate with an adhesive plate cover and place in a thermocycler for 10 min at 55°C. Hold at 10°C.\nAs soon as the samples reach 10°C, remove the plate and quickly add 0.625 μL of NT Buffer (provided in Nextera XT Library Preparation Kit).\nSeal the plate with an adhesive plate cover and centrifuge at 2,000 × g for 1 min at 23°C.\nIncubate at 23°C for 5 min.\nAdd 1.88 μL of NPM master mix (provided in Nextera XT Library Preparation Kit) to each well.\nAdd 0.625 μL of nuclease-free water.\nAdd 0.625 μL of duplexed, Nextera-compatible indexing primers.\nSeal the plate with an adhesive plate cover and incubate in a thermocycler with lid set to 105°C.\ntable:files/protocols_protocol_1927_12.csv\nPause point: Plate can be stored at −20°C. Plates should be covered with foil adhesive plate covers.\nAdd 9.375 μL of nuclease-free water to each well (12.5 μL total) and transfer samples to a 96-well plate.\nNote: Transferring samples between 384-well plates and 96-well plates is aided by using an electronic pipette with adjustable spacers.\nAdd 7.5 μL AMPure XP beads to each well and mix by pipetting.\nIncubate at 23°C for 8 min.\nPlace on a 96-well plate magnetic rack for 5 min or until solution is clear.\nRemove supernatant and add 200 μL of freshly prepared 80% ethanol.",
    "Note: Perform this step using a multi-channel pipette on several rows (if using 12-well multichannel) or columns (if using 8-well multichannel) of wells at a time for efficiency, but avoid letting the beads dry. Additionally, always change tips between samples and do not let tips contact the wells of two different samples at any step to avoid cross-contamination.\nIncubate in ethanol for 30 s.\nRemove supernatant and add 80% ethanol.\nUsing a multichannel p200 pipette, remove supernatant from one row. Then, use a p10 multichannel pipette to remove as much ethanol as possible from the same row.\nCritical: Do not over-dry the beads, as it may affect yield. Change tip on aspirator between wells.\nUsing a multichannel pipette, add 17 μL elution buffer and mix by pipetting.\nRepeat steps 65–74 for all rows on plate. After elution buffer is added to the last row, incubate at 23°C for 5 min.\nPlace on a 96-well plate magnetic rack for 2 min or until supernatant is clear.\nTransfer 15 μL from each well to a new plate.\nPause point: Plates can be stored at −20°C. Plates should be covered with foil adhesive plate covers.\nFor all wells, use the Qubit 1× dsDNA HS Assay Kit to quantify the concentration of cDNA.\nVerify expected size distribution of cDNA fragments using the Agilent High Sensitivity DNA Kit on the Agilent 2100 Bioanalyzer (Figure 2[href=https://www.wicell.org#fig2]B).\nNote: There should be an average fragment size of about 500–600 bp. At least a random selection of 12 libraries should be tested.\nPool samples for sequencing. All samples should be pooled to an equal molar representation in the final library.\nThe pooled sample should be quantified again using the Qubit 1× dsDNA HS Assay Kit and fragment sizes should be assessed using the Agilent High Sensitivity DNA Kit.",
    "Note: Fragment sizes should be 500–600 bp and DNA concentration should meet the requirements of the sequencer and flow cell being used.\nPerform next-generation Illumina sequencing.\nNote: We recommend using 150 bp paired-end sequencing (2 × 150 bp PE) as more sequence information is obtained for the same number of total reads, but using 2 × 50 bp PE or 2 × 100 bp PE could also be used. Additionally, the depth of sequencing can have a strong impact on the number of sites detected and the quality of the dataset. Although a standard SMART-seq scRNA-seq experiment is usually performed with at most 1 million reads per cell, it is recommended to exceed that for this dataset. 5 million reads per cell was targeted in (Tegowski et al., 2022[href=https://www.wicell.org#bib8]).\nNote: We used a Novaseq6000 with S4 flow cells to perform the sequencing for this experiment. However, NextSeq Illumina sequencers can also be used. Ensuring enough coverage on a cell-to-cell basis with high sequencing quality is the most critical consideration for successful identification of m6A sites (see above note).\nRead preprocessing, genome alignment, and filtering of low-quality cells\nTiming: 3–5 days\nAfter Illumina sequencing and demultiplexing, the sequencing reads should all be separate fastq files. In this section, sample quality will be assessed, so that substandard cells will be eliminated from further analysis and m6A identification steps. Adaptor sequences will be trimmed from reads, followed by alignment, PCR duplicate removal, and quantification of RNA expression in each cell to generate a gene expression matrix. This matrix will then be used to perform quality control steps using Seurat (Stuart et al., 2019[href=https://www.wicell.org#bib7]).\nNote: Raw data from Tegowski et al. (2022)[href=https://www.wicell.org#bib8] are available on SRA (GSE180954), and all instructions and code for reproducing the identification of m6A methylation sites is available at: https://github.com/tegowski/scDARTHEKcells[href=https://github.com/tegowski/scDARTHEKcells].",
    "Note: Other than R scripts (where indicated), the below are all bash scripts intended to be submitted as jobs on systems with a Slurm workload scheduler from the directory containing the files being processed. All instances of “WORKDIR” should be replaced with the working directory being used for this project. All scripts below and how to use them are also available at the indicated Github link.\nUse Flexbar to remove adaptor sequences.\n#First move to correct directory\n$ cd $WORKDIR/software\n#Submit flexbar script\n$ sbatch flexbar.sh\n##Contents of flexbar.sh\n#!/bin/bash\n#SBATCH -a 1-1667\nWORKDIR=”/your/path/here”\nFASTQ=$WORKDIR/rawfiles #input directory\nTRIM=$WORKDIR/trim #output directory\nmkdir -p $TRIM\n#This step will loop through all fastq files in the directory (adjust the numbers in the -a option at the top if using a different number of files)\nfile=$(ls $FASTQ/∗_1.fastq.gz | sed -n ${SLURM_ARRAY_TASK_ID}p)\nSTEM=$(basename \"$file\" _1.fastq.gz)\nR1=\"$STEM\"_1.fastq.gz # reassign full name to Read1\nR2=\"$STEM\"_2.fastq.gz # assign name to Read 2\n#This is the actual flexbar command.\nflexbar -r $FASTQ/$R1 -p FASTQ/$R2 -aa Nextera --zip-output GZ --threads 16 -qf i1.8 -t $TRIM/$STEM\nUse STARsolo to align to the genome, remove exact duplicates, and generate a gene count matrix for all cells.\nNote: The APOBEC1-YTH cells (first script) should be run separately from the APOBEC1-YTHmut cells (second script).\n# Copy scripts to the correct directory, then move there\n$ cp $WORKDIR/software/StarsoloalignWT.sh $WORKDIR/rawfiles/\n$ cp $WORKDIR/software/StarsoloalignMUT.sh $WORKDIR/rawfiles/\n$ cd $WORKDIR/rawfiles\n#Submit scripts to align the genome\n$ sbatch StarsoloalignWT.sh\n$ sbatch StarsoloalignMUT.sh\n#Contents of StarsoloalignWT.sh\n#!/bin/bash\n#SBATCH -a 1-2\n#SBATCH -c 8\n#SBATCH --mem=60G\n#This script should be run from the $WORKDIR/trim directory\n#Replace $WORKDIR with the path to your directory\nWORKDIR=\"/your/path/here\"\nmkdir -p $WORKDIR/aligned\n#Defines list of fastq files for each batch to be aligned\nfilelist=$(cat $WORKDIR/software/WTfilelist${SLURM_ARRAY_TASK_ID}.txt)\n#Run STARsolo\nSTAR --genomeDir $WORKDIR/STARindex/ \\\n--runThreadN 8 \\",
    "--readFilesIn $filelist \\\n--outFileNamePrefix $WORKDIR/aligned/WT${SLURM_ARRAY_TASK_ID} \\\n--outSAMtype BAM Unsorted \\\n--outFilterMismatchNoverReadLmax 0.06 \\\n--outSAMattrRGline ID: \\\n--soloType SmartSeq \\\n--readFilesManifest $WORKDIR/software/WTmanifest${SLURM_ARRAY_TASK_ID}.txt \\\n--soloUMIdedup Exact \\\n--soloStrand Unstranded\n#Contents of StarsoloalignMUT.sh\n#!/bin/bash\n#SBATCH -a 1-2\n#SBATCH -c 8\n#SBATCH --mem=60G\n#This script should be run from the $WORKDIR/trim directory\n#Replace $WORKDIR with the path to your directory\nWORKDIR=\"/your/path/here\"\nmkdir -p $WORKDIR/aligned\n#Defines list of fastq files for each batch to be aligned\nfilelist=$(cat $WORKDIR/software/mutfilelist${SLURM_ARRAY_TASK_ID}.txt)\n#Run STARsolo\nSTAR --genomeDir $WORKDIR/STARindex/ \\\n--runThreadN 8 \\\n--readFilesIn $filelist \\\n--outFileNamePrefix $WORKDIR/aligned/MUT${SLURM_ARRAY_TASK_ID} \\\n--outSAMtype BAM Unsorted \\\n--outFilterMismatchNoverReadLmax 0.06 \\\n--outSAMattrRGline ID: \\\n--soloType SmartSeq \\\n--readFilesManifest $WORKDIR/software/mutmanifest${SLURM_ARRAY_TASK_ID}.txt \\\n--soloUMIdedup Exact \\\n--soloStrand Unstranded\nNote: This step can require significant amounts of time, especially if many cells (more than 100–200) are being aligned and counted. It is advisable to break this step into multiple groups to generate multiple gene expression matrices, which can be merged in the next steps using Seurat. For this example, there are two groups of APOBEC1-YTH (WT) cells and two groups of APOBEC1-YTHmut (MUT) cells for a total of 600 cells being aligned. For more detailed information, please see https://github.com/tegowski/scDARTHEKcells[href=https://github.com/tegowski/scDARTHEKcells].",
    "Note: Several other files will be required for alignment. First, several lists of all the file names should be copied from the Github page into the path “$WORKDIR/software/”. Second, a file manifest needs to be generated and also contained within the “$WORKDIR/software/” directory. These files are available from Github. They are tab-separated files that contain the read 1 file name, the read 2 file name, and a cell ID that will be added by STARsolo. Third, an indexed reference genome will need to be generated using STAR, and it should be located within the “$WORKDIR/STARindex” directory. Detailed instructions for generating this index are provide above, in the “before you begin[href=https://www.wicell.org#before-you-begin]” section. If not using this dataset, detailed instructions on generating these required files can be found at https://github.com/alexdobin/STAR/blob/master/docs/STARsolo.md[href=https://github.com/alexdobin/STAR/blob/master/docs/STARsolo.md].\nNext, the gene expression of the sequenced cells needs to be analyzed so that basic quality control steps can eliminate poor quality cells. To do this, start an R session and load required libraries for analysis using Seurat.\n> library(Seurat)\n> library(tidyverse)\n> library(Matrix)\n> library(scales)\n> library(cowplot)\n> library(RCurl)\nNext, the output files from STARSolo need to be loaded and converted into Seurat objects.\nNote: Each alignment will produce 3 files (barcodes.tsv, features.csv, and matrix.mtx), and all three of these files need to be in the same directory and zipped using gzip.\n> for (file in c(“WT1”, “WT2”, “MUT1”, “MUT2″)){\n    seurat_data <- Read10×(data.dir = paste0(“$WORKDIR/aligned/\", file))\n    seurat_obj <- CreateSeuratObject(counts = seurat_data, project = file)\n    assign(file, seurat_obj)}\n> SeuratSMARTcombined <- merge(x = WT1, y = c(WT2, MUT1, MUT2))\nCalculate key quality metrics: 1) Ratio of RNAs per cell to the reads per cell, 2) Proportion of mitochondrial reads.",
    "Note: The pattern of “starts MT” (pattern = “ˆMT-“) in the code below is useful only for the human annotation of mitochondrial genes. This will need to be adjusted for other reference genomes (e.g., mouse should be “ˆmt-“).\n> SeuratSMARTcombined$log10GenesPerRead <-log10(SeuratSMARTcombined$nFeature_RNA) / log10(SeuratSMARTcombined$nCount_RNA)\n> SeuratSMARTcombined$mitoRatio <- PercentageFeatureSet(object = SeuratSMARTcombined, pattern = \"ˆMT-\")\n> SeuratSMARTcombined$mitoRatio <- SeuratSMARTcombined@meta.data$mitoRatio / 100\n> metadata <- SeuratSMARTcombined@meta.data\n> metadata$cells <- rownames(metadata)\n> SeuratSMARTcombined$log10GenesPerRead <-log10(SeuratSMARTcombined$nFeature_RNA) / log10(SeuratSMARTcombined$nCount_RNA)\n> SeuratSMARTcombined$mitoRatio <- PercentageFeatureSet(object = SeuratSMARTcombined, pattern = \"ˆMT-\")\n> SeuratSMARTcombined$mitoRatio <- SeuratSMARTcombined@meta.data$mitoRatio / 100\n> metadata <- SeuratSMARTcombined@meta.data\n> metadata$cells <- rownames(metadata)\nFilter out low-quality cells.\nNote: Cells are considered low-quality and removed if they meet any of the following criteria. 1) They have too few reads (cells with fewer than 1,000,000 total mapped reads to annotated genes are removed) 2) They have too few RNAs detected (cells with fewer than 9,000 RNAs (genes) identified are removed). 3) They have an altered ratio of RNAs identified to number of reads. A large increase in read numbers with no increase in RNAs detected can indicate doublets. (cells with a log10 ratio of greater than 0.58 are removed). 4) They are not healthy or viable (cells with more than 10% of reads deriving from mitochondrial RNAs are removed).\n> filtered_Seurat <- subset(x=SeuratSMARTcombined,\n            subset=(nCount_RNA >= 1000000) &\n            (nFeature_RNA >= 9000) &\n            (log10GenesPerRead > 0.58) &\n            (mitoRatio < 0.10))\nCritical: This is important to do before the identification of m6A sites, so that sites from dead cells or doublets can be ignored.\nGenerate quality control graphs showing the ratio of RNAs to reads per cell (Figure 3[href=https://www.wicell.org#fig3]A) and proportion of mitochondrial reads (Figure 3[href=https://www.wicell.org#fig3]B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1927-Fig3.jpg\nFigure 3. Quality control of sequenced cells and m6A sites identified",
    "(A) Density plot showing the percentage of reads aligning to mitochondrial-encoded mRNAs from each cell. The average is less than 5%, indicating healthy and viable cells were sequenced.\n(B) Density plot showing the ratio of the number of RNAs to the number of reads per cell (log10 of each). The single distribution suggests the cells are primarily singletons.\n(C) Metagene plot showing the distribution of identified sites along mRNA transcripts.\n(D) Metagene plot showing improper distribution of identified sites. Poor stop codon enrichment would indicate that these sites do not accurately reflect m6A methylation. Alternative thresholds or quality control metrics should be tested. Figures reprinted with permission from (Tegowski et al., 2022[href=https://www.wicell.org#bib8]).\nNote: A single peak is expected, and multiple peaks can indicate a high proportion of doublets that should be removed. The exact average ratio will depend on cell line used and sequencing saturation, but here only cells with a ratio of less than 0.58 are included in the following analyses.\n> counts <- GetAssayData(object = filtered_Seurat, slot = “counts\")\n> nonzero <- counts > 0\n> keep_genes <- Matrix::rowSums(nonzero) >= 10\n> filtered_counts <- counts[keep_genes, ]\n> filtered_Seurat <- CreateSeuratObject(filtered_counts, meta.data = filtered_Seurat@meta.data)\n> metadata_clean <- filtered_Seurat@meta.data\n> metadata_clean %>%\n    ggplot(aes(x=log10GenesPerUMI, color=sample, fill=sample)) +\n    geom_density(alpha = 0.2) +\n    theme_classic() +\n    geom_vline(xintercept = 0.8)\n> metadata_clean %>%\n    ggplot(aes(x=mitoRatio, color=sample, fill=sample)) +\n    geom_density(alpha = 0.2) +\n    scale_x_log10() +\n    theme_classic() +\n    geom_vline(xintercept = 0.2)\nObtain a list of cell IDs from the filtered dataset. This will be used after m6A site identification to remove sites found in low-quality cells after m6A identification in the following steps.\n> filtered_Seurat@meta.data$cells <- row.names(filtered_Seurat@meta.data)\n> FilteredCells <- filtered_Seurat@meta.data$cells\n>write.table(FilteredCells, file=\"$WORKDIR/aligned/QCpasscells.txt”, row.names=F, col.names=T,sep=\"\\t\",quote=F)\nIdentification of m6A sites using Bullseye\nTiming: 1 day",
    "Here, adapter trimmed reads in fastq files (from step 82) will be aligned to the genome, but all APOBEC1-YTH-expressing cells will be kept as separate files. The aligned sequences will then be parsed to generate matrices containing all the basecall information at each mapped nucleotide position. These matrices will then be used to identify the C-to-U mutations that indicate methylation. Finally, poor quality sites will be filtered to generate a list of high-confidence sites.\nNote: Raw data from Tegowski et al. (2022)[href=https://www.wicell.org#bib8] are available on SRA (GSE180954), and all instructions and code for reproducing the identification of m6A methylation sites described here is available at https://github.com/tegowski/scDARTHEKcells[href=https://github.com/tegowski/scDARTHEKcells].\nNote: For detailed information on the installation and general use of the Bullseye pipeline, please also see https://github.com/mflamand/Bullseye[href=https://github.com/mflamand/Bullseye].\nAlign the reads to the genome using STAR. The fastq files from each APOBEC1-YTH and APOBEC1-YTHmut cell should be aligned separately to produce an independent bamfile.\n# Copy scripts to the correct directory, then move there\n$ cp $WORKDIR/software/StarsoloalignWT.sh $WORKDIR/rawfiles/\n$ cp $WORKDIR/software/StarsoloalignMUT.sh $WORKDIR/rawfiles/\n$ cd $WORKDIR/rawfiles\n#Submit scripts to align to the genome\n$ sbatch STARBullseyealignWT.sh\n$ sbatch STARBullseyealignMUT.sh\n#Contents of STARBullseyeWT.sh\n#!/bin/bash\n#SBATCH -a 1-601\n#SBATCH -c 12\n#SBATCH --mem=60G\n#Define path to your working directory\nWORKDIR=\"/work/mrt41/Ex96_SMARTseq/test/\"\nfile=$(ls ∗_1.fastq | sed -n ${SLURM_ARRAY_TASK_ID}p) ## this is done for paired end libraries ending with _1 and _2 for each pair.\nSTEM=$(basename \"$file” _1.fastq)\nBAM=$WORKDIR/singlebams\nmkdir -p $BAM\necho “aligning $STEM\"\nSTAR --runMode alignReads \\\n--genomeDir $WORKDIR/STARindex \\\n--runThreadN 12 \\\n--readFilesIn ${STEM}_1.fastq ${STEM}_2.fastq \\\n--outSAMtype BAM SortedByCoordinate \\\n--outFilterMismatchNoverReadLmax 0.06 \\\n--outFileNamePrefix $BAM/${STEM}\n#Contents of STARBullseyeMUT.sh\n#!/bin/bash\n#SBATCH -a 1-601\n#SBATCH -c 12\n#SBATCH --mem=60G\n#Define path to your working directory\nWORKDIR=\"/work/mrt41/Ex96_SMARTseq/test/\"\nfile=$(ls ∗_1.fastq | sed -n ${SLURM_ARRAY_TASK_ID}p) ## this is done for paired end libraries ending with _1 and _2 for each pair.",
    "STEM=$(basename \"$file” _1.fastq)\nBAM=$WORKDIR/singlebams\nmkdir -p $BAM\necho “aligning $STEM\"\nSTAR --runMode alignReads \\\n--genomeDir $WORKDIR/STARindex \\\n--runThreadN 12 \\\n--readFilesIn ${STEM}_1.fastq ${STEM}_2.fastq \\\n--outSAMtype BAM SortedByCoordinate \\\n--outFilterMismatchNoverReadLmax 0.06 \\\n--outFileNamePrefix $BAM/${STEM}\nNote: When analyzing many cells, it is recommended to submit this script as an array so that many cells can be aligned at once.\nRemove duplicates from APOBEC1-YTHmut.\ncp $WORKDIR/software/RemoveduplicatesMUT.sh $WORKDIR/singlebams\ncd $WORKDIR/singlebams\nsbatch RemoveduplicatesMUT.sh\n#Contents of RemoveduplicatesMUT.sh\n#!/bin/bash\n#SBATCH -p scavenger\n#SBATCH -c 8\n#SBATCH --mem=60G\n#SBATCH -a 1-300\nfile=$(ls MUT∗Aligned.sortedByCoord.out.bam | sed -n ${SLURM_ARRAY_TASK_ID}p)\nSTEM=$(basename \"$file” .Aligned.sortedByCoord.out.bam)\necho \"$[SLURM_ARRAY_TASK_ID]\"\necho “Starting File: $file\"\n#First, use samtools to remove optical duplicates\nsamtools sort -n -o $STEM.name.bam $file\nsamtools fixmate -r -m $STEM.name.bam $STEM.fix.bam\nsamtools sort -o $STEM.possort.bam $STEM.fix.bam\nsamtools markdup -r $STEM.possort.bam $STEM.duprm.bam\nrm $STEM.name.bam $STEM.fix.bam $STEM.possort.bam\nMerge all APOBEC1-YTHmut bamfiles and produce nucleotide representation matrix.\ncp $WORKDIR/software/MakematrixYTHmut.sh $WORKDIR/singlebams\ncd $WORKDIR/singlebams\nsbatch Make_matrixYTHmut.sh\n#Contents of Make_matrixYTHmut.sh\n#!/bin/bash\n#SBATCH --mem=60G\n#SBATCH -c 12\n#SBATCH -p scavenger\n#Merge all MUT bamfiles\nsamtools merge MUTCellsmerged.bam MUT∗duprm.bam\n#Then use Bullseye (parseBAM.pl) to make nucleotide matrix\nWORKDIR=\"/work/mrt41/Ex96_SMARTseq/test\"\nBAMS=$WORKDIR/singlebams\nSTEM=$(basename \"$file\" Aligned.sortedByCoord.out.bam.duprm.bam)\nmkdir $WORKDIR/matrix\nperl $WORKDIR/software/parseBAM.pl \\\n-i MUTCellsmerged.bam \\\n-o $WORKDIR/matrix/MUTCellsmerged.matrix \\\n--minCoverage 5 \\\n--verbose\nNote: This step produces a matrix of all mapped residues with coverage. It lists the number of reads in which each genomic coordinate is found to be an A,U,G,C, or N. Additionally, it lists the total coverage. Matrixes will be made from APOBEC1-YTH cells (next step) as well and will be used to determine C-to-U mutation rate and find sites in APOBEC1-YTH cells with higher mutation rates than found in APOBEC1-YTHmut control cells.",
    "Note: This step generates a population average of all the APOBEC1-YTHmut-expressing cells. The C-to-U mutation rate of this average in the population will be used as a control. Sites in which the C-to-U mutation rate (%C2U) is not higher than the APOBEC1-YTHmut-expressing cells will be filtered out.\nParse the aligned sequences from each of the APOBEC1-YTH-expressing cells to generate a nucleotide representation matrix for each cell.\nNote: The first step in this script removes duplicate reads from the bamfiles.\ncp $WORKDIR/software/MakematrixYTH.sh $WORKDIR/singlebams\ncd $WORKDIR/singlebams\nsbatch MakematrixYTH.sh\n#Contents of MakematrixYTH.sh\n#!/bin/bash\n#SBATCH -p scavenger\n#SBATCH -c 8\n#SBATCH --mem=60G\n#SBATCH -a 1-301\nfile=$(ls WT∗Aligned.sortedByCoord.out.bam | sed -n ${SLURM_ARRAY_TASK_ID}p)\nSTEM=$(basename \"$file” .Aligned.sortedByCoord.out.bam)\necho \"$[SLURM_ARRAY_TASK_ID]\"\necho “Starting File: $file\"\n#First, use samtools to remove optical duplicates\nsamtools sort -n -o $STEM.name.bam $file\nsamtools fixmate -r -m $STEM.name.bam $STEM.fix.bam\nsamtools sort -o $STEM.possort.bam $STEM.fix.bam\nsamtools markdup -r $STEM.possort.bam $STEM.duprm.bam\nrm $STEM.name.bam $STEM.fix.bam $STEM.possort.bam\n#Then use Bullseye (parseBAM.pl) to make nucleotide matrix\nWORKDIR=\"/your/path/here\"\nBAMS=$WORKDIR/singlebams\nfile=$(ls WT∗duprm.bam | sed -n ${SLURM_ARRAY_TASK_ID}p)\nSTEM=$(basename \"$file” .duprm.bam)\nmkdir $WORKDIR/matrix\nperl $WORKDIR/software/parseBAM.pl \\\n-i $file \\\n-o $WORKDIR/matrix/$STEM.matrix \\\n--minCoverage 5 \\\n--verbose \\\n--removeDuplicates\nNote: When analyzing many cells, it is recommended to perform this as an array so that many cells can be aligned at once. This step first removes optical duplicates from the bamfiles before making the nucleotide representation matrices.\nIdentify C-to-U mutations that indicate m6A methylation.\ncp $WORKDIR/software/find_RNA_edit_sites.sh $WORKDIR/matrix\ncd $WORKDIR/matrix\nsbatch find_RNA_edit_sites.sh\n#Contents of find_RNA_edit_sites.sh\n#!/bin/bash\n#SBATCH --mem=24G\n#SBATCH -p scavenger\n#SBATCH -c 8\n#SBATCH -a 1-301\nWORKDIR=\"/your/path/here/\"\nannotation_file=$WORKDIR/software/hg38refFlat_nochr.gtf\nbed=$WORKDIR/bed\nfile=$(ls WT∗matrix.gz | sed -n ${SLURM_ARRAY_TASK_ID}p)\nSTEM=$(basename \"$file” .matrix.gz)\nmkdir -p $bed\nperl $WORKDIR/software/Find_edit_site.pl \\\n--annotationFile $annotation_file \\\n--EditedMatrix $file \\\n--controlMatrix MUTCellsmerged.matrix.gz \\\n--editType C2U \\\n--minEdit 10 \\\n--maxEdit 95 \\\n--editFoldThreshold 1.5 \\\n--EditedMinCoverage 20 \\\n--ControlMinCoverage 10 \\\n--MinEditSites 2 \\",
    "--cpu 8 \\\n--outfile $bed/$STEM.bed \\\n      --bed6 \\\n      --verbose\nCritical: Thresholds are used during this step to eliminate low quality editing events that are likely to be sequencing errors or APOBEC1-driven editing independent of YTH-mediated m6A binding. The criteria used here are: a minimum of 20 reads of coverage, a minimum of 10% C2U editing within the cell, and at least 1.5-fold higher %C2U than that observed in the APOBEC1-YTHmut population average.\nNote: A number of different thresholds have been tested, but these were shown to produce a list of sites that had important features. 1) An m6A-like metagene profile and 2) strong overlap of methylated RNAs with previously studies. However, if using a different dataset these thresholds may need to be adjusted. Features like metagene analysis and overlap with existing datasets should serve as important factors for determining the validity of the sites identified.\nNote: The annotation file should be in a refFlat format. This specific annotation file is available at the GitHub page https://github.com/tegowski/scDARTHEKcells[href=https://github.com/tegowski/scDARTHEKcells] and should be downloaded to the “$WORKDIR/software/” directory. Detailed instructions for generating this annotation file for any organism are available at https://github.com/mflamand/Bullseye[href=https://github.com/mflamand/Bullseye].\nThis step adds the cell ID (obtained from the file name) as the last column in each bedfile.\nNote: All the potential sites for each cell are listed in separate bedfiles and they need to be combined into a single file. However, the cell ID (e.g., WTCell1) needs to be associated with each site before they are combined in order to keep track of which sites were identified within each cell.\ncp $WORKDIR/software/addCellIDs.sh $WORKDIR/bed\ncd $WORKDIR/bed\nsbatch addCellIDs.sh\n#Contents of addCellIDs.sh\n#!/bin/bash\n#SBATCH --mem=4G\nfor i in ls WTCell∗.bed;\ndo\necho “processing $i\"\nawk '{print $1\"\\t\"$2\"\\t\"$3\"\\t\"FILENAME}' $i > $i.modbed\ncut -f 4 $i.modbed > $i.Ids.txt",
    "awk -F '[-_]' ‘OFS=\"\\t\" {print $2$3$4}' $i.Ids.txt > $i.Ids2.txt\npaste $i $i.Ids2.txt > 2_$i.bed\nrm $i.modbed $i.Ids.txt $i.Ids2.txt;\ndone\nThen combine all the sites from each cell into one master bedfile.\n$cat 2_WTCell∗.bed > Sitesinallcells.bed\nEliminate any remaining sites that do not occur in the core R-A-C motif.\nNote: This filtering step will enrich for site-specific editing events adjacent to the methylated adenosine at the expense of losing some non-adjacent sites in the vicinity of the methylated site.\ncp $WORKDIR/software/RACfilter.sh $WORKDIR/bed\ncd $WORKDIR/bed\nsbatch RACfilter.sh\n#Contents of RACfilter.sh\n#!/bin/bash\n#SBATCH -p scavenger\n#SBATCH --mem=50G\n#add 2nts upstream of C to T site if + strand, if - add downstream\nawk '{ if ($6 == \"+\")\nprint $1\"\\t\"$2-2\"\\t\"$3\"\\t\"$4\"\\t\"$5\"\\t\"$6;\nelse\nprint $1\"\\t\"$2\"\\t\"$3+2\"\\t\"$4\"\\t\"$5\"\\t\"$6\n}' $1.bed > $1.3nt.bed\necho -e '\\n2nts added 5-prime of C:'\nhead -5 $1.3nt.bed\n#get sequence at those sites\nbedtools getfasta -bedOut -fo $1.3nt.sequence.bed -s -fi /datacommons/meyerlab/userdata/matt_tego/genomes/hg38/Homo_sapiens.GRCh38.dna_sm.primary_assembly.fasta -bed $1.3nt.bed\n#Add sequence to tab\npaste $1.bed $1.3nt.sequence.bed > $1.3ntwithseq.bed\necho -e '\\n3mer context of edited C:'\nhead $1.3ntwithseq.bed\n#retrieve lines that have RAC motif from pos file\nawk ‘BEGIN{IGNORECASE=1}{if($13∼\"GAC|AAC”) {print $0}}' $1.3ntwithseq.bed > $1.3nt.RAC.bed\nawk ‘BEGIN{IGNORECASE=1}{if($13!∼\"GAC|AAC”) {print $0}}' $1.3ntwithseq.bed > $1.3nt.nonRAC.bed\nrm $1.3nt.sequence.bed $1.nochr.bed $1.3nt.bed $1.3ntwithseq.bed\nEliminate sites that were previously found to be edited in HEK293T cells by overexpression of APOBEC1 alone (Meyer, 2019[href=https://www.wicell.org#bib10]).\nNote: This is an Rscript that compares sites found in the bedfile from the previous step with sites found when APOBEC1 was overexpressed in HEK293T cells (Meyer, 2019[href=https://www.wicell.org#bib10]).\n#First start R within the $WORKDIR/bed directory\n$ cd $WORKDIR/bed\n$ R\n> #Then run R script that filters\n> library(tidyverse)\n> apoonly <- read.table(“$WORKDIR/software/DARTseq_APOonly_hg38.bed”, col.names=c(“chr\",\"start\",\"end\"))\n> head(apoonly)\n> dartsites <- read.table(“Sitesinallcells.3nt.RAC.bed\")\n> head(dartsites)\n> #Add position column to compare with\n> apoonly <- apoonly %>% mutate(pos = paste0(chr,\"-\",start))\n> dartsites <- dartsites %>% mutate(pos = paste0(V1,\"-\",V2))",
    "> #Filter dartsites for only those that don’t appear in apoonly\n> dartsitesfilt <- dartsites %>% filter(!pos %in% apoonly$pos)\n> write.table(dartsitesfilt, file=\"Sitesinallcells_APOfilt.bed”, col.names=F, row.names=F, quote=F, sep=\"\\t\")\nNote: If performing this experiment in cells other than HEK293T, a dataset of C-to-U editing events in cells expressing APOBEC1 alone may not be available. This is included for optimal high quality m6A identification, but it only eliminates a small fraction of sites (∼1%). Therefore, this step is optional and high-quality sites can be determined without such a filtering step.\nThis step utilizes an R script to remove sites from cells that did not pass the quality control steps when analyzing the cells using Seurat (steps 91–96). Additionally, this script will also only keep sites found in at least 10 cells.\nlibrary(tidyverse)\n> sitelist <- read.table(“bed/Sitesinallcells_APOfilt.bed\")\n> FilteredCells <- read.table(“aligned/QCpasscells.txt”, header=T)\n#Filter out sites in low quality cells\n> sitelist2 <- sitelist %>% filter(V12 %in% FilteredCells$x)\n#Now find the number of cells each site is in and filter out those in < 10 cells\n> ncells <- sitelist2 %>% group_by(V14) %>% count()\n> sitelist3 <- merge(sitelist2, ncells, by=\"V14″)\n> sitelist3 <- sitelist3 %>% filter(n > 9)\n> write.table(sitelist2, file=\"/work/mrt41/Ex96_SMARTseq/test/bed/Finalsitelist.bed”, row.names=F, col.names=T,sep=\"\\t\",quote=F)\nNote: This step is done to reduce the likelihood of calling sites that were found in very few cells as these may be likely to be noise or sequencing errors. These parameters can be optimized (Both cell quality parameters in steps 91–96 and the minimum number of cells a site must be found in). Although we found that these worked well in this case to identify m6A sites, optimal parameters may be affected by conditions like sequencing saturation, number of cells sequenced, and level of transgene expression. Therefore, if using another dataset, these thresholds may need to be adjusted.",
    "At the end of these steps, a file containing 513,564 total sites (25,896 unique methylated site locations) should be obtained (Table S2[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1927-Mmc1.xlsx]). This file will contain the genomic coordinates, annotated gene name, % C-to-U editing, and cell ID, among other information that can be used in downstream analysis."
  ],
  "subjectAreas": [
    "Rnaseq",
    "Flow Cytometry",
    "Cell-Based Assays",
    "Molecular Biology",
    "Gene Expression",
    "Sequencing",
    "Single Cell"
  ],
  "bigAreas": [
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}