{
  "id": 9699,
  "origin_website": "Jove",
  "title": "Screening Assay for Oxidative Stress in a Feline Astrocyte Cell Line, G355-5",
  "procedures": [
    "1. Cell culture of feline astrocytes and treatment with H2O2\nCulture cell line G355-5 in a 75 cm2 flask with DMEM media plus nutrients at 37°C and 5% CO2 until 60% confluent (˜ 5 days). Replace the media every 1-2 days or as needed to maintain a healthy culture.\nRemove media and add 2 ml of 0.25% trypsin.  Lift the cells by pipetting for 45 s - 1 min at room temperature (RT).\nQuickly transfer the suspension to a 15 ml conical tube containing 10 ml of media. Mix gently.\nCentrifuge at 300 x g, 23°C for 3 min to obtain a pellet.  Discard the supernatant without disturbing the pellet.\nAdd 6-7 ml of fresh media and resuspend the cells.\nAdd ˜ 1 ml of cells to each well of a 6-well plate.  Add 2-3 ml of media to each well and incubate until 80-90% confluent.\nPrepare a 100μM solution of peroxide (H2O2) in media.\nRemove media from each well and replace with either 2 ml fresh media (control), 2 ml of H2O2 (treatment) or 2ml of DPBS.  Incubate at 37°C, 5% CO2 for 3 h.\nRemove solutions and add 1 ml of trypsin to lift the cells.  Transfer cells to a 1.7 ml Eppendorf tube containing 0.5 ml DPBS.  This step should be performed on each well individually in order to prevent cell death from prolonged trypsin incubation.\nSpin at 300 x g for 3 min, discard the supernatant and resuspend in 1 ml of DPBS.\n2. Staining for ROS\nAll steps for staining should be carried out with minimal light exposure to prevent bleaching.\nAdd 1 μl of 50 mM CCCP to the positive control.  Incubate at 37°C, 5% CO2 for 5 min.",
    "Add 5 μl of a 10 mM CM-H2DCFDA solution to the H2O2 group.  Incubate at 37°C, 5% CO2 for 15-30 min. No stain is added to the saline sample.\nWash samples with 2 ml of DPBS to remove residual stain.\nSpin at 300 x g for 3 min to obtain a pellet.\nResuspend cells in 0.5 ml of DPBS.  Add 1 μl PI to each sample, except the saline.\nTransfer samples to a 5ml flow cytometer tube.\nRun on the flow cytometer.\n3. Flow cytometry\nRun samples on a Beckman Coulter FC500 (or equivalent) equipped with a 488 nm argon laser and the following band passes: 525, 775 and 620 nm, all ± 20 nm.\nPrepare the appropriate controls: unstained cells, CM-H2DCFDA stained only, PI only, double stained (negative control).\nMake a protocol that has the following histoplots: FS vs. SS, PI vs. CM-H2DCFDA.  It should also have the following histograms: cell number vs. FL1, FL2 and FL3, which corresponds to the stains.\nBefore running the samples, check equipment, fluids and waste container.  Warm up the equipment for at least 20 min.\nClean the equipment and perform a calibration with the appropriate beads according to the manufacturers standards.\nSelect your protocol and run the samples.\nClean the equipment as done previously.\nClean the vacuum line according to the manufacturers standards.\nTurn off the flow and clean the head/vacuum line.\nTurn off the software and the computer.\n4. Representative Results:",
    "Flow cytometry results were analyzed using FlowJo 7.6 and the stain controls were used to objectively set the gating.  Based on this, healthy cells appear on the left of the histogram and ROS (oxidative stress) was detected as a shift of cells to the right.  Figure 1 shows the results of the effect of hydrogen peroxide on healthy feline astrocytes.  Data from FL1 was used to measure the intensity of CM-H2DCFDA, which indicates the presence of ROS.  As expected, a higher amount of ROS was detected in the sample treated with H2O2.  This is displayed on the histogram as a shift in fluorescent intensity from left to right.  When comparing healthy cells treated with DMEM versus DPBS, there was no significant change in the amount of ROS (Fig 2).\nimgsrc://cloudfront.jove.com/files/ftp_upload/2841/2841fig1.jpg\nFigure 1. Flow cytometry results of levels of oxidative stress in healthy feline astrocytes and the effect of H2O2 on healthy cells.  The results indicate that H2O2 increases levels of ROS in healthy cells as compared to cells with no treatment (DMEM).\nimgsrc://cloudfront.jove.com/files/ftp_upload/2841/2841fig2.jpg\nFigure 2. Flow Cytometry results of levels of ROS detected in healthy cells incubated for 3hrs with DPBS.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}