{
  "id": 17796,
  "origin_website": "Jove",
  "title": "Measurement of Carotenoids in Perifovea using the Macular Pigment Reflectometer",
  "procedures": [
    "All subjects were recruited at a single site, the Western University of Health Sciences. The study was approved by the institutional review board at Western University of Health Sciences, Pomona, California, USA, and conducted in accordance with the tenets of the Declaration of Helsinki. Prior to participation all participants were given a detailed explanation of the study and signed an informed consent form before any standard ophthalmic evaluation was carried out.\n1. Participant recruitment\nInclude participants that are at least 18 years of age and have a visual acuity of 20/40 or better.\nInclude participants with clinically insignificant conditions like cataracts, isolated drusen, posterior vitreous detachment, familial drusen in periphery, and peripheral retinal conditions, such as lattice degeneration, or retinal pigment epithelial defects. Ensure that the participants have normal binocularity and that they do not have suppression32.\nAccomplish this by the administration of a suppression test32. This is a crucial step because in the absence of normal binocularity, participants will not be able to recognize the fixation target and measurement of light source simultaneously and thus would confirm the appropriate location of measurement in the fovea and parafoveal regions.\nExclude all participants less than 18 years of age, with visual acuity worse than 20/40, with retinal damage in the macula region (central part of the retina), glaucoma, diabetic retinopathy, hemorrhage, severe cataract, or vitreous opacities preventing ophthalmic imaging or MPR measurements.\nExclude participants who are unable to perform the measurements using heterochromatic flicker photometry or reflectometry, those for whom the devices are unable to provide MPOD values, or those with ocular suppression.\n2. Creating the peripheral track system (Figure 3)",
    "Obtain a slidable track with an approximately 1 m (3.5 feet) long aluminum rail that contains a hollow indent with space for a slidable track, such as a door weather strip.\nMount the track 6.1 m (20 feet) from the subject seated at the MPR for the reflectometry measurements to be performed. Ensure that the track is 1.5 m off the ground to be at the same height as the participant's eye during the reflectometry measurement.\nMount three 1 cm x 1 cm remote controlled LED lights on the slidable track so that the centers of the lights are spaced 10.7 cm away from each other.\n\tNOTE: The 10.7 cm signify each degree and was determined because each LED light is 6.1 m away from the participant. The distance of 6.1 m (~20 feet) is the minimum distance to obtain a true optical infinity, but if a track system is created at a further distance, the distance between each LED light would change and a new distance would have to be calculated trigonometrically. (See Table 1). If fewer than 6 m are utilized, pupillary dilation is advisable to minimize the ocular accommodation.\n3. Measurements using a heterochromatic flicker photometer\nNOTE: This step is for additional data collection and is not essential for peripheral measurements using the reflectometer.\nInstill artificial tears in both eyes, ask the participant to blink a few times, and patch the eye that is not being tested.\nExplain the procedure to the participant.\nInstruct the participant to look at the central fixation target of the heterochromatic flicker photometer visible through the eyepiece and to press the clicker each time they observe the target flickering. Ensure that the fixation target flickers a total of five times to determine the initial threshold.",
    "View the results of the initial threshold and remind the participant to click the button each time the central fixation target flickers as the test continues for 45 s to 1 min.\nA graph and MPOD value will appear on the control monitor along with a reliability index. Ensure that \"acceptable\" is displayed on the reliability index. Repeat the test if results indicate \"borderline\" or \"unacceptable\" until an \"acceptable\" reliability index is obtained.\nClick on the next green arrow that appears on the control monitor once the participant has finished the test to save the results.\n4. Central measurement procedure using the reflectometer\nNOTE: The subsequent steps will lead to the measurement of individual carotenoids. This is performed using the reflectometer. The central measurements need not be performed to measure peripheral measurements with the reflectometer. However, the central measurements are important for clinical use.\nInput the participant information into the reflectometer software.\nClick the Run Eye Test tab.\nWhite Calibration\n\tNOTE: This is a pivotal step in the calibration of the spectrometer within the reflectometer device to full spectrum white sample. This is performed once a day when the device is turned on by the technician. A participant is not needed for this step.\n\t\nClick the White button next to Calibrate.\nInsert the white calibration tube onto the reflectometer after the message instructing the user to insert the \"white calibration tube\" is displayed on the screen.\nClick OK once the white calibration tube is inserted to begin the white calibration. Ensure the Black button next to Calibrate has been enabled after the White Calibration Successful message has appeared on the screen.\nBlack Calibration\n\t\nInstill a drop of artificial tears into the participant's eyes and have them place their chin onto the chin rest.",
    "Instruct the participant to place their eye close to the eye cup. Using the joystick, gently position the system so the eye cup presses against the participant's eye socket and blocks the room light from the system.\nClick the Black button to select Calibrate and align the system to the participant's pupil. Proper alignment is achieved when the pupil is centered in the circle displayed on the touch screen monitor.\nInstruct the participant to adjust the rotating knob on the front of the system to obtain a clear target.\nClick OK once the participant has properly adjusted the system to their vision. The system will automatically carry out a black calibration sequence. Once black calibration has been successfully completed, the Left Eye and Right Eye buttons will be enabled, and a Black Calibration Successful message will appear on the screen.\nStart of measurement\n\t\nClick the Left Eye or Right Eye button on the screen depending on which eye is being measured.\nEnsure that the system displays the message Align System to Subject's Eye. Ensure that the system is aligned to the participant's pupil. Use the joystick to make fine adjustments.\nClick the OK button on the screen to start the MPOD measurement. The measurement time is 30 s. A minimum of 10 s is needed to obtain the parameters/results. A countdown timer will appear on the top of the screen displaying how much time is left for the measurement. Ask the participant to look at the fixation light and encourage them to only blink when necessary.\nUse the joystick during the measurement to ensure the system stays in alignment with the participant's pupil.\nEnsure the system displays a message stating Measurement Successful once the measurement is completed.\nClick the OK button to finish.",
    "Repeat steps 4.4–4.6.6 to test the other eye if needed. The entire process takes about 2–3 min.\n\t\tNOTE: To repeat the measurement on the same eye wait at least 30 s then repeat steps 4.6–4.6.6.\n5. Peripheral measurement technique using reflectometer (Figure 3)\nNOTE: The untested eye will fixate on a target allowing for placement of the stimulus at various eccentricities from the fovea of the tested eye. This methodology requires normal binocularity to allow for correct positioning of the eye in which the macular pigment optical density is being measured.\nInput participant information into the reflectometry software.\nClick the Run Eye Test tab.\nPeripheral track calibration\n\t\nAfter the white and black calibration is performed, press the Left Eye or Right Eye button on the screen depending on which eye is to be measured.\nThe system will display a message Align System to the Subject's Eye. Ensure that the system is aligned to the participant's pupil. Use the joystick to make fine adjustments.\nTurn on the LED light on the track system that is farthest right to the participant. At this time, the participant should be able to see both the light from inside the reflectometer with their right eye and the red LED light with their left.\nInstruct the participant to direct the trained observer to adjust the peripheral track until they can superimpose both stimuli to the best of their ability.\n\t\tNOTE: There can be variability between participants on how far their superimposed \"calibration point\" is due to anatomical differences.\nStart of measurement\n\t\nTurn off the LED light and switch on the next LED light (to the left) to carry out the next 1 degree eccentric measurement. Explain to the participant that they need to look at the new red LED light throughout the entire measurement.",
    "Click the OK button on the screen to start the MPOD measurement. The measurement time is 30 s. A countdown timer will appear on the top of the screen displaying how much time is left for the measurement. Ask the participant to look at the appropriate red LED light and encourage them to only blink when necessary.\nUse the joystick during the measurement to ensure the system stays in alignment with the participant's pupil.\nEnsure the system displays a message stating Measurement Successful once the measurement is completed.\nClick the OK button to finish.\nRepeat steps 5.3.1–5.4.5 to retake a measurement.\n\t\tNOTE: The entire process takes about 2–3 min. Two measurements are recommended for each degree to allow for the comparison. To repeat measurements at a different retinal eccentricity, change the degree separation in step 4.8.\n6. Analysis (Figure 4)\nMake a copy of the file to be analyzed.\n\tNOTE: The file analyzed was generated in steps 4.6.6 and 5.4.5. This step is not essential but allows for various analyses performed without altering the original data.\nOpen the reflectometry software on the desktop.\nClick Import on the left side of the application and choose the copied file to be opened.\nClick Edit under the Subject Record tab. A new window will open. This will help obtain data from the desired time interval.\nMove the bottom slide bar up from 0 to 10 to eliminate the first 10 s of measurement.\n\tNOTE: The slide bar should read 10–30. These slide bars can move up or down to choose the desired time interval to analyze. (see Figure 4).\nClick the Exit button on the left side of this window. A warning window will pop up. Select OK to confirm the interval cuts.",
    "Click Launch Analyzer on the bottom left of the program (see Table of Materials). A new window will open.\nClick Best Fit at the bottom of the page. This will populate the first set of data, including L-OD and Z-OD.\nRecord the data.\nClick Reset to select another analysis option.\nSelect Macular Pigment under the Receptor Model options.\nClick Best Fit to populate the second set of data, including MPOD.\nClick Save Solution to save this interval."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}