{
  "id": 3267,
  "origin_website": "Cell",
  "title": "Transduction of Primary AML Cells with Lentiviral Vector for In Vitro Study or In Vivo Engraftment",
  "procedures": [
    "Step-By-Step Method Details\nStep-By-Step Method Details\nInteraction of Primary AML Cells with Concentrated Virus (Day 1)\nTiming: 6–7 h\nIn this section the virus will be spun down onto Retronectin-coated plates. The primary AML cells will be incubated with virus for transduction.\nCritical: Next steps should be performed in a containment lab equipped to handle viral samples.\nThaw the vials of concentrated virus in a 37°C water bath.\nAdd the 500 μL of concentrated virus onto Retronectin-coated plates (none in corner wells), spin plates at 3,000 rpm for 5 h at 4°C.\nAlternatives: This step can be performed at 20°C–22°C if preferred as no severe toxicity from the concentrated virus was observed using this temperature.\nAfter spinning the above plates with concentrated virus for 5 h, pipette out 400 μL and leave 100 μL of virus in the wells.\nDuring the 5-h spin, prepare the primary AML sample (frozen in 90% FBS +15 U/mL of heparin + 10% DMSO. As an alternative, samples may be frozen in alpha MEM + 5% FBS + 10% DMSO): Thaw X-VIVO 10 medium (Lonza, 04-380Q) and add to the medium BIT 9500 serum substitute at 4:1 ratio (Stem Cell Technologies #09500) along with cocktail of human cytokines and growth factors (GFs) IL3 (10 ng/mL), SCF (50 ng/mL), FLT3 ligand (50 ng/mL), G-CSF (10 ng/mL), TPO (25 ng/mL) and IL-6 (20 ng/mL).\nCritical: After the addition of cytokines, the medium should not be heated more than 20 min in a 37°C water bath. In addition, the medium is photosensitive and should be covered with aluminum foil at all times.\nPause Point: Medium can be kept for ~2 months at 4°C.\nThaw frozen primary AML patient sample in 37°C water bath (5–10 million cells).",
    "Add thawed AML sample to 50 mL IMDM+10% FBS medium. Spin at 2,000 rpm for 10 min to pellet. Re-suspend pellet in 10 mL X-Vivo + BIT + GFs medium at a cell count of 5 × 105 cells/mL.\nCritical: Thaw the patient samples as fast as possible and add sample immediately to the medium. Otherwise, the cells will clump, and the sample will be lost.\nAdd 10 μL protamine sulfate (final concentration 5 μg/mL) to 10 mL of cells in medium.\nAdd 1 mL of AML cells (5 × 105/mL) to all 24 wells (4 corner wells are for No Virus controls) and then spin plate at 1,300 rpm for 10 min to increase the interaction between the cells and lentiviral particles. The spin time can be increased depending on experimental needs.\nIncubate AML patient sample cells with the virus for ~24 h at 37°C in a 5% CO2 incubator.\nCritical: Throughout the procedure use sterile filter tips and individually wrapped plastic pipettes.\nCollection of Transduced Cells (Day 2)\nTiming: 1–2 h\nIn this section cells will be collected and transduction efficiency will be measured by calculating the percentage of GFP positive cells. The cells will be injected into the sub-lethally irradiated immune compromised mice.\nCollect the cells from each well and transfer them to sterile 50 mL tubes.\nCritical: The medium in each well should be pipetted up and down several times before the cells are transferred to the tubes. If this step is not performed, the majority of cells will be lost.\nNo virus control cells and virus treated cells should be collected in separate tubes.\nSpin transduced cells at 2,000 rpm for 10 min. Decant the supernatant into 10% bleach.",
    "Re-suspend AML cells in fresh X-Vivo10 + BIT + GFs medium at a final count of 1 × 106 cells/mL, final volume depends on the total cell count.\nAliquot 1 mL of cells to a new 24-well plate. The user can set up the plate as desired. A suggestion is given in Figure 1[href=https://www.wicell.org#fig1].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/286-Fig1.jpg\nFigure 1. Plate Setup\nA suggested layout for the setup of the plate for the transduction of primary AML cells.\nLeave overnight at 37°C, 5% CO2 incubator.\nThe percentage of GFP positive cells in total viable cell population (7AAD negative) can be measured in an aliquot of cells that were not injected into the mouse using a flow cytometer. These values are required to calculate engraftment potential at the end of in vivo experiments.\nAlternatives: GFP levels can be measured at days 3 and 4 as well.\nTo confirm the target gene knockdown, sort GFP+ cells at day 2–3 post transduction and perform RT-PCR.\nInfected cells can be maintained in culture for up to 1 week for downstream in- vitro experiments.\nTo engraft the marrow of immune deficient mice, inject 3 × 105 to 1 × 106 of AML cells into immune deficient mice. One possible mouse strain are sub-lethally irradiated (200 rad) immunodeficient NOD/SCID (6–10 weeks) mice, conditioned with intraperitoneal injection of anti-mouse CD122 antibody generated in house using the TM-beta1 Hybridoma. (200 μg/mouse) 24 h prior to injection of cells. The engraftment was evaluated using anti-human CD45 and CD33."
  ],
  "subjectAreas": [
    "Stem Cells",
    "Cancer"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}