{
  "id": 11743,
  "origin_website": "Jove",
  "title": "Tickling, a Technique for Inducing Positive Affect When Handling Rats",
  "procedures": [
    "All experiments were carried out in accordance with the National Institutes of Health Guide for the Care and Use of Laboratory Animals31,32 at facilities accredited by AAALAC International and were approved by the Washington State University Institutional Animal Care and Use Committee. The following protocol can  expose personnel to laboratory animal allergens. Personal protective equipment should be worn as recommended by the institutional occupational health and safety program and health care providers. The protocol depicts procedures under typical laboratory housing conditions but could be adapted for use in higher-biosecurity facilities (e.g. by using a biosafety cabinet, etc.). \n1. Preparation of Equipment and Setup\nHandling box\n\t\nPrepare an animal's home cage or other enclosure for tickling, hereafter called the handling box.\nMake sure the handling box is large enough to provide space for the tickler's hand and for the rats to move around while preventing them from jumping out.\nMake sure the handling box is free of obstacles. Thus, if conducting tickling in the home cage, remove any objects such as huts, gnawing sticks, and crinkled paper.\nLine the handling box floor with bedding33. Other types of soft floor cover can be used but are not as effective at eliciting 50-kHz vocalizations13.\nPlace the handling box on a table or countertop at a height that allows the handler's hand to comfortably reach the entire floor area of the handling box.\nMinimize the effect of novelty by habituating the rats to the handling box prior to tickling, if needed.\nTimer: To indicate the start and end of 15 s bouts, place a timing device near the handling box where it can be easily read. Alternatively, an auditory time signal may be transmitted to the tickler through earphones.\nVocalization recording",
    "If vocalizations are being recorded to quantify different vocalization types for research purposes, use a microphone capable of capturing 10-120-kHz broadband sound, connected to a device capable of recording high frequency sounds.\nSuspend or attach the microphone at the top or side of the box, low enough to clearly detect the calls and avoid confusion with calls from rats in nearby cages, but out of physical reach of the rats.\nIf vocalizations only need to be monitored to confirm proper tickling technique, then use a bat detector and set it up on the side of the box. If using a simple, heterodyne detector, set the device at 50-kHz.\nLaboratory gloves: Use a bare or thinly gloved hand when tickling. The tickling technique was developed using a bare hand.  However, a thinly gloved hand is also effective at inducing playful behavior and 50-kHz USV production while allowing the handler to sense the amount of pressure being applied to the rat's body and feel the rat's responses through the glove.\n2. Tickling Procedure\nPut on the laboratory gloves, if required. Bring the home cage to a table or workbench. Gently transfer the rat into the handling box if tickling is not conducted in the home cage. Start the timer, and the audio recording if needed.\nFor consistent application, alternate between 15 s of hand contact and 15 s release from contact for a total of 2 min. This duration of interaction has been found sufficient for increasing attraction of rats to humans11.",
    "To begin the tickling session with a 15 s release, place the hand motionless inside one side of the handling box. The presence of the hand allows rats to solicit interaction by directing licks and light nips (nibbles) towards the hand, indicating the rat's interest to interact22. When this occurs, move the hand away from the rat, which can solicit playful chasing of the hand by the rat. Alternatively, leave the hand out of the box during the 15 s release.\nFollow the release with 15 s of tickling, initiate the interaction with a dorsal contact (2-4 s). Using one hand, vigorously touch the rat's nape (dorsal surface of the neck) with the fingertips using rapid finger movements as commonly performed in human tickling. Avoid contact with the rump as this area of the body is targeted during aggressive encounters34.\nFollow the dorsal contact with a pin. Place the thumb and middle finger under the rat's forelegs; lift the rat, just high enough to allow quickly turning the rat on its back while ensuring the tail does not get kinked.\n\t\tNOTE: It may help to lightly push on the back of the rat with the little finger when turning the rat on its back.\nHold the rat loosely, but firmly; be assertive but not forceful. Once the rat is on its back on the floor, hold the body down loosely while moving the fingers quickly and vigorously but gently on the belly, as is commonly used in human tickling.\nEven though the stimulation is rapid and assertive, keep the pinning brisk (2-4 s/pin) to minimize negative responses. Allow the rat to right itself and rapidly follow with a dorsal contact.\nContinue to alternate between dorsal contacts and pins. On average, there should be 4 to 5 pins/15 s35.",
    "Do not pick up the rat with both hands. During the 15 s of tickling, always keep the fingers moving and in contact with the rat's body, even in transitions between pins and dorsal contacts.\nPerform three additional 15-s tickles and 15-s releases for a total of 2 min.\nIf using a handling box, return the rat to its home cage. If using the home cage, place enrichment objects back in the cage. Clean the handling box with paper towels to remove feces and urine not absorbed by the bedding.\nRepeat with the next cage of rats, as needed.\n3. Tickling Multiple Rats Simultaneously\nRats can be tickled as a group36. If the handling duration is not relevant, alternate tickling each rat for 15 s. The duration of the tickling session can be extended beyond 2 min as needed so that each rat receives four bouts of tickling hand contact interspersed by release.\nIf the handling duration is relevant for research results, then use the following procedures:\n\t\nFor pairs, tickle one rat for 15 s followed immediately by tickling the second rat for the next 15 s (i.e., during the release of the first rat), and so on. The tickler does not have a rest period.\nFor triplets, use the procedure described in 3.2.1 to tickle two of the rats and tickle the third one at the same time as one of the others using the other hand.\nFor groups of 4 or more rats, tickle each rat or pair of rats for 15 s. The duration of the tickling session can be extended beyond 2 min as needed."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}