{
  "id": 11085,
  "origin_website": "Jove",
  "title": "Membrane-SPINE: A Biochemical Tool to Identify Protein-protein Interactions of Membrane Proteins In Vivo",
  "procedures": [
    "Note: Detailed information regarding buffers indicated in the protocol is available in Table 1.\n1. Fixation of Protein-protein Interactions by Formaldehyde Cross-linking in Living Cells\nTo begin prepare growth media, stock solutions and buffer P1\n\t\nPrepare 500 ml medium: The medium should provide conditions that support the interaction between membrane bait protein and prey proteins. In addition, one experiment should be performed under conditions where no interaction is expected (e.g. without cross-linking).\n\t\tNote: We compare protein-protein interactions in stressed and non-stressed bacteria. Therefore, we prepare 500 ml Luria Bertani (LB) medium (Table 1) that we complement with a stress-inducing agent (e.g. 0.5 M NaCl) in a 2 L Erlenmeyer flask. For control, we use normal LB medium with 0.17 M NaCl (pH 7.0).\nPrepare Tris-buffer (20 mM Tris-HCl; pH 8.0) and 0.1 M ethylenediaminetetraacetic acid (EDTA), pH 8.0 stock solution (Table 1).\nPrepare buffer P1. Dissolve sucrose to a final concentration of 0.5 M in Tris-buffer. Sterilize buffer P1 by filtration and store it at 4 °C.\nGrow cells expressing the membrane bait protein with a C-terminal Strep-tag fusion from a vector. Induce the expression of membrane bait proteins for a sufficient time.\n\tNote: We induce the expression of bacterial membrane bait proteins at early-log phase (A600 = 0.3) by addition of 250 µl 1 M isopropyl-β-D-thiogalactopyranoside (IPTG) to 500 ml medium (final concentration: 0.5 mM). To allow sufficient expression, we incubate the bacteria until the late-log phase (A600 = 1.2).\nPrepare for each culture two centrifuge beakers with a minimum volume of 300 ml each and place them on ice.\nPerform formaldehyde cross-linking.\nCAUTION: Formaldehyde is highly toxic. We recommend working under a safety fume hood.",
    "Transfer the culture vessel under a safety fume hood. Split each sample into two samples, one omitting cross-linking (- X) and one including the formaldehyde cross-linking (+ X). Add 4 ml 37% formaldehyde solution to 250 ml culture to reach a final concentration of 0.6%.\nTransfer the culture vessels back and grow cells for further 20 min as before.\nFill your cultures into the centrifuge tubes under a safety fume hood. Collect cells by centrifugation at 3,000 x g for 30 min.\nDiscard supernatant by carefully pipetting it up under a safety fume hood. Collect toxic formaldehyde-containing supernatant and dispose of it properly.\nIn order to reach optimal yield during membrane protein preparation, prepare spheroplasts first. Here, we provide a protocol for spheroplast formation of Gram-negative bacteria:\n\t\nPrepare buffer P2 (Table 1) from lyophilized powder. Gently dissolve 2 mg lysozyme in 0.1 M EDTA, pH 8, in a 1.5 ml tube. Always prepare buffer P2 freshly for the day of the experiment.\nPrepare Tris-buffer with protease inhibitor (buffer P3). To 10 ml of Tris-buffer, add 0.1 ml 1 M phenylmethylsulfonylfluoride (PMSF) (Table 1) to a final concentration of 10 mM. Use the buffer immediately, to ensure proper function of PMSF as protease inhibitor.\nResuspend cell pellets in 10 ml Tris-buffer with protease inhibitor and transfer solution to a 15 ml conical tube.\nAdd 1 ml buffer P2 and incubate on ice for 30 min.\nCollect spheroplasts by centrifugation at 3,000 x g for 30 min and discard supernatant carefully.\nIncubate the spheroplast pellets overnight at -20°C.\n2. Purification of Strep-tag Membrane Protein (Bait)\nPlace spheroplast pellet on ice.",
    "During the time the spheroplast pellets thaw on ice, prepare 10 ml buffer P3 for each spheroplast preparation. Gently dissolve 1 mg DNaseI in 10 ml Tris-buffer. Add 0.1 ml 1 M PMSF just before use.\nResuspend the pellet in 6 ml freshly prepared P3. Sonicate the sample four times for 1 min continuously on ice with 1 min pause between each burst, in order to disrupt spheroplasts.\nCentrifuge the sample at 10,000 x g for 10 min to harvest cell debris. Transfer the supernatant using a pipette to an ultracentrifuge tube.\nPellet the membrane fraction at 100,000 x g for 30 min. Wash the pellet carefully in Tris-buffer without dissolving it. Dry the tube with a paper tissue (e.g. Kleenex). Avoid disturbing the pellet at any time.\nResuspend the pellet (= membranes) carefully in 1 ml Tris-buffer. Use a 20 µl aliquot to determine the protein concentration by e.g. BCA assay. At this step, the membranes can be shock frozen in liquid nitrogen and stored at -80 °C.\n3. Purification of Strep-tag Membrane Bait Protein and SDS-PAGE\nNormalize the protein concentration of the membrane fraction to 5 mg/ml with Tris-buffer. Take 2.5 ml membrane fraction (5 mg/ml) in an ultracentrifuge tube and add 0.25 ml of 20% Triton X-100 to reach a final concentration of 2%, in order to solubilize the membrane proteins. Add a micro-magnetic rod and stir on ice for 1 hr.\nNote: Although in general we have good results using Triton X-100 as detergent, it might be useful to change the detergent for optimization. In this respect, we have best results with those detergents used for functional purification of the respective membrane bait protein.",
    "While performing step 3.1, prepare 50 ml buffer W and 5 ml buffer E from (Table 1). Fill up 10 ml 5x buffer W concentrate to 50 ml and add 150 µl 20% Triton X-100.\n\t\nFill up 1 ml 5x buffer E concentrate to 10 ml and add 30 µl 20% Triton X-100. Equilibrate a 1 ml Strep-Tactin superflow gravity flow column with 8 ml buffer W.\nNote: It is essential to add the detergent used for solubilization in a concentration 10-fold above the critical micelle concentration (cmc) in any buffer during the purification procedure.\nRemove the micro-magnetic rod from the solubilization sample and ultracentrifuge at 100,000 x g for 30 min, to pellet the insoluble membrane fraction. Remove the supernatant using a pipette for further purification.\nLoad the supernatant to the column. Run the column only with gravity flow. Wash the column with 5 ml buffer W. Repeat this washing step 5x.\nElute membrane bait proteins with 1 ml buffer E. Repeat this elution step 4x.\nConcentrate elution fractions 2, 3, and 4 to 300 µl with a centrifugal filter unit.\nMix 200 µl of each sample with 50 µl 5x SDS-PAGE loading dye. Split each preparation in 125 µl aliquots. Boil one aliquot of each preparation for 20 min at 95 °C, to reverse formaldehyde cross-links. Let samples cool down to RT for at least 10 min on bench top.\nLoad 30 µl from each sample to a single lane of a polyacrylamide-gel suitable for immunoblotting. Use a prestained molecular weight marker for best orientation and run SDS-PAGE10.\n4. Immunoblot Analysis to Confirm Interaction Partners\nOnce step 3.8 is completed, transfer proteins to a nitrocellulose membrane by e.g. semidry.",
    "Block the membrane to prevent unspecific labeling. Prepare blocking buffer by weighing bovine serum albumin (BSA) to achieve 3% weight per volume in Tris-buffered saline supplemented with final a concentration of 0.05% Tween-20 (TBS-T). Use a sufficient volume of blocking buffer to cover the membrane. Block the membrane for 1 hr at RT.\nDilute and incubate the prey protein specific first antibody as usual. Use an HRP-linked antibody as the second antibody.\nDevelop the immunoblot using a chemiluminescent detection kit with high sensitivity. Monitor the signal using a classical film processing procedure or digital imaging equipment.\n5. NanoLC-ESI-MS/MS High Resolution Experiments to Identify Interaction Partners\nIn case that no specific antibody is available for the prey protein or unknown interaction partners should be identified, use mass spectrometry (MS) for identification. In order to prevent keratin contamination, use precasted gels for protein separation.\nSilver stain the SDS-PAGE using a MS-compatible staining kit according to the manufacturer's protocol. Perform all staining and washing steps in glass tanks.\nExcise respective bands and analyze these by high resolution LC/MS9.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}