{
  "id": 9264,
  "origin_website": "Jove",
  "title": "An In Vitro Model for the Study of Cellular Pathophysiology in Globoid Cell Leukodystrophy",
  "procedures": [
    "All procedures involving animals were performed in accordance with the Policy on Humane Care and Use of Laboratory Animals set forth by the Office of Laboratory Animal Welfare (NIH) and only with approval from the Institutional Animal Care and Use Committee (IACUC) of the University of Connecticut Health Center.\n1. Preparation of Mixed Glial Cultures\nSterilize all instruments prior to use. Add 3 ml of ice-cold sterile Hank’s balanced salt solution (HBSS) containing no cations (Mg2+ or Ca2+) to three sterile 60 mm Petri dishes maintained on ice to keep cold.\nIsolate the cortices from postnatal P0-P2 mouse pups, as previously described17,18.\n\tNOTE: Subcortical structures, such as hippocampi, are not included in these cultures.\nCarefully remove the meninges and then transfer the isolated cortices to fresh HBSS and dissociate the tissues enzymatically, using a neural tissue dissection kit according to the manufacturer's protocol.\nPlate the cells into sterile T-175 flasks and incubate overnight in media [Dulbecco's modified eagle medium (DMEM) with 10% fetal bovine serum (FBS) containing 1x penicillin/streptomycin].\nReplace all media the following day with fresh media. Continue to incubate cultures, with regular media changes, for approximately 3 weeks or until a cellular monolayer is established.\n\tNOTE: This monolayer will be comprised of astrocytes and microglia with an approximately 10:1 ratio19.\n2. Globoid Cell Induction in Mixed Glial Cultures\nPrepare the ECM-coated coverslips.\n\t\nSoak circular coverslips with sterile 1 N hydrochloric acid (HCl) in a sterile Petri dish for 30 min. Wash coverslips with sterile water 3x and then soak in 95% EtOH for at least 20 min. and then let air-dry.",
    "Place droplets of diluted extracellular matrix (ECM) protein coating materials onto a sheet of Parafilm (e.g. 150-250 µl/droplet of laminin 10 μg/ml dissolved in sterile phosphate buffer solution [PBS]). Distribute the droplets so that coverslips will not touch when placed onto these droplets. Gently place each dried coverslip onto a droplet using forceps.\nLeave the coverslips on the droplets for approx. 4-6 hr inside the culture hood with the sash closed.\nPlace the ECM-coated coverslips (ECM-coated side up) into each of the wells of a 24-well plate. Wash each well with sterile PBS 3x and keep at 4 °C until needed.\nPreparing Glial Cells for Plating onto Coverslips.\n\t\nAspirate the media from the glial cultures and gently wash the glial monolayer 3x with 10 ml of sterile PBS. Next, add 8-10 ml trypsin-EDTA solution to the T-175, and incubate for 5-10 min at 37 °C.\nWhen most of the monolayer has been detached, add 20 ml of complete media to the flask to stop trypsinization. Collect the media containing the detached cells into a 50 ml conical tube and spin for 10 min at 300 x g at room temperature.\nAspirate the supernatant without disturbing the pellet, and then re-suspend the cells in 2 ml of fresh complete media by gently pipetting the solution using a P1000 pipet.\nDetermine the number of cells using a hemocytometer and then re-suspend cells in complete medium at the desired density (e.g. 105 cells/ml). Plate the cells onto the ECM-coated coverslips (e.g. 500 μl into each well of the 24-well plate). Add additional fresh complete media to each well for 3-5 days of incubation at 37 °C, or until cells grow to the desired visual confluence.\nTreatment with Psychosine.",
    "Reconstitute the psychosine to a stock concentration (108.3 mM) in dimethyl sulfoxide (DMSO). Dilute this stock in 100% EtOH to make a working stock that can then be added into each well of 24-well plate to achieve a final concentration of 10 μM.\nAt the time of adding the psychosine, gently swirl the culture plate to mix the psychosine into culture media. Supplement the psychosine by adding the equivalent of 10 µM every other day for one week.\nAfter 7 days of psychosine treatment, collect the media and pipet 500 µl of cold 4% paraformaldehyde (PFA) into each well. Incubate at room temperature for 20 min to fix the cells. Then, wash each well 3x with PBS and then keep plates at 4 °C until processed for immunocytochemistry (see below).\n\tNOTE: cell culture media can be collected for enzymatic or ELISA assay at this point if desired.\n3. Immunocytochemistry (ICC) to Visualize Globoid Cells\nReplace PBS with blocking buffer [PBS + 0.3% Tween-20 + 5% normal goat serum (NGS)], and incubate the cells for 1 hr at room temperature.\nIncubate the fixed cells in primary antisera against Iba-1 [(1:1,000) diluted in PBS + 0.3% Tween-20 + 2% NGS] for at least 1 hr at room temperature, then wash each well with PBS 3x 5 min/wash.\nAdd the appropriate secondary fluorescence-conjugated antibody to identify the primary antibody labeling and counter-stain with 4',6-diamidino-2-phenylindole (DAPI, 1:1,000) to identify nuclei. Incubate in secondary antibody solution for 1 hr at room temperature and wash with PBS 3x 5 min.\nMount each coverglass to microscope slides using a mounting medium. View slides on a fluorescent microscope for visual and quantitative analyses.\n4. Analysis and Characterization of Globoid Cells in Primary Culture\nUse the following three morphological criteria to identify a globoid cell in culture:",
    "Identify globoid cells using fluorescent microscopy by immunopositive labeling for the microglial marker, Iba-1+.\nIdentify globoid cells as polynucleated (i.e. containing two or more DAPI positive nuclei).\nIdentify globoid cells by a rounded morphology distinct from the highly branched appearance of resting microglial cells.\n\t\tNOTE: Cells may also be collected for cell surface marker analysis and quantification by flow cytometry from these cultures.\nMeasuring the phagocytic activation of microglia and globoid cells\n\t\nTo assess the phagocytic activity of psychosine-treated microglia, add FITC-labeled latex beads to the wells in accordance with the manufacturer’s instructions. Add fluorescent-conjugated latex beads 48 hr prior to fixation with PFA. Fix cells treated with beads (as mentioned in section 2.4), and process for immunocytochemistry (as described in section 3).\nSelect fluorophore-conjugated secondary antibodies so that they do not overlap the fluorescent emission spectra of the fluorophore labeled beads.\nAnalyze the phagocytotic profiles of Iba-1+ microglia by identifying those cells that co-localize with the fluorescently-labeled beads.\n\t\tNOTE: Psychosine will activate microglia. Phagocytosed beads will be identified within mononucleated and multinucleated Iba-1+ cells in this culture setting.\n5. Induction of Globoid Cells from Purified Microglial Cultures\nNOTE: An alternate approach to decipher intercellular signaling between the astrocyte and microglia is another advantage of this in vitro globoid cell model. Purification of primary microglial cells for replating or co-culturing can be achieved by their lower adherence property in culture, as described in the following steps (see Section 5.2).\nCollect the media from the confluent mixed glial cultures into 50 ml conical tube and maintain it at 37 °C in the incubator.\nMicroglial Isolation from Primary Mixed Glial Cultures.",
    "After removing the media from a confluent mixed glial culture T175 flask, add warm shaking media [consisting of complete media + 25 mM 4-(2-hydroxyethyl)-1-piperazineethanesulfonic acid (HEPES) + 25 mM sodium bicarbonate (Sigma)]. Shake the flasks for 3-4 hr in an orbital shaker at 100 rpm (37 °C). Collect the media from these shaken flasks into 50 ml conical tubes.\n\t\tNOTE: This media will include the less adherent microglia from the flasks.\nSpin the media at 300 x g for 10 min at room temperature. Aspirate the supernatant and then re-suspend the cells in 2 ml of the astrocyte-conditioned media (collected in step 5.1).\nEstablish the number of cells acquired using a hemocytometer and then plate the microglial cells onto substrate-coated coverslips (see section 2.1) for immunocytochemistry, or plate onto UltraLow adherence well plates for future collection of globoid cells for co-culture with other cell types, such as oligodendrocytes (as described in the following section).\n\t\tNOTE: Once plated the microglia can be treated with psychosine (10 µM) as described above (see section 2.3).\nCo-culture with Primary Oligodendrocytes for Analysis of Cytotoxicity.\n\tNOTE: Collection of psychosine-treated microglia from the low adherence plates for subsequent co-culture onto primary cultures of oligodendrocytes, or oligodendrocyte progenitor cells, can be used to examine the potential cytotoxic function of these globoid-like cells in vitro.\n\t\nDevelop cultures of primary oligodendrocytes using established methods18,20. To collect the psychosine-treated microglia, gently pipet to detach the loosely adherent cells from the bottom of the wells. Collect the cells, centrifuge at 300 x g for 10 min, and then carefully resuspend in oligodendrocyte differentiation media [composed of Neurobasal media, L-glutamine (1x), B-27 supplement (1x), and Triiodothyronine (T3, 10 ng/ml)].",
    "Count the number of cells using a hemocytometer and then seed the microglia onto the oligodendrocyte culture at 1 x 105 cells/ml, resulting in an approximate 1:2 microglia/oligodendrocyte ratio. Incubate as a co-culture for up to 3 days.\nFix the cells for immunocytochemistry (see section 2.4). Collect cell culture media for ELISA or chemical analyses as needed.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}