{
  "id": 9010,
  "origin_website": "Jove",
  "title": "Mouse Microsurgery Infusion Technique for Targeted Substance Delivery into the CNS via the Internal Carotid Artery",
  "procedures": [
    "The procedures involved in the following protocol have been approved by the University of Miami Institutional Animal Care and Use Committee (IACUC). In addition, all procedures are being conducted in facilities approved by the Association for Assessment and Accreditation of Laboratory Animal Care International (AAALAC).\n1. Preparation of Mice for Surgery\nAnesthetize mouse with isoflurane mixed with oxygen, using a laboratory anesthesia system. Use isoflurane at setting between 4-5% and oxygen flow at 2 L/min on the commercial machine (See Materials Table). Transfer the animal to the surgery surface, under a stereomicroscope, and sustain anesthesia using a nose cone (use isoflurane setting 1.5 - 2.5 and oxygen flow at 2 L/min).\n\t\nEnsure that the mouse respiratory rate is around 1 - 2 respiration/sec without gasping. In addition, ensure that the animal does not exhibit whiskers stimulation reaction and pedal reflex (toe pinch). Monitor respiration rate and effort during the surgery, at least every 5 min. Follow specific Institutional Animal Care and Use Committee and veterinary guidelines for rodent anesthesia monitoring.\nApply a drop of ophthalmic lubricant on each eye using a sterile swab in order to prevent dryness. Administration of anti-inflammatory and analgesic to alleviate discomfort is recommended.\nWith the animal lying on its back, maintain anesthesia using a nose cone.\nClean the animal's neck area by wiping the area three times with ethanol 70% and chlorhexidine. Shave the animal's surgery area using a razor (detailed below).\n2. Dissection of the Common Carotid Artery (CCA)\nPerform the entire microsurgery procedure under a stereomicroscope. Using surgical scissors and forceps perform a shallow midline incision in the neck, from above the breastbone to below the jaw (about 3 to 4 cm).\nUsing forceps carefully separate fatty and connective tissue to expose the trachea.",
    "Place a pillow (round object, about 0.5 cm in diameter) on the back of the neck of the mouse to extend the neck, further exposing the area.\nSeparate the tissue using either a tissue retractor or hooks.\nOn the animal's left side of the trachea, carefully tweeze apart the connective tissue to expose the left CCA.\nUsing forceps carefully remove all connective tissue to expose the CCA bifurcation, and the beginning of both external and internal carotid arteries.\n3. Preparation of the CCA for Substance Infusion\nInsert two segments of nylon suture (about 1 cm each) under external carotid artery (ECA), using forceps.\nPlace a permanent knot at the highest point possible of the ECA.\nAt the lowest point possible of the ECA, immediately above the CCA bifurcation, place a removable knot. This knot should be loose compared to the upper knot.\nClose the CCA using a vessel clip, at the lowest possible point.\nClose the internal carotid artery (ICA) using a vessel clip.\nUsing microdissection spring scissors perform a small cut in the ECA (about 2 mm), between the two knots.\n4. Substance Infusion via ICA\nAssemble an infusion system. Attach 6 inches of capillary tubing (ideal dimensions: 2.5 mm x 1.2 mm) to a tuberculin syringe containing 250 µl of the substance to be infused (drugs, pathogens, extracellular vesicles, among others) and insert the capillary tip gently into the incision performed in step 3.6.\nContinue to slide down the capillary until it reaches a midpoint between the bifurcation and the clip closing the CCA.\nTie down the lower ECA knot. Verify that the knot is loose enough to allow capillary fluidity and tight enough to prevent leaking.\nRemove clip from the ICA.\nGently apply pressure to the syringe piston allowing substance infusion at approximately 10 µl per second.",
    "5. Post Infusion Procedures\nPlace clip back on the ICA.\nGently remove the capillary tubing.\nTie down the lower ECA knot completely.\nRemove clips from the ICA and the CCA.\n6. Incision Closing and Post-operative Care\nRemove retractor or tissue hooks and pillow.\nClean suture area using sterile saline.\nClose the incision using nylon suture/needle and forceps.\nAdminister anti-inflammatory and analgesic to alleviate post-operative discomfort.\nPlace animal in cage placed on heating pad for at least 1 hr and monitor recovery.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}