{
  "id": 18130,
  "origin_website": "Jove",
  "title": "A Rat Model of Orthotopic Liver Transplantation Using a Novel Magnetic Anastomosis Technique for Suprahepatic Vena Cava Reconstruction",
  "procedures": [
    "The protocol was carried out in accordance with the Guidelines for the Care and Use of Laboratory Animals and was approved by the Committee on the Ethics of Animal Experiments of Xi'an Jiaotong University, Xi'an, Shaanxi Province, China.\nNOTE: None of the procedures in this protocol was performed under a surgical microscope.\n1. Preoperative Preparation\nThe Design and Shape of the Magnetic Rings (Figure 1)\n\t\nAssemble the magnetic anastomosis device by matching a pair of neodymium-iron-boron magnetic rings.\nDesign the rings according to the parameters of rat SHVC with a major axis diameter, minor axis diameter, thickness and weight of 8 mm, 5.5 mm, 1 mm, 0.5 g, respectively.\nCurve the rings to the desired shape by a wire-electrode cutting technique, and then coat the obtained rings with a titanium oxide airbrush and sterilize with 500 mg/L ethylene oxide at 55-60 °C for 6 h.\nThe cuffs (Figure 2)\n\t\nPrepare the cuff for anastomosis of the IHVC and PV by cutting the polyethylene tube. Ensure that the cuff body is 5 mm long with a 2 mm cuff extension.\n\t\tNOTE: The inner and outer diameters of the PV cuff are 1.8 and 2.1 mm, while those of the IHVC cuff are 2.6 and 2.8 mm, respectively.\nThe Stent (Figure 2)\n\t\nPrepare the stent for anastomosis of the BD by cutting 24-G intravenous cannula with a length of 5 mm to produce slant at both ends.\nExperimental Animals\n\t\nUse male Sprague Dawley rats weighing between 250 and 280 g as donors and recipients. Ensure that the recipient is the same weight or slightly heavier (< 10 g) than the donor.\nKeep the rats in climate-controlled rooms with free access to food and water before surgery.\n2. Donor Operation\nInject buprenorphine (0.05 mg/kg) subcutaneously as an analgesic 1 hour before operation.",
    "Anesthetize the donor rat by isoflurane inhalation. Use 5 vol% isoflurane at a flow rate of 1.5 L/min in a Plexiglas box for the induction of anesthesia and 2 vol% isoflurane at a flow rate 0.6-0.8 L/min on a cone mask for the maintenance of anesthesia. Confirm depth of anesthesia by performing a toe pinch and a skin pinch.\nShave the entire abdominal skin of the rat using an electric shaver to allow for cleaner exposure. Disinfect the corresponding skin with a povidone-iodine solution.\nOpen the abdominal cavity via a cruciform incision using surgical scissors from the root of the penis extending to 1 cm above the xiphisternum along linea alba, extending from the midpoint of the longitudinal incision to the midaxillary line. Exteriorize the gastrointestinal tract to the left and cover it with wet gauze.\nClamp and pull the xiphisternum toward the head using a hemostatic forceps. Dissect the falciform ligament and the connective tissues around the liver. Isolate and ligate the left inferior phrenic vein with a 6-0 silk suture.\nInsert the stent into the bile duct.\n\t\nClamp the BD just above the point where the gastroduodenal vein joins the portal vein and pull it to maintain a little tension using a microforceps. Then perform a \"V\" incision of 1 mm length on the anterior wall about 5 mm proximal to the biliary confluence by a micro scissors.\nInsert the stent into the lumen of the bile duct using a curved microforceps. Make sure at least a half of the stent lies outside the bile duct.\nSecure the stent with a 6-0 silk suture. Cut one end of the suture. Keep the other one to hold during later anastomosis. Transect the bile duct below the stent and make sure the bile can come out of the stent.",
    "Isolate the IHVC down to the left renal vein level. Free the IHVC from anterior and lateral surrounding tissues by cotton bud dissection until the IHVC is skeletonized. Separate and ligate the right suprarenal vein and the right renal vein with a 6-0 silk suture.\nHeparinize the rat by injecting 50 U of heparin diluted in 2 mL of normal saline solution through the dorsal vein of the penis.\nPerfuse the liver.\n\t\nIsolate the abdominal aorta below the left renal vein. Insert a 22-G catheter into the aorta.\nPerform a thoracotomy, clamp the thoracic aorta using a microforceps.\nPerfuse the donor liver through the catheter in the aorta with 20 mL of normal saline solution containing 25 U of heparin (4 °C) at the rate of 3 mL/min with an infusion pump. In the meantime, cut the vena cava below the right renal vein to allow the perfusion solution to flow out of the liver.\nTransect the SHVC along with part of the diaphragm and IHVC at the level of the left renal vein when the donor liver became pallid.\nDissect the connective tissue surrounding the PV by two micro forceps. Ligate and divide the pyloric veins with an 8-0 prolene suture. Transect the PV at the level of the splenic vein. Excise the donor liver and rinse it with cold normal saline solution. Place it in a cold saline bath 4 °C.\n3. Graft Preparation\nNOTE: All procedures for the liver graft preparation are performed in a cold saline bath at 4 °C.\nAttach a cuff to the donor's IHVC (Figure 3).",
    "Insert the IHVC into its cuff with the cuff extension pointing towards the liver. Position the cuff extension on the posterior wall of IHVC. Fix the cuff extension and the IHVC with a curved microforceps itself attached using a file clip to the bath container.\nEvert the distal end of the IHVC over the cuff body using two micro forceps.\nSecure the edge with a 6-0 silk suture. Make sure the IHVC is not twisted during the process.\nRepeat step 3.1 on the PV to attach a cuff to the donor's PV.\nAttach a magnetic ring to the donor's SHVC (Figure 4).\n\t\nPull the diaphragm through the four forceps and trim the SHVC.\nPass the SHVC through the magnetic ring using the titanium-alloy micro forceps.\nEvert the distal end of the SHVC over the ring.\nSecure the ring with a 6-0 silk suture. Make sure the SHVC is not twisted during the process.\nRemove the excess diaphragm around the liver.\nImmerse the donor liver in a cold normal saline bath and store at 4 °C.\n4. Recipient Operation\nNOTE: The schema of the graft implantation in the recipient rat is shown in Figure 5.\nInject buprenorphine (0.05 mg/kg) subcutaneously as an analgesic 1 hour before operation. Anesthetize the donor rat by isoflurane inhalation. Use 5 vol% isoflurane at a flow rate of 1.5 L/min in a Plexiglas box for the induction of anesthesia and 2 vol% isoflurane at a flow rate 0.6-0.8 L/min on a cone mask for the maintenance of anesthesia.\nShave the entire abdominal skin of the rat. Disinfect the corresponding skin with a povidone-iodine solution.\nOpen the abdominal cavity via a 4 cm midline incision. Place the abdominal retractors. Pull the ribs as far apart as possible from the midline.",
    "Clamp and pull the xiphisternum toward the head using a hemostatic forceps. Dissect the connective tissues and ligaments around the liver. Ligate and divide the hepato-esophageal ligament. Ligate and divide the hepatic artery with an 8-0 prolene suture.\nIsolate the common bile duct from the first hepatic portal. Place a 6-0 silk suture around the common bile duct just below its division and ligate the common bile duct.\nDissect the IHVC down to the right renal vein. Ligate and divide the right adrenal vein. Place a strap in the SHVC of the liver.\nClamp the IHVC just above the right renal vein with microvessel clips. Clamp the PV at the level of the pyloric vein with microvessel clips.\n\t\nTo flush the blood out of the liver, slowly inject 2 mL of normal saline through the PV. Drag down the liver by pulling the previously placed strap. Clamp the SHVC and part of the diaphragm with a Satinsky clamp.\nTransect the IHVC close to the parenchyma and the PV at the porta hepatis. Excise the liver by transecting the SHVC just above the liver. Remove the recipient liver quickly.\nAttach a magnetic ring to the recipient's SHVC.\n\t\nInsert the recipient's remaining SHVC into a magnetic ring.\nFix the magnetic ring on a Satinsky clamp by magnetic attraction.\nEvert the SHVC over the magnetic ring until the vessel covers the edge of the ring.\nPlace the donor liver graft orthotopically and cover it with a cold wet gauze.\nFill the lumen of the donor's and the recipient's SHVCs with normal saline solution. Remove air bubbles thoroughly to prevent air embolism. Finish the SHVC reconstruction by coupling the magnetic rings embedded in the donor's and recipient's SHVC together through magnetic force.\nReconstruct the PV.",
    "Tract the right and left branch of the recipient's PV by pulling an 8-0 prolene suture to maintain the tension of the PV.\nMove the clamp of recipient's PV down from the pylorus vein to the splenic vein in order to expose the vein fully.\nIncise the anterior wall of the recipient. Fill the lumen of the PV with normal saline solution.\nHold the cuff extension of the donor's PV with a curved forceps.\nInsert the cuff body of the donor's PV into the recipient's PV while keep flushing the PV lumen with normal saline.\nSecure it with a circumferential 6-0 silk ligature. Re-establish the blood flow to the graft liver by releasing the clamps on the PV and SHVC.\nRepeat step 4.11 on the IHVC to reconstruct the IHVC.\nReconstruct the bile duct by a stent technique.\n\t\nIncise a \"V\" on the anterior wall of the recipient common bile duct.\nInsert the donor stent into the lumen of the recipient BD and fix it with a 6-0 silk circumferential suture. Pull the sutures on the two bile ducts together and tie the sutures to bring the BD close to each other.\nWrap omentum tissue around the anastomotic site to prevent bile leak.\nIrrigate the abdominal cavity with warm normal saline solution. Close the abdomen incision in two layers with a continuous 3-0 non-absorbable surgical suture.\nAdminister 16 mg/kg cefuroxime (an antibiotic) and 0.05 mg/kg buprenorphine (an analgesic) by subcutaneous injection after the operation immediately.\nPlace the rat in a clean cage and allow food and water ad libitum.\nInject cefuroxime (16 mg/kg) and buprenorphine (0.05 mg/kg) into the abdominal cavity every 12 hours for 3 days.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}