{
  "id": 10851,
  "origin_website": "Jove",
  "title": "Using Tomoauto: A Protocol for High-throughput Automated Cryo-electron Tomography",
  "procedures": [
    "1. Minicell Preparation\nTo make S. flexneri minicells, transform 1 µl of plasmid pBS58, which constitutively expresses Escherichia coli cell division genes ftsQ, ftsA, and ftsZ from a low-copy spectinomycin-resistant plasmid into 5 µl electrocompetent Streptomycin-resistant serotype 5a (M90T-Sm) cells by electroporation at 2.5 kV for 5 msec in 1 mm cuvettes.\nStore minicell samples at -80 °C in 15% glycerol in a 1.5 ml cryogenic microtube. When ready for use, scrape approximately 5 μl of cells from the unthawed microtube using a pipette tip and suspend the cells in 4 ml tryptic soy broth with spectinomycin added to 100 μg/ml concentration. Grow O/N at 37 °C.\nPipette 2 ml of the culture from 1.2 into 200 ml tryptic soy broth with spectinomycin again added to 100 μg/ml concentrations. Grow at 37 °C to late log phase.\nTo enrich minicells, centrifuge 200 ml of the culture from 1.3 at 1,000 x g for 5 min. Carefully pour the supernatant fraction into a new centrifuge tube and centrifuge at 20,000 x g for 10 min. Carefully pour off and discard the supernatant fraction, and gently mix the pellet with the remaining liquid using a pipette tip and transfer approximately 100 μl of the pellet mixture to a 1.5 ml microcentrifuge tube.\n2. EM Grid Preparation\nPlace a R2/2 holey carbon film 200-mesh copper grid carbon side up on a glass slide.",
    "NOTE: A R2/2 200-mesh grid is selected to maximize the number of tilt-series that can be set to acquire in a single grid square while still supporting the specimen and placing the edge of the carbon film in the field of the camera at the desired magnification. Finer mesh grids and smaller holey carbon films such as R1.2/1.3 400-mesh can be used for samples imaged at higher magnification; larger holey carbon films such as R3.5/1 200-mesh can be used for samples imaged at lower magnification or if the micrograph should not contain the carbon edge and holey carbon films with larger spacing such as R1/4 200-mesh can be used to aid with aligning the stage to the area of interest and protecting areas from over-exposure in focusing and tracking routines.\nPlace the slide on the platform in a glow discharge device.\n\tNOTE: We use an in-house device in which an anode and platform has been machined into a vacuum desiccator and is powered by a high-frequency generator. After creating a vacuum, attach the high-frequency generator probe to the anode and power on the probe for 1 min to glow discharge the grid. The time necessary to glow discharge the grid can range from a few seconds to a minute. Varying the glow discharge time can be used to diagnose problems with specimen concentration and grids that appear dry with no vitreous ice.\nRemove the grid with a set of forceps, and lock the forceps closed with an elastic band.\nAdd 100 μl of 10 nm colloidal gold solution to the microcentrifuge tube with the minicells prepared in 1.4 and mix by gently flicking the tube with a finger. With a new pipette place 4 μl of the mixture on the grid prepared in 2.2.",
    "NOTE: Colloidal gold is available in a variety of sizes and care should be taken that the size of the gold is greater than 5 pixels given the pixel size of the micrographs to be processed at the acquired magnification, while not being too large to obscure features of interest.\nPrepare the plunge-freeze apparatus; fill the outer freezing container with liquid nitrogen and then fill the inner chamber with liquid ethane. Attach the forceps with the grid to the plunger rod and lock the plunger rod into the raised position.\n\tNOTE: See Iancu et al.20 for a protocol describing the use of a commercial plunge-freeze apparatus.\nBlot the grid by carefully touching a piece of filter paper to the drop of sample until the meniscus between the grid and filter paper separates and the wicking on the filter paper stops, then immediately release the plunger rod, freezing the grid. Carefully remove the forceps from the plunger rod and place the grid into a grid holder.\nPrepare the cryo-EM transfer station by filling the loading area and absorption pump container with liquid nitrogen. Once the loading area is at liquid nitrogen temperature place the grid holder and a microscope specimen cartridge in the loading area.\nCarefully remove the lock ring, which is either a small threaded lock ring on earlier Polara microscopes or a C-style clip ring on later models; place the EM grid into the cartridge using forceps and then gently reattach the lock ring back onto the cartridge securing the grid.\nRemove the multiple specimen holder from the microscope and attach it to the transfer station. Place the specimen cartridge into the holder using cartridge forceps and retract the holder from the loading area and transfer the multiple specimen holder back to the microscope.",
    "NOTE: See Chen et al.21 for a visual protocol detailing 2.1-2.9.\n3. High-throughput Automated Tilt-series Collection\nCollection of Low-magnification Maps\n\t\nOpen a new Navigator window by clicking 'Open' in the 'Navigator' menu of SerialEM10 (http://bio3d.colorado.edu/SerialEM)\nFind grid squares that contain acceptable imaging conditions (i.e., thin ice, no contamination, subject of interest) using the fluorescent screen at low-magnification (~2,300X for the minicell specimen).\n\t\tNOTE: [Optional: This step can be automated with SerialEM by montaging the entire grid, however it can be faster to simply select a few areas manually.]\nAdjust the stage to eucentric height by tilting the specimen holder to 50° then adjust the z-height until the x-y translation of the stage is minimal between the tilted and untilted views.\nMove to the center of the grid square and click the 'Add Stage Pos' button in the Navigator window to store the current stage position.\nContinue steps 3.1.1-4 above until all acceptable grid squares stage positions have been saved.\nOpen a new montage MRC file by clicking 'New montage' in the 'File' menu. In the Montage Setup Dialog that opens up, select a number of pieces in X and Y that will acquire the entire grid square (e.g., 10 x 10 for a standard 200 mesh grid). Use a high binning such as 8 and select the 'Move Stage Instead of Shifting Image' and 'Skip correlations used to align pieces' radio buttons.\nIn the Navigator window click the first stage position and set it to be acquired by checking the 'Acquire' checkbox. Repeat this for each stage position in the Navigator window.",
    "Open the Navigator Acquire Dialog by clicking 'Acquire at Points' in the 'Navigator' menu. Check the 'Acquire map image' and 'Rough eucentricity' checkbox and make sure that all other checkboxes are unchecked. Click 'Proceed' to collect a montage at each stage position.\nTilt-series Acquisition\n\t\nIn the Navigator window select one of the acquired maps and click the 'Load map' button.\nIn the Navigator window click the 'Add Points' button and select points in the map at which to acquire a tilt-series. Then click the 'Stop Adding Points' button. Repeat for each map collected.\nIn the Camera menu select 'Parameters' and define the parameters for the Focus, Trial, and Record modes. [Optional: Dose-fractionated data can be specified in parameters for Record mode.]\nSelect a point in the Navigator window and check the 'Tilt-Series' check box. In the Tilt-Series Setup dialog window that opens select the parameters desired for the tilt-series collection. Repeat for the rest of the selected points in the Navigator window, but do not select the maps.\nIn the Navigator menu again select the 'Acquire at Points'. In the Navigator Acquire dialog choose 'Realign to item', Autofocus' and 'Rough eucentricity' as Preliminary tasks, and select 'Acquire tilt series' as the Primary task, and select 'Close column valves at end' to close the column when all of the points have been collected. Upon proceeding a tilt-series will be collected at each point in each map.\n4. High-throughput Automated Tilt-series Processing and Reconstruction Using Tomoauto\nCorrection of Beam-induced Motion in Dose-fractionated data [optional]\n\tNOTE: Tomoauto uses MOTIONCORR22 (http://cryoem.ucsf.edu/software/driftcorr.html) to remove beam-induced motion from dose-fractionated micrographs. NOTIONCORR16 must be installed on the system.\n\t\nWith the original tilt-series, the output log from SerialEM10 and the individual dose-fractionated images all in the current working directory, in a terminal execute the command:\n\t\t          dose_fractioned_to_stack <filename.st>",
    "<filename.st> is the name of the tilt-series to process.\nAlignment and Reconstruction of Tilt-series\n\tNOTE: Tomoauto by default uses IMOD13 (http://bio3d.colorado.edu/imod/) to handle tilt-series automated fiducial model generation, alignment, determination of the contrast transfer function (CTF), CTF-correction23, and reconstruction. Alternatively users have the option in tomoauto to use RAPTOR24 (included in IMOD) for automated fiducial model generation, CTFFIND425 (http://grigoriefflab.janelia.org/ctf) to determine the CTF, and tomo3d26 (https://sites.google.com/site/3demimageprocessing/tomo3d) for reconstruction or in any combination of software packages by configuration.  This configuration as well as the parameters available in each package is handled by a global configuration file that can be edited to suit the values most commonly used in a lab while local configuration files can also be created to detail parameters used for a specific specimen, collection set or individual tilt-series. All packages that wish to be used must be installed on the system.\n\t\nWith the tilt-series in the current working directory, in a terminal execute the command\n\t\t          tomoauto --CTF --mode=align <filename.st> <fid_diam>\n\t\t<filename.st> is the tilt-series to be processed and <fid_diam> is the diameter of the fiducial markers in nanometers. This command will align and estimate the CTF of the tilt-series automatically. It is possible to skip CTF processing by removing the --CTF option from the command.\nInspect the aligned tilt-series visually for any glaring errors in the alignment processing and inspect the estimated CTF by executing the commands:\n\t\t          3dmod <filename>.ali\n\t\t          submfg <filename>_ctfplotter.com\n\t\trespectively, where <filename> is the name of the tilt-series without suffix. Also check the output of the tomoauto command to see the mean residual error generated by the alignment, which is a quantitative statistic of alignment quality.\nGiven an acceptable alignment proceed processing by executing the command:\n\t\t          tomoauto --CTF --mode=reconstruct <filename.st> <fid_diam>",
    "with the same user substitutions as in 4.2.1. This command will correct the CTF, erase the fiducial markers from the tilt-series and compute the reconstruction. Again CTF processing can be skipped as in 4.2.1.\n[optional] To skip the visual inspection step and fully automate processing and reconstruction execute the command\n\t\t          tomoauto --CTF <filename.st> <fid_diam>\n[optional] To use a specific local configuration, refer to the tomoauto documentation on how to generate a local configuration file, and then execute the command\n\t\t          tomoauto [options]-L <local_config> <filename.st> <fid_diam>\n\t\twhere <local_config> is the name of the local configuration file.\n5. Sub-tomogram Averaging\nNOTE: We use the i3 package15 (http://www.electrontomography.org/) to process sub-tomogram averaging experiments, however the protocol described applies generally to most available sub-tomogram averaging software packages16to process sub-tomogram averaging experiments, however the protocol described applies generally to most available sub-tomogram averaging software packages16-18.\nWith the reconstructed tomogram in the current working directory open up the tomogram for particle picking by executing the command:\n\t          tomopick <filename>.rec\n\twhere <filename> is as in 4.2.2. In the window that opens use the left mouse button to click on first the basal body and then the needle tip to select an injectisome and use the up and down arrow-keys to riff through the slices of the tomogram. Select all visible injectisomes in this manner. This stores the coordinates in a text file defining the long axis of the structure as well as estimating two of the three Euler angles describing the orientation of the structure.\nComputationally extract 4003 voxel cubes from the tomogram centered at the midpoint of the defined long axis by executing the command:\n\t          clip resize -cx <x> -cy <y> -cz <z> -ix 400 -iy 400 -iz 400 \\\n\t          <filename>.rec <filename>_001.mrc",
    "where <x>, <y>, <z> are the midpoint coordinates of the structure and <filename> is as in 4.2.2. The size of the extracted cube should vary by the structure and the magnification used, and should be large enough to adequately enclose the structure of interest, which for this sample is 4003 voxels.\nDown-sample (bin) the sub-tomogram by a factor of four to reduce the computation time for initial alignment by executing the command:\n\t          binvol -b 4 <filename>_001.mrc <filename>_001.bin4.mrc\n\twhere <filename> is as in 5.2.\nApply the determined Euler angles to sub-tomograms and compute the global average to produce the initial template by executing the command.\n\t          I3totsum.sh\nAlign and classify down-sampled sub-tomograms using a binary classification mask of the cytoplasmic area. Perform sub-tomogram averaging in Fourier space to minimize the missing wedge artifacts characteristic of tomography. For binning 4 data, please use SAMPFACT=\"4 4 4\".\n\t          i3mramsacls.sh\nRepeat step 5.5 using sub-tomograms down-sampled by a factor of two (SAMPFACT=\"2 2 2\") and once more with the original data (SAMPFACT=\"1 1 1\").\n\t          i3mramsacls.sh\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}