{
  "id": 9535,
  "origin_website": "Jove",
  "title": "A Low-Cost, Odor-Reward Association Task for Tests of Learning and Memory",
  "procedures": [
    "The protocol below adheres to the animal care guidelines of the IACUC at Earlham College.\n1. Olfactory bulb cannulation\nNOTE: These surgeries do not require sterile technique since they do not require large incisions to be made. However, each institution may differ in their requirements. If experimenters are performing this surgery on immunocompromised mouse strains, additional considerations may be necessary. In all, experimenters are encouraged to discuss this protocol with their veterinarian and animal care team prior to use and to clean and disinfect all tools between each surgery.\nDuring the setup, soak cannulae and screws in a small beaker or Petri dish containing 32% chlorhexidine to keep them disinfected.\nAnesthetize mice with gaseous 4% isoflurane in pure oxygen and secure into a stereotaxic apparatus. During the surgery, ensure that the mice are maintained under 1.5-2% isoflurane anesthesia supplied through a nose cone. Monitor breathing throughout the surgery. Use eye ointment to prevent the dryness of eyes while under anesthesia.\nAfter the mouse is secured and no longer responds to a firm pinch of the hind foot, use 32% chlorhexidine to rub the top of the head in order to clean incision surface.\nNext, rub the top of the head in the rostral to caudal direction with lidocaine (topical analgesia).\nPress down firmly to make a single incision down the midline with a clean scalpel blade.\nUsing a drill attached to the stereotaxic, drill two holes over the olfactory bulbs for the guide cannula (26 G) using coordinates AP +5.0 mm, ML +/-0.75 mm with respect to bregma.\nDrill two holes over the cerebellar formation.\n\tNOTE: The location of these screws does not need to be precise, ensure that they are symmetrical along the midline.",
    "Place screws into the two holes over the cerebellar formation and use a tissue adhesive to secure these screws to the skull.\nUse the stereotaxic to insert the guide cannula (26 G) into the holes drilled over the olfactory bulbs (step 1.6). Lower the cannula DV 1.0 mm.\nMix the dental cement in a Petri dish. Use a small metal scoop to slowly pile the dental cement around the cannula. Let it dry for 5 s. Then, remove the arms of the stereotaxic device, being careful not to pull the guide cannula out in the process. Continue piling the dental cement over the entire incision until a small cap is formed (See Figure 1A).\nPlace dummy plugs into the guide cannula at this point to prevent the blockage.\nImmediately after the surgery, inject ketoprofen (0.2 mg/kg) and saline (200 µL) to reduce pain and rehydrate. Provide softened food or hydrogel to the mice after surgery. Do not leave mice unattended until they have regained consciousness to maintain sternal recumbency.\n\tNOTE: Mice are also singly housed from this point forward.\nInject saline (200 µL) and ketoprofen (0.2 mg/kg) once a day for two days after the surgery.\nFor 2 days and up to 5 days, (as needed) after the surgery, weigh the mice and monitor their weights. If the weight does not return to pre-surgery levels within two or three days, consult with the veterinarian about the appropriate method of feeding.\nAllow mice to recover for at least 7 days before beginning the behavioral training.\n2. Associative discrimination task\nInfusions\n\t\nAdminister OB-specific infusions of the tyrosine kinase receptor inhibitor, K252a (50 μM; 5% DMSO in saline), or vehicle (5% DMSO in saline) to the mice as follows.",
    "Deliver the infusion into the OB of the mice bilaterally. Inject 2.0 µL final volume per bulb with 0.2 µL/min infusion rate and 10 min of total infusion time using a dual injector pump.\n\t\t\tNOTE: Timing of the manipulation can be adjusted depending on the type of behavioral study being performed. Exact steps of infusion are specific to each injector pump and provided in the manufacturer’s manual.\nMake sure to leave the injectors inside the cannulae for about 5 min after delivery to inhibit the backflow and promote diffusion. (i.e., plan for a total of 15 min for each infusion).\nOdor sets.\n\t\nDilute all odorants in light mineral oil to a partial pressure of 1.0 Pa using a pre-calculated ratio based on vapor pressure (Table 1).\nUse the 5 separate odor pairs from Table 1 (numbers in the table indicate volume in µL to mix in 50 mL mineral oil for 1.0 Pa).\nTo prepare the scented sand to be used during the behavioral steps (Section 2.3 and 3), mix 400 µL of the 1.0 Pa odorant from Step 2.2.2 for every 100 g of play sand.\nShaping\n\tNOTE: Mice should undergo shaping for a period of 10 days as described below.\n\t\nBring mice into the procedure room and handle them for 10 min per day for the first two days following recovery from surgery.\nOn Day 3, place a Petri dish filled with (+)-limonene scented sand into the home cages of the mice and filled with about 10 sucrose pellets, each 5-mg in mass.",
    "NOTE: Use 1.0 Pa (+)-limonene (mix 102 µL in 50 mL mineral oil) as the rewarded odor and plain mineral oil (the diluting agent for the testing odors) as the unrewarded odor. Choosing monomolecular odorants is also recommended since these are most likely to be novel to mice.\nReplenish both the sand and the pellets on Day 4.\nOn Days 5 and 6, acclimate the mice to the custom-made behavioral apparatus, by placing them into the apparatus and letting them explore the space (Figure 1B,C). Make the apparatus using a standard home cage, and poly (methyl methacrylate) to construct two lids and a black center divider. Ensure that both the lids and the center divider are 1-2 cm larger than the home cage.\nPrepare one Petri dish of limonene scented sand and another with sand containing mineral oil. After acclimation on both Day 5 and 6, place both the dishes of sand into the test chamber and mix 10 sucrose pellets into the limonene-scented dish to serve as the reward. Place each mouse into the test chamber for 10 min and allow to freely explore and consume the reward pellets.\nOn Day 7, introduce mice to an abridged version of the final testing procedure, by placing the dishes containing limonene scented and mineral oil scented sand into the behavioral apparatus. This time include the center divider.\n\t\t\nPlace a single reward on top of the limonene-scented sand and place the mouse into the resting chamber.\nOnce the mouse has been placed in the resting chamber, lift the center divider to allow the mouse to enter the test chamber to investigate and dig in the sand-filled dishes. Return the mouse to the resting chamber either after it has retrieved the reward pellet or after 5 min has elapsed.",
    "Repeat this process for a total of 10 trials for each individual mouse. Counterbalance the placement of the rewarded dish of either on the left side or right side by employing a random number generator. There are no rest periods between trials.\nOn Day 8, repeat the trials of Day 7, but also progressively bury the pellet deeper and deeper in the sand.\n\t\tNOTE: Most mice should be digging for the unseen reward pellet by the 10th trial on Day 8.\nOn Day 9, increase the number of trials to 20 trials for each mouse with the full deep burial of sucrose pellet and introducing the mice to the testing chamber for 1 min per trial. Let mice dig in both dishes for the reward.\nOn Day 10, repeat the 20 trials for each mouse, but if they dig in the unrewarded dish before they dig in the rewarded dish, and then begin the next trial. Allow the mice that first dug in the rewarded (limonene-scented) dish to retrieve the reward pellet before sending them back to the resting chamber.\n3. Training and testing\nNOTE: Once the mice have started digging reliably for the unseen, odor-cued reward pellets, the experiment can commence.\nTraining\n\tNOTE: The training phase begins two days after shaping is completed and consists of 20 trials for each mouse. Prior to the training, deliver the intrabulbar drug/vehicle infusions immediately (see Section 2.1 for infusion details) and begin the training immediately following the infusions.\n\t\nPlace a mouse into the resting chamber.\nPlace two dishes of sand scented with a novel odor-pair in the test chamber, where a reward pellet is buried in one of the dishes.",
    "Once the testing chamber is ready, lift the opaque barrier and introduce the mouse into the test chamber. Immediately return the mouse to the resting chamber, if the mouse digs in the unrewarded dish first (record these trials as a \"0\"). If the mouse digs in the rewarding odor first, allow it to retrieve the pellet and return it to the resting chamber. Record these trials as a \"1.\" If the trial lasts 1 min without the mouse retrieving the reward, send the mouse back to the resting chamber.\nClean and refill dishes and begin the next trial. Repeat the same for 20 trials.\nTesting\n\tNOTE: Memory testing can be performed at any duration of interest to the researcher. In this experiment, two separate groups of mice were tested 2 h (STM) or 48 h (LTM) following the training given the interest in the differential influence of K252a on STM and LTM.\n\t\nCarry out testing using the same odors and procedure as described for the training (Section 3.1).\n\t\tNOTE: Depending on the research question, the researcher may need to include control groups. For example, in the previously published experiment, the effects of Trk receptor blockade on memory consolidation was studied3. Therefore, a control group was infused with K252a prior to 48-h testing to show that the effects were not due to interference with retrieval.\nStatistical analysis\n\tNOTE: SPSS 22.0 syntax for each step provided as a Supplemental File as an example.\n\t\nPerform statistical analysis using linear mixed effects analysis. Unlike ANOVAs, linear mixed effects models can better account for random effects and repeated measures.",
    "Calculate the dependent measure: \"proportion correct.\" Recall from 3.1.3 that a \"1\" was assigned to trials in which the mouse dug in the rewarding odor first, and a \"0\" if the mouse dug first in the unrewarding odor. Average every five trials to create four trial blocks (TB; e.g., trial block 1 or TB1 was the average of trials 1-5, trial block 2 or TB 2 was the average of trials 6-10 and so forth).\nSet the independent variables or fixed effects as drug groups (K252a or Vehicle; Section 2.1.1) and trial blocks (from 3.3.1). In the representative results below, the variables used for each analysis are specified.\nInclude individual mouse and odor set nested within the mouse as \"random effects\" in order to compensate for intrinsic behavioral differences in the mice and any effects of using multiple odor sets.\nPerform a logit transformation on the proportion correct.\n\t\tNOTE: The proportion correct is not a continuous, unbound dependent variable. Thus, it violates two assumptions for linear models. Therefore, the logit transformation is performed.\nUse estimated marginal means to perform post hoc tests on significant interactions identified by the full model; multiple pairwise comparisons must be corrected for in post hoc testing. Bonferroni or Šidák are typically used."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}