{
  "id": 11300,
  "origin_website": "Jove",
  "title": "Three-dimensional Optical-resolution Photoacoustic Microscopy",
  "procedures": [
    "1. System configuration\nOptical irradiation\nOptical irradiation source: a diode-pumped solid-state pulsed laser (INNOSLAB, Edgewave) and a dye laser (CBR-D, Sirah).  \n The output laser beam (pulse width: 7 ns) is focused by a condenser lens (LA1131, Thorlabs) to pass through a 50-μm pinhole (P50C, Thorlabs).\nThe pinhole is positioned slightly away from the focus of the condenser lens to match the pinhole diameter with the fundamental-mode beam diameter for effective spatial filtering. \nThe filtered beam is attenuated by a neutral-density filter (NDC-50C-2M, Thorlabs) and then coupled into a single-mode optical fiber (P1-460A-FC-2, Thorlabs).  \nThe fiber output fills the back aperture of a microscope objective (RMS4X, Thorlabs) to achieve a diffraction-limited optical focus of ~2.6 μm at the wavelength of 570 nm. \nUltrasonic detection\nUltrasonic transducer: 50-MHz central frequency (V214-BB-RM, Olympus-NDT). \nThe ultrasonic transducer is attached to a home-made acoustic-optical beam combiner11 for ultrasonic detection, which is aligned coaxially with the diffraction-limited optical irradiation. \nA spherical cavity is ground out of the bottom of the combiner to produce an acoustic lens. This acoustic lens has a numerical aperture of 0.5 in water and gives an acoustic focal diameter of 43 μm at the 50-MHz central frequency. \nThe optical and acoustic foci are aligned confocally to maximize the detection sensitivity.\nAcoustic coupling\nDry ultrasonic coupling is employed to avoid submerging experimental animals in water, which was used in early photoacoustic imaging systems12. \nAn imaging window is opened in the bottom of a Petri dish (9 cm in diameter) and is sealed with an ultrasonically and optically transparent polyethylene membrane.",
    "Ultrasonic gel (Clear Image, SonoTech) between the polyethylene membrane and the object to be imaged couples the generated photoacoustic wave from the object to the Petri dish, and deionized water in the Petri dish further couples the wave to the submerged OR-PAM imaging head. \nElectronics\nThe photoacoustic signal detected by the ultrasonic transducer is amplified by two cascaded amplifiers (ZFL 500LN, Mini-Circuits) \nThe amplified signal is digitized by a 14-bit data acquisition (DAQ) board (CompuScope 14200, Gage Applied Sciences) at a sampling rate of 200 MS/s. \nScanning scheme\nTwo-dimensional (2-D) raster scanning of the OR-PAM imaging head along the horizontal (x-y) plane is controlled by a personal computer, which triggers both the DAQ board and the pump laser. The trigger signal is synchronized with the clock-out signal from the DAQ board. \nThe fast axis of the 2-D scanner is defined as the direction of the cross-sectional scan (B-scan).\nA sequence of B-scan images can be acquired by translating the imaging head along the slow axis to form a volumetric image, which can be viewed either in a direct 3-D rendering or in a 2-D maximum amplitude projection (MAP) image.\n2. System alignment\nUse pulse-echo ultrasound and an ultrasonic reflector to determine the position of the acoustic focal plane (i.e., the time delay from the trigger signal to the maximum pulse-echo ultrasonic signal). This step is required to be performed only once when building the OR-PAM system.  \nMaximize the coupling efficiency of the single-mode fiber.\nApply ultrasonic gel on top of an optically absorbing object (e.g., a piece of black tape) and gently attach it beneath the imaging window in the Petri dish filled with deionized water. \nLower the imaging head into the water, and remove air bubbles trapped under the acoustic lens.",
    "Adjust the imaging head until the photoacoustic signal of the absorbing object is from the acoustic focal plane, which can be judged from the acoustic delay. \nAdjust the vertical position (i.e., z position) of the microscope objective to maximize the amplitude of the photoacoustic signal generated from the flat object. The maximized signal amplitude suggests that the optical focus is aligned with the acoustic focus in the vertical direction. \nAdjust the horizontal positions (i.e., x and y positions) of the microscope objective until the photoacoustic signal generated from the target shows a symmetric pattern. The symmetry suggests that the optical focus is aligned with the acoustic focus in the horizontal direction.\nRepeat steps 2.6 and 2.7 until the photoacoustic signal is optimized in both symmetry and amplitude.\n3. A sample experimental procedure-in vivo OR-PAM of mouse ear vasculature\nThis step is not required for nude mice. Anesthetize the animal with an intraperitoneal injection of a cocktail [recipe: 1 ml ketamine (100 mg/ml), 0.1 ml xylazine (100 mg/ml), and 8.9 ml saline; dosage: 0.1 ml/10 g]. Shave the hair in the ear, and further depilate the residual hair with Surgi Cream (Category #: 82565, American International Industries) before cleaning it with deionized water. Note that such depilation might slightly irritate the skin vasculature and thus is best performed 24 hours before the planned experiment. \nTurn on the photoacoustic laser system, and check the system alignment. \nAnesthetize the mouse with 3% isoflurane vaporized by the inhalation gas (the typical flow rate is 1.0-1.5 l/min, depending on the animal's body weight), and \n maintain the anesthesia with 1% isoflurane throughout the experiment. Medical-grade air is recommended as the inhalation gas to maintain the mouse at normal \n physiological status.",
    "Transfer the mouse to a stereotactic stage, and control its body temperature at 37 °C with a heating pad.  \nFlatten the mouse ear on a plastic plate and apply a layer of ultrasound gel on top of the ear. Avoid trapping air bubbles inside the gel. \n Then, place the ear under the imaging window and slowly raise the animal stage until the ultrasound gel contacts the bottom of the polyethylene membrane. \n Soft contact is required because pressing the ear against the membrane may affect blood flow in the ear. \nClamp a pulse oximeter to the mouse leg or tail to monitor its physiological status, and apply ointment to the eyes to prevent dryness and accidental laser damage to the mouse eyes.\nLower the imaging head until the acoustic lens is immersed in deionized water, and remove air bubbles trapped under the acoustic lens. \nCheck the laser fluence to make sure it is within the laser safety standards of the American National Standards Institute13. The laser fluence should not exceed 20 mJ/cm2, which translates into 80 nJ of laser pulse energy when the laser beam is focused at 150 μm beneath the skin surface.\nSet the laser to the external-trigger mode and start trial scanning. Adjust the z position of the imaging head until the strongest photoacoustic signal is from the acoustic focal plane. \nSet correct scanning parameters and start formal image acquisition.\nAfter the experiment, turn off the laser, lift the imaging head out of the deionized water, lower the animal stage to release the mouse, clean the mouse ear with deionized water, turn off the anesthesia system and the temperature controller, and unload the mouse from the stereotactic stage.",
    "If repetitive imaging is required, put the mouse in an incubator with the environmental temperature set at 37 °C. Return the mouse to the animal facility after it wakes up naturally. Otherwise, follow the animal protocols to euthanatize and dispose of it. \n4. Functional OR-PAM of total concentration and oxygen saturation of hemoglobin\nOxyhemoglobin (HbO2) and deoxyhemoglobin (HbR) are the two major forms of hemoglobin, the predominant endogenous photoacoustic source in the visible spectral range. HbO2 and HbR have distinct optical absorption spectra and thus can be spectrally differentiated to quantify both the total concentration (HbT) and oxygen saturation (sO2) of hemoglobin5. Here are two guidelines to help select proper optical wavelengths for sO2 measurements: \nWavelengths should be selected within the Q-band of the hemoglobin absorption spectrum (i.e., 550-600 nm) to ensure a sufficient signal-to-noise ratio and adequate penetration.\nWavelengths where the absorption coefficients of HbO2 and HbR have a pronounced difference (e.g., HbR-dominant 561 nm and HbO2-dominant 578 nm) are recommended. \nBesides sO2, HbT can be calculated by adding [HbR] and [HbO2] together, or it can be directly measured at isosbestic wavelengths of the molar extinction coefficient spectra of hemoglobin (e.g., 530 nm, 545 nm, 570 nm, and 584 nm)14, where HbR and HbO2 have equal molar extinction coefficients.\n5.  Representative Results:\nShown in Figure 1 is the vascular anatomy and sO2 in a living nude mouse ear imaged by dual-wavelength (561 and 570 nm) OR-PAM. The typical image acquisition time for dual-wavelength sO2 measurements of such a region of interest (image size: 10 mm x 10 mm; step size: 2.5 μm x 5 μm) is ~80 min.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2729/2729fig1.jpg",
    "Figure 1. In vivo optical-resolution photoacoustic microscopy. MAP images of (A) the total hemoglobin concentration showing the vascular anatomy (acquired at 570 nm) and (B) the hemoglobin oxygen saturation (acquired at 561 nm and 570 nm) in a nude mouse ear. (C) Close-up of the boxed region in panel (A). The scale bar in panel (A) applies to both (A) and (B).Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}