{
  "id": 4024,
  "origin_website": "Cell",
  "title": "Protocol for visualizing newly synthesized proteins in primary mouse hepatocytes",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nIsolation and plating of primary mouse hepatocytes: Day 1\nNote: Primary hepatocytes is an important physiological model of the liver in vitro, which has been widely used in the biomedical field (Bantubungi et al., 2014[href=https://www.wicell.org#bib1]; Charni-Natan and Goldstein, 2020[href=https://www.wicell.org#bib2]; Salem et al., 2018[href=https://www.wicell.org#bib4]). The detailed preparation is as follows.\nMouse anesthesia and dissection: Day 1\nTiming: 10–15 min\nAnesthesia: Inject pre-warmed 7% chloral hydrate at 22°C–25°C to anesthetize 8–10-week old male C57BL/6J mice via intraperitoneal injection (150 μL/20 g body weight);\nNote: Make sure the mouse is completely anesthetized. Observation indexes: When the mouse was lying on its back, the heartbeat and respiration are even, the muscles are relaxed, the limbs have no movements, the whiskers have no touching reaction, and the pedal reflex disappears. The mouse was considered to have achieved complete anesthesia.\nPositioning: Place the anesthetized mice on the edge of the dissecting tray with their heads protruding and their limbs fixed with needles;\nDissection: Use surgical scissors to make a U-shaped incision to open the abdominal cavity of the mouse, exposing the intestine and liver, and then peel the intestine and liver to expose the inferior vena cava and portal vein (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/739-Fig1.jpg\nFigure 1. Portal vein and vena cava exposure\nMove the small intestine and other organs in the mouse's abdominal area to the right, and expose both portal vein and vena cava. Scale bar, 1 cm.\nNote: Make sure all the pieces of equipment are sterilized by 75% ethanol before use.\nInferior vena cava cannulation perfusion and liver digestion: Day 1\nTiming: 20–30 min",
    "Liver perfusion and digestion: Cut the portal vein, put a bent needle (0.55 × 20 mm) in inferior vena cava, inject pre-warmed 50 mL perfusion buffer and digestion buffer respectively at a constant speed of 0.2 mL/s via high precision injection pump (Figure 2[href=https://www.wicell.org#fig2]). See Troubleshooting 1 and Troubleshooting 2. After the injection, use forceps to press the abdomen of the liver and observe: whether the press marks recover quickly, whether the liver becomes pale. When the liver appears in yellow and white, then the perfusion is successful;\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/739-Fig2.jpg\nFigure 2. Pumping the perfusion or digestion buffer into the mouse liver\nThe needle's tip (bending the needle, almost at a 90-degree angle) is inserted horizontally into the vena cava.\nNote: Mice should be 8–10-week old because veins in younger mice are too small, and veins in older mice have too much fat, making insertion more challenging.\nCritical: The collagenase in the digestion buffer must dissolve completely before anesthetizing mice. And the prepared perfusion buffer and digestion buffer should be placed in a 37°C water bath at least 30 min before dissection to obtain the best digestion efficiency. See Troubleshooting 3\nLiver cleaning and hepatocytes release: Collect mouse livers and remove the gallbladder, wash them with 10 mL pre-cooled PBS containing 1 × penicillin-streptomycin, and then transferred to 10 mL digestion buffer in Petri dishes at 37°C in a CO2 incubator about 5 min for digesting thoroughly. Then tear up the liver tissue with tweezers to obtain hepatocytes (Figure 3[href=https://www.wicell.org#fig3]);\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/739-Fig3.jpg\nFigure 3. Hepatocytes release\n(A) After digestion, pump the buffer into mouse liver, and transfer liver to a 10-cm dish.\n(B) Thin-pointed forceps are used to tear the liver at several points along the liver's surface and gently release hepatocytes. Scale bar, 1 cm.",
    "Hepatocytes filtration and neutralization: Filter hepatocytes into a 50 mL centrifuge tube with 100 μm cell strainer in a cell culture hood, and the growth medium was added in the same volume for neutralization to stop the digestion of collagenase.\nNote: Select the appropriate cell strainer according to the cell diameter.\nHepatocytes collecting and plating: Day 1\nTiming: 25–30 min\nHepatocytes collection: Centrifugate the filtered hepatocytes at 500 × g for 2 min, then discard the supernatants and then wash the cell pellets with 4 mL growth medium;\nNote: wash cell pellets about three times with 4 mL of the growth medium.\nCheck the viability of hepatocytes: Stain the hepatocytes by combining 50 μL of cell sample with 50 μL of a 0.2% trypan blue staining solution (for a final concentration of 0.1% trypan blue). Gently mix by pipetting up and down ten times, and count both dead (dark blue) and live cells using a hemocytometer on a bright-field microscope to calculate the survival rate. The resulting viability was about 85% (Figure 4[href=https://www.wicell.org#fig4]);\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/739-Fig4.jpg\nFigure 4. Trypan blue viability assay for the hepatocytes\n(A) Images were taken using a 5 × objective. Scale bar, 200 μm.\n(B) Images were taken using a 10 × objective. Scale bar, 100 μm.\nNote: When a mouse liver is digested thoroughly, about 2.7 × 107 hepatocytes can be recovered.\nHepatocytes Plating: Count hepatocytes and plate the cell on poly-lysine-coated cell culture plates/wells. The desired plating density is about 7 × 104 per well in a 12-well plate for the following immunofluorescence staining, which gives about 60%–70% confluence on the next day. Change the growth medium after 6 h, and culture hepatocytes for another 18 h before HPG incorporation (Figure 5[href=https://www.wicell.org#fig5]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/739-Fig5.jpg\nFigure 5. Primary culture of hepatocytes",
    "After 12 h of plating, the hepatocytes have adhered to the surface and acquire a spherical shape. After 18 h of plating, the plating hepatocytes acquire a typical hexagonal shape. Scale bar, 100 μm.\nNote: Hepatocytes should be plated evenly across the plate/well for the subsequent HPG incorporation and immunofluorescence staining. See Troubleshooting 4\nNote: After 18 h of plating, incubate the plated hepatocytes with HPG. See Troubleshooting 5.\nHPG incorporation: Day 2\nTiming: 65–70 min\nSerum starvation: Wash plated primary hepatocytes with warm PBS (37°C) twice, add 500 μL of DMEM medium without serum and incubate for 30 min for serum starvation ;\nCritical: Because the composition of serum is very complex and HPG were methionine (Met) analog, serum and methionine could competitively inhibit the incorporation of HPG. For better HPG incorporation, cells should be starved from serum during HPG incorporation. See Troubleshooting 6.\nHPG incorporation.\nNote: HPG (L-homopropargylglycine) is a synthetic chemical molecule, which is a methionine (Met) analog and can substitute for Met in protein synthesis, and this protein-containing HPG can perform normal physiological functions. HPG contains an alkyne moiety, which can undergo a classic click chemical reaction with azide with Alexa Fluor. The newly synthesized proteins containing HPG can be labeled with fluorescence through a two-step linking reaction so that the newly synthesized proteins can be traced and located by immunofluorescence staining (Narita et al., 2011[href=https://www.wicell.org#bib3]) (Figures 6[href=https://www.wicell.org#fig6]A and 6B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/739-Fig6.jpg\nFigure 6. HPG labeling for newly synthesized proteins\n(A) Chemical structure formula of Met and HPG.\n(B) Diagram of click chemistry reaction.\n(C) All hepatocytes can be stained with either HPG or DAPI dyes. The white arrows represent other cell types. Scale bar, 50 μm.",
    "Prepare the working solution of Click-iT® HPG Component A: dilute the stock solution(50 mM) with a certain proportion in 10 mL of pre-warmed modified L-methionine-free DMEM medium to make a final working solution (50 μM);\nNote: Before use, briefly centrifuge Click-iT® HPG reagent Component A to maximize reagent recovery. The HPG-containing modified L-methionine-free DMEM medium should be pre-warmed.\nRemove the DMEM medium and add 500 μL/well of medium with 50 μM Click-iT® HPG Component A working solution;\nIncubate HPG for different times in a CO2 incubator at 37°C.\nNote: The HPG concentration and incubation time should be optimized for different cell types. See Troubleshooting 6.\nNote: Contamination of another cell type was seen from bright-field images (Figure 6[href=https://www.wicell.org#fig6]C).\nHowever, hepatocytes were easily distinguished. After 18 h of incubation, plated hepatocytes acquire a typical hexagonal shape, and most hepatocytes contain two nuclei, which are the typical features of hepatocytes.\n(Optional) Drug treatment: Day 2\nTiming: 30–35 min\nNote: Cycloheximide (CHX) is a protein synthesis inhibitor that inhibits peptide chain transfer by acting on the ribosome of the 80S, thereby inhibiting protein synthesis (Schneider-Poetsch et al., 2010[href=https://www.wicell.org#bib6]).CHX can be used to identify whether HPG can label newly synthesized proteins.\nFor CHX treatment, firstly, incubate hepatocytes with 500 μL/well DMEM medium containing 10 μg/mL CHX for 30 min during serum starvation and then remove CHX-containing DMEM medium. Secondry, add 500 μL/well modified L-methionine-free DMEM medium containing 50 μM Click-iT® HPG Component A working solution and 10 μg/mL CHX for 30 min (Figures 7[href=https://www.wicell.org#fig7]A and 7B)\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/739-Fig7.jpg\nFigure 7. Identification of HPG labeled newly synthesized proteins\n(A) Schematic diagram of CHX treatment procedure.\n(B) Immunofluorescence images show the HPG incorporation in hepatocytes with or without CHX treatment. Scale bar, 50 μm.",
    "Note: Hepatocytes treated with 10 μg/mL CHX could still detect a weak fluorescent signal. The CHX concentration and incubation time should be optimized for different cell types.\nCell fixation, permeabilization and blocking: Day 2\nTiming: 90–100 min\nAfter HPG incubation, remove the HPG-containing modified L-methionine-free DMEM medium and wash cells once with 1 mL/well pre-warmed PBS, then remove PBS;\nAdd 500 μL/well pre-warmed fixation buffer. Incubate for 20 min at 22°C–25°C, then remove the fixative;\nNote: In order to maintain cell morphology, 4% PFA must be pre-warmed before cell fixation.\nAfter cell fixation, wash cells twice with 1 mL/well 1 × PBS and then add 500 μL/well of permeabilization buffer and incubate for 20 min at 22°C–25°C;\nAdd 500 μL/well blocking buffer and incubate for 45 min at 22°C–25°C for blocking;\nWash cells with 1 mL/well wash buffer for 2 times, 5 min/ time to remove non-incorporated HPG followed by Click-iT® HPG detection.\nClick chemistry reaction: Day 2\nTiming: 30–40 min\nNote: In our protocol, all materials needed in Click chemistry reaction were ordered from Thermo Fisher (Cat#C10429).\nPrepare 1 X Click-iT® HPG reaction buffer additive (Table 1[href=https://www.wicell.org#tbl1]): dilute the 10 X stock solution with deionized water ;\ntable:files/protocols_protocol_739_6.csv\nNote: The 1 X Click-iT® HPG reaction buffer additive should be prepared freshly and use the solution on the same day.\nPrepare Click-iT® reaction cocktail according to Table 1[href=https://www.wicell.org#tbl1];\nNote: The Click-iT® reaction cocktail must be used within 15 min.\nAdd 500 μL/well Click-iT® reaction cocktail (Table 1[href=https://www.wicell.org#tbl1]) to each well and mix well;\nIncubate for 30 min at 22°C–25°C;\nCritical: The Click-iT® reaction cocktail should be protected from light.\nRemove the Click-iT® reaction cocktail and wash with 500 μL/well of Click-iT® reaction rinse buffer (Component F) then remove the Click-iT® reaction rinse buffer;",
    "Note: Make sure to wash at least 3 times and remove the non-incorporated HPG thoroughly. See Troubleshooting 7.\nDilute DAPI stock solution at 1:5000 in PBS to obtain DAPI working solution, then add 500 μL/well of DAPI working solution for DNA staining. Protected from light and incubate for 10 min at 22°C–25°C;\nRemove the DAPI working solution, wash twice with 1 mL/well PBS, followed by mounting the coverslips for imaging.\nHPG detection via microscope: Day 2\nTiming: 40 min\nMount the coverslips on the glass slide with antifade mounting medium (20 μL/plate ), wait until the mounting medium fixed before taking images;\nObtain images with Zeiss LSM 700 confocal microscope;\nInstrument settings: filter blocks used are SP 490 in channel 1 to detect the HPG signal, LP 560 in channel 2 to detect DAPI;\nAdjust the laser energy, pinhole, gain, and exposure time to get the best signal/noise ratio, fix these settings throughout the acquisition;\nImage acquisition: select the appropriate image resolution (at least 1024 X 1024), scan the sample frame by frame completely, then save and export the images in LSM format.\nNote: Ensure all sample surfaces were clear to avoid contaminating the lens, and the photomultiplier tube (PMT) detector can obtain sufficient signals. When acquiring images, keep laser exposure time as short as possible to avoid fluorescence quenching.\nAnalyze the obtained images by Image J software: the overall fluorescence intensities of HPG and DAPI from each cell in the control or experimental groups were measured by Image J software. The average HPG: DAPI ratios from the control and experimental groups were calculated and presented as a bar graph using GraphPad software, indicating the levels of newly synthesized proteins.",
    "Note: The location of newly synthesized proteins can be monitored using immunofluorescence as well. Proteins can be pulse-labeled with HPG and chased to monitor the degradation rate."
  ],
  "subjectAreas": [
    "Molecular/Chemical Probes",
    "Cell Isolation",
    "Microscopy",
    "Cell Culture",
    "Cell-Based Assays",
    "Gene Expression"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}