{
  "id": 8360,
  "origin_website": "Jove",
  "title": "Cone-Enriched Cultures from the Retina of Chicken Embryos to Study Rod to Cone Cellular Interactions",
  "procedures": [
    "The protocol was approved by the Committee on the Ethics of Animal Experiments of the University Pierre and Marie Curie and the French ministry of research (Permit Number: APAFIS#1028 2015070211275177). The animal experiments were performed under the following authorization: \"Certificat d'autorisation d'expérimenter sur les animaux vertébrés A-75-1863. Préfecture de Police de Paris (November 9th 2011-November 8th 2016)\".\n1. Incubation of fertilized eggs\nCollect weekly fertilized eggs (strain I 657, red label), obtained naturally, at an industrial hatchery.\nMaintain the fertilized eggs at 17°C (their biological zero) in the laboratory after they are \"laid\" by the hen.\nFor each culture, incubate seven fertilized eggs for 24 hours at 20 °C and then 136 hours at 37 °C with intermittent reversion of the inclination (a progressive movement for 2 hours from one side to its opposite, a 4-hours cycle) of the eggs in a humidified chamber.\n2. Recovery of the chicken embryos\nWash the surface of the seven eggs with disinfectant (e.g., Pursept A express).\nTo break the eggshell, make a hole in the top of the shell with large straight pliers. Then cut the shell to remove the hat from the egg as a soft-boiled egg.\nGently extract each embryo from the eggshell with curved forceps, and then transfer it to a Petri dish containing sterile phosphate buffer saline (PBS) previously heated to 37 °C. Gently, remove the envelope that surrounds the embryos (the chorion or chorioallantoic membrane).\nVerify the stage of development of each embryo by visual comparison to Hamburger and Hamilton42.\nSelect two embryos at the 29th stage of development (Figure 1). The wings bend at the elbows. The collar stands out visibly. The bill is more prominent than at the 28th stage.\nEnucleate the eyes of these selected embryos and transfer them in CO2-independent medium (Life technologies).",
    "CAUTION: It is very important that the embryo is at stage 29, and not at stage 28 or 30 (Figure 1); that is why it is necessary to incubate at least 7 eggs, even if only two will be finally used. The chorion is very thin, so hard to distinguish, but it is very close from the embryo, so it has to be removed without touching the embryo.\n3. Dissection of the retinas\nDecapitate and enucleate the selected embryos with curved forceps.\nTransfer the four eyes into CO2-independent medium. This medium contains 0.9 mM CaCl2 and 0.65 mM MgCl2.\nPosition the eye with the cornea face down, the optic nerve facing the experimenter. Drill a hole in the optic nerve using two straight forceps.\nInsert a branch of each forceps between the retina and the pigment epithelium (Figure 2). Pull on each forceps and rotate the eye to detach the epithelium from the retina. Remove the cornea followed by the lens and the vitreous.\nTransfer the four retinas in a Petri dish containing Ringer's medium at pH 7.2.\n\t​CAUTION: Make sure that only the retina remains and remove any traces of vitreous and remaining retinal pigmented epithelium.\n4. Preparing the retinal cell suspension\nCut the four retinas in very small pieces using two straight pliers.\nWash the retinal pieces twice with Ringer's medium.\nAfter the second wash with Ringer's medium, let the pieces of retina fall on the bottom of the tube and remove the Ringer's medium. Treat the retinal pieces for 20 minutes at 37 °C with a solution of trypsin (0.25% w/v).\nDisperse the solution after 10 minutes by successive suction. Discharge using a Pasteur pipette and check for dissociation of the retinal pieces. Stop the reaction by adding culture media supplemented with 10% inactivated foetal calf serum.",
    "Incubate the cell suspension with 0.05 mg of DNase I. Dissociate the cell clusters and the DNA by successive suction and discharge using a Pasteur pipette immediately after adding the DNase.\nWash the retinal cell suspension twice with chemical defined culture medium (CDCM): an equal volume of Dulbecco's Modified Eagle Medium and M199 media supplemented with 100 µg/mL linoleic acid/BSA, 0.86 µM insulin, 0.07 µM transferrin, 2.0 µM progesterone, 0.28 µM prostaglandin, 0.29 µM Na2SeO3, 182 µM putrescine, 3 mM taurine, 4.7 µM cytidine 5′-diphosphocholin, 2.7 µM cytidine 5′-diphosphoethanolamine, 0.55 µM hydrocortisone, 0.03 µM triiodothyronine, 1 mM sodium pyruvate and 20 µM gentamycin.\n5. Retinal cell seeding\nTreat two black 96-well culture plates with transparent bottom for 2 hours at 37 °C with poly-L-lysine at 32.25 µg/cm2.\nRinse these plates twice with M199 culture medium. Resuspend the cell pellet in 1 mL of CDCM.\nAdd to an aliquot of 10 µL of the cell suspension trypan blue to stain the living cells. Add the cells suspension specimen to a haemocytometer (cell counting-chamber of Malassez).\n\t\nUnder a microscope, count the stained cells for four rows of the haemocytometer (i.e., 40 squares), and then calculate the average cell number for one row. Calculate the concentration of cells of the suspension by applying the following method: Number of cells/mL of suspension = average number of cells in a row (10 squares) x 10 the total number of squares of the haemocytometer x dilution with trypan blue x 1,000 (to express the result as cells/mL).\nBring the cell suspension to two concentrations (5.6 x 104 cells/mL and 1.12 x 105 cells/mL) corresponding to the two plating densities (1 x 105 cells/cm2 and 2 x 105 cells/cm2) using CDCM.",
    "Seed 50 µL of the two cell suspensions into the two pretreated black 96-well culture plates. Distribute the cells in the plates with a multichannel pipette from the right of the plate to the left, homogenizing between each column, so that the distribution of the cells is homogeneous.\nAdd 50 µL of the library of molecules (e.g., the conditioned media from a cDNA library, see below) to be screened using a predefined pattern (Table 1).\nIncubate the plates for seven days at 37°C under 5% CO2 with no change of media.\n6. Counting viable cells\nTo each well of the plate, add 2.7 µM of calcein AM and 0.3 mM of ethidium homodimer.\n\tNOTE: Calcein penetrates the cells that are impermeable to large molecules as ethidium homodimer. In the cytoplasm of living cells, calcein is hydrolyzed by endogenous esterases, becomes fluorescent by emitting at 520 nm when excited at 485 nm. Ethidium homodimer bind to DNA on dead cells. Ethidium DNA-homodimer binding causes red fluorescence to be emitted at 635 nm after excitation at 520 nm.\nIncubate the plates for 1 hour at room temperature in the absence of light.\nRead the fluorescence on an automated plate reader composed of an inverted microscope equipped with a mercury lamp with two excitation filters at 485 and 520 nm, two filters of emission at 520 and 635 nm, an objective (x10), a motorized stage controlled by a processor and a charge-coupled device camera (CCD). This counting platform is controlled by the Metamorph software19. It makes it possible to acquire fluorescence images of living cells and dead cells simultaneously in each well of the 96-well plate, starting from wells A1 towards well A12, then B12 towards B1, C1 towards C12 and so on (Table I).",
    "Calculate the average area A of a single cell using the 18 wells of the negative controls (Table I).\nCount the cells in each well of the plate and apply the following empirical formula A x 29 / 20.7 to prevent that cell doublets (grouping of two cells) are counted. Score the protective effect of the cones by molecules as the ratio between the average cell number in the 4 wells where we tested the molecule versus the average cell number in the 18 wells of the negative control (see Table 1 and Supplementary Figure 1).\nCombine the results of the plate seeded at 1 x 105 cells/cm2 with the one seeded at 2 x 105 cells/cm2 to evaluate the potential protection (viability ratio) by each molecule screened."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}