{
  "id": 13024,
  "origin_website": "Jove",
  "title": "An Efficient Protocol for CUT&RUN Analysis of FACS-Isolated Mouse Satellite Cells",
  "procedures": [
    "Mice were kept in an accredited animal house, in compliance with National Animal Care Guidelines (European Commission directive 86/609/CEE; French decree no.87-848) on the use of laboratory animals for research. Intended manipulations were submitted to the Ethical committee (Com'Eth, Strasbourg, France) and to the French Research Ministry (MESR) for ethical evaluation and authorization according to the 2010/63/EU directive under the APAFIS number #22281.\n1. Preparation of cell suspension for isolation of satellite cells by fluorescence-activated cell sorting (FACS) (Figure 1)\nIsolation of muscle tissue\n\t\nDecontaminate the tools for muscle dissection, including forceps, scalpels, and scissors, using a cleaning agent (Table 1), and rinse thoroughly with distilled water.\nPrepare two 2 mL tubes (Table 1), each containing 1 mL of muscle isolation buffer, and place them on ice for collecting harvested muscles.\nSacrifice two 10-week-old C57/Bl6J male mice by CO2 asphyxiation followed by cervical dislocation. Spray 70% ethanol over each entire mouse. Peel off the skin from the hind limb using forceps. Dissect out all the limb muscles surrounding the femur, tibia, and fibula (approximately 1 mg of muscles per mouse).\n\t\tNOTE: The satellite cells number decreases after 15 weeks of age.\nPlace the harvested limb muscles into 2 mL tubes containing 1 mL of muscle isolation buffer prepared in step 1.1.2. Collect the muscles from the second mouse following the same procedure. Mince the harvested muscles with scissors on ice until smaller than 1 mm3 fragments are obtained.\n\t\tNOTE: Muscles were collected and minced mainly as described12. Perform tissue digestion either following step 1.2 or 1.3.\nTissue digestion with collagenase enzyme",
    "Transfer the minced muscle suspension from the two mice by pouring them into a 50 mL tube (Table 1) containing 18 mL of muscle isolation buffer (supplemented with 5 mL [5 U/mL] of dispase and 5 mg of type I collagenase) (Table 1).\nClose the tube tightly and seal it with laboratory film (Table 1). Place it horizontally in a shaking water bath (Table 1) at 37 °C at 100 rpm for 30 min.\nAfter 30 min, add 5 mg of type I collagenase. Keep tubes for another 30 min under agitation in a shaking water bath at 37 °C at 100 rpm.\nUpon digestion, pipette the muscle suspension up and down 10 times with a 10 mL pipette to improve the efficiency of dissociation. Centrifuge at 4 °C at 400 x g for 5 min. A clear pellet will be visible at the bottom of the tube. Discard the supernatant using a 10 mL pipette, leaving 5 mL of medium in the tube.\n\t\tNOTE: Leaving the medium helps avoid stressing the cells. Add 10 mL of fresh muscle isolation buffer and resuspend the pellet by pipetting up and down with a 10 mL pipette.\nPlace 100 µm, 70 µm, and 40 µm cell strainers (one of each kind) (Table 1) on open 50 mL tubes. Pipette the suspension onto the successive cell strainers (100 µm, 70 µm, 40 µm) and collect the flowthrough into the 50 mL tubes, containing cells below 40 µm.\nCentrifuge the suspension at 4 °C at 400 x g for 5 min. Discard the supernatant using a 10 mL pipette until 2 mL remain, and then use a 0.2-1 mL pipette until 100-200 µL remain. Resuspend the pellet in 2 mL of red blood cell lysis buffer (Table 2). Incubate on ice for 3 min.",
    "Centrifuge at 4 °C at 400 x g for 5 min and discard the supernatant using a 20-200 µL pipette. Resuspend the cells in 100 µL of cold FACS buffer (Table 2). Place on ice.\nAlternative method for tissue digestion with Liberase thermolysin low (TL) enzyme\n\t\nFollow the descriptions in step 1.1. for tissue isolation.\nFor Liberase-mediated tissue disaggregation, harvest muscles in 2 mL of Roswell Park Memorial Institute (RPMI) isolation buffer (Table 2), instead of muscle isolation buffer described in step 1.1.2.\nTransfer the minced muscle suspension from the two mice by pouring them into a 50 mL tube (Table 1) containing 18 mL of RPMI isolation buffer supplemented with 300 or 600 µL of Liberase TL at 5 mg/mL (Table 1) (i.e., 0.083 mg/mL and 0.167 mg/mL final concentrations, respectively)13.\nClose the tube tightly and seal it with laboratory film (Table 1). Place it horizontally in a shaking water bath (Table 1) at 37 °C at 100 rpm for 30 min.\nUpon digestion, pipette the muscle suspension up and down 10 times with a 10 mL pipette to dissociate and improve the efficiency of dissociation.\nCentrifuge at 4 °C at 400 x g for 5 min. A clear pellet will be visible at the bottom of the tube. Discard the supernatant using a 10 mL pipette, leaving 5 mL of medium in the tube. Leaving the medium helps avoid stressing the cells. Add 10 mL of fresh RPMI isolation buffer, and resuspend the pellet by pipetting up and down with a 10 mL pipette.\nPlace 100 µm, 70 µm, and 40 µm cell strainers (one of each kind) (Table 1) on open 50 mL tubes.",
    "Pipette the suspension onto successive cell strainers (100 µm, 70 µm, 40 µm) and collect the flowthrough into the 50 mL tubes, containing cells below 40 µm.\nCentrifuge the suspension at 4 °C at 400 x g for 5 min. Discard the supernatant using a 10 mL pipette until 2 mL remain, and then use a 0.2-1 mL pipette until 100-200 µL remain.\nResuspend the pellet in 2 mL of red blood cell lysis buffer (Table 2). Incubate on ice for 3 min.\nCentrifuge at 4 °C at 400 x g for 5 min and discard the supernatant using a 20-200 µL pipette.\nResuspend the cells in 100 µL of cold FACS buffer (Table 2). Place on ice.\nPreparation of cell suspension for FACS isolation\n\t\nTransfer 10 µL of the cell suspension obtained in step 1.2.12 into a fresh 1.5 mL tube. This sample will constitute the unstained control or the negative control (Figure 2). Add 190 µL of FACS buffer, transfer to a 5 mL tube (Table 1), and store on ice.\nCentrifuge the remaining 90 µL of the cell suspension obtained in step 1.2.12 at 4 °C at 400 x g for 5 min and discard the supernatant using a pipette (20-200 µL tip volume). Incubate the cells with 400 µL of fixable viability stain (Table 3) diluted in serum-free Dulbecco's modified Eagle medium (DMEM) for 15 min at room temperature (RT).\nWash the cells by centrifugation at 4 °C at 400 x g for 5 min and add 100 µL of FACS buffer. Gently invert the tubes three times and centrifuge again at 4 °C at 400 x g for 5 min.",
    "During the centrifugation time, prepare 100 µL of a master mix of primary antibodies coupled to fluorophores and directed against CD11b, CD31, CD45, TER119, CD34, ITGA7, and CXCR4 (Table 3), diluted in FACS buffer.\nCentrifuge at 400 x g for 5 min at 4 °C, discard the cell supernatant using a pipette (20-200 µL tip volume), and add the 100 µL antibody mix. Gently invert the tube three times. Do not vortex. Incubate in the dark on ice for 30 min.\nCentrifuge at 400 x g for 5 min at 4 °C. Discard the supernatant using a 20-200 µL pipette and add 500 µL of 1x phosphate-buffered saline (PBS) to wash the cells. Gently invert the tube three times. Re-centrifuge at 400 x g for 5 min at 4 °C and discard the supernatant using a 20-200 µL pipette.\nResuspend the cell pellet in 500 µL of FACS buffer and transfer the suspension to a 5 mL tube.\n\t\tNOTE: the cell suspension obtained from Liberase digestion is processed in the same way.\nSatellite cells selection by FACS\n\t\nBriefly vortex the cell suspension (2-5 sec) and process the cells on a flow cytometer equipped with a 100 µm nozzle (Table 1).\nDetermine the various gate sizes based on the unstained sample stored at step 1.4.1 (Figure 2).\nCoat a 5 mL tube with 1 mL of pure fetal calf serum (FCS) to improve cell collection and add 500 µL of FACS buffer.\nExchange the unstained sample with the antibody-labelled sample.\nSelect the population of interest according to the forward scatter area (FSC-A) and side scatter area (SSC-A) (Figure 3A), and remove doublet cells with the FSC-A and forward scatter height (FSC-H) (Figure 3B)14.\nIdentify living cells with fixable viability stain negative staining (Figure 3C).",
    "Select negative cells for CD31, CD45, TER119, and CD11b (Figure 3D).\nTo identify satellite cells, select first the cells that are positive for CD34 and ITGA7 (Figure 3E), and then select the CXCR4-positive cells on the CD34- and ITGA7-selected population (Figure 3F).\nCollect the selected cells (between 40,000 and 80,000 cells, according to the quality of the preparation) in the 5 mL coated tube containing 500 µL of FACS buffer.\n2. Validation of the isolated population in tissue culture\nSlide coating with hydrogel\n\t\nDilute 280 µL of a pure hydrogel human embryonic stem cell (hESC) qualified matrix (Table 1) in 12 mL of serum-free DMEM/F12 medium.\nCoat a chamber slide (Table 1) with the hydrogel solution, and incubate it overnight at 4 °C.\nThe next day, incubate the chamber slide at 37 °C and 5% CO2 for 1 h before cell seeding.\nCell growth and differentiation\n\t\nPlate out approximately 20,000 cells, obtained from step 1.5.9, per well, and grow them in growth medium (Table 2) for 5 days. Take phase-contrast images using a brightfield microscope (Figure 4A), before processing them for immunofluorescence analysis to ensure the quality of the preparation (Figure 4B).\nTo induce myogenesis, grow amplified satellite cells from step 2.2.1 in myogenic medium (Table 2) for an additional 7 days. Take phase-contrast images using brightfield microscope (Figure 4C) before processing them for immunofluorescence analysis to ensure the quality of the preparation (Figure 4D).\nImmunocytofluorescence analysis\n\t\nGently remove the medium, wash the cells that were cultured on chamber slide with 100 µL of 1x PBS twice, and fix them with 100 µL of 4 % paraformaldehyde (PFA) at RT for 1 h.",
    "NOTE: This step should be performed with care. A small volume of medium should always be kept in the chamber to prevent stressing the cells, and the PBS should be poured through the walls of the chamber.\nWash the cells three times with 100 µL of 1x PBS, supplemented with 0.1% Tween 20 (PBST) to permeabilize the cell membranes.\nBlock unspecific signals by incubation in 100 µL of 1x PBST supplemented with 5% FCS (PBST-FCS) at RT for 1 h.\nIncubate the cells with 100 µL of a master mix of anti-PAX7 and anti-dystrophin (DMD) antibodies (diluted in 1x PBST-FCS) at 4 °C overnight, to detect satellite cells and myofibers, respectively.\nWash the cells three times with 100 µL of 1x PBST, and incubate them with 100 µL of goat anti-mouse Cy3 or goat anti-rabbit Alexa 488 secondary antibodies (Table 3) diluted in 1x PBST-FCS at RT for 1 h.\nDissociate the chamber wells from the slide using the equipment provided by the supplier, add 20 µL of aqueous mounting medium with 4′,6-diamidino-2-phenylindole (DAPI), and cover the slide with a coverslip (Table 1).\nObserve and capture the image of the stained cells with a confocal microscope.\nProcess the images using image analysis software (Figures 4B,D).\n3. CUT&RUN analysis\nSample preparation for CUT&RUN analysis on FACS-isolated satellite cells\n\tNOTE: CUT&RUN was performed essentially as described10,15. The buffer composition is presented in Table 2.\n\t\nFor the CUT&RUN assay, use approximately 40,000 of the cells obtained in method 1, step 1.5.9, per sample/antibody that must be tested.\nCentrifuge the FACS-isolated satellite cells at RT at 500 x g for 10 min, then discard the supernatant using a pipette (20-200 µL tip volume).",
    "Wash the cells with 1 mL of 1x PBS, centrifuge at RT at 500 x g for 5 min, discard the supernatant using a pipette (0.2-1 mL tip volume), and resuspend them in 1 mL of cold nuclear extraction buffer (Table 2). Incubate on ice for 20 min.\nDuring incubation, prepare one 1.5 mL tube containing 850 µL of cold binding buffer (Table 2) and add 20 µL of concanavalin A-coated magnetic beads per sample (Table 1).\nWash the beads twice with 1 mL of cold binding buffer using a magnetic rack (Table 1). For each wash or buffer change throughout the procedure, let the beads accumulate at the side of the tube on the magnetic rack for 5 min before removing the cleared supernatant with a pipette (0.2-1 mL tip volume). Then, resuspend gently in 300 µL of cold binding buffer.\nCentrifuge the nuclei at 4 °C at 600 x g for 5 min and resuspend them gently in 600 µL of nuclear extraction buffer. Gently mix the 600 µL of extracted nuclei with the 300 µL of concanavalin A bead slurry, and incubate at 4 °C for 10 min.\nRemove the supernatant using a magnetic rack, as described in step 3.1.4, and resuspend the bead-bound nuclei gently with 1 mL of cold blocking buffer (Table 2). Incubate at RT for 5 min.\nRemove the supernatant using a magnetic rack and wash the bead-bound nuclei twice with 1 mL of cold wash buffer (Table 2). During the second wash, equally split the bead-bound nuclei into 1.5 mL tubes. Each tube will be treated with a specific antibody in the following step.\n\t\tNOTE: In this example, 250 µL of bead-bound nuclei were split in four 1.5 mL tubes.",
    "Separate the supernatant using a magnetic rack, as described in step 3.1.4, and aspirate with a pipette. Gently resuspend the nucleus/bead complexes with a specific primary antibody (Table 3), or an IgG of another species (here rabbit) diluted in 250 µL of cold wash buffer. Incubate at 4 °C overnight with gentle agitation.\n\t\tNOTE: The antibodies used here are directed against AR, H3K4me2, and H3K27ac.\nRemove the supernatant with a magnetic rack, as described in step 3.1.4, wash the bead-bound nuclei twice with 1 mL of cold wash buffer, and resuspend in 100 µL of cold wash buffer.\nDilute protein A-micrococcal nuclease at 1.4 ng/µL in 100 µL per sample of cold wash buffer.\nAdd 100 µL of protein A-micrococcal nuclease to the 100 µL of sample obtained in 3.1.11 and incubate at 4 °C for 1 h with agitation.\nRemove the supernatant with a magnetic rack, as described in step 3.1.4, wash twice with 1 mL of cold wash buffer, and resuspend the bead-bound nuclei in 150 µL of cold wash buffer.\nTo initiate DNA cleavage, add 3 µL of 100 mM of CaCl2 to the 150 µL of sample, mix quickly by flicking, and incubate on ice for 30 min. Stop the reaction by adding 150 µL of stop buffer and incubate at 37 °C for 20 min to digest the RNA and release the DNA fragments.\nFor DNA extraction, centrifuge the samples at 16,000 x g at 4 °C for 5 min.\nTransfer the supernatant to a new microfuge tube and discard the pellet and beads.\nAdd 3 µL of 10% sodium dodecyl sulfate (SDS) and 2.5 µL of 20 mg/mL proteinase K. Mix by inversion. Incubate for 10 min at 70 °C (no shaking).",
    "Add 300 µL of phenol/chloroform/isoamyl alcohol, vortex, transfer to 2 mL phase-lock tubes (pre-spinned for 5 min at 16,000 x g), and centrifuge for 5 min at 16,000 x g at 4 °C.\nAdd 300 µL of chloroform to the same tube and centrifuge for 5 min at 16,000 x g at 4 °C. Collect the supernatant (~300 µL) with a pipette (0.2-1 mL tip volume) and transfer into a new 1.5 mL tube.\nAdd 1 µL of glycogen (20 mg/mL concentration).\nAdd 750 µL of 100% ethanol and precipitate overnight at -20 °C.\nPellet the DNA by centrifugation for 15 min at 16,000 x g at 4 °C. Wash the pellet with 1 mL of 100% ethanol, centrifuge for 5 min at 16,000 x g, discard the supernatant, centrifuge for 30 s at 16,000 x g, and remove the liquid with a pipette (20-200 µL tip volume).\nAir-dry the pellet for ~5 min. Resuspend in 25 µL of 1 mM Tris-HCl (pH 8) and 0.1 mM ethylenediaminetetraacetic acid (EDTA; pH 8).\nBioinformatics analysis\n\t\nPrepare libraries from immunocleaved DNA and sequence them as paired-end 100 bp reads with the help of the genomic platform as described16.\nRemove reads overlapping with the ENCODE blacklist region (V2) and separate the remaining reads into two groups: fragment size <120 bp (without nucleosome, in general for transcription factors) and fragment size >150 bp (with nucleosomes, normally for histone marks). Map to the mm10 reference genome using Bowtie 2 (v2.3.4.3)17.\nGenerate bigwig files with bamCoverage (deeptools 3.3.0: bamCoverage --normalizeUsing RPKM --binSize 20).\nRetain uniquely mapped reads for further analysis.\nGenerate raw bedgraph files with genomeCoverageBed (bedtools v2.26.0).",
    "Use the SEACR 1.3 algorithm (stringent option) for the peak calling. Load the target data bedgraph file in UCSC bedgraph format that omits regions containing zero signal, and control (IgG) data bedgraph file to generate an empirical threshold for peak calling18.\nPerform a Pearson correlation analysis with deeptools to determine the similarity between the samples19. Use the command line multiBamSummary bins --bamfiles file1.bam file2.bam -o results.npz, followed by plotCorrelation -in results.npz --corMethod pearson --skipZeros --plotTitle \"Pearson Correlation of Read Counts\" --whatToPlot heatmap --colorMap RdYlBu --plotNumbers -o heatmap_PearsonCorr_readCounts.png --outFileCorMatrix PearsonCorr_readCounts.tab.\nVisualize the genome-wide intensity profiles with IGV20 using bedgraph files and the bed file peaks obtained from SEACR.\nUse HOMER for peak annotation and motif search21.\nFinally, compare the datasets with previously published ones with ChIP-Atlas Peak browser to visualize them on IGV, and/or enrichment analysis using the SEACR-generated bed files as an input dataset22.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}