{
  "id": 9167,
  "origin_website": "Jove",
  "title": "Intramuscular Injections Along the Motor End Plates: A Minimally Invasive Approach to Shuttle Tracers Directly into Motor Neurons",
  "procedures": [
    "All experimental procedures described here complied with the Animal Care and Ethics Committee of UNSW Australia and were performed in accordance with the National Health and Medical Research Council of Australia regulations for animal experimentation. All procedures in this protocol should be performed in accordance with the requirement of the relevant Animal Care and Ethics Committee.\n1. Acetylcholinesterase Histochemical Staining\nPrepare the Acetylcholinesterase reaction mixture\n\t\nAdd 290 mg of Acetylthiocholine iodide to 200 ml of 0.1 M phosphate buffer (PB). Mix with a magnetic stirrer at 900 rpm.\nAdd 600 mg of glycine under continuous stirring.\nSlowly add 420 mg of copper sulphate to the reaction mixture under continuous stirring until the product is completely dissolved.\nRemove the skin on the animal carcass (obtained through tissue sharing) by making incisions into the skin of a perfused rat or mouse, grasping the skin from the neck area and pulling it past its feet. Ensure that the fascia covering each muscle is either removed or significantly perforated to ensure ample exposure of the muscle fibres to the reaction solution.\nImmerse the entire body or limb of interest into the reaction mixture and incubate O/N at 4 °C.\nWash the carcass for 2 min in distilled water. Note: At this stage, the muscles exhibit a blue coloration and the motor end plates (MEPs) can be seen as white dots.\nExpose the carcass to a 10% ammonium sulphide solution for 3-5 sec.",
    "Note: The muscle fibres will rapidly turn brown and the MEPs will be observable as black speckled dots. If the reaction occurs too quickly, and the muscle fibres are stained too dark to distinguish between the MEPs and the muscle fibres try using lower concentrations of ammonium sulphide solution (e.g., 5%). The reaction time to get the optimal contrast between the MEPs and the muscle fibres varies from one sample to the other. Therefore it is difficult to define the exact exposure time to the reagent. The reaction should be closely monitored and stopped when the contrast is deemed adequate.\nWash the carcass two times, with agitation in distilled water and gently pat the carcass dry.\nPhotograph both the lateral and medial aspects of the limb, ensuring that the MEPs for all the muscles of interest are captured.\n2. Intramuscular Injections at the Motor End Plates\nPull glass micropipettes with a micropipette puller (the use of graded micropipettes with plungers is recommended). With the help of a dissecting microscope, break the tips of the micropipettes with a pair of forceps such that the internal diameter of the lumen of the micropipette is approximately 0.5 mm.\nEnsure that all surgical instruments used are freshly autoclaved and that the surgical area is sterile.\nFill the micropipettes with Fluoro-Gold (5% in distilled water).",
    "Induce anaesthetise in the animal in an induction chamber with Isofluorane (4% in O2). Check for righting reflex and ensure its absence before removing it from the induction chamber. Secure a nose cone over the snout of the rat and deliver Isofluorane (2% in O2) for maintenance of anaesthesia. Pinch the animal’s toes and gently touch the animal’s eye to ensure that both the pedal withdrawal and the corneal reflexes are absent. Note: A mixture of ketamine and xylazil can also be used (80 and 10 mg/kg respectively, delivered intraperitoneally). Ketamine is a Schedule 8 (“Controlled”) drug and necessary protocols associated with the purchase, use, storage and disposal of the drug will have to be adhered to.\nApply eye lubricant to prevent drying of the eyes during the course of the procedure.\nShave the targeted limb and use gauze to wipe the shaved area with three alternating scrubs of chlorhexidine and 70% alcohol.  Transfer the animal to the surgical area.\nPlace the animal on a clean underpad and position it appropriately to ensure good access to the targeted muscle(s).\nUse a pair of forceps with tooth grips to lift the skin over the targeted muscle away from the underlying musculature and make an incision in the skin with surgical scissors. Ensure that the incision is large enough to completely expose the muscle(s) of interest. Ensure that there is minimal disruption to the fascia.\nUse the MEP photographs to mentally transpose the location and shape of the MEP region onto the muscle(s).\n\tNote: A fine felt marker could assist to reproduce the MEP region from the photograph onto the muscle(s) of interest.",
    "Perform multiple injections along the full length of the MEP region (for Fluoro-Gold, 3 to 4 injections of 1-2 µl each should be sufficient). Gently wipe the muscle(s) to remove any seepage.\nBring the two ends of the incised skin close together with blunt forceps and close the wound with surgical clips. Infiltrate 0.1 ml Bupivacaine (0.5% in water) (or other local anaesthetics) along the entire span of the wound.\nTurn the anaesthetic machine off and monitor the animal until it has is fully recovered from anaesthesia.\nWait for 14 days between administration of intra-muscular injections and the perfusion of the animals.\n3. Perfusions\nAdminister a lethal dose of pentobarbitone sodium solution (e.g. Lethabarb; 150 mg/kg) to the animal by intraperitoneal injection.\n\t\nClosely monitor the animal until a deep level of anaesthesia is reached, as confirmed by the absence of the pedal withdrawal and the corneal reflexes.\nPosition the animal on its back on a dissecting board placed over a perfusion sink.\nUse a pair of forceps with tooth grips to lift the skin covering the base of the sternum. Make a small skin incision with a pair of strong surgical scissors immediately below the sternum and then use the forceps to grip the xiphoid cartilage of the sternum. While holding the xiphoid cartilage, enlarge the incision on both sides of the chest cavity, from the sternum to the armpits.\nCut the diaphragm to expose the heart.\n\t\nInject 0.ml of heparin directly into the apex of the heart to prevent coagulation of the blood.\nCut the apex to allow the insertion of a cannula into the left ventricle, and then quickly clamp the cannula in place with the aid of a haemostat.",
    "Make an incision in the right atrium with a pair of fine scissors and immediately start the peristaltic pump. Perfuse with 0.1 M PB until the liquid flowing out of the atrium is nearly free of blood and the color of the liver becomes light brown. Then, perfuse with a solution of paraformaldehyde (4% in 0.1 M PB) until the entire body of the animal becomes rigid.\n4. Cervical Spinal Cord Dissection and Preparation for Histology\nLay the animal carcass on its abdomen.\nCut the skin at the body’s midline with a scalpel and reflect it from the base of the skull to the level of the iliac bone.\nCut through and reflect the paravertebral muscles to expose the dorsal aspect of the vertebral column.\nIdentify the bony spinous process of Atlas, the second cervical segment (i.e., C2), and remove it with a pair of surgical rongeurs or forceps to locate the corresponding underlying dorsal root.\n\t\nIdentify the right C2 root by coloring it with a permanent felt marker.\nRemove the next vertebrae one by one and mark the right dorsal roots with alternating colors (i.e., C2, C4, C6, and C8 can be colored in green and C3, C5, C7, T1 can be colored in blue).\nUse a small surgical needle (e.g., 30 G gauge needle) to gently pierce through the dura covering the lower end of the spinal cord. With the bevel of the needle facing up, lift the dura away from the cord while moving the needle rostrally to make a longitudinal slit.\n\t\nReflect the dura.\nCut the spinal cord transversally into one- or two-segment blocks with a new scalpel blade.",
    "Leave the spinal cord segments in situ and, for each block, carefully make a small fiducial mark on the left side of each block with the scalpel blade half way between two adjacent roots. Ensure that the fiducial mark is deep enough through the tissue as to be visible from the ventral aspect of the blocks. Make the fiducial mark at an angle of approximately 45°, pointing either anteriorly or posteriorly with respect to animal anatomy, to aid in the orientation of the tissue segment following dissection.\nCollect the individual blocks into small, clearly labelled bottles containing a solution of paraformaldehyde (4% in 0.1 M PB) and leave at RT O/N.\nTransfer the blocks into clean, clearly labelled bottles containing a solution of sucrose (30% in 0.1 M PB) and keep at 4 °C for at least two days.\nPlace the segments in cryo-moulds and covered them with tissue freezing medium. For longitudinal histological preparation, orient the blocks with the dorsal aspect facing up and use the fiducial mark to orient the block in the cryo-moulds.\nFreeze the cryo-moulds at -20 °C and cut with a cryostat in 50 µm-thick sections. Note: The sections can be directly mounted on adhesion microscope slides and left to dry O/N. Alternatively, the sections can be floated in 48-well plates filled with 0.1 M PB and subsequently mounted using the fiducial mark to orient the tissue sections on the slides.\n5. Lumbar Spinal Cord Dissection and Preparation for Histology\nLay the animal carcass on it’s back.\nPerform a midline incision along the abdomen of the animal and remove the viscera. Dissect out the muscles of the posterior abdominal wall to expose the ventral aspect of the vertebral column.",
    "Locate the short caudal-most rib and its adjoining T13 vertebra where the T13 ventral root exits the bone.\n\t\nConsecutively remove one by one the two or three vertebrae rostral to T13 (i.e., T12, T11 and, if needed, T10) with fine surgical rongeurs to follow the T13 ventral root until its point of entry in the ventral aspect of the ventral cord and mark it with a permanent felt marker.\nFrom this point on, repeat the same procedure to identify the location of the ventral root entry points for L1, L2, L3, L4, L5, L6 and S1, coloring them with alternating colors.\nFollow the same procedure as described in Section 4.5-4.10 for lumbar spinal cord dissection.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}