{
  "id": 15149,
  "origin_website": "Jove",
  "title": "An In Vitro Protocol for Evaluating MicroRNA Levels, Functions, and Associated Target Genes in Tumor Cells",
  "procedures": [
    "1. Mature MicroRNA (miRNA) Expression Analysis\nMature miRNA complementary DNA (cDNA) synthesis\nAdd 254 ng of total RNA and 4.5 µL of deoxyribonuclease I (DNase I) mixtures, and then add ultrapure water into PCR strip-tubes to make up to 18 µL (Figure 2A). Prepare the reaction for each total RNA sample purified from several cell lines using enough amount of DNase I mixtures based on the total number of reactions.\nNOTE: DNase I mixtures are composed of DNase I (1.8 µL), ribonuclease inhibitor (0.3 µL), and 25 mM MgCl2 (2.4 µL). To reproducibly procure total RNA, a column-based extraction method was applicated instead of using a phenol-chloroform based extraction method. It was reported that the extraction yield of some miRNAs can be varied depending on the number of cells when using a phenol-chloroform based extraction method11,12.\nIncubate the tubes in a thermal cycler. Run the tubes for 10 min at 37 °C, and heat-inactivate DNase I by 5 min incubation at 90 °C. Immediately place the tubes on ice after incubation.\nTransfer 7.1 µL of DNase I treated total RNA into 2 sets of new tubes and then add 1.5 µL of antisense primers for the glyceraldehyde-3-phosphate dehydrogenase (GAPDH) gene (Figure 2B).\nNOTE: The amount of total RNA for cDNA synthesis becomes 100 ng at this step. The stock concentration of GAPDH antisense primers is 10 µM. Adding GAPDH antisense primers is for the generation of GAPDH cDNAs using a gene-specific primer method.\nIncubate the tubes using a thermal cycler. Start at 80 °C for 5 min followed by the reaction at 60 °C for 5 min. Immediately place the tubes on ice after incubation.",
    "Add 3.4 µL of reverse transcription (RT) enzyme mixtures in each reaction (Figure 2B). RT enzyme mixtures are composed of 100 mM deoxyribonucleotide triphosphates (0.15 µL), 10x RT buffer (1.5 µL), ribonuclease inhibitor (0.75 µL), and reverse transcription enzyme (1 µL). Prepare enough amount of mixtures based on the total number of reactions.\nAdd 3 µL of 5x RT primers for a specific miRNA in each reaction (Figure 2B).\nNOTE: Total volume is 15 µL for each reaction.\nRun the tubes using a thermal cycler. Start at 16 °C for 30 min followed by the reaction at 42 °C for 30 min, and finally at 85 °C for 5 min. Hold at 4 °C for any remaining time (Figure 2B). Single-stranded cDNAs are generated in this step for both a specific miRNA and GAPDH gene in the same tube.\nReal-time polymerase chain reaction (PCR) and data analysis\nDilute each cDNA with ultrapure water at 1:49 ratio.\nPrepare the reaction mixtures for a specific miRNA and GAPDH (Table 1). For the detection of a specific miRNA and GAPDH, set up triplicate reactions for each cDNA sample.\nPerform the real-time PCR and data analysis (Figure 2C). Analyze data using the comparative CT method13,14.\n2. MicroRNA (miRNA) MimicTransfection\nNOTE: miRNA-107 is selected from step 1. Since miRNA-107 is down-regulated in tumor cells compared with normal cells, it can be speculated that miRNA-107 is a tumor suppressive miRNA. In the case of a miRNA which is up-regulated in tumor cells compared with normal cells (e.g., miRNA-301), antisense oligonucleotides against miRNA-301 can be applied for steps 2, 3, and 4.",
    "Count the cells with a counting-chamber device and plate the cells in a 96-well plate. Cell density is 2 x 103 cells/100 µL for each well. Do not use cell culture media containing penicillin-streptomycin (P/S) because P/S can reduce the transfection efficiency.\nPrepare a set of transfection mixtures to transfect the cells at several final concentrations of miRNA control mimic and miRNA-107 mimic on the next day (Figure 3).\nFrom the stock (25 μM concentration) of miRNA control mimic or miRNA-107 mimic, dilute and add corresponding amount of control mimic or miRNA-107 mimic in the reduced-serum media along with a transfection reagent using microcentrifuge tubes (Figure 3A). Gently mix the oligo containing mixtures using a micropipette. The total amount of oligos (miRNA mimic control + miRNA-107 mimic) should be same in each well. Blank wells include 100 µL of cell culture media and reduced-serum media containing a transfection reagent without cells.\nAfter a 10 min incubation in a cell culture hood, gently mix the oligo containing mixtures again and then add 50 μL of the mixtures into each well. Keep the transfected cells in a cell culture incubator. Replace the transfection reagent containing media with the fresh cell culture media containing both fetal bovine serum (FBS) and P/S after 6-12 h incubation. Further incubate the cells for 72 h. The total treatment duration of miRNA mimic is 96 h.\n3. Sulforhodamine B (SRB) Assay\nCell fixation\nRemove the cell culture media in each well of the plate and promptly fill 100 μL of 10% trichloroacetic acid (TCA) into each well. Carefully aspirate the cell culture media from each well to avoid any cell damage and detachment from the bottom.",
    "NOTE: Prepare 40% TCA by adding 20 g of TCA powder into 50 mL of distilled water. From 40% TCA, make 10% TCA by diluting 40% TCA with distilled water at a 1:3 dilution ratio.\nKeep the plate containing 10% TCA in a refrigerator (4 °C) for 1 h.\nWash the plate several times by submerging into the water tub and dry it. Remove excess water from inside of wells by tapping the plate until there is no water left in wells. Leave the plate on a laboratory bench to dry it before going to the next step.\nCell staining\nPipette 50 μL of 0.4% SRB solution into each well including blank wells. Gently shake the plate until 0.4% SRB solution consistently covers the bottom of wells.\nNOTE: Prepare and use 0.4% SRB solution by adding 0.4 g of SRB powder into 100 mL of 1% acetic acid. Shake the solution carefully to mix it. Wrap the bottle of 0.4% SRB solution in a light protective material such as aluminum foil. Store 0.4% SRB solution in a refrigerator.\nAfter incubation for 40 min to 60 min, wash the plate by rinsing it with 1% acetic acid. Wash the plate until the unbound dye is totally washed away (Figure 3B).\nLeave the plate on a laboratory bench to dry it before going to the next step.\nNOTE: The plate should be entirely dried before going to step 3.3.\nAbsorbance measurement\nPipette 100 μL of Tris base solution (10 mM) into the corresponding wells including blank wells. Keep the plate on a shaker for 10 min. Measure the absorbance at 492 nm.\n4. Generation of a Dose-response Curve",
    "Analyze the SRB assay data in a spreadsheet. Subtract the blank absorbance from the absorbance values of each group and calculate the average (AVE) and standard deviation (STD) of absorbance values of each group.\nCalculate the percentage of average absorbance (AVE%) and that of standard deviation (STD%) of each group using absorbance values of the SRB assay.\nNOTE: The AVE% of miRNA control mimic treated group is 100%. Calculate the STD% using the following formula: STD% = (STD of each group / AVE absorbance of control mimic treated group) x 100.\nImport the raw data including treatment concentrations, AVE%, and STD% into the software by vertically aligning those data. Since Log 0 is not defined, set the first concentration of X axis to a value that is close to 0 (e.g., 0.01).\nClick Create graph tab and choose Simple scatter-error bars. Select Worksheet columns as symbol values and click Next. In the data format panel, select XY pairs and click Next. Select corresponding data columns in the select data panel. Click Finish button to create the plot.\nNOTE: The X axis represents the concentrations, the Y axis indicates the percentage of average absorbance of each concentration (AVE%), and the error bars point out the percentage of standard deviation of each concentration (STD%).\nDouble-click on the X axis to modify the type of scale and the scaling of axis. Change the type of scale from linear to log. Modify the start and end range number to 0.01 and 200, respectively.\nRight-click on any scatter plot, choose Curve fit, and go to the sub-category User- defined. Select Dose-response curve, click Next buttons, and then click Finish button. The dose-response curve is now generated along with a report tab (Figure 4A).",
    "To input Equation 1 in the software for the generation of a dose-response curve, click the Analysis tab and select Regression wizard. Go to User-defined in the equation category and then click the New button. Insert Equation 1, variables, initial parameters, and constraints into the corresponding blank boxes (Figure 4B, C). Click Add as button and set the name of the equation as Dose-response curve. The equation name is now generated in the sub-category User-defined in the equation category. f indicates the percentage of cell viability (% cell viability) in Equation 1.\nEquation 1\nimgsrc://cloudfront.jove.com/files/ftp_upload/59628/59628eq1.jpg\nGo to the report tab and then check the n, k, and R values.\nNOTE: y0 indicates 100% cell viability of miRNA control mimic treated group, n indicates the Hill-type coefficient (the slope of a plot), k indicates the concentration of miRNA-107 mimic that produces a 50% of the miRNA-107 mimic’s maximum effect (the half maximal inhibitory concentration, IC50), and R indicates the residual unaffected fraction (the resistance fraction)15. The equation used to generate a dose-response curve recognizes the range from y0 to R value (if any) as 100% (Figure 4A). Therefore, it is necessary to acquire the adjusted k (IC50) value that is calculated based on the range from y0 to a value of zero (Figure 4A). Adjusted k (IC50) along with other ICx values (e.g., IC10 through IC90) can be obtained using Equation 2, which is derived from Equation 1. The derivation of Equation 2 from Equation 1 is indicated in Supplementary Figure 1.\nEquation 2\nimgsrc://cloudfront.jove.com/files/ftp_upload/59628/59628eq2.jpg\nDouble-click the left mouse button on the cell in which Equation 2 is applied. Using Equation 2 and parameters from the generated dose-response curve, it is available to calculate the adjusted values of ICx, ranging from IC10 to IC90 (Figure 4D).",
    "Input the equal sign followed by the formula beginning with a bracket in the cell. When entering the formula, fix the value of n, k, and R as the absolute cell references by adding the dollar sign to the corresponding column and row, so that these fixed values will not be changed when auto-filling the formula down to the rows (Figure 4D). Alternatively, adjusted values can be manually calculated using Equation 2.\nNOTE: IC90 value is not determined because the R value is greater than 10. In addition, if R value is above 20, the value of IC80 is also not determined (Figure 4D).\n5. Verification of the Direct Target Gene of a MicroRNA of Interest\nNOTE: After performing the functional experiment such as the SRB assay, miRNA-107 is confirmed as a tumor suppressive miRNA and it is highly feasible that miRNA-107 directly targets oncogenes. Check the list of all predicted target genes using a miRNA target prediction program such as TargetScan (http://www.targetscan.org/vert_71/), and then narrow down to potential candidate targets based on the function of a gene in databases including PubMed and GeneCards.\nPrimer design for the cloning of 3’ untranslated region (UTR)\nPut the name of a gene in GeneCards (https://www.genecards.org/) and click Symbol of a gene. Assess to Ensembl genome browser by clicking Ensembl ID of a gene and then click Transcripts ID in the transcript table. After that, click Exons existed in the Transcript-based displays list on the left.\nCopy the nucleotide sequences of the 3’ UTR and paste it into the primer design program. Copy the sequences again from this program and paste it into a word processor. Check the presence of miRNA binding sequences as well as the presence of restriction enzymes sites used for the cloning.",
    "NOTE: If there are no restriction enzyme recognition sites within the 3’ UTR, the restriction enzymes selected for the cloning can be used for the next step.\nIn the primer design program, accept the 3’ UTR sequences and start to design the forward and reverse primers with the following condition. Length: 20-30 nucleotides, Tm: 45-58 °C, GC%: 40-60%. The difference between the Tm values of the two primers should be less than 5 °C. The primer sequences used in this study are provided in Supplementary Figure 2. Add restriction enzyme recognition sequences as well as 4 random nucleotides to the designed primers.\nGradient PCR\nPrepare 25 µL of PCR reaction mixtures including designed primers per one annealing temperature (Table 2). Prepare enough amount of mixtures based on the total number of reactions. Mix the solution by pipetting and add 25 µL of reaction mixtures into each tube. Centrifuge the tubes for few seconds.\nPerform 35-40 PCR cycles from denaturation step to extension step. Set up the PCR cycle as the following steps: 98 °C for 1 min (1 cycle, polymerase activation step), 95 °C for 10 s (denaturation step), 45 °C-68 °C for 30 s (annealing step), 68 °C (extension step, 10 s-1 min per 1000 bp), 68 °C for 3 min (termination step), and finally cool down to 4 °C.\nRun the PCR products and check bands on a 1% agarose gel with DNA ladders. Find the best annealing temperature (Figure 5A). Amplify 3’ UTR of a gene again using the best annealing temperature for the next step.\nDouble digestion\nMake the reaction mixtures including two restriction enzymes, XhoI (or AsiSI) and NotI, in a tube (Table 3). Incubate the mixtures for 3-4 h using a water bath (37 °C).",
    "Run the double digested products on a 1% agarose gel and then cut the bands under UV light. In the case of luciferase vectors, before running on a gel, react double digested vectors with 10 U of alkaline phosphatases for another 1 h to prevent a recircularization during the ligation step.\nPurify the double digested PCR products and luciferase vectors from the excised bands.\nLigation of PCR products into the luciferase vectors\nMake 20 μL of ligation reaction mixtures including the DNA ligase (Table 4).\nNOTE: The molar ratio of PCR product (insert) to luciferase vector can be 3:1. 1:1 or 2:1.\nBriefly centrifuge the tube for 10-15 s and incubate at 16 °C overnight using a thermal cycler.\nNOTE: Alternatively, the tube can be incubated at 4 °C for 2-3 days for the ligation. In this step, the PCR insert will be cloned into the region positioned downstream of a renilla reporter gene (Figure 5B). Binding of miRNAs into the cloned 3’ UTR of a gene can decrease in the renilla activity. Firefly luciferase is for the normalization of renilla expression levels.\nTransformation and colony PCR\nAdd the ligation mixtures (3-5 μL) into the tube containing competent cells. Gently tap the tube and keep it on ice (20 min).\n\t\tNOTE: Unfreeze competent cells on ice before adding the ligation mixtures.\nQuickly and gently transfer the tube to a heat block. Following a heat-shock (42 °C for 30 s-1 min), place the tube on ice for 20 min.\nSpread competent cells on the Luria-Bertani (LB) agar plate. Grow competent cells in an incubator (37 °C) overnight.\nNOTE: Ampicillin (50-100 µg/mL) is contained in the agar plate.",
    "Pick an individual colony and resuspend E. coli in one of the 8-strip tubes containing ultrapure water. Repeat this step to resuspend E. coli from randomly selected 4-8 colonies (Figure 5C).\nTransfer 25 μL of E. coli suspension into another set of 8-strip tubes. Now, there are 2 sets of tubes of E. coli suspension.\nNOTE: One tube is for colony PCR and another one is for inoculation. E. coli suspension for inoculation can be temporarily stored at 4 °C (Figure 5C).\nPerform the colony PCR using E. coli suspension. This step is to determine if the colonies contain an insert. Select the best colonies to inoculate and isolate luciferase vectors harboring 3’ UTR of a gene (Figure 5C).\nNOTE: Repeat step 5.1-5.5 for each 3’ UTR of selected genes. Follow the condition of PCR reaction shown in Table 2 by replacing the genomic DNA with E. coli suspension.\nLuciferase assay\nPrepare a 24-well plate. Use 1-2 x 104 cells in 500 μL cell culture media for each well. Do not use cell culture media containing P/S for the transfection because using P/S can reduce the transfection efficiency.\nTransfect 50 ng of luciferase vectors into the cells with control mimic or a specific miRNA mimic using a transfection reagent (Figure 5D). If screening the effects of a specific miRNA mimic at more than one concentration, keep the total amount of oligos same in each well (see step 2).\nWash the inside of wells twice using phosphate buffered saline (PBS) on the next day.\nApply 200 μL of lysis reagent into the wells and sufficiently carry out cell lysis before measuring the luciferase activity.\nNOTE: Keep the plate on a shaking plate at least 15 min.",
    "Transfer 5-10 μL of cell lysate into the new tube and add 100 μL of reagent I. Immediately mix the solution by pipetting and read the firefly luciferase activity using a luminometer.\nNOTE: Read the firefly luciferase activity for 10-15 s.\nAdd 100 μL of reagent II in the same tube, and then mix by pipetting twice. Read the renilla luciferase activity for 10-15 s using a luminometer. Repeat step 5.6.5 and 5.6.6 for each sample.\nCalculate the ratio of renilla to firefly (Figure 5E).\nNOTE: The activity of firefly represents the transfection efficiency of luciferase constructs into the cells.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}