{
  "id": 17817,
  "origin_website": "Jove",
  "title": "Echocardiographic Assessment of Cardiac Anatomy and Function in Adult Rats",
  "procedures": [
    "All animal procedures were performed according to Directive 2010/63/EU. The procedures were approved by the institutional Animal Welfare Body, licensed by DGAV, the Portuguese competent authority for animal protection (license number 0421/000/000/2018).\nNOTE: Female Wistar Han IGS (Crl:WI(Han) from Charles River Laboratories (12-16 weeks-old) were used. This protocol is specific for rats independently of their strain, age or gender.\n1. Preparing Rats for Echocardiography: Anesthesia and Reversion Protocol\nWeigh rats.\nPrepare a three-component anesthetic composed by midazolam (4.76 mg/kg), medetomidine (0.356 mg/kg) and fentanyl (0.012 mg/kg), according to rat weight.\nInject anesthesia intraperitoneally. Check for the absence of pedal withdrawal reflexes to evaluate the depth of anesthesia.\nShave the hair from the torso area.\nApply durable gel to both eyes to prevent drying of the sclera.\nPlace the anesthetized rat in a supine position atop a heating pad in order to maintain body temperature (37.0 °C ± 0.5 °C).\nApply a layer of preheated (close to body temperature) ultrasound gel to the chest, mainly in the area overlying the heart. Avoid air bubbles in the gel that can interfere with ultrasonic imaging.\nReverse anesthesia through subcutaneous injection using atipamezole (0.94 mg/kg) and flumazenil (0.2532 mg/kg), immediately after the end of the echocardiography.\n\tNOTE: This anesthetic combination provides up to 45 min for echocardiography imaging. The echocardiographic protocol described below is compatible with any other anesthesia protocol.\n2. Echocardiography",
    "NOTE: The echocardiograms are performed with a conventional clinical echocardiographic equipment, with a 12 MHz cardiac probe, and include acquired still images and loops in parasternal (long axis and short axis views), apical (4, 5, 2 and 3 chambers) and suprasternal views. An electrocardiogram is recorded to identify end-systole and end-diastole, for measurement procedures and loop acquisition (ECG triggered)11,12. A preset is used to keep image definition stable between rats: frequency 5-10 MHz, depth 2.5 cm, frame rate 125 fps, Doppler sample 1.0 mm and color Doppler aliasing velocity 40 cm/s. Loops were recorded with at least 3 heart beats.\nLeft parasternal long axis view\n\tNOTE: Position the probe on the left side of the sternum and the index mark turned to the right shoulder.\n\t\nRecord M-mode images at the aortic valve, mitral valve leaflets and left ventricular mid-cavity (cursor at mitral valve tips or cordal level)1,2,3,4. The M-Mode cursor should be perpendicular to the structure of interest1,3,10.\nRecord a 2D loop of all views.\nRecord a 2D loop with zoom at the left ventricular outflow tract.\nRecord a 2D loop with color Doppler imaging simultaneously at the aortic and mitral valves.\nLeft parasternal short-axis view\n\tNOTE: Place the probe on the left side of the sternum with the index mark rotated to the left shoulder.\n\t\nObtain an image at the aortic valve level by tilting the probe slightly cranially.\nRecord a 2D loop of all views.\nRecord a 2D loop with color Doppler imaging simultaneously at the aortic and pulmonary valves.\nAcquire a spectral pulsed Doppler image at the pulmonary artery. The cursor should be parallel to flow1,3.\nObtain an image of the left ventricle at the papillary muscle level by tilting the probe slightly downward.\nRecord a 2D loop of all views.\nApical 4-chamber view",
    "NOTE: Position the probe at the apical area in the anterior axillary line and with the index mark turned to left shoulder.\n\t\nRecord a 2D loop of all views.\nRecord a loop of 2D and tissue Doppler imaging including all 4 chambers.\nFocus on the left cardiac chambers.\n\t\t\nRecord a 2D loop with zoom at the left atrium.\nRecord a 2D loop with color Doppler imaging at the mitral valve and left atrium.\nRecord simultaneous M-mode and color Doppler images for left ventricular propagation flow.\nGet a spectral pulsed wave (PW) Doppler at the mitral valve for left ventricular inflow. Place the sample at the mitral leaflet tips, in their fully open diastolic position1,2,3,11,12.\nAdd a continuous wave (CW) Doppler image at the mitral valve, if there is mitral valve regurgitation.\nObtain a spectral pulsed tissue Doppler image at the mitral annulus (left ventricular lateral and septal walls). Align the PW Doppler cursor with the long axis of the heart in order to produce the maximum Doppler signal1,2,3,13.\nRecord M-mode of mitral annulus for mitral annular plane systolic excursion measurement (cursor at lateral left ventricle wall).\nFocus on right cardiac chambers.\n\t\t\nRecord a 2D loop with zoom at the right atrium.\nRecord a 2D loop with color Doppler imaging at the tricuspid valve and the right atrium.\nObtain a spectral pulsed tissue Doppler image at the tricuspid annulus (right ventricular wall).\nRecord M-mode for tricuspid annular plane systolic excursion (TAPSE) by placing the 2D cursor at the tricuspid lateral annulus.\nApical 5-chamber view\n\tNOTE: From the 4-chamber view, tilt the probe slightly anterior to the chest.\n\t\nRecord a 2D loop of all views.\nRecord a 2D loop with color Doppler imaging at the aortic valve and left ventricular outflow tract.",
    "Get a spectral pulsed wave Doppler image at the left ventricular outflow tract. Place the cursor parallel to the flow and place the sample at the left ventricular outflow tract4,14.\nGet a spectral pulsed wave Doppler image at the left ventricle mid-cavity for simultaneous left ventricular inflow and outflow waves.\nObtain a spectral continuous wave Doppler image at aortic valve. Transvalvular flow is recorded below baseline and regurgitation, if present, above baseline.\nApical 2-chamber view\n\tNOTE: Return to a 4-chamber view and rotate the probe 90° counterclockwise.\n\t\nRecord a 2D loop of all views.\nRecord a 2D loop with color Doppler imaging at the mitral valve.\nApical 3-chamber view\n\tNOTE: Tilt the probe slightly cranially.\n\t\nRecord a 2D loop of all views.\nRecord a 2D loop with color Doppler simultaneously at the aortic and mitral valves.\nSuprasternal window\n\tNOTE On the left side of supraclavicular space with probe directed downward\n\t\nRecord a 2D loop of the aortic arch.\nGet spectral pulsed wave Doppler image at the ascending aorta.\nGet spectral pulsed wave Doppler image at the descending aorta.\n3. Measurements\nProceed to measurements, including global longitudinal strain. Perform these measurements offline in order to reduce the anesthesia time."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}