{
  "id": 17616,
  "origin_website": "Jove",
  "title": "Real-Time Magnetic Resonance Guided Focused Ultrasound for Painful Bone Metastases",
  "procedures": [
    "Taipei Medical University Joint Institutional Review Board approval was obtained for this study.\nNOTE: The same protocol, validated in Kao et al.11, has been used to treat 138 cases between 2015 and 2019. The inclusion criteria for treatment enrollment were 1) the presence of a solitary distinguishable painful bone metastasis; 2) no administration of previous local therapy to the targeted bone lesion; and 3) the ability to access the targeted bone lesion with MRgFUS (Table of Materials). Patients with impending pathological fractures were excluded. Detailed materials and devices are listed in the Table of Materials.\n1. Pretreatment consultation and CT-simulation for treatment spot\nEvaluation of patients indicated for MRgFUS\n\t\nAssess patient suitability for MRgFUS in treating metastatic bone pain. Explain the procedure and related information to the patient and family. Record daily analgesic medication and pain score before and after medication.\nHave a radiation oncologist and radiologist locate the lesion and nearby anatomy based on pretreatment computed tomography (CT) or magnetic resonance imaging (MRI) scans.\n\t\tNOTE: Spinal metastasis is excluded because of possible injury to the spinal cord or cauda equina. Lesions in the trunk should be treated dorsally rather than ventrally in order to prevent injury to major vessels and organs.\nConfirm the treatment spot by CT simulation 1 day before MRgFUS.\n\t\nPosition the patient in a supine, head-first position on the couch and perform a helical CT scan (120 kV, 400 mAs/slice) over the treating area with a 3 mm slice thickness. Adjust and tilt the patient's position, in the center of the couch, to locate the lesion.",
    "Place a CT marker, 1 cm lead wire, on the skin surface, vertically closest to the lesion, and conduct a helical CT scan (120 kV, 400 mAs/slice) again to confirm the position of the patient and the location of the CT marker. Mark the location of the CT marker with a marker pen and take a picture of the patient's position.\n\t\tNOTE: Precise confirmation of the treatment spot and position before MRgFUS can facilitate the positioning process during MRgFUS.\n2. Patient preparation for MRgFUS on treatment day\nVerify the patient's identity according to photo identification. Verify that the patient removed all metal objects and magnetic devices prior to the scan.\nPrescribe local and systemic analgesics before treatment.\n\t\nAt 1 h before the scheduled treatment time, apply lidocaine cream on the marked skin, with a radius of 10 cm. Remove the cream carefully 10 min before treatment.\nAt 30 min before treatment, intravenously drip 5 mg of dexamethasone with 50 mL of normal saline for 10 min and 30 mg of ketorolac with 50 mL of normal saline for 10 min. Set the peripheral intravenous line on either hand, forearm, leg, or foot on the side opposite to the lesion.\nCheck the patient's vital signs (heart rate, blood pressure, respiratory rate, and blood saturation) 5 min before sending the patient out for treatment.\n3. Daily quality assurance (DQA) before MRgFUS\nDQA setup\n\t\nReplace the diagnostic couch with the MRgFUS couch with a focused ultrasound transducer and connect the couch to the system.\n\t\tNOTE: The staff must remove all metal objects and electric devices, including rings, watches, pens, mobile phones, or magnetic ID cards, before entering the MRI room.\nApply ultrasound transmission gel (~1 mm thickness) and degassed water on the surface panel of the focused ultrasound transducer.",
    "NOTE: Be careful not to scratch the plastic panel during this process.\nCarefully cover the panel with plastic drape, avoiding any folds of the drape over the panel area. Add degassed water to a level as high as the MR coil on the couch.\n\t\tNOTE: Be careful not to make any gas bubbles between the panel, transmission gel, the drape, and degassed water.\nSlowly and carefully place the gel pad on the panel without creating any gas bubbles during the process. Place the DQA phantom on the gel pad without creating any gas bubbles.\nPlace the MR coil on the couch and connect the coil to the MRI device. Press Landmark on the MRI control panel and align the red laser to the black stripe on the coil. Then, press Advanced to Scan on the MRI control panel.\nDQA prescan\n\t\nClick Idle on the MRI system to create a new MR scan. Enter DQA as patient's name and enter 50 kg for body weight. Choose Supine and Feet First as scanning parameters.\nChoose scanning protocol as ExAblate - Plan - Bone. Then click Save Series | Download | Scan. Check scanning images on the monitor to check for any gas bubbles.\n\t\tNOTE: If any gas bubbles are found, set up the DQA once more to remove them.\nDQA procedure\n\t\nClick Bone Tumors on the MRgFUS system and click Calibrate to start the DQA. Click MR Scan and confirm that the exam number is the same as in the MRI system.\nAdjust the position of the transducer in the axial and sagittal images in order to let the sonication field cover the phantom. Click Load to load MRI images. Then click Sag | Select All to select all images. Click Ax | Select All again.",
    "Click Draw to define the sonication area. Click Skin Line to contour the surface between the phantom and gel pad. Click Copy to copy the skin lines to all sagittal and axial slices of images. Then adjust and confirm the skin line is correct in each image.\nClick Treating Area to contour the treatment area in the phantom for three continuous slices. Click Protocol to choose Bone 15 and then click Apply. Click Fiducial and choose a spot in the phantom as a reference point.\nDQA planning\n\t\nClick Plan | Verify to proceed. Click Add Sonication to add one spot for sonication within the phantom. Confirm that the sonication field is within the phantom in each sagittal and axial slice.\nSet the scan parameters: direction = Coronal and number slice = 5 with preset energy output. Click Sonication to start.\nCalibration\n\t\nAfter sonication, monitoring the MRgFUS system shows the temperature images. Confirm the heating spot and click Center to mark the spot. Use the mouse to check the heating spot and other, different spots to compare the thermal curve to locate artifacts or background signals.\nThe system shows adjustments for transducer location in millimeters in 3 axials. Click Accept and then click Back to perform the sonication again with a 20% increase in energy. Confirm that the 2nd adjustment is within 1 mm and click Reject.\nSet scan parameter: direction = Axial and number slice = 5 with preset energy output. Make axial adjustments as described in steps 3.5.1 and 3.5.2. Click Exit to leave DQA and remove the phantom.\n4. Patient positioning and pretreatment MR scanning\nPatient positioning\n\t\nPosition the patient on the MRgFUS couch in the same position as the previous simulation in step 1.2. Align the mark on the skin with the center of the gel pad.",
    "Secure the patient to the couch using a safety belt and teach the patient how to use the emergency button. Set the finger pulse oximeter on one index finger.\nPlace the MR coil on the couch and align the coil. Then press Advanced to Scan on the MRI control panel.\nPretreatment MR scanning\n\t\nCreate a new MR scan and enter the patient's information. Choose Supine and Feet First as the scanning parameters and the scanning protocol as ExAblate - Plan - Bone.\nAcquire three-plane T2 images, then click View Edit to confirm the scanning area. Click Save | Download | Auto PreScan. Confirm the scanning area after prescan and then click Scan.\nConfirm the lesion and patient position.\n\t\nReconfirm the lesion, MR scanning field, and patient position.\n\t\tNOTE: The MR scanning field should be over the treatment area and cover the ultrasound transducer.\nExamine any gas bubbles between skin surface and gel pad. Reposition the patient if any gas bubbles are present.\n5. Treatment contouring and planning\nImport MR images\n\t\nClick Bone Tumors on the MRgFUS system. Click Contouring | MR scan and confirm that the exam number is the same as in the MRI system.\nClick Load to load MRI images collected in step 4.2. Click Sag | Select All. Then click Ax | Select All again.\nContouring\n\t\nClick Draw to define the sonication area. Click Skin Line to contour the skin surface. Click Copy to copy the skin lines to all sagittal and axial slices of the images. Adjust and confirm that the skin line is correct in each image.\n\t\tNOTE: The skin line must be contoured on each MR image slice with the ultrasound transducer.",
    "Click Bone to contour the bone surface. Click Block to contour vital organs, such as nerves, vessels, or bowels, to prevent sonication through these areas. Click Fiducial and choose a spot near the lesion as a reference point.\nPlanning\n\t\nClick Plan | Verify to proceed after all contouring is completed. Review treatment planning and adjust the sonication if needed.\n\t\tNOTE: The pathway of sonication should be from the transducer to the lesion through the skin surface.\n6. Verification and treatment\nAnalgesics and sedation\n\t\nAt 10 min before verification and treatment, intravenously drip 25 mg of meperidine and 7.5 mg of midazolam with 50 mL of normal saline for 10 min.\nIntravenously drip 7.5 mg of morphine with 50 mL of normal saline for 10 min at an interval of 30 min if the patient complains of pain during the treatment course.\n\t\tNOTE: A physician may adjust analgesics and sedation medication according to clinical conditions.\nPeriodically check the pulse and oximeter between sonication.\n\t\tNOTE: If the patient is very nervous or requires accompaniment, a nurse or staff member may stay inside during sonication. MR and ultrasound do not cause radiation nor harm to other personnel nearby.\nVerification\n\t\nChoose one sonication with preset parameters and click Sonication to start. Monitor the temperature rise and thermal curve of the heating spot as well as the reference spot to check for artifacts or background signals. Increase the energy output and repeat the sonication to the same spot.\nRepeat the sonication to the same spot until the temperature is over 65 °C to reach thermal ablation.\n\t\tNOTE: Different people with different body mass, different locations, and different tissues would have various energy absorptions and thermal changes. Using lower energy for verification is necessary.",
    "NOTE: Repeatedly heating the same spot or a nearby area in a short time may influence MR thermometry. Therefore, allow the system to pause if the sonication intervals are too close.\nTreatment\n\t\nClick Sonication to start the treatment with the verified energy output described in step 6.2.\nMonitor the temperature rise and thermal curve of the heating spot and repeat the sonication with increasing energy output until the temperature is over 65 °C. Complete all sonication for the treatment area.\n7. Post-treatment evaluation\nPost-treatment MR scanning\n\t\nConduct post-MRgFUS scanning with all series as in steps 4.2 and 4.3.\nInject intravenous contrast medium at a rate of 4−5 mL/s and conduct a contrasted MR scanning as step 7.1.1.\n\t\tNOTE: The volume of contrast is based on body weight (i.e., 0.2 mL per 1 kg).\nEvaluate treatment/thermal effect from post-treatment MRI. Repeat the sonication if the thermal ablation does not treat the whole lesion.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}