{
  "id": 8838,
  "origin_website": "Jove",
  "title": "In Vivo Electrophysiological Measurement of the Rat Ulnar Nerve with Axonal Excitability Testing",
  "procedures": [
    "All experimental procedures described here complied with the Animal Care and Ethics Committee of UNSW Sydney and were performed in accordance with the National Health and Medical Research Council (NHMRC) of Australia regulations for animal experimentation.\n1. Experimental Set Up\nNOTE: 12 week old, female Long-Evans rats were used in this procedure.\nAnesthetize the rat in an induction chamber using 4% isoflurane and 1 L per min O2 flow rate. Confirm sufficient anesthesia by testing for the righting reflex and ensure its absence before removing the animal from the induction chamber. Note that various anesthetic agents have differential effects on nerve excitability10.\nSecurely place the animal's snout in the nose cone attachment and deliver a maintenance dose of 2.5% isoflurane and 1 L per min O2 flow rate.\nConfirm adequate anesthesia by checking for both pedal withdrawal and corneal reflexes by pinching the animal's toes and gently touching its eye.\n\tNOTE: Application of vet ointment on eyes, to prevent dryness while under anesthesia, is recommended but not essential as the procedure typically takes 30 min per animal.\nMaintain the body temperature of the rat at 37 °C with the use of a feedback controlled heating mat and a rectal thermometer probe. Set the heating mat and integrated body temperature sensor to 40 °C to prevent any skin damage that occurs with higher temperatures.\n\tNOTE: It is recommended to monitor and record physiological measures (heart rate, oxygen saturation, body temperature and respiratory rate) every 10s with the use of an animal physiological monitoring system. Optimal recording procedures should include local measurement of the limb temperature as the peripheral temperature can be colder than that of the core temperature11 (Figure 1).",
    "Wear antiseptic gloves and always use instruments that have been cleaned with 70% ethanol, to maintain a pathogen-free environment throughout the procedure.\n2. Electrophysiological Set Up\nUse low impedance platinum electroencephalogram (EEG) needle electrodes for this procedure.\nPrepare the recording needle electrodes by inserting the recording needle electrode (Figure 1; indicated in purple) through the hypothenar muscle and the reference electrode through the dorsal aspect of the 4th digit (Figure 1; indicated in orange) to record compound muscle action potentials (CMAPs).\nPlace the ground electrode through the skin on the superior aspect of the forearm between stimulating and recording electrodes (Figure 1; indicated in green). Take care when inserting the electrodes to avoid muscle tissue.\nPrepare the percutaneous stimulating needle electrodes by inserting the cathode (Figure 1; labelled in blue) approximately 4 mm distal to the cubital tunnel at the elbow. Insert the anode (Figure 1; labelled in red) approximately 1 cm proximally through the skin of the axillar region.\nimgsrc://cloudfront.jove.com/files/ftp_upload/56102/56102fig1.jpg\nFigure 1: A schematic diagram of the needle electrode placements in the rat forelimb. The cathode (blue) is inserted approximately 4 mm distal to the cubital tunnel at the elbow and the anode (red) is inserted approximately 1 cm proximally through the skin of the axillar region. The ground needle electrode (green) is inserted through the skin on the superior aspect of the forearm between stimulating and recording electrodes. The recording (purple) and reference (orange) needle electrodes are inserted through the hypothenar muscle and through the dorsal aspect of the 4th digit. The temperature probe (grey) is placed on the superior aspect of the thenar muscle. Please click here to view a larger version of this figure.[href=https://www.jove.com//cloudfront.jove.com/files/ftp_upload/56102/56102fig1large.jpg]\n3. Axonal Excitability Procedures",
    "Perform the rodent motor nerve TRONDNF protocol using a semi-automated, computer controlled axonal excitability program (see the Table of Materials) linked to a constant current stimulator and an amplifier. Remove excess 50 Hz electrical noise using a 50/60 Hz noise eliminator.\n\t\nRecord the CMAP from the hypothenar muscle by simultaneously visualizing the CMAP morphology and applying a 1 ms square-wave pulse to the ulnar nerve with the cathode needle electrode.\n\t\t\nTo achieve optimal recordings, carefully adjust the angle and/or position of the cathode until an optimal biphasic response curve with constant amplitude is achieved (Figure 2A.). Once the optimal position has been determined, stabilize the cathode with a repositionable electrode holder.\n\t\t\tNOTE: The software used automatically delivers the test stimuli, described below, and increases or decreases the current required to achieve the threshold.\nRecord a stimulus-response curve by incrementally increasing the stimulus intensity of a 1 ms impulse by 1 mA until a maximum response is achieved.\n\t\tNOTE: The purple and green line in figure 2B and 2C represents the incremental increase of the stimulus intensity and the automated system respectively. The target amplitude for threshold tracking is automatically set to 40% of the maximal amplitude corresponding to the area of the steepest slope on the stimulus-response curve. The change in 'threshold' (i.e. stimulus required to elicit 40% CMAP) induced by various test stimuli is the variable of obtained throughout the remainder of the protocol.\nRecord multiple axonal excitability parameters, including threshold electrotonus (TE), current-threshold (I/V) relationship and recovery cycle (RC) as described in reference12.",
    "NOTE: The computer controlled axonal excitability program assesses the threshold (TE) with a 100 ms subthreshold depolarizing and hyperpolarizing currents that is set at ±20% and ±40% of the control threshold current. The change in threshold after both depolarizing and hyperpolarizing currents is automatically recorded at 14 time-points during the 100 ms polarizing current and 12 points after the polarizing current. Threshold electrotonus indirectly assesses the internodal conductances and is a marker of membrane potential. The I/V relationship is assessed with 200 ms subthreshold conditioning currents that alternate in intensity from +50% to -100% of the control threshold in 10% increments. The I/V relationship differs to TE in that the currents are longer in duration, the intensity of polarization is progressively altered from +50% to -100% and the threshold change is assessed at each intensity 1 ms after the polarizing current has ceased. The I/V relationship provides insight into the rectifying properties of the axon1. The RC is assessed with a paired pulse paradigm, where an initial supramaximal conditioning stimulus is applied followed by a series of test stimuli at specific intervals from 2.5 ms to 200 ms. This parameter tests a well-defined series of events that occur in the nodal region of the axon following supramaximal stimulation. These events include, the inactivation of voltage-gated Na+ channels which makes it more difficult to elicit a subsequent response and is quantified by refractoriness and the relative refractory period 1. This is followed by a charging of the internode and a period of heightened excitability mediated by fast potassium channels, quantified by superexcitability. Finally, slowly activating potassium channels mediate a late period of reduced excitability, quantified as subexcitability.\nimgsrc://cloudfront.jove.com/files/ftp_upload/56102/56102fig2.jpg",
    "Figure 2: Raw data from an axonal excitability test. Panel A demonstrates abiphasic CMAP response curve after incremental increase of stimulation to the ulnar nerve. Panels B and C represent the stimulus intensity (mA) and amplitude of CMAP (mV), respectively. The green component of B and C depicts the automated incremental decrease in stimulus intensity and the associated sigmoid shaped decrease in CMAP required for threshold tracking.\n4. Post Electrophysiology Procedures\nTransfer the rat to a separate cage until it has regained sufficient consciousness to maintain sternal recumbency. Do not leave an animal unattended and in company of other animals until it has fully recovered from the anesthesia. Once the rat has fully recovered from the anesthesia, transfer it back into its original cage.\nAt completion of the study, euthanize the rat without pain for the animal, e.g. lethal intraperitoneal injection of a barbiturate (e.g. lethabarb).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}