{
  "id": 12699,
  "origin_website": "Jove",
  "title": "A Protocol of Manual Tests to Measure Sensation and Pain in Humans",
  "procedures": [
    "All tests with human subjects should be approved by the Institutional Review Board at the individual institution. All testing described for the current study was approved by the Duquesne University Institutional Review Board for human subject research. Training for and descriptions of each measure are as follows:\n1. Cutaneous Mechanical Sensitivity Assay13\nNOTE: Enrolled participants are asked to sit in a chair, with support provided for the extremity to be tested. The assay involves determining the sensitivity threshold for innocuous cutaneous stimulation. Stimulation is provided with standard sensory evaluator von Frey filaments (see the equipment section). These small nylon filaments each apply a single force (ranging from 0.078 mN (0.008 g) to 4.08 mN (1.0 g)).\nBefore the start of the first experimental trial, allow the participant to feel and manipulate the filaments. Give the filament to the participant and let them gently bend it against the skin of their hand.\nDuring each trial, ask the subject to look away from their forearm or calf. Apply the filament to the subject's forearm or calf until it bows, and ask if they feel the filament.\nStarting with the smallest filament (0.078 mN; below the sensory threshold for human detection), conduct five trials on the subject's forearm or calf for each filament.\n\t\nWith each filament (e.g., the 0.078 mN filament), apply the filament four times in the \"positive\" trials.\nFor the other trial, do not apply the filament, but still ask the subject if they feel the filament.",
    "NOTE: This \"negative\" trial will be randomly inserted with the four \"positive\" trials and is designed to test for false responses (i.e., the subject thinks they feel something even though no stimulus is applied). This is necessary for sensory threshold testing, because random noise in the sensory system and/or other stimuli (e.g., a light breeze) can cause a false response.\nIf a subject detects ≥3 of the positive trials and 0 negative trials for a filament, then record that filament as the subject's \"mechanical sensory threshold\" on the data form.\nFor a single filament, if the subject detects <2 of the real trials and/or >0 of the false trials, then start another round of 5 trials with the next-biggest filament until the sensory threshold is reached.\n\tNOTE: Sensory thresholds vary for human participants, but in experience, they typically range from 1.57-9.81 mN (data not shown). This force is enough to feel light innocuous pressure. Typical testing time for each body part (forearm and calf) is about 5 min. It is also possible to measure needle-like pain with these filaments, but this usually entails using larger-diameter filaments.\n2. Radiant Heat Sensitivity Assay35\nNOTE: Enrolled participants are asked to sit in a chair, with support provided for the extremity to be tested. The assay involves determining the sensitivity threshold for non-painful heat change and for painful thermal stimulation. Stimulation is provided with a radiant heat device35. This device uses a focused light beam to slowly heat a subject's skin through a piece of 0.64-mm-thick safety glass (see below in the instrument section).\nBefore the start of the training and experimental trials, show the device to the subject; allow them to feel the stimulus with their hand.",
    "Ask the subject to rest their forearm or calf on the room temperature glass plate, which should be covered with a rubber-insulating sheet except for the small window for stimulus presentation.\n\tNOTE: The insulating sheet allows the subject to focus on the stimulus presentation without the cooling sensation associated with placing one's body against a room-temperature object.\nUsing a mirror, position the light source under a marked area on the subject's forearm or calf (Figure 1).\n\tNOTE: When the leg or arm is raised from the surface of the glass, the thermal stimulus automatically stops and the time since the beginning of the trial is then recorded as the \"latency to respond.\"\nComplete two trials for each test on each limb (innocuous temperature detection and pain threshold) in two distinct marked areas to avoid retesting at a single site.\nFor the innocuous temperature detection trial, ask the subject to raise their leg or arm or depress the \"stop\" button when they feel the temperature change.\n\t\nSet the device so that the typical withdrawal threshold occurs at approximately 10 sec into the trial and so that the device shuts off after 20 sec. To accomplish this withdrawal threshold, set the device to ramp the temperature such that the stimulus reaches 47 °C at 10 sec.",
    "NOTE: For innocuous temperature detection trials, the typical temperature on the glass at threshold is 37 °C (99 °F). In the pain threshold trial, subjects are told to raise their leg or arm or depress the \"stop\" button when they feel the stimulus transition from \"innocuous warmth or heat\" to \"painful heat.\" The typical temperature on the glass at threshold is ~47 °C (121 °F). The maximum temperature of the trial at the 20 sec cutoff time point is 50 °C, which is well below the cumulative temperature that causes tissue damage in humans36.\nUse the constant temperature assay28 (heat block) to evaluate both the quality and unpleasantness of thermal pain. Using the heat block, set the temperature to 45 °C for the stimulus.\n\tNOTE: 45 °C is a standard temperature that is the typical minimal stimulus necessary to feel thermal pain and is known to activate TRPV1 nociceptive receptors29.\n\t\nBefore step 2.7.2, explain the standard 0-10 VAS and show a 10 cm line to the subject. Inform the subject that on the \"quality scale,\" \"0\" represents \"no pain\" and \"10\" represents \"the worst pain imaginable,\" and that on the \"unpleasantness scale,\" \"0\" represents \"not unpleasant\" and \"10\" represents \"the most unpleasant sensation imaginable\" (Figure 2).\nApply the stimulus (3 cm x 5 cm heating block) for 3 sec to the marked location on the left forearm or calf (as shown in Figure 1 at the site marked \"T\").\nImmediately following the stimulus, ask the subject to evaluate the quality and unpleasantness of the pain using a standard 0-10 VAS.\n3. Pressure Sensitivity Assay13,37",
    "NOTE: Enrolled participants are asked to sit in a chair, with support provided for the extremity to be tested. The assay involves determining the sensitivity threshold for painful pressure stimulation and then determining the quality and unpleasantness of that same pressure in a separate trial. Stimulation is provided with a standard clinical pressure algometer (see below in the instrument section in the Materials and Equipment Table). This device consists of a 2 cm probe connected to a pressure meter.\nBefore the first training and experimental trial, allow the subject to apply the stimulus to themselves under careful supervision.\nFor the pain threshold trial, place the probe on the subject's forearm or calf and apply pressure gradually.\n\t\nComplete two trials each to the forearm and calf at two distinct sites (on each limb) to avoid damage to a single area.\nDuring a trial, apply pressure gradually, until the stimulus transitions from \"innocuous pressure\" to \"painful pressure\". Ask the subject to say \"stop\" at this point and remove the stimulus from the subject's forearm or calf.\nRemove the algometer from the subject. The device automatically records the greatest pressure applied. Record this as the \"pressure pain threshold\" for the trial.\nInform the subject that the constant pressure trials are next.\n\t\nAfter determining the pressure threshold for the subject, apply an additional trial on the opposite limb to determine the subject's pain associated with a painful pressure stimulus (in a third testing site). Match the exact stimulus to the subject's pain threshold determined during the baseline trials (e.g., if baseline trials for the forearm indicated a pressure threshold of 50 N, then the subject will be asked to evaluate the pain of that stimulus).",
    "In this trial, ask the subject to evaluate the quality and unpleasantness of a pressure stimulus given for 3 sec.\nUse a standard 0-10 VAS. Inform the subject that on the \"quality scale,\" \"0\" represents \"no pain\" and \"10\" represents \"the worst pain imaginable.\" On the \"unpleasantness scale,\" \"0\" represents \"not unpleasant\" and \"10\" represents \"the most unpleasant sensation imaginable.\"\nDuring this trial, apply a painful stimulus, and then ask the subject to evaluate that pain (on the two VASs described above).\n4. Reliability Study\nNOTE: To examine the reliability of the protocol, we conducted a small study to compare the ratings of subjects between one male and one female examiner.\nRecruit participants by posting flyers. Have the interested volunteers who meet the inclusion criteria (Supplemental 1) participate in an orientation session where the study is described and the testing techniques are demonstrated.\nAsk potential volunteers questions and have them read and sign the informed consent documents approved by the University IRB.\n\tNOTE: The two examiners for this study were laboratory technicians (one male and one female) who were trained by study investigators who have experience from the clinic and laboratory in pain measurement and management and in neural sensation.\nTest all subjects with two different examiners, with the two examinations 30 min apart.\nTo assess inter-rater reliability for this study, calculate intraclass correlation coefficients (model 3,2) [ICC(3,2)] using a two-way mixed analysis of variance (ANOVA) with absolute agreement for each dependent variable (eight total)38. A statistical software can be used for all statistical analyses.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}