{
  "id": 5559,
  "origin_website": "Bio",
  "title": "Intracaecal Orthotopic Colorectal Cancer Xenograft Mouse Model",
  "procedures": [
    "Autoclave forceps, surgical scissors, wound closure applier and clips prior to procedure.The entire surgical procedure is to be carried out under a sterile hood.Clean surgical equipment with Virkon® disinfectant cleaner between mice.Trypsinize 80% confluent colorectal cancer cells, e.g., HT-29 and HCT116, and wash cells with PBS, centrifuge at 200 x g for 5 min at 4 °C. Discard supernatant and repeat the wash step three times. Keep cells (5 x 106-1 x 107 cells in 50 μl PBS) on ice and check cell viability before injection. Example: For 10 injections, prepare at least 12 x 5 x 106 to 12 x 1 x 107cells in 12 x 50 μl PBS. Administer buprenorphine pre-operatively (0.1 mg/kg, subcutaneously) 10 min before surgery.Inject mice with Avertin solution (0.5 ml/25 mg mouse) or ketamine/xylazine/acepromazine (0.2 ml/20 mg mouse) intraperitoneally to anesthetize the mouse before surgery. Check hind limb reflex by pinching foot to make sure that mice are asleep. Induction time is around 1-2 min. Surgical anesthesia lasts approximately for 15-45 min with a sleep time of 60-120 min if Avertin is used.Note: Surgical anesthesia lasts approximately for 30-40 min with a sleep time of 60-180 min if ketamine/xylazine/acepromazine is used. Preparation of animals: 1) Remove hair (if SCID mice are used) from the surgical area by using a trimmer/clipper; 2) apply betadine in a circular fashion starting at the surgical incision and rotating outward; 3) alternate betadine with 70% alcohol; 4) repeat three times, discard cotton pad after each use; 5) Before surgery, apply ophthalmic ointment to both eyes to prevent desiccation; 6) before starting, cover the rodent with sterile drape to avoid contamination of the incision; 7) during surgery, use thermal pads to maintain normal body temperature.Place the animal in ventral recumbency. Make a 0.",
    "5-inch long midline skin incision along the lower abdomen around 1 cm anterior to the genital by a pair of forceps and surgical scissors. The body wall is then incised in the same length. Gently pull out cecum and ascending colon from the incision. Keep the exposed cecum and ascending colon moist with 0.9% sodium chloride during the entire procedure.Inject 5 x 106-1 x 107 colon cancer cells in 50 μl PBS into the cecum wall (Figure 1). (Tseng et al., 2007)Note: Make sure that bubbles are removed from the cell suspension.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170530/20170530230730_4196.jpgFigure 1. Schematic diagram of mouse gastrointestinal tract. Cecum and the injection site are indicated in the diagram.Place cecum and ascending colon back into the abdominal cavity. Note: Be careful not to squeeze the injection area.Suture abdominal muscle layer, and then close the skin by wound clips. Keep mice warm under heat lamp until the mice recover from anesthesia. The lamp should be kept 12-14 inches away from the mouse and attentive monitoring should be performed to prevent overheating. Surgical heating pads or a temperature-controlled cage/incubator can be used as alternatives. Mice should be monitored until maintaining upright posture and walking normally before returning to the animal housing room.Administer buprenorphine post-operatively (0.1 mg/kg, subcutaneously in one 72-h injection) as needed.Check mice every day following surgery for infection or signs of pain. Antibiotics may be used if infections occur.Remove clips by wound clip remover after 7-10 days once the incision has healed."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}