{
  "id": 17115,
  "origin_website": "Jove",
  "title": "Modified Tail Vein and Penile Vein Puncture for Blood Sampling in the Rat Model",
  "procedures": [
    "The procedures were performed on 3 month old male Lewis rats, each weighing 300-400 g. A total of 24 animals were included, with three puncture conditions: 12 rats underwent tail vein puncture without anesthesia (group TV without anesthesia), and another 12 rats were anesthetized to undergo both tail vein puncture (group TV with anesthesia) and penile vein puncture (group PV with anesthesia). All the procedures were approved and respected the Institutional Animal Care and Use Committee (IACUC) guidelines. All the animals were euthanized at the end of the study (after a 1 month follow-up) by carbon dioxide overdose. See the Table of Materials for details related to all the materials and instruments used in this protocol.\n1. General guidelines\nIn line with the IACUC guidelines, ensure that the maximum blood volume drawn is no more than 10% of the total blood volume every 2 weeks9. For example, a rat of 300 g should have a total blood volume of approximately 19.2 mL. In the case of a protocol requiring four blood draws in the first week alone (day 0, day 1, day 3, day 7), limit the collection to a maximum of 250 μL of blood per sample.\nFor procedures performed under anesthesia, administer isoflurane via a precision vaporizer to anesthetize the animal. Induce anesthesia in a chamber with a dose of 3%-5% isoflurane for 5 min, and maintain using a dose of 1%-3% isoflurane through a nose cone during the procedure. Adjust the isoflurane level based on continuous monitoring of the respiratory rate. Verify whether sedation is sufficient by toe pinch before starting the procedure.\nDo not leave the animal unattended during the procedure or until it has regained sufficient consciousness to maintain sternal recumbency.",
    "After the blood collection, monitor the animal until full recovery before returning it to its cage, and do not introduce it to the company of other animals until fully recovered.\n\t​NOTE: In agreement with veterinary services, no post-procedure pain medication was necessary after tail vein or penile vein puncture.\n2. Blood draw from the penile vein\nPreparation\n\t\nPrepare the following equipment: sterile gauze, gloves, alcohol wipes, a microcapillary blood collection EDTA tube (purple cap), and a 30 G insulin syringe (30 U or 50 U).\nTake the rat out of its cage, and put it in a chamber for induction with isoflurane via a precision vaporizer (dose: 3%-5%). Once the animal is sedated, transfer it to the procedure table, and lay the animal on its back with its nose placed in the nose cone to maintain the anesthesia. Monitor the respiratory rate, and adjust the isoflurane level accordingly (maintenance dose: 1%-3%). Verify that the animal is sufficiently sedated by toe pinch before starting the procedure.\nBlood sampling\n\t\nMove the plunger back and forth in the syringe several times to smoothen the withdrawal. Create negative pressure in the syringe by pulling on the plunger to remove a couple of microliters.\nWith the help of the non-dominant hand, retract the foreskin from the end of the penis, and hold the glans between the index and thumb, pulling gently. The dorsal penile vein will appear as a superficial blue cord. See Figure 1 and Figure 2.\nWith the eye of the needle pointing upward, insert the insulin syringe into the vein at an angle of 35°. Once the needle has entered the vein, blood will flow into the syringe.\nSlowly withdraw the plunger of the syringe at a slow and steady rate to collect the desired volume.",
    "NOTE: Do not withdraw the plunger too fast, as this will cause the vein to collapse and stop the blood flow.\nIf the blood flow decreases, rotate the needle slightly clockwise or counterclockwise.\nRemove the syringe. A blood drop will form on the puncture site, the aspiration of which will allow the collection of a few more microliters of blood in the case of a non-sterile procedure.\nIf the first puncture fails, reinsert the needle more proximally on the vein.\n\t\tNOTE: Unlike for tail vein sampling, the iterative puncture of the dorsal penile vein is usually unsuccessful.\nApply light pressure to the puncture site to stop the bleeding, and wipe the area with a new alcohol wipe.\nPlace the penis back in its neutral position.\nTurn the isoflurane off, and monitor the rat until complete recovery. Return the rat to its cage.\n3. Tail vein puncture\nPreparation\n\t\nPrepare the following equipment: a plastic restraining holder, sterile gauze, gloves, alcohol wipes, a microcapillary blood collection EDTA tube (purple cap), and a 28 G 1/2 insulin syringe (30 U or 50 U).\nTake the rat out of its cage, and quickly secure it in a plastic restraining cone. Close the large end of the cone around the base of the tail. Ensure that the animal is comfortable and that breathing is unrestricted throughout the whole procedure.\nDip the tail in warm water (37 °C) for about 1 min to dilate the vein. Dry the tail with a paper towel. Place the animal (in its restrainer) face down, with the tail lying on a heating pad.",
    "Select the right or left tail vein (blue line) for sampling by rotating the entire animal to either side (this avoids the twisting of the tail). Use the terminal third of the tail for blood vessel puncturing since the vessels become more superficial in this zone. The artery is ventral, and the two veins are lateral10.\nWipe the tail with 70% ethanol wipes at the puncture site.\nPlace the tail on the edge of the heating pad to create an angle in the terminal third of the tail. This brings the vein to the surface and creates more space for taking the sample.\nBlood sampling\n\t\nMove the plunger back and forth in the syringe several times to smoothen the withdrawal. Create negative pressure in the syringe by pulling on the plunger to remove a couple of microliters.\nWith the help of the non-dominant index and middle finger, secure the tail flat on the heating pad. Place the middle finger proximally and the index finger distally, with the puncture site between these two fingers. Apply more pressure on the middle finger than on the index to secure the tail, occluding the vessel only proximally and allowing the blood to pool. See Figure 1 and Figure 3.\nWith the eye of the needle pointing upward, slide the insulin syringe against the index finger until it is inserted into the vein (this creates an angle of 35° between the needle and the tail). Once the needle has entered the vein, blood will flow into the syringe. At this point, release the pressure on the index and middle finger to ensure that the blood flow is not occluded.\nSlowly withdraw the plunger of the syringe at a steady rate to collect the desired volume.",
    "NOTE: Do not withdraw the plunger too fast; this will cause the vein to collapse and stop the blood flow.\nIf the blood flow decreases, rotate the needle slightly in either direction.\nRemove the syringe from the tail. A blood drop will form on the tail's puncture site. The aspiration of this blood allows for the collection of a few more microliters of blood in the case of a non-sterile procedure.\nIf the first puncture fails, reinsert the needle more proximally on the vein.\n\t\t​NOTE: The vein becomes progressively more profound as it approaches the tail base. If there is no blood flow in the syringe, increase the angle between the syringe and the tail, or rotate the needle.\nApply pressure to the puncture site to stop the bleeding, and wipe the area with a new alcohol wipe. Remove the rat from the plastic cone, and return it to its cage.\nTail vein puncture under anesthesia\n\t\nPerform step 2.1.1 and step 2.1.2 for inducing and maintaining anesthesia.\nPerform steps 3.1.3-3.2.7 for blood collection; see Figure 1.\nPerform step 2.2.10 for animal recovery.\nimgsrc://cloudfront.jove.com/files/ftp_upload/65513/65513fig01.jpg\nFigure 1: Schematics of the different puncture methods in this protocol. (A) Modified tail vein puncture on a conscious, restrained animal; (B) modified tail vein puncture and penile vein puncture under anesthesia. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/65513/65513fig01large.jpg]Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}