{
  "id": 16932,
  "origin_website": "Jove",
  "title": "Förster Resonance Energy Transfer Measurements in Living Plant Cells",
  "procedures": [
    "NOTE: For the following protocol, transient transfection of protoplasts was performed, as described previously12. A brief description is given below.\n1. Transient transfection of protoplasts\nCut ~4 g of healthy leaves of Arabidopsis thaliana ecotype Columbia into 1 mm slices and transfer them to 20 mL of enzyme solution (1.5% cellulase; 0.4% macerozyme; 0.1% bovine serum albumin Fraction V; 0.4 M mannitol; 20 mM KCl; 20 mM 2-(N-morpholino)ethanesulfonic acid (MES), pH 5.7; 10 mM CaCl2).\nVacuum-infiltrate the leaf slices followed by an incubation with agitation for 2 h at room temperature. Harvest the cells by centrifugation for 3 min at 100 × g.\nWash the protoplasts with W5-solution (154 mM NaCl; 125 mM CaCl2; 5 mM KCl; 2 mM MES, pH 5.7) and resuspend them in MMG solution (0.4 M mannitol; 15 mM MgCl2; 4 mM MES, pH 5.7).\nPerform the transfection in an 8-well slide by osmotic shock in the presence of polyethyleneglycol (PEG) 4000. Mix 20 µL of the protoplast suspension with 5 µL of plasmid DNA (5 µg/µL) and 25 µL of PEG solution (0.2 M mannitol, 0.1 M CaCl2, 40% PEG 4000).\nReverse the osmotic shock by gentle readjustment of the osmotic conditions.",
    "​NOTE: Besides the sample of interest, the expression of donor alone and acceptor alone is required to determine the spectral bleed-through of the donor and the acceptor, respectively. A fusion protein of the donor and the acceptor must be expressed too for calibration purposes. The fluorescent protein expression was under the control of a cauliflower mosaic virus 35S promoter (pCaMV35S). For all measurements, two confocal laser scanning microscopes (LSM1 and LSM2) were used. LSM1 has two types of detectors: for FRET measurements, the donor signal was detected by a GaAsP-detector, while FRET and acceptor emission were recorded with a photomultiplier. LSM2 has two photomultipliers, which were used for the detection of donor, FRET, and acceptor emission.\n2. Laser-adjustment\nNOTE: Here, 458 nm and 514 nm lines of an argon-ion laser have been applied for FRET analysis between enhanced cyan fluorescent protein (ECFP)- and enhanced yellow fluorescent protein (EYFP)-labeled proteins. For reproducible data acquisition, both lines were adjusted to similar intensity. This was achieved by either a transmission photomultiplier or the reflection mode.\nLaser adjustment with a transmission photomultiplier\n\t\nUse an empty well for adjustment.\nChoose line-scanning mode and histogram view.\nDecrease the laser intensity to the minimum, and adjust the detector gain to detectable background noise.\nIncrease the laser intensity in steps of 0.5% and record the corresponding signal.\nApply the routine for both laser lines.\nLaser adjustment with reflection mode\n\t\nUse an empty well for adjustment.\nApply a reflection filter, switch on the reflection mode, if available.\nEnsure that the detector wavelength range covers the wavelength of the laser.\nChoose the line-scanning mode and histogram view.\nDecrease the laser intensity to the minimum, and adjust the detector gain to detectable background noise.\nMove the objective to the lowest position.",
    "Move the objective up until the reflection of the coverslip is visible.\nIncrease the laser intensity in steps of 0.5% and record the corresponding signal.\nApply the routine for both laser lines.\nData evaluation\n\t\nTabulate the data and sort the data by signal intensities.\nPlot the signal intensities against the relative laser power.\nChoose laser intensities that result in similar signal intensity.\n3. Adjustment of photomultipliers\nNOTE: After laser adjustment, the photomultipliers were adjusted to individual gains to obtain similar sensitivity. This calibration was done with the 514 nm laser line, which is in the center of the wavelength range of interest.\nUse an empty well for adjustment.\nApply a reflection filter, and switch to reflection mode if available.\nEnsure that the detector wavelength range covers the wavelength of the laser (514 nm).\nChoose the line scanning mode and histogram view.\nDecrease detector gain to half the maximum, and adjust the laser intensity to detectable background noise.\nMove the objective to the lowest position.\nMove the objective up until the reflection of the coverslip is visible.\nIncrease the detector gain in steps of 50 to 100 V and record the corresponding signal.\nApply steps 3.1 to 3.8 for both detectors.\nData evaluation\n\t\nPlot the intensity against the detector gain for each detector.\nChoose the individual detector gains to obtain similar sensitivity.\n4. FRET image acquisition\nNOTE: Start with the sample of interest for setting up image acquisition.\nChoose the appropriate filters/dichroic mirrors, e.g., a double dichroic mirror MBS 458/514 for the FRET-pair ECFP/EYFP. Use the same dichroic mirror for all channels to enable line-by-line scanning. Select a water immersion objective for the imaging of living cells. Choose 12 bit- or 16-bit scanning and moderate scanning speed.",
    "Define the detection range, preferably 470-510 nm for donor detection and 530-600 nm for acceptor/FRET detection in the case of ECFP/EYFP. When using a 445 nm or 440 nm diode laser, use 450 to 510 nm as the detection range. In the case of an acousto-optic beam splitter (AOBS), define donor detection in the range of 450 to 500 nm to prevent unwanted acceptor detection.\nApply the detector setting according to 3.10.2.\nApply the laser setting according to 2.3.2. Revise the laser intensity based on the obtained laser power table, if required. Ensure that the signal-to-noise ratio covers the entire dynamic range of the detectors (intensity ranging from 0 to 4095 for 12-bit scanning).\nKeep laser intensities and detector gains constant. Use the pinhole diameter for fine-tuning.\n\tNOTE: Keep in mind that changes in the pinhole diameter affect spatial resolution.\nPerform the measurements (take images of at least 20 cells).\n5. Determination of crosstalk corrections\nNOTE: Cells expressing only the donor or the acceptor are required to determine donor spectral bleed-through (DSBT) and acceptor spectral bleed-through (ASBT), respectively. Keep the same settings described in section 4.\nPerform FRET measurements with cells expressing the donor fluorophore.\nPerform FRET measurements with cells expressing the acceptor fluorophore.\n6. Calibration of the measurements according to Beemiller et al.13\nNOTE: Cells expressing a donor-acceptor fusion of known FRET efficiency are required. Here, an ECFP-5 aa-EYFP-fusion with a FRET efficiency of 0.46 has been used4. Keep the same settings described in section 4.\nPerform FRET measurements with cells expressing the donor-acceptor fusion\n7. Data evaluation\nObtain line profiles of the cells, ensuring that each profile contains no more than one cell. Save the profiles as text files.\nImport the text files into a spreadsheet using the text file import option in the Data section.",
    "Read out the maximum values by applying the Max function.\nList the obtained values in a table, have a column each for donor emission ID, FRET emission IF, acceptor emission IA, and at least four data sets: donor only, acceptor only, donor-acceptor fusion, and measurement.\n\tNOTE: Excitation of the donor also results in direct excitation of the acceptor and causes ASBT that is described by the α value.\nCalculate the ASBT α values with the acceptor-only dataset using equation (1).\nimgsrc://cloudfront.jove.com/files/ftp_upload/62758/62758eq01.jpg (1)\n\tNOTE: Use the median of all α-values in the following equations. The donor shows a broad emission spectrum that results in emission crosstalk with the sensitized emission of the acceptor. This DSBT is given by the β value.\nCalculate the donor spectral bleed-through β values with the donor-only dataset using equation (2).\nimgsrc://cloudfront.jove.com/files/ftp_upload/62758/62758eq02.jpg (2)\n\tNOTE: Use the median of all β values in the following equations. The calibration factor ξ describes the linear relationship of FRET-derived donor quenching and sensitized emission of the acceptor. Use the medians of 7.5 and 7.6 in the following equations.\nCalculate the calibration factors ξ with the donor-acceptor fusion dataset and its FRET efficiency E (0.46) using equation (3).\nimgsrc://cloudfront.jove.com/files/ftp_upload/62758/62758eq03.jpg (3)\n\tNOTE: Use the median of all ξ values in the following equations.\nCalculate the FRET efficiencies of the protein pair of interest using equations (4) and (5).\nimgsrc://cloudfront.jove.com/files/ftp_upload/62758/62758eq04.jpg (4)\nimgsrc://cloudfront.jove.com/files/ftp_upload/62758/62758eq05.jpg (5)\nEstimate the effects of expression strength and/or donor-acceptor ratio: plot the sum of ID, IF, and IA against the FRET efficiencies. Perform a linear regression; note that the steeper the graph and the higher R2 is, the higher is the impact of the expression level or the greater is the difference of donor and acceptor abundance.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}