{
  "id": 5328,
  "origin_website": "Bio",
  "title": "Cation (Ca<sup>2+</sup> and Mn<sup>2+</sup>) Partitioning Assays with Intact <em>Arabidopsis</em> Chloroplasts",
  "procedures": [
    "Preparation of a Percoll gradientPlace all materials, reagents and buffers in the cold room for temperature equilibration at 4 °C. Prepare 10 ml Percoll solution (40%) by mixing 4 ml Percoll, 2 ml 5x resuspension buffer, pH 8.4 and 4 ml H2Obidest.Prepare 10 ml Percoll solution (80%) by mixing 8 ml Percoll and 2 ml 5x resuspension buffer, pH 8.4.Fill into a Corex tube 9 ml of 40% Percoll solution and carefully underlay 9 ml of 80% Percoll solution using a 10 ml glass pipette and an automatic pipette controller, keep the gradient on ice until further use (Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170102/20170102170322_4154.jpgFigure 1. Preparation of Percoll gradient and isolation of intact chloroplasts (Procedures A and B)Isolation of intact chloroplastsHarvest 12 g fresh leaf material of overnight dark adapted Arabidopsis plants (see Notes). Perform all steps in a cold room equipped with green light (500-530 nm).Add 180 ml of homogenization buffer, pH 8.4 to the leaf material and homogenize in a Warring blender for 4 x 3 sec at 18,000 rpm (corresponding to button ‘Hi’).Filter the homogenate through two layers of Miracloth and centrifuge at 1,500 x g for 5 min at 4 °C in a JA-14 rotor.Remove supernatant and resuspend the pellet in 1 ml of 1x resuspension buffer pH 8.4 by carefully inverting the tube.Transfer the resuspended pellet (= chloroplast suspension) by using a cut-off pipette tip carefully on top of the Percoll gradient (Figure 1).The density gradient centrifugation is carried out in a JS-13.1 rotor for 15 min at 4 °C and 7,000 x g, use a slow acceleration and turn deceleration off. After centrifugation broken chloroplasts reside in the top fraction, intact chloroplasts reside in the interface of the two Percoll layers (Figure 1).",
    "Remove broken chloroplasts and the upper solution and carefully transfer intact chloroplasts using a cut-off pipette tip into a Falcon tube. Wash intact chloroplasts with 25 ml of 1x resuspension buffer pH 8.4. This step removes residual Percoll. Centrifuge at 1,500 x g for 5 min at 4 °C.Resuspend pellet (= Intact chloroplasts) in 500 µl import buffer, pH 8.0 (Ettinger et al., 1999), transfer to a 2 ml tube, wrap in aluminum foil and keep on ice. Determination of chlorophyll concentrationDilute 10 µl of intact chloroplast solution with 990 µl 80% acetone and incubate for 10 min on ice and in the dark.Centrifuge at 16,000 x g (centrifuge 5418 R) for 2 min at room temperature and immediately transfer supernatant to a quartz cuvette for measurement at 750 nm (for baseline correction), 663 nm and 646 nm in a UV/Vis spectrophotometer. Use 80% acetone as a blank sample.Calculate the chlorophyll content with following formulae (Porra, 2002):Chla = 12.25 x A663 - 2.55 x A646Chlb = 20.31 x A646 - 4.91 x A663(Chla + Chlb) x 100 = xxx µg Chl/mlAdjust chlorophyll concentration to 0.3 mg/ml with import buffer, pH 8.0 and divide sample into 45 µl aliquots (= Intact chloroplasts), wrap in aluminum foil and keep on ice. The whole procedure requires 15 aliquots per isotope experiment.Preparation of 45Ca or 54Mn working solutionPerform all steps in the isotope lab. For handling 54Mn it is necessary to wear a lead coat and to shield radioactive samples with a lead wall (5 cm). Perform 45Ca assays and 54Mn assays separately, e.g., on two following days, but use freshly prepared chloroplasts.Take 4 µl of 45Ca stock solution and dilute it (1:20) with 76 µl of CaCl2 (15 µM).",
    "Mix well, this mixture corresponds to the 45Ca working solution and it is suitable for 15 (+1) reactions. Take 4 µl of 54Mn stock solution and dilute it (1:20) with 76 µl of MnSO4 (1.5 µM). Mix well, this mixture corresponds to the 54Mn working solution and it is suitable for 15 (+1) reactions.Uptake of 45Ca or 54Mn into chloroplasts (Figure 2)imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170102/20170102170411_6646.jpgFigure 2. Schema of experimental set-up. Incubation of intact chloroplasts with 45Ca (A and B) or 54Mn (C and D) is done for 20 min in 90 µmol photons m-2 sec-1. After light incubation samples are incubated in sorbitol, without vortexing to keep chloroplasts intact (A and C) or samples are incubated without sorbitol, but with vortexing to release thylakoids (B and D). EGTA is used as chelating agent to complex divalent cations, attached to the outside of the membranes.To start the import reaction, mix a 45 µl aliquot (= Intact chloroplasts, step C3) with 5 µl of 45Ca working solution (step D2) or with 54Mn working solution (step D3), remove aluminum foil and immediately expose samples for 20 min to 90 µmol photons m-2 sec-1.Set up the reaction with three aliquots corresponding to three replicates.Add 1 ml import buffer, pH 8.0 to each aliquot and incubate on ice, in the dark for 10 min (the total incubation time is 30 min). The import buffer contains sorbitol therefore the chloroplasts are kept intact during this incubation step.Centrifuge at 16,000 x g (centrifuge 5418 R) for 1 min at 4 °C and remove supernatant. Resuspend pellet in 1 ml washing buffer, pH 8.0 and vortex for 2 sec. This step removes 45Ca or 54Mn bound at the surface of the membrane, because the washing buffer contains EGTA as chelating agent.",
    "Centrifuge at 16,000 x g (centrifuge 5418 R) for 1 min at 4 °C and remove supernatant. Resuspend pellet in 50 µl of 0.1% SDS and immediately transfer to 4 ml scintillation cocktail. Mix well and keep samples at room temperature until counting.Uptake of 45Ca or 54Mn into chloroplasts and subsequent release of thylakoids (Figure 2)To start the import reaction, mix a 45 µl aliquot (= Intact chloroplasts, step C3) with 5 µl of 45Ca working solution (step D2) or with 54Mn working solution (step D3), remove aluminum foil and immediately expose samples for 20 min to 90 µmol photons m-2 sec-1.Set up the reaction with three aliquots corresponding to three replicates.Add 1 ml import buffer, pH 8.0 to each aliquot and incubate on ice, in the dark for 10 min (the total incubation time is 30 min). The import buffer contains sorbitol therefore the chloroplasts are kept intact during this incubation step.Centrifuge at 16,000 x g (centrifuge 5418 R) for 1 min at 4 °C and remove supernatant. Resuspend pellet in 1 ml washing buffer, pH 8.0 and vortex for 2 sec. This step removes 45Ca or 54Mn bound at the surface of the membrane, because the washing buffer contains EGTA as chelating agent.Centrifuge at 16,000 x g (centrifuge 5418 R) for 1 min at 4 °C and remove supernatant. Resuspend pellet in 50 µl of 0.1% SDS and immediately transfer to 4 ml scintillation cocktail. Mix well and keep samples at room temperature until counting.",
    "Additional reaction for estimating uptake of 45Ca or 54Mn during 10 min incubation step on iceTo start the import reaction, mix a 45 µl aliquot (= Intact chloroplasts, step C3) with 5 µl of 45Ca working solution (step D2) or with 54Mn working solution (step D3), remove aluminum foil and immediately perform steps E2 to E4 and F2 to F4. The total incubation time is therefore 10 min on ice in the dark. Set up the reactions with three aliquots each corresponding to three replicates.Additional reaction for estimating background radiationTo estimate background radiation, mix a 45 µl aliquot (= Intact chloroplasts, step C3) with 5 µl of 45Ca working solution (step D2) or with 54Mn working solution (step D3), remove aluminum foil and immediately perform steps E3 to E4. Set up the reaction with three aliquots each corresponding to three replicates.Determination of incorporated radioactivity Collect scintillation vials form steps E4, F4, G and H and determine counts per minutes (cpm) in a liquid scintillation counter Tri-Carb® 2910 TR. Determine 45Ca values using program #5 and determine 54Mn values using program #8 with 5 min count time per individual scintillation vial."
  ],
  "subjectAreas": [
    "Plant Science",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}