{
  "id": 15194,
  "origin_website": "Jove",
  "title": "Exploring the Effects of Spaceflight on Mouse Physiology using the Open Access NASA GeneLab Platform",
  "procedures": [
    "The animal protocols for housing and tissue processing follow standard guidelines for laboratory animal care and have been approved by NASA's flight and ground Institutional Animal Care and Use Committees (IACUC).\n1. Configuration of Rodent Habitats\nNOTE: The NASA Rodent Habitats (previously AEMs) have different features from the vivarium cages to accommodate for operations in space (Figure 1).\nHouse 10 mice in each Rodent Habitat (up to 30 g per mouse). House 5 mice per compartment when the habitat is configured into two compartments or 10 mice if there is a single compartment.\nNOTE: NASA Rodent Habitats have a larger accessible surface area per rodent than the standard vivarium cages.\nFor ground controls animals, house mice in Rodent Habitat inside the ISS Environmental Simulator (ISSES) under identical environmental conditions as the flight animals including CO2 concentrations, temperature, and relative humidity.\nProvide animals with ad libitum access to custom made NASA Nutrient Upgraded Rodent Foodbars (NuRFB) in accordance with National Research Council (NRC) nutritional requirements for mice37, and to water through pressure activated lixits.\nMonitor the animals' health and behavior which will be enabled in the Rodent Habitats with the 12:12 h light cycle similar to vivarium cages in standard facilities with LED lighting during the day and infrared lighting during video health checks that take place during the dark cycle.\nPlace four cameras in the Rodent Habitat cages for the daily monitoring of animals' health and behavior and collect videos during the night with infrared lighting.\nDeliver the rodents to the ISS in a Transporter (Figure 2B) aboard the Dragon Capsule or similar launch vehicle.",
    "Ensure that the rodents are observed and examined by the NASA flight veterinarian before being loaded into the Transporter for launch, and by the trained crew members upon arrival to ISS and before transfer to Rodent Habitats.\nFor this transition period, house up to 20 mice (10 on each side) or 12 rats in the transporter.\nNOTE: Similar to the Rodent Habitat, the Transporter is a passive unit for environmental conditions. During this short transition period, this single-unit can house up to 20 mice.\n2. Rodent Handling for Spaceflight Experiments\nProcure rodents from standard vendors.\nNOTE: Following delivery, group rodents within standard vivarium cages and have the animals acclimate to NASA NuRFB, lixits, and raised wire floors until the animals are loaded into the Transporter. Leaving the rodents in the cages will allow the animals to adapt naturally. The handling of mice in and out of both the Rodent Habitats and vivarium cages follows protocols commonly used for all rodent experiments12,27,28. The Rodent Habitat system (Figure 1A) will be utilized for both spaceflight mission on the STS and ISS, respectively, and for ground controls simulating ISS or STS environmental conditions.\nFor some missions use standard vivarium cages (Figure 1B) for the vivarium control. Use 5 or 10 mice per standard vivarium cage.\nFor Rodent Habitats, place 10 mice in two different compartments with 5 mice per compartment. Remove the cage divider to house 10 mice per Habitat in a single compartment.\nUtilize three components of the Rodent hardware during spaceflight missions as described below (Figure 2).\nPlace rodents in a Transporter (Figure 2B) for the travel between the Earth and the ISS or vice versa at double density (10 mice per side, 20 mice per Transporter).",
    "Once on ISS, attach the Animal Access Unit (AAU) (Figure 2C) to the Transporter. Transfer rodents from the Transporter to the Habitats using Mouse Transfer Boxes (MTB) (5 mice per MTB) (Figure 2D).\nNOTE: The AAU is used to contain any animal products (e.g., feces, urine, fur) from getting to the ISS cabin.\nDetach the AAU from the Transporter and attach to the Rodent Habitat. Then transfer the animals from the MTB to the Rodent Habitat (Figure 2A) where they reside for the duration of the mission.\nNOTE: The CO2 concentration due to elevated levels in the ISS cabin for all Rodent Habitats is at 5,000 ppm.\nMonitor the temperature and humidity of the Rodent Habitats, but there are no active thermal controls. Ensure that the Rodent Research team works with ISS to maintain and control the cabin temperature, which determines the temperature in the Rodent Habitat.\nNOTE: The light and dark cycle in the Rodent Habitats occurs every 12 h (e.g., 5:00–17:00 GMT, lights on) and the ISS crew performs regular and frequent change out of the food (weekly or biweekly) and refills the water (every ~28 days).\n3. Euthanasia of Rodents and Processing Tissue\nFor euthanasia, give rodent an overdose of a general anesthetic (Ketamine/Xylazine up to 150/45 mg/kg body mass diluted in phosphate-buffered saline for a total volume of 0.3 mL) via intraperitoneal injection (IP) paired with a secondary method of euthanasia (cervical dislocation or thoracotomy).\nFor experiments conducted on the ISS:\nReturn rodents either live, or\nEuthanize on ISS.\n\t\t\nFreeze rodent carcasses at -95 ± 2 °C in the freezers on the ISS and return to Earth on the available return vehicle (currently SpaceX Dragon capsule).",
    "Once the rodents are returned to Earth, dissect all organs and tissues (i.e., liver, kidney, skin, muscles, heart, spleen, eyes, adrenal glands, lungs, and brain) and store at -80 °C or in RNA stabilizing solution.\nFollow the same procedures and timings for all control ground experiments as the flight experiment with a 3–5 day offset to match the ISS telemetry data.\nFrom the preserved tissues isolate RNA, protein, and DNA isolation using standard protocols that are described in detail associated with each dataset on the GeneLab platform (genelab.nasa.gov).\nNOTE: Rodent tissues not utilized by the primary investigator(s) become part of NASA's Institutional Scientific Collection. These samples are stored in Ames Research Center's (ARC) Non-Human Biobank where they are cataloged and made available for request by the science community. Available tissues can be found on the Life Sciences Data Archive Public Website at: https://Lsda.jsc.nasa.gov/Biospecimen.\n4. Generating Omics Data from RNA, DNA, and Protein Extracts\nFrom the extracted macromolecules (RNA, DNA, protein) use standard protocols to generate omics data. These are described in detail in the respective study metadata on GeneLab.\n5. GeneLab Repository and Submitting Data\nNOTE: Space biology related omics data are submitted to the GeneLab Data Repository. GeneLab accepts and hosts space-related omics data funded by multiple space agencies around the world.\nGenerate omics related data that can be hosted on the GeneLab repository.\nSubmit generated data to GeneLab, either when analysis is complete or based on the discretion of the investigator.\nNOTE: Data submitted to other public omics databases are imported and published into the GeneLab repository. GeneLab generated data are curated and published without an embargo period. GeneLab, specifically the Sample Processing Lab, generates data from various spaceflight experiments using optimized extraction protocols and techniques to increase the omics data from spaceflight experiments.",
    "When the data are ready to be submitted, format and transfer the metadata and data to GeneLab with the following method (Supplemental Figure 1):\nUse the ISAcreator tools to define an experimental study and store the metadata.\nNOTE: The ISAcreator tool is available for download with a guided tutorial here38.\nRefer the data listed here39 to understand accepted data types and formats for raw and processed data files.\n\t\t\nTo optimize upload and storage, compress data files.\nTransfer the metadata and raw and/or processed data to GeneLab data curators through the workspace40.\nCreate a username and password and upload the data.\nOnce the data have been uploaded to the workspace, share data to a GeneLab curator.\nNOTE: Detailed steps on how to upload and share files can be found in the Data Submission Guide41.\nEach submission is verified by a curator and published in the GeneLab repository42.\n6. Finding Datasets for Analysis using Search Features on GeneLab\nSearch for different datasets on GeneLab by going to the link (Supplemental Figure 2)38.\nSpecifically related to a previous publication36, search for the following terms: GLDS-21, GLDS-111, GLDS-25, and GLDS-63.\nAccess the GeneLab homepage by clicking on \"GeneLab Data System\" on the left-hand side of the screen.\nEnter the keywords in the \"search data\" box to search for specific areas of interest. In this case enter each of the following dataset identifiers separately: GLDS-21, GLDS-111, GLDS-25, and GLDS-63.\nIn addition to searching the GeneLab repository, search across other databases including NIH GEO, EBI Pride, and ANL MG-RAST by selecting the desired check boxes under the search bar.\nNOTE: Currently only for the GeneLab repository, a user can search by using the following filter categories: Organisms, Assay Type, Factors, and Project Type.\n7. Storing and Transferring Files of Interest for Analysis",
    "NOTE: The GeneLab Workspace is designed to store and transfer files directly from the GeneLab database (Supplemental Figure 3).\nClick on \"Workspace\" on top of the Data Systems menu.\nIf new user, register for a new account.\nNOTE: The GeneLab Workspace is powered by GenomeSpace43.\nAccess detailed instructions on how to use the workspace by selecting \"Help\" on the top menu and clicking on User Guide.\nFor each user, access all the datasets in the GeneLab repository by selecting the \"Public/genelab\" folder on the left-hand menu.\nCopy the datasets of interest to a local directory workspace by going to the folder with the data of interest. Right click on the specific file, select \"copy/move\" in the menu that appears, select the folder to copy the file to, and then click on \"copy\".\nFind the following datasets related to a previous publication36 as instructed above and copy over to the local workspace: GLDS-21, GLDS-111, GLDS-25, and GLDS-63.\n8. Accessing Metadata and Description of Each Study\nNOTE: Metadata files for each dataset in the GeneLab repository are in the \"Public/genelab\" dataset subfolder on the left-side menu.\nFind the metadata information for the dataset of interest by accessing one or more metadata files contained in a \"metadata\" subfolder of each dataset. For example, for GLDS-100, there are 2 files in the \"Public/genelab/GLDS-100/metadata\" subfolder: \"GLDS-100_metadata_RR1_BIOBANK-Eye-ISA.zip\" and \"GLDS-100_metadata_RR1ExpDesign.pdf\".\nEnsure that every dataset has a single zipped file that provides metadata according to the ISATab specification (which subsumes the MIAME, MIAPE, and other MIBBI framework standards for minimum metadata requirements). Always end this type of file name in \"ISA.zip\". For example, for GLDS-100, this file is \"GLDS-100_metadata_RR1_BIOBANK-Eye-ISA.zip\".\nUse the ISACreator tool44 or a text editor to visualize and access the ISATab metadata, which contains the text description for the study and assay metadata for each dataset.",
    "NOTE: Within the ISATab metadata, samples are described and associated with bioassays, and bioassays are described and associated with output data files.\nCheck for the presence of the output assay data files that are located within each dataset in subfolders by type of assay. For example, for GLDS-100, RNA-Seq output assay files are located in the \"Public/genelab/GLDS-100/transcriptomics/\" folder.\n9. Analysis of GeneLab Data\nNOTE: Various pipelines can be implemented for various omics data. Here, the specific example focuses on an unbiased systems biology transcriptomic pipeline which is used to determine the \"key drivers\" of the system being studied.\nCheck previously published literatures36,45,46,47,48,49,50 to understand this pipeline.\nOnce a specific dataset of interest is selected for analysis, download the data to a local machine with the following method:\nClick on the specific dataset.\nClick on the \"Study Files\" tab on the far left of the headers.\nEnsure that all datafiles and metadata are available in this menu.\nTo download each file, click on the specific file names.\nFor the microarray datasets that will be downloaded from GeneLab, use the following pre-processing steps.\nProcess the raw data for each dataset separately using background subtraction and Quantile normalized using RMAExpress51 for the commercial microarrays.\nCreate principle component analysis (PCA) plots using R to determine how closely the biological replicates grouped together.\nImport data into MultiExperiment Viewer52 and calculate significant genes first using the false discovery rate (FDR) statistics starting with FDR < 0.05. If no significant genes appeared with FDR statistics, then use standard t-tests starting with a p-value < 0.05 to determine the significant genes.\nOnce the statistically significant regulated genes have been determined, implement a fold-change cut-off of ≥ 1.2 or ≤ -1.2 to compare the experimental samples with the controls.",
    "Use Gene Set Enrichment Analysis (GSEA)53 for pathway and functional predictions.\nUse GSEA either through GenePattern54,55, directly through GSEA, or using R programming environment.\nDetermine the significantly regulated pathways using the following gene sets: C2, C5, and hallmarks.\nPerform leading-edge analysis on the significantly regulated gene sets and determine leading edge genes associated with each experimental comparison and Gene Set.\nFind the leading-edge genes that overlap between all the gene sets for each experimental condition.\nUse another platform to determine predicted functions and pathways that are being significantly regulated. In this case use ingenuity pathway analysis (IPA) to determine the significant upstream regulators, biofunctions, and canonical pathways.\nUpload the list of genes with fold-change values for the statistically significant genes determined in step 9.4.4.\nFollow IPA's instructions to generate upstream regulators, biofunctions, and canonical pathways for each experimental comparison.\nDetermine the gene associated for upstream regulators, biofunctions, and canonical pathways which have an activation z-score ≥ 2 (indicated activation) or ≤ -2 (indicating inhibition).\nFind the overlapping genes related to all the predictions above.\nDetermine common/overlapping genes between steps 9.4 and 9.5.\nNOTE: These genes are considered as the key/driver genes controlling the majority of the predicted functions and activity with the experimental conditions being analyzed. Previous studies have shown that knocking out or promoting these genes will make the experimental condition or system being studied non-functional45,46,49.\n\t\nConstruct networks through IPA (or any network assembly software) to determine the connectivity of the genes.\nConsider the most connected gene as central hub driving the key genes.\nTo determine the connectivity between the datasets, group all key genes in one network and repeat connectivity test to determine the central hub that is occurring among all key genes from all datasets being analyzed.\n10. Using Galaxy56 Interface on GeneLab to Analyze Transcriptomic Data",
    "NOTE: Here a protocol for using the GeneLab Galaxy interface (available Fall 2018) to analyze transcriptomic data from GeneLab is described. Galaxy tutorials abound. Example tutorials on how to use Galaxy in general are available elesewhere57,58.\nUsers can sign in to GeneLab using Google or NASA credentials. GeneLab Galaxy tools are located under the \"Analyze\" menu.\nFollow these three ways to bring data into the GeneLab Galaxy platform.\nUpload data from the local file system using the \"Upload data\" function.\nImport data from GeneLab GenomeSpace using the GenomeSpace importer tool under \"Get Data\" section.\nNOTE: All GeneLab data files are available in the \"public\" folder, organized by the dataset accession number (see above).\nImport data appear in the \"history\" of analysis section on the right-hand side. Users can have multiple histories, which are managed using either \"History Options\" or \"View All Histories\" buttons at the top of the history pane.\nTools for analysis are listed and searchable on the left side of the interface.\nCheck for the appearance of datasets that have been imported on the current history.\nNOTE: Many details regarding the data are available for inspection for each dataset.\nSelect a tool on the left-hand side to populate a form in the center panel, with options for analysis and specification of data inputs. Create jobs for executing the analysis by completing the form and pressing \"Execute\".\nCheck for jobs submitted which are represented in the history and color-coded to indicate status of execution (queued, executing, completed with or without errors).\nLink the tools into complex workflows. Manage workflows through tools located in the \"Workflows\" menu. Figure 3 shows an example workflow created for processing RNA-seq data.\nShare datasets, workflows, and histories with others using the \"Shared Data\" menu."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}