{
  "id": 18860,
  "origin_website": "Jove",
  "title": "RNAscope for In situ Detection of Transcriptionally Active Human Papillomavirus in Head and Neck Squamous Cell Carcinoma",
  "procedures": [
    "1. Sample, Equipment, and Reagent Preparation\nCut tissue specimen into blocks of 3-4 mm in thickness, fix in fresh 10% neutral-buffered formalin for 16-32 hr at room temperature (25 °C) and embed in paraffin. Cut FFPE into sections of 5±1 µm thickness from FFPE blocks, mount sections on slides and air dry. Note: The slides can be stored at room temperature under desiccation for up to 3 months. The mounted tissue slides should be baked in a dry over at 60 °C for 1 hr prior to the RNAscope assay.\nBring Hybridization Oven to 40 °C. Place a Humidifying Paper in the Humidity Control Tray. Add 50 ml dH2O to the Humidifying Paper to wet it completely. Insert the covered Tray into the Oven to prewarm for at least 30 min before use.\nMake 700 ml 1x Pretreat 2 Solution (10 nl, pH 6 citrate buffer) by diluting 10x Pretreatment Solution in dH2O. Heat the 1x Pretreat 2 Solution to boil and maintain the temperature between 100-104 °C while preventing over-boiling.\nMake 3 L 1x Wash Buffer (0.1x SSC) by diluting prewarmed 50x Wash Buffer in dH2O.\nPrepare 2 x 200 ml of xylene and 2 x 200 ml of 100% EtOH for deparaffinization under a fume hood.\nPrepare 50% Hematoxylin staining solution and bluing reagent (0.01% ammonia water) for post-staining under a fume hood.\nPrepare 200 ml of xylene, 200 ml of 70%, and 2 x 200 ml of 100% EtOH for dehydration under a fume hood.\nPrewarm Target probes at 40 °C for 10 min and bring RTU Detection Kit reagent to room temperature, including RTU Amp1, Amp2, Amp3, Amp4, Amp 5-Brown, and Amp6-Brown, except DAB Chromogen Brown-A and Brown-B.\n2. RNAscope Assay\nDeparaffinization and Dehydration",
    "After baking, deparaffinize tissue sections in xylene for 2 x 5 min with frequent agitation, and dehydrate in 100% EtOH for 2 x 3 min with frequent agitation. Air dry for 5 min and draw a hydrophobic barrier around the tissue section with a Hydrophobic Barrier Pen.\nPretreatments\nIncubate tissue sections with Pretreat 1 for 10 min at RT for quenching of endogenous peroxidase activity, rinse in dH2O.\nIncubate tissue sections with Pretreat 2 maintained at a boiling temperature for 15 min for RNA retrieval, rinse twice in dH2O.\nIncubate tissue sections with Pretreat 3 for 30 min at 40°C for protein digestion in HybEZ oven, rinse twice in dH2O.\nTarget Probe Hybridization\nTarget probes HPV-HR 7 pool include: HPV16, 18, 31, 33, 35, 52, and 58. Add HPV probes, Ubiquitin C (UBC) and bacterial gene dapB probes separately onto three adjacently tissue sections. Hybridize at 40 °C in oven for 2 hr, then rinse in 1x Wash buffer for 2 x 2 min at RT.\nSignal Amplification\nIncubate tissue sections with Amp1 (preamplifier) for 30 min at 40 °C, Amp2 (background reducer) for 15 min at 40 °C, Amp3 (amplifier) for 30 min at 40 °C, and Amp4 (label probe) for 15 min at 40 °C in HybEZ oven. After each hybridization step, rinse in 1x Wash buffer for 2 x 2 min at RT.\nIncubate tissue sections with Amp5 for 30 min and Amp6 for 15 min at RT. After each incubation step, rinse in 1x Wash buffer for 2 x 2 min at RT.\nSignal Detection\nIncubate tissue sections with 1:1 DAB Mixture by mixing equal volume of Brown-A and Brown-B for 10 min at RT, rinse twice in dH2O.\nCounterstaining",
    "Stain tissue sections with 50% Hematoxylin solution for 2 min at RT, rinse with dH2O until slides are clear while tissue remain purple. Dip slides into 0.01% ammonia in dH2O for 5x and followed with 5 dips in dH2O.\nSlide Mounting\nDehydrate tissue sections in 70%, 100%, and 100% EtOH for 2 min each, xylene for 5 min, mount with xylene-based mounting media."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}