{
  "id": 18167,
  "origin_website": "Jove",
  "title": "Gene Regulation and Targeted Therapy in Gastric Cancer Peritoneal Metastasis: Radiological Findings from Dual Energy CT and PET/CT",
  "procedures": [
    "This work was performed in strict accordance with the standards established by the Guidelines for the Care and Use of Laboratory Animals of Shanghai Jiao Tong University and was approved by the laboratory Animal Ethics Committee of Ruijin Hospital.\n1. Gastric Cancer Peritoneal Metastasis Animal Model\nDivide a moderately differentiated SGC-7901 human gastric cancer cell line into an SGC-7901/sFRP1 group and an SGC-7901/vector group. Culture the two groups of cells separately in RPMI 1640 supplemented with 10% fetal bovine serum, 100 units/mL streptomycin, and 100 µg/mL penicillin at 37 °C in a humidified atmosphere with 5% CO2.\nUse 4-6 week-old female athymic BALB/c nude mice with body weights of 25 to 30 g. Place animals under specific pathogen-free conditions in an animal facility.\nDivide mice randomly into the sFPR1 overexpression group and the sFPR1 empty loading group.\n\tNOTE: Each group had ten nude mice; twenty mice were randomly divided into TGF-β1 treatment group and TGF-β1 control group, with up to 5 nude mice per animal cage.\nEstablish the sFPR1-overexpression peritoneal metastasis xenograft models group by administering 150 µL (2 x 106 cells/mL) suspensions of SGC-7901/sFRP1 cells via the abdominal cavity; SGC-7901/vector cells are administered to establish the empty loading group.\n\tNOTE: Use a hemocytometer counting method to determine the concentration of cells20.\nEstablish the peritoneal metastasis xenograft models group by administering 150 µL (2 x 106 cells/mL) suspensions of SGC-7901 cells via the abdominal cavity. Administer the target therapy of TGF-β1 inhibitor SB431542 after a period of two weeks of growth by intraperitoneal injection at a dose of 100 µL/10 g of body weight every other day to mice in the treatment group.\nAdminister normal saline at the same dose to mice in the control group.",
    "Perform the DECT and PET/CT scanning 1 day before treatment and 1 day, 7 days, 14 days, and 21 days after treatment.\n2. DECT for Peritoneal Metastasis Animal Model\nNOTE: The animal imaging experiment was achieved on the dual energy CT scanner (see Table of Materials). We created the related DECT imaging protocol according to the previous studies.\nSetup for DECT imaging protocol\nOn the imaging console computer, select the \"protocol management\" icon to enter the next interface, then click the \"protocol management\" option to view the protocol management screen.\nIn the 'User protocol' interface, select the abdomen area to enter the abdomen protocols list.\nClick the blank space in the protocol lists and select the \"New\" button to type the name of a new protocol: \"Animal DECT Scan\". Press the \"Enter\" key on the keyboard and select the \"Scout\" button in the pop-up window, click \"OK\" to setup the scout series (the first series).\nSelect the \"XY\" mode for 'Anatomical Reference Point' and the \"head-first supine position\" for 'Patient Orientation'. Click on the \"auto transfer\" option and select the workstation location where the image series will be uploaded. Name \"Scout phase\" in Series Description.\nIn the 'View Edit' screen, make sure the relevant scan parameters are set as the following: \"Start location\" and \"End Location\" options are set at \"S50\" and \"I50\" respectively, \"KV\" at \"100\", \"mA\" at \"80\", \"90°\" for \"Lateral scout position\", \"0°\" for \"AP scout position\", and the \"scout WW/WL\" at \"400/40\".\nNext, create the second series for non-enhanced scanning. Click \"Create New Series\", in the pop-up window to select the \"Axial\" and \"Create After\" icons.",
    "Name the series as \"-C phase\" in the Series Description and turn \"Show localizer\" on. In the Scan type interface, select the \"helical\" scan type and 0.5 s for \"Rotation Time\", click \"Thick Speed\" option to set the parameters (Detector Coverage at 40 mm, Helical Thickness at 0.625 mm, Pitch and speed at 0.516:1/20.62, Rotation Time at 0.5 s) in the pop-up window, Interval at 0.625 mm, Gantry Tit at 0, SFOV select Small Body, kV at 100, click \"mA\" then type 600 for Manual mA.\nClick the \"Recon Parameters\" icon and open the \"Recon Option\" pop-up window. Select \"Plus\" in Recon Mode; click the \"Slice\" icon to select \"ss50 slice 50%\" mode in the 'ASiR Setup screen'. Set the remaining parameters as follows: DFOV at 25 cm, R/L and A/P Center at 0 cm, Recon type select \"Stnd\", Matrix Size at 512.\nCreate the third scan series for enhanced scanning by repeating the step 2.1.8, name it as \"+C QC phase\" and turn \"Show localizer\" on; the first group is the setup of arterial phase series.\nIn the 'Scan type' interface, click on \"GSI (Gemstone Spectral Imaging)\" and select \"helical\" scan type, select the protocol \"GSI-52\" in the 'Abdomen GSI Preset Selection' window. Set start Location and end Location according to the non-enhanced scanning.\n\t\t\nClick the \"Recon Parameters\" icon and open the \"Recon Option\" pop-up window. In Recon Mode, select \"Plus\" and in 'GSI option' click \"QC\"; the remaining parameters are the same as in step 2.1.8.",
    "Click the \"R2\" icon and select \"YES\" in the \"Recon enabled\" tab. Select \"Thickness\" at 0.625 and type 0.625 for \"Interval\". Open the \"Recon Option\" pop-up window, in Recon Mode select \"Plus\"; in GSI options, click \"Mono\" and set the keV to 70 keV; in the ASiR Setup window, select the \"GS40 40%\" mode for the GSI ASiR setup. The remaining parameters are set with step 2.1.8. Name this step as \"+C 70keV phase\".\nClick the \"R3\" icon and select \"YES\" in the \"Recon enabled\" tab. Set \"Thickness\" at 1.25 and type 0.625 for \"Interval\". Open the \"Recon Option\" pop-up window, in Recon Mode select \"Plus\" and \"IQ enhanced\"; in the GSI options, click \"Mono\", set the keV to 70 keV and click \"GSI Data File\"; ensure the GSI ASiR setup is in accordance with step 13. The remaining parameters are set as in step 2.1.8. Name this as \"+C Mono phase\".\nClick \"Add group\" to create two scan groups to represent the portal phase and the delay phase, respectively. Make sure that the \"Start Location\" and \"End Location\" ranges of each scan phase are consistent and the remaining parameters are the same as the arterial phase. Type the delay time in \"Preparation Group\": the first group (arterial phase) at 0 s, the second group (portal phase) at 8 s, and the third group (delay phase) at 16 s.\nClick the \"Accept\" option to save the protocol after all the settings are done.\nDECT imaging process\nSelect the nude mice randomly from the treatment and control groups before each scan. Place the selected animals in new cages and mark them separately.\nFast the mice for 4 h with water but without food or bedding.",
    "Remove the experimental mice from the animal experiment center 1 h before the scan, and make sure the mice are placed in a new warm environment until the scan begins.\nAnesthetize all the experimental mice with an intraperitoneal injection of 2.5% pentobarbital sodium (1.0 mL/kg body weight) before DECT scan imaging, and confirm the depth of anesthesia by the toe pinch reflex. Use ointment on the eyes to prevent dryness while under anesthesia.\n\t\tNOTE: Ensure that the head of each nude mouse is in the lower position when injecting the drugs, thus reducing damage to the internal organs. Pay attention to the injection site and the depth of injection. Place the tip of the syringe at a 45° angle to the inside of the right/left lower abdomen, and ensure that the needle depth is such that injection into the bowel and other organs is avoided.\nClick the \"New Patient\" icon, input the basic information about the mouse including its patient ID and name. In the 'User protocol', click the \"abdomen protocol\" and select the \"Animal DECT Scan\" protocol to enter the operation interface.\nOnce anesthesia is induced, move each mouse onto an animal fixture platform in the supine position, and fix its tail with tape to make sure it does not bend. Sterilize the tail with alcohol for subsequent contrast agent injection into the tail-vein.\nMove the CT scan bed so that the external positioning line laser is over the lower abdomen of the animal. Click the \"reset\" button when the positioning is completed.\n\t\tNOTE: The placement of external positioning lines over the lower abdomen of the animal ensures that the animals are located as far as possible on the outside of the machine for easy contrast agent administration into the tail vein.",
    "Click the \"Confirm\" icon and follow the flashing order of the buttons on the keyboard to complete the scout scanning. Select the \"next series\" icon after the scout scanning is completed, and enter the interface for non-enhanced scanning.\nIn the right screen, set the \"Start Location\" and \"End Location\" on the scout views to define the scan range. Maintain the same range in 'Lateral scout' and 'AP scout' and cover the entire body volume of the animal.\nClick the \"Confirm\" icon and follow the flashing order of the buttons on the keyboard to complete the scout scanning.\nInject each mouse with iopamidol at a dosage of 0.2 mL/100 g through the tail vein.\n\t\tNOTE: We chose to administer the contrast medium manually and keep the injection rate as stable as possible. It is most conducive to capture the early enhancement of the tumor during imaging.\nClick \"next series\" to perform enhanced scanning. Set \"Start Location\" and \"End Location\" as per the non-enhanced scan. Click the \"confirm\" icon and follow the flashing order of the buttons on the keyboard to complete the dynamic enhanced scans, includingarterial phase, portal phase, and delayed phase.\n\t\tNOTE: Click the \"Confirm\" icon immediately to start scanning after the contrast agent is injected. This is essential and crucial for enhanced scanning to ensure the best image of the arterial phase is captured. However, some delay time after clicking the \"confirm\" icon can ensure that the experimental staff has withdrawn safely from the scanning room.\nClick \"End exam\" to exit the scanning interface after the scanning is complete; the image series will be automatically uploaded to the workstation.",
    "Place the animal into an empty cage after completion of the scan with all mice, and observe them until they have regained consciousness.Do not leave an animal unattended until it has regained sufficient consciousness to maintain sternal recumbency. Then transfer the mice into a clean animal room.\nPost DECT imaging analysis\nLocate the mice series on the DECT workstationinterface (see Table of Materials) and select the \"+C Mono phase\" series lists. Open \"GSI Volume Viewer\" and select \"GSI VV General\" protocol from the 'GSI Protocol Manager' interface.\nClick the \"View Type\" active annotation at the upper-left corner of the image viewports and select \"coronal\" orientation from the drop-down menu.\nFor one image viewport, click the \"Volume 1\" active annotation at the upper-left corner and select \"Mono\" volumes from the drop-down menu. Similarly, in another image viewport, select \"Iodine (Water)\" volumes. Click and hold the left mouse button, drag the image from \"Iodine (Water)\" viewport to \"Mono\" and check the \"mix the views\" box to get the color fused images.\nClick and drag from the center of the \"Image Scroll\" icon to observe images. Save the images which show positive results as color fused images.\n3. PET/CT for Peritoneal Metastasis Animal Model\nNOTE: See the table of materials for the PET/CT imager used. We created the related PET/CT imaging protocol according to this article21.\nSetup Micro-PET/CT Imaging Protocol",
    "For a whole-body CT scan, set current at 500 µA, voltage at 80 kV, exposure time at 200 ms, and 240 steps for 240° rotation. For X-ray detector, select resolution at \"low system magnification\" with 78 mm axial imaging field and single bed mode. Use the \"Common Cone-Beam Reconstruction\" method and select the \"real time reconstruction\" option, so that the host PC can connect with the dedicated real time reconstruction computer (Cobra) to initiate the task.\nFor PET acquisition, in the \"acquire by time\" option set \"fixed scan time\" to 600 s (10 min). Set \"study isotope\" to F-18 and \"energy level\" to 350-650 keV.\nTo produce the PET Histogram, set the \"dynamic frame\" as \"black\" to process data as one frame for the entire duration to achieve static scan. Set histogram type to \"3D\" and select the \"no scatter correction\" option.\nFor PET reconstruction, reconstruct images using an OSEM3D algorithm followed by MAP or Fast MAP22 provided by PET/CT workstationsoftware (see Table of Materials).\nPreparation before PET/CT imaging\nFast the mice which have undergone DECT experiments for 4 h and transfer the mice to new animal cages 30 min before imaging.\nWeigh the mice and record their weight.\nFollow the institute's safety procedures to acquire and carry the package containing radioactive materials (RAM). Use a protective shield to carry the 18F-FDG (5 mCi), and measure the radioactivity of the total 18F-FDG with a dose calibrator.\nDilute the 18F-FDG with normal saline to the appropriate radioactivity of mice injection.\n\t\tNOTE: The diluted activity of 18F-FDG should be available at 100-200 µCi/100 µL for each mouse.\n\t\t\nDraw 200 µL 18F-FDG solution into a 1 mL syringe. Measure the radioactivity of the whole syringe with a dose calibrator and record the 18F-FDG preparation time.",
    "Inject each mouse with 200 µL 18F-FDG solution via the tail intravenous injection route and record the 18F-FDG injection time. After the injection of all mice, measure the residual radioactivity of the syringe with the dose calibrator immediately and record the time that the measurements were taken after completion of the injection.\nCalculate the injected 18F-FDG activity for each mouse by the following formula: Injected activity (µCi) = activity in syringe before injection - activity in syringe after injection.\nPET/CT Imaging Process\nPut the animal into an anesthesia induction chamber; anesthetize mouse using inhaled 3% Isoflurane in oxygen after the completion of 18F-FDG injection.\n\t\tNOTE: Follow all animal welfare guidelines appropriate for operation; keep the mice warm by using the heating pad. Use ointment on eyes to prevent dryness while under anesthesia.\nOnce anesthesia is induced, move the mouse onto the micro-CT scanning bed while maintaining continuous anesthesia and warming. Position the head of the mouse within a cone face mask that continuously delivers Isoflurane (2%) in oxygen at a flow rate of 2 L/min. Place the mouse in supine position to ensure the posture is consistent with that in DECT scans.\nMove the animal to the entrance of the PET/CT scanner, click the \"laser\" icon from the toolbar viewer, and use the touchpad control interface to move the bed so that the abdomen of the mouse is located at the center of the PET and CT field-of-view (FOV) during scanning. In the \"Laser Align\" window, select \"first scan type\" as \"CT scan\", and \"PET acquisition included in workflow\" as the option.\nOpen the \"Scout View\" window and acquire a scout view X-ray radiograph. Adjust the position of the animal bed so that the center field of view of the CT is located at the center of the mouse body.",
    "Select the protocol established previously (in step 3.1). Input the number of mice to be imaged (successively) in the pop-up window and click the \"Setup\" option, then enter the weight. Then click the \"Setup\" option again and follow the pop-up window instructions to complete the setup.\nClick the \"Start Workflow\" icon to start scanning.\nEvaluate the quality of the acquired CT and PET images after all the scans are completed. Transfer the data through the network to the post imaging analysis for further study.\n\t\tNOTE: Adjust the window width and window level of the image to ensure that the contrast of the organs is displayed properly. Check the resolution of the organs in the images to confirm the imaging quality.\nRemove the animal from the imager and immediately euthanize by cervical dislocation. Use the imaging system for the next animal successively.\nPost PET/CT imaging analysis\nOpen the PET/CT workstation software, import the CT and PET image series data into the software. In the \"Registration\" window, click the \"General analysis\" option to register CT and PET images together, and choose the \"Sky\" model under the \"Review\" window to show a perfect alignment between CT and PET images.\nIdentify the peritoneal nodules with references provided by the co-registered images in the \"Region of Interest (ROI) Quantification\" window.\nIn the \"Region of Interest (ROI) Quantification\" window, draw ROI with tools over the fused images, edit the size and shape of ROI, record the SUVmax value, then output and save the selected merged images.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}