{
  "id": 13464,
  "origin_website": "Jove",
  "title": "Immuno-fluorescent Labeling of Microtubules and Centrosomal Proteins in Ex Vivo Intestinal Tissue and 3D In Vitro Intestinal Organoids",
  "procedures": [
    "All methods described here were performed according to the University of East Anglia's institutional license guidelines.\n1. Isolation of Intestinal Tissue\nIsolation of colonic crypts for immuno-labeling (see Figure 1, schematic)\nEuthanize the mouse (using CO2 asphyxiation) and remove the colon (beginning at the caecum and extracting caudally) with dissecting scissors and tweezers14.\nFlush the content of the colon with phosphate buffered saline (PBS) using a glass pipette with rubber bulb. PBS: sodium chloride (8.0 g/L), potassium chloride (0.2 g/L), disodium hydrogen phosphate (1.15 g/L), and potassium dihydrogen phosphate (0.2 g/L), at pH 7.3.\nUsing a metal rod (2.4 mm diameter) or the end of a glass pipette, hold one end of the colonic tube while gently sliding the tissue over the rod/pipette thus everting the colonic tissue so that the epithelium is now on the outside.\n\t\tNOTE: If this is not possible then open the colon with scissors and slice into 5 mm pieces.\nTransfer the everted colon or pieces to a 50 mL conical tube containing 40 mL of PBS.\nInvert the tube several times to further remove intestinal contents, mucus, etc.\nTransfer the colon/pieces to 40 mL of 3 mM EDTA in PBS and incubate at room temperature (RT) for 15 min.\n\t\tNOTE: Dilute 0.5 M EDTA pH 8.0 stock with PBS.\nShake to remove the mucus and transfer the colon/pieces to a 50 mL conical tube containing fresh 40 mL of 3 mM EDTA in PBS. Incubate for 35 min at RT.\nTransfer the colon/pieces to 10 mL of PBS in a 50 mL conical tube and shake vigorously for 30 s to release crypts (crypt fraction).",
    "Remove the colon/pieces from the tube and place back into 3 mM EDTA in case further isolation is required. Centrifuge the remaining crypt fraction at 300 x g for 5 min.\nRemove 5 mL of the supernatant and resuspend the crypt pellet in the remaining 5 mL volume.\nObserve under a stereomicroscope with zoom (50 - 100X magnification) to check for presence of colonic crypts.\n\t\tNOTE: If there are no crypts present then incubate the colon/pieces in 3 mM EDTA in PBS for another 30 min and then repeat steps 1.1.8 - 1.1.11.\nCentrifuge the crypt fraction at 300 x g for 5 min.\nRemove all supernatant to obtain a crypt pellet and proceed immediately to fixation (Section 3).\nIsolation of small intestinal crypts and villi for immuno-labeling (Figure 2)\nEuthanize mouse (using CO2 asphyxiation) and remove the small intestine (proximal duodenum to terminal ileum) with dissecting scissors and tweezers14.\n\t\tNOTE: To view different sections of the small intestine then at this stage separate and treat separately. See Figure 1 and Table 1 for a flow diagram and timings.\nFlush the contents of the small intestine with PBS using a glass pipette with rubber bulb.\nCut open the small intestine with dissecting scissors and place in 15 mL PBS in a Petri dish.\nGently wash the intestine in PBS to remove luminal content while not damaging the mucosal surface. Transfer the tissue to a fresh Petri dish and repeat PBS wash.\nCut the intestine into 3-5 mm pieces and transfer to a 100 mm Petri dish containing 15 mL of 30 mM EDTA in PBS and incubate for 5 min at RT. Alternatively incubate in 3 mM EDTA in PBS for 30 min.",
    "Fraction 1 (Villi isolation): Transfer the intestinal pieces into 10 mL of PBS in a 50 mL conical tube, shake vigorously for 10 s, and pour into a 100 mm Petri dish. Check the fraction for isolated villi under a stereomicroscope. At this stage, mostly villi should be present but this can vary between isolations.\n\t\tNOTE: To prevent isolated villi/crypts sticking to the plastic, Petri dishes and collection tubes should be pre-coated with Fetal Bovine Serum (FBS). Pour FBS into dishes and/or tubes and immediately remove it. See Table 1 for timing guides for each fraction.\nTransfer the intestinal pieces back into 30 mM EDTA in PBS and incubate for 5 min. During this incubation, collect Fraction 1 in a 15 mL conical tube (precoated with FBS) and centrifuge at 300 x g for 5 min.\nFraction 2: Transfer intestinal pieces to a 50 mL conical tube containing 10 mL of PBS, shake vigorously for 20 s, and then pour into a 100 mm Petri dish. Check the fraction under the microscope. Typically, at this stage a mixed culture of villi and crypts are present (Figure 2A).\nTransfer intestinal pieces back into 30 mM EDTA in PBS and incubate for a further 5 min. During this incubation, pellet Fraction 2 in a 15 mL conical tube (precoated with FBS) at 300 x g for 5 min. Remove supernatant from Fractions 1 and 2 without disturbing the pellet and proceed immediately to fixation (step 3).\nFraction 3 (Crypt isolation): Transfer the intestinal pieces into 10 mL of PBS in 50 mL tube, shake for 20 s, and pour into a 100 mm Petri dish. Check fraction under the microscope. At this stage, the fraction will contain predominantly crypts (Figure 2B).",
    "Fraction 4: Transfer the intestinal pieces into 10 mL of PBS, shake for 20 s, and pour into a 100 mm Petri dish. Check fraction under the microscope. At this stage only crypts should be present.\nFraction 5: Transfer the intestinal pieces into 10 mL of PBS, shake for 20 s, and pour into a 100 mm Petri dish. Check fraction under the microscope. Usually, at this stage, very few crypts are extracted. If more than a few crypts are extracted, then continue with a 6th fraction.\n\t\tNOTE: If a pure crypt population is desired (for example, for organoid generation), then use a 70 µm cell strainer to remove any intact villi from the crypt-enriched fraction.\nCollect Fractions 3 - 5 in separate 15 mL conical tubes and centrifuge at 300 x g for 5 min.\nCheck the pellets of Fractions 3 - 5 and remove the supernatants without disturbing the pellets, and proceed immediately to fixation (Section 3).\n2. Isolation of Intestinal Organoids from Basement Matrix Domes in 24-well Plates\nNOTE: The formation of organoids within basement matrix domes has been described elsewhere12.\nCoat wells with basement matrix dome according to the manufacturer's instructions.\nWash wells containing basement matrix domes with 500 µL of PBS.\nAdd cold 250 µL of cell recovery solution (4 °C) to each well (see Table of Materials).\n\tNOTE: The cold cell recovery solution will depolymerize all but stable microtubules.\nScrape the basement matrix domes using a P1000 micropipette and carefully pipette up and down throughout the well to breakup and remove the basement matrix from plastic.\nCollect the supernatant in 1.5 mL low binding microcentrifuge tubes.",
    "Invert the 1.5 mL low binding tube several times and check under the microscope whether the organoids have been isolated and are free moving and not in clumps. Hold the tube under a stereomicroscope and view under low (50X) magnification.\nPellet the organoids by centrifugation at 1,000 x g for 5 min at RT.\nRemove the recovery reagent and proceed immediately to fixation (step 3).\n3. Fixation of Isolated Intestinal Tissue and Organoids\nMethanol fixation\nResuspend the isolated intestinal crypt/villus fraction in 10 mL and organoids in 1 mL of methanol at -20 °C.\nIncubate the crypts/villi/organoids at -20 °C in a freezer for 15 min and invert the tube(s) every 5 min.\nPellet the crypts/villi/organoids by centrifugation at 1,000 x g for 5 min.\nRemove the methanol and add washing solution (1 mL for organoids and 10 mL for isolated crypt/villus fractions). The washing solution may either consist of PBS with 1% serum or PBS with 0.1% detergent and 1% serum.\n\t\tNOTE: Use serum from the same species as that of the secondary antibodies. For example, if the secondary antibodies were generated in goat then use goat serum.\nImmediately, centrifuge the crypts/villi/organoids at 1,000 x g for 5 min to pellet.\nRemove the washing solution and resuspend the crypts/villi/organoids in fresh washing solution.\nPlace on a tube rotator with the speed set to 20 rpm. Wash the cells for a total of 1 h, pelleting the crypts/villi/organoids by centrifugation (1,000 x g for 5 min) every 15 min and replacing the wash solution.\n\t\tNOTE: If a tube rotator is not available then invert the tubes manually every 5 min to resuspend the isolated cultures.\nFormaldehyde/methanol fixation\n\tNOTE: Handle the fixatives and formaldehyde in a fume hood.",
    "Resuspend the isolated crypts/villi in 10 mL or organoids in 1 mL of -20 °C fixative solution (9.2 mL of methanol with 800 µL of formaldehyde solution).\nFix the crypts/villi/organoids at -20 °C in a freezer for 15 min and invert the tube every 5 min.\nPellet the crypts/villi/organoids by centrifugation at 1,000 x g for 5 min.\nRemove the formaldehyde/methanol and add washing solution (1 mL for organoids or 10 mL for isolated crypts/villus fractions). The washing solution may either consist of PBS with 1% goat serum or PBS with 0.1% detergent and 1% serum.\nCentrifuge at 1,000 x g for 5 min to pellet the crypts/villi/organoids.\nRemove the washing solution and resuspend in fresh washing solution.\nPlace on a tube rotator with the speed set to 20 rpm. Wash the cells for a total of 1 h, pelleting the crypts/villi/organoids by centrifugation (1,000 x g for 5 min) every 15 min and replacing the wash solution.\nPFA fixation\n\tCAUTION: PFA powder and solutions should be handled in a fume hood.\n\tNOTE: In most cases 4% PFA in PBS is used but depending on preservation of antibody antigenicity, lower concentrations may be used.\n\t\nResuspend the isolated pelleted crypts/villi in 10 mL 4% PFA and incubate at RT for 1 h, and the isolated pelleted organoids in 1 mL 4% PFA and incubate for 30 min. In both cases invert the tube(s) every 10 min.\nPellet the crypts/villi/organoids by centrifugation at 1,000 x g for 5 min.\nRemove the PFA and add washing solution (1 mL for organoids and 10 mL for isolated crypts/villi). The washing solution consists of PBS with 0.1% detergent and 1% serum.\nCentrifuge at 1,000 x g for 5 min to pellet crypts/villi/organoids.\nRemove the washing solution and resuspend in fresh washing solution.",
    "Place on a tube rotator with speed set to 20 rpm. Wash the cells for a total of 1 h, pelleting the crypts/villi/organoids by centrifugation (1,000 x g for 5 min) every 15 min and replacing the wash solution.\n\t\tNOTE: If a tube rotator is not available then invert tubes manually every 5 min to resuspend the isolated cultures.\nAntigen Retrieval (optional step recommended for PFA fixation)\n\t\t\nPellet the crypts/villi/organoids by centrifugation at 1,000 x g for 5 min and remove the supernatant.\nAdd 1 - 10 mL of 10 mM sodium citrate pH 6.0 (pre-warmed to 80 °C) and incubate at 80 °C for 20 min.\nPellet the crypts/villi/organoids by centrifugation at 1,000 x g for 5 min and remove the supernatant.\nAdd 1 - 10 mL of fresh 10 mM sodium citrate pH 6.0 (pre-warmed to 80 °C) and incubate at RT for 20 min.\nPellet the crypts/villi/organoids by centrifugation at 1,000 x g for 5 min and remove the supernatant.\nWash in 1 - 10 mL PBS with 1% serum and repeat a further 3 times pelleting the crypts/villi/organoids by centrifugation (1,000 x g for 5 min) before adding fresh wash solution.\n4. Blocking Step\nMake the blocking solution: add 10% secondary antibody species serum in PBS (optional: add 0.1% detergent).\nPellet the crypts/villi/organoids by centrifugation (1,000 x g for 5 min) and remove the supernatant.\nAdd 5 - 10 mL of the blocking solution depending on number of samples required (see note below). At this stage, split the crypts/villi/organoids solution into individual tubes (1.5 mL low binding microcentrifuge tubes with each tube containing 0.2 - 1 mL) for staining with the different antibodies.",
    "NOTE: Each isolated crypts/villi fraction will give between 5 - 10 samples that can be used for different labeling combinations depending on the size of the pellet. Ideally, a pellet size between 2 - 4 mm is required for each sample. Different fractions can be combined at this stage as crypts and villi can easily be identified (Figure 2).\nIncubate in blocking solution at RT on a tube rotator for 1 h.\n5. Primary Antibody Incubation\nDilute the primary antibodies (see Table of Materials) in PBS containing 10% serum and 0.1% detergent. Between 100 to 200 µL primary antibody solution is required per microcentrifuge tube sample.\nRemove the blocking solution by centrifugation (1,000 x g for 5 min).\nResuspend the crypts/villi/organoid pellet in the primary antibody solution and incubate at 4 °C overnight using a tube rotator (20 RPM) to keep the crypts/villi/organoids in suspension.\nNext day: Bring the samples back to RT for 1 h on tube rotator (20 rpm).\nPellet the sample by centrifugation (1,000 x g for 5 min) and remove the primary antibody solution.\nAdd 1 mL of washing solution and resuspend the crypt/villus/organoid pellets.\nImmediately remove the solution by centrifugation (1,000 x g for 5 min).\nAdd 1 mL fresh wash solution and spin the cells on a tube rotator (20 rpm) for 2 hours. Change the wash solution by centrifugation every 30 min as in step 5.7.\n6. Secondary Antibody Incubation\nDilute the secondary antibodies (see Table of Materials) in PBS with 10% serum and 0.1% detergent. About 200 µL of secondary antibody solution is required per microcentrifuge tube sample.\n\tNOTE: Highly cross-absorbed antibodies should be used to reduce reactivity of secondary antibodies in mouse crypt/villus/organoid.",
    "Centrifuge at 1,000 x g for 5 min to pellet the crypts/villi/organoids and resuspend the pellets in 200 µL of secondary antibody solution.\nSpin the tubes on a tube rotator (20 rpm) at RT for 1 h.\nCentrifuge at 1,000 x g for 5 min to pellet the crypts/villi/organoids and remove the supernatants (non-bound secondary antibodies).\nResuspend the pellet in wash solution and immediately centrifuge at 1,000 x g for 5 min to pellet the crypts/villi/organoids.\nRemove the supernatant and resuspend the pellet in 1 mL of fresh wash solution.\nSpin on a tube rotator (20 rpm) at RT for 1.5 - 2 h, changing the wash solution every 20 - 30 min as described previously in steps 6.3 - 6.6.\n7. Nuclear Stain\nDilute the nuclear stain in wash solution (as per the manufacturer's protocol), such as DAPI or Hoechst. For example: DAPI stock solution (20 mg/mL) is diluted 1:10,000. The stock solution can be kept in aliquots at -20 °C.\nCentrifuge at 1,000 x g for 5 min to pellet the crypts/villi/organoids and remove washing solution.\nResuspend the pellet in nuclear counterstain solution.\nSpin on a tube rotator (20 rpm) at RT for 10 min.\nCentrifuge at 1,000 x g for 5 min to pellet the crypts/villi/organoids, remove the nuclear stain solution, and resuspend the pellet in wash solution.\nSpin on a tube rotator (20 rpm) at RT for 30 - 60 min, changing the wash solution every 10 min.\n8. Mounting Isolated Crypts, Villi, and Organoids\nCentrifuge at 1,000 x g for 5 min to pellet the crypts/villi/organoids and remove all the wash solution.\n\tNOTE: If the pellet disperses, then centrifuge again.\nAdd 2 drops of hard setting mounting media with antifade agent to the pellet.",
    "Cut the end of a P200 micropipette and carefully resuspend the pellet in the mounting media. Avoid generating bubbles.\n\tNOTE: The isolated organoid cultures are very sticky; make sure to resuspend fully.\nUse the micropipette to transfer the mixture of crypts/villi/organoids in the mounting media solution, and dispense in a line along the center of a microscope slide.\n\tNOTE: The line should not be longer than the cover-glass that is to be used. Check using a stereomicroscope whether the crypts/villi/organoids are well spread on slide and not clumped.\nCarefully place a cover-glass over the top; avoid generating bubbles.\nPlace the glass slide in a slide book and store in a fridge overnight for the mounting media to set before analyzing on a confocal microscope.\n\tNOTE: For mouse antibody staining in mouse tissue, use the commercial immunofluorescence kit (see Table of Materials). Replace the blocking step (Section 4) with a 10 min block with protein blocking solution followed by a 1 h incubation with the blocking reagent that comes with the kit. Then at step 5.8 (in the middle of washing) add a 1 h incubation with fluorescence signal enhancer reagent. Then use the kit's reagent in fluorescent dilutant (other secondary antibodies can also be used in combination with this reagent). Incubate as above and proceed from step 6 with the rest of the protocol.\n9. Fixation and Immuno-labeling of Organoids Within Basement Matrix\nNOTE: Organoids destined for fixation and immuno-labeling while remaining within the basement matrix were generated in basement matrix domes on top of round glass coverslips in a 24-well plate (one dome per well). The organoid basement matrix domes were processed within the 24-well plate by the addition and removal of the various solutions.\nRemove the medium from wells and add the fixative; leave for 1 h.",
    "Remove the fixative and wash in PBS containing 1% serum and 0.1% detergent for 2 h, changing every 30 min.\nRemove the wash solution and block in PBS with 10% serum and 0.1% detergent for 1 h.\nDilute the antibodies in PBS with 1% serum or PBS with 1% serum and 0.1% detergent.\nRemove the blocking solution and add 100 - 200 μL primary antibody (see Table of Materials) solution to each well.\n\tNOTE: it is important to remove all the blocking solution so as not to dilute antibodies further.\nPlace plate in the fridge and incubate overnight at 4 °C\nThen leave at RT for 1 - 2 h.\nRemove the antibody solution and wash for 2 - 3 h changing the wash solution every 20 min.\nRemove all wash solution and add 100 - 200 μL secondary antibodies diluted (see Table of Materials) in PBS with 1% serum; incubate for 1 h at RT.\nRemove the secondary antibody solution and wash for 2 h, changing every 20 min.\nRemove the wash solution and add DAPI solution; leave for 10 min at RT. Use DAPI stock solution (20 mg/mL) diluted at 1:10,000. The stock solution can be kept in aliquots at -20 °C.\nRemove the DAPI solution and wash for 40 min, changing every 10 min.\nUsing forceps, remove the glass coverslip with the basement matrix dome and place on a slide with the basement matrix dome facing upwards; add a few drops of mounting media and then put a glass coverslip on top.\nPlace the glass-slide in a slide book and leave in fridge overnight for the mounting media to set."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}