{
  "id": 13300,
  "origin_website": "Jove",
  "title": "Hemogenic Endothelium Differentiation from Human Pluripotent Stem Cells in A Feeder- and Xeno-free Defined Condition",
  "procedures": [
    "1. Reagents\nCell lines (human PSCs): obtain either embryonic stem cells (ESCs) or iPSC lines 409B2 and 201B7(317-9)) and CBA11.\nReagent preparation\nPSC plating medium: mix PSC maintenance medium with 10 µM Y-27632 and store at 4 °C.\nPSC Spheroid tiling medium: mix PSC maintenance medium with 625–1,250 ng/mL human recombinant Laminin-511 E8 fragment (LM511-E8)(depending on cell line) just prior to use.\nNOTE: LM511-E8 can be mixed in media15. Other matrix such as full-length laminin-511 needs to be pre-coated, and even did so, they do not sustain mesodermal organoids adhered during differentiation process.\nDay 0 differentiation medium: mix Mesodermal basal medium with 2 µM CHIR99021, 80 ng/mL Bone morphogenetic protein 4 (BMP4) and 80 ng/mL Vascular endothelial growth factor (VEGF).\nDay 2 differentiation medium: mix Hemogenic basal medium with 1 µM SB431542, 80 ng/mL VEGF and 100 ng/mL Stem cell factor (SCF).\nPrepare phosphate buffer saline (PBS) without calcium or magnesium (See Table of Materials).\n1 mM ethylenediaminetetraacetic acid (EDTA) buffer: add 1 mL of 0.5 M EDTA to 500 mL of PBS.\nEHT medium: mix Hematopoietic basal medium with 50 ng/mL SCF, 20 ng/mL thrombopoietin (TPO), 50 ng/mL Fms-related tyrosine kinase 3 ligand (Flt-3L), 20 ng/mL Interleukin-6/Interleukin-6 receptor alpha (IL-6/IL-6Rα), insulin-transferrin-selenium-ethanolamine, L-glutamine and Penicillin/Streptomycin/Amphotericin B.\nFACS buffer: mix PBS with 2% fetal calf serum and 1 mM EDTA.\nPrepare magnetic separation buffer (See Table of Materials).\nPrepare methylcellulose-based media (See Table of Materials).\n2. PSC Colony Formation\nGrow hPSCs to 70 – 80% confluency on a 0.5 µg cm-2 LM511-E8-coated 6-well plate in mTeSR1 in a 37 °C incubator with 5% CO2.\nPSC dissociation (Day -4)\nAspirate the medium and wash the cells with PBS twice. Rinse the cells with dissociation solution. Incubate at 37 °C for 15 min (cells will not desiccate in this time).",
    "Suspend the cells in PSC maintenance medium, transfer the suspension to an appropriately sized tube and centrifuge the cells at 200 x g for 3 min. Aspirate the supernatant and suspend the cells in PSC plating medium.\nPlate the PSC suspension at a density of 48,000 – 70,000 cells cm-2 (depending on the cell line) onto a micro-fabricated plastic vessel and incubate overnight in the 37 °C incubator with 5% CO2.\nNOTE: We recommend 100 μL well-1 of cell suspension in a 96-well micro-fabricated plastic vessel. You will typically seed 20,000 cells well-1 in a 96-well plate to yield approximately 100 spheroids.\nTiling PSC spheroids on LM511-E8 (Day -3)\nCollect the PSC spheroids in a 15 mL conical tube by gently pipetting using P1000 micropipetter and leave the spheroids to stand at room temperature for 2 min to precipitate by gravity. Aspirate the supernatant.\nSuspend in spheroid plating medium, dispense the suspension into a non-coated 6-well culture plate at a density of 4-spheroids cm-2 and culture in the 37 °C incubator with 5% CO2 for three days.\n3. Hemogenic Induction (Day 0)\nAspirate the medium, add Day0 differentiation medium and culture in the 37 °C incubator with 5% O2 and 5% CO2 (hypoxic incubator).\nAfter two days of culture in Day0 differentiation medium, aspirate the medium, then add Day2 differentiation medium and culture in the hypoxic incubator.\n4. Isolation of Hemogenic Endothelium (Day 4)\nTwo days later, aspirate the medium and wash the cells with PBS twice. Rinse the cells with dissociation solution. Incubate in the 37 °C incubator with 5% CO2 for 30 min.",
    "Gently suspend the cells in 1 mM EDTA to dissociate to the single-cell level, transfer the suspension into a 50 mL conical tube and centrifuge the cells at 200 x g for 3 min. Aspirate the supernatant and suspend the cell pellet with 300 µL of magnetic separation buffer.\nAdd 100 µL of CD34+ microbeads and gently pipet. Incubate for 30 min at room temperature. Up to 20 million cells per 100 μL CD34+ beads can be used.\nFilter the suspension through a 40 µm cell strainer.\nSeparate the CD34+ cells using a magnetic separator.\n5. Induction of Endothelial-to-hematopoietic Transition (EHT)\nFibronectin coating\nPrepare the required volume of 5 µg/mL fibronectin-coating solution by diluting 1 mg/mL fibronectin in PBS.\nDispense 0.5 mL of the coating solution into each well of a 24-well culture plate. Incubate the plate at room temperature for 30 min.\nCentrifuge the sorted CD34+ cells at 200 x g for 3 min. Resuspend the cell pellet in 1 mL of EHT medium.\nDetermine the viable cell density with the cell counter. Adjust the cell density to 200,000 cells mL-1 by adding EHT medium.\nAspirate and discard the coating solution from the fibronectin-coated well. Dispense 0.5 mL of CD34+ cell suspension into each fibronectin-coated well.\nIncubate in the hypoxic incubator for one week.\n6. Flow Cytometry Analysis of Hematopoietic Cells\nFloating cell collection: Transfer the culture medium to a 15 mL conical tube. Centrifuge the medium at 200 x g for 3 min. Aspirate the supernatant.\nAdherent cell collection\nWash the cells with 0.5 mL of PBS twice.\nRinse the cells with dissociating solution and aspirate the surplus liquid.\nIncubate the plate in the 37 °C incubator for 5 min.\nResuspend the cells in 1 mL of FACS buffer.\nMix the floating cells and adherent cells.",
    "Centrifuge the cells at 200 x g for 3 min. Aspirate the supernatant. Resuspend in 50 µL of FACS buffer. Incubate the cells with anti-CD34 and anti-CD45 antibodies for 1 h at room temperature in the dark.\nWash the cells with PBS twice and centrifuge at 200 x g for 3 min. Aspirate the supernatant and resuspend in 0.5 mL of FACS buffer with 0.5 µg/mL 4',6-diamidino-2-phenylindole.\nMeasure CD34 and CD45 expression by flow cytometer.\n7. Colony Forming Unit (CFU) Assay of Hematopoietic Cells\nHematopoietic cell collection: Transfer the medium from the culture to a 15 mL conical tube. Gently rinse the well twice with PBS.\nCentrifuge the cells at 200 x g for 3 min. Aspirate the supernatant. Resuspend in 1 mL of EHT medium. Determine cell number with the cell counter.\nAdd a suspension volume equivalent of 10,000 cells to 3 mL of methylcellulose-based media supplemented with antibiotics and mix well 5 times with a 16 G or 18 G syringe.\nDispense the whole methylcellulose-based media suspension into each well of a 6-well plate.\nIncubate in the 37 °C incubator with 5% CO2 for two weeks while keeping moist. Do not disturb the dish. Colonies are motion-sensitive.\nAfter two weeks, count the colonies under a microscope."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}