{
  "id": 4455,
  "origin_website": "Bio",
  "title": "Endolysin Expression, Purification and Activity Determination by Zymography",
  "procedures": [
    "Construction of IPTG-inducible 6x His-tagged recombinant endolysin expression systemThe open reading frame of the putative endolysin is cloned into the vector pET28-a (+) using the unique NcoI (C-terminal 6x His tag) or NdeI (N-terminal 6x His tag) and XhoI restriction sites by standard molecular cloning methods. The resultant plasmid should encode a recombinant protein incorporating a terminal 6x His tag driven by a T7-based promoter (Note 1). Transform the resultant expression plasmid into E. coli BL21 (DE3) cells, to create an IPTG-inducible 6x His tagged endolysin expression system (Note 2).Native batch purification of 6x His tagged protein from E. coli Grow culture of BL21 (DE3) containing the expression plasmid in 10 ml LB containing appropriate antibiotic at 37 °C.Inoculate starter culture into 100 ml LB containing appropriate antibiotic in 250 ml culture flask to an optical density at 600 nm (OD600) of ~0.01 to 0.05. Incubate at 37 °C with shaking (200 rpm) to an OD600 of 0.5. Induce expression by addition of IPTG to 1 mM, shift culture to 30 °C (optional) and incubate for 4 h (200 rpm) (Notes 3 and 4).Harvest cells by centrifugation at 3,500 rcf at 4 °C and resuspend pellet in 2 to 5 ml lysis buffer.Lyse cells by passing through a French press at 900 psi, alternatively use sonicator. Clear lysate by centrifugation 16,000 rcf for 10 min and collect supernatant.Note: A French press should only be operated by trained personnel. Ensure that maximum pressure for cell is not exceeded.Add 1 to 3 ml Ni-NTA agarose to an empty gravity protein column. Wash with three column volumes of lysis buffer to equilibrate beads.Load cleared supernatant on column (see Figure 1), and allow to drain, collecting flow through. Wash with 5 column-volumes of lysis buffer.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140816/20140816221004_4835.jpgFigure 1. Column for Ni-NTA affinity purification.",
    "Gravity column for affinity purification using Ni-NTA agarose. Flow is controlled by clamping the short rubber tube on bottom of column. (The Ni-NTA agarose is stored in a solution of 20% ethanol.)Elute protein with ten 0.5 to 1 ml aliquots lysis buffer supplemented with 450 mM imidazole (final concentration), collecting each fraction (Note 5).Run a standard SDS-PAGE gel containing crude lysate, cleared lysate, flowthrough, wash and eluates (typically 5 μl). Stain gel using Coomassie brilliant blue and destain using water or Destain solution.Pool eluate fractions containing pure protein.Note: This step is required to determine the purity of isolated protein. The eluate should contain a single band of predicted size. Presence of several bands requires optimization of binding or wash conditions, or could indicate proteolysis of the protein. Gels can be rapidly stained and destained by heating in microwave, taking care to avoid boiling.Isolation of crude peptidoglycan from R. capsulatus Inoculate R. capsulatus into 1 L capped (roux or tissue culture) flat bottles filled with YPS medium.Incubate photoheterotrophically at 30 °C with illumination until stationary phase (2 to 3 days) (Note 6). Harvest cells by centrifugation at 6,800 rcf and resuspend cell pellet in 100 ml 4% SDS in water.Boil suspension vigorously in heat-resistant glass flask by holding flask over Bunsen burner for 15 min, swirling occasionally. Keep beaker at hand.Note: If suspension starts to foam and threaten to flow out of flask, move flask into beaker to collect and contain any spill. Wear appropriate safety equipment (goggles, gloves and lab coat advised as minimum).Cool cell suspension, centrifuge at 10,000 rcf for 10 min. Gently decant supernatant.Wash pellet 5 times by resuspending in 10 ml dH2O followed by centrifugation (10,000 rcf 10 min). Resuspend pellet in a small volume dH2O (~3 ml).",
    "Note: Crude peptidoglycan can be stored at 4 °C until use.To estimate mass of purified peptidoglycan material, dry material in pre-weighted microcentrifuge tubes using a vacuum concentrator. Resuspend material in small volume dH2O.Zymography of endolysin - protein separationPrepare SDS-PAGE zymogram by incorporating 5% (w/v) peptidoglycan into a standard 12% SDS-PAGE separating layer mixture before pouring into gel casting apparatus assembled according to manufacturer’s instructions. Overlay with 2-propanol and allow to set (20-40 min). Rinse 2-propanol off with dH2O, then overlay with standard 4% SDS-PAGE stacking layer and insert well-comb. Allow to set (20 - 40 min).Prepare (dilutions) of sample(s) by mixing with Laemmli loading buffer (5 μl Laemmli buffer per 10 μl sample).Briefly denature proteins by boiling for 5 min.Note: It is advisable to perform an initial titration of denaturation temperature (and time) required for the protein to enter gel. Extensive heating (boiling) may prevent efficient protein re-folding required for the functional assay.Load samples on gel and separate at 120 V until markers are sufficiently separated (~2 h). Dissemble gel apparatus, discard stacking layer.Zymography of endolysin - enzymatic assayTransfer resolving gel to plastic container, rinse extensively with dH2O to remove SDS-PAGE running buffer (Note 7). Renature proteins by washing gel twice in 5% Triton X-100 (v/v) in dH2O for 20 min with gentle shaking.For the enzymatic assay, decant Triton-X solution from gel and incubate the gel overnight (see Note 9) in 100 mM phosphate buffer at 30 °C or 37 °C with gentle shaking.To visualize, stain gels with Coomassie brilliant blue until bright blue. Destain using destain solution (Note 8).Enzyme activity is visible as a clearing against a blue background (see Figure 2).Note: Clearing should only be observed at the correct molecular weight of the protein in samples of purified protein or crude lysate of cells expressing protein.",
    "Activity should be absent in crude lysate of empty vector-control strains.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140816/20140816221018_1335.jpgFigure 2. Zymograms of muralytic proteins. A. The endolysin 555 from R. capsulatus required for RcGTA release. Zymogram of E. coli total cell lysate (lane 1) and purified protein (lane 2), and SDS-PAGE gel of purified protein (lane 3). B. The muralytic enzyme P14 encoded in the RcGTA gene cluster. E. coli total cell lysate of empty vector control (-) and P14-expressing vector (+). Panel A is Copyright © American Society for Microbiology, Journal of Bacteriology, 195(22), 2013, p. 5025 - 5040 and DOI: 10.1128/JB.00669-13 and reused with permission from Reference 4. Panel B is adapted from Reference 1 in accordance with the Creative Commons Attribution License[href=http://creativecommons.org/licenses/by/2.5/] (CC BY)."
  ],
  "subjectAreas": [
    "Microbiology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}