{
  "id": 1647,
  "origin_website": "Cell",
  "title": "Protocol for measuring NLRC4 inflammasome activation and pyroptosis in murine bone-marrow-derived macrophages",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nTiming: 3 days for step 1\nTiming: 24 h for step 2\nTiming: 1 h for step 3\nTiming: 15 min for step 4\nTiming: 24 h for step 5\nTiming: 24 h for step 6\nPrepare S. Typhimurium for infection This step describes the details to prepare the log-phase S. Typhimurium for activating NLRC4 inflammasome in BMDMs.\nOn day one, streak S. Typhimurium on a Lennox Broth (LB) plate with aseptic technique and place it in an incubator at 37°C 16 h.\nOn day two, seal the LB plate with parafilm in the morning and store it at 4°C to avoid the overgrowth of S. Typhimurium growth on the plate. In the evening, pick one colony into 5 mL sterile LB broth and grow the S. Typhimurium in the incubator at 37°C for 16 h with shaking (200 rpm).\nOn day three, sub-culture S. Typhimurium at 1:100 (add 20 μL bacterial culture into 2 mL fresh LB broth) for an additional 4–6 h with shaking (200 rpm) at 37°C.\nCollect S. Typhimurium by centrifuging at 200 g for 3 min at 22°C.\nRemove supernatant and wash the S. Typhimurium pellet twice with sterile PBS.\nResuspend the S. Typhimurium pellet with 1 mL sterile PBS and measure the OD600.\nCritical: The sub-culture of S. Typhimurium at 37°C for an additional 4–6 h (Step c) is essential for inflammasome activation. During this period, S. Typhimurium reaches the log-phase of growth for the maximum expression of Salmonella pathogenicity island 1 (SPI-1), which activates NLRC4 inflammasome.\nSeed BMDMs and LPS priming This step describes how to seed and prime BMDMs with LPS before S. Typhimurium infection.",
    "On day two, after 7 days of BMDMs differentiation, aspirate off the BMDM culture medium and add 5 mL sterile PBS to the Petri dish.\nGently detach the BMDMs from the Petri dish by pipetting with a 1 mL pipette.\nNote: BMDMs can be easily detached from the Petri dishes by pipetting. If tissue culture dishes are used for BMDM differentiation, cell can be collected with cell scraper by pre-treating with EDTA disassociation buffer (10 mM EDTA in PBS) for 10–15 min, followed by trypsin (0.25%) treatment for 2 min. A detailed comparison between these collecting methods is described in J. Immunol Methods (Chen et al., 2015[href=https://www.wicell.org#bib1]).\nCount the cell numbers with a hemocytometer and seed 1.5×106 BMDMs per well in a 6-well plate in DMEM/F12 with 10% FBS, L-Glutamine (2 mM), Penicillin/Streptomycin (1:100), HEPES buffer (10 mM). Culture BMDMs in a cell culture incubator for 16 h.\nNote: Adjust the cell numbers accordingly if other cell culture plates are used. We seed 1.0×106 BMDMs per well in a 12-well plate, and 0.5×106 BMDMs per well in a 24-well plate.\nOn day three, prime BMDMs with 0.5 μg/mL LPS (dissolved in endotoxin-free water) for 4 h before S. Typhimurium infection.\nNote: LPS priming for NLRC4 inflammasome activation is not always necessary. S. Typhimurium infection could significantly increase the protein level of IL-1β as early as 30 min, making LPS priming less critical in activating the NLRC4 inflammasome. Nevertheless, we recommend priming BMDMs, especially when your gene of interest could affect Il1b and Il18 expression independent of NLRC4 inflammasome activation during S. Typhimurium infection.\nAfter LPS priming for 4 h, wash the BMDMs 3 times with sterile PBS. Change to the FBS-free medium before infection.",
    "Note: Intracellular LPS can activate non-canonical NLRP3 inflammasome; therefore, PBS washes after LPS priming is necessary. Alternatively, you can prime BMDMs with a TLR2 ligand, such as Pam3csk4.\nCritical: Changing to FBS-free media before the infection is important since it helps reduce the number of non-specific proteins from FBS when precipitating proteins from cell culture supernatants.\nInfection of BMDMs with S. Typhimurium This step describes the final step of infection and how to identify pyroptotic cells after inflammasome activation.\nInfect the primed BMDMs with S. Typhimurium at a multiplicity of infection (MOI) of 10. The simple conversion to determine the volume of S. Typhimurium added to one well at a certain Multiplicity of Infection (MOI) is described as: MOI × Cell number/well = OD600 × (1.5×109) × Volume (ml)\nNote: Log-phase S. Typhimurium expressing SPI-I activates NLRC4 inflammasomes after 30 min of infection at an MOI of 10, and about 80% BMDMs undergo inflammasome-induced pyroptosis within 1 h (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1110-Fig1.jpg\nFigure 1. Morphological characteristics of pyroptotic cells under a light microscope\nLPS-primed BMDMs were infected with S. Typhimurium for 1 h (MOI, 10). The pyroptotic cells can be identified with protruding nuclei (red arrow), bubble-like protrusion (black arrow), and cell membrane rupture (cyan arrow). ). Scale bar, 10 μm",
    "Cell culture supernatant protein precipitation This step describes the detailed methanol-chloroform protein precipitation method to detect cleaved caspase-1 and cleaved IL-1β in the cell culture supernatant. Inflammasome activation features the cleavage of pro-caspase-1, pro-IL-1β, and gasdermin-D (GSDMD) into their functional forms and can be detected by western blot. Western blot is used to detect cleaved caspase-1 (20 kDa) and GSDMD (35 kDa) in the cells, as well as secreted caspase-1 (20 kDa) and IL-1β (17 kDa) in the cell culture supernatant. We provide a reproducible cell culture supernatant protein precipitation method for the detection of secreted cleaved caspase-1 and cleaved IL-1β by western blot. Secreted IL-1β in the supernatant can also be used by ELISA.\nAfter the infection, collect 1 volume of supernatant (e.g., 600 μL) into a 1.5 mL Eppendorf tube. Add ¼ volume (150 μL) of chloroform and 1 volume of methanol (600 μL) to the supernatant and flip the tubes to mix.\nCentrifuge at 13,800 g for 5 min at 22°C.\nAspirate off the top layer without disrupting the protein layer in the middle and add another 1 volume of methanol (600 μL).\nCentrifuge at 13,800 g for 5 min at 22°C. The protein pellet should be visible at the bottom of the tube.\nRemove the supernatant and air dry the pellet for 5 min.\nBoil the pellet in 1× laemmli buffer before subject to western blot.\nNote: Since the cleaved caspase-1 and IL-1β have low molecular weights, we recommend using at least 12% SDS-PAGE to make sure that these small proteins don’t run out of the gel. We usually ran SDS-PAGE at a constant 100 V for 60 mins and transfer at a constant 400 A for 60 min.\nDetect the oligomerization of apoptosis-associated speck-like protein containing a CARD (ASC).",
    "After the infection, lyse the cells with 200 ul TBS buffer for 30 min on a rocker at 4°C.\nCollect the cells with cell scrapers and centrifuge at 6,000×g at 4°C for 15 min. Collect the Triton X-100 soluble fraction (lysate) as ASC western blot loading control.\nWash the Triton X-100 insoluble fraction (pellet) twice with PBS (6,000×g at 4°C for 5 min) and re-suspend the pellet with 300 ul TBS buffer.\nBreak the pellet by vigorous pipetting and vortexing.\nAdd disuccinimidyl suberate (DSS) to a final concentration of 4 mM and incubate in a water bath at 37°C for 30 min. You will observe precipitation during the crosslinking. Gently vortex the tube periodically.\nAfter crosslinking, centrifuge at 6,000×g for 15 min at 4°C and dissolve the pellet in 1× laemmli buffer before subject to western blot.\nDetect ASC specks by immunofluorescence staining.\nBefore seeding BMDMs, autoclave square-shape cover glasses and put them into wells of a 6-well plate. Seed BMDMs at a lower density (5×105/well). Infect the cells with S. Typhimurium as described above.\nAfter infection, gently move the cover glasses to the wells of a new 6-well plate. Fix and permeabilize cells with 100% methanol (prechilled at −20°C) at 22°C for 5 min.\nNote: No additional permeabilization step is required when methanol is used to fix the cells since 100% methanol fixes and permeabilizes cells at the same time. Alternatively, cells can be fixed and permeabilized with 4% paraformaldehyde (in PBS) and 0.5% TritonX-100 (in PBS), respectively, for 10 min at 22°C.\nWash the cells with PBS 3 times and incubate the cells with block buffer for 30 min at 22°C.\nDilute ASC antibody (2 μg/mL) in PBST and incubate at 4°C 10–16 h without shaking.",
    "Wash the cells with PBS 3 times and incubate the cells with goat anti-rabbit FITC secondary antibody (2 μg/mL) for 1 h at 22°C in the dark.\nMount the cells with the mounting medium containing DAPI (0.3 ug/mL) and capture the images with a fluorescent or confocal microscope. We used the Zeiss LSM 510 Meta confocal microscope.\nNote: Besides FITC, any appropriate fluorophore conjugated goat anti-rabbit antibody can be used for the staining."
  ],
  "subjectAreas": [
    "Immunology",
    "Microscopy",
    "Cell Biology",
    "Microbiology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}