{
  "id": 10944,
  "origin_website": "Jove",
  "title": "Generation of a Three-dimensional Full Thickness Skin Equivalent and Automated Wounding",
  "procedures": [
    "NOTE: The protocol is designed for the production of 24 full thickness skin equivalents. Human dermal fibroblasts and epidermal keratinocytes were isolated from skin biopsies according to a previously published protocol.21,22 Informed consent was obtained beforehand and the study was approved by the institutional ethics committee on human research of the Julius-Maximilians-University Würzburg (vote 182/10).\n1. Production of Dermal Component\nDissolve collagen with 0.1% acetic acid to a final concentration of 6 mg/ml. For the gel neutralization solution, mix 232.5 ml 2x DMEM, 7.5 ml fetal calf serum, 7.5 ml 3 M HEPES, 2.5 ml chondroitin sulfate (5 mg/ml). Keep gel neutralization solution and collagen solution on ice. Calculate 500 µl of gel per insert/skin equivalent.\n\tNOTE: As the gel neutralization solution will be mixed with two parts of collagen solution prepare double amount of collagen.\nPlace 24 inserts into a 24 well plate.\nResuspend human dermal fibroblasts (hDF) in 10 ml DMEM, centrifuge for 5 min at 270 x g and count the cells. Extract the needed amount of hDF (5 x 104 cells per 500 μl collagen gel) and centrifuge the cells for 5 min at 270 x g.\nRemove the supernatant and carefully resuspend the hDF in 4 ml cooled gel neutralization solution without producing air bubbles. From this step make sure to work as fast as possible to avoid premature solidifying of the collagen gels.\nResuspend the solution with 8 ml of collagen solution.\nTake the collagen-cell-mixture with a multistep-pipette and fill quickly 500 μl of mixture in each insert. Incubate the gels for 20 min in an incubator (37 °C, 5% CO2) to jell the gels.",
    "Submerge the gels in 2 ml Dulbecco’s Modified Eagle Medium (DMEM) + 10% fetal calf serum (FCS) per well and incubate it for 24 hr in an incubator (37 °C, 5% CO2).\n2. Addition of Human Epidermal Keratinocytes (hEK)\nRemove medium after 24 hr. Dissolve fibronectin human protein with ultrapure water to a final concentration of 50 µg/ml. Cover each dermal equivalent with 25 μl of fibronectin solution. Incubate the gels for 30 min in an incubator (37 °C, 5% CO2).\nIn the meantime, resuspend the hEK in 10 ml KGM-2 and set cell concentration to 1 x 106 cells/ml with KGM-2 ready + 5% FCS. Seed 1 x 105 hEK on each gel. Incubate gels for 45 min in the incubator (37 °C, 5% CO2) to allow cells to adhere.\nSubmerse the gels with KGM-2 ready + 5% FCS and culture them in the incubator (37 °C, 5% CO2).\n3. Culture of Full Thickness Skin Equivalents (ftSE)\nCulture ftSE for 6-7 days in descending FCS-concentration (5%, 2%, and 0% FCS). Change the medium every 2-3 days with the next lower FCS concentration. For this, completely remove the medium and add 1.6 ml of fresh medium.\nOn day 7, remove medium completely.\n\tNOTE: Do not touch the ftSE surface with the tip of pipette while doing so.\nPlace every insert into 1 well of a 6 well plate with sterile forceps. Add 1.5 ml airlift medium per well, ensure not to wet the ftSE surface. Change medium every 2-3 days for additional 14 days.\n\tNOTE: The filling level of the medium is up to the meniscus of the ftSE.\n4. Histological Analysis\nFixing and paraffin-embedding of the ftSE",
    "Remove culture medium, transfer inserts in fresh 24 well plates and fix tissues by adding 1.6 ml of 4% paraformaldehyde to each well and incubate the tissues for 2 hr at RT. Caution! Paraformaldehyd is toxic, manipulate under fume hood. Transfer the ftSE to a tissue-embedding cassette. Remove remaining fixative by washing with water and dehydrate the tissue using ascending ethanol concentrations.\nDivide the skin equivalent by a vertical cut in the middle. Place the two pieces in a paraffin-filled metal base mold with cut surfaces downwards. Add the tissue cassette on top of the mold as a backing.\nCut 3-5 µm slices and float them on a 40 °C water bath for straitening, mount slides onto suitable microscope slides. Dry slices thoroughly.\nHematoxylin & Eosin (H&E) and immunohistochemical (IHC) staining\n\t\nPlace slides into rack and incubate for 1 hr at 60 °C. Make sure that paraffin is melted. Stain rehydrated slices with H&E as a standardized overview staining.\nFor H&E staining prepare 4x glass staining cuvettes with xylol, 3x with ethanol 96%, 2x with ethanol 70%, 1x with ethanol 50%, 4x deionized water, 1x hematoxylin, 1x HCl-ethanol (13.7 ml 1 M HCl ad 200 ml 50% ethanol), 1x tab water, 1x eosin (1 g eosin in 100 ml deionized water) and 2x 2-propanol.",
    "Place slides 10 min in xylol I and 10 min in xylol II to deparaffinize and rehydrate slides. Dip slides 3x in ethanol 96% I, 3x in ethanol 96% II, 3x in ethanol 70% and 3x in ethanol 50%. Rotate slides in deionized water. To differentiate hematoxylin dye, dip 2x in HCl-ethanol. Rinse in deionized water. For blueing, place slides 5 min in tab water. For eosin staining, place slides 1 min in eosin and wash afterwards in deionized water. For dehydration, dip slides 2x in ethanol 70%, 2x in ethanol 96% and place them for 5 min in 2-propanol I, for 5 min in 2-propanol II, 5 min in xylol I and 5 min in xylol II. After H&E staining, cell nuclei are stained in blue, cytoplasm and extracellular matrix are stained in red.\nFor antigen retrieval, remove paraffin with xylene and rehydrate slices for staining. Place slices in steam cooker and cook deparaffinized and rehydrated slices for 20 min in pre-heated 10 mM citrate buffer (pH 6).\nPlace slides in washing buffer (PBS buffer + 0.5% Polysorbat 20) and circle slices with a liquid repellent slide marker pen or diamond stylus.\nPlace slides in a moisture chamber. Block endogenous peroxidase, by adding 100 µl 3% hydrogen peroxide solution onto each slice. Caution! Very hazardous in case of skin and eye contact. Handle with personal protective equipment. Wash slides in washing buffer.\nApply primary antibody and incubate for 1 hr at RT. Wash slides three times with washing buffer. From here on, samples should be kept in the dark.\nUse biotin-streptavidin detection system for detection of specific antigen-antibody binding.\nCounterstain nuclei with Hematoxylin for 1 min. Dehydrate and mount slides.\nImage samples using an inverse microscope.\n5. Injury by Use of the Automated Wounding Device (aWD)",
    "Prepare the aWD by disinfecting the working area with 70% ethanol and ultraviolet light. Make sure the drilling head of the desired size (e.g., 1 mm) is attached.\nPlace skin equivalents into designated areas of the autoclaved sample carrier plate using sterile forceps. Place the sample carrier plate into the socket below the drilling head.\nUse the control software to set wounding parameters as follows: spin velocity: 15,000 rpm; penetration: 1.5 mm; propulsion: 100 Hz. These parameters need to be defined for each sample type individually. Transfer wounding parameters to the aWD.\nStart wounding procedure. Remove sample carrier plate from the socket. Transfer wounded ftSE back into inserts used for culture using sterile forceps.\nProceed with culture of wounded ftSE in the incubator (37 °C, 5% CO2) for investigation of regeneration. Alternatively, use the models for histological analysis at any time.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}