{
  "id": 17006,
  "origin_website": "Jove",
  "title": "Simplified Intrafemoral Injections Using Live Mice Allow for Continuous Bone Marrow Analysis",
  "procedures": [
    "Six- to ten-week-old male or female NOD.Cg-Prkdcscid Il2rgtm1Wjl/SzJ (NSG) mice were used in this protocol, but it can be applied to all types of mice. The irradiation depends on the experimental content and the type of mice, whether or not to irradiate the mice depends on the research objectives. All animal procedures described here were conducted in accordance with the Guidelines for the Care and Use of Laboratory Animals and were approved by Stanford University's Administrative Panel on Lab Animal Care (APLAC #22264). All normal blood cell populations were sorted out fresh. Human AML samples were obtained from patients at the Stanford Medical Center with informed consent, according to institutional review board (IRB)-approved protocols (Stanford IRB, 33818).\n1. Intrafemoral injection of cell lines, hematopoietic stem and progenitor cells (HSPCs), or leukemic stem cells (LSCs)\nNOTE: To easily analyze the injected cells with an imaging device, an Akaluc/tdTomato-positive K562 cell line was generated, and AkaLumine-HCl/Akaluc was used as a substrate10. If imaging equipment is not available, cells can be labeled with a fluorescent dye by lentivirus or PiggyBac and analyzed by flow cytometry. Regardless of the details of cell preparation, having a way to prove that the cells administered into the bone marrow have reliably entered the BM is important for improving this technique (Figure 1).\nPrepare cell suspensions (up to 3 × 106 blood cells) with 20 µL of fluorescence-activated cell sorting (FACS) buffer (phosphate-buffered saline (PBS) + 2% fetal bovine serum (FBS) + 2 mM EDTA) or Thaw medium (IMDM + 20% FBS + Pen/Strep) in PCR or 1.5 mL tubes and keep on ice before injection.",
    "NOTE: Avoid making air bubbles while suspending the cells with the needle. Bubbles should be removed as much as possible right before the injection, as injecting air bubbles can cause sudden death of mice.\nCondition 6-10-week-old adult mice with 200 cGy (225 kV, 13.3 mA, total 2 Gy [Dose control mode]) up to 48 h prior to injection of the cells.\nAnesthetize mice with isoflurane inhalation (2% isoflurane in 100% oxygen at a flow rate of 1-2 L/min) via a nose cone to reach a steady state of anesthesia. Check the depth of anesthesia by the toe pinch reflex and slow steady breathing and maintain this throughout the procedure with isoflurane.\n\tNOTE: Monitor the depth of the anesthesia every 3-5 min throughout the procedure to ensure there is no change in heart and respiratory rates with surgical manipulation and/or ear, toe, and tail pinch. The color of mucous membranes and skin can be used as an indicator of oxygenation, as they will be pinkish if the mice are in good condition.\nPrior to the procedure, administer mice with 10 mg/kg carprofen subcutaneously to minimize pain and warm 0.5-1.0 mL of 0.9% saline for supportive care.\nApply ophthalmic ointment to the eyes of the mouse to avoid corneal drying.\nKeep the mouse on a heat pad or other thermostatically controlled surface to prevent hypothermia during the procedure.\nDisinfect the entire leg containing the femur to be injected with three sets of alternating scrubs (alternating with either a povidone-iodine or a chlorhexidine scrub and 70% ethanol-soaked gauze sponges).\n\tNOTE: If the operator is left-handed, the left femur of the mouse might be easier to inject than the right femur.",
    "Pinch the femur gently with the thumb and index fingers to stabilize the leg. Push the tibia with either the ring or the fifth finger to keep the tibia bent from the femur. Positioning is important for successful injection (Supplementary Figure S1-S5).\n\tNOTE: Use forceps to pinch the bone to prevent injury to the fingers; however, it might be difficult to feel the shaft of the femur and will add time to the procedure.\nInsert an empty sterile 27 G needle (1/2 inch) with an attached syringe just under the patellar tendon so that the needle is lodged securely between the two condyles of the femur. Use the edge of the needle and peck the patellar tendon on top of the femur lightly a couple of times to find the best place to insert the needle (Supplementary Figure S1-S5).\n\tNOTE: A knowledge of the anatomy of the mouse knee area is necessary before performing this procedure. Beginners should take the time to understand the anatomy of the area and practice the procedure on an euthanized mouse before attempting it on a live mouse.\nSwivel the needle outward and upward to ensure it is parallel with the shaft of the femur.\n\tNOTE: This maneuver provides a reliable path to the marrow cavity, facilitates retrieval of marrow contents from the femoral shaft, and minimizes discomfort to the animal from the procedure.\nTurn the needle in circles while slowly advancing into the femoral marrow cavity. Insert the needle until there is a noticeable reduction in resistance. Confirm the correct positioning of the needle by gently moving the syringe laterally. If it is possible to touch the edge of the needle with the fingers coming outside the bone, go back to step 1.9 and find another angle and place to drill the needle down.",
    "Ensure that the needle's entry angle is perpendicular to the bone end-face.\n\t\tNOTE: Theoretically, the needle must be injected parallel to the femur and must be at a 90° angle to the bone ends. If there is resistance from the interior surface, the needle has been correctly placed in the femoral cavity. To make sure the needle is parallel to the bone, place a light on the side of the bone and observe the shadow of the bone parallel to the shaft of the needle. The decrease in resistance upon entry into the bone marrow cavity depends on the age of the mouse: the younger the mouse, the easier it is to recognize the decrease in resistance.\nCreate negative pressure by gently pulling the needle plunger back while moving the needle back and forth within the BM cavity. If the needle is in the BM cavity, some blood/marrow will come out in the syringe.\n\t\nIf the blood/marrow is not seen, change to a new needle and try to find the same route.\n\t\tNOTE: The reason for changing to a new needle is that once the bone clogs the needle, it becomes difficult to check for the backflow of the blood/marrow. Minimizing the number of injection routes into the BM cavity is crucial, as cells injected into the bone marrow have the potential to leak out of the femur through previous entry points. If multiple injection routes are necessary, leaking risk can be reduced by injecting cells gradually rather than a quick bolus.",
    "Remove the needle slowly and insert the cell-containing syringe through the same route. Try to insert the needle until it stops (at the edge of the BM cavity) and pull back a little bit (1-2 mm) from there to inject the cells easily. Prior to depressing the plunger and releasing the cells, aspirate slightly and check for blood/marrow to ensure the correct placement of the needle. Check the backflow of the blood/marrow first and then push the syringe slowly to inject the cells.\n\t​NOTES: It is very important to remember the route and angle of the first injection when switching to a new needle. If the same route cannot be found, try again with the original needle used to make the first route. A new needle may be used at this time, but if the original needle is used, the jammed bone should be pushed out once before use. Do not use the needle with the cells to find a new route to inject; otherwise, pieces of bone stuck in the needle may prevent cell dispersal. Although the BM cavity is very small, the injection volume should be less than 30 µL, considering the dead cavity.\n\t\nEnsure that the speed of injection is slow to prevent air in the syringe from entering the bone marrow and to prevent cells from leaking from the puncture site. If resistance is felt while pushing the syringe, move the needle up and down to find a less resistant area in the cavity.\nOnce the cells are successfully injected into the femur, remove the needle and syringe from the mouse while maintaining pressure on the syringe.",
    "NOTE: Try again with the other femur if the injection cannot be completed. The procedure is very stressful for the mouse, even under anesthesia. Always monitor the vital signs (heart and breathing rate) of the mouse and try to finish the procedure as soon as possible.\nRemove the mouse from the nose cone and place it on a clean paper towel to prevent aspiration of bedding. During the recovery, keep the mouse on a heating pad or other thermostatically controlled surface. Monitor all mice to verify recovery from anesthesia prior to placing them back on the mouse rack.\n\tNOTE: There should be no complication or distress post aspiration if done properly. The procedure will be completed when anesthetized mice have recovered and are able to ambulate and reach food and water.\nObserve the mice for signs of distress or infection post-procedure over the next 24 h. Signs of distress or infection include constant bleeding, anemia, and lethargy. If any of these signs are seen post-procedure, euthanize the animal(s) by CO2 inhalation or cervical dislocation according to the animal handling protocol.\n2. Aspiration of bone marrow cells from the femur for the FACS analysis\nNOTE: The procedure for aspirating the BM cells from the mice is very similar to the methods described in section 1 and can be learned from some previous literature9,11,12. The following is an overview of some differences between the BM injection and aspiration protocols.\nPrepare 500 µL of PBS + 10 mM EDTA (cell suspension medium: CSM) per sample for suspending the BM aspiration.\nWet a 0.5 mL 27 G syringe with CSM before aspirating the BM. Fill the syringe with 200-500 µL of CSM and immediately expel it. Repeat this procedure 2-3x.",
    "Aspirate the BM gently by withdrawing the plunger on the syringe yielding 20-50 µL of mouse BM. Then, fully remove the needle from the femur and suspend the aspirated sample in CSM (500 µL in a 1.5 mL tube) for the following staining step. Remove the mouse from the nose cone and place it on a clean paper towel to prevent aspiration of bedding during recovery. Monitor all mice to verify recovery from anesthesia prior to placing them back on the mouse rack.\n\tNOTE: BM aspiration/sampling can be repeated, but the repeat procedure on the same day must be performed on the opposite femur to prevent repeated trauma to the same leg. Although there is little information on the frequency of BM aspiration, we believe that femoral BM aspiration is generally repeated every 4 weeks and can be performed at least 3-4x in total without any issues (e.g., infection) based on our experience. However, it should be kept in mind that the bone marrow on the contralateral side of the transplanted bone marrow generally has lower cellular engraftment.\nPellet cells from the bone marrow aspirate by a 5 min spin at 300 × g, 4 °C.\nAspirate the supernatant, add 0.5-1 mL of ACK lysis buffer (150 mM NH4Cl, 10 mM KHCO3, 0.1 mM EDTA) to each tube, and vortex to resuspend the cells. Place on ice for 5-10 min.\nFilter each tube through nylon mesh into a new tube.\nRinse the tube with 1 mL of FACS buffer and add it through the nylon mesh into a new tube as well.\nPellet cells by a 5 min spin at 300 × g, 4 °C.\nAspirate the supernatant and add the staining solution containing the desired antibodies13. Place on ice for 20 min.",
    "Wash the cells and analyze them as per the experimental setup.\n\t\nWash cells with FACS buffer (PBS, 2% FBS, 2 mM EDTA) and stain them with antibodies for 30 min on ice in a total volume of 50 µL. Wash and stain the cells with propidium iodide (PI) at a final concentration of 1 µg/mL immediately before the analysis or sorting. Perform post sort analyses to verify the purity of the sorted cell populations.\n\t\tNOTE: All antibodies used for flow cytometry are detailed in the Table of Materials.\nUse the following FACS gating strategies (Figure 2-7) to analyze the engrafted cells from the mouse bone marrow.\n\t\t\nDistinguish populations of cells by their forward (size) and side scatter (granularity) properties.\nPerform doublet discrimination by plotting FSC-H vs FSC-W, following SSC-H vs SSC-W.\nExclude dead cells.\nDistinguish populations of cells by human CD45 and mouse CD45. These antibody staining combinations enable the detection of human CD3, CD19, and CD33 as well within the human CD45 fraction.\n\t\t\tNOTE: Before staining the samples, remember to use mouse and human Fc blocks to prevent non-specific antibody binding. We usually stain with the Fc blocks (mouse + human) for 10 min on ice and then add the antibodies without washing the cells. Refer to each company's instructions on how to use the Fc block antibodies.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}