{
  "id": 6044,
  "origin_website": "Bio",
  "title": "Guanine Nucleotide Exchange Assay Using Fluorescent MANT-GDP",
  "procedures": [
    "Expression and purification of recombinant GTPases from E. coliRecombinant GTPases can be produced and purified from Escherichia coli, since the nucleotide exchange assay does not generally require post-translational modifications of the GTPase. Experimental conditions, such as temperature and culture time for inducing protein expression and Isopropyl β-D-1-thiogalactopyranoside (IPTG) concentration, need to be determined for each GTPase to obtain the maximal yield of soluble recombinant proteins. Conditions can be optimized in small scale (we typically perform a pilot experiment with 2 ml of LB media). We typically induce the protein expression with 0.1 mM IPTG at 18 °C overnight. A typical yield from 1 L culture is 10 mg of protein.Transform Rosetta2 bacteria cells with a vector containing gene of interest. Plate the cells onto an LB agar plate containing 50 µg/ml carbenicillin (or 100 µg/ml ampicillin) and 34 µg/ml chloramphenicol. Incubate the plate at 37 °C overnight.Note: We typically use Gateway-cloning compatible pGEX6p vector (Wright et al., 2011), which produces an N-terminally Glutathione S-transferase (GST) tagged protein with PreScission protease recognition site between GST and protein of interest. The vectors containing CDC42, a GEF-dependent GTPase, and IIGP1 and CrRabl2, GEF-independent GTPases, work as positive controls for the experiment and are provided by the authors upon request. Chloramphenicol is added into an agar plate because tRNAs for rare codons are maintained by the chloramphenicol-resistant plasmid in the Rossetta2 bacteria cells. Other antibiotics might have to be used depending on bacteria cells used. Inoculate 50 ml of LB media containing 100 µg/ml ampicillin and 34 µg/ml chloramphenicol with a single colony of the transformed cells in a 250 ml flask. Grow the starter culture at 37 °C at 250 rpm overnight.",
    "Pre-warm 1 L of autoclaved TB media without antibiotics in 2,800 ml flask at 37 °C overnight in an incubator shaker, before starting a large-scale culture.Inoculate 1 L of pre-warmed TB media with 25 ml of the starter culture. Shake the flask at 37 °C at 250 rpm until OD600 reaches to 0.6-0.7. It takes approximately 2 h. As soon as OD600 reaches to 0.6-0.7, set the flask on ice and chill culture for 15 min.Add 100 µl of 1 M IPTG (the final concentration is 0.1 mM) to induce protein expression.Shake the flask at 18 °C at 250 rpm in an incubator shaker overnight.Place the flask on ice before harvesting the bacteria cells.To confirm the expression level and the solubility of the protein, transfer 1 ml of the bacterial suspension into a microcentrifuge tube. Collect the cell pellet by centrifugation at 8,000 rpm (6,010 x g) at 4 °C for 1 min using a refrigerated centrifuge. Re-suspend the cell pellet in 300 µl of pre-chilled lysis buffer and lyse the cells by sonication for 1 min on ice (0.6 sec/0.4 sec on/off cycle at 30% amplitude), followed by centrifugation at 15,000 rpm (21,130 x g) at 4 °C for 10 min. Transfer the supernatant into a microcentrifuge tube and add 100 µl of 4x LDS sample buffer and 10 µl of 2-mercaptoethanol to prepare the soluble fraction. To prepare the insoluble fraction, add 290 µl of the lysis buffer, 100 µl of 4x LDS sample buffer and 10 µl of 2-mercaptoethanol to the pellet. Incubate the samples at 70 °C for 10 min and run them on Nu-PAGE gel at 200 V until the dye front reaches to the bottom of the gel.",
    "Stain the gel in Coomassie Brilliant Blue staining solution for 1 h at room temperature with gentle agitation, followed by destaining in Coomassie Brilliant Blue destaining solution overnight at room temperature with gentle agitation. Your protein of interest should appear in the soluble fraction.Note: Classical Laemmli sodium dodecyl sulfate (SDS) sample buffer/SDS-polyacrylamide gel electrophoresis (SDS-PAGE) can be used instead of 4x LDS sample buffer/Nu-PAGE system. Harvest bacteria by centrifugation in four 500 ml centrifuge bottles at 6,000 rpm (6,371 x g) in JA-10 rotor using Avanti J-25I refrigerated centrifuge at 4 °C for 10 min.Note: Put a maximum of 300 ml in each tube, to prevent spilling during centrifugation. Discard supernatant and freeze the cell pellet at -20 °C until you confirm the expression and the solubility of the protein in Step A9.Note: Bacterial pellet can be stored at -20 °C for at least one week. Alternatively, you may keep the bacteria pellet on ice for same day confirmation of the expression/solubility then proceed immediately to the next step.Re-suspend the 1 L cell pellet in 30 ml of pre-chilled lysis buffer and transfer suspension to a 50 ml conical tube.Sonicate the cells on ice until the suspension becomes watery (approximately 2 min; 0.6 sec/0.4 sec on/off cycle at 80% amplitude).Transfer the lysate into an oak ridge tube and clarify the lysate by centrifugation at 15,000 rpm (30,996 x g) at 4 °C in the JA-17 rotor using the Avanti J-25I refrigerated centrifuge for 30 min. During centrifugation, wash 2 ml bed volume of glutathione Sepharose 4B media twice in 20 ml of ice-cold lysis buffer in a 50 ml conical tube.",
    "To wash the beads, pellet the beads by centrifugation at 1,466 rpm (500 x g) at 4 °C for 5 min using the Allegra X-15R refrigerated centrifuge and aspirate the supernatant. Add 20 ml of the lysis buffer and mix by inverting the tube. All washes in the following steps will be done in the same manner.Note: 1 ml bed volume of beads bind approximately 5 mg of GST.Add clarified lysate into the washed glutathione Sepharose beads and rotate the 50 ml conical tube on a 360° vertical rotator at 4 °C for 2 h.Wash the beads three times with 40 ml (20 resin volumes) of lysis buffer without protease inhibitor. Wash the beads twice with 40 ml (20 resin volumes) of PreScission cleavage buffer.Add 4 ml (2 resin volumes) of PreScission cleavage buffer and transfer them into a 15 ml conical tube.Add 10 µl of 10 mg/ml GST-PreScission to elute the protein. Rotate the 15 ml conical tube on a 360° vertical rotator at 4 °C for 16 h.Note: 10 µl of 10 mg/ml GST-PreScission is added, because we expect the final yield 10 mg and 1 µl of our GST-PreScission cleaves 1 mg of GST tagged protein. The amount of GST-PreScission that should be added depends on the expression level of the protein and/or how much protein is desired. The amount of proteins contained in the lysate can be estimated based on the amount of protein in the test sample taken at Step A9.Pellet the beads by centrifugation at 1,466 rpm (500 x g) at 4 °C for 5 min using the Allegra X-15R refrigerated centrifuge and collect supernatant into a 15 ml conical tube.",
    "Wash the beads with 2 ml (one resin volume) of PreScission cleavage buffer and collect supernatant following centrifugation at 1,466 rpm (500 x g) at 4 °C for 5 min. Repeat wash one more time and combine with the previous supernatant.Measure the concentration of the protein using the Bradford assay (see Step B8 for detail).Note: If the concentration is less than 100 µM, concentrate the eluted protein using the Amicon ultra concentrator (Merck, catalog number: UFC901024).Check the quality of the protein by Nu-PAGE and Coomassie Brilliant Blue staining. Note: Classical Laemmli SDS sample buffer/SDS-PAGE can be used instead of 4x LDS sample buffer/Nu-PAGE system.Dialyze the protein using dialysis tubing in at least 100-fold protein volumes of storage buffer at 4 °C overnight.Prepare 200 µl aliquots of the purified protein (the concentration should be 100 µM or greater) and snap freeze the aliquots in liquid nitrogen. Store at -80 °C.Buffer exchange to low magnesium bufferLoading MANT-GDP on GTPase is performed in the buffer containing 0.5 mM MgCl2 in the presence of 5 mM EDTA. Since our storage buffer contains 5 mM MgCl2 (see Recipes) for the stability of GTPase, we first exchange the storage buffer for the low magnesium buffer (see Recipes) using a gel filtration column.Thaw 200 µl of purified GTPase (100 µM or greater) on ice.Note: 100 µM of GTPase is generally a good starting point.Clamp a NAP-5 column onto a lab stand.Remove the top and bottom cap from the NAP-5 column to allow the excess manufacturer storage buffer to flow through.Equilibrate the NAP-5 gel filtration column with low magnesium buffer by three complete refills of the column. The volume of buffer used for equilibration is approximately 10 ml in total.",
    "Apply 200 µl of purified GTPase onto the center of the equilibrated NAP-5 column and allow the sample to enter the gel bed completely by gravity flow.Apply 500 µl of low magnesium buffer to the column and collect the flow through in a microcentrifuge tube.Note: This fraction should not contain any proteins.Apply 1 ml of low magnesium buffer to elute the protein. Collect eluate 100 µl at a time in microcentrifuge tubes.Note: Most of the protein should be eluted in the first 4 fractions.Measure the concentration of each fraction including the flow through by the Bradford assay.Briefly, dilute one part of Bradford Reagent Concentrate with 4 parts of Milli-Q water, and add 1 ml of diluted Bradford reagent to disposable cuvettes. Add 10 µl of Milli-Q water or BSA standards (at 0.1, 0.2, 0.4, and 0.8 mg/ml), or 1-2 µl of each fraction of buffer exchanged GTPase into each cuvette. Mix the cuvettes by vortexing and incubate at room temperature for 5 min. Measure the concentration of each fraction on the BioSpectrometer. Calculate the molar concentration from the measured concentration. Use the fraction containing the highest concentration of protein for further experiment. The protein concentration following buffer exchange is generally half as much as the starting concentration.Note: A detailed instruction manual from Bio-Rad can be found online. There are different methods available to measure a protein concentration, including the Bradford assay, bicinchoninic acid (BCA) assay, and spectrophotometric methods. We prefer the Bradford assay, because it is a fast and easy method and all of the buffer components used in this protocol are compatible with the Bradford reagent (reagent compatibility chart from Bio-Rad can be found online). BCA assay might be affected by a reducing reagent contained in the nucleotide exchange buffer.",
    "We do not recommend a spectrophotometric method because GTPases are often purified with guanine nucleotides, which absorb at the wavelength used for the measurement. We typically get more than half of the starting concentration in a peak fraction.Loading MANT-GDP on GTPaseMix 100 µl of buffer exchanged GTPase with 100 µl of 2x MANT-GDP loading buffer (see Recipes) in microcentrifuge tubes. The final reaction contains 20 mM HEPES-NaOH (pH 7.5), 50 mM NaCl, 0.5 mM MgCl2, 5 mM EDTA, 1 mM dithiothreitol (DTT), GTPase, and 20-fold molar excess of MANT-GDP. Note: The concentration of MANT-GDP depends on the protein concentration and must be calculated in every experiment.Incubate the reaction at 20 °C in a thermomixer without shaking for 90 min. Protect the reaction from the light with aluminum foil.Stop the reaction by adding 2 µl of 1 M MgCl2 (the final concentration is 10 mM). Mix the reaction by inverting the tubes, followed by centrifugation then incubate the tubes at 20 °C for 30 min.During the incubation, equilibrate a NAP-5 gel filtration column with three complete refills of nucleotide exchange buffer (see Recipes). The volume of buffer used for equilibration is approximately 10 ml in total.To remove unbound MANT-GDP, apply the entire volume (200 µl) of MANT-GDP loaded GTPase onto the NAP-5 column. Allow the sample to enter the gel bed completely by gravity flow.Apply 500 µl of nucleotide exchange buffer and collect flow through.Note: This fraction should not contain any proteins.Apply 1 ml of nucleotide exchange buffer to elute the protein. Collect 100 µl at a time in microcentrifuge tubes. Keep MANT-GDP loaded GTPases on ice, protected from light (by aluminum foil).Note: Most of the protein should be eluted in the first 4 fractions.Measure the concentration of each fraction by the Bradford assay as described above.",
    "Measure the loading efficiency on the fluorimeterPrepare MANT-GDP standards by making two-fold serial dilutions of free MANT-GDP from 40 µM to 0.15625 µM in nucleotide exchange buffer.Note: The minimal concentration of free MANT-GDP that can be detected on TECAN Infinite M1000 Microplate reader is around 0.1 µM.Pipette 15 µl of nucleotide exchange buffer, free MANT-GDP standards, or MANT-GDP loaded GTPase into 384-well microplate.Note: This measurement also works with 96-well format. If you use 96-well format, pipette 50 µl of each sample into a 96-well microplate (Corning). Read the fluorescent signal every 15 sec, 10 times in total, at room temperature (25 °C). The parameters used for the detection are listed (Table 1).Table 1. The parameters used for the detection of MANT fluorescenceimgsrc:https://en-cdn.bio-protocol.org/attached/image/20180402/20180402014327_4433.jpgTo calculate the loading efficiency, average the fluorescence intensity for each sample from all 10 time points, then calculate the normalized average by subtracting the background fluorescence value measured for the buffer-only control. Plot the free MANT-GDP concentration vs. measured fluorescence and fit the standard curve to a linear function using Microsoft Excel. Use the standard curve to determine the concentration of the MANT-GDP-loaded GTPase from its measured fluorescence; since MANT-GDP signal typically increases approximately two-fold upon binding to protein, first divide the fluorescent signal by two then estimate the concentration of loaded GTPase using the standard curve function. A representative example of this data (Table 2) and the standard curve of free MANT-GDP created from the data (Figure 1) are shown.Note: The loading efficiency calculated here might not be accurate, as the increase in the signal intensity of MANT-GDP upon binding to GTPases varies among GTPases. Examples of the loading efficiency can be found in the original paper. (Figure S4E in Kanie et al., 2017).Table 2. An example of the data obtained from loading of MANT-GDP on GTPaseimgsrc:https://en-cdn.",
    "bio-protocol.org/attached/image/20180402/20180402014354_3967.jpgimgsrc:https://en-cdn.bio-protocol.org/attached/image/20180402/20180402014135_4836.jpgFigure 1. A standard curve of free MANT-GDP created using the data shown in Table 2Nucleotide exchange assayAdd 14 µl of nucleotide exchange buffer or MANT-GDP loaded GTPase into an appropriate number (the number of conditions x 4 technical replicates) of wells of a 384-well microplate.Note: The concentration of protein that is added to the well depends on the loading efficiency calculated above, since the starting fluorescence intensity of the sample should be high enough to detect dynamic changes in the fluorescence. If the loading efficiency is high (more than 50%), 1 µM or less GTPase can be used. If the loading efficiency is low (less than 10%), the highest concentration of GTPase should be added. Before measuring the fluorescence, prepare a working solution of GppNHp, which has 15 x 100 times higher concentration than that of the GTPase, with nucleotide exchange buffer. If you use 1 µM of GTPase, prepare 1.5 mM GppNHp.Read the fluorescence for 150 sec at room temperature (25 °C) and confirm the fluorescent signal is stable.Note: The same detection parameters used in the Step D3 (see Table 1) can be used in the nucleotide exchange assay.Press the ‘Pause’ button on the display to eject the plate, and then add 1 µl of nucleotide exchange buffer or GppNHp working solution (the final concentration is 100 times higher than that of GTPase) to respective wells. If GEF mediated nucleotide exchange is to be measured, add purified GEF in addition to GppNHp.Note: A multichannel pipet should be used to simultaneously add buffer or GppNHp to start all reactions simultaneously.",
    "To ensure rapid addition of the buffer or GppNHp, we pre-fill a multichannel pipette with 1 µl of the buffer/GppNHp solution from another 384-well plate before ejecting the assay plate, and then pipette reagent into the assay plate immediately after ejection of the plate. To avoid making any bubble, we set the fill volume to 1.5 µl and the dispense volume to 1 µl.Press the ‘Continue’ button to insert the plate and continue reading fluorescence every 15 sec at room temperature (25 °C) for at least 30 min."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}