{
  "id": 10529,
  "origin_website": "Jove",
  "title": "Fabrication of a Multiplexed Artificial Cellular MicroEnvironment Array",
  "procedures": [
    "1. Fabrication of MACME Array\nNote: All materials and equipment are listed in the Materials Table.\nPreparation of masks for a nanofiber array and a mold for a microfluidic structure\nCreate three-dimensional (3D) images of masks used for the nanofiber arrays and molds for microfluidic structures using 3D-computer graphics software packages (Table 1).\nNote: The 3D images are read and printed by a 3D printer. The printed masks and mold have the same dimensions with 3D images defined using the graphics software at step 1.1.1.\nPrint masks and a mold based on these designs using a 3D printer.\nNote: In this protocol, an ink-jet-like 3D printer with UV-curable resin was used30. The printer resolution was 635 × 400 dpi and 15 µm in X, Y and Z, respectively, however, the actual X, Y resolution was approximately four times lower.\nNanofiber-array preparation (Figure 3A)\nPrepare polymer solutions for electrospinning.\n\t\t\nDilute 13% PMGI liquid with tetrahydrofuran by 9% (w/v)22.\nDissolve 0.08 g of PS (Number-average molecular weight (Mn): 130,000) in THF:dimethylformamide (1:1 volume ratio)21, and add THF:dimethylformamide to bring the volume up to the final 1 mL (8% (w/v) PS solution).\nDissolve 0.1 g of GT in water:acetic acid:ethyl acetate (1:1.6:2.1 volume ratio), and add water:acetic acid:ethyl acetate to bring the volume up to the final 1 mL (10% (w/v) GT solution) as described23,31.\nUse a magnetron sputtering machine, deposit a thin platinum layer with a 5-nm thickness on a polystyrene (PS) baseplate (127.7 × 85.5 mm), which serves as a cathode in the electrospinning setup.\nLoad each polymer solution into a 5-mL syringe equipped with a 23-G stainless-steel blunt needle.\nPlace and anchor the syringe with the needle on a syringe pump with 12-cm apart from the collector of the electrospinning device.",
    "Connect the syringe needle to a high-voltage power supply, and set to apply to 11 kV.\nSet the pumping rate of 0.2 mL/h.\nKeep temperature and humidity at 30 °C and < 30% (v/v).\nPut the mask on the baseplate prepared at step 1.2.2.\nFabricate nanofibers on the baseplate through the holes of mask with distinct densities by changing the electrospinning time (e.g., 20, 60, 90, and 180 s).\nRemove the mask from the baseplate.\nNote. Ethanol can be sprayed on the electrospun GT nanofibers before removing the mask to avoid peeling off GT nanofibers together with the mask.\nRepeat step 1.2.4-1.2.10 until the completion of nanofiber-array fabrication.\nPlace the nanofiber array in a desiccator at 25 °C for 16 h to evaporate the remaining solvent.\nCrosslink GT nanofibers with 0.2 M 1-ethyl-3-(3-dimethylaminopropyl) carbodiimide hydrochloride (EDC) and 0.2 M N-hydroxysuccinimide (NHS) in ethanol at 25 °C for 4 h23.\nRinse GT nanofibers twice with 99.5% (v/v) ethanol and vacuum-dry at 25 °C for 16 h.\nFabrication of microfluidic structures (Figure 3B)\nMix 2 g of PDMS curing agent and 20 g of PDMS base (1:10 weight ratio; Pre-PDMS). 24\nPour the pre-PDMS mixture onto the mold fabricated in step 1.2.\nDe-gas the pre-PDMS mixture in a desiccator for 30 min.\nCure the pre-PDMS mixture in an oven at 65 °C for 16 h.\nAssembly of MACME arrays (Figure 3B)\nPeel off the PDMS structure cured at step 1.3.4 from the mold and clean with 70% (v/v) ethanol.\nTreat atmospheric corona discharge on the bottom side of the PDMS structure32.\nNote: In this protocol, the corona is discharged on the entire surface of a layer 3 or 4 times with a \"Handy\" corona discharge apparatus. Oxygen plasma treatment was replaced with atmospheric corona discharge to alter the surface adhesiveness.",
    "Assemble the PDMS structure with the nanofiber array quickly.\nOven-bake at 65°C for 2 days.\n2. Loading hESCs into MACME Array\nFor the routine culture of H9 human embryonic stem cells (hESCs), maintain cells in xeno-free chemically defined culture medium for hPSC maintenance33 supplemented with 10 µM Y-27632 ROCK inhibitor34 (named hPSC medium) in a 35-mm cell culture dish coated with basement membrane gel matrix (MG).\nPassage cells every 4 to 7 days using a recombinant trypsin-like protease.\nSterilize a MACME array with 99.5% ethanol, by loading into the chambers for 10 min, and then remove the ethanol. Repeat this step 3 times.\nIntroduce 12 µL of MG, 10 µg/mL vitronectin (VN), and 0.1% (w/v) GT into control culture chambers, and incubate the chambers at 37 °C for 1 h to coat them on the chamber surfaces.\nNote: In this protocol, MG, VN, and GT were selected as reference proteins for cell adhesion and culture. Because MG and VN are standard cell-culture matrices used for maintaining hPSC self-renewal, they are used as positive controls; two-dimensional GT coating (2DGT) or non-coating (NC) were used as negative controls.\nIntroduce pre-warmed hPSC medium into all chambers of MACME array. Incubate the chambers for 30 min at 37 °C.\nWash H9 hESC cultured on a 35-mm dish with DPBS, add 0.5 mL of a recombinant trypsin-like protease to the dish and incubate at 37 °C for 1 min and carefully aspirate only the supernatants mixed with protease.\nNote: At the aspiration step, the cells are not detached.\nImmediately add hPSC medium, gently dispense the medium against the dish surface repeatedly to dissociate cells and transfer the detached cells to a 15-mL conical tube.\nCentrifuge at 200 x g for 3 min. Aspirate the supernatant and suspend cells in a pre-warmed hPSC medium.",
    "Introduce 12 µL of the cell suspension (1.2 × 106 cells/mL) into each microfluidic chamber.\nNote: Introduce cells to one chamber from another using a micropipette. Because the number of cells seeded to chambers is proportional to the column density above the chamber floor, the initial cell-seeding density could be controlled even though samples from same cell suspension were used. Ensure pipetting is done gently. Remove excess medium from the chambers using a cotton-tipped stick after loading. The MACME array is compatible with both commonly used laboratory pipettes and automated pipette systems, and it does not require any special equipment.\nChange hPSC medium every 12 h and culture for 4 days.\nNote: Constant volumes of the medium (1.6, 3.2, and 6.4 µL) are maintained by using chambers of distinct sizes. Culture cells under a static condition to minimize shear stress except for the exchanging of the cell culture medium35,36.\n3. Quantitative Single-cell Profiling\nOn-plate fluorescent cell staining\n\tNote: To analyze phenotypic changes of self-renewing hPSCs, this protocol selected three key phenotypic markers for this protocol: OCT4, 5-ethynyl-2'-deoxyuridine (EdU), and Annexin V, to measure the status of pluripotency, proliferation, and apoptosis, respectively (Figure 2b). 4',6-diamidino-2-phenylindole (DAPI) is used to identify cell nuclei. OCT4 is one of the critical transcription factors of pluripotency.\n\t\nIncubate H9 hESCs in MACME arrays in hPSC medium supplemented with 10 µM EdU alkyne at 37 °C for 30 min.\nAfter washing with annexin-binding buffer (10 mM HEPES (pH 7.4), 140 mM NaCl, 2.5 mM CaCl2), stain the cells with an orange-fluorescent dye-Annexin V conjugate at 20 °C for 15 min.\nFix cells in PBS with 4% (v/v) paraformaldehyde at 20 °C for 15 min, and then rinse cells with PBS twice.\nPermeabilize cells using PBS with 0.3% (v/v) Triton X-100 at 20 °C for 16 h.",
    "Note: Paraformaldehyde weakens the bond between a plastic base plate and a PDMS microfluidic structure. Thus, the detachment of the PDMS layer from the array at step 3.2.1 can also be performed right after this step.\nIncubate cells in Tris-based reaction buffer with a red-fluorescent dye azide at 20 °C for 30 min.\nIncubate cells in blocking buffer (PBS with 5% (v/v) normal goat serum, 5% (v/v) normal donkey serum, 3% (w/v) bovine serum albumin, 0.1% (v/v) Tween-20, and 0.1% (w/v) N-dodecyl-β-D-maltoside) at 4 °C for 16 h.\nIncubate in PBS with 0.5% (v/v) Triton X-100 solution and human OCT3/4 antibody (mouse IgG) at 4 °C for 16 h.\nIncubate in blocking buffer with green-fluorescent dye-labeled donkey anti-mouse IgG (H+L) at 37°C for 60 min.\nIncubate in PBS with DAPI at 20 °C for 30 min.\nReplace PBS-DAPI with PBS.\nPreserve the MACME array at 4 °C until image acquisition.\nImage acquisition (Figure 4)\nPeel off the PDMS microfluidic structure from the MACME array.\nRemove the residual PBS from the MACME array, apply 90%(v/v) glycerol in PBS to the cells and place coverslips over the stained cells.\nSet the plate upside down on the stage of an inverted fluorescence microscope.\nAcquire 12-bit color images automatically using all motorized components (stage, filters, shutter, and focus systems) that were controlled by a microscope imaging software.\nNote. In this protocol, exposure times are adjusted to reach near maximum intensity values (highest pixel intensity: 4096), but no saturation, for each image, DAPI, OCT4, Annexin V, and EdU.\nComputer-guided image processing and fluorescence signal quantification (Figure 5)\n\tNote: The following cell image analysis is performed based on a previously described method37.\n\t\nConvert color images to grayscale.",
    "Calculate a single threshold value for each DAPI image with the Otsu method and classify pixels above the threshold as foreground and below as background. Ensure that the foreground value corresponds to the fluorescent intensity of DAPI.\nNote: The image analysis process contains 5 steps; identification of primary objects in DAPI images, identification of secondary objects in OCT4, Annexin V, and EdU images, respectively, and measurement of object intensity. Figure 3 provides the images of graphical user interface (GUI) on the setting of image processing.\nMeasure the fluorescent intensities of OCT4 and EdU on each image.\nIdentify the region stained with Annexin V with the propagation method, and quantify the fluorescent intensity.\n3.4. Statistical analysis to visualize individual cellular phenotypes on single-cell imaging\nNormalize the input fluorescent intensities of each phenotypic marker by centering and scaling these variables to give them equal weight.\nPerform self-organizing map (SOM) analysis by using a software environment for statistical computing and graphics as described by previous studies38,39.\n\t\t\nCreate 25 SOM nodes with distinctive four \"codebook vectors\" corresponding to the fluorescent intensities of four markers, DAPI, EdU, Annexin V, and OCT4.\nAssign individual cells in each microenvironment to a \"winning\" (most similar) node, and plot as cell frequency, according to which the codebook vectors of the winning node are updated using a weighted average, where the weight is the learning rate (here, 0.05 as default).\nNote: Omit data from chambers containing less than 1,000 cells because datasets containing a few cells did not provide statistically relevant SOM results.\nPerform unsupervised hierarchical clustering with the SOM-node values using the average-linkage method based on Pearson correlation by a clustering software40.\nRender the clustering data into dendrogram and heatmap views41.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}