{
  "id": 10052,
  "origin_website": "Jove",
  "title": "Creation of a Knee Joint-on-a-Chip for Modeling Joint Diseases and Testing Drugs",
  "procedures": [
    "The following protocol follows the ethical guidelines of the University of Pittsburgh and the human research ethics committee of the University of Pittsburgh. Information on the materials used in this study is listed in the Table of Materials.\n1. Manufacturing 3D-printed bioreactors\nUse a computer software to design osteochondral (Figure 2A) and miniJoint bioreactors (Figure 2B) that include chambers, inserts, and lids. The dimension information for each part is shown in Figure S1.\nTransfer the design to a 3D printer, and print with a photopolymer ink.\nRinse the 3D-printed parts (Figure 2C-F) with 15 mL of 95% ethanol three times. Then, fully crosslink the printed pieces for 200 s in a flashlight polymerization device.\nAdd O-rings to inserts and lids (Figure 2C, D), and test if the parts fit (Figure 2G, H).\nimgsrc://cloudfront.jove.com/files/ftp_upload/64186/64186fig02.jpg\nFigure 2: Fabrication of the different components to make the miniJoint bioreactor. (A,B), 3D models of bioreactors for creating (A) osteochondral and (B) miniJoint chips. (C,D) 3D printed (C) lids and (D) inserts with the O-ring installed. (E,F) 3D printed chambers for (E) osteochondral and (F) miniJoint tissue culture. (G,H) Assembly of (G) osteochondral and (H) miniJoint chips. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/64186/64186fig02large.jpg]\n2. Engineering the tissue components\nNOTE: The processes for the fabrication of lithium phenyl-2,4,6-trimethylbenzoylphosphinate (LAP) and methacrylated gelatin (GelMA) are described in previous studies8,9.\nTo create GelMA, follow the steps below.\n\t\nAdd 17 g of gelatin Type B to 500 mL of distilled water, and then mix on a shaker for 30 min at 37 °C.\nThen, add 13 mL of methacrylic anhydride, place back on the 37 °C shaker, and allow to shake overnight.\nThe following day, aliquot the GelMA into individual dialysis bags, with ~60 mL in each bag.",
    "Place all the dialysis bags in distilled water with a stir bar, and allow for 7 days of dialysis. Change the water multiple times per day, and leave the bags at 4 °C overnight.\nOn day 7, freeze the GelMA at −80 °C. Once completely frozen, proceed to lyophilization.\nPlace the GelMA in a dish in the vacuum chamber of a lyophilizer, and allow for freeze-drying. Ensure the GelMA is completely dried prior to removal from the lyophilizer.\nDissolve the GelMA in Hank's balanced salt solution (HBSS with Ca2+ and Mg2+) at 15% (w/v). To ensure the pH is at 7.4, add NaOH in small amounts until the pH reaches 7.4. Supplement the solution with 1x antibiotic-antimycotic and 0.15% (w/v) LAP based on the volume acquired. Store the 15% GelMA solution at −20 °C until use, and protect it from light.\nPlace 3D-printed dual-flow bioreactor chambers, lids, and inserts into autoclave bags, and autoclave at 121 °C for 20 min with steam and then for 20 min with dry heat.\nInside the biological safety cabinet, soak the bioreactor chambers, lids, and inserts in 15 mL of sterile phosphate-buffered saline overnight, after which allow them to dry.\nIsolate human bone marrow-derived MSCs from total joint arthroplasty surgical waste with IRB approval (University of Pittsburgh and University of Washington).\n\t\nSpecifically, flush out the bone marrow from the trabecular bone of the femoral neck and head, and resuspend it in Dulbecco's Modified Eagle's Medium (DMEM).\nFilter the suspension through a 40 µm strainer, and centrifuge the flow-through at 300 x g for 5 min.\nRemove the supernatant, resuspend the pellets using growth medium [DMEM, 10% fetal bovine serum (FBS), and 1x antibiotic-antimycotic], and then place into tissue culture flasks.",
    "Change the culture medium every 3 days to 4 days. Ensure that a confluence of 70% to 80% is reached before proceeding further.\nDetach the cells by incubating with trypsin-EDTA for 2-3 min, and passage at a ratio of 1 million cells per T150 flask.\nExpand the cells to P5. After trypsinization, suspend the cells, count them, and then pellet by centrifuging at 300x g for 5 min.\nWith a 1,000 µL pipette, resuspend the cells at 20 x 106 cells/mL in 15% GelMA solution.\n\tNOTE: Turn off the light of the biological safety cabinet.\nUsing sterile gloves, press a sterile, dry silicone mold against a Petri dish. Then, put one insert into each hole of the silicone mold with forceps, with the hole side of the insert facing down.\nUsing a 200 µL pipette, add the cell suspension to fill up the insert (~50 µL per insert).\nUse a UV flashlight (LED light with a wavelength of 395 nm) to crosslink the top of the gel/insert for 1.5 min. Then, illuminate the other side for 30 s. Crosslinking occurs when the LAP photoinitiator is exposed to UV light.\n\tNOTE: The cell suspension may be kept in the incubator during this period or protected from light.\nWith sterile forceps, immediately transfer the inserts into 8 mL of growth medium in a non-tissue culture 6-well plate (DMEM supplemented with 10% [v/v] FBS and 1x antibiotic-antimycotic) to allow the cells to recover overnight.\nDifferentiate the cells toward four lineages.",
    "To engineer adipose tissue (AT), transfer the inserts to 8 mL of adipogenic medium (AM; Alpha-MEM, 10% FBS, 0.2 mM indomethacin, 1x insulin-transferrin-selenium (ITS), 0.45 mM 3-isobutyl-1-methylxanthine, 0.1 μM dexamethasone, and 1x antibiotic-antimycotic) to initiate differentiation. Ideally, four inserts are placed in a single well of a non-tissue culture well plate with 8 mL of adipogenic medium. Culture the cells in the well plates for 28 days, with medium changes every other day.\nTo engineer the osteochondral units (OC), place the inserts into dual-flow bioreactor chambers, cap the wells, and infuse the two streams separately at a flow rate of 5 µL/min with 35 mL of osteogenic medium (OM; DMEM, 10% FBS, 1x antibiotic-antimycotic, 0.1 μM dexamethasone, 0.01 M β-glycerophosphate, 100 ng/mL bone morphogenic protein 7 (BMP7), 50 µg/mL ascorbic acid, and 10 nM vitamin D3) and 35 mL of chondrogenic medium (CM; DMEM, 1x antibiotic-antimycotic, 1x ITS, 0.1 μM dexamethasone, 40 µg/mL proline, 50 µg/mL ascorbic acid, and 10 ng/mL transforming growth factor β3)10. Maintain cell differentiation for 28 days by performing biweekly medium changes.\nTo derive the fibroblasts, differentiate the MSCs in 2D culture over 21 days in a T150 cm2 tissue culture flask using 20 mL of fibrogenic medium (FM; advanced DMEM, 5% FBS, 1x GlutaMAX, 1x antibiotic-antimycotic, and 50 µg/mL ascorbic acid). Change the medium every week. Use 4 mL of trypsin to detach the cells, and encapsulate the 3D gels within the inserts, following the protocol described above, to obtain synovial like-fibrous tissue (SFT).\n\t\tNOTE: The compositions of all the differentiation media can be found in Table 1.\n3. Establishing the miniJoint chip",
    "Autoclave the 3D miniJoint bioreactor chambers, silicone tubing with a 0.062 inch inner diameter and a 0.125 inch outer diameter, and F 1/16 Luer-lock connectors. Connect the silicone tubing to the miniJoint bioreactor barb at one end, and connect the Luer lock at the other end.\nPrepare the AM, OM (removing BMP7), and FMCM mentioned in step 2.11. Additionally, prepare the common shared medium (SM; phenol red-free DMEM, 1x antibiotic-antimycotic, 1x Na-pyruvate, 1x ITS, 40 µg/mL proline, 50 µg/mL ascorbic acid, and 0.5 ng/mL transforming growth factor β3) to be used for the miniJoint culture. Load 35 mL of each medium into the medium reservoirs.\nUse straight forceps to transfer the osteochondral unit from the dual-flow bioreactor to the right well of the miniJoint bioreactor. Transfer the adipose tissue insert and fibrous tissue insert into the left and middle wells, respectively. Cap all the wells with sterilized lids.\nConnect the inlets of the miniJoint chip to the medium reservoirs and the outlets to syringes (Figure 3A-C).\nMount the syringes onto a syringe pump (Figure 3C), and transfer the pump and chips to an incubator. The medium reservoirs are kept on ice outside the incubator.\nOperate the pump in the withdraw mode, drawing the medium from the medium reservoir into the miniJoint bioreactor chamber. This miniJoint culture process lasts 28 days.\nTo model joint inflammation and cartilage degeneration, add interleukin 1β (IL-1β) to the fibrogenic medium stream at 10 ng/mL. Replace the syringes on the third day of IL-1β treatment, and provide fresh IL-1β to the fibrogenic medium. The treatment lasts for 7 days.",
    "During the drug testing step, after 3 days of IL-1β treatment, administer the drug either in the shared medium, simulating an \"intraarticular administration\" (Figure 3D) when the drug is used locally in the knee joint, or in all the medium types, simulating a \"systemic administration\" (Figure 3E) when the drug acts on the knee joint through the circulation.\nCollect individual tissues for analysis after 7 days of IL-1β treatment whether or not the samples underwent drug treatment for the previous 4 days.\nimgsrc://cloudfront.jove.com/files/ftp_upload/64186/64186fig03.jpg\nFigure 3: Assembly of the miniJoint. (A,B) Tissue-specific media are introduced from inlets 1-3 (I1-3) and moved out from outlets 1-3 (O1-3). The shared medium is perfused from I4 to O4. (C) The full setup of the miniJoint culture. Drugs (green sun like shapes) can be either introduced into (D) the shared medium only or (E) all the mediums to respectively simulate \"intraarticular administration\" or \"systemic administration\". Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/64186/64186fig03large.jpg]\n4. Individual tissue collection\nUse sterile curved forceps to remove the inserts.\nPush a biopsy punch through the center of the insert to remove the gel, and place the gel in PBS.\nCut the osteochondral gels in half when assessing the gene expression.\n\tNOTE: Since the osteochondral gel consists of two tissue types, it is important to separate the osteogenic and chondrogenic cells.\nCollect the conditioned media and tissues for various experiments.\n\t\nCollect around 1.5 mL from each medium source.\nFlash-freeze the conditioned media in liquid nitrogen after centrifuging at 14,000 x g for 10 min and discarding the sediment.",
    "For histological staining and immunostaining, first fix the OC and SFT samples in 10% buffered formalin, dehydrate them in ethanol of ascending concentrations, clear them in xylene, embed them in paraffin, and finally section them at a thickness of 6 µm.\nFor the AT microtissues, fix the samples in 10% buffered formalin, and directly stain them with Oil Red O solution or BODIPY.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}