{
  "id": 18794,
  "origin_website": "Jove",
  "title": "Heterotopic Mucosal Engrafting Procedure for Direct Drug Delivery to the Brain in Mice",
  "procedures": [
    "Prior to surgery make sure all procedures to be done are approved by IACUC and any additional ethical or legal authorities and use humane animal treatment practices. This includes using sterile surgery conditions, anesthetizing the mouse using IACUC approved method, lubricating mice eyes with vet ointment during surgery, and providing postsurgical care. Do not proceed with surgery if there is any question whether aspects of the procedure are approved. All procedures performed herein were approved by the Boston University Institutional Animal Care and Use Committee.\n1. Preparation of Animals and Surgical Supplies\nAutoclave all surgical instrument that will be used during the surgery.\nMake sure all techniques that are to be performed are approved by the animal regulatory agencies.\n2. Harvesting of the Mucosal Graft\nChose a genetically identical mouse of similar age as the experimental mouse and euthanize it in an IACUC approved method (here: isoflurane asphyxiation followed by cervical dislocation).\nUsing surgical scissors, remove the skin around the nasal region of mouse head exposing the skull.\nWith a pneumatic drill, mark with three lines two of which laterally flank the nasal region and a third in line with the eyes which connects the two lines perpendicularly.\nDrill down ventrally in order to separate the nasal septum from the surrounding tissue. A wider path will prevent damage to the mucosal membrane however it will also make it more difficult to isolate the membrane. A narrow cut closer to midline is recommended.",
    "Use scissors to cut the septum free from any tissue adhered to it and store it in a sterile saline solution. At this time the graft can be cleaned up to remove any connected tissue. The ideal situation is to have undamaged mucosal membranes exposed on both sides of the cartilage septum. One graft can supply membrane for two mice provided the surface area of the membrane is sufficient to cover the craniotomy sites. It is recommended that the graft is used as quickly as possible and the researcher proceeds to step 3 as soon as the graft is isolated.\n3. Surgical Implantation of Mucosal Graft\nUsing standard, aseptic murine surgical procedures, anesthetize and mount a mouse in the stereological frame. Use approximately 2% isoflurane in pure oxygen using a rodent anesthesia machine.\nImmobilize the mouse in a stereotaxic apparatus with ear bars and a nose holder. Apply ophthalmic ointment to the eyes and scrub the scalp with betadine and 75% ethanol for three rounds. Using either scissors or a hair trimmer, remove the fur on the head. Expose the skull with a razor blade and level the head. Perform a craniotomy above the location of the brain that will be dosed. For example, when targeting the striatum cut a 1.25 mm diameter circular hole in the skull (centered at AP: 1.00 mm; ML: 0.88 mm) using a pneumatic drill. Wet the drilled area with sterile saline and use a razor blade to remove the skull.\nCarefully remove the dura using the tip of a needle. Additionally, this can be accomplished by applying a minimal amount of tissue adhesive to the moist dural surface. Once this layer has hardened, lateral motion with a razor blade tip can be used to remove the membrane.",
    "Place the mucosal membrane above the brain surface taking extreme care to keep the epithelial side facing away from the wound. This is best done by transferring the entire septum on to the surface of the skull adjacent to the craniotomy site with tweezers. Using the tip of a pair of surgical scissors, pull the membrane off of the cartilage and onto the skull and brain surface. Do not let the membrane dry out or touch it with any absorbent material. The graft should generously overlap all bony edges of the craniotomy site.\nCover the graft with a sterile piece of nitrile. This acts to prevent adhesion of the skin to the graft during healing. The nitrile needs to be large enough to cover the entire mucosal membrane. Trim excessive membrane if necessary. Avoid any motion of the nitrile once it has come into contact with the graft.\nClose the skin with a running 5-0 sterile suture and let the mouse recover for 3-7 days before proceeding to the next step. Take care not to perturb the nitrile barrier or the mucosal graft during skin closure.\n4. Administration of Dosing Solution\nAfter securing the anesthetized mouse in the stereotaxic frame, cut the suture with scissors and remove excess skin around the skull.\nRemove the nitrile barrier and clean the surface of the skull. Use sterile saline and cotton swabs to clean the area until the graft is visible. It may be necessary to cut the graft with a razor if has grown larger than the desired surface area.\nIf the experiment will be longer than a few days, it is wise to implant at least two skull screws to reinforce the head implant.",
    "Place the well above the graft so that the edges are in contact with the skull. Apply cyanoacrylate adhesive at the junction between the well and the skull. Fill the well with sterile saline and check to make sure there are no leaks. Wells are made from cut syringe needles.\nApply bone cement on the skull to secure the well in place.\nRemove the saline from the well with a pipette. Wash the well several times to verify that adhesive has not leaked in. Add the desired solution; in this case 50 μl of fluorescent dextran is used. It is expected that water soluble compounds of a similar polarity will behave the same as dextran. Delivery of hydrophobic compounds or suspensions has not been explored with this method.\nCap the top of the well by using a circular piece of nitrile secured to the top using cyanoacrylate adhesive. Make sure the adhesive does not come in contact with the well contents.\n5. Analysis of Transmucosal Delivery\nAfter the desired amount of time has passed, anesthetize the mouse and exchange the well contents with a solution of Evan's blue dye. This dye is used to verify that the graft was intact.\nAfter 30 min, anesthetize the mouse heavily, remove the dye solution, and euthanize via decapitation.\nManually remove the implant and remove the brain using surgical scissors. Be careful to keep the graft in place.\nOnce removed, flash-freeze the brain in a solution of isobutane cooled in a dry ice bath.\nEmbed the brain in Optimal Cutting Temperature (OCT) solution and slice at 50 μm.\nPlace the desired slices directly on a microscope slide.\nImage the slice using a florescence microscope as soon as the OCT solution has dried.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}