{
  "id": 2669,
  "origin_website": "Cell",
  "title": "Non-invasive chimeric HaloTag labeling to study clustering and diffusion of membrane proteins",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPreparing C. elegans for HaloTag imaging\nTiming: 30 min active, overnight incubation (1–7 days the first time) (for step 1)\nThe HaloTag labeling can be achieved by feeding in this protocol. This step shows how to feed the two different HaloTag ligand dye to C. elegans in liquid culture to achieve the labeling of target protein population.\nMaintain the desired C. elegans strain on the standard NGM plates with OP50 bacteria feeding. For additional details regarding C. elegans culturing and handling, please refer to the Wormbook “Maintenance of C. elegans”.\nPrepare HB101 liquid culture for feeding.\nNote: HB101 is easier for worms to eat and improves worm health in liquid culture, but OP50 can be used instead if desired.\nStreak out bacteria from the glycerol stock in the −80°C freezer onto an LB plate (with no antibiotics) and grow 12–18 h at 37°C.\nPick a single colony and inoculate in 5 mL of LB liquid medium, shake at 37°C for 12–18 h.\nStore the culture at 4°C for up to 3 months (longer times have not been tested).\nPrepare S medium and egg buffer by mixing the ingredients listed in the Key Resource Table. These solutions are stable at 20°C–25°C for several months.\nFeeding dyes to worms in mini-scale liquid culture (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2161-Fig2.jpg\nFigure 2. Standard operating procedure for labeling the HaloTag in C. elegans, related to ‘preparing C. elegans for HaloTag imaging[href=https://www.wicell.org#sec3.1]’\n(A) Cartoon illustration of the procedure for JF dye feeding in C. elegans. Created with BioRender.com[href=http://BioRender.com].\n(B) A hook shaped worm pick. The tip of the worm pick is zoomed out in the lower panel.\nPrepare the feeding culture mix.\nPrepare two 1.5 mL tubes, label as JF585 and JF646.",
    "Add 1 mL∗ of HB101 liquid culture in each tube, spin down the bacteria by centrifuge at 1500 x g for 3 min, remove the supernatant.\nNote: The volume of bacteria to use depends on the density of the culture. After adding the worms in step 4c, you should be able to see them swimming under a stereomicroscope. If the culture is too turbid, reduce the amount of bacteria used.\nAdd 100 μL S media to each tube, resuspend by pipetting up and down.\nAdd JF dyes to the culture mix.\nDissolve one aliquot each of JF585 and JF646 in 2 μL DMSO to reconstitute a 1 mM stock.\nNote: A working aliquot of DMSO can be kept at 20°C–25°C for 2 weeks; keep additional aliquots at −20°C. Discard the room-temperature DMSO aliquot and replace with fresh aliquot from the freezer or from a newly opened DMSO ampule every 2 weeks.\nCritical: Fresh DMSO is required for C. elegans survival. If experiencing a worm survival issue, see troubleshooting[href=https://www.wicell.org#troubleshooting] section for more information.\nAdd 1.5 μL of dissolved JF585 and JF646 to each of their respective tubes of bacterial suspension to reach a final concentration of 15 μM.\nCulture set up and incubation.\nAdd 2 μL of JF585-medium-bacteria mix to 100 μL JF646-medium-bateria mix to obtain a 1:50 ratio∗ of JF585:JF646 in the final culture.\nAdd 30 μL of the dye mixture to one well of a round-bottom 96-well plate.\nPick 20–30 L4 worms into the culture.\nAdd a total of ∼200 μL water to adjacent wells or seal with parafilm to prevent drying out.\nShake at 225 rpm in a 20°C incubator for 16–18 h.",
    "Note: Fluorescent dyes differ in their cell permeability and affinity for HaloTag, and this ratio has been optimized for the combination of JF585 (sparse) and JF646 (abundant). If different dye combinations are to be used, perform a titration experiment to determine the ideal ratio.\nMicroscope settings\nTiming: 10 min\nThe protein population labeled chimerically by HaloTag ligand dyes can be imaged using a dual-view imaging system. This step describes how to acquire images, using open-source Micro-Manager software as an example. These instructions should be adaptable to other microscope control software.\nIn order to achieve the high frame rate required for diffusion analysis while also imaging a second fluorescence channel, the two channels need to be acquired simultaneously (not in an alternating fashion). We achieved this by constructing a dual-view image splitter (see the ‘materials and equipment[href=https://www.wicell.org#materials-and-equipment]’ section, above and the supplemental information[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2161-Mmc1.pdf]), but a dual camera setup is also possible. To avoid unnecessary delays, turn on the microscope and configure your acquisition before preparing your sample.\nAlign the 2 channels with TetraSpeck fluorescent beads. This calibration step should be done at the beginning of each day, before starting the experiment.\nBefore use, dilute TetraSpeck fluorescent glass beads 1:50 in water.\nPlasma treat a glass coverslip for 3–5 min on max power.\nNote: Alternatively, if you do not have access to a plasma cleaner, prepare the coverslip by soaking in 1 M KOH for 20–30 min and then rinsing with plenty of water. This step renders the glass surface hydrophilic so that the TetraSpeck beads will stick to it.\nVortex the TetraSpeck beads vigorously.\nTransfer 15–20 μL beads to the prepared coverslip.\nPlace the coverslip on a cold hot plate, turn on, and leave until the liquid evaporates (20–30 s).\nAdd 10 μL of egg buffer, PBS or water.",
    "Using a dry pipette tip, add a small amount of glass spacer beads by dipping the pipette tip into the vial of beads and then quickly touching the tip to the liquid droplet.\nCover with a microscope slide and seal with VALAP. The prepared bead slide can be kept on the benchtop at 20°C–25°C for 4–6 weeks.\nOn the dual-view microscope, view live images of the beads with the red and far-red channels overlaid.\nNote: 50 ms exposure with 5 mW 561 nm laser power is usually sufficient to visualize both red and far-red fluorescence from the beads.\nAdjust the image splitter so that the 2 channels are perfectly aligned.\nAcquire a reference image of the beads to document the alignment and to use for image registration corrections later, if needed.\nSet the laser to desired powers.\nNote: The laser power will be instrument-dependent and needs to be determined empirically. To determine the appropriate laser power, excite the desired sample with a 561 nm laser, and gradually increase the power until single molecules can be visualized clearly by eye in the live images. If phototoxicity is observed, lower the laser power as needed for embryo survival. The final settings should yield a particle brightness (‘amplitude’) of 12–14 a.u. after particle tracking is performed (see “Particle Tracking”, below). Note that we do not use 638 nm excitation to visualize the far-red dye in these experiments; both red (sparse) and far-red (abundant) dyes are efficiently excited by 561 nm light, and their emission signals are separated by the image splitting optics.\nSet exposure time to 50 ms.\nSet imaging frequency to 20 frames / second.\nSet acquisition length according to the cell stage of interest.\nDissecting, mounting and imaging\nTiming: 40 min (for step 10)",
    "This step provides detailed step-by-step instructions on how to harvest, mount, and image C. elegans embryos.\nPrepare coverslip for imaging.\nAdd 11 μL droplet of polylysine on a microscope slide.\nPlace a 22 mm × 22 mm coverslip on top of the droplet.\nBake on hot plate at >100°C for ∼30 s until all liquid evaporates.\nDissect worms to obtain embryos.\nTake 1 worm out of the 96-well plate using a hook shaped worm pick (Figure 2[href=https://www.wicell.org#fig2]B) and check the stage. Worms should ideally be young adults with a single row of 8–10 eggs.\nIf the culture is at the desired stage, use a glass pipette to transfer the whole 30 μL liquid culture onto an OP50 NGM plate, let the liquid dry out and let the worms crawl on plate for a minimum of 30 min before imaging. This step eliminates excess unbound dye and allows clean visualization of the HaloTag.\nAdd 30 μL of egg buffer into a watch glass slide, and transfer 2–3 labeled worms from the NGM plate. Cut each worm in half with a pair of 26-gauge needles to release the embryos.\nMounting the embryos.\nTake the coverslip from step 10 and make sure the polylysine-coated side is facing up.\nAdd a 10 μL droplet of egg buffer onto the coverslip.\nUsing a dry pipette tip, add a small amount of 23–26 mm glass spacer beads by dipping the pipette tip into the vial of beads and then quickly touching the tip to the liquid droplet.\nTransfer an embryo of the desired stage onto the coverslip using a glass micro needle.\nGently place a microscope slide on the coverslip.\nSeal with VALAP.\nImaging.\nIf not already done, set up the microscope as described in the previous section (‘microscope settings[href=https://www.wicell.org#sec3.2]’).\nLocate the embryo under the microscope.",
    "Under a stereomicroscope, locate embryos at desired stage and draw a cross mark on the slide to mark the position of each embryo.\nPlace the slide on the microscope stage.\nMove the objective lens to the upper left quadrant of the cross and view live images using brightfield illumination.\nTurn off any autoscaling function (which adjusts the image display based on the brightness) in the imaging software.\nMove the stage towards the right slowly until the image darkens; this corresponds to the shadow of the cross mark made in step 13.b.i.\nMove the imaging field down (along y axis) while scanning left & right (along x axis) until the embryo is located.\nFocus.\nWhile still viewing live brightfield images, focus at the lower cortex of the embryo.\nTurn off the brightfield channel, switch to the far red (abundant dye) channel and take snapshots while adjusting the focus until fluorescent foci are in focus.\nNote: By taking snapshots rather than imaging continuously, photo-bleaching and phototoxicity will be limited.\nAdjust the penetration depth until cortical proteins are clearly visualized and the background signal (visible as rapidly-diffusing, out-of-focus signal from the cytoplasm) is as low as possible.\nNote: Imaging is performed using near-TIRF rather than true TIRF, due to the thickness of the eggshell. The penetration depth will need to be adjusted for each individual embryo, as the eggshell thickness can vary.\nUsing the red+far red dualview imaging channel, acquire timelapse images as configured in “Microscope settings,” above.\nData analysis: Particle tracking with Utrack\nTiming: 20 min to several hours (for step 14)",
    "This section provides detailed instructions on how to perform particle tracking in the software Utrack (Figure 3[href=https://www.wicell.org#fig3]A). Accurate particle tracking analysis is required for particle diffusion analysis. Therefore, this section also includes how to examine the tracking results to make sure the tracking was done correctly.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2161-Fig3.jpg\nFigure 3. The workflow and interpretation of the MSD analysis, related to ‘Data Analysis’\n(A) An illustration of the data analysis workflow. The appearance of the example data/results are shown to the right. Scale bar: 10 μm.\n(B) Correct and erroneous results from Utrack particle tracking. (a) Correct detection step result. (b) Erroneous detection step result: dimmer foci are not detected (white arrows). (c) Correct linking step result, orange lines represent the gaps in the tracks that have been connected by the software. (d) Erroneous linking step result: long straight lines and/or sharp turns (white arrows), and extensive gap filling (orange lines).\n(C) Graphical illustration of the interpretation of MSD plots and anomalous parameters. Figure modified from Chang and Dickinson.1[href=https://www.wicell.org#bib1]\n(D) An example illustration of the MSD analysis. Engineered Halo::PAR-3 clusters were labeled with JF585, data were pooled from 3 embryos. Left: the MSD curves. Blue lines are the MSD curve of each cluster tracked. Black line represents the averaged MSD curve. Middle: the averaged MSD curve. Right: the first derivative, or the slope, of the averaged MSD plot. Figure modified from Chang and Dickinson.1[href=https://www.wicell.org#bib1]\nSoftware download and installation.\nDownload and install ImageJ.\nDownload and install MATLAB.\nDownload Utrack from https://github.com/DanuserLab/u-track[href=https://github.com/DanuserLab/u-track].\nAdd Utrack to the MATLAB file folder, where all other scripts are stored.\nLaunch MATLAB, locate ‘u-track-master’ in the file navigator, right click ->‘Add to Path’ -> ‘Selected Folders and Subfolders’.\nDownload the ‘DualLabeling_Analysis’ package from https://github.com/dickinson-lab/DualLabeling_Analysis[href=https://github.com/dickinson-lab/DualLabeling_Analysis]. Add to MATLAB file folder and ‘add to path’.\nPrepare the movie for particle tracking.",
    "Use ImageJ to split the channels in the movie into two different movies.\nNote: If images were acquired side-by-side, this simply requires duplicating the image and cropping each channel. If the two channels were overlaid as a hyperstack, use the ‘Color -> Split Channels’ command.\nUse the ‘Save -> Image Sequence’ command to export each channel to an image sequence in its own separate folder. This will result in each folder having a series of single-plane TIFF files from one channel.\nTrack sparsely labeled particles with Utrack.\nIn MATLAB, use command\nmovieSelectorGUI\nto launch Utrack. A GUI window will appear (Figure S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2161-Mmc1.pdf]A).\nMovie Selection.\nClick ‘New’, a new window ‘Movie edition’ will appear (Figure S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2161-Mmc1.pdf]B).\nIn the ‘Channels’ section, click ‘Add Channel’, select the folder containing the image sequence of sparse/JF585 channel.\nClick ‘Advanced Channel Settings’, enter the requested information.\nEnter the requested information in the ‘Movie Information’ section.\nSelect your ‘Output Path’ where data will be saved.\nParticle tracking.\nIn the ‘Movie selection’ window, click ‘Continue’. A new window will appear. Select ‘[2D] Single particles’ and click ‘OK’ (Figure S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2161-Mmc1.pdf]C).\nA new window ‘Control Panel - U - Track’ will appear (Figure S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2161-Mmc1.pdf]D).\nCheck ‘Step 1: Detection’ and click on ‘Settings’.     A new window will appear, select ‘point source detection’ and click ‘Settings…’ (Figure S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2161-Mmc1.pdf]E).     A new window will appear (Figure S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2161-Mmc1.pdf]F), in the ‘Parameters for’ section, set ‘Alpha’ to 0.03∗. Click ‘Apply’.",
    "Note: Alpha is the key parameter that sets the sensitivity threshold for particle detection (for a more detailed description, see.11[href=https://www.wicell.org#bib11] In our experience, an Alpha of 0.05 resulted in detection of background noise, therefore we reduced Alpha to 0.03 for cleaner detection. The most appropriate alpha should be determined for different noise levels, fluorescence intensity and/or particle density, by analyzing a few samples and visually inspecting the particle detection.\n    All other settings are left as default.\nCheck ‘Step 2: Tracking’ and click on ‘Settings’.     A new window will appear (Figure S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2161-Mmc1.pdf]G).     In the ‘Parameters’ section, set ‘Maximum Gap to Close’ to 3, and ‘Minimum Length of Track Segments from First Step’ to 2. Click on ‘Apply’.\nCritical: The maximum GAP should be adjusted according to particle density. A denser population would require a lower ‘max GAP to close’ to avoid false linking between different particles. See ‘checking tracking results’ for more details.\nClick ‘Run’.\nChecking tracking results.\nClick ‘Results’ for step 1.\n4 windows will appear.\nIn the ‘Viewer’ window (Figure S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2161-Mmc1.pdf]H), check and uncheck ‘point sources’ a few times while looking at the ‘Movie’ window to make sure the particles are detected correctly (Figure 3[href=https://www.wicell.org#fig3]Ba).\nCritical: If background noise is falsely detected as particles, decrease the value of Alpha in the particle detection settings. If some real particles are missed, increase the value of Alpha (Figure 3[href=https://www.wicell.org#fig3]Bb).\nClick ‘Results’ for step 2.\n4 windows will appear.\nIn the ‘Viewer’ window (Figure S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2161-Mmc1.pdf]H), check ‘Static tracks’ and examine the track appearance in the ‘Movie’ window.",
    "Critical: An appropriate ‘Maximum Gap to Close’ will result in relatively smooth tracks (Figure 3[href=https://www.wicell.org#fig3]Bc), with the length of each track segment being roughly the same. Outstanding long straight lines or sharp angles are indications of false linking between different particles (Figure 3[href=https://www.wicell.org#fig3]Bd), the ‘Maximum Gap to Close’ should be reduced if this is observed.\nExtracting track information from Utrack:\nIn your output data folder, locate the results file: Output path -> TrackingPackage -> tracks -> Channel_1_tracking_result.mat.\nDrag this file into MATLAB workspace. A cell array named ‘tracksFinal’ will be imported (Figures 3[href=https://www.wicell.org#fig3]Aa and 3Ab).\nUse command.\ntracks = convert_Utrack(tracksFinal);\nto organize ‘tracksFinal’ into a more readable format (Figures 3[href=https://www.wicell.org#fig3]Ab and 3Ac).\nData analysis: Particle diffusion analysis\nThe MSD plots provide information about particle diffusion behavior via the anomalous parameter α. An α < 1 suggests confined or sub-diffusive motion, where the movement of particles are restricted; an α = 1 indicates normal Brownian diffusion; and an α > 1 represents a directed motion, where particles move in a directed manner due to an external force (Figure 3[href=https://www.wicell.org#fig3]C). These steps shows how to determine the diffusion coefficient and anomalous parameter from the MSD analysis.\nPerform MSD analysis and anomalous parameter visualization:\nSoftware download and installation.\nDownload ‘MSDanalyzer’12[href=https://www.wicell.org#bib12] from https://tinevez.github.io/msdanalyzer/[href=https://tinevez.github.io/msdanalyzer/], add to MATLAB file folder and ‘add to path’.\nDownload and install ‘SLM toolbox’ from https://www.mathworks.com/matlabcentral/fileexchange/24443-slm-shape-language-modeling[href=https://www.mathworks.com/matlabcentral/fileexchange/24443-slm-shape-language-modeling].\nLaunch MATLAB, if not done so already, re-organize Utrack result by using the command.\ntracks = convert_Utrack(tracksFinal)\nPerform MSD analysis.\nOur dual-labeling analysis package includes a script to generate normal and log-log MSD plots. After preparing the data and generating particle tracks as described above, use the command.\nmsd = runMSD(tracks);\nto generate linear MSD plots, and transform plots to log-log scale using:\nset(gca, 'YScale', 'log');\nset(gca, 'XScale', 'log');",
    "Note: Before running this command, we usually remove short tracks (<0.5 s) to reduce the background noise and the signal from cytoplasmic PAR-3. This can be accomplished by using the script ‘PickLongTracks’ included in the ‘DualLabeling_Analysis’ package:\nTracks = PickLongTracks(10, tracks);\nWhere the first argument indicates the minimum number of frames (10) that a track should have in order to be included in the analysis.\nInspect the plots to identify the type of motion a particle is experiencing (Figure 3[href=https://www.wicell.org#fig3]C).\nNote: A straight line on the linear-scale plot indicates that the particle is undergoing normal diffusion, while concave-up or concave-down curves indicate directed or confined motion, respectively (Figure 3[href=https://www.wicell.org#fig3]C, left). Straight lines on the log-log plot indicate time-invariant motion; that is, particles move in the same way on short and on long timescales, with a slope indicating the type of motion (Figure 3[href=https://www.wicell.org#fig3]C, center). MSD curves that are not straight lines on a log-log plot indicate that a particle is undergoing different kinds of motion on different timescales. For example, engineered hexameric PAR-3 exhibits confined diffusion on short timescales but directed motion on longer timescales (Figure 3[href=https://www.wicell.org#fig3]D).\nEstimate the diffusion coefficient.\nDetermine the diffusion coefficient of a membrane-bound speciesby fitting the linear-scale MSD curves to the 2D diffusion equation:\nMSD = 4Dtα.\n where D is the diffusion coefficient, t is the time step and α is the anomalous parameter. Fitting can be done using the curve fitting toolbox within MATLAB or a third-party tools like ezyfit (http://www.fast.u-psud.fr/ezyfit/[href=http://www.fast.u-psud.fr/ezyfit/]).",
    "Critical: For cases where the log-log MSD plot shows different kinds of motion on different timescales, the data will be poorly fit by the diffusion equation, since this equation assumes that the diffusion of a particle is time-invariant. In such a situation, estimate the diffusion coefficient by fitting only the first few time steps of the MSD curve when the motion should be close to normal diffusion (see Figure S3[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2161-Mmc1.pdf]A of Chang and Dickinson, 2022 for an example).\nEstimate the anomalous parameter. For cases where the diffusion of a particle is time-invariant, the anomalous parameter α will be obtained from the fit in step 21a and is equivalent to the slope of the log-log MSD curve. For situations where particles undergo different types of motion on different timescales, the anomalous parameter at different time lags can be visualized by estimating the derivative of the log-log MSD plot.\nCheck that the ‘msd’ variable, from step 20a above, is still defined in the MATLAB workspace. If not, run step 20a again.\nExtract the log mean MSD curve using the command.\nlogMeanMSD = log10(msd.getMeanMSD);\nVisualize different values of the anomalous parameter (indicating different kinds of motion) on different timescales.\nEstimate the slope of the log-log MSD curve by taking the first derivative of a spline fit to the data. This can be done in MATLAB using the SLM toolbox. Start by running the following command:\nslm = slmengine(logMeanMSD(:, 1), logMeanMSD(:, 2),…\n‘plot’,’on’);\nNote: This will plot the data and a fit.\nPlot the first derivative (which gives the value of the anomalous parameter) by choosing “First Derivative” from the “Plot” menu of the figure window.\nTo extract the first derivative to a vector for further analysis, plotting or manipulation, use:\nalpha = slmeval(logMeanMSD(:, 1), slm, 1);",
    "where the final argument (‘1’) indicates to evaluate the first derivative.\nTips for getting a good SLM fit that accurately represents the data:\nDepending on the data, you may want to limit the fit to only shorter timescales where the data are not too noisy. This can be done by constraining the range of values passed to slmengine. For example, to plot and fit only the first 100 time delays, use:\nslm = slmengine(logMeanMSD(1:100, 1), logMeanMSD(1:100, 2),… ‘plot’,’on’);\nThe SLM toolbox has many additional options that can be used to constrain properties of the fit. These are specified by passing additional arguments as key/value pairs to the slmengine command. An option that we use frequently is ‘increasing’, ‘on’, which constrains the fit to be an increasing function. This constraint is physically realistic, since diffusing molecules always have an increasing MSD with increasing time step. Other options are described in the SLM toolbox documentation.\nData analysis: Calculating cluster intensity for particles labeled in the abundant channel\nPAR-3 is an oligomeric scaffold protein, in which the segregation behavior varies for different cluster sizes.1[href=https://www.wicell.org#bib1] Therefore, observing the diffusion pattern with cluster size information was critical for our study. Many other membrane proteins also oligomerize,16[href=https://www.wicell.org#bib15] and so measuring the intensity of clusters that contain a tracked tracer molecule is of general value. The following are used to extract the cluster intensity from the abundant channel.\nIf you have not done so already, prepare the abundant/far-red channel as an image sequence using ImageJ as explained above.\nNote: You also need to have completed tracking for the sparse/red channel prior to this step.\nEnter the command.\ntracks = getClustersize_10frames(tracks);",
    "Note: This script eliminates any tracks that are less than 10 frames long and uses the first 10 frames to calculate the cluster intensity. We usually remove short tracks (<0.5 s) to reduce the background noise and the signal from cytoplasmic PAR-3. If analysis of short tracks or estimating from the 1st frame only is needed, use:\ntracks = getClustersize(tracks);\ninstead.\nA window will appear. Select the folder containing the abundant/far-red channel image sequence.\nThe result will be shown as an additional column in ‘tracks’, named [size_far-red].\nData analysis: Estimating the number of molecules per cluster with a calibration experiment\nThe intensity of single fluorophores varies systematically from embryo to embryo due to variations in mounting, focus and eggshell thickness. However, the intensities of the red and far-red channels vary in tandem, and their ratio of intensities is constant. Therefore, we performed calibration experiments in which both JF585 and JF646 were diluted to single-molecule levels. With this dataset, we are able to use the red dye, which present as single molecules in both calibration and tracking experiments, as an internal standard to correct the embryo-to-embryo variations in far-red dye intensity. This section allowed accurate estimation of the number of far-red molecules per cluster based on the far-red particle intensity.\nWorm feeding and movie acquisition:\nPrepare 3 microcentrifuge tubes as described above.\nTube 1: JF585-bacteria-S medium mix.\nTube 2: JF646-bacteria-S medium mix.\nTube 3: bacteria resuspended in S medium.\nTransfer 2 μL of tube 1 mix and 1 μL of tube 2 mix into tube 3∗.\nNote: If other dyes or other model organisms are used, these dilutions should be re-determined by titration.\nFeed worm as described in the ‘preparing C. elegans for HaloTag imaging[href=https://www.wicell.org#sec3.1]’ section above.",
    "Acquire movies as described above in the ‘dissecting, mounting and imaging[href=https://www.wicell.org#sec3.3]’ section. Repeat for 3 embryos.\nExtract intensity information from the calibration experiment for both channels.\nSave the first frame of each channel as a single-plane TIFF file.\nFeed the first frame of each into Utrack as described above, run the ‘detection’ step only, and reorganize the results using the “convert_Utrack” script.\nThe cluster intensity information can be found in the [amp] column in converted result ‘tracks’.\nCopy all [amp] intensity datasets for all repeats in both channels into an Excel spreadsheet.\nCalculate the cluster size of far-red clusters.\nWith the double-dilution calibration experiment, determine the ratio of average single far-red dye intensity to the average single red dye intensity. Because the intensities of single particles in TIRF images are log-normally distributed,17[href=https://www.wicell.org#bib16] we perform this calibration in log space.\nConvert each intensity dataset to log scale. The fluorophore intensity should appear as a normal distribution. Each step of this calibration can be visualized by plotting individual values in Graphpad Prism or another graphing software (Figures S2[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2161-Mmc1.pdf]A and S2B).\nIn log space, calculate the mean (log) intensity for each channel and each embryo (Figure S2[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2161-Mmc1.pdf]B).\nIn log space, normalize each red channel mean intensity to 1 by performing the following calculation for each data point: Normalized red intensity = red intensity/red channel average (from the same movie).\nIn log space, normalize the corresponding far-red channel average from the same embryo accordingly by using: normalized farred intensity = farred intensity/red channel average (from the same movie) (Figure S2[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2161-Mmc1.pdf]C).\nIn log space, pool all replicate datasets together, and calculate the ratio of the average single far-red dye intensity to the average single red dye intensity (Figure S2[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2161-Mmc1.pdf]D).\nCalibrate the sparse/abundant dual-labeling data (steps i–ii should already been done in the previous steps).",
    "If not done so already, extract the intensity information of red dyes in each sparse/abundant dual-labeling experiment. This can be done by converting the Utrack tracking result using ‘convert_Utrack’ script, and [amp] can be found in the converted cell array (Figure S2[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2161-Mmc1.pdf]E).\nIf not done so already, for each corresponding farred foci, determine the farred channel intensity with the ‘getClustersize’ script we developed (Figure S2[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2161-Mmc1.pdf]E).\nConvert each intensity dataset to log scale, and calculate the mean (log) intensity for each dataset (Figure S2[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2161-Mmc1.pdf]F).\nIn log space, normalize all red channel averages to 1 by using: Normalized red intensity = red intensity/red channel average (from the same movie) (Figure S2[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2161-Mmc1.pdf]G).\nIn log space, correct the corresponding far-red cluster intensity by using: Calibrated farred cluster intensity = 1 ∗ log ratio(mean single far-red: mean single red) ∗ far-red intensity.\nConvert calibrated far-red cluster intensities back to normal scale by using: Calibrated absolute farred cluster intensity = e ˆ (calibrated log farred cluster intensity).\nCalculate the cluster size by using: farred cluster size = calibrated absolute farred cluster intensity / e."
  ],
  "subjectAreas": [
    "Single-Molecule Assays",
    "Microscopy",
    "Cell Biology",
    "Model Organisms",
    "Biophysics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}