{
  "id": 5487,
  "origin_website": "Bio",
  "title": "Physical Removal of the Midbody Remnant from Polarised Epithelial  Cells Using Take-Up by Suction Pressure (TUSP)",
  "procedures": [
    "Using permanent marker, label a round coverslip with a small circle and one extra mark to keep the same orientation of the coverslip when moving between different equipment (Figure 2). Autoclave the coverslips to avoid contaminations.Note: Instead of using coverslips labelled with permanent marker, gridded coverslips can be used for subconfluent cell cultures. In confluent fully polarised monolayers, however, the grids can be hard to visualise.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170414/20170414224859_1578.jpgFigure 2. Round coverslip labelled with permanent marks for generation of cell mapsPlace the coverslip into a 24-well plate and seed 200,000 MDCK cells onto the coverslip, which should be oriented so that the unmarked side is on top. Grow the cells in DMEM supplemented with 5% fetal bovine serum, 50 U/ml penicillin, and 50 µg/ml streptomycin.The following day transfect MDCK cells with a midbody localised protein (e.g., PRC1, MKLP1, or tubulin) genetically fused to a fluorescent protein such as GFP or mCherry. If using stably transfected cells, between 20-60% should be expressing the transgene. Cells can be diluted with untransfected cells to achieve this. It is important to have between 20-60% of cells expressing the transgene in order to have a distinctive cell map allowing easy orientation of the cell map at the later stages. Leave cells to grow for at least two days to allow cells to divide and subsequently generate new midbodies. Note: We recommend using Lipofectamine 2000 reagent according to the manufacturers’ instructions for transfection of MDCK cells. In this protocol we use 200,000 cells, 1 µg of DNA, and 1 µl of Lipofectamine 2000 per well.For the cell map, image the cells situated inside the circle using a confocal microscope at low magnification (Figure 3). Print out the images allowing them to be used for reference in the later steps.",
    "Note: For the generation of cell maps, we use a 25x objective. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170414/20170414225055_2153.jpgFigure 3. Generation of a cell map and midbody visualisation. Cells stably expressing GFP-tubulin were used. Cell map is represented on the far left using a 25x objective. The boxed region shows a magnification with a 40x objective, and was used for localising cells exhibiting midbodies. Note that the midbodies are localised on the apical surface. The white arrowheads mark the midbody remnants. Scale bar = 10 µm.Subsequently, choose some cells to image at higher resolution to document the presence of the midbody remnants before manipulation with patch-clamp apparatus. Cells that are amenable to midbody remnant removal will have the remnants positioned over the apical cell surface (Figure 3; Video 1). Using a pen, make a note of the cells imaged on the printed image.Note: Be careful to avoid photobleaching. Move focal plane to the apical surface of the cell monolayer to find midbody remnants.    <p>imgsrc:https://bio-protocol.org/javascript:;</p>   Video 1. Z-stack images of MDCK cells stably expressing GFP-tubulin before TUSP. Images are shown from the basolateral to apical membranes (i.e., bottom to the top). The white arrowheads point to the midbody remnants. Note that the remnants are localised at the apical cell surface.                                                      Transfer samples to the patch-clamp apparatus (Figure 4). Fill the chamber of the patch-clamp apparatus with HBSS medium supplemented with 0.5% fetal bovine serum, HEPES 20 mM, pH 7.2-7.5, 50 U/ml penicillin, and 50 µg/ml streptomycin, and place the coverslip into the chamber. To allow easier detection of previously imaged areas, use the marked position on the coverslip to position the sample in the same orientation as was previously used to generate the cell map.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170414/20170414225258_3578.jpgFigure 4.",
    "Patch-clamp apparatus coupled to an epifluorescence microscopeUsing the printed cell maps as a reference, identify the cells previously imaged inside the circle under the epifluorescence microscope coupled to the patch-clamp apparatus.Note: In this step, use a low magnification objective.Once the cell map has been correctly oriented, use an objective of higher magnification and move along the XY axis to the position where the cells whose midbody remnants were documented before, are situated. Double-check for the presence of remnants.Note: In our epifluorescence microscope this step is performed with a 60x objective. Take a quick look to observe the remnants and turn off the fluorescence channel to avoid photobleaching.Move the objective to allow the glass pipette to be between the objective and the monolayer.For fabricating a glass pipette, load a borosilicate glass pipette of 1.5 mm in outer diameter, 0.86 mm in inner diameter, and 10 cm in length into a micropipette puller (Figure 5). Ramp value = 515-535; Pull = 0; Velocity = 15-25; 4 heating cycles. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170414/20170414225830_7981.jpgFigure 5. Puller used for creating glass pipettesOnce generated, take the glass pipette, and fill it with HBSS medium using a syringe with a 25 G 1 ½ needle. Fit the glass pipette to the pipette holder, and move it under the objective (Figure 6).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170414/20170414230020_3777.jpgFigure 6. Glass pipette fitted to the pipette holder of the patch-clamp apparatus should be positioned in between the objective and the sample. The red circle indicates the glass pipette.Use brightfield illumination to focus on the tip of the glass pipette.Simultaneously move down the pipette and the objective of the microscope on the z axis until the monolayer comes into the focal plane. Do not let the glass pipette contact the monolayer at this stage.",
    "Once the monolayer is in focus, use fluorescence to detect the midbody remnants (Figure 7; Video 2; Bernabé-Rubio et al., 2016). imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170414/20170414230148_1306.jpgFigure 7. Representative example of cells subjected to TUSP. MDCK cells expressing GFP-tubulin were imaged at real time under an epifluorescence microscope. Green arrows indicate the midbody remnant. Scale bar = 5 μm.    <p>imgsrc:https://bio-protocol.org/javascript:;</p>   Video 2. Videomicroscopy of the TUSP procedure. MDCK cells stably expressing GFP-tubulin were subjected to TUSP. Images were captured in real time. Brightfield and fluorescence channels are shown superimposed. The green arrow indicates the position of the midbody remnant.                                                      Select a midbody remnant for removal and slowly move the glass pipette closer to the remnant using the brightfield illumination. Once proximal to each other, keep the brightfield channel and the fluorescence superimposed. Using the mouth to apply negative pressure to the pipette via a tube, draw the midbody remnant from the cell surface (Figures 1 and 7; Video 2; Bernabé-Rubio et al., 2016). After midbody remnant removal, image the cells under a confocal microscope acquiring different planes of the cell to ensure that removal of the whole midbody has occurred (Figure 8; Video 3).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170414/20170414230434_7981.jpgFigure 8. Midbody remnants from cells expressing GFP-tubulin were removed by TUSP. Cells exhibiting midbodies are shown before (pre-TUSP) and after TUSP (post-TUSP). Note that the remnants are localised at the apical surface. The white arrowheads mark the midbody remnants. Since cells continuously move, it is often difficult to have several cells in-focus while imaging a cell field. The circle indicates the zone subjected to TUSP. Note that the midbody remnant of the cell exposed to TUSP was removed. Scale bar = 10 µm.    <p>imgsrc:https://bio-protocol.org/javascript:;</p>   Video 3. Z-stack images of MDCK cells stably expressing GFP-tubulin before (pre-TUSP) and after TUSP (post-TUSP). Images are shown from the basolateral to apical membranes (i.e.",
    ", bottom to the top). The white arrowheads point to the midbody remnants. The circle indicates the zone subjected to TUSP. Note that the remnant of the cell subjected to TUSP was completely removed.                                                      Place cells in an incubator at 37 °C in DMEM supplemented with 5% fetal bovine serum, 50 U/ml penicillin, and 50 µg/ml streptomycin under an atmosphere of 5% CO2/95% air. Various readouts can be used to assess possible biological effects of midbody removal using appropriate experimental setups. For example, we have studied the role of the midbody remnant in primary ciliogenesis using fluorescence microscopy (Bernabé-Rubio et al., 2016)."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}