{
  "id": 17623,
  "origin_website": "Jove",
  "title": "Combined Endoscopic and Transoral Approach for Total Maxillectomy",
  "procedures": [
    "This procedure was approved by the Institutional Review Board of the Eye and ENT Hospital, Fudan University, China. A written informed consent was obtained from all the enrolled patients.\n1. Preparation for the surgery\nBefore the surgery, examine the patients with anterior rhinoscopy, 4 mm endoscopy, computed tomography (CT), and Magnetic Resonance Imaging (MRI) scans to confirm the maxillary bone was invaded by the tumor and that a total maxillectomy is required. Make the surgical plan based on the location of the tumor.\nOn the day of the operation, place the patient on the operating table and then give general anesthesia. Place the anesthesia intubation into the mouth on the opposite side of the tumor to facilitate to perform the following transoral approach.\nTilt the operating table to a 30° angle (to the dorsal elevated position) and place the patient's head in a neutral position (neither flexed nor extended).\nSoak the gauze piece with iodine, then sterilize the gingivobuccal sulcus with the gauze piece.\n2. Surgical procedure\nSoak 8 gauzes (6 cm x 60 cm) in a mixture of 20 mL of 1% tetracaine and 4 mL of 0.1% adrenaline. To shrink the nasal mucosa, put several pieces of soaked gauze into each nasal cavity for 5 min.\nCut off the middle turbinate and then perform a routine ethmoidectomy and sphenoidectomy. Widen the osteum of the frontal and maxillary sinuses on the side of the lesion by the quadcut and curved sinus blades powered by the dynamic planning system.\n\tNOTE: To reduce bleeding, the above-mentioned procedures could also be carried out with plasma.\nCut off the inferior turbinate and remove the mucosa layer on the lateral wall of the nasal cavity with the mayo scissors and the plasma.",
    "Drill the frontal process and the lacrimal bone with the trans-nasal skull base bur and expose the naso-lacrimal duct and lacrimal sac. Then, cut off the naso-lacrimal duct and perform the lacrimal sac incision with the blade and make sure that the mucosal flaps are laid out on the lateral nasal wall.\nWipe off the medial wall of the maxilla with the trans-nasal skull base bur from the level of maxillary palatal process inferiorly, to the level of inferior wall of orbit superiorly, to the piriform aperture forwardly, and to the palate bone posteriorly.\nRemove the perpendicular plate of the palatine bone from the medial side to the lateral side with the trans-nasal skull base bur. Expose the palatine canal and cauterize the greater and lesser palatine arteries with the monopolar electrocoagulation.\n\tNOTE: In this step, the conchal crest can be used as a landmark to differentiate the perpendicular plate of the palatine bone and the medial pterygoid plate.\nLocate the sphenopalatine foramen, which is posterior to the ethmoidal crest. Introduce the Kerrison punch into the foramen and remove the posterior wall of the maxillary sinus anterior to the pterygopalatine fossa.\nUse a needle connected to a 5 mL syringe to immerse the gingival buccal groove in several milliliters of a mixed solution of 20 mL of 0.9% NaCl and 0.05 mL of 0.1% adrenaline in the subperiosteal planes on the side of the tumor from the level of the central incisor to the level of the third ipsilateral molar.\nMake the incision in the gingivobuccal sulcus with the blade or the monopolar electrocoagulation; start from the central incisor to the third ipsilateral molar (Figure 1A).",
    "Dissect of the soft tissues subperiosteally with the suction elevator, electrocoagulation, and plasma along the anterior wall of the maxillary sinus until the infraorbital rim is exposed (Figure 1B).\n\tNOTE: The infraorbital nerve should be preserved if it was not involved by the malignancy. Whether the infraorbital nerve was involved in the tumor was identified based on the MRI and CT scan pre-surgery and confirmed during the surgery.\nSeparate the soft tissue from the underneath bone to the pyriform aperture level medially, to the zygomaticomaxillary fissure level laterally, and to the mandibular tubercles posteriorly.\nRetract and protect the facial soft tissue superiorly with the mastoid retractor. Wipe off the anterior wall of the maxilla with the trans-nasal skull base bur. Remove the residual bone of the piriform aperture.\n\t\nTry to keep the periostea and mucosa in the maxillary sinus intact when wiping off the anterior bony wall of the maxilla, which could reduce the bleeding. To achieve this goal, change the trans-nasal skull base bur to the carborundum drill at this step.\n\t\t​NOTE: After wiping off the anterior bony wall of the maxilla, the periostea and mucosa will be seen under it. The periostea and mucosa should be very obvious, if it is not involved by the tumor.\nThen, remove the posterior lateral wall of the maxillary sinus by the trans-nasal skull base bur and the carborundum drill. If the infratemporal fossa was not involved by the tumor, the periostea covering it should be kept intact in this step.\nMedially, separate the connection of the vertical and the horizontal process of the palate bone by abrading the pyramidal process with the carborundum drill. Laterally, separate the maxillary tuberosity from the lateral pterygoid plate with the carborundum drill.",
    "Use the carborundum drill to remove to the lateral and the malar process to remove the superior and the inferior orbital walls, respectively.\nPull out the ipsilateral central incisor. Make a hole between the soft palate and hard palate with the electricoagulation at the midline of the hard palate. Pull the fretsaw through the hole and make a sagittal incision along the hard palate from posterior to anterior (Figure 1C,D).\n\tNOTE: In this step, the upper lip should be retracted upward and carefully protected.\nSeparate the hard palate from the soft palate with the Metzenbaum scissors. Then take out the maxilla from the mouth.\nPut the warm gauze (40 °C) into the operative region immediately for several minutes to stop the bleeding. Then control the bleeding by electrogoagulation.\nRinse the surgical cavity with 40 °C warm water.\nFix the denture to reconstruct of the hard-palatal defect. Return the facial soft tissue to the normal position.\nCover the surface of the surgical margin with gelatin sponge. Then, pack the nasal cavity with iodoform gauze and inflation sponge.\n3. Procedure and assessment after surgery\nTake out the gauze and sponge 4 days after surgery. Then, examine through enhanced CT or MRI immediately.\n\tNOTE: Get rid of the denture before the MRI examination.\nReview the patient 2 weeks after the surgery to check and clean the surgical field. Then, review the patient according to the NCCN guidelines10.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}