{
  "id": 15059,
  "origin_website": "Jove",
  "title": "Enforced Activation of Enhancer RNAs In Situ through the dCas9 Synergistic Activation Mediator System",
  "procedures": [
    "The entire workflow of this protocol is shown in Figure 1.\n1. Enhancer RNA (eRNA) selection\nIdentify a putative enhancer region of interests by using binding peaks of chromatin immunoprecipitation sequencing (ChIP-Seq) data, i.e., of histone modifications (e.g., H3K4me1 and H3K27ac), or of transcription coactivators (e.g., p300).\nIdentify the eRNA of interest by intersecting the ChIP-Seq peak with RNA-seq signals (e.g., from total RNA-seq or from nascent RNA-seq such as Global Run-On Sequencing (GRO-Seq).\n\tNOTE: The region chosen for designing gRNAs should be usually limited to the “enhancer core” region, where TFs or coactivators (e.g., p300) showed clear ChIP-seq peaks (Figure 2A). The dCas9 and its fusion coactivators will be recruited by a gRNA to this region to mimic the native binding of coactivators (Figure 2A). If specific datasets such as Cap Analysis of Gene Expression (CAGE)4 or GRO-cap26 are available, they can be used to precisely determine the “enhancer core”, the region between two transcription start sites of the eRNAs transcribed to opposite directions4,10,26.\n2. gRNA design\nUse common CRISPR gRNA design tools such as CRISPOR27 to select gRNAs with low potential off targeting (http://crispor.tefor.net/).\n\tNOTE: Other tools like Benchling28, or CHOPCHOP29 can also be used as additional options for gRNA design. \nPaste the enhancer core DNA sequence into the Step 1 column in the CRISPOR website, then click the dropdown button to choose the corresponding genome (e.g., human) in the Step 2 column. Click the dropdown button to set the Protospacer Adjacent Motif (PAM) sequence as “NGG” in the Step 3 column and then click “Submit” button to generate guide sequences with a length of 20 bp.\nChoose guides with highest specificity scores in CRISPOR tool, i.e., low off-target potential, then add “CACCG” to the 5’ end, and “C” to the 3’ end, respectively.",
    "NOTE: Select the guides with highest specificity scores (>85 in CRISPOR is preferred).\nOrder oligonucleotides for each sense and antisense sequence from commercial sources.\n\tNOTE: Additional instructions on CRISPR/Cas9 gRNA design can be found in other studies30,31. The overhangs in step 2.2 will make the gRNA compatible with the SAM gRNA backbone (Addgene #61427), which uses the BsmBI restriction enzyme.\n3. Clone gRNAs into a lentiviral construct\nTo anneal oligos mix 1 µL of each paired oligo at 100 µM, 1 µL of 10x T4 ligation buffer, 0.5 µL of T4 DNA Ligase (400,000 units/mL) and 6.5 µL of H2O to reach a total volume of 10 µL. Incubate at 37 °C for 30 min, then 95 °C for 5 min, and ramp down to 25 °C at 5 °C/min. Dilute to 100 µL using H2O.\nDigest the gRNA backbone by mixing 2 µL of 10x restriction enzyme (RE) Buffer, 300 ng of lenti_gRNA(MS2)_zeo backbone plasmid (Addgene #61427) in 1 µL, 1 µL of BsmBI enzyme, and 16 µL of H2O to reach a total volume of 20 µL. Incubate at 55 °C for 15 min.\nMix ligation components with 20 µL digestion product by adding 2.5 µL of 10x T4 ligation buffer, 1 µL of diluted annealing product and 1.5 µL of T4 DNA ligase (400,000 units/mL) into a 25 µL system. Incubate at room temperatures for 30 min. \nTransform 2 µL of the ligation mix from step 3.3 into Stbl3 competent E.coli cells. Plate them on an ampicillin LB-agar plate and incubate overnight at 37 °C. \nPick and inoculate a single bacteria colony and extract plasmid. Send it for Sanger sequencing to confirm that the gRNA sequence is correctly inserted.",
    "NOTE: Sequences for the primers and gRNAs are available in Supplementary Table 1. Stbl3 chemically competent E.coli cells are recommended to be used here because they have a higher plasmid DNA yield and higher plasmid stability when generating instability-prone lentivirus plasmids32.\n4. gRNA efficiency test \nNOTE: Although it may not be necessary for every gRNA, it is recommended that researchers examine the quality of gRNA by performing Surveyor assay (i.e., mismatch cleavage assay) to detect indels or mutations that can only be efficiently generated by good quality gRNAs33,34. Other methods such as Tracking of Indels by Decomposition (TIDE) can also be used to determine gRNA efficiency30,35. Surveyor nuclease is a member of a family of mismatch-specific endonucleases that can cut double-strand DNA with mismatches (Figure 3A). The quality of gRNAs can be revealed by the efficacy of producing smaller DNA species. Practically, surveyor cutting efficacy can also be affected by the transfection efficiency of gRNAs and Cas9. \nTransfect gRNA together with the pSpCas9(BB)-2A-Puro (Addgene #62988) plasmid that expresses the Cas9 protein into 293T cells using a lipid-based transfection reagent. Use 1.2 µg/mL for each plasmid per well in a 6 well plate. Continue to culture the cells for 3 days after transfection. Harvest and extract genomic DNA according to the manufacturer’s protocol36. \nUse polymerase chain reaction (PCR) to amplify the targeted enhancer region from genomic DNA. Use PCR conditions shown in Supplementary Table 2. Use primers in Supplementary Table 1 for an example enhancer, NET1e. Denature the PCR products by incubating at 95 °C for 10 min, and re-hybridize them by ramping down from 95 °C to 25 °C at the speed of -0.3 °C/s to allow the single-strand DNA (ssDNA) with and without gRNA-induced indels or mutations to anneal to each other.",
    "Digest the hybridized DNA by the Surveyor nuclease (Figure 3A) following the manufacturer’s protocol37. Mix 400 ng of hybridized DNA from step 4.2, 1 µL of Surveyor nuclease, 1 µL of Surveyor enhancer and 5 µL of 0.15 M MgCl2 in a 50 µL system. Incubate at 42 °C for 60 min. Analyze the DNA on an agarose gel. Use negative control, such as cells with Cas9 only but without targeting gRNAs, in the assay and gel electrophoresis (Figure 3B). \n5. Lentivirus generation\nAdd psPAX2, pMD2.G, and a target plasmid (e.g., lenti_dCas9-VP64_Blast, Addgene #61425; or lenti_MS2-p65-HSF1_Hygro, Addgene #61426) at the ratio of 3 µg : 1 µg : 4 µg in a 1.5 mL  polypropylene tube. Mix them with 500 µL of Opti-MEM and incubate for 5 min at room temperature.\nIn a separate tube, put 10 µL of the lipid-based transfection reagent in 500 µL of Opti-MEM, and incubate for 5 min at room temperature.\nCombine the products from steps 5.1 and 5.2 and incubate for 20 min at room temperature.\nPlate 293T cells one day before the transfection and let them reach a confluence of ~30% in a 10 cm dish at the time of transfection. Add 4 mL of regular medium (DMEM with 10% FBS), then add the complex from the step 5.3 dropwise to cells. Add DMEM with 10% FBS to make the final volume up to 6 mL. Incubate overnight in a cell incubator at 37 °C with 5% CO2. \nThe next day, change the medium to 10 mL of new DMEM with 10% FBS. Harvest the medium 24 h after the medium change. Use a syringe filter (e.g., 0.45 µm) to filter the virus-containing medium and then proceed to step 6 or store the virus in -80 °C.",
    "NOTE: Lentivirus operations require a BioSafety Level II cabinet. Caution needs to be taken to safely handle the virus-associated experiments; and if any container has direct contact with the viral medium, it needs to be bleached for more than 20 min before disposal as biohazard.  \n6. Cell culture\nMaintain cells in a CO2 cell culture incubator at 37 °C­ with 5% CO2. \nCulture MCF7 and 293T cells in Dulbecco’s Modified Eagle Medium (DMEM) medium with 10% FBS.\nGrow cells in 10 cm dishes and split at a 1:3 to 1:5 ratio when confluent.\n7. Cell infection and selection\nSeed the target cells (e.g., MCF7) directly in viral medium mixture containing 0.5 mL of lenti_dCas9-VP64_Blast (Addgene #61425) and 0.5 mL lenti_MS2-p65-HSF1_Hygro (Addgene #61426). Add 8 µg/mL Hexadimethrine bromide to increase the efficiency of infection. Use a well of uninfected cells as a negative control for examining the efficacy of antibiotic selection. \n\tNOTE: The amount of viral medium is recommended as follows: 6 mL viral medium for 10 cm dish, 1 mL for a well of a 6 well plate, and 0.5 mL for a well of a 12 well plate.\nAt 24 h post-infection, add to the cells fresh medium containing Blasticidin (5 µg/mL for MCF7 cells) and Hygromycin (200 µg/mL for MCF7 cells).\nKeep cells in antibiotic selection medium until the negative control cells die out.",
    "NOTE: Time may vary for different cell lines to become stable. For MCF7, it usually takes 5-7 days for non-infected cells to completely die out. A killing curve using a range of antibiotic concentrations should be tested for a new cell line prior to the experiments. It is acceptable to use a cell mixture for the next steps, but an alternative is to pick single-cell colonies that are homogeneous in terms of expression of the two effector proteins. The stable line obtained is referred to as the SAM-effector parental line (e.g., MCF7 SAM-effector line) in this paper. It is recommended that a shared SAM-effector parental cell line be used for infection by different targeting or non-targeting gRNAs, especially if their effects will be compared. \nUse western blotting to determine whether the cells stably express the two effector proteins (an example is shown in Figure 4A). Use reverse transcription of total RNAs followed by quantitative PCR (RT-qPCR) as an alternative method to examine the expression levels of the two mRNAs (dCas9-VP64 and MS2-p65-HSF1, Figure 4B).\n\tNOTE: Primers for examining the mRNA levels of the two dCas9 effectors are available in Supplementary Table 1.\nGenerate lentivirus of gRNAs constructed in step 3.5 and infect the stable SAM cell line dually expressing dCas9-VP64 and MS2-p65-HSF1 with individual gRNA lentivirus. Add Zeocin (100 µg/mL for MCF7 cells) to the medium 24 h post gRNA viral transduction. Generate a negative control that expresses non-targeting gRNA (NT-gRNA) in the parental SAM cell line. \n\tNOTE: Ensure that the selection drug is specific for the construct of interest.\n8. RNA extraction and quantitative RT-PCR to examine eRNA levels",
    "Extract total RNAs from SAM cell lines expressing either NT-gRNA or targeting gRNAs using an RNA extraction kit38, or other phenol chloroform based method. Use cells of ~80% confluency in one well of a six-well plate for RNA extraction.\n\tNOTE: No significant difference was observed in our practice for eRNA detection when RNAs are extracted either by commercial binding columns or by phenol chloroform reagents.\nMake complementary DNA (cDNA) from the purified RNA by reverse transcription reaction with random hexamer, following the manufacturer's protocol39. Use conditions in Supplementary Table 2.\n\tNOTE: Because the majority of eRNAs are non-polyadenylated1,2,4,9,10, random hexamer is routinely used for cDNA generation.\nDesign primers for RT-qPCR measuring target eRNAs using a reputable primer designing tool (e.g., Primer 3). Test the amplification linearity of the primer pairs by examining if the primers will linearly amplify serial diluted cDNAs and show expected qPCR cycle differences. Use conditions in Supplementary Table 2.\n\tNOTE: The primers for RT-qPCR should target the highly transcribed region in the nascent RNA-seq, and the linearity test of primers should include a broad range of cDNA dilutions to ensure that all possibly encounterable eRNA levels are tested. An example of linearity test is shown in Figure 5A.\nPerform RT-qPCR and analyze the eRNA expression levels in control cells (SAM cell line with NT-gRNA) and in SAM cell line with eRNA-targeting gRNAs (e.g., NET1e gRNA#1) (e.g., Figure 6A). Primers for NET1e RNA are shown in Supplementary Table 1. Use conditions in Supplementary Table 2.  \n9. dCas9 ChIP and qPCR",
    "NOTE: This step is an optional experiment to validate the binding of dCas9/SAM-gRNA complex to the target enhancer by the specific gRNAs. While it is encouraged that users perform this step, it is not necessary to test every single gRNA. Refer to an example shown in Figure 5B. Refer to primers listed in Supplementary Table 1.\nCross-link cells\n\t\nRemove the medium from cells and add 1% formaldehyde dissolved in phosphate buffered saline (PBS). Leave for 10 min.\nAdd 2.5 M glycine at 1:20 volume to quench the cross-linking and wash cells twice with ice-cold PBS. Add 700 µL of ice-cold PBS and scrape the cells to a 1.5 mL tube. \nCentrifuge at 2,000 x g for 5 mins at 4 °C. Proceed to step 9.2, or snap freeze and store at -80 °C.\nSonicate\n\t\nMake fresh LB1, LB2 and LB3 buffers. LB1: 50 mM Hepes-KOH (pH 7.5), 140 mM NaCl, 1 mM EDTA, 10% glycerol, 0.5% NP-40, 0.25% Triton-X 100 and 1x Protease inhibitor. LB2: 10 mM Tris-HCl (pH 8.0), 200 mM NaCl, 1 mM EDTA, 0.5 mM EGTA and 1x Protease inhibitor. LB3: 10 mM Tris-HCl (pH 8.0), 100 mM NaCl, 1 mM EDTA, 0.5 mM EGTA, 0.1% Na-Deoxycholate, 0.5% N-lauroylsarcosine and 1x Protease inhibitor. Supplement 1x Protease inhibitor freshly to the buffer before the experiment.\nAdd 1 mL of buffer LB1 to cell pellets, pipette well, rotate at 4 °C for 10 min, and spin at 2,000 x g for 5 mins at 4 °C. Pour off the supernatant, add 1 mL of LB2 buffer, rotate at 4 °C for 10 min, and spin at 2,000 x g for 5 min at 4 °C. Pour off the supernatant and remove the excess of the LB2 buffer. Add 300 µL of buffer LB3.",
    "Sonicate and fragment the chromatin DNA to an average size of ~200-400 bp using a proper sonicator system. After the sonication, add 30 µL of 10% Triton-X 100 and mix well. Test the proper sonication time if a new cell line is used. \nCentrifuge at 14,000 x g to remove the pellet. Transfer the supernatant to the new tube and add 630 µL of LB3 and 70 µL of 10% Triton X-100 to a total volume of 1 mL. Add 2 µg of the Cas9 antibody to the supernatant and rotate at 4 °C overnight. \nImmuno-complex capture and reverse cross-linking \n\t\nPrepare RIPA buffer (50 mM HEPES pH 7.6, 1 mM EDTA, 0.7% Na-deoxycholate, 1% NP-40, 0.5 M LiCl) and elution buffer (1% SDS and 0.1 M NaHCO3).\nWash Protein G dynabeads with 1% BSA in PBS 3 times and LB3 buffer once. \nAdd 30 µL of Protein G dynabeads to the sample and incubate at 4 °C for 4 h.\nWash the beads-immuno-complex in 500 µL of RIPA buffer 6x. Do not let beads dry out. \nWash the beads-immuno-complex once with TE buffer; remove the buffer.\nAdd 200 µL of elution buffer to the beads-immuno-complex and vortex; then put it in a temperature-adjustable heated shaker set to 65 °C with 600 rpm shaking for 6-16 h to reverse crosslink. \nDNA extraction\n\t\nRemove tubes from the shaker, briefly spin down the beads and put them on a magnetic stand. Transfer 200 µL of the supernatant to a fresh tube and add 200 µL of TE buffer.\nAdd 1 µL of RNase A (1 mg/mL) to the tube and incubate at 37 °C for 1 h. \nAfter 1 h of incubation, add 2 µL of Proteinase K (20 mg/mL) to the sample and incubate it at 65 °C for 2 h.",
    "Centrifuge briefly and add 400 µL of phenol-chloroform-isoamyl alcohol mixture. Mix well, then centrifuge for 5 min at 10,000 x g.\nMove 400 µL of the upper layer to a 1.7 mL tube containing 16 µL of 5 M NaCl and 1 µL glycogen (20 µg/µL) and mix well.\nAdd 800 µL of 100% ethanol and leave overnight at -20 °C.\nNext morning, centrifuge the tubes at 4 °C at 14,000 x g for 15 min.\nRemove the supernatant and wash the pellet with 1 mL of 70% ethanol. Spin down at 14,000 x g for 10 min. \nRemove ethanol, air dry pellet, and resuspend in 50 µL of TE (10 mM Tris-HCl, pH 8.0, 1 mM EDTA).\nPerform ChIP-qPCR to examine the recruitment of the SAM complex to the targeting site by a pair of enhancer core-targeting primer. Use a primer pair targeting an irrelevant region as a negative control.\n10. Cell growth assay and other functional tests of eRNA over-activation \nTrypsinize SAM cell lines expressing the non-targeting gRNA or eRNA-targeting gRNAs and plate ~3,000 cells per well in a 96 well plate. \nMeasure cell growth by using a live-cell imager or other methods (e.g., cell counting, or water-soluble tetrazolium salt-1 assay).\nUse the half-maximal inhibitory concentration (IC50) to test the cellular responses to specific cancer drugs in cells with or without NET1e overexpression by SAM15.\n\tNOTE: Results of cell growth assays and drug sensitivity tests of breast cancer cells are presented after overexpression of an eRNA transcribed adjacent to NET1 gene, which was referred to as NET1e15. Other assays can be conducted at the cellular or organismal levels based on the need of each specific project.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}