{
  "id": 12223,
  "origin_website": "Jove",
  "title": "Multiplexed Immunofluorescence Analysis and Quantification of Intratumoral PD-1+ Tim-3+ CD8+ T Cells",
  "procedures": [
    "This study was conducted in accordance with the Declaration of Helsinki and was approved by the local ethics committee (CPP Ile de France nr. 2012-05-04). Informed consent was obtained from the participant included in the cohorts.\n1. Tissue Material\nCollect RCC tissue samples on the day of surgery. Handle the surgical specimen at room temperature (pathology department).\nCollect a tumor sample of approximately 0.5 cm x 0.5 cm x 0.5 cm size in a dry tube. Snap freeze in liquid nitrogen and store at -80 °C.\nCoat the samples in optimal cutting temperature compound. Section the samples with a cryostat at -20 °C into 4 - 6 µm thick sections. Let the samples air dry on slides for 12 h and directly store them at -80 °C to avoid desiccation.\nCheck the quality of the sample by viewing a Hematoxylin and Eosin stained section.\n2. In Situ Immunofluorescence Staining of TILs\nProcedural guidelines\nPerform all experimental steps at room temperature.\nFor all steps, perform the dilutions with Tris Buffer Saline (TBS; see Table of Materials).\nPerform the wash in TBS for all the steps except after the primary antibody incubation. For the latter, use Tris Buffer Saline Tween20 (TBST, see Table of Materials). For buffer composition and reconstitution see Supplemental Table 1.\nUse a humidity chamber for antibody incubations and a staining jar for washing.\nDo not let the section dry out during the procedure.\nPretreatment\nThaw the slide containing the tissue sample and carefully dry the slide around the specimen with a paper towel. Delimitate the reaction area containing the tissue with a hydrophobic barrier pen (see Table of Materials). Dry for 2 min.\nFix the samples in 100% acetone for 5 min, dry for 2 min, and wash with TBS for 10 min.\nSaturation and blockade",
    "Pretreat the slides for 10 min with 3 drops of avidin 0.1%, tap and/or flick the slide to distribute the avidin and remove air bubbles, and then treat for 10 min with 3 drops of biotin 0.01% (see Table of Materials), tap, and/or flick. Wash with TBS.\nPerform an Fc receptors blockade. Apply 100 µL of a 5% volume/volume of normal serum diluted in TBS. Use serum from the same host species as the labeled secondary or tertiary antibody (see Table of Materials); here, donkey serum was used. Incubate for 30 min.\nDuring the incubation, briefly spin the anti-CD8, PD-1, and Tim-3 antibodies (Table of Materials). Prepare the mix of primary antibodies in TBS as described in Supplemental Table 2.\nImmuno-staining for CD8, PD-1, and Tim-3\nPrepare the primary antibody mixture. Refer to Table of Materials and Supplemental Table 2 for the antibodies used (anti-CD8, PD-1, Tim-3, and their corresponding secondary antibodies) and their concentrations.\nTap and/or flick the remaining donkey serum (added in step 2.3.2). Incubate the slides with 100 µL of the non-labeled primary antibodies mix for 1 h in a humidified chamber.\nDuring the incubation, briefly spin the Cyanine 5 anti-rabbit, AF488-anti-goat, and biotinylated anti-mouse antibodies, and prepare the mix of secondary antibodies as described in Supplemental Table 2.\nWash the slides in TBST for 5 min. Dry the slides.\nIncubate the slides with 100 µL of the secondary antibodies for 30 min in a humidified chamber.\nPrepare the mixture of tertiary antibody containing Cy3-streptavidin as described in Supplemental Table 2.\nWash the slides in TBS for 10 min. Dry the slides.\nIncubate the slides with 100 µL of the tertiary antibody mixture for 30 min.\nWash the slides in TBS for 10 min. Dry the slides.\nCell mounting",
    "Mount the slides in a 4',6-Diamidino-2-Phenylindole, Dihydrochloride (DAPI)-containing mounting medium (1.5 µg/mL DAPI) with a coverslip compatible for fluorescence microscopy (see Table of Materials).\n\t\tNOTE: As a negative control for each experiment, one slide with isotype-matched antibodies was used at the same concentration as corresponding antibodies. For this staining, we used mouse IgG1, rabbit IgG, and goat IgG negative control antibodies (see Table of Materials). As a positive control, we used human hyperplasic tonsil which is known to be positive for the tested markers, for each experiment. A typical staining is described in the results (Figure 1). Mono-staining of CD8, PD-1, and Tim-3 should be performed individually (one staining per slide) with the same pre-treatment and without DAPI. A slide in the same experimental conditions without any antibody and only DAPI mounting medium should also be performed. A slide should be imaged using identical experimental conditions without any antibody and without DAPI.\n3. Fluorescence Analysis and Automated Cell Count\nImage acquisition with the automated microscope\nCreate a protocol.\n\t\t\nTurn on the automated microscope software and the fluorescence illuminator.\nIn the menu bar, click on \"File,\" \"create protocol,\" select \"DAPI,\" \"FITC,\" and \"TRITC.\"\nClick \"Next,\" \"Tissue section,\" and click \"Next,\" \"Protocol name.\" Choose a name, for example, \"CD8-PD-1-Tim-3,\" click \"Next,\" and \"save.\"\nManually place a slide on the stage.\nIn the menu bar, click \"setup,\" \"settings.\" Click \"set home Z\" in the new window.\nAdjust exposure time with a positive control slide i.e. a CD8, PD-1 and Tim-3 triple-stained with DAPI sample.\nIn the control bar click “set exposure.”\nAdjust the exposure time for each filter until a sufficient but not saturating signal is obtained.\nFor monochrome imaging, perform the following:\nSelect acquisition and under 'autofocus' choose DAPI filter.",
    "In the \"scan area limit\", move the objective upper to the upper left corner of the slide. Click \"Mark\". Do the same for the lower right corner.\n\t\t\tNOTE: This step delimitates the area of low power imaging (LP imaging) at 4X; be aware to place the mark well so as to surround all the samples of the series.\nFor high power (HP) imaging, perform the following:\nUnder 'Autofocus', choose \"DAPI\".\nUnder 'Acquisition' band, choose \"DAPI\", \"FITC\", \"Cy3\", and \"Cy5\". Click \"OK\". On the menu bar click \"File\", \"Save protocol\".\nScan the slides.\n\t\t\nLoad the protocol by clicking \"File\", \"load protocol\" from the menu bar. Click \"Start\".\nEnter 'Lab ID' (folder location for image storage). Enter Slide ID to identify the slide. Click \"Next\".\nClick \"Monochrome Imaging\" (to scan the whole slide under bright field light and acquire sequential images using a 4x objective).\n\t\t\tNOTE: This produces a grayscale overview of the slide.\nClick \"Find Specimen\". Select the area of tissue to be scanned at low resolution (4x): hold the 'Ctrl' key and click on a field using the cursor to select or deselect fields (Figure 2A).\nClick \"LP Imaging\" (4x imaging) for fluorescent Red Blue Green image acquisition of each field.\nFor HP field selection, hold down 'Ctrl' key and click on a field using the cursor to select or deselect fields that correspond to the area of tissues that will be scanned at high resolution (20x). Select 5 fields (Figure 2B).\nClick \"HP Imaging\" (20x imaging) for a multispectral image acquisition of each field (Figure 2C).\nClick \"Data Storage\" to store images in the folder that was selected at the beginning in LabID.",
    "NOTE: The process is summarized and illustrated in Figure 2. For each step (tissue detection, field selection) an algorithm can be incremented and trained by the user for a whole-automated scan process.\nFluorescence image analysis and automated cell counting with coupled analysis software\nBuild the spectral library.\n\t\t\nOpen the image analysis software.\nOn the left panel, open \"Build libraries\". Under 'load image', click on \"Browse\" and select one mono-stained image (e.g., CD8/Cyanine 5).\nSelect the fluorophore, (e.g., Cyanine 5). Click \"extract\". Click \"Save\" to store in library. Click \"Save\".\nRepeat the same process for PD-1, Tim-3, and DAPI mono-stained slides in order to integrate the spectrum of each fluorophore of interest.\n\t\t\tNOTE: Building the spectral library integrates the spectrum for each fluorophore used for the specific tissue (here, kidney), but \"synthetic\" libraries that already exist can be used. As the autofluorescence spectrum is strictly relative to the tissue, it is important to perform one auto-fluorescence and spectral library per project.\nCreate a new project.\n\t\t\nFrom the menu bar, click \"File\", \"New Project\". In the 'Find feature' tab, select \"cell segmentation\". In the 'Phenotyping' tab, select \"phenotyping\". Click \"Create\".\nIntegrate the representative images in the project.\n\t\t\t\nIn the 'File' tab, click on \"open image\". Choose 10 to 30 representative images of the whole series. Add the non-stained slide to remove autofluorescence. On the right panel: select library source. Select fluorophore and choose those corresponding to the spectral library previously built.\nTo remove tissue autofluorescence, click the \"AF button\" and then select the area of autofluorescence on the blank slide.\nImage treatment and composite image generation.",
    "Click \"Prepare all\" to integrate the fluorescence library and the autofluorescence spectra to generate the composite image (Figure 3). Click on the 'eye' icon to open the 'view editor' panel and select the data displayed: select the markers CD8, PD-1, Tim-3, and DAPI. Remove the autofluorescence. Follow the steps presented by the software.\nSegment the cells.\n\t\t\t\nTo segment the cells, in 'Compartment', select \"Nuclei\" and \"Membrane\". In the \"Nuclei\" tab, set DAPI as the nuclear counterstain.\nIn the 'Maximum and Minimum Size (px)' tab enter \"40\" and \"176\" as minimum and maximum sizes, respectively. For 'Minimum' signal, set \"0.13\". In \"Split\" tab, set \"2.60\". In \"Nuclei\" tab, set \"0.81\". Select \"use membrane signal to aid segmentation\".\nClick \"Segment cells\" at the bottom part of the screen. Check the segmentation of nuclei and membranes of cells and retry with different parameters if it does not match the DAPI and membrane fluorescence of the cells.\n\t\t\t\tNOTE: The software recognizes the cells with the nuclear DAPI staining and based on the cell size. Adjust the cell parameters (size, split, pixels) according to the project.\nPhenotype the cells.\n\t\t\t\nIn the 'Phenotype' tab, click \"add\". Create cell phenotype categories: CD8 (blue dot)/CD8-PD-1 (red dot)/CD8-PD-1-Tim-3 (green dot)/other (black dot) (Figure 4).\nSelect more than 5 examples of cells of each category. Click \"Train classifier\".\n\t\t\t\tNOTE: This generates a statistical classification algorithm by the software.\nClick \"Phenotype all\" to obtain the phenotype of each cell.\n\t\t\t\tNOTE: The software gives the phenotype of one cell with a confidence interval (CI) of accuracy.\nImprove the algorithm by training the software until the difference between eye and automated count is concordant (error < 5%). Choose a CI that is acceptable for the cells of interest.\n\t\t\t\tNOTE: We chose to make the training on the basis of 55% CI as acceptable.",
    "Save the algorithm and project.\nUnder 'File' select \"project\". Name it and click \"Save\".\nPerform batch analysis of the series.\n\t\t\nSelect \"Batch analysis\". Select the project. Add the images to analyze. Select a folder of storage for the data. Click \"Run\". Check the quality of the composite image. Verify the phenotyping for all the images of the series.\n\t\t\tNOTE: The coupled image analysis software integrates all the cell compartments (membrane/cytoplasm/nuclei) signals. The phenotyping step is crucial albeit the training of the algorithm can be a time-consuming step. All the data of each image are in one .txt file. All the data of one cell (particularly its phenotype given with its CI) are in one line. For each slide, the image acquisition and subsequent counts were performed on 5 fields.\nIntegration of the raw data and generation of the automated cell count\nCompute the data with a statistical program.\n\t\t\nCompute all the data from the 5 images corresponding to the 5 fields analyzed for 1 patient. Use a statistical platform, and have an experienced statistician, data manager, or data scientist perform the analysis. Build a script that automatically counts the cells depending on their phenotype, selecting the CI > 55%.\nPut all the .txt files of the series in the same folder.\nExtract the data.\n\t\t\nPut all the .txt files in one folder. Run the automatic script built in step 3.3.1. Open the output .csv file generated by the R script. Save as .xl format. The output gathers the number of cells for each phenotype (i.e., CD8 alone, CD8-PD-1, CD8-PD-1-Tim-3) for each patient.\nCalculate the average number of cells for each patient per field: divide the number of cells per the number of fields (i.e., 5) to normalize the number of cells for each patient per field.",
    "Calculate the percentage of PD-1+ cells among total CD8+ T cells, and PD-1+ Tim-3+ cells among total CD8+ T cells. See Figure 5 for summary of this step.\n\t\t\tNOTE: R language (or other programming software of choice) is required to correctly create and execute the commands, and so an experienced user or statistician/data scientist is essential. The R program can compute the data of the same patient, but the name of the 5 .txt files of one patient should have an identical beginning, corresponding to a unique patient identifier.\nStatistical analysis\nUse statistical software for the statistical analysis of the results.\nPerform appropriate statistical analyses with the help of a statistician.\n\t\t\nUse the non-parametric Wilcoxon's signed rank tests for comparison of PD-1 MFI between two cell phenotypes (Figure 6). Correlate the covariate and histological characteristics with a Pearson's chi-squared test.\nUse a Kaplan-Meier method to estimate the progression free survival, and Cox regression models to estimate the covariate effects on time-to-event outcomes, such as overall survival and disease-free survival.\nConsider p-values lower than 0.05 as significant.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}