{
  "id": 4069,
  "origin_website": "Cell",
  "title": "Accelerated Development of Rod Photoreceptors in Retinal Organoids Derived from Human Pluripotent Stem Cells by Supplementation with 9-cis Retinal",
  "procedures": [
    "Step-by-Step Method Details\nStep-by-Step Method Details\nThis protocol uses human embryonic stem cells up to passages (P) 85 and human induced pluripotent stem cells between P15 and P25. Later passages can show reduction in efficiency. The protocol described here is for PSC maintenance in 6-well plates and differentiation in 100 mm dishes. Please adjust the amount of media and reagents accordingly if culture wares of different sizes are used.\nThaw Cells\nTiming: 1.5 h\nRemove parafilm and warm up a Matrigel-coated 6-well plate in 37°C incubator for at least 1 hour.\nThaw a frozen vial of human PSC in 37°C water bath until a bit of ice is remaining.\nDissolve the remaining ice by pipetting up and down, gently, using wide-bore tips.\nGently transfer the cells to a new 15 mL centrifuge tube.\nSlowly add 10 mL room temperature (20-22°C) E8 media to the cells.\nInvert tube several times to mix cells in media.\nCentrifuge the cells at 200 g for 3 minutes.\nRemove the supernatant and loosen cell pellet by tapping bottom of tube until the pellet dissociates.\nResuspend the pellet in 1 mL E8 media with 10 μM rock inhibitor (RI, stock 1:1000).\nAdd cells to one well of a 6-well Matrigel-coated plate.\nAdd 1 mL E8 media with 10 μM RI to the tube to resuspend remaining cells and transfer to the 6-well plate.\nShake plate to evenly distribute cells and move plate to the hypoxia incubator: 5% O2 at 37°C.\nCritical:\nHuman pluripotent stem cells maintain high viability in small aggregates. Use wide-bore tips and gentle pipetting to avoid dissociating the clumps into single cells.\nAt least three passages are needed after cell revival for efficient differentiation.\nSplit cells when they reach 60%-80% confluency.\nDay 0: Split Cells\nTiming: 1.5 h",
    "Remove parafilm and warm a Matrigel-coated 6-well plate in 37°C incubator for at least 1 hr.\nRemove all media from one well containing adherent PSCs.\nRinse well twice with 1 mL 0.5 mM EDTA/PBS solution (20-22°C) to chelate Mg++ and Ca++.\nIncubate cells with 1 mL EDTA/PBS solution for 3-5 minutes.\nDuring incubation, remove media from a new well and add 2 mL E8 media with 10 μM RI.\nRemove EDTA/PBS solution from well and add 1 mL E8 media with 10 μM RI. Dissociate cells by gently pipetting up and down three times, covering the entirety of the well.\nCheck the cells under a microscope. Pipette additional times if large clumps are still observed.\nCritical:\nAvoid dissociating clumps into single cells. See Figure 1[href=https://www.wicell.org#fig1] for optimal aggregate size.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/78-Fig1.jpg\nFigure 1. Morphology of Growing Pluripotent Stem Cells\nRepresentative bright field images of cells are shown. Immediately after the split (top, left), day 1 after split (top, right), day 2 after split (bottom, left), and day 3 after split (bottom, right). Scale bars=400 μm.\nTransfer 1/6 – 1/12 of the cell suspension to each new well (desired number depends on the dilution factor). Label the new well with name of cell line, date and passage number.\nCritical:\nThe split ratio depends on confluency of the cells. Please refer to Figure 1[href=https://www.wicell.org#fig1] for optimal plating density for 3-day culture.\nPlating at too high of a density can result in spontaneous differentiation, while too low can lead to genome instability.\nOptional:\nThe remaining cell suspension can be centrifuged at 200 g for 3 minutes and resuspended in freezing media for storage.\nOne well can be resuspended in 4 mL freezing media and made into 1 mL aliquots.\nAdd freezing media slowly with constant shaking to facilitate gradual changes in osmolarity.",
    "Transfer the remaining cell suspension to a 100 mm polyHEMA-coated dish using a wide-bore tip. Rinse the well with 8 mL E8 media with 10 μM RI and transfer to the plate. Label plate with name of cell line, date and passage number.\nAdd 2 mL E8 media with 10 μM RI to the original well and return it to incubator for backup.\nShake the 6-well plate and 100 mm dish to evenly distribute cell suspension and place in hypoxia incubator with 5% O2 at 37°C.\nAdd 3 mL E8 media without RI on day 1 and 4 mL on day 2. Cells are ready to split when proper confluency has been achieved (60-80%), when colonies have smooth edges and a high nuclei-to-cytoplasm ratio (Figure 1[href=https://www.wicell.org#fig1]).\nDay 1: Addition of NIM\nTiming: 5–10 min\nAdd 4 mL of room temperature (20-22°C) NIM to the 100 mm dish.\nShake to distribute cells evenly and return dish to hypoxia incubator.\nDay 2: Addition of NIM\nTiming: 5–10 min\nSlowly tilt dish and allow embryoid bodies (EBs) to sink to the bottom. Remove 6 mL E8:NIM media\nAdd 6 mL NIM to the culture at 20-22°C.\nShake to distribute EBs evenly and return dish to hypoxia incubator.\nDay 3: Exchange with NIM\nTiming: 10–15 min\nSlowly tilt the dish and allow EBs to sink to the bottom. Remove 10 mL E8:NIM media. Leave ∼2 ml media to avoid desiccation.\nAdd 10 mL NIM and shake plate to mix media.\nSlowly tilt dish to allow EBs to sink to the bottom. Remove 10 mL NIM media.\nAdd 10 mL NIM and shake plate to mix media.\nMove dish to normoxia incubator.\nDay 7: Transfer to Matrigel-Coated Culture Ware\nTiming: 1 h",
    "Remove parafilm and place Matrigel-coated 60 mm dish (growth factor reduced) in normoxia incubator for at least 1 hr to warm up.\nUnder a microscope in the BSC, remove EBs that are larger than ∼0.25 mm.\nRemove media from 60 mm dish.\nTransfer remaining EBs from 100 mm dish to the Matrigel-coated 60 mm.\nSlowly tilt the 60 mm dish and allow EB to sink to the bottom. Remove ∼10 mL NIM media.\nRinse 100 mm dish with 6 mL NIM and transfer the media to the 60 mm dish.\nShake to distribute EBs evenly and return the 60 mm dish to normoxia.\nDay 8-15: NIM Media Change\nTiming: 5–10 min\nExchange 8 mL NIM media whenever culture media turns yellow.\nDay 16-28: 3:1 Media Exchange\nTiming: 5–10 min\nRemove 8 mL NIM media.\nAdd 8 mL 3:1 media with 2% B27 (stock 1:50).\nChange media every day.\nOptic vesicles can be observed between day 16-27.\nDay 28: Dissection of Optic Vesicles\nTiming: 1–1.5 h\nPrepare 3:1 media for dissected organoids: 3:1 media with β-mercaptoethanol (2-ME) at 55 μM final (1:1000 dilution from stock 2-mercaptoethanol at 55 mM purchased from GIBCO), 0.2% IGF-1 (10 μg/mL stock, 1:500), and 2% B27 supplement (1:50).\nAdd 12 mL of media to 100 mm polyHEMA-coated dish.\nUnder a microscope in BSC, dissect optic vesicles identified by their “horseshoe” shape and bright neuroepithelial outer layer with sharp tungsten needles (Figure 2[href=https://www.wicell.org#fig2], left, arrow).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/78-Fig2.jpg\nFigure 2. Retinal organoids Derived from Pluripotent Stem Cells\nA representative bright field image of developing optic vesicle (left, arrow) and undeveloped optic vesicle (left, arrowhead). Representative brightfield images of retinal organoids stuck together (middle) and separated retinal organoid (right). Scale bars=1000 μm.\nUse a P1000 pipette fitted to wide-bore tips to transfer dissected optic vesicles to 100 mm dish.",
    "Shake plate to distribute optic vesicles evenly in dish.\nPlace 100 mm dish in normoxia incubator and discard 60 mm dish.\nDay 29-41: Half Media Changes with B27 Media\nTiming: 10–15 min\nPerform half media changes on Mondays, Wednesdays, and Fridays.\nAdd more media if the culture turns yellow before scheduled media changes, not exceeding 16 mL per plate. Split the optic vesicles into multiple dishes if needed.\nUnder a microscope in BSC, check for optic vesicles sticking together. Separate with tungsten needles and remove poorly differentiated vesicles as necessary (Figure 2[href=https://www.wicell.org#fig2], middle).\nDay 42-60: Addition of FBS and Taurine\nTiming: 10–15 min\nPrepare 3:1 media with FBS for optic vesicles, by mixing 3:1 +FBS media with 0.1% 2-ME, 0.2% IGF-1, 2% B27 minus Vitamin A supplement, and 1% taurine (100 mM stock, 1:100).\nAdjust number of plates so that each organoid has ∼1 mL of media. Do not exceed 16 organoids per individual plate. Minimum 12 mL media.\nPerform half media changes on Mondays, Wednesdays, and Fridays.\nDay 60-90: Addition of 9-cis Retinal\nTiming: 20–30 min\nMove 100 mm dish to normoxia incubator with front glass door covered in foil.\nTurn off all lights and allow eyes to adjust to darkness (∼10 min).\nUnder dim red light, prepare 3:1 +FBS media for retinal organoids: 3:1 +FBS with 0.1% 2-ME, 0.2% IGF-1, 2% B27 supplement, 1% taurine, and 1 μM 9-cis retinal (10 mM stock, 1:10,000).\nAdjust number of plates so that each organoid has ∼1.5 mL of media. Do not exceed 10 organoids per individual plate. Minimum 12 mL media.\nPerform half media changes on Mondays, Wednesdays, and Fridays under dim red light.\nCritical:\nMinimize all light exposure to prevent isomerization of 9-cis retinal to all-trans retinal.\nDay 91-Endpoint: Half Media Changes with N2 Media\nTiming: 20–30 min",
    "Under dim red light, prepare 3:1 +FBS media for retinal organoids: 3:1 +FBS with 0.1% 2-ME, 0.2% IGF-1, 1% taurine, 1% N2 supplement (stock, 1:100), and 0.5% μM 9-cis retinal (10 mM stock, 1:20,000).\nPerform half media changes on Mondays, Wednesdays, and Fridays under dim red light.\nCritical:\nMinimize light exposure to prevent isomerization of 9-cis retinal to all-trans retinal."
  ],
  "subjectAreas": [
    "Cell Differentiation",
    "Organoids",
    "Neuroscience",
    "Stem Cells"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}