{
  "id": 5827,
  "origin_website": "Bio",
  "title": "Assessment of Aversion of Acute Pain Stimulus through Conditioned Place Aversion",
  "procedures": [
    "For the outline of this protocol, see Figure 1.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171101/20171101202711_4054.jpgFigure 1. Flowchart of the basic steps of the protocol Hardware setup (detailed Figure 2)For these experiments, we used thermal stimuli applied via High Power Lasers (HPL), and modulate the neuronal activity using optogenetic stimulation. The set up described above, can be customized to fit another type of stimulus.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171101/20171101202816_5180.jpgFigure 2. Schematic of the complete set up used for performing a Conditioned Place Aversion experiment. CPA apparatus is placed on the mesh table. Animals are recorded via a camera connected to ANY-maze software. A High Power Laser (HPL) delivers a thermal stimulus applied by the experimenter, and a Low Power Laser (LPL) delivers optogenetic light stimulation. The LPL connects 2 fiber cables to the 2 optical fibers implanted in the head of the animal for bilateral optogenetic stimulation of the ACC. All lasers are controlled via a TTL pulse generator in the OPTG4 software to deliver the light stimuli synchronically.We used a modified escape-avoidance paradigm as previously published (LaBuda and Fuchs, 2000). The apparatus was made of Plexiglas with dimensions 16 x 7 x 13 cm and placed on top of a mesh table (Figure 3). The box was divided into two chambers. To allow the animal to discriminate between the 2 chambers, each one is paired with different cues (any kind of smell, visual, or tactile cues). In our experiment, we applied different smell cues inside each lateral side of the 2 chambers (right chamber = cherry fruity smell/left chamber = mint smell).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171101/20171101202901_2065.jpgFigure 3. Rat in the CPA apparatus. The rat is allowed to freely move between the two chambers during the 3 phases of the experiment. Its movements are recorded by the camera linked to the ANY-maze software, which calculates the time spent in each chamber.",
    "Install the camera on the Metal stand above the 2 chambered apparatus.Connect the lasers to the TTL pulse generator.Connect the TTL pulse generator to the computer.Turn on the Dohm sound machine.Turn On HPLs and LPL. Let them warm up for 15 min.Set HPLs to the desired power using the power meterHPL1 Non noxious Stimulus NS-50 mW, and HPL2 to High noxious Stimulus HS-250 mW;HPL1 Low noxious Stimulus LS-150 mW and HPL2 to High noxious Stimulus HS-250 mW;HPL1 Non noxious Stimulus NS-50 mW and HPL2 to Non noxious Stimulus NS-50 mW;HPL1 Low noxious Stimulus LS-150 mW and HPL2 to Low noxious Stimulus LS-150 mW;HPL1 High noxious Stimulus HS-250 mW and HPL2 to High noxious Stimulus HS-250 mW.Set LPL to the desired power using the power meter for optogenetic stimulation (power = 10 mW).Software set upEnsure that the number of the channel corresponds to the correct port on the TTL pulse generator. HPL1 connected to port entry #1 will be controlled in Channel 1, HPL2 connected to port entry #2 will be controlled in Channel 2, and LPL connected to port entry #3 will be controlled in Channel 3 (Figure 4).Set the parameters in OTPG4 software to control the HPL.For optogenetic modulation of neuronal activity:Set the parameters in OTPG4 software to control the LPL (example: frequency = 20 Hz; Time ON duration = 10 msec, Number of Pulses = 100, Channel 3 in Figure 4).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171101/20171101202935_5990.jpgFigure 4. OTPG4 software interfaceTurn On the ANY-maze software on the computerStart by opening a New Experiment and name it.Create a New Protocol (Figure 5).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171101/20171101203049_7998.jpgFigure 5. ANY-maze software. How to create a new protocol.Select the video source corresponding to your camera and set up your image. Name a new apparatus (example CPA).",
    "Create two zones on the screen (Figure 6), name them and select the settings you want to record during the experiment (time in the zone).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171101/20171101203128_4259.jpgFigure 6. ANY-maze software. How to delimitate 2 zones.On the stages tab, select the duration of your experiment (600 sec = 10 min in our case) Select the type of data you want to collect in Results, Report and Data.Set up the parameters of your Experiment (number of animals, different phases. Figure 7).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171101/20171101203225_9239.jpgFigure 7. ANY-maze software. Set up for a new experiment.To start recording, go to the Test section → click on video recording → ‘Play’ button (double click until the chronometer starts).Note: For any additional parameters, please refer to ANY-maze software Guideline.ExperimentsFor optogenetic manipulation of neuronal activity, prior to conducting the behavioral experiments, perform transcranial injections of optogenetic constructs. Anesthetize animals with isoflurane (1.5 to 2%). In all experiments, the virus is delivered to the anterior cingulate cortex (ACC) only. Rats are bilaterally injected with 0.5 μl of viral vectors at a rate of 0.1 μl/10 sec with a 26-G 5 μl Hamilton syringe at anteroposterior (AP) +2.6 mm, mediolateral (ML) ±1.6 mm, and dorsoventral (DV) -2.25 mm, with tips angled 28° toward the midline. The microinjection needles are left in place for 10 min, raised 1 mm and left for another minute to allow for diffusion of virus particles away from injection site, while minimizing spread of viral particles along the injection tract. Rats are then implanted with 200 μm optic fibers held in 2.5 mm ferrules in the ACC: AP +2.6 mm, ML ±1.6 mm, DV -1.25 mm. Fibers with ferrules are held in place by dental acrylic. Allow the virus to be properly expressed in the neurons (2 to 4 weeks depending of the viral vector serotype).",
    "For 1 week prior to beginning experiments, rats are habituated to the experimenter and the environment. Rats must be comfortable with the experimenter to give the best possible results. Rats are handled by the experimenter. If they seemed stressed or anxious, they are put back in their cages and resumed habituation the following day. During all the behavioral phases, animals are allowed to move unrestricted to either side of the box. The movements of rats in each chamber are automatically recorded by a camera and analyzed with the ANY-maze software (Stoelting).During the preconditioning phase (Video 1), place rats randomly on either the left or the right side of the box to start. An equal number of animals in each group starts on either the left or the right side of the box. All animals are allowed to explore the two chamber apparatus without restraint for 10 min. The movement of each rat is recorded and analyzed to verify the absence of any preconditioning chamber preference (Figure 9). Animals spending more than 500 sec or less than 100 sec of the total time in any chamber should be eliminated from further testing or analysis (< 20% of total animals).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Preconditioning phase. All animals are allowed to explore the two chamber apparatus for 10 min. The two chambers are delimited by an orange rectangle and the position of the animal is monitored by a red dot tracking the center of the animal’s body. Time spent in each chamber is recorded by the camera linked to the ANY-maze software.Following the preconditioning phase, the rats undergo conditioning for 10 min (Video 2): each chamber is paired with a stimulus (noxious or not, different noxious intensity).",
    "As an example, chamber A is paired with a thermal painful stimulus (laser-High Stimulus HS) and the other chamber (B) is paired with a thermal non-painful stimulus (laser-Non Noxious Stimulus NS). Stimuli are given to the hind-paw every 10 sec when the animal is immobile. For each stimulus applied to the rat’s hind paw, bring the laser tip closely to the animal (0.3-0.5 mm without touching the rodent’s skin), between the holes in the grid of the mesh table. Even if the animal is freely moving, it has some immobile periods during which it’s possible for the experimenter to apply the stimulus on a precise location, its hind paw. Paw withdrawal removes the stimulus as the experimenter would stop applying the stimulus to the rodent’s hind paw.<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 2. Conditioning phase. Each chamber is paired with a stimulus. The left chamber is paired with a thermal painful stimulus (laser-High Stimulus HS) and the right chamber is paired with a thermal non-painful stimulus (laser-Non Noxious Stimulus NS). Stimuli are given to the hind-paw every 10 sec. Peripheral stimuli are applied to the hind paws through the mesh table.As you can observe on this picture (Figure 8), the tip of the laser (red arrow) is positioned between the holes of the mesh table, allowing to come as close as 0.3-0.5 mm to the rat’s hindpaw, standing above.Note: In some experiments, the thermal stimulus delivered by the HPL is paired with an optogenetic activation or inhibition of ACC neurons controlled by the LPL. If channel 1 controls HPL1 and channel 3 controls the LPL for the optogenetic stimulation you just have to click on ‘Start All’ on the OTPG4 software interface (Figure 4) and you will activate both lasers simultaneously.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171101/20171101203627_9951.jpgFigure 8.",
    "How to apply the stimulusFinally, the animals undergo a test phase (Video 3), where they are allowed to explore the two chamber apparatus for 10 min (Figure 9).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 3. Test phase. All animals are allowed to explore the two chamber apparatus for 10 min. This phase is comparable to the preconditioning phase and aims to see the effect of the conditioning through a change of time spent in each chamber.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171101/20171101203808_9866.jpgFigure 9. Representative results of CPA behavior (original Figure 1.C [Zhang et al., 2017]: Rats recognize and seek to avoid the aversive value associated with HS). During conditioning, rats receive HS in one chamber and NS in the other chamber. After conditioning, rats spend less time in the chamber paired with HS during the post conditioning phase (blue bars) than during the preconditioning phase (white bars), and more time in the chamber paired with NS. n = 14; P < 0.0001; paired Student’s t-test.At the end of the test, place the animal back in his cage; clean the apparatus, and mesh table with a 70% ethanol solution."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}