{
  "id": 9735,
  "origin_website": "Jove",
  "title": "Migratory Behavior of Cells Generated in Ganglionic Eminence Cultures",
  "procedures": [
    "1. Reagent preparation\nThaw frozen Matrigel on wet ice, leaving enough time before the experiment (do not speed up the process by active warming). Matrigel is used to establish a 3D environment closely resembling an extracellular matrix conducive to the migration of cells. It provides cells with both a substrate and mechanical encasing. Matrigel is stored frozen at -20°C. Prior to use, it should be gradually brought up to the temperature of 0-4°C, i.e. thawed on wet ice or in a refrigerator. Matrigel irreversibly sets to form a gel in the temperature of incubation (37°C). Therefore it is not recommended to speed up thawing by immersing the container in warm water.\nProtein fractions are prepared by isoelectric focusing (IEF) of the total protein extract from the cerebral cortex of postnatal day 0 (P0) ferret. After separation, the fractions are dialyzed overnight against 20mM Tris-HCl pH7.2 to clean the extracts from the focusing buffer constituents, which might be toxic to the tissue.\nProtein delivery system. Proteins extracted from the cerebral cortex are adsorbed on fluorescent latex beads which then slowly release the proteins to the environment.We found that the fluorescence feature helps in visual handling of microspheres and allows easy detection of even minimal spillovers from the site of bead deposit, when observed under fluorescent microscope.\nAdd 10μl of fluorescent beads to 100-200μl of protein solution\nIncubate for 30min in dark at RT on a shaker\nSpin the beads down in a bench centrifuge for 1hr at max speed\nRemove supernatant\nRe-suspend in a vortex using 10μl of fresh medium\nAdd 30μl of Matrigel to the suspension, mix well, and place on ice.\nBuffers and media",
    "Prepare and filtration-sterilize artificial cerebrospinal fluid (aCSF; NaCl 124mM, NaHCO3 26mM, NaH2PO4 1.2mM, KCl 3.2mM, MgSO4 1.2mM, CaCl2 2.4mM, Glucose 10mM). Slush-freeze the aCSF beforehand, so it's ready at the time of tissue dissection. To make it, place a plastic flask filled with sterile aCSF in a -80°C freezer. Monitor freezing every so often, so when a layer of ice builds up on the inside of wall, break it and mix with the fluid. Repeat until the flask contains mostly an icy slush. Buffer prepared this way not only supports tissue survival, but will also hold low temperature longer, and is mechanically less harmful to the tissue than chunky ice cubes.\nPrepare Neurobasal medium with N-2 and B-27 supplements added according to manufacturer's suggestions, as well as 1mg/100ml gentamycin, 2 mM L-glutamine, and 0.6 % glucose. Sterilize by filtration through a 0.22μm membrane. Keep warm at 37°C until use.\nCulture plates\n \nCulture grade plastic six-well plates are prepared by dotting each well in its center with a small amount (about 2μl) of cold Matrigel using 20μl pipette tip, and placing an autoclaved round 18mm glass coverslip on each drop. Neither the plates nor the coverslips need to be otherwise culture treated. \n2. Tissue preparation\nObtaining the brain tissue\n     \nAfter deeply anesthetizing the animal with Euthasol, remove the brain and place it in ice-cold aCSF\nSeparate the hemispheres with a scalpel and slice coronally at 500μm using a device of choice, collecting slices into a small dish containing ice-cold aCSF\nMaking explants (use dissecting microscope)\n     \nIdentify slices containing the ganglionic eminences (GE) and trim regions of cortex that may curl over GE and interfere with further steps",
    "Press a Harris Uni-Core bore in the area close to ventricular surface of GE, retract a core containing predominantly a ventricular zone, and expel it with a plunger into the ice-cold medium (Fig.1).  Three to four explants of 0.5 mm diameter can be made from the GE in single P0 ferret brain slice. Please note that in both rodents and ferrets, the medial and lateral GEs are fused at this age. If a core stays in the slice or is stuck to the plastic bottom of the dish, mobilize it by squirting aCSF with a pipette tip and transfer with a pipette into the dish containing cold Neurobasal medium. Keep the dish on wet ice.\nTransfer a batch of explants from the medium into a large drop of ice-cold Matrigel (about 0.25-0.5ml) placed in a separate dish, taking care to have the explants fully immersed and avoiding bubbles. Keep the dish on wet ice. The size of a batch depends on the speed of the workflow downstream.\n3. Culture setup (use dissecting microscope)\nAlways keep Matrigel and Matrigel-containing mixes on ice to avoid curing.\nRemix the bead suspension and place 1-2μl or less of the bead suspension in ice-cold Matrigel in the center of a glass coverslip previously placed in a culture plate well using a 20μl pipette tip. Let it set a little, avoid drying.",
    "Using a 20μl pipette tip pick up 2 explants from the Matrigel drop and place them in the desired vicinity of the bead deposit (at least 1mm away from the edge of the deposit) symmetrically on the opposite sides. Let it set for no longer than 5min at room temperature. The right timing of steps b and c is critical. If the time is too short it will lead to incomplete gelling and components of the culture setup will move when they are covered with the final layer of Matrigel; if the time is too long it may result in over-drying of the gel and creation of physical barriers impeding the free movement of cells.\nCover the beads and the explant with a flat layer of about 30μl of Matrigel, extending it beyond the explants (Fig.2). Let it set in the incubator for about 15 minutes.\nAdd 2ml of Neurobasal medium with supplements.\nIncubate at 37°C in 5% CO2/95% O2 monitoring migratory activity daily.\n4. Live imaging\nAfter incubation for 3-4 days, review the culture plates and choose coverslips of interest. The explants should generate a radially uniform cloud of cells. Replace chosen coverslips into a fresh culture plate that will be used in live imaging.\nLet the coverslips sit in the new plate over night. Before placing the plate on the microscope for imaging, in a cell culture hood, use a sterile spatula to move the coverslip in order to release any microbubbles that collect between the coverslip and the cell culture plate. Interference of bubbles will ruin the images. Move the coverslips to the center of the well.\nTo prevent evaporation, fill the space between wells with water.",
    "Carefully transfer the plate from the cell culture hood to the microscope as to not move the coverslips from the center of the well.\nDefine an imaging scheme using imaging software. Due to the 3D nature of the culture setup the cells also move vertically, therefore it is important to collect Z-planes encompassing full depth of the migration cloud. The XY extent of the imaged area should also be set large enough to cover areas predicted to be populated by migrating cells during the course of recording, and to contain the bead deposit in order to record an angular orientation of the explant and migrating cells relative to the source of the protein. Also consider that the more imaged Z planes, or the more area covered, the more time it takes to record a cycle at a particular time point, forcing longer time intervals between samples and a loss of temporal resolution of cell tracking. In our case, using a 10x objective, the optimal scheme was a 3x3 tile recording for each of 10 Z-planes spaced every 20μm, at intervals of 30min. We found 30 min intervals the longest that allows unequivocal identification of cells at consecutive time points, which is critical for reliable tracking of their movements.\nInitiate time lapse imaging.\nAfter the desired time, remove the plate and fix cultures in 4% phosphate-buffered paraformaldehyde. It can be used for further morphological and immunocytochemical analysis.\n5. Analysis of movement\nConvert the recorded time series of images into a format most convenient for further processing, TIFF being the most portable one.\nTrack the movement of individual cells over time by recording XY coordinates. This can be done using freely available software like ImageJ (NIH) with a Manual Tracking plug-in, or any other commercial application such as ImagePro, Volicity or AutoQuant.",
    "Plot the tracks using Excel or in-house developed software.\nFor each tracked cell calculate kinetic parameters such as average speed, curvature of path, directional variability over time, branching, deviation toward the source of proteins, etc. Calculations can be done in MS Excel or any equivalent spreadsheet. Our experience indicates however that it is far more productive to develop in-house scripts (using R, Matlab, Python, Perl or other, mostly Open Source languages), as they allow for more flexible customization and inclusion of more sophisticated analytical methods than those available in a basic installation of Excel.\n6. Representative Results:\nimgsrc://cloudfront.jove.com/files/ftp_upload/2583/2583fig1.jpg\nFigure 1. Diagram of the anatomical origin of explants. This is a drawing of a coronal slice of a hemisected ferret brain. The grey circles indicate the region from which the explants were taken.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2583/2583fig2.jpg\nFigure 2. Diagram of a culture setup. The bead deposit is the source of proteins; the explants are placed to either side and all elements are covered with Matrigel.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2583/2583fig3.jpg\nFigure 3. Corresponding plots of cell tracks colored by quadrants (arrows point toward the bead deposit). The cell tracks on the right are migrating toward fraction D, which appears to attract cells; the cells on the left are migrating toward fraction A, which appears to repulse migrating cells.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2583/2583fig4.jpg\nFigure 4. A) A series of images from selected timepoints showing a growing cloud of cells migrating out of an explant. An example cell, indicated by an arrow, is tracked through time  as indicated below (scale bar 200μm). This explant was visualized with live imaging for 38 h. Shown here are images of cells leaving the explant from the beginning of recording the images to the final image.  B) The cell indicated in part A at the times indicated. The cell shows  repetitive branching (scale bar 50μm)."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}