{
  "id": 13068,
  "origin_website": "Jove",
  "title": "Fluorescent In Situ Hybridization and 5-Ethynyl-2'-Deoxyuridine Labeling for Stem-Like Cells in the Hydrozoan Jellyfish Cladonema pacificum",
  "procedures": [
    "NOTE: See the Table of Materials for details related to all materials, reagents, and equipment used in this protocol.\n1. Probe synthesis\nRNA extraction\n\t\nPlace three live Cladonema medusae that are cultured in artificial seawater (ASW) in a 1.5 mL tube using a 3.1 mL transfer pipette with the tip cut off, and remove as much ASW as possible.\n\t\tNOTE: ASW is prepared by dissolving a mixture of mineral salts in tap water with chlorine neutralizer; the final specific gravity (S.G.) is 1.018 or the parts per thousand (ppt) is ~27.\nFreeze the 1.5 mL tubes in liquid nitrogen to inhibit RNase activity. Add 30 µL of lysis buffer from the total RNA isolation kit in which 2-mercaptoethanol (1 µL/100 µL of lysis buffer) has been added and homogenize the samples in the lysis buffer using a homogenizer.\n\t\tNOTE: To avoid overflow of the buffer and sample from the tubes, homogenization with a small amount of lysis buffer is recommended.\nAdd 570 µL of lysis buffer and extract the total RNA following the protocol of the total RNA isolation kit (Figure 1).\nMeasure the concentration of the extracted RNA using a spectrophotometer and store at −80 °C until use.\ncDNA synthesis\n\t\nUsing a kit, synthesize cDNA using the total RNA extracted from the medusae as a template (Figure 1 and Table 1).\nIncubate at 65 °C for 5 min.\nCool rapidly on ice.\nPerform cDNA synthesis with the mixture from step 1.2.1 (Table 1). Mix thoroughly by pipetting and incubate at 42 °C for 60 min.\nIncubate at 95 °C for 5 min.\nCool rapidly on ice.\nMeasure the concentration of the synthesized cDNA using a spectrophotometer and store at or below −20 °C until use.\nPCR product synthesis",
    "To create a PCR template, design the specific primer using Primer-BLAST. Source the reference sequence from NCBI data or RNA-seq data.\n\t\tNOTE: See the Table of Materials for the primers used in this protocol.\nTo amplify the target sequence, perform TA cloning, which does not require the use of restriction enzymes. To obtain a PCR product in which an adenine is added at the 3' end, use the following settings: 98 °C for 2 min; 35 cycles of 98 °C for 10 s, 55-60 °C for 30 s, 72 °C for 1 min. Use Taq DNA polymerase for the reactions (Table 1).\n\t\tNOTE: To determine the PCR conditions, follow the protocol that accompanies the DNA polymerase to be used, which generally provides a recommended annealing temperature and extension time.\nRun the PCR product through a 1% agarose gel and cut out the band of interest. Extract the PCR products from the cut gels using a gel extraction kit.\nLigation\n\t\nLigate the PCR product to the vector with 3' thymine overhangs by mixing the reagents (Table 1) and incubating at 37 °C for 30 min (Figure 1).\n\t\tNOTE: The molecular ratio of vector:PCR should be 1:>3. The pTA2 vector size is approximately 3 kb. If the PCR product (insert) is A (kb) and B (ng/µL), the volume of the insert (X in Table 1) to be taken can be calculated by ([50 ng of vector × A kb of insert])/(3 kb vector × [1/3]) = 50·A ng of insert. If the concentration of insert is B ng/µL, then volume taken is 50·A/B µL of insert.\nTransformation and plating",
    "For transformation, thaw the competent cells on ice and dispense them into 20 µL aliquots each. Add 1 µL of the plasmids containing the PCR product (less than 5% of competent cell volume) and vortex for 1 s. Incubate on ice for 5 min, and then incubate at 42 °C for 45 s, and vortex for 1 s.\nAdd 180 µL of Super Optimal broth with Catabolite repression (SOC) medium (a nutritionally rich bacterial culture medium) to the competent cells and incubate at 37 °C for 30 min. After 30 min, spread the competent cells onto an agar plate containing ampicillin, 5-bromo-4-chloro-3-indolyl-beta-D-galacto-pyranoside (X-gal), and isopropyl-β-d-1-thiogalactopyranoside (IPTG), and incubate at 37 °C for 12-16 h (Figure 1).\n\t\tNOTE: X-gal and IPTG are used for selecting blue and white colonies.\nLiquid culture\n\t\nPick a white colony out of the white and blue colonies on the plate. Add it to 3-5 mL of LB medium with ampicillin and incubate on a shaker for 12-16 h at 37 °C (Figure 1).\nMiniprep\n\t\nExtract the plasmid from the LB medium using a plasmid miniprep (Figure 1).\nQuantify the plasmid concentration using a spectrophotometer.\nRead the sequence.\n\t\nTo read the DNA sequence of the plasmid, send the plasmid for Sanger sequencing and then use software to align it with the genome/transcriptome sequence to confirm whether the target sequence is properly synthesized and assess in which direction the target sequence is inserted into the plasmid (5' to 3' or 3' to 5').",
    "NOTE: If the target sequence is inserted into the plasmid in the 5' to 3' direction from the RNA polymerase binding site near the 3' end, an antisense probe can be generated by in vitro transcription. If the target sequence is inserted in the reverse 3' to 5' direction, a sense probe (negative control) can be generated. If using vectors such as pTA2, two transcription binding sites can be used depending on the purpose.\nIn vitro transcription\n\t\nPrepare the DNA template from the created plasmid by performing PCR using primers outside the RNA polymerase binding site (e.g., T7/T3 binding sites) in the plasmid (Figure 1).\n\t\tNOTE: Universal primers such as the M13-20 forward primer and the M13 reverse primer can be used to prepare a DNA template that includes RNA polymerase binding sites.\nPurify the template after PCR amplification using a gel/PCR extraction kit.\nMix the reagents shown below, and perform the transcription reaction at 37 °C for 3 h (Figure 1 and Table 1).\nAdd 1.5 µL of DNase and incubate at 37 °C for 30 min.\nAdd 10 µL of RNase-free water and purify the probe from the transcription reaction solution using a clean-up column.\nCheck the size of the synthesized RNA by loading 1 µL onto a 1% agarose gel and determine the concentration using a spectrophotometer.\n\t\tNOTE: Synthesized RNA probes should have a concentration of at least 100 ng/µL.\nAdd 30 µL of formamide for storage at or below −20 °C.\n2. EdU incorporation and fixation",
    "Place Cladonema medusae (5-10 animals per tube) into 1.5 mL tubes using a 3.5 mL transfer pipette and add ASW up to a total volume of 500 µL. Add 7.5 µL of 10 mM EdU stock solution and incubate the samples for 1 h at 22 °C (Figure 2). The EdU final concentration is 150 µM.\n\tNOTE: Use 5-7-day-old medusae to monitor third branch formation (Figure 3A). The day that the medusae detach from the polyp is counted as day 1, and on day 5, medusae typically start to exhibit a third branch on their main tentacles.\nAfter 1 h, remove as much ASW containing EdU as possible.\nTo anesthetize the medusae, add 7% MgCl2 in H2O and incubate for 5 min.\nRemove the 7% MgCl2 in H2O and fix the medusae overnight (O.N.) at 4 °C with 4% paraformaldehyde (PFA) in ASW (Figure 2).\n\tNOTE: When performing FISH without EdU incorporation, samples can be fixed similarly to those treated with EdU following anesthetization (steps 2.3-2.4).\n3. Fluorescent  in situ hybridization\nProteinase treatment and post fixation\n\t\nRemove the PFA and wash the samples with PBS containing 0.1% Tween-20 (PBST) for 3 x 10 min. Use 300-500 µL of PBST per wash.\n\t\tNOTE: From this step to the end of hybridization, the experiment should be performed in an RNase-free environment, wearing gloves and a mask. The 1x PBS in this step must be made with DEPC-treated water. After hybridization, 1x PBS made with water without DEPC treatment can be used. Some ISH and FISH protocols dehydrate samples using methanol steps, which makes it possible to save the fixed samples at −20 °C until use. To avoid superfluous work, the dehydration process is omitted from this protocol, particularly since the samples can be kept in PBST for up to a few days.",
    "After fixation, place the sample in 1.5 mL tubes on a shaker, except for the anti-DIG-POD antibody O.N. incubation step (step 3.4.2). After washing, add 10 mg/mL Proteinase K stock solution in PBST and incubate the medusae with Proteinase K (final concentration: 10 µg/mL) at 37 °C for 10 min.\nRemove the Proteinase K solution and wash the samples for 2 x 1 min with PBST.\nTo postfix the medusae, add 4% PFA in 1x PBS and incubate at 37 °C for 15 min.\nRemove the PFA solution and wash the samples for 2 x 10 min with PBST.\n\t\tNOTE: If the target gene is highly expressed with low background signal, steps 3.1.2-3.1.5 can be skipped.\nHybridization\n\t\nRemove the PBST and add Hybridization Buffer (HB Buffer, Table 1). Incubate the samples in HB Buffer for 15 min at room temperature (RT). Use 300-400 µL of HB Buffer, which provides enough volume for successful hybridization.\n\t\tNOTE: HB Buffer, Wash Buffer 1, and Wash Buffer 2 are prepared with 20x SSC stock. HB Buffer is stored at or below −20 °C and must be brought to RT before use.\nRemove the HB Buffer and add new HB Buffer. Prehybridize at 55 °C for at least 2 h in a hybridization incubator.\nRemove the HB Buffer and incubate with HB Buffer containing the probes that were stored in step 1.9.7 (final probe concentration: 0.5-1 ng/µL in HB Buffer). Hybridize at 55 °C for 18-24 h (Figure 2) in a hybridization incubator.",
    "NOTE: FISH signal intensity and specificity can vary due to target gene expression, as well as probe length and specificity. To increase the intensity, parameters such as hybridization duration (18-72 h) and temperature (50-65 °C) can be adjusted, and different probes can be tested. To avoid non-specific signals, Proteinase K treatment (concentration and duration) can be modified19.\nProbe removal\n\t\nRemove the HB Buffer containing probes, and then add Wash Buffer 1 (Table 1). Wash the samples with Wash Buffer 1 for 2 x 15 min at 55 °C. Use 300-400 µL of wash buffer.\n\t\t​NOTE: HB Buffer containing probes can be used repeatedly, up to about ten times. Instead of discarding, store the used HB Buffer containing probes at or below −20 °C. Preheat Wash Buffer 1, Wash Buffer 2, 2x SSC, and PBST at 55 °C before use.\nRemove Wash Buffer 1, and then add Wash Buffer 2 (Table 1). Wash the samples with Wash Buffer 2 for 2 x 15 min at 55 °C.\nRemove Wash Buffer 2, and then add 2x SSC. Wash the samples with 2x SSC for 2 x 15 min at 55 °C.\nRemove 2x SSC, and then add preheated PBST. Wash the samples for 1 x 15 min with PBST at RT.\nAnti-DIG antibody incubation\n\t\nRemove PBST, and then add 1% blocking buffer. Incubate the samples for at least 1 h at RT while shaking slowly on a rocker.\n\t\tNOTE: Prepare 1% blocking buffer freshly by diluting 5% blocking buffer stock (Table 1). Check the samples before the next antibody reaction because the sample tends to stick to the back of the lid or the wall as a result of shaking.",
    "After blocking, remove the 1% blocking buffer, add anti-DIG-POD solution (1:500, in 1% blocking buffer), and incubate the samples O.N. at 4 °C (Figure 2).\n\t\tNOTE: Be careful to keep the incubation time within 12-16 h to prevent the detection of non-specific signals.\nDetection of DIG-labeled probe\n\t\nRemove the anti-DIG-POD solution, and then add Tris-NaCl-Tween Buffer (TNT, Table 1). Wash the samples with TNT for 3 x 10 min at RT.\n\t\tNOTE: The use of the tyramide signal amplification (TSA) technique provides a better resolution image against horseradish peroxidase-labeled reagents (e.g., anti-DIG-POD).\nDilute fluorescent dye-conjugated tyramide (Cy5-tyramide) stock solution (1:50) in the amplification diluent buffer to make the active Cy5-tyramide solution (Figure 2).\nRemove as much TNT as possible, and then add the active Cy5-tyramide solution. Incubate the samples for 10 min in the dark.\nWash the samples with PBST for 3 x 10 min in the dark.\nDetection of EdU\n\tNOTE: The EdU kit detects incorporated EdU as fluorescent signals (Figure 2).\n\t\nTo prepare the EdU detection cocktail, mix the components as shown in Table 1. Use 100 µL of EdU detection cocktail for each sample.\n\t\tNOTE: Prepare 1x Reaction Buffer additive by diluting 10x Reaction Buffer additive with ultrapure water.\nRemove PBST, and then add the EdU detection cocktail. Incubate in the dark for 30 min.\nWash with PBST for 3 x 10 min in the dark.\nDNA staining\n\t\nDilute Hoechst 33342 (1:500) in PBST to prepare the Hoechst solution. Remove the PBST, and then add the Hoechst solution. Incubate the samples for 30 min in the dark (Figure 2).\nWash the samples with PBST for 3-4 x 10 min in the dark.\nMounting",
    "Make a bank on the glass slide to prevent the sample from being crushed. Apply vinyl tape to the glass slide and hollow out the center.\nTransfer the medusae to the bank on the slide glass using a 3.1 mL transfer pipette with the tip cut off.\n\t\tNOTE: Be careful not to let the tentacles overlap.\nRemove any PBST with a P200 pipette, and then slowly add 70% glycerol as the mounting medium (Figure 2).\n\t\tNOTE: Instead of 70% glycerol, anti-fading mounting medium can be used to prevent the fluorescence from fading.\nGently place a coverslip on the medusae with forceps, and seal the side of the coverslip with clear nail polish.\nKeep the slides at 4 °C in the dark if not immediately performing microscopy observation.\nImaging\n\t\nUse a laser scanning confocal microscope to acquire images. For single-cell resolution, use a 40x oil lens or a lens for higher magnification.\nAfter image acquisition, open the images using ImageJ/FIJI software and count cells that are positive for EdU+ and/or Nanos1+ by the multipoint tool20.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}