{
  "id": 17758,
  "origin_website": "Jove",
  "title": "A Whole Body Dosimetry Protocol for Peptide-Receptor Radionuclide Therapy (PRRT): 2D Planar Image and Hybrid 2D+3D SPECT/CT Image Methods",
  "procedures": [
    "The dosimetry procedure was performed according to the treatment protocol \"Radiometabolic Therapy (RMT) with 177Lu-PSMA-617 in advanced castration resistant prostate cancer (CRPC): efficacy and toxicity evaluation\" (EUDRACT/RSO number: 2016-002732-32) (Figure 1). Selected patients underwent dosimetry evaluation based on performance status. All patients signed informed consent. Prior to treatment delivery, each patient underwent a 68Ga-PSMA-11 PET/CT whole body scan.\nNOTE: It is important to underline that some steps are linked specifically to the scanner used.\n1. Pre-infusion Imaging: Transmission and Blank Image Acquisition\nNOTE: In this first image acquisition the patient's water equivalent thickness is evaluated. This value is used for attenuation correction of counts derived from 2D planar images acquired post 177Lu-PSMA-617 injection.\nSet low energy high resolution collimators (LEHR).\nOpen the image protocol acquisition on the workstation and select transmission scan whole body planar image acquisition.\nCheck the table velocity (e.g., 7 cm/min) and zoom (e.g., 1). Keep these values equal for the blank scan acquisition. Check that the option Body Contour is disabled.\nPosition the patient on the couch feet-first supine with arms at-rest along the side of the body. Use this position for all the images. If necessary, use available supports (arm support, knee wedge, pillow, blanket).\nTake note of the exact position of the patient, using the scale number along the couch: vertex head position, knee position, foot position, couch height, all supports used. Take note of the patient's weight and height.\nSet the SPECT dual heads at the opposite positions (i.e., 0° and 180°) and at the maximum distance from the FOV center. Raise the couch so that the patient is positioned at the FOV center and with head at the detector center.\nPosition the 57Co flood support on the posterior camera and then the 57Co flood itself on the support. Start image acquisition.",
    "At the end of image acquisition, remove the 57Co flood and support. Press Unload on the teach pendant. Help the patient to get up.\nRepeat the image acquisition in the same way but without the patient positioned on the couch.\n\tNOTE: Couch velocity, table height and camera distance should be set at the same value as the previous transmission image.\n2. Post-infusion Image Acquisition: Planar Image\nNOTE: Planar post-image acquisitions are used for effective half-life and mean absorbed dose evaluation of different structures.\nAcquire first image 0.5-1 h after 177Lu-PSMA-617 infusion (day 1, Figure 1).\n\t\nAcquire the first image before bladder voiding. If the patient feels an urgent need for bladder voiding, provide a proper vessel for urine collection. Take care to include the vessel (or urine bag if the patient has a catheter) in the image.\nCollect a 2 mL blood sample, close the collection tube and place it in a shielded box, noting the time.\nChange to medium energy high resolution collimator (MEHR).\nOpen the image protocol acquisition on the workstation and select whole body planar image acquisition. Check the table velocity (e.g., 7 cm/min) and zoom (e.g., 1). Keep these values equal for all the other images. Check that the option Body Contour is disabled.\nPosition the patient on the couch, ensuring that the position is the same as that used for the previous image (i.e., pre-infusion transmission scan).\nSet the SPECT dual heads at opposite positions (i.e., 0° and 180°). Raise the table so that the patient is positioned at the FOV center and with the head at the detector center.\nUsing the teach pendent, manually adjust the position of the posterior camera (i.e., positioned at 180°) to reach the minimum distance from the inferior couch profile.",
    "Manually adjust the position of anterior camera (i.e., positioned at 0°) to reach minimum distance from the patient's profile. Take into account the entire body surface along the whole patient height to avoid collision during scanning.\nTaking note of the position of the duel heads, start image acquisition.\nAt the end of image acquisition, press Unload on the teach pendant and help the patient to get up.\nRepeat the same image acquisition with the same camera settings at 16-24 h (second image, day 2), 36-48 h (third image, day 3). Additional images (one or more) can be acquired up to 120 h post infusion (e.g.  66-70 h and 120 h) based on patient compliance and Institution resources.\nCollect a 2 mL blood sample at the same time as the SPECT image acquisition, close the collection tube and place it in a shielded box, making a note of the time.\n3. Post-infusion Image Acquisition: 3D SPECT/CT\nNOTE: On day 2 (16-24 h post infusion) a 3D image acquisition is performed, together with the planar image acquisition. The 3D SPECT/CT image focuses on the abdominal region and enables organ overlap (e.g., kidneys or intestinal loops) to be avoided on anterior/posterior projections.\nAfter planar image acquisition, select the 3D SPECT/CT image inside the dosimetry protocol on the workstation.\nCheck that the proper image parameters have been set: acquisition modality (e.g., step-and-shoot), angle per projection (e.g., 5°), number of frames per rotation (e.g., 72), frame duration (e.g., 3,000 ms). Check that Body Contour is disabled.",
    "Position the detector at the maximum distance from the center to avoid collision. Position the patient with arms lifted over the head. Position the patient table inside the camera until when the desired region is centered on the detector (e.g., kidneys and a specific lesion situated in the same region). Start image acquisition.\nAcquire the corresponding CT image.\nAt the end of image acquisition, press Unload on the teach pendant and help the patient get up.\n4. Image Analysis\nNOTE: Scatter, attenuation, and background corrections are implemented. Single organ and lesion mass are considered for absorbed dose evaluation. ROI and VOI are contoured on planar and 3D images.\nSend all acquired images from the acquisition workstation to the analysis workstation.\nFor all post-infusion images, select emissive, low and high scatter images and click on the right panel of the dedicated workflow to create a scatter corrected image imgsrc://cloudfront.jove.com/files/ftp_upload/60477/60477eq2.jpg, as follows:\nimgsrc://cloudfront.jove.com/files/ftp_upload/60477/60477eq1.jpg\n\twhere imgsrc://cloudfront.jove.com/files/ftp_upload/60477/60477eq3.jpg, imgsrc://cloudfront.jove.com/files/ftp_upload/60477/60477eq4.jpg and imgsrc://cloudfront.jove.com/files/ftp_upload/60477/60477eq5.jpg are emissive, lower scatter and higher scatter 2D anterior or posterior planar whole-body images, respectively; imgsrc://cloudfront.jove.com/files/ftp_upload/60477/60477eq6.jpg, imgsrc://cloudfront.jove.com/files/ftp_upload/60477/60477eq7.jpg and imgsrc://cloudfront.jove.com/files/ftp_upload/60477/60477eq8.jpg are emissive, lower scatter and higher scatter energy window widths, respectively.\nOpen each posterior image, click on Image, then Reorient, Pan, Zoom..., flag Y mirror, click Apply & Quit, and then save the rotated left-right image.\nOpen anterior and posterior (rotated) scatter-corrected planar images acquired post infusion.\nSelect the image acquired on day 2 as the most suitable for ROI delineation. Contour organs: whole body (encompassing also urine vessel or bag when needed), kidneys, liver, spleen (if visible), parotid glands, submandibular glands, lachrymal glands. If possible, also contour some visible lesions. Contour the ROIs on the most useful image between anterior and posterior views (Figure 2). Contour a small ROI adjacent to each contoured structure for background.",
    "Copy and paste all ROIs from the image acquired on day 2 to the anterior and posterior views of the other images acquired post infusion.\nUse only ROI translation and do not modify to maintain the same organ dimension. For each acquired post infusion, select anterior image. Save contoured ROIs.\nFor each image, take note of average counts [c] and pixel dimension inside each ROI (including background ROIs) for both anterior and posterior views3.\nOpen anterior transmission and blank scans, together with delineated ROIs. Copy and paste organ and lesions ROIs onto transmission scan. Adjust for organ mismatch, and if needed, enlarge or decrease organ contours for different image magnification.\nFor body attenuation, contour a structure encompassing head, shoulders, chest and abdomen, avoiding arms and legs (Figure 3).\nCopy and paste all ROIs from transmission to blank scan.\nEvaluate the water equivalent thickness z for each structure to estimate the self-attenuation. Take note of average counts inside each ROI on both transmission (Itransmission) transmission and blank (Iblank) scans. Calculate water equivalent thickness z as\nimgsrc://cloudfront.jove.com/files/ftp_upload/60477/60477eq9.jpg\n\twhere imgsrc://cloudfront.jove.com/files/ftp_upload/60477/60477eq10.jpg is the attenuation coefficient for 57Co flood previously measured with a uniform phantom.\nUse the pre-treatment 68Ga-PSMA-11 PET/CT scan. Contour organs on CT image: kidneys, liver, spleen, parotid glands and submandibular glands. Contour lesions on PET images. Assuming a uniform water composition for each structure, calculate the mass of each contoured structure using a unit density (1 g/mL).\nPerform SPECT/CT image reconstruction, taking into account scatter correction, CT attenuation correction and resolution recovery. Set the same iterative reconstruction values as used for SPECT calibration (e.g., OSEM iteration and subset numbers, post reconstruction filtering).\n5. Blood Sample Measurements\nNOTE: Blood sample measurements are performed on High Purity Germanium (HPGe) detector for red marrow dose estimation.",
    "Let blood sample decay for approximately 2 weeks to avoid detector saturation and high dead time.\nAfter 2 weeks, measure one sample at a time. Because of the low activity, start measurements from the last acquired blood sample (i.e., from day 6).\nPosition the blood sample collection tube on the dedicated holder. Use the same geometry as that used for HPGe calibration. Position it on the HPGe detector and close the detector shielding case.\nOpen the software for spectrum acquisition and analysis. Check that the dead time is <3%. If higher, wait a few more days and perform the measurements then.\nSelect the proper HPGe calibration file corresponding to the 2 mL collection tube geometry holder. Start sample measurements (minimum 12 h measurements).\nAnalyze the spectrum by identifying the mean gamma peak and by calculating activity concentration. Take note of both measured sample activity and time and date measurements.\nRepeat the same measurements and analysis for all of the blood samples.\n6. Dosimetry evaluation\nNOTE: The analysis is performed with a dedicated dosimetry software based on MIRD publications4,5,6,7,8. For each considered structure, effective half-life is evaluated on sequential 2D whole body images by bi- or mono-exponential curve fitting of time-activity curves. 3D SPECT/CT imaging is used to resolve the problem of high uptake intestine overlap on kidney structure by scaling the time-activity curves derived from planar images. Mean absorbed dose is then calculated for each structure mass. For red marrow dose evaluation, blood samples measurements are used and scaled to the patient's weight.\nPlanar images\n\t\nFor each image and structure, calculate the counts on anterior (imgsrc://cloudfront.jove.com/files/ftp_upload/60477/60477eq11a.jpg) and posterior (imgsrc://cloudfront.jove.com/files/ftp_upload/60477/60477eq11b.jpg) view as\nimgsrc://cloudfront.jove.com/files/ftp_upload/60477/60477eq11.jpg",
    "where imgsrc://cloudfront.jove.com/files/ftp_upload/60477/60477eq12.jpg is the average count [c] for the considered ROI, imgsrc://cloudfront.jove.com/files/ftp_upload/60477/60477eq13.jpg is the average count [c] in the corresponding background region, and imgsrc://cloudfront.jove.com/files/ftp_upload/60477/60477eq14.jpg is the pixel number inside the ROI.\nFor each ROI, calculate the uptake at each image time point as\nimgsrc://cloudfront.jove.com/files/ftp_upload/60477/60477eq15.jpg\n\t\twhere imgsrc://cloudfront.jove.com/files/ftp_upload/60477/60477eq16.jpg is the attenuation correction factor for 177Lu, imgsrc://cloudfront.jove.com/files/ftp_upload/60477/60477eq15a.jpg is the 177Lu physical half-life, Δt is the time difference between infusion and image acquisition9, and z is the water equivalent thickness evaluated on transmission scan.\nCalculate the relative uptake as\nimgsrc://cloudfront.jove.com/files/ftp_upload/60477/60477eq17.jpg\n\t\twhere imgsrc://cloudfront.jove.com/files/ftp_upload/60477/60477eq18.jpg is imgsrc://cloudfront.jove.com/files/ftp_upload/60477/60477eq19.jpg evaluated for whole body on the first post-infusion image. As whole urine is included in the image, this is considered as a reference for the total effective infused activity.\nHybrid 2D+3D SCPET/CT images\n\t\nFor SPECT/CT activity calibration, image a cylindrical phantom with a central sphere of known activity. Contour the central sphere VOI and calculate the calibration factor [cps/MBq] as\nimgsrc://cloudfront.jove.com/files/ftp_upload/60477/60477eq20.jpg\n\t\twhere imgsrc://cloudfront.jove.com/files/ftp_upload/60477/60477eq20a.jpg are the total counts inside the VOI [c], imgsrc://cloudfront.jove.com/files/ftp_upload/60477/60477eq20b.jpg the image acquisition time [sec] and imgsrc://cloudfront.jove.com/files/ftp_upload/60477/60477eq21.jpg the known injected activity [MBq] inside the central sphere. SPECT/CT image for the patient is performed with the same acquisition and reconstruction parameter settings.\nOpen the SPECT/CT image. Contour volumes of interest (VOIs) (e.g., kidneys, visible lesion) are based on both uptake information and CT morphology. Calculate the activity in the structure as\nimgsrc://cloudfront.jove.com/files/ftp_upload/60477/60477eq22.jpg\nCalculate\nimgsrc://cloudfront.jove.com/files/ftp_upload/60477/60477eq23.jpg\n\t\twhere imgsrc://cloudfront.jove.com/files/ftp_upload/60477/60477eq23a.jpg is the injected activity during treatment.\nCalculate the scaling factor for the time activity curve as\nimgsrc://cloudfront.jove.com/files/ftp_upload/60477/60477eq24.jpg\n\t\twhere imgsrc://cloudfront.jove.com/files/ftp_upload/60477/60477eq25a.jpg is the imgsrc://cloudfront.jove.com/files/ftp_upload/60477/60477eq26.jpg calculated on planar image on day 2 (16-24 h) decay-corrected for physical half life at the time of injection.\nRescale the kidney 2D time activity curve imgsrc://cloudfront.jove.com/files/ftp_upload/60477/60477eq26.jpg with imgsrc://cloudfront.jove.com/files/ftp_upload/60477/60477eq24a.jpg factor accordingly. Perform dosimetry evaluation with OLINDA/EXM as described below.\nAdult male phantom",
    "Open dosimetry software. Select the radionuclide (e.g., 177Lu) inside the Nuclide Input Form module. Select the model (e.g., Adult Male) inside the Model Input Form module.\nGo to the Kinetic Input Form module and click Clear All Data. Click on Fit to Model and a separate window will open.\nIn the Time (Hr) column, insert the hours post infusion for each image acquisition, in hour format (e.g., 1 h and 30 min will be 1.50). Scroll down the organ menu and select organs of interest (e.g., kidneys, liver, spleen).\nFor each organ, insert the relative uptake imgsrc://cloudfront.jove.com/files/ftp_upload/60477/60477eq36.jpg at each image time point. Click Refresh.\nFor paired organs (i.e., kidneys) insert a single value as sum of left and right single relative uptakes imgsrc://cloudfront.jove.com/files/ftp_upload/60477/60477eq36.jpg. Click Refresh and check the point distributions on the left-end side plot.\nPerform a curve fitting using an exponential curve as\nimgsrc://cloudfront.jove.com/files/ftp_upload/60477/60477eq27.jpg\nA, B and C parameters may assume positive or negative values for wash-in and wash-out phase modeling, respectively. If data of time activity curves are decay-corrected, a, b and c parameters represent biological half life λbiol and are all positive. Choose an appropriate curve-fitting model between mono, bi or tri-exponential curves. Flag the required parameters, insert starting values and click Fit until the fit is performed.\nTake note of curve-fitting parameters. Calculate effective half-life as\nimgsrc://cloudfront.jove.com/files/ftp_upload/60477/60477eq28a.jpg\n\t\twhere λphys is the physical half life of 177Lu, and λbiol is the biological half life of 177Lu-PSMA-617 compound. For λbiol, consider the lowest values among a, b and c curve-fitting parameters (i.e., corresponding to the higher effective half life).\nRepeat from step 6.3.3 to step 6.3.7. for each organ.",
    "Insert the relative uptake at each image time point for the remainder of the body (namely Total Body/Rem Body) by subtracting the relative uptake of all considered organs from the whole-body uptake. Repeat from step 6.3.5 to step 6.3.7 for Total Body/Rem Body. Generally, a bi-exponential curve fitting is recommended.\nClick Done and save the model. The program goes back to the Kinetic Input Form module and the number of disintegrations per unit of injected activity (namely ND, expressed in Bq*h/Bq) is visualized for each considered organ.\nGo to Main Input Form. Click on Doses, and then Modify Input Data. In the box at the bottom Multiply all masses by:, insert the ratio between the patient's weight and Adult Male phantom weight (i.e., 73.7 kg). Click on the Multiply all masses by: button. All organ masses will be then rescaled accordingly. Insert single organ masses as calculated from CT delineation for the analyzed organs. For paired organs such as kidneys, insert the sum of left and right kidney masses. Click Done.\nThe report will display the mean absorbed dose normalized to injected activity, expressed in mGy/MBq. Take note of the total absorbed dose for considered organs (i.e., kidneys, liver, spleen, and Total Body).\nRepeat for time activity curves derived from the hybrid 2D+3D SPECT/CT method.\nRed marrow\n\t\nPerform scaling for blood values to calculate Red Marrow dose.\nCalculate the blood uptake at each blood sample acquisition as\nimgsrc://cloudfront.jove.com/files/ftp_upload/60477/60477eq29.jpg\n\t\twhere M is the activity measurement [MBq] obtained with HPGe 2 mL blood sample measurement.\nCalculate the blood relative uptake imgsrc://cloudfront.jove.com/files/ftp_upload/60477/60477eq30a.jpg as\nimgsrc://cloudfront.jove.com/files/ftp_upload/60477/60477eq30.jpg\n\t\twhere blood volume [mL] is the total blood volume estimation for the specific patient. This value is taken from the Adult Male standard phantom values10.\nRescale to Red Marrow (RM) mass and calculate the RM relative uptake imgsrc://cloudfront.jove.com/files/ftp_upload/60477/60477eq31a.jpg as",
    "imgsrc://cloudfront.jove.com/files/ftp_upload/60477/60477eq31.jpg\n\t\twhere imgsrc://cloudfront.jove.com/files/ftp_upload/60477/60477eq31b.jpg is the ratio of standard Adult Male phantom of imgsrc://cloudfront.jove.com/files/ftp_upload/60477/60477eq32.jpg (Red Marrow mass) equal to 1120 g and imgsrc://cloudfront.jove.com/files/ftp_upload/60477/60477eq33.jpg (whole body blood mass) equal to 5000 g.\nGo to Kinetic Input Form module and click Clear All Data. Click on Fit to Model. Scroll down the organ menu and select Red Marrow.\nIn the Time (Hr) column, insert the hours post infusion for each blood sample acquisition in hour format (i.e., 1 h and 30 min will be 1.50). Insert the values of imgsrc://cloudfront.jove.com/files/ftp_upload/60477/60477eq31a.jpg. Repeat steps 6.3.5-6.3.7. for Red Marrow.\nScroll down the organ menu and select Total Body/Rem Body. In the Time (Hr) column, insert the hours post infusion for each image acquisition in hour format (i.e., 1 h and 30 min will be 1.50). Insert the values of imgsrc://cloudfront.jove.com/files/ftp_upload/60477/60477eq35.jpg equal to the difference between imgsrc://cloudfront.jove.com/files/ftp_upload/60477/60477eq36.jpg of whole body calculated on planar images and imgsrc://cloudfront.jove.com/files/ftp_upload/60477/60477eq31a.jpg.\nRepeat from step 6.3.5 to point for Red Marrow.\nClick Done and save the Model.\n\t\tNOTE: The program goes back to the Kinetic Input Form module and the number of disintegrations per unit of injected activity (namely ND, expressed in Bq*h/Bq) is visualized for each considered.\nGo to Main Input Form. Click on Doses. Scale organ mass rescaling as the previous analysis on other organs.\nSphere model\n\t\nUse a unit density sphere model for structures that are not available in the phantom (e.g., lesions, parotid and submandibular glands).\nFor curve fitting, repeat from step 6.3.2 to step 6.3.10, substituting organ values with relative uptake for separated salivary glands and lesions.\nClick Done and save the model.\nThe program goes back to the Kinetic Input Form module and the number of disintegrations per unit injected activity [Bq*h/Bq] is visualized for each considered organ. Take note of ND for each considered structure.",
    "Go to Model Input Form. Click on Spheres.\nFor each structure, enter the calculated ND. Click on Calculate Doses. The report will display the mean absorbed dose normalized to injected activity, expressed in mGy/MBq, for discrete increasing sphere masses (g). Fit the curve with mono-exponential fitting and calculate the absorbed dose normalized to injected activity (mGy/MBq) for the specific structure mass.\nFor paired organs (e.g., salivary glands), perform the sphere model evaluation separately for left and right organs. Use the mean value between left and right structure for whole organ dose evaluation.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}