{
  "id": 2526,
  "origin_website": "Cell",
  "title": "SARS-CoV-2 CD8+ T cell killing assays using replicating viruses and transgenic antigens",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nGeneration of OTR-engineered SARS-CoV-2-specific CD8+ T cells\nIn this step, CRISPR-Cas9-mediated homology-directed repair is used to introduce a transgenic TCR orthotopically in the TCR endogenous locus of primary human T cells. This engineering technology is called ‘orthotopic TCR replacement’ (OTR). For a detailed protocol description please refer to (Moosmann et al., 2022[href=https://www.wicell.org#bib2]). In this protocol, we mainly summarized the different steps to provide an overview of the whole procedure.\nPreparation\nTiming: ∼ 1 week for step 1\nTiming: 30 – 60 min for step 2\nTiming: 1 day for step 3\nDNA template design.\nDesign DNA template as described in (Moosmann et al., 2022[href=https://www.wicell.org#bib2]).\nHDR constructs for this protocol were designed containing the murine constant region for both T cell receptor alpha and beta chains to simplify sorting of OTR-engineered cells.\nReconstitute reagents.\nReconstitute tracrRNA, hTRAC crRNA and hTRBC crRNA to 80 μM.\nReconstitute the electroporation enhancer to 400 μM in nuclease-free duplex buffer.\nReconstitute IL-2 to 10 μg/mL, and IL-7 and IL-15 to 25 μg/mL.\nAliquot biotin to 100 μM stocks.\nAliquot and store all reagents at −20°C.\nDouble-stranded DNA production.\nMake PCR master mix for amplification of HDR templates (see materials and equipment[href=https://www.wicell.org#materials-and-equipment]).\nRun PCR according to the following protocol:\ntable:files/protocols_protocol_2032_11.csv\nRun 2 μL per HDR PCR reaction on a 1% agarose gel to control for successful amplification.\nPerform DNA purification using the MinElute PCR Purification Kit and store purified HDR template at 1 μg/μL at −20°C.\nNote: Usually, the HDR template was generated in eight tubes of a PCR-strip tubes (8 × 100 μL). For PCR purification, all eight PCR reactions were pooled. A very good yield would be 50–70 μg, a good yield 30–50 μg.\nMethods\nTiming: 3 h for step 4",
    "Timing: 30 min (hands-on) + 2 days (additional cell culture) for step 5\nTiming: 30 min for step 6\nTiming: 60 – 90 min for step 7\nTiming: 5 min for step 8\nTiming: 30 – 60 min (hands-on) + 12 – 16 h (additional cell culture) for step 9\nTiming: 10 min (hands-on) + 3 days (additional cell culture) for step 10\nTiming: 2 h for step 11\nTiming: 4 h (hands-on) + 14–21 days (additional cell culture) for step 12\nIsolation of peripheral blood mononuclear cells (PBMCs) from fresh blood by Ficoll gradient.\nDilute fresh blood 1:0.4 with PBS (e.g., mix 25 mL of blood with 10 mL PBS).\nAdd 15 mL of Ficoll in 50 mL tubes.\nCarefully layer blood:PBS dilution on top of Ficoll.\nNote: Tilt tube at a 45 degree angle and add blood:PBS mixture dropwise on top. Do not add the blood mixture directly on Ficoll but on the side of the tube.\nCentrifuge for 15 min at 1,000 × g at 20°C–22°C with deceleration break turned off.\nTake off the plasma up to ∼ 0.5 cm over the PBMC layer.\nIsolate the PBMC layer in 50 mL tube, fill up with PBS to 50 mL and centrifuge for 10 min at 480 × g at 20°C–22°C.\nWash isolated PBMCs two more times with 50 mL PBS.\nCount cells with hemocytometer.\nT cell activation.\nSeed cells at a density of 1 × 106 cells/mL in complete RPMI medium supplemented with 300 U/mL IL-2, 5 ng/mL IL-7, 5 ng/mL IL-15 and 1.5 μL/106 cells CD3/CD28 expamer (Poltorak et al., 2020[href=https://www.wicell.org#bib4]).\nIncubate at 37°C, 5% CO2 for two days.\nNote: Titrate CD3/CD28 expamer before experiments to find the best concentration for editing.",
    "Alternatives: Anti-CD3 and anti-CD28 antibodies can be used alternatively for plate coating at a final concentration of 1 μg/mL in dPBS as described in (Moosmann et al., 2022[href=https://www.wicell.org#bib2]).\nPreparation of electroporation.\nTake off PBMCs and centrifuge for 10 min at 480 × g at 20°C–22°C.\nResuspend PBMCs in 1 mM biotin for 20 min at 20°C–22°C (50 mL cell culture volume can be resuspended in 25 mL of 1 mM biotin solution).\nAfter incubation, fill up the tube to 50 mL with PBS and centrifuge for 10 min at 480 × g at 20°C–22°C.\nPerform one more wash step with 30 mL PBS and centrifuge for 10 min at 480 × g at 20°C–22°C.\nPerform one final wash step with 50 mL complete RPMI medium.\nCount PBMCs.\nSplit total cell number for different experimental conditions and divide appropriate volumes in 15 mL tubes. Place cells in the incubator (37°C, 5% CO2) until electroporation.\nNote: The number of input cells added per 100 μL Nucleocuvette™ Vessels has an impact on the editing efficiency. Depending on the HDR construct and cell concentration during electroporation, the knock-in rate can range from 1%–10%.\nRNP production.\nMix equal volumes of tracrRNA with hTRAC or hTRBC crRNA (80 μM) respectively to prepare 40 μM hTRAC or hTRBC gRNA. Mix well by pipetting.\nHeat gRNA for 5 min at 95°C. Allow gRNA to cool to 20°C–22°C. Then store on ice if not used immediately.\nAdd 20 μM electroporation enhancer to gRNA.\nDilute Cas9 nuclease (stock: 61 μM) to 6 μM with commercial PBS. Store on ice if not used immediately.",
    "Mix very slowly equal volumes of 6 μM Cas9 protein and 40 μM gRNA (= tracrRNA + crRNA). Move pipette tip in cycles while adding Cas9, always add Cas9 protein to gRNA solution, not the other way around, final ribonucleoprotein (RNP) concentration: 20 μM.\nIncubate RNP complexes for 15 min at 20°C–22°C.\nPrepare P3 electroporation buffer (delivered with nucleofector kit) according to manufacturer’s protocol (Lonza).\nElectroporation. Volumes in this protocol are adjusted for 10 × 106 cells.\nPerform electroporation in 100 μL Nucleocuvette™ Vessels.\nMix together: 10 μL of TRAC RNP, 10 μL of TRBC RNP and 10 μL of HDR template (10 μg of a 1 μg/μL HDR stock solution).\nIncubate assembled RNP solution for at least 30 s at 20°C–22°C.\nCentrifuge cells for 10 min at 480 × g at 20°C–22°C and resuspend in 60 μL P3 buffer, assuming a cell pellet volume of 10 μL.\nAdd PBMCs resuspended in P3 buffer to assembled RNP solution and mix to reach a final volume of 100 μL.\nTransfer cells to 100 μL Nucleocuvette™ Vessels and electroporate (program: EH100).\nTransfer cells to pre-warmed flasks containing the appropriate volume of RPMI-SC- medium (RMPI medium, 10% FCS, SC- supplement) (see materials and equipment[href=https://www.wicell.org#materials-and-equipment]) to reach a concentration of 1 × 106 cells/mL.\nNote: To reduce the time cells spend in P3 buffer, perform electroporation only with two samples at a time.\nAddition of antibiotics.\n12–16 h after electroporation, supplement RPMI-SC- medium with 5% antibiotic mix (see materials and equipment[href=https://www.wicell.org#materials-and-equipment]).\nIncubate cells for 3 days at 37°C, 5% CO2.\nValidation of transgenic TCR replacement by flow cytometry analysis.\nTake a small aliquot (∼ 100 μL) from the cell culture and perform antibody staining to determine endogenous TCR knockout (KO) and transgenic TCR knockin (KI).",
    "Make antibody mix containing CD3-BV421 (1:100), CD8-PE (1:600), hTCR-FITC (1:50), mTRBC-APC/Fire750 (1:50) in FACS buffer and incubate for 20 min on ice in the dark.\nAdd PI (1:100) and incubate for 1 additional min on ice in the dark.\nWash 2× with FACS buffer and filter through 112 μm polyamid sieve cloth.\nAcquire a minimum of 10,000 events at CytoFlex S Cell Analyzer.\nAnalyze data using FlowJo V10.\nFACS and feeder cell-based T cell expansion.\nOn ∼day 5 post CRISPR editing, perform antibody staining for the transgenic TCR and sort SARS-CoV-2-specific TCR engineered CD8+ T cells in 1 mL FCS in 15 mL tubes.\nFill up the tube with complete RPMI-HS medium (5% HS, 5% SC+) (see materials and equipment[href=https://www.wicell.org#materials-and-equipment]), centrifuge for 10 min at 480 × g at 20°C–22°C and take off supernatant.\nResuspend cells in complete RPMI-HS medium + 1 μg/mL PHA + 180 IU/mL IL-2 to reach a final concentration of 1 × 106 cells/mL.\nNote: If less than 200,000 cells are sorted, fill up to 200,000 cells with feeder cells. For this, use irradiated feeder cells (35 Gy–20 min) from an allogeneic donor. Expansion of low numbers of CD8+ T cells (< 200,000) with feeder cells has been shown to be very efficient. You can expect between 5 × 106 and 30 × 106 cells after three weeks of culture.\nAfter 7 days, remove 100 μL of medium and add fresh complete HS-RPMI medium + 1 μg/mL PHA + 180 IU IL-2/mL (final concentration).\nAdd fresh medium (supplemented with cytokines) as soon as medium turns yellow (every 1–3 days). An exemplary time schedule for the feeder cell expansion protocol of sorted primary CD8+ T cells can be found in Table 1[href=https://www.wicell.org#tbl1].",
    "Note: When adding new medium less than 2 days apart, e.g., day 7 to day 8, only add cytokines for the added medium to avoid overstimulation.\nOn day 15 of expansion (see Table 1[href=https://www.wicell.org#tbl1]), add 1 mL of complete RPMI medium + 3× IL-2 to 2 mL of culture medium and cells in a 6-WP. Addition of PHA from this point onward is not necessary anymore. Leave cells for ∼ 7 days without PHA addition (+ addition of IL-2 every 2–3 days) before performing experiments.\nNote: Usually the medium will turn yellow for every split as cells now expand exponentially. You can double the volume and move to the respective bigger plate at every step. Only transfer cells to a bigger plate when the medium is yellow and proliferation clusters are visible or when cells cover the entire well. Cell proliferation can vary from donor to donor. If cells do not show metabolic activity on day seven, add another 100,000 irradiated feeder cells from the same donor.\nAlternatives: If enough CD8+ T cells have already been sorted for planned experiments, there is no need for further expansion.\ntable:files/protocols_protocol_2032_12.csv\nReplicating virus killing assay using the Incucyte instrument\nThis protocol describes a near-physiological SARS-CoV-2 killing assay in which competent A549 target cells are infected with SARS-CoV-2-GFP virus and co-cultured with SARS-CoV-2-specific, TCR-engineered CD8+ T cells. A schematic of the workflow can be found in Figure 4[href=https://www.wicell.org#fig4].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2032-Fig4.jpg\nFigure 4. Workflow of Incucyte killing assay",
    "Competent A549 cells are seeded in 96-WP. After 24 h, SARS-CoV-2-GFP virus is added to the cells and infected plates are monitored by the Incucyte S3 live-cell imaging platform. 24 h post infection, SARS-CoV-2-specific, TCR-engineered CD8+ T cells are added and Incucyte S3 acquisition is continued for additional 48 h. Related to steps 13) - 23) of 'replicating virus killing assay using the Incucyte instrument[href=https://www.wicell.org#sec3.2]'.\nSeeding of competent A549 cells\nTiming: 30 min - 1 h (hands on) + 24 h (additional cell culture)\nSeed 5 × 103 competent A549 cells in complete RPMI medium in 100 μL per well of a 96-WP. The outermost wells should only contain PBS to prevent evaporation.\nNote: Use ∼ 70% confluent competent A549 cells. A549 cells are normally cultivated in complete DMEM medium. Switch medium to complete RPMI medium two passages before the killing assay as T cells, which are cultured in complete RPMI medium, are more sensitive to culture conditions than tumor cells.\nInfection of competent A549 cells with SARS-CoV-2-GFP virus\nTiming: 30 min - 1 h (hands on) + 24 h (additional cell culture)\n24 h post seeding, add SARS-CoV-2-GFP virus (MOI 5) in 100 μL of complete RPMI medium.\nPlace the plate in the Incucyte S3 instrument (37°C, 5% CO2) where real-time images of mock (RFP channel) and infected (GFP and RFP channel) cells are captured every 3 h for 72 h.\nNote: The right controls for this experiment are target cells alone and target cells on which only TCR-engineered T cells are added without virus infection.\nPipet effector to target (E:T) dilutions with SARS-CoV-2-specific T cells\nTiming: 1–2 h\nResuspend TCR-engineered T cells at a concentration of 3 × 106 cells/mL in complete RPMI medium + 100 IU/mL IL-2 (2× the final working concentration of 50 IU/mL).",
    "Prepare and pipet E:T dilution series by always diluting the respective higher dilution in complete RPMI medium + 100 IU/mL IL-2. Perform all E:T titration steps in triplicates. Examples are shown in Tables 2[href=https://www.wicell.org#tbl2] and 3[href=https://www.wicell.org#tbl3].\ntable:files/protocols_protocol_2032_13.csv\nSuggested range of titration steps for competent A549 target cells and SARS-CoV-2-specific CD8+ T effector cells from [E:T] 30:1 to 1:1.\ntable:files/protocols_protocol_2032_14.csv\nExemplary pipetting steps for serial dilution starting at 1.5 × 106 cells for [E:T] 30:1.\nAddition of SARS-CoV-2-specific T cells\nTiming: 1–2 h\n24 h post-infection, take the plate out of the Incucyte S3 instrument.\nRemove 100 μL of medium with a multichannel pipette.\nAdd 100 μL of respective E:T SARS-CoV-2-specific, TCR-engineered CD8+ T cells.\nPlace the plate back in the Incucyte S3 instrument and continue acquisition for additional 48 h.\nAt the endpoint (72 h post infection), remove supernatant and T cells by washing wells once with PBS.\nAdd fresh medium before final picture acquisition.\nTransgenic antigen killing assay using the xCELLigence instrument\nThis protocol describes how competent A549 cells, transduced to express the SARS-CoV-2 protein Nsp2 linked to GFP via a T2A tag, can be used for natural presentation of the HLA-A∗03:01 epitope of interest and subsequent killing assays with SARS-CoV-2-specific, TCR-engineered CD8+ T cells. A schematic of the workflow can be found in Figure 5[href=https://www.wicell.org#fig5].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2032-Fig5.jpg\nFigure 5. Workflow of xCELLigence killing assay\nCompetent A549-Nsp2 cells are seeded on an E-Plate VIEW 96-WP and impedance measurement as well as image acquisition is monitored by the xCELLigence eSight instrument. 24 h post seeding, SARS-CoV-2-specific, TCR-engineered CD8+ T cells are added and acquisition is continued for additional 48 h. Related to steps 24) - 32) of 'transgenic antigen killing assay using the xCELLigence instrument[href=https://www.wicell.org#sec3.3]'.\nBackground measurement of xCELLigence plate",
    "Perform background measurement as described in 15) –17) of section “before you begin[href=https://www.wicell.org#before-you-begin].”\nSeeding of competent A549-Nsp2 cells\nTiming: 30 min - 1 h (hands on) + 24 h (additional cell culture)\nPerform seeding of competent A549-Nsp2 cells similar to 18) – 23) of section “before you begin[href=https://www.wicell.org#before-you-begin].”\nNote: Competent A549 cells serve as non-epitope presenting control cell line for competent A549-Nsp2 cells. As an additional control condition, it is possible to use competent A549 cells that were transduced with a non-relevant protein like the Gaussia luciferase protein (competent A549-Gaussia cells).\nPipet E:T dilution series of SARS-CoV-2-specific T cells\nTiming: 1–2 h\nResuspend SARS-CoV-2-specific, TCR-engineered CD8+ T cells at a concentration of 3 × 106/mL in complete RPMI medium + 100 IU/mL IL-2 (2× the final working concentration of 50 IU/mL).\nPrepare and pipet E:T dilution series by always diluting the respective higher dilution in complete RPMI medium + 100 IU/mL IL-2. Perform all E:T titration steps in triplicates. Examples are shown in Tables 4[href=https://www.wicell.org#tbl4] and 5[href=https://www.wicell.org#tbl5].\ntable:files/protocols_protocol_2032_15.csv\nSuggested range of titration steps for competent A549-Nsp2 target cells and SARS-CoV-2-specific CD8+ T effector cells from [E:T] 30:1 to 1:1.\ntable:files/protocols_protocol_2032_16.csv\nExemplary pipetting steps for serial dilution starting at 1.5 × 106 cells for [E:T] 30:1.\nAddition of SARS-CoV-2-specific T cells\nTiming: 1–2 h\n24 h post-seeding, ‘Pause’ the experiment and take the E-Plate VIEW out of the xCELLigence eSight instrument.\nRemove 100 μL of medium with a multichannel pipette.\nAdd 100 μL of SARS-CoV-2-specific, TCR-engineered CD8+ T cells according to the respective E:T ratio.\nInclude medium only condition as negative control and 2% Triton X as positive control for each cell line.\nPlace the E-Plate VIEW back in the xCELLigence eSight instrument and ‘Start/Continue’ acquisition for additional 48 h.",
    "Note: Addition of large amounts of effector cells dampens target cell growth. To ensure that reduction in target cell growth is specific, it is recommended to include the following controls:\nMedium only control - As this shows the growth of target cells without dampening or unspecific cytotoxic effects following the pure addition of T cells.\nNon-epitope-presenting target cells – Target cells that do not present the respective epitope recognized by the TCR-engineered T cells, e.g., competent A549 cells that do not have the Nsp2 protein transduced.\nNon-epitope-specific effector cells - TCR-engineered T cells that are expected to not show target-specific recognition of the epitope under investigation, e.g., TCR-engineered T cells that are specific for another SARS-CoV-2 epitope or an unrelated viral or tumor-specific epitope.\nAlternatives: As an alternative assay, competent A549 cells can be peptide-pulsed with the epitope of interest before seeding on xCELLigence plates. For this, target cells are pulsed at a concentration of 3 × 106/mL for 2 h with 10-5 M peptide at 20°C–22°C on a roller. Peptide-pulsed cells are washed 3× with full RPMI medium and respective amounts of target cells are plated on the E-Plate VIEW. As control for this assay, unpulsed competent A549 cells with the same E:T titration steps can be used. Be aware that epitope presentation is not always reflective to natural antigen processing."
  ],
  "subjectAreas": [
    "Immunology",
    "Crispr",
    "Cell Culture",
    "Cell Biology",
    "Cell-Based Assays"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}