{
  "id": 6682,
  "origin_website": "Bio",
  "title": "Proximity Ligation Assay for the Investigation of the Intramolecular Interaction of ELMO1",
  "procedures": [
    "Generation of mammalian expression construct of ELMO11-315 Perform site-directed mutagenesis to introduce a stop codon after ELMO1 residue 315 in pcDNA3-N-Myc-Elmo1 by using QuikChange II Site-Directed Mutagenesis Kit (Figure 2). The mutagenesis primers used are listed in Table 1.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20191203/20191203004109_0023.jpgFigure 2. Schematic diagram of ELMO1 fragment constructs. Site-directed mutagenesis is performed to create a stop codon after ELMO1 residue 315 in pcDNA3-N-Myc-Elmo1 to generate ELMO11-315 fragment. cDNA of ELMO1315-727 is amplified from pcDNA3-N-Myc-Elmo1 by using PCR and the product is inserted to pCMV-Tag2B for the expression of N-terminal FLAG tagged protein. The asterisk indicates the mutation site. Numbers denote the amino acid residue number in ELMO1.Table 1. Primers used for generating ELMO1 fragment constructs. Primers 1 and 2 are used for the site-directed mutagenesis to introduce a stop codon to the pcDNA3-N-Myc-Elmo1. Primers 3 and 4 are used for the amplification of ELMO1315-727 fragment by using pcDNA3-N-Myc-Elmo1 as a template.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20191203/20191203004129_1360.pngTransform the mutagenesis product to DH5α competent E. coli cells by heat shock for 1 min at 42 °C.Plate the transformants on LB agar plates with 100 μg/ml ampicillin. Incubate the plates overnight in 37 °C incubator.Inoculate isolated colonies in 5 ml LB with 100 μg/ml ampicillin and grow overnight at 37 °C.Isolate the plasmid DNA by using TIANprep Mini Plasmid Kit.Perform DNA sequencing to confirm the introduction of the stop codon.Generation of mammalian expression construct of FLAG-ELMO1315-727 Perform polymerase chain reaction (PCR) to obtain cDNA encoded for ELMO1315-727 fragment by using Phusion High-Fidelity PCR Kit with pcDNA3-N-Myc-Elmo1 as a template. Primers used are listed in Table 1.Resolve the PCR product by a 1% agarose gel with 0.2 μg/ml ethidium bromide in 1x TAE buffer. Visualize the PCR product by using a UV transilluminator and excise the PCR product (~1.2 kb) with a razor blade after electrophoresis.",
    "Purify the PCR product from gel by using MEGAquick-spinTM Plus Total Fragment DNA Purification Kit.Digest the purified ELMO1315-727 PCR product and pCMV-Tag2B, a vector with an N-terminal FLAG tag, with BamHI and XhoI for 2 h in a 37 °C water bath.Purify the digestion products by using MEGAquick-spinTM Plus Total Fragment DNA Purification Kit.Ligate the digested ELMO1315-727 fragment and linearized pCMV-Tag2B vector with T4 DNA ligase overnight in a 16 °C water bath.Transform the ligation product as stated in Steps A2-A6. 50 μg/ml Kanamycin should be used for selection.Perform DNA sequencing to confirm the successful insertion of the ELMO1315-727 encoding cDNA into pCMV-Tag2B.Cell preparation and transfectionCoat 18-mm cover glasses with 5 μg/ml poly-D-lysine solution in 12-well cell culture plate overnight in a 37 °C incubator.Note: Sterilize the cover glass before use. Wash the cover glasses once with distilled water.Seed HEK293 cells on the pre-coated 18-mm cover glasses at 0.4 x 105 cells in 1 ml DMEM medium supplemented with 10% FBS.After 24 h, transfect the cells with mammalian expression constructs of myc-ELMO11-315 and FLAG-ELMO1315-727 together with either empty vector (EV), FE65 or FE65 K48A/R51A (FE65m, an ELMO1 binding defective FE65 mutant) using X-tremeGENETM 9 DNA transfection reagent in Opti-MEM reduced serum medium according to the manufacturer’s instruction (Table 2).Table 2 Transfection combinations for studying the effect of FE65 in ELMO1 intramolecular interaction. HEK293 cells are co-transfected with either EV, FE65 or FE65m together with ELMO11-315 and ELMO1315-727 constructs in 1:1:1 ratio. All transfections receive the same amount of DNA. “+” denotes the presence of the plasmid while “-” denotes the absence of the plasmid.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20191203/20191203004216_4993.",
    "pngCell fixing and proximity ligation assayNote: Wash Buffer A, Wash Buffer B, PLA probe anti-goat MINUS, PLA probe anti-mouse PLUS, Antibody Diluent, Ligase, 5x Ligation Buffer, Polymerase, 5x Amplification Red and Duolink In Situ Mounting Media with DAPI are provided within Duolink® In Situ Red Starter Kit Mouse/Goat. Please see Figure 3 for the workflow of PLA.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20191203/20191203004245_6320.jpgFigure 3. Timeline illustrates the workflow of PLA of ELMO1 fragments using Duolink® In Situ Red Starter Kit Mouse/GoatAfter 24 h transfection, wash the cells once with PBS and fix the cells with 4% paraformaldehyde for 10 min at room temperature.Wash the fixed cells three times with PBS.Permeabilize the cells with 0.1% Triton X-100/PBS for 15 min at room temperature.Block the cells with 5% FBS/PBS for 30 min at room temperature.Dilute the goat anti-ELMO1 (recognizes myc-ELMO11-315) (1:100), mouse anti-FLAG (recognizes FLAG-ELMO1315-727) (1:1000) and rabbit anti-β-tubulin (1:200) antibodies in 5% FBS/PBS and stain the cells with 80 μl of diluted antibody mix for 1 h at room temperature.Note: The concentrations of primary antibodies used are critical for obtaining high-quality PLA images and should be optimized.  Wash the cells five times with PBS.Dilute the Alexa Fluor 488 conjugated Donkey anti-rabbit IgG (1:1000) antibody in 5% FBS/PBS and stain the cells for 1 h in the dark at room temperature.Wash the cells five times with PBS.Wash the cells twice with Wash Buffer A for 5 min in the dark at room temperature.Add 80 μl PLA probe reaction mix to each cover glass and incubate in a humidified 37 °C incubator for 1 h.",
    "Note: For each reaction, mix 16 μl of PLA probe anti-goat MINUS (Donkey anti-goat secondary antibody conjugated to oligonucleotide MINUS) with 16 μl of PLA probe anti-mouse PLUS (Donkey anti-mouse secondary antibody conjugated to oligonucleotide PLUS) in 48 μl of Antibody Diluent and incubate for 20 min at room temperature before use. Wash the cover glasses twice with Wash Buffer A for 5 min in the dark at room temperature.Add 80 μl Ligation reaction mix to each cover glass and incubate in a humidified 37 °C incubator for 30 min.Note: For each reaction, add 2 μl Ligase to 78 μl 1x Ligation buffer. Wash the cover glasses twice with Wash Buffer A for 5 min in the dark at room temperature.Add 80 μl Amplification reaction mix to each cover glass and incubate in humidified 37 °C incubator for 100 min.Note: For each reaction, add 1 μl Polymerase to 79 μl 1x Amplification Red. Wash the cover glasses twice with Wash Buffer B for 10 min in the dark at room temperature.Wash the cover glasses once with 0.01x Wash Buffer B for 1 min in the dark at room temperature.Mount the cover glasses on microscope slides with a minimal amount of Duolink In Situ Mounting Media with DAPI.Seal the edge of the mounted cover glasses with clear nail polish.Capture the cell images with a 60x water immersion lens using a Nikon fluorescent microscope. Note: Store the slides in the dark at 4 °C if necessary."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}