{
  "id": 10132,
  "origin_website": "Jove",
  "title": "A Nonsequencing Approach for the Rapid Detection of RNA Editing",
  "procedures": [
    "1. Optimization of the target fragment\nNOTE: Four edited genes were used in the development of this protocol, including two nuclear genes (AT2G16586 and AT5G02670) from A. thaliana, and the genes encoding blue fluorescent protein (BFP) and enhanced green fluorescent protein (EGFP) expressed in HEK293 cells.\nTo identify gene fragments with different melting profiles, representing edited versus nonedited regions, generate predicted melting curves using the uMelt HETS web-based tool, an extension of the original uMelt software13.\n\tNOTE: This tool predicts the shapes of melting curves for heteroduplex and homoduplex products.\nFor each target gene, design three pairs of gene fragments (300-324 bp in length). Each pair comprises of a fragment with an edited site and a corresponding wild-type fragment with a nonedited site, located at either the 5'-terminal end, middle position, or 3'-terminal end.\nSelect the nonedited/edited pair that showed the maximum difference between the melting regions on the helicity axis for further analysis. For µTGGE analysis, synthesize the selected gene fragment by PCR amplification, as described in section 2 below.\nDesign the forward and reverse primers using DNADynamo software (https://www.bluetractorsoftware.com/DynamoDemo.htm) and verify using the NCBI Primer-BLAST tool.\nDilute the primers in TE buffer (10 mM Tris-HCl containing 1 mM EDTA·Na2) and store them at a concentration of 100 pmol/µL. Prior to use, dilute each primer set to a concentration of 10 pmol/µL using distilled water.\n2. RNA extraction and RT-PCR amplification of the target fragment\nRNA extraction\n\t\nExtract total RNA from the source of edited and nonedited genes using standard methods, such as TRIzol extraction14 or commercially available kits.\nPerform the synthesis of the corresponding cDNA using a standard RT-PCR protocol as described in step 2.2.\nReverse transcription",
    "Add 1 µL of oligo(dT) primer, 1 µL of 10 mM dNTP mix, 10 µL of total RNA, and 10 µL of sterile distilled water to a nuclease-free microcentrifuge tube.\nHeat the mixture at 65 °C for 5 min and then incubate on ice for at least 1 min.\nCollect the contents of the tube by centrifugation at maximum speed (12,000 x g) for 2-3 s, and add 4 µL of 5x ReverTra Ace buffer, 1 µL of 0.1 M DTT, and 1 µL of M-MLV (Moloney Murine Leukemia Virus) reverse transcriptase (200 U/µL, Table of Materials).\nMix by pipetting up and down gently. If using random primers, incubate the tube at 25 °C for 5 min.\nIncubate the tube at 55 °C for 60 min and then inactivate the reaction by heating at 70 °C for 15 min, in a digital dry bath/block heater.\nMeasure the concentration of cDNA using a spectrophotometer and store it at -25 °C.\nPCR amplification and confirmatory sequencing of products\nAdd the following reagents to a nuclease-free microcentrifuge tube: 4 µL of 5x Taq Polymerase Buffer, 2 µL of 2 mM dNTP mix, 2 µL of 25 mM MgCl2, 1.6 µL of the primer set (forward and reverse; each 10 mM), 2 µL of cDNA template, 0.1 µL of Taq polymerase (2.5 U/µL), and 8.3 µL of sterile distilled water (final volume, 20 µL).\nPerform PCR with the following cycling conditions: initial denaturation at 95 °C for 2 min; 35 cycles of denaturation at 95 °C for 2 min, annealing at a suitable temperature (depending on the specific primer set used) for 30 s, and extension at 72 °C for 2 min; and then a ﬁnal extension at 72 °C for 7 min.",
    "To purify the PCR products, add 2 U of Exonuclease I and 0.5 U of shrimp alkaline phosphatase (ExoSAP). Incubate the tube in a thermal cycler at 37 °C for 1 h, followed by 80 °C for 15 min, and then maintain at 4 °C until the next step.\nFor confirmatory sequencing, add 11.5 µL of sterile distilled water, 2.5 µL of forward or reverse primer, and 1 µL of PCR products (with ExoSAP) to a new microcentrifuge tube.\n\t\t​NOTE: Use DNA sequencing services (e.g., Eurofins Genomics) for sequencing analysis.\nTo validate the specificity of the PCR products, perform sequencing with both forward and reverse primers. The primer pairs used in the representative analysis are given in Table 1.\nDilute the purified PCR products to a concentration of 200 ng/µL with deionized water. Next, mix 6 µL of the purified product with 3 µL of 6x gel loading dye in a 250 µL tube and raise the total volume to 12 µL with sterile water. Store the PCR product (at -25 °C) until ready to proceed with µTGGE as described below.\n3. µTGGE analysis\nNOTE: The µTGGE analysis is performed using a miniaturized and economic system. An overview of the complete system, including the gel cassettes, gel cassette holder, horizontal gel electrophoresis platform, power supply, and gel imaging system, is shown in Figure 2.\nAssembly of the gel cassettes\n\t\nThe gel cassette used for µTGGE analysis is shown in Figure 2A. The design consists of three 1 inch gel plates: a bottom gel plate, a top gel plate, and a lane-former plate. Sandwich the top gel plate between the other two plates and assemble in the gel cassette holder for gel polymerization.\nPolyacrylamide gel preparation",
    "Add 7.2 g of urea to a 50 mL tube and dissolve in 10 mL of sterile water. Heat the sample in a microwave for 20-30 s and then bring it to room temperature (RT).\nAdd 3 mL of 5x Tris/borate/EDTA (TBE) buffer (Table of Materials), 2.25 mL of 40% (w/v) acrylamide/bis (19:1), 75 µL of 10x ammonium persulfate, and 15 µL of tetramethylethylenediamine to the solution.\nImmediately pour the gel solution into the gel cassette holder slowly, avoiding the formation of air bubbles.\nGeneration of melting profiles using the µTGGE unit\n\t\nUse the miniaturized, economical version of the µTGGE apparatus shown in Figure 2 with a temperature gradient (25-65 °C) set perpendicular to the direction of DNA migration.\nSoak the upper and lower electrophoresis buffer pads (0.5 cm x 2.5 cm) in 2 mL of 1x TBE buffer.\nPlace the gel cassette in the horizontal electrophoresis chamber unit and position the upper and lower buffer pads accordingly, as shown in Figure 2.\nNext, load 10 µL of the PCR product into the middle (longer) well and 1 µL of the PCR product into each side well.\nAfter a 1 min wait, connect the power unit and supply 100 V for 12 min at a linear temperature gradient from 25-65 °C.\nAfter the run has completed, take out the cassette and remove the upper glass cover.\nPour 300 µL of 10x SYBR Gold stain onto the gel. Visualize the melting profiles using the blue LED flashlight installed in the palm-sized electrophoretic device.\n\t\tNOTE: A soft file of the gel image should be saved for Pattern Similarity Score (PaSS) calculation.\nRepeat every electrophoretic experiment 3x to confirm the reproducibility of the data.\n4. PaSS calculations\nNOTE: The calculations are performed using µTGGE Analyzer software.\nDownload and open the software.",
    "Open the JPEG file containing the gel image. Note that the software will only accept JPEG format files.\nClick on the Frame button and select the appropriate area (frame) of the gel image.\nClick on the Coordinate Correction button and add two references points, as shown in Figure 1B.\nClick on the Addition of Feature Points button and add sample points as shown in Figure 1B. Then save the processed gel image data in µTGGE (*.tgg) format.\nClick on the Sample button and select the Search for Simple Points option to compare two or more images.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}