{
  "id": 13505,
  "origin_website": "Jove",
  "title": "In Vitro Differentiation of Human Mesenchymal Stem Cells into Functional Cardiomyocyte-like Cells",
  "procedures": [
    "All studies involving animals were conducted and reported according to ARRIVE guidelines48. All studies were performed with institutional research ethics board approval (REB number 454-2011, Sunnybrook Research Institute; REB 29889, University of Toronto, Toronto, Canada). All animal procedures were approved by the Animal Care Committee of the University Health Network (Toronto, Canada), and all animals received humane care in compliance with the Guide for the Care and Use of Laboratory Animals, 8th edition (National Institutes of Health 2011).\n1. Tissue Culture\nCulture FTM HUCPVCs, term HUCPVCs (previously established, n ≥ 3 independent lines for each)42 and commercially available BMSCs in alpha-minimum essential medium (MEM) supplemented with 10% fetal bovine serum (FBS) and a 1% penicillin/streptomycin (P/S) cocktail. Culture rat primary cardiomyocytes and MSC-cardiomyocyte co-cultures in Dulbecco's Modified Eagle Medium: Nutrient Mixture F-12 (DMEM-F12) containing 10% FBS and 1% P/S.\n\tNOTE: Sterilize the medium using a 0.2-µm filter. Store prepared medium solutions at 4 °C for up to 3 weeks.\nMaintain cell cultures in humidified incubators (95% relative humidity, 37 °C, and 5% CO2) and passage at 70-80% confluency, determined by phase-contrast microscopy. Use appropriate volumes of medium for the size of tissue culture dish used (e.g., 10 mL in a 10-cm dish and 2 mL per well in 6-well tissue culture plate). Use these culture conditions for the duration of the protocol.\nDissociate MSC monolayers for passaging or MSC-cardiomyocyte co-culture establishment using a dissociation enzyme solution (2 mL/well in a 6-well plate) and incubate at 37 °C for 4 min.\nTransfer the dissociated cells to a 15-mL tube and centrifuge at 400 x g for 5 min.",
    "Aspirate the supernatant without disrupting the cell pellet and resuspend the cells in 1 mL of a culture medium appropriate for counting using an automated cell counter. Seed the cells as described in the following protocol sections.\n2. Preparation of Primary Rat Cardiomyocyte-MSC Co-cultures\nObtain heart tissue for primary cardiomyocyte isolation.\n\t\nEuthanize rat pups (5-6 days postnatal) using CO2 asphyxiation. Set CO2 chambers to 20% gas replacement (flow rate = 0.2 x chamber volume per min). Confirm exitus by the absence of the pinch reflex.\nRemove the atria with the connecting major blood vessels using sterilized instruments (i.e., forceps and curved scissors)41. Transfer the hearts to 50-mL tubes containing sterile PBS with1% P/S (PBS-P/S) on ice.\nCut the ventriculi in half and let the blood wash out in a 10-cm dish with 10 mL of PBS-P/S on ice. Cut the ventricular walls into small pieces (diameter = 2-3 mm) using curved scissors.\nTransfer the heart pieces from 10-12 animals to a 50-mL tube using a serological pipette and let them settle.\nRemove as much PBS-P/S as possible without removing any heart pieces. Add 10 mL of new PBS-P/S.\nDigest the heart tissue to isolate the cardiomyocytes.\n\t\nAllow the heart pieces to settle. Replace the PBS-P/S with 10 mL of 0.15% trypsin in PBS and shake at 37 °C for 10 min.\nDiscard the supernatant. Repeat the digestion described in step 2.2.1 three more times, but decant the supernatants into 50-mL collection tubes containing 10 mL of 100% FBS.\nCentrifuge the cells (400 x g, 5 min) and aspirate the supernatant. Resuspend the cells in DMEM-F12 containing 10% FBS and 1% P/S and seed onto a 6-well plate (1 x 105 cells/cm2, 2 mL of medium per well).",
    "After 1 h, transfer the medium containing non-attached cells to a 50-mL tube and discard the attached cells. Count the cells in suspension and re-plate them into new 6-well plates (1 x 105 cells/cm2, 2 mL of DMEM-F12 containing 10% FBS and 1% P/S per well).\nInhibit cell proliferation with bromodeoxyuridine (BrdU).\n\tCaution: BrdU is a strong teratogen and suspected mutagen. Please ensure proper training is provided and refer to the safety data sheet before use.\n\t\nOnce cells have attached, replace the medium in the 6-well plate with DMEM-F12 containing 10% FBS, 1% P/S (2 mL of medium per well), and 5 µM BrdU. Incubate for 16 h (37 °C, 5% CO2).\nRemove the BrdU-containing medium and replace with DMEM-F12 containing 10% FBS and 1% P/S (2 mL of medium per well).\nPrepare pre-stained MSCs.\n\t\nOnce MSC cultures are at 70-80% confluency in 10-cm dishes, remove the culture medium and add 3 mL of cell dissociation solution. Incubate the dish at 37 °C and 5% CO2 for 5 min.\nTransfer the dissociated cells to a 15-mL tube and centrifuge at 400 x g for 5 min.\nAspirate the supernatant without disrupting the cell pellet and resuspend the cells in 1 mL of DMEM-F12 containing 10% FBS and 1% P/S for counting using an automated cell counter.\nDilute the cells to a concentration of 1 x 106 MSC/mL of DMEM-F12 containing 10% FBS and 1% P/S.\nIncubate the MSCs with viable, non-transferable fluorescent dye (5 µM, 30 min, 37 °C, 5% CO2) in 1.5-mL centrifuge tubes for 1 h.\nCentrifuge the tubes at 400 x g for 5 min. Aspirate the supernatant and resuspend the pellet in DMEM-F12 containing 10% FBS and 1% P/S for a cell concentration of 1 x 106 MSC/mL. Repeat this a total of 3 times.",
    "Transfer the MSCs onto cardiomyocytes (step 2.5.2) at a concentration of 10 x 104 cells per well of the 6-well plate.\n3. Preparation of Aggregate Co-cultures\nPrepare a single-cell suspension of MSCs (2 x 104 cells/mL of medium, passage # ≤ 6) in alpha-MEM supplemented with 10% FBS and 1% P/S (see step 2.6).\n\tNOTE: Refer to section 1 of the protocol for the passaging of cells. Alternatively, pre-stain MSCs as per step 2.6.\nInitiate aggregate formation by placing 25-µL drops of cell suspension (500 cells) on the inner surface of the lids of 10-cm tissue culture dishes (up to 50 drops per lid). Place the lids on their bottom counterparts containing PBS-P/S. Incubate at 37 °C and 5% CO2.\n\tNOTE: Place 5-7 mL of PBS-P/S into the culture dish below the hanging drops to avoid drop evaporation.\nObserve aggregate formation in the drops after 3 days using a stereomicroscope. If over 40 out of 50 drops contain formed aggregates, collect the drops from the lids using a 1-mL micropipette and transfer the aggregates directly onto primary rat cardiomyocyte monolayers (prepared in steps 2.1-2.7; 10 drops/well). Avoid vigorous pipetting to preserve aggregate integrity.\nKeep aggregate co-cultures in the incubators for up to 2 weeks, changing the full volume of medium (2 mL of DMEM-F12 containing 10% FBS and 1% P/S per well) every 72 h.\n\t\nDaily observe aggregates attaching on feeder cell layers using bright-field microscopy. Record contracting aggregates when observed.\nPrepare aggregates for analysis.\n\t\nRemove the medium and add 2 mL of PBS per well of a 6-well tissue culture dish. Remove the PBS and add 2 mL of dissociation solution per well. Incubate for 3 min at 37 °C and 5% CO2.",
    "Centrifuge at 400 x g for 5 min to obtain a cell pellet. Resuspend in medium, as specified for the applications described in the subsequent steps (see steps 4.1, 5.1, and 6.1) and pass through a 70-µm cell strainer.\n4. Flow Cytometry (FC) and Fluorescence-activated Cell Sorting (FACS)\nIncubate cell suspensions (1 x 105 cells in 200 µL of PBS containing 3% FBS) with fluorophore-conjugated (FITC or APC) primary antibodies (i.e., CD49f, Cx43, TRA-1-85, HLA-A, HLA-G, and SIRPA for FC or TRA-1-85 for FACS; 1:40) at 4 °C for 30 min, protected from light.\nCentrifuge (400 x g, 5 min) and resuspend the cells in 1 mL of PBS with 3% FBS for FC or PBS with 0.5% FBS for FACS.\n\tNOTE: The FC of MSCs was optimized by Hong et al.41.\nMaintain the cells at 4 °C in the dark until they are ready to be analyzed by FC (at least 1 x 104 events) or FACS. Sort the cells as described41. Re-plate TRA-1-85 high-positive sorted cells in 6-well plates (1 x 104 cells/well, 2 mL of DMEM-F12 containing 10% FBS and 1% P/S) within 1 h.\n\tNOTE: For the gating strategy of the TRA-1-85 human cell surface antigen, see the Supplementary Figure.\n5. Immunocytochemistry (ICC) and Microscopy\nRe-plate the cell suspensions obtained from the co-cultures (step 3.5.2) or FACS (section 4) onto chamber slides (1 x 104 cells/well, 2 mL of DMEM-F12 containing 10% FBS and 1% P/S per well). Let the cells attach overnight in a tissue culture incubator (see section 1 for the conditions).\nFix the cells using 3 mL of 4% paraformaldehyde (PFA) in PBS for 15 min at room temperature. Wash 3 times with 3 mL of PBS containing 1% bovine serum albumin (BSA; PBS-BSA) for 5 min per wash.",
    "Caution: Wear appropriate personal protective equipment when handling PFA.\nPermeabilize the cells in 3 mL of PBS-BSA with 0.1% Triton X-100. Incubate at room temperature for 10 min for intracellular antigens (i.e., alpha sarcomeric actinin (aSarc) and Cx43), or 25 min for intra-nuclear antigens (i.e., Mef2c and human nuclear antigen (HuNu)). Wash 3 times with 3 mL of PBS-BSA for 5 min per wash.\nBlock the samples against non-specific antibody reactions with 3 mL of PBS containing 5% normal goat serum (NGS) and 1% BSA for 15 min at room temperature. Wash 3 times with 3 mL of PBS-BSA for 5 min per wash.\nIncubate the cells in the primary antibodies (i.e., Mef2c, aSarc, Cx43, and HuNu) diluted 1:200 in 3 mL of PBS-BSA at 4 °C overnight.\nWash 3 times with 3 mL of PBS-BSA for 5 min per wash and incubate with secondary antibodies for 30 min at room temperature. Wash 3 times with 3 mL of PBS-BSA for 5 min per wash.\nStore the stained specimens in 3 mL of of mounting medium.\nAcquire images using a fluorescence microscope. Use a 10X objective (NA = 0.3), and a 20X objective (NA = 0.45) for lower-magnification imaging. Use fluorescence filter cubes and wavelengths for GFP (ex = 470/22 nm, em = 525/50 nm) and RFP (ex = 531/40 nm, em = 593/40 nm) for the secondary antibodies used (see the Materials and Equipment Table).\nQuantify images using imaging software (see the Materials and Equipment Table for the recommended software). Normalize the fluorescence intensity readings to the secondary control acquisitions.\n6. RNA Isolation and Quantitative RT-PCR",
    "Prepare RNA samples from undifferentiated MSC cultures or MSCs sorted from co-cultures using column-based RNA isolation, according to the manufacturer's instructions. Prepare 1 x 104 to 1 x 106 cells in 0.7 mL of cell lysis buffer (provided with the RNA isolation kit) per sample.\nPrepare cDNA from up to 2 µg of RNA per 100-µL RT reaction.\nPerform qPCR using 10 ng of cDNA per reaction (40 cycles, 60 °C annealing/extending temperature).\n\t\nUse primers for human MY6H and cTnT in a 500-nM concentration and 1-100 ng of cDNA per reaction (see the Materials and Equipment Table). Use GAPDH, ACTB, and HPRT as internal housekeeping normalizers. Use commercially available human-induced pluripotent stem cell-derived cardiomyocytes as a positive control.\n\t\tNOTE: Express the fold-change of expression compared to undifferentiated MSC-derived cDNA samples.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}