{
  "id": 10050,
  "origin_website": "Jove",
  "title": "Inducing Post-Traumatic Epilepsy in a Mouse Model of Repetitive Diffuse Traumatic Brain Injury",
  "procedures": [
    "All animal procedures described in this protocol were performed in accordance with the Institutional Animal Care and Use Committee (IACUC) of Virginia Tech and in compliance with the National Institutes of Health's 'Guide for the Care and Use of Laboratory Animals'.\n1. Animal handling protocol\nNOTE: This protocol is intended to habituate animals ordered from a vendor to the facility after arrival and to condition them to being handled by the experimenter. This improves animal well-being by reducing stress and anxiety and simplifies certain procedures that require handling animals, including inducing the TBI, post-operative monitoring, and connecting the animal to the acquisition system.\nWhen many animals are received from the vendor, ear-tag and randomly assign them to an experimental group (TBI) or control group (sham surgery) while combining them in cages of 2−5 animals. House TBI animals separately from sham animals because sham mice occasionally act aggressively toward mice that underwent TBI.\nHandling day 1 (24−48 h after ear-tagging): Prepare a chart for logging animal ear tags, date of birth, dates of handling, animal weight on the handling days, duration of the handling, and a section for comments and observations.\nGently cup the animal using both hands. Do not grab the animal by the tail as it induces defense mechanisms and a stress response.\nCheck and record the ear tag of the animal.\nPlace the animal in the container on the weight scale and record the weight.\nGently cup the animal with both hands again and handle it for 1 min, allowing it to move and explore within the hands. Perform this over a bench in the procedure room and be careful to not drop the animal on the floor.\nAfter 1 min of handling, place the animal back in its cage.",
    "Repeat steps 1.3−1.7 for the other animals in the cage.\nHandling day 2 (the following day): Repeat steps 1.2−1.5.\nGently cup the animal with both hands again and handle it for 2 min, allowing it to move and explore within the hands. Perform this over a bench in the procedure room and be careful to not drop the animal on the floor.\nAfter 2 min of handling, place the animal back in its cage.\nRepeat steps 1.10−1.11 for the other animals in the cage.\nHandling day 3 (the following day): Repeat steps 1.2−1.5.\nGently cup the animal with both hands again and handle it for 4 min, allowing it to move and explore within the hands. Perform this over a bench in the procedure room and be careful to not drop the animal on the floor.\nAfter 4 min of handling, place the animal back in its cage.\nRepeat steps 1.14−1.15 for the other animals in the cage.\nHandling day 4 (control day, 1 week from handling day 1): Repeat steps 1.2−1.5.\nGently cup the animal with both hands again and handle it for 4 min, allowing it to move and explore within the hands. Perform this over a bench in the procedure room and be careful to not drop the animal on the floor.\nAfter 4 min handling, place the animal back in its cage.\nRepeat steps 1.18-1.19 for the other animals in the cage.\n\tNOTE: The control handling day tests the retention of the calm behavior after a three-day handling protocol.\n2. Weight drop procedure\nPlace the mouse in an induction chamber. Set the flow of oxygen and vacuum both to 1 L/min and the level of isoflurane gas to 3%−5%. Anesthetize the mouse for 5 min.",
    "Remove the mouse from the induction chamber and place it on a foam pad. Test for the absence of a response to a toe or tail pinch.\nAdminister an analgesic (0.1 mg/kg buprenorphine) subcutaneously. If the EEG surgery is performed that same day, administer the buprenorphine subcutaneously in combination with the non-steroidal anti-inflammatory carprofen (5 mg/kg).\nAdminister the sodium lactate solution (3 µL per gram of the animal's weight) subcutaneously before or after the last impact. The sodium lactate solution can be mixed with the analgesics for quick administration in a single injection.\n\tNOTE: The sodium lactate solution contains a mixture of sodium chloride, potassium chloride, calcium chloride, and sodium lactate in water. This step helps to replace fluids and electrolytes, aiding recovery.\nPosition the head of the mouse under the weight drop tube (Figure 1A) and place a flat stainless steel disc (1.3 cm diameter, 1 mm thick, and 880 mg weight) in the center of the head, between the line of the eyes and ears.\n\tNOTE: This disc diffuses the impact across the surface of the skull (Figure 1B).\nRemove the pin in the weight drop tube to release the 100 g weight rod from a height of 50 cm. To induce the sham injury for the control mice, remove the weight rod from the tube to prevent accidental release of the pin and weight drop.\n\tNOTE: The animal's head must be positioned flat, so that the rod free-falls on the entire surface of the disc.\nPlace the unconscious animal on its back for recovery on a heating pad covered with a sterile polylined absorbent towel. The righting reflex recovery time (i.e., the time it takes the mouse to right itself from its back) can be measured as a readout for the time spent unconscious.",
    "When the animal regains consciousness, place it in a clean cage that has been warmed on a heating pad, with recovery gel and a few moistened chow pieces to recover for 45 min. Make sure there is sufficient litter so the cage does not get overheated. Overheating the animal can prove just as great an obstacle to recovery as allowing the mouse to become too cold.\nAfter 45 min, repeat steps 2.1−2.8 twice, omitting step 2.3 (i.e., administration of analgesics and anti-inflammatory drugs).\nAllow the animals to recover for 1−2 h if EEG electrode implantation surgery is performed on the same day.\n3. Surgical field preparation for implantation of EEG electrodes\nNOTE: Autoclave the surgical tools and screws prior to surgery. Clean the surgical gloves by spraying and rubbing with 70% ethanol before and after touching the animal, non-sterile materials, and in between handling the animals. Sterilize the surgical tools for 2−3 min in the bead sterilizer (see Table of Materials) between animals. Change the sterile drape before placing a new animal into the stereotactic apparatus. Ensure that the surgical field contains all the necessary components for the surgery (Figure 2). The absence of an invasive surgical procedure to induce the TBI in this model has several advantages: 1) implantation of the electrodes is flexible and may be performed on the same day as TBI or after a defined period of time; 2) the animal's recovery time is faster; 3) the cranium remains intact, allowing more surface area and flexibility for implanting electrodes.\nAnesthetize the mouse in 3%−5% isoflurane gas in an induction chamber for 5 min.\nTransfer the mouse from the induction chamber to the stereotactic apparatus and place it on a sterile drape on a heating pad with isoflurane gas and vacuum tubes connected to the nose cone.",
    "Maintain the body temperature at 37 °C over the course of the surgery. Place the temperature sensor so that it makes contact with the chest or abdominal wall of the mouse.\nFix the animal's head in place using the ear bars.\nMaintain the anesthesia at 1.5%−3.5% isoflurane or at ~60 breaths/min in the surgical plane (with no response to toe or tail pinch).\nApply an eye ointment to the animal's eyes to keep them lubricated throughout the surgery.\nAdminister a mixture of analgesics (0.1 mg/kg buprenorphine) and the non-steroidal anti-inflammatory drug (5 mg/kg carprofen) in a single injection subcutaneously unless the TBI was performed earlier during the day, in which case the animal already received analgesics and anti-inflammatories.\n\tNOTE: Buprenorphine should be administered again if the time between the first TBI and EEG placement surgery exceeds 8 h or if the animal displays signs of pain 8 h after the first administration, but it should be given without the addition of carprofen.\nAdminister sodium lactate solution (3 µL per gram of the animal's weight) subcutaneously to replace fluids and electrolytes in the animal.\n\tNOTE: If surgery is performed immediately after the TBI, this step has to be timed properly. Sodium lactate solution should be administered every 2 h while the animal undergoes the procedures and once after the surgery, 2 h from the previous injection.\nRemove the hair from the scalp using a hair removal cream.\nBefore making the incision, disinfect the skin of the scalp with povidone-iodine surgical antiseptic solution and 70% ethanol in alternating swabs with sterile gauze pads in a circular motion 3x (20 s per solution each time).",
    "Using a scalpel, make a rostral-caudal incision on the scalp midline from just above the eyes to the back of the head. This method of scalp opening is preferred over cutting the scalp off, as skin flaps can be sealed over or around the EEG-cap providing more stability.\n\tNOTE: When preparing the skull for implantation of the 3-EEG headmount, cutting the scalp off is required, as the size of the headmount will not allow for closure of the skin flaps over the headmount.\nExpand the area of incision by applying small hemostats on the opened skin borders. If any bleeding occurs after the incision, clean with a sterile cotton gauze or swab.\nGently remove the periosteum (i.e., the thin membrane over the cranial bone) with a scalpel blade. If any bleeding occurs during this step, press on bleeding site with a sterile cotton swab until it stops.\nUse sterile cotton swabs to clean the cranium with hydrogen peroxide, but avoid touching the soft tissue surrounding the exposed cranial area. Repeat this step until the cranium is cleaned from any soft tissue and has a whitish appearance.\nDry the cranium with a sterile gauze or cotton swab.\n\tNOTE: Steps 3.12−3.15 are important for the proper fixation of the electrodes and dental cement. Any soft tissue, non-cauterized bleeding, and debris can cause infection, unstable headmount fixation, distorted or absent signal, and loss of the implant within several days or weeks after surgery.\n4. Electrode placement\nImplant the single EEG (1EEG) channel headmount.",
    "NOTE: Abbreviations in the stereotactic coordinates represent spatial relationships and specify the distance in millimeters of the target from the bregma at a given orientation on the animal's head: anterior-posterior (AP) and medial-lateral (ML). Dorsal-ventral is not applicable in this protocol because all electrodes are placed into the epidural space rather than in a certain structure within the brain (Figure 3). Vin+ is an active electrode and Vin- is its reference electrode.\n\t\nUse a high-speed drill with a steel bit (0.5 mm, round, ¼ in.) at ~5,000−6,000 rounds per min (rpm) to create six burr holes (three for stability screws and three for electrodes) using the provided stereotactic coordinates12. For the two anterior screws: AP = +1.5 mm, ML = ±1.5 mm; for the one posterior screw: AP = -5.2 mm, ML = -1.5 mm; for the ground electrode: AP = -5.2 mm, ML = +1.5 mm; for the recording electrodes: AP = -2.3 mm, ML = ±2.7 mm, with Vin+ to the right and Vin- to the left.\nAdd three screws for enhanced stability of the head stage. Using a screwdriver, turn screws 1−1.5 x each to be fixed stably in the cranium.\n\t\tNOTE: Placing the screws deeper will damage the brain.\nInsert the 1EEG headmount into a stereotactic holder arm and position the headmount so that the three electrodes are located along the cranial midline. In this configuration the ground electrode and its respective opening on top of the headmount is in the back, the Vin+ electrode in the middle, and the Vin- electrode in the front. A mark can be made on the headmount with a permanent marker.",
    "Bend each electrode 90° so that the end of each wire is bent downwards and is positioned above the corresponding burr hole. Then, measure out 1 mm length of the portion of the wire that is now perpendicular to the burr hole and trim the excess off (Figure 3). This will ensure epidural placement of the electrodes. The electrodes should be barely touching the dura mater surface.\nLower the headmount and adjust all three electrodes to match the respective burr hole. For epidural recording, the electrodes must be placed above or barely touching the dura mater.\nPrepare dental cement for application by mixing a ½ scoop of powder with several drops of solvent. Use a mixing spatula and stir until the final mixture is putty-like, tacky but malleable, and stiff enough to be properly condensed when placed on the animal's cranium.\nApply dental cement mixture covering all screws and electrodes and wait ~3−5 min for it to solidify. Make sure not to cover the plastic pedestal with dental cement, because it will make it impossible to connect the animal to the commutator with a tether.\nRelease the hemostats holding the skin flaps and close the incision by connecting the skin flaps around the plastic pedestal. Apply several drops of tissue adhesive (see Table of Materials) to seal the skin flaps.\nApply chlorhexidine antiseptic to the area around the implant to avoid infection. If the animal is under anesthesia for longer than 2 h after the previous injection of sodium lactate solution, given during the TBI induction, administer another injection subcutaneously. To maintain proper hydration of the animal, repeat the injection every 2 h that the animal spends under anesthesia.",
    "After the surgery, give a final injection of sodium lactate solution 2 h after the previous injection. If the surgery is less than 2 h long, administer the final recovery dose of the sodium lactate solution 2 h from the first injection.\nRemove the animal from the stereotactic apparatus and measure the animal's weight after the EEG surgery as a reference for future monitoring. Due to the implant, the animal's weight will be greater than before surgery.\nPlace the animal in a clean cage on a warm heating pad for recovery.\nImplant the two EEG and one EMG (2EEG/1EMG) channels headmount.\n\t\nUse the bregma as a landmark for placement of the headmount. Apply a small amount of tissue adhesive (see Table of Materials) to the bottom side of the 2EEG/1EMG headmount, avoiding the four screw holes and place the 2EEG/1EMG headmount on the surface of the cranium.\n\t\tNOTE: There are no specific coordinates for placement of this headmount. The headmount is 8 mm long and 5 mm wide, which covers most of the cranial surface. Positioning the headmount with its front edge ῀3.0 mm anterior to the bregma is optimal and provides good signal quality. Quick manual placement is necessary before the drop of tissue adhesive cures. Allow approximately 5 min for tissue glue to cure completely.\nUse a sterile 23 G needle to create pilot holes for the screws through the four openings in the headmount. To accomplish this, gently push the needle and slowly rotate until the tip of the needle penetrates the skull without damaging the brain. Remove any bleeding from the pilot holes using a sterile cotton swab.",
    "Insert the 0.10 in screws in the pilot holes and rotate them until each is fixed in the skull. This can be up to half of the screw length, but not the full length, as this would damage the dura mater and cortex. If the headmount is positioned so that there is a gap between the skull surface and the rear end of the headmount use two 0.12 in screws in the posterior part.\nMake small opening on the sides of the two-component epoxy (silver-epoxy) twin-pack pouch. Take a double-sided spatula and use each side to scoop a small and equal amount of each component from the pouch and mix them together. Use only a small amount sufficient for a single surgery, because the mixture solidifies within 20 min. Seal the sides of the pouch to prevent drying.\n\t\tNOTE: The silver-epoxy allows for proper electrical contact between the screw and headmount and enhances the stability of the screws.\nApply a small amount of this mixture between screwhead and screw hole, then tighten each screw until its head rests on the base of the implant. Ensure that no silver-epoxy is making contact between the two screws because each screw serves as an individual electrode and, to ensure an accurate signal, it should not make contact with the other screw.\nIf the silver-epoxy mixture was misplaced, there is a few second time window to carefully scoop out the excess to separate the connection. Carefully bend both EMG leads from the posterior edge of the headmount to follow the contour of the animal's head and neck, and then insert them into the nuchal muscles.",
    "Prepare dental cement for application by mixing a ½ scoop of powder with several drops of solvent. Use a mixing spatula and stir until the final mixture is putty-like, tacky but malleable, and stiff enough to be properly condensed when placed on the animal's cranium.\nApply dental cement mixture covering the entire headmount while avoiding covering the six pin holes, as this will make it impossible to connect the pre-amplifier. Wait ~3−5 min for the cement to solidify. Make sure that the skin is not sealed to the headmount with dental cement.\nRelease the hemostats holding the skin flaps and close the incision by connecting the skin flaps around the plastic pedestal. Apply several drops of tissue adhesive to seal the skin flaps.\n\t\tNOTE: If the skin incision was made longer to allow for straightening of the EMG wire leads, the skin can be sealed with tissue adhesive or sutured. Sealing the skin with tissue adhesive is usually sufficient. However, if during post-operative monitoring opening of the incision is observed, sutures are recommended instead.\nApply chlorhexidine antiseptic to the area around the implant to avoid infection. Administer sodium lactate solution (3 µL per gram of the animal's weight) subcutaneously to replace fluids and electrolytes if the animal is under anesthesia for longer than 2 h after the previous injection.\nRemove the animal from the stereotactic apparatus and measure the animal's weight after the EEG surgery as a reference for future monitoring. Due to the implant, the animal's weight will be greater than before surgery.\nPlace the animal in a clean cage on a warm heating pad, with recovery gel and a few moistened chow pieces for recovery.\nImplant a three EEG channels (3EEG) headmount.",
    "Use high-speed drill with a steel bit (0.5 mm, round, ¼) at ~5,000−6,000 rpm to create six burr holes (three for stability screws and three for electrodes) using the provided stereotactic coordinates12. For ground and common reference for EEG1 and EEG2: AP = 5.2 mm, ML = ±1.5 mm; for EEG1 and EEG2: AP = -3.0 mm, ML = ±3.0 mm; for independent EEG3: AP =-1.4 mm, ML = ±1.5 mm.\nPlace the six screw electrodes into the burr holes.\n\t\tNOTE: Placing the screws deeper will create significant damage to the brain. Screw electrodes provide better stability of the headmount.\nPrepare dental cement for application by mixing a ½ scoop of powder with several drops of solvent. Use a mixing spatula and stir until the final mixture is putty-like, tacky but malleable, and stiff enough to be properly condensed when placed on the animal's cranium.\nApply dental cement mixture covering the entire exposed surface of the cranium and each screw electrode. Make sure that skin is not sealed to the headmount with dental cement. Wait ~1−2 min for the cement to mildly solidify. There is no need to wait until full solidification before proceeding to the next step.\nTurn on the soldering iron to heat it up. Place the 3EEG headmount in a stereotactic holder arm.\n\t\tNOTE: Position the headmount so that the six wire lead positions match the position of the wire leads of each screw electrode.\nLower the headmount so that its ventral part rests on top of the dental cement.\nTwist the wire of each lead from each of the screw electrodes with the corresponding wire lead of the headmount.\n\t\tNOTE: Twisting the wrong wire leads will make data interpretation complicated or impossible.",
    "Carefully trim the excess wire off using scissors. Solder each twisted pair of wire for proper signal conduction.\n\t\tNOTE: Each pair of wires must make contact with another pair, otherwise signal quality and data interpretation will be compromised.\nBend each soldered pair of wire leads around the headmount, avoiding contact between each pair.\n\t\tNOTE: If the wire leads are not trimmed short enough it can be difficult to bend them around the headmount without touching another wire. In this case, bend one pair first, cover it with dental cement mixture, wait ~1−2 min to solidify, then proceed with the next pair in the same fashion.\nFinish covering all the wire with dental cement leaving only the black portion of the headmount exposed.\n\t\tNOTE: Be careful to not apply any dental cement powder or mixture to the top of the exposed portion of the headmount as any debris or cement in the holes will block the contact and will lead to either signal absence or noise.\nRelease the hemostats holding the skin flaps. Apply chlorhexidine antiseptic to the area around the implant to avoid infection.\nAdminister sodium lactate solution (3 µL per gram of the animal's weight) subcutaneously to replace fluids and electrolytes if the animal has been under anesthesia for longer than 2 h after the previous injection.\nRemove the animal from the stereotactic apparatus and measure the animal's weight after the EEG surgery as a reference for future monitoring. Due to the implant, the animal's weight will be greater than before surgery.\nPlace the animal in a clean cage on a warm heating pad, with recovery gel and a few moistened chow pieces for recovery.\n\t\tNOTE: Hydrogen peroxide aids in removing of the any remaining soft tissue from the cranium.\n5. Connecting animals to the acquisition system",
    "Cup the animal with both hands to remove it from the acquisition cage and transfer it to a clean area with a flat surface, like an Animal Transfer Station (ATS).\nGently grab the mouse by the skin of its back. Do not grab the animal by the tail, as this causes distress.\nIdentify the opening in the EEG headmount corresponding to the ground electrode and match the respective pin of the tether for proper connection.\n\tNOTE: Reverse connection of the tether from the commutator to the animal headmount will result in a different reading from the electrodes and potentially distorted waveforms.\nReturn the animal to the acquisition cage and connect the other end of the tether (EEG System 1) or pre-amplifier (EEG System 2) to the commutator.\n\tNOTE: When connecting the pre-amplifier (EEG System 2) to the tether from the commutator, match the white marks on the ends of both tethers. Reverse connection will result in permanent damage of the amplifier and requires repairs by the manufacturer, which are expensive.\nGently rotate the tether connecting the animal to the commutator to ensure the mechanism works properly and the animal can move freely.\n6. EEG data acquisition settings\nSet EEG System 1 acquisition parameters.\n\t\nSet sampling rate to 500 Hz; gain 5,000; mode Norm 35 Hz; LPN off. Set high pass filter to 0.5 Hz.\n\t\tNOTE: 100 Hz (low pass) is built-in and does not require manual input.\nSet EEG System 2 acquisition parameters.\n\t\nSet sampling rate to 600 Hz; preamp gain 100; gain 1 (EEG1,2). Set low pass filter to 100 Hz.\n\t\tNOTE: 1 Hz (high pass) is built-in and does not require manual input.\n7. Video data acquisition settings\nSet acquisition parameters for EEG System 1.",
    "NOTE: A third party video acquisition system is needed for obtaining simultaneous video data.\n\t\nSet frame rate between 15 (minimum recommended) and 30 (maximum available) for appropriate video quality. Set the resolution to 640 x 640 pixels. Set type of compression to H.264H.\nSet acquisition parameters for EEG System 2.\n\tNOTE: This EEG system offers a video system and software which synchronize video and EEG data together in a single file for up to four animals (see Table of Materials).\n\t\nSet frame rate between 15 (minimum recommended) and 30 (maximum available) for appropriate video quality. Set the resolution to 640 x 480 pixels. Set the type of compression to the WebM file format.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}