{
  "id": 11849,
  "origin_website": "Jove",
  "title": "Measurement of the Compressibility of Cell and Nucleus Based on Acoustofluidic Microdevice",
  "procedures": [
    "1. Fabricating and assembly of the acoustofluidic microdevice\nFabrication of the microfluidic chip.\n\t\nDesign a single-channel chip with only one inlet and outlet as shown in Figure 1. For measuring cells, keep the rectangular cross-section of the microchannel at 740 µm wide and 100 µm deep. For measuring cell nucleus, change the width and depth of the microchannel to 250 µm and 100 µm, respectively.\nPrepare the microchannel on silicon wafer via reactive ion etching. Seal the top of the microchannel with a piece of transparent heat-resistant glass by anodic bonding15. Wash the chips with an ultrasonic cleaner for 10 min. Dry them in a drying oven at 50 °C for later use.\nFabricate polydimethylsiloxane (PDMS) blocks.\n\t\nAdd 30 mL of pre-polymer to a 100 mm (in diameter) glass dish. Add 3 mL of curing agent to the pre-polymer with a syringe.\n\t\tNOTE: The volume ratio of the curing agent and pre-polymer is 1:10.\nVigorously mix the PDMS pre-polymer and curing agent with a glass rod for about 10 min. Look for small and uniformly separated air bubbles in the solution, which indicate that the PDMS pre-polymer and curing agent are well mixed.\nPlace the glass dish in a vacuum desiccator and evacuate for 15-25 s. Repeat this process until there are no air bubbles in the mixture.\nPlace the glass dish in a drying oven set at 50 °C for 1 h to allow the mixture to cure. After the incubation, use a scalpel to cut the PDMS into blocks of suitable size about 1.2 cm long and 1 cm wide.",
    "NOTE: The length of the PDMS block is consistent with the width of the chip, and the width is selected to ensure that there is enough space in the middle for the piezoelectric ceramic when two PDMS blocks are adhered on the chip.\nBind the PDMS block to the chip.\n\t\nPunch holes in the PDMS block for inlet and outlet ports with a 1 mm diameter hollow needle. Put the PDMS blocks and chip (back side up) in a plasma cleaner for 1 min.\nAlign the holes on the PDMS blocks with the chip inlet and outlet. Gently press the PDMS blocks to the chip for 15 s. This should cause bonding to occur between the PDMS blocks and the surface of the chip.\nConnect the polytetrafluoroethylene (PTFE) catheter to the chip (Figure 2B).\n\t\nCut two pieces of PTFE catheter with an inner diameter of 0.8 mm and a length of 10 cm. Bend a stainless-steel needle with an inner diameter of 0.7 mm and a length of 1.5 cm by 90° into an L shape. Connect it to one end of the catheter. Prepare two such catheters with needles.\nInsert the stainless-steel needles into the holes of the PDMS blocks. For the inlet, connect a 19 G dispensing needle to the other end of the catheter as a connector for a syringe.\nAfter completing the above steps, inject deionized water to test the tightness of the overall channel. Impervious to water means a good seal.\nPiezoelectric ceramic assembly (Figure 2C)\n\t\nUse a diamond wire cutter to cut piezoelectric ceramic sheets with a diameter of 2 cm into four strips with a width of 5 mm.",
    "Ensure that the resonant frequency of the piezoelectric ceramic matches the width of the chip microchannel. For the 740 µm and 250 µm wide microchannel, use piezoelectric ceramics with resonance frequencies of 1 MHz and 3 MHz, respectively.\nWeld wires on both sides of the piezoelectric ceramic at one end.\nGlue the piezoelectric ceramic to the middle of the back of the chip with cyanoacrylate glue.\nTo spread the glue evenly, place a drop of glue on the piezoelectric ceramic, smooth the glue with a toothpick and remove the excess glue. Then, quickly press it on the chip and continue to press for about 1 min. Ensure that the piezoelectric ceramic and the chip are firmly bonded and evenly contacted.\nMount the microdevice (Figure 2D).\n\t\nCut a piece of PDMS (about 1.5 cm long and 1 cm wide) as the base of the microdevice. Using double-sided tape, stick one side of the base to the inlet and outlet PDMS blocks, and the other side to a transparent glass slide. Fix the whole microdevice to the microscope stage to keep the chip in one focal plane.\n2. Sample preparation\nPreparation of polystyrene standard particle solutions.\n\t\nAdd 0.05 mL of polystyrene particle (6 µm in diameter) solution (2.1 x 108 particle/mL) to 10 mL of phosphate buffered saline (PBS) and mix well.\n\t\tNOTE: In order to reduce the measurement error caused by the change of the acoustic energy density, the polystyrene particle solution was mixed with the sample solution in each experiment as calibration.\nPreparation of cell suspensions.",
    "Wash the adherent cells (e.g., MCF7, MDA-MB-231, HCT116) at 90% confluency (~5 x 105 cells) with PBS. Add 500 µL 0.25% trypsin (1x) for 1-2 min at room temperature (25 °C). Remove the trypsin, add 1 mL complete medium and form a cell suspension by pipetting.\nCentrifuge the cell suspension at 100 x g for 5 min. Remove the supernatant and resuspend in 0.5-1 mL of PBS in order to obtain a cell suspension. Cells were counted with a hemocytometer and the concentration was about 3-5 x 105 cells/mL.\nPreparation of cell nucleus suspension\n\t\nCarry out step 2.2. Then, remove the supernatant and add 200 µL of cytoplasmic protein extraction reagent A (supplemented with 1% PMSF) per 20 µL cell pellet (approximately 5 million cells) and mix well.\nVortex the above mixture at 220 x g for 5 s, and then place on ice bath for 10 min. After incubation, add 10 µL of cytoplasmic protein extraction reagent B to the solution.\nVortex at 220 x g for 5 s. Place on ice bath for 1 min and vortex again at 220 x g for 5 s. Then, finally centrifuge at 1,000 x g for 5 min at 4 °C.\n\t\tNOTE: The volume ratio of cytoplasmic protein extraction reagents A and B is 20:1.\nRemove the supernatant and resuspend the pellet in 1 mL of PBS. Then, centrifuge at 1,000 x g at 4 °C for 4 min. Remove the supernatant and resuspend in 100 µL of PBS as cell nucleus suspension.\nAdd trypan blue to the above cell nucleus suspension and stain at room temperature (25 °C) for 4 min. The volume ratio of trypan blue solution to nucleus suspension is 1:1. Count the number of nuclei under the inverted microscope with a 10x objective.",
    "NOTE: To clearly identify the cell nuclei under the microscope, trypan blue staining is required. Trypan blue solution needs to be in a 37 °C water bath for 10 min before use for effective staining.\nDilute the above cell nucleus suspension with PBS buffer to a concentration of 2-3 x 105 nucleus/mL. Filter the cell nucleus suspension through a 70 µm sieve.\n3. Measuring the compressibility of cell and nucleus\nSet up the measurement system (Figure 3)\n\t\nTurn on the light source of the microscope and open the camera software. Use the 4x objective to find the middle position of the microchannel, i.e., the position of the piezoelectric ceramic.\nConnect the wires and weld them to the positive and negative terminals of the signal generator output on the piezoelectric ceramic, respectively.\nPlace the syringe on the microinjection pump and connect it to the inlet catheter. Place a small container at the end of the outlet catheter to hold the fluid flowing out of the microchannel.\nDetermine measurement parameters\n\t\nAspirate the polystyrene particle solution with the syringe and inject it into the chip microchannel. Avoid air bubbles in the chip microchannel to ensure accurate measurement. Ensure that particles are evenly distributed in the chip microchannel.\n\t\tNOTE: Measurement can be conducted without flow or syringe pump. If needed, the flow rate of the microinjection pump should be set to a proper value. Here, the range of flow rate is 0-20 µL/h.\nSet the output of the signal generator to a sine signal with a frequency of 1 MHz (3 MHz for cell nucleus measurement) and peak-to-peak voltage (Vpp) of 10 V.",
    "Fine tune the frequency of the signal until it's observed that the particles move toward the midline of the microchannel and remain in forward motion along the midline after reaching the midline (Figure 4).\n\t\tNOTE: The speed of the particles moving toward the midline is determined by the voltage amplitude, which can be adjusted between 5 Vpp and 20 Vpp.\nMeasure cells and nuclei\n\t\nMix 1 mL cell or nucleus suspension with the standard particle solution at the ratio of 1:1 and inject it into the microchannel with a syringe.\nStart recording with CCD camera when the cells or nuclei enter the field of view. Then, turn on the signal generator. Stop recording when the cells or nuclei reach the midline.\nRinse the microchannel with deionized water, 75% alcohol, and deionized water in sequence for later use.\n4. Data processing\nMap particle or cell trajectories.\n\t\nImport the captured video into ImageJ software: File > Open> Select Folder. Click on the ellipse shape in the toolbar of the ImageJ software to pick a cell of interest and its adjacent particle (Figure 5).\nAs shown in Figure 5, preset measurement parameters in ImageJ software as Analyze→ Set Measurement →Area, Centroid, Display Label.\nTaking the frame where the target cell or particle undergoes longitudinal displacement as the start frame; record the pixel position and size of the cell or particle in each frame until it reaches the midline of the microchannel. Export the data as a spreadsheet file and repeat the step until trajectories for all cells of interest are obtained.\nCoordinate transformation and correction.\n\t\nRecord the pixel coordinates of the four corners of the microchannel in this field of view as (0, y1), (0, y2), (x3, y3), (x4, y4). Here x3 = x4.",
    "For each measurement point (xi, yi), calculate the new coordinate (xi', yi') after rotation correction using the following formulas:\nimgsrc://cloudfront.jove.com/files/ftp_upload/64225/64225eq01.jpg\nimgsrc://cloudfront.jove.com/files/ftp_upload/64225/64225eq02.jpg\nimgsrc://cloudfront.jove.com/files/ftp_upload/64225/64225eq03.jpg\nConvert pixel coordinates to real size coordinates. The actual coordinates can be obtained by multiplying pixel coordinates by the ratio. The ratio was the actual width of the microchannel divided by the pixel width (H) of the microchannel.\nTransform and correct the pixel coordinates of the cells and particles obtained in step 4.1 to the final motion trajectory data. All coordinates minus the coordinates of the lower-left corner, i.e., (0, y2). The frame rate of the video is 40 frames per second, so multiply the number of frames corresponding to each coordinate by 0.025 s to obtain the time of particle movement, thereby obtaining the change of the position in the y direction with time.\nCalculate the acoustic energy density (Figure 6A,B).\n\t\nThe motion of the cell or particle in the Y direction is driven by the acoustic force Fac and hydrodynamic force FD. Calculate the motion trajectory using the following formulas:\nimgsrc://cloudfront.jove.com/files/ftp_upload/64225/64225eq04.jpg     (1)\nimgsrc://cloudfront.jove.com/files/ftp_upload/64225/64225eq05.jpg     (2)\nimgsrc://cloudfront.jove.com/files/ftp_upload/64225/64225eq06.jpg     (3)\n\t\twhere r and D are the radius and diameter of the cell or particle, ρ and β are the density and compressibility, ν is the velocity vector. The subscripts c and f denote the cell and fluid, respectively. d is the distance from the nearest acoustic pressure node, μ is the dynamic viscosity of the fluid, k is the wave number, and E is the acoustic energy density.\n\t\tNOTE: The density of MCF7, HCT116, A549 and cell nuclei was 1068 kg/m3, 1077 kg/m3, 1073 kg/m3, and 1155 kg/m3, respectively 12,16,17.\nAccording to the formulas described in step 4.3.1, use the MATLAB software to obtain the numerical solution for the standard particle trajectory under the acoustic field with finite difference method.",
    "Within the preset acoustic field range, change the acoustic energy density and fit the numerical solution (obtained in step 4.3.2) and the measured motion trajectory (obtained in step 4.2) for the standard particle. Select the best fitting result according to the fitting mean square error. The acoustic energy density obtained here is used as a parameter for subsequent calculation of cell compressibility.\nCalculate the cell compressibility (Figure 6C,D).\n\t\nSet the acoustic energy density to the value obtained in step 4.3.3.\nAccording to the formulas described in step 4.3.1, use the MATLAB software to obtain the numerical solution for the cell trajectory under the acoustic field with finite difference method.\nSimilar to step 4.3.3, within the preset compressibility range, change the compressibility and fit the numerical solution (obtained in step 4.4.2) and the measured motion trajectory for the cell (obtained in step 4.2). Use the compressibility coefficient corresponding to the best fitting result as the measured cell compressibility.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}