{
  "id": 9639,
  "origin_website": "Jove",
  "title": "Electrophysiological Measurements and Analysis of Nociception in Human Infants",
  "procedures": [
    "Before any studies can be conducted on infants' ethical approval and informed written parental consent needs to be sought.\nIn this study ethical approval was obtained from the University College Hospital Ethics Committee and informed written parental consent was obtained before each procedure. This study conformed to the standards set by the Declaration of Helsinki and Good Clinical Practice guidelines.\n1. Data collection - setup\nPlace a minimum of 16 individual disposable EEG Ag/AgCl cup electrodes on the infant's head after skin prepping according to the 10-20 electrode placement system (Figure 1A). More comprehensive coverage can be achieved using an EEG cap with embedded electrodes. Use of an EEG cap makes the process faster and less disruptive, particularly as electrodes are prepared with inductive gel before placing the cap on the head. The application of disposable EEG electrodes requires more time and skill, but generally results in a better recording. Consider reducing the number of electrodes if access to the infant is limited, but always use midline electrodes (Cz, CPz and FCz). Use FCz as the reference electrode for the recording.\nUse EEG conductive paste to optimise electrode/skin electric coupling.\nPlace an elastic net over the electrodes to hold them in place.\nTie the electrode leads together to minimise electrical interference.\nPlace a ground electrode onto the chest or head.\nPlace EMG electrodes on the biceps femoris of both legs after skin prepping (Figure 1B).\nTo record ECG activity place lead 1 ECG electrodes onto the body after skin prepping (one electrode on the left side of the chest, one on the right and use the same ground electrode as for the EEG).\nPlace a movement transducer on the abdomen to measure respiration.",
    "Place a pulse oximeter probe on the foot to measure oxygen saturation and heart rate. Make sure that the probe is secured in place and that a continuous signal is recorded without dropouts. The oximeter probe needs to be placed on the foot that is contralateral to the foot which you intend to stimulate.\nSet up a tripod-mounted camcorder to frame the face of the infant so that changes in facial expression can be recorded.\nPlace a light-emitting diode (LED) in the camera frame. The LED is linked to the timing circuit so that it will flash when stimulation is presented to synchronise the EEG, EMG and video recording.\n2. Data collection - recording\nStart video recording.\nStart pulse oximetry recording.\nStart EEG/EMG recording.\nWait until the infant is settled.\nHold the foot as if performing a heel lance and manually event mark the EEG and EMG recordings. This epoch will be used to identify a section of control background EEG and EMG.\nApply touch stimulation by lightly tapping a rubber bung that is attached to the arm of a tendon hammer against the surface of the heel. Stimulate the foot that is not attached to the pulse oximeter. When the infant is stimulated the EEG/EMG and video recording must be event-marked in order to identify the time in the recording when the stimulation took place. The touch stimulation can be event-marked by attaching an impedance head to the tendon hammer which electronically links the stimulator to the recording equipment. The video recording is event-marked by the LED flash. Repeated touches may be applied and the stimulus can be applied to different regions of the body, i.e. the shoulder",
    "Apply a non-noxious control stimulation by rotating the lancet by 90 degrees and placing it against the foot so that when the spring-loaded blade is released it does not contact the skin. This event can be time-locked using an accelerometer attached to the top surface of the lance. The accelerometer detects the vibration that occurs when the blade is released.\nPerform the clinically-essential heel lance in accordance with clinical practice in the neonatal unit. Wait until the EEG activity is settled before doing the heel lance. Time-locking of the heel lance can be performed in the same way as for the control stimulation. Following the heel lance, do not squeeze the foot for at least 30 seconds to ensure that the recorded responses are solely due to the lance.\nEnsure that the required quantity of blood is collected and prepare the samples for clinical analysis.\nSave the data and stop all the recordings.\nRecord the infant's demographic information and the experimental details and input them into a database for safe storage and future reference.\nRepeat this procedure in the required sample of infants. In this example the number of infants = 23.\n3. EEG data analysis\nCreate EEG epochs of 1.7 seconds that correspond to each touch, control and lance stimulation and background EEG. Epochs should start 0.6 seconds before each event. The number of epochs corresponding to each modality should be the same.\nBaseline correct the epochs by subtracting the mean baseline signal and high-pass filter them at 0.1 Hz.\nConsider the epochs recorded at CPz or Cz for further analysis and exclude epochs which were contaminated by movement artefact. Movement artefact is defined as a change in amplitude greater than 50μV in less than 50ms.",
    "Align the traces to correct for latency jitter between 50 and 300 ms post stimulation and conduct Principal Component Analysis (PCA) in this time interval to identify the tactile potential (i.e. EEG activity related to tactile stimulation). Consider the epochs to be the variables and the time points the observations. PCA decomposes the EEG epochs into basic waveforms, termed principal components (PCs) and represent systematic variation in the amplitude of the signal across time points.\nRun one-way analysis of variance (ANOVA) on the weights of each of the first 2 PCs to determine which PC represents the tactile potential. This will be the PC whose weights were significantly larger following tactile stimulation compared to background EEG.\nAlign the traces to correct for latency jitter between 300 and 700 ms post stimulation and conduct PCA in this time interval.\nRun one-way ANOVA on the weights of each of the first 2 PCs to determine which PC represents the nociceptive-specific potential. This will be the PC whose weights were significantly larger following noxious stimulation compared to tactile stimulation and background EEG.\n4. EMG data analysis\nCalculate the root-mean-square (RMS) of the EMG signal in the first 1000 ms post stimulation for the control and lance stimuli.\nPerform a t-test on the RMS values to determine the nociceptive-specific spinal reflex withdrawal.\n5. Representative Results\nimgsrc://cloudfront.jove.com/files/ftp_upload/3118/3118fig1.jpg\nFigure 1. (A) (i) Diagram and (ii) photo of the electrode placements for EEG recordings (modified international 10/20 electrode placement system); (B) Diagram of the electrode placements for EMG recordings on the biceps femoris.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3118/3118fig2.jpg\nFigure 2.  (A) Examples of the sensory potential at Cz evoked by touch in 3 infants; (B) examples of the nociceptive-specific potential at Cz evoked by noxious lance in 3 infants. \nimgsrc://cloudfront.jove.com/files/ftp_upload/3118/3118fig3.jpg",
    "Figure 3.  Dependence of the PC weights on stimulus modality at Cz (mean ± SEM). The PC obtained between 50-300 ms after the stimulus onset represents a tactile potential and the PC obtained between 300-700 ms after the stimulus onset represents a nociceptive-specific potential. The PCs (bold lines) are overlaid on the grand averages obtained across all stimulation types (background EEG, touch, noxious lance) after the individual traces were aligned in the stated time interval.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3118/3118fig4.jpg\nFigure 4.  (A) Example of EMG activity in one infant after (i) noxious heel lance and (ii) touch of the heel. (B) Mean (±SE) EMG root-mean-square EMG activity in infants after the noxious heel and non-noxious touch stimuli."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}