{
  "id": 8552,
  "origin_website": "Jove",
  "title": "Intrathecal Delivery of Antisense Oligonucleotides in the Rat Central Nervous System",
  "procedures": [
    "All in vivo procedures were performed under Biogen Institutional Animal Use and Care Committee (IACUC) approved protocols which follow the guidelines set forth by the United States National Institutes of Health guide for the care and use of laboratory animals.\n1. Material and instrument preparation\nPrepare the special guide cannulas.\n\t\nUse a rotary tool with cut-off wheel (or a sharp saw) to cut off the two ends of a 19 G needle, resulting in a ~1.5−2 cm long guide cannula (Figure 1Aiii). Use the grinding wheel of the rotary tool to smooth the two ends.\n\t\tNOTE: Alternatively, premade and sterile guide cannulas can be purchased from a commercial vendor (Table of Materials).\nPrepare the catheter/wire assembly.\n\t\nCut an 8 cm long piece of PE-10 tubing (polyethylene tubing, diameter 0.011 inch) to serve as the intrathecal catheter. Make a mark 2 cm from one end with an ethanol resistant marker pen. Cut an 11 cm long stylet wire from polytetrafluoroethylene coated stainless steel wire. Insert the stylet wire (Figure 1Aii) into the lumen of the PE-10 catheter (Figure 1Ai).\n\t\tNOTE: One catheter/wire assembly set (Figure 1Av) is needed for each animal. Alternatively, catheters and stylet wires can be purchased from a commercial vendor (Table of Materials).\nPrepare delivery catheter assembly.\n\t\nCut a piece of PE-50 catheter (5−10 cm, polyethylene tubing, diameter 0.023 inch) (Figure 1Bi). To one end of the PE50 catheter insert a 23 G tubing adaptor (Figure 1Biv). This end will be connected to a 100 µL syringe (Table of Materials) during surgery. Insert a modified 30 G needle with hub cut off (Figure 1Biii) into an approximately 0.5 cm piece of PE-10 tubing (Figure 1Bii) and connect the PE-10 tubing to the other end of the catheter.",
    "The 30 G needle end of the delivery catheter assembly (Figure 1Bv) will be connected to the distal end of the implanted PE-10 catheter in the rat during surgery.\n\t\tNOTE: Alternatively, the delivery catheter assembly (Figure 1Bv) can be purchased from a commercial vendor (Table of Materials).\nPrepare the guide cannula-needle assembly (Figure 1Avi) by placing a guide cannula (Figure 1Aiii) over the end of a 23 G needle. \nSterilize all surgical instruments including the guide cannula and the wire/catheter sets using an ethylene oxide sterilizer for 12 h.\n\tNOTE: All surgical instruments except the catheter can be autoclaved; catheter will melt at high temperature.\n2. Surgery preparation\nNOTE: This procedure is routinely performed on male and female Sprague Dawley rats with body weights between 200 g and 400 g. Two rats are housed per cage under a 12 h light/dark cycle with free access to food and water.\nWeight a rat and place it in an isoflurane chamber to induce anesthesia (1−5% isoflurane in O2, titrated to effect).\n\tNOTE: The rat is then continuously anesthetized with isoflurane to maintain deep anesthesia via a nose cone throughout the procedure. An alternative anesthesia method (e.g., administration of ketamine 100 mg/kg and xylazine 10 mg/kg) can be used as approved by the IACUC.\nWhen the rat fails to respond to a toe pinch, shave its back from the tail to the caudal thoracic spine and place the shaved rat on the a sterile sheet laid on top of a heating pad.\nPosition a 50 ml conical centrifuge tube under the abdomen of the rat to flex the spine in the lumbar region (Figure 2A) and apply ophthalmic ointment to the eyes.",
    "Inject sustained release buprenorphine (1.0 mg/kg; Table of Materials) subcutaneously in the rat. Clean the exposed skin with alternating povidone and alcohol scrubs and repeat this three times.\n\tNOTE: An alternative pain relief can be used as approved by the IACUC protocol.\nDrape the animal with a sterile transparent drape that has been fenestrated over the surgical site.\n3. Surgery\nWith the rat supported by the 50 mL conical tube, identify the two natural pits between muscles above the pelvis (arrows in Figure 2A). With one hand holding those pits, use the other hand to gently press and feel the spine from caudal to rostral direction and find the first major indentation between vertebrae and this is the intervertebral space between S1 and L6 vertebrae (Figure 2B).\nMove slightly rostrally to identify the next indentation, the intervertebral space between the L5 and L6 vertebrae and the injection site (* in Figure 2A). Use a scalpel to make an incision no more than 2 cm long in the skin along the midline from rostral to caudal so that the injection site is at the center of the incision (dotted line in Figure 2A).\nUse dissection scissors to dissect away the connective tissue in order to visualize the muscle layer. Then make a 1 cm incision in the muscle capsule immediately lateral to the dorsal spinal process of the L6 lumbar vertebra.\n\tNOTE: The bones of the L6 lumbar vertebra could be visualized at this point.",
    "Position the guide cannula-needle assembly near the anterior aspect of the 6th lumbar vertebra and push it into the intervertebral space along the anterior aspect of the 6th vertebra so that the end of the needle penetrates the spinal canal. Push the guide cannula in place along the needle and remove the 23 G needle leaving only the guide cannula in place.\n\tNOTE: It is helpful to use blunt forceps to locate the dorsal process of the L6 lumbar vertebra before inserting the needle. Generally, CSF fluid can be seen entering the needle hub (this fluid may be tinged with a hint of blood, but this does not indicate that harm has been done or that the needle is not placed correctly). The authors have not seen large amount of blood or severe bleeding during this procedure. If either occurs, a veterinarian should be contacted to determine the appropriate treatment and if animals should be euthanized.\nInsert the catheter-wire assembly into the guide cannula. Angle down the catheter-wire assembly at approximately a 45° angle to the spinal canal and force the end approximately 0.3 cm into the spinal canal.\nRemove the guide cannula, leaving the catheter with the stylet wire in place. Remove the stylet wire approximately 2.5 cm from the intrathecal tip of the catheter and advance the catheter into the spinal canal until the 2 cm mark is at the entrance of the canal (just visible below the muscle) as shown in Figure 1Bvi.\n\tNOTE: The inserted catheter should extend rostrally into the subarachnoid space. Successful placement should allow for free movement of the catheter in that space.\nCompletely withdraw the stylet wire, and CSF may be seen entering the implanted catheter.",
    "Connect the delivery catheter assembly to the distal end of the implanted catheter via the 30 G needle end (Figure 1Bv,vi).\nLoad 60 µL of sterile saline into a 100 µL syringe (flushing syringe). Load a bolus of 30 µL of the test compound (e.g., ASO solution) into a second syringe (injection syringe).\nConnect the flushing syringe (loaded with saline) to the tubing adaptor end of the delivery catheter assembly (Figure 1Bv). Inject 20 µL of sterile saline into the intrathecal space (pre-injection flushing).\nConnect the injection syringe (loaded with test compound) to the tubing adaptor end of the delivery catheter assembly (Figure 1Bv). Inject 30 µL of test compound into the intrathecal space over 30 s.\n\tNOTE: The routine injection volume of ASO is 30 µL to achieve good knockdown in the spinal cord and in the cortex. It has been reported that the injection volumes may impact compound distribution12, though different injection volumes have not been tested. If other compound or volume is used, the safety and effectiveness need to be empirically determined.\nRepeat step 3.10 and flush the catheter with another 40 µL of sterile saline (post-injection flushing). Then detach the delivery catheter assembly from the implanted catheter.\n\tNOTE: The pre and post-injection flush is thought to reduce local sequestration of the compounds and improve their distribution to the rostral structures12.\nAseptically cut and heat seal the implanted catheter: Place a pair of sterile dissection forceps in a bead sterilizer until they are very hot, then clamp down on the tubing with the hot end of the forceps.\n\tNOTE: This action melts the catheter. Thus, the hole in the tube is collapsed and all sides stick to each other, sealing the tubing in an aseptic fashion and then it is placed into the subcutaneous space.",
    "Use absorbable monofilament sutures to secure the remaining heat-sealed catheter to the connective tissue. Then use non-absorbable monofilament sutures to close the skin over the secured heat-sealed catheter.\n\tNOTE: Wound clips can also be used as approved by the IACUC protocol. The technique is compatible with repeated injections though it has only been used for one-time injections in our hands. The feasibility of repeated injections should be empirically evaluated with the approval of the IACUC.\nUse gauze and saline to wash any blood from the skin and allow the animal to recover from the anesthesia in a heated incubator until mobile, at which point it is returned to its home cage (two rats per cage).\n\tNOTE: When performing surgeries on multiple rats on the same day, clean tools using water to remove blood and re-sterilize using a heated dry bead sterilizer (for at least 20 s, with time to cool) between animals. A new set of instruments is used every 5 animals.\nMonitor the animals daily for at least 3 days after surgery and continue to monitor the animals weekly after recovering from surgery according to the IACUC protocol.\n\tNOTE: If any complications occur (urine retention, incision infections, neurological disorder such as seizure or paralysis), a veterinarian should be contacted to determine the appropriate treatment and if animals should be euthanized. If sustained release buprenorphine is not used, pain relief should be given daily after surgery according to the IACUC protocol.\n4. Evaluation of tissue specific knockdown after IT injection",
    "Two weeks after IT bolus injection of ASOs, collect different regions of the brain (i.e., cerebral cortex, striatum and cerebellum) as well as different segments of the spinal cord (i.e., cervical, thoracic, and lumbar). Extract total tissue RNA using a commercial RNA extraction kit and perform cDNA synthesis reaction as described previously13.\n\tNOTE: Standard reagents were used for qPCR with the following assays: rat Malat1 and rat GAPDH. The relative transcript levels were calculated using the 2-ΔΔCT method (CT = threshold cycle).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}