{
  "id": 10969,
  "origin_website": "Jove",
  "title": "Utilization of Microscale Silicon Cantilevers to Assess Cellular Contractile Function In Vitro",
  "procedures": [
    "1. Cantilever Chip Fabrication\nIllustrated details of the described fabrication steps are provided in Figure 1.\nPlace Silicon-On-Insulator (SOI) wafers in an oven and bake at 125 °C for 20 min to dehydrate them.\nDeposit a 1.5 µm thick layer of silicon oxide onto the handle layer of the dehydrated SOI wafer using a Plasma Enhanced Chemical Vapor Deposition (PECVD) tool.\nPlace the wafer on the spin coater chuck with the device layer facing up. Ensure wafer is centered, dispense 2 ml of P20 primer on the center of the wafer, and spin at 3,000 rpm for 60 sec at an acceleration of 1,000 rpm/sec. P20 primer promotes the adhesion of photoresist to the device layer.\nWhile the wafer is still on the spin coater chuck, dispense 2 ml of S1818 photoresist on the center of the wafer, and spin at 3,000 rpm for 60 sec at an acceleration of 1,000 rpm/sec to obtain a 1.5 µm thick layer of photoresist.\nPlace the wafer on a hot plate and perform a soft bake at 115 °C for 1 min.\nPerform a hard contact UV exposure using a photolithography contact mask aligner in order to transfer the pattern from the cantilever mask to the photoresist on the device layer. Calculate the exposure time based on exposure energy value of 125 mJ/cm2 for S1818 photoresist.\nDevelop the photoresist by immersing the wafer in a 726 MIF photoresist developer for 1 min while gently shaking the wafer back and forth.\nRinse the wafer with de-ionized (DI) water and dry it, preferably using a spin rinse dryer (SRD) tool.\nRemove the photoresist from the edge of the wafer (up to 5 mm from the edge) using a cotton swab dipped in acetone.",
    "Load the wafer in a Deep Reactive Ion Etch (DRIE) tool, with the photoresist side facing up, and run a recipe to etch the patterned silicon layer through the device layer. The buried oxide layer functions as an etch stop, so perform an etch with 50% to 100% more cycles than is expected to be necessary to ensure a complete etch.\nPlace the wafer in a hot photoresist bath solution for 20 min to strip the photoresist. Transfer the wafer to a quick-dump-rinser (QDR) to rinse the wafer with DI water. Following the photoresist strip, load the wafer in a SRD tool to rinse and dry the wafer. Inspect the wafer under a microscope to ensure the cantilever pattern appears as expected.\nDeposit a 1 µm thick layer of un-doped silicon oxide on the device layer of the wafer using a PECVD tool. This oxide layer functions as a protective layer for the cantilevers during further processing steps.\nPlace the wafer on the spin coater chuck with the handle layer facing up to begin processing of the back side of the wafer. Ensure wafer is centered, dispense 2 ml of P20 primer on the center of the wafer, and spin at 3,000 rpm for 60 sec at an acceleration of 1,000 rpm/sec.\nWhile the wafer is still on the spin coater chuck, dispense 2 ml of SPR220-4.5 photoresist onto the center of the wafer, and spin at 2,000 rpm for 45 sec at an acceleration of 1,000 rpm/sec to obtain a 6.5 µm thick layer of photoresist.\nPlace the wafer on a proximity hot plate to perform a soft bake at 115 °C for 2 min.",
    "Using a photolithography contact aligner capable of front/back alignment, align the backside window mask to the front side cantilever pattern and perform a hard contact UV exposure in order to transfer the pattern from the backside window mask to the photoresist on the handle layer. Use an exposure time calculated based on exposure energy value of 480 mJ/cm2 for SPR220-4.5 photoresist.\nAfter UV exposure, let the wafers remain in a dark area for 30 min before the next processing step.\nDevelop the photoresist by immersing the wafer in a 726 MIF photoresist developer for 2 min while gently shaking the wafer back and forth.\nRinse the wafer with de-ionized (DI) water and dry it, preferably using a spin rinse dryer (SRD) tool.\nPlace the wafers in an oven at 90 °C for 12 hr.\nEtch the silicon oxide layer on the backside of the wafer using an RIE system with fluorinated gases and a recipe for etching oxide. The patterned oxide on the backside of the wafer acts as an etch mask for further processing. Inspect the wafers under a microscope to ensure that the silicon oxide in the exposed window is completely etched.\nRemove the photoresist on the edge of the wafer (up to 5 mm from the edge) using a clean room swab dipped in acetone.\nLoad the wafer in a DRIE tool with and run a recipe to etch the patterned handle layer to a depth of 500 µm with the buried oxide layer functioning as an etch stop. Split this etch into multiple runs to prevent excessive heating of the wafer, which causes inconsistent etching of the silicon. This etch step completely removes the silicon underneath the cantilevers.",
    "Perform a wet etching step using 25% dilute HF etchant, to strip the buried oxide layer below the cantilevers and the protective oxide layer on top of the cantilevers.\n\tNOTE: This step releases the bottom surface of the silicon cantilevers and also opens a window underneath to provide an access to probe the cantilever with the laser.\nRinse the wafer using a series of DI water baths and carefully dry with nitrogen. Since the cantilevers are supported only at their bases, do not use forceful sprays of DI water or inert gas directly on the cantilevers.\nCleave the individual chips from the wafer along the cleave lines produced during the handle layer etch step.\n2. Cell Culture\nPrepare 13F coverslips according to previously published methods17.\n\tNOTE: If 13F coverslips are not available, any hydrophobic surface with a contact angle above 95° can be used.\nSterilize cantilever chips and 13F coverslips in a 70% ethanol solution and allow to air dry in a flow hood.\nPlace individual cantilever chips on top of 13F coverslips inside a standard 12 well plate.\nCoat the cantilevers with the biopolymer or surface modification optimized for the cell type being used according to the standard cell culture protocols.\nRe-suspend the cells in their specific growth medium to the desired concentration.",
    "NOTE: This protocol will result in a substantial number of cells falling through the cantilever window and not adhering to the desired cantilever surface. Cell preparations should therefore be made 3-4x more concentrated than for standard coverslip preparations. For example, seeding of rat skeletal muscle satellite cells is typically carried out using a seeding density of 500 to 700 cells/square mm15,16, and are used with cantilever substrates at 2,000 cells/square mm. Optimization experiments should be carried out with new cell sources to ascertain an appropriate seeding density.\nPipette 200 μl of the cell suspension onto the cantilever chip surface, ensuring the bubble of medium covers the cantilever windows entirely. If the medium wicks through the window and doesn’t form a static bubble on top of the cantilevers replace the 13F coverslip and reattempt the plating.\nTransfer the plate containing the chips to an incubator and allow the cells to adhere for at least 1 hr (preferably 2-3 hr).\nAfter this plating period, use sterile forceps to transfer the chip to a clean well, without a 13F coverslip, and top up the culture with 1 ml of growth medium.\nReturn the plate to the incubator.\nMaintain cells according to their standard protocol for in vitro maintenance on coverslips. For skeletal muscle cells, a switch of medium composition to induce myotube formation once cells become confluent will be necessary.\n3. Setup of Hardware and Software for Cantilever Deflection Analysis\nPlace a heated culture dish into the stage of an upright electrophysiology microscope.\nAdd 3 ml of the feeding medium the cells are currently suspended in (+ 10 mM HEPES) to the heated microscope stage.",
    "Mount stainless steel electrodes on the inside of the heated culture dish at a separation distance of 15 mm and connect them to a pulse generator, capable of producing field stimulation pulses of varying intensity, frequency, and waveform, to allow the system to produce field stimulation of cells when appropriate.\nBolt a Helium-Neon laser, mounted on XY translational stages, to the underside of the microscope table and adjust it so that the laser beam is directed through the base of the heated culture dish at a 30° angle relative to the plane of the cantilever.\nBolt a quadrant photo-detector module, mounted on XY translational stages, to the underside of the microscope stage and adjust the position so that the reflected laser beam lands in the center of the 4 quadrants. Figure 2 provides an overview of the hardware set up necessary for implementing the described protocol.\nWrite a software program to control the linear actuators that scan across the cantilevers. Write the software program with reference to the flow chart provided in Figure 3. The graphical interface programmed for use with this system is provided in Figure 4.\n4. Recording Cantilever Deflection Data\nTurn on the cantilever analysis hardware and associated software.\nInsert the heated stage thermistor into the medium and wait for it to read 37 °C.\nInsert the cantilever chip into the stage with the cantilevers oriented toward the right hand side of the stage.\nTurn on the microscope light source.",
    "Focus the microscope to bring the edges of the cantilevers into view and use the laser/photo-detector control software to position the laser beam on the tip of cantilever 1. NOTE: Assuming the cantilevers are oriented to the right of the stage, cantilever 1 is the one positioned in the top left of the array and numbers run down to 16 in the bottom left. Cantilever 17 is in the top right position and runs to 32 in the bottom right (Figure 5A).\nPress “play” on the recording software.\nPosition the photo-detector so that the signal reads “0” in both x and y frames by adjusting the stepper motors controlling the photo-detector.\nSet cantilever 1 position in the laser/photo-detector control software (Figure 4).\nMove the laser to the tip of cantilever 16, repeat step 4.7., and set cantilever 16 position in the laser/photo-detector control software.\nMove the laser to the tip of cantilever 32, repeat step 4.7., and set cantilever 32 position in the laser/photo-detector control software.\nMove the laser to the tip of cantilever 17, repeat step 4.7., and set cantilever 17 position in the laser/photo-detector control software.\nTurn off the microscope light source and the overhead light in the laboratory.\nPress “record” on the recording software.\nSet the pulse generator hardware to 40 msec, 5 V pulses at a frequency of 1 Hz, and turn the machine on.\n\tNOTE: Optionally, employ optimized stimulation protocols for specific cell sources at this point, the stated settings are guidelines based on collected data using human and rodent cell sources12,13,15,16.\nUsing the laser/photo-detector control software, set the hardware to scan across the 32 cantilever array, stopping for 5 sec at each one.",
    "When the scan of the 32 cantilevers is complete, turn off the stimulator, then stop the recording software and bring up the data file.\nExamine the recorded trace from each cantilever for evidence of contractile activity. Make a note of each cantilever with positive responses. A contraction is defined as a peak if the deflection is at least 0.1 V above the baseline.\nRemove any non-responsive cantilevers from the scan protocol on the laser/photo-detector control software.\nThe active cantilevers can then be rescanned without stimulation in order to get a reading of the cell’s spontaneous contractile activity.\nRun scans with or without broad field electrical stimulation, following addition of a therapeutic compound to the medium in order to observe its effect on the functional output of the cultured cells.\nCarry out fatigue assessments by electrically stimulating the cells for extended periods and scanning levels of contractility to measure how long it takes for peak force to drop below a specific threshold.\nIn experiments where motor neurons are maintained in co-culture with muscle, measure neuromuscular junction formation through treatment of motoneuron-myotube cantilever co-cultures with a neuronal stimulant (such as glutamate) or synaptic inhibitor (e.g., D-tubocurarine) and scanning for increases and decreases in spontaneous activity respectively16.\nPerform specific scans as dictated by the needs of the planned experiments.\n5. Analysis of Cantilever Deflection Data\nUse modified Stoney’s equations15 (detailed below) to convert raw cantilever deflection data (in Volts) into a readout of stress in the cell layer or myotube (in Pascals), and a direct measurement of cellular contractile force (in nano-Newtons) :\nimgsrc://cloudfront.jove.com/files/ftp_upload/51866/51866eq1.jpg Equation 1\nimgsrc://cloudfront.jove.com/files/ftp_upload/51866/51866eq2.jpg Equation 2",
    "Where δ = cantilever tip deflection and stress produced by the myotube, σc = stress produced by the myotube, assuming a uniform thick film the full width of the cantilever, Cdetector = the system-specific coefficient relating voltage to laser position on the photo-detector, θ = the angle of the laser and detector relative to the plane of the cantilever, ESi = the elastic modulus of silicon, tSi =the thicknesses of the cantilever, tf= myotube thickness, vSi =poison’s ratio of silicon, L = cantilever length, P = path length of laser from cantilever tip to detector, and wSi = the width of the cantilever. A schematic explaining the terms used in these equations is provided in Figure 6.\nAssuming the myotube is a uniform film, the force in the myotube is equal to the force in the film, leading to Equation 3, by equating the calculation of force from stress and the assumed cell cross sectional area that was used for the application of Stoney’s equation.\nimgsrc://cloudfront.jove.com/files/ftp_upload/51866/51866eq3.jpg Equation 3\nFollowing functional data collection, fix cantilever chips for immunocytochemical analysis or utilize cells for protein or DNA analysis using standard techniques.\nOptionally, return the cells to the incubator instead of preparing for molecular analysis in order to reassess functional performance at a later time-point.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}