{
  "id": 2755,
  "origin_website": "Cell",
  "title": "A transcription-based approach to purify R-loop-containing plasmid DNA templates in vitro",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nIn vitro transcription\nTiming: 3 h\nTranscription of the R-loop forming element is under the control of T7 promoter and terminator sequences. In this step the element will be transcribed and excess unannealed RNA will subsequently be digested with RNaseA.\nSet up a 250 μL transcription reaction as follows:\ntable:files/protocols_protocol_2267_4.csv\n5x transcription buffer contains 200 mM Tris-HCl pH 8.0, 30 mM MgCl2, 50 mM NaCl and 10 mM spermidine, and is supplied with the enzyme.\nIncubate at 37 oC for 30 min.\nPrevent re-initiation events by adding 0.3 μM T7 lysozyme (20 mM Tris-HCl pH 7.9, 10% glycerol, 125 mM NaCl, 1 mM DTT). Incubate at 37 οC for 10 min.\nCritical: The effective concentration of T7 lysozyme can be determined by titrating T7 lysozyme into transcription reaction, as described in Figure 2[href=https://www.wicell.org#fig2].\nAdjust the salt concentration to 0.4 M NaCl from 5 M NaCl stock and add RNase A at a final concentration of 10 μg/mL. Incubate at 37 οC for 20 min.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2267-Fig3.jpg\nFigure 3. RNase A titration\n50 μL transcription reactions were set up as in Step 1. After the NaCl salt concentration was increased to 0.4 M, RNase A was added at the indicated concentrations and incubation continued at 37 °C for 20 min. The reactions were stopped by addition of 0.8 U proteinase K and incubation for 30 min at 37 °C. Reactions were extracted with phenol:chloroform and 5 μL of aqueous phase of each reaction was digested with BsaAI and separated on a 0.8% native agarose gel and stained with ethidium bromide. RNase A treatment digests the free RNA into small fragments that can be separated from the R-loop template by gel-filtration.",
    "Critical: The increased salt concentration will restrict the activity of RNase A towards RNA:DNA hybrids and promote the targeting of free RNA (Figure 3[href=https://www.wicell.org#fig3]).\nAdd 4 U of Proteinase K (NEB) to deproteinize the sample. Incubate at 37 οC for 30 min.\nPurification of R-loop templates\nTiming: 3 h\nThis step involves fractionation of the transcription reaction through a homemade size exclusion column packed with Sephacryl™ S–1000 Superfine resin. In principle, any gel filtration resin that has a similar pore size can be used to separate R-loop containing plasmid template from free digested RNA.\nCritical: Because the size exclusion columns are prepared under non-sterile conditions, we prefer to pack the columns with resin immediately before use.\nCritical: The resin can be regenerated by treatment with NaOH and isopropanol as described below to avoid contamination of subsequent preparations with proteinase K.\nColumn preparation (Figure 4[href=https://www.wicell.org#fig4]):\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2267-Fig4.jpg\nFigure 4. Schematic of gel filtration setup for purification of large R-loop-containing plasmid templates\nA reservoir filled with 10 mM Tris-HCl pH7.5 is placed at a higher altitude compared to the column to apply pressure flow on the column. Tubing connects the reservoir to the flow regulator. A smaller piece of tubing seals the connection between the flow regulator and the column. S-1000 resin is packed in Costar® 2 mL pipettes. A frit cut to the size of the pipette is used for resin support. 200 μL fractions are manually collected.\nTo regenerate resin prior to use, wash the resin with 0.5 column volumes (CVs) of 0.2 M NaOH and 0.5 CV 30% isopropanol.\nNote: The resin is typically regenerated after it is packed in the column.\nWash with 2 CV de-ionized water. Equilibrate the column with 10 mM Tris-HCl pH 7.5.",
    "Cut a disposable column frit to fit in the 2 mL pipette and place frit at bottom of pipette for resin support.\nUsing a Pasteur pipette, pack the column with 1.8 mL (bed volume) S-1000 resin.\nCritical: While pouring the column, be careful not to include any air bubbles.\nPurification:\nConcentrate the transcription reaction to ∼100 μL using an Amicon spin concentrator.\nCritical: To ensure R-loops are not excluded during the concentration step, we use centrifugal concentrators with 3K cutoff.\nFill the reservoir and the attached tubing with 10 mM Tris-HCl pH 7.5.\nGently apply the concentrated reaction mix to the top of the column using a Pasteur pipette.\nCritical: Ensure not to introduce air bubbles.\nFill the top of the column with 10 mM Tris-HCl pH 7.5 and gently connect the tubing from the reservoir, making sure not to introduce any air bubbles.\nOpen the flow regulator and initiate fractionation. Manually collect ∼200 μL fractions (8–12 drops).\nRun 5 μL of each fraction on a 0.8% agarose gel.\nStain with ethidium bromide to visualize the elution profile (Figure 5[href=https://www.wicell.org#fig5]). R-loop-containing plasmid templates are typically found in fractions 3–5.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2267-Fig5.jpg\nFigure 5. Elution profile of R-loop containing plasmid template\n5 μL of each fraction from a gel filtration run were separated on 0.8% native agarose gel and stained with ethidium bromide. R-loop containing plasmids elute early, in fractions 3–5, while free RNA fragments elute later, in fractions 7–9. Fractions containing the R-loop-containing template are pooled, concentrated and stored in small aliquots at −20 °C.\nPool the fractions containing the R-loop-containing plasmid and concentrate to ∼100 μL using a spin concentrator. Store at −20°C in small aliquots.",
    "Optional: Inclusion of 60 μCi [α-32P]-GTP in the transcription reaction can be used to radiolabel the RNA in R-loop templates to facilitate probing of the RNA moiety. In this case, the gel-filtration step will also help eliminate unincorporated radio-nucleotides.\nNote: To maintain the stability of the R-loops, we prefer to avoid freeze-thawing of the final sample and store it in small aliquots at −20°C. Purified R-loop need not be to flash frozen with liquid nitrogen.\nPause point: The proteinase K-treated transcription reaction can be stored at −20 οC until further processing. The packed and washed column can be stored at 4 οC for 24 h. Cover with parafilm to ensure the column does not dry and crack."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Protein Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}