{
  "id": 16978,
  "origin_website": "Jove",
  "title": "Continuous Telemetric In Utero Tracheal Pressure Measurements in Fetal Lambs",
  "procedures": [
    "The protocol adhered to the Australian National Health and Medical Research Council Australian code for the care and use of animals for scientific purposes18. The University of Western Australia Animal Ethics Committee prospectively approved the protocol (RA3/100/1596). Sheep were sourced from the University of Western Australia (UWA) Ridgefield farm (2018-2020). The sheep were introduced to the AAALAC-accredited UWA Large Animal Facility 2-3 weeks prior to surgical intervention. Sheep were initially housed indoors in shared raised floor pens, with single pens used in the peri-operative period. Sheep were fed pellets, oaten chaff, and lupins with a mineral mix calculated on body weight. Rooms were controlled for temperature (20.5-21.5 °C) and maintained on a 12:12 h light: dark cycle. Pain and well-being were evaluated in the postoperative period twice daily for 7 days, then daily until study completion. Monitored postoperative parameters included signs of pain, orbital tightening, respiratory effort, temperature, heart rate, the surgical site, appetite and water intake, activity, lameness, coat condition, fecal consistency, preterm labor, demeanor, and signs of pregnancy toxemia. The scores attributed to each parameter triggered an intervention where necessary.\nNOTE: Two recovery surgical procedures were required: ewe preparation, surgical approach and closure, and ewe recovery are the same for both surgical procedures. The first procedure is the surgical creation of the diaphragmatic hernia in the fetal lamb. The second procedure is for placement of the fetal intervention and pressure monitoring device.\n1. Surgical creation of the diaphragmatic hernia in the fetal lamb\nEwe preparation\n\t\nAt ~80 days gestation, premedicate the ewe with an intramuscular injection of acepromazine (0.04 mg/Kg) and morphine (0.3 mg/Kg).\nInduce anesthesia intravenously with ketamine (5 mg/Kg) and midazolam (0.25 mg/Kg).",
    "Intubate the ewe trachea with an endotracheal tube (8 mm inner diameter [ID]). Maintain anesthesia with isoflurane (1%-3% in oxygen) delivered by positive pressure ventilation (10-12 breaths/min, tidal volume 8-10 mL/kg).\nEstablish ewe monitoring with an electrocardiogram (ECG), invasive arterial blood pressure, expired CO2, peripheral oxygen saturation, and temperature during surgery.\nPlace the ewe supine on the gurney. Loop ropes around the ewe's legs and gently secure to the table.\nShear wool from the ewe's abdomen and flank and then clip it close to the skin.\nRemove dirt and lanolin from the ewe's abdomen, flank, and groin with soap and water.\nGive cefazolin (20 mg/Kg) intravenously every 90 min during surgery.\nTransfer the ewe to the surgical theatre on a gurney.\nMove the ewe from the transport gurney to the surgical table.\nPlace ewe in dorsal recumbency position on the surgical table.\nSecure all limbs to the surgical table with soft rope ties.\nAseptic preparation of the exposed abdomen: Wash 3 times with 4% chlorhexidine surgical scrub, removing contaminated solution between each wash with 70% alcohol.\nComplete sterile preparation by lightly spraying 10% iodine solution on the abdomen, flank, and groins.\nCover the ewe with a sterile fenestrated surgical drape so that only the abdominal incision site is exposed. Ensure that all surgical instruments, catheters, syringes, and solutions used during surgery are sterile.\nSurgical approach\n\t\nEstablish line-block local anesthesia by local subcutaneous and muscular infiltration of bupivacaine (5%; 9.5 mL) with a 10 mL syringe and 22 G needle.\nExpose the uterus by a para-midline abdominal incision (8-11 cm) through the ewe's skin, subcutaneous tissue, and linea alba made with a size 10 surgical blade with cautery as required to minimize incisional bleeding.\nDiaphragmatic hernia creation\n\t\nLocate the fetal head/thorax via palpation.\nCover the uterus with sterile plastic wrap.",
    "Use surgical scissors to make a window (6 cm x 4 cm) in the plastic wrap.\nMake a 5-7 cm uterine incision through the uterus and amniotic sac with cautery cutting, avoiding uterine blood vessels and placental cotyledons.\nExteriorize the fetal head and forelimbs.\nUse Babcock uterine clamps to seal the uterine incision edges and sterile plastic wrap tightly around the fetal abdomen to prevent amniotic fluid loss.\nPosition the fetus on its right side and secure a second sterile plastic wrap over the exteriorized fetus to reduce loss of heat and moisture. Identify the intercostal space between the 9th and 10th ribs on the left and cut a hole in the plastic wrap with surgical scissors to access the intended fetal incision site.\nEstablish line-block local anesthesia in the fetus by local subcutaneous and muscular infiltration of bupivacaine (5%; 0.25 mL diluted to 0.5 mL with sterile saline; 1 mL sterile syringe and 27 G needle) in the 9th intercostal space immediately adjacent to the upper border of the 10th rib to avoid subcostal vessels.\nUse a 60 mL sterile syringe to bathe the exposed fetal skin with warm Hartmann's solution (5-10 mL every 5-10 min) to keep the fetal skin moist throughout subsequent steps.\nCreate a left posterolateral thoracotomy by making a 2-4 cm skin incision with a size 15 surgical blade in the 9th intercostal space immediately adjacent to the cranial border of the 10th rib. Use cautery as required to minimize incisional bleeding.\nUse mosquito hemostats to bluntly dissect the subcutaneous tissue, intercostal muscles, and pleural membrane to access the diaphragm.",
    "Use two small mosquito hemostats to pick up the diaphragm at each end of the intended 1 cm long hernia site and cranially elevate the diaphragm to keep it away from the underlying stomach, liver, and spleen.\nMake a 1 cm incision between the two hemostats using small angled scissors.\nRelease the hemostats holding the diaphragm.\nUse atraumatic Potts forceps to pull the stomach superiorly through the hole in the diaphragm.\nUse a single tie of absorbable 5-0 polydioxanone monofilament (RB-1 taper point needle) to carefully envelop the 9th and 10th ribs to oppose the fetal ribs, avoiding the underlying lung.\nClose thoracotomy incision with a mattress suture (absorbable 5-0 polydioxanone monofilament).\nSurgical closure\n\t\nReturn the fetus to the amniotic sac.\nAdminister intra-operative meloxicam (0.25 mg/Kg; subcutaneously) to the ewe for postoperative analgesia.\nReplace lost amniotic fluid using warmed Hartmann's solution (~50 mL) along with intra-amniotic Piperacillin/Tazobactam (1000 mg/125 mg).\nAppose the opposing surfaces of the chorioamnion and adjacent uterine walls and use an absorbable polyglactin 910 braided 2-0 suture with an inverted mattress suture to close the uterus and amniotic sac together.\nClose the ewe's linea alba, subcutaneous tissue, and skin (absorbable polydioxanone monofilament 1, absorbable poliglecaprone 25 monofilament 3-0, and nonabsorbable polypropylene monofilament 2-0 respectively).\nEwe recovery and monitoring\n\t\nSpray the abdominal wound post-operatively with waterproof dressing retention tape and cover it with a dressing to reduce the risk of postoperative wound infection.\nApply a transdermal fentanyl patch (100 µg/h) to the groin for additional postoperative analgesia.\nRecover the ewe and extubate when breathing spontaneously, then allow it to wake.\nMonitor ewes daily until delivery for fetal intervention surgery.\nRemove sutures after 14 days.\n2. Placement of the fetal intervention and pressure monitoring device\nEwe preparation for fetal intervention surgery at 101 days of gestation",
    "Inject medroxyprogesterone (1 mL) intramuscularly at ~85 days of gestation (term ~147 days) to reduce the risk of preterm birth.\nUse the same anesthetic and surgical preparation procedure used for the initial diaphragm creation surgery.\n\t\t\nFollow the surgical approach in steps 2.1.2.2 and 2.1.2.3, similar to steps 1.2.1-1.2.2.\nEstablish line-block local anesthesia by local subcutaneous and muscular infiltration of bupivacaine (5 %; 9.5 mL) with a 10 mL syringe and 22 G needle.\nWith a para-midline abdominal incision (8 - 11 cm) adjacent to the abdominal incision site used for the diaphragm creation surgery, expose the uterus with a through the ewe's skin, subcutaneous tissue, and linea alba made with a size 10 surgical blade with cautery as required to minimize incisional bleeding.\nAdditionally, administer oxytetracycline (20 mg/Kg) intramuscularly to the ewe to provide fetal antimicrobial protection against the chronically implanted monitoring device.\nDevice activation\n\t\nActivate pressure measurement device19.\nClamp pressure measurement tubing with hemostats.\nPlace the entire device into a sterile bowl containing a mixture of 0.08% peracetic acid and 1% hydrogen peroxide for at least 1 h, ensuring the entire device is covered.\nUsing a sterile clamp, move the device to a sterile bowl containing sterile water for at least 10 min prior to fetal implantation. Ensure the entire device is covered with sterile water.\nSurgical approach and fetal intervention\n\t\nExteriorize the fetal head by hysterotomy using the same surgical approach used for the initial surgery but with adjacent uterine incisions (steps 1.1-2.2).\nKeep the exteriorized fetal head and neck wrapped in the sterile plastic drape to minimize loss of temperature and fluid.\nInstrument the trachea with a catheter for pressure measurements (Figure 1).\n\t\t\nFor unoccluded trachea, follow steps 2.3.3.2-2.3.3.3.",
    "Intubate the fetal lamb with a 5 French (1.67 mm ID) suction catheter with the suction connector removed to a depth of 14 cm at the corner of the lamb's mouth.\nConnect the external end of the catheter with a 1.59 mm (outside diameter, OD) to 3.18 mm (OD) connector to 30 cm long 3.18 mm (ID) silicone tubing.\nFor cccluded trachea, follow steps 2.3.3.5-2.3.3.6.\nIntubate the fetal lamb with a 3.0 microcuff endotracheal tube with the connector removed to a depth of 14 cm to a corner of the lamb's mouth.\nConnect the external end of the catheter with a 3.18 mm (OD) to 3.18 mm (OD) connector to 30 cm long 3.18 mm (ID) silicone tubing.\nConnect the other end of the 30 cm long 3.18 mm (ID) silicone tubing to the pressure measurement device by a 3.18 mm (OD) to 1.59 mm (OD) connector on the pressure measurement device.\nSuture the catheter at the corner of the lamb's mouth and neck (nonabsorbable nylon monofilament 4-0).\nSecure the pressure measurement device to the lamb's skin on the chest (nonabsorbable nylon monofilament 4-0) (Figure 2).\nClose the fetal and ewe surgical incisions as per initial diaphragmatic hernia creation surgery (steps 1.4- 1.5).\nTest device\n\t\nTest if the device is transmitting signal19.\nEwe recovery and monitoring\n\t\nRecover the ewe as per the initial surgery.\nMonitor ewes daily until delivery.\nGive a second dose of medroxyprogesterone (0.5 mL) intramuscularly at ~120 days of gestation.\nGive betamethasone (5.7 mg) intramuscularly 48 h and 24 h before cesarean delivery to promote fetal maturation for postnatal care.\nLamb delivery\n\t\nAt ~142 days of gestation (term ~147-150 days), pre-medicate ewe by intramuscular injection of acepromazine (0.03 mg/Kg) and morphine (0.3 mg/Kg).",
    "Induce anesthesia intravenously with thiopental (10-15 mg/Kg), intubate the ewe with an endotracheal tube (size 8.5 mm), and maintain anesthesia by isofluorane with appropriate monitoring per earlier anesthetics.\nProceed with surgical delivery of the fetus via hysterotomy as per previous surgeries, with ewe in dorsal recumbency (steps 1.1 - 2.2).\nRemove the monitoring device. Clean the device with water and 70% ethanol.\nData\n\t\nDownload data to a laptop and analyze19. Filter the pressure data using a 6-h window. Compute the difference in pressure between amniotic and tracheal pressures.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}