{
  "id": 17378,
  "origin_website": "Jove",
  "title": "Comparing Objective Conjunctival Hyperemia Grading and the Ocular Surface Disease Index Score in Dry Eye Syndrome During COVID-19",
  "procedures": [
    "The present study was conducted following the declaration of Helsinki, and the protocol was approved by the Institutional Review Board at Solutions (IRB, 2021/09/14). The study followed the reporting guidelines of the Declaration of Helsinki. All the participants provided informed consent for the questionnaire. The survey was conducted entirely online via the Internet. If the participants met the eligibility requirements, the consent forms, research project flier, and OSDI questionnaire were emailed to them. After submitting the consent forms and completing the OSDI questionnaire, a $10 gift credit card was issued online for completing the survey.\n1. OSDI survey for DES evaluation\nUse the following criteria: low OSDI score (0-20 points); moderate OSDI score (21-45 points); high OSDI score (46-100points).\n\tNOTE: The diagnostic criteria for DES by OSDI score is ≥13.\nAsk the eligible subjects to fill out the survey online (Table 1).\n2. Determination of limbal redness via AOS software\nTake a picture of the eyes, one eye at a time.\n\tNOTE: The picture has to be clear for the analysis.\nAssign the subject an ID number. Save the subject ID.\nTo add a subject, click on the Add tab.\n\tNOTE: The system automatically generates the patient ID.\nFill in the Title tab. Fill in the First name and the surname.\nFill in the date of birth.\nFill in the email address, and then confirm the email address.\nFill in the National Health Service ID (NHS ID) and the Medical Record Number (MRN) number.\nFill in the Note tab. Then, click on Save.\nNow, select the Subject ID. Then, add/view images. Then, click on + Add.\nUpload the images to the AOS software (see Table of Materials) to evaluate the limbal redness. Upload the right eye first, then the left eye.",
    "Click on the New Exam tab. Then, click on the Image + tab.\nAdd the right eye, and then click on the Selected Media tab.\nClick on the Bulbar icon. Then, click on the Area tab. Click on Analysis Bulbar Redness Grading Scale 0-4.\nClick on the image to start at the limbal area close to the pupil border and follow a pattern to cover the limbal area (Figure 1). Then, click on Save Analysis.\n\tNOTE: The redness grade and the % of vessels are saved.\nClick on the Redness Map and Save Analysis.\nClick on Generate Report. Click on both images to generate PDF.\n\tNOTE: The PDF report includes the patient's first name, surname, date of birth, Patient ID, NHS number, and by whom the patient was examined. The PDF report also includes the examination date and examination type.\nRepeat Steps 2.9-2.22; then, add the left-eye image.\nGrade the limbal redness using the AOS software. Analyze the images for bulbar conjunctival redness with a validated objective grading software using the \"bulbar redness\" function in the limbal areas of the conjunctiva, using an automatic continuous grading from 0-4 in 0.1 unit.\n\tNOTE: Grade 0 is minimum redness; Grade 4 is severe redness (Figure 1). Grades 0-1 are coded grade I, Grades 1-2 are coded grade II, Grades 2-3 are coded grade III, and Grades 3-4 are coded grade IV to match the OSDI survey grading system.\n3. Statistical analysis\nCollect the data and analyze the data using Microsoft Excel.\n\t\nSummarize the Subject ID, age, gender, race, OSDI score, and the limbal redness in one table.\nCalculate the age, OSDI score, and the limbal redness score mean using Excel software.\nDetermine the mean ± standard deviation of the age, OSDI score, and limbal redness score.\nCalculate the prevalence rate in percentage.",
    "Divide the number of subjects by the total number of subjects (40), and then multiply by 100.\n\t\t\nDivide the number of subjects with low DES (LDES) by the total number of subjects (40), and then multiply by 100.\nDivide the number of subjects with moderate DES (MODDES) by the total number of subjects (40), and then multiply by 100.\nDivide the number of subjects with severe DES (SDES) by the total number of subjects (40), and then multiply by 100.\nPerform the linear regression analysis using Excel software to determine the mean of the two values (x-axis) and the difference between the two means (y-axis). Also, determine the p-value.\n\t\tNOTE: The linear regression analysis determines the relationships between the OSDI score and the AOS redness score.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}