{
  "id": 9471,
  "origin_website": "Jove",
  "title": "Mitochondria-associated ER Membranes (MAMs) and Glycosphingolipid Enriched Microdomains (GEMs): Isolation from Mouse Brain",
  "procedures": [
    "The following protocol is intended for the isolation and purification of MAMs and GEMs from mouse brain.\nSolutions required for Isolation of mitochondria, MAMs and GEMs.\nFractionation to obtain crude mitochondrial preparation:\nSolution A:  0.32 M Sucrose, 1 mM NaHCO3, 1 mM MgCl2, 0.5 mM CaCl2 + Protease Inhibitors (add fresh, as needed).\nSolution B:  0.32 M Sucrose, 1 mM NaHCO3 + Protease Inhibitors (add fresh, as needed).\nMAMs Isolation:\nIsolation Medium:  250 mM Mannitol, 5 mM HEPES pH 7.4, 0.5 mM EGTA, 0.1% BSA.\nGradient Buffer:  225 mM Mannitol, 25 mM HEPES pH 7.5, 1 mM EGTA, 0.1% BSA (final concentration).\nGEMs Isolation:\nGEM Extraction Buffer:  25 mM HEPES pH 7.5, 0.15 M NaCl, 1% Triton X-100 + Protease Inhibitors (add fresh, as needed).\nGEM Solubilising Buffer:  50 mM Tris-HCl, pH 8.8, 5 mM EDTA , 1% SDS + Protease Inhibitors (add fresh, as needed).\n1. First Step Subcellular Fractionation: Removal of Nuclei, Unlysed Cells and Cellular Debris\nEuthanize mouse in CO2 chamber.\n  \nImmediately remove brain, halve, place in 2 ml tubes on ice and weigh. \nNote: Keep brain halves separate throughout the entire procedure. The following applies to the treatment of a single brain half. \nPlace half brain in a pre-chilled 2 ml glass Dounce tissue grinder containing 1 ml cold Solution A. Homogenize with 15 total strokes of a large clearance pestle. \nTransfer to a 15 ml falcon tube, on ice, and dilute homogenates up to 10 volumes w/v, e.g. 0.225 g to 2.25 ml. \nCentrifuge sample at 1,400 x g for 10 min at 4 °C.\n  \nCarefully remove the supernatant and transfer to a 30 ml round-bottom glass centrifuge tube, on ice. Make sure not to disturb the pellet.",
    "Resuspend the pellet in the same 10 volumes of Solution A. Homogenize in the same grinder, with 3-6 strokes of a small clearance pestle, 1 ml at a time. \nTransfer to a fresh 15 ml falcon tube and centrifuge at 710 x g for 10 min at 4 °C. This results in a pellet of nuclei and cell debris. \nCarefully remove the supernatant and pool with the supernatant saved in step 1.6. \n2.  Second Step: Crude Mitochondria Isolation\nCentrifuge supernatants at 13,800 x g for 10 min at 4 °C.    \nTransfer supernatant to an Ultra-Clear Beckman Centrifuge Tube, on ice \nResuspend pellet in 10 volumes Solution A. Homogenize in the same grinder, with 3-6 strokes of a small clearance pestle, 1 ml at a time. \nCentrifuge as step 2.1. \nRepeat steps 2.2-2.4. \nThe resulting pellet is an enriched mitochondrial fraction. Pool the supernatants (cytosol and ER), cover with parafilm and keep on ice.\nResuspend the pellet with 6 strokes of a small clearance pestle, in 4.8 ml/g (g is referred to the original brain weight) of Solution B, in a fresh homogeniser. \nUsing glass Pasteur pipettes, prepare a Discontinuous Sucrose Gradient in an Ultra-Clear Beckman Centrifuge Tube, adding subsequently to the bottom of the tube as follows, carefully, ensuring no bubbles are formed:\n    Resupended Pellet (0.32 M Sucrose)\n    3 ml 850 mM Sucrose (in 1 mM NaHCO3)\n    3 ml 1 M Sucrose (in 1 mM NaHCO3)\n    3 ml 1.2 M Sucrose (in 1 mM NaHCO3)",
    "Centrifuge at 82,500 x g for 2 hr at 4 °C. The resulting separation at the end of the gradient will produce three bands and a pellet: 1) myelin and other membrane contaminants (0.32 M - 0.85 M interface); 2) ER, Golgi, plasma membranes (0.85 M - 1 M interface); 3) synaptosomes (1 M - 1.2 M interface); 4) crude mitochondria (pellet) that is used for the subsequent purification steps\n    \n  \n3. Isolation of Mitochondria-associated ER Membrane, MAMs\nResuspend the freshly isolated crude mitochondria from one brain half, in 2 ml Isolation Medium containing freshly added protease inhibitors. \n  \nPrepare a 30% Percoll gradient with Gradient Buffer 8 ml per half brain, and place in an Ultra-Clear Beckman Centrifuge Tube. \n* Note: Make gradient buffer more concentrated (1.43 times) to achieve correct final concentration after diluting Percoll to 30%.\nLayer mitochondrial suspension on top of prepared gradient SLOWLY to avoid any bubbles.\nCentrifuge at 95,000 x g for 30 min, 4 °C.\n  \n Remove the Heavy Fraction (lower band) FIRST with a glass Pasteur pipette and transfer to a fresh round-bottom glass tube, on ice.\n  Remove the Light Fraction (upper band) SECOND with another glass Pasteur pipette and transfer to a separate fresh round-bottom glass tube, on ice. \nDilute both fractions collected in step 3.5 with 10 ml Isolation Medium and centrifuge at 6,300 x g for 10 min at 4 °C.\n  \nDiscard the supernatant from the Heavy Fraction obtained in step 3.6, resuspend the pellet with another 10 ml Isolation Medium and centrifuge again, as step 3.6. The resulting pellet will be the pure mitochondrial fraction. \nTransfer the supernatant from the Light Fraction obtained in step 3.6 to an Ultra-Clear Beckman Centrifuge Tube, on ice. Discard the pellet.",
    "Add sufficient Isolation Medium to the supernatant obtained in step 3.8 to fill the tube and centrifuge at 100,000 x g for 1 hr, 4 °C. The resulting pellet will be the MAMs fraction. Carefully remove and discard the supernatant. \nNote: At this step, you may also centrifuge at 100,000 x g for 1 hr, 4 °C the supernatant saved at step 2.6. The pellet will be the ER fraction and supernatant the Cytosolic fraction.\n4. Extraction of Glycosphingolipid-enriched Microdomains, GEMs \nLyse pure mitochondria and/or MAM fractions in 500 μl-1 ml of Extraction Buffer for 20 min on ice.\nCentrifuge lysates at 15,300 x g for 2 min at 4 °C.  \nCollect supernatants (Triton X-100 soluble material) and re-centrifuge pellets for 2 min to remove remaining soluble material. (Triton X-100 extracted Mitochondria and/or Triton X-100 extracted MAMs).\nSolubilize pellets in Solubilising Buffer. This solubilized material represents the GEM fractions and can be used for further analysis.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}