{
  "id": 2982,
  "origin_website": "Cell",
  "title": "Protocol for genome-scale in vivo CRISPR screening       to study protection of beta cells under autoimmunity in a type 1 diabetes mouse model",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nGeneration of a luciferase reporter NIT-1 cell line\nTiming: 2–3 weeks\nThe following steps describe the production of luciferase lentivirus in HEK293FT cells (step 2) and luciferase lentiviral transduction in NIT-1 cells (step 3).\nNIT-1 (#CRL-2055) and HEK293FT (#R7007) cell lines were obtained from ATCC and Thermo Fisher Scientific, respectively. Maintain cells in DMEM (Gibco, 10313039), supplemented with 10% fetal bovine serum (FBS, Gibco), GlutaMAX (Gibco), and penicillin/streptomycin (Corning), in a 37°C incubator with 5% CO2.\nNote: NIT-1 insulinoma cell line was derived from female NOD mice, which is suitable for autologous transplantation to the NOD background mouse strains.\nPreparing luciferase lentivirus.\nChoose Lenti-luciferase plasmids carrying a favorable drug selection marker from Addgene, such as Addgene: 21474 - pLenti-CMV V5-luciferase-Blast, or a homemade lenti-luciferase plasmid.\nDay 1: Seed 2 × 106 HEK293FT cells into a 100 mm dish with the maintenance media. The cells are expected to achieve 70%–80% confluency after 24 h incubation at 37°C with 5% CO2.\nDay 2: Replace the culture media with 9 mL fresh maintenance media and add 1 mL (10% of total media volumn) DNA/PEI transfection mixture (See materials and equipment[href=https://www.wicell.org#materials-and-equipment] section).\nPrepare the luciferase plasmid and the lentiviral packaging at a 1:1 ratio.\nMix the plasmid DNA with polyethylenimine (PEI) at a ratio of 1:3 in 1 mL serum-free DMEM media without antibiotics.\nIncubate the DNA/PEI mixture at RT in the biosafety cabinet for 20 min.\nAdd the DNA/PEI mixture dropwise to the 100 mm dish of HEK293FT cells.\nGently rock the plate to mix the DNA/PEI mixture evenly. Return the plate to the cell incubator located in a biosafety level 2 area.",
    "Day 4: Collect the culture media containing lentiviruses to a 15 mL sterile tube and centrifuge the tube at 270 × g for 5 min at 4°C to pellet detached cells and debris.\nRemove the plunger from a 10 mL syringe and attach a 0.45 μm filter.\nAfter centrifugation, carefully transfer the lentiviral supernatant into the 10 mL syringe from step e.\nPut the plunger into the syringe and gently push it down to create 1 mL aliquots of filtrate in 1.5 mL microcentrifuge tubes. Store the luciferase lentivirus in the −80°C freezer.\nCritical: All lentiviral procedures must be perfomed in the biosafety level 2 desinated area and specific safety procedures must be followed. All materials including culture meida, cell culture consumables, and virus stocks that may have been in contact with viral materials must be bleached before disposal. We recommend that you consult your institutional safety office for the details of the safety protocols before initiating the lentiviral procedure.\nPause point: The viral supernatant can be used immediately or stored at −80°C until needed.\nLuciferase lentiviral transduction.\nSeed the NIT-1 cells onto a 6-well plate at a density of 2 × 106 cells/well and incubate at 37°C in 5% CO2.\nNote: The cells are expected to achieve ∼80% confluency after 24 h of incubation.\nFollowing aspiration of the cultured media, add 0 (control well), 0.1, 0.2, 0.5, 1, and 2 mL of the luciferase lentiviral supernatant to the ∼80% confluent NIT-1 6-well plate. Fill each well to 3 mL volume with fresh DMEM media.\nAt 48 h post-transduction, replace the culture media with fresh DMEM media containing the selection marker, such as 4 μg/mL Blasticidin.\nOnce all control cells are dead, stop the drug selection process right away by replacing the drug-containing media with fresh DMEM media.",
    "Note: You should be able to find that all cells in the control wells are dead by 3–5 days post-selection.\nPick the well with the lowest viral amount added.\nGrow these tranduced cells for transplantation and in vivo bioluminescence imaging.\nOptimization of in vivo autoimmune killing of NOD-derived NIT-1 beta cells\nTiming: 2–3 weeks\nThe following steps describe the setup and imaging procedure of in vivo autoimmune beta cell killing in a NOD mouse model.\nCritical: Induction of autoimmune diabetes in NOD mice may be affected by environmental factors, such as gut microbiota.4[href=https://www.wicell.org#bib4] Therefore, we recommend to optimize the screening time frame for the efficiency of in vivo beta cell autoimmune killing in the experimental conducting sites.\nIn vivo autoimmune killing model setup. Troubleshooting 1[href=https://www.wicell.org#sec6.1].\nUse trypsin to detach the luciferase-expressing NIT-1 cells and resupend 107 luciferase-expressing NIT-1 reporter cells in 200 μL sterile DPBS.\nPrepare fresh purified diabetic NOD splenotyes.\nRemove the spleen from a diabetic NOD mouse and use a sterile surgical blade to cut it into 3–4 pieces.\nAdd the pieces to 5 mL sterile cold DPBS in a 15 mL falcon tube.\nTake a 25 mm petri dish and place a 70 μm cell strainer inside the dish.\nPour out the spleen pieces and DPBS onto the cell strainer.\nRemove the excess DPBS from the dish.\nAdd 2–3 mL of RBC lysis buffer onto the strainer.\nUse the plunger end of a 5 mL syringe to grind the spleen through the cell strainer.\nRinse the strainer with 1 mL sterile cold DPBS.\nTransfer the suspended cells from the dish to a 15 mL falcon tube.\nKeep grinding and washing untill the liquid in the dish runs clear, transferring all rinses into the same tube.",
    "Centrifuge the falcon tube at 505 × g for 5 min at 4°C.\nOptional: If the cell pellet is still red and the supernatant is not clear (Figure 1[href=https://www.wicell.org#fig1]A), resuspend it with 1 mL of RBC lysis buffer and add DPBS and centrifuge again. Repeat 2 times if needed to get a pink cell pellet with clear supernatant (Figure 1[href=https://www.wicell.org#fig1]B).\nCount the cells and resuspend 107 diabetic NOD splenocytes in 200 μL sterile DPBS.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2523-Fig1.jpg\nFigure 1. Lysis and removal of red blood cells during the splenocyte purification\n(A) The cell pellet was not completely washed, as shown with a crimson or red color and cloudy supernatant.\n(B) The cell pellet presented a pink color with clear supernatant was ready for the next step: resuspension and counting.\nStore the isolated splenocytes on ice (up to 5 h) for the injection.\nNote: In general, we recommend using the isolated splenocytes as soon as possible. Splenocyte isolation from one recent-onset diabetic NOD mouse may generate at least 8-10 × 107 splenocytes. However, the number and activity of splenocytes starts to decline after diabetic onset. We recommend not isolating splenocytes from NOD mice that have been diabetic for over 7–10 days.\nCell injection.\nSubcutaneously transplant 107 luciferase-expressing NIT-1 reporter cells into each 8-week-old female NOD.scid recipient mouse.\nInject intravenously 107 diabetic NOD splenocytes in 200 μL sterile DPBS to induce autoimmunity. For a non-autoimmune control group, designate some NOD.scid mice to receive just the subcutaneously transplanted mutant NIT-1 cells, without intravaneously injected splenoctyes.\nin vivo bioluminescence imaging.\nDissolve D-luciferin (Gold Biotechnology, Cat#LUCK-3G) into sterile DPBS (without calcum or magnesium) to a final concentration of 15 mg/mL and filter sterilize (0.22 μm).\nFor bioluminescence imaging, inject D-luciferin intraperitoneally into mice transplanted with luciferase-expressing cells, at a dose of 150 mg/kg.",
    "Measure ioluminescence using an IVIS Spectrum imaging system. The following example images were taken at day 1, 8 and 15 post-injection, as shown in Figure 2[href=https://www.wicell.org#fig2].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2523-Fig2.jpg\nFigure 2. Autoimmune killing of NIT-1 cells in NOD mice can be visualized by bioluminescence imaging\nBioluminescence imaging of 107 NIT-1 cells transplanted subcutaneously into NOD.scid mice. Transplanted cells were engineered to carry a CMV-luciferase reporter. Some recipient mice were also injected intravenously with 107 splenocytes isolated from spontaneously diabetic (DM) NOD mice to cause beta cell killing. Images were taken at day 1, 8 and 15 post-injection. The Day 1 image was adapted from: ‘Cai et al., Genome-scale in vivo CRISPR screen identifies RNLS as a target for beta cell protection in type 1 diabetes, 2020, Nat Metab.’1[href=https://www.wicell.org#bib1]\nNote: To avoid missing the optimal autoimmune killing window, we recommend imaging the graft every other day for the initial experiment. More than 90% of the transplanted NIT-1 cells are expected to be immune-destructed by day 15 post-splenocyte injection.\nAmplification of pooled sgRNA library\nTiming: 2 days\nThe following steps describe the preparation and amplification of a pooled sgRNA library obtained from Addgene.\nPooled sgRNA library transformation.2[href=https://www.wicell.org#bib2]\nElectroporate the library at 50 ng/μL using Endura ElectroCompetent cells following the manufacturer’s directions[href=https://biosearchtech.a.bigcontent.io/v1/static/manual_COMCEL-002_Endura-Competent-Cells].\nPre-warm 1 large ampicillin+ LB agar plate (245 mm square bioassay dish) per electroporation of the sgRNA library at 37°C (Repeat for a total of 1 electroporation per 10,000 sgRNAs in the library).\nIncubate the electroporated competent cells at 37°C for 1 h, mix well by inverting.\nAdd same volume of LB medium to the electroporated competent cells, mix well by inverting for 5–10 times, plate 2 mL of electroporated competent cells on each large LB agar plate (245 mm square bioassay dish).",
    "Incubate the LB agar plates in an incubator at 37°C for 12–16 h.\nCalculate electroporation efficiency.\nDilute the electroporated competent cells for a 1000-fold dilution: add 5 μL of the electroporated competent cells to 495 μL of LB medium, mix well. Then add 100 μL of 100-fold dilution to 900 μL of LB medium (1000-fold dilution).\nPlate 100 μL of the 1000-fold dilution electroporated competent cells to a pre-warmed small ampicillin+ LB agar plate (100 mm Petri dish). In total, plate 10 small ampicillin+ LB agar plate.\nIncubate the LB agar plates in an incubator at 37°C for 12–16 h.\nOn the next day, count the number of colonies on 10 small ampicillin+ LB agar plate, then multiply the number by 1000.\nNote: The ready-made GeCKO-A v2 library from Addgene contains 65,383 sgRNAs. It is recommended that each sgRNA be amplified at least 100 times. Thus, the A pool library should yield at least 6.54×106 colonies after transformation before the next step. If amplifying a custome library, it is recommended that at least 500 colonies per sgRNA in the library should be obtained.2[href=https://www.wicell.org#bib2]\nHarvest colonies from the LB agar plates.\nPipette 7 mL of LB medium onto each large LB agar plate. Gently scrape the colonies off and transfer the liquid into a 50 mL tube.\nRepeat step 3a twice for a total of three LB medium washes.\nPrepare conical flasks with 500 mL LB medium with ampicillin, one for each large LB plate.\nTransfer the bacteria suspension to the flasks by dividing equally among them.\nShake the conical flasks in a shaker incubator at 37°C at a speed of 200 RPM for 8–12 h.",
    "To collect, centrifuge the 8–12 h culture at 3,400 × g for 10 min. Discard the supernatant and proceed by following the ZymoPURE II Plasmid Maxiprep Kit’s manufacturer’s directions[href=https://files.zymoresearch.com/protocols/_d4202_d4203_zymopure_ii_plasmid_maxiprep.pdf]. Approximately 2 large LB agar plates’ worth of bacteria can be condensed into 1 maxiprep.\nQuantify the plasmid DNA by Nanodrop.\nPause point: The maxiprepped sgRNA library can be stored at −80°C for several years.\nNote: Using an endotoxin-free plasmid kit is important for later virus production.\nOptional: Next-generation sequencing of the sgRNA library for quality confirmation. The GeCKOv2 library was generated and quality confirmed by the Feng Zhang lab.3[href=https://www.wicell.org#bib3] You may repeat the step of quality confirmation by following the published protocol.2[href=https://www.wicell.org#bib2] In this protocol, the pre-screening controls are used in step 12 for quality control of the sgRNA copy number and coverage of the prepared sgRNA library.\nCRISPR lentiviral library production and titration\nTiming: 1–2 weeks\nThe following steps describe the selection of the optimized dosage of antibiotics in NIT-1 cells (step 8), the procedure to prepare a large-scale of concentrated CRISPR lentiviral library (step 9) and the calculation of the produced viral library titer (step 10).\nPerform an antibiotic (puromycin) killing curve.\nSeed NIT-1 cells at 50% confluency in media containing a range of puromycin concentrations typically used for selection (0.5–10 μg/mL).\nRefresh media with puromycin every 3 days. After around 1 week, choose the lowest concentration of puromycin sufficient to kill all NIT-1 cells.\nNote: It is important to use the lowest concentration of puromycin to kill all cells to avoid providing extra stress on the target cells.\nLentivirus production on HEK293FT cells.\nExpand HEK293FT cells to five 150 mm petri dishes at 70%–80% confluence.\nRefresh the culture media (10% FBS containing DMEM) with 17 mL media for each 150 mm dish.",
    "For each 150 mm dish: add the pooled sgRNA library, lentivirus packaging plasmids and PEI in 2 mL serum-free DMEM. Mix immediately by vortexing or pipetting (See materials and equipment[href=https://www.wicell.org#materials-and-equipment] section).\nIncubate the DNA/PEI mixture for 20 min at 20°C–25°C, then add the DNA/PEI mixture to the HEK293FT cells.\nContinue to incubate the HEK293FT cells for 48 h. Collect the supernatant containing viral particles in a 50 mL conical tube and centrifuge at 1,200 × g for 5 min to remove cell debris.\nGently add another 17 mL media to the 150 mm dish and incubate for another 24 h. Collect the supernatant containing viral particles in a 50 mL conical tube and centrifuge at 1,200 × g for 5 min to remove cell debris. Combine the 48 h and 24 h supernatants and filter through a 0.45 μm syringe filter.\nAfter filtration, add 8.75 mL of 50% PEG 10000 solution, 3.72 mL of 4 M NaCl, and 4 mL of DPBS to 35 mL of media for a total volume around 51 mL.\nMix the media and centrifuge solution by inverting, and put the 50 mL conical tubes into the 4°C cold room at least 12 h.\nOn the second day, centrifuge the 50 mL conical tubes at 1,500 × g for 30 min at 4°C.\nDiscard the supernatant and spin down again at 1,500 × g for 5 min at 4°C.\nCarefully remove the residual PEG solution and resuspend the lentiviral pellet in cold, sterile DPBS (1% of original vol., e.g., for 35 mL media, add 0.35 mL DPBS to resuspend the pellet).",
    "Note: Lentivirus can be alternatively concentrated by ultracentrifugation.5[href=https://www.wicell.org#bib5] However, the PEG precipitation protocol is more easy-to-handle and an efficient way to purify large volumes of lentivirus using a common centrifuge at speed of 1,500 × g (There are several protocols and kits are available, such as PEG-it™ Virus Precipitation Solution, Cat. # LV810A-1/ LV825A-1).\nPause point: The concentrated virus can be stored at −80°C for several years.\nCalculation of lentiviral titer. Troubleshooting 2[href=https://www.wicell.org#sec6.3].\nPlate 6 wells of a 6-well plate at a density of 5 × 105 NIT-1 cells in DMEM medium per well.\nIn each well add 20, 10, 5, 2.5, 0 and 0 μL (6th well as no-puromycin selection control) of lentivirus solution.\nFill to a total volume of 3 mL with DMEM medium, and supplement with 10 μg/mL polybrene.\n2 days after virus infection, replace the medium with DMEM containing puromycin (2.0 μg/mL or your optimized concentration) into the virus-infected NIT-1 cells. Leave the 6th negative control well untreated (without puromycin).\n3 days after starting the puromycin selection, when the 5th well (negative control) contains no live cells, and the 6th well (no-puromycin selection control) is 80%–90% confluent, rinse the cells with DPBS.\nAdd 500 μL of trypsin to each well and incubate at 37°C for 2 min to dissociate the cells. Add 2 mL of DMEM and mix well.\nMix 1 part cell suspension with 1 part trypan blue and incubate at 20°C–25°C for 3 min.\nCount and record the number of live cells in each well using the TC20 Automated Cell Counter.\nCalculate the lentiviral titer based on the cell viability as the number of cells in the puromycin treated well divided by the number of cells in the 6th negative control untreated well (without puromycin).",
    "Note: The cell viability may be alternatively measured by a cell viability kit, such as Promega CellTiter-Glo 2.0 Cell Viability Assay (Cat# G9242).\nIn vivo screening of cells with the CRISPR GeCKO-A lentiviral library\nTiming: 12–14 weeks\nThe following steps describe the generation of mutant NIT-1 cells using a genome-scale CRISPR knockout lentiviral library (step 11), the transplantation of mutant NIT-1 cells to NOD.scid mice and diabetes induction (step 12), and the process of graft genomic DNA extraction and preparation for next-generaiton sequencing (steps 13–18).\nTransduction of cells with the sgRNA lentiviral library.2[href=https://www.wicell.org#bib2],3[href=https://www.wicell.org#bib3],6[href=https://www.wicell.org#bib6] Troubleshooting 3[href=https://www.wicell.org#sec6.5].\nPrepare NIT-1 cells in five 150 mm petri dishes at 70%–80% confluency.\nAdd the appropriate volume of lentivirus solution from step 10g to each 150 mm dish at MOI = 0.3, and supplement with 10 μg/mL polybrene.\nIncubate the NIT-1/lentivirus mixture at 37°C.\n2 days after virus infection, replace the medium with DMEM containing puromycin (2.0 μg/mL) into the virus-infected NIT-1 cells.\n3 days after puromycin selection, replace the medium with DMEM every 3 days until the cells recover to 80%–90% confluency.\nCritical: To ensure that most cells receive only one sgRNA, transduce the sgRNA library at MOI = 0.3. Scale up the sgRNA library coverage so that each sgRNA is expressed by more than 400 cells. For example, for a library size of 10000 unique sgRNAs, transduce 1.34 × 107 cells at an MOI of 0.3.\nCRISPR GeCKO-A lentiviral library infected NIT-1 cells in vivo screen. A schematic of the screening procedure is shown in Figure 4[href=https://www.wicell.org#fig4].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2523-Fig3.jpg\nFigure 3. PCR amplication of pooled GeCKO gRNA\nThe PCR amplicons of the pooled GeCKO gRNA (∼270 bp) are separated on a 2% agarose gel. The sizes of DNA ladder are shown as reference on the left.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2523-Fig4.jpg",
    "Figure 4. Genome-scale CRISPR/Cas9 screen of beta cell survival in the autoimmune NOD mouse model\nNIT-1 cells transduced with the mouse GeCKO-A CRISPR lentiviral library (MOI = 0.3) and selected with puromycin. Three 107 NIT-1 mutant cell aliquots were collected as pre-screening controls. 107 NIT-1 mutant cells were transplanted subcutaneously (SubQ) into each NOD.scid recipient mouse, with or without intravenous injection of 107 splenocytes from diabetic NOD mice. After 8 weeks, NIT-1 grafts were retrieved from recipients with (autoimmune) and without (non-autoimmune) splenocyte co-injection. Amplify the sgRNA library by PCR for next-generation sequencing.\nPre-screening controls: save three of 107 mutant NIT-1 cell aliquots into three 1.5 mL Eppendorf tubes and store the cell pellets at −80°C to be used later in step 12f.\nSubcutaneously transplant 1 × 107 mutant NIT-1 cells into each 8-week-old female NOD.scid recipient mouse.\nIntravenously inject 1 × 107 of diabetic NOD splenocytes at the same time to induce autoimmunity.\nNote: Designate some NOD.scid mice with subcutaneously transplanted mutant NIT-1 cells to serve as a non-autoimmune group, and do not inject them with splenocytes.\nIsolate diabetic NOD splenocytes from spontaneously diabetic female NOD mice as described in step 4.\nResuspend 1 × 107 of diabetic NOD splenocytes in 200 μL sterile DPBS.\nMonitor the blood glucose of mice for 8 weeks, at least 2 times per week.\nNote: Mice in the non-autoimmune group may become hypoglycemic due to the transplanted graft expansion after ∼3–6 weeks. The hypoglycemic control mice should be immediately taken out for graft retrieval. Please consult your institutional IACUC office for handling hypoglycemic animals. Mice in the autoimmune group usually develop diabetes in 6–8 weeks in our institute. You may adjust the screening timeframe in reponse to the diabetes onset time point in NOD mice housed in the experimental site.",
    "Terminate the screen at 8 weeks post-transplantation. Retrieve the remaining grafts from both the autoimmune group and the non-autoimmune group of mice.\nNote: We recommend including at least three to five animals per group for screening.\nExtract the genomic DNA from the pre-screening control pellets and grafts using the Quick-gDNA midiprep kit (Zymo Research), following the manufacturer’s protocol[href=https://files.zymoresearch.com/protocols/_d4075_quick-dna_midiprep_plus_kit.pdf].\nCritical: After screening, the surviving grafts may be variable in size, but in general they are very small grafts. Use sterile surgical tools for graft retrieval and avoid DNA contamination during the genomic DNA purification process.\nOptional: To enhance the visibility of transplanted grafts, you may use luciferase-expressing NIT-1 cells for in vivo autoimmune screening. However, the reporter line has been pre-selected by an additional drug selection marker (puromycin is needed for the CRISPR library transduction), which may affect the cell sensitivity to stress and growth rate. Alternatively, you many generate a luciferase-expressing NIT-1 reporter line using a Rosa26 knock-in strategy to avoid double drug selections.\nA two-step PCR method is used to amplify the sgRNA for next-generation sequencing (NGS). Troubleshooting 4[href=https://www.wicell.org#sec6.7].\nPerform the first PCR amplification of the pre-screening cell genomic DNA and the graft genomic DNA according to the following PCR program:\ntable:files/protocols_protocol_2523_3.csv\nNote: See the primer sequences in key resources table[href=https://www.wicell.org#key-resources-table] section.\nCritical: To reduce the PCR error, especially for low copy numbers of CRISPR-sgRNA sequences, prepare three PCR reactions for each genomic DNA sample if possible.\ntable:files/protocols_protocol_2523_4.csv\nCombine and mix the three 100 μL PCR products in a 1.5 mL Eppendorf tube. Use the mixed 1st PCR products for the second PCR amplification.\ntable:files/protocols_protocol_2523_5.csv",
    "Note: NGS-Lib-KO-Fwd primer (1–10 mix) and NGS-Lib-KO-Rev (Barcoded (bolded)) sequence can be found in Table 3 from a previous publication2[href=https://www.wicell.org#bib2] and also listed in key resources table[href=https://www.wicell.org#key-resources-table] section. Equally mix NGS-Lib-KO-Fwd primer #1–10 for NGS and use different barcoded NGS-Lib-KO-Rev primer to label each sample.\nPerform the second PCR amplification of the genomic DNA according to the following PCR program:\ntable:files/protocols_protocol_2523_6.csv\nRun the resulting PCR products on a 2% (wt/vol) agarose gel. Run the gel at 120 V for 30 min at 20°C–25°C.\nGel purification: visualize the gel using a Transilluminator and carefully cut out the ∼270 bp product (Figure 3[href=https://www.wicell.org#fig3]).\nNote: The PCR may generate non-specific products. Gel purification is highly recommended.\nExtract gel DNA using the Zymoclean Gel DNA Recovery Kit according to the manufacturer’s directions[href=https://files.zymoresearch.com/protocols/_d4001t_d4001_d4002_d4007_d4008_zymoclean_gel_dna_recovery_kit.pdf].\nPause point: The gel-extracted DNA samples can be stored at −20°C for several months or at −80°C for long term.\nSequence the samples on the Illumia HiSeq/NovaSeq system.\nAnalyze sequencing data with MAGeCK to count sgRNA number7[href=https://www.wicell.org#bib7] as described in step 14. Troubleshooting 5[href=https://www.wicell.org#sec6.9].\nNote: We work with our institutional bioinformatics department to analyze the sequencing results."
  ],
  "subjectAreas": [
    "Metabolism",
    "Sequencing",
    "Immunology",
    "Crispr"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}