{
  "id": 9466,
  "origin_website": "Jove",
  "title": "Stereotaxic Injection of a Viral Vector for Conditional Gene Manipulation in the Mouse Spinal Cord",
  "procedures": [
    "The surgical procedure described has been approved by the Institutional Animal Care and Use Committee (IACUC) of Columbia University.\n1. Preparation of Equipment and Virus Particle Suspension\nClean and disinfect the equipment, sterilize the surgical instruments and the V notch spikes that will be used to fix vertebra L1.\nPull and bevel glass pipettes. We use pipettes that have a tip diameter of 40 μm and are beveled at an angle of 20°. Sterilize the glass pipettes.\nSet up the stereotaxic frame, mount the microsyringe injector onto the manipulator and connect the injector to the controller.\nAttach one of the glass pipettes to the microsyringe using the compression fitting kit.\nRemove the plunger from the microsyringe and fill the syringe with mineral oil. Oil Red O (1-(2,5-dimethyl-4-(2,5-dimethylphenylazo)phenylazo)-2-naphthol) may be added to the mineral oil to increase its visibility. Reinsert the plunger and push it to all the way to the tip. Carefully avoid creating an air bubble.\nPrepare the virus particle suspension in a biosafety cabinet. Thaw the frozen virus on ice and, just before use, dilute it with sterile phosphate-buffered saline to the desired particle concentration.\nInsert the microsyringe into the holder on the injector.\nPipette 5 μl of the virus suspension onto a small plastic sheet, e.g. Parafilm. Lower the glass pipette tip into the drop and pull the plunger to fill the microsyringe. Create a small air bubble at the pipette tip to prevent it from clogging.\n2. Laminectomy\nPrepare the surgery area by wiping bench and heating pad with disinfectant.\nAnesthetize the mouse. We use inhalation anesthesia with isoflurane (3% during induction, 2%-3% during maintenance).\nPlace lubricant on each eye to protect the eyes from drying during the operation.",
    "Shave the fur from the lower back to the neck of the mouse and disinfect the skin with alternating wipes of a topical antiseptic such as chlorhexidine or povidone-iodine and 70% ethanol. Isolate the aseptically prepared site with surgical drape and infiltrate the incision site with bupivacaine (0.25%, diluted 1:10 with physiological saline).\nIncise the skin at the caudal end of the rib cage along the midline (2-3 cm) and separate the fascia covering the spine.\nBecause the spinal cord stops growing earlier during postnatal development than the vertebral column, spinal segment L4 lies underneath the first lumbar vertebra (L1). Vertebra L1 is located caudal to the vertebra that holds the last pair of ribs. Identify and expose vertebra L1 by removing the small spinal muscles and ligaments attached to its dorsal surface.\nSlightly lift and hold vertebra L1 with an Adson forceps. Use a dedicated laminectomy forceps to remove the dorsal portion of the vertebra (spine and lamina) and expose the spinal cord. Avoid damaging the spinal cord.\nTransfer the mouse onto the heating plate in the stereotaxic frame. Monitor the temperature of the mouse during the subsequent operation.\n3. Injection\nFix vertebra L1 with V notch spikes. The spikes must stabilize the spine so that the vertebra does not move during breathing.\nBring the microsyringe closer so that the pipette tip is above the laminectomy site. Lower the plunger until you see the virus suspension exiting the pipette. Remove the droplet with a sterile cotton tip.",
    "Position the pipette tip at the rostral-most portion of the exposed spinal cord. Center the pipette above the posterior median sulcus, then move the tip 500 μm laterally. Lower the tip to the surface of the cord and puncture the dura mater or, if you are working with an unbeveled glass pipette, use a beveled steel cannula to puncture the dura. Lower the tip of the glass pipette 300 μm into the spinal cord.\nInject 1 μl of virus suspension at a rate of 200 nl/min.\nAt the end of the injection, wait at least 2 min before slowly retracting the pipette.\nRepeat steps 3.3 to 3.5 at the caudal-most portion of the exposed spinal cord to achieve complete distribution of the viral vector in spinal segment L4. The two injection sites are located rostral and caudal of the L4 segment to avoid tissue damage in the target region.\n4. Wound Closure\nRelease vertebra L1 from the V notch clamps and remove the mouse from the stereotaxic frame.\nSuture the fascia with 5.0 vicryl. The closed fascia provides cover for the laminectomy site.\nClose the skin with nylon sutures or surgical staples.\n5. Postoperative Care\nTransfer the mouse to a recovery cage with soft, nonparticular bedding. Place it on the side for comfortable breathing. Monitor the animal until it is fully alert, ambulant and starts drinking.\nWe provide postsurgical analgesia for 72 hr with daily subcutaneous injections of carprofen (5.0 mg/kg).\nMonitor postsurgical recovery by daily inspection for the first 3 days, then every other day or 3 days per week until the experiment is complete.\nRemove the skin sutures or staples 7 to 10 days after the operation, when wound healing is complete.\nEuthanize the animal after completion of the experiment.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}