{
  "id": 8743,
  "origin_website": "Jove",
  "title": "Quantitative Cell Biology of Neurodegeneration in Drosophila Through Unbiased Analysis of Fluorescently Tagged Proteins Using ImageJ",
  "procedures": [
    "1. Considerations and Preparations for Designing the Image Analysis Experiment\nPredetermine suitable anatomical, cellular, or subcellular markers to serve as landmarks for standardizing a region of interest (ROI) across different samples, for example 4',6-diamidino-2-phenylindole (DAPI), membrane markers, localized fluorescent protein, etc.\nSelect a fluorescent marker that can delimit discrete puncta beyond background levels for the structure of interest.\n\tNOTE: This protocol is optimized for proteinaceous structures (e.g., misfolded protein aggregates) and membrane-bound organelles (e.g., autophagy reporter). To visualize protein aggregation, an RFP-tagged N-terminal fragment of human Htt protein with a pathogenic polyQ tract of 138 repeats (RFP-hHttQ138) was used5. The mutant Htt protein forms cytoplasmic aggregates when expressed under neuronal specific drivers such as elav-GAL45,6. To visualize autophagosome-lysosome flux, actin-GAL4 was used to ubiquitously drive expression of the tandem mCherry-GFP-Atg8a reporter. mCherry- and GFP-positive puncta indicate autophagosomes, and the flux is monitored as GFP fluorescence is quenched in the acidic environment of the lysosome, where acid-insensitive mCherry remains until the protein is degraded7. For ratiometric analysis, a single channel that is a consistent marker of the structure can be used for segmentation, or if appropriate a projection of two or more channels can be used to delineate structures, though not explicitly described in this protocol. In this example, mCherry is used for segmentation of Atg8-positive particles, as it is acid-insensitive and will remain in the compartment throughout flux through the pathway.\nDownload and install the open source image analysis platform ImageJ or Fiji — the preferred distribution of ImageJ with bundled plugins2,3.\nInstall the plugin for h-maxima interactive watershed.\n\tNOTE: This protocol uses Fiji; additional plugins may be required for ImageJ. The plug-in developed by Benoit Lombardot for SCF-MPI-CBG is available online (https://imagej.net/Interactive_Watershed).",
    "Navigate to \"Help | Update\", select \"Manage update sites\" from the \"ImageJ Updater\", choose the SCF-MPI-CBG update site from the list, and then close and restart Fiji.\n2. Brain Dissection and Immunofluorescence Staining\nMake silicone elastomer-lined dissection dishes.\nPour silicone elastomer components into a beaker as indicated by the manufacturer and stir well until thoroughly mixed.\nUse a pipette to fill 5 cm tissue culture dishes one-third to half full (about 10 mL of elastomer mixture). Allow any bubbles to ascend to the surface and gently remove with tissue paper. Cover the dishes and place them on a level surface to cure for 48–72 h at room temperature (RT).\nDissect Drosophila brain, and visual system if needed.\nPerform Drosophila brain dissection as previously described8,9. Perform the dissection in elastomer-lined dissection dishes, using an elastomer bottom to stabilize the brain to avoid damaging tissue or forceps.\nTo keep the lamina intact during dissection, slide two forceps under the retina and gently tear through the middle of the eye to remove the retina. Pull away any retinal tissue attached to the lamina with forceps held parallel to the lamina surface.\n\t\tNOTE: Residual pigment will wash off in the following steps and usually does not interfere with antibody staining and imaging.\nDilute 37% formaldehyde in phosphate-buffered saline (PBS) to make a final concentration of 3.7% fresh before use in a 500 µL microcentrifuge tube. Transfer the dissected brain to microcentrifuge tube with fix solution and incubate for 15 min at RT with gentle rocking.\n\t\tNOTE: Formaldehyde has a natural tendency to be oxidized, producing formic acid. Therefore, it is suggested to aliquot the 37% formaldehyde for storage and dilute to 3.7% freshly before each use. Over-fixation or under-fixation will affect the integrity of the tissue and fluorescence10.",
    "Wash 3 times with PBTx (PBS with 0.4% Triton X-100) for 15 min each.\nPerform immunohistochemistry and mount specimens.\nIf antibody staining is needed, remove PBTx, add primary antibody diluted in PBTx with 5% normal goat serum, and incubate on an aliquot mixer overnight at 4 °C.\nRemove primary antibody and wash 3 times with PBTx for 15 min each. Add secondary antibody diluted in PBTx with 5% normal goat serum and incubate for 1 h at RT or overnight at 4 °C. Wash 3 times with PBTx for 15 min each.\nIf DAPI staining is needed, remove PBTx, add DAPI solution (stock solution: 5 mg/mL, dilute to a working concentration of 15 µg/mL in PBTx), and incubate for 10 min at RT. Wash 3 times with PBTx for 15 min each.\nTo clear the tissue, place a drop of mounting medium onto the center of a microscopy slide with a spacer of one layer of clear tape on both sides. Transfer the brain onto the drop of mounting medium, and wait for 1–2 min until the brain becomes transparent. Carefully remove the mounting medium with a pipette.\nTo mount, apply a drop of fresh mounting medium onto the brains on the slide. Carefully overlay a cover glass avoiding bubbles. Seal the edges with rubber cement, and air-dry at RT for 20 min. Proceed to image acquisition for best results.\n3. Image Acquisition\nOptimize microscope acquisition parameters, including spatial resolution, objective, zoom, scanning speed, and step size, to maximize resolution of the structures of interest to facilitate semi-automated segmentation during image analysis.",
    "NOTE: It may be useful to capture a sample image and test semi-automated segmentation (in Step 5 of this protocol) before imaging all experimental samples. In this way the user can adjust imaging settings so that analytical tools can readily discern the biological structure of interest.\nAdjust image detector controls to capture the highest signal-to-noise ratio and highest dynamic range of the specimen.\nUse a LUT (look up table) that indicates pixel saturation (exposure too high) or undersaturation (offset too low) while adjusting settings (Figure 3B, red indicates pixel saturation by a Hi/Low LUT).\nVerify gain and offset settings are appropriate for all experimental groups, as experimental manipulations likely alter the structure of interest.\n\t\tNOTE: It is imperative that the same settings are used for all groups to make quantitative comparisons.\nImage through the tissue to capture all data.\n\tNOTE: It is recommended to capture all of the available data during one imaging session and to define a more precise area during ROI selection in Step 4 if needed.\nSave the image as the file type supported by the imaging software in order to preserve metadata such as acquisition parameters and spatial calibration. Save the image with a file name including experimental date, genetic background, and fluorescent reporters, antibodies, or dyes corresponding to channels scanned such as [Experimental group name]_[Specimen name]_[Experiment date]_Ch1.[Fluorophore-target/Dye]_Ch2.[Fluorophore-target/Dye], etc.\n4. Fiji/ImageJ Image Import and ROI Selection\nOpen an image in Fiji. Use the \"Bio-Formats Import Options\" dialog box, choose \"View stack with: Hyperstack\" and set \"Color mode: Grayscale\".\n\tNOTE: It is recommended to open the microscope file type, as metadata such as spatial calibration can be read by Fiji.",
    "Identify an area from a single z-plane or a projection based on the marker channel(s) that can be used as a standardized ROI across specimens (Figure 1, ROI selection).\nUse the \"C\" scrollbar to view the channel(s) used to capture the marker(s) designated in step 1.1.\nUse the \"Z\" scrollbar to move through the focal planes. Choose a single slice or create a projection of multiple slices by clicking \"Image | Stacks | Z project\" and set \"Start slice\" and \"Stop slice\" to encompass the ROI.\n\t\tNOTE: Setting the \"Projection type\" to \"Max Intensity\" in the \"Z project\" dialog box is often best suited to emphasize structures for segmentation in Section 5, though this may not be appropriate for all applications. If another type of projection is required for analysis, take care to save and document this file as such for feature extraction in Section 6 and/or 7.\nGenerate a new image containing the channel(s) and focal plane(s) of interest to simplify the following steps in the image analysis protocol. Select \"Image | Duplicate\", set the desired \"Channels\" (c) and \"Slices\" (z), and change the file name to reflect the selection (e.g., [Experimental group name]_[Specimen name]_[Experiment date]_[Channel(s)]_[z-plane(s)]).\nUse one of the \"selection tools\" on the Fiji toolbar to manually select a standardized ROI based on the selection criteria determined in step 4.2.\nAdd the ROI to the ROI manager by clicking \"Analyze | Tools | ROI Manager\" and click \"Add\" on the ROI Manager menu. Save the ROI from the ROI Manager menu by clicking \"More | Save\", and then name the file to reflect the ROI (e.g., [Experimental group name]_[Specimen name]_[Experiment date]_[Channel(s)]_[z-plane(s)]_[ROI description]).\n\tNOTE: This can be reopened in Fiji for later analyses or can be applied to other channels or images as in Section 5.3.",
    "5. Preprocessing and Segmentation with h-maxima Watershedding\nPerform preprocessing on the channel used to capture the structures of interest.\nIf the image file consists of multiple channels, separate the channels by clicking \"Image | Color | Split channels\" to isolate the channel of interest.\nApply a filter such as a median filter to reduce noise or gaussian blur for smoothing by clicking \"Process | Filters | Filter type\" (e.g., \"Median Filter\" or \"Gaussian Blur\").\n\t\t\nSample different filters and filter parameters on images from each experimental group. Proceed through step 6.2 with a representative example from each group to check segmentation performance. Select the filter and settings that facilitate segmentation of the structures of interest.\nRecord the filter and settings. Apply these parameters across experimental groups.\nSave a copy of the image as a tiff file including the applied filter for reference. Use a detailed name such as [Experimental group name]_[Specimen name]_[Experiment date]_[Channel]_[z-plane(s)]_[Filter with parameters].\nPerform segmentation of structures of interest with the interactive h-maxima watershed tool on the preprocessed image generated and saved in step 5.1.\nWith the preprocessed image active in Fiji, initiate the h-maxima interactive watershed tool by clicking \"SCF | Labeling | Interactive H_Watershed\".\n\t\tNOTE: This plugin first calculates the watershed and then allows the user to explore the effects of local maxima and threshold options on segmentation through an instantly updated output image.\nFrom the control panel, adjust seed dynamics (h), intensity threshold (T), and peak flooding (%) to optimize segmentation.\n\t\tNOTE: Always refer to the raw image before preprocessing from Section 4.2 to manually inspect performance of segmentation of the structures of interest.\nWhen satisfied with segmentation results, select \"Export regions mask\" and choose \"Export\". This will generate a binary image of the watershed results (Figure 1, Segmentation).",
    "Record the segmentation parameters; these parameters need to be applied across experimental groups for quantitative comparisons. Save the binary results mask if desired for reference with segmentation parameters detailed in the name such as [Experimental group name]_[Specimen name]_[Experiment date]_[Channels]_[z-plane(s)]_[Filter with parameters]_[H_Watershed parameters].\nExtract the structures of interest from the watershed results.\nOpen the saved ROI from Step 4.4, in the ROI manager. With the binary regions mask from Step 5.2.4 active, select the ROI from the ROI manager to apply to the image to limit feature extraction to the standardized ROI.\nWith the ROI active on the binary watershed mask, choose \"Analyze | Analyze particles\" with \"Add to Manager\" selected in the dialog box to extract features.\n\t\tNOTE: This will add a particle identifier for each structure delineated during segmentation to the ROI Manager. Options are available on this menu to exclude features based on size or circularity if needed to refine structures included in the analysis.\nSave the particles by clicking \"More | Save\" from the ROI manager menu. Ensure that identifiers are deselected and all particles will all be saved in a zip file. Use a detailed name such as [Experimental group name]_[Specimen name]_[Experiment date]_[Channels]_[z-plane(s)]_[Filter with parameters]_[H_Watershed parameters]_[structures].\n6. Quantity, Area, and Intensity Quantification and Analysis\nOpen the raw image generated and saved in step 4.2. Scroll to the channel used for capturing the structures of interest.\n\tNOTE: It is critical to take intensity measurements from the raw image (before preprocessing) as applying filters in step 5.1 changes the pixel values.\nOpen the particles obtained from feature extraction in step 5.3 and select \"Show All\" from the ROI Manager.",
    "NOTE: This action will overlay an outline of each particle on the \"ROI Manager\" onto the image and should match the edges of the structures of interest (Figure 1, Feature extraction).\nSet the desired measurements by clicking \"Analyze | Set measurements\".\n\tNOTE: The area, intensity, and density of particles can be measured by choosing \"area\" and \"integrated density\". When integrated density is selected, Fiji will produce two values: ‘Integrated density’ calculated as the product of the area and mean gray value and ‘Raw integrated density’ measured as the sum of pixel values. Density of the fluorescent protein in the particles is calculated as the sum of pixel values divided by the area. The number of particles generated in step 5.3 indicates the quantity of particles within the tissue ROI defined in step 4.4.\nFrom the ROI Manager menu choose \"Measure\". The results are expressed in calibrated units as long as the measurements are taken from files derived in Fiji from the imaging software. Copy the results from the results window and paste into spreadsheet software for compilation and further calculations.\n7. Ratiometric Quantification and Data Analysis\nFollow steps 6.1 and 6.2 to open particle identifiers on the first raw channel of interest.\nSet the desired measurements by clicking \"Analyze | Set measurements\".\n\tNOTE: The average intensity per particle can be measured by choosing \"Mean Gray Value\".\nFrom the ROI Manager select \"Measure\". Copy data from results window and paste into spreadsheet software.\nMove the \"C\" scrollbar to the second raw channel of interest, GFP in this example (Figure 4A), and repeat steps 7.2. and 7.3.\n\tNOTE: The particles saved in step 5.3 will default to the channel and slice from which it was generated. Take care to ensure particles are applied to the correct channel of interest.",
    "Calculate the ratio of the intensity from one channel to the intensity of the second for each particle in the spreadsheet software.\nUse a scatter plot to visualize and quantify ratiometric data from fluorophores that exhibit individual changes reflective of underlying biological processes.\nGenerate a scatter plot in the graphing software.\n\t\tNOTE: Each data point represents a structure of interest where the intensity of the first fluorophore of interest is the \"x value\" and the intensity of the second fluorophore is the \"y value\" measured from each particle.\nSet gating thresholds for each fluorophore to define the quadrants.\nUse line profile to visualize fluorophore intensity across a structure of interest.\nSelect an ROI generated in step 5.3 and use the straight-line tool on the toolbar to draw a straight line through the ROI. Add the line ROI to the ROI Manager.\nFor each channel of interest, with the line ROI active, select \"Analyze | Plot profile\".\n\t\tNOTE: The plot profile function will generate a histogram plot and a table of the values of the intensity along the line. Copy results measured from each channel and paste into spreadsheet software to generate a plot showing both channels along the line.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}