{
  "id": 6121,
  "origin_website": "Bio",
  "title": "Characterization of Protein Domain Function via <em>in vitro</em> DNA Shuffling",
  "procedures": [
    "The outline of the protocol is shown in Figure 1.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180531/20180531182323_6713.jpgFigure 1. Scheme of DNA shuffling DNA shufflingAmplify the full length of target gene by PCRNote: Forward and reverse primers should include a restriction site for subsequent cloning.Prepare a 20 µl PCR reaction with 5x PCR buffer, 3 mM MgCl2, 200 μM deoxynucleoside triphosphates, 0.5 μM primers, and 1 U of Taq DNA polymerase.Add 1 µl DNA template.Note: Prepare DNA templates by boiling 500 µl overnight culture in 300 µl PBS for 5 min. Collect the supernatant by centrifugation at 16,000 x g for 3 min.Run PCR program (for target less than 1 kb):imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180531/20180531183010_1355.jpgPerform electrophoresis of PCR product in 1x TAE at 150 V for 15-30 min.Place the gel on a UV transilluminator (set at 365 nm wavelength).Cut DNA band and recover by gel extraction kit.Digest the 2 µg of DNA templates with 0.02 unit of DNase I and 10x DNase I reaction mixture in 100 µl reaction at room temperature for 10-20 min.Add gel loading dye.Run gel electrophoresis and recover DNA fragments of 50 to 200 bp by gel extraction kit.Reassemble the fragments by PCR without primers.Prepare a 100 µl PCR reaction with 5x PCR buffer, 3 mM MgCl2, 200 μM deoxynucleoside triphosphates, and 1 U of Taq DNA polymerase. Use 10 - 30 ng/μl of the purified fragments as template.Run the program:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180531/20180531183527_2187.jpgPurify PCR products of the correct size (depending on the size of the target gene) by gel extraction kit upon electrophoresis.Perform PCR again under conditions described above, except that 0.5 μM of each primer is used this time. Note: The protocol worked when a DNA band with a size similar to that of the target genes was observed. If the concentration of recovered DNA was low, a larger amount could be added in subsequent restriction digestion reaction.",
    "Cloning of target gene into expression vectorDigest 600 ng of PCR products and pET15b separately with 0.6 µl SacI-HF, 0.6 µl BamHI-HF and 10x CutSmart® Buffer in 20 µl reaction.Note: Include a restriction site in the forward and reverse primers if the restriction sites chosen were not present in the wild type target gene. However, the generation of restriction site was not guaranteed on reshuffled mutants.Perform gel electrophoresis and recover DNA by gel extraction kit.Ligate with 5-10 ng DNA, 20-30 ng vector, 1 µl T4 DNA Ligase and 10x T4 ligase buffer in 20 µl reaction at 16 °C overnight.Transform the vector into E. coli DH5α. Perform the transformation following the protocol provided by the manufacturer with modifications. See below:Incubate 10 µl vector with 100 µl competent cell on ice for 30 min.Heat shock for 2 min.Incubate on ice for 5 min.Add 500 µl LB broth.Incubate at 37 °C for 1 h.Select on 100 µg/ml ampicillin plates.Perform colony PCR using the same primers and condition in A1 to check the presence of insert.Perform sequencing on transformants which contain an insert. Extract plasmids by QIAprep Spin Miniprep Kit.Transform E. coli BL21 competent cell with plasmids containing a mutant gene.Antimicrobial susceptibility testsAdd 150 µl MH-IPTG into each well of a 96 well plate.Add another 150 µl MH-IPTG broth into the last column of the 96 well plate.Add antibiotic into the last column. The test range depends on resistance breakpoints of different antibiotics; 512 µg/ml is the maximum concentration used for cefotaxime.Perform two-fold serial dilution along the row.Transfer 3 ml saline into n (number of test strains) test tubes. Transfer overnight culture of test strains from MH agar to test tubes prepared in Step C5 by cotton swab to obtain a suspension with OD600 0.08-0.1.",
    "Transfer 5 µl of suspension into each well of the 96 well plate.Incubate at 37 °C overnight.Record the minimum inhibition concentration (MIC). Note: MIC is the minimal test concentration at which no bacterial growth was observed."
  ],
  "subjectAreas": [
    "Microbiology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}