{
  "id": 5900,
  "origin_website": "Bio",
  "title": "Infection of Soybean Plants with the Insect Bacterial Symbiont <em>Burkholderia gladioli</em> and Evaluation of Plant Fitness",
  "procedures": [
    "Breeding and preparation of soybean plantsPlant five soybean seeds per pot, in a total of 36 pots (180 seeds) and grow for seven days under greenhouse conditions (25 °C, 16:8 h light:dark cycle).Transfer plants to individual pots and grow for 21 days under greenhouse conditions.Select 36 plants of similar height and at developmental stage V2.Make a circular wound (5 mm diameter) in the central area of single leaflets of the first and second trifoliate leaves from each plant (Figure 1), using a robotic device that mimics insect herbivory damage (‘MecWorm’) (Mithöfer et al., 2005).Note: Alternatively, a cork borer, a paper hole punch or a sterile blade can be used for wounding.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171213/20171213214251_3305.jpgFigure 1. Schematic representation of the wounding and tissue sampling areas on a soybean plant. The scheme illustrates two wounded spots on the first and second trifoliate leaf (red regions), which had been inoculated at developmental stage V2 with B. gladioli Lv-StA in treated plants or sterile tap water in control plants. Black crosses indicate leaf areas later taken from developed soybean plants and used for FISH and quantitative PCR detection of B. gladioli Lv-StA. Note that wounding and infection were done at developmental stage V2 (only 2 fully developed trifoliate leaves present), while the scheme represents a plant at a later developmental stage, in which newer trifoliate leaves were also available for tissue sampling.Use sticky insect traps between plants to prevent potential contact with insects and thereby cross contamination between plants.Arrange plants randomly and shuffle every second day under controlled light management (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171213/20171213214415_2422.jpgFigure 2. Soybean plants organized in random order according to treatment and under controlled light conditions. The picture was acquired three weeks after inoculation.Water plants every second day with tap water.",
    "Calibration curve for determining bacterial cell concentration using optical densityNote: Constructing a calibration curve is only necessary once for a specific spectrophotometer and bacterial strain, and should be done at least four days before initial plant inoculation considering the time required for CFU counting and preparation of the bacterial inoculum for infection.Culture symbiotic B. gladioli Lv-StA in a 50 ml centrifuge tube containing 20 ml King’s B liquid medium (see Recipes) at 30 °C and constant shaking (200 rpm) for 24 h.Centrifuge the bacterial culture at 2,400 x g for 5 min. Discard the supernatant and resuspend the bacterial pellet in sterile tap water.Prepare three dilution series from 10-1 to 10-7 in 1.5 ml reaction tubes using sterile tap water (i.e., three times seven dilutions).Measure optical density (OD600) of each sample three times, and plate 50 µl per sample on Petri dishes containing King’s B medium agar.Incubate the Petri dishes at 30 °C for 48-72 h.Count colony forming units (CFU) of 3-day old cultures on King’s B medium plates (only CFU counts between 20 and 200 colonies per plate were considered).Generate a calibration curve using a linear regression of OD600 in relation to CFU count.Calculate the OD600 corresponding to 105 CFUs µl-1.Bacterial inoculum preparation and plant infectionNote: Bacterial inoculation was performed within two hours after wounding. Culture symbiotic B. gladioli Lv-StA in King’s B liquid medium at 30 °C and constant shaking (200 rpm) for 24 h (i.e., one day before plant wounding and infection).Centrifuge the bacterial culture at 2,400 x g for 5 min. Discard the supernatant and resuspend the bacterial pellet in sterile tap water.Measure the OD600 of the bacterial suspension and dilute to 105 CFUs μl-1 using sterilized tap water.",
    "Inoculate 18 plants with 10 µl of bacterial suspension each by placing a drop with a micropipette on the two wounded areas of the trifoliate leaves for each plant (Figure 1).Apply 10 µl of sterilized tap water on the two corresponding wounds of each of the 18 control plants (Figure 1).Note: The plant infection experiment was completely conducted in a biosafety level 2 laboratory given the assignment of Burkholderia gladioli to risk group 2 organisms according to German regulations (BioStoffV). Monitoring of plant fitnessMonitor plant height, as well as time to flowering, every second day until day 38 after infection (a total of 20 measurement time points including the day of inoculation).Observe potential symptoms of leaf necrosis and chlorosis (Figure 3).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171213/20171213214837_6414.jpgFigure 3. Chlorosis of single soybean leaflets treated with Burkholderia gladioli Lv-StA in comparison to a water control. Leaflets wounded and treated with sterile water are shown close after treatment (A) and 38 days after treatment (B), as well as leaflets infected with bacterial suspension close after treatment (C) and 38 days after being treated (D).Measure the chlorophyll contents on three different spots of each wounded trifoliate leaflet every second day (triplicate measurements, not on the infection area) by using a chlorophyll meter SPAD-502Plus.Count the total number of seeds from all pods 38 days after infection.Also on day 38, dry the complete plant (above- and belowground parts) at 70 °C for 24 h and measure dry weight.Important: See Note at the beginning of Procedure EQuantification of infecting bacteriaNote: Harvest two leaflets from each plant at the end of the experiment (at day 38 after inoculation) before measuring the dry weight of the complete plant (see Step D5).Cut pieces of leaflets (approximate area 1 x 1.",
    "5 cm) from different areas of each plant (see Figure 1) with sterile forceps and scissors and divide each sample into halves.Store half of each piece in sterile 1.5 ml tubes at -80 °C until further processing. Keep the other half of each piece for FISH analysis.Prepare sterile blunt 1 ml pipette tips as pestles. Flame the top of each tip shortly and then round it in 1.5 ml tubes containing DEPC treated H2O (Video 1).    <p>imgsrc:https://bio-protocol.org/javascript:;</p>   Video 1. Preparation of pestles from 1 ml sterile tips  Weigh the stored leaflet pieces individually and then homogenize each sample in 1.5 ml tubes with the previously prepared pestles by pouring liquid nitrogen directly into each tube and crushing the tissue into powder (Video 2). If necessary for complete homogenization, add additional liquid nitrogen into the 1.5 ml tube and rapidly insert the pestle in the tube for grinding. While the pestle is not in use, you may partially close the tube (not tightly) to prevent powdered leaf tissue from spurting out of the tube.    <p>imgsrc:https://bio-protocol.org/javascript:;</p>   Video 2. Plant tissue homogenization using liquid nitrogen  Extract nucleic acids using the MasterPureTM Complete DNA and RNA Purification Kit according to the manufacturer’s instructions. Perform centrifugation steps at 4 °C and resuspend DNA and RNA in Low TE-buffer (see Recipes).Perform reverse transcription on ice using the QuantiTect® Reverse Transcription Kit including a genomic DNA removal step and a corresponding control, following the manufacturer’s instructions.Conduct quantitative RT-PCR on the corresponding cDNA on a 167 bp fragment using primers Burk16S_StAG_F and Burk 3.1_R (Table 1) in a RotorGene®-Q cycler device following the protocol described for the Rotor-Gene SYBR Green PCR Kit.Table 1. Primers and probes used for amplification and fluorescence in situ hybridizationimgsrc:https://en-cdn.bio-protocol.org/attached/image/20171213/20171213222108_6979.",
    "jpgCarry out a quantitative RT-PCR consisting of an initial denaturation step at 95 °C for 10 min, followed by 45 cycles of denaturation at 95 °C for 10 sec, primer annealing at 65 °C for 30 sec and elongation at 72 °C for 20 sec. Include a melting curve with a temperature gradient from 60 °C to 99 °C within 4.25 min.Notes: DNA standards for quantification of the target fragments were obtained previously by PCR amplification and product recovery using the innuPREP Gel Extraction Kit. Purified DNA concentration was measured using a NanoDropTM 1000 spectrophotometer. Standards were used as a tenfold dilution series ranging from 10-1 to 10-8 ng µl-1.All solutions used for RNA extraction were prepared in DEPC (Diethylpyrocarbonate) treated H2O and RNaseZap® Decontamination Solution was used in order to avoid RNase contamination of equipment and workspaces. Visualization of the infecting bacteria by FISHCut and thinly slice the stem tissue of different plant regions (between 1st and 2nd trifoliates and above the 2nd trifoliate) with a razor blade in approximately 0.5 mm longitudinal sections.Fixate the sliced stem tissue and the half piece of leaflet recovered previously (see Step E1) at room temperature (RT) for 24 h in Carnoy’s fixative (see Recipes) and store at RT until further use.Wash samples at RT in 100% ethanol for 2 h and then bleach in 6% H2O2 (diluted in ethanol) for approximately 14 days. Change the bleach solution every third day.Wash the samples at RT in 100% ethanol (3 x 2 h), in 70% ethanol (2 x 1 h) and in PBS-Tx buffer (4 x 0.5 h, see Recipes).Hybridize the samples at 55 °C for 24 h in 1.",
    "5 ml tubes containing 270 µl hybridization buffer (see Recipes) with 15 µl (50 ng µl-1) of the Cy5-labeled general eubacterial probe EUB784, 15 µl (50 ng µl-1) of the Cy3-labeled Burkholderia specific probe Burk_16S (Table 1) and additionally 3 µl DAPI (0.5 mg ml-1) for host cell counterstaining.Wash samples at 55 °C in washing buffer (2 x 2 h, see Recipes) and then incubate samples in distilled H2O and a small amount (1-2 drops) of VECTASHIELD® for 2 h at room temperature.Transfer samples to a glass slide, cover with VECTASHIELD® and a cover slip, and observe samples using a fluorescence microscope (Figure 4).Notes:  Step F3 is light sensitive and should be performed under dark or dim light conditions. We recommend covering the samples with aluminium foil or similar during incubation. Decolorization with bleaching solution is essential to avoid auto-fluorescence of the plant tissue. Steps F5-F7 involve the manipulation of fluorescent probes, therefore we recommend working under dark or dim light to minimize bleaching. During and until the final washing step with distilled H2O (Steps F5 and F6), it is essential that samples do not dry out completely, as the subsequent removal of unhybridized probe might be compromised.  Some FISH probes designed for eubacteria might also hybridize to the plant chloroplasts (e.g., EUB388: 5’-GCTGCCTCCCGTAGGAGT-3’). The probe EUB784 was convenient in this sense, as no hybridization to chloroplasts was observed in silico nor in situ. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171213/20171213220439_3108.jpgFigure 4. Localization of Burkholderia gladioli cells in the soybean plant vascular system. Whole mount FISH on soybean leaf tissue showing an overlay image of hybridization with Burk_16S-Cy3 (red), EUB784-Cy5 (green) and host cell nuclei staining with DAPI (blue). The white arrow indicates Burkholderia cells in the vascular system of an infected soybean plant leaflet (A). No Burkholderia cells were observed in control plants (B).",
    "The scale bars represent 50 µm."
  ],
  "subjectAreas": [
    "Microbiology",
    "Plant Science"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}