{
  "id": 7445,
  "origin_website": "Bio",
  "title": "<em>In vitro</em> Fluid Shear Stress Induced Sclerostin Degradation and CaMKII Activation in Osteocytes",
  "procedures": [
    "Prepare sterile filtered Ringer’s solution with calcium (see Recipes).Sterile Ringer’s is stored at 4°C until use, when it is aliquoted and warmed to 37°C.Plating Ocy454 cellsOcy454 cells are maintained at 33°C, 5% CO2 on collagen-coated 150 mm dishes in complete αMEM at less than 50% confluency to maintain sclerostin expression (Figure 2).Multiple plates of the same passage of cells can be pooled together to ensure there are enough cells to plate for an experiment because they are cultured at such low density.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4251/bioprotoc-11-23-4251-g002.jpgFigure 2. Ocy454 culture confluency prior to plating for FSS experiment. Ocy454 cells should be maintained at 33°C, 5% CO2 in complete αMEM on collagen coated dishes at less than 50% confluency to maintain sclerostin expression. After plating for FSS, Ocy454 cells are cultured at 37°C, 5% CO2. Scale bar = 0.4 mm.Aspirate media of plated cells.Rinse Ocy454 cells with 10 ml of HBSS and aspirate.Add 2 ml of trypsin/EDTA solution to the 150 mm dish and swirl to cover the plate.Aspirate off extra trypsin/ETDA and allow cells to detach at 37°C, 5% CO2 for 5 min or less until all cells are free-floating.Add 2 ml of complete αMEM per 150 mm dish to neutralize trypsin/EDTA, collect cells, and transfer cell suspension to a conical tube.If multiple dishes are being pooled, combine all cells into a single conical tube for cell counting to have a homogenous cell suspension and to prevent variance due to different plates of cells used for the same experiment.Because cells are plated at such low density, using the smallest amount of media/trypsin allows for cells to be more concentrated to allow for plating in small volumes.Count cells using a cell counter or hemocytometer.",
    "Plate Ocy454 cells at a density of 125,000 cells/cm2 (40,000 cells/well in a 96-well plate) in a total volume of 200 μl/well into the necessary number of wells in 1×8 well strips 96-well plate (example plate set up is shown in Figure 5A).Culture cells overnight at 37°C, 5% CO2.Longer culture times (many labs use 14 days) at 37°C, 5% CO2 increases sclerostin protein abundance (Spatz et al., 2015).Preparing for FSS and calibrating the peristaltic pumpTurn on warming mat and oven and set both to 37°C.Aliquot the appropriate amount of Ringer’s solution into 50 ml conical tubes and warm them to 37°C.Turn on FSS pump, which will take you to the home screen (Figure 3).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4251/bioprotoc-11-23-4251-g003.jpgFigure 3. Run screen on Harvard Apparatus Pump. From this screen, you can enter the type of tubing being used, set the flow rate, time, and volume, go to the run screen, and go to the calibration screen.Ensure the tubing type is correct (recommend using Purple/Purple 2.06 mm tubing from Harvard Apparatus) and is loaded into pump cassettes.Calibrate peristaltic pump to ensure flow rate is correct (calibration is done before the FSS tips are attached).Fill a 50 ml conical tube with MilliQ water.Place one tubing inlet into the 50 ml conical and fill the entire tubing with water (ensure water comes out the outlet and that there are no large air bubbles in the tubing).Place outlet of filled tubing into an empty graduated cylinder.Go to the calibration screen by pressing the Calibration Select button (Figure 3).Under calibration tab (Figure 4A-4C), start the pump (Figure 4A), allow it to run for one minute, then stop the pump.Ensure the inlet stays in the conical tube of water and that the water does not run out, or the inlet stops taking in water.",
    "Make sure the outlet stays in the graduated cylinder.Determine the volume dispensed into the graduated cylinder, press the Enter Volume Delivered button (Figure 4B) to input the volume dispensed using the keypad buttons (Figure 4C), and press the green check button.The pump will now automatically return to the home screen as the calibration cycle is complete.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4251/bioprotoc-11-23-4251-g004.jpgFigure 4. Work flow for pump calibration. (A) The calibration screen. Press the green triangle “play” button to begin the pump. The theoretical volume dispensed will increase as the pump runs. (B) After flowing for about 1 min, press the red square “stop” button to stop the pump. Press the “Enter Volume Dispensed” button. (C) Using the number pad, enter the actual volume dispensed into the graduated cylinder and press the green check button.Settings on the pump are now reset. Set the flow rate on the pump to 35 ml/min and flow time to 1 min (Figure 3).Empty graduated cylinder back into the 50 ml conical tube of water and place the outlet tubing back into the now empty graduated cylinder and the inlet into the conical tube of water.In the run screen, run a full pump cycle for 1 min at 35 ml/min into the graduated cylinder to ensure calibration is correct.If pump is ± 2 ml from set rate, recalibrate using procedure described in Steps C5-C8.If calibration cannot be achieved within this 2 ml error, the tubing may need to be replaced and rotor lubricated.Set desired flow rate (typically 35 ml/min) and flow time (typically 1-5 min).These parameters permit assessment of rapid mechano-transduction events, such as CaMKII activation and sclerostin degradation, as described here (Lyons et al., 2017;          Williams et al., 2020;          Gould et al., 2021).",
    "Run calibration protocol before every fluid shear stress experiment or any time the pump has been turned off.Fluid Shear StressPrepare a sufficient volume of lysis buffer to lyse the appropriate number of wells of a 96-well plate using 20-30 μl of RIPA per well.Take a strip of Ocy454 cells plated into the 1×8 well 96-well plate out of the cell culture incubator and place into a new 96-well rack (Figure 5A).This allows any cells not currently being treated or exposed to FSS to remain stagnant and in complete αMEM.Move this strip of cells to the warming mat near the FSS pump and the benchtop oven.Once cells are moved into Ringer’s, experiments can be run at atmospheric CO2.Bench set-up should contain vacuum pump for aspiration, Harvard Apparatus pump, warming mat, and oven in close proximity, to allow for as much reduction of movement as possible once cells are in Ringer’s.Aspirate MEM media and fill each well to the top with warmed Ringer (each well will require about 350 μl).Place rack into the 37°C oven or keep plate on warming mat on benchtop for 15-20 min, to allow cells to equilibrate in the Ringer’s solution and to ensure any mechano-events activated by exchanging the media for Ringer’s can reset (Donahue et al., 2003).During this 15-20 min wait time, attach FSS tips to the pump tubing, ensuring the inlet and outlets on each tip are on the correct flow direction.There are arrows on the pump cassettes to indicate the inflow and outflow direction (Figure 5B).Pour warm Ringer’s into a fluid reservoir.Place the FSS tips attached to the tubing into the fluid reservoir.Place them on their sides with the inlet facing up and stagger where they lay to help prevent circulation of bubbles (Figure 5C).",
    "Fill the sets of tubing with warmed Ringer’s solution, ensuring all bubbles are removed from the tubing.Each tube takes about 3 ml of Ringer’s to fill completely.Start and stop the pump as needed; you do not need to run a full timed cycle to fill the tubing and FSS tips.Insert the 3D tips into every other well as FSS tips do not fit flush to the plate if they overlap (Figures 1C, 5D). Indeed, this orientation allows for the adjacent well, lacking a FSS tip, to be used as the time/treatment matched no flow control (Figure 5D).Push the FSS tip straight down into the well. Do not wiggle the FSS tip once it is in the well, as this may introduce bubbles. Ensure the lip of the FSS tip is flush with the top of the well and is secure with no bubbles in the well (Figure 1C).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4251/bioprotoc-11-23-4251-g005.jpgFigure 5. Set-up of 96-well plate and pump for FSS. (A) A single 1×8 strip that is seeded with Ocy454 cells is moved into a new rack for transfer to the benchtop for FSS. Media is replaced with Ringer’s prior to FSS. (B) FSS tips are connected to the tubing, ensuring the long inlet on the tip is connected to the inlet direction of the pump. (C) To fill up the tubing and FSS tips with Ringer’s before placing into wells for FSS, place them on their side in a Ringer’s filled solution reservoir. This allows for fewer bubbles to be taken up into the tubing and makes it easier to fill the tubing efficiently. (D) FSS tips are placed into every other well so they can sit flush with the top of each well. The wells without a FSS tip can then act as time/treatment matched no flow controls.",
    "NF – no flow control, FSS – well exposed to FSS.Start the pump and apply FSS.After FSS ends and the appropriate post flow incubation has occurred [e.g., we find that after FSS, immediate lysis or lysis after 10 min allows us to assess CaMKII activation and/or sclerostin protein loss (Lyons et al., 2016         and 2017;          Williams et al., 2020;          Gould et al., 2021)], aspirate the Ringer’s from each well, both no flow and FSS wells.If waiting to lyse cells, remove FSS tips, but do NOT aspirate Ringer’s, and keep the plate flat and unmoved on the warming mat for desired time before aspirating off Ringer’s for lysisTo lyse cells, quickly add 20-30 μl of the prepared lysis buffer to each well and place entire plate onto iceUsing a new pipette tip for each well, or each set of pooled wells, scrape the monolayer of cells to ensure sufficient lysis, and transfer lysate into labeled Eppendorf tubes.To increase cell lysate amount to allow for increased sclerostin abundance or increased sample volume for multiple western blots, two or more wells of cell lysates can be pooled together. Ensure the same number of wells are pooled for each no flow and FSS sample.Discard used FSS Ringer’s solution. Alternatively, this can be collected to analyze secreted factors.Start and stop the pump as needed to remove all Ringer’s from the tubing.Repeat FSS (section D) protocol for as many 1×8 strips as necessary.The 15-20 min wait times can be staggered as needed to be more time efficient.After all samples are collected, they can be processed for western blotting to evaluate cellular responses.After the last batch of cells is subjected to FSS, remove all Ringer’s from the tubing.",
    "Rinse all tubing and FSS tips with MilliQ water by running a 1-min protocol, then empty tubing of all liquid.Detecting sclerostin degradation by western blottingSonicate samples using a probe sonicator on ice, centrifuge at 15,000 RPM for 2 min in a benchtop centrifuge to pellet the cell debris, and collect the supernatant in a different tube.Add sufficient volume of 4× Laemmli Sample Buffer +β-mercaptoethanol to a final concentration of 1×.Add 100 μl β-mercaptoethanol to 900 μl of 4× Laemmli Sample Buffer to result in a final concentration of 355 mM β-mercaptoethanol.Heat samples to 95°C for 5 min and cool on ice before running on a Tris/Glycine SDS-PAGE gel.Transfer using a semi-dry method onto PVDF membranes.After transfer, dry membranes completely for at least 2 h or overnight.Rewet membranes in methanol, rinse with water to remove excess methanol, and block in 5% non-fat milk + 3% BSA in 1× PBS + 0.1% Tween-20 for 1 h at room temperature (RT) with shaking.Notes:  A blocking solution with 5% non-fat milk + 3% BSA is required to detect sclerostin, as non-fat milk alone is not sufficient. For detection of other targets, such as CaMKII, 5% milk in 1× PBS + 0.1% Tween-20 is sufficient.Use R&D System sclerostin primary antibody at 1:500 in 5% non-fat milk + 3% BSA in 1× PBS + 0.1% Tween-20 and shake overnight at 4°C.Wash three times for 5 min with 1× PBS + 0.1% Tween-20 at room temperature with shaking.Incubate with anti-goat HRP secondary at 1:1000 in 5% non-fat milk + 3% BSA in 1× PBS + 0.1% Tween-20 and shake at room temperature for 1 h at RT.Wash three times for 5 min with 1× PBS + 0.1% Tween-20 with shaking at RT.Rinse with water and image using WestFemto ECL reagent (Figure 6).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4251/bioprotoc-11-23-4251-g006.jpgFigure 6.",
    "Representative western blots of FSS-Induced Sclerostin Degradation. Ocy454 cells were exposed to 5 min of FSS at 35 ml/min and lysed immediately after the end of FSS. Sclerostin abundance was detected by western blotting with the R&D Systems anti-Sclerostin antibody (n = 2).Possible experimental adaptationsRT-qPCRInstead of lysing in 1× RIPA + 2% SDS + HALT protease/phosphatase inhibitor buffer, use 100 μl of cold TRIzol to lyse the cells. Then, proceed with RNA isolation, reverse transcription, and RT-qPCR analysis.Live cell imagingWhen plating Ocy454 cells, use an optically clear, glass-bottom 96-well plate. Cells can be labeled with a nuclear stain, calcium indicators, reactive oxygen species indicators, etc., and can then be subjected to FSS while on an inverted scope that can image in timelapse. This will allow for the monitoring of live cell responses. FSS rate and time can be adjusted to optimize cellular responses for the indicator used.Analysis of secreted factorsFollowing FSS, flow buffer from each tubing and supernatant from no flow wells can be collected in conical tubes and used for analysis of secreted factors. Important to note is to consider the differences in volume between the FSS tubing and the no flow wells. Incorporate a dilution factor into the analysis protocol to compensate for the different volume.Treatment with pharmacological inhibitorsTo determine the contribution of certain signaling proteins or cellular responses, cells can be treated with pharmacological inhibitors prior to FSS. If the treatment time is longer than 20 min, pretreat cells in complete MEM at 5% CO2 and 37°C. Then, for the last 20 min of the treatment time, aspirate off drugged media and fully fill wells with drugged Ringer’s solution. Allow cells to equilibrate for 20 min at 37°C, then apply FSS with drugged Ringer’s as described above.",
    "Drugged Ringer’s should be used for FSS application to ensure wash-off and reversal of inhibition do not occur."
  ],
  "subjectAreas": [
    "Cell Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}