{
  "id": 5848,
  "origin_website": "Bio",
  "title": "An Affinity-directed Protein Missile (AdPROM) System for Targeted  Destruction of Endogenous Proteins",
  "procedures": [
    "Generation of AdPROM constructs for constitutive expression in cellsPreparation of insertsSynthesise the specific nano/monobody binding domain using GeneArt (Life Technologies) with flanking 5’-EcoRI and 3’-NotI sites as follows: GAATTCGCCATG-(nano/mono)-TGAGCGGCCGC. If the sequence contains internal EcoRI or NotI sites then introduce silent changes to remove them such that the flanking sites are unique, it may also be useful to codon optimise according to the cell line to be targeted.Re-suspend the lyophilised GeneArt vector in 50 µl d/dH2O (distilled/deionised H2O).Digest 25 µl of the re-suspended GeneArt vector with EcoRI and NotI at 37 °C for 2 h; (25 µl DNA, 10 µl FastDigest Green Buffer, 2 µl EcoRI, 2 µl NotI, 61 µl d/dH2O). Run the entire digest on a 1% agarose gel (130 V, 35 min) (split between neighbouring wells as necessary). Two bands should be visible; the heavier vector band should run at approximately 2.3-2.5 Kb depending on the GeneArt backbone provided and the released insert band should run at the expected size of the synthesized nano/monobody binding domain (see Figure 1 for a simulated DNA digest gel image). Excise the released cDNA insert (small band). For DNA loading buffer (see Recipes).Purify the digested insert using the QIAquick gel extraction kit according to the manufacturer’s instructions and elute in 50 µl d/dH2O.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171115/20171115012026_3982.jpgFigure 1. Simulated DNA agarose gel highlighting the expected products obtained in each digest. Molecular weights (MW) are in base pairs (bp). 1. (Step A1c) pMK-RQ AdPROM (GeneArt synthesized) x EcoRI + NotI (upper band = vector, 2,286 bp, lower band = insert, 307 bp). 2. (Step A2b) pBABED P FLAG VHL 5xGly no stop (DU54795) x EcoRI + NotI, 5,830 bp. 3. (Step A2b) pBABED P FLAG (DU37983) x EcoRI + NotI, 5,176 bp. 4. (Step B2a) pRetroX-Tight Puro x EcoRI + NotI, 6,536 bp. 5.",
    "(Step B2i; Step B3j) pRetroX-Tight Puro x BamHI + NotI, 6,560 bp. 6. (Step B3c) VHL PCR x BamHI + NotI, 664 bp. 7. (Step B2e) Nano/monobody PCR x BamHI + NotI, 307 bp.Preparation of vectorsDigest accepting vectors: for the AdPROM construct, cut pBABED Puro FLAG VHL (DU54795) and for the nano/monobody only control cut pBABED Puro FLAG (DU37983). An additional VHL only control vector is available if required (DU54477). All constitutive expression AdPROM reagents and vectors may be ordered online from the MRC-PPU (http://mrcppureagents.dundee.ac.uk/reagent-catalogues[href=http://mrcppureagents.dundee.ac.uk/reagent-catalogues]).Digest each accepting vector with EcoRI and NotI at 37 °C for 2 h; (3-5 µg vector, 10 µl FastDigest Green Buffer, 2 µl EcoRI, 2 µl NotI, d/dH2O to 100 µl final volume). pBABED Puro FLAG VHL (DU54795) and pBABED Puro FLAG (DU37983) should produce single fragments of 5.9 Kb and 5.2 Kb respectively (Figure 1).Run the entire digest on a 1% agarose gel (130 V, 35 min) (split between neighbouring wells as necessary) and excise the cut vector band (single large band).Purify the digested vectors using the QIAquick gel extraction kit and elute in 50 µl d/dH2O.Cloning, verification and MaxiprepLigate the AdPROM insert into both the empty and VHL-containing accepting vectors using the Rapid DNA Ligation Kit (5 µl insert, 1 µl vector, 4 µl 5x Rapid DNA Ligation Buffer, 1 µl Ligase, 9 µl d/dH2O).Mix well and incubate for 5 min at RT.Add 5 µl of the ligation reaction to 50 µl competent DH5α cells on ice and leave for 2 min.Move cells to 42 °C water bath for 45 sec to heat shock then place on ice for 1 min.Plate the entire contents of the transformation tube onto an LB (lysogeny broth) agar plate containing 100 µg/ml ampicillin and place O/N (overnight) at 37 °C.",
    "Note: Ampicillin is a slow-acting antibiotic thus there is no need for a recovery step before plating.The following morning, pick 4-6 colonies from the plate and add each to 4 ml LB (50 µg/ml ampicillin) in 15 ml Falcons. Propagate O/N in a shaker incubator at 37 °C, 220 rpm.After 16 h growth, pellet cells by centrifugation at 2,000 x g for 10 min at 4 °C.Harvest plasmid DNA from each pellet using the QIAprep Spin Miniprep kit according to the manufacturer’s instructions and elute in 50 µl d/dH2O.Set up a small 20 µl diagnostic digest for each and incubate for 1 h at 37 °C; (6 µl Plasmid DNA, 2 µl FastDigest Green Buffer, 0.1 µl EcoRI, 0.1 µl NotI, 11.8 µl d/dH2O).Run the digested samples on a 1% agarose gel and look for the excision of the AdPROM insert. Two bands should be visible; the heavier vector band should run at approximately 4.3 Kb and the smaller released insert band should run at the expected size of the synthesized nano/monobody binding domain.Sequence 1 or 2 positives using primers pBABE F (5’-CCTCCTCTTCCTCCATCC) and pBABE R (5’-CCACACCTGGTTGCTGACTAATTGAG).Transform 50 µl DH5α cells with 5 ng of plasmid DNA from the confirmed clone and plate on an LB agar plate (100 µg/ml ampicillin).The following morning pick a single colony and inoculate 10 ml LB (50 µg/ml ampicillin) in a 50 ml Falcon tube and grow for 6-7 h at 37 °C, 220 rpm.Add the entire contents to a 500 ml Erlenmeyer flask containing 150 ml LB (50 µg/ml ampicillin) and grow overnight at 37 °C, 220 rpm.Harvest plasmid from the culture using the PureLinkTM HiPure Plasmid Filter Maxiprep Kit according to the manufacturer’s instructions and elute the purified plasmid DNA in 1 ml TE buffer (pH 8.0).",
    "Measure the DNA concentration using a NanoDrop instrument in preparation for downstream transfection procedures; and verify the Maxi-prepped vector(s) by both restriction digestion and DNA sequencing.Generation of AdPROM constructs for Tetracycline (Tet)-inducible expression in cellsNanobody generation and primer designSynthesise the specific nano/monobody using GeneArt (Life Technologies) with flanking 5’-EcoRI and 3’-NotI sites as follows: GAATTCGCCATG-(nano/monobody)-TGAGCGGCCGC. If the sequence contains internal BamHI, EcoRI or NotI sites then introduce silent changes to remove them such that the flanking sites are unique, it may also be useful to codon optimise according to the cell-line to be targeted.The multiple cloning site of the pRetroX-Tight Puro destination vector is limited, thus it is necessary to order additional primers to PCR amplify the AdPROM insert with flanking BamHI and NotI sites: gctaGGATCCGCCATG-(nano/monobody)-TGAGCGGCCGCgact (the lower case bases indicate overhangs to allow direct digestion of PCR product). A Tm of 60 °C is recommended for PCR primers; if lower then alter the annealing temperature of any reactions accordingly.Design oligonucleotides to amplify VHL (variant 1, NM_000551.3[href=https://www.ncbi.nlm.nih.gov/nuccore/NM_000551.3]) with a 3’-5xGLY linker, no stop codon and flanking 5’-BamHI and 3’-EcoRI restriction sites; gctaGGATCCGCC-(VHL)-GGTGGAGGCGGAGGTGAATTCgact (the lower case bases indicate overhangs to allow direct digestion of the PCR product). A holding vector (DU52906) containing this cloned fragment is available from the MRC-PPU (http://mrcppureagents.dundee.ac.uk/reagent-catalogues[href=http://mrcppureagents.dundee.ac.uk/reagent-catalogues]).Generation of Tet-inducible nano/monobody controlDigest the vector pRetroX-Tight Puro with BamHI and NotI to produce a single fragment of 6.6 Kb (Figure 1), purifying as shown above (step A2) and eluting in 50 µl d/dH2O.Re-suspend the lyophilised GeneArt nano/monobody vector in 50 µl d/dH2O.PCR amplify the nano/monobody with BamHI and NotI primers using KOD Hot Start DNA polymerase (1 µl template [10 ng/µl GeneArt cDNA], 5 µl 10x PCR buffer, 5 µl dNTP mix [2 mM each], 3 µl 25 mM MgSO4, 3 µl DMSO, 1.",
    "5 µl each F&R primers [10 µM], 1 µl KOD polymerase, 29 µl d/dH2O). PCR: 2 min 94 °C then 30 cycles of 15 sec 94 °C, 30 sec 60 °C, and 25 sec 72 °C followed by a single elongation step of 7 min 72 °C.Run 5 µl of the PCR reaction with 15 µl loading buffer on a 1% agarose gel to determine success. The PCR band should match the size of the nano/monobody template (Figure 1).Clean 40 µl of the confirmed PCR reaction (step B2d) using the QIAquick PCR purification kit according to the manufacturer’s instructions but eluting in 85 µl d/dH2O.Cut the entire cleaned PCR product by adding 10 µl 10x FastDigest buffer, 2 µl BamHI, 2 µl NotI and 1 µl DpnI to the eluate from step B2f. Incubate at 37 °C for a minimum of 2 h.Repeat the PCR cleanup step, this time eluting in 50 µl d/dH2O to yield the digested AdPROM insert.Ligate the AdPROM insert into pRetroX-Tight Puro following the cloning, verification and Maxiprep steps shown previously (section A3) except use BamHI and NotI in step A3i (Figure 1), sequence with pBABE F (5’-CCTCCTCTTCCTCCATCC) and pRetroX R (5’-TGCTCCAGACTGCCTTGG) in step A3k and inoculate 250-400 ml of LB (50 µg/ml ampicillin) in step A3n.Generation of Tet-inducible AdPROM vectorSet up a VHL PCR using KOD Hot Start DNA polymerase; (1 µl template [VHL containing vector, section A3 above]), 5 µl 10x PCR buffer, 5 µl dNTP mix (2 mM each), 3 µl 25 mM MgSO4, 3 µl DMSO, 1.5 µl each F&R primers (10 µM), 1 µl KOD polymerase, 29 µl d/dH2O.",
    "PCR: 2 min 94 °C then 30 cycles of 15 sec 94 °C, 30 sec 60 °C, and 50 sec 72 °C followed by a single elongation step of 7 min 72 °C.Run 5 µl of the PCR reaction with 15 µl loading buffer on a 1% agarose gel to determine success. The expected band size for VHL and linker should be 0.7 Kb (Figure 1).Clean 40 µl of the confirmed PCR reaction (step B3b) using QIAGEN’s QIAquick PCR purification kit according to manufacturer’s instructions but eluting in 85 µl d/dH2O.Cut the entire cleaned PCR product by adding 10 µl 10x FastDigest buffer, 2 µl BamHI, 2 µl EcoRI and 1 µl DpnI to the eluate from step B3d. Incubate at 37 °C for a minimum of 2 h then repeat the PCR cleanup step, this time eluting in 50 µl d/dH2O to yield the digested VHL insert.Digest 25 µl of the re-suspended GeneArt nano/monobody vector with EcoRI and NotI at 37 °C for 2 h (25 µl DNA, 10 µl 10x FastDigest Green Buffer, 2 µl EcoRI, 2 µl NotI, 61 µl d/dH2O).Run the entire digest on a 1% agarose gel (split between neighbouring wells as necessary) and excise the released cDNA insert (small band).Purify using the QIAquick gel extraction kit and elute in 50 µl d/dH2O to yield the AdPROM insert.Perform a 3-way ligation (see Figure 2) by simultaneously inserting the VHL and AdPROM inserts into pRetroX-Tight Puro using the Rapid DNA Ligation Kit; (2.5 µl VHL insert (BamHI/EcoRI), 2.5 µl AdPROM insert (EcoRI/NotI), 1 µl pRetroX-Tight Puro vector (BamHI/NotI), 4 µl 5x Rapid DNA Ligation Buffer, 1 µl ligase, 9 µl d/dH2O).",
    "Follow the cloning, verification and Maxiprep steps shown previously (section A3) with some minor changes; allow 10 min for the ligation reaction in Procedure A3b, add 10 µl of ligation reaction to 100 µl cells in step A3c, perform diagnostic digests in Procedure E using BamHI and NotI (Figure 1), sequence with pBABE F (5’-CCTCCTCTTCCTCCATCC) and pRetroX R (5’-TGCTCCAGACTGCCTTGG) in step A3k and inoculate 250-400 ml of LB (50 µg/ml ampicillin) in step A3m.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171115/20171115013101_5079.jpgFigure 2. Schematic illustrating a typical 3-way ligation as described in step B3i. The diagram shows the Tet-inducible pRetroX Tight plasmid (see Procedure E), however, the principles for pBABED plasmids remain the same.Retrovirus production and target cell infection for the constitutive expression AdPROM systemCulture HEK-293 FT cells and the desired target cell lines following the recommended conditions. For HEK-293 FT cells, cells are grown in DMEM supplemented with 10% (v/v) FBS, 2 mM L-glutamine and 1% (v/v) penicillin/streptomycin (hereafter referred to as complete medium). Cells are maintained at 37 °C in a humidified incubator at 5% CO2. Seed 5 x 105 HEK-293 FT cells per one 10-cm culture dish in complete medium and incubate at 37 °C in a humidified incubator at 5% CO2 overnight. The next day the cells should be ~70% confluent. Prior to transfection, replace medium with 9 ml of complete medium. One 10-cm dish of ~70% confluent HEK-293 FT cells is enough for the generation of an individual retrovirus. For the constitutive expression AdPROM system we recommend the following control and AdPROM retroviruses: Flag-tagged Nano/monobody alone, Flag-tagged VHL alone, Flag-tagged VHL-nano/monobody fusion protein (see Figure 3 for a flow diagram describing the process).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171115/20171115013238_3021.jpgFigure 3. Schematic flow diagram illustrating the process by which target cell lines are infected with AdPROM and control retroviruses as outlined in Procedure C.",
    "Briefly, HEK-293 FT cells are sub-passaged and individually transfected with control or AdPROM constructs, along with the GAG/Pol and VSVG constructs required for retroviral production. Following incubation, retrovirus-containing medium from each cell dish is collected, filtered and applied to the target cells for 24 h. Infected target cells are selected in appropriate antibiotic-containing medium, and successful retrovirus integration is confirmed through Western blotting.Pipette 300 µl of serum-free Opti-MEM into two 1.5 ml Eppendorf tubes. To one of these tubes, add 6 µg of the cDNA of interest (e.g., Flag-VHL alone) in the pBABED puro vector, 3.2 µg of the pCMV-GAG/Pol, and 2.4 µg of the pCMV-VSVG. To the other tube, add 24 µl of 1 mg/ml PEI (diluted in 25 mM HEPES pH 7.5). A transfection control with pCMV5-GFP (10 µg) is also recommended.Allow the tubes to incubate for 5 min at room temperature (RT), before combining both tubes and incubating for a further 20 min at RT. Following the incubation period, add the resulting infection mix drop-wise on to the 10-cm dish of 70% confluent HEK-293 FT cells.Place cells in the 37 °C incubator and incubate for 16 h.Collect the medium from cells and dispose safely (by following appropriate disposal guidelines). Replace with fresh complete medium and incubate cells for 24 h.Collect the retrovirus-containing medium and filter through 0.45 µm sterile syringe filters into sterile tubes. Either store the filtered viral media at -80 °C, or add desired amount drop-wise onto the target cells (50-70% confluent at the time of infection) for infection. Typical dilutions range from 1:2 to 1:200 and need to be tested to achieve desired expression of AdPROM. Add polybrene (8 µg/ml, diluted in water) to aid infection. Dispose of the HEK-293 FT cells safely.Infect the target cells for 24 h.",
    "Remove the viral media, and wash the cells once in sterile PBS. Supply 10 ml of complete medium onto the target cells and allow them to recover for 24 h.Select the infected cells in appropriate antibiotic. For pBABED Puro vectors, puromycin (2 µg/ml) is applied to cells for 2 days (concentrations and length of antibiotic treatment sufficient to kill each target cell should be determined). As a control, include a dish of non-infected cells, to monitor the effectiveness of the antibiotic cytotoxicity.When control cells are all dead, collect the antibiotic-resistant cells and expand them for analysis by Western blotting.Testing the effectiveness of target protein degradation by constitutive expression AdPROMFor lysis of AdPROM infected cells, wash cells twice in ice-cold PBS, and lyse cells in (200 µl-1 ml) ice-cold lysis buffer (see Recipes) using cell scrapers. Transfer extracts into 1.5 ml Eppendorf tubes and store on ice. Include non-infected wild type cells as a negative control.Following 10 min incubation on ice, clarify extracts by centrifugation (13,000 x g, 20 min, 4 °C).Collect the supernatant and perform a Bradford assay (Bradford, 1976) to quantify the protein concentration in each sample.Normalise the protein concentrations in each sample by diluting extracts in lysis buffer so that the protein concentration in each extract is the same. Add 5x SDS sample buffer (see Recipes) to each sample for a final concentration of 1x SDS sample buffer. Denature proteins by heating at 95 °C for 5 min. Samples can be stored at -20 °C for future use.Following a brief centrifugation (13,000 x g, 2 min, RT), extracts are ready to load onto SDS polyacrylamide gels.Resolve extracts (typically 20 µg protein per lane) by SDS-PAGE and transfer onto PVDF membranes. Include molecular weight markers on end lanes on both sides.",
    "For Western blotting, membranes are first blocked in 5% milk in TBS-T (1x) (see Recipes). Membranes are then incubated with primary antibodies diluted in either milk or BSA in TBS-T (1x) at 4 °C overnight, or for 1 h at RT (the dilution and milk vs. BSA need to be optimised for each antibody). To monitor target protein levels, use an antibody that recognises the POI, in addition to an antibody that recognises a house-keeping gene such as GAPDH or actin, for use as a loading control. Additionally, to confirm successful retrovirus integration, blot for the Flag-tag that was fused to the control and AdPROM retroviruses.Membranes are then washed in TBS-T, before incubation with HRP-conjugated secondary antibodies for 1 h at RT. Subsequently proteins of interest are detected by using ECL, and exposing the membranes to X-ray films for different exposure times.Adaptation of AdPROM for Tet-inducible POI degradationAs described above (Procedure C-Procedure D) for constitutive POI degradation section, with the following changes:The pRetroX-Tet-On advanced system is a two-vector system, comprised of the pRetroX-Tet-On transactivator (G418 resistant) and the pRetroX-Tight gene of interest (puromycin resistant). These vectors are treated as per the pBABED puro vector system (6 µg added to the infection mix). One can either infect the target cells with both retroviruses at the same time and select for infection with both G418 and puromycin; or firstly infect target cells with the pRetroX-Tet-On transactivator, and select cells in G418 (200 µg/ml), and when non-infected cells are all dead, G418-resistant cells can be re-infected with the pRetroX-Tight AdPROM constructs and selected in puromycin (2 µg/ml).The viral dilutions for these retroviruses will need to be optimised. Ideally one wants to see no detectable AdPROM expression in the absence of Tet/doxycycline, but robust expression in the presence of Tet/doxycycline.",
    "For inducible AdPROM expression purposes, we recommend using 0.5-2 µg/ml doxycycline for the initial characterisation.Prior to cell lysis, expression of the AdPROM and control constructs will need to be performed, and ideally a Tet/doxycycline induction time course performed to monitor both AdPROM expression and target protein degradation.Degradation of proteins for which no nano/monobody is availableIn the event that no nano/monobody exists for your POI, we have shown that it is possible to first introduce an endogenous GFP knockin tag onto the gene encoding the POI using CRISPR/Cas9 gene editing technology, to enable targeting of the GFP-tagged target protein with high affinity anti-GFP nanobodies. Following successful GFP integration onto the target protein gene locus, the protocol for degradation of the GFP-tagged endogenous protein either constitutively or inducibly is the same as above (Procedure C-Procedure E)."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}