{
  "id": 11125,
  "origin_website": "Jove",
  "title": "Biosensor for Detection of Antibiotic Resistant Staphylococcus Bacteria",
  "procedures": [
    "1. Setting the Stage\nObtain type strain S. aureus ATCC 12600, S. aureus ATCC 27690 and Bacillus subtilis ATCC 6051. Methicillin-resistant strains of S. aureus - MRSA1, MRSA 2, MRSA 5, MRSA 13, MRSA 26, MRSA 34, MRSA 45, B. anthracis Sterne, Salmonella typhimurium LT2, Shigella flexneri, Yersinia enterocolotica, Proteus mirabilis, Klebsiella pneumoniae 13882; The lytic phage 12600.\nObtain PBP 2a antibody conjugated latex beads.\nPrepare NZY medium as described 21.\nObtain phosphate buffered saline solution (PBS).\nPrepare deionized water as subphase for Langmuir-Blodgett (LB) monolayer deposition.\n2. Bacteriophage Propagation and Titration\nIncubate 5 ml of overnight culture of S. aureus ATCC 12600 (3.6 x 108 colony forming units (CFU)/ml) with 500 μl of phage (3 x 109 PFU/ml) in 500 ml NZY medium in 2 L flack on shaker-incubator at 37 °C overnight.\nCentrifuge culture at 4,424 x g for 10 min at 4 °C.\nRe-centrifuged supernatant at 11,325 x g for 10 min at 4 °C.\nFilter supernatant through a 0.22 μm Millipore filter.\nCentrifuge filtrate at 75,395 x g for 1.5 hr.\nDissolve pellet in 100 μl of distilled water.\nPrepare 10-fold dilutions of phage suspension in NZY medium.\nPlate 1 ml of overnight (ON) culture of S. aureus ATCC 12600 onto each of 2 plates with NZY agar to make sure all surface is covered. Remove the excess of culture and let the surface dry for 30 min.\nSpot a sample (10 μl) of appropriate phage dilution onto the surface of the plate and incubate at 37 oC for 18-24 hr.",
    "Examine the formation of plaques and calculate the phage titer. Bacteriophage titers (T) are estimated on the basis of the number of plaques (N) formed per 10 μl volume (v) of phage suspension and the dilution factor (F). The titer was calculated by formula: T=N/(vxF). For example, for the number of plaques 75 at the dilution 10-7 and the volume 10 μl (10 x 10-3 ml), the titer is equal 75 / (10 x 10-3 x 10-7) = 7.5 x 1010 plaque forming units (PFU) per ml of suspension.\n3. Gold-immobilized Phage\nClean gold-coated quartz pieces (60 mm2) by plasma etching in argon for 10 min and then sterilize for 6 hr under UV light in a sterile cabinet.\nAdd 50 microliters of 1 x 109 PFU/ml phage suspension to the gold surface of each piece in a sterile Petri dish, and then incubate overnight in a humid chamber at room temperature.\nRemove and titer the remaining phage suspension.\nWash pieces with bound phage 5 times with PBS to remove unbound phage.\n4. Testing of Immobilized Phage Infectivity on a Dry Surface\nSpread an O/N culture of S. aureus ATCC 12600 onto an NZY agar plate and allow drying.\nPlace a gold piece with immobilized phage onto the plate face down.\nObserve a zone of lysis after 12 hr incubation at 37 °C that indicates infectivity.\nUse gold covered pieces with no phage in control experiments.\n5. Testing of Lytic Activity of Free and Bound Phage in Liquid\nAdd an ON culture of S. aureus ATCC 12600 to 10 ml of NZY in every of four 300 ml sidearm flasks (6 x 106 CFU/ml in each flask).\nAdd In two flasks 2 x 106 PFU/ml of free phage.\nUse the other two flasks as controls.",
    "Monitor the time course of S. aureus cell lysis for 570 min by optical density measurement (OD600) at 30 min intervals for all flasks.\nTake a final measurement at 24 hr.\nRepeat steps 5.1-5.5, but use gold pieces with bound phages instead of free phages, and gold pieces with no phage in control flasks.\n6. Loss of Bound Phages During Incubation\nAdd 50 μl of 1 x 109 PFU/ml phage onto the surface of sterile gold piece in a Petri dish that is placed into a humid chamber overnight at room temperature.\nRemove the suspension with unbound phage from the gold surface and titer.\nWash the gold piece with bound phage 5 times with PBS and place in 1 ml NZY solution in 15 ml tube in shaker-incubator at 37 °C for 8 hr.\nDetermine the titer of the detached phage as described in 2.\n7. Phage Spheroids Preparation\nCombining 400 μl of stock phage 12600 suspension (1011 PFU/ml) with an equal volume of spectrophotometric grade chloroform in 1 ml vial at room temperature.\nGently vortex the phage-chloroform suspension 5-6 times (5 sec intervals) over one minute duration.\nAllowed the suspension to stabilize for 30 sec and then pipette of the top phase containing spheroids was pipetted off for monolayer preparation.\nTake a few microliters of the spheroids suspension for the transmission and scanning electron microscopy.\nUse a remaining spheroid suspension for biosensor manufacturing.\n8. Biosensor Preparation\nClean QCM-D sensors by plasma etching in argon for 10 min PDC-32G Harrick plasma cleaner.\nRinse sensor with hexane to remove any organic impurities.\nPrepare and clean a trough of the film balance as described in 22.\nFill LB trough with a subphase solution and clean it with a trough barrier and stabilize the trough at 20±0.1 °C",
    "Spread 300 μl aliquot of phage 12600 in aqueous suspension (1011 PFU/ml) onto LB subphase.\nPrepare phage monolayer onto LB subphase solution by allowing 300 μl aliquot of phage 12600 aqueous suspension (1011 PFU/ml) to run down an inclined wettable glass rod that is partially submersed into the subphase 22,23.\nStabilize the prepared monolayer for 10 min, and then compress it at a rate of 30 mm/min (45 cm2/min), until a constant pressure 19 N/m is attained.\nPerform a vertical film deposition onto perpendicular positioned QCM-D sensor at a rate of 4.5 mm/min by successively dipping sensor in and out of the monolayer seven times. Electron microscopy of deposited phage monolayers before exposure to bacterial samples showed that the layers were continuous, homogeneous, and uniform (data not shown).\nRepeat steps 4.5-4.8 with a phage spheroid suspension that is prepared in 3.\nUse fabricated phage biosensors for MRSA detection, electron microscopy, and ellipsometry.\n9. Biosensor Testing, Discrimination of Methicillin Resistant and Sensitive Staphylococcus Bacteria\nIn this protocol, biosensors with unmodified and modified phage and phage spheroids are prepared. A quartz crystal microbalance with four sensor flow chambers is used to monitor binding of bacteria to the phage immobilized on QCM sensor surface. PBP 2a antibody conjugated latex beads are utilized to discriminate between methicillin resistant (MRSA) and sensitive staphylococcus bacteria. All measurements are conducted in the flow mode (50 μl/min) at 5 MHz.\nEstablish a base line resonance frequency of the QCM sensor in water (~30 min).\nDraw a suspension of live methicillin sensitive staphylococcus bacterial cells in water (109 CFU/ml) through the test cell.\nContinuously monitor changes in the sensors resonance frequency and energy dissipation for the first overtone, using the Q-Soft software.",
    "When the changes in the sensors resonance frequency and dissipation reached saturation levels, add the suspension of PBP antibody conjugated latex beads (6.77 x1010 beads/ml) to the flow during the continuous monitoring of frequency and dissipation.\nRepeat steps 9.2-9.5 for methicillin resistant staphylococcus bacterial cells (MRSA).\nDefine a frequency change through the mass change due to bacteria binding by the Sauerbrey equation 24,25 Δf=-Δm xn/C, where C is the mass sensitivity constant (C=17.7 ng x cm-2 x Hz-1 at 5 MHz), m is mass and n is the overtone number (n = 1).\nDefine an energy dissipation change (ΔD) from the recording the exponential decay of oscillation (frequency and amplitude dampening, which allowed quantification of the energy dissipated and stored during one period of oscillation, Edissipated and Estored, respectively: ΔD = Edissipated / 2πEstored. ΔD is measured in dissipation units (DU), one DU = 10-6 relative units).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}