{
  "id": 7633,
  "origin_website": "Bio",
  "title": "Protocol for Initiating and Monitoring Bumble Bee Microcolonies with <em>Bombus impatiens</em> (Hymenoptera: Apidae)",
  "procedures": [
    "Prepare nest provisions and feeders (see Protocol for Microcolony Initiation and Monitoring Notes #4)Prepare syrup feeders using 20 mL oral dosing syringes with a pre-drilled 1/8” hole located at the 2 mL mark. Holes should be parafilmed to facilitate filling syringes with either control 50/50 inverted syrup or, if the experiment calls for it, test article-containing 50/50 inverted syrup.Fill syringe feeders by submerging the syringe tip into a beaker or conical tube containing 50/50 inverted syrup or test article-containing 50/50 inverted syrup by pulling up on the plunger. Cap syringes after filling with syrup.Remove the parafilm and record the syrup weight in the datasheet for the experiment (see Supporting information figure 1[href=https://os.bio-protocol.org/attached/file/20220610/Supporting%20information%20Figures%201%206.docx] for an example data collection sheet).Prepare pollen patties as described in Part I (above).Prepare microcolony chambers for nest initiation Label each microcolony observation top with the date of initiation and assigned microcolony number.Place stainless steel sieve on the bottom plate with an absorbent paper towel placed in between the pieces, and clear observation lid on top.Place the lid of a 35 mm × 10 mm disposable Petri dish marked with the microcolony number on the bottom, in the microcolony chamber with a 3–3.25 g nest initiation patty for nest building (Figure 5).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4451/bioprotoc-12-12-4451-g005.jpgFigure 5. Microcolony chamber components. Stainless steel geology sieve (1.57” depth × 5” diameter) with pass-through floor (#10 mesh), bottom plate with holes drilled for ventilation, see-through top for collecting observations, removable lid for accessing chamber interior, and syringe feeder. Design adopted from Bayer CropSciences.Weighing and seeding microcolonies with newly emerged B.",
    "impatiens workers (Protocol for Microcolony Initiation and Monitoring Notes #5)Fill the ice pan and place the rectangular plastic container in the center of the ice pan with 50 mL conical tubes positioned around the inside edge of the ice pan for storing collected newly emerged workers.Transfer enough newly emerged workers to the 4°C refrigerator for 10–15 min to support the experiment (i.e., Number of workers needed = [(5 workers/microcolony × the number of microcolonies desired) + 10% extra bees to account for dead/injured bees]).Remove bees from 4°C and transfer them to the shallow rectangular plastic container on ice.Next, transfer five randomly selected bees at a time to the 50 mL conical tubes. Transfer the conical tubes to the lab bench to allow the bees to become active again.Check the conical tubes for any dead or damaged bees prior to weighing; replace dead or damaged bees as needed.Weigh the conical tube with the five newly emerged bees for the first microcolony. Add the bees to their microcolony and then weigh the empty conical tube to determine the weight of the bees. Record these numbers in the datasheet for the experiment (see Supporting Information figure 2[href=https://os.bio-protocol.org/attached/file/20220610/Supporting%20information%20Figures%201%206.docx] for an example data collection sheet).Supplementing the nest initiation patty Five days after microcolony initiation, supplement the nest initiation patty with an additional ~2 g of pollen paste.Microcolony routine feeding (see Protocol for Microcolony Initiation and Monitoring Notes #6–9)Seven days after microcolony initiation, give each microcolony ~2 g pollen paste for feeding in a disposable 43 mm aluminum weigh dish.Provide microcolonies with fresh, pre-weighed ~3.5 g pollen paste and either control 50/50 inverted syrup or test article-containing 50/50 inverted syrup every Monday, Wednesday, and Friday starting one-week post initiation.",
    "Record the weight of the new dish with new pollen paste and new syrup feeder into the datasheet for the experiment (see Supporting information figure 1[href=https://os.bio-protocol.org/attached/file/20220610/Supporting%20information%20Figures%201%206.docx] for an example data collection sheet).Record the weight of the old pollen paste with the original dish and previous syrup feeder to determine consumption.To more accurately quantify pollen/syrup consumption levels, include two evaporation controls in the study design. These controls should be set up and processed exactly like all other microcolonies, except they do not contain bees (see Supporting information figures 3 and 4[href=https://os.bio-protocol.org/attached/file/20220610/Supporting%20information%20Figures%201%206.docx] for an example data collection sheet).Monitoring microcolonies and data collection (see Protocol for Microcolony Initiation and Monitoring Notes #10–12)Using an environmental chamber, maintain microcolonies in darkness at 25°C ± 0.5°C and 50% ± 5% relative humidity throughout the duration of the study. Red light may be used when microcolonies are outside of the environmental chamber on the bench. Avoid white light where possible.Evaluate each microcolony from initiation to study termination (see Supporting information figure 5[href=https://os.bio-protocol.org/attached/file/20220610/Supporting%20information%20Figures%201%206.docx] for an example data collection sheet).During each observation, collect the following information: 1) number of dead workers; 2) days to first drone emergence; 3) number of drones emerged; and 4) drone weight.Optional, additional information can be collected, including 1) time to first uncapped egg chamber; 2) days to first capped egg chamber; 3) days to first larval mass; and 4) days to first pupal cell.Any drones that emerge should be removed when the microcolonies are fed (i.e., Monday, Wednesday, and Friday). After removal, weigh each drone individually (see Supporting information figure 6[href=https://os.bio-protocol.org/attached/file/20220610/Supporting%20information%20Figures%201%206.docx] for an example data collection sheet).Optional but encouraged: randomly select and photographically track at least one microcolony from each experimental group (Wednesdays recommended) to capture microcolony progression and developmental milestones.",
    "Terminating microcolonies When the experiment is complete, after 42 or 49 days, either proceed to additional assay endpoints or euthanize the workers, drones, and remaining brood by CO2 narcosis followed by transfer to -80°C.Protocol for Microcolony Initiation and Monitoring Notes The observation tops can be made according to the specifications detailed in Figure 6A and 6B. As designed, the tops have a recessed 5” diameter ring that prevents the lids from slipping off the top of the sieve. However, other designs for the top can be used, provided they 1) are large enough to cover the sieve [bees will be housed in the space between the mesh floor of the sieve and the observation top (see Figure 7)], have an opening for the syringe feeder, and have ventilation holes to allow air circulation.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4451/bioprotoc-12-12-4451-g006.jpgFigure 6. Materials and measurements for the microcolony observation top, removable lid, and bottom plate. Microcolony chamber observation tops (A), removable lids (B), and bottom plates and (C) used previously (Camp et al., 2020a, 2020c; Weitekamp et al., 2022) can be reconstructed according to the specifications shown. dia. = diameter.Bottom plates can be made according to the specifications detailed in Figure 6C. The bottom plates were designed to prevent bee waste and other debris that pass through the perforated floor of the sieve from contaminating other microcolonies and from fouling the environmental chamber. The design of the bottom plates includes a recessed 5” diameter ring that the sieve drops into. However, investigators can use any bottom plate design, provided the bottoms have ventilation holes to allow air circulation and are large enough for the sieve to sit on top of it.Microcolonies should not be initiated with randomly aged workers when using this protocol.",
    "Using age-matched, newly emerged workers reduces the possibility of confusing age-related deaths for treatment effects and promotes consistency across microcolonies within an experiment and across experiments. When using this protocol, investigators should use fresh or fresh-frozen honey bee-collected corbicular pollen with this protocol. Provisioning microcolonies with old (i.e., >2 years old) or improperly stored pollen may impact microcolony progression and productivity.Pollen patties for nest initiation and paste for routine feeding should be made fresh on the day of initiation or feeding.Since worker size can impact microcolony nest development and food consumption rates by workers (Peat and Goulson, 2005; Couvillon and Dornhaus, 2010; Amsalem and Hefetz, 2011; Roger et al., 2017a, 2017b), protocol users are encouraged to seed microcolonies with bees of a similar mass.Microcolonies must be provided ad libitum access to pollen and syrup for the duration of the experiment. Restricting access to food provisions will disrupt microcolony development, reduce productivity, and complicate the interpretation of experimental results.The delay in providing pollen specifically for feeding is to reduce the likelihood that the workers will attempt to lay eggs on both the pollen for feeding and nest initiation patty.Microcolonies consume significantly more pollen when feeding developing larvae. Therefore, it is best to give productive microcolonies ~3.5 g of pollen paste to minimize the risk that they will run out of pollen.Unless retention is required for additional analysis, dispose of the old pollen dish.To help keep the bees calm when manipulating the microcolonies, place the chambers on a disposable paper mat that will absorb vibrations.To promote consistency across microcolonies, rotate the position of individual microcolonies within the environmental chamber.If a founding worker dies in the first 24 h, replace it with a new newly emerged worker (obtain weight of new worker).",
    "Because the number of worker bees in a microcolony can impact nest productivity (Gradish et al., 2013) and food consumption rates, protocol users are encouraged to track the number of dead workers throughout the experiment.Production of drones is a key metric of microcolony success. The time to first drone emergence, the number of drones emerged, and drone weight can all be readily quantified. Importantly, all these measures can be affected by experimental treatments providing insights into how a test material impacted the microcolony."
  ],
  "subjectAreas": [
    "Systems Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}