{
  "id": 19039,
  "origin_website": "Jove",
  "title": "Quantitative Analysis of Chromatin Proteomes in Disease",
  "procedures": [
    "The experimental workflow contains seven major steps (Figure 1). For any work involving samples that will be run on the mass spectrometer, the experimenter should wear a lab coat, gloves and hair net and take care to avoid contamination from dust and personal shedding of keratin.\n1. Heart Homogenization and Nuclear Isolation\nMouse hearts are homogenized and an intact nuclei pellet is isolated (Figure 2).\nSacrifice adult mouse, excise the heart, rinse in ice-cold PBS, and homogenize on ice in glass dounce (we prefer the Wheaton Tissue Grinder from Fisher, #08-414-13A, but other methods may work equally well) containing 2 ml of lysis buffer (a hypotonic solution which differentially lyses the cell membrane over the organelles including the nucleus) (10 mM Tris pH 7.5, 15 mM NaCl, and 0.15% v/v Nonidet P-40 [NP-40] in deionized water plus protease and phosphatase inhibitor mixture: 10 mM sodium butyrate, 0.1 mM phenylmethylsulfonyl fluoride [PMSF], 0.2 mM Na3VO4, 0.1 mM NaF and 1 Roche protease pellet/10 ml - lysis buffer can be stored for up to one week at -20 °C). (Note: We do not find it necessary to perfuse the hearts with PBS, as our mass spectrometry data and GO analysis identify the proteins as predominately cardiomyocyte [p-value 3.8E-22] in origin as opposed to blood contamination [p value 5.0E-2].)\nPour lysate through 100 μm strainer and collect flow through in 1.5 ml centrifuge tube. At this point, unless specified, sample should be kept on ice.\nCentrifuge at 4,000 rpm for 5 min at 4 °C.\nRemove supernatant. (This is the cytosol, and should be stored at -80 °C. It contains the lysed mitochondria.) Resuspend pellet in 200 μl lysis buffer by triturating. (This is the crude nuclear pellet.)",
    "Fill 1.5 ml centrifuge tube with 1 ml of sucrose buffer (24% sucrose weight/volume, 10 mM Tris pH 7.5, and 15 mM NaCl in deionized water with protease/phosphatase inhibitor mixture - sucrose buffer should be made fresh on the day of use). Gently layer the resuspended pellet on top of the sucrose pad and centrifuge at 5,000 rpm for 10 min at 4 °C.\nRemove the thin film on top as well as the sucrose pad (which contain membrane). Rinse the remaining pellet with 200 μl ice-cold PBS/EDTA (1x PBS with 1 mM EDTA). (This is the nuclei pellet and can be solubilized or fixed for use in western blotting or electron microscopy [See steps 4.1 and 4.2] to quantify enrichment.)\n2. Nucleoplasm and Detergent-extracted Chromatin Fractionation\nThe crude nuclei pellet is separated into a nucleoplasm and detergent-extracted chromatin fraction, containing proteins loosely associated with the DNA.\nTriturate pellet from step 1.6 in 200 μl detergent extraction buffer (20 mM HEPES pH 7.6, 7.5 mM MgCl2. 0.2 mM EDTA, 30 mM NaCl, 1 M Urea, 1% NP-40 in deionized water with protease/phosphatase inhibitor mixture - detergent extraction buffer can be stored for up to one week at -20 °C).\nVortex sample 2 times, 10 sec each. Place on ice 10 min.\nCentrifuge at 13,000 rpm for 5 min at 4 °C.\nRemove supernatant. (This is the nucleoplasm and should be stored at -80 °C). Rinse pellet with ice-cold PBS/EDTA. (This is the chromatin pellet.)\nTriturate pellet in 300 μl Tris, SDS, EDTA buffer (50 mM Tris pH 7.4, 10 mM EDTA, 1% SDS in deionized water with protease/phosphatase inhibitor mixture - Tris, SDS, EDTA buffer can be kept for up to one week at -20 °C).",
    "Sonicate 3-6 times for 10 sec each to break up DNA. Keep sample on ice between sonications.\nCentrifuge at 13,000 rpm for 5 min at 4 °C. Keep the supernatant. (Supernatant is the detergent-extracted chromatin protein fraction and should be kept at -80 °C). The remaining pellet should be small and can be discarded.\nIf using isolated myocytes instead of the whole heart: Isolate neonatal rat ventricular myocytes from rat pups one day after birth using enzymatic digestion, followed by culture in Dulbecco modified Eagle medium (DMEM) with 10% fetal bovine serum (FBS), 1% insulin-transferrin-sodium selenite (ITS), and 1% penicillin. After 24 hr, transfer to serum-free media (same as above, but lacking FBS). Harvest cells in lysis buffer (listed in 1.1), and begin nuclear fractionation at step 1.3.\n3. Acid-extraction Fractionation - DNA-bound Protein Enrichment\nA separate fractionation enriches for proteins tightly bound to the DNA, including histones.\nRepeat steps 1.1-2.4.\nTriturate the chromatin pellet in 400 μl of 0.4 N sulfuric acid. Vortex to remove clumps.\nIncubate at 4 °C for 30 min or overnight while rotating.\nCentrifuge at 16,000 x g for 10 min at 4 °C to remove nuclear debris.\nTransfer supernatant to a fresh tube.\nAdd 132 μl of trichloroacetic acid drop-wise to the supernatant. Invert several times. Incubate on ice for 30 min.\nCentrifuge at 16,000 x g for 10 min at 4 °C.\nDiscard supernatant. Gently rinse pellet with ice-cold acetone. (This is the histone pellet.)\nCentrifuge at 16,000 x g for 10 min at 4 °C.\nRepeat wash, steps 3.8-3.9.\nAir-dry pellet.\nResuspend the pellet in 100 μl of Tris, SDS, EDTA buffer. Set pH to 8 by adding 1 M Tris. (Use a 1 M Tris stock that is not pH-adjusted.)",
    "Sonicate in water bath for 15 min. Prevent overheating by adding ice to water bath. (This is the acid-extracted fraction and should be stored at -80 °C.)\n4. Purity Check\nWestern blots and electron microscopy confirm successful enrichment of nuclei and depletion of other organelles. To see typical results for all of the following quality control assays, please see our previous publication.18\nPerform Western blot analysis. Probe membrane containing each fraction for histone H2A or nucleoporin p62 (as nuclear markers to verify enrichment), and for adenine nucleotide transporter, BiP and tubulin (as a mitochondrial marker, endoplasmic reticulum marker, and cytoskeletal marker respectively to verify purity). To verify successful subfractionation of the nuclei, probe for histone H3 or fibrillarin (detergent and acid-extracted chromatin and intact nuclei) and SNRP70 or E2F (nucleoplasm). Probe for retinoblastoma or hypoxia inducible factor-1 (enriched in detergent-extracted chromatin over acid-extracted fraction). Additional control samples of HeLa cell lysate and whole heart lysate can also be run in the same gel: Prepare HeLa cell lysate control by adding Tris, SDS, EDTA buffer to culture dish and using a cell scraper to collect sample. Sonicate and centrifuge sample as in steps 2.6-2.7. Prepare whole heart lysate control by homogenizing the heart in 2 ml buffer (20 mM Tris pH 7.4, 150  mM NaCl, 1 mM EDTA, 1 mM EGTA, 1% triton X-100, 2.5 mM sodium pyrophosphate, 1 mM glycerophosphate in deionized water with protease and phosphatase inhibitor mixture). Sonicate and centrifuge as in steps 2.6-2.7. See step 5 for preparing protein samples for SDS-PAGE.",
    "Electron Microscopy: Resuspend the nuclei pellet from step 1.6 in lysis buffer containing 2% gluteraldehyde and fix sample at 4 °C. Rinse samples in osmic acid, dehydrate, and embed in epoxy resin. Cut 70 nm slices using a Reichert Ultracut ultramicrotome. Stain samples in uranyl acetate and then lead and image using a JEOL 100CX Transmission Electron Microscope. Quantify enrichment by measuring the area of intact nuclei versus total area of material imaged. We find 60-80% of nuclei to be intact.14\nImportant considerations for enriching versus purifying nuclei. This protocol was developed to enable proteomic analyses of cardiac chromatin for the purpose of studying global gene regulation processes during disease. A major component of designing whole-proteome mass spectrometry experiments is the issue of dynamic range and being able to identify and characterize low-abundance proteins. In addition to the primary goal of providing information on nuclear and chromatin-specific biology, enriching for the nuclear proteome, increases the likeliness of detecting these low-abundance proteins, as does further subfractionation of the nuclei. However, as discussed, the adult cardiomyocyte has a dense cytoskeletal component connected to the nuclear membrane. We do not believe that we have completely purified the nuclei from these other cellular components. However, by enriching only for the nuclei, we have obtained an acceptable threshold to enable the types of analyses described.\nSpecifically, we have used EM to assess the purity of our crude nuclei pellet and found 60-80% of the fraction to be intact nuclei, roughly 10% mitochondria, and the rest debris. Additionally, we know from our previous study on the intact nuclei population, that while many myofilaments are not enriched by this protocol (including tubulin and actin as measured by Western) certain proteins (calsarcin-1) are enriched, suggesting a true biological population of these proteins in the cardiac nuclei.19",
    "Additionally, we compared the proteins we found to be present in the acid-extracted chromatin fraction, to the predicted roles of these proteins by gene ontology. Importantly, this gene ontology analysis does not take into account the relative abundance of the different proteins (as does our Western blot data) but rather counts all proteins identified (enriched or not) as equal when identifying common pathways and cellular compartments. Analysis of these pathways and cellular compartments can be found in our previous publications.18,20 Most importantly, the success of the enrichment in the acid-extracted chromatin fraction allowed us to identify the presence of 54 histone variants in the adult mouse myocyte,18 many of which relied on one unique peptide for identification, and thus would likely not have been detectable without this enrichment protocol given the enormous complexity of the total cardiomyocyte proteome. Of the 1,048 proteins we identified from the cardiac nuclei, 56 of them (5.3%) were annotated by GO analysis to be part of the nucleosome (one component of the nucleus of interest). Another study looking at the whole heart, identified 6,180 proteins, of which only 11 proteins (0.18%) were annotated to be part of the nucleosome21. This further illustrates the strength of our protocol to meaningfully enrich for nuclear proteins.\n5. Protein Gel and Enzymatic Protein Digest\nProteins are separated by one dimensional SDS-PAGE and trypsin digested to be run on the mass spectrometer.\nThaw samples on ice and determine protein concentration for each sample using the bicinchoninic acid (BCA) protein assay.\nDilute samples to a known concentration using 5x Laemmli buffer, boil for 10 min and store at -20 °C for one-dimensional SDS-PAGE. Dilute samples to a known concentration using urea extraction buffer and store at -20 °C for two-dimensional gels.",
    "Run gel of choice loading equal amount of protein in each lane. Protein can be transferred to a nitrocellulose membrane to be used for Western blotting (as with controls in step 4.1) or bands can be cut for mass spectrometry analysis; see following steps.\nRemove gel from apparatus using deionized water to transfer it to a clean container. Cover gel in Oriole stain, and wrap container in aluminum foil to block light. Allow gel to incubate at room temperature on a shaker for at least 90 min.\nImage Oriole-stained gel (Figure 3) using UV light, and mark where bands will be cut on the image. We cut each lane into approximately 25 2-mm bands for studies measuring the total proteome.\nPlace gel onto a clean surface. Use only materials that have been kept sealed or are sprayed with ethanol to prevent keratin contamination. Cut out each band, and then further slice it into 3 equal pieces. Place all three pieces of each band together into its own labeled 1.5 ml tube. Gel pieces can be stored at -20 °C for several months.\nPrepare gel plugs for enzymatic digestion. Digest gel pieces using trypsin at 37 °C overnight. For detailed gel sample protocol see our previous publication.22 You can digest low molecular weight bands with chymotrypsin in lieu of trypsin, to eliminate trypsin's extensive cleavage of histone tails.\n6. Mass Spectrometry and Data Analysis\nSamples are separated on an LC and analyzed by MS/MS. The spectra are searched against a protein database for protein identification.",
    "Run 10 μl of each sample through LC/MS/MS. We use a nano-flow Eskigent LC with a 75 μm reverse phase column. Use an LC run optimized for a range of protein and peptides. Employ a linear gradient from mobile phase A (0.1%formic acid, 2%acetonitrile [ACN] in water) to mobile phase B (0.1%formic acid, 20%water in ACN): 60 min from 5% mobile phase B to 50% B, then 15 min from 50% B to 95% B and finally 10 min at constant 95% B. Use a flow rate of 200 nl/min. Acquire mass spectrometry data in a data-dependent mode. We use a Thermo Orbitrap that fragments the top 6 most abundant parent ions.\nRepeat runs for at least three biological and two technical replicates. (Recommended)\nUse software (commercially available options include BioWorks and Xcalibur; publically available options include PROWL, X!Tandem, SpectraST) to search spectra against the Uniprot database of choice via a search algorithm (such as SEQUEST or MASCOT).\nConsider modifying search parameters to allow for cysteine carbamidomethylation and methionine oxidation, two common modifications created during the sample processing.\nCalculate a false positive rate using reverse database searching.\nFilter protein identifications to only accept matches of a threshold confidence. We recommend the following parameters to start with: Xcorr >3 (+2), >4 (+3), >5 (+4); deltaCN >0.1, consensus score ≥20, mass tolerance 2 Da for parent ion, mass tolerance of 0.5 Da for product ion, at least 2 unique peptides per protein and no more than 3 missed cleavages.\n7. Label-free Quantitation\nDetermine the relative abundance of proteins using label-free quantitation (Figure 4).",
    "A number of software programs are publically or commercially available for label-free quantitation of mass spectrometry data including Census (Prof. Yates' group),23 Elucidator (Microsoft),24 SIEVE (Thermo Scientific),25 Scaffold (Proteome Software).26 These programs aim to correlate the mass spectrometric signal of intact peptides or the number of peptide sequencing events with relative protein quantities between two or more states.\nWhile each program incorporates a similar analysis pipeline, some programs are limited to the types of specific analysis that can be performed on the data. Initially, data from different runs is aligned, signal intensity is normalized and peptide peaks are selected for analysis.\nThe two most common methods are quantification based on spectral counting or LC-MS peak area. Abundance ratios are calculated to determine changes in peptide abundance between different groups.\nThese programs can be interfaced with proteomic search algorithms (Mascot, Sequest, X!Tandem) to correlate quantification information to protein identification.\nTo ensure accuracy and reproducibility of the data it is crucial to incorporate both biological (different experimental samples) and technical (running the same sample on the mass spectrometer multiple times) replicates of mass spec data.\nVariation of peptide abundance in and between experimental conditions can be assessed by ANOVA and plotted via PCA (Figure 5).\nImportant considerations for label-free quantitation. When performing label-free quantitation, specific attention must be given to ensure consistent sample preparation, digestion time and LC-MS/MS conditions as each sample must be processed and analyzed separately. In contrast to metabolic labeling approaches, comparisons in label-free experiments are made on data from distinct mass spectrometry runs (because the lack of labeling obviates the possibility of running them together), thereby necessitating high reproducibility in all aspects of sample analysis (i.e. of sample prep, LC and MS steps) and use of high mass accuracy mass spectrometers.",
    "To account for slight changes in sample preparation and analysis a known standard may be added to each sample to assist in normalization of data. Additionally, most software programs allow normalization of signal intensities (e.g. by adjusting to background noise or a known abundant analyte) after data acquisition to account for differences in injection, ionization and fragmentation. Alignment algorithms exist in most of the above-referenced software programs that assist in correcting differences in peptide elution profiles. The use of biological and technical replicates is essential in this type of study, as it allows statistical analyses to confirm the reproducibility and consistency of any observed changes in protein abundance.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}