{
  "id": 13353,
  "origin_website": "Jove",
  "title": "RNA-based Reprogramming of Human Primary Fibroblasts into Induced Pluripotent Stem Cells",
  "procedures": [
    "Work under RNase-free conditions and use aseptic techniques when possible. Perform all cell culture-related manipulations in a biological safety cabinet using aseptic techniques. Follow institutional biosafety standards for work with human cells.\n1. Reagents and Equipment for Preparation of Reprogramming Initiation\nPrepare the modified-mRNA cocktail encoding reprogramming factors.\n\t\nFollow the previously published protocol10 to perform in vitro transcription, capping, and dephosphorylation procedures for each modified mRNA encoding individual reprogramming factor. After the final purification step, elute the modified mRNA with nuclease-free water, supplement the purified modified mRNA solution with 1 U/µL RNase inhibitor, quantitate the modified mRNAs using a spectrophotometer, and store at -80 °C for up to 6 months. Prepare multiple aliquots of each modified mRNA to minimize the number of freeze-thaw cycles.\n\t\tNOTE: Similar protocols for modified mRNA production have been reported elsewhere5,8,11. Templates for in vitro transcription can be generated by PCR amplification from corresponding plasmid templates using primers listed in the Table of Materials according to the previously published protocol10. Plasmid templates for each reprogramming factor (M3O9, SOX2, KLF4, cMYC, NANOG, LIN28A) and mWasabi (control for transfection) are available from Addgene, a non-profit plasmid repository.\nMix together all the modified mRNAs at a molar ratio of 3:1:1:1:1:1 (M3O : SOX2 : KLF4 : cMYC : NANOG : LIN28A) and include 10% mWasabi modified mRNA as a control for the transfection efficiency. Adjust the concentration of the complete modified mRNA reprogramming mix to a final concentration of 100 ng/µL by adding nuclease-free water supplemented with 1 U/µL RNase inhibitor. Prepare seven 33 µL aliquots of the complete modified mRNA cocktail. Store the mixed reprogramming aliquots at -80 °C.",
    "NOTE: For each transfection, 1,000 ng of the modified mRNA cocktail is added per well (i.e., a total of 3,000 ng for 3 wells). Each 33 µL aliquot is sized to transfect 3 wells of a 6-well format plate and includes 3 µL of excess volume to account for pipetting errors. Preparing seven 33 µL aliquots is sufficient to complete a full fibroblast reprogramming of 3 wells in a 6-well format plate.\nPrepare the cocktail of reprogramming miRNA mimics.\n\t\nDissolve lyophilized miRNA mimics (Syn-hsa-miR-302a-3p, Syn-hsa-miR-302b-3p, Syn-hsa-miR-302c-3p, Syn-hsa-miR-302d-3p, Syn-hsa-miR-367-3p) to a 5 pmol/µL (5 µM) final concentration in nuclease-free water supplemented with 1 U/µL of RNase inhibitor. Prepare multiple aliquots of each miRNA mimic and store at -80 °C for long term storage.\nMix all miRNA mimics in a 1:1:1:1:1 molar ratio to a final concentration of 5 pmol/µL (5 µM). Prepare seven 14 µL aliquots of the miRNA mimics mix. Store the mixed aliquots at -80 °C.\n\t\tNOTE: For each transfection, 20 pmol of the miRNA mimics mix is added per well (i.e., a total of 60 pmol for 3 wells). Each 14 µL aliquot is sized to transfect 3 wells of a 6-well format plate and includes 2 µL of excess volume to account for pipetting errors. Preparing seven 14 µL aliquots is sufficient to complete a full fibroblast reprogramming of 3 wells in a 6-well format plate.\nPrepare the transfection buffer.\n\t\nPre-warm one 500 mL bottle and one 100 mL bottle of fresh reduced-serum medium to room temperature (RT) for approximately 2 h. Do not use a water bath.\nTransfer a pH meter to a biosafety cabinet. Wash the meter's glass electrode with nuclease-free water. Calibrate the pH meter according to the manufacture's instructions. Wash the electrode again with nuclease-free water.",
    "Transfer both bottles of reduced-serum medium into the biosafety cabinet. Use the 500 mL RT bottle to adjust the pH.\nMeasure the base pH of the reduced-serum medium by inserting the pH meter's glass electrode into the buffer. Wait up to 1 min before reading the pH on the meter.\nAdd 3–4 mL of 1 M NaOH into 500 mL of reduced-serum medium, close the bottle, and mix well. Wait up to 5 min before opening the bottle for pH measurement. Insert the pH meter's electrode into the buffer and wait until the reading on the pH meter stabilizes.\nContinue adding small volumes of 1 M NaOH until the pH of reduced-serum medium reaches 8.15–8.17. Calibrate the pH meter several times during the process. If at any point the pH becomes higher than 8.18, reduce it by adding fresh reduced-serum medium from the pre-warmed 100 mL bottle (step 1.3.1).\n\t\tNOTE: The pH of the reduced-serum medium-based transfection buffer is critical. Reprogramming will be successful if the pH of the transfection buffer is about 8.2 ± 0.05 but may fail if the pH is higher than 8.25. Therefore, it is advised to stop adding NaOH once the buffer's pH reaches 8.15–8.17. This will ensure that the final pH of the transfection buffer is approximately 8.2–8.22 after sterilization.\nFilter sterilize the transfection buffer using a 0.22 µm vacuum filtration system. Aliquot the sterilized buffer into 5 or 15 mL tubes with minimal air space.\nStore aliquots of the transfection buffer for up to 3 months at 4 °C. Measure the pH of the aliquots periodically. Discard the aliquots if the pH is higher than 8.25. Limit aliquot usage to 2 transfections only since exposure of the transfection buffer to atmospheric air increases the pH of the buffer.",
    "Prepare the fibroblast expansion medium (FEM): minimum essential medium supplemented with 10% fetal bovine serum (FBS), 1x non-essential amino acids, 1x glutamine supplement, 55 µM 2-mercaptoethanol, 1x pen/strep/fungizone. Store the FEM at 4 °C.\nPrepare the reprogramming medium: DMEM/F12 (no HEPES) supplemented with 20% knockout serum replacement (KOSR), 0.5x non-essential amino acids, 0.5x glutamine supplement, 55 µM 2-mercaptoethanol, 50 µg/mL ascorbic acid, 1x pen/strep/fungizone, 100 ng/mL bFGF, and 200 ng/mL B18R. Prepare the medium at the initiation of reprogramming without bFGF and B18R, and store it at 4 °C. Do not use it beyond 1 month following preparation. Add bFGF and B18R immediately before each use to an aliquot sized for that day's use.\nPrepare the plating medium by adding 5% heat-inactivated (HI) FBS into the reprogramming medium containing 20% KOSR without bFGF and B18R from step 1.5. Prepare the medium fresh on the day of intended use. Add bFGF and B18R immediately before use on day 0 of reprogramming.\nCalibrate the tissue culture incubators before initiating reprogramming according to the manufacturer's instructions using a handheld digital CO2 analyzer. Use a low-O2 incubator for the reprogramming steps to ensure successful iPSC generation.\n2. Culturing Fibroblasts for Reprogramming\nPrepare fibroblasts prior to the initiation of reprogramming (day -2).\n\t\nCoat a new 10 cm tissue culture plate with 5 mL of 0.1% gelatin. Tap or swirl the plate to ensure that the entire surface is coated. Incubate for 15 min at 37 °C. Aspirate gelatin and add 10 mL of FEM. Set aside. Do not allow the coated surface of the plate to dry before adding FEM.",
    "Carefully aspirate the spent medium from the fibroblasts. Rinse the cells once with 5 mL of DPBS to remove the residual serum. Add 3 mL of trypsin-EDTA. Gently rock the plate to ensure complete coverage over the cells.\nAspirate excess fluid, leaving ~500 µL of trypsin. Do not over-aspirate, since this can dry and kill the fibroblasts. Incubate the fibroblasts with trypsin-EDTA for 3 min at 37 °C.\nRemove the plate from the incubator and firmly but gently tap the side of the plate to dislodge the cells. Check the cells under the microscope. If the cells are detached and floating, proceed. If the cells are still attached, incubate for another 3 min.\nQuickly rinse/collect the detached cells using 5 mL of FEM to neutralize the trypsin-EDTA. Move the fibroblast suspension into a 15 mL conical tube. Ensure that the cells are well-mixed.\nGently mix the cell suspension to break large clumps of cells, then count them on a hemocytometer. Transfer 2.5 x 105 cells into the gelatin-coated 10-cm dish prepared in step 2.1.1. Incubate the cells overnight in the 37 °C, 5% CO2 humidified regular tissue culture incubator.\n\t\tNOTE: The cell density is critical to achieve high reprogramming efficiency, as it is important that the fibroblasts are healthy and rapidly dividing. Plating 2.5 x 105 cells yields a 40-60% confluency 2 days later for most fibroblast samples. Adjust the amount accordingly for diseased or senescent cells to attain the desired 40-60% confluency 48 h later.\nReplace the medium with 10 mL of fresh FEM the following day (day -1).\nPlate the fibroblasts to initiate reprogramming (day 0).",
    "Verify that the fibroblasts to be reprogrammed are at 40–60% confluency (Figure 2, day 0). If the cells are over- or under-confluent, passage the fibroblasts as described in step 2.1 and adjust the plating density accordingly. Culture for another 2 days.\nTransfer 4 mL of DPBS into a 15 mL conical tube. Add 100 µL of recombinant human (rh) laminin-521. Pipette up and down to mix thoroughly.\nAdd 1 ml per well of diluted rhLaminin-521 into 3 wells of a 6-well plate. Incubate the coated plate at 37 °C for 2 h.\nWarm 6 mL of FEM and 4 mL of plating medium to 37 °C. Supplement the plating medium with bFGF to a final concentration of 100 ng/mL and B18R to a final concentration of 200 ng/mL.\nCarefully aspirate the spent medium from fibroblasts (step 2.2.1). Rinse the cells with 5 mL of DPBS and add 3 mL of trypsin-EDTA. Gently rock the plate to cover the cells with trypsin-EDTA.\nAspirate excess fluid, leaving ~500 µL of trypsin, as done in step 2.1.3. Incubate the fibroblasts with trypsin-EDTA for 3 min at 37 °C. Remove the plate from the incubator and firmly but gently tap the side of the plate to dislodge cells. Check the cells under the microscope. If the cells are detached and floating, proceed. If the cells are still attached, incubate for another 3 min.\nRinse/collect the detached cells using 5 mL of FEM to neutralize the trypsin-EDTA. Move the fibroblast suspension into a 15 mL conical tube. Ensure that the cells are well-mixed and count them on a hemocytometer. Pipette 12,000 cells into 4 mL of prewarmed plating medium from step 2.2.4.",
    "NOTE: Do not centrifuge the cells at any point. The number of plated cells can be adjusted up or down as required for slow- or fast-growing lines, respectively.\nRemove the coated plate from the incubator and aspirate diluted rhLaminin-521 from the coated wells. Do not allow the surface of the wells to dry. Gently resuspend cells in the plating medium. Pipette 1 mL of cell suspension into each coated well (i.e., 3,000 cells per well).\nPlace the plated cells into a tri-gas tissue culture incubator with O2 set to 5% (low-O2). Once the plate is set down, gently but thoroughly disperse cells by alternating between an up/down then left/right motion. Repeat the motions 2 more times. Incubate the cells overnight. Do not swirl the plate to mix.\nPipette 4 mL of reprogramming medium to a 15 mL conical tube and place it in the low-O2 incubator with a loosened cap to equilibrate overnight. Do not add bFGF and B18R until the following day.\n3. Initiation of Reprogramming (day 1)\nNOTE: Once the reprogramming is initiated, daily maintenance is required for approximately 1 month. Be sure to plan accordingly. All subsequent cell incubations must be performed under low-O2 conditions in the 37 °C, 5% CO2, 5% O2 humidified tri-gas tissue culture incubator.\nReplace the plating medium at least 1 h prior to transfection.\n\t\nRemove the equilibrated reprogramming medium from the low-O2 incubator. Add bFGF to a final concentration of 100 ng/mL and B18R to a final concentration of 200 ng/mL. Mix well.",
    "Proceeding with 1 well at a time, use a 1 mL pipette to remove the spent medium and replace it with 1 mL of reprogramming medium supplemented with bFGF and B18R. Repeat this for each well. Do not use vacuum aspiration, which excessively dries the cells, causes stress, and reduces reprogramming efficiency. Move the plate with cells back into the low-O2 incubator.\nTransfect fibroblasts with 5 µL of RNAiMax transfection reagent per 1 µg of modified mRNA, and 1 µL of the transfection reagent per 6 pmol of miRNA mimics per transfection.\n\tNOTE: Optimal results are obtained when transfections proceed for 16–20 h. The transfection reagent is diluted 10x; the 100 ng/µL modified mRNA cocktail is diluted 5x; and the 5 pmol/µL miRNA mimics mix is diluted 8.33x with the transfection buffer prior to complexation. See Table 1 for a summary of the transfection setup.\n\t\nWhile preparing the transfection mixes, minimize potential exposure of reagents to RNase by following standard laboratory practice.\nEquilibrate an aliquot of the transfection buffer (step 1.3) for approximately 1 h at RT. Do not use a 37 °C water bath or incubator to warm up the transfection buffer.\nRemove a single aliquot of modified mRNAs (33 µL) and miRNA mimics (14 µL) from -80 °C and warm them to RT for approximately 3-5 min, until thawed. Do not thaw the aliquots at 37 °C. Spin them down briefly in a microfuge.\nWarm the transfection reagent to RT for approximately 3-5 min. Do not use a 37 °C water bath or incubator. Invert the closed tube 2–3 times to mix the reagent. Spin it down briefly in a microfuge.",
    "Transfer 279 µL of the RT transfection buffer into an RNase-free microcentrifuge tube. Add 31 µL of the transfection reagent to achieve a final volume of 310 µL. Mix thoroughly by pipetting. Do not vortex. Incubate the tube at RT for 1 min.\n\t\tNOTE: This volume of the diluted transfection reagent is sufficient to complex both the modified mRNA and miRNA mimics aliquots from step 3.2.3.\nAdd 132 µL of the RT transfection buffer to the 33 µL aliquot of modified mRNA. Gently pipette to mix: final volume is 165 µL.\nAdd 102.6 µL of the RT transfection buffer to the 14 µL aliquot of miRNA mimics. Gently pipette to mix: final volume is 116.6 µL.\nAdd 165 µL of the diluted transfection reagent from step 3.2.5 to the diluted modified mRNA from step 3.2.6. Pipette to mix: final volume is 330 µL.\nAdd 116.6 µL of the diluted transfection reagent from step 3.2.5 to the diluted miRNA mimics mix from step 3.2.7. Mix well (final volume is 233.2 µL). Incubate for 15 min at RT to allow the transfection buffer to complex with the modified mRNAs and miRNA mimics.\nRemove the plate with cells from the low-O2 incubator. Add 100 µL (1 µg) of the complexed modified mRNA transfection mix to each well, dropwise across the well. Disperse the transfection complexes by gently but thoroughly agitating the plate with an up/down then left/right motion. Do not swirl the plate to mix.\nAdd 66.7 µL (20 pmol) of the complexed miRNA mimics transfection mix to each well, dropwise across the well. Disperse transfection complexes by gently but thoroughly agitating the plate with an up/down then left/right motion. Do not swirl the plate to mix.",
    "Place the transfected cells into the tri-gas incubator with O2 set to 5% (low-O2). Once the plate is set down, disperse the transfection complexes again by gently but thoroughly agitating the plate with an up/down then left/right motion.\nPipette 4 mL of reprogramming medium into a 15 mL conical tube and place it in the low-O2 incubator with loosened cap to equilibrate overnight. Do not add bFGF and B18R until the following day.\ntable:\n﻿0,1,2\nTube 1 - RNAiMax dilution (1st mix),Tube 1 - RNAiMax dilution (1st mix),Tube 1 - RNAiMax dilution (1st mix)\nReagent,Concentration,Volume\nTransfection Buffer,,279 µL\nRNAiMax (add 2nd),10x,31 µL\n,,Total: 310 µL\n,,(incubate 1 min at room temperature)\nTube 2 - modified mRNA mix (2nd mix),Tube 2 - modified mRNA mix (2nd mix),Tube 2 - modified mRNA mix (2nd mix)\nReagent,Concentration,Volume\nmodified mRNA mix,100 ng/µL (5x),33 µL\nTransfection Buffer,,132 µL\n,,Total: 165 µL\n,,(add equal volume of diluted RNAiMax from Tube 1)\nTube 3 - miRNA mimics mix (3rd mix),Tube 3 - miRNA mimics mix (3rd mix),Tube 3 - miRNA mimics mix (3rd mix)\nReagent,Concentration,Volume\nmiRNA mimics mix,5 pmol/µL (8.33x),14 µL\nTransfection Buffer,,102.6 µL\n,,Total: 116.6 µL\n,,(add equal volume of diluted RNAiMax from Tube 1)\nTable 1: Preparation of transfection mix.\n4. Replacing Reprogramming Medium between Transfections (days 2, 4, 6, 8, 10, and 12)\nReplace the medium 16–20 h post-transfection as described in 3.1.1–3.1.2. Add bFGF to a final concentration of 100 ng/mL and B18R to a final concentration of 200 ng/mL into reprogramming medium aliquots.\nMonitor mWasabi expression daily to confirm transfection quality using a microscope configured to visualize EGFP.\n\tNOTE: mWasabi expression should be minimally apparent on day 2 and increase in brightness with each additional transfection.\n5. Every-Other-Day Transfections (days 3, 5, 7, 9, 11, and 13)",
    "Perform the transfection as described in step 3.2. Do not change the medium on days of transfection.\nPrepare a 4 mL aliquot of reprogramming medium and place it in the low-O2 incubator to equilibrate for the medium change on the following day. Do not add bFGF and B18R until the following day.\n6. Procedures to be Performed after Final Transfection\nPerform daily medium changes from day 14 through approximately day 17. Warm 7 mL of reprogramming medium to 37 °C. Add bFGF to a final concentration of 100 ng/mL.\n\tNOTE: B18R is no longer necessary after the final transfection. Beyond day 14, it is no longer necessary to equilibrate the medium overnight in the low-O2 incubator.\nRemove the medium from all wells using a serological pipette. Continue to avoid using aspiration. Add 2 mL of reprogramming medium supplemented with bFGF per well.\nOn days 17 and 18, analyze the reprogrammed wells under an inverted or dissecting microscope. If colonies are formed in close proximity to each other due to high efficiency of reprogramming and cannot be manually isolated, separate the colonies by performing an optional passaging of reprogrammed wells described in step 7 below. If colonies are sparse and well-separated, manually pick the clones directly from the reprogrammed well as described in step 8 and subculture iPSCs according to standard protocols.\n7. Optional Procedure: Passaging Cells from Reprogrammed Wells using EDTA\nPrepare 0.5 mM EDTA in DPBS (EDTA) by diluting the 0.5 M EDTA stock solution. Filter sterilize EDTA using a 0.22 µm vacuum filtration system.\nPrepare feeder-free pluripotent stem cell (PSC) medium (e.g., mTeSR1) according to the manufacturer's instructions. Pre-warm 32 mL of PSC medium to 37 °C.",
    "Coat all wells of two 6-well format plates with hESC-qualified extracellular matrix (ECM) following the manufacturer's instructions. Seal plates with paraffin film and incubate them for 1 h at RT.\nAspirate the ECM solution from the pre-warmed plates and replace it with 2 mL of PSC medium per well. Do not allow the surface of the wells to dry. Set them aside.\nAspirate the reprogramming medium from 2 reprogrammed wells on a day when the colonies are large and clearly formed (usually day 18). Rinse once with 1 mL of EDTA and aspirate.\nAdd 1 mL of EDTA per well. Incubate for 4 min at 37 °C.\nGently remove the plate from the incubator and place it in the biosafety cabinet.\n\tNOTE: At this point, cells may be very loosely adhered and easily dislodged.\nCarefully aspirate EDTA from both wells. Add 3 mL of pre-warmed PSC medium to each well treated with EDTA. Use a cell-scraper to gently but thoroughly dislodge cells from both wells.\nUse a serological pipette to gently pipette the cell suspension and break up large clumps. Do not pipette until all the cell clumps are gone. Preserve iPSC clusters.\n\tNOTE: Plating large clumps will not affect iPSC colony outgrowth. If there are excessively large cell clumps, simply avoid transferring them into the next dish.\nUsing a serological pipette, evenly distribute cells from each EDTA-treated well by pipetting 0.5 mL into each well of the ECM-coated 6-well plate.\n\tNOTE: Do not combine cells from the reprogrammed wells (i.e., reprogrammed well 1 should be evenly distributed into the first 6-well plate, and reprogrammed well 2 should be evenly distributed into the second 6-well plate).",
    "Move the plated cells back into the low-O2 incubator. To evenly distribute cells, shake each plate back-and-forth and side-to-side. Do not swirl. Replace the PSC medium daily.\n8. Picking iPSC Colonies\nPre-warm 15 mL of PSC medium to 37 °C. Coat all wells of a single 6-well plate with hESC-qualified ECM following the manufacturer's instructions. Seal the plates with paraffin film and incubate them for 1 h at RT.\nAspirate the culture medium from wells being used to collect iPSCs. Rinse once with 1 mL of EDTA and aspirate. Add 1 mL of EDTA per well. Incubate for 4 min at 37°C. While the cells are incubating, aspirate the ECM solution from the pre-warmed plates and replace with 2 mL of PSC medium per well. Set the plates aside.\nGently remove the plate with iPSCs to be picked from the incubator and place it in the biosafety cabinet.\n\tNOTE: At this point, cells may be very loosely adhered and easily dislodged.\nCarefully aspirate EDTA. Very gently add 3 mL of pre-warmed PSC medium, taking care not to dislodge iPSC colonies.\nMove the plate to an inverted or dissecting scope to better visualize colonies. Prepare a 1 mL pipette with a sterile tip. Depress the plunger fully, then use the pipette tip to gently scrape a colony while slowly drawing liquid into the tip to collect the colony. Draw as little medium as possible while picking the iPSC colony.\nTo transfer the colony, pipette up and down 3–4 times in a single well of the ECM-coated plate from step 8.2. Repeat until 6 colonies have been picked and transferred into individual wells. Pick no more than 2 colonies from any single well if an optional passaging described in step 7 has been performed.",
    "Use a standard human stem cell protocol to freeze down all remaining wells. Thaw and re-plate frozen stocks if more colonies must be picked later.\n9. Characterization of iPSCs\nPerform TRA-1-60 staining for analysis of reprogramming efficiency (day 18).\n\tNOTE: 2 out of 3 reprogrammed wells are passaged for future colony picking. The remaining well can be used for TRA-1-60 staining. This procedure can be performed on the laboratory bench top.\n\t\nWash the reprogrammed well with 1 mL of PBS. Fix cells with ice-cold methanol at -20 °C for 5 min.\nAspirate methanol. Dry the well for approximately 2 min. Be careful not to over-dry. The cells have dried enough when they become a translucent/matte color.\nWash the well 3 times with 1 mL of PBS for 5 min with gentle shaking. During the washes, prepare 3 mL of 3% hydrogen peroxide in PBS.\nAspirate the PBS. Add 2 mL of diluted peroxide solution. Incubate for 15 min at RT with gentle shaking. Prepare 4 mL of the blocking solution: 10% bovine-serum albumin (BSA) in PBS.\nAspirate the peroxide solution. Wash the well 2 times with 1 mL of PBS for 5 min.\nAspirate PBS and add 2 mL of blocking solution into the well. Incubate for 1 h at RT.\nWash the well 3 times with 1 mL of PBS for 5 min with gentle shaking.\nDilute primary anti-TRA-1-60 antibody at 1:100 in the blocking solution supplemented with 0.05% sodium azide. Prepare 1 mL of antibody dilution for 1 well of a 6-well format dish. Add the antibody dilution to the well and wrap the plate with parafilm to avoid evaporation. Incubate overnight at 4 °C with gentle shaking.",
    "NOTE: If needed, the incubation with the primary antibody can be done for 1 h at RT with gentle shaking. The primary antibody dilution can be re-used up to 5 times.\nAfter incubation with the primary antibody, wash the well 3 times with 1 mL of PBS for 5 min with gentle shaking.\nDilute the secondary anti-mouse HRP-conjugated antibody at 1:200 in the blocking solution. Incubate the well with the secondary antibody dilution for 2 h at RT with gentle shaking.\nAspirate the secondary antibody dilution and wash the well 3 times with 1 mL of PBS for 5 min with gentle shaking.\nDuring the third wash, prepare the substrate solution following the manufacturer's instruction. After the final wash, aspirate PBS. Add 1 mL of the substrate solution and incubate until desired color develops (approximately 10 min).\nAspirate the substrate solution. Rinse the well with water for 5 min while gently shaking.\nCount the colonies, if desired. Reprogramming efficiency = (number of colonies) / (number of plated fibroblasts) x 100%.\nFor long-term storage, aspirate water from the stained plate and air-dry overnight at RT. Seal the dried plate with parafilm and store at 4 °C for up to 2 years to assess reprogramming efficiency later."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}