{
  "id": 17585,
  "origin_website": "Jove",
  "title": "Intraoperative Assessment of Resection Margins in Oral Cavity Cancer: This is the Way",
  "procedures": [
    "This study was approved by the institutional Medical Ethics Committee (MEC-2015-150).\nNOTE: All the patient and personnel information in the figures or examples are fictional (i.e., XXXXX and YYYYY).\n1. Before surgery\nSurgery department: Request for IOARM during the planning of surgery.\nPathology department: Ensure logistics/equipment (see Table of Materials) and the availability of personnel (pathologist/pathology resident and assistant).\n2. During surgery\nOperation room (OR)\n\t\nEnsure that all involved personnel are familiar with the relocation protocol12.\nFollow the relocation protocol.\nSubmerge the tags in chlorhexidine for at least 30 min before the start of the surgery.\nPlace the tags paired on either side of the intended line of resection (both superficial and deep), so that one tag is on the resection specimen and the other remains at the corresponding spot in the wound bed (Figure 1A) as described by Van Lanschot et al.12.\nCut between each pair of tags.\nRemove the specimen with the tumor (one tag from each pair remains in the wound bed, Figure 1B).\nFill out the pathology request form with a clear indication of the anatomical location of the tags (e.g., tag 1 = anterior, tag 2 = superior).\nRecord the surgical procedure-related defects of the specimen and their location in relation to the tags, on the pathology request form.\n\t\tNOTE: Procedure-related defects create false resection surfaces and can lead to incorrect allocation of inadequate margins during both IOARM and final pathology.\nBring the specimen to the pathology department.\nimgsrc://cloudfront.jove.com/files/ftp_upload/62446/62446fig01.jpg\nFigure 1: Illustration of the relocation protocol. (A) Application of tags in a pair-wise manner. (B) Wound bed and specimen both with one tag of each pair. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/62446/62446fig01large.jpg]\nIOARM - Grossing room (GR), pathology department",
    "Rinse the specimen with water and gently pat it dry with gauze or paper.\n\t\t窶起OTE: Register every next step with photographs and store them in the Electronic Patient File (EPF).\nRecord the general information (date, patient id, pathology number, surgeon, pathologist, type of specimen, and tags used) on the anatomical template.\nIndicate the locations of the tags on the anatomical template (Figure 2).\nPlace the specimen on the anatomical template.\nimgsrc://cloudfront.jove.com/files/ftp_upload/62446/62446fig02.jpg\nFigure 2: Example of anatomical template for IOARM. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/62446/62446fig02large.jpg]\nInk the resection surface according to standard protocol (e.g., superior blue and inferior green).\nInspect the specimen visually and by palpation (pathologist and surgeon).\nIndicate the location of any suspicious region (i.e., margin <5 mm) on the anatomical template and relate it to the numbered tags (section Result of IOARM, Figure 2).\nPerform an incision perpendicular to the resection surface at the suspicious region (Figure 3A). Depending on the size of the specimen and/or suspicious regions, make one or more incisions with a distance of about 5 mm. In case of more than one incision, number the incisions as IOA1, IOA2, etc.\nMeasure the margins (i.e., the distance between resection surface and tumor border) on the tissue sections (Figure 3B) and record the exact values in mm on the anatomical template (section Result of IOARM, Figure 3C).\n\t窶起OTE: If the tumor border is macroscopically not distinguishable (e.g., the tumor cannot be distinguished from surrounding fibrotic or salivary gland tissue), microscopic analysis by frozen section is indicated.\nimgsrc://cloudfront.jove.com/files/ftp_upload/62446/62446fig03.jpg\nFigure 3: Illustration of IOARM. (A) Perpendicular incision performed after identification of suspicious region by palpation. (B) The margin is measured. (C) The result of IOARM and the recommendation are recorded. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/62446/62446fig03large.jpg]",
    "Proceed with the completion of the operation, step 2.2.19. If an adequate margin is detected (i.e., additional resection is not needed).\nIndicate the exact location based on the tags if an inadequate margin is detected and record it on the template. Proceed with an additional resection if surgically/technically achievable, step 2.2.13.\nAnnotate the reason on the template, if an additional resection is not achievable (section Additional comments, Figure 2).\nRecommend (pathologist/surgeon) the additional resection based on the exact location and indicate the thickness needed to achieve an adequate resection (Figure 3C).\n\tNOTE: If the inadequate margin concerns a positive margin, a minimal thickness of 6 mm should be recommended for the additional resection.\nKeep (pathologist) the main resection specimen in the refrigerator until the additional resection is received.\nRelocate (surgeon) the area of additional resection in relation to the tags, in the wound bed, based on the record of IOARM (Figure 3C).\nPerform the additional resection.\nSend the additional resection to the GR.\nVerify (pathologist) the accuracy of the additional resection regarding its location (based on tags) and its size.\n\tNOTE: The above steps are applicable in the case of a close margin. In the case of a positive margin, an IOARM of the additional resection is necessary (pathologist). The surgeon waits for the result of the second IOARM before completing the operation.\nRemove (surgeon) the remaining tags from the wound bed and complete the operation.\nCopy (pathologist) all data from the anatomical template to the EPF.\n3. After IOARM - Grossing room (GR), pathology department\nNOTE: To preserve the anatomical orientation and shape of the specimen the following steps are performed.\nReassemble the specimen by the correct orientation of all tissue sections (cross-sections and the polar ends) based on the tags and the photographs recorded during IOARM.",
    "窶起OTE: Cross-sections are in the middle of the specimen and the polar ends are the outer parts of the specimen.\nCut the pieces of cork slightly larger than the tissue sections.\nPlace each tissue section on a piece of cork.\nDraw a line on the cork around the tissue section with a permanent marker and take a photograph (Figure 4A).\nPlace another piece of cork on top of all tissue sections except the polar ends (Figure 4B).\nKeep the upper and lower cork together, with the tissue section in between, by placing pins through both corks next to the edge of the tissue section, but not through the tissue section (Figure 4B).\nimgsrc://cloudfront.jove.com/files/ftp_upload/62446/62446fig04.jpg\nFigure 4: Illustration of the method to preserve the anatomical orientation and shape of tissue sections. (A) Tissue sections are placed on a piece of cork with a line drawn on the cork around the tissue section with a permanent marker. (B) Pins are obliquely placed over the polar ends and another piece of cork is placed over the tissue section. (C) Illustration of a reassembled fresh specimen kept together with pins that puncture the adjacent corks. (D) Illustration of a reassembled fixed specimen kept together with pins that puncture adjacent corks. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/62446/62446fig04large.jpg]\nPlace the polar ends on a separate piece of cork (Figure 4A).\nKeep the polar ends attached to the cork by obliquely placing pins over the tissue and piercing the cork just beside the edge of the tissue (Figure 4B).\n\tCAUTION: Do not puncture the specimen with the pins.\nReassemble the whole specimen: put all the tissue sections including the polar ends together in the correct anatomical orientation.\nKeep all the tissue sections together by puncturing the adjacent corks (Figure 4C).",
    "Position the specimen with the correct orientation on the anatomical template and take a photograph.\nPlace the specimen in formaldehyde solution (formalin 4%).\n\tNOTE: For proper fixation, pieces of paper can be placed on top of the specimen to keep it submerged in formalin.\nMake a clear and visible warning note on the container with the specimen (e.g., caution needles/pins), to avoid accidents.\nStore the container with the specimen for further processing, according to the standard pathology protocol.\n4. Grossing of the fixed specimen after IOARM\nNOTE: After formalin fixation, the specimen should be grossed preferably by the pathologist/resident/assistant, who performed the IOARM.\nCAUTION: Be careful with the needles/pins when removing the specimen from the container.\nFollow the institutional grossing protocol.\n\t窶起OTE: Take additional measures to ensure the correct orientation and to facilitate the comparison of the margin status between IOARM and final pathologic assessment.\n\t\nConsult the pictures of the IOARM.\nTake the specimen out of the container.\nCheck whether all the tissue sections are present.\nPosition the specimen with the correct orientation on the anatomical template and take a photograph (Figure 4D).\nRemove the pins.\nSeparate the individual tissue sections with corresponding cork.\nTake photographs of each tissue section with their corresponding corks, focusing on the lines that were drawn around the tissue section to assess possible shrinkage of tissue after fixation (Figure 5).\nimgsrc://cloudfront.jove.com/files/ftp_upload/62446/62446fig05.jpg\nFigure 5: Illustration of a polar end with the cut surface facing the cork, held against the cork by tilted pins. (A) Fresh specimen. (B) After fixation. (C) The cut surface of the polar end is flat after fixation. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/62446/62446fig05large.jpg]\nDetach all tissue sections systematically from the cork (e.g., start from anterior to posterior or left to right).",
    "Gross the IOARM-tissue sections to the standard final tissue sections (2-3 mm thick).\nPlace all final tissue sections, in the correct anatomical orientation (e.g., from anterior to posterior), on a paper on the grossing table.\nNumber all the final tissue sections consecutively with a permanent marker on the paper (Figure 6).\nAnnotate the location of IOARM with a permanent marker (Figure 6).\nTake photographs, including all final tissue sections and store them in the EPF (Figure 6).\nSelect the relevant final tissue sections and IOARM sections to be further processed for final pathologic assessment.\nimgsrc://cloudfront.jove.com/files/ftp_upload/62446/62446fig06.jpg\nFigure 6: Grossed specimen with the location of the IOARM marked. Corresponding numbers 1-5 refer to tissue sections from left to right. A-E corresponds with tissue sections included for histopathologic evaluation. Note that the remaining piece of tissue that was evaluated by frozen section (FS) is indicated to enable direct comparison with the permanent HE-stained section. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/62446/62446fig06large.jpg]\n5. The final pathologic assessment - Impact of IOARM on final margin status\nFollow the local standardized protocol. The protocol followed here is the PALGA (Pathologisch-Anatomisch Landelijk Geautomatiseerd Archief, the nationwide network and registry of histo- and cytopathology in the Netherlands) national Head-Neck protocol for the final standardized structured pathology report.\n\tNOTE: This protocol is based on the up-to-date standards of the American Joint Committee on Cancer (AJCC), Union for International Cancer Control (UICC), and the World Health Organisation (WHO).\n\t\nAssess all the margins in millimeters, including mucosa, submucosa, and bone.\nIf an inadequate margin is found, annotate its extent (e.g., submucosal margin anterior is 3.5 mm, extending over a trajectory of 6 mm).\nAssess the presence of dysplasia and its grade for mucosal resection margins.",
    "Indicate the final margin by adding the dimensions of the additional resection (if performed) to the margin measured on the main specimen.\nRecord the unique pathology number of the additional resection in the pathology report of the main specimen (e.g., Margins: anterior 6 mm, posterior 8 mm, superior 6 mm (including 3mm of the additional resection, H20-2021), inferior 7 mm, medial 5.3 mm).\nVerify the margins found during IOARM.\nAnnotate the result of this verification (e.g., NB Margins found during the intraoperative assessment are in concordance with margins based on the final pathology).\n\t\tNOTE: The time needed for IOARM should be limited in order to not interfere with the surgical workflow. At the institute, the IOARM takes about 10 min. The surgeon and pathologist perform the IOARM together. For the relocation method (placing the tags during surgery) an additional time of 5 min is needed. This will differ for each institute depending on the logistics."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}