{
  "id": 1831,
  "origin_website": "Cell",
  "title": "High-throughput screening for agonists of ROS production in live human vascular endothelial cells",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPause point: There are no pause points during the three days of the experiment. Before you start, please secure enough time for the experiment.\nPrepare cultured vascular endothelial cells for measurement of ROS production\nTiming: (Day 1–2) 1–2 h at Day 1, ∼1 h at Day 2.\nIn this section, we describe the method for seeding endothelial cells from a 100-mm culture dish into a 96-well culture plate for the measurement of ROS production.\nNote: The steps 1–3 must be performed on a BSL-2 safety cabinet.\nNote: In all steps, EGM2-MV medium and PBS(–) should be warmed to 37°C before use to avoid cold stimulation of the cells.\n(Day 1) Collect the cells from a 100-mm culture dish.\nDiscard the medium.\nRinse the cells with PBS(–).\nDiscard the PBS(–).\nAdd 3 mL of 0.25% trypsin solution with EDTA.\nIncubate at 37°C for 2–3 min.\nAdd 7 mL of the medium.\nStrip the cells from the dish by tapping the side of the dish twice and gently pipetting.\nTransfer the cells into a 50 mL centrifuge tube.\n(Day 1) Seed the cells in a 96-well culture plate.\nCentrifuge the cells at 450×g for 5 min.\nDiscard the supernatant.\nSuspend the cells in the medium.\nCount the cells in the suspension.\nDiscard PBS(–) from the collagen-I-coated 96-well culture plate (flat and clear bottom; black side) prepared in step 1 (“before you begin[href=https://www.wicell.org#before-you-begin]”).\nSeed approximately 1.0 × 104 cells into each well of the plate.\nCulture the cells in each well of the plate with 200 μL of the medium.\nIncubate at 37°C under 5% CO2 for at least 16 h (Do not disturb the cells for at least 1 h after seeding to avoid affecting cell adhesion).",
    "Note: The outermost wells of the plate (rows A and H, columns 1 and 12) cannot be measured by the high-content analysis CQ1, and therefore, you can use only the 60 wells defined by rows B-G and columns 2–11. Troubleshooting 3[href=https://www.wicell.org#sec6.5]\n(Day 2) Change the medium.\nDiscard the medium.\nAdd fresh medium.\nIncubate at 37°C under 5% CO2 for at least 16 h.\nSet up the measurement protocol of the high-content analysis CQ1\nTiming: (Day 3) ∼30 min\nIn this section, we describe the method for setting up the measurement protocol in the CQ1 software to capture multiple fluorescence images of CellROX orange staining, WGA AF488 conjugate staining, and Hoechst 33342 staining. Troubleshooting 4[href=https://www.wicell.org#sec6.7]\nSet up the measurement protocol of CQ1 software as follows.\nTo capture Hoechst 33342 staining, set a combination of 405 nm excitation wavelength and emission filter 447/60 in channel 1.\nTo capture WGA AF488 conjugate staining, set a combination of 488 nm excitation wavelength and emission filter 525/50 in channel 2.\nTo capture CellROX orange staining, set a combination of 561 nm excitation wavelength and emission filter 617/73 in channel 3.\nSet the minimum exposure time of all channels.\nSet the binning number of image resolution to 8.\nSet 5 fields of view in a well.\nSet a normal-focus 20× magnification lens.\nSet the Z stack condition to 5 slice images with 3 μm steps.\nCritical: Steps d and e are important to minimize the difference in measurement time between the first- and the last-measured wells.\nNote: In our experience, these settings in steps f and g enable analysis of approximately 500 cells in one well.\nTreat endothelial cells with test agonist, and load the cells with ROS fluorescence probe\nTiming: (Day 3) 90–120 min",
    "In this section, we describe the method for pretreating human vascular endothelial cells on a 96-well culture plate with ROS inhibitors, treating the cells with test reagents (hereafter termed Test agonists), and loading the cells with the ROS fluorescence probe.\nNote: The steps 5–8 must be performed on a BSL-2 safety cabinet.\nNote: Before starting the protocol, thaw the stock reagents prepared in “before you begin[href=https://www.wicell.org#before-you-begin]” (WGA AF488 conjugate, ROS inhibitors, and LPS) and the commercial products (CellROX orange and Hoechst 33342).\nPretreat the cells with ROS inhibitors.\nTreat cells with each ROS inhibitor (working concentrations of inhibitors are 500-fold dilution of the stock concentration (see Table 1[href=https://www.wicell.org#tbl1])).\nIncubate for 30 min at 37°C under 5% CO2.\nNote: If dilution of the inhibitors is required, dilute with PBS(–).\nTreat the cells with Test agonists.\nTreat cells with each Test agonist.\nIncubate for the appropriate time at 37°C under 5% CO2.\n30 min before the end of incubation, treat the cells for the positive control group with LPS (1 μg/mL).\nLoad the cells with ROS fluorescence probe.\nImmediately after step 7, treat all cells with a mixture of CellROX orange (5 μM, an ROS fluorescence probe), WGA AF488 conjugate (0.01 mg/mL, a fluorescent cell membrane counterstain), and Hoechst 33342 (2 μg/mL, a nuclear counterstain) (the preparation of a mixture is shown in “materials and equipment[href=https://www.wicell.org#materials-and-equipment]”).\nIncubate for 30 min at 37°C under 5% CO2.\nCapturing fluorescence images with CQ1\nTiming: (Day 3) ∼30 min\nIn this section, we describe the method for capturing multiple fluorescence images of CellROX orange staining, WGA AF488 conjugate staining, and Hoechst 33342 staining by using CQ1.\nNote: The step 9 must be performed on a BSL-2 safety cabinet.",
    "Note: Hanks’ balanced salt solution containing calcium and magnesium (HBSS(+)) and EGM2-MV medium should be warmed to 37°C before use to avoid cold stimulation of the cells.\nWash the cells.\nDiscard the medium from all wells.\nWash the cells twice with HBSS(+).\nDiscard HBSS(+) from all wells.\nAdd fresh medium to all wells.\nNote: To avoid stress stimulation of cells due to the use of low-nutrient medium, this protocol utilizes a complete medium, EGM2-MV. The use of EGM2-MV has little effect on the background.\nPlace the 96-well culture plate into CQ1. Troubleshooting 5[href=https://www.wicell.org#sec6.9]\nIn the pre-recording mode, set the power of the excitation lasers for channel 1, channel 2, and channel 3 to the appropriate intensity to obtain fluorescence images.\nCapture the fluorescence images.\nAnalysis of ROS production with CQ1\nTiming: (Day 3 or later) ∼60 min\nIn this section, we describe a method for analyzing the amount of CellROX orange-derived ROS production per cell area from the fluorescence images captured by CQ1.\nCreate the analysis protocol on CQ1 software as follows (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1310-Fig1.jpg\nFigure 1. Detection of the cell nucleus and cell membrane with CQ1 software",
    "See step 13. The upper left image shows endothelial cells treated with Aβ assemblies for 6 h, amylospheroids (ASPD, 35 nM; this concentration is sufficient to induce ROS production in mitochondria (Sasahara et al., 2021[href=https://www.wicell.org#bib2])). By analyzing the upper left image with the protocol shown in the lower left, the cell nuclei are detected (see the upper middle image) (the periphery of each nucleus is traced in a different color). Then, by analyzing the upper middle image with the protocol shown in the lower right, the whole cell area of each cell, in the center of which the detected nucleus is present, is obtained (see the upper right image) (the periphery of each cell area is traced in the same color as that of the nucleus).\nCreate an analysis protocol (termed “Object 1”) to detect cell nuclei from the maximum intensity projection (MIP) image of Hoechst 33342 staining (as shown in the center image of Figure 1[href=https://www.wicell.org#fig1]).\nCreate an analysis protocol (termed “Object 2”) to detect the whole cell area of endothelial cells, including one nucleus detected in step a, from the MIP images of WGA AF488 conjugate staining (as shown in the right image of Figure 1[href=https://www.wicell.org#fig1]).\nAnalyze the MIP images of fluorescence staining captured in step 12 using the analysis protocol created in step 13.\nExtract the following values from the analysis results exported as an Excel file.\nExtract the value of total fluorescence intensity of CellROX staining, which represents ROS production per cell, from the column titled \"(Object 2) TotalIntensity CH3”.\nExtract the value of the WGA AF488 conjugate staining area, which represents cell area per cell, from the column titled \"(Object 2) area”.\nIf necessary, extract the value of the number of Hoechst 33342 stainings, which represents the cell number analyzed, from the column titled \"Count”.",
    "Calculate the value of ROS production per cell area from the values.\nDivide [the value of total fluorescence intensity of CellROX staining per cell (obtained in step 15-a)] by [the value of WGA AF488 conjugate-staining area per cell (obtained in step 15-b)]."
  ],
  "subjectAreas": [
    "Molecular/Chemical Probes",
    "Microscopy",
    "Cell Biology",
    "Cell-Based Assays",
    "High Throughput Screening"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}