{
  "id": 17328,
  "origin_website": "Jove",
  "title": "The Miniature Pig: A Large Animal Model for Cochlear Implant Research",
  "procedures": [
    "All procedures and animal surgeries were conducted according to the guidelines of the Ethics Committee of the PLA General Hospital and were approved.\n1. Anesthesia and surgical preparation\nInject the pig (male, 2 months old, 5 kg) muscularly with tiletamine and zolazepam with a dosage of 10-15 mg/kg and intubate it with a 5.5-French endotracheal tube. Maintain anesthesia by ventilator-assisted respiration with isofluorane inhalation. Monitor the oxygen saturation (>90%), breathing (15-20/min), and heart rate (60-120 beats/min) using the pulse oximetry clamp of an ECG monitor, which is connected to the pig's tongue.\nPut the mini-pig in a left lateral position (when the right side is to be implanted) on a thermostatically regulated heating pad to prevent hypothermia. Confirm the pig is adequately anesthetized using various stimuli. Ensure the absence of all responses (e.g., toe pinch reflex). Apply artificial tear ointment to the eyes of the minipig to keep the cornea from drying. Keep the eyes closed using a medical patch.\nShave the surgical area around the earlobe, keeping it 10 cm in diameter (Figure 1) and disinfect it with three alternating swabs of iodine and alcohol in a circular motion from the center toward the outside. Cover the surgical area with sterile surgical drapes.\nCover the microscope with a sterile plastic sleeve and remove the parts covering the eyepieces and objective.\n2. Surgical procedure\nLocate the surface projection site of the cochlea 1 cm behind the posterior auricular sulcus at the level of the earlobe. Make a postauricular incision about 5 cm long with the projection site as the center using a #15 scalpel. Divide the subcutaneous tissue, parotid gland, and sternocleidomastoid muscle with micro-scissors to expose the surface of the mastoid bone (Figure 2A). Use bipolar cautery when necessary to minimize bleeding.\nCortical mastoidectomy",
    "Drill the mastoid at the surface projection of the cochlea on the mastoid bone (Figure 2B) to the external auditory canal (EAC), which is dense and pale blue (Figure 2C). Be careful not to damage the pale or reddish vertical segment of the facial nerve dorsal to the EAC to avoid bleeding (Figure 2C).\n\t\tNOTE: If the facial nerve is damaged, bipolar cautery is a good choice to stop bleeding.\nExpose the tympanum by drilling the bone surrounding the posterior bony EAC (Figure 2D). Separate the skin of the EAC and the facial nerve with a hypodermic needle to avoid damaging the facial nerve. Carefully push the skin of the EAC away to expose the tympanum (including the ossicular chain) and round window niche (Figure 3A).\nExpose the round window membrane. Remove the round window niche with a small diamond burr, and keep continuous suction-irrigation to expose the basal turn of the cochlea and round window membrane (Figure 3B).\nFix the receiver package. Separate the cranial parietal muscle to form a pocket just large enough for the receiver. Place the internal receiver package in the muscular pocket and fix it with a fixation suture.\nInsert the electrode array, which is connected to a receiver fixed in a muscular pocket, by opening the round window membrane with a sharp microsurgical knife and inserting the array using micro forceps slowly, steadily, and continuously in relationship to the modiolus of the cochlea (Figure 3C). Suture the surgical incision with an absorbable suture 2-0.\nECAP measurements\n\tNOTE: The setup is composed of a PC with MAESTRO Software connected to the patient's cochlear implant (CI) through the stimulation device (MAX Programming Interface) and the CI coil.",
    "Magnetically connect the CI coil to the CI receiver through the skin. Confirm the integrity of the CI and check the electrode impedance for all channels before ECAP measurements using the telemetry function of the CI, which is conducted by MAESTRO Software automatically (Figure 4A,B).\nConduct the ECAP measurements as described previously19. Select the ECAP module, choose all 12 electrodes for stimulation, and wait for the ECAP tests of the electrodes to be completed. See the Table of Materials for the software and stimulation device used to measure ECAP responses. Stimulate all 12 electrodes for ECAP measurements using biphasic stimuli of 30 µs phase duration, with an alternating-polarity paradigm, averaging over 25 iterations, and a stimulation rate of 45.1 pulses/s.\n3. Postoperative care\nKeep monitoring the mini-pig to avoid harm due to unconscious movement until it has regained sufficient consciousness to maintain sternal recumbency. Put the minipig on the thermostatically regulated heating pad to prevent hypothermia.\nPlace the mini-pig back into its home cage alone.\nInject antibiotics to prevent postoperative infection for 7 days.\nCheck the mini-pig for symptoms of vestibular injury such as nystagmus, circling, or rolling over.\n4. Postoperative CT scan\n Administer intramuscular injection of 3% sodium pentobarbital 1 ml/kg, and 0.1 ml/kg of Sulforaphane to minipig to induce anesthesia. Use a 37℃ warming plate to keep it warm. After 3 or 5 minutes, a CT scan can be conducted. \nTo confirm the correct position of the electrode array, narcotize the mini-pig with tiletamine and zolazepam 1 week after the operation. Perform the CT scan and 3D reconstruction20 using the 3D slicer image computing platform (see the Table of Materials). Import DICOM data of the CT and conduct the Volume rendering module to achieve 3D images of the CI.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}