{
  "id": 11237,
  "origin_website": "Jove",
  "title": "A Cre-Lox P Recombination Approach for the Detection of Cell Fusion In Vivo",
  "procedures": [
    "1. Donor Cell Transfection\nHarvest mesenchymal stem cells (MSCs, derived from H1 embryonic stem cells kindly donated by Dr. Peiman Hematti; alternatively, any cell type of any species hypothesized to fuse in vivo could be employed) when 70 - 80% confluent with 1X trypsin (Mediatech, Manassas VA) for 5 min. Inactivate trypsin with α-MEM complete medium (antibiotic free, Invitrogen, Carlsbad CA)18. Centrifuge at 300 x g for 5 min.\nCarefully aspirate supernatant and re-suspend pellet in 1 mL of 1X PBS and count cells using a hemacytometer.\nTransfer 1.5 x 106 cells to a 1.5 mL centrifuge tube. Centrifuge at 300 x g for 5 min.\nCarefully aspirate supernatant. Resuspend pellet in 300 μL of R Buffer (Neon Transfection System, Invitrogen) and 6 μg (2 μg / 5.0 x 105 cells) of p231 pCMVe-betaAc-STOP-luc (Addgene, Cambridge, MA). Place 3 mL of E Buffer (Invitrogen) into the electroporation docking port per manufacturer's protocol (Neon Transfection System, Invitrogen).\nTransfer cell-plasmid solution to a 100 μL Neon pipet tip and electroporate with a pulse duration of 20 ms and a magnitude of 1500 volts. Place electroporated cells into a 15 mL conical tube containing 9.7 mL α-MEM complete medium.\nRepeat step 1.5 two additional times and pool transfected cells to yield a total volume of 10 mL. Add the 10 mL cell suspension (1.5 x 106 cells) to a T175 flask containing 10 mL α-MEM complete medium. Cell viability after electroporation is approximately 30%, to yield approximately 4.5 x 105 viable cells per T175.\nChange α-MEM complete medium 24 hours following transfection.",
    "Harvest transfected cells when 70 - 80% confluent (~2 - 3 days after electroporation). Perform cell count using a hemacytometer and resuspend the cells at a concentration of 1.0 x 106 cells/50 μL of α-MEM complete medium. Minimize time cells spend in suspension to reduce cell death prior to injection.\n2. Intramyocardial Injection\nInduce anesthesia by isoflurane (Phoenix Pharmaceuticals, Inc., St. Joseph, MO) on transgenic mice engineered to constitutively express Cre recombinase in every cell (B6.C-Tg(CMV-cre)1Cgn/J, Jackson Laboratory, Bar Harbor, ME).\nRemove hair from chest region using hair clippers or chemical hair remover.\nIntubate with an 18 gauge catheter (Becton Dickinson & Co, Franklin Lakes NJ) and place on mouse ventilator at 120 - 130 breaths per minute with a stroke volume of 150 μL.\nMake lateral incision across the fourth intercostal space thereby producing a thoracotomy.\nVisualizing the heart, make two 25 μL injections of transfected cell suspension using a 1 mL syringe (Temuro Medical Corporation, Somerset, NJ) and 28 gauge needle (Becton Dickinson & Co, Franklin Lakes NJ). To ease the intramyocardial injection and prevent excessive damage to the organ, bend the needle head ~90 degrees.\nFollowing injection, use absorbable sutures (e.g., vicryl) to close the ribs and muscle layers. Suture skin closed using 4-0 nylon or silk.\nAllow mouse to recover from anesthesia and extubate.\nControl groups should include Cre mice receiving medium injections only, Cre mice receiving the same concentration of untransfected cells and wild type mice receiving transfected cells (alternatively, Cre mice receiving transfected cells not prone to fuse). \n3. Biophotonic Imaging\nFive to fifteen minutes before imaging, intraperitoneally (IP) inject 10 μL per gram of mouse body weight of 15 mg/mL D-Luciferin (Caliper Life Sciences, Hopkinton, MA).\nInduce anesthesia on mice via isoflurane at 4% for induction and 1 - 2% for maintenance.",
    "Place mice supine in imaging box with facemask administering 1 - 2% isoflurane for maintenance anesthesia (Xenogen Biophotonic Imaging System, Hopkinton, MA). Several mice can be imaged concurrently. Image sham control mouse with experimental mice for easy comparison of luminescent signal.\nUsing Living Image software (Xenogen), set appropriate exposure time (typically 60 sec, see Results). Set area of image to fit mice and keep area consistent throughout imaging to prevent changes in sensitivity. Set subject height at 4.5 cm.\nAcquire luminescence intensity signal corresponding to mouse or mice within the view field and save unmodified image files. Process images to remove background signal corresponding to a control or unmanipulated mouse. Intensity values above background correspond to fused cells within the animal. Intensity analysis can be conducted using Living Image software (Xenogen) or open source image analysis software. Typically, a region of interest (ROI) is selected to compare intensity data between animals and experiments.\n4. Representative Results\nTo determine the sensitivity of the Xenogen Biophotonic Imaging System, a cell line which constitutively expresses luciferase (231-LUC-D3H1, Xenogen) was delivered to the myocardium of C57/Bl6 mice (Jackson Laboratory). Cells were injected at concentrations of 1 x 106, 1 x 103, or 1 x 101 cells. Six hours after cell delivery, mice were injected intraperitoneally with luciferin and imaged using the Xenogen system. A specific signal could be detected with 1,000 cells (2 of 6 mice imaged, Figure 2), but detection was more reliable with 10,000 cells (6 of 6 mice imaged). Importantly, this study also served to establish a rough correlation between number of luciferase-expressing cells and signal intensity.",
    "To demonstrate the utility of the described protocol in detecting and tracking cell fusion, MSCs were transfected with the LoxP-Stop-LoxP-Luciferase plasmid (Addgene) and delivered to the myocardium of Cre-expressing mice. Approximately one week after cell delivery, mice were first imaged using the Xenogen system without D-luciferin injection. As expected, without the enzymatic substrate, no intensity signal was detected (Figure 3). Next, D-luciferin was injected intraperitoneally and a signal corresponding to luciferase intensity and thus cell fusion was detected in two of four mice tested. A similar signal was detected one week later (Figure 3), suggesting MSC-coupled fusion products can be maintained in vivo. In this case, the study was terminated to allow for evaluation of heart and surrounding tissue, but one could envision longer-term analyses and more frequent imaging to track the maintenance, proliferation and perhaps migration of fusion products in mice.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3581/3581fig1.jpg\nFigure 1. Schematic of Technique to Detect Cell Fusion In Vivo.  If fusion between Cre-expressing mouse cells and transplanted cells expressing a floxed luciferase plasmid occurs, luciferase will be expressed. Luciferase can be detected by injecting the enzymatic substrate, D-luciferin, into the mouse and then imaging the mouse using a Xenogen Biophotonic Imaging System (Adapted from 19)\nimgsrc://cloudfront.jove.com/files/ftp_upload/3581/3581fig2.jpg\nFigure 2. Sensitivity of detection of luciferase-expressing cells in cardiac tissue with biophotonic imaging . A cell line which constitutively expresses luciferase (231-LUC-D3H1, Xenogen) was delivered to the intramyocardial space of C57/Bl6 mice at various total cell numbers. Representative images of mice receiving 1 x 106, 1 x 103 and 1 x 101 cells (left to right) are shown, imaging was conducted approximately 6 hours after injection.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3581/3581fig3.jpg",
    "Figure 3. Quantification of In Vivo Luminescence Indicative of Cell Fusion.  MSCs were transfected with the LoxP-Stop-LoxP-Luciferase plasmid and delivered to the myocardium of Cre-expressing mice. Approximately one week and two weeks after cell delivery, Cre mice were imaged using the Xenogen Biophotonic Imaging System to measure the intensity of luminescence indicative of cell fusion. (A) Overlay of photograph and intensity of luminescence of sham and mice 1-4 (left to right) 17 days after cell delivery. (B) Intensity of luminescence of sham and mice 1-4 (left to right) 17 days after cell delivery. A region of interest was selected (yellow) corresponding to the injection site and intensity levels were determined using ImageJ (free source) software20. (C) Intensity of luminescence was normalized to the same region of interest on sham mouse for all experimental conditions. At one week, mice 3 and 4 showed positive luminescence signal suggesting spontaneous fusion of a mouse cell and transplanted MSC. The signal persisted in mouse 3 at two weeks. To determine organ-specific localization of the signal corresponding to mouse 3, the thoracic cavity was exposed and primary organs excised and imaged. (D) Overlay of photograph and intensity of luminescence of mouse 3. Note localization of intensity signal in the small intestine. (E) Intensity of luminescence of mouse 3. (F) Overlay of photograph and intensity of luminescence of sham mouse. (G) Intensity of luminescence of sham mouse.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}