{
  "id": 4452,
  "origin_website": "Bio",
  "title": "Enzymatic Reactions and Detection of C3 Cleavage Fragments",
  "procedures": [
    "Enzymatic cleavage of C3 by cathepsin L (CTSL) All reagents are kept on ice at all times unless otherwise stated.   C3 preparation: Human serum-purified C3 is diluted from stock (1 mg/ml) in 1x PBS to a final concentration of 6 μg/ml in 1.5 ml Eppendorf tubes. For example, 3 μl of stock C3 (1 mg/ml) is diluted it in 500 μl 1x PBS to obtain the 6 μg/ml final concentration (see Note 1). This amount of diluted C3 stock is sufficient for 10 enzymatic CTSL cleavage reactions.    Activated cathepsin L (CTSL) preparation (see Note 1): For the activation of CTSL in MES/Brij 35 DTT buffer, DTT (1 M stock) is first diluted 1/200 in 50 mM MES buffer to 5 mM final concentration to generate the activation buffer. MES buffer provides pH of about 6.15 that is optimal for CTSL, while DTT and Brij 35 activate the enzyme. CTSL (stock 200 ng/µl) is then diluted to a final concentration of 40 ng/µl (1: 5) in the activation buffer in 1.5 ml Eppendorf tubes and incubated 15 min on ice without shaking to activate the enzyme (see Note 2). Calculate in advance how many reactions are required for an experiment (see Note 3) and activate the appropriate amount of CTSL.   For a reaction with a ratio of about 1: 1 of C3: CSTL, 50 μl of diluted C3 stock (see step A1) are mixed with 38 μl 1x PBS and 12 μl of activated CTSL (see step A2).",
    "At this step it is recommended to also prepare appropriate control ‘reactions’:   50 µl of C3 diluted stock + 50 µl 1x PBS into an Eppendorf tube, and    A reaction mixture of 12 μl MES buffer/DTT without CTSL + 38 µl of 1x PBS + 50 μl of C3 diluted stock as control reaction to assess the effect of the CTSL activation buffer without the enzyme on C3.    In addition, similar diluted stocks of 250 ng/100 µl in 1x PBS of C3a and 250 ng/100 µl 1x PBS C3b are prepared and will be used as ‘cleavage controls’.      All reaction mixtures (including controls) are incubated for 30 min (yields complete C3 cleavage) or desired times points at 37 °C in a heating block (alternatively, in a water bath).    Samples are centrifuged at 400 x g for 1 min at room temperature.    Twenty-five microliter of 5x protein sample reducing buffer is added to all samples and the samples then boiled at 95 °C for 3-4 min in preparation for subsequent Western blotting analysis (see section B).   Samples are centrifuged at 400 x g for 1 min at room temperature.    Samples can also be stored at this point for later analysis at -80 °C.",
    "Detection of C3 enzymatic cleavage products by Western blotting   Twenty five microliter of the reaction samples from step A8 [(C3 + CTSL) and controls (appropriately diluted stocks of C3a, C3b, C3 (all three control proteins are first diluted to 6 µg/ml in 1x PBS and then further diluted 1: 1 in 1x PBS) as well as C3 + MES buffer/DTT as described under step A4b)] are loaded along with the protein size marker (10 µl) onto a 3-8% Tris acetated gradient polyacrylamide gel (see Note 4) that had been assembled with 1x NuPAGE Tris acetate running buffer into the Western blotting chamber according to the manufacturer’s protocol (see Note 5).   The loaded protein samples are separated in the gel at 150 V for 60 min or until the front of the dye in the protein sample buffer reaches the bottom end of the gel.   The separated proteins are then transferred onto a nitrocellulose membrane using dry transfer in the Life Technologies iBlot transfer system according to the manufacturer’s protocol. This particular machine does not allow for custom settings and we use the 20 V and 5’ 30’’ transfer conditions (programme 3 on the iBlot machine). If you use another transfer devise, please follow the manufacturer’s instructions.    The nitrocellulose membrane is then placed into a container with enough 5% milk in 1x PBS supplemented with 0.1% Tween 20 to cover the membrane safely and blocked for 1-2 h at room temperature on a rocking shaker (low rotation).   Primary rabbit anti-C3 antibody and rabbit anti-C3d are diluted together at a concentration of 1 μg/ml each in 5% dry milk powder in 1x PBS with 0.1% Tween 20 and incubated with the membrane overnight at 4 °C on a shaker (see Note 6). Ensure that pH remains 7.",
    "4 after addition of the milk powder, otherwise adjust accordingly.    The membrane is washed 3 times using 50 ml 1x PBS with 0.1% Tween 20 for 15 min each at room temperature on a shaker.   Secondary anti-rabbit-HRP antibody is diluted in 5% dry milk powder in 1x PBS with 0.1% Tween 20 at 1:2,000 dilution (in enough volume to cover the membrane during shaking) and incubated with the membrane for 2 h at room temperature on a shaker (slow rotation).   The membrane is washed again 3 times using 50 ml 1x PBS with 0.1% Tween 20 for 15 min each at room temperature on a shaker.   The Western blot is developed using the ClarityTM Western ECL Substrate according to the manufacturer’s protocol. Briefly, the two substrate components in the ECL Kit are mixed at a ratio 1:1 and the membrane incubated in the mix for 5 min.   Excess ECL detection fluid is removed from the membrane and the protein bands are then visualized using the Chemi Doc MP imaging system and ImageLab software (see Note 7).   imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140816/20140816192001_6218.jpg Figure 1. Cathepsin L cleaves C3 to generate C3b. Serum-purified C3 was incubated with activated Cathepsin L (CTSL) as per protocol for the indicated time points and the reactions terminated by addition of the protein reducing loading buffer. The reaction mixtures where then analysed by Western blotting for cleavage of the C3 α-chain with a mixture of two anti-C3 antibodies recognizing the non-processed α-chain of C3 and also the processed α’-chain of generated C3b (anti-C3d) and the β-chain in both C3 forms (anti-C3). Serum-purified C3 and C3b were loaded as control proteins. Data shown are representative of three (n=3) independently performed experiments."
  ],
  "subjectAreas": [
    "Immunology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}