{
  "id": 7636,
  "origin_website": "Bio",
  "title": "Whole-mount Senescence-Associated Beta-Galactosidase (SA-β-GAL) Activity Detection Protocol for Adult Zebrafish",
  "procedures": [
    "SA-β-GAL Staining procedure Day 0 Starve the fish overnight for at least 17 h, leaving them in their aquarium.Day 1 Sacrifice fish by placing them in a container with 50 mL of 200 mg/L Tricaine MS-222 for 30 min.Note: Death can be determined by checking cessation of breath and gill movements. Proceed with fixation by individually incubating fish in 15 mL centrifugation tubes containing at least 10 mL of 4% PFA for 3 days, at 4°C on the roller mixer.Notes:  Differences in PFA quality might affect fixation of the entire fish and, therefore, the quality of β-galactosidase detection. It is then important to prepare fresh 4% PFA solution for each experiment. Incubation with gentle agitation helps the penetration of PFA and improves fixation of inner organs. Day 4 Wash each sample three times for 1 h in at least 10 mL of PBS pH 7.4, at 4°C on the roller mixer.Wash each sample 1 h in at least 10 mL of PBS pH 6.0, at 4°C on the roller mixer.Note: Pre-incubating fish at pH 6.0 is crucial to ensure an optimal SA-β-GAL reaction in the next step of the protocol. Incubate each fish with at least 10 mL of X-Gal staining solution for 24 h at 37°C in the dark.Note: It is crucial to ensure that SA-β-GAL activity detection is performed at pH 6.0. Lowering the pH below pH 5.9 results in false positives, while increasing the pH above pH 6.1 produces false negatives. Day 5 Wash each sample three times for 5 min in at least 10 mL of PBS pH 7.4 at room temperature on the roller mixer.Proceed with de-calcification for 48 h in 10 mL of 0.5 M EDTA pH 8 at room temperature.",
    "Note: To avoid loss of SA-β-GAL staining, fish should not be incubated for more than 48 h in EDTA. Embedding procedure After de-calcification, remove EDTA by incubating fish in water for at least 30 min at room temperature.Insert each sample into a histology cassette.Proceed with the embedding of the samples in a tissue processor using the following program:10% buffered formalin for 1 hDistilled water for 2 minEthanol 70% for 2 hEthanol 95% for 1 hEthanol 100% for 1 hEthanol 100% for 1 hEthanol 100% for 2 hEthanol 100% for 1 hXylene for 30 minXylene for 1 hXylene for 1 hParaffin for 30 min at 62°CParaffin for 1 h at 62°CParaffin for 1 h at 62°CUsing the Tissue Embedding Console System, insert each sample into an embedding mold and pour paraffin into the mold. Allow for solidification of the paraffin block by placing the mold containing each sample and paraffin onto the cryomodule plate of the Tissue Embedding Console.Counterstaining procedure Prepare 5 µm section slides from each paraffin-embedded sample using a microtome.Counterstain the slides with Nuclear fast red, following the manufacturer’s protocol. Briefly, after conventional deparaffinization and rehydration, wash slides for 1 min at room temperature in distilled water and stain them by incubating for 10 min at room temperature in Nuclear fast red-aluminum sulfate solution 0.1%. After 1 min, wash in distilled water and proceed with conventional dehydration and xylene incubation prior to slide mounting.Image acquisition Acquire images using a bright-field microscope or slide scanner.Note: The images of the different tissues shown in Figure 1 have been selected from a scan of a whole-body fish section. The slide scans were acquired with a NanoZoomer Digital slide scanner with a 40× source lens and analyzed with the NDPi software. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20220703/20220703193017_0659.jpgFigure 1.",
    "SA-β-GAL staining allows the detection of cell senescence in prematurely aged zebrafish tissues. A) Representative images of fish assayed for SA-β-GAL activity. Blue staining shows the presence of SA-β-GAL in different tissues of prematurely aged fish (tert-/-) compared to age-matched controls (wild type, WT). Corresponding scale bar represented in each panel B) Zoom-in of gut villi in A, allowing to precisely distinguish the cells stained in blue. Scale bar 50 μm.Note: A significant increase in SA-β-gal positive cells is seen by 9 months of age in tert-/- tissues and by 24 months in WT tissues. Concluding Note:  We analyzed different tissues of adult zebrafish for presence of SA-β-GAL blue staining. Intensity and localization may change due to biological or technical issues (i.e., age of the fish, health status, penetration of the fixative, longitudinal sections, etc.). Thus, it is crucial to have the proper number of technical and biological replicates for effective result interpretation. In our experiments, we performed a minimum of three biological replicates for each genotype and age."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}