{
  "id": 7828,
  "origin_website": "Bio",
  "title": "A Quick DNA Extraction Method for High Throughput Screening in Gram-positive Bacteria",
  "procedures": [
    "Cultivate the strains (listed in materials) conserved in glycerol at 37 °C, at 200 rpm overnight (for approximately 8–12 h).Dip a small amount of the overnight culture using a 10 μL inoculation loop and streak lightly on the nutrient agar plate. Then, cultivate the plate at 37 °C overnight.Suspend a single colony into 30 μL of ddH2O in a 1.5 mL tube.Note: The size of the colonies of B. cereus ATCC 14579, B. thuringiensis ATCC 10792, B. subtilis ATCC 6633, and L. monocytogenes ATCC 19115 is recommended in Figure 1 and Table 1, and the quality of DNA is listed in Table 2. imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4653/bioprotoc-13-08-4653-g001.jpgFigure 1. B. cereus (A), B. thuringiensis (B), B. subtilis (C), and L. monocytogenes (D) colonies formed on Petri dishes. Scale bars represent 10 mm.Table 1. Colony size of B. cereus, B. thuringiensis, B. subtilis, and L. monocytogenes table:\n﻿Microorganism,Colony size\nB. cereus ATCC 14579,2–4 mm\nB. thuringiensis ATCC 10792,1–2 mm\nB. subtilis ATCC 6633,1–3 mm\nL. monocytogenes ATCC 19115,0.2–0.5 mm",
    "Treat the bacterial suspension by sonication at 40 kHz and 120 W at room temperature for 5 min and then centrifuge at 10,000 × g for 1 min at room temperature.Note: No need to set pauses between the pulses. Carefully transfer the upper aqueous phase to a new 1.5 mL tube without disturbing the pellet.The DNA samples are tested using 1 μL of supernatant as DNA template by PCR. Primers for PCR are listed in Table 3. Taq DNA polymerases are added and parameters for PCR are as follows: initial denaturation: 95 °C, 3 min; denaturation: 95 °C, 30 s; annealing: 55 °C, 30 s; extension: 72 °C, 1 min; final extension: 72 °C, 10 min; number of cycles: 25×. After electrophoresis on 1.2% agarose gels (in 1× TAE diluent), all amplicons are visualized under UV light with GoldViewTM staining. The results are shown in Figure 2.Note: The bands are brighter if you increase the PCR reaction cycles. imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4653/bioprotoc-13-08-4653-g002.jpgFigure 2. B. cereus, B. thuringiensis, B. subtilis, and L. monocytogenes DNA analyzed by electrophoresis. Lane M: 100–2,000 bp DNA ladder (Marker D). B. c: B. cereus; B. t: B. thuringiensis; B. s: B. subtilis; L. m: L. monocytogenes. DNA: DNA extracts by ultrasonic method for 5 min. Positive control: DNA extracted with a commercial kit (1 μL DNA template). CK: Check control (no template).Table 2. The quality of DNA sample by spectrophotometry analysis table:\n﻿Microorganism,Nucleic Acid (ng/μL),A260/A280,A260/A230\nB. cereus ATCC 14579,20.343,1.517,0.641\nB. thuringiensis ATCC 10792,19.43,1.5,0.605\nB. subtilis ATCC 6633,21.935,1.303,0.634\nL. monocytogenes ATCC 19115,6.321,1.808,1.018\nTable 3. Primer sequences used in B. cereus, B. thuringiensis, L. monocytogenes, and B. subtilis, respectively table:\n﻿Microorganism,Target gene,Primer sequence (5′ to 3′)\nB. cereus ATCC 14579,gmk,F-TTAAGTGAGGAAGGGTAGGR-AATGTTCACCAACCACAA\nB. thuringiensis ATCC 10792,pycA,F-GTGAAAGCAAGAACACAAGCR-ATAGTTTTTGTATCCAACTGCG\nB. subtilis ATCC 6633,SigB,F-ATGACACAACCATCAAAAACTACGAR-TTACATTAACTCCATCGAGGGATCT\nL. monocytogenes ATCC 19115,prfA,F-GTCAAAACATACGCTCTTATCR-ACATAATCAGTCCAAAGTAGATGC"
  ],
  "subjectAreas": [
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}