{
  "id": 9332,
  "origin_website": "Jove",
  "title": "The FlyBar: Administering Alcohol to Flies",
  "procedures": [
    "1. Assembly of the FlyBar\nRationale and overview: The system is designed to administer controlled percentages of alcohol vapor to flies. Note: Figure 1 provides a schematic overview of the FlyBar set-up as described below in three stages (assembly of the air flow, set-up of the alcohol and water bottles, and assembly of the observation vials). In short, a steady airflow is split into two fractions that are bubbled through alcohol and water, respectively, mixed, and administered to 4 observation vials.\nAssembly of the Airflow\n\t\t\nConnect a short piece of flexible silicone tubing to either building air or an aquarium aerator to generate a consistent air flow and split using a y-connector. Connect the first branch to the air flow regulator that controls the total amount of air through the system (typically 1,000 ml/min for 4 observation vials).\nInsert a quick connector in the second tube so that the air stream can be interrupted at the beginning of the experiment without affecting the calibrated airflow. Add a y-connector and connect each branching tube to the airflow regulator.\nConnect tubing to the airflow regulators and then connect two airflow meters.\nSet-up of the Alcohol and Water Bottles\n\t\t\nAdd flexible tubing to the exit of the airflow meters and insert a thin glass tube (sections of 1 ml glass pipettes) with a 90° bend into the end of each length of tubing. This will serve as the inlet air flow into the water and alcohol bottles.\nPlace rubber stoppers with 2 holes through them into the bottles filled with alcohol and water. Keep both bottles at a constant temperature 2° C higher than ambient air temperature using a water bath. In our experiments, the environmental room is maintained at 25 °C, while the water bath is at 27 °C.",
    "Insert the straight glass pipette for the air inlet through the rubber stopper and extend into the fluid till approximately 1 cm from the bottom of the bottle.\nInsert an elbow section of glass pipette into the remaining hole in the rubber stopper until the end of the glass is flush with the bottom of the stopper inside the bottle. Insert this air outlet in another length of tubing.\nReunite the air streams using a y-connector and use another length of silicone tubing to direct the air flow through an empty mixing flask or bottle with bent glass pipette sections inserted through a two-holed rubber stopper. Use another length of silicone tubing for the outlet mixed airstream.\nAssembly of the Observation Vial\n\t\t\nSplit the outlet airstream emerging from the mixing flask 2-3x to obtain 4 or 8 smaller streams of air so that multiple observation vials can be used in each experiment. Connect the flexible silicone tubing to the observation vials.\nSet up the observation vials using empty vials sealed with a rubber stopper containing two holes through which glass tubes provide an inlet and an outlet for the alcohol vapor.\nCover the end of the first glass tube with netting and keep the netting in place using a small piece of flexible plastic tubing. Insert this tube through the first hole until it extends to approximately half the length of the vial. If needed, use Teflon tape to obtain a snug fit.\nInsert the second glass tube also with the end covered by netting until it is flush with the inside edge of the rubber stopper.\nPlace the vials horizontally on a white piece of paper to maximize contrast with the flies under dim red light conditions.",
    "Mix appropriate fractions of the airstream bubbled through alcohol and the airstream bubbled through water. Monitor the air pressure continuously and make adjustments as needed to maintain desired mixing of the air streams.\n\t\t\t\tNote: The continuous running of several Fly Bar assays in parallel or even a single assay in a small room can lead to a noticeable accumulation of alcohol vapor. To avoid continual release of alcohol vapor that potentially can affect the researcher in a closed room, an appropriate system needs to be put in place that adequately removes alcohol vapor generated during the experiment. To remove alcohol vapors, connect a 6-12 inch piece of tubing onto the second glass tube protruding from each vial, bundle them and direct to a funnel-vacuum system. Researchers should also ensure that the experimental testing room is adequately ventilated.\n2. Preparation of Experimental Animals\nRationale and overview: Proper culture and housing of the flies will reduce variability in the data. This is achieved through standardization and minimization of stress experienced by the flies. For that reason, no anesthesia (CO2 or alternatives) is used during any of the following steps of the protocol. Furthermore, flies should be age matched across experiments and time points to minimize variability as is standard for other behavioral analyses including learning and memory experiments17.",
    "Different light:dark conditions can be used to probe the function of the circadian clock in the behavioral response to ethanol. To determine if a diurnal rhythm exists, experiments can be performed under a defined LD cycle to measure performance at specific Zeitgeber Times (ZT). ZT 0 represents dawn and is defined as the time of lights on under LD cycles, while ZT 12 is the time lights are turned off with a 12:12 hr LD cycle. Under constant conditions, the Circadian time (CT) measures time for the animal in the absence of environmental signals, i.e. free-running time, and is related to the previous LD entrainment cycle. In wild-type Drosophila, CT reflects the previous ZT for the first several days in constant conditions as the free-running circadian period and rhythms are ~ 24 hr. To measure circadian modulation and eliminate acute light effects on behavior, flies are entrained to light:dark cycles and then transferred to constant dark conditions (DD) prior to experiments. Circadian experiments are performed on the second day of DD to measure performance at specific Circadian Times (CT).\nIn Drosophila, continuous light (LL) conditions result in circadian dysfunction with dampened or abolished molecular oscillations of core circadian genes and disruption of behavioral circadian rhythms as evidenced by arrhythmic locomotor activity18-21 and arrhythmic short-term memory17. The protocol is optimized for circadian studies and can be simplified for other experiments. All circadian experiments are conducted using dim red light (ambient overhead red light < 1 lux on bench top; small red lights used at 12 inches from tubes ~ 1 lux light).\nRear the flies at 25 °C under 12:12 hr light:dark entrainment conditions (LD).",
    "Collect freshly eclosed flies at the end of the day-light period on day 1 and store them for 24 hr under LD conditions in holding vials containing a small amount of high agar concentration food to minimize food stickiness. Note: To ensure healthy, normally developed flies are collected, only use flies collected within the first days after eclosion starts in a culture bottle.\nCollect batches of approximately 30 (25-35) flies using an aspirator on day 2 towards the end of the light period, and transfer to fresh holding vials.\nUse a strong light source to direct flies to the far end of the vial. Within this range, the exact number of flies in each vial is not critical as behavioral observations are reported in percentages with total number of flies counted at the end of each experiment.\nMaintain flies under DD conditions at 25 °C for two days.\nOn the day of the experiment, place all flies housed in different conditions or incubators other than the experimental behavior room in the room for at least 1 hr prior to the experiment. Acclimation reduces variability due to changes in temperature or humidity.\nMake observations at six time points a day (CT 1, 5, 9, 13, 17 and 21) in order to test for circadian modulation of behavior.\nCompare multiple time points within a single set of behavioral experiments to increase the robustness of the experimental design and minimize variability specific to a single experiment. For example, observations of CT 1 and CT 13 can be obtained simultaneously if two incubators with opposite light-dark schedules are used for entrainment.",
    "Note: The above procedure describes the preparation of experimental animals for assays performed in circadian condition of constant darkness. Different light:dark conditions can be used to probe the function of the clock in the behavioral responses to alcohol. To determine if a diurnal rhythm exists the experiments can be performed under an LD cycle to measure performance at specific Zeitgeber Times (ZT). Additionally, the protocol may be used with flies raised under constant light conditions for experiments testing circadian dysfunction. For alternate protocols that test flies housed in light conditions, behavioral assays should still be performed under dark conditions. Flies should be transferred into the dark for 1 hr prior to the experiment to minimize behavioral variability due to the acute effects of light on behavior.\n3. Behavioral Observations\nRationale and overview: The following alcohol administration protocol is optimized for observations under dim red light condition. The two behavioral measures LoRR and sedation represent two distinct points of fly inebriation. LoRR represents a late point of inebriation incorporating the loss of motor and postural control, whereas sedation measures a very late end point of intoxication. Genotype or circadian modulation may affect these two measures differently; hence one may wish to examine both. In short, flies are loaded in the vials, the number of flies displaying LoRR or sedation are scored every 5 min during alcohol vapor exposure, and the total number of flies counted at the end of the experiment.\nBefore starting the experiment, run the air through the system (air bubbled through water and alcohol bottles) for at least 10 min and use that time to calibrate the airflows.",
    "Disconnect the quick release to stop the airflow. Load the flies in the vials, and reconnect the airflow and start the timers. Note: If unresponsive flies or dead flies are left in the holding vials, this could be indicative of stress conditions. In general, these conditions may be alleviated by housing fewer flies in the holding vials or decreasing food stickiness using a slightly higher agar concentration during food preparation. For optimal behavioral analyses and minimal variability between experiments, flies should be healthy prior to experiments.\nFor accurate time keeping, use one timer to keep track of the total time of alcohol exposure and use a second count-back timer to mark the 5-min intervals.\nPlace a piece of white paper under the vials to increase contrast and fly visibility, especially under dim red light conditions.\nCheck the airflow regularly during an experiment to maintain constant levels. Generally, once airflows have stabilized, they remain stable during the length of the experiment.\nCount the number of flies that have lost their righting reflex once every 5 min for a 1 hr period. As the alcohol sensitivity varies between genotypes and genetic backgrounds, it may be desirable to perform more frequent assessments or to conduct the experiment for a longer period of time.\nLift the vial slightly from the surface, and direct the light from a red-light flashlight toward the paper behind the vial. Keep the hand-held red flashlights at a distance of at least 12 inches to the experimental vial to maintain light levels no greater than 1 lux for all experiments under dim red light conditions.\nMeasure light levels using a light meter to establish standards for all experiments.",
    "Determine the number of flies that have lost their righting reflex by applying a firm tap to the vial and count how many flies fail to right themselves within approximately 4 sec. Flies that display LoRR may still move their legs and wings, but cannot turn themselves upright.\nAt the end of the session, count the total number of flies in each vial.\n\t\tNote: Occasionally, a single fly may be caught between the stopper and the side when loading flies into the experimental vials. As this is done in the dark, it may not be readily noticed so it is necessary to count the total number of flies at the end of the experiment to correctly calculate percentages.\nAdditionally, this procedure also may be used to measure sedation of flies, which represents a different behavioral endpoint. While sedated flies have lost their right reflex, sedation requires greater alcohol exposure. Behaviorally, sedation may be characterized by the complete lack of apparent motor activity with flies remaining motionless in the vial following a a firm tap to the vial. For sedation, count the number of flies that remain motionless with no leg waving following delivery of a firm tap of the vial. Additionally, the vial can be rolled side to side to determine whether individual flies still retain their grabbing reflex.\n4. Data Analysis\nDetermine the percentage LoRR at each time assessed based upon the total number of flies in each vial.\nEstimate differences between circadian time points or strains by calculating the 50% LoRR for each sample, which falls within the linear portion of the sigmoid curve (See Figure 2 below).\nAlternative statistics:",
    "If comparisons between genotypes are planned, it is desirable to analyze the whole time course using repeated measures ANOVAand to determine the range of time points that the differences are significant with post-hoc tests (Figure 3). For these tests, we prefer to use an a value of 0.001. This allows differences at individual exposure times to be assessed as well as differences between genotypes in the slope of the curve.\nDifferences in sensitivity for can be determined for specific times of alcohol exposure for a particular response such as sedation from the linear portion of the graph (Figure 4).\nDifferences between strains or circadian time points can be estimated using standard F-statistics and post-hoc tests.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}