{
  "id": 17745,
  "origin_website": "Jove",
  "title": "Characterizing Exon Skipping Efficiency in DMD Patient Samples in Clinical Trials of Antisense Oligonucleotides",
  "procedures": [
    "The operational procedure for the investigator-initiated trial has been approved by the NCNP ethical committee (approval ID: A2013-019).\n1. Preparation of muscle samples\nNOTE: Biceps brachii or quadriceps muscles are often selected as biopsy sites. However, the tibialis anterior was used in the clinical trial.\nMuscle biopsy from patients\nMark the incision site before skin preparation.\nPrepare saline-dampened gauze for the biopsy specimen. Squeeze the gauze well.\nInject local anaesthesia into skin and subcutaneous tissue, but not into muscle. Make sure of the depth of the anesthesia by the absence of cutaneous pain.\n\t\tNOTE: General anaesthesia is generally used in paediatric patients under 15 years of age.\nMake an incision from the skin to the subcutaneous tissue. Use small retractors to open the incision and separate the subcutaneous fat.\n\t\tNOTE: At this step, a portion of the skin can be cut for fibroblast culture.\nMake another small incision in the fascia and cut the fascia further. Clamp the edges using mosquito forceps to expose the muscle.\nUse a suture to pull up the selected portion of the muscle. Make a small tunnel using Iris scissors and insert mosquito forceps into the tunnel.\nSeparate the muscle bundle using forceps and cut both ends of the target portion.\n\t\tNOTE: Muscle biopsy specimens should be around the size of a pencil for adult patients (length 1.0-1.5 cm, diameter 0.8-1.0 cm). The specimen should be around 1 cm in length and 5 mm in diameter in paediatric patients.\nWrap the specimen in saline-dampened gauze and transport the fresh muscle at room temperature (RT) immediately to a facility where the specimen can be prepared for further analysis.\n\t\tNOTE: The specimens should be transported at 4 °C if the duration of transportation exceeds 1 hour.\n2. Muscle sample preparation",
    "Mix equal volumes of tragacanth gum and water until the gum becomes soft and sticky. Load the mixture into 25 mL syringes. The syringes can be stored in a refrigerator.\nPlace approximately 0.5 to 1 cm of tragacanth gum on cork discs. Label the discs on the opposite side.\nPlace a container of isopentane in liquid nitrogen until some of the liquid freezes.\nPlace the specimen in the tragacanth gum. The longitudinal axis of each muscle should be perpendicular to the cork. Place gum around the bottom of each muscle to help proper placement.\nUsing tweezers, place the muscle/cork specimen in cold isopentane prepared in step 2.3 to freeze. Move the specimen constantly for 1 min or until completely frozen, and place on dry ice temporarily.\nPlace the specimen in glass vials and store at -80 °C.\n3. Muscle sectioning\nSet up the cryostat for sectioning with a working temperature of -25 °C.\nMount the cork/muscle block and trim until flat sections are achieved.\nUse a section thickness of 10 µm for RT-PCR and western blotting. Use a thickness of 6-8 µm and 10-12 µm for immunohistochemistry or haematoxylin and eosin staining, respectively. Put sliced sections in 2.0 mL tubes and store at -80 °C for RT-PCR and western blotting.\n4. RNA extraction and reverse transcription polymerase chain reaction (RT-PCR)\nExtract approximately 10 slices with 10 µm thickness from frozen muscle by a cryostat. Collect the purified total RNA using the purification kit of total RNA according to the manufacturer's instructions.\nMeasure the RNA concentration using a spectrophotometer.\nCombine the required reagents for a RT-PCR reaction in PCR tubes according to Table 1. See Table 2 for primer sequences.",
    "NOTE: The forward primer was 44F for patient NS-03 and 46F for patient NS-07. The reverse primer was 54/55R as a default. If non-specific products were evident, 54R was used as an alternative.\nPlace the PCR tubes containing the mixture in a thermo-cycler. Run the thermo-cycler according to Table 3.\nStore PCR product at 4 °C for short-term storage or -20 °C for long-term storage.\n5. Microchip electrophoresis and exon skipping calculation\nNOTE: A microchip electrophoresis (MCE) system is often selected to analyze exon skipping efficiency. In this protocol, we describe the steps necessary to analyze the exon skipping efficiency using a MCE system by manufacturer A as well as from manufacturer B, hereafter called system A and B. During the clinical trial, the exon skipping efficiency was analyzed on system A. However, system A is no longer for sale, and we recommend system B to analyze exon skipping efficiency. We have included protocols for both systems (see section 5.1 for system A and 5.2 for system B). See Table of Materials for information regarding system A and B. Furthermore, this step can also be performed with normal agarose gel electrophoresis, but the sensitivity markedly decreases.\nMicrochip electrophoresis using System A\n\tNOTE: System A has two types of chips. Here, we describe the steps for the DNA chip.\n\t\nEquilibrate kit reagents (stain buffer, loading buffer, ladder, and gel buffer) to RT, vortex, and spin down.\nTo prepare gel-stain buffer (GS), add 12.5 µL of stain buffer to 250 µL of gel buffer and vortex for 10 s. Move the solution to a spin filter tube and centrifuge at 2,400 x g for 15 min. Discard the filter.\n\t\tNOTE: The filtered GS can be stored at 4 °C for 1 month.",
    "If samples are highly concentrated, dilute to approximately 50 ng/µL with TE buffer or DNase-free water.\n\t\tNOTE: If samples are in a salt concentration ≥ 200 mM KCl (or NaCl) and/or 15 mM MgCl2, exchange the buffer.\nAdd 12 µL of GS solution to the gel priming well (highlighted and labelled GS) of the DNA chip and place the chip in the priming station.\n\t\tNOTE: To avoid air bubbles, insert the pipette tip vertically and to the bottom of the well when dispensing. Dispense slowly to the first stop on the pipette, and do not expel air at the end of the pipetting step.\nSelect C3 mode and press the Start button. After priming is completed, remove the chip.\nVisually inspect the microchannels for trapped air bubbles or incomplete priming.\nLoad the prepared samples and ladder onto the chip as below.\n\t\t\nPipette 9 µL of GS solution into the other 3 GS wells.\nPipette 5 µL of loading buffer into the L well and each sample well (1-11).\nPipette 1 µL of ladder into the L well.\nPipette 1 µL of DNA sample into each of the 11 sample wells.\nPipette 1 µL of TE or DNase-free water into any unused wells. The kit quick guide shows a figure of the chip layout.\n\t\t\tNOTE: Inspect all wells for air bubbles by holding the chip above a lightly colored background. Dislodge any trapped air bubbles at the bottom of a well with a clean pipette tip or by removing and reloading the solution.\nPlace the chip in the vortex station and press Mix. The vortex station automatically stops after 1 min.\nRun the chip in the electrophoresis station within 5 min of loading.",
    "Select New Run in the software toolbar. On the New Run screen, select DNA and DNA 1K from the Assay pull-down list.\nEither select a project folder for the run from the Project pull-down list or create a new project folder by entering a name in the Project field.\nEnter a name for the run in the Run Prefix field and click Start Run.\nThe instrument beeps when the analysis is complete, and a window opens indicating the end of the run. Select OK and remove the chip from the chip platform.\nSelect File | Export Data to export the data. Select the desired options in the Export dialogue.\nTo clean the electrodes, fill a cleaning chip with 800 µL of deionized water and place it on the chip platform, close the lid, and leave it closed for 1 min. After 1 min, open the lid, remove the cleaning chip, and allow the electrodes to dry for 1 min.\nMicrochip electrophoresis using system B\nOpen the operating software and enter the sample information. After entering the information, the software calculates the amount of separating buffer and marker solutions automatically.\nPrepare the necessary amount of separating buffer calculated by the software. First, prepare 100x nucleic acid gel stain solution by diluting 10,000x solution with the appropriate amount of TE buffer. The 100x solution can be stored at -20 °C.\nMix a suitable amount of 100x nucleic acid gel stain withseparation buffer in the specific tube provided by the company to prepare a 1x solution. Vortex the solution.\nPrepare the required amount of marker solution in the tube.\nStart the probe wash program.\nStart the microchip wash program when finished.",
    "Simultaneously, pipette the samples to a PCR multiplate (96-well, clear) and dilute 4 times with deionized water. The minimum volume the machine can handle is 6 µL, and the maximum is 30 µL. We suggest a total volume of 10 µL (2.5 µL of sample and 7.5 µL of water/TE-buffer).\nCover the plates with adhesive PCR sealing foil sheets and spin-down the samples.\nSet the plate, marker solution, and 1x separating buffer in the machine according to the placement shown by the machine. Push the Start button.\nWhen the run is finished, export the result data as a .csv file from the software and calculate the exon skipping efficiency using molar concentration as follows:\n\t\tExon skipping efficiency (%) = (Skipped band / (Skipped band + Non-skipped band) X 100\n6. Complementary DNA (cDNA) sequencing\nAgarose gel preparation\nMeasure 1.5 g of agarose powder and mix the powder with 100 mL of 1x TAE buffer in a microwavable flask (resulting in a 1.5% agarose gel).\nMicrowave for 1-3 min until the agarose is completely dissolved.\n\t\tNOTE: Do not overboil the solution, since some of the buffer will evaporate and alter the final agarose percentage of the gel.\nLet the agarose solution cool to about 50 °C.\nAdd 10 µL 10,000x fluorescent nucleic acid dye to the agarose solution.\nPour the agarose into a gel tray with the well comb in place. Leave at RT for 20-30 min until it has completely solidified.\nSequencing\nMix 5 µL of RT-PCR product (from step 4.4) and 1 µL of 6x loading buffer. Load them into the wells of the 1.5% agarose gel.\nRun the gel at 135 V for 5 min and 120 V for 20 min.\nVisualize the bands using a transilluminator according to the manufacturer's protocol.",
    "Excise bands of interest from the gel and use a gel and PCR cleanup kit to retrieve RT-PCR products.\nMeasure the concentration using a spectrophotometer.\n\t\tNOTE: The purified band can be sent for sequencing at a company or sequencing facility if no Sanger sequencing equipment is available in-house.\nPrepare the required reagents for a cycle sequencing kit and pipette into a multiplate PCR plate according to Table 4. See Table 2 for primer sequences.\nSeal the plate with clear adhesive film.\nVortex the plate for 2 to 3 s. Centrifuge briefly in a swinging bucket centrifuge so that the contents settle to the bottom of the wells (5 to 10 s) at 1,000 x g.\n\t\tNOTE: Air bubbles may be present in the wells, but they do not adversely affect the reaction.\nPlace the mixture in a thermo-cycler and run according to Table 5.\nPurify the sequencing reactions with plates according to the manufacturer's instructions.\nUse an DNA analyzer to determine the sequences according to the manufacturer's protocol.\nCompare the sequence obtained to the patient's expected sequence.\n7. Western blotting\nSample preparation\nPrepare SDS sample buffer (4% SDS, 4 M urea, 10% 2-mercaptoethanol, 10% glycerol, 70 mM Tris-HCl pH 6.4, 0.001% bromophenol blue, and protease inhibitor).\nPlace around 100 slices of the 10 µm muscle sections collected from cryo-sectioning in 150 µL of SDS buffer.\nBriefly homogenize the protein samples on ice for 30 s using a handy micro homogenizer.\nCentrifuge at 16,500 x g for 15 min, and transfer the supernatant to a fresh tube. Proceed with analysis or store at -80 °C.\nSDS-PAGE for protein concentration measurement\n\tNOTE: A fluorescent gel stain was used to determine the protein concentration.",
    "Determine the normal healthy control sample weight and the concentration using the BCA protein assay kit according to the manufacturer's instructions.\nPrepare the samples for gel electrophoresis. Pipette 10 µg of total protein of the healthy control and 5 µL of the patient samples, 5 µL of 4x sample buffer, 2 µL of 10x sample reducing agent. Once these have been mixed, add deionized water to a final volume of 20 µL in each sample.\nHeat samples at 70 °C for 10 min.\nPrepare 2,000 mL of 1x SDS running buffer using 50 mL of 40x SDS running buffer. Dilute with 1,950 mL of deionized water.\n\t\tNOTE: At this point, 1,000 mL of running buffer is enough. The remaining 1,000 mL buffer is used at step 7.3.1.\nMix thoroughly and set aside 800 mL of the 1x SDS running buffer for use in the lower (outer) buffer chamber of the gel box.\nImmediately prior to electrophoresis, add 500 µL of antioxidant buffer to 200 mL of 1x SDS running buffer to use in the upper (inner) buffer chamber of the gel box.\nPrepare for gel electrophoresis by setting up a 3-8% Tris-acetate gel according to the manufacturer's protocol. Load 20 µL of each sample onto the gel.\nPerform electrophoresis at 150 V for 75 min.\nAfter electrophoresis, place the gel directly into a clean tray containing 50 mL of fluorescent gel stain solution.\nCover the tray, place on a shaker, and agitate without splashing liquid or damaging the gel for 90 min.\nTransfer the gel into water before imaging in a fluorescence system at 312 nm illumination with ethidium bromide emission filter to detect fluorescence.\nMeasure the concentrations of the patient samples based on an analytical curve constructed using the normal control lysate with known concentration.\nSDS-PAGE for western blotting",
    "Prepare the gel box according to steps 7.2.4-7.2.6.\nBased on the concentration measurement obtained in step 7.2.11, load 100 µg per lane of healthy control lysate and 300 µg per lane of the patient sample. Electrophorese using the same settings as step 7.2.7.\nProtein transfer\nPrepare the transfer buffer. Soak a PVDF membrane for 20 s in methanol. Move it to the blotting buffer B until use.\nSoak a extra-thick blotting paper in blotting buffer A, B, and C for at least 30 min per buffer.\nAfter electrophoresis, soak the gel in blotting buffer B for 5 min.\nPlace blotting papers, PVDF membrane, and gel on the semi-dry transfer machine according to the drawing in Figure 1. Roll out air bubbles between the gel and membrane with a roller.\nTransfer at 2 mA/cm2 membrane for 1 h at RT.\n\t\tNOTE: After transferring, it is recommended to perform a total protein stain similar to Ponceau staining to confirm successful transfer of the large molecular weight proteins.\nBlocking and antibody staining\nRinse the membrane twice with PBST (1x PBS with 0.1% Tween 20).\nPlace the membrane in 1% blocking agent, and rock gently for 1 h at RT to block.\nIncubate the membrane with anti-dystrophin antibody in blocking solution (1:125) and anti-spectrin antibody (1:25,000) for 1 h at RT or overnight at 4 °C.\nWash the membrane three times for 10 min each with PBST at RT.\nIncubate the membrane with horseradish peroxidase (HRP)-conjugated secondary anti-mouse/rabbit antibody in PBST (1:100) for 40 min at RT.\nWash the membrane again three times for 10 min with PBST at RT.\nDetection\nMix detection solutions A and B in a ratio of 1:1. The final volume of detection reagent required is 0.1 mL/cm2 membrane.",
    "Remove the excess PBST from the washed membrane and place it with the protein side up on a sheet of plastic wrap or other suitable clean surfaces. Add the mixed detection reagent onto the membrane and incubate for 5 minutes at RT.\nRemove the excess detection reagent by holding the membrane gently in forceps and touching the edge against a tissue.\nPlace the blot protein side up on a sample tray. Operate the fluorescent system according to the user documentation. Set machine as follows. Exposure type: Increment, Interval time: 10 s, Sensitivity/Resolution: high.\n\t\tNOTE: Measured areas were boxed with a blue rectangle (Figure 4a-b): BG: background; D: dystrophin 427 kDa, SL: spectrin beta long isoform (274 kDa); SS: short isoform (253 kDa). Dystrophin/spectrin signal ratio was calculated as (D-BG)/[(SL-BG) + (SS-BG)]. The ratio of normal control was set as 100%."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}