{
  "id": 19044,
  "origin_website": "Jove",
  "title": "Surgical Technique for Spinal Cord Delivery of Therapies: Demonstration of Procedure in Gottingen Minipigs",
  "procedures": [
    "1. Animal Use\nProcedures demonstrated herein have been approved by the Emory University Institutional Animal Care and Use Committee (IACUC). Female Gottingen minipigs weighing approximately 15-20 kg are used.\n2. Anesthesia\nAnimals are fasted approximately 12 hr prior to surgery. Animal sedation and anesthesia induction consist of a cocktail of intramuscular Ketamine (35 mg/kg), Acepromazine (1.1 mg/kg), and Atropine (0.04 mg/kg). Animals are then intubated and maintained on oxygen and 1-3% isoflurane general anesthesia. At this point, the back and head of each animal is shaved. Depth of anesthesia is monitored by the veterinary staff. Absence of interdigital, corneal and palpebral reflexes, as well as heart and respiratory rate, pulse oximetry, direct/indirect blood pressure, end-tidal carbon-dioxide measurements, and muscle tone/response to noxious stimuli are used to monitor depth of anesthesia.\n3. Positioning\nAnimals are taken to the operating room and placed into a prone position on a frame custom designed to mimic patients positioning on a Jackson spinal surgical table. The frame utilizes adjustable slings that are placed under the chest and pelvis of the animal, allowing the abdomen to hang free and, therefore, minimizing pressure on the abdomen and chest and consequent epidural venous bleeding (Figure 1). The frame also provides external immobilization of the spine for the procedure 1.\nAdditionally, animals are placed on a heated re-circulating pad to maintain body temperature and a marginal ear vein catheterized for fluid administration and any necessary drug delivery during surgery. Finally, the surgical field is prepped with alcohol and Chlorhexadine or Betadine solution and surgical drapes are placed on the surgical field.\n4. Laminectomy",
    "An approximately 10-15 cm skin incision is performed and the paraspinal musculature is dissected off the spine bilaterally. Next, a dorsal multi-level laminectomy is performed. The lamina and spinous processes of three vertebrae overlying C3-C5 or L2-L4 segments are removed using rongeurs and a surgical drill.\n5. Placement of the Spinal Derrick\nWe call Spinal Derrick the device designed for the delivery of (gene and cell) therapies into the spinal cord 2-5. Detailed discussion on the design and evolution of this device can be found on Riley et al., 2011. 4\nTo secure the device to the patient, percutaneous posts are placed through 1cm skin incisions above and below the primary incision and mounted to the lamina above and below the primary incision.\nNext, two integrated retractors are attached to the four percutaneous posts above and below the incision site to expose the area of the spine that has undergone laminectomy.\n6. Dural Opening\nWith the aid of a Woodson dental tool and an 11 blade, a 2.5 cm incision is made through the dura, exposing the spinal cord. The dura is reflected away from the pial layer using 4-0 Nurolon suture and secured to the deep paraspinal musculature.\nSurgical patties are placed in the rostral and caudal extremes of the opening. These provide a partial barrier to cerebrospinal fluid flow and also provide a safe target for the surgeons to place suckers without damaging the cord. In humans, under surgical microscope magnification, the pial surface is dissected at this point. Due to technical limitations, this procedure is not required or feasible in animals.\n7. Spinal Cord Injections and Lateral Displacement of the Spinal Derrick for Additional Injections\nImmediately prior to injections, a bolus of Methylprednisolone (125 mg, IV) is given to prevent spinal cord swelling.",
    "At this point, the platform rail system is attached and the side rails are adjusted to fit the appropriate length. The gondola is top-loaded onto the 2 bars and the Z drive is mounted on the universal joint. Next, the loaded cannula is placed onto the microdrive. Using the universal joint on the microinjection platform, the coronal and sagittal angles are adjusted to ensure a trajectory orthogonal to the surface of the spinal Injections follow the placement of the cannula. The needle is positioned accordingly medial to the dorsal root entry zone (DREZ). The DREZ is identified under 3.5X surgical loupe magnification and penetrated on an orthogonal trajectory to the cord surface at a point <1 mm medially.\nIn humans, a pre-operative MRI provides a baseline assessment of spinal cord dimensions for operative planning. Moreover, the thickness of the spinal cord is measured to determine the target depth of the ventral horn.\nThe suspension is infused at a depth of 4 mm from pial contact. A flange made of ultem plastic serves as a stopper on the pia surface to prevent the needle from advancing deeper than desired. Once the needle tip is positioned at the target, the rigid metal outer sleeve is pulled up, leaving the flexible tubing exposed. Once the injection is completed, the needle is left in place for an additional 1 min to prevent cell reflux up the cannula injection tract.",
    "Care is taken to avoid surface vasculature by slightly adjusting the microdrive either laterality or rostro-caudally. Some bleeding from penetration sites may occur. When such bleeding is encountered, micro patties are placed over the bleeding puncture site and suction is applied to them to wick blood out of the cannula penetration site and prevent buildup in the cord. This reliably allows for the blood to coagulate. Cautery is avoided as is direct pressure.\nFollowing needle removal, the stereotaxic apparatus is relocated to the next target site along the rostro-caudal axis, separated by 2 or 4 mm or as necessary to avoid visible blood vessels on the dorsal surface of spinal cord. This process is repeated as many times as proposed in a given study.\n8. Floating Cannula\nA custom infusion cannula of narrow diameter is used for the injections. The cannula consists of a 30-gauge beveled needle of fixed length connected to a 30-gauge flexible silastic tubing of variable length. The distal end is fitted with a Hamilton luer lock that is attached to a microinjector pump. The proximal silastic tubing is ensheathed within a 24-gauge rigid outer cannula that seats on the proximal end of the injection needle flange. This flange both seats the outer cannula and serves as a depth stop for the injection needle. For each injection, the appropriate volume of a therapeutic suspension is infused by a using a pre-calibrated MINJ-PD microINJECTOR pump (Tritech Research, Inc., Los Angeles, CA) at a rate of 5 μl per minute.\n9. Closure",
    "Once all injections have been made, the spinal derrick is gently removed and the incisions are closed in four layers. The dura is closed using a 4.0 Nurolon stitch, in a watertight fashion. 0 Vicryl suture is used for the deep muscular layer. Fascia is then closed with 0 Vicryl suture also in a watertight fashion. The dermal layer is finally closed with 2.0 Vicryl, with a running stitch. Skin closure is completed using a 3-0 Nylon suture.\n10. Recovery and Pain Management\nAnimals are extubated and monitored for 2 hr following anesthesia recovery. Next, animals are transferred to individual cages and monitored at least once daily for food consumption, defecation, and micturition.\nFor pain management, a transdermal Fentanyl patch (75 mcg) is stapled on the back of the animals for three days of post-operative analgesia. Additionally, Buprenorphine (0.05 mg/kg, BID, IM) can also be given for up to three days post-operatively.\n11. Results and Representative Outcomes\nClinical and behavior observations are performed before surgery and then recorded on Days 1 through 7 and weekly until endpoint according to the study design. Behavioral data is collected to assess neurological morbidity as previously described 6. Sensory function is assessed by presence or absence of a withdrawal response to mechanical stimulus to the toes of front and hind limbs. Motor function follows the Tarlov score (Table 1): 0 - Paralysis, no movement; 1- Perceptible tonus in the hind limbs, slight movement; 2 - Movement in the hind limbs, but unable to sit or stand; 3 - Ability to stand and walk but ataxic and for short periods; 4 - Complete recovery, normal motor function.",
    "Safety of the procedure is determined by the ability of an animal to return to pre-operative baseline. Transient neurological deficits should mostly resolve between post-operative days 1 and 7, with some variations depending on animals' breeds and procedure (number of injections, among other parameters). Permanent morbidity is defined by lasting neurological deficits which do not resolve by the time animals reach IACUC default endpoint (Figure 2).Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}