{
  "id": 13355,
  "origin_website": "Jove",
  "title": "Using the Activity-based Anorexia Rodent Model to Study the Neurobiological Basis of Anorexia Nervosa",
  "procedures": [
    "All procedures described in this protocol are in accordance with the Institutional Animal Care and Use Committee of New York University (Animal Welfare Assurance #A3317-01).\nNOTE: This protocol has been optimized for adolescent female C57BL/6 mice. The animals were housed in a facility that maintains RT at 72° ± 2° and room humidity at 50% ± 10%. Room lights turned on from 7 am to 7 pm daily.\n1. Preparation of Cages with Running Wheels\nSet up the computer and USB Interface Hub in a safe area of the animal holding room, away from running water and foot traffic, but close enough to the cage rack to be within the wireless range of the transmitters. Ensure that the computer and USB Interface Hub both receive power from a wall outlet, and the USB Interface Hub connects to the computer via a USB cable. Use a power backup device to power both the computer and the USB Hub.\nConnect the computer to the USB Interface Hub using the USB cable included with the running wheel equipment. \nBoot the computer and start the running wheel software by double-clicking on the icon.\nInstall three AAA batteries into the base of each of the running wheels, and confirm that the wheel manager software has recognized the transmitter. List each wheel in the program window under the heading “Wheel Sensors.”\nSet up the configuration of the data acquisition according to the particular specifications of the experiment.\nPrepare a cage for each mouse subject with bedding, nestlets, free access to water, and a running wheel. Typically, 8 mice are used per experiment for neuroanatomy studies. More mice may be required for behavioral studies to ensure adequate statistical power.",
    "Ensure that the running wheel is able to move freely without touching any of the cage walls, food basket, or cage top. Spin each wheel a few times and confirm that the software is updating the wheel counts for each wheel.\n2. Acclimation Phase\nPlace each mouse subject (female C57BL/6 mouse; age P36) individually in a cage with a running wheel.\nAdd a pre-weighed amount of dry food (approximately 100 g) to the food hopper, and place a pre-weighed full container (approximately 50 g) of wet food in the cage.\nIn the program window, begin the wheel activity data acquisition and data storage by selecting the “Start Acquisition” option in the File menu. Choose the directory to which the data will be saved. The software will record revolutions of the wheel continuously until the experiment is stopped manually.\nWeigh the animal, wet food, and dry food every day at the time that lights are turned off in the room. Refill dry food if the weight falls below 50 g, and replace the wet food container if the food dries out or becomes soiled with bedding. Manually record the wheel count every day at this time as well, in case of loss of the digital data.\n3. Beginning Food Restriction\nRemove all wet and dry food from the cage at noon (or 7 hr before the room lights are scheduled to turn off) on the first day of food restriction.\nOn the same day, at the onset of the dark cycle, record the weight of the animal and the wheel count. Place a pre-weighed amount of dry food (approximately 50g) into the food hopper and a pre-weighed amount of wet food (approximately 5g) into the cage in a weighing boat.\nPrepare a fresh cage with bedding and nestlets for each animal.",
    "After 2 hr, transfer the running wheel to the prepared fresh cage. This cage change ensures that the animal remains food restricted until the next feeding time, in case some food crumbs have fallen or been hoarded in the bedding. In order to reduce the stress of the cage change, add two handfuls (approximately 500 ml) of the soiled bedding from the old cage, and move the animal into the new cage.\nRecord the weight of the remaining wet and dry food to determine the amount of food that was eaten. Record the wheel count at the end of the food access period.\n4. Monitoring Animal Health during Food Restriction\nEvery day, at the onset of the dark cycle, record the weight of the animal and the wheel count. Place a pre-weighed amount of dry and wet food to the cage.\nIf an animal’s body weight falls below 75% of their initial body weight before food restriction, remove them from the experiment.\n\tNOTE: Other indications of excessive starvation include a hunched posture and inability to move around the cage. The animal may be cold to the touch and fail to eat during the 2 hr of food access.\nPrepare a fresh cage with bedding and nestlets for each animal.\nAfter 2 hr, transfer the running wheel to the prepared fresh cage. Add two handfuls (approximately 500 ml) of the soiled bedding from the old cage, and move the animal into the new cage.\nRecord the weight of the remaining wet and dry food to determine the amount of food that was eaten. Record the wheel count at the end of the food access period.\n5. Ending the Experiment",
    "After three days of food restriction, end the ABA experiment. Euthanize the animal for collection of brain tissue, or allow the animals to recover before undergoing additional behavioral testing.\nClick the “End Acquisition” option under the File Menu in the program window.\nRemove the running wheels from the cages, and remove the batteries from the wheel base.\nIf allowing the animals to recover, return a pre-weighed amount of dry food to the food hopper and allow the animals ad libitum access to food during recovery.\n6. Data Analysis\nSave all wheel data for the experiment in a .wls file in the directory chosen at the start of the experiment.\nExport data to a spreadsheet by selecting the “Export” option in the File Menu. Select the desired .wls files in the “Source Data File” option. Select the start and end date and time, and select each wheel sensor for export in the Wheel Sensors list."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}