{
  "id": 15364,
  "origin_website": "Jove",
  "title": "Targeted in Situ Mutagenesis of Histone Genes in Budding Yeast",
  "procedures": [
    "NOTE: The experimental strategy for targeted in situ histone gene mutagenesis includes several steps (summarized in Figure 1). These steps include: (1) Replacement of the target histone gene with the URA3 gene, (2) Generation and purification of PCR products corresponding to two partially overlapping fragments of the target histone gene using primers harboring the desired mutation(s), (3) Fusion PCR of the two partially overlapping fragments to obtain full size PCR products for integration, (4) Co-transformation of full size PCR products and backbone plasmid, and selection for marker on plasmid, (5) Screen for 5-FOA-resistant transformants, (6) Purification of 5-FOA-resistant colonies and loss of backbone plasmid, and (7) Molecular analyses to assay for proper integration of the mutant allele.\nimgsrc://cloudfront.jove.com/files/ftp_upload/55263/55263fig1.jpg",
    "Figure 1: Overview of the Strategy for Targeted in situ Mutagenesis of Histone Genes in Budding Yeast. In this example the targeted gene is HHT2, but any other core histone gene can also be mutagenized using this strategy. (A) Haploid yeast cells harbor two histone H3-encoding genes (HHT1 and HHT2) and two histone H4-encoding genes (HHF1 and HHF2) arranged as shown in the figure (the HHT1 and HHF1 genes are located on chromosome II and the HHT2 and HHF2 genes are located on chromosome XIV - in each case, the arrows point in the direction of transcription). In the first step of the procedure, the ORF of the HHT2 gene is replaced with the URA3 gene, giving rise to an hht2Δ::URA3 strain. (B) In part 1, a wild-type copy of the HHT2 gene from a genomic DNA sample is used as template for two PCR reactions to generate the two partially overlapping fragments of the gene. The reverse primer for the first reaction includes one or more mismatched nucleotides (indicated with a red circle) that correspond to the desired mutation(s) to be introduced into the genome. The forward primer for the second reaction has the equivalent mismatch in a reverse complementary configuration (also indicated with a red circle). The two PCR products generated in part 1 (products a and b) are then used as templates for fusion PCR using two primers that anneal to products a and b in the fashion shown in part 2. This results in the generation of full-size PCR products (product c in part 3) harboring the desired mutation(s).",
    "(C) The hht2Δ::URA3 strain is then co-transformed with the full-size PCR products and a backbone plasmid (a HIS3-marked plasmid in this example), and cells are selected for the presence of the plasmid (on media lacking histidine in this example). Transformants are then screened for 5-FOA resistance - resistant cells are candidates for having undergone a homologous recombination event leading to integration of the PCR product and excision of the URA3 gene, as shown. Subsequent loss of the backbone plasmid by mitotic cell division leads to the final desired histone mutant strain. We have found that selection of the backbone plasmid followed by screening for 5-FOA resistance results in a much higher frequency of identification of correct integration events compared to direct selection on 5-FOA plates, which mostly identifies cells that have acquired spontaneous URA3 mutations. (This figure has been modified from reference14). Please click here to view a larger version of this figure.[href=http://cloudfront.jove.com/files/ftp_upload/55263/55263fig1large.jpg]",
    "1. Replacement of the Target Histone Gene with the URA3 Gene\nPerform standard PCR-mediated one-step gene disruption replacing the ORF of target histone gene with the URA3 gene8,9.\n\tNOTE: The use of yeast cells carrying the ura3Δ0 is recommended as this mutation removes the entire endogenous URA3 ORF, thus avoiding integration of the PCR product into the URA3 locus8. Alternatively, the K. lactis URA3 gene can be used effectively for the generation of the histone replacement in any ura3 background as it is functional in S. cerevisiae but has only partial sequence homology with the S. cerevisiae URA3 gene. The strain should also be auxotrophic for at least one compound that will allow for selection of the backbone plasmid in the transformation experiment (see step 4 of this protocol). This step is not necessary if a target histone geneΔ::URA3 strain is already available.\n2. Generation and Purification of PCR Products Corresponding to Two Partially Overlapping Fragments of the Target Histone Gene using Primers Harboring the Desired Mutation(s)\nGenerate PCR products corresponding to two partially overlapping fragments of the target histone gene.\nPrepare two PCR reactions as follows:\n\t\t\nTo generate PCR products corresponding to the first half of the gene (product a in Figure 1B), set up the following reaction: 1 μl template DNA, 5 μl10 μM forward primer, 5 μl10 μM reverse primer, 0.5 μl (1.25 U) thermostable DNA polymerase, 10 μl 5x DNA polymerase buffer, 5 μl dNTP mixture (2 mM each), and 23.5 μl dH2O.",
    "NOTE: The template DNA can be genomic DNA derived from a strain wild-type for the target histone gene isolated using standard procedures10. To account for variations in DNA concentration and level of impurities in different genomic preparations, it is recommended to optimize the reactions by using either undiluted DNA or different dilutions of the genomic preparations (e.g., 1:10 and 1:100). The forward primer should anneal to a region upstream of the target gene. The reverse primer should anneal within the ORF, be ~40 nucleotides in length, and contain the desired mutation(s) somewhere in the middle of it (see Figure 1B-1 and Representative Results section for examples). The use of a high fidelity DNA polymerase is recommended in order to reduce rates of undesired mutations during the synthesis of the PCR products.\nTo generate PCR products corresponding to the second half of the gene (product b in Figure 1B), set up a reaction as indicated in 2.1.1.1 but with different primers.\n\t\t\tNOTE: The forward primer should anneal within the ORF, be ~ 40 nucleotides in length, and contain the desired mutation(s) somewhere in the middle of it. Note that the mutation(s) in this primer is the reverse complement of the mutation(s) in the reverse primer in step 2.1.1.1. The reverse primer should anneal to a region downstream of the target gene (see Figure 1B-1 and Representative Results section for examples).\nPlace the reactions in a thermocycler with the following settings: 94 ˚C 30 sec; 30 cycles of the following settings: 98 ˚C 10 sec, 60 ˚C 5 sec, 72 ˚C 1.5 min; and 72 ˚C 10 min.\n\t\tNote: Optimization of PCR parameters may be required for specific primer sets and target histone gene.",
    "Run 20 - 50 μl of the material from the PCR reactions on a 0.9% low melting point agarose gel in 89 mM Tris base, 89 mM boric acid, 2.5 mM EDTA (TBE) buffer.\nCut agarose gel sections containing the PCR products from gel using a clean scalpel or razor blade and transfer each to a 1.5 ml microcentrifuge tube. Store agarose sections containing PCR products at -20 ˚C until ready to use.\n3. Fusion PCR of the Two Partially Overlapping Fragments to Obtain Full Size PCR Products for Integration\nPrepare template for PCR reactions\nMelt agarose gel sections from step 2.3 by placing the microcentrifuge tubes in a heat block set at 65 ˚C for 5 min (or until fully melted). Vortex tubes every 1 - 2 min to facilitate the melting process.\nTransfer a set amount of melted agarose from each sample (e.g., 50 μl each, for a total of 100 μl) into a single microcentrifuge tube and mix by vortexing. Use this as the template in the fusion PCR reactions. Place the tube at -20 ˚C until ready to use.\nAmplify a large quantity of full size PCR product (product c in Figure 1B)\nSet up six PCR reactions, each with the following components: 2 μl template DNA, 10 μl 10 μM forward primer, 10 μl 10 μM reverse primer, 1 μl (2.5 U) thermostable DNA polymerase, 20 μl 5x DNA polymerase buffer, 10 μl dNTP mixture (2 mM each), and 47 μl dH2O.",
    "NOTE: The number of reactions can be altered depending on the PCR efficiency. The template DNA (see 3.1.2) should be heated to 65 ˚C until melted, mixed by vortexing, and added last to the PCR reaction mix. Once added, mix gently but thoroughly by pipetting the solution up and down several times. To account for variations in DNA concentration in the different samples, it is recommended to first optimize the reactions by using either undiluted template or different dilutions of the template (e.g., 1:10 and 1:100). The two primers used should anneal to the two partially overlapping fragments of the target gene as illustrated in Figure 1B-2 and be designed such that the final PCR products will have at least 40 base pairs on either side homologous to the regions flanking the URA3 ORF that will drive the homologous recombination step (see Representative Results section for examples). The use of a high fidelity DNA polymerase is recommended in order to reduce rates of undesired mutations during the synthesis of the PCR products.\nPlace the tubes in a thermocycler with the following settings: 94 ˚C 30 sec; 30 cycles of the following settings: 98 ˚C 10 sec, 50 ˚C 15 sec, 72 ˚C 1.5 min; and 72 ˚C 10 min.\n\t\tNOTE: Optimization of PCR parameters may be required for specific primer sets and target histone gene.\n4. Co-transformation of Full Size PCR Products and Backbone Plasmid, and Selection for Marker on Plasmid\nConcentration of PCR products\nPool the six PCR reactions (600 μl total) from step 3.2.2 into a single microcentrifuge tube and mix by vortexing.",
    "Split the sample into three 200 μl aliquots in microcentrifuge tubes. Precipitate the DNA in each tube by adding 20 μl of 3M sodium acetate (pH 5.2) and 550 μl of 100% ethanol. Mix the solution thoroughly and place on ice for at least 15 min. Collect DNA by centrifugation at ~14,000 x g for 10 min, rinse the pellet with 200 μl of 70% ethanol, and air dry.\nResuspend each DNA pellet into 25 μl of dH2O, and pool into a single tube (for a total of 75 μl).\nYeast co-transformation\nPrepare 10 ml of overnight culture of the strain generated in section 1 in Yeast extract Peptone Dextrose (YPD) liquid medium11.\nThe following morning, inoculate 400 mL of YPD liquid medium with 8 ml of the saturated overnight culture and incubate by shaking at 30 °C for 4 - 5 h to allow cells to enter logarithmic phase of growth.\nCollect the cells by centrifugation at ~3,220 x g for 10 min, discard the liquid medium, and resuspend the cells in 1 volume of 10 mM Tris-HCl (pH 8.0), 1 mM EDTA, 0.1 M Lithium Acetate solution (TE/LiAc).\nCollect the cells by centrifugation at ~3,220 x g for 10 min, and discard the TE/LiAc.\nResuspend the cells in 1 ml TE/LiAc.\nSet up the following reaction cocktail in a microcentrifuge tube: 800 μl of cells from step 4.2.5, 40 μl of boiled 10 mg/ml salmon sperm DNA, a total of 12.5 μg of backbone plasmid DNA, and 75 μl of concentrated PCR product from step 4.1.3.",
    "NOTE: Salmon sperm DNA should be boiled for 5 min and placed on ice for at least 5 min before use in the reaction. Total volume of backbone plasmid DNA added should be kept to a minimum (~80 μl or less). See Representative Results section for an example of a backbone plasmid.\nMix the cocktail tube thoroughly and aliquot evenly into eight microcentrifuge tubes (Tubes 1 - 8).\nSet up the following two control transformation reaction tubes:\n\t\t\nTube 9 (no PCR product control): 100 μl of cells from step 4.2.5, 5 μl of boiled 10 mg/ml salmon sperm DNA (boiled for 5 min; see step 4.2.6 Note), a total of 1.56 μg of backbone plasmid DNA and no PCR product added.\nTube 10 (no DNA control): 100 μl of cells from step 4.2.5, 5 μL of boiled 10 mg/mL salmon sperm DNA (see step 4.2.6 Note), no backbone plasmid DNA added, and no PCR product added.\nMix both tubes gently but thoroughly by pipetting up and down several times.\nIncubate the ten tubes at 30 ˚C for 30 min.\nTo each tube, add 1.2 ml of 40% polyethylene glycol (PEG 3350) in TE/LiAc. Mix thoroughly using a P-1000 pipet until the solution is homogeneous.\nIncubate the ten tubes at 30 °C for 30 min. Gently mix the solution by pipetting up and down and then incubate tubes at 42 °C for 15 min.\nCollect the cells by spinning the tubes in a microcentrifuge at ~14,000 x g for 30 sec. Discard the liquid and resuspend the cells in 1 ml of sterile dH2O.\nCollect the cells by spinning the tubes in a microcentrifuge at ~14,000 x g for 30 sec. Discard the liquid and resuspend the cells in 500 μl of sterile dH2O.",
    "Pool tubes 1 - 8 together (total volume of 4 ml) and mix thoroughly by pipetting up and down.\nPlate 200 μl of the above mixture on each of twenty complete minimal dropout medium plates11 (plates 1-20) for selection of the backbone plasmid.\nPlate 200 μl of the mixture from Tube 9 and 200 μl of mixture from Tube 10 each on its own selection plate (plates 21 and 22, respectively).\nIncubate the 22 plates at 30 °C for 3 - 5 days to select for plasmid transformants.\nInspect transformation plates after 3 - 5 days of incubation. Approximately 5,000 colonies should be visible on plates 1-21 (see Representative Results for an example) and no colonies should be present on plate 22.\n5. Screen for 5-FOA-resistant Transformants\nTransfer cells from plates 1 - 20 (and transformation plate 21 as a control) to 5-fluoroorotic acid (5-FOA) plates11 by replica-plating12 in order to screen for loss of the URA3 gene as a result of integration of the PCR products at the desired location.\n\t\nRemove the plate lid and press the plate containing colonies on a sterile velvet. Transfer the cells from the velvet to a 5-FOA plate by pressing the plate on the velvet. Incubate plates at 30 ˚C for 2 days.\nFollowing the 2-day incubation, carefully inspect the 5-FOA plates for growth.\n\tNOTE: A candidate integration event will be represented by a small asymmetric \"squashed\" colony on a 5-FOA plate - conversely, small papillae growing on 5-FOA plates are likely representative of spontaneous URA3 mutations that arose during the growth of colonies on the transformation plates, and are thus unlikely to represent the desired integration event (see Figure 3 in the Representative Results section for further elaboration on this point and for some examples).",
    "6. Purification of 5-FOA-resistant Colonies and Loss of Backbone Plasmid\nUsing sterile toothpicks, pick the candidate colonies from the 5-FOA plates described in step 5.2 and streak for single colonies onto YPD plates. Incubate for 2 - 3 days at 30 °C.\nFollowing the incubation, replica-plate each YPD purification plate to a fresh YPD plate, a drop-out plate lacking uracil to check for loss of the URA3 gene, and a second drop-out plate to monitor for the presence or absence of the backbone plasmid. Incubate for 1 - 2 days at 30 °C.\nFollowing the incubation, identify a colony from each candidate sample that is growing on the YPD plate but not growing on either drop-out plate (such a colony is expected to have lost the URA3 gene through the recombination event and lost the backbone plasmid during mitotic cell division). Restreak such colonies on fresh YPD plates. These colonies are the integration candidates and will be analyzed further in step 7.\n7. Molecular Analyses to Assay for Proper Integration of the Mutant Allele\nIsolate genomic DNA from the candidate samples using standard procedures10.\nAmplify genomic region encompassing the target site.\nSet up the following PCR reaction for each sample: 0.5 μl template DNA, 5 μl 10 μM forward primer, 5 μl 10 μM reverse primer, 0.5 μl (2.5 units) Taq DNA polymerase, 5 μl 10x Taq DNA polymerase buffer, 5 μl dNTP mixture (2 mM each), and 29 μl dH2O.",
    "NOTE: Template DNA is the genomic DNA derived from the candidate samples. It is recommended to also include two control reactions: one using genomic DNA derived from the original histone geneΔ::URA3 strain as template and another using genomic DNA from a wild-type histone strain as template. To account for variations in DNA concentration and level of impurities in different genomic preparations, it is recommended to optimize the reactions by using either undiluted DNA or different dilutions of the genomic preparations (e.g., 1:10 and 1:100). It is important to make sure that these primers anneal to DNA sequences outside the region encompassed by the putatively integrated PCR product - this way, the size of the PCR products in these reactions can be used as a diagnostic tool for integration of the products at the correct genomic location (see Representative Results for an example).\nPlace the reactions in a thermocycler with the following settings: 94 °C 3 min; 30 cycles of the following settings: 94 °C 45 sec, 50 °C 45 sec, 72 °C 2 min; and 72 °C 10 min.\n\t\tNOTE: Optimization of PCR parameters may be required for specific primer sets and target histone gene.\nProcessing of PCR products\nRun 20 μl from each reaction on a 0.8% TBE agarose gel.\nAssess the size of the PCR products using DNA standards as a reference to determine if the URA3 gene has been successfully replaced by the putatively mutated histone gene (see Representative Results for an example).",
    "NOTE: In certain cases, the desired mutation(s) introduced into the histone genes either create or destroy a restriction site. If this is the case, the presence of the desired mutation in the PCR products of the size indicative of correct integration can be assessed by subjecting the products to digestion with the corresponding restriction enzyme followed by gel electrophoresis analysis (see Representative Results for an example).\nSubject PCR products of the size indicative of correct integration to DNA sequencing to confirm the presence of the desired mutation(s) and to ensure that no additional mutations have been introduced into the genome.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}