{
  "id": 7764,
  "origin_website": "Bio",
  "title": "Sample Preparation and Integrative Data Analysis of a Droplet-based Single-Cell ATAC-sequencing Using Murine Thymic Epithelial Cells",
  "procedures": [
    "Sample preparation  Mince murine thymus using razor blades in a 6 cm dish and transfer to a 1.5 mL tube.Add 1 mL of ice-cold RPMI-1640 to the minced thymus and gently pipette up and down.Discard supernatant as a thymocyte fraction. Note: Thymic stroma cells including TECs are contained in the pellet at this step. If necessary, keep supernatant for analysis of thymocytes.  Repeat steps A2–A3 three times.Add 700 µL of Liberase/DNase I solution to the precipitate containing thymic stroma cells.Incubate the cell suspension in a 37 °C water bath for 12 min and then collect the supernatant to a 15 mL conical tube.Repeat steps A5–A6 three times.Centrifuge the cell suspension at 440  × g  and 4 °C for 5 min.Discard the supernatant and resuspend the cell pellet in 1 mL of ice-cold FACS buffer.Count cells.Incubate approximately 1.0 × 108  /mL of cells with anti-mouse CD16/32 antibody at dilution 1:200 on ice for 20 min.Centrifuge the cell suspension at 1,000  × g  and 4 °C for 1 min.Re-suspend the cell pellet in FACS buffer.Stain approximately 1.0 × 108  /mL of cells with APC/Cyanine7 anti-mouse TER-119/erythroid cells, APC/Cyanine7 anti-mouse CD45, and FITC anti-mouse CD326 Ep-CAM antibodies, at dilution 1:400 each, in the dark on ice for 20 min.Resuspend the cell pellet in FACS buffer and centrifuge at 1,000  × g  for 1 min.Repeat step A15.Transfer cell suspension containing actinomycin D, 7-amino- to a 5 mL conical tube for cell sorting. Cell sorting  Set up BD FACS Aria II cell sorter.Sort TECs based on the gating strategy shown below (Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4588/bioprotoc-13-01-4588-g001.jpg Figure 1. Gating strategy of thymic epithelial cells.  (a) The gating strategy excludes dead cells and debris. (b) Thymic epithelial cells are defined as CD45- TER119- EpCAM+  cells and sorted using a BD FACS Aria II cell sorter.",
    "Collect the sorted cells in a 1.5 mL tube containing 750 µl of 5% FBS-RPMI-1640.Check the purity by FACS analysis using 1/100 of sorted cells.Centrifuge the sorted cells at 500  × g  and 4 °C for 5 min.Resuspend the cell pellet in 100 µL of 0.04% BSA-PBS.Count cells. Note: A minimum of 1.0 × 105  cells is required at this point.   Nuclei isolation  Centrifuge the sorted cells at 300  × g  and 4 °C for 5 min.Remove the supernatant carefully.Add 100 µL of 1× lysis buffer and mix by pipetting 10 times. Note: Change the concentration of lysis buffer by diluting with lysis dilution buffer, depending on the type of tissue analyzed to prevent cell nuclei from bursting.  Incubate for 3 min on ice for nuclei isolation by cell lysis. Note: Proper incubation time for cell lysis may vary depending on cell types.  Immediately add 1 mL of wash buffer and mix by pipetting five times.Centrifuge the nuclei suspension at 500  × g  and 4 °C for 5 min.Remove the supernatant carefully.Resuspend the cell pellet in 50 µL of diluted nuclei buffer.Count cell nuclei. Note: Efficiency of cell lysis can be monitored by cell viability. Viability must be less than 5%. Generally, viability decreases with increasing incubation time, but excessive incubation may impair nuclear quality.  To confirm the quality of nuclei, check the nuclei under the microscope (Figure 2). Note: Criteria for nuclear quality is provided in the 10× Genomics protocol (Nuclei Isolation for Single Cell ATAC Sequencing).  imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4588/bioprotoc-13-01-4588-g002.jpg Figure 2. A representative image of high-quality nuclei prepared from TECs. (a) Nuclei observed with brightfield microscopy. (b) Nuclei observed after acridine orange/propidium iodide staining. Permeabilized nuclei emit orange fluorescence.",
    "Proceed to the scATAC-seq library construction and sequencing by following the 10× Genomics protocol (Chromium Single Cell ATAC Solution User Guide) and using the Chromium Next GEM single cell ATAC library & gel bead kit, Chromium i7 Multiplex kit N, set A, Chromium Next GEM Chip H single cell kit, and Single Index kit N, set A."
  ],
  "subjectAreas": [
    "Immunology",
    "Systems Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}