{
  "id": 7226,
  "origin_website": "Bio",
  "title": "Production of the Receptor-binding Domain of the Viral Spike Proteins from  2003 and 2019 SARS CoVs and the Four Common Human Coronaviruses for Serologic Assays and Inhibitor Screening",
  "procedures": [
    "Establishment of the Expi293 Cell Line (Thermo Fisher Scientific)Remove a cell aliquot from liquid nitrogen.Immediately hand thaw the cells and place them in a 37°C water bath. Once thawed, swirl the tube gently without submerging completely until only a small amount of ice remains.Spray hands with 70% ethanol and gently rub the cell vial to decontaminate before transferring into the laminar flow hood.Use a serological pipette to transfer all tube contents into a plain bottom, vented Fisherbrand Shaker Flask, prewarmed with 30 ml of Expi293 Expression Medium.Incubate cells at 37°C with ≥ 80% relative humidity and 8% CO2. Set shaking speed to 125 RPM for a 125 ml shaker flask.Passage cells when the cell density reaches 1 × 106-3 × 106 cell/ml.Note: This usually occurs 4-6 days post-thaw. Proceed to transfection once the cell density reaches approximately 3 × 106-5 × 106 viable cells/ml and cell viability is ≥ 95%.Note: To cryopreserve cells for future use, grow the cell culture to 3 × 106-5 × 106 viable cells/ml and centrifuge them at 300 × g for 5 min. Discard the supernatant, add Expi293 Expression medium with 10% DMSO, and gently resuspend the cells by pipetting.Dilute the cells to 1 × 107 viable cells/ml and pipet 1 ml aliquots into cryopreservation tubes and freeze with a controlled-rate freezing apparatus at -80°C freezer. After 24 h, transfer to cryogenic dewar for long-term storage and future use. Allow cells to recover in culture for two more passages post-thaw before transfecting.Note: For general cell maintenance, passage cells at 0.5 × 106 cell/ml when they reach a density of 3 × 106-5 × 106 cell/ml. Growing past 5 × 106 cell/ml is not recommended.",
    "Transfection (30 ml)Dilute a total of 75 × 106 cells to a final density of 3 × 106 cell/ml with 25 ml of prewarmed Expi293 Expression Medium in a 125 ml shaker flask.Dilute 25 μg of RBD expression plasmid DNA in 1.5 ml of Opti-MEM Medium.Dilute 80 μl of ExpiFectamine 293 Reagent in 1.4 ml of Opti-MEM Medium. Incubate the solution at room temperature for 5 min.Add diluted plasmid DNA to the solution containing ExpiFectamine 293 Reagent and incubate at room temperature 10-20 min. The volume should be approximately 3 ml.Transfer 3 ml of the solution into a shaker flask and incubate cells at 37°C with ≥ 80% relative humidity and 8% CO2.Eighteen to twenty-two hours post-transfection, add 150 μl of ExpiFectamine 293 Transfection Enhancer 1 and 1.5 ml of ExpiFectamine 293 Enhancer 2 to the shaker flask. Incubate cells for up to 5 days post-transfection.Note: The procedure can be scaled up proportionally for larger transfections. Cell viability should be above 50% on day 5. Harvest and DialysisTransfer the cell culture to a 50 ml Falcon tube and centrifuge at 3,000-5,000 × g for 5 min at 25°C (Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4026/bioprotoc-11-10-4026-g001.jpgFigure 1. Schematics of harvesting cell culture and dialysis of supernatant Transfer the supernatant into a fresh 50 ml Falcon tube and keep it on ice.Prepare 3 L of dialysis buffer.Use about 7-8 inches of SnakeSkin Dialysis Tubing and SnakeSkin Dialysis Clips to transfer 30 ml of harvested supernatant into the dialysis buffer.Note: Hydrate the membrane with the dialysis buffer before transferring the supernatant. Place the sealed snakeskin tubing and a magnetic stir bar in a 4-L beaker.Place the beaker on a magnetic stirrer and allow buffer exchange at 4°C overnight.Transfer the buffer-exchanged supernatant into a 50 ml Falcon tube.",
    "Note: Upon harvesting, it is possible to evaluate the success of transfection and protein expression before the affinity chromatography step by SDS-PAGE with the cell culture supernatant (optional). To perform this: Mix 50 µl of 2× Laemmli Sample Buffer with 2-mercaptoethanol and 50 µl of cell culture supernatant and boil the sample at 95°C for 5 min. Load 8-15 μl of the reduced sample onto the SDS-PAGE. Run sample at 170 v in the Mini-PROTEAN Tetra Vertical Electrophoresis Cell for 35 min and visualize the bands after Coomassie staining using the manufacturer’s protocol. Immobilized metal affinity chromatographyTake 0.5 ml of Ni-NTA resin in a poly-prep chromatography column and equilibrate with 5 ml of purifying buffer in 1 ml increments. Close the column and resuspend the resin in 1 ml of purifying buffer.Note: Proportionally adjust the amount of resin needed for larger transfections. Transfer the equilibrated resin into a 50 ml Falcon tube containing the buffer exchanged supernatant.Incubate the resin with the supernatant on a rocking shaker for 1 h at 4°C.Remove the 50 ml Falcon tube from the rocker and place it on a stand. Allow the resin to settle for 20 min.Transfer the supernatant into a new 50 ml Falcon tube without disturbing the resin.Transfer the resin directly onto the bed of the poly-prep chromatography column.Wash the resin with 6 ml of purifying buffer in 1 ml increments by pipetting on the chromatography column wall.Note: Allow the buffer to flow through the column completely before adding another ml of wash buffer. Elute the protein by adding 200 μl of elution buffer onto the column wall for a total of 7 fractions.Quantify the protein by measuring the absorbance of the fraction at 280 nm.Assess the protein purity by SDS PAGE run under reducing conditions (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4026/bioprotoc-11-10-4026-g002.jpgFigure 2.",
    "SDS-PAGE analysis of purified spike RBD proteins StoragePurified proteins can be stored at 4°C for a few weeks. For long-term storage, protein samples can be aliquoted, flash-frozen in liquid nitrogen, and stored at -80°C. Frozen protein samples can be quickly hand thawed before use."
  ],
  "subjectAreas": [
    "Immunology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}