{
  "id": 7658,
  "origin_website": "Bio",
  "title": "<em>Cryptococcus neoformans</em> Virulence Assay Using a <em>Galleria mellonella</em> Larvae Model System",
  "procedures": [
    "Selection of larvae with desirable mass Select and separate G. mellonella larvae and prepare Petri dishes, one for each tested group. Larvae are always handled while wearing nitrile gloves to reduce the risk of contamination.Use a digital scale to select larvae with a body mass between 100 and 200 mg. Larvae are weighed individually in small polystyrene weigh boats before being transferred into Petri dishes, with up to 15 larvae in each Petri dish.Note:  Larvae should be relatively firm to the touch and not exhibit signs of illness, such as dark melanization throughout the body or reduced movement (Figure 1A). There is normal variability in the cuticle pigmentation in healthy larvae. Ideally, larvae will be sorted at least 16–24 h prior to infection to allow acclimatization at room temperature following arrival.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4480/bioprotoc-12-15-4480-g001.jpgFigure 1. Evaluation of G. mellonella fitness.  (A) Progression of cryptococcal infection in a larva resulting in discoloration and death. (B) Transition of infected larva into the pupa and progression of cryptococcal infection resulting in death. (C) Completed development of the pupa and metamorphosis into moth, which typically occurs at or beyond day 14 under the experimental lab conditions described.Preparation of fungal cell inoculum Approximately 48 h prior to the infection, inoculate 5 mL of YPD media with the desired strain of C. neoformans in a 14 mL Snap-Cap culture tube and incubate on the cell culture rotor at 30 °C, 35 rpm. Alternatively, C. neoformans can be grown in 1 mL of YPD media overnight (16–24 h) at 30 °C, 35 rpm.Transfer 1 mL of stationary-phase culture to 1.5 mL Eppendorf tubes and pellet fungal strain by centrifuging tubes for 4 min at 2,500 × g in the tabletop centrifuge.",
    "Wash your samples twice with DPBS by discarding supernatant and resuspending the pellet in 1 mL of sterile DPBS each time.Prepare a 1:100 cell dilution and establish cell concentration using a hemocytometer.According to this protocol, diluting cells to this concentration will result in 105 cells injected per larvae; if a different inoculum is desired, adjust the cell dilution appropriately. To prepare samples for injecting 105 cells per larvae, dilute your washed cells with DPBS to the concentration of 107 cells/mL.Infection of larvae Calibrate the stepper device and set to dispense 10 µL of liquid prior to the experiment, unless another volume is needed or desired.Draw inoculum into a 1 mL tuberculin syringe.Invert and flick the syringe until air bubbles rise to the top and air can be expelled, leaving only the prepared inoculum.Load the syringe into the stepper device, making sure the syringe is firmly in place, the syringe’s plunger rests against the stepper’s pusher, and the hilt of the syringe rests on syringe clip to prevent slipping and inaccurate dispensing of inoculum.Test that the stepper is accurately dispensing the inoculum when the dispense button is pressed.Pick up a pre-sorted G. mellonella larva with the non-dominant hand. Hold the larva firmly with thumb and index fingers to prevent movement. Fingers should be placed towards the head and thorax to keep the abdomen open. Be careful not to stick the finger with the syringe needle.Inject the needle into the last left proleg (Figure 2).It is important to be consistent with which proleg is injected to reduce variability in the infection. The needle should enter midway through the larva.Remove larvae carefully from the needle and place it into a Petri dish.If excessive hemolymph (as indicated by yellow fluid) leaks from the injection site, larval death may occur.",
    "If problems with hemolymph leaking persist, leaving the needle in the larvae for 15 s before removal may reduce the amount of hemolymph lost. If there are concerns about dried hemolymph on the Petri dish following injection, hemolymph can be cleaned by temporarily removing the larvae, wiping the Petri dish with 70% ethanol, and drying with a paper towel.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4480/bioprotoc-12-15-4480-g002.jpgFigure 2. Infection of larvae. (A) Illustration of G. mellonella larva model with indication of major anatomical parts. (B) Photo illustrating the injection site of C. neoformans cell suspension into the base of larva’s proleg. (C) Close up photo of the injection site.Incubation and maintenance of the tested larvae After finishing the series of injections, transfer Petri dishes with larvae to the location with desired temperature for the analysis (room temperature or 30 °C).Perform evaluation of larvae variability every day by checking for changes in color of each larva and by gently poking the larva using the pointy end of a pipette tip.If survival of pupae is also assayed, check pupal survival by gently pressing down on pupae with the base of the pipette tip. Lack of movement following poking indicates death. Change of body color in deceased G. mellonella larvae progress from an initial creamy color to grey, brown, and black (Figure 1A). Healthy pupae start off white and yellow, and naturally become a light to medium brown color, whereas dead pupae show a dark brown to black color (Figure 1B)."
  ],
  "subjectAreas": [
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}