{
  "id": 16532,
  "origin_website": "Jove",
  "title": "Measurement of Glutamate Uptake using Radiolabeled L-[3H]-Glutamate in Acute Transverse Slices Obtained from Rodent Resected Hippocampus",
  "procedures": [
    "All procedures were performed in accordance with the NIH Guide for the Care and Use of Laboratory Animals and approved by the local Ethics Committee (project approval # 33732/CEUA-UFRGS). All efforts were made to minimize discomfort and the number of animals used in the experiments.\n1. Preparing Hank's Balanced Salt Solution (HBSS)\nIn a 1 L beaker, add approximately 0.5 L of sterile or double-distilled water and begin stirring vigorously on a magnetic stirrer. Add the following HBSS components (in mM): 137 NaCl, 0.63 Na2HPO4, 4.17 NaHCO3, 5.36 KCl, 0.44 KH2PO4, 0.41 MgSO4, 0.49 MgCl2, 5.55 D-Glucose (see Table 1).\nAdjust the pH to 7.4 with NaOH or HCl before adding 1.26 mM CaCl2 to avoid precipitation. Add this salt very slowly and under agitation. Bring it up to a volume of 1 L with sterile or double-distilled water. This buffer will be used to wash the tissue and to maintain the AHS in a viable state during the experiment. It will provide inorganic ions while maintaining a physiological pH and osmotic pressure.\n\tNOTE: The addition of divalent cations is done after titration of pH to avoid precipitation.\nSeparate two different fractions of HBSS: one will be kept in a water bath at 37 °C and used during the uptake paradigm, while the other will be kept ice-cold (4 °C) and used for washings before and after the experiment.\n\t​NOTE: It is possible to prepare stock solutions of each salt and keep them frozen until use, store it in the freezer (-20 °C) and use it within a few weeks.\n2. Preparing Sodium-Free HBSS",
    "Before mixing the components for sodium-free HBSS, prepare in advance two other solutions: Glucamine-HCl (137 mM) and Glucamine-HEPES (4.17 mM). Mix equimolar concentrations of NMDG base and HCl to obtain the Glucamine-HCl solution. Do the same procedure with 2.0 M HEPES free acid to obtain the NMDG-HEPES solution (see Table 2).\nIn a 0.5 L beaker, add approximately 0.2 L of sterile or double-distilled water and begin stirring vigorously in a magnetic stirrer. Add the following buffer components (in mM): 137 Glucamine-HCl, 4.17 Glucamine-HEPES, 5.36 KCl, 0.44 KH2PO4, 1.26 MgSO4, 0.41 MgCl2, and 5.55 D-Glucose (see Table 2).\nAdjust the pH to 7.4 with KOH or HCl and keep stirring. Add 1.26 mM CaCl2 very slowly and under agitation. Bring the solution up to a volume of 0.3 L with sterile or double-distilled water.\n\tNOTE: This buffer will be used to measure non-sodium-dependent glutamate uptake, which will allow the measurement of passive/non-specific glutamate uptake. After the experiment, this parameter is subtracted from the total glutamate uptake to determine sodium-dependent uptake.\nAfter preparation, this buffer can be stocked in the freezer (-20 °C) and used afterward in subsequent experiments. The same goes for the NMDG solutions.\nDuring the experiment, always keep the sodium-free HBSS ice cold.\n3. Organizing the material for hippocampus dissection from rats\nOrganize the dissection area next to the sink before starting the experiment. Position a specific guillotine for rats (for mice, it will be possible to use sharp scissors) into the sink to keep the bench clean.",
    "Arrange the surgical instruments and other materials for brain removal and hippocampal dissection in the order of use and as close as possible to where they are needed (see Table of Materials). Place the Petri dish in an ice bucket. Also, keep a plastic bag nearby for disposal of the carcass.\nPrepare both HBSS solutions at the recommended concentration for use. The sodium-free HBSS can be frozen and thawed before the experiment.\n\t\nSeparate sodium-containing HBSS into two distinct portions, as previously recommended: one heated at 37 °C and another at 4 °C that will be used for dissection. Thaw sodium-free HBSS and keep at 4 °C.\nTo induce anesthesia, use 3% isoflurane31. Before beginning the experiment, make sure to verify the absence of corneal reflex and nociceptive stimulation of the hind paw.\n\t​NOTE: Be careful to choose the adequate anesthetic drug, as it should not interfere with any parameters that will be under investigation. For this protocol, it is recommended the use of inhalant anesthetic (e.g., isoflurane)32.\n4. Euthanizing the rat\nEuthanize the rodent by using the approved methods by the Institutional Animal Care and Use Committee (IACUC), as well as by the National Institutes of Health Guide for the Care and Use of Laboratory Animals (NIH Publications No. 8023, revised 1978).\nUsing a guillotine, decapitate the rat immediately prior to the first cervical vertebra.\nPlace the head on a clean paper towel moistened with cold saline solution. Completely remove the scalp with the surgical scissor size S, as well as the cutaneous muscle aiming to fully exposing the sutures on the superior surface of the skull. Initiate this procedure carefully, starting near the occipital bone and running posteriorly to the nasal bone.",
    "​NOTE: In case the experimental model is mice, use sharp scissors to remove the head. Be sure to cut just behind the skull to exclude excess tissue.\n5. Removal of the rat brain\nPerform brain removal as quickly as possible. With an appropriate bone plier, make a single cut between both eyeholes joining both orifices in the rat's skull. After, place one tip of the surgical scissor size S into the foramen magnum and make a single cut laterally into the skull. Repeat for the other side.\nCut the skull plates from the occipital plate, then along the midline suture of the parietal plates, and finally to the frontal plate towards the nose. Be sure that the rodent's head is held firmly and that the pressure is directed away from the brain to prevent damaging the tissue underneath.\n\tNOTE: It is critically important that pressure is directed away from the brain to prevent damaging the tissue underneath. In young rats and mice, it is possible to cut the skull with small surgical scissors.\nGently remove the occipital and parietal plates from both hemispheres using a spatula or forceps. Carefully inspect for any dura matter that may be attached to the skull bones and stretched across the surface of the brain.\nRemove the brain immediately with the thin double-ended spatula and gently place the whole brain on an ice-cold Petri dish covered with filter paper. With the plastic Pasteur pipette dampen it with ice-cold saline solution. Immediately start to dissect the hippocampi from both brain hemispheres as explained below.",
    "Carefully resect the cerebellum from the whole brain with the #11 scalpel blade. In order to completely separate the cerebral hemispheres run a scalpel blade throughout the intrahemispheric fissure. With the plastic Pasteur pipette, dampen it with ice-cold HBSS buffer frequently to keep the tissue wet and preserved.\nTake each hemisphere separately, resect brain stem and midbrain from the overlying cortex with an Iris scissors. Carefully, with the surgical scissor cut the brainstem/midbrain/thalamus, while with a thin brush push down and pull these brain structures. Below it will be possible to observe the hippocampus (medial surface) and the lateral ventricle. The cortex with the hippocampus should now be free from the brainstem.\n6. Hippocampi dissection from rats\nTo resect the hippocampus, put one brain hemisphere in the coronal plane with the parietal cortex facing down. At this moment, it is possible to observe the white fimbria fibers that form a shallow hyperbola at the bottom of the hippocampus.\nVery carefully, with the non-dominant hand, anchor the brain tissue with thin tweezers. With your dominant hand, place other tweezers under the caudal tip of the hippocampus.\nAnchoring the medial white matter tracts, position the tweezers completely under the hippocampus to separate it from the rest of the brain gently. Apply pressure while moving the second tip slightly anteriorly and laterally. If done properly, the hippocampus should land on the filter paper.\nTo finish the hippocampus dissection, remove the spare tissue with the same tweezers (usually any remaining cortex, blood vessels, and white matter). Repeat the same methodology for the second hemisphere.",
    "Once both hippocampi are removed, transfer it to a Petri dish with HBSS placed on the ice bucket and transfer to the cutting table area above the blade in the tissue chopper. Be sure to properly identify the dorsal and ventral areas if the investigation requires analyzing them separately.\n\tNOTE: It is important to always distinguish the ventral and dorsal parts of the hippocampus during dissection. By doing so, the anterior end will be facing upwards33. This part of the hippocampus is slightly thinner than the posterior end.\n7. Slices preparation\nNOTE: While arranging the surgical material on the bench (session 2), prepare the tissue chopper to obtain the transverse slice from the resected hippocampus.\nSet the parameters in the tissue chopper before its use. The Chopper can cut slices from 100 to 400 µm; set it to 300 µm. Additionally, it is recommended a range of 60-80 strokes per minute, as it maintains the tissue integrity during the slicing procedure.\nAfter all the procedures performed in session 2, once the hippocampi were resected from the brain and placed on the filter paper humidified with cold saline solution on top of a smooth polypropylene support, align each hippocampus on the filter paper before submitting them to the chopping procedure.\nPlace the hippocampus at a time on the circular stainless-steel cutting table from tissue chopper, perpendicular to the cutting blades to obtain the transverse hippocampus slices along the septo-temporal axis. Before starting the chopping process, lightly humidify the blade using isopropyl alcohol. This procedure keeps the tissue from sticking on the blade, allowing a more smooth and precise slicing.",
    "After turning the equipment on, the blade in the chopping arm will be raised and dropped, slicing the tissue in the selected thickness. This is a quick process, and normally the tissue will be properly sliced after a minute. It is possible to chop more than one hippocampus at the same time if they are kept properly separated on the cutting table.\nTo separate the slices, take each sliced sample from the tissue chopper carefully using the double-ended spatula and plunge it into a Petri dish with ice-cold saline solution. Using two thin brushes, gently pinch the hippocampus and separate the slices. Be careful to maintain slice integrity through this process.\n\t\nPerform this experiment in triplicates, hence select 6 slices from each sample: 3 slices for the total glutamate uptake and 3 for the unspecific uptake.\nWith the brush, gently transfer each slice from the Petri dish to a 24-well plate containing: (i) 1 mL of HBSS; and (ii) 1 mL of HBSS sodium-free. Identify the well/plate with the correspondent experimental groups and perform the analysis at least in triplicates.\n\tNOTE: Due to a time-limited issue, if the experiment is performed in triplicates, it limits the number of animals/groups to only 6 at a time (one hippocampus per animal in 5 min uptake). This means that the L-[3H]-Glutamate will be administered every 15 s until all slices are incubated. To stop the reaction, the same interval should be observed to ensure that all samples are exposed to a 5 min incubation period.\n8. Glutamate uptake assay",
    "During the slices stabilization in the respective buffer (HBSS or sodium-free HBSS), prepare the radioactive-containing solution by diluting L-[3H]-Glutamate in sterile water to a final concentration of 4.5 μCi/mL in a final volume that allows 20 μL per slice plus some excess, which will prevent the lack of radioactive input at the end of the batch, since it will be needed to quantify how many disintegrations per minute (DPM) was offered to each slice in the beginning.\n\tNOTE: For each 24-well plate, it is recommended to prepare 500 μL of 4.5 μCi/mL L-[3H]- Glutamate due to the total incubation time needed for the L-[3H]-Glutamate uptake (5 min) and the time to pipette each 20 µL aliquot (0.33 μCi in each well), as explained below. The stock concentration of L-[3H]-Glutamate is usually 1.0 mCi/mL, thus prepare a 1:200 dilution to apply on the slices.\nAfter 15 min of pre-incubation in HBSS, completely remove the buffer with a Pasteur pipette and replace it by adding to the slices 280 μL of one of the following: (i) regular HBSS (37 °C) for total uptake; or (ii) sodium-free HBSS (4 °C) for unspecific uptake. It is important to notice that total uptake must be performed on a heating plate at 37 °C, while the unspecific uptake is performed on ice.\nPrepare one timer and set the beginning of the experiment when adding 20 μL input in the first well containing a slice. Wait for 15 - 20 s (depending on the number of slices in the plate) and add the radioactive input to the next well and so on until the end of the slice-containing wells. Distribute 20 μL of input in all the wells always considering the total incubation time (5 min).",
    "Once each of the wells containing slices in the plate are filled, wait for the first slice to complete 5 min incubation with L-[3H]-Glutamate. Then, immediately remove the incubation media to a proper flask for radioactive waste.\nImmediately after the removal, quickly add 300 μL of ice-cold HBSS and gently remove it. Repeat this procedure two more times in each well, completing three washes for each slice. Be sure to use the sodium-free HBSS for washing the slices devoted to the unspecific uptake measurement. After washing all the slices in the plate, add 300 μL 0.5 M NaOH to each well and store the plate protected with parafilm at 4 °C overnight.\n9. Counting the radioactive L-[3H]-Glutamate\nOn the next day, label as many tubes as slices in the experiment and collect the content of the well to each tube. Be sure that the slices are completely solubilized in the lysis solution. If necessary, homogenize the sample using a 26-gauge needle coupled to a 1 mL syringe.\nAdd 1.2 mL of scintillation liquid to a final volume of approximately 1.5 mL and homogenize all samples in a vortex before reading them in a scintillation counter for 60 s each.\n\t​NOTE: Be sure that the detection parameters are set to tritium and the result will be delivered in DPM.\n10. Calculations\nConvert the results given by the scintillation counter to the radioactivity emitted by the reagent trapped within the slice and represents the amount of glutamate taken up. Deduct the value obtained for the unspecific uptake from the result obtained with the regular HBSS. One μCi is equivalent to 2.22×106 DPM.\nBy knowing the amount of μCi and the original concentration of [3H]L-Glutamate (information usually provided in the reagent's flask or datasheet), calculate the L-[3H]-Glutamate captured by each slice.",
    "Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}