{
  "id": 9056,
  "origin_website": "Jove",
  "title": "Characterizing Multiscale Mechanical Properties of Brain Tissue Using Atomic Force Microscopy, Impact Indentation, and Rheometry",
  "procedures": [
    "Ethics Statement: All experimental protocols were approved by the Animal Research Committee of Boston Children's Hospital and comply with the National Institutes of Health Guide for the Care and Use of Laboratory Animals.\n1. Mouse Brain Tissue Acquisition Procedures (for AFM-enabled indentation and impact indentation)\nPrepare a ketamine/xylazine mixture to anesthetize the mice. Combine 5 ml ketamine (500 mg/ml), 1 ml xylazine (20 mg/ml) and 7 ml of 0.9% saline solution.\nInject mouse (Breed: TSC1; Syn-Cre; plp-eGFP; Age: p21; Sex: Male or Female) with 7 µl per gram bodyweight of the ketamine/xylazine solution.\nOnce the mouse is fully anesthetized, as demonstrated by a lack of response to toe and tail pinches, euthanize the mouse by decapitation using large dissection scissors.\nRemove the skull by cutting down the middle using smaller dissection scissors. Starting at the cerebellum, remove pieces of the skull using curved forceps. After removing the skull, extract the brain by using a flat spatula to lift the brain, starting at the cerebellum, and place the brain on a Petri dish. Remove the cerebellum from the brain using a razor blade.\nIf using a whole brain for impact indentation tests on fresh tissue, transfer brain into a round-bottomed tube with CO2-independent nutrient medium for adult neural tissue on ice and proceed to section 4. Otherwise proceed to step 1.6 for slicing procedures.\nAdjust the vibratome settings to a speed of 0.7 mm/sec, a vibration frequency of 70 Hz, and a slice thickness of 350 µm. Surround the vibratome dish with ice. Place a dab of superglue onto the vibratome plate and mount brain so that coronal slices can be cut, with the brain oriented to cut through the dorsal side first.",
    "Fill the vibratome dish with enough Dulbecco's phosphate-buffered saline (DPBS) to just submerge the brain. Raise the dish on the vibratome so that blade is just submerged in the DPBS.\nPress start to begin slicing coronal brain sections 350 µm thick.\nUsing paintbrushes to avoid damage to the tissue, transfer the brain slices from the vibratome DPBS bath and into a round-bottomed tube with CO2-independent nutrient medium for adult neural tissue on ice and perform measurements on fresh tissue within 48 hr. To begin AFM-enabled indentation experiments, proceed to section 3.\n2. Pig Brain Tissue Acquisition Procedures (for rheology)\nObtain a sagittally sliced porcine half brain within ~1 hr of sacrifice from a local butcher. Place the half brain in CO2-independent nutrient medium for adult neural tissue, and store on ice.\nUse a razor blade or scalpel to make a ~5 mm thick coronal brain slice and store in CO2-independent nutrient medium for adult neural tissue. Ensure that the slice surface is as flat as possible. Use careful lateral motions with razor/scalpel during sectioning.\nStore pig brain tissue in CO2-independent nutrient medium for adult neural tissue on ice and perform rheometry measurements (section 5) on fresh tissue within 48 hr.\n3. Atomic Force Microscope-enabled Indentation\nPrepare 60 mm-diameter Petri (P60) dishes with a mussel-derived bioadhesive according to the manufacturer's instructions.\n\t\nPrepare a stock of neutral buffer solution consisting of 0.1 M sodium bicarbonate in sterile water with an optimal pH of 8.0. Filter-sterilize (0.2 micron) the sodium bicarbonate buffer and store at 4 °C.\nIn a laminar flow hood, mix a solution of 6.25% mussel-derived bio-adhesive and 3.125% NaOH in the sodium bicarbonate buffer.",
    "Pipette 100μl of the bio-adhesive solution from 3.1.2 onto a 60 mm-diameter Petri (P60) dish and use pipette tip to spread solution into a 3-5 cm diameter circle.\nLeave P60 dishes uncovered in laminar flow hood and let solution dry (~30 min). Wash dishes 1x with PBS and 2x with sterile water. Let dishes air dry in laminar flow hood and store in a sealed plastic bag at 4 °C for up to 1 month.\nCalibrate the AFM and set-up brain sample in the AFM.\n\tNOTE: Follow AFM calibration instructions as per the manufacturer.\n\t\nCarefully load an AFM probe with a nominal spring constant of 0.03 N/m and a 20 μm-diameter borosilicate bead into the probe holder.\nCalibrate the spring constant and inverse optical lever sensitivity (InvOLS) of the AFM cantilever using the thermal tune method 15,16.\n\t\tNOTE: Once the spring constant for an AFM probe is calculated, it should remain constant with repeated use. However, the cantilever InvOLS will need to be recalibrated each time the laser is realigned with the cantilever. Additionally, calibration should be performed against a substrate several order of magnitude stiffer than the cantilever, such as polystyrene.\nTurn on the stage-mounted heater and set temperature to 37 °C.\nMount the brain slice onto the P60 dishes prepared in section 3.1.\n\t\t\nGently pour a 350 μm thick brain slice, as well as the CO2-independent medium from the round bottom flask into a P60 dish coated with the mussel-derived bioadhesive.\nBy gently tilting the P60 dish, position the brain slice in the center of the dish. If necessary, slowly pipette medium from a manual pipetter to unfold a brain slice that has folded over on itself or better position the brain slice in the center of the dish.",
    "Carefully remove excess media using a P1000 pipetter (do not use the vacuum).\nPlace cover on P60 dish and let the brain slice adhere for 20 min.\nRemove the AFM head, place the brain slice mounted in the P60 dish on the AFM stage, and add ~2 ml pre-warmed CO2-independent medium.\nCarefully add a drop of media onto the AFM probe to protect it from breaking due to surface tension when it is lowered into the media surrounding the brain slice.\nReposition the AFM head onto the stage, and begin lowering the head until it is submerged into the media.\nUsing the top-view CCD camera, reposition the laser onto the cantilever.\n\t\tNOTE: The alignment of the laser on the cantilever will have changed slightly due to the difference in refractive index of air and medium.\nWait 5 min for the cantilever to adjust to being submerged in a warm liquid, then reset the mirror alignment to a free deflection of 0 V.\nRun a thermal spectrum on the AFM probe according to the manufacturer's instructions16. Use the fit of the first thermal peak to re-calculate the AFM probe's InvOLS in media.\nUsing the optical microscope, move the sample stage such that the brain region of interest below the AFM probe.\n\t\tNOTE: The corpus callosum will appear dark as it is more opaque than the surrounding gray matter. The cortex is superior to the corpus callosum.\nReset the mirror alignment to a free deflection of 0 V.\nOn the Sum and Deflection Meter in the AFM software, click \"Engage\" to engage the AFM head.\nUsing the position dial on the AFM head, lower the head until contact between the cantilever and sample is made.\n(Optional) If desired, measure the elastic modulus of the sample, as described previously 4,17,18.",
    "Conduct creep compliance experiments.\n\t\nConstruct an applied force function in the software's function editor. The force function consists of a 0.1 sec ramp to a set point of 5 nN and hold it for 20 sec, followed by a 1 sec ramp down to an applied force of 0 nN.\n\t\t\nOn the Indentation Master Panel, under the indentation method, select \"Load\" for Indenter Mode; \"N\" for units; and \"Function editor\" for Indenter Function.\nIn the function editor, on the Segment Parms Panel, create an applied force function segment that starts at 0 nN, ends at 5 nN, with a time of 0.1 sec. Click \"Insert -->\".\nFor the next segment, set start to 5 nN, end to 5 nN, and time to 20 sec. Click \"Insert -->.\"\nFor the final segment, set start to 5 nN, end to 0 nN, and time to 1 sec. Click \"Draw\" and close the Function Editor window.\nOn the Force Tab of the Master Panel, check \"indenter ramp after trigger\" and set the applied force function to trigger after reaching a trigger point of 0.1 V.\nClick \"Single Force\" on the bottom of the Force Tab of the Master Panel, which will trigger the constructed-applied force function for creep compliance.\nAfter the single force indentation is finished, raise the AFM head so that it is out of contact with the sample and then re-engage the head and re-zero free deflection.\nReposition the sample stage to locate a new area of interest, and lower the AFM head to make contact. NOTE: The AFM head must be retracted from sample surface when the sample stage is moved. Failure to do so can result in damage to the delicate AFM cantilever.\nRepeat steps 3.4.3-3.4.5 until desired amount of data has been collected.\nConduct force relaxation experiments.",
    "Construct an applied indentation function in the software's function editor. The indentation function consists of a 0.1 sec ramp to a set point of 3 μm and hold it for 20 sec, followed by a 1 sec ramp down to an indentation depth of 0 µm.\n\t\t\nOn the Indentation Master Panel, under the indentation method, select \"Indentation\" for Indenter Mode; \"m\" for units; and \"Function editor\" for Indenter Function.\nIn the function editor, on the Segment Parms Panel, create an applied force function segment that starts at 0 µm, ends at 3 µm, with a time of 0.1 sec. Click \"Insert -->\".\nFor the next segment, set start to 3 µm, end to 3 µm, and time to 20 sec. Click \"Insert -->.\"\nFor the final segment, set start to 3 µm, end to 0 µm, and time to 1 sec. Click \"Draw\" and close the Function Editor window.\nOn the Force Tab of the Master Panel, check \"indenter ramp after trigger\" and set the applied force function to trigger after reaching a trigger point of 0.1 V.\nClick \"Single Force\" on the bottom of the Force Tab of the Master Panel, which will trigger the constructed-applied indentation function for force relaxation.\nAfter the single force indentation is finished, raise the AFM head so that it is out of contact with the sample and then re-engage the head and re-zero deflection.\nReposition the stage to locate a new area of interest, and lower the head to make contact.\nRepeat steps 5.3-5.5 until desired amount of data has been collected.\nConclude experiments and clean-up.\n\t\nAfter concluding experiments, raise the AFM head and remove it from the sample.\nUse a lab tissue to carefully remove excess liquid without touching the cantilever.",
    "Carefully clean the AFM cantilever holder using a small amount of ethanol. Do not expose the delicate electronics on the cantilever holder to ethanol. Remove the AFM cantilever and place in a storage container.\nDispose of the brain tissue sample by following appropriate biosafety protocols.\nUsing MATLAB, calculate creep compliance and force relaxation moduli using indenter geometry, according to the solution derived by Lee and Radok, 1960 19.\n\t\nCalculate force F and indentation depth imgsrc://cloudfront.jove.com/files/ftp_upload/54201/54201eq1.jpg from data on the cantilever position z, deflection d, and spring constant, kc\nimgsrc://cloudfront.jove.com/files/ftp_upload/54201/54201eq2.jpg and imgsrc://cloudfront.jove.com/files/ftp_upload/54201/54201eq3.jpg. \nLocate the contact point along the indentation curve using the algorithm described in Lin et al. 20.\nDefine a window of interest for data analysis. The window of interest is the region where either force (for creep compliance) or indentation depth (for force relaxation) is maintained at a setpoint value (i.e., Region 3 as shown in Figure 1C,D).\nFor creep compliance experiments, calculate the experimental creep compliance modulus, Jc(t), in response to a step load imgsrc://cloudfront.jove.com/files/ftp_upload/54201/54201eq4.jpg:\nimgsrc://cloudfront.jove.com/files/ftp_upload/54201/54201eq5.jpg,\n\t\twhere H(t) is the Heavyside step function and R is the radius of the spherical probe.\nFor force relaxation experiments, calculate the experimental force relaxation modulus, GR(t), in response to a step indentation depth imgsrc://cloudfront.jove.com/files/ftp_upload/54201/54201eq6.jpg:\nimgsrc://cloudfront.jove.com/files/ftp_upload/54201/54201eq7.jpg.\n4. Impact Indentation\nCalibrate the instrumented nanoindenter and adjust default settings to enable dynamic impact experiments on hydrated brain tissues according to the manufacturer's instructions.\n\t\nMount a spherical probe by sliding it onto the pendulum using tweezers.\nGlue a fused quartz sample onto the sample post, which is screwed into the translational stage.\nGo to the Calibration menu and select \"Liquid Cell.\" Follow the software's instructions to make contact with the fused quartz sample.",
    "Select \"Normal\" for the Indenter Type and use the default value of 0.05 mN for the Indenter Load. Click \"Continue\" to perform the calibration for the normal indenter configuration.\nMove the sample stage back by at least 5 mm. Mount the lever arm, which allows the probe to be lowered into the liquid cell, and repeat the liquid cell calibration in the new configuration by selecting \"Liquid Cell\" for the Indenter Type. Click \"Continue\" to obtain the Liquid Cell Calibration Factor.\nActivate the Liquid Cell software option by going to the Experiment menu and selecting \"Special Options.\" Use the latest calibration value.\nIncrease the capacitor plate spacing as this will lead to a greater maximum measurable depth, which is necessary when testing highly compliant materials.\n\t\t\nUnder the System menu, select \"Non Protected Settings\" and \"Machine Parameters\" to change the pendulum test load rate, zero load rate, and standby ramp offset to 0.5 mN/sec, 0.1 mN/sec, and 3 V, respectively.\nWith a wrench, turn the three nuts that control the capacitor plate spacing clockwise in small increments.\nAfter each complete clockwise turn, select \"Bridge Box Adjustment\" under the Maintenance menu and obtain a good pendulum test, which will require moving the counter-balance weight away from the pendulum.\nRepeat steps 4.1.7.2-4.1.7.3 until the approximate depth calibration reads a value of 70,000 nm/V or higher.\nPosition a new limit stop at the bottom of the pendulum that can be switched on and off via a power supply. Retract the original limit stop sitting behind the pendulum to remove a potential obstruction of the pendulum motion and allow for higher impact velocities as well as higher penetration depths into compliant samples.\nAllow the cabinet to reach thermal equilibrium (takes approximately 1 hr).",
    "While the cabinet equilibrates, go back to the System menu and select \"Non Protected Settings\" and \"Machine Parameters.\" Set the depth calibration (dcal) contact velocity to 1 µm/sec, the primary indentation contact velocity to 3 µm/sec, and the ultra low load contact velocity to 1 µm/sec.\nUnder the Calibration menu, perform a standard depth calibration in this new configuration.\nTurn on the power supply for the solenoid and set it to 10 V. Go to the Experiment menu and select \"Impact\" and \"Adjust Impulse Displacement.\" Follow the software instructions (automatic prompts) to calibrate the swing distance of the pendulum.\nMount the mouse brain tissue in the liquid cell.\n\t\nAfter harvesting the whole brain from step 1.5, store it immediately in CO2-independent nutrient medium for adult neural tissue media on ice.\nWhen the impact indentation setup is fully complete, carefully transfer the brain into a petri dish along with CO2-independent medium. Slice the brain into 6 mm thick sections with flat surfaces on either side.\nAdhere the sliced tissue to the aluminum sample post with a thin layer of cyanoacrylate adhesive.\nSlide the liquid cell over the second O-ring on the sample post, and fill the liquid cell with 5 ml of CO2-independent medium to fully immerse the tissue. This sample post is then carefully mounted onto the translational stage inside the instrumented nanoindenter.\nMeasure the impact response of the brain tissue.\n\t\nIf necessary, remove the spherical probe and replace it with the probe of interest without removing the lever arm.\nUnder the System menu, select \"Non Protected Settings\" and \"Machine Parameters.\" Change the primary impact contact velocity to 5 µm/sec.",
    "With the sample bath low (-z direction) and far away from the pendulum (+x direction), move in the -x direction until the tip on the lever arm is properly located above the bath. Move in the +z direction until the tip is fully submerged in the bath and in front of the sample.\nUsing the sample stage control window, make contact carefully and then back the stage away from the sample surface by approximately 30 µm.\nUnder the Experiment menu, click \"Impact\" to set up an impact experiment. Choose a specific impulse load that will relate directly to the resulting impact velocity based on the swing distance calibration. Run the scheduled experiment.\nWhen the pendulum swings back and the sample surface continues to move to the measurement plane, turn the bottom limit stop switch off.\nObserve as the pendulum swings forward to impact the sample. The displacement of the probe as a function of time will be recorded by the software.\nWhen the xyz stage window appears, turn the limit stop switch back on.\nRepeat steps 3.4-3.8 to test as many different loads and locations as needed.\nAnalyze the acquired displacement vs. time response of the pendulum using customized MATLAB scripts to determine the maximum penetration depth xmax, energy dissipation capacity K, and dissipation quality factor Q.11\nGo to the Analysis menu and export the data in a text file.\nTake the time derivative of the displacement profile to obtain velocity as a function of time. Set zero displacement as the contact point xo1.",
    "NOTE: Impact velocity vin is the maximum velocity immediately prior to contact. xmax corresponds to the deformation at which the probe velocity first decreases to zero. xo2, which is equivalent to xr, is the position required to reinitiate contact with the deformed sample in the next cycle. Rebound velocity vout is the velocity at displacement xr.\nDefine K (unitless) as the energy dissipated by the sample normalized by the sum of the recovered and dissipated sample energies during the first impact cycle. Calculate K based on the intrinsic properties of the pendulum 21 (such as rotational stiffness and damping coefficient), xo1, xmax, xr, vin, and vout.\n\t\tNOTE: For more information, one may consult the work of Kalcioglu et al., 2011. \nSince displacement can be described as a damped harmonic oscillatory motion, fit an exponential decay function to the maxima of the displacement vs. time curve.\nCalculate Q (unitless) as π multiplied by the number of cycles required for the oscillation amplitude to decrease by a factor of e. A higher Q value means a lower energy dissipation rate.\n5. Rheology\nSet-up and calibrate the rheometer as per the manufacturer's instructions.\n\t\nInitialize the rheometer by opening the device/control panel. On the control panel tab, click \"initialize.\"\nMount the 25 mm-diameter measurement plate (PP25) and the thermal system.\n(Optional) To reduce slip between rheometer plates and the tissue, cut out adhesive sandpaper slices that match the shape of the top rheometer plate and adhere the sandpaper to the top and bottom plate.\nMake contact between the top and bottom plate by clicking \"set zero gap\" on the control panel.\nZero the normal force transducer by clicking \"reset normal force.\"",
    "Conduct an inertia test by opening the service tab on the control panel, clicking \"measurement system,\" and then clicking \"inertia test\". Record the old and new inertia. Verify that the inertia is within the allowable limit for the probe, as listed by the manufacturer.\nLoad sample into rheometer.\n\t\nAfter harvesting the tissue and slicing a coronal segment of the pig brain to ~5 mm thickness, store it on ice in CO2-independent medium.\nPlace the brain between the two plates. Remove large water droplets from the top and bottom surface of the sample to prevent slippage, but do not dry out the sample.\nSlowly lower the measurement plate until the plate is in full contact with the top surface of the tissue and the measured normal force is consistent at 0.01 mN after a 5-10 min relaxation period.\n\t\t\nIn the control panel, enter successively lower heights in the measurement position box and click \"measurement position\" to slowly lower the measurement plate.\nWhen within a millimeter of contact with the tissue, lower the measurement plate in 0.1 mm increments until the plate is fully in contact with the top surface of the tissue. Ensure that the measured-normal force is consistently at 0.01 mN after a 5-10 min relaxation period.\nRecord the initial measured normal force. Repeated measurements should be taken at the same compressive stresses/strains.\nTrim the sample with a plastic blade if the sample exceeds the diameter of the plate. Pipette a small volume (~1-2 ml) of media on the edges of the sample to hydrate the tissue.\n(Optional) Lower the thermal hood. On the control panel, set the temperature to 37 °C and click \"set\".",
    "Perform an amplitude sweep to establish the linear viscoelastic range of the material (i.e., the shear strains at which G' and G'' are constant) at frequencies of interest (e.g., 1 rad/sec).\n\t\nSelect \"file/new\". Under the gel tab select \"Amplitude sweep: LVE-range.\" Select window and click \"Measurement 1: Amplitude sweep.\" Double click on the oscillation box. Enter the initial and final strain (e.g., 0.01 to 105), the frequency (e.g., 1 rad/sec) and the number of points per decade (e.g., 6 points/dec). Select \"ok\" and click start.\"\nRepeat this procedure for several slices with repeated trials to ensure consistency of the linear elastic range. The axial compression of the sample should remain constant between samples.\nConduct a frequency sweep of the tissue at a strain in the linear viscoelastic range of the tissue (e.g., 1% strain) 22, and at a frequency range of interest (e.g., 0.1-100 rad/sec).\n\t\nClick \"file/new\" and under the gel tab select \"Frequency sweep.\" Click window/Measurement 1: Frequency sweep. Double click on the oscillation box. Enter the frequency range (e.g., 0.1 to 100 rad/sec), the strain (e.g., 1% strain) and the number of points per decade (e.g., 6 points/dec). Select \"ok\" and click \"start\" to initiate the frequency sweep.\nRepeat frequency sweep (step 5.4) in duplicates or triplicates.\nReview the data that are automatically calculated and exported by the rheometer: G' and G\" as a function of frequency (frequency sweep) or shear strain (amplitude sweep). NOTE: G' and G'' are calculated from the sample's (maximum) reactional torque amplitude T'0, and rotational displacement angle (or deflection angle) imgsrc://cloudfront.jove.com/files/ftp_upload/54201/54201eq8.jpg, and phase lag imgsrc://cloudfront.jove.com/files/ftp_upload/54201/54201eq9.jpg, of the sample's response to the applied oscillatory strain (Figure 3):\nimgsrc://cloudfront.jove.com/files/ftp_upload/54201/54201eq10.jpg\nimgsrc://cloudfront.jove.com/files/ftp_upload/54201/54201eq11.jpg\n\twhere R and h are the radius and height of the sample.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}