{
  "id": 17238,
  "origin_website": "Jove",
  "title": "A Heterotopic Mouse Model for Studying Laryngeal Transplantation",
  "procedures": [
    "This research was performed in compliance with the Mayo Clinic Institutional Animal Care and Use Committee (IACUC). BalbC mice (10-12 weeks old) were used as donors and C57/BL6 mice (10-12 weeks old) were used as recipients because their major histocompatibility complexes, H-2Db and H-2Kb, respectively, are immunologically incompatible, and therefore the immune response to the graft can be further studied. All instruments used during surgery were sterilized (see Supplemental Figure S1 and Supplemental Figure S2), and the surgical field was kept sterile throughout the protocol per IACUC instructions.\n1. Donor surgery and graft procurement\nInject the donor with extended-release buprenorphine (3.25 mg/kg body weight subcutaneously) 30 min before starting the procedure. Place the mouse in the rodent anesthesia box for anesthesia induction at 3% isoflurane delivered with 1 L/min O2 flow. After the animal is fully anesthetized, transfer the mouse to the shaving area and administer 1.5% isoflurane with 1 L/min O2 flow for maintenance of anesthesia. Confirm the depth of anesthesia with a toe pinch.\nShave the chest and neck of the mouse up to the jawline and apply depilatory cream. After 30 s, wipe the cream off with a sterile gauze pad wetted with water and transfer the mouse to the surgical area.\nApply eye lubricant to the mouse's eyes. Place the mouse on a draped supplemental heating pad to ensure proper body temperature.\nImmobilize the mouse, prep the surgical area thrice with povidone iodine and alcohol, and then drape the mouse.\n\tNOTE: Check the depth of anesthesia by a toe pinch and maintain anesthesia at 1.5% isoflurane and 1 L/min O2 flow via a face mask throughout the procedure.",
    "Make a small horizontal incision just superior to the suprasternal notch. Using fine scissors, elevate the skin bilaterally through that incision up to the mandible. Excise a trapezoid-shaped skin segment resulting in exposure of the bilateral salivary glands, sternomastoid muscles, digastric muscles, and superior aspect of the sternum (Figure 2A).\nExcise the bilateral salivary glands using cautery at the superior part where a small vein traveling through the gland is visualized (Figure 2A).\n\tNOTE: If care is not taken to cauterize the vessel before removing the gland, significant bleeding can be encountered at this step.\nGently retract the lymphoid and adipose tissues laterally to expose the sternomastoid and strap muscles. Dissect the bilateral sternomastoid muscles from the surrounding tissues and retract them laterally using retractors.\n\tNOTE: This maneuver will fully expose the LTE complex with strap muscles and provide a comfortable working space for dissection of the carotid arteries (Figure 2B).\nMake a midline incision between the strap muscles and bilaterally excise them, taking care not to damage the underlying thyroid gland and leaving it on the LTE complex.\n\tNOTE: After this step, the bilateral carotid arteries should be visible (Figure 2C).\nCircumferentially dissect the common carotid arteries to the level of the clavicle inferiorly and to the level of the carotid bifurcation superiorly. Dissect the vagus nerve and the internal jugular vein from the carotid arteries. Do not include them in the procured graft.\n\tNOTE: The superior thyroid artery can be seen just superior to the bifurcation traveling medially. Leave the thin fascia surrounding this vessel intact and do not attempt to dissect it circumferentially. This vessel supplies the blood flow to the LTE complex and will serve as the pedicle after transplantation. Preservation of this vessel is of utmost importance.",
    "Dissect the internal and external carotid arteries far enough superiorly to be able to ligate and divide. If there is difficulty with visualization of the vessels, use a separate retractor to retract the digastric muscles laterally.\n\tNOTE: Avoid dissecting the external carotid artery closer to the bifurcation to prevent any damage to the superior thyroid artery. At this step, the occipital artery, which branches from the external carotid and follows parallel to the internal carotid artery, can be encountered and should not be confused with the internal carotid artery, which is larger and found deeper (Figure 2D).\nUsing 8-0 nylon sutures, ligate the internal carotid arteries 2 to 3 mm superior to the carotid bifurcation. Ligate the external carotid arteries at least 3 mm superior to the branching point of the superior thyroid artery.\n\tNOTE: After these ligations, the LTE complex will be pedicled via the superior thyroid arteries to the bilateral carotid arteries.\nLigate the common carotid arteries at the level of the sternum and cut all the ligated vessels bilaterally. Keep the vascular pedicles on top of the LTE complex to avoid accidental damage during further dissection. To prevent any gas leakage or inadvertent loss of anesthesia, make sure the animal has expired before making any airway cuts.\nDivide the infrahyoid muscles at the level of the hyoid. Create an anterior pharyngotomy just inferior to the hyoid. Carry the incision down to the prevertebral fascia to free the LTE complex superiorly.\nTransect the trachea below the fifth tracheal ring and carry the incision through the esophagus down to the prevertebral fascia to free the LTE complex inferiorly. Free the trachea and esophagus from the underlying prevertebral fascia from an inferior to superior direction.",
    "NOTE: Keep the vascular pedicles on top of the LTE complex to avoid accidental damage during further dissection.\nCreate an anterior pharyngotomy just inferior to the hyoid. Carry the incision down to the prevertebral fascia to free the LTE complex superiorly. Divide any remaining lymphoid or connective tissue attachments between the LTE complex and the surrounding tissue. Remove the graft.\n\tNOTE: The graft contains the donor larynx, trachea, thyroid glands, parathyroid glands, esophagus, and laryngeal muscles as a composite unit (Figure 2E).\n2. Graft preparation\nPlace the procured graft in a sterile Petri dish and wash it with normal saline to get rid of any blood clots. Using micro forceps, gently milk the blood and clots out of the bilateral carotid arteries. Dilate the bilateral carotid arteries using 1 mm microdilators.\nUsing a 30 G blunt-tipped needle, inject approximately 2 mL of heparinized saline in each carotid artery to flush the graft.\n\tNOTE: Blood and saline can be seen flushing out of the contralateral carotid artery and small free vessel ends, which confirms intact superior thyroid arteries.\nExcise the adventitia away from the arterial ends so they have clean edges for anastomosis.\n\t​NOTE: The graft can be left in heparinized saline and a short break can be taken for up to 3 h before transplanting it into the recipient9.\n3. Recipient surgery and anastomosis of the vessels\nPrepare the recipient mouse in the same manner as described for the donor following the anesthesia induction, shaving, and surgical preparation steps. Inject the recipient mouse with extended-release analgesic subcutaneously 30 min prior to the start of surgery.\nUsing a scalpel, make a midline neck incision extending from the jawline superiorly to the sternum inferiorly. Elevate the skin on the left side and retract it laterally.",
    "Excise the left salivary gland, cauterizing the superior vessels as previously described. Excise the adipose and lymphoid tissue by dividing any visible vessels with low-temperature cautery, taking care not to damage the underlying external jugular vein (Figure 3A).\nDissect the external jugular vein circumferentially. Use at least 5 mm of clear length of the vessel for anastomosis. Use low-temperature cautery or ligate and divide any relatively large veins branching from the jugular vein.\nDissect the sternomastoid muscle and retract it laterally. Keep the dissected vein protected behind the muscle to avoid direct contact with the retractor.\nExcise the left strap muscles to gain access to the recipient carotid artery. Circumferentially dissect the common carotid artery from the clavicle inferiorly up to the carotid bifurcation superiorly (Figure 3B).\nPass the background material under the external jugular vein and apply the double approximating V3 vessel clamps.\nPlace a 10-0 nylon suture through the anterior wall of the external jugular vein at the location of the desired venotomy and use this suture to pull anteriorly and tent the vessel.\nCut to the suture with microscissors just deep enough to create the proper size single-slit venotomy and ensure the cut is completely through the venous wall.\nUsing a 30 G blunt-tipped needle, flush the inside of the vein with heparinized saline.\nPlace the donor LTE complex between the recipient left carotid artery and the left external jugular vein. Align the free end of the donor left carotid artery toward the recipient left external jugular vein and bevel the ends of the vessels with sharp scissors.\nUsing four 10-0 nylon interrupted sutures, anastomose the donor left carotid artery and recipient left external jugular vein in an end-to-side fashion.",
    "Slide the background material under the recipient common carotid artery and place the double approximating A3 vessel clamps on the recipient common carotid artery. Create an arteriotomy in the same fashion as the venotomy.\n\tNOTE: Make sure the arteriotomy is the same size as the lumen of the donor carotid artery. If it is too large, profuse bleeding will occur after the clamps are removed. If it is too small, blood flow to the graft will be obstructed.\nAnastomose the donor right carotid artery to the recipient left carotid artery in an end-to-side fashion using six 10-0 nylon interrupted sutures.\n\tNOTE: Correct microvascular technique should be respected throughout the vessel anastomosis. Passing through the backwall results in considerably constricted blood flow, endangering survival of the graft. Due to the small size of the vessels, trying to redo the sutures is very difficult.\nRemove the clamps on the venous side. If bleeding is encountered, apply gentle pressure with cotton tips.\nRemove the clamps on the artery and immediately apply gentle pressure with cotton tips.\n\tNOTE: Some bleeding is expected at this step, which usually stops after 1 min with gentle pressure.\nCheck the integrity of blood flow in the artery and the vein.\n\tNOTE: With intact arterial flow, pulsation of the donor carotid artery is usually seen, and the donor thyroid gland changes from its flushed transparent color back to its original reddish color. Red coloration of the small vessels on the LTE complex can also be observed.\nIrrigate the surgical field with heparinized saline and close the skin incision with a 5-0 monofilament suture in a running fashion. Apply antibiotic ointment or a skin adhesive on the incision.\nInject 1 mL of warm saline subcutaneously to account for fluid loss during the surgery.",
    "Stop the anesthesia and transfer the mouse to a recovery cage. Observe the mouse on a heating pad until it is fully awake to avoid hypothermia.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}