{
  "id": 10042,
  "origin_website": "Jove",
  "title": "Rapid Development of Cell State Identification Circuits with Poly-Transfection",
  "procedures": [
    "NOTE: Table 1 and Table 2 serve as significant references for this protocol. Table 1 shows reagent scaling for reactions, and Table 2 shows DNA ratio arithmetic for an example poly-transfection described in the protocol (upper half) and for a possible follow-up experiment (lower half).\n1. Preparing cells for transfection\nEnsure that the culture of human embryonic kidney (HEK293) cells is 60%-80% confluent before initiating the protocol. To do this, seed 1 x 106 cells in a 100 mm x 15 mm tissue culture Petri dish 2 days prior, and incubate at 37 °C with 5% CO2.\n\tNOTE: Although our protocol focuses on HEK293 cells, other cell types may be substituted.\nPrepare the media and cells for transfections as described below.\n\t\nPre-warm at least 20 mL of a solution of Dulbecco's modified eagle medium (DMEM) with 10% fetal bovine serum (FBS) and 1% non-essential amino acids (NEAA; see Table of Materials) to 37 °C. Pre-warm at least 2.4 mL of Trypsin and 2.4 mL of phosphate-buffered saline (PBS) to 37 °C as well. Pre-warm reduced serum medium to ~16 °C.\n\t\tNOTE: All tissue culture work should be performed with care in a biosafety cabinet.\nResuspend the cells in the DMEM solution as described below.\n\t\nAspirate and dispose of the current media. Dispense 2 mL of PBS onto the HEK293 cell culture to wash the cells. Aspirate and dispose of the PBS.\nDispense 2 mL of Trypsin onto the HEK293 cell culture. Place the Petri dish in an incubator at 37 °C for 3 min or until the cells no longer adhere to the dish. Return the dish to the biosafety cabinet and dilute the cell solution by dispensing 8 mL of DMEM solution into the plate.",
    "Mix the solution by gently pipetting up and down several times. Aspirate all the media and place it in a 15 mL conical tube.\nCentrifuge the cells at 300 x g for 3 min to pellet them. Aspirate the media (taking care not to aspirate the cells) and discard it. Resuspend the cells in 5 mL of DMEM solution, mixing by gently pipetting up and down.\nEstimate the current cell concentration using an automated cell counter (listed in the Table of Materials). Seed six wells (in this example) in a 24-well plate with 1 x 105 cells (for a seeding density of 50,000 cells/cm2).\nAdd the DMEM solution up to 500 µL (add DMEM solution to the wells first), and then label one well per treatment as the following: no color control, mKO2 control, TagBFP control, NeonGreen control, all color control, and poly-transfection 1. TagBFP, mKO2, and NeonGreen control wells are single color controls for all fluorescent proteins included in the poly-transfection.\n2. Performing transfection\nPrepare tubes for each DNA aggregate. Set aside 1.5 mL microcentrifuge tubes and label the tubes as: no color control, mKO2 control, TagBFP control, NeonGreen control, all color control, poly-transfection mix 1, and poly-transfection mix 2.\n\t\nAdd 36 µL of reduced serum medium to the no color control, mKO2 control, TagBFP control, NeonGreen control, and all color control tubes. Add 18 µL of reduced serum medium to each of the poly-transfection mix 1 and poly-transfection mix 2 tubes.\n\t\tNOTE: The plasmid concentrations are assumed to be 150 ng/µL.\nAdd 600 ng of filler plasmid to the no color control tube. Add 300 ng of mKO2 and 300 ng of filler plasmid to the mKO2 color control tube. Add 300 ng of TagBFP and 300 ng of filler plasmid to the TagBFP color control tube.",
    "Add 300 ng of constitutive NeonGreen plasmid and 300 ng of filler plasmid to the NeonGreen color control tube. Add 100 ng each of mKO2, TagBFP, and constitutive NeonGreen, as well as 300 ng of filler plasmid, to the all color control tube.\nAdd 150 ng of mKO2 to the poly-transfection mix 1 tube. Add 75 ng of reporter NeonGreen plasmid and 75 ng of filler plasmid to the poly-transfection mix 1 tube.\nAdd 150 ng of TagBFP to the poly-transfection mix 2 tube. Add 75 ng of L7ae plasmid and 75 ng of filler plasmid to the poly-transfection mix 2 tube.\nCreate the transfection master mix in a 1.5 mL microcentrifuge tube by combining 216 µL of reduced serum medium with 9.48 µL of transfection reagent (see Table 1 for reagent ratios and reaction scaling). Mix well by pipetting up and down, and set aside.\nAdd 1.58 µL of enhancer reagent to each of the no color control, single color control, and all color control tubes. Add 79 µL of enhancer reagent to each of the poly-transfection mix tubes. Mix each tube individually by pipetting vigorously.\nAdd the transfection master mix to each tube containing DNA.\n\t\nAdd 37.58 µL of transfection master mix to each of the no color control, single color control, and all color control tubes. Mix each tube individually by pipetting vigorously.\nAdd 18.79 µL of transfection master mix to each of the poly-transfection mix tubes. Mix each tube individually by pipetting vigorously.\nDispense the transfection mixes into the wells.\n\t\nPipette 65.97 µL of each transfection mix for the no color, single color, and all color controls into the corresponding wells.",
    "Pipette 32.98 µL of the poly-transfection mix 1 into the poly-transfection well and swirl the plate quickly but gently in a tight figure-eight pattern along a flat surface to distribute the complexes effectively. Then, pipette 32.98 µL of the poly-transfection mix 2 into the same poly-transfection well and swirl the plate in the same fashion.\nPlace the plate in an incubator at 37 °C, with 5% CO2 and without shaking, for a period of 48 h.\n\tNOTE: To increase cell viability, the cell media can be replaced every 6 h following transfection (though this is not always necessary, and with HEK293 cells and its derivatives, one must be careful not to detach the cells from the plate when changing the media).\ntable:\n﻿0,1,2,3,4,5,6\nReagent,Amount,Amount,Amount,Scaling,Scaling,Scaling\nReduced serum medium for DNA mixture,\"36 μL per control tube, 18 μL per poly-transfection tube\",\"36 μL per control tube, 18 μL per poly-transfection tube\",\"36 μL per control tube, 18 μL per poly-transfection tube\",\"0.05 μL Reduced serum medium/ng DNA per tube, with 10-20% extra volume to account for pipetting\",\"0.05 μL Reduced serum medium/ng DNA per tube, with 10-20% extra volume to account for pipetting\",\"0.05 μL Reduced serum medium/ng DNA per tube, with 10-20% extra volume to account for pipetting\"\nDNA,300-600 ng per tube,300-600 ng per tube,300-600 ng per tube,,,\nP3000,\"1.58 μL per control tube, 0.79 μL per poly-transfection tube\",\"1.58 μL per control tube, 0.79 μL per poly-transfection tube\",\"1.58 μL per control tube, 0.79 μL per poly-transfection tube\",\"0.0022 μL P3000/ng DNA per tube, with 10-20% extra\",\"0.0022 μL P3000/ng DNA per tube, with 10-20% extra\",\"0.0022 μL P3000/ng DNA per tube, with 10-20% extra\"",
    "Reduced serum medium for Lipo master mix,\"36 μL per control tube, 18 μL per poly-transfection tube\",\"36 μL per control tube, 18 μL per poly-transfection tube\",\"36 μL per control tube, 18 μL per poly-transfection tube\",\"0.05 μL reduced serum medium/ng total DNA, with 10-20% extra volume to account for pipetting\",\"0.05 μL reduced serum medium/ng total DNA, with 10-20% extra volume to account for pipetting\",\"0.05 μL reduced serum medium/ng total DNA, with 10-20% extra volume to account for pipetting\"\nTransfection and enhancer reagent,\"1.58 μL per control tube, 0.79 μL per poly-transfection tube\",\"1.58 μL per control tube, 0.79 μL per poly-transfection tube\",\"1.58 μL per control tube, 0.79 μL per poly-transfection tube\",\"0.0022 μL Lipofectamine 3000/ng DNA, with 10-20% extra\",\"0.0022 μL Lipofectamine 3000/ng DNA, with 10-20% extra\",\"0.0022 μL Lipofectamine 3000/ng DNA, with 10-20% extra\"\nTable 1: Reagent scaling for transfections. The table indicates the correct ratio of reagent to include for the DNA quantity included in a single well. This can be used to scale reactions effectively and form master mixes. Quantities of reagent have been scaled to include a 20% excess.\n3. Preparing cells for flow cytometry\nPre-warm at least 4.2 mL of the DMEM solution to 37 °C. Pre-warm at least 4.2 mL of Trypsin and 4.2 mL of PBS to 37 °C. Keep fluorescence-activated cell sorting (FACS) buffer solution at 4 °C until ready to use.\nResuspend the cells in the FACS buffer solution (PBS supplemented with 1% BSA, 5 mM ethylenediaminetetraacetic acid [EDTA], and 0.1% sodium azide [NaN3], to reduce clumping; see Table of Materials) as described below.\n\t\nAspirate and dispose of the current media in each well. Dispense 5 mL of PBS into each well to wash the cells. Aspirate and dispose of the PBS.",
    "Dispense 5 mL of Trypsin into each well. Place the plate in an incubator at 37 °C for 3 min, or until the cells no longer adhere to the dish. Return the plate to the biosafety cabinet and dilute the cell solutions by dispensing 5 mL of DMEM solution into each well.\nFor each well, mix the solution by gently pipetting up and down several times. For each well, aspirate all the media and place it in a 15 mL conical tube.\nCentrifuge the cells at 300 x g for 3 min to pellet them. Aspirate the media, taking care not to aspirate the cells and discard it. In each tube, resuspend the cells in 5 mL of FACS buffer solution, mixing by gently pipetting up and down.\nPass each cell suspension solution through a strainer (to remove clumps) into separate flow cytometry conical tubes. Keep these tubes on ice for no more than 1 h, and perform flow cytometry as soon as possible.\n4. Performing flow cytometry\nNOTE: Operating a flow cytometer requires proper training and knowledge of the necessary tasks. As software and equipment may vary and users should be trained generally, this section refers to specific operations that are useful to perform.\nFirst, examine the cells transfected with the filler plasmid control (no color control) to select for cell characteristics and avoid anomalies (including aggregates, debris, etc.). While there are many combinations of parameters to distinguish cells, use the following three general options as a good way to visualize distinguishing features.\n\t\nLook at the side scatter area (log or linear scale per preference/cell type) versus the forward scatter area (linear scale).\nLook at the side scatter height (log scale) versus the side scatter width (linear scale).",
    "Look at the forward scatter width (linear scale) versus the forward scatter height (linear scale).\nNext, look at the single color controls. Use the all color control to tune the instrument voltages, such that the signals from each fluorescent protein are normalized to equivalent arbitrary units (a.u.) of fluorescence. Next, run the single color controls for each fluorescent protein, which are used to set the compensation matrix, allowing for bleed-through correction.\n\tNOTE: Ideally, the full dynamic range of the fluorescence values should be visible. Further normalization of fluorescent protein signals can be done via conversion to standardized units (e.g., molecules of equivalent fluorescein [MEFLs; see Beal et al.15]). To enable MEFL conversion during analysis, run rainbow calibration beads. Such calibration is also useful for reducing instrument-to-instrument and day-to-day signal variation16.\nRun the poly-transfection sample tube.\n\tNOTE: Where possible, it is recommended to run 1,000 x 10^ (^ = mixes) cells, as higher-dimensional poly-transfections need to be subdivided into more bins during analysis, and each bin needs enough cells (ideally >10) to make statistically significant comparisons.\n5. Performing post-experiment analysis\nInitially, use data from the controls (and, if applicable, the beads) to ensure accurate results. Use one of the available software tools to perform live cell gating (using gates outlined above), compensation, and autofluorescence correction.\n\tNOTE: We typically use either custom MATLAB code (e.g., https://github.com/jonesr18/MATLAB_Flow_Analysis or Cytoflow17), which has both a graphical user interface and a python library suitable for the pre-processing phase and for poly-transfection analysis.\ntable:\n﻿0,1,2,3,4,5,6\nMethod,Complex,ng Fluorescent Marker,ng L7ae (fraction),ng Reporter (fraction),ng Filler DNA (fraction),Total (ng)\nPoly-transfection 1,,,,,,600\n→,1,150,75 (½),,75 (½),300\n→,2,150,,75 (½),75 (½),300\nPoly-transfection 2,,,,,,600\n→,1,150,25 (1/6),,125 (5/6),300\n→,2,150,,125 (5/6),25(1/6),300",
    "Table 2: DNA amounts for poly-transfection demonstrated in the protocol, and an example follow-up experiment with tuned plasmid ratios. The upper half of the table shows the composition of plasmids used in a simple poly-transfection experiment. The lower half shows the composition of an updated experiment that adjusts the plasmid ratios to better subsample a hypothetical concentration space, where the gene expression modulator is at a more optimal 1:5 ratio relative to its reporter, yielding more transfected cells to sample around this ratio.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}