{
  "id": 12225,
  "origin_website": "Jove",
  "title": "Detection of a CDH1 Rare Transcript Variant in Fresh-frozen Gastric Cancer Tissues by Chip-based Digital PCR",
  "procedures": [
    "The protocol follows the guidelines of the IRST Human Research Ethics Committee.\nNOTE: This procedure is specifically designed for the detection of a low number of cDNA molecules in human fresh-frozen tissues. The tissue sections have been cut on dry ice, while still frozen, from previously validated patient-derived gastric tumor or normal tissue samples.\n1. RNA Isolation and Purification\nRNA extraction\n\tNote: RNA isolation is performed under the hood using a specific product (see Table of Materials). However, a variety of isolation kits are commercially available.\n\t\nHomogenize 50 - 100 mg of finely cut fresh-frozen tissue sample in a 1.5 mL tube with 1 mL of the RNA isolation reagent and vortex vigorously for 15 s. Incubate the tubes at -80 °C overnight.\nIncubate the tube containing the sample at room temperature for 5 min and mix by vortexing for 15 s.\nKeep the tube on ice, add 200 µL of chloroform, and vortex vigorously for 15 s.\nIncubate the tubes at room temperature for 60 s and centrifuge at 12,000 x g for 15 min at 4 °C.\nTransfer the aqueous phase in a 1.5 mL tube and add 20 µg of glycogen.\n\t\tNOTE: It is important to carefully avoid transferring any of the interphase or organic layer in order to reduce contamination.\nAdd 500 µL of isopropanol, inverting the tube to mix, and incubate on ice for 10 min.\nCentrifuge the tube at 12,000 x g for 15 min at 4 °C to precipitate RNA.\n\t\tNOTE: RNA will be present in a gel-like pellet on the side and bottom of the tube, often invisible after centrifugation.\nRemove the supernatant without disturbing the precipitate and wash it with 1 mL of 75% ethanol by pipetting.",
    "Centrifuge the tube at 7,500 x g for 5 min at 4 °C and remove the supernatant without disturbing the pellet.\nLet the pellet dry until the precipitate becomes transparent and dissolve it in 50 µL of RNase-free water.\nFreeze the samples at -80 °C at least overnight before quantification.\nGenomic DNA elimination and RNA purification\n\tNote: A DNase digestion step, followed by a column-based RNA purification, is recommended for analyses of low-abundance targets in order to digest contaminating DNA.\n\t\nDissolve the lyophilized DNase I (1,500 Kunitz units) in 550 µL of RNase-free water using a syringe, mix gently by inverting the vial, and divide the reconstituted stock solution into aliquots.\nTransfer in a 1.5 mL tube the calculated volume of sample with 15 µg of RNA, 10 µL of DNase Digestion buffer from the kit (listed in Table of Materials), 2.5 µL of DNase I stock solution, and RNase-free water to 100 µL. Incubate at room temperature for 10 min.\nAdd 350 µL of tissue lysis buffer (from the kit, see Table of Materials) and mix by pipetting.\nAdd 250 µL of 100% ethanol and mix by pipetting.\nTransfer the entire volume (700 µL) into a new spin column and centrifuge at 12,000 x g for 15 s.\nTransfer the filter into a new collection tube, add 500 µL of 80% ethanol to the column and centrifuge at 12,000 x g for 2 min.\nOpen the lid of the spin column and centrifuge at 12,000 x g for 5 min with a new collection tube to dry the filter; then transfer the filter to a 1.5 mL tube.\nAdd 14 µL of RNase-free water directly to the filter column and centrifuge at 12,000 x g for 1 min.",
    "Keep the samples on ice and proceed to quantification using 2 µL of the sample on a bench-top spectrophotometer or store the RNA at -80 °C until use.\n2. cDNA Synthesis\nPlace 1,000 ng of RNA, 4 µL of master mix, 1 µL of reverse transcriptase, and RNase-free water to a final volume of 20 µL in a sterile PCR tube. Mix gently and spin down.\nIncubate the reaction mix in a thermal cycler, applying the following conditions: 5 min at 25 °C, 30 min at 42 °C, 5 min at 85 °C.\nCentrifuge the tubes briefly and proceed to dPCR analysis or store at -20 °C until needed.\n3. Digital PCR Reaction Set Up\n dPCR reaction mix and sample preparation\nThaw the master mix and the assay at room temperature for at least 20 min.\nDilute the cDNA samples to a concentration of 300 ng in 6 µL of water.\nGently vortex the master mix and prepare the mix in a sterile tube with 8.7 µL of master mix, 0.87 µL of the CDH1a custom designed assay primer, and 1.83 µL of nuclease-free water for a final volume of 11.4 µL.\n\t\tNOTE: For CDH1a custom designed assay primer details see the Table of Materials.\nTransfer 11.4 µL of the prepared mix to the diluted cDNA sample, mix gently, and briefly centrifuge.\n\t\tNOTE: Volumes include 20% excess to compensate for volume loss from pipetting. Prepare the mix for all samples and a no template control (NTC).\nChip preparation\n\tNote: For optimal results load the chips as soon as possible.\n\t\nPlug in the chip loader and wait until the indicator light turns green.",
    "Remove the cap of the immersion fluid syringe by gently pulling back the plunger 1 - 2 mm and releasing it to facilitate this step, and replace it with a tip.\nTake a new chip and take note of the code written on the lid to associate it with the sample.\nHold the lid carefully by its side, peel away the protective film, and place the lid with the sticky face up in the correct orientation.\nCarefully pick up a chip, taking care not to touch the internal part, and load it onto the chip nest in the correct position by pressing down the lever to open the clamp.\nLoad a new loading blade onto the loader and push it gently to ensure that it is firmly in place.\nTransfer 14.5 µL of the dPCR reaction mix onto the loading blade without making air bubbles or deflecting the blade, after which press the black loading button to distribute the volume on the chip.\nUse the immersion fluid syringe to transfer about 20 drops onto the chip surface taking care not to touch the surface with the tip.\n\t\tNOTE: It is important to cover the entire surface without spilling fluid over the edges.\nRotate the loader arm to make the lid come into contact with the chip and press down for 15 s.\nPress the lid button to release the chip and return the arm to its position.\nHold the assembled chip at a 45° angle and carefully dispense the immersion fluid with the syringe through the fill port, rotate the chip slightly to make sure there are no air bubbles, and remove any excess fluid with a sterile wipe.",
    "Seal the chip case by gently peeling away the label on top of the chip lid and press over the fill port for at least 5 s.\nStore the chip in the dark until ready to load in the thermal cycler.\n\t\tNOTE: Prepared chips should be used within 2 h.\ndPCR reaction\nOpen the lid and install the adapters to both blocks, even when a single block is used.\nPlace the chips on the sample block in the correct position.\n\t\tNOTE: The fill port must be oriented towards the front of the thermal cycler in an elevated position to allow any air bubbles to float to the top without disturbing the window of the chip. Use empty chips to balance the two blocks.\nLay the thermal pad on the sample block to completely cover the chips.\nClose the lid and start the PCR run, applying the following conditions: hold at 96 °C for 10 min; 45 cycles of 60 °C for 2 min and 98 °C for 30 s; hold at 60 °C for 2 min; hold at 4 °C. Turn off the thermal cycler and thaw the chips at room temperature for at least 10 min.\n\t\tNOTE: Chip analysis must be performed within one hour.\nChip analysis\nOpen the lid of the instrument and remove the thermal pads, then remove the chips from the adapters.\n\t\tNOTE: Store the chips in a dark, clean location until analysis.\nClean the chip surface with isopropanol and a sterile wipe.\n\t\tNOTE: Inspect each chip for leaks or potential problems.\nInsert the USB into the detector system to save the data.\nOpen the chip tray of the detector system, load the chip face-up in the correct position and then close the tray.",
    "Wait 30 s for processing, then remove the chip and insert the next one.\nWait for the analysis to be completed for all the processed chips then insert the USB into a computer to transfer the files.\n\t\tNOTE: The total time for analysis is around 2 to 3 min/chip.\n4. Data Analysis and Interpretation\nConnect to the cloud-based software platform required to carry out all the downstream analyses.\nCreate a project and import all data files of the chips of interest.\nEnter the sample name; select the dye and assay used in the \"Define Chips\" tab.\nDetermine if the chip is acceptable by visualizing it in the \"Review Data\" tab, checking how thoroughly the sample was loaded onto the chip and how many data points are evaluable.\n\tNOTE: Reject chips with less than 13,000 evaluable data points.\nMove on to the scatter plot of the selected chip on the right side of the screen; apply a threshold of 6,000 for the fluorescein amidite (FAM) reporter dye signals (Y-axis) to all the chips.\n\tNOTE: The threshold set up may vary on the basis of the assays used.\nRemove any dubious positive signals to prevent false positive results by selecting the relative spot on the scatter plot using the lasso tool and pressing on \"undetermined\". All remaining positive spots indicate the presence of cDNA copies of the rare target analyzed.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}