{
  "id": 9995,
  "origin_website": "Jove",
  "title": "\"Avatar\", a Modified Ex vivo Work Loop Experiments Using In vivo Strain and Activation",
  "procedures": [
    "All animal studies were approved by the Institutional Animal Care and Use Committee at Northern Arizona University. Extensor digitorum longus (EDL) muscles from male and female wild-type mice (strain B6C3Fe a/a-Ttnmdm/J), aged 60-280 days, were used for the present study. The animals were obtained from a commercial source (see Table of Materials), and established in a colony at Northern Arizona University.\n1. Selecting in vivo  strain trajectory and preparing for use during ex vivo  work loop experiments\nNOTE: In this protocol, prior measurements from in vivo dynamic locomotion, provided directly to the authors (Nicolai Konow, UMass Lowell, personal communication), were used in ex vivo experiments. The original data was collected for Wakeling et al.15. Time, length or strain, EMG/activation, and force data are required to replicate the protocol.\nSegment the entire in vivo trial into individual strides using any programming platform (MATLab code provided in Suplementary Coding File 1).\n\t\nPlot the length changes vs. time for the entire in vivo trial. This is used to visualize individual strides (stance to stance) and to assess among-stride variability (Figure 1).\nCalculate strain for the entire trial (Length (L) /Maximum Isometric Force at Optimal Length L0).\nSelect a stride from the entire trial that is representative of all strides, and that begins and ends at similar lengths. This can be done visually by graphing the lengths on top of each other to compare each stride.\nAfter a representative stride is selected, segment out strain, EMG/activation, and force data from the entire trial using any programming platform (see Supplementary Coding File 1 for the codes used in MATLab16).\nIf sampling frequency differs for strain, EMG/activation or force, interpolate the data points so that all are sampled at the same frequency.",
    "NOTE: Researchers can determine the frequency of capture based on the time intervals between each point sampled in the entire trial. If variables are captured at the same frequency, the sampling times will be the same.\nCalculate the frequency of segmented strides.\n\t\nCalculate the frequency by determining the duration of a segmented stride in seconds and dividing 1 (second) by the duration (1/duration = # strides per second).\nManually determine how many data points must be acquired in ex vivo experiments to match the frequency.\nCalculate the time required for two strides. Repeat the strides at least once for estimating within muscle measurement error, which will be required for subsequent statistical analysis.\nDetermine the phase of stimulation relative to strain input using the measured EMG activity to determine the onset and duration of the stimulation for the ex vivo work loops. Any programming platform can be used (see Supplementary Coding File 1 for the code used in this study).\n\t\nView EMG signal over the same x-axis range (time) as strain change (Figure 1). Enlarge the EMG signal to be visible; this can be done by multiplying the EMG signal by an arbitrary number, rescaling the strain and EMG to be on the same scale, and/or adding the EMG signal to the strain.\n\t\tNOTE: Authors rescaled the strain and EMG to be on the same scale using \"rescale\" function in MATLab (see Supplementary Figure 1).\nFind where EMG activity starts and stops, as indicated by a change in intensity of two standard deviations17,18.\n\t\tNOTE: Depending on the animal and muscle, EMG onset might or might not correspond with foot contact (Monica Daley, UC Irvine, personal communication) (see Discussion section).",
    "Calculate the percentage of the strain cycle (e.g., 40%) at which the EMG activation onset occurs and for how long the stimulation will occur (e.g., 222 ms).\n\t\tNOTE: Researchers will need to account for an excitation-contraction coupling (ECC) delay that differs between in vivo movement and ex vivo work loops and may be different for each animal and muscle (e.g., in vivo ECC is 24.5 ms for rat MG, ex vivo ECC is ~5 ms for mouse EDL).\nPrepare representative strain inputs for the work loop controller program. Any program that can capture force output with input for strain and stimulation can be used for the work loop controller program (see Discussion section).\n\t\nTake the selected stride and interpolate to the appropriate number of points necessary to have the step captured at in vivo frequency for two cycles (see step 1.2).\nRescale the stride to start and stop at \"zero strain\" (e.g., L0 or 95% L0) after stretching by a pre-determined length excursion (see step 3.3).\n\"Scale\" selected stride, if necessary, to use as an input for strain changes in mouse EDL (see Discussion section). To scale, select a length excursion to which the mouse EDL can be stretched without damage (e.g., we typically stretch the mouse EDL by 10% L0 regardless of the in vivo species). This may need to change based on preliminary results (see step 3.3).\nimgsrc://cloudfront.jove.com/files/ftp_upload/65610/65610fig01.jpg\nFigure 1: Length over time of in vivo whole trial. Length (mm) plotted against time of rat MG. Strides are demarcated by circles, from shortest length to shortest length, considered single stride. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/65610/65610fig01large.jpg]\n2. Evaluating maximum isometric force of mouse muscle ex vivo\nSet up equipment and surgery.",
    "NOTE: See the Discussion section for an explanation of the equipment needed for the ex vivo work loop.\n\t\nPrepare a tissue-organ bath by inserting the oxytube needle valve into the water-jacket tissue bath (see Table of Materials). Connect the oxytube to a gas cylinder with 95% 02-5% CO2. Allow 20 psi to fill the water-jacket tissue bath.\nPrepare the surgery area by running an additional oxytube from the gas line to a crystallizing dish filled with Krebs-Henseleit solution (step 2.1.3) near the surgery area. This will be used to keep the muscles aerated and hydrated during and after the surgeries.\n\t\tNOTE: Muscles can also be stored in this aerated solution up to 4 h, if more than one muscle is taken out of the mouse at a time.\nPrepare 1 L of Krebs-Henseleit solution containing (in mmol l-1): NaCl (118); KCl (4.75); MgSO4 (1.18); KH2PO4 (1.18); CaCl2 (2.54); and glucose (10.0) at room temperature and pH to 7.4 using HCl and NaOH (see Table of Materials). When handling HCl and NaOH, wear the proper PPE of goggles and gloves.\nFill the bath with Krebs-Henseleit solution at room temperature and pH 7.4. Submerge the muscle and the hook completely in the solution.\nTurn on all equipment; dual-mode muscle lever system, stimulator, and signal interface (DAQ board) (see Table of Materials).\nEDL muscle dissection.\n\t\nDeeply anesthetize the mouse and then perform euthanasia by cervical dislocation. Lay the mouse in either a right or left lateral recumbent position with the top hindlimb stretched and toes touching the dissection board. Remove the fur from the ankle to above the knee joint.",
    "Tent the skin with forceps and cut from the ankle joint to the hip area. Once the muscle has been exposed, cut around the ankle like a \"hem\" of pants. Pull the skin up to expose the leg muscles more clearly.\nLocate the fascia line that separates the tibialis anterior (TA) and gastrocnemius, separate using dissection scissors to expose the knee tendons. Place dissection scissors between the two exposed knee tendons. Scissors will \"catch\" on a pocket just below the exposed knee tendons. Blunt dissect a \"pocket\" while pulling the scissors away from the leg until the scissors reach the ankle to expose the EDL.\nUsing a pre-tied loop knot in size 4-0 silk surgical suture (see Table of Materials), lace one end of the suture under the tendon closest to the knee. Tie a double square knot above the proximal muscle-tendon junction without placing it on the muscle or including the tendon. Cut above the knot. Gently pull the loop tied to the tendon, and the EDL will emerge from the \"pocket\".\nTape the loop to the dissection area to create tension in the EDL. Tie a double square knot using another pre-tied loop knot at the distal muscle-tendon junction without placing it on the muscle or including the tendon. Cut the knot on the side closer to the leg to remove the whole EDL from the mouse. Cut the extra suture away from the double square knots on the proximal and distal sides of the muscle and place the muscle in the aerated bath by the surgery area.\n\t\tNOTE: Ensure to note which side is proximal and/or distal if placing the muscle in an aerated bath.",
    "To place on the servomotor lever rig, attach EDL vertically between suspended platinum electrodes. Attach the distal loop knot to the stationary hook and attach the proximal loop knot to the hook attached to the servomotor arm. Raise the tissue bath to submerge the muscle in the aerated Krebs-Henseleit solution.\n\t\tNOTE: Aeration should not disturb the muscle when it is submerged. If it does, lower the pressure of the gas. Allow muscle to equilibrate for 10 minutes before beginning stimulation.\nMeasure the maximum isometric force of EDL muscle.\n\tNOTE: Refer to Table 1 for protocol on how to measure maximum isometric force using twitch and tetanus. See Supplementary Figure 1 for an illustration of the program used by the authors.\n\t\nStimulate the muscle with a supramaximal twitch to ensure the muscle has not been damaged during surgery (80 V, 1 pps, 1ms; Table 1; see Supplementary Figure 2). If no damage has occurred, use the length knob on the muscle lever system to find a muscle length using twitch stimulation at which active tension is ~1V / 0.1271 N with less than ~0.1V / 0.01271N passive tension.\nRecord the starting length of the muscle from suture knot to suture knot in Volts and millimeters. Input measurements into the calibration portion of the program for starting length (see Supplementary Figure 1).\nFind supramaximal twitch maximum isometric force at optimal length (L0) of EDL (Table 1). No rest period is technically needed, but waiting 1 min between stimulations will stabilize passive tension. Record the length (in Volts) at which the supramaximal twitch is maximum. This is the muscle optimum length (L0) for twitch.",
    "Measure the muscle with calipers at this length. Measure the muscle from suture knot to suture knot. Once L0 has been found, shorten the muscle back to starting length (active tension ~1V / 0.1271 N).\nFind supramaximal tetanus maximum isometric force of EDL (80 V, 180 pps, 500 ms; Table 1). Record the length (in Volts and millimeters) of supramaximal tetanic force at L0 and measure the fibers from suture knot to suture knot again with calipers.\n\t\t​NOTE: Increasing the muscle length in 0.5 V/0.65 mm steps will result in more accurate L0 for both twitch and tetanus.\nFind the submaximal isometric force of EDL (45 V, 110 pps, 500ms; Table 1) at L0 before and after the experiment to ensure fatigue did not occur from the stimulation protocol. A 10% decrease in force is considered a \"fatigued\" muscle.\ntable:\n﻿0,1,2,3,4,5,6,7,8,9,10,11,12\nExperiment,Experiment,Experiment,Simulation Intensity (V),Simulation Intensity (V),Pulse Frequency (pps / Hz),Pulse Frequency (pps / Hz),Stimulation Duration (ms),Stimulation Duration (ms),Comments,Comments,Comments,Comments\n\"1. \"\"Warm-Up\"\"\",\"1. \"\"Warm-Up\"\"\",\"1. \"\"Warm-Up\"\"\",80,80,1,1,1,1,Increase or decrease length by 0.50 V to find passive tension of 1 V,Increase or decrease length by 0.50 V to find passive tension of 1 V,Increase or decrease length by 0.50 V to find passive tension of 1 V,Increase or decrease length by 0.50 V to find passive tension of 1 V\n2. Optimal muscle length twitch (L0),2. Optimal muscle length twitch (L0),2. Optimal muscle length twitch (L0),80,80,1,1,1,1,Increase or decrease length by 0.50 V to find passive tension of ~1 V,Increase or decrease length by 0.50 V to find passive tension of ~1 V,Increase or decrease length by 0.50 V to find passive tension of ~1 V,Increase or decrease length by 0.50 V to find passive tension of ~1 V",
    "3. Optimal muscle length tetanus (L0),3. Optimal muscle length tetanus (L0),3. Optimal muscle length tetanus (L0),80,80,180,180,500,500,Rest 3 min between changing length by 0.50 V,Rest 3 min between changing length by 0.50 V,Rest 3 min between changing length by 0.50 V,Rest 3 min between changing length by 0.50 V\n4. Pre-experiment submaximal L0,4. Pre-experiment submaximal L0,4. Pre-experiment submaximal L0,45,45,110,110,500,500,At length of L0,At length of L0,At length of L0,At length of L0\n6. Avatar experiments,6. Avatar experiments,6. Avatar experiments,45,45,110,110,,,Cyclically use representative length changes for mouse EDL,Cyclically use representative length changes for mouse EDL,Cyclically use representative length changes for mouse EDL,Cyclically use representative length changes for mouse EDL\n7. Post-experiment submaximal L0,7. Post-experiment submaximal L0,7. Post-experiment submaximal L0,45,45,110,110,500,500,Return to L0 after experiment and measure L0,Return to L0 after experiment and measure L0,Return to L0 after experiment and measure L0,Return to L0 after experiment and measure L0\nTable 1: Stimulation protocol. Stimulation protocol for finding supramaximal and submaximal twitch and tetanus optimal length. Protocol varies by stimulation intensity, timing, and pulses per second.\n3. Completing \"avatar\" work loop technique using selected in vivo  strain trajectories\nSet up the software necessary to complete \"avatar\" work loop techniques (see Table of Materials).\n\tNOTE: An input file (.csv or similar) that specifies the muscle length at each time step is needed (see step 1.4). Inputs for the percentage of the cycle at which the stimulation starts and for the duration of stimulation are necessary (see Supplementary Figure 3 for example).\nComplete \"avatar\" work loop technique.",
    "NOTE: While we use a custom LabView program, researchers can use any program that allows control of length changes in mouse EDL on a servomotor lever, control of the onset (% cycle) and duration (ms) of stimulation at specified times, and measurement of muscle force. See Supplementary Figure 3 for an illustration of the program authors use.\n\t\nUpload the scaled strain changes with scaled length excursion into the program from step 1.4. See steps 1.4, 3.3, and the Discussion section for more on \"scaled strain changes\".\nAdjust the starting length of the muscle if needed (see section 3.3). Input the starting length in V and mm to calibrate results (see Supplementary Figure 3).\nUse stimulation onset and duration calculated in step 1.3.\nRun the muscle through the scaled length changes with determined length excursion for two cycles.\nSave data. If several stimulation protocols are collected on the same muscle, wait 3 min between each stimulation.\nStimulate at optimal length (L0) using submaximal activation to determine if fatigue has occurred. If force decreases by more than 10%, muscles are considered fatigued. See Table 1 for stimulation protocols.\nRemove the muscle from the bath. Cut-loop knots from the muscle and dab the excess solution off the muscle. Weigh the muscle. Determine physiological cross-sectional area using the standard formula: muscle mass/(L0*1.06)19.\nTune parameters for \"avatar\" work loop technique (see Discussion section).\n\t\nDetermine the starting length and length excursion by matching the ex vivo passive tension rise to the passive tension rise observed in vivo (Figure 2).",
    "NOTE: This study used percent L0 to scale starting length (mm) and excursion (% L0; see step 1.4 and Discussion section). For matching the tension rise in ex vivo mouse EDL to that of the in vivo rat MG, the authors found that starting length at L0 produced the best fit (Figure 2).\nChoose three starting lengths (e.g., -5% L0, L0, and +5% L0). Perform the \"avatar\" work loop at each of these starting lengths with a specified length excursion (e.g., 10% L0).\n\t\tNOTE: In the present \"avatar\" experiments using mouse EDL, a length excursion of 10% L0 was used.\nRepeat with new starting lengths and/or excursion until the rate of ex vivo passive tension rise is similar to the rate of in vivo passive tension rise (see Figure 2B).\nDepending on fiber types and activation dynamics of the muscles used, increase or decrease the duration of stimulation to optimize the match between ex vivo and in vivo force. Thus, it may be necessary to change the onset and/or duration of stimulation to best match in vivo force production during \"avatar\" experiments.\nTo decide whether this is necessary (see Discussion section), plot force over time of \"avatar\" and in vivo muscle (Figure 3) and calculate the coefficient of determination R2 by squaring the scaled correlation between target and \"avatar\" muscle force (see Representative results).\nimgsrc://cloudfront.jove.com/files/ftp_upload/65610/65610fig02.jpg",
    "Figure 2: Matching passive tension rise. Work loops showing the in vivo and ex vivo rise in passive tension (arrows). In vivo scaled work loop from rat MG (black) walking at 2.9 Hz (data from Wakeling et al.15). Ex vivo scaled work loops from mouse EDL (green) at 2.9 Hz. (A) Starting length of mouse EDL muscle is +5% L0. (B) Starting length of the mouse EDL muscle is L0. Note that the ex vivo passive tension rise matches the in vivo tension rise in A but not in B. Thicker lines indicate stimulation. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/65610/65610fig02large.jpg]\nimgsrc://cloudfront.jove.com/files/ftp_upload/65610/65610fig03.jpg\nFigure 3: Optimizing stimulation duration of mouse EDL to match in vivo force of rat MG (black line). The force generated by the mouse EDL using the EMG-based stimulation (green dashed line) decreases earlier than the in vivo force, likely due to faster deactivation of the mouse EDL compared to rat MG. To optimize the fit between the in vivo and ex vivo forces, the mouse EDL was stimulated for a longer duration (solid green line). EMG-based stimulation R2 = 0.55, Optimized stimulation R2 = 0.91. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/65610/65610fig03large.jpg]Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}