{
  "id": 4517,
  "origin_website": "Bio",
  "title": "Fluorescence Recovery after Photobleaching (FRAP) Assay to Measure the Dynamics of Fluorescence Tagged Proteins in Endoplasmic Reticulum Membranes of Plant Cells",
  "procedures": [
    "Transient expression of proteins by agro-infiltrationInoculate a single colony of transformed A. tumefaciens in 5 ml of LB medium with Kanamycin (50 µg/ml) and Rifampicin (50 µg/ml). Incubate the culture (12 h or more) at 28-30 °C with vigorous shaking.Measure the A600 of the culture.Collect the bacteria by slow-speed centrifugation (2,000 x g, 15 min) in a swinging rotor. Remove the supernatant.Resuspend the pellet with Agrobacterium infiltration buffer. The final A600 should be adjusted to 0.2.Leave at room temperature for 2 h before infiltration.Infiltrate the cultures with 1 ml syringe into the lower side of the leaves. Use 3-4 week-old N. benthamiana plants and avoid cotyledons. Use your fingertip to apply gentle counter pressure to the other side of the leaf. A fully inﬁltrated part of the leaf gives a water-soaked appearance.Keep the plants in growth chambers in 16 h light at 25 °C and 8 h dark at 22 °C.Microscope slide preparationTo minimize transient overexpression artifacts in the FRAP experiments plants were used 36 h after infiltration.Cut a small disk of the infiltrated leaf with a cork borer or similar device. Try to avoid the leaf veins to eliminate any potential irregularity or significant depression in the sample.In the case of drug treatment, immerse tissue samples into latrunculin B (1 ml of a 25 µM solution) in a small petri culture dish (35 x 10 mm) for 1h. Perform non-treated control by tissue immersion into 10 mM DMSO.Using fine paddle forceps place the leaf disk in a microscope slide with the back side facing up and mount in Mowiol mounting medium.Add a coverslip and stick them to the slide with adhesive one-sided tape.Place a drop of immersion oil on the cover slip over the leaf disk.",
    "Fluorescence recovery after photobleaching (FRAP) assayFRAP experiments were performed on an inverted Zeiss LSM 780 confocal microscope using the LSM FRAP Module from Zen 2011 software.Switch on the laser lines for imaging the sample.Find epidermic cells showing moderated expression levels and homogenous distribution through the ER of the GFP-tagged proteins with the Plan-Apochromat 40x/1.4 oil objective and then switch to the Plan-Apochromat 63x/1.40 oil objective to capture images.Select “range indicator”. Now image turn into one of two-color (red and blue) (Figure 1). The red areas indicated saturation of the detector due to high fluorescence intensity. Similarly, the blue area either represents no fluorescence or intensity lower than the detector can sense. Only a few pixels have to be saturated (in red), if not, adjust the pinhole, laser intensity, or detector gain.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20141014/20141014235729_0288.jpgFigure 1. Laser confocal scan in green A and range indicator mode B. The saturated areas in red are indicated.Use 5x optical zoom and 256 x 256 pixel resolution to take a single image of a short piece of the endoplasmic reticulum (for this purpose use “Snap” function). This zoom factor should stay the same between samples.Click the bleaching option on the acquisition tab. Time series and region options will be automatically selected.To define the regions of interest (ROI) which should be bleached select the circular shape in the regions menu and draw four circular ROIs of 1.7 μm diameter in fluorescent regions of the sample. Select a flat membrane region of the ER significantly larger than the bleach ROIs. Three of ROIs will be bleached and the fourth one will be used as the non-bleached reference to correct the FRAP curves for photofading caused by imaging. Locate the reference ROI as far apart as possible from the bleached ROIs.",
    "Ensure that a region which is background is in your image and draw a fifth circular ROI inside. In fast recovery rates, it is important to use small ROIs to decrease at maximum the time interval between photobleaching and imaging.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20141014/20141014235917_2306.jpgFigure 2. Spatial distribution of the región of interest (ROIs). Reference ROI must be located away from bleached ROIs to be not affected by the laser bleach. Background ROI should be in a non-fluorescent area (blue pixels in range indicator mode).To setup bleaching protocol select start bleaching after 3 scans and use 100 iterations of the bleach laser over the bleach region. Do not use zoom bleach. In excitation of bleach, select the 488 nm line of the Argon laser (25% power, 100% transmission). After bleaching, try to reduce the ROI intensity between 50-75% without photodamage to the cell. After bleaching collect images at low laser power (25% power, 2% transmission). Open the time series menu and specify the total number of images in the final data set (before and after bleaching) by setting the number of cycles to 100. This results in an interval between the beginning of each scan of approximately 191 ms. To further increase the rate of data acquisition, use bidirectional scanning.Start FRAP experiment by pressing “Start Experiment button” and examine the FRAP curve on the computer. ROI reference intensity should remain constant or be slightly reduced due to photofading during image acquisition Repeat FRAP on different cells and days to ensure reproducibility. To allow comparison between different cells and proteins, the detector gain can be readjusted but all other settings must be kept the same.FRAP data processingFRAP data generated using the LSM systems can be displayed and analyzed with the confocal operating software.",
    "Alternatively, raw fluorescence intensity values from bleached, background and reference ROIs can be exported to Microsoft Excel to be double normalized (Phair et al., 2004).Calculate the photobleaching rate (R) by comparing the intensity of the fluorescence of the reference ROI before (RF0, average intensity of the three scans taken before bleaching) and at each scan after photobleaching (RFn) Rn = Fn/F0.Normalize the fluorescence intensity of the bleached ROIs (BleachedFn) as follows: NF = (BleachedFn - BackgroundFn)/r.Copy the data to a program such as GraphPad Prism and curve fit the fluorescence by using non-linear regression and the exponential one-phase association model. The mobile fraction (Mf) that corresponds to the plateau value and half-life imgsrc:https://en-cdn.bio-protocol.org/attached/image/20141015/20141015233216_8845.jpg1/2, the time it takes for fluorescence intensity to reach half the maximum of the plateau level are obtained by the software."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Plant Science"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}