{
  "id": 10155,
  "origin_website": "Jove",
  "title": "Layer Microdissection of Tricuspid Valve Leaflets for Biaxial Mechanical Characterization and Microstructural Quantification",
  "procedures": [
    "All methods described herein were approved by the Institutional Animal Care and Use Committee at the University of Oklahoma. Animal tissues were acquired from a USDA-approved slaughterhouse.\n1. Biaxial mechanical characterization\nTissue preparation\n\t\nRetrieve a TV leaflet from the freezer, razor blades, a surgical pen, forceps, a pipette with deionized (DI) water, and a cutting mat. Thaw the TV leaflet using 2-3 drops of room-temperature DI water.\n\t\tNOTE: DI water is used instead of phosphate-buffered saline (PBS) to avoid any PBS-induced difficulties for the layer microdissection.\nLay the specimen flat on the cutting mat with the ventricularis layer (i.e., the surface with the chordae insertions) facing upwards. Position the specimen so that the radial direction aligns with the Y-direction and the circumferential direction aligns with the X-direction.\n\t\tNOTE: The circumferential direction is oriented along the circumference of the valve.\nExamine the chordae insertion locations of the tissue. Determine an area, ideally ~12 x 12 mm, with the least amount of large chordae insertions while avoiding extremely thin (i.e., transparent) areas (Figure 1).\nFlip the specimen over so the atrial surface (i.e., the surface with no chordae insertions) is facing upwards. Ensure the circumferential and radial leaflet directions remain aligned with the X- and Y-axes, respectively.\nCut a square 12 x 12 mm specimen from the leaflet tissue that avoids the large chordae insertions or thin areas identified in step 1.1.3. Remove the trimmed portions of the leaflet tissue with the forceps and place them into a waste container.\n\t\t\nIf it is not possible to completely avoid large chordae insertions, cut the tissues so that they are along the edge of the square specimen. Avoiding chordae insertions is important as it helps prevent issues for the later microdissection.",
    "Use a surgical pen to place a small dot in the top right corner to track the specimen's orientation. Allow the ink to dry for approximately 30 s.\nFlip the specimen with the ventricular surface (i.e., the surface with chordal insertions) facing upwards. Trim the chordal attachments on the back of the tissue by stretching the chordae from the leaflet and using a razor blade to cut near its insertion location. Flip the specimen again so the atrial surface (i.e., the smooth surface) is facing upwards.\nThickness measurement\n\t\nRetrieve a noncontact laser displacement sensor. Zero the displacement sensor on a flat section of the cutting mat near the trimmed tissue.\n\t\tCAUTION: Do not directly shine the laser into the eyes.\nPosition the laser over the central region of the specimen. Remove air trapped under the leaflet surface as it can cause measurement errors. To release trapped air, either use tweezers to push the bubble to the edge of the tissue or lift one corner of the tissue.\nRecord the thickness shown on the displacement sensor's display. Repeat two more measurements in other locations of the specimen.\nCompute the average leaflet thickness using the three measurements recorded in the previous step. Use this value when creating the biaxial mechanical characterization protocols.\nBiaxial tester setup and tissue mounting\n\t\nPrepare a DI water bath at 37 °C, following the testing system's guidelines, to ensure the temperature under in vivo physiologic conditions.\nRetrieve forceps, the tissue specimen, mounting hardware, a fine-tipped tool, liquid cyanoacrylate glue, and black-painted glass beads (diameter: 300-500 µm).\n\t\tNOTE: Mounting hardware includes the tines, the mounting bridge, and the mounting rubber.",
    "Mount the tissue specimen to the testing system. Ensure the circumferential direction of the tissue aligns with the X-direction, which can be assisted by the dot previously placed in step 1.1.6.\n\t\tNOTE: The tines used here should be evenly spaced across the entire tissue edge length. The effective edge length is set to be 10 mm for the intact tissue and >3.3 mm for the composite layers.\nFiducial marker placement\n\t\nIdentify the central one-third square region of the mounted tissue. Use the approximate corners of this area for the fiducial marker placement.\nPlace glass beads in an open-faced weighing boat and create a small pool of liquid cyanoacrylate glue in a separate weigh boat. Coat the top of the fine-tipped tool with a small amount of glue. Dab excess glue on the side of the weigh boat.\nCreate one corner of the central one-third square array by gently pressing the glue-coated tip onto the tissue. Using forceps, grab a glass bead and carefully place it on top of the glue dot. Use the camera of the biaxial testing device for help with the bead placement.\nRepeat steps 1.4.2 and 1.4.3 for three additional beads until the square array is completed. Ensure the beads are securely attached, and their respective glue dots are not touching or sticking together. Dry the glue before lowering the tissue into the water bath.\n\t\t\nIf the beads are stuck together, wait for the glue to dry, then use the forceps to gently grasp the bead or glue and pull it off the tissue.\n\t\t\tNOTE: The glue and bead(s) should come off, allowing bead placement to be reattempted.\nPreconditioning",
    "Create a force-controlled preconditioning protocol, in which the tissue with edge length and thickness will undergo six repetitions of equibiaxial loading to a peak membrane tension Tpeak of 40 N/m with a preload of 3% × Tpeak10 and stretch and recovery times of 30 s each.\n\t\t\nConstruct an arbitrary testing directory that will temporarily store the data for future calculations. Set the loading rate to be 4.42 N/m.\nConstruct a new testing parameter set with the name Preconditioning0. Set the X-axis and Y-axis control modes to force and set the control functions to step. Define the load magnitude to be the force associated with Tpeak, i.e., fpeak = Tpeak · L. Define the preload magnitude as 3% of fpeak for the first repetition only and define both the stretch duration and recovery duration as 30 s. Define the number of repetitions as 10.\n\t\t\tNOTE: The computed peak first Piola-Kirchhoff stress, i.e., Ppeak = Tpeak/t, may exceed 200 kPa for thinner tissues, which could result in tissue tearing during testing. In these scenarios, the peak membrane tension was adjusted to a maximum first Piola-Kirchhoff stress of 200 kPa.\nExecute the preconditioning protocol. Following preconditioning, record the current X- and Y-dimensions of the specimen for use in the biaxial testing protocols.\nCreation and execution of biaxial testing protocols\n\t\nDetermine the time required to achieve the peak equibiaxial configuration from the post-preconditioned configuration with the desired displacement rate. Considering a constant displacement rate, compute the loading times for the remaining loading ratios (i.e., TXX:TYY = 1:0.5 and TXX:TYY = 0.5:1).\nManually jog the linear actuators to match the target forces for a given loading ratio. Repeat this process and record the leaflet dimensions for all loading ratios.",
    "Prepare a displacement-controlled testing protocol that biaxially displaces the tissue from the post-preconditioned configuration to the configurations recorded in step 1.6.2 (i.e., TXX:TYY = 1:1, 1:0.5, 0.5:1) within the times determined in step 1.6.1. Ensure that each protocol has three loading/unloading cycles for repeatability of the mechanical behavior.\n\t\t\nConstruct a testing directory that will store the data for future calculations. Ensure the directory name matches the current specimen.\nConstruct a new testing parameter set with the name 1:1, set the X-axis and Y-axis control modes to displacement, and set the control functions to ramp. Define the stretch magnitude to be the configuration recorded in step 1.6.1. Define the preload magnitude as 3% of fpeak for only the first repetition, and define both the stretch duration and recovery duration as the time recorded in step 1.6.1. Define the number of repetitions as 3.\nRepeat step 1.6.3.2 for the remaining loading ratios (i.e., TXX:TYY = 1:0.5 and TXX:TYY = 0.5:1), except define the preload magnitude as not applied. Ensure the stretch magnitude, stretch duration, and recovery duration match those recorded in step 1.6.2.\n\t\t\tNOTE: Only data from the final (third) cycle will be used for stress and strain analyses.\nExecute the displacement-controlled protocols. After completion of biaxial testing, return the tissue to its post-preconditioned dimensions.\n\t\tNOTE: The test should be immediately aborted if the tissue begins to tear.\nFurther characterizations\n\t\nLeave the tissue submerged in DI water and mounted to the biaxial testing system. Perform pSFDI imaging as described in steps 2.1-2.3.\nUnmount the tissue. If it is an intact tissue, proceed to the microdissection described in steps 3.1-3.7. If not, collect histology following step 3.7.\n\t\tNOTE: The DI water bath can be used for subsequent characterizations within the same day.",
    "Repeat steps 1.2-1.7 with the A/S and F/V layers acquired following the microdissection (steps 3.1-3.6).\n\t\tNOTE: The repetition of the testing protocol for the layers allows for direct comparison of the intact tissue to its own layers.\nBiaxial testing data post processing procedures\n\t\nPerform digital image correlation of the acquired biaxial testing images to determine the time-dependent marker positions. Compute the fiducial marker displacements via Eq (1).5\nimgsrc://cloudfront.jove.com/files/ftp_upload/63522/63522eq06v2.jpg (1)\n\t\tHerein, xi(t), Xi, and di(t) are the time-dependent location, the initial (reference) location, and the displacement of marker i.\nCompute the deformation gradient F by considering the fiducial markers as a four-node bilinear finite element, as shown in Eq (2)5\nimgsrc://cloudfront.jove.com/files/ftp_upload/63522/63522eq01.jpg (2)\n\t\tWhere BXi and BYi are the derivatives of the shape functions for node i in the X- and Y-directions, respectively, and ui(t) and vi(t) are the components of di(t): di(t) = [ui(t), vi(t)]T.\nCompute the applied first Piola-Kirchhoff stress P using the recorded forces, as in Eq (3)5\nimgsrc://cloudfront.jove.com/files/ftp_upload/63522/63522eq03.jpg (3)\nPXX and PYY are the X- and Y-components of P; L and t are the tissue edge length and thickness; fX and fY are the forces recorded in the X- and Y-directions.\nDetermine other strain and stress measures as needed,13 which include the right Cauchy-Green deformation C = FT/F, the Green-Lagrange strain E = (C - I)/2, the Cauchy stress σ = J-1PFT, and the second Piola-Kirchhoff stress S = F-1P.\n\t\t​NOTE: Herein, I is a second-order identity tensor, and J = det(F) is the Jacobian of the deformation gradient F.\n2. Polarized spatial frequency domain imaging\nSystem preparation\n\tNOTE: If desired, the fiducial markers can be removed from the tissue prior to the following steps.\n\t\nCenter the pSFDI device over the specimen (Figure 2). Turn on the projector and illuminate the specimen with 490 nm (cyan) light.",
    "Open the camera software and inspect the camera's field of view. Ensure the specimen is centered in the frame and is completely contained within the field of view.\nIf the mounted specimen is an intact leaflet, adjust the digital light processing (DLP) projector brightness to ensure the tissue is fully illuminated with no glares on the tissue surface. Do not adjust the brightness if the specimen is one of the composite layers.\nRotate the polarizer across its complete range of motion to detect possible glares or dirt on the polarizer lens. Carefully clean the polarizer lens with a microfiber cloth as necessary.\nData collection\n\tNOTE: The following data collection can be automated using software, such as LabVIEW or Python.\n\t\nMove the polarizer to its home position—ideally aligned with one of the biaxial testing axes. Capture one grayscale image and save it to the computer with the polarizer location (i.e., 0°).\nRotate the polarizer 5° and capture another grayscale image. Repeat this process to acquire 37 images that range from 0° to 180° with a 5° increment.\n\t\tNOTE: The images from the first pSFDI imaging sequence can be preliminarily analyzed to ensure the desired optical response from the tissue. Refer to step 2.3 for instructions.\nRepeat the pSFDI imaging sequence for other desired tissue configurations, for example, the peak configurations of the loading protocols considered for biaxial mechanical testing.\npSFDI data postprocessing procedures\n\tNOTE: The following method includes steps for the MATLAB program language. However, any preferred language (e.g., Python, C++) may be used instead.\n\t\nUse the MATLAB imread() function to construct arrays containing the pixel-wise intensities of the 37 acquired images. For convenience, arrange these as an n × m × 37 three-dimensional array, where n and m are the numbers of pixels along the two axes.",
    "Define the tissue region of interest (ROI) using the user-defined grabit() function.\nFit the intensity vs. polarizer angle data for each ROI pixel using a 3-term Fourier series, as in Eq (4):\nimgsrc://cloudfront.jove.com/files/ftp_upload/63522/63522eq04.jpg (4)\n\t\tHerein, I(θ) is the pixel-wise intensity as a function of polarizer angle, and bi are the Fourier constants. Use standard linear least-squares regression to determine bi.\nDetermine the pixel-wise fiber orientation as the polarizer angle associated with the maximum value of I(θ). Compute the degree of optical anisotropy (DOA) via Eq (5).\nimgsrc://cloudfront.jove.com/files/ftp_upload/63522/63522eq05v3.jpg (5)\nUse plot() and histogram() to visualize the acquired fiber orientation and DOA values. Save the processed results for later use.\n3. Microdissection of tricuspid valve leaflet composite layers\nTissue attachment to wax board\n\t\nGather the required materials: wax board, DI water, pipette, scalpel, micro scissors, thin forceps, curved forceps, thick forceps, and pins.\n\t\tNOTE: Only use tweezers without teeth or grips, as forceps of this type can very easily rip the thin tissue of the A/S layer when performing the dissection.\nUnmount the tissue from the biaxial tester and measure its thickness using the laser displacement sensor described in step 1.2. Place the tissue on the wax board.\nExamine the ventricularis side of the tissue for large chordae insertions. Note the position of these insertions to avoid them during the dissection (Supplemental Figure S1). Take a photograph for reference.\nSpread the tissue flat on the wax board with the atrialis facing up. Affix the tissue to the board using the pins:\n\t\t\nIn each corner of the tissue, place one pin that is angled away from the tissue (for better viewing) and slightly pulls the tissue taut (Figure 3A). Do this in clockwise or counterclockwise order. Ensure that the pins are outside the holes created by the tines when mounting the tissue.",
    "Adjust the pin placement slightly to ensure that the tissue is taut and in a square configuration (Figure 3B) so that the tissue lies flat and does not shift during the layer micro-dissection.\nIf necessary, place pins along the side of the tissue during the dissection to stretch the tissue more. Keep in mind when placing and angling additional pins that they must be worked around during the dissection.\nRemove the glass bead fiducial markers.\n\t\t\tNOTE: The following step is optional. The added DI water helps maintain tissue hydration and prevents the tissue from sticking to itself throughout the microdissection.\nUsing a pipette, place DI water on the surface of the tissue so that it completely covers the tissue in a bubble-like manner. Replenish the DI water as needed throughout the dissection.\nMake the initial corner.\n\t\nSelect a corner of the pinned specimen to begin the dissection. Avoid large chordae insertions and extremely thin areas.\nMake a cut in the A/S layer by lightly dragging the scalpel over the tissue surface along the mounting holes from mechanical testing (Figure 3C). Ensure the cut is at least 5 mm long, and the edges of the cut start to pull apart, revealing the F/V layer underneath.\nUse the thin forceps (without a sharp tip) to firmly rub along the cut and pull the edges of the cut apart (Supplemental Figure S2).\n\t\t\nIf the cut in the A/S layer does not start to pull apart, lightly trace over the same cut again with the scalpel until it begins to do this. Be careful not to cut too deeply into the tissue (past the A/S composite layer) as it makes it more difficult to cleanly separate the layers.",
    "Repeat steps 3.2 and 3.2.3 to make a second cut perpendicular to the first cut (Figure 3D). Ensure that the two cuts are connected and form a corner.\n\t\t\nIf the two cuts are not connected, run the thin tweezers under the small area of tissue separating the two cuts (Supplemental Figure S3). Then, carefully use the scissors to cut the tissue.\nPeel the tissue from the corner.\n\t\nRub along the cuts using the thin forceps until the tissue begins to separate from the F/V layer. As soon as a small piece of tissue is separated, grasp it with the tweezers and gently pull it to further separate the composite layers.\n\t\tNOTE: Always place the tip of the thin tweezers past the edge of the tissue when grasping. Otherwise, they could accidentally poke a hole into the A/S composite layer.\nContinue to peel the tissue and rub the seam until it reaches the end of the two cuts made for the corner. Throughout this process, switch to larger tweezers to grasp the tissue for the peeling process to prevent undesired ripping and tearing of the A/S composite layer.\n\t\t\nIf the first corner attempted has major issues with separation, try a different corner as a starting point (go back to step 3.2).\nExtend cuts, peel the tissue, and make a second corner.\n\t\nExtend the two cuts made for the first corner by placing the scalpel tip at the bottom of each cut and lightly dragging it along the tissue surface (Figure 4A). Ensure that all extension cuts are at least 5 mm and the cut extensions connect to the original cuts and continue to follow the tine or suture holes.",
    "NOTE: If the extension cut is too deep, then the forthcoming peeling must be closely monitored to ensure sections of the fibrosa are not separated with the A/S composite layer (Figure 5A).\nContinue to extend the cuts and peel the top composite A/S layer back while rubbing the seam until one side is finished. Observe that the tissue will be separated completely along one cut; ensure that the seam between the A/S and F/V composite layers is straight (Figure 4B).\nRepeat the instructions in step 3.2 and step 3.3 to create a second corner perpendicular to the end of the fully peeled side (Figure 4C).\nCompletely separate the A/S layer.\n\t\nExtend the remaining cuts while avoiding large chordae insertions. Continue separating the A/S and F/V layers by using the rubbing and pulling techniques employed for the first corner. Make a note of several considerations or problems that may arise during this process:\n\t\t\nExclude the chordae insertions from the A/S separation area (Figure 5B) only when this exclusion will allow for an A/S specimen large enough for experimental characterizations (>3.3 mm).\nIf the tissue tears or a hole forms, stop separating the tissue immediately. To prevent tweezers from being caught, place the scissors in any hole that forms and cut the tissue away from the center. If the defect forms along the seam of separation, then begin separating the tissue along another edge to prevent further tearing (Figure 5C).\nLook for interlayer connections that may appear while separating the tissue and prevent further separation of the tissue without a high risk of ripping (Figure 5D). Observe these are thin but strong strands that must be carefully cut using scissors. Avoid creating a hole in the A/S layer or cutting downwards into the F/V layer, as this would cause uneven separation.",
    "Continue this process until the largest sample possible of the A/S layer has been separated. Mark the orientation of the sample using the surgical pen (Figure 6A).\nFinish dissection.\n\t\nUse the scissors to cut along the seam of separation for the remaining tissue edge (Figure 6B). Ensure this cut is as close to the seam of separation as possible.\nPlace the separated A/S composite layer flat on the cutting mat. If necessary, use the scalpel to straighten the edges of the tissue and create a square tissue shape suitable for biaxial mechanical testing. Place the A/S layer in DI water until it is ready to be tested.\nMark the orientation of the F/V layer that remains on the wax board. Cut the largest square possible out of the area where the A/S layer was removed (Figure 6C), then place it in DI water.\nHistology\n\t\nExcise two strips of tissue—aligned with the circumferential and radial directions—for use in histology. Use different protocols for the intact and the composite layers (i.e., A/S and F/V).\n\t\t\nFor the intact layer, take the specimens from the tissue that remains pinned to the wax board. Use the tissue outside the tine/suture holes, as this portion of the tissue has not been dissected and will represent the intact leaflet.\nFor the A/S and F/V composite layers, only collect histology samples after fully completing their testing and imaging. Unmount the specimen from the biaxial testing system, lay the tissue flat on a cutting mat, and excise the circumferential and radial strips using a razor blade.\nPlace the excised strips in tissue cassettes and submerge the cassettes in 10% formalin.\nDiscard the remaining tissue. Clean the dissection tools using cleaning compound (see the Table of Materials).",
    "After 24-48 h of fixation, transfer the cassettes to ethanol, where they can be stored indefinitely until histology processing and staining.\n\t\tNOTE: This histological analysis can confirm that the microdissection is successful. CAUTION: 10% formalin causes skin irritation and serious eye damage. It may also cause an allergic reaction or cancer through inhalation. When handling, wear appropriate personal protection equipment, such as gloves, goggles, and a lab coat, and only use in well-ventilated spaces, such as in a fume hood. When not in use, make sure the storage container is tightly closed.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}