{
  "id": 18647,
  "origin_website": "Jove",
  "title": "Experimental and Imaging Techniques for Examining Fibrin Clot Structures in Normal and Diseased States",
  "procedures": [
    "NOTE: The following protocol adheres to the guidelines set by the Institutional Review Board (IRB) at Georgia Tech.\n1. Blood Collection and Red Blood Cell Isolation Procedure\nCollect 40-120 ml of blood from donors in 10 ml heparinized vacutainer tubes. Start PBMC (peripheral blood mononucleated cell) isolation within 4 hr of collection. During this time, keep blood at RT.\n\tNOTE: O/N storage of blood in RT or in 4 °C is NOT recommended as this will result in lower PBMC yield.\nDilute whole blood 1:1 in ice-cold (4 °C) sterile PBS.\nPipette 10 ml of ice-cold hydrophilic polysaccharide into an empty, sterile 50 ml conical tube. Gently transfer diluted whole blood on top of the hydrophilic polysaccharide.\nUse a 25 ml pipette in slow setting and pipette blood along the side of the tube very slowly. Ensure that the blood is not mixed with the saccharide prior to centrifugation because the hydrophilic polysaccharide is toxic to cells and otherwise, the PBMC yield will be lower.\nCentrifuge blood samples for 30 min at 400 x g at 4 °C. If available, reduce the brake speed of the centrifuge to half of maximum for better separation after centrifugation.\nAspirate off the plasma/platelet fraction of the centrifuged blood sample. Carefully aspirate off the hydrophilic polysaccharide layer directly above the packed RBC layer.\nCollect 8-10 ml of packed RBCs and dilute 1:1 with unsterile 0.9% NaCl saline.\n2. Confocal Microscopy Evaluation of Glycated Clot Structures (Simulated Diabetic Clots)\nDefrost human fibrinogen and fluorescently labeled human fibrinogen conjugate at 37 °C.\nPipette the following into a 0.5 ml graduated microcentrifuge tube.\n\t\nFor the healthy, normal fibrinogen clots, mix human fibrinogen with 10% fluorescently labeled human fibrinogen conjugate in a 50 mM Tris/100 mM NaCl buffer at a concentration of 5 mg/ml.",
    "For artificially glycated fibrinogen (to simulate diabetic clots), incubate human fibrinogen and 10% fluorescently labeled fibrinogen conjugate in a 5 mM solution of glucose dissolved in 50 mM Tris/100 mM NaCl for a resulting concentration of 6.8 mg/ml.\nCover the micro-centrifuge tubes using an opaque material to avoid exposure to light. Incubate the tubes in a 37 °C water bath for 48 hr.\nMake a chamber on a glass microscope slide by affixing a thin adhesive on 2 sides of the slide.\nAfter the 48 hr incubation period, prepare reagents for fibrin formation by defrosting FXIIIa and human alpha thrombin at RT.\nDilute FXIIIa to 80 U/ml in 5 mM CaCl2 buffer.\nDilute thrombin to 4 U/ml in 5 mM CaCl2 buffer.\n\t\nFor normal clots, ensure that the final concentrations of fibrinogen, FXIIIa, and thrombin are 2.5 mg/ml, 20 U/ml, and 1 U/ml, respectively at a volume of 50 μl.\nFor the glycated clots, ensure that the final concentrations of fibrinogen, FXIIIa, and thrombin are 3.4 mg/ml, 20 U/ml, and 1 U/ml, respectively at a volume of 50 μl.\nImmediately pipette 30 μl of the fibrin solution into the chamber formed by the adhesive.\nPlace a 22 mm x 22 mm glass cover slip with thickness of 0.15 mm on top of the 2 layers of adhesive. Seal the open sides with clear adhesive to prevent the fibrin clot from drying out. Ensure that the adhesive does not interact with the fibrin clot.\nAllow the fibrin clots to polymerize at 21-23 °C for 2 hr before confocal imaging.\nTake confocal microscopy images of the clots using a confocal microscope with a 40X/1.30 Oil M27 lens with a 488 nm Argon laser.\n3. Confocal Microscopy Evaluation of Fibrin Clots Containing RBCs from Sickle Cell Patients",
    "Defrost human fibrinogen and fluorescently labeled human fibrinogen conjugate at 37 °C.\nPipette the following into a 0.5 ml graduated microcentrifuge tube.\n\t\nFor the healthy, normal fibrin clot, mix human fibrinogen with 10% fluorescently labeled human fibrinogen conjugate in a 50 mM Tris/100 mM NaCl buffer at a concentration of 5 mg/ml.\nFor the clots containing SCD RBCs, mix human fibrinogen and 10% fluorescently labeled human fibrinogen conjugate in a 50 mM Tris/100 mM NaCl such that the resulting concentration of the fibrinogen is 10 mg/ml.\nLabel the isolated RBCs (both normal and those from sickle cell patients obtained from the RBC isolation protocol) using a cell-labeling solution.\n\t\nSuspend cells at a density of 1 x 106 per ml in any chosen serum-free culture medium.\nAdd 5 μl/ml of the cell suspension to the cell-labeling solution. Mix well by gentle pipetting gently.\nIncubate for 20 min at 37 °C.\nCentrifuge the labeled suspension tubes at 1,500 rpm for 5 min at 37 °C.\nRemove the supernatant and gently re-suspend the cells in 37 °C medium.\nRepeat the wash procedure (3.3.4 and 3.3.5) two more times.\nDilute FXIIIa to 80 U/ml in 5 mM CaCl2 buffer.\nDilute thrombin to 4 U/ml in 5 mM CaCl2 buffer.\n\t\nFor normal clots, ensure that the final concentrations of fibrinogen, FXIIIa, and thrombin are 2.5 mg/ml, 20 U/ml, and 1 U/ml, respectively at a volume of 50 μl.\nFor the clots containing SCD RBCs, ensure that the final concentrations of fibrinogen, FXIIIa, and thrombin are 5 mg/ml, 20 U/ml, and 1 U/ml, respectively at a volume of 50 μl.\nPipette 10 μl of the labeled RBCs into the fibrin solution. Pipette 30 μl of the fibrin with RBCs onto the microscope glass (refer to slide preparation for glycated clots).",
    "Allow the fibrin to polymerize at 21-23 °C for 2 hr before confocal imaging.\nTake confocal images of the clots using the confocal microscope, and utilize excitation lasers with wavelengths of 488 nm and 633 nm to excite the fluorescently labeled fibrin and RBCs.\n4. Confocal Microscopy Evaluation of Fibrinolysis Rates in Glycated Clot Structures\nRepeat the confocal microscopy protocol of glycated clots (Protocol Step 2) for the fibrinolysis rate evaluation in glycated clots.\nDo not seal the ends of the chamber with clear adhesive. Allow the fibrin clots to polymerize for 1.5 hr at 21-23 °C in a sealed enclosure containing 250 ml of water to prevent dehydration.\nAfter polymerization, obtain images of the clots using the confocal microscope.\nPipette plasmin into the open end of the chamber and disperse the plasmin through the clot via capillary action.\n\t\nFor the normal and glycated fibrinolysis experiments with normal concentrations, pipette 25 μl at 200 μg/ml of plasmin into the opening of the chamber.\nFor the glycated clots with reduced concentrations, pipette 25 μl at 50 μg/ml into the opening of the chamber.\nUse the time series feature (see Figure 1) in the confocal microscope software to capture real-time video footage of the plasmin lysing the clot.\n\t\nClick acquisition mode and then select “Time Series.” Select the number of cycles and the recording time interval.\n5. Calculating Fibrinolysis Rates\nDetermine the lysis rate by setting an area (2,500 µm2) and calculating the elapsed time required to dissolve a fixed area of the clot. Calculate the lysis rate using the following equation (Figure 2):\nimgsrc://cloudfront.jove.com/files/ftp_upload/52019/52019eq1.jpg\n6. Statistical Analysis of Fibrinolysis Rates\nAnalyze the lysis data using statistical analysis software. Perform a one-way ANOVA and a post hoc Tukey-Kramer test44,45.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}