{
  "id": 13062,
  "origin_website": "Jove",
  "title": "Isolation and Culture of Three Kinds of Umbilical Cord Mesenchymal Stem Cells",
  "procedures": [
    "All experimental procedures were approved by the Clinical Research Ethics Committee, Third Affiliated Hospital, Soochow University. Informed written consent was obtained from the human subjects. Individuals with full-term vaginal delivery or cesarean section were included in the present study to obtain the umbilical cord. The umbilical cord comes from healthy newborns without gender bias. The neonate had an Apgar score of 8-10. The Apgar score is a quick test for newborns given soon after their birth. This test checks a baby's muscle tone, heart rate, and other signs to see if any additional medical or emergency care is needed7. On the other hand, patients with major diseases, such as heart, liver, kidney, or other infectious diseases, were excluded from the present study.\n1. Collection of human umbilical cord\nPlace the newborn's umbilical cord into phosphate buffered saline (PBS) and transport at 4 °C.\n\tNOTE: Three umbilical cords from three donors were used in the present study.\nRemove the umbilical cord blood immediately under sterile conditions, and cut along the long axis of the blood vessels in 20 cm of the umbilical cord. Separate the appropriate 20 cm of the umbilical arteries and vein, and remove the Wharton's jelly on the surface carefully.\n\tNOTE: Explant cultures were obtained from each region, minced into small pieces (1-2 mm3) to avoid cross contamination among the three types of stem cells.\nCut the umbilical arteries, vein, and Wharton's jelly to a size of 1-2 mm3 and inoculate them into 100 mm cell culture dishes. Perform the inoculation of the umbilical arteries, vein, and Wharton's jelly using tweezers following a previously published report5. Do not precoat the 100 mm culture plates.",
    "​NOTE: The interval between the umbilical arteries, vein, or Wharton's jelly was about 1 cm. A too long collection time before separating cells may affect the cell viability and amount. It is recommended to separate the arteries and vein from the umbilical cord immediately. The collection time was up to 4 h.\n2. Isolating and culturing of UCA-PSCs, UCV-PSCs, and WJ-MSCs\nPlace the cell culture dishes upside down for 3 h in a 5% CO2 incubator at 37 °C to ensure the umbilical arteries, vein, and Wharton's jelly tissue attach to the cell culture dishes tightly before the culture medium is added.\n\t\nAfter 3 h, return the cell culture dishes to normal placement. Add 5 mL of cell culture medium (LG-DMEM, 10% FBS, 100 IU/mL of penicillin, and 100 µg/mL of streptomycin, see Table of Materials) to the cell culture dish.\nAdd 3 mL and 2 mL of the culture medium into the cell culture dish on the 3rd and 7th day of the first week, respectively. Be careful not to touch the tissue blocks of umbilical cord arteries, vein, and Wharton's jelly.\nChange half of the liquid medium twice in the second week and the entire liquid medium twice in the third week.\nObserve the cells crawling out of the tissue blocks at approximately 7 days post-culture, and then discard the tissue blocks when the cells are 80% fused at ~2 weeks.\n\t\nWhen the cells are 100% fused, passage them at a ratio of 1:3 with 2 mL of 0.05% trypsin after centrifugation at 600 x g for 4 min at room temperature.",
    "NOTE: The primary cells isolated from an umbilical cord were about 2 x 106 UCA-PSCs, 1 x 106 UCV-PSCs, and 2 x 106 WJ-MSCs. The 2 x 106 UCA-PSCs, 1 x 106 UCV-PSCs, and 2 x 106 WJ-MSCs were isolated from 20 cm of umbilical cord. The cells crawled out in all three umbilical cords, which indicated results between isolations were repeatable.\nSeed the cells, maintaining a concentration of 5 x 105/100 cm2 in the culture dish. Preserve the 5 x 105 cells in 1 mL of cryopreservation solution (90% FBS, 10% DMSO). Third- to fifth-passage cells were used in the present study.\n3. Detection of MSC surface markers by flow cytometry\nDigest the third-generation cells with 0.05% trypsin to obtain a single-cell suspension. Centrifuge the cells at 600 x g for 4 min at room temperature and discard the cell supernatant using a Pasteur pipette. Then resuspend 1 x 105 cells in 100 µL of PBS (1% FBS). Asses the cell number by counting the cells using a hemocytometer following a previously published report8.\nIncubate the 1 x 105 cells with various phycoerythrin antibodies against CD13 (FITC, 0.1 mg/mL), CD34 (FITC, 0.1 mg/mL), CD45 (FITC, 0.1 mg/mL), CD73 (FITC, 0.1 mg/mL), and HLA-DR (FITC, 0.1 mg/mL) in the dark for 30 min. For controls, incubate 1 x 105 cells with FITC-IgG (FITC Mouse Anti-Human IgG, 0.1 mg/mL) (see Table of Materials).\nCentrifuge the cells at 600 x g for 4 min at room temperature, and then discard the cell supernatant using a Pasteur pipette. Resuspend 1 x 105 cells in 500 µL of PBS (1% FBS), detect by flow cytometry, and analyze by FlowJo2 (see Table of Materials).\n4. Differentiation of UCA-PSCs, UCV-PSCs, and WJ-MSCs into adipocytes",
    "Inoculate the third-generation cells into 24-well plates at a density of 6 x 104 cells/cm2 with 500 µL of cell medium (LG-DMEM, 10% FBS, 100 IU/mL penicillin, and 100 µg/mL streptomycin, see Table of Materials) per well in a 5% CO2 incubator at 37 °C.\nChange the cell medium after 24 h, and change the control group to cell medium (LG-DMEM, 10% FBS, 100 IU/mL penicillin, and 100 µg/mL streptomycin). Conduct the experiments after the cells are 80% fused in 24-well plates.\n\tNOTE: The cells in the groups that induced adipogenesis were changed to an adipogenic induction medium (adipogenic differentiation kit, see Table of Materials). The medium of the cells in both groups was changed every 3 days.\nObserve lipid droplets in cells at approximately 21 days post-induction in the adipogenic induction group and then terminate the adipogenic induction.\n\tNOTE: The adipogenic medium was replaced by cell culture medium to terminate the adipogenic induction2,5. In addition, the cells in the control group showed no significant change.\nWash the cells three times with PBS for 5 min and then fix with 4% paraformaldehyde for 15 min at room temperature. Then, wash the cells three times with PBS for 5 min each.\nDiscard the PBS and dry the cells at room temperature for approximately 20 min. Then, add 500 µL of oil red O solution (0.5%) (see Table of Materials) to the well for 10 min.\nRemove the oil red O solution and wash the cells with PBS three times for 5 min each. Observe the cells under a microscope.\n5. Differentiation of the stem cells into osteoblasts\nPlace 500 µL of 0.1% gelatin (see Table of Materials) per well in 24-well culture plates and discard it after 30 min.",
    "Inoculate 6 x 104/cm2 of third-generation cells into 24-well culture plates, and add 500 µL cell culture medium or osteogenic induction medium (Osteogenic Differentiation Kit, see Table of Materials) to each well in a 5% CO2 incubator at 37 °C. In the control group, change the cell culture medium every 3 days, while also replacing the osteogenic induction medium in the osteogenic differentiation group every 3 days.\nAfter 3-4 weeks, check for black calcium deposition in the cells. Wash the well with PBS three times for 5 min each.\nFix the cells at room temperature with 4% paraformaldehyde for 15 min and wash with PBS three times for 5 min each. Add alizarin red staining solution (1%) to the well for 20 min at room temperature, and then discard it.\nAfter drying for 30 min at room temperature, observe the cells under a microscope.\n6. Differentiation of the stem cells into neurons\nInoculate the 6 x 104/cm2 third-generation cells into 24-well culture plates, where sterile cover slides treated with L-polylysine were preplaced. Place the cell climbing sheets (see Table of Materials) in the 24-well plates to differentiate the cells into neurons. Culture the cells on the cell climbing sheets.\nThen, add 500 µL of cell culture medium to the well, and replace the cell culture medium with 500 µL of neurogenic induction medium9 (see Table of Materials) after 24 h.\nAfter induction for 24 h, add 10-7 mol/L of ATRA and 10 ng/mL of bFGF (see Table of Materials) to the solution to maintain the induced differentiation of neurons.\nTerminate the induction when obvious cellular synapses are formed. Check for the obvious cellular synapses using microscopy technique (see Table of Materials).",
    "NOTE: Immunofluorescence staining was used to identify neuron-specific markers of neuron-specific enolase (NSE, see Table of Materials), which is a marker of neurons2.\nPerform confocal imaging on the cell climbing sheets.\n7. Immunofluorescence staining\nAfter discarding the cell culture solution, wash the cells with 500 µL of PBS three times for 5 min each.\nThen, add 500 µL of 4% paraformaldehyde to the well, and fix the cells at room temperature for 45 min.\nWash the cells with PBS three times for 5 min each.\nPermeabilize the cells with 100 µL of 0.5% Triton-X at room temperature for 5 min.\nWash the cells with 500 µL PBS with 1% BSA three times for 5 min each.\nIncubate the cells with 500 µL of PBS with 3% BSA and 0.1% Triton X-100 per well at 37 °C for 45 min to block the nonspecific binding site.\nDilute the primary antibody against NSE (1:100, see Table of Materials) with PBS (1:100) containing 1% BSA and 0.1% Triton X-100, and incubate the cells with the primary antibody overnight at 4 °C.\nAfter discarding the primary antibody, wash the cells with 500 µL of PBS containing 1% BSA three times for 5 min each.\nDilute the fluorescent secondary antibody (goat Anti-Mouse IgG H&L, Alexa Fluor 488, see Tabel of Materials) with PBS (1:200) containing 1% BSA and 0.1% Triton X-100 at 1:200, and incubate the cells with the secondary antibody at 37 °C in the dark for 60 min.\nWash the cells with 500 µL of PBST (PBS containing 0.1% Tween-20) per well three times in the dark for 5 min each.\nThen, add 200 µL of DAPI staining (PBST diluted, 0.1 µg/mL) to the well to stain the nucleus at room temperature without light for 5 min.",
    "Wash the cells with 500 µL of PBST three times in the dark for 5 min each.\nAdd the anti-fluorescence quenching agent to the slide and then gently cover the slide with a cover glass. Add nail polish drops around the cover glass to fix it.\nObserve the glass with a laser confocal microscope. Use the following microscopy settings: green channel with 488 nm laser and DAPI channel with 405 nm.\n8. Proliferation assay\nSeed 2 x 103 cells per well into 96-well plates. Add 100 µL of cell culture medium into each well.\nAdd 10 µL of Cell-counting kit-8 (CCK-8, see Table of Materials) into each well.\nAfter 2 days of incubation, measure the OD value at 450 nm on a microplate reader on days 1-7.\nAnalyze the OD values of the different types of stem cells using statistical software (see Table of Materials) and present them as means ± SD. Perform one-way analysis of variance (ANOVA). Consider P value < 0.05 to be statistically significant.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}