{
  "id": 11269,
  "origin_website": "Jove",
  "title": "Optical Mapping of Action Potentials and Calcium Transients in the Mouse Heart",
  "procedures": [
    "1. Advanced preparation of stock solutions\nPrepare two stock solutions of Tyrode's solution (16x) in advance in deionized water and store them at 4°C:\n\t\nStock I (119.872 g/L NaCl, 3.056 g/L CaCl2 (2H2O), 5.6 g/L KCl, 2.6274 g/L NaH2PO4, 3.408 g/L MgCl2 (6H2O), (Fisher Scientific, Fair Lawn, NJ));\nStock II (26.88 g/L NaHCO3, (Fisher Scientific, Fair Lawn, NJ)).\nPrepare stock solutions of fluorescent dyes. To avoid repeated freezing and thawing, we store 30 μl aliquots of both dyes at -20°C, which is sufficient for one experiment:\n\t\nVoltage-sensitive dye RH237 (Invitrogen, Carlsbad, CA) stock solution, 1.25 mg/mL solution in dimethyl sulfoxide (DMSO, Sigma, St. Louis, MO);\nCalcium indicator Rhod-2AM (Invitrogen, Carlsbad, CA) stock solution, 1 mg/mL solution in DMSO.\nPrepare excitation-contraction uncoupler blebbistatin stock solution (Tocris Bioscience, St. Louis, MO, 2 mg/mL solution in DMSO) in advance and store the dissolved blebbistatin at 4°C.\n2. Prepare perfusion solutions and experimental setup7\nFreshly prepare 2L Tyrode's solution (128.2mM NaCl, 1.3mM CaCl2 (2H2O), 4.7mM KCl, 1.05mM MgCl2 (6H2O), 1.19mM NaH2PO4, 20mM NaHCO3, 11.1mM D-Glucose in deionized water, pH=7.35±0.05). If stock solution is being used to make 2L of Tyrode's solution (sufficient for one experiment) take 1750 mL of deionized water and mix in 125 mL of Stock I, 125 mL of Stock II, and 4g of glucose.\nTurn on the two pumps of the perfusion systems. Set the peristaltic pump (Peri-Star, WPI, Sarasota, USA) that is used for retrograde perfusion to 40 mL/min. Set the other peristaltic pump (Cole-Parmer Masterflex Peristalic Pump L/S, Cole-Parmer Instrument Company, Vernon Hills, Illinois) that is used for superfusion and to return the perfusate back to the holding reservoir to 80 mL/min.\nWash the perfusion system with 70% ethanol for 30 min and then with 2L deionized water.",
    "Once all the deionized water is evacuated from the chamber, circulate the Tyrode's solution and pass it through a 5-μm filter (Millipore, Billerica, MA, USA). Warm the perfusate to +37°C with a water jacket and circulator (ThermoNESLAB EX7, Newtown, USA) and oxygenate the perfusate by bubbling O2/CO2 (95% / 5%) gas into the solution. Monitor the pH of the solution with a pH meter (Oakton Instruments, Vernon Hills, IL) and adjust the rate of O2/CO2 bubbling to keep the pH at 7.35 ± .05. Continue monitoring pH and temperature during the experiment.\nThe dual optical mapping apparatus consists of two MiCAM Ultima-L CMOS cameras (SciMedia, Costa Mesa, CA) that have high spatial (100x100 pixels, 230±20 μm per pixel) and temporal (1,000-3,000 frames/sec) resolution. Fix a band-pass filter (590±15 nm, Thorlabs, Newton, NJ) in front of the designated calcium imaging camera; while, a long-pass filter (>700 nm, Thorlabs, Newton, NJ) needs to be positioned in front of the designated voltage imaging camera. The cameras are arranged perpendicular to one another by a holder, which contains a dichroic mirror (635 nm cutoff, Omega Optical, Brattleboro, VT). Immediately below the dual camera holder there is a lens (Nikon NIKKOR 55 mm 1:1.4 235052), which focuses the emission light coming from the heart onto the dichroic mirror. The working distance is approximately 3cm.\n\tThe excitation light is generated by a halogen lamp (Newport Oriel Instruments, Stratford, CT; SciMedia, Costa Mesa, CA) and is passed through a heat filter, shutter, and band-pass filter (520±45 nm). A flexible light guide directs the band-pass filtered light onto the preparation, and a shutter is used to ensure that the preparation is exposed to light only during image acquisition to avoid photobleaching of the dyes.",
    "Prepare Ag/AgCl2 electrodes for pacing and sensing in advance and install them in the chamber prior to placing the heart. Make sure that amplifiers and filters are adjusted to appropriate levels.\n3. Harvest the mouse heart, cannulate, and set up Langendorff perfusion\nAnesthetize the mouse with ketamine/xylazine (ketamin, 80mg/kg bodyweight; xylazine, 10 mg/kg bodyweight) and heparin (100 units) by intraperitoneal injection. Assure appropriate level of anesthesia by the lack of pain reflex.\nAfter a mid-sternal incision, quickly remove the heart and wash it in oxygenated (95% O2, 5% CO2), constant-temperature (37±1°C) Tyrode's solution.\nUsing a dissecting microscope, rapidly identify the aorta and make a clean cut across the ascending aorta below the right subclavian artery. A short section of aorta is then attached to a custom made 21-gauge cannula with a flared tip. 4-0 black-braided silk suture (Surgical Specialties Corporation, Reading, PA) is used to fix the heart onto the cannula. After cannulation, the heart is retrogradely perfused and superfused with Tyrode's solution. The retrograde perfusion rate is adjusted in the range of 2-5 mL/min to keep the aortic pressure between 60 and 80 mmHg (Pressure transducer, World precision instruments Inc (WPI), Sarasota, USA; Bridge Amplifier TBM4M, WPI, Sarasota, USA).\nAfter the heart is cannulated, lung, thymus, and fat tissue are then dissected and removed.\nThe isolated heart is pinned (Fine Science Tools) at the apex to the bottom of the perfusion chamber (Sylgard coated) to prevent stream-induced movement. The right and left atrial appendages are also stretched and pinned (Fine Science Tools, Inc, Foster City, CA) to the bottom of the chamber, which provides maximal surface area for optical measurements of the atria.",
    "Very important! A small silicon tube is inserted into the left ventricle through the pulmonary veins and fixed by silk suture to nearby connective tissue. This prevents solution congestion and acidification of the perfusate trapped in the left ventricle, which is especially important after the suppression of ventricular contractions with an excitation-contraction uncoupler (see Part 4 step 19).\nA custom made electrode is placed on the surface of the heart to conduct the pacing stimulations, which is generated by Master-8 (A.M.P Instruments Ltd, Jerusalem, Israel) or PowerLab 26T (AD Instruments, Sydney, Australia).\nA small cover glass is fixed on the surface of the solution over the heart to reduce motion artifact from the vibrating solution.\nFocus the excitation light on the heart. In addition, adjust the distance between the dual camera apparatus and the heart so that maximum resolution will be obtained.\nTurn off all lights in the room and commence electrical recordings using PowerLab 26T.\n4. Load voltage and calcium sensitive dyes and excitation-contraction uncoupler\nWarm-up 0.6 mL of blebbistatin. Mix 0.5 mL of the blebbistatin with the perfusate in the holding reservoir. Dilute the remaining 0.1 mL of blebbistatin in 1 mL of Tyrode's solution and slowly inject it (over a 20 minute period) through a drug port located near the cannula. Observe as blebbistatin gradually reduces the motion artifact.\nDilute 30 μL of voltage sensitive dye RH237 stock solution in 1 mL Tyrode's solution and slowly inject over 5-7 minutes into the same injection port as blebbistatin.\n30 μL calcium indicator Rhod-2 AM is 1:1 mixed with Pluronic F127 (Invitrogen, Carlsbad, CA, 20% solution in DMSO) and then diluted in 1 mL Tyrode's solution and slowly applied over 5-10 min through the same injection port.",
    "Wait for 5-10 minutes for blebbistatin and dyes to reach the cell membrane and cytosol. Continue with the protocol when motion is completely suppressed.\nContinuously monitor ECG recordings over the entire procedure to assure normal electrical function of the heart.\nCommence fluorescent signal recordings using the SciMedia custom software (SciMedia, Costa Mesa, CA).\n5. Representative results:\nimgsrc://cloudfront.jove.com/files/ftp_upload/3275/3275fig1.jpg\nFigure 1. Experimental setup for the perfusion, electrical recordings and optical mapping.\nEM=emission; Lp=longpass\nimgsrc://cloudfront.jove.com/files/ftp_upload/3275/3275fig2.jpg\nFigure 2. Experimental preparation and signal examples recorded during ventricular pacing. Left: ECG signals are collected from Ag/AgCl2 disk electrodes (Top) and an example of S1S1 stimulation protocol is shown (Bottom). Center: Langendorff mouse heart preparation. Right: Representative optical action potentials and calcium transient signals from atria (Top) and ventricles (Bottom) are shown. The yellow arrow (Top) points to the fluorescent signal scattering coming from the ventricles, which is seen in the atrial recordings.\nLV=left ventricle; RV=Right ventricle; LA=left atrium; RA=right atrium\nimgsrc://cloudfront.jove.com/files/ftp_upload/3275/3275fig3.jpg\nFigure 3. Representative optical recordings of Vm and CaT from the ventricles of a wild type mouse heart. A. The experimental preparation with an array of evenly spaced locations marked by black dots whose optical recordings can be seen in (C). B. Example tracing of Vm and CaT from a central location on the array (see box in (C)). C. Vm (blue) and CaT (red) from the array of evenly spaced locations. Signals were binned 3x3.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3275/3275fig4.jpg\nFigure 4. Activation map and conduction. A. An example activation map from a wild type mouse heart with transverse (T) and longitudinal (L) directions indicated by white arrows. B. Vm signals (Top) and dV/dt (Bottom) corresponding to the three points seen in A (T1, T2, T3; L1, L2, L3).\nimgsrc://cloudfront.jove.com/files/ftp_upload/3275/3275fig5.jpg",
    "Figure 5. Action potential and calcium transient duration analysis. A. Action potential duration at 80% repolarization (APD80) and calcium transient duration at 80% relaxation (CaD80) maps are shown from a heart under control conditions (Left) and after 30 nM isoproterenol application (Right). The yellow/green color in the ventricles (Right) indicates isoproterenol shortened APD80 and CaD80. B. Example tracings of APD80 and CaD80 from the wild type mouse ventricles (Top) and atria (Bottom)."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}