{
  "id": 8529,
  "origin_website": "Jove",
  "title": "Ex Vivo Pressurized Hippocampal Capillary-Parenchymal Arteriole Preparation for Functional Study",
  "procedures": [
    "All experiments were approved by the Institutional Animal Care and Use Committee (IACUC) of the University of Colorado, Anschutz Medical Campus and were performed according to the guidelines from the National Institutes of Health.\n1. Solutions\nUse MOPS-buffered saline for the dissection and to keep samples at 4 °C before their utilization. Do not gas the solution. Prepare MOPS buffered saline with following composition: 135 mM NaCl, 5 mM KCl, 1 mM KH2PO4, 1 mM MgSO4, 2.5 mM CaCl2, 5 mM glucose, 3 mM MOPS, 0.02 mM EDTA, 2 mM pyruvate, 10 mg/mL bovine serum albumin, pH 7.3 at 4 °C.\nUse artificial cerebrospinal fluid (aCSF) as the bath solution and pipette solution. Gas both aCSF and Ca2+-free aCSF with 5% CO2, 20% O2, and N2 balance. Prepare the solution with the following composition: 125 mM NaCl, 3 mM KCl, 26 mM NaHCO3, 1.25 mM NaH2PO4, 1 mM MgCl2, 4 mM glucose, 2 mM CaCl2, pH 7.3 (with aeration with 5% CO2, 20% O2, and N2 balance).\nObtain the maximal dilation in nominally Ca2+-free aCSF (0 mM [Ca2+]o, 5 mM EGTA).\n2. Organ chamber preparation\nInsert borosilicate glass capillaries (outside diameter = 1.2 mm; inside diameter = 0.69 mm; length = 10 cm) into a glass puller. Pull the capillary to make a long, thin tip at one end.\nTo one side of the chamber, add a cannula that can connect to a miniature peristaltic pump to luminally pressurize the vessel. Under a dissection microscope, break the tip of the cannula so that it is small enough to fit the vessel of interest, but large enough to allow solutions to flow through the tip. Ensure that the tip is roughly 10-15 µm in diameter.",
    "Fill the cannula using a syringe with an attached 0.22 µm filter with oxygenated aCSF. Make sure there are no air bubbles or debris in the cannula.\nAdd two more cannulas to the opposite side of the chamber. Do not break their tips.\n3. Hippocampus dissection and isolation\nEuthanize and decapitate a mouse. For this experiment, use an 8-week-old C57BL6/J mouse to compare differences between males and females. Inject the mouse with pentobarbital and decapitate with surgical scissors.\nUsing small dissection scissors, cut the skin along the midline at the top of its head. Move the skin off to the sides.\nStarting at the caudal side of the skull, cut the skull along the midline until the olfactory bulbs are reached. Remove portions of the skull until the cerebrum is exposed.\nSlowly remove the brain, starting near the nose of the mouse. Separate the brain from the olfactory bulbs, cranial nerves, and spinal cord by cutting through the structures with the small dissection scissors.\nPlace the brain in a dissection plate with enough MOPS solution to completely submerge it. Using a dissection microscope, place the brain in the center of the dissection plate with the ventral side facing down.\nUsing a razor blade, cut the brain in half along the longitudinal fissure. Hold the blade so that the sharp edge is parallel to the bottom of the dissection plate. Press the blade through the brain in one stroke. Move one hemisphere to the side of the plate.\nPerform the following steps for each hemisphere separately or in parallel.\n\t\nPlace one hemisphere in the center of the plate so the midline is facing down. Then use the razor blade to cut along the transverse fissure to remove the cerebellum and brain stem. Push the blade straight through the tissue.",
    "Rotate the hemisphere so that the medial side is facing up (Figure 1A). Use one spatula to hold the brain in place. Using a second spatula, insert the tip below the corpus callosum and scoop underneath to remove the thalamus, septum, and hypothalamus, covering the hippocampus (Figure 1B).\nEnsure that the hippocampus is now visible as a curved structure near the posterior side of the cerebrum. Using one spatula to hold the cerebrum in place, use the second spatula to scoop the hippocampus out of the cerebrum (Figure 1C).\nTransfer the hippocampi to a new dissection plate filled about halfway with MOPS solution. Discard the rest of the brain.\n4. Hippocampal arteriole isolation\nComplete the following steps for each hippocampus.\n\t\nPin down one of the hippocampi using small pins at each end of the section. The hippocampal artery is facing up.\nUsing very sharp forceps, gently stretch small sections of the hippocampus. This will loosen the tissue surrounding the arterioles, making it easier to dissect them.\nSearch through the dorsal hippocampal tissue to identify the external transverse artery (Figure 1C)16,27.\nGently grab the external transverse artery and slowly pull it away from the tissue to collect the arterioles and capillaries perfusing the CA3 region of the hippocampus.\nOnce there are no more vessels to be removed from the tissue, discard the hippocampi. Keep the vessels on ice in plates while not in use.\n5. Hippocampal capillary-parenchymal arteriole cannulation\nFind an arteriole with a branch that ends with capillaries. Transfer it to the organ chamber. Ensure that the arteriole is about 15-30 µm when fully dilated (Figure 1D).",
    "Carefully mount the blood vessel by pushing the cannula tip through the arteriole wall below the target area. Carefully slide the vessel onto the cannula until there is enough tissue to place the tie on.\nMake a loose knot with 12-0 nylon sutures so that it fits over the blood vessel and cannula. Use a half-hitch knot to secure ties. Then pull the ends to tighten the knot and secure the arteriole to the cannula. Remove any extraneous vessel branches below the tie by gently pulling them with forceps.\nMake another tie and secure it on the other end of the arteriole to seal it.\nLower the cannula with the attached vessel until it is flat against the coverslip on the bottom of the chamber. Be careful not to lower the cannula too much or it will break.\nUsing one cannula on the opposite side of the chamber, lower it so that the point of it pins down the tie on the end of the arteriole.\nUse the third cannula to pin down the capillary branch to the coverslip. Place the tip close to the end of the branch while leaving the ends of the capillaries exposed (not underneath the cannula).\n6. Pressure myography\nMove the chamber from the dissection scope to the microscope with the recording software.\nConnect the inflow and outflow tubing to the chamber for perfusion. Start the perfusion with heated aCSF (37 °C) at a flow rate of 4 mL/min.\nAttach the pressurizing cannula to a peristaltic pump paired with a pressure transducer and bring the internal pressure to 20 mm Hg.\nStart the recording software. Adjust the microscope and imaging settings to achieve the clearest image possible. Begin the recording once the settings are optimized for the detection software.",
    "Increase the pressure of the vessel up to 40 mm Hg while recording the arterial diameter with an edge detection software.\nAllow ~15-20 min to wash MOPS solution out of the chamber with aCSF, and to let the HiCaPA preparation to equilibrate and develop myogenic tone.\nTo test the viability of a vessel, apply 1 µM NS309 solution to the bath perfusion (see Figure 2A,B and the Representative Results section). The arteriolar segment must dilate, demonstrating about 30-40% myogenic tone as previously described3,14,20.\n7. Focal stimulation of capillary ends\nOnce the baseline tone for the arteriole has been established and the endothelial function assessed, test the response of capillary stimulation.\nUsing a glass puller, make cannulas so that there is a fine point at one end. Break the tip off a cannula so that the drug tested can flow through the tip smoothly at 5 psi.\nFill the cannula with the drug solution of interest and add it to a 3-axis micromanipulator attached to the microscope. Connect the tubing from the pressure ejection system to the cannula.\nSlowly lower the cannula into the bath near the capillaries, being careful not to hit any part of the vessel or hardware in the chamber. Maneuver the tip of the cannula next to the ends of the capillaries without touching them. Keep the tip of the cannula just off the coverslip to prevent the vessel from being stimulated if the cannula leaks.\nWhen ready to stimulate the capillaries, lower the cannula to the coverslip and just next to the capillaries. Activate the pressure ejection system with the desired ejection time (here 20 s). Once the stimulation is finished, raise the cannula slightly to avoid further stimulation.\nRepeat stimulation as necessary. Change the pressure ejection system cannula to test different drug compounds.",
    "To confirm that only the capillaries are being stimulated, fill the cannula with 1 µM NS309 solution and repeat the above steps.\n\tNOTE: Capillary endothelial cells do not express K+ channels activated by NS309, so the arteriole must not respond to the stimulation. If the arteriole dilates, then the cannula will need to be repositioned or the diameter of the hole will need to be smaller (see Figure 2A,B and the Representative Results section).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}