{
  "id": 13329,
  "origin_website": "Jove",
  "title": "Electroretinogram Recording in Larval Zebrafish using A Novel Cone-Shaped Sponge-tip Electrode",
  "procedures": [
    "All electroretinogram (ERG) procedures were performed according to the provisions of the Australian National Health and Medical Research Council code of practice for the care and use of animals and were approved by the institutional animal ethics committee at the University of Melbourne.\n1. Buffer Preparation\nPrepare the 10x goldfish Ringer’s buffer (1.25 M NaCl, 26 mM KCl, 25 mm CaCl2, 10 mM MgCl2, 100 mM glucose, 100 mM HEPES) using reverse osmosis (RO) water. Adjust the buffer to pH 7.8 and sterilize the buffer using 0.22 μm filter. Store the 10x buffer at 4 °C as the solution stock3.\nNOTE: The 10x Ringer’s buffer should be used within 3 months.\nOn the day of the experiment, make 1x goldfish Ringer’s buffer by diluting the 10x goldfish Ringer’s buffer using reverse osmosis water.\nNOTE: The 1x goldfish Ringer’s buffer is used to saturate the PVA sponge, including the sponge used for the placement of larval zebrafish, and the sponge on the recording electrode tip.\n2. Electrode Preparation\nPrepare the cone-shaped sponge recording electrode.\nCut the male end from the platinum electrode lead extension and remove from the end 10 mm of the outer polytetrafluoroethylene insulation coating using a scalpel blade. Take care not to damage the inner wire of the electrode lead.\nCut a 40 mm length of silver wire (0.3 mm diameter) and securely attach this to the electrode lead by entwining the silver wire with the exposed inner wire. Encase the joint using insulating tape, leaving a ~15 mm length of silver wire exposed (Figure 1A).",
    "Electroplate the exposed silver wire with chloride using a 9 V DC source for 60 s to improve signal conduction. Immerse the exposed silver tip in normal saline and connect the other end to the positive terminal of the battery. Connect another wire to the negative terminal of the battery and immerse the other end of the wire into the saline2.\nNOTE: Alternatively, chlorinate the silver wire by soaking it for 1 hour in a bleach solution (active ingredient 42 g/L sodium hypochlorite).\nCut a ~20 mm x 20 mm square of PVA sponge using scissors to make a cone (Figure 1A). Saturate the sponge using 1x Ringer’s buffer. Under a microscope with a scale bar on the eyepiece, use a scalpel blade to shape the apex of the cone to ~40 µm diameter. Air dry the cone-shaped sponge on absorbent paper tissue until it is solid.\nNOTE: The PVA sponge expands significantly when saturated, thus it is important that the sponge is first saturated with saline before shaping the apex of the cone.\nAfter chloriding, air dry the silver wire on an absorbent tissue for 5 min. Insert the silver wire into the dried, solid, cone-shaped PVA sponge through the base of the cone. Insulate any excess exposed metal using mask tape to reduce photovoltaic artifacts (Figure 1B-C).\nNOTE: After each experimental session, remove the sponge from the silver wire. Wash the sponge using reverse osmosis water and air dry for reuse. To ensure optimal signal collection, single use of silver wire is recommended. PVA sponges should not be reused more than 5 times.\nOn the day of the experiment, immerse the sponge-tip of the recording electrode into 1x Ringer’s buffer for at least 15 min to fully saturate the sponge.",
    "Prepare reference electrodes as described above, but without attaching the sponge tip.\nObtain the ground electrode commercially.\n3. Zebrafish Preparation\nDark adapt zebrafish larvae overnight (>8 h) prior to recordings by placing zebrafish in a 15 mL tube (<20 larvae per tube) wrapped in aluminum foil in a dark incubator. Remove the lid to ensure adequate oxygen supply.\nOn the day of recording, tighten the lid to the foil-wrapped falcon tube containing larvae and ensure that the tube is light-proof. Transport larvae to the ERG lab.\nPour the fish into Petri dishes in the dark with the assistance of dim red illumination from a light-emitting diode (LED; 17.4 cd.m-2, λmax 600 nm). Cover Petri dishes using light-proof towels to minimize light exposure.\n4. Sponge Platform Preparation\nCut a rectangle of dry PVA sponge to fit snugly in a 35 mm Petri dish. Ensure that the thickness of the sponge should be roughly equal to the depth of the petri dish.\nMake a small cut vertically through one end of the sponge to accommodate the silver wire of the reference electrode.\nSoak the PVA sponge in 1x goldfish Ringer’s buffer until saturated. Then, place the sponge in a clean 35-mm petri dish. Use a paper towel to absorb extra liquid until no solution exudes from the sponge in response to a light finger press.\n5. Animal and Electrode Positioning\nAnesthetize the larvae using 0.02 % tricaine diluted in 1x goldfish Ringer’s buffer.\nUse a 3 mL Pasteur pipette to transfer an anesthetized larva onto a square of paper towel (~3 cm2).",
    "Place the paper towel containing the larva on the moist sponge platform using forceps. Use a fine brush soaked in Ringer’s buffer to adjust the position of the larva. Ensure that one eye faces upwards, isolated from any nearby liquid on the square of paper towel underneath the larva.\nGlaze the larval body, excluding the head, with moisturizing eye gel to keep the larva moist throughout the ERG recording.\nPosition the Petri dish with sponge platform on a small water-heated platform in front of the Ganzfeld bowl light stimulus situated inside a Faraday cage (Figure 1D).\nNOTE: Maintenance of the temperature of the sponge and the larval body ensures stable ERG signals.\nInsert the reference electrode into the cut made in the platform sponge (Figure 1D).\nConnect the commercially obtained ground electrode to the Faraday cage.\nAttach the recording electrode to an electrode holder and secure the holder to the stereotaxic arm of a micromanipulator (Figure 1D). Use a 3 mL Pasteur pipette to drip one drop of 1x Ringer’s solution on the sponge tip of the electrode for re-saturation.\nPosition the microscope in the Faraday cage over the ERG platform for placement of the electrode.\nNOTE: Illumination should be provided by a dim red LED (17.4 cd.m-2, λmax 600 nm) to allow observation of the larva and placement of the active electrode, whilst maintaining dark-adaptation.\nAdjust the position of the sponge platform to allow observation of the larva under the microscope. Then, use absorbent tissue to remove excess liquid from the electrode sponge tip.\nPosition the active electrode so that it gently touches the central corneal surface of the larval zebrafish eye (Figure 1E).\nMove the Ganzfeld bowl towards the sponge platform and ensure that the larva is covered by the bowl.",
    "Close the Faraday cage to reduce extraneous electromagnetic noise.\n6. Electroretinogram Recording\nUse the computer software of the particular ERG system (see Table of Materials for details) to trigger the stimulus and acquire data based on the settings recommended below2.\nSet the sampling rate of the system to 4 KHz over a 650 ms recording window (2,560 points) in the acquisition software.\nSet the gain of the system to 1,000×.\nSet band-pass filtering of the system to 1–300 Hz.\nUse a notch filter to reduce 60 Hz (or 50 Hz, depending on local utility frequency) noise.\nNOTE: The ideal noise level should be no more than ±10 µV.\nCommence data collection using the procedure described below.\nUse a single test-flash (0.06 log cd.s/m2) to measure a test response from the eye to assess the positioning of electrodes.\nNOTE: This intensity of test flash should result in a b-wave amplitude greater than 25 µV in 4-dpf larvae. If a robust response cannot be measured, then reposition the electrodes and do another test flash to confirm that electrodes are well positioned.\nFollowing the test-flash, allow the animal to dark adapt for 3 min in complete darkness before recordings.\nPresent flashes from dimmer to brighter light intensities.\nAverage signals across repeats according to the signal-to-noise level.\nNOTE: Generally, average more signals at the dimmer light levels (no fewer than 3 repeats) and fewer at the brighter light levels (usually 1 repeat). Gradually lengthen the inter-stimulus interval from 10 to 60 s from the dimmest to brightest light level. A sample protocol is shown in Table 1.\nAfter the recordings, humanely kill larvae using 0.1% tricaine.\n7. Analysis\nMeasure the a-wave amplitude from baseline to the negative a-wave trough and the b-wave amplitude from the negative a-wave trough to the positive b-wave peak.",
    "Measure the a- and b-wave implicit times from stimulus onset to the trough of the a-wave and the peak of the b-wave, respectively.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}