{
  "id": 18377,
  "origin_website": "Jove",
  "title": "Ultrasound Assessment of Flow-Mediated Dilation of the Brachial and Superficial Femoral Arteries in Rats",
  "procedures": [
    "All animal procedures conformed to the Guide for the Care and Use of Laboratory Animals14 and were approved by the University of Utah and Salt Lake City Veterans Affairs Medical Center Animal Care and Use.\n1. Animal Preparation\nPlace animal in anesthesia induction chamber containing 3% isoflurane in 100% oxygen. Leave the animal in the induction chamber until it is unresponsive to external stimuli.\nRemove the animal from the induction chamber and place it on a heated examination table equipped with electrocardiogram (ECG) electrodes. Maintain anesthesia at 3% isoflurane in 100% oxygen. Brachial and superficial femoral artery FMD cannot be performed simultaneously. Therefore, preparation instructions for each measurement are listed below.\n2. Brachial Artery Preparation\nPosition the animal supine and restrain the left upper limb and each lower limb of the animal to the examination table with surgical tape.\nRestrain the right upper limb of the animal, so that the lower portion of the upper limb is slightly elevated (~0.2-0.5 cm) above the platform.\nApply depilatory agent (e.g., Nair) to the animal's right upper limb to remove hair.\nPosition an occlusion cuff (10 mm lumen diameter standard vascular occluder) on the right upper limb distal to the elbow. Do not rest the occluder on the platform, as inflation/deflation will move the limb and disturb ultrasound imagery.\nSet the ultrasound machine to B-mode using the ultrasound keyboard.\nApply a small amount of ultrasound gel to the upper limb of the animal, proximal to the occlusion cuff.\nManually align an ultra-high frequency linear array transducer attached to a stereotactic holder with the upper limb. The brachial artery should be visible 2-3 mm deep.",
    "To confirm that the brachial artery, not the brachial vein, is being imaged, switch to PW-mode using the ultrasound keyboard. The artery will have pulsatile blood flow as opposed to the adjacent vein which will have continuous blood flow.\n3. Superficial Femoral Artery Preparation\nPosition the animal supine and restrain the upper limbs and the left lower limb to the examination table with surgical tape.\nRestrain the right lower limb of the animal to an elevated position (~0.5-1 cm) above the platform using a pad (e.g., folded paper towels).\nApply depilatory agent (e.g., Nair) to the animal's right lower limb to remove hair. After hair removal the femoral vein should be clearly visible at the upper inner thigh.\nPosition an occlusion cuff (10 mm lumen diameter standard vascular occluder) proximal to the right ankle. Do not rest the occluder on the platform, as inflation/deflation will move the lower limb and disturb ultrasound imagery.\nSet the ultrasound machine to B-mode.\nApply a small amount of ultrasound gel to the lower limb of the animal, proximal to the occlusion cuff.\nManually align an ultra-high frequency linear array transducer attached to a stereotactic holder with the femoral vein, which is visible through the skin. The superficial femoral artery should be visible <1 mm deep.\nTo confirm that the superficial femoral artery, not the femoral vein, is being imaged, switch to PW-mode. The artery will have pulsatile blood flow as opposed to the adjacent vein which will have continuous blood flow.\n4. Baseline Phase",
    "Optimize the B-mode image, similar to how it would be done in humans15. Ensure that a horizontal, longitudinal image of the vessel with intima-media visualized in both walls is observed. Optimize the image by slightly adjusting the ultrasound probe placement to ensure that as much of the artery as possible is viewable in the capture window.\n\t\nAlternatively, adjust ultrasound settings to obtain a better image by changing the brightness/contrast, focal zones, frequency, dynamic range, and line density. There are other ways to optimize the ultrasound image, but detailed description of those are beyond the scope of this protocol.\nAfter optimization of artery imagery, turn on ECG-gating to display only images captured during the R-wave to ensure that only one diameter frame is collected are during each diastolic portion of a cardiac cycle.\n\tNOTE: ECG-gating is available on the ultrasound machine used in this protocol by selecting ECG-gating under the physiological settings option, however, this feature may not be available on all ultrasound machines. ECG-gating should be turned on after the image is optimized, as it is difficult to obtain an image at lower frame rates (i.e., once per R-wave). Without ECG-gating, the combination of a high heart rate in rats and requirement of a high frame rate to capture the diastolic portion of the cardiac cycle only allows for ~10-20 second clips. The cumbersome size and amount of data in each clip increases the analysis burden substantially.\nRecord 60 seconds of baseline data using B-mode.",
    "NOTE: The ultrasound machine is always recording, however, not all images are stored on the ultrasound machine, as there is a limit on the number of frames that can be recorded in an ultrasound clip. The clip length (i.e., number of frames) can be adjusted in the settings. It is suggested to set for maximum number of frames per clip. When the recording is at the end of a clip (i.e., maximum number of frames reached), the recording continues, but the clip rolls forward capturing the most recent frames. In this case, earlier frames that were captured outside of the maximum frame limit are subsequently deleted. While these intricacies in recording differ between machines, adjustment of recording length may be necessary.\nSwitch to PW-mode. Place the cursor in the middle of the lumen. Sample gates will be placed automatically in reference to the cursor, but can be adjusted for width using the ultrasound keyboard. Maintain an insonation angle of ≤60°.\n\t\nAdjust the insonation angle by altering the Doppler beam angle. Make fine adjustments to the angle by using the ultrasound keyboard. If neither of these provide an angle suitable for measurement, manually adjust the ultrasound probe by tilting the artery to a more optimum angle. If any adjustment of the ultrasound angle is performed, recapture B-mode images.\nRecord 10 seconds of velocity data.\n5. Occlusion Phase\nInflate the vascular occluder using an air-filled 10 ml syringe. To keep air pressure constant in the vascular occluder, fold the tube on itself and place a binder clip on the folded tube.\nSwitch to PW-mode to confirm cuff occlusion, as evidenced by a large reduction in blood velocity.\nSwitch to B-mode and record data in 60 second clips, until 4:45 min of occlusion.",
    "Switch to PW-mode. Keep a record of heart rate and the time of each ultrasound clip for analysis.\n6. Hyperemic Phase\nRelease the cuff while recording in PW-mode by removing the binder clip from the folded tube. Record 5 seconds prior to and 5 seconds after cuff release.\nSwitch to B-mode and record data in 60 second clips until 3 minutes after occlusion. Keep a record of heart rate and the time of each ultrasound clip for analysis.\nAfter completion of FMD remove the animal from the examination table and monitor until it has regained sufficient consciousness to maintain sternal recumbency.\n7. Analysis\nFor analysis, export ultrasound as DICOM files to an offline computer equipped with edge-detection software, which allows for unbiased determination of artery diameter at each frame. Analysis is possible on the ultrasound machine, however, it not recommended, as it is extremely time intensive and subject to investigator bias.\nAnalyze artery diameter data in 60 second segments during baseline and occlusion phase, and in 10 second segments during the hyperemic phase.\nAnalyze blood velocity data using the flow analysis capabilities of the automated edge-detection software. Determine average blood velocity by measuring 5 or more consecutive waveforms of uniform appearance during baseline and occlusion phases. Determine average blood velocity during reactive hyperemia for blood velocities immediately after cuff release. The waveform with highest blood velocity is considered peak blood velocity.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}