{
  "id": 18369,
  "origin_website": "Jove",
  "title": "Isolation and Culture of Primary Endothelial Cells from Canine Arteries and Veins",
  "procedures": [
    "Ethics statement: Blood vessels used in this study were harvested as surplus material obtained from fresh canine cadavers (n= 4) from healthy dogs euthanized for other unrelated research (University 3R policy). Aberrant blood vessels (intra- and extrahepatic portosystemic shunts, n= 1 each) were harvested post-mortem after informed consent of the owners from dogs presented to the University Clinic for Companion Animals of Utrecht University.\n1. Isolation and Culture of Primary Canine Endothelial Cells\nPre-coat 6-well plates with 2 ml/well 0.5% w/v gelatin and leave for 2 hr in an incubator with a humidified atmosphere of 5% CO2 at 37 °C. Remove excess gelatin solution prior to seeding the primary cells.\nAseptically remove the blood vessel(s) of interest (e.g., aorta, vena cava, vena porta) from a fresh canine cadaver (Figure 1A). Maintain the anatomy of the vessel system by placing straight forceps on both ends of the vessel of interest. Avoid unnecessary manipulation of the tissue with forceps to prevent damage to the endothelial cells.\n\t\nCut the clamped vessel on both ends with surgical scissors and remove from the cadaver. Transport in Hank's Balanced Salt Solution (HBSS) on ice.\n\t\tNOTE: A vessel length of approximately 5 cm is preferred for this procedure, but those that measure 1 cm will also provide enough cells to culture.\nTransfer the blood vessel to a Petri dish filled with ice-cold HBSS. Using surgical scissors, remove any adherent tissue and fat from the outside of the vessel, keeping the vessel itself intact (Figure 1B). Make sure the vessel is clearly visible at all times when cutting: pull aside the surrounding tissue with a clamp or forceps for optimal view.\n\t\nClose any branches of the vessel with ligatures (e.g., polyglactin 3-0) and subsequently remove them with surgical scissors or a scalpel.",
    "Carefully enter a vessel end with a curved Halsted mosquito forceps, clamp the tip of the forceps at the other end of the vessel and then retract, slowly inverting the vessel until it is completely inside out (Figure 1C-G). The outside now consists of the endothelial cell layer. If any difficulty is encountered upon inverting the vessel, submerge in HBSS again to reduce friction.\nPlace purse-string sutures at both ends of the vessel to close it completely and to prevent exposure of any non-endothelial vascular tissue to the digestion procedure (Figure 1H). Use the ligature ends to manipulate the inverted vessel.\nIf digestion and culture is performed later, cryopreserve the inverted vessel prior to the digestion protocol (step 1.7).\n\t\nPlace the inverted vessel in a cryovial and fill with cell culture freezing medium. Freeze down to -80 °C using a freezing container. Store at -80 °C if vessels are to be used within one week. For long term storage, place cryovials at -180 °C. When performing the EC isolation, thaw the cryovials rapidly in a water bath (37 °C) and immediately place in ice-cold HBSS. Proceed as indicated in 1.7.\n\t\tNOTE: Take into account that the total yield of ECs after isolation will be lower due to loss of viability during the freezing process.\nTransfer the vessel to a 50 ml tube and rinse it twice in HBSS to remove erythrocytes (or residual freezing medium in case of thawing) (Figure 1I).\nDigest the vessel in a 50 ml tube with a solution of 30 ml collagenase type II (0.15 U/ml) and dispase (0.15 U/ml) in Canine Endothelial Cells Growth Medium (CECGM) for 1 hr at 37 °C with intermittent gentle agitation.\nRemove the vessel from the tube and centrifuge the cell suspension for 5 min at 250 x g.",
    "Resuspend the cell pellet in CECGM and seed 2 ml cell suspension per well (1 - 3 wells depending on vessel size). Culture the cells at 37 °C in a humidified atmosphere with 5% CO2 in air and change the culture medium twice a week.\nPassage the cells when a confluency of 70 - 80% is reached.\n\t\nWash the cells with pre-warmed HBSS to remove dead or non-attached cells. Add 200 µl recombinant cell-dissociation enzyme (1x) to each well and place back in the incubator for 5 min or until all cells are detached.\nTransfer the cells to a 15 ml tube and stop trypsinization by adding 10 ml of culture media (CEGM) including 10% Fetal Calf Serum (FCS). Centrifuge for 5 min at 250 x g. Continue the culture in a gelatin pre-coated plate or flask.\n2. Characterization\nCulture Canine Aortic Endothelial Cells (CnAOECs) and compare the morphology of the primary and commercial cell lines twice weekly with a microscope.\n\tNOTE: The typical growing pattern of ECs in patches can best be observed when a confluency of > 70% is reached.\n\t\nCulture CnAOECs in CECGM on a 0.5% w/v gelatin pre-coated T75 flask. Passage cells once a week when the confluency is 70 - 80%.\n\t\t\nFor passaging, wash the cells once with pre-warmed HBSS and add 1 ml recombinant cell-dissociation enzyme (1x). Place the flask back in the incubator for 5 min or until all cells are detached. Inactivate trypsin by adding 10 ml culture medium (CEGM) including 10% FCS. Centrifuge the cell suspension for 5 min at 250 x g, discard the supernatant and resuspend the cells in 1 ml culture medium.",
    "Take a 10 µl aliquot of the cell suspension and dilute 1:1 with 0.4% trypan blue. Count the cells using an automated cell counter, and plate out 4.0 x 105 viable cells in a new T75 flask. Add 10 ml of pre-warmed CECGM to the flask and culture at 37 °C in a humidified atmosphere with 5% CO2.\nIsolate RNA from passage 1 of the cultured CaPECs and CnAOECs.\n\t\nCollect at least 1 x 103 cells as a pellet, add 20 µl of sample preparation reagent (SPR) and incubate for 1 min to lyse the cells. After incubation, carefully collect the cell lysate containing total RNA and store at -70 °C.\nConvert mRNA to cDNA using a cDNA synthesis kit (e.g., iScript) following the instructions of the manufacturer. Store cDNA at 4 °C up to one week, or at -20 °C for long term until ready to perform the qPCR.\nMeasure gene expression of the endothelial marker CD31 to confirm endothelial cell origin. Perform experimental setup and quantification using the MIQE précis guidelines10. For normalization, measure expression of reference genes GAPDH, RPS19, and B2MG11.\n\t\nPrepare a 10-fold dilution of the obtained cDNA in nuclease free water.\nPrepare a 4-fold dilution from pooled cDNA samples for the standard line and use nuclease free water as a non-template control. Dilute the samples five times to reach a 50-fold total dilution for qPCR reactions. Pipette 10 µl reactions in duplicate in a 384-well format using 4 µl cDNA and 6 µl of the fluorophore mixed with 20 pmol of reverse and forward primer (Table 1).",
    "Set the program to 95 °C for 5 min for Taq polymerase activation, followed by 39 cycles of 10 sec at 95 °C for denaturation, and 30 sec at Tm for annealing and elongation. The Tm for each primer set is shown in Table 1.\nPerform melting curve analyses following every run to ensure only one product is amplified. Normalize the expression levels of the samples using the average relative amount of the reference genes, and calculate the ΔCt if reaction efficiency is between 95% and 105%.\nAssess EC functionality with an angiogenesis assay.\n\t\nAdd 10 µl of extracellular matrix to each well of a pre-cooled angiogenesis slide and spread with a pipette tip to cover the surface of the well. Keep the extracellular matrix on ice and avoid the introduction of air bubbles into the gel. Solidify the gel by placing the slide in a Petri dish with water soaked paper towels in an incubator at 37 °C with 5% CO2 for 30 min.\nAdd 1.0 x 104 primary ECs in 50 µl Endothelial Growth Medium per well. Incubate the slide for 6 hr at 37 °C with 5% CO2.\nAfter 6 hr take photographs with a 20X magnification, making sure to include the whole well in the image.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}