{
  "id": 13386,
  "origin_website": "Jove",
  "title": "Nanoparticle-mediated siRNA Gene-silencing in Adult Zebrafish Heart",
  "procedures": [
    "All animal procedures used a zebrafish protocol approved by the Institutional Animal Care and Use Committee at Peking University, which is fully accredited by Association for Assessment and Accreditation of Laboratory Animal Care.\n1. Preparation of Tricaine Solution\nTo prepare tricaine stock solution, add 400 mg ethyl 3-aminobenzoate methanesulfonate powder to 97.9 mL distilled water, and then add 2.1 mL of 1 M Tris (pH 9.5) to adjust the pH to ~7. Store the stock solution at 4 °C.\nTo prepare tricaine working solution, add 4.2 mL tricaine stock solution to 100 mL aquarium system water.\n2. Adult Zebrafish Ventricular Resection\nPrepare instruments and materials for the surgery which include a piece of sponge, a Petri dish filled with tricaine working solution, a plastic pipette, a stereomicroscope, two sharp forceps, iridectomy scissors, and elbow tweezers (Figure 1).\nPrepare a small groove of the size of 4 cm x 0.5 cm and 0.5 cm in depth on a sponge to hold the zebrafish during the ventricular resection surgery.\nFill a 3 L zebrafish tank with half a tank of zebrafish system water that is made by using 60 mg/L sea salts in dH2O for the recovery of the injured fish.\nAnesthetize the fish in a 10 cm Petri dish with tricaine solution until the gill movements decrease to one per second and keep the fish for at least 30 s to ensure that it is fully anesthetized.\nTransfer the anesthetized fish with the elbow tweezers to the groove in a moist sponge ventral side up. Visually locate the margin of the beating heart, and then locate the heart under a stereomicroscope.",
    "Use the iridectomy scissors to make a small incision of about 1 mm that penetrates the skin and muscles, and carefully tear the silvery epithelial layer of the pericardial sac with the forceps tips to access the heart. Do not insert the forceps too deep into the cavity to avoid the heart injury.\n\tNOTE: At this point, keep in mind to avoid extensive bleeding. Exclude the fish from the experiment if extensive bleeding occurs, since the excessive bleeding is mainly caused by the accidental injury to the heart and so will result in misleading results.\nExpose the ventricle by gently holding its apex with sharp forceps using the non-dominant hand or by applying gentle abdominal pressure. Then, with the other hand, remove ~20% of the ventricle at the apex using the iridectomy scissors.\n\tNOTE: No extensive bleeding should occur at this point.\nUse a wet napkin to cover the incision, as the wounds bleed profusely for 15–45 s before clotting, and then put the fish back into the tank with system water.\n\tNOTE: It is not necessary to suture the incision.\nMake sure that the fish regains gill movements within 1 min and then resumes swimming. If the fish does not show gill movements after 50 s in water, facilitate it by squirting water into the gills using a plastic pipette until the fish resumes active ventilation.\nMaintain the fish in the recycle system after the ventricular resection.\n\tNOTE: No special cares are necessary compared with the normal fish. The death rate of adult zebrafish ventricular resection is about 5–10%. Almost all death happens within 24 h after the surgery.\n3. Preparation of siRNA-encapsulated Nanoparticles\nSynthesize the f-PAM4-PEG-R9 dendrimer.",
    "NOTE: The synthesis of f-PAM4-PEG-R9 dendrimer materials was performed as described previously37 with some modifications. The length of α, ω-dipyridyl disulfido polyethylene glycol (Py-PEG-Py) were reduced to a molecular weight of 1,000 to maximize the encapsulation of siRNAs (Figure 2B).\nDry 10 mg of the cystamine core of G4.0 polyamidoamine (termed PAMAM) using vacuum dryer at 45 °C for 1 h and then dissolve the PAMAM in 2 mL Dulbecco's phosphate-buffered saline (DPBS, a balanced salt solution used for a variety of cell culture applications).\nDissolve 1.7 mg tris(2-carboxyethyl) phosphine (TCEP) in 1 mL DPBS, mix with the PAMAM solution prepared in 3.2 and leave at room temperature with gentle stirring for 8 h.\n\tNOTE: TCEP is ten-fold in molar ratio excess to the disulfide bonds of the PAMAM.\nRemove excessive TCEP by ultrafiltration. Add DPBS to the above PAMAM-TCEP mixture to reach the volume of 10 mL and the solution is transferred into a 3 kDa MWCO (molecular weight cut off) ultrafiltration tube. After the centrifugation at 3,000 g for 15 min, discard the solution in the collection tube. Add DPBS to the filter device up to 10 mL and gently pipette the sample multiple times and centrifuge again. Repeat this step for 4 times. After the last filtration, aspirate the sample from the filter device.\n\tNOTE: The product of this step is reduced PAMAM (termed f-PAM4).\nDissolve 14 mg Py-PEG-Py in 1 mL DPBS, mix with the f-PAM4 solution and leave it with gentle stirring at room temperature for 3 h. Then remove the excessive Py-PEG-Py by the ultrafiltration step as described in 3.4. After the last filtration, aspirate the sample from the filter device.",
    "NOTE: The product is named as f-PAM4-PEG-Py. The amount of Py-PEG-Py is 10-fold in the molar ratio to the thiol groups in the f-PAM4.\nDissolve 6.4 mg of Cysteine terminated R9 Peptide (Ac-CRRRRRRRRR-NH2) in 1 mL DPBS, mix with f-PAM4-PEG-Py and gently stir for 8 h at room temperature. Purify the final product, called f-PAM4-PEG-R9, by the ultrafiltration step as described in 3.4 except that DPBS is changed to deionized water. Lyophilize the product by using a freeze vacuum dryer.\n\tNOTE: The products in 3.5 and 3.6 before lyophilization are stored at -20 ℃ for at least 1 month. After the lyophilization of f-PAM4-PEG-R9, the samples are stored at -20 ℃ for at least 2 months.\nTo determine the degree of PEG and peptide modification, dissolve 5 mg of the f-PAM4-PEG-Py in the D2O (Deuterium oxide) and transfer it into the NMR (Nuclear Magnetic Resonance) sample tube. Perform 1H-NMR spectral analysis at 400 MHz and analyze the data using NMR data analysis software37.\n\tNOTE: Specifically, the representative PAMAM peaks (-NCH2CH2CO-), PEG peaks (-OCH2CH2-), and arginine residue peaks (-HCCH2CH2CH2NH-) in the peptides are expected to be in the ranges 2.4–2.6, 3.7–3.8, and 1.6–1.8 ppm, respectively. Determine the degree of modification of the PEG and R9 relative to the PAMAM by calculating the integrals of the PEG and R9 peaks to the PAMAM peaks. The modification degree of PEG is 100% and the R9 modification is at least 50%. The 1H-NMR spectral analyses are performed in the core facility of the institution.\nDissolve the f-PAM4-PEG-R9 dendrimer powder in PBS to 4 mg/mL and make aliquots of the solution for one-time use.\n\tNOTE: The dendrimer solution can be stored at -20 °C for at least one month, without repeated freezing and thawing.",
    "Dissolve the cyanine dyes-labeled siRNAs (termed Cy5-siRNA), Aldh1a2 siRNA or scrambled negative control siRNA in distilled water to 10 µM.\n\tNOTE: Use the cyanine dyes-labeled siRNAs to evaluate whether the nanoparticle encapsulated siRNA can enter the fish heart (Figure 2A-B). This protocol takes aldh1a2 as an example gene to determine the efficiency of delivery of f-PAM4-PEG-R9 dendrimer-encapsulated siRNA. The sequences of the siRNAs are: Cy5-siRNA antisense strand: 5′-ACGUGACACGUUCGGAGAAdTdT-3′, siAldh1a2 antisense strand: 5'-UUCAGGACAACCGUGUUCCdTdT-3' and scrambled negative control siRNA antisense strand: 5'-ACGUGACACGUUCGGAGAAdTdT-3'.\nTo prepare the siRNA-encapsulated nanoparticle solution, mix siRNA with an equal volume of dendrimer solution, and incubate the sample at room temperature for 20 min. Freshly prepare the siRNA-nanoparticle solution before use.\n\tNOTE: The volume of siRNA-encapsulated nanoparticle solution depends on the number of fish going to be injected. For example, prepare at least 120 µL dendrimer solution (mix 60 µL siRNA solution and 60 µL dendrimer solution) for the injection of 10 fish (~10 µL per fish), counting in the loss of solution.\n4. Injection of siRNA-encapsulated Nanoparticles into Adult Zebrafish Heart\nAs described above, prepare a piece of sponge with a groove, a 10 cm Petri dish filled with tricaine solution, a plastic pipette, a stereomicroscope, elbow tweezers, and an insulin syringe (Figure 1), as well as a fish tank with system water for housing the fish after injection.\nAllow the injured zebrafish prepared in steps 2.1–2.10 to recover for 1 day after ventricular resection, and then anesthetize the 1 dpa (days post-amputation) fish in tricaine solution as described in 2.4.\nTransfer the anesthetized fish, ventral side up, to the groove in the moist sponge using the elbow tweezers. Locate the beating heart under the stereomicroscope.\nLoad 10 µL of the siRNA-encapsulated nanoparticle solution into the insulin syringe. Avoid bubbles as much as possible.",
    "Immobilize the fish by gently using the elbow tweezers to hold the thoracic region with the non-dominant hand. Do not clamp the fish too tightly.\n\tNOTE: Keep in mind that no extensive bleeding should occur during the injection.\nHold the filled insulin syringe at ~30° and inject ~10 µL of solution into the thoracic cavity using the other hand (Supplemental Figure 1).\n\tNOTE: The solution sometimes flows out during the injection, but this does not affect the siRNA effect. The siRNA-nanoparticle solution can be injected once a day for several days to one month, depending on a specific experimental plan. Inject a fish with one type of siRNA each time. If more than two types of siRNA need to be injected into one fish, inject one type of siRNA each time, and then inject another type of siRNA 1 h later. In this protocol, only one type of siRNA per fish was injected.\nTransfer the fish to the tank with the system water.\n\tNOTE: The fish are expected to restart ventilation within 1 min, and then resume swimming. The injection of siRNA-encapsulated nanoparticles or siRNA normally does not cause death in adult zebrafish.\n5. Heart Collection, Fixation, and Evaluation of the Efficiency of siRNA Delivery\nPrepare 1 mL of 4% paraformaldehyde solution in a microcentrifuge tube for each group.\nAnesthetize the fish in tricaine solution at selected days after injections. Place the fish supinely into the groove in a moist sponge. Make a large incision in the thoracic region and open widely with the tweezers. Grip the outflow tract and pull out the whole heart carefully with the tweezers.",
    "Rinse the heart with PBS and rapidly remove extra liquid with a napkin. Put up to 10 hearts into a 1.5 mL microcentrifuge tube with 1 mL paraformaldehyde. Gently invert the tube several times, and keep overnight at 4 °C.\nMeasure the fluorescence intensity of Cy5-siRNAs-injected hearts using the in vivo imaging system (Supplemental Figure 2). Use 3–4 zebrafish hearts for each group in this study.\nMount the fixed hearts with either paraffin or OCT compound (Embedding Medium for Frozen Tissue Specimens to ensure Optimal Cutting Temperature).\n6. Evaluation of Nanoparticle-mediated siRNA Gene-silencing\nPrepare an insulated container and long tweezers. Pour in liquid nitrogen to a third of the volume of the container.\nAnesthetize the fish in tricaine solution at 2 dpa. Dissect the hearts as described in 5.2, and then remove the outflow tract and atrium.\n\tNOTE: The fish can recover from the surgery in one day and then injected at 1 dpa with either scrambled siRNA-encapsulated nanoparticles (siNC) as a negative control or aldh1a2 siRNA-encapsulated nanoparticles (siAldh1a2).\nTransfer the ventricles into a 1.5 mL microcentrifuge tube using the tweezers, cover the tube lid, and immediately place the tube into the insulated container with liquid nitrogen. Let the tubes float on the liquid nitrogen for a few min. Use the long tweezers to remove tubes from the container.\nRepeat steps 6.2 and 6.3 until all ventricles are collected. Use 6–10 hearts for each group.\nExtract the total RNA of hearts with RNA isolation reagent.Assess the expression levels of the respective genes by quantitative RT-PCR using primers Gapdh F: GATACACGGAGCACCAGGTT; Gapdh R: GCCATCAGGTCACATACACG; Aldh1a2 F: TGAGCGAGGAGCAGCAGAGA; Aldh1a2 R: TCCACGAAGAAGCCTTTAGTAGCA.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}