{
  "id": 14266,
  "origin_website": "Jove",
  "title": "Trace Fear Conditioning in Mice",
  "procedures": [
    "The mice used in the following experiment were generated and housed at Baylor University at an ambient temperature of 22 °C, with a 14 hr light and 10 hr dark (20:00 to 6:00 hr) diurnal cycle. The mice were given ad libitum access to food and water. All procedures to the mice were in compliance with the National Institutes of Health Guidelines for the Care and Use of Laboratory Animals and the animal protocol was approved by Baylor University Animal Care and Use Committee.\nOverview\nThe trace conditioned fear task is based on procedures described by Wiltgen and colleagues9.\n1. Preparation of Equipment\nThe fear conditioning apparatus chamber (26 cm x 22 cm x 18 cm) consists of two sides that are acrylic, two sides that are metal, and a grid floor bottom which is used to deliver a mild foot shock. The testing chamber is housed in a sound attenuated chamber. The chamber is also light tight to prevent outside light from influencing the motion detection software.\nCalibrate the shock levels, light levels, and sound intensity levels for the testing chamber. Measure the background level of the testing chamber. The background noise in this chamber is 65 dB. Use a sound meter to measure this level. The meter should be set to 70 dB, set to C, and to detection setting slow.\n\t\nCalibrate the shock level to 0.5 mA. Use an external calibration device to correctly calibrate the shock level (see Materials Table). The internal measurement of the shock generator is not accurate. The shock generator administers a scrambled shock which cannot be accurately measured by a standard amp meter.",
    "Place one lead on one of the grid bars and place the other lead 3 or 4 bars over. Use the shock generator to administer the shock. Adjust the shock level until the correct level is achieved. Do this for each fear conditioning chamber.\nClose the door to the chamber when measuring the light level of the chamber. Calibrate the light level to approximately 1.0. This is a number specific to the FreezeFrame software used in this experiment. An external light meter will read this as 2 lux. The light level can be adjusted by moving the location of the house light or by adjusting the condenser of the lens. Make sure to tighten the adjusting screws for the lens after adjusting.\nCalibrate the sound decibel level to 85 dB. Use an external decibel meter inside the testing cage to calibrate the decibel level (see Materials Table). The sound presented will be a 2,700 Hz tone. Note: If using mice older than 6 months old it may be better to use white noise since older mice can have hearing deficits .\nAfter the apparatus is ready take the subjects to a separate holding room. Note: Do not house the mouse in the same room as the testing room.\nLabel the tail of the mice that will be tested in order of testing. It is best to reduce excessive handling before testing. Alternatively, the tails can be labeled the day before the experiment to reduce handling stress. After the mice have been labeled allow them to acclimate to the room for 30 min. Have extra clean cages for housing the mice after testing is completed.\n2. Trace Conditioning Day 1",
    "Remove each mouse from the cage and place them in individual cages for transport to the fear conditioning chamber. Use clean bedding for each cage. Place a sticky note on the transfer cage to keep the order of mice testing correct. Note: If the mice are singly housed then they can be transported in their home cage.\nPlace the mouse in the testing chamber and close the door. Start the software program.\nOn the training day, allow the mice to explore the chamber for 3 min. The software then presents a 20 sec tone (85 dB, 2,700 Hz) to the animal. After a trace period of 20 sec a mild shock (2 sec, 0.5 mA) is administered to the animal.\nRecord the reaction of the subject to confirm that they received the aversive stimuli by viewing the video. A 200 sec inter-trial interval separates the 5 conditioning trials. Each trial consists of a 20 sec tone followed by a 20 sec delay then a shock.\nAfter testing is completed allow the animal to remain in the testing chamber for 1 min before removing it from the testing cage.\nPlace the animal back in the transfer cage and return it to its home cage. If there are additional mice in their home cage then individually house the mouse until all mice complete testing. This will reduce the stress to the other mice that have not been tested. An alternative solution would be to singly house all mice one week prior to testing to reduce the influence of continuously removing mice from one cage.\nClean the testing chamber with 30% isopropanol after each animal is tested.\nRepeat steps 2.2-2.7 for all mice in the testing cohort.",
    "Return all mice to their colony room after the last mouse in the cohort has been tested.\n3. Trace Fear Conditioning Day 2: Trace Memory Testing\nTrace memory testing will occur on day 2. In this protocol there are 3 tone presentations. Place the mice in a new context for the trace conditioning test.\nPrepare the software to run a program with a 2 min baseline period followed by three 20 sec tone presentations. There is s a 220 sec ITI between each tone presentation.\nFor the new context condition, place clear acrylic inserts on the floor of the chamber to alter the shape, texture, and color of the conditioning chamber.\nChange the odor in the chamber by placing vanilla extract in a weigh boat under the floor insert.\nClean the chamber with 70% ethanol instead of 30% isopropanol. Note: This will help to create a novel context.\nBring the mice to the holding room and relabel their tails for testing if necessary.\nPrepare novel context transfer cages by replacing the bedding with shredded paper. Note: This will help in creating a novel context.\nPlace the mice in the testing chamber then start the program. Clean the chamber with 70% ethanol after testing is completed.\nReturn the mice to their home cage after the trace conditioning is completed. Return all mice to their colony room when all mice have been tested.\n4. Trace Fear Conditioning Day 3: Contextual Memory Testing\nOn the third day contextual conditioning is conducted. Prepare the software to run a program to record freezing behavior for 8 min.\nClean the chamber with 30% isopropanol before testing and after testing each mouse. The context should be identical to that of day 1. The transfer cages should be the same as in day 1.",
    "Bring mice to the holding room and label their tails for testing.\nPlace each mouse in the testing chamber then start the program. Clean the chamber with 30% isopropanol after testing is completed.\nReturn all mice to their colony room when completed.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}