{
  "id": 5878,
  "origin_website": "Bio",
  "title": "Lentiviral Knockdown of Transcription Factor STAT1 in <em>Peromyscus leucopus</em> to  Assess Its Role in the Restriction of Tick-borne Flaviviruses",
  "procedures": [
    "Design and cloning of short hairpin RNA (shRNA) into lentiviral vectorsOur group recently resolved and published the sequence of STAT1 in the reservoir species P. leucopus (Izuogu et al., 2017) with accession number KY451962. Based on the gene sequence, the oligonucleotides for knockdown were designed and cloned as described below; A flowchart describing the process of oligonucleotide processing and generation of lentiviral vectors is represented in Figure 1.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171130/20171130190829_6996.jpgFigure 1. Construction of lentiviral plasmids. A. Schematic representation of P. leucopus STAT1 showing the regions targeted for knockdown. B. Workflow of procedure to generate lentiviral expression vectors with shRNA to P. leucopus STAT1.Upload the complete sequence to the Invitrogen primer design software (or equivalent) and generate oligo candidates for shRNA design. Regions around the beginning, middle and end of the gene are targeted to ensure complete transcript coverage and avoid off-target effects. Candidates selected are shown in Table 1 and Figure 1A.Table 1. Oligonucleotide sequences utilized for gene knockdown. shRNA top and bottom strand sequences designed to target 3 distinct regions of the P. leucopus STAT1 gene. No special conditions were specified in the primer order.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171130/20171130190956_5111.jpgAs a control, design non-specific oligonucleotides to create lentiviral vectors that will not result in knockdown. An shRNA that targets the GFP sequence was used for this purpose in our study (see Table 1). Since GFP is not expressed in the cells of interest, the control cell lines should be transcriptionally equivalent to the background, non-transduced cells. Anneal the top and bottom strands by mixing oligonucleotides in equal proportion (200 μM each) and subjecting to high temperature (95 °C) for 4 min according to the manufacturer’s annealing protocol for the BLOCK-iT U6 RNAi Entry Vector Kit (Thermo Fisher scientific). After the heating process, immediately transfer the samples to the bench and allow for cooling to occur slowly.",
    "This process will generate double-strand shRNA.To confirm the annealing step, resolve the samples on a 4% agarose gel (immersed in 1x TAE buffer) alongside a 100 bp ladder by adding equal volume of each sample (10 μl) to single wells and running at 100 V. Transfer the gel to a transilluminator to visualize double-strand oligonucleotides compared to the single-strand samples (Illustrated in Figure 1B).After the double-strand is confirmed by agarose gel electrophoresis, proceed with the annealed samples and ligate the resultant shRNA into the U6 vector to generate an entry vector for further cloning. The U6 vector is contained within the BLOCK-iT U6 RNAi Entry Vector Kit (Thermo Fisher Scientific) and all manufacturers’ recommendations were adhered to.Recombine the entry vector into a lentiviral destination vector that can be delivered into mammalian cells. In this study, we utilized the pLENTI X2- DEST vector (Campeau et al., 2009) for Gateway cloning with the Gateway LR Clonase II Enzyme Mix according to the manufacturer’s protocol with the exception that recombination was allowed to proceed overnight.Transform chemically-competent One ShotTM TOP10 Chemically-Competent E. coli bacteria cells with the recombined DNA and select colonies for DNA extraction to obtain pure plasmid DNA. Generation of LentivirusesSet up 293T cells at 3,000,000 cells per well in a 6-well dish and grow overnight.Transfect cells with purified lentiviral plasmids targeting the individual regions of the gene of interest and the non-specific (GFP) sequence. Importantly, include a pool of DNA containing 1 μg of lentiviral vectors targeting each region into a single transfection tube. Therefore, prepare a single tube for shRNA targeting each region of interest and an additional tube with all shRNA candidates pooled together in one tube.",
    "Add 1 μg of ViraPower Lentiviral Packaging Mix along with plasmid DNA and complete transfection using Lipofectamine 3000 Transfection Kit according to the manufacturer’s protocol. Pipet slowly onto cells to avoid detachment.At 24 h post-transfection, replace the transfection media with fresh DMEM containing 10 mM sodium butyrate, 2 ml total volume was suitable for a 6-well dish in our studies.Incubate the cells for another 48 h without perturbing the culture dishes. Collect supernatants containing the newly-generated lentiviruses. Confirm the presence of lentiviruses by running a rapid test using Lenti-X GoStix (use 20 µl sample supernatant followed by three drops of the kit running buffer and allow time for bands to develop). Lentiviral supernatants were not filtered.Store the lentivirus stock at -80 °C until needed.Transduction of P. leucopus cells with STAT1 shRNA-expressing lentivirusesSet up P. leucopus fibroblasts at 300,000 cells per well in 6-well dishes and incubate overnight.Infect the cells with 1 ml of the lentivirus stock and add 8 µg polybrene (diluted from a stock solution prepared in sterile water).At 1 h post-transduction, add another 1 ml of culture medium with 8 µg polybrene. 24 h later, re-transduce the cells and treat with 8 µg polybrene.On day 2, remove the lentiviral inoculum and replace with fresh culture medium. At day 3 post-transduction, add the appropriate antibiotic selection (400 µg/ml hygromycin was used for P. leucopus fibroblasts). Maintain the cells in selection for 1 week and sub-clone to obtain clonal cells by splitting single cells into each well of 48-well dishes and observe for cell proliferation in individual wells over 1-2 weeks.Expand clonal cells into large flasks (175 cm2) and proceed to test for gene knockdown.Assessing gene knockdown in transduced cell linesOur studies have demonstrated that STAT1 expression is upregulated in P. leucopus following treatment with IFN-β (Izuogu et al.",
    ", 2017). Hence, in order to determine if the gene of interest is knocked down, the cells are treated with IFN and probed for gene induction.Set up the STAT1 knockdown (KD) and NS KD P. leucopus fibroblasts at 1,000,000 cells per well and incubate overnight.Treat the cells (or not) with 1,000 international units (IU) mouse interferon beta (mIFN-β) for 8 h and harvest samples to test for knockdown as follows:By SDS-PAGE and Western blot Remove the cellular supernatant and wash the cells 2 x with PBS buffer. Add 500 µl of RIPA buffer (see Recipes) and scrape the cell monolayer gently. Pipet a few times and transfer the sample to Eppendorf tubes.Incubate the samples with 50 µl 1x DNase I buffer (see Recipes) for 30 min at 37 °C.Centrifuge at max speed for 10 min, collect supernatant and mix with 6x SB to achieve 1x SB (see Recipes). Load equal amounts of protein on 10% SDS gels and resolve at 150 V for 1.5 h.After the electrophoresis step, transfer the proteins to PVDF membranes using the iBLOT transfer apparatus for 7 min.Incubate the membranes with Western blot blocking solution (see Recipes) while rocking for 1 h at room temperature (RT).Probe the blots with specific antibodies to STAT1 and phosphorylated STAT1 (STAT1-P) for 16 h at 4 °C on a rocker and wash 3 x in PBST for 5 min.Incubate with secondary antibodies conjugated to HRP while rocking for 1 h at RT. Wash 3 x in PBST for 10 min. Perform a final wash with PBS for 5 min, incubate membranes with ECL-plus reagents for an additional 5 min and utilize an automated film processor to visualize protein expression. Figure 2A shows Western blot results for STAT1 KD.",
    "By qRT-PCR Remove cellular supernatant and wash the cells 2 x in PBS. Harvest cell lysates according to RNA extraction protocol. In this study, cells were collected in 350 µl of cell lysis buffer (RLT buffer included RNeasy mini kit) and RNA extraction was performed using the RNeasy mini kit according to the manufacturer’s protocol, including the DNase treatment step using the RNase-free DNase set (QIAGEN).Quantify the RNA and normalize the concentration to ensure an equal amount of RNA between all the samples.Perform cDNA synthesis using an equal amount of RNA template (1 µg was used). Our study utilized the QuantiTect Reverse Transcription Kit according to the manufacturer’s protocol. Make a 1/8 dilution of the samples using PCR-grade water and add 3 µl of each sample to individual wells of a clean, opaque 96-well plate. Add 1 µl each of Fwd. and Rev. primers for a total of 5 µl; primer sequences used to detect P. leucopus STAT1 are shown in Table 2. In this study, the FastStart Essential Green Master Enzyme Mix was used and 5 µl of this was added to each sample for the reaction. Thus, the total reaction volume was 10 µl.Table 2. qRT-PCR primers used to probe for STAT1 and β-actin in P. leucopus cellsimgsrc:https://en-cdn.bio-protocol.org/attached/image/20171130/20171130191522_3676.jpgRun on Lightcycler for 50 cycles and analyze the resultant data. The fold induction of STAT1 in the NS controls was set to 100% and the fold induction in the KD cells was assessed comparative to the NS cells. All data are normalized to β-actin. Figure 2B shows relative STAT1 mRNA expression.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171130/20171130191601_6634.jpgFigure 2. Assessing gene knockdown in transduced cell lines. A. Flow chart and data of Western blot showing decreased expression of STAT1 in P.",
    "leucopus KD cells expressing shRNA to positions 261 (STAT1KD #1), 630 (STAT1KD #2) and all 3 positions–261, 630 and 1,742 (STAT1KD All). All further experiments were performed with the ‘STAT1 KD All’ cells and they are henceforth named as STAT1 KD cells. Samples were probed with antibodies to STAT1, STAT1-P and β-actin. B. Flow chart and data of qRT-PCR showing percentage relative STAT1 mRNA expression in the STATIKD cells compared to the NS control. Asterisks indicate: **** = P < 0.00001.Perform a functional assay for IFN response in STAT1 KD cellsHaving observed knockdown, we tested the impact of STAT1 KD on the upregulation of an ISG. Data in our lab has identified a homolog of the TBFV restriction factor-tripartite motif protein 79 (TRIM79) and also demonstrated it to be an ISG in P. leucopus cells (Taylor et al., 2011). We assayed the fold induction of P. leucopus TRIM79 (plTRIM79) in STAT1 KD cells following IFN treatment according to the following protocol:Set up STAT1 KD and NS control cells as in Procedure D, treat with mIFN-β for 8 h and proceed to harvest RNA as described above in the qRT-PCR section.Use an equal amount of RNA as template for cDNA synthesis and perform qRT-PCR reaction using gene-specific primers. Fold induction was assessed relative to untreated cells. We also compared plTRIM79 induction in P. leucopus cells with specific lentiviral knockdown to the type 1 IFN receptor (IFNAR1) generated using the same technique outlined above. Data is shown in Figure 3.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171130/20171130191737_2153.jpgFigure 3. qRT-PCR of an ISG plTRIM79 in STAT1 KD cells relative to the NS control. Cells with altered STAT1 (and IFNAR1) expression show significantly less ISG induction suggesting that knockdown has a functional impact on IFN signaling. Mean ± SD. Asterisks indicate: ** = P < 0.",
    "01, *** = P < 0.001.Test the effect of STAT1 KD on LGTV replicationBy immunofluorescence microscopy Set up STAT1 KD and NS cells at 50,000 cells per well in 8-well Labtek slides and incubate overnight.Infect the STAT1 KD and NS cells with LGTV at MOI of 100. Allow a 1 h absorption period and replace the inoculum with 500 µl of fresh culture media.At 72 h post-infection, remove supernatant, wash cells 2 x with PBS and fix for 20 min in 4% paraformaldehyde solution. Add just enough to cover the slides (about 5 ml).Wash 2 x with PBST and permeabilize cells for 5 min. Remove permeabilization solution (see Recipes) and add 3 ml immunofluorescence assay blocking solution (see Recipes) for 1 h at RT. Specific antibodies to LGTV envelope (E), and LGTV non-structural protein 3 (NS3) proteins were used in this study at 1:2,000 dilution.Wash 3 x with PBS and incubate with the appropriate fluorescent secondary antibodies diluted in 3 ml blocking solution for 1 h at RT in the dark. Wash cells 3 x in opaque containers protected from light.Add mounting media containing DAPI–This study utilized 1 ml of the ProLong Gold Anti-Fade Mountant with DAPI added and slides were imaged on an Olympus confocal microscope. Figure 4A includes the confocal image data showing increased viral protein staining in STAT1 KD cells.By virus titration and immunofocus assay Set up STAT1 KD and NS cells at 100,000 cells per well in 24-well dishes and incubate overnight.Infect cells with LGTV at a multiplicity of infection (MOI) of 10 such that there would be 10 virion particles to each cell in the monolayer.",
    "This is calculated as a product of the cell density, desired MOI and number of wells divided by the viral titer to determine the volume of viral stock needed for infection. Inoculate the cells with 250 µl of the virus solution and allow a 1 h absorption period and replace the inoculum with 500 µl of fresh culture media.Collect viral supernatants at 24, 48, and 72 h post-infection in triplicates and store at -80 °C.Set up Vero cells at 200,000 cells per well in 24-well dishes and incubate overnight.Make six 1/10 serial dilutions of each viral supernatant sample in FBS-free DMEM media using the 1.2 ml tubes and add 250 µl of each diluted to fresh Vero cells. Allow a 1 h absorption period and replace the inoculum with 500 µl of fresh culture media containing 2% FBS and 0.8% methylcellulose (culture overlay media).At 4 d post-infection, perform the immunofocus assay as described previously (Taylor et al., 2011; Baker et al., 2013). Briefly, remove the culture overlay media (see Recipes) and wash the cells 2 x with PBS. Fix with 100% methanol for 30 min and wash again with PBS.Incubate for 20 min in Opti-MEM medium and follow up with a virus-specific antibody. In this study, an antibody to detect the LGTV envelope (E) protein was used at 1:1,000. Incubate with primary antibody for 1 h at 37 °C in an airtight container. Wash cells 2 x with PBS and incubate with the appropriate secondary antibody. Goat anti-mouse IgG antibody was used in this study at 1:1,000. Incubate as in primary antibody and follow with 2 PBS washes. Add the substrate and allow 15 min for foci to develop.",
    "Determine the number of focus-forming units (FFU) per ml of viral supernatant and compare virus release in each cell type and condition. Results of STAT1 KD on LGTV infection are shown in Figure 4B.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171130/20171130192002_9798.jpgFigure 4. Determining the impact of STAT1 KD on LGTV infection of P. leucopus. A. Visualizing LGTV protein staining in STAT1 KD P. leucopus cell lines by immunofluorescence microscopy. Images were captured on an Olympus microscope at 40x magnification showing LGTV E (green), NS3 (red) and nuclei are stained with DAPI (blue). B. Quantifying LGTV replication in P. leucopus STAT1 KD cells assessed by performing an immunofocus assay. This assay involves titrating supernatants from the infected clonal cells onto fresh Vero cells and quantifying the resultant foci. Viral titer is indicated as focus forming units (ffu) per ml. Mean ± SD; Data are from three independent experiments performed in triplicate. Asterisks indicate: * = P < 0.05, *** = P < 0.001, **** = P < 0.00001."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Microbiology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}