{
  "id": 3937,
  "origin_website": "Cell",
  "title": "In vitro co-culture of human intestinal organoids and lamina propria-derived CD4+ T cells",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nEstablishing organoid cultures from intestinal tissue samples\nTiming: 2–3 h\nThis section describes the generation of stable organoid cultures from fetal intestinal tissues and adaptations for the generation of organoids from pediatric or adult tissues. Organoids can be generated from a tissue piece as small as regular biopsies (1-2 mm in size) obtained at endoscopy or larger tissue sections obtained at surgery. The latter is described here as it requires more steps before isolating the stem cell containing crypts. Typically, around 2 cm2 tissue is sufficient for both organoid generation and subsequent lamina propria lymphocyte isolation. Biopsies, although sufficient for organoid generation, are insufficient starting material to retrieve enough lamina propria lymphocytes for co-culture in most cases (see also ‘isolation of lymphocytes from intestinal lamina propria tissue samples[href=https://www.wicell.org#sec3.2]’).\nRemove the mesothelium surrounding the intestine (Figure 1[href=https://www.wicell.org#fig1]A) and remove the muscular layer in case of pediatric and adult tissues (see also Schreurs et al. [2017][href=https://www.wicell.org#bib10]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/659-Fig1.jpg\nFigure 1. Preparation of the intestine\n(A) Remove mesothelium from the intestine.\n(B) Cut the intestine open longitudinally.\n(C) Intestinal tissue cut into 0.5×0.5 cm segments and washed by shaking in PBS.\nCut the intestine open longitudinally (Figure 1[href=https://www.wicell.org#fig1]B).\nCut the intestinal tissue into small pieces (∼0.5×0.5 cm) (Figure 1[href=https://www.wicell.org#fig1]C).\nWash tissue pieces 3–4× in 30 mL PBS in a 50 mL centrifuge tube by shaking vigorously until the faeces is removed and the supernatant is clear (see note) (Figure 1[href=https://www.wicell.org#fig1]C).\nRemove PBS and distribute tissue pieces in wells of a 6-well plate.\nAdd 5 mL EDTA/DTT mix per well.\nIncubate for 1 hr in EDTA/DTT mix at 4°C on a shaker (400–600 rpm).\nVigorously pipet tissue pieces in EDTA/DTT mix up-and-down 20× with a 25 mL serological pipet.",
    "Filter the collected supernatant through a 70 μm cell strainer in a 50 mL centrifuge tube, do not discard the tissue pieces but place them on ice in a 50 mL centrifuge tube and proceed with the isolation of lymphocytes from lamina propria.\nSpin the filtered cells 10 mins at 500 g and 4°C.\nDiscard the supernatant and resuspend the pellet in 10 mL AD+, transfer to a 15 mL centrifuge tube.\nSpin tube 5 mins at 500 g and 4°C.\nResuspend the pellet in the appropriate volume of AD+ and transfer to a pre-cooled 1.7 mL microcentrifuge tube. Per 1/24 well use 10 μL AD+ (see note).\nMix the cell suspension with Matrigel (see note) at a ratio of 1:2 (add 20 μL Matrigel per 1/24 well). Avoid creating bubbles in the Matrigel; slowly pipet the Matrigel on top of the pellet by ejecting the Matrigel against the wall of the tube above the cell pellet, do not go past the first stop on the pipet. Turn down the volume of the pipet to 50% of the Matrigel-cell suspension volume and gently mix by slowly pipetting up-and-down without going past the first stop on the pipet.\nSeed 3 drops of 10 μL per well in a pre-warmed 24-well plate. See also troubleshooting problem 2[href=https://www.wicell.org#troubleshooting].\nIncubate the plate for 10 mins at 37°C.\nAdd 500 μL HISC+Y per well and culture at 37°C and 5% CO2.\nChange the medium every 2–3 days. Switch to Y-free medium the first time the culture is refreshed, see ‘culturing of intestinal organoids[href=https://www.wicell.org#sec3.3]’.\nPassage organoids after 5–10 days, depending on growth rate, see ‘culturing of intestinal organoids[href=https://www.wicell.org#sec3.3]; passaging organoid cultures[href=https://www.wicell.org#sec3.3.2]’.",
    "Note: In our experience, organoid cultures generated from intestinal tissues are rarely infected. Therefore, we do not recommend washing the tissue with antibiotics or adding extra antibiotics to the cultures generated. However, when infections frequently occur, these can be prevented by culturing organoids in media containing the antimicrobial agent Primocin (InvivoGen; working concentration 100 μg/mL).\nNote: The number of wells that can be seeded from one intestine depends on the size of the tissue. As a rule of thumb, resuspend the pellet in just enough AD+ until the pellet is no longer too viscous to pipet with a P20 tip. From one 1 fetal intestinal tissue piece (which equates to between 10–15 cm2 tissue) usually around 4–5 wells can be seeded (or 12–15 densely packed Matrigel drops of 10 μL each). This will result in a highly densely seeded cell suspension, dilute with AD+ if necessary (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/659-Fig2.jpg\nFigure 2. Generating organoids from fetal intestinal epithelium\nThe image on the left represents fetal intestinal epithelium seeded after detachment at a high density. The image on the right displays a magnified image of the same culture after 48 h where the formation of organoids can be observed. Images were acquired on the Leica DM IRB Inverted microscope (Leica). The black scale bar represents 150 μm.",
    "Note: 24-well plates should be pre-warmed for at least 1 h in the incubator at 37°C. Additionally, Matrigel should be thawed on ice for at least 1 h before it is liquid enough to pipet, always keep Matrigel at 4°C during this protocol and store at −20°C when not in use. Do not let the Matrigel warm above 8°C until culturing organoids in the incubator (see also troubleshooting problem 4[href=https://www.wicell.org#troubleshooting]). If Matrigel drops are too fluid and do not adhere into a small dome extend pre-warming of the plates up to 1 week before seeding.\nIsolation of lymphocytes from intestinal lamina propria tissue samples\nTiming: minimum 4 h depending on size of tissue\nThis section describes how to isolate lymphocytes from intestinal lamina propria tissue after epithelial detachment and organoid culture generation. To retrieve sufficient lamina propria lymphocytes for co-culture experiments, typically a minimum of 2 cm2 intestinal tissue is preferred. Although there is a lot of variability between donors and tissue origin, 2 cm2 intestinal tissue should yield at least 1–5 million mononuclear cells.\nLamina propria lymphocyte (LPL) isolation\nCombine all tissue pieces left over after detachment of the epithelial cells (see ‘establishing organoid cultures from intestinal tissue samples[href=https://www.wicell.org#sec3.1]’ step 9) in 1 well of a 6-well plate and mince with scissors.\nTransfer the minced tissue to a 50 mL centrifuge tube and add 15 mL Collagenase D mix.\nIncubate for 30 mins at 37°C on a shaker at 100 strokes/min.\nCollect the supernatant and filter through a 70 μm cell strainer.\nSpin the tube with the cell suspension at 10 mins at 500 g and 4°C.\nDiscard the supernatant and wash the cells with PBS and place on ice.",
    "To increase cell yield, resuspend any tissue pieces that may remain after the first digestion in 15 mL fresh Collagenase D mix.\nIncubate for 30 mins at 37°C on a shaker at 100 strokes/min.\nCollect the supernatant and filter through a 70 μm cell strainer.\nPool the cells and spin 10 mins at 500 g and 4°C.\nDiscard the supernatant and wash the cells with PBS.\nLymphocyte isolation and freezing\nResuspend the cells in 10 mL HBSS, then layer the cells on 4 mL standard isotonic Percoll solution (SIP; 0,24 mL 10× PBS + 2,16 mL Percoll + 1,6 mL PBS).\nGradient centrifuge the cells for 20 mins at 18°C–22°C and 1000 g (acceleration in 120 sec; 0 break).\nCollect the lymphocyte ring.\nWash 2× with PBS (see steps 24 and 25).\nCount the cells with a Bürker chamber, exclude dead cells with 0.4% Trypan Blue.\nResuspend the cell pellet in ice-cold FBS and dropwise add an equal volume of ice-cold FBS + 20% DMSO (reaching an end concentration of 10% DMSO), transfer cells to a cryovial and freeze in a StrataCooler at −80°C (see note).\nOn the next day, transfer the frozen cryovials to a liquid nitrogen tank.\nNote: This protocol describes the isolation of LPL from fetal intestinal tissue, however it can also be successfully applied to pediatric or adult intestinal tissues. Please see Schreurs et al. (2017)[href=https://www.wicell.org#bib10] for a detailed protocol on epithelial detachment and subsequent harvest of LPL from pediatric and adult tissues.\nNote: It is recommended to freeze maximum 20 million/mL lamina-propria derived lymphocytes with a recovery of around 70% after thawing.",
    "Pause Point: After establishment of the organoid culture and freezing of the lamina propria lymphocytes, as it takes some time for the organoid cultures to grow, the protocol has a natural pause point here.\nCulturing of intestinal organoids\nTiming: ∼5 h/week\nThis section details the maintenance of long-term organoid cultures by weekly passaging the cultures.\nLong term organoid cultures\nChange the HISC medium of the organoid cultures every 2–3 days. As the organoid cultures are embedded in Matrigel on the plate, medium can be easily removed without disturbing the Matrigel droplets. Make sure the fresh medium is at 18–22°C when added to the cultures as colder medium will liquefy the Matrigel droplets. See also troubleshooting problems 1[href=https://www.wicell.org#troubleshooting] and 5[href=https://www.wicell.org#troubleshooting].\nImmediately after seeding the organoids from fresh intestine or after turning organoid cultures into single cells using TrypLE (see also the section ‘produce a single cell suspension from intestinal organoid cultures’), add Y to HISC, then switch to HISC without Y with the next refreshment of medium.\nPassage organoid cultures every 5–7 days, depending on growth (Figure 3[href=https://www.wicell.org#fig3]). If not passaged frequently enough, the organoids will differentiate and lose their stem cell qualities (Figure 3[href=https://www.wicell.org#fig3]). Split the cell cultures depending on density, usually 1 well can be split into 4 new wells each week. Monitor the growth rate and density of the organoid cultures closely as there is donor-to-donor variation in growth rates. Ideal density during normal culture is best judged by microscopy; per Matrigel droplet organoids are ideally close together and touching but not overlapping between 30–40 organoids per 10 μL Matrigel droplet at passaging 1:4. Too dense seeding of organoids will lead to faster differentiation represented by darkening and loss of round cystic appearance of the organoids (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/659-Fig3.jpg",
    "Figure 3. Organoid culture of epithelial cells from fetal intestines\nThe image on the left represents an organoid culture from fetal intestinal epithelial cells in stem cell medium (HISC), this culture is ready for passing. The image on the right represents differentiated organoids from the same passage cultured in differentiation medium. Images were acquired on the AxioZoom V16 (Zeiss). The black scale bar represents 1 mm.\nOrganoid cultures stabilize around passage (P) 3, therefore we recommend to not use organoid cultures for experiments prior to P3. Organoid cultures prior to P3 can have remaining debris from the isolation and slightly more tubular shape before stable cystic cultures are obtained.\nPassaging organoid cultures\nPipet 1 mL ice-cold AD+ in a 15 mL centrifuge tube per culture and keep on ice.\nRemove the medium from each well.\nHarvest the organoids by liquefying the Matrigel with 1 mL ice-cold AD+ per well and transfer into a 15 mL centrifuge tube (maximum of 8/24 wells per 15 mL centrifuge tube). See also troubleshooting problem 3[href=https://www.wicell.org#troubleshooting].\nFill the tube up to 14 mL with ice-cold AD+.\nCentrifuge for 5 mins at 200 g and 4°C.\nRemove the supernatant with a 5 mL serological pipet and P200 tip, remove as much medium as possible including any Matrigel on top of the pellet (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/659-Fig4.jpg\nFigure 4. Pelleted organoids\nWhen pelleting organoids there will be a white organoid pellet visible in the bottom of the 15 mL tube. Additionally, Matrigel may be observed floating atop the pellet, which is here indicated by the dashed box in the image. When aspirating the medium, remove the Matrigel atop the pellet but do not remove the white pellet at the bottom of the tube containing the organoids.\nResuspend the pellet in 1 mL AD+.",
    "Mechanically disrupt the organoids by pipetting multiple times (20 repetitions) with a P1000, followed by disruption with a P200, and then a P20 tip.\nCheck organoid fragments under a microscope to confirm they are disrupted.\nRepeat mechanical disruption until organoids no longer appear round and cystic, but rather like shards (Figure 5[href=https://www.wicell.org#fig5]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/659-Fig5.jpg\nFigure 5. Organoid appearance after passaging\nBoth images represent an organoid culture that was disrupted by pipetting in order to passage the culture. After disruption of the culture, organoids appear like ‘shards’. Image on the left 4× magnification, image on the right of the same droplet at 10× magnification. Images were acquired on a Leica DM IRB Inverted microscope (Leica). The black scale bar represents 0.5 mm.\nTop up to 14 mL with ice-cold AD+.\nCentrifuge for 5 mins at 200 g and 4°C.\nRemove the supernatant with a 5 mL serological pipet and any remaining medium with a P200 tip.\nResuspend the pellet in the appropriate volume of AD+ and transfer to a pre-cooled 1.7 mL microcentrifuge tube. Per 1/24 well use 10 μL AD+.\nMix the cell suspension with Matrigel at a ratio of 1:2 (add 20 μL Matrigel per 1/24 well).\nSeed 3 drops of 10 μL per well in a pre-warmed 24-well plate.\nIncubate the plate for 10 mins at 37°C.\nAdd 500 μL HISC per well and culture at 37°C and 5% CO2.\nChange medium every 2–3 days.\nPassage organoids every 5–7 days.\nPreparation of lamina propria lymphocytes for co-culture with intestinal organoids\nTiming: minimum 5 h depending on cell yield",
    "Once stable organoid cultures have been established, lamina propria lymphocytes can be added to create co-cultures. This section describes how to prepare the lamina propria lymphocytes isolated and frozen in section ‘isolation of lymphocytes from intestinal lamina propria tissue samples[href=https://www.wicell.org#sec3.2]’ for co-culture with intestinal organoids.\nThawing of lamina-propria derived lymphocytes\nThaw the cells at 37°C in a water bath until a pea-sized clump of ice is left.\nTransfer the cell suspension to a 50 mL centrifuge tube.\nAdd dropwise 20 mL ice-cold IMDM with 30% FBS while shaking the tube. Mix well by pipetting.\nCentrifuge for 10 mins at 500 g and 4°C.\nRemove the supernatant and wash the pellet 2× with PBS, while keeping on ice.\nCount the live cells using a Bürker chamber and 0.4% Trypan Blue solution.\nIsolate lamina propria-derived effector memory CD4+ T cells using flow-cytometry-based sorting\nResuspend the LPL in FACS buffer.\nUse a Bürker chamber to determine the cell count.\nPellet the cells at 400 g at 4°C for 5 mins, then remove the supernatant.\nPrepare the antibody-mix to stain CD4+ T surface molecules (for the recipe please see ‘materials and equipment[href=https://www.wicell.org#materials-and-equipment]’; see also troubleshooting problem 7[href=https://www.wicell.org#troubleshooting]) and keep on ice and in the dark until further usage. Use 100 μL antibody mix per 10 million mononuclear cells per donor. The antibody amount can be adjusted dependent on the cell count.\nResuspend the LPL in the antibody mix and incubate for 30 mins at 4°C, in the dark and shaking at 600 strokes/min.\nAfter incubation, wash the cells by adding 1 mL (per 100 μL antibody mix) FACS buffer to the suspension; pellet the cells at 400 g at 4°C for 5 mins, then remove the supernatant.\nRepeat step 73 to wash the cells again, reducing background fluorescence.",
    "Resuspend the cells at maximum 25 million cells/mL in FACS buffer.\nAcquire the labeled mononuclear cells on a FACS-sorter and use the following gating strategy (Figure 6[href=https://www.wicell.org#fig6]) to sort viable CD45+CD3+CD4+CCR7-CD45RA- Tem cells into tubes filled to at least 10% with T cell medium.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/659-Fig6.jpg\nFigure 6. Gating strategy\nFlow cytometric gating strategy to sort viable CD45+CD3+CD4+CCR7-CD45RA- cells from fetal intestinal lamina propria.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/659-Fig7.jpg\nFigure 7. Fetal intestinal organoids and CD4+ Tem cells in co-culture\nThe top row represents organoids cultured under normal conditions in HISC-SB+IL-2, without the addition of T cells. The bottom row represents organoids from the same fetal intestine, cultured under similar conditions but with the addition of activated viable CD4+ Tem cells (30 cells/μL Matrigel). Images were acquired on the Leica DM IRB Inverted microscope (Leica) on days 5, 7, and 9 post initiation of single cell culture or co-culture. The black scale bar represents 150 μm.\nPellet the cells at 400 g and 4°C for 5 mins, remove the supernatant and pool the tubes if required. Use T cell medium.\nNote: In step 75 a maximum suspension of 25 million cells/mL is best suited for the 4-laser FACS Aria IIu SORP (BD Biosciences) used in Schreurs et al. (2019)[href=https://www.wicell.org#bib11]. However, you may wish to resuspend the cells at a different concentration. Please consult the local FACS operator or aim for a suspension that yields maximum 12 000 events/s.\nNote: Please make sure that all antibodies have been properly titrated for your cell type and that a compensation matrix is set-up on the FACS-sorter. Here, UltraComp eBeads were used.",
    "Alternatives: In this publication, CD4+ effector-memory T (Tem; viable CD45+CD3+CD4+CCR7-CD45RA-) cells were isolated, however, the antibody mix can be adjusted to isolate other immune cell populations residing in the lamina propria or from blood or other adult tissues.\nAlternatives: As an alternative to FACS-sorting CD4+ T cells, magnetic-activated cell isolation techniques can be used to isolate CD4+ T cells according to the manufacturer’s instructions.\nTCR activation of lamina propria-derived CD4+ T cells\nResuspend the sorted cells in T cell medium at 4 million cells/mL.\nPrepare 2× stimulation medium by adding the following components per 1 mL T cell medium.\n0.4 μL 1.5 mg/mL anti-CD3 (end concentration 0.6 μg/mL)\n2 μL 2 mg/mL anti-CD28 (end concentration 4 μg/mL)\nCombine the cells suspended in T cell medium (part 1) and 2× stimulation medium (part 2) in equal volumes to achieve an end concentration of 2 million cells/mL in 1× stimulation medium.\nIncubate the cell suspension for 2 h at 37°C and 5% CO2.\nAlternatives: As an alternative, other TCR stimulation reagents can be used. However, the required concentration for efficient T cell activation should be titrated beforehand, as the strength of the anti-CD3 can also vary batch-to-batch.\nGeneration of organoid-T cell co-cultures\nTiming: 2–3 h\nThis section of the protocol details seeding of CD4+ T cells and epithelial stem cells to generate organoid-T cell co-cultures and their maintenance.\nProduce a single-cell suspension from intestinal organoid cultures\nPre-warm (37°C) TrypLE and prepare 10 mL AD+ with 10% FBS (18°C–22°C).\nRemove the supernatant from organoid cultures.\nHarvest the organoids by liquefying the Matrigel using 800 μL ice-cold AD+ per well. Transfer the organoids in suspension to a 15 mL tube. Do not exceed 6 wells per 15 mL tube.",
    "Fill the tubes containing the organoids in suspension up to 14 mL with ice-cold AD+ and pellet the organoids at 200 g and 4°C for 5 mins. Remove the supernatant.\nPer 6 Matrigel drops (10 μL each) of harvested organoids, add 200 μL TrypLE to the pellet and resuspend. Manually shake in a water bath (37°C) for 2 min, then pipet up-and-down 20 times (with force) using first a P200 and then a P20 tip. Inspect the digestion by holding the tube under the microscope.\nRepeat step 86, including adding fresh TrypLE to the suspension, until >95% single cells are observed and for a maximum of 4 rounds.\nAdd 10 mL AD+ with 10% FBS per tube containing organoids to inactivate the TrypLE. Incubate at 18°C–22°C for 5 mins.\nPellet the cells at 400 g and 4°C for 5 mins, then remove the supernatant.\nAdd up to 14 mL ice-cold AD+ to each tube and repeat step 89.\nResuspend the cells in ice-cold AD+ and count the total number of single cells in the organoid cell suspension with a Bürker chamber.\nPer 1/24 well, take 10 000 single organoid cells (3333 cells/droplet) and keep in AD+ on ice.\nCritical: Perform each step at the suggested temperature as Matrigel only liquefies at 4°C.",
    "Alternatives: Specific research questions may require different concentrations of single epithelial cells and immune cells seeded together, these ratios should be tested in preliminary experiments to assess the impact of altering the cell input. For example, including a higher concentration of intestinal epithelial cells in the 10 μL drops will increase organoid development however can also promote differentiation and then impair proliferation. Similarly, increased numbers of CD4+ T cells can also impact the results of the cultures as illustrated in our related publication (Schreurs et al., 2019[href=https://www.wicell.org#bib11]). The optimal organoid-to-immune cell ratio and numbers for the specific tissue or disease setting should be tested and for example immune histochemical assessment of the tissues can inform on physiological and pathophysiological ratios of epithelial cells and immune cells.\nGeneration and maintenance of organoid-T cell co-cultures\nResuspend sorted activated CD4+ Tem cells in AD+ at a concentration of 90 cells/μL (3× the desired end concentration).\nPellet the appropriate number of intestinal organoid single cells suspension (10,000 single cells per 1/24 well) at 400 g and 4°C for 5 mins, then remove the supernatant.\nResuspend the single organoid cell pellet (step 94) in the appropriate volume of AD+-harboring 90 cells/μL CD4+ Tem and transfer to a pre-cooled 1.7 mL microcentrifuge tube. Per 1/24 well use 10 μL AD+ with resuspended T cells at 90 cells/μL and resuspended single organoid cells at 1000 cells/ul.\nMix the cell suspension with Matrigel at a ratio of 1:2 (add 20 μL Matrigel per 1/24 well) for a final concentration of 30 CD4+ Tem cells/μL (300 cells/droplet) and 333 single organoid cells/uL (3333 cells/droplet).\nSeed 3 drops of 10 μL (step 96) per well in a pre-warmed 24-well plate. See troubleshooting problem 6[href=https://www.wicell.org#troubleshooting].\nIncubate plate for 10 mins at 37°C.",
    "Add 500 μL HISC+Y-SB+IL-2 per well and culture at 37°C and 5% CO2.\nChange the medium every 2–3 days. Switch to Y-free medium the first time the culture is refreshed.\nTrack organoid development with a microscope (Figures 7[href=https://www.wicell.org#fig7] and 9[href=https://www.wicell.org#fig9]). See the next section (‘imaging and quantification of organoid-T cell co-cultures[href=https://www.wicell.org#sec3.6]’) for suggestions on tracking organoid development and quantification thereof. Briefly, organoid growth should be visible by day 5 and the culture can be maintained for 10–15 days depending on the growth speed of the organoids.\nCritical: Double check your calculations to achieve the desired end concentration of the co-cultured cells.\nNote: To determine the presence and location of T cells within the organoid cultures, T cells can be incubated with reagents such as CellTrace Violet (Invitrogen) or DAPI prior to sorting and can thereby be visualized by microscopy (Figure 8[href=https://www.wicell.org#fig8]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/659-Fig8.jpg\nFigure 8. CellTrace Violet (CTV)-stained T-cells present in co-cultures\nThe image shows T cell-organoid co-cultures with T cells stained by CTV. Images were acquired on an EVOS M5000 Imaging System (Thermo Fisher). The black scale bar represents 100 μm.\nImaging and quantification of organoid-T cell co-cultures\nTiming: 1–2 h on each microscopy day\nThis section of the protocol offers examples on imaging and analyses of organoid-T cell co-cultures.\nMeasure organoid development by imaging co-cultures every 2–3 days with a light microscope capable of acquiring brightfield images.\nImage each Matrigel droplet.\nCount organoid number per field of view and determine size of individual organoids by masking the organoids in ImageJ software, using the ‘Multi-point tool’ and ‘Measure’ features (Figure 9[href=https://www.wicell.org#fig9]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/659-Fig9.jpg\nFigure 9. Analyzing organoid growth",
    "(A) Organoids can be counted using the ImageJ built in ‘Multi-point tool’ (highlighted in yellow). Because organoids are grown in a dome-shaped Matrigel droplet, some organoids might be blurry or only partially within the field of view. Therefore, it is recommended to define a set of rules prior to counting and apply those rules to all images. For example, we exclude i) any organoids that do not have clearly defined edges/appear blurry as interpretation may vary between observer and ii) organoids that are >50% outside the field of view.\n(B) Organoid size can be measured using the ImageJ “Measure” tool (Analyze > Measure). First, set the correct scale (Analyze > Set Scale) to convert pixels to known size i.e., using the scale bar in the top left corner. Secondly, use the “Oval” tool (highlighted in yellow) to outline the edges of individual organoids and acquire their measurement with the “Measure” tool. The black scale bar represents 75 μm.\nAlternatives: Organoids can also be quantified by analyzing the cell count by flow cytometry. Next to providing the cell count this type of measurement can be combined with epithelial cell markers such as LRG5, Ki-67, EPCAM, MUC2, sucrose isomaltase or villin to assess epithelial cell differentiation. Similarly, the T cells can be assessed by flow cytometry (for example via addition of CD45, CD3, IL-22 antibodies) to assess differentiation or cytokine production. For flow cytometric analyses of organoids and T cells, a single cell suspension is needed which can be obtained as described in the section ‘Produce a single cell suspension from intestinal organoid cultures’ and incubated with antibodies of choice. Additionally, once single cell suspensions are obtained, RNA can be isolated for RNA-Seq. Furthermore, protein secretion can be measured in the culture supernatant by ELISA or multiplex bead-assay."
  ],
  "subjectAreas": [
    "Organoids",
    "Cell Culture",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology"
  ]
}