{
  "id": 10444,
  "origin_website": "Jove",
  "title": "Growth and Characterization of Irradiated Organoids from Mammary Glands",
  "procedures": [
    "Animal studies were performed in accordance with institutional guidelines and protocols approved by the Vanderbilt University Institutional Animal Care and Use Committee.\n1. Preparation of mice and cell acquisition (adapted from Nguyen-Ngoc et al.11)\nSacrifice athymic Nu/Nu mice (8-10 weeks old) using CO­2 asphyxiation followed by cervical dislocation. Clean the skin using 70% ethanol.\nResect abdominal and inguinal mammary glands from mice using pre-sterilized scissors and forceps. Remove lymph nodes before resection. Rinse in sterile 1x phosphate buffered saline (PBS) (Figure 1A).\nPlace it in 15 mL tubes with 10 mL of Dulbecco’s Modified Eagle Media/Nutrient Mixture F12 (DMEM/F12) for transport. Samples can be kept overnight at 4 °C or processed immediately. Keep on ice.\nIrradiate samples at 20 Gy using a cesium source (Figure 1B).\n45 min after irradiation, place mammary glands in a 35 mm sterile cell plate and mince with scalpels (Figure 1C,D). Mince with approximately 40 strokes until the tissue relaxes and pieces are obtained that are no larger than approximately 1 mm2 in area.\nTransfer to the collagenase solution in a 50 mL centrifuge tube. Collagenase solution consists of 2 mg/mL collagenase (see Table of Materials), 2 mg/mL trypsin, 5% v/v fetal bovine serum (FBS), 5 μg/mL insulin, and 50 μg/mL gentamicin in DMEM/F12 media. Use 10 mL collagenase solution per mouse.\nPlace in a water bath at 37 °C, vortexing every 10 min for 30-60 min. Digestion is complete when the collagenase solution is cloudy (Figure 1E,F).",
    "Spin down the digested solution at 450 x g for 10 min at room temperature (RT). Three layers will be observed. The supernatant is composed of fat, the middle layer is an aqueous solution, and the bottom is a pellet. The pellet will appear red as it is a mixture of epithelial cells, individual stromal cells, and red blood cells (Figure 1G).\nPrecoat all pipettes, pipette tips, and centrifuge tubes with bovine serum albumin (BSA) solution prior to contact. BSA solution consists of 2.5 w/v % BSA in Dulbecco’s Phosphate Buffered Saline (DPBS). For pre-coating, simply add then remove BSA solution to the inside of the pipette tip and tubes. BSA solution can be reused, although it should be sterile filtered before each experiment.\nFor additional recovery, transfer the supernatant to a fresh BSA coated 15 mL tube. Pipette up and down vigorously to disperse fat layer. Centrifuge at 450 x g for 10 min at RT. Aspirate the supernatant, leaving a small amount of media in the tube to avoid aspirating the cell pellet.\nAspirate the aqueous layer from the tube with the original pellet.\nAdd 10 mL of DMEM/F12 to the tube with the original pellet and transfer to the second tube. Pipette vigorously to combine and resuspend the two pellets.\nCentrifuge at 450 x g for 10 min at RT. Aspirate the supernatant and add 4 mL of DMEM/F12 to the tube.\nAdd 40 μL of deoxyribonuclease (DNase) to the suspension and gently shake by hand for 2-5 min at RT. DNase solution consists of 4 U/mL DNase in DMEM/F12.\nAdd 6 mL of DMEM/F12 and pipette thoroughly. Centrifuge the tube at 450 x g for 10 min at RT.\nAspirate supernatant to the 0.5 mL mark. Resuspend in 10 mL of DMEM/F12 and pipette thoroughly.",
    "Pulse to 450 x g and stop 4 s after reaching that speed.\nRepeat steps 1.16-1.17 three more times to purify organoids via centrifugal differentiation. The pellet should now be an off-white color consisting of only epithelial organoids (Figure 1H).\n\tNOTE: Organoids can also be filtered using sterile mesh 40 μm filters. After step 1.16, pipette media containing organoids through a filter into a centrifuge tube, and then rinse with 5 to 10 mL of DMEM/F12 media. Flip the filter over a new 50 mL centrifuge tube. Pass 10 mL of DMEM/F12 media through, going the opposite way to rinse off any retentate. The retentate should consist of organoids, and the filtrate should consist mainly of stromal cells, which can be discarded or kept if desired.\n2. Determining density and plating organoids\nResuspend pellet in 10 mL of DMEM/F12. Pipette thoroughly to create a homogenous solution.\nTransfer 50 µL to a 30 mm Petri dish, and view under a phase contrast microscope at 20x. Count the number of organoids with a tally counter.\n\tNOTE: Here pipette tips have been consistently used with a minimal diameter of 457 μm, which is 5-10 times the diameter of the organoids that are seeded. For transferring volumes of 2 mL or larger (e.g., steps 1.16 and 2.1), use serological pipettes with tip diameters excess of 1,500 μm.\nCalculate the organoid density using the following equation:\nimgsrc://cloudfront.jove.com/files/ftp_upload/59293/59293eq1.jpg\n\tThe desired density is 1,000 organoids/mL to simplify further dilution. If the density is too low, centrifuge at 450 x g for 5 min and aspirate media. Add media necessary to reach 1,000 organoids/mL, and pipette thoroughly to create a homogenous mixture.",
    "To grow organoids in a protein matrix, seed organoids at a concentration of 1 organoid/μL in collagen type 1 diluted to 87% or in basement membrane extracted from Engelbreth-Holm-Swarm mouse sarcoma. While working with samples, keep on ice.\nTo freeze organoids, transfer the desired volume to a separate centrifuge tube. Spin down at 450 x g for 5 min. Aspirate media, and then add the same volume of 90% FBS/10% DMSO. Resuspend the organoids, and then aliquot into cryotubes. Transfer to -80 ˚C, and then to liquid nitrogen within one week.\nTo thaw, warm in a 37 ˚C water bath for one min. Centrifuge at 450 x g for 5 min, and then aspirate freezing media. Rinse with sterile DPBS, and then centrifuge again. Aspirate DPBS and add organoid media.\nPipette 50 µL (50 organoids) into each well of the low adhesion plate (Figure 1I).\nAdd 150 µL of organoid media to bring the total working volume to 200 µL. Organoid media consists of 1% penicillin-streptomycin and 1% insulin-transferrin-selenium (ITS) in DMEM/F12 media.\nEvery 2 days replace media carefully.\n\tNOTE: Low adhesion plates are not tissue culture treated; therefore, the cells can be easily detached. Aspirate media slowly by tilting the plate and inserting the pipette tip at the edge of each well. Leave a small amount of media in the bottom of the well. Add new media slowly to avoid applying unnecessary shear forces to organoids.\n3. Co-culturing with macrophages\nMaintain GFP or dTomato-labelled RAW 264.7 macrophages in DMEM media supplemented with 10% FBS and 1% penicillin-streptomycin. Seed 1 x 104, 5 x 104, or 1 x 105 cells/mL into organoid media.\nUse live cell phase contrast and fluorescent imaging to monitor macrophage infiltration over time.\n4. Immunofluorescence staining of organoids",
    "NOTE: Organoids can be stained in low adhesion wells or can be transferred to chamber slides. To transfer, gently pipette up and down until organoids have detached from plates. Transfer to chamber slides and incubate for 4-8 h to allow organoids to adhere to the plate surface.\nRemove organoid medium from the wells by carefully aspirating. Fix samples with 10% neutral buffered formalin for 15 min at RT.\nWash 3x 5 min in 1x PBS. If desired, fixed samples can be stored at 4 °C for one week for further staining.\nPermeabilize with 0.1% 4-(1,1,3,3-Tetramethylbutyl) phenyl-polyethylene glycol for 5 min.\n\tNOTE: To stain for F-actin, incubate samples with phalloidin diluted 1:1,000 and 1.67 nM bisbenzimide nuclear dye in 1% PBS/BSA for 1 h at RT. Then, proceed to step 4.8.\nBermeabilize with 0.5PBS. Samples can be stored at 4opy images and immunofluorescent images. mechanisms that contribute to CTC rlock with 5% normal goat serum in 0.1% PBS/Polyethylene glycol sorbitan monolaurate (PBST) for 1 h at RT. Wash 3x 5 min with PBS.\nIncubate with Anti-Cytokeratin 14 diluted 1:1,000, E-Cadherin diluted 1:200, or Tight Junction Protein One diluted 1:100 in 1% NGS in PBST for 1 h at RT. Wash 3x 5 min in PBST.\nIncubate with Goat Anti-Rabbit secondary diluted 1:200 with 1% NGS/PBST for 1 h at RT. Cover with foil to avoid light exposure.\nWash 3x 5 min in PBS. Use the nuclear dye (see Table of Materials) to stain nuclei.\nWash 3x 5 min in PBS. If using chamber slide, mount with a coverslip. Store wrapped in foil at 4 °C for up to 2 weeks.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}