{
  "id": 14961,
  "origin_website": "Jove",
  "title": "High-Efficiency Gene Disruption in Primary Bone Marrow-Derived Macrophages Using Electroporated Cas9-sgRNA Complexes",
  "procedures": [
    "1. sgRNA design\nNOTE: This step describes selection of the target sequences and design of the sgRNAs. It is helpful to design guides that are in the first large coding exon, so that any translated protein is disrupted early in the open reading frame. It is also helpful to select target sequences that lie within the same exon, as this will streamline the analysis of the editing efficiency (step 6). The examples of genome editing provided with this protocol used sgRNAs targeting the first exon of the Src gene and the Cblb gene, as well as in the non-coding Rosa26 locus of the mouse genome.\nIdentify 20 nucleotide genomic sequences to target, using one of several free online designing tools (Table 1). Select four to five guides that are non-overlapping within each gene, as Cas9 activity varies by the specific guide chosen, and a priori prediction of a highly active guide is not possible.\n\tNOTE: It is critical to ensure the proper orientation of the guide relative to the sequence of the targeted locus. Design tools typically provide the guide sequence in a 5' to 3' orientation, irrespective of which chromosomal strand is targeted. To verify the strand orientation, check that there is a protospacer adjacent motif (PAM) sequence for S. pyogenes Cas9 (nGG) immediately 3' of the targeted genomic sequence. The sgRNA sequence does not include the PAM.\n2. sgRNA synthesis\nNOTE: This step describes how to synthesize sgRNAs using PCR to generate a template for in vitro transcription (IVT), and then purify the sgRNA using spin columns (Figure 1A). Custom synthetic sgRNAs are commercially available through several vendors as an alternative to PCR/IVT.",
    "Perform PCR to generate the IVT template for T7 RNA polymerase. The PCR reaction uses universal primers that contain a T7 RNA polymerase promoter and trans-activating CRISPR RNA (tracrRNA) sequence (Table 2), in addition to short individual primers with the gene-specific guide sequence.\n\t\nThis is the non-amplifying overlap extension step. Dilute the PCR buffer to 1x and add an additional 1 mM MgCl2. Then, add 0.25 µL of high-fidelity DNA polymerase, 0.5 mM deoxynucleotide triphosphate (dNTP), 0.02 mM guide-specific primer, and 0.02 mM T7 reverse long universal primer (Table 2) to a total volume of 46 µL. Then, place the tube in the thermocycler and run two cycles of: 95 °C for 15 s, 37 °C for 15 s, and 72 °C for 15 s. Cool the reactions on ice.\nThis is the PCR amplification step. To each reaction, add 2 µL of 25 mM forward amplification primer and 2 µL of 25 mM reverse amplification primer. The final reaction volume is 50 µL. Denature for 30 s at 95 °C. Then, run 35 cycles of: 95 °C for 15 s, 65 °C for 20 s, and 72 °C for 15 s. Perform an additional extension at 72 °C for 2 min.\nCheck the PCR reaction product on a 2% agarose gel. Overlap-extension PCR results in a 127 bp dsDNA molecule with the T7 promoter upstream of the gene-specific 20 nucleotide guide and the tracrRNA immediately downstream (Figure 1B).",
    "IVT template purification: There are numerous protocols and kits that work well for this. This protocol uses solid-phase reversible immobilization (SPRI) beads. Mix 50 µL of the PCR product with 90 µL of beads and follow the manufacturer's instructions. Elute the DNA by adding 40 µL of buffer (5 mM Tris, 0.1 mM ethylenediaminetetraacetic acid [EDTA]) and heat at 65 °C for 5 min.\nMeasure the DNA concentration of the IVT template using absorption at a wavelength of 260 nm. A DNA concentration of at least 50 ng/µL is needed for IVT. The IVT template can be stored at -20 °C.\nIVT reaction\n\t\nUse a commercial kit designed to produce high yields of IVT (see Table of Materials). Follow the manufacturer's recommendations to perform the IVT reaction. Using 250 ng of IVT template in a 20 µL reaction, incubate at 37 °C for 4-16 h.\nCheck the IVT sgRNA product by running 1 µL of the reaction on a 2% agarose gel. A bright RNA band should be observed, running similarly to 70 bp dsDNA (Figure 1C). Though not mandatory, to obtain sharp and more resolved bands, use an RNA sample buffer with urea, and denature the sample at 65 °C for 5 min prior to loading.\n\t\tNOTE: Faint higher-molecular weight bands and slight migration differences may be seen with some guide RNAs due to differences in the RNA secondary structure.\nDephosphorylate the sgRNA IVT product to minimize the activation of RIG-I (a foreign RNA sensor) and subsequent cell death following electroporation. For each 20 µL IVT reaction, add 69 µL of molecular-grade water and 15 U of calf intestinal phosphatase (CIP) in 1x CIP buffer. Incubate for 2 h at 37 °C.",
    "Degrade the IVT template to minimize the activation of cellular DNA sensors, which trigger cell death following electroporation. To each IVT reaction, add 2 U of RNase-free DNase. Incubate for 15 min at 37 °C. The IVT product can be stored at -20 °C for 1 day or -80 °C for several months.\nPurify the IVT product using spin columns. For this step, SPRI bead purification kits are inferior.\n\t\nBind the RNA to the column by adding 220 µL of binding buffer to the IVT product, followed by 1 mL of 100% molecular biology-grade ethanol. Mix well and load the column. Thereafter, follow the manufacturer's instructions. Perform the final wash in a laminar flow biosafety cabinet to avoid contamination of the sgRNA.\nPerform the elution in the laminar flow hood to avoid contamination. Elute the RNA using 30 µL of sterile 10 mM Tris buffer (pH 8.0).\nMeasure the concentration of sgRNA by measuring the absorbance at a wavelength of 260 nm.\n\tNOTE: Typical sgRNA yields are at least 100 µg.\nStore the sgRNA at -80 °C. Make aliquots to avoid more than three freeze-thaw cycles.\n3. Preparation for electroporation\nNOTE: All steps should be performed in a laminar flow hood to avoid contamination. This protocol uses a commercially available electroporation system (see Table of Materials) with 10 µL tips.\nThaw the BMDMs 48-72 h before use and expand them on non- tissue culture (TC) treated plates.\n\tNOTE: Per reaction, 4 x 105 cells are needed.\nSterilize PCR tubes for reaction assembly. Prepare one PCR tube per reaction, and heat them in a thermocycler for 10 min at 98 °C. Prepare the tubes in batches and store them closed. Place the sterilized PCR tubes on ice when ready to use.",
    "Clean the pipette station with 70% ethanol and place it in the laminar flow hood. Set the parameters to 1,900 V, 20 ms, and one pulse.\nRemove a transfection tube from the package with care to keep it sterile and fill it with 3 mL of \"E\" buffer. Ensure that the E buffer is at room temperature prior to electroporation. Insert the tube in the station and push it down until it clicks.\nFor each reaction, aliquot 2.5 µL of sgRNA at a concentration of 1,100 ng/µL. Dilute the sgRNA in cold phosphate-buffered saline (PBS) with 0.9 mM CaCl2 and 0.5 mM MgCl2 (PBS + Ca/Mg). Leave it on ice.\nPrepare two plates: a 12-well uncoated plate for the cells and an additional 24-well plate to hold the culture media. Aliquot 1.5 mL of antibiotic-free medium per reaction into the wells of the 24-well plate.\nPrepare Cas9 protein. There are several commercial and academic suppliers of sterile-purified Cas9 protein. Dilute Cas9 to a final concentration of 20 µM with cold PBS + Ca/Mg. For each electroporation reaction, aliquot 1 µL of 20 µM Cas9 into sterile PCR tubes. Leave on ice.\nPrepare cells for electroporation.\n\t\nRemove the growth medium. Wash the cells using PBS without CaCl2 and MgCl2 (PBS-Ca/Mg) to remove the serum and divalent cations that promote adhesion. Then, add PBS + 1 mM EDTA and incubate at room temperature for about 5 min until the cells begin to detach.\nPipette gently up and down to detach the cells. Transfer the cells to a low protein-binding 15 mL tube. Pellet the cells at 500 x g for 5 min.\n\t\tNOTE: Macrophages are adherent to plasticware. The use of low protein-binding centrifuge tubes significantly improves the cell yield.",
    "Work quickly to avoid prolonged incubation of cells in PBS + EDTA. Remove most of the supernatant, leaving about 1 mL of supernatant in the tube. Resuspend the cells in the remaining supernatant, and then transfer to a low protein-binding 1.5 ml microfuge tube.\nRemove a small aliquot of cells to count. Pellet the remaining cells by centrifuging at 500 x g at room temperature for 5 min.\nDuring centrifugation, count the cells and warm the Cas9 and sgRNA tubes to room temperature.\nRemove all the supernatant from the cell pellet. Resuspend the cells in PBS + Ca/Mg at a concentration of 4 x 107 cells/mL (4 x 105 cells per 10 µL reaction).\n\t\tNOTE: Each kit is supplied with a limited amount of electroporation buffer (Buffer R, Buffer T). However, we find that the electroporation efficiency using PBS + Ca/Mg is equivalent to the proprietary buffers.\nWhen electroporating sgRNAs for different genes, aliquot the cells into different low protein-binding tubes for each gene to avoid cross-contamination between the sgRNAs. Keep the cells at room temperature until ready for electroporation.\n4. RNP assembly\nKeep the sgRNA and Cas9 at room temperature in order to avoid precipitation. Add 2.5 µL of sgRNA to 1 µL of the diluted Cas9 in sterilized PCR tubes. Dispense the sgRNA slowly over 15 s with mixing to prevent precipitation.\nIncubate for 5 min at room temperature to allow RNP complex formation.\n5. RNP delivery by electroporation\nPrepare the electroporation tip (cuvette). Depress the plunger to extend the stem. Insert the stem into the tip.\n\tNOTE: Ensure that the tip is secure and that the plunger slides smoothly and extends beyond the tip sheath. If the tip is not properly positioned, air bubbles may be introduced into the tip, causing tip failure.",
    "Resuspend the cells by pipetting up and down, and then load the electroporation tip with the cells. Withdraw the full 10 µL volume capacity of the tip, avoiding bubbles.\nStarting with the negative control sgRNA, transfer 10 µL of cells in the electroporation tip to the sample tube containing 3.5 µL of RNP from step 4. Pipette up and down three times to mix well. Draw 10 µL of the mixture back into the tip, ensuring no bubbles are present.\nPlace the tip into the electroporation station, lowering it into the buffer. Avoid contacting plastic surfaces with tip to maintain sterility. Push Start on the touchscreen display.\nAfter completion, the display will indicate a successful pulse. Remove the pipette from the device and place the cells in a dry well of the labeled, uncoated 12-well plate.\nRinse the tip by pipetting up and down twice in 15 mL of PBS + Ca/Mg. Set aside the pipette with the tip still attached. Ensure that the tip does not touch anything and remains sterile.\n\tNOTE: In many experiments, it is possible to reuse the tip for multiple samples, such as after the inactive negative control sgRNA sample, or during the initial evaluations of the guide activity when four to five sgRNAs are tested per gene and the sole read-out is the editing efficiency. However, during functional analysis on edited cells, a new tip is recommended for each gene, as small amounts of sgRNA or cell carryover could impact the experimental results.\nImmediately add 1 mL of antibiotic-free medium (aliquoted in step 3.6) to the cells and gently shake the plate to mix.\nRepeat steps 5.2-5.6 for the remaining reactions.\nReturn the cells to the incubator.",
    "Check the viability of the cells 1-2 h post-electroporation. The cells should be >90% adherent. Optional: Add gentamicin (5 µg/mL) to the cells 1-2 h post-electroporation to help prevent contamination if this will not interfere with the downstream experiments.\n6. Assessing the editing efficiency\nNOTE: Most editing is complete after 48 h.\nCheck the cell monolayer 48 h after electroporation. If the cells are over 50% confluent, then proceed further. If the cells are <50% confluent, wait an additional 1-2 days. The genomic DNA analysis to determine the editing efficiency requires 1 x 105 cells, in addition to the cells needed for the downstream experiment.\nPrepare genomic DNA (gDNA).\n\t\nWash the cells with PBS(-Ca/Mg). Add 1 mL of PBS + 1 mM EDTA. Incubate at room temperature for about 5 min until the cells begin to detach from the plate.\nDetach the cells by pipetting. Transfer to a low protein-binding microfuge tube.\nCount the cells and remove an aliquot of 1 x 105 cells. The remaining cells can be re-plated for use in further experiments. Generally, the experiments are conducted 5 days after electroporation in order to allow decay of the protein.\nPellet the cells for gDNA analysis for 15 s at maximum speed in a microfuge tube.\nResuspend the pellet in 50 µL of lysis buffer. Vortex to detach any cells stuck to the walls of the tube, and heat at 98 °C for 10 min to lyse the cells and inactivate endogenous DNase.\nPlace the tubes on ice.\nAdd 1 µL proteinase K (20 mg/mL). Incubate for at least 1 h at 37 °C; it can be left overnight for convenience.\nHeat to 98 °C for 10 min to inactivate the proteinase K.",
    "Centrifuge at room temperature for 5 min at maximum speed. Remove the supernatant, which contains the DNA. This crude preparation without further purification works well for most PCR reactions.\nEvaluate the editing efficiency with Sanger sequencing.\n\t\nDesign PCR primers 200-300 bp upstream of the most 5' guide sites and 200-300 bp downstream of the most 3' guide sites. The typical amplicon size is ~500 bp. Design a nested sequencing primer at least 125 bp away from the nearest guide site (Figure 2A).\nPerform PCR using 2 µL of gDNA.\nPrepare the PCR product for sequencing. This protocol uses an exonuclease I/shrimp alkaline phosphatase (ExoI/SAP) treatment. Commercial DNA purification kits also work but require more hands-on time.\n\t\nPrepare 15 µL of the PCR product. Add 7.5 µL of water, 1 µL of 10x ExoI buffer, 10 U of ExoI, and 1 U of SAP to degrade the dNTPs and primers that interfere with Sanger sequencing.\nIncubate at 37 °C for 30 min, followed by 85 °C for 20 min to deactivate the enzymes.\nCarry out Sanger sequencing on the Exo/SAP-treated PCR product; use a known amount of DNA size marker to estimate the size of the PCR product present in the sample. The sequencing reactions may require optimization, as the TIDE software needs high-quality sequence chromatograms to accurately estimate the editing efficiency. The sequence chromatogram for the un-edited locus should provide clear peaks with minimal background (Figure 2B, C).\nTo estimate the editing efficiency, use TIDE to analyze the Sanger sequencing chromatogram files using the edited gDNA and the unedited control gDNA. (Table 1, Figure 2). Upload the Sanger sequencing files and run the software with the default settings.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}