{
  "id": 19759,
  "origin_website": "Wiley",
  "title": "Automated Motion Tracking and Data Extraction for Red Blood Cell Biomechanics",
  "procedures": [
    "The following instructions provide an overview of how to remove static objects from the video, apply a filter, and adjust contrast for accurate cell shape analysis. Data can then be extracted from the video using the Motion Tracking feature in Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.75#cpcy75-prot-0002]. The microfluidic flow is visualized at 40× using a Leica DMi8 Inverted Microscope (Leica Microsystems). The video files used in this protocol are initially captured as .cine files using a Phantom 410-L camera (Vision Research) and are converted to high-quality .avi files for compatibility with Image-Pro 10. The videos are captured as 8-bit grayscale images.\nMaterials\nWindows 7 Professional and Ultimate 32- and 64-bit and/or Windows 8.0 and 8.1 Enterprise and Professional 32- and 64-bit (recommended: Windows 10 Enterprise and Professional 64-bit with 32 GB RAM or more)\nImage-Pro 10\n.avi videos of RBC flow\nMotion detect subsampling\n1. Open.avi file in Image-Pro 10.\n2. Double click the red “Uncalibrated” text in the lower right corner to set the spatial calibration.\nIn our experiments, the spatial calibration is set to 1.9001 pixels per unit (micrometer; Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.75#cpcy75-fig-0002]). This is calculated from the magnification and resolution of the images.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/e538edc7-ae8f-4330-a38a-b3e3762f9c42/cpcy75-fig-0002-m.jpg</p>\nFigure 2\nThe spatial calibration options are shown in the panel on the right. Units are set to microns. The number of pixels/unit is calculated from the image resolution and microscope magnification.\n3. Under the Process tab, find the Subsample button. In its drop-down menu, select Average Global for Method and 15 for Size. Click on the Motion Detect button to generate the subsampled images.",
    "The resulting images only display the cells in motion (Fig. 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.75#cpcy75-fig-0003]). The walls of our microfluidic channels are hidden, as well as the vignetting effect from the microscope. Before the cells can be tracked and measured, further post-processing is needed to enhance the image.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/0486154f-3b39-461c-ac40-03dc06a4eeb7/cpcy75-fig-0003-m.jpg</p>\nFigure 3\nThe Motion Detect tab is generated, displaying the moving objects without the background.\nFilter and adjust contrast\n4. Under the Process tab, click on 2D Filters. Open Enhancements menu. Select Low-Pass filter, with Kernel size 5 × 5, Strength 100, and 1 Pass (Fig. 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.75#cpcy75-fig-0004]). Click Apply.\nHomogenous regions of similar pixel intensity (i.e., biological cells) are emphasized. The filter smooths the edges of the cells, making their shapes easier to segment.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/3eab0bbb-f8b1-4108-962f-7ef12424ca0b/cpcy75-fig-0004-m.jpg</p>\nFigure 4\nThe panel on the right shows the suggested settings for applying a low pass filter. The panel on top shows the contrast values for best segmentation results.\n5. Under the Adjust tab, find Display section. Set Black Level (BL) to 109 and White Level (WL) to 132 (Fig. 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.75#cpcy75-fig-0004]). Click Apply (checkmark button).\nContrast settings may vary based on experimental setup.",
    "After the video has been enhanced for segmentation, the user can motion track the cells and extract a dataset. The following instructions provide an overview for selecting a Region of Interest (ROI), choosing tracking options, and exporting data. Finally, a macro can be created to execute all the steps listed.\nMaterials\nWindows 7 Professional and Ultimate 32- and 64-bit and/or Windows 8.0 and 8.1 Enterprise and Professional 32- and 64-bit (recommended: Windows 10 Enterprise and Professional 64-bit with 32 GB RAM or more)\nImage-Pro 10\nEnhanced images on Image-Pro (from Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.75#cpcy75-prot-0001])\nSelect region of interest and tracking options\n1. With the enhanced images from Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.75#cpcy75-prot-0001] displayed, navigate to Select tab. In the Regions of Interest section, select Rectangle Tool. Draw a rectangular Region of Interest around the microfluidic channels (Fig. 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.75#cpcy75-fig-0005]).\nOnly the cells in this area will be tracked. To save an ROI, click on the Features Manager button in the Select tab. ROIs can be saved and loaded for reproducible positions and sizes.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/89c2ea15-7bee-4d74-a579-a13af56d2210/cpcy75-fig-0005-m.jpg</p>\nFigure 5\nA rectangular Region of Interest (ROI) is drawn over the image. ROIs can be saved and loaded from the Features Manager menu, so their size and position can easily be reproduced. In this figure, the ROI has been emphasized for better clarity.\n2. Under the Measure tab, click on Objects. The Motion Tracking tab will appear. In Segmentation Tracks section, click on the Manual button. In the Threshold Tool, set End value to 123 (Fig. 6[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.75#cpcy75-fig-0006]).\nThis value may change depending on the distribution of pixel values in each experiment.\nThe histogram shows the distribution of pixel values from 0-255. To segment the cells, the threshold is set to 0-123 (darkest pixels in the image).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/2935b3bb-ba1f-4f20-b282-5d170e4c9d04/cpcy75-fig-0006-m.jpg</p>\nFigure 6",
    "The Threshold Tool is shown in the panel on the right. To segment the dark cells, the threshold is set at 0-123. The pixel values of the background (124-255) are excluded.\n3. Under the Motion Tracking tab, click on Types. Add Regions:Axis, Major, Tracking:Velocity, and Tracking:X Coord. Click on Edit Range. For Regions:Axis, Major, set Minimum and Maximum to 7 and 15, respectively (Fig. 7[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.75#cpcy75-fig-0007]).\nHere, we can select any of the available measurement types to be recorded. In our experiments, we measure the velocity, x-coordinates, circularity, area, and major axis length. By setting Minimum and Maximum length to 7 and 15 µm (typical RBC length under flow) we essentially filter out objects that may appear in the video but do not meet this size requirement. Smaller objects like platelets (2-3 µm) will not be measured.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/580a3d4c-7c33-4f76-aa2e-9dcecabe6c18/cpcy75-fig-0007-m.jpg</p>\nFigure 7\nThe Measurements menu displays all the available measurements that can be obtained from the tracked cells. In this example, Major Axis, Velocity, and X-Coordinates are measured.\n4. Click on Options in the Motion Tracking tab. Under the Auto Tracking section, set Minimum total track length to 600.\nBegin auto tracking\n5. Under the Motion Tracking tab, find Segmentation Tracks section. Click Auto All. Click Yes on the dialog box that appears, ensuring that the cells are outlined in red.\nThe software will display all tracked objects matching the preset criteria (Fig. 8[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.75#cpcy75-fig-0008]). Another dialog box will appear upon the completion of the process, displaying the number of objects tracked.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/409733a9-43dd-4f90-a9ff-4f1beb3d5850/cpcy75-fig-0008-m.jpg</p>\nFigure 8\nEach cell's motion path is displayed and numbered. The measurements at each frame are shown in the Tracking Table.",
    "6. Under Data Views, click Data Table button. The data for all measurement types selected in step 3 are shown. Click on the arrow near the Excel icon and select a file format from the drop-down menu to export data.\nRecording a macro\n7. To automate the above steps, there is a Record Macro button under the Automate tab in Image-Pro that records the entire sequence and runs it with one click. A graphical user interface can also be created directly on Image-Pro for the macro, greatly increasing the ease of use for a user with little image processing experience."
  ],
  "subjectAreas": [
    "Cytometry"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}