{
  "id": 11804,
  "origin_website": "Jove",
  "title": "Development of a 68Gallium-Labeled D-Peptide PET Tracer for Imaging Programmed Death-Ligand 1 Expression",
  "procedures": [
    "The animal experimental procedures were approved by the Animal Ethics Committee of Nanjing Medical University or the National Institutes of Quantum Science and Technology. Mice experiments were strictly performed in compliance with the institutional guidelines of the Committee for the Care and Use of Laboratory Animals.\n1. Peptide synthesis\nSwell 100 mg of 4-methylbenzhydrylamine (MBHA) resin (loading capacity of 0.37 mmol/g) in 1 mL of N-methyl-2-pyrrolidone (NMP) for 30 min under mild N2 bubbling.\nPrepare a fresh stock buffer consisting of Fmoc-protected amino acids (5.0 equiv), HCTU (4.9 equiv), and DIPEA (10.0 equiv) in 1 mL of NMP, and add to the resin (100 mg). Allow the coupling reaction to proceed for 1.5-2 h.\nPrepare deprotection buffer consisting of 50% (vol/vol) morpholine in NMP. Wash the resin (100 mg) 2 x 30 min with 1 mL of the deprotection buffer in each wash to remove the Fmoc group on the amine group. Wash the resin with dichloromethane (DCM; 1 mL) for 1 min, remove the DCM, and rewash the resin with NMP (1 mL) for another 1 min. Next, remove the NMP and rewash the resin with DCM for 1 min.\n\tNOTE: All the washing procedures are conducted under mild N2 bubbling. The above procedures are repeated until the last amino acid.\nFor adding 1,4,7,10-tetraazacyclododecane-1,4,7,10-tetraacetic acid (DOTA) to the peptide, pre-activate the DOTA with N-(3-dimethylaminopropyl)-N-ethylcarbodiimide hydrochloride (EDC·HCl) and N-hydroxysuccinimide (NHS). Incubate the stock buffer of DOTA/EDC·HCl/NHS at a molar ratio of 1:1:1 in dimethyl sulfoxide (DMSO) for 3 h, with a final DOTA concentration of 1 M. Next, add the stock buffer (1 mL) to the resin (100 mg), and allow the reaction to proceed for 2 h with gentle N2 bubbling.",
    "NOTE: 1,4,7-triazacyclononane-1,4,7-triacetic acid (NOTA) can also be utilized as a chelator for 68Ga complexation. The same procedures can be used for NOTA coupling.\nRinse the resin thoroughly from the top using DCM and apply a vacuum to remove residual reaction solution simultaneously. Rinse the resin 3x using DCM (1.5 mL), and then rinse with MeOH (1.5 mL) to shrink the resin. Put the resin under nitrogen overnight, or under high vacuum for at least 4 h, until the resin becomes dry.\nPlace the dried DPA peptide-containing resin in a 2 mL polypropylene container with a screw cap. Add the appropriate cleavage cocktail (95/2.5/2.5 TFA/TIS/H2O in volume; 1 mL/100 mg resin) and seal the container tightly using a screw cap. Gently agitate the reaction on an orbital shaker in a fume hood at 20-25 °C for 2 h.\n\tCAUTION: Prepare trifluoroacetic acid (TFA) in a fume hood wearing protective clothing, due to its highly corrosive nature.\nRemove most of the TFA by evaporation under nitrogen in the fume hood. Precipitate the peptides by adding diethyl ether (~1.5 mL/100 mg of resin).\nVortex the mixture to triturate the peptides and centrifuge at room temperature (10,000 × g, 5 min). Carefully pour the solvent out of the container. Repeat steps 1.7-1.8.\nAir-dry the residue in the open container for 10 min. Add 50% (vol/vol) aqueous acetonitrile, and vortex for 1-2 s to dissolve the products (1 mL/100 mg of resin).",
    "Remove the resin by filtering the mixture, and then wash the resin 2x using 0.2 mL of 50% (vol/vol) aqueous acetonitrile. Mix the filtrates for high-performance liquid chromatography (HPLC) purification. Use the following HPLC conditions. Column: YMC-Triat-C18 (4.6 mm internal diameter [i.d.], 150 mm, 5 mm); solvent gradient: solvent A-deionized water; solvent B-acetonitrile (0.1% TFA); flow time: 20 min, with acetonitrile from 10% to 90%; flow rate: 1 mL/min.\nFreeze the collected HPLC eluents overnight at -80 °C and lyophilize (-50 °C and <1 pa). For radiolabeling, dissolve the solid peptide in sodium acetate buffer (100 mM, pH 5.0) at a final concentration of 1 mg/mL as a stock buffer.\n2. 68Ga radiolabeling\nNOTE 68Ga was generated in-house at Nanjing First Hospital (Nanjing, China) using a 68Ge/68Ga generator.\nPipette 5 µL of stock buffer into a 1.5 mL polypropylene container with a screw cap. Add 200 MBq [68Ga]GaCl3 (400 µL) to the container.\nVortex the mixture for 5 s. Measure the pH using pH test strips. Adjust the pH to 4-4.5 with NaOH (0.1 M).\n\tNOTE: An appropriate pH is critical for complexation between 68Ga and DOTA.\nIncubate the solution at room temperature for 5-10 min. Subject the reaction mixture to radio-HPLC for radiolabeling yield analysis under the following conditions: column: YMC-Triat-C18 (4.6 mm i.d., 150 mm, 5 mm); solvent gradient: solvent A-deionized water; solvent B-acetonitrile (0.1% TFA); flow time: 20 min, with acetonitrile from 10% to 90%; flow rate: 1 mL/min.\n\t​NOTE: Radio thin-layer chromatography (TLC) can be used as an alternative approach to examine radiolabeling yield. The suggested TLC elution buffer is 0.1 M Na3C6H5O7, pH 4.\n3. Tracer stability test\nTracer stability test in PBS",
    "Add [68Ga]DPA (10 µL, 3.7 MBq, in NaOAc) to the PBS (990 µL). Incubate at 37 °C for 1, 2, and 4 h with slight agitation.\nCollect 200 µL of the solution at each time point. Inject it into the radio-HPLC for analysis.\nTracer stability in mouse serum\n\t\nAdd [68Ga]DPA (10 µL, ~3.7 MBq, in NaOAc) to the mouse serum (90 µL, freshly prepared). Incubate at 37 °C for 1, 2, and 4 h with slight agitation.\nCollect 20 µL of the solution at each time point. Add MeCN and water (100 µL, 1:1, v/v).\nCentrifuge the mixture for 10 min (5,000 × g, 25 °C). Analyze the supernatant using radio-HPLC.\n4. Analysis of PD-L1 expression by flow cytometry\nPrepare culture medium by supplementing RPMI-1640 medium with 10% (vol/vol) fetal bovine serum and 1% penicillin-streptomycin (vol/vol). Resuspend the U87MG cells in culture medium, and seed in 12-well plates at a density of 105 cells/well. Place the cells in an incubator (5% CO2, 37 °C), and culture for at least 24 h without disturbing.\nWash the cells with 0.5 mL of PBS and add 250 μL of trypsin-EDTA (0.25%). Place the cells back in the incubator (5% CO2, 37 °C) for 2 min.\nAdd 1 mL of culture medium to stop the cell dissociation. Add medium to the cells to detach them from the dishes by pipetting up and down and collect them in 1.5 mL tubes. Centrifuge the cells for 5 min (100 × g).\nRemove the supernatant and resuspend the cells in 1 mL of PBS. Centrifuge the cells for 5 min (100 × g). Repeat this step one more time.\nDilute the fluorescein isothiocyanate (FITC)-conjugated PD-L1 antibody with 3% bovine serum albumin (BSA) to 20 nmol/L. Add to the cells and incubate at 4 °C for 1 h.",
    "Centrifuge the cells for 5 min (100 × g), followed by washing with cold PBS twice. Analyze the PD-L1-positive cells using a flow cytometer and analysis software.\n5. Immunocytochemistry\nSeed the U87MG cells in glass bottom cell culture dishes (35 mm) at a density of 2.5 × 105 cells per well. When 60% confluency is reached, aspirate the culture medium and add 1 mL of PBS. Gently shake several times and aspirate. Perform the washing step 3x.\nAdd 500 µL of 4% paraformaldehyde to the dishes. Place the cells at room temperature and fix for 30 min.\nWash the cells 3x with PBS. Add 1 mL of 3% BSA (wt/vol, in PBS) and block the fixed cells for 2 h at room temperature.\nRemove the 3% BSA and directly incubate the cells with primary anti-PD-L1 antibody (mAb,1:100, diluted in 3% BSA) overnight at 4 °C.\n\tNOTE: After blocking the cells with BSA, do not wash with PBS.\nWash the cells 3x with 3% BSA buffer. Incubate the cells with FITC-conjugated anti-human IgG Fc secondary antibody (1:500, diluted in PBS) for 1 h.\nWash the cells 3x with PBS. Add 0.5 mL of DAPI (1 µg/mL) to the cells and incubate at room temperature for 1 h. Wash the stained cells 3x with PBS, and observe using confocal fluorescence microscope.\n6. Cellular uptake and inhibition experiment\nCellular uptake experiment\n\t\nCulture the U87MG cells in 12-well plates until 80% confluency is reached. Remove the medium and wash the cells with 0.5 mL of PBS.\nDilute the [68Ga]DPA in fresh medium to a concentration of 74 KBq/mL. Add 0.5 mL of the diluted [68Ga]DPA buffer to each well.",
    "Incubate the cells with [68Ga]DPA at 37 °C for different durations (10, 30, 40, and 120 min). Aspirate the medium using a pipette. Wash the cells with PBS (0.5 mL) three times.\nAdd NaOH solution (0.5 M, 300 µL per well) to lyse the cells. After 30 s, collect the viscous cell lysates in 1.5 mL tubes.\nWash the plate with 0.4 mL of PBS twice. Collect the washing solution in the above 1.5 mL tube.\nStart the built-in computer of the automatic gamma counter; put the tubes into the built-in shelf. After loading all the samples onto the conveyor, press the START button. Results are calculated in the internal software. The read-out records the decay-correlated counts per minute (CPM) of each tube.\nCompetitive binding assay\n\t\nCulture the U87MG cells in 12-well plates until 80% confluency is reached. Remove the medium and wash the cells with 0.5 mL of PBS.\nDilute [68Ga]DPA in fresh medium to a concentration of 74 KBq/mL. Dissolve an appropriate amount of BMS202 compounds in 10% DMSO to yield a 10 mM concentration (400 µL).\nDilute 4 µL of 10 mM BMS202 in 396 µL of PBS to obtain a concentration of 100 µM. Repeat this step to yield various concentrations of BMS202 (1 µM, 10 nM, 100 pM, and 1 pM).\nAdd 0.5 mL of the diluted [68Ga]DPA buffer to each well (0.37 MBq per well). Add 5 µL of the BMS202 solutions to each well (three wells for each concentration). Incubate the cells in a cell incubator at 37 °C for 120 min.\nAspirate the medium using a pipette. Wash the cells with 3 x 0.5 mL of PBS.",
    "Add the NaOH solution (0.5 M, 300 µL per well) to lyse the cells. After 30 s, collect the viscous cell lysates into 1.5 mL tubes. Wash the plate with 2 x 0.4 mL of PBS.\nCollect the washing solution in the above 1.5 mL tube. Put the tubes into the built-in shelf of the automatic gamma counter.\nFollow the same procedures as step 6.1.6.\n7. PET imaging\nNOTE: Perform small animal PET imaging, using a micro PET scanner that provides 159 transverse axial sections spaced 0.796 mm apart (center-to-center), with a horizontal field of view of 10 cm and an axial field of view of 12.7 cm. All data collected in the list mode are organized into three-dimensional sinograms. The Fourier is then reassembled into two-dimensional sinograms (frame × min: 4 × 1, 8 × 2, 8 × 5).\nUse male, 5-8-week-old BALB/C nude mice in this study. Collect the U87MG cells following steps 4.1-4.4 and aspirate the cells into a 0.5 mL syringe. Subcutaneously inject the cells into the mice (1 × 106 cells per tumor, two tumors per mouse). Monitor tumor growth after injection until the tumor volume is 100-300 mm3.\nAnesthetize the mice using 1%-2% (v/v) isoflurane (1 mL/min). Put the anesthetized mice in the right position on the animal bed of the PET machine.\n\tCAUTION: Keep the mice in the prone position to avoid death during scanning. During the whole imaging process, administer isoflurane flow (1.0 mL/min) via the nose using a preinstalled tube.\nAdjust the animal bed position via the control panel. Inject the tracers (10-17 MBq/100-200 µL) intravenously through a preinstalled tail vein catheter.",
    "Create a scanning workflow in a host computer using the referenced software (see Table of Materials) Create a study folder and set the acquisition protocol as per the manufacturer's protocol. Perform dynamic scans (60 min for each mouse) on all mice in 3D list mode.\nDefine a histogram protocol and a reconstruction protocol following the manufacturer' protocol. Use Hanning's filter with a Nyquist cutoff of 0.5 cycle/pixel to reconstruct PET dynamic images (25-30 min and 55-60 min) through filtered back-projection. Generate maximum intensity projection (MIP) images for all mice.\nCombine the protocols in a workflow and run the workflow. Analyze the resulting three-dimensional images using the software, following the manufacturer's protocol.\n\tNOTE: Use the simulation software to select the volumes of interest. Radioactivity is decay-corrected to the injection time and presented as the percentage of the total injection dose/per gram tissue (% ID/g).\n8. Ex vivo biodistribution\nAdminister [68Ga]DPA (1.85 MBq/100 µL) to the U87MG-bearing BALB/C nude mice through tail vein injection. Sacrifice three mice via cervical dislocation after injection for 5, 30, 60, and 120 min.\nOpen the chest wall of the mice. Then, open the heart. Use a 1 mL syringe to draw blood; squeeze the blood from the syringe into a radioimmunoassay (RIA) tube (13 mm in diameter) for the gamma counter.\nExcise the major organs and tumors and place them in RIA tubes (13 mm in diameter) for the gamma counter. Major organs include the total blood, heart, thymus, liver, spleen, bone, stomach, kidneys, muscle, intestinal lymph node, small intestine, pancreas, testis, brain, and lungs. Weigh all the organs.\nMeasure the radioactivity within the collected organs using an autogamma counter and decay-correct the values. Calculate the percentage of injected dose per gram of wet tissue (% ID/g).\n9. Immunohistochemistry",
    "Collect the glioma tissues and wash them 3x with PBS. Put the fresh tissues in 4% paraformaldehyde and fix overnight at 4 °C.\nEmbed the fixed tissues in paraffin and section them to a thickness of 10 µm. Place the sections in an incubator (60 °C) and incubate for 2 h. Dewax and hydrate the sections by incubating for 10 min each in the following: xylene (twice), absolute alcohol, 95% alcohol, 90% alcohol, 80% alcohol, 75% alcohol.\nPut the sections in 0.01 M sodium citrate and heat them to 92-95 °C. Maintain the temperature for 40 min to achieve antigen retrieval.\nAdd 200 µL of H2O2 solution (3%) to the sections and inactivate the endoperoxidases for 10 min at room temperature. Block the non-specific sites by treatment with 3% BSA for 2 h at room temperature.\nIncubate the sections in primary anti-PD-L1 antibody (mAb, 1:100, diluted in 3% BSA) overnight at 4 °C.\n\tNOTE: After blocking with BSA, do not wash with PBS.\nWash the sections 3x with PBS. Incubate the sections with HRP-labeled goat anti-rabbit secondary antibody (1:500, diluted in PBS) at room temperature for 1 h.\nWash the cells 3x with PBS. Add 200 µL of 3,3-diaminobenzidine (DAB) working solution (solution A: solution B: solution C = 1:1:18) to the sections and incubate for 5 min in the dark.\nWash the sections 3x with PBS. Add 500 µL of hematoxylin solution (100%), and incubate for 5 min at room temperature. Wash the sections with water for 30 s. Put the sections into differentiation solution (75% alcohol:HCL = 99:1) for 30 s. Wash the sections using water for 1 min.",
    "Dehydrate the samples by sequentially incubating with 75% alcohol, 80% alcohol, 90% alcohol, 95% alcohol, absolute alcohol, and xylene (twice) (10 min each). Mount all the sections using neutral resin and observe them under an optical microscope.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}