{
  "id": 2135,
  "origin_website": "Cell",
  "title": "Purification of cardiomyocytes and neurons derived from human pluripotent stem cells by inhibition of de novo fatty acid synthesis",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nThawing hPSCs\nTiming: 2 h\nThis step describes methods to coat culture apparatus with Matrigel and to thaw frozen hPSCs.\nPlace the culture apparatus of your choice on the bench.\nWe usually use a 100 mm culture dish for the maintenance of hPSCs and differentiation to CM.\nThaw Matrigel cooled to 4°C into precooled DMEM/F12 medium.\nWe usually thaw 682 μL of Matrigel into 42 mL of DMEM/F12 medium for seven 100 mm culture dishes.\nMatrigel may be thawed from frozen state by applying small amount (i.e., 1 mL) of DMEM/F12 medium to aliquots. Make sure that Matrigel is dissolved completely without making a lump.\nApply Matrigel diluted in DMEM/F12 medium to the culture apparatus.\nWe usually apply 6 mL of Matrigel diluted in DMEM/F12 medium per 100 mm culture dish (culture area: 55 cm2). However, the amount of Matrigel diluted in DMEM/F12 medium can be adjusted for each culture apparatus according to the culture area.\nTilt the culture apparatus to ensure that Matrigel uniformly covers the culture area.\nIncubate the culture apparatus to which Matrigel was applied at room temperature for 1 h.\nDuring the previous step, add Y-27632 to 30 mL StemFit AS103C medium for one 100 mm dish. (Final concentration: 10 μM).\nWarm the vial containing hPSCs in a 37°C water bath. In most cases, when the frost on the vial is just before completely dissolved is the optimal time to end warming.\nDisinfect the vial with 70% EtOH and collect the cells with 10 mL of StemFit AS103C supplemented with 10 μM Y-27632.\nCentrifuge the cells at 300 × g for 4 min.\nAspirate the supernatant and resuspend the cells in 10 mL of StemFit AS103C supplemented with 10 μM Y-27632.",
    "Optional: Determine cell number and viability using any laboratory method. We used a Vi-CELL XR cell counter (Beckman Coulter Inc.).\n2.0 × 106 cells are sufficient for a 100 mm dish.\nAspirate the Matrigel diluted in DMEM/F12 medium and apply cells resuspended in StemFit AS103C supplemented with 10 μM Y-27632.\nGently rock the culture apparatus to allow the cells to disperse uniformly.\nGently place the culture apparatus in an incubator at 37°C. Gently rock the culture apparatus again to ensure an even distribution of cells.\nCritical: All procedures must be performed using standard precautions on a clean bench to avoid contamination unless specified.\nCritical: Matrigel quickly becomes gel-like. To avoid this, Matrigel must be transferred from the refrigerator to an ice-cold thermal block. After thawing, the thawed Matrigel with DMEM/F12 medium should be cooled on ice or stored at 4°C. Cells usually attach to the culture apparatus within 1 h, but they can be easily detached by an external force. Do not move or touch the culture apparatus for at least 24 h.\nMaintenance of hPSCs\nTiming: 2–8 weeks\nReplace the culture medium with StemFit AS103C without Y-27632 every 24–48 h.\nChanging the culture medium every 48 h is sufficient, but when the cells reach 80% confluence, the culture medium should be changed every 24 h.\nThe cells should be observed every day. When the cells in the culture apparatus reach 80% confluence, the cells should be passaged.\nCoat the culture apparatus of your choice as described in steps 1–4.\nWarm StemFit AS103C in a water bath at 37°C.\nAdd Y-27632 to AS103C medium. (Final concentration: 10 μM).\nAspirate the culture medium and rinse the cells with 10 mL of D-PBS.",
    "The amount of D-PBS required may vary depending on the surface area of the culture apparatus. For one 100 mm dish, 10 mL of D-PBS is adequate.\nApply 500 μL of TrypLE Select. The amount of TrypLE Select may vary depending on the surface area of the culture apparatus.\nIncubate the cells at 37°C for 3 min.\nGently tap the culture apparatus to facilitate cell detachment.\nCollect the cells with 9.5 mL of AS103C supplemented with 10 μM Y-27632.\nCentrifuge the cells at 300 × g for 4 min.\nAspirate the supernatant and resuspend the cells in StemFit AS103C supplemented with 10 μM Y-27632.\nDetermine the cell number and viability using any laboratory method. We used a Vi-Cell XR Cell Counter (Beckman Coulter Inc.).\nAspirate the Matrigel diluted in DMEM/F12 medium and apply cells resuspended in StemFit AS103C with 10 μM Y-27632.\nFor the maintenance of human pluripotent stem cells, we usually apply 0.5 × 105 cells per 100 mm culture dish. However, the optimal number of cells needed may vary depending on the cell clone, passage, and culture apparatus.\nFor differentiation into CMs, we usually apply 8.25 × 105–11 × 105 cells per 100 mm culture dish.\nGently rock the culture apparatus to allow the cells to disperse uniformly.\nGently place the culture apparatus in an incubator at 37°C. Gently rock the culture apparatus again to ensure an even distribution of cells. Go back to step 13 for maintenance of the cells.\nCritical: If cells become overly confluent, their pluripotent status and viability may be affected. Observe the cells periodically to ensure that they are undifferentiated and not overly confluent. If any differentiated cells or masses are observed, it is best to discard them and start all over again.\nDifferentiation to hPSC-CMs\nTiming: 2 weeks",
    "This section describes the production of hPSC-CMs based on previous reports (Lian et al., 2013[href=https://www.wicell.org#bib2]; Tohyama et al., 2016, 2017[href=https://www.wicell.org#bib8]).\nWhen the cells reach > 90% confluence, they are ready for cardiac differentiation. We usually induce differentiation to hPSC-CMs in 100 mm dishes, but 6-well plates work just as efficiently.\nCells must be passaged at least once after thawing.\nThe optimal start day of cardiac differentiation is day 4 after passage. Y-27632 must be removed at least 24 h before the initiation of cardiac differentiation.\nFor cardiac differentiation, the culture medium should be warmed to 37°C in a water bath.\nDay 0: Dilute the stock solution of CHIR-99021 and BMP4 in RPMI-1640 medium with B27 minus insulin.\nWe usually use 6 μM CHIR-99021 and 1 μg/mL BMP4.\nRinse cells with D-PBS, and change the medium to RPMI-1640 supplemented with B27 minus insulin, CHIR-99021, and BMP4.\nD-PBS must be removed immediately after its application to the cell.\nOn day 1 (24 h), rinse cells with D-PBS and change the medium to RPMI-1640 supplemented with B27 minus insulin.\nD-PBS must be removed immediately after its application to the cell.\nOn day 3, add 5 μM IWR-1 to RPMI-1640 medium supplemented with B27 minus insulin. Rinse the cells with D-PBS and change the medium to RPMI-1640 supplemented with B27 minus insulin and 5 μM IWR-1.\nD-PBS must be removed immediately after its application to the cell.\nOn day 6, rinse cells with D-PBS and change the medium to RPMI-1640 with B27 minus insulin.\nD-PBS must be removed immediately after its application to the cell.\n24 h later (day 7), change the medium to MEMα supplemented with 5% FBS.\nRinsing with D-PBS is not necessary for this step.\nOn day 10, replace the culture medium with MEMα supplemented with 5% FBS.",
    "Rinsing with D-PBS is not necessary for this step.\nNote: Make sure to rinse the cells with D-PBS in the steps mentioned. Based on our experience, washing the cells with D-PBS improves differentiation efficiency. The critical factors affecting the success of cardiac differentiation are the status of hPSCs (pluripotency), cell number, and concentration of CHIR-99021. The optimal cell number and concentration of CHIR-99021 must be determined in a pilot experiment. In addition, the most critical phase of this differentiation protocol is the initial phase. It is important to treat cells with CHIR-99021 for at least 24 h. CHIR-99021 treatment induces a non-negligible amount of cell death, but it is a commonly observed phenomenon. Self-beating hPSC-CMs may be seen as early as day 7; however, this is accompanied by low differentiation efficiency. When high differentiation efficiency is achieved (i.e., 90% efficiency), self-beating may not be observed until day 10.\nMetabolic selection of hPSC-CMs\nTiming: Several days\nHere, we describe the purification method for hPSC-CMs. Use CMs on day 10–12. Purification with reseeding of hPSC-CMs is recommended for better purification efficiency compared to purification without reseeding. Based on our experience, metabolic selection without reseeding results in significantly decreased yield caused by detachment of the cells.\nWarm D-PBS in a 37°C water bath.\nWarm 2.5 g/L trypsin-EDTA in a 37°C water bath.\nDo not warm for an excessive time period, as trypsin may be inactivated by autodigestion. Always warm small amounts of trypsin.\nWarm MEMα supplemented with 5% FBS in a 37°C water bath.\nAdd 6 μM orlistat to MEMα supplemented with 5% FBS.\nAspirate and replace the culture medium with pre-warmed D-PBS. Incubate the cells for 3 min in an incubator.\nRemove D-PBS and add prewarmed 2.5 g/L trypsin-EDTA. Incubate cells for 5 min in an incubator.",
    "We usually use 1 mL of 2.5 g/L trypsin-EDTA for a 100 mm culture dish. Tilt and tap the dish gently to ensure uniform distribution of the trypsin-EDTA solution.\nGently tap the culture apparatus to enhance cell detachment at 2 min 30 s.\nThe detachment of the cells should be carefully observed to minimize trypsin treatment time. The treatment time may vary depending on the cell number and differentiation efficiency.\nCollect the cells using MEMα supplemented with 5% FBS in a 15 mL conical tube.\nBefore applying MEMα, pipette the cells with a p1000 micropipette to enhance dissociation. Avoid excess pipetting to minimize cell damage.\nCentrifuge at 300 × g for 3 min.\nRemove the supernatant and resuspend the cells in MEMα supplemented with 5% FBS and orlistat.\nApply the cell suspension to a collagen I-coated 150 mm culture dish.\nThe optimal cell number for seeding may vary depending on the differentiation efficiency. We usually apply cells derived from two 100-mm culture dishes to one 150-mm culture dish.\nGently rock the culture apparatus to allow the uniform dispersion of cells.\nGently place the culture apparatus in an incubator at 37°C. Gently rock the culture apparatus again to ensure even distribution of the cells.\n72 h later, remove the culture medium and rinse the cells with D-PBS. Change the medium to StemFit AS501.\nD-PBS must be removed immediately after its application to the cell.\n48 h later, replace the medium with StemFit AS501.\nCarefully observe the cells to confirm successful elimination of non-CMs. This can be done by observing the non-beating cells by a phase-contrast microscope.\nWhen the hPSC-CMs have been successfully purified, replace the medium with MEMα supplemented with 5% FBS.\nDetermine the purification efficiency using either immunocytochemistry or flow cytometry.\nImmunocytochemistry.",
    "Rinse the cells with D-PBS and fix with ice-cold 4% paraformaldehyde (PFA) for 15–20 min at room temperature.\nRinse the cells with D-PBS and treat with 0.1% Triton X-100 diluted in D-PBS for 5–15 min.\nTreat the cells with ImmunoBlock reagent for 30 min.\nDilute primary antibodies against α-actinin (Sigma-Aldrich, A7811, 1:200) with ImmunoBlock.\nApply the diluted antibodies to the cells and incubate overnight at 4°C.\nRemove the diluted antibodies and rinse the cells twice with D-PBS.\nDilute the secondary antibody to 1:200. Donkey anti-mouse IgG (H+L) highly cross-adsorbed secondary antibody, Alexa Fluor 488 (Thermo Fisher Scientific, A21202) with ImmunoBlock.\nApply the diluted antibody to the cells and incubate for 1 h at room temperature.\nRemove the secondary antibody and rinse the cells with D-PBS.\nDilute the Hoechst 33342 stain (Thermo Fisher Scientific, H3570) to 1:2,000 in D-PBS.\nApply the diluted Hoechst 33342 stain to the cells and incubate at room temperature for 1 h.\nRemove the Hoechst 33342 stain and apply D-PBS to the cells.\nObserve the cells under a microscope. If hPSC-CMs are successfully selected, only α-actinin-positive hPSC-CMs could be observed.\nFlow cytometry (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1616-Fig1.jpg\nFigure 1. Representative flow cytometry histograms of cardiac Troponin T.\n(A and B) Representative images of flow cytometry before (A) and after (B) metabolic selection of hiPSC (253G4)-CMs. The cells are labeled with cardiac Troponin T.\nReplace the culture medium with 2 mL D-PBS for each well of a 6-well plate.\nIncubate the cells for 3 min at 37°C.\nRemove D-PBS and add 500 μL trypsin-EDTA.\nIncubate the cells for 3 min at 37°C. If the cells are not sufficiently detached, tap the culture apparatus and incubate the cells for a maximum of 2 more minutes.",
    "Collect the cells with MEMα medium supplemented with 5% FBS. Pipette the cells to ensure their complete dissociation (total 10 mL).\nCentrifuge at 300 × g for 3 min.\nAspirate the supernatant and add 1 mL 4% PFA. Pipette the cells.\nVortex for 20 min at room temperature.\nAdd 10 mL D-PBS.\nCentrifuge at 300 × g for 3 min.\nAspirate the supernatant and add 1 mL 0.1% Triton X-100 diluted in D-PBS.\nVortex for 5 min at room temperature.\nAdd 10 mL D-PBS.\nCentrifuge at 300 × g for 3 min.\nAspirate the supernatant and add 1 mL ImmunoBlock reagent. Pipette the cells.\nIncubate for at least 30 min at 4°C.\nDivide 500 μL the suspended cells with ImmunoBlock reagent into two 1.5 mL microcentrifuge tubes and centrifuge at 300 × g for 5 min.\nDilute the antibodies against cardiac Troponin T-FITC (Miltenyi, 130-119-575, 1:50) and REA Control(I)-FITC (Miltenyi, 130-118-354, 1:50) with ImmunoBlock reagent.\nAdd the antibody and mix by gentle pipetting.\nIncubate 15 min at room temperature in the dark.\nAdd 1 mL ImmunoBlock reagent.\nCentrifuge at 300 × g for 5 min.\nAspirate the supernatant and add 350–400 μL D-PBS. Analyze the cells using a flow cytometer.\nNote: The time period required for purification of hPSC-CMs (especially StemFit AS501) may vary according to the differentiation efficiency and the number of cells. In addition, if the cells are not completely dissociated into single cells when seeded, the purification may be disturbed. If non-CMs are observed, extend the treatment with StemFit AS501 until all non-CMs are successfully removed. This may take up to 7 days or more depending on the differentiation efficiency and cell number.\nEvaluation of the optimal dose and duration of orlistat treatment\nTiming: 2 weeks",
    "Here, we describe how to determine the optimal dose and duration of orlistat treatment, which are sufficient for eliminating undifferentiated hPSCs but do not significantly affect the viability of hPSC-CMs. This may vary depending on the cell line and growth speed.\nOn day 0, seed the hPSCs.\nThe number of seeded cells should be adjusted so that the control (0 μM orlistat) reaches 90% confluence after 72 h of orlistat treatment.\nOn day 2, replace the culture medium with StemFit AS103C without Y-27632.\nOn day 4, dilute the orlistat stock solution with StemFit AS103C medium and prepare StemFit AS103C supplemented with 12 μM orlistat. For the control, the same amount of vehicle (DMSO) should be diluted with StemFit AS103C medium.\nPrepare StemFit AS103C supplemented with 0, 2, 4, 6, 8, and 10 μM orlistat by mixing the medium prepared in the previous step.\nReplace the culture medium with StemFit AS103C medium with or without orlistat prepared in the previous step.\nIncubate the hPSCs for 24–72 h.\nOn day 5–7, observe the hPSCs for cell death by alkaline phosphatase staining.\nAlkaline phosphatase staining.\nRinse the cells with D-PBS.\nFix the cells with 4% PFA for 20 min at room temperature.\nReplace 4% PFA with ddH2O.\nFor a 6-well plate, mix 200 μL alkaline V solution and 200 μL sodium nitrite solution and incubate for 2 min at room temperature.\nAdd 9 mL ddH2O to the above solution.\nAdd 200 μL naphthol solution to the above solution.\nReplace ddH2O with 1,000 μL of the above solution.\nIncubate the plate overnight in a dark place.\nThe next day, Remove the staining solution and wash the cells with ddH2O.\nRemove ddH2O immediately and dry the plate.\nThe area stained in purple indicates the hPSCs that survived during orlistat treatment.",
    "Based on our experiments, optimal dose and duration of orlistat treatment are those which achieve more than 90% efficiency of elimination. Excess dose and duration may be toxic to differentiated cells.\nAfter optimal dose and duration of orlistat treatment have been determined by the above steps (on day 5 or later), seed hPSC-CMs in collagen I-coated 150 mm culture dishes.\nTwo days later, prepare StemFit AS103C with orlistat of the determined concentration.\nChange the culture medium to AS103C supplemented with orlistat and incubate the hPSC-CMs for 24–72 h.\nObserve the viability of hPSC-CMs by LIVE/DEAD assay.\nLIVE/DEAD assay.\nPrepare staining solution by mixing 7.5 mL D-PBS, 15 μL ethidium homodimer-1 solution, and 3.75 μL calcein-AM solution for a 150 mm culture dish.\nAspirate the culture medium and leave 7.5 mL of the culture medium in the culture dish.\nAdd the staining solution into the culture dish.\nIncubate for 30 min in an incubator at 37°C.\nRemove the mixture of culture medium and staining solution and replace with 20 mL AS103C.\nObserve live and dead cells under a microscope (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1616-Fig2.jpg\nFigure 2. LIVE/DEAD Assay of hiPSC (253G4)-derived cardiomyocytes (hiPSC-CMs) treated with or without 6 μM orlistat for 72 h\nOrlistat treatment does not affect the viability of hiPSC- CMs. Scale bars: 200 μm.\nCritical: The plate must be protected from light during the procedure for alkaline phosphatase staining.\nEvaluation of hPSCs elimination efficiency by spike cultures\nTiming: 5 days\nThis section describes the protocol to determine whether a small molecule of interest can selectively eliminate undifferentiated hPSCs in the presence of other types of cells (somatic cells). This section uses hPSC-CMs purified utilizing the purification method described above. For the use of iMatrix-221, refer to this link for further information.\nDilute iMatrix-221 in D-PBS.",
    "For a 12-well plate (culture area: 3.8 cm2), dilute 3.8 μL of iMatrix-221 in 1 mL of D-PBS per well.\nApply the diluted iMatrix-221 to the wells (for example, 1 mL per well) and incubate the plate for 1 h at 37°C, 3 h at room temperature, or overnight at 4°C.\nPrepare a suspension of hPSC-CMs as described above with StemFit AS103C + 10 μM Y-27632.\nPrepare a suspension of undifferentiated hiPSCs as described above with StemFit AS103C plus 10 μM Y-27632.\nDetermine the cell numbers of the hPSC-CMs and undifferentiated hiPSCs.\nPrepare a suspension containing hPSC-CMs (5 × 105 cells/mL) and undifferentiated hiPSCs (5 × 104 cells/mL).\nAspirate diluted iMatrix-221 from the wells and add 1 mL of the cell suspension to each well.\nDo not dry the well after aspiration of iMatrix-221.\nGently rock the culture plate to ensure that the cells are uniformly dispersed within the well.\nGently place the culture plate in an incubator (37°C, 5% CO2).\nOn the next day (just before 24 h after seeding the cells), prepare culture medium containing the small molecule of interest.\nFor example, dilute 0.5 μL of stock solution of orlistat (12 mM) in 1 mL of StemFit AS103C culture medium.\n24 h after seeding the cells, aspirate the culture medium and replace it with culture medium containing the small molecules.\nIncubate at 37°C, 5% CO2.\nObserve the cell status under a phase-contrast microscope every 24 h. If undifferentiated hiPSCs are successfully eliminated, only beating CMs can be observed.\n72 h after initiation of the treatment, use the evaluation method of your choice, such as immunocytochemistry or flow cytometry.\nImmunocytochemistry.\nRinse the cells with D-PBS and fix with ice-cold 4% PFA for 15–20 min at room temperature.",
    "Rinse the cells with D-PBS and treat with 0.1% Triton X-100 diluted in D-PBS for 5–15 min.\nTreat the cells with ImmunoBlock for 30 min.\nDilute primary antibodies against OCT4 (Abcam, ab200834, 1:200) and α-actinin (Sigma-Aldrich, A7811, 1:200) with ImmunoBlock reagent.\nApply the diluted antibodies to the cells and incubate overnight at 4°C.\nRemove the diluted antibodies and rinse the cells twice with D-PBS.\nDilute the secondary antibodies: 1:200 donkey anti-mouse IgG (H+L) highly cross-adsorbed secondary antibody, Alexa Fluor 488 (Thermo Fisher Scientific, A21202) and 1:200 donkey anti-rabbit IgG (H+L) highly cross-adsorbed secondary, Alexa Fluor 546 (Thermo Fisher Scientific, A10040) with ImmunoBlock reagent.\nApply the diluted antibodies to the cells and incubate for 1 h at room temperature.\nRemove the secondary antibodies and rinse the cells with D-PBS.\nDilute Hoechst 33342, 1:2,000 in D-PBS.\nApply diluted Hoechst 33342 to the cells and incubate at room temperature for 1 h.\nRemove Hoechst 33342 and apply D-PBS to the cells.\nObserve the cells under a microscope. If undifferentiated hiPSCs are successfully eliminated, OCT4-positive undifferentiated hiPSCs will disappear, and only α-actinin-positive hPSC-CMs could be observed (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1616-Fig3.jpg\nFigure 3. Elimination of undifferentiated hPSCs by spike culture\n(A and B) Control.\n(C and D) Orlistat-treated cells.\nMetabolic selection of hiPSC-derived neurons with orlistat treatment\nTiming: 7 days",
    "This section describes orlistat treatment for the removal of residual undifferentiated hPSCs during neuronal differentiation of hiPSCs. Neuronal differentiation was induced by transfection of mRNA based on a previously published protocol (Goparaju et al., 2017[href=https://www.wicell.org#bib1]). The mRNA was synthesized from 1 μg of a template DNA encoding NEUROG2 and 3′UTR (Goparaju et al., 2017[href=https://www.wicell.org#bib1]) with an mMESSAGE mMACHINE™ T7 Transcription Kit (Invitrogen, AM1344). In vitro transcription was performed at 37°C for 18 h. m7G Cap Analog (NEB, S1411L), and 5-methyl cytidine-5′-triphosphate (TriLink, N1014) and pseudouridine-5′-triphosphate (TriLink, N1019) were included at the reaction to reduce cytotoxicity when they are transfected into the cells. The purified mRNA (∼30 μg) was stored as aliquots at −80°C until further use.\nThis protocol selectively removes residual undifferentiated hPSCs from a population of hiPSC-derived neurons, without the need for cell sorting or reseeding steps (Figure 4[href=https://www.wicell.org#fig4]). Here, we describe a 24-well plate scale protocol, but this protocol can be adapted to different plate scales by adjusting the number of hiPSCs for seeding and the volume of reagents per well.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1616-Fig4.jpg\nFigure 4. Elimination of residual undifferentiated hPSCs during neuronal differentiation\n(A) Control.\n(B) Orlistat treated from day 3 to day 4 post-neuronal differentiation.\n(C) Orlistat treated from day 3 to day 7 post-neuronal differentiation. (A–C) The cells were fixed on day 7. Scale bars: 500 μm.\nDilute iMatrix-511 in D-PBS.\nFor a 24-well plate (culture area: 2 cm2), dilute 1.65 μL of iMatrix-511 in 0.5 mL of D-PBS per well.\nApply 0.5 mL of the diluted iMatrix-511 to the wells and incubate the plate for 1 h at 37°C.\nPrepare StemFit AK02N medium supplemented with 10 μM Y-27632.\nPrepare a suspension of 2 × 105 cells/mL in StemFit AK02N medium with Y-27632.",
    "Aspirate the diluted iMatrix-511 from the wells and apply 500 μL of the cell suspension prepared in the previous step to each well.\nDo not dry the well after aspiration of iMatrix-511.\nThe following day (day 0), transfect NEUROG2 synthetic mRNA to induce neural differentiation as follows:\nAdd 2 μL of Lipofectamine Messenger Max to 50 μL of OPTI-MEM medium and vortex briefly at medium speed. Leave at room temperature (25°C) for 10 min (Solution A).\nAdd 1 μg of NEUROG2 synthetic mRNA in 50 μL of OPTI-MEM medium and vortex briefly at medium speed. (Solution B).\nMix solutions A and B and vortex briefly at medium speed. Incubate the mixture at room temperature for 4 min.\nSlowly drop the mixture onto the cells.\nAt 3 h post-transfection, change the medium to 500 μL of StemFit AK02N with 10 μM Y-27632.\nAfter 1 h, repeat steps a–e.\nOn day 1, transfect the synthetic mRNA once following steps a–e.\nMost of the hiPSCs (∼90%) should be transfected with the synthetic mRNA and can be differentiated into mature neurons (Goparaju et al., 2017[href=https://www.wicell.org#bib1]). The non-transfected cells occupy a small population, but they will continue to proliferate in an undifferentiated state.\nOn day 2, change the medium to 500 μL of StemFit AK02N.\nOn day 3, change the medium to 500 μL of StemFit AK02N with 6 μM orlistat. Treat the cells with orlistat for 4 days. Change half of the medium daily from day 3 to day 7. Orlistat causes cell death of only undifferentiated hPSCs.\nOn day 7, most of the cells should be differentiated into neurons. Perform your desired experiments (e.g., immunofluorescence, RT-PCR, electrophysiology, etc.).\nImmunocytochemistry.\nRinse the cells with D-PBS and fix with ice-cold 4% PFA for 15–20 min at room temperature.",
    "Rinse the cells with D-PBS and treat with 0.1% Triton X-100 diluted in D-PBS for 5–15 min.\nTreat the cells with ImmunoBlock for 30 min.\nDilute the primary antibodies against OCT4 (Santa Cruz Biotechnology, sc-5279, 1:1000) and βIII-tubulin (Cell Signaling, 5666, 1:1000) with ImmunoBlock.\nApply the diluted antibodies to the cells and incubate for 3 h at room temperature.\nRemove the diluted antibodies and rinse the cells twice with D-PBS.\nDilute the secondary antibodies (donkey anti-mouse IgG secondary antibody, Alexa Fluor 594 (Thermo Fisher Scientific, A21203, 1/500) and goat anti-rabbit IgG, Alexa Fluor 488 (A11008, 1/500; Thermo Fisher Scientific).\nApply the diluted antibodies to the cells and incubate for 1 h at room temperature.\nRemove the secondary antibodies and rinse the cells with D-PBS.\nStain the nuclei with DAPI (Dojindo, D523) for 5 min at room temperature.\nRemove DAPI and apply D-PBS to the cells.\nObserve the cells under a microscope.\nCritical: Treatment with orlistat for 1 d can cause cell death, but such a short treatment is not sufficient to remove all undifferentiated hPSCs.\nCritical: Early treatment with orlistat (e.g., from day 1 post neuronal induction) can cause cell death of not only undifferentiated hPSCs but also differentiating cells. Treatment from day 2 or 3 is effective for selectively removing undifferentiated hPSCs."
  ],
  "subjectAreas": [
    "Cell Differentiation",
    "Cell Culture",
    "Cell Isolation",
    "Stem Cells"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}