{
  "id": 11856,
  "origin_website": "Jove",
  "title": "Robotic Pancreatoduodenectomy for Pancreatic Head Cancer: a Case Report of a Standardized Technique",
  "procedures": [
    "The present protocol follows the ethics guidelines of the Amsterdam UMC. Written and oral consent was obtained from the patient to use her medical data and operative video for publication of this article. A copy of written consent is available for review by the Editor-in-Chief of this journal.\n1. Preoperative work-up\nEvaluate the CT scan for the extent of the tumor and check for any aberrant vasculature and determine a surgical approach accordingly.\nCheck for the relative contraindications for RPD, such as a BMI >35 kg/m2 and tumor involvement in the portal vein or superior mesenteric vein requiring vascular reconstruction and previous major abdominal surgery with possible adhesions.\n\t​NOTE: It is possible to perform a vascular reconstruction during RPD, once the surgical team has sufficient experience (i.e., experience >80-100 RPDs).\n2. Installation\nNOTE: The procedure is performed by two experienced surgeons: the console surgeon and the tableside surgeon. These two surgeons may swap positions after the resection phase has been completed. Alternatively, some centers report an approach where the tableside surgeon is replaced by an experienced surgical fellow, resident or scrub nurse. The advice is to complete the full learning curve with a two-surgeon approach.\nPatient positioning\n\t\nPlace the patient in a supine 20° reverse Trendelenburg position with 20° left-tilt, right arm lowered on an arm board and left arm abducted. Part the lower limbs in the French position with the left leg horizontal to facilitate the tableside surgeon's position.\nPosition the compression stockings, sequential compression device, warming device for legs and a urinary catheter.\nSurgeon position\n\t\nApply chlorohexidine and create a sterile exposition.\nPosition the first surgeon between the patient's legs and the second surgeon at the left side and the assistant at the right side of the patient.\nPneumoperitoneum and trocar measurement\n\t\nStart the procedure laparoscopically.",
    "Place a Veress needle at the Palmer's point to induce a CO2 pneumoperitoneum pressure up to 10-12 mmHg.\nMeasure and mark the position of the robot and tableside surgeon trocars. Mark the camera port 11-12 cm from the costal margin towards a position 2-3 cm to the right of the umbilicus (Figure 2).\nMark the vision port and second 12 mm port position 7 cm away from the camera port.\nMark a robotic port 7 cm to the left of the camera port in the left midclavicular line (arm 4) and a robotic port 7 cm to the right of the camera port in the right midclavicular line (arm 2).\nMark the robot port for arm 1, 7 cm cranio-lateral from the arm 2 trocar.\nPort placement\n\t\nPlace the vision port, second 12 mm port and all 4 robotic ports on the marked locations.\nPlace a 5 mm port in the left upper quadrant, through which an angulated (45°) snake liver retractor is placed under liver segment 3-4.\nOptionally, retract the Teres ligament cranially using a percutaneous straight needle.\nDiagnostic laparoscopy and initial mobilization\n\t\nPerform a full diagnostic laparoscopy for metastases.\n3. Resection\nNOTE: The sequence of instruments during each operative step is seen in Table 1.\nLigament of Treitz\n\t\nCranialize the greater omentum and colon.\nDissect the left side of the ligament of Treitz to free the most distal part of the duodenum and the first part of the jejunum from the aorta.\nMobilization ascending colon\n\t\nDissect along the greater curvature towards the pylorus and fully mobilize the ascending colon and the hepatic flexure to facilitate safe uncinate dissection.\nDissect the gastrocolic ligament.\nDocking",
    "Position and dock the robot over the right shoulder of the patient to the previously positioned trocars. Robot arm 1 is equipped with cadiere forceps, arm 2 is equipped with fenestrated bipolar forceps, arm 3 is equipped with the camera, and arm 4 is equipped with cautery hook. The tableside surgeon is equipped with a blunt tip vessel sealing device.\n\t\tNOTE: If the entire operating table is rotated 45° with the patient's legs to the left in the operating room, the robot can enter cranially over the right shoulder to provide sufficient space for the 3D-screen next to the robot and provide space for the scrub nurse with a table. In this way the tableside surgeon can comfortably use the 3D screen with limited neck rotation.\nOmental bursa (Lesser sac)\n\t\nRetract the stomach cranially.\nOpen the omental bursa (lesser sac) by dividing the gastrocolic ligament approximately 2 cm below the gastroepiploic pedicle.\nContinue the mobilization towards the hepatic flexure.\nKocher maneuver\n\t\nKocher until the left renal vein, while arm 1 is retracting the stomach and duodenum to the patients' left.\nRetract the proximal jejunum through the ligament of Treitz defect into the right supracolic upper quadrant (creation of the jejunal loop for the reconstruction phase).\n\t\tNOTE: Be careful of tearing the branches of the SMV due to traction from the duodenum. The traction can be minimized by retracting the colon to the patients' left.\nTransection of the proximal jejunum\n\t\nTransect the jejunum approximately 10 cm distally from the pancreas with a 60 mm vascular linear stapler.\nLinearization of the duodenum\n\t\nMobilize the duodenum until the pancreatic head with a blunt tip vessel sealing device.\nDissection and transection of right gastric artery (RGA)\n\t\nMobilize, clip, and transected the right gastric artery using a blunt tip vessel sealing device.",
    "Transection of the distal stomach\n\t\nSkeletonize the distal stomach just before the pylorus.\nRetract the nasogastric tube 10 cm and transect the stomach 1-2 cm proximal to the pylorus with a 60 mm thick linear stapler.\nPortal dissection\n\t\nStart the portal dissection with arm 1 retracting the staple line to the right lower quadrant.\nHepatic artery lymph node (8a)\n\t\nIdentify lymph node station 8a (hepatic artery lymph node), mobilize, extract in an extraction bag (alternatively: cut finger of surgical glove), and send to pathology.\nMobilize the common hepatic artery.\nSkeletonization of gastroduodenal artery (GDA) and replaced right hepatic artery\n\t\nSkeletonize the replaced right hepatic artery and GDA. Place vessel loops around both vessels and fixate with clips as a means of retraction as shown in Figure 3.\nRotate the specimen to the patients' left so the hepato-duodenal ligament can be visualized from the right side. Lift the neck of the gallbladder using robot arm 1 and mobilize the replaced right hepatic artery. Place vessel loops and fixate with clips.\nDissection and transection of the common hepatic duct\n\t\nDissect and transect the biliary system. Then transect the common hepatic duct with cold scissors between bulldogs (alternatively stapled using a vascular cartridge).\nTransection of GDA\n\t\nAfter the arterial anatomy has been confirmed, test-clamp the GDA and transect.\nTransect using a 60 mm vascular linear stapler and place two additional metal clips at the hepatic artery side.\nExposure of the pancreas and superior mesenteric vein.\n\t\nExpose the lower border of the pancreas\nTunneling the pancreas\n\t\nCreate a wide tunnel under pancreas, tunneling the pancreas using a blunt tip vessel sealing device.\nPancreatic transection\n\t\nCircle the pancreas with a vessel loop, fixate with a clip, and retract cranially with arm 1.",
    "Transect the pancreas with diathermic scissors but be careful not to close the pancreatic duct with the diathermia.\nIdentification of pancreatic duct\n\t\nIdentify pancreatic duct for 'cold' transection and hemostasis.\nUsing the scissors bluntly, carefully mobilize the porto-mesenteric vein away from the pancreatic head to expose the 'mesopancreas'.\nUncinate process\n\t\nDissect in the following three phases.\nVenous mobilization\n\t\nMobilize the entire ventral side of superior mesenteric vein from the pancreatic neck down to the uncinate process using a diathermia hook on robot arm 4.\n\t\tNOTE: Take care of the right gastro-epiploic vein and (potentially) the right colonic vein.\nTransection of the right gastro-epiploic vein\n\t\nClip the right gastro-epiploic vein and transect between the clips using a blunt tip vessel sealing device.\nDissection along the SMA\n\t\nUse robot arm 1 to retract the duodenum close to the uncinate process to the patients right lower quadrant.\nDissect between the pancreatic head and the superior mesenteric artery using a blunt tip vessel sealing device.\nIdentify the origin of the inferior pancreaticoduodenal artery and secure with (metal) clip(s) before transecting with a blunt tip vessel sealing device.\n\t\tNOTE: Take care not to damage the first jejunal venous branch.\nDissection along the right hepatic artery\n\t\nFurther dissect the pancreatic head by dissecting proximally with a blunt tip vessel sealing device along superior mesenteric vein and portal vein.\nTransect any venous branches originating from the pancreatic head. Identify and clip the superior lateral pancreaticoduodenal vein (Belcher's vein) before transecting with a blunt tip vessel sealing device.\n\t\tNOTE: In case of a replaced right hepatic artery, the inferior and superior pancreaticoduodenal artery can have anatomical variations.\nLymphadenectomy and endobag\n\tNOTE: Because this patient has a replaced right hepatic artery the lymph nodes behind the portal vein and right hepatic artery may have to be dissected separately.",
    "Place the specimen (and lymph nodes if applicable) in a large endobag.\nPlace the endobag in the right lower quadrant.\nCholecystectomy (if applicable)\n\tNOTE: This patient had a history of cholecystectomy; otherwise cholecystectomy is performed as the final part of the dissection phase.\n\t\nPlace the gallbladder in a separate endobag and place this (smaller) endobag on top of the liver.\n\t\tNOTE: Cholecystectomy is a good procedure for an experienced surgical resident or fellow who completed basic robot training previously.\n4. Reconstruction\nDrain placement\n\t\nPlace a surgical drain fully in the abdomen.\nPosition the drain (#1) through Winslow, and retract far to the left, with the end of the drain under the endobag.\n\t\tNOTE: After completion of the pancreatic and bile duct anastomoses, this drain's end section will be extracted via the robot port for arm 1, such that it drains both anastomoses.\nPancreatico- and hepatico-jejunostomy\n\t\nEquip robotic arm 1 with cadiere forceps.\nEquip robotic arm 2 with large needle driver with suture cut.\nEquip robotic arm 4 with large needle driver and switch to monopolar curved scissors for both enterotomies.\nSet up the jejunal loop.\nPancreatico-jejunostomy (PJ)\n\t\nPerform the PJ in a two-layer, end to side, duct-to-mucosa method, according to the modified Blumgart technique.\nMattrass\n\t\t\nPlace three 2-0 18 cm silk mattress sutures. Drive the 2-0 silk suture at the cranial side of the pancreas through the entire pancreas, approximately 1 cm from the cut margin.\nDrive the suture through the jejunum from a cranial to caudal position. Drive the needle back through the pancreas towards the anterior plane and hold both ends with arm 1.\nRepeat this at the central position of the pancreas around the pancreatic duct and hold with arm 1.\nLastly repeat this at the caudal position of the pancreas.",
    "Tie the suture at the caudal position of the pancreas.\nPut a 7 French 6 cm single loop urology stent in the pancreatic duct. Tie the suture at the central position of the pancreas and remove stent after tying.\n\t\t\tNOTE: Be gentle to avoid suturing the pancreatic duct.\nLastly tie the suture at the cranial side of the pancreas and leave all the needles on the sutures.\nDuct-to-mucosa (DTM)\n\t\t\nPerform enterotomy with diathermic scissors on arm 4.\nPlace 3 to 5 posterior wall 5-0 (polydioxanone) PDS 8 cm duct-to-mucosa sutures, starting with the 8 o'clock position. Retract both ends with arm 1.\nReplace the pancreatic duct stent. This can be used to prevent accidental closing of the duct with anterior sutures in case of a narrow pancreatic duct.\nNow place 3-5 anterior 5-0 PDS 8 cm sutures, initially without tying to allow for optimal view on the (often narrow) duct.\nAfter placing, tie all PDS sutures.\nButtress\n\t\t\nReuse the same three silk needles, previously used for the posterior layer, for the anterior layer of the PJ.\nDrive the suture through the jejunum in an oblique direction in the corners and in a lateral direction in the middle and tie these to complete the anastomosis.\n\t\t\tNOTE: It is essential that the jejunum \"overlaps\" on the pancreas.\nHepatico-jejunostomy (HJ)\n\t\nCreate a loop of about 10 cm between PJ and HJ.\nUsing diathermic scissors on arm 4, open the bowel antimesenteric.\nPerform a single layer anastomosis using 8 to 10 interrupted 5-0 PDS 8 cm sutures or two running 4-0 barbed 15 cm sutures. Both techniques are described below.\nRunning technique\n\t\t\nUse monopolar curved scissors to perform the enterotomy.",
    "Anchor the first barbed suture at the 7 o'clock position (bile duct inside-out). Run the suture twice when anchoring because of the lack of hooks in the first cm of the suture.\nAnchor the second barbed suture at the 9 o'clock position (bile duct outside-in), again twice, and hang with arm 1.\nRun the suture for the posterior row towards the 3 o'clock position.\nRun the suture for the posterior row towards the 3 o'clock position.\nTie the two barbed sutures to complete the anastomosis.\nPlace a gauze on the HJ anastomosis to check for possible bile leakage.\n\t\t\tNOTE: Only use barbed sutures for a thick bile duct wall to prevent perforation due to the hooks.\nInterrupted technique\n\t\t\nStart with placing the posterior sutures.\nStart at the posterior row at the 6 o'clock position and tie, then place 2 sutures on either side and tie.\nPlace the sutures in the corners and tie.\nPlace and tie the sutures on the anterior row to complete the anastomosis.\nPlace gauze on the HJ anastomosis to check for possible bile leakage.\n\t\t\tNOTE: In case of a thin bile duct wall a stay suture may be placed between the jejunum and the gallbladder bed.\nGastrojejunostomy (GJ) preparation\n\t\nIntroduce one end of a 60 cm long barbed suture (with needle), and grab with arm 1 at the lever of the HJ.\nUse robot arms 2 and 4 and 'walk' 60 cm on the bowel together with the suture.\nPlace two 3-0 silk marking stitches on the jejunum to mark the correct bowel position for the GJ: double end on the proximal side ('double = duodenum') and a single just distal.\nReflect the omentum and mesocolon cephalad by the laparoscopic assistant and locate the jejunal loop and both sutures.",
    "Position the loop next to the stomach, which is held by arm 1, with the double end suture to the left.\nSuture this loop to the posterior surface of the stapled end of the stomach with stay sutures.\nDrain extraction\n\t\nCheck the gauze on HJ for bile leakage and remove.\nRemove robot arm 1. Extract the end-section of the earlier placed drain #1 using a laparoscopic grasper and fixate on the skin.\nLigament patch and laparoscopic graspers\n\t\nMobilize and position the round ligament on top of the portal vein, between the gastroduodenal artery (GDA) stump and the PJ.\nSecure both ends of the endobag with clips and grab this and the gastro-jejunostomy location with two laparoscopic graspers.\nRemove the liver retractor.\nUndocking\n\t\nUndock the robot from the trocars and remove the robot from the operating table.\nGastrojejunostomy and specimen extraction\n\t\nMake a muscle-sparing transverse incision in the left upper quadrant from the 5 mm trocar to medial, through the rectus sheath.\nIntroduce a medium hand port and extract both endobags.\nExtract the gastrojejunostomy site.\nPerform a single-layer gastrojejunostomy (GJ) with running PDS 3-0 sutures. This is a child type anastomosis.\nEnterotomy and GJ anastomosis\n\t\nRemove staple lines on the stomach side and perform enterotomy on the jejunum.\nSuture the posterior and anterior walls of the anastomosis in a running fashion.\nEfferent marking\n\t\nInject 2 mL of tattoo-blue in the efferent limb of jejunum to facilitate endoscopic placement of a naso-jejunal feeding tube ('blue is for you'), if needed.\nPerform the GJ through the transverse, muscle sparing, incision.\n\t\t​NOTE: The GJ is a hand sewn, antecolic, end-to-side anastomosis.\n5. Closure\nExtraction site closure\n\t\nClose the fascia in two layers, using two single needle PDS 2-0 sutures.\nDrain placement #2\n\t\nRe-insufflate and check GJ anastomosis laparoscopically. Remove any fluid using suction.",
    "Place drain #2 through robot trocar 4 until under liver segment 3 and fixate.\nTrocar site closure\n\t\nClose the fascia of all 12 mm trocar sites and skin intracutaneously.\n6. Post-operative management\nClose the nasogastric tube at 06:00 h the next morning. If retention is <200 mL, remove after 4 h and start with a soft liquid diet for 72 h.\nAssess drain amylase on day one and three and serum CRP on day three and four.\nStart supervised walking on the first postoperative day.\nPerform a CT abdomen if CRP does not decrease between day three and four with at least 10%.\nDischarge patients once all medical or surgical complications have been completely managed.\nRemove drains when amylase is less than three times the upper limit of normal serum amylase and the production is less than 250 mL/24 hours."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}