{
  "id": 18819,
  "origin_website": "Jove",
  "title": "A Murine Model of Cervical Spinal Cord Injury to Study Post-lesional Respiratory Neuroplasticity",
  "procedures": [
    "This protocol was approved by the Ethics committee of the RBUCE-UP chair of Excellence (University of Paris Sud, grant agreement No. 246556) and the Université de Versailles Saint-Quentin-en-Yvelines.\n1. Preparation of Sterilized Surgical Instruments\nClean the surgical instruments with laboratory detergent.\nAutoclave the instruments prior to surgery.\nIn a surgical session, sterilize the tools by placing the tips in a hot bead sterilizer for 10 min at 180 °C between 2 surgeries.\n2. Preparation of Drugs\nPrepare 2 x 1 ml syringes for pre-anesthetic drugs cocktail and post-operation drugs.\nAccording to the weight of the rat, prepare a syringe with pre-anesthetic drugs: Carprofen (5 mg/kg), Buprenorphine (50 μg/kg), Baytril (5 mg/kg) and Dexmedetomidine (0.5 mg/kg). Complete the volume to 1 ml with Lactated Ringers.\nPrepare in another syringe the reversal for the pre-anesthetic drugs: Atipamezole (500 μg/kg).\n3. Anesthesia of the Rat\nAdminister subcutaneously to the animal the solution of pre-anesthetic drugs described in step 2.2. Then, put the animal back in cage and wait until the sedative effect appears.\nPlace the rat into a closed chamber filled up with 5% isoflurane in 100% O2, and wait until the respiratory rhythm slows down (around 30 sec). Then, remove the rat from the chamber and place it onto the intubation table.\n4. Orotracheal Intubation\nLie the animal on his back, then secure the head by placing a strap attached to his front teeth to the table.\nWith a fiber optic light, light up the thoracic space. Then, place a laryngoscope (or a custom made one, Jou et al.20 for details) in the animal’s mouth. Visualize the vocal cords.\nSlide and place an orotracheal guide into the trachea (between the vocal cords). Slide the orotracheal tube (16 G catheter size) on the guide.",
    "Remove the guide and check with a laryngeal mirror placed at the end of the orotracheal tube for the presence of moisture, confirming the appropriate position of the tube in the trachea and not in the esophagus.\nConnect the tube to a rodent ventilator (683 rodent ventilator, Harvard Apparatus) and adjust the concentration of isoflurane to 2% (in 100% O2).\nSecure the orotracheal tube with surgical tape.\n5. Spinal Surgery\nPlace the animal in ventral decubitus position on a heated surgical plate, with the nose pointing at 90° angle to the surgeon. Maintain the body temperature around 37.5 °C throughout the surgery.\nShave the hair with clippers between the scapulas and remove the hair with gauze.\nClean the skin with betadine, then with 70% alcohol. Repeat this step 3x. \nA toe pinch is performed before beginning of surgery to ensure proper anesthetic depth. Then, perform a lateral skin incision rostro-caudally with scissors between the scapulas.\nCut the acromiotrapezius muscle rostro-caudally by following the tendon to prevent any bleeding. Then dissociate the rhomboid muscle to access the spinalis muscles (surrounding the vertebra).\nRetract the spinalis muscle from C1 to C3 vertebra. The C2 vertebra is the one with a prominent apophysis.\nClean the muscle around the dorsal part of the vertebra by using sterile cotton swabs.\nStart to remove carefully the apophysis of C2 with a rongeur. Then, continue meticulously until the dorsal spinal cord is exposed. Ensure that laminectomy is a dorsal hemi laminectomy. Pay careful attention to the dura which encloses the spinal cord, and arteries in the vicinity of this area.\nWith a #55 forceps, dissect rostro-caudally the dura along C2, next continue laterally on each rostral and caudal side.\nSponge up the cerebrospinal fluid.",
    "Make a lateral section under the cervical dorsal root number 2 with the microscissors. Verify with a micro scalpel that the extent of the lesion is close enough to reach the midline of the spinal cord (see Figure 2A for a dorsal view of the injury). If not, then another cut could be made to complete the injury. In case of bleeding, use sterile cotton swabs. Be careful not to go to the contralateral side, otherwise, the animal will not recover from the injury and will have a respiratory failure.\nSuture the muscles as a protective layer and suture back the skin. Clean the wound with Betadine saturated sterile gauze.\nTurn-off the isoflurane vaporizer and inject the reversal drugs (Atipamezole [500 μg/kg, i.m.]), check the body temperature.\nWhen the animal starts to breathe against the ventilator, disconnect the tracheal tube from the ventilator, and then remove the orotracheal tube. Place the animal in a heated cage for recovery.\n6. Post-surgical care\nFollowing surgery, the animals are monitored continuously to ensure the best environment possible for recovery. Antibiotics (Baytril, 5 mg/kg), anti-inflammatory (Carprofen, 5 mg/kg) and Buprenorphine (50 μg/kg) drugs are given every 12 hr for the first 2 days post-surgery to prevent infections and reduce the occurrence of post-operative pain. Rats have access ad libitum to soft food and water (or jellified water for the 1st post-operative day). Subcutaneous fluids can be used to prevent dehydration on the first few post-operative days. The body weight and the food intake are monitored daily. Their environment is enriched throughout the experiment and time post-injury (dual housing, tubing in their cages).Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}