{
  "id": 3592,
  "origin_website": "Cell",
  "title": "Differential Centrifugation to Enrich Bacterial Ribonucleoprotein Bodies (BR bodies) from Caulobacter crescentus",
  "procedures": [
    "Step-By-Step Method Details\nStep-By-Step Method Details\nPrepare Initial Cultures: Day 1\nTiming: 16–18 h\nThis step describes how to culture Caulobacter starting from freezer stocks.\nUse a scrape of a freezer stock to inoculate each bacterial strain in 5 mL PYE medium with 0.2% xylose, 0.5 μg/mL gentamycin, and 5 μg/mL kanamycin in a 10 mL test tube.\nFor each strain, make three 1: 20 serial dilutions (5 mL each in 15 mL test tubes) and incubate the cultures in a shaker incubator at 28 ˚C while shaking at 250 rpm overnight (~16 h).\nNote: All cell growth incubations are performed at 28 ˚C in a shaker/incubator at 250 rpm in PYE growth medium. Make sure to mix the culture tube well to have a homogeneous cell suspension before preparing the dilutions. The purpose of serial dilution is to get a bacteria culture with appropriate cell density and in log-phase of growth to inoculate the large culture. It prevents giving high dense overnight cultures.\nNote: In working with Caulobacter crescentus depletion strains, it can be useful to validate the depletion phenotype by growing the cells in PYE supplemented with 0.2% xylose and without. The cells should exhibit growth only in the presence of xylose. If growth is not xylose dependent, this indicates that the culture has a suppressor mutation and one needs to re-streak the culture to identify a colony which requires xylose for growth.\nGrow and Harvest Cell Cultures: Day 2\nTiming: 10–12 h\nThis step describes how to grow and harvest Caulobacter cells.\nWash the overnight culture 3× with PYE growth media and resuspend the washed cells in fresh 5 mL of PYE growth media.\nTake a 1 mL aliquot of the culture and measure the optical density (OD600 nm).",
    "Dilute the culture in 30 mL of PYE medium supplied with vanillate (500 μM), gentamycin (0.5 μg/mL) and kanamycin (5 μg/mL) to an OD600 nm of 0.05 in a 125 mL Erlenmeyer flask. Mix well and measure the starting OD600 nm of the culture by taking a 1 mL aliquot.\nIncubate cells at 28 ˚C and 250 rpm and measure the OD600 nm every 2 h until it reaches ~0.4–0.6.\nConfirm presence of BR bodies by imaging a 1 μL aliquot of both JS299 and JS221 strains on M2G 1.5% agarose pads (Skinner et al., 2013[href=https://www.wicell.org#bib11]) before harvesting the cells (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/316-Fig1.jpg\nFigure 1. BR-Body Verification before Cell Harvesting (Step 7)\n(A) The formation of RNase E-YFP foci is observed in the ASM strain (JS 299).\n(B) Diffuse localization of the RNase E-YFP CTD deletion mutant (JS221), which cannot assemble BR bodies.\nTo harvest, transfer cells to a 50 mL conical tube chilled on ice, and pellet cells at 11,000 × g for 5 min at 4°C. Remove the supernatant and resuspend the cell pellet in 2.5 mL of ice-cold lysis buffer.\nSlowly drip the cell pellet/lysis buffer suspension into a 50 mL conical tube half-full of liquid nitrogen. Poke holes in a 50 mL conical lid using a hot needle and pour out remaining liquid nitrogen in the tube. Once liquid nitrogen has completely evaporated, cap with a new lid and store the cell pellet in a −80°C freezer.",
    "Note: Cultures should be grown for 8 h until they reach mid-exponential phase of growth (OD 0.4–0.6). It takes approximately 8 h for Caulobacter to fully replace the wild-type RNase E expressed from the xylose promoter with the RNase E variant expressed from the vanillate promoter. The optimal timescale for replacement was determined by western blot (Al-Husini et al., 2018[href=https://www.wicell.org#bib1]) and changes to this timing may alter the amount of active RNase E present in the cell.\nNote: It is important to examine and confirm the formation of RNase E–YFP foci by imaging the cells after few hours of induction. In this specific protocol, after 4 h and 8 h of incubations 1 μL of cells were spotted onto a M2G 1.5% agarose pad, air dried, and imaged with immersion oil on a coverslip (Figure 1[href=https://www.wicell.org#fig1]). Images were taken in phase-contrast and fluorescence (YFP) using a filter cube.\nNote: Optical density should be measured at 600 nm in a cuvette with a 1 cm path length.\nCritical: Use cryogenic gloves and a face shield when working with liquid nitrogen.\nCell Lysis and BR-Body Enrichment: Day 3\nTiming: 5–7 h\nLyse cells in a mixer miller\nTiming: 1–2 h\nThis step describes how to cryogenically lyse bacteria cells using a mixer miller.\nChill assembled jar (10 mL) and grinding ball (12 mm) in liquid nitrogen.\nOpen the pre-chilled jar and add the frozen cell pellet/lysis buffer suspension.\nMill at 15 Hz for 3 min. Re-chill the sealed jar in liquid nitrogen until it stops bubbling between each run. Repeat for five total cycles of milling.",
    "Briefly pre-chill a scoopula and 1.5 mL microcentrifuge tube in liquid nitrogen. Open the jar, and take a small scoop of the frozen pulverized cells using a pre-chilled scoopula and transfer it to a pre-chilled 1.5 mL microcentrifuge tube labeled “whole-cell lysate” and store at −80°C.\nTo thaw the remaining lysate, place each half, chamber side up, in a shallow pool of warm 30°C water. Be careful that the water level is low enough that it will not leak into the jars.\nCritical: Lysing for too long and too continuously in a small volume may cause heating of the sample; this may result in degradation of the RNA. Therefore, samples should be kept frozen during lysis, and mixing should be done in short on-off cycles with care to ensure the jar is properly chilled. Once thawed, the BR bodies are labile so care should be taken to work quickly.\nNote: Use cryogenic gloves and a face shield when working with liquid nitrogen.\nNote: Since BR bodies are highly labile upon cell lysis, cryogenic mixer milling allows a significant reduction in the time the lysate is thawed, allowing higher yields of BR bodies than methods performed on liquid-samples such as French press or sonication.\nDifferential Centrifugation steps\nTiming: 30 min to 1 h\nThis step describes the differential centrifugation steps involved in BR-body enrichment.\nMove the thawed lysate into a 1.5 mL Eppendorf tube and spin at 2,000 × g for 5 min to remove cell membranes, intact cells, and large cell debris.\nCarefully transfer the supernatant into a fresh 1.5 mL tube and spin at 10,000 × g for 10 min.\nResuspend the resulting BR-body pellet by gently pipetting up and down in 1.2 mL of lysis buffer and spin at 20,000 × g for 10 min.",
    "For RNA isolation, resuspend the BR-body-enriched pellet in 200 μL of lysis buffer, and proceed to step 12. For protein isolation, resuspend the final pellet in 200 μL of lysis buffer containing 1% SDS, and proceed to step 13.\nConfirm presence of BR bodies by imaging a 5 μL aliquot of the final pellet (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/316-Fig2.jpg\nFigure 2. BR-Body Enrichment\nFluorescence microscopy images of ASM-YFP were performed with pellets resuspended in the same volume as supernatant for comparison (step 11e).\nNote: The BR-body enrichment procedure with differential centrifugation is adapted from (Wheeler et al., 2017[href=https://www.wicell.org#bib12], Khong et al., 2017[href=https://www.wicell.org#bib6], Khong et al., 2018[href=https://www.wicell.org#bib5]).\nNote: A small amount (~2–5 μL) of the sample from each centrifugation step should be saved to monitor the enrichment procedure progress by fluorescence microscopy. The liquid sample (~ 5 μL) was spotted onto a microscope slide and covered with a coverslip and put an oil droplet prior to imaging with a 100× objective. Images were taken in both phase-contrast and fluorescence (YFP) imaging. All images were processed using ImageJ (Figure 2[href=https://www.wicell.org#fig2]).\nJS221 can be used as a negative control in which no BR bodies will be detected. Focusing on the BR bodies can be difficult as they can photobleach rapidly. Be sure to change field of view frequently while attempting to focus the microscope. Once focused, a microscope with a digital piezo Z-axis can be much more easily kept in focus for each subsequent sample.\nRNA isolation\nTiming: 2–4 h\nThis step describes how to isolate RNA from the BR-body enriched pellet.\nPreheat 1 mL of Trizol for each biological sample at 65°C in the heat block.\nAdd 1 mL of 65°C Trizol to the samples, mix well by vortexing and incubate at 65°C for 10 min.",
    "Then add 200 μL of chloroform, mix well by vortexing and incubate for 5 min at room temperature (~25°C).\nSpin the samples at max speed (20,000 × g) in a microcentrifuge for 10 min at room temperature (~25°C).\nRemove the aqueous layer and precipitate with 700 μL of isopropanol at −20°C for 1 h.\nSpin the samples at 20,000 × g for 1 h at 4°C.\nDecant off the supernatant carefully and wash the pellet (slightly white color) with 800 μL of 80% ethanol by shaking the tube several times.\nSpin the samples at 20,000 × g for 1 min at 4°C. Repeat steps (g) and (h) three times.\nDiscard 80% ethanol and air dry the pellet and resuspend in ~50 μL 10 mM Tris pH 7.0.\nAssess RNA quality using Bioanalyzer and RNA 6000 Nano Kit, following manufacturer’s instructions.\nNote: For RNA isolation step it is recommended to use RNase-free, siliconized polypropylene microcentrifuge tubes, which provides extremely low surface adhesion and enables maximum sample recovery.\nNote: It is possible to use Bio analyzer to determine RNA concentration. However, Qubit is slightly better (accurate) than Bioanalyzer and is recommended if the RNA is going to be prepared for RNA sequencing.\nProtein isolation (extract and quantify protein from both whole-cell lysate and BR-body-enriched fractions)\nTiming: 2–4 h\nThis step describes how to isolate proteins from the BR-body enriched pellet.\nCollect BR-body-enriched and whole-cell lysate fractions from each bacteria strain as explained above.\nResuspend the final pellet in 200 μL of lysis buffer containing 1% SDS.\nQuantify the concentration of proteins in each fraction using Bradford assay.\nNote: Extracted samples can be used to perform mass spectroscopic analysis to identify the protein composition of BR-body-enriched fraction."
  ],
  "subjectAreas": [
    "Protein Biochemistry",
    "Cell Biology",
    "Microbiology",
    "Molecular Biology",
    "Model Organisms"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}