{
  "id": 4111,
  "origin_website": "Cell",
  "title": "Protocol for the use of focused ion-beam milling to prepare crystalline lamellae for microcrystal electron diffraction (MicroED)",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nIn this protocol we describe all the steps of determining protein structures of ion-beam milled crystals by microcrystal electron diffraction (MicroED).\nPreparing protein crystals\nTiming: 1–2 h to prepare; 1–10 days for crystals to grow\nThis step describes generating macromolecular protein crystals of lysozyme required for ion-beam milling and subsequent MicroED investigation. We include these steps and instructions to follow if this protocol is being used as a learning resource. Lysozyme is used as a standard test sample, and it is otherwise expected that these steps may be skipped if protein crystals are already grown and ready for experiments.\nPrepare the protein stock solution\nDissolve dry powder of lysozyme into a buffer of 0.1 M sodium acetate pH 4.8 solution to a concentration of 40 mg / mL.\nFilter this protein solution through a 0.4 μm syringe filter at least 3 times\nAliquot the protein into 50 μL portions in PCR tubes and flash freeze in liquid nitrogen\nStore at −80°C until just prior to use\nThaw the protein on ice prior to experiments, and spin the down the aliquots at 1–5,000 RPM on a tabletop centrifuge to remove aggregates\nPrepare the precipitant solution\nCreate a stock solution of 4 M NaCl using filtered water\nFilter the salt solution through a porous membrane at least 3 times\nCreate a stock solution of 1 M sodium acetate pH 4.8 using filtered water\nSimilarly filter to assure purity and remove aggregates\nMix 1 mL of sodium acetate with 2.5 mL NaCl stock and 6.5 mL filtered water to create a 1 M NaCl 0.1 M sodium acetate pH 4.8 precipitant solution\nCrystallize the protein\nMix 1–5 μL of protein stock solution with precipitant solution in a 1:1 ratio inside of a PCR tube",
    "Gently mix with a pipette for 30 s\nCrystals form in 1–10 days at approximately 23°C\nNote: Batch crystallization by mixing solutions can be replaced by sitting or hanging drop vapor diffusion in crystallization plates, and is typically faster. Batch conditions can simplify the downstream sample preparation processes.\nPause point: days\nPreparing TEM grids for cryo-FIB milling\nTiming: 0.5–2 h\nThese steps describe precisely how to prepare TEM grids. It involves applying the protein crystals to a glow discharged grid, blotting away the excess solvent, and plunging the crystals into liquid ethane.\nWrap one side of a glass cover slide with parafilm wrap and place the cover slide gently into a glass petri dish lined with dry filter paper\nOpen a container of TEM grids and gently remove them one at a time by their edge, placing them onto the parafilm wrapped side of the cover slip with their carbon side facing upward (Figure 1[href=https://www.wicell.org#fig1])\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/877-Fig1.jpg\nFigure 1. EM Grids and how to assemble them for milling crystals\nSchematic cartoons of the grids, assembly, and preferred orientation of the clipped EM grids are presented along with images for reference.\nTEM grids typically have a carbon side and a copper side. The copper side is reflective and bright, whereas the carbon side is darker and appears more drab. Typical TEM grid containers have the grids oriented with their carbon sides facing the center of the package.\nGently place the cover slide with the TEM grids into a glow discharge chamber and replace the cover to assure a vacuum-tight seal\nGlow discharge the grids on the negative setting for 10–30 s at a currant of 15 mA",
    "Place the cover slide back into the glass petri dish. Make sure to replace the glass cover to prevent dust or contamination from building up on the grids.\nUse the mountable forceps to grab a TEM grid by the outer edge, assuring not to puncture the inner portion with the tips of the forceps. Lock the forceps closed on the grid and place it into the vitrification robot.\nMove the forceps into the sample chamber of the vitrification robot and allow the grid to equilibrate with the chamber environment for approximately 1 min.\nUsing a 10 μL pipette, place approximately 1–3 μL of solution containing crystals onto the carbon side of the TEM grid inside of the vitrification robot sample chamber\nWait 20 s and then blot the TEM grid gently from the back for approximately 20 s\n20 s is a typical blot time when the robot is at 4°C and 95% humidity. Optimization of this parameter and the environment inside the vitrification robot chamber are often required.\nPlunge the blotted TEM grid into super-cooled liquid ethane to vitrify the liquid and crystals on the grid\nTransfer the grid to a grid storage box\nRepeat steps 6–11 to prepare as many samples as needed\nIt is often useful to make at least 4 samples at a time, as this is how many grids fit into a single grid box, and allows for trying several variations of grid preparation at a time – e.g., blotting for 4 s, 8 s, 16 s, 20 s, etc.\nTransfer the grid boxes into a liquid nitrogen storage dewar prior to use\nPause point: Months\nCryo-FIB/SEM investigation of protein microcrystals\nTiming: 2–12 h at a time",
    "These steps detail the method of screening grids for microcrystals in the SEM and FIB beam, aligning selected samples, and milling protein crystals into thin lamellae for subsequent MicroED investigation.\nCool down the dual beam transfer station to liquid nitrogen temperatures\nTransfer the vitrified TEM grids to the dual beam transfer station\nIf these grids will be loaded into an autoloader equipped TEM, assure the TEM grids are properly prepared with the appropriate autogrid clips.\nCustomized autogrid clips have been designed for using the FIB/SEM to make lamellae of biological materials. These clips have a thinner edge on one side to allow for a shallower milling angle. This is advantageous for tomography experiments. For MicroED experiments, milling at higher angles is not necessarily a detriment, as this exposes the thinnest face to the TEM beam at a variable angle, and can be used to optimize data collection. We find that either clips work well for preparing crystal lamellae.\nTransfer the grids into the dual beam shuttle for transfer into the FIB/SEM dual beam instrument (Figure 1[href=https://www.wicell.org#fig1])\nTake special care to note and load the grids in the proper orientation – the carbon side of the grid where the crystals are should be facing outward, and the clip ring (if present) should be oriented toward the shallower side of the ring or the appropriate ring orientation identifier (Figure 1[href=https://www.wicell.org#fig1]).\nIn our lab, we often mark an edge of the clip ring with a dot using a marker to identify the grid orientation.\nTransfer the grids inside of the dual beam sample shuttle into the dual beam instrument using the pumped down transfer rod.\nAllow the dual beam instrument to come back to optimal vacuum state after loading",
    "Use the sputter coating system to apply a layer of platinum to the grids prior to further inspection\nIt is often advisable to use two sets of coatings, a fine coating and then rough coating. The typical settings are a fine sputter coating at 1 kV 7 mA for 30 s, and a rough sputter coating at 1 kV 30 mA for 30 s. This typically deposits 100–300 nm of platinum on the loaded samples.\nThe system used in this protocol uses nitrogen gas to cool the stage. The sample may heat up during the sputter coating process, and may lead to severe ice contamination of the protein crystals or crystallization of the vitreous ice inside of the protein crystals. This problem can be alleviated by increasing the nitrogen gas flow during sputter coating. Ice contamination has not been observed since this adjustment to the crystal milling protocol was adopted.\nA carbon rich platinum layer can also be deposited using the gas injection system to either further supplement the sputter coated platinum or completely replace it. This layer is often very thick. The amount of time needed to mill a lamella will increase with thicker layers of platinum.\nScreen the loaded grids for appropriate crystals for ion-beam milling\nTake an all-grid map or single image of the entire grid to judge the quality of the sample preparation steps. The grid should have visible grid bars, holes in the holey carbon, and have crystals on the carbon film with vitrified liquid still surrounding them (Figure 2[href=https://www.wicell.org#fig2])\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/877-Fig2.jpg\nFigure 2. Overview of an EM grid by using the SEM\nA montaged of individual SEM images stitched together in order to inspect the grid for potential crystals. The seven crystals identified for this investigation are circled in orange.",
    "It is advisable to use commercial software, such as MAPS (Thermo-Fisher) or the microscope’s positioning system to store positions on the stage where potential crystals are visible.\nIdentify crystals that are not on top of grid bars, not within 3 grid squares of the edge of the sample, and that are on unbroken/bend/ripped grid squares\nThe positions of selected crystals in our example are circled in orange in Figure 2[href=https://www.wicell.org#fig2].\nBring each selected crystal to the eucentric tilting position (Figure 3[href=https://www.wicell.org#fig3])\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/877-Fig3.jpg\nFigure 3. Crystal identification and alignment\nViews of a selected crystal in the ion-beam (A) and electron beam (B) after successfully bringing the sample to the eucentric position, where the beams are approximately coincident.\nGo to a selected crystal using the dual beam user interface and tilt to the milling position\nTake a high-resolution image in both SEM and ion-beam to assure the beams are aligned to the same point at the specified milling angle (Figures 3[href=https://www.wicell.org#fig3]A and 3B)\nMill selected crystals into thin lamellae\nRough mill away the bulk material from above and below the selected crystal using rectangular patterns (Figure 4[href=https://www.wicell.org#fig4]B, blue squares)\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/877-Fig4.jpg\nFigure 4. The milling process by the focused ion-beam\nThe crystal prior to milling as seen in the electron (A) and ion-beam (B). The crystal after rough milling (C), fine milling (D), finer milling (E), and polishing (F). The light blue boxes indicate where milling was conducted in order to achieve the following frame. The approximate final thickness is indicated in (F).",
    "Rough milling can be safely conducted using rectangular milling patterns at beam currents between 100 pA–500 pA. The rectangular milling patterns are essentially areas that are constantly imaged and allow the user to directly observe the sample as it is destroyed by ion beam. It is advisable to time how long it takes for the beam to clear away this area and note how this correlates to the calculated time suggested by the software to mill away this thickness of pure silicon.\nAll ion beam milling steps in this protocol are conducted using a beam of gallium ions with an accelerating voltage of 30 kV.\nBegin the fine milling process to slowly thin the rough lamella into a sharp edged slab. This is done in small steps in order to monitor the thickness and assure the specimen is not damaged due to drift of the beams (Figures 4[href=https://www.wicell.org#fig4]C and 4D).\nFine milling is also conducted using rectangular milling patterns at ion beam currents of 30–100 pA.\nPolish the lamella to the proper thickness and assure the lamella is perfectly flat (figure 4[href=https://www.wicell.org#fig4]E).\nPolishing is conducted at ion beam currents of 1.5–30 pA, and almost always uses a cleaning cross section pattern. This pattern spends all of the calculated time at each position in the rectangular pattern at once and rasters through each line sequentially. This often results in much sharper, flatter lamellae, but removes the live feedback obtained by milling with the rectangular cross sections. Experimenting with what works best for each sample may be necessary.\nTake a final image of the lamella using the ion-beam at a high magnification, a very low beam current, and measure the final thickness of the polished lamella (Figure 4[href=https://www.wicell.org#fig4]F).",
    "Lamella are typically polished at a current of 10–30 pA by gallium ions accelerated at 30 kV.\nIt is possible to monitor the milling progress using the scanning electron beam (Figure 5[href=https://www.wicell.org#fig5]). This allows to also monitor whether the milling has successfully penetrated through whatever material might be below the crystal on the grid. Empty, or completely cleared areas, appear as dark, featureless bands in front of and behind the lamella. It is possible that imaging the lamella in the SEM may damage the crystalline order and reduce final resolution. However, this has not been investigated to date.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/877-Fig5.jpg\nFigure 5. Monitoring the milling process using the SEM\nStarting from the unmilled crystal in (A), the milling process is monitored by taking a single exposure in using the electron beam until the process is finished (B–I). All scale bars 25 μm.\nRepeat steps (a) – (d) for all selected crystals",
    "It is advisable to limit the total number of crystals milled in a single session to perhaps 1–20. Current dual-beam systems have relatively poor vacuum and cooling systems when compared to modern TEMs. Over time, ice builds up over the sample in addition to chunks of milled material finding its way back on the grid and appearing as speckled muck or dirt. For example, the system used in this study was benchmarked at 30–50 nm of ice buildup per hour. Using approximately 30 min per lamella, we could expect the 10th lamella to have nearly zero ice contamination, but the first lamellae could be 3–5 x thicker than anticipated. It is possible to reduce the issue of contamination by conducting the milling steps in series for each lamella, rather than by finishing a lamella complete prior to moving to the next. For example, all 10 could be bulk milled, then fine milled, etc. This process helps, but only marginally improve outcomes. It requires much more effort, and the polishing steps typically take at least 1/3rd of the total milling time per lamella.\nTransfer the grids with milled lamellae into a liquid nitrogen storage dewar until the TEM is available for use.\nIt is advisable to load the grids directly into a cryo-cooled TEM without storing them for large periods of time in a storage dewar. One large ice crystal getting stuck to a lamella could ruin hours of work. Plan your experiments accordingly.\nPause point: 5 min–1 week\nCollection of MicroED data\nTiming: 0.5–12 h\nHere, explicit details for the collection of continuous rotation MicroED data are described. These steps assume that the TEM is well aligned for collecting both imaging and diffraction data (Figure 6[href=https://www.wicell.org#fig6]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/877-Fig6.jpg\nFigure 6. MicroED data collected on a cryogenically cooled TEM",
    "(A) The all-grid atlas used to identify milled lamellae.\n(B–D) Higher magnification images of an identified lamella on the grid.\n(E) MicroED data from the lamella. Each frame is highlighted and corresponds to the colored region in the frame prior. The white, dashed circle indicates the size and position of the selected area aperture used to collect the MicroED data.\nRemove the grids containing milled lamellae from the storage dewar and load them into a cryogenically cooled TEM.\nCarefully load the grid into either the side entry holder or autoloading system such that the alpha tilt of the stage travels perpendicular to the milling direction (Figure 1[href=https://www.wicell.org#fig1]). This is absolutely critical to collecting an optimal wedge of MicroED data.\nScreen the loaded grids for milled lamella\nTake an all-grid atlas/montage of each sample\nIdentify milled crystals by the clear stipe of missing material (Figure 6[href=https://www.wicell.org#fig6])\nAdd the coordinates of each lamella to a list for further investigation\nNote: We find that approximately 90% of the lamellae that are successfully milled will survive if loaded directly from the FIB/SEM into the TEM. However, the survival rate drops to approximately 50% if stored for > 1 week in a storage dewar or transported between physical sites.\nPrepared the identified lamellae for data collection\nFor each site, take a high magnification image (Figure 6[href=https://www.wicell.org#fig6])\nIf the lamella is not contaminated or broken, bring each site to the eucentric position\nCollect continuous rotation MicroED data from each lamella(de la Cruz et al., 2019[href=https://www.wicell.org#bib6]; Martynowycz et al., 2019a[href=https://www.wicell.org#bib19]; Shi et al., 2016[href=https://www.wicell.org#bib27])\nRemove the grids and either store them for future use or discard them as needed",
    "Note: It is unlikely that the milled lamellae will survive or be useful after milling and loading into the TEM. However, we find that grids with many crystals can be useful for additional milling at a later date. Here, contamination can build up on top of the platinum layers, but the underlying crystals are still preserved. Any buildup of contamination after platinum coating can easily be removed by milling later.\nPause point: one day\nMicroED data processing\nTiming: 0.5 h–12 h\nThe steps of converting continuous rotation MicroED data into crystallographic format, reducing the data, and determining the structure by molecular replacement are given in detail. There are many methods and approaches to processing diffraction data. A simple method using the command line on either a Mac or Linux based system is described.\nConvert the continuous rotation MicroED movies into a standard crystallographic format for further processing using the freely available MicroED-tools (cryoem.ucla.edu[href=http://cryoem.ucla.edu]) (Hattne et al., 2015[href=https://www.wicell.org#bib12]).\nFrames are often collected as TIF, MRC, SER, or many additional formats by the TEM detector software.\nIn this case, the data were collected as single MRC files containing a continuous sweep of data from one crystal.\nConverting from MRC to SMV requires experimental parameters that will be placed into each image header. These headers are read by processing software and are critical to correctly processing the data.\nIndex, integrate, scale, and merge the MicroED data",
    "Each step may be done using standard crystallographic software, such as XDS (Kabsch, 2010a[href=https://www.wicell.org#bib14]) for initial indexing and integration, and then programs such as POINTLESS (Evans and Murshudov, 2013[href=https://www.wicell.org#bib9]) to determine the crystallographic space group, AIMLESS (Evans and Murshudov, 2013[href=https://www.wicell.org#bib9]) for scaling and merging. Several downstream refinement programs require merged amplitudes rather than intensities, such as REFMAC5 (Kovalevskiy et al., 2018[href=https://www.wicell.org#bib16]), and these intensities can be converted to amplitudes using CTRUNCATE (Winn et al., 2011[href=https://www.wicell.org#bib29]).\nIn this report, all seven crystals were merged together using XSCALE (Kabsch, 2010b[href=https://www.wicell.org#bib15]). The relevant statistics may be found in Table 1[href=https://www.wicell.org#tbl1].\ntable:files/protocols_protocol_877_1.csv\nDetermine the structure using molecular replacement\nThis structure was determined using PHASER (McCoy et al., 2007[href=https://www.wicell.org#bib23]) using PDB 5K7O as a search model (de la Cruz et al., 2017[href=https://www.wicell.org#bib5]).\nThe search was conducted using electron scattering factors. The search procedure looks for solutions in all possible space groups, since the integration program was only confident enough to determine the point group P422, but not determine the potential screw axis. The solved structure was placed in space group P43212 (#96).\nIt is good practice to copy the R free set from the molecular replacement model to the new dataset – extending to the new resolution if needed – in order to remove additional model bias. If this is a new structure, add a new set of R free flags (Winn et al., 2011[href=https://www.wicell.org#bib29]).\nRefine the protein structure determined by MicroED\nOpen the molecular replacement model and map to inspect the solution.\nThis is typically done in a program such as COOT (Emsley and Cowtan, 2004[href=https://www.wicell.org#bib8])\nRefine the structure using the original file of merged reflections and R free flags using electron scattering factors.",
    "A typical refinement will refine the individual B factors and atomic positions. This lysozyme structure was refined using PHENIX (Adams et al., 2010[href=https://www.wicell.org#bib1]).\nAdd ordered solvent and ions to the structure as they appear in the density\nRepeat manual inspection of the maps between rounds of structure refinement until satisfied with the model. The final map should accurately describe the location of all the residues in the protein (Figure 7[href=https://www.wicell.org#fig7]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/877-Fig7.jpg\nFigure 7. The structure of lysozyme from milled lamellae\n(A and B) (A) The 2Fo – Fc map contoured at the 1.5 σ level, and (B) the final structure of lysozyme determined by MicroED from seven merged crystalline lamellae."
  ],
  "subjectAreas": [
    "Cryo-Em",
    "Microscopy",
    "Structural Biology",
    "Protein Biochemistry"
  ],
  "bigAreas": [
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}