{
  "id": 10341,
  "origin_website": "Jove",
  "title": "A Custom Multiphoton Microscopy Platform for Live Imaging of Mouse Cornea and Conjunctiva",
  "procedures": [
    "All animal experiments were conducted in accordance with procedures approved by the Institutional Animal Care and Use Committee (IACUC) of the National Taiwan University and Chang Gung Memorial Hospital.\n1. Multiphoton microscopy setup\nBuild a system based on an upright microscope with water immersion 20x 1.00 NA objective (Figure 1A).\nUse Ti: Sapphire laser (with tunable wavelength) as the excitation source. Set the laser output wavelength at 880 nm for EGFP and 940 nm for tdTomato (Figure 1A).\nInclude two dichroic mirrors (495 nm and 580 nm) for the separation of SHG/EGFP and EGFP/tdTomato (Figure 1A). Spectrally separate the SHG signals, EGFP and tdTomato by bandpass filters 434/17nm, 510/84nm and 585/40nm (Figure 1A).\nIn order to optimize the image quality and to avoid photobleaching and tissue damage, set the laser power to be about 35 mW for imaging cornea and 50 mW for limbus. Measure the laser power before the laser passes the optical system. The exact laser power on samples is about 8-9 mW. The complete microscopic design is shown in Figure 1A.\n\tNOTE: The upper limit of laser power is set to 70 mW to avoid photo-bleaching and tissue damage.\n2. Animal preparation for live imaging\nUse 8-12-week-old mice for the experiment. Intramuscularly inject 50-80 mg/kg of tiletamine HCl and zolazepam HCl for general anesthesia. Check for the lack of response to withdrawal reflex by pinching a toe. Sufficient anesthetization is important to allow stable breathing rate monitoring.\n\tNOTE: Mice at the age of 8 weeks or above are recommended because their eyeballs are matured.\nPlace the mouse under anesthesia on a heated stage and insert the temperature monitoring probe into the anus.",
    "CAUTION: The probe must be inserted fully into the anal cavity without exposure to the air, to avoid overheating of the heater and induction of heatstroke.\n3. Eye holding for live imaging of ocular surface\nFor live imaging of the ocular surface, use the custom designed stereotaxic mouse holder consisting of two parts: a head holder to stabilize the head and an eye holder to retract the eyelids and expose the entire ocular surface (Figure 1B-D).\nInsert ear bars into the external auditory meatus and maintain the three-point fixation of the head holder (Figure 1B,D).\nTopically apply a solution of 0.4% oxybuprocaine hydrochloride in saline and leave it for 3 min to anesthetize the ocular surface.\nEnsure the eyeball is protruded by proper manual eyelid retraction. Otherwise, ischemia and bleeding of the eyeball can occur.\nCarefully place a loop of the polyethylene tube of eye holder along the eyelid margin to expose the ocular surface. Stabilize the eyeball with the eye holder composed of a No. 5 Dumont forceps with its tips covered with the loop of polyethylene tube (Figure 1C,D).\nScrew forceps using a knob in distal forceps of eye holder to keep the eyeball stable (Figure 1D).\nApply an eye gel with the refractive index of 1.338 on the corneal surface as an immersion medium to maintain the moisture of the ocular surface every hour. In addition, regular application of the eye gel every hour avoid clouding in cornea during imaging.\nRotate the eyeball with the holder that locked on the stepper-motorized stage for imaging across the entire corneal surface from the central cornea to the peripheral region (Figure 1C,D).",
    "CAUTION: Both excess and insufficient amounts of eye gel can impact the quality of images during imaging. Therefore, supplementing eye gel every hour to keep the surface moist regularly is important for imaging.\n4. Z-serial image acquisition\nNOTE: Set the first and last slide in every stack to reduce the dropping motion artifacts.\nBefore taking the images, image the targeting field with a mercury light source.\nClick the symbol of the microscope software to turn on the software.\nSelect proper PMT gain and digital gain to visualize the cellular structure in the ocular surface.\nSet the first slide and the last slide to acquire a stack.\nEnter numerical values for image resolution and z-step, e.g., 512 x 512 and 1 μm as z-step.\nClick on the Start button to collect z-serial images.\nAcquire live images twice in the same area, first at 880 nm excitation for SHG/EGFP signals collection and second at 940 nm excitation for EGFP/tdTomato signals collection.\n\tNOTE: The combination of two stacks provides 3 channels images. The image resolution and scan format size were 512 x 512 pixels and 157 μm x157 μm, respectively.\n5. Image processing and 3D reconstruction\nLoad the z-serial images into Fiji software18.\nSelect the plugin Median 3D filter in Fiji to reduce background noises.\nSelect the Package Unsharp Mask filter in Fiji to sharpen the images.\nClick “Auto” in brightness/contrast to automatically optimize the quality of images.\nSave the images as image sequences to be able to export the z-serial images.\nLoad z-serial images into commercial software (e.g., Avizo lite) for 3D reconstruction using volume rendering.\nIn all MPM images, present EGFP, tdTomato, and SHG signals in pseudo-green, red, and cyan color respectively.\nCapture 3D structure pictures by the snapshot.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}