{
  "id": 6208,
  "origin_website": "Bio",
  "title": "Microfluidics-Based Analysis of Contact-dependent Bacterial Interactions",
  "procedures": [
    "Fabricate a microfluidic chipNote: This section can be skipped if you have a pre-fabricated microfluidic chip.Prepare PDMSMix PDMS base and curing agent in a weigh boat at a ratio of 10:1; i.e., 36.4 g PDMS base and 3.6 g curing agent. Mix thoroughly with a glass stirring rod. Place the boat in the vacuum desiccator to degas the PDMS. When air bubbles are nearly overflowing the weigh boat, break the vacuum momentarily to pop and deflate the bubbles. Continue until there are no more bubbles.Prepare waferTear off a piece of aluminum foil and wrap it around the wafer containing your trap molds. Carefully press down, avoiding the mold features, to remove air bubbles (see Figure 3).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180815/20180815013553_9602.jpgFigure 3. A wafer with molds of microfluidic chips ready for PDMS to be poured onPour and cure PDMSPour the degassed PDMS onto the wafer, and place it back into the vacuum desiccator to degas the PDMS as before. When the PDMS is thoroughly degassed, cure it in an 80 °C oven for an hour or overnight. Allow the cured PDMS to cool before proceeding, to avoid damaging your wafer.Cut and punch chipsCarefully peel the cured and cooled PDMS away from the wafer. Cut out individual chips with a razor blade on a cutting mat. Turn the chips feature site up and place under the dissecting microscope. Carefully use the biopsy punch to remove a core all the way through the chip at each media port. Note that an experiment with no media switching only requires punching one inlet and one outlet.Clean and bond chipsClean the chips sequentially with 70% ethanol and water, and dry them with a stream of nitrogen gas.",
    "Be sure to clean out the ports either with high-velocity gas or by injecting 70% ethanol or water through them using a syringe and luer stub adapter. Immediately place tape over the features of each chip after drying to prevent dust from settling on it.In a fume hood, clean the coverslips sequentially with heptane, methanol, and distilled water before drying under a stream of nitrogen gas. Immediately place tape over each coverslip after drying to prevent dust from settling on them. Open the oxygen line to the UVO cleaner. Place the chips (feature side up) and coverslips inside the UVO cleaner, peel off the tape, and activate the surface for 3 min. Re-close the valve of the oxygen tank.Quickly and carefully place each chip feature side down onto a coverslip, and then bake at 80 °C for an hour or overnight to bond them. Note: If your chips have low height features (like the 1 μm traps on our chips), they can collapse if you press down on the chip. Placing the coverslip on top of the chip instead of the other way around can help protect low features.Prepare chip and mediaNote that our design includes an optional media switcher requiring 3 inlet ports. For an experiment with no media switches, it is sufficient to use only one inlet and one outlet, leaving the remaining inlets un-punched. For details on media switching, see Ferry et al. (2011). For each port, remove the metal part of a bent luer stub adapter. This can be done by soaking the adapter in acetone to dissolve the adhesive, and then pulling out the metal piece with tweezers. Discard the plastic and keep the metal piece.For each port, attach a straight luer stub adapter to a 50 ml syringe.",
    "Attach a length of tubing to the adapter, and insert the metal piece from a bent luer stub adapter into the other end of the tubing.Prime the tubing of all but one syringe by injecting 1 ml of LB + Tween 20 (Recipe 2) straight down into the bottom of the syringe (see Figure 4). Press the pipet tip against the very bottom of the syringe, and then maintain steady pressure on the plunger until you see LB begin to come out the other end of the tubing. Carefully add another 10 ml of LB into the syringe. Allow fluid to flow through the tubing until you are sure there are no more bubbles in the line, and then tape the end of the tubing to the syringe just above the liquid level to stop the flow. Cover the top of the syringe with tape or parafilm to prevent contamination (see also Figure 5). Note that chilled media will release dissolved gases as it warms, so to avoid bubbles, allow any chilled media to warm to at least room temperature before loading your syringes. See also Video 1, in which the syringe is loaded with food coloring to aid visualization.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180815/20180815013619_0331.jpgFigure 4. Prime the tubing by injecting media directly into the luer stub, through the bottom of the syringeimgsrc:https://en-cdn.bio-protocol.org/attached/image/20180815/20180815013637_4611.jpgFigure 5. An example of a primed syringe<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Loading a syringe. To aid visualization, this syringe was loaded with water dyed green with food coloring. Prepare cellsMeanwhile, grow 10-15 ml of each strain separately in LB with appropriate antibiotics to mid-exponential phase. For E. coli carrying pBAV1k, use kanamycin at 50 μg/ml.Harvest each strain by transferring to 15 ml conical tubes and centrifuging for 5 min at 2,000 x g. Room temperature is fine for centrifugation steps.",
    "Resuspend each strain in 1 ml fresh LB, transfer to a 1.5 ml microcentrifuge tube, and harvest again for 3 min at 10,000 x g. This washing step is to remove any residual antibiotics.Resuspend the two strains at high density – use about 1-3 volumes of LB with Tween 20 for each volume of cell pellet.Mix the two strains at 3 volumes of E. coli for each volume of A. baylyi. The ratio can be adjusted in subsequent attempts, but E. coli MG1655 are less adhesive than A. baylyi and thus are more likely to be washed out of the traps during and immediately after loading. If using another E. coli strain that is more adhesive, a more equal ratio of the two species may work better. Note also that species ratio can affect the frequency of interactions such as horizontal gene transfer (Cooper et al., 2017).Load the cell mixture into a prepared syringe and tubing in the same way as for the media syringes above.Load the chipFor each media port, lower the luer stub below the fluid level in the syringe, hold it until fluid begins flowing out from the end, and insert it into the appropriate port in the chip, as in Figure 6. Do the same for the cell mixture in the waste port. Note that the loading speed can be increased by placing the chip in the vacuum desiccator for at least 20 min before loading.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180815/20180815013658_5741.jpgFigure 6. A loaded PDMS chip with 2 portsPlace the chip onto the microscope stage, fix it in place, and raise the syringes a few feet above the chip. They can be taped to the wall, or for a more advanced setup see Ferry et al. (2011). Watch under the microscope as the channels fill with media.",
    "You want the fresh media and the cells to meet about midway into the trapping region. The extra buffer space is to prevent contaminating the media channel with cells in the next step. Adjust the syringe heights to ensure this. When the media does meet the cells, adjust the syringe heights so there is a slow forward flow from media to waste.If cells have not loaded well into the traps, flick the waste media line (loaded with cells) with your fingers. Try gently at first, and then harder as needed (see also Video 2). The pressure waves should force cells into the traps, but be careful not to force cells into the upstream media channels.<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 2. Flicking the microfluidics lines. A demonstration of how to flick the media lines, which helps initial loading of cells and can temporarily disrupt clogs.Once sufficient cells of each species are loaded into the traps (see Figure 7 for a representative example of a loaded trap), immediately adjust the syringe heights to obtain a forward flow from media to waste. The flow velocity must be fast enough to avoid clogging, but not so fast as to wash the less sticky E. coli out of the traps. The flow rate can be adjusted up as the cells grow and fill the traps. Both syringes should be above the chip.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180815/20180815013717_2985.jpgFigure 7. A microfluidic trap loaded with cells. The channel runs along the bottom of the image, A. baylyi cells are shown in red, and E. coli cells are shown in green.Record data and babysit the experimentSet your microscope to record one set of images every 3-5 min. You will need to determine the appropriate exposure power and duration to observe cellular fluorescence on your equipment.",
    "In general, use the lowest possible exposure that will give reliable data, to avoid damaging the cells. A longer exposure at lower intensity is preferable to a short exposure at high intensity. Imaging multiple stage positions using a motorized stage is ideal, because it increases the likelihood you will capture usable data.Keep an eye on the experiment to be sure that cells are growing and the channels do not clog. If cells are washing out of the traps, reduce the flow rate by raising the waste syringe or lowering the fresh media syringe. If channels are beginning to clog, or if media is not flowing forward, increase the flow rate by adjusting the syringe heights in the opposite direction.If channels begin clogging, this generally portends the beginning of the end. Sometimes, the experiment can be given a temporary reprieve by flicking the tubing connecting the syringes to the chip, as in Video 2. However, this can also rearrange the cells within the traps, which can compromise time course data. See also Notes."
  ],
  "subjectAreas": [
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}