{
  "id": 7064,
  "origin_website": "Bio",
  "title": "Use of Optogenetic Amyloid-β to Monitor Protein Aggregation in <em>Drosophila melanogaster</em>, <em>Danio rerio</em> and <em>Caenorhabditis elegans</em>",
  "procedures": [
    "Molecular cloning of optogenetic transgenes for expression in D. melanogaster and C. elegans Use the human Aβ1-42 amino acid sequence (Aβ Human) to generate transgenes for Drosophila and zebrafish. For C. elegans, use a nematode-codon-optimized version of Aβ1-42 (Aβ Worm) (Fong et al., 2016). For Drosophila expression of human Aβ-CRY2-mCh, obtain the human Aβ DNA sequence with attL1 and attR5 overhangs in a Gateway entry vector (pUCIDT-attL1-Human ABeta-attR5) and the pDONR-attL5-CRY2-mCh-attL2. Perform a multi-site Gateway LR reaction to insert these constructs into the pUASg-HA-attB Drosophila expression vector (Bischof et al., 2007), according to the manufacturer’s instructions (Invitrogen, ThermoFisher  Scientific  ). For C. elegans expression of worm Aβ-CRY2-mCh, perform a multi-site Gateway LR reaction between the pUCIDT-attL1-Worm ABeta-attR5 entry vector, the pDONR-attL5-CRY2-mCh-attL2 and the pDEST-hsp-16–2p C. elegans expression vector, as per the manufacturer’s instructions (Invitrogen, ThermoFisher  Scientific  ). For all transgenes generated, use vector specific primers for sequencing to confirm the orientation and insertion of both fragments into the destination vector.Molecular cloning of optogenetic transgenes for Danio rerio (zebrafish) – a) pDEST-Tol2-PA2-10xUAS-Aβ-CRY2-mCh; b) pDEST-Tol2-PA2-Ubi-Aβ-CRY2-mCh; c) pDEST-Tol2-PA2-CMV-Aβ-mChCloning single DNA element of interest into gateway compatible vector PCR amplify 10xUAS, Ubi and CMV sequence with specific primer flanked by attB4 (Forward primer) and attB1 (Reverse primer) and cloned into pDONRTMP4-P1R to generate 5' entry plasmid via BP recombination. Verify correct clones by sequencing primers M13F or 5' GTAAAACGACGGCCAGT3' and M13Rev 5' CAGGAAACAGCTATGAC3'.PCR amplify the Aβ-CRY2-mCh with specific primer flanked attB1 (Forward primer) and attB2 (Reverse primer) and cloned into pDONR221TM to generate middle entry plasmid via BP recombination. Verify correct clones by M13 primers (same as 1).Note: The 3' entry vector containing poly-A signal (p3' PolyA) and the Destination plasmid containing the Tol2 recognition sites (pDestTol2PA2) originated in the Kawakami Laboratory and are available as–Tol2 kit (Kawakami, 2007).",
    "Create compatible attL sites on each entry plasmids following BP recombination. LR recombination to generate expression plasmid. Verify correct clones by sequencing primersForward: 5' CAAGTTTGTACAAAAAAGCAGGCTTA3'Reverse: 5' TACCCAGCTTTCTTGTACAAAGTGGGGGA 3'.Summary of the fragment assembly is shown in Figure 1.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3856/bioprotoc-10-23-3856-g001.jpgFigure 1. Generation of expression clones for zebrafish transgenic Expression of optogenetic transgenes in neurons in vivo For D. melanogaster, inject the pUASg-humanAβ-CRY2-mCh-HA-attB transgene into attP2 (Strain#8622) P[CaryP]attP268A4 (BestGene Inc (California)) (Groth et al., 2004; Markstein et al., 2008). Transgenic flies will be provided upon request. Isolate at least 5 homozygous male UAS-Aβ-CRY2-mCh flies and cross these with at least 10 Elav-Gal4, Repo-QF2; QUAS-GFP female virgin flies to drive neuronal expression of Aβ-CRY2-mCh and glial expression of GFP in the F1 generation. Place these male and female flies in a fly cage and cover with a pre-warmed grape juice agar plate smeared with a small amount of yeast paste to encourage egg laying. Keep the cages in a 25 °C incubator. For control flies, use UAS-TdTomato homozygous males instead. Change the fly plates every day and replace with pre-warmed grape juice agar plates that have a small amount of yeast paste on them. Allow newly set up cages to lay eggs for about 3 days to ensure a good number of developing embryos before using them for experiments.  For C. elegans, obtain transgenic strain (gnaEx1[myo-2p::YFP+hsp-16-2p::Abeta1-42:: CRY2::mCherry]) from Caenorhabditis Genetics Center (CGC). Age-synchronize transgenic nematodes through hypochlorite bleaching (Stiernagle, 2006). To induce in vivo expression of Aβ-CRY2-mCh driven by the hsp16-2 promoter, incubate day 1 adult nematodes at 35 °C for 1 h. After 1 h incubation, separate the nematodes into light/dark groups and grow them in a 20 °C incubator. For dark treatment, wrap the plates containing nematodes with aluminum foil and place the wrapped plates inside a Styrofoam box.",
    "Place the Styrofoam box at the top of incubator rack to avoid exposure to the LED light. For light treatment, place the plates containing nematodes directly under the LED light on the bottom rack of the incubator.  For D. rerio: Zebrafish lines (with Gal4; UAS) express the transgene in specific neurons or cells. To prevent oligomerization in ubiquitously expressing larvae, raise injected embryos in a dark incubator until experimentation. Minimize light exposure for transferring plates out or for sorting to avoid exposure to high LED light. For light treatment for mitochondrial flux analysis or ATP measurements, place the larvae under white LED light of a stereoscope for 2 h. Larvae with more restricted expression such as those used in light-sheet imaging were less sensitive to light exposure but were still raised in the dark till imaging as described in the following sections.Microinjection and expression of UAS construct (preparation on Day -1) The day before the injection, set up the fish in breeding tanks with dividers (Video 1).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Zebrafish microinjection Using a strainer, collect the embryos and rinse with tap water before transferring them into a 10 cm Petri dishes containing E3 (1x). Remove unfertilized eggs and debris with a Pasteur pipette.Prepare the injection needle by micropipette puller and backfilled with 3 μl of the mixture listed in the table (Table 1) using a Microloader.Fix the needle onto the micromanipulator connected to the microinjection system.Make a microinjection plate with 3% agarose using a custom-built plastic mold with grooves.Table 1.Microinjections mixture for zebrafish embryosimgsrc:https://en-cdn.bio-protocol.org/attached/image/20201202/20201202014442_6402.jpg Microinjection and expression of UAS construct (Day 0) The following morning (Day 0), remove the divider and allow approximately 15-20 min of undisturbed mating time (Video 1).",
    "Use a Pasteur pipette to align the embryos along the trenches and remove excess water to prevent embryos from moving during injection.Inject one-cell stage embryos with ~5 pL of DNA + RNA mixture under a stereoscope equipped with the injection apparatus. The apparatus consists of a needle holder attached to an MHC model magnetic stand and connected to  PLI-90 Pico-injector  , a foot switch to pulse the injection solution into the embryos and assisted by a backpressure unit to gauge the pulse release of pressurized nitrogen. Aim to inject around 200 to 300 embryos in 1 hour.Immerse injected embryos in E3 (1x). Save and raise 20 to 30 non- injected embryos alongside the injected embryos to assess microinjection induced damage. Use standard zebrafish embryos bleaching protocol (https://zfin.org/zf_info/zfbook/chapt1/1.5.html[href=https://zfin.org/zf_info/zfbook/chapt1/1.5.html]) and split them into 2 groups after bleaching.Incubate all the embryos at 28 °C in the dark. Use 1 group of the injected embryos for light exposure and the other as controls (dark).Fluorescence microscopy to detect mCherry expression in D. rerio Sort injected embryos under fluorescence stereomicroscope at 24 h post fertilization (hpf) (Day 1) for mCherry expression. Clear dead embryos from injected and uninjected dishes and change the water. Expect 5-10% injected embyos to die by 24 hpf.Replenish the embryos with fresh E3 (1x) daily until they reached 5 days post fertilization (dpf). Send larval zebrafish with mCherry expression to be grown in separate tanks in the hatchery from the non-expression larvae by 7 dpf.Cover the lid of the container used to grow baby fish with aluminum foil to prevent direct light exposure. Covering can be removed when fish reach adulthood depending on the expression tissue (for instance, sparse neuronal expression)To generate a permanent line, genotype adult fish by fin clipping at 8 weeks post fertilization (wpf).",
    "Use primers specific for Aβ-CRY2 and Gal4 for genotyping. Cross fish which are positive for both Aβ-CRY2 and Gal4 to obtain F1 embryos. Screen embryos for mCherry expression from 4 dpf onwards and follow the steps above. Tol2 transgenesis usually yields more than 50% transgene. However, due to the properties of the Abeta-CRY2, we found only 10% of the injected fish carries both Aβ-CRY2 and Gal4 at the point of genotyping. And only 1-2% showed germline transmission.Note: It is possible to find fish which are positive for both Gal4 and Abeta-CRY2 in genotyping but do not express mCherry. This could be due to the silencing of the UAS- regulated effector/reporter genes by methylation at the CpG nucleotides (Akitake et al., 2011) or may also due to other unknown factors such as the genomic location of the insertion.Light-sheet microscopy to image neural development during embryogenesis (in D. melanogaster)imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3856/bioprotoc-10-23-3856-g002.jpgFigure 2. Bleaching and mounting of Drosophila embryo into glass capillary for long term imaging. A. Place a stage 10 embryo in the middle of a piece of C-fold towel and add bleach till soaked. Rotate the embryo to encourage dechorionation. After bleaching, move the C-fold with the embryo on it to a drying C-fold towel using forceps (i). Rinse the embryo with water by transferring the piece of C-fold to a drop of water, let it dry once again on the drying C-fold (ii), and rinse once more in another drop of water before leaving it to dry on the drying C-fold towel (iii). B. Place a capillary filled with melted agarose and hold it in place gently on top of an inverted petri dish. Pick the bleached embryo from the C-fold and place it on the surface of the agarose. C.",
    "Push the embryo gently into the agarose using the fine tip of a copper wire and position it parallel to the capillary. D. After allowing the agarose to solidify for 5 min, load the capillary into the sample holder, and lower it into the sample chamber of the Light-sheet Z.1. Eject the agarose slowly such that the embryo just emerges from the capillary. Position the embryo in front of the objective such that the ventral surface (v) faces the objective. d: dorsal. These steps are shown in Video 2.<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 2. Mounting and imaging of Drosophila embryos Melt a tube of 1% low gelling temperature agarose at 70 °C for half an hour in a heat block and then cool it to 37 °C, mix thoroughly by inverting before proceeding with mounting.Remove the grape agar juice plate from a cup that has been laying eggs for at least 10 h to ensure you obtain a good amount of embryos at stage 10 (Hartenstein, 1993). Pour approximately 1 ml of Halocarbon oil 27 onto the plate with embryos and swirl the oil in a circular manner to spread it out evenly and form a thin layer of oil on the plate. Let it rest for 1 min to allow the oil to penetrate the chorion of all the embryos.Note: It is best to use plates that have flies laying eggs for 24 h so that proper development and expression of the GFP and mCherry fluorescent proteins in older embryos can be observed before proceeding with mounting and imaging of stage 10 embryos which do not express high levels of these fluorescent tags. Observe the plate under a fluorescence microscope using transmitted light.",
    "After germ band retraction (stages 14-17 according to [Campos-Ortega and Hartenstein, 1997]), embryos should show a very bright GFP and mCherry signal in the nervous system that mark the glial cells and neurons respectively using reflected light.Pick 1 stage 10 embryo from the plate using a dissecting needle and transfer it to the center of 1 cm x 1 cm piece of C-fold in a Petri dish under the transmitted light (Figure 2A).Add a drop of bleach to just soak the piece of C-fold. Add 2 drops of autoclaved water in the same Petri dish as shown in Figure 2A. Use the dissecting needle to roll the embryo up and down on the C-fold and encourage the chorion to peel off. Within 30 s to a minute, the chorion can be seen peeling off under the transmitted light at high magnification with the dorsal appendages disappearing and the matt embryo surface will take on a glossy finish.As soon the chorion is removed, use dissecting forceps to carefully lift the C-fold from one corner with the dechorionated embryo on it to a dry big piece of C-fold to remove as much bleach as possible (Figure 2A(i)). Rinse the embryo with water by moving the C-fold to the first drop of water, allowing it to soak for 30 s, then move it to another region on the drying C-fold (Figure 2A(ii)). Repeat the rinse with water one last time and allow the C-fold to dry as much as possible by allowing it to rest on an un-used part of the drying C-fold for a minute (Figure 2A(iii)).Meanwhile, insert the plunger into the size 2 glass capillary and suck up the melted 1% low-melting agarose Type VII-A (Sigma) at 37 °C to just above the black line as shown in Figure 2B.",
    "Position the capillary on top of an inverted Petri dish and allow the agarose to cool in the capillary for a minute.Pick up the dried embryo from the C-fold using a dissecting needle and position it in the center of the capillary (Figure 2B).Push the embryo into the center of the solidifying agarose using a fine copper wire to a depth of approximately 0.5 cm and maneuver it such that it is parallel to the capillary (Figure 2C). Remove the copper wire very slowly from the agarose once the embryo is in the desired position. Wait for 5 min to allow the agarose to solidify.Note: Align the embryo in the center of the capillary to ensure it is held securely in the agarose. If it sticks to the glass capillary, push it back into the agarose to avoid slipping out during imaging. This step requires a lot of patience and practice. This was the best way to position the embryo to obtain the highest resolution images. The aliquot of 1% low-melt agarose can be left at 37 °C for use over a long time or cooled and melted when needed several times. However, it will eventually stop solidifying after an extended period of time at 37 °C or after numerous heat-cool cycles. This requires the aliquot in use to be discarded and a new aliquot used thereafter. Switch on the Light-sheet Z.1 system and start up the Zen 2014 SP software. Inject autoclaved water into the sample chamber such that it filled to the brim as shown in the manufacturer’s protocol.After the agarose in the capillary has solidified, load the capillary into the sample holder according to the manufacturer’s manual and secure it by tightening the screw. Load the sample holder into the Light-sheet Z.",
    "1 and lower it into the sample chamber filled with autoclaved water. Push the embryo out of the capillary slowly such that it is just outside capillary and aligned with the objective (Figure 2D).Use the Light-sheet Z.1 10x/0.2 Illumination Optics to rotate the capillary such that the ventral surface (v) of the sample faces the objective to obtain high resolution images of the ventral surface (Figure 2D). Acquire images using a Light-sheet Z.1 Illumination objective 40x/1.0 (water immersion). Set up the 20 mW 561 nm laser at 13% laser power with 12.5 ms exposure time and the 30 mW 488 nm at 10% power with 29.95 ms exposure time to activate CRY2 clustering. Set z-stacks at 1 μm intervals and denote the top of the z-stack as approximately 20 sections (20 μm) above the top of the embryo and the bottom of the z-stack as approximately 20 sections (20 μm) from the bottom of the embryo. This is to ensure data is not lost in case the embryo shifts during imaging. Excess z-stack sections can be removed during processing. Set-up a time series acquisition with dual-side illumination in both channels every 2.5 min for 500 cycles. For embryos not exposed to blue light, use only the 561 nm laser. Allow the image acquisition to run for approximately 22 h.After the imaging is completed, pull the plunger up to insert the embryo back into the capillary and remove the sample holder from the Light-sheet Z.1. Eject the embryo with the agarose and discard these. The capillary can be reused several times.Light-sheet microscopy to image neuronal damage (in D. rerio)A custom designed open light-sheet microscope was used for acquiring videos of the zebrafish larvae.",
    "Briefly, mount samples in a customized chamber for light-sheet microscopy on a horizontal stage controlled by an ultrasound motorized 10 nm step size Z-Drive.Generate a light-sheet using a single illumination arm in front of the sample mounting stage delivering laser beam (488 nm or 561 nm) through a 10x illumination objective.Acquire images on a Hamamatsu Orca Flash 4.0 V3 sCMOS Camera through a Super High NA (1.0; XLUMPLFLN20xW) 20x water dipping lens.Use multidimensional acquisition in MetaMorph software with streaming option to acquire data.Use an acquisition protocol to acquire 1 z-stack with 2  μm step-size per min for 30 min.Illuminate the sample by 561 nm laser light filtered through a Texas Red/mCherry/AlexaFluor 594 dichroic. At minutes 5 and 6, flood the stage with high intensity transmission white light from X-Cite 120LED System for 45 s. Resume the time lapse imaging for the next 25 min.Repeat the whole process a second time after acquisition of the first time-lapse.Make videos from time-lapse images.Danio rerio Mitochondrial metabolic flux assaySplit injected embryos (C) into 2 dishes for 48 h; one for light exposure condition, and the other as the dark control.Dechorionate both dishes with minimal reflected light.Expose experimental embryos to high intensity LED light on a stereoscope for 2 h. Embryos are then loaded into the 96 well plate using a fine Pasteur pipette.Measure Oxygen Consumption Rate (OCR) using the XF96 Extracellular Flux Analyzer.Place one embryo (48 hpf) in 175 μl of E3 water in each well and start the experiment.Measure OCR every 8 min for 6 cycles (48 min), then add a drug.Calculate the volume of injection needed from the stock concentration of each drug, such that the final concentrations in the well are – a) 9.4 M oligomycin, b) 2.5 μM FCCP and c) 20 mM sodium azide.",
    "The experiment is summarized in Figure 3.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3856/bioprotoc-10-23-3856-g003.jpgFigure 3. Schematic of metabolic flux assay on transiently expressing Aβ-CRY2-mCherry embryos D. rerio Adenosine triphosphate (ATP) assayUse the remaining embryos from (Procedure C) for ATP assay. Or repeat Procedure C to generate more embryos.Pool five 48 h embryos in 1.5 ml Micro tubes and add 50 μl ice-cold 10% TCA buffer. For each condition make at least 8 such pools (n = 8).Use a hand held micropestle homogenizer, to homogenize embryos on ice.Centrifuge the homogenate at 4 °C at 10,000 RPM for 5 minutes.Transfer the supernatant to a new tube and keep at -80 °C for use later, or use immediately.Add 5 μl of sample supernatant or ATP standards into a white 96-well microtiter plate (Figure 4).Measure ATP luminescence using BioTek cytation 3 plate reader preprogrammed to inject arsenite ATP buffer (150 μl/well) followed by firefly lantern extract (45 μl/well).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3856/bioprotoc-10-23-3856-g004.jpgFigure 4. Schematic shows the summary of procedures using zebrafish Fluorescence microscopy to visualize Aβ aggregates in C. elegans Wash nematodes off the plates into an Eppendorf tube.Add 1 mM Levamisole into the worm suspension.Gently mix the worm suspension and place 20 μl of the worm suspension onto a glass slide containing 2% agarose [see Verbrugghe and Chan (2011) on how to make agarose pad].Switch off ambient light and bring the slides for imaging using 561 nm and 488 nm laser.Using 488 nm laser, select pharyngeal-GFP positive nematodes for the transgenic animals.Using 561 nm laser, observe the A&Bgr; expression and aggregate levels.Other assays used to confirm aggregation-induced deficits in C. elegans Lifespan assay (He, 2011), mitochondrial metabolic flux assay (Ng and Gruber, 2019) and ATP assay (Schaffer et al., 2011) can be used to confirm A&Bgr; aggregation-induced deficits."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Developmental Biology",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}