{
  "id": 4946,
  "origin_website": "Bio",
  "title": "Preparation of Chloroplast Lipid Membrane and Lipid-protein Interaction Assay",
  "procedures": [
    "Preparation of chloroplast lipid membraneCollect cyanobacterial cells by centrifugation and suspend the collected cells in 2 ml of 0.9% KCl. 3 x 109 cells of Synechocystis PCC 6803 are sufficient [Number of cells were determined by spectrophotometer. Optical density at 730 nm (OD730) = 1.0 corresponds to 1 x 108 cells /ml for Synechocystis PCC 6803]. Add 7.5 ml of methanol:chloroform (2:1, v/v) and vortex for 1 min. Add 2.5 ml of chloroform and 2.5 ml of H2O, and vortex. Centrifuge at 700 x g for 10 min. Collect lower phase, put it into clean tube and dry in a vacuum dryer. Measure the weight of the tube before use and after drying lipids. Calculate the yield of lipids. Dissolve dried lipids in chloroform at 10 mg/ml. Add developing solvent into a TLC developing chamber, close and leave it for 30 min as shown in Figure 1. Developing solvent is acetone:benzene:ultrapure water = 91:30:8 (v/v/v). Spot the chloroform solution containing 1-3 mg of lipids onto a TLC plate and place the plate into the TLC developing chamber. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160205/20160205072614_2275.jpgFigure 1. Separation of lipids on TLC plate. 1. Add developing solvent into a TLC developing chamber; 2. Spot lipid solution onto a TLC plate and place the plate into the chamber; 3. The TLC plate is developed in the chamber to separate lipids.When the solvent front has reached 1 cm from the top of the plate, remove the plate from the chamber and dry with cool wind provided by hair dryer.Spray 0.01% primuline in 80% acetone onto the plate. Lipids are viewed as spots under long wavelength of UV light as shown in Figure 2.",
    "Mark the corresponding position of each lipid and scrape the silica gel in the each spot from the TLC plate that is grass plate coated with silica gel. The silica gel can be scraped from the plate with a razor blade.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160205/20160205072640_4667.jpgFigure 2. Thin-layer chromatogram of cyanobacterial lipids visualized by UV. Total lipids extracted from cyanobacteria were developed in acetone:benzene:ultrapure water=91:30:8. 1. Pigments; 2. Monoglucosyldiacyalglycerol; 3. Monogalactosyldiacylglycerol (MGDG); 4. Digalactosyldiacylglycerol (DGDG); 5. Sulfoquinovosyldiacylglycerol (SQDG); 6. Phosphatidylglycerol (PG). Add 1 ml of chloroform to the silica gel scraped from the plate and vortex. Spin down the silica gel and transfer supernatant to a new tube. Repeat this extraction 3 times and evaporate chloroform in a vacuum dryer. Dissolve the obtained lipids in 100 μl of chloroform. The following 10 to 12 steps are required to determine the yield of obtained lipids.Take 5 μl of the chloroform solution containing each lipid to a new tube with a screw cap and add 50 nmol of pentadecanoic acid as an internal standard and 2.5 ml of 3% (w/v) methanolic HCl. Close the tube with the screw cap and incubate at 80 °C for 3 h. During the incubation fatty acids bound to lipids are derivatized to fatty acid methyl esters. After cooling the tube to room temperature, add 2.5 ml of hexane and vortex vigorously. Fatty acid methyl esters are extracted with hexane. Leave to stand for 5 min and collect upper phase (hexane phase), put it into a clean tube and evaporate hexane in a vacuum dryer. Dissolve the obtained fatty acid methyl esters in 50 μl of hexane and analyze them with a gas chromatograph. Temperatures for the injector, column and detector chambers were set at 250 °C, 170 °C and 250 °C, respectively.",
    "Determine lipid content by calculating total amount of fatty acid methyl esters based on the peak areas of fatty acid methyl esters in the obtained chromatograms. Pentadecanoic acid is not contained in cyanobacterial lipids, thus it can be used as an internal standard. Dilute lipids (the obtained lipids at the step A9) with chloroform to 0.1, 1 and 10 mg/ml.Spot the lipids corresponding to 0.1, 1 and 10 mg/ml in 1 μl of chloroform onto Amersham Protran Premium membrane and dry completely.Lipid-protein interaction assayIncubate the membrane with 5 ml of blocking solution (3% fatty acid-free BSA in PBS) for 1 h at room temperature with gentle agitation. Discard the blocking solution and incubate the membrane with 2 ml of blocking solution containing 0.5 μg/ml tagged-protein (His-tagged or GST-tagged protein) overnight at 4 °C. Put the membrane and solution into a Hybri-Bag and seal it. Discard the protein solution and wash the membrane with 10 ml of PBST three times at room temperature with gentle agitation for 10 min each. Discard the solution and incubate the membrane with 2 ml of blocking solution containing primary antibody (anti-penta-His mouse antibody 1:2,000 or anti-GST mouse monoclonal antibody 1:2,000) for 1 h at room temperature with gentle agitation. Put the membrane and solution into a Hybri-Bag and seal it.Discard the solution and wash the membrane with 10 ml of PBST three times at room temperature with gentle agitation for 10 min each. Discard the solution and incubate the membrane with 2 ml of blocking solution containing secondary antibody (HRP-conjugated goat anti-mouse antibody 1:20,000) for 1 h at room temperature with gentle agitation. Put the membrane and solution into a Hybri-Bag and seal it.",
    "Discard the solution and wash the membrane with 10 ml of PBST three times at room temperature with gentle agitation for 10 min each. Incubate the membrane with enough HRP substrate solution to cover the membrane (2 to 3 ml) at room temperature for 5 min.Wash the membrane with ultrapure water to stop the reaction and dry the membrane.Scan the membrane to record the obtained data."
  ],
  "subjectAreas": [
    "Plant Science",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}