{
  "id": 10631,
  "origin_website": "Jove",
  "title": "Proper Positioning and Restraint of a Rat Hind Limb for Focused High Resolution Imaging of Bone Micro-architecture Using In Vivo Micro-computed Tomography",
  "procedures": [
    "This study was approved by the Animal Care Committee of Brock University and conducted in accordance with the guidelines established by the Canadian Council on Animal Care 21.\n1. Anesthesia Using Isoflurane Gas\nPre-fill the acrylic glass incubation chamber with high-quality O2 at a continuous flow rate of approximately 1-2 L/min from an anesthetic machine (Supplementary Figure 1).\nTransfer the rat to the incubation chamber tail first and close the incubation chamber lid to create an airtight seal.\nBegin to fill the incubation chamber with veterinary-grade isoflurane at 3-4% v/v dissolved in O2 at a continuous flow rate of 1-2 L/min (Supplementary Figure 1).\n\tCAUTION: Waste anesthetic gases can adversely affect handlers. A scavenger system (i.e., a charcoal filter or exhaust directly into a fume hood) must always be in place.\nWhen the rat is no longer able to stand, transfer the rat to a face mask or nose cone receiving 1-3% isoflurane dissolved in O2 at a flow rate of 1-2 L/min. Rats primarily breathe through their nose and so, as long as the nose is covered by the face mask or nose cone, there will be sufficient anesthesia delivery.\nApply ophthalmic lubrication to the delicate membranes of the eyes to protect them from any escaped isoflurane gas.\n\tNOTE: Ensure that ophthalmic lubrication is without antibiotic, as this may affect outcomes from an intervention.\nMeasure palpebral (eye blinking response to gentle stimulation of palpebral opening) and pedal (withdrawal of hind limbs in response to pinching) reflexes; with increasing depth of anesthesia, palpebral reflex will be absent before pedal reflexes (Supplementary Figure 2).\nWhen an appropriate level of anesthesia is reached and the rat has lost both palpebral and pedal reflexes, maintain the rat on 0.5-2% isoflurane dissolved in O2 at a flow rate of 1-2 L/min.",
    "Continuously monitor the breathing rate of the rat throughout the procedure by keeping a constant visual on the rat either directly with an internal monitoring system or through the live-video feed (Supplementary Figure 3).\n2. Positioning and Restraint of the Rat Hind Limb\nLay the rat in the supine position on the carbon-fiber scanner bed (Supplementary Figure 4).\nRestrain the right foot in a malleable, foam tube, with the toes extending out of the end of the tube. Apply dental wax to hold the foot tightly within the foam and tape the tube closed tightly. Ensure that the diameter of the tube holding the foot is enough to fit firmly into the plastic tube.\nSlide the plastic tube into the X-ray scanner bed (Supplementary Figure 5).\nExtend the rat hind limb until it is taut. Do not over-extend the leg as to cause any harm to the rat (Supplementary Figure 5) as this may induce involuntary movement in the limbs due to labored respiration.\nPull the left leg (non-scanned hind limb) along with the tail out of the scanning field of view and toward the torso, away from the extended leg to be scanned.\nSecure the left leg (non-scanned hind limb) and the tail in position using masking tape. Do not use anything more or less sticky (i.e., duct tape or painter's tape) as these materials will either harm the rat when they are removed (duct tape) or not provide a strong enough hold (painter's tape) (Supplementary Figure 6).\nSecure the rat body into position at the hips, shoulders, and head with the masking tape. Secure the face mask or nose cone to the rat (Supplementary Figure 6).",
    "NOTE: Blot the adhesive side of the masking tape to remove its ability to stick to the rat fur. Do not blot the ends of the masking tape so that it may be firmly secured to the scanning bed.\nWrap the rat in vet-wrap to limit heat loss (Supplementary Figure 6).\n\tNOTE: When under general anesthesia, rats lose heat rapidly due to their large surface to body weight ratio 19,20.\nContinuously monitor the breathing rate of the rat throughout the procedure by keeping a constant visual on the rat (either directly or through a live-video feed).\n\tNOTE: Here set up takes 5 min, scan acquisition is acquisition setting-dependent, and recovery time is 60 mins.\nProceed to acquire the µCT images.\n\tNOTE: The exact specifications for scan acquisition are specific to each scanner type, software system and the specific research question, however, several methodological publications exist throughout the literature 1,2,9.\n3. Recovery from Anesthesia\nAfter in vivo µCT scanning is complete, stop the flow of isoflurane to the rat but maintain a 1-2 L/min flow of O2.\nWhen the rat regains motor control (1-2 min), remove it from the respirator and allow it to recover individually in a cage placed partially on a general-purpose heating pad at low heat. Rats are known to reduce their body temperature by 1 °C when under general anesthetic19. Do not leave the rat unattended until it has regained sufficient consciousness to maintain sternal recumbency.\n\tNOTE: Anecdotal evidence from our research group reports that immediately following recovery from isoflurane anesthesia, rats begin to eat and so it is important to have their food and water available to them during recovery. Although we have observed this behavior, repeated general anesthesia does not cause a significant increase in food intake or body weight 1,9."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}