{
  "id": 5713,
  "origin_website": "Bio",
  "title": "Context-driven Salt Seeking Test (Rats)",
  "procedures": [
    "Preparation of animals This procedure is designed for rats as the subjects. Rats are food restricted and maintained at 85% of their ad libitum weights throughout the experiment to motivate them to drink the sucrose and salt solutions.Preparation of apparatusBehavioral training is conducted in a custom-designed place preference chamber (29.5 x 12.5 x 21 in.), which we had made by the Dartmouth Apparatus Shop (Figure 1). The outside walls of the chamber are made of transparent acrylic, and there are acrylic inserts that can be placed in the chamber to divide it into three separate contexts. All training and testing is conducted in the dark except for the red light provided by the portable luminaires (see Figure 1) to provide enough illumination for recording purposes.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180328/20180328185455_3719.jpgFigure 1. Setup for investigating context-driven salt seeking and close up views of the place preference chamberTwo contexts (12.5 x 12.5 x 18.5 in.) within the chamber are paired with one of two solutions, while the third middle context (5 x 12.5 x 18.5 in.) connects the other two contexts and is paired with nothing. One of the paired contexts is designated the Grid context. The Grid context has a transparent acrylic floor in a grid-like pattern with electrical tape on the outside walls that form a grid-like pattern. The other paired context is designated the Striped context. The Striped context has the same grid-patterned floor, but the outside walls have electrical tape in a parallel diagonal pattern. Each of these two contexts also has a distinctive object to aid in discrimination (e.g., a metal binder clip or an empty plastic microscope coverslip case). Both contexts have holes on either end to allow for a spout connected to a bottle filled with a solution to be available for the rats to drink from.",
    "The third, middle context that connects the Grid and Striped contexts is designated the Neutral context that consists only of clear acrylic walls and is the starting point for each training and testing session. Although individual rats can sometimes naturally favor one context, it is important to first establish that there is no general bias towards one context of the other. If there is, adjustments can be made (e.g., to the lighting, chamber orientation, etc.).Behavioral training and testing protocolStep 1: TrainingRats undergo 8 days of initial training in which they learn to associate one context (Grid or Striped) with access to 3% sucrose in distilled water, and the other context with access to 3% salt in distilled water. Each solution is mixed with 2 g of sugar-free Kool-Aid powder (orange or grape) to aid discrimination between the two contexts and solutions. The assignment of context, solution, and Kool-Aid flavor pairings are counterbalanced across rats but kept constant within each rat.On each training day (4 days total in each context), rats are placed into the Neutral context and allowed to freely explore one context (Grid or Striped) for 20 min. Access to the other paired context is blocked. During these sessions, rats are allowed to freely drink from a bottle of 100 ml of either sucrose or salt (orange and purple bottles as in Step 1 of Figure 2). The order of context exposure is pseudorandomly assigned between rats.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180328/20180328190216_5153.jpgFigure 2. Behavioral training and testing procedure to investigate context-driven salt seeking in rats. Step 1: Rats are trained over 8 days to associate one context with access to sucrose (e.g., Grid) and another context with access to salt (e.g., Striped).",
    "Step 2: Rats are then given a baseline test session in which they have access to both contexts without sucrose or salt (but flavored solutions still present). Following 4 days of retraining (2 days in each context), rats are then depleted of bodily sodium through furosemide injections (i.p.). Step 3: After 48 h, rats are placed back into the chamber for a depletion test that is identical to the baseline test session. Step 4: Finally, rats are given a consumption test that is identical to the previous test sessions but sucrose and salt are now available. All training and testing sessions are 20 min in length.Step 2: Baseline testOnce initial training is complete, rats are then given a 20 min baseline preference test in which they are allowed to explore the entire chamber, including both the Grid and Striped contexts, for the first time (both wall inserts are removed). The Grid and Striped contexts in this test session are identical as in training. One important exception is that sucrose and salt are not present in the flavored solutions. We conduct the baseline preference test in this way to gauge rats’ ability to use the contextual cues of the chamber to guide their behavior. The test serves as an important comparison point for an identical test conducted after sodium depletion.Retraining and sodium depletionFollowing the baseline test session, the rats are given an additional 4 days of training (2 sessions in each context) that is identical to the initial training sessions (Step 1). We give rats an additional 4 days of training to re-strengthen the associations between sucrose and salt with their respective contexts, which may be weakened following the baseline preference test. After the final training session, rats are given systemic injections of the diuretic furosemide (10 mg/ml/kg; i.p.; Merck).",
    "In order to maintain sodium deprivation, rats are also maintained on a sodium-free diet (TestDiet) and distilled water immediately following furosemide injections.Step 3: Depletion testForty-eight hours after the furosemide injection, rats are then given another context preference test (depletion test). This test is identical to the baseline preference test (i.e., the full chamber is accessible; flavored solutions are available, but contain no salt or sucrose), except now the rats are sodium-deprived. We perform the depletion test this way in order to directly compare the elevation in time spent in the salt-paired context following sodium depletion compared to the baseline preference test.Step 4: Consumption testThe next day, rats are given a final context preference test with sucrose and salt now present in the flavored solutions (consumption test). This allows us the opportunity to confirm that rats are indeed sodium-depleted. It also further provides an opportunity to investigate any possible neural dissociations between context-driven salt seeking (depletion test) and the consumption of salt (consumption test) following sodium depletion. Upon completion of this test, rats are placed back on their normal food and water diet."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}