{
  "id": 6978,
  "origin_website": "Bio",
  "title": "A Method to Efficiently Cryopreserve Mammalian Cells on Paper Platforms",
  "procedures": [
    "Preparation of paper (see Video 1)Autoclave the paper and cut it, using sterile scissors, into ~3 x 3 cm2 strips under the hood (Papers can be cut to other sizes and shapes as well, provided that the pipetted cell suspension saturates the paper. See Notes for details).Place the paper strips in sterile 60 mm x 10 mm Petri dishes (one strip per dish) and pipette 100 µl DPBS containing 10 µg/ml fibronectin concentration under the hood. After adding the fibronectin solution, incubate the paper fibers for 20 min at room temperature. To avoid water evaporation, make a humidifying chamber by using wet tissues inside Petri dishes and cover their lid (see Notes for the evaporation rate).Remove the excess fibronectin by rinsing the paper strips twice with 100 µl DPBS for about 5 s.Keep the fibronectin-treated paper strips in the humidifying chamber until the cells are prepared and loaded.<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Steps involved in preparation of paper strips for use in cryopreserving mammalian cells. Paper strips of any type, size and shape can be used provided that the paper pores are suitable for cells to penetrate within and the fibronectin is saturating the paper.Preparation of cellsCulture ~106 cells in T-75 flasks using 10 ml complete DMEM (see Recipes) and place them in a humidifying incubator at 37 °C and 5% CO2.Passage cells for a maximum of 15 to 24 passages.Dissociate the cells from the flasks when they are ~80% confluent using 2 ml TrypLE for 5 min. Transfer the cells to 15 ml centrifuge tubes to centrifuge at 300 x g for 5 min at 37 °C.",
    "Resuspend the cell pellet (~107 cells) in 1 ml room temperature DPBS and apply trypan blue exclusion assay to count the number of live and dead cells using cell counting chamber slides and automated cell counter.Centrifuge cells at 300 x g for 5 min at 37 °C and resuspend the cell pellet (~107 cells) in 300 µl DMEM-based freezing medium (see Recipes).Cryopreservation of cells (see Video 2)Transfer fibronectin-coated paper strips to sterile 35 mm x 10 mm Petri dishes (one strip per dish) and pipette onto them 300 µL of cell suspensions (~107 cells/ml per cm2, see Notes).Roll the paper strips with tweezers within 1 min to prevent evaporation of cell suspension and place them immediately in cryotubes. Then, place the cryotubes in Mr. Frosty freezing container. To control the rate of freezing, fill the container with 100% isopropyl alcohol to the indicated line.Slow freeze the cells in Mr. Frosty container for overnight to -80 °C at a -1 °C min-1 rate.Transfer the cells to cryoboxes for long-term storage in liquid nitrogen at -196 °C.<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 2. Cell loading into paper strips. Roll the paper strips and place them in standard cryotubes within one minute to prevent evaporation of the suspension medium.Thawing cells on-demandTake the cryotubes from liquid nitrogen and thaw them in water bath at 37 °C for 30 s.Cells can be cryopreserved in larger sheets. In this case, cut a small portion of the sheet using sterilized scissors, followed by thaw. Place the unused sheet back in liquid nitrogen. Verify the cell viability on sheets after each sample retrieval cycle.Releasing cells from paperRemove the cell-loaded paper strips from the cryotubes under the hood and place them in 15 ml centrifuge tubes containing 10 ml of complete DMEM.",
    "Manually shake centrifuge tubes for about 20 s to release the cells from paper.Remove the paper strips from the tubes using sterile tweezers.Centrifuge the cell suspension in the tubes at 300 x g for 5 min at 37 °C to pellet the cells.Wash the cell pellet three times with 1 ml room temperature DPBS.Resuspend the cells in complete DMEM in T75 flasks and place the flasks in humidifying incubator at 37 °C and 5% CO2 to expand them as 2D culture (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200914/20200914230606_6096.jpgFigure 2. Confocal microscope images show cells expanded as 2D culture after paper-based and conventional (control) cryopreservation. Following their proliferation for 3 days, the spread of actin (red) and tubulin (green) and the presence of nucleus (blue) confirmed no morphological abnormalities or differences between paper-retrieved and freshly cultured HeLa cells.(Optional) Apply trypan blue exclusion assay to directly count the number of released live and dead cells using cell counting chamber slides and automated cell counter.(Optional) Utilize the cells that still remain on the paper (Figure 3) for further in vitro 3D culture growth and spheroid formations (Alnemari et al., 2020) or any other cellular application. This is achieved by placing the paper, with remaining cells, in sterile Petri dishes and allowing cells to 3D expand inside humidifying incubator at 37 °C and 5% CO2. Note that this step has been extended in our recent study (Alnemari et al., 2018) to form arrays of 3D cell cultures on paper platforms, and currently we are advancing its applicability to cryopreserving these arrays.Cryopreservation of 3D cell culturesAdd cells (~107 cells/ml concentration) to 100% Matrigel at 4 °C (placed on ice) and subsequently pipette the cell suspensions in Matrigel onto the autoclaved paper strips placed in sterile Petri dishes (~107 cells/ml per cm2).",
    "Leave paper strips for 10 min at room temperature for the Matrigel to solidify.Submerge paper strips in complete DMEM for 7 days in humidifying incubator at 37 °C and 5% CO2 to allow the proliferation of cells within the paper.Roll the paper strips and place them in standard cryotubes containing DMEM-based freezing medium. Place the cryotubes in cryoboxes.Slow freeze the proliferated cells for overnight to -80 °C at a 1 °C min-1 rate.Transfer the cells to liquid nitrogen at -196 °C for long-term storage.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200914/20200914230617_9137.jpgFigure 3. Confocal microscope images show the viable cell release from paper after thaw. Following their load onto 10 µg/ml fibronectin-treated papers and subsequent freeze and thaw, the relative distribution of live (green) and dead (red) HeLa cells within the paper platform visually demonstrate the effective release of viable cells from paper.Thawing and providing 3D cell cultures on-demandTake the cryotubes from liquid nitrogen and thaw them in water bath at 37 °C for 30 s.In case the cell culture is cryopreserved in larger sheets; cut a small portion of the sheet, followed by thaw. Place the unused sheet back in liquid nitrogen.Submerge the paper strips with remaining cells in complete DMEM in sterile Petri dishes for additional cell proliferation in humidifying incubator at 37 °C and 5% CO2.(Optional) Use Live/Dead assay to visually assess (as control) the distribution of live/dead cells within the papers (Figure 4). This is a useful step especially when working with 3D cell cultures (see Recipes for procedure details)."
  ],
  "subjectAreas": [
    "Cell Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}