{
  "id": 10619,
  "origin_website": "Jove",
  "title": "A Protocol for Decellularizing Mouse Cochleae for Inner Ear Tissue Engineering",
  "procedures": [
    "All procedures, including animal euthanasia, were conducted according to the approved Institutional Animal Care and Use Committee (IACUC) protocol (ACUP #2014-2234) at the University of Kansas Medical Center (KUMC).\nNOTE: HWJCs were isolated from human umbilical cords that were donated by patients that provided informed consent and specimens were used in accordance with the protocols approved by the University of Kansas Human Subjects Committee (KU-IRB #15402).\n1. Temporal Bone Harvest and Cochlea Isolation\nDecapitate an appropriately euthanized, 15-week-old mouse by cutting between the skull and first cervical vertebra with a sharp pair of surgical scissors, then spray down the head with 70% ethanol to disinfect (Figure 1A).\nBisect the skull in a mid-sagittal plane using the same sharp pair of surgical scissors (Figure 1B-C, dashed lines).\nRemove the brain tissue from the skull using a pair of forceps (Figure 1D, arrowhead).\nIdentify the temporal bone through the presence of the auditory and vestibular nerve roots (Figure 1E-F, arrowheads) on the interior of the skull and the ear canal from the exterior (Figure 1F, arrow). Carefully cut through the skull to isolate the temporal bone from the remainder of the skull (Figure 1G).\n\tNOTE: In some instances, it may be possible to delicately pry the surrounding bones of the skull away from the temporal bone without requiring cutting.\nInsert the fine forceps into the opening of the ear canal approximately 5 mm (Figure 1H), so the tips do not risk puncturing the cochlea. Gently break open the bone of the bulla (Figure 1H, top red shaded area) so it fractures (Figure 1I, red dotted line).\n\tNOTE: If necessary, a dissection microscope may aid in this process to ensure accurate placement and manipulation of instruments.",
    "Using fine forceps, pry away the remainder of the bulla from the temporal bone, exposing the bony labyrinth of the cochlea (Figure 1J, red brackets).\nPlace a Petri dish large enough to hold the temporal bone (e.g., 30 mm or greater) underneath the dissecting scope field of view and fill it with enough Phosphate Buffered Saline (PBS) to cover the temporal bone (e.g., 0.5 to 1 mL).\nSubmerge the temporal bone with the bulla removed in the PBS with the oval and round windows of the cochlea facing up.\n\tNOTE: Removal of the vestibular system from the cochlea is not necessary, as the vestibular system serves well as a handle for manipulating and orienting features of the cochlea (Figure 1I and Figure 2B).\nUsing an ultra-fine pair of forceps, remove the stapedial artery, which passes through the stapes.\nInsert one tip of the ultra-fine forceps through the arch of the stapes where the artery passed through, and delicately lift the stapes upward. The disarticulated stapes should lift off of the oval window.\nUsing one tip of the ultra-fine forceps, puncture the oval and round windows.\nUsing a 1x PBS filled 28.5-gauge syringe with tubing (inner diameter 0.28 mm, outer diameter 0.61 mm) attached, position the tubing over the oval window (Figure 2A - B).\n\tNOTE: The opening of the tube can be manipulated using ultra-fine forceps helping to ensure accurate placement.\n\t\nUse a fresh syringe and tubing for each cochlea.\nPerfuse 2 mL of 10% antibiotic-antimycotic (anti-anti) and 10% penicillin-streptomycin (pen-strep) in PBS through the cochlea over 5 min to remove the perilymph. Perfusing too fast with too much pressure will damage the fine structures within the cochlea.",
    "NOTE: Manually driving the syringe by hand to perfuse the fluid through the cochlea is effective, although a perfusion pump could be used as an alternative.\n\t\nIf manually perfusing, use a pair of fine, self-closing forceps to stabilize the cochlea (Figure 2A) during perfusion by grasping the vestibular portion of the temporal bone.\n\t\tNOTE: Although not required, this leaves both hands free to handle instruments; one hand can drive the syringe (Figure 2A) while the other can position the tubing appropriately (Figure 2B).\nFrom this step forward, take care to avoid exposing the cochlea unnecessarily to air. Introducing air bubbles into the fluid spaces will block fluid circulation, and further drying out will damage the fine structures within the cochlea.\nRemove and discard any remaining muscle tissue and bone fragments using fine forceps.\nIf necessary, store isolated cochleae at 4 °C in 10% anti-anti and 10% pen-strep solution in PBS for up to seven days with regular changes of antibiotic solution every 48 h.\n2. Cochlear Processing\nDecellularization\nFor each cochlea, fill a 20-mL glass scintillation vial with a 1% sodium dodecyl sulfate (SDS) solution in de-ionized (DI) water, which is used to decellularize the cochlea.\nCut the tip off of a plastic 7-mL transfer pipette using a razor blade so that the opening is large enough for a cochlea to pass through.\nUsing the transfer pipette, gently draw the cochlea up into the pipette so it just passes the cut-off edge by a few millimeters.\nExpel the cochlea into the 1% SDS solution-filled scintillation vial.\nCirculate 2 mL of 1% SDS in de-ionized (DI) water through the cochlea in the scintillation vial using a transfer pipette.\nPlace the scintillation vial into a rotator, and allow the scintillation vial to rotate at 10 rpm for 72 h at room temperature.",
    "Change 1% SDS solution every 24 h over a 72 h period. Take care when changing SDS to never expose the cochlea to air.\nWash the cochlea three times for 30 min each with DI water. Perform the washes in the same scintillation vial used for the SDS charges; at this stage, the cochlea is decellularized.\nDecalcification\nRemove the remaining DI water from the scintillation vial, leaving just enough to keep the cochlea submerged.\nTo begin decalcification, add 5 mL of 10% ethylenediaminetetraacetic acid (EDTA) (0.02 M) in DI water to the scintillation vial containing the cochlea.\nCirculate 2 mL of 10% EDTA in DI water through the cochlea in the scintillation vial using a transfer pipette.\nPlace the scintillation vial back in the rotator, and allow the scintillation vial to rotate at 10 rpm for 72 h at room temperature. Change the 10% EDTA solution every 24 h over a 72 h period. Take care when changing solutions so that the cochlea is not exposed to air.\nRinse the cochlea 3 times for 2 h each with 1x PBS; at this stage, the cochlea is decalcified.\nStorage\nStore the cochleae for up to 72 h in a 10% anti-anti, 10% pen-strep solution in PBS at 4 °C.\n\t\tNOTE: Longer storage periods may be possible with regular changes of antibiotic solution; however, extended storage of processed cochleae has not been validated in this protocol.\n3. Procurement and Expansion of hWJCs\nIsolate hWJCs according to previously published protocols22. Briefly, segment umbilical cords into 3-cm sections.\nCarefully make a shallow incision with a scalpel lengthwise on each umbilical cord segment to unroll and expose the Wharton's jelly of the umbilical cord. Use forceps to remove the blood vessels.",
    "Wash umbilical cord segments twice with enough PBS (e.g., 40 mL in a 60 mm Petri dish) to submerge the tissue. Finely mince tissue segments with a scalpel. Digest tissue in a 100 mm Petri dish with 50 mL of digestion medium (0.2% type 2 collagenase, 1% penicillin-streptomycin, in low-glucose Dulbecco's Modified Eagle's Medium (DMEM)).\nPlace tissue in digesting medium on an orbital shaker at 50 rpm overnight in a 5% CO2, 37 °C incubator. The following day, dilute digestion medium at a ratio of 1:16 in 2% antibiotic-antimycotic in PBS, and pellet cells by centrifugation at 500 x g at room temperature (~ 27 °C) for 10 min. Discard supernatant.\nResuspend pellets in Mesenchymal Stem Cell Growth Medium (MSCGM) and recombine cells. Plate cells at a density of 7 x 103 cells/cm2 in tissue culture treated T-75 flasks. Culture HWJCs in MSCGM, and expand to passage 5 for experiments.\n\tNOTE: HWJCs may be sub-cultured into larger T-flasks (e.g., T-150, T-300) when passaging to increase yield of hWJCs for experiments.\n4. Infusion of hWJCs into Decellularized Cochleae\nPrepare decellularized cochleae\nUsing aseptic technique, wash stored cochleae in 1x PBS three times for 30 min each.\nTransfer cochleae into separate wells of a 24-well plate, and add 1 mL of 37 °C pre-warmed MSCGM.\nIncubate cochleae in a 5% CO2, 37 °C cell culture incubator for a minimum of 1 h before infusion of cells.\nDissociate hWJCs and resuspend\nWash hWJCs with 37 °C pre-warmed 1x PBS twice.\nAdd enough 37 °C pre-warmed Trypsin with 0.5% EDTA to cover the cell vessel surface.\nIncubate hWJCs for up to 5 min in a 5% CO2, 37 °C cell culture incubator.\n\t\t\nVerify that 90% of cells have detached from the cell culture surface by viewing cells under an inverted microscope.",
    "NOTE: Cells that move when the culture vessel is gently tapped, have detached. Cells that remain stationary, have not detached.\nGently tap the sides of the flask to further dislodge attached cells.\nUsing aseptic technique, transfer hWJCs from the culture vessel to a 50-mL conical tube containing an equivalent volume of MSCGM to the volume of Trypsin used to dissociate the cells.\nPellet the hWJCs by centrifuging at 500 x g at room temperature (~ 27 °C) for 5 min.\nAspirate supernatant, and resuspend hWJCs in MSCGM at a concentration of 500,000 cells/mL.\nPerfuse cochleae\nTransfer cochleae to a new 24-well plate using a transfer pipette.\nAdd a drop of MSCGM to each cochlea to prevent any cochlea from drying out.\nDelicately orient the cochlea using ultra-fine forceps so that the oval and round windows are facing up.\n\t\tNOTE: Take extreme care when directly handling each cochlea as the cochlea is easily damaged.\nUsing a sterile 28.5-gauge insulin syringe with connected tubing, draw up 0.2 mL resuspended hWJCs (100,000 cells).\nUsing sterilized fine forceps, position tubing over the oval window.\nDelicately and slowly perfuse the cochlea with 0.2 mL of resuspended hWJCs using a 28.5-gauge insulin syringe connected to polyethylene tubing (Outer Diameter: 0.61 mm, Inner Diameter: 0.28 mm) over approximately 5 min.\nAfter perfusion, add 0.8 mL of 37 °C pre-warmed MSCGM to the well containing the cochlea to bring the total volume in the well to 1 mL.\nRepeat steps 4.3.3-4.3.7 for each cochlea, using a fresh syringe and tubing each time.\nPlace perfused cochleae in a 5% CO2, 37 °C cell culture incubator, and change media three times per week.\n5. Cochlea Harvest and Preservation\nNOTE: Cochleae may be cultured and harvested at any time point up to 30 days post-perfusion.",
    "To preserve cochleae, fix in 4% paraformaldehyde in 1x PBS overnight at 4 °C on a rocking platform.\nAfter fixation, wash cochleae with 1x PBS three times for 5 min each.\nGradually dehydrate cochlea with ethanol and clear with an aliphatic hydrocarbon solvent before embedding in paraffin.\nSection samples to a thickness of 10 µm using a microtome and mount on glass microscope slides.\n\tNOTE: Samples are now ready for histological or immunohistochemical processing using standard protocols.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}