{
  "id": 14956,
  "origin_website": "Jove",
  "title": "Primordial Germ Cell Cryopreservation and Revival of Drosophila Strains",
  "procedures": [
    "1. Equipment preparation\nMicromanipulator system: Assemble a micromanipulator system to collect and transplant cells (Figure 1A).\nPGC-collection glass slides (Figure 2A)\n\t\nTo prepare heptane glue, cut approximately 30 cm long double-sided tape and soak it overnight in 7 mL of technical (regular)-grade heptane solution.\nDraw two parallel reference lines for embryo alignment on the back of a glass slide.\nSpread drops of the above heptane glue on the glass slide (on the side without the lines) using a Pasteur pipette. Air-dry the surface of the slide until it becomes white.\nRepeat the addition and spreading of heptane-glue drops and dry the slide again.\n\t\tNOTE: The glue prevents liquid solutions from spreading over the flat surface and makes it easier to load aqueous solutions into a needle.\nTo make embryo-pool frames, stick three layers of 0.2 mm-thick standard vinyl tape, such as electrical tape, on a cutting board. Cut the tape into 1.5 cm-wide rectangles. Then, cut away all three layers of tape, leaving a 2 to 3 mm frame.\n\t\tNOTE: An embryo-pool frame is affixed after aligning embryos, to form a pool for embryos.\nTransplantation needles\n\tNOTE: All commercially available needles at the time of this study were too narrow or too broad for PGC cryopreservation.\n\t\nMake a needle using a glass capillary and a puller. We use a NARISHIGE PN-31 puller with the heater level at 85.0-98.4, the magnet main level at 57.8, and the magnet sub-level at 45.0.",
    "To make a needle with an approximate wall thickness of 1 µm and a tip of approximately 200 µm in length with an inner diameter of 10-12 µm, polish the needle tip in the following three-step process (Figure 3). First, grind down the needle tip at an angle of 30° at a speed of 780 rpm until the tip has an inner diameter of 10-12 µm. This first grinding step takes approximately 1 h.\n\t\tNOTE: To avoid breaking the needle tip, first rotate the grindstone and then gently move the needle down onto the grindstone.\nDraw a line on the top of the needle to track the desired angle. Rotate the needle counterclockwise at 90° and polish it again at a speed of 180 rpm. This takes approximately 5 min.\nRotate the needle clockwise 45° and polish it at a speed of 180 rpm for one second.\nPlace a collection glass slide with a drop of chromic acid mixture (CAUTION: toxic) onto the microscope stage. Attach the needle to the capillary holder (Figure 1D) at a 10°-13° angle relative to the slide surface, carefully move the needle down, and immerse the tip in the chromic acid mixture.\nBy pulling and pushing the plunger (Figure 1B), mechanically load and discharge the solution from the needle several times to remove glass debris in the needle. Be sure to clean the outer wall as well.\nWash the inside and outside of the needle two times with distilled water to remove the chromic acid completely.\n2. Collection and cryopreservation of PGCs\nCollecting embryos",
    "Transfer an appropriate number of flies of the donor strain of interest (approximately 450 for each sex for the embryo-collection cup) into an embryo-collection cup with an embryo-collection plate (Figure 1E) and incubate them at 25 °C. We usually use 3- to 5-day-old parental flies that are reared under less crowded conditions at room temperature (23-25 °C).\nPerform two 30-min pre-collections and discard any eggs laid. Because females can retain fertilized eggs that develop in the oviduct, this step is required to synchronize egg laying in step 2.1.3 (Figure 4).\nAfter the two pre-collections, collect embryos for 50 min and then incubate the collected embryos in a humidified chamber at 25 °C to allow the embryos to develop to the blastoderm stage (early stage 517). The incubation time is usually 100 min but can be extended up to 120 min, depending on the strain (Figure 4).\n\t\tNOTE: A humidified chamber is made by placing a moist paper towel at the bottom of a plastic box and spraying it with a mist of water before use. In early stage-5 embryos, PGC formation is complete, but somatic cellularization is not. The exact stage of an embryo is determined under a compound microscope in step 2.4.\nDechorionating embryos\n\t\nDeposit a drop of distilled water on a stainless-steel mesh strainer (150 mesh, 109 µm opening, 60 µm wire diameter; Figure 1F). Using forceps, collect embryos from the embryo-collection plate and put them in the water droplet.\nPress tissue paper against the strainer from underneath to absorb the water. Add droplets of fresh 5% (as Cl) sodium hypochlorite solution to the embryos and continuously tap the strainer for 10 s.",
    "Wash the embryos by directly splashing them with distilled water and press tissue paper against the strainer from underneath to absorb the water. Repeat this step 3x.\nAligning dechorionated embryos\n\t\nUnder a stereo microscope, use forceps to transfer embryos. Align the dechorionated embryos in two rows on a PGC-collection glass slide along the two reference lines (Figure 2A). The embryos are oriented with their anterior to the right (the side to be manipulated) and ventral side up.\n\t\tNOTE: This step should be finished in 20 min, during which we usually align approximately 40 embryos.\nAffix an embryo-pool frame around the embryos on the PGC-collection glass slide. Drop 1 µL of CPA solution (1x Ephrussi-Beadle Ringer solution, EBR, containing 20% ethylene glycol and 1 M sucrose; 1x EBR: 130 mM NaCl, 5 mM KCl, 2 mM CaCl2, and 10 mM Hepes at pH 6.9) at two separate spots in the area enclosed by the frame and fill the pool with silicone oil to prevent the embryos from drying out (Figure 2A).\n\t\tNOTE: To prepare the CPA solution, completely dissolve 10.26 g of sucrose in approximately 20 mL of distilled H2O containing 3 mL of 10 x EBR solution. Add 6 mL of ethylene glycol and then add distilled H2O up to 30 mL. After thorough mixing, filter the solution through a 0.22 mm disposable membrane.\nCollecting PGCs\n\t\nPlace the PGC-collection glass slide of step 2.3.2 onto the stage of a microscope equipped with a micromanipulator system. Attach the needle to the capillary holder and bring the first embryo in the left row and the needle tip into the same focal plane. Load silicone oil into the needle for 2-3 s.",
    "Begin PGC collection from embryos in the left row. Using a 20x objective lens, gently move the needle tip to the surface of the anterior end of the embryo and penetrate the embryo toward the posterior end, not by moving the needle but by moving the microscope stage.\nWhen the needle tip reaches the posterior end, retract the needle slightly and completely discharge any yolk in the needle just inside the somatic cell layer.\nWhile keeping the pressure in the needle constant, move the needle tip to the PGCs just inside the posterior pole and gently, but without taking much time, load the PGCs.\nPull the needle out of the embryo quickly and discharge yolk and other contaminants from the needle into the silicone oil pool, keeping the PGCs in the needle. Then, load clean silicone oil from the pool.\nRepeat steps 2.4.2 to 2.4.5 for the other embryos in the left row. Before collecting PGCs from a new embryo, deposit as much of the silicone oil loaded in step 2.4.5 inside the somatic cell layer as possible while keeping loaded PGCs in the needle. This ensures that newly loaded PGCs are adjacent to the previously collected PGCs without any intervening material between them.\nAfter completing PGC collection from embryos in the left row, separate PGCs from the yolk and other contaminants as much as possible. To achieve this, deposit all PGCs in the needle onto the surface of an embryo and remove any yolk or other contaminants to another neighboring embryo.\nNext, collect PGCs from embryos in the right row. Combine the PGCs collected from the right and left rows.\nApplying cryoprotective agent (CPA) to PGCs",
    "After washing the needle with CPA in one drop, load fresh CPA in another drop into the needle and add CPA to the PGCs deposited on the embryo. The volume of CPA should be equivalent to that of the PGCs.\nRemove as much CPA as possible from the cluster of PGCs 1-2 s after the addition of CPA. PGCs shrink slightly and become square in shape immediately after CPA addition.\nEmpty the needle and then load silicone oil for 5 s or longer. Load all the collected PGCs and then load silicone oil once again for 5 s or longer. PGCs are now sandwiched between two layers of silicone oil (Figure 2B).\n\t\tNOTE: It is important to remove as much yolk, CPA, and other contaminants as possible.\nCryopreserving PGCs\n\t\nOpen the three-way stopcock (Figure 1C) and then detach the needle from the micromanipulator. Blot the oil off the surface of the needle with soft tissue paper. Do not directly touch the tip of the needle with the tissue.\nAttach the needle to a needle holder and lock it in position at the base using vinyl tape (Figure 1H). Affix a label to the holder tube.\nFlash freeze the holder with the needle pointing downwards by submerging it in liquid nitrogen. Do not release the holder until the liquid stops fizzing out of the rack.\nStore the holder in a liquid nitrogen storage tank in the liquid phase area, not the vapor phase area.\n3. Thawing and transplanting PGCs\nCollecting, dechorionating, and aligning embryos from agametic host flies\n\t\nCollect and dechorionate embryos from agametic host flies following step 2.",
    "Align the stage 5 agametic host embryos on a transplantation glass slide. However, this time, orient the posterior to the right (the side to be manipulated) and ventral to the top (Figure 5). Line up approximately 30 embryos in two rows in 20 min.\nWhile aligning embryos, operate a humidifier for 2-10 min if the room humidity requires it (Table 1). The ideal humidity is 30% to 40%, but this can vary depending on thermal conditions.\nThawing and transplanting PGCs in host embryos\n\t\nTo quickly thaw cryopreserved PGCs, slip the holder containing the needle into room temperature 1x EBR solution with the needle pointing downwards and keep it submerged for 10 s.\nPlace the transplantation glass slide on the stage of a microscope. Attach the freeze-thawed needle to the capillary holder and bring the first embryo in the left row and the needle tip into the same focal plane.\nUsing a 20x objective lens, gently move the needle tip to the surface of the posterior end of the embryo.\nGently prod the outside of each embryo and make sure that they slowly return to their original shape. The prodding will confirm that the inner pressure of the embryo is not too high or too low. \nGently move the needle and penetrate an embryo from the posterior pole.\nGently deposit approximately 10-20 PGCs just inside the posterior pole, precisely between the vitelline membrane and the somatic cell layer of the embryo. Avoid depositing them in the somatic cell layer. If the perivitelline fluid leaks out of the embryo, suck the leaked fluid into the needle and remove it.\nRetract the needle from the embryo. Repeat steps 3.2.5 and 3.2.6 for subsequent embryos.\n4. Incubating embryos and restoring donor strains",
    "Remove any embryos that do not receive transplanted PGCs and incubate the remaining embryos in a humidified chamber (Figure 1G) at 25 °C.\nAt 24 h or more after transplantation and as soon as possible after hatching, use forceps to pick up and transfer hatched larvae to standard Drosophila food vials and incubate at 25 °C.\nTo revive the strain, cross newly emerged females and males (Figure 6).\n\t​NOTE: Agametic hosts make it possible to restore the entire genome at once without crossing to balancer-chromosome strains. The co-existence of agametic males in a vial will not matter because females, even if mated with them, do not show long-term post-mating responses, including decreased receptivity to remating18,19.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}