{
  "id": 10122,
  "origin_website": "Jove",
  "title": "Fragmenting Bulk Hydrogels and Processing into Granular Hydrogels for Biomedical Applications",
  "procedures": [
    "1. Fabricating bulk hydrogels inside of a syringe using photocrosslinking\nNOTE: An overview of bulk hydrogel fabrication inside a syringe using photocrosslinking is shown in Figure 1. This protocol uses norbornene-modified hyaluronic acid (NorHA) to fabricate bulk hydrogels using a photo-mediated thiol-ene reaction. Detailed procedures for the synthesis of NorHA are described elsewhere38. However, this protocol is highly adaptable to any photocrosslinkable hydrogel. See Discussion for more information.\nPredetermine desired concentrations of polymer, crosslinker, and initiators for the bulk hydrogel formulation. In this protocol, the hydrogel precursor solution consists of NorHA (2 wt.%, ~25% degree of norbornene modification), dithiothreitol (DTT, 6 mM), and Irgacure D-2959 (I2959, 0.05 wt.%). Ensure that the components (1 mL) are fully dissolved in phosphate-buffered saline (PBS) within a microcentrifuge tube.\n\tNOTE: When preparing the hydrogel precursor solution, high molecular weight FITC-dextran (2 MDa, 0.1 wt.%) can be added to the solution to visualize microgels fabricated later in the protocol using fluorescent microscopy.\nLoad a 3 mL syringe with the hydrogel precursor solution.\n\t\nRemove the plunger from the back of an empty 3 mL syringe and add a tip cap to the top of the syringe barrel.\nUse a 1,000 µL pipette to transfer the hydrogel precursor solution into the syringe barrel with the tip cap.\nHold the syringe barrel with hydrogel precursor solution in one hand, with the tip cap facing down and the open end of the barrel facing up. With the other hand, return the syringe plunger to the opening of the back of the syringe barrel. Gently push the syringe plunger into the barrel, just enough to seal the opening at the back of the syringe barrel.",
    "Carefully holding the plunger and syringe barrel together to ensure the back of the syringe barrel is sealed with the plunger, invert the syringe such that the plunger is facing down, and the tip cap is now facing up. Remove the tip cap and gently push the plunger into the syringe barrel until all the air is removed from the syringe (just hydrogel precursor solution remains).\nReattach the tip cap to the syringe. Ensure that the hydrogel precursor solution is secured within the 3 mL syringe with a tip cap.\nForm a bulk hydrogel within the 3 mL syringe.\n\t\nEnsure proper personal protective equipment (PPE) and safeguards are taken prior to turning on the UV lamp. This includes wearing UV-protectant eyeglasses and enclosing the lamp area to protect others from UV light.\nCalibrate the UV spot cure lamp to a light intensity of 10 mW/cm2 using a radiometer.\n\t\tNOTE: There will be light attenuation through the syringe barrel. Prior to fabrication, determine the percentage of light attenuation present using a radiometer. Light intensity output from the spot curing system should be adjusted accordingly to account for such attenuation.\nPlace the 3 mL syringe loaded with the hydrogel precursor solution under the UV spot cure lamp for a desired amount of time to fully photocrosslink. For the system described herein, NorHA hydrogel precursor solution is exposed to UV light for 5 min at an intensity of 10 mW/cm2, which, based on prior studies39, was sufficiently enough time and light intensity to ensure complete crosslinking as determined by photocrosslinking oscillatory shear rheology time sweeps.\n\t\tNOTE: To ensure complete photocrosslinking within the syringe, the syringe can be flipped halfway through the photocrosslinking period.",
    "Turn off the UV lamp and remove the syringe. Ensure that the hydrogel is now photocrosslinked within the syringe. This can be done by pulling back the plunger and observing the hydrogel move as a solid block rather than a viscous liquid.\nimgsrc://cloudfront.jove.com/files/ftp_upload/63867/63867fig01v2.jpg\nFigure 1: Overview of fabricating bulk hydrogels inside a syringe using photocrosslinking. The figure depicts (A) removing the plunger from the syringe, (B) securing the tip cap to the syringe barrel, (C) adding hydrogel precursor to the syringe barrel, (D) returning the plunger to the syringe, (E) removing excess air and securing the tip cap, and (F) photocrosslinking bulk hydrogel inside of the syringe. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/63867/63867fig01largev2.jpg]\n2. Fabricating microgels using extrusion fragmentation\nNOTE: An overview of microgel fabrication using extrusion fragmentation is shown in Figure 2.\nRemove the plunger from the back of an empty 3 mL syringe. Secure a tip cap to the Luer-Lock.\nRemove the tip cap from the syringe containing the photocrosslinked bulk hydrogel. Line up the top of the hydrogel syringe with the opening of the barrel on the empty syringe.\nExtrude the bulk hydrogel through the syringe opening (no needle attached) into the barrel of the empty syringe. Properly discard the syringe that is now empty (formerly contained the hydrogel) into the proper waste stream.\nHold the syringe that contains the extruded hydrogel such that the tip cap is facing down, and the barrel opening is facing up. Using a 1,000 µL pipette, add 1.5 mL of PBS to the syringe barrel.",
    "Align the syringe plunger with the opening of the barrel, just barely pushing the plunger in enough to create a seal. Invert the syringe such that the plunger is now facing down and the tip cap is facing up, making sure to hold the plunger and syringe barrel together in place so that no hydrogel or PBS leaks out. Invert multiple times to mix the fragmented hydrogel with the PBS added.\nHold the syringe such that the tip cap is facing up and the plunger is facing down. Remove the tip cap. Very gently push the plunger upwards to remove any air from the inside of the syringe.\n\tNOTE: There will likely be a groove in the back of the 3 mL syringe that will require extra force to push the plunger in. Very carefully push the plunger over the groove. Any sudden or harsh amount of force will cause the plunger to move too fast and possibly expel the fragmented hydrogel suspension.\nExtrude the fragmented hydrogel suspension through a series of needles to create fragmented microgels.\n\t\nSecure a blunt-tip 18 G needle to the top of the syringe containing the fragmented hydrogel and PBS. Remove the plunger from a fresh 3 mL syringe and secure a tip cap to the empty syringe barrel.\nExtrude the fragmented hydrogel suspension through the 18 G needle into the back of the empty syringe barrel. Discard the empty syringe and needle into the proper sharps waste stream.\nHold the syringe that contains the fragmented hydrogel suspension such that the tip cap is facing down and the barrel opening is facing up. Align the syringe plunger with the opening of the barrel, just barely pushing the plunger in enough to create a seal.",
    "Invert the syringe such that the plunger is now facing down, and the tip cap is facing up, making sure to hold the plunger and syringe barrel together so that no hydrogel or PBS leaks out.\nHold the syringe such that the tip cap is facing up and the plunger is facing down. Remove the tip cap. Very gently push the plunger upwards to remove any air from the inside of the syringe. See the NOTE above regarding gently pushing the syringe plunger inward to prevent unwanted expulsion of hydrogel material.\nRepeat steps 2.7.1-2.7.5 with a 23 G, 27 G, and 30 G needle. Upon the last extrusion step (30 G needle), extrude the fragmented hydrogel suspension into microcentrifuge tubes. For the volumes described herein, the final fragmented hydrogel suspension volume will be ~2.5 mL, requiring two 1.5 mL microcentrifuge tubes (volume split equally).\n\t\tNOTE: No excessive force should be required to extrude fragmented hydrogel suspension through the needles. For best safety practices, it is recommended to perform all extrusion fragmentation steps inside of a chemical hood to provide protection in the event of syringe over-pressurization during extrusion. In addition, this process can be easily performed in a biosafety cabinet/laminar flow hood to maintain sterility during fabrication. See Discussion for additional troubleshooting suggestions.\nWash and isolate the fragmented hydrogel suspension.\n\tNOTE: Washing fragmented microgels will help to remove any unreacted polymer and crosslinker. In addition, centrifuging will help to isolate the microgels from the suspension by forming a pellet.\n\t\nUsing a microcentrifuge, spin down the fragmented microgel suspension at 5,000 x g for 5 min.\nUse a pipette to remove the supernatant. Add 1 mL of PBS to each microcentrifuge tube containing fragmented microgels and vortex for 5-10 s.\nRepeat centrifuging and washing with PBS 3x.\nimgsrc://cloudfront.jove.com/files/ftp_upload/63867/63867fig02.jpg",
    "Figure 2: Overview of microgel fabrication using extrusion fragmentation. The figure depicts (A) extruding bulk hydrogel into an empty syringe barrel and adding PBS, (B) securing a plunger in the syringe with fragmented hydrogel, (C) attaching an 18 G needle and extruding fragmented hydrogel suspension into an empty syringe barrel, and (D) repeating extrusion fragmentation steps with 23 G, 27 G, and 30 G needles, collecting fragmented hydrogel suspension in microcentrifuge tubes on final extrusion. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/63867/63867fig02large.jpg]\n3. Characterizing fragmented microgels using ImageJ\nNOTE: An overview of characterizing the fragmented microgels using ImageJ is shown in Figure 3, as well as representative results for describing size distributions and shapes within a batch of fragmented microgels. Microgels should be fluorescently labeled prior to visualization. For example, high molecule weight FITC-dextran (2 MDa) can be encapsulated in the bulk hydrogel prior to fragmentation to create fluorescein-labeled microgels.\nCombine 20 µL of fragmented microgel suspension with 180 µL of PBS to create a dilute fragmented microgel suspension. Vortex to mix thoroughly.\nTransfer 50 µL of dilute fragmented microgel suspension to a glass microscope slide.\nUse an epifluorescent microscope to acquire images of fluorescently-labeled microgels at 4x or 10x zoom.\n\tNOTE: The microgel suspension should be dilute enough such that neighboring microgels are not in contact with one another, yet concentrated enough such that dozens of microgels are visible in the viewport. The dilution of microgel suspension can be adjusted accordingly to achieve this.\nUsing ImageJ to analyze fragmented microgel particles. Additional information on using the Analyze Particles functionality in ImageJ can be found in the link provided in the Table of Materials.\n\t\nOpen the images of microgels in suspension in ImageJ.",
    "Select Analyze > Set Measurements, Check Area, Shape Descriptors, and Feret's Diameter. Click OK.\nSelect Image > Type > 8-bit.\nSelect Image > Adjust > Threshold. Adjust the threshold such that microgels are covered by a red mask, and the background remains black. Click on Apply.\n\t\tNOTE: If any microgels are slightly overlapping, use the Pencil Tool to draw a thin (<5 pixels) black line between microgels to separate them in the black and white image.\nSelect Analyze > Analyze Particles. Set Size (pixel2) from 50-Infinity to reduce background noise. Set Circularity to 0.00-1.00. Select Show Outlines from the Dropdown menu. Check Display Results, Exclude on Edges, and Include Holes. Leave the remaining boxes unchecked. Click on OK.\nA results display will open, including the area, shape descriptors, and Feret's diameter information for each microgel identified. Copy and paste the results into a spreadsheet.\nDetermine the equivalent circular diameter for each particle.\n\t\t\nObtain the image scale in µm/pixel from the scale bar or the instrument information. Create a column in the spreadsheet that converts the area of each microgel from pixel2 to µm2.\nUse the area in µm2 to determine the equivalent circular diameter of the microgel in µm (i.e., take the square root of the area divided by pi, then double it).\nUse the µm/pixel scale to convert the Feret's diameters (i.e., the longest distance between any two points on the particle boundary) for each microgel to a unit of µm.\nCircularity (\"Circ.\"), aspect ratio (\"AR\"), roundness (\"Round\"), and solidity values for each microgel can be used as is direct from ImageJ.\nAnalyze the microgel population as desired, considering the distribution of diameters (equivalent circular and Feret's), circularity, aspect ratio, roundness, and solidity.\nimgsrc://cloudfront.jove.com/files/ftp_upload/63867/63867fig03.jpg",
    "Figure 3: Overview of characterizing fragmented microgel particles using ImageJ. The figure depicts (A) creating a dilute suspension of fragmented microgel particles and using an epifluorescent or confocal microscope to image microgels in suspension (scale bar = 500 µm), (B) converting to a binary image in ImageJ and analyzing particles (count, shape descriptors, etc.), and (C) representative results. Error bars depict min and max with inner quartile ranges demarcated. A population size of n = 100 microgels is shown. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/63867/63867fig03large.jpg]\n4. Assembling fragmented microgels into granular hydrogels\nNOTE: Two methods for the formulation of granular hydrogels from fragmented microgels are presented, using centrifugation and filtration. The method used will depend on the desired microgel packing (i.e., filtration packs particles more densely) and whether biological components are included (i.e., centrifugation will retain components between particles, whereas in filtration these may be lost). Prior work40 thoroughly describes comparative outcomes (i.e., mechanics, porosity) for granular hydrogels formed from either centrifuge or vacuum-driven filtration.\nOption 1: Jam fragmented microgels using centrifugation.\n\t\nAfter removing PBS supernatant from the last washing step, add 1 mL of PBS to each microcentrifuge tube and resuspend the microgels.\nSpin down the fragmented hydrogel suspension at 18,000 x g for 5 min.\n\t\tNOTE: Slower centrifuge speeds can be used for the jamming of microgels into granular hydrogels with less dense packing if desired.\nRemove the PBS supernatant.",
    "Obtain a fresh 3 mL syringe and remove the plunger. Use a metal spatula to scoop the fragmented granular hydrogel out of the microcentrifuge tube and transfer it into the back of the empty syringe barrel. A pipette tip can be used to assist in transferring the granular hydrogel into the syringe. Return the plunger to the syringe. Now load the fragmented granular hydrogel into the syringe, and it is ready for use.\nOption 2: Jam fragmented microgels using vacuum-driven filtration. An overview of jamming by vacuum-driven filtration is depicted in Figure 4.\n\t\nAssemble and test the vacuum-driven filtration apparatus.\n\t\t\nSecure a Buchner funnel inside of a filter flask, placing the filter adapter in between the funnel and the flask opening.\nUse tubing to connect the filter flask to a vacuum line.\nPlace a membrane filter (0.22 µm) in the Buchner funnel cup.\nTurn on the vacuum line by opening the dial valve. Test the connection by pipetting ~0.5 mL of PBS onto the membrane filter and observe that all the PBS goes through the filter and collects in the bottom of the filter flask.\nTurn on the vacuum line and ensure a complete seal. Vortex the fragmented hydrogel suspension so that microgels are suspended in PBS.\nUsing a 1,000 µL pipette, transfer the fragmented hydrogel suspension onto the membrane filter (0.22 µm). After transferring the entire microgel suspension, wait for ~30 s for the vacuum to pull PBS out of the fragmented hydrogel suspension. Turn off the vacuum line.\n\t\tNOTE: The time that the fragmented hydrogel suspension sits on the membrane filter while pulling vacuum can be varied. See Discussion for more information and troubleshooting suggestions.",
    "Obtain a fresh 3 mL syringe and remove the plunger. Use a metal spatula to scoop the fragmented granular hydrogel from the filter and transfer it into the back of the empty syringe barrel. A pipette tip can be used to assist in transferring the granular hydrogel into the syringe. Return the plunger to the syringe. Load the fragmented granular hydrogel into the syringe, and it is now ready for use.\nimgsrc://cloudfront.jove.com/files/ftp_upload/63867/63867fig04.jpg\nFigure 4: Overview of jamming microgels by vacuum-driven filtration to fabricate tightly-packed fragmented granular hydrogels. The figure depicts (A) placing a membrane filter on the vacuum filtration apparatus, (B) using a pipette to transfer fragmented microgel suspension onto the filter, (C) pulling the vacuum and waiting for microgels to jam and form a granular hydrogel, (D) turning off the vacuum and removing fragmented granular hydrogel using a metal spatula, and (E) using a metal spatula to transfer granular hydrogel to the syringe. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/63867/63867fig04large.jpg]\n5. Extrusion printing with granular hydrogel inks\nNOTE: An overview of the extrusion printing process is shown in Figure 5, including a representative print of a star-shaped construct using fragmented granular hydrogels jammed with vacuum-driven filtration. The printing workflow consists of formulating an ink, planning the print design, and then printing the ink based on the desired design41. If desired, printed granular hydrogel constructs can be stabilized using photocrosslinking post-extrusion by adding excess DTT (5 mM) and I2959 (0.05 wt.%) to the fragmented microgel suspension prior to jamming. This will result in photocrosslinked covalent bonds formed between the microgels, leading to permanent stabilization of the granular hydrogel construct.\nInk formulation",
    "During the planning process, keep in mind the properties of the ink to be used. To characterize the ink, complete the rheological analysis of the fragmented hydrogels to help inform the print design process. Methods describing the rheological characterization of granular hydrogels are described elsewhere and can be adapted for this study40.\nFrom the rheological analysis, select a printing platform and a series of initial print parameters.\n\t\tNOTE: Due to the overall high viscosity and shear-thinning properties of granular hydrogel inks, screw-based extrusion printers are typically used.\nPrint design\n\tNOTE: Repetier Host software (henceforth referred to as 3D printing software) is used for 3D printing applications (steps 5.2-5.3).\n\t\nCreate the print designs through computer-aided design (CAD) software. Users can create novel designs from scratch or modify pre-existing designs, such as from patient tissue scans or from other users. For more information on creating CAD designs, please refer to the following references41,42,43.\nTo process CAD models into G-Code, ensure that the CAD file is saved in \".stl\" format (Supplemental File 1) and uploaded to the 3D printing software by selecting the load button in the top panel or selecting File > Load in the menu bar. This G-code defines the printing path for the deposition of the ink. An example .stl file of a hollow cylinder has been included in the supplemental files.",
    "Once an STL file has been uploaded to the 3D printing software, navigate to the Slicer panel and select Slic3r as the slicer option. Here, settings such as nozzle diameter, layer height, print speed, and extrusion rate can be adjusted based on ink characterization and desired printing outcomes. In this protocol, an 18 G needle (inner diameter of 838 µm) is used. Layer height is set to 1 mm, print speed is set to 8 mm/s, and flow rate is set to 9 µL/s, based on previous optimization39. Numerical values of parameters may be adjusted by ± 20% to account for variations in the properties of granular hydrogel inks.\n\t\tNOTE: It is important to note that these settings and the print design may need to be adjusted through iterative experimental tests, depending on adjustments to the ink formulation, desired print resolution, or printing platform used. For more information on these parameters, as well as on the characterization of print settings with a novel ink formulation, please refer to other references40,44,45,46.\nExtrusion printing with fragmented granular hydrogels\n\t\nFor loading syringes with fragmented granular hydrogels, see 4.2.4, as well as Figure 4 and Figure 5.\nRemove the tip cap and replace it with a needle of choice.\nLoad the syringe into the printing platform of choice. Here, a custom-built screw-based extrusion printer is used.\n\t\tNOTE: For information on building custom bioprinters, please see other references44,47.\nLoad the prepared G-Code file from the planning phase into the 3D printing software. Navigate to the Print Preview panel and press Print.\nAs soon as the printing deposition is complete, expose the fragmented granular hydrogel constructs to UV light for photocrosslinking and stabilization.\nOnce crosslinking is complete, process the sample by washing it in PBS three times.\nimgsrc://cloudfront.jove.com/files/ftp_upload/63867/63867fig05.jpg",
    "Figure 5: Overview of extrusion printing with fragmented granular hydrogels. The figure depicts (A) using a spatula to transfer fragmented granular hydrogel to a syringe barrel, (B) attaching a blunt-tip needle (18 G shown) and pushing the sample to the top, (C) a graphic representing the connection to computer software for printing, and (D) completing the printing of a star-shaped construct with fragmented granular hydrogel. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/63867/63867fig05large.jpg]Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}