{
  "id": 7726,
  "origin_website": "Bio",
  "title": "A Fast and Efficient Decellularization Method for Tissue Slices",
  "procedures": [
    "Sample preparation and OCT embeddingTip: Work near a -80 °C freezer. After tissue retrieval from the animal/patient, place the sample in an appropriate container and keep refrigerated on ice for up to 2 h. For longer periods of time, freeze the sample at -80 °C and remove it from the freezer before OCT embedding until the sample is completely thawed.Choose the appropriate size of cryomold for your sample so that the sample has at least 0.5 cm between the sample and the walls of the cryomold.Place a single drop of OCT compound in the center of the cryomold.With the help of tweezers, position your fresh tissue sample in the center.Note: For some applications, the tissue can also be positioned in a specific orientation in relation to the blade. Cover the whole tissue sample with OCT, without overflowing the cryomold.Tip: Pour the OCT compound without squeezing the tube to avoid air bubbles, which can interfere with cryosectioning. Make sure there is a thick layer of OCT on top of the sample in a way that the surface of the OCT is as smooth as possible. If any bubbles have formed, gently remove them by slowly aspirating with a pipette. Place the cryomold with the sample in the freezer on a flat surface.Tip: Depending on the type of tissue used, the sample will tend to float on the OCT, so it is important to freeze as soon as possible. Note: Other freezing procedures, such as snap freezing with liquid nitrogen, dry ice, liquid nitrogen vapors, or freezing at -20 °C, are also compatible with this protocol. Let the samples freeze overnight.Tissue sectioningSet the appropriate cryostat temperature for the tissue sample to be sliced.",
    "Note: The cryostat temperature will have to be optimized depending on the device used and the tissue to be sliced. In the setup described, the temperature that produces the best tissue sections for lungs and heart is -18 °C to -20 °C, for bladder is -20 °C to -22 °C, and for liver is -15 °C to -18 °C. Place the blade inside the cryostat at least 20 min before use.Withdraw the sample from the freezer and place it inside the cryostat for 30 min before sectioning.Trim the beginning of the cryoblock until reaching the sample.Select the desired thickness.Note: For mechanical testing we suggest 20–30 µm sections, while for tissue staining and imaging we suggest 10 µm. Section the samples.Carefully make contact between the positive area of the glass slide and the tissue section (depending on the size of your sample, you can place 1–3 consecutive tissue sections in one glass slide).Note: For thicker sections (50 µm and higher) consider using a more adhesive glass slide, like Superfrost Gold. Allow the samples to dry at RT for 10–20 min.Store the samples at -80 °C.Tissue section decellularization (10–70 μm sample thickness)Withdraw samples from the freezer and place them on the slide tray (sample side up).Allow samples to thaw at room temperature for 20 min.Trace the edges of the sample with a hydrophobic pen and allow the ink to completely dry for 1 min.Using a Pasteur pipette, cover the sample in PBS 1× for 20 min (RT) to remove the OCT compound. Please note that depending on the tissue size, the volume required to cover the sample could vary from 100 µL to up to 1 mL.Tip: When pouring liquid during decellularization, never pour it directly on top of the sample to avoid damaging or detaching the tissue.",
    "Also avoid adding the liquid as droplets, as that might also create too much turbulence. Instead, approach the tip of the pipette to a nearby bare glass region of the sample and slowly deposit the liquid in a continuous flow. Remove the PBS (and all other incubations throughout the decellularization) by inverting the glass slide over the glass beaker.Warning: Be quick in between washes so as to never let the sample completely dry.Cover the sample in Milli-Q water for 10 min to provoke cell lysis.Remove the Milli-Q water by inversion and repeat step C6.Remove the Milli-Q water by inversion.Cover the sample in SD 2% solution for 15 min.Remove the SD 2% solution by inversion.Cover the sample again in SD 2% solution for 15 min.Remove the SD 2% solution by inversion.Tip: In the following steps, be careful when inverting the glass slide over the glass beaker, as the SD solution with cell remnants is extremely viscous and could damage the sample if done too quickly. Incubate with PBS 1× for 5 min and remove it by inverting the sample.Repeat step C13 three times.With the Pasteur pipette, aspirate and release the solution of DNase to ensure it is homogeneous (and that the DNase does not sink to the bottom).Cover the sample in DNase solution and incubate at RT for 20 min.Remove the DNase by inversion and repeat step C13 three times.Leave the sample in PBS until further staining or testing. Do not allow to dry.Tissue section decellularization (70–100 μm sample thickness)For the decellularization of thicker tissue sections, follow section C with these alterations to the following steps:(Instead of step C2)—Allow samples to thaw at RT for 40 min.(Instead of step C4)—To remove the OCT compound from the sample, cover the sample in PBS 1× and incubate for 30 min.",
    "(Instead of step C16)—Cover the sample in the DNase solution and incubate at 37 °C for 40 min.For short-term storage (<24 h), non-fixed decellularized samples can be left in PBS at 4 °C. For long-term storage (1–10 days), we advise fixing samples in PFA for 15 min, removing the PFA with PBS, and leaving the samples in 50 mL PBS-filled tubes at 4 °C. Do not freeze thin decellularized samples to avoid ice crystal formation and structural damage to the samples.Nuclear staining and mountingNote: Any nuclear stain like DAPI or Hoechst 33342 would work for decellularization quantification. Thaw consecutive tissue sections for 20 min at RT.Trace the edges of the sample with a hydrophobic pen and allow the ink to completely dry for 1 min.Remove the OCT compound from the native sample by covering it in PBS 1× for 20 min.Prepare the Nucblue Hoechst 33342 staining solution according to the manufacturer’s instructions (2 drops per mL of PBS).Cover both the native and decellularized sample in Nucblue solution and protect the slide tray from light.Incubate for 20 min at 80 rpm using an orbital shaker at RT.Remove the Nucblue solution by inversion and wash the samples three times with PBS for 5 min each wash.Note: Keep your samples protected from light as much as possible in between washes. If no opaque slide tray lid is available, aluminum foil paper will suffice. Remove the excess PBS from the glass slide by inversion.Add a drop of fluoromount from the container and place it on top of your samples so as not to touch it directly.Tip: Do this step by using a yellow pipette tip to avoid bubble formation.",
    "With the tweezers, remove the coverslip from the container and very carefully place one edge of the coverslip on one of the sides of the sample. Slowly lower the other edge until it covers the sample. Avoid dropping the coverslip on top of the sample as this will create bubbles on the sample.With nail polish, trace the edges of your coverslip and secure the coverslip to the glass slide.Wait for it to dry and store at 4 °C protected from light.Image acquisition and decellularization quantificationTip: Use a low magnification objective to image as much tissue area as possible (5×–20×). Place the samples at room temperature 30 min before imaging.Clean the glass slides with lint-free paper and ethanol 70%.Image the native tissue sample and set the UV (420 nm) exposure as high as possible without causing pixel saturation (Figure 1B).Acquire 5–10 image sets of phase contrast and UV fluorescence (Figure 1A and 1B).Image decellularized samples using the same exposure settings (Figure 1C and 1D).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4550/bioprotoc-12-22-4550-g001.jpgFigure 1. Representative images of the decellularization of mice bladder (20 µm). Phase contrast images of a native (A) and decellularized (C) 20 µm mice bladder tissue section and corresponding UV images (B and D, respectively). Contrast was increased in phase contrast images for the sake of readability."
  ],
  "subjectAreas": [
    "Biophysics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}