{
  "id": 13338,
  "origin_website": "Jove",
  "title": "In Vitro Assays to Evaluate the Migration, Invasion, and Proliferation of Immortalized Human First-trimester Trophoblast Cell Lines",
  "procedures": [
    "1. Cell Preparation\nMaintain cells in T-75 flasks in standard growth media at 37 °C, 5% CO2, and 95% humidity.\nNOTE: The cells used in these experiments were the immortalized first-trimester trophoblast cell lines Swan.71 (Sw.71) and HTR-8/SVneo9,10. The Sw.71 cells were maintained in DMEM/F-12 supplemented with 10% heat-inactivated fetal bovine serum (FBS), 1.0 mM sodium pyruvate, 10 mM HEPES, 0.10 mM MEM non-essential amino acids, 100 units/mL penicillin, and 100 µg/mL streptomycin. The HTR-8/SVneo cells were maintained in RPMI-1640 supplemented with 5% heat-inactivated FBS.\nAllow the cells to replicate until they reach 90-100% confluence. Using a sterile tissue-culture flow hood, aspirate the media from the flask and wash cells with 10 mL of sterile 1x phosphate-buffered saline (PBS).\nAspirate the PBS and add 5 mL of 1x (0.05%) trypsin-EDTA to the flask, making sure that cells are covered by trypsin. Place flask in the laboratory incubator maintained at 37 °C, 5% CO2, and 95% humidity until all cells have detached from the bottom of the flask (approximately 5-10 min).\nAdd 10 mL of pre-warmed growth media to the flask to deactivate the trypsin-EDTA.\n2. Scratch Assay\nFollowing step 1.4, seed the appropriate number of cells into a 24-well plate to achieve 100% confluence in 48 h.\nNOTE: It is possible to perform the scratch assay with a variety of different plate layouts. The maximum number of wells allowed by the wound maker tool is a 96-well format.\nThe next day (day prior to scratch assay), change media to phenol-red free media supplemented as required, including heat-inactivated, charcoal dextran-stripped FBS.\nNOTE: Other studies have recommended the use of media with low concentration FBS (e.g., 1%) to minimize cell proliferation, which can be used as an alternative in this protocol11.",
    "On the day of the scratch assay, pretreat cells for 30 min by adding desired treatment to the media in each well. The outlined experiments utilized vehicle (1x PBS) and 100 nM dexamethasone diluted in 1x PBS.\nTo create uniform wounds, place sterile 10 µL pipette tips on the pins of the wound maker tool. Lower the tips into the first row of wells and move the plate along the track of the wound maker until the pipette tips reach the other side of the well.\nMove the plate back to the starting position, allowing the pipette tips to continuously touch the bottom of the plate to ensure a constant wound across the diameter of the well. Remove and replace the sterile 10 µL pipette tips and lower the tips into the next row of wells.\nRepeat step 2.4 until all wells are scratched.\nNOTE: If a wound maker tool is not available, wounds can be created by manually scraping the center of the wells with a 10 µL pipette tip.\nCarefully aspirate media and gently wash cells twice with 1x PBS. Following a final wash, add supplemented phenol-red free, stripped or low-FBS media with desired treatment or vehicle (as directed in step 2.3).\nNOTE: HTR-8/SVneo cells should be washed with supplemented phenol-red media, as washing with 1x PBS will cause cells to detach.\nPlace the 24-well plate containing scratched wells in the automated, time-lapse imager (see Table of Materials) housed in a laboratory incubator maintained at 37 °C, 5% CO2, and 95% humidity. Image wells at regular intervals as needed to allow cells to complete wound healing (e.g., every 2 h for 72 h).",
    "Calculate the wound density and width by the software associated with the automated, time-lapse imager (see Table of Materials). To calculate the percentage change in wound size relative to the size of the starting wound, set the wound width at time 0 equal to 100%. Divide the wound size in each subsequent timepoint by the wound size at time 0 and multiply by 100 to obtain the percentage (Figure 1).\n3. Invasion Assay\nFollowing step 1.4, seed the appropriate number of cells into 6-well plates to allow cells to reach 90% confluence in 48 h. Maintain cells in a laboratory incubator set to 37 °C, 5% CO2, and 95% humidity.\nThe next day, change media to phenol-red free media supplemented as required, including heat-inactivated, charcoal dextran-stripped FBS.\nNOTE: Cells can be pretreated at this time depending on experimental design.\nAt this time, place the vial of the 10 mg/mL extracellular matrix (see Table of Materials) on ice, and let it thaw in the refrigerator overnight.\nThe next day, pre-cool invasion assay supplies by placing 24-well plates, cell culture inserts, microcentrifuge tubes, and pipette tips in the refrigerator (4 °C) for at least 2 h prior to working with the extracellular matrix.\nUsing chilled supplies in the tissue culture hood, dilute 10 mg/mL extracellular matrix 1:1 with phenol-red-free, serum-free media to a final concentration of 5 mg/mL.\nNOTE: Always keep the stock and diluted extracellular matrix on ice. The ratio of extracellular matrix to media can be adjusted based on the properties of the cell line used in the assay.",
    "Using chilled supplies in the tissue culture hood, add 100 μL of diluted extracellular matrix to the inserts (see Table of Materials) that have been placed in the 24-well plate. Make sure that the matrix is level without any bubbles. Place the 24-well plate containing matrix-coated inserts in the incubator at 37 °C to allow the matrix to harden.\nTo prep cells for invasion assay, wash cells with 1 mL of 1x PBS, aspirate the PBS, and add 500 µL of 1x trypsin-EDTA to each well. Place the 6-well plate in the laboratory incubator maintained at 37 °C, 5% CO2, and 95% humidity until all cells have detached from the bottom of the plate.\nOnce cells have detached, add 500 µL of phenol-red-free, serum-free media to each well of the trypsinized cells.\nTransfer 1,000 µL of detached cells to microcentrifuge tube and spin down for 5 min at 400 x g at 4 °C.\nAspirate media and resuspend cells in phenol-red-free, serum-free media (volume will depend on concentration of cells). Count cells using an automated cell counter (see Table of Materials) and adjust volume of cell suspension for a final concentration of 5 x 105 cells per mL.\nNOTE: A hemocytometer and microscope may also be used to count cells.\nAdd 600 μL of complete growth media to the wells of the 24-well plate that will be used for the invasion assay.\nNOTE: Additional chemoattractants or treatments may be added to the complete growth medium in the well (lower chamber). The outlined experiments added vehicle (1x PBS) or 100 nM dexamethasone diluted in 1x PBS to the lower chamber.",
    "Place the pre-coated insert into each well containing complete growth medium that will be used for the invasion assay. Then add 200 μL of cells on top of each pre-coated cell insert (upper chamber) for a total of 1 x 105 cells.\nNOTE: As a negative control for this assay, an equal volume of phenol-red-free, serum-free media (without cells) can be added to the upper chamber.\nPlace 24-well plate in the laboratory incubator maintained at 37 °C, 5% CO2, and 95% humidity for 24 h.\nNOTE: The 24 h incubation period was optimized for the immortalized first-trimester trophoblast cells and further tests may be required to determine the required incubation period in other cell lines.\nFollowing overnight incubation, suction the remaining media from the upper and lower chamber without disturbing the extracellular matrix. Then, carefully remove the extracellular matrix and non-invaded cells from the upper portion of the insert with a cotton swab, swabbing as many times as necessary to remove extracellular matrix.\nWash each insert 3x with 1x PBS, adding PBS to both the upper and lower chambers of the well. Aspirate PBS after each wash.\nFix cells attached to the inserts by placing inserts into 100% ice-cold methanol for 30 min at 4 °C. Wash inserts 3x with 1x PBS and remove PBS after the final wash. Stain the cells attached to the inserts for 10 min with 0.2% crystal violet in 20% ethanol.\nRinse 3x with deionized water and aspirate deionized water after the final wash.\nAir-dry inserts for 1 h at room temperature. Using forceps and a razor blade, carefully cut the bottom membrane of the insert and mount on a glass slide with the bottom side facing up. Allow mounting media to dry at room temperature.",
    "Obtain at least 4 unique images of invaded cells per sample using a light microscope with a 20x objective. Count the total number of cells in each image and normalize the number of cells to control samples and plot data (Figure 2).\n4. Proliferation Assay\nFollowing step 1.4, count trypsinized cells from the flask using an automated cell counter and seed into 6-well plates at a density of 2 x 105 cells per well in standard growth media.\nPlace cells in a laboratory incubator maintained at 37 °C, 5% CO2, and 95% humidity for 4 h or until cells have adhered.\nChange media to phenol-red free media supplemented as required, including heat-inactivated, charcoal dextran-stripped FBS and add desired treatment. The outlined experiments added vehicle (1x PBS) or 100 nM dexamethasone diluted in 1x PBS. Place the 6-well plates in a laboratory incubator maintained at 37 °C, 5% CO2, and 95% humidity.\nRemove media and replace with new media and treatment every 48 h.\nAfter 24, 48, or 72 h treatment, wash cells with 1 mL of 1x PBS and add 500 µL of trypsin-EDTA to each well. Place 6-well plate in incubator until cells have detached from plate.\nOnce cells have detached from the plate, add 500 µL of the supplemented phenol-red free media to deactivate trypsin.\nAdd 5 µL of trypsinized cells to 5 µL of Trypan blue in a separate tube and mix by pipetting.\nCount cells from each well in duplicate using an automated cell counter.\nAverage the number of cells per well at each time point and plot as a function of time (Figure 3).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}