{
  "id": 6625,
  "origin_website": "Bio",
  "title": "Imaging the Vasculature of Immunodeficient Mice Using Positron Emission Tomography/Computed Tomography (PET/CT) and 18F-fluorodeoxyglucose Labeled Human Erythrocytes",
  "procedures": [
    "Human red blood cell (RBC) preparationGently pipet 10 cc’s of whole human blood in standard anticoagulant citrate dextrose (ACD) solution (overnight shipping from Zen-Bio, Inc) into a sterile 15 ml conical centrifuge tube with a 10 ml sterile disposable pipet. The original blood sample should have a good quality shown in Figure 1. Blood should be slowly pipetted to minimize mechanical trauma/shear injury to erythrocytes.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190926/20190926014458_6599.jpgFigure 1. Original anti-coagulated blood. The original anti-coagulated blood sample should have no clot and have good fluidity.Centrifuge blood at 1,000 x g (RCF) for 10 min in a desktop centrifuge (no brake) at room temperature.Slowly remove nearly all of the plasma from the red blood cell (RBC) fraction using a 10 ml sterile pipet. The plasma should be close to straw colored or have a slightly reddish tinge as Figure 2. Plasma that has a frankly turbid or significant reddish coloration implies either improper centrifugation or significant pre-existing hemolysis of the original blood sample that may render the sample unsuitable for radiotracer labeling. Slowly transfer 2 ml of pelleted RBCs into a 15 ml conical centrifuge tube using 10 ml sterile pipet. Residual plasma and buffy coat should be avoided during erythrocyte aspiration. Add 8 ml of 1x EDTA solution to RBCs. Close cap on tube and gently invert tube several times to wash cells.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190926/20190926014558_1234.jpgFigure 2. The original blood after first centrifuge step. Ideally, the plasma should be close to straw colored or have a slightly reddish tinge.Centrifuge at 1,000 x g for 10 min at room temperature, then slowly aspirate the supernatant which shown in Figure 3 with a 10 ml sterile pipet. Rapid supernatant aspiration will disturb the supernatant/RBC interface and result in aspiration of RBCs.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190926/20190926014614_3506.jpgFigure 3.",
    "The RBCs after washing with 4x volume of 1x EDTA solutionTransfer 250 µl of RBCs with 1,000 µl pipet tip into 1.8 ml cryovials (Labeled “1” and “2”). Care should be taken to avoid pipetting any residual supernatant.To each RBC cryovial, add 100 µl 5x EDTA solution and 50 µl sterile de-ionized water (total volume = 400 µl) via manual pipette.18F-FDG labeling of human erythrocytesTo maximize the radiolabeling efficiency of human RBCs for in vivo PET imaging of the vasculature of NSGTM immunodeficient mice, the specific activity of USP grade 18F-FDG should be calibrated to at least 20 milliCurie (mCi) per ml at the start of cell labeling. Note: (The Jackson Laboratory, stock number: 005557) has been used, due to its severe immunodeficiency. Other immunodeficient mouse strains have not been tested, but may be feasible as well. Add 100 µl 18F-FDG solution to each RBC cryovial (F.V. = 500 µl) behind appropriate radioactivity shielding. Methods for handling radioactive materials for this protocol should follow those established by the radiation safety officer at your institution. Directly count radioactivity in each cryovial using the AtomLabTM dose calibrator (mCi’s) and record the time. The amount of activity should be at least 1 mCi of FDG in each vial. Ensure the cap is tightly screwed on the cryovial. Care should be taken when choosing an appropriate vial for FDG RBC labeling, as some cryovials are composed of certain plastics that do not maintain a good seal about the cap when exposed to higher temperatures and can result in local radioactivity leakage/contamination. A thin strip of ParafilmTM can be wrapped around the margins of the cap to ensure no radioactivity leakage from the tube and reduce water loss from the cryovial lumen.Gently finger resuspend RBCs.",
    "Place vials in an upright position in a tube rack tied/taped to a rotator platform as Figure 4. Incubate rotating samples in an upright position at 37 °C for 30 min at ≤ 60 RPM. Avoid inverting tube during rotation, as this likely increases the amount of dried cells adherent to the tube wall.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190926/20190926014631_3662.jpgFigure 4. RBCs labeled with 100 µl 18F-FDG solution on rotator platform and placed in an upright position in the 37 °C incubatorCentrifuge RBC samples at 1,000 x g for 10 min (no brake) at 4 °C. The present sample is shown in Figure 5.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190926/20190926014651_5105.jpgFigure 5. The free 18F-FDG fraction (upper clear half of solution) and the precipitated RBCs fraction (red bottom half of solution)Place samples in a ventilated laboratory hood behind appropriate radioactivity shielding and gently transfer the supernatant (about 250 µl) to a 3.5 ml cryovial labeled“SUPE 1 and 2”.Gently resuspend each 250 µl RBCs cell pellet in 1 ml 1x EDTA solution via manual pipette. Care should be taken to resuspend cells slowly to minimize pipet-induced mechanical damage/shear injury to cells. Repeat centrifugation of RBC samples at 1,000 x g for 10 min (no brake) at 4 °C. The centrifuged sample is shown in Figure 6.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190926/20190926014708_4534.jpgFigure 6. Centrifuged 18F-FDG-labeled RBC sample after washing with 1 ml 1x EDTA solutionTransfer 2nd supernatant to an appropriate “SUPE” tube.Gently resuspend 250 µl RBCs cell pellets again in 1 ml 1x EDTA solution, as described above.Repeat centrifugation of RBC samples at 1,000 x g 10 min (no brake) at 4 °C. Transfer supernatant to an appropriate “SUPE” tube. Carefully pipet residual supernatant from the interface with the cell pellet, leaving only a tiny meniscus overlying the pellet. Directly count SUPE and RBC pellet cryovials using AtomLab detector via dose calibrator (µCurie) and record time.",
    "Typical amounts of intracellular radiotracer activity are limited by the total allowable volume of cell solution (250 µl pelleted RBCs) that can be injected into a mouse per day as per our institutional IACUC guidelines, but usually range from ~150 to 300 µCuries, and can be higher depending upon the chosen 18F-FDG specific activity at the start of cell labeling. Gently resuspend the pellet in 250 µl of 1x EDTA solution. The labeling of two RBC samples allows for titration of a larger volume of labeled RBCs, as needed.Transfer the RBC suspension to a 1 ml syringe using a 22 gauge needle. Any residual clumps of cells should not be aspirated, as these likely represent damaged/coagulated cells. Cells should be slowly aspirated into the syringe lumen to minimize mechanical damage/shear injury to cells. The radioactivity in the syringe should be measured before and after animal injection to determine net activity injected in vivo, as there will be residual activity left in the syringe after injection.Small animal PET/CT imagingPrepare 4-6 week-old male splenectomized NODSCIDgamma (NSGTM) immunodeficient mice for experiment.The mouse can be fasted the night before PET/CT imaging to encourage shifting of mouse metabolic activity from glucose to fatty acids, thus minimizing myocardial uptake of any free FDG in the labeled cell preparation. The mouse can also be placed on a very low carbohydrate diet for this purpose as well, as needed. Draw 500 µl of mouse blood through retro-orbital venous plexus puncture, or other approved venous blood draw at your institution, as seen in the example shown in Figure 7. Blood should be collected into heparinized blood collection tube. If the blood is drawn too slowly, there is a risk of significant coagulation occurring, rendering the blood sample unsuitable for FDG labeling.",
    "Measure blood glucose level with a blood glucose monitor for PET calibration.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190926/20190926014724_4250.jpgFigure 7. Example of drawing blood through rat leg veinAnesthetize the mouse via a nosecone manifold under 2-4% inhalational isoflurane. The lowest level of inhalational isoflurane possible is recommended, as isoflurane may induce vasodilation of the mouse vasculature. Record the level of inhalational isoflurane used per mouse.Warm the mouse tail with either a warm soaked towel to stimulate dilation of the mouse tail veins. Insert a tail vein micro-catheter into one of the dilated mouse tail veins. Flush tail vein catheter with 1 U/ml heparin-PBS solution. See example shown in Video 1. <p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Standard microcatheter insertion into mouse/rat tail (This video was made at University of south Florida, according to guidelines from the University of South Florida on Animal Care and approved by the Animal Research Ethics Board of University of South Florida under protocol IS00004376.)Secure the mouse onto the micro-PET/CT scanner bed under 2-4% inhalational isoflurane anesthesia via nose-cone manifold as shown in Figure 8. The animal can be secured to the micro-PET/CT scanner bed by gently wrapping the animal in bubble packaging to minimize animal movement and preserve body warmth. Care must be taken when wrapping the animal, as tight wrapping may impede animal respiratory motion. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190926/20190926014744_7800.jpgFigure 8. Placement of animal in microPET/CT scanner bed for 18F-FDG RBC imaging of the whole body vasculatureSlowly inject 500 µl of FDG-labeled human erythrocyte suspension into the mouse through the tail vein microcatheter over a course of 1 min to minimize shear injury to cells from passage through the microcatheter lumen. See the example shown in Figure 9.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190926/20190926014800_5336.jpgFigure 9. Example of injection of FDG-labeled RBCs through tail vein microcatheterAcquire ECG-gated whole-body images of the mouse, followed by CT calibration images.",
    "PET/CT image acquisition parameters will depend upon the particular experimental indications and unique imaging platform setup at a given institution; as such, the following is a description of the protocol used at our institution. Place electrocardiogram (ECG) leads on two front limbs and one hind limb of the mouse (ground lead on a rear leg) for ECG gated PET imaging. The signals detected by these electrodes are recorded during the 10 minute time period by BioVet® (m2m Imaging) physiological monitoring and heating system. Set the threshold for TTL cardiac gating signals in a rising mode of R-wave peak.Reconstruct the PET list-mode data using 3D-OSEM iterative algorithm with four iterations and eight subsets, with a final image volume of 256 x 256 x 256 voxels. Set effective voxel effective dimensions at 1.4 x 1.4 x 1.4 mm. For each animal there are three data sets: standard 3-dimensional (3D) PET reconstruction, resulting in a motion–time average 3D PET image; dynamic 3D PET reconstruction with 30 frames; and the phase-based 4-dimensional (regular 3-dimensional plus time, 4D) PET cardiac reconstruction, with four cardiac gate binning. Please see Figures 10 and 11. In all cases, CT attenuation correction is applied to the PET images (Choi et al., 2019).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190926/20190926014813_3599.jpgFigure 10. Example for Micro PET acquisition set-upimgsrc:https://en-cdn.bio-protocol.org/attached/image/20190926/20190926014822_8288.jpgFigure 11. Example for Micro CT acquisition set-up using Siemens Inveon platform"
  ],
  "subjectAreas": [
    "Cell Biology",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}