{
  "id": 5110,
  "origin_website": "Bio",
  "title": "Quantification of Chitinase Activity in <em>Fusarium oxysporum</em>",
  "procedures": [
    "Sample preparationF. oxysporum f.sp. lycopersici strains were stored at -80 °C with 30% glycerol as microconidial suspension.For fresh microconidia production, aliquots of frozen microconidial stocks were inoculated into 100 ml of potato dextrose broth (PDB) and incubated for 3 days at 150 rpm and 28 °C in an orbital incubator. Cultures were then filtered through Monodur nylon filters placed on funnels to separate mycelia (Figure 1A), and centrifuged at 3,020 x g for 5 min to collect microconidia. Finally, pellets containing fresh microconidia were resuspended into 1 ml sterile dH2O and counted using a hemocytometer. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160727/20160727015236_1815.jpgFigure 1. Filtration and mycelia harvesting procedure. A. Filtration of a fungal culture through a Monodur nylon membrane placed on a funnel. B. Subsequent harvesting of mycelia by scraping a nylon membrane using a spatula.Aliquots containing 4 x 108 fresh microconidia from each strain were inoculated into 100 ml PDB and incubated in an orbital incubator at 28 °C with shaking at 170 rpm for 14 h (wild type and cΔcon7-1 strains) or 24 h (Δcon7-1 mutant). Note: Conidial germination of Δcon7-1 mutant is significantly delayed compared to the wild type or the cΔcon7-1 strains. To normalize the growth delay of the mutant a longer incubation period was used for this strain.Germlings were harvested by filtration through Monodur nylon membranes (Figure 1A), washed twice with sterile distilled water, scraped from the nylon filter using a spatula (Figure 1B) and directly transferred to 100 ml synthetic medium (SM) containing 0.5% chitin as sole carbon source. After 24 h growth, culture supernatants were filtered (to separate mycelia) and centrifuged (to discard spores) (as described in step A2). Supernatants were used to determine secreted chitinase activity, while mycelia were used for intracellular chitinase activity measurement.",
    "Culture supernatants were introduced into dialysis membranes that were sealed at both ends using plastic clamps, and subsequently submerged into 5 L distilled water for dialysis for 14 h at 4 °C. Note: The dialysis step is necessary to eliminate remaining salts and nutrients from the culture medium.After dialysis, membranes were transferred to a plastic tray, covered with PEG 35,000 powder and incubated at 4 °C until they were concentrated 100-fold (Figure 2). Samples were stored at -20 °C until use.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160727/20160727015643_4419.jpgFigure 2. Concentration of culture supernatants using PEG 35,000Mycelia from step A5 were washed twice with sterile distilled water, frozen at -80 °C and ground with a mortar and pestle under liquid nitrogen. Samples were transferred to Eppendorf tubes containing 1ml phosphate buffer (0.05 M, pH 6.0) and homogenized by vortexing, followed by 2 min incubation at 4 °C. The homogenates were centrifuged 30 min at 10,000 x g and 4 °C, and the supernatants were collected and stored at -20 °C.Quantification of protein contentThe protein content of culture supernatants and mycelia was quantified according to the method of Bradford (Bradford, 1976) using the Bio-Rad protein assay kit with bovine serum albumin as standard. Standard curveDilute Bradford protein assay reagent 1:4 into distilled water.Aliquot 200 µl of diluted Bradford protein assay reagent per well into a microtiter plate. Prepare solutions containing serial dilutions of standard BSA ranging from 0 to 1 µg/ml. Start reaction by adding 5 µl of each standard BSA solution. Make at least two replicates of each standard dilution.Determine Absorbance at 595 nm using a Fluorimeter.Generate a standard curve for a series of BSA concentrations.Sample analysisFollow the directions given in Standard Curve, substituting BSA standard solutions for 5 µl fungal experimental samples.",
    "Please note that the total volume of the experimental sample assays should be equal to that of the BSA standard assays.Calculate the amount of protein in the experimental samples from the standard curve.Enzyme activity determinationEndo- and exochitinase activities were individually quantified by using the Fluorimetric Chitinase Assay Kit following the manufacturer’s instructions. The kit provides three different substrates for the detection of the various types of the chitinolytic activity: 4-Methylumbelliferyl β-D-N,N’ -diacetyl-chitobioside, substrate suitable for exochitinase activity detection (chitobiosidase activity) 4-Methylumbelliferyl N-acetyl-β-D-glucosaminide, substrate suitable for exochitinase activity detection (-N-acetylglucosaminidase activity) 4-Methylumbelliferyl β-D-N,N’,N’’-triacetylchitotriose - substrate suitable for endochitinase activity detectionChitinase activity is expressed as µg of 4-methylumbelliferone released from the substrate per µg of protein. Assays were performed in two independent experiments, each including two replicates.Preparation of solutions (see Recipes 4-8)AssayThe chitinase hydrolysis is performed in an acidic environment (pH ~5.0) at 37 °C. The enzymatic hydrolysis liberates 4-methylumbelliferone (4MU). The fluorescence of liberated 4MU is measured in alkaline pH using a fluorimeter with excitation at 360 nm and emission at 450 nm. In order to quantitate the total chitinolytic activity, separate reactions should be run with the three substrates supplied in the kit. Note that in crude preparations there may be additive/synergist activity of different chitinases (i.e., 4-Methylumbelliferyl N,N’-diacetylchitobioside can be cleaved by β-N-acetylglucosaminidase and also chitobiosidase). It is recommended to perform the assays in duplicates.For each substrate, perform a separate activity assay according to the following instructions of the manufacturer:Equilibrate the substrate working solution(s) and the standard solution(s) to 37 °C by incubating for several minutes in a water bath.Set the fluorimeter at an excitation wavelength of 360 nm and an emission wavelength of 450 nm.Add the reaction components to 96 well plates according to Table 1 and mix by pipetting. Prepare the standard samples first (samples No. 4-8).",
    "Then, prepare the enzyme samples: add the substrate solution to the appropriate wells first and then add the enzyme (positive control or test sample).Table 1.Reaction schemeimgsrc:https://en-cdn.bio-protocol.org/attached/image/20160727/20160727195624_6623.jpg*A Blank reaction (substrate solution without enzyme) should be run to account for the spontaneous hydrolysis of the substrate during the incubation time.Incubate the plate for 30 min at 37 °C. If required, the incubation time for highly active samples can be reduced to 15 min. On the other hand, in order to detect low levels of enzyme activity, the incubation time can be extended to 1 h. Stop the reactions by adding 200 µl of stop solution to each well. Measure the fluorescence at an excitation wavelength of 360 nm and an emission wavelength of 450 nm no later than 30 min after ending the reaction.CalculationUnit definition: One unit of chitinase activity will release 1 mM of 4-methylumbelliferone from the appropriate substrate per minute at pH 5.0 at 37 °C.The chitinase activity can be calculated using a standard curve prepared from the fluorescence readings of the 5 standard solutions (see Table 1).Alternatively, the chitinase activity can be calculated using only a single standard concentration. It is recommended to measure the fluorescence of 100 ng (1.9 nmole/ml) Standard and then use the following equation:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160727/20160727195712_1332.jpgWhere:Fsample = fluorescence of the test sampleFblank = fluorescence of the Blank (containing only substrate working solution)0.3 = final reaction volume in milliliters after addition of the stop solutionDF = enzyme dilution factorFstandard = fluorescence of the standard solution minus the fluorescence of the Standard BlankTime = minVenz = volume of the sample in milliliterFinally refer the resulting activity to the amount of protein calculated for each sample in previous steps."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}