{
  "id": 9696,
  "origin_website": "Jove",
  "title": "Chromatin Immunoprecipitation from Dorsal Root Ganglia Tissue following Axonal Injury",
  "procedures": [
    "1. Sciatic & dorsal column nerve injury\nThe animal is placed on a surgical towel and underneath it a thermopad is present throughout the procedure keeping the body temperature of the mouse at 37°C. All animals are anesthetized for surgery with a continuous isoflurane/O2 administration. Surgical instruments are autoclaved before the procedure.\nFor sciatic injury, both hindquarters are carefully shaved, and depilation is completed with generic hair remover prior to cleansing skin with alcohol followed by Betadyne 3 times.\nThe sciatic nerve is exposed by making a 4 mm incision posterior and parallel to the femur at mid-thigh through the skin and by spreading the muscles apart of the biceps femoris with fine forceps. \nThe exposed sciatic nerve is then injured , and the skin is closed with two suture clips. \nNOTE: The same incision is made to expose the sciatic nerve, but the wound is sutured closed leaving the nerve intact for the sham injury.\nFor dorsal column injury, the back of the mouse is carefully shaved, and depilation is completed with generic hair remover prior to cleansing the skin with alcohol spray/swipe. \nThe spinal cord is exposed by making a 2.5 cm incision from about T7 to T13. The skin is spread apart, and the connective tissue is removed along the vertebra from T9 to T11. \nA laminectomy is performed at T10 level\nNOTE: For most experiments, the laminectomy is considered the Sham injury.\nA few drops of Xylocain  are added to the tissue to anaesthetize the cord, and the dura mater is removed, paying attention not to touch the spinal cord.",
    "The dorsal columns are injured and the muscle is sutured close, again paying attention not to touch the spinal cord. Finally, the skin is sutured closed with suture clips. Buprenorphine (0.1 mg/kg body weight) should be administered twice daily for 48 hours or until no longer needed.\n2. Cross-linking\nDissect L4 and L5 DRG from injured mice after euthanization. Collect a total of 16 DRG into ice-cold HBSS + protease inhibitors cocktail (2 injured and 2 sham DRG from each animal for a total of 4 animals).\nBriefly centrifuge the DRG, then carefully remove the HBSS and add 500 μl of 1% formaldehyde in PBS + protease inhibitors cocktail and incubate the sample for 30 minutes at 37°C.\nCRITICAL STEP. Use fresh, molecular biology grade formaldehyde.\nAdd 125 mM of glycine to stop the fixation and incubate for 5 minutes at room temperature.\nBriefly centrifuge, aspirate off buffer, and wash the tissue twice with 500 μl ice-cold PBS + protease inhibitors cocktail.\n3. Nuclei preparation and chromatin shearing\nAspirate off PBS, add 400 μl of SDS lysis buffer, transfer to a pre-chilled microcentrifuge tube, and disrupt the tissue with approximately 30 strokes with the micropestle.\nCRITICAL STEP. Lysis and disruption of the tissue are vital for a good yield of crosslinked chromatin.\nSonicate the sample with 8 pulses, 10 second each at 70% output (Bandelin, Sonoplus GM70).\nCAUTION. The shearing of the chromatin must be optimized for your particular sonication set up and proper fragmentation of the chromatin should be checked before running the actual IP experiment (see section 3).",
    "NOTE. Fragmentation of the chromatin could also be performed by micrococcal nuclease (MNase) digestion. As a rule of thumb, fragmentation by sonication is preferred for fixed tissue, while MNase digestion is favored for native tissue chromatin immunoprecipitation. Cross-linked, sheared chromatin can be stored at -80° C for up to 2 months, but avoid repeated freeze/thaw cycles.\n4. Analysis of chromatin digestion (recommended)\nRemove 10 μl of your sheared chromatin sample for analysis. Add 200 mM of NaCl to the sample and reverse the cross-link by incubating at 65° C for 2h.\nPurify DNA (see section 8) and run a 1% agarose gel. DNA should be fragmented to a length of approximately 200-1000 bp (Figure 1).\nCAUTION. Over-fragmentation of chromatin may lead to decreased signal, while incomplete fragmentation will lead to diminished resolution and increased background.\n5. Immunoprecipitation\nDetermine the number of immunoprecipitation reactions (see NOTE below), and divide samples equally into new tubes. Bring the volume of each up to 500 μl with ChIP buffer + protease inhibitors cocktail.\nRemove 5 μl of your diluted sample and transfer into a new tube. This is your 1% input sample and it will be stored at -20° C until needed (Section 7).\nFor each immunoprecipitation, add appropriate antibody or normal IgG control and incubate at 4°C overnight with rotation.\nNOTE. When determining the number of immunoprecipitation, a positive control (e.g. Histone H3 antibody) and a negative control (Normal IgG) should be considered. The quantity of antibody used for each IP varies between antibodies and must be empirically determined. However, it is usually within a range of 2-10 ?g/immunoprecipitation.\nTo immunoprecipitate your antibody/protein/DNA complex, add 30 μl of ChIP Grade Protein G Magnetic Beads and incubate for 2 h at 4°C with rotation.\n6. Washing",
    "To pull-down bound chromatin-bead complex, place the tube on the magnetic rack. Wait until the solution is clear and then carefully remove your supernatant.\nAdd 1 ml of low salt wash (ChIP buffer) to the beads and incubate at 4°C for 3-5 minutes with rotation, then pull-down beads and aspirate off wash as in step 6.1. Repeat this step for a total of 3 washes.\nAdd 1 ml of high salt wash buffer (ChIP buffer+ 350 mM NaCl) to the beads and incubate for 3-5 minutes with rotation, then pull-down beads and aspirate off wash as in step 6.1. \n7. Elution and reversal of cross-linking\nTake your input samples out of the -20°C, add 150 μl of ChIP Elution buffer and set aside at room temperature until Step 7.5.\nAdd 150 μl of 1x ChIP Elution buffer for each IP sample from Step 6.3.\nPlace the tubes in a thermomixer and elute the chromatin from the beads by incubating samples at 65°C for 30 minutes with gentle vortexing.\nPull-down beads on the magnetic rack, and carefully transfer the eluted chromatin (supernatant) into new tubes.\nTo all tubes, including your input samples, add 200mM of NaCl and 40 μg/reaction of Proteinase K and incubate at 65°C for 2 hours.\nNOTE. The elution step can be performed at room temperature, too, but it might be not as efficient.\n8. DNA recovery\nAdd 1 volume of Phenol/Chloroform to your samples from Step 7.5 and vortex for 30 seconds.\nCentrifuge at maximum speed in a microcentrifuge at room-temperature for 5 minutes.\nCarefully recover the aqueous (upper) phase into new tubes, add 1 volume of chloroform to the aqueous phase, and vortex for 30 seconds.\nCentrifuge at maximum speed in a microcentrifuge at room-temperature for 5 minutes.",
    "Carefully recover the aqueous (upper) phase into new tubes, then add 300mM of NaOAc, 20 μg/reaction of glycogen, and 2.5 volumes of ice-cold 100% ethanol.\nCAUTION. The addition of a carrier, such as the glycogen, is needed to enhance the precipitation of relatively small sized DNA fragments.\nIncubate at -80°C for 2 hours to precipitate DNA.\nNOTE. The precipitation step can also be performed overnight at -20°C.\nCentrifuge the samples at maximum speed in a microcentrifuge for 20 minutes at 4°C.\nCarefully remove the supernatant and wash the precipitated DNA pellets with 300 μl of ice-cold 70% ethanol.\nCentrifuge the samples at maximum speed in a microcentrifuge for 10 minutes at 4°C.\nCarefully remove as much supernatant as possible and let the pellets air-dry. \nResuspend in 20 μl of sterile H2O. Samples are now ready for PCR, or the DNA can be stored at -20°C.\n9. Representative Results\nA representative result of a ChIP experiment in DRGs following sciatic lesion is shown (Figures 1 and 2). First, we show \nfragmented DNA to a length of approximately 200-1000 bp (Figure 1). Second, we demonstrate a PCR signal following ChIP from the proximal promoter \nof the growth associated protein-43 (GAP-43) only upon sciatic nerve injury (lane 4, Figure 2, 5'). No PCR signal is present when the animal \nreceives a sham injury only (lane 3), and when using normal IgG serum for the IP (lane 5 and 6). To test for the specificity of the antibody, \nwe analyzed the same DNA samples, but used a control primer set which detects a region in the 3'-UTR of our gene of interest where no occupancy is \nexpected. PCR signals are absent from all lanes (lanes 3-6, Figure 2, 3'), except for the input signal, representing non-IP DNA samples as standard",
    "PCR controls (lane 1-2, Figure 2). This ChIP procedure can be performed following either sciatic or spinal dorsal column injury as summarized in \na schematic (Figure 3).\nimgsrc://cloudfront.jove.com/files/ftp_upload/2803/2803fig1.jpg\nFigure 1. Agarose gel of reversed cross-linked DNA that has been sheared by sonication to the proper range of fragment lengths.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2803/2803fig2.jpg\nFigure 2. Semi-quantitative PCR results from DRG tissue following sciatic nerve lesion showing that acetylated p53 binds to the GAP-43 proximal promoter region 48 hours after injury to the sciatic nerve. Control PCR from the same DRG tissue show that acetylated p53 does not bind to a control region of DNA located in the 3’-untranslated region (UTR) of the GAP-43 gene (S = Sham, I = Injured).\nimgsrc://cloudfront.jove.com/files/ftp_upload/2803/2803fig3.jpg\nFigure 3. A general diagram showing  the location of the lesion sites on the sciatic nerve, and the dorsal column.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}