{
  "id": 1652,
  "origin_website": "Cell",
  "title": "Generation and validation of CRISPR-engineered human natural killer cell lines for research and therapeutic applications",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nLentivirus production\nTiming: 5 days\nOn day 1, coat a 150 mm culture dish with ∼3–5 mL of poly-L lysine solution (0.01%) by gently swirling to ensure even coating of the plate surface. Aspirate the solution and let the coated plate dry for 15 min at RT.\nAspirate the cell culture media from Lenti-X 293T HEK cells grown in a 150 mm culture dish, wash these cells with PBS, add 2 mL of 1X Trypsin solution to the plate. Gently swirl the plate to evenly cover the whole surface area and incubate the plate for 1 min at 37°C. Detach the cells by gently tapping the plate and inactivate the Trypsin enzyme by adding 10 mL of complete DMEM media. Spin them down at 350 × g for 5 min.\nResuspend the cells in 10 mL of complete DMEM media, count the cells, and seed 7–10 × 106 Lenti-X 293T HEK cells on the poly-L lysine-coated 150 mm plate. Make up the total cell culture media volume to 20 mL by adding complete DMEM media, gently swirl the plate so that cells are uniformly seeded and incubate them at 37°C.\nOn day 2, take two 15 mL tubes, add 4 mL of plain DMEM media (media without FBS and PS and containing only 1X GlutaMAX (glutamine), non-essential amino acids and sodium pyruvate) in each tube. In the first tube, add 20 μg of the plasmid containing the gene of interest (here, Lenti-Cas9-EGFP or dCas9-VP64-GFP or dCas9-KRAB-GFP), 20 μg of packaging plasmid (psPAX2), and 5 μg of envelope plasmid (pMD.2G). In the second tube, add 80 μL of lipofectamine 2000. Incubate both tubes at RT for 5 min.\nCritical: Use plain DMEM i.e. serum-free DMEM, as serum inhibits transfection.",
    "Mix lipofectamine-containing media with media containing the lentiviral vectors by gentle swirling or inverting and incubate the mix for 20 min at RT.\nAfter incubation, aspirate the culture media from Lenti-X 293T HEK cells and add the lipofectamine and plasmid mix to these cells in a dropwise fashion over the entire plate. Make up the total media volume to 15 mL by including additional 7 mL of plain DMEM to Lenti-X293T HEK cells. Gently swirl the plate and incubate at 37°C for 3 h.\nAfter incubation, add 15 mL complete FBS-containing DMEM media to the plate, making the total media volume to 30 mL. Incubate overnight (12–16 h) at 37°C.\nOn day 3, aspirate the 30 mL of media from culture dish and add 20 mL of fresh complete DMEM media containing 400 μL of 500 mM sodium butyrate. Then, incubate for 5 h at 37°C to enhance the lentiviral production. After sodium butyrate induction, discard the media, replenish the cells with 16 mL fresh complete DMEM media, and incubate at 37°C for 24 h.\nOn day 4, filter the media containing lentivirus using a sterile disposable vacuum filter unit (0.45 μm).\nAlternatives: Clarification of media can also be done with centrifugation (400 × g for 5 min).\nConcentrate lentivirus by adding 4 mL of lenti-X concentrator to 16 mL of viral supernatant, mixing well by pipetting, and incubating overnight (12–16 h) at 4°C.\nOn day 5, centrifuge the mix at 1500 × g for 45 min, 4°C. After centrifugation, an off-white pellet will form at the bottom of centrifugation tube, without disturbing the pellet, aspirate the supernatant by suction using a glass Pasteur pipette. Finally, resuspend the off-white pellet in 1 mL of complete RPMI media.",
    "Designing and cloning single guide RNAs (sgRNAs) for CRISPR-mediated gene editing and transcriptional modulation\nTiming: ∼ 2 days\nOligo design for sgRNA production. Go to https://portals.broadinstitute.org/gppx/crispick/public[href=https://portals.broadinstitute.org/gppx/crispick/public] Broad institute web portal (Doench et al., 2016[href=https://www.wicell.org#bib8]) .\nSelect the reference genome (here, Human GRCh37) and then select the mechanism of CRISPR editing (CRISPRko or CRISPRa or CRISPRi). Enzyme will be SpyoCas9.\nSelect quick look up in the target section and enter the target gene I.D. (e.g., IL2RG for IL2Rγ).\nEnter the value in CRISPICK Quota box (this value represents how many sgRNA per gene will be designed) and submit.\nDownload the results by selecting picking result file (tab-limited text file).\nOpen the file in excel, this file contains the summary statistics for on- and off-target scores by pick order. Choose the guide RNA sequence-based on pick order rank (choose minimum 2–5 sgRNAs per gene). Also check the orientation of the sgRNA (sense or antisense).\nDesign the reverse complement of the sgRNA sequence.\nAdd the following overhang to the sgRNA sequence which will facilitate its ligation to linearized ipUSEPR plasmid\nForward oligo: 5′ CACCG…guide RNA 3′\nReverse oligo: 5′ AAAC…guide RNA…C 3′\nOrder the oligos from Integrated DNA Technologies (IDT) Inc.\nAnnealing. Thaw and spin down the oligo vial at 300 × g for 2 min at RT and reconstitute the oligos in nuclease-free water to make a 100 μM stock (the amount of water added into the oligo vial to make the 100 μM stock = 10X number of nanomoles of oligo).\nMix 10 μL of the forward oligo (100 μM) + 10 μL of the reverse oligo in a PCR tube and spin down at 300 × g for 2 min. Use a thermocycler to anneal forward and reverse oligos:\n95°C 10 min × 1 cycle",
    "Ramp down temperature from 95°C to 25°C, decrease rate = 0.5°C /1min × 140 cycles (total time = 140 min)\nHold at 4°C.\nTake 1 μL of annealed oligo from step 18, add into 2 mL of ddH2O to reach a final dilution of 1/2000. These diluted oligos will be used as the insert for ligation.\nLinearizing ipUSEPR plasmid for ligation\nTiming: ∼ 1.5 days\nDigestion of ipUSEPR plasmid. Prepare the digestion mixture in 0.6 mL microtubes as follows:\ntable:files/protocols_protocol_1115_9.csv\nIncubate the mixture overnight (12–16 h) at 55°C in a heat block.\nIsolate the linearized plasmid by electrophoresis (0.8% agarose gel, 120 V for 2 h) followed by gel extraction.\nAdd 80 μL of 6X loading dye into 400 μL BsmbI digestion and load 50 μL in each well (Marker: NEB# N0552S, Gel loading dye: NEB# B7025S).\nGel extraction (GeneJET Gel Extraction kit # K0691):\nWeigh empty Eppendorf tubes and clip the expected band from gel into Eppendorf tubes.\nPurify the linearized ipUSEPR plasmid as per manufacturer’s instructions and after elution, measure DNA concentration using a NanoDropTM One spectrophotometer and store the linearized plasmid at −20°C.\nLigation\nTiming: ∼ 14 h\nPrepare ligation mixture in 0.2 mL PCR tubes as follows:\ntable:files/protocols_protocol_1115_10.csv\nCritical: Do not forget to prepare a separate control tube which contains 3.6 μl of H2O instead of the diluted oligo.\nLigate using a thermocycler using following conditions:\n25°C 1 h × 1 cycle\n16°C 12 h × 1 cycle\n4°C hold\nStore ligation product at −20°C until transformation\nTransformation (NEB-5 alpha competent E. coli# C2987U)\nTiming: ∼ 18 h\nThaw NEB 5-alpha competent E. coli cells on ice (50 μL/tube), and bring Ampicillin plates to RT.",
    "Take 10 μL of competent cells and mix it with 6 μL of the ligated product in a 0.6 mL microtube and then, incubate on ice for 30 min.\nHeat shock at 42°C for 30s in a heat block and put back on ice for 5 min.\nAdd 180 μL of SOC medium and grow the bacteria at 37°C in a shaker incubator for 1 h.\nSpread all the medium onto the Ampicillin plate evenly and incubate the plates upside down at 37°C.\nAfter 12–16 h, store the plates at 4°C until miniprep.\nMiniprep (GeneJET Plasmid Miniprep Kit # K0502)\nTiming: ∼ 18 h\nPrepare 4 mL TB with Ampicillin in a 14 mL tube, pick a single colony with the help of a pipette tip from the bacterial plate into each tube, and shake overnight (12–16 h) at 37°C.\nTake 1.8 mL bacteria into a 2 mL tube, and centrifuge at 11000 × g for 30s at RT to pellet down the bacteria.\nPrepare the miniprep of plasmid DNA as per manufacturer’s instructions[href=https://www.thermofisher.com/order/catalog/product/K0502].\nIn the final elution step, use 50 μL of elution buffer to elute the plasmid DNA from the column and measure concentration of the plasmid and store at −20°C.\nSend 8 μL of 100–200 ng/μL DNA and 5 μL of 5 μM hU6 primer: “GAGGGCCTATTTCCCATGAT” per sample to Eton Biosciences[href=https://www.etonbio.com/] for sequencing to confirm the sgRNA sequence.\nMaxiprep (NucleoBond Xtra Maxi Plus EF # 740426.50)\nTiming: ∼ 1.5 days\nTake 4 mL of TB medium in a 14 mL tube and inoculate with a single colony picked from ampicillin plate. Incubate at 37°C in a shaker incubator at 250 RPM for 5–6 h.",
    "Add ∼1 mL of the inoculated media to 250 mL of TB media and grow the culture overnight (12–16 h) at 37°C in a shaker incubator at 250 RPM.\nHarvest bacterial cells by centrifuging at 6000 × g for 15 min at 4°C. Then discard the supernatant.\nIsolate the plasmid DNA as per manufacturer’s instructions. In the final elution step, use 400 μL of elution buffer to elute plasmid DNA from NucleoBond finalizer (provided in the kit).\nMeasure plasmid DNA concentration and store at −20°C.\nSignificance of genetically manipulating natural killer cells using CRISPR\nNatural killer (NK) cells are innate immune cells that protect against viral infections (Strauss-Albee and Blish, 2016[href=https://www.wicell.org#bib25]) and development of cancers (Cerwenka and Lanier, 2001[href=https://www.wicell.org#bib4]). NK cell-mediated immune surveillance is defective in infections and cancers for various reasons including NK cell exhaustion, defective homeostasis, and impaired NK cytotoxicity (Duault et al., 2021[href=https://www.wicell.org#bib9]; Wilk et al., 2021[href=https://www.wicell.org#bib33]). Our overall goal is to develop therapeutic NK cells which are functional and evade exhaustion through CRISPR-based genetic manipulation. To this end, we manipulated NK-92 cells , one of the platforms for NK therapies in clinical trials (Klingemann et al., 2016[href=https://www.wicell.org#bib14]), using CRISPRko/Cas9 for knockout (Jinek et al., 2012[href=https://www.wicell.org#bib13]), CRISPRi/dCas9-KRAB for transcriptional repression (Gilbert et al., 2013[href=https://www.wicell.org#bib10]), and CRISPRa/dCas9-VP64 for transcriptional activation (Chavez et al., 2015[href=https://www.wicell.org#bib5]) of genes that promote NK cytotoxicity and reduce NK exhaustion.\nBelow, we detail the protocols for generation of each of these multifunctional CRISPR-based NK cell platforms.\nGenerating Cas9+ NK-92 cells (CRISPRko NK-92 platform)\nTiming: ∼ 7 weeks",
    "Count NK-92 cells, resuspend ∼0.5–1.5 × 106 cells in 500 μL of complete RPMI media, and add 500 μL of concentrated Cas9-EGFP lentivirus (concentrated from 16 mL of lentiviral supernatant to 1 mL using lenti-X concentrator). Now the total volume will be 1 mL; to this, add polybrene (10 μg/mL) and rhIL-2 (100 U/mL). Seed these cells in a 24-well plate (1.5 × 106/mL/well) and incubate at 37°C for 48 h.\nOn day 2, wash the cells with complete RPMI media, and replenish the NK-92 cells with NK cell media (RPMI media + rhIL-2). Pipette a small aliquot of the transduced cells (∼100 μL) into a 1.7 mL tube to measure percentages of EGFP+ Cas9-transduced NK-92 cells by flow cytometry (Figure 1[href=https://www.wicell.org#fig1]A upper panel).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1115-Fig1.jpg\nFigure 1. Generation and validation of Cas9+ NK-92 cell line\n(A and B) Flow cytometry dot plots showing (A) frequencies of Cas9-EGFP+ NK-92 cells on days 2 (upper panel) and 11 (lower panel) after transduction with CAS9-EGFP lentivirus, and (B) purity of Cas9-EGFP-transduced NK-92 cells immediately after sorting (day 0) and after expanding the sorted cells for 10 days.\n(C) Histogram overlays comparing untransduced and Cas9-EGFP-transduced NK-92 cells for changes in CFSE-Violet fluorescence with respect to the day the cells were labeled with CFSE (day 0).\n(D) Flow cytometry dot plots of Cas9-EGFP+ NK-92 single cell clones expanded by limiting dilution method.\n(E) Representative flow cytometry dot plots showing frequencies of sgRNA-RFP+Cas9-EGFP+ NK-92 cells after transduction of clone-5 of Cas9-EGFP+ NK-92 cells with either control sgRNA-RFP or RFP sgRNA-RFP to knockout RFP.\n(F) Specific cytotoxicities of untransduced NK-92, polyclonal, and monoclonal (clone-5) dCas9-EGFP+ NK-92 cells. Error bars represent mean ± SEM of three technical replicates.",
    "(G and H) Graph showing fold change in frequencies of sgRNA-RFP+Cas9-EGFP+ NK-92 cells with respect to day 1 after transduction with control sgRNA-RFP or IL-2RG sgRNA1-RFP or IL-2RG sgRNA2-RFP targeting IL2Rγ chain.\nCritical: Because all NK cells including NK-92 are generally difficult to transduce, we obtained a transduction efficiency of only 1.32% after transducing NK-92 cells with Cas9 (Figure 1[href=https://www.wicell.org#fig1]A upper panel).\nExpand the Cas9-transduced NK-92 cells for the next 8–10 days by changing the NK cell media and re-plating the cells on every third day. Then, pipette a small aliquot of cells (∼0.5–1 × 106) and stain them with DAPI and check the percentages of DAPI−Cas9-EGFP+ viable cells (Figure 1[href=https://www.wicell.org#fig1]A lower panel). This step is to ensure that transduction with Cas9 does not reduce the viability of NK-92 cells. We observed that NK cell viability was similar in untransduced and Cas9-transduced NK-92 cells (Figure 1[href=https://www.wicell.org#fig1]A).\nCritical: If the transduction efficiency is low, then it will be difficult to sort the transduced cells using FACS. In case of transduction efficiencies lower than 1%, expand cells for 1–2 weeks and transduce them again with an additional 500 μl of concentrated virus to increase the frequencies of transduced cells.\nAfter expansion, stain the cells with DAPI and sort DAPI−EGFP+ cells. Check the post-sort purity by flow cytometry (Figure 1[href=https://www.wicell.org#fig1]B, Day 0). Expand the sorted cells as described below:\nCount the sorted cells and seed ∼ 0.5–1 × 105 cells/well in a 96-well flat bottom plate.\nExpand these cells in NK media at 37°C. When cells become confluent (media color changes to light yellow), spin down the cells (300 × g at RT for 5 min) and aspirate the media.\nResuspend the cells in fresh 500 μL NK cell media and culture them in a 48 well plate at 37°C.",
    "Wait until the cells become confluent, spin down, aspirate the media and transfer these cells to T-25 flask containing 5 mL of fresh NK cell media.\nAfter expansion of NK-92 cells in a T-25 flask for 3 days, once again conduct flow cytometry to ensure that only EGFP+ cells are expanding (Figure 1[href=https://www.wicell.org#fig1]B, Day 10). Please note that cells from a single well of 96-well plate will be transferred to single well of 48-well plate and then to a T-25 flask.\nCompare the proliferation potential of transduced NK-92 cells with that of untransduced NK-92 cells to ensure that transduction with Cas9 does not reduce NK-92 cell proliferation:\nReconstitute a vial of CFSE-violet dye (Thermo Scientific# C34557) in DMSO and add 20 μL of DMSO in the vial to make a 5 mM stock.\nSpin down the untransduced and Cas9-transduced NK-92 cells (300 × g for 5 min at RT). Aspirate the culture media and resuspend the cells in PBS. Adjust the cell count to 1 × 106 NK-92 cells/mL in a 15 mL tube. Add 0.5 μL/mL of CFSE-violet dye and incubate these cells for 20 min at 37°C in the dark.\nAfter incubation, add at least 5 times the original staining volume of complete RPMI media and incubate for 5 min at 37°C.\nCentrifuge the cells (300 × g for 5 min), discard the media, and wash the cells again with complete RPMI media.\nAdjust the cell count to 1 × 106 NK-92 cells/mL in NK cell media and seed 200 μL in 96-well flat-bottom plate (0.2 × 106 cells/well).\nIncubate the cells for 96 h at 37°C and then analyze using flow cytometry for CFSE dilution (Figure 1[href=https://www.wicell.org#fig1]C).",
    "Analyze the data using FlowJo software and note down the median fluorescence intensity (MFI) values for CFSE and calculate the proliferation score (PS) using formula PS = Log2 (MFICFSE day 0/MFICFSE day 4) (Ahlen et al., 2009[href=https://www.wicell.org#bib1]). We found a less than 2-fold difference in the PS of untransduced NK-92 cells (PS=4.4) and Cas9+ NK-92 cells (PS=3.5), suggesting that transduction with Cas9 did not abrogate or markedly impair NK-92 cell proliferation.\nSingle cell isolation using limiting dilution technique:\nCount Cas9-EGFP+ NK-92 cells using a hemocytometer and adjust the cell count to 5 × 103 cells/mL.\nThe final cell counts to seed a 96-well plate will be 5 cells/mL, and to achieve this count, mix 50 μL of 5 × 103 cells/mL solution with 49.95 mL of NK cell media.\nTransfer 100 μL of 5 cells/mL solution to each well of 96-well round-bottom plates and incubate at 37°C. Carefully monitor these cells over a period of two weeks. When single-cell clumps have grown in size, remove these cells from 96-well plates using a 1 mL pipette, wash, and transfer to 48-well culture plate in NK cell media (500 μL/well).\nAfter three days of culture in 48-well plate, analyze percentages of Cas9-EGFP+ NK-92 cells in each clone using flow cytometry (Figure 1[href=https://www.wicell.org#fig1]D) and culture the cells in a T-25 flask in NK cell media.\nCritical: Accurately adjusting the cell count to 5 cells/mL and seeding 100 μl of this mix per well is most important step in the single NK cell expansion protocol. This minimizes the likelihood of seeding more than 1 cell/well. This step also prevents the expansion of untransduced EGFP− NK-92 cells in the culture.",
    "Alternative method for single cell isolation: Flow cytometry-based sorting of single cell clones. However, sorting is not preferred because it is stressful for sensitive cells such as, human NK cells.\nSelecting cytotoxic Cas9+ NK-92 single-cell clones for CRISPRko editing\nTiming: ∼ 2 weeks\nCas9+ NK-92 cells single cell clones were first evaluated for CRISPR editing efficiency by using a puromycin-tagged sgRNA that targets and knocks out the RFP present in the ipUSEPR sgRNA cloning plasmid, as described below:\nTo transduce single cell clones:\nResuspend each single cell clone (here, clone-1 to -5, Figure 1[href=https://www.wicell.org#fig1]D) in 1000 μL complete RPMI media (1 × 106 cells/clone) in 1.7 mL microtubes.\nDivide single cell suspension from each clone into two parts and transfer into 1.7 mL microtubes.\nTo one portion, add 500 μL control sgRNA lentivirus and to other half add 500 μL lentivirus harboring sgRNA targeting RFP of ipUSEPR plasmid.\nNow the total volume in each tube will be 1 mL, to this, add polybrene (10 μg/mL) and rhIL-2 (100 U/mL). Seed these cells in 24-well plate (0.5 × 106/well) and incubate at 37°C for 48 h.\nOn day 2, analyze frequencies of sgRNA-transduced RFP+ cells by flow cytometry. Resuspend the remaining cells in 2 mL complete RPMI media containing rhIL-2 (100 U/mL) and puromycin (1 μg/mL) (Figure 1[href=https://www.wicell.org#fig1]E, left panels).\nAfter selecting transduced cells using puromycin for ∼10 days, we found that clone-5 showed the best CRISPR editing efficiency with percentages of RFP+ cells reducing from 11.9% at day 2 to 0.46% at day 10 after puromycin selection (Figure 1[href=https://www.wicell.org#fig1]E). Note that procedures for design and cloning of sgRNAs and production of sgRNA lentiviruses have been described previously (steps 1–43).",
    "Critical: Before knocking out genes of interest in Cas9-transduced NK-92 single cell clones, one must confirm that constitutive expression of Cas9 does not impair the normal function (i.e. the cytotoxicity) of NK-92 cells.\nWe therefore compared the cytotoxic function of untransduced, bulk (polyclonal), and single cell Cas9-transduced NK-92 cells using a flow cytometry-based NK cytotoxicity assay. In this assay, we measured the ability of untransduced and Cas9+ NK-92 cells to kill the standard NK-sensitive target human erythroleukemia cell line, K-562. Among the Cas9+ NK-92 single cell clones, only clone-5 was utilized for the NK cytotoxicity/functionality assay because it was found to have the highest gene editing efficiency (Figure 1[href=https://www.wicell.org#fig1]E). Below, we describe the procedure to conduct the NK cytotoxicity assay:\nTo distinguish NK-92 effector cells from target K-562 cells, label K-562 cells with CFSE using the procedure below:\nReconstitute a vial of CFSE-violet dye (Thermo Scientific# C34557) by adding 20 μL DMSO in the vial to make a 5 mM stock.\nSpin down K-562 cells (300 × g for 5 min at RT), resuspend the cell pellet in PBS in a 15 mL tube and adjust the cell count to 1 × 106 K-562 cells/mL. Add 0.5 μL/mL of CFSE-violet dye and incubate these cells for 20 min at 37°C in dark.\nAfter incubation, add at least 5 times the original staining volume of complete RPMI-1640 media (RPMI-1640 + 10% FBS) and incubate for 5 min at 37°C.\nCentrifuge the cells at 300 × g for 5 min at RT, discard the media, and wash the cells again with 5 mL of complete RPMI media before using them in cytotoxicity assays.",
    "Count NK-92 effector and K-562 target cells. Pipette mix these cells at different effector to target ratios in a U bottom 96-well plate in 200 μL complete RPMI media. Centrifuge the plate at 300 × g for 5 min at RT and incubate for 5 h at 37°C.\nCritical: Don’t forget to include a control group that contains only CFSE labeled K-562 target cells to measure spontaneous cell death of the target in the absence of NK effector cells.\nAfter incubation, add 3 μL of 7-AAD (50 μg/mL) in each well and mix by pipetting. Incubate the plate for 10 min at RT followed by transferring of cells into FACS tubes and analyze the cells by flow cytometry (Figure 1[href=https://www.wicell.org#fig1]F). We calculate the specific cytotoxicity using the formula: [(7-AAD+ target-cell frequency in coculture with effector cells − 7-AAD+ target-cell frequency alone) / (100 − 7-AAD+ target-cell frequency alone)] × 100.\nValidating gene knockout in Cas9+ NK-92 cells\nTiming: ∼ 10 days\nAs NK-92 cells are dependent on the cytokines IL-2 and IL-15 for their survival, knockout of the IL2R, to which these cytokines bind, should lead to the death of NK-92 cells (Carson et al., 1997[href=https://www.wicell.org#bib3]; Törnroos et al., 2019[href=https://www.wicell.org#bib29]). Therefore, we knocked out a required signaling component of the IL2R, the IL2Rγ chain (Waickman et al., 2016[href=https://www.wicell.org#bib31]) to validate the successful generation of Cas9+ NK-92 cells.\nThe procedures for designing and cloning IL2Rγ sgRNA, and that for producing IL2Rγ sgRNA lentiviruses have been described earlier.\nTo validate IL2Rγ gene knockout in Cas9+ NK-92 cells:\nCount Cas9-EGFP+ NK-92 cells, resuspend 1 × 106 cells in 1000 μL of complete RPMI media.\nDivide the cell suspension into two equal parts and transfer to 1.7 mL microtubes.\nAdd 500 μL of concentrated lentivirus for control sgRNA or sgRNA targeting the IL2Rγ chain.",
    "Now the total volume in each tube will be 1 mL. To these tubes, add polybrene (10 μg/mL) and rhIL-2 (100 U/mL).\nSeed these cells in a 24-well plate (0.5 × 106 cells/well) and incubate at 37°C for 48 h. Refer to “Single guide RNA (sg) target sequences table[href=https://www.wicell.org#undtbl7]” in materials and equipment[href=https://www.wicell.org#materials-and-equipment] section for sequences of control or IL-2RG sgRNA used for CRISPRko.\nOn day 2, wash the cells with complete RPMI media, resuspend the cells in 2 mL of media containing rhIL-2 (100 U/mL), and seed them in 24-well plate. Before seeding, take a small aliquot of cells to determine the frequencies of transduced cells by flow cytometry.\nOn day 2 after sgRNA transduction, monitor the levels of IL2Rγ chain on transduced NK-92 cells by flow cytometry (Figures 1[href=https://www.wicell.org#fig1]G and 1H). Successful IL2R knockout is confirmed by the reduction in percentages of IL2Rγ sgRNA-RFP+ Cas9-EGFP+ cells over time as these cells fail to respond to IL-2 present in the culture medium. However, frequencies of control sgRNA-RFP+ Cas9-EGFP+ NK-92 cells do not reduce with time (Figures 1[href=https://www.wicell.org#fig1]G and 1H), confirming that the transduction procedure itself doesn’t kill NK cells.\nGenerating dCas9-KRAB+ NK-92 cells (CRISPRi NK-92 platform)\nTiming: ∼ 7 weeks\nThe CRISPRi system employs a catalytically dead Cas9 (dCas9) without endonuclease activity fused to the KRAB transcriptional repressor (Qi et al., 2013[href=https://www.wicell.org#bib18]). Specific sgRNAs allow the recruitment and binding of the dCas9-KRAB transcriptional repressor to target genes (Gilbert et al., 2013[href=https://www.wicell.org#bib10]). The dCas9-KRAB-mediated transcriptional repression of genes is an alternative approach to the Cas9-mediated CRISPRko system. The dCas9-KRAB system mitigates the risk of off-target effects and exogenous DNA integration caused by the active Cas9 nuclease in the CRISPRko system (Tycko et al., 2019[href=https://www.wicell.org#bib30]; Hanlon et al., 2019[href=https://www.wicell.org#bib11]; Saayman et al., 2016[href=https://www.wicell.org#bib22]).",
    "Below, we detail the protocol for generating and validating NK-92 cells that constitutively express the dCas9-KRAB for CRISPRi-mediated transcriptional repression.\nAs with the generation of Cas9+ NK-92 cells, resuspend ∼0.5–1.5 × 106 cells in 500 μL complete RPMI media + 500 μL concentrated dCas9-KRAB-GFP lentivirus + polybrene (10 μg/mL) + rhIL-2 (100 U/mL). Seed these cells in 24-well plate and incubate 37°C for 48 h.\nAfter incubation, wash and resuspend in complete RPMI media supplemented with rhIL-2. Analyze percentages of dCas9-KRAB-GFP-transduced NK-92 cells using flow cytometry. Expand these cells to get enough cells for sorting with intermittent flow cytometry analysis of cells for GFP positivity (Figure 2[href=https://www.wicell.org#fig2]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1115-Fig2.jpg\nFigure 2. Generation and validation of dCas9-KRAB+ NK-92 cell line\n(A and B) Flow cytometry dot plots showing (A) frequencies of dCas9-KRAB-GFP+ NK-92 cells on days 2, 3, 8, and 22 after transduction with dCas9-KRAB-GFP lentivirus, and (B) purity of dCas9-KRAB-GFP-transduced NK-92 cells immediately after sorting (day 0) and after expanding the sorted cells for 10 days.\n(C) Histogram overlays comparing untransduced and dCas9-KRAB-GFP-transduced NK-92 cells for changes in CFSE-Violet fluorescence with respect to the day the cells were labeled with CFSE (day 0).\n(D) Flow cytometry dot plots of dCas9-KRAB-GFP+ NK-92 single cell clones expanded by limiting dilution method.\n(E) Specific cytotoxicities of untransduced NK-92, polyclonal, and monoclonal (clones 1 to 5) dCas9-KRAB-GFP+ NK-92 cells. Error bars represent mean ± SEM of three technical replicates.\n(F−G) Graphs showing fold change in frequencies of sgRNA-RFP+dCas9-KRAB-GFP+ NK-92 cells with respect to day 1 after transduction with control sgRNA-RFP or IL-2RG sgRNA1-RFP or IL-2RG sgRNA2-RFP targeting IL2Rγ chain.\nStain the cells with DAPI and sort DAPI−GFP+ cells, check post sort purity (Figure 2[href=https://www.wicell.org#fig2]B).",
    "Analyze proliferation potential (Figure 2[href=https://www.wicell.org#fig2]C) and calculate the proliferation score (PS) as described previously (step 48) for Cas9+ NK-92 cells. We found PS of dCas9-KRAB+ NK-92 cells to be 5.4 which is less than 2-fold different from that of untransduced NK-92 cells (PS = 4.4). The comparable PS of untransduced and dCas9-KRAB+ NK-92 cells suggest that constitutive expression of the dCas9-KRAB protein in NK-92 cells for CRISPRi does not abolish or markedly impair their natural proliferation.\nIsolate single cell clones (Figure 2[href=https://www.wicell.org#fig2]D) using the limiting dilution technique as described previously (step 49).\nSelecting cytotoxic dCas9-KRAB+ NK-92 single-cell clones for CRISPRi editing\nTiming: ∼ 6 h\nBecause the dCas9-KRAB system uses catalytically dead Cas9 without endonuclease activity, we did not use the sgRNA targeting RFP that we previously used to measure Cas9 editing efficiency. Instead, we screened all dCas9-KRAB+ NK-92 single cell clones that had expanded in culture for NK cytotoxicity by flow cytometry as described below.\nUsing a flow cytometry-based NK cytotoxicity assay (as described in steps 53–55), we measured the ability of untransduced and dCas9-KRAB+ NK-92 cells to kill the standard NK-sensitive target human erythroleukemia cell line, K-562, as described earlier.\nAmong the Cas9-KRAB+ NK-92 single cell clones, only clone-1 showed the highest cytotoxic activity against K-562 cells (Figure 2[href=https://www.wicell.org#fig2]E). Therefore, only this clone was utilized for validation of the dCas9-KRAB system.\nValidating transcriptional repression in dCas9-KRAB+ NK-92 cells\nTiming: 15 days",
    "We validated transcriptional repression in dCas9-KRAB in NK-92 cells using the same validation strategy as that described in Cas9+ NK-92 cells, i.e., blocking the expression of the IL2Rγ chain required for NK-92 cell proliferation and survival, and examining the effects of this blockade on NK-92 cell turnover. The procedures for designing and cloning IL2Rγ sgRNAs, and that for producing IL2Rγ sgRNA lentiviruses have been described earlier (steps 1–43). Also, the procedure for sgRNA lentiviral transduction of dCas9-KRAB+ NK-92 cells is identical to that outlined for Cas9+ NK-92 cells (step 44). Starting on day 2 after transduction, we serially monitored the levels of IL2Rγ chain on transduced NK-92 cells by flow cytometry (Figures 2[href=https://www.wicell.org#fig2]F and 2G). Successful IL2R knockout is confirmed by the reduction in percentages of IL2Rγ sgRNA-RFP+ dCas9-KRAB-GFP+ cells over time as these cells fail to respond to IL-2 present in the culture medium.\nGenerating dCas9-VP64+ NK-92 cells (CRISPRa NK-92 platform)\nTiming: ∼ 7 weeks",
    "The CRISPRa system employs a catalytically dead Cas9 (dCas9) without endonuclease activity fused to the VP64 transcriptional activator (Qi et al., 2013[href=https://www.wicell.org#bib18]). Specific sgRNAs allow the recruitment and binding of the dCas9-VP64 transcriptional activator to target genes (Gilbert et al., 2013[href=https://www.wicell.org#bib10]). Like the dCas9-KRAB system, the dCas9-VP64 system has reduced risk of off-target effects and exogenous DNA integration unlike the CRISPRko system (Tycko et al., 2019[href=https://www.wicell.org#bib30]; Hanlon et al., 2019[href=https://www.wicell.org#bib11]; Saayman et al., 2016[href=https://www.wicell.org#bib22]). The CRISPRa approach to transcriptionally activate genes in human NK cells is superior to conventional lentiviral overexpression for two reasons: First, it is easier to introduce ∼20 nt single guide (sgRNAs) to simultaneously transcriptionally activate multiple genes by CRISPRa as opposed to sequentially transducing NK cells with large lentiviral overexpression vectors encoding the large open reading frame of each gene. Second, because transcript levels increase by ∼3-5-fold in CRISPRa as opposed to >20-fold in conventional overexpression systems, cellular toxicity caused by excessive production of proteins can be avoided in CRISPRa.\nBelow, we detail the protocol for generating and validating NK-92 cells that constitutively express the dCas9-VP64 for CRISPRa-mediated transcriptional activation.\nAs with the generation of Cas9+ and dCAS9-KRAB+ NK-92 cells, count NK-92 cells, resuspend ∼0.5–1.5 × 106 cells in 500 μL of complete RPMI media in a 1.7 mL microtube, and add 500 μL of concentrated dCas9-VP64-GFP lentivirus. Now the total volume will be 1 mL. To this, add polybrene (10 μg/mL) and rhIL-2 (100 U/mL). Seed these cells in a 24-well plate and incubate at 37°C for 48 h.",
    "On day 2, wash and then replenish the cells with complete RPMI media + rhIL2 (100 U/mL). Take a small aliquot of cells to measure the percentages of GFP+ dCas9-VP64-transduced NK-92 cells using flow cytometry. We found that the percentages of dCas9-VP64-transduced NK-92 cells were 14.8% at day 2 and 14.5% at day 11 after expansion (Figure 3[href=https://www.wicell.org#fig3]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1115-Fig3.jpg\nFigure 3. Generation and validation of dCas9-VP64+ NK-92 cell line\n(A and B) Flow cytometry dot plots showing (A) frequencies of dCas9-VP64-GFP+ NK-92 cells on days 2 (upper panel) and 11 (lower panel) after transduction with dCas9-VP64-GFP lentivirus, and (B) purity of dCas9-VP64-GFP-transduced NK-92 cells immediately after sorting (day 0) and after expanding the sorted cells for 10 days.\n(C) Histogram overlays comparing untransduced and dCas9-VP64-GFP-transduced NK-92 cells for changes in CFSE-Violet fluorescence with respect to the day the cells were labeled with CFSE (day 0).\n(D) Flow cytometry of dCas9-VP64-GFP+ NK-92 single cell clones expanded by limiting dilution method.\n(E) Specific cytotoxicities of untransduced NK-92, polyclonal, and monoclonal (clone-3) dCas9-VP64-GFP+ NK-92 cells. Error bars represent mean ± SEM of three technical replicates.\n(F) Flow cytometry dot plots showing the percentages of dCas9-VP64-GFP+ NK-92 cells transduced with control sgRNA-RFP or IL-15 sgRNA-RFP on days 2 (upper panel) and 15 (lower panel) after transduction and puromycin selection.\n(G) Fold change in IL-15 mRNA expression levels by qPCR in sgRNA-RFP+ dCas9-VP64-GFP+ NK-92 cells on day 15 after being transduced with control sgRNA-RFP or IL-15 sgRNA-RFP. Error bars represent mean ± SEM of three technical replicates, Exact p-value was calculated by Student's t-test.",
    "Stain the cells with DAPI and sort DAPI−GFP+ NK-92 cells by FACS. Check the post-sort purity by flow cytometry. We found that post-sort purities of dCas9-VP64-GFP+ NK-92 cells were 99.8% at day 0 and 96.9% at day 10 after expansion (Figure 3[href=https://www.wicell.org#fig3]B).\nCompare the proliferation of dCas9-VP64+ NK-92 cells and that of untransduced NK-92 cells (Figure 3[href=https://www.wicell.org#fig3]C) by measuring the proliferation score (PS) using the formula previously described (step 48) for Cas9+ and dCAS9-KRAB+ NK-92 cells. We found PS of dCas9-VP64+ NK-92 cells to be 3.4 which is less than 2-fold different from that of untransduced NK-92 cells (PS=4.4). The comparable PS of untransduced and dCas9-VP64+ NK-92 cells suggest that constitutive expression of the dCas9-VP64 protein in NK-92 cells for CRISPRa does not abolish or markedly impair their natural proliferation.\nIsolate the single cell clones of dCas9-VP64+ NK-92 cells (Figure 3[href=https://www.wicell.org#fig3]D) using the limiting dilution procedure previously described (step 49) for Cas9+ and dCas9-KRAB+ NK-92 cells in Figures 1[href=https://www.wicell.org#fig1]D and 2[href=https://www.wicell.org#fig2]D.\nSelecting cytotoxic dCas9-VP64+ NK-92 single-cell clones for CRISPRa editing\nTiming: ∼ 6 h\nBecause the dCas9-VP64 system uses catalytically dead Cas9 without endonuclease activity, we did not use the sgRNA targeting RFP that we previously used to measure Cas9 editing efficiency. Instead, we directly screened dCas9-VP64+ NK-92 single cell clones that had expanded in culture for NK cytotoxicity by flow cytometry. Of note, all dCas9-VP64+ NK-92 cells except clone-3 had contamination from GFP negative (dCas9-VP64−) NK-92 cells (Figure 3[href=https://www.wicell.org#fig3]D). Therefore, the cytotoxicity assay was performed only using clone-3 of dCas9-VP64+ NK-92 cells (Figure 3[href=https://www.wicell.org#fig3]E). The procedure for performing cytotoxicity assays is similar to that described earlier (steps 53–55) for Cas9+ and dCas9-KRAB+ NK-92 cells.\nValidating transcriptional activation in dCas9-VP64+ NK-92 cells\nTiming: ∼ 2–4 weeks",
    "To validate dCas9-VP64+ NK-92 cells, we transcriptionally activated the IL-15 gene which is required for not just survival and proliferation but also the cytotoxic function of NK cells (Cooper et al., 2002[href=https://www.wicell.org#bib7]; Zhang et al., 2018[href=https://www.wicell.org#bib36]). Alternately, one could transcriptionally activate IL-2.\nThe procedures for designing and cloning IL-15 sgRNA, and that for producing IL2Rγ sgRNA lentiviruses have been described earlier.\nTo validate transcriptional activation of IL-15 gene in dCas9-VP64+ NK-92 cells:\nResuspend 1 × 106 dCas9-VP64-GFP+ NK-92 cells in 1000 μL of complete RPMI media in 1.7 mL microtube.\nDivide the cell suspension into two parts and transfer to 1.7 mL microtubes.\nAdd 500 μL of concentrated lentivirus for control sgRNA-RFP or IL-15 sgRNA-RFP targeting the IL-15 gene.\nNow the total volume in each tube will be 1 mL. To these tubes, add polybrene (10 μg/mL) and rhIL-2 (100 U/mL).\nSeed these cells in a 24-well plate (0.5 × 106 cells/well) and incubate at 37°C for 48 h. See “Single guide RNA (sg) target sequences[href=https://www.wicell.org#undtbl7]” table in materials and equipment[href=https://www.wicell.org#materials-and-equipment] section for sequences of control sgRNA or IL-15 sgRNA used for CRISPRa.\nOn day 2, before puromycin selection, take a small aliquot of transduced cells and analyze the frequencies of dCas9-VP64-GFP+ sgRNA-RFP+ transduced cells by flow cytometry (Figure 3[href=https://www.wicell.org#fig3]F upper panel).\nResuspend the remaining cells in NK cell media containing puromycin (1 μg/mL) and select these cells in puromycin for ∼ 2–4 weeks until frequencies of dCas9-VP64-GFP+ sgRNA-RFP+ cells in the control sgRNA and IL-15 sgRNA groups reaches >95% (Figure 3[href=https://www.wicell.org#fig3]F lower panel).\nAlternative Method: The time period of puromycin selection may be prolonged and/or selection may be difficult if the gene modulated negatively impacts NK cell turnover. For such sgRNAs, we recommend flow-based sorting of dCas9-VP64-GFP + sgRNA-RFP+ NK cells.",
    "Proceed with RNA isolation (NucleoSpin RNA purification kit # 740955.250), cDNA synthesis (SuperScript IV First Strand Synthesis System # 18091050) and quantitate the mRNA expression of IL-15 in cells transduced with control sgRNA or IL-15 sgRNA by quantitative real-time PCR (Figure 3[href=https://www.wicell.org#fig3]G)."
  ],
  "subjectAreas": [
    "Immunology",
    "Crispr",
    "Cancer",
    "Cell Biology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}