{
  "id": 5510,
  "origin_website": "Bio",
  "title": "Relative Stiffness Measurements of Tumour Tissues by Shear Rheology",
  "procedures": [
    "This protocol describes the biomechanical interrogation of tissue samples, which can be obtained from a variety of sources. Here, we utilise the 4T1/BALB/c syngeneic orthotopic model of murine mammary carcinoma (Miller and Heppner, 1979; Cox et al., 2013; Cox et al., 2015), and a subcutaneous SW480/Nude model of human colorectal cancer which has been engineered to overexpress the matrix cross-linking enzyme lysyl oxidase (LOX) (Baker et al., 2011; Baker et al., 2013). High LOX expression in primary tumours has been shown to cross-link extracellular matrix components, in particular collagens, leading to increases in tensile strength of the tissues (Levental et al., 2009; Baker et al., 2011; Baker et al., 2013). Tumour tissue can be collected from any source, including Genetically Engineered Mouse Models (GEMMS), spontaneous models of cancer, as well as orthotopic and subcutaneous models of cancer (see Note 1). Whilst we demonstrate the approach with both a human colorectal cancer model and murine breast cancer model, any solid tumour tissue, including patient material, could be used providing tissue samples meet the following criteria:A.The tissue must be easily accessible for intact surgical resection.B.The tissue can be processed fresh immediately (see Notes 2-4).C.A minimum biopsy size of 8 mm in diameter and ≥ 1 mm thick can be obtained.D.Samples can be measured immediately (see Notes 2-4).Measuring relative stiffness of tumour tissuesRheological characterization was performed on all tumour samples using a TA Instruments DHR-2 controlled strain rotational rheometer fitted with an 8 mm sand-blasted parallel plate upper geometry, and an 8 mm sand-blasted lower stepped geometry (Figure 1A). Table 1 below outlines the testing parameters that we have determined to be optimal for measuring tumour tissue using a Discovery Series Hybrid rheometer (TA Instruments, model: DHR-2) under the conditions described (see Notes 5-7).Table 1. Rheometer settingstable:\n﻿0,1\nParameter,Value\nTemperature (°C),21",
    "Temperature soak time (sec),0\nOscillation frequency (rad/sec),1.0\nOscillation strain (%),0.2-2.0\nData points per decade,15\nControlled strain type,Continuous Oscillation [direct strain]\nAxial force (N),0.03-0.05\nConditioning time (sec),2.0\nSampling time (sec),3.0",
    "Tumour implantation 4T1 and SW480 cell lines were maintained in DMEM/10% FBS/Pen-Strep at 37 °C and 5% CO2.Aspirate the growth medium from the cells and wash the cells once briefly with PBS.Aspirate the PBS, and add trypsin-EDTA (0.25%) enough to just cover the cells. Once the cells have detached, centrifuge at 300 x g for 5 min and resuspend in normal growth medium and count the cells.Wash the cells in PBS, then remove cell clusters by passing through a cell strainer (70 µm). Clean and sterilize the inoculation area of the mice with ethanol. Mix the cells and draw the cells into a syringe without a needle. Place a 27 G needle on the syringe and make sure to remove any air and bubbles. Inject 100 µl tumour cells into the anatomical location of interest (see Note 8).Following implantation, regular monitoring of the animals as per institutional guidelines is required, and tumour size and body weight is measured three times a week (see Note 9). Experimental setupStartup and calibrate the rheometer according to manufacturer’s guidelines.Attach the stepped lower geometry to the heated peltier plate (Figure 1A) (arrow).Attach the 8 mm diameter upper geometry (Figure 1A) (arrowhead).Set the peltier temperature to the required temperature (Table 1).Surgically excise the tumour tissue to be measured (see Notes 2, 3, 4 and 10). Figures 1B-1D show a primary orthotopic fatpad-implanted 4T1 mammary carcinoma tumour at 3 weeks post implantation being excised. When measured externally using calipers the tumour measures approximately 520 mm3, which is sufficient to allow an 8 mm diameter tissue sample to be collected (see conditions above under Procedures). A ≥ 1 mm thick section is cut from the region of interest for measurement (Figures 1E and 1F).",
    "The remaining tissue not used for rheology can be used for additional analysis including RNA/DNA/protein extraction, or fixed/frozen and processed for immunohistochemistry/immunofluorescence (see Note 11).Using an 8 mm disposable biopsy punch, a circular biopsy is cut and extraneous material is removed (Figure 1G).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170427/20170427200303_9890.jpgFigure 1. Rheology set-up. A. 8 mm sand-blasted lower stepped geometry (arrow), peltier plate and 8 mm sand-blasted upper geometry (arrowhead); B. Primary orthotopic 4T1 tumour (circled) at 3-week post-implantation into the mammary fatpad of a BALB/c mouse; C and D. Post-mortem surgical excision of the whole tumour (arrowhead) from the fatpad (E and F). A ≥ 1 mm section is cut using a scalpel from the region of interest in the tumour (see Notes 2-4). G. Using an 8 mm disposable biopsy punch, a circular biopsy is cut and extraneous material is removed. H. The tissue sample is then placed on the lower geometry (arrow) and the upper geometry (arrowhead) lowered so that it comes into contact with the sample. The gap between the upper geometry (arrowhead) and lower geometry (arrow) is slowly reduced until a stable axial force (see Table 1) is achieved and the measurement commences. I. Representative example of measurements taken from 4T1 mammary carcinoma tumours at 3 weeks post implantation compared to normal mammary fat pad tissue bearing no tumour. The storage modulus is measured over one decade of strain from 0.2 to 2% (left). The right-hand graph represents the storage modulus at 1% strain showing that tumour tissue is significantly stiffer than healthy control tissue. µ represents the mean storage modulus (G’) ± standard deviation. J. Representative example of how over-expression of lysyl oxidase (LOX), a potent extracellular matrix cross-linker, leads to increases in the stiffness of tumour tissue in a human colorectal cancer model.",
    "The storage modulus (G’) of tumour tissue is measured 4 weeks after implantation subcutaneously (left). The right-hand graph represents the storage modulus at 1% strain, and illustrates that over-expression of LOX in tumour cells leads to stiffening of their environment. µ represents the mean storage modulus (G’) ± standard deviation.Zero the axial force on the rheometer. Carefully transfer the tumour tissue to the lower geometry (arrow) using a flat-ended spatula.Move the 8 mm upper geometry (arrowhead) down until it just contacts the top surface of the tissue (Figure 1H).Decrease the gap by 50 µm increments to increase the axial force applied to the tissue and continue until a stable axial force is reached as detailed in Table 1 (see Note 7).Set an oscillation strain sweep as per Table 1.Set an oscillation frequency as per Table 1.Begin measurement.Analysis of the relative stiffnessEnsure a linear viscoelastic response [storage modulus (G’)] within the strain range evaluated (Figures 1I and 1J) (see Notes 6 and 12).Extract the storage modulus (G’) at a matched strain between samples (example here is 1% strain) when comparing multiple tissue measurements (Figures 1I and 1J). If required, the elastic moduli (E) can be determined from the storage modulus (G’) using: E = 2 x G’ (1 + υ) where, υ = Poisson’s ratio of 0.5 for most tissues."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}