{
  "id": 3221,
  "origin_website": "Cell",
  "title": "Breast cancer PDxO cultures for drug discovery and functional precision oncology",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPart I\nPreparation of PDxOs from PDX tissue\nTiming: 3–4 h\n      To establish PDxO lines from PDX, tumors are ideally harvested before they\n      become overly necrotic. Tumor removal should be performed under aseptical\n      conditions as described in Guillen et al.1[href=https://www.wicell.org#bib1]\n      and DeRose et al.2[href=https://www.wicell.org#bib3] Established breast\n      cancer PDX HCI lines can also be obtained from the Preclinical Research\n      Resources (PRR) core at the Huntsman Cancer Institute, University of Utah,\n      also refer to “before you begin[href=https://www.wicell.org#before-you-begin]” section.\n    \nNote: We culture organoids on 6-well\n      tissue culture plates, with only one PDxO line per plate to avoid\n      cross-contamination; all volumes in this protocol are provided for 6-well\n      plates.\n    \nNote: In rare cases where more tissue\n      input is required (>100 mg of PDX tissue), our previously published\n      tissue digestion protocol may be utilized to prepare PDxOs for\n      culture.2[href=https://www.wicell.org#bib3] However, the GentleMACS tissue\n      digestion method detailed here generally results in higher viability and\n      better outgrowth.\n    \n        Harvest PDX tumor under aseptic conditions.\n        \n            Add 5 mL of warm advanced DMEM/F12 media to 10 cm tissue culture\n            plate.\n          \n            Transfer PDX tumor tissue to plate (Figure 1[href=https://www.wicell.org#fig1]).\n            \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2790-Fig1.jpg\n                  Figure 1. PDxO preparation from PDX tumor tissue\n                \n                  (A–C) To establish PDxOs from PDX tumors, necrotic tissue\n                  areas are removed and healthy tumor tissue is cut into\n                  3 × 3 mm fragments. Tumor fragments are then transferred into\n                  a C tube and digested in a GentleMACS Dissociator using human\n                  dissociation enzymes. The digested material is assessed under\n                  the microscope, and processed depending on the contents and\n                  structure: (A) If the digested material contains a mixture of\n                  organoids and single cells, differential centrifucation (DC)\n                  is performed to remove single cells, then the organoids are\n                  embedded into a Matrigel dome. (B) If the digested material\n                  contains only organoids, the material is embedded immediately.",
    "(C) For digestions containing only single cells, aggregation\n                  for 16 h on Ultra Low Attachment (ULA) plates is recommended\n                  prior to embedding. Scale bars represents 5 mm (left) or\n                  500 μm (right).\n                \n        Place the plate on ice and keep cold for all following steps.\n        \n            To keep the dish from moving on the ice, a paper towel can be placed\n            directly onto the ice underneath the dish.\n          \n        Remove necrotic area from tumor:\n        \n            Using two scapels, cut the tumor in half and look for white (=\n            necrotic) areas.\n            \n                Use the example in Figure 1[href=https://www.wicell.org#fig1] as a reference.\n              \nCarefully remove the white areas from the tissue and discard.\nNote: Necrotic tissue can be distinguished\n      from the healthy tumor area by color and in some cases by texture.\n      Necrotic areas in breast cancer PDX are white compared to the beige/yellow\n      color of healthy tumor tissue. Necrotic tissue can present as softer\n      areas, however we have also experienced examples with comparable stiffness\n      between necrotic and healthy areas.\n    \nCritical: Removing parts of the tissue\n      that are likely necrotic increases yield and the probability of successful\n      organoid outgrowth.\n    \nChop PDX tumor into 3 × 3 mm fragments in the dish using scapels.\nAdd 5 mL warm advanced DMEM/F12 medium to GentleMACS C-tube.\n        Add reconstituted Gentle MACS human tumor dissociation enzymes to\n        C-tube:\n        \n200 μL Enzyme H.\n100 μL Enzyme R.\n25 μL Enzyme A.\nAdd 5 μL Y-27632 (10 nM working concentration).\n        Using a cell lifter, transfer 10 PDX tumor fragments to C-tube without\n        transfering the media.\n      \nNote: The protocol works for both fresh\n      and frozen tumor fragments.\n    \nNote: If cryopreserved PDX tissue is used,\n      thaw and wash tumor fragments: Thaw the vial of tumor fragments in a 37°C\n      water bath. Transfer fragments to 10-cm tissue culture plate. Aspirate",
    "freezing media and wash once with 5 mL advanced DMEM/F12, then aspirate\n      medium and transfer fragments to C-tube.\n    \nNote: Freeze remaining PDX tissue as\n      3 × 3 mm fragments following Guillen et al.,1[href=https://www.wicell.org#bib1]\n      DeRose et al.2[href=https://www.wicell.org#bib3]\nCritical: Processing multiple\n      fragments from diverse regions of a PDX tumor helps eliminate bias towards\n      clonal populations that are potentially present regionally within a PDX\n      tumor.\n    \nClose C-tube cap tightly.\n        To dissociate tissue, place C-tube onto GentleMACS Dissociator according\n        to manufacturer’s instructions.\n        \nPlace octoheaters over C-tube.\nRun GentleMACS program “37C_h_TDK_3”.\nPause point: GentleMACS program\n      37C_h_TDK_3 will run for 1 h 10 min.\n    \nRemove C-tube from GentleMACS.\n        Centrifuge (3 min, 300 × g, 20°C) to pellet digested tissue.\n        Carefully aspirate supernatant.\n      \nCritical: Be careful not to aspirate\n      the pellet. Organoid pellets have a looser pack than a cell pellet. We\n      recommend to aspirate the supernatant by adding a p200 tip (without\n      filter) to the tip of the aspirating pipet. This creates a smaller opening\n      through which the supernatant will be aspirated, resulting in slower\n      aspirating speed and allowing for more precise handling.\n    \nOptional: If the pellet contains large\n      amounts of red blood cells (the pellet will be visibly red by eye), treat\n      digested material with TAC buffer to lyse red blood cells. Resuspend\n      pellet in 10 mL TAC buffer. Incubate for 10 min in 37°C water bath. Shake\n      gently every 2–3 min. Centrifuge (3 min, 300 × g, 20°C). Once is\n      generally sufficient but repeat if red blood cells are still present.\n    \nCritical: TAC buffer can be stored at\n      20°C for up to 6 months.\n    \nResuspend pellet in 5 mL warm PDxO base medium.\n        Using a 20 μL pipette, place a 5 μL drop of digested material on\n        hemocytometer without cover glass.\n      \nEvaluate contents of digested material under microscope.",
    "Evaluate organoid size, health, and presence of single cells and debris.\n        Troubleshooting 1[href=https://www.wicell.org#sec6.1].\n      \nCritical: Never use a p10 pipette when\n      pipetting organoids. The small bore of the tips can damage organoid\n      structure, or can exclude larger organoids from being pipetted.\n    \n        To remove larger debris and fat, strain through a 200–500 μm cell\n        strainer depending on organoid and debris size.\n      \nWash C-tube and strainer with 10 mL PDxO medium.\nTransfer flowthrough into a 15 mL conical tube.\nCentrifuge (3 min, 300 × g, 20°C).\nResuspend pellet in 5 mL warm PDxO base medium.\n        Repeat, lowering the pore size of the strainer each time, until most\n        debris and fat has been eliminated.\n      \nCritical: To avoid losing organoids\n      while straining out debris, never use a strainer with a pore\n      size < 200 μm. Instead, repeated strains at 200–300 μm should be used\n      if substantial debris is still present.\n    \nNote: Contents and structure of digested\n      material can vary and will determine the next steps.\n    \n        Place a 5 μL drop of digested material on the hemocytometer without\n        cover glass and evaluate contents under the microscope.\n        Troubleshooting 2[href=https://www.wicell.org#sec6.3].\n      \n        Determine which option (a-c, Figure 1[href=https://www.wicell.org#fig1]) best\n        describes the digested material and proceed accordingly:\n        \n            Organoids + single cells: Proceed carefully with differential\n            centrifugation (DC) of digested material prior to embedding\n            (proceed with step 24) (Figure 2[href=https://www.wicell.org#fig2]).\n            \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2790-Fig2.jpg\n                  Figure 2. Differential centrifugation of PDxO preparation that\n                  contain single cells and organoids\n                \n                  For organoid preparations that contain organoids DC is\n                  performed to separate organoids from single cells. The\n                  organoid preparation is resuspended in 15 mL of media and a\n                  series of quick spins is performed, started with a 1 min\n                  centrifugation. The resulting supernatant is discarded, while\n                  the pellet is resuspended and spun again at s shorter time (40\n                  s, then 30 s). After each spin, the material in the",
    "supernatant and the resuspended pellet is assessed under the\n                  microscope to determine if more DC steps are necessary. Scale\n                  bar represents 500 μm.\n                \n            Only organoids: Proceed to counting and embedding\n            (proceed with step 25) (Figure 3[href=https://www.wicell.org#fig3]).\n            \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2790-Fig3.jpg\n                  Figure 3. Embedding PDxOs in 3D Matrigel domes\n                \n                  To embed PDxOs, a 50 μL Matrigel drop is placed into a well of\n                  a 6-well plate. Using a pipet tip the Matrigel is immediately\n                  spread out to form a cicular base layer. During 5 min of\n                  incubation of the plate at 37°C the PDxO:Matrigel mix is\n                  prepared. 200 μL of the mixture is added onto the baselayer,\n                  and incubated for 5 min at 37°C. The plate is then flipped\n                  upside down and placed back into the incubator for 10 min.\n                  After that, subtype-specific media is added to the well.\n                \n            Only single cells: Aggregate on ultra-low adhesion plate for 16 h.\n            Embed the following day (proceed with step 27)\n          \nNote: If < 50,000 cells are obtained in\n      the pellet fraction after DC, it is recommended to collect and spin down\n      all single cells after DC and follow step 27 to incubate on a ultra\n      low attachment (ULA) plate for 16 h and embed the next day. In this case\n      it is also recommended to embed the cells in a scaled down “mini-dome” in\n      a 12-well plate using 100 μL of Matrigel:Cell mixture and a 25 μL Matrigel\n      base layer.\n    \nNote: Recommended viability of the\n      digested material to move forward with the protocol are between 80-100%.\n      For viability below 80% refer to\n      troubleshooting[href=https://www.wicell.org#troubleshooting] section.\n    \nCritical: To generate best possible\n      starting material from PDxO cultures, it is beneficial to eliminate single\n      cells present in digested material containing organoids and single cells.\n      While single cells can be tumor cells our experience shows that they are",
    "generally mouse stromal-like cells that can contaminate PDxO cultures.\n    \n        To eliminate single cells from digested material, perform a series of\n        quick spins (differential centrifugation, DC) to separate single cells\n        from tumor cell aggregates/organoids (Figure 2[href=https://www.wicell.org#fig2]).\n        \nNote: Not all DC steps are always\n          necessary\n        \nCritical: Stop DC if single cells\n          in pellet fraction are < 5% or organoids begin to appear in the\n          supernatant fraction. Monitor supernatant and pellet for organoid\n          content and structure throughout the DC process.\n        \n            Gently resuspend the pellet in 15 mL of warm PDxO base medium in\n            15 mL conical tube.\n          \nCentrifuge at 300 × g for 1 min.\nTransfer supernatant to another 15 mL conical tube.\nResuspend pellet in 5 mL of warm PDxO base medium.\nEvaluate resuspended pellet and supernatant under microscope.\n            Fill up conical tube that contains resuspended pellet to 15 mL of\n            warm PDxO base medium. Centrifuge at 300 × g for 50 s.\n          \nTransfer supernatant to another tube.\nResuspend pellet in 5 mL of warm PDxO base medium.\nEvaluate resuspended pellet and supernatant under microscope.\n            Fill up conical tube that contains resuspended pellet to 15 mL of\n            warm PDxO base medium.\n          \nCentrifuge at 300 × g for 40 s.\nTransfer supernatant to another tube.\n            Resuspend pellet in 5 mL of warm PDxO base medium. Evaluate\n            resuspended pellet and supernatant under microscope.\n          \n            Fill up conical tube that contains resuspended pellet to 15 mL of\n            warm PDxO base medium.\n          \nCentrifuge at 300 × g for 30 s.\nTransfer supernatant to another tube.\nResuspend pellet in 5 mL of warm PDxO base medium.\nEvaluate resuspended pellet and supernatant under microscope.\n            Fill up conical tube that contains resuspended pellet to 15 mL of\n            warm PDxO base medium. Centrifuge at 300 × g again for 30 s.\n          \nTransfer supernatant to another tube.",
    "Resuspend pellet in 5 mL of warm PDxO base medium.\nEvaluate resuspended pellet and supernatant under microscope.\n            If organoid fraction is clean, proceed to the next step. If not,\n            repeat centrifugation at 300 × g for 30 s, continuing to\n            monitor the pellet and supernatant compositions until a clean\n            organoid fraction is achieved.\n            \nCritical: Perform DC in 15 mL\n              conical tubes. The steeper focus point of the conical helps to\n              focus cells into a smaller pellet (vs. in a 50 mL conical) and\n              avoids loss during aspiration steps.\n            \nCritical: Resuspend carefully\n              and monitor all differential centrifugation steps under a\n              microscope. Evaluate the resuspended pellet and supernatant after\n              each differential centrifugation step. If organoids start to break\n              down into single cells, stop differential centrifugation and embed\n              all remaining material.\n            \n        Count organoids.\n        \n            Drop 5 μL of digested material onto hemocytometer without cover\n            glass.\n          \n            In order to flatten out the drop and to increase visibility under\n            the microscope, flick the hemocytometer gently with your finger.\n          \n            Using a microscope, count all organoids in now spread out 5 μL drop.\n          \n            To calculate the total number of organoids, multiply organoid count\n            by 200 and by total volume (mL).\n            \n                For example: If organoids are resuspended in 10 mL, multiply by\n                2,000 to calculate total organoid number.\n                \nCritical: Due to their\n                  large size, organoids cannot be loaded onto a hemocytometer by\n                  standard methods as they will clog under the cover glass and\n                  result in inaccurate counts. In our hands, counting slides for\n                  automated cell counters also clog and lead to inaccurate\n                  organoid counts.\n                \nNote: Freshly prepared PDxOs\n                  can be cryopreserved (option A) or embedded into Matrigel for\n                  culture following preparation from PDX. Immediate embedding\n                  yields highest viability and quickest outgrowth.\n                \nOptional:\nCryopreserve PDxOs immediately following preparation from\n                    PDX.\nPellet organoids by centrifugation (300 × g, 3 min, 20°C).",
    "Aspirate supernatant.\nResuspend in PDxO cryopreservation medium. Aim for\n                  5,000-10,000 organoids/vial or 0.5–1.0 × 106\n                  cells/vial.\nTransfer to cryo tubes. Load vials into Mr. Frosty and place\n                  at -80 °C. Transfer to LN2 after 24 h for long term\n                  storage.\n        Embedding organoids into 3D Matrigel domes for culture (Figure 3[href=https://www.wicell.org#fig3]).\n        \n            In a 6-well plate, coat the center of each well with 50 μL Matrigel\n            base layer: paint Matrigel in a round base layer without touching\n            the sides of the tissue culture plate.\n            \n                This is best achieved by pipetting the Matrigel onto the plate\n                and using the pipette tip to drag the Matrigel.\n              \n                Aim for a base layer that is roughly the size of a nickel.\n              \n            Allow base layer to polymerize at 37°C for 5 min.\n            \nCritical: Longer incubation\n              times will cause Matrigel base layers to shrink and potentially\n              dry out, which can cause lifting of the PDxO:Matrigel dome off the\n              plate.\n            \n            Resuspend 0.5–2 x 104 organoids per number of desired\n            wells in 200 μL Matrigel/well on ice.\n            \n                Matrigel pipetting loss is substantial; calculate for 15%–20%\n                more than needed\n              \n            Pipette gently 5-10 times to establish good distribution without\n            destroying organoids and without introducing air bubbles.\n          \n            Carefully add 200 μL organoids:matrigel mixture onto each base\n            layer.\n            \n                Careful handling of the plate is required to not disturb the\n                dome.\n              \n            Polymerize Matrigel at 37°C for 15 min total, flipping the plate\n            upside down on its lid after 5 min.\n            \nCritical: Flipping the plate\n              helps the PDxOs settle into the top of the Matrigel dome, helping\n              to prevent PDxOs from coming into contact with plastic, since they\n              remodel the Matrigel during their growth period.\n            \n            After the indicated 15 min, flip the plate back over and add 5 mL\n            fresh complete PDxO medium (specific to the breast cancer subtype of\n            the tumor) to each well.",
    "Pipette media onto the side of well.\n            \n                Do not pipette directly on top of the Matrigel dome as it might\n                result in loss of its structural integrity.\n              \nPut the lid back on the plate and place plate in incubator.\nReplace the complete PDxO medium every 3–4 days.\n            To replace the media, tilt the plate to avoid damaging the\n            matrigel:organoid dome, and carefully aspirate medium.\n          \n            Add 5 mL fresh complete PDxO medium specific to the breast cancer\n            subtype of the PDxO.\n          \n            Standard culture conditions for PDxOs from this point on are 37°C\n            and 5% CO2.\n            \nCritical: PDxOs are more\n              sensitive to acidic medium conditions than standard 2D cell\n              cultures. Always replace medium prior to significant yellowing of\n              the medium.\n            \n        In cases where only single cells are present after gMACS disassociation,\n        aggregation for 16 h on an ultra-low attachment (ULA) plate is\n        recommended prior to embedding into Matrigel domes.\n        \nPellet cells by centrifugation (300 × g, 3 min, 20°C).\nAspirate supernatant.\n            Resuspend in PDxO medium with breast cancer subtype-specific\n            supplements added.\n            \n                Aim for 500,000–2,000,000 cells per each well of a 6 well plate.\n              \nCarefully pipet cells into a well of a ULA 6-well plate.\n            Place in the incubator for 16–24 h. Cell aggregates are visible in\n            the center of the well (Figure 4[href=https://www.wicell.org#fig4]).\n            \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2790-Fig4.jpg\n                  Figure 4. Aggregation of single cells in ULA plate\n                \n                  To aggregate, cells are plated into a well of a 6-well ULA\n                  plate and incubated for 16 h. Images show pre (left)- and post\n                  (right) 16 h incubation. Scale bars represents 100 μm.\n                \n            Carefully pipet the medium and the cell aggregates and transfer into\n            a 15 mL conical tube.\n          \nPellet cells by centrifugation (300 × g, 3 min, 20°C).\n            Aspirate supernatant and embed the pellet into a Matrigel dome\n            (proceed with step 26).\n          \nPause point: Once the pellet is",
    "embedded, change culture media every 3-4 days and allow PDxO wo grow.\n    \nNote: We typically embed into one dome but\n      if culture is significantly denser than the example depicted in\n      Figure 4[href=https://www.wicell.org#fig4] we recommend embedding in multiple domes.\n    \n      Alternative preparation of PDxOs using MDM (mechanical disassociation\n      method)\n    \nTiming: 1–1.5 h\n      The leftover media where PDX tumor material is chopped into fragments can\n      contain a significant amount of tumor cells. When PDX tissue is very\n      limiting and all needs to be used for another application (e.g.,\n      retransplanted into mice), an alternative preparation method can be used\n      to still obtain organoids:\n    \n        To generate PDxOs using the MDM method, save the leftover media that was\n        used to chop PDX tumor fragments at step 4.\n      \nTransfer to 15 mL conical tube.\nCentrifuge (5 min, 300 × g, 20°C) to pellet cells.\nFollow above protocol starting at step 22.\nOptional:\nMDM cultures can be aggregated for 16 h on ULA plates and embedded the\n        next day following\nstep 27. In our hands, ULA incubations can increase the survival of cells in\n        stress situations but both methods have generated healthy long-term PDxO\n        cultures.\n    \nCritical: PDxO cultures started with\n      the MDM method usually contain single tumor cells or very small clusters,\n      and larger debris, in which case DC is often not recommended. Most\n      cultures can be started by straining followed by immediate embedding.\n    \nMaintaining and passaging PDxOs\nTiming: 1–1.5 h\nTiming: 30 min–1 h (for step 33)\n    \nTiming: 30 min–1 h (for step 34)\n    \n      Once embedded, PDxO cultures will be ready for a first split from passage\n      0 (P0) to P1 approximately 7–21 days after initial embedding.\n      Troubleshooting 3[href=https://www.wicell.org#sec6.5]. Triple negative breast cancer\n      (TNBC) PDxOs generally, but not always, grow faster than other breast\n      cancer subtypes. Prior to splitting, always evaluate organoid health under",
    "the microscope. Troubleshooting 4[href=https://www.wicell.org#sec6.7],\n      Troubleshooting 5[href=https://www.wicell.org#sec6.9].\n    \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2790-Fig5.jpg\n          Figure 5. Passaging PDxOs after they are adapted to culture using\n          dispase and TrypLE steps (>P2)\n        \n          Once mature, media is removed from PDxOs and dispase solution is\n          added. Matrigel domes containing PDxOs are broken up manually,\n          incubated at 37°C, then washed with media and centrifuged. The\n          organoid pellet is resuspended in TrypLE to disassociate PDxOs into\n          single cells. Cells are assessed under the microscope, counted and\n          embedded in Matrigel. Scale bar represents 100 μm or 50 μm as\n          indicated.\n        \nNote: To help PDxOs adapt to culture, we\n      found that the first split is most successful when we divide the process\n      into two phases: dispase to digest Matrigel and eliminate PDxO-Matrigel\n      interactions (step 32), followed by dissociation of organoids into\n      single cells using TrypLE Express (step 33).\n    \nNote: Examples of mature PDxO cultures are\n      shown in (Figure 5[href=https://www.wicell.org#fig5]) and Guillen et al.1[href=https://www.wicell.org#bib1]\nCritical: Splitting new PDxO cultures\n      prior to day 10 typically results in very poor viability\n      post-dissociation. Giving organoids time to adapt to culture prior to the\n      first split is critical to success.\n    \nCritical: We always use a dispase step\n      for all first splits to help ease the stress of culture adaptation, but\n      this step can generally be eliminated for hardy PDxO lines in subsequent\n      splits.\n    \n        Dispase digestion of Matrigel (Figure 5[href=https://www.wicell.org#fig5]).\n        \n            Check PDxO health, density, and phenotype under the microscope.\n          \nAspirate medium.\nAdd 1 mL freshly-made dispase solution to each well.\n            Tilt plate ane use a cell scraper to scrape the dome into the\n            dispase solution\n          \n            Carefully pipette (p1000) 5–10 times to break up Matrigel into\n            smaller fragments.\n          \n            Incubate 1 h at 37°C.\n            \nPause point: During the 1h\n              incubation time, Matrigel will be dissolved without causing\n              organoids to dissasociate. TrypLE can be warmed up in the\n              waterbath during this step.",
    "Check Matrigel digestion using a microscope.\n            \n                Digestion can be stopped prior to 1 h if no non-digested\n                Matrigel is visible and organoids are in suspension.\n              \nNon-digested Matrigel will look like glass fragments.\nTransfer to 15 mL conical tube.\nFill tube up to 15 mL with PDxO base medium.\nCentrifuge (300 × g, 3 min, 20°C) to pellet organoids.\n            Aspirate supernatant.\n            \nCritical: Some\n              grape-like/loosely associated PDxO lines (refer to\n              phenotype/morphology summary in Figure 9[href=https://www.wicell.org#fig9]) tend\n              to fall apart into single cells during this step, which interferes\n              with subsequent DC steps. Check the PDxO phenotype every 20 min\n              during the 1 h dispase incubation step and move to the next step\n              if PDxOs start to fall apart.\n            \n        Dissociation of organoids.\n        \nResuspend organoid pellet in 2 mL TrypeLE + 2 μL Y-27632.\nTransfer to 1 well of a new 6-well tissue culture plate.\n            Incubate at 37°C for 3–15 min, until organoids are just dissociated.\n            \n                Every 3–5 min, pipette (p1000) aggressively 15–20 times and\n                check organoid dissociation progress with a microscope.\n              \n            As soon as organoids are dissociated, pipet up and down to mix and\n            remove 10 μL to count the cells using an automated counter (Countess\n            II) or hemocytometer.\n            \nCritical: Dilute out the\n              TrypLE as soon as organoids are sufficiently dissociated. Leaving\n              organoids in TrypLE post-dissociation can drastically decrease\n              viability.\n            \nTransfer dissociated organoids into a 15 mL conical tube.\n            Wash the well with PDxO base medium to increase cell recovery.\n          \nFill the conical tube up to 15 mL with PDxO base medium.\nCentrifuge at 300 × g for 3 min to pellet cells.\n            Embed the dissociated cells into new Matrigel domes following step\n            26.\n          \n            Seeding density should be adjusted for the growth rate of each PDxO\n            line:\n            Fast growing lines: 0.2–0.25 × 106 cells/well, split\n            every 11–14 days.",
    "Moderate growing lines: 0.25–0.35 × 106 cells/cell, split\n            every 15–21 days.\n            Slow growing lines: 0.35-.4 × 106 cells/cell, split every\n            22–31 days.\n          \n            To calculate PDxO culture doubling time, we use the following\n            equation:\n            \n(\nL\nO\nG\n(\n2\n)\n∗\nT\ni\nm\ne\n)\n/\n(\nL\nO\nG\n(\nC\ne\nl\nl\n2\n)\n-\nL\nO\nG\n(\nC\ne\nl\nl\n1\n)\n)\n            where Time is defined as the number of days in culture between\n            passaging; Cell1 is the seeding density at which the dome\n            was plated; and Cell2 is the cell count at the day of\n            passaging.\n            \nCritical: After the dispase\n              step, be sure to perform at least two washing steps with PDxO\n              media, otherwise the domes containing newly embedded organoids are\n              not stable.\n            \nNote: Most PDxO lines are fairly\n              easy to dissociate in later passages and will not continue to\n              require splits with dispase after the first couple of passages (P0\n              to P2). Subsequent splits without dispase are quicker to execute\n              (Figure 5[href=https://www.wicell.org#fig5]).\n            \n        Passaging without dispase.\n        \n            Check organoid health, density, and phenotype using the microscope.\n          \nTilt plate towards you and aspirate medium.\nAdd 2 mL TrypLE and 2 μL Y-27632 onto the dome.\n            Using a cell scraper, lift the dome off the plate so that it floats\n            in the TrypLE solution.\n          \n            Use a p1000 pipette to manually break up the dome by pipetting up\n            and down 5–10 times.\n          \nProceed with step 33c.\nCritical: A few PDxO lines will\n      experience significant decrease in viability post-split if the dispase\n      step is eliminated. The specific needs of each PDxO line are best\n      determined on an individual basis.\n    \n      Continue to change medium every 3–4 days and split PDxOs every 14–21 days,\n      until PDxOs become established and adapted to culture. The timing can vary",
    "but this typically takes around 30–60 days of culture. We consider a PDxO\n      culture established once it has been split at least 3 times (≥ P3),\n      displays a healthy and stable phenotype (refer to\n      Figure 6[href=https://www.wicell.org#fig6] for morphology and phenotypes), is free from\n      mouse cells by qRT-PCR (steps 37, 38, 40), has been validated by STR (step\n      39) and biobanked (step 35), as described in Table 1[href=https://www.wicell.org#tbl1].\n    \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2790-Fig6.jpg\n          Figure 6. Diverse morphology of PDxOs with examples of successful\n          cultures and unhealthy organoids\n        \n          (A–D) Successful PDxO cultures display phenotypes as shown in the\n          panels on the left. Characteristics of unhealthy PDxO cultures are\n          shown on the right. ∗Examples of PDxOs that are out of focus due to\n          the 3D nature of the PDxO domes are marked with a white star (∗).\n          Successful cultures can display as spherical, grape-like or\n          metaplastic phenotype, and examples of these morphologies are shown in\n          images marked with A. Additional characteristics of healthy PDxO\n          cultures are consisteny density within the culture as shown in B, and\n          consistent phenotypes across passages. Unhealthy cultures usually fail\n          to grow into PDxO lines. In these cases PDxO cultures can have\n          acellular or cytsic morphology as shown in images marked with C, or\n          PDxOs can eject dead cells (D). Additionally, unhealthy cultures can\n          have low viability with 20% or more dead cells during passaging (P2 or\n          higher). Scale bar represents 50 μm.\n        \ntable:files/protocols_protocol_2790_5.csv\nCryopreservation and thawing of PDxOs\nTiming: 20 min (for step 35)\n    \nTiming: 30 min (for step 36)\n    \n        To cryopreserve organoids.\n        \nRemove media from the well and discard.\n            Add 1 mL of freshly prepared PDxO cryopreservation medium to each\n            well of mature organoids.\n          \n            Tilt plate and use cell lifter to scrape Matrigel dome into bottom\n            corner of the well.",
    "Pipette up and down with a P1000 5-10 times to mechanically break up\n            the dome.\n          \nTransfer into prelabeled cryotubes.\nLoad vials into Mr.Frosty and place at −80°C.\nTransfer to LN2 after 24 h for long-term storage.\nPause point: Cryopreserved PDxOs\n      can be stored at LN2 long-term.\nNote: PDxOs can be cryopreserved without a\n      dispase step. When PDxOs are thawed the washing step will remove old\n      Matrigel.\n    \n        To thaw organoids and initiate culture:\n        \nPlace the cryovial into a 37°C water bath until just thawed.\n            Transfer contents to 15 mL conical and fill up with 13 mL warm PDxO\n            base medium.\n          \nCentrifuge (300 × g, 3 min, 20°C).\n            Aspirate supernatant.\n            \nCritical: Leftover matrigel\n              from cryopreserved organoids can be visible as cloudy layer on top\n              of the PDxO pellet. Be careful not to aspirate organoids present\n              in this layer.\n            \n            Repeat washing step if organoids are present in the cloudy Matrigel\n            layer.\n          \n            Embed into Matrigel domes right away following step 26.\n            \nNote: The number of domes that can\n              be seeded from one vial depends on the pellet size. Typically, one\n              vial can be embedded into two domes after thawing.\n            \nNote: PDxOs that come out of cryo\n              are typically ready to be passaged after 7–11 days. Passaging too\n              early can lead to a decrease in viability.\n            \nCritical: We don’t recommend\n              dissociating organoids immediately post thaw, as this results in\n              cell death.\n            \nCritical: Organoids should not\n              be cultured in suspension immediately post thaw, as this results\n              in substantial loss of viability prior to embedding.\n            \nPart II PDxO validation and characterization\nQuality control: PDxO morphology and doubling time\n      PDxO lines have heterogeneous morphology and we observe defined spherical\n      phenotypes as well as grape-like organoid phenotypes (Figure 6[href=https://www.wicell.org#fig6], left). In addition, we observe that PDxOs derived from metaplastic\n      breast cancer grow as cultures without clearly defined organoids. However,",
    "several phenotypes point toward an unhealthy culture that in our\n      experience will not lead to a successful establishment of PDxOs. Examples\n      of those are shown in Figure 6[href=https://www.wicell.org#fig6], right. In cases when\n      the majority of the culture displays these phenotypes we recommend\n      re-starting the PDxO from the beginning.\n    \nCritical: PDxO cultures can exhibit\n      various phenotypes but PDxO health is in question if dramatic morphologic\n      changes occur within the same PDxO line over time.\n    \n      During the first three passages, it is normal to see dramatic changes in\n      doubling time, as the organoids adjust to the culture conditions, and due\n      to dropout of non-cancerous cells during this stage. After P3 most PDxO\n      cultures should exhibit a stable doubling time range and predictable\n      passage interval (Table 2[href=https://www.wicell.org#tbl2]).\n    \ntable:files/protocols_protocol_2790_6.csv\n      Abbreviations: Estrogen receptor (ER), progesterone receptor (PR), triple\n      negative breast cancer (TNBC), invasive ductal carcinoma (IDC), invasive\n      lobular carcinoma (ILC), ductal carcinoma in situ (DCIS),\n      established (est).\n    \n      Quality control: Nucleic acid isolation and STR analysis\n    \nTiming: 20 min (for step 37)\n    \nTiming: 45 min (for step 38)\n    \nTiming: 2 h + genetic analyzer service\n      (for step 39)\n    \n      For PDxO culture validation, we perform short tandem repeat (STR) analysis\n      to ensure that PDxO cultures match the original patient and PDX samples.\n      We simultaneously extract RNA and DNA from the same PDxO dome (RNA is used\n      for RT-PCR analysis of human/mouse content and described below). RNA and\n      DNA extracted with this protocol can also be used for genomics analysis\n      such as RNA and DNA sequencing.\n    \n        PDxO culture preparation for nucleic acid extraction.\n        \nAspirate medium.\nAdd 1 mL freshly-made dispase solution to each well.\n            Tilt plate and use a cell scraper to scrape the dome into the\n            dispase solution.\n          \n            Carefully pipette (p1000) 5-10 times to break up Matrigel into\n            smaller fragments.",
    "Incubate 30 min - 1 h at 37°C.\n            Digestion can be stopped prior to 1 h if no non-digested Matrigel is\n            visible and organoids are in suspension.\n          \nTransfer to 15 mL conical tube.\n            Fill tube up to 15 mL with ice-cold non-supplemented Advanced\n            DMEM/F12 medium.\n          \nMix by inverting the conical tube multiple times.\n            Centrifuge (300 × g, 3 min, 4°C) to pellet organoids.\n            \nCritical: There won’t be a\n              defined PDxO pellet visible after this first washing step. Most\n              organoids will be located in a cloudy layer of about 1–2 mL at the\n              bottom of the tube, and it is critical not to aspirate this\n              fraction.\n            \n            In a separate tube, add BME to RLT Buffer Plus (1:100) and set\n            aside.\n            \nTotal volume needed is 0.3 mL per sample.\n            Aspirate supernatant from organoid pellet, making sure to leave the\n            cloudy layer.\n          \n            Add 2 mL ice-cold non-supplemented Advanced DMEM/F12 onto pellet.\n          \nPipet up and down 10× with P1000.\n            Fill up to 15 mL with ice-cold non-supplemented Advanced DMEM/F12.\n          \n            Mix tube an centrifuge (300 × g, 3 min, 4°C).\n            \nCritical: Pellet should be\n              visible and clearly defined. If there is still a significant\n              cloudy layer, repeat washing for a third time.\n            \nRemove supernatant.\n            Resuspend pellet in 300 μL of RLT Plus Buffer with freshly added BME\n            and transfer to 1.5 mL microtube.\n          \n            Vortex at maximum speed for 1 min and proceed with nucleic acid\n            extractions.\n            \nOptional: Freeze and store\n              sample at −80°C.\n            \nPause point: RLT lysates\n              intended to be used for RNA/DNA extraction can be stored at −80°C\n              for at least 12 months.\n            \nNote: If samples were stored in\n              −80°C, we recommend thawing for 5 min in a 37°C water bath, then\n              vortexing on maximum speed 1 min and proceeding with\n              step 38.\n            \nCritical: Thawing in the water",
    "bath for 5–10 min is critical to prevent columns from clogging.\n            \n        Simultaneous RNA/DNA isolation from PDxOs in RLT buffer using the Qiagen\n        AllPrep RNA/DNA kit.\n        \n            Prepare 70% Ethanol (molecular grade, RNase-free).\n            \nPrepare a minimum of 0.5 mL per sample.\n            To homogenize sample, pipet RLT lysate onto QiaShredder spin column.\n          \nCentrifuge (max speed, 1 min, 20°C).\n            Check column and centrifuge again if liquid is still visible on top\n            of spin column.\n          \nDiscard column.\nTransfer flow-through to AllPrep DNA binding column.\nCentrifuge (10,000 × g, 30 s, 20°C).\n            Place AllPrep DNA binding column in a new collection tube and set on\n            ice.\n          \nSave flow-through for RNA extraction.\n            Add 1 volume of 70% RNase-free molecular grade ethanol to\n            flow-through.\n          \nImmediately mix by pipetting up and down with P1000.\n            Quickly transfer 600 μL of mixture onto AllPrep RNA binding column.\n          \n            Centrifuge (10,000 × g, 15 s, 20°C), discard flow-through.\n          \nTransfer any remaining volume of sample to same column.\n            Centrifuge (10,000 × g, 15 s, 20°C), discard flow-through\n          \n            Add 350 μL RW1, centrifuge (10,000 × g, 15 s, 20°C), discard\n            flow-through.\n          \n            In a separate 1.5 mL tube mix 10 μL DNase I stock solution to 70 μL\n            Buffer RDD and gently mix by pipetting (do not vortex!).\n            \nCritical: It is critical not\n              to vortex DNase as this can impair its enzyme activity.\n            \n            Add 80 μL of DNase incubation mix directly onto the AllPrep RNA\n            binding column.\n          \nIncubate for 15 min at 20°C.\n            Add 350 μL RW1, centrifuge (10,000 × g, 15 s, 20°C), discard\n            flow-through.\n          \n            Add 500 μL RPE, centrifuge (10,000 × g, 15 s, 20°C), discard\n            flow-through.\n          \n            Add 500 μL RPE, centrifuge (10,000 × g, 2 min, 20°C), discard\n            flow-through.\n          \n            Place column in new collection tube and dry spin (max speed, 1 min,\n            20°C).\n          \nPlace column in 1.5 mL microtube.",
    "Add 30 μL of water (RNase-free) directly onto column.\nElute RNA by centrifugation (10,000 × g, 1 min, 20°C).\n            Place on ice, quantify RNA concentration using Qubit BR RNA Assay.\n          \nRemove DNA binding column from ice.\n            Add 500 μL AW1, centrifuge (10,000 × g, 15 s, 20°C), discard\n            flow-through.\n          \n            Add 500 μL AW2, centrifuge (max speed, 2 min, 20°C), discard\n            flow-through.\n          \nPlace column in 1.5 mL microtube.\n            Add 100 μL of EB Buffer directly onto column and incubate for 1 min,\n            20°C.\n          \nElute DNA by centrifugation (10,000 × g, 1 min, 20°C).\n            Place on ice, quantify DNA concentration using Qubit BR dsDNA Assay\n            Troubleshooting 9[href=https://www.wicell.org#sec6.17].\n          \n            RNA and DNA are stored at −80°C.\n            \nPause point: Nucleic acids\n              are stable at −80°C for a minimum of 12 months.\n            \nNote: We quantify DNA and RNA\n              using broad range (BR) Qubit kits according to the manufacturer’s\n              protocol. For each sample, we use 1 μL of extracted nucleic acids\n              for the Qubit assay. If RNA or DNA concentrations are below\n              50 ng/μL, requantify using high sensitivity (HS) Qubit kits.\n            \nNote: Viably frozen cryostocks can\n              also be used for nucleic acid extraction. Thaw vial in 37°C water\n              bath, transfer to a 1.5 mL microtube and Centrifuge\n              (300 × g, 3 min, 20°C). Resuspend pellet in 300 μL of RLT\n              Plus Buffer with freshly added BME and proceed with\n              step 38.\n            \nCritical: It is important to\n              work quickly through the nucleic extraction protocol to ensure\n              maximum yields. We don’t recommend to isolate RNA/DNA from more\n              than 10 samples at once.\n            \n            To validate the identity of established PDxO lines, we utilize a kit\n            for Short Tandem Repeats (STR) analysis which requires only a few ng\n            of DNA as input for a PCR reaction. The fluorescent PCR products can",
    "be run on a Genetic Analyzer or sent off for analysis. We use\n            GeneWiz’s service for this step and compare results of matching\n            patient-derived models like PDX and PDxOs to their original patient\n            tumor. Each patient will display a unique pattern of STRs which is\n            used to verify the origin of PDxOs.\n          \n        Validation of PDxO identity via STR Assay.\n        \nAdd 0.08 ng/μL DNA in a volume of 5 μL–96 well PCR plate.\n            Add 7.5 μL of Master Mix provided by the AmpFLSTR™ Identifiler™ Plus\n            PCR Amplification Kit.\n          \n            Use AmpFLSTR™ Identifiler™ Plus PCR Amplification Kit according to\n            manufacturer’s protocol.\n          \nUse genetic analyzer or Genewiz to analyze PCR product.\nCompare unique patterns of STR peaks between samples.\nNote: We found that reducing the total\n      reaction volume by half to 12.5 μL instead of 25 μL produces reliable\n      results while reducing assay costs significantly.\n    \nQuality control: Mouse cell detection and elimination\n      qRT-PCR is performed to detect the presence of mouse cells in the PDxO\n      culture. We eliminate mouse cells from our cultures, since in some tumor\n      lines the contaminating mouse cells can grow aggressively and interfere\n      with optimal expansion of long term PDxO cultures and subsequent drug\n      testing. In most PDxO cultures, residual mouse cells will self-eliminate\n      by approximately day 60 or passage 2 (Figure 7[href=https://www.wicell.org#fig7]A), but\n      in some cases they can be persistent (Figure 7[href=https://www.wicell.org#fig7]B). In\n      Matrigel, mouse cells often appear to be migratory with mesenchymal\n      characteristics, and can be identified by their elongated phenotype. They\n      can compete for space and nutrients, outpace epithelial growth and\n      ultimately take over PDxO cultures. However, metaplastic breast cancer\n      PDxO cultures can also display a mesenchymal-like phenotype, so it is\n      important to keep this in mind when deciding on mouse cell elimination\n      strategies. Troubleshooting 6[href=https://www.wicell.org#sec6.11]. Never use morphology",
    "as the sole factor to assess cell content. We recommend antibody-selected\n      fluorescent-activated cell sorting (FACS) or magnetic cell depletion (MCD)\n      over differential centrifugation (DC), since metaplastic tumor cells often\n      present as single cells post dispase digestion and would be lost using DC.\n    \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2790-Fig7.jpg\n          Figure 7. Detection of mouse cells in PDxO cultures\n        \n          (A) Self eliminating mouse cells in PDxO cultures will disappear over\n          time after several passages as shown for HCI-027 PDxOs from passage 1\n          (P1) to passage 9 (P9). Teal errors indicate the presumable presence\n          of mouse cells. Right side: qRT-PCR data indicating elimination of\n          mouse cells by passaging over time displayed as ΔCT (human\n          GAPDH CT subtracted from mouse Gapdh CT). Dark gray\n          indicates high mouse content, white indicates no mouse content. Scale\n          bars represents 100 μm.\n        \n          (B) Images of two PDxO lines (HCI-008 and HCI-023BR) showing\n          persistent mouse content at high passage number (P8 and P9\n          respectively) as shown by images (left) and qRT-PCR (right). Scale\n          bars represents 100 μm.\n        \n          (C) Images of two PDxO cultures (HCI-075 and HCI-015NIR) that only\n          contain mouse organoids. These PDxO lines failed establishment due to\n          non detectable human content as indicated by GAPDH CT values.\n          Scale bars represents 100 μm.\n        \nNote: Mouse cells of interest can be added\n      back to PDxO cultures in controlled ratios for co-culture experiments.\n    \n      Migratory mouse cells are often visible in PDxO cultures by microscopy (Figure 7[href=https://www.wicell.org#fig7]), but for precise assessment, we use qRT-PCR to quantify the expression\n      of human and mouse Gapdh to determine mouse cell content in PDxO\n      cultures. In some rare cases, PDxOs that appeared to be stable and healthy\n      contained only mouse organoids, so it is important to complete this\n      validation step even when cultures look perfect (Figure 7[href=https://www.wicell.org#fig7]C).\n    \nMouse cell detection\nTiming: 3 h (for step 40)",
    "To detect the presence mouse cells in PDxO cultures, qRT-PCR is performed.\n    \n        Detection of mouse and human content in PDxO cultures using qRT-PCR.\n        \nThaw RNA extracted from PDxOs (step 38) on ice.\n            In a first set of PCR tubes mix between 100-500 ng RNA and add\n            RNase-free water according to the manufacturer’s recommendation\n            (SuperScript IV Vilo kit) using 8 μL final volume.\n            \n                Use the same amount of RNA for each sample within one run.\n              \n            In a separate tube prepare the ezDNase buffer mix:\n            \nCalculate and add per sample, plus 10% extra:\n1 μL 10× ezDNase Buffer.\n1 μL ezDNase enzyme.\nMix well.\n            Add 2 μL of the ezDNase buffer mix to each sample into the first set\n            of tubes from step 40b to get a final volume of 10 μL and mix well.\n          \nIncubate for 2 min at 37°C.\n            In a 1.5 mL microtube prepare IV VILO Solution:\n            \nCalculate per sample, plus 10% extra:\n4 μL IV VILO Master Mix.\n6 μL nuclease-free water.\nMix well.\n            Add 10 μL IV VILO Solution to tubes from step 40e and mix gently.\n          \n            Start cDNA synthesis in thermal cycler using the program provided in\n            the SuperScript IV Vilo kit data sheet.\n          \n            For the qRT-PCR, reconstitute mouse Gapdh F + R (forward +\n            reverse) and human GAPDH F + R primers in IDT buffer as 40×\n            stocks.\n          \n            Calculate to use enough reaction mixture to run 1 ng of cDNA for\n            each sample in a final volume of 5 μL, with each sample run in\n            technical quadruplicates.\n          \n            Account for a “no cDNA” sample in each run for negative control.\n          \nIn PCR tubes, add 2× PowerUp SYBR Green Master Mix.\n            Add appropriate volume needed to end up with 1 ng of cDNA per PCR\n            tube.\n          \nMix well.",
    "In a separate 1.5 mL tube, dilute the primers. Calculate for 500 nM\n            primer of each forward and reverse primer per sample.\n          \n            Pipet 15 μL of the cDNA/SYBR mixture from step 40n into a new set of\n            PCR tubes.\n          \nAdd 15 μL of diluted primer mixture.\nMix well.\n            Transfer 5 μL of reaction mix per well into a 384-well PCR plate in\n            technical quadruplicates (20 μL of the 30 μL reaction mix from step\n            40r will be used).\n          \nCover the PCR plate with light cycler-compatible foil.\nSpin plate (350 × g, 2 min, 20°C).\nRun qRT-PCR on light cycler (Bio-Rad).\n            Use standard cycling mode recommended by the PowerUp SYBR Green\n            manual:\n          \n            Light cycler program:\n            \nDenaturation: 2 min @ 95°C.\n                40× cycles of: Denaturation: 15 s @ 95°C/ Elongation: 45 s @\n                60°C.\n              \nMelt curve: 0.5°C per minute, 65°C–95°C.\nFor analysis, average the technical replicate CT values.\n            To calculate ΔCT, subtract human GAPDH CT from mouse\n            Gapdh CT.\n          \nIf desired, display ΔCT values as a heatmap.\nNote: PDxO cultures with a mouse\n      Gapdh CT of 32 or higher are considered ”mouse free” for PDxO\n      establishment purposes, typically resulting ΔCT values of ∼13–15.\n    \nNote: If the same scale is used as\n      represented here, PDxO lines with high mouse content are represented in\n      the heatmap as dark gray due to the high mouse Gapdh CT and low\n      human GAPDH CT values, whereas ”mouse free” PDxO lines will display\n      as white.\n    \nNote: CT values of the four technical\n      replicates should be almost identical.\n    \nCritical: We noticed that mouse\n      content can start appearing in PDxO lines that are considered ”mouse free”\n      after freeze/thaw cycles and it is therefore recommended to perform the\n      mouse cell detection assay periodically or when elongated cells starting\n      to appear in culture over time.\n    \nCritical: We recommend to always use a",
    "combination of visual and quantitative (qRT-PCR) data to inform about\n      mouse cell content. For metaplastic breast cancers, mouse cells and tumor\n      cells are indistinguishable by eye.\n    \nMouse cell elimination\nTiming: 4–5 h (for step 41)\n    \nTiming: 3–4 h (for step 42)\n    \n      To eliminate mouse cells from PDxO cultures we use different strategies\n      depending on the nature of the PDxO culture (Figure 7[href=https://www.wicell.org#fig7]). Many PDxO lines contain self-eliminating mouse cells which won’t be\n      detectable after a few passages, even by qRT-PCR. This process can be sped\n      up by integrating DC steps during passaging. If mouse cells are\n      persistant, they can be detected even after an extended culture time of\n      >200 days or 10 passages. In these cases we recommend mouse cell\n      elimination by FACS (step 41) or magnetic bead mouse cell depletion (MCD)\n      (step 42). We suggest to perform one mouse cell elimination method (either\n      FACS or MCD), embed the PDxOs and then check the matured PDxO culture for\n      mouse cell content again to determine if one elimination step was\n      sufficient.\n    \nNote: Partial elimination by differential\n      centrifugation can be a short-term solution for eliminating mouse cells in\n      PDxO cultures. DC alone is not selective enough to fully eliminate mouse\n      cells in PDxO cultures, but is instead used as a tool to allow cultures\n      enough time to expand and generate sufficient epithelial cells numbers for\n      FACS sorting, generally requiring a minimum cell number of\n      1 × 106.\n    \nCritical: Most PDxOs need to be\n      expanded for 1–2 passages prior to FACS so that organoid outgrowth\n      post-FACS is not impaired.\n    \n      Once cells are >P0 and cell number is ≥ 1 × 106, PDxO lines\n      containing mouse cells can be purified by FACS. For mouse cell elimination\n      we use a simple, pooled antibody 2-channel strategy. Antibodies that stain",
    "stroma-like mouse cells (anti-mouse CD90.2, anti-mouse CD29) and human\n      cells or human epithelial cells (anti-human CD326/EpCAM, anti-human CD298)\n      are pooled into separate fluorescence channels for simple and effective\n      separation of mouse cells from human epithelial populations (Figure 8[href=https://www.wicell.org#fig8]).\n    \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2790-Fig8.jpg\n          Figure 8. Elimination of mouse cells from PDxO cultures via FACS\n        \n          (A) Gating strategy for sorting human and mouse cells in HCI-048 PDxO\n          culture. Cells were gated on SSC-A/FSC-A to exclude debris, and\n          FSC-A/FSC-W to exclude duplets. Only cells positive for human CD298 or\n          human EpCAM would be found in the gate positive for human cells based\n          on the green fluorescent fluorophore that the antibodies were labeled\n          with. Mouse cells will be labeled as such by red-fluorescence\n          conjugated CD29/CD90.2 antobodies and are found in the APC gate,\n          respectively.\n        \n          (B) Culture image show HCI-048 PDxOs pre- and post sorting. qRT-PCR\n          confirms that mouse content was eliminated by FACS. Scale bars\n          represents 100 μm.\n        \nNote: Set aside 50-100,000 unstained cells\n      as controls. Additional single channel controls are recommended to\n      properly set gates for cell sorting. If PDxO material is limited, mouse\n      fibroblast cells and human breast cancer cells can be used as positive\n      controls, although autofluorescence might differ from PDxOs and gating\n      strategy may need adjustment before starting the sort. An example of\n      sorting gate is shown in (Figure 8[href=https://www.wicell.org#fig8]).\n    \n        Elimination of mouse cells using FACS (optional).\n        \nRemove media from well.\n            Add dispase solution and use cell lifter to dislodge dome from\n            culture plate.\n          \nUse pipet to mechanically disrupt dome.\n            Incubate for 20–30 min at 37°C.\n            \nNote: We found that the optimal\n              dispase incubation time for passaging PDxOs is between 30 min –\n              1h, however when organoids are not immediately re-embedded and\n              undergo sorting we found that the minimum dispase incubation time\n              of 20–30 min is preferable to minimize cell death.",
    "Transfer into a 15 mL conical and fill up to 15 mL with PDxO base\n            media.\n            \nOptional: Perform differential\n              centrifugation (300 × g, 30 or 40 s, 20°C). Aspirate\n              supernatant and continue with TrypLE step on the pellet. Note that\n              cell yield can diminish with DC steps; proceed cautiously or skip\n              this optional step if limited organoid material is present.\n            \nCentrifuge (300 × g, 3 min, 20°C).\n            Aspirate and discard supernatant and follow steps 33a-f to\n            disassociate into single cells\n            Troubleshooting 8[href=https://www.wicell.org#sec6.15].\n          \nPerform all following steps on ice.\n            Resuspend cells in cold FACS buffer at 1.0 × 106\n            cells/mL, add Y-27632 (1:1000) and transfer into 5 mL conical tube.\n          \n            Add Fc receptor (FcR) blocking solution directly to the vial:\n            \nMouse FcR block: 1 μL/ 1.0 × 106 cells.\nHuman FcR block: 7.5 μL/ 1.0 × 106 cells.\nIncubate on ice for 20 min.\n            Add antibodies directly into cell/FcR mixture:\n            \n                Anti-mouse CD90.2 AlexaFluor 647: 2 μL/ 1.0 × 106\n                cells.\n              \n                Anti-mouse CD29 AlexaFluor 647: 2 μL/ 1.0 × 106\n                cells.\n              \n                Anti-human CD326 AlexaFluor488: 1 μL/ 1.0 × 106\n                cells.\n              \nAnti-human CD298 FITC: 10 μL/ 1.0 × 106 cells.\nMix well and incubate in the dark on ice for 30 min.\nFill up with cold FACS buffer to 5 mL.\nCentrifuge (300 × g, 3 min, 4°C).\n            Discard supernatant and resuspend pellet in 5 mL cold FACS buffer.\n          \nCentrifuge (300 × g, 3 min, 4°C).\nDiscard supernatant.\nResuspend in 150 μL FACS buffer with Y-27632 (1:1000).\nTransfer to FACS tube and keep on ice until flow sorting.\n            Sort human cells into a 15 mL conical tube containing 5 mL complete\n            PDxO media.\n            \nCritical: We don’t recommend\n              using cell strainers prior to FACS sorting due to loss of cells.\n            \nCritical: Perform FACS sorting\n              as soon as possible after staining.",
    "Critical: Gates for the sorted\n              human cell population should be set conservatively to avoid any\n              mouse cell contamination (Figure 8[href=https://www.wicell.org#fig8]).\n            \n            Post sort, centrifuge the isolated human cells (300 × g,\n            3 min, 4°C).\n          \nResuspend in 5 mL complete PDxO media.\n            Culture on ultra-low attachment (ULA) plate for 16 h.\n            \nPause point: The 16 h\n              incubation time will allow the sorted cells to aggregate.\n            \nCritical: Allowing cells to\n              aggregate pre-embedding increases the survival rate after sorting.\n            \n            The next day, transfer the aggregates into 15 mL conical tube\n            without washing the plate.\n          \nCentrifuge (300 × g, 3 min, 4°C).\n            Embed the cells into Matrigel dome following step 26.\n            \nNote: We recommend taking images\n              pre- and post- ULA as a reference to determine if cells aggregated\n              properly during the 16 h incubation. Examples of ULA cultures are\n              shown in Figure 4[href=https://www.wicell.org#fig4].\n            \nCritical: We recommend to\n              perform qRT-PCR on PDxOs 1–2 passages post-FACS to ensure purity\n              of the PDxO line (Figure 8[href=https://www.wicell.org#fig8]).\n              Troubleshooting 7[href=https://www.wicell.org#sec6.13].\n            \n        Elimination of mouse cells via magnetic bead mouse cell depletion (MCD)\n        (optional).\n        \nRemove media from well.\n            Add dispase solution and use cell lifter to dislodge dome from\n            culture plate.\n          \nUse pipet to mechanically disrupt dome.\nIncubate for 20–30 min at 37°C.\n            Transfer into a 15 mL conical and fill up to 15 mL with PDxO base\n            media.\n            \nOptional: Perform differential\n              centrifugation (300 × g, 30 or 40 s, 20°C). Aspirate\n              supernatant and continue with TrypLE step. Note that cell yield\n              can diminish with DC steps; proceed cautiously or skip this\n              optional step if limited organoid material is present.\n            \nCentrifuge (300 × g, 3 min, 20°C).\n            Aspirate and discard supernatant and follow steps 33a-f to\n            disassociate into single cells\n            Troubleshooting 8[href=https://www.wicell.org#sec6.15].\n          \nPerform all following steps on ice.\n            Place a pluristrainer (100 μm mesh size) on a 50 mL conical tube and",
    "strain cells.\n          \nWash strainer with 5 mL PDxO base media.\n            Remove 10 μL to count the cells using an automated counter (Countess\n            II) or hemocytometer.\n          \n            Transfer remaining cells into a 15 mL conical and fill up to 15mL\n            with PDxO base media.\n          \nCentrifuge (300 × g, 3 min, 20°C).\n            Discard supernatant and resuspend pellet in MCD buffer (0.5% BSA in\n            PBS) at a concentration of 2.0 × 106 cells/ 80 μL.\n          \n            For each 2.0 × 106 cells or 80 μL, add 20 μL of mouse\n            cell depletion cocktail.\n          \nMix well and incubate for 15 min on ice in the dark.\n            Adjust volume to 2.0 × 106 cells/500 μL with MCD buffer\n            (0.5% BSA in PBS).\n          \nPlace LS column into magnetic field of MACS Separator.\n            Wash LS column by rinsing with 3 mL MCD buffer (0.5% BSA in PBS).\n          \nPipet cell suspension onto column.\n            Collect flow-through.\n            \nThis portion contains the unbound human cells.\nWash column with 1 mL MCD buffer (0.5% BSA in PBS).\nCollect flow through.\nWash column with 1 mL MCD buffer (0.5% BSA in PBS).\nCollect flow through.\n            Combine all three flow throughs to recover as many human cells as\n            possible.\n          \n            Transfer into 15 mL conical tube and fill up to 15 mL with PDxO base\n            media.\n          \nCentrifuge (300 × g, 3 min, 20°C).\nDiscard supernatant and resuspend in 2 mL PDxO base media.\n            Remove 10 μL to count the cells using an automated counter (Countess\n            II) or hemocytometer.\n          \n            Culture cells on ULA for 16 h following step 27, and embed\n            the next day (proceed with step 26).\n          \nPDxO histology\nTiming: 3 days (for step 43)\n    \nTiming: 3 days (for step 44)\n    \nTiming: 3 days (for step 45)\n    \n      PDxO histology can be useful to characterize organoid morphology and\n      analyze protein expression in organoids. Using FFPE blocks, we",
    "characterized PDxO and found close resemblance to their matching parental\n      PDX tumors.1[href=https://www.wicell.org#bib1] To analyze protein expression\n      and localization by IHC or IF, PDxOs can be prepared by various methods\n      for histology. Making paraffin blocks (steps 43, 44) is more time\n      consuming, but results in sections that can be treated identically to\n      formalin-fixed tissue sections. We have successfully made PDxO paraffin\n      blocks following two different methods with are described in detail below\n      (steps 43, 44). Making cytospin slides (step 45) is a much quicker method\n      for determining protein expression and localization in PDxOs, and also\n      requires significantly less input material compared to paraffin blocks. We\n      have noted that either method can be utilized (optional).\n    \nNote: For preparation, place an alipuot of\n      histogel in heating block and warm to 65°C for a minimum of 20 min.\n    \n        Preparing PDxO blocks for histology using chamber slides (optional).\n        \n            For each paraffin block, prepare 2 domes of mature and confluent\n            PDxO cultures.\n          \n            Aspirate the media and add 1 mL cold PDxO base media to the well.\n          \n            Using a P1000 mechanically disrupt the dome by pipetting up and down\n            10–20 times.\n          \nTransfer into a 15 mL conical tube.\n            Wash the well with cold PDxO base media, transfer into the same\n            conical tube and fill up to 15 mL.\n          \nCentrifuge (300 × g, 3 min, 4°C).\n            Aspirate supernatant, including the cloud of broken up Matrigel\n            hovering over the pellet. Additional wash steps may be performed to\n            wash out the Matrigel and increase yield of organoids.\n          \nResuspend pellet in 150 μL Matrigel.\n            Pipet 150 μL PDxO:Matrigel mixture per well of chamber onto a\n            8-chamber slide.\n          \n            Incubate at 37°C for 10–12 min to solidify.\n            \nNote: From here on we follow\n              instructions published by Pinto et al.,5[href=https://www.wicell.org#bib4]\n              with the exception that we use 65°C warm histogel to pipet the",
    "bottom and top layer\n            \nRemove wells and rubber gasket from chamber slide.\nCoat a plastic cryo mold with 100 μL warm histogel.\n            Immediately place the PDxO:Matrigel block in the coated cryo mold\n            using a cell lifter.\n            \n                Remove any air pockets that may have formed between the histogel\n                coating and PDxO:Matrigel block.\n              \nAdd 100 μL warm histogel on top of the PDxO:Matrigel block.\nIncubate on ice for 10 min to solidify.\nAdd a biopsy pad in a labeled histology cassette.\n            Invert the cryo mold and transfer the PDxO:Matrigel block in the\n            histology cassette.\n          \n            Incubate histology cassette in 4% PFA in PBS for 16–24 h at 4°C.\n          \n            Place sample cassettes into tissue processor and process using the\n            program specified in Table 3[href=https://www.wicell.org#tbl3].\n          \n            Embed into paraffin block and cut block on the microtome into 5 μm\n            thick sections.\n          \n        Preparing PDxO pellet blocks for histology (optional).\n        table:files/protocols_protocol_2790_7.csv\n            For each paraffin block, prepare 2 domes of mature and confluent\n            PDxO cultures.\n          \nAspirate medium.\nAdd 1 mL freshly-made dispase solution to each well.\n            Use a cell scraper to scrape the dome into the dispase solution.\n          \n            Carefully pipette (p1000) 5-10 times to break up Matrigel into\n            smaller fragments.\n          \nIncubate 30 min at 37°C.\nTransfer to 15 mL conical tube.\nFill tube up to 15 mL with ice-cold PBS.\nMix by inverting the conical tube multiple times.\nCentrifuge (300 × g, 3 min, 4°C) to pellet organoids.\nRepeat PBS washing step.\nAspirate supernatant.\n            Resuspend pellet in 1 mL 4% PFA in PBS and transfer to 5 mL conical\n            tube.\n          \nIncubate for 16 h at 4°C.\nCentrifuge (300 × g, 3 min, 4°C) to pellet organoids.\nAspirate supernatant.\n            Resuspend pellet in 2 mL ice-cold PBS and incubate on ice for 5 min.\n          \nCentrifuge (300 × g, 3 min, 4°C) to pellet organoids.\nAspirate supernatant.\nRepeat PBS washing step.",
    "Aspirate supernatant.\nEnsure that all liquid is removed from the organoid pellet.\n            Resuspend pellet in 15 μL warm histogel without introducing air\n            bubbles.\n          \nLet solidify on ice for 10 min.\nAdd a biopsy pad in a labeled histology cassette.\n            Using a raxor blade, carefully cut off the bottom of the 5 mL\n            conical tube, exposing a hole to the organoid:Histogel block.\n          \nCut off top half of conical tube.\n            Invert the conical tube and push organoid:Histogel block onto\n            histology cassette using a 10 μL pipette tip.\n          \n            Place sample cassette into tissue processor and process using the\n            program specified in Table 3[href=https://www.wicell.org#tbl3].\n            \n                Alternatively place cassettes into 70% Ethanol at 4°C until\n                processing.\n              \n            Embed into paraffin block and cut block on the microtome into 5 μm\n            thick sections.\n          \n        Preparing PDxO cytospin sections for immunostainings (optional).\n        \nPrepare 1 dome of mature and confluent PDxO cultures.\n            Digest matrigel with dispase following step 32, with a shortened\n            incubation time of 30 min.\n          \n            Resuspend PDxO pellet in 15 mL cold PDxO base media for a second\n            wash.\n          \nCentrifuge (300 × g, 3 min, 4°C).\n            Discard supernatant and resuspend PDxOs in 1 mL fixing solution (2%\n            PFA, 0.01% Tween 20 in PBS).\n          \nIncubate at 20°C for 20 min.\nCentrifuge (300 × g, 3 min, 4°C).\n            Discard supernanant and resuspend fixed PDxOs in 1 mL\n            permeabilization buffer (0.5% Triton X-100 in PBS) at 20°C for\n            30 min.\n            \nNote: Permeabilization is\n              necessary if intracellular immunostainings are performed\n            \nCentrifuge (300 × g, 3 min, 4°C).\n            Discard supernanant and resuspend in aldehyde blocking solution\n            (1 mg/mL NaBN4, 0.01% Tween 20 in PBS).\n          \n            Incubate at 20°C for 5 min, then repeat aldehyde blocking step.\n          \nCentrifuge (300 × g, 3 min, 4°C).\n            Discard supernanant and resuspend in 2 mL 0.01% Tween 20 in PBS.\n          \nCentrifuge (300 × g, 3 min, 4°C).",
    "Discard supernanant and resuspend in 2 mL 0.01% Tween 20 in PBS.\n          \nCentrifuge (300 × g, 3 min, 4°C).\nDiscard supernanant and resuspend in 1 mL PBS with 2% BSA.\nAdd 100 μL of PDxO solution onto cytospin slide.\n            Centrifuge (2000 rpm, 2 min, 20°C).\n            \n                Note that the Cytospin centrifuge only reports rpm, therefore\n                rpm are reported here for user convenience.\n              \nDry slides for 16 h at 20°C.\n            Perform immunostaining the next day.\n            \nNote: Keeping PDxO cytospin slides\n              for a longer time period prior to immunostaining has not been\n              tested.\n            \n      Preparing PDxO for injection into mice to generate PDxoX\n    \nTiming: 3 days\n      PDxO can be prepared for transplantation into mice for\n      in vivo studies to generate PDxoX using the following procedure.\n    \n        Preparation of PDxO for transplantation.\n        \n            Plan to use 1 mature PDxO dome from a 6-well plate for injection\n            into each mouse.\n            \n                calculate volumes for n + 1 to account for pipetting loss and\n                syringe dead volume.\n              \n            Aspirate ∼ 3 mL of media, leaving ∼ 2 mL of media in the well.\n          \nUse a cell lifter to scrape the dome.\nPipet up and down 10–15 times to disrupt the Matrigel.\n            Transfer into 15 mL conical tube and fill up with PDxO base media.\n          \nCentrifuge (300 × g, 3 min, 4°C).\n            Discard supernatant and place conical tube with pellet on ice.\n          \n            Carefully resuspend pellet in Matrigel, using 20 μL per original\n            dome used as input.\n          \nBe careful not to introduce air bubbles.\nKeep on ice.\n            Immediately prepare mouse for surgery.\n            \nFollow IACUC-approval protocols and regulations.\nPre-chill 1mL syringe with 26G needle on ice.\n            Mix PDxOs/Matrigel solution by pipetting up and down without\n            introducing air bubbles.\n          \nFill syringe with 20 μL PDxOs/Matrigel without air.\n            Inject PDxO/Matrigel mixture into the 4th mammary fat pad\n            as described in detail in DeRose et al.2[href=https://www.wicell.org#bib3]",
    "and Guillen et al.1[href=https://www.wicell.org#bib1]\nPart III\nDrug response assay\nTiming: 7 days (for step 47)\n    \nTiming: 30 min–4 h (for step 48)\n    \n      We recommend using established PDxOs that meet the criteria defined in\n      Table 1[href=https://www.wicell.org#tbl1] to test for drug responses, not organoids\n      freshly isolated from a PDX tumor. Established PDxOs generally exhibit\n      higher growth rates during 4-day or 6-day drug exposure assays, improving\n      reliability in determining if drug effects are cytostatic or cytotoxic.\n      Also, unstable PDxO cultures can be artificially sensitive to drugs. We\n      screen established PDxOs that are cultured to a point were the domes are a\n      few days before reaching full maturity. At this maturity stage, PDxOs\n      display a more uniform size distribution. This helps to control for the\n      large size differences that can dominate a culture at maturity. Therefore,\n      pre-mature PDxOs 50–100 μm in size yield more consistent results in\n      plating disctribution. Because determining therapeutic responses in PDxOs\n      are typically large resource-intensive endeavors, we utilize homemade\n      EHS-derived matrix instead of commercial Matrigel. No differences in drug\n      responses were observed in side-by-side comparisons.\n    \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2790-Fig9.jpg\n          Figure 9. Overview of PDxO drug testing\n        \n          On \"day -1\", 384-well plates are prepared by coating with\n          EHS-deroived matrix as base layer. PDxOs suspensions are prepared, and\n          plated onto the base layers of 384-well plates. For each drug testing\n          assay, at least two plates are prepared, One “screening” plate, and\n          one ”day 0″ plate. On the next day, drug dilutions are prepared and\n          the drugs are added to the “screening” plate. On the same day, CTG3D\n          assay is performed on the “day 0” to generate the baseline reading. At\n          day 6, CTG3D assay is performed on the “screening” plate.\n        \nNote: The following steps are written\n      assuming working on a ViaFlo 96 liquid handle, but can be conducted at",
    "smaller scale following the same principle with an E1 12 channel\n      electronic repeater pipette.\n    \nNote: Consistent, accurate plating of\n      PDxOs is critical to obtain reliable drug screening results. PDxOs will\n      settle quickly in suspension, therefore working quickly through the\n      protocols is essential. This takes a lot of practice.\n    \nNote: Do not perform drug response assay\n      on PDxOs that just thawed or only passaged once. Wait at least two\n      passages to ensure PDxO growth rate is stable.\n    \n        PDxO drug response assay (Figure 9[href=https://www.wicell.org#fig9]).\n        \n            To prepare PDxOs for drug testing, check organoid health, density,\n            and phenotype by microscope.\n          \n            For each 384-well screening plate account for approximately one dome\n            of organoids that have reached an average size of at least 50 μm and\n            up to 100 μm.\n            \n                The number to aim for falls in the range of 60–100 organoids per\n                well, the exact amount can be determined after the dome has been\n                disassociated.\n              \n            To disassociate the dome, aspirate media and incubate in dispase\n            following step 32 with the exception of only incubating for\n            20–30 min instead of 1 h.\n            \nCritical: Short dispase\n              digestion still allows for removal of Matrigel while ensuring\n              organoid structure is maintained.\n            \nNote: It is critical to work\n              quickly and to keep the 384-well plates cool during all following\n              steps.\n            \n            While organoids are incubating in dispase, coat plates with EHS\n            matrix:\n            \n                To prepare 384-well plates, chill them for 1 h at 4°C to avoid\n                polymerization of EHS-derived matrix.\n              \nPut plates on ice and keep plates cool during all steps.\n                If plates are pre-chilled for 16 h, plates don’t need to be kept\n                on ice during this step if it is ensured that one operates\n                quickly to avoid polymerization.\n              \n                Pre-chill a 150 mL reservoir by stacking it onto a 300 mL\n                reservoir filled with ice.",
    "Calculate total volume needed for 10 μL of EHS-derived matrix\n                per well.\n              \n                Fill EHS-derived matrix into 150 mL reservoir and keep cool.\n              \n                While keeping plates cool, deposit 10 μL of EHS-derived matrix\n                as base layer into each well using a ViaFlo 96, or a 12 channel\n                electronic repeater for smaller scale drug screening.\n              \n                Spin the plates (1200 × g, 1 min, 4°C) to ensure\n                EHS-derived matrix settles into bottom of plate, creating even\n                base layers.\n                \nCritical: Even EHS-derived\n                  matrix distribution is critical and the basis for successful\n                  drug screen.\n                \nPrepare 1 extra 384-well plate with EHS matrix coating.\n                This plate will be used to measure PDxO metabolic activity prior\n                to drug treatment - referred to as “day 0” plate.\n              \nIncubate plates at 37°C for 10 min – 1 h.\n                If plates won’t be used within 1 h, keep on ice and then\n                incubate at 37°C for 10 min directly prior to organoid plating.\n              \nTransfer dissociated organoids into a 15 mL conical tube.\nFill the conical tube up to 15 mL with PDxO base medium.\nCentrifuge at 300 × g for 3 min to pellet cells.\n            Discard supernatant and resuspend pellet with 15 mL with PDxO base\n            medium.\n          \n            Centrifuge at 300 × g for 3 min to pellet cells.\n            \nCritical: Two washes are\n              required to remove trace amounts of residual dispase remaining.\n              Residual dispase will quickly digest any Matrigel added to\n              screening wells.\n            \n            Plate PDxOs onto one well of a ULA 6-well plate in 5 mL PDxO\n            complete media.\n          \nIncubte plate at 37°C until plating.\n            To plate PDxOs, count the organoids:\n            \nMix organoids by gently pipetting up and down with P1000.\n                With a P20 pipette, remove 5 μL and drop onto hemacytometer\n                without adding a cover glass.\n              \n                Under the microscope count all organoids in the 5 μL drop.",
    "Multiply organoid count by 200 and by the total volume (mL). For\n                example, if organoids are resuspended in 5 mL multiply count by\n                1,000 to calculate total organoid number.\n                \nCritical: Due to their\n                  large size, organoids cannot be loaded onto a hemocytometer by\n                  standard methods as they cause clogging upon loading which\n                  leads to inaccurate counts. In our hands, the counting slides\n                  used with automated cell counters also clog and lead to\n                  inaccurate organoid counts.\n                \n            Prepare a plating media mix as follows (per plate) and keep on ice:\n            \n700 μL EHS-derived matrix (5% v/v of final mix).\n14 μL Y-27632.\n13.3 mL cold PDxO base medium.\n                Any other subtype specific additives needed at the appropriate\n                concentrations.\n                \nNote: As the concentration of\n                  organoids in the ULA plates is now known, pipette the volume\n                  needed to achieve a total number of 23–39,000 organoids into a\n                  15 mL conical tube. This will result in 60–100 organoids/well\n                  in a 384 well plate.\n                \nResuspend the pellet in 1 mL of PDxO base media.\nAdd the plating media mix.\n            When preparing more plates scale accordingly.\n            \nCritical: Modulating Y-27632\n              concentration during screening can adversely affect growth of\n              PDxOs during screen.\n            \nCritical: Removing Y-27632\n              during plating can cause substantial decrease in viability and\n              growth during the screening process.\n            \nCritical: Reducing the FBS\n              concentration adversely affects the growth of some PDxO lines\n              during screening.\n            \n            Remove 384-well plate with Matrigel base layer from incubator.\n          \n            Mix and transfer 14 mL plating master mix containing organoids to a\n            25 mL reservoir, on ice.\n            \nCritical: Using a larger\n              volume will generally result in a drastic reduction in mixing\n              efficiency, leading to uneven seeding densities across a 384 well\n              plates. Using larger volumes may therefore require more mixing.\n              Troubleshooting 10[href=https://www.wicell.org#sec6.19].\n            \n            Mix organoid master mix in reservoir gently, but thoroughly, using",
    "an E1 12 channel electronic repeater pipette set to mix 300 μL, 3×,\n            and max speed (10) in between dispenses.\n          \n            Immediately after mixing, plate 30 μL master plating mix per well in\n            384-well plates onto matrix base layer. Use an E1 12 channel\n            electronic repeater pipette set to 8×, 30 μL.\n          \n            Repeat step 47r-u for each 384 well plate.\n            \nCritical: Organoids settle\n              very quickly. Plating should be done immediately after the mixing\n              step. Delays will cause organoid sedimentation within the pipette\n              tips. This will lead to a high to low density gradient. If this\n              phenomenon is observed we recommend decreasing the volume plated\n              in between mixing. If plating orthogonally to the drug gradient\n              this possible effect can confound results. We recommend plating in\n              the same direction as the column with the vehicle control, which\n              will unveil this trend if it happens.\n            \n            From remaining organoid master mix, plate 16 wells (30 μL/well) into\n            a 384-well “day 0” plate, using the same mixing/plating technique as\n            above.\n            \nCritical: The “day 0”\n              pretreatment plate is needed for normalization and quality\n              control, without it growth rate inhibition (GR) metrics after\n              Hafner et al.6[href=https://www.wicell.org#bib5] can’t be calculated.\n              It will be also used to determine the fold growth for each PDxO\n              line on each plate.\n            \n            Plate 500 μL from remaining PDxO plating master mix onto a 48 well\n            plate. Use a microscope to observe if organoid structure was\n            maintained during plating.\n            \nNote: If all organoids break into\n              single cells, expect increased drug sensitivity\n            \n            Incubate all 384 well plates at 37°C for 16 h.\n            \nPause point: Allow the\n              PDxOs to incubate for 16 h.\n            \n            On the following day, assay the “day 0” plate with CTG3D:\n            \n                Add 30 μL of warm PDxO base medium to each well using an E1 12\n                channel electronic repeater pipette.\n                \nCritical: Adding media at",
    "this step ensures equal volumes in plates measured at day 0\n                  and day 6.\n                \n                Add 15 μL of CTG3D to each well using an E1 12 channel\n                electronic repeater pipette or ViaFlo 96 liquid handler\n                if > 5 plates are prepared.\n              \nShake for 20 min at 500 rpm in the dark.\nRead luminescence signal on plate reader.\n            Drugs are added to the screening plates in 30 μL PDxO media, which\n            results in a total volume of 60 μL per screening well, thus we\n            prepare a mastermix with twice the final concentration needed per\n            well.\n          \n            Dosage points are done in quadruplicates, so that one well of a\n            master mix will dose four wells in the screening plate. Drug\n            dilutions are then prepared in 96 deep well plates with volume\n            enough to dose the required number of organoid screening plates.\n          \n            Drug dilution is set as a descending gradient by rows, with H being\n            the highest and A the lowest. A null concentration is not done as a\n            whole column is dedicated per plate of drugs to ensure a proper\n            solvent control; this results in a total of 11 drugs plus solvent\n            control per screening plate.\n          \n            Drug stocks are prepared to 20 mM and in DMSO while possible.\n            Prepare drug solutions according to manufacturer specifications.\n          \n            Deep well plates are prepared as follows (extra 15% volume is needed\n            for dead volumes):\n            \n                4 × 30 per screening plate μl PDxO base media (with the same\n                additives as when plated) in rows G-A.\n              \n                ((4 × 30)× fold dilution factor) per screening plate μl PDxO\n                base media (with the same additives as when plated) in row H.\n              \n                Appropriate amount of a 20mM stock solution of the drug needed\n                per column to reach double the desired initial concentration in",
    "screening plate, added to row H. Mix by pipetting at least half\n                the volume of the well three times.\n              \nDilute by chosen fold factor from rows H-A.\nCritical: Drug concentrations\n              will dilute 2-fold when added to PDxO containing wells. It is not\n              feasible to aspirate from wells containing PDxOs in 384-well\n              plates without disturbing PDxOs, which are generally only loosely\n              attached to the Matrigel base layer.\n            \nCritical: Include a vehicle\n              control for each solvent used for drug dilutions.\n            \nCritical: Include Y-27632 in\n              drug dilutions at 1×, to maintain Y-27632 at 1× in treatment\n              wells, promoting optimal PDxO growth during the assay.\n            \n            Add 30 μL of drug solution to each well. For optimal efficiency, use\n            a ViaFlo 96 liquid handler to efficiently apply drugs to multiple\n            PDxO plates.\n          \n            We typically set up quadruplicate technical replicates for each drug\n            per concentration.\n          \n            Discard lids and seal plates with breathe-easy film.\n            \nCritical: Breathe-easy film\n              has two layers. The top layer must be removed after applying to\n              the plate to allow gas permeabilty.\n            \n            Incubate 384 well plates at 37°C for 6 days.\n            \nCritical: Incubate plates as a\n              single layer, do not stack plates!\n            \nTo perform CTG3D assay, remove seals from plates.\nAdd 15 μL of CTG3D to each well with ViaFlo 96.\nShake for 20 min at 500 rpm in the dark.\n            Read luminescence signal on plate reader (Envision).Drug\n            screening data can be visualized as heatmaps that represent either a\n            fold change normalized to control or different parameters calculated\n            from GR metrics6[href=https://www.wicell.org#bib5] that allows\n            comparison of drug sensitivity results across lines with a wide\n            range of growth rates, unlike other traditional metrics. In doing so\n            the average response to a specific drug can be established and\n            outliers identified.\n          \n        Data analysis of PDxO drug response assay.",
    "To determine the fold change, divide all data by the average\n            metabolic signal across all “day 0” pretreatment control wells,\n            specific to each PDxO line plated.\n          \n            The resulting values in vehicle controls indicate maximum growth of\n            PDxOs during the screen. Troubleshooting 11[href=https://www.wicell.org#sec6.21].\n            \nNote: At this step, the vehicle\n              control fold change values should ideally be around 2 in order to\n              consider the drug screen successfully conducted on growing\n              organoids, with a minimum value of 1.5. Vehicle control fold\n              changes < 1.5 indicate poor PDxO growth and resulting data may\n              not represent true drug responses.\n            \n            Values ranging from 1 to maximum growth (typically < 4 fold\n            growth) indicate a partial cytostatic effect to no response.\n          \n            Values of 1 indicate a complete cytostatic effect, and values < 1\n            indicate a cytotoxic effect of a compound.\n            Troubleshooting 12[href=https://www.wicell.org#sec6.23],\n            Troubleshooting 13[href=https://www.wicell.org#sec6.25].\n          \n            For quality control, compare vehicle growth on each plate containing\n            the same PDxO line. Growth in vehicle control should not vary\n            significantly between plates.\n            Troubleshooting 14[href=https://www.wicell.org#sec6.27].\n          \n            To confirm drug responses, repeat screen across 3 biological\n            replicates Troubleshooting 15[href=https://www.wicell.org#sec6.29].\n          \n            To calculate GR metric parameters, format the data accordingly and\n            run pipeline online using the open source software (https://doi.org/10.18129/B9.bioc[href=https://doi.org/10.18129/B9.bioc.GRmetrics].GRmetrics[href=https://doi.org/10.18129/B9.bioc.GRmetrics]7[href=https://www.wicell.org#bib6]) or with an R package following instructions from Clark et al.4[href=https://www.wicell.org#bib7]\nTroubleshooting 16[href=https://www.wicell.org#sec6.31],\n            Troubleshooting 17[href=https://www.wicell.org#sec6.33].\n            \nNote: Data can also be analyzed\n              more traditionally, by normalizing to metabolic signal in vehicle\n              at end-point\n            \nCritical: We recommend using\n              the GRaoc metric as it doesn’t require polynomial fitting and thus\n              is free of artifacts caused by experimental noise, which is common\n              on organoid screening. Additionally, it discriminates changes in\n              both potency and efficacy unlike other metrics.\n            \nOptional:\nThis protocol can also be modfied to investigate wether drug\n                combinations show synergistic effects in\nPDxOs following the examples in Guillen et al.1[href=https://www.wicell.org#bib1] and Truong et al.8[href=https://www.wicell.org#bib8]"
  ],
  "subjectAreas": [
    "Cancer",
    "Cell Culture",
    "Cell-Based Assays",
    "Organoids",
    "Model Organisms"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}