{
  "id": 7714,
  "origin_website": "Bio",
  "title": "Measuring Intracellular H<sub>2</sub>O<sub>2</sub> in Intact Human Cells Using the Genetically Encoded Fluorescent Sensor HyPer7",
  "procedures": [
    "An overview of the procedure is depicted in Figure 1.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20221019/20221019181442_2886.jpg Figure 1. Schematic representation of the steps in the HyPer7 measurement protocol. Cells are seeded in 96-well plates. We describe two different experiments, one where the response upon addition of external bolus H2O2 is assessed (experiment A), and one where H2O2 is locally generated by DAO (optional experiment B). Data are acquired on a Cytation 3 automated multi-well microscope setup that allows culturing cells at 37 °C in the presence of 5% CO2. After data acquisition, data must be processed (raw data analysis) and then further analyzed for presentation.Cultivation of HEK293 cells (day 1) (see Note 1)Flp-In T-Rex HEK293 cells are cultured in high-glucose DMEM medium-complete containing FCS and a penicillin/streptomycin antibiotic mixture. HEK293 cells are cultured on 100 mm dishes in 10 mL of DMEM medium-complete until 90% confluency. For the described experiment, HEK293 cells are plated on a poly-L-lysine–coated 96-well plate in 100 µL of DMEM medium-complete.Transfer a 96-well plate from the package together with the poly-L-lysine to a surface-sterilized laminar flow hood class II.Take a 10 mL pipette, and dropwise add poly-L-lysine until the surface is fully covered. Let it sit at room temperature for 5 min.Remove the poly-L-lysine carefully using a 1 mL pipette, as it can be reused up to approximately five times. Transfer the coated 96-well plate to an incubator at 37 °C and 5% CO2 and let it dry for a minimum of 1 h.Cultivate HEK293 cells on 100 mm dishes in 10 mL of DMEM medium-complete in an incubator at 37 °C and 5% CO2 until they reach 90% confluency.Transfer the sterile DMEM medium-complete, sterile DPBS, and sterile Trypsin-EDTA to a surface-sterilized laminar flow hood class II. Preheat all solutions to 37 °C.",
    "Before seeding, transfer the coated 96-well plate to the laminar flow hood. Wash the plate three times carefully with preheated DPBS.Transfer the dishes to the laminar flow hood.Remove the media using an autoclaved disposable glass Pasteur pipette and a vacuum pump.Wash the cells carefully by adding 5 mL of sterile DPBS at the edge of the dish using a serological pipette and a pipette boy.Remove the DPBS using an autoclaved disposable glass Pasteur pipette and a vacuum pump.Add 1 mL of sterile Trypsin-EDTA onto the cells using a 1 mL sterile filter pipette tip.Incubate the dish at 37 °C and 5% CO2 for 5 min until the cells detach. Flick the dish with the palm of your hand.Transfer the dish back into the laminar flow hood, and add 4 mL of DMEM medium-complete using a 5 mL serological pipette.Singularize the cells using a 5 mL serological pipette and a pipette boy.Transfer the cell suspension to a 15 mL Falcon tube, and transfer 20 µL of this cell suspension to a 1.5 mL Eppendorf tube for counting.Determine the concentration of cells using the small aliquot of cell suspension with a cell counter or hemocytometer using Trypan Blue.Dilute the cell suspension so that they are at a concentration of 4,000 cells/100 µL. Of this solution, 100 µL needs to be seeded per well. Total volume depends on the number of wells needed. Try to avoid seeding the outer wells due to evaporation.Seed the diluted cell suspension using a reservoir, sterile filter pipette tips, and a multichannel pipette.Incubate the plate in an incubator at 37 °C and 5% CO2.Transfection of HEK293 cells (day 2) (see Notes 2 and 3)The day after seeding, cells are transfected with the sensor of interest.",
    "If more wells are transfected with the same sensor, a transfection master mix is prepared in a 1.5 or 2 mL Eppendorf tube (dependent on the number of wells).Transfer the sterile DMEM medium-pure and sterile DMEM medium-complete to a surface-sterilized laminar flow hood class II. Preheat all solutions to 37 °C.Thaw the plasmid as well as the Polyethylenimine [PEI (1 mg/mL)].Mix 0.05 μg/well of plasmid DNA with 10 μL/well of DMEM medium-pure and incubate at room temperature for 5 min.After the incubation, add 0.15 μL/well of PEI (1 µg/mL final concentration), and vortex for 10 s. Incubate the transfection mix for 10 min at room temperature to ensure the formation of transfection complexes.Transfer the seeded 96-well plate to the laminar flow hood.Add 40 μL/well of DMEM medium-complete to the transfection solution.Add 50 µL of plasmid transfection solution to each well.Incubate the plate in an incubator at 37 °C and 5% CO2.Induce expression of DAO in HEK293 cells [day 3; only if inducible system is used (experiment B)] (see Note 4)Induce the protein expression of the mitochondrial-targeted DAO (mtDAO), which was stably transfected using the Flp-In T-Rex system. DAO will generate H2O2 upon reacting with D-alanine. It does not react with L-alanine.Transfer the sterile DMEM medium-complete to a surface-sterilized laminar flow hood class II. Preheat all solutions to 37 °C.Thaw the doxycycline (DOX).Prepare 1 mL of DMEM medium-complete with DOX 1:100 diluted (from 1 mg/mL stock, final concentration 10 µg/mL) using sterile filter pipette tips.Transfer the 96-well plate to the laminar flow hood.Transfer the prepared DOX solution to a reservoir.Add 10 µL of this solution to each well of the 96-well plate using sterile filter pipette tips and a multichannel pipette.Incubate the plate in an incubator at 37 °C and 5% CO2.",
    "H2O2 measurement (day 4) (see Note 5)Measure the response of the HyPer7 to the addition of bolus H2O2 (experiment A), or if the DAO is expressed by treating with D-alanine or L-alanine (experiment B).Check the filters before starting up the Cytation 3. HyPer7 is measured at excitation levels of 390 nm (±9) and 469 nm (±17.5).Preheat the Cytation 3 to 37 °C with 5% CO2, and set up the measuring protocol accordingly. Experiment A: 60 min steady-state (acquire a picture every 2 to 3 min); injection/addition by hand of 30 µL of H2O2 (range for the initial experiment of 2.5–20 µM of H2O2 final concentration); 60 min measurement (acquire a picture every 1 to 1.5 min); injection/addition by hand of 20 µM of H2O2 (to fully oxidize the HyPer7 sensor); and 30 min measurement (acquire a picture every 1 to 1.5 min).Experiment B: 60 min steady-state (acquire a picture every 2 to 3 min); injection/addition by hand of 30 µL of D/L-alanine (range for the initial experiment of 1–8 mM D-alanine final concentration); 60 min measurement (acquire a picture every 1 to 1.5 min); injection/addition by hand of 20 µM H2O2 (to fully oxidize the HyPer7 sensor); and 30 min measurement (acquire a picture every 1 to 1.5 min).Prepare the H2O2 (experiment A) and D-alanine and L-alanine (experiment B) dilutions in minimal media (without 10% FCS). Consider that further dilution will take place, due to the already present 50 µL of complete minimal media (with 10% FCS) in each well.Prime the injection system with the H2O2, D-alanine, or L-alanine dilution.Transfer the 96-well plate to a working bench, and add distilled water (dH2O) to all the empty outer wells to prevent the evaporation of media.Remove the media of the wells that will be measured.",
    "Do not remove media from wells that will be measured at a later point during the day. With these Cytation 3 settings, it is possible to measure up to 18 wells in the same measurement.Add 50 µL of complete minimal media (with 10% FCS) to each well.Place the 96-well plate in the Cytation 3, and start setting the beacons for each well.After setting the beacons and saving the settings, start the measurement.Add between 10–30 µL of treatment solution. Do not add less volume to ensure that the solutions will properly mix."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}