{
  "id": 17644,
  "origin_website": "Jove",
  "title": "Simultaneous Laryngopharyngeal and Conventional Esophageal pH Monitoring",
  "procedures": [
    "The following study protocol was reviewed and approved by the Ethics Committee of the Medical Faculty of the University of Cologne.\nNOTE: Ensure that the patient arrives NPO for the following gastrointestinal function testing. Perform a high-resolution manometry to determine the exact location of the lower esophageal sphincter (LES) and to rule out esophageal dysmotility disorders such as achalasia. The patient should be off antisecretory medication for at least 7 days prior to ensure a valid pH measurement.\n1. Setting up the esophageal pH monitoring system\nInsert batteries into the esophageal monitoring system.\nConnect the esophageal pH catheter to the device.\nStart the device. Make sure date and time is accurate. Select Start study.\nCalibrate the catheter in solutions with pH 4 and 7 and rinse the probe in water. Set the probe aside for insertion.\n2. Setting up laryngopharyngeal pH monitoring system by first formatting the SD card with patient’s data.\nInsert the SD card into the computer and open the software for laryngopharyngeal pH monitoring (e.g., DataView 4). Add a new patient by clicking on New and typing in all details about the patient. Click Save to save the data to the SD card. Eject the SD card and insert it into the recorder.\nInsert batteries into the transmitter using the supplied screwdriver to remove the cover of the transmitter case and install a new CR1632 lithium coin battery.\nInsert two AA batteries into the recorder.\nTurn the recorder on. Use the up/down keys to select Setup. Press any round key to select the Setup mode. Modify the time and date if needed by using the up/down keys to change the digits and any round key to select the respective value. If time and date is correct, select Yes and continue.",
    "Select No when the Recorder asks “Tst PSG Adapter?”.\nSelect Study in the main menu.\nThe transmitter is now detected automatically. Confirm that the correct transmitter is detected and press any round key for confirmation. The transmitter displays the serial number that is paired with the recorder.\nAttach the probe to the transmitter.\n\tNOTE: When connected to the transmitter, the red light-emitting diode (LED) at the probe tip will flash once per second. The LED stops flashing after four hours to conserve battery life.\nSelect Hydrate for the calibration process. Hydrate the probe with the provided clear water solution by placing the probe tip in the clear water solution and agitating briefly. Press any round key to start the hydration process.\n\tNOTE: The Recorder will display “Hydrating” and will count down from “300 seconds” to zero or will transition to 15 seconds countdown when the recorder detects that the probe is hydrated. Set the probe aside for insertion.\n3. Placing the esophageal pH catheter first\nEnsure that the patient is sitting upright, looks straight and swallows periodically. Provide a small glass of water with a straw to assist swallowing.\nAsk the patient which side of their nose is clearer and easier to breathe through.\nApply a topical gel that contains a local anesthetic to the probe shaft for ease of insertion.\nInsert the Probe through the patient’s nose, straight in and not up. A measuring scale on the probe shaft helps to determine the correct position.\n\tNOTE: The correct position is 5 cm above the LES as previously determined by high resolution manometry.\n4. Securing the esophageal pH catheter\nSecure the probe as closely to the nares as possible to ensure that it does not move during the study using surgical tape.",
    "Attach the probe to the cheek, near the nose.\nLoop the probe over the ear and use tape to affix the probe to the neck, behind and below the ear.\n5. Placing the laryngopharyngeal pH catheter\nEnsure that the patient is sitting upright, looks straight and swallows periodically.\nApply a topical gel that contains a local anesthetic to the distal end of the probe shaft for ease of insertion.\nCaution: DO NOT apply topical gel to the probe tip where the sensor is located.\nInsert the probe through the patient’s opposite nostril of the esophageal catheter, straight posteriorly and not up.\n\tNOTE: The round probe tip will help it curve around and through the velopharyngeal port into the oropharynx. The distance from the patient’s nares to the oropharynx can often be estimated by using the distance from the nares to the earlobe.\nConfirm that the red light is clearly visible, lateral to or slightly below the uvula. Use a tongue depressor for clear visibility if needed.\n\tNOTE: If the patient’s gag reflex is triggered, retract the probe to a higher position in the oropharynx.\n6. Securing the probe and transmitter\nSecure the probe as closely to the nares as possible to ensure that it does not move during the study using surgical tape.\nAttach the probe to the cheek, near the nose.\nLoop the probe over the ear and use tape to affix the probe to the neck, behind and below the ear.\nAttach the transmitter to the patient’s clothing with the clip-on transmitter carrying case.\n7. Ensuring that simultaneous pH measurements are performed\nMake sure the internal clocks of both pH measurement devices are synchronized. Manually adjust the times if needed.\nStart esophageal and laryngopharyngeal pH studies concurrently. Select a 24-hour study for the laryngopharyngeal pH measuring device.",
    "8. Patient diary and instructions\nAsk the patient to fill out a detailed diary that includes mealtimes, exact time of supine periods and symptoms they experience during the time of the study.\nProvide the following instructions for the 24-hour measurement period to the patient to ensure a successful data recording:\n\tThree mealtimes on day 1 of the study, one mealtime on day 2 of the study.\n\tNo supine periods before 9pm.\n\tEat, drink, and behave as usual (daily activities can be done).\nCaution: Devices are NOT waterproof.\n9. Removing the esophageal and laryngopharyngeal probe after the 24-hour study period is completed\nConcurrently end the study on both devices.\n\t\nEnd the esophageal pH study by pressing the two buttons located in the middle simultaneously until “upload later” appears on the display.\nEnd the laryngopharyngeal pH study by simultaneously pressing the cough, ESC and heartburn button until “complete” appears on the display.\nRemove tape and gently pull out both catheters.\n10. Interpreting the results obtained by the esophageal pH study\nConnect the device to a computer. Open the software used for analyzing results obtained from the esophageal pH measuring device and upload the patient’s study.\nManually type in the patient’s data and the information obtained by the patient’s diary, such as mealtimes, upright and supine periods and symptoms experienced during the study period. Delete any button presses that might have accidentally been performed by the patient during the study period.\nExclude mealtimes from the data analysis.\nOn the report, look at important parameters and thresholds provided to determine an abnormal esophageal acid exposure such as the composite score, the total % pH below baseline (upright and supine) and total number of events.",
    "Calculate a composite score (DeMeester score) for the study period using % time pH < 4 total, upright and supine, total number of events, number of events lasting longer than 5 minutes and the duration of the longest event14. Make sure the report shows the composite score.\n\tNOTE: A DeMeester score > 14.72 displays an abnormal esophageal acid exposure.\n11. Interpreting results obtained by laryngopharyngeal pH monitoring\nInsert the SD card into the computer and open the software used for analyzation of results obtained by the laryngopharyngeal pH measuring system. To upload the study, click on Retrieve.\nManually add the information obtained by the patient’s diary, such as mealtimes, upright and supine periods and symptoms experienced during the study period. Left click on the graph and drag and highlight the area on which you want to add the event and choose the respective event. Delete any button presses that might have accidentally been performed by the patient during the study period.\nExclude mealtimes from the data analysis.\nClick on Report to see a graph displaying acid exposure in the oropharynx during the study period, including supine period, symptoms and mealtimes as well as a study summary.\nOn the report, look at important parameters and thresholds to determine an abnormal oropharyngeal acid exposure such as the composite score, the total % pH below baseline (pH < 5.5 upright and pH < 5 supine) and total number of events.\nCalculate a composite score (RYAN Score) for both the upright and supine period using the % time pH below 5.5 upright and 5 supine, total number of events and the duration of the longest event8. Make sure, a composite score for the upright and supine period is shown in the report.",
    "NOTE: A RYAN Score of > 9.4 upright and > 6.8 supine shows a severely abnormal oropharyngeal acid exposure.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}