{
  "id": 18375,
  "origin_website": "Jove",
  "title": "Ultrasound-guided Botulinum Toxin-A Injections: A Method of Treating Sialorrhea",
  "procedures": [
    "Here, we technically describe the method used for the treatment of sialorrhea in patients with neurological dysphagia. We will not focus on efficacy results, which have been published previously7. In this paper, in the results section, we present data from 5 consecutive patients with long-term follow-up (3 treatment sessions) treated from 2014 to 2016. These patients are considered representative of the entire population, which consists of the botulinum toxin service of San Luigi Gonzaga Hospital. The protocol was approved and follows the guidelines of the local ethical standards committee on human experimentation.\n1. Patients' Recruitment\nNOTE: Patients eligible for this approach are adults suffering from moderate to severe sialorrhea secondary to neurological dysphagia with a history of failure or contraindication to pharmacological treatments such as anticholinergic drugs.\nEnsure that the patient is evaluated by an experienced neurologist before BoNT injection and that the severity and frequency of sialorrhea is assessed with the Drooling Frequency and Severity Scale (DFSS)14.\n\tNOTE: The DFSS score is the sum of the frequency (1 = never, 2 = occasionally/not every day, 3 = frequently/part of the day, 4 = constantly) and severity (1 = never drools, 2 = mild or only lips wet, 3 = moderate or wet on lips and chin, 4 = severe or drool extends to clothes wetting, 5 = profuse or clothing, hands, tray, and objects wet) sub-scores14. A score >2 in both of the sub-scores is used as the eligibility cut-off.",
    "NOTE: The neurologist scores the scale on the basis of objective and anamnestic data provided by the patient and/or caregiver. In addition, the Visual Analogue Scale (VAS) must be administered for the evaluation of the patients' subjective sufferance related to the sialorrhea. The VAS is a self-reported scale represented by a 10 centimeter horizontal line with a statement at each end representing one extreme of the patient's discomfort (from 100 = \"no discomfort\" to 0 = \"extreme discomfort\").\nCollect the number of daily saliva aspirations through a saliva aspirator (when applicable) before BoNT injection, as a useful tool for the evaluation of the therapy efficacy (Figure 1).\nRepeat a neurological evaluation along with the DFSS and a daily saliva aspiration assessment during follow-up, 1, 3 and 6 months after the treatment, or according to the sialorrhea re-occurrence. In particular, retreatment must be taken into account when the number of daily aspirations increases over 50% compared to the 1-month follow-up evaluation.\nCollect procedure adverse events (local pain, local bleeding, and facial palsy) immediately after the injection. Collect therapy adverse events (local pain, facial palsy, chewing weakness, viscous saliva, and dry mouth) during follow-up assessments.\n2. Procedure\nBoNT-A preparation\n\tNOTE: The abobotulinumtoxinA is a botulinum toxin type A of the Clostridium botulinum complex-hemagglutinin. It is a powder for solution for intramuscular or subcutaneous injection.\n\t\nFor the treatment of sialorrhea in adults, reconstitute 500 IU abobotulinumtoxinA with 2 mL of 0.9% sodium chloride solution for injection in order to obtain a solution containing 250 IU/mL of abobotulinumtoxinA.\nAdminister a total of 250 IU of abobotulinumtoxinA per patient as follows: 50 IU in each submandibular gland and 75 IU in each parotid gland. In this way treat two patients with a single vial to avoid drug wastage.\nPatients' preparation",
    "After an adequate explanation of the procedure and of the potential risks and benefits of the treatment, obtain written informed consent from the patient.\nPlace the patient on the ultrasound table in the supine position and possibly with the neck extended.\n\t\tNOTE: Consider that not all neurological conditions leading to sialorrhea allow for the complete extension of the neck.\nDisinfect the skin in the area over the parotid and the submandibular glands with an antiseptic. Anesthetize each skin access site with ethylene chloride spray.\nUltrasound guidance\n\tNOTE: An ultrasound-guided procedure with a linear transducer (5 - 10 MHz) is used for gland localization in order to obtain real-time visualization of muscles, glands, bigger vessels or salivary ducts, and other surrounding structures, as well as of the correct needle position within the glandular tissue.\n\t\nTurn on the ultrasound system and press the \"Start-end\" button to begin the exam.\nPress the \"Probe\" button to select the high frequency probe (5 - 10 MHz).\nPress the \"Patient\" button and insert the patient's name and surname.\nPress the \"Protocol\" button to select the appropriate protocol and sub-protocol (i.e., protocol: \"small tissues\", sub-protocol: \"general\").\nPress the \"Depth\" button and specify the depth of view to 5 cm.\nPress the \"Focus\" button to select the maximum detail of 2 cm.\nPlace the transducer under the mandible, between the anterior and posterior bellies of the digastric muscle, to visualize the submandibular gland, which appears as a hypoechoic area with homogeneous echotexture compared to the surrounding tissues.\n\t\tNOTE: Consider the submandibular gland ideally divided into two quadrants, one cranial and one caudal. Identify the widest gland diameter for the lateral needle access.",
    "Place the transducer below the external acoustic meatus to visualize the parotid gland, which appears as a hypoechoic area with homogeneous echotexture compared to the surrounding tissues.\n\t\tNOTE: Consider the parotid gland ideally divided into four quadrants, two cranial and two caudal. Identify the two access sites for injection midway between the external auditory canal and the mandible angle, one in the cranial part and one in the caudal part of the gland (Supplemental Figure).\nBoNT-A injection\n\tNOTE: Use a 22 G needle for injections, with needle penetration at least 0.5 cm from the transducer. The transducer must be oriented longitudinally to the needle so that the needle is visible as a bright echoic line. In this way, the penetration of the needle into the soft tissues can be monitored during the procedure as the needle tip proceeds towards the target, preventing injuries to neurovascular structures.\n\t\nUse a lateral short-access approach at the widest gland diameter to access the submandibular gland.\nInject 25 IU BoNT-A into the upper submandibular quadrant. After the injection, slightly retract the needle and change the direction of the needle tip towards the lower submandibular quadrant, injecting 25 IU BoNT-A for a total of 50 IU to each submandibular gland.\n\t\tNOTE: In this way, two submandibular areas (cranial and caudal) are injected, providing a widespread diffusion of the drug within the glandular tissue.\nUse two access sites for the parotid gland injection. Identify the two accesses midway between the external auditory canal and the mandible angle, one in the cranial part of the gland and one in the caudal part of the gland.",
    "Using the upper access (in the cranial part of the gland), inject 18 - 19 IU BoNT-A into the medial-cranial quadrant. After the injection, slightly retract the needle, without leaving the site of the cranial part of the gland, and change the direction of the needle tip towards the lateral-cranial quadrant; inject 18 - 19 IU BoNT-A.\nUsing the lower access (in the caudal part of the gland), inject 18 - 19 BoNT-A IU into the medial-caudal quadrant. After the injection, slightly retract the needle, without leaving the site of the caudal part of the gland, and change the direction of the needle tip towards the lateral-caudal quadrant; inject 18 - 19 IU BoNT-A.\n\t\tNOTE: In this way, four parotid areas (medial-cranial, lateral-cranial, medial-caudal and lateral-caudal) are injected with a total of 75 IU BoNT-A, providing a widespread diffusion of the drug within the glandular tissue.\nAfter each injection, dab any bleeding with sterile gauze for 1 - 2 min. Re-evaluate the patient after one hour for any potential adverse events. Administer a nonsteroidal anti-inflammatory drug in case of persisting pain. Schedule a follow-up examination after 1 month.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}