{
  "id": 8939,
  "origin_website": "Jove",
  "title": "A Familiarization Protocol Facilitates the Participation of Children with ASD in Electrophysiological Research",
  "procedures": [
    "All procedures have been approved by the appropriate research ethics committee at Southern Connecticut State University and Yale University, with consent from participants.\n1. Create a Social Narrative\nimgsrc://cloudfront.jove.com/files/ftp_upload/55941/55941fig1.jpg\nFigure 1. Social Narrative. A sample social narrative, read to the participant prior to the first appointment and by the researcher prior to initiating the experiment and obtaining consent.\nNote: Sections 1, 2, and 3 present the tools that were developed for the familiarization protocol.\nCreate a social narrative that includes images and a short description of each step of the research protocol created by the researchers, starting with consent and ending with compensation (if applicable) and a short explanation.\n\tNOTE: When possible, the image used should have high iconicity (iconicity refers to the degree to which a symbol represents its referent)3 to facilitate the understanding of the participant. Follow the steps for developing the social narrative (adapted from Myles, Trautman, and Schelvan)15.\n\t\nIn the social narrative, describe in sequential order the research activities from the participant's perspective. Write the story in first-person or second-person language and use either present or future tense.\n\t\t\nIn the description, include: a) where the activity will occur; b) what the participant will do; c) what the researchers will do; d) why the participant will complete each activity; and e) the possible thoughts or feelings of the researchers or the parents, if applicable (i.e. \"we're happy that you came;\" \"calm when you wait for directions;\" or \"Mom is happy that you can help.\")\nSelect pictures that are iconic to use within the social narrative to increase the understanding of the participant (i.e., the building, the room, the EEG cap, and the researchers).",
    "Place the social narrative into a presentation software (e.g., PowerPoint), including the iconic pictures. Use the presentation mode to show the narrative to the child as a story on a computer, or present it as a printed version.\nSend the social narrative to the parent/caregiver by mail or email before the participant comes to the research appointment.\n\t\nAsk the parent or guardian to read the social narrative to the participant at least 3 times before the first visit of the research study.\n2. Create a Visual Schedule\nimgsrc://cloudfront.jove.com/files/ftp_upload/55941/55941fig2.jpg\nFigure 2. Visual Schedule. A sample visual schedule, presented to the participant after obtaining consent and before initiating the first step of the experiment, as well as before and after the completion of each activity.\nCreate a visual schedule that outlines each activity of the research protocol. Ensure that the visual schedule includes different cards, with pictures that represent each activity and a one- to three-word description printed under each picture (adapted from Hodgdon)10.\n\t\nWithin the visual schedule, include a card with a picture that represents a break, along with the written description, \"Take a break.\"\nWithin the visual schedule, include a card with a picture that refers to being finished or all done; this card may include the word \"stop\" or \"finish\" printed in red font.\n\t\tNOTE: The activities outlined in the visual schedule should be the same as those described in the social narrative. The written language and pictorial representations provided through these two tools should be consistent.\n3. Create Emotion-rating Scales\nimgsrc://cloudfront.jove.com/files/ftp_upload/55941/55941fig3.jpg\nFigure 3. Self-rating Emotion Scale. A sample self-rating emotion scale, which is used by the participant to rate his/her state of emotion. The researcher uses a separate scale to rate the participant's emotion. Please click here to view a larger version of this figure.[href=http://cloudfront.jove.com/files/ftp_upload/55941/55941fig3large.jpg]\nimgsrc://cloudfront.jove.com/files/ftp_upload/55941/55941fig4.jpg",
    "Figure 4. Researcher's Rating Scale. A scale used to make sure that the participant's rating is consistent with outward observed behavior. This scale is to be completed by a researcher that is in the room with the child participant. Please click here to view a larger version of this figure.[href=http://cloudfront.jove.com/files/ftp_upload/55941/55941fig4large.jpg]\nCreate a scale that depicts a range of 5 emotions, with pictorial representations and/or written words. Select emotions that are relevant to supporting the participant with engaging in the activities in the given research protocol (i.e. emotions related to anxiety, pleasure, disgust, etc.).\n\tNOTE: The emotion vocabulary and selected icons should match the developmental levels of the participant (adapted from Dunn-Buron and Curtis)7.\n\t\nInclude an action that the participant may complete to maintain positive emotion in one column and label it \"What I can do\" (see Figure 3).\nInclude a smiley or picture of a face in a separate column and label it \"How I feel.\"\n\t\tNOTE: All five emotions listed under the \"How I feel\" column should correspond with the \"What I can do\" column (i.e., on the \"How I feel\" column, \"I am confused and getting irritated\" would correspond with \"Ask to take a break\" under \"What I can do.\")\nCreate a Likert-type scale for rating emotions to be used by the researcher (see Figure 4) (adapted from the Positive and Negative Affect Schedule (PANAS)21.\n\tNOTE: Below are the steps to follow when implementing the familiarization tools over two visits to complete the research protocol.\n4. Visit 1: Social, Cognitive, and Language Assessments\nGreet the participants and bring them to an area with various toys (see Figure 5) in a designated \"play area.\" Ensure that the participant is comfortable within the setting.\nimgsrc://cloudfront.jove.com/files/ftp_upload/55941/55941fig5.jpg",
    "Figure 5. Welcoming the Participant to the Visit. Researcher playing with participants, familiarizing them to the environment and getting them accustomed to the context.\nShow the participant the 5-point emotion-rating scale (see Figure 3) and ask them to point to the picture that best represents how they feel.\nAsk the participant how they feel and support the participant in saying \"I feel _____,\" while pointing to the corresponding emotion on the scale (see Figure 3).\n\t\nIf the participant selects a 1 or 2, move to step 4.4. If the participant selects a 3 or 4, ask the participant to follow the suggested action under the \"What I can do\" section (see Figure 3).\nGive the participant 5 min to follow the suggested action.\nAfter 5 min, ask the participant rate how they feel, again. If they select 1-3, continue the session. If they select 4 or 5, end the research appointment and ask the participant to decide to come back on a different day or not to come back at all.\n\t\tNOTE: See step 3 for creating the emotion-rating scale. The researcher is to rate the participant's emotions on a separate scale at the same time (Figure 4) to ensure that the participant is appropriately rating their emotion state.\nSit next to the participant and read and review the social narrative with them (see Figure 1). Say \"we will look over all the games that we will be playing today; ask me questions if there is a game that you are not sure of.\"\nFollowing the review of the social narrative, assess the participant's emotional state and readiness to continue with the research by asking, \"How do you feel?\" while showing them the self-rating emotion scale (Figure 3).",
    "At the same time, ask the research assistant to use a separate scale to rate the participant (see Figure 4) to ensure that some of the anxiety (if any) has been reduced.\nHand a consent form to the parent and read the assent form with the child participant (if they cannot read it independently).\nAsk the participant if they would like to continue and complete the activities described in the social narrative.\nAsk the participant to sign the consent form.\n\tNOTE: The participant should only be asked to sign if they agree to participate. If the participant says no, offer to read the social narrative again to ensure that the participant understands the requests being made.\nIntroduce the participant to the visual schedule, stating, \"These (pointing to visual schedule pictures) are all of the games that we will be playing today. At the end of each game, you can take down the card for that game.\"\n\t\nPoint to the \"Take a Break\" card and say, \"You can also use this card if you need to take a break;\" point to the \"STOP\" card and say \"or this card if you do not want to play any more games for today.\"\nArrange the schedule so that all social, cognitive, and language assessments are completed prior to the final activity.\n\t\nPeriodically, at the discretion of the researcher and based upon the attending behavior of the participant, implement a modified use of the Premack principle by stating, \"Remember, first (activity name), then you may take a break.\"\n\t\tNOTE: This modified version of the Premack principle involved giving the child the preferred activity after the third attempt, even if the child did not complete the less preferred activity. Therefore, the participant is compensated for their time even when they do not complete the experiment.",
    "Once the participant has completed half of the assessments, evaluate the participant's emotions using both emotion-rating scales (as described in step 4.5); ensure that the participant maintains a level 1 or 2 emotion rating prior to continuing activities.\n\t\nIf the participant is at a higher level on the self-rating emotion scale, follow the action on the scale under the \"What I can do\" section.\nimgsrc://cloudfront.jove.com/files/ftp_upload/55941/55941fig6.jpg\nFigure 6. Bear used as Sample for Wearing the Cap. Demonstration of the bear wearing the cap, allowing the participant to explore wearing the cap and holding the bear while it wears the cap, done before the participant is asked to wear the cap.\nEEG data acquisition simulation.\n\t\nIntroduce the participant to a stuffed bear (or doll, or any other toy of choice), and model the use of the EEG cap (see Figure 6) on it. Read to the participant, the section in the social narrative that describes use of the cap to the participant.\nShow the participant how the cap is placed on the bear's head. Allow the participant to touch the cap and interact with it by placing it on the bear's head (if needed).\nApply a modified version of the Premack principle by saying, \"First, try the cap. Then, you will be given a gift card.\" If the participant says no, suggest the \"First, then\" statement one more time. If the participant says yes, continue to step 4.12.4.\n\t\t\nIf the participant continues to say no, compensate the participant for their time (if applicable). If the participant agrees to wear the cap, continue to step 4.12.4.",
    "With a tape measure, measure the participant's head circumference to determine the cap size. After this initial measurement, measure from a location on the back of the skull (inion) to a location between the eyebrows above the nose (nasion), and from the right to left ear (using the tragus).\n\t\tNOTE: This is done to identify the scalp vertex reference point for the placement of the Cz electrode. These steps are designed to be as similar to the actual acquisition protocol, which uses this procedure to maximize similarity of electrode placement across the scalp across participants.\n\t\t\nMark the vertex reference point with a washable magic marker.\nSoak the appropriate-size cap in water with a potassium chloride solution and baby shampoo.\nPlace a towel around the participant's neck to prevent water from dripping on their clothing. Tell the participant to close their eyes while the cap is being placed on their head.\nAdjust the cap on the participants' head so that it is comfortable for the participant (see Figure 7). Once the cap is placed on the head and adjusted, let the participant known that they can open their eyes.\nHave the participant practice wearing the cap and sit in front of a screen to watch a movie for at least 10 min (see Figure 8). If this step is completed successfully, invite the participant to come back for a second appointment.\n\t\tNOTE: Participants had to wear the cap for approximately one hour during the actual research appointment. However, breaks were built into the experiment every 3 minutes.\nimgsrc://cloudfront.jove.com/files/ftp_upload/55941/55941fig7.jpg\nFigure 7. Placing the EEG Cap on the Participant. The researcher capping the participant to practice wearing the cap; this is the role-play portion of the protocol, when the participant wears the towel.\nimgsrc://cloudfront.jove.com/files/ftp_upload/55941/55941fig8.jpg",
    "Figure 8. Adjustment of the EEG Cap. The participant is wearing the cap while the researcher adjusts it to make sure that the participant is comfortable.\nFollowing the final activity, assess the participant's emotions one last time (Figures 3 & 4) to ensure that level-1 or -2 emotion has been maintained throughout the protocol and that wearing the cap did not increase anxiety and/or decrease the participant's level of comfort.\n\tNOTE: If any anxiety is present, the researcher should assist the child in following the suggested actions in the self-rating emotion scale (Figure 3).\n5. Visit 2: EEG Data Collection\nNote: As an integral part of the familiarization protocol, throughout the span of the experiment, a research assistant should code the participant's state (i.e. whether they alert or appears anxious; see Figure 4), and participants should provide a self-rating of their emotional state by pointing to a visual representation on an emotion scale (Figure 3).\nPresent the participant with a social narrative that describes the steps of the second appointment. Ask the participant if they are willing to wear the cap and mention, \"like you did last time;\" (see step 1.1.1 for creating the social narrative).\n\tNOTE: If the participant says yes, proceed to step 5.2. If the participant says no, repeat step 5.1 with the parent in the room. If the participant continues to say no, end the experiment.\nPresent the participant with a visual schedule that includes all the EEG data collection procedures (i.e., measuring the head, wearing a towel, and placing the cap on the head).\n\tNOTE: See step 2.1 for creating a visual schedule; a picture depicting a break is included. Periodically offer the participant the opportunity to take a break to maintain comfort and compliance.",
    "Measure the participant's head circumference and then identify and mark the vertex reference point for the Cz electrode, following the steps outlined in step 4.12, above.\n\t\t\nMark the vertex reference point with a washable magic marker.\nSoak the cap in water with a potassium chloride solution and baby shampoo.\nPlace a towel around the participant's neck to avoid water from dripping on their clothing. Tell the participant to close their eyes while the cap is being placed on their head.\nPosition the appropriate-size cap on the participant and ask them to sit in a comfortable position.\nOnce the ERP waves can be seen on a computer screen, ask the participant to blink and move their hands and feet. Then, have the child look at the distortion that is created in the ERP waves when they move.\nStart the stimulus presentation and ask that the participant sit very still, \"like a statue;\" point to a visual sign that shows a child sitting still, along with the text, \"sit still, like a statue.\" Use the Premack principle as needed.\n\tNOTE: See step 4.9 for the use of the Premack principle.\nAfter completing the EEG portion of the experiment, provide the participant with the promised compensation and thank them for their participation.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}