{
  "id": 10884,
  "origin_website": "Jove",
  "title": "Fabrication of a Bioactive, PCL-based \"Self-fitting\" Shape Memory Polymer Scaffold",
  "procedures": [
    "1. Synthesizing PCL-DA Macromer\nRun the acrylation reaction.\n\t\nWeigh 20 g of PCL-diol (Mn = ~10,000 g/mol) into a 250 ml round bottom flask equipped with a Teflon-covered magnetic stir bar.\nDissolve the PCL-diol in DCM.\n\t\t\nAdd 120 mLlof DCM to the flask (concentration = 0.17 g/ml).\nPlace a rubber septum loosely into the neck of the flask so as to avoid pressure build-up while also preventing evaporation of DCM.\nStir solution for ~30 min at ~250 rpm to completely dissolve the polymer.\nAdd ~6.6 mg of 4-dimethylaminopyridine (DMAP) to the solution and dissolve with stirring.\nPlace a rubber septum securely into the neck of the flask. Allow the solution to continue stirring.\nThrough the rubber septum, gently purge the flask with N2 for ~3 min by using a positive N2 pressure needle inlet and an open needle as an outlet.\nRemove the N2 inlet and outlet.\nAdd 0.56 ml (4.0 mmol) of triethylamine (Et3N) dropwise via a glass syringe equipped with a needle inserted through the rubber septum.\nAdd 0.65 ml (8.0 mmol) of acryloyl chloride dropwise via a glass syringe equipped with a needle inserted through the rubber septum.\nReturn the N2 inlet to the flask and allow the contents to stir under positive N2 pressure for ~30 min.\nPre-heat an oil bath to 55 ºC.\nAfter the allotted ~30 min, remove the N2 inlet and replace the septum with a condenser.\nSubmerge the flask into the pre-heated oil bath.\nAllow the contents of the flask to stir for 20 hr.\nAfter the allotted 20 hr, remove the flask from the oil bath and allow contents to cool to RT.\nUsing a rotary evaporator, remove DCM solvent from the flask.\nPurify the crude PCL-DA product.",
    "To the flask, add ~135 ml of ethyl acetate and dissolve the crude PCL-DA.\nGravity filter the solution through filter paper into a clean 250 ml round bottom flask. (Note: Solution may thicken on the filter paper, not readily passing through. If so, carefully apply mild heat with a heating gun.)\nUsing a rotary evaporator, remove ethyl acetate solvent from the flask.\nTo the flask, add ~140 ml of DCM and dissolve the crude PCL-DA.\nTransfer contents to a 500 ml separatory funnel.\nTo the funnel, add 13.5 ml of 2 M potassium carbonate (K2CO3).\nCap the funnel. Gently mix the two layers by inverting the funnel and swirling gently once or twice, taking care to release pressure via the stopcock. Repeat 3 times.\nReplace the cap with a layer of Parafilm and allow the mixture to separate O/N (~12 hr).\nCollect the bottom, organic layer into a 250 ml Erlenmeyer flask.\nAdd ~5 g of anhydrous magnesium sulfate (MgSO4) to the flask and gently swirl.\nGravity filter the mixture through qualitative filter paper and into a clean 250 ml round bottom flask.\nUsing a rotary evaporator, remove DCM solvent from the flask.\nDry under high vacuum to remove residual DCM. (Note: PCL-DA should be stored away from light.)\nConfirm acrylation with 1H NMR22,23.\n2. Preparing the SMP Scaffold (Figure 1)\nPrepare the fused salt template.\n\t\nUse a 425 µm sieve to obtain sodium chloride (NaCl) particles ~460 ± 70 µm in diameter. (Note: Average particle size may be confirmed from scanning electron microscopy [SEM] images with ImageJ software .)14\nTo a 3 ml glass vial (I.D. = 12.9 mm), add 1.8 g of the previously sieved NaCl.",
    "Slowly add, in four portions, 7.5 wt% (based on salt weight) DI water (0.146 g) to the vial. Mix with a metal spatula after the addition of each portion of water.\nCap the vial, wrap in tissue and place vertically into a centrifuge tube. Centrifuge for 15 min at 3,220 x g.\nRemove the cap and let air-dry O/N (~12 hr).\nIn a new glass vial, prepare a “macromer solution” by combining 0.15 g of PCL-DA per ml of DCM. (Note: For one scaffold, ~ 1 ml of solution should be prepared.) Cap and mix the solution at high speed on a vortex mixer for ~1 min.\nIn a new 3 ml glass vial, prepare a “photoinitiator solution” based on 10 wt% 2,2-dimethoxy-2-phenyl acetophenone (DMP) in 1-vinyl-2-pyrrolidinone (NVP). Combine 0.115 g of DMP in 1 ml of NVP. (Note: For one scaffold, ~180 µl is required.) Cap, wrap in aluminum foil (to block light) and mix the solution at high speed on a vortex mixer for ~1 min. (Note: If prepared in advanced, the solution should be refrigerated and protected from light.)\nWrap the vial containing the macromer solution (excluding the cap) with aluminum foil (to block light) and add via pipette 15 vol% (based on total volume of the macromer solution) of the photoinitiator solution. Cap and mix the solution at high speed on a vortex mixer for ~1 min.\nWrap the vial containing the fused salt template (excluding the cap) with aluminum foil (to block light) and add via pipette the previously prepared macromer/photoinitiator solution (~0.6 ml or until the template is completely covered).\nCap the vial, wrap in tissue and place vertically into a centrifuge tube. Centrifuge for 10 min at 1,260 x g to distribute the macromer solution throughout the template.",
    "Remove the aluminum foil, uncap the vial and expose to UV light (365 nm, 25 W) for 3 min. Air-dry O/N.\nRemove the “salt-containing scaffold” from the vial with tweezers after scoring and fracturing the top of the glass vial.\nIn a 400 ml beaker, prepare ~200 ml of a water/ethanol solvent (1:1 vol:vol).\nMaintain the scaffold submerged in the water/ethanol solvent for 4 days with daily solvent changes.\nRemove the scaffold from the solvent and air-dry O/N.\n3. Applying Polydopamine Coating to SMP Scaffold (Figure 1)\nIn 400 ml beaker equipped with a Teflon-covered stir bar, prepare ~200 ml of a dopamine hydrochloride solution (2 mg/ml in 10 mM Tris buffer, pH = 8.5, 25 ºC). Stir at ~150 rpm.\nPlace a disposable needle (length = 40 mm; gauge = 20) into the scaffold, ~half the distance through the scaffold. Wrap a wire around the needle hub.\nSubmerge the scaffold (with the needle hub above the solution surface) into the stirring dopamine solution by anchoring the wire to the rim of the beaker.\nDegas the scaffold by placing a syringe into the needle hub and using it to pull air out of the scaffold. (Note: Degassing is complete when no more air can be removed and the solution has completely infiltrated the scaffold.)\nMaintain the scaffold submerged in the stirring dopamine solution for 16 hr.\nRemove the scaffold from the solution and remove the needle. Rinse with DI water and dry in a vacuum oven at RT for 24 hr.\nPlace the scaffold in an 85 ºC oven for 1 hr.\nAllow the scaffold to cool to RT. The final cylindrical scaffold will be ~6 mm diameter x ~5 mm height.\n4. Evaluating “Self-fitting” Behavior",
    "Prepare an “irregular CMF defect model” using a sheet of rigid plastic whose thickness is ~5 mm. Use a drill to create a void within the plastic sheet with an average diameter slightly less than ~6 mm, as demonstrated in Figure 2A.\nIn a beaker, heat DI water (representing the clinical use of saline) to a temperature of ~60 ºC.\nPlace the scaffold into the beaker of ~60 ºC water. Use tweezers to push the scaffold below the water surface, exposing all areas to the water. Continue for ~2 min or until the scaffold is noticeably softened (Figure 2B).\nRemove the scaffold from the beaker and immediately press (by hand) into the model defect.\nAllow to cool to RT (~5-10 min) (Figure 2C).\nRemove from the defect to observe the new, fixed temporary shape and the return of the relatively more rigid state (Figure 2D).\n5. Testing Shape Memory Behavior\nUsing a dynamic mechanical analyzer (DMA; e.g. a TA Instruments Q800 as used herein), run a strain-controlled cyclic-thermal mechanical compression test on a scaffold over two cycles (N) to determine shape fixity (Rf) and shape recovery (Rr) (Figure 3).\n\t\nEquilibrate to 60 °C (Thigh) for 5 min.\nCompress to a maximum strain (εm = 50 %) at 50 %/min.\nHold at εm (5 min).\nCool to 25 °C (Tlow) and maintain for 10 min to fix the temporary shape.\nRemove the load.\nMeasure the ultimate strain in the stress-free state (εu).\nReheat to 60 °C (Thigh) and maintain for 10 min to recover the permanent shape.\nMeasure the recovered strain (εp).\nWhile still at 60 °C (Thigh), start the 2nd cycle (N = 2) by compressing the scaffold to 50 % of the height recovered after the 1st cycle (N = 1).\nRepeat 5.1.3-5.1.8 for N = 2.",
    "Calculate Rf and Rr for N = 1 and 2 using the following equations:\n\t\tRf(N) = [εu(N)/ εm]Rr(N) = [εm - εp(N)]/[εm- εp(N-1)]\n6. Visualizing Pore Size and Pore Interconnectivity\nUsing scanning electron microscopy (SEM; e.g. a FEI Quanta SEM as used herein), observe the pore size and pore interconnectivity.\n\t\nUsing tweezers to hold the SMP scaffold, submerge in liquid N2 for 1 min.\nRemove from liquid N2 and fracture along the middle of the scaffold with a clean razor blade.\nUsing carbon tape, affix one of the SMP scaffold halves onto the sample stage with the fractured surface facing up.\nSputter coat with Au-Pt (~4 nm).\nCapture the SEM image at a recommended accelerating voltage of 10-15 kV ( Figure 4A).\n7. Testing of in vitro Bioactivity\nInto a 50 ml centrifuge tube, add ~30 ml of 1X SBF24.\nObtain a scaffold in its original, cylindrically-molded permanent shape. Cut the scaffold in half (across the circular edge) using a clean blade.\nPlace an individual scaffold half into the prepared centrifuge tube and cap.\nMaintain the tube at 37 °C in a water bath under static conditions with no SBF changes.\nAfter 14 days, remove the scaffold from the SBF and air dry for 24 hr.\nUsing carbon tape, affix the scaffold onto the sample stage with the fractured surface facing up.\nSputter coat with Au-Pt (~4 nm).\nCapture the SEM image at a recommended accelerating voltage of 10-15 kV (Figure 4B).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}