{
  "id": 19463,
  "origin_website": "Jove",
  "title": "Establishing a Mouse Contusion Spinal Cord Injury Model Based on a Minimally Invasive Technique",
  "procedures": [
    "NOTE: All the experiments were approved by the Laboratory Animal Ethical and Welfare Committee of Shandong University Cheeloo College of Medicine (approval number: 21L60) and were performed according to the Guide for the Care and Use of Laboratory Animals published by the National Institutes of Health (NIH Publications No. 85-23, revised 1996).\n1. Mechanism of the spinal cord injury coaxial platform and mechanical tests\nAssemble the platform with a surgical operating table, a vertebral stabilizator, and an impactor tip (Figure 1).\n\tNOTE: Keep the weight drop and exhaust slots, which prevent the weight from encountering air currents, clean, because any dirt on the weight drop or sleeve could affect the precision of the platform.\nPut the tip, which allows for accurate spinal cord locating, into the sleeve.\nSelect proper masses of the weight drops for the experiment, which are 1.3 g, 2.0 g, and 2.7 g for the mild, moderate, and severe groups, respectively.\nPlug the pull pin into the holes of the weight drop.\nAssemble the weight drop to the top of the sleeve with the pull pin fitted in the groove on the X-Y-Z arm so that, once the locating is complete, the weight is released to strike the impactor tip, consequently contusing the spinal cord, and changes in the spinal cord are observed under the microscope.\nAdjust the removable 0.1 mm precision X-Y-Z arm for the operator's convenience to provide adequate working space (Figure 1D, E).\n\tNOTE: To confirm the consistency of the results of the study, before the experiment begins, measure the force generated when the weight is dropped inside the sleeve using a peak pressure detection device. A repeat of confirmation is not necessary for future studies.",
    "Turn on the device, place the metal pressure receptor below the tip, zero the adapter, release the pull pin, and record the actual impact force.\n2. Locating and laminectomy of the 9th thoracic vertebra (T9)\nNOTE: Female C57BL/6J mice 9-10 weeks old were purchased from Jinan Pengyue Experimental Animal Company (Jinan, China).\nAutoclave a suite of surgical instruments for the experiment and sterilize the operating table with 75% alcohol before surgery.\nInject buprenorphine for analgesia (0.05-2.0 mg/kg, SQ) 30 minutes before anesthesia for injury operations. Then, anesthetize the mouse with isoflurane (induction: ~3%-5%, maintenance: ~1.5%-2%). Check if the animal is fully anesthetized by the reflexes of tail or toe pinch. Once anesthesia is in effect, lay the mouse in a prone position in a designated part of the operating table and coat the cornea with ophthalmic ointment (apply ophthalmic ointment to the corneas to protect the eyes from drying during surgery).\n\t\nShave the hair from the caudal to the rostral with an electric shaver over the thoracolumbar spine. Sterilize the skin several times in a circular motion with iodophor for 30 s and followed by 75% alcohol. Apply a sterile surgical drape and make a longitudinal incision of approximately 1.5 cm on the skin from approximately T6 to T13 with a scalpel and blade.\n\t\tNOTE: Palpate along the costal margin to the midline, where the T12-T13 interspinous space is located. Make a 1.5 cm incision to the rostral, and the incision is approximately flush with T6-T13 vertebrae.",
    "Explore the 13th rib on one side from the bony portion under the operating microscope. Explore the spinous process in the midline by lightly touching the area of the costovertebral angle and then toward the rostral to locate the interspinous space of the T12-T13. Explore the interspinous space of the T9-T10 from the space of the T12-T13 to the rostral side. (Figure 2A, 3A)\nDissect the paraspinal muscle along the spinous process of the T9 to the anterior and posterior facet joints of both sides with micro scissors (Figure 3B). Retract the paraspinal muscles with micro-retractors and clean the soft tissue on the lamina and in the interspinous space of the T8-T9 and T9-T10 with micro scissors.\nPerform T9 laminectomy, clamp the spinous process of T9 with microsurgery forceps, slightly lift it up, insert the micro scissors parallelly along the right dorsolateral side of the lamina, avoiding damage to the spinal cord, and cut off the lamina with micro scissors. Repeat on the left side, and the spinal cord can be exposed (Figure 2B, 3C).\nBefore fixing the vertebra, loosen the universal arm, and slowly clamp the 9th to 10th facet joints on both sides of the vertebra with the micro mosquito forceps of the vertebral stabilizator. Tighten the screws on the micro mosquito forceps, and the vertebra is thus stabilized. Adjust the spinal cord to the horizontal plane, tighten the universal arm, and the vertebra is fixed (Figure 3D).\n3. T9 contusion injury\nOnce the T9 level spinal cord is exposed and the vertebra is fixed, aim at the spinal cord by the tip inside the sleeve under the operating microscopic (Figure 3E).",
    "Check if the surface of the tip is parallel to the spinal cord from the posterior and lateral aspects of the spinal cord, since it is easy to observe the relationship between the spinal cord and the tip under the microscope, and that the operating table can be turned easily.\nCheck if the surface of the tip is parallel to the bilateral borders of the spared lamina before the tip is in contact with the spinal cord after the laminectomy since it is a natural reference plane parallel to the spinal cord.\nAfter locating the interspinous space of the T12-T13, lower the sleeve until the end of the impactor is consistent with the mark on the observation window and the specified height of 22 mm is reached. Pull out the pull pin to release the weight (1.3 g, 2.0 g, or 2.7 g according to the group, with each group including 3 mice and each group having one mouse for each time point).\n\tNOTE: The spinal cord should be parallel to the ground and perpendicular to the tip; move the operating table to ensure the microscopic visual field, since the table is very compact.\nRemove the impactor when the contusion is done and observe the degree of SCI under the operating microscope. In the mild group, a light red color alteration can be seen, while in the moderate group, the injury site exhibits dark red in 3-4 s, and, possibly, eminence can be observed. In the severe group, the dark red manifestations may appear immediately, and obvious eminence in the dura is manifested, but the dura is still in a consistent shape (Figure 3F).\nSuture the superficial fascia and skin with sutures (polypropylene nonabsorbable suture, size: 6-0).",
    "After completing the suture, sterilize the surgical area, place the mouse on a temperature-controlled pad until full consciousness is restored, and then put the mouse in the mouse cages.\n4. Animal care\nPlace the animal on the heating pad for recovery and observe the movement of both hind limbs.\n\tNOTE: Animals that have undergone surgery should not be returned to the company of other animals until fully recovered.\nPut a high-water diet on the cage floor so that animals can easily reach the food. Alternatively, use a cage with a lower feeding table.\nEmpty the mice's bladders twice a day after the operation because it is difficult for the moderate and severe injury groups to recover bladder function. Inject buprenorphine for analgesia (0.05-2.0 mg/kg, SQ) 8-12 h/day for 3 days.\n5. Transcardial perfusion, staining, and immunostaining\nOn the 1st, 28th, and 56th days after injury, sacrifice one mouse of each group, respectively, by perfusion.\n\t\nPerfuse the mice with 60 mL of phosphate-buffered saline (PBS) and 20 mL of 4% paraformaldehyde after excessive anesthesia (4%-6% isoflurane).\nCollect the spine with micro scissors, extending rostrally and caudally 1 cm, respectively, from the lesion center.\nResect the excess muscles, reserve intact spine segments with partial ribs for instruments to hold in step 5.1.4 and soak it in 4% paraformaldehyde for 24 h.\nClamp the ribs with hemostatic forceps for fixation and define the lesion center under the microscope according to the resected lamina and color alteration in the lesion center of the spinal cord.\nResect all the laminae and articular processes with micro scissors from the caudal.\nCut off the nerve roots with micro scissors and take out the spinal cord.\nCollect 0.5 cm of the spinal cord extending caudally and rostrally, respectively, from the lesion center with micro scissors.",
    "Put the spinal cord in 30% sucrose at 4 ˚C for 48 h.\nCut the tissues into 6 µm thick sections after freezing according to histological examination type.\nPerform hematoxylin and eosin (H&E) staining.\n\t\nRewarm the sections to room temperature and soak the 6 µm thick sections in 4% formaldehyde for approximately 15 min, followed by soaking in 1x PBS for 1 min four times to remove residual OCT.\nStain the sections with hematoxylin for 90 s, and rinse with double-distilled water.\nThen, wash the sections with running water for 3 min.\nStain with eosin for 4 min and soak in 95% alcohol for 30 s twice to rinse excess eosin.\nFinally, dehydrate with gradient alcohol (95% alcohol and 50% alcohol once, successively) for 30 s and soak in xylene for transparency for 2 min. Then, seal the specimens with resin gel (coronal plane section: Figure 4; sagittal plane section: Figure 5).\nPerform immunofluorescent staining.\n\t\nRewarm the sections to room temperature and soak the 6 µm thick sections in 4% formaldehyde for approximately 2 min.\nWash the sections in TBST for 5 min for three times.\nIncubate the sections with blocking solution (10% goat normal serum in PBS) and block for 1 h to block non-specific binding of immunoglobulin.\nIncubate the spinal cord sections overnight at 4 ˚C with both mouse anti-glia fibrillary acidic protein (GFAP, a marker for reactive astrocytes), polyclonal antibody (1:600), and rabbit anti-NF200 antibody (1:2000), a marker for neurofilament in 0.4 mL of blocking solution.\nRinse the sections with PBS and add 0.4 mL of blocking solution with Goat anti-rabbit Alexa 594-conjugated IgG (1:1,000) and goat anti-mouse Alexa 488-conjugated IgG (1:1,000) secondary antibodies for 1 h at room temperature.",
    "Take images with a fluorescent microscope at 10x by automatic panoramic scanning at wavelengths of 594 nm and 488 nm, respectively (Figure 6).\n\t\t\nTurn on the fluorescence microscope, put the slide on the microscope stage, switch to the fluorescence channel, use the positioning key to position three to four points on the tissue, and focus to complete the shooting. After finishing shooting, save the images of different channels in the desired format, and then save the merged image."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}