{
  "id": 9452,
  "origin_website": "Jove",
  "title": "Ex vivo Live Imaging of Single Cell Divisions in Mouse Neuroepithelium",
  "procedures": [
    "Adult mice are euthanized by mechanical cervical dislocation. All animal procedures were approved by the IACUC and the Biosafety Committee at Emory University.\n1. Embryo Generation\nCross tamoxifen- inducible Cre line, CAGGCreER, and dsRedCre reporter line (Tg(CAG-Bgeo,-DsRed*MST)1Nagy) (Figure 1) 5,6. To monitor the relative timing of Shh response in the daughter cells, cross CAGGCreER and dsRed line with the Olig2-eGFP BAC transgenic mice (Tg(Olig2-EGFP)EK23Gsat) (Figure 1) 7,8.\nDissolve tamoxifen in 100% ethanol, and perform intraperitoneal injection of 2.5 mg tamoxifen per 40 g of body weight into pregnant females at embryonic 6.5 (E6.5) to induce Cre expression and dsRed labeling in a small subset of cells.\n48 hr later dissect embryos, identify dsRed positive embryos using the fluorescent microscope, transfer them to the culture dish and observe single cell divisions during ex vivo imaging (see below). \n2. Whole Mouse Embryo Culture\nDissect E8.5 embryos in pre-warmed wash medium containing DMEM/F12 (1:1) supplemented with 10% newborn calf serum and 1% Penicillin/Streptomycin (P/S) 9.\nDirectly after dissection, place embryos on the 37 °C heating stage under the fluorescent microscope and identify as GFP and/or dsRed positive (see below).\nTransfer up to 2 embryos into a 500 μl drop of pre-equilibrated culture media containing 50% Rat Serum from a Sprague-Dawley male and 50% DMEM/F12 (1:1) without phenol red supplemented with L-Glutamine and 1% of 1 M HEPES in 0.85% NaCl and P/S 9.\nApply a thin layer (0.1 cm) of equilibrated light mineral oil over the medium to prevent evaporation and transfer the culture dish containing the embryos to the 37 °C, 5% CO2 incubator.\n3. Viral Infection\nIn order to label cilia in the neuroepithelium, add 5-10 μl of Sstr3-GFP lentivirus, approximately 2 million virions, to a 500 μl equilibrated drop of culture medium containing an E8.5 embryo.",
    "After 18 hr of culture, transfer infected embryo into several drops of wash medium to wash out the virus and prepare neural tube slice.\n4. Neural Tube Slice Preparation for Live Imaging\nDissect neural tube of the E8.5 embryo in pre-warmed wash medium using a micro-knife size 0.025 mm, on a 1% agar coated dish.\nPlace the isolated neural tube ventral side down in a 150 μl drop of equilibrated culture medium without phenol red on the 35 mm poly-L-lysine coated glass bottom dish.\nPut small amounts of a 1:1 mixture made from 100% pure petroleum jelly and melted candle wax (candle from IKEA) around the mounted neural tube, and gently press by a narrow piece of glass coverslip in order to immobilize the sample.\nCover the dish with a thin layer (~0.1 cm) of equilibrated light mineral oil (Figure 2).\n5. Live Imaging and Time-lapse Confocal Microscopy\nPlace dish under the Nikon A1R Laser Scanning Confocal Inverted Microscope equipped with an environmental chamber that regulates temperature, set to 37 °C, and 5% CO2.\nUse 60x oil-immersion objective to record GFP labeled cilia and dsRed positive cells, while the 40x oil-immersion objective use to monitor Olig2-GFP and dsRed positive cells.\nOpen the NIS Elements software to set up time lapse imaging conditions. Every 10 min acquire z-stacks of up to 25 μm with a spacing of 1.5 μm (40x objective) and up to 8 μm with a spacing of 0.4 μm (60x objective). Use 488 and 561 nm the excitation wavelengths and transmitted channel if needed. Acquire images at 512 x 512 size. Set up multiple user-defined regions of interest to perform simultaneously recording.",
    "Optimal exposure to laser power and brightness of the image was adjusted by use low laser intensity (up to 11% for mCherry 561; up to 4.5% EGFP 405/488), scan speed 1, line average 2 and size of pin hole (61 μm for dsRED; 28.1 μm for Olig2; 72 μm for SSTR3GFP; 61.3 μm for dsRED and SSTR3GFP; 58 μm for dsRED and Olig2). The use of genetically encoded fluorescent reporters enabled us to detect the brightness with low laser power.\nAnalyze recorded data using Imaris 3D reconstruction software.\n6. Immunofluorescence\nFix embryos or isolated neural tubes in 4% paraformaldehyde / 0.1 M Phosphate Buffer on ice (4 °C) for 1 hr in a glass dish.\nWash samples 2 hr in PBS on ice (4 °C) (change PBS a few times) and put in 30% sucrose / 0.1 M Phosphate Buffer over the night or until embryos sink.\nEmbed in OCT, freeze on dry ice and store in -80 °C. Perform sectioning on cryostat (10 mm).\nWash slides for 10 min in wash solution containing 1% Heat-inactivated sheep serum and 0.1% Triton X-100 in PBS.\nDilute primary antibodies in wash solution at following concentrations: Rat monoclonal anti-RFP (5F8,) 1:200; Rabbit anti-Arl13b serum 1:1500 and mouse monoclonal anti-Arl13b 1:5 (295B/54); Rabbit anti-Olig2 1:300; Mouse monoclonals Pax6, Shh and Nkx2.2- all 1:10; and Rabbit polyclonal Ki67 1:500. Add around 150 μl per slide in flat humidified chamber, cover with parafilm to avoid drying out and leave over the night at 4 °C.\nWash slides in wash solution three times, 20 min each time at room temperature.",
    "Dilute secondary antibodies Alexa Fluor 488, 568, 350 in wash solutions at 1:200 concentration. Use Hoechst 1:3,000 or TO-PRO-3 1:500 to stain nuclei. Add 150 μl per slide, leave 1 hr at room temperature in humidified chamber protected from light.\nWash slides in wash solution two times, 30 min each time at room temperature.\nMount slides in 80% ProLong Gold anti-fade reagent and view within 24 hr.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}