{
  "id": 18501,
  "origin_website": "Jove",
  "title": "Three-dimensional Alginate-bead Culture of Human Pituitary Adenoma Cells",
  "procedures": [
    "This study was approved for the use of human material by the local ethical committees of the Medical Institution and the Center of Research and Advance Studies of the National Polytechnic Institute.\n1. Tumor Sample Acquisition\nObtain the pituitary adenoma tissue biopsy from a patient through a trans-sphenoidal surgical procedure14.\nCollect the pituitary adenoma sample and place it into a sterile glass bottle containing 50 ml of fresh 199 culture medium (M199) enriched with 10% fetal bovine serum (FBS), 0.6 mg/ml sodium bicarbonate, 2.4 mg/ml HEPES and 1% antibiotics (penicillin/streptomycin) at pH 7.4. Maintain the sample in a glass bottle on ice.\n\tNote: The tumor tissue can be processed several hr after the surgery.\nTransport the tumor sample to the laboratory in the glass bottle on ice.\n2. Preparation of the Enzymatic Tissue Dissociation Solutions, the Trypsin Inhibitor Solution and the Alginate Solutions\nNote: Prior to the cell culture procedure prepare the following solutions. Filter all the solutions using a 0.22 µm membrane filter, before use.\nPrepare collagenase 1% solution by dissolving 5 mg of collagenase (type I) in 5 ml of M199-serum free.\nPrepare trypsin 0.01% solution by dissolving 0.01 g of trypsin in 10 ml of PBS-EDTA 0.3%.\nPrepare 0.1% trypsin inhibitor solution by dissolving 2 mg of soy trypsin inhibitor in 20 ml of M199-serum free.\nPrepare DNAse solution by dissolving 20 µl of DNAse I 134 U/ml in 4 ml of the trypsin inhibitor solution.\nPrepare EGTA solution (1.2 M) by dissolving 22.8 mg of EGTA in 40 ml of 155 mM NaCl. Adjust the pH to 7.4. Continue to a final volume of 50 ml.\nPrepare HEPES solution (20 mM) by dissolving 238 mg HEPES in 50 ml of 155 mM NaCl.",
    "Prepare 1.2% alginate solution by dissolving 1.2 g sodium alginate in 100 ml of the HEPES solution. Autoclave the alginate solution.\nPrepare calcium solution (102 mM) by dissolving 750 mg of CaCl2 in 50 ml HEPES solution, adjust pH to 7.4\n3. Primary Cell Culture and Alginate Encapsulation\nInside a laminar flow cabinet, place the tumor tissue in a 35 mm Petri dish containing approximately 20 ml of PBS Ca2+ and Mg2+ free, pH 7.4 (PBS*).\nTake the tissue with a surgical tweezer and place it in another petri dish containing fresh PBS*, gently wash the tissue. Repeat this step until the red blood cells and debris are removed.\nUsing a surgical tweezer, hold the pituitary adenoma tissue, and with a small surgical scissor, cut it into small pieces. With a Pasteur pipette with rounded edges, transfer the tissue fragments and the PBS* into a 15 ml tube, Centrifuge at 68 x g for 10 min at RT.\n\tNote: To round the edges of a Pasteur pipette, slightly flame the tip of the pipette in a Bunsen burner.\nRemove the PBS* using a Pasteur pipette and add 3-5 ml of the collagenase solution (approximately 5 ml for 65 mm3 of tissue), mix two to three times by inverting. Incubate the tissue in the collagenase for 30 min at 37 °C in constant rotation.\nCentrifuge the tube at 68 x g for 10 min at RT and remove the collagenase with a Pasteur pipette.\nAdd 5 ml of DNAse and mix two to three times by inverting, then centrifuge the tube at 68 x g for 10 min at RT.",
    "Note: If the tissue is not completely dissociated, perform a second enzymatic digestion with trypsin for 3 min at 37 °C. Stop the digestion by the addition of 2 volumes of trypsin inhibitor solution.\nAspirate the supernatant with a Pasteur pipette and discard. Re-suspend the pellet in 1 volume of EGTA solution and mix with 2 volumes of alginate solution.\nGently mix the cell suspension and alginate by pipetting with a Pasteur pipette. Take a sterile syringe with a 21 G needle, remove the plunger; use a pipette to load the syringe with the alginate and cell solution.\nGently insert the plunger into the syringe and carefully dispense the alginate-cell solution drop-by-drop into a glass beaker containing approximately 30 ml of the calcium-rich solution.\nPlace the needle of the syringe approximately 5 cm up to the CaCl2 solution. The alginate-cell suspension gels on contact with the CaCl2 to form spherical beads. Keep the alginate beads in the calcium solution for 5 min.\n\tNote: Stir the glass beaker in which the beads are dropped. Move it slowly with the hand in circular motions, to prevent them from sticking to one another.\nCarefully remove the calcium solution with a Pasteur pipette, and wash the beads twice with 3-5 ml of M199 enriched with 20 % of FBS.\nTransfer the alginate beads into a regular T25 tissue culture flask using a sterile spatula, add 4-5 ml of M199 enriched with 20% FBS and incubated at 37 °C in a humidified incubator with 5% CO2. Change the culture medium every third day.\n4. Liberate Cells from the Alginate\nNote: Prior to liberating the cells from the alginate beads, coat 13 mm diameter coverslips with poly-D-lysine.",
    "CAUTION: SULPHURIC ACID IS A HIGHLY CORROSIVE ACID, AND APTS CAN CAUSE EYE AND SKIN IRRITATION. USE LATEX GLOVES TO HANDLE THESE REAGENTS.\nIn a fume hood, with a point tweezer immerse the coverslips in a glass petri dish containing 20% aqueous sulphuric acid for 1 hr at RT.\nDecant the sulphuric acid, and wash the coverslips five times with distilled water for 5 min each. Using a point tweezer place the clean coverslips in a petri dish containing 0.1 M NaOH for 5 min at RT15.\nDecant the NaOH and wash one time with distilled water, aspirate the water and dry the coverslips.\nUse a micropipette to coat the coverslips with APTS (aminopropyl-triethoxysilane) for 4 min (use 500 µl for 6 coverslips) flood the Petri dish with distilled water. Quickly aspirate the water and continue to wash with distilled water, moving the coverslips with point tweezers to allow the water to penetrate beneath.\nAspirate the water and dry the coverslips, using a point tweezer place the coverslips into a clean Petri dish and sterilize them inside the microwave during 3 times, 45 sec each. Add 1,000 µl of sterile water to 100 µg of poly-D-lysine (0.1 mg/ml).\nIncubate the coverslips with approximately 50 µl of poly-D-lysine for 5 min at RT. Aspirate the poly-D-lysine completely.\n\tNote: This is important because soluble poly-D-Lysine in the culture medium can inhibit cell proliferation.\nRinse the coverslips five times with sterile water for 5 min each. Aspirate the sterile water and allow coverslips to dry inside a laminar flow cabinet.\nTo analyze the actin cytoskeleton, liberate the pituitary cells from the alginate. Take some of the alginate beads from the culture flask using a 1 ml pipette tip and place them into a 15 ml tube.",
    "Add 5 ml of 55 mM sodium citrate (dissolve 323.6 mg of Na3C6H5O7, 2 H2O in 20 ml HEPES solution) and centrifuge at 68 x g for 10 min at RT. Aspirate the supernatant and discard.\nRe-suspend the pellet in 1 ml of warm M199 enriched with 20% FSB; gently mix the cell suspension with a Pasteur pipette.\n\tCAUTION: PHALLOIDIN AND DAPI ARE TOXIC. USE GLOVES TO HANDLE THESE REAGENTS.\nTo count the cells, transfer 125 µl of 0.4% Trypan blue solution to a 1.5 ml tube. Add 75 µl of M199 and 50 µl of the cell suspension obtained in the last step (dilution factor = 5). Mix thoroughly.\nUse a micropipette tip to place approximately 10 µl of the Trypan blue-cell suspension in the hemocytometer chamber.\nCount the cells in the hemocytometer counter using an inverted microscope with phase-contrast illumination. Count all the cells in the 1 mm center square and four 1 mm corner squares. Obtain the cell density per milliliter by multiplying the average count per square by the dilution factor - 104. For example if the average counts per square is 45 cells x 5 x 104 = 2.25 x 106 cells/ml.\n\tNote: Count the cells in ten squares of the hemocytometer chamber. Do not count cells touching the middle line at bottom and right sides.\nSeed 35,000 cells on 13 mm diameter glass coverslips covered with poly-D-Lysine.\n5. Actin Cytoskeleton Arrangement\nAfter 48 hr in culture, remove the culture medium with a Pasteur pipette and quickly add 500 µl per coverslip of PBS, immediately remove the PBS.",
    "Fix and permeabilize the cells with 500 µl per coverslip of fixation buffer (0.1 M PIPES, pH 6.75, 4% PEG-6000, 1 mM EGTA, 1 mM MgSO4, 0.5 % Triton X-100 and 2% formaldehyde) for 10 min at 37 °C\nRemove the fixation buffer and add 500 µl per coverslip of 3.5% paraformaldehyde in PBS for 30 min at RT. Remove the paraformaldehyde solution.\nWash the coverslips three times by adding 500 µl per coverslip of PBS for 5 min each. Rinse the coverslips at RT, in constant agitation.\nIncubate the cells with 50 mM ammonium chloride for 10 min, aspirate the ammonium chloride solution and repeat step 5.4.\nIncubate the cells with 1% BSA (IgG-free, proteases-free) in PBS for 30 min, remove the BSA solution and repeat step 5.4.\nIncubate the cells with 50 µM of rhodamine-conjugated phalloidin for 7 min at RT, repeat step 5.4.\nIncubate the cells with 255 µM of DAPI diluted in PBS for 5 min at RT, repeat step 5.4. Finally mount the coverslips with a mounting medium and seal them with nail polish.\nAcquire images of the actin cytoskeletal arrangements using a confocal laser scanning microscope with a 63X objective, at 541 nm excitation wavelength.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}