{
  "id": 17165,
  "origin_website": "Jove",
  "title": "15N CPMG Relaxation Dispersion for the Investigation of Protein Conformational Dynamics on the µs-ms Timescale",
  "procedures": [
    "1. Preparation of the NMR sample\nExpress and purify a 2H,15N-labled sample of the protein of interest.\n\tNOTE: While a 15N-labeled protein sample can be used for acquisition of the CPMG RD experiment, perdeuteration (where possible) dramatically increases the quality of the obtained data. Protocols for the production of perdeuterated proteins are available in the literature13.\nBuffer exchange the purified protein sample into a degassed NMR buffer.\nTransfer the NMR sample into the NMR tube.\n\tNOTE: The concentration of the NMR sample needs to be carefully optimized in order to maximize the signal-to-noise ratio and minimize the occurrence of protein-protein interactions. In general, the typical concentration range for CPMG experiments is 0.1-1.0 mM.\n2. First time set-up of the NMR experiment\nDownload and unzip the Supplemental Files.\nCopy the files bits.vv and trosy_15N_cpmg.vv (located the in the folder named pulseprogram) into the pulse program directory (<path>/exp/stan/nmr/lists/pp/user).\n\tNOTE: Make sure the path to bits.vv listed on the first line of the trosy_15N_cpmg.vv file is correct.\nOpen acquisition software and copy a previously run 1H-15N HSQC experiment into a new experiment using the command edc.\nUsing the command pulprog, load the pulse program trosy_15N_cpmg.vv into the newly created experiment.\nSet up the CPMG experiment using the instructions provided at the end of the pulse program file (trosy_15N_cpmg.vv).\n3. Routine set-up of the NMR experiment\nIntroduce the sample in the magnet and perform all the basic steps for acquisition of any NMR experiment: lock and shim the sample; match and tune the 1H and 15N channels.\nSet p1 and p7 to the duration of the 1H and 15N hard 90° pulses, respectively.",
    "NOTE: For optimal results, it is important to calibrate the 15N 90° pulse with great care. Calibration is usually accomplished using a 100 mM sample of 15N-labeled urea in DMSO as described in the spectrometer manual. In addition, it is possible to double-check the calibration directly on the working NMR sample by acquiring the first increment of a 1H-15N HSQC spectrum in which the 15N 90° pulse of the first INEPT block is switched to a 180° pulse. If the calibration is correct, a null should be obtained.\nIn the acquisition window, set the center and spectral width for the 1H and 15N dimensions.\n\tNOTE: Center the 1H spectrum at the frequency of the water signal for optimal water suppression.\nSet the relaxation delay (d30) equal to 0.7 T2, where T2 is the expected 15N transverse relaxation time of your protein.\n\tNOTE: The value of d30 can be optimized empirically to obtain the best results.\nUse the command vclist to create a list of integer numbers corresponding to the parameter n in Figure 1A and Figure 1B. Ensure that each entry in the list corresponds to a different CPMG field (νcpmg) according to νcpmg = 4 x n / d30. Make sure that the first number in the list is 0 (this corresponds to the reference experiment for which the CPMG block is skipped and d30 = 0 s) and not to use numbers larger than 1,000 x d30 / 4. Numbers larger than this threshold result in νcpmg > 1 kHz and might damage the probe.\nSet l8 to the number of entries in the vclist, l3 to the number of real points for the indirect dimension (usually a range of 64-200 is set for l3), and 1 td equal to l8 x l3 x 2.",
    "NOTE: Perform the steps 3.7-3.11 to optimize the water suppression.\nSet the receiver gain (rg) to 1; open the pulse program file (edcpul), go to line 91, remove the semicolon preceding goto 999, and save the file.\nUsing the command gs adjust the parameters spdb0 (or spdw0) in order to minimize the intensity of the FID signal.\nReintroduce the semicolon at line 91 of the pulse program file and save the file.\nRepeat the steps 3.7-3.9 to optimize spdb11 (line 168 of the pulse program file), spdb2 (line 179 of the pulse program file), and pldb2 (line 184 of the pulse program file).\nRun the command rga to optimize the receiver gain.\nSet the number of scans (ns) to a multiple of 8.\nRun the command zg to start the experiment.\n4. Processing and analysis of the NMR data\nCopy the folder named Process (Supplemental Files) into the directory containing the ser file.\nUse the files sep_fid.com and ft2D.com to process the NMR data.\n\tNOTE: Instruction as to how to edit the processing scripts is provided within the sep_fid.com and ft2D.com files.\nOpen the ucsf files contained in the directory CPMG_Sparky_files in Sparky.\n\tNOTE: The ucsf files are created by the processing scripts. There is one ucsf file for each entry in the vclist. The first ucsf file (test_1.ucsf) contains the reference experiment. The subsequent ucsf files (test_2.ucsf, test_3.ucsf,… test_n.ucsf) are ordered from the lowest to the largest value of νcpmg.\nPick the NMR cross-peaks on the reference NMR spectrum (test_1.ucsf).\nSelect all the picked cross-peaks using the Sparky command pa.",
    "Run the Sparky command rh. This command opens a dialogue window. Select the option heights at the same position in each spectrum. Click on Setup and check all the NMR spectra. Click on Update and save the output file in the working directory. The output file contains the matrix of the signal intensities over all opened NMR spectra.\n\tNOTE: More accurate protocols that use lineshape fitting for recovering intensities from interleaved pseudo-3D experiments have been described in the literature14. Freely available software for lineshape fitting is available at https://pint-nmr.github.io/PINT/ (PINT), https://www.ucl.ac.uk/hansen-lab/fuda/ (FUDA), and within NMRPipe (nLinLS module) and SPARKY (it module).\nFor each CPMG field, convert the signal intensities to R2 rates using the formula imgsrc://cloudfront.jove.com/files/ftp_upload/62395/62395eq03.jpg, where I0 and Id30 are the intensity of the reference (vc = 0) and relaxed (vc > 0) NMR spectra, respectively.\n\tNOTE: In the Supplemental Files, a template of the spreadsheet file (R2_calc.xls) used to convert the signal intensities to R2 rates and to visualize the RD profiles is provided.\nRead the noise level in the reference spectrum using the Sparky command st and propagate the error on the R2 rates.\n\tNOTE: In the Supplemental Files, a template of the spreadsheet file (R2_calc.xls) used to propagate the error on the measured R2 rates is provided.\n5. Fitting RD curves\nCopy the folder named RD_fitting (Supplemental Files) into the working directory.\nFor each assigned NMR peak, estimate Rex by calculating the imgsrc://cloudfront.jove.com/files/ftp_upload/62395/62395eq04.jpg. imgsrc://cloudfront.jove.com/files/ftp_upload/62395/62395eq05.jpg and imgsrc://cloudfront.jove.com/files/ftp_upload/62395/62395eq06.jpg are the R2 rates measured at the lowest and highest νcpmg in the vclist.\nVisually inspect the RD curves with Rex larger than two times the estimated error and discard all the RD curves that are too noisy to be modeled accurately.\n\tNOTE: Noise on Rex can be propagated from the errors on imgsrc://cloudfront.jove.com/files/ftp_upload/62395/62395eq05.jpg and imgsrc://cloudfront.jove.com/files/ftp_upload/62395/62395eq06.jpg.",
    "Prepare an input file for the fitting script using all RD curves with Rex larger than two times the estimated error.\n\tNOTE: Detailed instruction on the preparation of the input files are provided within the fitting scripts. Example input files are provided as Supplemental Files. Commonly, RD data are measured at two different static fields and fitted simultaneously. In this protocol, two different input files are required (Supplemental Files).\nFit the RD data using the scripts provided in Supplemental Files.\n\tNOTE: Two different scripts are provided to perform a residue-based or a global fit of the RD curves, respectively. Both scripts fit the RD curves using a two-site exchange model and the Carver-Richards equation. More detailed instructions are provided within the fitting scripts. Additional software packages such as Chemex (https://github.com/gbouvignies/ChemEx) and CATIA (https://www.ucl.ac.uk/hansen-lab/catia/ ) are available to carry out data fitting using the Block-McConnell equations.\nTest the reliability of the fitted parameters estimating the reduced χ2 as a function of pb and kex.\n\tNOTE: The reduced χ2 is provided in the output file. pb and kex can be restrained to specific values using lower and upper bounds in the fitting procedures. In our scripts, the lower and upper bounds for pb are lb(2) and ub(2), respectively. The lower and upper bounds for kex are lb(3) and ub(3), respectively.\nEstimate the error on the fitted parameters. This can be done by setting the value of MC_fac in the script to 1 and repeating the fitting multiple times (typically >20 repeats). The error on each parameter is estimated as the standard deviation of the distribution.\n\tNOTE: Setting MC_fac to 1 generates a synthetic dataset in which a Gaussian distributed error (calculated based on the experimental error) is added to the experimental data.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}