{
  "id": 4835,
  "origin_website": "Bio",
  "title": "Coupling of HIV-1 gp120-derived Core Protein to Paramagnetic Beads and Adsorption Assays",
  "procedures": [
    "Dynabeads MyOne Tosylactivated beads are superparamagnetic, polystyrene beads with polyurethane layer designed for bio-magnetic separations. These beads were freshly tosyl-activated, coupled with selected core gp120 variants. We used the core-conjugated Dynal beads to fractionate site-specific antibodies from polyclonal anti-sera elicited by HIV-1 core immunization. Anti-sera were adsorbed over isogenic glycoprotein antigens possessing epitope-specific mutations that were covalently attached to the Dynabeads. Following this adsorption method we were able to enrich and detect antibodies elicited against the desired epitope.Conjugation of protein/glycoprotein to the DynabeadsTosyl-activated paramagnetic Dynabeads were washed by transferring beads to a tube placed on a magnet until the beads migrated to the side of the tube and the liquid was clear. The tube was removed from the magnet and beads were resuspended in 1 ml of coating buffer. The tube was again placed on the magnet and the liquid removed. These beads were then used as described below.2 mg protein (at a concentration of >5 mg/ml) was mixed with 100 mg (1 ml, initial volume before washing the beads) tosyl-activated paramagnetic Dynabeads in a total volume of 2.5 ml of coupling buffer with slow tilt rotation at 37 °C for 16-to-24 h in a 15 ml polystyrene tube. The tube was inserted into the magnetic separator for 2 min to separate the glycoprotein-conjugated beads from buffer containing unconjugated, free protein. Non-covalently linked protein was discarded.The Dynabeads were resuspended in 1.25 ml blocking buffer at 37 °C for additional 16-to-24 h.The Dynabeads were washed 3 times with 2 ml wash buffer at room temperature and stored at 4 °C in 500 μl PBS containing 0.02% sodium azide and protease inhibitor (1 tablet in 50 ml). Beads were separated between each wash on the magnetic separator.",
    "Solid phase adsorptionProtein-coupled Dynabeads were washed three times with 2 ml DMEM containing 10% FBS and incubated for 30 min at RT to block nonspecific binding sites on the beads. Between every wash beads were separated using the magnetic separator.Rabbit sera derived from the same group of animals were pooled and diluted 40-fold with DMEM. Eighty μl of the diluted sera was added to 100 μl of protein-conjugated beads and incubated for additional 30 min with gentle rocking at room temperature. Rabbit sera were obtained from a separate immunization experiment, where rabbits were immunized with HIV-1 core glycoptoteins.Un-bound serum antibodies were separated from the protein-conjugated beads using a magnet.Multiple rounds of adsorption were performed. Fresh protein-coupled Dynabeads were used for each round of adsorption for complete removal of specific antibodies from the diluted serum to the solid phase. For each set of serum adsorptions, blank beads, (same amounts as the experimental beads) devoid of protein were used as negative controls. To check for the complete enrichment of core- and site-specific antibodies, serum IgGs were eluted from the beads by addition of 100 mM Glycine-HCl (pH 2.7). In parallel, the serum fractions containing un-bound antibodies were also analyzed. ELISAs were performed using wild-type and site-specific mutant proteins as targets on the ELISA plate as described in Ingale et al. (2014)."
  ],
  "subjectAreas": [
    "Microbiology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}