{
  "id": 17778,
  "origin_website": "Jove",
  "title": "Hemocompatibility Testing of Blood-Contacting Implants in a Flow Loop Model Mimicking Human Blood Flow",
  "procedures": [
    "The blood sampling procedure was approved by the Ethics Committee of the medical faculty at the University of Tuebingen (project identification code: 270/2010BO1). All subjects provided written, informed consent for inclusion before participation.\n1. Preparation of Heparin-loaded Monovettes\nMix the undiluted heparin (5,000 IU/mL) with sodium chloride (NaCl, 0.9%) solution and prepare a solution with a resulting concentration of 15 IU/mL of heparin.\nAdd 900 µL of the diluted heparin solution to each neutral monovette (9 mL) to obtain a final heparin concentration of 1.5 IU/mL after blood sampling. Prepare three monovettes per donor plus three reserve monovettes and store the heparin-loaded monovettes at 4 °C until blood sampling.\n2. Blood Sampling\nTake the heparin-loaded monovettes out of the refrigerator 30 min prior to blood sampling.\nCollect a 27 mL blood sample from each healthy donor (n = 5) by venipuncture for the flow loop. Only apply a smooth tourniquet to avoid premature activation of the platelets and the blood clotting cascade.\nCollect blood samples in three monovettes containing 900 µL of the heparin solution (1.5 IU/mL) and pool all three monovettes in one plastic container to ensure that all components are evenly distributed.\nDirectly transfer the pooled heparinized blood into three different monovettes containing either EDTA (1.2 mL), citrate (1.4 mL), or a mixture of citrate, theophylline, adenosine, and dipyridamole (CTAD, 2.7 mL) to collect baseline values. Proceed with the samples as described in sections 5−8.\n\tNOTE: To guarantee uninfluenced clotting behavior, donors should avoid the intake of hemostasis-affecting drugs (e.g., acetylsalicylic acid, naproxen, and carbenicillin) within the last 14 days, as well as oral contraceptives and smoking.\n3. Preparation of the Flow Loop",
    "Cut three heparin-coated polyvinyl chloride tubes with a length of 75 cm and inner diameter of 3.2 mm. Load the tubes with the neurovascular laser-cut implants with or without the fibrin-heparin coating. Remember to leave one tub unloaded as a control.\nPlace one end of the tube in a reservoir filled with 0.9% NaCl, connect the tubing to the pump head, and insert the other end into a measuring cylinder.\nAdjust the settings of the peristaltic pump to achieve a flow rate of 150 mL/min by using a timer while checking the fill level in the measuring cylinder.\n4. Performance of Hemocompatibility Testing\nUse a 12 mL syringe to fill the tubes with blood. Let 6 mL of blood flow smoothly into each tube containing a sample or unloaded control.\nForm a circuit and close the tubes tightly using a 0.5 cm length of silicone connection tubing. Place the tubes in a water bath of 37 °C and start the perfusion for 60 min.\n5. Whole Blood Count Analysis\nPut 1.2 mL of blood after sampling (baseline) or after perfusion into a monovette containing EDTA and carefully invert the tube 5x.\nInsert the monovette into the blood analyzer and perform a blood count analysis for every sample. Then, incubate the monovettes on ice for 15−60 min after the blood count measurement for further analysis, as described in section 7.\n6. Collection of Citrate Plasma\nFill the monovettes containing citrate with 1.4 mL of blood (freshly drawn or after circulation) and carefully invert 5x.\nCentrifuge the tubes for 18 min at 1,800 x g at room temperature (RT). Aliquot three 250 µL samples of the plasma fraction into 1.5 mL reaction tubes and freeze the plasma samples in liquid nitrogen. Store them at -20 °C until analysis.",
    "7. Collection of EDTA Plasma\nIncubate the monovettes on ice for 15−60 min after the blood count measurement. Then, centrifuge the tubes for 20 min at 2,500 x g and 4 °C.\nAliquot three 250 µL samples of the plasma fraction into 1.5 mL reaction tubes after centrifugation and freeze the tubes in liquid nitrogen. Store them at -80 °C until analysis.\n8. Collection of CTAD Plasma\nFill the monovettes containing the CTAD mixture with 2.7 mL of blood (freshly drawn or after incubation) and carefully invert 5x. Afterwards, incubate the monovettes on ice for 15−60 min. Then, centrifuge the tubes for 20 min at 2,500 x g and 4 °C.\nTransfer 700 µL of the middle plasma fraction into a 1.5 mL reaction tube and centrifuge the filled reaction tubes for 20 min at 2,500 x g and 4 °C.\nAliquot two 100 µL samples of the middle fraction into 1.5 mL reaction tubes after centrifugation and freeze the tubes in liquid nitrogen. Store them at -20 °C until analysis.\n\tNOTE: The collection of EDTA plasma and CTAD plasma can be performed together because the operating conditions are the same.\n9. Measurement of Human TAT from Citrate Plasma\nThaw the citrate plasma in a water bath of 37 °C.\nUse the TAT enzyme-linked Immunosorbent assay (ELISA) kit according to the manufacturer's instructions. Reconstruct the plasma standards and control and dilute the washing solution, anti-human-TAT peroxidase (POD)-conjugated antibody, and chromogen solution. Leave all reagents and the microtiter plate at RT (15−25 °C) for 30 min before starting the test.",
    "Pipet 50 µL of the sample buffer into each well of the microtiter plate and add 50 µL of the sample buffer (blank), plasma standard, plasma control, and undiluted plasma sample in duplicates to the well plate. Seal the plate and incubate at 37 °C for 15 min with gentle shaking. Then, wash the plate 3x with 300 μL of washing solution.\nAdd 100 µL of the POD-conjugated anti-human-TAT antibody to each well. Seal the plate and incubate at 37 °C for 15 min with gentle shaking. Then, wash the plate 3x with 300 μL of washing solution.\nAdd 100 µL of the freshly prepared chromogen solution to each well. Seal the plate and incubate at RT for 30 min.\nRemove the seal film and add 100 µL of stop solution to each well. Read the optical density (OD) with a photometer at 490−500 nm. Fit the standard curve data as a trend line and calculate the concentration of the samples.\n10. Measurement of PMN-elastase from Citrate Plasma\nThaw the citrate plasma in a water bath at 37 °C.\nUse the polymorphonuclear (PMN)-elastase ELISA kit according the to manufacturer's instructions: reconstruct the PMN-elastase control and the PMN-elastase standard to prepare a standard curve using the kit's dilution buffer.\nDilute the washing solution according to the manufacturer's description. Leave all reagents and the microtiter plate at RT for 30 min before starting the test. Dilute the citrate plasma samples to 1:100 with the dilution buffer.\nAdd 100 µL of the sample buffer (blank), PMN-elastase standard curve (15.6−1,000 ng/ mL), PMN-elastase controls (high and low concentrations), and diluted plasma samples in duplicates to the well plate. Seal the plate and incubate at RT for 60 min with gentle shaking. Afterwards, wash the plate 4x with 300 μL of washing solution.",
    "Add 150 µL of the enzyme-conjugated antibody to each well. Seal the plate and incubate at RT for 60 min with gentle shaking. Afterwards, wash the plate 4x with 300 μL of washing solution.\nAdd 200 µL of the 3,3',5,5'-tetramethylbenzidin (TMB)-substrate solution to each well. Seal the plate and incubate at RT for 20 min in the dark. Then, remove the seal film and add 50 µL of the stop solution to each well.\nRead the OD with a photometer at 450 nm with a reference reading at 630 nm. Fit the standard curve data as a trend line and calculate the concentration of the samples.\n11. Measurement of Terminal Complement Complex (TCC) from EDTA Plasma\nThaw the EDTA plasma in a water bath at 37 °C, and store on ice after defrosting.\nUse the complement cascade SC5b-9 ELISA kit according to the manufacturer's instructions: dilute the washing solution as described in the manufacturer's protocol. Leave all reagents and the microtiter plate at RT for 30 min before starting the test. Dilute the EDTA plasma samples to 1:10 with the kit's dilution buffer.\nAdd 300 µL of washing solution to each well to rehydrate the surface and aspirate after 2 min. Add 100 µL of the sample buffer (blank), SC5b-9 standards, SC5b-9 controls (high and low concentrations), and the diluted plasma samples in duplicates to the well plate.\nSeal the plate and incubate at RT for 60 min. Next, wash the plate 5x with 300 μL of washing solution.\nAdd 50 µL of the enzyme-conjugated antibody to each well. Seal the plate and incubate at RT for 30 min. Then, wash the plate 5x with 300 μL of washing solution.",
    "Add 100 µL of the TMB-substrate solution to each well. Seal the plate and incubate at RT for 15 min in the dark.\nRemove the seal film and add 100 µL of the stop solution to each well. Read the OD with a photometer at 450 nm. Fit the standard curve data as a trend line and calculate the concentration of the samples.\n12. Measurement of β-thromboglobulin from CTAD Plasma\nThaw the CTAD plasma in a water bath at 37 °C.\nUse the β-thromboglobulin (β-TG) ELISA kit according to the manufacturer's instructions: reconstruct the β-TG control and the β-TG standard and dilute the washing solution using distilled H2O. Reconstruct the POD-conjugated antibody using the provided phosphate buffer. Leave all reagents and the microtiter plate at RT for 30 min before starting the test.\nPrepare the standard curve and the control according to the manufacturer's instructions with the provided phosphate buffer. Dilute the CTAD plasma samples to 1:21.\nAdd 200 µL of the phosphate buffer (blank), β-TG standards, β-TG controls (high and low concentrations), and diluted plasma samples in duplicates to the well plate. Seal the plate and incubate at RT for 60 min. Afterwards, wash the plate 5x with 300 μL of washing solution.\nAdd 200 µL of the enzyme-conjugated antibody to each well. Seal the plate and incubate at RT for 60 min. Afterwards, wash the plate 5x with 300 μL of washing solution.\nAdd 200 µL of the TMB-substrate solution to each well. Seal the plate and incubate at RT for 5 min in the dark. Remove the seal film and stop the reaction by adding 50 µL of 1 M sulfuric acid (H2SO4) to each well.",
    "Leave the plate for 15−60 min, then read the OD with a photometer at 450 nm. Fit the standard curve data as a trend line and calculate the concentration of the samples.\n13. Sample Preparation for Scanning Electron Microscopy\nRemove the implant from the tube using forceps and rinse the implant briefly by dipping it into 0.9% NaCl solution 3x.\nStore in glutaraldehyde solution (2% glutaraldehyde in phosphate-buffered saline [PBS-buffer without Ca2+/Mg2+]) overnight at 4 °C.\nNext, incubate the implants in PBS-buffer for 10 min. Dehydrate the samples by incubating in ethanol with increasing concentration for 10 min each: 40%, 50%, 60%, 70%, 80%, 90%, 96%, and 100%. Store the dehydrated samples in 100% ethanol until further analysis.\nPerform critical point drying according to the instructions of the drying device or literature10 just before scanning electron microscopy (SEM).\n14. Scanning Electron Microscopy\nAttach the dried implants to a sample carrier for the scanning microscope and sputter the samples with gold palladium.\nIntroduce the sputtered implants into the sample chamber. Take pictures in 100-, 500-, 1,000- and 2,500-fold magnification of the areas with the representative surface and cell adhesion.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}