{
  "id": 7016,
  "origin_website": "Bio",
  "title": "<em>Candida albicans</em> Culture, Cell Harvesting, and Total RNA Extraction",
  "procedures": [
    "Note: This procedure is written with volumes and quantities for two strains, mutant and Wild Type (WT), with three replicates each for a total of six independent samples. Cell culture and harvestingInoculate WT and mutant strains in 5 ml liquid YPD and incubate overnight at 30 °C with 60 rpm rotation.Pre-warm 200 ml RPMI + 10% FBS and empty sterile 125 ml Erlenmeyer flasks overnight (O/N) 37 °C, or for a minimum of 2 h prior to Step A3 with more time for larger volumes.Aliquot 25 ml pre-warmed RPMI + 10% FBS into each of the 6 pre-warmed 125 ml flasks and return to 37 °C incubator to stabilize temperature at least 90 min before first inoculation.Vortex O/N WT culture thoroughly, measure OD600 using Eppendorf BioPhotometer and Cuvettes PS Semi-micro, and inoculate first pre-warmed flask of RPMI + 10% FBS to a final OD600 of 0.2 from the O/N WT culture.Immediately transfer to I-26 air shaker incubator for 4 h at 37 °C and 225 rpm rotation. Replace O/C in 30 °C incubation.Wait 8-10 min between inoculation of replicates.Note: This gap is to allow for adequate time for cell harvesting between replicates. Time can be shortened or lengthened as needed to allow for working speed of person performing protocol. Repeat Steps A4-A6 for WT replicates 2 and 3 as well as mutant replicates 1-3.This leaves roughly 3 h until the first culture is ready to harvest. Take this opportunity to set up cell harvesting equipment.Connect 1-2 L sidearm flask to a vacuum line and trap and mount the Millipore 47 mm glass base and stopper for vacuum filtration in the top of the flask.",
    "Turn on vacuum and wash filter base 2x with dH2O and 2x with 70% EtOH to eliminate debris and allow filter base to dry before applying filter membrane.Chill 50 ml conical tube rack at -80 °C.Pre-chill and label 6 50 ml conical screw-cap tubes in ice.Just before 4-hour timepoint apply MF-MilliporeTM 0.45 µm, 47 mm diameter gridded filter membrane to filter base grid side up using sterile flat-blade forceps and turn on vacuum (Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3803/bioprotoc-10-21-3803-g001.jpgFigure 1. Cell harvest filtration setup. Millipore 47 mm glass base and stopper inserted into sidearm flask and connected to vacuum line. Wash glass base thoroughly with water and 70% ethanol with vacuum running and let dry. Place MF-MilliporeTM 0.45 µm, 47 mm diameter gridded filter membrane onto glass base. In-line trap and filter are suggested to avoid carryover of waste.At 4 h, remove the WT replicate 1 flask from the shaker and swirl gently to dislodge cells stuck to the sides of the flask.Quickly, use a 25 ml serological pipette to transfer entire culture to filter membrane as fast as the vacuum will allow without overflowing the filter membrane.As soon as the liquid has been pulled off of the cells, transfer filter membrane to bottom of a pre-chilled 50 ml conical tube using sterile flat-blade forceps, and place immediately in -80 °C freezer.Clean the filter base as before with dH2O and 70% EtOH.Repeat Steps A9-A13 for each of the remaining WT and mutant replicates.Note: These steps are time sensitive. Shortening the time between when the cells are incubating to when they are frozen at -80 °C is critical for accurate expression data. Incubate cells at -80 °C for at least 1 h to ensure they are frozen before proceeding to RNA extraction.",
    "Note: Cells are stable at this stage for several days to weeks, so if many samples are needed, cell culturing and harvesting can be split up over multiple days prior to RNA extraction. RNA extraction and quantificationAliquot 300 µl 0.5 mm zirconia/silica disruption beads and 600 µl 25:24:1 phenol:chloroform:isoamyl alcohol to 1.5ml screw cap tubes and chill at 4 °C for at least 1 h (1 tube per cell culture replicate). Prepare fresh 600 µl RLT (Qiagen RNeasy Mini Kit) + 1% β-mercaptoethanol (BME) per sample and pre-chill in ice. Pre-chill 2 ml sterile dH2O per sample on ice. Pre-chill 1.5 ml microcentrifuge tubes (1 per sample) on ice.Note: Steps B2-B10 must be done at 4 °C. Keep materials on ice or work in a cold room. Remove 50 ml conical tube containing filter membrane and cells from -80 °C freezer and thaw on ice for 10 min.Wash cells off of filter membrane with 900 µl of chilled sterile dH2O and vortex at top speed for 30 s. Transfer suspension to chilled 1.5 ml microcentrifuge tube and place on ice.Wash filter a second time with an additional 900 µl of chilled sterile dH2O and vortex at top speed for 30 s. Transfer suspension to the same chilled 1.5 ml microcentrifuge tube and place on ice.Repeat Steps B3 and B4 for all samples using a new tube for each sample.Centrifuge in standard desktop microcentrifuge at max speed (≥ 17,100 x g) for 30 s and discard supernatant.Add 600 µl prepared RLT + 1% BME solution and resuspend by vortexing at max speed.Transfer 600 µl of cell suspension to chilled screwcap tubes with zirconia beads and phenol:chloroform:isoamyl alcohol.Bead beat for 3 min at 4 °C using the BioSpec MiniBeadBeater-16 Model  607  .",
    "Centrifuge cells at max speed for 8 min at 4 °C in standard desktop microcentrifuge.Transfer 550 µl of the aqueous layer to new RNase-free 1.5 ml microcentrifuge tube and add 550 µl 70% EtOH and mix by inverting 6 times.Note: If there is not 550 µl of aqueous solution, measure and transfer to the new tube and add an equal volume of 70% EtOH. Transfer up to 700 µl of sample to RNeasy spin column and centrifuge for 15 s at ≥ 8,000 x g. Discard flow-through. Reload column with remaining sample and spin again discarding flow-through.Note: All supplies referred to in Steps B12-B17 are provided in the Qiagen RNeasy Mini Kit Protocol for the Purification of Total RNA from Yeast. Steps B12-B16 of this protocol are the same as steps 2-5 of the Qiagen RNeasy Mini Kit protocol for Purification of Total RNA from Yeast. Add 700 µl Buffer RW1 to column and spin for 15 s at ≥ 8,000 x g. Discard flow-through.Add 500 µl Buffer RPE (with Ethanol added) to column and spin for 15 s at ≥ 8,000 x g. Discard flow-through.Repeat Step B14.Transfer spin column to a new collection tube and spin for 1 min at ≥ 8,000 x g. Discard flow-through.Transfer spin column to RNase-free 1.5 ml microcentrifuge tube (from kit). Add 40 µl RNase-free water to the column membrane and centrifuge for 1 min at ≥ 8,000 x g.Take 40µl eluate from Step B17 and re-apply to the spin column membrane and spin again for 1 min at ≥ 8,000 x g.Note: This is not strictly necessary but will increase overall concentration. Freeze samples immediately at -80 °C for storage.To quantify RNA and assess purity, prepare 1:500 dilution of total RNA and measure OD260 using Eppendorf BioPhotometer and Uvette 220-1,600 nm cuvettes.",
    "Notes: Average yield is typically over 2 µg/µl up to around 6 µg/µl. 260/280 and 260/230 values typically range between 2.0-2.2 and 2.5-2.5 respectively. Dilution and use of Uvettes may not be necessary depending on equipment available."
  ],
  "subjectAreas": [
    "Microbiology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}