{
  "id": 4525,
  "origin_website": "Bio",
  "title": "Binding Affinity Measurement of Antibodies from Crude Hybridoma Samples by SPR",
  "procedures": [
    "Immobilization of the antibodies from hybridoma supernatantsPrepare 167 µl of 30 µg/ml anti-mouse IgG solution in the 10 mM acetate buffer (pH 5).The capture reagent anti-mouse IgG then was immobilized in four flow cells (fc) using the amino coupling protocol and following the instructions described in the “Mouse antibody capture kit” using the PBS buffer as running buffer. At the end of the anti-mouse IgG immobilization, the regeneration solution was injected three times to remove any anti-mouse IgG non-covalent bound to the chip, leaving intact the covalent bound anti-mouse IgG. Note: Flow cells are formed when a microfluidic flow system is brought into contact with a sensor surface on which the ligand is immobilized. Here, the sample is injected separately through independent, unconnected flow cells, although other configurations as serial flow cells or hydrodynamic addressing flow cell systems are possible. The reagents and parameters used for the different steps (activation of the carboxymethyl groups of the chip surface, ligand immobilization, surface deactivation and regeneration) are compiled in Table 1. Note: An immobilization level of anti-mouse IgG around 9,000-10,000 Resonance Unit (RU) is usually obtained.Table 1. Immobilization procedure of the anti-mouse IgG antibody table:\n﻿0,1,2,3,4\nCycle,Reagent,Flow cell (fc),Contact time (sec),Flow rate (µl/min)\n1,1:1 (v/v) mixture of EDC (0.4 M) and NHS (0.1 M),\"1*, 2, 3, 4\",420,5 µl/min\n1,Anti-mouse IgG,\"1*, 2, 3, 4\",420,5 µl/min\n1,1 M Ethanolamine-HCl (pH 8.5),\"1*, 2, 3, 4\",420,5 µl/min\n2**,10 mM Glycine-HCl (pH 1.7),\"1*, 2, 3, 4\",3 times 60,50 µl/min",
    "Notes: *Flow cell 1 serves as a reference cell and is only immobilized with the anti-mouse IgG.          **This step is done in a different cycle and it is not shown in the Figure 1 below.An example of the sensorgram obtained for the anti-mouse IgG immobilization is shown in Figure 1 below. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20141103/20141103224943_6562.jpgFigure 1. Immobilization of the anti-mouse IgG on the sensor chipPrepare 300 µl of hybridoma supernatant solution 5-fold diluted by mixing 60 µl of the sample with 240 µl of 10 mM acetate buffer (pH 5.5).After the regeneration step, (in which the non-covalent bound anti-mouse IgG is removed from the surface without damaging non-covalent bound anti-mouse IgG), the antibodies from the hybridoma supernatants are captured non-covalently onto the surface via their Fc region by the anti-mouse IgG and the resulting complex is stabilized using a crosslink protocol independently on each flow cell.After antibody coupling, 3 successive injections of regeneration were done.The reagents and parameters used for cross-linking of the captured antibodies to the anti-mouse IgG (short activation of the carboxy groups, ligand immobilization, deactivation and regeneration) are compiled in Table 2. Note: A maximum binding level of the antibodies coupled to the anti-mouse IgG around 1,500-2,500 RU should be obtained. Multiple injections of the diluted hybridoma supernatants can be done for reaching this binding level. Table 2. Procedure of immobilization of the antibodies captured on the immobilized anti-mouse IgG antibody  table:\n﻿0,1,2,3,4\nCycle,Reagent,Flow cell (fc),Contact time (sec),Flow rate (µl/min)\n3,1:1 (v/v) mixture of EDC (0.4 M) and NHS (0.1 M),\"2, 3 or 4\",30,5 µl/min\n4,Hybridoma supernatant antibody sample,\"2, 3 or 4\",\"600-1,800\",5 µl/min\n5,1 M ethanolamine-HCl (pH 8.5),\"2, 3 or 4\",420,5 µl/min\n6,10 mM Glycine-HCl (pH 1.7),\"2, 3 or 43 times\",60,50 µl/min",
    "An example of the sensorgram obtained for the antibody sample coupling is shown in the Figure 2 below.Note: Alternatively, non-covalent capture of the antibodies without crosslinking can be performed by omitting the cycle 3 and cycle 5. For that, direct injection of the antibody sample is done after immobilization with the anti-mouse IgG, without performing an activation or deactivation of the surface. The non-covalent capture produces similar immobilization levels but the binding signal could decrease over cycles due to baseline drift during measurement and regeneration leading to lower dynamic range and decrease of the sensitivity of the assay. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20141103/20141103225050_3151.jpgFigure 2. Coupling of antibody sample using the cross-linking protocol (cycle 4) Analyte preparationIn order to have an accurate measurement, the analyte should be in the same buffer as the continuous flow buffer to minimize bulk refractive index differences and avoid the so called bulk effect, so that can lead to low signal-to-noise-ratios. This is often most easily achieved through dilution of a concentrated analyte stock into running buffer. Therefore, the protein was diluted in the running buffer at a concentration of 4,000, 2,000, 1,000, 5,00, 250, 125, 62.5, 31.25, 15.63 and 0 nM before analysis. Binding assayThe binding assay was performed using PBS as running buffer.Each dilution of the analyte sample was injected over flow cells 1, 2, 3 and 4. Injections were performed starting from 0 (PBS buffer blank) and followed by the lowest to the highest concentration at a flow rate of 50 µl/min for 90 sec.Once the injection was finished, the dissociation was performed by passing running buffer over the chip during 600 sec.",
    "Note: The contact time of the association phase should be long enough to have a curvature shape on the sensorgram and the contact time of the dissociation phase should be long enough to have a flat sensorgram after dissociation phase. After association and dissociation of the analyte, a regeneration step was performed in order to remove the remaining bound analyte. The 10 mM Glycine-HCl (pH 1.7) was selected as the optimal regeneration solutions because it allows the removal of the analyte bound to the ligand without changing the activity of the immobilized ligand. This was confirmed by the equal responses obtained from the binding assays before and after regeneration. Regeneration was performed with one injection of 3 sec (2.5 µl) of the regeneration solution.An example of the binding assay is shown in Table 3 below.Table 3. Summary of the binding assay conditions table:",
    "﻿0,1,2,3,4,5\nCycle,Status,Reagent,Flow cell (fc)*,Contact time (sec),Flow rate (µl/min)\n7,Association,\"Analyte (protein) (0 and 15.63-4,000 nM)\",\"2-1, 3-1 or 4-1\",90,50\n,Dissociation,PBS buffer blank,\"2-1, 3-1 or 4-1\",600,50\n,Regeneration,10 mM Glycine-HCl (pH 1.7),\"2-1, 3-1 or 4-1\",3,50",
    "Note: *Binding is studied on the sensorgrams subtracted with the reference flow cell fc1. A sensorgram of protein-antibody sample interaction is shown in Figure 3.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20141103/20141103225149_7824.jpgFigure 3. Binding assay Data analysis Data analysis is performed with the Biacore T100 Evaluation Software.Binding to the reference flow cell 1 was subtracted from each sample curve and maximal response unit was measured at 90 sec post injection. Best fitting was then established for 5 concentration of protein using the software. In general a 1:1 model Langmuir was selected for the fitting based on the expected interaction; alternatively in some cases a two-state reaction model was chosen.The kinetics constants (on-rate ka and off-rate kd) as well as the affinity (in terms of equilibrium dissociation constant KD) were then calculated. An example of the final fitting results using 5 concentrations of protein and with a model 1:1 Langmuir fitting (black curves) is shown in the Figure 4 and Table 4.Note: The final affinity measurement reported for the protein- antibody sample interaction was selected based on the Chi-square (Chi2), U-value and quality index.  The chi-square value is a quantitative measure of the closeness of fit, and in an ideal situation will approximate to the square of the short-term noise level. It is however difficult to recommend absolute values for acceptance limits for chi square: the values need to be considered from case to case, but it is advised to consider kinetics results with the lowest chi-square value. The U-value obtained using the 1:1 binding model fitting, is an additional indicator of the parameter significance. This is a parameter that represents the uniqueness of the calculated rate constants and Rmax, determined by testing the dependence of fitting on correlated variations between selected variables. Lower values indicate greater confidence in the results.",
    "A high value (above about 25) indicates that the reported kinetic constants contain no useful information. Finally, kinetic constants should be uniquely determined and within the limitation of the instrument.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20141103/20141103225219_7189.jpgFigure 4. Affinity measurementTable 4. Example of data extracted from the fitting procedure using the Biacore T100 evaluation softwareimgsrc:https://en-cdn.bio-protocol.org/attached/image/20141103/20141103225443_1611.jpgNote: Rmax corresponds to the analyte binding capacity of the surface,  tc corresponds to the flow rate independent part of the mass transfer constant,  kt corresponds to the mass transport constant and is calculate as following: kt= km*MW*109 Where km corresponds to the mass transport coefficient and is a function of the flow rate, flow cell dimensions and diffusion properties of the analyte,  RI to the bulk refractive index contribution in the sample."
  ],
  "subjectAreas": [
    "Immunology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}