{
  "id": 17133,
  "origin_website": "Jove",
  "title": "Modified Heterotopic Abdominal Heart Transplantation and a Novel Aortic Regurgitation Model in Rats",
  "procedures": [
    "All the animal procedures were conducted in accordance with \"An Outline of the Act on Welfare and Management of Animals\" and \"Standards Relating to the Care and Keeping and Reducing Pain of Laboratory Animals\" by the Ministry of the Environment, Government of Japan and the \"Guidelines for Proper Conduct of Animal Experiment\" by the Science Council of Japan16,17,18. The animal protocols were reviewed and approved by the Institutional Animal Care and Use Committee of the University of Tokyo (M-P19-065).\n1. Heterotopic abdominal heart transplantation in rats\nNOTE: Heterotopic abdominal heart transplantations were conducted in male Jcl:Wistar rats aged 7-9 weeks old. A microscope with 6.7x to 45x magnification was used to perform the procedure. The surgical instruments were autoclaved for sterilization.\nDonor heart harvest\n\t\nAnesthetize the donor rat via an intraperitoneal injection of medetomidine (0.15 mg/kg), midazolam (2.0 mg/kg), and butorphanol (2.5 mg/kg).\nPlace the rat in a supine position on a heating pad over the operative board, and fix the limbs using elastic bands. Remove as much fur as possible with an electric shaver and depilatory cream. Subsequently, clean the operating area with iodine and a 70% alcohol scrub three times for disinfection.\nMake a small incision of approximately 1 cm with scissors, followed by administering heparin to the abdomen (100 U).\nExtend the abdominal incision longitudinally from above the external urethral meatus to the subxiphoid process with scissors.\nExpose the abdominal aorta with sterilized cotton swabs, and transect with scissors to unload the donor's heart.\nIncise the diaphragm along the anterior chest wall, and open the thoracic wall with a V-shaped incision using scissors. Elevate the anterior chest wall beside the head, and fix it with pins.\nInitiate topical cooling of the heart using slushed ice.\nTape the inferior vena cava with a 5-0 silk suture.",
    "Remove the thymus with scissors, and subsequently identify the ascending aorta and PA originating from the heart. The ascending aorta and PA are on the right and left, respectively.\nTransect the brachiocephalic artery originating from the aortic arch with Potts scissors for additional exsanguination.\nInsert a 23 G needle into the inferior vena cava, and administer 2-3 mL of cold-modified Krebs-Henseleit cardioplegic solution. After the administration, the heart gradually stops beating. Simultaneously, ensure that the blood within the heart is drained out as much as possible.\nLigate the inferior vena cava with 5-0 silk, and divide it distally to the ligature using Potts scissors.\nAfter dissecting the connective tissue between the right lung and the esophagus with scissors, ligate the hilum of the right lung with 5-0 silk, and divide it distally to the ligature with scissors.\nLigate the right superior vena cava with 5-0 silk, and divide it distally to the ligature with Potts scissors.\nInsert one blade of the Potts scissors into the transverse sinus and divide the ascending aorta and PA en bloc as distally as possible.\nLigate the left superior vena cava with a 5-0 silk suture, and divide it distally to the ligature and proximally to the azygos vein with Potts scissors.\nAfter dissecting the connective tissue between the left lung and the esophagus with scissors, ligate the hilum of the left lung with a 5-0 silk suture, and divide it distally to the ligature with scissors.\nLigate the base of the heart with a 5-0 silk suture, and divide it distally to the ligature with scissors. This silk is used to retract the donor's heart during the anastomosis of the donor's heart. At this time, remove the donor's heart from the pericardial cavity.",
    "After placing the donor's heart on the plate filled with slushed ice and cold normal saline, dissect the connective tissue between the ascending aorta and the PA using micro tweezers.\nPerfuse 2-3 mL of cold-modified Krebs-Henseleit cardioplegic solution from the ascending aorta into the coronary arteries by clamping the ostium of the ascending aorta with tweezers until the red color of the coronary arteries is diminished.\nStore the donor's heart in a cold-modified Krebs-Henseleit cardioplegic solution.\nRecipient preparation\n\tNOTE: Before harvesting the donor's heart, complete the recipient preparation.\n\t\nAnesthetize the recipient rat via an intraperitoneal injection of medetomidine (0.15 mg/kg), midazolam (2.0 mg/kg), and butorphanol (2.5 mg/kg). After endotracheal intubation using a 16 G intravenous catheter, maintain the anesthesia via sevoflurane inhalation (induction at 5.0% and maintenance at 2.5% with an O2 flow rate of 0.3 L/min).\nPlace the rat in a supine position on a heating pad laid over the operative board, and fix the limbs using elastic bands. Remove as much fur as possible with an electric shaver and depilatory cream. Additionally, clean the surgical site with iodine and a 70% alcohol scrub three times for disinfection.\nUsing scissors, make a midline abdominal incision of approximately 6-7 cm above the external urethral meatus to the subxiphoid process.\nRetract the small intestine toward the upper-right side of the recipient with sterilized cotton swabs, and wrap it with gauze soaked with warm normal saline.\nDissect the connective tissue between the small intestine and colon with scissors.\nDissect the avascular area of the colon with scissors, and tape with two strip-like gauze pieces to retract the colon to the left.\nExpose the abdominal aorta and inferior vena cava with sterilized cotton swabs. Ligate the relatively large branches of both vessels with 9-0 nylon, and divide.\nHeterotopic heart transplantation",
    "Administer heparin to the recipient's abdomen (100 U) before initiating the donor heart transplantation.\nClamp the abdominal aorta and inferior vena cava en bloc with side-biting clamp forceps.\nPuncture the abdominal aorta with a 90° bent 23 G needle, and extend the hole longitudinally with Potts scissors to at least the diameter of the donor's ascending aorta. Subsequently, flush the lumen with heparinized normal saline (10 U/mL) to remove clots.\nPosition the sterilized small plate on the right side of the recipient's abdominal aorta and inferior vena cava. Place the donor's heart on the plate filled with slushed ice and cold normal saline, which should be replenished every 5 min.\nTie the donor's ascending aorta to the recipient's abdominal aorta with two 9-0 nylon stay sutures at the 12 o'clock and 6 o'clock positions.\nRotate the operative board clockwise by 90°.\nAnastomose the left side of the recipient's abdominal aorta and the donor's ascending aorta using a running 9-0 nylon suture from the caudal to the cranial direction, and tie with a 9-0 nylon stay suture at the 12 o'clock position (total of seven to eight sutures).\nRotate the operative board counterclockwise by 180°. Translocate the donor's heart to the left of the recipient's abdominal aorta and inferior vena cava. It is easy to retract the donor's heart toward the left side with the 5-0 silk suture that was used when ligating the base of the donor's heart (step 1.1.18).\nAnastomose the right side of the recipient's abdominal aorta and the donor's ascending aorta using a running 9-0 nylon suture from the cranial to the caudal direction, and tie with a 9-0 nylon stay suture at the 6 o'clock position (total of seven to eight sutures).",
    "Puncture the inferior vena cava using a 90° bent 23 G needle distally to the anastomosis between the donor's ascending aorta and the recipient's abdominal aorta, and extend the hole longitudinally with Potts scissors to greater than the diameter of the donor's PA. Subsequently, flush the lumen with heparinized normal saline to eliminate clots.\nTie the donor's PA to the recipient's inferior vena cava using a 9-0 nylon stay suture at the 6 o'clock position.\nAnastomose the left side of the recipient's inferior vena cava and the donor's PA with a running 9-0 nylon suture from the caudal to the cranial direction (total of seven to eight sutures).\nTie the donor's PA to the recipient's inferior vena cava with a 9-0 nylon stay suture at the 12 o'clock position. Additionally, tie this stay suture to the 9-0 nylon on the left side of the anastomosis between the donor's PA and the recipient's inferior vena cava.\nAnastomose the right side of the recipient's inferior vena cava and the donor's PA using a running 9-0 nylon suture from the cranial to the caudal direction, and tie with the 6 o'clock stay suture (total of 10-12 sutures).\nApply hemostatic agents to both the anastomoses, and place gauze around them.\nAfter releasing the side-biting clamp forceps, compress the anastomoses gently with sterilized cotton swabs to facilitate hemostasis. Subsequently, apply warm normal saline to the donor's heart to provide warmth. The donor's heart begins to fibrillate within a few tens of seconds and recovers to sinus rhythm after a few minutes.\nReturn the small intestine to the recipient's abdomen using sterilized cotton swabs. Care should be taken to prevent compressing the donor's heart or twisting the small intestine.",
    "Close the abdominal wall using a running 4-0 silk suture. After administering atipamezole (0.75 mg/kg) into the abdomen, close the skin with a running 4-0 silk suture.\nDiscontinue the inhalation anesthesia, and inject 1 mL of 1% lidocaine under the incision. Additionally, inject 2 mL of warm normal saline subcutaneously to compensate for blood loss.\nWarm the recipient rat using a light-emitting diode lamp. The recipient rat regains consciousness and can be extubated at approximately 30-40 min after inhalation anesthesia is discontinued.\n2. Novel AR model using heterotopic abdominal heart transplantation in rats\nNOTE: A novel AR model using heterotopic abdominal heart transplantation was generated using male Jcl:Wistar rats aged 7-9 weeks old. A microscope with 6.7x to 45x magnification was used to perform the procedure. The surgical instruments were autoclaved for sterilization.\nDonor heart harvest\n\tNOTE: A modified Petri dish with a hole in the center, pliers, and a stiff guidewire are required to create the new AR model (Figure 1).\n\t\nAs described above, harvest the donor's heart using a similar procedure to the normal transplant in rats, except for the steps concerning the ascending aorta and PA transection (1.1.1-1.1.14, 1.1.16-1.1.17)\nBefore transecting the ascending aorta and PA, remove the adipose tissue on the front of both vessels using Potts scissors. Subsequently, dissect the connective tissue between both vessels using tweezers.\nInsert one blade of the Potts scissors into the transverse sinus. Pull the Potts scissors toward the operator, and insert the blade between the ascending aorta and the PA. Subsequently, transect only the PA (Figure 2A), followed by transecting the aorta distally to the brachiocephalic artery using Potts scissors (Figure 2B).",
    "After ligating the base of the heart using a 5-0 silk suture and dividing it distally to the ligature with scissors, dissect the connective tissue between the ascending aorta and the PA, and perfuse cold-modified Krebs-Henseleit cardioplegic solution into the coronary arteries using a similar procedure to the normal transplant (steps 1.1.18-1.1.20).\nFix the donor's heart with pliers (Figure 2C). Subsequently, cover the donor's heart with a modified Petri dish with a hole in the center, and immobilize the ascending aorta with a vascular clip.\nInsert a stiff guidewire into the brachiocephalic artery (Figure 2D). Push the guidewire further even after resistance is met, and pierce the aortic valve if a loss of resistance is confirmed. Perform multiple punctures if a severe AR model is to be created.\nTransect the aorta proximally to the brachiocephalic artery to remove the portion clamped with the vascular clip (Figure 2E). Subsequently, store the donor's heart in cold-modified Krebs-Henseleit cardioplegic solution using a procedure similar to the normal transplant (step 1.1.21).\nRecipient preparation\n\tNOTE: Before harvesting the donor's heart, complete the recipient preparation.\n\t\nAs described above, the recipient preparation procedure is similar to that of the normal transplant (steps 1.2.1-1.2.7).\nHeterotopic heart transplantation\n\t\nAs described above, the donor's heart transplantation procedure is similar to the normal transplantation (steps 1.3.1-1.3.20).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}