{
  "id": 4891,
  "origin_website": "Bio",
  "title": "Process and Analysis of Kidney Infiltrates by Flow Cytometry from Murine Lupus Nephritis",
  "procedures": [
    "Procedure for harvesting the kidney from nephritic mice for analysis of kidney infiltrates.   Anesthetize the mouse and perfuse with 60 ml of cold PBS over 3-5 min through the left ventricle after snipping the right atrium, and observe for pale white color change in liver and kidney. If needed, repeat perfusion with another 60 ml of cold PBS.   Carefully remove and cut the kidneys into 1 to 2 mm3 pieces, excluding any adjoining renal fat.   Incubate the slices in DMEM containing 2 mg/ml Collagenase Type I (Worthington) for 30 min at 37 °C (use 10 ml per two kidneys).   Gently disrupt the tissue by pipetting up and down sequentially through 25 ml, 10 ml, and 5 ml pipettes to obtain a fine cell suspension.   Filter the cell suspension through a BD cell strainer (70 nm) into a conical tube.   Gently rub the remaining material between two glass slides, resuspend in 2 ml DMEM, filter and add to the suspension.   Allow the suspension to settle briefly (3-5 min) during which most of the larger fragments settle to the bottom. Harvest the suspension excluding the bottom 200 μl containing the fragments.   Examine the settled cells under a microscope to see if any clumps are present. If so, resuspend the settled cells in fresh DMEM, filter and repeat step 6.   Pool the suspension(s) obtained and centrifuge at 1,200 rpm for 10 min.   Decant supernatant; resuspend the pellet in 5 ml of ice cold ammonium chloride (0.17 M, pH 7.2) for 5 min on ice.   Add 15 ml of serum free DMEM. Count cells to estimate the number of total cells in the suspension. Spin at 1,200 rpm for 5 min.   Resuspend cells in 1 ml of FACS buffer (3% fetal calf serum in PBS).",
    "Cells are now ready for flow cytometric analysis or further isolation procedures.      Procedure for the analysis of kidney infiltrates by flow cytometry   Reuspend the kidney cells in Fc block (CD16/CD32) for 15 min, adjusting the total suspension volume to approximately 100 µl per stain. Use a maximum of 1 ml (10 stains) for one whole kidney.   Distribute the cells accordingly into a 96 well V bottom plate (100 µl per well).   Add biotinylated antibodies (1/200 dilution), mix gently and incubate for 30 min on ice. Keep the plates in the dark throughout the incubation.   Meanwhile, mix the next cocktail of antibodies of your choice together with the streptavidin fluorochrome in a single tube (1/200 dilution of each antibody in FACS staining buffer). Include a set of stains using isotype controls.   To remove the unbound or excess stain add 100 μl of ice cold PBS to the wells after 30 min of incubation. Centrifuge the plate for 5 min at 1,200 rpm at 4 °C.   Discard the liquid by inverting the plate once without disturbing the cell pellet.   Add the cocktail of antibodies from step 4 to the pellet (100 µl /well) and gently resuspend using a multichannel pipette. Incubate the plate for another 30 min on ice.   Repeat steps 5 and 6.   Resuspend the cells in 200 µl of 2% paraformaldehyde, transfer and store in FACS tubes in the dark until the time of acquisition on the flow cytometer (within 24 h).   Analysis of the acquired cells was carried out in flowjo software to identify the type of cells within the infiltrates and their percentage within the kidney."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}