{
  "id": 17871,
  "origin_website": "Jove",
  "title": "Ultrasonography of the Adult Male Urinary Tract for Urinary Functional Testing",
  "procedures": [
    "Procedures involving animal subjects have been approved by the Institutional Animal Care and Use Committee (IACUC) at the University of Wisconsin – Madison.\n1. Animal preparation\nPlace a 24-month-old, C57Bl6/J male mouse in a pre-charged chamber with 3-5% isoflurane until the righting reflex is lost and the breathing rate slows.\nIf necessary, use clippers to shave the abdominal hair from the animal for surgery and/or imaging. Remove all remaining hair using a depilatory cream. \nPlace the mouse in a supine position in a nose cone with 2% isoflurane on a heated platform to maintain anesthesia. Confirm the depth of anesthesia by loss of motion from the animal in response to a pedal-withdrawal reflex (Figure 1B).\n2. Ultrasound set-up\nConnect a MV707 probe with center frequency of 30 MHz to the active-port, with the application preset to \"abdominal imaging\" (Figure 1A).\nPosition the ultrasound probe parallel to the long axis of the bladder (Figure 1C).\nLong and short axis images of the bladder, the prostate, and the urethra are made in B-Mode (Figure 1D).\nUse the \"xy\" micro-manipulators to move the mouse.\n3. Non-contrast imaging protocol\nMeasure the bladder wall thickness using the linear distance measurement tool and tracing the outside edge to inside edge of the bladder wall b-mode post acquisition.\nMeasure the bladder 3D volume with the volumetric tool on the 3D mode acquisition by tracing the inside of the bladder walls to create a contour. Multiple contours are then generated through the thickness of the bladder to calculate volume.\n4. Microbubble contrast resuspension/activation\nActivate the contrast agent (e.g., DEFINITY) by shaking in the vortex mixer for 45 s to encapsulate the microbubbles in solution. This step is critical for optimum contrast enhancement.\n5. Catheter insertion",
    "With the mouse anesthetized and taped to the heated platform, expose the bladder with a midline incision using straight sharp/blunt scissors through the skin and abdominal wall.\nInsert a 27-gauge needle connected to a syringe by flexible polyethylene tubing (PE 50) into the bladder. Prefill the tubing with saline to ensure no air bubbles are injected into the bladder.\n6. Contrast-enhanced imaging protocol\nTo confirm needle placement, instill 10 µL of saline into the bladder while being observed via ultrasound.\nReplace the saline syringe with a syringe containing contrast to improve visualization of urethral walls and voiding events, because the urethra is normally collapsed. Once a complete long axis view of the urethra is obtained and an image saved, rotate the probe 90° to obtain a short axis view and an M-Mode image.\nInstill a bolus of microbubbles at 0.5 mL per 3 s into the bladder until a urination event occurs.\nDuring the first voiding event, measure the urethral diameter at the point of the Doppler velocity sample window using the linear distance tool and measuring edge to edge.\nWith the urethra properly located, angle the probe in relation to the urethra to become more parallel to the urine flow.\nInstill a second bolus of microbubbles into the bladder, and measure the event velocity using the velocity time integral (VTI) tool.\nAfter data collection, euthanize the mouse with cervical dislocation.\n7. Data Calculation and Analysis\nSelect the VTI tool to measure velocity by tracing the recorded images.\nMeasure the diameter of the urethra from the B-mode or M-mode image using the leading edge to leading edge convention.\nCalculate the cross-sectional area (CSA) using the following formula (CSA ) using image measurements obtained above.",
    "Calculate the void volume using the CSA of the urethra and multiplying that by the area under the Doppler trace (velocity time integral)(CSA x VTI = volume).\nCalculate the actual voided urine volume assuming one gram per cubic centimeter density.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}