{
  "id": 5927,
  "origin_website": "Bio",
  "title": "Multiple Stepwise Gene Knockout Using CRISPR/Cas9 in <em>Escherichia coli</em>",
  "procedures": [
    "Generally, our CRISPR/Cas9 knockout protocol for Escherichia coli employs three main components:1) pCasRed plasmid (Procedure A) 2) pCRISPR-SacB-gDNA plasmid (Procedure B) 3) The mutagenic double-stranded donor DNA oligonucleotide (Procedure C).First, we transform with the pCasRed plasmid (1), which encodes not only the Cas9 endonuclease but also the λ Red machinery (see Procedure A for details). In a subsequent step, we then co-transform with the pCRISPR-SacB-gDNA plasmid (2) and the mutagenic double-stranded donor DNA (3).Our protocol results in the inactivation of a target gene by directing the Cas9 endonuclease to the 5’-end of the target locus through a specifically designed guide RNA, encoded and previously cloned into the pCRSIPR-SacB-gDNA plasmid (see Procedure B for details). Upon DNA cleavage at the target locus, the mutagenic double-stranded donor DNA (ds-dDNA) allows for λ Red-assisted repair of the double strand break, thereby introducing an in-frame stop codon and removing the original protospacer adjacent motif (PAM) region (Figure 1). A workflow is shown in Figure 2.When required, plasmid curing can be executed through sucrose selection, following Hale et al. (2010) (for other references see Gay et al., 1983; Steinmetz et al., 1983; Gay et al., 1985; Murphy et al., 2000). Briefly, the SacB gene encodes for levansucrase from Bacillus subtilis, which metabolizes sucrose into a toxic product if E.coli grows in the presence of this disaccharide. Therefore, cells will only grow if they have lost the pCRISPR-SacB-gDNA plasmid.Concerning the length of deletion and the length of the ds-dDNA you may adapt this protocol for your own needs. Here, we generally describe 30 nucleotide deletions, corresponding to the target site using ds-dDNA of 70 base pairs. However, in our laboratory, we observed that longer deletions of up to 2,200 nucleotides work better with ds-dDNA of 120 base pairs (Zerbini et al., 2017).",
    "Before you get started, you should start with the design of guides (Procedure B, Figure 3), donors and primers (Procedure C, Figure 4 and Figure 5, respectively). We recommend ordering them before moving to the wet laboratory procedures. We also recommend referring to the oligonucleotide sequences (target sites, donor DNAs, primers for colony PCR) published in our original research paper (Zerbini et al., 2017) if you want to include any positive control in your own experiments.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180114/20180114194030_9119.jpgFigure 1. Overview of CRISPR/Cas9 genome editing strategy in Escherichia coli. A shows all three main components required for genome editing in E. coli: 1) the pCasRed plasmid expressing the λ Red (Exo, Beta, Gam) machinery, the Cas9 endonuclease, and the tracrRNA; 2) the pCRISPR-SacB-gDNA plasmid encoding the gRNA and the SacB gene; 3) a synthetic, double-stranded mutagenic oligonucleotide (ds-dDNA). After transformation, the tracrRNA anneals to the gRNA, which specifies the site of cleavage for Cas9 resulting in a three-component complex at the target locus, where the endonuclease activity mediates a chromosomal DNA double strand break (B). The double strand break is subsequently repaired by λ Red-mediated homologous recombination taking place between the extremities of the cleaved chromosomal DNA and the ds-dDNA (C).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180114/20180114194131_8311.jpgFigure 2. Schematic workflow for gene knockout in E. coli using the CRISPR/Cas9 technology. Step 1 includes the construction of the three main components needed for this protocol (see Figure 1). The E. coli strain you want to gene-edit (e.g., E. coli BL21(DE3)) has to be transformed with the pCasRed plasmid first (note asterisk, see Step E4a.i). The E. coli + pCasRed strain is the starting point for mutagenesis (Step 2), in which fresh electrocompetent cells are prepared (Step E3) and directly used for transformation (Step E4).",
    "The next day, a colony PCR is performed to identify positive knockout mutants (Steps E5 and E6), which are subsequently inoculated in liquid LB medium containing 5% sucrose for curing of the pCRISPR-SacB-gDNA used before (Step 3). Here, the protocol can be stopped or you continue with another round of mutagenesis following only the procedures from Step 2 highlighted in the dotted box. Legend: chloramphenicol (Cm), wild type (WT), positive mutant (+), escaper (-).Required plasmidsThe pCasRed plasmid (Zerbini et al., 2017) derives from the pCas9 plasmid from Addgene (#42876) and is available from our laboratory upon request.Briefly, pCasRed encodes the Cas9 nuclease, the λ Red (Exo, Beta, Gam) cassette, the trans-activating CRISPR RNA (tracrRNA), and contains a chloramphenicol resistance gene. The Cas9 gene and the tracrRNA coding sequence are under the control of constitutive promoters while the λ Red gene cassette is transcribed using an arabinose-inducible promoter (pBAD).The pCRISPR-SacB plasmid (Zerbini et al., 2017) is available from our laboratory upon request. It derives from the pCRISPR plasmid and the pKM154 plasmid from Addgene (#42875 and #13036, respectively). Briefly, pCRISPR-SacB contains a cloning site, which allows insertion of a self-designed (see Procedure B), synthetic DNA fragment coding for the desired guide RNA, between two repeat strings under the constitutive PLtetO-1 promotor. It also carries a kanamycin resistance gene (KmR) fused to the sacB gene encoding the Bacillus subtilis levansucrase.Selection of Cas9 target sites and construction of pCRISPR-SacB-gDNA plasmidNote: Selection of Cas9 target sites is crucial to avoid off-target effects of the Cas9 endonuclease. Figure 3 illustrates how to identify target sites. Identify a PAM sequence within the target gene (5’-NGG-3’)Note: The PAM region should be close to the 5’-end as this protocol aims to achieve knockout through inactivation of the target gene.",
    "Select the 30 base pairs (bp) upstream of the identified PAM sequence (protospacer) and BLAST (Altschul et al., 1990) them against the E. coli BL21(DE3) genome (GenBank accession number CP010816[href=https://www.ncbi.nlm.nih.gov/nuccore/753774531/]) (or any other strain you are going to use).Note: Make sure that these 30 bp do not include any complementary nucleotides among the PAM-proximal 10-12 nucleotides, defined as the seed region.Besides, to avoid off-target effects, the remaining PAM-distal part of the chosen sequence should share less than 15% homology with any other region of the remaining genome.Order two complementary single-stranded synthetic oligonucleotides covering the protospacer minus the PAM region as described above, and five additional nucleotides to support the ligation during the subsequent cloning step (for example see Figure 3). The will code for the gene-specific guide RNA.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180114/20180114194750_9965.jpgFigure 3. Illustration on how to select a gene-specific Cas9 target site. To design the guide DNA (gDNA) identify a PAM sequence (5’-NGG-3’, where N stands for any of the four nucleotides) near the 5’ end of the target gene. Then, select the 30 nucleotides upstream of the PAM region (protospacer). BLAST the entire sequence (protospacer + PAM), which is going to be the core of the forward oligonucleotide of your gDNA, against the genome of the target organism. To avoid Cas9 off-target effect, a ‘reliable’ gDNA should not have any homology among the 10-12 PAM-proximal nucleotides (seed region, in green) and less than 15% homology among the remaining protospacer when blasted against the rest of the genome. Finally, the chosen protospacer + PAM sequence is completed by the addition of five base pairs (in red) to facilitate the ligation for the subsequent cloning of the pCRISPR-SacB-gDNA, resulting in the forward oligonucleotide of the gDNA sequence.",
    "The reverse oligonucleotide of the gDNA is the reverse complement of the protospacer + PAM forward sequence with the addition of five base pairs (in red) as done for the forward oligonucleotide.The synthetic DNA fragments have to be cloned into the pCRISPR-SacB as follows:Use T4 PNK to phosphorylate the two complementary single-stranded synthetic oligonucleotides encoding the gDNA.1 µl oligonucleotide 1 (100 µM)1 µl oligonucleotide 2 (100 µM)5 µl 10x T4 ligase buffer 1 µl T4 PNK 42 µl MilliQ water (final volume 50 µl)Note: If you have oligonucleotides diluted to concentrations other than 100 µM (e.g., 50 µM), make sure you adjust the volume of oligonucleotide 1 and 2 (e.g., 2 µl) and MilliQ water (e.g., 40 µl) to get a final volume of 50 µl.Incubate for 30 min at 37 °C.For annealing, add 2.5 µl of 1 M NaCl to the reaction mix and heat to 95 °C for 5 min. Allow to cool down slowly to room temperature by simply switching off the thermoblock (ca. 2 h). In the meanwhile, proceed with Steps B4e-B4h.Digest the pCRISPR-SacB with BsaI. 10 µl pCRISPR-SacB (100 ng/µl, total amount ca. 1-2 µg)1 µl BsaI5 µl 10x NEB Buffer34 µl MilliQ water (final volume 50 µl)Note: If your pCRISPR-SacB plasmid is diluted to concentrations other than 100 ng/µl (e.g., 50 ng/µl), make sure you adjust the volume of the plasmid (e.g., 20 µl) and MilliQ water (e.g., 24 µl) to get a final volume of 50 µl.Incubate for 1 h at 37 °C.Dephosphorylate the digested pCRISPR-SacB plasmid using Calf Intestinal Alkaline Phosphatase (CIP).",
    "5 µl 10x CutSmart Buffer1 µl CIP 25 µl pCRISPR-SacB plasmid cleaned in a PCR cleaning column (20 ng/µl, total amount of 500 ng plasmid)19 µl MilliQ waterNote: If the purified pCRISPR-SacB plasmid is diluted to concentrations other than 20 ng/µl (e.g., 15 ng/µl), make sure you adjust the volume of the plasmid (e.g., 33.3 µl) and MilliQ water (e.g., 10.7 µl) to get a final volume of 50 µl. The concentration of your plasmid after purification should therefore not be lower than 11.4 ng/µl!Incubate for 2 h at 37 °C.Purify the plasmid directly from the reaction mix using the Wizard® SV Gel and PCR Clean-Up System.To generate the pCRISPR-SacB-gDNA plasmid perform a final ligation step as follows:3 µl digested pCRISPR-SacB (10 ng/µl, total amount of ca. 30 ng plasmid)2 µl phosphorylated, double-stranded gDNA (1 μM)1 µl T4 ligase2 µl T4 ligase buffer 12 µl MilliQ waterNote: You may use different volumes, but make sure the concentrations remain the same in a final volume of 20 µl.Incubate for 2 h at room temperature.Note: Alternatively, if your time does not allow proceeding the same day, you may also incubate overnight at 16 °C.The ligation reaction (10 µl) is used to transform E. coli DH5α chemically competent cells to obtain the pCRISPR-SacB-gDNA plasmid (see Step E2 for transformation via heat-shock).Note: If you do not want to use commercial E. coli DH5α cells, you can also prepare your own batch of chemically competent cells (Step E1). Incubate at 37 °C with vigorous shaking (200 rpm) for 1 h. Plate the transformation mix on LB-agar (see Recipes) containing kanamycin (50 µg/ml).Note: As transformation efficiency should be high at this stage, do not plate the entire transformation mix but rather 100 µl or 200 µl only. Incubate the LB-agar plate at 37 °C overnight.",
    "Inoculate 5 ml LB containing kanamycin (50 µg/ml) from a single colony and incubate at 37 °C overnight.Isolate the plasmid from the overnight culture using a QIAprep Spin Miniprep Kit.Analyze the plasmid by DNA sequencing using a primer (primer sequence: 5’-GCCCAGTCATAGCCGAATAG-3’) for the plasmid annealing downstream of the inserted fragment encoding the guide. The primer can be used for all pCRISPR-SacB-gDNAs and is therefore universal for every cloning of different guides.If positive, your pCRISPR-SacB-gDNA plasmid is ready for the following mutagenesis step (Step E4a.ii).Design of mutagenic donor DNA and primers for PCR screeningWe recommend designing your mutagenic donor DNA (dDNA) in a way that will result in the deletion of 30 nucleotides (∆30) within your target gene through the removal of the protospacer and the PAM region (to avoid post-mutation Cas9 cleavage). At the same time, an in-frame stop codon has to be inserted close to the 5’-end of the target gene, thereby inactivating it. Note that the trinucleotide encoding the stop codon has no complementary sequence on the target strand (Figure 4). In our hands, this strategy works well to achieve gene knockout. For a schematic example, refer to Figure 4. Note that the length of the deletion can be adapted to your needs. However, in case of longer deletions you may have to increase also the length of the dDNA.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180114/20180114195205_5610.jpgFigure 4. Design of the dDNA. The donor DNA (dDNA) can vary in length (e.g., 70 or 120 nucleotides, see text). To delete the protospacer + PAM region identified for Cas9 cleavage (Figure 3), the 5’ moiety of the dDNA (35 or 60 nucleotides) has to be complementary to the sequence upstream of the protospacer region, while the 3’ moiety of the dDNA (35 or 60 nucleotides) has to be complementary to the sequence downstream of the protospacer.",
    "To inactivate the transcript, an in-frame stop codon (TAA) is inserted, and the PAM region (NGG) is also eliminated to prevent further cleavage through Cas9. Finally, a reverse complement oligonucleotide is designed to get a double-stranded dDNA.We explicitly recommend the use of double-stranded mutagenic oligonucleotides (ds-dDNAs), preferably in HPLC purification grade, as this considerably increases mutagenesis efficiency (Zerbini et al., 2017). Thus, design both forward and reverse oligonucleotides. For ∆30 deletions, we recommend dDNA of 70 nucleotides in length. Finally, the ds-dDNA is generated by annealing 10 µg of each complementary oligonucleotide pair in a total volume of 20 µl at 95 °C for 5 min and allowing the reaction mix to slowly cool down to room temperature by switching off the thermoblock. The annealing reaction is verified by loading 500 ng of each single stranded oligonucleotides and 1 µg of total DNA in the annealing reaction and by visualizing the bands using ATLAS ClearSight DNA Stain. The band corresponding to the single stranded oligonucleotides must disappear in the annealing reaction sample.The primers necessary for colony PCR screening following the mutagenesis step (Step E4a.ii) should be designed in order to get an amplified DNA fragment of ca. 200 bp, a fragment length that is ideal to distinguish the difference of a 30 bp deletion between the wild-type colony and a mutated colony. For a schematic example, refer to Figure 5.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180114/20180114195302_5318.jpgFigure 5. Illustration of the colony PCR. The forward and reverse primers for PCR are designed to anneal upstream and downstream of the protospacer + PAM sequence, respectively, resulting in the amplification of a ~200 bp fragment in the wild type. According to the size of deletion (e.g., Δ30), a knockout mutant can be identified by its shorter PCR fragment (e.g., ~170 bp) compared to the wild type (A).",
    "The PCR fragments different in size can be identified by running a 2% agarose gel electrophoresis (B). Legend: marker (M), wild type control (*), mutant (+), wild type ‘escaper’ (-).Bacterial strains and culture conditionsNote: Make sure you use the correct antibiotic required for selection of your E. coli strain. We routinely use the DH5α and BL21(DE3) strain. For any experimental step, grow the Escherichia coli strain in LB broth (Sigma-Aldrich) at 37 °C with vigorous shaking (200 rpm), if not stated otherwise.Prepare stocks of your strains in LB + glycerol (15-25% final concentration) and store them at -80 °C.Example: For a stock of 1 ml prepare 200 μl of 75% glycerol and add 800 μl of your strain after overnight growth.Start from an overnight culture taken from a frozen/glycerol stock before each bacterial manipulation step, if not stated otherwise.Gene knockout using CRISPR/Cas9For preparation of the pCRISPR-SacB-gDNA plasmids (see Step B4) we recommend using E. coli DH5α cells, which have to be made chemically competent and transformed via heat-shock (Steps E1 and E2). Instead, the strain you want to use for all mutagenesis experiments should be prepared for electroporation (Steps E3 and E4) to increase transformation efficiency.The strain should be first transformed via electroporation (Step E4) with the pCasRed plasmid (from Step A1) before transforming via electroporation with the pCRISPR-SacB-gDNA plasmid (generated in Step B4).Preparation of chemically competent cellsStreak E. coli DH5α on an LB-agar plate and incubate at 37 °C overnight.Inoculate a pre-culture of 5 ml LB medium (see Recipes) from a single colony and incubate at 37 °C with vigorous shaking (200 rpm) overnight.Dilute the overnight culture to an OD600 nm of 0.1 in LB (e.g., 50 ml) and incubate at 37 °C with vigorous shaking (200 rpm) until an OD600 nm of 0.4-0.6 is reached (ca. 2 h).",
    "Transfer the culture to a 50 ml tube and harvest the cells by centrifugation at 4 °C, 2,500 x g for 20 min.Discard the supernatant and resuspend the pellet in 5 ml of ice-cold, sterile 100 mM MgCl2.Keep the suspension on ice for 30 min.Harvest the cells by centrifugation at 2,500 x g for 20 min.Discard the supernatant and gently resuspend the cell pellet in 1 ml of ice-cold, sterile 100 mM CaCl2 in 15% glycerol and prepare aliquots of 110 µl.Note: If you started with a higher culture volume keep a ratio of 10 ml 100 mM CaCl2 in 15% glycerol/50 ml starting culture for resuspension.Use the aliquots freshly for the subsequent transformation via heat-shock (see Step E2)Note: If some aliquots remain, store them at -80 °C.Transformation via heat-shockMix 50 μl of chemically competent cells with 10 μl of ligation mix (see Step B4l). Keep the reaction mix on ice for 30 min.Transfer the cells to a thermoblock set at 42 °C for 45 sec.Keep the cells on ice for 2 min.Add 940 µl LB and incubate the cells at 37 °C with vigorous shaking (200 rpm) for 1 h. Plate the cells on LB-agar plates containing the appropriate antibiotic (chloramphenicol 25 µg/ml for transformation with pCasRed plasmid or kanamycin 50 µg/ml for transformation with pCRISPR-SacB-gDNA)Note: We recommend plating 100 μl and 900 μl of the transformation mix separately, but if you prefer you may choose different volumes (e.g., 500 µl or 250 µl).Incubate at 37 °C overnight.Count the colonies to determine the transformation efficiency of your chemically competent cells.Preparation of electrocompetent cellsStreak your E. coli strain on an LB-agar plate and incubate at 37 °C overnight.",
    "Inoculate a pre-culture of 5 ml LB medium (see Recipes) from a single colony and incubate at 37 °C with vigorous shaking (200 rpm, overnight)Note: If you already performed a mutation round, use the overnight culture from the plasmid curing step (see Step E7).Dilute the overnight culture to an OD600 nm of 0.1 in LB (e.g., 50 ml) and incubate at 37 °C wih vigorous shaking (200 rpm) until an OD600 nm of 0.6-0.8 is reached (ca. 2-3 h).Note: If you prepare competent cells from a strain previously transformed with the pCasRed plasmid, make sure your media contains chloramphenicol (25 µg/ml) and add L-(+)-arabinose (final concentration of 0.2%, see Recipes) at an OD600 nm of 0.2 to the cells for the induction of λ Red genes.Transfer the culture into a 50 ml tube and harvest the cells by centrifugation at 4 °C, 4,100 x g for 20-30 min.Discard the supernatant and resuspend the pellet in 50 ml ice-cold, sterile MilliQ water. Centrifuge again at 4 °C, 4,100 x g for 10 min. Repeat this wash step three times.Finally, wash the pellet with ice-cold, sterile 10% glycerol and centrifuge again at 4 °C, 4,100 x g for 10 min.Discard as much supernatant as possible. Immediately resuspend the cell pellet in 250 µl ice-cold, sterile 10% glycerol and prepare 110 µl aliquots.Note: If you started with a higher culture volume, keep a ratio of 250 µl 10% glycerol/50 ml starting culture for resuspension.Use the aliquots freshly for the subsequent transformation via electroporation (see Step E4).Note: If some aliquots remain, store them at -80 °C.Transformation via electroporationElectroporate 50 μl of competent cells using a 1 mm Gene Pulser cuvette at 1.",
    "8 kV with one of the following reaction mixes:1 ng of pCasRed plasmid (see Step A1)Mutagenesis step:100 ng pCRISPR-SacB-gDNA (prepared in Step B4) 10 μg of the corresponding ds-dDNA (designed in Procedure C).Note: Your control should consist in a transformation using 100 ng of the ‘empty’ pCRISPR-SacB (see Step B2) without adding any ds-dDNA.Add 950 µl LB and incubate the cells at 30 °C with vigorous shaking (200 rpm) for 3 h.Plate the cells on LB-agar plates containing chloramphenicol 25 µg/ml (and kanamycin 50 µg/ml, when performing the mutagenesis step).Note: We recommend plating the entire transformation mix of the mutagenesis step (1 ml), but if you prefer you may choose different volumes (e.g., 500 µl or 250 µl).Incubate at 37 °C overnight.Count the colonies to determine the transformation efficiency of your electrocompetent cells.Note: The control of your mutagenesis step should count ca. 106 CFU/ml/μg. A drop in transformation efficiency of at least three orders of magnitudes is indicative for the quality of the gDNA (Zerbini et al., 2017). If you transformed with pCasRed plasmid start return to Step E3. Colony PCRPrepare a master mix for colony PCR using the GoTaq Green Master Mix. Note: In our hands, screening of ten colonies is sufficient (Zerbini et al., 2017). Thus, prepare the master mix for 12 reactions (10 samples + 1 control, see Note from Step E4a.ii).11 x 1 µl primer, forward (10 µM)11 x 1 µl primer, reverse (10 µM)11 x 12.5 µl GoTaq11 x 10.5 µl MilliQ waterPick individual colonies using a pipette tip and transfer directly to the PCR reaction mix. Make sure you will have enough cells from the colony for further analysis (see Step E7 and/or E8) by inoculating onto a transfer plate before dipping into the PCR reaction tube.",
    "Start PCR with the following settings:Initial denaturation 95 °C for 5 min30 cycles of:Denaturation 95 °C for 30 secAnnealing 58-63 °C for 30 secElongation 72 °C for 30 secFinal elongation 72 °C for 3 minNote: Annealing temperature depends on the primer sequence. We designed them to use a range between 58-63 °C.Verify the mutants by loading 4-8 µl of each PCR on a 2% agarose gel and run electrophoresis. Purify positive PCR amplicons (Δ30 between control and sample) using the Wizard® SV Gel and PCR Clean-Up System. Confirm the mutation by DNA sequencing using one of the primers you used for colony PCR above.Curing of pCRISPR-SacB-gDNA plasmidNote: If you are going to perform more than one knockout round, this step is mandatory. However, at the end of your genome editing experiment(s), removal of the pCRISPR-SacB-gDNA plasmid is optional. To remove the pCRISPR-SacB-gDNA plasmid, pick a mutated colony (from Step E5b) and inoculate liquid LB medium containing 5% sucrose (see Recipes) and chloramphenicol (25 µg/ml).Incubate at 37 °C with vigorous shaking (200 rpm) overnight.Prepare a glycerol stock of your resultant strain for storage at -80 °C.Note: If you wish to continue with a subsequent mutation round, use the overnight culture for preparation of competent cells and return to Step E3.Control loss of the pCRISPR-SacB-gDNA plasmid by adding 10-20 µl drops on two LB-agar plates, one containing chloramphenicol (25 µg/ml) the other one containing chloramphenicol and kanamycin (25 µg/ml and 50 µg/ml, respectively). No growth should be visible on the plate with the Cm and Km combination, indicating that all bacteria had lost the pCRISPR-SacB-gDNA plasmid.Curing of pCasRed plasmidNote: This step is optional. It is required if the presence of the pCasRed plasmid after the conclusion of your knockout experiment(s) may affect downstream experiments negatively.",
    "However, after removal of the pCasRed plasmid you may have to add a selection marker (i.e., antibiotic resistance) of your choice.  To remove the pCasRed plasmid, pick a mutated colony (from Step E5b) or use a glycerol stock, inoculate in LB medium without any antibiotic, and incubate at 37 °C with vigorous shaking (200 rpm) overnight.Confirm the loss of the pCasRed plasmid by inoculating LB-agar plate containing chloramphenicol (25 µg/ml). No growth should be visible when using chloramphenicol, indicating that all bacteria have lost the pCasRed plasmid."
  ],
  "subjectAreas": [
    "Microbiology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}