{
  "id": 2820,
  "origin_website": "Cell",
  "title": "Chemical pulldown combined with mass spectrometry to identify the molecular targets of antimalarials in cell-free lysates",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nAttachment of DDD02355221 to Sepharose resin\nTiming: 3 days\nThis section details the attachment of the probe DDD02355221 to Cytiva NHS-activated Fast Flow 4 Sepharose resin at two different loading levels.\nCritical: Ligand loading levels of drug beads can impact a pulldown experiment.2[href=https://www.wicell.org#bib2] Our experience to date indicates that there is no way to predict optimal bead loading level for specific probes/target combinations. Thus, our standard approach is to prepare drug beads with two different loading levels, ideally with a >5-fold difference in loading level between the two drug beads. HPLC analysis of the reaction supernatants is used to quantify the amount of probe attached to the drug beads.\nTransfer the resin slurry to microcentrifuge tubes.\nAdd approximately 400 μL of Cytiva NHS activated Sepharose 4 fast flow resin slurry to each of two screw cap microcentrifuge tubes. Label one vial ‘high’ loading level and one ‘low’ loading level.\nNote: A wide-bore pipette can be used when handling the Sepharose resin for ease of dispensing.\nCap the tube and centrifuge (15,000 g, 30 s, room temperature). Allow the resin to stand for approximately 1 min to settle flat then estimate the volume of settled resin using the volume indicators on the side of the microcentrifuge tube (Figure 2[href=https://www.wicell.org#fig2]).\nNote: room temperature is approximately 16°C–20°C.\nNote: immediately after centrifugation the surface of the resin will be sloped, leaving to stand at room temperature for approximately one minute allows the surface to settle flat (as in Figure 2[href=https://www.wicell.org#fig2]B) after which supernatant can be removed.\nNote: high-speed centrifugation can damage some resin types. Low-speed centrifugation at 3–4,000 g will be compatible with most commercial resins.\nAdd or remove resin as necessary and repeat step 1b so that the volume of settled resin after centrifugation is 200 μL.",
    "Critical: The NHS-activated Fast Flow 4 Sepharose slurry can be difficult to pipette accurately, the quantity of resin used should be determined by the volume indicators on the tube. It is important that the amount of settled resin is up to the 200 μL mark as the amount of NHS groups provided by the manufacturer is quoted per mL of settled resin, not per mL of slurry, and this is used to scale the attachment reaction. Over time (months) the 2-propanol the resin is stored in can slowly evaporate, leading to a thick, unworkable slurry. It may be necessary to periodically add 2–5 mL of molecular biology grade 2-propanol to the slurry to maintain it at a workable viscosity when using the same bottle of resin over an extended period.\nWash the resin with DMSO to remove the 2-propanol storage solvent.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2326-Fig2.jpg\nFigure 2. Resin suspended before and after centrifugation\n(A) NHS-activated Sepharose resin suspended after shaking.\n(B) pelleted NHS-activated Sepharose resin after centrifugation. Refer to step 1b.\nRemove the supernatant with a 200 μL pipette, being careful not to disturb the settled resin.\nAdd 1 mL of molecular biology grade DMSO to the microcentrifuge tube, cap the tube and gently shake to mix.\nCentrifuge the tube (15,000 g, 30 s, room temperature) to pellet the resin and carefully remove the supernatant with a 1,000 μL pipette.\nRepeat steps 2b and 2c a further two times.\nCritical: Carefully remove the supernatant to avoid loss of resin, err on the side of caution, it is better to leave excess supernatant than to lose resin during these washing steps. This cautious approach applies to all future washing steps.\nAttachment of DDD02355221 to the Sepharose resin to prepare high- and low-loading drug beads.",
    "After the final washing step and removal of the supernatant, add 200 μL of either the DDD02355221 high loading reaction stock solution, or DDD02355221 low loading reaction stock solution to the appropriately labeled tubes.\nCap the tubes and centrifuge (15,000 g, 30 s, room temperature), then transfer 10 μL of supernatant from each tube to a separate Agilent screw top vial with fixed insert as a t = 0 reading for analysis by HPLC (steps 10 and 11).\nRe-cap, then mix both tubes well by inverting several times, then use cotton wool to secure them inside a 50 mL Falcon tube.\nPlace the Falcon tube on a MACSmix™ tube rotator and rotate at maximum speed setting (20 rpm) for 24 h at room temperature to ensure continued mixing of the resin (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2326-Fig3.jpg\nFigure 3. Microcentrifuge vials with resin secured in FalconTM Tube and rotary mixer setup\n(A) microcentrifuge tubes secured in 50 mL Falcon tube.\n(B) Setup of Falcon tube on the MACSmix™ tube rotator.\nCritical: A suitable low volume HPLC vial must be used to allow sampling from 10 μL of supernatant. We use Agilent screw top vials with fixed inserts.\nRemoval of excess DDD023355221.\nFollowing agitation of “high” and “low” drug beads over 24 h, remove tubes from the tube rotator and centrifuge (15,000 g, 30 s, room temperature).\nTransfer 10 μL of resulting supernatants from each tube to Agilent screw top vials with fixed insert labeled as t = 24 h “high” and t = 24 h “low”. These samples will be submitted for analysis by HPLC (steps 10 and 11).\nCarefully remove the remaining supernatant using a 200 μL pipette.\nAdd 1 mL of DMSO to each tube, cap the tubes and gently shake to mix.",
    "Centrifuge the tubes (15,000 g, 30 s, room temperature) to pellet the drug beads and carefully remove the supernatant with a 1,000 μL pipette.\nRepeat steps 4d and 4e a further two times.\nNote: If the probe being attached is highly colored, the drug beads may be stained that color after all washing steps are complete.\nBlock the drug beads with ethanolamine to quench unreacted NHS-ester groups.\nAdd 200 μL of 200 mM ethanolamine stock solution to each tube, cap, invert and shake the tubes gently to mix the drug beads.\nSecure the microcentrifuge tubes using cotton wool inside a 50 mL Falcon tube as previously described (see step 3c). Place on a MACSmix™ tube rotator and rotate at maximum speed setting (20 rpm) at room temperature for 24 h to ensure continued mixing of the drug beads.\nAfter 24 h pellet the drug beads by centrifugation (15,000 g, 30 s, room temperature) and carefully remove the supernatant from each tube with a 200 μL pipette.\nAdd 1 mL of DMSO to both tubes, cap and gently shake to mix the drug beads.\nCentrifuge the tubes (15,000 g, 30 s, room temperature) to pellet the drug beads and carefully remove the supernatant with a 1,000 μL pipette.\nRepeat steps 5d and 5e a further two times.\nTransfer drug beads to storage solution.\nAdd 1 mL of 2-propanol to both tubes, invert and shake gently to mix the drug beads.\nCentrifuge (15,000 g, 30 s, room temperature) and remove the supernatant from each tube with a 1,000 μL pipette.\nRepeat steps 6a and 6b a further two times.\nEstimate the volume of settled drug beads using the volume indicators on the side of the microcentrifuge tubes and add 2-propanol to make a 1:1 slurry.",
    "Note: Assuming minimal loss of resin, approximately 200 μL of 2-propanol should be added to each tube in step 6d.\nCritical: It is important that as close as possible to a 1:1 drug bead:2-propanol slurry is prepared, as this is used to standardize the amount of resin used in subsequent pulldown experiments.\nCritical: Do not progress the drug beads into a pulldown experiment until analysis of probe attachment (steps 7–11) has been completed.\nPause point: At this stage the drug beads can be stored at 4°C until needed.\nNote: There is no straightforward method to assess the condition of the ligand on the drug bead after attachment. Therefore, it is preferable to perform pulldown experiments as close to the time of synthesis as practically possible. Although we have successfully repeated pulldown experiments on a batch of resin that was several months old, we cannot guarantee that this is broadly applicable.\nEstablishing efficiency of probe attachment to the resin\nTiming: 1 day\nNote: This is section of the protocol requires 1–2 h for sample preparation, 5–10 h for HPLC analysis then approximately 1 h for data processing.\nThis section details the HPLC analysis of the reaction supernatant collected at t = 0 and t = 24 h for both high- and low-loading drug beads using a Thermo Dionex Ultimate 3000 HPLC with diode array detector coupled to an Advion Expression CMS ESI Mass spectrometer connected to an X-Select Column CP C18, 2.5 μM 2.1 × 30 mm. This method assumes that any probe compound removed from the reaction solution has attached to the resin. Therefore, measuring the amount of probe remaining after 24 h allows the loading level to be estimated.",
    "Prepare stock solutions for an eight-point standard curve by serial dilution from a 50 mM DMSO stock of DDD02355221; volumes used at each dilution step are outlined in the following table:\ntable:files/protocols_protocol_2326_14.csv\nPrepare standard curve and quality control samples for HPLC. Troubleshooting 1[href=https://www.wicell.org#sec6.1].\nPipette 10 μL of each standard curve stock solution (excluding 50 mM) into a low volume HPLC vial.\nDilute with 190 μL of 1:1 MeCN/water and mix.\nIndependently prepare 10 mM, 1 mM and 0.1 mM stock solutions of DDD02355221, to serve as quality control samples to validate the accuracy of the standard curve.\nPipette 10 μL of each validation stock solution into a low volume HPLC vial.\nDilute with 190 μL of 1:1 MeCN/water and mix.\nNote: The quality control samples prepared in step 8c should be made from a fresh 10 mM probe stock solution. However, if there is insufficient probe compound to prepare these quality control samples, they can be prepared by dilution of the 50 mM probe stock solution used in step 7.\nDilute the t = 0 h and t = 24 h aliquots for the high- and low-loading drug beads collected in steps 3b and 4b respectively with 190 μL of 1:1 MeCN/water, mix and filter through a 13 mm 0.2 μm syringe filter.\nAnalyze the standard curve, quality control and experimental samples in triplicate using HPLC.\nWater with 0.1% (v/v) formic acid and acetonitrile were used as the A and B HPLC solvents respectively.",
    "Set up a method with a flow rate of 0.800 mL min-1 and injection volume of 3 μL. Perform a 30 s pre-equilibration at 95:5 (A:B), then a linear gradient of 95:5 → 5:95 (A:B) from 0.0 to 2.2 min, with a hold at 5:95 (A:B) from 2.2 to 3.0 min, then 95:5 (A:B) from 3.0 to 4.0 min.\nAnalyze samples from steps 8b, 8e and 9 in triplicate using the method from 10b.\nCritical: use HPLC and MS conditions appropriate for the probe that is being attached to the drug bead.\nNote: we use a Thermo Dionex Ultimate 3000 HPLC connected to a C18 reverse phase column. However, any HPLC setup suitable for chemical reaction monitoring will suffice.\nConstruct a DDD02355221 standard curve using the UV chromatogram peak areas. From this calculate the concentration of DDD02355221 in the samples at t = 0 h and t = 24 h.\nNote: These calculations are readily performed using a spreadsheet (Data S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2326-Mmc1.xlsx]). A copy of the Microsoft Excel file used in our laboratory is provided as supporting information. Troubleshooting 2[href=https://www.wicell.org#sec6.3].\nInput the peak areas for peaks corresponding to the probe in the UV chromatograms from all samples into the corresponding cells in the provided excel spreadsheet (Data S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2326-Mmc1.xlsx]).\nFill in the aX + bY values from the standard curve equation into the corresponding cells.\nThe rest of the excel spreadsheet will automatically populate, providing the concentration of samples, the amount of DDD02355221 remaining in solution, the amount of DDD02355221 attached to the resin and the drug bead percentage loading level (the percentage of NHS esters that have reacted).",
    "Critical: The concentration of the 10 mM, 1 mM and 0.1 mM quality control samples (prepared in step 8e) should be determined from the standard curve. A discrepancy of >25% between the calculated and expected concentration of two of the three quality controls suggests an error. The discrepancy could result from an error in the dilutions to make the standard curve, or in the preparation of the quality control samples. If this is the case, the data provided in the following steps may not be accurate.\nCritical: This HPLC analysis is a vital drug bead quality control procedure, if there is no decrease in the concentration of probe between the t = 0 h and t = 24 h samples, then the probe has not attached to the resin and the drug beads should not be used in a pulldown experiment (see troubleshooting 2[href=https://www.wicell.org#sec6.3]). Ideally drug beads used for pulldown experiments should have >5% loading.\nNote: Once the t = 0 h and t = 24 h peak areas have been entered into the spreadsheet a qualitative assessment of resin loading is calculated. This is based upon the ratio of the peak areas at t = 24 h and t = 0 h. In our experience this provides an estimation of the probe loading level within 1–5 percent of the value calculated using the standard curve.\nPreparation of blank resin\nTiming: 2 days\nNote: The preparation of blank beads requires approximately 45 min of preparation time on day 1. The bead-forming reaction takes 24 h to reach completion, followed by approximately 45 min of further laboratory time on day 2. This part of the protocol can be performed in parallel with steps 5 and 6 above.",
    "This section details preparation of blank resin that is used in the pulldown protocol described below. In a blank resin all the NHS esters are reacted with ethanolamine.\nTransfer resin slurry to a microcentrifuge tube, wash and resuspend in DMSO.\nAdd 400 μL of Cytiva NHS-activated Sepharose 4 Fast Flow resin slurry to a 1.5 mL screw cap microcentrifuge tube.\nCap the tube, centrifuge (15,000 g, 30 s, room temperature) then allow to stand for approximately 1 min to settle.\nCarefully remove the supernatant with a 200 μL pipette, being careful not to disturb the settled resin.\nAdd 1 mL of DMSO to the tube, cap, invert and gently shake to mix.\nCentrifuge (15,000 g, 30 s, room temperature) to pellet the resin, then remove the supernatant carefully with a 1,000 μL pipette.\nRepeat steps 12d and 12e two further times.\nResin blocking reaction.\nAdd 200 μL of 200 mM ethanolamine stock solution to the settled resin, cap the microcentrifuge tube, invert and shake gently to mix.\nSecure the microcentrifuge tube using cotton wool inside a 50 mL Falcon tube and place on a MACSmix™ tube rotator at maximum rotation (20 rpm) for 24 h at room temperature to ensure continued mixing of the resin.\nPellet the resin by centrifugation (15,000 g, 30 s, room temperature) and the carefully remove the supernatant with a 200 μL pipette.\nAdd 1 mL of DMSO to the pelleted resin, cap the tube and gently shake to mix.\nCentrifuge (15,000 g, 30 s, room temperature) to pellet the resin and carefully remove the supernatant with a 1,000 μL pipette.\nRepeat steps 13d and 13e a further two times.\nTransfer resin to storage solution.\nAdd 1 mL of 2-propanol to the blank resin, cap the tube, invert and shake gently to mix.",
    "Centrifuge (15,000 g, 30 s, room temperature) and remove the supernatant with a 1,000 μL pipette.\nRepeat steps 14a and 15b a further two times.\nEstimate the volume of settled resin using the volume indicators on the side of the microcentrifuge tube and add 2-propanol to make a 1:1 slurry.\nNote: Assuming minimal loss of resin, approximately 200 μL of 2-propanol should be added to the resin in step 14d.\nPause point: At this stage the blank resin can be stored at 4°C until needed. Blank resin can be prepared up to 4 weeks in advance of performing a pulldown experiment.\nCulture of asexual blood stage P. falciparum\nTiming: 3–5 days\nEach pulldown experiment (consisting of two separate pulldowns, one with low- and one with high-loading drug beads) requires approximately 5 mg total protein; a 500 mL P. falciparum culture should provide sufficient protein for the experiment. Scale-up as necessary for more complex studies.\nAround 3 days before starting the pulldown experiment, decrease the hematocrit to 2% and transfer a total volume of approximately 560 mL of culture to a HYPERFlaskTM.\nUse a 150 mL culture at 5% hematocrit with parasitemia around 4–5%. Increase the volume to 375 mL by addition of CMM to reduce the hematocrit to 2%. Then add 150 mL of CMM/2% erythrocytes to obtain a volume of 525 mL and carefully pour into the HYPERFlaskTM:\nAngle the HYPERFlaskTM away from you and pour the culture in a steady stream being careful to avoid creating bubbles. Top up with more CMM/2% erythrocytes ensuring the flask is completely full and no free space remains in the HYPERFlaskTM (total volume approximately 560 mL).\nWith the HYPERFlaskTM now upright, tap the sides firmly by hand to release any air bubbles before securing the lid.",
    "Invert the HYPERFlaskTM several times to mix, then incubate (37°C, 1% O2 and 3% CO2 in a balance of N2).\nRefresh media 1 or 2 times per day (see CRITICAL note below) and check parasitemia daily by preparing a thin smear (see before you begin[href=https://www.wicell.org#before-you-begin], step 1a).\nAround 1 h before changing the media, stand the HYPERFlaskTM upright to allow the blood to settle.\nWith the HYPERFlaskTM at an angle, aspirate off approximately one third of the culture volume without disturbing the erythrocytes.\nRefill the HYPERFlaskTM with CMM (supplemented with 0.4% erythrocytes every second day), release air bubbles and mix culture well as outlined in step 15.\nProceed with the preparation of the lysate when parasitemia reaches 8–12% (steps 18–27).\nAlternatives: If preferred, the HYPERFlaskTM can be replaced with multiple 175 cm2 or 225 cm2 cell culture flasks. Keep the hematocrit at 2–2.5% and change media once to twice a day to allow for a high parasitemia and to keep the culture healthy.\nCritical: If cultures reach a high parasitemia without sufficient media changes, the parasite viability quickly decreases. Therefore, refresh the media at the beginning and end of each day as parasitemia rises above 5%.\nPreparation of P. falciparum lysate\nTiming: 3 h\nPreparation of the P. falciparum lysate for pulldown analysis requires erythrocyte lysis and removal of erythrocyte material followed by lysis of the parasites. Before you begin, pre-chill the pellet wash buffer, saponin solution, lysis buffer and Octyl-β-D-glucopyranoside solution on ice. Also, rinse the cell disruption vessel chamber with lysis buffer and pre-chill on ice prior to preparing the lysate.\nStand up the HYPERFlaskTM to allow erythrocytes to settle for 1 h. Aspirate off about 20% of the media from the top and transfer culture to centrifuge tubes.",
    "Pellet cells by centrifugation (1,800 g, deceleration setting 2, room temperature, 15 min).\nSet centrifuge to chill to 4°C.\nResuspend pelleted cells in 5 pellet volumes of ice-cold saponin solution and incubate on ice for 10 min, with vigorous mixing every 2–3 min to lyse the erythrocytes.\nCentrifuge the resuspended cells (2,800 g, deceleration setting 5, 4°C, 8 min).\nCarefully aspirate off the supernatant and wash the free parasites 3 times with pellet wash buffer.\nNote: After saponin treatment, the pellet will be almost black and the supernatant a very dark reddish-brown color. It can be difficult to distinguish between them, so take extra care when aspirating.\nAspirate supernatant and resuspend pellet in 25 mL pellet wash buffer.\nCentrifuge the resuspended pellet (2,800 g, deceleration setting 5, 4°C, 8 min).\nRepeat twice more. Supernatant should be a pale straw-colored solution after the final wash. If the supernatant is still pink, perform an additional wash step. Troubleshooting 3[href=https://www.wicell.org#sec6.5].\nFollowing the final wash, resuspend the pellet in 0.5 pellet volumes of lysis buffer, mix well ensuring no clumps remain and transfer directly to the chamber of the cell disruption vessel (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2326-Fig4.jpg\nFigure 4. Cell disruption vessel\nParasites are ruptured by pressure in the cell disruption vessel at 1,500 psi. (we use a 45 mL vessel from Parr).\nAdd 0.5 pellet volumes of octyl-β-D-glucopyranoside solution and close the chamber tightly.\nConnect the cell disruption vessel to a nitrogen cylinder and adjust pressure to 1,500 psi. Incubate on ice for 60 min.\nVery carefully open the pressure valve, releasing the lysate dropwise into a 50 mL falcon tube.\nCritical: Do not release the pressure too quickly, as the lysate could spray out.\nPulldown experiment\nTiming: 4 h",
    "The parasite lysate is first incubated with blank beads prior to incubation with an excess of competitor (parent compound) or DMSO. Drug beads are then added to the pre-treated lysates. Following incubation, beads are then washed, loaded on a Bis-Tris polyacrylamide gel and bead-bound protein electrophoresed a short way into the gel. Protein loaded onto the gel is visualized using a protein stain, the entire stained protein band is then excised from the gel prior to further processing.\nCentrifuge the lysate (20,000 g, 4°C, 15 min).\nWhile lysate is being centrifuged, wash the blank, “high” and “low” loaded drug beads.\nVortex the bead slurry, then transfer 20 μL/sample to a LoBind® Eppendorf tube.\nAdd 1 mL ddH2O to each resin sample.\nCentrifuge the resin samples (10,000 g, 30 s, room temperature).\nCarefully remove the supernatants with a pipette and discard.\nRepeat steps 29b–29d.\nrepeat steps 29b–29d twice more substituting the ddH2O with lysis buffer (containing 0.8 mg/mL Octyl-β-D-glucopyranoside).\nTransfer lysate supernatant to a fresh LoBind® tube and keep on ice.\nMeasure protein content of lysate using Bio-Rad Quick Start™ Bradford kit.\nPrepare a BSA standard curve by diluting the provided 2 mg/mL BSA solution to 0.5 mg/mL in ddH2O, then adding the following volumes to each of six 70 μL 10 mm path length UV-visible spectrophotometer cuvettes: 0, 1.25, 2.5, 5, 10, 20 μL.\nAdd 0.5 μL and 1 μL of lysate respectively to two cuvettes.\nAdd 1 mL Bradford reagent to each cuvette and incubate at room temperature for 5 min.\nMeasure the absorbance at 595 nm using a spectrophotometer.\nUse the standard curve based on the following table to estimate lysate protein concentration.\ntable:files/protocols_protocol_2326_15.csv",
    "Alternatives: Other protein quantitation methods can be used (bicinchoninic acid or BCA, and UV) taking into account contaminants in the lysis buffer such as detergents.\nDilute lysate to 2 mg/mL in lysis buffer. You will need 2 mg of protein per drug bead to complete a pulldown (1 mg each for +/- competitor incubations).\nIncubate lysate with pre-washed blank beads (from step 29), rotate on a MACSMix™ rotator (maximum setting; 20 rpm) in a 4°C cold room for 30 min.\nCentrifuge (10,000 g for 30 s, room temperature), remove the supernatant and split between two fresh LoBind® tubes (500 μL supernatant each). Add DMSO (5 μL) to one tube, and 10 mM DDD01510706 DMSO stock (5 μL; 0.1 mM final concentration) to the second tube.\nNote: A high concentration, or vast excess, of competing ligand is desirable to maximize the shift in enrichment between control and drug-treated samples. In this case 0.1 mM was chosen to limit the final concentration of DMSO to 1%.\nCritical: if the aqueous solubility of the competitor compound is < 0.1 mM reduce the amount of 10 mM stock solution added to the blank bead-treated lysate in step 34.\nIncubate for 30 min at 4°C with rotation (as for step 33).\nTransfer the blank bead-treated lysate samples to tubes containing the pre-washed drug beads (from step 29) and incubate at 4°C with rotation (as for step 33) for 1 h.\nCentrifuge (10,000 g, 30 s, room temperature), then discard the supernatant and wash 2× with 0.5 mL ice-cold wash buffer, then 2× with 0.5 mL ice-cold TBS.\nAfter final wash, add 25 μL NuPAGE buffer and heat at 95°C in a heat block for 10 min.",
    "Remove the samples from the heat block and incubate at room temperature for 5 min before loading onto a 4–12% NuPAGE Bis-Tris gel leaving 2 empty lanes between each sample to prevent cross over.\nElectrophorese the gel at 150 V for 10 min in NuPAGE 1×MOPS SDS Running Buffer.\nRemove the gel from its cassette and then submerge it in Coomassie Quick Reagent with gentle agitation using a benchtop orbital shaker or equivalent for 60 min. Now aspirate the Coomassie reagent and gently rinse the gel with ddH2O.\nUse a scalpel blade to cut out each lane and transfer the gel slices to labeled LoBind® tubes.\nPause point: Samples can now be stored at −20°C for a maximum of 3 weeks prior to further processing.\nSample processing, digestion and TMT labeling\nTiming: 3 days\nThis section describes the process of reducing, alkylating and digesting proteins in the excised gel slice. In addition, the process of labeling peptides with TMT 10-plex tags and then desalting are detailed.\nCritical: Trifluoroacetic acid (TFA) and formic acid (FA) are harmful when inhaled. They need to be used in a fume hood to minimize the risk of inhalation and disposed following the appropriate health and safety regulations. Wear appropriate PPE when handling TFA or FA.\nTransfer the gel band into a 1.5 mL tube using clean tweezers and cut the gel into small pieces using a scalpel.\nWash the gel pieces with 200 μL water (milliQ) at room temperature with agitation (600 rpm) for 15 min, centrifuge (3,000 g, 1 min) and remove washing solution.\nNote: sample agitation is performed using a Vibrax VXR basic shaker.",
    "Wash the gel pieces with 200 μL acetonitrile at room temperature with agitation (600 rpm) for 15 min to dehydrate the gel pieces, centrifuge (3,000 g, 1 min) and remove washing solution.\nWash the gel pieces with 200 μL 100 mM tetraethylammonium bicarbonate pH 8.5 (TEAB) at room temperature with agitation (600 rpm) for 15 min, centrifuge (3,000 g, 1 min) and remove washing solution.\nWash the gel pieces with 200 μL 50% acetonitrile in 100 mM TEAB at room temperature with agitation (600 rpm) for 15 min, centrifuge (3,000 g, 1 min) and remove washing solution.\nWash the gel pieces with 100 μL acetonitrile at room temperature with agitation (600 rpm) for 10 min, centrifuge (3,000 g, 1 min) and remove washing solution.\nVacuum dry the samples in an evaporator for 10 min at 30°C using a program suitable for water-based samples (program “Aqueous” in the recommended evaporator).\nAdd 50 μL (or enough volume to cover the gel, whichever is greater) 10 mM dithiothreitol in 100 mM TEAB and incubate for 60 min at 56°C, centrifuge (3,000 g, 1 min) then remove all the liquid. Let the samples equilibrate to room temperature (22°C) for 5 min.\nAdd 50 μL (or enough volume to cover the gel, whichever is greater) 50 mM iodoacetamide in 100 mM TEAB and incubate for 30 min at room temperature, centrifuge (3,000 g, 1 min) then remove all the liquid.\nCritical: Use a fresh IAA solution and preserve it from light. Foil can be used to protect alkylated samples and IAA solution from light. IAA is a sensitizer and samples should be prepared and handled in a fume cupboard whilst wearing appropriate PPE.",
    "Wash the gel pieces with 200 μL 100 mM TEAB at room temperature with agitation (600 rpm) for 15 min, centrifuge (3,000 g, 1 min) and remove washing solution.\nWash the gel pieces with 200 μL 50% acetonitrile in 100 mM TEAB at room temperature with agitation (600 rpm) for 15 min, centrifuge (3,000 g, 1 min) and remove washing solution.\nWash the gel pieces with 100 μL acetonitrile at room temperature with agitation (600 rpm) for 10 min, centrifuge (3,000 g, 1 min) and remove washing solution.\nVacuum dry the samples in an evaporator for 10 min at 30°C using a program suitable for water-based samples (program “Aqueous” in the recommended evaporator). Gel pieces will have reduced to ¼ of their initial size.\nAdd 10 μL 12.5 mg/mL trypsin (or enough volume to cover the gel pieces, for approximately 25:1 protein:enzyme ratio) in 100 mM TEAB and incubate for 30 min at room temperature with agitation (600 rpm) to allow rehydration of the gel pieces.\nNote: If required, add extra 100 mM TEAB solution to cover the gel pieces.\nIncubate samples for >16 h at 30°C with agitation (600 rpm).\nAdd 1 volume of acetonitrile and incubate at 30°C for 15 min with agitation (600 rpm). Transfer the liquid from this tube (tube 1) to a new tube (tube 2); this contains the peptides.\nAdd 1 volume of 5% (v/v) aqueous formic acid (FA) to tube 1 with the gel and incubate at 30°C with agitation (600 rpm) for 15 min.\nAdd 1 volume of acetonitrile to tube 1 with the gel pieces and incubate at 30°C with agitation (600 rpm) for 45 min. Then transfer all liquid to tube 2 containing the peptides.",
    "Vacuum dry tube 1 in an evaporator at 30°C using a program suitable for water-based samples (program “Aqueous” in the recommended evaporator).\nAdd 10 μL acetonitrile to the gel pieces in tube 1 and incubate at 30°C for 15 min with agitation (600 rpm). Transfer all liquid to tube 2. Tube 1 can now be discarded.\nVacuum dry the peptide samples in an evaporator overnight (8–16 h) at 30°C using a program suitable for water-based samples (program “Aqueous” in the recommended evaporator).\nPause point: Peptides can be stored at −20°C for a maximum of 6 months.\nOptional: We recommend checking the digestion efficiency of some of the samples via mass spectrometry prior to TMT labeling.\nTo check the digestion efficiency:\nResuspend these samples in 100 μL 100 mM TEAB solution, then pick a 1 μL aliquot and dilute it 1:5 in 0.1% (v/v) aqueous FA in a sample tube.\nUse the following recommended equipment: Q Exactive Plus mass spectrometer coupled to a Dionex Ultimate 3000 RS (Thermo Scientific) equipped with a trap column (100 μm × 2 cm, PepMap nanoViper C18 column, 5 μm, 100 Å, Thermo Scientific) and a Pepswift Monolithic Nano resolving column.\nPlace each sample in the sample rack of the HPLC and load 5 μL sample at 10 μL min-1 onto the trap column pre-equilibrated with Buffer C.\nWash the trap column with Buffer C for 3 min at 10 μL min-1, then switch the trap column in line with the resolving column.\nElute peptides at a constant flow rate of 700 nL min−1 with a linear gradient from 2%–40% Buffer D over 7 min, and then from 40%–98% Buffer D over 1 min.\nWash the column with 98% Buffer D for 1 min and re-equilibrate in 2% Buffer D for 5 min.",
    "Use Q Exactive Plus in data-dependent positive ion mode using the following setup:\nMS1 scan cycles m/z range from 335–1,800, with a maximum ion injection time of 30 ms, a resolution of 70,000 and automatic gain control (AGC) value of 1 × 106.\nFollowed by 10 sequential dependent MS2 scans with an isolation window set to 1.4 m/z, resolution at 17,500, maximum ion injection time at 100 ms and AGC 2 × 105.\nOpen the .raw files using Thermo Xcalibur™ (Qual browser). This should open two windows: the upper window showing a chromatogram of signal relative abundance over retention time and the lower window showing the relative abundance over m/z ratio.\nBy selecting peaks on the upper chromatogram, the lower window will display the relative abundance and m/z of that peak.\nNote: Check that most peaks have a charge lower than 4 (z < 4). A high abundance of multiply charged species indicates that digestion has been not accomplished and the digestion step should be repeated with fresh digestion enzyme.\nTMT 10plex labels are provided in sachets stored at −20°C. Remove 1×TMT 10plex sachet from storage at −20°C and allow to equilibrate to room temperature.\nNote: Each sachet contains 10 tubes with 0.8 mg of the corresponding TMT 10plex label, enough to label 100 μg of protein.\nNote: Unused TMT reagents can be stored back at −20°C in sealed bags in the presence of desiccant.\nResuspend the dried peptide samples in 100 mM TEAB (100 μL) and incubate at room temperature with agitation (600 rpm).\nNote: Check that the pH of samples is ≥ 8.\nAdd 41 μL of acetonitrile to each TMT tube and incubate with agitation (600 rpm) for 5 min at room temperature.\nBriefly, centrifuge peptide samples and TMT tubes (3,000 g, 10 s).",
    "Add the content of each TMT tube to the corresponding peptide sample.\nIncubate with agitation for 1 h at room temperature.\nDilute the quenching reagent (50% hydroxylamine solution) 10-fold in 100 mM TEAB, making a final 5% hydroxylamine solution.\nNote: If the quenching reagent has precipitated, incubate at 37°C until the solution clears.\nTo quench the residual, unreacted TMTs, add 5% hydroxylamine solution (8 μL) to each reaction tube and incubate with agitation at room temperature for 15 min.\nCentrifuge (3,000 g, 10 s, room temperature) each reaction tube and then combine the 10× treated samples together in a single LoBind® 2 mL tube. Then combine the 10× control samples into another 2 mL LoBind® tube.\nVacuum dry the pooled samples in an evaporator overnight (8–16 h) at 30°C using a program suitable for water and organic solvent-based samples (program “HPLC” in the recommended evaporator).\nPause point: TMT-labeled peptides can be stored at −20°C for a maximum of 6 months.\nTo start the desalting step, resuspend the dried pooled samples in 0.1% (v/v) aqueous TFA (300 μL). Desalting is carried out with the Pierce Desalting Columns in a centrifuge at room temperature.\nPlace the desalting columns (one per sample) in 2 mL LoBind® tubes and centrifuge (5,000 g, 1 min) to remove the equilibration buffer. Discard the flow through.\nWash the desalting columns 2× with 100% ACN (300 μL, 5,000 g, 1 min, room temperature) and discard the flow-through.\nWash the columns a further 2× with 0.1% (v/v) aqueous TFA (300 μL, 5,000 g, 1 min, room temperature) and discard the flow-through.\nAdd the samples to separate desalting columns, centrifuge (3,000 g, 1 min, room temperature) and discard the flow-through. The peptides should now be bound to the columns.",
    "Wash the columns 3× with 0.1% (v/v) aqueous TFA, centrifuge (3,000 g, 1 min, room temperature) and discard the flow-through.\nWash the columns 2× with 5% methanol (diluted in 0.1% aqueous TFA, 3,000 g, 1 min, room temperature) to remove excess TMTs.\nElute peptides from the desalting columns into fresh 2 mL LoBind® tubes by centrifugation (3,000 g, 1 min) using 50% ACN diluted in 0.1% aqueous TFA (2 × 300 μL).\nVacuum dry the desalted eluates (program “Aqueous” in the recommended evaporator).\nPause point: Desalted TMT-labeled peptides can be stored at −20°C for 6 months.\nSample fractionation and LC-MS/MS analysis\nTiming: 2 days\nThis section describes the fractionation of samples by high-pH reverse-phase high performance liquid chromatography (RP-HPLC). Fractionation enables less complex peptide samples to be prepared for subsequent analysis by LC-MS/MS.\nSet-up of the Ultimate 3000 HPLC (Dionex) using the Chromeleon software. Buffers A and B should be less than 4-weeks old.\nTurn on UV lamp (wavelength 220 nm) at least 15 min prior to a run.\nPurge the system with Buffer A (10 mM ammonium formate, pH 9.5) and Buffer B (10 mM ammonium formate in 90% ACN, pH 9.5).\nSet the buffer composition to 98% A:2% B and the flow rate to 0.2 mL min−1 (these settings will be used in steps 85–87).\nPrime the syringe and wash the needle and fluidics using the commands in the Chromeleon software.\nRun the HPLC under these conditions for 15 min to fully equilibrate the system.\nRun a standard containing caffeine and MRFA (Met-Arg-Phe-Ala peptide) to check the HPLC system is working correctly.\nPlace collection tubes in the collection trays.",
    "Prepare the standard sample by diluting 2 μL of caffeine solution (1 mg/mL) and MRFA (1 mg/mL) in 100 μL buffer A in a HPLC sample tube. Place the sample tube in the samples tray.\nRun the sample using the following program:\nLoad 25 μL sample in the column.\nElute peptides from the column with a gradient of 2–20% Buffer B over 8 min.\nOver the following 37 min increase the % of Buffer B from 20%–47%.\nWash the column with 100% Buffer B for 15 min.\nFractions (volume) should be collected from 1 – 80 min of the run.\nDiscard the collected fractions from the standard run.\nCheck the chromatogram for two peaks in minutes 12 and 14 that correspond to caffeine and MRFA, respectively.\nPrepare and run the first sample.\nResuspend the dry sample in 200 μL buffer A, vortex vigorously and then spin down at 20,000 g at 4°C for 15 min. Transfer 190 μL of supernatant to the sample tube and adjust to pH > 9 using aqueous ammonia (check pH with a pH indicator strip). Place the transfer tube in the sample tray.\nLabel 80 collection tubes and add 20 μL 10% (v/v) aqueous FA to neutralize the pH of the fraction eluates. Place the collection tubes in the collection trays.\nRun the sample using the program detailed in 83c but loading 185 μL of sample.\nCombine the fractions from minutes 3–63 into 10 fractions by concatenating them. Discard fractions from minutes 1 and 2 as they usually contain TMT-related by products, salts and other contaminants and fractions from minute 64 onwards as they may contain detergent and further contaminants.\nRepeat the run with a standard and continue running the following samples intercalating with standard runs.",
    "Note: Concatenate samples so that each contains eluted fractions collected at different points in the run. For example, fraction 3 would contain fractions eluted at 3, 13, 23, 33, 43, 53 and 63 min.\nVacuum dry the concatenated fractions (program “Aqueous” in the recommended evaporator).\nPause point: Concatenated fractions can be stored at −20°C for 6 months.\nThe mass spectrometer must be calibrated prior to analysis of samples.\nResuspend the concatenated samples in 50 μL 1% aqueous FA and then load 5 μL aliquots (at 15 μL min−1) onto the trap column previously equilibrated with 90% Buffer C (0.1% FA) and 10% Buffer D (0.1% FA in 90% ACN). Once samples are loaded, wash the column for 5 min with 5% Buffer D at 15 μL min−1.\nConnect the trap column to the resolving column and elute peptides at 300 nL min−1 with a linear gradient (10% Buffer D at min 1, 18% at min 89, 27% at min 134 and up to 90% Buffer D at min 139). Wash the column with 90% Buffer D for 10 min and then re-equilibrate in 10% Buffer D for 25 min.\nUse Orbitrap Eclipse in data-dependent mode using the following setup:\nMS1 scan cycles m/z range from 380–1,500 at resolution of 120,000 and standard automatic gain control (AGC).\nFollowed by 15 sequential dependent MS2 scans with an isolation window set to 0.7 Da, maximum ion injection time at 50 ms and standard AGC.\nThen MS3 scans with a resolution of 50,000, an isolation window set to 0.7 Da, maximum injection time at 120 ms and 400% AGC target.\nReal-time search feature active using the P. falciparum 3D7 annotated proteins FASTA file (downloaded from PlasmoDB, latest version).\nProtein search, data analysis and hit selection\nTiming: 2 days",
    "This section describes the bioinformatic steps needed to find and quantify the proteins in the sample from the MS spectra using MaxQuant.8[href=https://www.wicell.org#bib8] This section also outlines the workflow to analyze the data, generate fold-change abundances for every protein, visualize these data, and select hits using the Perseus software.8[href=https://www.wicell.org#bib8]\nPlace the RAW data files from MS analysis in a folder and open MaxQuant software (version 2.0.1.0).\nDownload the P. falciparum 3D7 annotated proteins FASTA file from PlasmoDB.org[href=http://PlasmoDB.org] and the human proteome FASTA from Uniprot (accession 9606).\nNote: Other software can be used for this step (e.g., Thermo Proteome Discoverer).\nOptional: TMT labeling efficiency can be checked at this point using the parameters detailed below but by changing TMT reporters from variable to stable modification. This can be done in the “Configuration” tab in MaxQuant. The “Type” of experiment in the Group-specific parameters tab should also be set to MS1. TMT labeling efficiency can be performed on an aliquot of the sample prior to fractionation to ensure sufficient labeling before further analysis.\nUse default settings except for the following:\nIn the “Raw data” tab, RAW files are loaded and labeled according to their condition and replicate for example “experiment_1” using the “Set experiment” button. Fraction number can be selected for each of them using the “Set fraction” button and typing 1–10.\nIn Group-specific parameters:\nSet Reporter ion MS3 under “Type” and choose the 10plex TMT option.\nChange the correction factors in the table that will appear below according to the Reporter ion isotopic distributions table in the TMT10plex product data sheet.\nChoose Oxidation (M), Acetyl (Protein N-term), Dioxidation (W), Deamidation (NW) and Gln->Pyro-Glu as variable modifications and Carbamidomethyl (C) as fixed modification under “Modifications”.\nSelect Trypsin/P enzyme under “Digestion”.\nIn Global parameters:",
    "Add the FASTA files containing the protein sequences in the “Sequences” tab.\nSet FTMS MS/MS Match tolerance to 10 ppm and ITMS MS/MS Match tolerance to 0.5 Da in the “MS/MS analyzer” tab.\nActivate the “Match between runs” option in the “Identification” tab.\nSet the number of processors according to the capabilities of your system.\nNote: Analysis time is approximately 10 h using a 28-core computer.\nThe next steps are aimed at visualizing the results and selecting hits using the software Perseus.\nOpen the Perseus software (version 1.6.15.0).\nLoad the proteinGroups.txt file that can be found in the analysis folder\\combined\\txt folder using the “Generic matrix upload” button.\nNote: A screen with column names will appear on the left side.\nSelect the “Reporter intensity corrected” columns 1–10 and add them to the “Main” box by clicking the “>” button. Click “Ok”. Troubleshooting 4[href=https://www.wicell.org#sec6.7].\nThe following screen is split into three panels: data on the left, matrix in the middle and details on the right. Every time a change is made to the data, a new matrix will appear in the matrix tree of the middle panel.\nClick on the “Filter rows” tab and select the option “Filter rows based on categorical columns”.\nSelect “Only identified by site” and click on “OK”. This option will delete proteins identified only by modified peptides.\nRepeat this process selecting “Reverse” and then “Potential contaminant” to remove misidentified proteins and common contaminants from the protein list.\nOptional: If the data looks skewed after step 99 (the main cloud of unaffected proteins is not on the 0 line), normalization may be necessary before step 98 using the following step:",
    "In the “Normalization” tab select the option “Divide” and pick “columns” under the “Matrix access” tab and “Mean” under the “Divide by what” tab and click the “OK” button. Now the data values (TMT reporter intensities) will be normalized to the mean of each channel, removing variability due to differences in material.\nTo calculate the log2 fold-change DMSO vs drug-treated samples of every protein:\nClick on the “Basic” tab and select “Combine main columns”. A new menu will open.\nWrite in the “Operation” section “log2(x/y)”.\nSelect the “Reporter intensity” channels of the DMSO-treated sample and click on “>” to add them to the “x” box.\nThen select the “Reporter intensity” channels of the drug-treated samples and click on “>” to add them to the “y” box.\nClick “OK” and a new column will be created containing the log2 FC DMSO/Drug.\nUnder the “Visualization” tab, select “Scatter plot”, then select “Columns” in the “Matrix access” query.\nNote: A new tab labeled “Scatter plot” will appear beside the “Data” tab under the current matrix tab. Troubleshooting 5[href=https://www.wicell.org#sec6.9].\nOpen the “Scatter plot” tab, choose the “log2 fold-change” column in the “X” tab and the “Lin” option on the tab beside it.\nThen choose the “Intensity” column in the “Y” tab and select the “Log” option in the tab beside.\nThe resulting graph will show the log2 fold-change values of all proteins along the X axis, sorted by log-scaled total protein intensity in the Y axis. As shown in expected outcomes, a main cloud of non-enriched proteins will populate the zero line on the X-axis. These proteins were bound to the beads but were affected by the presence of competitor in the treated sample.\nNote: Some proteins may be on the negative side of the graph, but these should be treated as noise.",
    "Putative hits in the pulldown will typically have a log2 fold-change value greater than 2 in two independent experiments (i.e., low- and high-loading compound beads).\nNote: Depending on the noise level, this threshold can be increased, selecting only proteins that are clearly away from the main cloud of proteins.\nCritical: Proteins identified with less than 2 unique peptides can be removed from the analysis whereas proteins with 2 or 3 unique peptides should be regarded with caution. Typically, hits of a pulldown experiment are enriched and are identified with several peptides.\nOptional: Perseus has some statistical tools that can be used to find significantly enriched proteins as well, but we have not used them in our analysis. These analyses usually require at least two replicates.\nAlternatives: Other software can be used to visualize and identify significantly enriched proteins such as the Bioconductor R package DEqMS."
  ],
  "subjectAreas": [
    "Chemistry",
    "Molecular/Chemical Probes",
    "Proteomics",
    "Cell Culture",
    "Mass Spectrometry",
    "Cell Biology",
    "Microbiology",
    "Protein Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}