{
  "id": 1953,
  "origin_website": "Cell",
  "title": "Isolation and feeder-free primary culture of four cell types from a single human skin sample",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nDay 1 of procedure (culture day -1)\nTiming: 2–3 h\nIn the following steps, full thickness skin tissue will be decontaminated and trimmed, and enzyme digestion for separation of epidermis from dermis will be initiated prior to overnight (∼16 h) incubation.\nPreparations before starting:\nPrepare vacuum aspirator by adding bleach (or other disinfectant); volume should be sufficient to decontaminate liquid waste if vessel is filled (∼10% final concentration).\nDecontaminate tissue culture hood.\nPreheat glass bead sterilizer.\nPrepare or thaw Dispase: Prepare a solution at a concentration of 2.4 U/mL in HBS. Note that activity can vary from lot-to-lot but is usually >0.5 units/mg. Use a minimum of 1 mL Dispase/cm2 of tissue. Filter sterilize the solution; this can be made in large batches and stored in aliquots (35 mL each) frozen at -20°C. Thaw at 37°C and store on ice until used in procedure.\nDettol First Aid Antiseptic Liquid: A 5% solution in Milli-Q water should be prepared and filter sterilized before use. Note that Dettol is a brown liquid that will appear milky after dilution. This can be stored at room temperature (20°C–22°C) after filter sterilization.\nWarm HBS in 37°C water bath prior to use.\nCollect tissue and transport to laboratory:\nThe procedure described below is intended for ∼20 cm2 full thickness human skin. The volume of specific reagents can be scaled down or up, as needed, for different size pieces of skin.\nPieces of skin up to ∼35 cm2 can be processed as described here, although pieces measuring 10–20 cm2 in area should provide a good yield of cells for most purposes. For larger pieces, we recommend subdividing tissue and performing multiple isolations in parallel, as pieces of skin >35 cm2 are too large for the enzyme volumes described below.",
    "Although we have used this protocol to isolate cells from biopsies as small as 4 mm2 (with adjustments to reagent volumes), we recommend practicing with larger tissue pieces before attempting cell isolation from very small biopsies.\nThe procedure can be used on skin that has been dermatomed (split thickness skin) by modifying the Dispase and Collagenase digestion steps, as detailed below. Note that initial procedures for split-thickness skin can be accomplished in a single day versus two days for full thickness skin. For isolation of HDMECs, full thickness skin is recommended for best results.\nFreshly excised human skin should be used as soon as possible for optimal results. If immediate use is not possible, skin can be stored in a buffer solution (e.g., saline or HBS, preferably chilled to 4°C) for up to 1–2 h with minimal loss of cell viability. For longer storage (up to 24 h) skin should first be rinsed to remove as much blood as possible and stored in KGM at 4°C. If overnight storage is required (∼16 h), we recommend trimming excess subcutaneous tissue prior to storage to improve dermal and epidermal tissue preservation and enhance cell viability.\nDecontamination and trimming skin tissue:\nCut the skin to desired size, and remove any necrotic tissue, if necessary. Any tissue showing signs of degradation or loss of structural integrity should be removed. Rinse the skin sample 2× with 20 mL HBS in a 100 mm dish (or other suitable vessel) to remove any residual blood products (Figures 1[href=https://www.wicell.org#fig1]A and 1B).",
    "Remove as much subcutaneous fat as possible. To do this, place the skin sample in a dish with the fat side facing up (Figure 1[href=https://www.wicell.org#fig1]B). Add a small amount of HBS to the dish to prevent the tissue from drying out and help maintain skin viability while trimming (Figure 1[href=https://www.wicell.org#fig1]C). Grasp the fat with fine tip forceps, and cut fat away with curved scissors (Figure 1[href=https://www.wicell.org#fig1]C). Discard the fat. When subcutaneous fat is removed, the dermis will appear whitish in color (Figure 1[href=https://www.wicell.org#fig1]D). Note: this will not be necessary for split thickness (dermatomed) skin or neonatal foreskin. If curved scissors are not available, other types of scissors or a scalpel may be used, but use care to remove only subcutaneous tissue and not dermal tissue or yield of dermal cell populations, especially HDMEC, may be reduced.\nIf desired, collect biopsies for histology or other uses (e.g., RNA isolation).\nTo decontaminate the tissue, two brief (15–20 s) rinses in 5% Dettol liquid antiseptic (20 mL/rinse) will be performed. To facilitate the process and control the length of time in Dettol, set up 6 100 mm dishes in the hood: 2 containing 20 mL 5% Dettol, and 4 containing 20 mL HBS (Figure 2[href=https://www.wicell.org#fig2]A). Wash the skin quickly (∼15 s) by placing in a dish with Dettol and manipulating the tissue using sterile forceps so that all surfaces are exposed to Dettol. Remove from Dettol and rinse the skin twice for about 30 s each in HBS by moving to fresh dishes, manipulating the skin at each rinse to ensure all surfaces are exposed to HBS. Repeat the Dettol and two HBS rinses, and place skin in a clean, sterile 100 mm dish with 10 mL HBS. Aspirate to remove HBS and Dettol from used dishes, and discard dishes.",
    "Critical: Do not leave in Dettol solution longer than recommended or cell yield and viability may be reduced. Make sure to rinse thoroughly with HBS to remove all traces of Dettol before proceeding.\nMeasure and record area of skin sample.\nDispase digestion:\nPlace skin in a dish with ∼10 mL HBS and cut the skin sample into strips measuring ∼2 cm × 0.25 cm (Figure 2[href=https://www.wicell.org#fig2]B). To simplify these cuts, clamp a razor blade (Weck-prep blade) in the teeth of a hemostat, and place the blade edge on the skin, perpendicular to the surface. The tissue will curl less if it is placed dermis side down during cutting. Cut strips by running a sterile scalpel blade along the edge of the razor blade (Figure 2[href=https://www.wicell.org#fig2]B).\nTransfer the tissue strips to a 100 mm dish containing 35 mL Dispase, place into a zippered plastic bag (to prevent spillage), and incubate overnight (∼16 h) at 4°C. Although other types of sterile containers can be used for this step, it is important for all tissue pieces to be exposed to the enzyme. For example, if using a tube instead of a dish for this incubation, the tissue pieces may settle to a small area in the bottom of the tube, hindering access of the enzyme to the tissue. If a tube is used instead of a dish, laying it on its side may allow for more even distribution of the tissue pieces in the enzyme solution.",
    "Note: If skin is split thickness (e.g., dermatomed) or very thin (e.g., neonatal foreskin), perform Dispase digestion at 37°C for 30–120 min. Rather than floating the tissue strips in Dispase in the 100 mm dish, place two layers of sterile cotton gauze in the dish and saturate with Dispase. Lay the tissue strips on the gauze with dermis side down, and incubate at 37°C for 30 min. Split-thickness skin tends to curl on itself more than full-thickness skin; laying the thin tissue pieces on a saturated gauze pad will help prevent this curling and ensure access of the enzyme to the tissue. Check for separation of epidermis from dermis after 30 min, and if epidermis is still tightly adhered, continue incubation at 37°C, checking every 30 min up to 2 h. Once epidermis easily separates from dermis, immediately move to the next steps in the procedure.\nCritical: Do not incubate split thickness skin in Dispase at 37°C for longer than 120 min or cell yield and/or viability may be reduced.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1435-Fig1.jpg\nFigure 1. Trimming human skin in preparation for primary cell isolation\n(A) Abdominal skin with subcutaneous fat, collected from elective panniculectomy.\n(B) Appearance of skin after initial trimming from surgical discard tissue, showing subcutaneous fat layer.\n(C) Technique for removing subcutaneous fat using curved scissors.\n(D) Skin after removal of subcutaneous fat layer, showing whitish appearance of dermal tissue. Size after trimming is ∼20 cm2.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1435-Fig2.jpg\nFigure 2. Illustration of steps involved in establishing primary cell cultures from human skin\n(A) Dishes arranged in tissue culture hood for decontamination and rinsing of skin tissue, showing dishes containing 5% Dettol (whitish solution) and HBS rinses (pinkish solution).\n(B) Cutting skin into strips measuring ∼2 cm × 0.25 cm after trimming and decontaminating, and prior to Dispase digestion.",
    "(C) Separation of epidermis from dermis following overnight (∼16 h) Dispase digestion.\n(D) Strips of dermis (left) and epidermis (right) after Dispase digestion and separation.\n(E) Extrusion of HDMEC from dermal strips.\n(F) Mincing of dermal strips prior to collagenase digestion.\n(G) Suspension of minced dermis in collagenase.\n(H) T150 flask containing dermal fibroblasts and dermal “pieces” following collagenase digestion, rinsing, and inoculation.\n(I) Filtration of digested epidermal tissue through cell strainer following trypsin treatment.\nDay 2 of procedure (culture day 0)\nTiming: 4–6 h\nDuring procedures performed on day 2, primary cultures of HDMEC, fibroblasts, and keratinocytes (with melanocytes) will be isolated from digested tissue samples. This is considered culture day 0 for all four cell types.\nPreparations before starting:\nPrepare aspirator by adding bleach (or other disinfectant); volume should be sufficient to decontaminate liquid waste if vessel is filled (∼10% final concentration).\nDecontaminate tissue culture hood. Pre-heat glass bead sterilizer. Turn on centrifuge and pre-cool to 4°C.\nPrepare or thaw Trypsin/EDTA solution: Prepare a solution containing 0.025% Trypsin + 0.02% EDTA in HBS and filter sterilize. Store in aliquots at -20 C until use. Thaw (≥1 mL per cm2 of skin) at 37°C for the minimum time required and store on ice until needed in the procedure. Warm to 37°C immediately before use.\nNote: Extended incubation of trypsin at 37°C can lead to loss of enzyme activity. We recommend storing on ice after thawing and warming to 37°C for the minimum amount of time required, just prior to use.",
    "Prepare Collagenase: Prepare a solution containing 625 U/mL in 30 mL KGM + 5% BPE (30 mL is enough for one primary culture, in most cases). BPE is added to neutralize trypsin activity in the collagenase enzyme preparation (Boyce, 1999[href=https://www.wicell.org#bib3]). There can be lot-to-lot variability in collagenase activity, although it is usually >125 U/mg dry weight. We recommend storing aliquots of pre-weighed collagenase in snap-cap or screw-cap glass vials in a desiccator at 4°C for convenience. To determine the amount of collagenase (in mg) for each aliquot, use the following formula:\n    625  U  mL  ×  mg  enzyme activity  ( U )    × 30  mL  =  #  mg  collagenase  per  vial  \n To prepare a working collagenase solution, combine 28.5 mL KGM + 1.5 mL BPE in a 50 mL tube, and add small amounts to glass vial with collagenase to dissolve. Bring volume to 30 mL and filter sterilize using 0.22 μm 50 mL tube-top filter (or other suitable filter) and store on ice until ready to use. The estimated volume needed is 1.5 mL collagenase/cm2 skin.\nPrepare FGM (for fibroblasts), “regular” calcium (200 μM) KGM (for keratinocytes), and ECGM (for endothelial cells). Warm to 37°C in water bath before use, protecting from light.\nNote: KGM-LC (“low calcium,” 0.06 mM CaCl2) is used for feeding primary keratinocytes prior to passage (P0), but KGM with “regular” calcium (0.2 mM) is used during the initial isolation procedure (culture day 0) and the first overnight incubation after inoculation of flasks. After passaging (P1 and beyond), KGM with “regular” calcium (0.2 mM) will be used.",
    "Prepare collagen-coated flasks for keratinocytes: Coat T225 flasks (∼1 per ∼10 cm2 of skin) with collagen I using the Collagen I-Cell Culture Surface Coating Kit according to manufacturer’s instructions[href=https://www.sciencellonline.com/PS/8188.pdf] with minor modifications. Dilute the 100× Collagen I Solvent provided with the kit 1:100 with sterile Milli-Q water and store at 4°C. To coat one T225 flask (225 cm2), dilute collagen I solution (1 mg/mL) 1:10 in 1× Collagen I Solvent and add 11.25 mL per flask (5 μg/cm2). Incubate for a minimum of 1 h at 37°C. Aspirate the collagen I solution and rinse each flask 3 times with 10 mL HBS. To use immediately, add 45 mL KGM to flask and pre-equilibrate in incubator at 37°C for at least 30 min. If not used immediately, air dry the flask in the hood and store at 4°C.\nNote: For best results, equilibrate all flasks with media in a 37°C, 5% CO2 incubator for ≥30 min before inoculation of cells. We recommend this during the primary procedure and for all later passages.\nPrepare T150 flasks for fibroblast inoculation (1 per ∼10 cm2 of skin). Add 10 mL FGM to each flask and equilibrate in incubator ≥30 min before use.",
    "Prepare Attachment Factor-coated flask(s) for HDMECs according to manufacturer’s instructions. Note that Attachment Factor is a 0.1% gelatin solution; a sterile solution of 0.1% gelatin in water can be used instead of the pre-made product. Coat T75 flask(s) (1 per ∼20 cm2 of skin) with 3–4 mL Attachment Factor: rock vigorously to completely cover growth surface and incubate in sealed flask for 30 min at 37°C or at least 2 h at room temperature (20°C–22°C). Aspirate liquid (do not rinse) and store flask tightly capped in hood at room temperature (20°C–22°C) for up to 24 h. Before use, add 15 mL ECGM per flask and equilibrate in incubator for ≥30 min before inoculating cells.\nPrepare 100 mL KGM + 10% FBS (trypsin/EDTA “stop” solution) and store on ice until ready to use.\nSeparate epidermis from dermis:\nRemove tissue strips from Dispase and place in 100 mm dish containing 10 mL HBS. Prepare two additional 100 mm dishes with 20 mL HBS each; label for “epidermis” and “dermis”.\nSeparate dermis from epidermis. To do this, grasp the dermis with fine tipped forceps, grasp the epidermis with blunt forceps, and peel off epidermis (troubleshooting 2[href=https://www.wicell.org#sec5.3]; Figure 2[href=https://www.wicell.org#fig2]C). Place epidermal strips in a fresh dish (labeled “epidermis”) with 20 mL HBS (Figures 2[href=https://www.wicell.org#fig2]C and 2D).\nPlace dish with epidermal strips in a plastic zippered bag to avoid spillage, and store in refrigerator or cold room (4°C) until ready to process for keratinocyte isolation. The epidermal strips can be stored for several hours, while the dermal strips are processed for isolation of HDMEC and fibroblasts, but do not store overnight. Keratinocytes should be isolated the same day to preserve cell viability.\nIsolation of HDMEC from dermis:",
    "Mechanical force will be used to extrude HDMEC from vessels in the dermis. To do this, you will compress the tissue down the length of each dermal strip by squeezing with forceps, using pressure to force the endothelial cells out from vessels (imagine flattening a tube of toothpaste from the bottom up to get out the last bits of toothpaste). Grasp each dermal strip at one end with forceps, and use blunt forceps to squeeze the dermal strip near that end. Then, run the blunt forceps down the length of the strip, squeezing gently, to extrude the endothelial cells (Figure 2[href=https://www.wicell.org#fig2]E and Methods video S1[href=https://www.wicell.org#mmc1]). Repeat ten times for each strip, then transfer strip to fresh dish with 20 mL HBS (labeled “dermis”) for subsequent isolation of fibroblasts.\nNote: This step must be done carefully because too much force will result in contamination of the HDMEC with fibroblasts, but too little force will result in low yield of endothelial cells. If large amounts of fibrous material are present after the extrusion procedure, this may indicate too much force was used. If this is observed, use less pressure for remaining strips (troubleshooting 4[href=https://www.wicell.org#sec5.7]).\nAfter scraping and moving all dermal strips to a new dish with fresh HBS, transfer the extruded cell suspension to a sterile 50 mL conical centrifuge tube. Rinse the dish used for extruding HDMEC several times with small amounts of ECGM, and add to conical tube.\nCentrifuge for 7 min at 1000 rpm (∼250×g), 4°C, without brake.",
    "Note: Although spinning without the brake may add a small amount of time to each centrifugation step, we strongly recommend this for primary cells. Using the brake at the end of the spin can disrupt or dislodge the pellet, making it more difficult to remove the supernatant without disturbing the cells, and may cause mechanical damage to fragile primary cells.\nCarefully aspirate or pipet off the supernatant. The cell pellet may be difficult to see, and/or may be loose; use care not to aspirate the cell pellet. Resuspend cell pellet in 2 mL ECGM per T75 flask. Inoculate prepared T75 flask(s) (coated with Attachment Factor and equilibrated with medium at 37°C; Day 2, step 4h) with 2 mL of the cell suspension per flask and incubate overnight (∼16 h) at 37°C, 5% CO2.\nNote: For isolation of HDMEC from skin pieces smaller than 10 cm2, T25 flask(s) may be used instead of T75 flasks.\nIsolation of dermal fibroblasts:\nWarm collagenase (prepared in Day 2, step 4d) to 37°C immediately before use.\nCarefully remove HBS from dish containing dermal strips using a 25mL pipet and using forceps to keep dermal strips away from pipet. Mince dermis into small pieces (<0.5–1 mm3). To mince the tissue, use a razor blade held by a hemostat and a scalpel (Figure 2[href=https://www.wicell.org#fig2]F). Hold the blade firmly on top of the mass of dermal tissue, then slice along the edge of the razor blade with the scalpel (Figure 2[href=https://www.wicell.org#fig2]F). Repeat many times, re-slicing in multiple directions, until tissue is finely minced. Try for pieces that are small enough to fit through the opening of a 50 mL pipet.",
    "Add 10–20 mL of warm Collagenase to dish, and collect Collagenase solution and minced dermal pieces using a 50 mL (large bore) serological pipet (Figure 2[href=https://www.wicell.org#fig2]G). Transfer to 50 mL conical tube, recovering as much of the minced dermis from the dish as possible.\nAgitate the tissue suspension by pipetting up and down using a 50 mL serological pipet for 1–2 min.\nIncubate tube with minced tissue in Collagenase for 30–120 min, depending on thickness of tissue, in a 37°C water bath. Full thickness tissue may require 60–120 min, whereas thin or dermatomed tissue may only require 30 min incubation.\nCritical: Do not incubate minced dermal tissue in Collagenase for longer than 120 min.\nAgitate the tissue (as in step 7d, above) every 15–30 min until tissue is sufficiently digested, making sure to clean the outside of the tube with 70% alcohol when moving from the water bath to the hood to avoid introducing contaminants. The tissue fragments should start to decrease in size and increase in number, the solution should become cloudy, and wisps of collagen and digested tissue may be visible. You should be able to reduce the size of the pipet from 50 mL to 25 mL as the tissue digests (troubleshooting 3[href=https://www.wicell.org#sec5.5]).",
    "Note: To preserve cell viability, perform the minimal incubation in Collagenase required to release cells. Longer digestions may result in reduced colony forming efficiency and lower cellular growth rates. Clumps will still be visible after Collagenase digestion, particularly if full thickness skin is used. It is not necessary to digest full thickness skin in Collagenase until all clumps have dissolved. The tissue clumps will also be plated, allowing recovery of fibroblasts that migrate out of tissue pieces and onto plastic (as in an explant culture) in addition to fibroblasts released by collagenase digestion (Figure 2[href=https://www.wicell.org#fig2]H).\nCentrifuge at 1000 rpm (∼250×g) for 7 min at 4°C.\nCarefully remove supernatant with a 50 mL pipet. The pellet will be loose, so we recommended using a pipet instead of aspirating when removing liquid to avoid disrupting the pellet.\nResuspend pellet in 30 mL FGM, and repeat steps 7G and 7H.\nResuspend pellet in FGM, using 5 mL of medium for each T150 flask to be inoculated.\nAdd cells to prepared flasks (pre-equilibrated with 10 mL FGM), using care to pipet the dermal cell suspension down the growth surface of the flask. Do not add additional medium to flask. Using a lower than normal volume of medium for this step improves adhesion of cells and tissue pieces to the growth surface of the flask.\nNote: This procedure enables recovery of fibroblasts released from collagen by Collagenase treatment, as well as fibroblasts that migrate out of remaining tissue pieces during the first few days of incubation, resulting in greater yields than either explant cultures or Collagenase digestion alone. Additionally, this allows for populations of fibroblasts more representative of the tissue as a whole, whereas explant cultures favor more migratory fibroblasts.\nLabel the flasks with #1 (Figure 2[href=https://www.wicell.org#fig2]H) and place in incubator overnight (∼16 h).",
    "Pause point: If you need a short break during the procedure (1–2 h), this is an appropriate point to pause the protocol. However, do not wait overnight to isolate keratinocytes from epidermis.\nIsolation of epidermal keratinocytes: In the steps outlined below, the strips will be incubated in trypsin with agitation, followed by two rinses/agitations in HBS to maximize recovery of cells. Between each of these incubation/agitation steps, the strips will be filtered through a sterile cell strainer and flow-through collected to recover released cells.\nFor convenience, set up a series of tubes containing the required volumes of solutions needed for the next several steps of the protocol; see Figure 2[href=https://www.wicell.org#fig2]I for an example.\nRemove dish with epidermal strips from refrigerator (step 5c, above). Transfer epidermal strips using sterile (heated & cooled) forceps to a 50 mL conical tube containing 20 mL pre-warmed trypsin/EDTA solution.\nCoat the inside of a 25 mL serological pipet with KGM +10% FBS by pipetting the 10% FBS solution up and down a few times (and then fully emptying the pipet) before agitating the epidermal strips. The goal of this step is to leave a very thin coating of 10% FBS inside the pipet, which will help reduce sticking of epidermal strips on the inner surface of the pipet without significantly neutralizing the trypsin. Agitate the epidermal strips in the warm trypsin/EDTA solution for ∼5 min by repeatedly pipetting up and down using the coated 25 mL pipet.\nAdd 20 mL KGM + 10% FBS to the epidermal strips in trypsin/EDTA to neutralize the enzyme.",
    "Using the coated 25 mL pipet, slowly filter the cell suspension through a 70 μm cell strainer into a clean, sterile 50 mL conical tube (Figure 2[href=https://www.wicell.org#fig2]I). Handling the cell strainer in a sterile manner is simplified by clamping it in a sterilized hemostat, as shown in Figure 2[href=https://www.wicell.org#fig2]I. Use care to avoid overloading the cell strainer, which can only handle a small volume at a time. Tilting the cell strainer at a ∼45 degree angle above the conical tube will allow for easier transfer and flow-through of liquid. Transfer the strained cell suspension to ice until ready to centrifuge.\nNote: Do not sit the cell strainer in the top of the 50 mL conical tube, although it fits and appears to be designed to be used this way. In our experience, this usually results in the cell suspension leaking out from the sides and dripping down the outside of 50 mL tube.\nUsing sterile (heated & cooled) forceps, transfer the epidermal strips from the cell strainer to a fresh 50 mL tube containing 20 mL HBS. Repeat agitation with a fresh 25 mL pipet, pre-coated with 10% FBS, for ∼4–5 min to release additional keratinocytes. You may notice the epidermal strips appearing thinner as cells are released.\nRepeat filtration of epidermal strips through a 70 μm cell strainer into a fresh tube containing 20 mL KGM + 10% FBS. Place this tube on ice until ready to centrifuge. (Note: use a fresh cell strainer here, to avoid clogging that may occur if the strainer is re-used multiple times)\nAs above in step 8f, transfer the epidermal strips into a second tube containing 20 mL HBS and repeat agitation with 25 mL pipet for 4–5 min.",
    "Repeat filtration of solution with epidermal strips a final time using a 70 μm cell strainer into a tube containing 20 mL KGM + 10% FBS.\nCentrifuge all epidermal cell suspensions for 7 min at 1000 rpm (∼250×g) at 4°C.\nCarefully remove the supernatants from all tubes by aspirating or pipetting, taking care not to disturb pellets. Resuspend cell pellets in cold KGM (200 μM calcium chloride) and combine into a single tube or sterile bottle. Remove an aliquot for counting, and place remaining cell suspension on ice until ready to inoculate flasks. Dilute the cell suspension 1:10 and count using a hemacytometer (Figure 3[href=https://www.wicell.org#fig3]A).\nNote: We recommend counting using a hemacytometer so that only viable, proliferative cells are counted. These can be easily distinguished based on appearance, as illustrated in Figure 3[href=https://www.wicell.org#fig3]A. Although the proliferative keratinocytes will probably not all exhibit the same shape in the hemacytometer, their size should be fairly uniform. Do not count dark or very large cells; count only refractory, uniformly sized cells.\nCalculate the cell concentration in the undiluted cell suspension, and inoculate into collagen-coated T225 flasks pre-equilibrated with 45 mL KGM at 37°C, 5% CO2. A good yield of keratinocytes is ∼1 x 106 cells/cm2 of starting skin area. Inoculate into flasks at 0.5–1.0 × 105/cm2 (∼11.25–22.5 × 106 per T225 flask). Place flasks in incubator overnight (∼16 h).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1435-Fig3.jpg\nFigure 3. Images of P0-P1 primary human keratinocytes in culture\n(A) Image of P0 keratinocytes in hemacytometer, viewed through phase-contrast microscope. The 16-square area for counting is indicated by white arrows. Note that cell morphology is heterogeneous and only refractory (bright) cells of roughly uniform size should be counted. Dark looking cells and debris (black arrows) should not be counted.",
    "(B) Human P0 keratinocytes at day 1, ∼24 h after inoculation into collagen-coated flask. Note that the cell population appears heterogeneous at this stage, with many cells appearing bright and raised from culture surface. Cells have irregular shapes, and some 2-cell colonies or dividing cells may be observed (white arrows).\n(C) Human P0 keratinocytes at day 2 of culture. The cells exhibit diverse morphologies: rounded-up cells, which may be in the process of cell division (white arrow), can be seen, in addition to more flattened cells. This appearance is normal at P0 in KGM-LC. In KGM-LC, P0 keratinocytes may appear large and flat, and form loosely-associated colonies. Occasional elongated cells, most likely melanocytes, may be observed (black arrow).\n(D) By culture day 6, P0 keratinocyte morphology appears more uniform, with numerous flattened, widely separated cells. A melanocyte is identified by its dendritic morphology (black arrow).\n(E) P0 keratinocytes at day 7, immediately prior to melanocyte removal. Melanocytes are indicated by black arrows.\n(F) Nearly confluent P0 keratinocytes at the time of harvesting for passage.\n(G) P1 keratinocytes shown 48 h after inoculation.\n(H) P1 keratinocytes 6 days after inoculation, at time of harvest (∼80%–85% confluent). Note tighter colonies and more uniform morphology after passage and culture in “regular” calcium (0.2 mM) KGM. Original image magnification: 10× (B–D); 4× (A, E–H).\n    Your browser does not support HTML5 video.\n  \nMethods video S1. Extrusion of human dermal microvascular endothelial cells (HDMEC) from dermal strips, as described in Step 6a (day 2 of procedure)",
    "This video briefly demonstrates the method used for mechanical extrusion of HDMEC from dermal strips after enzymatic separation of dermis from epidermis (as shown in Figure 2[href=https://www.wicell.org#fig2]E). Following extrusion, the liquid containing HDMEC will be collected and centrifuged, and the cell pellet resuspended and plated as P0 HDMEC. The dermal strips will be placed in a separate vessel for subsequent isolation of fibroblasts\nDay 3 of procedure (culture day 1)\nTiming: 1–1.5 h\nHDMEC culture:\nRinse flasks 2–3 times with 5 mL HBS to remove debris, and replace with fresh ECGM, 15 mL per T75 flask. Incubate at 37°C, 5% CO2, for 48 h before changing media again.\nNote: Rinsing the flask the day after inoculation will help to remove any debris, such as collagen and bits of dermal tissue, which may contain non-adhered or loosely-adhered fibroblasts. This step will help reduce contamination of HDMEC by fibroblasts.\nBy days 1–2, small clusters of cells can be observed migrating from tissue pieces, and small colonies may be present (Figure 4[href=https://www.wicell.org#fig4]A).\nFibroblast culture:\nSet up 2 T150 flasks for fibroblast pieces, and label as “#2” flasks. Add 10 mL FGM to each flask and equilibrate in incubator for ∼30 min.\nCollect media and floating tissue pieces from #1 flasks and transfer to a sterile 50 mL conical tube. Replace with 25 mL fresh media per T150 flask and place #1 flasks back into the incubator.\nCentrifuge collected tissue pieces at 1000 rpm (∼250×g) for 7 min at 4°C.\nCarefully aspirate or pipet off supernatant (pellet will not be tight) and resuspend tissue pieces in 5 mL FGM. Inoculate half into each of the 2 T150 flasks prepared above.",
    "Note: On day 1, there may not be many fusiform cells visible in the #1 fibroblast flasks, but these should be clearly visible by days 2–3 in both #1 and #2 flasks (Figure 5[href=https://www.wicell.org#fig5]A), including cells associated with small tissue pieces adhered to the plastic. Large clusters of cells should be easily visible by culture day 4 (Figures 5[href=https://www.wicell.org#fig5]B and 5C).\nCritical: Do not skip step 10 and discard the tissue pieces on culture day 1, as this will significantly reduce fibroblast yield.\nKeratinocyte culture:\nSupplement a bottle of KGM-LC (“low calcium,” 0.06 mM CaCl2).\nChange P0 keratinocytes into KGM-LC one day after keratinocytes are initially inoculated: feed with 45 mL/T225 flask. Use this to feed keratinocytes until passaged to P1.\nNote: There may be few colonies visible on culture day 1, but by days 2–4, dividing cells and small colonies should be present (Figures 3[href=https://www.wicell.org#fig3]B and 3C). It is important to note that the appearance of keratinocytes in KGM-LC on collagen-coated plastic differs dramatically from their appearance in regular KGM after passaging to P1 or P2. At P0, the cells may appear larger, darker, flatter, and more widely separated, compared to later passage cells grown in KGM without collagen-coated flasks.\nCritical: Make sure to change the keratinocytes into KGM-LC on culture day 1, as this is essential for successfully establishing feeder-free primary keratinocyte cultures using this protocol.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1435-Fig4.jpg\nFigure 4. Images of P0-P1 primary human dermal microvascular endothelial cells (HDMECs) in culture\n(A) Image of HDMEC P0 culture on day 1 after initiation. Note the appearance of cells associated with residual pieces of tissue. HDMECs are relatively compact at this stage and tightly associated with each other.",
    "(B) Image of the same HDMEC P0 culture on day 4 after initiation. Note that the HDMECs now appear elongated but remain tightly associated in colonies. A contaminating fibroblast is observed (arrow).\n(C) HDMEC at P0 culture day 6.\n(D) HDMEC at P0 culture day 8, at time of harvest for passaging. White arrows indicate contaminating fibroblasts.\n(E) P1 HDMEC, one day after passaging.\n(F) P1 HDMEC at day 5. Contaminating fibroblasts are occasionally observed (white arrows in B, D, E, F). These tend to have more irregular shapes than HDMEC and are usually present as individual cells rather than colonies. Original image magnifications: 10× (A, B); 4× (C-F).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1435-Fig5.jpg\nFigure 5. Images of P0-P1 primary human fibroblasts in culture\n(A) P0 fibroblasts in #1 flask at culture day 2, after removal of tissue “pieces.”\n(B) P0 fibroblasts in #1 flasks at culture day 4.\n(C) P0 fibroblasts in #2 flask on culture day 4, 3 days after removal from #1 flasks.\n(D) P0 fibroblasts in #2 flasks on day 5, 4 days after removal from #1 flasks, at time of harvest for cryopreservation and/or passaging.\n(E) P1 fibroblasts, 1 day after passage and inoculation.\n(F) P1 fibroblasts, 5 days after inoculation, one day prior to planned harvest. Original image magnifications: 10× (A, B); 4× (C–F).\nDay 4 of procedure (culture day 2) and beyond\nHDMECs:\nChange media every 48 h using 15 mL ECGM/T75 flask until cells approach confluence.\nPassage the cells before confluence is reached; target density is 85%–90% confluence. If significant fibroblast contamination is present, harvest the cells at lower density.\nNote: HDMECs become more elongated by days 3–4 of P0 culture (Figure 4[href=https://www.wicell.org#fig4]B). In contrast to contaminating fibroblasts, HDMECs generally form tight colonies with groups of cells aligned with each other (Figures 4[href=https://www.wicell.org#fig4]B–4D).",
    "Note: A low number of contaminating fibroblasts should be out-competed by HDMEC in ECGM. Practicing the technique used for extrusion of HDMEC from dermal strips will greatly improve the ratio of HDMEC to fibroblasts in your primary culture. However, the relative levels of fibroblast contamination vary from sample to sample. If necessary, HDMEC can be purified from contaminating fibroblasts by selecting CD31-expressing cells using fluorescence-activated flow sorting (FACS) or magnetic beads. For example, Bourland et al. published a procedure for immunomagnetic bead separation utilizing Dynabeads® CD31 that can be followed to eliminate contaminating fibroblasts from HDMEC cultures (Bourland et al., 2019[href=https://www.wicell.org#bib2]).\nFibroblasts:\nChange medium to fresh FGM in all #1 and #2 flasks, 25 mL per T150 flask. Continue to change using 25 mL FGM every 48 h until cells approach confluence (Figure 5[href=https://www.wicell.org#fig5]D), then change 24 h prior harvesting and passaging or cryopreserving cells.\nDo not wait until cells are confluent to passage fibroblasts; the cells are likely to be unevenly distributed across the growth surfaces of the flasks, with many very large colonies associated with residual tissue pieces. Additionally, the cell density is likely to differ in #1 vs. #2 flasks, depending on the efficiency of collagenase digestion. The cell viability and proliferative potential will be significantly reduced if you wait too long and cells progress well beyond confluence, which may result in cell cycle arrest due to contact inhibition (Chassot et al., 2008[href=https://www.wicell.org#bib11]).\nKeratinocytes:\nContinue to change medium every 48 h until cells approach confluence, then give one extra change the day before harvesting for passage to P1.\nBy culture days 2–3, melanocytes should be visible in the epidermal keratinocyte cultures (Figures 3[href=https://www.wicell.org#fig3]C and 3D). Before keratinocytes exceed ∼50% confluence, melanocytes should be removed from the flasks via differential trypsinization, as detailed below (Figure 3[href=https://www.wicell.org#fig3]E).",
    "Passage the cells from P0 to P1 when they are ∼90%–95% confluent (Figure 3[href=https://www.wicell.org#fig3]F).\nNote: P0 keratinocytes in KGM-LC will appear large and will not form tight colonies, and will appear to cover the growth surface of the flask (i.e., will appear confluent) at a lower cell density than later passage keratinocytes in KGM. At P0, it is acceptable to harvest keratinocytes when they appear nearly confluent, with relatively little empty space in the flask (Figure 3[href=https://www.wicell.org#fig3]F). At P1 and beyond, do not allow cells to reach confluence prior to passage! Always try to passage before the entire growth surface is covered with cells (Figure 3[href=https://www.wicell.org#fig3]H), as the cells will begin to terminally differentiate (and some cells in the culture will cease proliferating) when they reach or exceed confluence.\nIsolation of epidermal melanocytes (on or around day 5–7 of procedure)\nTiming: 1.5–2 h\nGeneral considerations:\nMelanocytes are removed from flasks by trypsin treatment much more easily than keratinocytes, allowing for separation by differential trypsin treatment. This differential trypsinization enables separation of melanocytes from keratinocytes; melanocytes will be collected and transferred to fresh flasks for culture in melanocyte-specific medium, while keratinocytes will remain in the original flasks to be further cultured in KGM-LC and subsequently passaged.\nThis separation procedure should be performed after keratinocyte colonies are visible, and melanocytes can be seen in these flasks (Figures 3[href=https://www.wicell.org#fig3]D and 3E), but before keratinocytes begin to approach confluence. This usually occurs at 5–7 days after initial inoculation of P0 keratinocytes, but check flasks daily because different primary cultures can exhibit different growth characteristics. Separation will be much more difficult once keratinocytes become more densely packed in the flasks.\nUse a 1:10 dilution of trypsin/EDTA solution when removing melanocytes from P0 keratinocytes, and at subsequent passages, to minimize contamination with keratinocytes.",
    "Note that keratinocytes can be cultured without removal of melanocytes; the melanocytes will be mostly out-competed by keratinocytes after serial passaging, but may persist at low levels as “passengers” (i.e., contaminants) in the keratinocyte cultures. Cryopreservation of primary epidermal cultures will further diminish melanocyte numbers, because melanocyte viability is significantly diminished when frozen using parameters specific for keratinocytes; this is especially true for melanocytes with high melanin levels.\nThe removal of melanocytes from keratinocyte cultures is only necessary if you are interested in isolation of melanocytes, or if you are concerned about passenger melanocytes contaminating the keratinocyte cultures in downstream applications.\nPreparations before starting:\nWarm HBS, MGM, FBS, and KGM-LC in a 37°C water bath.\nPrepare 10 mL of a diluted trypsin/EDTA solution (1:10) for each T225 flask of keratinocytes. Mix 1 mL of 0.025% Trypsin + 0.02% EDTA with 9 mL HBS for each T225 flask. Store on ice until and warm to 37°C immediately before use.\nPrepare 10 mL of a 10% FBS “stop” solution by mixing 1 mL of FBS with 9 mL MGM for each T225 flask.\nPrepare FBS-coated flasks for primary melanocyte culture: Coat T75 flasks (1 per 1–3 T225 of keratinocytes) with 100% FBS (3 mL/T75), rock to cover entire growth surface, and incubate at 37°C for 30 min. Aspirate all the FBS to remove, and add 15 mL MGM to each T75 flask. Pre-equilibrate in incubator before inoculating melanocytes after removal from keratinocytes.\nTurn on centrifuge and pre-chill to 4°C.\nRemoval of melanocytes from keratinocyte cultures:\nAspirate medium from keratinocyte flasks (T225s).\nAdd 10 mL HBS to each flask, gently rock to rinse cell surface, and incubate at room temperature (20°C–22°C) for 3–4 min. Aspirate HBS and repeat wash step once.",
    "Add 10 mL diluted, warmed trypsin/EDTA to each T225 flask. Rock very gently to ensure complete coverage of growth surface, and incubate 3–4 min at room temperature (20°C–22°C).\nQuickly check under microscope; melanocytes should be releasing from flask, but keratinocytes should not. Do not wait until keratinocytes start rounding up and detaching from flasks, to avoid contamination of melanocytes with keratinocytes.\nNote: The phenotype of keratinocytes can vary from donor to donor, and some donor strains may adhere more tightly to flasks than others. It is very important to always check the cells under the microscope during this procedure to avoid removing keratinocytes with melanocytes.\nCollect diluted trypsin/EDTA solution containing melanocytes, and add to a 50 mL conical tube containing 10% FBS.\nRinse each flask very gently with 10 mL HBS, and check under microscope. If keratinocytes still appear tightly adhered to flask, collect this HBS wash and add to tube(s) with collected melanocytes. If keratinocytes appear to be releasing from the flask, discard this wash solution to avoid contaminating melanocyte cultures with keratinocytes.\nAdd 45 mL KGM-LC to each T225 with keratinocytes and place back in incubator.\nCentrifuge tubes with melanocytes at 1000 rpm (∼250×g) for 7 min at 4°C.\nResuspend melanocyte pellet in MGM; remove aliquot for counting. Inoculate melanocytes into pre-equilibrated FBS-coated flasks (prepared in step 15d, above) at ∼5 × 104/cm2 and place in incubator. The melanocytes are considered to be at passage P1 at this stage.\n24 h later, aspirate the medium from flasks containing the isolated melanocytes and replace with fresh MGM. Change medium to fresh MGM (15 mL/T75 flask) every 48 h until melanocytes are ready to harvest for passage.",
    "Note: If there are still melanocytes present in keratinocyte cultures after completion of this procedure, the differential trypsinization can be repeated on subsequent days. However, do not try to repeat on the same day or the subsequent yield of proliferative keratinocytes may be reduced due to damage from repeated trypsin exposure. Although a second removal of melanocytes will likely only produce small numbers of recovered cells, it will help to diminish or eliminate melanocytes from the keratinocyte cultures. Under conditions optimized for keratinocyte culture, melanocytes can still survive and even proliferate, albeit at low levels, which could otherwise interfere with some applications or experiments.\nNote: If there are keratinocytes present as contaminants in the melanocyte cultures, a second differential trypsinization procedure can be used to transfer melanocytes to fresh T75 flasks. Wait at least 2–3 days to do this to avoid damaging melanocytes.\nHarvesting P0 keratinocytes (and other cell types) for subculture or cryopreservation\nTiming: 1–2 h\nGeneral considerations:\nThe procedures for harvesting keratinocytes are described in detail here, with modifications presented below for fibroblasts, HDMEC, and melanocytes.\nTissue culture vessels & coatings:\nKeratinocytes do not require any coating of flasks for culture at P1 and beyond; tissue culture-treated flasks without collagen coating are used, and medium containing 0.2 mM CaCl2 (“regular” calcium KGM) is used.\nFor subcultures of HDMEC or melanocytes to P1 and beyond (described in steps 22–31, below), flasks coated with Attachment Factor or FBS, respectively, will still be used, as with P0 cultures. Fibroblasts do not require coated flasks at any stage of the procedure.\nCell density prior to harvesting:",
    "Ideally, cells should be subcultured prior to reaching confluence. Although this is important for all four primary cell types, it is most important for keratinocytes, which will begin to differentiate upon reaching confluence, resulting in decreased colony forming efficiency and substantially reduced proliferative potential.\nNote, however, that P0 keratinocytes form relatively loose colonies when cultured in KGM-LC, appear larger and flatter than at later passages, and will appear to reach confluence at a lower cell density per cm2 (Figure 3[href=https://www.wicell.org#fig3]F) at P0 than cells in regular calcium (0.2 mM) KGM at P1 and beyond. Do not allow the density of P0 keratinocytes to exceed that shown in Figure 3[href=https://www.wicell.org#fig3]F, if possible.\nIt is better to harvest the cells sooner rather than later, as they will flatten and then start to differentiate and pile up if allowed to get overly dense before passage, resulting in lower overall proliferative capacity.\nPreparations before starting:\nDecontaminate tissue culture hood and prepare aspirating flask by adding a sufficient volume of bleach to decontaminate aspirated liquid (∼10% final concentration).\nPrepare a dilute solution (685 μM) of EDTA by adding 68.5 μL of a 0.5M EDTA solution to 50 mL HBS. Sterile filter through a 0.22 μm tube top filter.\nWarm HBS and KGM (“regular” calcium) in a 37°C water bath.\nPre-chill centrifuge to 4°C\nThaw 0.025% Trypsin + 0.02% EDTA (5 mL/T225) and store on ice; warm to 37°C just prior to use.\nPrepare a “stop” solution consisting of 10% FBS in KGM (5 mL/T225) and store on ice.\nHarvest keratinocytes:\nRemove flasks from incubator, and in tissue culture hood aspirate KGM from flasks.\nAdd 10 mL HBS per flask, and rock to rinse growth surface for 30 s–1 min. Aspirate to remove HBS.",
    "Add 10 mL dilute EDTA solution to each flask and rock to even coat growth surface. Incubate for 5 min at room temperature (20°C–22°C). This will not remove keratinocytes, but will ease removal during the subsequent trypsin/EDTA treatment and will improve overall yield.\nAspirate to remove dilute EDTA solution, and add 5 mL warm trypsin/EDTA solution. Place in incubator at 37°C and incubate for 3–5 min.\nRemove flasks from incubator and check under microscope. Cells should be rounded up but will probably still be attached to the flask. Gently tap flasks, and rock back and forth to loosen and remove cells. Check under microscope and continue tapping/rocking until most cells have released from surface. Work quickly and avoid leaving cells in trypsin/EDTA solution for more than 5–6 min total.\nNote: The strength of adhesion to the growth surface of the flask can vary widely among different donor cell strains, and may be affected by various pathological conditions; for example, keratinocytes isolated from keloids exhibit adhesion defects and are more easily removed by trypsin treatment than keratinocytes from normal skin (Hahn et al., 2013[href=https://www.wicell.org#bib12]). If gentle tapping and rocking is insufficient to loosen keratinocytes from plastic, more vigorous rapping or banging of the flask can be tried, but use caution to avoid cracking the flask. We recommend hitting the flask harder, if necessary, to remove cells, rather than leaving them in trypsin for longer than 5–6 min.\nCritical: Do not leave keratinocytes in trypsin for >6–7 min or viability and/or proliferative potential may be significantly reduced.\nCollect cell suspension and add to tube(s) containing cold 10% FBS in KGM to neutralize the trypsin.",
    "Add 10 mL HBS per flask to rinse; using a 10 mL pipet, spray the HBS rinse directly onto the growth surface several times to release any remaining cells. Collect this rinse and add it to the tube(s) with trypsinized cells in 10% FBS solution.\nCentrifuge at 1000 rpm (∼250×g) for 7 min at 4°C.\nResuspend cells in KGM and remove a small amount to count using a hemacytometer. Keep keratinocytes on ice while counting and until ready to inoculate.\nNote that collagen coating of flasks is not required for P1 cultures and beyond, and KGM with “regular” calcium (200 μM) should be used.\nSubculture:\nEquilibrate flasks with “regular” calcium (200 μM) KGM for 30 min at 37°C, 5% CO2.\nInoculate keratinocytes (now P1) at a density of 2–10 × 103/cm2. The inoculation density will determine the number of days until the cells reach ∼80%–90% confluence. Table 1[href=https://www.wicell.org#tbl1], below, shows estimated culture times for different densities, but expect there to be variability among different donor cell strains. In general, keratinocytes of a healthy, proliferative donor strain are expected to double in number approximately every 24 h. However, the growth rate will slow slightly at subsequent passages, and will drop off substantially after ∼P5 or P6. If cells are harvested at near-confluence (∼90%), expect to harvest ∼1 × 105 keratinocytes/cm2 (∼22.5 × 106 per T225 flask), although this will be lower for P0 keratinocytes, which appear larger and form looser colonies in KGM-LC than later passages in KGM.\ntable:files/protocols_protocol_1435_6.csv\naFor melanocytes and HDMEC, we do not recommend inoculating into flasks at <5,000/cm2.\nModifications of harvest procedure for HDMEC and fibroblasts",
    "For HDMEC, coat flasks with Attachment Factor as described above (step 4h), then add ECGM to flask(s) and equilibrate in incubator. For fibroblasts, no coating is needed; equilibrate flask(s) with FGM in incubator.\nHarvest the cells at ∼90% confluence, when growth surface of flask is nearly covered. See Figures 4[href=https://www.wicell.org#fig4] and 5[href=https://www.wicell.org#fig5] for examples of P0 HDMEC (Figure 4[href=https://www.wicell.org#fig4]D) and fibroblasts (Figure 5[href=https://www.wicell.org#fig5]D) photographed just prior to harvest.\nPrepare tubes containing ECGM (for HDMEC) or FGM (for fibroblasts) for neutralization of trypsin during harvest. HDMEC and fibroblasts are cultured in media containing 4%–5% FBS, so it is not necessary to prepare a solution of media containing 10% FBS to neutralize trypsin. Instead, ensure that at least 2 mL of supplemented FGM or ECGM are used per 1 mL trypsin.\nHDMEC and fibroblasts are more easily removed from tissue culture plastic than keratinocytes. Follow the procedures described above for keratinocytes (step 20), using 0.025% Trypsin + 0.02% EDTA to release cells from plastic, but use 3 mL for T150 flasks and 2 mL for T75 flasks, in addition to the following modifications.\nPerform a brief HBS rinse (5–10 mL) prior to adding trypsin. The dilute EDTA rinse used for keratinocytes is not required for HDMEC and fibroblasts.\nTreat with trypsin for ∼2–3 min to remove cells. This can usually be done at room temperature (20°C–22°C) rather than 37°C. Do not exceed 5 min.\nGentle tapping and rocking should be sufficient to dislodge HDMEC and fibroblasts after trypsin treatment.\nRinsing flasks with HBS after trypsinization is still recommended to increase recovery; add the rinse to the tube(s) with trypsinized cells.",
    "Following harvesting cells for passaging to P1, inoculate into flasks as described above for keratinocytes (step 21b); note, however that different cell types have different doubling rates and thus will reach confluence at different times. Recommended inoculation densities are listed in Table 1[href=https://www.wicell.org#tbl1], above. Do not inoculate HDMEC below <5,000/cm2, as this stresses the culture and may impede proliferation. Using the procedures and media formulations described here, fibroblasts should double in number every ∼16–20 h. HDMEC and melanocytes have slower growth rates, doubling every ∼2–3 days. For all primary cell types, there can be substantial donor-to-donor variability in growth characteristics, and doubling time will increase with increasing passage in culture.\nModifications of harvest procedure for melanocytes\nHarvest the cells at ∼90% confluence, when growth surface of flasks is nearly covered. See Figure 6[href=https://www.wicell.org#fig6]D for example of melanocytes photographed just prior to harvest.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1435-Fig6.jpg\nFigure 6. Images of P1 primary human melanocytes in culture\n(A) P1 melanocytes at culture day 2, 2 days after removal from P0 keratinocytes, photographed at 10× magnification.\n(B) P1 melanocytes at culture day 5, photographed at 10× magnification.\n(C) P1 melanocytes at culture day 5, photographed at 4× magnification. A small cluster of cells resembling keratinocytes is present (white arrow). Note that using a diluted trypsin solution when harvesting melanocytes, and trypsinizing for the minimum length of time required, will eliminate keratinocytes from successive passages.\n(D) P1 melanocytes at day 8, at time of harvest for subculture. Some contaminating cells resembling keratinocytes are present (white arrows).\nPrepare 10% FBS in MGM for neutralization of trypsin during melanocyte harvest (≥1 mL per mL of trypsin).\nPrepare FBS-coated flask(s) as described above (step 16d), then add MGM to flask(s) and equilibrate in incubator. Use FBS-coated flasks for every passage of melanocytes.",
    "Melanocytes are much more easily removed from tissue culture plastic than keratinocytes, and a 1:10 dilution of the trypsin/EDTA solution can be used for harvesting, as done when removing melanocytes from keratinocytes. Using a dilute solution at each passage will help eliminate any contaminating keratinocytes that may be present.\nPerform a brief HBS rinse prior to adding trypsin; do not perform the initial rinse with EDTA, as done for keratinocytes.\nTreat with trypsin at room temperature (20°C–22°C) for ∼2–3 min to loosen and remove cells. Do not exceed 5 min.\nGentle tapping and rocking should be sufficient to dislodge cells after trypsin treatment.\nRinsing flasks with HBS after trypsinization is recommended to increase recovery; add the rinse to the tube(s) with trypsinized cells.\nAfter centrifugation, resuspension, and counting, inoculate into prepared FBS-coated, pre-equilibrated flasks at ≥5,000/cm2.\nCryopreservation of primary skin cells\nTiming: 2–3 h\nGeneral considerations:\nNote that high melanin levels can reduce viability of melanocytes during cryopreservation and recovery if routine methods for freezing and thawing are followed. The procedures outlined here—particularly, slower freezing rate and high serum content of freezing medium—work well for melanocytes with high melanin contents (Boyce et al., 2017a[href=https://www.wicell.org#bib7]).\nGood record-keeping is particularly important if you will be storing large numbers of vials long-term for your research. We strongly recommend that you design and maintain an inventory of frozen cell stocks, noting the cell type, donor strain, passage number, cell density, and cryopreservation date on each vial.\nTechnical considerations:\nIf you plan to freeze cells for future use, we recommend cryopreserving a portion of the cells at P0, and the rest after passage to P1. How many of each passage to cryopreserve will depend on your storage capacity and experimental needs.",
    "As with harvesting cells for passage, we recommend harvesting cells for cryopreservation before reaching confluence, while cells are in log-phase growth.\nWe strongly recommend using a controlled rate cell freezer (e.g., Custom BioGenic Systems model 2100) for the most consistent and predictable results.\nFrozen primary cells should be stored in liquid nitrogen or in a liquid nitrogen vapor phase freezer.\nIf storing in canes using a liquid nitrogen storage tank, we recommend storing only one cell type per cane to avoid mix-ups upon thawing.\nRemember that when cells are recovered from cryopreservation, they will be one passage later than when they were frozen; the harvest for freezing counts as one passage. For example, if cells are frozen at P0, they should be considered P1 when thawed.\nPreparations before starting:\nPrepare freezing media fresh before use by combining culture medium, FBS, and dimethyl sulfoxide (DMSO) in the amounts listed below in Table 2[href=https://www.wicell.org#tbl2] for specific cell types. For keratinocytes, fibroblasts, and endothelial cells, medium is combined with FBS to yield ∼20% FBS in the freezing medium, with 10% DMSO. For melanocytes, 90% FBS + 10% DMSO is used. Filter sterilize using a 0.22 μm tube top filter, and store on ice until used.\ntable:files/protocols_protocol_1435_7.csv\nLabel sterile 2 mL cryovials with cell strain, cell type, cell number (density), and date.\nIf using a controlled rate freezer, set up a blank vial (freezing media only) to include in freezing run. Turn on cell freezer and pre-chill before use.\nHarvest cells as detailed above for each specific cell type, resuspend in growth medium, and store on ice while counting and performing calculations. Remove an aliquot of cells and count using a hemacytometer, then calculate the total number of cells harvested.",
    "Critical: Always count cells prior to freezing, and freeze a known amount per cryovial, to facilitate planning of experiments and predictable performance upon recovery from cryopreservation.\nCalculate the desired number of cells to freezer per vial, and the number of vials to be frozen. We recommend freezing 1–6 × 106 cells per vial. If 2 mL cryovials are used, assume a volume of 1.8 mL cells in freezing medium for each vial; this leaves sufficient space to allow for changes in volume and pressure due to changes in temperature during freezing and thawing.\nPellet cells by centrifuging at 1000 rpm (∼250×g) for 7 min at 4°C.\nAspirate medium and resuspend in the required volume of cold freezing medium to yield the correct number of cells per 1.8 mL.\nExample: If you harvested 6.1 × 107 cells total, you can cryopreserve 10 vials at 6 × 106 each. Resuspend the cell pellet in 18.3 mL freezing medium, and aliquot 1.8 mL per vial.\n    T o t a l  #  c e l l s  c o u n t e d   X  m L  t o t a l   =    #  c e l l s  /  v i a l     1.8  m L  /  v i a l     \nAliquot cells into freezing vials on ice, then transfer to cell freezer for cryopreservation.",
    "For fibroblasts, keratinocytes, and HDMEC, a freezing rate of –10°C/min works well. However, for freezing melanocytes, a slower freezing rate of -1°C/min is recommended, particularly with melanocytes from darker skinned donors with high melanin content (Boyce et al., 2017a[href=https://www.wicell.org#bib7]). If a controlled rate cell freezer is not available, other methods or equipment for cryopreservation (e.g., Mr. Frosty™) may be used; however, we cannot guarantee that other, less tightly-regulated methods to reduce temperature will work as well as cryopreservation using a controlled rate freezer.\nQuickly transfer vials of cells to liquid nitrogen for storage. Even brief increases in temperature can reduce cell viability over long-term storage, so it is important to work quickly to avoid allowing frozen vials to warm during transfer to storage vessels.\nCaution: Utilize personal protective equipment (PPE) appropriate for use with liquid nitrogen, as the liquid is hazardous and can cause severe injury upon contact with skin. PPE for liquid nitrogen includes a face shield over safety goggles, or chemical splash goggles, and skin protection, including thermal insulated gloves, long sleeve lab coats, pants, and closed-toe shoes. For additional details, please consult the United States Department of Agriculture (USDA) website: https://www.ars.usda.gov/northeast-area/docs/safety-health-and-environmental-training/liquid-nitrogen-safety/[href=https://www.ars.usda.gov/northeast-area/docs/safety-health-and-environmental-training/liquid-nitrogen-safety/]."
  ],
  "subjectAreas": [
    "Stem Cells",
    "Cell Isolation",
    "Cell Culture",
    "Tissue Engineering",
    "Cell Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}