{
  "id": 7912,
  "origin_website": "Bio",
  "title": "Fluorescent Biosensor Imaging of Nitrate in <em>Arabidopsis thaliana</em>",
  "procedures": [
    "FRET sensor design For a detailed account of the generation of the sensor DNA constructs and the sensor mutants, please refer to Chen and Ho (2022). In this section, we just report a few concepts of the sensor design.DNA constructsBased on the FRET characteristic, we designed the Gateway expression clones with an insert of the bacterial (K. oxytoca) NasR/NIT domain (Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4743/bioprotoc-13-16-4743-g001.jpgFigure 1. Map of pDRFlip30-NasR plasmids. NasR, an NO3– binding protein, was fused via attB1 and attB2 linkers to a fluorescent protein FRET pair (donor: Aphrodite, and acceptor: Cerulean). The NasR protein (purple) representation is from a published structure of NasR [PDB 4AKK (Boudes et al., 2012)]. The Aphrodite (yellow) representation is from a published structure of Venus [PDB 1MYW (Rekas et al., 2002)] and the Cerulean (blue) representation is from a published structure of Cerulean [PDB 2WSO (Lelimousin et al., 2009)].Expression of sensors in yeast and fluorescence analysis Yeast transformationThe protease-deficient yeast strain BJ5465 is transformed with the sensors containing the desired above (e.g., NiMet-NIT, NiMet1.0, NiMet2.0, NiMet3.0, nlsNiMet3.0, or NiMet3.0-NRs) by using the modified lithium acetate method from Gietz et al. (1992). In brief:Inoculate cultures in YPD medium and grow at 30 °C overnight to absorbance ~0.5 at OD 600 nm.Spin down (2,000× g) 1 mL of cells in a microfuge tube (15 s) for each transformation.Decant the supernatant and resuspend the cells in 100 μL of YPD medium by vortexing.Add 2 μL of 10 mg/mL carrier DNA and vortex.Add ~1 μg plasmid and vortex.Add 0.5 mL of PLATE mixture [100 mL stock containing 90 mL of 45% PEG4000, 10 mL of 1 M lithium acetate, 1 mL of 1 M Tris-Cl (pH 7.5), 0.2 mL of 0.5 M EDTA] and vortex.Add 20 μL 1 M DTT and vortex.Incubate at 25 for 6–8 h or overnight.",
    "Heat-shock cells for 10 min at 42 °C.Place a pipette tip directly into the bottom of the tube, withdraw 50–100 μL of cells, and plate cells on solid -ura DropOut medium. Wrap plates with plastic cling wrap to prevent dehydration.Incubate plates (lid down) at 30 °C for 2–3 days.Detection of NitraMeter responses in yeast using a fluorimeterSelect transformed yeast on solid YNB supplemented with 2% glucose and -ura DropOut medium.Pick single colonies by using sterile pipette tips and grow in a 50 mL tube containing 10 mL of -ura DropOut liquid medium. Pick at least three independent colonies.Note: Use fresh transformation. To avoid mutations in yeast or plasmid, do not keep colonies for more than one week on plates. Place tubes in a rack and incubate in an incubator for ~15 h under agitation (220 rpm) at 30 °C until the culture reaches absorbance ~0.5 at OD600nm.Subculture liquid cultures after dilution to OD600nm 0.01 in the same liquid medium and grow at 30 °C until absorbance reaches ~0.3 at OD600nm.Collect the cells by centrifugation at 3,000× g for 10 min at RT to precipitate the cells.Discard the supernatant and resuspend the precipitate by vortexing in 10 mL of wash buffer for 15 s at RT.Centrifuge at 3,000× g for 10 min at RT again.Wash the precipitate two more times as in Step e–f to remove traces of growth medium.Resuspend the precipitate to absorbance ~0.5 at OD600nm in resuspension buffer.Mix cells well and aliquot 100 μL of the culture into wells of a 96-well flat bottom plate.Measure the fluorescence in a fluorescence plate reader in bottom reading mode using 7.5 nm bandwidth for both excitation and emission.",
    "Typically, emission spectra are recorded with the following instrument settings: λem 470–570 nm for donor (mCer), step size 5 nm, gain: 75; and λem 520–570 nm for AFPt9, step size 5 nm, gain: 75. Fluorescence from pDRFlip30 (donor, mCer), pDRFlip39 (donor, t7.ed.eCFPt9), and pDRFlip42-linker (donor, mCer) was measured by excitation at λexc 428 nm; AFPt9 is measured with excitation at λexc 500 nm.Use a single or multichannel pipette to add 100 μL of the culture to wells (mix by pipetting up and down) and to add analyte solution to the cells. Set up at least three replicates per treatment. Try to add equal volumes of solutions to reduce variability and use well-calibrated pipettes, since the assays are quantitative and sensitive to differences in volumes/concentration of sensor and analyte.Record the fluorescence immediately (as fast as possible) after addition of substrate or control solution. It takes approximately 10 min to read a full 96-well plate with the parameters mentioned above. For highly accurate analyses, measure only a few wells at a time to reduce differences in analysis time. It is also possible to use instruments with injectors that allow for immediate recording; use rapid switching between wells to record over time.Note: The sensor exhibits functional activity when employed as a purified recombinant protein. Expression of NiMet3.0, NiMet3.0-NR-R176A, and nlsNiMet3.0 in Arabidopsis DNA constructs for expressing sensors in plantsInsert open reading sequence of NasR or NasR-NR-R176A into the multiple cloning site of the p16-Kan vector (Jones et al., 2014): 5′-, a sequence coding for the SV40-derived nuclear localization signal LQPKKKRKVGG (Schuster et al.",
    ", 2014); a sequence coding for Aphrodite; a Gateway cassette including attR1, Chloramphenicol resistance gene, ccdB terminator gene, and attR2; a sequence coding for mCerulean (mCer); and a sequence coding for the cMyc epitope tag -3′, or pZPFlip UBQ10-KAN vector under the control of the UBQ10 promoter.Note: The p16 promoter (Schuster et al., 2014) from the AT3G60245 gene encoding a 16S ribosomal subunit was used to drive the nuclear-localized NiMet3.0 fusion biosensor, whereas the CaMV 35S promoter (Battraw and Hall, 1990) was used to drive the NiMet3.0 and NiMet3.0-NR-R176A fusion biosensor in plants. Recombine in Gateway LR reactions with NasR or NasR-NR-R176A Entry Clones, resulting in NiMet3.0, NiMet3.0-NR-R176A, and nlsNiMet3.0 expression clones.Generate transgenic plants using the Agrobacterium floral dip methodIntroduce sensors into Agrobacterium tumefaciens GV3101.Grow healthy Arabidopsis plants in 12 h of light, 50% humidity, and at 22 °C until they begin to bolt and produce floral inflorescences (3–4 weeks in a growth chamber).Remove siliques and mature flower clusters before floral dipping.Inoculate a single Agrobacterium colony that was transformed with sensors into 5 mL of liquid LB medium containing the appropriate antibiotics [spectinomycin (final concentration 100 μg/mL)] for binary vector selection. Incubate the culture at 28 °C overnight.The following morning, use this feeder culture to inoculate 200 mL of liquid LB with spectinomycin (final concentration 100 μg/mL) and grow the culture at 28 °C for 16–24 h.Collect Agrobacterium cells by centrifugation at 3,000× g for 10 min at RT and discard the supernatant. Then, gently resuspend cells in one volume of the freshly made dipping medium.Dilute Agrobacterium cells to 6 × 109 cells/mL.Spray the Agrobacterium on the floral part of the Arabidopsis. Then, lay down the dipped plants in a plastic basin and cover them with plastic wrap for 16–24 h to maintain high humidity.",
    "The next day, remove the cover and allow them to grow normally for one month in the greenhouse or the growth chamber; withhold watering when siliques turn brown.Select transformants on agar plates containing 1/2× MS medium with vitamins (PhytoTech Labs, M519) and kanamycin (30 mg/L).Imaging the nitrate sensor in Arabidopsis with fluorescence microscopy confocal microscopy Note: Although a fluorescence confocal microscope is the standard equipment used, light-sheet microscopy is another option. The settings for laser intensity, detector, and objective are similar to those for confocal microscopy. Please refer to the detailed procedure of the light-sheet system in the Supplementary information section. Germinate and grow transgenic seedlingsGerminate and grow vertically on 1/2× MS modified basal salt mixture without nitrogen, 1% agar, and 0.05% (w/v) sucrose (pH 5.7) plates.Place 5- or 6-day-old seedlings in the solution containing 1/2× MS medium [1/2× MS and 0.05% sucrose (pH 5.7)] and prepare for imaging on glass slides.Nitrate treatments on glass slides for confocal microscopyPlace seedlings on glass slides with 50 μL of solution, surround with a rectangle of vacuum grease, and cover with a square coverslip equal in height and half the width of the vacuum grease rectangle.Exchange the nitrate treatment solution beneath the coverslip by addition to the left and removal from the right side of the coverslip.Acquire confocal images on a Zeiss 780 laser scanning microscope and use a 20×/0.8 Plan-Apochromat dry objective or 40×/1.2 C-Apochromat water objective. Excite CFP (440 nm) and yellow fluorescent protein (YFP; 514 nm) with lasers. Detect fluorescence emission using a GaAsP photomultiplier tube (PMT) detector, set to detect 463–508 nm for CFP, and a normal PMT detector, set to 520–585 nm for YFP. Set the laser power between 0.5% and 2% with detector gain set to 700–750 to image CFP or YFP.",
    "Acquire images at time points based on the purpose of the research (refer to the note below for details on time point settings). Acquire three-dimensional images, with a z-step size of 1.5 μm and half the diameter of the primary root axis in Arabidopsis.Notes:  i. For example, if the purpose is to observe the nitrate distribution in the root after different concentrations of medium supplement, it is suitable to set the range and interval of the time points to less than an hour, unless the sample can be kept moist. Additionally, fluorescence blenching should be considered when continuously recording. ii. For other methods that can be used to obtain continuous images or video, please refer to the Supplementary information."
  ],
  "subjectAreas": [
    "Plant Science",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}