{
  "id": 3347,
  "origin_website": "Cell",
  "title": "Protocol for constructing GQD-PMO functionalized FET-biosensor for ultrasensitive exosomal miRNA detection",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nTo preserve the stability and integrity of the sensing interface, we conduct all biosensor manufacturing procedures in a Class 100 Laminar Airflow Clean Lab or Workbench. We carry out these procedures at 25°C unless specified otherwise.\nConstruction of PLL-functionalized RGO-FET sensor\nTiming: 1 week\nPreparation of stable RGO suspensions.\nTo prepare a stable RGO suspension solution, we followed the method presented by Tung et al.4[href=https://www.wicell.org#bib4]\nWeigh 1.5 mg of GO compound in a 2 mL microtube and add 1 mL of 98% hydrazine solution.\nSonicate the tube for 10 min to obtain a black suspension of hydrazinium graphene (HG).\nGently shake the suspension at 4°C for 1 week to prevent GO aggregation, yielding a stable reduced-GO suspension solution.\nFabrication of RGO-FET biosensors.\nDeploy a 0.2 μL suspension solution of RGO (0.2 mg/mL), prepared in step 1, by drop-casting onto the chip sensing channel.\nImpose 150°C heat upon the RGO-paved sensor chip for 1.5 h to immobilize the RGO.\nPlunge the chip into a Piranha solution (7:3 v/v, H2SO4/35% H2O2) followed by sonication for 30 s, resulting in a few-layer RGO-FET sensor chip.\nRinse the chip with deionized water three times and dry the RGO-FET sensor chip with nitrogen flow.\nCritical: Experimenters should handle the Piranha solution diligently and wear appropriate personal protective equipment during preparation, as it is highly corrosive. To prepare the solution, we combine 70 mL of concentrated H2SO4 with 30 mL of 35% H2O2 in a beaker while gently stirring the mixture with a glass rod. It is essential to perform the entire procedure in a well-ventilated area, preferably within a fume hood.\nPaving PLL film on top of the RGO-FET sensor.\nDilute the PLL stock solution (1 mg/mL) to a concentration of 0.5 mg/mL using purified deionized water.",
    "Dispense 0.5 μL of the PLL solution (0.5 mg/mL) dropwise onto the RGO-FET sensor surface (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2932-Fig1.jpg\nFigure 1. Synthetic scheme of PLL-mediated RGO-FET functionalization\nHeat the sensor chip at 80°C for 2 h.\nSequentially rinse the PLL functionalized-RGO-FET sensor 3 times with 1×phosphate-buffered saline (PBS) and ultra-pure water.\nDry the sensor using nitrogen.\nCharacterization of the PLL-RGO-FET sensor by X-ray photoelectron spectroscopy (XPS), Raman spectrometer (Raman), and Transmission Electron Microscopy (TEM).\nTEM: PLL-RGO hybrid should reveal a flat sheet with wrinkled, folded structures.\nXPS: The N1s (399.9 eV) peak of RGO-PLL should have a significant increase compared to RGO.\nRaman spectra: ID/IG ratio of RGO and PLL-RGO increases from 1.20 to 1.28.\nNote: The strong binding between RGO and PLL is the result of (1) electrostatic attraction (2) hydrophobic interaction (3) protonated amine-p electron interaction.5[href=https://www.wicell.org#bib5],6[href=https://www.wicell.org#bib6]\nSynthesis of GQDs-PMO hybrids\nTiming: 2 h\nGQD activation and GQD-PMO hybrids formation.\nTo achieve stable GQDs-PMO hybrids, we activate the carboxyl groups on the surface of GQDs using EDC (50 μL, 50 mg/mL) and NHS (50 μL, 12.5 mg/mL) solutions. Subsequently, we co-incubate NH2-modified PMO probes with the activated GQDs, forming the desired hybrids. The interaction between the activated carboxyl groups on GQDs with NH2-modified PMO probes leads to the formation of stable GQDs-PMO complexes (Figure 2[href=https://www.wicell.org#fig2]).\nTake 50 mg of EDC and 12.5 mg of NHS into separate 2 mL microtubes. Add 1 mL of deionized water into each tube and thoroughly mix to create stock solutions of EDC and NHS.\nDissolve 1 mg of GQDs product in 1 mL of deionized water.\nMix 50 μL of EDC stock solution, 50 μL of NHS stock solution, and 100 μL of GQDs solution in a new microtube.",
    "Cover the mixed solution tube with tin foil to shield it from light exposure. Place the tube onto a shaker at 25°C for 30 min with mild shaking to activate the GQDs (500 μg/mL).\nDilute the PMO stock solution into a concentration of 1 μM.\nCombine 200 μL of PMO solution (1 μM) with 200 μL of the activated GQDs solution in a new microtube.\nShield the mixed solution tube with tin foil and place it on a shaker at 25°C for 60 min with gentle shaking at a slow speed to form the GQDs-PMO hybrids.\nCharacterization of the GQDs-PMO hybrids using TEM, fluorescence, and Zeta potential tests.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2932-Fig2.jpg\nFigure 2. Synthetic scheme of the GQDs-PMO hybrids\nTEM: The carboxylated GQDs have a uniform size with particle diameters of approximately 4–5 nm.\nFluorescence: Under the excitation wavelength of 365 nm and detection wavelength of 465 nm, the fluorescence signal values of the GQDs-PMO hybrids are lower than those of the GQDs due to the fluorescence quenching effect.\nZeta potential: We initially measure the zeta potential of GQDs to be −21.22 mV, which reduces to −10.37 mV after combining PMO with GQDs, indicating successful synthesis of the GQDs-PMO hybrids.\nNote: To prepare EDC and NHS stock solutions correctly, allow the reagents to equilibrate to room temperature before use. Mix EDC and NHS at the time of use, not beforehand. Advisably, store or handle the GQDs solution in an environment away from light. These steps ensure the protocol's success and must be followed precisely.\nPreparation of GQDs-PMO hybrids decorated RGO-FET (GPPR-FET) sensor\nTiming: 3 h\nDeposition of the GQDs-PMO hybrids on the PLL-paved RGO-FET sensor.\nDispense 10 μL of the GQDs-PMO hybrids solution onto the surface of the PLL-RGO-FET sensing channel.",
    "Cover the sensor chip with opaque sheets and incubate at 25°C for 8–12 h. The reaction between the carboxyl group on GQDs and the amino group on PLL enables the successful assembly of GQDs-PMO hybrids on the sensor surface.\nSequentially rinse the sensor 3 times with 1×PBS solution and ultrapure water to eliminate redundant unbinding PMO probes.\nDry the sensor using nitrogen flow.\nTo prevent clumping, gradually sprinkle 1 mg of molecular biology grade BSA powder onto the liquid surface of 1 mL distilled water and stir until fully dissolved, resulting in a BSA solution with a concentration of 1 mg/mL.\nDispense 10 μL of the BSA solution onto the chip sensing channel and incubate for 1 h to seal non-specific binding sites.\nRinse the sensor chip with deionized water 3 times.\nDry the chip with nitrogen flow.\nCharacterization of the GPPR-FET using XPS, fluorescence, atomic force microscope (AFM), and Id-Vg curve.\nXPS: We test the P-element of PLL-RGO-FET and GPPR-FET for XPS. The modification of GQDs-PMO leads to the appearance of a clear P-element peak (134.4 eV), carried by the phosphate group of the PMO probes.\nFluorescence microscope: The fluorescence microscope shows a red fluorescent signal of GQDs-PMO on the sensor surface, where the PMO is labeled with Cy5.\nAFM: AFM reveals that GQDs-PMO deposits a large number of nanoparticles on the chip surface after fixation, compared to the PLL-RGO sensor planar surface.\nId-Vg: We observe a shift of the Dirac point of the sensor to the right after PLL deposition for Id-Vg. This is due to the positive charge of PLL effectively inducing RGO P-doping. Upon immobilization of GQDs-PMO, we notice a shift of the Dirac point to the left, which is caused by the negative charge of GQDs-PMO N-doping the RGO. See Table 2[href=https://www.wicell.org#tbl2] for further details.",
    "table:files/protocols_protocol_2932_2.csv\nPMO/miRNA hybridization and electrical measurements\nTiming: 1.5 h\nThis section outlines the procedures for measuring miRNA21 using the GPPR-FET sensor. It includes assessing the sensor’s detection capabilities, such as selectivity, sensitivity, stability, and operating curve plots. These steps are essential to ensure accurate quantification of the analyte.\nSpecific hybridization of the PMO probe and analyte miRNA21.\nApply 10 μL of the synthetic miRNA21 oligonucleotide solution onto the GPPR-FET sensor surface and incubate it for 1 h at 25°C.\nRinse the sensor sequentially with 1×PBS solution, 0.2% SDS solution, 1×PBS solution, and nuclease-free water to remove any unhybridized molecules.\nDry the sensor with nitrogen flow in a ventilation cabinet.\nSetting up the Id-Vg measurement parameters.\nThe semiconductor characterization system (Keithley 4200-SCS) coupled with a probe station (Ever Being BD-6) conducts the electrical measurements of the GPPR-FET sensor.\nUtilize a silver wire as the gate electrode and apply a constant bias of Vds = 0.1 V to record the Ids-Vg (Ids being the drain-source current and Vg the gate voltage) curve.\nMeasure the Id-Vg curves at a specified Vg value by applying a liquid-gate bias of 0.1 V in 0.01× PBS.\nDirac point offset (ΔVCNP, refer to Figure 3[href=https://www.wicell.org#fig3]) serves as the electrical signal.7[href=https://www.wicell.org#bib7],8[href=https://www.wicell.org#bib8],9[href=https://www.wicell.org#bib9]\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2932-Fig3.jpg\nFigure 3. The formula for ΔVCNP calculation\nOptimizing the GPPR-FET sensor.\nGQDs/PMO ratio optimization.\nFix the GQDs concentration at 250 μg/mL and dilute the PMO stock solution to different concentrations, ranging from 0.5 μM to 2.5 μM, to establish various ratios of GQDs/PMO complexes.\nDrop-add GQDs/PMO complexes solutions with different ratios onto the PLL-functionalized RGO-FET biosensor surface to prepare the corresponding GPPR-FET biosensors.\nExpose the biosensors to 1 nM miRNA21 solutions for hybridization and record the ΔVCNP.\nSelect the sensor that produces the largest signal response for subsequent experiments.\nPLL concentration optimization.",
    "Add different concentrations of PLL solution (0.2 mg/mL, 0.5 mg/mL, and 1 mg/mL) dropwise onto the RGO film to prepare the corresponding PLL-paved RGO-FET sensors.\nExpose the biosensors to 1 nM miRNA21 solutions for hybridization and record the corresponding ΔVCNP.\nSelect the sensor that produces the largest signal response, this will specify the optimal PLL concentration.\nPMO-RNA hybridization time optimization.\nRecord the ΔVCNP at varied miRNA21-PMO hybridization times of 0.5, 1, and 2 h.\nSelect the sensor that produces the largest signal response, as this determines the optimal hybridization time.\nPMO-RNA hybridization temperature optimization.\nHybridize the GPPR-FET biosensors with 1 nM miRNA21 solutions at 4, 25, and 37°C.\nRecord the corresponding ΔVCNP and select the sensor with the largest response to determine the optimal temperature.\nPerformance evaluation of the GPPR-FET biosensor.\nSpecificity.\nUtilize a series of synthesized analyte oligonucleotides, including OM-, TM-mismatch, random sequences (miRNA10b), and miRNA21.\nInvestigate the response of the GPPR-FET sensor to these analytes.\nRecord and analyze the Dirac point shifts (-ΔVCNP) generated by the hybridization of PMO-RNA.\nDetermine the sensor’s ability to differentiate the target RNA from the mismatched RNA.\nSensitivity.\nSequentially deposit 10 μL of miRNA21 solutions with varying concentrations (ranging from 100 aM to 1 nM) onto the sensing channel of the GPPR-FET sensor, starting from low to high concentrations.\nIncubate the sensors at 37°C for 1 h to facilitate the base complementary pairing reaction between the analyte miRNA21 and the PMO probes.\nRecord the -ΔVCNP of the sensors.",
    "Note: We anticipate that the protocol steps will result in a gradual increase in the average -ΔVCNP values (11, 23, 37, 51, 65, 78, 88, and 104 mV, respectively) with increasing concentrations of the target miRNA21. This trend is due to the accumulation of miRNA21 on the sensing channel surface of the GPPR-FET sensor, resulting in the buildup of negative charges and subsequent N-type doping of graphene.\nStability.\nAdd 1×PBS solution dropwise onto the GPPR-FET biosensor surface and then incubate it for 2, 4, 6, and 12 h.\nRecord the ΔVCNP at each time point, and plot histograms in Origin software to visualize the data.\nTest the stability of the GPPR-FET biosensor over a prolonged period by placing it in a vacuum oven for 7 days and measuring the transfer characteristic curve daily.\nAnalyze the ΔVCNP of the GPPR-FET biosensor over time to assess its prolonged stability.\nNote: To evaluate the stability of the GPPR-FET biosensor, we conduct two experiments. First, we add 1×PBS solution dropwise onto the sensor chip and measure the resulting ΔVCNP after incubating for 2, 4, 6, and 12 h. We observe a minimal shift of less than 5% in the sensor's response. In the second experiment, we place the GPPR-FET sensors in a vacuum drying oven and monitor the ΔVCNP continuously for 7 days to assess long-term stability. We find that the Dirac point of the sensor undergoes few shifts, less than 12%, over the 7-day period. These results indicate the excellent stability of the GPPR-FET biosensor (Figure 4[href=https://www.wicell.org#fig4]).\nCreating a Work Curve Plot.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2932-Fig4.jpg\nFigure 4. Stability of the GPPR-FET sensor\nError bars represent the standard errors (n = 3).\n(A) Percentage shift in Dirac point of the GPPR-FET biosensor after incubation in 1×PBS for 2 h, 4 h, 6 h, and overnight.",
    "(B) Transfer curves of the GPPR-FET biosensor for 7 consecutive days.\n(C) Percentage shift in Dirac point of GPPR-FET biosensor for 7 consecutive days.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2932-Fig5.jpg\nFigure 5. Response of the GPPR-FET sensor to varying concentrations of miRNA21\nMeasure the Id-Vg curves of the GPPR-FET sensor at varying analyte miRNA21 concentrations.\nGenerate a plot of Id-Vg within the same coordinate axis using Origin software and observe changes in the Id-Vg curves at different miRNA21 concentrations.\nRecord the change in -ΔVCNP at different miRNA21 concentrations.\nUse Origin software to plot miRNA concentration on the X-axis and -ΔVCNP on the Y-axis to create a linearity curve of the GPPR-FET sensor.\nCalculate the correlation between -ΔVCNP and the logarithm of miRNA concentration.\nNote: The protocol observes a strong linear relationship between different concentrations of miRNA21 and -ΔVCNP, yielding a high correlation coefficient (R2) of 0.99 (Figure 5[href=https://www.wicell.org#fig5]). The regression equation (-ΔVCNP = 13.23 lgC + 222.64, where C represents the concentration of the analyte RNA. The graph depicts a dotted line denoting the 3-fold signal-to-noise ratio (10 mV). Utilizing the regression equation and the 3-fold signal-to-noise ratio, the protocol calculates the GPPR-FET biosensor detection limit for miRNA21 at 85 aM.\nExosomes isolation from cell-culture supernatant.\nCritical: To prepare for exosome isolation, pre-treat cells with serum-free or vesicle-free medium for 48 h beforehand. Use the cell culture supernatants (CCS) directly or store them at 2°C–8°C for up to 6 h. For long-term storage, freeze the CCS aliquots at −80°C. Thaw CCS samples gently by heating them in a 37°C water bath until fully thawed. Avoid prolonged incubation at 37°C to prevent RNA degradation.\nCell culture.\nCulture MCF-10A and MCF-7 cells separately under a humidified atmosphere of 5% CO2 at 37°C.",
    "Use DMEM supplemented with 10% (v/v) FBS, 1% (v/v) penicillin, and 100 μg/mL streptomycin for MCF-7 cells.\nUse MCF-10A cell culture medium (Procell) for MCF-10A cells.\nPre-treat both cells with a serum-free medium for 48 h before exosome isolation.\nExosome isolation.\nCCS collection: Wash the cells three times with ice-cold 1×PBS when they reach 70% confluence, then culture them in a serum-free medium for 48 h before collecting the CCS.\nStandard overspeed centrifugation: Centrifuge CCS samples at 300 g using the Beckman Coulter Allegra® X-15R centrifuge for 15 min to remove cell fragments. Then, centrifuge the supernatant at 2 000 g for 20 min to remove cell debris. Filter them with a 0.22 μm membrane. Subsequently, centrifuge the filtrates at 1 000 g for 30 min. Precipitate exosomes by centrifuging the supernatant at 110 000 g for 70 min. For purer exosomes, re-centrifuge (110 000 g, 70 min) after resuspension.10[href=https://www.wicell.org#bib10]\nExosome storage: Resuspend the purified exosome pellets in 400 μL 1×PBS solution and store them at −80°C.\nExosomes isolation from human plasma.\nCritical: Time sensitivity and laboratory biosafety are critical considerations for the study.\nTime sensitivity: To maintain sample quality and obtain accurate results, it is crucial to centrifuge whole blood samples within 1 h of reception to isolate the plasma exosomes.\nLaboratory biosafety: Strict adherence to universal precautions when handling blood samples is essential. This includes wearing appropriate personal protective equipment (masks, gloves, eye protection, and lab coats) to mitigate any potential risks.\nCentrifuge the whole blood sample at 300 g at 4°C for 20 min.\nRemove 1.5 mL of the plasma, which is the supernatant portion, and place it into a 2 mL Eppendorf tube with a patient ID label.\nImmediately subject the plasma samples to an exosome extraction process or freeze them at −80°C for future use.",
    "Use the exoRNeasy Serum/Plasma Midi Kit (Qiagen) protocol to extract the plasma exosomes.\nExosomes characterization.\nTEM.\nLoad 15 μL of the exosome suspension in a 400-mesh, carbon-coated copper grid and stabilize with 100 μL of 2% glutaraldehyde.\nStain the grid with 2% phosphotungstic acid for 10 min, then rinse twice with ice-cold 1×PBS.\nFlip the grid so the sample membrane side is facing down, and dry the opposite side for 2 min.\nDry the grids before storing them in an appropriate box for observation with the JEM-2100 TEM.\nNTA.\nDilute 20 μL of exosome suspension sample 100 times in ice-cold 1×PBS and pass through a 0.22 μM filter.\nLoad the sample into the LM10 unit chamber and capture three 30–60 s videos with a CMOS camera.\nUse NTA 1.1 and 2.1 software (Zeta view Ltd., Germany) to analyze the sample, and represent results as the average and standard deviation from video recordings.\nNote: We used control beads from Duke Scientific (Palo Alto, CA). The NTA analysis demonstrated accuracy within the range of 2 × 108 to 20 × 108/mL.\nWestern blotting.\nLysate exosome samples with protease inhibitors, denature them at 95°C for 10 min, quantify protein levels with a micro-BCA assay, and separate with SDS-PAGE.\nTransfer proteins to PVDF membranes, then incubate with primary antibodies (CD63, EpCAM, and TSG-101) for 8–12 h at 4°C.\nIncubate membranes with HRP-conjugated secondary antibody for 2 h at 25°C, then visualize protein bands with a GeneGnome XQR chemiluminescence imaging system.\nExosomal RNA extraction.\nAdhere strictly to Qiagen’s exoRNeasy Serum/Plasma Midi Kit protocol to ensure consistency and accuracy when extracting and purifying exosomal RNA from CCS and human plasma.\nSplit exosomal RNA into two aliquots for subsequent experiment.\nQuantify miRNA21 level in the first aliquot using reverse transcription-polymerase chain reaction (RT-PCR).",
    "In the second aliquot, analyze the same analyte wtih the GPPR-FET biosensor.\nExosomal miRNA21 quantification via RT-PCR.\nConvert approximately 2 μg of RNA into cDNA (reverse transcription product) using Super Script III reverse transcriptase (Invitrogen) following the manufacturer’s instructions. The resulting cDNA solution will be 20 μL.\nSet the reverse transcription program to run at 42°C for 60 min, followed by 95°C for 3 min. Dilute the cDNA 10-fold before using it as templates for PCR analysis.\nPrepare the amplification reaction by mixing 2 μL of each RT product with 10 μL of 2× miRNA Premix (SYBR&ROX) and 0.4 μL of designed forward and reverse primers. The total volume of the mixture will be 20 μL.\nSet the PCR reaction conditions to 95°C for 15 min, followed by 40 cycles of 94°C for 20 s and 60°C for 34 s. Record the melting curve.\nExosomal miRNA21 quantification via GPPR-FET biosensor.\nExtract and purify the total RNA from exosomes using exoRNeasy Serum/Plasma Midi Kit (Qiagen).\nAdd 10 μL of the total RNA sample dropwise onto the GPPR-FET sensor surface and incubate it at 37°C for 1 h to ensure complete binding of miRNA21 to the probes.\nThoroughly rinse the sensor chip with 1×PBS solution and pure water. Then blow-dry the sensor chip with nitrogen.\nAdd 0.01×PBS solution as a liquid-gate to test the Id-Vg plot of the sensor before and after incubation.\nCalculate the level of miRNA21 in the test sample by using the working curve drawn in step 11 and utilizing the value of ΔVCNP as the signal (Figure 6[href=https://www.wicell.org#fig6]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2932-Fig6.jpg\nFigure 6. An example of GPPR-FET sensor-based plasma exosomal miRNA21 testing in a breast cancer patient"
  ],
  "subjectAreas": [
    "Chemistry",
    "Biotechnology And Bioengineering",
    "Cancer"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}