{
  "id": 2529,
  "origin_website": "Cell",
  "title": "Detection of biomarkers for filoviral infection with a silicon photonic resonator platform",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nFunctionalization of sensor chip\nTiming: 3–4 h\nThis section describes the method to functionalize the silicon photonic microring sensor chips through silanization of the chip surface and use of a homo-bifunctional linker molecule to covalently attach the antibodies to the microring sensors. This step requires about 1–2 h of active work and two 1 h incubations.\nCapture Antibody Preparation. This should be completed prior to the following steps to mitigate time restraints later in the protocol.\nIn a 0.6 mL microcentrifuge tube, add 4 μL of 1× PBS, 1 μL of 50% glycerol and 5 μL of anti-EBOV antibody at 0.5 mg/mL.\nIn a second 0.6 mL microcentrifuge tube, add 4 μL of 1× PBS, 1 μL of 50% glycerol and 5 μL of anti-SUDV stored at 0.5 mg/mL.\nIn a third 0.6 mL microcentrifuge tube, add 25.7 μL of 1× PBS, 3 μL of 50% glycerol and 1.3 μL of Ms IgG control antibody stored at 5 mg/mL.\nThe final concentration of capture antibodies is 0.25 mg/mL in 5% glycerol.\nStore the diluted antibodies at 4°C until use. It is best to make fresh the day of spotting.\nSilanization of Sensor Chip.\nCollect five 20-mL scintillation vials and label them 1–5 (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2035-Fig1.jpg\nFigure 1. Sensor chip silanization diagram\nThe sensor chips should be moved through each vial after incubating on the orbital shaker for the specified amount of time (step 2). Created with BioRender.com[href=http://BioRender.com].\nFill with the following:\nVials #1, #2, and #4: 2 mL acetone.\nVial #3: 1.9 mL acetone.\nVial #5: 2 mL isopropanol.\nUsing clean tweezers, immerse up to six silicon photonic chips in scintillation vial #1. Secure vial onto orbital shaker and gently agitate for 2 min.",
    "Using tweezers, transfer the chips to Vial #2. Secure vial onto orbital shaker and gently agitate for 2 min.\nWhile chips are in Vial #2, prepare 5% 3-Aminopropyltriethoxysilane (APTES) solution.\nRemove APTES from desiccated storage area.\nUse a syringe fitted with a needle tip to remove 100 μL of APTES from the bottle.\nDispense APTES into scintillation vial #3 and recap vial.\nReturn APTES to desiccated storage.\nTransfer the chips to scintillation Vial #3. Secure vial onto orbital shaker and gently agitate for 4 min.\nTransfer the chips to scintillation Vial #4. Secure vial onto orbital shaker and gently agitate for 2 min.\nTransfer the chips to scintillation Vial #5. Secure vial onto orbital shaker and gently agitate for 2 min.\nWhile chips are in Vial #5, fill the top row (A) of 6 wells in the 24-well plate with deionized water (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2035-Fig2.jpg\nFigure 2. 24-well plate set up during sensor chip functionalization\nRow A contains DI water and houses the sensor chip after silanization (step 2j). The sensor chip moves to row B for BS3 application (step 2l) and to row C after removing the excess BS3 (step 2o). Finally, the sensor chip is housed in the humidity chamber created in row D after the capture antibody has been applied (step 3f). Created with BioRender.com[href=http://BioRender.com].\nTransfer the chips to the water filled wells, with one chip per well.\nRemove chips from water and place onto a DURX 670 cleanroom wipe.\nDry surface with N2 gas line while holding the chip securely with tweezers. Place the dried chips in the second row (B) of wells in the 24 well plate.\nPrepare the BS3 reagent to 5 mM by adding 700 μL acetic acid to a 2 mg no weigh format vial of BS3. Vortex to fully dissolve solid.",
    "The BS3 solution should be prepared fresh and added to the chip shortly after, as once prepared it is a limited active time (1 h) before hydrolysis of the NHS-ester moieties occur.\nImmediately pipette 20 μL of dissolved BS3 onto the sensor surface. Be sure to fully cover the microring sensor portion of the chip.\nIncubate for 3 min. Briefly dip chips into the water in the first row (A) of the 24 well plate to rinse off BS3 and dry with N2 gas. Place dried chips into third row (C) of 24-well plate.\nCut a strip of a DURX 670 cleanroom wipe that is the length and width of the last row (D) of the 24 well plate. Dampen the strip with water and press onto the lid of the 24-well plate over the bottom row. This will create a humidity chamber to house the spotted chips.\nAntibody Spotting.\nPrepare chip spotting station at microscope by collecting the prepared chips, the 0.25 mg/mL antibodies, tweezers, 2.5 μL pipette set from 0.2-0.4 μL, pipette tips, and sensor layout map to annotate (Figure 3[href=https://www.wicell.org#fig3]A).\nPlace the first chip under the microscope, adjust the settings to 25× magnification and adjust focus on the sensor chip.\nDeposit 0.2–0.4 μL of the first antibody over 2–5 ring clusters in each of the two channels of rings. The exact volume can vary, lower volumes will cover fewer clusters and higher volumes will cover more clusters.\nRepeat with the remaining antibodies moving across the chip.\nTake care to avoid any merging of drops of different antibodies, as this will result in cross reactivity. Troubleshooting problem 1[href=https://www.wicell.org#sec7.1].",
    "Using this hand spotting method, it is reasonable to deposit 2–4 antibodies in each channel, with each antibody spanning 2–4 clusters of microrings. For higher plexity, this spotting process would need to be completed through microspotting procedures. However, for this protocol, only three antibodies (anti-EBOV sGP, anti-SUDV sGP and anti-Ms IgG control) were needed in each channel. For this work, the spotting generally looked like Figures 3[href=https://www.wicell.org#fig3]B–3D.\nOnce all antibodies have been spotted, note down which clusters of rings are covered by each antibody. Label this as chip #1. Troubleshooting problem 2[href=https://www.wicell.org#sec7.3].\nCarefully transfer the completed chip to the final row (D) of the 24-well plate in the first position. Cover with well plate lid to create humidity chamber.\nRepeat steps b-f with remaining chips, placing the next chip in the subsequent spot in row D. It is important to know which spotting map layout corresponds to which chip.\nLeave chips at room temperature (18°C–22°C) in the humidity chamber for 1 h.\nPipette 1 mL of starting block into each of the wells. Incubate chips in the starting block at room temperature (18°C–22°C) under the humidity chamber for 1 h.\nRemove chips from the 24-well plate and place on the DURX 670 cleanroom wipe. Take care to keep them in the same order. Dry with N2 gas.\nPipette 20 μL of dry coat solution over the surface of each chip. Gently tap the sides of the chip with the tweezers to wick off excess dry coat onto the DURX 670 cleanroom wipe. There should remain a thin layer of dry coat over the chip to stabilize the antibodies.\nPlace the chips into a gel pack. Place gel pack in a desiccator in a 4°C refrigerator.",
    "Critical: Hold chips by the shorter sides to avoid damaging important chip features. Be gentle with the chips, do not drag the tweezers over the surface. Any chips or scratches can damage optical waveguides on the chip. If this occurs, discard the chip as it is no longer reliable to use.\nBS3 solution should be made as close to use as possible to avoid hydrolysis. In this procedure, it is recommended that there are no stopping points once silanization begins to avoid loss of chip functionality.\nNote: Before moving to calibration and analysis of the target in samples, it is important to validate that the antibody sandwich works on the assay platform. This includes optimizing the concentration of standard protein that elicits a saturated response and optimization of the biotinylated tracer antibody to ensure high response with minimal off-target binding. Additionally, the control rings should demonstrate minimal wavelength shift from addition of target antigen in comparison to a blank with no target present.\nPause point: Once the dry coat has been placed on the chip and they are stored, the chips will be stable for 1–6 months depending on antibody stability.\nOptional: This protocol has been optimized for the intended use with our specific instrumentation and experimental needs. However, there are varying options that could be explored for other applications, such as choice of silane, linker molecule, and concentration of capture reagent. Additionally, other biorecognition molecules, such as DNA, can be used in place of antibodies.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2035-Fig3.jpg\nFigure 3. Diagram of sensor array on microring chips\n(A) Blank template highlighting the 128 individual sensors in clusters of four and the two-channel arrangement.\n(B–D) Examples of appropriate spotting maps. Each of the capture antibodies in the tri-plex assay encompass at least two full chip clusters and none have merged.",
    "(E) Example of errors in chip spotting. In channel 1, the SUDV sGP antibody has merged with the control antibody. In channel 2, uneven spotting of ring clusters has occurred, with some clusters only have two of the four rings covered. This channel is still usable, as the unevenly spotted clusters can be ignored in the final data work-up, while keeping the fully spotted clusters for analysis.\nPreparing calibration standards and samples\nTiming: 30–60 min\nThis section sets up the reagents for the immunoassay, including how to construct calibration standards, how to prepare biological samples, and how to prepare the amplification assay reagents.\nSerial Dilutions for Calibration Standards.\nPrepare 3,600 μL of stock pooled healthy human serum at concentration of interest by adding PBS-BSA buffer and pooled healthy serum to a labeled 5 mL Eppendorf tube.\n1% serum: 36 μL serum + 3,594 μL PBS-BSA.\n10% serum: 360 μL serum + 3,240 μL PBS-BSA.\nInvert the Eppendorf tube five times to mix.\nPrepare eight 1.5 mL microcentrifuge tubes labeled 1–8.\nIn tube 2, add 300 μL of diluted serum made in step 4a. In tubes 3–8, add 480 μL of diluted serum.\nIn tube 1, add 16.8 μL each of thawed EBOV sGP standard and SUDV sGP standard (both standards stored at 100 μg/mL in −80°C), pooled healthy serum and PBS-BSA buffer. The amount of serum and buffer varies for each calibration, as follows, for a total of 700 μL with each protein at 2.4 μg/mL.\n1% serum: 7 μL healthy serum + 659.4 μL PBS-BSA.\n10% serum: 70 μL healthy serum + 596.4 μL PBS-BSA.",
    "Close tube 1 and invert five times to mix. Remove 300 μL from tube 1 by pipetting up and down three times in tube 1 and then dispense by pipetting up and down three times into tube 2. Change pipette tip.\nClose tube 2 and invert five times to mix. Remove 120 μL from tube 2 by pipetting up and down three times in tube 2 and then dispense by pipetting up and down three times into tube 3. Change pipette tip.\nRepeat step 4g with the next chronological tube until tube 7 is reached. Do not add protein standard into tube 8, as this will serve as the matrix blank. Steps 4c-h are summarized in Table 1[href=https://www.wicell.org#tbl1].\ntable:files/protocols_protocol_2035_4.csv\nSample Preparation.\nThaw the frozen sample to room temperature (18°C–22°C).\nIn a microcentrifuge tube, add PBS-BSA and thawed sample depending on which dilution is being prepared. In the corresponding study (Qavi et al., 2022[href=https://www.wicell.org#bib5]), each sample was prepared at 10× and 100× in a total volume of 350 μL. A minimum of 330 μL is required on the Maverick Matchbox instrument.\n100× dilution: 3.5 μL sample + 346.5 μL PBS-BSA buffer.\n10× dilution: 35 μL sample + 315 μL PBS-BSA buffer.\nPrepare Detection Reagents.\nIn a 5 mL Eppendorf tube, make a tracer antibody solution at 2 μg/mL by adding 2889.2 μL of PBS-BSA and 10.8 μL of the pan-EBOV/SUDV biotinylated tracer stored at 0.5 mg/mL. This is enough tracer for two channels on four chips, which is one full 8-point calibration, or four samples analyzed at two dilutions.\nClose the tube and invert five times to mix.",
    "In a 5 mL Eppendorf tube, make a streptavidin-horse radish peroxidase (SAHRP) solution at 3 μg /mL by adding 2891.3 μL of PBS-BSA and 8.7 μL of SAHRP stored at 1 mg/mL. This is enough SAHRP for two channels on four chips, which is one full 8-point calibration, or four samples analyzed at two dilutions.\nClose the tube and invert five times to mix.\nNote: Store all prepared reagents at 4°C until ready for use. Reagents (calibration standards, SAHRP, tracer) should be prepared the day of the experiment. The samples should be diluted and analyzed within 8 h of thawing. It is best to prepare smaller batches (enough for 2–4 chips at a time) to avoid any potential degradation or wasting of reagents.\nOptional: The concentration of standard protein to reach the saturating condition and the concentration of the biotinylated tracer antibody were previously optimized for our experimental parameters. When optimizing new targets, a range of 300–500 ng/mL for the protein standard and 2 μg/mL for the tracer are appropriate starting points. Adjustments can be made based on initial optimization experiments.\nRunning calibration standards and samples on microring instrument\nTiming: 10 min prep work, 40 min of assay run time per sample\nThis section explains how to plate the reagents prepared above for loading into the Genalyte Maverick Matchbox, as well as how to run the instrument interface.\nPreparation of Reagents in 96-Well Plate.\nCollect all reagents: PBS-BSA, calibration standards or diluted samples, diluted tracer antibody, diluted SAHRP, and 4-chloro-1-napthol (4CN).",
    "Fill a 96-well plate according to the diagram in Table 2[href=https://www.wicell.org#tbl2]. This plate layout corresponds to the reagent positions in the example instrument method in Table 3[href=https://www.wicell.org#tbl3]. With this configuration, the pumps draw liquid for channel 1 in the left well (columns 1 or 3) as it draws liquid for channel 2 in the right well (columns 2 or 4). It then moves from row A to row B and so forth.\ntable:files/protocols_protocol_2035_5.csv\ntable:files/protocols_protocol_2035_6.csv\nCalibrations were analyzed as follows:\nExperiment #1- channel 1: calibration tube 1, channel 2: calibration tube 8.\nExperiment #2- channel 1: calibration tube 7, channel 2: calibration tube 2.\nExperiment #3- channel 1: calibration tube 3, channel 2: calibration tube 6.\nExperiment #4- channel 1: calibration tube 5, channel 2: calibration tube 4.\nSamples were analyzed as follows:\nDay #1 of experiments- channel 1: 10× dilution, channel 2: 100× dilution.\nDay #2 of experiments- channel 1: 100× dilution, channel 2: 10× dilution.\nReturn reagents to 4°C until next assay set up.\nBring filled 96 well plate to instrument and slide into well-plate holder.\nPreparation of Microring Chip.\nRemove one of the spotted chips from the storage gel pack.\nRinse chip with deionized water and dry with compressed air.\nInsert the chip into the cartridge holder using the chip holder tool.\nUse tweezers to push the chip into cartridge to ensure snug fit. Blow compressed air into the channels to free any remaining debris or liquid.\nPut cartridge/chip into instrument with the tubes towards the front of the holder.\nPreparation of Instrument.\nOpen the instrument software interface.\nIn ‘Register & Batch Run’ tab, select recipe file (see Table 3[href=https://www.wicell.org#tbl3] for example recipe). The recipe file needs to be in .csv format.\nSelect data path (where data is to be stored after the experiment ends).\nEnter chip name/identifier.",
    "Click execute, close the door of the instrument as the chip registers.\nAfter registration, the pumps will engage, which starts the fluid flow across the chip. Once this happens, it is helpful to reopen the instrument and observe the liquid flowing through the cartridge across both channels. Close the door before the scan starts and avoid opening it until the end of the experiment. Troubleshooting problem 3[href=https://www.wicell.org#sec7.5].\nClean up area and prepare for next experiment.\nRemove next sample from the freezer and put with the other reagents in the 4°C to thaw slowly.\nThe microring chip, cartridge holder, and any other disposable materials that touched the serum should be discarded as biohazardous waste.\nRepeat steps 7–9 for all calibration standards and samples."
  ],
  "subjectAreas": [
    "Health Sciences",
    "Chemistry",
    "Biotechnology And Bioengineering",
    "Antibody"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}