{
  "id": 19364,
  "origin_website": "Jove",
  "title": "Application of Flow Cytometric Analysis for Measuring Multiple Mitochondrial Parameters in 3D Brain Organoids",
  "procedures": [
    "1. Differentiation of iPSCs into cortical organoids\nPreparation of matrix-coated plates\n\t\nThaw the vial of commercially available basement membrane matrix on ice overnight. Dilute into 1:100 in cold Advanced Dulbecco's Modified Eagle's Medium/Ham's F12 DMEM/F12 (1% final concentration). Make aliquots and store them at -20 °C (see Table of Materials).\nThaw the membrane matrix solution at 4 °C (keep it cold) and coat the required number of wells (1 mL for one well in a 6-well plate). Incubate at 37 °C for 1 h.\nTake the plate from the incubator and let it reach room temperature (RT) (leave it for an hour).\n\t\tNOTE: The plates can be stored for up to 2 weeks in the refrigerator (remember to take it out and warm the coated wells required for that day at RT until it is no longer cool to the touch before use). It is recommended to use the plates within 3 days. For long time storage, add 1 mL of Essential 8 Medium (see Table of Materials) to the coated plate to avoid the gel drying out.\n2. Preparation Essential 8 (E8) medium for iPSC culture\nIn a sterile environment, prepare E8 Medium by combining E8 basal medium with E8 supplement (see Table of Materials). This can be stored at 4 °C for 2 weeks.\n\tNOTE: Thaw frozen E8 supplement at 4 °C overnight before preparing the complete medium. Thawing the frozen supplement at 37 °C is not recommended; use E8 Medium for 2 weeks. Prior to use, warm E8 Medium required for that day at RT until it is no longer cool to the touch.\n3. Subculturing of iPSCs\nPre-warm matrix-coated plates in RT or incubator at 37 °C for 20-30 min. Pre-warm the amount of E8 Medium needed at RT.\nAspirate the culture medium with a pipette.",
    "Rinse iPSCs (see Table of Materials) with Dulbecco's Phosphate-Buffered Saline (Ca2+/Mg2+ free) (DPBS-/-) (4 mL for one well in a 6-well plate).\nAdd Ethylenediaminetetraacetic acid (EDTA) (0.5 mM) (1 mL for one well in a 6-well plate). Incubate at 37 °C until the edges of the colonies begin to detach from the plate (usually 3-5 min).\nAspirate the dissociation solution.\nAdd pre-warmed E8 Medium (4 mL for one well in a 6-well plate) and use high pressure to detach iPSC colonies.\nTransfer into two different wells in a matrix-coated 6-well plate (2 mL for one well in a 6-well plate) and incubate at 37 °C.\n\tNOTE: Gently shake before putting the plate into the incubator. The split ratio can be 1:2-1:4.\nExchange media daily till the colonies get 80% confluence with good size and connections.\n\tNOTE: Monitor for colonies of an appropriate size, typically characterized by a well-defined, circular shape and a diameter ranging from 0.5 to 1 mm. The colonies should exhibit dense, compact structures with clearly delineated, smooth borders.\n4. Embryoid body (EB) formation and neural induction\nPrepare neural induction medium (NIM) by combining the components listed in the Table of Materials.\nAspirate medium and rinse the cells with DPBS -/- (4 mL per well in a 6-well plate).\nAdd pre-warmed Accutase (1 mL per well in a 6-well plate) (see Table of Materials) in the well and incubate at 37 °C for 10 min.\nGently pipette the solution up and down 3 to 4 times using a 1000 µL pipette tip.\nNeutralize with 2 mL DMEM with 10% fetal bovine serum (FBS) and centrifuge the 15 mL conical tube containing the cells at 600 x g for 5 min at RT. Aspirate the supernatant.\nResuspend the cell pellets by gently pipetting up and down till single-cell pallets.",
    "Count and calculate live cell concentration using trypan blue14 in an automated cell counter.\nCalculate the dilution ratio and dilute cells in NIM to make final cell concentration of 60,000 live cells/mL.\nAdd Rho-associated protein kinase (ROCK) inhibitor Y-27632 (final concentration 50 µM) (see Table of Materials) to the cell suspension and gently mix.\nAdd 150 µL of single cell suspension into each well of ultra-low attachment 96-well plate (see Table of Materials) and place in the incubator. Set up as Day 0.\nOn day 1, check the cells and EB forms in each well.\n\tNOTE: Evaluate successful EB formation based on their bright, spherical, and translucent appearance under a microscope, their ability to remain free-floating and separate, and the absence of dead cells, which appear as dark spots.\nOn day 2, remove 75 µL medium from each well carefully and add 150 µL NIM along with 50 µM Y-27632 to each well.\nOn days 4, 6 and 8, remove 100 µL medium from each well and add 150 µL NIM to each well.\n5. Generation of cortical organoids\nPrepare neural differentiation medium minus vitamin A (NDM-) by combining the components listed in the Table of Materials.\nOn day 10, transfer EBs from the ultra-low attachment 96-well plate to the ultra-low attachment 6-well plate using a 5 mL pipette. Transfer eight EBs to each well cautiously (Figure 2). Add 5 mL NDM- to each well.\nPlace the plate on the orbital shaker inside the incubator and start spinning at 80 rpm.\nOn days 12, 14, and 16, replace the NDM- with 4 mL after aspirating 3 mL old medium.\n6. Maturation and long-term culture of cortical organoids\nPrepare neural differentiation medium with vitamin A (NDM+) and brain-derived neurotrophic factor (BDNF). For details, see Table of Materials.",
    "On day 18, remove the 3 mL medium and add 4 mL NDM+.\nReturn the plate to the spinning culture.\nFeed every 4 days and maintain the differentiated cortical organoids in NDM+ until use. 25-40-day-old cortical organoids were used for the downstream analysis.\n\tNOTE: The cortical organoids can be maintained longer (up to 3-4 months); but cell viability will be dropped due to the lack of nutrition exchange.\n7. Cell characterization by immunocytochemistry and immunofluorescence staining\nUse a 1000 µL pipette to gently collect the organoid from the medium and place it gently on a medium with minimal medium on a standard microscope slide.\nLet it dry completely at RT. Add 4% paraformaldehyde (PFA) (300 µL per sample) for 30 min. Remove PFA and then rinse twice with PBS.\n\tNOTE: PFA is toxic and suspected to be carcinogenic. Avoid contact with skin and eyes, and handle under a chemical fume hood.\nAdd 30% sucrose solution (300 µL per sample) to the slides and incubate overnight at 4 °C.\nBlock and permeabilize the organoids with blocking buffer (BB) (300 µL per sample) containing PBS (with Ca2+/Mg2+), 0.3% Triton X-100, and 10% normal goat serum for 2 h at RT (or overnight at 4 °C). Outline the organoids with a hydrophobic barrier pen to keep the buffer on the slide.\nOverlay samples with primary antibody in blocking buffer (300 µL per sample), anti-SRY (sex determining region Y)-box 2 (SOX2, 1:100), and anti-neural marker tuberin beta III (Tuj1, 1:1000), and incubate overnight at 4 °C in the dark (see Table of Materials).\nWash in PBS for 3 h with two to three buffer changes on a gentle rocking platform.",
    "Incubate with secondary antibody (300 µL per sample), anti-Alexa Flour 488 (1:800), and anti-Alexa Flour 594 (1:800), overnight at 4 °C in a humidified darkroom. Add Hoechst 33342 (1:5000) nuclear stain at the same time (see Table of Materials).\nAspirate the antibody and rinse quickly with PBS, then add PBS containing 0.01% NaAzide for 1-2 days at 4 °C to prevent contamination.\nAspirate the PBS and remove the excess solution. Mount the organoids with mounting medium (see Table of Materials), then add a coverslip. Avoid the formation of air bubbles and place in a dark room at RT for at least 12 h to allow the mounting to fully polymerize.\n\tNOTE: The sample is now ready to be imagined under a fluorescence microscope.\n8. Dissociation of cortical organoids\nAdd 30 mL DPBS -/- in a 50 mL centrifuge tube.\nGently collect the brain organoids in the tube using a 10 mL pipette. At least 3 organoids are used for one staining, and they should be more than 25 days but less than 40 days old.\nSediment organoids for approximately 5 min. Do not centrifuge.\nAspirate DPBS and add 2 mL pre-warmed Accutase in the tube. Incubate the sample in the water bath for 5 min at 37 °C.\nTriturate 15 times gently by using a 1000 µL pipette tip without generating bubbles. Incubate the sample for another 5 min at 37 °C in a water bath.\nDissociated gently by using 1000 µL pipette tips 15 times without generating bubbles (Figure 3A).\n\tNOTE: If there are still some undissociated cells, transfer the undissociated cells into a new 50 mL centrifuge tube and then incubate for another 5 min at 37 °C water bath. Then dissociate gently by using 1000 µL pipette tips 20 times.",
    "Neutralize with 4 mL DMEM with 10% FBS and centrifuge the 15 mL conical tube containing the cells at 600 x g for 5 min at RT.\nAspirate supernatant and resuspend with 200 µL DPBS using 1000 µL pipette tips 10 times without generating bubbles.\nAdd 200 µL DPBS to make a total volume of 400 µL cell suspensions in DPBS.\nFilter with the filter or filter tube (use 35 or 40 µm filters and rinse the filter with DPBS before using the filter).\nSeparate half of the solution in a tube and use it as unstained sample.\n9. Flow cytometry measurement of MRC complex subunits and TFAM in fixed cells\nAdd Live and Dead (L/D) staining dye (1: 1000) (see Table of Materials) (either with Far Red or Near-infrared, depending on the set-up for the markers for flow cytometry).\n\tNOTE: If a new vial for L/D dye is opened, add 50 µL DMSO to reconstitute and make a 10 µL aliquot to store them at -20 °C.\nKeep in RT and dark for 30 min. Add 40 mL DPBS -/-. Centrifuge at 600 x g for 5 min.\nResuspend into single-cell suspension after discarding the supernatant.\nFix and permeabilize the cells with 1 mL ice-cold 90% methanol at -20 °C for 20 min.\nBlock the samples in 1 mL block buffer containing 0.3 M glycine, 5% goat serum, and 1% bovine serum albumin (BSA) in PBS (with Ca2+/Mg2+).\nWash with 20 mL flow buffer containing PBS (with Ca2+/Mg2+) with 0.2% BSA once or twice.\nAdd the primary antibodies anti-NDUFB10 conjugated with Alexa Fluor 405 (1:100), anti-VDAC 1 conjugated with Alexa Fluor PE (1:100) and anti-TFAM antibody conjugated with Alexa Fluor 488 (1:200) for 30 min (see Table of Materials).\nWash with 20 mL flow buffer.",
    "Aspirate and leave approximately 100 µL and reconstitute the cell pellets into 300 µL flow buffer.\nTransfer the cells to 1.5 mL flow tubes. Keep in the dark and ice.\nAnalyze on the flow cytometer (see Table of Materials). Signals were detected for Anti NDUFB10-Alexa 405 using a 450/50 bandpass filter, TFAM-Alexa 488 using 530/30 bandpass filter, VDAC 1-Alexa 647 using 670/14 bandpass filter and L/D dye in 780/60 bandpass filter (Figure 3B).\n10. Flow cytometry acquisition and analysis\nUse unstained and single stained samples of the control organoid to set the voltage of cytometer settings.\nUse the unstained control tube to set the forward scatter area (FSC-A) and side scatter area (SSC-A) scatter plots based on the size and granularity of the cell population (Figure 4A).\nGate out debris to select live cells from FSC-A and SSC-A plots. Gate out doublets using side scatter height (SSC-H) vs. SSC-A plot (Figure 4B).\nSelect the live cells based on the staining of L/D dye by switching to APC-cy7 vs. FSC-A plot (Figure 4C).\nUsing the unstained samples of each line, draw a gate above the main population of the events in FSC-A vs. fluorochrome channels (FITC, APC, BV 421) plots.\nSet up compensates for the flow cytometer15.\nUse isotype control for negative control to observe background staining.\nPerform data acquisition.\n\t\nSelect the live cells based on the staining of L/D dye by switching to APC-cy7 vs. the FSC-A plot (Figure 4C).\nUtilize the unstained as negative control. Then, while examining the FSC-A vs. fluorochrome channels (FITC, APC, BV 421) plots, establish a gate above the main population of single-cell events (Figure 4D-F).\nPerform data analysis using FlowJo software (see Table of Materials).",
    "Duplicate the positions of the gates onto the stained cell samples. Document the number of cells that exhibit positive staining.\nFor each targeted population, assess the median fluorescence intensity (MFI) of different channels (FITC, APC, BV 421) plotted on the x-axis of a histogram to identify the mitochondrial signal. Specific values for the complex I subunit NDUFB10 and TFAM can be determined by dividing the MFI of the complex expression or TFAM by the mitochondrial mass indicator, VDAC 1.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}