{
  "id": 6348,
  "origin_website": "Bio",
  "title": "Production, Titration and Imaging of Zika Virus in Mammalian Cells",
  "procedures": [
    "IMPORTANT NOTE: All experiments with live viruses (i.e., all pre-fixation steps) should be performed inside a biosafety level 2 (BSL2) or a BSL2+ tissue culture laboratory according to the country and institution regulations and required permits regarding Zika virus handling and storage. Virus stock productionVirus preparationResuspend with 200 μl ultraPure sterile water the desiccated virus stocks by pipetting up and down, at room temperature in a BSL2 cell culture cabinet. Aliquot 50 μl of virus in sterile microtubes and store at -80 °C.Virus amplificationDay -1: Preparation of cells for infectionPrepare cells from 15 cm culture stock dishes of Vero E6 cells showing 80%-100% confluence. PBS, complete DMEM and trypsin-EDTA should be pre-warmed at 37 °C. It is worth mentioning that we never use Vero E6 cells “older” than 50 passages since this may affect cell permissiveness to ZIKV and yields of virus production. Remove the culture medium.Wash the cells with 10 ml PBS.Remove PBS and add 7 ml trypsin-EDTA.Incubate for 2 min at 37 °C in the CO2 incubator.Remove trypsin-EDTA. Thoroughly tap the cell culture dish in order to detach the cells. Resuspend the cells in 10 ml complete DMEM (see Recipes section for composition). Transfer the cells into a 15 ml sterile tube.Using a hemacytometer, determine the number of cells per ml. Seed 2 x 106 Vero E6 cells in 8 ml of complete DMEM in 10 cm cell culture dishes and incubate overnight in the 37 °C incubator. Day 0: InfectionIn a 15 ml sterile tube, dilute 50 μl of virus stock in 6 ml of complete DMEM.Remove by aspiration the medium of Vero E6 cells. Cells should show a confluence of approximately 70%-80%). Note: Gently add the virus dilution on the cells and slowly shake the cell culture dish.",
    "Especially for the first pilot experiments, we recommend including a control dish of uninfected cells (mock infection) that will be cultured in parallel (see important note below).Incubate for 2 h at 37 °C. After incubation, remove the virus inoculum. Add 8 ml of pre-warmed complete DMEM. Incubate for 3 days at 37 °C.  Days 3, 4, 5, 6 and 7 post-infection: virus harvestAt each day, harvest the supernatant with a sterile 20 ml syringe directly from the cell culture dish. Place an MCE 0.45 μm filter at the tip of the syringe.Filter the supernatant into a sterile 15 ml tube. Add 8 ml of complete DMEM in the cell culture dish and place it back into the incubator. Add 80 μl HEPES buffer 1 M, pH 7.2-7.5 (final concentration of 10 mM) in the filtered supernatant. This will prevent acidification of virus stocks following freeze/thawing and contribute maintaining optimal viral infectivity. Aliquot virus supernatants into sterile 1.5 ml microtubes (1 ml per tube). Store aliquots at -80 °C.Proceed with viral titration of each harvest using plaque assays. IMPORTANT NOTE: During viral amplification, ZIKV-induced cytopathic effects which lead to cell death can be observed and increase over time. This is generally a good indication that virus infection and production was successful. As a reference for healthy cells, the mock infection control dish may be observed in parallel.  Viral titration using plaque assaysDay -1: Preparation of cells for infectionNotes:Cells should be prepared from 15 cm dishes of Vero E6 with 80%-100% confluence.  One confluent 15-cm dish of cells is generally enough to prepare five 24-well plates corresponding to 10 samples to titer. PBS, trypsin-EDTA and culture media should be pre-warmed at 37 °C.  Remove by aspiration the medium from the culture dishes.Wash the cells with 10 ml of PBS.",
    "Remove PBS and add 7 ml trypsin-EDTA.Incubate for 2 min in the incubator. Remove the trypsin by aspiration. Thoroughly tap the cell culture dish in order to detach the cells.Resuspend the cell in 10 ml complete DMEM. Transfer the cells into a sterile 15 ml tube.Determine cell concentration with a hemacytometer.Dilute the cells with complete DMEM to a final concentration of 4 x 105 Vero E6 cells/ml.Seed 24-well plates with 500 μl diluted cells per well. One 24-well plate allows the titration of two virus samples. Incubate overnight at 37 °C. Day 0: InfectionNote: The day of infection, the cells should show a confluence of 90%-100%. Prepare 6 microtubes per sample to titer and identify them (10-1 to 10-6). Add 450 μl complete DMEM in each microtube. Dilute 10 times the sample in series: Add 50 μl of virus sample in the first microtube (dilution 10-1). Vortex the tube for 5 s. Change the tip to avoid any cross-contamination between samples. Pipet 50 μl of the 10-1 dilution and transfer into the second tube (dilution 10-2). Vortex the tube for 5 s. Repeat these steps for the other dilutions (10-3 to 10-6).Remove medium from rows A and B of one 24-well plate (Figure 1).Pipet up-and-down twice the 10-6 dilution and add 200 μl with the same tip on the side of the last wells of rows A and B according to the plate layout shown in Figure 1. Thus, infection is performed in duplicates. Proceed similarly with other sample dilutions (10-5 to 10-1 dilutions) according to the plate layout (Figure 1). IMPORTANT NOTE: It is critical to change used tips between each dilution to avoid cross-contamination between wells. Moreover, always start dispensing the samples into the plate starting with the most diluted samples.",
    "To avoid that cells dry, always wait to have processed one sample before aspirating the medium for another dilution series (e.g., rows C and D).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20181213/20181213195859_5713.jpgFigure 1. Serial dilution plan and plate layout for plaque assays. Schematic representation of the virus stock 10-fold dilutions and of 24-well plates used for plaque assays. Two samples per plate can be titered. Each dilution is assessed in biological duplicates.Once a 24-well plate has been entirely processed, put it back to the incubator and proceed with the next plate and two new samples to titer.Incubate all plates with gentle agitation at 37 °C for at least one hour using a 2D rocking platform shaker. Incubation period can be extended up to several hours without impacting titers.After this incubation, take the first plate and aspirate the supernatant of the row A and B starting by the 10-6 dilution to avoid cross-contamination.Add on the side of wells, starting from the highest dilutions, 1 ml of MEM-CMC (see Recipes) with a 10 ml pipette. Discard the pipette. It is important to change the pipette between each sample series to avoid contamination of the stock bottle of MEM-CMC with virus. Especially, contamination with fast-growing viruses may result in future experiments in the appearance of very large plaques in the wells which will render impossible to count smaller expected plaques. Repeat for rows C and D and then for all plates. Incubate for 5 days at 37 °C. IMPORTANT NOTE: Do not move the plates during the 5-day incubation since this will result in the formation of “comet-shaped” plaques which might render them difficult to count.Day 5 post-infection: Fixation and stainingAdd 1 ml 10% formaldehyde per well.Incubate for at least 2 h at room temperature in the BSL2 laboratory. Incubation period can be extended up to several days.",
    "Discard the liquid by inversion in a large beaker in a chemical hood. Formaldehyde-containing liquid wastes should be handled according to the chemical safety regulations of the research institution. Wash plates by vigorously rinsing them with tap water to remove all the methylcellulose. Remove the excess of water by taping the plates on an absorbent paper. Add 500 μl crystal violet-containing staining solution (see Recipes) on cell monolayers.Incubate for 15 min at room temperature. Incubation period can be extended up to several hours. Remove crystal violet solution by inversion in a reusable plastic container. Collected crystal violet solution can be transferred back to the stock bottle and be reused for future staining. Wash the plates extensively with tap water to remove the excess of staining solution. Dry the plates on absorbent paper to remove excess of water. Count the number of plaques in the appropriate dilution and determine infectious titers (see Figure 2 and Data analysis).Typical infection experiments for imagingDay -1: Preparation of cells for infectionUsing tweezers which have been cleaned with 70% ethanol, transfer sterile coverslips in each well of a 24-well culture dish.Seed Huh7 cells (or any cell line of interest to be tested): 20,000 cells in 500 µl complete DMEM. Vigorously shake the plate to homogenously disperse the cells throughout the well. Of note, we never use Huh7 cells “older” than 50 passages since we have noticed a significant change of morphology and growth properties beyond this passage.Incubate overnight at 37 °C with 5% CO2.Day 0: Viral infectionFor infection, appropriate multiplicity of infection (MOI) and virus dilution must be chosen according to stock infectious titers (see Procedure B and Data analysis). For immunofluorescence purposes, MOI of 1 is typically used. MOI of 1 means that on average, each target cell is inoculated with 1 infectious virus particle.",
    "In this case (20,000 cells) with an MOI of 1, 20,000 viruses must be diluted in a final volume of 500 µl DMEM in each well. Prepare a master mix for all the wells.Remove culture medium and add gently on the side of each well 500 µl of the ZIKV/DMEM master mix.Incubate for at least 2 h at 37 °C with 5% CO2 and gentle agitation.Remove virus inoculum and add 1 ml complete DMEM per well.Incubate for 48 or 72 h at 37 °C with 5% CO2.Day 2 or 3: FixationRemove media.Wash the cells twice with cold PBS.Add in each well 500 µl 4% paraformaldehyde/PBS solution.Incubate for 20 min at room temperature with gentle shaking.Wash once with 500 µl PBS and add 1 ml PBS. Seal the plate with parafilm to avoid that cells dry because of PBS evaporation. Store fixed cells at 4 °C protected from light with an aluminum foil. The cells can be stored at 4 °C for a few months if no staining is immediately planned.Immunofluorescence staining for confocal microscopy Remove PBS.Add 500 µl PBS/Triton X-100 permeabilization solution (see Recipes) and incubate for 15 min at room temperature with gentle shaking.Wash the cells once with PBS.During permeabilization, freshly prepare a premix of blocking solution (see Recipes). Plan 300 µl of blocking solution per coverslip to be labeled.Add 300 µl complete blocking solution per well.Incubate for 1 h at room temperature with gentle shaking.Quickly wash the cells three times with 500 µl PBS.Prepare the primary antibodiesDilute rabbit anti-ZIKV NS4B and mouse anti-dsRNA in PBS/5% BSA/0.05% sodium azide (i.e., blocking solution without normal goat serum) with dilution of 1/200 and 1/400, respectively. Plan 30 µl antibody solution per coverslip.",
    "Alternatively, antibodies against dengue virus NS4B and NS3 may also be used to detect ZIKV since there is a cross-reaction between these two flaviviruses for the antibody epitopes. Using panflaviviral antibodies against E protein is also an option to be considered (see antibody reference and dilutions in the Materials and Reagents).To avoid coverslips to dry and maintain a sufficient level of humidity, prepare an airtight container with wet pieces of paper at the bottom.On a plastic support inside the box, place a piece of parafilm cleaned with 70% ethanol.For each coverslip to label, add 30 µl of primary antibody as drops.With tweezers, remove the excess of liquid on a piece of absorbent paper and put each coverslip on the antibody drop, with the cells facing parafilm.Incubate for at least 2 h at room temperature, protected from light.Take back coverslips and transfer them in a sterile 24-well plate which contains 500 µl PBS per well. Cells must face the top of the plate.Wash the coverslips three times for 5 min with 500 µl PBS.During the last wash, prepare the secondary fluorescently labeled antibodies at a dilution of 1:1,000 in PBS/5% BSA/0.05% sodium azide. Plan 300 µl per coverslip.Cover the coverslips with 300 µl of the secondary antibody solution. Alternatively, in order to spare reagents, coverslips may be incubated on an antibody drop exactly as the primary antibody incubation.Incubate for 1 h at room temperature protected from light on a 2D rocking shaker.Quickly wash once and then, three times for at least 10 min with gentle agitation with 500 µl PBS.Dilute 10,000 fold the DAPI stock into PBS. Plan 500 µl per coverslip. Remove PBS from the plate and add 500 µl DAPI/PBS per well. Incubate for 10 min with gentle agitation at room temperature protected from light.",
    "Quickly wash three times each with 500 µl PBS.Wash once with 500 µl sterile water.Clean a microscope glass slide with 70% ethanol. Add a 5 µl drop of Fluoromount G per coverslip. Depending on the microscope used for imaging, each slide can accommodate 3-4 coverslips. Remove the excess of water on coverslip to-be-mounted by touching its side with a piece of absorbent paper. Place the coverslip on a Fluoromount G drop on the glass slide, with cells facing the drop.Keep slides protected from light at 4 °C overnight before imaging.Image the cells with a confocal or epifluorescence microscope in order to determine the % of infection, i.e., the % of NS4B- or dsRNA-positive cells."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Microbiology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}