{
  "id": 5246,
  "origin_website": "Bio",
  "title": "Isolation of Highly Pure Primary Mouse Alveolar Epithelial Type II Cells by Flow Cytometric Cell Sorting",
  "procedures": [
    "Note: Mice should be cared for and used in accordance with national and institutional policies. All protocols must be approved by the institutional animal committee. In our case, all procedures were approved by the Institutional Animal Care and Use Committee at the University of California San Francisco. Mouse dissectionSacrifice mice using an approved inhaled or injectable anesthetic overdose procedure. We sacrificed mice by i.p. injection of 1 ml of 2.5% avertin per mouse.Note: Both CO2 asphyxiation and cervical dislocation are incompatible for the purposes of this protocol. Unlike anesthetic overdose, CO2 asphyxiation stops the heart from beating which then reduces perfusion quality later in the protocol. Cervical dislocation destroys structures in the neck region which are required intact for this protocol.Pin mouse down onto dissecting tray. With the help of a suture loop (Figure 1A) around the front incisors, immobilize the head (Figure 1B). Spray the ventral surface with 70% ethanol.Note: Immobilizing the head helps with tracheal cannulation and dispase infusion steps later.Cut open the fur, then cut open the peritoneum along the midline. Cut through the rib cage along the midline (Figure 1C) except the top part, which houses large blood vessels. Note: Take care to avoid nicking large blood vessels, the lungs or heart. The success of the following steps depends on the integrity of the above structures. Hold the rib cage with forceps and snip away the diaphragm from the place it attaches to the rib cage (Figure 1D). Then cut up on two sides of the midline to remove the sternum and expose the heart and lungs (Figure 1E).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20161109/20161109195109_1055.jpgFigure 1. Mouse dissection steps. Immobilize the head of the mouse (A-B) and dissect the rib cage and diaphragm to expose lungs and heart (C-E).",
    "Cardiac perfusionNote: A video of cardiac perfusion has been provided for the user (Video 1).Snip the inferior vena cava (IVC) and aorta near the kidneys to exsanguinate the mouse. Note: Quickly proceed to perfusion as clots start to form as soon as the mouse starts bleeding, which drastically reduces the quality of perfusion.Take a D-PBS-filled 10 ml syringe attached to a 25 G x 5/8 inch needle and insert the needle into the right ventricle (Figure 2A), aiming in the direction of the pulmonary artery (Figure 2B). Gently push the plunger of the syringe to perfuse the lungs with 5 ml of D-PBS.Notes: You should see perfusate flowing out from the snip made in the IVC/aorta. With good perfusion, the lungs should turn white in color.Perfusion with plain D-PBS instead of D-PBS-EDTA is critical as EDTA inhibits dispase enzyme action downstream.You can hold the tip of the heart with forceps to prevent the needle from sliding out (Figure 2A).At the end of the perfusion, cut the heart away (Figure 2C).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20161109/20161109195308_9605.jpgFigure 2. Cardiac perfusion of the lungs via right ventricle. Snip the IVC and insert needle into the right ventricle (A) pointing in the direction of the pulmonary artery (B). Lungs after perfusion with 5 ml DPBS (heart removed) (C).    <p>imgsrc:https://bio-protocol.org/javascript:;</p>   Video 1. Cardiac perfusion of mouse lungs via the right ventricle  Tracheal cannulationFlip the dissection board such that the head of the mouse is closer to you.Note: This makes tracheal cannulation, dispase infusion and downstream manipulations much easier.Grab the two lobes of the salivary glands with fine forceps and gently pull them apart (Figures 3A and 3B).Note: The trachea lies just below the salivary glands.Expose the trachea by snipping the tissue covering it with fine-tipped small scissors.",
    "With the help of fine forceps, loop the trachea with surgical suture and make a loose knot (Figure 3C).With fine-tipped scissors, make a small nick on the ventral surface of the trachea.Note: The nick should be just big enough to pass the sheath of the 20 G angiocatheter, which serves well as a tracheal cannula (Figure 3D).Slide the sheath of the 20 G angiocatheter into the trachea and secure in place by tightening the suture knot around it (Figure 3E).Note: Do not slide the cannula too far down the trachea to avoid the cannula rupturing the airways at the point of bifurcation of the trachea into the two main extra-pulmonary bronchi or alternatively the cannula entering one of those bronchi, which will prevent all the lung lobes from being infused with dispase later on.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20161109/20161109195544_5708.jpgFigure 3. Tracheal cannulation. Tease apart salivary glands (A-B) and expose the trachea. Loop the trachea with suture (C), insert cannula and secure in place (D-E).Dispase and agarose infusionsFill a slip-tip 1 ml syringe to maximal capacity with dispase (see Recipes).Attach the syringe to the tracheal cannula and slowly inject the full volume of dispase in the syringe. Leave the syringe in place for ~45 sec to allow the dispase to distribute throughout the lungs without allowing it to spill back out (Figure 4A).Note: You should see all the lung lobes inflate. If that is not the case, see tip under tracheal cannulation above.Fill another 1 ml slip-tip syringe with 0.6 ml of lukewarm (i.e., 42-45 °C) 1% low-melt agarose (see Recipes).Remove the syringe with dispase and quickly attach the agarose-containing syringe to the catheter.Note: Switching of the syringes should be done rapidly to minimize back flow and leakage of dispase. Having a slip-tip, instead of a Luer-Lok tip syringe greatly helps with speed at this step.",
    "Inject the agarose gently into the lungs, leave the syringe in place and cover the lungs with crushed ice for 2 min to allow for the agarose to solidify (Figure 4B).Rationale: The agarose pushes the enzyme further into the alveolar spaces, effectively plugs the airways and prevents club cells from digesting off the airways and ultimately contaminating the ATII epithelial preparation.Loosen the suture knot and slide the syringe and cannula out.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20161109/20161109195731_6961.jpgFigure 4. Infusions of dispase followed by agarose. Inject dispase into lungs followed by agarose solution (A) and cover lungs with ice (B) for solidification of agarose.Dispase digestionCarefully dissect out the lungs from the thoracic cavity by grasping the trachea with forceps, then snipping down behind the lungs while gently pulling the lungs away. Avoid nicking the lungs.Rinse the lungs with D-PBS in a Petri dish till there is no more blood contaminating the outside surface of the lungs (Figure 5A). Dab away excess D-PBS with Kim wipes.Cut away individual lung lobes while excluding extra-pulmonary airways and other tissues (Figure 5B). Drop the lobes in a 50 ml conical tube containing 0.5 ml of dispase (Figure 5C).Note: Do not nick or chop the lung lobes. The lobes need to be kept intact for selective and efficient release of ATII cells. Chopping up will cause release of contaminating cell types from the airways. Incubate for 45 min at room temperature (RT) on a rocker at 150 rpm.Notes: Digestion should not be done at 37 °C as increased dispase activity at 37 °C release many more types and numbers of contaminating stromal cells from the lungs which is undesirable. At RT, the digestion preferentially releases ATII cells.Rocking helps with digestion but the exact speed of rocking is not critical.",
    "In winter months, if the laboratory temperature drops significantly lower than 25 °C, a forced-air incubator-shaker set to 25 °C can be used as an alternative as low temperatures lead to poor lung tissue digestion.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20161109/20161109195904_5163.jpgFigure 5. Dispase digestion. Rinse lung lobes in DPBS (A), snip away individual lobes leaving out airways (B) and transfer to 50 ml conical with more dispase for digestion (C).Preparation of single cell prepDecant digested lungs from the 50 ml conical into a 10 cm Petri dish (Figure 6A). Add 7 ml of complete DMEM and 10 μl of DNase (see Recipes). Note: Without DNase, the cells will be very sticky and clump together, which eventually lowers cell yield at the end.Gently tease the lung parenchyma away from the large airways using sharp tweezers. Avoid teasing near large airways (Figures 6B and 6C).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20161109/20161109200013_4840.jpgFigure 6. Preparation of crude lung single cell suspension. After 45 min digestion (A), gently tease lung parenchyma with fine forceps (B-D) to release more cells into suspension.Rock the Petri dish in a horizontal plane at 60 rpm for another 10 min at RT to allow more cell release.Note: Rocking helps with digestion but the exact speed of rocking is not critical.Use two fine forceps to keep the digested lung tissue in a compact mass and repeatedly move one pair of forceps down the tissue mass to release more cells (Figure 6D).Discard the airways and serially strain the lung crude single cell prep through a 70 μm, 40 μm and 20 μm* strainers.Notes: At the end of each straining step, rinse the Petri dish or 50 ml conical and strainer with 2 ml complete DMEM and pool with cell suspension to maximize cell recovery.",
    "*On the assembly of 20 μm strainers: To prepare your own 20 μm strainers (not available commercially), cut out the base from a 50 ml conical and also cut out a hole in the cap (Figure 7A) using a sharp blade and caution. Cut a square from the 20 μm nylon mesh sheet and cover the top of the cut 50 ml conical (Figure 7B). Screw the nylon mesh in place with the help of the cut cap (Figures 7C and 7D). To strain cells, place strainer cap side down on top of a fresh 50 ml conical. If the isolated cells will be cultured ex vivo, the 20 μm strainer can be sterilized prior to use with 120 Joules/meter2 dose of UV light delivered using a Stratalinker model 1800. Please note that the nylon mesh is not autoclavable.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20161109/20161109200210_9210.jpgFigure 7. Assembly of 20 μm strainer. Using a cut 50 ml conical (A) and a square piece of 20 μm nylon mesh (B), assemble the strainer (C-D).Count cells. At this step, the cell yield is ~25-35 million cells per mouse lung.Spin cells down at 300 x g, 10 min, 4 °C.Optional: If the pellet shows presence of RBCs, gently resuspend pellet in 5 μl DNase and 2 ml ACK lysis buffer. Place on ice for 2 min. Make up volume to 10 ml with complete DMEM and spin cells down at 300 x g, 10 min, 4 °C.Resuspend cell pellet in 5 μl DNase and 500 μl complete DMEM.Magnetic enrichment of ATII cellsStain with biotinylated antibodies against lineage (Lin) markers – add 5 μl of each of the following biotinylated antibodies to single cells (from one lung) suspended in 500 μl of complete DMEM and 5 μl of DNase: anti-CD45, anti-CD16/32, anti-CD31, anti-Ter119, anti-integrin β4.",
    "Rationale: The above antibody cocktail will mark hematopoietic cells (CD45 positive), alveolar macrophages (CD45 positive and CD16/32 positive), endothelial cells (CD31 positive), erythroid cells (Ter119 positive), club cells (integrin β4 positive) and distal lung progenitor cells (integrin β4 positive) for depletion.Note: The above antibody amounts are optimal when isolating ATII cells from naïve mice lungs. When isolating ATII cells from inflamed lungs with increased numbers of inflammatory cell infiltrates, the amounts of antibodies against lineage markers can be increased at this magnetic depletion step. The user should optimize this based on their mouse model and needs.Incubate for 45-60 min on ice with intermittent mixing by gentle flicking of the cells.While the cells are incubating with the antibodies, prepare the magnetic beads for use (2.5 µl SA MyOne T1 beads/1 x 106 cells). Wash the beads with 1 ml D-PBS twice to remove azide. Collect beads in the DynaMag-2 magnetic separator. At the end of the antibody incubation, wash the cells once in 10 ml complete DMEM (spin at 300 x g, 10 min, 4 °C) and resuspend in 500 μl complete DMEM and 5 μl DNase. Transfer cells to 1.5 ml tube with the appropriate number of washed beads. Incubate in the cold room for 30 min on a tube rotator to prevent the beads from settling to the bottom.Magnetic separation – Place the 1.5 ml tube with bead-bound cells in the magnetic separator for 2 min. Lineage positive cells will get stuck to the tube wall. Gently pipette out unattached cells and place into a fresh 1.5 ml tube. Place the fresh tube in the magnetic and repeat magnetic depletion for a total of 3 times.Cell sortingTransfer magnetically enriched ATII cells to a 5 ml FACS tube.Re-stain cells for lineage markers using biotinylated antibodies exactly as before.",
    "Wash cells as before with complete DMEM and resuspend in 500 μl complete DMEM and 5 μl of DNase.Add 1 μl of streptavidin-PE (to place all the lineage marker positive cells in the PE channel) and 5 μl of EpCAM-APC (to stain all epithelial cells). Incubate for 45-60 min on ice in the dark with intermittent mixing by gentle flicking of the cells. Wash cells with 10 ml sort buffer (see Recipes) once and resuspend at 5 x 106 cells/ml in sort buffer with DAPI (0.5 μg/ml) for FACS sorting. Strain cells through a 40 μm strainer to avoid any cell clumps that might clog the cell sorter.Set up the FACS Aria cell sorter for sorting using a 100 μm nozzle. Set up compensation using single color controls. Note: Please note that covering these aspects in detail is beyond the scope of this protocol. A new user can perhaps get help of a flow cytometry core operator for detailed instructions on cell sorting depending on the sorter available to the user.Sort FSChi SSChi, singlet, DAPI- live, Lin- EpCAM+ cells (Figure 8), which are ATII cells, into 15 ml tubes containing 5 ml of ice-cold complete DMEM. Typically, this protocol yields 2-3 x 106 highly pure (98-99%) and highly viable (97-98%) ATII cells per lung from a naïve mouse.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20161109/20161109200610_6155.jpgFigure 8. FACS sorting strategy for isolating highly pure murine ATII cells. Shown are representative flow cytometric plots of lung cells collected before and after magnetic enrichment, and after sorting. Displayed on the y-axis is staining for Lin markers (CD45, CD16/32, CD31, Ter119 and integrin β4) while the x-axis shows EpCAM staining. Events displayed on the plots are DAPI negative single cells. A gate around Lin- EpCAM+ cells, as shown above, is used to sort the cells."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}