{
  "id": 18585,
  "origin_website": "Jove",
  "title": "Triggering Reactive Gliosis In Vivo by a Forebrain Stab Injury",
  "procedures": [
    "Adult (3-4 months old) male mice on a mixed C57BL/6 background were used in this protocol. Animals were kept on a 12 hr light/dark cycle, and allowed free access to food and water. All procedures performed in this protocol were conducted according to protocols approved by the Drexel University Institutional Animal Care and Use Committee.\n1. Preparing Surgical Area\nDisinfect surgical table with 70% ethanol, then cover the entire surgical bench with absorbent pads and arrange surgical instruments adjacent to stereotaxic.\nSet up stereotaxic equipment without manipulator arm. Arrange the heating pad on the stereotaxic and set to 37 °C. Avoid overheating the animal by placing a small piece of paper towel or surgical pad between the animal and the heating pad.\nUsing autoclaved scissors, cut small pieces of autoclaved gelfoam into a sterile Petri dish containing 0.9% sterile saline solution until ready for use.\n\tNote: Maintain sterile working environment by using autoclaved instruments and sterile surgical supplies. Re-sterilize surgical instruments during the procedure or in between animals by dipping into a bead sterilizer for 10-15 sec, as needed. Maintain clean gloves throughout the procedure by rubbing hands with 70% ethanol, as needed, to disinfect.\n2. Prepping Mouse for Surgery\nRemove mouse from home cage and weigh (g).\nPlace mouse into isoflurane induction chamber and set oxygen to 2 L/min and isoflurane vaporizer to 5 to induce a surgical plane of anesthesia, about 3-5 min. Monitor for slowed breathing and immobilization. Check that the mouse is fully sedated using the toe pinch reflex.\nWhen mouse is fully sedated, place in stereotaxic frame, secure the nose in the nose cone, which is attached with tubing to the isoflurane. Insert ear bars into ear canal and tighten, ensuring the head is stable.",
    "Shave the head from ear to ear, and from between the eyes to behind the ears.\nSterilize the skin with alternating wipes of isopropyl alcohol and betadine iodine solution, 3 times each.\nApply artificial tears to both eyes to prevent them from drying out during the surgical procedure.\n3. Surgical Procedure\nMonitor the depth of anesthesia by pinching the toe or tail. The mouse is in the appropriate surgical plane when there is no response, and the respiration is slow and even.\nMake a parasagittal skin incision from just behind the eyes to almost between the ears in one single, firm motion using a No. 11 scalpel blade. Move skin aside and clip right side with hemostat.\nClear skull of overlying membrane using the dull side of the No. 11 scalpel and cotton tipped applicators. Optionally, wipe the skull with cotton tipped applicator dipped in 0.9% saline solution. Allow to dry completely.\nUsing a small ruler, mark the anterior border of the craniotomy at 1 mm caudal to the coronal suture, and the left edge of the craniotomy at 1 mm lateral to the sagittal suture (Figure 1), with a permanent marker. Then mark the right and caudal borders of the craniotomy at 4 mm from the sagittal and coronal sutures, respectively (Figure 1).\nUsing a 0.5 mm drill bit, begin to make craniotomy by drilling slowly following the permanent marker outline. Be sure not to break through the skull completely. Press gently on the isolated piece of parietal bone with No. 5 forceps, areas of weakness will give way to the pressure. When the thinned bone is sufficiently weak throughout the perimeter, the bone piece is ready for removal.",
    "NOTE: If the investigator experiences difficulty removing the bone in one piece, this suggests that bone was not sufficiently thinned during drilling. Consider drilling the skull further in subsequent animals to facilitate easy removal of the bone piece.\nUsing a 10 ml syringe fitted with a 23 G needle, apply a small amount of 0.9% saline to soak the isolated bone and drilled area.\nAttach the manipulator arm to the stereotaxic equipment. Attach a new No. 11 scalpel blade to the probe holder with the sharp side of the blade facing rostrally.\n\tNOTE: Although the rostral and caudal tissues experience the sharp and blunt edges of the blade, respectively, the mechanical damage induced by the penetrating injury is comparable throughout the extent of the lesion. We observe no appreciable differences in major features of reactive gliosis including upregulation of GFAP expression or proliferation, between rostral and caudal sections.\nKeeping the manipulator arm out of the way, carefully lift the isolated bone using 5/45 angled forceps. Insert the tip of the forceps into the side of the isolated bone and lift, using leverage to pull off the piece of bone left behind in one full movement.\n\tNOTE: Be careful not to stab the brain or disturb the dura underneath the skull.\nTake a small piece of the soaked absorbable gel foam and place on the uncovered brain to prevent it from drying out and soak up any blood that might be present.\nOnce the gel foam is in place, swing the manipulator arm into place and adjust blade to center of craniotomy over the gel foam. Remove the gel foam and lower the blade until the tip touches the dura without puncturing the dura. Mark dorsal/ventral coordinates using the vernier scale on the vertical arm of the stereotaxic.",
    "Using the manipulator arm, slowly lower the blade precisely 3 mm into the brain. This is achieved by using the vernier scale markings on the manipulator arm. Allow blade to stay in place for 5-10 sec. Move the stereotaxic arm with blade attachment rostral to caudal three times allowing the blade to reach the rostral and caudal boundaries of the craniotomy before moving to the opposite end.\n\tNOTE: The dura is not removed prior to inserting the blade. In contrast to the rat dura, which is ~80 μm in thickness7, the mouse dura is considerably thinner (only a few cell layers thick) and does not produce an appreciable resistance to the scalpel blade during insertion. Use a new scalpel blade for each mouse to ensure that each animal receives a consistent injury.\nSlowly raise the stereotaxic arm, removing the blade from the brain. After removal of the blade, immediately place another piece of gelfoam on the brain surface to soak up any excess blood or fluid.\nMeanwhile, remove the stereotaxic arm and dispose of the No. 11 scalpel blade. Once bleeding has stopped, remove the gelfoam.\nClose the wound by suturing the skin with non-absorbable suture, such as ethilon or prolene. Sutures should be removed 9-10 days following surgery.\nReturn the mouse to its home cage, and allow the mouse to recover slowly on a heating pad and monitor for any signs of distress. Recovery from isofluorane-induced anesthesia typically occurs within 2-5 min after removal from the isofluorane. Do not leave the animal unattended until it has regained sternal recumbancy.\nAdminister 0.5-1 ml of lactated Ringer’s solution subcutaneously to ensure hydration.\n4. Post-surgical Care\nClosely monitor animals post-operatively until recovery from anesthesia before returning to the colony.",
    "To reduce pain and discomfort post-operatively, administer 0.05-0.1 mg/kg buprenorphine by i.p. injection immediately following the procedure.\nObserve animals for 2-3 days post-operatively for severe signs of distress such as restricted movements, lack of grooming, or weight loss. Euthanize animals demonstrating any of these signs of distress and remove from the study.\nTo examine histopathology of injured tissues, euthanize animals by standard intracardial perfusion.\n\t\nBriefly, anesthetize animals with an overdose of ketamine/xylazine, then intracardially perfused with 15-20 ml of 0.9% NaCl, or until the liver is cleared of blood, followed by 60 ml of 4% paraformaldehyde at the conclusion of the experiment.\nDissect brains and post-fix for 2-4 hr in 4% paraformaldehyde before transferring to 30% sucrose solution. Section brains on a cryostat at 40-60 µm, and process by standard histological or immunohistochemical procedures, or as described in Garcia8,9.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}