{
  "id": 1771,
  "origin_website": "Cell",
  "title": "Isolation and in vitro cultivation of adrenal cells from mice",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPreparations before start\nTiming: 20–30 min\nPrepare four small petri dishes (60 × 15 mm) filled with PBS, place them on ice\nNote: Often more petri dishes are required during the procedure, especially when a larger number of mice are dissected and the PBS gets unclear. Therefore, it might be an advantage to prepare 1–2 additional dishes with PBS at the beginning.\nPrepare tools for dissection (see Figure 2[href=https://www.wicell.org#fig2]: forceps and scissors)\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1223-Fig2.jpg\nFigure 2. Tools for dissection\nPrepare digestion buffer and preheat to 37°C\nPrepare the culture medium and preheat it to 37°C\nNote: For one experiment, 20 mL of culture medium is usually adequate. For long-term cultures, fresh culture medium will have to be prepared once per week. bFGF should always be added just before use.\nCritical: Sterility is crucial; the entire hood and materials should be clean. Troubleshooting 3[href=https://www.wicell.org#sec6.5].\nCollecting adrenals\nTiming: ∼30 min\nIn this step, mice will be dissected and adrenals will be collected.\nNote: We usually isolate adrenal cells from 10 mice from both sexes at an age of approximately 8 weeks. However, adrenal cells can be isolated from mice of all ages though the dissection of the adrenal glands gets very difficult when the mice are younger than 3 weeks. Similar protocols have been published previously for isolation of rat and murine adrenal cells. These protocols do not contain procedures for spheroid cultures and subsequent differentiation, however, they contain videos that might improve the visualization of the separation into cortex and medulla (Chen and Huang, 2019[href=https://www.wicell.org#bib3]; Kolski-Andreaco et al., 2007[href=https://www.wicell.org#bib4]).\nSacrifice the mouse according to the regional animal welfare act or/and the animal experiment application.\nTo avoid contamination spray 80% ethanol on the fur of the mouse (abdomen).",
    "Open the abdominal wall by cutting in the middle (linea alba) from the bottom to the top (cranial) until the beginning of the diaphragm (Figure 3[href=https://www.wicell.org#fig3]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1223-Fig3.jpg\nFigure 3. Mouse dissection\n(A) Mouse after opening the abdominal wall. Scale bar, 1 cm.\n(B) Mouse after opening the peritoneum. Scale bar, 1 cm.\nMake a window by cutting at the top (cranial) and bottom (caudal) end of the previous cut both right and left.\nOpen the peritoneum in the same way as the abdominal wall before (Figure 3[href=https://www.wicell.org#fig3]B).\nTo dissect the right adrenal gland, put all the organs (intestine, liver) very carefully to the left with forcipes (Figure 4[href=https://www.wicell.org#fig4]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1223-Fig4.jpg\nFigure 4. Adrenal location\n(A) Right adrenal gland.\n(B) Left adrenal gland.\nCritical: Avoid dissection of other organs and vessels. If bleeding, it might be very difficult to find the adrenal. One possibility is then to flush with PBS.\nCarefully lift up the left part of the liver to make the right kidney and adrenal gland visible.\nDissect the adrenal by grabbing some fat around the gland with a curved forceps without squeezing the gland itself.\nCritical: If the mouse has a lot of fat (Figure 3[href=https://www.wicell.org#fig3]B) be careful not to dissect a vein or/and arteria since the vessels might be not visible.\nPlace the adrenal gland in a petri dish containing PBS on ice.\nTo dissect the left adrenal gland, put all organs very carefully to the right with forcipes (Figure 4[href=https://www.wicell.org#fig4]B).\nCarefully lift up the stomach and the spleen to make the left kidney and adrenal gland visible.\nDissect the adrenal by grabbing some fat around the gland with a curved forceps without squeezing the gland itself.\nPlace the adrenal in the petri dish with PBS already containing the right adrenal.",
    "Repeat the dissection with the remaining mice and pool all adrenals in one petri dish.\nTo get rid of potential impurities and blood, carefully transfer all adrenals to a new petri dish with PBS on ice using a curved forceps.\nFat removal and separation into cortical and medullary tissue\nTiming: 1–2 h\nNote: The timing depends on the number of adrenal glands. After some practice, fat can be removed in 1–2 min per adrenal. The same is the case for the manual separation into cortex and medulla. However, the first couple of times, it might take much longer.\nThe following steps should be performed using a stereomicroscope. Troubleshooting 1[href=https://www.wicell.org#sec6.1].\nRemove the fat surrounding the adrenal gland very carefully with two forcipes. The fat can be peeled off and discarded on a paper towel next to the petri dish (Figure 5[href=https://www.wicell.org#fig5]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1223-Fig5.jpg\nFigure 5. Fat removal and separation of cortex and medulla\n(A) Adrenal gland with fat. Scale bar, 0.5 mm.\n(B) Fat removed from adrenal. Scale bar, 0.5 mm.\n(C) Opened adrenal gland. Scale bar, 0.5 mm.\n(D) Medulla separated from cortex. Scale bar, 100 µm.\nNote: Some prefer to use scalpels instead of forcipes. However, in our experience, you have better control while using forceps.\nPut the cleaned adrenal glands into a new petri dish filled with PBS on ice. Continue with the remaining adrenal glands and collect them all in the same petri dish (Figure 5[href=https://www.wicell.org#fig5]B).\nCritical: Do not compress and damage the adrenal gland while holding it with the forceps.",
    "Place the petri dish with all cleaned adrenal glands under the stereomicroscope. Open one side of the adrenal gland and try to peel off the cortex little by little. The medulla will be visible but the PBS is getting unclear the more cortex is peeled off (Figure 5[href=https://www.wicell.org#fig5]C).\nNote: If the PBS gets too unclear, the remaining adrenal glands can be transferred to a new petri dish with PBS and then pooled again at a later point.\nUse the curved forceps and carefully transfer the medulla into a new petri dish filled with PBS (Figure 5[href=https://www.wicell.org#fig5]D). The cortical tissue pieces remain in the petri dish under the stereomicroscope. Continue with the remaining adrenal glands.\nCritical: As the medulla is very small, it is important to keep an eye on it the whole time. Otherwise, it might get difficult to distinguish it from the cortical tissue pieces.\nDigestion and cell separation\nTiming: ∼60 min\nTransfer the content of the petri dishes (cortex and medulla, respectively) to one 50 mL tube each. Use a 1000 μL pipette.\nNote: The tissue might stick on the inside of the pipette tip. Try to pipette up and down to get out the remaining tissue.\nCentrifuge for 5 min at 270 × g at room temperature (20°C–25°C).\nRemove and discard the PBS supernatant using a 1000 μL pipette.\nAdd 5 mL digestion buffer, prepared as described in the “materials[href=https://www.wicell.org#materials-and-equipment]” section, to the 50 mL tubes containing the cortex and the medulla, respectively.\nPlace for 20 min in a shaking water bath at 37°C.\nCritical: The medullary cells are more sensitive than the cortical cells. Therefore, it is very important not to digest these cells for more than 20 min. For the cortical cells, 30 min will also be ok. Troubleshooting 2[href=https://www.wicell.org#sec6.3].",
    "Take out the 50 mL tubes and resuspend the remaining tissue parts by pipetting up and down ∼50 times using a 1000 μL pipette.\nCentrifuge for 5 min at 270 × g at room temperature.\nWashing step:\nRemove and discard the supernatant from both 50 mL tubes.\nAdd 5 mL PBS to each 50 mL tube.\nCentrifuge for 5 min at 270 × g at room temperature.\nMedullary cells:\nRemove and discard supernatant.\nResuspend the cell pellet in 500 μL culture medium with bFGF.\nAdd the suspension to an Easy strainer 100 μm pore size.\nAdd another 500 μL to the strainer to get all cells through.\nCortical cells:\n2nd washing step: Remove and discard the supernatant.\nAdd 5 mL PBS to each 50 mL tube.\nCentrifuge for 5 min at 270 × g at room temperature.\nRemove and discard supernatant.\nResuspend the cell pellet in 500 μL culture medium with bFGF.\nAdd the suspension to an Easy strainer 100 μm pore size.\nAdd another 500 μL to the strainer to get all cells through.\nSeed each cell suspension in one well of an ultra-low attachment surface 24-well plate.\nCulture the cells 16–24 h in the incubator (37°C, 5% CO2).\nChange medium by transferring the cells to a 15 mL tube using a 1000 μL pipette and centrifuge the cells at 270 × g for 5 min, remove old medium and resuspend the cells in fresh cell culture medium containing bFGF. Transfer cells to a new well of the 24-well plate.",
    "Note: Depending on the initial amount of mice/adrenals that was pooled, it may be necessary to separate the cortical cells into 2–3 wells at the first medium change. In our experiments, we mostly use 10 mice and here we isolate enough cortical cells for 3 wells on a 24-well plate. Medullary cells are kept together in one well.\nCulture cells for up to 4 weeks in spheroid cultures (Figure 6[href=https://www.wicell.org#fig6]) by performing medium change every 3–4 days by carefully removing half of the medium and adding the same amount of new culture medium (in total 1 mL/well) containing bFGF.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1223-Fig6.jpg\nFigure 6. Proliferation and spheroid formation\n1–2 days after seeding of dissociated cells (from 10 mice) in 24-well low-attachment plates, cells start to aggregate. After 3–4 days, spheroids are created. Nestin-GFP labelled cells are shown in green. Scale bars, 200 µm.\nNote: During this time, different stimulations can be added.\nDifferentiation protocol\nTiming: 7–28 days\nIn case cells are going to be differentiated, culture conditions have to be changed to adherence and bFGF has to be omitted from the medium.\nCoat a 24-well plate or an 8-well chamber slide with poly-D-lysine 16–24 h (300 μL/well, 1 mg/mL poly-D-lysine in PBS) in the incubator at 37°C.\nOptional: For imaging, 8-well chamber slides from e.g. ibidi give the best results. Otherwise, (for collecting medium and/or RNA) normal 24 well plates can be used for differentiation.\nWash wells 3 times carefully with PBS\nAdd Fibronectin (300 μL/well, 0.6 nM in PBS) and incubate for 3 h at 37°C in the incubator.\nWash 3 times carefully with PBS\nTransfer spheroids to the coated 8-well chamber slides:\nCarefully transfer spheroids to an 1.5 mL tube using a 1000 μL pipette.\nCentrifuge for 5 min at 270 × g.",
    "Add 1 mL new culture medium without bFGF.\nDistribute spheroids to all chambers and fill up with medium (300 μL/well)\nAfter 3–4 h cells have attached and will start differentiating\nMedium should be changed 2 times per week by removing old medium and adding new. Then cells can be cultured for at least 28 days."
  ],
  "subjectAreas": [
    "Stem Cells",
    "Cell Isolation",
    "Microscopy",
    "Cell Culture",
    "Cell Biology",
    "Cell Differentiation"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}