{
  "id": 8269,
  "origin_website": "Bio",
  "title": "Immunoplaque Assay (Influenza Virus)",
  "procedures": [
    "Day 1    Each well on a 12-well plate is seeded with 5 x 105 MDCK cells suspended in 1 ml of cDMEM.   The plate is incubated in the 5% CO2 incubator at 37 °C overnight.       Day 2 (or until cells reach 95% - 100% confluence)    Viruses are serially diluted (10-fold) in RPMI, vortex each dilutions and keep on ice before use.    MDCK cells are rinsed with 1 ml of DPBS twice.   MDCK cells are inoculated with 500 μl of viruses prepared from step 3.   The plate is incubated in 5% CO2 incubator at 37 °C for 45 min.   Prepare SeaPlaque DMEM (pDMEM)   2x DMEM is warmed at 37 °C water bath and 2% SeqPlaque agarose is melted on a hot plate at about 45–50 °C with stirring (*The cap should be slightly released to prevent pressure buildup).   To obtain pDMEM, pre-warm 2x DMEM and 2% agarose are mixed in 1:1 ratio in a sterile container and sit at room temperature for 5–10 min to cool down.   TPCK-trypsin (final concentration: 1 μg/ml) is added to the pDMEM.     Viral inoculums are aspirated and MDCK cells are rinsed with 1 ml of DPBS once.    1.5 ml pDMEM + TPCK-trypsin from step 7-c is added to each well.   The plate is sat at room temperature (RT) for 10–15 min until pDMEM solidify.   The plate is incubated at 5% CO2 at 37 °C in the invert orientation (lid at the bottom) for 3 days.      Day 5 (or until visualization of plaque)    MDCK cells are fixed by adding 1.5 ml of 10% formalin directly on top of the agarose and incubated at RT for 2 h.   Extra formalin is aspirated and agarose from the well is removed and trashed carefully without disturbing the monolayer of cell using a laboratory spatula or equivalent tools.",
    "Note: Experiment can be stopped after this step by adding PBS to cover the cells and store at 4 °C.   MDCK cells are permeabilized by 300 μl of 0.5% Triton-X100 in DPBS for 5 min on bench without agitation.   Cells are rinsed with 1 ml of PBS twice.   Cells are blocked by 300 μl of 5% goat serum in DPBS for 30 min at RT with agitation on rocker.   Cells are incubated with H16-L10-4R5 antibody (1:40) in 300 μl of 5% goat serum for 1 h at RT with agitation on a rocker.   Cells are rinsed with 1 ml of PBS twice.   Cells are incubated with alkaline phosphatase conjugated donkey anti-mouse (1:1,000) in 300 μl of 5% goat serum for 45 min at RT with agitation on a rocker.   Cells are rinsed with 1 ml of PBS twice and AP reaction buffer once.   Prepare the BCIP/NBT solution.   Added 2 drops of solution A, B and C into every 5 ml of AP reaction buffer.   Mix by inverting the tube for 4–6 times.     300 μl of BCIP/NBT solution is added to each well. The plate is put on a rocker in dark for 30 min or until the development of color.    The reaction is stopped by rinsing the plate with ddH2O.    The plate is air-dried at RT.   Count the number of plaques, check the plaque morphology and measure the size of plaques.  Alternative visualization method by fluorescence, fluorescent focus assay (FFA)  (Continuous from step 18)   19.1   Cells are incubated with goat anti-mouse Alexa Fluor 488 antibody (1:1,000) in 300 μl of 5% goat serum for 45 min at RT in dark.   20.1 Cells are rinsed with 1 ml of PBS twice. 21.1 Cells are covered with 500 μl of DPBS and store at 4 °C.   22.",
    "1   Check the plaque morphology and measure the size of plaques using an inverted   fluorescence microscope (Figure 1). Note: The protocol is optimized for influenza viruses. Modifications may be required for use in other viruses. For instance, factors required for multiple rounds of replication of the virus should be added in the pDMEM.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20131031/20131031193708_3740.jpg Figure 1. Diameter of Individual Plaque of A/California/04/2009/H1N1 Recombinatant Viruses (rCA0409). A. Quantification of the diameter (μm) of 100 individual plaques of two different CA0409 viruses, wild type (WT) and HA-S328Y mutants (HA328Y). Images are taken by Axiovert 200 microscope using a 5x objective and diameters of each plaque are measured by IPlab3.6.5 software. Statistics are done by one-tail Student’s t-test. B. Representative image of plaques of CA0409 viruses stained with Alexa Fluor 488, scale bar = 200 μm. Images are taken by Sensicam using IPlab 3.6.5 (Data not published) (Tse et al., 2013)."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}