{
  "id": 7630,
  "origin_website": "Bio",
  "title": "Fluorescent Labeling of Small Extracellular Vesicles (EVs) Isolated from Conditioned Media",
  "procedures": [
    "The overall scheme for the EV purification and labeling with DiR dye is presented in Figure 1. imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4447/bioprotoc-12-12-4447-g001.jpgFigure 1. Experimental setup for the EV purification and labeling with DiR. A. The EV purification and labeling scheme. B. The EV is labeled with a DiR or a similar fluorogenic dye.Collection of the cell culture conditioned media Set the ultracentrifuge and benchtop refrigerated centrifuge to 4°C, approximately 30 min before collecting the supernatant. Prepare a bucket with ice before collecting the cell culture media (conditioned cell culture media; see Recipes for an example of media).Notes:  Use sterile reagents and proper aseptic technique at all steps to avoid contamination. Before loading the tubes, it is recommended to refrigerate the rotor and the tubes. Collect 15 mL of conditioned cell culture media at the desired time (such as 24 h). Add the protease inhibitor cocktail (PI) at 1% (v/v) to the conditioned media.Centrifuge media at 500 × g and 4°C for 10 min, to remove cells. Carefully decant supernatant to sterile centrifuge tubes—a 25 mL serological pipette can be used.Centrifuge supernatant at 4,000 × g and 4°C for 10 min. Carefully decant supernatant to new sterile centrifuge tubes.Centrifuge supernatant at 16,000 × g and 4°C for 30 min. Carefully decant supernatant to new sterile centrifuge tubes.Filter-sterilize the supernatant through a 0.22 µm PES filter into a new sterile centrifuge tube.DiR labeling Prepare DiIC18(7) (1,1'-Dioctadecyl-3,3,3',3'-Tetramethylindotricarbocyanine Iodide) (DiR) stock at 2.5 mg/mL (2.47 mM) in ethanol.Add the appropriate volume of DiR stock to the filtered supernatant from the steps above, to reach a 5 µM final concentration. Mix by pipetting.Incubate DiR with the filtered supernatant in the dark at room temperature (RT) for 30 min, with gentle inversion every 5 minutes.",
    "Purification of small EVs Sterilize items for ultracentrifugation by UV light exposure of buckets, centrifuge tubes, and forceps (for removing ultracentrifuge tubes from buckets/rotor) for at least 30 min.Fill the ultracentrifuge tubes to a volume of approximately 37 mL.Note: When there is not enough supernatant to fill a tube, fill the balance of the volume with sterile PBS. Ultracentrifuge tubes can collapse if not filled almost to capacity and if not correctly balanced. Weigh the buckets, writing down the weights so opposing buckets are balanced. Opposing buckets should be within 0.01 g of each other.In the BSL-2 cabinet or clean bench, so the tubes are not contaminated, add PBS to the lighter tubes in buckets as necessary to balance the centrifuge rotor.Transfer the rotor containing the samples into the ultracentrifuge, and centrifuge the supernatant at 100,000 × g and 4°C for 3 h.For the centrifuging step, decant and discard the supernatant carefully and in sterile conditions. Use a micropipette with a sterile tip to remove the liquid that forms at the tip of the tube but does not drop off.Note: Be careful not to contaminate the tube. In this step, free DiR goes away with the decanted supernatant, so the solution can be decanted, but always be careful not to lose the pellet. Add 400 µL (360 µL) PI to each tube, and resuspend the pellet by gentle pipetting up and down. Add about 36.5 mL (35 mL) of PBS to each tube.Weigh the buckets, and add PBS appropriately to balance the rotor to a precision of 0.01 g.Centrifuge at 100,000 × g and 4°C for 18 h. Very carefully, decant the supernatant, and remove the residual liquid at the lip with a pipetter.Resuspend the pellets with 100–150 µL PI (protease inhibitor cocktail) in PBS (see Recipes).",
    "Gently pipette the solution up and down. Use the tip to gently scrape around the bottom of the tube, to resuspend the vesicles. If desired, combine all samples into one microfuge tube.Wash DiR-labeled exosomes in Amicon Ultra 4 with 10,000 MWCO, to remove free DiR. Add the sample to Amicon Ultra, and bring the volume to 4 mL total volume, using PBS supplemented with 1% (v/v) PI (i.e., if 2 mL is needed to bring to 4 mL total, add 2 mL of PBS and 20 µL of PI).Centrifuge DiR-labeled exosomes in Amicon Ultra at 4,000 × g (in swinging bucket rotor, check × g limit if using a fixed angle rotor) at 4°C, in approximately 3-min intervals. Check the volume, and ensure the top chamber does not run dry because that is where the EVs are located. Reduce volume to about 250–400 µL. Discard the lower chamber filtrate and proceed to the next steps.Transfer the sample containing DiR labeled exosomes in the upper chamber to a fresh microfuge tube, by gently pipetting and using the tip to gather as much liquid from the chamber as possible. Some free DiR may be seen as an insoluble precipitate.To remove precipitated free DiR dye from DiR labeled exosomes, centrifuge the sample at 16,000 × g and 4°C for 20 min. Gently pipette the supernatant to a fresh microfuge tube.Note: The supernatant may appear only very light blue to bluish at this stage. Proceed to protein concentration determination using a micro BCA protein assay kit (Thermo Fisher). Use a nanoparticle characterization system (e.g., NanoSight LM10) to count the particles.Performing EV uptake experiments Prepare a 96-well plate of cells at 70% confluency the day before the cellular uptake experiment. The confluency required might depend on the cell type used.",
    "Determine EV concentration through nanoparticle tracking analysis, such as NanoSight, to prepare a standardized number of EVs for cellular uptake experiments.Prepare a 10-mL solution of 2e7 EVs (2e6/mL EVs) in serum-free OptiMEM containing appropriate antibiotics, for application to the cells.Remove media from cells growing on a 96-well plate, and wash twice with sterile 1× PBS.Add 100 µL of a prepared solution of 2e6/mL EVs in serum-free OptiMEM containing appropriate antibiotics to each well in a 96-well plate.As a control for the DiR-labeled exosomes, a 500-µL solution of 5 µM DiR in OptiMEM can be used, in addition to the labeled exosome samples.Cells can be imaged over 24 h using a Cytation5 instrument set to 5% CO2 and 37°C for every 2 h. See Figures 2 and 3, where L442 mouse-derived lymphocytes are used.After imaging of the live cell uptake has been completed, the cells can be fixed with 4% PFA (paraformaldehyde) at room temperature for 15 min, and stained with DAPI in the dark at room temperature for 10 min to count DAPI objects, and normalize EV count to 1,000 cells.Data and statistical analysis are performed using Microsoft Excel and GraphPad Prism.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4447/bioprotoc-12-12-4447-g002.jpgFigure 2. Experimental setup for the EV uptake experiment. imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4447/bioprotoc-12-12-4447-g003.jpgFigure 3. Quantifying the abundance of EVs in cells. (A) Labeled exosome abundance detected per 1,000 cells over 24-h, according to specific parameters in Cytation5. Three replicates of L442 mouse lymphocytes were prepared on a 96-well plate, and grown to 70% confluency prior to the addition of exosomes. A specific serum-free OptiMEM with antibiotics containing 2e6 labeled exosomes per mL was added to the cells. Cells were imaged under 10× magnification, with brightfield and the CY7 fluorescent filter, every 2 h up to the 16-h timepoint, then every 4 h up to 24 h after that.",
    "After the 24-h reading was complete, the cells were washed and fixed with 4% PFA, and stained with DAPI, to normalize the exosome count to 1,000 cells. The graph here shows the average exosome abundance across the three wells of L442 mouse lymphocytes (GraphPad Prism). (B) A representative image of fluorescent exosomes in L442 mouse lymphocytes at the 12-h time point. (C) A fully processed image of cellular uptake of exosomes with exosomes specifically detected in the Cytation5 software is highlighted by a yellow border. A 3 × 3 area of 10× magnified images was acquired, preprocessed, deconvoluted, and stitched for each well."
  ],
  "subjectAreas": [
    "Cell Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}