{
  "id": 17174,
  "origin_website": "Jove",
  "title": "Network Pharmacology Prediction and Metabolomics Validation of the Mechanism of Fructus Phyllanthi against Hyperlipidemia",
  "procedures": [
    "All procedures involving the handling of animals were conducted in accordance with the Chengdu University of Traditional Chinese Medicine Guide for the Care and Use of Laboratory Animals and were approved by the Institutional Ethics Committee of the Chengdu University of Traditional Chinese Medicine (Protocol number 2020-36). Male C57BL/6 mice (20 ± 2 g) were used for the present study. The mice were obtained from a commercial source (see Table of Materials).\n1. Network pharmacology-based prediction\nNOTE: The network pharmacology is used to predict the active ingredients and their key targets of FP against hyperlipidemia.\nSelection of active ingredients and key targets\n\t\nSearch the keyword \"Phyllanthi Fructus\" on the Traditional Chinese Medicine system's pharmacology database (TCMSP; http://tcmspw.com/tcmsp.php) to obtain the list of the candidate active ingredients and targets of FP.\n\t\tNOTE: Normally, only ingredients with oral bioavailability (OB) ≥30% and drug-like (DL) values ≥0.18 in the database are included as active ingredients.\nSearch the keyword \"hyperlipidemia\" in the GeneCards database (https://www.genecards.org/), the Online Mendelian Inheritance in Man database (OMIM; https://omim.org/), and the therapeutic target database (TTD; http://db.idrblab.net/ttd/) to obtain the respective candidate targets of hyperlipidemia. Download the spreadsheets of disease targets. Delete the repeated targets to obtain the hyperlipidemia targets list.\nCopy these lists from steps 1.1.1 and 1.1.2 into a new spreadsheet. Use the \"Data - Identify Duplicates\" function in the toolbar to get intersection targets. Import the intersection target list into UniProtKB (http://www.uniprot.org/) to standardize the gene and protein names.\n\t\tNOTE: These targets are related to both FP and hyperlipidemia. Therefore, predict these intersection targets as the targets of FP against hyperlipidemia.\nConstruction of a protein-protein interaction network",
    "Open the STRING database (https://string-db.org/) 11.5. Paste the intersection target list of FP against hyperlipidemia in the \"List of Names\" dialog box. Select Homo sapiens in \"Organisms\" and click on the SEARCH > CONTINUE.\n\t\tNOTE: Humans and mice have highly similar genes. Therefore, further experimental verification is carried out with mice.\nWhen the results are available, tick the hide disconnected nodes in the network in \"Advanced Settings\". Set the highest confidence (0.900) in \"minimum required interaction score\", then click on the UPDATE button.\nClick on Exports in the title bar, and download the short tabular text of the protein-protein interaction (PPI) network in PNG and TSV format.\nConstruction of a drug-component-disease-target network\n\t\nOpen Cytoscape 3.9.1 (see Table of Materials). Import the TSV format file of step 1.2.3. Optimize the color, font, and side of the network nodes through the style bar in the control panel.\nUse the \"Analyze Network\" function for network topology analysis. Obtain hub genes by CytoHubba in Cytoscape. Establish the drug-ingredient-target-disease network.\nGO and KEGG enrichment analysis\n\t\nOpen DAVID Bioinformatics Resources (https://david.ncifcrf.gov/home.jsp). Click on Start Analysis and paste the target list into the left dialog box. Select OFFICIAL GENE SYMBOL in \"Select Identifier\". Select Homo sapiens in \"Select species\". Tick Gene List in \"List Type\". Click on Submit List.\nWhen the results are available, click on Analyze above gene list with one of DAVID tools. Tick GOTERM_BP_DIRECT, GOTERM_CC_DIRECT, GOTERM_MF_DIRECT in \"Gene Ontology\" for GO function enrichment analysis. Tick KEGG_Pathway in \"Pathways\" for KEGG pathway enrichment analysis.\nClick on Functional Annotation Chart to display the results.\n\t\t​NOTE: Set the statistical significance threshold of the enrichment analysis at p < 0.05.\n2. Experimental design\nThe FP aqueous extract preparation\n\tNOTE: FP is processed in the laboratory of Professor Lina Xia at the Chengdu University of TCM8.",
    "Soak the dried powder of FP (90 g) in 1 L of pure water in a clean 2 L volumetric flask. Use ultrasonic treatment (in a 4 °C water bath, power: 250W, frequency: 35 kHz) to help dissolve for 30 min. Filter the solution to obtain the extract with a double-layer, 1 mm x 1 mm sterile medical gauze. Repeat the above operation three times to ensure the complete dissolution of FP.\nUse the rotary evaporation method for further concentration. Set the rotation speed to 50 rpm with a temperature of 60 °C for 4 h. Concentrate the aqueous extract to 100 mL.\nDivide the crude extract of FP (0.9 g/mL) evenly into two parts (50 mL). One part is used as the high-dose FP liquid (0.9 g/mL). Add 50 mL of pure water into another part, and consider it as the low-dose FP liquid (0.45 g/mL). Use the high- and low-dose FP aqueous solutions for administration. Store the liquid at -20 °C until use.\nAnimal preparation\n\t\nHouse 50 male C57BL/6 mice (20 ± 2 g) in a well-ventilated room at room temperature, with a 12 h light-dark cycle and free access to food and pure water.\nRandomly assign the mice to two groups: feed 10 mice with a normal diet and 40 mice with a high-fat diet (see Table of Materials) to induce hyperlipidemia.\n\t\tNOTE: After feeding for 8 weeks, the mice were screened for further drug intervention.\nIn the 8th week, withdraw about 200 µL of blood from each mouse orbit. Centrifuge the blood for 10 min at 5,733 x g at 4 °C to obtain plasma samples. Determine the TC and TG levels with commercially available assay kits (see Table of Materials).",
    "Select six mice with the most normal lipid levels as the no-treatment control (NC) group. Select 24 mice with a significantly higher lipid level as the high-fat diet group, and randomly divide them into four groups: high-fat diet (HFD) group, low-dose FP (FP_L) group, high-dose FP (FP_H) group, and positive control (PC) group.\nAdminister gastric irrigation to the FP_L and FP_H groups with two dosages of FP (low dose, 4.5 g/kg and high dose, 9 g/kg), respectively; gastric irrigation to the PC group with simvastatin tablets (5 mg/kg; see Table of Materials); and gastric irrigation to the NC and HFD groups with the same volume of physiological saline once a day for 4 weeks.\n\t\tNOTE: The current study used the aqueous solutions of FP and simvastatin for treatment.\nIn the 12th week, after anesthesia by 1% pentobarbital sodium (30 mg/kg), sacrifice the mice of all the groups. Collect ~400 µL blood samples from each mouse's orbital vein.\n\t\tNOTE: Stimulate the toes and soles of the mice with tweezers. If there is no reaction, it proves adequate anesthesia.\nCentrifuge the blood for 10 min at 5,733 x g at 4 °C to obtain plasma samples, and determine the TC, TG, LDL-C, and HDL-C levels with commercially available assay kits (see Table of Materials). Obtain liver tissue samples16 and subject them to histopathological analysis. Use the remaining plasma and liver samples for metabolomics analysis (step 3).\n\t\tNOTE: All samples are stored at -80 °C until use.\nLiver histopathological examination\n\t\nFix fresh liver tissues with 4% paraformaldehyde solution for more than 24 h. Take out the tissue from the fixative and smooth the target tissues with a scalpel. Place the tissue and the corresponding label into the dehydrator.",
    "Dehydrate in an ethanol gradient: 75% alcohol for 4 h, 85% alcohol for 2 h, 90% alcohol for 2 h, 95% alcohol for 1 h, absolute ethanol for 1 h, xylene for 30 min. Place the tissue cassette in a tissue mold in paraffin wax for three washes, 30 min each16.\nPut the wax-soaked tissues into the tissue embedder (see Table of Materials). Before the wax solidifies, remove the tissues from the dehydrator, put them into the embedded box, and attach the corresponding label.\nCool the wax blocks in a -20 °C freezing table, remove them from the embedded frame, and trim the wax block.\nCut the trimmed wax blocks into 3 µm thick sections using a microtome (see Table of Materials). Float the sections in 40 °C water, remove them from the slides, and bake in a 60 °C oven. After baking with water and dry wax, take it out and keep it at room temperature.\nSuccessively place the sections in xylene I for 10 min, xylene II for 10 min, xylene III for 10 min, absolute ethanol I for 5 min, absolute ethanol II for 5 min, 75% alcohol for 5 min, and wash in water16.\nStain the sections with hematoxylin staining solution for 4 min, 1% hydrochloric acid alcohol solution (75% alcohol) for differentiation, 1% ammonia water solution back blue, and wash them with water.\nStain the sections with eosin staining solution for 2 min and wash them with water.\nObserve the sections using an optical microscope with a magnification of 200x and 400x.\nLiquid chromatography-mass spectrometry )LC-MS) analysis\n\t\nIngredient identification of FP\n\t\tNOTE: The analysis is performed using ultra-high-performance liquid chromatography coupled with hybrid quadrupole-orbitrap high-resolution mass spectrometry (UPLC-Q-Orbirap HRMS, LC-MS; see Table of Materials).",
    "Precisely measure 1 g of dried powder of FP and put it into a clean 50 mL volumetric flask.\nAdd 25 mL of 70% methanol into the volumetric flask and accurately weigh. Use ultrasonic treatment (in a 4 °C water bath, power: 250 W, frequency: 35 kHz) for 30 min to help dissolution. Accurately weigh again to precisely determine the loss after dissolution, and use 70% methanol to make up the loss.\n\t\t\tNOTE: Don't measure the volume, as the scale of the volumetric flask is not accurate, especially after the 4 °C water bath.\nShake up to mix fully. Use a 0.22 µm microporous membrane to filter.\nPlasma sample preparation\n\t\t\nPrecisely add 100 µL of plasma (step 2.2.7) into a double volume (200 µL) of acetonitrile in a 1.5 mL centrifuge tube, and vortex it with a vortex vibrator for at least 30 s. Follow this procedure for all samples.\nCentrifuge all samples at 17,200 x g for 10 min at 4 °C. Transfer the supernatants after centrifugation into a new 1.5 mL centrifuge tube. Dry the supernatants under nitrogen. Reconstitute with 200 µL of extraction solvent (acetonitrile:water = 4:1 [v/v]).\nVortex the reconstituted solution for at least 30 s and use ultrasonic treatment for 10 min (in a 4 °C water bath, power: 250 W, frequency: 35 kHz). Centrifuge at 17,200 x g for 10 min at 4 °C.\nFilter the supernatants with 0.22 µm filter membranes and keep them at 4 °C for analysis.\nLiver sample preparation\n\t\t\nHomogenize 90 mg of liver tissue (step 2.2.7) for 1 min in ice-cold methanol-water (1:1, v/v, 1 mL) and centrifuge them at 21,500 x g for 10 min at 4 °C. Transfer the supernatant into 1.5 mL centrifuge tubes. Follow this procedure for all samples.",
    "Extract the precipitates again following the same procedure, and pool the supernatants together into new 1.5 mL centrifuge tubes. Dry the supernatants under nitrogen. Reconstitute with 300 µL of the extraction solvent (methanol:water = 4:1 [v/v]).\nVortex the reconstituted solution for at least 30 s and use ultrasonic treatment for 10 min (in a 4 °C water bath, power: 250 W, frequency: 35 kHz). Centrifuge at 17,200 x g for 15 min at 4 °C.\nFilter the supernatants with 0.22 µm filter membranes and keep them at 4 °C for analysis.\n\t\t\tNOTE: The pooled quality control (QC) samples were prepared by mixing 10 µL aliquots from each plasma and liver sample (one per six samples).\nAnalysis parameters of LC-MS\n\t\tNOTE: The mobile phase consists of 0.1% formic acid (solvent A) and acetonitrile (solvent B). Transfer these solvents to a clean glass bottle and connect them with the LC-MS system.\n\t\t\nSet the gradient programs of plasma samples in the \"inlet file\" of the LC-MS system as follows: 1% B (0-1.5 min), 1%-60% B (1.5-13.0 min), 60%-99% B (13.0-20.0 min), maintain at 99% B (20.0-25.0 min), 99%-1% B (25.0-25.1 min), and maintain at 1% B until 27 min.\nSet the autosampler conditions of the plasma samples in the \"inlet file\" of the LC-MS system as follows: the volume of injection, 2 µL; and the flow rate, 0.3 mL/min, for each analysis.\nSet the gradient program of liver samples in the \"inlet file\" of the LC-MS system as follows: 1% B (0-1 min), 1%-53% B (1-15 min), 53%-70% B (15-30 min), 70%-90% B (30-32 min), 90%-95% B (32-40 min), 95%-1% B (40-42 min), and maintain at 1% B until 45 min.",
    "Set the autosampler conditions of the liver samples in the \"inlet file\" of the LC-MS system as follows: volume of injection, 5 µL; and the flow rate, 0.3 mL/min, for each analysis.\nSet the MS detection conditions of both the plasma and liver samples in the \"MS tune file\" of the LC-MS system. Perform the MS acquisition using both positive and negative ionization modes.\n\t\t\t​NOTE: The heated electrospray ionization parameters are as follows: spray voltage: 3.5 kV for positive ionization and 3.8 kV for negative ionization; sheath gas flow: 55 arb; auxiliary gas flow: 15 arb; probe heater temperature: 300 °C; and capillary temperature: 350 °C.\nImport the collected raw data into Compound Discoverer software, and set the method template following the manufacturer's instructions (see Table of Materials).\n3. Metabolomic validation\nNOTE: The metabolomic profiling data of plasma and liver metabolites are imported into Compound Discoverer software to perform the metabolic feature extraction by adopting a molecular feature extraction algorithm. Set the parameters as follows: mass deviation, 5 x 10-6; mass range, 100-1,500; signal to noise ratio (SNR) threshold, 3; and retention time deviation, 0.05. Evaluate the stability and repeatability of metabolomics by the relative standard deviation (RSD) of QC peak areas.\nUse SIMCA-P software (see Table of Materials) for multivariate statistical analysis of the integral values obtained from LC-MS findings. Use orthogonal partial least squares discriminant analysis (OPLS-DA) for the mean-centered data and the modeling of sample classes.\nAfter the OPLS-DA test, consider the metabolites, with integral with variable importance in the projection (VIP) values of >1 and a p-value of <0.05 from Student's t-test as the potential differential metabolites.\nIdentify the disturbed metabolites and metabolic pathways by open database sources, including Human Metabolome (HMDB; http://www.hmdb.ca/), Kyoto Encyclopedia of Genes and Genomes (KEGG; https://www.kegg.jp/), and MetaboAnalyst5.0 (https://www.metaboanalyst.ca/).",
    "Visualize the result views by MetaboAnalyst5.0 and the 'Wu Kong' platform (https://www.omicsolution.com/wkomics/main/).\n4. Molecular docking\nDownload the 3D structure of the selected FP ingredients from the TCMSP database, respectively. Search the ingredient names in the 'Chemical name' search box and download the corresponding 3D structure files in mol2 format.\nDownload the crystal structures of the key targets from the AlphaFold Protein Structure Database (Alphafold DB;, https://alphafold.ebi.ac.uk/). Search the target names in the search box and download the corresponding crystal structures files in pdb format.\nImport ingredients and target structures file into AutoDockTools software. Click on Edit > Delete Water to delete water molecules. Click on Edit > Hydrogens > Add to add hydrogens. Set the ingredients as the 'ligand' and perform blind docking by selecting the whole targets as the 'receptor'17.\nEnter a value in the box behind \"center\" and \"size\" to adjust the newly-developed space, making it possible to fully encompass the ligand and the receptor. Save the ligand and receptor files in pdbqt format.\nUse AutoDock Vina to perform molecular docking. Set the \"Receptor\" bar to the name of the 'receptor.pdbqt', and the \"Ligand\" bar to the name of the 'ligand.pdbqt'. Obtain the optimal location for ligand binding to the receptor. Record the binding energy value at the optimal position.\n\tNOTE: The docking process was calculated by the Genetic Algorithm14. All docking run options were default values. Docking frames will be automatically ranked from the highest to the lowest binding energy.\nImport the docking files into PILP (Protein-ligand Interaction Profiler' https://plip-tool.biotec.tu-dresden.de/plip-web/plip/index) to get the visual system model. Download the model files in pse format, and import them into PyMOL software (see Table of Materials) to construct further visualization.\n5. Statistical analysis",
    "NOTE: Use SPSS statistical software (see Table of Materials) for data analysis. Consider the value of p < 0.05 as statistically significant.\nExpresse the values as means ± standard deviation (SD).\nPerform a one-way ANOVA followed by post hoc least significant difference (LSD), Dunnett (in case of equal variance), or Dunnett's T3 (in case of unequal variance) to test statistical significance among groups.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}