{
  "id": 11780,
  "origin_website": "Jove",
  "title": "Tracking Bispecific Antibody-Induced T Cell Trafficking Using Luciferase-Transduced Human T Cells",
  "procedures": [
    "The following procedures have been evaluated and approved by Memorial Sloan Kettering's Institutional Animal Care and Use Committee.\n1. Transfection of 293T cells with luciferase and harvest of viral supernatant\nCulture of 293T cells\n\t\nPrepare media by adding the following to a liter of DMEM each: 110 mL of heat-inactivated fetal bovine serum (FBS), 11 mL of penicillin-streptomycin.\nThaw 5 x 106 293T cells and transfer them into a T175 flask with the media prepared as described above.\nSplit the 293T cells 1:10 every 3 days for 6 days. Do not allow the cells to become more than 90% confluent.\nTransfection of 293T cells\n\tNOTE: The following quantities of reagents are calculated for transfecting one T175 flask of 293T cells. Adjust accordingly if more flasks are to be transduced.\n\t\nTransfer 1.5 mL of media to each of the two 50 mL tubes using a pipette. To one tube, add 10 µg of VSV-G plasmid, 20 µg of Gag/pol, and 20 µg of click beetle red TD tomato (CBR-TDR) luciferase plasmid and mix. To the other tube, add 100 µL of DNA in vitro transfection reagent and mix. Incubate both tubes at room temperature (RT) for 5 min.\n\t\tNOTE: All plasmids described in this manuscript were provided by Dr. Vladimir Ponomarev.\nTransfer the media containing the DNA in vitro transfection reagent dropwise to the tube containing the DNA plasmids (over approximately 30 s) and mix gently with a pipette. Incubate at RT for 20 min.\nDuring this 20 min incubation, detach the 293T cells by adding 5-10 mL of 0.05% trypsin. Once the cells have detached, add 10 mL of media and centrifuge at 800 x g for 5 min. Resuspend the cells in 1.5 mL of media.",
    "Add the media containing the DNA in vitro transfection reagent and the DNA plasmids to the 293T cells and incubate at 37 °C for 30 min.\nTransfer to a T175 flask and add 18 mL of media. Incubate at 37 °C overnight.\nThe next day, carefully aspirate the media with a glass pipette without detaching the cells. Replace with 18 mL of fresh media. Incubate at 37 °C overnight in an incubator.\nHarvesting viral supernatant\n\t\nRemove the viral supernatant using a pipette put on ice. Centrifuge at 800 x g for 5 min to pellet the cells and debris.\n\t\tNOTE: If the cell pellet is large, the cells were likely disrupted from the flask when the supernatant was removed. These cells can be plated again in a new flask with fresh media.\nFilter the viral supernatant using a 0.22 µm filter.\nUse the viral supernatant immediately. Keep it on ice or at 4 °C for up to 24 h, or freeze it at -80° C for long-term storage.\n2. Expansion and transduction of activated human T cells with luciferase\nActivation of human T cells in vitro\nWash the beads by adding 10 mL of phosphate buffered saline (PBS) containing 0.1% bovine serum albumin (BSA) and 2 mM ethylenediaminetetraacetic acid (EDTA) to a sterile 15 mL tube, adding beads (one bead per two T cells), placing in a magnet rack for 2 min, and suctioning out the PBS.\nPrepare media as described in step 1.1.1, then add IL-2 to a final concentration of 30 IU/mL and add the washed beads. Make 2.5 mL of media for every two million T cells to be activated.",
    "Count the T cells (freshly purified or previously purified, frozen, thawed, and washed) using a hemocytometer and trypan blue stain. Add T cells to the media prepared in step 2.1.2 and gently invert the tube to mix. The T cells will expand at least 20x depending on the source and general health of the cells. Determine the number of T cells to activate by calculating the number needed to treat the mice and dividing by 20. Here, 20 x 106 T cells per mouse were used based on preliminary experiments.\nPlate 2.5 mL of media containing two million T cells, beads, and IL-2 in each well of a 24-well tissue culture plate. Culture at 37 °C in a humidified 5% CO2 incubator.\nExamine the T cells under a 20x microscope every day for the next 3 days to determine when to transduce with luciferase. The cells are ready when they clump together and deplete the media, turning it from red/pink to light orange.\nPreparation of retronectin plates\n\tNOTE: Retronectin is used to coat the plates used in the transduction as it enhances gene transduction15.\n\t\nAdd 2 mL of 20 µg/mL retronectin in PBS to a well of an untreated 6-well plate. Incubate for 2 h at RT or 1 h at 37 °C. One retronectin-coated well is required for every two million T cells to be transduced.\nAspirate the retronectin without scratching the bottom of the plate.\nAdd 3 mL of 2% BSA in PBS (sterile filtered) per well in the 6-well plate. Incubate for 30 min at RT.\nSpinoculation\n\t\nAspirate the BSA without scratching the bottom of the plate.\nWash the wells once with 3 mL of PBS per well. Continue or replace with fresh PBS and leave the plate covered at 4 °C overnight.",
    "Add 2 mL of CBR-TDR luciferase viral supernatant (collected in step 1.3) per well.\nCentrifuge at 1,240 x g for 90 min at 32 °C.\nTransduction\n\t\nCount the T cells.\nAspirate the viral supernatant without scratching the bottom of the plate.\nPlate two million T cells per well in 6 mL of Dulbecco's modified Eagle's medium (DMEM) containing 30 IU/mL human IL-2.\nExamine the T cells daily. The T cells are ready to be expanded when they are nearly confluent, usually after 2 days.\nWhen the cells are nearly confluent, gently wash them off the bottom of the plate using a pipette and transfer each well to a separate T75 flask. Add 9 mL of media for a total of 15 mL of media per flask.\nThe next day, add an additional 15 mL of media. The cells should be ready to inject into mice the day after this addition of media. Confirm successful transduction by performing flow cytometry (the luciferase construct contains a TD tomato fluorophore that is visible in the PE channel)16.\n3. Engraftment of luciferase-transduced T cells in immunocompromised mice\nPrepare and count the T cells for injection.\n\t\nRemove the T cells from the flasks and count. The cells are ready to inject when they have expanded 20x-30x, usually by day 7 post-activation.\nCentrifuge the T cells at 800 x g for 5 min. Resuspend in 2 mL of media and remove the beads using a magnet rack.\nFor experiments where T cells will be injected separately from bispecific antibodies, count the T cells and resuspend so that the final concentration is 20 million T cells per 100 µL of media. Skip to step 3.2. For experiments using ex vivo armed T cells (EATs), skip to step 3.1.4.",
    "For experiments using ex vivo armed T cells, count the T cells and separate them into individual 1.5 mL tubes for each group, with 20 million cells per mouse. For example, if there are three groups of five mice each, prepare three 1.5 mL tubes with 100 million T cells each.\nCentrifuge the 1.5 mL tubes at 800 x g for 5 min. Remove the media carefully without disturbing the T cell pellet. Resuspend in no more than 50 µL of media containing the bispecific antibodies. Incubate at RT for 30 min.\n\t\tNOTE: For the purposes of experiments conducted in this study, proprietary IgG-[L]-scFv T cell-engaging bispecific antibodies generated in the lab were used. For T cell arming, use 5 µg of antibody per 20 x 106 T cells. Commercially available bispecific antibodies could also be used.\nWash away excess antibodies by adding 1,450 µL of media to each tube. Centrifuge at 800 x g for 5 min, carefully aspirate the media, and resuspend at a concentration of 20 million armed T cells per 100 µL media.\nInjection and engraftment into mice\n\t\nAnesthetize the mice in a chamber supplying 3.5% (v/v) inhaled isoflurane in 1 L/min oxygen. The mice are fully anesthetized when the hind limb pedal withdrawal reflex has disappeared.\n\t\tNOTE: Provide thermal support throughout the procedure.\nUsing a 26 G needle, inject 20 million T cells in 100 µL of media retroorbitally per mouse.\nAdminister 1,000 U recombinant IL-2 subcutaneously to support T cell survival in vivo.\nAdminister the bispecific antibodies retroorbitally (into the eye not used for T cell injection) or intraperitoneally. Allow the mice to recover from anesthesia and return to their cages.",
    "​NOTE: Again, here, proprietary antibodies that were generated in the lab were used, but commercially available antibodies could be used instead. In the experiments here, 0.3-10 µg of antibody per mouse per dose was administered. The antibodies were administered twice per week for 3-4 weeks.\n4. In vivo imaging of mice engrafted with luciferase-transduced T cells\nNOTE: This step is to be performed on the day of imaging, which is not necessarily the same day that the T cells and/or antibodies are administered to the mice. Typically, we perform imaging 24 h after administration of the luciferase-transduced T cells.\nPreparation of D-luciferin\n\t\nDissolve 1 g of D-luciferin in 33.3 mL of sterile PBS (final concentration: 30 mg/mL).\nAliquot the dissolved D-luciferin into 33 x 1.5 mL microcentrifuge tubes and keep the tubes at -20 °C.\nOn the day of imaging, thaw enough aliquots of 30 mg/mL D-luciferin for the number of animals to be imaged. One tube is enough for 10 animals.\n\t\tNOTE: Refreeze the remaining D-luciferin after use. D-luciferin is stable for at least five freeze/thaw cycles.\nAdministration of D-luciferin to mice\n\tNOTE: Before administering D-luciferin to the mice, open the imaging software and initialize the system. The camera may take several minutes to cool, and this should be done before the mice are injected with D-luciferin to ensure that imaging can take place 5 min after administration of the substrate.\n\t\nAnesthetize up to five mice in a chamber supplying 3.5% (v/v) inhaled isoflurane in 1 L/min oxygen. The mice are fully anesthetized when the hind limb pedal withdrawal reflex has disappeared.",
    "Once the mice are fully anesthetized, administer 100 µL of 30 mg/mL D-luciferin per mouse (3 mg per mouse) by retroorbital injection with a 26 G needle. Image this group of mice before administering D-luciferin to the next group. Place the next group of mice in the isoflurane chamber to be anesthetized while the previous group is being imaged.\nImaging luciferase-transduced T cells\n\t\nMove the anesthetized mice to the light-tight chamber of the imager and continue administering 3% isoflurane at 0.5 L/min. Place the mice on their sides such that the flank bearing the xenograft is facing up toward the camera. Take another set of images with the mice in a supine position to evaluate T cell presence in the lungs.\nUsing the Acquisition Control Panel, select Luminescent, Photograph, and Overlay. Set the exposure time to auto, the binning to medium, and F/Stop to 1. Acquire images. After the first image, set the exposure time to match that which was automatically calculated for the first image so that subsequent images may be compared directly. It may be useful to capture images with multiple exposure times to determine the optimal exposure time for achieving the brightest signal without pixel saturation.\nRemove the mice from isoflurane, return to their cages, and observe until they are awake and ambulatory.\nRepeat the steps from step 4.2.1 until all groups have been imaged.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}