{
  "id": 7291,
  "origin_website": "Bio",
  "title": "A Gel-Based Assay for Probing Protein Translocation on dsDNA",
  "procedures": [
    "DNA triplex preparation and protein dialysis (2-1 d before experiment)Generating dsDNA (2 d before experiment)Depending on the length of the DNA fragment, either order oligonucleotides or generate the fragments by restriction enzyme digest or PCR amplification.To anneal oligonucleotides for duplex formation, mix top and bottom strand oligonucleotides with annealing buffer at a 1 μM final concentration of each oligonucleotide. Incubate in a heat block at 90°C for 10 min and let cool slowly to room temperature by turning off the hot block.Triplex DNA formation (1 d before experiment)Resuspend Alexa-647 labeled oligonucleotide in 1× TE to 100 μM and aliquot in opaque tubes. Dilute to 1 μM with Triplex formation buffer immediately before triplex formation.Prepare reactions for DNA triplex in opaque tubes in a 1.2:1 molar ratio of dsDNA to TFO. Prepare a free TFO mix in the same volume.Incubate for 15 min at 57°C and cool down to 4°C o/n by transferring the tubes in the heat block to the cold room or fridge. The DNA triplex and free oligonucleotide can be aliquoted and stored at -20°C but avoid repeated thaw-freeze cycles.Protein dialysis (1 d before experiment)Dialyze proteins for at least 4 h or preferably overnight. If the protein of interest is sensitive to salt concentrations, these can be adjusted during dialysis and diluted to 100 mM NaCl immediately before the assay is started to avoid precipitation or excessive aggregation. In the example gel below, a hyperactive mutant of Mfd (Mfd D7AAA) is used. Mfd is an E. coli transcription repair coupling factor (TRCF) that is essential for the repair of DNA damage on transcribed DNA strands. The ability to translocate along the DNA is common to all TRCFs – and thus to Mfd (Adebali et al., 2017; Deaconescu and Suhanovsky 2017).",
    "DNA translocation assay (day of experiment)Prepare the reaction mix (day of experiment)Thaw reagents (DNA triplex, free TFO, single-stranded DNA, DTT, and ATP) and prepare reaction buffer.Measure concentration of dialyzed protein and prepare reactions with DNA triplex (or free TFO) at 10 nM and single-stranded DNA oligonucleotide at 50 nM (Figure 2); do not add ATP at this step. The protein concentration can be adjusted as needed. Add dialysis buffer instead of protein solution to control samples to ensure consistent salt concentrations.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4094/bioprotoc-11-14-4094-g002.jpgFigure 2. Pipetting scheme for the DNA TFO displacement assay. The reaction is prepared without ATP/H2O. While the mixture pre-incubates, tubes with GSM buffer and controls (DNA Triplex and TFO) are prepared for each timepoint. ATP/H2O is added to initiate the reaction, and samples are withdrawn at the indicated timepoints and stopped with GSM buffer.DNA translocation assay (day of experiment)Prepare a tube for each timepoint with 4 μl GSM buffer. Include a DNA triplex and a free TFO control.Pre-run 3-8% Tris-Acetate gels with icepacks for 90 min at 75 V in the cold room.Transfer tubes to PCR machine and set to preferred temperature. After 5 min of pre-incubation, add 5 mM ATP (or H2O) to reaction.Take 16 μl of the reaction at every timepoint and mix with GSM buffer in the prepared tubes. At the last timepoint, add 4 μl GSM buffer to the DNA triplex control.Load 15 μl of each reaction on the pre-run gel (be careful when loading the samples as they do not contain dye) and run for an additional 150 min at 75 V. Make sure that light exposure is kept at a minimum (wrap gel tank in aluminum foil or run gel in a dark room).",
    "The running time can be adjusted, but keeping the running buffer cool is essential to avoid melting of the triplex due to excessive heat. For very different template sizes, adjust the percentage of the gel acrylamide.Transfer the gel cassettes to a tray full of water to prevent ripping gels during removal from the cassettes. Image them using settings for your fluorophore of choice, in this case, Alexa-647 (BioRad ChemiDoc MP, Alexa647, 10 s exposure). If multiple gels are being imaged, keep the exposure time constant rather than relying on autoexposure (Figures 3B and 3C)."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}