{
  "id": 3329,
  "origin_website": "Cell",
  "title": "Enzyme-free isolation of mesenchymal stem cells from decidua basalis of the human placenta",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nCollection of placental tissue\nTiming: 15 min\n      This will demonstrate how the decidua basalis layer of the placenta is\n      identified, cut into small pieces and carried to the laboratory for\n      further processing.\n    \n        Collect the placenta, along with the umbilical cord, in an aseptic tray,\n        after cesarean delivery.\n      \n        Flip the placenta over such that the maternal surface (decidua basalis)\n        is facing upwards.\n      \nCritical: Make sure that the fetal\n      side with the umbilical cord is facing downwards.\n    \n        Cut pieces of approximately 0.5 cm thickness by using a sterile, sharp\n        pair of scissors; from the decidua basalis tissue layer, as depicted in\n        Figure 1[href=https://www.wicell.org#fig1]A and Methods video S1[href=https://www.wicell.org#mmc1].\n        \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2916-Fig1.jpg\n              Figure 1. Isolation of PL-MSCs by explant culture method\n            \n              (A–F) (A) Collection of the decidua basalis layer of the human\n              placenta (B) Wash to remove excess blood (C) Disinfection and\n              washing (D) Mincing of tissue explants (E) Plating of tissue\n              explants (F) Emerging of MSCs. Scale bar: 250 μm.\n            \n        Transfer the pieces to a 50 mL sterile centrifuge tube containing 20 mL\n        of normal saline supplemented with 1X Antibiotic-Antimycotic solution\n        (100 U/ml of penicillin, 100 μg/mL of streptomycin and 250 ng/mL of\n        amphotericin B) and additional 6.25 μg/mL of amphotericin B.\n      \nNote: Total anti-fungal concentration of\n      the prepared solution at this point is maintained at 6.5 μg/mL.\n    \n        Transport the tube back to the laboratory on ice for further processing.\n      \n        Your browser does not support HTML5 video.\n      \n          Methods video S1. Collection of placental tissue, related to steps 1–4\n        \nWashing and disinfection of placental tissue\nTiming: 2.5 h\n      This will demonstrate how the placental tissue pieces are thoroughly\n      washed to remove all traces of blood sticking to them, and meticulously\n      disinfected prior to further processing.\n    \n        Take the tissue pieces out, one by one, onto a 90 mm sterile",
    "petri-plate, and rinse them with normal saline, till all traces of blood\n        and blood clots sticking to it are completely removed, as depicted in\n        Figure 1[href=https://www.wicell.org#fig1]B and Methods video S2[href=https://www.wicell.org#mmc2].\n      \nNote: To avoid spillage of human blood and\n      contaminated liquid, we carried out this step outside the laminar flow\n      hood. However, it is advisable to carry out this procedure inside a\n      laminar flow hood, if possible, to evade contamination issues.\n    \n        Transfer the tissue pieces to another sterile 50 mL centrifuge tube\n        containing 30 mL of normal saline supplemented with 1x\n        Antibiotic-Antimycotic solution (100 U/ml of penicillin, 100 μg/mL of\n        streptomycin and 250 ng/mL of amphotericin B) with an additional\n        12.5 μg/mL of amphotericin B.\n      \nNote: Total anti-fungal concentration of\n      the prepared solution at this point is maintained at 12.75 μg/mL.\n    \nKeep the tube at 4°C for 1.5–2 h.\n        After 1.5–2 h, transfer the tissue pieces to the laminar flow hood for\n        further disinfection. Perform the following steps as depicted in\n        Methods video S3[href=https://www.wicell.org#mmc3].\n        \nTake out a tissue piece on a fresh 90 mm sterile petri-plate.\n            Dip it 3 to 4 times in a 15 mL centrifuge tube containing sterile\n            PBS to give a wash.\n          \n            Again, transfer it to another 15 mL centrifuge tube containing\n            sterile PBS, and dip it 3 to 4 times.\n          \n            Next, dip the tissue piece in a tube containing 70% ethanol for\n            exactly 15 s.\n          \n            Immediately transfer to another tube containing sterile PBS and dip\n            3 to 4 times, to remove any traces of ethanol.\n          \nRepeat step (e) 3 more times (Figure 1[href=https://www.wicell.org#fig1]C).\n        Your browser does not support HTML5 video.\n      \n          Methods video S2. Washing and disinfection of tissue pieces in saline,\n          related to steps 6–8\n        \n        Your browser does not support HTML5 video.\n      \n          Methods video S3. Transfer to laminar flow hood and washing of tissue",
    "pieces, related to step 9\n        \nMincing and plating of placental tissue\nTiming: 15 min\n        Place a washed tissue piece from step 9f onto a 90 mm sterile\n        petri-plate.\n        \nStore the tube containing the other pieces on ice.\n            Using forceps and a scalpel fixed to a scalpel holder, cut it into\n            small explants of 3–5 mm (Figure 1[href=https://www.wicell.org#fig1]D).\n          \n            Carefully plate about 10–15 explants onto a 35 mm sterile tissue\n            culture dish using fine forceps.\n          \nAllow them to air-dry for 5–7 min.\nNote: :This would facilitate the\n      attachment of the explants to the surface of the dish.\n    \n        Next, add 2 mL of warm fresh MSC isolation medium drop-wise, very\n        gently, taking care not to dislodge the explants as depicted in\n        Figure 1[href=https://www.wicell.org#fig1]E and Methods video S4[href=https://www.wicell.org#mmc4].\n      \nNote: At this stage, the MSC isolation\n      medium contains 6 μL per ml of additional amphotericin B (250 μg/mL) to\n      maintain the total anti-fungal component concentration at 1.75 μg/mL.\n    \n        Transfer the tissue culture dishes containing the placental explants to\n        a CO2 incubator maintaining 37°C and 5% CO2.\n      \nCritical: Discard the leftover minced\n      explants in a biohazard waste bag. All the liquid waste should be\n      collected in a beaker containing sodium hypochlorite solution and\n      discarded appropriately.\n    \n        After 48 h, give the first medium change with 2 mL of warm MSC isolation\n        medium. After this, give consecutive media changes every 72 h.\n      \nNote: Progressively lower the amphotericin\n      B component from the 8th day of plating of the explants. On the\n      8th day, reduce the total anti-fungal concentration to\n      1.5 μg/mL and further reduce it to 0.75 μg/mL on the 11th day.\n    \n        After approximately 10–11 days, the MSCs are expected to come out of the\n        explants.\n      \n        On ∼ 14th day, after enough cells have come out of the\n        explants, as depicted in Figure 1[href=https://www.wicell.org#fig1]F, remove them",
    "using 1 mL sterile blunt-end tips and add 2 mL of warm fresh MSC\n        isolation medium (without any additional amphotericin B added) to the\n        dishes.\n      \nNote: It is critical to remove the\n      explants once sufficient cells have emerged, to avoid the presence of\n      necrotic tissue.\n    \n        Your browser does not support HTML5 video.\n      \n          Methods video S4. Mincing and plating of tissue explants, related to\n          steps 10b–11\n        \nEstablishment of MSC culture\nTiming: Variable\n        After 24–48 h of explant removal, check the confluency of the cell\n        patches on the dishes, aspirate the medium, and wash the cells twice\n        with DPBS.\n      \nCritical: Ensure that the patches of\n      cells on the dishes are around 50–80% confluent.\n    \n        Add 250 μL of TrypLE to each 35 mm tissue culture dish and allow the\n        cells to dissociate from the plastic surface for 4–6 min at 37°C.\n      \nNote: Trypsin can also be used in place of\n      TrypLE. TrypLE is an animal origin-free recombinant enzyme that is gentle\n      on stem cells and preserves their surface proteins.\n    \n        Add 1 mL of warm fresh MSC growth medium to the dish.\n        \n            Collect the cells and transfer them to a 15 mL sterile centrifuge\n            tube\n          \nCentrifuge at 24°C–26°C for 2 min at 500 × g.\n        After centrifugation, aspirate out the medium supernatant.\n        \n            Add 500 μL of warm fresh MSC growth medium to the cell pellet to\n            suspend it.\n          \n            Take out a 10 μL aliquot of the cell suspension to count the cells\n            using a hemocytometer.\n          \n        As a next step, seed the placental MSCs (PL-MSCs) at a density of 6000\n        cells/cm2 in 2 mL of warm fresh MSC growth medium in a 35 mm\n        tissue culture dish.\n      \nNote: From passage 1 onwards, do not add\n      any anti-fungal component (Antibiotic-Antimycotic or amphotericin B) to\n      the cultures.\n    \nCulture them for 72 h till cells are 70–80% confluent.",
    "Note: No medium change is required in\n      between.\n    \n        Detach the cells with TrypLE, count them, and seed them for the next\n        passage, repeating Steps 17–22.\n      \nNote: Warm TrypLE, MSC growth medium and\n      DPBS to 37°C prior to starting the detachment of cells.\n    \nFreezing and reviving of PL-MSCs\nTiming: Variable\n        Once the PL-MSCs are 70–80% confluent, detach them with 250 μL TrypLE.\n      \n        Add 1 mL of warm fresh MSC growth medium to the cells.\n        \nTransfer them to a 15 mL centrifuge tube.\nTake an aliquot for counting\n            Centrifuge the remaining cells at 500 × g for 2 min at\n            24°C–26°C.\n          \nNote: Till passage 4, freeze the excess\n      cells obtained during cell culture.\n    \n        Aspirate the supernatant and suspend the cells directly in freezing\n        medium at ∼2 × 106 cells/mL.\n      \n        Put the cell suspension into cryogenic vials and place them in a Mr.\n        Frosty freezing container containing isopropanol.\n      \n        Keep the Mr. Frosty freezing container in −80°C freezer for ∼24 h before\n        transferring the cryogenic vials to a liquid nitrogen tank for long-term\n        storage.\n      \n        For cell revival, take out a cryogenic vial with frozen PL-MSCs from the\n        liquid nitrogen tank and immediately transfer it to a beaker containing\n        water at 37°C for gentle thawing.\n      \n        Once the cell suspension has thawed, add 1 mL of warm fresh MSC growth\n        medium to the cryogenic vial, mix, and transfer the contents to a 15 mL\n        centrifuge tube containing ∼ 3 mL of additional warm fresh MSC growth\n        medium.\n      \n        Centrifuge the cells at 500 × g for 2 min at 24°C–26°C to wash\n        off the freezing medium.\n      \n        Aspirate the supernatant and resuspend the cell pellet in 500 μL of\n        warm, fresh MSC growth medium.\n        \n            Add 2 mL of warm, fresh MSC growth medium to a 35 mm tissue culture\n            dish",
    "Add the cells and gently swirl to distribute them evenly.\nNote: During thawing and revival of MSCs,\n      plate the cells at a higher density to maximize recovery.\n    \n        Transfer the dish to a CO2 incubator and replace the medium\n        with 2 mL of warm, fresh MSC growth medium the next day.\n      \n        After 48 h of reviving and plating, detach the cells with TrypLE, count\n        and seed an appropriate number of cells for the next passage.\n      \nCharacterization of PL-MSCs\nImmunophenotyping by flow cytometry\nTiming: 2 h\n        At passages 4–5, detach the PL-MSCs with TrypLE and calculate the cell\n        number as per Step 19.\n      \n        Wash the harvested cells 1–2 times with ice-cold PBS by centrifuging at\n        500 × g for 2 min.\n      \n        Discard the supernatant and suspend the cells in PBS at 2 × 106\n        cells/ml.\n      \n        Aliquot 1 × 105 cells or 50 μL of cell suspension in each of\n        the pre-labeled 5 mL FACS tubes.\n      \n        Add the respective antibodies to the tubes and incubate in ice for 1 h.\n        Mouse isotype antibodies serve as controls.\n      \n        Acquire at least 10,000 events on BD LSRFortessa Cell Analyzer flow\n        cytometer and analyze the results using BD FACSDiva software.\n      \n        Representative data from a PL-MSC culture at passage 4 is presented in\n        Figures 2[href=https://www.wicell.org#fig2]A–2F.\n        \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2916-Fig2.jpg\n              Figure 2. Immunophenotypic characterization of isolated PL-MSCs\n            \n              The antibodies used were (A) human CD73, (B) human CD90 (C) human\n              CD105 (D) human CD166 (E) human CD34 (F) human HLA-DR and their\n              respective isotype controls. Open histogram indicates background\n              signal, while, shaded histogram represents positive reactivity\n              with the indicated antibodies. Table shows percentage of cells\n              expressing the respective surface markers (n = 3) in mean ± SEM.\n            \nIn vitro differentiation\nTiming: ∼25 days\n        Use PL-MSCs at passages 4–5 to perform the in\nvitro differentiation studies.",
    "Seed the isolated PL-MSCs at a density of 6000 cells/cm2\n            on a 35 mm tissue culture dish in 2 mL of warm, fresh MSC growth\n            medium.\n          \n            Incubate the dishes at 37°C and 5% CO2 until they reach\n            85–90% confluency.\n          \n        Next, remove the growth medium, and initiate in\nvitro differentiation by adding 2 mL of pre-warmed\n        differentiation medium.\n      \n        Continue adipogenic differentiation for a total of ∼20 days (or till\n        matured oil drops become visible within the cells)4[href=https://www.wicell.org#bib4]\n        and osteogenic differentiation for 21–22 days, with media changes given\n        every third day.\n      \nNote: Plate the uninduced control cultures\n      at an identical density and maintain it in MSC growth medium for a similar\n      duration.\n    \n        After completion of differentiation, stain the adipogenic differentiated\n        dish with Oil Red O and osteogenic differentiated dish with Alizarin Red\n        S, respectively, and observe under bright field microscope.\n        \nNote: Stain the corresponding\n          uninduced control cultures as well.\n        \n        Staining – Oil Red O Staining –\n        \n            Aspirate the medium from the adipogenic differentiation dish and\n            give a PBS wash at 24°C–26°C.\n          \n            Fix the cells with 4% PFA in PBS and incubate for 20 min at\n            24°C–26°C.\n          \n            After this, give a PBS wash, and next, add 60% isopropanol to the\n            dish and incubate for 3 min at 24°C–26°C.\n          \n            Remove the isopropanol and add 1–2 mL of Oil Red O stain solution.\n            Incubate the dish in dark for 60 min at 24°C–26°C.\n          \n            Following the incubation, give three washes with double distilled\n            water to remove excess stain.\n          \n            Add a small amount of double distilled water to the dish to prevent\n            the cells from drying and then visualize under bright field\n            microscope.\n          \n            Upon Oil Red O staining, the oil droplets formed in the adipogenic\n            differentiated culture appear red in color, whereas the uninduced\n            control culture remains unstained.\n          \n            Representative images of the same are presented in",
    "Figure 3[href=https://www.wicell.org#fig3]A.\n            \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2916-Fig3.jpg\n                  Figure 3. Differentiation potential of PL-MSCs\n                \n                  (A) Oil Red O staining to demonstrate adipogenic\n                  differentiation (40× magnification), Scale bar: 200 μm.\n                \n                  (B) Alizarin Red S staining to demonstrate osteogenic\n                  differentiation (10× magnification) (n = 3). The corresponding\n                  uninduced control cultures did not show any staining (40×\n                  magnification), Scale bar: 500 μm.\n                \n            Alizarin Red S Staining –\n          \n            Aspirate the medium from the osteogenic differentiation dish, and\n            give a PBS wash at 24°C–26°C.\n          \n            Fix the cells with 4% PFA in PBS and incubate for 20 min at\n            24°C–26°C.\n          \n            Give two washes with double distilled water, and add 2 mL of 1%\n            Alizarin Red S solution. Incubate the dishes in the dark for 1 h at\n            24°C–26°C.\n          \n            After this, again give two washes with double distilled water to\n            remove excess stain.\n          \n            Add a small amount of double distilled water to the dish to prevent\n            the cells from drying and then visualize under bright field\n            microscope.\n          \n            Upon Alizarin Red S staining, the calcium phosphate deposits in the\n            osteogenic differentiated culture appear red in color, whereas the\n            uninduced control culture remains unstained.\n          \n            Representative images of the same are presented in\n            Figure 3[href=https://www.wicell.org#fig3]B.\n          \nCFU-F assay (colony forming unit-fibroblast assay)\nTiming: ∼ 10 days\n    \n        Perform the CFU-F assay with PL-MSCs at passage 2–3. For this, seed the\n        PL-MSCs at a density of 10 cells/cm2 in a 35 mm tissue\n        culture dish.\n      \n        An outgrowth of around 50 cells can be referred to as a colony. After\n        9–10 days, the plated cells are seen to give rise to colonies when\n        visualized under an Eclipse TS100 inverted phase-contrast microscope.\n      \n        Then, aspirate the medium out from the dish and give it a wash with\n        DPBS.\n      \nAfter this, fix the cells with 1% PFA in PBS for 20 min.",
    "Remove the PFA, give a wash with PBS, and add 0.1% Toluidine blue stain\n        (in 1% PFA) to the dish for staining.\n      \n        After 1 h, remove the stain from the dish and give two consecutive\n        washes with double distilled water.\n      \n        Manually count the stained colonies and report the data as a total\n        number of colonies per 100 cells plated.\n      \n        Representative image of the CFU-F assay has been presented in\n        Figure 4[href=https://www.wicell.org#fig4]A.\n        \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2916-Fig4.jpg\n              Figure 4. CFU-F assay, growth kinetics, immunofluorescence and\n              qRT-PCR analysis of isolated PL-MSCs\n            \n              (A) CFU-F assay was performed in triplicates from PL-MSCs (n = 3).\n            \n              (B and C) Growth kinetics of PL-MSCs represented in terms of\n              (B) population doublings and (C) population doubling time obtained\n              for P1 to P6. Passage numbers are denoted as P1, P2, P3, P4, P5,\n              and P6 (n = 4). Each bar represents mean ± SEM.\n            \n              (D–F) Representative images of PL-MSCs immunostained with\n              (D) vimentin (E) Stro-1 and (F) Oct-4. DAPI (blue) was used to\n              stain the nuclei (n = 3), Scale bar: 50 μm.\n            \n              (G) Average Ct ± SEM values of VIM and POU5F1 (n =\n              3).\n            \nGrowth kinetics\nTiming: 15 min\n        As described in step 19, during passaging of cells count the cell\n        numbers using a hemocytometer.\n      \n        Calculate the population doublings and population doubling time for\n        passage 1 to passage 6 using the formula below:\n      \n      Population doublings = {log 10 (Nh ) – log\n      10 (Ni )}/{log 10 2}\n    \n      Population doubling time = {Time in culture (in hrs)}/{Population\n      doublings}\n    \n      where, Ni = inoculum cell number and Nh is the\n      harvest cell number.\n    \n        The data obtained has been presented as population doublings and\n        population doubling time across increasing passages in\n        Figures 4[href=https://www.wicell.org#fig4]B and 4C.\n      \nImmunofluorescence\nTiming: 2 days\n        Perform the immunofluorescence studies with PL-MSCs at passage 4–6.",
    "Plate PL-MSCs at a density of 6000 cells/cm2 on glass\n            cover-slips\n          \nIncubate at 37°C under standard culture conditions for 72 h.\n        After 72 h, aspirate the medium and transfer the cover-slips to clean\n        35 mm tissue culture dishes for further processing.\n      \nGive two consecutive washes with PBS at 24°C–26°C.\n        Add ∼1.5 mL of 4% PFA in PBS to each dish with the cover-slips for\n        fixation.\n      \nFix the cells on the cover-slips for 20 min at 24°C–26°C.\n        Again, give two consecutive washes with PBS at room temperature to\n        remove all traces of PFA.\n      \nPause point: After fixation, the\n      cells can be stored at 4°C for up to one week.\n    \n        Perform permeabilization with 0.1% Triton X 100 in PBS. Add it to the\n        cover-slips and keep at 24°C–26°C for 10 min.\n      \nTo remove the Triton X 100, give one wash with PBS.\n        Add ∼1.5 mL (or sufficient volume to cover) of 3% BSA in PBS to each\n        dish with the cover-slips for blocking, and keep the dishes for 60 min\n        at 24°C–26°C.\n      \n        Following this, add the primary antibodies, vimentin, Stro-1, and Oct-4\n        at 1:150, 1:100, and 1:400 dilutions (or an optimized dilution as per\n        manufacturer’s instruction) in 3% BSA, respectively.\n      \nNote: For each antibody, plate one\n      cover-slip of cells for staining. Keep a cover-slip, which would serve as\n      a negative control. In the negative control, add the secondary antibody to\n      the fixed cells, but eliminate the addition of primary antibody. This can\n      detect any false positives expressed due to non-specific binding of\n      secondary antibody.\n    \nNote: Here, we have optimized a new\n      protocol for the isolation of MSCs from the placenta, which has not been\n      previously studied by our group. Hence, to test if the isolated PL-MSCs\n      exhibit any pluripotency, we checked for the expression of Oct-4, a known\n      pluripotency marker.",
    "Keep the cover-slips at 4°C for 12–16 h. To ensure that the antibody\n        solution does not dry up, place in a humidified chamber or box.\n      \n        Next day, remove the primary antibody and give three consecutive washes\n        with PBS (each wash of 5 min) at 24°C–26°C.\n      \n        Add the respective secondary antibodies to the cover-slips, in 1:500\n        dilution (or an optimized dilution as per manufacturer’s instruction) in\n        1.5% BSA in PBS. Incubate in dark for 1 h.\n      \n        To remove the secondary antibody, again, give three consecutive washes\n        with PBS (each wash of 5 min) at 24°C–26°C.\n      \n        Add DAPI (1:5000 dilution in PBS or an optimized dilution as per\n        manufacturer’s instruction) to each dish containing the cover-slips, and\n        incubate them for 10 min in the dark.\n      \n        Again, give three consecutive washes with PBS (each wash of 5 min) at\n        24°C–26°C to remove DAPI.\n      \n        Mount the cover-slips using VECTASHIELD as anti-fade mounting medium.\n        Capture the cell images at 24°C–26°C at 40× magnification using\n        fluorescence microscope.\n      \n        Representative images of PL-MSCs stained with vimentin, Stro-1 and Oct-4\n        are presented in Figures 4[href=https://www.wicell.org#fig4]D–4F.\n      \nGene expression analysis\nRNA isolation and cDNA synthesis\nTiming: 2.5 h\n        Seed the isolated PL-MSCs at a density of 6000 cells/cm2 on a\n        35 mm tissue culture dish in 2 mL of warm, fresh MSC growth medium at\n        passage 4–6. Incubate the dishes at 37°C and 5% CO2 for 72 h.\n      \n        Aspirate the medium from the dish.\n        \nGive a wash with PBS at 24°C–26°C\n            Add 500 μL of RNAiso Plus to the dish to isolate total RNA as per\n            manufacturer’s protocol (see\n            https://www.takarabio.com/assets/a/112212[href=https://www.takarabio.com/assets/a/112212]).\n          \n        Determine the concentration of RNA isolated using a NanoDrop\n        spectrophotometer.\n      \nPause point: The isolated RNA can\n      be stored at −80°C before cDNA synthesis.\n    \n        Prepare cDNA from the RNA using Verso cDNA synthesis kit, as per the\n        manufacturer’s protocol (see\n        https://assets.thermofisher.com/TFS-Assets/LSG/manuals/MAN0012822_Verso_cDNA_Synthesis_AB1453A_UG.pdf[href=https://assets.thermofisher.com/TFS-Assets/LSG/manuals/MAN0012822_Verso_cDNA_Synthesis_AB1453A_UG.pdf]).",
    "Pause point: The cDNA can be stored\n      at −20 or −80°C before qRT-PCR.\n    \n      Quantitative reverse-transcription polymerase chain reaction (qRT-PCR)\n    \nTiming: 2 h\n        Use PowerUp SYBR Green Master Mix to detect and quantify the mRNA\n        expression level for vimentin (VIM) .\n      \ntable:files/protocols_protocol_2916_6.csv\ntable:files/protocols_protocol_2916_7.csv\ntable:files/protocols_protocol_2916_8.csv\n        Use TaqMan Gene Expression Assay (FAM) and TaqMan Fast Universal Master\n        Mix to detect and quantify the mRNA expression level for Oct-4\n        (POU5F1).\n      \ntable:files/protocols_protocol_2916_9.csv\ntable:files/protocols_protocol_2916_10.csv\n        The Ct values (mean ± SEM) obtained for VIM and POU5F1 are\n        presented in Figure 4[href=https://www.wicell.org#fig4]G."
  ],
  "subjectAreas": [
    "Stem Cells",
    "Cell Isolation",
    "Flow Cytometry",
    "Cell Culture",
    "Cell Biology",
    "Cell Differentiation"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}