{
  "id": 11050,
  "origin_website": "Jove",
  "title": "A Conflict Model of Reward-seeking Behavior in Male Rats",
  "procedures": [
    "This study is approved by the International Review Board (IRB) of the Institute of Psychology, Chinese Academy of Sciences, and all experiments are conducted in accordance with the National Institutes of Health (U.S.A) Guide for Care and Use of Laboratory Animals (2011).\n1. Materials and Setup for the Conflict Model\nHouse four rats per cage (50 cm long x 22.5 cm wide x 30 cm high) in colony rooms with controlled temperature (22–25 °C) and a reversed 12 h/12 h light/dark cycle (lights on at 21:00) for at least 10 days.\nNOTE: Male and female Sprague-Dawley rats weighing 330–400 and 230–250 g at the beginning of the experiments, respectively were used.\nPerform all the tests under dim lighting during the dark phase.\nUse the opaque cartons (37 cm long x 26 cm wide x 18 cm high) with pine wood shaving bedding to transport rats from home cages to testing rooms.\nHandle rats 3 min each per day for 5 days prior to beginning the experiments.\nPrepare 120 mL of morphine for the whole experiment. Dissolve morphine hydrochloride in 0.9% NaCl (physiological saline) at a final concentration of 20 mg/mL. Store at room temperature (RT).\nPrepare 10 mL of the pentobarbital sodium solution for the surgery. Dissolve pentobarbital sodium in 0.9% NaCl at a concentration of 1 g/mL. Store at 4 °C.\nPrepare 10 mL of estradiol benzoate (EB) and 10 mL of progesterone for artificial induction of estrus. Dissolve estradiol benzoate and progesterone in sesame oil at a concentration of 0.125 mg/mL and 5 mg/mL, respectively.\nNOTE: Incubate the oil suspension of EB or progesterone in a water bath (55–60 °C) for at least 1 h and then thoroughly shake it. Ensure that EB or progesterone is dissolved completely. Store at RT.",
    "For the risky reward-seeking behavior testing, use the open-field reward-proximity chambers made of black acrylic glass. At one end of the open-field arena (85 cm long x 35 cm wide x 50 cm high) mount a wire-screen stimulus cage (15 cm long x 25 cm wide x 25 cm high). Install the board with pins on the floor about 20 cm in front of the stimulus-cage.\nNOTE: Pins are fixed on the 34.5 cm long x 13 cm wide boards (Figure 1). The boards with three types of pins are used in turn during testing (Table 2).\n2. Estrus induction in Females and Mating Screening in Males\nBilateral ovariectomy in female rats\n\tNOTE: The surgical instruments and other items used in surgery are sterile. And surgery is performed using aseptic technique.\n\t\nPrepare surgical instruments and materials such as scalpels, surgical blades, hemostatic forceps, tweezers, ophthalmic scissors, gauze, cotton swabs, suture needles and silk sutures in advance, as well as 75% alcohol, iodine, sodium pentobarbital, 0.9% NaCl, penicillin sodium.\nIntraperitoneally inject pentobarbital sodium (55 mg/kg), waiting for complete anesthesia of female rats. Rats respire smoothly and do not react to tail pinch.\nNOTE: The ovariectomy is performed only when the weight of female rat reaches at least 240 g.\nPlace the female rat in prone position, shave off the fur on the back, and disinfect the exposed skin with iodophor. Then use a scalpel to make a middle vertical incision (about 2 cm long) on the back (1 cm below the edge of the ribcage).\nPull the skin to the left side, and blunt dissect subcutaneous tissue with hemostatic forceps to expose the lumbar muscles. Cut the muscle layer (incision of 1 cm) into the abdominal cavity, till the adipose tissue is reached.",
    "Pull out the adipose tissue with bent tweezers, and locate the ovary which is a flesh-pink tissue (about 0.5 cm x 0.4 cm x 0.3 cm) surrounded by adipose tissue with the twining fallopian tube on the surface.\nClamp the fallopian tube with forceps and ligate it, then cut off the ovary together with the surrounding adipose tissue.\nPut the residual fallopian tube and adipose tissue back into the abdominal cavity after ensuring no bleeding, and suture the muscle layer.\nRemove the ovary on the other side by the same procedure and then suture the skin incision.\nPlace the rat on a heated blanket till awakening and then put it back into the home cage.\nAfter at least two weeks of recovery, use the female rats as a tool for mating screening and behavioral testing.\nNOTE: Pay attention to the state of the female rat after surgery, and supply adequate water and food. Keep the ovariectomized rats single housed for one week and then house four per cage.\nInduction of estrus in ovariectomized female rats\nHandle all ovariectomized female rats three times (3 min/day) before using them for mating screening.\n\t\t\nGently pick up a rat from the transport box with the left hand and hold it in the arms for a few seconds. Then put the rat back into the box and repeat these operations for 3 min.\nSubcutaneously inject estradiol benzoate (25 μg/rat) about 48–52 h before mating screening or the conflict test.\nSubcutaneously inject progesterone (1 mg/rat) about 4–6 h before mating screening or the conflict test.\nNOTE: The estrogenic hormones are injected subcutaneously on the back of the neck. Since an estrus cycle lasts for ~4‒5 days, the female rats are used once a week.\nScreening male rats for mating performance",
    "NOTE: Screening is conducted under dim light during the dark phase of the light/dark cycle in the housing room.\n\t\nPlace a male rat individually into the carton (60 cm long x 50 cm wide x 40 cm high) with pine wood shaving bedding and leave it to habituate for 5 min.\nIntroduce an estrous female rat into the carton and monitor male copulatory behaviors (by experienced observers).\nPut the rats back to home cages after male rats complete their first ejaculation within 30 min or do not display intromission within 15 min or ejaculation within 30 min.\nAssign the male rats that pass the screening (successful ejaculation for three consecutive days) randomly into different groups (such as the saline- and morphine-treated groups).\n3. Pretreatment in Male Rats Prior to the Conflict Test\nBinge-like morphine treatment \nNOTE: Male rats are intraperitoneally injected with saline or morphine delivered in a binge-like regimen14 (Table 1).\n\t\nWeigh the male rats and calculate the injection volume for each rat based on the body weight (see Table 1).\nPrepare syringes with morphine or saline solutions.\nInject one rat at a time intraperitoneally and immediately place it gently into the home cage (4 rats/cage).\nAfter at least 6 h, give the male rats the second injection in the same way.\nAcute stress\nNOTE: Foot shocks are delivered prior to each conflict test in four identical chambers assembled with four shock generators and controlled by professional software installed on a computer.\n\t\nOn the day of the conflict test, take the male rats to another room different from the conflict testing room.\nPut the male rats into the chambers (30.5 cm long x 25.4 cm wide x 30.5 cm high) to habituate for 1 min.",
    "Set up the software program in advance. The program includes the intermittent foot shocks delivered within 10 min (0.5 mA x 0.5 s x 10 min; mean inter-shock interval 40 s, range 10–70 s).\nEnter animal IDs and choose whether to turn on the shock generators according to the grouping (the shock group and the control group). Then press the start button.\nWhen the stress procedure is finished, bring the rats immediately to the conflict test room in transport boxes; one rat per box.\n4. The Conflict Test\nNOTE: The test is conducted under dim light during the dark phase of the light/dark cycle in the conflict test room.\nOn the day before testing, bring all rats to the conflict test room and allow them to habituate to the open-field reward-proximity chamber (without any obstacle, Figure 1) for 15 min.\nOn the testing day, place the male rat in the chamber allowing free exploration for 10 min (under the same condition as the day before testing).\nPlace an estrous female rat in the stimulus-cage as an incentive and allow the male subject to freely approach and investigate the incentive rat for 5 min.\n\tNOTE: The male rat is randomly exposed to an estrous female, and this female is not a familiar rat.\nAfter 5 min-free approach, move the male subject from the stimulus-cage to the other end of the arena, place an obstacle (a 14 cm-wide board thick with pins), and then start the first trial of the test.\nNOTE: The difficulty level of obstacles is varied among trials based on the types of pins and the height of the board. The grading system is shown in Table 2.\nMove the male rat away from the stimulus-cage about 15–20 s after each time it surmounts the obstacle.",
    "End a trial if the male subject climbs or jumps over the obstacle 3 times within 4 min and immediately start the next trial with increasing difficulty of the obstacle.\nIf a male subject surmounts the obstacle less than three times within 4 min, end the test and record the times it surmounts the obstacle.\nBring the male rat back to the home cage and scrub the open-field chamber with 0.05% glacial acetic acid.\nScore each surmounting (or approaching) as per Table 2. Use the sum of the scores for all of the surmountings as a total score for a male subject in this conflict test.\n5. Statistical Analysis\nPresent the data as mean ± SEM or single data points. In case that homogeneity of variance or normal distribution of the datasets is challenged, log-transform the data sets.\nAnalyze the effects of morphine pretreatment on reward-seeking behavior displayed on day 7 and day 17 of withdrawal (Wd7 and Wd17) using t-tests with “pretreatment” as a between-subjects factor (morphine versus saline, Figure 2).\nAnalyze the effects of morphine pretreatment on reward-seeking behavior after repeated testing using repeated-measure’s analysis of variance (ANOVA) with “withdrawal time” (Wd7 versus Wd14) as the within-subjects factor and “pretreatment” (morphine versus saline) as a between-subjects factor.\nIn addition, use Pearson’s correlation to analyze the correlation between the scores that male subjects acquired on days 7 and 14 of abstinence (Wd7 and Wd14, Figure 3).\nNOTE: After the logarithmic conversion of the original data, statistical analyses are performed.\nAnalyze the effect of acute stress on reward-seeking behavior in drug-naïve rats using t-test with stress as a between-subjects factor (shock versus control, Figure 4)\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}