{
  "id": 6933,
  "origin_website": "Bio",
  "title": "Neutrophil Extracellular Trap Killing Assay of<em> Candida albicans</em> ",
  "procedures": [
    "Mouse bone marrow neutrophil enrichment  Mice at 6-12 weeks of age are placed in euthanasia chamber and euthanized by carbon dioxide for 4 min according to the AVMA Guidelines on Euthanasia (Cima, 2013). Obtain femur and tibia by using surgical operating dissecting scissors and Semken forceps.Note: All animal procedures and experimental protocols need to be approved by AAALAC-accredited facility of the host institute. Soak the bones in 1 ml ice cold 1x HBSS.Cut both ends of the bone, insert to one end the needle of a 3 ml syringe that is filled with ice cold 1x HBSS, push the plunger to flush out bone marrow cells into a 15 ml conical tube.Flush the bone one more time as in Step A3.Centrifuge the tube at 300 x g in room temperature for 10 min and discard the supernatant. Resuspend cell pellet in 1 ml of ice cold RBC lysis buffer and leave it in room temperature for 1 min.Add 1 ml of 1x DPBS to the tube.Centrifuge the tube at 500 x g in room temperature for 5 min, discard the supernatant and suspend the pellet in 1 ml of 1x DPBS.Prepare three layers of discontinuous Percoll solutions (55%, 62%, and 81% Percoll in the order of top to bottom in a 15 ml conical tube. Each layer is consisted of 3 ml as shown in Figure 1).Overlay bone marrow cell suspension on top of the discontinuous Percoll gradient as shown in Figure 1.Centrifuge at 1,400 x g in room temperature for 30 min in a swing-out rotor, with the brake off.“Gently” remove the top 6 ml of the solution by micropipette and collect 1.0-1.",
    "5 ml of the solution containing the band of neutrophils at the interface of 62 and 81% as shown in Figure 1 to a new 15 ml conical tube.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200816/20200816233427_5048.jpgFigure 1. Enrichment of bone marrow neutrophils by discontinuous Percoll gradient centrifugation. Overlay bone marrow cell suspension on top of the 55/62/81% Percoll gradient (Step A10). After centrifugation in swing-out rotor (Step A11), there will be three visible bands in the gradient solution. Neutrophils are located at the interface of 62% and 81% Percoll (the lowest band). Carefully remove the top 6 ml of the solution and collect the top 1.0-1.5 ml of the remaining solution that contains cells at the lowest band (between the 2.5-4.0 mark on the scale) (Step A12).Add 8 ml of 1x DPBS to the tube containing neutrophils and centrifuge at 1,000 x g in room temperature for 5 min and discard the supernatant.Suspend the pellet in 2 ml of DPBS and centrifuge at 500 x g in room temperature for 3 min and discard the supernatant. Suspend the pellet in 1 ml of HBSS.Dilute 10 µl of well-mixed cell suspension in 390 µl of 0.4% trypan blue solution and count the number of viable cells by loading 10 µl of the mixture to a Neubauer counting chamber. While viable cells are bright and shiny, dead cells stain blue. There is approximately 0.8 x 107-1 x 107 bone marrow cells per mouse. Leave cells in room temperature until use.Preparation of fresh C. albicans  Thaw a frozen aliquot of C. albicans and plate it onto a YPD agar plate. Incubate the dish at 30 °C overnight.Scrape C. albicans colonies with a sterile1,000 µl tip and streak the yeasts on YPD agar plate. Incubate the plate at 30 °C overnight.Scrape C.",
    "albicans colonies with a sterile 200 µl tip and suspend in 1 ml HBSS.Take 10 µl of well-mixed C. albicans solution, dilute it in 390 µl of 4% trypan blue solution and count the number of viable yeast cells by loading 10 µl of the mixture to a Neubauer counting chamber. While viable yeast cells are bright and shiny, dead cells stain blue (approximately 0.5 x 107-2 x 107 C. albicans yeasts per ml).Leave C. albicans on ice until use.Neutrophils and C. albicans preparationsDilute bone marrow neutrophils obtained from Step A16 to 2 x 105 per 1 ml of HBSS solution. Dilute freshly harvested C. albicans yeasts obtained from Step B7 to 4 x 105 per 1 ml of HBSS.Prepare 4 x 103 U/ml MNase by diluting 0.5 µl of enzyme stock in 250 µl of HBSS. NET killing assay of C. albicans Seed 2 x 104 neutrophils (100 µl) in the wells of flat-bottomed 96-well plate and let adhere by incubation at 37 °C (5% CO2 incubator) for 30 min.Leave wells for 100 µl of HBSS without adding neutrophils as control as in Figure 2.Add 4 x 104 unopsonized C. albicans yeasts (100 µl) to all the wells (including control well) as shown in Figure 2.Add 0.5 µl of MNase (4 x 103 U/ml) at a final concentration of 10 U/ml or heat-inactivated MNase at otherwise equivalent concentration to appropriate wells as shown in Figure 2. Centrifuge the plate at 800 x g in room temperature for 3 min to spin down the yeasts.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200816/20200816233622_0124.jpgFigure 2. Layout for NET killing assay of C. albicans. Bone marrow neutrophils obtained from three different mice are suspended in 1x HBSS separately. Neutrophils from each mouse are seeded in two separate wells (Step D1). Leave one well for 1x HBSS only (Step D2).",
    "After incubation of the plate at 37 °C for 30 min, C. albicans suspensions are added to all three wells (Step D3). At the same time, MNase and heat-inactivated MNase (∆MNase) are added to separate wells separately (Step D4). Incubate the plate at 37 °C (5% CO2 incubator) for 3 h.Add 0.5 µl of MNase to all the wells. Leave the plate at 37 °C (5% CO2 incubator) for 15 min.Collect the content (about 200 µl) of each individual well into a microcentrifuge tube.Add 200 µl of ice cold H2O (pH = 11) to each well.Use mini cell scraper to scrape the bottom of each well followed by vigorous pipetting to dislodge C. albicans hyphae. Collect the content of each well and add to the same microcentrifuge tubes.Repeat steps 9 to 11 once (total of 600 µl solution in the microcentrifuge tube now).Add 400 µl of HBSS to each microcentrifuge tube. Vortex microcentrifuge tubes vigorously for 20 s.Make 1:10 serial dilutions of the supernatant and plate 100 µl of the diluted solution on YPD plate in duplicate.Seal the plates with paraffin and leave in 30 °C incubator for 2 days. Enumerate colony forming units (CFUs) as shown in Figure 3.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200816/20200816233735_2875.jpgFigure 3. YPD plates with different C. albicans colony forming units (CFUs). Supernatants containing C. albicans are serially diluted (Step D15) and plated on YPD plates. The plates are incubated at 30 °C for 2 days (Step D16). C. albicans colonies are smooth and creamy white in color. There will be 3 different numbers of colonies from three 1:10 serially diluted supernatants. Select the plates with colonies fall between 30 and 300 (B) for counting and disregard the ones outside of this range (A).",
    "Carefully count each single colony even when they are very close to each other (B, red dotted circle)."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Microbiology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}