{
  "id": 17589,
  "origin_website": "Jove",
  "title": "Stabilized Longitudinal In Vivo Cellular-Level Visualization of the Pancreas in a Murine Model with a Pancreatic Intravital Imaging Window",
  "procedures": [
    "All procedures described in this paper were conducted in accordance with the 8th edition of the Guide for the Care and Use of Laboratory Animals (2011)26 and approved by the Institutional Animal Care and Use Committee at the Korea Advanced Institute of Science and Technology (KAIST) and Seoul National University Bundang Hospital (SNUBH).\n1. Preparation of the window and other materials\nCustom design the pancreatic intravital imaging window to seclude the pancreas from the bowel in the abdominal cavity18 (Figure 1A,B). A detailed blueprint of the window is described in a supplementary figure of a previous study18.\nUse C57BL/6N mice, 8-12-week-old males, for intravital pancreatic imaging. Inject anti-CD31 antibody conjugated with an Alexa 647 fluorophore, 2 h prior to the imaging, for the purpose of vessel labeling18.\nFor the islets study, prepare a transgenic mouse model in which the islets are tagged with a fluorescent reporter protein. Here, we utilized MIP-GFP, where green fluorescent protein was expressed under the control of the mouse insulin 1 gene promoter, which is active in the beta cells of all islets in the mouse24.\nFor the pancreatic cancer study, prepare transgenic cancer cells tagged with a fluorescent reporter protein and BALB/C nude mice. In this study, the PANC-1 NucLight Red cells were used. PANC-1 cancer cells25 were labeled with the NucLight Red fluorescent probe.\nSterilize all surgical tools, cover glass (with PEG or not), and imaging windows using an autoclave.\nApply PEG coating to the cover glass to prevent inflammatory response and increase biocompatibility, which is suitable for long-term imaging.\n2. Surgery\nPrepare a sterile surgical platform and sterilize the surfaces with 70% ethanol.\n\tNOTE: For longitudinal imaging sessions, aseptic technique is essential.\nAnesthetize mice with a mixture of tiletamine/zolazepam (30 mg/kg) and xylazine (10 mg/kg).",
    "NOTE: Use of tiletamine/zolazepam is recommended instead of ketamine because of its adverse effect of hyperglycemia. Optimal anesthesia should be selected for the purpose of the experiment9,27.\nMonitor the body temperature using a rectal probe with a homeothermic controlled heating pad.\nShave the left flank of the mouse and apply three rounds of alternating alcohol and iodine-based scrub.\n\tNOTE: If depilatory cream is used, do not leave longer than 1 minute to avoid chemical burn.\nMake a 1.5 cm incision on the left flank of the mouse and dissect the skin and muscle.\nPerform a purse-string suture with a black or nylon 4-0 suture in the incision margin.\nUse a micro retractor on the incision and gently expose the spleen.\nCarefully pool the spleen with ring forceps and identify the pancreas.\nPlace the window at the flank of the mouse and pass the spleen and pancreas through the open space of the window. Manipulation of the pancreas has to be very gentile as it can cause bleeding or pancreatitis\nGently place the pancreas on the plate of the imaging window; the spleen will be placed on the open space of the window.\nFor the cancer cell study, inject PANC-1 NucLight Red (1.0 x 106 cells) directly into the pancreas.\n\tNOTE: For imaging the orthotopic human pancreatic cancer xenografts, direct implantation of cancer cell such as PANC-1 or other human pancreatic cancer cell could be facilitated28. To visualize with intravital fluorescence microscopy, PANC-1 cells were transduced with red fluorescent protein using the NucLight Red lentiviral reagent that labels the nucleus29. Although maximal injection volume is uncertain, decrease the volume as possible to avoid the pressure effect in the pancreas.\nApply drops of N-butyl cyanoacrylate glue on the margin of the imaging window.",
    "To minimize the amount of the applied glue, use a 31 G catheter needle for the application. If the amount of the drop is large, then the tissue will unintentionally adhere to the window or cover glass.\nGently apply a 12 mm round cover glass to the margin of the imaging window.\nPull the suture loop to fit into the lateral groove of the window and tie it three times.\nCut the maximal proximal site of the knot to prevent the interruption of tight stitches when these mice are awake.\nLet mice recover from anesthesia (2-3 hours) and inject ketoprofen (5 mg/kg, subcutaneous in the loose skin at the base of neck or hip of the animal) for pain relief. Reassess for signs of pain every 12 hours and ketoprofen should be considered every 24 hours for 1-3 days.\n\t​NOTE: Analgesia influences insulin secretion in response to glucose9. The choice and timing of analgesia must be individualized for the experimental purpose.\nAccomodate the mouse in the cage with sufficient bedding to avoid the contact of the window to the cage. Avoid housing the house with the mice without the window surgery.\n3. Intravital imaging\nTurn on the intravital microscope including the laser power.\nTurn on the heating pad and set the homeothermic regulation to 37 °C.\n\tNOTE: Alternatively, use a passive heating pad or lamp with frequent control if there is no homeothermic regulation.\nPerform intramuscular anesthesia with a mixture of tiletamine/zolazepam (30 mg/kg) and xylazine (10 mg/kg).\n\tNOTE: Use of tiletamine/zolazepam is recommended instead of ketamine because of its adverse effect of hyperglycemia. Optimal anesthesia should be selected for the purpose of the experiments9,27.\nInsert a vascular catheter for the injection.",
    "Apply pressure on the proximal side of the tail with the index and third finger as an alternative to a tourniquet application. Heat the tail with a lamp if needed.\nSterilize the tail vein with a 70% ethanol spray.\nInsert a 30 G catheter into the lateral tail vein. Regurgitation of blood will be visualized in the PE10 tube.\nApply a silk tape on the catheter to stabilize it.\nInject FITC/TMR dextran or other fluorescent probes (25 µg of anti-CD31 conjugated with Alexa 647), as appropriate, according to the combination of fluorescent probes18.\n\t\tNOTE: For fluorescent conjugated antibody probes, inject 2 h before the imaging session.\nTransfer the mouse from the surgical platform to the imaging stage.\nInsert a rectal probe to automatically control the body temperature with the homeothermic heating pad system.\nInsert the pancreatic imaging window into the window holder prepared during the intravital microscopy setup (Figure 2). For an inverted microscope, a window holder might not be required.\nPerform intravital imaging.\n\t\nFor imaging the pancreas, start with a low magnification objective lens (e.g., 4x) for scanning the whole view of the pancreas in the pancreatic imaging window (recommended field of view: 2500 x 2500 µm).\nAfter determination of the region of interest, switch to higher magnification objective lens (20x or 40x) to perform the cellular level imaging (recommended field of view: 500 x 500 µm or 250 x 250 µm). In this experiment, the lateral and axial resolution was approximately 0.5 µm and 3 µm, respectively.\nPerform z-stack or time-lapse imaging to observe the 3D structure or cellular-level dynamics, such as cell migration.",
    "NOTE: For imaging the fluorescent protein expressing cells of transgenic animals (MIP-GFP), 30 s of intermittent 488 nm laser exposure with power up to 0.43 mW was tolerable without noticeable photobleaching or tissue damage. For imaging the fluorescent proteins labeled with Alexa 647, the 640 nm laser power up to 0.17 mW was tolerable without noticeable photobleaching or tissue damage. Prolonged excitation laser exposure with a power above this setting may lead to photobleaching or tissue damage by phototoxicity. Adjust the adequate gain and power to appropriately image the region of interest. Detailed setting of parameters in intravital microscopy must be individualized for each intravital microscopy prepared in the institute.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}