{
  "id": 3642,
  "origin_website": "Cell",
  "title": "Glycomics-informed glycoproteomic analysis of site-specific glycosylation for SARS-CoV-2 spike protein",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nTrypsin digestion of glycoproteins\nTiming: 2 days\nIt is crucial to use pre-washed, clean glassware such as glass tubes and glass pipettes as well as clean plastic tubes in order to reduce the amount of contaminant during sample preparation. Those contaminants may interfere with glycan profiling by MS analysis. The product from trypsin digestion contains peptides, salts, and other contaminants that may interfere with the subsequent PNGase F digestion and therefore needs to be purified.\nPrepare 2 mg/mL trypsin solution in trypsin reaction buffer and mix on vortex mixer.\nReconstitute the purified glycoproteins (25 μg of SARS-CoV-2 spike protein) in 200 μL trypsin buffer.\nHeat the sample for 5 min at 98°C prior to digestion.\nCool down on ice and add 25 μL trypsin solution to the sample\nIncubate the sample at 37°C for 18 h.\nStop the reaction by boiling the sample for 5 min.\nCool down on ice and add equal volume (225 μL) of 10% acetic acid to the sample.\nEquilibrate a C18 cartridge with 3 mL of 100% acetonitrile, followed by 3 mL of 5% acetic acid.\nLoad the sample onto the cartridge, and discard the flow-through.\nRinse the sample tube with 0.5 mL of 5% acetic acid for three times, apply each rinse to the cartridge, and discard the flow-through.\nWash the cartridge with an additional 5 mL of 5% acetic acid, and discard the flow-through.\nElute and collect glycopeptides into three separate 2-mL screw cap tubes:\nFirst elution with 2 mL of 20% 2-propanol\nSecond elution with 2 mL of 40% 2-propanol\nThird elution with 2 mL of 100% 2-propanol\nEvaporate water and 2-propanol with a vacuum concentrator.",
    "Reconstitute the dried second elution (40% 2-propanol elution) in 0.5 mL of 5% acetic acid and pooled with the first elution (20% 2-propanol elution). The third elution (100% 2-propanol) can be used to prepare O-linked glycans.\nEvaporate water and acetic acid with a vacuum concentrator.\nStore the dry glycopeptides at −20°C until use.\nNote: It can be helpful to briefly vortex digestion solution every 15 min for the first hour.\nNote: Use glass pipettes for any organic solvents and acid solutions.\nPause Point: Dry glycopeptides can be stored at −20°C for 3–4 weeks.\nIsolating N-linked glycans released by PNGase F digestion\nTiming: 3–4 days\nN-linked glycans are released from glycopeptides by enzymatic digestion with PNGase F and purified using C18 cartridges. The purified N-linked glycans are ready for permethylation.\nReconstitute dry glycopeptides in 20 μL PNGase F reaction buffer with vortexing and sonication.\nAdd 28 μL of ultrapure water and adjust pH to 7.5 with additional PNGase F reaction buffer if necessary. Adjust total volume of the sample by evaporating excessive buffer with a vacuum concentrator.\nAdd 2 μL PNGase F (0.75 mg/mL) and incubate for 18 h at 37°C.\nAfter incubation, evaporate the reaction with a vacuum concentrator.\nReconstitute the sample in 0.2 mL of 5% acetic acid.\nEquilibrate a C18 cartridge with 3 mL of 100% acetonitrile, followed by 3 mL of 5% acetic acid.\nPlace a clean screw cap glass tube under the cartridge, load the sample, and collect the flow-through.\nRinse the sample tube with 0.2 mL of 5% acetic acid for three times, apply each rinse to the cartridge and collect the flow-through.\nElute with an additional 1.2 mL of 5% acetic acid and collect for a total elution volume of 2 mL.\nElute and collect residual glycopeptides with 2 mL of 100% 2-propanol.",
    "Dry the purified glycans by lyophilization.\nCombine elution from steps 12c and 26 in a glass tube with screw top, and dry under nitrogen stream. The combined glycopeptides can be used to prepare O-linked glycans.\nStore the dry glycans and glycopeptides at −20°C until use. (See Troubleshooting 1[href=https://www.wicell.org#sec7.1])\nNote: Use glass pipettes for any organic solvents and acid solutions.\nPause Point: Dry glycans and glycopeptides can be stored at −20°C for 3–4 weeks.\nReleasing O-linked glycans by reductive β-elimination\nTiming: 3–4 days\nO-linked glycans are released from deglycosylated glycopeptides obtained from steps 1–29 by reductive β-elimination. After reaction, the product contains a large amount of sodium and borate salts as well as small peptides and other contaminants, and therefore needs to be purified. Following desalting and C18 purification, O-linked glycans are ready for permethylation.\nPreparation of reaction reagents for reductive β-elimination.\nPrepare 1 M sodium borohydride in 50 mM sodium hydroxide in a glass tube.\nAdd 0.3 mL of the sodium borohydride solution to the O-linked glycopeptides from step 27.\nCap the glass tube with a PTFE-lined screw cap and dissolve the glycopeptides by sonication for 30 s.\nIncubate at 45°C for 18 h.\nRemove the glass tube from incubation and place it on ice for 10 min.\nKeep the tube on ice while adding 10% acetic acid dropwise into the sample solution until bubbling stops. Vortex and centrifuge the tube repeatedly to avoid any spillover caused by bubbling.\nPrepare a small glass column by breaking the tip of a Pasteur glass pipette using a ceramic cutter.\nPlug the bottom of the glass column with some glass wool, and transfer the activated resin to the glass column (1 mL bed volume).\nWash the resin with 5 mL of 5% acetic acid.",
    "Place a clean glass tube under the glass column for collection, load the sample onto the column, and collect the flow-through.\nElute glycans with additional 3 mL of 5% acetic acid and collect the flow-through.\nDry the glycans by lyophilization.\nAdd 200–300 μL of 10% acetic acid in methanol to the dried glycans. Evaporate under nitrogen stream at 37°C.\nRepeat step 40 for three to five times.\nReconstitute the dry glycans in 200 μL of 5% acetic acid.\nEquilibrate a C18 cartridge with 3 mL of 100% acetonitrile, followed by 5 mL of 5% acetic acid.\nPlace a clean glass tube under the cartridge for collection, load the sample, and collect the flow-through.\nElute with additional 3 mL of 5% acetic acid and collect the flow-through.\nDry the glycans by lyophilization.\nStore the dry glycans at −20°C until use. (See Troubleshooting 2[href=https://www.wicell.org#sec7.3])\nNote: Use glass pipettes for any organic solvents and acid solutions.\nNote: When terminating the reductive β-elimination with 10% acetic acid, the neutralizing reaction can generate a large volume of bubbles in a short period of time and cause spills. Therefore, the acetic acid needs to be slowly added dropwise with intermittent vortexing and centrifugation.\nPause Point: Dry glycans can be stored at −20°C for 3–4 weeks.\nPermethylation of purified N- and O-linked glycans\nTiming: 30–60 min\nFollowing lyophilization, the purified dry glycans are permethylated for MS analysis. (See Troubleshooting 3[href=https://www.wicell.org#sec7.5])\nPrepare the base solution for permethylation\nTransfer 300 μL of sodium hydroxide solution (50%, w/w) to a clean glass tube with screw top.\nAdd 600 μL of anhydrous methanol to the same tube and vortex for 30 s.\nAdd 4 mL of anhydrous dimethyl sulfoxide and vortex for 30 s.\nCentrifuge for 30 to 60 s.\nRemove and discard the supernatant with a glass pipette.",
    "Repeat steps c–e for three to five times until the base slurry becomes translucent.\nDissolve the precipitated base in 3 mL of anhydrous dimethyl sulfoxide by pipetting with a new clean glass pipette\nPermethylate the dry glycans\nAdd 100 μL of anhydrous dimethyl sulfoxide to the dry glycans with a glass pipette and sonicate for 30 s to dissolve the glycans.\nTransfer 200 μL of the base solution to the glycans with a glass pipette.\nAdd 50 μL of methyl iodine quickly with a glass syringe.\nVortex vigorously for 5 min.\nPlace the sample tube on ice.\nAdd 2 mL of dichloromethane to the glycans with a clean glass pipette.\nAdd 2 mL of ultrapure water to the glycans with a glass pipette.\nVortex for 30 s, and centrifuge for 30 s.\nRemove and discard the supernatant (the water phase).\nRepeat steps g–i for three to five times.\nAfter removing water phase as much as possible, transfer the lower phase (organic phase) carefully with a new clean glass pipette to a new glass tube.\nDry the sample solution under nitrogen stream at 37°C.\nStore the permethylated glycans at −20°C until use.\nNote: Use plastic pipettes for the sodium hydroxide solution.\nNote: Use glass pipettes for any organic solvents and acid solutions.\nNote: The base solution can be stored up to 6 h at room temperature (20°C–25°C).\nNote: Methyl iodine used in permethylation is stored at 4°C and needs to sit at room temperature (20°C–25°C) for at least 30 min prior to the reaction.\nPause Point: Permethylated glycans can be stored at −20°C for 3–4 months.\nAnalyzing N- and O-linked glycans by mass spectrometry\nTiming: 1 week",
    "The permethylated glycans are reconstituted and analyzed by directly infused into a mass spectrometer. Data annotation and assignment of glycan accession identifiers are performed manually and can be facilitated by software.\nReconstitute permethylated glycans in 100% methanol: glycans derived from the equivalent of 5–15 μg of purified glycoproteins are reconstituted in 30–50 μL of 100% methanol.\nTransfer 10 μL of the reconstituted glycans to a small glass vial using a clean glass syringe.\nAdd 40 μL of 1 mM sodium hydroxide or sodium acetate in 50% methanol to the glycans and mix by vortexing.\nGlycans are loaded into a glass syringe, directly infused into the nano-electrospray ion source of an LTQ-Orbitrap Discovery mass spectrometer (Thermo Fisher Scientific), and analyzed by MS/MS.\nThe flow rate is set at 0.4–0.6 μL/min and the capillary temperature is set at 210°C.\nThe total ion mapping (TIM) functionality of the Xcalibur software package (v 2.0, Thermo Fisher Scientific) is utilized to detect and quantify the prevalence of individual glycans in the total glycan profile. Through TIM, automated MS and MS/MS spectra (at 30–40% normalized collision energy via collision induced dissociation) are acquired in collection windows that are 2.8 mass units in width. Five scans, each 150 ms in duration, are averaged for each collection window. The m/z range from 500 to 2,000 is scanned in successive 2.8 mass unit windows with a window-to-window overlap of 2 mass units.",
    "Glycan species are identified by manual interpretation of the raw spectra as well as by using tools such as GRITS Toolbox (Weatherly et al., 2019[href=https://www.wicell.org#bib8]), GlyGen (York et al., 2020[href=https://www.wicell.org#bib9]), GNOme (OBO Foundry), and GlyTouCan (Aoki-Kinoshita et al., 2016[href=https://www.wicell.org#bib1]). Manual interpretation of glycan mass spectra may be carried out as reported previously (Ashline et al., 2014[href=https://www.wicell.org#bib2]). N-linked glycan peaks of all charge states are deconvoluted by charge state and summed for quantification using the Xtract functionality of the Xcalibur software package (v 2.0, Thermo Fisher Scientific). O-linked glycan peaks of all charges are manually collected and summed for quantification.\nNote: The amount of glycans required for MS analysis depends on sample quality, such as the purity and the origin of the sample (tissue or cell types). Information on the level of glycosylation (the number of glycosylation sites and their occupancy) of the sample is also very important and sometimes unknown. The amount of injection may need to be adjusted to enhance quality of MS profile (Mehta et al., 2016[href=https://www.wicell.org#bib6]).\nNote: In TIM, the 2.8 mass unit window allows signals from the naturally occurring isotopes of individual glycans to be summed into a single response, increasing detection sensitivity for minor structures. The 2 mass unit overlap ensures that minor glycans, whose masses place them at the edge of an individual window, would be sampled in a representative fashion.\nNote: For detail MSn analysis to determine glycan linkage, 1 mM of lithium acetate in 50% methanol is preferred.\nNote: Manual interpretation of glycan spectra can be facilitated by the resources provided by Expasy (www.expasy.org[href=http://www.expasy.org]). The computational tools provided via Expasy can help calculating the m/z values of unmodified peptides, peptides modified with glycans, and released glycans with and/or without derivatization.\nOptional: Permethylated glycans can also be analyzed by MALDI-TOF-MS.",
    "Preparing intact N-linked glycopeptides\nTiming: 3 days\nPreparing intact N-linked glycopeptides for mass spectrometry analysis.\nPrepare four aliquots of SARS-CoV-2 spike protein (20–100 pmol for each aliquot) and reduce the proteins by incubating each aliquot with 10 mM of dithiothreitol at 56°C for 1 h.\nAlkylate each aliquot by incubating with 27.5 mM of iodoacetamide at room temperature (20°C–25°C) in dark for 45 min.\nDigest four aliquots of proteins by incubating them with respective proteases:\nIncubate aliquot #1 with alpha lytic protease at an enzyme-to-protein ratio of 1:30 (w/w) at 37°C for 18 h, and deactivate the enzyme by incubating at 100°C for 5 min.\nIncubate aliquot #2 with chymotrypsin at a ratio of 1:20 (w/w) at 25°C for 8 h, and deactivate the enzyme by incubating at 100°C for 5 min.\nIncubate aliquot #3 with trypsin at a ratio of 1:20 (w/w) at 37°C for 18 h, and deactivate the enzyme by incubating at 100°C for 5 min.\nIncubate aliquot #3 with Glu-C at a ratio of 1:20 (w/w) at 37°C for 18 h, and deactivate the enzyme by incubating at 100°C for 5 min.\nIncubate aliquot #4 with Glu-C at a ratio of 1:20 (w/w) at 37°C for 18 h, and deactivate the enzyme by incubating at 100°C for 5 min.\nIncubate aliquot #4 with Asp-N at a ratio of 1:20 (w/w) at 37°C for 8 h, and deactivate the enzyme by incubating at 100°C for 5 min.\nAcidify and dry down each aliquot in a vacuum concentrator.",
    "Note: For choosing proper proteases to be used in the digestion of the target protein, inspect the protein sequence for cleavable amino acids as well as the N-linked glycosylation sequons (Asn-x-Ser/Thr/Cys, Asn-Gly-x sequences) and choose the proteases that can generate reasonable sized peptides (5 to 15 amino acids) containing the sequons for mass spectrometry analysis.\nAnalyzing intact N-linked glycopeptides by mass spectrometry\nTiming: 4 weeks\nMass spectrometry analysis of intact N-linked glycopeptides.\nReconstitute each aliquot in 0.1% formic acid, inject approximately 20–30 pmol of each aliquot, and analyze by LC-MS/MS.\nSeparate peptides of each aliquot on an Acclaim PepMap RSLC C18 column (75 μm × 15 cm) while eluting into the nano-electrospray ion source of an Orbitrap Fusion Lumos Tribrid mass spectrometer (Thermo Fisher Scientific) at a flow rate of 0.2 μL/min. The elution gradient consists of 1%–40% acetonitrile in 0.1% formic acid over 370 min followed by 10 min of 80% acetonitrile in 0.1% formic acid.\nFull MS scans are acquired from m/z 200 to 2,000 at 60k resolution, and MS/MS scans following higher-energy collisional dissociation (HCD) with stepped collision energy (15%, 25%, 35%) are collected in the orbitrap at 15k resolution.\nAnalyze the raw spectra by pGlyco (Liu et al., 2017[href=https://www.wicell.org#bib5]) and Byonic (Bern et al., 2012[href=https://www.wicell.org#bib3]) followed by manual validation.\nNote: Injection volumes depend on the sample loop equipped with individual LC instruments. For our particular LC instrument, the injection loop is 20-μL in volume, so our injection volume was approximately 17 μL.\nNote: Injection amounts depend on the capacity of the analytical columns equipped with individual LC instruments. For our particular LC instrument, the analytical column performs best at approximately 20–30 pmol of peptides (3–4 μg of SARS-CoV-2 spike protein).",
    "Note: Manual interpretation of glycopeptide spectra can be facilitated by the resources provided by Expasy (www.expasy.org[href=http://www.expasy.org]). The computational tools provided via Expasy can help calculating the m/z values of unmodified peptides, peptides modified with glycans, and released glycans with and/or without derivatization.\nPreparing intact O-linked glycopeptides\nTiming: 4 days\nPreparing intact O-linked glycopeptides for mass spectrometry analysis.\nPrepare three aliquots of SARS-CoV-2 spike protein (20–100 pmol for each aliquot) and reduce the proteins by incubating each aliquot with 5 mM of dithiothreitol at 56°C for 1 h.\nAlkylate each aliquot by incubating with 13.75 mM of iodoacetamide at room temperature (20°C–25°C) in dark for 45 min.\nDigest three aliquots of proteins by incubating them with respective proteases:\nIncubate aliquot #1 with Lys-C/trypsin mix at an enzyme-to-protein ratio of 1:20 (w/w) at 37°C for 18 h, and deactivate the enzyme by incubating at 100°C for 5 min.\nIncubate aliquot #2 with Lys-C at a ratio of 1:20 (w/w) at 37°C for 18 h, and deactivate the enzyme by incubating at 100°C for 5 min.\nIncubate aliquot #3 with Arg-C at a ratio of 1:20 (w/w) at 37°C for 18 h, and deactivate the enzyme by incubating at 100°C for 5 min.\nDeglycosylate each aliquot by incubating with PNGase F at 37°C for 40 h, and deactivate the enzyme by incubating at 100°C for 5 min.\nPerform a second digest of three aliquots by incubating them with respective proteases:\nIncubate aliquot #1 with Lys-C/trypsin mix at an enzyme-to-protein ratio of 1:20 (w/w) at 37°C for 8 h, and deactivate the enzyme by incubating at 100°C for 5 min.\nIncubate aliquot #2 with Lys-C at a ratio of 1:20 (w/w) at 37°C for 8 h, and deactivate the enzyme by incubating at 100°C for 5 min.",
    "Incubate aliquot #3 with Arg-C at a ratio of 1:20 (w/w) at 37°C for 8 h, and deactivate the enzyme by incubating at 100°C for 5 min.\nAcidify and dry down each aliquot in a vacuum concentrator.\nAnalyzing intact O-linked glycopeptides by mass spectrometry\nTiming: 4 weeks\nMass spectrometry analysis of intact O-linked glycopeptides.\nReconstitute each aliquot in 0.1% formic acid, inject approximately 20–30 pmol of each aliquot, and analyze by LC-MS/MS.\nSeparate peptides of each aliquot on an Acclaim PepMap RSLC C18 column (75 μm × 15 cm) while eluting into the nano-electrospray ion source of an Orbitrap Fusion Lumos Tribrid mass spectrometer (Thermo Fisher Scientific) at a flow rate of 0.2 μL/min. The elution gradient consists of 1%–40% acetonitrile in 0.1% formic acid over 370 min followed by 10 min of 80% acetonitrile in 0.1% formic acid.\nFull MS scans are acquired from m/z 200 to 2,000 at 60k resolution, and MS/MS scans following higher-energy collisional dissociation (HCD) with stepped collision energy (15%, 25%, 35%) or electron transfer dissociation (ETD) are collected in the orbitrap at 15k resolution.\nAnalyze raw spectra by Byonic (Bern et al., 2012[href=https://www.wicell.org#bib3]) followed by manual validation.\nNote: Injection volumes depend on the sample loop equipped with individual LC instruments. For our particular LC instrument, the injection loop is 20-μL in volume, so our injection volume was approximately 17 μL.\nNote: Injection amounts depend on the capacity of the analytical columns equipped with individual LC instruments. For our particular LC instrument, the analytical column performs best at approximately 20–30 pmol of peptides (3–4 μg of SARS-CoV-2 spike protein).",
    "Note: Manual interpretation of glycopeptide spectra can be facilitated by the resources provided by Expasy (www.expasy.org[href=http://www.expasy.org]). The computational tools provided via Expasy can help calculating the m/z values of unmodified peptides, peptides modified with glycans, and released glycans with and/or without derivatization."
  ],
  "subjectAreas": [
    "Proteomics",
    "Mass Spectrometry",
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}