{
  "id": 9759,
  "origin_website": "Jove",
  "title": "Assessment of Social Interaction Behaviors",
  "procedures": [
    "1. Equipment  and Room Set Up:\nThe apparatus for Crawley's sociability and preference for social novelty test is comprised a rectangular, three-chamber box. Each chamber is 19 x 45 cm and the dividing walls are made from clear Plexiglas, with an open middle section, which allows free access to each chamber.\nUse two identical, wire cup-like containers with removable lids that large enough to hold a single mouse.  These are placed vertically inside the apparatus, one in each side chamber, and will contain the naíve/unfamiliar mouse. Each container is comprised of  metal wires to allow for air exchange between the interior and exterior of the cylinder but small enough to prevent direct physical interactions between an animal on the inside with one on the outside.\nBehavioral testing should be performed between 9:00am and 6:00 pm.\nGeneral room lighting is 650 lux.\nEmploy Observer 6.0 (Noldus) program (or a suitable alternative) to monitor and record the observation and follow up parameters, mentioned in section 4.3.\nAfter each trial, clean all chambers with 70% ethanol (between mice) and then with Clidox 1:5:1 (between the cages) to prevent olfactory cue bias and to ensure proper disinfection, respectively.\nThe person who makes the observation has to be at least 2 meters away from the apparatus.\n2. \tAnimal Preparation:\nHouse three to five mice per cage in a room with a 12 hr light/dark cycle (lights on at 7:00 am) with ad libitum access to food and water, according to standards and requirements of local Animal Care Committee guidance and protocols.\nTransfer all the cages containing mice into the behavioral room 30 minutes before the first trial begins.",
    "There are two classes of mouse required for this experiment, one which acts as a control, naíve or \"unfamiliarized\" animal and one that is the test subject. For the control mouse use a mouse of the same background (usually C57BL6), age (usually 8-12 weeks old), gender and weight, without any prior contact (not littermates) with the subject mouse. Two control mice are required per experiment, one is used for session I and another for session II. The same control mice may be used between trials.\n3. \tHabituation (adaptation):\nIsolate the right and left compartments by using the dividing Plexiglass walls.\nPlace empty wire containment cups in the middle of right and left chamber (one per each site).\nPlace the subject mouse at the center of the middle chamber for adaptation.\nHabituate for 5 minutes.\n4. \tSocial Affiliation Aspect of the Test (session I):\nPlace one of the control mice (\"Stranger 1\") inside a wire containment cup that is located in one of the side chambers. The placement of Stranger 1 in the left or right side of the chamber is systematically altered between trials.\nRemove the walls between the compartments, to allow free access for the subject mouse to explore each of the three chambers.\nImmediately, begin monitoring and recording the following parameters:\nduration and\nnumber of direct (active) contacts between the subject mouse and the containment cup housing or not housing the Stranger 1 mouse, for each chamber individually. Direct contact between the subject mouse and the containment cup, or stretching of the body of the subject mouse in an area 3-5 cm around the cup is counted as an active contact;\nduration and",
    "number of other behaviors by the subject mouse in each compartment, including walking, self-grooming, lack of any body movements for more than 5 seconds (\"freezing\"), as well as unusual behavior, such as jumping, repetitive behavior, etc;\nduration and\nnumber of entries to each compartment. The mouse is considered to be in the chamber when its head and four paws have entered into the chamber.\nThe duration of session I is 10 minutes.\n5. \tSocial Novelty/preference Session of the Test (Session II):\nPlace a second control mouse (\"Stranger 2\") inside an identical wire containment cup in the opposite side chamber (that had been empty during the Session I).  Monitor the same parameters described in 4.3, differentiating the behaviors between the subject mouse in the presence of Stranger 1 compared with Stranger 2.\nThe duration of session II is 10 minutes.\n6. Statistical Analysis:\nBy using the Origin 6.0 program (or a suitable alternative) analyze the following parameters, using the recorded data:\nthe total number of contacts and\ntotal duration of contacts between experimental mouse and empty containment cup vs or cup housing Stranger 1 (in session I), or between experimental mouse and the cup housing Stranger 1 vs Stranger 2 (in session II);\nmean duration per contact;\ntotal number and duration of other behaviors (freezing, self-grooming, walking)\ntotal time spent by the subject mouse in each compartment.\nAnalyze the significant differences for each of the aforementioned parameters, by comparing the groups:\n\"Empty\" containment cup  vs \"Stranger 1\" for a wild type (WT) subject\n\"Empty\" containment cup vs \"Stranger 1\" for the experimental mouse  (e.g. a knockout, transgenic or drug-treated mouse, etc.).\n\"Stranger 1\" vs \"Stranger 2\" for a WT subject\n\"Stranger 1\" vs \"Stranger 2\" for the experimental mouse (knockout, transgenic, or drug-treated, etc.).",
    "Present each dataset of the aforementioned parameters as Session I: WT and experimental subjects; Session II: WT and experimental subjects, as shown in Figure 1(A and B) and 2(A and B), respectively.\nIt is also advisable to take into consideration other parameters, which help in standardizing this test, such as prior experience in recognizing specific mouse behavioral patterns, such as sniffing, grooming, rubbing, fighting, mounting, which can be largely dependent on subjective personal observation. The person acting as the recorder of the behavioral parameters during the test should be blind to the genotype or treatment conditions and this information decoded afterwards.\n7.  Representative Results:\nAn example of the two steps of the social interaction test is shown in Figures 1 and 2. The first session of the test allows estimation of social affiliation and motivation of the subject mouse. In this part of the test, the stranger mouse was enclosed in a circular wire cup that allowed nose contact, but prevented fighting between mice. These conditions ensure that social approaches are initiated by the subject mouse and are investigatory only, without direct physical contact. The mouse has the choice to spend more time around the containment cup containing the stranger mouse or to avoid any contact by moving to the compartment with the empty cup. Other parameters, such as number of individual contacts, can be used in additional to duration spent near to the stranger mouse.",
    "Typically, a wild type animal will spend significantly more time in the compartment with Stranger 1 compared to the compartment with empty cup (Figure 1A), indicating normal sociability, social motivation and affiliation. In GSK-3α knockout mice, for example, there are no significant differences between the time spent with empty cup compared to the cup containing stranger 1 (Figure 1B), indicating impaired sociability in these animal model 6.\nThe second session of the test is designed to estimate social novelty and social memory. In this part, the subject mouse has a free choice between the first, already-investigated, unfamiliar mouse (Stranger 1), and a novel unfamiliar mouse (Stranger 2). Usually, a WT animal recalls its previous contact with Stranger 1, and, in this session, tends to spend more time with the newly encountered mouse (Stranger 2), indicating intact social memory and predilection for novel experiences (Figure 2A).\nUnlike wild-type mice, GSK-3α mutant animals do not show preference for the chamber containing a newly introduced mouse (Stranger 2) over a chamber containing a now familiar mouse (Stranger 1) in session II (Figure 2B). Indifferent behavior of KO mice in this test is indicative of decreased social motivation and novelty.\n imgsrc://cloudfront.jove.com/files/ftp_upload/2473/2473fig1.jpg\nFigure 1. Session I: Social affiliation and sociability. Mean length of time (±SEM) in the chamber with the stranger (\"stranger side\") compared to the opposite chamber (\"empty side\"). Unlike WT males (A), KO (B) animals failed to demonstrate a preference for social proximity by spending same time in both chambers.  ***p ≤ 0.0001 in WT group.\n imgsrc://cloudfront.jove.com/files/ftp_upload/2473/2473fig2.jpg",
    "Figure 2. Session II: Social memory and novelty. Mean duration of time (±SEM) in the chamber with the unfamiliar mouse from the sociability phase (\"Stranger 1\") and in the opposite chamber with a new unfamiliar mouse (\"Stranger 2\"). Unlike WT males (A), KO (B) animals failed to demonstrate a preference for social novelty by spending same time in both chambers.  ***p ≤ 0.0001 in WT group."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}