{
  "id": 14777,
  "origin_website": "Jove",
  "title": "Streptavidin-Affinity Grid Fabrication for Cryo-Electron Microscopy Sample Preparation",
  "procedures": [
    "1. Preparation of reagents\nDilute commercially purchased streptavidin to a final concentration of 0.5 mg/mL in crystallization buffer (50 mM HEPES pH 7.5, 150 mM KCl, 5 mM EDTA, 10% trehalose). Make sure that the final trehalose concentration is 10%. Flash-freeze aliquots of 25-50 µL in liquid nitrogen and store at -80 ˚C.\nDissolve 1,2-dipalmitoyl-sn-glycero-3-phosphoethanolamine-N-(biotinyl) sodium salt into 65:35:8 v/v/v chloroform/methanol/water solvent for a final lipid concentration of 1 mg/mL. Store single use aliquots of 20-30 µL at -80 ˚C in glass vials.\n\tNOTE: Preparation of solvent is more accurate if done by weight. First, combine 1.85 g of ultrapure water with 6.41 g of high-performance liquid chromatography (HPLC) grade methanol and add this to 22.42 g of chloroform to prepare the solvent.\n\t​CAUTION: Please read and understand manufacturers' safety data sheets and recommended instructions for the handling and disposal of chloroform and methanol organic solvents before beginning this protocol. Avoid direct contact of methanol with the skin.\n2. Pretreatment of grids\nWash carbon foil on gold mesh grids by dipping twice into 100% chloroform and once into 100% ethanol. Place grids on clean filter paper to dry. Repeat the washing process for a total of three cycles.\n\tNOTE: Reproducible success has been achieved with commercially available carbon foil grids that have a carbon film of 10-12 nm thick carbon (see material list) with hole sizes ranging from 0.6-2 µm. Commercially available gold foil grids and homemade holey-carbon grids prepared following the Rubinstein Laboratory's nanofabrication protocol14 have also been successfully used. Less reproducible results have been obtained with commercially available grids that have thinner carbon films. Do not use copper grids, as copper reacts with any organic amines that may be in the sample.",
    "After the grids dry, evaporate a 2.5-5 nm thick layer of carbon onto the carbon side of the holey-carbon grids. Carbon thickness is controlled with quartz crystal film thickness measurement that is built into the carbon evaporator provided in the Table of Materials file.\nAllow the newly evaporated carbon to age (i.e., become more hydrophobic) for 1 week.\n3. Preparation of streptavidin lattice\nNOTE: To grow 2D streptavidin crystals on the holey-carbon EM grids, first, a biotinylated lipid monolayer is applied to the holes of the carbon film (Figure 1B) by Langmuir-Schaefer transfer. The lipid monolayer is formed following the subsequent steps (Figure 2). Talcum powder creates a boundary between the castor oil and the Petri dish, and a thin layer of castor oil helps to maintain constant surface pressure when the lipid monolayer is formed. The side containing the evaporated carbon from step 2.2 is used to pick up the monolayer, excess lipids are washed away with crystallization buffer, and streptavidin solution is incubated on the grid for crystallization.\nClean the bench area with 70% ethanol.\nRinse a 5 µL glass syringe several times with chloroform to clean. Allow the syringe to completely dry before use.\nWash carbon-evaporated grids again, i.e., just before use, by dipping them into 100% ethanol. Let the grids dry on clean filter paper.\nWhile grids are drying, wash each anti-capillary tweezer with 100% chloroform and 100% ethanol. Allow the tweezers to completely dry.\nOn the clean side of parafilm, prepare three 50 µL drops of crystallization buffer (50 mM HEPES pH 7.5, 150 mM KCl, 5 mM EDTA, 10% trehalose) for each grid that will be made.",
    "Fill the lid of a 35 mm uncoated Petri dish with crystallization buffer (50 mM HEPES pH 7.5, 150 mM KCl, 5 mM EDTA, 10% trehalose). Clean the surface with lens paper.\nSprinkle scientific-grade talcum powder around the perimeter of the Petri dish. This subsequently serves as an indicator, in the next step, of how far the castor oil has spread. Add enough talcum powder to create a barrier that protects the castor oil from touching the edge of the Petri dish. Adding too much talcum powder limits the available space to make the lipid monolayer.\nDip a 200 µL pipette tip into the castor oil to obtain a medium-sized drop (approximately 20 µL) that hangs from the pipette tip. Touch this drop to the surface of the buffer in the Petri dish, where it will spread to form a uniform film. The resulting thin film of oil serves as a piston15, which maintains a constant surface pressure when a lipid monolayer is formed (step 3.10).\n\tNOTE: It is important to add enough castor oil rather than too little, and it is better to add as one single drop. Allow the castor oil to spread fully before making the lipid monolayer.\nRinse the 5 µL glass syringe one or two times with the dissolved lipid before taking up an aliquot for use. Avoid creating air bubbles in the lipid that fills the syringe.\n\tNOTE: The glass syringe is rinsed with dissolved lipid in case any residual chloroform remains from step 3.2. Residual chloroform can affect the quality of the resulting monolayer.",
    "Dispense the smallest possible volume (~0.5 µL) of lipid from the syringe and gently touch the hanging droplet to the surface of the castor oil film. Note that the lipid solution breaks through the castor oil film at the point of contact and that the resulting lipid monolayer forms a circle in the center of the thin film of castor oil.\n\t\nAdd several drops of lipid sequentially or add more lipid after making some grids, but if too much is added, the lipid will spread past the boundary of the castor oil and into the perimeter where the talcum powder and any contaminating surfactant have been sequestered. If this occurs, the process will need to be restarted.\nPick up a grid with an anti-capillary tweezer so that the straight arm of the tweezer and the carbon-evaporated side of the grid both face the monolayer.\nTransfer part of the monolayer to the holey carbon by touching the carbon-evaporated side of the grid to the monolayer for 1-2 s.\n\tNOTE: Successful transfer is indicated by the surface of the grid becoming hydrophilic, causing a thin, spherical cap of buffer to cover the entire grid after it has been lifted away from the Petri dish.\nTouch the spherical cap of the buffer that now adheres to the grid, sequentially for 1 s each, to the three 50 µL drops of crystallization buffer that were prepared on parafilm in step 3.5.\n\tNOTE: This step tries to remove as much as possible of the excess lipid, which covers the surface of the spherical cap (rather than the formerly hydrophobic carbon film), in order to avoid formation of lipid vesicles when samples are viewed in the electron microscope.",
    "Carefully add 4 µL of 0.5 mg/mL streptavidin into the remaining spherical cap of crystallization buffer on the grid.\nPlace the grid in a humidity chamber. Repeat steps 3.11-3.14 for the entire batch of grids.\nIncubate the grids at room temperature (RT) for 2 h inside a humidity chamber to avoid evaporation.\n\tNOTE: It is important that the gold side of the grid does not become wet at any point after the monolayer has been applied.\nAfter the 2 h incubation, prepare one 300 µL drop of rinse buffer (10 mM HEPES, pH 7.5, 50 mM KCl, 5 mM EDTA, 10% trehalose) for each grid on the clean side of parafilm.\n\tNOTE: The rinse buffer contains 50 mM KCl rather than 150 mM KCl, which is in the crystallization buffer used for steps 3.5-3.6.\nWash the excess (unbound) streptavidin by placing the grid onto the 300 µL drop of rinse buffer. Perform steps 3.18-3.20 for one grid at a time. Avoid leaving the grids on the 300 µL rinse buffer drop for extended periods of time.\n\tNOTE: Only one wash is performed because the streptavidin crystal/monolayer is fragile at this point. Each time that a grid is lifted away from the surface of a drop of wash buffer, the liquid bridge between the grid and the wash drop is ruptured. At the time of rupture, a transient pressure gradient (suction pressure) is applied to the self-supported monolayer crystals that span the open holes of the carbon film. This suction pressure is expected to cause transient doming of the monolayer crystal, accompanied by expansion of the area covered by the crystals. If the increase in the area exceeds the elastic limit of the crystal, the crystal may fracture or become disordered.",
    "Immediately dry the anti-capillary tweezers with a lint-free wipe to facilitate the release of the grid onto filter paper in the following step. Pick up the grid floating on the drop of rinse buffer by sticking the kinked arm of the anti-capillary tweezer into the drop.\nBlot away the excess buffer gently from the side with filter paper. Place the grid on filter paper with the gold side down, repeat steps 3.18-3.20 for each grid, and allow the grids to dry for 15-20 min.\nAfter the grids are dry, flip them over so that the gold side is now facing up. Evaporate a thin layer of carbon (approximately 0.5-2 nm thick) onto the gold side of the grids.\n\tNOTE: Store grids at a constant humidity, the value of which does not seem to matter, noting that multiple changes in relative humidity are expected to result in cycles of expansion and contraction. Allow grids to age for 1 week before cryo-EM use for best results because the hydrophobicity of the back side of the grid may be important for monolayer stability. Grids are stable for long periods of time, but after 3 months, the backside carbon may become less hydrophobic.\n4. Checking streptavidin affinity grid batch quality by negative stain\nPrepare two drops of 50 µL and one drop of 100 µL of sample buffer (50 mM HEPES pH 7.5, 50 mM KCl, 0.5 mM TCEP) on the clean side of parafilm.\nRemove the trehalose and rehydrate streptavidin grids by touching the two 50 µL drops and let the grid float on the 100 µL drop of sample buffer for 10 min.",
    "NOTE: It is best to avoid using detergent during the rehydration and subsequent sample-binding incubations. The buffer will disperse to the gold side of the grids and limit the efficiency of washes to remove excess samples.\nAfter rehydrating, pick the grid up with an anti-capillary tweezer so that the kinked arm of the anti-capillary tweezer is in the drop.\nGently blot the excess buffer away from the side and quickly reapply 4 µL of 75-100 nM sample (optional).\n\tNOTE: Avoid letting the grid dry after rehydration.\nIncubate the sample in a humidity chamber for 1-5 min.\n\tNOTE: Concentration and incubation times will be sample-dependent and should be optimized. The provided sample concentration and incubation time are suggested starting points.\nOn the clean side of parafilm, set up four drops of 30 µL each of both sample buffer and 1% uranyl formate (UF) stain.\n\tNOTE: Please read and understand manufacturers' safety data sheets and recommended instructions for the handling and disposal of uranyl formate before performing this step. Uranyl formate is a toxic and radioactive compound. Make sure to obtain prior institutional approval for the use of radioactive material.\nWash away the unbound sample by touching each of the four drops of sample buffer.\nStain the sample using standard negative stain procedures with UF. Gently blot away UF stain from the side, leaving a very thick layer of stain on the grid. An additional 0.5 µL of stain can be applied to the grid after blotting to make the stain thicker if needed. Allow the grid to air dry.",
    "​NOTE: Since the streptavidin grids are very hydrophilic, negative stain tends to form a very uniform film everywhere, contrary to what is commonly seen when using glow-discharge treated, continuous carbon grids. As a result, it is recommended to leave a thicker film of stain solution.\n5. Freezing streptavidin affinity grids with biotinylated samples\nNOTE: The following procedure is intended for a one-sided automated plunger that contains an internal blotting sensor (one-sided manual blotting in other automated plunging apparatus is also possible)\nPrepare two drops of 50 µL and one drop of 100 µL of sample buffer (e.g., 50 mM HEPES pH 7.5, 50 mM KCl, 0.5 mM TCEP) on the clean side of parafilm.\nRehydrate streptavidin grids by touching the two 50 µL drops and let the grid float on the 100 µL drop of sample buffer for 10 min.\nAfter rehydrating, pick the grid up with an anti-capillary tweezer so that the kinked arm of the anti-capillary tweezer is in the drop.\nGently blot the excess buffer away from the side and quickly apply 4 µL of 75-100 nM sample.\nIncubate the sample in a humidity chamber for 1- 5 min.\n\tNOTE: Again, concentration and incubation times will be sample-dependent and should be optimized. The provided sample concentration and incubation time are suggested starting points. For samples at low concentrations, one can incubate for longer time periods and/or bind the sample to the grids several times.\nPrepare two 10 µL drops of freezing buffer (e.g., 50 mM HEPES pH 7.5, 50 mM KCl, 0.5 mM TCEP, 3% trehalose, 0.01% NP40) on the clean side of parafilm. After incubation, wash the unbound sample by touching the grid to the first drop of the freezing buffer. Drop the grid onto the second drop of the freezing buffer.",
    "Quickly grab the edge of the grid with the tweezers attached to the one-sided automated plunger. Gently blot away excess buffer and quickly apply 4 µL of freezing buffer (50 mM HEPES pH 7.5, 50 mM KCl, 0.5 mM TCEP, 3% trehalose, 0.01% NP40) to the grid.\nAttach tweezers to the one-sided automated plunger. The best results have been obtained using a blot sensor that detects the liquid drop on the grid with blot times between 4-6 s. Conditions will vary depending on the sample and buffer used.\n6. Data processing of cryo-EM movies collected from streptavidin affinity grids\nData collection on streptavidin affinity grids can be performed as with standard grids, and no special microscope adjustments are necessary. However, the procedure detailed here removes the streptavidin signal only after motion correction of the micrograph. Therefore, data processing steps such as particle polishing that rely on original movie frames cannot be reliably performed. The streptavidin signal subtraction (required for all standard downstream processing except for CTF estimation) here requires Matlab version R2014b or newer running on a Linux environment. Signal subtraction relies on the crystalline nature of the streptavidin layer, which allows for peak masking and, hence, signal removal from the Fourier transform of each micrograph.\nSetting up the processing scripts\n\t\nCopy all files from Supplemental Files into a dedicated folder within the project directory\nPrepare a directory called processing_scripts that includes the following files:\nlsub.m (Supplemental Coding File 1; the subtraction script)\nprocess_subtration.sh (Supplemental Coding File 2; wrapper script that loops over all available micrographs, spawns parallel jobs, and keeps track of the input and output)\nprocess_subtraction.cfg (Supplemental Coding File 3; configuration file that contains the parameters for the subtraction job, see 6.2)\nPrepare a directory called support_scripts that includes the following files:\n\t\tbg_drill_hole.m (Supplemental Coding File 4)",
    "bg_FastSubtract_standard.m (Supplemental Coding File 5)\n\t\tbg_Pick_Amp_masked_standard.m (Supplemental Coding File 6)\n\t\tbg_push_by_rot.m (Supplemental Coding File 7)\n\t\tReadMRC.m (Supplemental Coding File 8)\n\t\tWriteMRC.m (Supplemental Coding File 9)\n\t\tWriteMRCHeader.m (Supplemental Coding File 10)\nAdjust the configuration file as needed (process_subtraction.cfg, (refer to Figure 3) as needed:\n\t\nInput: Path to the directory that contains the motion-corrected micrographs in mrc format. Use either a directory or a pattern including wild cards (?, *).\n\t\tExample:\n\t\tinput=\"/path/to/project_directory/micrographs/\"\n\t\tor\n\t\tinput=\"/path/to/project_directory/micrographs/*.mrc\"\noutput_dir: Path to the directory to which the lattice subtracted micrographs should be written.\nonly_do_unfinished: Specify (true|false) if pre-existing subtracted micrographs should be overwritten or skipped. This parameter is useful for starting the lattice subtraction script in the middle of a microscope session (default: true).\nnum_parallel_jobs: Specify the number of parallel jobs. This number depends on the hardware specifications used for processing and should not be higher than the number of cores available. On systems with 32 cores and a network filesystem, optimal performance was achieved with 14 parallel jobs. For best performance, optimize this value with a subset of micrographs.\nPad_Origin_X: 200 for a K3 detector in portrait orientation (image width < image height) or when using a square detector (Falcon III, Falcon IV, K2), 1000 for a K3 detector in landscape orientation (image width > image height). FFT is performed in square boxes and padding is required if the detector has non-square dimensions.\nPad_Origin_Y: 1000 for a K3 detector in portrait orientation (image width < image height), 200 when using a square detector (Falcon III, Falcon IV, K2) or if using a K3 detector in landscape orientation (image width > image height).\nDo not change the Inside_Radius_Ang (90) and Outside_Radius_Ang (3.0). The lattice subtraction is performed between two resolutions (unit is in angstrom).\nPixel_Ang: Provide the pixel size as a floating point value.",
    "Threshold: Subtraction threshold cutoff value to replace the lattice with the background in Fourier space. Successfully used values are between 1.4-1.6. Use 1.42 as a starting point.\nDo not change expand_pixel (10) and pad_out_opt (0). expand_pixel is a diameter value used for masking around pixels with values higher than the threshold cutoff. pad_out_opt is an option that decides whether a padded area is included in the output.\naddpath_m: Path to the support scripts.\npath_to_matlab_bin: Path to the system's Matlab installation bin directory.\npath_matlab_script: Path to the matlab substraction script (lsub.m ) that has been copied above under step 6.1.2.\nAfter saving the modified script, run the script (bash ./process_subtraction.sh ) to subtract the streptavidin signal from the input micrographs. The script can be interrupted and/or restarted if the parameter only_do_unfinished is set to true (see in step 6.2.3). If an error occurs, review the parameters specified in the bash script. Ensure that there are no unintended spaces between parameter variables and their assigned values, as this is a common source of mistakes.\nUse the lattice subtracted images for standard cryo-EM image processing."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}