{
  "id": 2222,
  "origin_website": "Cell",
  "title": "Flow cytometry analysis of endothelial cells and subsets of exhausted CD8+ T cells in murine tumor models",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nSample collection\nTiming: 5 min/mouse\nThis part details how to resect subcutaneous tumors from tumor-bearing mice.\nEuthanize tumor-bearing mice by CO2 inhalation or other approved method.\nSubcutaneous tumors grow on the shaved flanks of mice. Tumor length and width can be measured using calipers (Figure 1[href=https://www.wicell.org#fig1]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1696-Fig1.jpg\nFigure 1. Tumor resection\n(A) Subcutaneous tumor 10 days after inoculation of tumor cells (MCAprog).\n(B) Visualization of the tumor and the draining lymph node (dLN) following initial dissection.\nPlace the animal on its back on a dissection mat, pin the paws on the mat and wet the fur with 70% ethanol.\nMake an incision in the abdominal area above the urethral opening, without penetrating the abdominal wall, and extend the incision until the neck with a pair of scissors.\nOn the tumor-bearing side of the mouse, extent the incision to hind and forelegs and pin the loose skin on the mat. The flank subcutaneous tumor and the draining inguinal lymph node (dLN) should be seen (Figure 1[href=https://www.wicell.org#fig1]B).\nUsing a pair of scissors and forceps, clean up the tumor area by removing fat and take off the draining inguinal lymph node to avoid contamination during tumor resection.\nUsing a scalpel, delicately harvest the tumor and ensure that skin is not collected during the procedure.\nWeigh the tumor and transfer it in a collection tube pre-filled with 1 mL Sample buffer.\nPlace the tube on ice and work on the next mouse.\nNote: From sample collection to sample processing and staining, maintain tissue and cells on ice.\nSample processing\nTiming: 1.5–2 h\nThis part details how to prepare single-cell suspensions from resected murine tumors (Figure 2[href=https://www.wicell.org#fig2]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1696-Fig2.jpg\nFigure 2. Tumor digestion\n(A) Resected tumor (MCAprog) in the collection tube.\n(B) Minced tumor.",
    "(C) Tumor fragments in the digestion tube before enzymatic digestion.\n(D) Digestion tubes placed on a shaker for enzymatic digestion in a warm room.\n(E) Tumor cell suspension and remaining fragments after enzymatic digestion.\n(F) Filtration of the tumor cell suspension and mechanic dissociation of remaining fragments with a syringe plunger in the 50 mL tube overlaid with a cell strainer.\n(G) Flushing of the cell strainer and syringe plunger.\n(H) Visualization of the 25 mL of tumor single-cell suspension after entire processing.\n(I) Tumor-derived cells in the 96-well plate prepared for flow cytometry analysis.\nUsing a pair of scissors, mince the tumor into approximately 1–2 mm2 fragments inside the collection tube (Figure 2[href=https://www.wicell.org#fig2]B).\nTransfer tumor fragments in a digestion tube pre-filled with 1 mL Sample buffer.\nRinse twice the collection tube with 0.5 mL Sample buffer to obtain a final digestion volume of 3 mL (Figure 2[href=https://www.wicell.org#fig2]C). Place the tube on ice while working on the next samples.\nOnce all samples have been processed as in steps 10–12, prepare a digestion mix with collagenase VIII (final concentration 1 mg/mL) and DNase I (final concentration 0.1 mg/mL). An example of digestion mix for 10 tumors is provided below.\ntable:files/protocols_protocol_1696_6.csv\nAdd the required volume of digestion mix in each digestion tubes (2 × 30 μL = 60 μL), mix well and incubate the tubes on a shaker at 180 rpm for 30 min at 37°C (Figure 2[href=https://www.wicell.org#fig2]D).",
    "Critical: Enzyme concentration and timing of digestion are critical parameters for optimal tumor digestion. The purpose is to achieve sufficient tissue dissociation while maximizing cell viability and preserving cell surface antigen expression. We recommend optimizing enzyme concentration and timing of digestion if using tumor models distinct from those presented in this protocol. Note that the quality of collagenase is also an important parameter for optimal digestion (troubleshooting 1[href=https://www.wicell.org#troubleshooting]) (troubleshooting 2[href=https://www.wicell.org#troubleshooting]).\nNote: For a given tumor model, the size of tumors could vary depending on the initial number of tumor cells injected and the endpoint of the experiment. The digestion volume stated here (3 mL) is working well for tumors up to 0,5–0,6 g. For bigger tumors, digestion volume should be increased, but the concentration of the enzymes should not be modified.\nFollowing 30 min incubation, the buffer in the digestion tube turns cloudy because of cell dissociation, and only small remaining tumor fragments are observed (Figure 2[href=https://www.wicell.org#fig2]E). Transfer the contents of each digestion tube to individual 50 mL tubes pre-filled with 12 mL FACS buffer and overlaid with a 70 μM cell strainer.\nCarefully disaggregate the remaining tumor fragments on the 70 μM strainer with a 2,5 mL syringe plunger (Figure 2[href=https://www.wicell.org#fig2]F).\nRinse the cell strainer and syringe plunger with 10 mL of FACS buffer to flush the cells through the filter (Figure 2[href=https://www.wicell.org#fig2]G). The 50 mL tube now contains 25 mL of tumor single-cell suspension (Figure 2[href=https://www.wicell.org#fig2]H).\nCritical: Perform steps 15–17 on ice immediately after the 30 min incubation to rapidly stop the enzymatic digestion.\nOnce all samples have been processed as in steps 15–17, place the 50 mL tubes in a centrifuge and spin at 500 × g for 5 min at 4°C.\nDiscard the supernatant and resuspend the pellet with 1 mL FACS buffer.",
    "Count total cell number in each sample using a hemocytometer or automated cell counter.\nTransfer equal numbers of cells per sample to a 96-well plate (Figure 2[href=https://www.wicell.org#fig2]I). For simultaneous analysis of endothelial cells and CD8+ T cells from a single tumor, prepare two distinct wells with tumor-derived cells from the same sample.\nCritical: For analysis of rare cell subsets (e.g., TA-HECs), use a sufficient number of tumor-derived cells for flow cytometry analysis (4–8 × 106 cells).\nNote: Determining the total number of cells in your samples is required to calculate total numbers of given cell populations from your flow cytometry analysis.\nNote: Use remaining cells for controls (e.g., fluorescence minus one (FMO) and unstained controls).\nCell staining\nTiming: 1.5–2 h\nThis part details how to stain tumor-derived cells for flow cytometry analysis. If intracellular staining is required, proceed first to extracellular staining followed by cell fixation and intracellular staining. For optimal analysis of your flow cytometry data, we recommend preparing FMO and unstained controls. All the following steps need to be performed in the dark.\nCentrifuge the 96-well plate containing cells at 500 × g for 5 min at 4°C.\nDiscard the supernatant and resuspend cells in 100 μL of Fixable Viability Dye diluted 1:1000 in DPBS without magnesium and calcium, and incubate the cells at 4°C for 10 min.\nNote: Discriminating live and dead cells significantly ameliorates the quality of flow cytometry analysis since non-specific binding of antibodies to dead cells is common.\nWash with 100 μL FACS buffer per well and centrifuge the 96-well plate at 500 × g for 5 min at 4°C.",
    "Discard the supernatant and resuspend cells in 100 μL of antibody cocktails (extracellular staining) prepared in the Staining buffer as indicated in Tables 1[href=https://www.wicell.org#tbl1] and 2[href=https://www.wicell.org#tbl2], and incubate the cells at 4°C for 30 min. When performing simultaneous analysis of endothelial cells and CD8+ T cells, add the specific antibody cocktail in the wells reserved for endothelial and CD8+ T cell staining.\nWash with 100 μL FACS buffer per well and centrifuge the 96-well plate at 500 × g for 5 min at 4°C.\nIf intracellular staining is not performed (e.g., flow cytometry analysis of tumor endothelial cells), discard the supernatant, resuspend cells in 150 μL FACS buffer and transfer the cells in 1 mL cluster tubes pre-filled with 100 μL FACS buffer. These samples are now ready for acquisition on the flow cytometer.\nIf intracellular staining is performed (e.g., flow cytometry analysis of tumor-infiltrating CD8+ T cells), fix cells in 100 μL Fixation/Permeabilization solution (dilute 1:3 Fixation/Permeabilization concentrate in Fixation/Permeabilization diluent from the Foxp3/transcription factor staining kit) and incubate the cells at 18°C–22°C for 20 min.\nPause point: Fixed cells can be stored at 4°C for up to 18 hours. Wash with 100 μL FACS buffer and centrifuge the 96-well plate at 700 × g for 5 min at 4°C. Discard the supernatant and resuspend cells in 200 μL FACS buffer. The next steps can be performed on the following day.\nWash with 100 μL Permeabilization buffer (dilute 1:9 Permeabilization buffer 10× from the Foxp3/transcription factor staining kit in distilled water) and centrifuge the 96-well plate at 700 × g for 5 min at 4°C.\nNote: Following cell fixation, centrifugation speed can be increased at 700 × g to ensure optimal cell pelleting.",
    "Discard the supernatant and resuspend cells in 100 μL of antibody cocktails (intracellular staining) prepared in the Permeabilization buffer as indicated in the Table 2[href=https://www.wicell.org#tbl2], and incubate the cells at 4°C for 0,5–1 h (troubleshooting 5[href=https://www.wicell.org#troubleshooting]).\nWash with 100 μL FACS buffer and centrifuge the 96-well plate at 500 × g for 5 min at 4°C.\nDiscard the supernatant, resuspend cells in 150 μL FACS buffer and transfer the cells in 1 mL cluster tubes pre-filled with 100 μL FACS buffer. The samples are now ready for acquisition on the flow cytometer.\nAcquisition on the flow cytometer\nTiming: 1.5–2 h\nThis part details the acquisition of samples on the flow cytometer. The following steps were designed for acquisition on a BD LSRFortessa flow cytometer using BD FACSDiva software (BD Biosciences).\nFor auto-compensation settings, prepare unstained control and single-stained controls for every fluorochrome used in your panel.\nNote: We recommend using mouse-derived cells (e.g., splenocytes), but compensation beads could also be used. For the viability dye fluorochrome, using heat-killed cells stained with Fixable Viability Dye is a suitable option.\nOnce controls are prepared, go to your flow cytometry facility and open a new experiment on BD FACSDiva software.\nUse unstained and single-stained controls to set appropriate PMT voltages and calculate auto-compensation.\nDefine the gating strategy.\nNote: Refer to data analysis[href=https://www.wicell.org#sec3.5] section for additional information on the gating strategy.\nAcquire a sufficient number of cells per sample while watching the flow rate (8000 events/s or less).\nCritical: For optimal analysis of rare tumor-associated endothelial cell subsets (e.g., TA-HECs), we recommend acquisition of 1 × 106 cells. For tumor-infiltrating CD8+ T cells, 0.2–0.5 × 106 cells are sufficient.\nData analysis\nTiming: 1 h",
    "This part details guidelines for analyzing tumor-derived endothelial cells and CD8+ T cells in your flow cytometry data. Data presented in Figures 3[href=https://www.wicell.org#fig3], 4[href=https://www.wicell.org#fig4], 5[href=https://www.wicell.org#fig5], and 6[href=https://www.wicell.org#fig6] were obtained in the MCAprog tumor model.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1696-Fig3.jpg\nFigure 3. Gating strategy for analysis of tumor endothelial cells\n(A) Forward and sideward scatter gating to exclude debris.\n(B) Single cell gating.\n(C) Single cell gating.\n(D) CD45-CD31high cell gating to identify total tumor-derived endothelial cells.\n(E) Identification of MECA-79- tumor-associated endothelial cells (TA-ECs) and MECA-79+ tumor-associated HEV endothelial cells (TA-HECs).\n(F) FMO MECA-79 control.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1696-Fig4.jpg\nFigure 4. Analysis of CD62P and CD62E expression in MECA-79+ TA-HECs\n(A) Histogram showing CD62P expression in MECA-79+ TA-HECs.\n(B) Histogram showing CD62E expression in MECA-79+ TA-HECs.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1696-Fig5.jpg\nFigure 5. Gating strategy for analysis of tumor-infiltrating CD8+ T cells\n(A) Single cell gating.\n(B) Forward and sideward scatter gating to identify lymphoid cells.\n(C) Live CD45+ cell gating.\n(D) CD8+ cell gating.\n(E) CD44+ cell gating.\n(F) PD-1+ cell gating.\n(G) Identification of SLAMF6+TIM3- stem-like and SLAMF6-TIM3+ terminally exhausted CD8+ T cells.\n(H) FMO SLAMF6 control.\n(I) FMO TIM3 control.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1696-Fig6.jpg\nFigure 6. Analysis of TCF-1 and TOX expression in tumor-infiltrating exhausted CD8+ T cells\n(A) Histograms showing TCF-1 expression in SLAMF6+TIM3- stem-like (SLAMF6+) and SLAMF6-TIM3+ terminally exhausted (TIM3+) CD8+ T cells.\n(B) Histograms showing TOX expression in SLAMF6+TIM3- stem-like (SLAMF6+) and SLAMF6-TIM3+ terminally exhausted (TIM3+) CD8+ T cells.",
    "Among non-hematopoietic CD45- cells, tumor-derived endothelial cells are identified as CD45-CD31high cells. Among the total population of tumor-derived endothelial cells, tumor-associated high endothelial cells (TA-HECs) are identified based on staining with MECA-79, an HEV-specific antibody (Blanchard and Girard, 2021[href=https://www.wicell.org#bib2]; Girard et al., 2012[href=https://www.wicell.org#bib9]). The gating strategy is presented in Figure 3[href=https://www.wicell.org#fig3]. MECA-79+ TA-HECs can be further characterized with additional markers of inflamed endothelium such as CD62P (P-selectin) and CD62E (E-selectin), as shown in Figure 4[href=https://www.wicell.org#fig4].\nAmong hematopoietic CD45+ cells, tumor-infiltrating CD8+ T cells are identified using the CD8a marker. Among the total population of tumor-infiltrating CD8+ T cells, antigen-experienced exhausted CD8+ T cells are identified as CD44+PD-1+ cells. Two subsets of exhausted CD8+ T cells can be further identified using the markers SLAMF6 and TIM3. SLAMF6+TIM3- are defined as stem-like CD8+ T cells and SLAMF6-TIM3+ are defined as terminally exhausted CD8+ T cells (Miller et al., 2019[href=https://www.wicell.org#bib5]; Siddiqui et al., 2019[href=https://www.wicell.org#bib7]). The gating strategy is presented in Figure 5[href=https://www.wicell.org#fig5]. SLAMF6+TIM3- stem-like and SLAMF6-TIM3+ terminally exhausted CD8+ T cells can be further characterized with additional markers important for T cell exhaustion such as TCF-1 and TOX transcription factors (Khan et al., 2019[href=https://www.wicell.org#bib4]; Miller et al., 2019[href=https://www.wicell.org#bib5]; Scott et al., 2019[href=https://www.wicell.org#bib8]; Siddiqui et al., 2019[href=https://www.wicell.org#bib7]), as shown in Figure 6[href=https://www.wicell.org#fig6]."
  ],
  "subjectAreas": [
    "Immunology",
    "Health Sciences",
    "Cell Isolation",
    "Flow Cytometry",
    "Cancer",
    "Single Cell",
    "Cell Biology",
    "Model Organisms"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}