{
  "id": 17407,
  "origin_website": "Jove",
  "title": "A Rodent Model of The Ross Operation: Syngeneic Pulmonary Artery Graft Implantation in A Systemic Position",
  "procedures": [
    "All procedures have been approved by the University of Padova Animal Care Committee (OPBA, protocol number n° 55/2017) and authorized by the Italian Ministry of Health (Authorization n° 700/2018-PR), in compliance with the European Union Directive 2010/63/UE and the Italian Law 26/2014 for the Care and Use of Laboratory Animals.\n1. Animal care and experimental model\nEnsure all Lewis rats are obtained from a single company (Table of materials). Maintain the rats in conventional facilities with free access to food and water.\nEnsure that the weight of the rats ranges from 320-400 g for the recipient group and 200-250 g for the donor group.\n2. Preoperative protocol\nNOTE: All operations must be performed under clean conditions. Use male and female adult Lewis rats as recipients and donors as well in order to perform a syngeneic transplant.\nPerform an intraperitoneal injection of tramadol (5 mg/kg) 15 min before surgery.\nAdminister a single dose of intramuscular Gentamicin (5 mg/kg) immediately before surgery.\nFor anesthesia induction, supply 4% sevoflurane in 1 L/min of oxygen to a poly(methyl methacrylate) chamber where the animal is placed. For anesthesia maintenance, use 2.0-2.5% sevoflurane in 1 L/min of oxygen throughout the procedure.\nShave the animal along the midline for 2 cm width from the sternum to 1 cm above the genital area with a razor. Then, sterilize the skin with iodine solution.\nIn order to prevent the animal from getting wet and to prevent heat dispersion during the surgery, cover the animal with a transparent plastic film.\nEvaluate the level of anesthesia before performing the procedure by assessing the absence of response to a noxious stimulus.\n3. Donor operation\nAnimal and heart preparation:",
    "Place the anesthetized animal on a cork tray with the caudal side facing the surgeon. Perform a xipho-pubic incision of about 5-6 cm, and retract the two musculocutaneous flaps laterally.\nAdminister a volume of 1 mL of saline solution at 4 °C containing 500 IU of heparin through the abdominal vena cava.\nAfter 1 min, cut the diaphragm from left to right and perform an anterior thoracotomy to expose the heart.\nCool the beating heart by dripping saline solution at 4 °C.\nPerform a pericardiectomy and a thymectomy in order to obtain a complete view of the aortic arch. Remove the remaining fatty tissues surrounding the aorta.\nCut at the arch, just above the origin of the innominate artery; sever the latter one, too.\nCut the thoracic inferior vena cava (IVC) and insert a 22 G cannula to infuse the heart with 20-25 mL of saline solution at 4 °C, exerting light pressure. Discontinue the perfusion when the heart stops beating and flow from the aorta became clear.\nPAG explant:\n\tNOTE: An accurate harvesting and delicate handling of the PAG is mandatory for achieving optimal implantation in the recipient. Do not touch it directly with instruments, instead use cotton swabs.\n\t\nPerform an ultrasound study to assess the PA diameter in its native position.\nInsert a micro-plier under the posterior wall of the vessel and cut the latter using a micro-scissor as close as possible to its bifurcation to maximize the length of the PAG.\nGently hold the PA with the ring-tipped micro-forceps and separate it from the right ventricle with the micro-spring scissors. Harvest the PAG, including some right ventricular muscle.\nPAG preparation:\n\t\nPlace the PAG on a gauze moistened with cold saline on the operating table and inspect the vessel under the operating microscope.",
    "Cut any abundant surrounding tissue, leaving only 1 mm of ventricular muscle. Set the length of the vessel at 5 mm.\n4. Pulmonary artery graft (PAG) implantation\nPreparation of the recipient animal:\n\t\nPlace the anesthetized animal on a cork tray with the caudal side facing the surgeon.\nPerform a median longitudinal incision and use two mini retractors to keep the abdomen open.\nExtract the intestines with two cotton swabs and cover them with a gauze soaked with 39 °C saline allowing the visualization of the retroperitoneal area with exposure of the infra-renal abdominal aorta (AA).\n\t\tNOTE: During the surgery, it is important to occasionally moisten the intestines using a syringe containing 39 °C saline to prevent hypothermia, a critical condition common in rodents.\nStrip the posterior parietal peritoneum between the two renal arteries and the iliac bifurcation using two cotton swabs and remove the fatty tissue around the infrarenal AA. Leave only a small portion of fat above the AA, to facilitate handling on the vessel.\nSeparate the AA from the IVC. To perform this procedure, first, pass a curved forceps behind the posterior aortic wall and use it to open a passage between the AA and IVC. Then, use a 2-0 silk suture to create a loop around the AA, in order to lift the vessel and separate the AA from IVC. Ligate any lumbar artery arising from the infrarenal AA with 6/0 silk suture and divide it.\nRotate the animal 90° counterclockwise, placing the head on the operator's left side. The AA now lay horizontally in the microscopic field.\nUse two Yasargil clips to clamp the infrarenal AA and place them at a distance of 1.5 cm from each other. Transect the AA at the midpoint between the two clips.",
    "Irrigate the two ends of the vessels with heparin (1 UI/mL) in saline solution to remove any clots. Remove any adventitial debris from the vessels.\nPAG implantation:\n\t\nPlace the PAG between the two ends, with the ventricular end towards the cranial portion of the animal.\nUse a 10-0 polypropylene suture to perform two landmark single stitches connecting the PG to the AA. Perform the procedure on both ends of the PAG by placing the suture on opposite sides of the vessel circumference.\nPerform an end-to-end anastomosis between PAG and AA, beginning with the distal end. Use one of the two ends of the distal landmark suture for the posterior anastomosis using a recipient-to-graft out-in/in-out sequence to perform a running suture of about six stitches.\nOnce the suture reaches the proximal landmark, perform a double half hitch completed by a square knot using the suture and one of the two ends of the proximal landmark suture. Apply rubber-shod mosquito forceps to the sutures to provide traction.\nPerform the same anastomosis on the anterior wall. Carry on the entire procedure on the proximal end of the PAG. Take particular attention when performing the proximal anastomosis to avoid including any leaflet in the suture line.\nRelease the distal clip first to let the PAG be filled with retrograde blood (low-pressure flow) in order to check the anastomosis. Repair any blood leakage with a single suture. Once the distal anastomosis is evaluated, perform the same procedure on the proximal end.\nFinal stages of the operation on the recipient:\n\t\nAssess the patency of the PAG and apply two strips of gelatin sponge over the suture lines on both sides of the PAG (if necessary). Exert gentle pressure for a few seconds with two cotton swabs to help hemostasis.",
    "Relocate the intestines into the abdominal cavity and close the walls with a 4/0 polypropylene running suture.\n5. Sham-operated procedure\nPerform an identical preparation of the animal as previously illustrated for recipient rats.\nCut the infra-renal AA, midway between the renal and the iliac arteries' origin.\nReapproximate the two ends of the AA using an end-to-end anastomosis, as previously described. Remove the two clips and perform an accurate hemostasis procedure.\nReposition the intestines and close the abdominal wall in layers, as for the recipient animals.\n6. Postoperative care and follow-up\nAdminister warm saline solution (5 mL) into the subcutaneous tissue of the animal's back for hydration. Place the rat under a heating lamp and visually monitor it until awakening, which usually takes up to 5 min after anesthesia is stopped. Place the animal in a cage at a room temperature of 22-24 °C, with immediate and unrestricted access to food and water.\nAdminister intramuscular tramadol (5 mg/kg) for postoperative analgesia twice daily for the first 48 h after surgery. Thereafter, monitor the recipient's health status and body weight daily, on a regular basis.\nFollow-up: During the follow-up, perform seriate ultrasound studies at one week, one month, and two months to evaluate PAG function. During these studies, measure the vessel diameter, the peak systolic velocity (PSV), and the end-diastolic velocity. Measure these parameters inside the PAG and at the level of proximal and distal AA.\nEuthanize the animals after two months of follow-up by application of CO2 for a few minutes, and then explant the PAG, which will undergo histopathological analysis.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}