{
  "id": 8899,
  "origin_website": "Jove",
  "title": "Whole-cell Currents Induced by Puff Application of GABA in Brain Slices",
  "procedures": [
    "Animal housing and all animal experiments were conducted in accordance with procedures approved by the Ethics Committee for animal research at South China Normal University, according to the Guidelines for Animal Care established by the National Institute of Health.\n1. Preparation of Solutions\nPrepare 500 mL of standard artificial cerebrospinal fluid (ACSF) containing the components described in our published work7 as listed in Table 1.\n\t\nUse clean glass beakers with deionized water to prepare a fresh ACSF solution. Clean spatulas with deionized water and dry before using to add NaCl, KCl, NaH2PO4, NaHCO3, MgSO4, D-glucose, and add the CaCl2 after having bubbled the solution with 95% O2 / 5% CO2 mixture for ~20 min (as detailed in Table 1) to 500 mL of deionized water. Stir until fully dissolved.\nEnsure the ACSF is completely clear without any precipitation. Then adjust the pH to 7.2-7.4. Bubble with a gas mixture composed of 95% O2 and 5% CO2 for ~20 min.\nPrepare 250 mL of slice cutting solution containing the chemicals7 described in Table 2.\n\t\nAdd KCl, MgCl2, NaH2PO4, NaHCO3, choline·Cl, D-glucose and add the CaCl2 last as indicated in 1.1.1, to 250 mL of deionized water and dissolve as described in 1.1.1 and 1.1.2.\nAfter bubbling with 95% O2/5% CO2, place the solution in a freezer for 15-20 min so that the cutting solution becomes ice-cold and partially frozen.\n\t\tNOTE: We use this cutting solution when making slices from 1-2 month-old mice; the formula may differ for mice older than 2 months.\nPrepare LPS solution by dissolving in sterile endotoxin-free isotonic saline (0.9% NaCl). LPS is administered intraperitoneally (0.5 mg/kg) and begin recording 2 h later.\n2. Preparation of Prefrontal Cortex Slice",
    "Take the cutting solution out of the freezer and homogenize to obtain a slush. Place the solution on ice and bubble constantly with 95% O2/5% CO2.\nUsing large, sharp scissors, quickly decapitate a mouse as described9 and immediately put the head into a beaker filled with ice-cold (0-4°C) cutting solution.\nCut the top of the skull along the midline in a caudal-to-nasal direction with fine scissors and remove the lateral skull portions. Remove the brain with a fine spatula and drop into ice-cold cutting solution.\n\tNOTE: Steps 2.2-2.3 must be done rapidly (ideally < 1 min).\nPlace the brain on the lid of a 9 cm Petri dish filled with ice. Rinse the brain with ice-cold cutting solution. Cut off the cerebellum and olfactory bulb with a razor blade.\nApply cyanoacrylate glue to the specimen holder of a vibratome. Carefully place the brain block on the drop of glue, rostral side up, and immediately immerse in ice-cold cutting solution.\nAdjust the blade holder of the vibratome to an angle of 15° with reference to the horizontal plane and prepare 350-µm coronal brain slices (blade vibration frequency = 85 Hz, speed = 0.1 mm/s).\nUsing a pipette, transfer the slices into the recovery chamber filled with ACSF, incubate for 1 h (at RT) with constant bubbling of 95% O2/5% CO2.\n3. Whole-cell Patch Recording\nMake glass borosilicate micropipettes for use as recording electrodes or puff micropipettes according to the specific guidelines in the Puller Operation Manual. For recording electrodes, tip resistances are in the range 4-6 MΩ, while puff micropipettes have tip diameters in the range 2-5 µm.",
    "Add Na+ channel blocker (TTX, 1 µM), to block fast Na+ channel and thus action potentials, to ACSF and maintain a constant flow rate of this solution of 2-3 mL/min in the recording chamber, by peristaltic pump into the chamber and aspiration out of it. Bubble the ACSF with 95% O2/5% CO2 constantly to ensure the viability of the slices.\nTransfer a brain slice into the recording chamber using a modified Pasteur pipette whose fine tip was cut to fit the slice size. Cover the slice with a platinum slice anchor with parallel nylon threads spaced ≥2 mm apart to hold the slice on the platform.\nFill the recording micropipette with internal solution7 (Table 3), and fill the puff micropipettes with GABA at 10 µM, 50 µM, and 100 µM (dissolved in ACSF), or ACSF as vehicle control.\nTo prevent blockage with debris, apply light positive pressure using a 1 mL syringe before immersing the recording electrode in the ACSF. Using a micromanipulator under a microscope (4x objective lens), position the recording electrode and puff micropipette so that the tips appear in the center of the video image in the monitor (Figure 1A).\nAdjust the microscope focus (40x objective lens) while gradually lowering the puff micropipette and place it above the recording neuron at an angle of 45°. Keep the distance between the tip of the puff micropipette and the neuron recorded between 20-40 µm (Figure 1B). Slowly and carefully approach the neuron with the recording electrode and then release the positive pressure. Apply a weak and brief suction through the tubing connected to the electrode holder to create a giga-ohm seal.",
    "Maintain the voltage at 0 mV. After formation of the giga-ohm seal, compensate for fast and slow capacitance manually or automatically. Then apply a brief and strong suction through the tubing mentioned above to get into whole-cell mode.\nRecord eIPSC in voltage-clamp mode. Apply low gas pressure (nitrogen, 4 - 6 psi) to the puff micropipette using a Picospritzer controlled by a Master 8 voltage step generator to deliver single or paired GABA puffs (Figure 2).\nChange the puff duration to obtain the best eIPSC results (Figure 3) and measure the eIPSC in the LPS-induced depression model ( Figure 4).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}