{
  "id": 13563,
  "origin_website": "Jove",
  "title": "Induction of Mesenchymal-Epithelial Transitions in Sarcoma Cells",
  "procedures": [
    "1. Preparation of Reagents\nPrepare DMEM for cell culture by adding 50 mL of fetal bovine serum (FBS) and 5 mL of penicillin-streptomycin (5,000 U/mL) to 500 mL of DMEM. This medium can be stored at 4 °C for up to six months.\nResuspend lyophilized primers in nuclease-free water to a final concentration of 10 µM. Store re-suspended primers at -20 °C.\nPrepare radioimmunoprecipitation assay (RIPA) buffer (150 mM NaCl, 0.5% sodium deoxycholate, 0.1% SDS, 50 mM Tris, pH 8.0). Supplement with protease inhibitor cocktail before use and keep buffer on ice when in use. Store at 4 °C.\nPrepare 10 mg/mL polybrene (hexadimethrine bromide) in water and syringe filter to sterilize using a 0.45 µm polyethersulfone filter. Solution can be stored at 4 °C for up to six months.\nPrepare a 1 mg/mL working solution of nitro blue tetrazolium chloride by dissolving 10 mg in 10 mL of PBS. Store at 4 °C.\n2. Lentiviral Transduction of GRHL2\nDay 1\nPlate 3 x 105 HEK293T cells per well of a 6-well plate in 2 mL of supplemented DMEM. Quantify cells using an automated cell counter. Cells should be 40 - 60% confluent after overnight culture at 37 °C with 5% CO2.\nDay 2\nDilute 2 µg of empty vector (pCMV-UBC-EGFP) or 2 µg of pCMV-GRHL2-UBC-EGFP24,25 in 200 µL of serum-free media along with 1.8 µg of pΔ8.9 and 0.2 µg of pCMV-VSV-G helper plasmids. In a separate tube, dilute 4 µL of a lipid-based transfection reagent in 200 µL of serum-free media per transfection (8 µL in 400 µL for two samples). Add 200 µL of transfection reagent mixture to each plasmid solution and incubate for 20 min at room temperature.",
    "During the incubation, wash HEK293T cells by removing the medium by vacuum aspiration and rinsing cells with 1 mL of PBS. Replace the PBS with 800 µL of serum-free media. After 20 min, add 200 µL of transfection reagent:plasmid mixture from step 2.2 dropwise to each well and incubate cells for 2 h at 37 °C in 5% CO2.\nCarefully remove transfection medium by vacuum aspiration and replace with 2 mL of supplemented DMEM. Return the cells to the incubator for overnight culture.\n\t​NOTE: HEK293T cells are loosely adherent. Media replacement must be performed with caution to limit removal of cells from the bottom of the dish or flask.\nDay 3\nRefresh media on transfected HEK293T cells and plate 3 x 105 RD cells per well of a 6-well plate in 2 mL of supplemented DMEM. Culture cells overnight. RD cells are a commercially-available human rhabdomyosarcoma cell line.\nDay 4\nCollect viral media from HEK293T cells. Pipette the DMEM media from the HEK293T cells and place into a new 15 mL conical. Carefully replace with new DMEM media and place HEK293T cells back in the incubator for the next day.\nAdd 2 µL of 10 mg/mL polybrene per mL of viral media into two new 50 mL conical tubes (one for the empty vector transfection and another for the GRHL2 transfection). Syringe filter viral media by removing the plunger from a 3 mL syringe and attach a 0.45 µm polyethersulfone filter to the tip.\n\t\nAdd the viral media collected in step 2.6 into the barrel of the syringe, and plunge media into the new 50 mL conical tubes containing polybrene. Remove media from RD cells by vacuum aspiration and add filtered viral media to RD cells.\nDay 5",
    "Repeat Day 4. HEK293T cells can be discarded after the viral media has been collected.\nDay 7\nWash RD cells with 1 mL of PBS and add 200 µL of 0.05% trypsin per well. Incubate at 37 °C for 5 min, add 2 mL of supplemented media, and move cell suspension to a new 15 mL conical. Centrifuge cells at 250 x g for 5 min at room temperature and aspirate media. Resuspend in 1 mL of DMEM (supplemented with 5% FBS and 1% penicillin-streptomycin).\n\t​NOTE: Using a higher percentage of FBS may cause clogging during flow cytometry\n\t\nFilter cells for flow cytometry. Use a pipette to apply the 1 mL RD cell suspension through a 30 µm filter into flow cytometry tubes and place tubes on ice.\nSort EGFP+ cells26 into 1.5 mL microcentrifuge tubes containing 0.5 mL of DMEM supplemented with 10% FBS and 1% penicillin-streptomycin and place on ice. Plate EGFP+ sorted cells in total of 1 mL of supplemented DMEM into a single well of a 12-well plate and place in the incubator for culture.\n\t\t​NOTE: The yield of EGFP+ cells from flow cytometry after this transduction is usually low (50,000-100,000 cells). Cells may need to be cultured for 10 - 14 days before proceeding to step 3.\n3. Reverse Transfection of miR-200s\nPrepare 50 µM stocks of miR-200 mimics using nuclease-free H2O. Aliquot stocks and store at -20 °C to avoid repeated freeze/thaw cycles.\nAdd 3 µL of each 50 µM miR-200 mimic (miR-200a, miR-200b, and miR-200c) to 300 µL of serum-free media or 9 µL of 50 µM negative control miRNA to 300 µL serum-free media.",
    "Add 6 µL of siRNA-specific transfection reagent to 600 µL of serum-free media and divide 300 µL of this mixture into two tubes, one for each of the two miR mixtures from step 3.2. Combine the 300 µL of each miR mixture from step 3.2 with a mix of 300 µL of transfection reagent. Incubate for 20 min at room temperature.\nWhile incubating, prepare a cell suspension of 600,000 EGFP+ RD cells expressing EV or GRHL2 created in Section 2 in 2.4 mL (250 cells/µL) of serum-free media per treatment.\nIn a 24-well plate, add 100 µL per well of miR-200 mix or negative control mix from step 3.3 into six wells, and then add 400 µL of each cell suspension into three wells of each miR mix.\nIncubate cells at 37 °C in 5% CO2 overnight and change media to fully supplemented DMEM the following day. Collect cells 2 days later for analysis using the appropriate buffer (see below). Time-lapse imaging of RD sarcoma cells undergoing MET is available as supplemental material. Image each well every 2 h with a 10X objective using an automated live-cell imager27.\n4. RNA extraction, Reverse transcription, and qPCR\nExtract RNA according to manufacturer's instructions using a standard RNA extraction kit24. Extracted RNA can be stored at -80 °C.\nQuantify RNA concentration. Thaw and work with RNA on ice. To quantify RNA concentrations, measure UV absorbance at 260 nm with a plate reader spectrophotometer according to the manufacturer's protocol. Dilute all samples to the lowest concentration with nuclease-free water.",
    "Perform reverse transcription of total RNA into complementary DNA (cDNA). Combine no less than 100 ng of total RNA with PCR buffer, dNTP mix (100 mM), random hexamer primers, reverse transcriptase and nuclease-free water in a 20 µL reaction volume24. Run RT cycles according to the manufacture's protocol. cDNA can be stored long-term at -20 °C.\nDilute 20 µL reactions to 100 µL with 80 µL of nuclease-free H2O.\nMix 5 µL of a fluorescence-based intercalating dye 2x qPCR master mix, 0.06 µL of each 10 µM primer, and 2 µL of diluted RT reaction per sample.\nRun qPCR according to manufacturer's protocol for the fluorescence-based master mix.\nQuantify relative amounts of mRNA by the delta CT method and normalize to GAPDH. Plot the mean mRNA expression of biological replicates ± standard deviation for each treatment group.\n\tNOTE: Special precautions should be taken when working with RNA to avoid contact with RNases, such as using RNase-free plastics and reagents. Non-disposable equipment should be treated before use to remove RNases.\n5. Immunofluorescence Staining\nFollowing step 3.6, aspirate media by vacuum aspiration from RD cells in 24-well format.\nFix cells by adding 500 µL of 4% paraformaldehyde (PFA) per well and incubate for 15 min at room temperature (RT). Following fixation, place cells in phosphate buffered saline (PBS) and store at 4 °C overnight if necessary.\nPermeabilize cells by adding 500 µL of PBS+0.2% Triton-X100 and incubate 30 min at RT. By vacuum aspiration, remove permeabilization buffer and wash three times with PBS.\nBlock in 500 µL of 5% bovine serum albumin (BSA)/PBS and incubate cells for 30 min at RT. Cells can be stored at 4 °C overnight if necessary.",
    "Prepare primary antibody dilution. Pipette 200 µL of 5% BSA/PBS per well into a 15 mL conical (12 wells = 2.4 mL) and add 1 µL of primary antibody per mL of 5%BSA/PBS needed. Remove blocking buffer by vacuum aspiration and dispense 200 µL of diluted primary antibody to each well.\n\t\nIncubate cells in 1:1,000 diluted primary antibodies in 5% BSA/PBS for 1 h at RT or overnight at 4 °C. After incubation, wash cells two times with PBS.\nPrepare the secondary antibody dilution in the same volume of 5% BSA/PBS as above. Add the far-red dye-conjugated secondary antibody using a 1:2,000 dilution. Additionally add 1 µg/mL of Hoechst dye to the mix. Remove the PBS and add 200 µL of the mix to each well.\n\t\nIncubate at RT for 1 h in the dark. Wash 3 times with PBS, leave cells in PBS, and protect cells from light using foil. Cells can be stored at 4 °C if necessary.\nImage cells at 400X total magnification on an inverted epifluorescence microscope with excitation wavelength 594 - 650 nm.\n6. Western Blotting\nWash cells from 3.6 twice with ice-cold PBS. On ice, lyse cells with 50 µL of 1x RIPA buffer supplemented with 1x protease inhibitor cocktail.\nRock lysates at 4 °C for 15 min, collect lysates into 1.5 mL tubes, and centrifuge at high speed (20,000 x g) for 5 min to clarify samples. Cell lysates can be stored long-term at -80 °C if necessary.\nQuantify total protein using a Bradford assay and aliquot an equal amount of protein into new 1.5 mL microcentrifuge tubes. Bring samples to equal volume using RIPA buffer and 3x Laemmli loading buffer supplemented with 2-mercaptoethanol.",
    "Incubate samples in 1x Laemmli sample loading buffer for 5 min at 95 °C and run SDS-PAGE using a 4-12% Tris-glycine gel at 200 V for 45 min. The amount of protein loaded ranges depending on the cell line. In some cases, 50-100 µg of total protein is needed to detect E-cadherin in mesenchymal cell lines.\nTransfer proteins onto a nitrocellulose membrane for 2 h at 50 V in 1x Tris-glycine transfer buffer.\nBlock membrane for 1 h at room temperature or overnight at 4 °C in a BSA-based blocking buffer.\nDilute primary antibodies at 1:1,000 concentration in 5 mL of blocking buffer, add dilution to the membrane, and incubate with gentle rocking for 1 h at room temperature or overnight at 4 °C. Wash membrane 3 times in PBS with 0.05% Tween-20.\nIncubate membranes for 1 h at RT with infrared fluorescent-coupled secondary antibody at 1:20,000 dilution in blocking buffer as above.\nWash membrane two times in PBS with 0.05% Tween-20 and then one time in PBS.\nImage membrane using standard infrared fluorescence detection.\n7. Anchorage-independent Growth Assays\nNOTE: For a detailed soft agar assay protocol, see 28.\nWarm sterile 2x DMEM media to 42 °C in hot water bath. During this time, heat pre-autoclaved 1% agarose in the microwave for 3 min. Microwave for an additional 30 s at a time as needed or until completely melted. Move agarose to a 42 °C water bath.\nPlace a 50 mL conical tube in a beaker with 42 °C water in a sterile hood and mix 1% agarose and 2x DMEM media in a 1:1 ratio accounting for 1.5 mL of mixture per well in a 6-well plate. Always prepare extra DMEM/agarose to account for pipetting error and to avoid bubbles.",
    "Add mixture to the sides of the well, ensuring no bubbles form and let stand for 30 min at RT.\nWhile the bottom layer is solidifying, prepare each group of RD cells transfected in step 3 by aspirating media and washing once with 1 mL PBS. Aspirate PBS and add 0.2 mL of 0.05% trypsin and incubate at 37 °C for 5 min.\nNeutralize trypsin in 0.8 mL of media and triturate cells to form a single-cell suspension. Transfer cell suspension to a 15 mL conical tube.\nCount cells and calculate volume of cell suspension required for 10,000 cells per well.\nHeat 0.6% agarose in the microwave for 3 min followed by 30 s at a time until completely melted. Move agarose to 42 °C water bath.\nPlace a 50 mL conical tube in a beaker with 42 °C water in a sterile hood. Mix 0.6% agarose and diluted cell suspension in a 1:1 ratio to prepare 1.5 mL of mixture per well in a 6-well plate. Always prepare extra cell suspension/agarose mix to account for pipetting error and to avoid bubbles.\n\t​NOTE: It is important to work at 42 °C here. If the temperature is too low the mixture will solidify before plating, and temperatures above 42 °C will affect cell viability.\nMix well by triturating cells several times and add cell mixture to the wells, ensuring no bubbles form, and let solidify for 20 min at RT.\nAdd 2 mL of supplemented media to each well and move plates to incubator.\nChange media once a week for 3-4 weeks or until multi-cellular colonies form. Be careful to avoid touching the agar when removing media by vacuum aspiration. Alternatively, use a P1000 to remove the top layer of liquid media.",
    "Stain soft agar plates by adding 200 µL of Nitro Blue Tetrazolium chloride solution (1 mg/mL in PBS) and incubate the plate overnight at 37 °C. Replace media the next day with PBS for imaging.\nImage wells at 40X total magnification on an inverted microscope.\nPerform analysis on ImageJ for colony area and number. Plot mean colony number of biological replicates ± standard deviation.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}