{
  "id": 10243,
  "origin_website": "Jove",
  "title": "Modulating Shape of Polyester Based Polymersomes using Osmotic Pressure",
  "procedures": [
    "1. Spherical polymersome formation using a solvent injection method\nDissolution of polyesters in organic solvent\n\tNOTE: Only one polyester should be dissolved in its respective organic solvent at a time to form polymersomes.\n\t\nDissolve polyesters PEG-PLA or PEG-b-poly(lactic-co-glycolic acid) (PEG-PLGA) in dimethyl sulfoxide (DMSO) at a concentration of 1.5% weight. Specifically, dissolve 0.015 g of selected polyester in 1 mL of DMSO (15 mg/mL). Full dissolution of the polymer may require periods of up to 15 min of vortexing.\nWhile the polyester is dissolving in organic solvent, set up the solvent injection apparatus according to Figure 1.\n\t\nPlace a stir plate directly below the vertical syringe pump. Place a 5 mL glass vial with 1 mL of Type II deionized water and a miniature stir bar on the stir plate.\nAdjust the syringe pump's height to allow for the tip of the needle to be fully immersed in Type II deionized water.\nSet the infusion rate of the syringe pump to 5 µL/min.\n\t\tNOTE: If a small volume syringe pump is used, the adapter with the syringe can be set up on a ring stand. If a large volume syringe pump is used, the pump can be placed vertically on a lab jack to adjust the height.\nPerform the solvent injection by drawing the organic solvent and polyester solution (step 1.1.1) into a 27 G needle with a ½\" needle length.\n\t\nPlace the needle into the syringe pump and make sure it is entirely secure. Adjust the pusher block to touch the syringe plunger's end.\nStart the stir plate so that the water is spinning at 100 rpm, and then start the syringe pump.\nOnce the syringe pump has fully infused the organic solvent and polymer into the stirring water, remove from the stir bar and cap the glass vial.",
    "Characterize the polymersomes via dynamic light scattering (DLS).\n\t\nTake 1 mL of water, now with a small percentage of organic solvent and polymer, and place in a 1 mL cuvette.\nUsing the settings from Table 1, perform DLS by placing a 1 mL cuvette into the system and set up the run. Read and collect the polymersome intensity-weighted diameter and polydispersity index (PDI).\n\t\tNOTE: A plastic cuvette works fine in this case, as the amount of organic solvent is very low. However, a glass cuvette will work as well if any concerns exist.\nConfirm spherical polymersome formation using Transmission Electron Microscopy (TEM) and Scanning Electron Microscopy (SEM).\n\t\nOptimize TEM and SEM protocols based on the equipment available. Representative results were obtained at 120 kV in the TEM and 5.0 kV in the SEM.\nIf polymersomes are not visible using EM, apply uranyl acetate as a background stain.\n\t\t​NOTE: Details on TEM and SEM imaging for the shape modulation of polyester-based polymersomes can be found in reference14. Information on electron microscopy techniques for soft nanoparticles is detailed in reference16.\n2. Dialysis to remove organic solvent\nWash a 300 kDa dialysis membrane according to protocols provided by the manufacturer.\nAdd 1 mL of polymersome solution into the reservoir of the dialysis device.\nPlace the dialysis device in a 250 mL beaker with 150 mL of Type II deionized water on a stir plate. Set the stir plate to a speed that allows for gentle movement of the dialysis device and leave to stir overnight.\n\tNOTE: If a vortex is formed during dialysis, the speed needs to be decreased.\nAfter the dialysis is completed, extract the 1 mL polymersome solution from the dialysis device. Characterize the polymersome solution, following step 1.5.",
    "NOTE: Collection of this information is relevant to determine the success of the shape modulation protocol, as one should be able to identify an increase in PDI if the polymersome has been elongated.\n3. Dialysis against salt gradients\nCreate 150 mL of desired salt buffer, with either 50 mM, 100 mM, or 200 mM concentration of sodium chloride based on the final desired polymersome properties. In general, increased salt concentration leads to increased polymersome elongation.\nTake the polymersome solution that was dialyzed and characterized and re-place into the dialysis device. Place the loaded dialysis device into 150 mL of the desired salt solution and allow to gently stir for 18 h.\n\t​NOTE: Shape-modulated polymersomes can be stored and maintain their shape in an isotonic solution for periods of up to 7 days.\n4. Shape modulated polymersome characterization\nAfter the shape modulation, perform polymersome characterization via DLS, TEM, and SEM. If polymersomes are not visible using EM, apply uranyl acetate as a background stain.\nPerform DLS measurements as described in step 1.5, paying particular attention to PDI measurements compared to spherical polymersomes, as a change in PDI suggests effective shape change in polymersomes.\nEnsure the use of appropriate controls for imaging, especially non-shape modulated polymersomes, to ensure the method's success.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}