{
  "id": 9881,
  "origin_website": "Jove",
  "title": "Multimer-PAGE: A Method for Capturing and Resolving Protein Complexes in Biological Samples",
  "procedures": [
    "1. Tissue Preparation\nPrepare 10 mL of 4x BN-PAGE sample buffer (200 mM Bis(2-hydroxyethyl)amino-tris(hydroxymethyl)methane (Bis-Tris), 200 mM NaCl, 40% w/v glycerol, 0.004% Ponceau S, pH 7.2).\n\tNOTE: This stock solution may be made in advance and stored at 4 °C.\nDilute 250 µL of 4x sample buffer in 750 µL dH2O containing 1x commercial protease inhibitor cocktail. Vortex and chill on ice.\nHomogenize 20 mg of target tissue in the 1 mL 1x ice-cold BN-PAGE sample buffer with 30 strokes of a clean dounce homogenizer.\n\tNOTE: For this demonstration experiment, the target tissue is whole rat brain tissue. After homogenization, samples may be treated with mild detergent such as 2% digitonin to solubilize and permit electrophoresis of membrane proteins.\nTransfer the homogenate to a 1.5 mL microcentrifuge tube, and centrifuge at 14,000 x g for 30 min to pellet insoluble cellular contents. After centrifugation, decant the supernatant into a clean tube on ice.\nFollow manufacturer instructions to measure supernatant protein concentration using bicinchoninic acid (BCA) or similar protein quantitation assay.\nIf the homogenate sample(s) contain detergent, add a quantity of 5% Coomassie Blue G-250 in aqueous solution sufficient to bring the homogenate solution to 0.25% Coomassie.\n2. BN-PAGE\nDilute 25 mL 20x blue native (BN) electrophoresis buffer stock (1.0 M Bis-Tris, 1.0 M tricine, pH 6.8) into 475 mL dH2O containing 0.002% Coomassie Blue to make 500 mL of 1x running buffer.\nIf samples contain detergent, instead make 250 mL of 1x running buffer containing 0.02% Coomassie and another 250 mL containing none.\nChill buffer(s) to 4 °C.\nClean and assemble a polyacrylamide gel pouring cassette according to manufacturer instructions.\nPour BN polyacrylamide gel (3% T stacking layer, 6% T resolving layer) according to a standard recipe7, and place the well comb.",
    "After the gels have polymerized, rinse the cassette with dH2O and assemble the electrophoresis apparatus according to manufacturer instructions.\nRemove the well comb and fill the wells with 1x BN-PAGE running buffer. Avoid filling the entire inner chamber with buffer until samples are loaded.\nIf samples contain detergent, fill the wells with the buffer containing 0.02% Coomassie Blue.\n\t\tNOTE: Perform steps 2.7-2.9 at 4 °C.\nUsing gel-loading tips, pipette a volume of homogenate containing 20 µg of protein into the desired wells. Pipette an equivalent volume of 1x BN-PAGE sample buffer into any unused wells.\n\tNOTE: Use the protein concentration determined from the BCA assay to calculate the appropriate volume of homogenate to add to the wells.\nAfter samples are loaded, fill the inner chamber with 1x BN-PAGE running buffer. Be sure the gel is entirely submerged in buffer. Next, fill the outer chamber with 1x running buffer to the level indicated by the manufacturer.\nIf samples contain detergent, fill the inner chamber with the 1x buffer containing 0.02% Coomassie Blue, and the outer chamber with dye-free 1x running buffer.\nConnect the electrodes to the power supply, and electrophorese the proteins in the gel at 150 V until the dye band progresses ~2 cm into resolving layer. Stop and disconnect the power supply.\n3. Cross-linking\nNOTE: Perform Steps 3.1-3.6 at 4 °C.\nDisassemble the electrophoresis apparatus, and separate the glass panes of the gel cassette. Remove and discard the stacking layer.\nCarefully cut the gel just below the bottom edge of the dye front. Take care to make this cut as smooth and straight as possible, and then discard the unused piece of gel. This will leave a ~2 cm wide, horizontal strip of polyacrylamide gel, which will contain all the protein in the homogenate sample.",
    "Trim away any unused portions along the edges of the gel strip.\nCarefully place the strip into 10 mL phosphate buffered saline (PBS) in a small container, and gently mix by nutation for 30 min to equilibrate.\nAfter equilibration, discard and replace the PBS with another 10 mL. Pipette 500 µL of 25 mM DSP dissolved in dimethyl sulfoxide into the PBS, and continue mixing as above (step 3.4) for 30 min.\nPour off the DSP solution. Add 10 mL of 0.375 M tris(hydroxymethyl)aminomethane hydrochloride (Tris-HCl), pH 8.8, containing 2% sodium dodecyl sulfate (SDS) to quench the unreacted DSP. Continue nutation for 15 min.\n4. SDS-PAGE\nWhile gel strip is quenching, prepare SDS-PAGE gel solutions according to standard methods9. Do not add polymerization reagents.\nAfter quenching, return the ΒΝ gel strip to room temperature, and cast the strip into a new gel cassette.\nTo do this, carefully pick up the gel and place it onto a clean gel cassette spacer plate.\nOrient the strip so the bottom of the dye front is nearest to the top of new cassette (i.e., the side that travelled furthest during BN-PAGE should be closest to the top of the new cassette; the gel strip should be flipped from its prior orientation). See Figure 3.\nPlace the strip such that its top edge lies even with where the top edge of the cover plate will be (i.e., it will be at the top of the new gel). Make sure the dye front is parallel to the horizontal edges of the glass plate.\nPush one side of the excised strip against one of the spacer walls, leaving room on the other side for gel to be poured and a protein standard or ladder to be loaded.",
    "If the bottom edge of the gel strip contains any jagged or uneven areas, carefully cut them away. If present, they will trap bubbles during gel pouring.\nOnce the gel strip is positioned correctly, lay the cover plate over the spacer plate. Apply gentle pressure to push out any trapped air bubbles.\nContinue to assemble the gel-pouring apparatus according to manufacturer instructions.\nAdd polymerization reagents to the resolving gel buffer, and pour it into the prepared gel cassette, using a serological pipette. Fill the gel cassette to ~2 cm below the excised BN-PAGE gel strip, to leave room for the stacking layer.\nAdd 100 µL butanol over the top of the poured gel, and allow 30 min for polymerization of the resolving layer. Pour off the butanol.\nAdd polymerization reagents to the stacking gel solution. Using a serological pipette, pour the stacking layer to fill all remaining empty space in the gel cassette.\nTilt the gel cassette as the stacking layer is poured so it fills the space below the gel strip, and air bubbles are not trapped.\nAs the stacking gel buffer fills the empty space below the gel strip, gradually return the gel cassette to level footing.\nContinue to fill the empty space next to the excised gel strip with the stacking gel buffer, until it nearly overflows.\nAllow the stacking layer to polymerize for 30 min.\n\tNOTE: Make 10x SDS-PAGE running buffer (250 mM tris(hydroxymethyl)aminomethane (tris), 1.9 M glycine, 1% SDS) while the gel is polymerizing. This can also be made beforehand and stored at room temperature.\nDilute 50 mL 10X SDS-PAGE running buffer stock into 450 mL dH2O to make 1x working buffer.",
    "After the stacking layer has polymerized, remove the gel cassette from the pouring apparatus, rinse with dH2O, and assemble the electrophoresis apparatus according to manufacturer instructions.\nFill the inner chamber completely with 1x SDS-PAGE running buffer, then fill the outer chamber to the level indicated by the manufacturer.\nLoad the space next to the excised gel strip with a molecular weight ladder or appropriate protein standard.\nAttach the electrodes to the power supply, and electrophorese the samples at 120 V. When the Coomassie dye runs off the gel, stop and disconnect the power supply.\nAnalyze the gel using standard methods of electroblotting and protein detection by antibody binding10.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}