{
  "id": 13498,
  "origin_website": "Jove",
  "title": "In Vitro Ovule Cultivation for Live-cell Imaging of Zygote Polarization and Embryo Patterning in Arabidopsis thaliana",
  "procedures": [
    "1. Preparation of the In Vitro Ovule Culture Medium\nMake the liquid medium forthe in vitro ovule culture (\"N5T medium\") containing 1x Nitsch basal salt mixture, 5% (w/v) trehalose dihydrate, 0.05% (w/v) 2-(N-morpholino)ethanesulfonic acid (MES)-KOH (pH 5.8), and 1x Gamborg's vitamin solution.\nAdjust the pH to 5.8 with KOH.\nSterilize the medium by autoclaving it (121 °C, 20 min) or filtering it through a 0.22-µm filter.\n\tNOTE: The sterilized medium can be stored at 4 °C for 2 - 3 months.\n2. Preparation of the PDMS Micropillar Array Device\nCut the PDMS micropillar device by a knife, razor blade or scissors to fit into the glass part (14 mm φ) of a 35 mm glass-bottom dish.\n\tNOTE: The full procedure of the PDMS device construction is described in previous papers8,9, and thus the details are omitted here. Glass-bottom dishes with smaller volumes, such as 4-well or 96-well plates, can be used for short-term imaging without the device.\nSterilize the upper side of the PDMS device under UV light for 15 min.\nTurn the PDMS device over by using square tip tweezers, and keep it under UV light for 15 min to sterilize the bottom.\nTransfer the sterilized PDMS device into a 35 mm culture dish and add the N5T medium until the device is completely soaked in the medium (approximately 5 - 7 mL).\nPut the dish into a vacuum chamber, and reduce the pressure to degas. Keep vacuuming for 3 h to overnight until the air in the device is replaced by medium.\n\tNOTE: The device can be detached by air bubbles under a strong vacuum.\nTake the device from the dish by holding it with square tip tweezers and put it on a paper towel to remove the extra medium on the side and bottom.",
    "NOTE:The medium on the micropillar array (upper surface) should not be removed because this will be used for the ovule cultivation.\nTransfer the device onto a 76 mm x 26 mm slide glass, ensuring to keep the micropillar part as the upper side, and cover the device with 35 mm culture dish lid to prevent the medium from drying out during the following ovule extraction.\n3. Silique Dissection and Ovule Extraction\nSterilize a needle (0.40 mm G) and fine tweezers by wiping with 70% ethanol. The needle is easily handled by attaching it to a syringe or wood stick.\nCheck the inflorescence of the plant, and select the proper siliques for the experiment. The approximately 5 mm siliques contain zygotes, and the 8 - 10 mm siliques include young globular embryos.\nExcise the siliques by using tweezers, and place them on double-sided tape on a 76 x 26 mm slide glass. One silique contains about 40 - 60 ovules, and 3 - 4 siliques (i.e., 120 - 240 ovules) are sufficient for one device.\nOpen the silique (ovary wall) to see the ovules inside using the sterilized needle and tweezers under a stereomicroscope. Cut only the ovary wall so that the ovules are not damaged.\nTransfer the opened silique into the N5T medium on the PDMS device (prepared in step 2.7), and release the ovules into the medium with the needle or tweezers.\nPut a small cover glass (18 mm x 18 mm) onto the PDMS device to push the ovules into the spaces in the micropillar array.\nTake the cover glass off by pulling it horizontally using tweezers or fingers to remove extra medium.",
    "Turn the PDMS device upside down, place it into a 35 mm glass-bottom dish, and slightly press the device by pushing using the square tip tweezers to stick it to the glass.\nPour N5T medium gently into the glass-bottom dish by decanting the medium bottle until the PDMS device is completely soaked in the medium, and seal the dish with paraffin film.\n\tNOTE: The PDMS device can be recycled, but devices that are too old are easily detached from the glass bottom. Additionally, the device may float if it is not completely degassed in step 2.5 or the medium is poured too quickly.\nimgsrc://cloudfront.jove.com/files/ftp_upload/55975/55975fig2.jpg\nFigure 2: Schematic Procedure for Sample Preparation.\nThis schematic flow corresponds to steps 3.5 to 4.1. Please click here to view a larger version of this figure.[href=https://www.jove.com//cloudfront.jove.com/files/ftp_upload/55975/55975fig2large.jpg]\n4. Time-lapse Imaging\nPlace the glass-bottom dish that was prepared in step 3.9 on an inverted microscope, and select suitable ovules to focus on.\n\tNOTE: Because the ovules vary in stage, position, and direction, suitable ovules should be found by checking their marker fluorescence.\nStart the live-imaging according tothe manufacturer's instructions of the microscope system.\n\tNOTE: The microscope equipment and parameters are diverse, and thus the users should choose the proper settings that fit to the experiment purpose. As an example, the settings used in this manuscript are listed in Table 1.\ntable:\n﻿0,1,2,3\nEquipment/setting,Figure 3 (A) and Supplemental Videos 1 and 4,Figure 3 (B) and Supplemental Video 2,Supplemental Video 3\nMicroscope,laser-scanning inverted microscope (A1R MP),spinning-disk confocal inverted microscope (CSU-W1),box-type inverted confocal microscope system with a stable incubation chamber (CV1000)\nLaser,Ti:sapphire femtosecond pulse laser,488-nm and 561-nm LD lasers,488-nm and 561-nm LD laser",
    "Objective lens,40X water-immersion objective lens (NA = 1.15) with immersion medium,\"60X silicone oil immersion objective lens (NA = 1.30), mounted on a Piezo focus drive\",40X objective lens (NA = 0.95)\nDetector,external non-descanned GaAsP PMT detector,EMCCD camera,EMCCD camera\nDichroic mirror,DM495 and DM560,DM488/561,DM400-410/488/561\nFilter,band-pass filters; 534/30 nm and 578/105 nm,\"band-pass filters; 520/35 nm, and 593/46 nm\",band-pass filters; 520/50 nm and 617/73 nm\nSlice along z-axis,31 z-stacks with 1-µm intervals,17 z-stacks with 3-µm intervals,7 z-stacks with 5-µm intervals\nTime interval,20 min,5 min,10 min\nTable 1: The Microscope Systems and Settings Used in This Manuscript.\nThe microscopes and parameters are diverse, and thus each user should choose the suitable system for the experiment.\nCheck the acquired image sequence, and convert it to the general movie format, such as .avi or .mov for presentation.\n\tNOTE: If the microscope software cannot output the images as a movie format, it is possible to save the images as .tif and then open them in ImageJ, an open source program inspired by NIH Image, to change the file type. ImageJ is provided at: https://imagej.nih.gov/ij/. ImageJ can also be used to make a Z-stuck movie, such as the maximum-intensity projection, as described at: https://imagej.net/Z-functions.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}