{
  "id": 12098,
  "origin_website": "Jove",
  "title": "Digital Analysis of Immunostaining of ZW10 Interacting Protein in Human Lung Tissues",
  "procedures": [
    "All methods described here have been approved by the Ethical Committee of Zhongnan Hospital of Wuhan University and Renmin Hospital of Wuhan University.\n1. Preparation of IHC Slides\nFix the lung tissue sample by immersing the human lung tissue fragment (about 3 x 3 cm) in 4% paraformaldehyde in phosphate-buffered saline (PBS) for 24 h at room temperature (RT).\nDehydrate the tissue in 80%, 95%, and 100% ethanol for 15 min, 20 min, and 20 min, respectively, at room temperature. Finally, immerse the tissue in 100% xylene 3x for 20 min each at room temperature.\nFor embedding, immerse the tissue in paraffin (63 °C) for 30 min. Change the paraffin and immerse the tissue again for another 45 min. Finally, change the paraffin again and immerse the tissue in it for an additional 1 h.\nUse a rotary microtome to cut the tissue into 5 µm-thick sections and place them on 20 µg/mL poly-L-lysine-coated slides.\nFor dewaxing, place the slides in a 65 °C oven for 2 h and, then, immerse the sections in dimethylbenzene for 15 min, followed by soaking in 100% xylene for 15 min.\nHydrate the slides with the tissue sections 2x for 5 min in 100% ethanol, followed by a treatment with serially diluted ethanol of 5 min in 95% ethanol, 5 min in 80% ethanol, 5 min in 70% ethanol, and 5 min in 50% ethanol.\nPerform antigen repair.\n\t\nDilute citric acid repair liquid (20x) to 1x with double-distilled H2O (ddH2O).\nPlace the slides with the tissue sections and the 1x citric acid repair liquid (300 mL) in an antigen repair box and, then, heat them in the microwave oven at high power for 2 min, followed by heating at low power to sustain boiling for 6 min.",
    "Allow the sections to cool down naturally to room temperature.\nReplace the citric acid repair liquid with 0.01 M PBS, wash the sections 3x, each time for 5 min, in the rotary shaker at room temperature.\nEliminate the endogenous peroxidase.\n\t\nDilute 30% of H2O2 to 3% with ddH2O, add it to the slides (make sure it covers all tissues), and incubate the slides in a wet box at room temperature for 30 min.\n\t\tNote: The wet box is a plastic box of 10 x 15 cm and can contain water.\nWash the slides 3x, each time for 5 min, with 0.01 M PBS in the rotary shaker at room temperature.\nBlock the nonspecific antigen.\n\t\nDilute the concentrated normal goat serum to 10% goat serum with PBS with 0.1% Tween 20 (PBST).\nAdd 10% goat serum to the slides and incubate them in the wet box at 37 °C for 30 min.\n\t\tNote: The goat serum should cover all tissues in the slides.\nStain the tissues.\n\t\nIncubate the slides with rabbit anti-human anti-ZWINT antibody (1:50) at 4 °C overnight.\nWash the slides 3x, each time for 5 min, with 0.01 M PBST (1 mL of 0.1% Tween 20 in 1,000 mL PBS) in the rotary shaker at room temperature.\nIncubate the slides with secondary antibody (anti-rabbit detection system, 1:200) for 30 min at 37 °C.\nWash the slides 3x, each time for 5 min, with 0.01 M PBST in the rotary shaker.\nTo visualize the immunostaining, add the slides to 300 µL of fresh 3,3-diaminobenzidine and, then, wash the slides with tap water at room temperature.\n\tNote: The degree of dyeing is monitored under a microscope (magnification 10X - 40X).",
    "Counterstain the tissue. Stain the slides with hematoxylin staining solution for 2 min at room temperature and, then, wash the slides with tap water for 15 min.\n\tNote: The nucleus appears blue under the microscope (magnification 10X - 40X). If the degree of blue staining is more potent, hydrochloric alcohol differentiation for 3 - 5 s can be used, followed by rinsing the tissue back to blue with tap water for 15 min to facilitate the prominent staining of the tissue.\nDehydrate the slides for 5 min in 50% ethanol, 5 min in 70% ethanol, 2x in 80% ethanol for 5 min, 5 min in 95% ethanol, and finally, 2x for 5 min each in 100% ethanol at room temperature.\nFor transparency, immerse the tissue sections in a tank containing 100% xylene for 15 min and transfer the sections to another tank containing 100% xylene for 15 min at room temperature.\nFor sealing, take 50 - 100 μL of neutral gum and add 5% xylene to the mixture (avoid mixing in bubbles). Add 15 μL of the above-mentioned mixture to the lung tissue sections. Seal the film with cover glass and gently press the bubbles out.\n2. Automatic Whole-slide Scanning of IHC Slides\nAllow the sealed slides to dry for 12 h at room temperature to desiccate them.\nSelect the Bright field manually option and enter the manual scanning interface.\nRevise the name of the slides and select a storage path for the images.\nSet the scanning area and choose the option Scan samples using user-set thresholds. The threshold is about 50 with a scanning area expansion value of 200 μm.\nSet the scanning focus value, select the focus automatically—it ranges from 1050 to 2650—and finally, select Single-layer mode.",
    "Load the IHC slides on the workstation and start the automatic scanning.\n\tNote: Make sure the slides are not damaged. Keeping the slides clean and translucent and avoid dust, confetti, and excess sealant residue on the slides. The glass slide and coverslip should be devoid of marks. Do not clean the slides with xylene. The size of the slides is given in Table 1.\nAutomatically scan the entire tissue section on a slide with 20X, 40X, or 100X magnification.\nCollect and store the images at the end of the whole-slide scanning.\n3. Analysis of the Slides by Imaging Software\nStart the histopathological image analysis software and select Local computer.\nOpen the file which stores the scanning data.\nSelect the appropriate zoom level from range 2X to 40X.\nAdjust the color to set the optimal contrast via Toggle color adjust.\nManually circle and name the portions of interest on each image.\n\tNote: For instance, you can circle one area and name it as Tumor area.\nSelect Plugins and QC. At this time, Scenario builder pops up.\nSelect Density quant and adjust the Detection bar.\n\tNote: This process should be performed carefully. The bar of Blue tolerance is used to adjust the color of the cellular nucleus. The bar of Brown tolerance is used to adjust the saturation of the fill color in the image. The results of the images after adjustments should be consistent with the original counterparts.\nAdjust the Score levels to make the staining intensity of the circled areas similar to that of the original images.\n\tNote: Dark brown indicates strong positive, brownish yellow is moderately positive, light yellow is weakly positive, and white is negative.\nStore and name the model as a file. Apply the model to other slides and select Selected annotation”.",
    "Let the software automatically calculate the H-score for the circled areas in the image.\n4. Quantification of the Scores Using the H-scoring System9,10\nCalculate the percentage of immunostaining and the staining intensity (0: negative, 1+: weak, 2+: moderate, 3+: strong).\nUse a scoring system (H-score) to calculate the pathological scoring of the tumor and adjacent nontumor areas.\n\tNote: H-score = (% of cells with weak intensity x 1) + (% of cells with moderate intensity x 2) + (% of cells with strong intensity x 3). Therefore, the maximum H-score is 300 if 100% of the cells are quantified with strong intensity.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}