{
  "id": 13943,
  "origin_website": "Jove",
  "title": "Training Rats to Voluntarily Dive Underwater: Investigations of the Mammalian Diving Response",
  "procedures": [
    "NOTE: Experimental protocols described herein conducted at Midwestern University were approved by the Midwestern University IACUC.\n1. Room Requirements\nSecure a procedure room that has running hot and cold running water, and a way to remove the water from the tank, typically a drain in the floor.\nUse a study table on which to place the diving tank. Since rooms with floor drains are typically contoured for drainage, cut down rubber stoppers and place them under the table legs to ensure that the table top, and hence the water surface in the tank, is level.\n2. Diving Tank\nDiving Tank Construction\n\t\nConstruct a rectangular tank (100 x 60 x 15 cm) using 3/4 in thick Plexiglas for the bottom and 1/2 in Plexiglas for the side walls (Figure 1). Permanently attach the outside Plexiglas pieces of the tank together using cyanoacrylate cement or solvents such as trichloromethane.\nDivide the tank into 5 channels each approximately 100 cm in length, by using removable 1/2 inch thick Plexiglas cut into 85 x 15 cm pieces. Permanently place grooves in the bottom and edges of the tank into which these channel dividers can be slotted into position.\n Suspend horizontal Plexiglas pieces from the channel dividers to create a “roof” for an underwater dive “tunnel.\nIn one corner of the tank place a removable raised platform, the “finish area”, for rats to haul out of the water and rest between swimming and diving trials. Rats usually groom themselves and remove water from their fur while in the finish area. Place tall sides around the edges of the finish area to insure the rats remain on the platform between training trials.",
    "At the opposite corner of the tank from the finish area place a chamber that only allows underwater access to the maze. This removable “start area” is only used for diving trials.\n\t\tNOTE: At the beginning of a diving trial a rat is lowered into the water while sitting on a platform within the start chamber; hence this platform is called the “elevator”.\n\t\tNOTE: Use a modular design, where the start area, finish area, and all channels dividers are removable from the tank. This is done for two reasons: 1) to facilitate filling and emptying the tank with water after removal of all channel dividers, and 2) if a rat gets disoriented, especially while underwater, the pieces can be quickly disassembled to rescue the rat from the water.\nFilling and emptying the tank with water\n\t\nFilling the Tank with water\n\t\t\nAt the beginning of each training session, fill the tank with fresh 32 °C tap water to a depth of about 12 cm. Stir the water in the tank to minimize warm or cool pockets.\n\t\t\tNOTE: Typically it takes about 2 hr to train 12 rats. During this time water temperature decreases by about 4 °C. By the end of the training session the water cools to approximately 28 °C. Since 30 °C water is thermoneutral to rats, using this warm water, rather than room temperature water, will minimize heat loss during repetitive training.\nEmptying the Tank with water",
    "At the end of each training session, drain the water from the tank using a large hose, such as a 4 m long piece of 1 inch internal diameter tubing. Completely submerge the tubing in the tank, ensuring no air pockets are in the tubing. Quickly place one end of the tubing into the floor drain. The resulting siphoning effect will drain the water from the tank.\nWhile keeping the tank end of the tubing under the water surface to maintain the siphoning, tip the tank on edge to facilitate complete drainage of the water.\n\t\t\tNOTE: Alternatively, and rather than siphoning, install a tap near the base of the tank, and connect a hose from the tank tap to the floor drain.\n3. Rat Allergen Considerations\nWear disposable gloves whenever handling and training the rats. The gloves will limit contact with the water in the tank, which invariably will contain rat urine.\n\tNOTE: The rats will become wet during the training, and the room will be filled with a “wet-rat” odor. Consequently a prophylactic regime of anti-histamines may prevent or limit the effects of rat allergies. Trainers may also need to wear disposable dust masks, or N95 masks, should they become sensitive to rat allergens.\n4. Swim Training\nDaily swim training\n\tNOTE: Personal experience indicates that younger rats learn the maze better and faster, and thus starting the training with 35 g newly weaned rats is preferable to using adult rats.\n\t\nFill tank with water. See 2.2.1.\nInsert finish area and channel dividers to create 5 swimming channels.\nDuring the first training session gently lower the rats by hand into the water about 3-5 cm from the finish area.",
    "NOTE: Upon their introduction to water rats will appear unsteady as they first encounter the sensation of floating. The rats will paddle about in an uncoordinated fashion while trying to locate a way to exit the water, eventually reaching the nearby finish area. Due to their innate ability to swim, in subsequent trials the rats will swim in a much more coordinated fashion toward the finish area.\n\t\tNOTE: Support the rats from underneath so their feet are on the investigators hands. Gently lower the rats into the water, and let them swim away from the hand, rather than dropping them into the water.\nBetween trials let the rats remain in the finish area for at least 1 min. This is to allow the rats to groom and explore, so that they regard the finish area as a “safe” place to go between trials. This is in contrast to grabbing a rat that has just completed a trial and immediately positioning it back in the water to start the next trial.\n\t\tNOTE: Do not use external reward (i.e., food) during the training, so as to prevent activation of reward circuits in the brain.\nAfter the finish area wait period, gently hold the rats for 1 min before initiating the next trial. Gently dry the rats with a towel during this pre-trial hold since repetitive entry into the water will cause rats to get very wet, and drying them will prevent hypothermia.\nRepeat 4.1.3. through 4.1.5. to complete 3 to 5 trials for each rat to be trained during a daily swim training session.\nRemove all channel dividers and finish area from the tank.\nEmpty the water from the tank. See 2.2.2.\nWeekly swim training schedule",
    "Conduct daily training sessions (see 4.1.) 5 days per week, ideally at the same time each day.\nBegin the first trial from the distance successfully negotiated on the previous day. Begin the second and third trials from an increased distance.\nWith each subsequent daily training session increase the distance between where the rats are placed in the water and the finish area. For the first few training sessions increase this distance by 5-10 cm. After the rats appear more comfortable with swimming, increase the distances by 30-50 cm.\nUse larger Increases in the swimming distances while the rats are learning to swim a straight portion of a swim channel. In contrast, learning to swim the hairpin turns between channels might take 2-3 training sessions.\n\t\tNOTE: Often, while waiting in the finish area, rats will re-enter the water to swim, and/or submerge their head underwater while still sitting on the finish area platform.\nRepeat this daily training protocol over 3 weeks to ensure successful swimming of the entire 5 channels. This repetitious training protocol ensures successful completion of the maze, especially since the maze includes alternating left and right hairpin turns.\n5. Dive Training\nNOTE: After the rats have learned to successfully negotiate swimming through the maze they are ready to start dive training.\nInitial dive training (first day)\n\t\nInsert start chamber. Fill tank with water (see 2.2.1.). Ensure water level is 1 cm below the opening to the start area.\nInsert finish area and channel dividers to create 5 swimming channels.",
    "During the first diving session train the rats to be lowered on the elevator into the water within the start chamber. Access to the maze is from the bottom of the start chamber. During this first session the water level is low enough so the rat can easily swim from the start chamber into the maze. Allow the rat to continue swimming through the maze to the finish area.\nBetween trials let the rats remain in the finish area for at least 1 min.\n\t\tNOTE: Do not use external reward (i.e., food) during the training, so as to prevent activation of reward circuits in the brain.\nAfter the finish area wait period, gently hold the rats for 1 min before initiating the next trial. Gently dry the rats with a towel during this pre-trial hold.\nRepeat 5.1.3. through 5.1.5. to complete 3 trials for each rat to be trained during this initial dive training session.\nRemove all channel dividers, start chamber and finish area from the tank.\nEmpty the water from the tank. See 2.2.2.\nInitial dive training (second day)\n\t\nInsert start chamber. Fill tank with water (see 2.2.1.). Ensure water level is slightly above the opening to the start area.\nInsert finish area and channel dividers to create 5 swimming channels.\nDuring the second dive training session the water level has been raised so that to exit the start chamber the rat has to dip its head under the edge of the start chamber to enter the maze. Consider this as the rat’s first dive. Allow the rat to then continue swimming through the maze to the finish area.\nLet the rats remain in the finish area for at least 1 min between trials.",
    "NOTE: Do not use external reward (i.e., food) during the training, so as to prevent activation of reward circuits in the brain.\nAfter the finish area wait period, gently hold the rats for 1 min before initiating the next trial. Gently dry the rats with a towel during this pre-trial hold.\nRepeat 5.2.3. through 5.2.5. to complete 3 trials for each rat to be trained during this dive training session.\nRemove all channel dividers, start chamber and finish area from the tank.\nEmpty the water from the tank. See 2.2.2.\nInitial dive training (third day)\n\t\nInsert start chamber. Fill tank with water (see 2.2.1.), ensuring that the water level is above the opening to the start area.\nInsert finish area and channel dividers to create 5 swimming channels. Place a horizontal piece of Plexiglas immediately outside of the start area to create a 5 cm long diving tunnel.\nDuring the third dive training session the rat has to dip its head under the edge of the start chamber and swim 5 cm underwater to reach the open water of the swim channel. Allow the rat to then continue swimming through the maze to the finish area.\n\t\tNOTE: Once placed in the start area, rats initiate their own underwater submergence, and thus these are considered to be “voluntary” dives. \nLet the rats remain in the finish area for at least 1 min between trials.\n\t\tNOTE: Do not use external reward (i.e., food) during the training, so as to prevent activation of reward circuits in the brain.\nAfter the finish area wait period, gently hold the rats for 1 min before initiating the next trial. Gently dry the rats with a towel during this pre-trial hold.",
    "Repeat 5.3.3. through 5.3.5. to complete 3 to 5 trials for each rat to be trained during this dive training session.\nRemove all channel dividers, start chamber and finish area from the tank.\nEmpty the water from the tank. See 2.2.2.\nWeekly dive training schedule\n\t\nConduct daily training sessions (see 5.3.) 5 days per week, ideally at the same time each day.\nBegin the first trial from the distance successfully negotiated on the previous day. Begin the second and third trials with an increased diving distance.\nWith each subsequent daily training session increase the length of the dive tunnel by adding additional horizontal dividers to extend the distance the rats have to swim underwater. For the first few training sessions increase this distance by 5-10 cm. After the rats appear more comfortable with diving, increase the distances by 30-50 cm.\n\t\t NOTE: Do not overextend the dive distance attempted during successive trials. If necessary, lift up the end of the horizontal channel cover to provide shorter dive distances. If during a dive trial a rat does not reach the end of the dive tunnel and starts to turn around underwater, quickly lift up the end of the channel cover and allow the rat to surface and continue his swim. This will enable the rat to successfully complete a longer dive distance. This positive reinforcement will keep the rat moving forward through the underwater tunnel with each dive trial.\nUse larger Increases in the diving distances while the rats are learning to dive a straight portion of a swim channel. In contrast, learning to dive around the hairpin turns between channels might take 2-3 training sessions.",
    "NOTE: Often, while waiting in the finish area, rats will re-enter the water to swim, and/or submerge their head underwater while still sitting on the finish area platform.\nRepeat this daily training protocol over 3 weeks to ensure successful diving of the entire 5 channels. This repetitious training protocol ensures successful completion of the maze, especially since the maze includes alternating left and right hairpin turns.\n\t\tNOTE: The full 6 week swim and dive training schedule coincides with the growth of 35 g newly weaned rats to reach a body weight of 300 g.\nAfter daily training sessions are complete, and the rats have been returned to their home cage, ensure rats quickly dry their fur through grooming, or if necessary, place a heating pad under their cage to keep the rats warm until their fur is dry.\n6. Experimental Variations\nNOTE: The basic experimental set-up and animal training have been described above. However, behavioral training only provides a model to be used with other experimental techniques to collect data of interest. Basic protocols are modified to investigate specific aspects of the diving response. Examples of these modifications, and some considerations for the collection of data using these physiological and neuroanatomical techniques, are given below.\nImplantable Telemetric Transmitters\n\t\nAfter completion of the training, use commercially available telemetric transmitters to transmit pulsatile arterial blood pressure from swimming and diving rats. Obtain local IACUC approval for procedures concerning surgery and post-surgical recovery. Follow the implantation procedures suggested by the company for their transmitter, and ensure complete recovery from the surgery before returning the rat into the water.\nEnsure the antenna receiving the radio signal is nearby when the rat is in the water.",
    "NOTE: Water attenuates radio signals, and so the distance the radio signal needs to travel through the water becomes a limiting factor of the tank dimensions.\nUse a hand-held antenna wand, rather than a rat-cage sized antenna, to follow the rat as it progresses through the maze. Keep the wand antenna within 30 cm of the rat to ensure that the radio signal is not lost while the rat is underwater.\nTrailing Cannulae\n\t\nRedesign the channel dividers and horizontal pieces creating the roof of the diving tunnel so that the cannula trails along behind the rat during its progression through the maze.\n\t\tNOTE: The modular design of the channels is of utmost importance and must also allow quick recover of the rat from the underwater maze. If a cannula snags and became dislodged from the rat, the rat could soon bleed out while underwater if the cannula is not quickly reattached.\nUse trailing arterial cannulae to record arterial blood pressure and heart rate in voluntarily diving rats. Use a 90 cm piece of PE50 as a trailing cannula.\n\t\tNOTE: This cannula length is long enough to connect the rat to the pressure transducer while still allowing the rat to progress through the maze, yet is short enough to minimize cannula dead space and is close enough to the pressure transducer to allow sufficient fidelity of the arterial pressure signal.\nUse trailing venous (or arterial) cannulae to inject pharmaceutical agents such as parasympathetic and sympathetic agonists and antagonists, or to inject tracers or dyes that determine the distribution of cardiac output.\nWithdraw blood samples from the rats using the venous (or arterial) cannulae while the rats are underwater to determine underwater catecholamine levels or blood chemistry.",
    "NOTE: Minimize the length of the trailing cannula and account for the cannula dead space during blood draws.\nDetection of Activated Brainstem Neurons\n\t\nUse immunological detection of the Fos protein to identify specific areas of the brainstem that are part of the diving response.\n\t\tNOTE: During repetitive initiation of a cardiorespiratory reflex, brainstem neurons that are part of that reflex circuit can become activated and produce a protein called Fos.\nRepetitively dive rats through the maze every 5 min for 2 hr for a total of 24 dives.\n\t\tNOTE: Other protocols that also induce neuronal Fos production can also be used. To avoid activation of brainstem neurons involved in the response to stress, the behavior that is repeated should be included as part of the behavioral training.\nBlood Corticosterone Levels during Diving\n\t\nUse corticosterone as an indicator of the level of stress rats experience during swimming and diving.\nTo obtain blood for corticosterone analysis, draw 0.1 ml blood samples from the tail vein of rats 15 min after 3 voluntary swims or dives.\n\t\tNOTE: Preliminary experiments indicated that 15 min is sufficient time to allow for the production and release of corticosterone into the circulation and cause a peak in plasma corticosterone levels. Since corticosterone levels have a circadian rhythm, schedule all blood draws at the same time of day and corresponded with the timing of training sessions.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}