{
  "id": 3810,
  "origin_website": "Cell",
  "title": "Live-cell imaging of PVD dendritic growth cone in post-embryonic C. elegans",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nSynchronizing transgenic C. elegans\nTiming: 4 days\nThe primary PVD dendrites begin to develop at the L2 stage (∼ 20 h post-hatching) and complete their extension within 3–4 h. To image PVD dendritic growth cones at the right developmental stage, start with synchronized L1 larvae obtained by bleaching gravid adult transgenic C. elegans and hatching the embryos in M9 buffer one day before the experiment to accurately time the developmental stage.\nPick 20 transgenic C. elegans at L4 stage with expression of GFP or LifeAct::NeonGreen in PVD neurons on each feeding NGM plate (5.5 cm). Distribute 20 worms onto four plates (5 per plate) for each experiment.\nAfter cultivation for 3 days at 20°C, over 100 gravid hermaphrodites are obtained in each plate.\nWash down C. elegans with 1 mL M9 buffer per plate, and collect hermaphrodites into a single 15 mL glass tube.\nCentrifuge at 1500 × g for 5 min, and remove the supernatant.\nAdd 10 mL of M9 Buffer to wash the sample. Repeat steps 4 and 5 twice until the supernatant becomes clear.\nRemove the supernatant, resuspend the worm pellet with alkaline-bleach solution, and seal the opening with parafilm.\nPlace the 15 mL glass tube on the rocking plate and gently rock for no longer than 5 min.\nVisually inspect the worm-containing solution against the room light and make sure that worm carcasses are gone, leaving the solution in a fine-grain appearance.\nCritical: Time in the bleach is critical. Soaking in bleach solution over 7 min will kill the embryos.\nStop the reaction by adding 10 mL M9 buffer.\nCentrifuge at 4000 × g for 5 min, and remove the supernatant.\nWash the embryos with M9 buffer as step 5. Repeat this step for three times.",
    "Resuspend the embryos in 1 mL M9 buffer and seal the opening with parafilm.\nIncubate the embryos without bacterial food at 20°C for 12–16 h on the rocker.\nOn the next morning, centrifuge the arrested L1 larvae at 1500 × g for 5 min, and remove the supernatant.\nResuspend with 50 μL M9 buffer and drop 2–5 μL worm solution on NGM plates seeded with OP50 bacteria.\nCultivate the L1 larvae for 20 h at 20°C.\nMounting C. elegans onto an agarose pad\nTiming: 10 min\nAdequate immobilization of worms is the key step for a successful live-cell imaging experiment. This part will provide a detailed description for mounting a live L2 larva with the anesthetic mixture onto an agarose gel pad for microscopic observation.\nMake an agarose pad (Figure 2[href=https://www.wicell.org#fig2]):\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/532-Fig2.jpg\nFigure 2. Steps for making a 10% agarose gel pad for live-cell imaging\n(A) Leave a drop of 10% melted agarose on a slide flanked by two taped slides, place another slide perpendicular to the center slide, and gently press against the top slide to make a round pad.\n(B) Use razor to trim excessive parts of the gel pad.\n(C) Drop the levamisole/Microbeads mixture on the gel pad and pick animals into the solution.\n(D1) Seal the edge of the coverslip with 3M tape.\n(D2-3) Trim the 3M tape to fit the slide.\nTape two glass slides with lab tape. The thickness of the tape will be the thickness of the agarose pad made later.\nPlace a third slide between the two taped slides.\nUse a Pasteur pipette to put a drop of freshly melted 10% (w/v) agarose (dissolved in distilled water) onto the center of the untapped slide.",
    "Immediately lay another untaped slide on the melted gel perpendicular to the third slide, and press this slide gently to make a circular gel pad. Wait for 10 s until the gel pad is cool down.\nOnce the agarose pad is set, carefully remove the fourth slide by sliding it, and use a razor blade to trim the pad to fit the size slightly smaller to coverslip.\nPrepare the anesthetic mixture by mixing 1 μL 5% (w/v) levamisole, 0.25 μL liquid OP50 culture at 0.4–0.6 optical density (600 nm) and 0.75 μL microbeads.\nNote: Levamisole causes the animal to contract, which results in shorter body length.\nPlace around 10 synchronized L2 C. elegans larvae in the anesthetic mixture and wait for 2 min until the movements of larvae are significantly reduced.\nPut on the coverslip and then gently seal the edge of coverslip by vaseline or 3M tape (Figure 2[href=https://www.wicell.org#fig2]).\nNote: We tried several methods for sealing including regular wax, vaseline, and commercial mounting reagents. The 3M tape is chosen because it is faster and easier compared with other reagents.\nCritical: 10% agarose gel instead of regular 5% agarose gel is used in live-cell imaging because it is stiffer, resulting in better immobilization.\nImaging dendritic growth cones by spinning-disk confocal microscopy\nTiming: 3–4 h",
    "Because PVD dendritic growth cones are relatively thick and highly dynamic in C. elegans, we use spinning-disk confocal microscopy to acquire z-stack images at high speed. PVD neurons have anterior and posterior primary dendrites. The dendrite outgrowth of posterior primary branches is not controlled by axon-dendrite fasciculation through L1CAM-Robo signaling. This protocol primarily focuses on anterior primary dendrites to study the influence of axon-dendrite fasciculation on dynamics of dendritic growth cone. Nevertheless, it is also suitable to image growing growth cone of posterior primary dendrite. It is notable that the outgrowth of posterior primary dendrites is abolished in some mutant strains, such as the sax-7 mutant. For the imaging setting, the interval between each z-stack series is 30 s or longer, and worms are able to survive for 4–6 h on the gel pad.\nPlace the slide on the microscope stage and search for transgenic C. elegans under the 10× objective.\nImage growth cone morphology under the 63× objective (immersed in oil) and mark the location of PVD growth cones for each animal.\nSet the laser intensity at 20% and exposure time at 200 ms as the default. Adjust the exposure time and laser intensity until the dendritic growth cone is clearly observed. If the signal is dim and unclear and cannot be improved by adjusting the setting, go to the problem 3[href=https://www.wicell.org#sec7.6] for troubleshooting[href=https://www.wicell.org#troubleshooting]. If the signal is quickly diminished, it is likely due to the photobleaching of images. Go to the problem 4[href=https://www.wicell.org#sec7.7] for troubleshooting[href=https://www.wicell.org#troubleshooting].",
    "Note: GFP and LifeAct::NeonGreen are weakly expressed by the ser2prom3 promoter at L2-L3 stage. Locate the PVD cell body first and move horizontally to locate the growth cone of the horizontal primary dendrite. Alternatively, the ALA axon can be used as another landmark to locate the PVD dendritic growth cone. Increasing the intensity of laser is not recommended because of rapid bleaching of fluorescence.\nAcquire z-stack images of the dendritic growth cone under the 63× objective by spinning-disk confocal microscope at 2-min (growth cone morphology) or 30-s (cytoskeletal proteins) interval for 2–4 h. The average acquisition time is around 10–15 s with optimal thickness (around 0.25 μm) recommended by Zen software (Carl Zeiss).\nNote: Sometimes the development of the PVD neuron stops after imaging a few frames. If the growth cone arrests for more than 30 min, search another animal to begin a new imaging series. Discard the slide when imaging time is over 5 h. Usually the growing dendritic growth cone has relatively low GFP or LifeAct::NeonGreen expression (Figure 1[href=https://www.wicell.org#fig1]) with continuous changes in morphology and F-actin signals. The average pixel intensity of dendritic growth cones ranges from 40 to 100 in the 8-bit grayscale with minimal background noise lower than 10 pixel intensity measured by Fiji (ImageJ). By contrast, dendritic growth cones with strong expression of GFP or LifeAct::NeonGreen (average pixel intensity > 200) are mostly stalled and stationary.\nObtain maximal projection images of the z-series by Zen software (Carl Zeiss). Sequential images are imported to Fiji (ImageJ) to produce videos."
  ],
  "subjectAreas": [
    "Neuroscience",
    "Microscopy",
    "Model Organisms"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}