{
  "id": 9098,
  "origin_website": "Jove",
  "title": "Ex Vivo Optogenetic Dissection of Fear Circuits in Brain Slices",
  "procedures": [
    "Ethics statement: All experimental procedures were in accordance with the EU directive on use of animals in research and were approved by the local Animal Care and Use Committee (Regierungspräsidium Tuebingen, state of Baden-Württemberg, Germany) responsible for the University of Tübingen. \n1. Stereotactic Injection Procedure\nPrepare sterile tools (scissors, scalpel, clamps, drill, needles, suture material) using a sterilizer. Arrange sterile tools and other required solutions and surgery supplies such as sterile cotton swaps, disinfectant, sterile phosphate buffered saline (PBS, pH 7.4), and H2O2 on a sterile surgical drape.\nPull glass micropipettes for injections (Figure 1A, inset) using a 3 mm wide box filament on a horizontal microelectrode puller according to the manufacturer's instructions.\n\tNote: For deep injections, the electrode taper should be sufficiently long to reach the ventral most coordinates (approx. 5 mm; for coordinates, see 1.10).\nPremix 1 µl of virus solution and 0.2 µl of 0.1% fast green solution in sterile PBS (for better visibility of solution in the glass pipette). Fill glass pipettes with mixture of virus solution and fast green using a microliter pipette with a fine tip (Figure 1A, inset).\n\tNote: Work with recombinant Adeno-associated viral vectors (rAAV) is considered biosafety level 1 (BSL 1) work and needs to be performed in a BSL 1 laboratory. rAAVs used in this study (Figure 1C) were: 1) mPFC: rAAV-hSyn-ChR2(H134R)-eYFP (serotype 2/9) 16; 2) MGm/PIN: rAAV-CAGh-ChR2(H134R)-mCherry (serotype 2/9) 23; 3) mpITC/BLA: rAAV-EF1a-DIOhChR2(H134R)-YFP (serotype 2/1) 23\nAnesthetize a mouse using a small animal anesthesia machine (Isoflurane: 3% in oxygen for induction).\n\tNote: Mice used in this study were 4 - 7 weeks old and of the following strains and genotypes: C57Bl6/J wild type (experiment in Figures 2A and 3A-D); GAD67-GFP 24 (experiment in Figures 2B and 3E-H); Tac2-Cre 25 (experiment in Figures 2C and 3I-J).",
    "Shave head between ears and eyes. Apply disinfectant (providone-iodine based) to shaved head using cotton swabs.\nApply an eye ointment to prevent drying of eyes during anesthesia. Subcutaneously inject mouse with analgesic (meloxicam-based, 0.1 ml of 5 mg/ml solution).\nPlace mouse in stereotactic frame (Figure 1A) and maintain anesthesia via a gas anesthesia mask (Isoflurane: 2% in oxygen for maintenance). Check anesthesia depth using limb withdrawal reflex before continuing.\n\tNote: Maintain sterile conditions as well as possible during the entire surgical procedure; wear disposable facemask, surgical gown, and gloves.\nMake skin incision on top of the head using scissors. Gently pull skin to the side using blunt forceps, fix with clamps to expose skull surface, and clean skull with H2O2.\nMark injection sites on skull using a fine tip permanent marker and drill holes for both hemispheres (Figure 1B). Coordinates for injections in this study are (from Bregma (mm)): mPFC: anterior 1.9, lateral ± 0.3, ventral 2.1; MGm/PIN: posterior 3.0, lateral ± 1.8, ventral 3.8; mpITC/BLA: posterior 1.45, lateral ± 3.35, and ventral 4.75.\nMount filled glass pipette onto stereotactic frame connected to a pressure injection device and bring the pipette to Bregma position.\nBreak off the tip of the glass pipette using fine straight-tip forceps. Do this gently to prevent aerosol generation of virus solution. Make sure the pipette tip is open by applying a few pressure pulses and observing extrusion of drops of virus solution.\nGo to the desired injection coordinates and inject half of the pipette content (~0.5 µl) using the following settings on the pressure injection device: Pressure: 20 psi, average pulse length: 30 ms, average number of pulses: 50.\nLeave pipette in place for ~1 min before slowly (1 mm/min) retracting it.",
    "Note: Make sure pipette is not blocked before repeating procedure with same pipette on other hemisphere. In case of blocked tip, clean or break off tip and zero pipette position at Bregma again.\nClean skull with PBS (pH 7.4), remove clamps, gently pull the skin together, and suture the incision with individual button suture (3 - 4 knots). Apply disinfectant (providone-iodine based) around the wound.\nStop the anesthesia and do not leave mouse unattended until it is fully awake. Keep single housed or return to company of other animals only when fully recovered. Postoperatively, continue to monitor the health status, and administer analgesic if necessary. Follow procedures according to rules put forward by the local Animal Care and Use Committee.\n2. Preparation of Acute Slices\nPrepare ACSF, cutting solution, tools (scissors, scalpel, forceps, spatula, Pasteur pipette), and agar blocks.\n\tNote: 1 L of artificial cerebro-spinal fluid (ACSF) is required per experiment, and is prepared by dissolving chemicals in double-distilled H2O as previously published 16,23. Cutting solution is prepared by supplementing 200 ml of ACSF with 0.87 ml of 2 M MgSO4 stock solution.\nOxygenate ACSF and cutting solution throughout the experiment with 95% O2 and 5% CO2.\nDeeply anesthetize mouse using a small animal anesthesia machine using isoflurane (3% in oxygen). Check anesthesia depth using limb withdrawal reflex before continuing.\nDecapitate mouse using large scissors and immediately chill head in ice-cold cutting solution.\nOpen skull by a single midline incision from caudal to rostral and gently push pieces of skull to the sides using forceps. Rapidly remove brain by gently lifting it out of the skull using a small rounded spatula. Cut off cerebellum with scalpel. Place brain in ice-cold cutting solution.",
    "For mPFC injection sites: cut off anterior part of the brain (containing mPFC) using a scalpel and put in ice-cold cutting solution until slicing.\nRemove excess cutting solution with a filter paper and glue the posterior part of the brain onto the vibratome stage.\nFor tilted amygdala slices, glue the brain on an agar block (4%) cut at a 35° angle (Figure 1D, middle). For coronal amygdala slices, MGm/PIN injection sites and mPFC injection sites, glue the brain directly on stage (Figure 1D, left and right). Place an additional agar block behind brain for stability while slicing.\nPlace stage in cutting chamber with ice-cold oxygenated cutting solution that is maintained at 4 °C using a cooling unit. Prepare acute slices of the amygdala (320 µm) using a sapphire blade. Place slices in an interface chamber supplied with oxygenated ACSF at RT.\nAfter preparation of acute amygdala slices, place the interface chamber in a waterbath at 36 °C to recover slices for 35 - 45 min. Subsequently, return the interface chamber to RT. For recording from these slices, proceed with step 3.2.\nDuring commencement of step 2.10, cut slices of the injection sites as described before for acute amygdala slices (steps 2.8 - 2.9). Recovery of slices in the waterbath is not required here. Optional: To quickly estimate injection site location, observe slices on a stereoscope equipped with a fluorescent lamp and appropriate filter sets.\nFix slices containing injection sites for post-hoc analysis by sandwiching them between two filter papers and submerging them in 4% paraformaldehyde (PFA) in PBS solution O/N. For analysis of injection sites proceed with step 4.1.\n3. Visualization and Stimulation of Presynaptic Fibers\nPrepare patch microscope for optogenetic activation of fibers and cells:\n\t\nCenter the mounted light emitting diode (LED) onto the light delivery pathway.",
    "Measure the LED light intensity at the back focal plane and at the output of each objective with a power meter choosing the appropriate wavelength of 470 nm.\nCalculate the light intensity in mW/mm2 and create a calibration curve (LED intensity (%) versus light output (mW/mm2)) for each objective for values measured for 470 nm wavelength.\nRetrieve an acute amygdala slice from the interface chamber and place in the slice chamber mounted onto the upright microscope equipped with a fluorescent lamp. Take care to position the slice such that the slice surface facing upward in the interface chamber is also facing upward in the recording chamber. Perfuse slice with fresh, oxygenated ASCF at a rate of 1 - 2 ml/min at a temperature of ~31 °C.\nObserve presynaptic fibers in the slice using the fluorescent lamp in combination with appropriate filter sets for the specific fluorescent protein expressed. Use 5x objective to obtain an overview (Figure 1E), and 60x objective for assessment of fiber density within the target area.\n\tNote: For GFP and YFP, use Filter set \"green\" (Excitation 472/20, Beamsplitter 495, Emission 490 LP) for mCherry use filter set \"red\" (Excitation 560/40, Beamsplitter 585, Emission 630/70) as specified in the materials/equipment table.\nOpen or restrict the aperture in the microscope light pathway as desired for the experiment (Figure 2D).\nTo obtain a patch recording, fill a patch pipette with internal solution and mount in electrode holder. Apply positive pressure to the patch pipette and slowly lower it first into the bath solution and then under visual control into the slice using the micromanipulator.",
    "Approach the neuron of interest with the patch pipette from the side and top. Release positive pressure when the pipette is on the surface of the cell (dimple visible on cell surface) and obtain a \"gigaseal\" by applying negative pressure.\nApply further suction to rupture the membrane patch to obtain whole-cell recording. Subsequently, stimulate labeled fibers with the connected LED using the appropriate wavelength for activating ChR (470 nm) while recording electrical responses from the cell.\nFor synaptic stimulation start with a low LED intensity and increase until the desired synaptic current amplitude is reached. Trigger the LED by configuring digital outputs in the data acquisition software to control the timing and pulse length (examples in Figure 3).\n\t\tNote: other software and/or TTL-generating devices can be used to trigger LED.\nRepeat stimulation with opened or restricted aperture (step 3.4) in the microscope light pathway as desired for the next recorded cell and/or in the presence of specific drugs.\nAfter recording, fix slices for post-hoc analysis by sandwiching them between two filter papers and submerging them in 4% PFA O/N.\nAnalyze electrophysiological data.\n\tNote: Use appropriate software to visualize recorded sweep data for each individual stimulation offline. When analyzing effects of drugs, use peak detection routines to obtain time course of drug effect on synaptic current amplitudes for all individual sweeps. Determine when the drug effect reaches steady state. To prepare representative average responses for figures, use software to average ≥10 individual sweeps per experimental condition (c.f. Figure 3B-D, F-H, J right panel).\n\tNote: several alternative software packages can be used for data analysis.\n4. Post-hoc Analysis of Injection Sites",
    "Wash slices of injection sites (from step 2.12) and recording sites (if re-imaging is desired, from step 3.7) three times in PBS. This is done by repeatedly replacing solution with fresh PBS on a rotating shaker three times for 10 min.\nPrepare 2% agar-agar solution in PBS, and let it cool down to ~65 °C. Place slices flat on the bottom of a small 30 mm diameter petri dish, embed slices in agar-agar and let it cool down until solid.\nGlue an agar block with embedded slice or slices to the stage of a vibratome and place stage in cutting chamber with PBS.\nResection embedded slices to 70 µm thickness. Optional: After resectioning, slices can be stained, i.e., with Neurotrace to reveal cytoarchitecture (Figure 3A, C), and/or by immunofluorescence staining for YFP or mCherry to boost the signal from the ChR fusion protein.\nMount slices on slides and coverslip with mounting media. Image injection sites and, if desired, also image slices containing fibers in the projection areas using a fluorescent microscope or a confocal laser-scanning microscope (Figure 2A-C).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}