{
  "id": 10877,
  "origin_website": "Jove",
  "title": "Design and Fabrication of an Elastomeric Unit for Soft Modular Robots in Minimally Invasive Surgery",
  "procedures": [
    "Note: This protocol describes the fabrication phases of a single module, which includes the fluidic chambers, stiffening channel, actuation pipelines and external sheath. The following procedure has to be executed under a fume hood and wearing lab coat and gloves for safety reasons. As previously mentioned, the fabrication process of the elastomeric unit is based on the sequential use of molds designed with CAD software. They are composed of the 13 pieces shown in Figure 2 and listed in Table 1.\n1. Preparation of the Silicone\nWeigh 12 g of part A and 12 g of part B in the same plastic glass or Petri dish and mix them together, stirring.\n\tNote: Material proportions can vary depending on the specific silicone used, in this case it consists of two parts: part A (the base) and part B (the catalyst). They are used in proportion 1A:1B in weight.\nPlace the glass containing the mixed silicone materials in a degasser machine at 1 bar vacuum pressure. Keep the glass under vacuum until all the bubbles are removed from the silicone material. For the employed silicone the degassing process takes about 10 min. Once the materials are completely free from the presence of bubbles, restore the atmospheric pressure into the machine and use the silicone.\n2. Fabrication of the Siliconic Module\nAssembly of the mold.\n\t\nInsert the stiffening cylinder and the top of the chambers into cap_A (Figure 3a).\nClose the shells around the second layer of cap_A.\nFirst silicone casting.\n\t\nPour the silicone inside the assembled mold up to the edge of the shells (Figure 3b).\nPlace the mold in an oven at 60 °C for about 30 min.\nRearrangement of the mold.\n\t\nRemove the external shells and cap_A (Figure 3c).",
    "Insert the cylinders from the bases of the chambers and the stiffening cylinder inside cap_B (Figure 3d).\nClose the shells again around the module, sliding them of 10 mm upward in order to have a gap of 10 mm between the top surface of the module and the edges of the shells (Figure 3e).\nSecond silicone casting.\n\t\nPour the silicone inside the rearranged mold up to the edge of the shells on the top side (i.e. also up to the stiffening cylinder) (Figure 3f).\nPut the mold into an oven at 60 °C for about 30 min.\nRemove the external shells, cap_B and the chambers (except the stiffening cylinder) (Figure 3g).\n3. Insertion of the Tubes\nCut 3 tubes to the same desired length (300 mm for example).\nPut siliconic glue around one end of each tube for 10 mm, without obstructing the tubes.\nInsert the tubes inside the 2 mm dedicated channels in the siliconic unit (Figure 3h).\nAllow a curing time of 12 min at room temperature or put the module inside an oven at a higher temperature (50° - 60°) to speed up the drying process.\n4. Fabrication of the Crimped Braided Sheath\nCut 700 mm of an expandable braided sheath (about 15 times the height of the module).\nInsert a metallic cylinder of 30 mm in diameter and 250 mm in length inside the sheath.\nPush down and force the sheath by sliding over the cylinder, in order to create crimps.\nMechanically fix the sheath in place with a clamp and heat with a heating gun at 350 °C for 2-3 min until a permanent deformation is obtained.\nLet the sheath cool down and remove the internal cylinder.\n5. Integration of the External Sheath\nPass the tubes through the holes of cap_C.",
    "Pour 3 g of silicone into cap_C.\nClamp cap_C to a support that is higher than the work plane.\nInsert the bottom side of the module previously fabricated into cap_C.\nSlide the crimped sheath around the module.\nPush the first crimps of the sheath inside cap_C and dip them into the freshly poured silicone (Figure 3i).\nPut the mold into an oven at 60 °C for about 20 min.\nRepeat the same procedure from point 5.1-5.6 to fix the sheath at the top side, using cap_D (Figure 3j).\nRemove cap_C and cap_D.\nRemove the central cylinder (Figure 3k).\n6. Fabrication of the Granular Jamming Membrane\nPour 5 g of liquid latex into a plastic glass.\nImmerse the cylinder for the membrane (last piece shown in Figure 2) inside the liquid latex until the surface is completely covered.\nLet it dry under a hood for 20 min.\nRepeat points 6.2 and 6.3.\nRemove the membrane from the mold.\n7. Insertion of the Granular Jamming Membrane\nCut a tube (2 mm in diameter) to the desired length (300 mm for example).\nCut a squared piece of about 100 mm2 of nylon tissue and close one end of the tube with this tissue using a plastic paraffin film or superglue.\nWeigh 4 g of coffee powder and fill the membrane.\nInsert the tube (the end with the filter) inside the filled membrane and fix it around the tube using a plastic paraffin film.\nApply a vacuum on the other side of the tube (the membrane becomes stiffer).\nInsert the membrane inside the empty central channel of the siliconic module (Figure 3l).\nGlue the ends of the stiffening membrane to the silicone module.\nClose the rings around the top side of the module (Figure 3m).",
    "Pour 2 g of silicone into the rings in order to level the surface.\nLet the silicone dry under hood or in an oven at 60°.\nRemove the rings.\nRepeat from points 7.8 to 7.11 for the bottom side (Figure 3n).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}