{
  "id": 10542,
  "origin_website": "Jove",
  "title": "Antimicrobial Characterization of Advanced Materials for Bioengineering Applications",
  "procedures": [
    "1. Sample Preparation\nCut the material samples into 10 mm diameter disks with a 10 mm diameter cylindrical punch.\n\tNOTE: Brittle materials can be softened in suitable sterile solvents for 1 h and then cut into disks. For example, hydrophilic materials such as zinc alginate were tested following this protocol and were moistened in autoclaved water before cutting them in order to avoid sample breaking. However, other hydrophobic materials such as poly(3-hydroxybutyrate-co-3-hydroxyvalerate) do not need any kind of previous swelling in order to be properly cut.\nDry the sample material disks at 60 °C in a vacuum oven (<10-2 Torr) for 24 h.\n\tNOTE: Some materials may need a high drying temperature. However, it is important not to reach a temperature that could thermally degrade the material.\nMeasure the material film thicknesses with a digital caliper.\n\tNOTE: This protocol recommends the utilization of material films with constant and similar thicknesses when comparing the antimicrobial activity of different materials.\nSterilize each specimen by immersion in ethanol 70% for 10 min and subsequent ultraviolet (UV) radiation for 1 h per each side.\n\tNOTE: UV radiation can be performed placing each specimen in a sterile Petri dish inside a laminar flow hood with a 12.0 W lamp of UV-C radiation.\n\tCAUTION: Researchers should not expose themselves to UV radiation, because it is mutagenic.\nPerform steps 1.1, 1.2, 1.3 and 1.4. with the control material disks. \n\tNOTE: Polyethylene terephthalate (PET) or alternative non-antimicrobial materials could be used as control disks in the diffusion and contact method. Furthermore, when characterizing nanocomposites or treated materials, the base material should be used as control material.\n2. Recommended Microorganisms\nNOTE: We recommend the use of 3 different microorganisms to study the antimicrobial capacity of the tested material against a wide range of microorganisms.",
    "Use pure cultures of 3 microorganisms: the Gram-positive bacteria Staphylococcus aureus, the Gram-negative bacteria Escherichia coli, and the yeast Candida albicans.\n\tNOTE: Other microorganism species can also be tested with this protocol by modifying the incubation conditions if necessary.\n\tCAUTION: The required biosafety measurements must be followed according to the type of microorganism employed in this protocol.\nWork with pre-sterile or autoclaved material and use a Bunsen burner during the whole process of the microbial manipulation or a biological safety cabinet (if necessary) to ensure aseptic conditions.\n\tNOTE: Recommended autoclave conditions are 121 °C during 15 min for culture mediums and 121 °C during 20 min for the working material and biological residues.\n3. Agar Disk Diffusion Test (Diffusion Method)\nNOTE: When a liquid diffusion of antimicrobial compounds might be the main antimicrobial mechanism of advanced materials, the diffusion method can provide very useful information about the antimicrobial capacity of these materials. The material disk located at the center of the agar plate can form a transparent ring zone (halo) where a growth inhibition of microorganisms occurs after 24 h of culture (see Figure 1).\nDiffusion test procedure\nPrepare and autoclave tryptic soy agar (TSA) following the manufacturer’s instructions.\nPour the TSA into sterile Petri dishes under aseptic conditions using a Bunsen burner or a laminar flow hood.\n\t\tNOTE: The TSA plates must be 4–6 mm thick.\nCulture the different microorganisms to be tested aerobically for 18–24 h in the Petri dishes with TSA in an incubator at 37 °C.\nPrepare and autoclave tryptic soy broth (TSB) following the manufacturer’s instructions.\nPour the TSB in a 50 mL pre-sterilized centrifuge tube with a pre-sterilized serological pipette under aseptic conditions using a Bunsen burner or a laminar flow hood.",
    "Resuspend a few colonies from step 3.1.3 in 25 mL of TSB contained in a sterile centrifuge tube using a sterile cotton swab and vortex them for 1 min to achieve a uniform mixing.\nAdjust the absorbance (at 540 nm) of the culture with a spectrophotometer to the suitable number of colony forming units (CFU) per mL: approximately 1.5 x 108 CFU/mL for bacteria and from 1 x 106 to 5 x 106 CFU/mL for yeast.\n\t\tNOTE: The culture and cuvette volumes to measure the absorbance must be selected according to the type of spectrophotometer utilized.\nVortex the microbial broth for 5 seconds to improve the microorganism dispersion and briefly submerge a sterile cotton swab in this microbial suspension. Remove the excess of liquid from the swab by pressing it against the tube wall containing the culture.\nEvenly streak the microbial broth suspension with the sterile cotton swab onto the surface of the TSA plates in 3 planes to cover their whole surface with the microorganism and let it dry for 5 min after the inoculation.\n\t\tNOTE: To remove any moisture, the TSA plates must be placed open in an inverted position at 37 °C for 10–15 min before the inoculation.\nSterilize a pair of tweezers by immersing them in a beaker with ethanol 96% and then flaming them with a Bunsen burner or alcohol burner.\nPlace the sample disks to be tested and control disk at the center of the TSA plates using the pair of sterile tweezers.\nIncubate aerobically the TSA plates in an inverted position at 37 °C for 24 h.",
    "NOTE: In order to avoid any contamination risk, it is recommended to incubate the TSA plates in an inverted position. However, if the sample disk detaches from the TSA plates, do not perform this step in an inverted position. In this case, it is recommended to dry the plates in the laminar flow hood. This antimicrobial test must be performed at least in quadriplicate on different days to ensure reproducibility.\nChecking of microbial suspension concentration and purity\n\tNOTE: The following steps are necessary in order to check that the microbial concentration determined with the spectrophotometer in step 3.1.7 is correct and ensure that there was no microbial environmental contamination. A microbial environmental contamination can be easily detected by the appearance of various types of microbial colonies after 24 h of culture. Furthermore, no microbial contamination of the TSB medium during its manipulation in the decimal serial dilutions must be ensured with a negative TSB control plate.\n\t\nDispense the sterile TSB (prepared in step 3.1.4) into sterile microcentrifuge tubes using a micropipette with suitable autoclaved tips in aseptic conditions. One of them will be utilized as a negative TSB control.\nPerform decimal serial dilutions with the microbial broth suspension utilized in step 3.1.9 in the sterile microcentrifuge tubes containing TSB.\nSpread 100 µL of each dilution on TSA plates using a pre-sterilized Drigalski spatula or an alternative instrument. Also spread 100 μL of TSB medium without microorganism (prepared in step 3.2.1) on a TSA plate as a negative TSB control plate.\nIncubate aerobically the TSA plates aerobically at 37 °C for 24 h.\nCount the number of colonies to check that the CFU/mL are similar to that determined in step 3.1.7.\nCheck that there is no microbial environmental contamination on the TSA plates with only one type of colonies.",
    "Check that there is no microbial contamination on the TSB negative control plate showing no colonies\n4. Measurement of Antimicrobial Activity on Material Surfaces (Contact Method)\nNOTE: When surface contact might be the main antimicrobial mechanism of some advanced materials, the contact method can provide very useful information about the antimicrobial capacity of these materials. In this method, the microorganisms are placed directly onto the material surface and their growth inhibition can be determined after a certain amount of time.\nInitial procedure\nPrepare and autoclave TSB following the manufacturer’s instructions.\nPour the TSB in a 50 mL pre-sterilized centrifuge tube with a pre-sterilized serological pipette under aseptic conditions using a Bunsen burner or a laminar flow hood.\nCulture the different microorganisms to be tested aerobically overnight in the tube with TSB in an orbital shaker (140 rpm) at 37 °C.\nDilute the overnight culture in 20 mL of TSB in a 50 mL pre-sterilized centrifuge tube to a concentration of approximately 106 CFU/mL (determined with a spectrophotometer at 540 nm).\n\t\tNOTE: The culture and cuvette volumes to measure the absorbance must be selected according to the type of spectrophotometer utilized.\nPerform decimal serial dilutions of this culture in sterile microcentrifuge tubes containing TSB. Spread 100 µL of the culture on TSA plates and incubate it aerobically at 37 °C for 24 h. \nCount the number of colonies to ensure an initial cell concentration of approximately 1 x 106 CFU/mL\nPlace 4 control disks for microbial counting after 24 h and 4 sample disks of each type of the tested materials for microbial counting after 24 h in separates wells of a sterile 48-well plate.\nPipette 150 µL of the microbial suspension onto each disk surface.\nMicrobial counting on the control and tested materials (after 24 h)",
    "After step 4.1.6, aerobically incubate the 4 sample disks remaining in the 48-well plate at 37 °C for 24 h.\n\t\tNOTE: This 24 h incubation time can be modified in order to study the growth inhibition at shorter or longer times.\nAfter 24 h of incubation, pipette 850 µL of sterile PBS onto the surface of the 4 sample disks and mix it with the 150 µL of the microbial suspension.\nCollect the PBS/microbial suspension mixture and each disk from the 48-well plate and transfer them to a 10 mL pre-sterilized tube.\nVortex the PBS/microbial suspension mixture and each disk for 1 min, sonicate it at 50 Hz for 5 min and vortex it again for 1 min to ensure that no viable microorganisms remain adhered to the material surface.\nPerform decimal serial dilutions of each sonicated culture in sterile microcentrifuge tubes containing TSB and spread 100 µL of the culture on TSA plates and incubate it aerobically at 37 °C for 24 h.\nCount the number of colonies, which are the number of viable microorganisms on each sample and control disk surface. Express this number of viable cells in (CFU/mL).\nTake a photograph of the final microbial culture for the sample and control disks.\n5. Antimicrobial Results Analysis\nimgsrc://cloudfront.jove.com/files/ftp_upload/57710/57710fig1.jpg\nFigure 1: Measurements for the normalized width of the antimicrobial \"halo\". This panel shows the diameter of the inhibition zone (diz) and the disk diameter (d). Please click here to view a larger version of this figure.[href=https://www.jove.com//cloudfront.jove.com/files/ftp_upload/57710/57710fig1large.jpg]\nDiffusion method results analysis \nMeasure the diameter of the inhibition zone (diz) and the disk diameter (d) (see Figure 1) with a digital caliper.",
    "NOTE: The inhibition zone or antimicrobial “halo” is formed as a consequence of the microbial growth inhibition produced by the antimicrobial material disk (see Figure 1). It is possible to observe that there is a transparent ring zone close to the sample in comparison with the rest of the plate where the microorganisms have grown properly (opaque zone).\nDetermine the normalized width of the antimicrobial “halo” (nwhalo) of each disk by applying equation (1).\n\t\t(1)     imgsrc://cloudfront.jove.com/files/ftp_upload/57710/57710eq1.jpg\nDetermine the mean and standard deviation of the normalized width of the antimicrobial “halo” with the 4 determined nwhalo values of each sample.\nTake a photograph of the final microbial culture with the material disk.\n\t\tNote: The diameter of the inhibition zone (diz) and the disk diameter (d) can also be measured from the photograph taken in step 5.1.4 by using a suitable image processing software.\nContact method results analysis\nDetermine the number of viable microorganisms recovered according to equation (2).\n\t\t(2)     imgsrc://cloudfront.jove.com/files/ftp_upload/57710/57710eq2.jpg\n\t\tNOTE: Here, N is the number of viable microorganisms recovered per cm2 per test specimen; C is the plate count; D is the dilution factor; A is the surface area of the test specimen in cm2 determined with the sample disk diameter.\nDetermine the loss of viability (LV) to reflect the inhibition of cell growth by applying equation (3).\n\t\t(3)     imgsrc://cloudfront.jove.com/files/ftp_upload/57710/57710eq3v3.jpg\n\t\tNOTE: Here, C is the average number of viable microorganisms (N) in CFU/mL•cm2, recovered from the control specimens after 24 h; S is the number of viable microorganisms (N) in CFU/mL•cm2, recovered from the test specimens after 24 h.\nDetermine the mean and standard deviation of the loss of viability with the 4 determined LV(%) values of each sample."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}