{
  "id": 19553,
  "origin_website": "Jove",
  "title": "Tactile Semiautomatic Passive-Finger Angle Stimulator (TSPAS)",
  "procedures": [
    "Written informed consent was obtained from the subjects in compliance with the policies of the local medical ethics committee of Okayama University. The testing procedures gained review and consent from the local medical ethics committee of Okayama University.\n1. Detailed composition and function of equipment\nTactile angle stimuli\n\t\nThe TSPAS uses two-dimensional (2D) raised angles to slide passively across the skin and form a tactile spatial representation of the angles (Figure 2). The tactile angles consist of plastic lines and square bases, which are both made from a transparent acrylic sheet. Because the lines composing the angles are equal and symmetrical, by symmetrically changing the spatial dimensions of the lines, all types of raised plane angles can be created.\nUsing a milling machine, cut the acrylic sheet into the polyline with two equal lines (8.0 mm long, 1.5 mm wide, and 1.0 mm high) symmetrically distributed along an imaginary bisector and the square base (40.0 mm long and wide, 3.0 mm high).\nGlue the polyline to the center of the square base to create a 2D raised tactile angle stimulus.\nMake pieces with angle sizes ranging from 50° to 70° in 2° increments. The end point distances (d, see Figure 2) of these angles are 6.8 mm, 7.0 mm, 7.3 mm, 7.5 mm, 7.8 mm, 8.0 mm (60° angle), 8.2 mm, 8.5 mm, 8.7 mm, 8.9 mm, and 9.2 mm. To reduce the impact of the end point distance on angle discrimination to the minimum, use a 60° angle as the reference angle, and other angles as comparison angles.",
    "Make up 20 pairs of discriminated angles, including 20 identical reference angles and 10 pairs of identical comparison angles whose measured accuracies are ± 0.2°. Ensure that the reference angle is presented first 50% of the time when each pair is tested. The experiment can be easily and conveniently updated with tactile angle stimuli.\nimgsrc://cloudfront.jove.com/files/ftp_upload/61218/61218fig02.jpg\nFigure 2: Example of tactile angle stimuli.\n(A) An example of the reference angle (60°) and two (50° and 70°) of the ten comparison angles used in the experiment. In particular, detailed parameters of the reference angle were drawn. d represents the end point distance, R represents the radius of curvature in the local apex, and r represents the radius of curvature in the end point. (B) Example of a raised angle seen in 3D. The height of the raised line is 1.0 mm from the 3D view. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/61218/61218fig02large.jpg]\nHand plate\n\t\nTo stabilize the subject's hand, craft a hand plate perpendicular to the electronic slide (Figure 3). First, using a milling machine, cut a 5.0 mm thick acrylic sheet into a 14.0 cm x 22.0 cm rectangle plate, and then fasten the rectangle plate to a base (14.0 cm wide, 14.0 cm long, and 8.5 high) with tape and glue. After that, using a milling machine, cut a rectangular opening (2.5 cm wide and 5.0 cm long) in the upper left corner of the plate. This allows only the index finger to contact the angle stimulus. Before the experiment, fix the subject's right hand wrist with nylon tape, and then instruct the subjects to lightly place their right index fingers at the opening of the plate.\nimgsrc://cloudfront.jove.com/files/ftp_upload/61218/61218fig03.jpg\nFigure 3: Hand position of the subject and tactile angle stimuli movement direction.",
    "The right hand of the subject was secured with nylon tape, and the subject was instructed to place his or her right index finger into the opening in the plate. The angle stimuli were clamped on the apparatus and were horizontally moved by the electronic slide to passively slide across the fingerpad. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/61218/61218fig03large.jpg]\nMotorized linear slide\n\t\nThe electronic slide with a maximum motion distance of 51.0 cm is moved in a straight direction using an easy linear motion motor with 5.0 cm high, 5.4 cm wide, and 71.0 cm long (see Table of Materials), which is a linear-motion system. Connect the motor to a personal computer and set and edit various data using dedicated data editing software (see Table of Materials). Ensure that these settings can make the electronic slide move a specified distance using a given speed with respect to the reference point. This is necessary when moving the angle stimuli directly from an arbitrary position to a specified position.\nComputer control system\n\t\nThe TSPAS is a semiautomatic, computer-controlled system. The data editing software used to control the movement of the slide is PC-based software for editing the data necessary for the operation of motorized actuators. In the experiment, set the velocity of the slide at 20 mm/s and its moving distance at 80 mm for each trial. Each time a button is clicked, the slide moves as previously set.\n2. Running an experiment",
    "Before the experiment, first set the motion type as ‘INC’, motion distance as ‘80 mm’, motion speed as ‘20 mm/s’, motion function as ‘single’, and axis as ‘ID = 0’ in the data editing software (see the operating manual in the Table of Materials for instructions on how to set parameters) to ensure that the electronic slide can move both at a distance of 80 mm and a speed of 20 mm/s forward and backward, and at other distances and speeds.\nRecruit subjects whose fingers are free of injuries and calluses. Try to recruit an equal number of male and female subjects within the age range from 18–35 years old. Note that there is a difference in tactile spatial acuity between female and male subjects, as well as old and young subjects25,26.\nBlindfold the subject and sit him or her at a table with the apparatus (Figure 1). Fix the right hand of the subject with nylon tape and subsequently instruct the subject to lightly place his or her right index finger at the opening of the hand plate (Figure 3).\nClamp a pair of angles, including the reference angle and the comparison angle, on the slide. After clicking the button, the pair of angles slide for a total distance of 80 mm. They passively go across the index fingerpad at a speed of 20 mm/s. Because there is a distance of 31.8 ± 0.8 mm between the reference angle and comparison angle, their interstimulus time interval is approximately 1.6 s.",
    "After the subject perceives the sizes of the angles, he or she orally reports which of the two angles is larger. If the subject cannot identify which angle is larger, he or she can indicate that the angles are the same. Register the answer of the subject as the response data. After that, the next pair of angles will be continually replaced, presented, and perceived in the same way.\nThere are a total of 10 pairs of angles in the formal experiment. Present each pair 10x in a pseudorandom order in which the reference angle passes first 50% of the time. Thus, the experiment contains 100 trials. To avoid uncomfortable sensations on the index finger, after each series of 20 trials have the subject take a 3 min break. Before the experiment, each subject practices 10 trials with other angles to be familiar with the experimental procedure. The experiment should last ~40 min.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}