{
  "id": 18165,
  "origin_website": "Jove",
  "title": "Visualizing Surface T-Cell Receptor Dynamics Four-Dimensionally Using Lattice Light-Sheet Microscopy",
  "procedures": [
    "5C.C7 TCR-transgenic RAG2 knockout mice in B10.A background were used in this study according to a protocol approved by the Institutional Animal Care and Use Committee of the University of Chicago.\n1. Harvest and Activate T Cells\nNOTE: This part of the protocol is based on previous protocols. See citations for further detail20,21.\nEuthanize a 10-12 week-old 5C.C7 transgenic mouse of either sex (~20-25 g) according to the approved IACUC protocol (i.e., CO2 chamber followed by cervical dislocation).\nSpray mouse carcass thoroughly with 70% ethanol to soak down the fur and bring into a BSL-2 safety cabinet.\nTurn mouse onto its right side and make a small incision in the body cavity with surgical scissors. Remove the spleen using surgical forceps. Cut away connective tissue as needed with surgical scissors.\nPlace the spleen in a 70 µm-pore mesh cell strainer and mash with the back of a 1 mL syringe plunger. Wash through the strainer thoroughly with complete RPMI (RPMI with 10% fetal bovine serum [FBS], 2 mM L-glutamine, 1% penicillin/streptomycin, 50 µM 2-mercaptoethanol).\nCentrifuge the single cell suspension of splenocytes at 300 x g for 5 min. Discard the supernatant.\n\tNOTE: The pellet at this point will be red.\nResuspend the splenocytes in 5 mL RBC lysis buffer. Incubate for 5 min, then quench with 5 mL of complete RPMI.\nCentrifuge the single cell suspension of splenocytes at 300 x g for 5 min. Discard the supernatant.\n\tNOTE: The pellet at this point should be white, not red.\nResuspend the pellet in 5 mL of complete RPMI.\nTransfer to a T-25 flask and add 10 µM moth cytochrome-C (MCC, sequence ANERADLIAYLKQATK). Put the cells in a cell culture incubator at 37 °C, 5% CO2 overnight.",
    "On the next day, add recombinant mouse IL-2 to a final concentration of 100 U/mL.\nObserve for the following days, adding fresh media as the current media turns yellow. T cells will die if left in yellow media unattended for over 48 h. Cells are ready to use 6-10 days after harvest.\n2. Prepare Cells\nIncubate 5 mm round coverslips with 0.1% poly-L-lysine for 10 min. Aspirate off and let dry naturally.\nUse a density gradient reagent (see the Table of Materials) to separate out dead cells and to obtain 1 x 106 T cells and 1 x 106 APCs (CH27 cells21,22 transduced with cytosolic mCherry) separately.\n\tNOTE: Cells are counted using a hemocytometer.\n\t\nAdd 3 mL of density gradient reagent to a 15 mL conical tube and add cells dropwise to the edge of the tube carefully. Do not mix. Centrifuge at 930 x g for 10 min at 4 °C; use acceleration/deceleration: SLOW/SLOW. Remove the thin middle layer of cells between the complete media and the density gradient reagent carefully, putting each cell type into separate conical tubes.\n\t\tNOTE: It is necessary to prepare more cells than needed for imaging, as we find that 50% is lost on average during the process. The more cells used for the process, the easier it is to harvest them from the density gradient. We use 4-8 mL of both cell types to ensure excess cells. If desired, cells can be counted before this step to ensure volume needed. Any extra cells are put back into their respective flasks.",
    "Wash both tubes of T cells and CH27 cells three times with 5 mL complete RPMI (300 x g for 5 min). Discard the supernatant each time during the wash. Resuspend each tube in 1 mL complete RPMI and count cells by a hemocytometer.\nResuspend 1 x 106 APCs in 500 µL complete RPMI and add 10 µM MCC. Incubate for 3 h at 37 °C, 5% CO2. Wash cells three times with 500 µL complete RPMI (300 x g for 5 min). Discard the supernatants.\nResuspend 1 x 106 T cells in 500 µL complete RPMI. Add 2 µg of anti-TCRβ Alexa488-labeled Fab (clone H57) to 500 µL of cells. Incubate for 30 min at 37 °C, 5% CO2. Wash cells three times with 500 µL of complete RPMI (300 x g for 5 min). Discard supernatant after each wash.\n\tNOTE: The divalent anti-TCR antibody was cut into monovalent Fab using a Fab preparation kit (see the Table of Materials) to avoid crosslinking the T cell receptors by the divalent antibody (this step is optional).\nResuspend both cell types in 500 µL of imaging media (phenol red-free Leibovitz's L-15 medium with 10% FBS, 1% penicillin/streptomycin, 2 mM L-glutamine).\n3. Conducting LLSM Daily Alignment\nNOTE: (Important) This alignment protocol is based on the LLSM instrument used (see the Table of Materials). Each LLSM may be different and require different alignment strategies, especially those that are home-built. Carry out the appropriate routine alignment and continue to section 4.",
    "Add 10 mL of water plus 30 µL fluorescein (1 mg/mL stock) to the LLSM bath (~10 mL volume), press Image (Home) to move the objective to image position, and look at a single Bessel laser beam pattern. Align the laser beam using the guides and pre-set region of interest (ROI) to make the beam a thin pattern balanced in all directions.\n\t\nThe beam should also appear focused in the finder camera. Use two mirror tilt adjustors, top micrometer, focus, and emission objective collar to adjust. See Figure 2A,B for correctly aligned beam.\nWash the bath and objectives with at least 200 mL of water to completely remove fluorescein.\nImage standard fluorescent beads in the imaging media (prepared by adhering beads to a 5 mm coverslip with poly-L-lysine, see the Table of Materials; this can be pre-prepared and re-used) for physical point spread function (PSF) in imaging media.\n\tNOTE: There can only be one bead in view for later processing, so try to find a bead that is by itself in the viewer or can easily be cropped to obtain a single bead.\n\t\nTurn on dither by setting to 3 in the 'X Galvo range' box. Press Live to view the current field. Move along the Z direction to find the cover slip and beads. Find the center of a bead by moving along Z, press Stop to pause the laser. Check 3D, press Center and then press Execute. This will collect the data.\nManually adjust the tilt mirror, objective collar, and focus micrometer for highest gray values, then adjust as necessary to obtain proper patterns for objective scan, z galvo, z+objective (totPSF), and sample scan (samplePSF) capture modes. See Figure 2C-F for properly adjusted maximum intensity projections (MIPs).",
    "NOTE: The various captures modes (objective scan, z galvo, z+objective, and sample scan) change how the light-sheet moves through the sample. All scan modes should be used for alignment.\nThe sample scan shows how data will be collected during the experiment. Collect the sample PSF by pressing Execute in sample scan mode for deskewing and deconvolution (see section 5). Change lasers to three color mode (488, 560, 647) and press Execute again.\n\t\tNOTE: Since the LLSM images at an angle (57.2°), images captured in the \"sample scan\" mode are collected at this angle, and are therefore \"skewed\". De-skewing is the process of correcting for this angle and \"re-aligning\" the image to a true z-stack. These data must be collected in imaging media and in all channels that will be imaged during the experiment. If this is not collected properly, the data will not be properly de-skewed. Similarly, make sure media has been warmed to 37 °C (or desired experimental temperature).\n4. Setting Up Cells with LLSM\nAdd 100,000 APCs (50 µL) from step 2.5 to a 5 mm-diameter circular coverslip from step 2.1 and allow them to settle for 10 min.\nGrease the sample holder then add the coverslip cell-side-up to it. Add a drop of imaging media to the back of the coverslip to avoid bubbles before placing in the bath. Screw the sample holder onto the piezo, and press Image (Home).\nFind an APC to image to ensure that the LLSM and imaging software (see Table of Materials) are functioning properly.",
    "NOTE: We image at 0.4 µm step size with 60 z-steps and 10 ms exposure for two colors with dither set to 3, which results in 1.54 s per frame of 3D image with ~200 nm XY and 400 nm Z resolution. These settings may need to be adjusted based on cell size, desired z-resolution, and strength of signal from the fluorescent labeling technique used. Laser power usage will also vary based on fluorescent labeling technique used.\n\t\nPress Live to view the current image. Move along Z to find the cover slip and cells.\nFind the center of an APC by moving in the Z direction, then press Stop to pause the laser. Check 3D and input the desired settings (see step 4.3.1), press Center and then press Execute. This will collect the data.\nLower the stage to load position and add 50 µL of T cells in imaging media (100,000 cells, from step 2.5) dropwise directly over the coverslip. It is best to let a drop form on the end of the pipette tip and then touch the tip to the bath liquid. Raise stage back by clicking \"Image (Return)\".\nBegin imaging. Be sure to set the desired stack size and time lapse length. For example, image 60 z-stacks at a 0.4 µm step size and input 500 time frames. (Typically) stop recording before 500 frames are reached to avoid photobleaching. Use Live mode to search for cell pairs, and when ready and desired settings have been entered, press Execute to collect data. See Movie 1 and Figure 1 for an example.\n5. Track Surface Dynamics\nExport the data from the imaging software (see the Table of Materials). This will create z-stack TIF files for every time point in each color.\nFirst deskew and deconvolve the data.",
    "NOTE: We use the LLSpy pipeline under license by HHMI's Janelia Research Campus18, but deskewing and deconvolution are also available within multiple imaging softwares (see Table of Materials).\nDebleach the data.\n\tNOTE: We use Fiji's debleach feature with histogram matching (Fiji Pathway: Image | Adjust | Bleach Correction | Histogram Matching | OK).\nImport into the tracking software (see the Table of Materials). Track clusters according to software specifications. See Movie 2 for an example.\n\tNOTE: Tracking results will depend upon the tracking software used, algorithm chosen, desired output parameters selected, etc. For example, in the tracking software we utilized (see the Table of Materials), we chose to allow the software to track irregular shapes, rather than assigning each feature a single spot, since TCR clusters are not organized into perfect spheres. In addition, we chose to collect 35 parameters, including speed, direction, volume, intensity, area, location, and track duration information. However, different methods or parameters will be beneficial to answer different questions.\n\t\nIf tracking is not desired, use the ClearVolume plugin for Fiji for visualizing and creating movies from hyperstack data.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}