{
  "id": 11152,
  "origin_website": "Jove",
  "title": "Patient-specific Modeling of the Heart: Estimation of Ventricular Fiber Orientations",
  "procedures": [
    "1. Fiber Orientations Estimation\nAcquire structural  MRI and DTMRI images of a normal adult human heart in diastole, at a resolution  of 1 mm3. Using ImageJ, extract the ventricular myocardium from the atlas  structural image by fitting, for each short-axis slice, closed splines through  a set of landmark points placed along the epicardial and endocardial boundaries  in the slice (Figure 2A & Figure 2B). Perform the placement of landmark points  manually for every 10th slice in the image. Obtain the landmark  points for the remaining slices by linearly interpolating the manually  identified points, using MATLAB.Reconstruct the fiber orientations of the  atlas heart by computing the primary eigenvectors of the DTs in the DTMRI image  (Figure 2C).\nAcquire an image of  the geometry of the patient heart in diastole using in vivo cardiac CT or MRI.  Reconstruct the patient heart geometry from the  image similarly to the way the atlas was built (Figure 3A & Figure 3B).  The patient image should be re-sampled prior  to reconstruction such that the in-plane resolution is 1 mm2.  Similarly, the number of slices for which landmarks are manually picked, and  the interval of out-of-plane interpolation must be adjusted so that the  segmented patient heart image has a slice thickness of 1 mm.",
    "Deform the atlas  ventricular image to match the patient geometry image in two steps. In the  first step, perform an affine transformation based on a set of thirteen  landmarks points: the left ventricular (LV) apex, the two right ventricular  (RV) insertion points at the base, the two RV insertion points midway between  base and apex, and four sets of two points that evenly divide RV and LV  epicardial contours at base, and midway between base and apex (Figure 4A &  Figure 4B). In the second step, deform the affine-transformed atlas ventricles  further to match the patient geometry, using large deformation diffeomorphic  metric mapping (LDDMM) (Figure 4C).\nMorph the DTMRI image  of the atlas by re-positioning of image voxels and re-orientating the DTs  according to the transformation matrix of the affine matching and the  deformation field of the LDDMM transformation. Perform the re-orientation of  the DTs using the preservation of principal directions (PPD) method.\nObtain the estimate  of the patient fiber orientations from the morphed atlas DTMRI image by  computing the primary eigenvector of the DTs (Figure 5).\n2. Measurement of Estimation Error\nAcquire ex vivo structural  MR and DTMR images of six normal and three failing canine hearts, at a resolution  of 312.5×312.5×800 μm3. Here, heart failure should be generated in the  canines via radiofrequency ablation of the left bundle-branch followed by 3 weeks  of tachypacing at 210 min-1.\nSegment the  ventricles from the canine hearts similarly to the human atlas heart, as  described in §1.1. Denote ventricles segmented from normal canine hearts as  hearts 1 through 6, and those segmented from failing canine hearts as hearts 7  through 9 (Figure 6).\nObtain five different  estimates of ventricular fiber orientations of heart 1 by using each of hearts  2 to 6 as an atlas (Figure 7).",
    "Estimate fiber  orientations for each of the failing ventricles using heart 1 as the atlas  (Figure 8).\nForeach data point in  each set of estimated fiber orientations, compute the estimation error as|θc-θa| , where θc  and   θa are the  inclination angles of estimated and acquired fiber orientations at that point,  respectively.\nFor each data point  in each set of estimated fiber orientations, compute the acute angle  betweenestimated and acquired fiber directions in three-dimensions (3D) by  means of thevector dot product.\n3. Measurement of the Effects of Estimation Error on Simulations\nFrom heart 1, construct  six models, one with the DTMRI-acquired fiber orientations of heart 1 (referred  to as model 1), and five with the five estimated fiber orientations datasets  (models 2 to 6).For each of the three failing heart geometries, construct two  ventricular models, one with the DTMRI-acquired fiber orientations and the  other with the estimated fiber orientations. Here the spatial resolution of the  models, computed in terms of the average edge length of the meshes, should be  about 600 μm. Denote the heart failure models with DTMRI-acquired fibers as  models 7 to 9, and those with estimated fibers as models 10 to 12.In the  models, use monodomain representation to describe the cardiac tissue, with  governing equations:\nimgsrc://cloudfront.jove.com/files/ftp_upload/50125/50125eq1.jpg",
    "where σbis the  bulk conductivity tensor which is calculated  from the bidomain conductivity tensors as described by Potse et al30; Vm is the transmembrane potential; Cm is the membrane specific capacitance; and Iion is the density of the transmembrane current, which in turn depends on Vm and a set of state variables μ describing the dynamics of ionic  fluxes across the membrane.For Cm , use a value of 1 μ F/cm2. For σi in normal canine heart models, use longitudinal and  transverse conductivity values of 0.34 S/m and 0.06 S/m, respectively.  Represent  llon by the  Greenstein-Winslow ionic models of the canine ventricular myocyte. Decrease the  electrical conductivities in canine heart failure ventricular models by 30% (Figure 9).\nUsing the software  package CARP (CardioSolv, LLC), simulate sinus rhythm with all models. Induce reentrant  ventricular tachycardia (VT) in the six failing models using an S1-S2 pacing  protocol. Choose the timing between S1 and S2 to obtain sustained VT activity  for 2 sec after S2 delivery. If VT is not induced for any S1-S2 timing, decrease  the conductivities by up to 70% until VT was induced (Figure 10).\nFor each simulation,  calculate pseudo-ECGs by taking the difference of extracellular potentials  between two points in an isotropic bath surrounding the hearts. Place the two  points near the base of the heart separated by 18 cm, such that the line  connecting them is perpendicular to the base-apex plane of the septum as  illustrated in Figure 10. For each simulation with estimated fiber orientations,  compute the MAD metric as\nimgsrc://cloudfront.jove.com/files/ftp_upload/50125/50125eq2.jpg",
    "where X is the ECG waveform of the simulation  with estimated fiber orientations, Y is the ECG waveform of thecorresponding simulation with acquired fiber  orientations, X is the  mean value of X,Y is the  mean value of Y, and n is the length of X and Y.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}