{
  "id": 18967,
  "origin_website": "Jove",
  "title": "Identification of Disease-related Spatial Covariance Patterns using Neuroimaging Data",
  "procedures": [
    "1. Data Collection and Preprocessing\nThe SSM/PCA method can be applied to single volume images obtained from various sources and modalities. Specifically, for on-site PET imaging of metabolism, prepare a suitable radionuclide tracer such as [18F]-fluorodeoxyglucose (FDG) and administer to each patient. Patients are usually scanned at rest with eyes open, following a fast of at least 12 hr, off medications.\nScan each subject for individual or group assessment. For pattern derivation, scan an equal number of gender- and age-matched patients and controls.\nTransfer data to a workstation and convert to an appropriate format for analysis in your platform. Our windows PC based MATLAB analysis software (scanvp, ssm_pca, www.feinsteinneuroscience.org[href=http://www.feinsteinneuroscience.org]) requires ANALYZE or nifti format images (Mayo Clinic, Rochester, MN). It provides a conversion routine to transform GE Advance (Milwaukee, WI, USA) scanner and other format images to ANALYZE format.\nNormalize each subject's image to a common stereotaxic space (e.g. Montreal Neurological Institute [MNI]) using a standard neuroimaging software package such as statistical parametric mapping (SPM) (http://www.fil.ion.ucl.ac.uk/spm[href=http://www.fil.ion.ucl.ac.uk/spm]) so that there is a one-to-one correspondence of voxel values between subjects (Figure 2). Masking to limit the analysis to gray matter areas (Figure 3) and log transformation are described in the next steps.\n2. Perform Multivariate SSM/PCA\nOperations for multivariate SSM/PCA (Figure 4) can be performed by external software. The steps itemized below reflect the procedures performed for the most part automatically by our in-house routines (Figure 5) (scanvp/ssmpca, www.feinsteinneuroscience.org[href=http://www.feinsteinneuroscience.org] also available as an SPM toolbox ssm_pca).",
    "Mask data using an available 0/1 image to remove unwanted areas of the voxel space such as white matter and ventricles. Using the ssmpca routine, the user is given an option to select the default or other external mask (Figure 3) or to have the program automatically create a mask by removing values lower than a selected fixed percent of each subject's data maximum. Individual subject masks are then multiplied to determine a composite mask. The areas within the mask define a common non-zero voxel space for the analysis.\nConvert each subject's 3D masked image voxel data to one continuous row vector by appending sequential scan lines from consecutive planes (Figure 4a). Form a group data matrix (D) so that each subject's data corresponds to a specific row of the matrix. Each column then represents a particular voxel across subjects. Ideally, for biomarker derivation, the matrix will be composed of an equal number of rows of normal control subject data and disease subject data.\nTransform each data entry to logarithmic form.\nCenter the data matrix by subtracting each row average or subject mean from the row elements. The average of all centered rows represents a characteristic group mean log image termed a group mean profile (GMP, Figure 4a). Subtract the column means that are the elements of the GMP from the corresponding matrix column elements. Each row of the double centered matrix represents a 'residual' image termed a subject residual profile (SRP) whose elements represent deviations from both the subject s and voxel v group means (Figure 4b).\n SRPsv = logDsv - means - GMPv",
    "Construct the subject-by-subject covariance matrix C of the composite double centered data matrix by computing the non-normalized covariance between each subject pair i, j of SRP matrix rows evaluated as a product of corresponding voxel elements summed over all voxels v (Figure 4b).\n Cij =∑v (SRPiv x SRPjv)\nApply PCA to the subject-by-subject covariance matrix C. The results will be a set of subject score eigenvectors with associated eigenvalues. Weight each vector by multiplying by the square root of its corresponding eigenvalue. The set of score eigenvectors is represented by the columns of the resulting matrix S in Figure 4c.\nVoxel eigenvectors for the same set of eigenvalues can be determined by applying PCA to the column by column covariance matrix or by this alternative computationally less demanding procedure depicted in (Figure 4c). Left multiply the previously derived score vector matrix by the transpose SRP matrix to derive an array P of voxel pattern eigenvectors in descending order of eigenvalues (Figure 4c, Figure 6, Figure 7a).\n P = SRPT x S\n Each column vector represents a principal component (PC) image pattern of the SSM/PCA analysis attributed to a percent of the total variance accounted for (vaf) corresponding to the relative size of its eigenvalue.\n3. Pattern Biomarker Derivation\nExamine the results of the preceding analysis to determine PC patterns that are associated with high vaf values. Within our routine, voxel pattern vectors are Z-transformed so that their values represent positive and negative standard deviations from their mean value. They are then reshaped into image format prior to display (Figure 7a).",
    "In some cases patterns with known regional deviations associated with the disease can be visually identified. The mathematical formulation considers positive and negative forms of the derived PCs as equivalent solutions in which case both the PCs and their associated scores may be multiplied by minus one to conform to a physically correct interpretation.\nScores corresponding to each PC pattern are displayed as bar graphs and scatter plots (Figure 7). An optional ROC plot can be generated (Figure 7d) . To identify a disease-specific pattern, notice the differentiation of subject scores between patients and controls reflected by the p-values of the corresponding two-sample t-tests and AUC values. Limit the analysis to those PCs associated with a high vaf and high differentiation for some fixed cutoff values (e.g., p < 0.05 and vaf > 5%). Typically, only one or two PCs satisfy this criterion for PET data.\nThere are various other ways for PC selection that can be considered44. The scree plot of sequential eigenvalues (Figure 6) may give a sharp cutoff value represented by a bend in the curve and a sharp reduction in the slope of the curve where eigenvalues begin to degenerate. Another approach is to include all PCs that account for the top 50% of the variance. A widely accepted procedure is to compute the Akaike Information Criterion (AIC)45 to determine which combination of PCs define the model with the lowest AIC value that can distinguish between patients and controls.",
    "The selected PC(s) can be vector normalized and linearly combined to yield a single disease-related pattern. Our software optionally uses the MATLAB function glmfit to determine coefficients based on logistic or other regression models applied to subject scores. Although differentiation of patient and control groups usually improves with the additional PCs considered in the derivation group, the resultant patterns are a composite representation that may not correspond to a single physical network or may incorporate outlier deviations (Figures 7a and 7c).\nFurther validation is required for reliability and prospective significance. Bootstrap resampling can be performed as discussed below8 to identify the most reliable voxels within the original derivation dataset associated with the least standard deviation in repeated pattern derivation. Forward validation is performed to test for the sensitivity and specificity of independent group discrimination by deriving scores for prospective groups of patients and controls using the single-subject score evaluation method (Figure 4d) described in the next segment of the protocol.\n4. Single-subject Prospective Score Evaluation using a Predetermined Biomarker\nOnce a significant SSM-GIS biomarker pattern has been identified, a score for its expression in a prospective subject can be evaluated from that individual's scan using a simple computation of the internal vector product of the subject's SRP vector and the GIS pattern vector (Figure 4d, Figure 7d).\n SCORE = SRPs • Pattern",
    "The previous operation is automated by our TPR routine. However, to independently derive the subject SRPs vector use the associated intrinsic GIS mask on the log transformed data and subtract both the subject mean and the corresponding voxel values of the prederived reference group GMP as in step 2.4. This insures that scores can be compared to the predetermined reference range. Scores for a new group can be similarly evaluated as a set of prospective single subject scores. For use with a different reference group or setting, GMP can be recalibrated while the pattern is unchanged.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}