{
  "id": 5306,
  "origin_website": "Bio",
  "title": "Activity-based Pull-down of Proteolytic Standard and Immunoproteasome Subunits",
  "procedures": [
    "Preparation of cell materialCulture MH-S cells in complete growth medium.Note: This protocol was tested in the murine alveolar macrophage cell line MH-S purchased from ATCC (No. CRL-2019). Cells were passaged at 70-90% cell density in a 1:6 up to 1:12 ratio (splitting frequency approx. 3-5 days). 12 x 106 cells were seeded in 15 cm cell culture dishes the day before treatment, but numbers may vary if other cell lines are used. Further information about cell culture and treatment are stated in Chen et al. (2016).Harvest cells and pellet at 800 x g for 5 min at RT, remove supernatant.Wash cells with 5 ml of PBS and pellet at 800 x g for 5 min at RT.Re-suspend cells gently in 400 µl of TSDG buffer.Note: Lysis in TSDG buffer helps to sustain standard and immunoproteasome activity by stabilizing proteasome complexes.Lyse cells with seven repeated cycles of freezing tubes in liquid nitrogen and thawing them in a water bath with water at room temperature until crystals disappear.Note: The use of a floater facilitates the handling of several tubes in parallel.Centrifuge at 14,000 x g for 20 min to remove cell debris and transfer the supernatant to a fresh tube.Determine protein concentration (for example with BCA protein assay, Bio-Rad).Store samples at -80 °C.ABP labeling of the standard and immunoproteasomeTreatment with Biotin-Epoxomicin (Bio-EP)Note: Bio-EP is a biotinylated ABP that irreversibly binds to active catalytic subunits of both standard and the immunoproteasome.Thaw cell lysate on ice and transfer volume equivalent to 500 µg of protein into a 1.7 ml tube. Note: For each cell lysate, prepare two tubes. One tube serves as vehicle control and will be incubated with DMSO instead of Bio-EP. Fill up to 500 µl with 50 mM HEPES (pH 7.4). The final protein concentration is 1 mg/ml.",
    "Add Bio-EP at a final concentration of 5 µM (for example 5 µl of a 500 µM stock), respectively, add the same amount of DMSO to the control tube.Incubate tubes for 120 min at 37 °C on a Thermomixer at 600 rpm.Note: Meanwhile, equilibrate the columns for size exclusion chromatography (steps B2a-B2e) and prepare the beads for pull-down (steps C1a-C1d).Fill up to 1 ml with 50 mM HEPES (pH 7.4). The final protein concentration is 0.5 mg/ml.Note: A volume of 1 ml for SEC conforms manufacturer’s recommendation.Size exclusion chromatography (SEC)Note: SEC is performed to remove unbound ABP from the sample. Free ABP is retained in the column resin whereas large proteins like the standard and immunoproteasome pass through. Use a fresh PD MidiTrap G-25 column for each sample. Perform SEC also on vehicle control samples.Remove the top cap from the column and pour off the storage solution.Use forceps to remove the filter on top of the column resin.Remove the bottom cap and insert the column into a 50 ml collection tube using the blue adapter delivered by the manufacturer.Equilibrate column 2 x with 5 ml of ultrapure water and discard the flow-through. Fill the column a third time with ultrapure water and spin down at 1,000 x g for 2 min in a centrifuge at RT.Note: Don’t let the column run dry for a longer period. Cap the wet column with the bottom cap before centrifugation to pause equilibration until all samples are ready for application. Remove the cap and centrifuge the remaining liquid to resume with the protocol as soon as all samples are ready. Discard the flow through and transfer the column with the adapter to a fresh 50 ml Falcon tube labeled with the samples name.",
    "Slowly pipette the sample dropwise in the middle of the packed bed and centrifuge at 1,000 x g for 2 min.Discard the column and store the 50 ml Falcon tube containing the eluate on ice.Pull-down of ABP-labeled subunitsPreparation of streptavidin beadsNote: Can be done during ABP incubation (step B1d).Transfer 40 µl of the 50% streptavidin bead slurry (= 20 µl of beads) to a 1.7 ml tube.Note: Vortex slurry before transfer. Use a 200 µl pipette and cut the end of the pipette tip with scissors, otherwise beads will plug the pipette tip.Wash beads 3 x with 500 µl of PBS. Centrifuge between washing steps at 2,000 x g for 2 min and discard the supernatant.Note: Use a narrow needled syringe and carefully aspirate the supernatant without removing beads. The diameter of the needle tip must be smaller than the bead diameter.Re-suspend beads in 1 ml of 50 mM HEPES (pH 7.4) and transfer them into a 15 ml Falcon tube.Note: Re-suspend the beads in 500 µl of HEPES buffer and transfer to a 15 ml Falcon tube. Repeat this to transfer the residual beads and hence prevent bead loss. Use a 1,000 µl pipette and cut the end of the pipette tip with scissors, otherwise beads will plug the pipette tip.Store the beads on ice until needed.Solubilization of the standard and immunoproteasomeNote: Solubilization is necessary to disrupt the complex structure and to allow separation of ABP-labeled from non-labeled subunits.Transfer 200 µl (equals max. 100 µg protein) per eluate (from SEC) into a fresh 1.7 ml tube. Store the rest of the eluate at -20 °C.Add 20 µl of 10% SDS and boil at 95 °C for 8 min in a Thermomixer. Cool down to RT.",
    "Centrifuge tubes 1 min at 10,000 x g at RT to collect evaporated liquid from the lid of the tube.Pull-downNote: Bio-EP labeled subunits are purified in this step using streptavidin beads.Transfer sample to a 15 ml Falcon tube with pre-washed beads (from C1) and fill up to 10 ml with 50 mM HEPES (pH 7.4).Note: SDS may interfere with the pull-down. Therefore, SDS is diluted to 0.02% in this step.Incubate tubes for 2 h at 4 °C. Rotate tubes in a rotator during incubation (app. 20 rpm).Centrifuge tubes at 2,000 x g for 2 min (4 °C). Discard the supernatant.Re-suspend beads in 2 x 500 µl of PBS and transfer slurry into a 1.7 ml tube.Centrifuge tubes at 2,000 x g for 2 min (4 °C). Discard the supernatant.Wash beads two more times with 500 µl of PBS. Centrifuge at 2,000 x g for 2 min (4 °C).Re-suspend beads in 60 µl of 1x Laemmli buffer and boil for 15 min at 90 °C in a Thermomixer.Note: Bio-EP labeled subunits bound to the beads are eluted in this step.Centrifuge tubes at 2,000 x g for 2 min (4 °C). Transfer the supernatant into a fresh 1.7 ml tube using a syringe.Store samples at -20 °C.Western blot detectionNote: Alternative modes of detection or further processing steps may be performed. The protocol exemplifies the detection of immunosubunit β5i and standard proteasome subunit β5.Separate proteins of the pull-down eluate in a 15% polyacrylamide gel. Load gel pocket with 25 µl of eluate and run for approximately 90 min at 120 V.Blot proteins onto a polyvinylidene difluoride membrane for 90 min at 250 mA.Note: Soak membrane in MeOH before performing the electroblot.Block the membrane for 60 min at RT in 1x Roti®-Block blocking solution.Incubate membrane with either:a.",
    "1:2,000 anti-β5i (in Roti®-Block) overnight/over the weekend at 4 °C; b.1:1,000 anti-β5 (in Roti®-Block) overnight/over the weekend at 4 °C.Wash membrane three times with PBST for 10 min in a plastic box.Incubate with 1:40,000 anti-rabbit HRP-coupled secondary antibody (New England Biolabs, diluted in PBST) for 60 min at RT.Wash membrane 3 x with PBST for 10 min at RT.Cover the membrane with freshly prepared ECL substrate. Place membrane in a plastic foil and cover it with an X-ray film in a dark chamber. Develop film after several seconds to minutes.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20161215/20161215212840_4287.jpgFigure 2. Workflow activity-based pull-down. Active catalytic standard (brown) and immunoproteasome (yellow) subunits are covalently labeled with the ABP Bio-EP. After removal of unbound ABP via SEC the complex structure of the proteasome is solubilized in 1% SDS. A pull-down with streptavidin-coated agarose beads is performed to capture ABP-labeled subunits. Non-labeled proteins are removed in three consecutive steps of PBS washing, bound subunits are eluted via heating in 1x Laemmli."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}