{
  "id": 7517,
  "origin_website": "Bio",
  "title": "Normalized Ribo-Seq for Quantifying Absolute Global and Specific Changes in Translation",
  "procedures": [
    "Prepare the spike-in sampleThaw whole-cell Saccharomyces cerevisiae lysate on ice and centrifuge at 20,000 × g and 4°C for 5 min, to remove cell debris.Pre-dilute the supernatant in five times the volume of polysome lysis buffer A (see Recipes). After dilution, we obtained a concentration of ~7 A260 units per mL, which approximately corresponds to the concentration of the RPE1 lysates, and is therefore convenient for pipetting (see step D2). Aliquot and flash freeze again at -80°C. Aliquots should be used only once after thawing.Seeding and treatment of cellsOne day before the experiment, seed mammalian cells into one 10 or 15 cm cell culture dish per condition. We seeded 3 × 106 RPE1 cells per 15 cm dish prior to starvation (Haneke et al., 2020). For HeLa cells, seed 1.2 × 106 cells into a 10 cm cell culture dish. Amount and appropriate cell numbers need to be tested for all cell lines beforehand, to obtain enough material for sequencing and to ensure that the cells are always kept at sub-confluency, thereby preventing translation suppression by contact inhibition (see Note 5).For cell treatment, pre-dilute the drug of interest and the appropriate control solvent (for a 10 cm dish) in 10 mL of pre-warmed DMEM containing 10% FBS, 2 mM L-glutamine, 100 U/mL penicillin, and 100 µg/mL streptomycin. (For RPE1 cells use Ham’s F12 medium instead of DMEM). Treat the cells and incubate them for the appropriate time at 37°C in 5% CO2. Even if no drug treatment is performed, it is generally still advisable to exchange the cell culture medium for fresh medium for a few hours, to obtain cells with a high translation rate.Preparation of mammalian cell lysateNote: Cell lysis should be performed at 4°C in a cold room or on ice.",
    "Optional: Treat cells with 100 µg/mL cycloheximide (CHX) for 5 min at RT to arrest ribosomes (see Note 6).Remove the supernatant and wash cells with 1× PBS containing 100 µg/mL CHX. Take off the washing solution completely.Lyse cells in 150–250 µL (depending on the size of the plate) polysome lysis buffer A (see Recipes, see Note 7) by directly scraping the plate with a cell lifter. Transfer the lysate to a 1.5 mL reaction tube.Incubate the lysate with end-over-end rotation at 4°C for 10 min.Clear lysate by centrifugation at 10,000 × g and 4°C in a tabletop centrifuge for 10 min, to remove cell nuclei. Transfer the supernatant to a new tube.Yeast spike-inMeasure absorbance of the cell lysate at 260 nm in a spectrophotometer, using polysome lysis buffer for blanking the instrument. Adjust samples to the same A260 and fill the volume up to 300 µL total with polysome lysis buffer.Add equal amounts of yeast lysate to each sample. The yeast lysate should be 2% (w/w) of the mammalian cell lysate (adjusted according to the A260 measurement). For example, if you use 2 A260 units of mammalian lysate per sample, add 0.04 A260 units of yeast lysate. Make sure to pipet at least 5 µL of yeast lysate to reduce variations due to pipetting error. This might require further pre-dilution of the yeast lysate with polysome lysis buffer A.For input samples, take approximately 10% of the lysate (mammalian plus yeast spike-in) into a new tube, and fill up to 300 µL with polysome lysis buffer. Add 300 µL of urea buffer (see Recipes) and 300 µL of phenol:chloroform:isoamylalcohol (PCI). Vortex and store samples at -20°C until further processing or directly proceed to section G.",
    "RNase I digestionAdd 60 U of RNase I (60 U/µL) per A260 unit to the cell lysate.Incubate at 4°C with end-over-end rotation for 5 min (see Note 8).Stop the digestion by addition of Superase inhibitor (6 units per sample).Polysome fractionationPre-cool the ultracentrifuge to 4°C. The ultracentrifuge rotor and buckets, as well as the sucrose gradients, should be kept at 4°C prior to usage. The sucrose gradients should be prepared prior or during cell lysis.Prepare sucrose gradients (see Note 9) either with an automated gradient maker (steps F3–F8), or by step-wise preparation (steps F9–F13).Prepare two sucrose solutions (17.5% and 50%) by dissolving the sucrose in the polysome buffer, which was also used for cell lysis. Approximately 2 mL of each solution is required per gradient.Mark 4 mL polypropylene tubes according to the marker block of the Gradient Master Station from Biocomp.Fill the tubes with 17.5% sucrose solution until you reach the mark.Using a syringe, underlay the 17.5% sucrose with 50% sucrose, until you see the interface reaching the mark.Put the tubes into the magnetic holder and run the Gradient Master System using the following settings:Number of steps: 1Time: 1 min 25 sAngle: 82°Speed: 19 rpmTransfer the freshly prepared gradients to 4°C and use within the next couple of hours.Prepare sucrose solutions with five different concentrations (17.5%, 25.6%, 33.8%, 41.9%, and 50%) by dissolving the sucrose in the polysome buffer, which was also used for cell lysis.Pipette 780 µL of the 50% sucrose solution into a 4 mL polypropylene tube and freeze the tube at -80°C, until the solution is completely frozen.Add 780 µL of the 41.9% sucrose on top of the frozen solution and freeze it again at -80°C.Repeat the steps until all of the sucrose solutions have been layered in the gradient.",
    "Work quickly to avoid thawing of the previous sucrose layer. Completed gradients can be stored at -80°C for several months.Transfer the gradients to 4°C for thawing several hours or the day before the experiment.Load 250–300 μL of the digested lysate on the prepared sucrose gradients. Adjust the volume of individual gradients to the same level with polysome lysis buffer and balance the gradients using a scale, before transferring the gradients to the buckets of the ultracentrifuge rotor.Spin samples in the ultracentrifuge at 40,000 rpm (corresponding to a maximum g-force of 208,600 × g and an average g-force of 157,600 × g in a SW60 rotor) for 2 h, with acceleration setting at 7 and deceleration setting at 1. Retrieve the buckets and place on ice until use.Prepare the gradient fractionator according to the manufacturer’s instructions. Prepare 2 mL reaction tubes containing 300 µL of urea buffer (see Recipes) each for collecting the gradient fractions.Place the gradient in the holding device of the fractionator and pierce the bottom of the tube with the needle pump. Place the tubes containing urea buffer in the corresponding places in the fraction holder. Pump in 60% sucrose (dissolved in water) from the bottom with 50% pump speed, so that the gradient is eluted from the top. Simultaneously record the UV absorbance of the gradient at sensitivity 2.0 or 1.0 with the PeakTrak software (see Note 4), to identify the 80S monosome peak. Figure 2 shows example profiles of RPE1 cells, as used in Haneke et al. (2020), and of RAW264.7 cells, a mouse macrophage cell line with a higher translation rate. Collect fractions every 14 s (approximately 300 µL per fraction), close the tubes, and mix by inverting.",
    "Once the gradient is completely eluted (around 12–14 fractions in total), transfer the tubes to the fume hood and add 300 µL of PCI to each tube. Vortex and freeze the samples at -20°C until all the gradients are processed or until further usage. Extended storage of samples is possible at this step.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4323/bioprotoc-12-04-4323-g002.jpgFigure 2. Identification of monosomal fractions after sucrose density gradient centrifugation. A. UV absorbance at 254 nm during gradient elution with and without RNase I digestion of RPEI lysates. The position of fraction borders is marked by sharp drops in the profile. B. As in A, for RAW264.7 cells.RNA isolationIdentify the tubes containing monosomal ribosomes according to the UV absorbance profile, which is typically in fractions 4 and 5 (Figure 2). Process input samples in parallel.Heat the samples at 65°C for 10 min in a thermoblock. Open the tubes once under the fume hood, to release pressure.Spin for 20 min at 17,000 × g at RT in a tabletop centrifuge.In the fume hood, move the upper aqueous phase (approximately 600–700 µL) into a new tube, while carefully avoiding touching the interphase. Add 1 µL of GlycoBlue to each sample before the addition of 700 µL of isopropanol. Vortex and precipitate the RNA at -20°C overnight.Briefly vortex and centrifuge at 17,000 × g in a pre-cooled 4°C tabletop centrifuge for 20 min.Discard the supernatant and wash pellet with 800 µL of ice-cold 70% ethanol. Spin again at 17,000 × g and 4°C for 10 min.Take supernatant off completely and dry pellets at RT for 10–30 min.Resuspend pellet in 10–20 µL of RNase-free water (depending on the size of the pellet) and dissolve it by incubation at 65°C in a thermoblock for 10–20 min, with occasional vortexing.",
    "If monosomal ribosomes were contained in more than one tube, RNA should be pooled at this point. Store the RNA at -80°C or directly process the samples further.Removal of rRNA from input and ribosome footprintsRemove rRNA from samples using the RiboZero Gold rRNA removal kit (see Note 3) according to the manufacturer’s protocol.Determine the concentration of the pooled RNA by Nanodrop measurement. Use up to 5 µg RNA per sample.At the last step, transfer 90 µL of the supernatant containing rRNA depleted RNA to a new tube.Add 89 µL of RNase-free water, 1 µL of GlycoBlue, and 20 µL of 3 M NaCl before precipitation with 200 µL of isopropanol at -20°C overnight.Briefly vortex and centrifuge at 17,000 × g in a pre-cooled 4°C tabletop centrifuge for 20 min.Discard supernatant and wash pellet with 800 µL of ice-cold 70% ethanol. Spin again at 17,000 × g and 4°C for 10 min.Take supernatant off completely and dry pellets at RT for 10–30 min.Resuspend pellet in 10 µL of RNase-free water and dissolve it by incubation at 65°C in a thermoblock for 10–20 min, with occasional vortexing.Random RNA fragmentation of input materialNote: To generate RNA fragments that have a similar length as the ribosome protected fragments from the ribosome footprint samples, input RNA is processed by random alkaline fragmentation. Important: Process samples in PCR tubes and incubate samples in a thermocycler as precise setting of the temperature is crucial at this step! Use all of the rRNA depleted RNA from the previous step (10 µL) and mix with 10 µL of 2× fragmentation buffer (see Recipes).Incubate at 95°C for 12 min in a thermocycler (heat the lid!).Stop the fragmentation by addition of 180 µL of stop/precipitation buffer (see Recipes) and immediately add 200 µL of isopropanol.Precipitate the RNA at -20°C overnight.",
    "Vortex briefly and centrifuge at 17,000 × g in a pre-cooled 4°C tabletop centrifuge for 20 min.Discard supernatant and wash pellet with 800 µL of ice-cold 70% ethanol. Spin again at 17,000 × g and 4°C for 10 min.Take supernatant off completely and dry pellets at RT for 10–30 min.Resuspend pellet in 10 µL of RNase-free water and dissolve it by incubation at 65°C in a thermoblock for 10–20 min, with occasional vortexing.Size-selectionPrepare a 15% polyacrylamide TBE-urea gel as follows (for 2 gels):5 mL of Rotiphorese polyacrylamide (30%)1 mL of 10× TBE4.24 g urea (final concentration 8 M)Fill up with H2O to 10 mLAdd 50 µL of 10% APS and 7 µL of TEMEDMix and pour into pre-assembled Mini Protean Tetra Cell polyacrylamide gel boxes. Allow the gel to set.Pre-run gel at 100–200 V in 1× TBE for 15–30 min.While pre-running the gel, prepare RNA samples for loading. Add 5 µL of 3× RNA loading dye (see Recipes) to samples. At the same time, prepare the small RNA ladder and/or the size marker oligonucleotides (25 nt and 35 nt, see Note 10) for loading. For the marker, mix 2 µL of small RNA ladder with 8 µL of RNase-free water and 5 µL of 3× RNA loading dye (enough for two lanes). For the oligonucleotides, fill 5 pmol of the oligonucleotide up with RNase-free water to 10 µL and add 5 µL of 3× RNA loading dye.Denature samples for 10 min at 65°C.Before loading, rinse pockets of gels with a syringe to remove excess urea. Load the samples, the small RNA ladder and/or the size marker oligonucleotides on the gel; if possible, leave one free lane between the samples.",
    "Run the gel at 150 V in 1× TBE, until the bromophenol blue running front is approximately 1 cm from the bottom of the gel.Disassemble the gel and stain it with SybrGold (diluted 1:10,000 in 1× TBE) by gentle shaking at RT for 5–10 min.Visualize the staining in a UV transilluminator or a blue light table, and excise the region between 25 and 35 nt with a scalpel.Pierce a hole into the bottom of a 0.5 mL RNA-free reaction tube with a 21 G needle and place the tube into a 1.5 mL reaction tube with an open lid. Transfer the gel slices into the 0.5 mL tube.Centrifuge at maximum speed in a tabletop centrifuge for 5 min, to force the gel slices through the hole. If gel pieces remain in the upper tube, either repeat or transfer the remaining gel pieces with a pipette. Discard the 0.5 mL tube.Add 300 µL of 0.3 M NaCl and 2 µL of RNase OUT to each tube and incubate overnight at 4°C, with end-over-end rotation.Cut the tip of a 1,250 µL filter pipette tip and transfer the gel slurry to a 0.45 µm NanoSep MF tube. Centrifuge at maximum speed in a tabletop centrifuge at 4°C for 5 min.Transfer the flowthrough to a new tube, add 1 µL of GlycoBlue and 300 µL of isopropanol, mix well, and precipitate the RNA at -20°C overnight.Briefly vortex and centrifuge at 17,000 × g in a pre-cooled 4°C tabletop centrifuge for 20 min.Discard supernatant and wash pellet with 800 µL of ice-cold 70% ethanol. Spin again at 17,000 × g and 4°C for 10 min.Take supernatant off completely and dry pellets at RT for 10–30 min.",
    "Resuspend pellet in 14 µL of RNase-free water and dissolve it by incubation at 65°C in a thermoblock for 5–10 min, with occasional vortexing.End-repairSet up the following reaction:14 µL of RNA2 µL of 10 mM ATP2 µL of 10× T4 PNK buffer1 µL of T4 PNK1 µL of RNase OUTIncubate for 1 h at 37°C in a thermoblock.Add 159 µL of RNase-free water, 1 µL of GlycoBlue, and 20 µL of 3 M NaCl to each sample. Precipitate with 200 µL isopropanol at -20°C overnight.Briefly vortex and centrifuge at 17,000 × g in a pre-cooled 4°C tabletop centrifuge for 20 min.Discard supernatant and wash pellet with 800 µL of ice-cold 70% ethanol. Spin again at 17,000 × g and 4°C for 10 min.Take supernatant off completely and dry pellets at RT for 10–30 min.Resuspend pellet in 12 µL of RNase-free water and dissolve it by incubation at 65°C in a thermoblock for 5–10 min, with occasional vortexing.Library preparation and deep sequencingDetermine the concentration of the RNA using the Qubit microRNA kit.If you want to see the size distribution of your RNA, you can use the Agilent small RNA kit and the Agilent Bioanalyzer.Prepare the sequencing library using the NEXTflex Small RNA-Seq Kit v3, according to the manufacturer’s instructions (see Note 11). Important: all reactions described in the manual should be performed in PCR tubes and incubated in a thermocycler, since precise setting of the temperature is crucial to these steps.After step F of the manual, determine the number of necessary PCR cycles by qPCR:Dilute 1 µL of cDNA with 7 µL of H2O.Dilute forward and reverse primers to 10 pmol/µL.Prepare a master mix containing per sample:0.4 µL of forward primer0.4 µL of reverse primer1.7 µL of H2O5 µL of SybrGreen master mixIn a 384 well plate, mix 2.",
    "5 µL of diluted cDNA with 7.5 µL of master mix and seal the plate. Measure samples in triplicate.Run a qPCR with the following settings:2 min at 95°C30 cycles of:20 s at 95°C30 s at 60°C18 s at 72°CThe number of cycles in the PCR of step G of the manual should be 3 cycles less than the Ct determined by the qPCR, to yield a library of ~20 nM concentration.After step G of the manual, take 1 µL of PCR product, dilute it with 3 µL of water and check the size distribution with the Agilent High Sensitivity DNA kit. Unless there is a strong peak at 130 bp, gel-free size-selection can be used.The finished libraries can be stored at -20°C for an extended period of time. We suggest adjusting all libraries to the same concentration. The higher the concentration (e.g., 20 nM is desired), the more stable the library.Multiplex libraries as desired and sequence on a NextSeq500 device."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}