{
  "id": 18862,
  "origin_website": "Jove",
  "title": "Ultrasound Imaging-guided Intracardiac Injection to Develop a Mouse Model of Breast Cancer Brain Metastases Followed by Longitudinal MRI",
  "procedures": [
    "All animal procedures were approved by the Institutional Animal Care and Use Committee of University of Texas Southwestern Medical Center.\n1. Preparation of the MDA-MB231/Br-GFP Cells\nRetrieve and culture the MDA-MB231/Br-GFP cells (kindly provided by Drs. Palmieri and Steeg, NCI) in DMEM medium containing 10% FBS, 1% glutamine and 1% penicillin/streptomycin.\nObserve the condition of the cells and color of medium, and replace medium every 2-3 days.\nTrypsinize and collect the cells when 80% confluence is reached as outlined in steps 1.3.1-1.3.5:\n\t\nRemove the old medium completely and add 5 ml PBS (1x) to wash the cells gently. Remove the PBS from the dish.\nAdd 1.5 ml Trypsin in the dish; tilt the dish gently to ensure all the cells are covered by Trypsin. Put the dish back to the cell incubator and keep it at 37 °C for 1 min.\nTake the dish out of incubator and observe the cells under optical microscope to ensure the cells detach from the dish.\nAdd 3 ml medium to stop the effect of trypsin. Collect the cell mixture in a centrifuge tube. Centrifuge the mixture at 2,000 rpm for 5 min.\nRemove the medium carefully and resuspend the cells in 5 ml serum free medium until homogenous.\nCount appropriate number of cells and resuspend them in serum free DMEM medium with a final concentration of 1.75 x 105 cells in 100 µl volume.\n\t\nTake 50 µl cell mixture and add 50 µl Trypan Blue. After mixing, take 10 µl mixture and carefully add to the cell counting slide. Use multiple samples to ensure accurate cell number estimation.\nStick in the cell counting slide, one end at a time and the cell counter starts counting automatically. Take average of all the counting results and calculate the total cell number.",
    "Centrifuge the cells again and resuspend them in the appropriate volume of serum free medium to result in the final concentration of 1.75 x 105 cells/100 µl volume.\nPlace cells on ice prior to intracardiac injection.\n2. Ultrasound Imaging-guided Intracardiac Injection\nUse female nude mice (BALB/c nu/nu) between 6-8 weeks old.\nLog in the imaging system. Initialize the transducer 704 (40 MHz).\nStart a new study and fill in the information.\nAnesthetize (3% isoflurane/100% O2 in an induction chamber) and maintain the animals with isoflurane (2%) in 100% O2 (1 dm3/min) during the whole procedure via a nose cone. Anesthesia is confirmed when no withdrawal reflex is observed with toe pinch.\nSet the temperature of the imaging table to 37 °C. Tape the anesthetized mouse to the heated imaging table in supine position.\nKeep the ultrasound gel at 37 °C prior to imaging. Apply the gel to the chest of the mouse.\nMount the transducer in the holder. Lower the transducer till the desired imaging depth is reached. Move the stage until the left ventricle is identified with the ascending aorta as the landmark (Figure 1A). Lock the stage when a clear view of left ventricle is visualized.\nDraw 100 µl of cell mixture into a 1 ml syringe with a 22 G needle. Place and fix the syringe on the syringe mount.\nMove the syringe forward towards the mouse chest and carefully move it side to side until the needle tip is in the imaging field of view (before entering the mouse).\nAdjust the needle height and angle to aim down the left ventricle.\nPenetrate the syringe needle into intercoastal space  promptly through skin and muscle layers into the left ventricle under the guidance of ultrasound imaging.",
    "An indication of successful insertion of the needle into the left ventricle is the reflux of fresh arterial blood (pink color in contrast to dark red venous blood) into the syringe\nInject the cell mixture slowly (Figure 1B).\nUpon completion, withdraw the needle, lift up the transducer, clean the ultrasound gel with dampened gauze and remove tape.\nPrepare a clean cage with a preheated pad.\nPlace the animal on the pad and observe the animal till full recovery.\nMonitor the behavior of the animal every 24 hr for two days.\nGeneral conditions and neurologic signs of complications in experimental mice are routinely monitored.\n3. MRI Monitoring of Intracranial Tumor Development\nUse a 9.4 Tesla magnet to monitor intracranial development of brain metastases.\nInitiate MRI two weeks after tumor implantation and repeat once a week for up to three weeks.\nSedate the animals with 3% isoflurane and maintain them under general anesthesia (1.5% isoflurane).\nMonitor and maintain the animal body temperature and respiration constant throughout the experiment.\nHigh resolution multislice (14 slices with 1 mm thick, no gap) T1- and T2-weighted coronal images, covering the region from the frontal lobe to the posterior fossa, are acquired with the following parameters: T1-weighted images: spin echo multiple slice (SEMS), TR/TE = 400 msec/20 msec, matrix: 256 x 256, FOV 20 x 20 mm, in plane resolution: 78 x 78 µm2. T2-weighted images: fast spin echo multiple slice (FSEMS) sequences, TR/TE = 2500 msec/48 msec, 8 echo trains, matrix: 256 x 256, FOV 20 x 20 mm, in plane resolution: 78 x 78 µm 28,9.\nTumor lesions appear brighter than normal brain tissues on T2-weighted images.\nTumor size is determined on T2-weighted images by manually outlining the enhancing portion of the mass on each image by using MATLAB programs written by us8.",
    "Given most of the tumor diameters are smaller than the slice thickness (1 mm), the tumor size is presented as in plane area rather than the volume.\n4. H&E Staining Confirming the Metastases\nSacrifice the mice immediately after the last MR scan, dissect the tumor-bearing brains and embed it in O.C.T medium and frozen in -80 °C.\nSection a series of 10 µm-thick coronal brain specimens with cryostat.\nPerform H&E staining on the brain sections.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}