{
  "id": 1558,
  "origin_website": "Cell",
  "title": "Generation of Regionally Specified Human Brain Organoids Resembling Thalamus Development",
  "procedures": [
    "Step-by-Step Method Details\nStep-by-Step Method Details\nMaintaining Culture of hESCs or hiPSCs\nTiming: 1 week\nhESCs or hiPSCs are cultured under feeder-free condition. Passaging is performed once a week when cells approach ~80% confluency.\nNote: Culturing of hPSCs is established by Yale Human Embryonic Stem Cell Core, based on the protocol from Eric Bouhassira’s laboratory to grow human H-1 and H-9 cell lines derived by the James Thomson’s lab at Wisconsin, as well as hESC lines from other labs.\nThaw 100 µl aliquoted Matrigel on ice. Dilute Matrigel with 6 mL ice-cold DMEM/F-12 medium.\nNote: Note: see below for the calculation of Matrigel volume required for plate coating, as suggested by WiCell. 1 mL/X mL = given concentration/1 mg (X = mL of Matrigel aliquoted per tube; 1 mg is suggested for use in two 6-well plates).\nAdd 1 mL of diluted Matrigel to each well of the 6-well tissue culture plate.\nPlace the plate in the incubator for 2 h before use. We suggest that the Matrigel-coated plate is used directly 2 h after coating. If storage is needed, keep the coated plate at 4°C before use.\nUnder the stereomicroscope, scrape off differentiated colonies using a 200 µl pipette tip.\nIn the cell culture hood, remove the medium in the well, then add 1 mL DMEM/F-12 medium to each well. DMEM/F-12 medium is warmed up to room temperature (22 - 25°C) before use.\nAdd 166 µl Dispase (5 U/mL) to each well, return the plate to the incubator, and incubate for 7 min. This time period is suitable for different cell lines. At the end of treatment, the edge of the colony should curl up while the major of the colony remain attached to the plate.",
    "Take out the plate, remove the Dispase-containing medium from each well, and wash each well with 2 mL DMEM/F-12 medium twice.\nRemove the wash medium, add another 1 mL DMEM/F-12 medium to each well. Scrape down the colonies vertically and horizontally with 1 mL general pipette tip.\nGently mix the cell suspension, and transfer 100 µl colony-containing medium to a 15 mL centrifuge tube. Centrifuge for 3 min at 200 × g.\nRemove medium from the tube, and re-suspend the cells with 2 mL mTeSR1 medium. mTeSR1 medium was developed for feeder-independent culture of hPSCs (Ludwig et al., 2006a[href=https://www.wicell.org#bib4], 2006b[href=https://www.wicell.org#bib5]) and has been widely used. mTeSR1 medium is warmed up to room temperature (22 - 25°C) before use.\nTake out the Matrigel-coated plate (prepared in Step 2), remove Matrigel solution, and add the 2 mL cell suspension to 1 well of the 6-well tissue culture plate. Note: depending on the scale of the organoid induction (or other experiments) to be performed with these cells, the volume of cell suspension and the numbers of plated wells can be adjusted.\nReturn the plate to incubator. Medium is changed daily (2 mL/well) starting from 48 h after the passaging. Unused cells from step 8 can be discarded at this point.\nNeural Induction\nTiming: 8 days\nWhen hESCs or hiPSCs approach ~80% confluency, which typically occurs one week after passaging the cells, single cell suspension is prepared to perform neural induction.\nUnder the stereomicroscope, scrape off any differentiated cells.\nCritical: Differentiated cells may interrupt the neural induction and the following differentiation process (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/10-Fig1.jpg\nFigure 1. hESC Colonies under Culture",
    "A non-differentiated colony ideal for differentiation (left side), and colonies with differentiated parts that need to be removed before single cell dissociation (labeled by the yellow dash line). The scale bar represents 200 µm.\nIn the cell culture hood, remove the medium from each well. Wash the well once with 1 mL DMEM/F-12 medium.\nRemove the DMEM/F-12 medium, and add 1 mL of pre-warmed Accutase to each well of the 6-well plate.\nReturn the plate to the incubator for 10 min.\nTap the plate gently to make sure colonies are dissociated (Methods Video 1[href=https://www.wicell.org#mmc1]).\n        Your browser does not support HTML5 video.\n      \nMethods Video 1. Neural Induction, Step 5\nTap the plate gently to make sure colonies are dissociated.\nOptional: Increase incubation time if dissociation is not complete. Figure 2[href=https://www.wicell.org#fig2] shows an example of successful dissociation.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/10-Fig2.jpg\nFigure 2. Dissociation of hESCs\nA ideal single cell suspension after Accutase treatment. The scale bar represents 200 µm.\nUsing 1 mL pipette tip, pipette up and down the Accutase solution in the well ~4 times to make a single-cell suspension.\nTransfer the single-cell suspension to a 15 mL centrifuge tube, which contains 5 mL of DMEM/F-12 medium.\nSpin down the cells for 3 min at 200 × g at room temperature (22 - 25°C).\nRemove the supernatant, and re-suspend the cells with 1 mL of neural induction medium. Neural induction medium is warmed up to room temperature before use.\nMix 10 µl cell suspension with 10 µl of trypan blue solution. Load 10 µl of the mixture to the hemocytometer. Count and calculate live cell concentration.",
    "Dilute cells in neural induction medium to make final concentration to 60,000 live cells/mL. Add Y-27632 (final concentration of 50 µM) and heat-inactivated FBS (final concentration of 5% [v/v]) to the cell suspension and mix well. Prepare 15 mL cell suspension for the use of a whole 96-well plate.\nCritical: With the concentration of 60,000 live cells/mL, each embryoid body will contain 9,000 live cells (9,000 live celles/150 µl of medium). Here, HES-3 NKX2-1GFP/w cells is used for thalamic organoid generation. The cell number required for optimal thalamic organoid generation can be cell line-dependent and should be determined for the specific cells being used.\nAdding FBS helps the formation of embryoid body after the single cell suspension is plated. If the cell lines used do not require FBS to efficiently form embryoid body 24 h after plating the cells, then FBS can be removed from this step.\nAdd 150 µl of the single cell suspension in step 11 into each well of the ultra-low attachment 96-well plate, and place the plate to incubator. This is day 0 of the neural induction period.\nOn day 1, gently take out the plate from the incubator, and observe under microscope. An embryoid body with a smooth surface should be formed in each well. Return the plate to the incubator for further culturing. (Figure 3[href=https://www.wicell.org#fig3])\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/10-Fig3.jpg\nFigure 3. Formation of Embryoid Bodies\nSucessful (left side) and failed (right side) formation of central embryoid body 24 h after plating single cells. The scale bar represents 200 µm.\nOn day 2, take out the plate, and remove 75 µl of the medium from each well. Add 150 µl of neural induction medium containing 50 µM Y-27632 to each well.",
    "On day 4 and 8, remove 100 µl medium from each well, and add 150 µl neural induction medium (without Y-27632) to each well.\nThalamic Patterning\nTiming: 8 days\nStarting from day 8, embryoid bodies will be collected from the ultra-low attachment 96-well plate and transferred to ultra-low attachment 24-well plate for spinning culture. Eight days of patterning will be performed to achieve thalamic fate.\nOn day 8 of differentiation, take out the ultra-low attachment 96-well plate from the incubator. Using a 5 mL pipette, transfer the embryoid bodies from each well to an ultra-low attachment 24-well plate.\nCritical: Transfer the embryoid bodies cautiously, avoid damaging of the samples. Transfer 1 embryoid body to each well of the ultra-low attachment 24-well plate.\nCritical: During transfer, tilt the ultra-low attachment 24-well plate, so that embryoid bodies will fall down in the well with the medium. This will avoid drying the embryoid bodies (Figure 4[href=https://www.wicell.org#fig4]; Methods Video 2[href=https://www.wicell.org#mmc2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/10-Fig4.jpg\nFigure 4. The Setting to Tilt the Plate when Transferring Embryoid Bodies\nTilt the ultra-low attachment 24-well plate, so that embryoid bodies will fall down in the well with the medium.\n        Your browser does not support HTML5 video.\n      \nMethods Video 2. Thalamic Patterning, Step 1\nDuring transfer, tilt the ultra-low attachment 24-well plate, so that embryoid bodies will fall down in the well with the medium. This will avoid drying out the embryoid bodies.\nAfter the transferring is done, remove the neural induction medium in each well of the ultra-low attachment 24-well plate.\nAdd 1 mL of thalamic patterning medium to each well of the ultra-low attachment 24-well plate.\nCritical: Avoid drying the embryoid bodies when replacing the medium, e.g., if there are 24 embryoid bodies, divide them into four groups. Perform medium replacement 6 embryoid bodies per group.",
    "Place the plate on an orbital shaker inside the incubator, and start spinning culture at a speed of 80 rpm.\nOn day 10, 12, and 14, remove the medium from each well and add 1 mL of thalamic patterning medium to each well.\nCritical: Avoid drying the embryoid bodies when replenishing the medium.\nNeural Maturation and Long-Term Culture\nTiming: 3–12 months\nStarting from day 16, change medium with neural differentiation medium, and continue spinning culture. Carefully change medium as described in step 5 in thalamic patterning.\nOptional: Organoids can be collected and transferred to ultra-low attachment 6-well plate for long term culture. In this case, transfer no more than 6 organoids to each well of an ultra-low attachment 6-well plate.\nstep:\nMedium is replenished every other day before day 25, then every four days after that.\nCritical: There is no pause point after the neural induction begins. The period of neural differentiation and maturation depends on the purpose of the experiment. Typically, after three months’ culturing, electrophysiologically active neurons can be readily detected inside the organoids."
  ],
  "subjectAreas": [
    "Organoids",
    "Neuroscience",
    "Stem Cells"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}