{
  "id": 10497,
  "origin_website": "Jove",
  "title": "A Zebrafish Embryo Model for In Vivo Visualization and Intravital Analysis of Biomaterial-associated Staphylococcus aureus Infection",
  "procedures": [
    "In this protocol, maintenance of adult zebrafish is in compliance with the local animal welfare regulations as approved by the local animal welfare committee. Experiments with embryos were performed according to the 2010/63/EU Directive.\n1. Preparation of \"Bacteria-only\" and Bacteria-microspheres Suspensions\nNOTE: The S. aureus RN4220 strain expressing mCherry fluorescent protein (S. aureus-mCherry) is used. The S. aureus RN4220 strain is mutated in the virulence regulator gene agrA (accessory gene regulator A)34, and therefore may have relatively low virulence in the zebrafish embryo model. Other S. aureus strains or other bacterial species for BAI can be used.\nTake 4 to 5 colonies of S. aureus RN4220 bacteria from tryptic soya agar culture plates supplemented with 10 µg/mL chloramphenicol and culture the bacteria to mid-logarithmic growth phase in 10 mL of tryptic soy broth supplemented with 10 µg/mL chloramphenicol at 37 °C under shaking.\nDuring culture, dilute 100 µL of the bacterial suspension in 900 µL of sterile phosphate buffered saline (PBS) in a cuvette (width of 1 cm) for an optical density (OD) measurement at 620 nm (OD620). Culture the bacteria until the OD620 reaches 0.4–0.8.\nNOTE: An OD620 of 0.1 generally corresponds to 3.0 x 107 CFU/mL S. aureus. The OD620 of an inoculum of bacteria in mid logarithmic growth phase is between 0.4-0.8. Different time periods for culturing may be needed for other species and strains of bacteria.\nCentrifuge bacteria at 3,500 x g for 10 min and re-suspend the pelleted bacteria in 1 mL of sterile PBS. Subsequently wash the bacteria with sterile PBS 2 times, and finally re-suspend the bacteria in 1.1 mL of 4% (w/v) polyvinylpyrrolidone40 (PVP40) solution in PBS.",
    "Vortex this bacterial suspension and dilute 100 µL of the suspension in 900 µL of sterile PBS in a cuvette for the OD620 measurement. Adjust the concentration of the bacterial suspension with PVP40 solution. This is the \"Bacteria-only\" suspension.\nBiomaterials can be freely chosen to mix with bacterial suspension. In the present study, commercial polystyrene (PS) microspheres (blue fluorescent, 10 µm) are used. To generate a Bacteria-Microspheres suspension, centrifuge the microspheres for 1 min at 1,000 x g, room temperature, discard the supernatant and re-suspend the microspheres in the  “Bacteria-only” suspension (in PVP40 solution).\nIn order to inject approximately equal doses of bacteria in the presence and in the absence of microspheres, the concentration of Bacteria-Microspheres suspension needs to be two thirds of the concentration of the “Bacteria-only” suspension (without microspheres). This is achieved by diluting the Bacteria-Microspheres suspension with 0.5 volume of PVP40 solution. Mix the suspensions by vortexing. Of note, this ratio (two thirds) has been assessed for S. aureus. It is also appropriate for S. epidermidis, but it is advised to check whether this ratio also applies to other bacterial species and other sizes (than 10 µm) or shapes of biomaterials (than microspheres) to be injected.\nCheck the concentration of the “Bacteria-only” and Bacteria-Microspheres suspension by quantitative culture of 10-fold serial dilutions as below: transfer 100 µL of the suspensions to a 96 well-plate and serially dilute by transferring 10 µL aliquots of the suspension into 90 µL of sterile PBS. Plate duplicate 10 µL aliquots of the undiluted and diluted suspensions on agarose plates, incubate the plates at 37 °C overnight, count the colonies and calculate the numbers of bacteria (colony-forming units. CFU).\n2. Breeding, Harvesting, and Maintenance of Zebrafish Embryos",
    "Follow the general procedures described earlier35,36 for breeding, harvesting, and maintenance of zebrafish embryos, with modifications described below. Cross a family of wild type Tupfel long fin (TL) zebrafish or zebrafish of the selected transgenic line (here, Mpeg1: Kaede) in a tank with a net added to induce the adult females to produce eggs after the light turns on, then separate adults from the produced eggs.\nCollect the embryos the next day and discard the non-transparent ones which are not viable. Keep approximately 60 embryos per Petri dish (100 mm in diameter) in E3 medium37 and incubate at 28 °C. Remove dead and abnormal embryos, and refresh the E3 medium daily.\n3. Preparation of Injection Needles\nPrepare the glass microcapillary needles for injection using a micropipette puller instrument. Use the following settings: heat: 772, pull: 100, vel: 200, time: 40, gas: 75.\nBreak the needle tip with forceps at the position where the needle has an outer diameter of approximately 20 µm (for 10 µm microspheres), using a light microscope with a scale bar in the ocular. Avoid needles with a very large opening size, as they will compromise survival of the embryos.\nNOTE: The opening may be chosen to be smaller or larger, depending on the size and shape of biomaterials to be injected. In the literature, injections using needles with an opening of approximately 50 µm have been reported to cause a significant decrease in embryo survival38.\n4. Injection of \"Bacteria-Only\" or Bacteria-microspheres Suspension into Zebrafish Embryos",
    "Heat agarose solution (1–1.5% (wt) in demi-water) using a microwave oven and pour into a 100-mm Petri dish. Place a plastic mold template on top of the agarose solution in the Petri dish to create indentations in the agarose for placing embryos in proper positions, facilitating injections. Incubate at room temperature and remove the mold when the agarose solution has solidified.\nAt 3 d post-fertilization, place the embryos in a 100 mm Petri dish containing 0.02% (w/v) 3-aminobenzoic acid (Tricaine) to anaesthetize them. After 5 min, transfer the embryos to the agarose plate overlaid with E3 medium containing 0.02% (w/v) Tricaine and align them in one orientation for injection. For the Mpeg1: Kaede transgenic line first anaesthetize embryos in E3 medium containing 0.02% (w/v) tricaine. Then select embryos expressing green fluorescent proteins using a stereo fluorescence microscope.\nLoad the needle with approximately 10 µL of the \"Bacteria-only\" or Bacteria-Microspheres suspension using a microloader pipette tip. Mount the needle onto a micromanipulator connected to the micro-injector. For the injector used here (see Table of Materials), use the following settings for injections of 2–3 nL: pressure: 300–350, back pressure: 0, time: 2 ms.\nNOTE: The settings for the micro-injector depend on the injector used. Injector settings may need to be adjusted for injections of bacteria mixed with biomaterials with other shapes or sizes.\n\t\nUse needles with the same opening for the injection of the \"Bacteria-only\" suspension and the Bacteria-Microspheres suspension. If the needle is broken or clogged, always change for a new needle for further injections.",
    "Insert the needle into the muscle tissue of embryos under a light microscope (Figure 1), at an angle of 45–60° between the needle and the body of embryos. Adjust the position of the needle in the tissue by gently moving it back and forth. Inject the embryos using a foot pedal connected to the micro-injector.\nAfter injection of fluorescent bacteria, score the embryos for successful infection under a stereo fluorescence microscope. Discard the embryos scored negative (no visible fluorescent bacteria or no visible fluorescent microspheres). Maintain embryos individually in E3 medium in 48-well plates. Refresh the medium daily.\n5. Crushing of Embryos, Microscopic Scoring, and Quantitative Culture of Bacteria\nScore all embryos microscopically for the presence of fluorescent bacteria using a stereo fluorescence microscope, starting immediately after the injections, and on each subsequent day until the embryos are randomly selected for quantitative culture.\nRandomly select a few live infected embryos (5 to 6 in the present study) shortly after injection and transfer them individually to separate 2 mL microtubes using sterile tips. Remove the medium, wash the embryos gently with sterile PBS once and add 100 µL of sterile PBS.\nAdd 2–3 sterile zirconia beads (2 mm in diameter) to each vial and crush the embryos using the homogenizer (see Table of Materials) at 3,500 rpm for 30 s. Culture the homogenate quantitatively as described in step 1.3.\nNOTE: Other homogenizers may require different settings.\nRandomly select multiple embryos on subsequent days after injection for quantitative culture according to step 5.3.\n6. Fluorescence Microscopy of Infection Progression and Provoked Cell Infiltration in Zebrafish Embryos",
    "Anaesthetize the embryos as described in step 4.2. Pipette 500 µL of a PBS-2% (wt) methyl cellulose solution into a Petri dish containing E3 medium with 0.02% (w/v) Tricaine. Place the embryos in the methyl cellulose solution and keep them straight and horizontal.\nNOTE: Methyl cellulose solution is used as a “glue”, which due to its viscosity, can temporarily immobilize embryos in best orientation for imaging.\nUse a stereo fluorescence microscope equipped with bright field, mCherry, green fluorescent protein (GFP), and UV filters to image individual embryos under identical optimized settings (e.g., intensity, gain, and exposure time) at 160x magnification. Set the focal plane such that the tissue damage caused by the injection is in focus, using the bright field filter. Set the Z-stack depth at 10 µm and step size at 5 µm, which allows for recording of 3 consecutive images.\nImage individual embryos once daily from 5 h post-injection until 2 days post-injection. Exclude dead embryos (no heartbeat or embryo partly degraded) for further imaging and analysis. Maintain embryos individually in E3 medium in 48-well plates. Refresh the medium daily.\n7. Quantitative Analysis of Fluorescence Intensity of Infection Progression and Provoked Cell Infiltration Using Object J Project File “Zebrafish-Immunotest”\nDownload “Zebrafish-Immunotest” and the detailed manual from the link: <https://sils.fnwi.uva.nl/bcb/objectj/examples/zebrafish/MD/zebrafish-immunotest.htmL>, as described in a previous study33. In brief, open images for analysis with “Zebrafish-Immunotest”, operating under the freeware program Image J. In each loaded image, manually mark the injection site based on the observed tissue damage of embryos.\nNOTE: The marked site is used by “Zebrafish-Immunotest” as the center point to detect the fluorescence peak within a distance of 50 µm. The detected fluorescence peak is then used as the center of a standardized area (diameter of 100 µm) for fluorescence measurement.",
    "Click “calculation” in the Object J menu to run the fluorescent measurement for multiple channels, if applicable, automatically for all images. Export the data and analyze by appropriate statistic test methods.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}