{
  "id": 13205,
  "origin_website": "Jove",
  "title": "Live Cell Imaging of Microtubule Cytoskeleton and Micromechanical Manipulation of the Arabidopsis Shoot Apical Meristem",
  "procedures": [
    "1. Plant growth\nSow Arabidopsis seeds expressing microtubule binding domain fused with green fluorescent protein (MBD-GFP)10 on soil and keep in long day (16 h day /8 h night), 20 °C/6 °C conditions for 1 week for germination.\nAfter germination, transfer seedlings to new pots with sufficient growth space to allow robust vegetative growth. Keep plants in short day (8 h day /16 h night), 20 °C/16 °C conditions for 3-5 weeks.\nTransfer plants to long day (16 h day /8 h night), 20 °C/16 °C conditions and keep until plants bolt (2-3 weeks). Allow the inflorescence to grow up to 2-5 cm long.\n2. Medium preparation\nPrepare the dissecting dishes by filling small Petri dishes (approximately 5.5 cm wide, 1.5 cm deep) to approximately half their depth with 2% agarose. The dissecting dishes could also be used for single time point imaging.\nPrepare the growth medium.\n\t\nPrepare 50 mL of a 1,000x vitamin stock solution with 5 g of myo-inositol, 0.05 g of nicotinic acid, 0.05 g of pyridoxine hydrochloride, 0.5 g of thiamine hydrochloride, and 0.1 g of glycine.\nPrepare the growth medium, composed of ½ Murashige and Skoog medium, 1% sucrose, 1.6% agar, 1x vitamins, pH = 5.8. Autoclave and allow it to cool.\nOn a sterile, clean bench, sterilize hinged plastic boxes (approximately 5.2 cm x 5.2 cm x 3 cm) by immersing in 70% ethanol for 15 min.\nOn a sterile, clean bench, once the medium is at bearable warmth, add N6-benzyladenine to a final concentration of 200 nM, and 1/1,000 PPM (plant preservative mixture) and mix well. Fill the sterile boxes to approximately half their depth with the medium.\n3. Dissection of the SAM",
    "Cut the inflorescence and remove the older flower buds with sharp forceps by peeling the flowers at the base of the peduncles until it is difficult to see them with the naked eye.\nCreate a slit in the agarose in the dissecting dish with forceps and plant the inflorescence base into the thick agar. This gives good solid support for further fine dissection of younger flowers to expose the SAM.\nRemove the remaining flower buds by pushing them down with the forceps starting with the oldest and sequentially progressing to the younger stages under a dissecting microscope until the SAM is visible. The SAM is usually exposed when older flowers up to stage 6 to 7 are removed. Once the SAM is exposed, avoid dehydration of the sample by moving quickly to the next step.\n4. Transfer and growth of cultured SAMs\nPlant the freshly dissected sample as detailed in section 1 into the growth medium in the rectangular plastic hinged culture box with the SAM just exposed above the medium surface. Add a few drops of sterile deionized water to the edges of the culture boxes and close the lid to maintain the humidity inside the box. Ensure that the added water does not cover the SAM.\nClose the lid and wrap the box with micropore tape. Place the growth box in long day or continuous day conditions at 22 °C and grow for 12-24 h to allow the SAM to recover from the dissection procedure and adapt to the culture conditions.\n5. Imaging of the SAM\nFill the culture box containing the SAM with sterile deionized water to cover the sample. Check under the dissecting microscope and remove any air bubbles by forcefully spraying water directed at the sample with a 1 mL pipette.",
    "Place the culture box on an upright confocal microscope stage. Take care that the culture box does not contact the microscope objectives. Use a long distance 40x or 60x water dipping lens of numerical aperture 0.8-1 that is optimal for imaging without a cover glass.\nLower the objective into the water and check for air bubbles formed on the objective's front lens. Remove any bubbles by lowering the stage and gently wiping the lens with an optical tissue and adding a small amount of water to the front lens of the objective with a Pasteur pipette before reimmersion into the water.\nUsing the GFP filter and epi-illumination module of the confocal microscope, adjust the XY controller to locate the sample. Adjusting the position of the oculars, put the SAM directly under the light source and focus along the Z axis until the apex is located.\n\tNOTE: Do not look directly at the ultraviolet light.\nOnce the sample is found, illuminate it using a laser capable of exciting GFP (i.e., a 488 nm or 496 nm laser source). Adjust the optical zoom of the microscope so that the entire SAM and the stage 1 floral primordia are in the field of view. Further adjust the power of the laser output and gain settings to ensure optimal signal-to-noise ratio.\n\tNOTE: The high intensity of the laser will result in photo bleaching of the sample. The under- and overexposure palette help ensure better adjustment of these settings.",
    "Allow the sample to settle down for 2-5 min. Acquire confocal Z stacks of the sample at 0.25 µm-0.5 µm Z slice intervals at a resolution of approximately 0.3 µm pixel size. Ensure that the total imaging time required for acquiring Z stacks for one sample does not exceed 10 min from the time the sample is immersed into water until the completion of the acquisition.\nImmediately remove the water and transfer the culture box back to the growth chamber. Keeping the samples for a long time under water will influence the osmotic status of the cells.\n6. Micromechanical perturbation of the SAM\nSet up the imaging conditions as described in section 5 and acquire preablation image stacks of the cortical microtubule organization.\nDecant the water in the culture dish. Perform the ablation with a clean syringe needle (0.4 mm x 20 mm).\n\t\nUsing a dissecting microscope, carefully hold the needle and slowly approach the SAM.\n\t\tNOTE: Breath holding and handling the needle with a relaxed grip helps avoid shaking.\nBriefly contact the SAM dome with the needle tip to confirm that the ablation is done. Preferably perform the ablation on the periphery of the SAM, which allows visualization of the behavior and transitioning of unorganized cortical microtubules in the central region of the dome.\nRefill the culture dish with sterile deionized water and add propidium idodide (10 µg/mL). In addition to monitoring the GFP cortical microtubule signal, visualizing the propidium iodide using a separate channel can clearly mark regions of ablated cells. Propidium iodide is illuminated using the 561 nm or any other suitable laser with emission recorded between 600-650 nm.",
    "Acquire image stacks right after ablation (see section 6) and repeat the acquisition process every 2 h for a period of 6 h. Return the culture dish along with the sample into the incubation chamber after every time point. Ensure there is some water left on the culture media and wrap the culture dish with micropore tape to prevent desiccation.\n7. Data visualization and quantification\nGenerate surface projections using freely available software such as MORPHOGRAPHX11, FIJI12, or macro SurfCut13.\nPerform extraction of cortical microtubule anisotropy using FibrilTool14 macro in FIJI.\n\tNOTE: Detailed protocols for software use can be obtained from the respective citations.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}