{
  "id": 13777,
  "origin_website": "Jove",
  "title": "Operant Procedures for Assessing Behavioral Flexibility in Rats",
  "procedures": [
    "NOTE: All procedures described here were approved by the Institutional Animal Care and Use Committee (IACUC) at St. Mary’s College of Maryland, or the Canadian Council on Animal Care at the University of British Columbia.\n1. Animals\nUse adult male Sprague-Dawley or adult male Long-Evans rats.\n\tNOTE: Although differences in performance across these two strains have not been formally tested, Long-Evans rats tend to acquire a visual cue discrimination (described below) slightly faster than Sprague-Dawley rats (Floresco, unpublished observations).\nUpon arrival in the colony, house adult rats singly or in groups, depending on the needs of the experiment and the limitations of the facility. Use single housing for experiments in which animals are food-restricted, to provide better control of food intake. Allow animals to acclimate to the colony (without handling or food restriction) for at least 3 days after arrival.\n\tNOTE: A recent report has suggested that experimenter gender can adversely affect measures of pain and anxiety behavior24, findings which may extend to other stress-sensitive behaviors including cognition. Across our studies, we have not observed any obvious performance differences in rats trained by male vs. female handlers, although we have not formally assessed this.\nHandle animals daily for approximately 3-5 min each, for at least 3 days before beginning behavioral testing. On the first day of handling, obtain a free-feeding weight for each rat. The target weight for food restriction, if used, will be 85-90% of this free weight. Note this target weight, e.g., in a lab notebook or on the animal’s cage card. In some cases, food restriction may not be required if the reinforcer used is highly palatable (e.g., sweetened milk), although animals may become satiated too quickly with the use of such reinforcers.",
    "On each of the handling days, as each animal’s handling is finished, place approximately 10-20 reward pellets inside the animal’s home cage to acclimate rats (who are typically neophobic) to the reinforcement that will be used in the task (see Section 2.1.3 below).\nOver the three days of handling, gradually reduce animals’ daily food intake to bring them to their target weights. Be sure to indicate on the cage cards or other documentation that the animals are now on a restricted diet.\n\tNOTE: Food restriction in particular requires approval of the institutional IACUC or other regulatory body before any procedures may begin. The general procedures below were approved by the authors’ respective institutional agencies; be sure to consult any appropriate local and/or national guidelines for additional requirements at individual institutions.\nWeigh animals at least twice a week to monitor health and ensure that animals do not drop substantially below the target weight. Ensure that water is freely available at all times.\n2. Equipment and Software\nUse operant chambers equipped with (at a minimum) two retractable levers, two stimulus lights, a houselight, and a reinforcement dispenser for these tasks.\n\t\nPlace the levers on either side of a central reinforcement delivery area with one stimulus located above each lever.\nEnsure that the houselight illuminates the entire chamber while not interfering with detection of the stimulus lights, e.g., place the houselight on the wall opposite the levers and stimulus lights.\nUse palatable food (e.g., sucrose pellets20,21 or sucrose solutions25) for reinforcement. Wherever it is indicated to “reinforce the animal” below, deliver one 45 mg sucrose pellet or one prescribed amount of sucrose solution.",
    "Control stimulus presentation, lever operation, and data collection via an interface with a computer. Contact the authors for specific information regarding task programs written with MED-PC software, a program specifically designed for behavioral testing and data collection.\n\tNOTE: A crucial feature of the programs used for behavioral testing is the recording of key variables on a trial-by trial basis, including the position of the cue light, the lever selected by the animal, whether the animal made a correct, incorrect or no response (omission) and the latency to make a choice. These data are critical for assessment of the specific types of errors made during different portions of the choice sequence, as will be described below.\nAt the beginning of pre-training, assign each animal to an operant chamber where it will be tested each day throughout the experiment. Test animals at approximately the same time of day throughout the experiment.\nClean operant chambers regularly (at least once a week) with soap and water and/or an antimicrobial solution.\n3. Pretraining\nNOTE: Once animals have reached their target food-restricted weight, they may begin shaping in the operant chambers. Pretraining procedures typically take about 10-20 days, with substantial variability between rats. See Figure 1C for an overview of procedures.\nShape animals to lever press.\n\t\nTrain animals under a fixed-ratio (FR)-1 schedule of reinforcement, i.e., one reinforcement is delivered for each lever press. Shaping may be administered either with both levers extended (a press on either is reinforced), or on one lever at a time (e.g., one lever per day) with the order (left/right) counterbalanced across animals and/or experimental conditions.",
    "For shaping with both levers extended, continue shaping sessions (one 30-min session per day) until animals meet a minimum criterion of at least 50-60 presses per session for two consecutive days. This typically takes about 3-6 days.\nFor shaping on each lever individually, continue sessions on the first lever until animals respond at least 50-60 times on the first lever presented. Subsequent shaping sessions should use the opposite lever until the rat again achieves this criterion. Typically, this second criterion is quickly acquired after rats have learned to press the first lever.\n\t\t\tNOTE: Shaping on one lever at a time will take longer (the animal must meet criterion twice, once for each lever), but will ensure that animals obtain experience responding on and alternating between the two levers, a critical component of the tasks described below.\nGive animals retractable lever training sessions to familiarize them with the extension and retraction of the levers, and to ensure that rats are making relatively few omissions (typically <5) by the time they proceed to the main test phases of the task.\n\t\nOn each trial, determine which lever to extend. Alternate lever extensions in a pseudorandom order such that there are 45 left-lever trials and 45 right-lever trials, but no more than two consecutive trials extend the same lever.\nExtend the selected lever. Reinforce the animal for a press on this lever within 10 sec, after which the lever is retracted.\nIf the animal does not respond within 10 sec, retract the lever and record an omission.\nBegin trials every 20 sec throughout the session.",
    "NOTE: During retractable lever training, pre-exposure to stimulus lights (illumination of both the left and right stimulus lights upon each lever extension) may be employed to decrease the novelty and salience of the panel lights, and thus increase the difficulty of the subsequent set-shifting task20. Using this procedure will markedly increase the number of trials required to achieve criterion performance on the visual cue discrimination described below, and animals may require multiple days to learn this rule under these conditions.\nContinue retractable lever training sessions (one 30-min session per day) for a fixed number of days, or until animals meet a minimum criterion of five or fewer omissions for two consecutive days. This typically takes about 5-10 days.\n\t\t\nFor studies using acute manipulations (e.g., drug testing), use a fixed number of days (e.g., 5 days) to ensure that all rats receive similar exposure to the levers.\nAssess animals for side preference.\n\t\nConduct side preference testing immediately after the last session of retractable lever training (on the same day; see Figure 1C). The side preference task consists of seven trials, each of which is composed of between two and eight sub-trials separated by a fixed 20-sec intertrial interval (ITI).\nOn each sub-trial, extend both levers into the chamber for 10 sec or until a lever press response is made. Do not illuminate the stimulus lights during this phase of training.\nReinforce a response on either lever on the first sub-trial of each trial, and record it as the “initial response.”",
    "Do not reinforce responses on the same lever on subsequent sub-trials within the same trial. Allow up to six subsequent responses on the same lever with a trial, after which give a forced sub-trial. A forced sub-trial consists of only the opposite lever being extended for 10 sec or until a response is made.\nFollowing the initial response on each trial, reinforce the first response on the opposite lever, and then terminate that trial. Thus, within each trial (containing up to eight sub-trials), an animal is required to respond at least once on each lever.\nDefine each animal’s side preference as the side on which the majority of initial responses took place (at least four of seven trials).\nHowever, if an animal disproportionately responds to one lever throughout the session (defined as greater than a 2:1 ratio), record that side as the animal’s preference.\nBegin testing on the next consecutive day after the side preference test.\n\t\tNOTE: In our experiences, most animals do not display a strong side preference. For those that do, requiring them to press the lever opposite their bias during response discrimination training ensures that they are learning the specific response-reward contingencies associated with that lever, rather than merely responding on a preferred lever.\n4. Testing\nNOTE: Animals may be tested in one of three sequences, each of which involves two different tasks. Strategy shifting is assessed using (1) Set-Shifting from Cue to Response and/or (2) Set-Shifting from Response to Cue; reversal learning is assessed using (3) Reversal of Response. (A fourth possible sequence, Reversal of Cue, is not recommended for reasons discussed below.)\nGeneral information about tasks and sequences.\n\t\nConduct each sequence on consecutive days. Each sequence will take at least two days (initial discrimination learning and then shift or reversal).",
    "Use a maximum of between 150 and 200 trials in a single task, depending on the nature of the experiment. (Note that using higher numbers of trials will necessarily increase the total session time to 60 min or greater, which may be a factor to consider for pharmacological tests using compounds with shorter durations of action.)\nFor each sequence, test animals in one task (“Set”) followed by a second task (“Shift” or “Reversal”). Test animals for a maximum of 3 days (i.e., 450-600 trials) on each task, for a maximum of 6 days total.\n\t\t\nRemove animals that do not reach criterion within 3 days on the first task (“Set”) from the experiment.\nFor animals that do not reach criterion within 3 days on the second task (“Shift” or “Reversal”), assign a maximal score for trials to criterion that represents the number of trials experienced (i.e., 450 trials for 3 days of 150 trials each).\nIf the task parameters have been modified so that control animals can achieve criterion performance on a single day, then modify the task so that all rats are given only one test session, and give those that do not reach criterion within the allotted number of trials the maximum score (150-200 trials, depending on how the task has been configured).\nDuring the shift or reversal task, have the animals either start a session having to perform the new rule immediately, or give them 20 “reminder” trials where they perform the task using the rule learned during the first phase of training, and then the rule switches during the session22.",
    "NOTE: This latter procedure is particularly useful for experiments assessing potential pro-cognitive compounds that may improve flexibility, as it can be used to clarify whether better performance during a shift/reversal is due specifically to enhanced flexibility or impaired retrieval of the previous rule that may facilitate learning of a new one during the shift.\nSet-shifting: Cue Task to Response Task.\n\t\nBegin testing animals on the Cue task (see Figure 1A), which reinforces animals for responding on the lever below the illuminated stimulus light (cue). The Cue task is the “Set” task in this sequence.\n\t\t\nBegin each trial with both levers retracted.\nIlluminate either the left or right stimulus light for 3 sec; then extend both levers into the chamber for 10 sec or until a response occurs.\nReinforce only a correct response on the signaled lever. Upon a response on either lever, retract the levers.\nBegin trials every 20 sec throughout the session. Pseudorandomly determine the order of trials such that no more than two consecutive trials occur with the same stimulus light (left or right) illuminated.\nContinue trials until an animal has reached criterion (completed 10 consecutive correct responses) and has completed a minimum of 30 trials, or until 150-200 trials are completed without reaching criterion.\nIf criterion is not reached on the first day, test the animal on the Cue task again on the second day, but remove the requirement to complete a minimum of 30 trials. If criterion is not reached on the second day, test the animal on the third day following the same procedure.",
    "On the next day after reaching criterion on the Cue task, shift animals to the Response task (see Figure 1B), which reinforces animals for responding on the lever opposite their side preference, regardless of stimulus light (cue) illumination. The Response task is the “Shift” task in this sequence.\n\t\t\nBegin each trial with both levers retracted.\nIlluminate either the left or right stimulus light for 3 sec; then extend both levers into the chamber for 10 sec or until a response occurs. (Note that the position of the stimulus light is irrelevant for this task.)\nReinforce only a response on the correct position lever (left or right, opposite of the animal’s side preference). Upon a response on either lever, retract the levers.\nBegin trials every 20 sec throughout the session. Pseudorandomly determine the order of trials such that no more than two consecutive trials occur with the same stimulus light (left or right) illuminated.\nContinue trials until an animal has reached criterion (completed 10 consecutive correct responses) or until 150 trials are completed without reaching criterion.\nIf criterion is not reached on the first day, test the animal on the Response task again on the second day. If criterion is not reached on the second day, test the animal on the third day following the same procedure.\nimgsrc://cloudfront.jove.com/files/ftp_upload/52387/52387fig1highres.jpg",
    "Figure 1: Discrimination Tasks Used in the Set-Shifting Sequence. This figure displays the tasks as performed in the Cue-to-Response sequence; note that the tasks are the same, simply in opposite order, in the Response-to-Cue sequence. (A) During visual-cue discrimination learning, animals are reinforced for a response on the lever under the illuminated stimulus light. (B) During response discrimination learning, animals are reinforced for responding on one lever (either left or right) regardless of the position of the stimulus light. (C) Flowchart depicting sequence of training phases for a typical strategy shifting experiment, from pretraining to testing. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/52387/52387fig1large.jpg]\nSet-shifting: Response to Cue.\n\tNOTE: This sequence is the one that benefits most from the addition of the visual-cue light pre-exposure condition to pretraining20,21 (see Step 3.2.4 above). Previous studies have shown that pre-exposing rats to the lights during retractable lever training makes the response-to-cue shift more difficult and dependent on the medial prefrontal cortex. Conversely, prefrontal inactivations do not impair this type of shift if these pretraining procedures are not employed20.\n\t\nBegin animals’ testing on the Response task, which reinforces animals for responding on the lever opposite their side preference, regardless of stimulus light (cue) illumination. The Response task is the “Set” task in this sequence.\n\t\t\nProceed with testing as detailed in Step 4.2.2 (Response task) above.\nHave animals complete a minimum of 30 trials on this task, since it is the “Set” task.\nOn the next day after reaching criterion on the Response task, shift animals to the Cue task, which reinforces animals for responding on the lever below the illuminated stimulus light (cue). The Cue task is the “Shift” task in this sequence.",
    "Proceed with testing as detailed in Step 4.2.1 (Cue task) above. The minimum of 30 trials completed is not needed when this task is the “Shift” task.\nReversal of Response.\n\t\nBegin animals’ testing on the Response task, which reinforces animals for responding on the lever opposite their side preference, regardless of stimulus light (cue) illumination. The Response task is the “Set” task in this sequence.\n\t\t\nProceed with testing detailed in Step 4.2.2 (Response task) above.\nHave animals complete a minimum of 30 trials on this task, since it is the “Set” task.\nOn the next day after reaching criterion on the Response task, test animals on a reversal of the Response task, which reinforces animals for responding on the opposite lever as on the first task, i.e., the lever corresponding to their original side preference. This new Response task is the “Reversal” task in this sequence.\n\t\t\nProceed with testing as detailed in Step 4.2.2 above, with the exception that the reinforced lever position is now equal to the animal’s original side preference.\n5. Behavioral Measures\nRecord the trials to criterion on both the “Set” task and the “Shift” task. Trials to criterion is the main measure of accuracy, defined as the number of trials required to complete 10 consecutive trials, including those 10 trials. Note that the number of omissions should be factored out of this measure (e.g., if a rat requires 100 trials to achieve criterion and makes 10 omissions, the actual trials to criterion is 90).\nCount the number of errors made before criterion was reached on both the “Set” task and the “Shift” task. Errors to Criterion is a complementary measure of accuracy that can be more sensitive than Trials to Criterion and is not affected by increased omission rates.",
    "For shift error types, further analyze the types of errors made on the “Shift” task of a set-shifting sequence.\n\t\nCount an error as “perseverative/regressive type” when an animal responds incorrectly on the “Shift” task according to the rule that was correct on the previous day’s “Set” task. Then, use the following guidelines to divide errors of this type into perseverative and regressive, respectively.\n\t\t\nDivide the “Shift” session into blocks of 16 consecutive completed trials (do not include omitted trials). Within each block, identify which errors fit the definition of this type, i.e., the rat made an incorrect response that corresponds to the “Set” task rule. There will be a maximum of 8 possible errors of this type in each block of 16 trials.\nScore identified errors as perseverative until less than six of them are made within a block.\nBeginning with the next block and continuing through the end of the task, score errors of this type as regressive.\nIf the animal was tested in the “Shift” task on more than one day, continue scoring errors as if the blocks were contiguous.\nCount an error as “never-reinforced” when an animal responds incorrectly on the “Shift” task with a response that was not correct on either the “Set” or the “Shift” task.\nFor reversal error types, further analyze the types of errors made on the “Reversal” task of a reversal learning sequence. Reversal errors are broken down along two dimensions: (1) into perseverative and regressive errors, and (2) into toward-distractor and away-from-distractor errors.\n\t\nDivide total errors into perseverative and regressive.\n\t\t\nDivide the “Reversal” session into blocks of 16 consecutive completed trials. Count the errors in each block (a maximum of 16 errors is possible).\nScore errors as perseverative until fewer than 10 of them are made within a block.",
    "Beginning with the next block and continuing through the end of the task, score errors as regressive.\nIf the animal was tested in the “Reversal” task on more than one day, continue scoring errors as if the blocks were contiguous.\nDivide total errors into toward-distractor (stimulus light was illuminated above the incorrect, pressed lever) and away-from-distractor (stimulus light was illuminated above the correct, unpressed lever).\nRecord the number of omitted trials to provide a broad measure of the animal’s motivation level.\n\t\nExamine omission scores after each daily test session to rule out equipment malfunction, which can be indicated by high omission scores.\nIn the absence of equipment malfunction, exclude omission data from animals with abnormally high numbers of omissions (generally, ≥3 standard deviations above the mean) on either task.\nRecord response latencies by measuring the time elapsed between lever extension and a response. Latencies provide a rough measure of motor function and/or speed of processing."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}