{
  "id": 18384,
  "origin_website": "Jove",
  "title": "A Repetitive Concussive Head Injury Model in Mice",
  "procedures": [
    "All procedures were performed under protocols #201207692 approved by the Institutional Animal Care and Use Committee of University of Florida and in accordance with the National Institutes of Health Guide for the Care and Use of Laboratory Animals.\n1. Animal Care\nUse 3–4-month-old male C57BL/6J mice. Provide bedding, nesting material, food, and water ad libitum. Keep the mice in ambient temperatures controlled at 20 - 22 °C with constant 12-hr light/12-hr dark cycles.\n2. Pre-impaction Preparation\nAttach a custom-made silicone rubber-coated metal tip to an electromagnetic stereotaxic impact device. Make sure the flat bottom of the tip is parallel to the surface of the probe tip (Figure 1A).\nAnesthetize the mouse with 4% isoflurane followed by maintenance anesthesia of 2.5% isoflurane. Check the anesthesia via the flow meter. Monitor the anesthesia level until the animal reaches a surgical level of anesthesia by showing loss of pedal withdrawal reflex.\nPut the mouse in a prone position on a heating pad. Use a funnel-shaped nose cone to keep the mouse under anesthesia. Completely shave the head using a trimmer. Use petrolatum ophthalmic ointment on the mouse's eyes to prevent dryness while under anesthesia.\n3. Impact Parameters Setting\nNOTE: The impact system includes a control box to set impact parameters, an actuator to perform the impaction, and a digital stereotactic frame with 3-movement axes.\nPre-set the velocity of the impact device to 4 m/sec and dwell time to 240 msec on the control box.\n4. Positioning the Impact Center\nPut a soft heating pad under the animal's body to keep the body temperature near 39 °C. Mount the mouse in a stereotactic frame in a prone position with the blunt-end ear bars.",
    "Lower the impact tip close to the mouse's head by moving the Z-driver. Adjust the flat impact tip (9 mm diameter) by moving the X- and Y-drivers midway to the target coordinates above the sagittal suture.\nMake sure one edge of the impact tip is vertically parallel to an imaginary horizontal line drawn between the two ears (Figure 1C). The center of impact corresponds to the central sagittal suture midway between interfrontal and lambdoid sutures (interaural 9 mm to interaural 0 mm, lateral 4.5 mm).\n5. Impact Depth Setting\nTo correctly set the impact depth, use additional probe tip to replace the insulated silicone rubber-coated impact tip.\nTo make sure there is no shift of the impact center after switching tips, set the X and Y channel on the digital stereotaxic control panel to zero before switching the tips.\nMove the probe tip to the center of the impact area by manually moving the X-and Y-drives.\nClip contact sensor to the mouse's tail.\nMove the impactor (Z drive) down until the probe tip touches the surface of the impact site.\nSet the Z channel on the stereotaxic control panel to zero.\nMove the impact tip back to the impact area by manually adjusting X- and Y-drivers (NOT the zero buttons on the digital stereotaxic control panel) until X- and Y-drivers are zero (where the impact tip was previously positioned).\nRetract the actuator by moving the retract switch on the control box. Manually move the impactor down (Z driver) by 4 mm.\n6. Impact\nTrigger the impact by clicking the impact switch on the control box and achieve a deformation depth of 4 mm.\n7. Post-impaction\nMeasure the time from the impact until the mouse's first breath using a timer.",
    "Remove the animal from the instrument and place them on a warm pad to maintain their body temperature. Do not leave the animal unattended until it has regained sufficient consciousness to maintain sternal recumbency.\nAllow for recovery before returning the animal back into a clean cage. Do not return an animal to the company of other animals until fully recovered.\nObserve and weigh the mice daily. If the mice show signs of pain, intraperitoneally inject them with Meloxicam at 1 - 2 mg/kg every 12 - 24 hr.\n8. Repetitive Impaction\nGive the mice additional injuries on days 4, 7, and 10 after the initial injury (72 hr interval between impacts).\n9. Immunohistochemistry (IHC)\nTranscardial perfusion\nAnesthetize the mice via intraperitoneal injection with 200 m/kg pentobarbital.\nAssess and assure surgical-plane anesthesia by a toe pinch. Secure the mouse in the supine position by gently taping the forepaws and hind paws to a Styrofoam work surface inside a chemical fume hood.\nMake an incision through the skin along the thoracic midline from just beneath the xiphoid process to the clavicle. Make two additional skin incisions at the xiphoid process and proceed along the base of the ventral ribcage laterally.\nOpen the thoracic cavity and expose the heart by cutting through the thoracic musculature and ribcage.\nSecure the beating heart with blunt forceps and make a 1 - 2 mm incision in the left ventricle.\nImmediately insert a butterfly needle into the right atrium. Begin the infusion of 20ml saline by pushing the syringe slowly.\nSwitch from saline to 4% paraformaldehyde. Continue perfusion with 20ml of paraformaldehyde.\nDecapitate the mouse and remove the skin with scissors. Isolate the brain from the skull using a bone cutter.\nCryostat sectioning",
    "Embed brain tissues in optimum cutting temperature (O.C.T.) formulation and freeze at -80 °C. Place the brain in the cryostat in a sagittal orientation. Cut brain sections 5 µm thick.\nStaining\nDry the frozen sections at room temperature for 1 hr.\nIncubate the slides with 100 μl of 2% goat serum and 0.1% Triton X-100 in phosphate buffered saline (PBS) for 1 hr at RT.\nWash the slides 3 times with 300 μl of PBS. Then incubate the slides with anti-GFAP (1:200) or anti-ferritin antibody (1:200) separately over night at 4 °C.\nWash the slides 3 times with 300 μl of PBS. Then incubate the slides for 2 hr at room temperature with biotin-conjugated secondary antibody.\nWash the slides 3 times with 300 μl of PBS. Then incubate the slides with avidin-biotin complex (ABC) solution (1:50) at room temperature for 30 min.\nWash the slides 3 times with 300 μl of PBS. Then incubate in 3,3′-diaminobenzidine (DAB) substrate solution (50 ml PBS, 10 µl H2O2, 10 mg DAB pill, filter before using) for 5 - 8 min. Observe the slides under the microscope until the positive cells appear.\nRinse the slides in slow running tap water for 5 min. Clean slides with a lab-wipe. Then mount the sections with mounting medium and coverslip.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}