{
  "id": 17459,
  "origin_website": "Jove",
  "title": "Tissue Preparation Techniques for Contrast-Enhanced Micro Computed Tomography Imaging of Large Mammalian Cardiac Models with Chronic Disease",
  "procedures": [
    "All experiments were performed following the guidelines from Directive 2010/63/EU of the European Parliament on the protection of animals used for scientific purposes. Animal protocols were approved by the local ethical committee (CEEA50) at the University of Bordeaux. Hearts were sourced from three large mammalian models, including (i) Healthy Large white pigs (N = 2, 2 months old); (ii) Sheep (N = 1, 2 years old) with induced myocardial infarction13 and (iii) Sheep (N = 1, 7 years old) with induced atrial fibrillation30.\n1. Solution preparation:\nCardioplegic solution: Prepare 3 L of distilled water and add sodium chloride (110 mM), potassium chloride (16 mM), Sodium bicarbonate (10 mM), D-(+)-Glucose (9 mM), calcium chloride solution (1.2 mM) and magnesium chloride solution (16 mM). At the end, add 500 µL/L of heparin sodium. Conserve this solution at 4 °C.\nPhosphate buffered saline - EDTA solution (PBS-EDTA).\n\t\nFirst, add ethylenediaminetetraacetic acid (EDTA) to 1 L of distilled water for a final concentration of 10 mM. Increase and maintain a solution pH of 12 using sodium hydroxide solution (1 M) to dissolve the EDTA.\nOnce the EDTA is fully dissolved, lower the pH to 7.4 using hydrochloric acid. Add one foil pouch of phosphate-buffered saline to obtain a solution at 0.01 M (sodium chloride, 0.138 M; potassium chloride, 0.0027 M) and pH 7.4. Conserve this solution at room temperature (RT).\nEthanol - phosphomolybdic acid (PMA) contrast agent solution: Prepare 1 L of absolute ethanol and add the PMA to obtain a solution at 1% of concentration. Conserve this solution at RT.\n2. Source of tissue\nEuthanize the animal and extract the heart according to local ethical guidelines. Quickly immerse the heart into cold cardioplegic solution and gently massage the ventricles for initial rinsing.",
    "Ensure to cut the aorta below the aortic arch and clamp two sides of the arterial wall using needle holders.\nSuspending the heart by the needle holders, insert an aortic cannula into the aortic root, taking care not to make contact with or protrude through the aortic valves. Wrap a 0 gauge suture around the aortic arch at the level of the cannula and firmly tie the cannula in place.\nUsing 50 mL syringes, inject 200 mL of cold (4 °C) cardioplegic solution. Remove excess blood pooling in the cavities by tipping the heart on its posterior side to drain via the pulmonary veins.\nImmerse the rinsed heart and keep in cold cardioplegic solution stored on ice until ready for dissection.\n3. Tissue preparation:\nPrepare a 1 L reservoir supported 80 cm above a dissection dish. Couple a thermoplastic tube 80 cm in length and 3.2 mm internal diameter and 4.8 mm external diameter to a drain port of the reservoir.\nFix a three-way tap to the drainage tubing and couple further thermoplastic tubing (20 cm, 1.6 mm internal diameter and 3.2 mm external diameter) to each free port on the three-way tap. Fix two-way taps to the fee ends of the tubing.\nFill the reservoir with the cardioplegic solution supplemented with heparin (2500 units). Open the taps to allow the cardioplegic solution to drain and remove all air bubbles, then close the two-way taps.\nPrepare cannulae for left and right coronary ostia using Polytetrafluoroethylene (PTFE) tubing (1 mm internal diameter and 2 mm outer diameter).",
    "Cut 5 cm of tubing and heat one end by placing the tip next to a naked flame. Once 1 mm of the tip begins to melt and becomes translucent, press the tip against a hard heat resistant surface to shape a ridge at the cannulae tip to prevent cannulae from slipping out of the vessels.\nInsert 1 cm of the non-heated end of each cannula in to the two ends of the drain reservoir drainage tubing.\nRemove the aortic cannula. Under cold cardioplegic solution, localize the left and right ostia of coronary arteries.\nUsing pointed scissors, carefully separate the aortic root from the surrounding tissue above and below the coronary ostia to enable threading of a 0 G silk suture under the coronary vessel.\nOpen the two-way taps and insert the cannulae tips into the coronary ostia. With the cannulae tips extending 1-2 cm into the ostia and beyond the suture placement, tie off cannulae.\nRinse the heart while gently massaging the ventricles for 15 min until the heart is cleared of blood.\nAfter rinsing, close the two-way taps and disconnect them from the three-way tap. Transfer the heart to a 1 L plastic chemical-resistant container containing 500 mL of PBS-EDTA solution.\nRecirculate PBS-EDTA solution in the thermoplastic tubing under a fume hood using a peristaltic pump with two channels. Prime the pump tubing until the tubing is absent of air bubbles, then perfuse each coronary artery cannulae by recirculation at RT for 2 h at 80 mL/min.\nEnsure that the fume hood is operational. Stop the pump, drain the solution from the container and replace it with formalin (10%) for fixation for 1 h at RT at 80 mL/min.\nReplace the formalin solution with PBS to rinse the fixative three times for 15 min each at 80 mL/min.",
    "4. Tissue dehydration and drying:\nNOTE: Use the same perfusion rate (80 mL/min) and let the tissue remain at RT throughout.\nReplace PBS solution with ethanol at 20%, diluted in ultra-pure water, and perfuse for a minimum of 3 h.\nPerfuse the heart using a series of incrementing ethanol concentrations.\n\t\nStart by replacing the 20% ethanol solution with ethanol diluted to 30% and perfuse for 2 h.\nRepeat perfusion by incrementing the ethanol concentration at each iteration through 40%, 50%, 60%, 65%, 70%, 75%, 80%, 95%, 90%, 95%, 99%, and 100% for a minimum duration of 1 h at each step(concentration).\n\t\tNOTE: Heart samples may rest with no perfusion flow overnight at any ethanol dilution if minimum perfusion of 15 min has taken place for that concentration.\nOPTIONAL: If applying contrast agents via perfusion, perfuse the heart with 100% ethanol supplemented with the contrast agent PMA, 1% for 48 h. Rinse the contrast agent by perfusion with 100% ethanol for 2 h.\nTo reinforce the heart tissue prior to air drying, recirculate a 50:50 mix of ethanol and hexamethyldisilazane (HMDS) for 10 min. Follow this by 100% HMDS for a further 2 h.\n\tCAUTION: HMDS is a highly toxic and noxious substance. A strong odor of ammonia is released in contact with air. Moreover, the liquid form of HMDS is highly volatile and catalyzed by iodine-containing agents.\nDisconnect the cannulae from the tubing and suspend the heart from an aortic suture inside the fume hood.\nCarefully slide a zip-lock bag over the heart and close the bag seal over the suture to reduce exposure of the heart to circulating air. Allow the heart to dry through evaporation for 1 week.",
    "OPTIONAL: For diffusion-loading contrast agents, wash the heart in 100% ethanol for 15 min while agitating. Immerse the heart in 100% ethanol supplemented with PMA, 1%, for 48 h under vacuum. Repeat step 4.6.\n5. MicroCT:\nNOTE: A desktop X-ray microCT system was used for imaging pig hearts.\nMount the air-dried heart onto an appropriate sample holder. Prevent any movement during the X-ray microCT measurements using a clamp anchored to the sample holder and secure the heart via the dried and rigid aorta.\nMeticulously align the center of the heart sample along its longitudinal axis with the center of the imaging field of view for 0° and 90° angles of rotation. To achieve this in all orientations, suspend the heart in the air via an aortic clamp fixed to the sample support.\nAfter opening the software and initiating the X-ray microCT system, apply the X-ray filter aluminum, 1 mm, X-ray source voltage to 60 kV and current to 120 µA. Set image dimensions to 2016 x 1344 pixels and pixel size to 20 µm.\nRetract the sample holder out of the field of view and calibrate the background image and X-ray exposure time by obtaining a flat-field correction. Ensure that the average background X-ray transmission is greater than 80%.\nScout X-ray transmission images along the length of the support to determine the overall imaging field in the heart's longitudinal axis. For scanning, use a rotation step of 0.18°, a frame averaging of 5, and a sample rotation of 180°. Select the offset scanning mode to image the full width of the sample support.\n\tNOTE: The acquisition parameters indicated in this section have been selected to optimize the image quality of the ensemble heart composition.",
    "After scanning, use the software for tomographic reconstruction of an isotropic three-dimensional image volume. For the application of NRecon software, use acquisition-related artifact correction, including beam-hardening effects of 10% and ring artifact reduction of 8.\nTo optimize data storage limitations, apply the minimum rectangular region of interest that encompasses heart-specific image voxels. Export the images in an 8-bit bitmap format as an image stack.\nVisualize the reconstructed data stack using DataViewer software. Digitally orientate the sample within the image boundaries to realign the sample's long and short axes with the three principal axes of the image volume.\nCrop the image volume in all three axes to remove outer background layers of the image, to maximally reduce the total image size."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}