{
  "id": 9092,
  "origin_website": "Jove",
  "title": "Optogenetic Functional MRI",
  "procedures": [
    "Ethics Statement: Experimental procedures here have been approved by the Stanford University Institutional Animal Care and Use Committee (IACUC).\n1. Preparing Patch Cables and Ferrule Implants\nNote: Although patch cables and ferrule implants are available commercially, producing these in-house enables specialty designs and will cost less.\nTo prepare a fiber patch cable for delivering light from the laser to the implant in the brain, first cleave the optical fiber to the desired length.\n\t\nUsing a fiber cleaver, terminate the optical fiber to produce a flat end at the termination point. If the fiber has been coated with a jacket, strip the jacket off with a fiber-stripping tool beforehand.\nCleave the other end of the optical fiber to produce the desired length for the cable, ensuring that the cable is long enough to extend from the light source to the animal inside the bore of the scanner.\nMix a small amount of epoxy glue in a 1:1 ratio onto a piece of aluminum foil shortly before the next step, as the epoxy glue becomes too viscous for use 5 min after mixing.\nUsing a small wooden stick, gently apply epoxy glue to the part of the fiber that will be placed inside the concave side of the ceramic ferrule and then apply a small drop onto the surface of the flat side of the ferrule. After inserting it into the ferrule, ensure that a small length of fiber (<0.5 mm) protrudes from the flat side of the ceramic ferrule. Allow the epoxy glue to harden O/N for optimal results.",
    "On the side of the fiber optic patch cable that will connect to the laser light source, gently apply epoxy glue to the part of the fiber that will be placed inside the concave side of the ferrule of the FC/PC connector and then apply a small drop onto the surface of the flat side of the ferrule. After inserting it into the ferrule, ensure that a small length of fiber (<0.5 mm) protrudes from the flat side of the ferrule. Allow the epoxy glue to harden O/N for optimal results.\nPolish the flat end of the ferrules for both sides of the cable using a polishing disk by using tweezers to apply gentle downward pressure on the ferrule while making figure-8 rotations on aluminum oxide lapping sheets (from 3 µm to 1 µm to 0.3 µm grit).\nExamine the flat end of the ferrule with a microscope at 100X magnification. Ensure that the surface of the flat end, including the fiber optic surface itself, is free of any epoxy glue; continue polishing if epoxy glue remains on the surface. Ensure that the fiber optic surface has not broken or chipped.\n\tCAUTION: Ensure personnel take appropriate laser safety training classes and wear laser safety goggles before handling laser equipment.\nConnect the fiber optic patch cable to the laser light source through the FC/PC connector and align the fiber tip to the focal point of the coupler. Measure the light transmission power of the fiber with a power meter to ensure adequate light output.\n\tNote: The following steps are for preparing ceramic ferrules with fiber optics for chronic implantation into the brain; ceramic ferrules are hollow in the center and carry fiber optics to deliver light from a patch cable to a region of interest (ROI) within the brain.",
    "Using a fiber cleaver, terminate the optical fiber to produce a flat end at the termination point. If the fiber has been coated with a jacket, strip the jacket off with a fiber-stripping tool beforehand.\nCleave the other end of the optical fiber to produce the desired length for implantation into the brain. Determine the length of the fiber using a stereotaxic atlas to target the ROI within the brain.\n\t\nFor example: to target dorsal hippocampus in rat which is 3.5 mm below bregma, ensure that the length of the fiber protruding from the ferrule is 3.5 mm + 0.25 mm, accounting for skull thickness and allowing for margin of error. Therefore, check that the final length of the fiber is 3.5 mm + 0.25 mm + 10.5 mm (length of the ferrule) = 14.25 mm.\nMix a small amount of epoxy glue in a 1:1 ratio onto a piece of aluminum foil shortly before the next step (the epoxy glue becomes too viscous for use 5 min after mixing).\nUsing a small wooden stick, gently apply epoxy glue to the part of the fiber that will be placed inside the concave side of the ceramic ferrule and then apply a small drop onto the surface of the flat side of the ferrule. After inserting it into the ferrule, ensure that a small length of fiber (<0.5 mm) protrudes from the flat side of the ceramic ferrule. Allow the epoxy glue to harden O/N for optimal results.\nPolish the flat end of the ferrule using a polishing disk by using tweezers to apply gentle downward pressure on the ferrule while making figure-8 rotations on aluminum oxide lapping sheets (from 3 µm to 1 µm to 0.3 µm grit).",
    "Examine the flat end of the ferrule with a microscope at 100X magnification. Ensure that the surface of the flat end, including the fiber optic surface itself, is free of any epoxy glue; continue polishing if epoxy glue remains on the surface. Ensure that the fiber optic surface has not broken or chipped.\nCouple the polished ferrule to a fiber optic patch cable with a ferrule sleeve and connect the patch cable to a laser light source. Measure the light transmission power at the tip of the fiber with a power meter to ensure adequate efficiency.\nKeep a log of the power output required from the patch cable's ferrule for each ferrule implant to output the desired power level at the tip of the fiber optic (2.5 mW in this protocol). Discard ferrules with an attenuation rate of over 50% and with non-circular output pattern.\n2. Stereotaxic Implantation Surgery and Virus Injection\nEnsure that any experimental procedures involving the use of animals are approved by the local IACUC. Maintain aseptic conditions during survival surgeries by following aseptic procedures, including using sterile gloves, sterile masks, sterile surgical drapes and sterilized surgical instruments.\n\tCAUTION: Ensure that surgeons are wearing proper personal protective equipment (PPE) including safety goggles before beginning the procedure. Follow standard biosafety procedures when working with adeno-associated vector (AAV), taking care to avoid splashing. Dispose of AAV waste in a biohazard container.",
    "Load a microliter syringe with enough AAV for injection into the animal plus extra to account for potential volume losses (total of 4 µl per animal), keeping the syringe on ice before use. In this protocol, AAV5-CaMKIIa-hChR2(H134R)-EYFP at a titer of 4x1012 vg/ml is used. Place the animal under isoflurane anesthesia with an induction chamber, connected to a precision isoflurane vaporizer set at 3 - 4% with an oxygen gas source.\nShave the head with an electric razor and perform a triple surgical scrub on the skin using betadine and a 70% ethanol rinse.\nOnce the animal is in deep anesthesia (check toe reflex and breathing rate), immobilize the animal's skull in a stereotaxic apparatus with intra-aural positioning studs and tooth bar.\n\tNote: The entire procedure will take 1 - 2 hr, from anesthesia induction to recovery.\nSet the anesthesia to an appropriate level (1 - 3% isoflurane on the vaporizer) and continually monitor the animal's vital signs, adjusting anesthesia as necessary to maintain a breathing rate of ~40 breaths/min. Administer ophthalmic ointment on the eyes of the animal to prevent dryness while under anesthesia.\nMake a 15 - 20 mm midline scalp incision with a scalpel and retract the scalp using surgical hemostats attached to the periosteum. Reference lambda and bregma to position the drill bit over the coordinates for the ROI.\nDrill a small craniotomy (2 - 3 mm) over the ROI with a dental drill, taking care not to puncture the brain. Slowly insert needle attached to the microliter syringe through the craniotomy to the ROI in the brain.",
    "With a microsyringe pump controller, inject 2 µl of the vector solution into the ROI. Use a flow rate of 150 nl/min to avoid tissue damage. After the injection is complete, wait 10 min before removing the syringe slowly, at a rate of 0.5 mm/min.\nFollowing injection, dry the surface of the skull. Reference lambda and bregma to confirm coordinates and then insert the ferrule implant to the target depth (for example: 3.5 mm below bregma for dorsal hippocampus) at a rate of about 0.5 mm/min. Mount the ferrule implant to the skull using dental cement. After the dental cement has solidified, seal the incision with sutures (size 5-0 for rats) around the dental cement cap.\nAfter surgery, place the animal in its cage singly housed with half of the cage on top of a heater for anesthesia recovery. Do not leave an animal unattended until it has regained sufficient consciousness to maintain sternal recumbency. Do not place the animal in the company of other animals until it has fully recovered.\nFor post-surgical management of pain, administer buprenorphine subcutaneously every 12 hr at a dosage of 0.05 mg/kg for 24 hr. Administer antibiotic powder daily over the incision site for 3 days.\nRemove the sutures approximately two weeks after the surgery to prevent scabbing.\nWait 4 - 6 weeks after the virus injection for sufficient expression of optogenetic genes before performing experiments.\n3. Optogenetic Functional MRI\nCAUTION: Exercise caution around the permanent magnetic field of an MRI scanner. Secure equipment, including the function generator, light source, ventilator, capnograph and gas tanks, sufficiently far away (at least beyond the 5 Gauss limit).\nPlace the animal under gas anesthesia with an induction chamber, connected to a precision isoflurane vaporizer set at 5% with an oxygen gas source.",
    "Once the animal is in deep anesthesia (check toe reflex and breathing rate), intubate the animal according to the protocol detailed in Rivard et al. (2006) to allow monitoring of carbon dioxide by capnography26. Note: intubation is critical in maintaining proper levels of expiratory CO2 during imaging.\nSecure the animal in the scanner cradle.\n\tNote: In this protocol, the cradle was custom produced but such cradles are also commercially available. The rat cradle functions to secure the animal within the scanner for delivery of anesthesia, heated air and for restriction of motion.\nDeliver a mix of isoflurane (ranging from 1.2 - 1.5%) in approximately 60% nitrous oxide and 40% oxygen via tubing through the cradle. Ensure that the animal's head is securely fixed in order to avoid motion artifacts.\nProvide heated air through tubing in the cradle and insert a rectal thermometer with lubricant to monitor body temperature. Administer ophthalmic ointment on the eyes of the animal to prevent dryness while under anesthesia.\nConnect the fiber optic patch cable to a laser light source and measure the output at the tip of the patch cable's ferrule with a power meter.\nAdjust to the appropriate power level (determined previously in step 1.15) to produce the desired output (2.5 mW in this protocol) at the tip of the fiber optic implanted inside the brain. Since excessive power output from the fiber optic can potentially cause tissue damage inside the brain or cause tissue heating that will produce signal artifacts, do not significantly increase the power output of the laser beyond the intended output.\nPrevent light leakage from the implant with a cone of black electrical tape and cover the eyes of the animal. Couple the fiber optic cable to the ferrule implant on the animal with a ferrule sleeve.",
    "Place the coil over the head of the animal. Insert the cradle with animal into the bore of the scanner.\n\tNote: In this protocol, the single-loop transmit-receive coil was custom produced and pre-tuned to receive the optimal radio frequency from brain tissue.\nMonitor breathing rate and body temperature throughout this process, adjusting the artificial ventilator and heater as necessary to keep physiological values within limits (ensure that expiratory CO2 is 3 - 4% by rotating the knobs on the ventilator to adjust stroke frequency and volume and that temperature is 37 °C by clicking the arrows for temperature setting).\nSelect a positioning sequence to image the animal head location. If the brain is not at the iso-center, adjust the animal head location and repeat the positioning scan until the brain is at the iso-center. Select a linear shimming sequence and click load in the sequence selection window. Next, click start to reduce inhomogeneities of the magnetic field.\n\tNote: Shimming is a critical step that will directly influence the integrity of the fMRI data.\nSelect a T2-weighted sequence and click load in the sequence selection window. Next, click start to acquire T2-weighted high-resolution coronal anatomical images prior to fMRI to check on the overall integrity of the brain and to confirm the location of the optical fiber implant.\n\tNote: These images can be used as anatomy overlays for the ofMRI scan series.\nConnect BNC cables from the triggering port of the MRI scanner to the function generator so that the laser light source is driven according to an experimental stimulation paradigm.\n\tNote: In this protocol, the stimulation paradigm is 30 sec of baseline followed by 20 sec on/40 sec off for six min.",
    "Select a multi-slice gradient recalled echo (GRE) sequence and click load in the sequence selection window. Next, click start to acquire 35 mm x 35 mm (2D FOV) in-plane coronal slices with 0.5 mm x 0.5 mm x 0.5 mm spatial resolution.\n\tNote: The GRE sequence used here has a repetition time (TR) and echo time (TE) of TR/TE = 750/12 msec and a 30° flip angle.\nAt the conclusion of the scan, remove the animal from the scanner and monitor until it has awakened from anesthesia and can maintain sternal recumbency.\n4. ofMRI Data Analysis\nNote: The following steps are performed in MATLAB as described in a publication on high-throughput ofMRI27.\nAfter the raw scan data has been transferred to the computer used for analysis, use sliding window reconstruction to update the image every TR, with a four-interleave spiral readout, 750 msec TR and 12 msec echo time to acquire 23 slices per scan series. Instead of conventional reconstruction where new fMRI images are reconstructed only after all interleaves are acquired for each slice, the sliding window reconstruction method reconstructs images after the acquisition of each interleaf27.\nProcess the raw data for two-dimensional gridding reconstruction, motion correction, and calculation of time series as described previously27.\nUse a threshold coherence method to determine activated voxels by calculating the percent modulation of the BOLD signal of each voxel relative to the baseline period collected prior to stimulation as described previously27. Calculate coherence values as the magnitude of the Fourier transform at the frequency of repeated stimulation cycles divided by the sum-of-squares of all frequency components8.",
    "Using the time-series data for each voxel, average motion-corrected images that belong to consecutive scans of the same stimulation paradigm first. Then align the average 4D images to a common coordinate frame with a six degree-of-freedom rigid body transformation plus isotropic scaling for comparison within and between animals as described previously27."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}