{
  "id": 8321,
  "origin_website": "Jove",
  "title": "A Neuronal Apoptosis Model induced by Spinal Cord Compression in Rat",
  "procedures": [
    "The following procedure was performed with approval from the Institutional Animal Care and Use Committee (IACUC), Shanghai University of Traditional Chinese Medicine. All survival surgeries were performed under sterile conditions as outlined by the NIH guidelines. Pain and risk of infections were managed with appropriate analgesics and antibiotics to ensure a successful outcome. This surgical procedure is optimized for Sprague-Dawley (SD) outbred male rats at 12 weeks of age and 400 g weight.\n1. PVA-polyacrylamide hydrogel preparation\nNOTE: As shown in Figure 1G, 1H, the PVA-polyacrylamide hydrogel is a water-absorbing polymer sheet. In the natural state, the gel is extremely difficult to cut into small pieces. The preparation is described as follows.\nPlace a PVA-polyacrylamide hydrogel in water for 24 h to make it easier to cut after hydration.\nUse a self-made cutting tool (Figure 1H) to divide the whole hydrogel into pieces, sized 2 mm x 2 mm x 2 mm.\nTransfer these hydrogel pieces to an oven at 60 °C for 12 h for dehydration into small pieces of 1 mm x 1 mm x 1 mm as implantation materials.\n2. Anesthesia and preparation\nNOTE: Be sure to wear a surgical cap, disposable medical masks, and sterile surgical gloves throughout the sterile surgical process.\nPlace the rat on a heating pad, and ensure that rectal temperature is maintained at 37±1 °C during anesthesia.\nPlace the rat into the anesthesia chamber filled with 3% isoflurane for 3 min.\nGently pinch the rat's limbs and toes with tweezers to test for loss of withdrawal response, indicating successful anesthetization.\nFix the rat on the operating table in a prone position, ensuring that the limbs and head of the rat are firmly fixed.",
    "Fix the anesthesia mask to the face of the rat. Administer 2% isoflurane in an oxygen/air mixture via a standard rat nose mask to anesthetize the rat throughout the spinal compression surgery.\nPlace a cylindrical gauze pad (size of about 30 mm x 20 mm x 60 mm) between the rat and the operating table (Figure 1A) to ensure an unobstructed airway and fully exposed surgical site throughout the surgery.\nShave the hair around the surgical area of the rat's neck with an electric shaver.\nApply depilating cream to remove the remaining hair and expose the skin.\nDisinfect the surgical area with iodophor.\nCover the disinfected area with a sterile towel with a hole exposing only the surgical area on the dorsal side of the rat's neck.\n3. Surgical approach\nMake a longitudinal incision in the dorsal midline with a scalpel from the second cervical spinous process to the second thoracic spinous process, after percutaneously positioning the second cervical spinous process and second thoracic spinous process.\nBlunt separate the muscles of both sides with hemostatic forceps to expose the C2-T2 lamina after cutting subcutaneous tissue and fascia layer by layer.\nDrill a hole (1 mm x 1 mm) on the cervical laminar (Figure 1B).\n\tNOTE: To avoid excessive injury on the spinal cord, ensure that the rat’s neck is maintained in a dorsal arch state, allowing sufficient space between the cervical laminas.\nUse microsurgical forceps to grasp a piece of PVA-polyacrylamide hydrogel of the size of 1 mm x 1 mm x 1 mm and insert it into the previously drilled hole (Figure 1C, 1D). \n\tNOTE: Transient twitching performance indicates the spinal cord compression model has been established successfully.\nSuture the muscle, fascia, subcutaneous, and skin tissues, layer by layer, using triangular needles and 5-0 suture.",
    "After disinfection, transfer the animals back to the cage and keep them warm.\nSubcutaneously inject buprenorphine hydrochloride analgesia (0.03 mg/kg) every 6 h for 3 days following the surgery and as needed after that.\n4. Postoperative management\nInject an equivalent of 100,000 units of penicillin intraperitoneally into the rats once a day to prevent postoperative infection and relieve pain.\nTransfer the rats to new cages that have been continuously heated with an infrared lamp to ensure adequate heat preservation postoperatively.\n\tNOTE: Remove the heating lamp after the rat's consciousness is restored\nMaintain hygiene and ventilation of the rat's feeding cage.\nAssist the rats with eating and drinking twice a day. If necessary, administer a bladder massage to assist in urination until the urinary function is restored.\n5. Behavioral assessment\nUse the Basso, Beattie, and Bresnahan (BBB) rating scale to assess postoperative behavior.\n\t​NOTE: The BBB rating scale is a gold standard (Table 1) used to evaluate spinal cord-related function in rats. It assesses rats' movement according to scores ranging from 0 (no hind limb movement was observed) to 21 (gait coordination, toe space consistency, main claw position parallel in the whole posture, consistent trunk stability, and consistent tail elevation).\n6. Grip strength test\nUse an electronic grip strength meter to measure grip strength.\nGrab the lower half of the rat to suspend the rat and allow it to grab the metal rod of the front grip meter.\nWhen the rat grasps the metal rod, pull it away and record the grip strength.\nMeasure the grip strength three times for each rat and record the highest score.\n7. Inclined plate test\nPlace the rat on a rubber plate with an adjustable angle.",
    "Gradually raise the inclined plate angle by 5° each time until the rat manages to balance and stand firm for 5 s.\nRecord the maximum angle at which the rat can balance itself on the inclined plate.\nMeasure the maximum angle three times for each rat and record the highest score.\n8. Euthanasia, spinal cord separation, and frozen embedding\nNOTE: Ensure that appropriate eye goggles and face shield/mask are worn to protect the eyes, face, and respiratory tract from paraformaldehyde and formaldehyde gas.\nInject an equivalent of 10% chloral hydrate intraperitoneally to anesthetize the rats before opening the sternum to expose the heart.\nInsert a perfusion needle into the apex of the heart, fix it with hemostatic forceps, and slowly infuse with normal saline.\nDrill a hole on the right atrial appendage until clean normal saline flows out of the right atrium, indicating a successful infusion.\nStop the normal saline perfusion after the liver turns white.\nInfuse with an equivalent of 10% paraformaldehyde until the rat's body becomes stiff.\nAfter paraformaldehyde perfusion, remove the skin, muscles, and soft tissues around the spine; separate the C2-C7 segment of the cervical spine; and immerse it into 10% paraformaldehyde for fixation overnight.\nSeparate the cervical spinal cord from the spine and place it into a concentration gradient of 10%, 20%, and 30% sucrose solutions for gradual dehydration.\nTransfer the compressed spinal cord of 2 mm height along with an OCT embedding agent into a -80 °C freezer.\nAfter sectioning into 7-µm-thick slices and staining (H&E staining and dUTP nick end labeling (TUNEL)/neuronal nuclei (NeuN), see section 9), observe the histopathology of the spinal cord and neuronal apoptosis, respectively.\n9. TUNEL/NeuN immunostaining",
    "Immerse the spinal cord sections in phosphate-buffered saline (PBS) for 10 min at room temperature, then block with PBS solution containing 0.3%Triton X-100 and 5% bovine serum albumin (BSA) for 1 h.\nIncubate the spinal cord sections with a rabbit polyclonal anti-NeuN antibody (diluted 1:200;) overnight at 4 °C.  \nRinse the spinal cord sections three times in PBS. Subsequently incubate with Alexa Fluor 594-conjugated secondary antibodies for 2 h at room temperature.    \nPerform the one-step TUNEL apoptosis assay kit (green fluorescence) to stain the spinal cord sections' apoptotic nuclei.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}