{
  "id": 10098,
  "origin_website": "Jove",
  "title": "Preparation and Structural Evaluation of Epithelial Cell Monolayers in a Physiologically Sized Microfluidic Culture Device",
  "procedures": [
    "The NCI-H441 human epithelial lung cell line was used for the present study (see Table of Materials).\n1. Cell culture in the microfluidic channel\nFabricate the microfluidic channel and perform the pre-treatment following the steps below.\n\t\nObtain a single-channel flow array (see Table of Materials) and separate the upper portion from the polycarbonate base plate.\nObtain a #1.5 rectangular coverglass (thickness 0.17 mm) with dimensions of 60 mm x 22 mm. Clean surfaces of the coverglass in an ultrasonic bath and treat one side with a 0.1 mg/mL solution of Poly-D-Lysine at room temperature for 5 min before drying at 60 °C for 30 min.\nAffix a 0.13 mm thick double-sided adhesive (see Table of Materials), laser-cut to accommodate the dimensions of the flow array top and the flow channel (50 mm length, 5 mm width), to the flow array top, taking care to precisely align the channel cut-outs17.\nAffix a 0.1 mm thick mylar spacer (see Table of Materials), laser-cut to accommodate the dimensions of the flow array top and the flow channel, to the adhesive strip, taking care to precisely align the channel cut-outs.\nRepeat steps 1.1.3 and 1.1.4 until desired channel height is achieved (for example, for a channel height of 0.6 mm, use two spacers and three adhesive strips).\nAffix a rectangular coverglass to the bottom-most adhesive strip with the Poly-D-Lysine-treated side facing the adhesive. After assembly is complete, as indicated in Figure 1, apply firm and equal pressure to the top and bottom of construction and hold for 1 min.\n\t\tNOTE: Construction of the channel enclosure, including coverglass, adhesives, spacers, and flow array top, is now complete.\nRinse the channel with de-ionized water using a syringe, simultaneously checking for leaks.\nSterilize channel enclosure in an ultraviolet (UV) sterilizer for 30 min18.",
    "Using sterile technique, treat the channel with 2.0 µg/mL human fibronectin (see Table of Materials) in phosphate buffered saline (PBS) and incubate for at least 30 min at 37 °C19.\nPerform cell culture in the microfluidic channel following the steps below.\n\t\nIn a sterile laminar flow hood, use a micropipette to transfer an even suspension of NCI-H441 cells in RPMI 1640 medium with 10% fetal bovine serum (FBS) (see Table of Materials) to seed two microfluidic channels, each with cells at a surface density of 150,000 cells/cm2.\n\t\t\nFor 50 mm x 5 mm x 0.6 mm channels, use 0.25 mL of a 2.5 x 106 cells/mL suspension to fill each channel, as well as a portion of the ports. Verify that cells have been distributed evenly within the channels using a brightfield microscope.\nCulture the two channels for 24 h and 48 h respectively at 37 °C with 5% CO2 using a programmable syringe pump (see Table of Materials), drawing spent media out from the channel and fresh media into the channel from a sterile media reservoir attached to channel inlet comprised of a cut-open 20 mL syringe covered with paraffin film.\n\t\t\nAfter a 10 min waiting period following cell seeding, introduce and pump fresh media from the reservoir through the channel at a variable flow rate beginning at 0.2 µL/min and ramping up to 10 µL/min for 4 h, maintaining at that rate thereafter20.\n\t\t\tNOTE: This variable flow rate provides culture conditions that allow cells to (1) gravitationally settle to the culture surface, (2) adhere to the culture surface, and (3) form a confluent monolayer.\nPerform cell fixation inside the microfluidic channels using formaldehyde solution.\n\tCAUTION: Formaldehyde is toxic and must be handled in an appropriate chemical fume hood21.",
    "In a chemical fume hood, prepare formaldehyde solutions by using 4% formaldehyde in PBS (methanol-free) (see Table of Materials) to create two 4 mL portions, diluting the first to a concentration of 1% formaldehyde and the second to 2% formaldehyde using Dulbecco's phosphate buffered saline (DPBS; with Ca2+ and Mg2+) as the diluent. Transfer formaldehyde solutions to separate 5 mL syringes and label accordingly. Draw up 20 mL of DPBS into a separate 20 mL syringe.\nRemove microfluidic channels from the culture apparatus and place them into the chemical fume hood.\nAssemble the fixation and staining apparatus.\n\t\t\nAttach a 10 cm segment of transfer tubing to the side port of a three-way stopcock via a male Luer lock to hose barb adapter (see Table of Materials), then connect the stopcock to the inlet port of the flow array.\nNext, attach another 10 cm segment of transfer tubing to the outlet port of the flow array using the same type of hose barb adapter.\nFinally, secure the free ends of both transfer tubes in a chemical and biohazard-appropriate waste container, such as a labeled empty 50 mL conical centrifuge tube.\nTurn the stopcock to block off the flow array inlet port and flush the waste line with DPBS. Then, turn the stopcock to block off the waste line and slowly wash cells with 2 mL of DPBS. Repeat the flushing step using the new solution every time. A new solution (or concentration of solution) is introduced to the channel.\nSlowly push 2 mL of 1% fixative solution through the channel and then allow to sit for 5 min22.\nSlowly push 2 mL of 2% fixative solution through the channel and then allow to sit for 15 min.",
    "Wash cells by slowly introducing 2 mL of fresh DPBS to the channel in three separate instances (5 min each).\nComplete steps 1.3.3-1.3.7 for both microfluidic channels in parallel.\nStain, permeabilize, and add mounting media to the cells in the microfluidic channel.\n\t\nPrepare 0.1% saponin solution by adding 1 mg of saponin (see Table of Materials) per mL of DPBS to produce 4 mL of solution and gently vortex to mix23. Draw up 8 mL of DPBS into a 20 mL syringe.\nAdd an F-actin-staining phalloidin reagent and a nucleus-staining Hoechst reagent (see Table of Materials) to the 0.1% saponin solution, at two drops (0.1 mL) of each reagent per mL of saponin solution. Keep prepared staining/permeabilizing solution away from light by covering with aluminum foil24.\nFlush the line with a small amount of staining/permeabilizing solution (as described in step 1.3.4), then introduce 2 mL of the solution to the microfluidic channel and cover the channel with aluminum foil before allowing it to sit at room temperature for 30 min.\nFlush out the staining/permeabilizing solution twice with 2 mL of DPBS for 5 mins per flush.\nFor better image quality, add a suitable mounting media (with an index of refraction closely matching the microscope objective oil and cover glass, see Table of Materials) into the channel.\n\t\t\nUsing a micropipette, introduce a minimal amount of a soft-set antifade mountant to each port of the microfluidic channel, ensuring that the bottom surface is completely covered and no bubbles are trapped within the desired imaging area25. Seal the ends of the channel and verify cell layer integrity by observing under a brightfield microscope.\nComplete steps 1.4.3-1.4.5 for both microfluidic channels in parallel.",
    "NOTE: Image cells as soon as possible after staining for maximum image quality. If photobleaching occurs or long-term storage is desired, other mounting media with antifade or sample-preserving properties may be used. Note that hard-curing mounting media will distort the 3D structure of the cells and, by extension, the cell layer; for this reason, soft-setting mounting media is preferable26.\nImage cells in the microfluidic channel following the steps below.\n\t\nAdjust the confocal microscope (see Table of Materials) settings, including laser power, gain, offset, and scan parameters such as scan speed, scan area, scan format, resolution, and pinhole diameter27.\nTest imaging location by taking reference scans as well as Z-stacks until desired image parameters and conditions have been met. Dial-in parameters at sequentially higher-magnification objectives until the 40x oil-immersion objective has been reached and optimized28.\nUsing the flow array base plate as a reference, construct Z-stacks at five locations, at the would-be location of the first electrode on the inlet side, halfway between the center and the previous location, the center, halfway between the center and the location of the last electrode (on the outlet side), and at the last electrode, as indicated in Figure 2.\nPerform image processing and data analysis.\n\t\nExport XZ and YZ cross-sections using the confocal microscope software package (see Table of Materials).\nUsing an image-processing software (see Table of Materials) with edge-detection capabilities (thresholding value 15.0), measure the total image area in pixels by using the Magic Wand tool outside of the image, then the area excluding the total cross-sectional area of the cell layer in pixels by using the Magic Wand tool in the portion of the image exterior to the cell layer29.",
    "Using data-processing software (see Table of Materials), subtract the exterior area pixel value from the total area pixel value to find the cross-sectional area pixel value.\nConvert cross-sectional area pixel values to µm2 values by multiplying pixel values by the square of the µm/pixel value, as indicated in the microscope software for the particular image (0.31 µm/pixel for Z-stacks taken in 1024p resolution with no zoom on a 40x oil-immersion lens).\nCalculate means and standard deviations of data and graph results.\nimgsrc://cloudfront.jove.com/files/ftp_upload/64148/64148fig01.jpg\nFigure 1: Exploded-view schematic of the microfluidic channel construction. The top element is the top portion of the flow array, thin grey elements are adhesive strips, thin blue elements are mylar spacers, and the bottom element is the rectangular coverglass. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/64148/64148fig01large.jpg]\nimgsrc://cloudfront.jove.com/files/ftp_upload/64148/64148fig02.jpg\nFigure 2: Five imaging locations along the consistently layer-producing region of the microfluidic culture channel. Imaging locations are as follows: inlet-side, near where the first electrode would be on the intact flow array; halfway between inlet-side location and the center of the channel; center of the channel; halfway between the center and the outlet-side location, and outlet-side, near where the last electrode would be on the intact flow array. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/64148/64148fig02large.jpg]\n2. Cell culture in the eight-well chambered coverglass\nPerform pre-treatment of the eight-well chambered coverglass.\n\t\nObtain a sterile eight-well chambered coverglass manufactured with a #1.5 coverglass and cell adherence-increasing surface treatment (Figure 3, see Table of Materials).\nUsing sterile technique, treat the surface of culture wells with 2.0 µg/mL human fibronectin in PBS and incubate for at least 30 min at 37 °C19.\nPerform cell culture in the chambered coverglass following the steps below.",
    "In a sterile laminar flow hood, transfer 0.5 mL portions of solutions of NCI-H441 cells evenly suspended in RPMI 1640 medium with 10% FBS at volumetric densities of 81,000, 162,000, and 324,000 cells/mL to seed the culture wells at surface densities of 45,000, 90,000, and 180,000 cells/cm2, respectively. Verify that cells have been evenly distributed within the wells using a brightfield microscope.\nCulture cells for 24 h, 48 h, and 96 h at 37 °C with 5% CO2, replacing media daily.\nPerform formaldehyde fixation in the eight-well chambered coverglass.\n\tCAUTION: Formaldehyde is toxic and must be handled in an appropriate chemical fume hood21.\n\t\nIn a chemical fume hood, prepare formaldehyde solutions by making two portions of 4% formaldehyde in PBS (methanol-free), diluting the first to a concentration of 1% formaldehyde and the other to 2% formaldehyde using Dulbecco's phosphate buffered saline (DPBS; with Ca2+ and Mg2+) as the diluent.\nRemove the eight-well culture chambered coverglass from the incubator and place it into the chemical fume hood.\nGently wash cells with 0.5 mL of DPBS using a micropipette by slowly introducing liquid along the upper portion of the corner of each well.\nRemove existing liquid in each well by slowly extracting it from the corner of the wells using a micropipette. Using the liquid-introduction method (step 2.3.3), introduce 0.5 mL of 1% fixative solution into each well and allow it to sit for 5 min22.\nRemove existing liquid in each well using the liquid-extraction method mentioned in step 2.3.4. Using the liquid-introduction method mentioned in step 2.3.3, introduce 0.5 mL of 2% fixative solution into each well and allow it to sit for 15 min.",
    "Using the liquid introduction and extraction methods (steps 2.3.3 and 2.3.4), wash cells by introducing and removing 0.5 mL of fresh DPBS in each well in three separate instances for 5 min each.\nPerform staining, permeabilization, and mounting media addition in the eight-well chambered coverglass.\n\t\nPrepare 0.1% saponin solution by adding 1 mg of saponin per mL of DPBS and gently vortex to mix23.\nTo the 0.1% saponin solution, add two drops (0.1 mL) each of an F-actin-staining phalloidin reagent and a nucleus-staining Hoechst reagent per mL of saponin solution. Keep the prepared solution away from light by covering with aluminum foil24.\nIntroduce 0.2 mL of staining/permeabilizing solution to each well and cover the chambered coverglass with aluminum foil before allowing it to sit at room temperature for 30 min.\nFlush out staining/permeabilizing solution twice with 0.5 mL of DPBS.\nFor better image quality, add a suitable mounting media (with an index of refraction closely matching the microscope objective oil and cover glass) into the wells.\n\t\t\nUsing a micropipette, introduce a minimal amount of a soft-set antifade mountant to each well, ensuring that the bottom surface is completely covered and no bubbles are trapped within the desired imaging area25. Verify cell layer integrity by observing under a brightfield microscope.\n\t\t\tNOTE: Image cells as soon as possible after staining for maximum image quality. If photobleaching occurs or long-term storage is desired, other mounting media with antifade or sample-preserving properties may be used. Note that hard-curing mounting media will distort the 3D structure of the cells and, by extension, the cell layer, so soft-setting mounting media is preferable26.\nPerform imaging in the eight-well chambered coverglass.\n\t\nAdjust the confocal microscope settings, including laser power, gain, offset, and scan parameters such as scan speed, scan area, scan format, resolution, and pinhole diameter27.",
    "Test imaging location by taking reference scans as well as Z-stacks until desired image parameters and conditions have been met. Dial-in parameters at sequentially higher-magnification objectives until the 40x oil-immersion objective has been reached and optimized28.\nConstruct Z-stacks of three random locations in each seeding density/culture duration match-up.\nPerform image processing and data analysis.\n\t\nExport XZ and YZ cross sections using the confocal microscope software package.\nUsing an image-processing software with edge-detection capabilities (thresholding value 15.0), measure the total image area in pixels by using the Magic Wand tool outside of the image, then the area excluding the total cross-sectional area of the cell layer in pixels by using the Magic Wand tool in the portion of the image exterior to the cell layer29.\nUsing a data-processing software, subtract the exterior area pixel value from the total area pixel value to find the cross-sectional area pixel value.\nConvert cross-sectional area pixel values to µm2 values by multiplying pixel values by the square of the µm/pixel value as indicated in the microscope software for the particular image (0.31 µm/pixel for Z-stacks taken in 1024p resolution with no zoom on a 40x oil-immersion lens).\nCalculate means and standard deviations and graph results.\nimgsrc://cloudfront.jove.com/files/ftp_upload/64148/64148fig03.jpg\nFigure 3: Diagram of the eight-well chambered coverglass used for the fixed-well culture, staining, and imaging experiment comparing the effects of initial cell seeding density and culture duration on the formation of cell layers. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/64148/64148fig03large.jpg]Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}