{
  "id": 18516,
  "origin_website": "Jove",
  "title": "Transcutaneous Microcirculatory Imaging in Preterm Neonates",
  "procedures": [
    "This protocol follows the guidelines of the local human research ethics committee.\n1. Preparation\nSchedule the microcirculatory measurement so that it does not coincide with other procedures such as blood sampling. In term neonates it is best performed after feeding. This prevents agitation and will ease the measurement.\nEnsure that a nurse or a parent attends to support and comfort the neonate during the examination, using the principles of Newborn Individualized Developmental Care and Assessment Program12.\n\tNote: Although measurements can be performed by a single person, it is highly recommended to have a second person assist. One holds the camera and is focused on the neonate whilst the other operates the computer and software. In our experience, this results in higher quality images and a shorter duration of the procedure.\nIf the clinical condition of the neonate permits, place the neonate in supine position. Microcirculatory imaging can be performed in prone position, but this requires more skill and patience.\nMake sure the body temperature of the preterm infant is within appropriate range (36.5 - 37.5 degrees Celsius).\n2. Procedure\nInstall the device along the incubator. Make sure the incubator is at the right height.\nPut the disposable cap on the camera.\nApply gel, oil or saline on the tip of the probe; this will help smoothen the contact between probe and skin.\nPlace the camera on the ventromedial side of the infants upper arm. To prevent focus-artefacts, make sure the probe is perpendicular to the skin. This may require repositioning of the infants arm.\n\tNote: The ventromedial side of the upper arm is the primary location to measure the cutaneous microcirculation. This location has little lanugo hair and is therefore less prone to artefacts. It is most easily reached if the patient is positioned in supine position.",
    "To minimize the total length of procedure, gain time by finding the optimal depth of focus (Figure 3) while searching the location with the fewest artefacts.\n\tNote: Depth of focus depends primarily on postnatal age rather than gestational age. The average depth of focus in the first week of life is 0 - 80 µm. Hereafter, due to maturing of the skin, the focus depth rapidly increases with average values of 80 - 200 µm between 1 - 4 weeks of postnatal age (Figure 2). In term born neonates the average depth of focus is 80 - 160 µm at birth.\nStabilize the probe to avoid movement artefacts. To do so, rest the elbow on the incubator window and the wrist beside the neonate. Alternatively, position the probe alongside the neonate on a pillow.\nAvoid pressure artefacts by letting the camera only have the slightest contact with the skin. Pressure artefacts can be recognized during image capturing if there is back-and-forth flow in vessels or if large vessels are non-perfused while there is good flow in small vessels. Also if the flow pattern is identical throughout the whole screen, beware of pressure artefacts.\nRecord videos for a minimum duration of 5 sec.\nAfter a successful capture, move the camera to another spot on the upper arm.\n\tNote: It is recommended to capture in total 5 - 10 videos at 3 - 5 different locations, as some artefacts are only recognized at offline analysis, which means that the video in question is not usable for analysis.\nGently remove the gel, oil or saline from the skin with a small gauze.\n3. Offline Analysis",
    "Crop the video if there is a significant movement that impedes analysis. Go to the 'Tools' section and use the button 'Editor'. Select the frame interval eligible for analysis and click the 'Crop Video' button. Note: Videos are acceptable if movement is within ½ of the field view13.\nSelect the cropped video and stabilize it. Go to the 'Tools' section and use the button 'Analysis'. Click the 'Stabilize' button.\n\tNote: All movies must be stabilized before automatic analysis can be performed.\nSelect the stabilized video. Go to the section 'Analysis' and click the 'Detect' Button. Make sure the options 'Capillaries' and 'Vessels' are highlighted.\nAfter detection (Figure 4), click the 'CNA' or 'De Backer' button for a full microcirculatory report. This report includes the most used outcome parameters like the total vessel density (TVD), perfused vessel density (PVD) and proportion of perfused vessels (PPV).\n\tNote: As an alternative, videos can be exported offline to be manually analyzed. This option can be found in the section 'Tools'. Select the option 'Export' and click the 'AVA export' button.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}