{
  "id": 17719,
  "origin_website": "Jove",
  "title": "Involving Individuals with Developmental Language Disorder and Their Parents/Carers in Research Priority Setting",
  "procedures": [
    "This protocol is designed to be carried out with human participants. Advice on ethical approval was sought by the research group from the National Institute of Health Research (NIHR) and James Lind Alliance (JLA). Both state that research priority setting is “seen as service evaluation and development”17 and therefore does not require ethical approval.\n1. Step 1: Deliver the program of activities to iDLD/iDLDPC\nAs the estimated time of execution varies, carry out the activities as standalone activities (but should be sequential) delivered at different times, or delivered as a continuous program (approximately 90 minutes in total). Estimated standalone times are provided in each step, though exact timings will depend on the iDLD/iDLDPC’s ability to access material and the level of support that is required from the specialist DLD SLT.\n\tNOTE: The decision to deliver the activities as standalone activities or a continuous program is to be made by the specialist DLD SLT, using clinical judgement to inform decisions based on in depth knowledge of specific speech, language and communication needs of iDLD/iDLDPC. iDLD/iDLDPC with well-developed attention and listening skills may be able to engage with several activities or a continuous program at one time. iDLD/iDLDPC with lower levels of attention and listening skills may be best suited to one or two standalone activities at one time.\nThroughout the protocol, the specialist DLD SLT is instructed to use communication supports ‘as appropriate’. These supports are not defined, but should be selected and provided at the discretion of the specialist DLD SLT and will be unique to the needs of each iDLD/iDLDPC.\nHave the specialist DLD SLT choose the appropriate setting to deliver the program of activities using clinical judgement per iDLD/iDLDPC (10 minutes per iDLD/iDLDPC).",
    "Have the specialist DLD SLT revise in depth knowledge of the specific speech, language and communication needs of iDLD/iDLDPC they may invite to participate.\nHave the specialist DLD SLT consider the level of communication support that would be required for iDLD/iDLDPC.\nHave the specialist DLD SLT decide which iDLD/iDLDPC they will invite to participate who require substantial one-to-one support and plan for delivery in one-to-one setting.\nHave the specialist DLD SLT decide which iDLD/iDLDPC they will invite to participate who do not require one-to-one support and who benefit from peer support and interaction, and plan for delivery in a group setting.\n\t\tNOTE: The subsequent steps of the protocol can be used in either setting.\nIntroduce participant(s) to each other, as appropriate, and introduce the purpose of session to facilitate rapport building. Use communication supports as appropriate throughout (10 minutes).\n\t\nIntroduce self to iDLD/iDLDPC as appropriate: “My name is xxx”.\nEncourage iDLD/iDLDPC to introduce selves as appropriate, in turn: “Now it’s your turn, what is your name?”.\nIntroduce broad aim of session to iDLD/iDLDPC: “Today we are going to talk about the most important things you want to know more about, about communication”.\nInform the iDLD/iDLDPC on the outline of the session using Supplementary File A: “First we will talk about if you want to join in, or not- it’s up to you. Then, we will do some games, and activities.”\nTalk through the project information booklet Supplementary File B with iDLD/iDLDPC.\nObtain informed consent from iDLD/iDLDPC for participation in the session. Use communication supports as appropriate throughout (10 minutes).",
    "Inform iDLD/iDLDPC that they can decide whether to take part: “Do you want to talk to me about this?”; “You can choose to join in today or you can choose to not join in. It’s up to you”; “If you don’t want to, that is okay.”\nTalk through each item on the consent form (Supplementary File C for iDLDPC, or Supplementary File D for iDLD (or iDLDPC if appropriate) with iDLD/iDLDPC.\nReview and consolidate iDLD/iDLDPC understanding of the session, their rights, and ability to consent by asking questions: “Tell me about what we’re doing today?”; “Do you have any questions?”\nSupport iDLD/iDLDPC to sign a consent form if consent is given. For iDLD, obtain prior consent from iDLDPC for their child’s participation. If consent is not given, iDLD/iDLDPC chooses to either participate but their data goes unrecorded; or can cease participation.\nConsolidate and teach key concept of ‘speech, language and communication’. Use communication supports as appropriate throughout (10 minutes).\n\t\nInform iDLD/iDLDPC on the focus of this activity: “The next activity will be focused on speech, language and communication”\nFacilitate discussion on the question: what ‘is’ speech/language/communication? Using SLT expertise & knowledge of participants' needs and motivators, have the SLT select either game format (step 1.6.3) or discussion format (step 1.6.4). Use Supplementary File E as appropriate.\nGame format: Ask iDLD/iDLDPC to pass around a rewarding object (for example, a flashing ball) in turn and explain: “When you are holding the [object] you can tell us something about speech, language or communication”.\nDiscussion format: Ask iDLD/iDLDPC: “What do you think the words ‘speech’, ‘language’ or ‘communication’ mean?”\nProvide iDLD/iDLDPC with additional ideas: “talking is communication”; “signing is communication”; “How else do we ‘communicate’?”; “Can you communicate without talking?” or “What are other ways of telling someone how we feel?”",
    "Consolidate and teach key concept of ‘developmental language disorder or speech/language/communication difficulties’. Use communication supports as appropriate throughout (10 minutes).\n\t\nInform iDLD/iDLDPC on the focus of this activity (using appropriate terminology as decided by specialist DLD SLT based their personal historic use of terms with iDLD/iDLDPC): “In the next activity we will think about things we find difficult about speech/language/communication/ DLD/ things that you might find difficult because of DLD.”\nFacilitate discussion on the question: what ‘is’ speech/language/communication or DLD? Using SLT expertise & knowledge of participants' needs and motivators, have SLT select either game format (step 1.7.3) or discussion format (step 1.7.4). Use Supplementary File E as appropriate.\nGame format: Ask iDLD/iDLDPC to pass around a rewarding object (e.g., flashing ball) in turn and explain: “When you are holding the [object] you can tell us something about speech, language or communication that someone might find hard/ difficult because of DLD”.\nDiscussion format: Ask iDLD/iDLDPC: “What do you think some people might find hard about speech, language or communication?”\nProvide iDLD/iDLDPC with additional ideas and describe using communication supports as appropriate: “Some people find it hard to remember words”; “Some people find it hard to put words in the right order”; “Some people find it hard to talk to people they don’t know very well”.\nOPTIONAL: Have SLT facilitate reflection on their experiences of difficulties with speech, language and communication: “What do you find hard about communication?”\nConsolidate and teach key concept of ‘speech and language therapy’. Use communication supports as appropriate (10 minutes).\n\t\nInform iDLD/iDLDPC on the focus of this activity: “The next activity will be focused on describing what speech and language therapy is.”",
    "Facilitate discussion on the question: what ‘is’ speech and language therapy? Using SLT expertise & knowledge of participants' needs and motivators, SLT to select either game format (step 1.8.3) or discussion format (step 1.8.4). Use Supplementary File E as appropriate.\nGame format: Ask iDLD/iDLDPC to pass around a rewarding object (e.g., flashing ball) in turn and explain: “When you are holding the [object] you can tell us something about speech and language therapy”.\nDiscussion format: Ask iDLD/iDLDPC what they understand by the terms speech and language therapist/therapy.\nProvide iDLD/iDLDPC with additional ideas and describe: “Your speech and language therapist might help you with your talking”; “Speech and language therapy might help you learn new words in school”.\nOPTIONAL: If appropriate, have SLT facilitate reflection on their experiences of a speech and language therapist/therapy: “What do you like about speech and language therapy?”; “What do you not like about speech and language therapy?”; “What would you change about speech and language therapy”\nOPTIONAL: If appropriate, have SLT ask iDLD/iDLDPC: “How do you know if your speech and language therapy is helping?”\nConsolidate and teach key concept of ‘research’. Use communication supports as appropriate throughout (10 minutes).\n\t\nInform iDLD/iDLDPC on the focus of this activity: “In the next activity we will learn about the word ‘research’”.\nFacilitate discussion on the question: ‘What does research mean?’. Use Supplementary File F as appropriate.\nDescribe what is meant by ‘research’ to iDLD/iDLDPC at appropriate level of detail: “Research helps us answer questions.”; “Research is work that helps us find out things.”; “Research is the process of trying to find answers to questions, and doing this in a clear, organised, scientific way”. Use Supplementary File F as appropriate.",
    "Have SLT optionally select one or more of activities (steps 1.9.5, steps 1.9.6) as appropriate for the needs of iDLD/iDLDPC.\nPresent newspaper template Supplementary File G to iDLD/iDLDPC to facilitate explanation of ‘research’: “We are told about research in the news.”; “Newspapers often tell us about research”; “We find out about new research in the news.”\nPresent examples of headlines about research Supplementary File H to iDLD/iDLDPC to facilitate explanation of ‘research’: “Here’s some research- ‘Scientists discover a cure for cancer’”; “Here is the headline ‘Researchers find out how dogs can do your shopping for you’- is this research?”; “How about ‘Researchers discover shoes that tie themselves’. Would this be research?”.\nExplain to iDLD/iDLDPC the main focus of the session: “So today we will be thinking about research that tells us about DLD/speech and language difficulties.” Use Supplementary File E and Supplementary File H in combination, if appropriate.\nConsolidate and teach the key concept of ‘priority’. Use communication supports as appropriate throughout (10 minutes).\n\t\nInform iDLD/iDLDPC on the focus of this activity: “Now we will be thinking about what a ‘priority’ is”\nFacilitate discussion on the question: “What does it mean if something is a ‘priority’?”. Use Supplementary File I as appropriate.\nSLT to optionally select one or more of supporting activities (steps 1.10.4-1.10.7) as appropriate.\nDescribe what is meant by ‘priority’ to iDLD/iDLDPC at appropriate level of detail: “A priority is something that is really, really important to you. Something that is not a priority is something that is not important to you.” Use Supplementary File I as appropriate.",
    "Present iDLD/iDLDPC with Supplementary File J as stimuli to evoke decision-making on what is a priority/ what is important to the iDLD/iDLD. Ask iDLD/iDLDPC to think about each activity depicted in Supplementary File J. Ask iDLD/iDLDPC: “Is doing [activity] a priority for you?”.\nAsk iDLD/iDLDPC and facilitate discussion on the question: “What are your priorities in your life?”\nFacilitate discussion on the question: what does it mean to be a ‘research priority’? Use communication supports as appropriate throughout (10 minutes).\n\tNOTE: SLT may deliver all, or part of, these steps depending on iDLD/iDLDPC level of understanding, to be decided by SLT using clinical expertise, and presented as appropriate.\n\t\nInform iDLD/iDLDPC on the focus of this activity: “Now we know about research, and we know about priorities. Next, we will think about what ‘research priority’ means. There are different kinds of research and people will have different priorities for research.” Use Supplementary File F and Supplementary File G as appropriate, to remind iDLD/iDLDPC of previous activities.\nAsk iDLD/iDLDPC: “Do you think any of these headlines are a research priority?” Use Supplementary File F, G & H as appropriate.\nAsk iDLD/iDLDPC to think about their research priorities: “What would you like to find out about the most, through research?”; “What are your research priorities? This could be to do with your favorite hobbies, school, the food you eat, or your health?”; “Is there something that you think should be researched more?” Use Supplementary File F, G, H, & I as appropriate.\nExplain to iDLD/iDLDPC: “The next focus of the session is about research priorities for speech and language therapy.”\n2. Step 2: Specialist DLD SLT to collect data on iDLD/iDLDPC’s research priorities for DLD",
    "Carry out rating activity with iDLD/iDLDPC to identify research priorities. The topics referred to in this step are identified in earlier stages of the research priority setting exercise, outside the scope of this protocol. Use communication supports as appropriate throughout.\nInform iDLD/iDLDPC on the focus of this activity: “In the next activity we will think all about which areas of speech and language therapy that you think are most important for us to know more about”\nPresent the topics (Identification, assessment, bilingualism, intervention, service delivery- primary school, service delivery- secondary school, service delivery- adult, lifelong impact, technology, working with others, raising awareness) to iDLD/iDLDPC using topic cards (in Supplementary File K) in turn.\nExplain each topic to iDLD/iDLDPC, using Supplementary File K to facilitate understanding when deemed necessary by the SLT: “The first topic is how we might find out whether someone finds speech, language or communication hard.”; “The next topic is using things like computers or tablets in speech and language therapy”.\nTo support understanding further, if SLT deems appropriate then refer to Supplementary File L, to help describe them: “Let’s think about what else ‘Identification’ might mean. It could be about finding out about someone who is finding school difficult … or misbehaving in class …”\nPresent iDLD/iDLDPC with the scale Supplementary File I and explain: “These numbers can be used to show how ‘important’ or how much of a ‘priority’ something is.”\nPresent iDLD/iDLDPC with individual topic cards Supplementary File K in turn and ask for their opinion: “How important do you think it is to find out more about [topic]? Would it be at the top- really important/a priority; or nearer the bottom- not important/not a priority.”",
    "Support iDLD/iDLDPC to place topic cards (Supplementary File K) along the scale (Supplementary File I) appropriately given their responses to step 2.6, and facilitate decision-making using verbal prompts: “So ‘assessment’ is more important than ‘technology’. Is that right?”.\n\t\nContinue to verify and confirm until all topics are placed.\nOnce all topics are rated by iDLD/iDLDPC, feedback and confirm their decisions by talking through the ratings of each topic. Provide an opportunity for them to make any changes, highlighting and confirming strong priorities/not priorities if evident: “You’ve said the most important topic to find out more about is [topic]. You’ve said the least important topic to find out more about is [topic]. Do you think that’s right?”\nPresent iDLD with a certificate of participation (Supplementary Material M) and record their data.\n3. Step 3: Transform the data from iDLD/iDLDPC to influence early stages of research priority setting exercise\nUse iDLD/iDLDPC prioritisation data to inform on the topics which are to be discussed by other stakeholders in the next stage of the research priority setting exercise.\nCollate all topic ratings from a sample of iDLD/iDLD and calculate the median rating of each topic, and the range of medians across all topics.\nOrder topic medians by size and present on a bar chart to visually inspect for whether there are any clearly prioritized topics, which have medians substantially higher than non-prioritized topics. For example, a considerable difference in median at some interval between topics.\nConsider findings from step 3.3 alongside the range of medians to help interpret data. For example, a range of less than 6 could imply a clustering of similarly-rated topics which may indicate there is no clear prioritization. Larger ranges could imply greater differentiation of priority and non-priority topics.",
    "Have the research group use knowledge from steps 3.3 and 3.4 to identify if a cut-off value can be determined in which any topic with a median value above that cut off will be carried forward to future steps of the research priority setting exercise. If no cut-off can be identified, all topics should be carried forward.\n4. Step 4: Transform the data from iDLD/iDLDPC to influence final stages of research priority setting exercise\nNOTE: Results from the research priority setting survey of defined research areas are identified in an interim stage of the research priority setting exercise, outside the scope of this protocol.\nCombine research priority setting survey data of defined research areas with iDLD/iDLDPC rating data to identify the top ten research priorities.\nExamine the spread of individual topic ratings from iDLD/iDLDPC to identify whether there is an appropriate cut-off point which can represent a numerical boundary distinguishing ‘priority’ and ‘not-priority’ topics, in concordance with the survey data. The cut-off value will depend on the researcher’s interpretation of their own data and may be different in other instances: a rating of less than 8 reflects ‘not a priority’ and above a rating of 8 reflects ‘a priority’.\nCalculate the frequency with which each topic was rated by iDLD/iDLDPC above the cut-off point (i.e., how many times it was considered a priority). This frequency is the ‘corrector value’.\nAssign defined research areas to one or more of the topics (but ≤3). Assigned topics represent the broad areas which are covered within that defined research area. For example, a defined research area about ‘intervention via tele-therapy for primary school age children’ may be assigned to the following topics: intervention, service delivery – primary, and technology.",
    "Add the corrector values for each defined research area (which may be more than one, dependent on how many topics the research area is related to) to the survey data.\nSort the combined data (which now includes survey data and corrector values) for each defined research area by size. The ten highest scoring areas are the top ten research priorities."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}