{
  "id": 17156,
  "origin_website": "Jove",
  "title": "Endolymphatic Duct Blockage as a Surgical Treatment Option for Ménière's Disease",
  "procedures": [
    "This protocol is used for a randomized controlled trial that is currently being carried out in the Netherlands. The trial compares endolymphatic duct blockage (EDB) to endolymphatic sac decompression (ESD)9. The protocol was approved by the medical ethics committee METC Leiden-Den Haag-Delft (number P20.118) and the board of the hospital, as well as the hospital's research ethics committee (Haga Hospital Research Board, T20-108). All patients who participated in the trial where this protocol is followed have provided written informed consent. The results of this trial are expected in late 2024.\n1. Preoperative procedures\nPatient selection\n\t\nVerify that all the diagnostic criteria for definite Meniere's disease according to the AAO-HNS criteria are met1. To be included in this study, select patients who have suffered more than three attacks in the previous 6 months. The attacks must meet the diagnostic criteria of an attack1.\nRule out all the criteria of vestibular migraine reported by the consensus of the Bárány Society and the International Headache Society10.\nDue to its invasive nature, only consider this treatment in patients who have failed conservative treatment. This includes at least two intratympanic injections with (any type of) steroid and at least 6 weeks apart.\nIn case of deafness of the contralateral ear, carefully consider this treatment option, as the effect of this surgery on hearing is not clear. This was reported to concern 2% of the patients by Saliba et al.5\nInformed consent\n\t\nInform the patient about: potential benefits: reduction of vertigo attacks; risks: general risks of surgery (bleeding, wound infection, risks of general anesthesia), damage to the inner ear (deafness, disequilibrium), facial nerve damage, cerebrospinal fluid (CSF) leakage, and meningitis; and unknowns: effect on hearing loss, tinnitus, and aural fullness are currently unknown. The procedure seems to spare hearing function5,11, but the literature is limited.",
    "Preoperative testing\n\t\nPerform an MRI scan to rule out a retro-cochlear lesion, a CT scan, a hearing test (PTA), and electrocochleography preoperatively. Consider performing vestibular tests if the patient has complaints of chronic vertigo related to head movement.\nCheck the CT scan for anomalies in the area of surgery, such as a high-riding jugular bulb. If a high-riding jugular bulb is present, this should be taken into account when operating. Also, assess the course of the vestibular aqueduct.\nConsider using an operation room that is equipped with a CT scan.\n2. Operative procedures\nSetting up the operation room\n\t\nPlace the anesthesia unit at the foot end of the patient to avoid problems with the CT scan.\nPlace the control panel of the intraoperative neuromonitoring system as far away from the head of the patient as possible to avoid problems with the CT scan.\nPerform regular safety checks and induce general anesthesia.\n\t\nUsing target-controlled anesthesia (TGA), administer propofol (2.5-4 mcg/mL) and remifentanil (0.3-0.5 mg/kg).\nAdminister a low dose of the muscle relaxant rocuronium (0.3-0.5 mg/kg), as the facial nerve monitor is used during surgery.\nIntraoperatively, administer 4 mg of ondansetron and 4 mg of dexamethasone to prevent nausea postoperatively.\nMonitor the depth of anesthesia based upon hemodynamics-pulse, blood pressure, and CO2.\nPrepare analgesics to be administered at the end of surgery: 1 g of metamizole or 75 mg of diclofenac.\nPosition the patient as for a mastoidectomy: rotate the head to the contralateral side (45° maximum) with the neck slightly in flexion.\nPreparation for surgery\n\t\nIf necessary, shave any hair around the ear. Check to confirm if the tympanic membrane is intact.\nSterilize the outer ear, the external ear canal, and the skin around the ear with chlorohexidine or povidone. Infiltrate the retro-auricular skin with 2% lidocaine/1:80,000 adrenaline.",
    "Cover the patient with sterile sheets, leaving the surgery area free.\nSurgery\n\t\nMake a retroauricular incision of 7-8 cm just behind the auricle using a scalpel. Spread the subcutaneous layers until the temporal muscle is visible at the cranial side.\nMake a Palva flap (anterior based) by making a U-shaped incision to the petrous bone. Be careful not to damage the temporal muscle.\nUsing forceps and a raspatorium, peel the periosteum off the cortex until the external auditory canal is found.\nPosition two spreaders in the tissue layers so that the petrous bone is exposed. Place the spreaders in a position such that their handles are away from the operation site.\nPerform a canal wall up mastoidectomy using the burrs. Form a triangle and burr through the cortex and identify the mastoid cells. Identify the sigmoid sinus (caudal) and dura (cranial) as landmarks.\nIdentify the dura of the posterior fossa and the curvature of the horizontal vestibular canal. Identify the posterior semicircular canal (PSCC) and the dura mater of the posterior fossa.\nIdentify the prominence of the horizontal semicircular canal (HSCC) to determine Donaldson's line, to approximate the position of the ES (see Figure 1).\nThin the bone over the sac and the dura with diamond burrs and skeletonize the ES completely.\nRemove the remaining bone and expose the dura. Using an elevator, lift the dura toward the brain, exposing the medial side of the posterior canal. Identify the ES caudally as a flat, thick, white structure. The medialization of the dura exposes the ED somewhere in Donaldson's line, where it connects with the sacculus and utriculus.\n\t\tNOTE: Be careful not to damage the duct. If the duct is damaged or ruptured, use fascia or donor pericardium to plug the leak.",
    "Using the elevator, create a site to insert the tip of the instrument to clip the duct. At this level, in order to prevent any CSF leak, take care not to traumatize the dura, which is often thin.\nUsing an elevator, try different clip sizes to determine which clip fits best.\n\t\tNOTE: Thinning of the bone over the sigmoid sinus may be necessary to allow introduction of the clip instrument.\nIf a CT scan is available in the operation room, follow the subsequent steps.\n\t\t\nWithout closing the clip, perform a CT scan. Cover the patient with a sterile cover. Position the scan so that the complete skull is scanned.\nChoose the protocol 20sDCT Head Micro under 3D head and follow the activate stand movements.\nChoose skull base and set up in the caudal-cranial direction. Follow the necessary 3D activate stand movement steps.\nAfter performing the scan, open Preset gallery and go to Head and neck. Select the preset DynaCTHead Petrosa.\nAssess the images to decide whether the clip is in the correct position. Do not forget to send the images to the patient file.\nIf the clip is not placed correctly over the ED, replace the clip and/or consider using another size.\nRepeat step 2.5.12.2-2.5.12.6 of the CT-scan to assess the new clip position until satisfactory.\nRemove the clip with an elevator and place the clip in the clip applier. Place the clip over the ED and close the clip.\n\t\tNOTE: Clipping of the duct causes traction on the involved structures and may lead to tearing of the dura. If CSF leakage occurs, use fibrin sealant and fascia or donor pericardia to close the tear in the dura.",
    "Consider using a second clip to ensure the duct is tightly blocked. Ensure that the clips are positioned at the correct location and (completely) block the ED. If there is no CT scan available, check the clip position following the subsequent steps.\n\t\t\nMake an incision along the inferior edge of the ES, starting from the posterior site of the newly positioned clip toward the sigmoid sinus using a knife.\nIf the incision opens the sac, this confirms the correct placement of the clip. If a CSF leak is observed, continue the dissection medially in order to localize the sac.\nRepeat this procedure until correct placement of the clip is confirmed.\nCompletion of surgery\n\t\t\nClose the tissue in layers, close the Palva flap and the subcutaneous layer using an absorbable polyfilament suture (70 cm), and close the skin with an absorbable monofilament suture by applying a subcutaneous continuous suture (70 cm).\nCover the closed skin with plasters and a bandage. Wrap one bandage around the head to keep the plasters in place.\nAdminister the analgesic that was prepared in step 2.2.5.\n3. Postoperative care\nExamination of the patient after surgery\n\t\nDetermine if nystagmus is present. If spontaneous nystagmus is present, determine whether the fast phase is toward the operated ear or toward the contralateral side. If the fast phase is in the direction of the operated side, this indicates hyperexcitation of the operated ear and may be due to stimulation of the labyrinth from the surgery. This nystagmus is expected to fade out. If the fast phase is in the direction of the non-operated ear, this may indicate loss of function of the operated ear.",
    "Scratch the bandages to screen for loss of cochlear function. If the scratching on the operated side is not heard, and loss of hearing is suspected, consider administering steroids (1 mg/kg/day) for 7 days.\nConsider performing a bone conduction hearing on the day after surgery. If hearing loss is noticed, consider administering steroids (1 mg/kg/day) for 7 days.\nIn case of pain, prescribe 1 g of acetaminophen (paracetamol) four times a day, and add 50 mg of diclofenac three times a day. In case of nausea, prescribe 4 mg of ondansetron.\nKeep the patient under observation until they are mobile, can eat and drink, and can go to the toilet independently.\nConsider dismissal on the day of surgery if the patient feels confident and has assistance at home. If the patient does not feel well, or feels dizzy or unbalanced, keep the patient overnight for observation.\n\t\nUpon dismissal, instruct the patient to keep the bandage around the head for 24 h, as well as the plasters underneath, keeping them dry until the next visit to the surgeon, 7 days after surgery.\nIf bleeding or leakage of clear fluid occurs, ask the patient to contact the department immediately. In case of fever or excessive pain, ask the patient to contact the department.\nExplain what the patient can expect after the surgery-dizziness and vertigo attacks; dizziness and/or vertigo are common in the weeks after surgery. Inform the patient that having a vertigo attack does not mean that the surgery has failed. With regards to pain, most patients do not experience much pain after surgery, but acetaminophen (paracetamol) can be taken.\n4. Postoperative visits",
    "Ask the patient to visit the surgeon 1 week after surgery. During this visit, remove the bandages and assess the wound. In case of signs of infection, prescribe antibiotics. In case of motion-related, short-lasting vertigo, consider that it might be benign paroxysmal positional vertigo (BPPV). Perform the Dix-Hallpike test, and if positive, carry out the Epley maneuver.\nPlan a PTA 6 weeks after surgery. Plan a follow-up visit 6 months and 1 year after surgery. Perform a hearing test at each visit.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}