{
  "id": 12543,
  "origin_website": "Jove",
  "title": "Psychophysiological Assessment of the Effectiveness of Emotion Regulation Strategies in Childhood",
  "procedures": [
    "NOTE: The university's institutional review board approved all procedures before recruitment or data collection with human subjects began. Parents provide informed consent for children's participation, and children provide verbal (or, verbal and written if older than 7 years) assent to participate in these activities.\n1. Randomly Assign Participants to Experimental Conditions\nTest the effects of two different emotions and two different emotion regulation strategy instructions against a control group that receives no emotion regulation instructions, using a 2 (discrete emotion condition: sad or scary) x 3 (emotion regulation condition: control, distraction, or reappraisal) between-subjects experimental design.\n\tNOTE: Other experimental designs may also be used, as long as a suitable control group is included against which the effects of interest may be compared. For example, a neutral film condition, in which no emotion is evoked, could be included, or a within-subjects design could be used. Regardless, an approximately equal number of children should be assigned to each experimental condition.\nRandomly assign children to one of the six conditions before they arrive at the laboratory (with the constraint that an approximately equal number of boys and girls are assigned to each condition).\n2. Establish Rapport with Child Participants\nThe following are procedures for the lead experimenter, E1 to follow. At the beginning of the visit, establish rapport with the child to ensure their compliance with study procedures.\nSit at a small table with the child, and introduce art supplies the child can use if desired (e.g., crayons, paper). Ask 2 - 3 questions about the child's hobbies and interests to engage the child in friendly conversation.\nOnce the child appears to have acclimated to the laboratory context and is relaxed in his or her interaction (usually about 5 - 10 minutes), begin other procedures.\n3. Train Children to Self-report Their Emotions",
    "Train children to self-report the intensity of their emotional reactions (e.g., sadness, fear, happiness) on simple, four-point cartoon face scales to rate each discrete emotion of interest separately (see Figure 1). Each scale depicts a neutral face (e.g., “not at all” Sad/Scared/Angry/Happy”)  followed by three faces depicting increasingly exaggerated (A Little, Pretty Much, Very) target facial expressions for each emotion.\nPresent one scale to the child, and read the scale anchors aloud while pointing to each corresponding face.\n\tNOTE: Say, \"Today we are going to play a lot of different games, and sometimes we will ask you to tell us what you are thinking and feeling. This scale shows some sad faces. You can use this to tell us how sad you are feeling at different times today.\"\nDemonstrate use of the scale.\n\tNOTE: Say: \"So, this face is where you would point if you feel 'Not at All' sad [points to first face]; This one is where you would point if you feel 'A Little' sad [points to second face]; This one is where you would point if you feel 'Pretty Much' sad [points to third face]; And this one is where you point if you feel 'Very' sad [points to fourth face].\"\nRepeat this training process for each emotion of interest (e.g., sadness, fear, anger, happiness).\nFor each emotion scale, give the child two practice questions to ensure comprehension. If children point to an incorrect face, or express confusion about what to do, repeat the instructions (and practice trials) until children answer two practice items correctly.\n\tNOTE: Say (e.g., \"Which face would you point to if you felt very sad?\" and, \"Where would you point if you felt not at all sad?\").",
    "After the training trials, explain to the child that they will be asked to report feelings using the same scales a few more times during the study.\nimgsrc://cloudfront.jove.com/files/ftp_upload/55200/55200fig1.jpg\nFigure 1. Emotion Rating Scale. This scale displays the picture scales that the researcher shows the children throughout the experiment to collect in-the-moment ratings of how sad, scared, and happy they are. Please click here to view a larger version of this figure.[href=http://cloudfront.jove.com/files/ftp_upload/55200/55200fig1large.jpg]\n4. Acquire a Baseline Report of Children's Emotions\nAsk children to self-report how they are \"really feeling, right now,\" using the same 4-point emotion face scales before children receive emotion regulation instructions or view any film clips.\nThis self-report constitutes the baseline emotion assessment that is necessary to ensure that children do not feel pre-existing negative emotion that would influence their reaction to the experimental manipulation. Children additionally report their sad, scared, and happy feelings again using this same format after viewing the sad or scary film clip.\n5. Acquire Cardiac Psychophysiology Data\nHave the second adult experimenter (E2) enter to assist with electrode placement.\n\tNOTE: E2 explains that children wear sticky sensors on their torsos so that the experimenters can monitor their hearts during the study.\nFrame electrode placement as a game to improve children's compliance with the procedure. As part of the \"sticker game,\" the child chooses multiple stickers from a sheet and can keep them, place them on the experimenters, place them on their parent, or wear them on their own body.\nSecure stickers (selected by the child) to three disposable, pre-gelled electrodes and place these over the child's distal right collarbone, lower left rib, and lower right rib to acquire the ECG signal.",
    "Ask parents if they are comfortable with E2 placing the electrodes on their children. If not, ask parents to help place the electrodes on their children's torsos, with guidance from E2.\nAfter attaching the electrodes, give the children 5 min to acclimate to wearing the sensors, then acquire a resting parasympathetic baseline. Record baseline electrocardiogram (ECG) for five minutes. During this baseline phase, children sit quietly at a table with E1, coloring or reading a book.\nContinue the ambulatory, wireless ECG recording for the rest of the visit with the ambulatory monitor secured in a child-sized backpack hung on the back of a chair to minimize movement artifacts. ECG signal for ambulatory acquisition is typically sampled at a rate of 500 ms and bandpass filtered at 40 and 250 Hz.\nAt the end of the study, gently remove and discard the electrodes\n\tNOTE: This is analogous to removing an adhesive bandage in terms of potential discomfort to the participant.\n6. Provide Children with Emotion Regulation Instructions\nBased on experimental condition assignment, provide each child with specific, scripted emotion regulation instructions before showing them a film clip designed to evoke negative emotion.\n\t\nFor children assigned to the Control condition\n\t\t\nShow a short movie to the children and instruct them pay attention to all the things that happen in the movie. NOTE: Instructor says: \"I'm going to show you a short movie now. Pay close attention to the movie because we will ask you some questions about it later. While you watch this movie, I want you to just try to pay attention to all the things that happen in the movie, ok? Can you try to do that? Ok, so what are you going to try to do while you watch the movie?\"\nFor children assigned to the Distraction condition",
    "Show a short movie to the children and instruct them pay attention to the movie. Instruct the children if they feel bad or upset, then to think about something happy instead.  NOTE: Instructor says: \"I'm going to show you a short movie now. Pay close attention to the movie because we will ask you some questions about it later. While you watch this movie, if you start to feel bad or upset, I want you to think about something happy instead. You could think about a time you had fun playing, or eating ice cream, or think about a TV show you like to watch. Anything that you can think of that is happy is ok to think about instead, ok? Can you try to do that? Ok, so what are you going to try to do while you watch the movie?\"\nFor children assigned to the Reappraisal condition\n\t\t\nShow a short movie to the children and instruct them pay attention to the movie. Instruct the children if they feel bad or upset, then to think that it's not really happening. \n\t\t\tNOTE: Instructor says: \"I'm going to show you a short movie now. Pay close attention to the movie because we will ask you some questions about it later. While you watch this movie, if you start to feel bad or upset, I want you to think about how everything that is happening in the movie is not really happening, so it's not a big deal. Think about how it's just a movie, and isn't real, ok? Can you try to do that? Ok, so what are you going to try to do while you watch the movie?\"",
    "Provide follow-up questions at the end of the specific instructions to ensure that children understand what they should do. Repeat instructions for any child who expresses confusion about what to do.\n\tNOTE: Follow up question such as, \"what are you going to try to do?\"\n7. Elicit Negative Emotion\nShow children standardized film clips to elicit negative emotions (e.g., sadness or fear). Though a variety of film clips can be chosen, clips should be brief (about 3 - 5 min long), age-appropriate, and acceptable to parents (e.g., films with a G or PG rating should be chosen).\n\tNOTE: Before running the experiment, pilot test the film clips with the target age range to ensure that the expected discrete emotion or negative affective state is evoked with sufficient intensity and specificity.Though sadness and fear are examined in this protocol, other negative and positive emotions can be evoked as desired using other film clips.\n\t\nElicit sadness by showing children a brief (~5 minutes) scene from The Land Before Time32.\n\t\tNOTE:In the clip, a young dinosaur searches for his mother during a storm. She has been injured and shortly after he finds her and they have a conversation, she dies. The little dinosaur is left alone and lost and cries while he tries to find his way back to the main herd.\nElicit fear by showing children a brief (~5 minutes) scene from The Secret of NIMH33.",
    "NOTE: In the clip, a mouse navigates her way through a dark and eerie cave (an owl's lair) to seek help for her son, who is ill. Inside the cave, she trips over piles of bones, and is almost eaten by a giant spider before coming face-to-face with the owner of the cave, a giant scary owl who devours a moth in front of her, and crushes the spider. She has a brief conversation with the owl in which she asks for advice about how to help her son.\nAfter watching the emotion-eliciting film, ask children to self-report their feelings again using the face scales. Later, compare this second self-report to the baseline emotion rating to ensure the emotion manipulation was effective.\n8. Alleviate Intense or Lingering Negative Emotions\nAfter completion of the task and removal of the electrodes, provide a positive affect emotion induction to ensure children do not leave the laboratory feeling upset.\n\tNOTE: As with the previous film clips, choose a film that is brief (about 3 - 5 minutes long), age-appropriate, and acceptable to parents (e.g., with a G or PG rating).\nElicit positive emotion in children by showing a short film (~4 minutes) called For the Birds34.\n\tNOTE:In the clip, a bird lands on a telephone wire, is joined by several other birds, and then by a big, awkward looking bird. A series of amusing interactions takes place, and the clip ends with all the birds laughing together.",
    "NOTE: If a child becomes unduly upset at any point during the study, follow ethical guidelines for working with children. If a child seems overly distressed by any aspect of the protocol (e.g., watching the sad or scary film), take a short break. After allowing the child to calm down for ~30 s, check to see if the child is ready to continue or if they need a longer break.\n\tNOTE: If a child continues to be excessively distressed, call the parent in to the room to help comfort their child. If the distress persists for longer than a couple of minutes, the child cannot calm down, or the participants wish to discontinue participation (in the task or study altogether) the protocol should be stopped immediately, and the positive affect induction begun to conclude the visit.\n9. Process and Code Physiology Data\nContinuously record electrocardiogram (ECG) throughout the laboratory tasks and process these data offline (as described in 9.2 - 9.6).\n\tNOTE: Respiratory sinus arrhythmia (RSA), the measure of parasympathetic physiology of interest to index children's online emotion regulation, is derived from the ECG signal using a software program (e.g., Mindware Heart Rate Variability). The Mindware software program allows for behavioral or procedural event markers to be inserted into the physiological data stream on- or off-line.\nUse the heart-rate editing software's validated algorithm35 to detect interbeat intervals (IBIs) and intervals that are physiologically improbable based on the overall distributions of collected data.\n\t\nAfter opening the software, select the correct participant file on the data file path. In the events and modes tab enter the correct start and end time of the episode and enter 30 s as the segment time.",
    "In the calibration settings tab, select the high frequency range for the age of children in the study. For children between 3 and 12 years of age, respiratory sinus arrhythmia (RSA) is defined as the natural log integral of the .15 - 8 Hz power band36,37\nThen, click on the Analyze (ENTER) button on the lower right. Observe a segment of the data appear on the screen with the question \"Is the EKG inverted?\". Visually inspect the data and respond no if it looks normal or yes if it looks inverted.\nVisually inspect data for artifacts and make corrections as needed. Blue dots indicate that there is no need to edit the data, yellow dots indicate that the data should be carefully inspected and edited.\n\t\nClick the green \"Edit Rs\" button at the top to inspect and edit a segment of data. Check the RSA value for each segment on the RSA section on the lower right of the screen. Values should be between 0 - 10.\nWrite the clean and edited data to a spread sheet file using the white \"Write\" button on the top of the page. When done writing out segments, click the red \"Done\" button at the top of the screen.\n\t\nUsing the spread sheet file, calculate interrater reliability on ~25% of cases. To constitute a reliable match, final RSA values for any 30 s epoch from two scorers should fall within 0.1 of one another31,38,39. Raters should agree on at least 85% of the epochs.\nIn the spread sheet file, click on the \"HRV stats\" tab to retrieve RSA values for each coded segment. Calculate RSA scores for an episode by averaging all segments within the episode.\n10. Calculate RSA Reactivity Scores\nCalculate RSA reactivity using one of the methods described below.",
    "First, calculate RSA reactivity as the simple difference between the baseline (sitting quietly) and challenge (watching an emotion-eliciting film) tasks. Subtract the baseline value from the average task value for each participant (e.g., RSA during sad movie = 7.20; RSA during baseline = 7.00; task minus baseline: 7.20 - 7.00 = .20).\n\t\tNOTE: In this approach, positive reactivity values indicate that RSA has increased (RSA augmentation) relative to baseline. Include baseline RSA values as a covariate in other analyses to account for individual variation in initial level when characterizing the pattern of change within the experimental context.\nCalculate RSA reactivity as a residualized change score by predicting task RSA from baseline RSA in a linear regression. Save the standardized residuals from this analysis as a new variable. In this approach, positive reactivity values indicate that RSA increased more than sample average.\n11. Data Analysis\nConduct a manipulation check using children's self-reported emotions.\nNOTE: Preliminary analyses (e.g., one-way ANOVA) should compare children's ratings of each emotion at baseline to ensure that there are no differences in emotion ratings by experimental condition before viewing the films.\n\t\nDetermine whether the emotional films elicited the intended negative emotion by comparing children's baseline self-report ratings (before film) to ratings provided immediately after the film using paired samples t-tests or ANOVA.\n\t\tNOTE: Significant increases in target emotion suggest that the films evoked the target emotion. If multiple negative emotions are assessed via self-reports (e.g., sadness and fear), an alternate way to ensure the effectiveness of the emotion elicitation is to compare the intensity of different emotion ratings provided immediately after the film. The target negative emotion (e.g. sadness) should be evoked significantly more strongly than other negative emotions (e.g., anger, fear).",
    "Examine the effect of emotion regulation instructions on children's physiological reactivity. Use ANOVA to compare children's baseline RSA levels across the different emotion regulation instruction conditions and ensure there were no differences in RSA before viewing the film (again serving as a check of the assumptions of random assignment).\n\tNOTE: RSA reactivity (change from baseline to task) that represents an increase from baseline levels (augmentation) is typical when emotions are evoked using film clips29,30,31. Examination of average baseline RSA and average task (film viewing) RSA should show a significant increase in RSA for all participants, regardless of experimental condition.\n\t\nExamine differences in RSA reactivity patterns among experimental conditions using ANOVA, with covariates included as needed.\n\t\tNOTE: RSA reactivity is the dependent variable of interest here, but similar procedures can be used to examine other indices of emotional processes (continuous coding of facial expressions, for example).\nTo probe ANOVA results, conduct pairwise comparisons to identify the significant differences in RSA reactivity scores between different experimental conditions.\n\tNOTE: Recall that Control group participants are not instructed to use a specific emotion regulation strategy to manage sadness or fear. Thus, key contrasts in RSA reactivity are between the two experimental strategy conditions (Distraction and Reappraisal) and the Control condition.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}