{
  "id": 15233,
  "origin_website": "Jove",
  "title": "An Optimized Quantitative Pull-Down Analysis of RNA-Binding Proteins Using Short Biotinylated RNA",
  "procedures": [
    "1. General methods and material\nPrepare the appropriate medium for the chosen mammalian cell culture and pre-warm it at 37 °C for 20 min before use.\nPrepare the required material in advance, as described in the Table of Materials. Autoclave glassware, plasticware, and buffer stocks.\nPrepare the buffers as described in Table 1. Adjust the pH of the stock solutions using concentrated HCl or NaOH before diluting the components to their final volumes.\n2. Mammalian cell line preparation\nGrow HEK 293T cells in Dulbecco's Modified Eagle Medium (DMEM) supplemented with 10% fetal bovine serum (FBS) and 100 µg/mL penicillin/streptomycin solution. Incubate them at 37 °C in a humidified incubator supplied with 5% CO2. Routinely split the cells.\nBefore detaching, rinse the cells with enough phosphate-buffered saline (PBS) solution to cover the growing surface.\nRemove the PBS and add an ultra-thin layer of trypsin-EDTA solution.\nIncubate the cells at 37 °C in a humidified incubator provided with 5% CO2 for 5 min, or until the cells are detached (they should look dispersed under microscopic observation).\nDilute the trypsin-EDTA solution tenfold by adding complete DMEM to inactivate it and count the cells.\nPlate 1.5 x 105 cells/mL in 6-well plates, considering two wells/condition to test.\nIncubate the cells at 37 °C for 48 h in a humidified incubator with 5% CO2.\n\tNOTE: Check the manufacturer instructions for the type of medium and supplement apt for the cell line. Also, the amount and the incubation time of trypsin-EDTA depend on the cell line. Some cell types grow faster/slower than what was reported in this protocol; thus, seeding concentration should be tested beforehand.\n3. Total protein harvest\nRemove medium from the wells where cells are growing.\nWash each well of the 6-well plates with 1 mL of PBS.\nDiscard the PBS.",
    "Move the plates on ice and either proceed with step 3.5 or freeze the dry plates at -80 °C to facilitate lysis.\nAdd 200 µL of lysis buffer to each well.\nUse a cell scraper to detach and break the cells.\nTransfer the cell extract deriving from two wells into the same 1.5 mL tube.\nPlace the tube containing the protein extract on ice for 30 min.\nCentrifuge the cell lysates at 17,000 x g for 15 min at 4 °C.\nTransfer each supernatant into a pre-cooled tube.\n\tNOTE: A total of 106-107 cells for each PD condition are recommended. Cell lysis and protein harvest should be performed with ice-cold buffers. Protease inhibitors should be added to the lysis buffer to prevent protein degradation.\n4. Protein concentration determination\nPrepare Bradford reagent, as indicated by the producer, by diluting it fivefold in dH2O.\nDistribute 1 mL of reagent in a 1 cm cuvette, add 1 µL of the sample, and mix by inversion.\nIncubate in the dark at room temperature for 5-10 min.\nRead the absorbance at 595 nm.\nCalculate the volume of protein extract corresponding to 1.5 mg of proteins and bring all the samples to a final volume of 600 µL using lysis buffer.\nKeep the samples on ice until use.\n\tNOTE: Any other protein concentration determination method can be used, following buffer compatibility recommendations. In any case, the lysis buffer should be used as a blank. Many reagents are not compatible with dithiothreitol (DTT). It is recommended to add DTT or other reducing agents only after protein quantification (DTT to a final concentration of 1 mM).\n5. Bead preparation\nMix the beads in their storage buffer by flicking the tube.\nCalculate 100 µL of slurry medium/sample and place the volume into a magnetic rack.\nBead wash",
    "Remove the storage solution and wash the beads by adding 1 mL of lysis buffer/tube and invert it manually.\nRemove the buffer using the magnetic rack.\nRepeat the washing step.\nAdd a volume of lysis buffer equal to the initial volume of slurry medium, mix by flicking the tube, and dispense the medium uniformly into as many 1.5 mL tubes as there are samples.\nBead blocking\n\t\nRemove the buffer using the magnetic rack and add 600 µL of a 0.25 mg/mL solution of yeast tRNA prepared in lysis buffer.\nIncubate for 1 h at room temperature on a rotating wheel.\nRemove the tRNA solution using the magnetic rack.\nAdd 600 µL of lysis buffer and wash by mixing manually.\nRepeat the washing step and discard the buffer.\n6. Bead loading\nPrepare 200 µg of RNA oligonucleotide in 600 µL of lysis buffer for each tube containing the initial 100 µL slurry medium (now blocked beads).\nAdd the oligo to the beads and incubate for 1 h at room temperature while rotating.\nRemove the solution, add 600 µL of lysis buffer, and wash the beads twice by rotating the tubes for 5 min at room temperature.\nDiscard the buffer.",
    "​NOTE: Never vortex the beads, but flick instead. Limit the number of pipetting steps, unless necessary. When possible, use cut, 1 mL tips. The amount of bead slurry medium/sample depends on the binding capability of the beads and the starting amount of the total proteins. If the RNA oligo is predicted to have a significant amount of secondary structure, we recommend to first denature it at 80 °C for 10 min and then cool it down slowly at room temperature or refold it by incubating it at 30 °C for 1 h. It is suggested to recover the RNA oligo after bead loading and determine the concentration left, in order to optimize the amount required for loading and to evaluate the possibility of reusing the RNA.\n7. Protein binding on beads\nNOTE: From now on, when possible, perform the steps at 4 °C.\nTake a 5% volume from the 600 µL protein solution and keep it as INPUT (IN) for further analysis (1.5 mg of proteins are dissolved in 600 µL, so 5% corresponds to 30 µL and 75 µg of proteins).\nAdd the remaining protein mix to each tube of loaded beads and leave slowly rotating overnight at 4 °C.\n8. Washing of nonspecific binders\nRemove the unbound fraction using the magnetic rack. Save 5% of the volume and label it as FLOWTHROUGH (FT) (the unbound volume is ca. 600 µL, so again keep 30 µL for further analysis).\nAdd 1 mL of wash buffer 1 to the beads and leave it rotating for 5 min at 4 °C.\nDiscard the buffer.\nRepeat steps 8.2 and 8.3.\nAdd 1 mL of wash buffer 2 to the beads and leave it rotating for 5 min at 4 °C.\nDiscard the supernatant.\n9. Elution of specific binders",
    "Add 100 µL of elution buffer 1 or elution buffer 2 to the beads.\nMix manually by flicking and incubate for 5 min at room temperature.\nPlace the tubes in a thermomixer and shake vigorously for 5 min at 95 °C.\nPlace the tube into the magnetic rack and collect the eluted fraction into a clean tube.\nQuickly spin the beads with a bench centrifuge to maximize the recovery of the eluate.\nSave 5% of the total ELUATE (EL) volume for further analyses (total volume is 100 µL, so separate 5 µL into another tube).\nIf needed, the protein concentration can be determined as in section 4, by using elution buffer as a blank.\n\tNOTE: It is recommended to refrain from adding DTT to the elution buffer until protein concentration has been determined. If protein quantification is not required, or if reducing agent-compatible protein quantification kits are available, 1 mM DTT can be added to the elution buffer from the start. In this protocol, both elution buffer 1 (containing 1 M NaCl) and elution buffer 2 (with 2 M NaCl) were tested. No difference in the elution efficiency of the target protein was observed with increased ionic strength, but it is recommended to test both conditions before establishing the most appropriate buffer. If a high presence of salt in the elution buffer represents a limitation for further analysis, the very low amount of detergents in the elution buffer allows for buffer-exchange. As an alternative, the eluate can be diluted to reach the desired salt concentration.\n10. Identification of protein binders by mass spectrometry\nAcetone precipitation\n\t\nConcentrate the eluted proteins by diluting it fourfold in cold (-20 °C) acetone.\nVortex and incubate the tube at -20 °C overnight.\nSpin at 17,000 x g for 30 min at 4 °C.",
    "Gently remove the supernatant and allow the acetone to evaporate until the pellet has completely dried.\nIn-solution protein digestion\n\t\nDissolve the protein pellet by adding 50 µL of denaturation buffer.\nAdd DTT to a final concentration of 5 mM, allowing protein reduction for 30 min at 55 °C.\nCool down the samples at room temperature and proceed with the protein alkylation reaction, adding iodoacetamide (IAA) at a concentration of 10 mM for 15 min.\nDigest the proteins using a suitable enzyme (trypsin, LysC) and incubate the samples overnight at 37 °C.\nStop the digestion by adding 1 µL of 10% trifluoroacetic acid (TFA).\nClean up and concentrate the peptides on a custom reversed phase C18 micro-column, as previously described19.\nElute peptides from the C18 tip with Buffer B.\nRemove the organic component using a vacuum centrifuge and resuspend the peptides in 5 µL of 0.1% formic acid for further analysis.\n\t\tNOTE: Alternatively, protein digestion can be performed \"on-beads\" immediately after washing nonspecific binders (steps 8.1-8.6), thus making the protocol faster. However, it is advisable to test the efficiency of the enzyme working \"on-beads\" immobilized-proteins compared to standard in solution digestion, in order to guarantee the optimal experimental protein sequence coverage.\nLiquid chromatography-tandem mass spectrometry (LC-MS/MS)\n\t\nPlug in the analytical column (C18-stationary phase) and keep it at 45 °C during the time of the run.\nConnect the column to the outlet of a six-port rotary valve of the LC pump through a capillary finger-tight fitting (20 µm x 550 mm) in a single-column configuration.\nAdjust the LC settings as follows:\n\t\t\nLoad the peptides under controlled pressure (980 bar) in Buffer A.",
    "Apply a 5%-20% Buffer B gradient at 300 nL/min over 59 min, followed by a 20%-30% Buffer B gradient over 15 min and a 30%-65% Buffer B gradient over 5 min.\nAdd a wash step by increasing the concentration of Buffer B up to 95% over 5 min plus a 5 min isocratic step at 95% Buffer B.\nOperate the mass spectrometer in data-dependent acquisition (DDA) mode to switch automatically between MS and MSMS events.\nDefine a loop count equal to 15 using an automatic gain control (AGC) target value of 3 x 106 and 1 x 105 for the MS and MSMS events, respectively.\nSet the maximum allowed ion accumulation time to 20 ms for MS with a resolution of 60 K, and 100 ms for MSMS with a resolution of 15 K.\nPerform a high collision dissociation (HCD) fragmentation experiment using a normalized collision energy of 28%, with a dynamic exclusion time of 20 s.\nOperate the source parameters as follows:\n\t\tSpray voltage: 1.7 kV\n\t\tCapillary voltage: 275 °C\n\t\tNeither a sheath nor auxiliary gas used\n\t\tNOTE: In this protocol, ultra-high performance liquid chromatography (UHPLC) mass spectrometric (MS) analysis has been specifically performed using an LC single column setup, coupled to a hybrid triple quadrupole orbitrap instrument (Table of Materials). Other LCMS systems can be used, but an adaption of parameters is recommended.\nData analysis\n\t\nUse the Load button to import the raw files.\nDefine the experiment names by clicking on the Set Experiment button.\nEnter the group-specific parameters section to specify all theparameters related to identification:\n\t\tEnzyme used for digestion: Trypsin/P\n\t\tMissed cleavages: up to three\n\t\tFixed modification: Carbamidomethylation\n\t\tVariable modification: N-acetyl (Protein), Oxidation (M)\nUpload an updated FASTA file, available from public databases such as UniprotKB.",
    "Specify the correct parse rules according to the source of the chosen database.\nDefine a parentage false discovery rate (FDR) value = 1 for both proteins and peptides.\nAdd the label free quantification (LFQ) option in the Label Free Quantification tab.\nKeep the minimum LFQ ratio count at two.\n\t\tNOTE: Here, we describe data analysis using MaxQuant24 and Perseus software25 to perform protein quantification and subsequent statistical analysis, respectively. However, data analysis can be performed with any other commercially available or free bioinformatic. FDR is estimated using a target-decoy database-based approach26. Peptide and protein FDR equal to 0.01 means that peptides and proteins identified are expected to contain 1% of false positives.\nStatistical analysis\n\t\nLoad the proteingroups.txt file to perform statistical analysis at the protein level.\nDefine the LFQ values as main columns.\nRemove \"reverse\" and \"contaminants\" by filtering rows based on the categorical column.\nUse the categorical annotation rows to group the different experimental conditions.\nReduce the data matrix, selecting the number of valid values in each of the previously defined groups.\nSelect the statistical test that better suits the experimental conditions (i.e., t-test, multiple sample test ANOVA).\nDetermine a cut-off for significant hints with an FDR-based calculation. Typically, both 0.01 and 0.05 are accepted as thresholds for the adjusted p value.\nVisualize the results of differential analyses based on t-test statistics using a volcano plot representation.\nExport the final matrix in .txt format for further editing of the final result table.\n\t\tNOTE: The configuration folder contains a FASTA file with proteins such as keratins that are considered common contaminants in global proteomic experiments, which are flagged with a + in the output table. In the present study, having two sample conditions, a t-test is used for the statistical analysis.\n11. Results validation by western blot\nSample preparation",
    "Add the appropriate volume of 4x sample loading buffer to each aliquot of IN, FT, and EL.\nBoil the samples for 5 min at 95°C.\nFast-spin to recover evaporated sample from the top of the tubes.\nSDS-PAGE and gel transfer\n\t\nLoad samples on a 4%-12% denaturing polyacrylamide gel.\nRun the gel with MES SDS running buffer for 1.5 h at 120 V.\nTransfer the gel on a nitrocellulose membrane with a semi-dry transfer cassette, following the manufacturer instructions. We recommend a 10 min transfer at 15 V.\nImmunodetection\n\t\nBlock the membrane with 10% bovine serum albumin (BSA) for 1 h at room temperature while gently agitating.\nAdd the primary antibody prepared in 5% BSA in TBST, according to the manufacturer's instructions. Leave overnight at 4 °C or for 1 h at room temperature under gentle agitation.\nWash the membrane three times with TBST, each time for 5 min.\nAdd the secondary antibody prepared in TBST for 1 h at room temperature under agitation.\nWash the membrane three times with TBST, each time for 5 min.\nVisualize the results using a blot imager.\n\t\tNOTE: For detecting TDP-43, a known binder of our RNA, recombinant rabbit monoclonal antibody was used and left with the membrane overnight at 4 °C. As a secondary antibody, the anti-rabbit IgG horseradish peroxidase (HRP) was used, but a fluorescent secondary antibody would work as well. To visualize the antibodies on the membrane, the membrane was incubated with the Clarity Western ECL substrate for 1 min, before imaging with the ChemiDoc imaging system."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}