{
  "id": 6259,
  "origin_website": "Bio",
  "title": "6-hydroxydopamine (6-OHDA) Oxidative Stress Assay for Observing Dopaminergic Neuron Loss in <em>Caenorhabditis elegans</em>",
  "procedures": [
    "PreparationPrepare NGM plates and dry overnight at 37 °C. Store unseeded plates at 4 °C. Transfer the plates to room temperature before covering them with ca. 1 ml of OP50 E. coli. We prepare E. coli cultures by inoculating a single colony of OP50 in 500 ml LB medium and overnight incubation at 37 °C. Dry these seeded plates overnight and store them at 20 °C.Maintain C. elegans at standard conditions at 20 °C (Brenner, 1974) on 10 cm plastic Petri dishes containing nematode growth medium (NGM) agar and OP50 bacteria food. Note: For the 6-OHDA experiments, the N2-derived BY200 C. elegans strain can be used as a wild-type control, dat-1 as a 6-OHDA-resistant strain (Nass et al., 2002) and the mutant strains tsp-17 (Masoudi et al., 2014), glit-1 (Offenburger et al., 2018b) or ttr-33 (Offenburger et al., 2018a) as 6-OHDA-sensitive mutants.6-OHDA assay (Figure 1) imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180911/20180911184748_1265.jpgFigure 1. Overview of daily schedule of 6-OHDA assay. Please refer to text for details.One day before the 6-OHDA assay, pick gravid C. elegans (in adult stage and full of eggs) into a 96-well plate containing 70 μl M9 buffer per well. Only 30 μl of these 70 μl will be used for the 6-OHDA treatment, but as a substantial amount of the liquid will evaporate, it is necessary to prepare a larger volume. It is best practice to select healthy day 1 or day 2 adults for all conditions and replicates. Note: We recommend avoiding wells on the edge of the plate (rows A and H, and columns 1 and 12, respectively), as liquids in the outermost wells show increased evaporation. Transfer 10 adults into each well using a platinum wire, minimizing as little bacteria carryover as possible, as bacterial growth in the 96-well plates would compromise the synchronization of C.",
    "elegans L1 stage larvae. Note: If necessary, first transfer worms to an empty NGM plate for a few seconds and then move clean animals that have crawled away from the bacteria to the 96-well plate.  Prepare a technical duplicate for each experiment (i.e., two wells per condition) and perform at least two biological replicates on different days. We encourage randomizing the sequence of the analyzed strains (Figure 2). imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180911/20180911184804_2277.jpgFigure 2. Schematic representation of oxidative stress assay design. C. elegans are exposed in liquid in 96-well plates. The assay is run in technical duplicate (rows a + b per dose) including negative and positive controls. We encourage randomizing the position of control strains between the biological replicates (A + B). The biological replicates must be performed on separate days. The red color gradient indicates the increasing dose of the drug. We commonly used doses of 0.75 mM, 10 mM, 25 mM and 50 mM 6-OHDA. We recommend avoiding wells on the edge of the plate (row A and H and column 1 and 12), as liquids in the outermost wells show increased evaporation. We maintain the same pipetting sequence (indicated with a grey arrow) when adding compounds to ensure equal exposure of all tested strains.Incubate the 96-well plates in a temperature-controlled shaker at 500 rpm at 20 °C for 24-40 h. As food is absent in the wells, the eggs laid by these adults will hatch yet remain in the L1 larval stage, thus providing a developmentally synchronous culture. We use 30 h of incubation time for all our experiments and encourage standardizing this time interval as starvation renders the animals more resistant to 6-OHDA treatment (González-Hunt et al., 2014; Offenburger et al., 2018b).",
    "After 30 h, several hundred L1s will accumulate in the wells, of which only around 200 will be used in the assay and only 50-100 randomly selected animals will be scored after treatment. On the day of 6-OHDA treatment, first prepare the recovery plates. Label NGM agar-containing 6 cm plates in the back with the respective letter/number code from the 96-well plate and streak a line of OP50 E. coli on the NGM using a metal inoculation loop (Figure 3A). Notes:Other items can be used to streak the line of OP50. However, it is important not to damage the agar surface as otherwise animals might bury into the agar and will thus be lost for scoring.  To ensure the food does not run out when analyzing a large number of animals, it is possible to streak concentrated bacteria (OP50 E. coli centrifuged for 5 min at > 15,000 x g and resuspended in 1/10 volume of LB medium). Immediately before treating the animals, prepare a 200 mM ascorbic acid stock solution and a 5x stock solution of 6-OHDA in MilliQ water in screw cap tubes. 10 μl ascorbic acid stock solution and 10 μl 6-OHDA stock solution are required per well in a total volume of 50 μl. The 1:5 dilution results in a final concentration of 40 mM of ascorbic acid and 1x 6-OHDA (we commonly used, 0.75, 10, 25 or 50 mM 6-OHDA in our experiments). Ascorbic acid is an antioxidant, which prevents auto-oxidation of 6-OHDA. Note: When handling 6-OHDA, wear double gloves and a lab coat, use disposable filter tips and work under the fume hood. Use a disposable bench cover in the fume hood and put a wet paper towel in the area in which 6-OHDA is handled such that spilled 6-OHDA is oxidized immediately.",
    "Weigh ascorbic acid and 6-OHDA in the screw cap tubes using disposable spatulas and precision scales in the fume hood. To minimize handling time, weigh an approximate, slightly higher amount of compound and adapt the total volume accordingly. Separate 6-OHDA waste materials and dispose of properly. Try to work with the same batch of 6-OHDA as efficacies can vary between production lots. Vortex both the ascorbic acid solution and the 6-OHDA solution thoroughly for approximately 1 min until flakes are dissolved and the solutions appear homogenous. Note: The screw caps help to ensure that that the tubes stay closed during mixing. If working with several different concentrations or with small concentrations, prepare dilution series from the same stock solution. Aliquot 30 μl of worms in M9 buffer (corresponding to over 200 animals) into new wells using non-adhesive filter tips to minimize animal loss. Note: A precise multi-channel pipette can be used to transfer animals. Technical replicates are not intermixed at this stage. If animal density varies greatly between the wells, it can be adjusted by diluting the worms in M9 buffer to produce a total volume of 30 μl. Check with a stereomicroscope if a sufficiently high number of animals (at least 50 animals per well) have been transferred before adding the compounds. Then add 10 μl ascorbic acid solution and knock 96-well plate on the bench or centrifuge the plate shortly to make sure the contents are mixed properly before adding 6-OHDA. Note: No drops of ascorbic acid solution should remain on the wall of the well. Shake the plate shortly to ensure equal distribution of the ascorbic acid in the wells. To prevent auto-oxidation of 6-OHDA, the ascorbic acid must be added first. A precise multi-channel pipette can be used to dispense reagents.",
    "Add 10 μl 5x 6-OHDA solution and again ensure the solutions are properly mixed. Shake the multiwell plates for 1 h at 500 rpm at 20 °C.Stop the incubation by adding 150 μl M9 buffer. This buffer will oxidize the 6-OHDA and the solution will turn pink to dark red. The intensity of the color after addition of the buffer is a good indicator of the 6-OHDA concentration used. Pipet the total of 200 μl of worms into oxidized 6-OHDA solution on the NGM plates opposite the bacterial stripe, directly on top of the plate label (Figure 3B). Open the lids and let the plates dry under the fume hood. When the 6-OHDA solution has soaked into the NGM, remove the adult animals and eggs with a platinum wire such that only animals that were exposed at L1 stage remain on the plate (Figure 3C). Unless working with mutant strains that exhibit a developmental defect, there are usually no eggs or very few eggs present as all of progeny will have hatched in the 24-40 h incubation time before the assay. The L1 larvae remaining on the scoring plates will migrate towards the bacterial streak, which provides the food source (Figure 3D).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180911/20180911184819_8429.jpgFigure 3. Layout of recovery plates. A. 6 cm NGM Petri dish labeled in the back with the well number (e.g., 1A) and inoculated with a stripe of OP50 E. coli (orange streak). B. The mixture of adult and L1 stage animals and unhatched eggs in oxidized 6-OHDA (red liquid) is added to the plate on the side opposite to the bacterial streak. C. Adult animals and unhatched eggs are removed with a platinum wire. D. The remaining L1 stage larvae will migrate towards the bacterial streak, allowing for convenient scoring.",
    "Check the plates daily to make sure the bacterial food does not run out. In case there is little food left, add a drop (ca. 50-100 μl) of concentrated E. coli to prevent animals from starvation. Dopaminergic neurodegeneration can be observed 24, 48 or 72 h after exposure. The experimenter should be blinded to the genotype. C. elegans dopaminergic head neurons (Figure 4A) show differential sensitivity to 6-OHDA, with CEP neurons being more sensitive than ADE neurons (Nass et al., 2002; Tucci et al., 2011). PDE dopaminergic neurons in the midbody only appear after the L1 larval stage and are not scored in our experiments. Score at least 50 animals per replicate plate, resulting in a total number of at least 100 scored animals for each condition. Animals were selected randomly for scoring. We use four categories for scoring: (1) CEP + ADE neurons intact, (2) CEP neurons partially compromised and ADE neurons intact, (3) only ADE neurons remaining, and (4) no CEP or ADE neurons left (legend in Figure 4B, Table 1). This assay can be used for genetic screens to look for hypersensitive mutants (Figure 4B), to analyze epistasis between different mutations at differing concentrations of 6-OHDA (Figure 4C), or to analyze animals upon exposure to other soluble compounds such as paraquat (Figure 4D).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180911/20180911184842_5562.jpgFigure 4. Representative readouts from oxidative stress assay. Panels A and B are adapted from Offenburger et al. (2018a) and panel C and D are adapted from Offenburger et al. (2018b). A. Fluorescently labeled C. elegans dopaminergic head neurons in the wild-type strain carrying the vtIs1 transgene (left) and schematic labeling (right) without (top) and with exposure to 50 mM 6-OHDA (‘+6-OHDA’, bottom) 72 h after treatment. ADE neurons are located posterior to CEP neurons. B.",
    "Remaining dopaminergic head neurons 24, 48 and 72 h after exposure to 10 mM 6-OHDA and 72 h after control treatment with ascorbic acid only (‘72h Ctr’) in BY200 wild-type animals and in the isolated hypersensitive mutant ttr-33(gt1983). Error bars = SEM of 3 biological replicates, each with 60-120 animals per strain. Total number of animals per condition n = 30 for the ‘72h Ctr’ and n = 220-340 for all the other conditions (**** P < 0.0001; G-Test comparing wild-type and mutant data of the same time point). C. Dopaminergic head neurons in wild-type and glit-1 and tsp-17 single and double mutants 24, 48 and 72 h after treatment with 0.75 mM 6-OHDA and 72 h after control treatment with ascorbic acid only (‘72h Ctr’). Error bars = SEM of 2-3 biological replicates, each with 60-115 animals per strain. Total number of animals per condition n = 60 for the ‘72h Ctr’ condition and n = 180-350 for all the other conditions (n.s. P > 0.05; G-Test). D. Percentage of animals that developed to L3 stage 24 h after 1 h incubation with 50 mM paraquat. Error bars = SEM of 3 biological replicates, each with 85-380 animals per strain and concentration. Total number of animals per condition n = 340-830 (n.s. P > 0.05; two-tailed t-test comparing the tsp-17(tm4995) and glit-1(gt1981) single mutants to the tsp-17(tm4995);glit-1(gt1981) double mutant at 2 mM and 3 mM paraquat).Table 1. Example scoring for strains a and b. Number of animals in each category (sum of technical duplicate).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180911/20180911184913_6287.jpg"
  ],
  "subjectAreas": [
    "Cell Biology",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}