{
  "id": 2662,
  "origin_website": "Cell",
  "title": "Protocol to purify recombinant inflammatory caspases and assess their catalytic activity in vitro",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nOverexpression of caspase-4 in E. coli\nTiming: 4 days\nAn inherent challenge when expressing inflammatory caspases is that their proteolytic activity can lead to severe growth defects and even cell death of the producing cells, including bacteria. In addition, genes of mammalian origin might contain codons that are rarely used in E. coli and might therefore hamper overexpression. We therefore recommend using bacterial strains encoding T7 lysozyme (reduces basal expression of T7 polymerase and therefore leaky expression of the gene of interest) and tRNA genes for rare codons, such as Rosetta (DE3) pLysS. Rare tRNA genes and T7 lysozyme are encoded on a plasmid conferring chloramphenicol resistance.\nAlternatives: If sequences are codon-optimized for bacterial expression it might not be necessary to use an expression strain encoding rare tRNAs.\nAlternatives: Regular LB media can be used for the expression cultures, but we have achieved better yields using the richer 2×YT media.\nTransform E. coli with the pET28a plasmid encoding caspase-4 (strain: Rosetta (DE3) pLysS).\nRemove a frozen aliquot of chemically competent cells from −80°C and thaw on ice.\nAdd 1 μL of plasmid (concentration between 10 and 100 ng/μL) to the competent cells and gently flick the tube to mix.\nIncubate on ice for 30 min.\nHeat-shock bacteria for 30 s at 42°C using a temperature-controlled water bath or heat block.\nIncubate on ice for 5 min.\nAdd 1 mL of SOC media to cells.\nIncubate for 1 h at 37°C while shaking at 250 rpm in a shaking incubator.\nPlate 100 μL of bacteria on LB agar plates containing 25 μg/mL chloramphenicol and 25 μg/mL kanamycin using sterile plating beads.\nIncubate for 18–24 h at 37°C.\nPick a single colony off the plate using a sterile pipette tip.",
    "Inoculate 10 mL of 2×YT media containing 25 μg/mL chloramphenicol and 25 μg/mL kanamycin in a sterile 50 mL conical tube.\nLeave lid of the tube loosely attached to allow for sufficient aeration of the culture.\nGrow pre-culture for 18–24 h at 30°C while shaking at 250 rpm.\nInoculate the expression culture by adding 5 mL of the pre-culture to 500 mL of 2×YT media in a 2 L baffled flask.\nNote: For caspase-4, an expression culture of 500 mL usually yields ample amounts of protein. For other inflammatory caspases or caspase mutants, it might be advised to scale up culture size in order to obtain sufficient yields. In such a case, make sure to also increase pre-culture size to allow for inoculation at a 1:100 ratio (v/v).\nGrow culture at 37°C while shaking at 250 rpm while regularly checking optical density of the culture at 600 nm (OD600).\nOnce the culture reaches an OD600 of 0.6–0.8 (this usually takes 3–5 h), remove flask from shaking incubator and place on ice for 15 min.\nWhile culture cools, turn down temperature of shaking incubator to 18°C.\nAdd IPTG to a final concentration of 0.25 mM (250 μL of 500 mM stock for 500 mL culture) to induce expression of the caspase-4 transgene.\nPlace culture flask back in the incubator and allow expression to proceed for 18–24 h at 18°C while shaking at 250 rpm.\nHarvest bacteria.\nTransfer cultures into large centrifuge buckets and centrifuge for 15 min at 5,000 × g.\nDiscard supernatant and resuspend cell pellets in 50 mL 1× PBS and collect in a single 50 mL tube.\nSpin down again (10 min at 5,000 × g). Discard supernatants.\nFreeze down pellets in the bottom of the tube at −20°C.",
    "Pause point: Bacterial pellets can be stored at −20°C for several weeks to months before proceeding with purification.\nPurification of recombinant caspase-4\nTiming: 1 day\nWe employ a straightforward purification protocol of His-tagged caspases by immobilized metal affinity chromatography (IMAC). Protein is eluted in a stepwise imidazole gradient, which separates the protein of interest from other contaminants that non-specifically bind to the resin. This strategy eliminates the necessity for further purification steps requiring specialized, expensive equipment such as an FPLC system. Therefore, this protocol can be performed in any standard molecular biology laboratory. The absence of time- and labor-intensive steps such as size-exclusion chromatography also allows for the purification of multiple proteins side-by-side, which makes this protocol amenable to screening of multiple caspase variants or mutants.\nResuspend bacterial pellet in 50 mL protein lysis buffer (∼1 mL of lysis buffer per 10 mL of expression culture).\nNote: Most purification protocols for recombinant protein recommend adding protease inhibitors during lysis. Since caspases themselves are proteases, we advise against the use of protease inhibitors (particularly commercial protease inhibitor cocktails of proprietary composition). It is possible to add single inhibitors (e.g., phenylmethylsulfonyl fluoride or benzamidine hydrochloride for serine proteases), but we have not found this to be necessary.\nCritical: From this step forward, all steps should be performed on ice and with chilled reagents.\nLyse cells by sonication (100% intensity, 2 s pulses on/off, 5 min) on ice.\nSpin down intact cells and debris by ultracentrifugation (20,000 × g, 45 min, 4°C).\nCritical: Make sure to use 50 mL tubes suitable for high-speed centrifugation to prevent damage to the tubes and centrifuge and sample loss.\nFilter clarified lysates through a 0.22 μm syringe filter and collect in a fresh 50 mL tube.",
    "Transfer 0.5 mL of Ni-NTA agarose beads (1 mL of slurry) into a 15 mL Poly-prep gravity flow column.\nEquilibrate beads with 5 mL of protein lysis buffer.\nCritical: Carefully add buffers/protein solutions to the column to not disturb the bead bed.\nStepwise add the clarified lysate to the column until entire volume has passed through the beads. The His-tagged target protein will bind to the Ni-NTA agarose beads; discard the flowthrough.\nWash beads with 10 mL of protein wash buffer.\nLabel ten 15 mL tubes for collection of individual elution fraction and place on ice.\nElute the bound proteins from the beads.\nSequentially add 1 mL of the protein elution buffers with increasing imidazole concentrations (40–250 mM).\nCollect eluates (each eluate fraction should be 1 mL) in individual, pre-labeled tubes and store on ice or in the fridge.\nNote: This stepwise gradient elution protocol ensures the efficient separation of common E. coli-derived protein contaminants from the His-tagged target protein, which is eluted at markedly higher imidazole concentrations.\nNote: The Ni-NTA resin may be regenerated and reused multiple times. A stepwise protocol for how to wash, strip and recharge the beads with fresh Ni2+ ions is available in Kielkopf et al., 2020.6[href=https://www.wicell.org#bib6] We recommend collecting and storing the used resin in 20% EtOH to prevent contaminations and regenerating them in batch.\nRun SDS-PAGE gel to identify fractions containing protein of interest. Due to the small size of caspase subunits, we use homemade gels (Biorad Mini-Protean system) with a high percentage of acrylamide (15%).\nTake 40 μL of each fraction and add 10 μL of 5× SDS loading buffer. Heat samples for 10 min at 65°C.\nAssemble Mini-Protean gel running chamber.\nLoad 5 μL of PageRuler prestained protein ladder (Thermo Fisher) into the first well of the gel.",
    "Load 20 μL of each sample into residual wells of the gel.\nRun gel at a constant voltage of 180 V for 45 min to 1 h. The lowest band of the prestained protein ladder should have reached the bottom third of the gel but not run out of the gel to ensure that the small subunit of the caspase (∼10 kDa in size) is still detectable.\nStain gel using Coomassie to visualize proteins.\nRemove gel from chamber and place in a small plastic tray containing 25 mL of InstantBlue Coomassie protein stain (Expedeon Protein Solutions).\nIncubate for at least 15 min at 20°C–25°C while shaking gently.\nNote: Inflammatory caspases autocatalytically cleave themselves during overexpression/purification into the large and small catalytic subunit, which stay associated with each other in solution via non-covalent interactions. Therefore, it is expected to see two bands at around 20 kDa and 10 kDa in the SDS-PAGE gel.\nPool fractions containing the pure protein of interest (Figure 2[href=https://www.wicell.org#fig2]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2155-Fig2.jpg\nFigure 2. Purification of recombinant caspase-4 and pro-IL-1β\n(A and B) SDS-PAGE analysis of fractions from stepwise gradient elution of (A) caspase-4 and (B) pro-IL-1β. Fractions containing pure protein of interest are indicated in red.\nConcentrate pooled eluates using Amicon Ultra centrifugal filter unit with a 10 kDa size cutoff (5,000 × g, several 5–10 min spins, 4°C) to a volume smaller than 2.5 mL.\nCritical: Even though the assembled caspase complex is markedly larger (>30 kDa), using a filter unit with a 10 kDa size cutoff minimizes sample loss. Additionally, gentle mixing of the sample in the filter unit with a pipette between spins maximizes yield and prevents protein aggregation.\nPerform buffer exchange into protein storage buffer using PD-10 desalting columns.\nPlace PD-10 column in holder for gravity flow protocol provided by manufacturer.",
    "Equilibrate columns five times with 5 mL of protein storage buffer. Discard flowthrough.\nAdd protein solution to column. Discard flowthrough.\nNote: If volume after ultrafiltration is below 2.5 mL, add appropriate amount of protein storage buffer to column, so total volume added in this step is 2.5 mL.\nElute protein by adding 3.5 mL of protein storage buffer to the column. Collect flowthrough in this step.\nDetermine protein concentration in the eluate by measuring absorbance at 280 nm using a Nanodrop spectrophotometer.\nNote: Raw absorbance values are converted into protein concentrations by correcting for the protein-specific extinction coefficient, which depends on the amino acid composition of the protein (Edelhoch relationship). This coefficient can be obtained using the Expasy ProtParam online tool (https://web.expasy.org/protparam/[href=https://web.expasy.org/protparam/]). For caspase-4, the raw absorbance value is to be divided by 0.796. For the in vitro cleavage assay below it is useful to also convert into a molar concentration by dividing by the molecular weight.\nConcentrate protein to the desired concentration using Amicon Ultra centrifugal filter unit with a 10 kDa size cutoff as described above (we usually aim for a molar concentration of at least 50–100 μM).\nAliquot concentrated protein into PCR strip tubes, snap-freeze in liquid nitrogen and store at −80°C.\nPause point: Purified recombinant caspases are stable at −80°C for multiple months.\nOverexpression and purification of substrate protein\nTiming: 1+ days",
    "The in vitro cleavage assay described below requires purified recombinant protein as a substrate; in this example protocol, full-length murine pro-IL-1β. Pro-IL-1β can be produced and purified using the same procedure described above for caspase-4 (Figure 2[href=https://www.wicell.org#fig2]B). In the case of pro-IL-1β, purification should result in a single protein of ∼35 kDa (Figure 2[href=https://www.wicell.org#fig2]B). For protein concentration, we recommend the use of Amicon Ultra centrifugal filter unit with a 10 kDa size cutoff. As described for caspase-4, we discourage the use of protease inhibitors to rule out any interference with downstream assays. If desired, expression and purification of the caspase and the substrate can also be performed simultaneously.\nNote: The expression and purification strategy described above has been successfully utilized for a range of substrate proteins including pro-IL-1β, pro-IL-18 or GSDMD. If substrates of interest include a biochemically uncharacterized protein, we recommend using our streamlined protocol described here as a framework, but additional quality control measures might be advised when adapting the protocol to other targets. These include (but are not limited to): Small scale expression cultures to determine if the target protein is soluble or found in inclusion bodies; optimization of temperature and duration of expression culture to increase yields; sampling of flow-through and wash fractions after every step of the purification and checking for presence of protein by SDS-PAGE and Coomassie staining or western blot; performing size-exclusion chromatography of purified product to assess oligomeric state/aggregation.\nPerform in vitro cleavage assay\nTiming: 1–2 h\nHere we describe how to perform an in vitro cleavage assay to quantitatively assess the cleavage of a specific protein substrate (pro-IL-1β) by recombinant caspase-4.\nSwitch on thermocycler instrument and pre-warm to 37°C.\nAdd 10 mM of DTT to an appropriate amount of caspase assay buffer (usually 1–2 mL of buffer per assay).",
    "Critical: DTT should be added fresh to an aliquot of caspase assay buffer right before each assay. Addition of the reducing agent DTT maintains proteolytic activity of the caspase over time by keeping the cysteine residue in the active site in a reduced state.\nRemove one aliquot of caspase-4 and pro-IL-1β from the −80°C freezer and thaw on ice.\nCritical: Avoid freeze/thawing of the recombinant caspase as it will impair its activity. Use a fresh aliquot each time to guarantee consistent results.\nCritical: Keep protein solutions and buffers on ice to ensure maintenance of protein activity during assay preparation.\nPre-set a PCR cycler to a constant temperature of 37°C.\nDilute substrate to 100 nM in caspase assay buffer. Prepare at least ∼250 μL of diluted substrate for each assay.\nIn the first tube of an appropriately labeled 12-tube PCR strip, dilute caspase-4 to 45 μM in caspase assay buffer in a total volume of 60 μL.\nNote: Diluted caspase-4 and pro-IL-1β will be mixed at a 1:1 (v/v) ratio, resulting in final concentrations of up to 22.5 μM and 50 nM, respectively. We have found that this range of concentrations works well for this specific caspase/substrate couple. If this assay is adapted to other caspases and/or substrates, caspase concentrations in a higher or lower range might be required for best results.\nAdd 30 μL of caspase assay buffer to residual 11 tubes in the same PCR strip.\nPerform ten 2-fold serial dilutions in the PCR strip (mix 30 μL of buffer with 30 μL of protein solution from previous tube). The last tube should contain buffer only.\nNote: We recommend using a fresh pipette tip for each step of the serial dilution.\nAdd 20 μL of diluted pro-IL-1β (100 nM) to each tube of a second PCR strip.",
    "Using a multichannel pipette transfer 20 μL of each caspase-4 dilution to the tubes containing pro-IL-1β. Mix gently by pipetting up and down.\nCritical: Adding caspase-4 (and later the SDS loading dye; see below) to all tubes simultaneously with a multichannel allows for synchronized starting and stopping of the reaction and therefore most consistent results.\nImmediately after mixing the caspase and the substrate, place PCR strip into pre-warmed thermocycler and incubate at 37°C for exactly 30 min.\nCritical: Set a timer to ensure proceeding of the reaction for exactly 30 min. If several assays are performed side-by-side, space them out by a regular time interval (e.g., 1 min) and start/stop them sequentially.\nWhile reactions are incubating, prepare another PCR strip by adding an appropriate amount of 5× SDS loading buffer into each tube.\nNote: You can reuse one PCR strip filled with 5× SDS loading buffer for all your assays. When finished, store PCR strip with residual buffer at −20°C. When performing more assays another time, simply place PCR strip in pre-warmed thermocycler for a few minutes to thaw.\nTo stop the reactions, add 15 μL of 5× SDS loading dye into each tube with a multichannel pipette.\nSet thermocycler to 65°C for 10 min to denature proteins.\nPause point: Prepared western blot samples can be stored at −20°C for several weeks to months.\nAnalyze substrate cleavage by western blot\nTiming: 2 days",
    "Alternatives: We use western blot analysis to analyze the processing of the substrate by the protease. Alternatively, for example if no specific antibody is available, the protein can also be detected by Coomassie or silver staining (e.g., see Bibo-Verdugo et al., 2020 or Ramirez et al., 20187[href=https://www.wicell.org#bib7],8[href=https://www.wicell.org#bib8]). Detection by western blot, although more laborious, has the advantage that we can use very low amounts of substrate (nanomolar range) and yet achieve good signal to noise images. Using the lowest possible substrate concentration is not only beneficial due to lower sample consumption, but also for accurate quantification. Calculation of Km/kcat from the EC50 (see below) are only accurate if we can assume pseudo-first order conditions, which means that the substrate concentration is negligible compared to Km. Additionally, Coomassie staining visualizes not only the substrate, but also the protease, which complicates data interpretation.\nSeparate proteins by SDS-PAGE. We routinely use homemade gels with 12% or 15% acrylamide.\nCritical: When processing of other substrates is investigated, acrylamide concentration of the gels might have to be optimized based on the size of the cleavage products.\nAssemble Mini-Protean gel running chamber.\nLoad 5 μL of PageRuler prestained protein ladder (Thermo Fisher) into the first well of the gel.\nLoad 5 μL of each sample into residual wells of the gel.\nRun gel at a constant voltage of 130 V for ∼1.5 h.\nTransfer proteins onto PVDF membrane. We routinely use a wet transfer protocol in a Mini Trans-Blot cell (Biorad).\nTake gel out of electrophoresis chamber.\nPrepare PVDF membrane by cutting it to the appropriate size and wet with 100% methanol for 30 s.\nAssemble transfer sandwich in a tray filled with transfer buffer in the following order:\nFoam pad.\n2 layers of filter paper.\nSDS-PAGE gel.\nMethanol-soaked PVDF membrane.\n2 layers of filter paper.",
    "Foam pad.\nRemove air bubbles that may be present between the layers with a roller.\nPlace sandwich in wet transfer apparatus.\nFill wet transfer chamber with transfer buffer.\nRun transfer for 1 h at a constant voltage of 110 V.\nPlace the membrane in a small plastic tray and block the membrane by incubating in PBST + 5% milk for 1 h at 20°C–25°C while gently shaking.\nRinse the membrane 3 times with PBST.\nIncubate membrane in 10 mL of primary antibody against pro-IL-1β diluted 1:1000 in PBST + 5% BSA for 18–24 h at 4°C while gently shaking.\nRemove primary antibody solution and wash membrane 3–5 times with PBST. Incubate for 5 min per wash while gently shaking at 20°C–25°C.\nNote: Diluted primary antibody can be collected and reused multiple times with minimal loss of sensitivity. Low concentration (0.02%) of sodium azide can be added to avoid contamination of the stock solution during storage at 4°C.\nIncubate membrane in 15 mL of HRP-conjugated secondary antibody (here we use goat anti-rabbit IgG (H+L)) diluted 1:5000 in PBST + 5% milk for 1 h at 20°C–25°C while gently shaking.\nCritical: Make sure the secondary antibody recognizes the host species of the primary antibody.\nRemove secondary antibody solution and wash membrane 3–5 times with PBST. Incubate for 5 min per wash while gently shaking at 20°C–25°C.\nNote: Unlike the primary antibody solution, we do not routinely reuse the secondary antibody solution to ensure maximum activity of the conjugated HRP enzyme.\nExpose membrane and acquire image.\nPrepare HRP substrate solution by mixing equal volumes of the two components provided.\nAdd HRP substrate solution to the membrane (around 1 mL needed for a membrane the size of a regular mini gel; 8.5 cm x 6.5 cm).\nIncubate at 20°C–25°C for 1–5 min.",
    "Critical: Make sure all parts of the membrane are equally covered with substrate solution.\nAcquire image using a Chemidoc MP imaging system (BioRad).\nCritical: Exposure time and settings may require optimization to achieve best results. We recommend using the ‘rapid auto exposure’ mode on the ChemiDoc MP system.\nQuantification of western blot images and calculation of kinetic parameters\nTiming: 30 min\nHere we describe how to perform a densitometric analysis of the western blot images obtained from the in vitro cleavage assay and how to estimate the EC50 and catalytic efficiency kcat/Km of the reaction. As briefly mentioned above, these calculations are only reliable under pseudo-first order conditions. For details on how the equation is derived, see publications by Boucher et al., 2014 or Stennicke and Salvesen, 2000.2[href=https://www.wicell.org#bib2],4[href=https://www.wicell.org#bib4]\nAlternatives: This protocol describes how to quantify the obtained western blot images using ImageJ image processing software on a computer with a Windows operating system. Commands may vary slightly for Mac users.\nExport images from internal hard drive of ChemiDoc system in a .tif format.\nOpen ImageJ image processing software.\nUpload image in ImageJ by dragging and dropping them into ImageJ window.\nSelect rectangle tool and create a rectangular region of interest (ROI) around band of interest (uncleaved substrate) in the first lane (no caspase control lane).\nCritical: Catalytic activity of the caspase can be measured by assessing disappearance of the band for the full-length substrate or by assessing the appearance of the cleavage product band. We generally recommend quantifying disappearance of the full-length band.\nCritical: Make sure that ROI is adequately sized to fit all the bands of interest. Width of bands might vary slightly from lane to lane.\nSave first ROI position using command ‘1’.\nMove rectangular ROI to the next lane and save second ROI position using command ‘2’.",
    "Critical: Only use sideways arrow keys to move rectangle, as only ROIs with identical y-coordinates can be saved. Also do not change size of rectangle, as all ROIs must have the same size.\nRepeat for all lanes until all bands of interest are surrounded by rectangular ROIs.\nOnce the last ROI is in place, press ‘3’ to generate mean intensity plots for each ROI in a new window (intensity for each ROI plotted left to right).\nFor each peak, generate a new ROI covering its entire area using the polygon or freehand tool. Measure area of each individual ROI by pressing ‘M’.\nCritical: If image has considerable background, only include the area of the peak above the background level when drawing the ROI for this measurement.\nPlot area values in dependency of the log of the respective caspase concentration in GraphPad prism.\nPerform a nonlinear regression using the function ‘log(agonist) vs. response (three parameters)’ to obtain EC50 values. This EC50 corresponds to the caspase concentration at which 50% of the substrate has been consumed.\nCalculate catalytic efficiency of the reaction by using the following equation, where kcat/Km is the catalytic efficiency, EC50 is the value derived from the nonlinear regression and t is the duration of the reaction (in this case 30 min):\n    k  c a t    K m   =   ln  ( 2 )    ( E  C 50  × t )"
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Cell Biology",
    "Immunology",
    "Protein Expression And Purification"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}