{
  "id": 13572,
  "origin_website": "Jove",
  "title": "In Vitro Differentiation of Human Pluripotent Stem Cells into Trophoblastic Cells",
  "procedures": [
    "NOTE: For the differentiation of either hESCs or hiPSCs into trophoblast progenitors, hPSCs grown on mouse embryonic fibroblasts (MEFs) are transitioned to feeder-free conditions for two passages before initiating differentiation with BMP4/A/P. This process eliminates the MEF contamination of differentiated cells. Here, we present a protocol for hESC differentiation, and the same protocol can be applied to hiPSCs.\n1. Culture and Recovery of hESCs on Irradiated Mouse Embryonic Fibroblasts (MEFs) (Preparations)\nGamma-irradiation of MEFs\nMake 500 ml of medium for culturing the MEFs: DMEM with 10% FBS, 2 mM L-glutamine, 1x penicillin/streptomycin (Pen/Strep), and 0.1 mM non-essential amino acids (NEAA).\nThaw one vial of primary MEFs and use MEF medium for culturing the cells. Expand the primary MEFs to 30 plates using MEF culture medium.\n\t\tNOTE: Oxygen concentrations are not critical for this step, so either physiological (4%) or ambient (20%) conditions within the incubator can be used.\nHarvest the MEFS. Use 0.25% trypsin to remove the MEFs from the plates and transfer the cells to a conical tube. Place the MEFs into an irradiation instrument and expose the cells to 3,500 grays.\n\t\tNOTE: The amount of time will depend on the activity of the source inside the irradiator unit.\nResuspend the irradiated MEFs with MEF culture medium and count the number of cells using a hemocytometer.\nPellet the MEFs using a centrifuge and add 50% MEF culture medium and 50% cell freezing medium (80% FBS and 20% MEF culture medium). Aliquot 1 x 106 cells per vial.\nPlace the irradiated MEF vials in a -80 °C freezer overnight, and then transfer them to liquid nitrogen for long-term storage.\nThawing frozen MEFs and hESCs for culture",
    "Make 500 ml of hESC medium: DMEM/F-12 with 20% Serum Replacement, 0.1 mM NEAA, 2 mM L-Glutamine, 10 ng/ml bFGF, 0.1 mM ß-mercaptoethanol, and 1x Pen/Strep.\nThaw one vial of MEFs one day before thawing the hESCs. Coat a 6-well plate with 0.1% gelatin, using 1 ml for each well. Incubate for at least 20 min at room temperature, and then remove the gelatin.\nRemove a vial of MEFs from storage in liquid nitrogen and immerse the vial in a 37 °C water bath. Watch the vial intermittently until only small ice crystals remain. Quickly transfer the contents of the vial to 9 ml of MEF medium inside a 15 ml conical tube.\nPellet the cells by centrifuging at 200 x g for 5 min. Aspirate the supernatant and resuspend the cell pellet in MEF medium. Aliquot the MEFs evenly onto a 6-well plate. Put the plate into a 37 °C low-oxygen (4%) incubator overnight.\nRoutine culture of hESCs on MEFs\nRemove an hESC vial from liquid nitrogen and quickly thaw the vial using a 37 °C water bath. Gently pipette the hESCs into a 15 ml conical tube containing 9 ml of hESC medium and spin down at 200 x g for 5 min. Remove the medium and resuspend the cells with 1 ml of hESC medium.\nAspirate the MEF medium from the plate prepared in step 1.2.4 and add 1 ml of hESC medium. Add Rock inhibitor Y-27632 (10 µM) to the hESC medium. Transfer the hESCs onto MEFs.\nPlace the cells into a 37 °C low-oxygen (4%) incubator overnight. Replace the hESC medium daily. Scrape off differentiated cells with a Pasteur pipette, visualized under an upright microscope at 4X.",
    "Passage the hESCs every 4-6 days, depending on the cell confluency and the size of the hESC colonies. Prepare a plate of MEFs the day before passaging. When the cells are ready to passage, remove the hESC medium and wash the well with 1 ml of PBS.\nAdd 1 mg/ml collagenase (pre-warmed to 37 °C), incubate at 37 °C for 5 min, and remove the collagenase. Wash the cells with PBS, add 1 ml of hESC medium per well, and manually scrape the cells into small clumps using the tip of a 5 ml pipette. Transfer the suspended cell clumps into a new MEF-coated well(s).\n2. Transition of hESCs from MEFs to Feeder-free Conditions on Extracellular Matrix-coated Plates\nPrepare MEF Conditioned Medium (CM)\nPlate the irradiated MEFs in a T75 flask at 90-100% confluency; it is important that the MEFs are densely plated. Observe the cells using a microscope to determine whether they have attached to the bottom of the flask (MEFs attach approximately 6 hr after plating or the next day).\n\t\tNOTE: Unattached cells float in the medium when observed using a microscope. The next day, remove MEF medium and add 25 ml of hESC medium lacking B-FGF.\nCollect the conditioned medium after 24 hr of incubation. Replace with fresh medium daily for a maximum of 12 days.\nFilter the collected CM using a 0.22 µM filter. Prior to use, add fresh B-FGF to the CM.\n\t\tNOTE: CM can be frozen at -80 °C and stored for up to 1 year. Alternatively, store the CM at 4 °C for 2 weeks.\nTransition the hESCs from culture on the MEFs to feeder-free extracellular matrix-coated plates.\nPreparation of extracellular matrix for coating tissue culture plates",
    "Thaw an aliquot of extracellular matrix on ice (about 3-4 hr). Using ice-cold tips, one cold, 50 ml conical tube, and DMEM/F12 medium, transfer 2 mg of extracellular matrix into 24 ml of ice-cold DMEM/F-12 (the dilution depends on the extracellular matrix concentration from the supplier).\nImmediately transfer the 50 ml conical tube to ice and store it at 4 °C. For coating tissue culture plates, add the appropriate amount of diluted extracellular matrix to the well (e.g., 1 ml per well in a 6-well plate). Swirl to coat the plate and incubate at room temperature for at least 1 hr.\nPassage hESCs from the MEFs (as in step 1.3) using CM containing B-FGF (10 ng/ml).\n\t\t\nAspirate to remove the extracellular matrix from the new plate and add CM containing B-FGF. Transfer the scraped cellular clumps from the MEF plate using a pipette and aliquot it into the extracellular matrix-coated plate. Incubate in the 37 °C low-oxygen incubator overnight.\nReplace the CM with B-FGF medium daily; the amount of medium will depend on the size of the culture flask. Use 2 ml of medium for one 6-well well. Scrape off differentiated cells with a Pasteur pipette.\nPassage hESCs every 6-7 days, when colonies are bright when viewed under the microscope.\n\t\t\tNOTE: hESC colonies grown on extracellular matrix-coated plates grow larger than MEF-cultured cells.\nWhen the feeder-free cells are ready to passage, remove the medium, wash by adding 1 ml of PBS using a pipette, aspirate to remove the PBS, add 0.5 mg/ml dispase (pre-warmed to 37 °C) with a pipette, and incubate at 37 °C for 5 min.",
    "Wash the cells with PBS by adding 2 ml of PBS per well and aspirating afterwards. Add 1 ml of CM per well and manually scrape the cells into small clumps using the tip of a 5 ml pipette.\nPlate the suspended cell clumps into new extracellular matrix-coated plates; the cells should adhere after 24 hr.\n3. Differentiation of hESCs Using BMP4/A/P\nPrepare the differentiation medium. Use CM (lacking B-FGF) and add (fresh) BMP4 (50 ng/ml), A83-01 (1 µM), and PD173074 (0.1 µM). Add these inhibitors to the CM prior to use.\nUse feeder-free hESCs growing on extracellular matrix-coated plates for 1 passage, cultured inside an incubator set at 4% oxygen. After the first passage onto extracellular matrix-coated plates, let the cells attach for 24 hr. The next day, initiate differentiation. Remove the CM (containing B-FGF) and replace it with CM containing BMP4/A/P (2 ml per well in a 6-well plate). Continue culturing the cells using 4% oxygen levels.\nReplace the CM containing BMP4/A/P (2 ml/well for a 6-well plate) every 2 days. Aspirate to remove the old medium and add new CM using a pipette. On the second day after adding BMP4 and removing B-FGF (considered differentiation day 2), the cell morphology will change, appearing larger when observed using a microscope.\n\tNOTE: Undifferentiated cells, which exhibit bright round edges, will not be present.\nCollect cells at desired time-points. Differentiated cells will stop dividing after around 2 weeks. Transfect cells during this time period (see the next section).\n4. Transfection of Trophoblastic Cells with siRNAs or Plasmid DNA\nPrepare trophoblastic cells for transfection\nCulture hESCs for two passages on extracellular matrix after transferring them from the MEFs (see step 2.2). Use hESC medium containing B-FGF.",
    "Split the hESCs onto a new extracellular matrix plate one day before differentiation. High cellular confluency is important, so split the cells 1:1 onto a new plate/well, which will ensure at least 50% confluency the next day. Incubate the cells overnight in the low-oxygen incubator.\n\t\tNOTE: hESCs do not need to be counted during this step.\nThe next day, replace the medium with the differentiation medium (CM containing BMP4/A/P and lacking B-FGF, using 2 ml/well for a 6-well plate). Remove the old medium by aspiration and transfer the new medium (2 ml) using a pipette. Place the cells in a low-oxygen incubator (4% oxygen) overnight.\nTransfections using siRNAs for gene disruption or using plasmid DNA\nDifferentiate the cells until the desired time-point (between days 1 and 14). The day before transfection, trypsinize the cells using 0.05% trypsin for 5 min. Plate them to the desired confluency (depending on the transfection reagent protocol) onto a gelatin-coated plate (add 0.1% gelatin to a tissue culture plate for 20 min and aspirate to remove). Add CM containing BMP4/A/P (lacking B-FGF) and incubate overnight.\nThe next day, add fresh differentiation medium to the cells. Transfect siRNAs using an siRNA transfection reagent. For plasmid DNA, use an appropriate lipofectamine reagent.\nFollow the product protocol as described for each transfection reagent. Transfer the siRNA-lipofectamine complexes to each well/plate of cells, mix gently, and culture the cells overnight in a low-oxygen incubator.\n\t\tNOTE: Some transfection reagents are inhibited by antibiotics, which require CM lacking Pen/Strep.\nThe next day, replace with fresh differentiation media.",
    "Harvest the cells at the desired time-points (e.g., 24 hr, 48 hr, and 72 hr) to check the gene disruption efficiency using quantitative RT-PCR. For harvesting cells, use 0.05% trypsin, adding 1 ml per well and incubating for 5 min at 37 °C. Add 5 ml of MEF medium per well to neutralize the trypsin. Spin down the cells at 200 x g for 5 min and use the cell pellet for RNA isolation.\n5. Pathogen Infection of Trophoblastic Cells: Sendai Viral Infection\nPrepare hESCs for differentiation\nCulture hESCs for two passages on extracellular matrix after the transfer from the MEFs (see step 2.2). Use hESC medium containing B-FGF.\nSplit the hESCs onto a new extracellular matrix plate one day before differentiation. High cellular confluency is important, so split cells 1:1 onto a new plate/well, which will ensure at least 50% confluency the next day. Incubate the cells overnight in a low-oxygen incubator (4% oxygen).\n\t\tNOTE: hESCs do not need to be counted during this step.\nThe next day, replace the medium with the differentiation medium (CM containing BMP4/A/P and lacking B-FGF) and culture overnight in a low-oxygen incubator (4% oxygen).\nSendai viral infection of trophoblastic cells\nOne day before the desired differentiation day, trypsinize the differentiating cells (to single cells) using 0.05% trypsin for 5 min and transfer them to a gelatin-coated plate. Add differentiation medium and incubate overnight in a low-oxygen incubator.\nThe next day, add medium for infection (this will vary depending on the virus). Use CM lacking Pen/Strep containing BMP4/A/P, using 0.5 ml for one well of a 6-well plate. Add Sendai virus for MOI = 1. Incubate for 8 hr in a low-oxygen incubator.",
    "If additional time-points are necessary, remove the virus-containing medium after 4 hr and replace it with BMP4/A/P CM. Collect cells for RNA isolation using a cell scraper.\nDetermine the efficiency of viral infection by performing qRT-PCR for genes involved in the viral response18.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}