{
  "id": 19621,
  "origin_website": "Jove",
  "title": "Serial Block-Face Scanning Electron Microscopy (SBEM) for the Study of Dendritic Spines",
  "procedures": [
    "The research was performed in compliance with Nencki Institute guidelines and permission of the Local Ethical Committee. The studies were carried out in accordance with the European Communities Council Directive of 24 November 1986 (86/609/EEC), Animal Protection Act of Poland and approved by the first Local Ethics Committee in Warsaw. All efforts were made to minimize the number of animals used and their suffering.\nCAUTION: All procedures described below must be carried out in a laboratory fume hood. Due to the hazardous nature of the reagents used. Personal safety measures such as gloves, lab coat, safety glasses and a face mask are required.\n1. Preparation of the fixative for perfusion (2% wt/vol paraformaldehyde (PFA) and 0.5% vol/vol glutaraldehyde (GA) in 0.1 M phosphate buffer (PB), pH 7.4)\nNOTE: Prepare the fixative solution on the same day as it will be used and do not store it longer than for 3 hours. In case of time shortage, prepare 2% PFA in 0.1 M PB the day before, store it at 4 °C and add fresh GA shortly before the perfusion.\nTake 400 mL of sterile double distilled water (ddH2O) and heat it to 60 °C using a stirring hot plate. Then add 20 g of PFA. Add drops of 1 M NaOH until PFA is fully dissolved and allow the mixture to cool down.\nAdd 500 mL of 0.2 M PB (pH 7.4).\nFilter the solution to remove any deposit and cool it to 4 °C.\nJust before perfusion, add 20 mL of 25% GA to the solution and then top up the volume with ddH2O to 1 L.\n2. Preparation of postperfusion fixative for SBEM (2% wt/vol PFA and 2.5% vol/vol GA in 0.1 M PB, pH 7.4)",
    "Take 50 mL of the fixative for perfusion (2% PFA and 0.5% GA in 0.1 M PB).\nAdd 5 mL of 25% GA.\n3. Preparation of postperfusion fixative for IF staining (4% PFA in phosphate buffered saline (PBS))\nDissolve a tablet of 1x PBS (pH 7.4) in a purified and deionized water (H2O) according to manufacturer instructions.\nUse a stirring hot plate to heat the solution to 60 °C and add 40 g of PFA.\nAdd drops of 1 M NaOH until the PFA is fully dissolved and allow the mixture to cool.\nAdjust the pH of the solution to 7.5 with 1 M HCl then top up the volume with H2O to 1 L.\nFilter the solution to remove any deposits.\n4. Transcardial perfusion of animals\nNOTE: All PFA and GA wastes must be collected and stored for disposal according to the local regulations. Anesthesia and perfusion should follow the local regulations. In the described protocol adult 3-month-old and 20±1-month-old female Thy1-GFP(M) mice (Thy1-GFP +/-)12 expressing green fluorescence protein (GFP) in a sparsely distributed population of glutamatergic neurons were used but any other can be used as well. Animals were bred as heterozygotes with the C57BL/6J background in the Animal House of the Nencki Institute of Experimental Biology.\nBefore perfusion anesthetize a mouse by administration of a ketamine/xylazine mixture (up to 90 mg/kg body weight ketamine and 10 mg/kg body weight xylazine) via intraperitoneal injection (27-gauge needle).\n\t\nAssess whether the depth of anesthesia is sufficient by checking the reflex to pain stimuli (pinching) and the corneal reflex (squinting).\nAfter 20 minutes perform an intraperitoneal injection (27-gauge needle) of sodium pentobarbital (50 mg/kg body weight).",
    "Perfuse a mouse according to a perfusion surgery protocol described by Gage et al.13 (see point 4; Figure 5-6). Using a perfusion pump start with a 0.1 M phosphate buffer, pH 7.4 (30 mL) for 3 minutes and continue with 2% PFA and 0.5% GA in 0.1 M PB, pH 7.4 for 6 minutes (80 mL).\n\t\nGently dissect the brain from the skull and divide it in half (see Figure 9-10 in Gage et al., 201213). Place one piece in a vial containing fixative for SBEM and the second into the vial with 4% PFA/PBS for IF staining.\nKeep the hemispheres in the fixative at 4 °C overnight.\n5. Brain slices preparation for electron microscopy\nChoose the vibratome settings (blade travel speed: 0.075 mm/s, cutting frequency: 80 Hz).\nPlace the slice chamber into the holder, attach it to the vibratome and surround it with ice. Then place a razor blade into the vibratome blade holder.\nUse a spoon, or similar object and place the chilled brain (dorsal surface up) on a tough cutting surface (e.g., a glass Petri dish lid). To prepare a coronal slice of the hippocampus make a perpendicular cut between the cerebral hemisphere and the cerebellum with a razor blade or scalpel, thus removing the cerebellum. The olfactory bulb can also be removed.\nApply cyanoacrylate glue on the dry platform of the vibratome.\nPick up the brain with forceps and carefully dry it on filter paper.",
    "Glue the hemisphere to the platform close to the cutting blade with the rostral tip upwards. Attach the platform to the holder and immediately fill it up with ice-cold 0.1 M PB, pH 7.4. If the perpendicular cut is properly made, the hemisphere will stand straight up providing 90° angle required to make a symmetric coronal cut containing the hippocampus. Assure that the brain is covered with PB.\nPosition the vibratome blade in front of the hemisphere and lower it to the coronal side of the hemisphere. Lower the blade to 400 µm further in the caudal direction and start slicing. Continue slicing until the first two slices are completely separated from the tissue block.\nRetract the blade and lower another 100 µm, then slice again.\nWhen the hippocampus becomes visible (use the mouse brain atlas Paxinos and Franklin, 200414) collect the slices with the small paintbrush or widened plastic Pasteur pipette.\nTransfer the slices into a 12-well plate filled with cold 0.1 M PB, pH 7.4.\nDissect the hippocampus in a glass Petri dish filled with 0.1 M PB, pH 7.4 using a razor blade or scalpel, and put it into glass vials with the same phosphate buffer.\n\t​NOTE: For long-term storage of the slices supplement 0.1 M PB with 0.05% sodium azide (NaN3).\n6. Brain sample preparation for immunostaining\nAfter overnight fixation in 4% PFA/PBS solution in a fume hood, put the brain tissue into the cryopreservation solution (30% sucrose in PBS with 0.05% NaN3) and keep it at 4 °C for 2 days (until sunk).\nPrepare an antifreeze solution (15% sucrose/30% ethylene glycol/0.05% NaN3/PBS).",
    "Set the cabinet temperature of the cryostat at -19 °C and make sure that the temperature is reached before proceeding further. During sectioning, ensure that the cabinet temperature remains between -18 °C and -20 °C.\nUse a spoon, or similar object and place the chilled brain (dorsal surface up) on a tough cutting surface (e.g., a glass Petri dish lid). To prepare a coronal slice of the hippocampus make a perpendicular cut between the cerebral hemisphere and the cerebellum with a razor blade or scalpel, thus removing the cerebellum.\nSelect a pre-cooled specimen disc, cover it with a medium for freezing on a freeing shelf and using forceps fix the hemisphere to the disc with a rostral tip upwards and wait until the specimen is completely frozen. Insert the specimen disc into a specimen head.\nInstall a blade in a blade holder inside the cryo-chamber and cut 40 µm thick slices.\nTransfer slices with a small paintbrush to the 96-well plate filled with cold anti-freeze solution and gently unroll the sections (collect a slice after each round of slicing to prevent them from getting lost in the slice chamber).\n\t​NOTE: Brains or sections can be stored in an antifreeze solution at -20 °C for a long time.\n7. Immunostaining of brain slices\nNOTE: All staining steps were performed in a 24-well plate on a platform shaker.\nWash the slices with PBS three times, each time for 6 minutes.\nIncubate slices in 300 µL of blocking solution (5% normal donkey serum (NDS)/0.3% Triton X-100) for 1 hour with gentle shaking on a rotator.\nIncubate the slices with the primary antibody against PSD-95 diluted 1:500 in 5% NDS/0.3% Triton X-100/PBS (300 µL per well) overnight at 4 °C. The final concentration of the primary antibody is 2 µg/mL.",
    "Wash the slices with 0.3% Triton X-100/PBS at room temperature (RT) three times, each time for 6 minutes.\nIncubate slices with the secondary antibody diluted 1:500 in 300 µL of 0.3% Triton X-100/PBS for 90 minutes. The final concentration of the secondary antibody is 4 µg /mL.\nWash the slices with PBS three times, each time for 6 minutes.\nMount the slices on slides using a mounting medium and then close them with a cover slide.\nExamine the specimens using a confocal microscope (63 × oil objective, NA 1.4, pixel size 0.13 µm × 0.13 µm).\n\t​NOTE: For long-term storage: keep the samples at 4 °C, protect them from light.\n8. SBEM sample preparation\nCAUTION: Due to the hazardous nature of reagents used all the procedures described below must be carried out in a laboratory fume hood. Before using these chemicals read carefully the Material Safety Data Sheets provided by the manufacturers and ask the safety officer about the local rules to ensure safe handling and waste disposal.\nSample contrasting\n\tNOTE: Slices washings and room temperature incubation should be carried out with mild shaking (e.g., on a platform shaker). Autoclave degassed water was used.\n\t\nWash the slices with cold 0.1 M PB, pH 7.4 five times, each time for 3 minutes.\nPrepare a 1:1 mixture of 4% aqueous osmium tetroxide and 3% potassium ferrocyanide (1:1 by vol). The final product will turn brown. Immerse the samples in this mixture, place them on ice, and from this stage onwards it is important to protect them from light. Incubate them with gentle shaking for 1 hour.",
    "Meanwhile prepare a thiocarbohydrazide (TCH) solution. Mix 10 mL of double-distilled H2O (ddH2O) and 0.1 g of TCH and place it into an oven set at 60 °C for 1 hour. It is important to swirl the solution from time to time (e.g., every 10 minutes). When ready, cool it to room temperature.\nWash the slices with ddH2O five times, each time for 3 minutes.\nFilter TCH solution using a 0.22 µm syringe filter and immerse the sample in filtered solution. The slices will turn black. Incubate them for 20 minutes at room temperature.\nWash the samples with ddH2O five times, each time for 3 minutes.\nIncubate the samples with a 2% aqueous solution of OsO4 for 30 minutes at room temperature.\nWash the samples with ddH2O five times, each time for 3 minutes.\nPlace the samples in filtered 1% aqueous uranyl acetate and incubate them at 4 °C overnight. Use 0.22 µm syringe filter for filtration.\nPrepare L-aspartic acid solution by mixing 0.4 g of L-aspartic acid and 80 mL of ddH2O, adjust the pH to 3.8 for easier dissolving, and then top up with water to 100 mL.\nNext day, begin with Walton's lead aspartate15 preparation. Mix 0.066 g of lead nitrate with 10 mL of L-aspartic acid solution (point 8.1.10) pre-warmed to 60 °C and adjust pH to 5.5 (measured at 60 °C) with 1 M NaOH. Close the vial with lead aspartate and leave it at 60 °C for 30 minutes in a water bath. The solution should be clear. If it turns cloudy, it must be discarded and a new one needs to be prepared.\nIn the meantime, wash the samples with degassed ddH2O five times, each time for 3 minutes. Then keep them in the oven set at 60 °C for 30 minutes.",
    "Immerse the samples in the freshly prepared lead aspartate solution and incubate them in the oven set at 60 °C for 20 minutes.\nWash the samples with degassed ddH2O five times, each time for 3 minutes.\nDehydration and resin embedding\n\t\nPrepare epoxy resin. Weigh the ingredients (33.3 g of component A/M, 33.3 g of component B, and 1 g of component D) and mix the resin well (e.g., shake it on a rotary shaker in a 15 mL tube) for at least 30 minutes before adding 16 drops of accelerator DMP 30. Stir again for another 10 minutes.\n\t\tNOTE: Weigh the ingredients under the fume hood. This amount of components gives approximately 60 mL of resin what is enough for 15 vials with samples. You can prepare less or store the rest of the resin in a syringe at 4 °C and utilize it the next day. Remember to seal the tip of the syringe.\nPrepare vials with graded dilutions of ethanol (30%, 50%, 70%, 90%, 100%, 100% ethanol in water and 100% dried on a molecular sieve).\nMix the resin with 100% ethanol in 1:1 proportion to obtain 50% resin. Mix it well.\nDehydrate the samples for 5 minutes in each dilution of ethanol starting from 30% and ending with 100% anhydrous ethanol dried on molecular sieve. Remember, the samples must never dry completely.\nInfiltrate the samples first in 50% resin for 30 minutes, next in 100% resin for one hour, and then again in 100% resin overnight. Perform all infiltration steps with constant slow shaking.",
    "The next day, place the samples in fresh 100% resin for one hour and then embed them between fluoropolymer embedding sheets. Degrease pieces of embedding sheet with ethanol, and flat embed the samples between two layers of it, using two glass slides as support. Try to avoid air bubbles in resin on or close to the sample.\nCure the samples in the oven at 70 °C for at least 48 hours.\nTrimming and mounting\n\t\nSeparate embedding sheets and cut a piece of the embedded sample (approximately 1 mm x 1 mm) with a razor blade. Transfer it to a parafilm. This will minimize the danger of losing the sample due to electrostatics.\nTake an aluminum pin that has been degreased with ethanol. Mix a conductive epoxy well and use a little amount of it to mount the sample to the pin. Cure conductive epoxy at 70 °C for 10 minutes.\nTrim each side of the sample block with the diamond knife and then polish the face of the block until the tissue is exposed.\n\t\tNOTE: At this step, confirm the presence of a region of interest by collecting some sections and performing toluidine blue staining16 or checking under the electron microscope.\nReduce the size of the sample as much as possible. Then ground the sample to the pin with conductive paint and cure it (for 24 hours at room temperature or in the oven at 65 °C for 40 minutes).\nTo minimize charging artifacts, sputter coat the samples with a thin layer of gold or gold/palladium.\n9. SBEM imaging\nPlace the pin with a sample into the chamber of the serial block-face scanning electron microscope. Align the sample to the knife. Close the chamber and set the parameters.",
    "Collect a stack of images at desired magnification, pixel size, slice thickness, accelerated voltage (EHT), aperture, pressure, etc.\n\t​NOTE: The parameters depend on the sample and the goal of the experiment. Exemplary initial imaging settings are included in the table of materials.\n10. 3D reconstructions\nNOTE: For the steps mentioned below we use open-access software e.g. FijiJ17 (ImageJ version 1.49b), Microscopy Image Browser (MIB)18 and Reconstruct19 but various other software can be employed.\nConvert digital micrograph (dm) files into TIFF format. First import the image sequence (in FijiJ: File > Import > Image sequence > Choose 8 Bit Format) and then save as TIFF (in FijiJ: File > Save As > Image Sequence > Choose Tiff).\nAdjust brightness and contrast of the stack of images (in FijiJ: Image > Adjust > Brightness/Contrast) and, if necessary, denoise it (use DenoisEM plugin for FijJ20 : Plugins > DenoiseEM > Denoise).\nAlign the stack (in FijiJ: Plugins > StagReg or MIB: Dataset > Alignment Tools).\nSegment dendritic spines and synapses (In MIB or Reconstruct software, comprehensive tutorials are available (See Table of Materials for details).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}