{
  "id": 15521,
  "origin_website": "Jove",
  "title": "Reconstitution of Septin Assembly at Membranes to Study Biophysical Properties and Functions",
  "procedures": [
    "NOTE: Forming supported lipid bilayers requires the preparation of monodispersed small unilamellar vesicles (SUVs). Please refer to a previously published protocol24 on SUV formation. Briefly, all SUVs are formed by probe sonication for 12 min in total at 70% amplitude via 4 min sonication periods followed by 2 min rest periods in ice-water. SUV solutions must be well clarified and monodispersed in size. Size distributions of SUVs can be measured, for example, by dynamic light scattering25.\n1. Planar lipid bilayers\nPlasma cleaning of the slides\n\tNOTE: Plasma cleaning removes organic contaminants and increases the hydrophilicity of the glass, ensuring efficient lipid adsorption. The following steps may change or need to be optimized depending on the plasma cleaner and glass coverslips used.\n\t\nPurge the plasma cleaner for 5 min with oxygen to remove air from the lines and chamber. This is to ensure that, when the plasma cleaner is run, there is primarily oxygen in the lines and chamber, providing more consistent bilayer preparations.\nWhile purging, stream an inert gas, such as N2 or Ar, over the micro cover glass slides to remove dust and particulates.\n\t\tOPTIONAL: Cover glass slides can be washed by spraying each side with 100% isopropanol followed by water. Repeat the isopropanol-water wash 3x and then dry with an N2 stream.\nArrange dry cover glass slides into a ceramic cradle. Place the cradle at the back of the plasma chamber so that the coverslips are parallel with the long edge of the chamber (this keeps them in place during plasma cleaning). Run the plasma cleaner for 15 min with oxygen at maximum power.\nChamber preparation\n\tNOTE: The method described here uses homemade chambers from plastic PCR tubes to support the reaction volumes, but other low adhesion materials, such as silicone wells, may also be suitable.",
    "Using a razor blade or scissors, cut off the cap just below the frosted part of a 0.2 mL PCR tube (Figure 2).\nPaint the rim of the PCR tube with UV-activated adhesive, avoiding the inside of the tube. Gently place the PCR tube glue-down in the center of a plasma-cleaned coverslip.\n\t\tNOTE: To avoid glue inside the chamber, use the minimum amount of glue to get a seal, and promptly treat with UV without bumping or disturbing the chamber.\nPlace the chamber under long-wavelength UV light for 5-7 min to cure the adhesive.\nBilayer formation\n\tNOTE: Monodispersed SUVs should be used in this step for efficient bilayer formation. Table 1 provides recipes for all buffers used in the bilayer formation, including stock and final buffer concentrations.\n\t\nAdd 40 µL of supported lipid bilayer buffer (SLBB: 300 mM KCl, 20 mM HEPES, pH 7.4, 1 mM MgCl2; Table 1), 10 µL of 5 mM SUVs, and 1 µL of 100 mM CaCl2 to the well. Gently shake the chambers from side to side to disrupt the SUVs, and then incubate at 37 °C for 20 min.\n\t\tNOTE: To limit evaporation, incubate in a covered Petri dish with a wet wipe.\nWashing away excess lipids\n\tNOTE: This step removes excess SUVs and acts as a buffer exchange step. It is very important not to scrape the bilayer with the pipette tip while washing; if the glass is exposed, septins and many other proteins will bind irreversibly, reducing the effective protein concentration.\n\t\nAfter incubation, rinse the bilayer 6x with 150 µL of SLBB, pipetting up and down to mix each time while avoiding bubbles.\n\t\tNOTE: Add 150 µL directly to the 50 µL of buffer and SUVs already present for a total of 200 µL in the reaction well.",
    "When ready to start incubating with the septins or a different protein of choice, wash the bilayer 6x with 150 µL of reaction buffer (RXN: 33.3 mM KCl, 50 mM HEPES, pH 7.4, 1.4 mg/mL BSA, 0.14% methylcellulose, 1 mM BME).\n\t\tNOTE: For best results, make the reaction buffer fresh and be very careful while mixing in the reaction well to avoid bubbles.\nOn the last wash step, remove 125 µL of reaction buffer, leaving 75 µL in the well. Add 25 µL of septins diluted in septin storage buffer (SSB: 300 mM KCl, 50 mM HEPES, pH 7.4, 1 mM BME) at the desired concentration and image by TIRF microscopy26.\n\t\tNOTE: When setting up this assay for the first time or incorporating a new lipid composition, it is good practice to ensure lipids are freely diffusing on the surface using fluorescence recovery after photobleaching (FRAP). While the rate of recovery will be different for different lipid compositions and inherently lower than for free-standing systems, the lipids should not be immobile.\ntable:\n﻿0,1,2\nSupported Lipid Bilayer Buffer (SLBB),Supported Lipid Bilayer Buffer (SLBB),Supported Lipid Bilayer Buffer (SLBB)\nStock,Volume,Final concentration\n2 M KCl,1.5 mL,300 mM\n1 M HEPES,200 µL,20 mM\n500 mM MgCl2,20 µL,1 mM\nWater,8 mL,\nPre-Reaction Buffer (PRB),Pre-Reaction Buffer (PRB),Pre-Reaction Buffer (PRB)\nStock,Volume,Final concentration\n2 M KCl,166 µL,33.3 mM\n1 M HEPES,500 µL,50 mM\nWater,9.33 mL,\nReaction Buffer,Reaction Buffer,Reaction Buffer\nStock,Volume,Final concentration\n2 M KCl,166 µL,33.3 mM\n1 M HEPES,300 µL,50 mM\n10 mg/mL BSA,1.39 mL,1.39 mg/mL\n1% Methylcellulose,1.39 mL,0.0014\nWater,Up to 10 mL,\nBME,0.7 µL,1 mM\nSeptin Storage Buffer (SSB),Septin Storage Buffer (SSB),Septin Storage Buffer (SSB)\nStock,Volume,Final concentration\n2 M KCl,1.5 mL,300 mM\n1 M HEPES,500 µL,50 mM\nWater,Up to 10 mL,\nBME,0.7 µL,1 mM",
    "Table 1: Buffer components for preparation of supported lipid bilayer and reactions. Volumes of stock solutions that are incorporated into buffers and the final concentrations of each component are shown. SLB and PRB can be stored at room temperature and reused between experiments. Reaction buffer and SSB are made fresh for each experiment.\n2. Spherical supported lipid bilayers\nNOTE: This protocol uses silica microspheres suspended in ultrapure water at 10% density. For any work on the kinetic parameters of protein assembly, it is important to strictly control the total membrane surface area between experiments and curvatures. Table 2 shows the corrected volumes of beads and buffer to maintain 5 mm2 of total membrane surface area. This protocol expands on a previously published method8,18.\nBilayer formation\n\tNOTE: As for planar bilayers, it is important to have high-quality SUVs for robust bilayer formation. Table 2 lists the volume of beads from a 10% density solution and their respective SLBB volumes that are used to obtain a final surface area of 5 mm2 for a range of bead diameters.\n\t\nSilica microspheres (also referred to as beads) tend to settle and clump together; to mix the beads and break up any clusters, vortex the bottle for 15 s, then bath-sonicate for 1 min, and vortex again for 15 s.\nMix the appropriate volume of beads (Table 2) with the corresponding volume of SLBB and 10 µL of 5 mM SUVs in a 0.5 mL low-adhesion microcentrifuge tube.\nRock the bead-lipid mixture end-over-end for 1 h at room temperature. Ensure that this incubation is done on a rotator to prevent sedimentation.\nPrepare chambers on PEGylated coverslips",
    "NOTE: As for planar bilayers, homemade chambers from plastic PCR tubes are used to support the reaction volumes, but other low adhesion materials, such as silicone wells, may work just as well.\n\t\nWhile the beads are rocking, thaw a PEGylated coverslip at room temperature. Cut a 0.2 mL PCR tube and glue it to the coverslip as described in step 1.2. For 24 mm x 50 mm slides, up to 10 chambers can feasibly fit on one slide.\n\t\tNOTE: This protocol uses 24 mm x 50 mm PEGylated glass coverslips that are prepared in advance. Briefly, glass coverslips are thoroughly cleaned through sonication in acetone, methanol, and 3 M KOH. Coverslips are then functionalized with n-2-aminoethyl-3-aminopropyltrimethoxysilane and covalently linked to mPEG succinimidyl valerate. Finished PEGylated coverslips are stored vacuum-sealed at −80 °C. For a similar passivation protocol, please see the work of Gidi et al.27. While PEGylated glass coverslips are suggested here, other means of passivation, such as BSA or poly-L-lysine methods, may be effective.\nWashing away excess lipids\n\tNOTE: This step functions to remove excess SUVs and perform a buffer exchange. Beads are washed 4x in total with pre-reaction buffer (PRB: 33.3 mM KCl, 50 mM HEPES, pH 7.4). Table 3 lists the spin speeds in RCF for a range of bead diameters.\n\t\nSpin beads at the designated RCF for 30 s (Table 3). If using multiple bead sizes, keep beads rocking until it is their time to be washed.\n\t\tNOTE: It is not worth sedimenting larger beads in the same spin as smaller beads with the smaller bead sedimentation velocity to save time. This can cause beads to stick to each other and compromise the integrity of the bilayer.",
    "After the first spin, remove 50 µL of supernatant and add 200 µL of PRB. After the second and third spins, remove 200 µL and add 200 µL of PRB. After the fourth spin, remove 200 µL and add 220 µL of PRB. Pipette vigorously for each wash.\n\t\tNOTE: The final resuspension volume is different than the washes. Do not vortex the beads after incubation with the lipids as this can leave gaps in the bilayers. To avoid sedimentation while working with the other bead sizes or setting up other parts of the assay, place the bead mixtures back on the end-over-end rotator.\nPreparing the reaction\n\tNOTE: This reaction is designed to preserve the total membrane surface area of the reaction at 5 mm2 and to produce a final reaction condition of 100 mM KCl, 50 mM HEPES, 1 mg/mL BSA, 0.1% methylcellulose, and 1 mM BME.\n\t\nIf doing a competition assay with multiple bead sizes, make a 1:1 mixture by mixing equal volumes of each bead size together. Then, mix 29 µL of the desired bead mixture (or of a single bead) with 721 µL of RXN buffer.\n\t\tNOTE: It is important to thoroughly mix the beads at each step with a pipette to avoid dense clusters of beads; this will result in a more even bead distribution and accurate total surface area.\nMix 75 µL of diluted beads and 25 µL of protein diluted in SSB to the wells.\n\t\tNOTE: The authors typically image yeast septin complexes at 1-50 nM.\nIf measuring septins at a steady-state, incubate at room temperature for 1 h, and then image by either near-TIRF or confocal microscopy.\ntable:\n﻿0,1,2,3\nBead Diameter (µm),Volume of well-mixed beads (µL),Volume of SLB buffer (µL),Volume of SUVs (µL)\n6.46,8.94,61.1,10\n5.06,7,63,10\n3.17,4.39,65.6,10\n0.96,1.33,68.7,10\n0.54,0.75,69.3,10\n0.31,0.43,69.6,10",
    "Table 2: Normalized volumes of microspheres. In order to maintain an equal surface area of each bead size and to keep the total membrane surface area consistent between experiments, volumes for each bead size and buffer that normalized the total surface area were calculated.\ntable:\n﻿0,1\nBead diameter (µm),Sedimentation velocity (RCF)\n0.31,4.5\n0.54,4.5\n0.96,2.3\n3.17,0.8\n5.06,0.3\nTable 3: Sedimentation velocities for microspheres of varying diameters. For each bead diameter, the shown minimum sedimentation velocities were used to pellet the beads for washing away unbound liposomes.\n3. Rod supported lipid bilayers\nNOTE: In contrast to the other assays presented here, the rod assay does not allow for careful control of the total membrane surface area. One can be consistent in amounts and volumes between experiments, but because this results in rods of different lengths and diameters, it is difficult to extrapolate the total membrane surface area in the reaction. Thus, while this is an excellent assay for exploring curvature sensing with multiple curvatures on a single surface and has been useful for exploring septin ultrastructure, it is not recommended for kinetic measurements. This method was previously reported18 and is being expanded upon here.\nObtaining borosilicate rods from glass microfiber filters\n\t\nTear a single 42.5 mm grade GF/C glass microfiber filterinto small pieces and place them into a 100 mL beaker with 60 mL of 100% ethanol. Bath-sonicate until the solution becomes opaque; this can take as little as 20-30 min with a finely shredded filter.\n\t\tNOTE: Sonicate thoroughly to break up big chunks; the more dissociated/opaque, the better.\nCover the solution with film and store the solution at room temperature overnight.\nForming bilayers on the rods",
    "NOTE: This step is performed with excess lipids to achieve complete rod coverage as it is impossible to quantify the total surface area in this method.\n\t\nThe next day the ethanol solution will be settled (step 3.1.2.), so mix it well before using. Combine 10 µL of rod solution and 70 µL of SLBB.\nSpin at top speed in a mini centrifuge for 30 s and remove 50 µL of the supernatant. Resuspend in another 50 µL of SLBB and repeat the spin for a total of four washes to dilute out the ethanol.\n\t\tNOTE: Rod supports will not form a solid pellet at the bottom of the tube. They are instead smeared along the side of the tube; this makes them difficult to completely preserve when washing. Since the total surface area in this assay is not controlled, it is fine if they are disturbed.\nCombine 10 µL of well-mixed rod solution with 50 µL of 5 mM SUVs and 20 µL of SLBB. Incubate for 1 h at room temperature, rotating end-over-end as when forming bilayers on the microspheres.\nWashing away excess lipids\n\t\nSimilar to step 3.2.2., spin the lipid-rod solution at top speed in a mini centrifuge for 30 s to pellet the membrane-coated rods out of the solution.\nAfter the first spin, remove 50 µL of the supernatant and add 200 µL of PRB. After the second and third spins, remove 200 µL and add 200 µL of PRB. After the fourth spin, remove 200 µL, add 220 µL of PRB, and pipette vigorously to mix.\nPreparing the reaction\n\t\nIn a 1.5 mL microcentrifuge tube, mix 721 µL of reaction buffer with 29 µL of rod solution. Mix well.",
    "In a 0.2 mL PCR tube, combine 75 µL of rods in reaction buffer and 25 µL of septins at the desired concentration, diluted in SSB. Allow it to incubate at room temperature for at least 1 h.\nPreparing for scanning electron microscopy\n\t\nAfter incubation, add the 100 µL septin-rod mixture onto a round, PEG-coated 12 mm coverslip and incubate at room temperature for 1 h in a closed Petri dish.\nFix the sample by filling the bottom of the Petri dish (10 mL should be enough) with 2.5% glutaraldehyde in 0.05 M sodium cacodylate (NaCo), pH 7.4, for 30 min. Aspirate the liquid with a glass pipette. Wash the sample by incubating it with 10 mL of 0.05 M NaCo for 5 min and repeat for a total of two washes.\nPostfix in 0.5% OsO4 cacodylate buffer for 30 min, and then wash 3x in 0.05 M NaCo (5 min/wash).\nIncubate the sample with 1% tannic acid for 15 min, and then wash in NaCo 3x. Incubate for 15 min in 0.5% OsO4 and wash 3x with NaCo.\nDehydrate the samples using increasing ethanol concentrations: 30% EtOH for 5 min, 2x; 50% EtOH for 5 min; 75% EtOH for 5 min; and 100% EtOH for 5 min, 2x. Follow with another 10 min incubation.\nIncubate in transition fluid (hexamethyldisilazane) 3x (5 min, 10 min, then 5 min).\nAllow to air dry, then place the samples in a desiccator until sputter-coating. Sputter-coat the 4 nm layer with a gold/palladium alloy and then image on a scanning electron microscope.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}