{
  "id": 2033,
  "origin_website": "Cell",
  "title": "Live cell microscopy of mitochondria-lysosome contact site formation and tethering dynamics",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nThawing HeLa cells\nTiming: 1 h\nThe first phase of the protocol describes how to prepare HeLa cell cultures for subsequent passaging, transfection and imaging.\nWarm 9 mL of HeLa media in 50 mL conical tube in 37°C bath.\nTake out frozen vial of HeLa cells (1 mL) stored in liquid nitrogen tank.\nHold and thaw vial in 37°C bath (for ∼1 min).\nAlternatives: Alternative mammalian cell lines can also be used to visualize and analyze mitochondria-lysosome contact dynamics such as HEK293 and HCT116 cells (Wong et al., 2018[href=https://www.wicell.org#bib7]).\nImmediately add thawed HeLa cells to 9 mL of warm HeLa media.\nSpin down cells at 200 × g for 3 min in order to remove any DMSO from the media.\nCritical: In order to avoid contamination, all manipulation of HeLa cells and preparation of solutions should be performed in a tissue culture hood. Cell vials, cell culture plates and all solutions should never be opened outside the sterilized hood. Sterilize the inside of the tissue culture hood with 70% EtOH to ensure adequate sterilization of the work area before using. Spray hands and all materials that are brought into the hood with 70% EtOH before each experiment.\nAspirate off supernatant and resuspend pellet. First, resuspend in 5 mL of HeLa media and once mixture appears homogeneous, resuspend cells again into a final total volume of 20 mL of HeLa media.\nPlate HeLa cells into two 10 cm plates (10 mL of media per plate) and grow cells in an incubator at 37°C for 2–3 days.\nPassaging of HeLa cells\nTiming: 1 h",
    "Critical: Warm HeLa media for at least an hour prior to passaging to keep HeLa cells at a near optimal temperature during passaging. Before passaging, it is important to also examine cells under a cell culture microscope to ensure normal cell morphology, optimal confluency (80%–100%), and the absence of contamination.\nFrom a 10 cm dish of confluent HeLa cells (80%–100%), aspirate off HeLa media with a glass Pasteur pipet attached to the vacuum.\nWash cells with 5 mL of sterile PBS (use at 20°C) and aspirate. Then add 2 mL of TrypLE Express (stored at 4°C, use at 20°C) to detach cells from the 10 cm cell plate.\nPlace cells in TrypLE Express in a CO2 incubator for 3 min to ensure complete detachment of cells from the plate’s surface.\nNote: Depending on the type of mammalian cells used in the protocol, the incubation time of cells with TrypLE Express in the CO2 incubator can be extended to increase detachment of cells.\nAdd 5 mL of HeLa media to the plate containing TrypLE Express and resuspend media in the plate several times while rotating the cell dish to remove remaining cells from the plate.\nOnce the majority of cells have detached, collect resuspended cells (∼7 mL total) into a 50 mL conical tube, and centrifuge cells at 200 × g at 20°C for 3 min.\nAspirate off media and TrypLE Express. Immediately add 5 mL of HeLa media to the same conical tube and resuspend.\nCritical: Do not disturb the cell pellet. Tilting the conical tube while aspirating helps avoid this.\nOnce the mixture appears homogeneous, dilute cell suspension into a final volume of 40 mL of HeLa media.",
    "Add resuspended HeLa cells to 10 cm dishes for maintaining cell culture, and to 35 mm MatTek dishes for live cell microscopy:\nFor 10 cm dish: Add 10 mL media/dish (approximately 2.2 × 106 cells/10 mL).\nFor 35 mm MatTek dishes: Add 1.5 mL media/dish (approximately 0.3 × 106 cells/1.5 mL).\nCells should be grown until ∼70% confluency before continuing to the next step.\nPause point: Incubate cells at 37°C and allow growth for at least 24 h prior to transfection.\nCritical: Avoid introducing bubbles into the resuspended media as well as cell dishes to avoid contamination. In addition, excessive movement of cell plates after initial passaging should be avoided to mitigate unnecessary clumping of cells.\nNote: One confluent 10 cm dish of HeLa cells can be split into two to four 10 cm dishes during passaging, which will become confluent after 2–3 days depending on the rate of cell growth.\nTransfection of HeLa cells for live cell imaging\nTiming: 45 min\nThis step describes how to transfect plasmids into HeLa cells for visualization of mitochondria and lysosomes by confocal microscopy. Cells will express Lamp1-mGFP to label the lysosomal membrane in green, and mApple-TOMM20 to label the outer mitochondrial membrane in red.\nCritical: Cells should be examined under a cell culture microscope prior to transfection to check for confluency. Transfection reagents can be cytotoxic, and transfection of dishes with <60% confluency may result in decreased transfection efficiency and/or cell viability.\nMix 100 μL Optimem and 0.5 μg DNA of each plasmid (Lamp1-mGFP and mApple-TOMM20) in a sterile Eppendorf tube. Resuspend 5–6 times to ensure proper mixing.",
    "Alternatives: The outer mitochondrial membrane can also be labeled in red using mCherry-TOMM20-N-10 (Addgene Plasmid #55146) or in green using mEmerald-TOMM20-C-10 (Addgene Plasmid #54281). The lysosomal membrane can also be labeled in green using Emerald-Lysosomes-20 (Addgene Plasmid #56476) or in red using mApple-Lysosomes-20 (Addgene Plasmid #54921) Mitochondrial and lysosomal markers used must have different emission/excitation spectra to differentiate each marker during acquisition.\nIn a separate sterile Eppendorf tube, mix 100 μL Optimem and 3 μL Lipofectamine 2000 (use 1.5 μL/plasmid). Resuspend 5–6 times to ensure proper mixing.\nAlternatives: Mammalian cells can also be efficiently transfected using FuGENE® 6 Transfection Reagent (Promega) instead of Lipofectamine 2000.\nMix each tube individually and wait 5 min. Combine the solutions from both Eppendorf tubes and wait 20 min. Resuspend 5–6 times to ensure proper mixing.\nAdd the combined solution to cells plated in a 35 mm dish for live cell microscopy.\nCells should be transfected for 24–32 h prior to imaging, to ensure efficient expression of plasmids.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1516-Fig1.jpg\nFigure 1. Representative images of appropriate cell confluency and health for live imaging of HeLa cells\n(A–C) Live HeLa cells were transfected with LAMP1-mGFP (lysosomal membrane, green) and mApple-TOMM20 (outer mitochondrial membrane, red) and imaged by live cell confocal microscopy. These representative images demonstrate the variability in cell confluency (from low to high) that can be obtained during imaging.\n(D) Representative image of live HeLa cells transfected with LAMP1-mGFP (lysosomal membrane, green) and mApple-TOMM20 (outer mitochondrial membrane, red). Black arrows indicate a good, healthy cell that is ideal for microscopy analysis whereas the red arrow indicates an unhealthy cell that should not be used during analysis.\nScale bars, 10 μm (A–D).",
    "Pause point: Live cell plates must be kept at 37°C in an incubator for at least 24 h before proceeding to live cell imaging, and cell confluency should be ∼90% at the point of imaging. It is also important to ensure that cells are properly transfected by evaluating the percent of cells expressing fluorescent protein which should be ∼60%–80% of adherent cells (Figures 1[href=https://www.wicell.org#fig1]A–1C) (see troubleshooting 1[href=https://www.wicell.org#sec7.1], 2[href=https://www.wicell.org#sec7.3], and 3[href=https://www.wicell.org#sec7.5]).\nLive cell confocal microscopy of mitochondria-lysosome contact sites\nTiming: 40 min (per live cell plate)\nThis protocol describes how to obtain high resolution live cell confocal movies of mitochondria-lysosome contacts in HeLa cells using a Nikon A1R laser scanning confocal microscope with a 100× objective.\nCritical: To avoid contamination, sterilize the work area by spraying the microscope buttons and desk area with 70% EtOH. Prior to imaging, examine cells under a cell culture microscope to check for cell health and general morphology.\nTo ensure the optimal environment for cell health during imaging, the microscope CO2 levels should be set to 5% CO2, and the heater set to 37°C for at least 30 min before imaging to allow for the conditions to stabilize.\nTurn on the Nikon A1R laser scanning confocal microscope (with GaAsP PMT detector and a Nikon Plan Apo λ 100× 1.45 NA oil immersion objective). Imaging will be conducted using the microscope’s software (NIS-Elements (Nikon)).\nAlternatives: Mitochondria-lysosome contact sites can also be imaged using a Zeiss LSM 980 confocal microscope with GaAsp detectors using an α Plan-Apochromat 100× 1.46 Oil DIC immersion objective (Zeiss) with Zen Blue (Zeiss). It is also possible to perform the experiment with a 63× oil objective with increased zoom factor, but organelles will be visualized at a lower resolution than with a 100× oil objective.",
    "Critical: Ensure sufficient amount of Immersol immersion oil is added to the objective prior to adding cell plate. As initial changes in oil temperature may affect the z-plane of imaging, ensure that the final imaging plane allows for mitochondria and lysosomes to be clearly visualized in live cells.\nCarefully place the live cell imaging plate into the heated microscope chamber.\nTurn on the 488 nm laser and adjust objective depth until the fluorescent plane is visible through the eyepiece.\nCritical: Remember to turn off the laser immediately after finding cells of interest in order to limit light dose on sample. To mitigate this issue, it is helpful to use the channel with the most photostable fluorophore when looking for cells for prolonged periods of time (see troubleshooting 4[href=https://www.wicell.org#sec7.7]).\nOnce the correct focal plane is found, search for 10–15 viable cells to be used for live cell confocal movies. Cells will be acquired from a single z-plane (see troubleshooting 5[href=https://www.wicell.org#sec7.9]).\nCritical: Avoid imaging cells that are not adherent to the plate, or that produce a high level of autofluorescence (Figure 1[href=https://www.wicell.org#fig1]D). These cells are likely floating dead cells and will not produce useful or reliable information on the behavior of mitochondria-lysosome contacts (see troubleshooting 2[href=https://www.wicell.org#sec7.3]). Also avoid imaging cells with excessively high levels of fluorescent plasmid expression (see troubleshooting 6[href=https://www.wicell.org#sec7.11]).\nAnalyze previously selected cells and first take a confocal image of each cell (Figure 2[href=https://www.wicell.org#fig2]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1516-Fig2.jpg\nFigure 2. Representative live cell confocal microscopy images of mitochondria-lysosome contacts in live HeLa cells",
    "(A) Live HeLa cells were transfected with LAMP1-mGFP (lysosomal membrane, green) and mApple-TOMM20 (outer mitochondrial membrane, red) and imaged by live cell confocal microscopy as shown in the top panel. The inset (bottom) demonstrates a mitochondria-lysosome contact site (yellow arrow). These representative images show the level of contrast, intensity, and background that should appear in each of the fluorescent channels during imaging of mitochondria and lysosomes.\n(B) Representative time-lapse images from live HeLa cells transfected with LAMP1-mGFP (lysosomal membrane, green) and mApple-TOMM20 (outer mitochondrial membrane, red), demonstrating a dynamic mitochondria-lysosome contact site (yellow arrows) that remains tethered for 12 s before subsequently untethering (white arrow). Scale bars, 5 μm (A, top); 1 μm (A, bottom); 1 μm (B).\nFor each cell, acquire a laser scanning confocal time-lapse movie (Figure 2[href=https://www.wicell.org#fig2]B), visualizing lysosomes (Lamp1-mGFP) and mitochondria (mApple-TOMM20) with Green 488 nm and Red 561 nm lasers respectively.\nObtain movies at a minimum rate of 1 frame/2 s for 3 min to visualize mitochondria-lysosome contact site formation and dynamics.\nUse the following recommended settings:\nGreen 488 nm: Excitation wavelength: 488 nm, emission wavelength: 525 nm, laser power: 3.0, PMT HV (gain): 25, PMT offset: 0.\nRed 561 nm: Excitation wavelength: 561 nm, emission wavelength: 595 nm, laser power: 3.0, PMT HV (gain): 15, PMT offset: 0.\nCritical: While imaging, it is important that the laser intensity, gain, and offset setting are standardized across cells and between plates to ensure consistency during analysis.\nNote: Mitochondria-lysosome contact sites are defined as sites at which mitochondria and lysosome remain stably tethered to one another for at least 10 s (Wong et al., 2018[href=https://www.wicell.org#bib7]).\nCritical: Live cell imaging plates should not be imaged for more than 1 h per plate. Longer imaging may lead to unwanted phototoxicity-induced events and photobleaching (see troubleshooting 4[href=https://www.wicell.org#sec7.7]).",
    "Save all confocal images and time-lapse movies acquired.\nCarefully remove the live cell imaging plate from the microscope chamber.\nTurn off C02, microscope heater, and the Nikon A1R laser scanning confocal microscope.\nAlternatives: Contact sites can also be visualized in fixed mammalian cells using immunofluorescent staining of endogenous LAMP1 and TOMM20 to label lysosomal and mitochondrial membranes respectively (ex. LAMP1 rabbit antibody (Sigma-Aldrich, L1418); TOMM20 mouse antibody (BD biosciences, 612278)), followed by confocal microscopy with a 100× oil immersion objective (Wong et al., 2018[href=https://www.wicell.org#bib7])."
  ],
  "subjectAreas": [
    "Cell Culture",
    "Cell Biology",
    "Microscopy"
  ],
  "bigAreas": [
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}