{
  "id": 18313,
  "origin_website": "Jove",
  "title": "Minimally Invasive Transverse Aortic Constriction in Mice",
  "procedures": [
    "The protocol follows the guidelines of the Committee on the Use of Live Animals in Teaching and Research (CULATR) at the University of Hong Kong.\n1. Operation Site Preparation\nDisinfect the operation site with 75% isopropyl alcohol. Adjust the heating pad temperature to 37 °C to avoid changes in heart and respiratory rates of the subject animal.\nUse surgical instruments sterilized in a gravity displacement sterilizer at 121 °C for 30 min or by other appropriate methods.\nTake 2 - 4 30-gauge needles and curve them with a needle holder, as seen in Figure 1, to make a tool for ligation and tissue separation and for use as a retractor. Mount the now-curved needle on a cotton applicator for use in surgery.\nBlunt a 27-gauge needle and curve it 90º with the needle holder. Smooth the tip by rubbing a hard surface to make a 0.4-mm spacer in ligation step.\n2. Animal Preparation\nAnesthetize a 2-month-old, male, 22-25 g C57BL/6N mouse with an appropriate ketamine and xylazine mixture in relation to body weight: 100 mg/kg + 10 mg/kg i.p. Confirm the anesthetization with the negative tail pinch reflex.\nRemove the hair on the anterior neck and chest with a 2- to 3-min application of depilatory cream. Remove the cream with warm water and a cotton applicator.\nApply ophthalmic ointment or gel to the eyes of the animal to prevent the drying out of the cornea.\nPlace the animal on a heating pad in the supine position and conduct intra-operative monitoring, being sure to keep appropriate documentation at every 15-min interval.\nUse surgical paper tape to secure the limbs to the heating pad in order to keep the animal in the correct position during the surgery.\nDisinfect the skin alternately with alcohol and povidone-iodine solution three times.",
    "Use a sterile drape with an exposed operation field to prevent contamination. Use new sterile gloves for each mouse and as necessary.\n3. Ligation Procedure\nOpen the skin of the mouse at the midline position of the neck and chest with a scalpel.\nPull the thyroid gland towards the head by gently separating connective tissues with blunt scissors.\nSeparate the muscle layer on the trachea at the midline towards both sides with the curved needles.\nUsing the blunt scissors, cut the sternum to the second rib (approximately 5 mm). Open the cut with a retractor or curved forceps.\nSeparate the thymus lobes from one another and the lower chest wall by separating the connective tissue with the curved needle; the transverse aortic arch and two carotid arteries will be clearly visible at this point.\nPlace the curved needle under the arch and perforate between the vessel wall and connective tissue on the other side by pushing the curved head out.\nUsing the curved needle, pull the 6-0 monofilament suture under the aortic arch.\nPlace the spacer in the loop and fix the suture in place with a double-knot. Remove the spacer gently.\nConfirm a successful constriction with the knot position and cut the ends of the suture.\nClose the chest wall using 6/0 silk suture with a simple interrupted suture pattern. Close the skin with a 6/0 monofilament suture in a continuous suture pattern.\n4. Post-operative Care\nApply povidone-iodine solution to the suture site and place the animal in a pre-warmed cage for recovery and post-operative monitoring.\nInject buprenorphine (0.05 - 0.1 mg/kg s.c. every 12 h) after the animal has regained consciousness to relieve pain and provide the mouse with appropriate soft food.\nReturn the animal to a 12-h light/dark cycle room after full recovery.",
    "5. Echocardiography: Confirmation of Successful Ligation and Measurements\nAfter one week, anesthetize the previously banded mouse with 3 - 5% isoflurane, for induction, and 1 - 1.5%, for maintenance, with a 1 L/min oxygen flow rate.\nRemove the chest hair using depilatory cream. Thoroughly remove the cream with warm water and a cotton applicator.\nSecure the mouse in the supine position to the animal-handling platform, maintained at 37 °C. Apply electrode gel to the paws and tape them to the pad with electrodes.\nApply ultrasound gel to the mouse chest. With a 40-MHz MS550D probe and a high-frequency ultrasound system, perform color Doppler and pulsed-wave Doppler scanning on the left and right carotid arteries, as well as on the aortic arch.\nUsing B-Mode, locate the left ventricle. Using M-Mode, the systolic and diastolic wall thickness can be measured. Use Cine Store and Frame Store to save data and images as required.\nUsing B-Mode, locate the left common carotid artery before the branching point. Use pulsed-wave and color Doppler to evaluate the flow. Repeat with the right carotid artery at a similar point. Save the images in Cine Store and Frame Store modes to analyze later.\nTilt the animal-handling platform to the far left so that the mouse is in the left decubitus position. Place the probe on the mouse, 30° offset from a position parallel to the head at the parasternal position, and manipulate X and Y to find the aortic arch.\nLocate the constriction. Use color Doppler mode to make the site of the constriction more visible, as blood will be flowing through a narrow channel between the point where the two carotid arteries branch out from the aortic arch.",
    "Use pulsed-wave and color Doppler to measure the peak flow velocity. Use Cine Store and Frame Store to save data and images as required.\nAllow the animal to recover on a heating pad in the prone position. Return the animal to the original cage in a 12-h light/dark cycle room after it has fully recovered from anesthesia.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}