{
  "id": 9253,
  "origin_website": "Jove",
  "title": "A Novel Method of Drug Administration to Multiple Zebrafish (Danio rerio) and the Quantification of Withdrawal",
  "procedures": [
    "All procedures and behavioral testing were approved by MacEwan University’s Animal Research Ethics Board under protocol number 06-11-12, which is in compliance with the Canadian Council for Animal Care’s guidelines for the care and use of experimental animals.\n1. Prepare Dosing Tanks, Solutions, and Administration Schedule\nPrepare an administration schedule such that the animals are dosed in the same environment and during the same time of day to avoid any confounds of time or biasing to visual stimuli.\nObtain as many identical, 1.5 L, clear polypropylene spawning tanks as necessary for the number of group sizes. Use groups of 8 fish per tank, which allows for 2 groups of fish to be tested per day later on in the procedure (see step 3). Use one holding tank and one dosing tank per group (2x total number of groups).\n\t\nPlace 400 µm spawning inserts in all holding tanks. Fill the tanks with habitat water or reverse osmosis water at the correct temperature (for zebrafish, 25-28 °C) that is consistent with the temperature fish are normally housed at.\n\t\tNOTE: There can be undesired chemical interactions between some drugs and the chemical components of buffered habitat water. In this situation, use reverse osmosis water buffered with minimal or no aquarium salts for drug administration, as well as for the control groups.\nEnsure that the tanks are in a neutral environment to avoid conditioning fish to external visual stimuli during dosing.\nPrepare the drug solution. Mix the appropriate amount of the drug with habitat water in the spawning tanks. Prepare the 0.2% ethanol solution by combining 3 ml of a high grade ethanol (95% non-denatured ethanol) with 1,497 ml of water. Prepare the 1.4% ethanol solution by combining 21 ml of ethanol with 1,479 ml of water.\n2. Netting Fish and Ethanol Administration Procedure",
    "Carefully net fish from their habitat tanks and transfer into the appropriate holding tank containing the spawning insert. Ideally, house the fish in the spawning insert to eliminate netting altogether.\nWith all fish in their respective holding tanks, gently lift the spawning insert out of the holding tank and place it into the appropriate drug solution tank (Figure 1A).\n\t\nRecord the dosing time as required. Use 30 min in the ethanol solution for the procedure described here.\nIf possible, have assistants help with the transfer of all experimental groups to the drug solution simultaneously to ensure precise dosing time. Alternatively, transfer one group at a time and keep track of individual groups’ dosing times (Figure 1A).\nAt the end of the requisite dosing period, remove the fish from the ethanol solution by carefully lifting the spawning insert out of the drug solution and placing gently back into the holding tank.\nGently net the fish in the holding tanks and place them back into their habitats until the next scheduled dosing time, or place the spawning insert back into the holding tank to eliminate netting.\nAs mentioned previously, if possible within the parameters of animal housing equipment, house the animals in the same tank and spawning insert that is used as the holding tank. This will eliminate netting altogether during the administration procedure.\n3. Behavioral Testing\nObtain a light/dark arena 9.5 cm wide by 55 cm long and 9.5 cm deep with a white waterproof floor (Figure 1B). Affix white and black waterproof non-reflective paper to the inside walls of the arena using velcro, with half of the arena covered in white and half covered in black. Fill the arena to a depth of 5 cm with habitat water at a temperature of 25-28 °C. Maintain this temperature throughout testing.",
    "Minimalize external visual stimuli by constructing a white three-sided enclosure for the arena to be situated in. Ensure the testing area has diffuse overhead lighting that does not cause reflections on the water surface, yet is sufficiently bright for the movement tracking software, or post-hoc manual quantification from video images.\nPlace the arena in the enclosure and set the recording and movement analysis parameters of the behavior tracking software. Set the trial duration to 5-15 min, depending on the research question.\n\tNOTE: Here, we used 5 min.\nTransport the group of fish to be tested to the research area in the habitat tank and place them outside of the arena enclosure. Acclimate the fish for 10 min.\nGently net a fish from the appropriate group and place in the center of the light/dark arena, being sure to release the fish when it is positioned parallel to the long axis of the arena to avoid biasing the fish to the light or dark zone.\nBegin recording behavior immediately after the animal is released. Watch for any software problems with tracking the fish or for fish jumping or freezing. Rotate the arena 180° after half of the subjects have been tested to prevent any confounds due to biases resulting from which end of the arena is oriented toward the open end of the enclosure.\nAfter the trial has ended, gently net and remove the fish from the arena to a holding tank or habitat tank.\n4. Analysis",
    "Examine time spent in light versus dark zones. For each group and each fish, obtain the relative time spent in the light and dark zones and analyze using a one sample t-test (or Wilcoxon signed rank test for nonparametric data; difference from (half of the total trial time) 150 sec) to determine if groups significantly prefer one area over the other.\nTo compare preferences, calculate a preference index by subtracting the time spent in the light zone from the time spent in the dark zone and compare differences between groups. t-tests can be used to compare two groups. Compare multiple groups with a one-way analysis of variance utilizing Tukey’s HSD post hoc test where necessary (or Kruskal-Wallis test with Dunn’s multiple comparison post hoc test for nonparametric data).\nCompare velocity, number of zone transitions, meandering, and immobility across groups. Use one-way analysis of variance utilizing Tukey’s HSD post hoc test where necessary (or Kruskal-Wallis test with Dunn’s multiple comparison post hoc test for nonparametric data).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}