{
  "id": 8419,
  "origin_website": "Jove",
  "title": "Real-Time fMRI Brain Mapping in Animals",
  "procedures": [
    "This study was performed in accordance with the German Animal Welfare Act (TierSchG) and Animal Welfare Laboratory Animal Ordinance (TierSchVersV). The experimental protocol described here was reviewed by the ethics commission (§15 TierSchG) and approved by the state authority (Regierungspräsidium, Tübingen, Baden-Württemberg, Germany).\n1. Preparing the BOLD-fMRI experimental set-up for small animal study\nTurn on the console software to control imaging parameters and acquire MRI data.\n\tNOTE: The proposed real-time fMRI set-up is implemented utilizing macro-functions of the console software (version 6) in parallel with the image processing functions of AFNI.\nFind MR sequences (i.e., Position, Localizer, Rapid Acquisition with Relaxation Enhancement (RARE), and 3D echo-planar imaging (EPI) with the workspace explorer, and then drag and append them in the scan list.\n\tNOTE: Position and Localizer sequences are used to identify a region of interest (ROI) in a brain. A RARE sequence is used for an anatomy scan. A 3D EPI sequence is used to measure dynamic BOLD responses.\nPlace the predefined macro scripts, “Setup_rt3DEPI” and “Feed2AFNI_rt3DEPI” in the macro script path (e.g., “/opt/(PV version)/prog/curdir/(user name)/ParaVision/macros”). Activate the 3D EPI reconstruction options, “Pre Image Series Activities” and “Execute Macro” in the “Data Reconstruction” user interface menu, and then link the predefined macro script, “Setup_rt3DEPI”, before clicking the “Scan” button.\n\tNOTE: The macro scripts are included in the Supplementary files.\nInstall the AFNI software for the real-time BOLD-fMRI analysis and visualization.\n2. Catheterization and ventilation surgery\nSet up a ventilator and physiological status monitoring systems such as thermometer, blood pressure and respiration recording as shown in Figure 1. Set a constant frequency of 60 ± 1 breath/min with the ventilator and a temperature of 37 °C using an MR-compatible heating pad with a feedback control set.",
    "Anesthetize an adult male Sprague-Dawley rat (300-600 g) in a chamber with 5% isoflurane for induction and deliver 2-2.5% isoflurane for surgery from a vaporizer. Check the depth of anesthesia by pinching the hindpaw and confirming the lack of a withdrawal response.\nIntubate the animal with a 14 G plastic cannula for ventilation (60 ± 1 breath/min with a mixture of 70% air and 30% oxygen). Adjust end-tidal carbon dioxide (CO2) to be in the range of 25 ± 5 mmHg29.\n\tNOTE: The intubation is critical for maintaining proper CO2 levels through fMRI experiments.\nPlace the animal in a supine position on a surgery table and shave a thigh with an electric razor. And then, make an incision on the shaved skin with surgical scissors.\n\tNOTE: The length of the incision is around 1-2 cm in a longitudinal direction.\nFind a femoral artery and vein under the incised region for catheterization and separate the individual femoral artery and vein from the surrounding tissues.\nFasten one side of the separated femoral artery with a surgical suture and hold the other side with micro bulldog forceps. Then, make a small incision between the tied regions on the femoral artery.\nInsert a catheter into the femoral artery through the small incision and tie the catheter and the artery together with surgical sutures. Monitor the arterial blood pressure constantly with the physiological monitoring system to be in the range of 80-120 mmHg and measure the arterial blood gas regularly to maintain pO2 of minimum 90 mmHg and pCO2 of 30-45 mmHg during scanning.\n\tNOTE: This catheterization is critical for monitoring the arterial blood pressure during fMRI experiments.",
    "Fasten both ends of the femoral vein with silk braided surgical sutures. Then, make a small incision between the tied regions on the femoral vein. Use forceps to perform the suturing.\n\tNOTE: The size of the suture is around 1-2 cm.\nInsert a catheter into the femoral vein. Tie the catheter and the vein together with surgical sutures.\n\tNOTE: This catheterization is critical for administrating alpha-chloralose through the vein and adjusting the anesthetic levels during fMRI experiments. If the animal is not well anesthetized, it will start to breathe spontaneously. In this case, more alpha-chloralose must be administrated to avoid respiratory motion artifacts.\nSuture the surgical incision on the shaved skin. Once the surgical procedures are completed, keep the animal anesthetized by infusing a bolus of alpha-chloralose with the dosage of ~80 mg/kg through the catheter connected to the femoral vein and stop isoflurane administration at the same time.\n3. Placing the animal inside the MRI scanner\nTransfer the anesthetized animal to the MRI scanner as soon as 2.10 step is done and secure it on a custom-made cradle.\nInsert a real-time feedback rectal thermometer on the animal to monitor the animal’s temperature. Place a heating pad under the animal’s torso to control the temperature. Maintain the body temperature at 37.0 ± 0.5 °C during MRI scans.\nDeliver alpha-chloralose with ~25 mg/kg/h solution in a mixture of pancuronium (~2 mg/kg/h), a muscle relaxer, continuously while keeping the animal anesthetized and reducing motion artifacts in fMRI images. Monitor the blood pressure and respiration by adjusting the amount of drug and the rate of ventilation according to the physiological status.\nAdminister ophthalmic ointment on the eyes of the animal to prevent dryness during fMRI experiments. Fix the animal’s head safely with two ear bars to avoid head motion artifacts.",
    "Fix a transceiver surface coil on the head. Tune and match the coil to the Larmor frequency (e.g., 599 MHz on 14.1 T) on the head before MRI measurements.\n\tNOTE: Here, 22 mm diameter coil is used to cover the whole brain of a rat.\nInsert a pair of needle electrodes into the skin of the forepaw between digits 1 and 4 and fix them with surgical tape. And then, confirm that the stimulation works properly after connecting a stimulation input cable to these electrodes30.\nInsert the animal into the MRI bore and place it at the iso-center approximately.\n4. Measuring anatomical MR images\nClick the calibration menu button in the main user interface. Perform the calibrations of the MRI system clicking the following items in the Adjustment Platform user interface (see Help menu in the console software): Find the basic resonance frequency, Calibrate the RF pulse power, Set the optimal receiver gain, Measure the B0 map in the animal for shimming, Run global linear shims based on non-localized free induction decay (FID) integral.\n\tNOTE: This step takes less than 2 min.\nRun a Position sequence by clicking the “Scan” button to find the head location of the animal inside the MRI bore. If the head is not located at the iso-center, adjust the head location while moving the cradle back and forth until the head is located at the iso-center.\nRun a Localizer sequence by clicking the “Scan” button to identify an ROI in the head. Select Map Shim and define the ROI of the shim volume to cover the whole brain in the localizer image and then, run a high order (e.g., 2nd or 3rd order) shimming using the “Shim up to” option to reduce the main magnetic field (B0) inhomogeneities at the ROI.",
    "NOTE: The high order shimming is a critical step to improve the quality of BOLD-fMRI data when EPI sequences are used.\nRun a T2-weighted RARE sequence by clicking the “Scan” button to acquire anatomical images covering the whole brain in a coronal view (e.g., the following sequence parameters are used: repetition time (TR) 4000 ms, effective echo time (TE) 36.1 ms, matrix 128 x 128, field of view (FOV) 19.2x19.2 mm2, number of slices 32, slice thickness 0.3 mm, RARE factor 8).\n\tNOTE: In the following real-time fMRI visualization step, the anatomical images are used to register 3D EPI images as a template.\n5. Real-Time fMRI software set-up and fMRI response visualization\nOpen a terminal window and go to the real-time AFNI plugin path using the following command:\ncd /home/(user name)/rt_afni\n\tNOTE: The AFNI plugin script, “afni_rt” is included in the Supplementary files.\nExecute AFNI software with the real-time plugin using the command and options below.\nafni -rt\n-yestplugouts\n-DAFNI_REALTIME_MP_HOST_PORT=localhost:(port number)\n-DAFNI_REALTIME_Graph=Realtime\n-DAFNI_FIM_IDEAL=(Paradigm)\n\tNOTE: In the first case, the code allows external programs to exchange data with AFNI while in the second case the real-time plugin will attempt to open a TCP socket to the user-defined localhost and port. In the third and fourth cases, the codes will plot the time course of fMRI data in real-time and plot the time course of the user-defined paradigm in the fMRI time course respectively when real-time fMRI data are acquired. For further details, check https://afni.nimh.nih.gov/pub/dist/doc/program_help/README.environment.html.\nMonitor upcoming AFNI BRIK files defined by using the command “Dimon” as shown in Figure 2 with the following options:\nDimon -tr (TR of EPI) -nt (NRepetitions of EPI)\n-rt -quit\n-infile_pattern realtime*.BRIK\n-file_type AFNI",
    "NOTE: “Dimon” is a command to monitor the real-time acquisition of AFNI image files using the following options: “-rt” which executes the real-time plugin and “-infile_pattern (data name).BRIK -file_type AFNI” which allows the plugin to read the specific BRIK files and to send them into AFNI for display and formatting. For further details, check https://afni.nimh.nih.gov/pub/dist/doc/program_help/Dimon.html.\nUse “pvcmd” command with the following options:\npvcmd -a JMacroManager JMMExecuteMacro -category $USER -macro Feed2AFNI_rt3DEPI\n\tNOTE: This code exists in the macro script, “Setup_rt3DEPI”, to run the background macro script, “Feed2AFNI_rt3DEPI”, right after clicking “Scan” button for EPI acquisition.\nUse “exec pvcmd” command with the following options to get EPI acquisition parameters.\nexec pvcmd -a ParxServer -r ParamGetValue -psid $ParSpaceId -param (PVM parameters of EPI) -id 10 -args $AcqKey $ParSpaceId $ProcnoPath\nUse “exec to3d” command with the following options to convert EPI raw data to AFNI files in real-time in the background macro script, “Feed2AFNI_rt3DEPI”.\nexec to3d -omri -xFOV $FOV_X -yFOV $FOV_Y -zFOV $FOV_Z -prefix $LastVolName $ImgFormat$Path2dseq\nMake sure that EPI geometrical information is consistent with the anatomy orientation.\n\tNOTE: The “to3d” AFNI command will run automatically with the geometrical information such as the field of view (FOV) and matrix size to convert the fMRI raw data into one AFNI BRIK data whenever each 3D volume data is stored after every single TR as shown in Figure 2. The image orientation can be changed with the geometrical information parameters of “to3d”. For further details, check https://afni.nimh.nih.gov/pub/dist/doc/program_help/to3d.html.\nTurn on an electrical stimulus isolator and perform electrical forepaw stimulation for one evoked fMRI study (e.g., 3Hz, 4s pulse width 300us, 2.5mA) using stimulation blocks.\n\tNOTE: Here, the block-design paradigm consists of 10 pre-stimulation scans, 3 stimulation scans and 12 inter-stimulation scans (15 scans per epoch).",
    "Run a T2*-weighted 3D EPI sequence by clicking the “Scan” button for the BOLD-fMRI study (e.g., the following parameters are used: TR/TE 1500/14 ms, matrix 64 x 64 x 32, FOV 19.2 x 19.2 x 9.6 mm3, and resolution 300 x 300 x 300 µm3).\n\tNOTE: As soon as clicking the “Scan” button, monitoring, and processing raw data will be done by using the predefined macro scripts in real-time. Once one AFNI BRIK dataset is converted, voxel-wise time course graphs for 3D EPI images are displayed in the AFNI software and automatically updated for every single TR.\nTo overlay the EPI images on top of the anatomical RARE images, convert the RARE images to an AFNI BRIK dataset using the command “to3d” as in step 5.6, then register the EPI images to the anatomical images using the “align_epi_anat.py” AFNI script with the following options:\nalign_epi_anat.py -anat anatomy_template_al+orig -epi epi.$(epi data number)+orig -epi_base 1 -suffix _volreg -rat_align -cost lpa -epi2anat\n\tNOTE: For further details, check https://afni.nimh.nih.gov/pub/dist/doc/program_help/ align_epi_anat.py.html.\nTo process functional maps of the BOLD responses, calculate the deconvolution of 3D+time dataset with a specific stimulus time series using the “3dDeconvolve” command with the following options:\n3dDeconvolve -input (input file name)+orig. -nfirst 0 -polort 3 -num_stimts 1 -stim_times 1 (stimulation paradigm file name) 'BLOCK(4,1)' -stim_label 1 forepaw -tout -fout -rout\n\tNOTE: Image processing steps such as spatial smoothing or temporal filtering have been incorporated into a customized AFNI data processing script. For further details, check https://afni.nimh.nih.gov/afni/doc/help/3dDeconvolve.html.\nTo visualize functional maps of the BOLD signals, use an interactive clustering in the AFNI software. Open the “Define Overlay” option and use the “Clusters” function from the AFNI user interface menu.\nAfter the last fMRI scan, take the animal out of the MRI scanner and euthanize it according to the approved protocols.",
    "NOTE: Image processing functions of AFNI and macro-functions in the latest console software were used to process the real-time fMRI data. Detailed information and descriptions of macro-functions can be found from the help menu in the console software. The AFNI software is a freeware, that can be directly downloaded through the NIMH-AFNI website. The related scripts to build the linkage between AFNI and the console system are attached.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}