{
  "id": 7697,
  "origin_website": "Bio",
  "title": "Collection of Xylem Exudates from the Model Plant <em>Arabidopsis</em> and the Crop Plant Soybean",
  "procedures": [
    "Place seeds (less than 25 mL to facilitate washes) in 50 mL centrifuge tubes and add approximately 40 mL of 70% ethanol to wash the seeds by inverting gently for 1 min.Rinse the seeds with distilled water five times.Place soft wet paper on plastic square dishes and arrange the seeds on the paper (approximately 25 seeds/dish) (Figure 2A).Cover the seeds with wet, soft paper and place a lid on the dishes to maintain higher humidity (Figure 2B).Incubate the seeds in the square dishes under a 16 h light (200 µmol/m2s PPFD)/8 h dark cycle at 23 °C for two days.Select healthy seedlings (e.g., relatively long roots, greening cotyledon) and transplant them into vermiculite in plastic pots.Place the pots in a growth chamber [16 h light (900 µmol/m2s PPFD)/8 h dark, 23 °C, and humidity not controlled] or greenhouse and supply a sufficient amount of nutrition solution. The frequency of solution application depends on the plant age, conditions, and weather (in the case of a greenhouse).Approximately seven weeks after germination, cut the hypocotyls or lower internodes (first or second internodes from hypocotyls) with garden shears (Figure 2C, D). The hypocotyls and the lower internodes are too hard to cut with a razor blade.Wash the cut surface with distilled water by dripping water on the surface.Allow the cut stem to leak exudates for 20 min to avoid contamination from phloem sap.Wipe the cut surface and the side of the stem with soft paper and wrap the stem just beneath the cut surface with clay (make a clay ring around the stem) (Figure 2E). Note that the droplets on the side of the stem prevent clay from sticking to the stem; therefore, the droplets need to be completely wiped off.",
    "Place and press a silicon tube into the clay to avoid leakage of xylem exudates (Figure 2F). The gap between the stem and tube should be sealed with clay.Collect xylem exudates using a syringe with a flat needle or micropipette. The exudates can be sampled at 20–30 min intervals.Clay particles sometimes contaminate the exudates. To remove them from the xylem exudates, centrifuge at 2,600 × g for 10 min (and optimally at 4 °C) and transfer the supernatant to a new tube.Store the xylem exudates at -80 °C.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4520/bioprotoc-12-19-4520-g002.jpgFigure 2. Collection of xylem exudates from soybean.(A) Soybean seeds were arranged on soft wet paper in a plastic square dish. (B) The seeds were covered with wet paper, and a lid was placed on the dishes. (C) Lower internodes (1st or 2nd internodes from the bottom) of soybean. The plants were grown in a growth chamber (PPFD = 900 µmol/m2s). (D) Hypocotyl or lower internodes were cut with garden shears. (E) The stem just beneath the cut surface was wrapped with clay. (F) A silicon tube is pressed onto the cut stem, and xylem exudates accumulate in the tube. (G) From cutting the internodes to the fitting of a tube (C–F), it takes less than 1 min per plant, so this method is applicable to collecting xylem exudates from a large number of plants for comprehensive analysis."
  ],
  "subjectAreas": [
    "Plant Science",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}