{
  "id": 13492,
  "origin_website": "Jove",
  "title": "Establishment of Larval Zebrafish as an Animal Model to Investigate Trypanosoma cruzi Motility In Vivo",
  "procedures": [
    "The following protocols were approved by the Institutional Animal Care and Use Committee of Los Andes University (CICUAL). Biosafety level 2 (BSL-2) guidelines should be strictly followed to prevent contamination with the pathogen T. cruzi.\nNote: Animal care and maintenance: Casper zebrafish, a genetically modified strain of zebrafish (Danio rerio) is used in this protocol due to their valuable optical transparency in all developmental stages. Fish are manipulated using optimal care conditions for the species14, in a 14 h light-10 h dark cycle, at 28 ± 1 °C, in a pH (7.0-7.4) controlled multi-tank recirculating water system. Animals are fed twice a day with live brine shrimp (Artemia salina) and enriched with rearing food. All protocols were approved by CICUAL at Universidad de los Andes (C.FUA_14-017).\n1. Preparation of Egg Water\nPrepare 0.6 g/L aquarium salt in reverse osmosis (RO) or deionized (DI) water and add 0.01 mg/L methylene blue to the solution.\n\tNote: The measured conductivity should be of 400-500 µS/cm and pH level at 7.2-7.9. To lower the pH, aerate the egg water for a few hours.\n2. Preparation of Tricaine Stock Solution\nPrepare 0.4% tricaine stock solution by dissolving 400 mg tricaine (MS-222) in 97.9 mL distilled water (ddH2O). After the powder has completely dissolved, adjust the pH to 7.0 using 2.1 mL 1M Tris (pH 9.0) and refrigerate the solution.\n3. Preparation of 1.0% Low Melting Point Agarose\nDissolve the low melting point agarose powder in egg water to a final concentration of 1.0%. Heat the mixture in a microwave or on a hot plate with continuous stirring until the agarose solution appears homogeneous.\nStore the aliquots at 4 °C for no longer than a week.\n4. Mating Assay and Embryo Collection",
    "Three days prior to injections set up matings using healthy pairs of male and female fish in breeding tanks. Enrichment with glass marbles and artificial plants enhances spawning. Matings should be set up during the afternoon and left overnight.\nThe next morning, collect the spawned eggs by draining the tank through a strainer and washing the eggs with the egg water. Remove all the eggs by inverting the strainer and pouring egg water through the strainer into a Petri dish. To keep the embryos healthy, clean their water by removing any debris and dead embryos with a transfer plastic pipette.\nTransfer the embryos to an incubator at a stable temperature of 28.5 °C to allow development of the embryos according to the zebrafish staging standards15. Examine the embryos two times a day, and discard inviable eggs to keep the clutch healthy.\n5. Embryo Dechorionation\nNote: This procedure is required if the embryos have not hatched at the time of injection. In this procedure, \"larvae\" are animals out of their chorion from 48 h post fertilization (hpf) onward.\nOn the day of the experiment, place the Petri dish containing the healthy embryos under a dissecting stereoscope.\nGrab opposing ends of the chorion with two sharp forceps (Dumont #5), and gently tear and pull open the chorion. About 5-6 larvae are injected at a time, and typically 3-4 are imaged.\nRemove the chorions from the water using a transfer pipette.\n6. Preparing Injection Material",
    "Prepare 1.0 mm needles using thin wall glass capillaries and a micropipette puller device with the following settings: 2 light weights + 1 heavy weight, 2 mm top pull + 5 mm bottom pull, 75.9 °C (Step 1) + 78.2 °C (Step 2). Store needles in a Petri dish on a strip of modeling clay. The ideal needle should have a narrow tip, as T. cruzi measure approximately 20 x 1-3 µm and will pass through the needle easily. The length of the tip can vary: a longer tip is useful to reach deeper structures, but a shorter tip will be more rigid making injection easier for the user.\n\tNote: The needle tip size depends on the temperature used: a higher temperature for Step 2 results in a longer and finer tip.\nPrepare a 1.5% agarose solution in ddH2O and pour it into a 10 cm Petri dish. Cover a depth of approximately 1.0 cm.\nPlace a prefabricated microinjection mold over the agarose and allow it to solidify.\nLift the prefabricated microinjection mold out and add egg water for storage at 4 °C. This prevents the agarose from drying out.\nAdd egg water to the tricaine stock solution to a final concentration of 150 mg/L. Store at 4 °C.\n7. Cell Culture for Parasite Growth\nParasites are maintained in a human astrocytoma cell line (CRL-1718) using the method described by Vargas-Zambrano et al.16",
    "Start the culture of human cells in a T25 culture flasks (surface area = 25 cm2) at a density of 2 x 105 or 4 x 105 cells in 4 mL of RPMI-1640 medium with 10% of fetal calf serum (FCS), supplemented with 2 mM L-glutamine, 4.5 g/L glucose, 10 mM HEPES, 1 mM pyruvate, and 1% penicillin-streptomycin (referred as \"complete media\"). Incubate the astrocytoma cultures at 37 °C in a 5% CO2 environment.\nOnce a monolayer is confluent, detach the cells using 2 mL of 0.25% of trypsin-EDTA by incubating them for 3 min at 37 °C. Visually check cells for detachment, and block the trypsin solution using 3 mL of RPMI-1640 with 10% FCS in a 15 mL tube.\nCentrifuge the cell suspension for 5 min at 1,350 x g.\nWash the resulting cellular pellet in DMEM medium in a 15-mL tube and centrifuge for 5 min at 1,350 x g at 22 °C.\nCount the cells manually in a Neubauer chamber and check for viability in a light microscope at 40X magnification.\nGently re-suspended the cellular pellet in 4 mL of complete media and use it to create new cell cultures using 2 x 105 cells per T25 culture flask.\n8. T. cruzi Culture and Labeling\nParasites are a strain originally obtained from an infected human and characterized as T. cruzi DA strain (MHOM/CO/01/DA), genotype Discrete Typing Unit (DTU) TcI16. After 3 or 4 days of culturing, collect the moving parasites from the human astrocytoma cell culture supernatant and centrifuge for 5 min at 1,350 x g. Discard the medium.\n\tNote: Parasites in complete medium can be used for re-culture in a 1:1 ratio with astrocytoma cells in T25 culture flasks.",
    "Gently re-suspend the pellet in 10 mL sterile 1x Phosphate Buffer Saline (PBS) with 0.1% FCS and centrifuge for 5 min at 1,350 x g.\nDiscard the supernatant and re-suspend in 1 mL of PBS. Take 10 µL for counting the free-swimming parasites in a Neubauer chamber.\nTake the rest of the re-suspended parasites (990 µL) and add 1 µL of Carboxyfluorescein Diacetate Succinimidyl Ester (CFSE), final concentration 5.0 µM. Incubate for 10 min at room temperature.\n\tNote: CFSE stock at 5 mM should be aliquoted and maintained at -20 °C.\nPellet the parasites (1,350 x g, 5 min). Reconstitute the parasite pellet by flicking the tube and wash in 10 mL of 1x PBS-0.1% FCS followed by a subsequent spin (1,350 x g, 5 min).\nDiscard the supernatant and gently re-suspend the labeled parasite pellet in 1X PBS with the appropriate volume to obtain a final concentration of about 10-20 parasites/nL for injection.\nUse a small volume (∼10 µL, approximately 1 x 104 -2 x 104 parasites) of trypomastigotes to assess viability and labeling. An inverted fluorescence microscope can be used for direct visualization of the parasites. In the transmitted light mode, check that the parasites move. In the fluorescence mode, use the Fluorescein Isothiocyanate (FITC) filter to assess parasite labeling.\n9. Injecting Zebrafish Larvae\nParasite loading\nTake 10 µL of parasites from the resuspension (100 µL) and load them into the sealed glass needles using a 10 µL microloader pipette tip.\nInsert the glass needle into the needle holder of the micromanipulator, use a magnetic stand, and place next to the stereoscope.",
    "Using fine forceps under the stereoscope, cut the needle creating a blunt open end and measure the drop size to obtain an injection volume of 1 nL (this is equivalent to a bead diameter of 0.12-0.13 mm when measured in mineral oil17). A longer tip is preferred so that the needle can reach structures deep inside the fish without damaging the tissue. In this protocol, a blunt needle is used, but a beveled needle can be used as well.\nMounting\nAnesthetize larvae of 48 hpf, with 150 mg/L tricaine. Check that they do not respond to touch, but ensure that the heart is beating.\nPlace the larvae in the microinjection agarose mold in a lateral position.\nPlace the needle holder next to the stereoscope and adjust the micromanipulator so that the tip of the needle is in the center of the field of view. Move the Petri dish prepared in steps 6.2- to 6.4 so that the larval yolk is close to the needle tip. Check the condition of the larva to ensure that the heart continues beating.\nSet the microinjector values as follows: injection pressure 9.6 pounds per inch (psi); hold pressure: 20 psi; 100 ms range of gating; period value of 1.9 (corresponds to 10.9 ms). The volume of the injection should be between 1-3 nL, with approximately 10-20 parasites/nL.\n10. Injection of the Parasite\nInject the fish in the superior-anterior portion of the yolk at the duct of Cuvier. This step should be practiced to ensure animal survival after injection. It takes approximately 10 min to inject 5-6 larvae successfully.\nAs a control, inject 1-2 larvae with the same vehicle volume (1x PBS).\nTransfer the larva to fresh egg water immediately.\n11. LSFM Mounting of Injected Larvae",
    "Transfer the larva injected with parasites to an empty Petri dish and carefully remove the surrounding water with a plastic pipette and absorbent paper. Immediately add 100 µL of preheated 1.0% low melting point agarose (refer to step 3 for agarose preparation) to cover the larva. Ensure the agarose is not over 40 °C.\nInsert a straight wire inside a 1.0 mm glass capillary and use it as a plunger to suck up the larva in a vertical position. Make sure to leave a small amount of agarose above the larva. Wait until the agarose solidifies before exposing the larva (this will require a few minutes). If necessary, push out excess agarose below the larva and cut it off.\nPlace the capillary in the microscope sample holder and push out the end containing the larva until it hangs free from the capillary. The specimen chamber should be filled with tricaine solution (150 mg/L) and the temperature set at 28 °C.\nPosition the larva in front of the pupil of the detection objective using an XYZ-micromanipulator system. For rotations about the vertical axis, use a rotation stage. Positioning of the larva should be done in transmitted light mode to clearly identify larval structures.\n12. LSFM Imaging of Injected Parasites\nChange to fluorescence mode and adjust the illumination intensity as well as the exposure time to decrease photodamage and optimize time resolution. For these particular experiments, we used a power of 2.8-3.0 mW for the sample and exposed each frame for 200 ms using a camera with 6.45 µm pixels and ~70% quantum efficiency at the detection wavelengths. These settings should result in adequately exposed images at about 5 frames/s. Make sure to use an objective with the highest possible numerical aperture.",
    "Start a video acquisition of the region of interest (ROI). In our case, parasites are observed attached to valves and freely moving around the heart area. It is recommended to take a video of a single plane over time, or to use the micromanipulator or piezo-galvo system to focus different planes while the parasite moves.\n\tNote: This procedure is useful for short acquisition times of up to 2 h. For long term acquisition, the larvae should be mounted using alternative methods20.\n13. Image Processing and Analysis of Acquired Data\nNote: Image processing was performed on a personal computer with a 2.90 GHz processor, 8.00 GB of memory, and a videocard with 1.00 GB of memory.\nOpen the acquired dataset in the image processing software of choice. The open software FiJi is recommended for LSFM data processing and analysis21.\nIn the image analysis software, adjust brightness and contrast levels to enhance the images.\n\tNote: No fixed parameters are used in this case, but selecting the \"Auto\" option can be useful to obtain an initial enhancement.\nSelect the ROI.\n\tNote: For tracking individual parasites, FiJi has both manual and automatic tracking plugins available.\n14. Recovering Imaged Larvae\nRemove the larva carefully from the agarose using fine forceps and a hair loop tool. Transfer the fish back to fresh egg water and check for recovery after 15 min. Return the larva to incubator at 28 ± 0.5 °C.\nAlternatively, proceed to euthanize the imaged larvae with an overdose of tricaine. Then, introduce the larvae in a solution of sodium hypochlorite (6.15% NaClO) for 5 min to kill the parasite. Dispose according to the institution's standard protocols."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}