{
  "id": 4491,
  "origin_website": "Bio",
  "title": "Protocol for Biotin Bioassay-based Cross Feeding",
  "procedures": [
    "Preparation of biotin bioassay plates   The biotin assay plates were prepared as previously described with few changes, one of which referred to the thinner thickness of the plate agar where we dropped paper discs (Feng et al., 2013b; Lin et al., 2010).     Overnight cultures of strain ER90 (grown in 6 ml of defined M9 minimal medium with 1 nM biotin at 30 °C) were collected by centrifugation (3,600 rpm, 16 min), washed three times with the same volume (6 ml) of M9 medium, and were cultivated at 37 °C to 0.8 OD600 in 200 ml of M9 minimal medium containing 1 nM biotin.    To remove excess of biotin, all the bacterial cells from 200 ml culture were washed twice in M9 media and sub-cultured into 1 L of M9 minimal medium at 37 °C for 5 h to de-repress expression of bio operon by starvation for biotin.     The bacteria were harvested by centrifugation (3,600 rpm, 16 min), washed three times with M9 medium, re-suspended in 1 ml of the same medium and mixed into 150 ml of the defined M9 agar media supplemented with 0.01% (w/v) TTC as a redox indicator.    Finally, the mixture (5 ml per sector) was poured into Petri dishes sectored with plastic walls to avoid cross-feeding and a sterile paper disk (6 mm, BBL) was centered on the agar top of each sector.      Preparation of cross-feeder strains   In total, four feeder strains of A. tumefaciens corresponded to NTL4 (WT), FYJ283. (ΔbioBFDA), FYJ212 (ΔbioRat) and FYJ341 (ΔbioR::Km+bioRbme).    The biotin auxotroph strain FYJ283 was cultivated in 5 ml of M9 medium supplemented  with 1 nM biotin, whereas the other three strains were cultivated in 5 ml of biotin-free M9 minimal media overnight.",
    "Overnight cultures were collected by centrifugation (3,000 rpm, 10 min), washed three times using the M9 liquid medium, and transferred into 100 ml of biotin-free M9 media for 6 more hours of growth at 30 °C to deplete trace amounts of intracellular biotin in the biotin auxotroph strain FYJ283.   Following three rounds of washing with same media, bacteria were resuspended in M9 media and their optical densities at 600 nM (OD600) were adjusted to 1.5. 20 μl of A. tumefaciens culture (OD600 = 1.0) was spotted on the paper disc, and incubated overnight at 30 °C.   Finally, the red deposit of formazan (Lin et al., 2010; del et al., 1979; Feng et al., 2014) suggests that the indicator strain ER90 is fed by the A. tumefaciens strains (seen in Figure 1), and the area size (square centimeters) of formazan represents the level of biotin pool produced by the different feeder strains.    imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140913/20140913215310_4994.jpg Figure 1. A representative photograph illustrating the relevance of BioR-mediated regulation to biotin synthesis. It was fully adapted from Feng et al. (2013a). Four A. tumefaciens strains cross-feed E. coli strain ER90 with deletion of full bio operon, which are NTL4 (WT), FYJ283 (ΔbioBFDA), FYJ212 (ΔbioRat), and FYJ 341 (ΔbioRat+bioRbme), respectively."
  ],
  "subjectAreas": [
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}