{
  "id": 12377,
  "origin_website": "Jove",
  "title": "Simultaneous Transcranial Alternating Current Stimulation and Functional Magnetic Resonance Imaging",
  "procedures": [
    "Conduct all experiments in accordance with institutional ethics committee guidelines. For all studies mentioned in this manuscript, all procedures were performed according to the declaration of Helsinki and approved by the local Ethics Committee of the University Medical Center Göttingen.\n1. Stimulation and Computer Setup Prior to Experiment\nStimulator setup\n\tNOTE: The stimulator used for this fMRI experiment is a specially designed magnetic resonance (MR)-compatible system equipped with an MR-safe inner filter box, an outer filter box, safety resistors, coupled cables, and MR-safe materials. Some instructions pertain specifically to the manufacturer's directions, and these may vary when using another stimulator, so take care to follow equipment instructions provided by the manufacturer that may constitute exceptions to this setup. Figure 1A shows the stimulator components used in this experimental setup.\n\t\nNavigate through the menu of the stimulator to program the desired experimental parameters (refer to user's manual for details). For example, for a stimulation frequency of 10 Hz, program 10 cycles for ramp-up/down time of 1 s, 300 sinusoidal cycles for 30 s of stimulation, current strength equal to 1,000 µA, and repetitive trigger mode, as conducted for our experiments unless otherwise noted. Save the program to load for each time the experiment is run thereafter.\nConnect the stimulus presentation computer trigger output to the stimulator using a BNC cable.",
    "Place a nonmagnetic, shielded local area network (LAN) cable through the radio frequency (RF) waveguide tube from the inside of the scanner room. To avoid resonant capacitive coupling, ensure that the cable is free from loops and placed along the wall of the room, leading to the rear of the magnet bore and along the right-side scanner bed railing inside the bore, leading to the position of the inner filter box (see Figure 1C and safety note in Step 2.4 regarding cable position). Secure the cable with tape placed intermittently along the length of it.\nLoad the visual stimulus program on a designated presentation computer that is separate from the scanner control computer. As depicted in Figure 1C, connect the presentation computer to the scanner trigger output via an optical-to-electrical converter and to an output device (i.e., projector) that is placed in a shielded case or outside the magnet room. Use nonmagnetic mirrors to direct the projection onto a screen inside the scanner bore.\n2. Subject Arrival and Preparation\nPre-screen recruited subjects for any contraindications for MR scanning (e.g., no metal implants, no claustrophobia, experiment-specific subject prerequisites) as well as for tACS (e.g., history of seizures, chronic headaches, pregnancy)26,27.\nWhen the subject arrives, instruct the subject about the fMRI experiment details and describe the experience to expect (e.g., visual stimulus, tingling or phosphenes from tACS, special task instructions).\nPlace electrodes according to the 10-20 EEG system and stimulator preparation.\nUsing a tape measure, measure the distance on the subject's head from the nasion to the inion, and from ear-to-ear, over the top of the head. The intersection of both lengths gives the position on the head for Cz, according to the 10-20 EEG system. Mark the spot for Cz on the scalp using a marker.",
    "Place an EEG cap without electrodes on the subject's head, with Cz aligned to the mark on the subject's scalp, determine the desired location of the electrodes and mark them.\n\t\tNOTE: It is important that all experimenters use the same placement system to ensure consistency through all experiments; the 10-20 EEG system, which is commonly used in transcranial stimulation experiments, has specific guidelines to maintain accurate electrode placement26,28.\nUsing alcohol and cotton pads, clean the hair and skin on and around the marked spots on the subject's scalp; remove oils and hair products.\nSpread some gel on the rubber electrodes and press each electrode firmly on the marked and cleaned locations on the subject's scalp, ensuring full contact from electrode to conductive gel to the scalp with minimal impedance.\nUsing a spare shielded LAN cable, connect the filter boxes and MR-safe cables to the stimulator and to the rubber electrodes as depicted in Figure 1A.\nTurn on the stimulator and test the impedance (refer to user's manual for details). If the impedance is not below 20 kΩ, press the electrodes on the scalp or add electrode gel as necessary until this impedance guideline is met.\nWhen the impedance is below 20 kΩ, allow the stimulator to output current for a few seconds to familiarize the subject with the sensory experience. Ask the subject about sensory perception during this test, including whether tingling sensation exists and can be withstood, and extent or location of phosphenes during stimulation.\nAt this point, the subject is prepared to move to the scanner bed. Leaving the electrode cable plugged into the rubber electrodes on the subject, disconnect the stimulator, the spare LAN cable, and the outer and inner filter boxes.",
    "Connect the outer filter box to the LAN cable that runs through the waveguide to the MR scanner, leaving as little exposed LAN cable outside of the waveguide as possible (see Figure 1B). Connect the stimulator to the outer filter box using the stimulator cable and double-check that the stimulator is connected to the presentation computer trigger output.\nPrepare the subject inside the MR scanner.\n\tNOTE: Figure 1C shows the full tACS-fMRI setup during the experiment. It is critical to arrange the cables and inner filter box as specified, with the electrode cable arranged at an approximately 90° angle to the plane of the scanner bed and the inner filter box resting on the scanner bed railing on the right side of the scanner bore. Neglecting to do so can damage the safety circuit of the electrode cable; this configuration applies for both open and closed RF coils.\n\t\nAfter ensuring that the subject is free of magnetic materials and ready for the MRI experiment, lead the subject into the scanner room.\nGive ear plugs for hearing protection to the subject, and instruct the subject to lie on the scanner bed, placing pillows around and under the head and under the legs for comfort and to reduce movement. When placing the pillows behind the subject's head, pay special attention to lay the electrode cable flat and in a position that is comfortable for the subject to lie on for the duration of the experiment.\nGive the alarm ball and MR-safe response button box to the subject to hold such that minimal movement is required to push a button to respond in the experiment.\nSecure the RF head coil over the subject's head with a mirror attached such that the subject can see the projection screen reflected in the correct orientation.",
    "Temporarily secure the free end of the electrode cable coming from the rubber electrodes to a place in the head coil such that it does not catch when the bed is moving. Figure 1D shows the subject's head positioned in the head coil with pillows, mirror, and tACS cable in place before moving the bed to the center head coil for imaging. The filter box is also shown placed on the scanner bed railing, as an example of where it must sit relative to the head coil when the scanner bed is in measurement position.\nMove the scanner bed into measurement position. From the back end of the scanner bore, connect the electrode cable from the rubber electrodes to the inner filter box that connects to the LAN cable, as depicted in Figure 1C. To prevent excess motion during scanning, secure the cables and filter box along the scanner bed railing to the right of the bore with tape and sand bags. Place projector screen into the rear end of the scanner bore.\nTest the impedance on the stimulator once more to ensure that all connections between cables, filter boxes, and the stimulator are made properly.\n3. MR Scanning and Experiment\nBefore the scan begins, test that the presentation computer registers when the subject pushes response buttons.\nAcquire high-resolution T1-weighted anatomical data (e.g., three-dimensional turbo fast low angle shot, echo time (TE): 3.26 ms, repetition time (TR): 2,250 ms, inversion time: 900 ms, flip angle 9°, isotropic resolution of 1 x 1 x 1 mm3).\nAfter the acquisition, adjust contrast and windowing on the anatomical MRI to low and high extremes to visually detect noise during scanning that may result from the stimulator setup. Continue this visual monitoring of noise concurrently with functional image acquisition.",
    "Start the experiment on the presentation computer, ready to begin with the scanner trigger, and start the stimulator to wait for the presentation computer output trigger. Leave the stimulator on and connected throughout the fMRI experiment to avoid differences in the temporal signal-to-noise ratio (tSNR) between stimulator on and off conditions22.\nStart the fMRI scan (e.g., two-dimensional T2*-weighted gradient-echo echo-planar imaging; TE: 30 ms, TR: 2,000 ms, flip angle 70°, 33 slices of 3-mm thickness, no gap between slices at an in-plane resolution of 3 x 3 mm2, 210 volumes for seven minutes of scanning), which triggers the start of the experiment on the presentation computer. Monitor the stimulator display to guarantee that current is sent at desired times throughout the experimental runs.\n4. Experiment Conclusion\nAfter the experiment has run and scanning is finished, unplug the inner filter box from the cable connected to the rubber electrodes before moving the scanner bed, remove the subject from the scanner, and remove the electrodes, leaving the subject free to wash their hair.\nTurn off the stimulator, and plug it in to recharge. Clean the rubber electrodes with water for their next use."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}