{
  "id": 17614,
  "origin_website": "Jove",
  "title": "Robotic Radical Cystectomy, Pelvic Lymph Node Dissection, and Intracorporeal Ileal Conduit Urinary Diversion",
  "procedures": [
    "This protocol and description of representative results abide by the guidelines of the Ohio State University human research ethics committee, and the approval to provide these representative results was obtained from each patient in compliance with the institution's guidelines. The inclusion criteria were patients recommended to undergo surgical management of their bladder cancer. Patients with metastatic disease, comorbidities prohibiting surgical management of their cancer, or cancer determined to be unresectable were excluded.\n1. Positioning and induction of anesthesia\nEnsure that preoperative fasting begins at midnight the evening before surgery.\n\tNOTE: More recently, an enhanced recovery after surgery protocol for robotic cystectomy has been implemented, which allows for an oral carbohydrate drink at bedtime and two hours prior to surgery and encourages the use of alvimopan. No additional bowel preparation is prescribed.\nEnsure timely administration of preoperative antibiotics and venous thromboembolism prophylaxis.\n\tNOTE: It is preferable to administer 40 mg of subcutaneous enoxaparin for prophylaxis or 5000 units of subcutaneous heparin, if creatinine clearance is less than 30 mL/min. Preferred antibiotics are ampicillin/sulbactam, gentamicin, and diflucan.\nInduce general anesthesia.\nPlace the orogastric tube.\nPosition the patient on the pink pad device, taking care to keep at least one inch of pink pad above the shoulders.\nPosition the patient supine with arms tucked if using the Da Vinci Xi robot. Position the patient in dorsal lithotomy if using the Da Vinci Si robot.\nPrepare and drape the patient, then place a 16-18 Fr urethral catheter sterilely.\n2. Surgery\nGaining access and docking the robot\n\t\nMake an 8 mm incision 3 cm cranial to the umbilicus.\nElevating the umbilicus and abdominal wall through the incision with a penetrating towel clamp, insert the Veress needle through the rectus fascia and peritoneum.",
    "Perform a saline drop test to ensure that access is in the appropriate location.\n\t\t\nAttach a 10 mL Luer lock syringe to the Veress needle with 10 mL of normal saline in the syringe. Aspirate to ensure no blood or fecal content is obtained, and then inject 3-5 mL of saline.\nRemove the syringe and watch for the fluid to drop through the needle into the intraperitoneal cavity, confirming appropriate intraperitoneal access.\nAttach insufflation tubing to the Veress needle, and start CO2 insufflation at a pressure setting of 10 mm Hg, making note of the starting pressure to again confirm appropriate intraperitoneal location.\n\t\t​NOTE: The starting pressure should be less than 8 mg Hg.\nUsing a 0-degree laparoscope placed through the visual obturator of an 8 mm trocar, insert the trocar into the peritoneum through the previously made 8 mm midline incision.\nPlace additional robotic trocars after making additional transverse 8 mm skin incisions for each trocar: two on the right abdomen at a level 1-2 cm cranial to the umbilicus, 9-10 cm apart. Place one on the left abdomen at the level of the umbilicus also 9-10 cm away from the umbilicus (Figure 1).\nPlace two assistant ports: one 12 mm trocar placed in the left lateral abdomen at the level of the umbilicus located 8-10 cm lateral to the left robotic port, and one 5 mm standard assistant trocar placed in the left upper quadrant, triangulated between the camera trocar and the left robotic trocar (cranial to both of these ports).\nTemporarily remove the 12 mm trocar and preplace a 0-Vicryl fascial suture at this site to prepare for fascial closure at the end of the case. Ensure that the ends of this suture are left untied and secured with a hemostat clamp.",
    "Place the patient in 25-degrees of Trendelenburg, and dock the Da Vinci robot. Dock the Xi robot on the patient's right side and the Si robot between the patient's legs.\nPlace the robotic instruments under vision: robotic camera in the midline port (followed by targeting of robotic arms to the pelvis if using the Xi robot), monopolar scissors in the right medial arm, Maryland bipolar graspers in the left arm, and Cadiere grasping forceps in the right lateral arm.\nInitial dissection and pelvic lymphadenectomy\n\t\nRelease the physiologic adhesions of the sigmoid colon from the left pelvic sidewall distally. Proximally, as the sigmoid colon meets the descending colon, begin to medialize the descending colon by incising the 'white line' of Toldt.\nIn the male patient, begin to develop the posterior plane between the rectum and prostate by incising the peritoneum covering the reflection of the anterior rectum and posterior bladder neck. Develop the plane between the prostate and the rectum, taking it as distally as possible.\n\t\t​NOTE: This step combines selective use of electrocautery, sharp tissue division, and blunt spreading as the dissection proceeds distally.\nStarting on the left, incise the posterior peritoneum at the root of the sigmoid mesentery, and carry this incision proximally and laterally to expose the left ureter coursing over the ipsilateral common iliac artery toward the bladder.\nDevelop a small space posterior to the ureter; insert the Cadiere forceps in this space to retract the ureter anteriorly to expose any vascular attachments to the ureter that can be ligated with bipolar diathermy and subsequent sharp division. In this manner mobilize the ureter proximal to the common iliac artery (3-5 cm) and distally toward the bladder.\nExtended pelvic lymphadenectomy and ureteral ligation",
    "Starting on the left, divide the peritoneum overlying the external and common iliac artery. Divide the peritoneum lateral to the ipsilateral medial umbilical ligament, and begin to develop the ipsilateral space of Retzius. Join the two peritoneal incisions, and use bipolar diathermy to ligate the ipsilateral vas deferens prior to sharply dividing the vas with scissors.\n\t\tNOTE: PLND can commence on either the left or the right. The current technique specifies starting on the left because release and mobilization of the sigmoid colon from its physiologic attachments to the left pelvic sidewall also typically reveals the left common/external iliac artery and left ureter, which facilitates starting the lymphadenectomy on that side.\nTaking care to preserve the ipsilateral genitofemoral nerve, dissect lymphatics lateral to the external iliac artery off their attachments to the anterior psoas fascia. Divide lymphatic tissue overlying the anterior aspect of the common and external iliac artery.\nLateral to the external iliac artery and vein, separate lymphatic tissue from the medial border of the psoas and levator muscles of the pelvic sidewall. Use the Maryland bipolar to control perforating vessels.\nRelease lymphatic tissue from the medial border of the ipsilateral internal iliac artery.\nAs the dissection proceeds distally along the internal iliac artery, note the takeoff of the obliterated umbilical artery (superior vesical artery). Clip the obliterated umbilical artery with a large non-absorbable locking clip placed by the assistant proximally, then ligate with bipolar diathermy distally prior to sharp division.\n\t\tNOTE: This maneuver, in the midst of the lymphadenectomy, represents the beginning of the division of the ipsilateral bladder pedicle.",
    "Prospectively identify the ipsilateral obturator nerve and vessels prior to removing the external iliac, internal iliac, and obturator lymph node packets. Control vascular attachments with the Maryland bipolar and ligate lymphatic channels with small and large locking clips. During these steps, use the Cadiere forceps to apply medial retraction on the medial umbilical ligament and/or external iliac vessels and/or distal/anterior retraction of the developing lymphatic packets.\nRetract the ureter medially, then remove the common iliac lymphatic tissue from the fossa of Marceille, an area bordered by the psoas laterally, common iliac artery medially, and the obturator nerve posteriorly.\nRemove lymph node packets with a reusable 10 mm specimen bag.\nRepeat steps 2.3.1-2.3.8 on the right to complete the right-sided lymphadenectomy.\nRetract the mesentery of the sigmoid colon (on the right side) anteriorly to expose the root of the sigmoid mesentery, and using selective electrocautery and blunt dissection, develop the pre-sacral space posterior to the sigmoid mesentery, proceeding from right to left.\nPerform pre-sacral lymphadenectomy only after the area between the internal iliac arteries (pre-sacral space) is developed.\nDuring this step, control small vascular and lymphatic channels with the Maryland bipolar.\nTake care to avoid injury to the right common iliac vein as it lies underneath the right common iliac artery during the pre-sacral dissection.\n\t\t​NOTE: A vascular injury in this location is challenging to control.\nLigate each ureter distally with two large locking clips placed ~5 mm apart. Divide each distal ureter sharply between clips.\nFold the distal aspect of the left ureter proximally near the window posterior to the sigmoid mesentery. Use the Cadiere forceps to retract the sigmoid anteriorly, and using the distal ureteral clip as a handle, pull the left ureter from left to right posterior to the sigmoid mesentery.",
    "Prostatic apical dissection and division of remaining bladder pedicles\n\t\nWithout dividing the urachal ligament that is suspending the bladder to the anterior abdominal wall, develop the space of Retzius, and incise the endopelvic fascia bilaterally.\nRelease the pelvic floor muscle fibers from the lateral aspects of the prostate, and tease off lymphofatty tissue from the anterior aspect of the prostate using the Maryland bipolar to control vascular attachments.\nDivide the puboprostatic ligaments, which can be done sharply or through touch application of monopolar electrocautery.\nLigate the dorsal venous complex (DVC) with a 2-0 V-Loc (barbed absorbable) suture (CT-1 or similar needle). To do this, pass the suture from right to left between the posterior aspect of the DVC and the anterior aspect of the urethra as distally as possible without entrapping fibers of the pubourethralis muscle with the needle. Bring the needle anteriorly through the distal aspects of the cut puboprostatic ligaments (from left to right) and then through the loop at the tail end of the suture.\nAdditionally, re-pass the 2-0 V-Loc from right to left through the mid-DVC, and then pass the needle from left to right through the synchondrosis of the pubic symphysis-this pulley system may enhance hemostasis after division of the DVC.\nSharply divide the DVC, ~3 mm proximal to the ligating suture, which permits full exposure of the urethra and prostatic apex.\nIf nerve-sparing is desired and appropriate, incise the lateral prostatic fascia at the mid-prostate bilaterally, and bluntly develop the plane until the neurovascular bundles are released. Continue until that plane joins with the plane posterior to the prostate developed at the beginning of the case.",
    "Switch the monopolar scissors for the robotic vessel sealer. Using the vessel sealer, divide the remaining bladder pedicles. Take care to stay posterior to the clipped distal ureteral stumps, to ensure a margin-negative resection.\nIn nerve-sparing cases, clip the prostatic pedicles with large locking clips, and divide them without thermal energy. Use just one or two large polymer ligating clips to ligate the prostatic pedicle on each side.\nDivide the urachal ligament close to its attachment at the umbilicus with the monopolar scissors.\nLigate the obliterated umbilical arteries with the Maryland bipolar before dividing them.\nUsing a combination of monopolar electrocautery and blunt dissection, separate the bladder from the anterior abdominal wall.\nCircumferentially dissect the specimen, which is now only attached at the urethra. Release the apical attachments of the neurovascular bundles if performing nerve-sparing, as the nerve bundles are medially tethered at the posterolateral aspects of the urethra.\nRemove the foley catheter.\nLigate the membranous urethra proximally at the prostatic apex. If performing orthotopic neobladder, sharply divide the urethra distal to this, taking care to preserve maximal urethral length. If performing ileal conduit urinary diversion, clip the membranous urethra once more as distally as possible, and divide the urethra in between clips.\nEntrap the specimen in a 12 mm endoscopic specimen bag for subsequent removal.\nSelecting bowel segment for urinary diversion\n\t\nSwitch instruments: place the Cadiere forceps in the left robotic arm and right-lateral robotic arm and the needle driver in the right-medial robotic arm.\n\t\tNOTE: The Cadiere forceps can be used to atraumatically grasp the bowel.\nSelect a 15 cm segment of distal ileum located 20 cm away from the ileocecal valve. Use an umbilical tape cut to 20 cm in length, marked at 5 cm increments, to measure.",
    "Place seromuscular marking sutures on the bowel with 3-0 silk air knots on the mesenteric aspect of the ileum to mark the distal and proximal ends of the bowel segment that will serve as the ileal conduit.\nPlace a suspending suture on the antimesenteric aspect of the distal end of the bowel segment chosen for the ileal conduit using a 3-0 Vicryl suture cut at 20 cm.\nUse the monopolar scissors to pierce the peritoneum of the mesentery, and spread to make two mesenteric windows at the proximal and distal aspects of the chosen bowel segment, staying within 5 mm of the mesenteric aspect of the bowel wall.\nThrough each window, insert one end of an Endo-GIA stapler with 80 mm purple loads, clamp and divide the bowel segment. Ensure that the assistant inserts the stapler into the field through the left lateral 12 mm port.\nUsing a robotic vessel sealer, divide the mesentery of the isolated ileal conduit segment.\n\t\t​NOTE: It is not necessary to visualize vascular arcades as long as the direction of tissue division is along the axis of the mesenteric vessels, which can be ensured by anterior retraction of the bowel segments with Cadiere forceps. Typically, only two-three applications of the vessel sealer are required on each aspect (proximal and distal) of the ileal conduit.\nEnsure the ileal conduit segment is placed caudally.\nIleoileostomy\n\t\nPerform ileoileostomy as a side-to-side stapled anastomosis. Using the monopolar scissors, cut along the staple line of the two segments to be anastomosed: start at the antimesenteric aspect, and proceed about halfway into the lumen, exposing enough lumen to expose insert the stapler arms.",
    "Using the Cadiere forceps, gently slide each of the bowel segments onto one of the stapler arms. Before closing the stapler, use the previously placed 3-0 silk marking sutures to apply traction to turn the mesenteries of the bowel segments away from each other. Close the stapler over the desired tissue by squeezing the ring handle together, and check to ensure appropriate positioning prior to deploying the stapler.\nDeploy the 80 mm stapling system: push the green safety button located above the handles, then slowly squeeze the ring handle unit sequentially until the staple unit is completely fired. Then, open the jaws of the instrument by pulling the black return knobs to their original position.\nTo complete the ileoileostomy, use the previously partially divided staple lines as handles to retract the anastomosis anteriorly. Close the remaining open aspect of the bowel, as it is optimally exposed in this way, with one last 80 mm stapler load.\nReinforce the interior vertex (crotch) of the bowel anastomosis using a 3-0 silk suture.\nClose the mesenteric trap with approximately four 3-0 silk figure of eight sutures.\nUreteroileal anastomosis\n\t\nSuspend the ileal conduit to the anterior abdominal wall by pulling the previously placed 20cm 3-0 vicryl suture at the distal aspect of the conduit through the abdominal wall using a closure system needle device. Place the needle through the abdominal wall, and press the top of the Carter device to open the jaws of the needle; grab the vicryl suture and secure within the jaws. Pull the suture up through the abdominal wall and secure the suture with a hemostat applied at the skin level.\n\t\t​NOTE: The position for suspension is chosen so that the distal end of the conduit is just distal to the inner aspect of the right lateral robotic trocar.",
    "Open the distal end of the conduit with monopolar electrocautery by cutting along the staple line, starting from the antimesenteric aspect.\nMake two 6 mm enterotomies sharply in the proximal end of the conduit to create recipient sites for each ureter.\n\t\t​NOTE: Both these enterotomies can be made on the medial (camera-facing) aspect of the conduit.\nSuspend the left ureter by using the distal clip as a handle, and cut sharply into the lumen of the ureter (~75% transection) and proximally spatulate 10 mm of the ureter.\nStart the ureteroenteric anastomosis using a double-armed 4-0 monocryl suture on a PS-2 reverse cutting needle.\n\t\t​NOTE: The suture is fashioned into a double-armed suture by tying together two 12 cm lengths of suture.\nPlace the first suture that approximates ureter to bowel in an 'out-to-in' fashion with each needle, and secure with three knots.\n\t\tNOTE: On the medial aspect of this anastomosis, it is easier to start the running suture 'in-to-out' on the bowel. On the lateral aspect of this anastomosis, it is easier to start the running suture 'in-to-out' on the ureter. Once the anastomosis is halfway complete, begin the process of ureteral stent placement.\nPreload a short laparoscopic suction tip with a 6F single J stent that has been lubricated and itself preloaded with a wet guidewire.\n\t\t​NOTE: The laparoscopic suction tip enables the bedside assistant to direct the stent into the anastomosis.\nRemove the robotic instrument in the right lateral trocar, and insert the suction tip (which functions as a stent-introducer) into the open/distal end of the ileal conduit, and guide it to the partially complete left ureteral anastomosis.",
    "Guide the stent into the ureter and the left renal pelvis using the robotic instruments until resistance is met. Partially remove the guidewire to allow the coil of the proximal aspect of the stent to form, and slide the stent proximally another 2-3 cm until resistance is met.\nUse the robotic grasper to secure the stent at the anastomosis internally, remove the guidewire completely. Cut the stent flush with the external aspect of the robotic trocar, and pull the stent through the trocar into the abdomen.\nComplete the running anastomosis over the stent. Use the distal ureteral tissue as a handle until it is no longer needed, then sharply divide it using the assistant's endoscopic scissors. Send the distal ureter as a final ureteral margin.\nRepeat the same procedure for the right ureter.\nRemove all robotic instruments, and undock the robot.\nEnsure that the surgeon stands on the patient's left (for a right-sided ileal conduit, as is typical), and grasps the distal aspect of the ileal conduit with laparoscopic bowel graspers (long D&G) using the robotic camera as a hand-held laparoscope.\nCut the anchoring vicryl suture short external to the abdominal wall, and pull the remaining suture into the abdomen.\nStoma maturation and closure\n\t\nAt a prechosen urostomy site on the right abdominal wall, excise a circular paddle of skin and subcutaneous fat, and clear off the anterior rectus fascia. Make a cruciate incision with electrocautery through the fascia. Spread the rectus muscle fibers in a cranial-caudal axis using a Tonsil/Reinhoff type clamp, then pierce through the anterior peritoneum, and spread just enough to permit externalization of the conduit.",
    "Through this opening, from the patient's right side, insert a Babcock clamp and grasp the distal end of the ileal conduit, which is 'handed over' from the surgeon on the patient's left using the laparoscopic bowel grasper.\n\t\tNOTE: A smooth one-step transfer at this step will ensure orthotopic orientation of the conduit.\nUsing the Babcock clamp, bring the ileal conduit's distal end through the abdominal wall. Carefully externalize the stents without pulling them out of the conduit itself. Secure the conduit in its current position with a Babcock clamp.\nPlace a 19 French drain in the pelvis via the left robotic port as an introducer. Using the laparoscopic graspers, place the drain in an 'upside-down-U' configuration such that its distal end is placed in the right obturator fossa, mid portion near the membranous urethra anterior to the rectum, and proximal aspect adjacent to the left obturator fossa.\nLevel the operating table, and turn the insufflation off. Remove all robotic trocars.\nRemove the 12 mm port, and tie the pre-placed 0-Vicryl fascial sutures.\nExtend the supraumbilical camera port incision to 4-5 cm, and extract the specimen.\nMature the stoma by tacking the bowel serosa to the dermis with interrupted 3-0 vicryl sutures in 4 quadrants, everting the distal conduit to create a rosebud by placing triplicate sutures16.\nUse 4-6 additional 3-0 vicryl sutures to close any gaps between the edge of the conduit and skin.\nSecure both stents and the drain with 2-0 nylon sutures.\nClose the fascia of the extraction incision with 0-PDS interrupted sutures. Copiously irrigate all wounds.\nReapproximate the skin of all surgical wounds with 4-0 suture, and dress with surgical skin glue.\nConsiderations in the female patient",
    "​NOTE: Variables to consider include surgical history (surgical absence of ovaries and/or uterus), desire for uterine/vaginal organ preservation to optimize postoperative sexual function and/or support for orthotopic neobladder, and feasibility of sparing of the anterior vaginal wall because of tumor location and extent. Positioning can be either dorsal lithotomy to facilitate urethral dissection and specimen removal (even if the Xi robot is used) or supine with the hips rotated laterally such that the knees are rotated laterally and the patient's heels are close together (ensuring all pressure points are carefully padded).\n\t\nPerform port placement in the same manner as in males.\nIf all pelvic organs are in situ, and anterior pelvic exenteration is planned, identify the infundibulopelvic ligament on each side by retracting the ipsilateral ovary anteriorly and caudally. Develop the vessels that comprise the ligament, and ligate them proximally with a large clip, distally with bipolar diathermy, and divide.\nIsolate the ureters, and perform extended pelvic lymphadenectomy.\n\t\t​NOTE: If the uterus is in situ, whether or not it is spared, it is important to identify and divide the uterine artery on each side. This often originates from the ipsilateral obliterated umbilical artery near its takeoff and crosses anterior to the ureter as it travels medially.\nLigate the uterine arteries with small locking clips or bipolar diathermy.\n\t\tNOTE: Posterior dissection in females occurs after ureteral mobilization/division and lymphadenectomy, in contradistinction to males.\nIn the case of anterior pelvic exenteration with en bloc excision of the anterior vaginal wall, insert a lubricated sponge stick into the vagina to easily identify the proximal vaginal cuff. Use monopolar electrocautery to make a 2 cm transverse incision into the vagina over the sponge stick.",
    "Exchange the monopolar scissors for a robotic vessel sealer, which is used to ligate and divide the anterolateral vaginal wall on each side, proceeding distally toward the bladder neck.\n\t\t​NOTE: This maneuver results in the division of the vascular pedicles of the bladder as well.\nDivide the urachus, and develop the space of Retzius to release the bladder from its attachments to the anterior abdominal wall. Divide the endopelvic fascia, and ligate and divide the DVC.\nIf a neobladder is planned, circumferentially dissect the urethra, remove the foley catheter, ligate the proximal urethra with a large clip just distal to the bladder neck, and divide the urethra.\nIf an ileal conduit is planned, keep the foley catheter in place. Ensure that the bedside surgeon uses a bovie to make an 'upside-down-U' incision anterior and lateral to the urethra externally, and use Metzenbaum scissors to dissect the plane anterior to the urethra.\nNote that the robotic surgeon will be able to see the tips of the Metzenbaum scissors relatively quickly, and then use the monopolar scissors to free the urethra from its remaining attachments with the assurance that the urethra has been removed in totality.\nEnsure that the bedside surgeon clips the foley catheter with a large clip just distal to the urethral meatus and divides it, and the console surgeon subsequently pulls the freed specimen into the pelvis.\nMaintain pneumoperitoneum due to the insufflation system.\nEnsure that the bedside surgeon introduces a 15 mm endoscopic specimen extraction bag through the vaginotomy for the removal of the specimen through the vaginotomy.\nIf necessary, mobilize the lateral and proximal flaps of vaginal tissue from the anterior rectal wall.",
    "Use a 2-0 V-loc to bring the proximal vaginal wall to the anterior/apical vaginal wall, and run this suture proximally until the right aspect of the vaginal closure is complete. Repeat this procedure to close the left side.\nPerform intracorporeal ileal conduit urinary diversion as described above.\n\t\tNOTE: There is no separate fascial incision or closure in the midline as the specimen has already been extracted. This feature of robotic radical cystectomy in females provides the benefit of eliminating the possibility of fascial dehiscence.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}