{
  "id": 15044,
  "origin_website": "Jove",
  "title": "Gene Mining and Sequence Analysis of Purine Nucleosidase Based on RNA-Seq",
  "procedures": [
    "NOTE: A strain of anamorph of caterpillar fungus (H. sinensis) was deposited in our laboratory. Escherichia coli DH5 were preserved by Shenzhen Hospital, Beijing University of Chinese Medicine.\n1. Preparing for RNA-Seq\nHarvesting of mycelia\n\t\nPrepare fermentation medium for fermentation of H. sinensis: powdered corn flour (1%), silkworm pupae (1.5%), yeast extract (0.5%), tryptone (1%), glucose (1.5%), bran (1.5%), dextrin (0.5%), KH2PO4 (0.02%) and MgSO4 (0.01%).\nPrepare inoculation by 10% fermentation medium for scale-up culture (add 10 mL medium per 100 mL medium). Conduct submerged fermentation by the condition of 16 °C on a rotary shaker at 150 rpm for 10 days.\nAsexually reproduce and harvest mycelia of the anamorph of caterpillar fungus for 10 days. Centrifuge the fermented medium and discard the supernatant after centrifugation. Suspend the mycelia by adding 100 mL of ultrapure water for 3 times and remove the supernatant by centrifugation. Grind the cleaned mycelia into a powder using liquid nitrogen.\nRNA-Seq\n\t\nExtract total RNA of the anamorph of caterpillar fungus according to the manufacturer’s protocols (Table of Materials) and further treat the sample with RNase-free DNase I (Table of Materials).\nIsolate the mRNA from total RNA PolyATtract mRNA Isolation Systems, and isolate poly(A) mRNA using beads with oligo(dT) according to the manufacturer’s protocols (Table of Materials).\nTake the short fragments as templates to synthesize the first-strand cDNA by random hexamer-primers according to the manufacturer’s protocols (Table of Materials). Perform the synthesis of second-strand cDNA according to the manufacturer’s protocols.\nSubsequently, generate the sequencing libraries using the Ultra RNA Library Prep Kit according to the manufacturer’s protocols (Table of Materials).\nPurify short fragments by PCR extraction kit according to the manufacturer’s protocols (Table of Materials) and resolve it by EB buffer, respectively.",
    "Connect the short fragments (threshold of 300 bp) with sequencing adapters according to the result of agarose gel electrophoresis.\nSubsequently, conduct amplification with PCR using the templates selected from suitable fragments.\nSequence the library by Illumina HiSeq 4000 with paired-end sequencing according to the manufacturer’s protocols. Filter dirty raw reads from the raw sequence data to obtain clean data. Adopt denovo assembly to get Unigenes with the least Ns that cannot be extended on either end.\nAlign Unigene sequences by blastx to protein databases such as nr, Swiss-Prot, KEGG, and COG (e-value < 0.00001). Retrieve proteins with the highest sequence similarity with the given Unigenes along with their protein functional annotations. Summarize the RNA-Seq results (Table of Materials).\n\t\tNOTE: Commercial kits were used in the above steps, and all operations were done according to the manufacturer's protocol.\n2. Gene mining of purine nucleosidase\nDownload the files of RNA-Seq results on the computer. Find the annotation result files of assembled Unigenes from the RNA-Seq results.\n\tNOTE: Paired-end reads were used again for gap filling of scaffolds to obtain sequences with least Ns that cannot be extended on either end. Such sequences were defined as Unigenes. Unigene annotation provides information of expression and functional annotation of Unigene.\nOpen the Annotation Files path and enter map 00230 in the search bar; then search purine metabolism (map00230) in the KEGG classification of annotation files.\nMark EC:3.2.2.1 (PN) red in the annotated map00230 and indicate that there were assembled Unigenes that have been annotated to PN.\n\tNOTE: There were three Unigenes (Unigene10777, Unigene14697, and Unigene17827) annotated to PN after clicking on the EC number 3.2.2.1 and shown in the annotated map00230.\nClick on EC number 3.2.2.1 and show the annotated Unigenes information.",
    "Open the LTFViewer software and import Unigene.fa file with a Ctrl-O shortcut and show the sequence information of assembled Unigenes.\nSearch for sequence information of Unigene10777, Unigene14697, and Unigene17827 with a Ctrl-F shortcut.\nDownload the sequence information of Unigene10777, Unigene14697, and Unigene17827 with Ctrl-C and Ctrl-V shortcuts.\nEliminate Unigene10777 and Unigene17827 with excessively short sequences of open reading frame (ORF).\n\tNOTE: Basic sequence information was displayed in LTFViewer software.\nSelect Unigene14697 (size 1,705 bp, gap 0 0%) with suitable length of ORF for further study.\n3. Bioinformatic analysis\nAnalyze the ORF of PN gene by ORFfinder (https://www.ncbi.nlm.nih.gov/orffinder/).\n\t\nPaste the sequence into the box. Choose parameters as follows, minimal ORF length (nt): 75, genetic Code: 1. standard, ORF start codon to use: ATG only. Click on the Submit button to obtain the ORF information.\nUse the ProtParam tool (http://us.expasy.org/tools/protparam.html) to calculate the theoretical molecular mass and isoelectric point.\n\t\nPaste the amino acid sequence (in one-letter code) into the box and click on the Compute Parameters button to obtain the results.\nApply SignalP5.0 Server (http://www.cbs.dtu.dk/services/SignalP/) to predict the signal peptides.\n\t\nEnter protein sequences in FASTA format. Choose parameters as follows, organism group: Eukarya, output format: Long output. Click on the Submit button to obtain the results.\nApply BLAST (https://blast.ncbi.nlm.nih.gov/Blast.cgi) to analyze the homology of protein sequences.\n\t\nClick on the Protein Blast button and enter the sequence into the box. Choose parameters as follows, database: Non-redundant protein sequences (nr), algorithm: blastp (protein-protein BLAST). Click on the Blast button to obtain the results.\nApply Clustal X program (http://www.clustal.org/) to align the acid sequences of PN from different fungi.",
    "Upload a file or paste the sequences into the box. Set the parameters as follows, output format: ClustalW with character counts. Click on the Submit button to obtain the results. Clustal X can only recognize files in the FASTA format, and the path of files can only include English names.\nUse MEGA 4.0 (https://www.megasoftware.net/mega4/) to conduct the phylogenetic tree.\n\t\nOpen the software and click on the File button to upload the sequences. Select the data type as Protein Sequences, click on the OK button to proceed to the next step. Subsequently, click on the Phylogeny button and select Bootstrap Test Phylogeny, and then click on Neighbor Joining Tree. Select the default parameters and click on the Compute button to obtain the results.\nApply InterProScan (http://www.ebi.ac.uk/interpro/search/sequence/) to identify the catalytic domain of PN.\n\t\nEnter the sequence into the box. Select the default parameters and click on the Search button to obtain the results.\nApply Predict Protein (http://www.predictprotein.org/) online to predict the protein secondary structure.\n\t\nEnter an amino-acid sequence (one letter code) into the box, and then click on the predictProtein button to obtain the results.\nApply Online tools SWISS-MODEL (http://swissmodel.expasy.org/) to evaluate the three-dimensional structure of PN24.\n\t\nClick on the Start Modeling button and paste the target sequence into the box. Fill in the Project Title and Email information and click on the Search for Templates button to obtain the results.\n4. Gene cloning and construction of recombinant plasmid\nDesign primers whose reverse primer contained a NotI site and the forward primer had an EcoRI site.\nShow the forward primer as: AGAGAATTCATGACCATGCCAGATTCT (5’–3’), and the reverse primer as: ATAGCGGCCGCCTAACGCGTGCCGTTAGA (5’–3’) by Primer Express.",
    "Prepare the primers as well as the cDNA of caterpillar fungus for cloning of PN gene. Conduct PCR as follows: pre-denaturation at 95 °C for 5 min, denaturation at 94 °C for 45 s, renaturation at 55 °C for 60 s, extension at 72 °C for 90 s, repeat for 35 cycles, and extension at 72 °C for 10 min.\nObtain the PCR fragments and detect it by agarose gel electrophoresis for verification. Ligate the PCR fragments with pMD18-T. Conduct ligation system of PMD18-T as follows: 1 μL PMD18-T, 4 μL Solution1, and 5 μL Target gene. Set the conditions as follows: maintaining at 16 °C for 16 h, inactivation at 65 °C for 15 min.\nTransfer the recombinant plasmids to the competent E. coli JM109 cells according to the operation manual25.\nDigest the recombinant pMD18-T/PN plasmids and vector ppic9K with EcoRI and NotI. Ligate the fragments after digestion by T4 DNA ligase.\nConstruct the recombinant plasmid ppic9K/PN for further heterologous expression.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}