{
  "id": 1796,
  "origin_website": "Cell",
  "title": "Miniaturization of Smart-seq2 for Single-Cell and Single-Nucleus RNA Sequencing",
  "procedures": [
    "Step-By-Step Method Details\nStep-By-Step Method Details\nNucleus Dissociation from the Mouse Brain\nTiming: 0.5–1 h (+1–1.5 h if antibody staining is performed)\nThis protocol allows the isolation of nuclei from the embryonic or adult mouse brain (Figure 1[href=https://www.wicell.org#fig1]). At the end of the dissociation procedure, optional antibody staining against nuclear antigens can be performed to allow the isolation of specific populations.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/125-Fig1.jpg\nFigure 1. Schematic Representation of the Nucleus Dissociation Protocol for the Mouse Brain\nCritical: Fluorescently labeled nuclei can only be isolated if the fluorescent tag is targeted to the nucleus (e.g., fluorescent protein containing nuclear localization signals or fused to a nuclear protein). In the absence of nuclear retention mechanism, the fluorescence will be lost during cell lysis even if fluorescence is observed in the nucleus prior to dissociation.\nNote: For complete details on the use and execution of this protocol, please refer to (Jaeger et al., 2018[href=https://www.wicell.org#bib4]).\nSacrifice the embryo or adult mouse through decapitation and dissect the brain into a cold Petri dish previously placed on ice. Quickly dissect the region of interest.\nTransfer the dissected tissue into a glass Dounce homogenizer containing NIM-DP, Triton and the DNA-binding dye.\nDissociate the tissue with the loose pestle (pestle A) 5–7 strokes without introducing bubbles.\nApply 8–10 strokes gently with the tight pestle (pestle B). (See troubleshooting section for additional information).\nTransfer the contents to pre-chilled 1.5 mL Eppendorf tubes and spin for 7 min at 90 × g and 4°C.\nAspirate the supernatant and gently resuspend in 1 mL of NIM-DP.\nRepeat spin for 7 min at 90 × g and 4°C to remove more Triton.\nAspirate the supernatant and resuspend in 500 μL of NSB-DP.\nStrain through pre-chilled 5 mL FACS tubes with 35 μm Cell Strainer Snap Cap on ice.",
    "Count the nuclei and adjust the concentration to 10 × 106 nuclei/mL in NSB-DP.\nKeep tubes on ice, protected from light, until sorting (continue to step 57) or proceed to antibody staining (continue to step 12 below).\nNote: The volume of NSB-DP must be adjusted to prevent excessive clogging during the filtering step.\nNote: The slow centrifugation speed is critical to avoid damaging the nuclei.\nNote: Nuclei preparation generates numerous cellular debris, the size of which is in the similar range as the nuclei. To facilitate counting, nuclei can be visualized via the DNA staining dye used in step 10.\nOptional Antibody Staining\nTiming: 1–1.5 h\nNote: If directly labeled antibodies against your antigen of interest are available, perform direct staining (skip steps 22–29). If there are no directly labeled antibodies available, indirect staining must be performed. Nuclei will first be stained with a primary antibody against your antigen of interest and subsequently with a fluorescently labeled secondary antibody which recognizes the primary antibody.\nCritical: Design your antibody staining panels carefully to prevent cross reactivity of secondary antibodies between different species and minimize spectral overlap between fluorophores. Keep in mind the fluorescence of the DNA staining dye that you used during the nuclei dissociation process and whether your nuclei population of interest is labeled with a fluorescent tag.\nAliquot 100 μL of your nucleus suspension (1 × 106 nuclei /well) into as many wells of a 96 well V-bottom plate as required.",
    "Note: If you want to sort a high number of nuclei or if the estimated abundance of your population of interest within your sample is low, prepare multiple wells that will be stained with the same antibody panel. At the end of the staining procedure, wells with the same condition will be pooled into a single FACS tube for sorting.\nNote: Prepare additional wells for staining controls needed to properly interpret your flow cytometry data. This includes unstained nuclei, single stained nuclei and Fluorescence Minus One (FMO) controls.\nSpin down the plate for 5 min at 200 × g and 4°C.\nWhile your plate is in the centrifuge, prepare your primary antibody mixes in NSB-DP (100 μL of antibody mix/well) at the manufacturer-recommended dilutions.\nNote: Final antibody concentrations usually range between 0.1–10 μg/mL but optimum concentrations should be determined by antibody titration.\nRemove the supernatant by “flicking” the plate into the sink.\nNote: “Flicking” the plate is a very fast and efficient technique to remove the supernatant that works best with 96-well V-bottom plates. At the end of the centrifugation, firmly hold the plate upright in the palm of your hand. In a single motion, move the plate upwards, turn it over and bring it straight down, stopping abruptly above the sink.\nResuspend the nuclei in 100 μL of the primary antibody mix/well.\nIncubate for 30 min at 4°C in the dark.\nSpin down the plate for 5 min at 200 × g and 4°C.\nRemove the supernatant by “flicking” the plate into the sink.\nResuspend in 200 μL NSB-DP/well.\nSpin down the plate for 5 min at 200 × g and 4°C.\nWhile your plate is in the centrifuge, prepare your fluorochrome-labeled secondary antibody mixes in NSB-DP (100 μL of antibody mix/well) at the manufacturer-recommended dilutions.",
    "Remove the supernatant by “flicking” the plate into the sink.\nResuspend the nuclei in 100 μL of the secondary antibody mix/well.\nIncubate for 20–30 min at 4°C in the dark.\nSpin down the plate for 5 min at 200 × g and 4°C.\nRemove the supernatant by “flicking” the plate into the sink.\nResuspend in 200 μL NSB-DP/well.\nSpin down the plate for 5 min at 200 × g and 4°C.\nResuspend the nuclei with 100 μL NSB-DP/well.\nTransfer the samples to FACS tubes and pool wells stained with the same conditions.\nDilute samples with NSB-DP to 5–30 × 106 nuclei/tube and keep on ice and protected from the light until sorting (continue to step 57).\nCell Dissociation from the Neonatal Mouse Brain\nTiming: 3–3.5 h\nThis protocol allows the isolation of fluorescently labeled neurons from the neonatal mouse brain (P6-P12) (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/125-Fig2.jpg\nFigure 2. Schematic Representation of the Cell Dissociation Protocol for the Neonatal Mouse Brain\nNote: This is a faster adaptation from a previous protocol (Hempel et al., 2007[href=https://www.wicell.org#bib3]).\nNote: Do not process more than 6 brains per time.\nNote: All solutions but Pronase Solution must be ice-cold.\nNote: All steps but incubation in Pronase Solution must be carried out on ice.\nNote: Use RNase-free filter tips in all the steps.\nSacrifice the pup through decapitation and dissect the brain into a cold Petri dish previously placed on ice. Quickly dissect the region of interest.\nCheck the quality of the dissection under the fluorescent stereoscope. Take a picture to keep track of the procedure, but try to be as fast as possible.\nTransfer the dissected tissue into a 1.5 mL Eppendorf tube.",
    "Note: If you process more than one brain, clean carefully the dissection tools between each sample; use ethanol 70% and a cleaning agent to remove RNases. Leave the samples on ice until you have dissected all of them.\nAdd 1 mL per brain of Pronase Solution and incubate at room temperature. Short incubation with Pronase digests the extracellular matrix. Incubation time depends on the age: 21 min at P6, 24 min at P9 and 27 min at P12.\nRemove Pronase Solution and rinse once with 1 mL of Washing Solution. (See troubleshooting section for additional information).\nRemove Washing Solution and add 1 mL of Quenching Solution. FBS contained in the Quenching solution inactivates the residual Pronase. Incubate for 5 min.\nRemove Quenching Solution and rinse once with 1 mL of Washing Solution.\nRemove Washing Solution and add 0.5 mL of DNase Solution.\nGently triturate the sample pipetting up and down 10 times with the fire-polished 600 μm Pasteur pipettes. Repeat 10 times with the 300 μm pipettes and 10 times with 150 μm pipettes. Avoid making bubbles. Do not touch the bottom of the tube to avoid a tighter closing of the pipette tip.\nCritical: During the trituration step it is crucial to pipette gently and slowly. In order to avoid bubbles, never aspirate the solution completely.\nCritical: While triturating, hold the top of the tube to avoid warming the cells with your hands.\nNote: During this step a lot of cellular debris are generated and many cells die. Damaged cells release DNA which tends to create floccules. The DNase contained in the solution will degrade any released DNA, preventing the clogging of glass Pasteur pipettes.\nStrain through pre-chilled 5 mL FACS tubes with 35 μm Cell Strainer Snap Cap on ice.",
    "Count the cells and resuspend at 1–10 million cells per tube in DNase Solution.\nAdd a live/dead discrimination marker (e.g., Zombie dyes) at a 1:100 to 1:1,000 dilution range and incubate for 15 min at room temperature, protected from light.\nCritical: Choose the fluorescence of the live/dead discrimination dye so that it does not interfere with the fluorescent molecule with which your cells of interest have been labeled.\nWash and resuspend in DNase Solution at–5 to 30 × 106 cells/tube and keep on ice and protected from the light until sorting (continue to step 57).\nCell Dissociation from Human Forebrain Organoids\nTiming: 1 h\nThis method allows the isolation of single cells from human forebrain-regionalized organoids (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/125-Fig3.jpg\nFigure 3. Schematic Representation of the Cell Dissociation Protocol for Human Forebrain Organoids\nNote: The protocol is partially adapted from the dissociation described in (Camp et al., 2015[href=https://www.wicell.org#bib2]).\nNote: The protocol is optimized for the dissociation of approximately 10 organoids. However, it can be scaled up accordingly.\nNote: Use RNase-free filter tips in all the steps.\nCollect organoids in a 2 mL Eppendorf tube.\nWash organoids 3 times with DPBS.\nNote: Due to the density of the organoids they tend to sink to the bottom of the Eppendorf otherwise briefly spin the tube in a mini-centrifuge.\nTransfer organoids into 2 mL Accutase containing DNase.\nIncubate in a water bath for 45 min.\nAfter the first 10 min of incubation treat them every 5 min by alternating gentle shaking (vortex at slow speed) and pipetting up and down using a P200 pipet (Figure 3[href=https://www.wicell.org#fig3]).\nCritical: Pipetting up and down should be gentle but still effective. Pipettig strength might depend on the size and rigidity of the organoids. Avoid making bubbles. (See troubleshooting section for additional information).",
    "Note: Damaged cells release DNA which tends to create floccules; the DNase contained in the solution will degrade any released DNA, preventing the clogging of the pipette tip.\nCollect cells by centrifugation at 100 × g for 4 min.\nWash cells twice using DPBS.\nResuspend cell pellet in 500 μm DPBS containing EDTA.\nStrain through pre-chilled 5 mL FACS tubes with 35 μm Cell Strainer Snap Cap on ice.\nAdd a live/dead discrimination marker (e.g., Zombie dyes) at a 1:100 to 1:1,000 dilution range and incubate for 15 min at room temperature, protected from light.\nCritical: Choose the fluorescence of the live/dead discrimination dye so that is does not interfere with the fluorescent molecule with which your cells of interest have been labeled.\nWash and resuspend in DPBS containing EDTA at 5–30 × 106 cells/tube and keep on ice and protected from the light until sorting (continue to step 57).\nSingle-Cell/Nuclei Flow Sorting\nIn this section, we describe the procedure to sort single cells/nuclei into 384-well plates using a FACS Aria III, BD Biosciences (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/125-Fig4.jpg\nFigure 4. Schematic Representation of the Key Settings Recommended for Single-Cell/Nucleus Sorting into 384-Well Plates Using the FACS Aria III (BD Biosciences)\n(A) Schematic representation of the stream and the nozzle to be used in the protocol.\n(B) Drop location in home position.\n(C) Recommended plate layout.\nTiming: 1–4 h\nCalibrate the FACSARIA III sorter using the 85 μm nozzle and a sheath pressure of 45psi.\nFollowing stream set up and drop delay adjustments, use the far-left side stream to distribute the sample into the 384-well plate. The far-left stream should be targeted to the inner left 4-way position using the voltage sliders (Figure 4[href=https://www.wicell.org#fig4]A).",
    "Calibrate the “Home” position of the plate (well A1). To do so, use the same type of 384-well plate as the one you will be sorting your sample in (e.g., Eppendorf twin.tec PCR Plate 384) and cover it with a transparent adhesive plate-sealing film. Perform a very brief test sort with the aspirator drawer open to aim the side stream to the 384-well plate. Observe the location of the drop on the transparent plate-sealing film at the A1 well position. Wipe-off the drop with a cotton swab. Adjust the position of the ACDU. Repeat until the drop is positioned as shown in Figure 4[href=https://www.wicell.org#fig4]B.\nCritical: Perform very brief test sorts (i.e., click on and off as fast as possible) to generate the smallest possible drop on the plate-sealing film. A small drop will increase the accuracy of the ACDU positioning. The positioning of the drop at the “home” location is critical for the proper sorting of the entire plate. Note that the ideal position of the drop on the transparent plate-sealing film is slightly off the middle of the A1 well (i.e., toward the waste stream) to compensate for the angle of the stream when it hits the bottom of the well during sorting (Figure 4[href=https://www.wicell.org#fig4]B).\nNote: Although using bigger nozzles is gentler on the cells, in our hands, it decreases the accuracy of the stream and leads to more wells with poor RNA content. Drops that do not immediately reach the lysis buffer during sorting are likely to evaporate on the sides of the well which affects the RNA quality.",
    "The FACSAria III is ready for sorting. You can define your experiment and gating strategy. Representative FACS plots showing nuclei obtained from the adult mouse brain and cells isolated from the neonatal mouse brain or human forebrain organoids are shown in Figure 5[href=https://www.wicell.org#fig5].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/125-Fig5.jpg\nFigure 5. Gating Strategies to Identify Single Cells/Nuclei Prior to Sorting\nRepresentative FACS plots showing examples of gating strategies for the isolation of NeuN+ nuclei from the adult hippocampus (A), tdTom-labeled neurons (whole cells) from the postnatal mouse brain at P9 (B), and tdTom+ cells isolated from human forebrain-regionalized organoids after 36 days in culture (C).\nThaw the sample-collection plate for 1 min at room temperature and spin it down for 2 min at 1,500–2,000 × g and 4°C.\nRemove the plate-sealing film and carefully place the 384-well plate on the ACDU.\nVerify your gating strategy (e.g., singlets, live cells) and hierarchy.\nSelect the population to be sorted and define your sort layout leaving wells A1 and P24 empty for RNA spike-in controls.\nNote: To limit the evaporation of the low volume of lysis buffer (0.8 μL/well) in the sample-collection plate, the ACDU cooling system is essential and the sorting time should be reduced as much as possible (maximum ∼1h per plate). Long sorting time might affect the quality of the samples and result in plate biases (please see the Critical point below for additional explanation).",
    "Critical: The Mosquito HV robot (SPT Lab Tech), which is used in the miniaturized version of the Smart-seq2 protocol (see Part III), pipettes whole columns at once. To be able to distinguish the origin of any biases detected in the sequencing data, sorting samples in rows is strongly recommended (Figure 4[href=https://www.wicell.org#fig4]C). Upon initial QC of the plate, if a clear bias between rows is observed, it is most likely originated during sample preparation and sorting. However, if a bias between columns is observed, it is most likely originated during the miniaturized Smart-seq2 protocol.\nSet the “precision mode” on “single”.\nActivate the “index sorting” mode to allow the retrospective identification of each single cell/ nuclei’s high-dimensional phenotype in your sample-collection plate.\nStart acquisition and sort. (See troubleshooting section for additional information).\nAt the end of your sort, cover your plate with an adhesive PCR plate foil.\nAnnotate the side of your plate with the date/experimental information and spin it down for 5 min at 1,500–2,000 × g and 4°C.\nPut your plate back in the Styrofoam box containing dry ice. Store at −80°C as soon as possible.\nPause Point: The sorted plates can be stored at −80°C for up to 3 months before proceeding to the miniaturized Smartseq-2 protocol.\nNote: When using a stringent sorting mask (e.g., precision mode on “single cell”), the drop-out rate during sorting can be especially high. For this reason, one will need to start with a number of cells/nuclei that is significantly larger than the desired amount of final sorted single cells/nuclei.\nMiniaturized Smart-seq2\nHere, we describe a miniaturized and semi-automated version of the Smart-seq2 protocol (Picelli et al., 2013[href=https://www.wicell.org#bib6], Picelli et al., 2014[href=https://www.wicell.org#bib7]) using the low-volume liquid-handling robot Mosquito HV, SPT Lab Tech (Figure 6[href=https://www.wicell.org#fig6]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/125-Fig6.jpg",
    "Figure 6. Schematic Representation of the Main Steps of the Miniaturized Smart-seq2 Protocol\nMiniaturized Smart-seq2: Reverse Transcription\nTiming: 4 h\nPerform reverse transcription to obtain cDNA from single cells/nuclei previously sorted into lysis buffer in 384-well sample-collection plates.\nIf the collection plate containing the cells previously sorted in lysis buffer is frozen at −80°C, spray it with RNase decontamination solution and thaw it slowly using a 384-well cooling rack on ice. If you are working with a freshly sorted plate, proceed to the next step.\nThaw and dilute the control RNA in nuclease-free water to 25 pg/μL (1:2,000).\nAdd 0.5 μL of the diluted control RNA to wells A1 and P24 (these wells should have been left empty during the cell sorting and only contain lysis buffer).\nNote: If more wells are needed to evaluate the performance of the method, add 0.5 μL of the control RNA to the selected wells.\nCover the 384-well plate with an adhesive seal and incubate it in a thermocycler for 3 min at 72°C. Transfer the plate back to ice immediately afterwards.\nThaw the required reagents and prepare the RT mix.\nDistribute 35 μL of RT mix to each well of a column in a 384-well plate (master plate).\nUse the Mosquito HV liquid-handling robot to distribute 1.14 μL from the column in the master plate into all the columns of the 384-well sample-collection plate. The final volume per well is 2 μL.\nCover the plate with an adhesive PCR plate seal, vortex briefly, and spin down.\nRun the RT reaction following the program below:\ntable:files/protocols_protocol_125_16.csv\nMiniaturized Smart-Seq2: cDNA Amplification\nTiming: 4 h\nPerform a PCR reaction to amplify the cDNA generated in the reverse transcription.\nThaw the required reagents and prepare the PCR mix.",
    "Because the volume for an entire plate does not fit into a single column, distribute 30 μL of PCR mix to each of the wells of three columns of a 384-well master plate.\nUse the Mosquito HV liquid-handling robot to distribute 3 μL from each column of the master plate into 8 columns of the 384-well sample-collection plate containing the cDNA. Repeat the process until the PCR mix has been added to the whole plate. The final volume per well is 5 μL.\nCover the plate with an adhesive PCR plate seal, vortex briefly, and spin down.\nRun the PCR reaction following the program below:\ntable:files/protocols_protocol_125_17.csv\nCritical: The number of PCR cycles required for sufficient amplification of the cDNA is dependent on the cell type and sample quality. Optimal conditions should produce around 1 ng of purified cDNA (0.2 ng/μL in 5 μL).\nPause Point: The cDNA can be stored at −20°C for up to 6 months.\nMiniaturized Smart-Seq2: cDNA Purification (Bead Clean-Up)\nTiming: 1.5 h\nPurify the cDNA using Ampure XP beads.\nBefore starting, equilibrate the Ampure XP beads at room temperature for 30 min. Vortex thoroughly to ensure that the beads are properly mixed with the buffer.\nPrepare an 80% (vol/vol) ethanol solution in nuclease-free water.\nDistribute 40 μL of Ampure XP bead suspension to each well of three columns of an LVSD 384-well plate (master plate).\nUse the Mosquito HV liquid-handling robot to distribute 4 μL of beads from each column of the master plate into 8 columns of the 384-well sample-collection plate containing the amplified cDNA. Repeat the process until the beads have been added to the whole plate. The final volume per well is 9 μL (1:0.8 cDNA to beads ratio).",
    "Cover the plate with an adhesive PCR plate seal, vortex, and incubate 5 min at room temperature.\nSpin down the plate and incubate in a 384-well magnetic rack using the magnetic bead separation block from SPT Labtech for 5 min.\nUsing the Mosquito HV liquid-handling robot, wash the magnetic beads as follows:\nTo avoid evaporation problems, the beads will be consecutively washed in 3 sets of 8 columns (1–8, 9–16, 17–24).\nPrepare a clean LVSD 384-well master plate containing the following reagents and install it on the robot:\n6 columns containing 55 μL of 80% ethanol solution (columns 1–6 in the master plate).\n3 columns containing 50 μL of EB buffer (columns 7–9 in the master plate).\nInstall the 384-well magnetic rack with the cDNA plate on the robot.\nRemove 9 μL of supernatant of wells 1–8. The supernatants of the different washing steps can be transferred to an empty column of the same LDSD 384-well plate.\nAdd 5 μL of 80% ethanol from column 1 to the master plate to columns 1–8 in the cDNA plate.\nRepeat steps d-e for columns 9–16 and 17–24, pipetting the ethanol from columns 2 and 3 respectively.\nRemove the ethanol (5 μL) from well 1–8 in the cDNA plate.\nAdd 5 μL of 80% ethanol from column 4 in the master plate to columns 1–8 in the cDNA plate.\nRepeat steps g and h for columns 9–16 and 17–24, pipetting the ethanol from columns 5 and 6 respectively.\nRemove the ethanol (5 μL) from wells 1–8 in the cDNA plate.\nAdd 5 μL of EB buffer from columns 7 in the master plate to columns 1–8 in the cDNA plate.\nRepeat steps j-k for columns 9–16 and 17–24, pipetting the EB buffer from columns 8 and 9 respectively.",
    "Cover the plate with an adhesive PCR plate seal, vortex well and incubate 5 min at room temperature (out of the magnetic rack).\nInstall the plate back on the 384-well magnetic rack on the robot.\nTransfer 5 μL of the supernatant containing the clean cDNA into a new 384-well plate.\nNote: The volume of EB containing clean cDNA might be less than 5 μL.\nCritical: This is a critical step in the procedure. Make sure that you optimize the program in the Mosquito HV liquid-handling robot to avoid losing beads while efficiently removing the supernatant of the different washing steps. The beads should not dry out at any step. To avoid evaporation problems, program the robot as described to perform the pipetting steps for a maximum of 8 columns at a time and repeat the procedure three times until processing the whole plate. The beads and cDNA are safe in EB buffer so, after the washing steps, the whole plate can be eluted at once.\nPause Point: The clean cDNA can be stored at −20°C for up to 6 months.\nMiniaturized Smart-Seq2: cDNA Quality Control and Quantification\nTiming: 1 h\nEvaluate the quality and concentration of the cDNA.\nNote: Assessing the quality of a whole plate is expensive and time consuming. Consequently, adapt the number of samples to analyze to the throughput and price of the QC instrument you are using. When using an Agilent High Sensitivity DNA Kit in an Agilent 2100 Bioanalyzer Instrument, the chip can measure 11 samples per run. Try to cover the maximum number of columns diagonally to assess the general quality of the plate. If using only one chip, for instance, analyze wells A1 (RNA control), B2, C3, D4, E5, F6, L20, M21, N22, O23 and P24 (RNA control).",
    "Follow manufacturer’s instruction to check the size distribution of the cDNA from selected wells using an Agilent High Sensitivity DNA Kit in an Agilent 2100 Bioanalyzer Instrument. A good cDNA preparation should be almost free of small fragments (<300 bp) and should peak at ∼1.5–2 kb (Figure 7[href=https://www.wicell.org#fig7]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/125-Fig7.jpg\nFigure 7. Examples of cDNA Profiles Obtained on the Bioanalyzer Instrument\nCritical: At this step, it is important to evaluate whether good quality cDNA has been obtained in a high percentage of the analyzed wells and decide whether the general quality of the plate is good enough to proceed to library preparation.\nMiniaturized Smart-Seq2: cDNA Tagmentation\nTiming: 30 min\nFragment the cDNA and introduce the adaptor sequences for the final library preparation.\nThaw the required reagents and prepare the tagmentation mix.\nDistribute 30 μL of tagmentation mix to each well of three columns of a 384-well master plate.\nUse the Mosquito HV liquid-handling robot to distribute 3 μL from each column of the master plate into 8 columns of a new empty 384-well plate. Repeat the process until the tagmentation mix has been added to the whole plate.\nUse the Mosquito HV liquid-handling robot to distribute 1 μL from each well of the 384-well sample-collection plate containing the clean cDNA, to the plate containing the tagmentation mix. The final volume per well is 4 μL.\nCover the plate with an adhesive PCR plate seal, vortex briefly, and spin down.\nRun the tagmentation reaction following the program below:\ntable:files/protocols_protocol_125_18.csv\nOnce the tagmentation is done, use the Mosquito HV liquid-handling robot to distribute 1 μL of Neutralize Tagment Buffer (NT) into each well of the tagmentation plate. The final volume per well is 5 μL.",
    "Critical: The cDNA input in the tagmentation reaction should not exceed 1 ng per well. If the cDNA concentration in the analyzed wells is higher than 1ng/μL, generate a diluted copy of the cDNA plate using the Mosquito HV liquid-handling robot. In order to avoid over-tagmentation problems, add the Neutralize Tagment Buffer (NT) as soon as the tagmentation reaction is over.\nNote: This is the most expensive part of the protocol. The above described reactions are performed using a whole Nextera XT DNA Library Preparation Kit (96 rxn) for a 384-well plate. If both the quality and abundance of cDNA are high, the tagmentation can be performed with half the amount of cDNA and half the volumes of reagents indicated in this section, which significantly reduces the cost of the whole protocol.\nMiniaturized Smart-Seq2: Index Addition and Amplification of Libraries\nTiming: 1 h\nBarcode and amplify the libraries from the individual wells.\nThaw the required reagents and prepare the Indexing PCR.\nDistribute 40 μL of the indexing PCR mix to each well of three columns of a master 384-well plate.\nUse the Mosquito HV liquid-handling robot to distribute 4 μL from each column of the master plate into 8 columns of the 384-well plate containing the tagmented cDNA. Repeat the process until the indexing PCR mix has been added to the whole plate.\nUse the Mosquito HV liquid-handling robot to distribute 1 μL from each well in the barcoding plate to the corresponding well in the 384-well plate containing the tagmented cDNA together with the indexing PCR mix. The final volume per well is 10 μL.\nCover the plate with an adhesive PCR plate seal, vortex briefly, and spin down.\nRun the indexing PCR reaction following the program included in the following table.\ntable:files/protocols_protocol_125_19.csv",
    "Once the indexing PCR is done, use the Mosquito HV liquid-handling robot to pool the whole 384-well plate into three columns of an empty LVSD plate.\nManually pool the content of all the wells in the three columns into two 2 mL tubes (the expected volume is around 3.5 mL).\nNote: The number of cycles in the indexing PCR can be adjusted from 8 to 12 depending on the amount of cDNA used as an input for the tagmentation. The whole plate is pooled prior to bead clean-up and library QC. However, for the implementation of the protocol, the libraries in the different wells can be individually purified and QCed if needed.\nMiniaturized Smart-Seq2: Final Library Purification (Bead Clean-Up)\nTiming: 15 min\nDouble-sided size selection of final libraries.\nBefore starting, equilibrate the Ampure XP beads at room temperature for 30 min. Vortex thoroughly to ensure that the beads are properly mixed with the buffer.\nPrepare an 80% (vol/vol) ethanol solution in nuclease-free water.\nDistribute the final libraries into four 2 mL tubes (the expected volume is around 900 μL in each of them). Process all tubes in parallel following the subsequent steps in the protocol.\nAdd 450 μL of beads to each tube (1:0.5 library to beads ratio).\nVortex briefly and incubate them 5 min at room temperature.\nPut the tubes in a compatible magnetic rack and incubate them until the solution clears.\nTransfer the supernatants to new 2 mL tubes.\nAdd 270 μL of beads to each tube (1:0.3 library to beads ratio).\nVortex briefly and incubate them 5 min at room temperature.\nPut the tubes in a compatible magnetic rack and incubate them until the solution becomes clear.\nAdd 1 mL of 80% ethanol to each of the tubes and incubate for 30 s.\nRemove the ethanol.",
    "Repeat steps 62 and 63 for a total of two washes.\nRemove the tubes from the magnetic rack and add 50 μL of EB buffer.\nVortex briefly and incubate them for 5 min at room temperature.\nPut the tubes back into a compatible magnetic rack and incubate them until the solution clears.\nCollect the supernatant of all tubes and transfer them into a new 1.5 mL tube. The libraries are clean and ready for QC and sequencing.\nMiniaturized Smart-Seq2: Final Library QC\nTiming: 15 min\nEvaluate the quality and concentration of the libraries prior to sequencing.\nFollow the manufacturer’s instruction to check the size distribution of the library pool using D1000 kit in an Agilent 4200 TapeStation System. A good library pool should show a broad distribution with a wide peak at around 300–800 bp (Figure 8[href=https://www.wicell.org#fig8]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/125-Fig8.jpg\nFigure 8. Examples of Library Profiles Obtained on the TapeStation Instrument\nPause Point: The libraries can be stored at −20°C for up to 6 months.\nNote: The libraries can be sequenced single-end or paired-end, although single-end (75–125 bp) is sufficient for standard single-cell transcriptomics analysis. Depending on the analytical needs, the sequencing depth can be adjusted from 250K to 1 Million reads per cell. Illumina HiSeq2500/4000, NextSeq500/550 or NovaSeq6000 are suitable instruments to achieve the recommended depth."
  ],
  "subjectAreas": [
    "Genomics",
    "Sequencing",
    "Single Cell"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}