{
  "id": 6575,
  "origin_website": "Bio",
  "title": "Assessment of Metacaspase Activity in Phytoplankton",
  "procedures": [
    "Preparation of cell extracts (for cell collection and volumes refer to Notes 1 and 2)Prepare 1x Lauber buffer (see Recipe 1).Add 1000 µl 1x Lauber buffer to the cells (Note 3). Place the tubes in a bucket of ice.Sonicate each sample for 30 s (short pulses). Repeat this step 4 times (each sample 4 x 30 s) (Note 4). Centrifuge at room temperature, maximum speed (14,000 x g) for 5 min.Transfer 500 µl of supernatant to a fresh tube containing 5 µl DTT (1 M) and place on ice for immediate assay or store at -80 °C for future use. The remaining sample in the tube can be stored at -80 °C for backup and for total protein concentration analysis.Preparation of Standards (Note 5)Use Table 1 as a guide to prepare a set of standards by using two-fold dilutions.Prepare a stock of 1 M AMC (see Recipe 2). Prepare 15 tubes.To each tube add the diluent (1x Lauber buffer). To tube 1 add 1 µl AMC standard stock (1 M) to a final concentration of 1,000 µM.Vortex the tube and remove 500 µl from tube 1 to tube 2 (2 fold dilution), thus in tube 2 the final concentration will be 500 µM, vortex the tube and remove 500 µl from tube 2 to tube 3, to a final concentration of 250 µM in tube 3. Repeat this to all tubes. Tube number 15 leave with 1x Lauber buffer only (0 µM).Table 1. Preparation of diluted AMC standardsimgsrc:https://en-cdn.bio-protocol.org/attached/image/20190819/20190819002635_6549.jpgLoading of the plate (Table 2)Additional controls that should be included in this assay are a) Sample blank (no substrate),  b) Substrate blank (no cell lysate, substrate blanks will ensure the substrate is not spontaneously degraded over time) and c) DMSO control (as it is used as a solvent).",
    "The total reaction volume must be kept constant and therefore 1x Lauber buffer can be used to replace the volume normally occupied by either the cell lysate or the substrate reagent.Prepare working solution (WS) of substrate (1 mM) sufficient for all samples, standards and substrate blanks (see Recipe 4).Load the 96-well plate according to the content and amounts presented in Table 2 and table plan example presented in Figure 1. Cover the plate with a lid and go to the plate reader (Note 6).Table 2. Description of the amounts and contents required for loading of the plateimgsrc:https://en-cdn.bio-protocol.org/attached/image/20190819/20190819002731_8228.jpgimgsrc:https://en-cdn.bio-protocol.org/attached/image/20190819/20190819002828_1223.jpgFigure 1. Example of 96-well plate samples, standards and control loading plan. Std- standard sample; SB- sample blank; S- sample; Sub blk- substrate blank; DMSO- Dimethyl Sulfoxide. Plate readerSubstrate cleavage (release of AMC) is performed here by continuously monitoring the release over 2-3 h. Alternatively, end point analysis can be performed by measuring AMC after a defined time (30-40 min), but it is advisable to first monitor continuously to ensure that the time chosen is within the linear phase of the reactions.Read the plate with the next parameters:Temperature: room temperature.Kinetics: 2-3 h with a read-every 10 min.Mix: all wells should be mixed (medium mix, 5 s) before each read.Ex: 380 nm, Em: 460 nm.CalculationsStandard curve calculation:Prepare a graph of standard curve (Fluorescence unit [FU] against standard concentration) and calculate the standard curve equation. See Table 3, and Figure 2 for example.Table 3. Example of fluorescence units (FU) obtained for the different AMC standard concentrations. Only standard tubes 7-15 are read (Note 5).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190819/20190819002920_4365.jpgimgsrc:https://en-cdn.bio-protocol.org/attached/image/20190819/20190819003012_7975.jpgFigure 2. Example of AMC standard curve obtained from the fluorescence reads against AMC concentrations (µM)Sample calculations:If background controls (sample blanks or substrate blanks) give a substantial reading, these values should be subtracted from the experimental results.",
    "Subtract the sample blanks read from the sample results reads.Using the standard curve equation insert the sample fluorescence values obtained in the standard equation, to obtain AMC concentrations (Table 4).Plot the data on a graph (AMC concentration against time) (Figure 3).For each sample calculate the slope, obtained from the linear time points. This is an indicator for change in concentration over time (µM AMC min-1).Multiply the slope (µM min-1) by the filtration volume and divide by the resuspension volume (1x Lauber buffer added) (Table 5).Protein normalization: it is suggested to normalize each kinetic rate to its total protein amount. This will also allow comparing between the different samples. Protein concentration can be determined from the remaining sample (see Step A6). The protein content of the cell lysate can be estimated using a protein determination assay that is compatible with detergents present in the Lauber Buffer where no DTT is added (e.g., PierceTM BCA protein assay kit).Final units for metacaspase activity rate (cleavage of substrate rate) are µM AMC min-1. If results are normalized to mg L-1 protein, final units are µmol AMC mg protein-1 min-1 (For unit equation refer to Note 7, unit equation 1). Average the 3 results obtained from the 3 technical replicates (Table 5). Table 4. Example of FU obtained for sample 1 (3 technical sample replicates 1a, 1b and 1c) in 10 min time intervals with a total reaction time of 110 min and values obtained after inserting the FU in the standard curve equation (µM AMC).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190819/20190819003104_5798.jpgTable 5. Data calculation example, after the slope is obtained. The slope (µM AMC min-1) is multiplied by the filtration volume (ml) and divided by resuspension volume (ml) for normalization. Normalization to biomass (e.g., protein) is advised.",
    "Technical repeats are then averaged, to a final result of metacaspase activity, representing the rate of AMC release min-1 mg protein-1.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190819/20190819003202_6767.jpgimgsrc:https://en-cdn.bio-protocol.org/attached/image/20190819/20190819003242_9214.jpgFigure 3. Example of curves obtained from sample 1, and sample 2, representing the change in AMC concentration (µM) over time. The 3 curves represent 3 technical reads of each sample (1a, 1b and 1c or 2a, 2b and 2c)."
  ],
  "subjectAreas": [
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}