{
  "id": 12065,
  "origin_website": "Jove",
  "title": "In Vitro Assay to Study Tumor-macrophage Interaction",
  "procedures": [
    "1. Medium Preparation\nPreparation of the serum-free stem cell medium\nThaw the 50x B27 supplement, the epidermal growth factor (EGF, 20 μg/mL in 10 mM acetic acid with 0.1% BSA), and the fibroblast growth factor (FGF, 20 μg/mL in 10 mM acetic acid with 0.1% BSA).\nAdd 500 μL of EGF (final concentration 20 ng/mL), 500 μL of FGF (final concentration 20 ng/mL), 10 mL of 50x B27 to 500 mL of Dulbecco's Modified Eagle Medium/Nutrient Mixture F-12 (DMEM/F12) and 5 mL of 100x Penicillin/Streptomycin (Pen/Strep). Invert the bottle 4-6 times to mix, filter sterilize through a 500 mL 0.1 μm filtration cup. Mark the bottle and store at 4 °C.\nNOTE: The medium is good to use for up to a month at 4 °C.\nPrepare the MV-4-11 culture medium: Add 50 mL of fetal bovine serum (FBS) to 500 mL of Iscove's Modified Dulbecco's Medium (IMDM). Invert the bottle 4-6 times to mix, filter sterilize through a 500 mL 0.1 μm filtration cup. Mark the bottle and store at 4 °C.\nNOTE: The medium is good to use for up to a month at 4 °C.\nPrepare the tumor cell maintenance medium: Add 50 mL of FBS to 500 mL of Dulbecco's Modified Eagle Medium (DMEM). Invert the bottle 4-6 times to mix, filter sterilize through a 500 mL 0.1 μm filtration cup. Mark the bottle and store at 4 °C.\nNOTE: The medium is good to use for up to a month at 4 °C.\n2. Cell Preparation\nDay 1:\nThawing tumor cells\nWarm up the tumor cell maintenance medium (as described in step 1.3) at a 37 °C water bath for 20 min.",
    "Take the frozen U87, U87:EGFR, U87:EGFRvIII and U87:EGFR+EGFRvIII cells from the liquid nitrogen tank. Thaw the cells at the 37 °C water bath for 2 min.\n\tCAUTION: Be careful when taking the cells from the liquid nitrogen tank. Wear gloves with thermal protection and safety goggles as needed.\nSpray the tissue culture hood surface with 70% ethanol and wipe off 70% ethanol on the surface with paper towels.\nSpray the cryogenic vials containing cells and the medium bottle with 70% ethanol, wipe off 70% ethanol on the surface with paper towels, and bring them into the tissue culture hood.\nPipette 5 mL of tumor cell maintenance medium into a 15 mL sterile centrifuge tube. Invert the tube containing tumor cells 4-6 times to mix. Pipette all the cells into the 15 mL centrifuge tube. Invert the centrifuge tube 4-6 times to mix.\nCentrifuge the cells at 200 x g for 5 min at 4 °C. Aspirate the supernatant.\nWash the cells with 10 mL of phosphate buffered saline (PBS). Centrifuge the cells at 200 x g for 5 min at 4 °C. Aspirate the supernatant.\nResuspend the cells in 12 mL of tumor cell maintenance medium (as described in step 1.3). Pipette up and down 3-5 times to mix. Transfer the cells into a T75 cell culture flask.\nGrow the cells in a 37 °C incubator with 5% CO2. Put the tumor cell maintenance medium back to the 4 °C fridge.\nDay 2:\nCheck the cells under the microscope. Change the medium if needed. Cells should grow in a monolayer in culture.\nDay 3:\nThawing MV-4-11 cells\nWarm up the MV-4-11 culture medium (as described in step 1.2) at a 37 °C water bath for 20 min.",
    "NOTE: MV-4-11 can be changed to primary macrophages or other macrophage cell lines, depending on the need of the specific study.\nTake the frozen MV-4-11 cells from the liquid nitrogen tank. Thaw the cells at a 37 °C water bath for 2 min.\nCAUTION: Be careful when taking the cells from the liquid nitrogen tank. Wear gloves with thermal protection and safety goggles as needed.\nSpray the tissue culture hood surface with 70% ethanol and wipe off 70% ethanol on the surface with paper towels.\nSpray the cryogenic vials containing cells and the medium bottle with 70% ethanol, wipe off 70% ethanol on the surface with paper towels, and bring them into the tissue culture hood.\nPipette 5 mL of MV-4-11 culture medium (as described in step 1.2) into a 15 mL sterile centrifuge tube. Invert the tube containing tumor cells 4-6 times to mix. Pipette all the cells into the 15 mL centrifuge tube. Invert the centrifuge tube 4-6 times to mix.\nCentrifuge the cells at 200 x g for 5 min at 4 °C. Aspirate the supernatant.\nWash the cells in 10 mL of PBS and centrifuge the cells at 200 x g for 5 min at 4 °C. Aspirate the supernatant.\nResuspend the cells in 12 mL of MV-4-11 culture medium (as described in step 1.2). Gently pipette up and down 3-5 times to mix. Transfer the cells into a T75 cell culture flask.\nGrow the cells in a 37 °C incubator with 5% CO2.\nSplitting tumor cells\nWarm up the serum-free stem cell medium (as described in step 1.1) at a 37 °C water bath for 20 min.",
    "Spray the tissue culture hood surface with 70% ethanol and wipe off 70% ethanol on the surface with paper towels. Take the cell detachment solution from the fridge. Spray the medium and cell detachment solution bottles with 70% ethanol, wipe off 70% ethanol on the surface with paper towels and bring them into the tissue culture hood.\nNOTE: Do not pre-warm the accutase cell detachment solution.\nTransfer the tumor cell culture from the incubator into the tissue culture hood. Aspirate the medium, add 2 mL of cell detachment solution into the flask.\nNOTE: Rinsing with PBS before adding accutase is optional here.\nSet the flask in the hood. Check if the tumor cells round up every minute. Once the tumor cells round up, gently tap the side of the flask to help the cells detach from the flask.\nPipette 8 mL of serum-free stem cell medium into the flask, pipette up and down 3 times to mix, and transfer the cells into a 15 mL sterile centrifuge tube. Centrifuge the cells at 200 x g for 5 min at 4 °C. Aspirate the supernatant.\nWash the cells in 10 mL of PBS. Pipette up and down 3-5 times to mix. Centrifuge the cells at 200 x g for 5 min at 4 °C. Aspirate the supernatant.\nNOTE: This step is optional.\nResuspend the cells in 10 mL of serum-free stem cell medium (as described in step 1.1). Pipette up and down 3-5 times to mix. Take 10 μL of the cells and mix with 10 μL of Trypan Blue solution. Pipette 10 μL of the mixture into the counting slide, quantify living cell number using an automatic cell counter.",
    "Adjust the cell density to 2.5 x 105 cells/mL with serum-free stem cell medium (as described in step 1.1), and seed 2 mL of the cells into each well of a 6-well cell-culture plate. For each type of cells, seed 3 wells (triplicate sample). At the same time, prepare 6 wells with 2 mL of serum-free stem cell medium only (no cells).\nNOTE: These samples will be used: 1) as negative controls and 2) for adjusting conditioned medium volume based on cell numbers.\nPut the 6-well plates in a 37 °C incubator with 5% CO2. Allow the cells to grow for 24 h.\n3. In Vitro Macrophage Attraction Assay\nPreparation of conditioned media\nWarm up the tumor cell maintenance medium (as described in step 1.3) at a 37 °C water bath for 20 min.\nSpray the tissue culture hood surface with 70% ethanol and wipe off 70% ethanol on the surface with paper towels. Take the cell detachment solution from the fridge. Spray the bottles of the medium and the cell detachment solution with 70% ethanol, wipe off 70% ethanol on the surface with paper towels and bring them into the tissue culture hood.\nTake the 6-well plates out from the incubator. Carefully pipette the conditioned media into 15 mL sterile centrifuge tubes. Put the tubes on ice. Pipette the media in the “media only” well into a separate 15 mL sterile centrifuge tube.\nNOTE: Before this step, make sure to check under the microscope to see if the cells attach. If not, one can use coated plates at step 2.4.8 to allow better attachment or include the floating cells in the counting step.",
    "Add 0.5 mL of cell detachment solution into each well of the 6-well plate. Check if the tumor cells round up every minute. Once the tumor cells round up, gently tap the side of the plate to help the cells detach.\nPipette 2.5 mL of tumor cell maintenance medium into the well, pipette up and down 3 times to mix and transfer the cells into a 15 mL sterile centrifuge tube. Take 10 μL of the cells and mix with 10 μL of Trypan Blue solution. Pipette 10 μL of the mixture into the counting slide and quantify the number of living cells using an automatic cell counter.\nAdjust the volume of the conditioned media according to cell number using the serum free stem cell medium (37 °C incubation overnight). For example, if Well A has 3x as many live cells as the well with the least number of cells, dilute its conditioned media 1:3. This step is used to control difference caused by cell proliferation rate.\nNOTE: The reason to use serum free stem cell medium with 37 °C incubation overnight is to control the possible change in the media with prolonged 37 °C exposure.\nFilter the conditioned media through 0.45 μm filters. Put the conditioned media on ice.\nNOTE: This step removes cells and cell debris in the conditioned media.\nPreparation of MV-4-11 cells\nWarm up the IMDM medium (without FBS) at a 37 °C water bath for 20 min.\nSpray the tissue culture hood surface with 70% ethanol and wipe off 70% ethanol on the surface with paper towels. Spray the medium bottle with 70% ethanol, wipe off 70% ethanol on the surface with paper towels and bring them into the tissue culture hood.",
    "Take the flask of MV-4-11 cells into the tissue culture hood. Pipette 10 mL of cells into a 15 mL sterile centrifuge tube. Take 10 μL of cells and mix with 10 μL of Trypan Blue solution. Pipette 10 μL of the mixture into the counting slide and quantify the number of living cells using an automatic cell counter. Centrifuge the cells at 200 x g for 5min at 4 °C. Aspirate the supernatant.\nWash the cells with 10 mL of PBS and centrifuge the cells at 200 x g for 5 min at 4 °C. Aspirate the supernatant.\nResuspend the cells in IMDM medium (without FBS) for a final cell density of 1x106 cells/mL.\nNOTE: The cell number of macrophages used here can be adjusted.\nTranswell assay \nNOTE: For this step, use a cell migration assay kit or purchase the reagents and insert separately. For MV-4-11 cells, choose Transwell inserts with 5 μm pore size. To detect macrophage migration, directly quantify the number of macrophages in the lower chamber or use colorimetric/fluorimetric methods. Here, we demonstrate the assay using the colorimetric method.\n\t\nBring the 24-well plate, the insert and the reagents to room temperature.\nAdd 250 μL of MV-4-11 cells prepared above into each insert.\nAdd 400 μL of conditioned medium/medium only (with overnight incubation at 37 °C, these samples serve as the negative control) to the lower chambers of the 24-well plate. For each tumor line or control, use triplicate samples. Avoid bubbles between the insert and the conditioned medium. Bubbles will inhibit macrophages from migrating to the bottom wells.\nIncubate the plates in a 37 °C incubator with 5% CO2 for 4 h.\nNOTE: The incubation time can be adjusted. Cells migrating into the lower chambers can be seen under the microscope.",
    "Gently tap the insert on the inner wall of the same well and discard the insert. As MV-4-11 cells grow in suspension, cell detachment solution or trypsin treatment is not needed here.\nGently pipette the cells in the wells up and down 3 times to mix. Transfer 225 μL of cell suspension to a black-walled 96-well plate suitable for fluorescent measurement.\nDilute the CyQuant dye 1:75 with 4x lysis buffer. Vortex briefly and spin down the solution. Add 75 μL of solution to each well of the 96-well plate. Incubate 15 min at room temperature.\nRead fluorescence using the 480/520 nm filter set with a fluorescence plate reader.\nAnalyze data by subtracting the blank and normalizing to the control tumor cell line.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}