{
  "id": 18471,
  "origin_website": "Jove",
  "title": "Retroductal Submandibular Gland Instillation and Localized Fractionated Irradiation in a Rat Model of Salivary Hypofunction",
  "procedures": [
    "All procedures were approved by the LSU Health, Shreveport, Animal Care and Use Committee and were in accordance with the NIH guidelines for the care and use of laboratory animals.\n1. Cannulation of Rat Submandibular Salivary Glands\nPreparation of Syringe-Tubing Assembly\nCut a 10 cm length of PE10 polyethylene tubing with a scalpel. Hold both ends of the tubing between the index finger and thumb. Heat the middle section of the tubing above a gentle flame, and gently stretch the softened tubing to double its length by pulling both sides.\nCut the tubing in the middle with a scalpel at an angle of 45o to get 2 cannulae - each with a tapered end. Expand the non-tapered end of the cannula by fitting it over a 29 G needle of 0.5 cc Insulin syringe.\nRemove the cannula, and draw 220 μl of saline solution into the syringe. Tap to dislodge air bubbles. Fit the cannula over the needle, and push the syringe plunger to expel air and ensure a free flow of solution through the cannula. Adjust the volume to 200 μl.\nIntra-Oral Cannulation of Submandibular Gland Duct\n\tNOTE: Autoclave instruments prior to the procedure, and sterilize in-between procedures in a hot bead sterilizer.\n\t\nWeigh the Sprague Dawley rat, and dispense the calculated volume of ketamine (42 mg/kg)/ xylazine (8 mg/kg)/ acepromazine (1.4 mg/kg) mix in a hypodermic syringe.\nRestrain the animal by grasping the base of the tail between the index finger and the thumb of one hand and sliding the other hand over the body to grasp it. Rest the index and middle fingers along the sides of the head while hold the torso with the thumb and remaining fingers.",
    "Inject the anesthetic in the hind limb musculature. Confirm depth of anesthesia by toe pinch and palpebral reflex. Apply eye lubricant to prevent dryness while animal is under anesthesia.\nPlace the animal on a specially-designed platform (Figure 1), and engage the upper incisor teeth on the transverse bar. Pull the lower jaw down by looping a rubber band around the lower incisors and anchoring it to the platform.\nPass a sterile suture through the tongue and lift it up to raise the floor of the mouth. Clamp the sutures with a hemostat, and pass it over the transverse bar.\nExpand the cheeks with a custom-built cheek spreader (Figure 1), and under a dissecting microscope locate the sublingual papillae on the floor of the mouth.\nGrasp the tapered end of the preformed PE10 tubing using a delicate forceps. Gently manipulate the tip of the cannula into the ductal orifice on the sublingual papillae. Confirm placement of the cannula by threading it 3 - 5 mm into the duct; ensure that it passes without any obstruction.\nSubmandibular Gland Instillation\nInject atropine (0.5 mg/kg) subcutaneously in the scruff of the neck, and wait 10 min for a reduction in salivary secretions.\nSecure the cannula to the duct orifice with a drop of cyanoacrylate (glue), and allow to dry. Instill the solution in the gland (200 μl/gland) by slowly pressing the syringe plunger at a rate of ~ 50 μl/min.\nCrush the tubing with a hemostat, and carefully remove the syringe. Retain the tubing in the duct for 30 - 60 min until the animal regains consciousness. Remove the suture that holds the tongue.",
    "Transfer the animal to a separate cage, and use a heat lamp to keep it warm during recovery. Do not leave the animal unattended until it has regained consciousness to maintain sternal recumbence.\nAfter the animal is fully ambulatory, house it at the vivarium with unrestricted access to food and water.\n2. Localized Fractionated Irradiation of Submandibular Glands\nRestrain the animal as described before, and anesthetize with intramuscular administration of ketamine (33 mg/kg) /xylazine (6 mg/kg)/ acepromazine (1 mg/kg) mix in the hind limb. Confirm depth of anesthesia, and apply lubricant to the eyes.\nPlace the animal supine on the linear accelerator tabletop, and extend its neck by tilting the head. Collimate the radiation field (3 cm slit width) to encompass the area from the lower border of the mandible to the top of the sternum.\nPlace a 1 cm tissue-equivalent bolus over the region, and adjust the distance between radiation source and top of the bolus to 100 cm.\nIrradiate the animal (2.5 Gy) using a 6 MV photon beam of a linear accelerator. Dose rate, field size, and distance from radiation source to bolus surface will dictate the exposure time. In the current set up, animals were irradiated at a dose rate of ~ 1 Gy/min.\nRepeat exposure; 2.5 Gy/day for a total of 8 days; 4 days/ week with a 2-day interval in between. Keep the animal warm during recovery. Transfer the animal to the vivarium after it is fully ambulatory.\nCollect stimulated submandibular gland saliva 8 weeks after radiation to measure gland function14. Euthanize animals under anesthesia by cardiac perfusion of cold 4% paraformaldehyde/ phosphate buffered saline pH 7.2. Extirpate submandibular glands for histologic and immunohistochemical analyses14.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}