{
  "id": 16187,
  "origin_website": "Jove",
  "title": "Manual Blot-and-Plunge Freezing of Biological Specimens for Single-Particle Cryogenic Electron Microscopy",
  "procedures": [
    "1. Prepare the manual plunging environment\nNOTE: Estimated operating time: 5-30 minutes\nLocate the manual plunger in a 4 °C cold room where a humidifier can be co-located to maintain the room close to 100% relative humidity (RH) (Figure 1A).\n\tCAUTION: Please consult with the institution's Environmental Health and Safety guidelines for the safe location of the manual plunger and recommended operations.\nPrior to grid preparation, turn on the humidifier in the cold room to ensure the RH of the cold room is ≥ 95 %.\n\tNOTE: Grid preparation in low humidity can result in dehydration of thin films, alteration of buffer components due to evaporation, and a decrease in grid-to-grid reproducibility46. It is not recommended to freeze grids at <80 % RH.\nEnsure the temperature of the cold room is at 4 °C.\nLocate the manual plunger away from strong air currents (i.e., away from air conditioning unit vents) as they can lead to turbulence near grids and/or prominent ice accumulation on cold surfaces.\n2. Prepare plunging materials and accessories\nNOTE: Estimated operating time: 1-5 minutes\nUse clean scissors to cut blotting paper circles into 1-1.5 cm wide and ~9 cm long strips. Avoid touching the center of the blotting paper and discard the smaller end pieces. It is important to ensure that the blotting paper strips are dry, clean, and free of contaminants. Separate the strips and place them in a 100 mm Petri dish.\nPlace a 22x22 mm square glass coverslip into a separate 60 mm glass Petri dish. This coverslip-containing glass Petri dish will be used to store, transfer, and glow-discharge grids.",
    "NOTE: It is recommended to use an air-duster can to remove any visible debris from the slide prior to adding grids. An anti-static gun can also be used to remove any static electricity that accumulates.\nAssemble and label grid storage boxes.\nAcquire 4 to 6 clean and dry clamping tweezers and locate them to the manual plunger. Visually inspect each tweezer prior to plunging to ensure they are not damaged and are free of contaminants.\n3. Prepare the cryogen dewar and manual plunger\nNOTE: Estimated operating time: 5-15 minutes\nInstall the platform base at the bottom of the plunging dewar. Place the ethane vessel dewar on top of the platform base, add the brass ethane vessel, and then install the spinning grid storage platform.\n\t\nOnce liquid nitrogen (LN2) is added to the plunging dewar, the height of the platform base can no longer be adjusted. Ensure that the grid base is installed properly and is level to limit grid and/or tweezer damage due to improper plunger height.\nPrior to freezing, check the manual plunger and all ancillary equipment to ensure they are functioning properly to limit sample and/or grid loss.\nPrior to each freezing session, replace the tape on the manual plunger arm used to hold the tweezers. The high humidity of the room can deteriorate the tape adhesive and decrease the ability of the tape to hold the tweezers, increasing the likelihood of tweezer damage and/or grid loss.\nAdjust the lamp(s) near the manual plunger to ensure there is sufficient light to monitor sample wicking and ensure grid transfer is easily visualized to prevent grid damage and/or loss (see step 3.7). Use a ring lamp directly behind the plunger to visualize liquid movement and a flexible arm task light near the dewar to illuminate the frozen grids.",
    "Adjust the foot pedal tension to ensure the dewar plunging arm is securely retained in place while in the raised position and is fully released when the pedal is depressed. Perform several \"dry\" runs prior to sample application to ensure the plunger is working properly.\n\tNOTE: Improper adjustment of the foot pedal tension will result in premature release of the plunging arm (i.e., tension is set too low) and grid loss or incomplete plunging of the grid into the ethane vessel (i.e., the tension is set too high).\nPlace the plunging dewar at the base of the manual plunger directly below the plunging arm and secure it in place. Attach a pair of tweezers to the plunging arm using the attached tape. While holding the manual plunging arm, depress the foot pedal to carefully lower the plunging arm and adjust the travel of the plunging arm to ensure the grid will locate within the middle of the ethane vessel.\nUse the bump stop at the top of the plunging arm to determine the final position of the plunging arm when the foot pedal is fully depressed (Figure 1B). Adjust the bump stop height on the plunging arm to adjust the location of the grid in the ethane vessel (Figure 1C).\n\tNOTE: Improperly setting the plunging arm height can lead to the grid and/or tweezer damage (e.g., plunging arm height is set too low) or inadequate vitrification (e.g., plunging arm height is set too high).\nLocate the dewar outside the cold room and proceed to preparing liquid ethane (step 4).\n4. Prepare the cryogen\nNOTE: Estimated operating time: 10-30 minutes\nAssess the ethane tank, regulator, tubing, and ethane dispensing tip for any signs of damage. Immediately report and rectify any signs of damage before proceeding.",
    "CAUTION: Compressed ethane and ethane:propane gas mixes are flammable and can pose a serious threat to life and/or result in injury if improperly handled. Please consult an expert if unsure how to operate or handle compressed gas tanks. Please refer to the institution's Environmental Health and Safety guidelines when handling flammable compressed gases. In addition, liquified ethane is a powerful cryogen that can pose a serious threat to life and/or injury if not handled properly. Please refer to the institution's Environmental Health and Safety guidelines when handling cryogens.\nAcquire sufficient LN2 in an appropriate LN2 handling dewar (i.e., 3-4 L is typical for grid preparation and storage).\n\tCAUTION: LN2 is a cryogen that can pose a serious threat to life and/or injury if not handled properly.\n\t\nEnsure all personal protective equipment are utilized to minimize the risk of injury. The vapor of LN2 is an asphyxiant and should be handled in well-ventilated areas. Please consult an expert if unsure how to operate or handle cryogenic vessels and cryogens. Please refer to the institution's Environmental Health and Safety guidelines when handling cryogens. For situations in which liquid nitrogen cannot be used in a cold room, we recommend plunge freezing in a cool and well-ventilated space.\nOutside of the cold room, cool down the plunging dewar by pouring LN2 directly into the brass ethane vessel until the liquid nitrogen level reaches the top of the ethane vessel (i.e., just above the platform). Top off the LN2 outside the ethane vessel as needed. Proceed to the next step when the LN2 stops bubbling violently (approximately 5 minutes).\n\t\nAdd LN2 directly to the brass ethane vessel to sufficiently cool the vessel prior to condensing ethane gas. Failure to properly cool the brass ethane vessel will dramatically increase the time it takes to condense ethane.",
    "Once the dewar has reached LN2 temperature, avoid overfilling the dewar such that LN2 spills into the ethane vessel.\nEthane comes as a compressed gas and needs to be liquefied for use. The ethane tank utilizes a high-purity dual-stage regulator to control the gas flow. Connect tubing to the regulator outlet valve and use a 14-gauge flat metal dispensing tip connected at the end for dispensing ethane.\nPrior to opening the ethane main tank valve, make sure the pressure adjusting knob and outlet valve are closed all the way. Fully open the main tank valve and then open the outlet valve to ~50%. Slowly open the pressure adjusting knob until a slow gas flow is observed. Use the outlet valve to fine-tune the gas flow.\n\tCAUTION: Always point the metal dispensing tip away from self when opening valves or making gas flow adjustments.\nSlowly start the gas flow and assess the flow rate by inserting the tip of the ethane gas line into a small beaker of deionized water. Adjust the gas flow until the flow rate moderately disturbs the water.\n\t\nAdjust the gas flow rate to ensure proper ethane condensing occurs - too slow of a flow rate will cause the ethane gas to solidify in the dispensing tip and too fast of a flow rate will result in intense bubbling and prevent freezing.\nPrior to inserting the tip of the ethane gas line into the brass ethane vessel, clean and wipe the dispensing tip with delicate task wipes to remove any water.",
    "In a smooth and quick motion, locate the gas dispensing tip at the bottom of the brass ethane vessel and begin moving the dispensing tip in a slow circle around the bottom of the ethane vessel. Solid ethane will form immediately but will quickly liquefy as more ethane gas is added/condensed.\n\t\nContinue to move the metal ethane dispensing tip around at the bottom of the ethane vessel to liquefy the solid ethane. Fill up the ethane vessel to ¾ full of liquid ethane (2-3 threads from the top). Stop ethane gas flow by carefully removing the metal ethane dispensing tip from the brass ethane vessel and closing the outlet valve.\nTop off the plunging dewar with LN2 pouring gently on the side of the dewar to avoid LN2 addition to the brass ethane vessel, until the liquid level just touches the brass ethane vessel. Place the foam lid on the plunging dewar to facilitate ethane solidification.\n\t\nLN2 must directly contact the brass ethane vessel to aid in the solidification of ethane. After approximately 5 minutes, the ethane within the brass vessel will become completely frozen solid. Add more LN2 until it just touches the ethane vessel and proceed to the next step.\nIf the ethane has not frozen solid, then the brass ethane vessel is not cold enough for the remaining steps. Add more LN2 until it just touches the ethane vessel and wait an additional 5 minutes. Ensure that the ethane within the brass vessel is completely frozen solid.\nOpen the gas outlet valve to produce an ethane gas flow at a similar rate as determined in step 4.6. Vertically place the metal ethane dispensing tip into the solid ethane and continue to move the ethane dispensing tip in a circular motion to melt the solid ethane.",
    "Continue to add ethane until it is level with the top of the brass ethane vessel. Slowly remove the tip from the ethane vessel and close the ethane tank outlet valve. Cover the dewar with the lid for ~1-4 minute(s) to let the ethane solidify around the edges of the brass ethane vessel.\n\t\tNOTE: An ideal ethane vessel will have a 2-3 mm symmetric ring of solid ethane at the perimeter of the brass ethane vessel with liquid ethane in the center (Figure 1D and Figure 2).\nEnsure that the ethane be as cold as possible without solidifying to ensure proper vitrification of the biological specimen. Failure to properly prepare the liquid ethane can result in inadequate vitrification of the specimen, ice accumulation, and/or loss of specimen, each contributing to the deterioration of specimen quality for imaging.\nIf a solid ring of ethane does not form after 2-3 minutes, add more LN2 to the dewar and cover for 2-5 more minutes.\nIf the ethane is solidifying too quickly, then use a large pair of clean tweezers to gently warm the ethane vessel and/or solid ethane to prevent complete ethane solidification. Once the ethane and LN2 are stable, close all the ethane tank valves and locate the plunging dewar to the manual plunger. Secure the plunging dewar to the manual plunger.\n\t\tCAUTION: Be extra careful when transferring the dewar as LN2 can spill into the ethane vessel and solidify the liquid ethane. If need be, a clean set of tweezers can be used to melt any solid ethane in the middle of the vessel.",
    "Test the location of the ethane dewar with a pair of empty tweezers to ensure the tweezer tip locates at the center of the ethane vessel and there is sufficient space for the grid and tweezer tip inside the liquid ethane (Figure 1D).\n\t\nIf the solid ethane ring is too thick for easy grid handling, then use a pair of room temperature, clean tweezers to melt the solid ethane and create more freezing area at the center of the ethane vessel.\n5. Prepare EM grids\nNOTE: Estimated operating time: 1-5 minutes\nAdd the grid storage box(es) to the dewar, unscrew the grid storage box lid(s), and make sure each lid can freely rotate to a new grid slot.\nCarefully transfer grids from the grid storage box to the edge of the square glass coverslip with ~30-40% of the grid off the slide edge. Ensure that the grid foil is facing up. Ensure grids are covered when not in use. Placing the grids over the edge of the square glass coverslip provides ease of grid handling and decreases the chance of bending or damaging the grid during transfer.\n\tNOTE: 4-6 grids are typically prepared at a time.\nRender grids hydrophilic using a glow discharger or plasma cleaner.\n\tNOTE: Please refer to the recommended guidelines for grid cleaning provided by the glow discharger/plasma cleaner manufacturer.\n\t\nUse the grids within 10 minutes of plasma cleaning as the grids lose hydrophilicity and grid-to-grid reproducibility decreases after this time.\n6. Prepare cryoEM specimen by plunge freezing\nNOTE: Estimated operating time: >10 minutes (~1-3 min per grid)\nUse a clean and dry clamping tweezer to pick up a cleaned grid, slide the plastic clamp down to fix the grid in place, and gently tap the tweezers to ensure the grid is properly secured.",
    "Handle grids by the outer ring to prevent damage to the grid foil.\nApply 1 to 5 µL of sample to the prepared side (e.g., front or foil side) of the grid.\n\tNOTE: The optimal volume and blotting time depends on the sample and needs to be optimized for each sample; larger volumes and more viscous samples require longer blotting times.\nSecure the tweezer-grid-sample assembly to the manual plunging arm by wrapping tape around the tweezer handle.\n\t\nFace the sample towards the user for traditional front blotting. If the sample requires back blotting, then locate the sample away from the user.\nHold a clean, dry, cut piece of blotting paper between the thumb and index finger of each hand.\n\t\nOnly handle the blotting papers from the edges and never touch the center as oils and other contaminants from hands/gloves can alter grid quality.\nRest hands on the edge of the plunging dewar to establish a stable position. Locate the blotting paper parallel to the grid surface approximately 1 cm away from the grid surface.\n\t\nUse the middle section of the blotting paper to allow for complete fluid mobility and even wicking across the grid surface.\nGently slide and rotate the thumb and ring fingers towards each other to bend blotting paper toward the grid to initiate blotting. Maintain contact between the blotting paper and the grid surface during the entire blotting process.\n\t\nDirectly contact the blotting paper to the grid surface and maintain consistent contact across the grid surface.\nGently bending the blotting paper decreases bending of the grid and/or damage to the grid surface, and results in more consistent ice across the grid (Figure 3A).\nObserve the mobile liquid front and once it stops progressing into the blotting paper begin counting for 4 to 6 seconds.",
    "NOTE: Counting can occur once the blotting paper contacts the grid surface but lower grid-to-grid reproducibility can occur. The total blot time will depend on the grid type, foil type, sample concentration, and sample type (e.g., soluble versus membrane versus filamentous proteins). For more viscous samples longer blot times (e.g.., 5 to 7 seconds) will be required.\n\t\nImportant: Develop a reliable and consistent counting scheme to greatly enhance reproducibility during the freezing process.\nMove the left, right thumb and index fingers in opposite directions to remove the blotting paper in a \"snapping motion\" away from the grid surface. Immediately depress the foot pedal to release the plunging arm and plunge the grid into liquid ethane.\n\t\nSimultaneously remove the blotting paper and press the foot pedal to plunge the grid into the ethane as soon as possible for best freezing results. The longer the time between blotting paper removal and plunging, the more evaporation of thin films will occur and decrease grid-to-grid reproducibility.\nUse one hand to stabilize the clamping tweezers, unwind tape carefully from around the tweezers and manual plunging arm.\n\t\nAlways maintain contact with the tweezer to prevent movement of the tweezer-grid and limit grid damage that occur from knocking the grid against the solid ethane.\nOnce clamping tweezers are free from the manual plunging arm, maintain the tweezer in one hand resting on top of the plunging dewar, ensure the grid remains in the liquid ethane. Carefully slide the plastic clamp away from the grid so the grid can be transferred. Maintain pressure on the tweezers to retain the grid.\n\t\nWith one swift motion, quickly transfer the grid from the ethane vessel into the LN2 reservoir. Carefully place the grid in the grid storage box.",
    "NOTE: Some ethane may solidify on the grid surface. Opening the tweezer slightly will break the ethane and allow for the grid to be dropped into the grid box.\nWrap the tip of the tweezers in a delicate task wipe to prevent frost accumulation. Set aside until the tweezers have returned to room temperature.\n\t\nHave 4 to 6 tweezers on hand for ease of use. Each tweezer will be used for sample freezing and warmed before subsequent use.\nRepeat steps 6.1-6.11 for each grid.\nOnce freezing has culminated, securely close the grid box and transfer to a proper storage location.\nCarefully dispose of the liquid ethane and LN2 and store all materials in a dry location.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}