{
  "id": 8643,
  "origin_website": "Jove",
  "title": "Real-time In Vitro Monitoring of Odorant Receptor Activation by an Odorant in the Vapor Phase",
  "procedures": [
    "1. Hana3A Cells Culture\nPrepare M10 (Minimum Essential Medium (MEM) plus 10 % v/v fetal bovine serum (FBS)) and M10PSF (M10 plus 100 µg/mL penicillin-streptomycin and 1.25 µg/mL amphotericin B).\nCulture the cells in 10 mL of M10PSF in a 100 mm cell culture dish in an incubator set at 37 °C and 5% carbon dioxide (CO2).\nDivide the cells every 2 days at a 20% ratio: when 100% confluence of cells (approximately 1.1 x 107 cells) is observed under a phase-contrast microscope, aspire the media and wash the cells gently with 10 mL of phosphate-buffered saline (PBS).\nAspirate PBS and add 3 mL of 0.05% trypsin-ethylene diamine tetraacetic acid (EDTA, 0.48 mM). Let act for approximately 1 min, until the cells dissociate from the plate.\nAdd 5 mL of M10 to inactivate the trypsin and eventually detach the cells still attached to the plate by pipetting up and down.\nTransfer the volume (8 mL) to a 15 mL tube and centrifuge at 200 x g for 5 min. Aspirate the supernatant and resuspend the cells into 5 mL of M10PSF by pipetting up and down to break any cell mass. Avoid creating bubbles in the tube.\nTransfer 1 mL of the resuspended cells solution in a new 100 mm cell culture dish and add 9 mL of fresh M10PSF. Incubate at 37 °C and 5% CO2.\n2. Preparation of the Cells for Transfection\nEvaluate the confluence, or the number of cells, by observing them under a phase-contrast microscope. At least 10% confluence (approximately 1.1 x 106 cells) is needed for one plate.\nAspirate the media and wash the cells gently with 10 mL of PBS. Aspirate PBS and add 3 mL of EDTA. Let act for approximately 1 min at room temperature, until the cells dissociate from the plate.",
    "Add 5 mL of M10 to inactivate the trypsin and eventually detach the cells still attached to the plate by pipetting up and down. Transfer the volume (8 mL) to a 15 mL tube and centrifuge at 200 x g for 5 min.\nAspirate the supernatant and resuspend the cells into 5 mL of M10PSF by pipetting up and down to break any cell mass. Avoid creating bubbles in the tube.\nDepending on the number of plates to be transfected, transfer an appropriate amount of cells in a reservoir with the proper corresponding volume of M10PSF. One 96-well plate should be plated with 1/10 of a 100% confluent 100 mm dish (approximately 1.1 x 106 cells) diluted in M10PSF to reach a total volume of 6 mL. For one 96-well plate starting with a 100% confluence 100 mm dish, add 500 µL from the 5 mL of resuspended cells to 5.5 mL of fresh M10PSF. Mix the cells and M10PSF without generating air bubbles.\nPipette 50 µL of the suspended cells into each well of the 96-well plate using a multichannel pipette. Incubate overnight at 37 °C and 5 % CO2.\n3. Plasmid Transfection\nObserve the 96-well plate under a phase-contrast microscope to assure a cell confluence between 30% and 50%.\nPrepare a first transfection mix that contains the plasmids common to the entire plate (RTP1S, OR and Glosensor protein, see Table of Materials) following the volumes in Table 1. Notice that the quantity of Rho-tagged OR should be divided by the number of ORs if several ORs.\nNOTE: We strongly advice to add an empty vector negative control (here Rho-pCI) and any positive control (OR known to respond to the tested odorant) to the experiment plan.",
    "Prepare a second transfection mix containing 500 µL of MEM and 20 µL of Lipofectamine 2000 reagent (valid for one 96-well plate, see Table of Materials). Add the second mix to the first one, and gently mix by pipetting up and down and incubate for 15 min at room temperature. Add 5 mL of M10 and mix gently.\nReplace the M10PSF in the previously platted 96-well plate by 50 µL of the final transfection media. Incubate in an incubator set to 37 °C and 5% CO2 and vacuum the chamber of the luminometer overnight following the procedure described in step 6.\n4. Substrate Incubation\nObserve the 96-well plate under a phase-contrast microscope to assure a cell confluence between 60% and 100%. Prepare a stimulation solution of Hank’s Balanced Salt Solution (HBSS) containing 10 mM of hydroxyethyl piperazineethanesulfonic acid (HEPES) and 5 mM of D-glucose.\nDilute 75 µL of the cAMP reagent (see Table of Materials) solution to 2.75 mL of the stimulation solution. Remove the transfection medium from the 96-well plate and wash the cells by adding 50 µL of fresh stimulation solution to each well.\nRemove the stimulation solution and add 25 µL of cAMP reagent solution prepared in step 4.2 to each well. Incubate the 96-well plate at room temperature in a dark and odor-free environment (for example, a clean empty drawer far away from chemicals or any odorant source) for 2 h.\n5. Odorant Stimulation",
    "First, equilibrate the luminometer chamber with volatile odorant molecules. Dilute the odorant to the desired concentration in 10 mL of mineral oil (Figure 2A). Before the end of the cAMP reagent incubation time, add 25 µL of the odorant solution in a new 96-well plate (not the one containing the cells). Incubate this odorant plate at room temperature in the luminometer chamber for 5 min (Figure 2B) (no luminometer recording is required here).\nSet the luminometer to record the luminescence with 0 s of delay during 20 cycles of plate measurement of 90 s with 0.7 s of interval between cycles.\nRight before reading the plate, remove the odorant plate from the chamber. Add 25 µL of odorant between the wells of the 96-well plate containing the cells (do not add the odorant in the wells containing the cells) and quickly start the luminescence measurement of all wells for 20 cycles within 30 min (Figure 2C).\n6. Removal of remaining odorant inside the Luminometer\nOpen the door of the luminometer. Insert the tube connected to the vacuum pump.\nVacuum odorants in the reading chamber extensively (at least 2 h, preferably overnight) between two odorants to avoid cross contamination of odor volatiles from one experiment to another. Replace with fresh air by sending compressed air during 5 min before incubating the next odorant.\n7. Data Analysis\nExport the data from the luminometer software.\nAverage the replicates of the same OR for each recording time. Calculate the normalized OR response to any eventual control (e.g., Empty vector, Figure 3A and representative results section) by dividing the control averaged value to the OR averaged value at each recording time (Figure 3B and representative results section).",
    "Normalize the each OR response to their basal activity by dividing the averaged OR response at 0 s to each recording time response (See Figure 3C and representative results section).\nCalculate the area under the curve of each OR to obtain a single OR response value. To do so, sum all the luminescence values of each recording time for each OR.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}