{
  "id": 17085,
  "origin_website": "Jove",
  "title": "Ear Plaster Therapy as a Safe and Effective Treatment for Gestational Vomiting",
  "procedures": [
    "All procedures of this study were conducted by clinical trial registration and were approved by the ethical institution of the Affiliated Hospital of Chengdu University of Traditional Chinese Medicine (Filing No. 2022SL-015). All patients in this study were fully provided with informed consent and consented to the investigators' use of data, images, and related video filming during the trial. Eligible patients were recruited (from January 2023 to April 2023) through leaflets, word communication, and doctors' recommendation in the inpatient department of the Hospital of Chengdu University of Traditional Chinese Medicine.\n1. Patient selection\nInclusion criteria\n\t\nConfirm intrauterine pregnancy. Identify early pregnancy vomiting as the main complaint, referring to the Guidelines for the Diagnosis and Management of NVP published by the American College of Physicians in 201810, and ensure that the participants meet the diagnostic criteria for clinical NVP.\nVerify that participants are not currently participating in other clinical trials.\nExclusion criteria\n\t\nExclude individuals with other pathological conditions causing NVP, such as hyperemesis gravidarum, pregnancy-associated viral hepatitis, or pregnancy-associated acute gastroenteritis.\nExclude participants who refuse treatment with ear plaster therapy.\nExclude individuals with severe NVP or allergies to the medication or its excipients and participants with auricular injuries.\nExclude those who have been treated for NVP within the last 2 weeks.\nDisposal of dropout cases\n\t\nWithdraw participants from the trial if they are unable to sustain adherence to the treatment. Allow participants to voluntarily withdraw from the study if they choose to do so.\nCriteria for termination of the trial\n\t\nTerminate the participants who develop serious complications or experience disease progression during the study. Cease the trial if participants develop serious adverse reactions.\n2. Patient grouping and treatment plan\nRecruit twenty patients and randomly assign them to either the experimental group or the control group.",
    "Provide the control group with a controlled diet and administer conventional treatment, including rehydration and vitamin supplementation (see Results section for details).\nFor the experimental group, administer ear plaster therapy in addition to conventional treatment.\nEnsure that the rest management for both groups remains the same until the patients are discharged from the hospital.\n3. Preparation for ear plaster therapy procedure\nGather the necessary items (Figure 1): scissors, sterile cotton swabs, tweezers, medical tape, 75% alcohol, and cowherb seeds (see Table of Materials).\nPreparation of the ear plaster\n\t\nCut the adhesive tape into square pieces measuring 0.6 cm x 0.6 cm.\nTake 1 or 2 smooth cowherb seeds (seeds of B. Wang, obtained from a pharmaceutical company, see Table of Materials) and place them at the center of each tape square, as shown in Figure 2.\nPatient preparation\n\t\nInstruct the patient to sit in a comfortable position.\nInspect the condition of the skin on the ear.\n\t\tNOTE: Ensure that the skin of the ear is intact and free from any abnormalities (e.g., inflammation, ulceration, frostbite, etc.) before proceeding with the treatment. Ear plaster therapy should not be performed on areas with auricular trauma or inflammation. It should only be carried out after these abnormalities have subsided and the trauma has healed. If the patient is allergic to adhesive tape, use alternative materials.\nSelection of acupoints\n\t\nLocate points/sensitive areas on the ear. Stabilize the ear auricle by using the thumb and index finger of one hand to pinch and lift the ear helix backwards and upwards, fully exposing the area.\nWith the sterile swab in the other hand, gently probe the patient's ear to identify sensitive pressure points near the six auricular points of the stomach (CO4), cardia (CO3), belly (AH8), shenmen (TF4), subcortex (AT4), and liver (CO12) (Figure 3).",
    "NOTE: Sensitive points refer to areas where there is significant soreness, numbness, swelling, or pain compared to other areas when applying pressure. These sensitive points have demonstrated better therapeutic effects compared to other common auricular points7. Based on previous clinical studies, the six auricular points (CO4, CO3, AH8, TF4, AT4, and CO12) are commonly used in the treatment of NVP and have prominent antiemetic and calming effects11,12,13. If sensitive points on the ear are not detected, the six mentioned points can be selected for the subsequent treatment round.\nDisinfection\n\t\nDisinfect the hands of the operator using an alcohol-soaked cotton ball.\nDisinfect the patient's auricle using a sterile cotton swab dipped in 75% alcohol.\n\t\t​NOTE: The disinfection area should cover approximately 1-2 cm² of the auricular skin surrounding the target point. Alcohol helps remove oil from the skin surface, ensuring better adhesive properties of the tape. If the patient is allergic to alcohol, iodophor can be used as an alternative.\n4. Ear plaster therapy\nOnce the area is dry, stabilize the auricle by pinching the ear helix with the thumb and index finger of one hand, lifting it backward and upward.\nUsing forceps, take the prepared ear plaster (step 3.2) and place the central seeds of the cowherb onto the selected point, as shown in Figure 4. Confirm with the patient that the seed placement corresponds to a sensitive point or sore area.\nPosition the thumb and index finger in front of and behind the auricle, applying moderate and tolerable pressure with a rhythmic pressing and relaxing motion to stimulate the cowherb seeds at the auricular site. Press and release for 3-5 min at each site, maintaining an even rhythm.",
    "NOTE: Adjust the intensity of pressure based on communication with the patient, ensuring that soreness, numbness, swelling, and pain are felt without excessive force.\nMonitor the patient's overall condition for 15 min following the treatment.\n\tNOTE: In case of panic, chest distress, dizziness, or profuse sweating, promptly remove the adhesive tape.\nInstruct the patient or their family to rub the seeds three times a day: morning, midday, and evening.\n\tNOTE: Emphasize the need for additional stimulation of the seeds when the patient experiences nausea.\nRemove the ear plaster after three days and repeat the above steps on the opposite ear, alternating treatment between the two ears.\n\t​NOTE: Continue treatment until the patient meets the discharge criteria: PUQE score ≤4 and urinary ketone bodies turn negative. If the ear plaster becomes dislodged, reapply it.\n5. Patient diagnosis\nStarting from the first day of hospitalization, collect fresh urine every 2 days to measure and record urinary ketone levels. Note the duration from the start of treatment to the time when the urinary ketone levels turn negative.\n\tNOTE: Urinary ketone levels serve as an important indicator for assessing patients with NVP. A positive urine ketone level indicates ongoing starvation and dehydration14,15. Ensure timely testing of urine samples to prevent low values caused by ketone body evaporation.\nInstruct patients to complete the Pregnancy-Unique Quantification of Emesis and Nausea (PUQE) scale (see Table 1) on a daily basis. Record the scores based on their actual symptoms each day until the day of discharge.\n\t​NOTE: The PUQE scale is widely used in various practice guidelines globally to measure the severity of NVP symptoms in patients16. A higher PUQE score indicates a more severe condition.\n6. Post-operative care\nAdvise the patient to keep the ear clean and dry.",
    "NOTE: The placement of the seed patch does not interfere with daily activities such as washing and bathing.\nProvide reassurance and support to alleviate the patient's nervousness and fear.\nInstruct the patient to perform swallowing movements or take deep breaths when experiencing feelings of nausea and vomiting.\nIf the patient experiences local allergic reactions such as itching, redness, or exudation on the skin during treatment, immediately remove the adhesive tape and apply anti-allergy ointment topically to alleviate these symptoms.\nIf an infection occurs, manage it as a common infection. Use topical antibiotics (appropriate for pregnant women) or anti-inflammatory and analgesic ointments for treatment.\nMonitor the frequency and amount of vomiting, assess for signs of dehydration, and regularly measure urinary ketone levels.\n\tNOTE: In cases where conditions affecting fetal development and maternal safety are present and cannot be effectively addressed, consider termination of the pregnancy.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}