{
  "id": 2338,
  "origin_website": "Cell",
  "title": "Optimized protocol to derive germline stem-cell-like cells from mouse pluripotent stem cells",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nInduction of epiblast-like cells (EpiLCs) from mESCs\nTiming: 2 days for steps 1–3\nThis section accomplishes the induction of EpiLCs from mESCs.\nPrepare fibronectin-coated wells for EpiLC induction.\nCoat the wells with 610 μL/well of fibronectin solution.\nIncubate the plate at 37°C in 5% CO2, 95% air for at least 1 h.\nInduce EpiLCs.\nPrepare ESCs (in the logarithmically growing phase) as in step 38 in the \"BEFORE YOU BEGIN\" section.\nNote: Typically, we use thawed ESCs for EpiLC induction after two or three passages.\nAspirate the 2iLIF medium for ESCs cultured in a 12-well plate.\nAdd 0.5 mL/well (for a 12-well plate) of prewarmed TrypLE Express.\nIncubate the plate at 37°C in 5% CO2, 95% air for 4 min.\nDissociate ESCs into single cells by pipetting them several times.\nTransfer the cells into a 15 mL tube.\nAdd 2 mL/well (for a 12-well plate) of the prewarmed wash buffer, wash the well thoroughly, and transfer the buffer to the 15 mL tube.\nCentrifuge the tube at 220 × g for 3 min to pellet the cells.\nAspirate the supernatant and dislodge the cells by tapping.\nResuspend the ESCs in 1 mL of EpiLC induction medium.\nCount the number of cells by a hemocytometer.\nAspirate the fibronectin solution from the fibronectin-coated 12-well plate prepared in step 1.\nImmediately add 1 mL/well of the prewarmed EpiLC induction medium.\nTransfer 1.0 × 105 cells of the ES cell suspension in EpiLC induction medium to a well of the fibronectin-coated 12-well plate.\nIncubate the plate at 37°C in 5% CO2, 95% air for 24 h.\nCritical: The KSR concentration (1%) of the EpiLC induction medium is critical for PGCLC induction. A KSR concentration higher than 1% results in inefficient PGCLC induction.\nChange the EpiLC induction medium.",
    "Aspirate the medium and add 1 mL of pre-warmed fresh EpiLC induction medium.\nIncubate the plate at 37°C in 5% CO2, 95% air for 20 h (Figure 4[href=https://www.wicell.org#fig4]B).\nCritical: During ESC-to-EpiLC induction, EpiLCs acquire the competence to differentiate into PGCLCs in a transient manner, and thus it is critical to determine the appropriate induction time for each ESC line (usually around 48 h after EpiLC induction). Start with 0.8–1 × 105 ESCs/well of a 12-well plate and determine the time point when they grow to 1 × 106 cells/well (a sub-confluent state, Figure 4[href=https://www.wicell.org#fig4]B), which is often the best time for PGCLC induction. Overgrowth of EpiLCs leads to an impaired PGCLC induction efficiency. The BVSCVR ESCs show a robust PGCLC differentiation potential at 44 h after induction into EpiLCs.\nInduction of PGCLCs from EpiLCs\nTiming: 4 days for step 4\nThis section accomplishes the induction of PGCLCs from mEpiLCs.\nPGCLC induction.\nInitiate PGCLC induction at 44 h after induction into EpiLCs (Figure 4[href=https://www.wicell.org#fig4]B).\nAspirate the medium and wash the wells of EpiLCs with 1 mL/well (for a 12-well plate) of PBS.\nAdd 0.5 mL/well (for a 12-well plate) of prewarmed TrypLE Express.\nIncubate the plate for 2 min at 25°C.\nAdd 2 mL/well (for a 12-well plate) of prewarmed wash buffer and dissociate EpiLCs into single cells by an appropriate pipetting.\nTransfer the cells into a 15 mL tube.\nCentrifuge the tube at 220 × g for 3 min to pellet the cells.\nAspirate the supernatant and dislodge the cells by tapping.\nResuspend the cells with the PGCLC induction medium so that the cell concentration becomes 4,000 cells/100 μL (4 × 104 cells/mL).",
    "Critical: For the BVSCVR line, a concentration of 4,000 cells/100 μL leads to a good PGCLC induction efficiency. Determine the appropriate cell concentration for each line (typically, 2,000 cells/100 μL (2 × 104 cells/mL) −5,000 cells/100 μL (5 × 105 cells/mL)).\nTransfer 4,000 cells/100 μL of the EpiLC suspensions into single wells of Nunclon Sphera 96-well Microplates.\nIncubate the plates for ∼90–96 h at 37°C in 5% CO2, 95% air.\nCritical: The expansion potential of PGCLCs upon PGCLC culture depends on the induction time of PGCLCs and thus it is critical to determine an appropriate PGCLC induction time for each ESC line. The BVSCVR ESC-derived PGCLCs show an appropriate expansion potential after ∼90 h of PGCLC induction [after ∼4 days of PGCLC induction: d4 PGCLCs], at which time PGCLCs show a robust BV fluorescence, but have only just initiated SC fluorescence (see below (Figure 5[href=https://www.wicell.org#fig5])). Fully BV+ and SC+ PGCLCs show a low expansion potential.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1829-Fig5.jpg\nFigure 5. Induction of d4 PGCLCs\n(A) Bright field (left) and fluorescent (second left: Blimp1-mVenus; second right: Stella-ECFP; right: mVasa-RFP) images of EpiLC aggregates (90 h after induction) containing d4 PGCLCs observed with a fluorescence stereomicroscope. Bar, 100 μm.\n(B) A flow cytometric gating strategy for sorting BV+ d4 PGCLCs. The P1 gate indicates depletion of dead cells (x-axis: FSC-A; y-axis: SSC-A) (upper left). The P2 gate is for single cell selection (x-axis: FSC-H; y-axis: FSC-W) (upper middle). The P3 gate is for single cell selection (x-axis: SSC-H; y-axis: SSC-W) (upper right). BVSC sorting is also shown (x-axis: BV; y-axis: SC) (lower left). A histogram of the P3 population. The gate for the BV+ cell sorting is indicated (lower right).\nPGCLC expansion culture\nTiming: 5 days for steps 5–7\nThis section accomplishes the expansion of PGCLCs.\nPrepare culture plates with m220-5 feeders.",
    "Coat the wells with 0.5 mL/well (for a 24-well plate) of 0.1% gelatin solution.\nIncubate the plate for 30 min at 37°C in 5% CO2, 95% air.\nThaw the m220-5 frozen stock tube (∼4–6 × 106 cells in 500 μL/tube) quickly by incubating the tubes in the 37°C water bath.\nTransfer the cells to a 15 mL tube containing more than 10 times the volume of the prewarmed wash buffer.\nCentrifuge the tube at 220 × g for 3 min.\nAspirate the supernatant and dislodge the pellet by tapping.\nResuspend the cells with serum medium so that the cell concentration becomes 1 × 106 cells/mL.\nAspirate the gelatin solution of the wells, and transfer ∼2.5–5 × 105 cells/0.5 mL/well of the m220-5 cell suspension to one well of a 24-well plate.\nCritical: the density of m220-5 feeder cells is critical for PGCLC expansion. Low density of m220-5 feeder cells leads to low PGCLC expansion efficiency.\nIncubate the plate at 37°C in 5% CO2, 95% air for more than 4 h until the feeder cells attach over the entire surface of the wells.\nAfter the attachment of cells, replace the medium with 1 mL/well of the PGCLC culture medium.\nSort BV+ PGCLCs (d4 PGCLC) by fluorescence-activated cell sorting (FACS).\nAdd 5 μL of DNase I stock in 1 mL of serum medium to prepare serum medium with DNase I.\nAdd 5 μL of DNase I stock in 1 mL of wash buffer to prepare wash buffer with DNase I.\nCollect the d4PGCLC aggregates after ∼90–96 h of PGCLC induction into a 1.5 mL tube containing 1 mL of the PBS. We collect the aggregates by using a P200 pipette under a stereomicroscope.\nCentrifuge the tube at 220 × g for 1 min.",
    "Remove the supernatant by using a P1000 pipette under a stereomicroscope to avoid accidental disposal of aggregates.\nAdd 0.5 mL/tube of prewarmed 0.05% trypsin-EDTA/PBS and tap the tube gently several times.\nIncubate the tube in the 37°C water bath for 10 min.\nPeriodically, tap the tube to ensure that the aggregate is fully exposed to the 0.05% trypsin-EDTA/PBS solution.\nDissociate the aggregates into single cells by carefully and rigorously pipetting with a P200 pipette.\nAdd 0.5 mL (in a volume equal to that of the 0.05% trypsin-EDTA-PBS) of serum medium with DNase I and pipet the suspension several times to complete the dissociation under a stereomicroscope.\nCritical: The aggregates should be dissociated into single cells as much as possible. Sticky cell masses caused by genomic DNAs leaking from dead cells should be disaggregated by DNase I treatment. Insoluble aggregates caused by genomic DNAs significantly reduce the efficiency for PGCLC sorting.\nCentrifuge the tube at 200 × g for 5 min.\nAspirate the supernatant and dislodge the pellet by rigorous tapping.\nResuspend the pellet in the wash buffer with DNase I so that the cell concentration becomes about 5 × 106/mL.\nTransfer the cell suspension through a cell strainer with 35 μm pore size to a 5 mL tube.\nKeep the tube on ice until application to FACS.\nSort the BV+ PGCLCs (d4 PGCLC) using a flow cytometer according to the manufacturer’s instructions. We use FACS Aria III (BD Bioscience).\nUse a 15 mL tube containing 10 mL of wash buffer to collect the sorted cells.\nRecord the number of sorted cells as indicated in the “sort layout” for step 7.",
    "Critical: To obtain a high-purity cell fraction, we select the “Purity” setting of the “Sort Precision Mode”. To maintain the viability of sorted cells, we cooled the collection tube holder by using the water bath system of the BD Temperature Control Option.\nCritical: See Figure 5[href=https://www.wicell.org#fig5]B (lower right) for an appropriate gating of the BV+ PGCLCs (d4 PGCLC) fraction: perform a stringent gating for BV positivity to exclude the contamination of BV-negative cells as much as possible. We typically sort BV-positive cells with BV signal intensity higher than one-third of the BV-positive population.\nPGCLC expansion culture.\nCentrifuge the 15 mL tube containing d4 PGCLCs at 220 × g for 5 min.\nAspirate the supernatant and dislodge the cells by tapping.\nResuspend d4 PGCLCs in the PGCLC culture medium so that the cell concentration becomes ∼1.0 × 104/mL (refer to step 6-r for the number of cells).\nTransfer 500 μL of the d4PGCLC suspension (5 × 103 cells) into a well of the 24-well plate with m220-5 feeder cells (step 5).\nIncubate the plate for 120 h at 37°C in 5% CO2, 95% air.\nChange half the volume of the culture medium at culture days 1 and 3.\nCritical: In addition to m220 feeder cells, d4 PGCLCs should also be cultured at appropriate densities. Low densities of these cells might lead to a low expansion rate of d4 PGCLCs.\nGeneration of reconstituted testes (rTestes)\nTiming: 2 weeks for steps 8–13\nThis section accomplishes the generation of rTestes and their culture for differentiating PGCLCs into spermatogonium-like cells.\nSort culture day 5 BV+SC+ PGCLCs (d4c5 PGCLCs) (Figure 6[href=https://www.wicell.org#fig6]A) and prepare the d4c5 PGCLCs suspension.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1829-Fig6.jpg\nFigure 6. Purification of d4c5 PGCLCs\n(A) Bright field (left) and fluorescent (second left: BV; second right: SC; right: VR) images of d4c5PGCLCs. Bar, 100 μm.",
    "(B) A flow cytometric gating strategy for sorting BV+SC+ d4c5 PGCLCs. The Q2 gate for the BV+SC+ d4c5 PGCLCs is indicated (left). One rTestis is composed of 1 × 104 cells (BV+SC+ d4c5 cells) and 2 × 104 cells (male somatic cells of gonads) (right).\nAdd 5 μL of DNase I stock per 1 mL of wash buffer to prepare the wash buffer with DNase I.\nWash the wells of the 24-well plate containing the d4c5 PGCLCs with 1 mL/well of PBS.\nAdd 0.5 mL/well of prewarmed TryPLE Express and incubate the plate at 37°C for 4 min.\nAdd 1 mL/well of prewarmed wash buffer with DNase I and dissociate the cells into single cells by pipetting them several times with a P1000 pipette.\nTransfer the cell suspension into a 15 mL tube and add 1 mL of wash buffer (making the total volume 2.5 mL, i.e., a 5-fold dilution of the TryPLE Express).\nCentrifuge the tube at 200 × g for 5 min.\nAspirate the supernatant and dislodge the pellet by rigorous tapping.\nResuspend the cells in wash buffer with DNase I so that the cell concentration becomes ∼5 × 106/mL.\nTransfer the cell suspension through a cell strainer with 35 μm pore size to a 5 mL tube.\nKeep the tube on ice until application to FACS.\nSort the BV+SC+ PGCLCs (d4c5 PGCLCs) using a flow cytometer according to the manufacturer’s instructions. We use FACS Aria III (BD Bioscience) (Figure 6[href=https://www.wicell.org#fig6]B).\nUse a 15 mL tube containing 10 mL of wash buffer to collect the sorted cells.\nRecord the number of sorted cells as indicated in the “sort layout” for step 8-p.",
    "Critical: To obtain a high-purity cell fraction, we select the “Purity” setting of the “Sort Precision Mode”. To maintain the sorted cell viability, we cool the collection tube holder by using the water bath system of the BD Temperature Control Option.\nCentrifuge the 15 mL tube with sorted cells at 220 × g for 5 min.\nAspirate the supernatant, dislodge the cells by tapping, and resuspend the cells in the rTestis floating culture medium so that the cell concentration becomes ∼1.0 × 104 cells/100 μL (∼1.0 × 105 cells/mL) (refer to step 8-n for the number of cells).\nKeep the tube on ice.\nPrepare the embryonic testicular somatic cell suspension.\nThaw the frozen stocks of mouse embryonic testicular somatic cells (∼2.5–3 × 105 cells/tube) quickly by incubating the tubes in the 37°C water bath.\nTransfer the cells into a 15 mL tube containing more than 10 times the volume of the prewarmed wash buffer.\nCentrifuge the tube at 220 × g for 5 min.\nAspirate the supernatant and resuspend the cells in 500 μL of rTestis floating culture medium.\nCount the number of cells by a hemocytometer.\nAdd an appropriate volume of rTestis floating culture medium so that the cell concentration becomes ∼2.0 × 104 cells/100 μL (2.0 × 105 cells/mL).\nKeep the tube on ice.\nPrepare floating aggregates of rTestes.\nMix an equal volume of the d4c5 PGCLCs suspension and the embryonic testicular somatic cell suspension.\nTransfer 200 μL of the mixed cell suspension to each well of a low binding 96-well plate so that each rTestis consists of 1.0 × 104 d4c5 PGCLCs and 2.0 × 104 embryonic testicular somatic cells.\nIncubate the plate for 48 h at 37°C in 5% CO2, 95% air to generate floating aggregates of rTestes.\nPrepare rTestes culture plates for air–liquid interphase culture.",
    "Add 1 mL of distilled water to the peripheral 16 wells of the 24-well plates to maintain the humidity of the culture.\nAdd 700 μL/well of the rTestis culture medium to the inner 8 wells of the plates.\nSet a culture membrane insert (ThinCertTM) into a well with the rTestis culture medium.\nNote: Culture membrane inserts should be immersed in the medium. Avoid air-bubble formation between the membrane inserts and the medium.\nNote: For rTestes culture under an air–liquid interphase condition, we use ThinCertTM (24-well plates and PET membrane inserts with 1 μm pore size and 2 × 106/cm2 pore density).\nTransfer rTestes onto the membrane inserts.\nTransfer an rTestis cultured under a floating aggregate condition for 48 h in step 10 onto the center of a membrane insert using a glass capillary equipped with a mouth pipette (Figures 7[href=https://www.wicell.org#fig7]A and 7B (left)). Place one rTestis per one membrane insert.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1829-Fig7.jpg\nFigure 7. Generation and culture of rTestes\n(A) A photomicrograph of a mouth pipette equipped with a glass capillary.\n(B) Magnified images of the tips of the glass capillaries for transferring the rTestes onto the membrane inserts (left) or for aspirating extra culture fluid (right). Bar, 2 mm.\n(C) Bright field (left) and fluorescent (second left: BV; second right:SC; right: VR) images of the m0 (floating d2) and the m3, m7, m10, m14 rTestis under the air–liquid interface culture. Bar, 100 μm.\nAspirate the medium carried over around the rTestis on the membrane using a thin capillary (Figures 7[href=https://www.wicell.org#fig7]A and 7B (right)) by capillary reaction.\nCritical: Transfer rTestes onto the membranes with as little medium carryover as possible.\nCulture rTestes under an air–liquid interface condition (Figure 7[href=https://www.wicell.org#fig7]C).\nCulture the rTestes at 37°C in 5% CO2, 95% air for 2 weeks.",
    "Replace half the medium with fresh rTestes culture medium every 2 days.\nNote: We define the starting day of rTestis culture on the membrane as membrane culture day (m0).\nCritical: Examine the rTestis culture periodically to evaluate whether the rTestes are undergoing appropriate development. See (Ishikura et al., 2021[href=https://www.wicell.org#bib6]) for indexes (rTestis morphology and the timing of marker-gene expression) of the appropriate development of rTestes.\nCritical: During the culture, the medium may penetrate the membranes and submerge rTestes. In such a case, place a P200 pipette against the surface of the membranes and gently absorb the culture medium on the membranes.\nGSCLC (germline stem-cell-like cells) derivation\nTiming: 1.5 months for steps 14–21\nThis section accomplishes the derivation of GSCLCs from the PGCLC-derived spermatogonium-like cells in rTestes cultured for 14 days according to the GSC derivation procedures (Kanatsu-Shinohara et al., 2003[href=https://www.wicell.org#bib9]) with some modification.\nPrepare culture plates with MEFs for GSCLC derivation.\nCoat the wells of a 96-well plate (flat-bottom) with 0.1 mL/well of 0.1% gelatin solution and incubate the plate for 30 min at 37°C in 5% CO2, 95% air.\nThaw the MEF frozen stock tube (1 × 106 cells/tube) quickly by incubating the tubes in the 37°C water bath.\nTransfer the cells into a 15 mL tube containing more than 10 times the volume of the prewarmed wash buffer.\nCentrifuge at 220 × g for 3 min.\nAspirate the supernatant and dislodge the pellet by tapping.\nResuspend the cells with an appropriate volume of serum medium so that the cell concentration becomes ∼3.0 × 105 cells/mL.\nAspirate the gelatin solutions of the 96-well flat plate.\nTransfer 100 μL of the MEF suspension to the wells (3.0 × 104 cells/well).",
    "Incubate the plate at 37°C in 5% CO2, 95% air for more than 4 h until the MEFs attach over the entire surface of the wells.\nAfter attachment of the MEFs, replace the medium with 100 μL/well of the GSC culture medium.\nCritical: for GSCLC derivation from PGCLC-derived spermatogonium-like cells, it is critical to seed the wells with a high concentration of MEFs (e.g., ∼3.0–5.0 × 104 cells/well for a 96-well plate).\nCollection of rTestes from the culture inserts.\nAdd 1 mL of 0.5% trypsin-EDTA per 1 mL of PBS to prepare 0.25% trypsin-EDTA-PBS.\nTransfer a culture insert with an rTestis to a well of a new 24-well plate without medium.\nNote: Perform this quickly to prevent the rTestes from drying out.\nAdd 0.3 mL/well of PBS to the wells to wash the culture insert and aspirate PBS.\nAdd 0.3 mL/well of prewarmed 0.25% trypsin-EDTA-PBS to the wells.\nScrape off an rTestes from a culture insert using a P1000 pipette under a stereomicroscope.\nTransfer an rTestis into a 1.5 mL tube with 0.3 mL/tube of 0.25% trypsin-EDTA-PBS.\nPrepare to sort the PGCLC-derived spermatogonium-like cells.\nAdd 5 μL of DNase I stock per 1 mL of serum medium to prepare the serum medium with DNase I.\nAdd 13.3 μL of 7.5% BSA Fraction V per 1 mL of PBS to prepare the antibody buffer.\nIncubate the 1.5 mL tube containing an rTestis (step 15-f) in the 37°C water bath for ∼10–15 min with periodical tapping.\nDissociate the rTestis into single cells by rigorous pipetting with a P200 pipette. Perform the dissociation under a stereomicroscope for visual inspection of the degree of dissociation.\nAdd 0.6 mL of the serum medium with DNase I.\nCentrifuge the tube at 200 × g for 5 min.\nAspirate the supernatant and dislodge the pellet by tapping.",
    "Resuspend the cells with 50 μL of antibody buffer.\nAdd 5 μL of anti-CD9 antibody conjugated with APC and mix the cell suspension well.\nNote: To strictly distinguish the autofluorescence from the VR reporter fluorescence of the spermatogonium-like cells, we use anti-CD9 antibody conjugated with APC. MCAM (Kanatsu-Shinohara et al., 2012[href=https://www.wicell.org#bib8]) can also be used as a surface marker for spermatogonium-like cells.\nIncubate the tube on ice for 20 min. Tap the tube gently every 10 min.\nAdd 1 mL of antibody buffer to dilute the antibody.\nCentrifuge the cell suspension at 200 × g for 5 min.\nAspirate the supernatant and dislodge the pellet by rigorous tapping.\nResuspend the cells in 200 μL of antibody buffer.\nTransfer the cell suspension through a cell strainer with 35 μm pore size to a 5 mL tube.\nKeep the tube on ice until application to FACS.\nSort spermatogonium-like cells to establish multiclonal GSCLCs from a single rTestis (Figure 8[href=https://www.wicell.org#fig8]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1829-Fig8.jpg\nFigure 8. Purification of spermatogonium-like cells\n(A) A flow cytometric gating strategy for sorting CD9+VR+ cells (spermatogonium-like cells) from an m14 rTestis. The P1 gate indicates depletion of dead cells (x-axis: FSC-A; y-axis: SSC-A) (upper left). The P2 gate is for single cell selection (x-axis: FSC-H; y-axis: FSC-W) (upper middle). The P3 gate is for single cell selection (x-axis: SSC-H; y-axis: SSC-W) (upper right). An example of CD9+VR+ cells sorting is shown (x-axis: VD9-APC; y-axis: VR) (lower left). The P4 gate for the CD9+VR+ cells is indicated. P4 population (CD9+VR+) cells are reflected in FSC-A; SSC-A dimension. Note that the CD9+VR+ cell population is located to the lower right of the P1 gate.",
    "Sort the VR+CD9-APC+ cells (Figure 8[href=https://www.wicell.org#fig8]A (lower left), P4 population) (step 16) by using a fluorescence-activated cell sorter (FACS) according to the manufacturer’s instructions. We use FACS Aria III (BD Bioscience).\nCollect the sorted cells into a 15 mL tube containing 10 mL of wash buffer.\nRecord the number of sorted cells as indicated in the “sort layout”.\nCritical: To obtain a high-purity cell fraction, we select the “Purity” setting of the “Sort Precision Mode”. To maintain the viability of sorted cells, we cool the collection tube holder by using the water bath system of the BD Temperature Control Option.\nCentrifuge the tube at 220 × g for 5 min.\nAspirate the supernatant and dislodge the pellet by rigorous tapping.\nResuspend the pellet in 100 μL of the GSC culture medium.\nTransfer 100 μL of the VR+CD9-APC+ spermatogonium-like cell suspension into the well of a 96-well plate (flat-bottom) with MEFs (step 14) (200 μL/well in total).\nIncubate the plate at 37°C in 5% CO2, 95% air.\nNote: Typically, 200–1000 cells/rTestis can be sorted.\nSort spermatogonium-like cells to establish monoclonal GSCLCs (Figure 8[href=https://www.wicell.org#fig8]).\nPrepare 96-well plates (flat-bottom) with MEFs (step 14).\nSort the VR+CD9-APC+ cells (Figure 8[href=https://www.wicell.org#fig8]A (lower left), P4 population) (step 16) onto a 96-well plate by using a fluorescence-activated cell sorter (FACS) equipped with an automated cell deposition unit (ACDU) having a single cell plating setting according to the manufacturer’s instructions. We use FACS Aria III (BD Biosciences).\nCritical: To obtain a high-purity cell fraction, we select the “Single cell” setting of the “Sort Precision Mode”. To maintain the viability of sorted cells, we cool the collection tube holder by using the water bath system of the BD Temperature Control Option.\nAspirate the serum medium and add GSC culture medium into the wells (200 μL/well in total).",
    "Centrifuge the 96-well plate at 100 × g for 3 min using a TOMY-CAX571 centrifuge to adhere the cells to the bottom of the wells.\nIncubate the plate at 37°C in 5% CO2, 95% air.\nEstablish GSCLC lines (Figure 9[href=https://www.wicell.org#fig9]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1829-Fig9.jpg\nFigure 9. GSCLCs\nA phase contrast image of mouse BVSCVR GSCLCs. Bar, 100 μm.\nPrepare the GSC culture medium.\nChange half the volume of the GSC culture medium every 2 days.\nWhen one or a number of grape-shaped colonies are observed under an inverted microscope, passage all cells in one well of a 96-well plate to one well of a 48-well plate with MEF (see step 14).\nSimilarly, passage progressively from a 48-well to a 24-well to a 12-well and to a 6-well plate.\nNote: From ∼1−103 spermatogonium-like cells, GSCLC colonies with a typical grape-like colony morphology (Figure 9[href=https://www.wicell.org#fig9]) are formed in ∼2–3 weeks of culture. When grown up to a 6-well plate scale, the passage number is four and the number of cells reaches a 106-cell order. We consider that GSCLC lines are established when the cells grow stably and can be passaged more than five times. Prepare several freeze stocks at an early passage (step 21).\nPassage GSCLCs (as an example, we will describe a passage from a 96-well to a 48-well plate).\nPrepare a 48-well plate (flat-bottom) with MEFs (see step 14).\nNote: Typical numbers of MEFs/well are as follows: 2 × 104 cells/96-well, 5 × 104 cells/48-well, 1 × 105 cells/24-well, 2 × 105 cells/12-well, 5 × 105 cells/6-well plate. The number of cells required depends on the viability of MEFs. A key point is that each well should be covered with MEFs without gaps.\nPrepare a 1.5 mL tube containing 500 μL/tube of the prewarmed wash buffer.",
    "Aspirate the medium of the wells of the 96-well plate with GSCLCs.\nAdd 100 μL/well of prewarmed TrypLE Express, and incubate the plate at 37°C in 5% CO2, 95% air for 4 min.\nDissociate the GSCLCs into single cells by pipetting them several times and transfer the cells into a 1.5 mL tube with a P200 pipette.\nAdd 100 μL/well of the prewarmed wash buffer to the wells, wash the wells thoroughly, and transfer the suspension to the 1.5 mL tube.\nCentrifuge at 220 × g for 5 min to pellet the cells.\nAspirate the supernatant under a stereomicroscope to avoid accidental disposal of the cell pellet.\nResuspend the cells in 250 μL/tube of GSC culture medium.\nTransfer the cell suspension to the well of a 48-well plate with MEFs.\nIncubate the plate at 37°C in 5% CO2, 95% air.\nPrepare frozen stocks of GSCLCs.\nPassage GSCLCs up to a 6-well plate as described in step 20.\nNote: When ∼2.0–3.0 × 105 GSCLCs are passaged into a well of a 6-well plate, they typically become confluent (∼3.0–5.0 × 106 cells/well of a 6-well plate) after 7 days of culture. Accordingly, from one 6-well plate, ∼2.0 × 107 GSCLCs can be harvested, and ∼40 tubes (5 × 105 cells/tube) of GSCLC frozen stocks can be prepared.\nAspirate the medium, add 1 mL of prewarmed TrypLE Express/well of a 6-well plate, and incubate the plate at 37°C in 5% CO2, 95% air for 4 min.\nDissociate the cells into single cells by pipetting them several times and transfer the cells into a 50 mL tube.\nAdd 4 mL/well of the prewarmed wash buffer, wash the wells thoroughly, and transfer the suspension to the 50 mL tube.\nCount the number of the cells using a hemocytometer.",
    "Centrifuge the 50 mL tube at 220 × g for 3 min and aspirate the supernatant.\nAdd CELLBANKER I plus so that the concentration of the cell suspension becomes ∼1.0 × 106 cells/mL and transfer 500 μL to each cryotube (5.0 × 105 cells/tube).\nStore at −80°C."
  ],
  "subjectAreas": [
    "Cell Differentiation",
    "Stem Cells"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}