{
  "id": 11145,
  "origin_website": "Jove",
  "title": "Evaluation of Polymeric Gene Delivery Nanoparticles by Nanoparticle Tracking Analysis and High-throughput Flow Cytometry",
  "procedures": [
    "1.  Cell Seeding\nDo  not allow cells to grow to overconfluency. Use early passage cells when  transfecting primary cells.\nTwenty-four  hours prior to transfection, trypsinize the cells, count the cells using a  hemocytometer, and dilute the cell suspension with media to achieve the desired  cell density (cells/volume). Seed cells into clear tissue culture-treated  flat-bottom 96-well plates using a reservoir and multichannel pipettes. The  chosen density should give 70-80% confluency on the day of transfection. For  example, as displayed in Table 1, cells were diluted to 25 to 50 cells/μl for  the transfection data shown here.\n2.  Cell Transfection\nDilution  of polymer and DNA stocks. Thaw polymer and DNA stock solutions at room  temperature (RT). Dilute polymer stock solution and DNA stock solution,  separately in clear 96-well plates using a twelve-channel pipette, with the  appropriate solvent to concentrations required to obtain the desired polymer  weight to DNA weight ratios (wt/wt). In this case, the chosen solvent is 25 mM  sodium acetate buffer (pH=5.2).\n\t    \nDNA  dilution. Typically, DNA stored at 1 mg/ml is diluted in sodium acetate buffer  to a concentration of 0.03 to 0.06 mg/ml in a clear non-tissue culture-treated  96-well plate (one well for a single formulation). Table 2 shows the typical  DNA dilution protocol for a single formulation used to transfect four replicate  wells in a 96-well plate seeded with cells from Step 1.",
    "Polymer  dilution. The 100 mg/ml polymer/DMSO solution is diluted in sodium acetate  buffer according to the concentration required to obtain the desired polymer to  DNA wt/wt ratio. The range of wt/wt ratios typically used for gene delivery with  poly(beta-amino ester)s (PBAEs) is 20 to 100. PBAE polymers are first diluted  to 10 mg/ml, followed by the dilution protocol as shown in Table 3. The polymer  dilutions can be performed in a clear non-tissue culture-treated 96-well plate  that matches the sample orientation of the DNA dilution plate.\nNanoparticle  formation. Add the PBAE solution to an equal volume of the plasmid DNA solution  using a twelve-channel pipette and mix vigorously. Let the mixture incubate at RT  for 10 min to allow self-assembly.\nNanoparticle  transfection. Following self-assembly, 20 μl nanoparticles are added per well  to the culture medium dropwise using the twelve-channel pipette. Replicate  wells are left untreated or are transfected with commercially available  reagents as controls. The transfected cells are incubated at 37 °C for two to  four hours and then the wells are replaced with fresh media (100 μl/well). The  choice of incubation time will depend on the cell line, culture conditions, and  transfection system. The difference in transfection efficiency and cell  toxicity as a result of varying incubation period will be quantified by the  analysis protocol described in Step 3.\n3. Analysis of Transfection Efficiency and Cell Toxicity\nTransfection  efficiency is analyzed visually with a fluorescence microscope and quantified  using a flow cytometer forty-eight hours post-transfection. Cell toxicity is  analyzed visually with a fluorescence microscope and quantified using the CellTiter  96 AQueous One assay twenty-four hours post-transfection.",
    "Fluorescence  microscopy. Visually analyze the wells for the expression of the transfected  reporter gene (for example, EGFP or DsRed) using the appropriate fluorescence  channel. Acquire images for each well, choosing fields of view that appropriately  represent the transfection efficiency for the particular formulations (Figure  1). Make a note of any cell toxicity observed visually.\nFlow  Cytometry.\n\t    \nUse  multichannel pipettes to prepare the 96-well plate for flow cytometry. Wash  with PBS, trypsinize with 30 μl/well of trypsin/EDTA,  neutralize with 170 μl FACS buffer (PBS + 2% FBS), pipette up and down in each well, including  around edges, and transfer the entire 200-μl volume of each well into corresponding wells  in a round-bottom or V-bottom 96-well plate.\nCentrifuge  the plate at 130 x g for 5 min at 4 °C.\nRemove  170 μl media from each well and pipette to resuspend cells while avoiding  bubbles. To use a viability stain like propidium iodide (PI), add 10 μl of FACS buffer+PI (50:1 FACS buffer:PI  dilution; PI stock concentration 1 mg/ml) to each well. Immediately place on  ice and cover from light.",
    "Start  the C6 Accuri flow cytometer, the HyperCyt 96-well attachment, and the  HyperView software. Use HyperView Design and Protocol tabs to choose the  appropriate plate type, plate layout, and other settings such as  shake/sip/rinse/shake time. For the above protocol, the following parameters  were used, a pre-plate prime for one minute, and a pre-plate shake for 30 sec  at 2,400 rpm. Sip time was set for 15 sec at 15 rpm, a probe rinse every  well for 2 sec, and an inter-well shake every 12 wells for 12 sec at  2,400 rpm. The inter-well shake is important to keep the cells dispersed in the  media, as well as for improved ability to process the data by including timed  breaks between groups of wells (in this case 12 sec).\nUse  HyperView Well Identification tab to process the data and separate into the  appropriate well (Figure 2). In order to identify the individual wells, it can  help to use the software's noise filter, as well as including a base even  filter under the advanced settings.",
    "Quantify  percentage of positively transfected live cells by appropriate gating to  separate different populations (Figure 3). First view the flow data on a FSC vs.  SSC scatter plot in order to separate cells from debris (Figure 3A). If propidium  iodide (PI) was used, gate the individual cell population and view that data on  a FSC vs. FL3 plot in order to separate live cells from dead cells and gate the  live cells. In order to quantify the number of transfected cells, view the live  cell population on the appropriate channels, for example, GFP can be seen in  FL1. Using the untreated population, gate the untreated cells in order to  identify the background signal (Figure 3B). The positively transfected cells  can then be isolated using this gate and by viewing the transfected populations  using both scatter and contour plots (Figure 3C and 3D). There may be a  continuum of positively transfected cells, as different cells will be  transfected to different degrees of fluorescence.\nCellTiter 96 AQueous One assay\n\t     \nTransfect  another plate in exactly the same manner for cell toxicity measurements.\nPremix  1 ml of the CellTiter 96 AQueous One assay solution with 10 ml fresh media.  Remove media from cells and use a multichannel pipette to add 110 μl of the  premixed solution+media per well.\nMeasure  the absorbance at 490 nm every one hour interval from 1 to 4 hr until the  absorbance from the well with untreated condition is in the linear range of the  assay. Include four control wells with only solution+media for a background  absorbance reading.\nAverage  the absorbance values from the four replicate wells per condition and subtract  the average background absorbance from each average. Normalize the corrected  average for each treated condition to the corrected average of the untreated  condition to determine the percent cell viability.",
    "4.  Nanoparticle Sizing with NTA and Plasmid Per Particle Calculations\nPrime  the fluidics system of the Nanosight NS500 by running the diluent pump forward  at approximately 1/5th the max speed and the sample pump backward at  approximately 1/10th the max speed. Continue until the fluidics system is flushed  with diluent.\nPrepare  the nanoparticles to be analyzed. In the case of PBAEs, separately dilute the  stock plasmid DNA (1 mg/ml) and stock PBAE (100 mg/ml) in sodium acetate buffer  (25 mM, pH 5) in Eppendorf tubes.\nDilute  the plasmid DNA concentration to 0.06 mg/ml. Polymer concentration can vary  depending on the required weight-weight ratio of polymer to DNA (for example,  for 60 wt/wt particles, polymer is diluted to 3.6 mg/ml).\nAdd  the polymer solution to an equal volume of the plasmid DNA solution and mix  vigorously. Incubate the mixture at room temperature for 10 min to allow  self-assembly.\nDilute  the nanoparticle solution 100-fold into PBS in order for the nanoparticle concentration  to be in the appropriate range for NTA and to obtain a final volume of at least  500 μl.\nLoad  the sample into the Nanosight by placing the loading tube into the sample Eppendorf tube (Figure 4A). Make sure not to introduce air bubbles.\nIn capture  mode, increase the camera level until particles can be seen. Adjust the focus  so that the particles look smooth (Figure 4A and 4B).\nWhile  in standard mode, adjust the camera level past the point that all particles can  be seen on screen. Then decrease the camera level to the lowest level such that  the particles can all still be observed. If an intermediate camera level is  needed, go into advanced mode and modify the camera shutter and gain to the  appropriate levels.",
    "Visually  check to make sure there are between 20 - 100 particles on the screen. An ideal  number for nanoparticle tracking is approximately 50 particles. If there are  too many or too few, flush the NS500, adjust the dilution into PBS, and re-load  the sample.\nAdjust  the capture duration according to the standard mode table. Typically 30 - 60 sec is an appropriate capture length (Figure 4B).\nTo  load the next sample, flush the system, then re-load the new sample.\nOnce  videos are captured, proceed to the processing stage by opening a video file.\nThere  are a number of parameters that can be tuned in order to best process a video  (Figure 4C). The goal is to select parameters that best capture each particle  on the screen, as indicated by a red cross mark on the screen over each  particle (Figure 5).\nIncrease  the screen gain to better see the particles. Under the standard or advanced  mode, select the auto adjust for the parameters by clicking the appropriate  boxes. In the case that the auto settings do not adequately select particles,  unclick the box and manually set the parameters (Figure 4C).\nOnce  all the particles are picked on screen, click the process button of the  software to process the video file (Figure 4C). This provides the particle size  distribution, size averages, as well as particle concentration.\nIn  order to make certain that the particle concentration is accurate, change the  PBS dilution, such as by increasing dilution by 2x, and repeat the above  procedure. Measuring multiple dilutions of the same sample is recommended to  ensure that the concentration measurement of the sample is accurate. A good  range for measurement is 107-109 particles/ml.",
    "Verify  that all plasmids are incorporated into nanoparticles by running gel  electrophoresis of the nanoparticles and evaluating whether any free DNA is  present. If not all plasmids are encapsulated, use standard techniques to  measure DNA absorbance in order to quantify total encapsulated plasmids.\nTo  calculate the average number of plasmids per particle, divide the total  encapsulated plasmid concentration by the NTA measured particle concentration. In  order to estimate the plasmid per particle sample distribution, first use the  NTA particle size histogram to calculate the volume fraction of each 1-nm bin  of particle. Multiply this volume fraction distribution by the total plasmid amount  to obtain the number of plasmids in each bin. Divide these numbers by the  number of particles in each bin to obtain the number of plasmids-per-particle  for each particle size (Figure 6).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}