{
  "id": 18525,
  "origin_website": "Jove",
  "title": "Rapid Fractionation and Isolation of Whole Blood Components in Samples Obtained from a Community-based Setting",
  "procedures": [
    "The Detroit Neighborhood Health Study was reviewed and approved by the University of Michigan's Institutional Review Board. All participants provided informed consent prior to their participation in the study.\n1. Overview\nProperly document all stages from recruitment through analysis of endpoint data. Perform the protocols on Day 1 simultaneously, switching stages and overlapping as time permits. The sequence of stages is written to optimize performance efficiency. Figure 1 provides an overview of the entire process.\n\tNote: The term, “participant” is used throughout to signify the de-identified blood sample drawn from a consenting individual. The times in parentheses below indicate hands-on time. Examples of the tracking sheet and specimen log can be found in supplementary Tables S1 and S2, respectively. Samples are collected by phlebotomists in homes of individuals identified as consenting participants by the study coordinator and transported to the lab by a courier (see Supplementary Information (SI) 1 for further pre-processing details).\n2. Day 1 Setup\nPrepare 1x Phosphate-buffered saline (PBS).\nPreheat a heat block to 56 ºC.\nPrepare the protease (see SI 2) by aliquoting 20 µl into the appropriate number of microcentrifuge tubes for the day’s deliveries (2 per participant).\nEnsure Buffers AW1 and AW2 (wash buffers provided in the DNA isolation kit that increase the purity of the DNA) are ready for use, adding 100% ethanol as indicated on the label, if necessary.\nCool down refrigerated centrifuge to 4 °C.\nReplace the cap on the bottle of 1x PBS with the provided rubber septum cap and pierce the rubber septum with a transfer spike, retaining the screw cap on top of the transfer spike to prevent evaporation. Repeat with the bottle of RNA stabilization solution.",
    "Following preparation of the buffers, centrifuge and heat block, document the time of vacutainer delivery on the sample tracking sheet (see Table SI).\n3. Day 1: Processing Whole Blood Sample for DNA, PBMCs and Leukocyte RNA (2 hr)\nOverview\n\t\nAllot adequate time to minimize the delay between blood draw and processing start time. Begin processing of the Ficoll containing vacutainers within 2 hr of blood draw to avoid an increase in red blood cell contamination and a decrease in mononuclear cell recovery.\nAssume collection of 2 vacutainers containing Ficoll gel gradient, 2 K2 Ethylenediaminetetraacetic acid (EDTA) vacutainers, and 1 serum vacutainer per adult participant. Upon delivery of the vacutainers to the laboratory, have a technician sign the tracking sheet signifying acceptance of the samples. Begin processing immediately with the start time documented on a per vacutainer basis on the specimen log.\nSerum Isolation Stage 1 (1 min)\n\t\nDocument the start time on the specimen log (see Table SI 2). Centrifuge (with brake and acceleration OFF) the 7.0 ml serum (red) vacutainer (1 per participant) using a swinging bucket rotor with aerosol caps (biosafety level 2; BSL2 certified) for 20 min, 1,300 x g, 4 ºC.\nDNA Isolation Stage 1 (15 min)\n\tNote: For further details on this isolation procedure, see manufacturer’s protocol13.\n\t\nDocument the start time. In a BSL2 cell culture hood, invert the vacutainers containing the Ficoll gel 5 times then add 200 µl whole blood from the top of one of the vacutainers into each of two 20 µl aliquots of protease (400 µl total per participant). Leaving the protease + blood microcentrifuge tubes in the hood, continue to the centrifugation of the Ficoll containing vacutainers in step 3.4.1.",
    "Note: Use the vacutainer with the largest collection volume, keeping in mind the necessity of balancing the centrifuge (i.e., it may be necessary to remove 200 µl from each of the two vacutainers) when spinning the vacutainers in step 3.4.1. Additionally, to ensure proper separation during the processing of the blue vacutainers, the level of blood remaining in the vacutainer should not be less than 2.5 inches above the Ficoll layer.\nPBMC Isolation Stage 1 (1 min)\n\t\nDocument the start time (must be within 2 hr of blood draw to avoid an increase in red blood cell contamination and a decrease in mononuclear cell recovery).Invert the Ficoll containing vacutainers 8-10 times. Centrifuge (with brake and acceleration OFF) the vacutainers (2 per participant) using a swinging bucket rotor with aerosol caps (BSL2 certified) for 30 min, 1,600 x g, 22 °C.\nDNA Isolation Stage 2 (20 min)\n\t\nReturn to the hood and add 200 µl Buffer AL to each of the protease + blood microcentrifuge tubes (step 3.3.1). Cap, remove from hood, vortex 15 sec and flash spin.\nIncubate 56 ºC in a heat block, 10 min.\nRemove the tubes from the heat block. Flash spin. Return to the BSL2 hood. Add 200 µl 100% ethanol. Cap, remove from hood, vortex 15 sec and flash spin. The remaining steps can be completed outside of the hood.\nApply lysate (within 30 min of step 3.5.3) to a labeled spin column (in a 2 ml collection tube). Close the cap to avoid cross contamination via aerosols. Centrifuge 6,000 x g, 1 min.\nDiscard the collection tube containing the filtrate and place the spin column in a new 2 ml collection tube.\nAdd 500 µl Buffer AW1 to the column without moistening the rim, close the cap, and centrifuge 6,000 x g, 1 min.",
    "Discard the collection tube containing the filtrate and place the spin column in a new 2 ml collection tube.\nAdd 500 µl Buffer AW2 to the column without moistening the rim, close the cap, and centrifuge 20,000 x g, 3 min.\nDiscard the collection tube containing the filtrate and place the spin column in a new 1.5 ml collection tube (not included in the kit), and centrifuge 20,000 x g, 1 min.\nDiscard the collection tube containing the filtrate and place the spin column in a new 1.5 ml collection tube (not included in the kit).\nAdd 200 µl Buffer AE or water to each column and incubate at RT for 5 min. Centrifuge 6,000 x g, 1 min.\nRepeat step 3.5.11 eluting into the same collection tube.\nPool the eluted DNA from the 2 columns per participant. Total yield ~800 µl per participant.\nQuantify the samples using a spectrophotometer when time allows.\nAliquot DNA as desired into 2 ml cryovials, documenting the concentration of each on the specimen log. Transfer cryovials to a cryobox and place at -80 °C for long term storage. Document the freezer start time.\nLeukocyte RNA Isolation Stage 1 (30 min)\n\tNote: Perform in a Biosafety Level 2 certified cell culture hood. For further details on this isolation see manufacturer’s instructions15.\n\t\nPierce the rubber septum of the K2 EDTA vacutainer with a transfer spike. Retain the sheath and screw cap for use in step 3.6.11. Following BSL2 standard practices, take care to avoid exposure to bloodborne pathogens.\nAttach the white slip connector to the top of the transfer spike.\nLabel the filter with the corresponding participant ID then connect the inlet (flared end) of the filter to the white slip connector.",
    "Attach a sheathed 25⅝ G needle to the outlet (tapered end) of the filter. Preparing the filter assembly prior to delivery expedites the process considerably and therefore, attaching the white slip connector to the transfer spike, adding the filter, then the sheathed needle and setting the assembly in a culture tube rack until use, is recommended.\nFollowing assembly of the K2 EDTA tube system, safely unsheathe the needle (use the end of a metal spatula). Stab the needle into an empty 10 ml evacuated blood collection tube (serum receiver tube) and invert the K2 EDTA vacutainer/filter/receiver tube assembly. Following BSL2 standard practices, take care to avoid exposure to bloodborne pathogens.\nAllow the blood to filter through until the wedge-shaped sections of the filter have cleared of blood. Filtration takes about 2 min and can be placed in a test tube rack during filtration.\nRemove the filter from the assembly. Leave the needle in the tube containing the filtrate and discard the entire assembly in a Sharps container.\nAttach a 5 ml syringe to the transfer spike on the bottle of 1x PBS, invert the bottle, and withdraw 3 ml.\nAttach the syringe with PBS to the inlet of the filter and flush the filter (3-5 drops per second). Collect the flow-through in a biological waste container. Detach the syringe from the filter without retracting the plunger.\nFollowing filtration and a PBS wash, withdraw 3 ml of the RNA stabilization agent using a new 5 ml syringe and the method described in step 3.6.8. Flush the filter as in step 3.6.9. The RNA stabilization agent should remain on the filter. Detach the syringe from the filter without retracting the plunger.",
    "Seal the filter inlet and outlet with the sheath and screw cap retained from the transfer spike leaving the filter saturated with RNA stabilization agent. The filter can be stored at this point. Store the filter at -80 ºC until time permits (~2 hr) to complete steps 5.3 to 5.4.7.\n\t\tNote: Filters stored at -80 ºC for up to a year after collection have been processed without a decrease in RNA quality.\nPBMC Isolation Stage 2 (30 min)\n\t\nRemove the Ficoll containing vacutainers from the centrifuge (step 3.4.1) and continue in a BSL2 hood. Vacutainers should display separation as in Figure 2. If not, see Table 2.\nOnce the vacutainer is returned to the BSL2 hood, remove the stopper and withdraw 1.5 ml of the top, yellowish, plasma layer (Figure 2) using a serological pipette without getting close to the mononuclear (clear/white) layer. Transfer the plasma to a 5 ml cryovial — (Pool from 2 vacutainers — 1 participant). Log the volume collected. See step 3.7.6 for storage instructions.\n\t\tNote: The best separation and greatest PBMC yields come from participants who have fasted at least 12 hr prior to blood collection.\nTransfer the remaining plasma and the whitish, mononuclear layer (everything above the gel layer — Figure 2) using a serological pipette, to a 15 ml conical tube, pooling the mononuclear layer from each of the two Ficoll containing vacutainers per participant into one conical tube.\nAdd 1x PBS to bring the total volume in the conical tube to 15 ml. Cap tube and invert 5 times. Centrifuge (with brake and acceleration OFF) 15 min, 300 x g, 22 °C.",
    "Return to the Ficoll containing vacutainers in the hood and collect the red blood cells (RBCs) by using a 5¾” Pasteur pipet to swirl around and loosen the outside of the Ficoll gel layer and remove it if possible. Use a serological pipet to collect and transfer the RBCs (~4.5 ml) to a 5 ml cryovial. Log the volume collected.\nTransfer both 5 ml cryovials (plasma in step 3.7.2 and RBCs in step 3.7.5) to a controlled rate freezing container and put at -80 ºC for at least 24 hr after which time they can be transferred to a cryobox and returned to -80 ºC for long term storage.\nReturn the conical tube to the hood, when the centrifugation in step 3.7.4 is complete, and aspirate all but ~500 µl of the PBS without disturbing the pellet. PBMC yield is greater if ~200 µl of PBS is left above the pellet at this stage.\nAdd fresh 1x PBS to bring the volume to 10 ml. Resuspend the pellet gently. Cap tube and invert 5 times. Centrifuge (with brake and acceleration OFF) 10 min, 300 x g, 22 °C.\nSerum Isolation Stage 2 (10 min)\n\tNote: Perform in a BSL2 hood.\n\t\nAliquot the top serum layer from the serum vacutainer, following centrifugation (step 3.2.1), into 2 ml cryovials as desired. Typical yield is 2.5 ml (Table 1). Log the volume. For example, use 4 cryovials aliquoting 200 µl into cryovial 1, 1,000 µl into cryovial 2 and then divide the remaining into cryovials 3 and 4.\nTransfer the cryovials to a cryobox and place at -80 ºC for long-term storage. Document the freezer start time.\nPBMC Isolation Stage 3 (15 min)",
    "Return to the hood, after centrifugation (step 3.7.8), and aspirate as much supernatant/PBS as possible without disturbing the pellet. Resuspend pellet by pipetting in 2.5 ml PBMC Freezing Medium 1 (see SI 2).\nAdd 2.5 ml PBMC Freezing Medium 2 (see SI 2) to the cell/medium solution in step 3.9.1. Vortex gently.\nAliquot 10 µl of the cell solution into a 0.65 ml microcentrifuge tube (further dilution may be necessary). Add 10 µl of 0.4% trypan blue stain into the 0.65 ml microcentrifuge tube and mix by pipetting several times. For further details see the manufacturer's manual16.\nPipet 10 µl of the mixture into a cell counting chamber slide and place slide into the cell counter within 3 min of mixing. Zoom in and focus the cells. Press the “Count Cells” to obtain PBMC count.\nAliquot, if the viable PBMC number is above 3 million cells per milliliter (mc/ml), as desired into cryovials and continue to step 3.9.9. Store PBMCs in up to 5 cryovials at a concentration of at least 3 mc/ml each.\nIf the viable PBMC number is below 3 mc/ml, calculate the total number of cells by multiplying the viable mc/ml by 5 ml. Divide that number by 4, 3, 2 or 1 ml so that there will be at least one tube with 3 mc/ml.\nCentrifuge the conical tube containing the cells/freezing medium solution for 5 min at 300 x g (brake and acceleration OFF). After centrifugation, aspirate the appropriate volume of freezing medium (supernatant) leaving the volume calculated above (4, 3, 2 or 1 ml).",
    "Resuspend the pellet in the remaining supernatant and aliquot at least 3 mc/ml into the appropriate number of cryovials (1-4) at 1 ml/cryovial. Final freezing medium is 10% Dimethyl Sulfoxide (DMSO)/20% Fetal Bovine Serum (FBS)/70% Roswell Park Memorial Institute (RPMI) 1640.\nDocument the cell count per cryovial. Transfer the cryovials to a controlled rate freezing container and put at -80 ºC for at least 24 hr after which time the cryovials may be transferred to a cryobox and put in a liquid nitrogen tank (vapor phase) for long term storage. Document freezer start time.\n4. Day 2 Setup\nHeat an aliquot (220 µl per filter) of nuclease free 0.1 mM EDTA in a nuclease-free tube to 80 °C in a heat block.\nPrepare wash solutions 1 and 2 (see SI 2).\n5. Day 2: Long Term Sample Storage and Leukocyte Filter Processing (3 hr)\nOverview.\n\t\nPerform this procedure within 6 months of the application of the leukocytes to the filter.\n\t\tNote: Overall, Day 2 processing takes about 3 hr and while it is labeled “Day 2,” the key requirement is that the filter processing portion should be performed on a day when there is no Day 1 processing occurring in the lab.\nLong term sample storage (15 min)\n\t\nPerform this procedure every day, prior to the delivery of new vacutainers to the lab for Day 1 processing. Transfer the cryovials that were stored O/N in controlled rate freezing containers on Day 1 into appropriately labeled cryoboxes and return them to -80 ºC or liquid nitrogen (vapor phase) for long term storage. Organize the cryovials based on sample type (e.g., DNA, PBMC, RBCs, etc.) to expedite sample location tracking for endpoint assays.\nLeukocyte RNA Filters Processing (45 min).\n\tNote: For more information on this procedure see the manufacturer's instructions17.",
    "Bring the filter to RT (thawing about 5 min).\nRemove the sheath and screw cap from the filter. Retract the plunger of a 5 ml syringe and connect it to the inlet (flared end) of the filter, depress the plunger to expel the RNA stabilization agent from the filter ports into a biological waste container.\nLoad a new 5 ml syringe with 4 ml of a phenol and guanidine isothiocyanate solution for RNA isolation and attach it to the inlet of the filter, depress the plunger to flush the solution through the filter, collecting the lysate in a labeled 15 ml conical tube (2 per participant).\nDisconnect the syringe from the filter, retract the plunger, re-attach it to the filter, and depress the plunger to expel residual sample trapped in the filter disk into the same 15 ml conical tube. Discard filter and syringe.\nAdd 800 µl BCP to the conical tube, close the tube tightly and vigorously shake the prep for 30 sec.\nIncubate at RT for 5 min. Centrifuge for 10 min at 2,000 x g.\nTransfer the aqueous (top) phase to a freshly labeled 15 ml conical tube (~2.5 ml).\nAdd 0.5 times the volume of the aqueous phase of nuclease-free water and mix well. Then add 1.25x the aqueous volume of 100% ethanol and mix again.",
    "Note: For a 2.5 ml aqueous volume, add 1.25 ml of nuclease free water, mix, then add 4.7 ml of 100% ethanol (2.5 ml x 0.5 = 1.25 ml nuclease free water THEN 2.5 ml + 1.25 ml = 3.75 ml new aqueous volume THEN 3.75 ml x 1.25 = 4.7 ml 100% ethanol). This step allows for isolation of total RNA that includes the small RNA fraction. A method to omit the small RNAs from the isolation can be found in the manual17.\nRemove the plunger from a 5 ml syringe and insert a spin cartridge in its place. Attach the cartridge/syringe assembly to a vacuum manifold. For a more secure connection to the vacuum manifold, place the cartridge/syringe assembly inside a 1.5 ml microcentrifuge tube with the bottom cut off.\nApply the sample from step 5.3.8 to the spin cartridge slowly with the vacuum on, carefully adding more sample as it is pulled through the cartridge.\n\t\tNote: If no vacuum is present, see centrifugation method at http://www.ambion.com/techlib/misc/leuko_iso.pdf.\nTransfer the spin cartridge to a 1.5 ml microcentrifuge tube and add 750 µl of Wash 1. Centrifuge the spin cartridge/tube assembly 5 – 10 sec at 12,000 x g.\nDiscard filtrate from the tube and return the spin cartridge to the same microcentrifuge tube.\nAdd 750 µl of Wash 2 and centrifuge the spin cartridge/tube for 5 – 10 sec at 12,000 x g. Discard filtrate as in step 5.3.12. Return the spin cartridge to the same microcentrifuge tube.\nRepeat with another 750 µl of Wash 2 and centrifugation as in step 5.3.13. Discard filtrate. Return the spin cartridge to the same microcentrifuge tube. Centrifuge the spin cartridge/tube at maximum speed for 1 min to dry the filter.\nTransfer the spin cartridge to a fresh, labeled 1.5 µl microcentrifuge tube.",
    "Add 200 µl of nuclease-free 0.1 mM EDTA (preheated to 80 °C) to the center of the spin cartridge filter (2 per participant). Incubate at RT for 1 min.\nCentrifuge for 1 min at 12,000 x g to elute the RNA. Retain the filtrate. Discard spin cartridge.\nSplit each 200 µl filtrate into two, 100 µl aliquots into fresh 1.5 ml microcentrifuge tubes, label and keep on ice. At this point, starting with 2 filters per participant will yield four 100 µl aliquots of RNA per participant.\nDNase treatment (1 hr)\n\tNote: For further details on this treatment see the manufacturer's protocol18.\n\t\nCreate a master mix by combining 10 µl of DNase I Buffer and 2 µl rDNase I per aliquot + 1 (to account for pipetting error).\n\t\tNote: For four samples, 100 µl aliquots use 50 µl DNase I Buffer + 10 µl rDNase I.\nAliquot 12 µl of the master mix in step 5.4.1 into each of the RNA aliquots from step 5.3.18 and mix gently. Incubate at 37 °C for 30 min in a heat block.\nVortex the DNase Inactivation Reagent and add 11.2 µl to each aliquot, mix well. Incubate at RT for 2 min vortexing 2-3 times during incubation.\nCentrifuge at 10,000 x g for 1.5 min.\nTransfer the supernatant (RNA) to a fresh 1.5 ml tube. Aliquots from the same participant can be pooled here.\nRun each sample on a spectrophotometer to get the concentration. A quality analysis of the RNA is recommended using a Bioanalyzer (see step 5.5).\nAliquot the RNA into cryovials as desired. If a Bioanalyzer analysis will not be performed immediately, aliquot 1.5 µl of sample into a microcentrifuge tube for later analysis. Document the concentrations and the freezer start time. Store samples at -80 °C.\nBioanalyzer analysis (1 hr)",
    "Follow the manufacturer's protocol19. When the run is complete, the data is automatically stored, but save it again with a smaller, more recognizable file name. Expected results (Figure 3): the ladder should have 6 peaks, samples should have 3 peaks (2 ribosomal peaks at 44 sec and 50 sec, respectively and 1 early marker peak at 25 sec).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}