{
  "id": 13705,
  "origin_website": "Jove",
  "title": "The Complete and Updated \"Rotifer Polyculture Method\" for Rearing First Feeding Zebrafish",
  "procedures": [
    "1. Rotifer Culture\nBasic Components of a Culture System using a 100 L Culture Vessel\nGather all the components for the rotifer culture setup . The rotifer culture setup consists of a culture vessel (CV) to grow the rotifers; a similar vessel to maintain feedout rotifers (feedout culture vessel, FCV); a round-bottomed hatching jar (Feed Reservoir, FR) for storage of the algae feed mixture (AFM); an air supply (AS) to aerate the CV, FCV and the FR; a peristaltic pump with a metering timer (PMT) to control delivery of algae feed into the CV and FCV; and a floss particle filter (FPF) that sits inside the CV.\nNOTE: A complete list of supplies and components is provided in the Materials List.\nConfiguration\nElevate the CV and FCV on a stand or table so that the cultures may be easily harvested via a drain fitting into a collection container (Figure 1). Use flexible air supply tubing to connect the AS to a length of rigid tubing in each culture vessel. Make sure that the tubing is long enough to deliver air to the bottom of the CV or FCV.\nUse a small-capacity air line to connect the AS to a length of rigid tubing that extends to the bottom of the FR that contains the AFM. Install a valve into each air line to regulate air flow. Connect the FR to the PMT with feed delivery tubing, and run the tubing from the PMT into a hole drilled into the side of the CV/FCV, near the top. Figure 1.\nStartup",
    "Fill the culture vessel to 90% of the available volume with Reverse Osmosis water (RO). If RO is not available, use clean, dechlorinated municipal water; however, a biosecurity risk assessment should be performed to ensure that no potentially pathogenic organisms are present in the source water. NOTE: Such an analysis can be performed by any qualified water testing laboratory.\nDose the culture vessel water with aquarium salt to reach a salinity of 15 g/L. Set the air flow into the vessel so that it maintains a \"rolling boil\", and then slowly add the measured amount of salt to the culture vessel until it is completely dissolved by the aeration. Continue aerating the water for >1 hr to ensure that it is fully oxygenated.\nMake the algae feed mixture. To 3 L of clean, dechlorinated fresh (0 ppm) water add 100 g of NaHCO3 and 100 g of ammonia neutralizer (sodium hydroxymethylsulfonate). This last reagent provides the additional benefit of neutralizing any residual chlorine from tap water or bleach residues from sanitizing of culture equipment. It is critical to ensure that these compounds are fully dissolved. Then add 1 L of algae concentrate (biomass dry weight ~15%). Add the feed mixture to the FR and store at 4 °C.\nAdd a starter culture of 5 - 10 million Brachionus plicatilis rotifers to the CV containing the aerated 15 g/L salinity water. If the rotifers have been chilled during shipping or storage, they should be gradually (during 30 min or longer) acclimated to the temperature of the water in the culture vessel (25 - 27 °C).",
    "Turn on the PMT and begin pumping the algae feed into the rotifer culture vessel. Using the timer feature of the PMT, set the delivery rate of algae feed mixture so that ~1.6 ml of algae feed mixture is delivered per million rotifers in the culture, per day. Distribute the feedings in small portions at regular intervals over the course of a 24 hr period; the more frequent the feedings, the better.\nCalibrate the delivery rate of the pump by manually turning on the PMT for a set period (e.g., 1 min) and collect the algae that it pumps during this interval into a graduated cylinder or beaker. For example, if the PMT doses 5 ml of algae in 1 min, then the dose rate would be 5 ml algae/min.\nCalculate the required daily feeding rate by multiplying the number of rotifers present, in millions, by 1.6 ml. For example, a rotifer culture with a population size of 100 million rotifers would require ~160 ml of feed per day (100 x 1.6 ml).\nSet the PMT to dose the total daily feed requirement at regular intervals throughout a 24 hr period. For example, delivery of a total daily feed amount of 160 ml could be delivered in portions once every 3 hr over a 24 hr period using a PMT set with a dosing pump rate of 5 ml/min for 4 min, 8 times daily (5 ml/min x 4 min = 20 ml x 8 feedings = 160 ml).\nAllow the culture to grow until it generates the required population, typically for 48 - 72 hr, before harvesting. At 24 h post-start up, add the floss particle filters to the culture vessel and begin normal maintenance.\nMaintenance",
    "NOTE: The culture operates on a continuous basis and requires routine maintenance that ideally should be performed at the same time each day, in the following sequence.\n\t\nFill the FCV to 90% of available volume with clean, dechlorinated fresh water, dosed with 10 g/L aquarium salts. Ensure that the water is well mixed, and that all of the salt is fully dissolved. Set the air flow into the vessel so that it maintains a \"rolling boil\". Measure the salinity with a refractometer and ensure that the salinity is 10 g/L. It is critical to meet this target and not to exceed it.\nSample the rotifers in the CV: Ensure that the culture is well-mixed, then collect 3 samples of a 2 - 3 ml each using a transfer pipette or autopipettor, from different parts of the culture. Combine these samples in a tube or vial of convenient size (e.g., 10 ml).\nTransfer 1 - 2 ml of the combined sample onto a petri dish so that it can be visualized under a dissecting microscope. Check the quality of the culture (swimming behavior of the rotifers, presence of detached eggs, contaminating protozoa).\nImmobilize the rotifers in the remaining combined sample by adding 100 µl of 50% Lugols iodine solution to the sample. Within seconds after addition of the Lugols, observe the rotifers to stop swimming. Now, easily count the rotifers .\n\t\tNOTE: Ethanol, diluted bleach, or vinegar can be used in place of Lugols. Vinegar (2 drops/10 ml) has the advantages of being non-hazardous, not losing strength in storage as bleach and iodine solutions can, and not making the rotifers contract, so the corona of cilia and the \"foot\" remain extended and the animals look more natural.",
    "Ensure that the sample is well mixed (immobilized rotifers will settle rapidly), then quickly take a ~2 ml subsample in a plastic pipet and dispense 1 ml into a Sedgewick-Rafter counting slide (20 x 50 1-mm squares) (Figure 2). Using a dissecting or compound microscope, count the intact rotifers and the total number of eggs attached to these rotifers (Figure 2). Count as much of the slide area as necessary to count ~100 rotifers. Calculate the number of rotifers per ml, and record this in a spreadsheet or logbook.\nHarvest ~30% of the volume of the rotifers in the CV: Remove the air supply and floss filter, slowly open the valve at the bottom of the CV and allow the water to flow into a plankton collector with a 53 µm mesh screen. Collect the water flowing out of the bottom of the collector after filtering into a bucket or drain. Use a gentle to moderate flow to avoid damaging the rotifers. Do not allow the rotifers to dry on the screen.\nFor consistency reasons, it is advisable to establish the FCV with a standard number of rotifers each day.  Therefore, based on the known CV rotifer density and harvest volume, adjust the FCV total volume to achieve a consistent final density (e.g., 1,500 rotifers/ml). Add the harvested rotifers to the FCV: Gently transfer the rotifers from the collection screen using a wash bottle filled with clean salt water (10 - 15 g/L). Invert the screen over the FCV and wash the rotifers into the FCV with a gentle stream of salt water. Start the PMT to deliver feed (~1.57 ml per million rotifers per day) to the FCV.\nScrub the entire inside of the CV with a clean, soft nylon brush or scrub pad.",
    "Make a new mix of 15 g/L water by adding the appropriate amount of salt to a measured amount of clean RO water in a 5 gallon bucket to replace the volume of water lost to harvest. Add the salt to the water in the bucket and stir vigorously until it is completely dissolved, and then add to the CV.\nUsing a high-pressure spray in a sink, rinse the floss filter until it is free of debris, and then return it to the CV.\nAdjust feed rates of algae delivered to the CV by changing the duration of each dosing event, according to the daily count of rotifers/ml. Use the calculations provided in step 1.3.8, above to determine the appropriate amount of feed to be delivered.\nApproximately 24 hr later, repeat the process. Start by harvesting the rotifers remaining in the FCV (that were not needed for the previous day) in the same manner as described above (steps 1.4.2 - 1.4.10). Concentrate them in 2 L of fresh, clean dechlorinated water (5 g/L salt). These can be stored at 4 °C as a backup supply, or used to feed later stages of fish, beyond what is described in this protocol.\n\t\tNOTE: This protocol permits up to 2 - 3 days of reduced culture maintenance (with normal automatic feeding), because the rotifers in the CV can tolerate omission of harvests without serious consequences.\n2. Polyculture\nSetup\nCollect zebrafish embryos from a spawning event by pouring spawned embryos through a tea-strainer and then gently rinsing with sterile fish water (or any other non-contaminated source of appropriately conditioned solution; e.g., embryo medium, E3, etc.) from a wash bottle into petri dishes.",
    "Incubate the embryos at 25 - 28 °C in petri dishes at a density of 40 - 50 embryos per dish for 5 days.\nBegin the polyculture phase on day 5 post-fertilization, or when greater than 90% of the hatched larvae are actively swimming up in the water column.\nInoculation\nAdd 500 ml of rotifer culture directly from the FCV to a 3.5 L nursery tank; inclusion of rotifer culture water provides algal feed that maintains the nutritional content of the rotifers during polyculture.\nGently pour the larvae from one petri dish into the nursery tank. Ensure that no larvae remain in the dish.\nAdd 500 ml of clean, conditioned fish water from a recirculating system or dedicated water source to the tank to reach a final volume of 1 L and a final salinity of 5 g/L.\n\t\tNOTE: This salinity is critical because zebrafish larvae survival will be negatively impacted if salinity is >7 g/L and rotifer survival will be negatively impacted if salinity <2 g/L.\nPolyculture phase\n\tNOTE: The polyculture phase should last for up to 4 days post-inoculation (a total of 5 days, corresponding to days 5-9 post-fertilization).\n\t\nObserve the polyculture tank at least once per day during this period to ensure that rotifers and fish are present and growing. Ensure that the rotifers are visible throughout the water column. Ensure that the the fishs are also visible within the water column, swimming among the rotifers.\nStart normal water flow through the tank. Place a screen or baffle over the drain port to ensure that larvae are not flushed out of the tank.",
    "NOTE: At the end of this phase, the fish will be large enough to consume larger prey items such as Artemia nauplii or processed feed items in the size range of 75 - 125 µm.\n\t\tNOTE: The rotifer population dynamics within a representative polyculture tank were measured by sampling/counting rotifers from the tank in the same manner as described in steps 1.4.2 - 1.4.5. This was done once per day from the beginning of the polyculture phase until it was completed.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}