{
  "id": 18914,
  "origin_website": "Jove",
  "title": "Revealing the Cytoskeletal Organization of Invasive Cancer Cells in 3D",
  "procedures": [
    "1. TAMRA-collagen I Labeling\nPrepare a 10 mg/ml TAMRA solution by adding 2.5 ml DMSO to the supplied 25 mg TAMRA powder. Dissolve it by vortexing until complete dissolution. Store at -20 ºC and protect from light.\nPrepare 2 L of Labeling Buffer (0.25 M NaHCO3, 0.4 M NaCl). Adjust pH to 9.5 using 10 M solution of NaOH. Keep at 4 ºC. From this point, all operations are carried out at 4 ºC unless otherwise stated and fluorescent material is protected from light using aluminum foil.\nFill a 1 ml disposable syringe with 1 ml of highly concentrated rat tail collagen I solution. High concentration collagen solutions are typically provided at concentrations around 10 mg/ml and are very viscous. Be sure to manipulate it slowly to avoid formation of air bubbles.\nUsing a 21 G hypodermic needle, inject the collagen into a presoaked 3 ml dialysis cassette of 10,000 MWCO cut off. Use caution to avoid damaging the membrane with the needle. Remove all air from the dialysis cassette by pulling up the syringe piston. Dialyze it overnight against 1 L of Labeling Buffer.\nMix 100 µl of 10 mg/ml TAMRA solution with 900 µl of Labeling Buffer. Note: This should be done with both TAMRA solution and Labeling Buffer at room temperature since DMSO freezes at 4 ºC. After mixing, bring the diluted TAMRA solution back to 4 ºC.\nCarefully remove the collagen from the dialysis cassette using a 2 ml disposable syringe with a 21 G hypodermic needle. Mix 1 ml of the dialyzed collagen solution with 1 ml of diluted TAMRA solution by pipetting.\nTransfer the collagen/TAMRA mix into a 2 ml microcentrifuge tube and incubate overnight with rotation.",
    "Transfer the 2 ml of TAMRA-labeled collagen into a presoaked 3 ml dialysis cassette and dialyze overnight against 1 L of Labeling Buffer to remove the excess of free dye.\nTo restore the TAMRA-labeled collagen to the collagen original solution, place the dialysis cassette into 1 L of 0.2% (v/v) acetic acid solution, pH 4, and dialyze overnight.\nMeasure the final volume of the TAMRA-labeled collagen and calculate its final concentration, considering the initial volume and concentration of the collagen solution used. Store at 4 ºC.\n2. 3D TAMRA-collagen Matrices with Embedded Single Cells\nCalculate the volume of 2 mg/ml TAMRA-Collagen Mix necessary for the experiment. Always prepare 20% more to account for pipetting losses due to the collagen high viscosity.\nPrepare a stock solution of 10x PBS and 1 N NaOH. Filter-sterilize and maintain at 4 ºC. From this point, all operations are carried out on ice unless otherwise stated and under sterile conditions.\nMix 10x PBS and 1 N NaOH in appropriate volumes to achieve the desired collagen concentration and pH 7.4. For example, for a final volume of 1 ml of TAMRA-Collagen Mix at pH 7.4, combine 100 µl of 10x PBS with 5 µl of 1N NaOH. Mix well.\nAdd the appropriate volumes of both TAMRA-labeled collagen and unlabeled collagen in a 1:6 ratio to achieve a final total collagen concentration of 2 mg/ml. For example, for a final volume of 1 ml of 2 mg/ml TAMRA-Collagen Mix, add 90.48 µl of 3.68 mg/ml TAMRA-labeled collagen and 415.71 µl of 4.01 mg/ml of unlabeled collagen. Mix well and slowly by pipetting, avoiding formation of air bubbles.",
    "Add cells suspended in the appropriate volume of chilled cell medium without FBS to the TAMRA-Collagen Mix to obtain a final cell density of 105 cells/ml and a final collagen concentration of 2 mg/ml. For example, for 1 ml of 2 mg/ml TAMRA-Collagen Mix, add 388.81 µl of media containing 105 cells. Mix well and slowly by pipetting, avoiding formation of air bubbles. Confirm pH by testing 10 µl of the mix on a pH test strip.\nPipette 100 µl drops of TAMRA-Collagen Mix onto glass bottom dishes and allow it to polymerize at room temperature for 30-45 min. 100 µl collagen drops have a typical diameter of 7 mm and are 2 mm high. When polymerized, the collagen turns into a white-ish gel. Note: Allowing the collagen to polymerize without closing the dish will avoid the formation of a water film around the collagen drop, reducing detachment from the glass. To increase adherence, glass dishes can be coated with poly-L-lysine at 100 µg/ml.\nCarefully add sufficient culture medium to cover the collagen/cell drops. Avoid high fluxes of media or abrupt movements since collagen drops can easily detach. Keep at 37 ºC in 10% CO2 humidified air for enough time for cells to migrate in the matrix (typically 1-3 days).\n3. 3D TAMRA-collagen Matrices with Embedded Cell Spheroids\nCalculate the volume of 2 mg/ml TAMRA-Collagen Mix necessary for the experiment. Always prepare 20% more to account for pipetting losses due to the collagen high viscosity.\nPrepare a stock solution of 10x PBS and 1 N NaOH.  Filter-sterilize and maintain at 4 ºC. From this point, all operations are carried out on ice unless otherwise stated and under sterile conditions.",
    "Mix 10x PBS, 1 N NaOH and cell media without FBS in appropriate volumes to achieve the desired collagen concentration and pH 7.4. For example, for a final volume of 1 ml of TAMRA-Collagen Mix at pH 7.4, combine 100 µl of 10x PBS, 5 µl of 1 N NaOH and 388.81 µl of media. Mix well.\nAdd the appropriate volumes of both TAMRA-labeled collagen and unlabeled collagen in a 1:6 ratio to achieve a final total collagen concentration of 2 mg/ml. For example, for a final volume of 1 ml of 2 mg/ml TAMRA-Collagen Mix, add 90.48 µl of 3.68 mg/ml TAMRA-labeled collagen and 415.71 µl of 4.01 mg/ml of unlabeled collagen. Mix well and slowly by pipetting, avoiding formation of air bubbles. Confirm pH by testing 10 µl of the mix on a pH test strip.\nPipette 100 µl drops of TAMRA-Collagen Mix onto glass bottom dishes and allow it to initiate polymerization for 2-5 min. This will help to prevent sinking of the spheroids by slightly increasing the gel viscosity. 100 µl collagen drops have a typical diameter of 7 mm and are 2 mm high.\nCollect a cell spheroid and place it on a clean Petri dish. Remove any excess of liquid and resuspend it in 10 µl of TAMRA-Collagen Mix. This is important to prevent dilution of the collagen with cell media.\nUsing a P20 pipette, collect the collagen suspended spheroid and place it on the center top of the 100 µl TAMRA-Collagen Mix drop. Note: Do not place more than one spheroid per collagen drop, since they can affect each other capacity to invade and/or migrate.",
    "Allow the TAMRA-Collagen Mix to polymerize at room temperature for 30-45 min. When polymerized, the collagen turns into a white-ish gel. Note: Allowing the collagen to polymerize without closing the dish will avoid the formation of a water film around the collagen drop, reducing detachment from the glass. To increase adherence, glass dishes can be coated with poly-L-lysine at 100 µg/ml.\nCarefully add sufficient culture medium to cover the collagen/spheroids drops. Avoid high fluxes of media or abrupt movements since collagen drops can easily detach.\nKeep at 37 ºC in 10% CO2 humidified air for enough time for cells to invade/migrate in the matrix (typically 1-3 days).\n4. 3D Immunofluorescence Staining\nCarefully remove the cell media and rinse the collagen matrices containing cells/spheroids with PBS.\nSimultaneously fix and extract cells by incubating with extraction/fixation buffer (4% PFA, 0.3% Triton X-100, 5% sucrose in PBS) for 5 min. Supplement the buffer with 2 µM Phalloidin and 2 µM Taxol for visualization of cytoskeleton or cytoskeleton associated proteins.\nFurther fix cells with 4% PFA, 5% sucrose in PBS for 30 min. Rinse with 0.05% Tween-20 in PBS.\nPrepare primary antibodies solutions in PBS. Incubate cells with primary antibodies for at least 1 hr at room temperature or overnight at 4 ºC. Make sure to add enough solution to cover the entire collagen drop. For a 35 mm glass bottom dish, 1.5-2 ml of solution will be necessary. Note: To reduce the volume of antibody solution, a water insoluble barrier, such as a circle line of silicone grease or a PDMS ring, can be placed around the collagen drop.\nWash 3x 30 min with 0.05% Tween-20 in PBS.\nPrepare Alexa-conjugated secondary antibodies, Alexa-conjugated phalloidin and DAPI solutions in PBS. Incubate cells with the appropriate secondary antibodies for 2 hr at room temperature.",
    "Wash 3x 30 min with 0.05% Tween-20 in PBS.\nRemove excess of liquid, add enough mounting media to fill the glass bottom dish bottom (approx. 500 µl) and place a 24 mm coverslip on top to seal. Do not press down the coverslip to avoid compressing the collagen drop and damaging the 3D organization.\n5. Sample Imaging\nClassic or spinning disk confocal microscopes can be used. An inverted system should preferentially be used to determine the distance of the imaged cells from the glass bottom. The system used for this work is an Inverted Confocal Spinning Disk equipped with a 40X/1.3NA and a 60X/1.4NA oil-immersion objectives (working distances 200 µm and 130 µm, respectively), a Photometrics CoolSNAP HQ2 camera, 1392 x 1040 imaging array, 6.45 x 6.45 μm pixels and controlled by Metamorph imaging software. 405 nm, 491 nm, 561 nm, and 633 nm lasers are typically used at 30–50% power, gain 1 and binning of 2 x 2 to reduce exposure times. The microscope is also equipped with a Hg lamp and filter cubes for DAPI (exc 400-418 nm; em 450-465), FITC (exc 478-495; em 510-555) and Texas Red (exc 560-580; em 600-650) to use with the eye piece.\nUsing the fluorescent lamp, place the 40X objective at the middle of the collagen drop. Get an overview of the sample, both in the x-y axis and in the z-axis. Make sure not to deviate more than 100 µm from the gel edge on the x-y axis when acquiring the images to avoid edge effects. When imaging spheroids, make sure they are under the objective working distance. Change objective if appropriate.",
    "Switch to the confocal live imaging mode. By using the 561 nm laser to visualize the TAMRA-labeled collagen, starting from the glass bottom determine the z value at which collagen fibers start to appear. This is the substrate bottom and z = 0.\nUsing the focus knob, go up 100 µm from z = 0. Only cells at z = 100 µm or above should be imaged to avoid tension effects from the rigid glass bottom.\nSelect the cells to image. Optimize camera exposure times and laser power for each wavelength. Typical exposure times for DAPI and Alexa-488 Phalloidin are between 100-200 msec. Exposure times for antibody staining may vary.\nOn confocal live mode using the appropriate laser to visualize the phalloidin staining and using the focus knob, define the z series interval by setting top and bottom z values to current.\nDefine the z-step size. For 40X objectives, use 1 µm. For 60X, use 0.5 µm. Start acquisition.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}