{
  "id": 15103,
  "origin_website": "Jove",
  "title": "A Murine Cell Line Based Model of Chronic CDK9 Inhibition to Study Widespread Non-Genetic Transcriptional Elongation Defects (TEdeff) in Cancers",
  "procedures": [
    "The Institutional Animal Care and Use Committee and Institutional Biosafety Committee of the Cincinnati Children’s Research Foundation approved all animal experimental procedures (IACUC protocol #2017-0061 and IBC protocol #IBC2016-0016), and these experiments were carried out in accordance with standards as described in the NIH Guide to the Care and Use of Laboratory Animals.\n1. Chronic inhibition of RNA Pol II by flavopiridol treatment—basic strategy\nSeed B16/F10 mouse melanoma cells in low density (0.2 x 106) in a 10 cm culture plate in their corresponding medium (Dulbecco’s Modified Eagle Medium [DMEM], 10% fetal bovine serum [FBS], 1% penicillin and streptomycin [Pen/Strep]) and incubate overnight in a 37 °C, 5% CO2 humidified incubator.\nFollowing day, wash the cells with 1x phosphate-buffered saline (PBS) and add a new batch of culture media with a sublethal dose (estimated as 25 nM) of flavopiridol—an inhibitor of the RNA Pol II elongation factor p-TEFb (cyclin T/CDK9)—for one week without further sub-culturing.\nFollowing a week of flavopiridol treatment, perform confirmatory assays to evaluate the model’s ability to recapitulate various attributes of transcriptional elongation defects seen in TEdeff cancers.\n2. Confirmatory immunoblot assay to assess defective RNA Pol II function and impairment of interferon (IFN) pathway and tumor necrosis factor (TNF) pathway signaling of in the generated mouse TEdeff model\nCulture equal number (105) of flavopiridol treated B16/F10 mouse melanoma cells and parental B16/F10 mouse melanoma cells in two different sets of 12 well plates (one set for RNA Pol II functional characterization and the other set for cytokine stimulation) at 37 °C in a 5% CO2 humidified incubator overnight.\nNext day, treat the cells in the cytokine stimulation set with mouse IFN-γ, IFN-α (5 ng/mL), or TNF-α (5 ng/mL) for 45 min at 37 °C.",
    "Now, extract protein from cells in both cytokine and RNA Pol II functional characterization sets using a radioimmunoprecipitation assay (RIPA) lysis buffer in the following manner:\n\t\nWash cells with 1x PBS and lyse it with 50 µL of the lysis buffer per well. Scrape, and then pellet the lysed cells at 4 °C, 21,130 x g.\nMeasure the protein in cell lysate supernatants using a standard colorimetric assay for protein concentration following detergent solubilization (Bradford or a similar assay).\nLoad equal amount of measured protein (15 µg) from each sample to run in a 4%−18% sodium dodecyl sulfate (SDS) polyacrylamide gel, and transfer them onto polyvinylidene difluoride (PVDF) membranes.\nBlock the PVDF membranes in 5% dry milk in tris-buffered saline−polysorbate 20 (TBST) for 1 h followed by an overnight incubation at 4 °C with primary antibodies (RNA Pol II 1:1000; p-SER2 RNA Pol II 1:1000; p-SER5 RNA Pol II 1:1000; H3K36me3 1:2000; total H3 1:2000; STAT1 1:1000; p-STAT1 1:1000; NFκB 1:1000; p-NFκB 1:1000; β-Actin 1:5000) in 5% bovine serum albumin.\nFollowing day, wash the PVDF membranes with 1x TBST for 15 min at room temperature (RT), and incubate them with appropriate secondary antibodies (anti-rat [1:5000] for RNA Pol II, p-SER2 RNA Pol II, and p-SER5 RNA Pol II; anti-rabbit (1:5000) for H3K36me3, total H3, STAT1, p-STAT1, NFκB, and p-NFκB) for 50 min at RT. Detect the protein signals using commercially available horseradish peroxidase (HRP) substrate with enhanced chemiluminescence.\n\tNOTE: β-Actin primary used is HRP-conjugated, therefore it can be developed without a secondary.\n3. Confirmatory assay to assess mRNA processing defects in the generated mouse TEdeff model\nSeed equal number (0.2 x 106) of flavopiridol treated B16/F10 mouse melanoma cells and parental B16/F10 mouse melanoma cells in 6-well plates at 37 °C in a 5% CO2 humidified incubator overnight.",
    "Extract total RNA from the cultured cells at 60% confluency using an RNA extraction reagent or kit (Table of Materials).\nDeplete rRNA from the total extracted RNA in the following manner:\n\tNOTE: A low-input protocol has been co-opted from a commercially available kit to deplete rRNA\n\t\nSet one water bath or heat block to 70−75 °C, and another water bath or heat block at 37 °C.\nAdd the total RNA (100−500 ng in 2 µL of nuclease-free water) with 1 µL of selective rRNA depletion probe and 30 µL of hybridization buffer in a microcentrifuge tube, mix gently by vortexing and incubate them at 70−75 °C for 5 min.\nNow, transfer the tubes to a 37 °C water bath/heat block, and allow the sample to cool to 37 °C over a period of 30 min.\nResuspend the selective rRNA depletion probe magnetic beads by vortexing, and aliquot 75 µL of beads in a 1.5 mL RNase-free microcentrifuge tube.\nPlace the bead suspension on a magnetic separator for 1 min. Allow the beads to settle. Gently aspirate and discard the supernatant. Repeat washing the beads once again by adding 75 µL of nuclease-free water and discarding the supernatant following magnetic separation.\nResuspend the washed beads in 75 µL of hybridization buffer, and aliquot 25 µL of it to another tube and maintain it at 37 °C for later use.\nPlace the remaining 50 µL beads on a magnetic separator for 1 min and discard the supernatant. Resuspend the beads in 20 µL of hybridization buffer and maintain it at 37 °C for later use.\nAfter the cooling of the RNA/selective rRNA depletion probe mixture to 37 °C for 30 min, briefly centrifuge the tube to collect the sample to the bottom of the tube.",
    "Transfer 33 µL of the RNA/selective rRNA depletion probe mixture to the prepared magnetic beads from step 3.3.7. Mix by low speed vortexing.\nIncubate the tube at 37 °C for 15 min. During incubation, gently mix the contents occasionally. Followed by brief centrifugation to collect the sample to the bottom of the tube.\nPlace the tube on a magnetic separator for 1 min to pellet the rRNA-probe complex. This time do not discard the supernatant. The supernatant contains rRNA-depleted RNA.\nPlace the tube of 25 μL of beads from step 3.3.6 on a magnetic separator for 1 min. Aspirate and discard the supernatant. Add the supernatant from step 3.3.11 to the new tube of beads. Mix by low speed vortexing.\nIncubate the tube at 37 °C for 15 min. During incubation, gently mix the contents occasionally. Briefly centrifuge the tube to collect the sample to the bottom of the tube.\nPlace the tube on a magnetic separator for 1 min to pellet the rRNA-probe complex. Do not discard the supernatant. Transfer the supernatant (about 53 μL) containing rRNA-depleted RNA to a new tube.\nMeasure the concentration of the RNA yield by a spectrophotometer.\nUse one half of the rRNA-depleted samples as input to magnetic beads containing oligo (dT)25 to extract polyA+ RNA in the following manner:\n\tNOTE: This protocol of isolating polyA tail messenger RNA using oligo dT sequences bound to the surface of magnetic beads has been co-opted from a commercially available kit (Table of Materials).\n\t\nResuspend the oligo dT beads in the vial by briefly vortexing for >30 s and transfer 200 µL of oligo dT beads to a tube. Add the same volume (200 µL) of binding buffer, and resuspend.",
    "Place the tube in a magnet for 1 min and discard the supernatant. Now, remove the tube from the magnet and resuspend the washed oligo dT beads in 100 µL of binding buffer.\nAdjust the volume of the input rRNA-depleted total RNA sample to 100 μL with 10 mM Tris-HCl pH 7.5. Now, add 100 μL of binding buffer.\nHeat to 65 °C for 2 min to disrupt secondary RNA structures. Now, immediately place on ice.\nAdd the 200 μL of total RNA to the 100 μL washed beads. Mix thoroughly and allow binding by rotating continuously on a rotor for 5 min at RT.\nPlace the tube on the magnet for 1-2 min and carefully remove all the supernatant and carefully remove all supernatant.\nRemove the tube from the magnet and add 200 μL of Washing Buffer.\nMeasure the purity and concentration of the extracted polyA+ RNA by a spectrophotometer.\n\tNOTE: A 260/280 ratio of 1.90−2.00, and a 260/230 ratio of 2.00−2.20 for all RNA samples are considered acceptable.\nUse the remaining half of the rRNA-depleted samples from section 3.3 as input to protein A columns (provided in the RNA immunoprecipitation [RIP] kit, Table of Materials) to immunoprecipitate five-prime capped RNAs using monoclonal 7-methylguanosine antibody in the following manner:\n\tNOTE: This protocol of isolating m7G capped messenger RNA using a commercially available RNA immunoprecipitation kit has been co-opted and further modified.\n\t\nWash the protein A magnetic beads obtained from the RIP kit according to manufacturer’s protocol to pre-bind the antibody to the beads.\nTransfer 3 µg of 7-methylguanosine antibody (rabbit IgG provided in the kit can be used the negative control) to the beads in a microcentrifuge tube suspended in 100 µL wash buffer from the kit.",
    "Incubate with low speed rotation for 30 min at RT. Centrifuge tubes briefly and then place the tubes on a magnetic separator, remove and discard the supernatant.\nRemove tubes and add 500 µL of wash buffer from the kit and vortex briefly. Centrifuge the tubes briefly followed by magnetic separation once again, remove and discard the supernatant.\nRepeat step 3.6.4 once again.\nAdd around 120 ng of rRNA depleted (from section 3.3) to the prewashed 7-methylguanosine antibody bound beads. Add 1 µL of RNase inhibitor. Incubate at RT for 1−1.5 h with mild agitation.\nSpin down the beads at 300 x g for 10 s and remove the supernatant containing uncapped (non-7-methylguanosine) mRNA to a new microcentrifuge tube.\nAdd 100 µL of wash buffer and wash it two more times similarly. Pool the collected supernatant in the same microcentrifuge tube labelled uncapped (non-7-methylguanosine) mRNA. Store on ice.\nElute the capped (7-methylguanosine) mRNA from the beads with 300 µL of urea lysis buffer (ULB) containing 7 M urea, 2% SDS, 0.35 M NaCl, 10 mM EDTA and 10 mM Tris, pH 7.5 by heating the beads at 65 °C for 2−3 min.\nMix 300 µL of the eluted samples (capped and uncapped mRNA) with 300 µL of phenol:chloroform:isoamyl alcohol (25:24:1; commercially available) (stored at 4 °C). Mix well by inverting and leave for about 10 min then mix again gently.\nCentrifuge at 18,928 x g for 2 min and carefully pipette the top layer to fresh tube and discard bottom layer.\nAdd 300 µL of phenol:chloroform:isoamyl alcohol (25:24:1; stored at 4 °C) to the samples. Mix well by inverting and then centrifuge at 18,928 x g for 1 min. Carefully, pipette the top layer to a fresh tube and discard bottom layer.",
    "Add 300 µL of 2-porpanol and 30 µL of 3 M sodium acetate (pH 5.2) to the capped and uncapped RNA. Invert the sample a few times and put it at -20 °C for 20 h.\nNow, centrifuge the samples at 18,928 x g for 10 min at 4 °C. Carefully remove the supernatant and add 500 µL of 70% ethanol.\nCentrifuge again at 18,928 x g for 10 min at 4 °C. Carefully discard the supernatant and dry the pellet at RT for less than 5 min. Resuspend the pellet in nuclease-free water.\nMeasure the purity and concentration of RNA yield by a spectrophotometer. The 260/280 ratio should be in the range of 1.90−2.00, and the 260/230 ratio in the range of 2.00−2.20 for all RNA samples.\n4. Confirmatory assay to assess the response of mouse TEdeff model to FasL mediated cell death\nSeed equal number (30,000 cells) of flavopiridol treated B16/F10 mouse melanoma cells and parental B16/F10 mouse melanoma cells in a 96-well culture plate in their corresponding medium (DMEM), and incubate overnight in a 37 °C, 5% CO2 humidified incubator.\nTreat the cells in a culture hood with different concentrations of hhis6FasL (0.1−1000 ng/mL) in the presence of 10 μg/mL anti-His antibody and incubate for 24 h at 37 °C, 5% CO2 humidified incubator.\nRemove dead cells by washing with 1x PBS buffer. Fix the attached cells in 4% paraformaldehyde for 20 min at RT. Discard the 4% paraformaldehyde (no need to wash), and stain with crystal violet solution (20% methanol, 0.5% crystal violet in 1x PBS) for 30 min.\nRemove excess stain by gently rinsing the plates in tap water. Keep the plates to dry at RT.",
    "Re-dissolve the crystal violet in 100 µL of 1x nonionic surfactant dissolved in 1x PBS, and measure cell density by measuring the absorbance at 570 nm in a microplate reader.\n5. Exploratory assay to assess the response of mouse TEdeff model to antigen specific cytotoxic T-cell attack\nIsolation and activation of OT-I CD8+ cytotoxic T-cell attack (CTL)\n\t\nPurify CD8+ cells from spleens of OT-I TCR Tg RAG-1−/− mice by magnetic cell separation using a mouse CD8 T cell isolation kit as follows:\n\t\t\nHarvest two spleens from two OT-I TCR Tg RAG-1−/− mice in complete RPMI media.\nMash the spleens in a 70 µm filter kept on a 50 mL tube filled with 20 mL of RPMI, using the back of a syringe till only fat is left behind in the filter.\nCentrifuge the flow through at 220 x g for 5 min at 4 °C. Discard the supernatant.\nAdd 1 mL of red blood cell (RBC) lysis buffer to the spleen pellet from the previous centrifugation step and pipette the mixture for 1 min.\nNeutralize the solution by adding up to 10 mL of RPMI.\nCentrifuge at 220 x g for 5 min at 4 °C. Discard the supernatant and resuspend in 10 mL of RPMI.\nTake a small aliquot for counting. Centrifuge the remaining at 220 x g for 5 min at 4 °C.\nFor every million cells counted, resuspend the pellet in 1 mL of commercially available magnetic separation system buffer (Mojo buffer or a similar buffer).\nPrepare an antibody cocktail of volume 100 µL for every 1 mL of pelleted cells in step 5.1.1.8. The antibody cocktail includes: biotin anti-CD4, CD105, CD45R/B220, CD11c, CD49b, TER-119, CD19, CD11b, TCR γ/δ, and CD44.\nAdd this cocktail to the 1 mL pelleted cells and keep on ice for 15 min.",
    "Add 100 µL of magnetic (streptavidin) beads to every 100 µL of the antibody cocktail added to the 1 mL resuspended pelleted spleen cells. Keep on ice for 15 min.\nAdd 7 mL of commercially available magnetic separation system buffer. Now, aliquot about 3−4 mL of the mixture to a fresh tube. Mix well and fix it to the magnet for 5 min.\nDecant the liquid (contains CD8+ cells) to a fresh tube on ice. Now, aliquot the remaining 3−4 mL of mixture from step 5.1.1.12 to the tube and fix it to the magnet for 5 min. Decant the liquid (second batch of CD8+ cells isolated) to the same tube containing the first batch of CD8+ cells kept on ice.\nSeed engineered adherent fibroblast APC­-(MEC.B7.SigOVA) line to express a specific ovalbumin (OVA)-derived, H-2Kb-restricted peptide epitope OVA257-264 (SIINFEKL), along with the co-stimulatory molecule B7.1, at 75,000 cells per well in 24-well plates, at 37 °C, 5% CO2 humidified incubator.\n\t\tNOTE: The adherent fibroblast used is a gift from Dr. Edith Janssen’s lab at CCHMC. The line was created originally in Dr. Stephen P. Schoenberger’s lab in La Jolla Institute for Allergy and Immunology6.\nAfter 24 h, wash the monolayer of APC once with Iscove’s modified Dulbecco’s medium (IMDM) commercially available with HEPES buffer, sodium pyruvate, L-glutamine and high glucose), and add 0.5 x 106 naive OT-I CD8+ cells (from step 5.1.1.13) in 2 mL of IMDM supplemented with 50 mM β-ME, 2 mL EDTA, 4 mM L-glutamine and HEPES and 10% FBS.\nAfter 20 h, gently harvest the non-adherent OT-I cells (by collecting the media in the culture dish with floating OT-I cells and pelleting the cells at 191 x g for 2 min; count the viable OT-I cells) and transfer them for co-culture.",
    "Co-culture of CD8+ cells with B16/F10-OVA cells\n\t\nSeed OT-I-derived CD8+ cells at a ratio of 1:1 (300,000 cells each) in a co-culture with B16/F10 (lacking the antigen ovalbumin), untreated B16/F10-OVA, and B16/F10-OVA cells pre-treated with flavopiridol (25 nM) for 1 week, in 6-well dishes with complete DMEM media for 20 h at 37 °C in a 5% CO2 humidified incubator.\nAfter 20 h, remove the OT-I-derived CD8+ cells (by collecting the media in the culture dish with floating OT-I derived CD8+ cells). Wash the adherent B16/F10-OVA cells in 1x PBS.\nTrypsinize the three groups of attached B16/F10-OVA cells in 0.05% EDTA containing trypsin for 5 min. Pellet the trypsinized cells at 191 x g for 5 min.\nStain the harvested B16/F10-OVA cells by incubating them in cold PBS (containing 0.5% FBS and 0.05% sodium azide) with viability dye and relevant labeled antibodies (fixable viability staining dye e780, AF647-conjugated mouse CD8 and BV421-conjugated mouse CD45).\nAnalyze the viability of the three groups of B16/F10-OVA cells by flow cytometry.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}