{
  "id": 8721,
  "origin_website": "Jove",
  "title": "Analyzing the Size, Shape, and Directionality of Networks of Coupled Astrocytes",
  "procedures": [
    "All procedures abode by the Canadian Institutes of Health Research rules and were approved by the University of Montreal Animal Care and Use Committee.\n1. Preparation of Rat Brain Slices\nPrepare 1 L of a sucrose-based solution (Table 1) and 1 L of standard artificial cerebral-spinal fluid (aCSF) (Table 2).\nBubble the sucrose-based solution with a mix of 95% O2 and 5% CO2 (carbogen) for 30 min before placing it in -80 °C for about 30 min, until the solution is cold but not entirely frozen. Use this ice-cold sucrose as the cutting buffer for the slicing of the brain. Keep it on ice once it is removed from the freezer.\nBubble the aCSF with carbogen through the entire experiment. Use this solution for slice storage and as the perfusing buffer in which the patch-clamping and biocytin-filling of astrocytes will be performed. Prepare a slice recovery holding chamber to deposit the brain slices as soon as they are cut.\n\tNote: The slice recovery holding chamber could be custom-made and consists essentially of one small well with a mesh at the bottom suspended in a larger well that is filled with aCSF, in which a tube is inserted to bring carbogen from the bottom.\nUse 15- to 21-day-old Sprague-Dawley rats without any sex- or strain-specific bias. Anesthetize the animal with isoflurane (1 mL of isoflurane in an anesthesia induction chamber). Check the depth of anesthesia by gently pinching the hind paw or tail of the animal.\nDecapitate the rat using a guillotine, cut its skull with scissors, and quickly remove the brain from the cranium with a flat spatula.",
    "Dip the brain in the ice-cold sucrose-based solution for about 30 s and transfer it (with the solution) to a petri dish. With a razor blade, remove the portions that are anterior and posterior to the area to be sectioned, if cutting slices in the transverse plane.\nGlue the remaining block of brain tissue on its rostral side and proceed to cut brain slices (350 µm thick) in the sucrose-based medium using a vibratome. Then, transfer the collected slices in a recovery holding chamber filled with carbogenated aCSF at room temperature (RT) until they are ready to be used (allow at least 1 hour for recovery).\n\tNote: Recent developments in the field allow prolonged incubation up to 24 h of brain slices in in vitro conditions17.\n2. Sulforhodamine 101 (SR-101) Labeling of Astrocytes\nPre-heat a water bath to 34 °C and place two slice incubation chambers in it. Fill one of the slice incubation chambers with a solution of aCSF containing 1 μM SR-101, and fill the other only with aCSF.\nIncubate the slices in the incubation chamber containing the 1 µM SR-101 for 20 min and then transfer them into the second incubation chamber to rinse out excess SR-101 from the tissue. Let it incubate for 20 min or more at 34 °C, then keep the incubation chamber containing the slices at RT until they are needed18.\n3. Astrocyte Patching and Biocytin Filling\nSelect a slice and place it in the recording chamber of the microscope. To patch astrocytes, use electrodes with a resistance of 4-6MΩ when filled with a potassium-gluconate-based solution (see Table 3).",
    "Under visual guidance and using a micromanipulator, direct the recording electrode towards an SR-101-labeled astrocyte as shown in Figure 1. Avoid cells located at the surface of the slice since they are more likely to be damaged or have lost connections to neighboring cells.\nTo prevent leakage of biocytin in the tissue, minimize the positive pressure added to the patch pipette and apply it only when it is close to the astrocyte that will be patched (0.1-0.4 mL in a syringe of 1 mL).\nPrior to patching, adjust the offset of the pipette and its capacitance. Correct for liquid junction potentials, as accurate and precise voltage commands are critical to the experiments19.\nMove the pipette close enough to the astrocyte to observe depression caused by the positive pressure. Then, remove the positive pressure and slowly apply some negative pressure. Clamp the astrocyte to -70 mV when the seal reaches 100 MΩ. Wait until the seal reaches 1-3 GΩ. Continue to apply negative pressure until breaking into the cell. Be careful while applying negative pressure, since astrocytes are very fragile.\nAssess the electrophysiological properties of the patched cell. In voltage-clamp mode, perform a whole-cell current-voltage protocol with a ramp voltage command of 600 ms duration ranging from -120 to +110 mV. In current-clamp mode, perform a step IV protocol in which the injection of 1000 ms current steps of 100 pA from -1 to 1 nA, the sampling rate of the whole-cell recordings is 10 kHz.\n\tNote: Astrocytes show a linear current-voltage profile without any kind of rectification (as shown in Figure 1B) and no action potential firing upon membrane depolarization (Figure 1C). The resting membrane potential (RMP) should be stable and not positive to -60mV. In some brain areas, the RMP of astrocytes is more hyperpolarized than in the NVsnpr.",
    "Allow the biocytin to diffuse within the astrocyte for 30 min while performing a step IV protocol every 5 min.\nRetract and detach the patch pipette carefully without damaging the patched astrocyte and immediately take note of the offset of the pipette before taking it out of the recording chamber. Subtract that value from the membrane potential recordings.\nLeave the brain slice to rest in the recording chamber for a minimum of 15 min (in addition to the 30 min for injection) to allow spreading of the tracer from the patched astrocyte to the entire network of coupled cells.\n\tNote: To reveal a network of coupled cells, only a single cell should be patched in the nucleus of interest. If multiple attempts are required in order to achieve a successful patch, discard the case and try to patch on the contralateral side or in another brain slice.\nMake a mark or incision in the tissue to identify which side of the slice is facing upwards, and transfer the slice first to a petri dish containing normal aCSF, then into a solution of 4% paraformaldehyde (PFA). Incubate the slice at 4 °C overnight.\n\tCAUTION: PFA is extremely harmful. Use protective equipment in a ventilated hood. Ensure that all materials (brushes, tubes, etc.) that have been in contact with PFA do not contact the recovery holding chamber, incubation chamber, or other materials used for recording the fresh tissue.\n4. Biocytin Revelation\nRevelation with fluorescent streptavidine\n\t\nWash the brain slices 2 x 10 min in 0.1 M phosphate buffer saline (PBS) at RT. Then, reveal the biocytin by incubating the brain slices with streptavidine conjugated to a fluorophore at 1/200 dilution in PBS with 4% non-ionic detergent for 4 h at RT.",
    "Wash the brain slices 3 x 10 min in 0.1 M PBS at RT and mount the sections on glass slides using an aqueous mounting medium. Place the sides that were injected upwards, coverslip the slides, and seal them with nail-varnish.\nRevelation with DAB\n\tNote: DAB (3,3-diaminobenzidine) revelation can be used when fluorescence cannot be used. In this case, only one revelation method should be employed for making comparisons.\n\t\nWash the brain slices 3 x 10 min in PBS at RT. Incubate the slices in PBS + H2O2 0.5% for 1 hour at RT.\nRinse the slices 3 x 10 min in PBS at RT. Then, incubate the slices in an avidin-biotin complex staining solution composed of PBS and 0.1% non-ionic detergent + avidin-biotin complex peroxidase standard staining kit reagents at 1/100 for 24 hours at RT.\nRinse the slices 3 x 10 min in PBS at RT, incubate them in a solution of PBS + DAB 0.05% for 20 min at RT, and transfer them into a solution of PBS + DAB 0.05% + H2O2 0.5%.\n\t\tCAUTION: DAB is extremely harmful. Use protective equipment in a ventilated hood. The color reaction is stopped when the slices are transferred in PBS.\nRinse the slices 5 x 10 min in PBS at RT, mount the sections on glass slides (face the sides that were injected upwards) and let them dry on a slide drying bench overnight at 34 °C.\nSubmerge the glass slides for 1 min in several alcohol baths at 70%, 95%, and 100%, and end with a bath of xylene for 1 min.\nMount the glass slides using a toluene-based synthetic resin mounting medium. Place coverslips on the slides and seal them with nail varnish.\n5. Network Imaging",
    "Visualize the astrocytic networks using a scanning confocal microscope equipped with 20X and 4X objectives (or an appropriate objective to visualize the entire nucleus where the network is located) and a laser to detect the fluorophore (in this case, Alexa-594 is used).\nUse the 20X magnification to make a z-stack of the network of labeled cells. Use a resolution of 800 x 800 pixels and scan speed of 12.5 μs/pixel.\n\tNote: In order to image the whole network, multiple stacks are usually required, and the number of stacks needs to be adjusted for each network. The resolution and scan speed can be changed, but make sure to use the same settings to image all data.\nUse the 4X magnification to take images of the network and region of interest.\n\tNote: The 4X imaging is used to determine the network position within the nucleus of interest. Always image the same field in transmitted light. This image will be useful if you cannot determine the border of the nucleus in the confocal fluorescent image.\n6. Image Analysis\nData preparation\n\t\nUse the software ImageJFIJI (download it at https://fiji.sc/). Open the file and click OK in the “Bio-Formats Import Options” window.\nTo redefine a z-stack that will contain only the optical slices needed for the final z-stack (Figure 2A), click on the “Stack” knob in the toolbar (to find, first select stk | Z Project). Select “Max Intensity” in the projection type setting (Figure 2A). Save the file and name it “stack file”.\nIf the imaging file contains several channels, split it to conserve only the channel with the astrocytic network imaging (Image | Color | Split Channels).\nCheck the pixel settings of the image [Image | Properties | Pixel (with \"1\" for pixel dimension)].",
    "Use the subtract background tool (Process | Subtract Background) to remove the background of biocytin labelling. Use the preview function to set the rolling ball radius, which is generally set at 50 pixels (Figure 2B).\nUse the remove outliers tool (Process | Noise | Remove Outliers) if it is required following the subtract background step. Select “Bright” in the “Which Outliers” setting (Figure 2C). Use the preview function to set the radius and threshold. Be careful with this tool, since it may blur the data, as shown in Figure 2D.\n\t\tNote: This tool removes the small spots caused by unspecific deposits of streptavidine (as shown by the white arrows in Figure 2B and 2C before and after treatment, respectively).\nAdjust the threshold (Image | Adjust | Threshold). Select “Default” and “B&W” mode (Figure 2E). Click on “Apply”.\n\t\tNote: Auto-adjusting can be used, but manual adjusting with the two slider bars is preferred. The aim of this step is to reduce noise to the maximum without losing any labeled cells.\nConvert the image into a binary image with the binary process tool (Process | Binary | Make Binary) as shown in Figure 2F. Save the file as a TIFF file and name it “binary file”.\nCell counting\n\t\nCheck the setting of the measure function (Analyze | Set measurement). Select the “Centroid” option.\nUse the “Analyze Particles” tool on the “binary file” (Figure 3A) produced in the previous step (Analyze | Analyze Particle) (Figure 3C on the left). Select “Outlines” in the “Show” setting (Figure 3C). This generates a new file that shows the result of the detection (Figure 3B).",
    "Play with the parameters: size (to detect only cells, use values between 30 and 6000) and circularity (to determine an interval between 0 to 1, in which “1” defines a perfect circle and “0” a random shape) to refine the detection (Figure 3C, left portion). Run the detection by clicking “OK”.\n\t\tNote: Two tables will appear following the detection: 1) a table titled “Summary” that provides the number of detected cells, and 2) a table titled “Results” (Figure 3C, right portion) that provides the x- and y-coordinates of each cell.\nCopy the values and paste them into a spreadsheet application. Save this table under the name “detection table”. A file with a plot of detected cells will also appear (Figure 3B). Save this file as a TIFF file under the name “detection file”.\nIf a group of 2 or more labeled cells in the network are detected as a single cell with the analyze particles tool because they are too close to each other, use the watershed tool (Process | Binary | Watershed) on the binary image before applying the analyze particles tool, and redo the analyze particles steps.\n\t\tNote: The watershed tool creates a delimitation of 1 pixel wide between extremely close cells. A cell counter plug-in can be used when labeling is unequivocal and can be conducted manually.\nMeasuring astrocytic network area\n\t\nTo measure the surface area of the networks, use the detection file using Image J.\nUse the polygon selection tool (left click on the button in the tool bar to select it) to trace a polygon that connects all the cells located in the external periphery of the network (Figure 4A). Left click to begin tracing the polygon, and right click to close it.",
    "Note: This polygon will be defined as a region of interest (ROI) and its surface will be measured to determine the surface area of the network.\nOpen the set measurement window (Analyze | Set Measurement) and select the “Area” option. Open the ROI Manager (Analyze | Tools | ROI Manager) (Figure 4B). Then, add the traced polygon in the ROI Manager by clicking ‘’Add’’ (Figure 4B) and run the measurement by clicking ‘’Measure’’ in the ROI Manager.\n\t\tNote: The area measurement will appear in a table and be expressed in pixels. Do not forget to convert this value with the conversion factor for the microscope used to obtain a value in μm2.\nDetermination of the main direction vector\n\t\nDetermination of the patched cell\n\t\t\nOpen the stack file in ImageJFIJI and identify the patched cell in the stack file based on its stronger labeling intensity (Figure 4C). Then, open the file named “detection table” in a spreadsheet application and find the number associated to the patched cell and its corresponding coordinates.\nIf unable to accurately determine the patched cell, surround the area where the deposit of biocytin is denser in the imaged network of coupled cells, using the Polygon tool in ImageJFIJI, and refer to this position as that of the patched cell (Figure 4D).\nUse the ROI Manager (Analyze | Tools | ROI Manager). Then, draw a ROI at the patched cell location and add it to the ROI Manager (see Figure 4B).\nSet a measurement (Analyze | Set Measurement) and select the “Centroid” option.\nIn the ROI Manager, click on “Measure” to obtain the coordinates of the centroid of the traced area. Use these coordinates as the reference point for this specific network.\nReferential translation",
    "Calculate the coordinates of each cell in reference to the patched astrocyte by using the following formula:\nimgsrc://cloudfront.jove.com/files/ftp_upload/58116/58116eq1v2.jpg \n\t\t\tWith: imgsrc://cloudfront.jove.com/files/ftp_upload/58116/58116eq2.jpg as the coordinates for a given cell; imgsrc://cloudfront.jove.com/files/ftp_upload/58116/58116eq3.jpg as the coordinates of the patched cell (or the referential point of the network); and imgsrc://cloudfront.jove.com/files/ftp_upload/58116/58116eq4.jpg as the coordinates for a given cell in the new referential.\n\t\t\tNote: Expressing the coordinates of each cell in reference to the patched astrocyte is an important step in calculating vectors from the patched astrocyte. Be careful when using ImageJFIJI that the referential for any image is located in the top-left corner of the image.\nDetermination of the main vector of preferential orientation\n\t\t\nCalculate the coordinates of the main vector of preferential orientation with the following formula:\nimgsrc://cloudfront.jove.com/files/ftp_upload/58116/58116eq5.jpg\n\t\t\tWith: (imgsrc://cloudfront.jove.com/files/ftp_upload/58116/58116eq6v2.jpg) as the coordinates of the main vector of preferential orientation; and imgsrc://cloudfront.jove.com/files/ftp_upload/58116/58116eq7v2.jpg as the coordinates of each cell of the network obtained with the patched cell as referential.\n\t\t\tNote: For each cell in the network, a vector is determined relative to the coordinates of the patched astrocyte. The main vector of preferential orientation of the network is the sum of all these vectors.\nDivide the length of the main vector (provided by the coordinates obtained from using the above formula) by the number of cells in the network minus one (since the coordinates of the patched cell are not included), to normalize the values and enable comparisons between networks. A schematic view of this analysis is presented in Figure 5.\nPlacement of analyzed networks in the nucleus of interest\n\t\nAlignment of the 20X and 4X images\n\t\t\nTo determine the position of each network in the nucleus of interest (NVsnpr), use the 4X image. Open the 4X image with a vector image editor.",
    "Select the 4X image and modify its size by multiplying it by 5. The dimension window is located in the right part of the top horizontal toolbar. For instance, for a 4X image that has been sampled at 800 x 800 pixels, change the sampling resolution to 4000 x 4000 pixels (to set the working unit in pixels, go to “Document Setup” under the file tab: File | Document Setup). Export the file in TIFF format and name it “resized 4X”.\nAlign the top-left corner of the image with the bottom-left corner of the Adobe Illustrator document.\n\t\t\tNote: The software provides coordinates from a bottom-left corner referential point.\nOpen the 20X image of the network. Use the ‘’binary file’’ or ‘’detection file’’ because they are easier to align. Then, play with the opacity tool on the ‘’binary file’’ of the 20X image to align it with the re-sized 4X image.\n\t\t\tNote: The opacity tool is in the top horizontal tool bar.\nWhen the alignment is done, select and hold the pipette tool so the measure tool appears, and select it in the left toolbar.\nUse the measure tool to click on the top-left corner of the 20X image to get the coordinates of the 20X referential point onto the resized 4X image.\n\t\t\tNote: These coordinates, which are referred to as the 20X referential (20XR in Figure 5), will be useful for expressing the position of each network on a schematic drawing of the nucleus.\nNormalization of the nucleus of interest\n\t\tNote: To sum up the data, a normalization of the nucleus (NVsnpr) as a rectangle is used. The steps are described below.",
    "Open the 4X resized file in ImageJFIJI, and use the polygon tool to surround the nucleus (NVsnpr). Use the image with transmitted light if the borders of the nucleus are not able to be seen; in which case, remember to resize it first.\nOpen the ROI Manager and add the drawn ROI. In “Set Measurement”, select the ‘’Bounding Rectangle’’ option.\n\t\t\tNote: The “Bounding Rectangle” option calculates the smallest rectangle around the drawn nucleus.\nClick “Measure”.\n\t\t\tNote: A table appears with BX and BY, the coordinates of the top left corner of the rectangle: ‘’Rectangle Position’’ and provides the width and height. BX and BY are the coordinates of the bounding rectangle referential which are referred to as imgsrc://cloudfront.jove.com/files/ftp_upload/58116/58116eq8.jpg and imgsrc://cloudfront.jove.com/files/ftp_upload/58116/58116eq9.jpg.\nExpression of each network position in the normalized nucleus\n\t\t\nExpress the coordinates of each cell with the 4X referential (black square in Figure 5) using the following formula:\nimgsrc://cloudfront.jove.com/files/ftp_upload/58116/58116eq10.jpg\n\t\t\tWhere: imgsrc://cloudfront.jove.com/files/ftp_upload/58116/58116eq11.jpg are the cell coordinates with the 4X referential; imgsrc://cloudfront.jove.com/files/ftp_upload/58116/58116eq12.jpg are the cell coordinates with the 20X referential (orange square in Figure 5); and imgsrc://cloudfront.jove.com/files/ftp_upload/58116/58116eq13.jpg are the coordinates of the 20X referential point in the 4X image (20XR).\nExpress the cell coordinates in the bounding rectangle referential (blue in Figure 5) using the following formula:\nimgsrc://cloudfront.jove.com/files/ftp_upload/58116/58116eq14.jpg\n\t\t\tWhere: imgsrc://cloudfront.jove.com/files/ftp_upload/58116/58116eq15.jpg are the cell coordinates in the bounding rectangle referential; imgsrc://cloudfront.jove.com/files/ftp_upload/58116/58116eq16.jpg are the cell coordinates in the 4X referential; and imgsrc://cloudfront.jove.com/files/ftp_upload/58116/58116eq17.jpg are the coordinates of the bounding rectangle referential in the 4X image.\nTransform the cell coordinates in the bounding rectangle referential to the percentage of width and height of the bounding rectangle using the following formula:\nimgsrc://cloudfront.jove.com/files/ftp_upload/58116/58116eq18.jpg",
    "Where: imgsrc://cloudfront.jove.com/files/ftp_upload/58116/58116eq19v2.jpg are the cell coordinates in the percentage of width and height of the bounding rectangle; imgsrc://cloudfront.jove.com/files/ftp_upload/58116/58116eq20.jpg are the cell coordinates in the bounding rectangle referential; imgsrc://cloudfront.jove.com/files/ftp_upload/58116/58116eq21.jpg is the width of the bounding rectangle measured above in the protocol; and imgsrc://cloudfront.jove.com/files/ftp_upload/58116/58116eq22.jpg is the height of the bounding rectangle measured above in the protocol.\nTo represent all the networks on the same figure, take into account the orientation of the slice (left or right side). To standardize the data, the referential is applied on the left side of the slice. Transfer the network coordinates of the right side to the left side by applying the following formula only to x-coordinates:\nimgsrc://cloudfront.jove.com/files/ftp_upload/58116/58116eq23.jpg\n\t\t\tWhere: imgsrc://cloudfront.jove.com/files/ftp_upload/58116/58116eq24.jpg is the x-coordinate on the right side of the slice; and imgsrc://cloudfront.jove.com/files/ftp_upload/58116/58116eq25.jpg is the new x-coordinate expressed in the referential on the left side of the slice.\n\t\t\tNote: Alternatively, mirror the picture in ImageJFIJI before the analysis (Image | Transform | Flip Horizontally).\nTo express the coordinates of the main vector of preferential orientation, follow the same steps with the cell coordinates (steps 6.5.3.1 to 6.5.3.4).\n\t\t\tNote: The expression of the coordinates in percentages allows a compilation of the data as a single plot in which the nucleus (NVsnpr) is designed as a rectangle.\nStudy of the angular difference of the main vector of preferential direction\n\tNote: The angular difference of an astrocytic network is used to determine whether its preferential orientation is towards the center of the nucleus of interest. To calculate the angular difference (α in Figure 5), which is the angle between the main vector of preferential direction of the network (PD, red line in Figure 5) and the line connecting P to C, apply the Al-Kashi Theorem into the triangle PDC (see inset of Figure 5 and Supplementary Methods).",
    "First, calculate the different lengths using the application of the Pythagorean Theorem into a Cartesian referential using the following equation:\nimgsrc://cloudfront.jove.com/files/ftp_upload/58116/58116eq26.jpg\n\t\tWhere: the coordinates of P and C are imgsrc://cloudfront.jove.com/files/ftp_upload/58116/58116eq27.jpg and imgsrc://cloudfront.jove.com/files/ftp_upload/58116/58116eq28.jpg, respectively, in the bounding rectangle referential (calculated above).\nDetermine the angular difference in radians using the following formula:\nimgsrc://cloudfront.jove.com/files/ftp_upload/58116/58116eq29.jpg\nConvert the angular difference in degrees (e.g., with the DEGREES function in Excel software).\nCompile all the angular differences by plotting them in vertical bar charts (Figure 7C and 7D) and determine if there is a preferential orientation of astrocytic networks.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}