{
  "id": 10482,
  "origin_website": "Jove",
  "title": "Design and Use of an Apparatus for Presenting Graspable Objects in 3D Workspace",
  "procedures": [
    "All behavioral and surgical procedures conformed to the Guide for the Care and Use of Laboratory Animals (China Ministry of Health) and were approved by the Animal Care Committee at Zhejiang University, China.\n1.Assembling the 3D translational device\nBuild a frame of size 920 mm x 690 mm x 530 mm with aluminum construction rails (cross section: 40 mm x 40 mm).\nSecure four pedestals to the two ends of the Y-rails with screws (M4) (Figure 1B).\nFix two Y-rails onto the top surface of the frame in parallel by securing the four pedestals to the four corners of the top surface with screws (M6) (Figure 1B).\nConnect two Y-rails with a connecting shaft and two diaphragm couplings. Tighten the lock screws of couplings to synchronize the shafts of two rails (Figure 1B).\nPut six nuts (M4) into the back grooves of the Z-rail. Attach one side of the right triangle frame to the back of the Z-rail with screws.\nPull the triangle frame to the end that is distal to the shaft and tighten the screws. Attach the other right triangle frame to the other Z-rail in the same way (Figure 1C).\nSecure the other right-angled sides of two triangle frames to the sliders of two Y-rails with screws (M6) (Figure 1C).\nConnect two Z-rails with a connecting shaft and diaphragm couplings and tighten the lock screws of coupling (Figure 1C).\nAttach the two T-shaped connecting boards to the back of the X-rail with nuts and screws (M4). Then pull the two T-shaped boards to the two ends of X-rail and tighten the screws (Figure 1D).\nSecure the two T-shaped connecting boards onto the sliders of two Z-rails with screws (M6), respectively (Figure 1D).",
    "Insert the stepping motor into the shaft hole of the gear reducer and screw their flanges together (Figure 1E).\nSecure the connecting ring to the shaft end of the active X-rail with screws (M4).\nInsert the shaft of X-rail into the coupling and fix the gear reducer to the connecting ring with screws (M4).  Tighten the lock screws of the coupling (Figure 1E).\nFix the other two stepping motors and gear reducers to the active Y-rail and Z-rail using the methods described in steps 1.11–1.12.\nInsert the power and control cables of the three stepping motors to the power and control ports of their drivers, respectively and secure the cables with screws on the driver side.\n2. Assembling the turning table\nDownload the .DWG design files from the Supplemental Files of this paper. Prepare the objects, mental shaft, locating bar, rotator and case by 3D printing or mechanical processing.\nPut the touch sensors into the groove of the object body and stick them onto the predefined touch areas with double sided tape (Figure 2B).\n\tNOTE: Each object consists of four subcomponents: a backboard, object body with groove inside, cover board, and touch sensors.\nPass the wires through the hole of the object backboard and secure the cover board onto the object body with screws (Figure 2B).\nPass wires of touch sensors through the holes on the sides of rotator and fix the objects onto the rotator with screws. (Figure 2C).\nSolder the wire ends of touch sensors to the rotating wire ends of the electric slip ring and wrap the joints with electrical tape (Figure 2D).",
    "Secure the case to the slider of the X-rail with screws. Place the bearing in the bottom hole of the box and secure the locating bar to the top surface of case with screws (Figure 2E).\nPlace the rotator into the case from side, coinciding the axes of rotator, bearing and box. Pass the wires of the electric slip ring through the top hole of the case (Figure 2F).\nInsert the metal shaft into the bearing from the top hole of case and fit the shaft key to the keyway of the rotator (Figure 2G).\nSet the electric slip ring around the metal shaft. Place the end of locating bar into the notch of electric slip ring to prevent the outer ring from rotating (Figure 2G).\nInsert the shaft of stepping motor into the hole of metal shaft and secure the motor on the top of the box with screws. (Figure 2H).\nInsert the power and control cables of the motor into the power and control ports of its driver and secure them with screws.\nStick a tricolor LED (RGB) onto the front side of the case with tape and fix the right side board onto the case.\n3. Setup of the control system\nInsert the direction and pulse control wires of the four motor drivers into the digital I/O ports (pins 81, 83, 85, 87) and digital counter ports (pins 89, 91, 93, 95) of the data acquisition (DAQ) board, respectively. Secure the wires with screws.\nInsert the control wires of LED (green color used for the “go” cue, blue color used for the “error” cue, and red color representing idle) into the digital I/O ports (pin 65 and 66) of the DAQ card and secure them with screws.",
    "Insert the output wires of touch sensors and switch button into the digital I/O ports (pin 67–77) of the DAQ board and secure the wires with screws.\nInsert the start-stop and direction control wires of the peristaltic pump into the digital I/O pins 1 and 80, respectively. Insert the flow velocity control wire into the analog I/O port AO2. Secure the wires with screws.\nSetup a motion capture system as described by the manufacturer to record the hand trajectory in 3D space.\n\tNOTE: A commercial motion capture system (see Table of Materials) was used, which consists of eight cameras, a power hub, an Ethernet switch and a supporting software (e.g., Cortex). Please refer to the manual to get more details about setup of the system.\nSetup a neural signal acquisition system as described by the manufacturer to record electrophysiology signal from subject.\n\tNOTE: A commercial data acquisition system (Table of Materials) was used, which consists of a neural signal processor (NSP), front-end amplifier (FEA), amplifier power supply (ASP), head stages, and its supporting software (e.g., Central). Refer to the manual for more details about the setup of the system.\n4. Preparation of the experimental session\nInitialize the 3D translational device and the turning table. Specifically, pull the sliders of all linear slide rail to the starting point (lower left corner) and turn the first object (i.e., the vertically placed handle) of turning table to face the front side of the turning table.\nPower on the experimental devices, including motion capture system, neural signal acquisition, DAQ board, peristaltic pump, and four motors.\nSetup the paradigm software (Figure 3A).\n\t\nDouble click Paradigm.exe to open the paradigm software (available on request).",
    "Define the number of the reaching positions and their 3D coordinates (x, y, and z, in millimeters) relative to initial positions (step 4.2).\nWrite coordinates of all positions in the form of matrix in a .txt document. Make sure that each row includes the x-, y-, and z-coordinates of one position separated with a space. Save the txt document.\nClick Open File in the Pool panel of paradigm software and select the .txt document saved before to load the presentation positions into the paradigm software.\n\t\tNOTE: In this study, eight target positions were set according to animal’s reaching range, which are located at vertices of a cuboid workspace9,10 (90 mm x 60 mm x 90 mm).\nCheck the objects to be presented in the experiment in the Object Pool of paradigm software.\nAdjust experimental parameters in the Time Parameters panel of paradigm software. Set Baseline = 400 ms, Motor Run = 2,000 ms, Planning = 1,000 ms, max Reaction Time = 500 ms, max Reach Time = 1,000 ms, min Hold Time = 500 ms, Reward = 60 ms, and Error Cue = 1,000 ms.\nSeat the rhesus monkey (with a micro-electrode array implanted in motor cortex) on the monkey chair by inserting its collar into the groove of chair and fixing its head.\nFix the monkey chair to the aluminum construction frame. Keep the head 250 mm away from the front side of the cuboid and keep the eyes 50 mm above the top side of the cuboid workspace (horizontal visual angle: 20°; vertical visual angle: 18°).\nConstruct a tracking template of motion capture system.\n\t\nAttach three reflective markers at the end of the arm (close to wrist) with double-sided tape. Make sure that the three markers form a scalene triangle.",
    "Click the Run button of the paradigm software to start the task.\nClick the Record button on the Motion Capture panel of Cortex software to record trajectories of three markers for 60 s when the monkey is doing the task. Click the Stop button to suspend the experiment.\nBuild a tracking template of three markers on the Cortex software using the recorded trajectories and save the template.\n\t\tNOTE: Please refer to the manual of Cortex to get more details about how to build a model.\nConnect the GND ports of FEA and micro-electrode array implanted in the monkey’s motor cortex with a wire and pinch cocks. Then insert the head stages into the connector of the micro-electrode array31.\nOpen the Central software of neural signal acquisition system and set recording parameters including storage path, line noise cancellation, spike filter, spike threshold, etc.\n\tNOTE: Please refer to the manual of neural signal acquisition system for more details of software setting.\nOpen the synchronization software (Figure 3B, available on request). Click the three Connect buttons in the Cerebus, Motion Capture, and Paradigm panels to connect the synchronization software with the neural signal acquisition system, motion capture system and paradigm software, respectively.\nClick the Run button of the paradigm software to continue the experiment.\nClick the Record button on the File Storage panel of Central software to start recording the neural signals.\nCheck the saved tracking template and click the Record button on the Motion Capture panel of Cortex software to start recording the trajectory of monkey’s wrist.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}