{
  "id": 13166,
  "origin_website": "Jove",
  "title": "Concurrent Electroencephalography Recording During Transcranial Alternating Current Stimulation (tACS)",
  "procedures": [
    "Ethics statement: Procedures involving human subjects were approved by the ethics committee of Canton Bern (KEK-BE 007/14).\nNote: Figure 1 illustrates montages, as well as the design of the tACS electrodes (see also Discussion), and EEG cap. We use an EEG cap made of an elastic material (Figure 1D) to hold the tACS electrode attached on the scalp.\n1. Montages\nNote: The representative results are obtained from the following tACS electrode montages.\nMontage 1: Place both electrodes on the scalp, at the left dorsolateral prefrontal cortex (DLPFC) (F3 electrode) and left posterior parietal cortex (PPC) (P3 electrode) (Figure 1A).\nMontage 2: Place one tACS electrode on the scalp at the left DLPFC (F3 electrode), and place another tACS electrode on the left shoulder (Figure 1B).\nMontage 3: Place one tACS electrode on the scalp at the left PPC (P3 electrode), and place another tACS electrode on the left shoulder (Figure 1C).\n2. Preparation of tACS Electrodes\nIf a reference tACS electrode will be placed on the shoulder (Montage 2 and 3), do this first.\n\t\nBefore placing the shoulder electrode, prepare the skin with an abrasive skin preparing gel for EEG and electrocardiography. Use a gauze pad to scrub the skin lightly with the skin preparing gel.\nApply EEG gel on the tACS electrode and place the electrode on the shoulder.\nSecure the electrode on the shoulder with adhesive tape.\nPut on the EEG cap. Adjust the position of the cap according to the international 10-20 system for electrode positioning30, and fasten the chin strap of the EEG cap.\nMark spots to indicate where the tACS electrode will be positioned on the scalp. Use a water-based red pen, firstly because insulating effects of the color material of the pen are reduced, and secondly, it can be easily washed away with water.",
    "If there is a problem with the pen not reaching to the scalp for the marking, due to the holes in the EEG cap for gel insertion being too tight (Figure 1D), use a wooden stick, for example the wooden handle of a cotton swab.\n\t\nPaint the tip of the stick thoroughly and use this tip to mark the scalp.\nRemove the EEG cap and check if the marking was successful. If needed, fill in the marking, so that it can easily be spotted later.\nPerform the following steps (2.5.1-2.5.4) depending on the length of the participant's hair. If the participant has short hair (up to about 10 centimeters), skip the following steps (it should also be noted that certain hairstyles, such as dread locks, make the application of tACS electrodes impossible). If the participant has longer hair:\n\t\nPlace the tACS electrode with its center marked by the red spot on the scalp. Note that no EEG gel should be put on the tACS electrode at this moment.\nThread out all the hair inside the inner ring of the tACS electrode.\nBind the threaded out hair with cable binders. Pay attention to that hair around the tACS electrode does not get bound up with the tACS electrode by the cable binders.\nAfter the hair has been bound, remove the tACS electrode.\nApply EEG gel to the scalp tACS electrode.\n\t\nBefore applying the gel, connect the scalp and shoulder tACS electrodes to the stimulator, but do not turn on the stimulator yet. Apply a thin layer of EEG gel onto the tACS electrode. A sparse application of gel is important.\nCarefully place the tACS electrode back on the head.",
    "If the participant has longer hair, thread the bound hair back through the inner hole of the tACS electrode, without it touching the EEG gel on the tACS electrode.\nWhile placing the tACS electrode, pay close attention to the red mark on the scalp being kept in the middle of the tACS electrode. Once the tACS electrode has been placed on the scalp, its position may no longer be changed.\nRemove the cable binders from the hair once the tACS electrode has been placed.\nTurn on the stimulator and monitor the impedance. While carefully putting some pressure on the tACS electrode, pay very close attention that the red marking spot is always kept in the middle of the tACS electrode.\nCarefully lift the edges of the tACS electrode and apply some more EEG gel beneath the hair, not between the tACS electrode and hair (Figure 2). This is especially important if the participant has a lot of hair (see discussion).\nContinue putting pressure on the tACS electrode until impedance is stably below 10 kΩ. Monitor the impedance of the tACS electrode by the tACS stimulator.Carefully add additional EEG gel if necessary, but always sparsely.\n\t\tNote: The impedance of the tACS electrode monitored by the tACS stimulator is measured between the tACS electrodes, which has the drawback of not providing separate impedance value information for each electrode. Depending on the EEG amplifier system, it might also be possible to measure the impedance of the tACS electrodes through this, and then be able to measure the impedance for each electrode separately.\nPay attention to any gel escaping from the tACS electrode, and remove excess EEG gel with a cotton swab.\n3. Mounting the EEG Cap",
    "After the impedance of the tACS electrodes reaches below the threshold of 10 kΩ, mount the EEG cap again. Put on the EEG cap very gently and carefully, particularly if the material of the EEG cap is elastic, since it is otherwise easy to move the position of the scalp tACS electrode during this step.\n\tNote: The shift of the tACS electrode spreads out the EEG gel beneath the tACS electrode and causes the EEG gel to bridge with the EEG electrodes. It is important not to pull down an elastic cap with force, as this may cause it to rebound afterwards, which would also result in moving the tACS electrode.\nFasten the strap of the EEG cap.\n4. Preparation of EEG Electrodes\nApply EEG gel of appropriate viscosity (as discussed in detail in the discussion) to the EEG electrodes to create contact between the scalp and EEG electrodes. Begin with the ground and reference EEG electrodes. Then proceed to the electrodes located in the middle and vicinity of the tACS electrode. Then continue to the remaining electrodes (see Discussion).\nFor EEG electrodes surrounding the tACS electrode, inject gel with the needle tip pointing in a direction away from the tACS electrode. Gently push down the EEG electrodes while applying gel, so that the gel does not escape from beneath the electrodes.\nUse a wooden stick to increase the contact between the EEG electrodes and scalp, as illustrated in Figure 3. Don't use the needle tip for this purpose, as it will scrape the participant's scalp, and is furthermore not as effective for this purpose.",
    "Push down the gel with the stick towards the scalp, and very gently rub the scalp with the top of the stick with a rotating motion. Try to keep the angle of the stick orthogonally to the scalp for electrodes located in a close vicinity of the tACS electrode, as sideway movements of the stick will spread out the gel under the electrode. If needed, apply some more EEG gel, and then use the wooden stick to further improve the impedance.\nTo avoid bridging via leaking gel (Figure 4), be thrifty with applying the gel for lowering the impedance of the EEG electrodes in the immediate vicinity of the tACS electrode. Instead, try to lower the impedance as much as possible using only the wooden stick, before considering adding more gel.\nOnce good impedance has been achieved with the wooden stick, carefully insert and bring down the needle until the tip of the needle touches the scalp, then gently apply gel while pulling the needle out, thereby helping to stabilize the contact between the EEG electrode and the scalp.\nAim for EEG electrode impedances below 5 kΩ for optimal data, as this reduces noise interference and signal distortion.\nOnce the impedances have been lowered to the appropriate level, test whether any bridge between the tACS electrode and surrounding EEG electrodes due to leaking gel has been created.\n\t\nApply brief sinusoidal stimulation, with an intensity of experimental interests (e.g., 1 mA peak-to-peak).\n\t\tNote: Due to limitations of some systems (see table of materials), it is not possible to check for bridging online, but only through applying stimulation and then checking whether any channel of the EEG amplifier becomes saturated.\nSee whether any channel is saturated while stimulating.",
    "Note: As evident from the representative results, bridging via leaking gel between the tACS and EEG electrodes will result in saturating this channel of the EEG amplifier and rule out recording data from these electrodes. It is not possible to undo a bridging via leaking gel once it has been established. The only option is to interrupt the experiment.\nCheck impedances once more. Then begin recording."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}