{
  "id": 7184,
  "origin_website": "Bio",
  "title": "A Method to Quantify <em>Drosophila</em> Behavioral Activities Induced by GABA<sub>A</sub> Agonist Muscimol",
  "procedures": [
    "Preparation of reagentsPrepare muscimol solutionDissolve muscimol in Milli-Q to prepare a 100 mM stock solution.Dilute the stock solution to the target concentrations of 5 mM, 2.5 mM, and 1 mM using Milli-Q water and 1 mg/ml of Brilliant Blue (working concentration 0.125 mg/ml).Brilliant Blue is used to monitor flies that consumed muscimol solution (the fly stomach turns blue). Control flies are only fed Milli-Q water with Brilliant Blue (0.125 mg/ml).Prepare a 96-well agar plateAdd 0.5 g of agar into 50 ml of H2O to prepare 1% agar solution.Microwave the solution and leave at room temperature (RT) until it is sufficiently cool to pour 250 μl of agar into each well of a 96-well plate.Prepare the plate for 1 h before the behavioral test and leave the plate at RT.Capillary tube preparationBreak a glass capillary into two pieces using a hand saw (feather edge file).Preparation of 5-ml tube and plastic sheetMake a hole in the center of the lid of a 5-ml Eppendorf tube using a syringe needle (18G × 1 1/2’’). Next, insert the glass capillary filled with muscimol halfway into the hole in the lid. Make 2 more small holes in the vicinity of the glass capillary using a 22G × 1 1/2’’ needle to facilitate airflow into the tube (Figure 1A).Using scissors, cut a sheet (8.0 cm × 7.0 cm) from a thin, soft plastic folder and use it to cover the 96-well plate to prevent flies from flying away as they are placed in the plate (Figure 1B). The plastic sheet is reusable.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3982/bioprotoc-11-08-3982-g001.jpgFigure 1. Experimental setup for 5-ml tube and plastic sheet. A. Holes are made in a 5-ml tube using a syringe needle. B. Prepare a transparent plastic sheet (8.0 cm × 7.0 cm).",
    "Behavioral assayCollect approximately 50 male and 50 female one-day-old flies (Canton-S) under carbon dioxide anesthesia and place them in a culture vial for individual assay. Raise the flies for 4 days in the incubator on a 12 h:12 h day:night cycle (lights on at 07:00 and off at 19:00), at 25 °C and 40–60% humidity. Commercially available Drosophila food is recommended for this stage of the assay.Cautionary note: This behavioral test requires constant temperature, humidity, and light within the fly rearing incubator. In addition, it is important to maintain a quiet environment during the behavioral assay, including constant light, temperature, humidity, and time of day. On the day of the experiment, separate 35–40 male flies (5 days old) from females under a microscope using carbon dioxide anesthesia and leave them in a fresh empty vial for starvation for 9–10 h in the incubator. Male flies are identified by observing the genital organ under a microscope.After 10 h, the starved flies are ready for the behavioral assay. Hold the fly vial in ice to apply cold-induced anesthesia, and move 5 flies from the fly vial to each 5-ml tube using a chill unit, which consists of a yellow tip box cover that is filled with ice and covered with a convex glass plate. The chill unit is used to facilitate the movement of flies from one location to another and should be kept dry. Ice is used for anesthesia to avoid the potential effects of CO2 on the behavioral assay. Use a brush to transfer the flies within 1 to 2 min after removing the vial from the ice, because the behavior of the flies will return to normal after this period. Constant room temperature (25 °C) and humidity (40–60%) should be maintained strictly until the behavioral experiment.",
    "Cautionary note: Following starvation, we used cold anesthesia to transfer flies from one chamber to another. It is necessary to keep the chill unit dry by wiping off the glass plate with a tissue while transferring flies from the culture vial to the 5-ml tube. Likewise, when moving flies from the 5-ml tube to the 96-well plate, the chill unit should be kept dry. Fill 90% of the glass capillary (Narishige,  G-100  thin-walled glass capillary) with muscimol solution at the target concentration and mark the capillary wall at the solution level. Insert the glass capillary halfway through the center hole in the lid of the 5-ml tube containing the flies. The presence of exactly 5 flies in each 5-ml tube allows each fly to consume the same dosage of the target solution, which allows the behavioral assay to be performed five times for a single concentration of muscimol solution.Allow the flies to drink the muscimol (5 mM, 2.5 mM, or 1 mM) or control solution (Brilliant Blue-containing Milli-Q water) for 20–30 min. Specific glass capillaries are used to feed different dosages of muscimol solution to specific groups of flies (5 flies in a 5-ml tube). When a fly consumes the target solution, its stomach turns blue because of the presence of Brilliant Blue. Thus, consumption of the target solution by the fly can be confirmed.Remove the glass capillary and use slide calipers to measure the total amount (μl) of target solution consumed by the flies based on the capillary markings. Immediately anesthetize the flies in the 5-ml tube by holding the tube in ice for a few minutes. Use the chill unit to carefully move one fly into each well of the 96-well plate prepared as described above.",
    "After transferring all 5 flies using forceps (soft forceps suitable for holding flies), cover the wells of the 96-well plate with a transparent plastic sheet to prevent them from flying away (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3982/bioprotoc-11-08-3982-g002.jpgFigure 2. Flies in a 96-well plate for the behavioral assay. A. Flies are transferred to a 96-well plate after consuming the desired target solution. B. A 96-well plate is drawn to demonstrate the fly location and the target solution consumed by each fly.Allow the flies to recover from anesthesia for 10 min after placing them into the 96-well plate. Place the 96-well plate on a piece of white paper, set up a tripod in an appropriate location with a good view of the 96-well plate, and place an iPad on top of the tripod to record video for 3 min.Afterwards, leave the fly-containing 96-well plate at -30 °C for 2 h to euthanize the flies. Note each fly that consumed the target solution by checking for the presence of Brilliant Blue in the stomach using a light microscope. Exclude flies that did not drink any of the target solution from the behavioral analysis. The average amount of the target solution consumed by the flies may be calculated by dividing the total solution intake by the number of flies that consumed the target solution (fly behavior may vary based on the amount (μl) they drink).The entire process of the behavioral assay is presented schematically in Figure 3. Video 1 and Video 2 were used to visualize both the reagent preparation and the behavioral assay. Video 3 was used to show the fly movements recorded using the iPad.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3982/bioprotoc-11-08-3982-g003.jpgFigure 3. Outline of the experimental procedure. Male flies are starved for 9–10 h, after which they are carefully transferred into 5-ml tubes following brief anesthesia by chilling.",
    "The flies are allowed to drink muscimol solution for 20–30 min, after which they are transferred to a 96-well plate for recording of behavioral activity for 3 min. This figure was modified from Karim et al. (2018).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Preparation of reagents. This video shows the preparation of 96-well agar plates and muscimol solution. The detailed protocol is described in Procedure A.<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 2. Fly behavioral assay. This video shows the step-by-step procedure of the fly behavioral assay in detail. The protocol is described in Procedure C.<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 3. Fly movements recorded using the iPad. This video shows the tracked movements of control flies and the effects of different concentrations of muscimol."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}