{
  "id": 1766,
  "origin_website": "Cell",
  "title": "Differentiation of human pluripotent stem cells into pancreatic duct-like organoids",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nStep I: Differentiation of hPSCs into PPs\nTiming: 14–15 days\nTiming: 30–45 min for step 1b[href=https://www.wicell.org#o0730]\nTiming: 13 days for step 2[href=https://www.wicell.org#olist0210]\nPancreatic progenitors (PPs) are multipotent progenitors capable of differentiating into acinar, ductal, and endocrine cells during pancreatic development and several distinct protocols have been established for the in vitro generation of such PPs. PSCs have been successfully differentiated into PDLOs (step II[href=https://www.wicell.org#sec3.2]) in combination with the presented PP protocol (step I[href=https://www.wicell.org#sec3.1]), while alternative PP protocols have not been investigated. The herein described protocol was established and optimized for the hESC line HUES8 but also other PSC lines including induced pluripotent control stem cells were successfully applied.\nCell seeding 1–2 days prior to differentiation\nPrecoat the desired number of wells.\nDilute GFR-Matrigel 1:18 in DMEM/F12. Evenly distribute 220 μL of the Matrigel solution per well of a 24-well plate and incubate plates for 1–2 h at 37°C.\nNote: Take care that the Matrigel does not dry out at some regions of the well during the incubation.\nRemove the Matrigel solution after incubation and add 300 μL mTeSR1 supplemented with 10 μM Rock inhibitor Y-27632.\nNote: We recommend precoating of wells directly prior to harvesting and seeding.\nHarvest and seed hPSCs (volumes for 12-well plate).\nRemove medium from hPSC culture.\nAdd 500 μL PBS, gently swirl the plate, remove PBS.\nAdd 300 μL TrypLE Express or TrypLE Select and incubate at 37°C until cells are detached.\nNote: Detachment of cells takes approximately 3–5 min but might vary between cell lines sometimes exceeding 5 min.\nDilute the dissociation reagent by adding 700 μL DMEM/F12. Resuspend cells by carefully pipetting up and down without mechanical dissociation and transfer the cell suspension into a tube or falcon.",
    "Centrifuge at 200 × g for 4–5 min and remove supernatant. Resuspend cells in 1 mL mTeSR1 supplemented with 10 μM Y-27632.\nCount viable cells using a counting chamber and adjust the cell suspension to a final concentration of 1–1.5 × 106 cells/mL.\nDropwise add 200 μL of the cell suspension to each precoated 24-well (200,000 to 300,000 cells per well). In order to prevent cell aggregation in the middle of the wells, add the cell suspension in an outer circle to the wells and perform 2–3 times 8-shaped movements followed by one sudden ↕↔ movement of the plate.\nNote: We describe our strategy to achieve homogenous cell seeding. Equivalent strategies can also be used.\nStepwise differentiation of hPSCs into PPs (Troubleshooting 1+2[href=https://www.wicell.org#sec6.1]).\nNote: Initiate the differentiation 24–48 h after cell seeding at a confluency of 75%–95% (see Figure 2[href=https://www.wicell.org#fig2]). Ideal cell confluency at the start of differentiation might be cell line dependent. In our hands starting the differentiation at a high confluency entailed better differentiation efficiencies than at a low confluency.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1219-Fig2.jpg\nFigure 2. Seeding densities\nBright field overview images of hPSCs 1–2 days after cell seeding. Recommended confluency for the initiation of a differentiation is indicated.\nD0-d1: Differentiation of hPSCs into mesendoderm.\nRemove mTeSR medium from hPSCs.\nAdd 500 μL PBS, gently swirl the plate, remove PBS.\nAdd 500 μL BE1a + 100 ng/mL Activin A + 2 μM CHIR99021 (medium change at d0).\nD1-d3: Differentiation of mesendoderm into definitive endoderm (DE).\nRemove medium and add 500 μL BE1a + 100 ng/mL Activin A + 5 ng/mL FGF2 (medium change at d1 and d2).\nPerform quality check at d3. Flow cytometry analysis of surface marker CXCR4 and KIT as described in Breunig et al. (2021)[href=https://www.wicell.org#bib1]. Alternatively, perform intracellular marker staining of SOX17 and GATA6.",
    "Critical: More than 95% of DE cells should be double positive for the respective marker combination (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1219-Fig3.jpg\nFigure 3. Quality check via flow cytometry\nDifferentiation efficiencies at definitive endoderm (DE, d3), pancreatic endoderm (PE, d9), and pancreatic progenitor (PP, d13) stage are measured by flow cytometry. Our quality standards are 95% CXCR4+/KIT+ cells at DE stage, 90% PDX1+ cells at PE stage, and 60% PDX1+/NKX6-1+ cells at PP stage.\nD3-d6: Differentiation of DE into gut tube endoderm (GTE).\nRemove medium and add 500 μL BE1b + 50 ng/mL FGF10 + 0.75 μM Dorsomorphin + 3 ng/mL Wnt3a (medium change at d3, d4, and d5).\nD6-d9: Differentiation of GTE into pancreatic endoderm (PE).\nRemove medium and add 500 μL BE3 + 50 ng/mL FGF10 + 200 nM LDN-193189 + 0.25 μM SANT-1 + 2 μM retinoic acid + 16 mM glucose (medium change at d6, d7, and d8).\nPerform quality check at d9. Intracellular flow cytometry analysis of PDX1 as described in Breunig et al. (2021)[href=https://www.wicell.org#bib1].\nCritical: More than 90% of PE cells should be positive for PDX1 (Figure 3[href=https://www.wicell.org#fig3]).\nD9-d13: Differentiation of PE into pancreatic progenitors (PPs).\nRemove medium and add 500 μL BE3 + 100 ng/mL EGF + 200 nM LDN-193189 + 10 mM Nicotinamide + 330 nM Indolactam V + 16 mM glucose (medium change every day from d9 to d12).\nPerform quality check at d13. Intracellular flow cytometry analysis of PDX1 and NKX6-1 as described in Breunig et al. (2021)[href=https://www.wicell.org#bib1]. Duplicates should be analyzed for each cell line and measurements should precede harvesting and cell seeding at d13.\nCritical: More than 60% of PP cells should be double positive for PDX1 and NKX6-1 (Figure 3[href=https://www.wicell.org#fig3]).\nNote: We observed slight differences in PP efficiency between different well formats and use 24-well formats as standard for differentiation.",
    "Note: Cell death within the first 2 days after initiation of differentiation can be observed, as expected. Such cell death might vary between different cell lines but usually does not affect the differentiation efficiency. In case of excessive and prolonged cell death, however, leading to a disruption of the cell layer and, therefore, cell-cell interactions, differentiation can be hampered. For the successful differentiation of such cell lines, we recommend supplementing the differentiation media from d0 to d6 with 5–10 μM Rock inhibitor Y-27632.\nCritical: The seeding density is important and ideal cell numbers depend on the selected cell line and confluency of hPSCs at the time point of seeding. Also, homogenous cell seeding is important. Quality criteria at d3, d9, and d13 have to be met to seed PPs for the generation of PDLOs. If PP efficiency does not meet the quality check, glycoprotein 2 (GP2)-sorted cells can be used for PDLO differentiation. GP2 is described as cell surface marker that is specific for a multipotent pancreatic progenitor population (Cogger et al., 2017[href=https://www.wicell.org#bib2]; Ramond et al., 2017[href=https://www.wicell.org#bib5]). A step-by-step protocol for GP2 magnetic-activated cell sorting (MACS) can be found in Cogger et al. (2017)[href=https://www.wicell.org#bib2].\nStep II: Differentiation of PPs into PDLOs\nTiming: 14–17 days\nTiming: 45 min–1 h for step 3b[href=https://www.wicell.org#o0865]\nTiming: 45 min–1 h for step 3d[href=https://www.wicell.org#o0930]\nTiming: 14–17 days for step 4[href=https://www.wicell.org#olist0275]\nWhile in step I generated PPs are unspecified progenitor cells, step II allows the specification of PPs into pancreatic duct-like organoids resembling functional human pancreatic ducts. Sandwich culture and dome culture can be used equivalently. Please see Figure 4[href=https://www.wicell.org#fig4] for temporally resolved bright field images from PSC to PDLO stage.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1219-Fig4.jpg\nFigure 4. Time course of hPSC differentiation to PDLOs",
    "While PPs are differentiated in a 2D monolayer culture format, PPs are reseeded as single cells on day 13 to allow 3D growth of PDLOs. Representative bright field images for each stage are shown.\nCell seeding of PPs – Sandwich culture (Troubleshooting 3[href=https://www.wicell.org#sec6.5])\nPrecoating of wells and preparation.\nPrecoat the desired number of wells. Evenly distribute 150 μL of undiluted GFR-Matrigel per well of a 12-well plate in continuous z-shape movements on a precooled culture plate using precooled tips and incubate plates for around 30 min to 1 h at 37°C.\nNote: Take care that the Matrigel is evenly distributed across the whole well and avoid tilting the plate. For details on handling, please refer to Methods video S1[href=https://www.wicell.org#mmc1].\nHarvest PPs for PDLO differentiation.\nRemove medium from d13 differentiation culture.\nAdd 500 μL PBS, gently swirl the plate, remove PBS.\nAdd 200 μL TrypLE Express or TrypLE Select and incubate at 37°C until cells are detached.\nNote: Takes approximately 10–15 min. Complete detachment of cells is important to obtain a high number of cells.\nDilute the dissociation reagent by adding 800 μL DMEM/F12. Resuspend cells by carefully pipetting up and down without mechanical dissociation and transfer the cell suspension into a tube or falcon.\nFilter the cells through a 0.22 μm syringe filter.\nCentrifuge at 200 × g for 4–5 min and remove the supernatant. Resuspend cells in 1 mL BE3 medium.\nCount viable cells using a counting chamber.\nCentrifuge the desired number of cells at 200 × g for 4–5 min and remove the supernatant. Resuspend cells in PDLO medium (d13-d20) to a final concentration of 1.05 × 105 cells/mL.\nPut cells on ice and add 5% GFR Matrigel to the cell suspension.",
    "Pipet up and down and dropwise add 1 mL of the cell suspension to each of the precoated 12-wells (100,000 cells per well).\nNote: To prevent cell aggregation in the middle of the wells, perform 2–3 times 8-shaped movements followed by one sudden ↕↔ movement of the plate.\nNote: We use 12-well plates as standard format for the sandwich culture. For 6-well plates, please double the herein described volumes and cell numbers.\nCritical: Homogenous coating and cell seeding is important. Our strategy to ensure homogenous coating of the sandwich culture is based on Xiang and Muthuswamy (2006)[href=https://www.wicell.org#bib4] and is shown in Methods video S1[href=https://www.wicell.org#mmc1]. While wells can be homogenously coated for 12-well and 6-well formats, we do not recommend coating of lower well formats, as equal distribution of Matrigel in smaller well formats is more difficult and non-homogenous coating leads to disrupted organoid formation.\nAlternatives: Cell seeding in Matrigel-domes (step II-3) (Troubleshooting 3[href=https://www.wicell.org#sec6.5])\n    Your browser does not support HTML5 video.\n  \nMethods video S1. Matrigel-coating for sandwich culture, related to step II-3a\nPerform narrow z-formed movement to evenly distribute undiluted GFR-Matrigel. Use precooled tips and well plates and avoid any air bubbles.\nWell preparation.\nPrewarm 24-well plates for dome culture at 37°C for 10 min.\nHarvest PPs for PDLO differentiation.\nHarvest PPs. See step II-3b (i-vii) (sandwich culture)\nCentrifuge the desired number of cells at 200 × g for 4–5 min and remove the supernatant. Put cells on ice and resuspend cells with 50 μL GFR Matrigel per 30,000 cells.\nPipet up and down and add 50 μL drops of the cell suspension per well of a 24-well plate to the uncoated but prewarmed plate (30,000 cells per well).\nIncubate domes for around 10 min at 37°C to allow Matrigel solidification, then add 500 μL PDLO medium (d13-d20) to each well.",
    "Note: No additional Matrigel is added to the medium for the dome culture.\nNote: Sandwich and dome cultures can be used as equivalent alternatives. The choice for sandwich or dome depends on the intended application with the use of a sandwich format allowing for example improved in-well imaging and automated quantification of organoids.\nDifferentiation of PPs into PDLOs (Troubleshooting 1+4[href=https://www.wicell.org#sec6.1]).\nD13-d20: Differentiation of PPs into pancreatic trunk-like organoids (PTLOs)/ductal precursors.\nPDLO medium (d13–20) is added after the transfer of PPs into a 3D culture format on d13. PDLO medium (d13–20) consists of BE3 + 50 ng/mL EGF + 50 ng/mL FGF10 + 50 ng/mL KGF + 50 nM MSC2530818 + 10 mM Nicotinamide + 10 μM Rock inhibitor Y-27632 + 10 μM ZnSO4. For the sandwich culture, 5% GFR Matrigel was additionally added to the medium at each medium change (medium change at d17).\nFor medium change, carefully remove medium without mechanically disrupting the thick Matrigel layer and add 1 mL of PDLO medium(d13–20).\nD20-d27/d30: Differentiation of PTLOs into PDLOs.\nCarefully remove the medium without mechanically disrupting the thick Matrigel layer and add 1 mL of PDLO medium(d20->). PDLO (d20->) medium consists of BE3 + 50 ng/mL EGF + 50 ng/mL FGF10 + 10 mM Nicotinamide + 10 μM ZnSO4. For the sandwich culture, 5% GFR Matrigel was additionally added to the medium for each medium change (medium change at d20, d24, and d27).\nNote: For the medium change, the media is first prepared without Matrigel and the Matrigel is added on ice to the medium directly before the medium change.\nNote: Depending on the density of the PDLO culture, PDLOs are harvested between d27 and d30.",
    "Note: For the initial characterization of PDLO differentiation, we recommend performing a comprehensive characterization including functional assays and detailed marker profiling. Please refer for further information to Breunig et al. (2021)[href=https://www.wicell.org#bib1]. After successful establishment of the PDLO differentiation, examination of bright field images can be used as primary quality control as outlined in Figure 5[href=https://www.wicell.org#fig5].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1219-Fig5.jpg\nFigure 5. Illustrative PDLO cultures\nWhile PDLOs in the two bright field images on the left constitute homogenous cultures of ring-like organoids, PDLOs on the two right images represent poor cultures. While many PDLOs on the third image have not formed ring-like organoids or have collapsed, the fourth image highlights 2D structurers arising due to inhomogeneous coating.\nStep III: PDLO culture and processing\nTiming: 5–7 h for step 5a[href=https://www.wicell.org#olist0300]\nTiming: 5–7 h for step 5b[href=https://www.wicell.org#o1050]\nTiming: 4–6 h and 30 min for step 5c[href=https://www.wicell.org#o1075]\nTiming: 5–8 h for step 6a[href=https://www.wicell.org#olist0325]\nTiming: 3–5 h for step 6b[href=https://www.wicell.org#o1140]\nTiming: 5–7 h for step 6c[href=https://www.wicell.org#o1155]\nTiming: 3–5 h for step 6d[href=https://www.wicell.org#o1185]\nTiming: 2 h for step 6e[href=https://www.wicell.org#o1205]\nStep III describes the harvesting of PDLOs generated in step II for subsequent sampling to further cultivation, DNA, RNA, or protein analysis, or staining. PDLOs can be cultured for several passages, albeit PDLOs have not been systematically characterized beyond d59 (Breunig et al., 2021[href=https://www.wicell.org#bib1]). PDLOs are viable after freezing and thawing but potential changes in PDLO composition have also not been comprehensively investigated.\nFurther culturing of PDLOs\nSplitting PDLOs.\nRemove medium, wash twice with 1 mL PBS, remove PBS.\nAdd 1 mL of 1 mg/mL collagenase/dispase solution and incubate at 37°C until the Matrigel is mostly dissolved and PDLOs are detached (2–4 h).",
    "Note: The duration of the incubation should be adjusted for the different applications. While the Matrigel should be completely dissolved for the purification of protein (4 h incubation recommended), some Matrigel can be carried over for splitting of cells (2 h incubation is sufficient).\nAdd 2 mL neutralization solution and carefully rinse the well, transfer cell suspension to a 15 mL falcon and centrifuge at 200 × g for 4–5 min.\nRemove supernatant, add 5 mL PBS, and centrifuge at 200 × g for 4–5 min.\nCritical: If the Matrigel has not been completely resolved, Matrigel remnants will be carried over. In this case, perform an additional PBS washing step and be careful not to disrupt the pellet. The subsequent accutase step will further dissolve the Matrigel in addition to the singularization of cells.\nRemove supernatant, add 0.5 mL accutase, and incubate at 37°C in the water bath for 30 min.\nNote: For improved singularization of the cells, mix the solution by pipetting up and down (10 × before incubation, 10 × after 15 min of incubation, and 10 × at the end of incubation). When cell clusters are adverse as in flow cytometry experiments or for single cell seeding, the accutase step should be extended to 1 h.\nAdd 1 mL neutralization solution and centrifuge at 200 × g for 4–5 min.\nRemove supernatant, resuspend cells in 1 mL BE3.\nCount viable cells using a counting chamber.\nCentrifuge the desired number of cells at 200 × g for 4–5 min and remove the supernatant; resuspend cells into PDLO medium (d20->) supplemented with 10 μM Rock inhibitor Y-27632 to a final concentration of 1.05 × 105 cells/mL.\nPut cells on ice and add 5% GFR Matrigel to the cell suspension.",
    "Pipet up and down and dropwise add 1 mL of the cell suspension to one precoated well of the 12-well plate (100,000 cells per well).\nNote: In order to prevent cell aggregation in the middle of the wells, perform 2–3 times 8-shaped movements followed by one sudden ↕↔ movement of the plate.\nNote: PDLOs were successfully cultured until around day 100 (5–6 passages). While no differences in the expression of selected markers (SOX9, HNF1B, KRT19, ECAD) were observed in immunoflourescence staining, we have not assessed the PDLOs beyond d59 in more detail (Breunig et al., 2021[href=https://www.wicell.org#bib1]).\nCell preparation for xenotransplantation.\nHarvest and dissociate PDLOs and count single cells. See step III-5a (i-viii).\nCentrifuge 1 × 106 cells per mouse at 200 × g for 4–5 min and remove the supernatant. Resuspend cells in 25 μL PDLO medium (d20->) supplemented with 20 μM Rock inhibitor Y-27632.\nPut cells on ice and add 25 μL undiluted GFR Matrigel to the cell suspension.\nProceed with the transplantation of the 50 μL cell/Matrigel suspension as detailed in Breunig et al. (2021)[href=https://www.wicell.org#bib1].\nFreezing and thawing of PDLOs.\nHarvest and dissociate PDLOs to single cells. See step III-5a (i-vi).\nRemove supernatant. Resuspend cells in 1 mL NutriFreez D10 cryopreservation media supplemented with 10 μM Rock inhibitor Y-27632 and transfer cells into a cryopreservation tube.\nTransfer tubes into a freezing container and put into a −80°C freezer for around 24 h before transferring into a liquid nitrogen tank.\nFor thawing, quickly defrost vials at 37°C, add 5 mL DMEM/F12, and centrifuge at 200 × g for 4–5 min.\nRemove supernatant. Resuspend in BE3 medium and count viable cells using a counting chamber.",
    "Centrifuge the desired number of cells at 200 × g for 4–5 min and remove the supernatant. Resuspend cells in PDLO medium (d20->) supplemented with 10 μM Rock inhibitor Y-27632 to a final concentration of 2–4 × 105 cells/mL.\nNote: PDLO cells should be seeded at a higher density after thawing to ensure proper growth after freezing and thawing.\nPut cells on ice and add 5% GFR Matrigel to the cell suspension.\nPipet up and down and dropwise add 1 mL of the cell suspension to one well of a precoated 12-well plate (200,000–400,000 cells per well).\nNote: To prevent cell aggregation in the middle of the wells, perform 2–3 times 8-shaped movements followed by one sudden ↕↔ movement of the plate.\nNote: Thawing of frozen PDLOs (iv – viii) is described in detail for the sandwich culture. Seeding as dome cultures can be performed as equivalent alternative.\nNote: We recommend freezing multiple vials in one round and performing a test thaw after storage of cells in the liquid nitrogen tank for several weeks.\nNote: Monolayered ring-like PDLOs are formed within 8–12 days after thawing but the exact marker profile and cell composition has not been systematically analyzed after freezing and thawing. Repeated freezing and thawing are not recommended.\nHarvesting and sampling of PDLOs\nSampling for flow cytometry.\nHarvest and dissociate PDLOs to single cells. See step III-5a (i-vi).\nNote: Singularization of PDLOs with accutase should be extended to 1 h (step v).\nRemove supernatant, proceed with surface staining or paraformaldehyde fixation in case of intracellular marker staining as detailed in Breunig et al. (2021)[href=https://www.wicell.org#bib1].\nRNA isolation.\nRecover PDLOs from the Matrigel. See step III-5a (i-iv).",
    "Remove supernatant. Perform RNA lysis according to manufacturer’s instructions. Either freeze samples after lysis or directly continue with RNA isolation. RNA isolation using Gene Jet RNA Purification Kit resulted in very good RNA yields in our hands.\nProtein isolation.\nRecover PDLOs from the Matrigel. See step III-5a (i-iv).\nNote: The Matrigel should be completely dissolved in step ii (incubation for at least 4 h).\nRemove supernatant, wash with 5 mL PBS, and centrifuge at 200 × g for 4–5 min.\nRemove supernatant, add 1 mL PBS, transfer cell suspension to a 1.5-mL tube, and centrifuge at 200 × g for 4–5 min.\nCompletely remove supernatant.\nEither freeze the dry pellet at −80°C for protein isolation at a later time point or directly continue with protein lysis according to the downstream application. The lysis with RIPA buffer for Western Blotting and with urea buffer for mass spectrometry are detailed in Breunig et al. (2021)[href=https://www.wicell.org#bib1].\nNote: Use PBS without Ca2+ and Mg2+ for the isolation steps, as the respective cations might interfere with protein lysis.\nDNA isolation.\nRecover PDLOs from the Matrigel. See step III-5a (i-iv).\nRemove supernatant, wash with 5 mL PBS, and centrifuge at 200 × g for 4–5 min.\nPerform DNA lysis according to manufacturer’s instructions. DNA isolation using Animal Tissue Genomic DNA Purification Mini Prep Kit[href=https://www.genaxxon.com/shop-all-products/rna-dna-protein-reinigung/dna-reinigungskits/554/tissue-genomic-dna-purification-mini-spin-column-kit-50-columns?c=59] resulted in very good DNA yields in our hands.\nNote: No singularization of PDLOs is required for the isolation of RNA, protein, or DNA.\nParaffin-embedding.\nRemove medium, wash with 1 mL PBS, remove PBS.\nNote: PBS should be 20°C–23°C, not ice cold to prevent depolymerization of the Matrigel.\nAdd 1 mL 4% PFA solution (100 mM sucrose) for 14–18 h at 8°C.\nNote: PFA should be 20°C–23°C, not ice cold to prevent uncontrolled depolymerization of the Matrigel.",
    "Note: The Matrigel will be partly dissolved allowing to arrange organoids next to each other and simultaneously decreasing background staining.\nTransfer organoids that have been detached by the PFA treatment to a 1.5-mL tube first and then transfer remaining organoids in PBS by detaching them with a tip. Rinse the well again with PBS to transfer as many organoids as possible.\nNote: Coat pipet tips with 1% BSA/PBS to prevent sticking of the organoids on the wall of the tips and cut pipet tip to prevent mechanical shearing.\nCentrifuge organoids at 3000 × g for 5 min, remove supernatant, and add 1 mL PBS.\nRepeat the washing step in iv.\nFor pre-embedding, prepare 2% Agarose/PBS (small glass bottle). In parallel, heat water in a beaker. Let the agarose cool down to around 60°C in the hot water beaker (measure temperature).\nSpin down organoids at 3000 × g for 3 min.\nNote: If the organoid pellet is rather distributed along the tube, you can perform a second centrifugation step where you change the orientation of the tubes in the centrifuge.\nCarefully take off half of the supernatant of your sample.\nTransfer organoids with a 200 μL pipet with as little liquid as possible to cryomolds and carefully remove excess liquid with a 10 μL pipet.\nNote: The usage of 1% BSA/PBS-coated tips is especially important for transferring the organoids to the cryomold.\nAdd around 100 μL agarose to organoids to form a layer of agarose covering all organoids.",
    "Note: Do not pipet the agarose directly onto the organoids but add it dropwise at opposite edges of the mold to avoid floating of organoids towards one corner but arranging them in the center. Also take care that organoids are placed in the same plain. If not, you can arrange the position of organoids with a 200 μL pipette tip before the agarose starts to polymerize.\nWait some minutes until the agarose starts to polymerize, then fill up the mold with additional agarose.\nWhen agarose has cooled down to 20°C–23°C (takes around 5 min), transfer the block into a tissue cassette with filter paper and start with pre-dehydration.\nFor an initial pre-dehydration, incubate the tissue cassettes with the agarose blocks in 30% EtOH for 30 min.\nThen incubate in 50% EtOH for 30 min.\nIncubate in 70% EtOH for 20 min, and store at 4°C until continuing with routine histological processing including dehydration (starting at 70% EtOH), paraffin-embedding, sectioning to 4 μm thick serial section, and immunohistochemical or immunofluorescence staining.\nCryo-embedding:\nRemove medium, wash with 1 mL PBS, remove PBS.\nNote: PBS should be 20°C–23°C, not ice cold to prevent depolymerization of the Matrigel.\nAdd 1 mL 4% PFA solution (100 mM Sucrose) for 30 min at 20°C–23°C.\nNote: PFA should be 20°C–23°C, not ice cold to prevent depolymerization of the Matrigel.\nRemove PFA solution and wash twice with PBS.\nNote: PBS should be 20°C–23°C, not ice cold to prevent depolymerization of the Matrigel. When the Matrigel detaches during the washing steps, transfer organoids first and wash in 1.5 mL tubes.\nTransfer organoids with PBS to the 1.5 mL tube by scrapping off the organoid/Matrigel layer with a 1000 μL pipette tip. Rinse the well again with PBS to transfer nearly all organoids.",
    "Note: Coat pipet tips with 1% BSA/PBS to prevent sticking of the organoids on the wall of the tips and cut pipet tip to prevent mechanical shearing.\nCentrifuge organoids at 200 × g for 5 min, remove supernatant, and add 1 mL 25% sucrose solution (in PBS) for 14–18 h at 4°C.\nFor cryo-embedding, transfer organoids from the bottom of the tube in as less of sucrose solution as possible to cryomolds and carefully remove excess liquid with a 10 μL pipet.\nNote: The usage of 1% BSA/PBS-coated tips is especially important for transferring the organoids to the cryomold.\nAdd Tissue-Tek O.C.T. compound to form a layer covering all organoids.\nNote: Try to avoid air bubbles. Aspirate remaining air bubbles using a 200 μL pipette.\nNote: Do not add the Tissue-Tek O.C.T. directly onto the organoids but add it dropwise at opposite edges of the mold to avoid floating of organoids towards one corner but arranging them in the center. Also take care that organoids are placed at the bottom of the cryomold in the same plain. If not, the position of organoids can be arranged with a needle.\nWait for around 5 min to allow the Tissue-Tek O.C.T. to enter the tissue and for vanishing of remaining air bubbles.\nSnap-freeze in liquid nitrogen and store at −80°C.\nUse a cryotome for generating 6–10 μm thick sections on SuperFrost plus slides according to standard histological procedures."
  ],
  "subjectAreas": [
    "Organoids",
    "Stem Cells",
    "Cell Culture",
    "Developmental Biology",
    "Cell Differentiation"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}