{
  "id": 1854,
  "origin_website": "Cell",
  "title": "Detection of N6-methyladenosine in SARS-CoV-2 RNA by methylated RNA immunoprecipitation sequencing",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nStable cell line generation\nTiming: 2 weeks\nNote: All steps involving lentivirus vectors and experiments should be performed in accordance with institute policies and obtained approval from the Institutional Biosafety Committee.\nPackage shRNA-encoding lentiviruses in 293T cells\nPurchase lentiviral vectors containing the appropriate gene-targeting or control shRNAs, or clone the shRNA sequences into the lentiviral vector PLKO.1 or lentiCRISPR-v2.\nProduce lentivirus in 293T cells.\nThe day before transfection, resuspend 5×105 293T cells in DMEM medium supplemented with 10% fetal bovine serum and 50 U/mL penicillin-streptomycin and seed in a 6-well plate at a density sufficient to reach ∼80% confluence ∼24 h later.\nMix the shRNA plasmids with packaging plasmids (as indicated in the table below) in 100 μL Opti-MEM medium and then add 5 μL P3000 reagent and mix well.\ntable:files/protocols_protocol_1334_6.csv\nDilute 6.5 μL Lipofectamine 3000 in 100 μL Opti-MEM, mix with the plasmid/P3000 mixture, incubate for 10 min at 25°C, and then gently add dropwise to the plated cells in 2 mL medium.\nAlternatives: Lipofectamine 2000 or polyethylenimine (PEI) reagent can also be used as transfection reagents.\nIncubate the plate at 37°C. After 12 h, exchange the medium for fresh DMEM medium and continue the incubation at 37°C.\nAt 48 h and 72 h incubation, collect and pool the supernatants and centrifuge at 500×g for 10 min to pellet residual 239T cells.",
    "Remove the virus-containing supernatants and either transduce cells freshly or freeze at −80°C until use. Physical and functional titers can be tested before freezing the virus. For the physical titer, it can be easily determined by Lenti-X qRT-PCR Titration Kit or other RT-qPCR based method to detect lentiviral backbone components. For functional titer, if the vector contains fluorescence markers, use fluorescence-activated single cell sorting (FACS) to count the infected cells number after being infected with serial dilution of the viral supernatant. If the vector contains antibiotic resistance genes (e.g., Puromycin), colony-forming units can be quantified after the target cells were transduced with serial dilution of the viral stock and selected with the antibiotic. The Multiplicity of Infection (MOI) should be >1 for transduction.\nPrepare Caco-2 cells and transduce them with shControl or shMETTL3 lentiviruses.\nThe day before transduction, seed 5 × 105 Caco-2 cells in high-glucose MEM supplemented with 20% fetal bovine serum, MEM NEAA and 50 U/mL penicillin-streptomycin and seed in a 6-well plate at a density sufficient to reach ∼50% confluence ∼24 h later.\nRemove the supernatant from the seeded Caco-2 cells, add 800 μL shControl or shMETTL3 lentivirus in 1.2 mL medium, and then add Polybrene to a final concentration of 8 μg/mL.\nNote: The precise volume for added virus will be based on the lentiviral titer (see troubleshooting problem 1[href=https://www.wicell.org#sec7.1]).\nSpin the plates at 485×g for 2 h at 25°C.\nIncubate the plates at 37°C for 12 h, exchange the transduction medium for fresh MEM medium, incubate at 37°C for 48 h, and then start selection of stably transduced cell lines by changing to medium containing puromycin at 2 μg/mL. The exchange media must be treated with 10% bleach in the hood for at least 30 min before disposal.",
    "Passage and expand the cells in puromycin (2 μg/mL-containing MEM medium for ∼7 days, and then measure METTL3 mRNA and protein expression to determine silencing efficiency (Figure 1[href=https://www.wicell.org#fig1]). If necessary, continue the selection until high knockdown efficiency is achieved. Usually, the high knockdown efficiency indicates that the gene expression in the shRNA transduced cells is below 20% compared to control cells by RT-qPCR or Western blotting (see troubleshooting problem 1[href=https://www.wicell.org#sec7.1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1334-Fig1.jpg\nFigure 1. Expression of METTL3 in control and METTL3-knockdown Caco-2 cells\n(A) RT-qPCR analysis of METTL3 mRNA in Caco-2 cells expressing control or two METTL3-targeting shRNAs. Expression levels were normalized to GAPDH mRNA. Data are expressed as the mean ± SEM (n = 3). ∗p < 0.05 by Student’s t test.\n(B) Western blot analysis of METTL3 protein in Caco-2 cells expressing control or METTL3-targeting shRNA. Glyceraldehyde 3-phosphate dehydrogenase (GAPDH) was probed as a loading control.\nThese data are from the original Figures 1[href=https://www.wicell.org#fig1]D and 4F in Li et al. (2021)[href=https://www.wicell.org#bib8].\nInfect cells with SARS-CoV-2\nTiming: 1 week\nNote: All steps involving SARS-CoV-2 live virus should be performed in a BSL3 laboratory.\nPrepare SARS-CoV-2 for infection using standard procedures for virus propagation and quantification of infectious units by plaque assay with Vero E6 cells (Harcourt et al., 2020[href=https://www.wicell.org#bib4]). We obtained SARS-CoV-2 isolate USA-WA1/2020 from BEI Resources.\nResuspend the control and METTL3-knockdown Caco-2 cells in complete MEM medium and seed at ∼3 × 106 cells in one 10-cm dish or one full 6-well plate. Prepare at least triplicate dishes/wells per experimental condition.",
    "Infect Caco-2 cells with SARS-CoV-2 at a multiplicity of infection (MOI) of 2 diluted in serum-free MEM medium, one hour after infection, the virus-containing medium is disposed, and infected cells are washed by DPBS once, add fresh complete MEM medium and incubate the cells at 37°C for 24 h. Collect the supernatants and then harvest the cells by addition of TRIzol.\nObtain the viral copy number in the supernatant by RT-qPCR analysis by using iTaq Universal SYBR Green One-Step Kit and comparison with a standard curve generated from in vitro-transcribed viral nucleocapsid (N) region (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1334-Fig2.jpg\nFigure 2. Standard curve for calculation of viral copy number by RT-qPCR\nThe equation and R2 are shown. N_Sarbeco primer sets were used for qPCR (Corman et al., 2020[href=https://www.wicell.org#bib2]). Data are presented as the mean ± SEM (n=3).\nProceed to the following step-by-step method details[href=https://www.wicell.org#step-by-step-method-details] section for extraction and quantification of viral RNA and cellular mRNA.\nExtract and purify viral RNA from cell supernatants and mRNA from infected cells\nTiming: 1 day\nThis section describes the steps for RNA extraction from supernatants and infected Caco-2 cells collected in the preceding step.\nNote: All steps with SARS-CoV-2 live virus-infected cells and supernatants should be performed in a BSL3 laboratory.\nExtract viral RNA from Caco-2 culture supernatants.\nAdd 30 mL TRIzol LS per 10 mL supernatant, mix by pipetting, and incubate for 5 min at 25°C.\nNote: Samples can be transferred from the BSL3 laboratory after completion of this step.\nPause point: The supernatant-TRIzol LS mixture can be frozen at −80°C for ≤7 days before moving on to RNA extraction.\nAliquot the culture supernatant/TRIzol LS mixture into 50 mL tubes at 20 mL per tube. Add 4 mL of chloroform to each tube and shake for 20 s.",
    "Incubate the tubes for 10 min at 25°C.\nCentrifuge the tubes at 12,000×g for 15 min at 4°C.\nTransfer the ∼7 mL upper phase to a fresh 50 mL tube, add 2 μL GlycoBlue, and mix.\nAdd 10 mL isopropanol per tube, mix, and incubate for 10 min at 25°C .\nCritical: The isopropanol step precipitates the RNA.\nCentrifuge the 50 mL tubes at 12,000×g for 15 min at 4°C.\nRemove and discard the supernatant and gently wash the RNA pellet by adding 1 mL of 75% ethanol.\nAspirate the ethanol, air dry the RNA pellet for 5–10 min, and dissolve in 20 μL nuclease-free water.\nPerform in-column DNase I treatment at 25°C for 15 min and concentrate it using an RNA Clean & Concentrator-5 kit according to the manufacturer’s instructions https://files.zymoresearch.com/protocols/_r1013_r1014_r1015_r1016_rna_clean_concentrator-5.pdf[href=https://files.zymoresearch.com/protocols/_r1013_r1014_r1015_r1016_rna_clean_concentrator-5.pdf]\nAliquot the RNA and store at −80°C until use.\nAlternatives: RNA in the supernatants can also be extracted using a Direct-zol RNA Purification kit.\nExtract cellular mRNA from infected Caco-2 cells.\nAdd TRIzol directly to the adherent Caco-2 cells at a 10cm dish or 6-well plate, aspirate the lysate, and mix by pipetting five times.\nExtract total RNA from the sample and perform on-column DNase I treatment using a Direct-zol Miniprep Plus RNA kit according to the manufacturer's instructions https://files.zymoresearch.com/protocols/_r2070t_r2070_r2071_r2072_r2073_direct-zol_rna_miniprep_plus_kit.pdf[href=https://files.zymoresearch.com/protocols/_r2070t_r2070_r2071_r2072_r2073_direct-zol_rna_miniprep_plus_kit.pdf]\nNote: If fewer than 5 × 106 cells are extracted, use the Direct-zol RNA Microprep/Miniprep kit.\nIsolate mRNA from the 100 μg purified total RNA sample using a Magnetic mRNA Isolation kit according to the manufacturer’s instructions https://www.neb.com/-/media/nebus/files/manuals/manuals1550.pdf?rev=bf3077d4994b492fb81dc09702571e84&hash=EC035147BC5AE92258976BFD95143341[href=https://www.neb.com/-/media/nebus/files/manuals/manuals1550.pdf?rev=bf3077d4994b492fb81dc09702571e84&hash=EC035147BC5AE92258976BFD95143341]. Perform two rounds of polyA selection to ensure the mRNA is of high purity.\nCheck the mRNA quality (e.g., Agilent TapeStation) to be sure that ribosomal RNA (rRNA) is depleted (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1334-Fig3.jpg\nFigure 3. Examination of Caco-2 mRNA purity using Agilent TapeStation",
    "(A and B) Gel image (left) and electropherogram (right) of two samples of total cellular RNA (A) and RNA after depletion of ribosomal RNA (rRNA) (B). Samples were analyzed using an Agilent RNA Screen TapeStation.\nAlternatives: rRNA depletion can also be performed using an rRNA depletion kit such as the RiboMinus Eukaryote System v2.\nFragment the purified RNA and perform MeRIP\nTiming: 2 days\nThis section describes the steps for performing immunoprecipitation of m6A (MeRIP) from the isolated viral RNA and cellular mRNA. The steps are identical for both RNA types.\nNote: During optimization experiments, we determined that this fragmentation step can be performed on as little as 300 ng of cellular mRNA (see troubleshooting problems 2[href=https://www.wicell.org#sec7.3]and 3[href=https://www.wicell.org#sec7.5]).\nRNA fragmentation\nDilute equal amounts of supernatant RNA or cellular mRNA in 9 μL nuclease-free water.\nAdd 1 μL of 10X Fragmentation Buffer (Ambion RNA Fragmentation Reagent) to the RNA samples, mix well by pipetting, and incubate at 70°C for 15 min.\nAdd 1 μL of Stop Solution (Ambion RNA Fragmentation Reagent) per sample and place on ice.\nCritical: Incubate for exactly 15 min after adding the fragmentation buffer and place immediately on ice after adding the stop solution. These steps are important to ensure the optimal fragment size (100–200 bp).\nAdd a 350 μL TE buffer to the fragmented RNA.\nAdd 40 μL 3 M sodium acetate, 1.5 μL GlycoBlue, and 1 mL 100% ethanol to the solution, mix gently, and incubate at −80°C for ∼14 h.\nPlace the mixture on ice and then centrifuge at 12,000×g at 4°C for 30 min. Aspirate the supernatant without touching the RNA pellet.\nWash the RNA pellet by adding 1 mL of 75% ethanol and centrifuging at 12,000×g at 4°C for 5 min. Aspirate the supernatant without touching the RNA pellet.",
    "Air dry the RNA pellet for 5 min and then dissolve in 20 μL nuclease-free water.\nPause point: The RNA can be stored in −80°C for ≤7 days.\nMeasure the concentration of fragmented RNA using a Nanodrop or Qubit.\nRemove 10% of the fragmented RNA solution (2 μL) and place at −80°C for use as the “input RNA” sample. The remaining ∼18 μL of fragmented RNA is used for MeRIP.\nNote: The recovery rate of fragmented RNA should be >90%.\nMeRIP of fragmented RNA\nAdd 500 μL MeRIP binding buffer to the ∼18 μL fragmented RNA solution and mix gently.\nAdd 5 μL of anti-m6A antibody and 2.5 μL of RNase inhibitor to the sample.\nRotate the sample at 4°C for 2 h to allow binding of the antibody to m6A-modified RNA fragments.\nFor each immunoprecipitation (IP) sample, prepare 50 μL of protein A/G magnetic beads by washing twice with a MeRIP binding buffer.\nAdd the IP sample solution to the pre-washed magnetic beads and rotate at 4°C for 2 h.\nCollect the beads using a magnetic stand and discard the supernatant.\nAdd 500 μL of MeRIP binding buffer to the magnetic beads, mix well, collect the beads using the magnetic stand, and discard the supernatant.\nAdd 500 μL of MeRIP wash buffer to the tube, mix well, and collect the beads with a magnetic stand, discard the supernatant. Repeat the wash twice.\nAdd 50 μL of freshly prepared MeRIP elution buffer to the beads and incubate in a ThermoMixer at 25°C for 20 min. Collect the eluates.\nRepeat step i for a second elution of the beads and combine the two eluates.\nPurify RNA from the eluates using an RNA Clean & Concentrator kit according to the manufacturer’s instructions https://files.zymoresearch.com/protocols/_r1013_r1014_r1015_r1016_rna_clean_concentrator-5.pdf[href=https://files.zymoresearch.com/protocols/_r1013_r1014_r1015_r1016_rna_clean_concentrator-5.pdf]. Eluate the MeRIP RNA in 6 μL RNase-free water.",
    "Critical: The MeRIP elution buffer must be prepared fresh for each experiment to ensure efficient elution (see troubleshooting problems 2[href=https://www.wicell.org#sec7.3] and 3[href=https://www.wicell.org#sec7.5]).\nLibrary preparation for next-generation sequencing (NGS) and bioinformatics analysis of the sequencing results\nTiming: 3–7 days\nThis section describes the steps to prepare the library for NGS from the input RNA and MeRIP RNA samples and the bioinformatics analysis of the sequencing results.\nPrepare input and MeRIP sample libraries for NGS.\nTake out the purified input and MeRIP RNA and equalize the volume to 6 uL by adding 4 uL RNase-free water to 2 uL input RNA.\nPrepare the libraries using an Illumina TruSeq Stranded mRNA kit with the following modifications.\nNote: Locate and thaw the reagents before starting the preparation.\nInstead of the kit instructions, bring the volume of the RNA solutions up to 18 μL with FPF mix, which contains the random hexamer primers.\nInstead of repeating the fragmentation, heat the samples at 65°C for 5 min, which disrupts RNA structure and facilitates priming, and then proceed to the first-strand synthesis step. Thereafter, follow the manufacturer’s instructions. https://support.illumina.com/content/dam/illumina-support/documents/documentation/chemistry_documentation/samplepreps_truseq/truseq-stranded-mrna-workflow/truseq-stranded-mrna-workflow-checklist-1000000040600-00.pdf[href=https://support.illumina.com/content/dam/illumina-support/documents/documentation/chemistry_documentation/samplepreps_truseq/truseq-stranded-mrna-workflow/truseq-stranded-mrna-workflow-checklist-1000000040600-00.pdf]\nCheck the library quality, normalize, and pool the libraries for NGS. The sequencing is performed in the Illumina NovaSeq 6000 instrument. The read length is 101 bp pair end and the reading depth is ∼50 M/sample.\nAlternatives: The library can also be prepared using an Illumina TruSeq Stranded Total RNA kit (or similar kit) with the following modifications. Instead of the kit instructions, add 8.5 μL EPH buffer to 8.5 μL of RNA samples. Instead of repeating the fragmentation, heat the samples at 65°C for 5 min to disrupt the RNA structure and facilitate priming, and then proceed to first-strand synthesis. Thereafter, follow the manufacturer’s instructions https://support.illumina.com/content/dam/illumina-support/documents/documentation/chemistry_documentation/illumina_prep/RNA/illumina-stranded-total-rna-checklist-1000000124515-01.pdf[href=https://support.illumina.com/content/dam/illumina-support/documents/documentation/chemistry_documentation/illumina_prep/RNA/illumina-stranded-total-rna-checklist-1000000124515-01.pdf] (see troubleshooting problem 3[href=https://www.wicell.org#sec7.5]).",
    "Bioinformatic analysis of sequencing data (please also refer to Li et al. (2021)[href=https://www.wicell.org#bib8])\nRemove sequencing adaptors using Cutadapt (parameters: cutadapt -a ADAPTER_FWD -A ADAPTER_REV -o out.1.fastq -p out.2.fastq reads.1.fastq reads.2.fastq; where assuming the sequencing file is in reads.1.fastq and reads.2.fastq). The target reads for each sample is ∼50 M. Align the sequencing reads to the SARS-CoV-2 genome using Bowtie2 or STAR (parameters for Bowtie2: bowtie2 -x SARS_CoV_2 genome -1 1.fastq.gz -2 2.fastq.gz -S 1_map_and_unmap.sam; parameters for STAR: star --runThreadN 4 --genomeDir SARS_CoV_2 --readFilesIn reads.1.fastq, reads.2.fastq --outFileNamePrefix 1/1_ --outSAMtype BAM SortedByCoordinate; where assuming the sequencing file is in reads.1.fastq and reads.2.fastq)\nUse Samtools to generate and sort bam files for aligned reads (parameters: samtools sort 1_map.bam-o 1_map.sorted.bam; samtools index 1_map.sorted.bam; where assuming the 1 is the bam file generated from Bowtie2 or STAR)\nCall m6A peaks with m6A viewer or MACS2 based on the paired m6A-RIP/input data from the aligned reads (parameters: macs2 callpeak -t MeRIP_map.sorted.bam -c input_map.sorted.bam -f BAMPE -g 2.9903e+4 -n MeRIP-CoV2 -p 0.05 --out 3 --nomodel --extsize 200 --call-summits).\nFor the m6A viewer, we used the following parameters: expected peak length 200, enrichment fold >3, false discovery rate <0.01, minimum peak height 10,000. For MACS2, we used the following parameters: p value < 0.05, call-summit no model, BAMPE, maximum duplicate fragments = 1 or keep all duplicates.\nUpload the BedGraph file and the bed file to view the called peaks in Integrative Genomics Viewer (Figure 4[href=https://www.wicell.org#fig4]) (see troubleshooting problem 4[href=https://www.wicell.org#sec7.7]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1334-Fig4.jpg\nFigure 4. Genome browser tracks for input total RNA and MeRIP-Seq RNA from SARS-CoV-2",
    "SARS-CoV-2 reads were aligned with STAR and peaks were called by MACS2 without removing duplicates. Blue, red, and green colors indicate input viral RNA, and viral RNA extracted from supernatants of control and METTL3-knockdown cells. Bed files of the so-called peak regions are shown under the MeRIP track of each group. The scale of the peak density is the same for all groups. The enlarged view shows m6A signals in the 3′ end of the SARS-CoV-2 genome. These data are from the original Figure 1[href=https://www.wicell.org#fig1]F in Li et al. (2021)[href=https://www.wicell.org#bib8].\nValidate the Me-RIP-Seq findings by performing MeRIP-RT-qPCR.\nDesign 4 sets of qPCR primers for the m6A-enriched nucleocapsid (N) region in SARS-CoV-2 (primers for N1–N4 are listed here: MeRIP-N1: nCoV_N1-F: 5′-GACCCCAAAATCAGCGAAAT-3′, nCoV_N1-R : 5′-TCTGGTTACTGCCAGTTGAATCTG-3'; MeRIP-N2: nCoV_N2-F: CACATTGGCACCCGCAATC, nCoV_N2-R: GAGGAACGAGAAGAGGCTTG; MeRIP-N3: nCoV_N3-F: GGAACTAATCAGACAAGGAAC, nCoV_N3-R: GAAATTTGGATCTTTGTCATC; MeRIP-N4: nCoV_N4-F: ACATTCCCACCAACAGAGCC, nCoV_N4-R: CAGCACTGCTCATGGATTG).\nFor negative controls, design primers to amplify SARS-CoV-2 envelope (E) gene and human glyceraldehyde 3-phosphate dehydrogenase (GAPDH), which represent unmethylated viral and Caco-2 genes, respectively. For the present analysis, the primers were designed based on the location of the m6A peaks in the SARS-CoV-2 viral genome (Figure 5[href=https://www.wicell.org#fig5]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1334-Fig5.jpg\nFigure 5. Validation of MeRIP-Seq data by MeRIP-RT-qPCR\n(A) Expanded view of the m6A signals in the SARS-CoV-2 genome (as in Figure 4[href=https://www.wicell.org#fig4]) with the qPCR primer design of the N gene (N1–4) and E gene shown below.",
    "(B) MeRIP-RT-qPCR of viral RNA extracted from SARS-CoV-2-infected Caco-2 cells expressing shControl or shMETTL3. Equal amounts of viral RNA were immunoprecipitated with control IgG antibody or anti-m6A antibody. Amplification of E and GAPDH RNA served as negative viral and Caco-2 controls, respectively. Data are presented as the mean ± SEM (n = 3). ∗p < 0.05, ∗∗p < 0.01, and ∗∗∗p < 0.001 by Student’s t test. These data are adapted from the original Figures 1[href=https://www.wicell.org#fig1]F and 1G in Li et al. (2021)[href=https://www.wicell.org#bib8].\nPerform MeRIP on the RNA samples as described in steps 10–11 above. In the IP step, include samples incubated with IgG control antibodies equal to the amount of anti-m6A antibody (5 μg). Equalize the final volume of purified 10% input and MeRIP RNA to 6 uL in RNase-free water.\nTake 1 μL of the final eluates from the MeRIP samples and 1 μL of the reserved input RNA and perform reverse transcription with an iScript cDNA synthesis kit using the following reaction conditions:\ntable:files/protocols_protocol_1334_7.csv\nDilute the cDNA 10-fold in Nuclease-free water, and prepare 10 μL PCR reaction samples as indicated below and run the samples on a LightCycler 480.\ntable:files/protocols_protocol_1334_8.csv\nCalculate the enrichment of m6A-modified RNA as a percentage of input RNA for each independent replicate using the following equation.\nEnrichment (as % of input) = 2Ct (Input) − Ct (MeRIP) × 10\nAverage the values for the three biological replicates per group (Figure 5[href=https://www.wicell.org#fig5]B) (See troubleshooting problem 5[href=https://www.wicell.org#sec7.9]).",
    "Note: Multiplication by 10 corrects for the percentage of input (10%). The absolute input % value of the positive region should be >0.5 and the negative control should be <0.1. The relative value of the positive m6A modified region is compared with IgG. The value of fold enrichment from the positive region should be more than 5 over IgG, and the value of the negative region should be about 1.\nCritical: At least three biological replicates should be included for each group."
  ],
  "subjectAreas": [
    "Rnaseq",
    "Sequence Analysis",
    "Bioinformatics",
    "Antibody",
    "Cell Culture",
    "Cell Biology",
    "Microbiology",
    "Genetics",
    "Molecular Biology",
    "Gene Expression",
    "Sequencing"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioinformatics & Computational Biology",
    "Bioengineering & Technology"
  ]
}