{
  "id": 10004,
  "origin_website": "Jove",
  "title": "Equipment Setup and Artifact Removal for Simultaneous Electroencephalogram and Functional Magnetic Resonance Imaging for Clinical Review in Epilepsy",
  "procedures": [
    "This study was performed in compliance with Protocol #62050, approved by the Institutional Review Board at the University of Kentucky (UK).\n1. Subject recruitment\nInclusion criteria\n\tNOTE: All of the following criteria must be met.\n\t\nInclude subjects diagnosed with refractory focal epilepsy and eligible for epilepsy surgery evaluation.\nInclude subjects who are between 18-60 years of age.\nInclude female subjects with childbearing potential if they use a contraceptive method. Include female subjects without childbearing potential (postmenopausal for at least 2 years, bilateral oophorectomy or tubal ligation, complete hysterectomy).\n\t\tNOTE: Per standard of care, a pregnancy test is performed for women of childbearing potential once admitted to the EMU.\nInclude subjects scheduled for admission to the EMU with a diagnosis of refractory focal epilepsy or for seizure characterization.\nExclusion criteria\n\t\nExclude subjects who have severe claustrophobia.\nExclude subjects with implanted medical devices or embedded metal which would normally disqualify them from having an MRI, which is routinely checked by the MR technologist prior to any scan.\nExclude subjects who are pregnant or lactating.\nExclude subjects with any known medical or psychiatric condition that, in the investigator's opinion, could jeopardize or would compromise the subject's ability to participate in this study, or would impair reliable participation in the study.\nNOTE: Once the patient is admitted to the EMU, after the patient's agreement on the consent form to participate in this study, the following steps will be followed.\n2. Electrode placement\nMark electrode positions on the patient's scalp, based on the 10-20 system.\n\tNOTE: Figure 1 shows one selection of 32 electrodes.\n\t\nMeasure and note the patient's head center line of the scalp by placing a measuring tape from the nasion to the inion by passing the top center of the head (Measure A: sagittal plane).",
    "Mark 50% of Measure A from the nasion to the inion. This mark indicates the electrode's Cz location.\nMark 10% of Measure A from the nasion to the indicated Cz. This mark indicates the electrode's Fpz location.\nMark 10% of Measure A from the inion to the indicated Cz. This mark indicates the electrode's Oz location.\nMark 20% of Measure A from the indicated Cz to Fpz. This mark indicates the electrode's Fz location.\nMark 20% of Measure A from the indicated Cz to Oz. This mark indicates the electrode's Pz location.\nMeasure and note the patient's head from the left preauricular point to the right preauricular point by passing the top center of the head (Measure B: coronal plane).\nMark 50% of Measure B and make sure this location is overlapped with the indicated Cz location.\nMark 10% of Measure B from the left preauricular point to Cz. This mark indicates the electrode's T3 location.\nMark 10% of Measure B from the right preauricular point to Cz. This mark indicates the electrode's T4 location.\nMark 20% of Measure B from the indicated Cz to T3. This mark indicates the electrode's C3 location.\nMark 20% of Measure B from the indicated Cz to T4. This mark indicates the electrode's C4 location.\nMeasure and note the circumference of the patient's head by passing through the marked Fpz and Oz (Measure C: transverse plane).\nMark 10% of Measure C left and right from Fpz. These marks indicate the electrode's Fp1 and Fp2 locations, respectively.\nMark 10% of Measure C left and right from Oz. These marks indicate the electrode's O1 and O2 locations, respectively.\nMark 20% of Measure C left from Fp1 and right from Fp2. These marks indicate the electrode's F7 and F8 locations, respectively.",
    "Measure and note the distance from F7 and F8 in the coronal plane (Measure D: coronal plane).\nMark 50% of Measure D, and make sure the previously indicated Fz is overlapped.\nMark 25% of Measure D from F7 toward Fz, and from F8 to Fz. These marks indicate the electrode's F3 and F4 locations, respectively.\nMeasure the distance from the nasion to the inion passing through Fp1 and O1. Ensure 50% of the measure overlaps with the previously indicated C3.\nMeasure the distance from the nasion to the inion passing through Fp2 and O2. Ensure 50% of the measure overlaps with the previously indicated C4.\n\t\tNOTE: In the same manner, electrode positions on the temporal and parietal lobes can be marked, including T5, P3, P4, and T6. In addition, any additional electrode locations, such as TP9, TP10, FT9, and FT10, can be marked based on the relative distance from the 10-20 system's electrode distributions. The number of electrodes and their distributions can be determined based on the prospective analysis and research focus.\nClean the patient's scalp using skin prep gel on gauze.\nPlace conductive paste on one electrode cup. Place the electrode on the patient's scalp following the channel name on the electrode's cable.\n\tNOTE: For simultaneous EEG-fMRI recording, it is required to use MR conditional electrodes, and Food and Drug Administration (FDA)-approved electrodes are suggested at the EMU.\nRepeat placing the gel and electrodes on the patient's scalp (step 2.3) for all electrodes (Figure 2A).",
    "NOTE: The cables connected to the MR conditional electrodes are relatively short to the connecting junction to minimize the MR artifacts. Therefore, when placing the electrodes, consider the electrode positions and carefully place them so that the cables can be well organized. In addition, make sure there are no loops on the wires, since they can potentially produce heat and burns inside the scanner.\nAdhere all electrodes to the patient's scalp using glue on gauze. Arrange all the electrode cables and place the cable junction far from the scalp by placing pads of gauze on the center of the subject's head (Figure 2B, red arrows).\n\tNOTE: This is a critical step to avoid imaging artifacts.\nWrap all the cable junctions with self-adhesive bandage wrap (blue ovals in Figure 2B).\n\tNOTE: This step is suggested to secure the connections during the recording.\nPlace an elastic head cover to secure all the electrodes. Connect the harness, which is connected to the electrodes, to the amplifier. Begin monitoring their EEG synchronously with video recordings.\n3. EEG-fMRI recording\nNOTE: For the EEG-fMRI recording, the MR conditional EEG recording system is used along with the MR conditional electrodes placed at the beginning of EMU admission.\nIn the monitoring room, connect the USB 2 adapter to the Triggerbox kit with a cable (thick white cable in Figure 3A).\n\tNOTE: The USB 2 adapter allows to interface other hardware with a computer, and the Triggerbox kit is employed to manipulate the trigger signal generated from the scanner to be detected in the EEG recording software.\nConnect the Syncbox to the USB 2 adapter with a cable (thick black cable in Figure 3B).\n\tNOTE: The role of the Syncbox is to synchronize the clock signals from the amplifier and the scanner's gradient switching system.",
    "In the monitoring room, connect one end of the fiber optic cable to the Syncbox (Figure 3C left), and pass another end through a tunnel connected to the scanning room.\nConnect a USB port cable from the USB 2 adapter to the recording computer (star mark in Figure 3B). Connect a USB port cable from the Syncbox to the recording computer (star mark in Figure 3C). Connect a USB port cable from the Triggerbox to the recording computer (star mark in Figure 3D). Connect the software license dongle to the recording computer.\n\tNOTE: There are in total four USB ports that will be used. Having a multi-USB port can be helpful in managing them all.\nSet up the EEG recording amplifier along with the MR-sled kit inside the scanner.\n\tCAUTION: Any metal or MR-sensitive components must be removed from the experimenters. It is required for the experimenters to complete appropriate training to conduct recordings in the MRI scanning room.\n\tNOTE: It is recommended to fully charge the amplifier battery prior to conducting the recording.\nConnect the end of the fiber optic cable in the scanning room to the back of the amplifier (Figure 4D) and turn on the amplifier.\n\tNOTE: The other end of the fiber optic cable is connected to the Syncbox in the monitoring room.\nWhen the equipment setup is complete, open the EEG recording software by clicking the software icon on the computer screen. Create a workspace in the recording software by clicking the New Workspace menu under the File tab in the top left of the window.\nSet a folder path where the new data will be stored by clicking the Browse button.",
    "Insert the data name in a blank box for Prefix and specify the numbering index by inserting a numeral in the black boxes for Min. Counter Size [digits] and Current Number.\nAfter confirming that the file name is correctly displayed under Next Resulting Filename, click Next.\nScan the amplifier by clicking the Scan for Amplifier button in the top left of the created window. Set up appropriate parameters, including sampling rates and low and high cut-off frequencies for recording by selecting the appropriate options listed for Sampling Rate, Low Cutoff, and High Cutoff (see Figure 5).\n\tNOTE: The Sampling Rate is set to 5,000 Hz to sufficiently sample the gradient artifacts from the scanner. A Low Cutoff of 10 s is inserted to prevent direct current (DC) saturation (the time unit is used in the recorder software), and a High Cutoff of 250 Hz is set to limit the gradient artifact amplitude before entering the analog to digital converter.\nSet the scanner parameters for the fMRI.\n\tNOTE: A possible resting state fMRI BOLD acquisition setting is an echo-planar sequence (TR/TE = 1360/29 ms, flip angle = 65, 54 slices covering the entire brain, field of view = 260 mm x 260 mm, resolution = 2.5 mm isotropic voxels). The details of the fMRI settings can be varied depending on the objective of the recording.\nSwitch off the scanner helium pump to further reduce the introduction of artifacts into the EEG signal.\n\tNOTE: Turning off the helium pump can result in liquid helium loss or shield temperature increases. Thus, it is strongly recommended to check with the scanner vendor to verify if turning off the helium compressor is not overly detrimental to their MRI scanning system.\nTransfer the patient to the scanning waiting room. Explain the recording procedure to the patient.",
    "NOTE: It is recommended that all the recording equipment setup is completed before the patient's arrival.\nClean the patient's back, right below the patient's left shoulder, where the electrocardiogram (ECG) lead will be placed. Apply an abrasive electrolyte gel on the ECG lead and place it on the left back side of the patient.\n\tNOTE: The length of this cable is short, so when placing the ECG lead, do not pull strongly or put it too low on the back; approximately 5 cm below the shoulder is acceptable. The ECG lead is placed on the back to minimize moving artifacts.\nApply adhesive tape around the ECG lead and cable to minimize scanning artifacts during the recording. Disconnect the EEG harness and connect the EEG cable junctions to the interface box (Figure 4B).\nTransport the patient to the scanning room. Lay the patient down onto the scanning table with the head in the open bottom half of the head coil.\n\tCAUTION: Any metal or MR sensitive components must be removed from the subject.\n\tNOTE: Support the patient's back when lying down.\nApply earplugs to help reduce the scanner's noise. Apply a cushion around the patient's head to minimize head movement artifacts.\nConnect the top half of the head coil to close the \"bird cage\" coil around the patient's head. Adjust the bed height. Connect the interface box to the amplifier (Figure 4C).\n\tNOTE: Adhesive tape is also applied to the cables from the interface box to minimize scanning artifacts (white wrap in Figure 4B).\nPlace the MR-safe sandbags around the cables to minimize the MR artifacts during the recording (Figure 4C). Once all the settings in the scanning room are complete, move to the monitoring room.",
    "Communicate with the patient through a microphone in the monitoring room, explaining that additional steps for setting the software settings are being carried out.\n\tNOTE: The experimenters can communicate through built-in speakers in the scanning room and a microphone in the monitoring room.\nCheck the impedance of the EEG electrodes by clicking on the Impedance Check button in the top left of the recording software window opened on the computer. Confirm with the patient that they are ready for the recording.\n\tNOTE: During the recording, experimenters monitor the patient's condition through a video camera in the scanning room and communicate through the microphone in the monitoring room.\nStart the EEG recording by clicking on the Play button in the top left of the recording software. Run the fMRI acquisition scan.\n\t​CAUTION: In any case when the patient reports discomfort due to the recording environment, including noise, the experimenter should stop the recording procedure.\n4. EEG artifact removal\nNOTE: The following descriptions provide detailed steps on how to remove the scanner artifacts on the EEG data obtained from the simultaneous EEG-fMRI recordings. Figure 6 displays the processing pipeline with representative examples.\nOpen the EEG analysis software.\nApply MR artifact correction.\n\t\nClick on the Transformations > Special Signal Processing > MR Correction tab. When a small window is generated, select Use Markers, choose a trigger signal from the scanner, and click Next.\n\t\tNOTE: This step indicates a trigger signal from the scanner and uses it as a reference to remove the MR artifacts.\nSelect the Interleaved and Based on Time options, insert the time information of the trigger signal, and click on Next.",
    "NOTE: In the acquired data, V1 is the trigger signal, and the following values can be inserted based on the V1 trigger intervals: start [ms]: -2; end [ms]: 1,358; and duration [ms]: 1,360. The label of the trigger signal and its detailed setting can be varied depending on the scanner's configuration.\nIn the following window, check Enable Baseline Correction for Average and uncheck Compute Baseline Over the Whole Artifact. Insert the Start [ms] and End [ms] values. Select Use Sliding Average Calculation.\n\t\tNOTE: This allows one to correct the baseline based on a sliding window.\nInsert Total Number of Intervals for Sliding Average, check Common Use of All Channels for bad Intervals and Correction, and click on Next.\n\t\tNOTE: Total Number of Intervals for Sliding Average can be 21.\nSelect Use All Channels for Correction and click Next.\nCheck Do Downsampling and choose 500 for New Frequency [Hz]. Check Apply Lowpass Filter and select Use FIR Filter, insert 70 for Cut-off Frequency [Hz], and then click on Next.\nOnce all the settings are completed, select one Store Corrected Data option, and then click on Finish.\n\t\tNOTE: Store Data Uncompressed in History File can be selected as a Store Corrected Data option. Different options may be considered, depending on the purpose. After clicking Finish, a small Scanner Artifact Correction window will appear in the middle, showing the processing status. This MR correction process may take some time to complete, depending on the EEG data size.\nApply DC removal by a high-pass filter. Click on the Transformation > Data Filtering > IIR Filters tab. On a newly generated window, check Enabled under Low Cutoff. Insert a cutoff Frequency [Hz] of 0.5, choose the filter Order as 2, and then click on OK.\nRemove cardioballistic artifacts.",
    "Click on the Transformations > Special Signal Processing > CB Correction tab. On the window that subsequently opens, select Use Peak Detection and check Semiautomatic Mode.\nUnder the Search Pulse Template section, insert Start[s] as 60 and Length[s] as 20. Check Mark Found Template and make sure the appropriate ECG channel is chosen.\nInsert proper parameters for Pulse Rate and Correlation and Amplitude, insert R for Mark Pulses with R-Peak Markers, and then click on Next.\n\t\tNOTE: The suggested value for Pulse Rate [ms] is 1000 ± 400 and Pulse Rate [bpm] is a minimum of 43 and a maximum of 100. The specific Pulse Rate values depend on the subject's ECG ranges. In addition, Correlation Trigger Level can be set as 0.6 and Amplitude Trigger Level as a minimum of 0.3 and a maximum of 1.4.\nCheck Use Whole Data to Compute the Time Delay. Insert Total Number of Pulse Intervals Used for Average.\n\t\tNOTE: Total Number of Pulse Intervals Used for Average can be set as 21.\nUnder Correct Following Channels, move all the EEG channels to the right column except the ECG channel, and then click Next.\nOn the next page, select one Store Corrected Data option as preferred. Click on Finish.\n\t\tNOTE: Once Finish is clicked, a CB Correction-Interactive Mode window will appear on the right side of the software.\nSlide over the time axis at the bottom of the Navigation Bar and check where the base template ECG is highlighted with a blue shaded box. Confirm the base template of the ECG is correctly marked.",
    "NOTE: By double-clicking the ECG channel name, only the ECG channel will be displayed for review. Consider a manual adjustment of the peak or the interval as needed. In the CB Correction-Interactive Mode window on the right side of the software, ECGs with abnormal patterns are listed in sequential order in a table format. These are indicated in the ECG trace as red vertical lines.\nIn the CB Correction-Interactive Mode window, check each marked ECG by double-clicking on its corresponding row in the table. Adjust the detected peak locations, as needed, by moving the red vertical lines. Once all the detected ECGs are reviewed, click on Finish.\n\t\tNOTE: The channel initially contains only red and green markers. The green markers indicate good detections, while the red markers indicate potential pulse peaks that do not meet all conditions required. The red markers change to yellow after modifying them manually. When correcting the abnormal ECGs, it is important to consider that each peak location and the time interval of each ECG should be consistent.\nApply powerline and alternating current (AC) noise removal by a notch filter. Click on the Transformation > Data Filtering > IIR Filters tab. In the window that opens, check Notch Enabled, select Frequency [Hz], and then click on OK.\n\tNOTE: For the frequency selection, either 50 or 60 Hz can be selected depending on the country where the recording is conducted. The notch filter is applied at the last step to be beneficial for the ECG detections, and this filter application provides the convenience of clinical EEG review."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}