{
  "id": 15230,
  "origin_website": "Jove",
  "title": "Quantitative Analysis of Alternative Pre-mRNA Splicing in Mouse Brain Sections Using RNA In Situ Hybridization Assay",
  "procedures": [
    "All of the experiments described here that involve mice have been approved by the Case Western Reserve University Institutional Animal Care and Use Committee. The title of the protocol 2016-0068 (PI: Hua Lou) is “Role of alternative pre-mRNA splicing in vertebrate development”.\nNOTE: Information of all of the equipment, reagents and supplies used in this protocol is included in Table of Materials.\n1. Prepare Formalin Fixed Paraffin Embedded (FFPE) Sections\nEuthanize 1 CD1 mouse and 1 C57BL/6J mouse by cervical dislocation. Carefully cut open the skull with surgical scissors and forceps. Remove the brain with a scoop.\n\tNOTE: 5-month-old CD1 male mice and 3-month-old C57BL/6J male mice were used and showed similar results.\n\t\nWash the brain with PBS. Fix the whole brain with a solution containing 10% formalin at room temperature (RT) for 30 h by putting the whole brain in 50 mL of the formalin solution.\nChange the fixing solution to PBS and incubate the brain in PBS overnight at 4 °C. Dehydrate and embed the brain with xylene and paraffin using standard procedures18.\nUse a microtome to cut embedded tissue into 5 µm sections. Put the paraffin ribbon in a RT water bath first, and then in a 45 °C water bath to spread the ribbon.\nWhen the wrinkles and folds in the ribbon disappear, immediately mount sections on glass slides. Air dry slides overnight at RT. Bake slides for 1 h at 60 °C before use.\n2. Sample Pretreatment\nDeparaffinize tissue sections. Carry out these steps in a fume hood.\nFill two washing dishes (Figure 1A) with 250 mL of fresh xylene and two with 250 mL of 100% ethanol. Insert tissue slides into a washing rack (Figure 1A) and place the washing rack in washing dishes following the order and incubation time indicated in Table 1.",
    "During each incubation, lift the washing rack up and down more than 3 times in the washing dish. After each incubation, quickly move the washing rack into the next washing dish to prevent the tissue sections from drying out.\nAfter completing the incubation steps, remove the washing rack with slides from the washing dish. Place the rack in a 60 °C incubator for 5 min or until the slides are completely dry.\nDraw a 0.75’’ x 0.75’’ barrier surrounding the tissue section with a hydrophobic barrier pen. Air dry the barrier for 3 min at RT.\nPretreat slices\nPrepare reagents and equipment\n\t\t\nTurn on the hybridization oven (Figure 1B) and set temperature to 40 °C 30 min before use.\nWet the humidifying paper (Figure 1E) with distilled water completely and put it in humidity control tray (Figure 1D, left). Keep the humidity control tray in the hybridization oven.\nPrepare 700 mL of fresh 1x Target Retrieval Reagents by adding 630 mL of dH2O to 70 mL of 10x Target Retrieval Reagents.\nApply hydrogen peroxide.\n\t\t\nPut the deparaffinized slides on the bench. Add 5–8 drops of hydrogen peroxide to a section to completely cover the tissue. Incubate for 10 min at RT.\nTap the slides on a piece of absorbent paper to remove the hydrogen peroxide solution, one slide at a time. Immediately insert the slide into a washing rack and move the rack to a washing dish filled with dH2O.\nWash the slides by moving the rack up and down in distilled water for 3–5 times. Move the washing rack to a washing dish filled with fresh distilled water and wash slides one more time.\nPerform target retrieval",
    "Place a 1,000 mL glass beaker on a hot plate. Add 700 mL of fresh 1x Target Retrieval Reagents into the beaker and cover it with foil. Insert a thermometer in the beaker through the foil cover (Figure 1C). Turn on the hot plate and set on high for 10–15 min.\nWhen the temperature of retrieval reagents reaches 98 °C, switch the temperature control of the hot plate from high to low to maintain a mild boil. Do not boil more than 15 min.\nMeanwhile, carefully open the foil and put the washing rack with slices inside the retrieval regent. Cover the beaker again and incubate for 15 min.\nUse forceps to remove the rack from the beaker to a washing dish filled with 200 mL of dH2O and rinse for 15 s.\nMove the rack to a washing dish containing 100% fresh ethanol and let sit for 3 min. Remove slides and dry them in a 60 °C incubator for 10 min.\nApply Protease III\n\t\t\nPlace the slides on the stain rack (Figure 1D, right). Add 5 drops of Protease III to cover the tissue. Carefully put the rack in the humidity control tray (Figure 1D, left) and insert the tray into the 40 °C hybridization oven. Incubate for 30 min.\nRemove the slide rack and put the tray back into the oven. Tap the slides to remove the excess liquid, one slide at a time. Insert the slide in a washing rack and place the rack in a washing dish filled with dH2O. Move the rack up and down to wash the slides for 3-5 times.\n3. ISH Assay\nPrepare materials",
    "Pre-warm 50x wash buffer in a 40 °C incubator for 20 min. Mix 2.94 L of dH2O and 60 mL of 50x wash buffer to make 1x wash buffer.\nPrepare 50% Hematoxylin staining solution by adding 100 mL of Gill’s hematoxylin I to 100 mL of dH2O. Prepare 0.02% (w/v) ammonia water by adding 1.43 mL of 1 N ammonium hydroxide to 250 mL of dH2O. Mix well in a container.\nPut the probes and AMP 0–6 reagents at RT 30 min before use. Keep the humidity control tray in the 40 °C hybridization oven.\nISH procedure\n\tNOTE: To examine the expression of the Nf1 splicing isoforms and calculate the percent spliced in (PSI) value for exon 23a, three different ISH probes that target exon 23a-included isoform, exon 23a-excluded isoform or both isoforms are used (Figure 2). The probes are used on adjacently cut tissue sections. To ensure the accuracy of the calculation, it is critical that the three tissue sections are treated exactly the same in the hybridization, amplification and signal detection steps.\n\t\nProbe hybridization.\n\t\t\nRemove the slides from the washing rack and tap the excess liquid from the slides. Place the slides in the stain rack.\nUse a pencil to label the slides with the probe name. Put the three adjacently cut brain tissue slides to be hybridized with three different Nf1 probes (Figure 2) together. Carry out the subsequent steps in the same order of slides.\nAdd 4 drops of probe to cover the tissue. Do this one slide at a time to prevent the sections from drying out. Place the stain rack in the humidity control tray and insert it into the 40 °C oven for 2 h.",
    "Wash the slides twice with washing buffer. For each wash, fill the staining dish with 200 mL of 1x wash buffer and place a washing rack in it. Tap excess liquid on a paper towel one slide at a time and quickly insert it into the washing rack. Move the slide rack up and down in the dish for 3–5 times for 2 min at RT.\nFor the second wash, use fresh wash buffer.\nSignal amplification.\n\t\t\nTap the excess wash buffer from the slides and place them in the stain rack. Add 4 drops of AMP 0 to cover the tissue. Place the stain rack in the humidity control tray and insert it in the oven for 30 min at 40 °C.\nWash the slides twice with washing buffer as described above.\nRepeat this step with AMP 1–6 following the order and condition of Table 2. Wash the slides twice after each hybridization step.\nSignal Detection\n\t\t\nTap the excess wash buffer from the slides and place them in stain rack. Add 2 µL of Fast Red B to 120 µL of Fast Red A (1:60 ratio) in a microcentrifuge tube. Mix well and add to fully cover the tissue section.\n\t\t\tNOTE: The total volume of Red A/B mix is based on the number and size of tissue sections. For a 0.75’’ x 0.75’’ area, 120 µL is enough for one section. Use the mix within 5 min and avoid exposure of the mix to direct sunlight or UV light.\nClose the tray and incubate for 10 min at RT. Remove the solution to a waste container and immediately insert the slides into a washing rack and place the rack in a washing dish filled with tap water. Rinse again with fresh tap water.\nCounterstaining of the slides",
    "Remove the washing rack from tap water, and quickly tap on absorbent paper to remove extra water. Put the rack into a 50% hematoxylin staining solution and immediately move the rack up and down several times. Incubate for 2 min at RT.\nTransfer the slide rack back into the tap water dish. Wash 3–5 times by moving the rack up and down and changing fresh tap water until the slides become clear, while the brain tissues remain purple.\nMove the rack to a dish containing 0.02% ammonia water. Move the rack up and down 2–3 times until the tissues turn blue. Wash the slides 3–5 times with fresh tap water in a staining dish.\nMounting of the samples\nMove the slide rack from the staining dish to a 60 °C incubator and incubate for at least 15 min until the slides are completely dry.\nPlace 40 µL of mounting medium on the slide and carefully place a 24 mm x 50 mm coverslip over the tissue section. Air dry slides for 30 min at RT.\n4. Data Collection and Analysis\nNOTE: Use a slide scanner to scan the images at 40X magnification.\nPositive and negative controls\nFor each experiment, include positive and negative controls (Figure 3). As a good positive control, signal should be visible as punctate dots at 20-40X magnification.\nUse Mouse (Mm)-PPIB-1ZZ as a positive control. This probe targets a common housekeeping gene PPIB. For negative control, one dot to every 20 cells displaying background staining per 20X microscope field is acceptable.\nUse the DapB-1ZZ probe as a negative control. This probe targets the bacterial gene dapB. These control probes have been used in many ISH assays19.\nSignal detection and analysis of AS expression patterns of Nf1 exon 23a",
    "As the hybridization signals are indicated as punctate dots, count the dots manually. The number of dots is correlated with the level of the transcripts that is detected by a specific probe. Note that the number of dots can also be analyzed by ImageJ or SpotStudio software.\nUse three probes to hybridize to exon 23a-containing, exon 23a-lacking isoforms, or total Nf1 transcripts (Figure 2). As the three probes cannot be used simultaneously, use three adjacent brain tissue sections to hybridize to each probe.\n\t\t\nTo calculate percent spliced in (PSI) for exon 23a, count the number of cells and dots in several brain regions. For each region of interest, count more than 400 cells from several sub-regions as indicated in Figure 4.\nCollect data from the same sub-regions for each of the three probes. Calculate PSI as number of dots per cell with the exon 23a inclusion probe/(number of dots per cell with the exon 23a inclusion probe + number of dot per cell with the exon23a skipping probe) x 100%.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}