{
  "id": 5410,
  "origin_website": "Bio",
  "title": "Pathogenicity Assay of <em>Verticillium nonalfalfae</em> on Hop Plants",
  "procedures": [
    "Preparation of host plantsFor inoculation, use two-month-old, well-rooted plants that have been grown in 0.5 L plastic pots and have been vegetatively produced in a greenhouse from hop mother plants as soft wood cuttings. Plants should be directly produced by a professional grower. Grow plants in a greenhouse on mist benches. Water the plants every 2 days and fertilize once per week using foliar fertilizers that contain macro and micro elements (e.g., 0.1% solution of YaraKristalon yellow NPK 13-40-13 + ME). To maintain the appropriate health status, spray the plants once per week against pests and foliar diseases using protective plant protection products.Use the susceptible cultivar ‘Celeia’.Inoculum preparationPlace a small piece of fungal mycelium (of the size of a 2 mm ‘ball’) from stock PDA plates (which should be maintained in a fridge) in each of four 500 ml Erlenmeyer flasks filled with 250 ml of liquid GFM, supplemented with 100 mg/ml streptomycin sulphate and 100 mg/ml chloramphenicol.Incubation takes approximately 5 days at 100 rpm on a rotary shaker at room temperature and in the dark (place the shaker in a dark room) (Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170313/20170313050635_3660.jpgFigure 1. A picture of fungal culture grown after 5 days. White fungal mycelium in a sphere shape can be seen. The medium with fungal isolates that produce a lot of spores is duller.Prepare the conidia inoculum (spore size 5 to 7 μm) by filtration of mycelia and the spore through miracloth (typical pore size is 22-25 µm):Place a non-autoclaved piece of miracloth (20 x 20 cm) on top of a 2 L plastic cup, hand held, and filter each flask separately, one by one. Wash spores and suspend them in sterile distilled water. There is no need to spin down the spores after washing. If the concentration is low, all the filtration material is needed.",
    "Use a Thoma counting chamber to determine the spore concentration. Determine the spore concentration four times for one filtrated suspension and calculate an average.Adjust the spore concentration to 5 x 106 conidia/ml with sterile distilled water.The final volume of inoculum with a concentration of 5 x 106 conidia/ml for artificial infection should be 1 L. Use a maximum of 12 plants per one volume of inoculum.Artificial infectionUproot hop plants that have been grown in 0.5 L plastic pots. Use as much soil substrate as possible from the roots by hand.Rinse the roots in sterile water (just gently dip for a few seconds).Then dip the roots for 10 min in 1 L of inoculum, poured into a 2 L plastic cup. Inoculate a minimum of 10 plants per treatment.Dispose of the remaining fungal inoculum after autoclaving.Treat control plants similarly but dip their roots in sterile water for 10 min.Pot the plants in new pots of size 0.5 L.Grow the plants as a single bine in a growth chamber (RK-13300, Kambič) under a 12-h photoperiod of fluorescent light (L 58 W/77; Fluora, Osram) at a temperature of 22 °C and relative humidity of 65% during the light period and 20 °C and 70% during the dark period. During growth in the chamber, water twice a week (every Monday and Friday) and fertilize once per week using foliar fertilizer containing a higher quantity of nitrogen (e.g., 0.2% solution of YaraKristalon special NPK 18-18-18 + ME).Symptoms monitoringThe first disease symptoms occur approximately 20 days post inoculation (dpi). The first symptoms can be seen as pale yellowing of some leaves (Figure 2 – section 1). At that time no wilting is observed.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170313/20170313054243_1873.jpgFigure 2. The 0-5 scale used to evaluate foliar symptoms of Verticillium wilt of hop.",
    "0 indicates no leaf symptoms, 1 = 1 to 20% leaf area wilted, 2 = 21 to 40% leaf area wilted, 3 = 41 to 60% leaf area wilted, 4 = 61 to 80% leaf area wilted and 5 = 81 to 100% leaf area wilted.Subsequently, assess the plants visually for the appearance of foliar symptoms using a 0-5 scale (Radisek et al., 2003) (Figure 2) at 7-day intervals.There are 3 to 5 assessment time points. Photograph the plants at the last time point, when the disease symptoms are the most severe. Photographing at earlier time points does not show the biggest difference between fungal inoculated and mock inoculated plants.At the end of visual disease assessments, carry out mycological re-isolation of the pathogen to confirm the presence of the pathogen in the inoculated plants.Cut the plants at ground level and transfer them to a laminar. Spray the cut stems with 96% ethanol and place very briefly on an open flame in order to sterilise the surface. Perform re-isolation by using xylem sections that have been sterilely harvested from the stem of inoculated plants and placed on PDA + A plates. The xylem section is actually the whole inner part of the stem, which should be cut into 1-2 cm long pieces. Place three to six pieces from each plant on PDA + A plates. Fungal outgrowth can be detected after the plates have been incubated for 3-5 days in the dark at 24 °C. Examine the emerging mycelium (if any) is examined by light microscopy.Only infected plants should be considered and used for further analysis.Calculate the disease severity index (DSI) for every time point for each plant and determine the average disease severity index (Equation 1). Also present DSI results graphically (Figure 3).",
    "Equation 1: Average disease severity index = sum of assessments of infected plants for last assessment time points/number of infected plants (Jakse et al., 2013).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170313/20170313054546_4604.jpgFigure 3. Example of graphic presentation of DSI index. DSI curves of hop plants infected with wild type and two mutants of V. nonalfalfae, which had impaired virulence, are indicated by symptom evaluation of infected plants at five different time points.The area under the disease progress curve (AUDPC) is calculated as indicated by Campbell and Madden (1990) (Equation 2) and expressed as relative AUDPC - rAUDPC (Simko and Piepho, 2012) (Equation 3).Equation 2: imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170313/20170313054710_0993.jpgWhere,n = total number of observations,y = DSI index for each plant,t = number of days from inoculation.Equation 3:rAUDPC = actual AUDPC value/maximum potential AUDPC value"
  ],
  "subjectAreas": [
    "Microbiology",
    "Plant Science"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}