{
  "id": 7183,
  "origin_website": "Bio",
  "title": "A Workflow for High-pressure Freezing and Freeze Substitution of the <em>Caenorhabditis elegans</em> Embryo for Ultrastructural Analysis by Conventional and Volume Electron Microscopy",
  "procedures": [
    "High-pressure freezing (HPF) of C. elegans individual embryosStart a worm culture by placing 20-30 starved L1 larva on a new MYOB agar plate seeded with E. coli OP50 bacteria (see Recipes). Maintain worms by transferring 2-3 adults to a new MYOB plate every fourth morning (Stiernagle, 2006).72 h prior to the HPF experiment, transfer 5-6 gravid adults to each of several new MYOB plates (at least 3 separate plates to ensure enough young adults).In the morning of the HPF experiment, take out two aliquots (500 µl each) of 20% w/v BSA solution from 4 °C and spin at 94 x g (~1,000 rpm) for 5 min in a table-top centrifuge to remove bubbles. Keep at room temperature.Place 3-4 pairs of clean sharp-point tweezers (Figure 1a and 1b) next to the dissecting scope, and 1-2 pairs (Figure 1c) next to Leica  ICE  high-pressure freezer. Tweezers 1a and 1b are suitable for cellulose tube transfer while tweezer 1c is suitable for planchette transfer. It is critical to have alcohol swabs next to the tweezers (Figure 2a): unless you clean them frequently, the tweezers become sticky with 20% BSA solution, resulting in sample loss during transfer.Place one micropipette (1 µl) set at 0.8 µl and another micropipette (20 µl) set at 12 µl next to alcohol swab, tweezers, crimping tool (white arrow), and worm pick (yellow arrow) as in Figure 2a. Set up worm dissecting tool (syringe with 21G needles, Figure 2b). Place multiple cellulose tubes attached to pipette tips (Figure 2c, purple arrows and inset). Keep one micropipette (1 µl) dedicated for capillary tube handling (Figure 2c).Take out 9-10 planchettes (type A and type B separately) in 35 mm Petri dishes (Figure 2c), and mark type A cavities with a black marker to distinguish it from type B later.",
    "Note: Type A planchettes have a single 300 µm deep cavity on one face while the other face is flat; the samples will be placed later in the shallow cavity of a type B planchette (Step A14). imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3981/bioprotoc-11-xx-3981-g002.jpgFigure 2. Setup for worm dissection prior to HPF. a. Micropipettes (1 µl and 20 µl), sharp-point tweezers, alcohol swab, crimping tool (white arrow) and worm pick (yellow arrow). b. Worm dissecting tool – a pair of 21G needles on 2.5 ml syringe to be used as scissors to cut worms. c. A dedicated micropipette (1 µl) for handling cellulose capillaries attached to pipette tips (purple arrows and d). Planchettes type A and type B are placed in separate plastic Petri dishes. d. A cellulose capillary attachment (see Recipe 4) for embryo and/or worm collection.Check liquid nitrogen (LN2) transport dewars to make sure they are empty and dry. Fill one large dewar (25 L) and two medium dewars (4 L) with LN2.Turn on the Leica  ICE  high-pressure freezer (Figure 3a) and wait to hear the compressor turn on (identified by a hum and mild vibration), which should also be reflected in the monitor status screen. The loading station (Figure 3b) should be clean and dry. Fill the freezer chamber (Figure 3c) with LN2 from the 25 L dewar slowly with multiple brief pauses to avoid triggering the alarm and a false indication that the tank is full. A significant amount of LN2 evaporates in the process of chilling the tank.Note: You may need help from a second person to pour ~18 liters of LN2 safely.Assemble HPF sample storage dewar (Figures 3d-3f).",
    "Note the trisection pod in the dewar can hold up to three cartridge systems in each of three cups, equating to a maximum of nine HPF “shots” before the sample storage dewar is full. The high-pressure freezer requires ~20 min to equilibrate to LN2 temperature; once equilibrated, fill the HPF sample storage dewar (Figure 3f) with LN2 and insert into Leica  ICE  freezer chamber (Figure 3g, underneath the loading station in Figure 3a). You must wait until the freezer is ready, otherwise the container will collect and freeze condensation from the air forming ice crystals. Crystalline ice or frost must be avoided in this procedure, as with other cryogenic experiments. So, maintain dry conditions, and work at a quick pace to minimize exposure of the sample and tools to humidity.Assemble plastic adapters on the two halves of the Leica  ICE  high-pressure freezer loading station (Figures 3h-3j, and arrows in Figure 3b). Place the planchette holder with a hole in it (Figure 3i) on top of a plastic adapter placed on the bottom steel surface (Figure 3b, yellow arrow). Run a blank HPF cycle by manually closing the red lid (Figure 3b) to ensure the freezer is working properly (Figure 5).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3981/bioprotoc-11-xx-3981-g003.jpgFigure 3. Setting up the Leica EM  ICE  for HPF. a. Leica EM  ICE  high-pressure freezer. b. Loading station, enlarged from boxed area in 3a. Arrows show where planchette holders are placed for each HPF run, with a half cylinder on top (white arrow and 3h), and planchette holder with a hole in it (3i) atop the other half cylinder placed on the bottom black steel half (yellow arrow and 3j). c. LN2 filling port behind grey door (long black arrow). d-f. Assembly of HPF sample storage dewar comprising the trisection pod (3d) and segmenting insert (grey cylinders in 3e).",
    "Insets in 3e show top view after assembly; blue arrow, “bayonet” or release button and yellow arrowhead, lock/open position. The bayonet is pressed and rotated counter-clockwise or clockwise to open or lock respectively (left inset – bayonet at open position, and right inset – bayonet at close position). g. Collection holder unit inserted into receptacle before automatic withdrawal into the freezer unit, seen as a black outlined panel below the loading station in 3a. The notch with the “in >” label (3e inset, yellow ring) should face the HPF instrument holding unit. h-j. Leica cartridge system contains two identical half cylinders and a planchette holder with a hole in it.Collect 3-4 young adult worms with a worm pick and place in a drop (12 µl) of 20% BSA solution on a clean glass slide. Use two needles as shears (Figure 4a) to cut the worms open (at the middle of the body) to release the embryos (McDonald, 1999; Muller-Reichert et al., 2007; McDonald et al., 2010).Note: If whole worms are collected, use 20% BSA solution with 25 mM levamisole and incubate 2-3 min to anesthetize the worms. The worms can be taken up into capillaries individually, as below. Visually scan the embryos to find one at the desired stage of embryonic development, keeping in mind that the steps leading to HPF will take approximately 2 min. Avoid prolonged observation under the dissecting scope as the small volume of 20% BSA solution will quickly dry out due to evaporation.To collect an embryo of desired stage, place the open end of a cellulose capillary tube, attached to pipette tip (Figure 4b, cartoon) close to the embryo. Due to capillary action, the embryo will get into the capillary tube and there is no need to pipette it in (Figure 4c, cartoon).",
    "Use a crimping tool to press gently on the capillary tube (otherwise it will cut open and embryo will float away) on both sides of the trapped embryo to seal the capillary tube (refer to Figure 4c, cartoon). Use the same tool to separate the section (Figure 4c, inset) with trapped embryo away from dissected worms. Remember to keep the length of this section around or below 2 mm (Figure 4c, inset) so that it will fit in the cavity of the type B planchette (Muller-Reichert et al., 2008). Follow embryonic development of the trapped embryo under a dissecting scope.Approximately 1 min prior to the desired embryonic developmental stage, add 0.8 µl of 20% BSA solution into the 100 µm cavity of the type B planchette (Figure 4d). The planchette must be filled to the top to avoid air bubbles, but not overfilled to avoid excessive liquid wicking into the loading area. A gentle positive meniscus typically suffices. Transfer the capillary tube section with the embryo (Figure 4c, inset) with sharp-point tweezers into the type B planchette filled with 20% BSA solution (for ease of visualization, capillary tube sections with intact worms are shown in Figure 4d). Place a type A planchette (flat side) on top of the type B planchette (Figure 4g).Transfer the planchette sandwitch with the embryo secured inside (Figures 4e-g) to the Leica EM  ICE  loading station (Figure 3d, pre-assembled cartridege system; also see Figures 4h-i). Manually closing the red flap (Figure 4j) will initiate the freezing process, where the embryo secured inside the cartridge system is cooled to LN2 temperatures within tens of milliseconds and under high pressures of approximately 2,000 bar (refer to Figure 5).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3981/bioprotoc-11-xx-3981-g004.jpgFigure 4. Sample preparation for HPF. a-c. Dissection of young adult worms in a drop of 20% BSA solution.",
    "Steps are depicted in a cartoon above each image. An embryo of choice is collected into a cellulose capillary and trapped with the crimping tool (c, inset). d. Planchette with whole worms inside cellulose capillaries in 20% BSA solution filled to the top. e-g. A sharp-point tweezer which is used to transfer the capillary piece (c, inset) to the type B planchette cavity, is used to place the type A planchette (flat side) on top of type B planchette. h-j. The planchette sandwich (g, right) is placed securely in the holder (h, orange arrow). Manually closing the red lid (j) on the loading station will plunge the sample into LN2 under high pressure.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3981/bioprotoc-11-xx-3981-g005.jpgFigure 5. Temperature and pressure plot of a high-pressure freezing cycle. The x axis is time in milliseconds (ms), and the y axis is either pressure in bar, red, or temperature in Kelvin (K), blue. For only illustration purpose, here is a screenshot of an acceptable execution of a single run from the high-pressure freezer, with pressure reading of 2237 bar at time sample cooling started at a rate (dT/dt) of 18163 K/s. Using the zoom out button (right bottom corner) pressure, the temperature status can be obtained for up to 600 ms (see inset). For details refer to Muller-Reichert et al. (2007 and 2008).Repeat the Steps A10 to A15 until you have frozen the necessary number of samples. The maximum capacity of a single sample storage dewar in the Leica  ICE  high-pressure freezer is nine samples, however a blank HPF run is typically executed at the start of the experiment, leaving space for up to eight samples. Note that it is possible to switch the sample collection to a new and dry holder (Figure 3d) to collect another set of up to nine samples.",
    "Other high-pressure freezers do not have a limit of nine samples.High-pressure frozen samples can be stored under LN2 for years. For long-term storage of samples go to protocol B. For freeze substitution, go to protocol C directly, skipping protocol B.Recovery of frozen samples from HPF machineTo store frozen samples, prepare a 50 ml polypropylene tube by perforating its side wall with a hot end of a sharp mini screwdriver (place the tip on a Bunsen burner briefly to heat). The hole prevents pressure build up and a potential explosion hazard in case of accidental warming. Attach a long (~3 feet) string securely in the cap (Figure 6) and a tape label so the tube holding frozen samples can be pulled out of a large LN2 tank.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3981/bioprotoc-11-xx-3981-g006.jpgFigure 6. Preparation of storage tube. A 50 ml blue cap tube is prepared as described in Section B Step 1. Inset: An example of label on the tube and tape label to the string.Prepare multiple 1 ml cryovials by perforating its side wall (similar to Step B1). The hole prevents pressure buildup in the tube. Label each cryovial with date, experiment number and sample number using a pencil. Pencil marks are stable in acetone and help prevent mix-up later.Use a hairdryer to remove moisture completely from the sample unloading chamber and accessory units (Figure 7a). Fill the chamber slowly with LN2, and wait until there are no bubbles, that is, the LN2 surface is calm. Keep the plexiglass cover closed to minimize ice or frost contamination.Place all tweezers and other accessories on a slide warmer set at 45 °C next to the chamber and keep the hairdryer plugged in as you will need it again.",
    "Be quick and alternate the tweezers kept on a slide warmer to prevent depositing ice crystals into sample unloading chamber.Note: Wearing a surgical facemask reduces condensation and fog in chamber filled with LN2. Take the sample storage dewar out from Leica  ICE  high-pressure freezer. Transfer the segmenting insert and attached trisection pod (Figure 7c) to the designated slot (Figure 7a, left side) in the cryobox and release the trisection pod containing the planchette assemblies (Figures 7c-7d) by pressing and twisting the “bayonet” or release button from the locked to open position on the segmenting insert (Figure 7c, blue arrow).Dip a dry insulated tweezer (Figure 1d) in LN2 away from the samples for about 20 s to chill it to LN2 temperature. Watch for the bubbles and wait until the hissing sound ceases.Remove plastic adapters one at a time out of the sample holder (Figure 7e) leaving only the holder with frozen planchettes. Quickly transfer the holder with frozen planchettes (keeping submerged in LN2 all the time) to the sample release station (Figures 7e-7f, right side).With the release handle (Figure 7a, white arrow), punch out the frozen planchettes from the holder into the reservoir (Figure 7g, yellow arrow). Keep the plexiglass cover closed to minimize ice contamination when not transferring/releasing samples.Place prelabeled cryovials into the cryobox and allow to chill to LN2 temperature for a few minutes. Use dry tweezers (Figure 1d) to transfer frozen planchettes into respective cryovials (keeping submerged in LN2 all the time). Warm up each cryovial cap with your palm, and then quickly close. If the cap is not warm and moisture free, then it will freeze to the tube and it is nearly impossible to reopen the tube without warming up the whole tube, causing damage to the frozen sample.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3981/bioprotoc-11-xx-3981-g007.jpgFigure 7. Sample recovery after high-pressure freezing.",
    "All photographs were taken without LN2 for clarity. a. Sample recovery cryobox showing a tray for sample holder (left) and sample release station with release handle (white arrow) and collection reservoir on the right. b-d. Sample holder from  ICE  high-pressure freezer transferred to sample recovery cryobox. Twisting the bayonet (c, blue arrow) counter clockwise releases the sample collection container unit from the cylinders. e-g. One sample holder at a time is transferred to the release station. Frozen planchettes are collected into the reservoir (g, orange arrow).Final Check: Inspect for any split planchettes, and if found, collect the ones without the black dot. The type-A planchette (flat bottom) used as a cover is marked with a black dot, and can be easily identified under LN2 and discarded, as the frozen embryo is inside the cavity of an unmarked, type B planchette.Collect all cryovials into a prelabeled 50 ml polypropylene tube (prechilled in LN2 in a portable dewar), close it with a cap with the string with tape label visible outside (see Figure 6), and deposit into a LN2 storage tank. Samples can be stored for years with appropriate care.Freeze substitution of HPF embryos for electron microscopyNote: This process takes 3-4 days in total and likely more than 8 h on the first day due to long incubation times. Confirm that you have enough dry ice and LN2 supply. Reagents must be freshly prepared, so plan your day accordingly. Use a slide warmer and hairdryer to keep all instruments moisture free! Prepare the QFS cocktail as per recipe 7 (Rahman et al., 2020), and aliquot 1 ml each in prelabeled cryovials (label as per sample number, one frozen sample per vial).Place a metal block with 12 mm holes facing up in dry ice bucket.",
    "Fill with LN2 and allow to chill to LN2 temperature. Add LN2 frequently to keep the block submerged. Place a lid on the bucket to prevent condensation. The bucket must be placed in a chemical fume hood, and subsequent steps performed in a fume hood as osmium is toxic and volatile.Freeze the QFS cocktail by placing the tubes into the metal block submerged in LN2. Do not add too much LN2, otherwise the tubes will float out of the block.Collect the sample cryovials (HPF embryos or worms) from the LN2 storage tank into a transfer dewar filled with LN2 (Figure 8a, blue arrow).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3981/bioprotoc-11-xx-3981-g008.jpgFigure 8. Sample transfer for QFS. a. Frozen samples are transferred in LN2 dewar (bottom, blue arrow). QFS cocktail submerged in LN2 in a dry ice bucket (top left, yellow arrow). b. A shallow Styrofoam container with frozen QFS cocktail cryovial (top left) and HPF sample cryovial (top right) laid flat submerged in LN2. One tube at a time, cryovials are opened (top right), frozen planchettes are spilled into LN2 on a shallow Styrofoam container, and then transferred into frozen QFS cocktail in cryovials laid flat on the same surface (top left) as in Steps C5 to C7 with tweezers. c. QFS tubes are placed on dry ice sideways (in a prechilled metal block). d. The bucket is filled with more dry ice, covered with a lid, and then placed on an orbital shaker (McDonald and Webb, 2011).Take a clean and dry shallow Styrofoam container or tray. A lid of a shipping container, typically 15 × 20 cm and 2 cm deep, will suffice. Add LN2 to the tray and allow it to cool just prior to the subsequent steps.Take out one cryovial at a time.",
    "Uncap the cryovial, and quickly lay down the vial flat on a shallow Styrofoam container filled with LN2 and spill out the planchette under LN2. Next to it also uncap and lay down a frozen QFS-containing vial flat in the LN2. Keep the cap of this vial warm in your palm or on a slide warmer to avoid condensation otherwise it will freeze and get stuck.Transfer one planchette into each vial with frozen QFS cocktail with a sharp-point tweezer. Quickly stand up the cryovial (keeping most of the vial submerged in LN2) and screw the warm cap onto the tube. Immediately transfer it to the metal block submerged in LN2 (Step C2). It is possible to place multiple planchettes in a single QFS cocktail tube if samples are easily identifiable, however we warn that the planchettes can jostle against each other and dislodge large samples during QFS.Frequently check and add LN2 to keep the metal block submerged the whole time. Place the lid on top to restrict condensation (as much as possible) from the moisture in the air.Repeat Steps C4 to C7 until all sample-containing planchettes are transferred to individually labeled QFS-containing cryovials. We advise not to attempt more than eight tubes at a time.Carefully decant LN2 and fill the ice bucket halfway with dry ice. Rotate the metal block so cryovials are now lying flat on their side. Add more dry ice to cover the metal block completely and cover the bucket with a lid. Place it on an orbital shaker set at 60 cycles/min for 3 h inside a chemical safety hood (McDonald and Webb, 2011).Discard dry ice after 3 h. Place the lid back and continue to rotate at 60 cycles/min for another hour.",
    "Remove the lid and continue to shake at 60 cycles/min for another hour (or as needed) until the metal block reaches a temperature of about 4 °C. Frequently check the temperature of the block with an infrared thermometer. This is a critical step! Long exposure at 4 °C or higher may significantly darken the entire volume, making it hard to identify a single embryo inside the capillary.Replace the QFS cocktail with 100% acetone (stored at 4 °C). First, carefully remove the QFS cocktail with a glass pipette (take care to leave the planchette undisturbed). Use a fresh pipette, and gently refill by releasing the solution (100% acetone) against the side wall of the cryovial. Replace the solution with the following mixture after 1 h incubation in each (use an orbital shaker set at 60 cycles/min).1:2 resin:acetone1:1 resin:acetone2:1 resin:acetoneDiscard all pipettes, used and unused reagents, paper towels and kimwipes used in the process in accordance with institutional biohazard disposal procedure.Transfer the planchettes into 100% resin and leave overnight (14 h to 16 h) at room temperature on an orbital shaker set at 60 cycles/min.Next morning, replace overnight resin with freshly prepared 100% resin and immediately proceed to the next step.Use a razor blade to cut off the bottom of a Beem capsule; uncap the capsule and flex the hinge so that the lid lies flat on a surface. Place the planchette sample side up along with a few drops of resin on the inside of the Beem capsule lid. Carefully close the capsule onto the lid, keeping the planchette sample side up. The bottom of the capsule with the cut-out hole should be facing up.",
    "Fill the capsule through this opening with 100% resin (see Figures 9a-9i), and bake it to cure in an oven at 75 °C for 60 h to 65 h.Once cured, use a razor to cut off the plastic beam capsule (see Figures 9j-9m). Now carefully remove all the resin around the metal planchette under a dissecting scope. Important: be sure to completely remove all resin on the sides – the shiny metal of the planchette side should be totally exposed (see Figures 9o-9p). Now quickly immerse the exposed metal base of the planchette into LN2 until it reaches cryogenic temperature, then heat with a hairdryer until all condensation has disappeared and the planchette is warm. Repeat the cold/hot cycle multiple times as required, until the planchette or the metal carrier pops out and falls away due to differential thermal expansion between the metal and resin. This will leave the resin-embedded sample intact (Figure 9r). Do not use force to pry the planchette loose, as this risks fracturing the resin leaving the resin-embedded sample still in the cavity. You can strore resin-embedded samples either with or without planchette attached for years in a dustproof storage container at room temperature before sectioning for imaging (TEM or vEM).Note: The QFS protocol described here is adequate for FIB-SEM imaging and array tomography in our hands. For conventional TEM imaging, the samples may be sectioned and are typically post-stained to enhance contrast (Hayat, 2000). For other volume EM approaches such as serial block face SEM, users may wish to further enhance metallization of the sample for high-resolution work by adapting room temperature en-bloc staining protocols (Hayat and Giaquinta, 1970; Hua et al., 2015). imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3981/bioprotoc-11-xx-3981-g009.jpgFigure 9. Resin embedding and sample processing. a-c. A razor blade is used to cut off the bottom of a Beem capsule.",
    "d-e. Flex the hinge so that the lid lies flat on surface. Place the planchette (from QFS Step C15) sample side up and add a few drops of resin with a Pasteur pipette. f-g. Carefully close the capsule on the lid keeping sample side of the planchette up. h-i. Fill the Beem capsule with 100% resin and transfer to an oven (see Step C16) to cure. After curing, the stained sample is at the bottom of the capsule (9j, back view). k-m. Use a razor blade to remove the Beem capsule. n-p. Under a dissecting scope carefully remove the resin using a razor blade to expose the planchette. q. Once the planchette is exposed multiple times, immerse it in LN2 followed by heating with a hairdryer until the metal carrier pops out. r. Exposed sample embedded in 100% resin after removal of planchette or metal carrier."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Developmental Biology",
    "Biophysics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}