{
  "id": 15124,
  "origin_website": "Jove",
  "title": "Genetic Mapping of Thermotolerance Differences Between Species of Saccharomyces Yeast via Genome-Wide Reciprocal Hemizygosity Analysis",
  "procedures": [
    "1. Preparation of the piggyBac-containing plasmid for transformation\nStreak out to single colonies the E. coli strain harboring plasmid pJR487 onto an LB + carbenicillin agar plate. Incubate for 1 night at 37 °C or until single colonies appear.\n\tNOTE: A description of how plasmid pJR487 was cloned can be found in our previous work3.\nInoculate 1 L of LB + carbenicillin at 100 μg/mL with a single colony of E. coli containing pJR487 in a 2 L glass flask. Grow overnight at 37 °C with shaking at 200 rpm until saturated (OD600 ≥ 1.0).\nPurify plasmid DNA from the culture using a large-scale plasmid prep kit as instructed in the manufacturer’s published protocol (see Table of Materials for details). Elute the DNA after a 10 minute incubation with 5 mL of elution buffer warmed to 37 °C.\nMeasure the quantity and quality of plasmid DNA with a spectrophotometer (see Table of Materials for details).\nRepeat steps 1.2 – 1.4 until a total of at least 11 mg plasmid DNA at an A260:A280 ratio of at least 1.8 are isolated. This may take a few preps, depending on efficiency.\nMix all plasmid preps together into a single tube and bring the total volume up to 20 mL with elution buffer or water. Measure the final quantity and quality again with a spectrophotometer. The concentration of plasmid should be at least 538 ng/μL in this final 20 mL volume. If the concentration is higher than 538 ng/μL, dilute the plasmid with elution buffer or water to 538 ng/μL. Plasmid can be stored at 4 °C up to a few weeks until use.\n2. Creating a pool of untargeted genome-wide reciprocal hemizygotes\nPreparation of hybrid yeast cells for transformation",
    "Streak out JR507 from a -80 °C freezer stock strain to single colonies on a YPD agar plate. Incubate at 26 °C for 2 days or until colonies appear.\n\t\tNOTE: JR507 is a hybrid strain made through single-cell mating of haploid spores of S. cerevisiae DBVPG1373 and S. paradoxus Z1 (using a tetrad-dissection microscope)3.\nInoculate 100 mL of liquid YPD in a 250 mL glass flask with a single colony of JR507 and shake at 28 °C, 200 rpm for 24 hours, or until stationary phase is reached.\nThe next day, measure the optical density at 600 nm (OD600) of the overnight culture. Create a new culture by back-diluting some of the overnight culture with fresh liquid YPD into a new 1 L glass flask to an OD600 of 0.2 and a volume of 500 mL.\n\t\tNOTE: Example calculation of a back-dilution if the overnight culture has an OD600 of 5.0, where C is optical density and V is volume:\nimgsrc://cloudfront.jove.com/files/ftp_upload/59972/59972equ01.jpg\n\t\tThus, 20 mL of saturated overnight culture would be added to 480 mL of liquid YPD to make a total of 500 mL of culture at an OD600 of 0.2.\nRepeat step 2.1.3 three more times to make a total of four 500 mL cultures at an OD600 of 0.2 in four 1 L glass flasks, using the same overnight culture for all four new cultures. Incubate them all at 28 °C for 6 hours (2-3 generations) shaking at 200 rpm.\nCombine two of the 500 mL cultures to create a 1 L culture. Combine the remaining two 500 mL cultures to create another 1 L culture. At this point, there are two 1 L cultures. Each of these 1 L cultures will be subject to transformation with pJR487 in the following steps.",
    "Transformation of pJR487 into hybrid yeast cells\n\t\nSplit each of the 1 L cultures into twenty 50 mL aliquots in 20 plastic conical tubes for a total of 40 tubes. Set aside 20 tubes and perform the following steps on 20 tubes at a time.\nCentrifuge each of the twenty tubes for 3 min at 1,000 x g to pellet the yeast cells. Discard the supernatant.\nResuspend each pellet with 25 mL of sterile H2O by vortexing. Centrifuge for 3 min at 1,000 x g. Discard the supernatant.\nResuspend each pellet with 5 mL of 1x TE, 0.1 M LiOAc buffer by vortexing. Centrifuge for 3 min at 1,000 x g. Discard the supernatant.\nRepeat step 2.2.4. While the cells are centrifuging, prepare at least 120 mL of a solution of 39.52% polyethylene glycol, 0.12 M LiOAc and 1.2x Tris-EDTA buffer (12 mM Tris-HCl and 1.2 mM EDTA). Store on ice.\nTo prepare the plasmid DNA for transformation, first boil 4 mL of salmon sperm DNA at 100 °C for 5 min and immediately cool it on ice for 5 min. Then, mix 20 mL of pJR487 (obtained in section 1) at a concentration of 538 ng/μL with the 4 mL of cooled salmon sperm DNA for a total volume of 24 mL. Keep on ice until use.\nAdd 600 μL of plasmid DNA mixed with salmon sperm DNA on top of each cell pellet. Do not resuspend yet.\nAdd 3 mL of PEG-LiOAc-TE solution made in step 2.2.5 to each pellet. Resuspend the pellet by pipetting up and down and vortexing.\nIncubate each tube for 10 min at room temperature.\nHeat shock each tube for 26 min in a water bath set to 39 °C.",
    "NOTE: Every few minutes, invert each tube to prevent the cells from settling on the bottom of the tube.\nCentrifuge each tube for 3 min at 1,000 x g. Discard the supernatant and resuspend each pellet in 10 mL of YPD by vortexing. Combine all twenty tubes into a new glass flask. The total volume of cells should be ~200 mL.\nTransfer 66.6 mL of cells to a new 1 L glass flask and bring up to a volume of 500 mL with liquid YPD. Repeat two more times to use the entire 200 mL of transformed cells. Measure the OD600 of each new 500 mL culture (expect an OD600 of ~0.35-4).\nShake all three flasks at 28 °C for 2 hours to recover (<1 generation) at 200 rpm.\nAdd 0.5 mL of 300 mg/mL G418 to each of the three flasks, to a final concentration of 300 μg/mL G418 and put back to shake at 28 °C, 200 rpm.\n\t\tNOTE: Prior to this step, the transformed hybrid cells have been recovering from transformation. Upon the addition of G418, presence of the plasmid pJR487 is selected for. Any cells that did not take up the plasmid during transformation will begin to die.\nRepeat steps 2.2.2 – 2.2.14 with the remaining 20 conical tubes of cells. At this point there should be six 1 L glass flasks, each with 500 mL of cells with G418 added.\nIncubate all six flasks of cells at 28 °C, shaking at 200 rpm, for approximately 2 days or until an OD600 of ~2.3 is reached in each flask. Combine all six flasks together to create a single culture.",
    "NOTE: Although all of the cells in this culture will not be used in downstream steps, the goal of using such large volumes has been to create as many unique transformation events as possible and normalize any biases across a single transformation by pooling them all together.\nUse the culture created in 2.2.16 to inoculate two new 1 L flasks with 500 mL of YPD + G418 (300 μg/mL) to an OD600 of 0.2. There will be leftover culture that can be discarded.\nIncubate both 1 L flasks at 28 °C overnight, with shaking at 200 rpm, until each reaches an OD600 of ~2.2 (~3.5 generations). Combine both cultures into a single culture and measure the OD600 of the combined culture again.",
    "NOTE: At this point, the culture should be almost entirely comprised of cells harboring plasmid pJR487. In part of the population of cells, the PiggyBac transposon will have been transposed from the plasmid into the genome by the transposase expressed off the plasmid. However, continued expression of the transposase can lead to transposition during the course of a selection, which would obscure the relationship between genotype and phenotype. The goal of the next several steps is to perform a counterselection against the presence of the plasmid, to ensure there is no more expression of the transposase. The resulting pool is a mix of cells with or without the transposon integrated into the genome, but only cells containing the transposon are detected during the subsequent mapping steps. The time in the transformation during which transposase is expressed, before the plasmid encoding is lost, may govern the chance that a given clone after mutagenesis harbors more than one transposon insertion. The frequency of these, which manifest as “secondary” mutations in analysis of any one gene at a time, can be estimated by arraying a defined number of colonies after mutagenesis, then combining their DNA and sequence-confirming the number of independent insertion positions in the pool.\nCentrifuge 25 mL of this culture for 3 min at 1,000 x g. Calculate the number of total OD600 units of cells that are in the 25 mL (see example calculation below). Discard the supernatant and resuspend in enough H2O to create a cell suspension of 1.85 OD600/mL by vortexing.\n\t\tNOTE: Example calculation for resuspension of cells in water if OD600 of combined culture was 2.2:\nimgsrc://cloudfront.jove.com/files/ftp_upload/59972/59972equ02.jpg",
    "So, after spinning 25 mL of cell culture and discarding the supernatant, add enough H2O to the cells to bring the total volume of cells and water up to ~29.7 mL (since the cell pellet will also have a volume, add less than 29.7 mL of H2O).\nUsing glass beads, plate 1 mL of resuspended cells in water onto each of 12 large square complete synthetic agar plates with 5-FOA. Incubate each plate at 28 °C for 1-2 days or until a lawn forms on the plate.\nUsing small sterile squeegees, scrape the cells off of each of 6 plates and into a tube with 35 mL of sterile water. Repeat with the other 6 plates for a total of two tubes of cells and water. Combine all cell suspensions in a single tube. Measure the OD600 of this suspension, using water as a blank. Bring the OD600/mL concentration of cells to 44.4 OD600 units/mL with water. In our experience, transposition efficiency (the proportion of KAN+ cells that are URA-) is on average 50%.\nDetermine the number of -80 °C freezer stocks of cells to store. Each aliquot can be used in the future for a single experiment.\n\t\tNOTE: Given how time consuming the generation of the pool is, store multiple vials in case of accidental misuse or for performing replicate experiments. 20-30 stocks are a reasonable number.\nEach freezer stock will contain 40 OD600 units of cells in 1 mL of 10% DMSO. Add 900 μL of cells to 100 μL of DMSO. Repeat for the total number of freezer stocks created. Store each at -80 °C for future use.\n3. Selection of reciprocal hemizygotes in a pooled format\nThaw from the -80 °C freezer a single aliquot of pooled reciprocal hemizygotes from section 2 at room temperature.",
    "NOTE: Do not let the aliquot sit for long at room temperature once it thaws, use it immediately.\nUse the entire 1 mL aliquot to inoculate 150 mL of liquid YPD in a 250 mL glass flask. Measure the OD600 of this culture, and then incubate at 28 °C, shaking at 200 rpm, for ~7 hours, or until the culture has gone through 2-3 population doublings. At this point, the culture is ready to be used to inoculate cultures undergoing selection.\n\tNOTE: Example calculation: If the OD600 of the original flask measures 0.25, incubate the culture until it reaches an OD600 of at least 1.0. If any sample points are desired at “Time-zero” (T-0), as a way to investigate the hemizygote population before selection, cell pellets can be taken now by centrifuging 5-10 mL of culture per pellet at 1,000 x g for 3 min, discarding the supernatant and freezing at -80 °C.\nUse the grown hemizygote pool to inoculate cultures for selection in a suitable replicate scheme, at both high temperature (39 °C) and permissive temperature (28 °C). At a minimum, set up three biological replicate selection cultures at each temperature, for a total of six selection cultures.\n\t\nCreate each selection culture with 500 mL total in a 2 L glass flask with liquid YPD and inoculate to an OD600 of 0.02. Shake each selection culture at 100 rpm at either 28 °C or 39 °C until 6-7 population doublings have occurred (corresponding to an OD600 of ~1.28-2.56). Try to match as closely as possible the final OD600 of all selection cultures.",
    "NOTE: Selection cultures at 28 °C will grow faster than selection cultures at 39 °C. Consequently, selection cultures at 39 °C will spend a longer period of time in the incubator. Proceed with the following steps with each flask as it becomes ready, regardless of the total number of hours spent in the incubator. In our experience, cultures at 28 °C or 39 °C took ~12 or ~18 hours, respectively, to reach an OD of ~2.0. Long selections could have the advantage of amplifying small fitness effects, but also permit de novo background mutations to arise, which would introduce noise into the final distribution of fitnesses across transposon mutants in any one gene/allele. As such it is important to limit selection time in an RH-seq experiment.\nHarvest cell pellets from each selection culture. Calculate the volume required to obtain 7 OD600 units of cells and centrifuge at 1,000 x g for 3 min at least four pellets of this volume from each selection culture as technical replicates for library preparation and sequencing (see sections 4 and 5, below). Discard the supernatant and store at -80 °C.\n\tNOTE: Example if a selection flask has a final OD600 of 2.0:\nimgsrc://cloudfront.jove.com/files/ftp_upload/59972/59972equ03.jpg\n4. Tn-seq library construction and Illumina sequencing to determine abundance of transposon mutant hemizygotes\nThaw on ice each cell pellet from section 3 that is going to be sequenced.\nIsolate total genomic DNA (gDNA) from each cell pellet using a yeast gDNA purification kit following the manufacturer’s instructions. Resuspend the DNA in 50 μL of elution buffer warmed to 65 °C.\nQuantify the quantity of gDNA from each pellet using a fluorimeter. The minimum total quantity of gDNA required for each cell pellet to create a next-generation sequencing (NGS) library for Tn-seq using the following procedure is 1 μg.",
    "NOTE: Less than 1 μg of gDNA can be used to create a library, but the final quantity and quality of the library will suffer.\nFollow an established protocol for creating Tn-seq libraries7. Note the following relevant information that is unique to this protocol:\n\t\nAfter gDNA shearing, end repair and adapter ligation, amplify the gDNA containing the transposon via PCR. For that PCR, use the following forward and reverse primer, which are specific for the PiggyBac transposon and NGS adapters, respectively:\nForward (N – random nucleotide)\n\t\t5’ ATGATACGGCGACCACCGAGATCTACACTCTTTCCCTACACGACG\n\t\tCTCTTCCGATCTNNNNNNAGCAATATTTCAAGAATGCATGCGTCAAT 3’\nReverse (the stretch of Ns represents a unique 6-bp index used for multiplexing. See below for further information on indices)\n\t\t5’ CAAGCAGAAGACGGCATACGAGATNNNNNNGTGACTGGAGTTCAG\n\t\tACGTGTGCTCTTCCGATCT 3’\nUse the included cleanup steps with size-selective beads to minimize the proportion of cloned fragments in the final library that would be too short to include mappable genomic sequence.\n\t\tNOTE: Having followed the minimum replicate requirements up until now for selection cultures, there will be 24 individual gDNA samples for sequencing. Given the current cost for sequencing, it is unlikely that each sample will be run on its own. To combine samples on the same lane, create multiple reverse primers, each with a unique 6-base pair index. Samples with differing indexes can be combined into the same sequencing lane and separated computationally afterwards.\nSequence single-end 150 bp reads from each library using NGS technologies across eight lanes.",
    "NOTE: The amount of sequencing reads required depends heavily on the quality of the libraries prepared in the previous step (i.e. the proportion of DNA in the library actually containing transposon DNA, representing DNA coming from reciprocal hemizygotes). There are two main factors contributing to this. First, since cells without an integrated transposon are not counterselected against during pool creation, each culture will be a mix of cells with and without the transposon. Secondly, even within the genomes of transposon-containing reciprocal hemizygotes, most of the genome is not transposon containing sequence, and this gDNA will unavoidably be part of the library preparation. The goal of the final PCR amplification of transposon-containing DNA is to increase the ratio of transposon-containing DNA to these two sources of background gDNA. The more efficient this amplification is, the higher proportion of reads will be able to be used in downstream analysis. The lower quality the libraries are, the more sequencing will need to be done, since an increasing proportion of reads will not contain transposon DNA and will not be useful. Given the above constraints, eight lanes of sequencing were capable of tracking reciprocal hemizygote abundances to a reasonable degree. More sequencing would allow a deeper analysis.\n5. Mapping the locations of transposon insertions and RH-seq analysis\nNOTE: The following data analysis was accomplished with custom Python scripts (found online at https://github.com/weiss19/rh-seq), but could be redone using other scripting languages. Below, the major steps in the process are outlined. Perform the following steps on each individual replicate read file unless it is noted to combine them.\nTrim adapter sequences off of reads and separate out each replicate’s reads according to index.",
    "Find reads containing transposon-genome junctions. To accomplish this, search within each read for the last 20 base pairs of the transposon, CAGACTATCTTTCTAGGGTTAA. Discard all reads not containing this sequence.\n\tNOTE: In our experience, the proportion of reads mapping to the end of the transposon is 83-95%.\nTrim the remaining, transposon-containing reads to contain only the sequence downstream of the 3’ end of the transposon. By mapping this sequence to the yeast genome, determine the genomic context of the transposon insertion for each read (step 5.4 below).\nUse BLAT or an equivalent mapping tool to map the sequence downstream of the transposon to the S. cerevisiae DBVPG1373 x S. paradoxus Z1 hybrid genome (Script name: map_and_pool_BLAT.py).\n\t\nDiscard any reads for which there are fewer than 50 base pairs of usable sequence downstream of 3’ end of the transposon. Short sequences are difficult to map uniquely.\nIf using BLAT, use the following parameters: identity = 95, tile size = 12.\nCreate a basic hybrid genome to use for mapping by concatenating the latest versions of reference genomes of S. cerevisiae S288c and S. paradoxus CBS432.\n\t\tNOTE: A basic annotation file describing the genomic boundaries of individual genes across the hybrid genome can be found at the Github repository listed above (Filename: YS2+CBS432+plasmid_clean). Only use reads which map to a single location in the hybrid genome (i.e. are unique to either S. cerevisiae or S. paradoxus). A uniform frequency of insertion events across the genome is expected; the distribution of insertion positions across the genomes is reported elsewhere3.",
    "Tally the total number of reads mapping to each unique transposon insertion location, which we infer all originated from cells of a single transposon insertion mutant clone. The sum of all such values from a single library is referred to as the total number of mapped reads for that library.\nIn cases where there are multiple insertions mapping within 3 base pairs of one another, combine them all to a single insertion point, assigning all the reads to the single location with the highest read count. This value, ninsert, represents the abundance of that insertion clone in the cell pellet from which gDNA was sequenced. At this point, there will be lists of ninsert, each the abundance of a unique mapped transposon insertion, one list for every cell pellet sequenced.\n\tNOTE: The PiggyBac transposon inserts at TTAA sequences in the genome, a 4 base pair sequence. Thus, we infer that insertions mapping within 3 base pairs of each other must have originated from the same TTAA site.\nSince there will be a slightly different number of total reads coming from each sequenced library, normalize the ninsert values across all files if they are to be compared. Do so by tabulating the total number of mapped reads from each individual library, npellet, and take the average of all npellet across all libraries, <npellet>. Multiply each ninsert in an individual library’s data by the ratio of <npellet> / npellet to calculate ainsert, the normalized abundance of a given transposon insertion clone.\nimgsrc://cloudfront.jove.com/files/ftp_upload/59972/59972equ04.jpg\n\tAlternatively, library size can be estimated using available tools like DESeq28 (Script name: total_reads_and_normalize.py).\nTabulate the set of all insertions mapped across all libraries. For insertions found in some libraries but not in others, set ainsert = 1 for downstream calculations.",
    "Filter the reads to find those insertions that fall within genes according to the annotation file (Script name: remove_NC_and_plasmid_inserts.py).\nFor each unique insertion, calculate the average abundance across technical replicates of each selection (each culture at either 28 °C or 39 °C), <ainsert>technical (Script name: combine_tech_reps_V2.py).\nFor each unique insertion, calculate the average abundance across biological replicates of each temperature, <ainsert>total, by taking the mean of all <ainsert>technical at each temperature. At the same time, calculate the coefficient of variation for each insertion, CVinsert,total across the <ainsert>technical (Script name: combine_bio_reps.py).\n\tNOTE: At this point, for each temperature, 28 °C and 39 °C, there is a list of unique transposon insertions, their average abundance and the coefficient of variation between biological replicates for each. These data for our experiment are reported elsewhere3.\nFilter the list of all insertions for those that have, at either 28 °C or 39 °C, <ainsert>total > 1.1, and CVinsert,total ≤ 1.5 (Script name: filter_inserts.py).\nFor each unique insertion, calculate the log2(<ainsert>total,28 °C / <ainsert>total,39 °C). This value represents the “thermotolerance” of a given transposon insertion mutant clone (Script name: fitness_ratios.py).\nSort all of the unique insertions by gene and by allele (S. cerevisiae or S. paradoxus), and tabulate the number of insertions in each allele. Filter genes so that only genes that have at least 5 insertions in each allele are analyzed (Script name: organize_and_filter_genes.py).",
    "NOTE: Multiple unique insertions across each allele allow for a more accurate measure of that reciprocal hemizygote’s thermotolerance. Lowering the number of insertions required per allele is possible but will compromise the accuracy of this measure and increase the multiple testing burden by allowing more genes to be tested. Additionally, filtering out genes with too few insertions per allele will help reduce the impact on test results of any individual hemizygote clone harboring a secondary site mutation that confers a very disparate phenotype.\nFor each gene remaining in the data set after the above filtering, compare the thermotolerances (log2 ratios) of all the insertions in the S. cerevisiae allele to those in the S. paradoxus allele using a Mann-Whitney U test. Alternatively, a regression model could be implemented, adapted from DESeq28 (Script name: mann_whitney_u.py).\nCorrect p­-values for multiple testing using the Benjamini-Hochberg method.\nGenes with significant p-values (say, ≤ 0.01) are candidates for genes important for differences in thermotolerance between the two species.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}