{
  "id": 17258,
  "origin_website": "Jove",
  "title": "Popliteal Vascular Lymph Node Resection in the Rabbit Hindlimb for Secondary Lymphedema Induction",
  "procedures": [
    "All procedures were approved by the ethical committee of the Jesús Usón Minimally Invasive Surgery Center and the welfare guidelines of the regional government, which are based on European legislation.\n1. Presurgical and surgical preparation\nHouse nine female New Zealand white rabbits weighing 4-4.5 kg and aged 4 months in separate cages maintained at a temperature of 22-25 °C, with free access to food and water. Make sure that the cages contain a polysulfone tray with a surface area of 3 m2 and a height of 40 cm, as well as a bed with wood shavings.\n\t\nIdentify the cages with the project code and animal identification number.\nAcclimate the animals for 1 week before surgery to prevent stress-induced problems. Collect preoperative laboratory values of blood samples to ensure that each animal is in good health prior to anesthesia.\nEnsure all rabbits follow a 12 h fast before each surgical procedure.\n\t\nAfter premedication, preoxygenate the rabbits using a face mask (Hall mask) for 5 min with 100% oxygen and a fresh gas flow of 3-5 L/min. Perform the co-induction phase with midazolam (0.3 mg/kg) and propofol (10 mg/kg) intravenously.\nIntubate the rabbits with 3.0-3.5 endotracheal tubes, with pneumotaponation, connected to a semi-closed circular circuit linked to a ventilator with a flow of fresh gases at 1 L/min for an initial 5 min, and subsequently set at 0.5 L/min.\n\t\nPerform maintenance anesthesia by inhalation of sevoflurane at a concentration of 3%-3.5% set on the vaporizer.\nAdminister a continuous infusion of Ringer's lactate solution (2-4 mL/kg/h) through the marginal vein of the ear to the anesthetized rabbits throughout the surgical procedure.\n\t\nUse a protective eye ointment to protect the ocular surface.",
    "General anesthesia monitoring: use a rectal thermometer to monitor the temperature at 38.7-39.7 °C, inspect the mucous membrane color, and monitor the O2saturation at >95% and the heart rate at 180-240 bpm using a rabbit pulse oximeter.\nPlace a thermal support so the animal maintains a constant temperature throughout the procedure.\nAdminister ketorolac (1.5 mg/kg) plus tramadol (3 mg/kg) intravenously for intraoperative analgesia.\nAdminister antibiotics (7.5 mg/(kg∙day) enrofloxacin subcutaneously [s.c.]) before surgery and 5 days after surgery, as well as postoperative analgesia (10 µg/(kg∙day) buprenorphine s.c.) for 5 days.\nPlace the rabbits in the supine position and shave the animal's hindlimb and inguinal areas. Place the animal in dorsal/supine recumbency and clip the hair from the hindlimb and inguinal areas.\nPerform skin antisepsis by applying 0.5% chlorhexidine and 70% ethanol to the previously shaved skin. Once the area has been disinfected, cover the rabbit with a sterile cloth, except for the left hindlimb.\n2. Popliteal vascular lymph node resection surgery (Figure 1)\nInfiltrate 0.2-0.3 mL of indocyanine green (ICG) intradermally in the second and third interdigital spaces of the left hindlimb. Massage, gently flex, and extend the hindlimb for a few minutes to facilitate the uptake of the dye into the lymphatic vessels. Use the contralateral limb as a control.\nUse a real-time, near-infrared fluorescence camera to visualize and mark (using a surgical marker) the lymphatic vessels crossing at the knee level and the popliteal lymph node (PLN) on the skin (Figure 2).\nInject patent blue V (0.2 mL) into the interdigital area for subsequent identification of the lymphatic vessels and lymph nodes.",
    "Once the PLN is identified using a real-time, near-infrared fluorescence camera (Figure 3), create a 2 cm incision in the center of the popliteal fossa, longitudinal to the long axis of the hindlimb through the ischial vein, which is visible through the skin.\n\t\nTo obtain real-time panoramic images of the lymphatic system with the real-time, near-infrared fluorescence camera, use the optical head equipped with a class 1 laser as the excitation light source and a near-infrared sensitive camera, from the ankle to the knee of the hindlimb of the animal.\nVisualize the lymphatic vessels above the muscle fascia by resecting the subcutaneous fat5. The lymphatic vessels appear blue due to the patent blue V staining in step 2.3.\nUse microsurgical forceps to stretch the incision and expose the PLN, including the vascular and afferent lymphatic pedicles. Ensure clear visibility of all the lymphatic and vascular structures (Figure 4).\nIdentify the PLN, with a diameter of 0.8 mm, under the ischial vein and between the biceps femoris and medial hamstring muscles.\nIdentify the two main lymphatic vessels on the medial aspect of the PLN. These vessels are located parallel to the distal saphenous vein and divide into a network of microvessels as they approach the PLN (Figure 5).\nDissect the lymph node pedicle while avoiding damage to the surrounding tissues and vessels (Figure 6).\nLigate the medial artery (a branch of the popliteal artery) and the lateral saphenous vein distally and proximally using 10/0 nylon non-absorbable sutures.\nIdentify and cauterize the two groups of afferent lymphatic vessels that directly join the femoral lymphatic system within the thigh, but do not enter the PLN (Figure 7).",
    "NOTE: The first group corresponds to the medial afferent lymphatic vessels that drain lymph from the upper leg and calf. The second group is composed of lymphatic vessels in the lower extremity musculature. These vessels run along the gastrocnemius muscle, together with the saphenous vein.\nConfirm complete disruption of the lymphatic system by repeating real-time near-infrared fluorescence imaging.\nRemove surrounding fatty tissue entirely to avoid possible lymphangiogenesis.\nSuture the skin incision with 4-0 polyglycolic acid (PGA) absorbable braided sutures (with a 16 mm 3/8 triangular needle) using a continuous intradermal pattern to avoid postoperative auto-mutilation.\nHouse the rabbits individually in cages after surgery; keep them under surveillance and at a room temperature between 16 and 22 °C.\n3. Postoperative evaluation\nPerform postoperative assessments at 3, 6, and 12 months after induction.\nAnesthetize the rabbits following the steps used previously (steps 1.2-1.7).\nMeasure the perimeters of the hindlimbs of the anesthetized rabbits with a tape measure. Take measurements every 2 cm, with the first point being at the ankle and the last at the knee. Calculate the total volume using the truncated cone formula.\nUse indocyanine green lymphography (ICG-L) for assessing lymphatic function.\n\t\nInfiltrate 0.2-0.3 mL of ICG intradermally into the second and third interdigital spaces and gently massage for 1 min to facilitate ICG uptake into the lymphatic vessels.\nCollect images after 15 min using the near-infrared fluorescence system to assess dermal backflow.\nOnce the follow-ups have been completed, euthanize the rabbit following the same anesthetic protocol as that used in the intervention. Once the desired anesthetic plane is achieved, administer intravenous potassium chloride into the auricular vein at an average rate of 2 meq/kg.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}