{
  "id": 11427,
  "origin_website": "Jove",
  "title": "An Automated Method to Determine the Performance of Drosophila in Response to Temperature Changes in Space and Time",
  "procedures": [
    "1. Preparation of Fly Food Medium\nPour 1 L of tap water into a 2 L glass beaker and add a magnetic stir bar. Put the beaker on a magnetic hot plate at 300 °C until boiling temperature is reached.\nStir at 500 rounds/min and add the following: 10 g of agar, 30 g of glucose, 15 g of sucrose, 15 g of cornmeal, 10 g of wheat germ, 10 g of soy flour, 30 g of molasses, and 35 g of active dry yeast.\nWhen the mix foams vigorously, turn down the hot plate temperature to 120 °C while continuing stirring.\nTurn the hot plate temperature further down to 30 °C after 10 min and continue stirring until the mix cools to 48 °C. Measure the temperature by inserting a thermometer directly into the food without touching the walls of the beaker.\nDissolve 2 g of p-hydroxy-benzoic acid methyl ester into 10 mL of 96% ethanol and add it to the mix, together with 5 mL of 1 M propionic acid. Continue stirring for 3 min.\nTurn the hot plate off and pour 45 mL of food into the rearing bottles and 6.5 mL of food into the collection vials.\n2. Preparation of Flies\nPlace 20 male and 20 female flies in the rearing bottles containing 45 mL of fly food medium. Transfer the flies to new bottles after 3 to 4 days by tapping them down and then tapping them into the fresh bottles. Discard the flies after three changes.\n\t\nPlace the bottles inside the incubator under 12-h light/12-h dark cycles with a constant temperature of 25 °C.\n\t\tNOTE: A new generation of flies will eclose after ten days.",
    "Anesthetize newly eclosed flies on carbon dioxide pads for a maximum of 4 min and collect them in 2.5 x 9.5 cm fly rearing vials with 6.5 mL of fly food medium using a paintbrush.\n\t\nCollect only virgin flies and separate them by sex into groups of 20 flies per rearing vial.\nPlace the vials inside incubators for 5-7 days, changing the flies to new vials every 2-3 days and on the days before experiments.\n3. Frame of Lights\nMake a wooden frame of 10 cm length, 4 cm width, 4 cm height, and 0.5 cm thick.\nOn each of the short edges, create a border of 4 cm length, 4 cm height, and 1.5 cm width towards the inside area of the wooden frame. Leave the internal face of the border open.\nDrill two holes of 0.5 cm diameter at the intersection of one of the long edges of the wooden frame and at each of the borders at the short edges.\nPlace 10 cm of a warm white LED strip inside each of the borders on the short edges. Peel the back of the LED strip to immediately glue it in place.\n\tNOTE: For experiments in which illumination needs to be eliminated, the warm white LED strip can be substituted for infrared LED strips.\nConnect one end of the LED strip in one of the borders to the switching power supply and its other end to the LED strip on the opposite border.\nTurn the switching power supply on to verify that both LED strips turn on.\nCover the open side of each border with a white piece of paper.\nGlue another piece of paper to each of the internal phases of the long edges.\n4. Temperature-Controlled Arena",
    "Turn on the temperature-controlled arena (Figure 1A and 1C). Ensure that the fan starts running and the aluminum ring starts warming up.\nUse a USB cable to connect the temperature-controlled arena to the control computer running the TemperaturePhases script with the temperature sequences.\nOpen the TemperaturePhases script in the control computer and verify that the temperature sequence is properly set up (Video 1).\n\t\nCheck that the duration of each experimental phase is set to 60 s by verifying that \"par.StimulusDur\" is equal to 60 s.\nCheck that the 1) number equal to desired number of phases, 2) iterative ON/OFF set-up of the indicative red light emitting diodes (LEDs), 3) 2 °C temperature increase per phase, and 4) 16 °C as the starting temperature are all correct under the \"Start the experimental block\" section.\n\t\tNOTE: Allow the flies to acclimate to the Fly Arena for 7 min at 16 °C to avoid an artificial increase of speed during the first experimental phases (Figure 2).\nRun the TemperaturePhases script. The software will initialize for 5 seconds as determined in \"arena.Wait\" and then stop. \nPress the spacebar of the keyboard to begin running the experimental phases once a fly has been blown into the Fly Arena (step 5.3).\n\t\tNOTE: The TemperaturePhases is the current script controlling the box; however, it is possible to create other custom scripts to use this device that adjust to the requirements of different experiments.\nConnect the camera on top of the arena to the recording computer using the camera's USB cable.\nOpen the video recording program (see Table of Materials) in the recording computer by selecting \"File | New Movie Recording\". A screen showing the image from the camera will open.\n\t\nEnsure that the camera image captures all edges of the arena and the indicative red LEDs.",
    "Start recording by pressing the red button in the middle of the screen's bottom edge showing the camera image once the frame of lights is set around the arena (step 5.4).\n\t\tNOTE: Small changes in lighting can affect accuracy of the tracking. It is recommended to keep the illumination of the temperature-controlled arena constant by fixing the location of the apparatus.\n5. Temperature Behavioral Experiments\nPrepare the Fly Arena (Figure 1C).\n\t\nPlace a strand of white conductive tape on the top of the copper tiles, ensuring all edges are covered.\nPlace the heated aluminum ring around the copper tiles. The edge of the ring fits perfectly around the copper tiles so it is always placed in the same location.\nClean the glass cover with a clean tissue and place it on the top of the aluminum ring, leaving a gap through which a fly can be blown in.\n\t\tNOTE: Before the experiments, coat the glass cover with the siliconizing agent to create a slippery surface. Apply the siliconizing agent for 24 h and rinse it with water before use.\nRun the TemperaturePhases script (step 4.3.3) and open the video recording program (step 4.5).\nBlow the fly from a rearing vial (step 2.2.2) into the Fly Arena (e.g., 1 male fly in Figure 3).\n\t\nTake a vial of flies from the incubator, tap it twice to force them to go to the bottom, trap one fly with a mouth aspirator, and close the vial and put it back into the incubator.\nPlace the fly in the arena through the gap that has been left between the glass cover and aluminum ring (step 5.1.3).",
    "Close the gap between the glass cover and aluminum ring by pushing the glass cover until it reaches the edge of the aluminum ring as soon as the fly is introduced to the Fly Arena.\nPlace the frame of lights around the arena to ensure symmetric illumination.\n\t\nMark the location (e.g., using a permanent marker) of the frame of lights around the Fly Arena (Figure 1C) to ensure that the frame is always placed in the same location.\nStart recording with the video recording program (step 4.5.2) and press the spacebar on the keyboard of the control computer to begin running the experimental phases (step 4.3.4).\nAfter all experimental phases are done, save the video in .mp4 or .avi format and remove the fly from the Fly Arena with the mouth aspirator.\n\tNOTE: The end of the experimental phases can be determined by both indicative red LEDs being turned off or by the TemperaturePhases script stopping.\n\t\nStop the video recording by pressing the stop button in the middle of the screen's bottom edge in the recording program. Press \"File | Save as\" to save the video.\n6. Video Tracking and Data Analysis\nUse the FlySteps tracking software (Video 2) to track the videos.\n\t\nOpen the \"configuration_file.ini\" inside the \"FlyTracker\" folder.\nSet the location of the videos in \"video_folder\" and the names of the videos in \"video_files\".\nSpecify the borders of the Fly Arena in \"arena_settings\" based on (x, y) pixel coordinates of multiple points at the edge of the arena.\nSpecify the location of the indicative red LEDs in \"led_settings\" based on (x, y) pixel coordinates of the location of the center of the LEDs.",
    "Check the location of the borders of the Fly Arena by setting \"debug\" to \"true\" in \"arena_settings\", clicking \"Save\", and running the script in the terminal.A screen capture of the video will appear with a blue square formed by the coordinates inputted in \"arena_settings\".\n\t\tNOTE: This square surrounds the area to be tracked.\nChange \"debug\" in \"arena_settings\" to \"false\", click \"Save\", and run the screen in the terminal once more.\n\t\tNOTE: This will start the tracking process.\n\t\tNOTE: Flies can walk out of the tracking area onto the heated aluminum ring. This happens during the first seconds of an experiment, after which flies stop touching the heated ring and remain inside the tracking area.\n\t\tNOTE: Videos can be tracked with other tracking software according to the experimenter's preferences.\nUse the (x,y) location of each fly provided by the tracking software to calculate the measure of interest for the temperature performance. Custom scripts (e.g., FlyStepsAnalysis in Supplementary) can be used.\nCompare the temperature performance curves of different fly groups using repeated measurements (RM) analysis of variance (ANOVA) and post-hoc multiple comparisons using statistical software (see Table of Materials).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}