{
  "id": 18864,
  "origin_website": "Jove",
  "title": "Reproducable Paraplegia by Thoracic Aortic Occlusion in a Murine Model of Spinal Cord Ischemia-reperfusion",
  "procedures": [
    "1. Preoperative Preparation and Anesthesia\nBe sure to observe sterile technique throughout the procedure. Lay out all instruments.\nTurn on the temperature control bed prior to anesthetic induction so that it may warm to the appropriate temperature (36.5 °C).  Power on the laser Doppler perfusion monitor so that it may boot during induction.\nPlace the mouse in the induction chamber.\n\t\nCarefully monitor the respiratory rate of the mouse during induction.\nAs soon as the respiratory rate has visually slowed, remove the mouse from the induction chamber.\nPerform toe pinch to assess adequacy of anesthetic.\nWith the mouse properly anesthetized, place mouse in supine position.\nInsert face into nose cone and secure all extremities to the heating table.\n\t\nPay special attention to ensure that extremities are secured in anatomic position, with no deviation to one side. If the mouse is improperly positioned, it is difficult to avoid internal thoracic artery transection during sternotomy.\nUsing clippers or commercially available hair removal cream, remove hair from the midline thorax and left lower extremity ventral surface.\n\t\nIf using hair removal cream, avoid leaving cream in place for greater than 30 sec, as alkali burns can occur.\nTitrate volatile anesthetic vaporizer concentration to maintain adequate anesthesia.\n\t\nExpected vaporizer fractions are between 1-5% using isoflurane with high flow O2.\nVolatile anesthetic vaporizer concentration should be titrated to maintain anesthesia during surgical stimulation while maintaining spontaneous respirations.\n2. Rectal Probe Laser Doppler Placement\nInsert lubricated rectal probe into the mouse’s rectum. Secure in place to operating bed.\nAdjust the heating bed for a target rectal temperature of 36.5 °C.\nMake small incision over femoral artery of mouse and dissect skin away from subcutaneous tissue.\nInsert laser Doppler probe over femoral artery.\nAdjust probe positions until the perfusion monitor registers greater than 800 perfusion units.",
    "Firmly secure probe in place. Improperly secured probes can have falsely low perfusion measurements.\n3. Dissection of Aortic Arch/Subclavian Artery\nMake a 2 cm skin incision above the sternal notch and gently dissect skin away from subcutaneous tissue.\nDissect the submandibular gland free.\n\t\nIf bleeding occurs, gentle pressure can be applied with a cotton swab.\nDivide the submandibular gland through midline in the avascular plane.\nGently lift sternum with forceps and using the scissors make 1 cm midline sternotomy through the midline of the sternum. Any deviation from midline can result in internal mammary artery hemorrhage which will be difficult to control.\nPlace 5-0 retraction sutures on each side at the edge of the sternum and retract sternum laterally securing sutures to the operating bed. Avoid placing retraction sutures too laterally to prevent pneumothoraces. \nUsing blunt dissection free strap muscles along trachea. The left strap muscle can be divided with scissors to improve exposure.\nDissect free the thymus from surrounding tissue. Continue blunt dissection until the great vessels are visualized. Use extreme caution to prevent entrance into the pleural space.\nPlace vascular clamps on aortic arch and left subclavian artery.\nVerify distal flow has appropriately disrupted. This will be seen as a >90% reduction in perfusion units.\n\t\nContinue occlusion for desired for 4-8 min.\nRemove vascular clamp and verify hemostasis before closure of chest.\n4. Closure of Sternotomy and Skin\nRemove the retraction suture on the left side of the mouse.\nClose the sternotomy with the right retraction suture.\n\t\nA single sternal suture (using the previously placed retraction stitch) is adequate for sternal closure. Placing another stitch is unnecessary and increases risks of pneumothorax and hemorrhage.\nClose skin with running 5-0 stitch.\n5. Recovery and Postoperative Assessment",
    "Transfer the mouse to recovery cage. Cage should be placed on a heating pad to increase the ambient temperature of the recovery chamber and reduce heat loss to the environment.\nClosely monitor the mouse for signs respiratory distress or seizure activity. Administer analgesia per institution guidelines. Euthanize mice immediately if seizure or respiratory distress is observed.\n\t\nCO2 chamber euthanasia is our preferred method. Cervical dislocation is another option if CO2 is not available.\nComplete recovery can be expected in 1-2 hr, depending on the length of volatile anesthetic and concentration used.\nReturn the mouse to normal cage. Place food and water place on the floor of the cage.\nAssess neurologic status at 12 hr intervals using Basso Mouse Scale for Locomotion8.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}