{
  "id": 5254,
  "origin_website": "Bio",
  "title": "Documentation of Floral Secretory Glands in Pleurothallidinae (Orchidaceae)  Using Scanning Electron Microscopy (SEM)",
  "procedures": [
    "Preparing the samples for critical point dryingCarefully harvest fresh flowers using a conventional pincet. Take care of collecting only young, undamaged flowers. It is important to collect material from plants that are in good, healthy condition (for example the same day of anthesis; Figure 2). Place the flower in a plastic tube containing ethanol (70%), covering it completely. Leave it to soak for at least one week (this is highly dependent on the size of the material, and it is likely that a shorter period of a few days will also be enough for Pleurothallidinae flowers). The condition of the cell structures observed in SEM is mostly dependent on the quality of the collected material.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20161110/20161110010714_3708.jpgFigure 2. Flowers of Specklinia remotiflora. A. Shortly after anthesis, flower in healthy condition. B. Damaged flower, a few days after anthesis, not recommended for visualization with SEM.Place flowers directly from ethanol 70% into snap cap vials (10 ml) with acetone pure grade. Cover the flower completely. Try to leave as little time as possible between cutting the flowers from the plant and placing them in ethanol 70%.Turn slowly in a rotary mixer for 30 min at room temperature.Replace the used for fresh acetone, once again covering the flowers immediately. Flowers should be exposed to air as short as possible because this damages the cells.Turn slowly for 30 min once again.Submerge the holders/baskets for critical point drying in a Petri dish with acetone. Put flowers in the holders. Remember not to let them dry up! Add a small (5 mm) piece of paper with (pencil written) sample number to each sample well.Proceed to critical point drying following the Leica EM CPD300 protocol (Leica EM CPD300 application booklet[href=https://www.leica-microsystems.com/fileadmin/academy/2013/EMCPD300_Application_Booklet_05_14.pdf]) (Figure 3).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20161110/20161110010916_3786.jpgFigure 3.",
    "Settings used for critical point drying using the Leica EM CPD300 Placing and displaying the samples for coatingTake samples out of the dryer. They should be papery, light, brittle and practically colorless. Be careful handling them, they can easily get damaged.Place the aluminum specimen mounts in acetone for 60 sec to clean them. Take them out and place on a tissue, allowing the acetone to evaporate completely by exposing to air for a few minutes. Handle stubs with gloves from now on. Paste carbon adhesive double sided tape on one (top) end. Label stubs on the bottom according to samples Note: You might need more than one stub per sample depending on size of the flowers.Handle flowers carefully using a soft pincet. Consider that every part touched with the pincet will be damaged, therefore hold them from a point which is not interesting to visualize later. In most pleurothallids the rachis, pedicel or ovary will do as they may not be of interest for the visualization. Note: You can have multiple flowers dried so that you can have the different organs represented once.Place flower on tape. You will need to open up the flowers as much as possible to allow visualisation. Flat flowers like Platystele and Stelis can just be placed entirely (Figure 4), flat on the tape, more tubular flowers like Acianthera and Specklinia have to be dismembered (Figure 5). In those cases, after the synsepal is fixed you can remove the dorsal sepal and petals. It is important to touch the segments as little as possible, to place them on the tape in final position (you will not be able to change position after it was placed), and to consider all possible viewing points you would like.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20161110/20161110011350_0655.jpgFigure 4.",
    "Small and flat flowers like that of Stelis can be displayed completely. Scale bar = 500 μm.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20161110/20161110012505_3907.jpgFigure 5. Stubs showing diverse Pleurothallidinae flowers, dismembered and placed according to the visualization needs. A. Lankesteriana sp. B, E. Specklinia spp. C, D. Echinosepala spp.Store stubs in a Petri dish, and in a closed plastic box or desiccator with some dry silica gel until they will be sputter-coated. Samples can be stored for years at room temperature in a relatively dry place. In places where the humidity is high samples can be stored together with silica gel. If necessary sputter-coating can be repeated before the re-visualization.Sputter-coating the samplesOpen Argon cylinder allowing gas to reach the Q150T S sputter coater (Q150T S/E/ES Sample Preparation System Instruction Manual[href=https://www.yumpu.com/en/document/view/4740725/q150t-s-e-es-sample-preparation-system-instruction-manual]). Turn the machine on.Carefully remove the glass chamber and place the stubs in the holder distributing them evenly so that it is balanced when rotating. Place the glass chamber back on. Lower the cover taking care that it does not touch the samples. Select a ‘Profile’ on the operating screen. It is recommended that you use a coating thickness of PT/Pd 20 nm because Pleurothallidinae flowers are quite irregular. (A PT/Pd 10 nm would probably be enough otherwise.) Run the profile (Figure 6). Anthers and pollinaria often become charged with electrons during observation in the SEM, which disrupts the image acquisition. A thicker coating may help prevent this problem.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20161110/20161110012744_4641.jpgFigure 6. Micrographs of the glandular areas of the sepals of Specklinia species taken without coating using a stereoscopic microscope (1) and with coating using the scanning electron microscope (2). A. S. barbae; B. S. pfavii; C. S. tribuloides. Scale bars = 1 mm (A1, B1 and C1); Scale bars = 100 μm (A2, B2 and C2).",
    "After the run has completely finished the vacuum should allow for the opening of the cover. The samples can be removed using a pincet and returned to the Petri dish.Visualization and photographsTurn the JEOL JSM-7600F field emission scanning electron microscope on, following the microscope manual.Use the multiple 12 mm stub holder and place up to six stubs tightly. Always use powder free gloves when handling the holder and the stubs.Follow the microscope manual to place the samples inside using the specimen exchange rod.Follow the microscope manual to visualize the material. Set the parameters for visualization: Set the work distance (Z) to 15 mm, and set the acceleration voltage to 10 KV. Probe current is 6 and detector mode is SB.Note: The work distance may be varied, a shorter distance gives higher resolution but lower focus depth, a higher work distance will give lower resolution but higher focus depth. Accelerating voltage can be varied, at higher kV the resolution becomes better but there is more chance of charging. It is advised not to use more than 15 kV for biological samples. Lower kV can be useful if you need to avoid charging (e.g., 5 kV) or if you want to work without coating your material (e.g., 2 kV). However, a lower kV gives less resolution and noisier images. For our work with this specific SEM we always use Probe current 6 and a detector mode SB for our biological samples. This setting combines collection of side scattered and backscattered electrons, which gives good image results. When working with magnifications higher than 500x you can switch from ‘Low Mag’ to ‘High Mag’ mode.Save pictures as bitmap (Figure 7).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20161110/20161110013156_1706.jpgFigure 7. Scanning electron micrographs of diverse glands found in the flowers of Pleurothallidinae. A.",
    "Possible osmophore on the abaxial surface of the sepals of Echinosepala. B. Sunken trichome on abaxial surface of Condylago (= Stelis). C. Nectaries on the lip of Platystele. D. Nectar secreting stomata on adaxial surface of the sepals of Specklinia. The measurements represent 100, 100, 100 and 50 μm."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Plant Science"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}