{
  "id": 5535,
  "origin_website": "Bio",
  "title": "Exopolysaccharide Quantification for the Plant Pathogen <em>Ralstonia solanacearum</em>",
  "procedures": [
    "Culture and sample preparationRun a liquid R. solanacearum culture. Culture is performed in an Erlenmeyer containing 100 ml liquid minimal medium inoculated at 0.01 optical density at 600 nm, agitated at 180 rpm at a temperature of 28 °C.Collect 1 ml culture broth in the exponential or stationary phase. The cell culture must be at least above an optical density of 0.1 (ideally around 0.6) at 600 nm or 5 x 108 cell ml-1 to ensure passing the quorum sensing threshold and thus production of exopolysaccharide.Filter the cell broth with a 0.22 µm filter and collect the supernatant in a 2.0 ml microcentrifuge tube.Store the sample at -20 °C or run the extraction right away.Exopolysaccharides extractionTo precipitate exopolysaccharide, mix 0.2 ml supernatant + 0.004 ml 5 M NaCl solution + 0.8 ml acetone in a 2.0 ml microcentrifuge tube. Mix well with a vortex for 10 sec and place the sample at 4 °C overnight (around 12 h).Centrifuge the sample for 10 min at 16,000 x g (13,000 rpm) and at 4 °C and then discard the supernatant. Invert the tube on a paper towel to drain the pellet well during 15 min. Then, add 0.2 ml Milli-Q water to dissolve the pellet.The sample can be stored at 4 °C for few days (optional) until quantification.On the same day that the assay is to be performed, heat samples at 65 °C on dry bath heater for 10 min. Vortex well and then spin for 5 min at 16,000 x g (13,000 rpm), 4 °C. Collect the supernatant and place it in a new 2.0 ml microcentrifuge tube. The preparation is now referred to as the EPS (exopolysaccharide) sample.Exopolysaccharide quantificationTurn on the dry bath heater positioned in a fume hood. Temperature needs to be at 115 °C before adding the samples.",
    "Use the 200 μl of the EPS sample or you can gather EPS samples up to 450 ml. The chosen volume of the sample i is referred to be Vi in the data treatment step, see below.Add 0.15 ml concentrated HCl (37%) to i) the EPS sample or gathered EPS sample up to 0.45 ml, ii) the standard samples, see Table 1. Add enough Milli-Q water to make 0.6 ml total. Mix with a vortex and close the tubes tightly by adding bridges.Table 1. Preparation of N-acetylgalactosamine standard samples. We recommend performing a standard curve at each run of the experiment, or at least running the 10 µg standard sample and the blank, see Table 1. The optical density at 530 nm in the 10 µg standard sample should be around 0.2.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170512/20170512015310_7650.jpgTransfer the tubes to the dry bath heater. Maintain temperatures in the dry bath heater at 115 °C for 30 min. Cover the tubes and the dry bath heater with an aluminum foil if necessary.Transfer the tubes to a rack and cool to room temperature. Then centrifuge for 5 sec the tubes at 2,000 x g (6,000 rpm) using a mini microcentrifuge so the liquid on the top falls back.SLOWLY add, drop by drop using a pipette, 0.4 ml of 2 M Na2CO3 solution to each tube. Addition of this solution to the sample tubes will cause a very bubbly reaction. Mix gently but completely.Add 0.5 ml of a freshly made solution containing 2% acetyl acetone in 1.5 M Na2CO3. Vortex each tube, then open them to remove last CO2 released before heat in order to avoid opening of the tubes. Well close the tubes by adding bridges. Heat at 100 °C in a dry bath heater for 20 min.",
    "Transfer the tubes to a rack and cool to room temperature. Then centrifuge the tubes quickly so the liquid on the top falls back.Transfer liquid into a 15 ml tube and then add 1.0 ml 99.8% ethanol. Mix well. SLOWLY add 0.5 ml Erlich’s reagent solution. Addition of this solution to the sample tubes will cause a very bubbly reaction, like champagne. Once bubbles slow down, first mix gently and then vortex well.Let the tubes stand for about 30 min in the dark or with aluminum fold around. Then, read optical density of the solution at 530 nm. Use the water sample of the standard samples as blank, see Table 1."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Plant Science"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}