{
  "id": 6334,
  "origin_website": "Bio",
  "title": "Using <em>Arabidopsis</em> Mesophyll Protoplasts to Study Unfolded Protein Response Signaling",
  "procedures": [
    "Prepare plasmids for expression of genes of interest (IRE1b is used as an example in this protocol). For each extraction, grow E. coli in 500 ml 2x YT media overnight and extract using a maxiprep kit (QIAGEN product) according to the manufacture's protocol. Set the DNA concentration to 1 μg/μl. All buffers and chemicals should be prepared at least one day before protoplast transformation (Yoo et al., 2007).Make fresh enzyme solution with Cellulose R-10 and Macerozyme R-10 (Products of Yakult).Prepare protoplasts from rosette leaves of wild-type (WT) and/or mutant Arabidopsis plants (Yoo et al., 2007) (ire1a ire1b is used as an example in this protocol) using the tape method as described by Wu et al. (2009) (Figures 1A-1C). Load 10 μl of cell suspension in a hemocytometer and count cells under a light microscope; resuspend protoplasts in MMg buffer to a density of 2.5 x 106/ml.For each reaction, in a 2 ml round bottom tube, mix 400 μl protoplasts with 30 μl IRE1b plasmid (1 μg/μl), add an equal volume of 40% PEG (430 μl, see Recipes for making 40% PEG), mix and incubate at room temperature for 10 min (Figure 1D). Spin down at 60 x g and wash twice with W5 to remove PEG.Resuspend with 1 ml W5 and transfer the transformed protoplasts into a 6-well culture plate (or 12-well culture plate if more than 6 samples), add W5 to a final volume of 5 ml (Figure 1E), and incubate overnight in the dark by covering with foil.Carefully discard the supernatant by gentle pipetting (protoplasts will stay on the bottom due to gravity, no need to centrifuge), and re-suspend with W5 to a final volume of 3 ml.",
    "Divide the 3 ml protoplasts equally into two 2 ml round bottom tubes; add Tm to 5 μg/ml or DTT to 2 mM, mix the protoplasts by gentle inversion, and incubate for 6 h, mixing every 2 h.Spin at 60 x g for 1 min in a low speed centrifuge, discard the supernatant.Add RNA extraction buffer (QIAGEN, Plant Mini RNA kit) and vortex thoroughly for 30 s. Extract RNA according to the manufacturer’s protocol.Test the concentration and quality of RNA using a NanoDrop Spectrophotomer; if desired, RNA can be stored at -80 °C for later use.Use 0.5 μg RNA to synthesize cDNA according to the manufacturer’s protocol (Bio-Rad cDNA kit).Detect the bZIP60 spliced form (named bZIP60s) by RT-PCR using bZIP60F4 and bZIP60SB2 primers, and BIP3 expression using BIP3F and BIP3 primers. Actin2 (using Actin2F and Actin2R primers) is used as a loading control.Run the PCR products on 1.5% agarose gel, stain with Ethidium Bromide and visualize using a gel scanner under UV light (Figure 1F). qRT-PCR can be used for quantification if needed, normalized against Actin2.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20181129/20181129191627_7955.jpgFigure 1. An overview of Arabidopsis protoplast isolation and transformation with the resulting RT-PCR. A-B. Taped rosette leaves before (A) and after (B) digestion with enzymes; C. Isolated protoplasts in W5 solution; D. Protoplasts during transformation; E. Transformed protoplasts after transfer to a 12-well plate; F. RT-PCR detection of bZIP60s and BIP3 expression in protoplast samples treated with or without 2 mM DTT for 6 h. IRE1b was introduced into an ire1a ire1b double mutant background and showed restoration of bZIP60 splicing and BIP3 induction. Actin2 was employed as an endogenous loading control."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Plant Science"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}