{
  "id": 13297,
  "origin_website": "Jove",
  "title": "HUVEC Tube-formation Assay to Evaluate the Impact of Natural Products on Angiogenesis",
  "procedures": [
    "1. RGWE Preparation\nCollect R. graveolens leaves from plants during the spring/summer months under the supervision of a botanist.\nNOTE: In this case, leaves were collected at the Experimental Section of Medicinal Plants in the Botanical Garden of Naples, Italy5. The plant is spontaneous, perennial, and is present in the Mediterranean regions (Figure 1).\nWeigh 250 g of leaves and finely chop them with scissors.\nPut the leaves in a conical flask and add 1 L of distilled water to 250 g of chopped leaves and bring that to a boil at 110 °C for 60 min. Cover the flask with aluminum foil to avoid excessive evaporation.\nUse 3 mm-funnel filter paper to separate the boiled leaves from the liquid phase that represents the water extract.\nFilter the liquid phase through a 0.22 µm filter, collecting it in a beaker. Cover the beaker with parafilm and freeze the extract at -80 °C overnight.\nMake 10 - 15 holes with a needle in the parafilm and lyophilize the extract in a lyophilizer. Note that it can take a couple of days to obtain the powder.\nWeigh the powder obtained, divide it into aliquots, and store it at 4 °C until necessary. It is possible to store it for a year.\nWhen necessary for the experiments, prepare a stock solution, diluting the powder with distilled water to a standard concentration of 50 mg/mL. Separate it into small-volume (e.g., 1 mL) aliquots. This preparation can be stored at -20 °C until used but cannot be stored at 4 °C for more than a couple of days because of the oxidations of the molecules. Avoid freeze and thaw.\n2. Cell Culture",
    "Cultivate HUVECs in endothelial cell growth medium: endothelial basal medium supplemented with 1 μg/mL hydrocortisone and 1 ng/mL epidermal growth factor, 10% FBS, and penicillin/streptomycin at 37 °C in an atmosphere of 5% CO2.\nWhen 80% confluent, split the cells at the ratio of 1:3 every passage. Use cells from two to five passages, that do not show apparent differences in response to growth factors. After the sixth passage, cells become senescent and do not form tubes on the gelled basement matrix.\n3. Transfection\nWhen the HUVECs are 70% confluent, transfect them with the desired gene.\nFor a 100 mm plate, use 1 µg of empty pCDNA3 vector as control and 1 µg of pCDNA3 vector containing the gene of interest (constitutively active MEK [caMEK], in this case).\nComplex 1 µg of DNA with 3 µL of lipofectamine 2,000, diluted with reduced serum medium (see Table of Materials) to the final volume of 200 µL. Remove the medium from the cells and replace it with 1 mL of fresh complete medium; then, add the transfecting solution to the cells. Incubate the cells in the incubator at 37 °C, with 5% CO2. It is possible to also use other transfection agents different from lipofectamine 2,000, following the manufacturer’s instructions.\nAdd 7 mL of complete fresh medium 3 h after the transfection and, then, further incubate the cells at 37 °C for 24 - 48 h before proceeding with the next assays. The day after the transfection, replace the medium with fresh complete medium.\n4. Tube Formation Assay\nCool a 96-well plate and pipette tips at 4 °C for 1 h before preparing the gelled basement.",
    "At the moment of the basement preparation, put the plate on ice (0 °C) and add 50 μL of cold matrix in each well while avoiding the formation of bubbles. Note that the matrix-containing vial should be kept on ice during the procedure since the matrix becomes solid at room temperature.\nPut the plate in the incubator at 37 °C with 5% CO2 for at least 30 min to allow the basement to polymerize.\nIn the meantime, harvest the cells. Wash the HUVECs with 1 mL of a 0.25% trypsin/0.53 mM EDTA solution; then, add 2 mL of the trypsin-EDTA solution and incubate at 37 °C for 5 min. Observe the cells under an inverted microscope to verify that the cell layer is completely dispersed. Then, collect the medium in which the cells are suspended and harvest the detached cells by centrifugation at 264 x g for 3 min. Resuspend them in 1 mL of phosphate-buffered saline (PBS).\nTo count the cells, add 0.2 mL of the cell suspension to 0.5 mL of PBS and 0.3 mL of 0.4% trypan blue solution. After 5 min at room temperature, count the cells in a Bürker chamber.\nResuspend the cells in complete medium at the concentration of 2 x 104 cells/50 µL. Seed them onto the gelled basement at the concentration of 2 x 104 cells per well and let them settle on it.\nPay attention to the number of the cells. Too many or too few cells may not form tubes in the right way on the gelled basement.",
    "Prepare increasing doses of RGWE (0.01, 0.1, and 1 mg/mL), diluting the stock solution in culture medium or rutin (12, 120, and 300 µg/mL), all in the final volume of 50 µL/well, and add them to 50 μL/well of cell suspension. The final volume in each well will be 100 μL. Prepare four to six wells for each experimental condition. As a control, dilute distilled water (vehicle) in the culture medium at a ratio of 1:50.\nIncubate the cells in the incubator at 37 °C and 5% CO2 for a time ranging from 6 to 24 h.\nObserve the cells within a time range spanning from 6 to 24 h after seeding, using a phase-contrast microscope at a magnification of 10X. HUVECs are able to form tube-like structures within 6 h but it is possible to observe better results after 12 - 18 h. Photograph the tube-like structures on each well and image an average from three to five random fields in each well.\nAfter the image acquisition, the cells can be detached from the basement matrix and counted to evaluate the effect of the treatment on the number of cells. For each well, remove the medium, add dispase at a concentration of 24 U/mL, and put the plate at 37 °C for 1 h. Then, from each well, collect the medium in which the cells are suspended and harvest the detached cells by centrifugation at 264 x g for 3 min. Resuspend them in 0.2 mL of PBS. To count the cells, add 0.2 mL of cell suspension to 0.5 mL of PBS and 0.3 mL of 0.4% trypan blue solution. After 5 min at room temperature, count the cells in the Bürker chamber.",
    "To quantify the results of the tube formation assay, it is possible to count the number of branch points in which at least three tubes join. Using the appropriate image software, count for each field in each micrograph the number of branch points and calculate the mean ± the standard error (SE) for each experimental condition. Use a two-tailed t-test to evaluate statistical significance.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}