{
  "id": 17142,
  "origin_website": "Jove",
  "title": "Optimization of Processing of Tiebangchui with Highland Barley Wine Based on the Box-Behnken Design Combined with the Entropy Method",
  "procedures": [
    "In this study, the processing technology of TBC processed with highland barley wine was optimized with a Box-Behnken design combined with the entropy method. DDA and MDA content were used as evaluation indicators, and the weight coefficient of each evaluation index was determined by the entropy method.\n1. Experimental preparation\nPrepare highland barley wine15.\n\t\nTake 500.00 g of black highland barley rice and add five times the amount of water. Cook the rice until the remaining water is absorbed (~2 h). Pour it out, wait until the temperature falls to 37 °C, add 4 g of Jiuqu (see Table of Materials), mix well, seal the can, wrap the container with cotton wool, and let it stew for 7 days.\nAdd 300 mL of water on the 7th day and seal again. On the 8th day, begin removing the wine and replace with 300 mL of water afterward. Seal and ferment for 1 day, take the wine, and add 300 mL of water again. Repeat this procedure three times and combine the liquors.\nBring to a boil, then reduce the heat to a simmer, and continue cooking until the remaining water is absorbed.\nTo prepare processed products, accurately weigh the TBC in a container, add highland barley wine, and soak for 1 day. Then, dry in a constant temperature electric drying oven.\n\tNOTE: The drying temperature should be less than 40 °C to avoid changes in the alkaloid composition.\nPrepare test sample solution.\n\t\nAccurately weigh TBC processed product powder (2 g) in a conical flask, add 40% ammonia solution, and perform ultrasound-assisted extraction with isopropanol-ethyl acetate (1:1) mixed solvents (50 mL) (power: 200 W; frequency: 40 kHz; temperature: 40 °C) for 30 min.",
    "NOTE: To prepare 40% ammonia solution, transfer 40 mL of ammonia to a 100 mL volumetric flask and then dilute with pure water.\nAdjust the extracted solution to the original weight by adding an isopropanol-ethyl acetate mixture (1:1 v/v).\nAccurately transfer the extracted solution (25 mL) to a round-bottom flask for the recovery of the solvent under reduced pressure until dry.\nFinally, transfer 0.05% hydrochloric acid-methanol solution to dissolve the residue from step 1.3.3 in a 5 mL volumetric flask and dilute with 0.05% methanol hydrochloride solution. Filter the solution through a 0.22 µm microporous membrane filter prior to injection into the high-performance liquid chromatography (HPLC) systems.\n\t\tNOTE: Prepare 0.05% methanol hydrochloride acid by adding 0.05 mL of hydrochloric acid to a 100 mL volumetric flask, then dilute with methanol.\nPrepare a standard solution by weighing 5.18 mg of benzoylaconine, 13.13 mg of aconitine, 10.05 mg of 3-deoxyaconitine, and 10.09 mg of 3-acetylaconitine accurately, and then place the solids in a 5 mL volumetric flask individually. Dilute with 0.05% methanol hydrochloride solution.\n2. Chromatographic condition\nSet up the chromatographic conditions as shown in Table 1 for HPLC. Details of the instruments used are provided in the Table of Materials.\n3. System adaptability test\nRange of linearity\n\tNOTE: First, we used HPLC to determine the peak areas of benzoylaconitine, aconitine, 3-deoxyaconitine, and 3-acetylaconitine in the sample, and then randomly determined the peak area of one known concentration of standard solution. Next, we compared the difference between two peak areas (sample solution and standard solution) to estimate the concentration of benzoylaconitine, aconitine, 3-deoxyaconitine, and 3-acetylaconitine in different samples, and then adjusted the standard solution into a linear range to include the concentration of the sample in the curve. The standard curve concentrations are shown in Table 2.",
    "Prepare benzoylaconitine reference solutions containing 1.036 mg/mL, 0.518 mg/mL, 0.2072 mg/mL, 0.1036 mg/mL, and 0.0518 mg/mL.\nPrepare aconitine reference solutions containing 1.313 mg/mL, 0.5252 mg/mL, 0.2626 mg/mL, 0.1313 mg/mL, and 0.05252 mg/mL.\nPrepare 3-deoxyaconitine reference solutions containing 1.005 mg/mL, 0.5025 mg/mL, 0.201 mg/mL, 0.1005 mg/mL, and 0.402 mg/mL.\nPrepare 3-acetylaconitine reference solutions containing 0.2018 mg/mL, 0.1009 mg/mL, 0.04036 mg/mL, 0.02018 mg/mL, and 0.01009 mg/mL.\nInvestigate the linearity of each compound by plotting the peak area versus injection concentration.\nTo perform the precision test, inject 10 µL of each reference solution into the HPLC system six times daily and employ the same HPLC conditions described in step 2.1 to run the samples Record the peak area of each component.\nPerform intraday stability testing by injecting 10 µL of the prepared sample solution via step 1.3 and determine the peak areas after 0 h, 2 h, 4 h, 8 h, 14 h, 12 h, and 24 h16.\nPerform a reproducibility test by taking six samples of the same batch of TBC to prepare the test sample solution, according to step 1.3. Inject 10 µL of each sample into the HPLC system and run the samples as described in step 2.1.\nPerform the recovery test to evaluate the accuracy of the method. Add 100% of the standard solution of each index component (benzoylaconitine, aconitine, 3-deoxyaconitine, and 3-acetylaconitine) in the test solution to calculate the recovery rate, respectively. For example, as the content of benzoylaconitine is 0.1524 mg/mL in the TBC sample, accurately weigh 0.1524 mg of benzoylaconitine standards and add to the TBC sample, then prepare the test sample solution according to step 1.3. Run these samples with the same HPLC conditions described in step 2.1. Calculate the recovery rate using Equation (1):\nimgsrc://cloudfront.jove.com/files/ftp_upload/65154/65154eq01.jpg    (1)",
    "Here, A is the amount of component (benzoylaconitine, aconitine, 3-deoxyaconitine, or 3-acetylaconitine) to be measured in the sample solution, B is the amount of standard added (benzoylaconitine, aconitine, 3-deoxyaconitine, or 3-acetylaconitine), and C is the measured value of the solution containing the standard solution and the sample solution (see Table 3). Refer to step 2.1 for the chromatographic conditions to perform the above steps. The recovery rate reflects the degree of loss of the target component (benzoylaconitine, aconitine, 3-deoxyaconitine, or 3-acetylaconitine) during the sample analysis; the higher the recovery rate, the lower the loss of the target component.\n4. Single factor test of TBC processed with highland barley wine\nNOTE: The ratio between highland barley wine and TBC, slice thickness of TBC, and soaking time will affect the dissolution of more toxic components (aconitine, 3-deoxyaconitine, and 3-acetylaconitine) in TBC during the TBC processed with highland barley wine17. The single factor test and Box-Behnken design were used to investigate the influence of the ratio of highland barley wine to TBC, slice thickness of TBC, and soaking time.\nPerform the highland barley wine addition test (A) by setting up five groups of tests, each with 30 g of TBC, where the amount of highland barley wine is two, three, four, five, and six times the amount of TBC in the recipe. The soaking time is 12 h, and the slices are 1.0 cm thick18.\n\tNOTE: Each group of the same condition test should be processed in three parallel groups.\nPerform the soaking time test (B) by setting up five groups of tests, each with 30 g of TBC. The soaking times are 12 h, 24 h, 36 h, and 48 h. The amount of highland barley wine is five times that of TBC, and the slices are 1.0 cm thick19.",
    "NOTE: Each group of the same condition experiment should be processed in three parallel groups.\nPerform the slicing thickness test (C) by setting up five groups of tests, each with 30 g of TBC. The slices are 0.5, 1.0, 1.5, 2.0, and 2.5 cm thick, the soaking time is 24 h, and the amount of highland barley wine is five times that of TBC20.\n\tNOTE: Each group of the same condition experiment should be processed in three parallel groups.\nAccurately weigh processed products for each test group to prepare test sample solution according to step 1.3. Determine the peak area of each sample by HPLC and use the standard curve to estimate the amounts of MDAs and DDAs. In the standard curve, y is the peak area and x is the content. The content of MDAs is benzoyl aconitine, and the content of DDAs is the sum of aconitine, 3-deoxyaconitine, and 3-acetylaconitine.\nUse the total content of DDAs and the content of MDAs as evaluation indicators, and determine the weight coefficient of each evaluation index and the comprehensive scoring via the entropy method (section 5).\n\tCAUTION: TBC is toxic, and thus protective measures should be taken during processing.\n5. Entropy method to calculate the comprehensive scoring",
    "NOTE: We use the experimental data of the slicing thickness test in the single factor test as an example to illustrate the calculation process in detail. We use the peak area of the components in each sample in Supplementary Table S1 and the standard curve in Table 2 to calculate the content of MDAs and DDAs (see Supplementary Table S2). In the linear equation, y is the peak area and x is the content. In this study, the moderately toxic MDA (benzoylaconitine) was used as the positive indicator, and the total content of DDAs (aconitine, 3-deoxyaconitine, and 3-acetylaconitine) with high toxicity was used as the negative indicator. The content of MDAs is benzoyl aconitine, and the content of DDAs is the sum of aconitine, 3-deoxyaconitine, and 3-acetylaconitine. Each sample has two evaluation indicators: i = 1,2,…,n, and j = 1,2,…m21.\nUse Equation (2) to standardize the content of MDAs22.\nimgsrc://cloudfront.jove.com/files/ftp_upload/65154/65154eq02.jpg     (2)\n\tThus, imgsrc://cloudfront.jove.com/files/ftp_upload/65154/65154eq03.jpg\n\tNOTE: Xij is the value of the j-th indicator of the i-th sample. Xij* is the standardized value of Xij. For example, i = 3 and j = 1, X31 represents the value of the first indicator of the third sample, and imgsrc://cloudfront.jove.com/files/ftp_upload/65154/65154eq04.jpg is the standardized value of the first indicator in the third sample. imgsrc://cloudfront.jove.com/files/ftp_upload/65154/65154eq05.jpg are shown in Supplementary Table S3.\nUse Equation (3) to standardize the total content of the DDAs23.\nimgsrc://cloudfront.jove.com/files/ftp_upload/65154/65154eq06.jpg     (3)\nimgsrc://cloudfront.jove.com/files/ftp_upload/65154/65154eq07.jpg\n\tNOTE: Here, i = 3, j = 2, represents the second indicator of the third sample. imgsrc://cloudfront.jove.com/files/ftp_upload/65154/65154eq08.jpg is the standardized value of the second indicator in the third sample. imgsrc://cloudfront.jove.com/files/ftp_upload/65154/65154eq09.jpg are shown in Supplementary Table S3.\nUse Equations (4) and (5) to define the entropy value (Hj) of each indicator23.\n\t\nCalculate the probability of the j-th trial under the i-th evaluation indicator Pij using equation (4).\nimgsrc://cloudfront.jove.com/files/ftp_upload/65154/65154eq10.jpg     (4)\n\t\tFor number 3,",
    "imgsrc://cloudfront.jove.com/files/ftp_upload/65154/65154eq11.jpg\nimgsrc://cloudfront.jove.com/files/ftp_upload/65154/65154eq12.jpg\n\t\t​NOTE: The probability values for the first indicator and second indicator of the third sample are 0.2374 and 0.2812, respectively. imgsrc://cloudfront.jove.com/files/ftp_upload/65154/65154eq13.jpg are shown in Supplementary Table S3.\nCalculate the information entropy Hj.\nimgsrc://cloudfront.jove.com/files/ftp_upload/65154/65154eq14.jpg     (5)\nimgsrc://cloudfront.jove.com/files/ftp_upload/65154/65154eq15.jpg\nimgsrc://cloudfront.jove.com/files/ftp_upload/65154/65154eq16.jpg\n\t\tNOTE: H1 is the entropy of the first indicator (MDAs) and H2 is the entropy of the second indicator (DDAs) in the slicing thickness test.\nUse Equation (6) to calculate the indicator weights (Wj)23.\nimgsrc://cloudfront.jove.com/files/ftp_upload/65154/65154eq17.jpg (6)\nimgsrc://cloudfront.jove.com/files/ftp_upload/65154/65154eq18.jpg   = 33.3%\nimgsrc://cloudfront.jove.com/files/ftp_upload/65154/65154eq19.jpg   = 66.7%\n\tNOTE: Wj is the weight coefficient of each indicator. In the slicing thickness test, the weight coefficient of the positive indicator (MDAs) and negative indicator (DDAs) are 33.3% and 66.7%, respectively.\nUse Equation (7) to calculate the comprehensive scoring of the indicators23.\nimgsrc://cloudfront.jove.com/files/ftp_upload/65154/65451eq20v2.jpg (7)\n\tFor number 3, imgsrc://cloudfront.jove.com/files/ftp_upload/65154/65154eq21.jpg\nimgsrc://cloudfront.jove.com/files/ftp_upload/65154/65154eq22.jpg\n\tNOTE: Si is the comprehensive scoring of each sample. We need to obtain the highest score as the central point in the Box-Behnken design. S1, S2, S3, S4, and S5 are show in Supplementary Table S3.\n6. Box-Behnken design\nThrough the single factor test, use the condition with the highest comprehensive scoring (see Table 4, Table 5, Table 6, and Figure 2) as the center point of the response surface. Use the amount of highland barley wine (A), soaking time (B), and slice thickness of TBC (C) as the influencing factors and the comprehensive scoring as the response value24.\n\tNOTE: Based on the single factor data in Table 4, Table 5, and Table 6, the highest comprehensive scoring is calculated by equations (2), (3), (4), (5), (6), and (7) in section 5, and the best point is obtained. The amount of highland barley wine was five times that of TBC, the soaking time was 36 h, and the slicing thickness was 1.0 cm.\n7. Box-Behnken design software operation steps",
    "Open the software (see Table of Materials) and select New Design | Box-Behnken Design (see step 5.1; Supplementary File 1).\n\t\nInput the number of influencing factors and input the level information (three-level-three-factor; see Table 7). The Box-Behnken design is composed of 17 experiments in this study. Finally, click Continue (see step 5.2; Supplementary File 1).\nSet the comprehensive scoring (Y) by equations (2), (3), (4), (5), (6), and (7) in section 5 as the response. Input the number of response values (image shows only one response value) and click Finish (see step 5.3; Supplementary File 1).\nProcess the TBC with highland barley wine according to the design results and complete the experiment based on the 17 scenarios designed for the response surface.\nPrepare the sample solutions by following step 1.3 and calculate the total content of the MDAs and DDAs by the HPLC system.\nCalculate the comprehensive scoring for each group by equations (2), (3), (4), (5), (6), and (7) in step 5, and input the score results (see step 5.4; Supplementary File 1).\nClick analyze to analyze the date and model information (see step 5.4.1; Supplementary File 1).\n\t\nPerform statistical validation of polynomial equations and response surface analysis plotted in 3D model plots obtained by the software.\nClick on ANOVA in the top menu and observe the results table.\nClick Optimization to view the predicted optimal process conditions (see step 5.4.2; Supplementary File 1).\n8. Validation test",
    "According to the results predicted from the Box-Behnken response surface design, in step 7.3, identify the optimal processing condition of TBC. Here, it is as follows: TBC is soaked for 24 h in five times the amount of highland barley wine, and the thickness of the TBC is 1.5 cm. Take the optimal level of influencing factors as processing conditions and set up three parallel sets of experiments to verify the stability of the processing technology.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}