{
  "id": 9972,
  "origin_website": "Jove",
  "title": "Human Circadian Phenotyping and Diurnal Performance Testing in the Real World",
  "procedures": [
    "All methods described here have been approved by the University of Birmingham Research Ethics Committee.\n1. Participant screening and experimental design\nPerform all methods following the appropriate ethical approvals, in accordance with the Declaration of Helsinki and gain written informed consent from all participants before any involvement.\nRecruit participants with no prior diagnoses of sleep, neurological or psychiatric disorders, and without taking any medications that affect sleep, melatonin or cortisol rhythms.\nEnsure that no participants are shift workers, participants have not travelled more than two time zones within the past month and they are free to take part in the study (i.e., able to commit to wearing the actiwatch, give saliva samples on a 'free day' and be present for performance testing at specific times (see section 2.1)).\nInvite participants who pass inclusion criteria to attend an initial set up meeting to gain consent, collect questionnaire data, receive training in collecting saliva samples at home and be set up with an actigraphic device and sleep diary. At this meeting, familiarize the participants with the physiological sampling protocols to make sure they understand what is required (see section 3).\nAsk the participants to complete the Munich ChronoType Questionnaire (MCTQ), which assesses individual differences in sleep/wake variables and light exposure on work and free days3. This allows the calculation of corrected mid-sleep times on free days (MSFsc), used as a marker of chronotype.\n2. Actigraphy and sleep diaries\nFor at least two-weeks19 (can be longer time periods depending on the study aims), ask the participants to wear a wrist activity monitor or 'actigraph', to gather rest/activity patterns, and light (1-32,000 lux) data throughout the study period.",
    "Give each participant details of how to use the actigraphs, including removing for bathing/showering (if not waterproof) and preventing sleeves covering them to allow light data to be gathered. Ensure actigraphs are worn on the non-dominant wrist.\nIn combination with actigraphy and to facilitate sleep/wake analysis derived from the actigraphic data, give each participant a sleep diary to complete on a daily basis. Ensure that questions asked include bedtimes, sleep times, night time awakenings, wake up times, sleep quality, naps and times when actigraphs were removed.\nCollect actigraphy data for rest/activity analysis etting the parameters according to what is required (this study used a 30Hz sampling frequency and medium sensitivity setting). Extract details of daily bedtime and get up times from sleep diaries and input to the manufacturer's software or alternative (e.g., open source validated code in order to obtain actigraphic variables relevant for the study).\n3. Physiological sampling\nPre-prepare sampling packs by labelling polypropylene collection tubes or salivettes (use 7 mL plastic bijous in this study). Label the tubes with participant ID number, morning or evening and individual sampling numbers. Include a 'spare' tube to use in case of mistakes.\nPrepare a sample collection record sheet for both morning and evening protocols to allow the participants to time stamp when samples are taken (e.g., Morning Sample 1, Time taken = hh:mm, Morning Sample 2, Time taken = hh:mm). Include participant ID number, date for seasonal information and location for calculating photoperiod.\n\tNOTE: It is crucial that military time is used to ensure that there are no issues with AM/PM. Different colored labels for morning vs. evening sampling tubes can also be used to distinguish between samples.",
    "Give the participants the relevant protocols for physiological sampling and pre-made packs during training of how to take saliva samples in their home/work environment.\nInform the participant that samples must be collected on a free day when the participants are able to go to bed and wake up at preferred times (i.e., without the need for an alarm). To ensure reliable calculation of DLMO, participants should not perform the evening saliva sampling protocol the day before the performance testing due to the need to stay awake past habitual bedtime.\nAsk the participants to allocate one morning and one evening (on the same day) during week two of the study when they are able to commit to giving the saliva samples. Advise the participants to collect morning samples followed by evening samples on the same day.\n\tNOTE: The order of sampling (morning then evening) must be followed to ensure any changes in sleep timing do not impact the results (if evening samples are taken first requiring staying awake past habitual bedtime, this could influence the mornings samples if taken the following day).\nMorning sampling protocol for cortisol awakening response\nEnsure that saliva samples are collected at point of first wake up (whilst still in bed), every 15 min for the first hour and then every 30 min for the next 1 to 2 h. Collect saliva samples by spitting into the appropriately labelled vial (starting with No. 1, 2, 3, etc.).\nDuring this period, ensure that the participants: abstain from alcoholic drinks, drinks containing artificial coloring and food for the period of testing and refrain from cleaning teeth, with or without toothpaste during the sampling period.\nOnce all samples have been provided, ensure that the participants store their samples in their freezer at -20 °C until collection by the research team.",
    "NOTE: It is best to store the samples frozen if possible, but they will remain viable if stored in the fridge until collection the next day. Under the Human Tissue Act (HTA) 2004, samples must be collected and processed within seven days of collection to render them acellular, unless an HTA license is held by the Institution performing the analysis.\nEvening sampling protocol for dim light melatonin onset\nEnsure that saliva samples are collected every 30 min from 3 to 4 h before habitual bedtime until 1 to 2 h after habitual bedtime (e.g., if habitual bedtime is 22:00 h, the participant would start at 18:00/19:00 h until 23:00/00:00 h). Collect saliva samples by spitting into in the appropriately labelled vial (starting with No. 1 then 2, 3, etc.).\nDuring this period, ensure that participants: abstain from caffeinated drinks (e.g., tea, coffee, coca-cola) from 6 h prior to habitual bedtime (e.g., if habitual bedtime is 22:00 h, caffeine consumption should stop at 16:00 h on the day of collection).\nEnsure that the participants remain seated indoors in dim light (< 10 lux, e.g., a single table lamp preferably red light, on the other side of the room, no overhead lights, no electronic screens, curtains closed). Ensure that the participants avoid drinking beverages containing alcohol or artificial coloring and refrain from cleaning teeth, with or without toothpaste, during the sampling period.\nIf the participants wish to eat something, go to the toilet or make a non-caffeinated drink, ensure that they do so immediately after collection of a sample and try to be seated again for 15 min before the next sample is due to be collected. If food is consumed between samples, ensure the participants wash their mouths out with water 15 min prior to collection of the next sample.",
    "Ensure that all other rooms have the same light conditions so that the participant remains in dim light (preferably red light) for the duration of the sampling period.\nOnce all samples have been provided, ensure that the participants store their samples in their freezer at -20 °C until collection by the research team.\n\t\tNOTE: It is critical that participants adhere to dim light protocol. Where possible, researchers should measure the light conditions in order to monitor intensity and spectral composition.\n4. Radioimmunoassay\nPerform RIA or ELISA of melatonin and cortisol in human saliva to determine relative concentrations at each time point.\n\tNOTE: The procedure in these representative results used RIA with an Iodine (125I) radioactive labelled tracer and solid phase separation. This protocol is employed routinely in the Chronobiology Laboratory, University of Surrey, UK20.\nCalculate individual DLMOs as the timepoint at which melatonin concentration exceeds two standard deviations of the three baseline measures (the first three samples).\n\tNOTE: This method adjusts for individual baseline differences compared to using a flat rate concentration14. Other methods can be used depending on the time points used in the sampling (e.g., over a 24 h period for a full profile14).\nCalculate the cortisol peak as the time of highest cortisol concentration recorded during the morning cortisol awakening response.\n5. Diurnal performance testing\nNOTE: The measures that were used in this protocol are the Psychomotor Vigilance Task (PVT)21, and the Karolinska Sleepiness Scale (KSS)22. However, other tests could be used keeping the same design depending on the aim of the study (e.g., if the study was investigating the impact of circadian phenotype on working memory, a memory task would be required).",
    "Ask the participants to perform at least one (depending on the task) practice trial during the week prior to testing to familiarize themselves with the set up.\n\tNOTE: Practice trials can be done remotely if monitored. The number of practice tests should be tailored based on the task(s) being used in the study. For example, a more complex executive function task may require a number of practice tests to reach a plateau compared to a simpler task.\nArrange testing sessions according to the study hypotheses based on number of time points being investigated at specific clock times.\n\tNOTE: Depending on the study design, performance testing can be conducted at home or in the laboratory. Due to the time sensitive nature of the protocol, if performance testing is done in the home environment, compliance must be monitored to ensure participants are conducting it themselves, as well as being time and date stamped.\nConduct testing on a relevant device (this study used a DQ67OW, i7-2600 processor, 4GB RAM, 32-bit desktop with a standard keyboard and mouse).\n\tNOTE: If a laptop, iPad or other device is required for testing, ensure the same device and settings are used throughout the study for all participants and each testing session due to potential variability in responses from a mouse vs. track pad vs. touch screen.\n6. Analysis\nCategorize circadian phenotype groups based on their value for the five variables collected: MSFsc, wake up time, peak time of cortisol awakening response, DLMO and sleep onset (cut offs are given in Table 1).",
    "Allocate a score per variable for each participant. A variable is allocated 0 if it is in the ECP category, 1 if it is in the ICP category and 2 if it is in the LCP category. For example, if a participant is in the LCP category for all variables, they would accumulate a score of 10. Out of a total score from 0-10 identify participants as ECPs (0-3), ICPs (4-6) and LCPs (7-10).\nFrom the total score, subcategories of circadian phenotypes can be determined as follows: 0 = extreme ECP, 1 = definite ECP, 2 = moderate ECP, 3 = mild ECP, 4 = early ICP, 5 = ICP, 6 = late ICP, 7 = mild LCP, 8 = moderate LCP, 9 = definite.\n\tNOTE: Statistical analysis should be determined based on the research questions for individual studies. Non-parametric tests should be used where data do not follow a normal distribution. Post hoc tests should be run to determine time of day effects. When measuring a number of parameters, further corrections of multiple comparisons should be done (e.g., FDR correction of p-values)."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}