{
  "id": 3237,
  "origin_website": "Cell",
  "title": "Glyoxal-based fixation of Drosophila embryos for immunofluorescence staining and RNA in situ hybridization",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nSection 1: Fix embryos using acid-free glyoxal\nTiming: 15 min\n      This step will yield glyoxal fixed embryos. If you are familiar with\n      standard formaldehyde fixation protocols, then this procedure is similar\n      but with two key differences: First, the fixation time is reduced to\n      1 min. Second, only the briefest vortexing is required to “pop”\n      glyoxal-fixed embryos out of their vitelline membrane.\n    \n        Prepare a scintillation vial for embryo fixation.\n        \n            Thaw an aliquot of 12% acid-free glyoxal from the –20°C freezer.\n          \n            Add 3 mL of 0.1M Sodium Phosphate Buffer, pH 7.4 to a glass\n            scintillation vial. Allow buffer to equilibrate to room temperature\n            (∼22°C).\n          \n            To the scintillation vial, add the thawed 1 mL 12% acid-free glyoxal\n            and 4 mL heptane. Swirl the scintillation vial to mix components.\n          \nNote: The organic and aqueous phases will\n      separate to the top and bottom of the vial, respectively. A clear\n      interface between the phases should be seen.\n    \nNote: This preparation gives a final\n      concentration of 3% glyoxal.\n    \nCritical: If the intent is to use the\n      fixed embryos for either RNA FISH or FISH-IF, then take precautions to\n      ensure that reagents, buffers, vials, baskets, tubes, pipets,\n      et cetera are RNAse-free. One concise source for tips regarding\n      RNAse-free processing can be found at this ThermoFisher resource\n      link[href=https://www.thermofisher.com/us/en/home/references/ambion-tech-support/nuclease-enzymes/tech-notes/how-to-maintain-an-rnase-free-lab.html].\n    \n        Retrieve the apple juice plate from an embryo collection cup at the\n        appropriate time for the desired developmental stage, and harvest the\n        embryos as follows.\n        \n            Squirt fresh bleach onto the apple juice plate, completely covering\n            the surface. Incubate for 30–40 s, swirling occasionally.\n            \nNote: This will release embryos\n              from their outer chorion and a few will float to the top of the\n              bleach near the end of the incubation.\n            \n            Immediately dump the embryos into a stainless steel mesh basket and",
    "rinse vigorously with distilled water. Rinse the apple juice plate\n            with distilled water and dump contents into the basket. Continue\n            washing the embryos in the basket with a generous amount of water.\n          \n            Wick away the water by dabbing the basket on a clean paper towel.\n            This should be done quickly so that the embryos do not dehydrate.\n            \nCritical: Thoroughly rinse the\n              embryos to remove residual bleach. When dabbing the basket on the\n              paper towel, watch carefully for a transient pink color to appear,\n              which indicates the presence of residual bleach. If pink is seen,\n              then continue rinsing the basket with water.\n            \nNote: For these steps, it is handy\n              to have the bleach and the distilled water in squeezable wash\n              bottles.\n            \n        Using tweezers, plunge the basket into the heptane/glyoxal mixture in\n        the prepared scintillation vial. Pull out the basket, angling it and\n        shaking carefully so that the embryos remain in the vial (Figure 7[href=https://www.wicell.org#fig7]).\n        \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2804-Fig7.jpg\n              Figure 7. Demonstration to show how the mesh basket is held at an\n              angle to transfer embryos into the liquid in the scintillation\n              vial\n            \nNote: The embryos will sit at the\n      interface of the organic and aqueous phases.\n    \n        Tightly cap the vial and immediately secure on an orbital shaker. Shake\n        for 1 min at ∼250 RPMs.\n      \nCritical: Limit the glyoxal fixation\n      time to 1 min. Longer fixation times lead to a complete loss of\n      antigenicity of proteins in the embryo and failure of subsequent antibody\n      staining by IF.\n    \n        Remove the bottom aqueous phase from the scintillation vial using a\n        glass Pasteur pipet and discard it. Be careful to not aspirate the\n        embryos from the interface.\n      \nCritical: Do remove as much of the\n      bottom phase as possible to limit sample exposure to the glyoxal.",
    "Add 4 mL 100% methanol to the embryos and heptane that remain in the\n        scintillation vial.\n      \nNote: The heptane and methanol phases will\n      separate to the top and bottom of the vial, respectively. The embryos will\n      remain at the interface.\n    \n        Tightly cap the vial and touch the vial bottom to a vortex set at max\n        for 1 s. This will pop the embryos out of their exterior, vitelline\n        membrane shell. “Popped” embryos will settle to the bottom of the vial.\n      \nCritical: Only touch the vial to the\n      vortex for the popping step. Even if you are used to longer vortexing for\n      formaldehyde fixed embryos, avoid aggressive vortexing here. No embryo\n      debris or clouding of the liquid should be seen (troubleshooting 2[href=https://www.wicell.org#troubleshooting]).\n    \n        Using a new glass Pasteur pipet, transfer the popped embryos from the\n        bottom of the vial to a 1.5 mL microcentrifuge tube. Some methanol will\n        be transferred with the embryos. Avoid transferring any heptane.\n      \nCritical: Only collect the embryos at\n      the bottom of the vial. These embryos have been released completely from\n      the vitelline membrane. Embryos remaining at the interface retain\n      vitelline membrane, which will act as an impenetrable barrier to\n      antibodies, dyes and FISH probes and so compromise experimental results.\n    \n        Let the embryos settle by gravity to the bottom of the microcentrifuge\n        tube.\n      \n        Remove the methanol and discard. Replace with ∼1 mL fresh 100% methanol\n        to wash the embryos. Let the embryos settle by gravity to the bottom of\n        the tube.\n      \nRepeat the methanol wash three times.\n        Add 1 mL fresh 100% methanol to the embryos and incubate overnight\n        (>8 h) at –20°C to complete the fixation.\n      \nPause point: Embryos can be stained",
    "immediately, or they can be stored at –20°C for up to one month for IF (Section 2[href=https://www.wicell.org#materials-and-equipment]) or up to one week for RNA FISH or FISH-IF (Section 3[href=https://www.wicell.org#step-by-step-method-details]\n      and 4[href=https://www.wicell.org#expected-outcomes], respectively). If embryo\n      collections are small, then fixed embryos can be pooled to achieve the\n      desired amount before initiating a staining experiment.\n    \n      Section 2: Immunofluorescence (IF) staining of glyoxal-fixed embryos\n    \nTiming: 2–3 days\n      This step involves the series of washes and antibody incubations required\n      to yield embryos stained for a specific protein. Visualization will follow\n      by confocal microscopy (for example, see Figure 2[href=https://www.wicell.org#fig2]).\n    \n        Prepare the following four buffers just prior to starting the\n        immunostaining. Recipes are listed in the Materials and Equipment.\n        \nIF PBS·Triton X-100, 50 mL.\nIF Wash Buffer, 45 mL.\nIF Antibody Buffer, 3 mL.\nIF Blocking Buffer, 2 mL.\nAlternative: In general, Triton\n      X-100 works well for IF. However, if optimizing IF for a primary antibody\n      for the first time, it is advisable to try a side-by-side comparison using\n      either Triton X-100 or Tween-20 as the detergent. Simply replace the\n      Triton X-100 with Tween-20 for all buffers throughout the IF protocol.\n    \n        Using a glass Pasteur pipet, transfer glyoxal fixed embryos to a 1.5 mL\n        amber-colored microcentrifuge tube. Some methanol will be transferred,\n        too.\n      \nCritical: The amber-colored tube is\n      required to preserve the quality of the fluorophores that are conjugated\n      to the secondary antibodies. After secondary antibody incubation, limit\n      exposure of stained embryos to light.\n    \nAlternative: If amber-colored tubes\n      are not available or are not preferred, then tubes can be wrapped in\n      aluminum foil to prevent light exposure.\n    \nNote: Up to 100 μL volume of embryos can\n      be stained per tube, but fewer will work well, too.\n    \n        Let the embryos settle by gravity to the bottom of the tube. Remove\n        methanol and discard.",
    "Rinse the embryos one time as follows:\n        \nAdd 1 mL IF Wash Buffer.\nAllow embryos to settle to bottom of the tube.\nRemove and discard buffer.\n        Wash the embryos four times as follows:\n        \nAdd 1 mL IF Wash Buffer.\n            Close the tube and incubate for 10 min with gentle nutation (or\n            end-over-end rocking) at room temperature (∼22°C).\n          \nAllow embryos to settle to bottom of the tube.\nRemove and discard buffer.\n        Block the embryos one time as follows:\n        \nAdd 1 mL IF Blocking Buffer.\n            Close the tube and incubate for 1 h with gentle nutation at room\n            temperature.\n          \nAllow embryos to settle to bottom of the tube.\nRemove and discard buffer.\n        Stain the embryos with primary antibody against your target protein as\n        follows:\n        \n            In a separate tube combine the appropriate volume of primary\n            antibody and IF Antibody Buffer up to 500 μL.\n          \nAdd the primary antibody mixture to the blocked embryos.\n            Close the tube and incubate for 4–10 h with gentle nutation at 4°C.\n          \nAllow embryos to settle to bottom of the tube.\nRemove and discard buffer.\nAlternative: If the primary\n      antibody is precious, then the final volume of the antibody incubation can\n      be reduced to 330 μL. After the incubation, the antibody buffer can be\n      collected and saved and used in subsequent IF experiments. Such recycled\n      primary antibody can work well for up to 5–10 subsequent stainings.\n    \nAlternative: Faster staining can be\n      achieved by primary antibody incubation for 1 h with nutation at room\n      temperature. However, the faster incubation typically results in more\n      non-specific background staining.\n    \nPause point: The 4–10 h incubation\n      allows the staining to go overnight, offering a good pause point for the\n      experimentalist. On the morning of the following day, simply pick up at\n      Step 19.d.\n    \n        Wash the embryos four times as follows:",
    "Add 1 mL IF Wash Buffer.\n            Close the tube and incubate for 10 min with gentle nutation at room\n            temperature.\n          \nAllow embryos to settle to bottom of the tube.\nRemove and discard buffer.\n        Stain the embryos with secondary antibody as follows:\n        \n            In a separate tube combine 1 μL secondary antibody and IF Antibody\n            Buffer up to 500 μL.\n          \nAdd the secondary antibody mixture to the embryos.\n            Close the tube and incubate for 1 h with gentle nutation at room\n            temperature.\n          \nAllow embryos to settle to bottom of the tube.\nRemove and discard buffer.\n        If staining embryos with two primary antibodies, then wash four times as\n        follows, and in Step 22.e, loop back for the second combination of\n        primary/secondary antibody stainings:\n        \nAdd 1 mL IF Wash Buffer.\n            Close the tube and incubate for 10 min with gentle nutation at room\n            temperature.\n          \nAllow embryos to settle to bottom of the tube.\nRemove and discard buffer.\n            Repeat Steps 19–21 for the second combination of primary/secondary\n            antibodies.\n          \n        After the final secondary antibody incubation, wash the embryos one time\n        as follows:\n        \nAdd 1 mL IF Wash Buffer.\n            Close the tube and incubate for 1 min with gentle nutation at room\n            temperature.\n          \nAllow embryos to settle to bottom of the tube.\nRemove and discard buffer.\n        Stain the DNA/nuclei with Hoechst 33342 as follows:\n        \n            In a separate tube combine 1.0 μL 20 mM Hoechst dye with 1.0 mL IF\n            Wash Buffer, for a final dilution of 1:1000 Hoechst dye. Mix.\n          \nAdd 1.0 mL of the diluted Hoechst dye mixture to the embryos.\n            Close the tube and incubate for 5 min with gentle nutation at room\n            temperature.\n          \nRemove and discard buffer.\nAlternative: DAPI can be used\n      instead of Hoechst dye. Combine 5 μL 5mg/mL DAPI in 0.5 mL IF Wash Buffer,",
    "for a final dilution of 50 μg/mL DAPI. Nutate with embryos for 10 min at\n      room temperature.\n    \n        Wash the embryos four times as follows:\n        \nAdd 1 mL IF Wash Buffer.\n            Close the tube and incubate for 10 min with gentle nutation at room\n            temperature.\n          \nAllow embryos to settle to bottom of the tube.\nRemove and discard buffer.\n        Mount embryos immediately on a microscope slide in AquaPolymount as\n        follows:\n        \nAdd 200 μL IF Wash Buffer to stained embryos.\nTransfer embryos to a slide using a Pasteur pipet.\nWick away excess buffer with the edge of a paper towel.\n            Add 1 drop of AquaPolymount and arrange embryos as desired using a\n            27G½ needle (troubleshooting 2[href=https://www.wicell.org#troubleshooting]).\n          \nAllow AquaPolymount to harden overnight (>8 h).\nCritical: Protect stained embryos from\n      light to the greatest extent possible. Mounting will necessarily occur in\n      the light; but after mounting, slides should be stored in the dark.\n    \nNote: It is convenient to secure the 27G½\n      needle on the end of a 1 mL syringe and hold the syringe like a pencil to\n      push individual embryos around on the slide.\n    \nAlternative: Embryos can also be\n      stored overnight at 4°C in IF Wash Buffer and mounted on a slide on the\n      following day.\n    \n        Apply a coverslip to the prepared slide as follows:\n        \nPlace the slide embryo side up on a paper towel.\n            Make an “X” of AquaPolymount from corner to corner of a coverslip of\n            appropriate thickness for the microscope objective that will be used\n            for imaging.\n          \n            Flip the coverslip over so the AquaPolymount is facing down and\n            position directly over the slide.\n          \n            Gently drop the coverslip straight onto the slide, making sure that\n            it does not slide sideways on the surface of the mounted embryos.\n          \n            Cut a paper towel with dimensions just slightly larger than the",
    "slide. Place the paper towel on the coverslip, being careful to not\n            move the coverslip.\n          \n            Lower a 200 G metal analytical weight straight onto the sample.\n            Excess AquaPolymount will seep out of the slide/coverslip sandwich\n            and be soaked up by the paper towels.\n          \nLet the AquaPolymount harden for > 1 h.\nCritical: To avoid distorting or\n      damaging the embryos, limit slippage of the coverslip sideways on the\n      surface of the slide.\n    \nPause point: Once embryos are\n      mounted they are stable for up to a few months. However, best imaging\n      results are achieved with freshly stained embryos.\n    \n        Proceed to imaging (troubleshooting 3[href=https://www.wicell.org#troubleshooting];\n        troubleshooting 4[href=https://www.wicell.org#troubleshooting]).\n      \nCritical: Before imaging, make sure\n      that the coverslip and slide are stable, and the coverslip should be\n      cleaned of residual AquaPolymount to avoid damage to microscope\n      objectives. AquaPolymount can be wiped away using a Kimwipe moistened with\n      water.\n    \nSection 3: RNA FISH staining of glyoxal-fixed embryos\nTiming: 2–3 days\n      This step involves the series of washes and oligo hybridization required\n      to yield embryos stained for a specific RNA transcript. Visualization will\n      follow by confocal microscopy (for example, see\n      Figure 4[href=https://www.wicell.org#fig4]).\n    \n        Prepare the following three buffers just prior to starting the FISH\n        experiment. Recipes are listed in the Materials and Equipment. Also,\n        confirm that an aliquot of FISH Hybridization Buffer is available in\n        the –20°C freezer. Otherwise, that buffer must also be prepared.\n        \nFISH PBS·Triton X-100, 10 mL.\nFISH Wash Buffer, 10 mL.\nFISH SSC·Triton X-100, 10 mL.\nAlternative: Triton X-100 works\n      well for RNA FISH. However, if optimizing your protocol for a probe set\n      for the first time, it is advisable to try a side-by-side comparison using\n      either Triton X-100 or Tween-20 as the detergent. Simply replace the\n      Triton X-100 with Tween-20 for all buffers throughout the RNA FISH\n      protocol.\n    \nCritical: Take precautions to ensure",
    "that reagents, buffers, tubes, pipets, et cetera are RNAse-free.\n    \n        Using a glass Pasteur pipet, transfer glyoxal fixed embryos to a 1.5 mL\n        amber-colored microcentrifuge tube. Some methanol will be transferred,\n        too.\n      \nCritical: The amber-colored tube is\n      required to preserve the quality of the fluorophores that are conjugated\n      to the probes. After hybridization, limit exposure of stained embryos to\n      light.\n    \nAlternative: If amber-colored tubes\n      are not available or are not preferred, then tubes can be wrapped in\n      aluminum foil to prevent light exposure.\n    \nNote: Up to 50 μL volume of embryos can be\n      stained per tube, but fewer will work well, too.\n    \n        Let the embryos settle by gravity to the bottom of the tube. Remove\n        methanol and discard.\n      \n        Rinse the embryos one time as follows:\n        \nAdd 1 mL FISH PBS·Triton X-100.\nAllow embryos to settle to bottom of the tube.\nRemove and discard buffer.\n        Wash the embryos four times as follows:\n        \nAdd 1 mL FISH PBS·Triton X-100.\n            Close the tube and incubate for 10 min with gentle nutation (or\n            end-over-end rocking) at room temperature (∼22°C).\n          \nAllow embryos to settle to bottom of the tube.\nRemove and discard buffer.\n        Rinse the embryos one time as follows:\n        \nAdd 1 mL FISH Wash Buffer.\nAllow embryos to settle to bottom of the tube.\nRemove and discard buffer.\n        Pre-hybridize the embryos two times as follows:\n        \nAdd 1 mL FISH Wash Buffer.\n            Close the tube and incubate for 10 min with gentle nutation (or\n            end-over-end rocking) at room temperature.\n          \nAllow embryos to settle to bottom of the tube.\nRemove and discard buffer.\n        Hybridize the embryos with fluorophore labeled FISH probes against your\n        target transcript as follows:\n        \n            In a separate tube combine 1 μL 10 μM FISH probes with 49 μL FISH\n            Hybridization Buffer. If using FISH Hybridization Buffer from the\n            freezer, pre-warm to room temperature.",
    "Add the FISH probe/Hybridization Buffer mixture to the embryos.\n          \n            Close the tube and incubate for ∼16 h with gentle nutation at 27°C.\n          \nAllow embryos to settle to bottom of the tube.\nRemove and discard buffer.\nAlternative: If optimizing your\n      protocol for a probe set for the first time, it is advisable to try a\n      side-by-side comparison using 1 μL of FISH probe at a working\n      concentration of 2, 5, 10 and 20 μM.\n    \nNote: Hybridization at 27°C deviates from\n      our published protocol for FISH,13[href=https://www.wicell.org#bib13] where\n      the hybridization temperature used was 30°C. However, we found that 30°C\n      promotes clumping of glyoxal fixed embryos, whereas embryos do not clump\n      at the slightly lower temperature.\n    \nPause point: The 16 h incubation\n      allows the staining to go overnight, offering a good pause point for the\n      experimentalist. On the morning of the following day, simply pick up at\n      Step 36.d.\n    \n        Rinse the embryos one time as follows:\n        \nAdd 1 mL FISH Wash Buffer.\nAllow embryos to settle to bottom of the tube.\nRemove and discard buffer.\n        Wash the embryos two times as follows:\n        \nAdd 1 mL FISH Wash Buffer.\n            Close the tube and incubate for 30 min with gentle nutation at 27°C.\n          \nAllow embryos to settle to bottom of the tube.\nRemove and discard buffer.\n        Do a serial dilution of Hoechst 33342 dye and stain the DNA/nuclei as\n        follows:\n        \n            In a separate tube combine 1 μL 20 mM Hoechst dye with 1 mL FISH\n            Wash Buffer, for a final dilution of 1:1000 Hoechst dye. Mix.\n          \n            In a separate tube combine 100 μL 1:1000 Hoechst dye with 0.9 mL\n            FISH Wash Buffer, for a final dilution of 1:10,000 Hoechst dye. Mix.\n          \nAdd 1 mL of the diluted Hoechst dye mixture to the embryos.\n            Close the tube and incubate for 30 min with gentle nutation at 27°C.",
    "Allow embryos to settle to bottom of the tube.\nRemove and discard buffer.\n        Wash the embryos two times as follows:\n        \nAdd 1 mL FISH SSC·Triton X-100.\n            Close the tube and incubate for 10 min with gentle nutation at room\n            temperature.\n          \nAllow embryos to settle to bottom of the tube.\nRemove and discard buffer.\n        Mount embryos immediately on a microscope slide in AquaPolymount as\n        follows:\n        \nAdd 200 μL FISH SSC·Triton X-100 to stained embryos.\nTransfer embryos to a slide using a Pasteur pipet.\nWick away excess buffer with the edge of a paper towel.\n            Add 1 drop of AquaPolymount and arrange embryos as desired using a\n            27G½ needle (troubleshooting 2[href=https://www.wicell.org#troubleshooting]).\n          \nAllow AquaPolymount to harden overnight (>8 h).\nCritical: Protect stained embryos from\n      light to the greatest extent possible. Mounting necessarily occurs in the\n      light; but after mounting, slides should be stored in the dark.\n    \nAlternative: Embryos can also be\n      stored overnight at 4°C in FISH SSC·Triton X-100 and mounted on a slide on\n      the following day.\n    \n        Apply a coverslip to the prepared slide as follows:\n        \nPlace the slide embryo side up on a paper towel.\n            Make an “X” of AquaPolymount from corner to corner of a coverslip of\n            appropriate thickness for the microscope objective that will be used\n            for imaging.\n          \n            Flip the coverslip over so the AquaPolymount is facing down and\n            position directly over the slide.\n          \n            Gently drop the coverslip straight onto the slide, making sure that\n            it does not slide sideways on the surface of the mounted embryos.\n          \n            Cut a paper towel with dimensions just slightly larger than the\n            slide. Place the paper towel on the coverslip, being careful to not\n            move the coverslip.\n          \n            Lower a 200 G metal analytical weight straight onto the sample.\n            Excess AquaPolymount will seep out of the slide/coverslip sandwich",
    "and be soaked up by the paper towels.\n          \nLet the AquaPolymount harden for >1 h.\nCritical: To avoid distorting or\n      damaging the embryos, limit slippage of the coverslip sideways on the\n      surface of the slide.\n    \nPause point: Once embryos are\n      mounted they are stable for up to a few weeks. However, best imaging\n      results are achieved with freshly stained embryos.\n    \n        Proceed to imaging (troubleshooting 3[href=https://www.wicell.org#troubleshooting];\n        troubleshooting 4[href=https://www.wicell.org#troubleshooting]).\n      \nCritical: Before imaging, make sure\n      that the coverslip and slide are stable, and the coverslip should be\n      cleaned of residual AquaPolymount to avoid damage to microscope\n      objectives. AquaPolymount can be wiped away using a Kimwipe moistened with\n      water.\n    \nSection 4. FISH-IF staining of glyoxal-fixed embryos\nTiming: 3 days\n      This step involves the series of washes, antibody incubations and oligo\n      hybridization required to yield embryos stained for both a specific\n      protein and RNA transcript. Visualization will follow by confocal\n      microscopy (for example, see Figure 5[href=https://www.wicell.org#fig5]). A\n      post-fixation step is included after the IF staining and prior to FISH.\n    \n        Prepare the following five buffers just prior to starting the FISH-IF\n        experiment. Recipes are listed in the Materials and Equipment. Also,\n        confirm that an aliquot of FISH Hybridization Buffer is available in\n        the –20°C freezer. Otherwise, that buffer must also be prepared.\n        \nFISH PBS·Triton X-100, 25 mL.\nFISH-IF Blocking Buffer, 5 mL.\n1× PBS, 5 mL.\nFISH Wash Buffer, 10 mL.\nFISH SSC·Triton X-100, 10 mL.\nAlternative: Triton X-100 works\n      well for FISH-IF. However, if optimizing your protocol for a probe set for\n      the first time, it is advisable to try a side-by-side comparison using\n      either Triton X-100 or Tween-20 as the detergent. Simply replace the\n      Triton X-100 with Tween-20 for all buffers throughout the FISH-IF\n      protocol.\n    \nCritical: Take precautions to ensure\n      that reagents, buffers, tubes, pipets, et cetera are RNAse-free.",
    "Using a glass Pasteur pipet, transfer fixed embryos to a 1.5 mL\n        amber-colored microcentrifuge tube. Some methanol will be transferred,\n        too.\n      \nCritical: The amber-colored tube is\n      required to preserve the quality of the fluorophores that are conjugated\n      to the probes. After hybridization, limit exposure of stained embryos to\n      light.\n    \nAlternative: If amber-colored tubes\n      are not available or are not preferred, then tubes can be wrapped in\n      aluminum foil to prevent light exposure.\n    \nNote: Up to 50 μL volume of embryos can be\n      stained per tube, but fewer will work well, too.\n    \n        Let the embryos settle by gravity to the bottom of the tube. Remove\n        methanol and discard.\n      \n        Rinse the embryos one time as follows:\n        \nAdd 1 mL FISH PBS·Triton X-100.\nAllow embryos to settle to bottom of the tube.\nRemove and discard buffer.\n        Wash the embryos four times as follows:\n        \nAdd 1 mL FISH PBS·Triton X-100.\n            Close the tube and incubate for 10 min with gentle nutation (or\n            end-over-end rocking) at room temperature (∼22°C).\n          \nAllow embryos to settle to bottom of the tube.\nRemove and discard buffer.\n        Block the embryos one time as follows:\n        \nAdd 1 mL FISH-IF Blocking Buffer.\n            Close the tube and incubate for 1 h with gentle nutation at room\n            temperature.\n          \nAllow embryos to settle to bottom of the tube.\nRemove and discard buffer.\n        Stain the embryos with primary antibody against your target protein as\n        follows:\n        \n            In a separate tube combine the appropriate volume of primary\n            antibody and FISH-IF Blocking Buffer up to 500 μL.\n          \nAdd the primary antibody mixture to the blocked embryos.\n            Close the tube and incubate for 4–10 h with gentle nutation at 4°C.\n          \nAllow embryos to settle to bottom of the tube.\nRemove and discard buffer.\nAlternative: If the primary\n      antibody is precious, then the final volume of the antibody incubation can",
    "be reduced to 330 μL. After the incubation, the antibody buffer can be\n      collected and saved and used in subsequent immunofluorescence experiments.\n      Such recycled primary antibody can work well for up to 5–10 subsequent\n      stainings.\n    \nAlternative: Faster staining can be\n      achieved by primary antibody incubation for 1 h with nutation at room\n      temperature. However, the faster incubation typically results in more\n      non-specific background staining.\n    \nPause point: The 4–10 h incubation\n      allows the staining to go overnight, offering a good pause point for the\n      experimentalist. On the morning of the following day, simply pick up at\n      Step 50.d.\n    \n        Wash the embryos four times as follows:\n        \nAdd 1 mL FISH PBS·Triton X-100.\n            Close the tube and incubate for 10 min with gentle nutation at room\n            temperature.\n          \nAllow embryos to settle to bottom of the tube.\nRemove and discard buffer.\n        Stain the embryos with secondary antibody as follows:\n        \n            In a separate tube combine 1 μL secondary antibody and FISH-IF\n            Blocking Buffer up to 500 μL.\n          \nAdd the secondary antibody mixture to the embryos.\n            Close the tube and incubate for 1 h with gentle nutation at room\n            temperature.\n          \nAllow embryos to settle to bottom of the tube.\nRemove and discard buffer.\n        Wash the embryos four times as follows:\n        \nAdd 1 mL FISH PBS·Triton X-100.\n            Close the tube and incubate for 10 min with gentle nutation at room\n            temperature.\n          \nAllow embryos to settle to bottom of the tube.\nRemove and discard buffer.\n        Post-fix the embryos as follows:\n        \nAdd 350 μL of 5 mM BS(PEG)5 in 1× PBS.\n            Close the tube and incubate for 45 min with gentle nutation at room\n            temperature.\n          \nRemove and discard buffer.\nNote: Post-fixation can be performed with\n      alternative fixatives. However, we found that BS(PEG)5 gave better results\n      regarding quality of the immunostaining.17[href=https://www.wicell.org#bib17],18[href=https://www.wicell.org#bib18]\n        Pre-hybridize the embryos two times as follows:",
    "Add 1 mL FISH Wash Buffer.\n            Close the tube and incubate for 10 min with gentle nutation at room\n            temperature.\n          \nAllow embryos to settle to bottom of the tube.\nRemove and discard buffer.\n        Hybridize the embryos with fluorophore labeled FISH probes against your\n        target transcript as follows:\n        \n            In a separate tube combine 1 μL 10 μM FISH probes with 49 μL FISH\n            Hybridization Buffer.\n            \nNote: If using FISH Hybridization\n              Buffer from the freezer, pre-warm to room temperature.\n            \n            Add the FISH probe/Hybridization Buffer mixture to the embryos.\n          \n            Close the tube and incubate for ∼16 h with gentle nutation at 27°C.\n          \nAllow embryos to settle to bottom of the tube.\n            Remove and discard buffer.\n            \nAlternative: If optimizing\n              your protocol for a probe set for the first time, it is advisable\n              to try a side-by-side comparison using 1 μL of FISH probe at a\n              working concentration of 2, 5, 10 and 20 μM.\n            \nNote: Hybridization at 27°C\n              deviates from our published protocol for FISH-IF, where the\n              hybridization temperature used was 30°C. However, we found that\n              30°C promotes clumping of glyoxal fixed embryos, whereas embryos\n              do not clump at the slightly lower temperature.\n            \nPause point: The 16 h\n              incubation allows the staining to go overnight, offering a good\n              pause point for the experimentalist. On the morning of the\n              following day, simply pick up at Step 56.d.\n            \n        Rinse the embryos one time as follows:\n        \nAdd 1 mL FISH Wash Buffer.\nAllow embryos to settle to bottom of the tube.\nRemove and discard buffer.\n        Wash the embryos two times as follows:\n        \nAdd 1 mL FISH Wash Buffer.\n            Close the tube and incubate for 30 min with gentle nutation at 27°C.\n          \nAllow embryos to settle to bottom of the tube.\nRemove and discard buffer.\n        Do a serial dilution of Hoechst 33342 dye and stain the DNA/nuclei as",
    "follows:\n        \n            In a separate tube combine 1 μL 20 mM Hoechst dye with 1 mL FISH\n            Wash Buffer, for a final dilution of 1:1000 Hoechst dye. Mix.\n          \n            In a separate tube combine 100 μL 1:1000 Hoechst dye with 0.9 mL\n            FISH Wash Buffer, for a final dilution of 1:10,000 Hoechst dye. Mix.\n          \nAdd 1 mL of the diluted Hoechst dye mixture to the embryos.\n            Close the tube and incubate for 30 min with gentle nutation at 27°C.\n          \nAllow embryos to settle to bottom of the tube.\nRemove and discard buffer.\n        Wash the embryos two times as follows:\n        \nAdd 1 mL FISH SSC·Triton X-100.\n            Close the tube and incubate for 10 min with gentle nutation at room\n            temperature.\n          \nAllow embryos to settle to bottom of the tube.\nRemove and discard buffer.\n        Mount embryos immediately on a microscope slide in AquaPolymount as\n        follows:\n        \nAdd 200 μL FISH SSC·Triton X-100 to stained embryos.\nTransfer embryos to a slide using a Pasteur pipet.\nWick away excess buffer with the edge of a paper towel.\n            Add 1 drop of AquaPolymount and arrange embryos as desired using a\n            27G½ needle (troubleshooting 2[href=https://www.wicell.org#troubleshooting]).\n          \nAllow AquaPolymount to harden overnight (>8 h).\nCritical: Protect stained embryos from\n      light to the greatest extent possible. Mounting necessarily occurs in the\n      light; but after mounting, slides should be stored in the dark.\n    \nAlternative: Embryos can also be\n      stored overnight at 4°C in FISH SSC·Triton X-100 and mounted on a slide on\n      the following day.\n    \n        Apply a coverslip to the prepared slide as follows:\n        \nPlace the slide embryo side up on a paper towel.\n            Make an “X” of AquaPolymount from corner to corner of a coverslip of\n            appropriate thickness for the microscope objective that will be used\n            for imaging.\n          \n            Flip the coverslip over so the AquaPolymount is facing down and",
    "position directly over the slide.\n          \n            Gently drop the coverslip straight onto the slide, making sure that\n            it does not slide sideways on the surface of the mounted embryos.\n          \n            Cut a paper towel with dimensions just slightly larger than the\n            slide. Place the paper towel on the coverslip, being careful to not\n            move the coverslip.\n          \n            Lower a 200 G metal analytical weight straight onto the sample.\n            Excess AquaPolymount will seep out of the slide/coverslip sandwich\n            and be soaked up by the paper towels.\n          \nLet the AquaPolymount harden for >1 h.\nCritical: To avoid distorting or\n      damaging the embryos, limit slippage of the coverslip sideways on the\n      surface of the slide.\n    \nPause point: Once embryos are\n      mounted they are stable for up to a few weeks. However, best imaging\n      results are achieved with freshly stained embryos.\n    \n        Proceed to imaging (troubleshooting 3[href=https://www.wicell.org#troubleshooting];\n        troubleshooting 4[href=https://www.wicell.org#troubleshooting]).\n      \nCritical: Before imaging, make sure\n      that the coverslip and slide are stable, and the coverslip should be\n      cleaned of residual AquaPolymount to avoid damage to microscope\n      objectives. AquaPolymount can be wiped away using a Kimwipe moistened with\n      water.\n    \nAlternative: If optimizing your\n      protocol for an antibody/probe set pair for the first time, it is\n      advisable to try (i) doing the IF and FISH in the order described here but\n      skipping the post-fixation step; and (ii) reversing the order so that FISH\n      precedes IF."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Developmental Biology",
    "Microscopy"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}