{
  "id": 8814,
  "origin_website": "Jove",
  "title": "High-resolution Volume Imaging of Neurons by the Use of Fluorescence eXclusion Method and Dedicated Microfluidic Devices",
  "procedures": [
    "The study was carried out in accordance with European Community guidelines on the care and use of laboratory animals: 86/609/EEC. The research purpose and the protocol are described in the Ethical Annex of ERCadg project CellO, which was approved and is regularly reviewed by the ERCEA. Institut Curie animal facility has received licence #C75-05-18, 24/04/2012, reporting to Comité d'Ethique en matière d'expérimentation animale Paris Centre et Sud (National registration number: #59).\n1. Fabrication of the mold\nNOTE: The mold includes central and intermediate chambers connected to an inlet and an outlet, plus two reservoirs (and inlets) located on both sides of the central chamber.\nUse flat tweezers to manipulate 51 mm diameter silicon wafers and transfer them from one place to another.\nCentral chamber silicon mold\n\t\nFill a 2-mL plastic pipette with positive photoresist. Position the pipette at the center of a 51-mm diameter silicon wafer and press on its reservoir until covering about 75% of the wafer surface with the photoresist. Spin-coat at 3000 rpm for 30 s.\nTransfer the wafer from the spin-coater to a hotplate, with a surface temperature of 100 °C, for 50 s.\nTransfer the wafer from the hotplate to the substrate holder (chuck) of the mask aligner. Expose through the \"DRIE mask\" (see Supplementary files \"masks_neuron_volume_chips.tiff\" and \"masks_neuron_volume_chips.dxf\").\nRemove the wafer from the chuck then dive it in a 100-mL glass crystallizing dish containing the developer (dilution 1:4 in deionized water). Release the wafer and maintain it for 1 min while continuously and gently stirring the crystallizing dish.\n\t\tNOTE: To save reagents, fill the crystallizing dish to 1 cm in height at maximum.",
    "Take back the wafer from the developer and submerge it into a 100-mL crystallizing dish filled with deionized water for about 10 s.Then place the wafer on an absorbent paper and dry it with pressurized nitrogen using an air blow gun.\nPlace the wafer for 50 s on a hotplate with a surface temperature of 115 °C.\nPerform deep-Reactive Ion Etching (DRIE) with the following parameters (more information on the DRIE technique can be found in references 14 and 15); Passivation step: 50 sccm of C4F8, He backing flow 10 sccm, CP 10 W, Inductively Coupled Plasma (ICP) 1500 W, total pressure 24 mbar, temperature 18 °C; Etching step: 100 sccm of SF6, He backing flow 10 sccm, CP 11 W, ICP 1500 W, total pressure 24 mbar, temperature 18 °C; Passivation time: 4 s; Etching time: 7 s; Total process duration: typically 5 min for about 10 µm etched depth.\nDissolve the photoresist by diving the substrate into a crystallizing dish filled with acetone.\nSubmerge the wafer in a piranha solution (2/3 of H2O2 (30%) and 1/3 of H2SO4 (95%)) for 5 min.\n\t\tCaution: Always add H2O2 first and then H2SO4 and rinse at least 3 times in deionized water after cleaning.\nFabricate the molds corresponding to intermediate chambers by performing steps 1.2.1 to 1.2.11 following the parameters listed in Tables 1-3.\n\tNOTE: Each table corresponds to a given device characterized by a specific height of the central observation chamber.\n\tNOTE: Perform the whole process using increasing photoresists heights (Masks 1 to 3 for each device, see Supplementary files \"masks_neuron_volume_chips.tiff\" and \"masks_neuron_volume_chips.dxf\").\n\t\nPlace the etched silicon wafer on the spin-coater substrate holder.",
    "Check that the spin-coater is working properly by verifying that the aspiration of the substrate is effective (the substrate should spin and stay in place during the nominal rotation speed).\nThe viscosity of SU-8 increases with the height of the targeted thickness range. Always use 20-30 mL bottles to store SU-8 photoresists and pour it on the wafer before spin-coating (SU-8 might be too viscous to be manipulated with a plastic pipette).\nPour negative epoxy-type photoresist SU-8 at the center of the substrate until covering about 75% of the silicon wafer, then spin-coat using the parameters indicated in row \"Spincoating\" of the Tables.\nPlace the coated wafer on a hotplate for the duration and temperature indicated in row \"Soft bake\".\nMount the etched wafer and the adequate \"SU-8 Mask\" on the mask aligner.\nAlign the etched wafer with the mask using the dedicated alignment crosses (typical size of these crosses: 50 µm × 150 µm) designed on each mask.\n\t\tNOTE: Two crosses on each side of the device are sufficient (one at the bottom left and one at the top right).\nExpose using the I-line of the mask aligner (wavelength 365 nm) with the appropriate UV dose, as indicated in row \"Exposure energy\".\n\t\tNOTE: The exposure time is calculated by dividing the exposure energy E specific for each photoresist by the effective power of the UV lamp, modulated by the absorption of the mask: imgsrc://cloudfront.jove.com/files/ftp_upload/56923/56923eq1.jpg x (1- Absorptionmask). Absorption is about 20% for flexible masks and negligible for chromium hard mask.\nPlace the coated wafer on a hotplate for the duration and temperature indicated in row \"Post bake\".",
    "Prepare two 100-mL glass-crystallizing dishes, one containing the developer, the other empty. Dive the wafer in the developer for the duration indicated in row \"Development\". Agitate gently the crystallizing dish all along development\nSprinkle the wafer with isopropanol above the empty crystallizing dish for about 5 s. Finally, place the wafer on an absorbent paper and dry it with pressurized nitrogen using an air blow gun.\nPlace the coated wafer on a hotplate for the duration and temperature indicated in row \"Hard bake\" (optional).\n\t\tNOTE: This step is useful to avoid cracks in the photoresist and provide a homogeneous flat surface for the next steps.\nRepeat steps 1.3.1 - 1.3.10 to complete the processes listed in Table 1-3.\nAfter the last step of photolithography, silanize the final master mold consisting of 3 layers of negative photoresists by dispatching two 100 µL droplets of Trichloro(1H,1H,2H,2H-perfluoro-octyl) silane on each side of the master in a 100-mm Petri dish. Seal the Petri disk with a plastic paraffin film and incubate 20 min at room temperature (RT).\n\t\tNOTE: The master mold is ready and can be used several times.\n2. Fabrication of PDMS chip\nPour 90 g of silicon-based organic polymer (Polydimethylsiloxane: PDMS) into a 100-mL plastic cup. Add 10 g of its curing agent (1:10 in weight). Stir the mixture using a plastic pipette for 2-3 min.\n\tNOTE: Mix 90 g of PDMS with 10 g of curing agent for the fabrication of 6 chips.\nPlace the mixture within a vacuum desiccator and pump for about 30 min to remove air bubbles trapped into the PDMS.\nPlace the master mold in a P100 Petri dish and pour 15 mL of the mixture on the mold using a syringe.\n\tNOTE: 15 mL leads to a total chip height of 1.5 mm.",
    "Place the PDMS-mold structure within a vacuum desiccator and pump until there are no more air bubbles bursting at the surface of the PDMS.\n\tNOTE: This step takes about 30 min.\nPush the wafer at the bottom of the Petri dish using a cone tip to avoid dead PDMS volume below the wafer. Place the PDMS-mold device in the oven set at 70 °C for at least 2 h.\nDemold the PDMS block under a chemical hood using a stainless steel flat spatula and by pouring isopropanol on the chip. Place it on the stainless steel bench of the hood.\nCut around the silicon wafer and demold the PDMS replica using a scalpel.\nCut around (leave a 2-mm margin) the chip using a scalpel or a razor blade.\nPunch inlets by pressing the 1.5 mm diameter puncher firmly and actuate it to cut and carve the hole of the inlet. Do the same at the four dedicated zones of the chip where liquid will be injected.\nClean the chip by sticking and peeling adhesive tape on the microstructured side. Sprinkle isopropanol on both sides. Then dry the chip with pressurized nitrogen using an air blow gun.\n3. Fabrication of patterned coverslips (24 × 24 mm2)\nNOTE: Manipulate coverslips with curved tweezers.\nPoly-ornithine (PLO) patterns\n\t\nApply an O2 cleaning plasma on glass coverslips. Plasma parameters: pumping down pressure: 0.25 mbar; O2 supply duration: 3 min; gas flow: 10 sccm; maximum deviation: ±5 sccm; plasma duration: 3 min; set pressure: 0.36 mbar; maximum deviation: ±0.10 mbar; set power: 50 W; maximum deviation: 5%; venting duration: 45 s.\nMix 484 µL of acetic acid and 56 µL of 3-methacryloxypropyl-trimethoxysilane, complete with absolute ethanol to get a total volume of 15 mL.",
    "Using a 1-mL tip cone, put a drop of 500 µL of this solution on each coverslip, wait for 2-3 min. Dry using a cleanroom microfiber wiper.\n\t\tNOTE: Silanized glass coverslips can be stored up to 1 month at room temperature within plastic boxes sealed with a plastic paraffin film.\nPlace each coverslip on a spin coater located in a clean room environment. Put a drop of a positive photoresist covering about 75% of the coverslip (about 500 µL) and spin-coat at 4000 rpm for 30 s to reach a final thickness of 0.45 µm.\nPlace the coverslips for 1 min on a hotplate with a surface temperature of 115 °C.\nUsing a mask aligner, expose each coverslip at a wavelength of 435 nm (G-line) through the dedicated mask according to the fabricant parameters (UV dose about 50-60 mJ.cm-1)\nPrepare 2 glass crystallizing dishes, one containing the developer (no dilution), the other containing deionized water.\nDive one by one each coverslip in the developer for 1 min while continuously and gently stirring the crystallizing dish. Then submerge the wafer in deionized water for about 5 s. Place the wafer on an absorbent paper and dry it with pressurized nitrogen using an air blow gun.\nApply an activation O2 plasma with the same parameters as in 3.1.1.\nUnder the hood, depose four 170 µL drops of a 100 µg/mL PLO solution per P100 Petri dish. Put the patterned face of the coverslips on each of these drops. Seal the Petri dish with a plastic paraffin film to avoid drying. Incubate overnight at RT.\n\t\tNOTE: The PLO solution should remain attached to the coverslips by capillarity.",
    "Prepare four recipients (typically P60 Petri dishes), fill three of them with PBS and the fourth one with deionized water. Prepare two glass crystallizing dishes of pure ethanol.\nTake out each coverslip from the Petri dishes, submerge it in the first PBS bath for 10-15 s, evacuate the liquid on an absorbing tissue by putting the coverslip vertically on the side, insert it with e.g. the patterned face up inside the ethanol bath.\n\t\tNOTE: Once the dissolution of the photoresist is completed, it becomes difficult to locate the patterned side of the coverslip. Therefore, it is important at this stage to trace its location.\nPlace the ethanol crystallizing dish within an ultrasonic bath sonicator (120 W / 35 kHz) and let the photoresist be dissolved for 3 min.\n\t\tNOTE: Change the ethanol bath every 4 coverslips to limit dilution by the PBS that might impair the dissolution of the photoresist.\nTake out the coverslip from the ethanol bath, then dive it several times into the second PBS bath. Check the surface aspect repeatedly until the greasy-like surface that results from the remaining liquid film of ethanol disappears.\nSubmerge for 5-10 s the coverslip into the third PBS bath. Then immediately transfer it to the deionized water bath. Place the coverslip on an absorbent paper and dry it with pressurized nitrogen using an air blow gun.\n\t\tNOTE: The last rinse in deionized water is used to avoid the formation of PBS crystals during the drying step.\nPhotoresist structures for height calibration\n\t\nPerform only steps 3.1.4. to 3.1.8. using the dedicated mask (mask \"Photoresist stripes\", see Supplementary file \"Mask_Photoresist-stripes.dxf\").\n4. Chip assembling and final implementation\nChip assembling on glass bottom dishes",
    "Put both the PDMS chip and the glass dish on which it will be bonded into the plasma chamber for surface activation. Parameters: pumping down pressure: 0.25 mbar; O2 supply duration: 3 min; gas flow: 10 sccm; maximum deviation: ±5 sccm; plasma duration: 30 s; set pressure: 0.40 mbar; maximum deviation: ±0.10 mbar; set power: 50 W; maximum deviation: 5%; venting duration: 45 s.\nGently put the activated PDMS chip in contact with the glass coverslip, and delicately apply pressure on the edges of the chip to bond the chip to the coverslip. To increase the bonding strength, place the device in the oven at 70 °C for 5 to 10 min.\n\t\tNOTE: Do not press on parts containing pillars, they might collapse under too much pressure.\nUnder the hood (i.e. at RT) and within 30 min after bonding, place a 10-µL tip cone filled with a 100 µg/mL PLO solution at the IHs, then inject the liquid. Adjust the volume in order to form a drop at the top of each IHs. Then, using a 1-mL tip cone, add PBS in the Petri dish all around the chip.\nLet the chip at RT with a minimum of 2 h incubation time. For overnight incubation, seal the Petri dish using a plastic paraffin film to avoid drying.\n\t\tNOTE: The liquid should not leak outside the chip otherwise the chip must be discarded.\nPress a 10-µL tip cone lightly into each IH and suck up the excess of liquid. Then stick completely the tip cone inside the outlet and draw up the remaining liquid.\nReplace PLO by laminin following the instructions given in steps 4.1.5 (emptying) and 4.1.3 (filling). Incubate at RT for 1 h.",
    "Replace laminin by the culture medium following the instructions given in steps 4.1.5 (emptying) and 4.1.3 (filling). Composition of the culture medium: MEM 81.8%; Sodium Pyruvate 100 mM 1%; Glutamax 200 mM 1%; Horse Serum 5%; B27 supplement 2%, N2 supplement 1%, Gentamicin 0.2%; filter the solution using a 220-nm filter. Using a 1-mL tip cone, replace also the PBS surrounding the chip by this medium.\nPut the chip into the incubator regulated at 37 °C and 5% CO2 for at least 5 h (or overnight) before neuron seeding.\nChip assembling using patterned coverslips\n\tNOTE: If the patterned coverslips include positive photoresist reference objects, perform steps 4.2.1 to 4.2.9. Otherwise, perform only step 4.2.3, stick the PDMS device on the PLO patterned coverslip as indicated in 4.1.2, put culture medium inside and around the chip then go to step 4.2.10.\n\t\nDeposit a drop of water on a rectangular thick microscope glass slide and stick the coverslip on the glass slide by capillarity (non-patterned side facing the glass slide). Under a microscope, mark the location of the photoresist stripes at the rear of the glass slide using a felt pen.\nPlace the patterned glass coverslip on the mask holder of the mask aligner. Rely on the mark made with the felt pen to center the photoresist reference objects.\nPerform the plasma step as described in 4.1.1 on the PDMS chip.\nPlace the PDMS chip on the mobile substrate holder (chuck) of the mask aligner.\n\t\tNOTE: To increase optic contrast, place a silicon wafer beneath the PDMS chip. The silicon wafer should remain firmly attached on the chuck during the alignment process (use a transparent tape to stick it to the chuck).",
    "Lift the chuck at the limit of mechanical contact to align the chip with the array of photoresist stripes located on the coverslip.\nAchieve mechanical contact between the chip and the coverslip by finishing up lifting the chuck until the surface of the PDMS pillars touch the glass coverslip.\nLower the chuck. Remove the coverslip now bonded to the chip from the mask holder. Then place the device into a 35-mm Petri dish, and transfer everything into the oven (temperature: 70 °C) for 5 to 10 min to increase the bonding strength.\nPerform as in step 4.1.3.\n\t\tNOTE: if using PLO patterned coverslips, go directly from step 4.2.7 to step 4.2.9.\nReplace PLO by the plating medium following the procedures described in steps 4.1.5 (emptying) and 4.1.3 (filling). Using a 1-mL tip cone, replace also the PBS surrounding the chip by this medium.\nPut the chip into the incubator regulated at 37 °C and 5% CO2 until neuron seeding, with a minimum of 5 h incubation time.\n5. Neuron culture\nPrepare 100 mL of dissection medium (HH medium) by mixing 10 mL of HBSS 10x, 2 mL of Hepes 1 M and 88 mL of sterile water in a 200-mL plastic flask.\n\tNOTE: The HH medium can be prepared the day before the culture.\nDissect hippocampus from E18 mice embryo extracted from a mother euthanized by cervical dislocation (C57BL/6J mice from Charles Rivers). Steps of dissection are e.g. detailed in 16.\nPlace hippocampus in a plastic tube containing trypsin (0.3 mL of trypsin 2.5%, w/o EDTA into 2.7 mL of HH medium) for 10 min at 37 °C in order to initiate chemical dissociation.",
    "Discard almost all the liquid and replace it with 5 to 10 mL of HH using disposable plastic pipettes. Do it 3 times. For the last fill, use 1 mL of plating medium instead of HH.\nMechanically dissociate tissues using a 1 mL tip-cone by aspiring and ejecting the full volume several times, avoiding making bubbles and using no more than 15-20 passages.\nIn a separate 500 µL recipient, prepare a solution using 5 µL of cell suspension diluted in 45 µL of PBS. Take 1 µL of this solution using a 10 µL pipette and insert the diluted suspension into a Malassez cell counter. Use the indications provided in 17 to estimate the number of cells.\n\tNOTE: A single hippocampus usually provides about 0.5 million of neurons.\nCentrifuge at 100 x g for 6 min at RT.\nDiscard the supernatant and replace it by the volume of plating medium required to achieve a concentration of 10 million cells/mL. Resuspend cells by successively aspire and eject the cell suspension with a 1-mL tip cone.\nDraw up the plating medium present in the chip (refer to step 4.1.5). Collect 2-3 µL of the freshly resuspended solution using a 10-µL pipette and inject it at the inlet (refer to the injection procedure described in step 4.1.3). Repeat immediately the same operation at the outlet.\nInject about the same volume of plating medium in each reservoir (refer to step 4.1.3).\n\tNOTE: Quickly observe the chip under the microscope to check the density of cells. The order of magnitude of the optimal cell density corresponds to about 5-10 cells within the square surface delimited by 4 pillars (about 0.3 mm2, i.e. about 15-20 cells per mm2).\nEventually repeat step 5.10 using instead 0.5-1 µL of cell suspension to reach the targeted cell density.",
    "Place the seeded chip into an incubator regulated at 37 °C 5% CO2.\n6. Fluorescence exclusion observation\nReplacement of culture medium by the imaging medium.\n\t\nPrepare the imaging medium as in 4.1.7 but use instead MEM devoid of phenol red and add fluorescent dextran. In that aim, dilute dextran (molecular weight 10,000 g/mol, stock solution concentrated at 10 mg/mL in PBS) in order to achieve a final concentration of 0.5-1 mg/mL in the imaging medium.\n\t\tNOTE: Use Dextran conjugates with Absorption/Emission maxima 496/524 or 650/668. Prefer the first to image 0.45 µm high positive photoresist structures (to get rid of their auto fluorescence in the red bandwidth) and the second to image neurons (less toxic).\nEmpty all inlets using a 10-µL pipette and re-fill them completely with the imaging medium (refer to steps 4.1.3 and 4.1.5 for the precise methodology of medium replacement).\nImaging\n\t\nPlace the chip under an epifluorescence microscope equipped with an environmental chamber regulated at 37 °C and 5% of CO2. Use a 40X, numerical aperture (NA) 0.8 dry objective, 30% of full power (full power: 3 W) and 30 ms of exposure time. Acquire images of cells at focus (from single to multiple successive images in case of time-lapse experiments).\nImage analysis\n\t\nNormalize images using the background reduction routine implemented in dedicated software to get a homogeneous background. See 13 for the details of the image processing steps included in this software. The output image has a .MAT format.\nConvert .MAT file into .TIFF 8 bits images using the routine put in supplementary material (conversion_mattotiff.m, which calls for importfilevol.m).\nPerform Import > Image Sequence on ImageJ to build a video from the .TIFF images.",
    "Compute the mean intensity P of a square area localized in the center of a pillar (reference object) and the mean intensity B of a square area of the chamber devoid of cells (background, i.e. height zero). See 18 for an example of detailed methodology of image processing.\n\t\tNOTE: The lateral dimension of the square areas used as intensity references must be about half of the pillar diameter to get a sufficient number of pixels while avoiding light pollution from the pillar edges.\nUse the P and B values to establish the linear conversion law from intensity i to height h:\nimgsrc://cloudfront.jove.com/files/ftp_upload/56923/56923eq2.jpg\n\t\twith hc the known height of the chamber, imgsrc://cloudfront.jove.com/files/ftp_upload/56923/56923eq3.jpg and imgsrc://cloudfront.jove.com/files/ftp_upload/56923/56923eq4.jpg\n\t\tNOTE: PDMS displays no detectable autofluorescence.\nSelect an area around the zone of interest, integrate intensity using ImageJ (see 19 for more details) and apply the conversion law obtained in 6.3.5 to measure the volume of a cell compartment.\n\t\tNOTE: The zone of interest might be selected based on the fluorescence of sub-cellular elements like actin, e.g., for the selection of growth cones in GFP-LifeAct neurons, select the zone of interest in the GFP emission channel, save the contour of this zone using a ROI manager tool, then measure the cell volume enclosed within the same zone in the emission channel of dextran (in red)."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}