{
  "id": 18012,
  "origin_website": "Jove",
  "title": "Oleic Acid-Injection in Pigs As a Model for Acute Respiratory Distress Syndrome",
  "procedures": [
    "All animal experiments described here have been approved by the institutional and state animal care committee (Landesuntersuchungsamt Rheinland-Pfalz, Koblenz, Germany; approval number G14-1-077) and were conducted in accordance with the guidelines of the European and German Society of Laboratory Animal Sciences. The experiments were conducted in anesthetized male pigs (sus scrofa domestica) of 2-3 months age, weighing 27-29 kg.\n1. Anesthesia, Intubation and Mechanical Ventilation\nWithhold food for 6 h before anesthesia to reduce the risk of aspiration but allow free access to water to reduce stress.\nFor sedation, inject a combination of Ketamine (4 mg kg-1) and Azaperone (8 mg kg-1) in the neck or the gluteal muscle of the pig with a needle for intramuscular injection (20 G) while the animal is in the animal box.\n\tCaution: Use gloves when working with the animal.\nInsert peripheral vein catheter (20 G) in an ear vein after local disinfection with alcohol.\nInject fentanyl (4 µg kg-1), propofol (3 mg kg-1) and atracurium (0.5 mg kg-1) intravenously for the induction of anesthesia.\nWhen the pig stops breathing, place it in supine position on the stretcher and immobilize it with bandages.\nStart monitoring the peripheral oxygen saturation (SpO2) by clipping the sensor on to one of the ears or the tail of the animal.\nVentilate the pig with a mask for ventilating dogs, size 2, with a peak inspiratory pressure below 20 cm H2O, a positive end expiratory pressure (PEEP) of 5 cm H2O, a respiratory rate of 14-16 /min and an inspiratory oxygen fraction (FiO2) of 1.0.\nStart a continuous infusion with balanced electrolyte solution (5 mLkg-1 h-1), propofol (8-12 mg kg-1 h-1) and fentanyl (0.1-0.2 mg kg-1 h-1) to maintain anesthesia.",
    "For the intubation, prepare a common endotracheal tube suitable for the animal (e.g., weight of 25-30 kg, endotracheal tube internal diameter (ID) 6-7mm) armed with endotracheal tube introducer and a common laryngoscope with a Macintosh Blade 4.\n\tNOTE: Two people are necessary for the intubation.\nPerson 1: Pull out the tongue with one hand and press the snout dorsally with the other.\nPerson 2: Insert laryngoscope and advance it as usual until the epiglottis comes into view.\nPull the laryngoscope ventrally to visualize the vocal cords.\n\tNOTE: Sometimes the epiglottis \"sticks\" to the soft palatine. In this case, mobilize it with the tip of the tube.\nInsert the tube through the vocal cords and pull out the introducer.\nBlock the cuff of the tube with a syringe with 10 mL of air.\nConnect the tube to the ventilator.\nCheck for the correct positioning of the tube by regular exhalation of carbon dioxide (CO2) with capnography and equal ventilation of both lungs with auscultation.\nStart mechanical ventilation (tidal volume 6-8 mL/kg, positive PEEP 5 cm H20, FiO2 to keep peripheral oxygen saturation (SpO2) between 94 – 98%17, respiratory rate to keep end tidal pressure of carbon dioxide (etCO2) between 35 – 45 mmHG).\n2. Instrumentation\nRetract the hindlegs with bandages to stretch the skin above the femoral area for catheterizing necessary vessels.\nPrepare a 5 mL syringe, a 10 mL syringe, a Seldinger's needle, 3 introducer sheaths (5 Fr, 6 Fr, 8 Fr) with guidewires, a central venous catheter with 3 ports (7 Fr, 30 cm) with guidewire and a pulmonary artery catheter (7,5 Fr, 110 cm).\nGenerously disinfect the femoral area with skin disinfectant applying a wipe down technique.\nCompletely fill the catheters with saline.\nPlace the ultrasound-probe on the right inguinal ligament and scan for femoral vessels.",
    "Turn the probe 90° to fully visualize the femoral artery in the long axis.\nCannulate right femoral artery under in-line ultrasound visualization with the Seldinger's needle.\n\tNOTE: There are different ways to gain vascular access with or without ultrasound. Ultrasound-guided vascular cannulation is not necessary for this model.\nWhen pulsating bright blood flows out, introduce the guidance wire and retract the needle.\nVisualize the femoral vein and cannulate the vein under in-line ultrasound visualization and continuous aspiration with the needle.\nWhen venous blood is aspirable, disconnect the syringe and insert the guidance wire.\nRetract the needle.\nCheck the position of the wires with ultrasound.\nInsert the arterial introducer sheath (5 Fr) and central venous catheter using Seldinger's technique (for details on Seldinger's technique, refer to published method18).\nRepeat the arterial and venous puncture on other side and insert the introducer sheaths using Seldinger´s technique as described above (artery 6 Fr, vein 8 Fr).\nConnect the arterial introducer sheath and central venous catheter to a transducer system suitable to the monitoring equipment.\nCalibrate the invasive monitoring against atmosphere (zero) by opening the three-way-stopcocks to the atmosphere and press Zero all on the monitor.\nTurn the three-way-stopcocks back to measure hemodynamics.\nStart monitoring hemodynamics.\nPlace all pressure transducers at the height of the right atrium.\nSwitch the infusion of propofol (8-12 mg kg-1 h-1) and fentanyl (0.1-0.2 mg kg-1 h-1) to one of the ports of the central venous line to maintain anesthesia.\n3. Ultrafast Measurement of Partial Oxygen Pressure (pO2)\nNOTE: The measurement of pO2 with the probe for ultrafast pO2-measurement is not obligatory but helps visualizing the real-time changes in pO2.\nOpen software NeoFox viewer and click Options.\nChoose the Calibration tab and click the Open Calibration button.\nChoose calibration file and click Open and Download.",
    "Confirm the pop-up window by clicking Yes.\nOpen the Options dialogue.\nChoose the Calibration tab and click Single point calibration.\nEnter 21% in the field Oxygen and the temperature in the field Temperature.\nClick Use current Tau and Download. Afterwards, confirm the pop-up window by clicking Yes.\nInsert the probe for ultrafast measurements of pO2 through the left arterial introducer sheath.\n4. INSERTING PULMONARY ARTERY CATHETER\nCheck the balloon of pulmonary artery catheter for damage.\nConnect to the transducer system suitable to the monitoring equipment.\nCalibrate the pulmonary arterial pressure monitoring against the atmosphere (zero) by opening the three-way-stopcock to the atmosphere and press Zero on the monitor.\nTurn the three-way-stopcock back to measure pulmonary arterial pressure.\nStart monitoring the pulmonary arterial pressure.\nInsert the pulmonary artery catheter through the left venous introducer sheath (balloon deflated).\nWhen the pulmonary artery catheter has passed through the introducer sheath, inflate the balloon with 1 mL of air.\nAdvance the pulmonary artery catheter and monitor the typical waveforms (venous vessels, right atrium, right ventricle, pulmonary arteria, and pulmonary capillary wedge pressure). Deflate the balloon and check, if it is possible to aspirate blood through all ports of the pulmonary artery catheter.\n\tNOTE: For detailed instruction on how to insert pulmonary artery catheter, refer to previous publication19.\n5. Induction of Lung Injury\nPrepare oleic-acid solution: 0.1 mL kg-1 of oleic acid in a 20 mL syringe and connect it to a 3-way-stopcock.\nTake 2 mL of blood in another 20 mL syringe and add saline to a total volume of 20 mL in both syringes.\nConnect the second syringe also to the 3-way-stopcock.\n\tCAUTION: Use gloves and eye protection when working with oleic acid.\nPrepare norepinephrine (0.1 mg/mL) for continuous infusion and for bolus injection (10 µg/mL).",
    "Connect the norepinephrine syringe pump to one of the ports of the central venous catheter without starting it.\nStart the ultrafast pO2-measurement.\nBefore the induction of lung injury, record the values (baseline) from all relevant parameters.\nSet the FiO2 to 1.0 and conduct a lung recruitment maneuver (plateau pressure 40 cm H2O for 10 s).\nConnect the 3-way-stopcock to the proximal port of the pulmonary artery catheter.\nMix the oleic acid and the blood/saline mixture thoroughly by injecting it repetitively from one syringe into the other via the 3-way-stopcock and keep mixing all the time.\nWhen it is a homogenous emulsion, inject 2 mL of the emulsion and continue mixing.\n\tNOTE: If mixing is stopped, the emulsion may separate into a lipophilic and a hydrophilic part.\nClosely monitor the hemodynamics after the injection of oleic acid and keep the norepinephrine at hand. If necessary, give norepinephrine as bolus injection (10 – 100 µg) or continuous infusion to keep mean arterial pressure above 60 mmHg.\nRepeat the injection of 2 mL of the solution every 3 min until the arterial partial pressure of oxygen (PaO2)/FiO2-ratio is below 200 mmHg.\nIf the syringe is empty before the PaO2/FiO2-ratio is between 100 and 200 mmHg, prepare 2 more syringes as described in step 5.1.\nWait 30 min and re-evaluate the PaO2/FiO2-ratio. If it is still over 200 mmHg, repeat steps 5.5-5.8 until PaO2/FiO2-ratio falls between 100 and 200 mmHg.\nIf PaO2/FiO2-ratio is between 100 and 200 mmHg, wait for 30 min and check again.\nIf it is persistent below 200 mmHg start experiment/treatment, otherwise prepare 2 more syringes as described in step 5.1 and repeat steps 5.5-5.9.\nSet the ventilation according to the suggestions from the ARDS network20.\n6. End of Experiment and Euthanasia",
    "Inject 0.5 mg of fentanyl additionally to the continuous anesthesia and wait for 5 min. Inject 200 mg of propofol and 40 mmol of potassium chloride to euthanize the animal in deep anesthesia.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}