{
  "id": 4619,
  "origin_website": "Bio",
  "title": "Macrophage Phagocytosis Assay of <em>Staphylococcus aureus</em> by Flow Cytometry",
  "procedures": [
    "Differentiation of bone-marrow derived macrophage (BMDM)   Euthanize three mice by CO2. Sterilize the abdomen and hind legs of the mice with 70% ethanol.    Make an incision in the midline of the abdomen, and expose the hind limbs by clipping outward. Remove all muscle from the bones and cut bones at both ends.    Flush out bone marrow progenitor cells from bones using DPBS by syringe with a 26G needle. Flush 3-5 times for each bone by 2 ml DPBS. Spin down cells in Sorval RT7 centrifuge (4 °C, 1,500 rpm, 5 min).    After aspirating out the supernatant using vacuum suction, treat cells by 5 ml ACK lysis buffer to lyse the erythrocytes (1 min, room temperature).    Next, add 45 ml of DPBS to the lysed cells to balance the osmotic pressure.    Spin cells down again, count cells by hemocytometer, and adjust them to a concentration of 5 x 105 cells/ml in BMM medium. Seed 10 ml cells in each 10-cm tissue culture dish. Expect to yield 1 x 108 of bone marrow cells from three mice.   Culture the cells for 3 days in CO2 incubator at 37 °C. Then change for fresh BMM medium and culture for another 4 days (10 ml/dish).    The macrophages are now ready for functional assay.    Place the dishes in a sterile tissue culture hood, and wash the dishes twice with 5 ml cold DPBS.    Add 2 ml 5 mM-EDTA (room temperature) to each dish and wait around 5 min to detach the cells. Add 5 ml D10 to each dish and harvest all the cells. Expect to yield ~5 x 106 of BMDMs per dish.   Using this preparation, more than 95% of the differentiated cells should be macrophages based on F4/80 and CD11b expression. Analyze the expression of these markers by routine flow cytometry techniques.",
    "Choose different dyes for each marker (e.g. FITC for F4/80 and APC for CD11b).      Culture of S. aureus to exponential period   One day before the experiment, inoculate S. aureus into 3 ml TSB in a bio-safety cabinet and culture the bacteria overnight in a bacterial incubator shaker (37 °C, 225 rpm). S. aureus is a bio-safety level 2 pathogen which can cause severe human infections.    On the next morning, dilute 100 μl overnight culture into 10 ml new TSB. The approximate OD600 is around 0.1. Shake the bacteria approximately 2 hours until OD600 reach around 0.8 (37 °C, 225 rpm). OD600 of 1.0 is approximately 1.5 x 109 CFU/ml.   Spin down the bacteria (4 °C, 3,000 rpm, 10 min) and wash twice with 50 ml cold DPBS.   Adjust bacterial concentration to 5 x 108/ml in DPBS. Place the bacteria on ice before assay.      Stain S. aureus with Hexidium Iodide   Aliquot 1 ml S. aureus (5 x 108/ml) into a 50 ml Corning tube.   Add 20 μl Hexidium Iodide stock and mix it well.    Incubate the bacteria for 15 min in darkness (room temperature).    Wash twice with 50 ml cold DPBS (4 °C, 3,000 rpm, 10 min).    Re-suspend the bacteria in BMM medium at the concentration of 2 x 107/ml. The bacteria are ready for assay. Use them right away.      Macrophage phagocytosis assay One day before the assay, seed 2 x 106 BMDMs into single wells in a 6-well plate. Apply the multiplicity of infection (MOI) 10 for S. aureus infection.    Briefly, on the day of assay remove the old medium and replace it with new BMM medium containing S. aureus (2 x 107/ml) to each well.    Quickly spin the 6-well plate (room temperature, 500 rpm, 5 min).",
    "Incubate the cells in a CO2 incubator for 30 min to allow bacterial uptake by BMDMs.    Then add 200 μl cold Trypsin-EDTA to the cells and incubate for 10 min at room temperature without agitation to remove residual bacteria at macrophage surface.  Note: Trypsin-EDTA solution treatment is to remove the excess bacteria. Prolonged treatment may also affect BMDM adherence, so the treating time shouldn’t exceed 10 min. Trypsin-EDTA treatment will not interfere with F4/80 analysis.    Wash the plate three times with DPBS, using 2ml DPBS for each wash.    Add 0.5 ml 5mM-EDTA (room temperature) to the well to detach the cells in about 5 min and then 2 ml D10. Harvest the BMDMs by spinning (4 °C, 1,500 rpm, 5 min). Wash cells in 50 ml DPBS and re-suspend cells in 10 ml D10. Count the cells by hemocytometer.      Stain macrophages with FITC-anti-mouse-F4/80   Add 1 x 106 BMDMs from procedure D to 5 ml flow cytometry tube and spin down in Sorval RT7 centrifuge (4 °C, 1,500 rpm, 5 min). Aspirate the supernatant. Re-suspend cells in 100 μl DPBS. Three additional control tubes are required for flow cytometry analysis, including one blank tube without fluorescence dye, one FITC-anti-mouse-F4/80 single staining tube and one Hexidium Iodide single staining tube.   Add 1 μl FITC-anti-mouse-F4/80 to the tube following manufacturer’s instruction (final concentration: 5 μg/ml). And incubate 20 min in darkness without agitation (room temperature).    Then add 500 μl DPBS. The cells are ready for flow cytometry assay.      Flow cytometry Routine flow cytometry techniques are applied for phagocytosis analysis following manufacturer’s instruction. In a FACSCanto machine, the fluorescence produced from Hexidium Iodide staining falls into FL2 channel (Excitation 488/Emmision 575) and fluorescence produced from FITC staining falls into FL1 channel (Excitation 488/Emmision 519). Results can be analyzed by FlowJo.",
    "The performer should be familiar with FlowJo software to analyze 4-color flow cytometry data. Briefly, open the flow cytometry data in FlowJo software. First, plot FSC and SSC in X-axis and Y-axis. Then gate single live cells. Finally plot FITC and PE in X-axis and Y-axis of the single live cells.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150215/20150215171200_1659.jpg Figure 1. Practical example of a bone marrow-derived macrophage (BMDM) phagocytosis experiment. Blank: BMDMs without both FITC-anti-F4/80 staining and bacterial uptake. FITC: BMDMs with FITC-anti-F4/80 staining but without bacterial uptake. Hexidium Iodide: BMDMs with bacterial uptake but without FITC-anti-F4/80 staining. BMDM-phagocytosis: BMDMs with both FITC-anti-F4/80 staining and bacterial uptake."
  ],
  "subjectAreas": [
    "Microbiology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}