{
  "id": 17555,
  "origin_website": "Jove",
  "title": "Spot Variation Fluorescence Correlation Spectroscopy for Analysis of Molecular Diffusion at the Plasma Membrane of Living Cells",
  "procedures": [
    "1. Setting specification for assembling a custom-made svFCS setup\nNOTE: The simplicity of the proposed svFCS setup allows easy installation, operation, and maintenance at a low cost while ensuring efficiency in photon recovery. For more details, see Supplementary material.\nExperimental room and safety\n\t\nInstall the system in a room stabilized at around 21 °C.\nAvoid direct airflow on the passive (or active) optical table and follow the laser safety rules for optical alignment.\nHardware and software\n\tNOTE: Supplementary material details the installation steps depicted in Figure 2.\n\t\nWrite the main acquisition and control software in LabVIEW using a state machine and event structure architecture where a multifunction acquisition board drives most of the controllers.\n\t\tNOTE: The correlator, laser, and power meter are controlled or monitored by their own software.\nAdapt the hardware and software installation procedures according to the hardware used.\nOptical setup\n\tNOTE: Figure 3 illustrates the optical bench modules used in the following sections to control the quality of the optical alignments. All of the optical element specifications are listed in Table of materials. The procedure to build the setup is widely detailed in Supplementary material. This system comprises a continuous wave laser, a motorized inverted microscope equipped with an immersion water objective, an avalanche photodiode detector coupled to a single photon counting module, and a hardware correlator. A microscope incubation chamber with vibration-free heaters has been specially designed to control the temperature for experiments on living cells. By convention, the XY axis corresponds to the optical path's perpendicular plane, and the Z-axis corresponds to the optical path.\n2. Daily checkpoint before running the experiment\nControl the excitation path (Figure 3, imgsrc://cloudfront.jove.com/files/ftp_upload/61823/61823equ03v2.jpg & imgsrc://cloudfront.jove.com/files/ftp_upload/61823/61823equ04v2.jpg).\n\t\nOpen all the iris diaphragms.\nMeasure the laser power with the power meter, keeping the first iris fully open.",
    "Turn the half-wave plate (HWP) to find the maximum power.\nCheck the alignment using the irises if the laser power is lower than usual, and move L1 and M1 alternately, if necessary.\nNote the power value in the experiment laboratory notebook.\nControl the detection path (Figure 3, imgsrc://cloudfront.jove.com/files/ftp_upload/61823/61823equ05v2.jpg & imgsrc://cloudfront.jove.com/files/ftp_upload/61823/61823equ06v2.jpg).\n\t\nPlace the water, a coverslip, and a droplet of a 2 nM rhodamine 6G (Rh6G) solution on the objective.\nIf the fluorescence signal (count number on the APD, recorded with the LabVIEW software) is lower than usual, remake the Rh6G solution, check the positioning and the coverslip's number on the objective lens, or eliminate bubbles, if any.\n\t\t\nIf the fluorescence signal is still lower than usual, place the power meter inside the optical path to block the beam.\nTurn off the APD (hereafter, APD refers to the APD and the single photon counting module).\nRemove the sample.\nClean and replace the objective lens with a reflective target.\nCheck the laser beam on the reflective target by removing the power meter from the light path. Make sure that the target's beam is centered, and the back reflection reaches the first iris on the line imgsrc://cloudfront.jove.com/files/ftp_upload/61823/61823equ04v2.jpg (Figure 3).\nIf not, adjust the center positioning with M2 or the back reflection with the dichroic mirror.\nIf microscope coupling is correct, push the objective lens back, add a drop of water, a coverslip, and a droplet of a more concentrated Rh6G solution (i.e., 200 nM), and set a lower laser power than for the classical measurements (few µW).\nTurn on the APD and optimize APD and pinhole alignment, alternately, with their respective XYZ adjustment screws while monitoring the intensity signal (LabVIEW software).",
    "Change the coverslip and add a lower concentration of Rh6G (2 nM). Move the pinhole along the Z-axis to find a position where the molecular brightness ratio increases, and the waist is minimum.\nClose the iris until the signal drops down: the laser beam size reaches the back aperture size of the objective (i.e., the minimal waist size, see Supplementary material).\nLaunch the correlator software and record data (see section 7 for data recording).\nCheck the ACF, which should display a low amount of noise, give a small waist size, and a high count-rate per molecule per second (see section 7 for data analysis and waist size evaluation).\n3. General considerations for svFCS data recording and analysis\nRecord and analyze the fluorescence data following this general scheme (see sections 7, 8, and 9): (1) fluorescence recording and ACF generation (correlator software), (2) unexpected discarding of data, an average of retained data, fitting with the appropriate model (with homemade Igor Pro software), (3) diffusion law plot (homemade MATLAB software 1), and (4) optional diffusion law comparison (homemade MATLAB software 2). The different software programs are available upon request.\n\tNOTE: The hardware correlator has a minimum sampling time of 12.5 ns (i.e., a sampling frequency of 80 MHz). It provides a temporal resolution that is at least 1,000 lower than the typical resident time of freely diffusing small molecule in solution and 106 smaller than the diffusion time of membrane proteins within a confocal observation volume.\n4. Cell culture and transfection\nSeed the Cos7 cells in 8-well chambered coverglass with #1.0 borosilicate glass bottom at a density of 10,000 cells/well using complete Dulbecco's Modified Eagle Medium (DMEM) supplemented with 5% fetal bovine serum, penicillin (100 U/mL), streptomycin (100 U/mL), and L-glutamine (1 mM).",
    "Culture the cells at 37 °C in a humidified atmosphere containing 5% CO2 for 24 h.\nRemove the medium, add 300 µL of the fresh complete culture medium per well, and preincubate the cells for 30 min at 37 °C.\nDilute 0.5 µg of the plasmid DNA encoding Thy-1 protein fused with eGFP25 in 50 µL of serum-free DMEM. Vortex briefly to mix.\nDilute 1.5 µL of the DNA transfection reagent in 50 µL of serum-free DMEM, and mix the solution well.\nAdd the diluted transfection reagent directly into the prepared DNA solution, and mix the compounds immediately.\nIncubate the prepared mixture for 10 to 15 min at room temperature.\nAdd 10 µL of the combined DNA/transfection reagent complexes dropwise onto the medium in each well, and homogenize by gently swirling the plate.\nIncubate the cells at 37 °C with 5% CO2 for 3 h.\nAfter the incubation, replace the medium containing DNA/transfection reagent complexes with 400 µL of fresh complete DMEM, and culture the cells for 16 h before the svFCS experiment.\n5. Preparation of cells for svFCS measurements\nRemove the culture medium.\nWash the cells gently two to three times with serum-free Hank’s balanced salt solution (HBSS) buffer containing Ca2+ and Mg2+ supplemented with 10 mM (4-(2-hydroxyethyl)-1-piperazineethanesulfonic acid) (HEPES), pH 7.4 (HBSS/HEPES).\nMaintain the cells in HBSS/HEPES buffer during all svFCS acquisitions.\n6. Pharmacological treatment\nRemove the culture medium, and wash the cells two to three times with serum-free HBSS supplemented with 10 mM HEPES, pH 7.4 (HBSS/HEPES).\nIncubate the cells with 1 U/mL of cholesterol oxidase (COase) solution in HBSS/HEPES buffer for 1 h at 37 °C.\nRemove the solution, and maintain the cells in the presence of 0.1 U/mL of COase in HBSS/HEPES buffer while performing the svFCS measurements.\n7. Spot size calibration",
    "Prewarm the microscope chamber at 37 °C.\nPrepare a standard 2 nM solution of Rh6G by serial dilution.\nDrop 200 µL of 2 nM Rh6G solution on a glass coverslip placed on the water-immersion objective.\nStart all the hardware and software.\nMeasure and adjust the 488 nm laser beam power to 300 µW. Depending on the brightness and the photo-stability of the fluorescent probe used, adapt this power according to (1) the fluorescence intensity (on the LabVIEW software), which should be stable, (2) the ACF shape (on the correlator software), which should have a constant shape over the time, and (3) the fitting parameters giving a small waist size and a high count rate per molecule (photons per molecule per second, typically few tens to hundreds of photons per molecule per second).\n\tNOTE: The amplitude of the ACF (called G(0)) is inversely proportional to the number of the molecule (i.e., the concentration of the fluorescent probe). For the waist size calibration, this is a good quality control candidate parameter. Therefore, G(0) should be similar for the same concentration from day to day as it links the waist size and concentration. For cell measurements, as FCS is more accurate for low concentration, G(0) should be high for the proper parameter fitting extraction.\nSet the svFCS illumination/detection microscope port with the LabVIEW software.\nTurn on the APD.\nClose the iris until the signal drops down to obtain the minimal waist size, or close it for bigger waist size.\nRecord several ACFs of selected duration (namely a run) to improve statistical reproducibility, typically 10 runs lasting for 20 s each with the correlator software.\nTurn off the APD.",
    "Use the Igor Pro software to check and discard the runs with strong fluctuations due to molecular aggregates. Perform this step manually— it should be user-independent after users have been trained.\nFit the average of the retained ACFs with a 3D diffusion model.\nExtract from the fitting parameters the average diffusion time imgsrc://cloudfront.jove.com/files/ftp_upload/61823/61823equ02.jpg and save it into a “.txt” file (the file format is dictated by the Igor Pro software).\nCheck the count-rate per molecule per second (a good performance indicator) by dividing the average intensity (extracted from the fluorescence trace) by the number of molecules (extracted from the ACF).\n\tNOTE: Make sure that this value is high and stable from day to day for the same acquisition parameters.\nKnowing the diffusion coefficient of Rh6G in aqueous solution at 37 °C (D) and imgsrc://cloudfront.jove.com/files/ftp_upload/61823/61823equ02.jpg (see 7.13), calculate the experimental waist size ω according to: imgsrc://cloudfront.jove.com/files/ftp_upload/61823/61823equ01.jpg.\nApply the procedure for every waist size modification required to plot the FCS diffusion law and before any new experimental series of svFCS data acquisition.\n8. svFCS data acquisitions on cells\nMeasure and adjust the 488 nm beam power between 2 and 4 µW. Depending on the brightness and the photostability of the fluorescent probe used, adapt this power to allow a high count rate per molecule (typically several thousand of photons per molecule per second), while keeping the photobleaching low (i.e., a stable intensity trace on the LabVIEW software).\nEquilibrate samples for 10 min at 37 °C before starting the measurements.\nSet the epi-fluorescence illumination microscope with the LabVIEW software.\nChoose a cell with an appropriate fluorescent probe location and (low) fluorescence signal intensity.\n\tNOTE: The lower the fluorescence is, the better the FCS measurements are (see step 8.1).\nSet the svFCS illumination/detection microscope port with the LabVIEW software.\nTurn on the APD.",
    "Perform an xy-scan of the selected cell with the LabVIEW software.\nPerform a z-scan and locate the confocal spot at the maximal fluorescence intensity by choosing the plasma membrane at the top and start the data acquisition. To maximize the separation between the two membranes, preferably perform the scan in the nuclear area of the cell.\nRecord one series of 20 runs lasting for 5 s, each with the correlator software.\n\tNOTE: Make sure that the duration of each run is long enough to obtain ACFs with reduced noise. Long acquisitions are susceptible to photobleaching or unexpected substantial variations (e.g., aggregates). Adapt the number of runs, their duration, and the number of series to the samples, but make sure that they remain constant within the same bulk of experiments for reproducibility.\nTurn off the APD.\nDiscard unexpected runs with the Igor Pro software.\nFit the average ACF with a 2-species 2D diffusion model. Adapt this model to the type of diffusion behavior of the target molecule.\nSave the fitting parameters into the previous file (see step 7.13).\nPerform 10 to 15 series of recordings on at least 10 different cells, and reproduce steps 8.3 to 8.13. Check that the single file obtained contains the waist size information and the fitting parameters of the 10–15 recordings.\nTo establish a single diffusion law, analyze at least four waist sizes varying between 200 and 400 nm. This range is defined by the diffraction optical limit, but is objective- (numerical aperture) and laser (wavelength)-dependent.\n\tNOTE: As the waist size calibration is not absolute and has some degree of uncertainty, a dedicated MATLAB software28 accounting for the x and y error (namely ω2 and td) was built to fit the diffusion law.",
    "Start the MATLAB software 1 and select a folder containing all the “.txt” files corresponding to at least four waist size experiments.\nPlot <td> versus <ω2>, namely the diffusion law. Two major parameters can be extracted: the y-axis intercept (t0) and the effective diffusion coefficient (Deff, inversely proportional to the slope).\n9. Diffusion laws of different experimental condition comparison\nNOTE: If necessary, reproduce sections 7 and 8 for different experimental conditions. A dedicated software (MATLAB software 2) was developed to determine whether these diffusion laws are similar or not according to the t0 and Deff values28. It tests two hypotheses: the two values are different, or the two values are not different at a threshold set above a probability of false alarm (PFA). An arbitrary PFA value of 5% (T = 3.8) is considered the upper limit of significance between two parameters (t0 or Deff), indicating that there is only 5% chance that the two values are identical.\nCreate an “.xls” file containing the characteristic diffusion law values of each condition to compare (i.e., a file containing the t0, t0 error, Deff and Deff error for the non-treated (NT) and treated (COase) conditions as a table).\n\t\nStart the MATLAB software 2.\nSelect the “.xls” file.\nAnalyze the generated color-coded 2D plot, where the t0 and Deff statistical tests are to be plotted on the x- and y-axes, respectively (Figure 4). The higher T is, the greater is the difference between the compared values.\n10. Cholesterol concentration measurements\nCell treatment and lysis\n\t\nSeed the Cos7 cells in triplicate in 6-well plates at 4 × 105 cells/well and incubate in 2 mL of complete DMEM at 37 °C with 5% CO2 overnight to allow the cells to attach to the plate.",
    "Remove the culture medium and wash the cells three times with phosphate-buffered saline (PBS).\nAdd 1 mL of HBSS/HEPES buffer containing (or not, for controls) 1 U/mL of Coase, and incubate for 1 h at 37 °C with 5% CO2.\nReplace the medium with 1 mL of HBSS/HEPES containing 0.1 U/mL of Coase, and incubate for 1 h at 37 °C with 5% CO2.\nRemove the solution and harvest the cells.\nWash the cells three times with PBS, and centrifuge at 400 × g for 5 min at room temperature.\nLyse the cells with radioimmunoprecipitation assay buffer (25 mM HEPES, pH 7.4, 150 mM NaCl, 1% NP40, 10 mM, MgCl2, 1 mM ethylenediamine tetraacetic acid, 2% glycerol, protease and phosphatase inhibitor cocktail) for 30 min on ice.\nCentrifuge the lysates at 10000 × g for 10 min at 4 °C and collect the supernatant.\nQuantify total protein concentration for each sample by modified Bradford's protein assay using the working solution according to the manufacturer's recommendations.\nCholesterol concentration measurement\n\t\nTo determine total cellular cholesterol level enzymatically, use the appropriate kit (e.g., Amplex Red Cholesterol Assay Kit) according to the manufacturer's recommendations.\nFor each reaction, mix the sample containing 5 µg of protein with Amplex Red reagent/horseradish peroxidase/cholesterol oxidase/cholesterol esterase working solution, and incubate for 30 min at 37 °C in the dark.\nMeasure the fluorescence using excitation of 520 nm, and detect the emission at 560–590 nm using a microplate reader.\nSubtract the background from the final value, and determine cholesterol concentration using a standard curve.\nCalculate the final cholesterol content in ng of cholesterol per µg of protein."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}