{
  "id": 2836,
  "origin_website": "Cell",
  "title": "A protocol for collection and infusion of cerebrospinal fluid in mice",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nSet up procedure room for CSF collection\nTiming: 45 min\nThis section describes the preparation of the stereotactic instrument and glass capillaries for CSF collection.\nDisinfect procedure area with 70% ethanol.\nSet down area mats.\nFix attachments to stereotactic instrument:\nAttach anesthesia tubes to the nose cone.\nAttach blunt retractors to the stereotactic instrument with Elastomer as shown in Methods video S1[href=https://www.wicell.org#mmc1].\nAttach arm with the capillary holder at a 90-degree angle to the nosecone; adjust arm using the Allen wrench if necessary (Figure 1[href=https://www.wicell.org#fig1]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2340-Fig1.jpg\nFigure 1. Surgery set up\n(A) Stereotactic set up for CSF collection to step 3 “set up procedure room for CSF collection[href=https://www.wicell.org#sec3.1]”. A- Anesthesia tubes attached to the nose cone. B- Blunt retractors. C- Arm with a capillary holder. D- Ear bars.\n(B and C) Capillary Before (B) and after (C) trimming with scissors in reference to step 4 “set up procedure room for CSF collection[href=https://www.wicell.org#sec3.1]”. Scale bar represents 0.5 cm.\nLook through a magnifying lamp and use scissors to trim the tip of the pulled glass capillary to achieve an inner diameter of 0.25 mm as shown in Figures 1[href=https://www.wicell.org#fig1]B and 1C.\nCritical: Make sure that the cut capillary end is flat. If there are uneven sharp ends, tap it gently against the flat surface of the scissors to flatten it.\nFix a trimmed capillary to the bottom of the instrument’s arm so that it is horizontal. Attach the aspirator tube to the untampered back end of the pulled glass capillary.\nSet aside a 20 μL micropipette set to 20 μL and a 200 μL micropipette set to 200 μL both with the corresponding tip attached.\n    Your browser does not support HTML5 video.",
    "Methods video S1. Attaching blunt retractors to the stereotactic instrument with Elastomer, in reference to step 3b “Set up procedure room for CSF collection”\nAnesthesia for CSF collection\nTiming: 3 min\nIn this section, we will anesthetize the mouse by exposing it to isoflurane.\nTurn on isoflurane for the induction chamber at 3% isoflurane at 0.5 L/min.\nTransfer mouse to the isoflurane chamber.\nWait for ∼2 min until the mouse’s breath is slow, at least 1 s per breath.\nEnsure the animal is adequately anesthetized by testing the hindlimb pedal withdrawal reflex. If the foot pad pinch causes a response, keep the mouse in the chamber for an additional 30 s and re-test reflex again. Quickly follow the steps below to avoid the mouse gaining consciousness.\nFixation to stereotactic instrument for CSF collection\nTiming: 2–3 min\nIn this section, we will fix the mouse to the stereotactic instrument; isoflurane will be delivered through the nosecone to maintain anesthesia and the ear bars will hold the head in place for the surgery.\nConcurrently, turn off isoflurane to induction chamber and turn on isoflurane to the stereotactic instrument at 2–3% isoflurane at 0.5 L/min.\nQuickly remove mouse from the induction chamber.\nGrip the mouse by the scruff with your non dominant hand. Using your dominant hand, open the animal’s mouth with blunt forceps.\nGently slide the animal’s mouth onto the mouthpiece.\nSlide and secure the nosecone onto the nose, making sure the nosecone fits snugly on the nose (pushing mouse’s whiskers back).\nNote: Steps 12 through 15 are shown in Methods video S2[href=https://www.wicell.org#mmc2].\nUse the lever behind the nosecone to move mouse’s head up, stop when the ear bars reach the mouse’s temples and secure the head with ear bars as shown in Methods video S3[href=https://www.wicell.org#mmc3].",
    "Making sure the nosecone is loose to avoid breaking the nose, move the nosecone downward until the nose is facing slightly down ∼30 degrees relative to horizontal so that cisterna magna membrane is more easily accessible. Slide the nosecone snugly back onto the nose as shown in Methods video S4[href=https://www.wicell.org#mmc4] and Figure 2[href=https://www.wicell.org#fig2].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2340-Fig2.jpg\nFigure 2. Final position of the mouse before CSF collection, in reference to step 17 “Fixation to Stereotactic Instrument for CSF collection”\n    Your browser does not support HTML5 video.\n  \nMethods video S2. Fixing the anesthetized mouse to the mouthpiece and nosecone of the stereotactic instrument, in reference to steps 12–15 “Fixation to Stereotactic Instrument for CSF collection”\n    Your browser does not support HTML5 video.\n  \nMethods video S3. Securing mouse’s head with ear bars, in reference to step 16 “Fixation to Stereotactic Instrument for CSF collection”\n    Your browser does not support HTML5 video.\n  \nMethods video S4. Positioning neck such that cisterna magna membrane is accessible for CSF collection, in reference to step 17 “Fixation to Stereotactic Instrument for CSF collection”\nExposure of Cisterna Magna\nTiming: 2–3 min\nIn this section, we will make a sagittal incision of the skin inferior to the skull and carefully separate the subcutaneous tissue and neck muscles through the midline to expose the cisterna magna.\nUse an alcohol and iodide swab to disinfect the back of the skull, neck, and upper back and to keep hair matted down. Repeat two more times.\nNote: Hair could be shaved before the procedure.\nTug skin on the back of the neck with blunt forceps (Figure 3[href=https://www.wicell.org#fig3]A); cut with scissors to expose a ∼1–1.5-cm-length area under the skin (Figure 3[href=https://www.wicell.org#fig3]B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2340-Fig3.jpg\nFigure 3. Exposure of the Cisterna Magna",
    "(A) Tugging skin on the back of the neck with blunt forceps and positing scissors to make the first cut, in reference to step 19 “exposure of Cisterna Magna[href=https://www.wicell.org#sec3.4]”.\n(B) Exposing tissue under the skin after first cut, you should see a white stripe in the middle in reference to step 19 “exposure of Cisterna Magna[href=https://www.wicell.org#sec3.4]”.\n(C–E) Cutting through the first layer of muscle in reference to step 20 “exposure of Cisterna Magna[href=https://www.wicell.org#sec3.4]”.\n(F) Using blunt retractors to pull away muscle from the skull, exposing a thin layer of muscle above cisterna magna, in reference to step 21 “exposure of Cisterna Magna[href=https://www.wicell.org#sec3.4]”.\n(G–I) Using the “digging” motion with the blunt forceps to expose the cisterna magna. In panel I, the inverted triangle represents the area where the cisterna magna should be punctured for CSF collection. Scale bar represents 100 μm. Avoid all blood vessels to decrease the risk of contaminating CSF with blood, in reference to step 22 “exposure of Cisterna Magna[href=https://www.wicell.org#sec3.4]”.\nNote: To avoid bleeding/rupturing blood vessels make sure to thoroughly tug the skin before making the first cut.\nHolding the scissors horizontal, cut through the superficial connective tissue (white stripe) (Figures 3[href=https://www.wicell.org#fig3]C–3E).\nPlace the blunt retractors, attached to the stereotactic instrument to pull the muscles apart. After this, a thin layer of muscle above the cisterna magna will be exposed (Figure 3[href=https://www.wicell.org#fig3]F).\nSeparate the muscles at the midline by positioning closed blunt forceps in the midline and pulling them sideways (in a motion like opening a curtain from the midline) until the cisterna magna is exposed (Figures 3[href=https://www.wicell.org#fig3]G–3I).\nNote: The cisterna magna membrane is very durable. Take care not to cut it with scissors, but blunt forceps can be used forcefully on the overlying tissue to expose the membrane without worry of breaking the membrane itself.",
    "Clearing the muscles should ideally occur without any bleeding. If there is bleeding, use cotton swabs to clear blood and tissue from the cisterna magna membrane. Do not proceed until the bleeding resides and the blood is completely cleared off the membrane.\nNote: To see whether the membrane is clean, press a cotton applicator directly onto the membrane, twist it, retract it, and examine the center of the tip for pink color. If there is pink, the membrane is not clean.\nExtraction of cerebrospinal fluid (CSF)\nTiming: 2–10 min\nIn this section, we will be using a glass capillary to puncture the cisterna magna and withdraw CSF.\nRevolve the capillary arm toward the mouse so that the capillary is pointed directly at the cisterna magna (Figures 4[href=https://www.wicell.org#fig4]A and 4B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2340-Fig4.jpg\nFigure 4. Extraction and collection of CSF\n(A and B) Positioning the capillary parallel to the mouse’s nose, in reference to step 24 “extraction of cerebrospinal fluid (CSF)[href=https://www.wicell.org#sec3.5]”.\n(C and D) CSF collected in the glass capillary, checking under magnifying glass for blood contamination in reference to step 31 “extraction of cerebrospinal fluid (CSF)[href=https://www.wicell.org#sec3.5]”.\n(E) Dispensing CSF into a sample tube in reference to step 35 “CSF storage, centrifugation and quality control”.\nLook through the magnifying lamp and adjust the position of the capillary so that it is close to the cisterna magna.\nCritical: look through the scope / magnifying glass to position the capillary tip as far as possible from blood vessels. The pattern of blood vessels will differ between mice.\nCisterna magna membrane puncture: (Methods video S5[href=https://www.wicell.org#mmc5]).\nGradually move the capillary forward until it touches the membrane.\nThe membrane is expected to stretch to an extent. Continue moving the capillary forward gently until the membrane is punctured.",
    "After the membrane is punctured, quickly retract the capillary slightly to avoid damage to the brain tissue. Clear CSF should start flowing into the capillary through capillary action.\nOptional: For active CSF withdrawal, press the 20 μL micropipette plunger all the way down to the second stop and attach the pipette tip to the end of the aspirator tube connected to the capillary (Methods video S6[href=https://www.wicell.org#mmc6]). Immediately after the plunger release, retract the capillary with one quick motion out of the mouse and twist off the 20 μL micropipette tip from the tube attached to the capillary. Proceed to step 31.\nNote: Make sure to form a seal with your fingers between the pipette tip and the aspirator tube and slowly release the P20 plunger, CSF will quickly flow faster.\nWait around 10 min until desired volume of CSF is acquired ∼ 8–15 μL and smoothly retract the capillary with one quick motion out of the mouse.\nInspect the capillary under the magnifying glass. Look for any traces of blood contamination (Figures 4[href=https://www.wicell.org#fig4]C and 4D).\nDisconnect mouse and perform a cervical dislocation. This is a terminal procedure and mouse should be taken down per approved animal protocol procedures.\nNote: while this is a terminal procedure, mouse should be breathing under anesthesia during CSF collection. CSF withdrawal will not work in a dead mouse.\n    Your browser does not support HTML5 video.\n  \nMethods video S5. Puncturing the cisterna magna and CSF withdrawal, in reference to step 26 “Extraction of cerebrospinal fluid (CSF)”\n    Your browser does not support HTML5 video.\n  \nMethods video S6. Withdrawing CSF quickly with the help of the micropipette technique, in reference to the optional step 29 in “Extraction of cerebrospinal fluid (CSF)”\nCSF storage, centrifugation, and quality control\nTiming: 30 min",
    "In this section, we describe a method to measure blood contamination in the CSF sample.\nGently remove the tube attached to the capillary.\nDetach the capillary from the stereotactic instrument.\nPlunge air out of a 200 μL micropipette with tip attached onto the circular side of the capillary and collect the dispensed CSF into the sample tube (Figure 4[href=https://www.wicell.org#fig4]E).\nStore CSF tube on ice.\nCentrifuge at 4°C for 15 min at 2,000 g.\nBlood contamination measurement and storage:\nAfter centrifugation, look for a pellet—some samples that appear clear may have a visible red “dot” of red blood cells that pelleted during the centrifugation. These samples should be discarded.\nAspirate supernatant very carefully and transfer the centrifuged CSF into a sample tube; seal tightly; store dry ice.\nAdd 6 μL of ultra-pure water to the remaining pellet and resuspend—samples are stable on ice.\nUse a Nanodrop instrument and open the UV-vis tab.\nAdd the following wavelengths: 415, 455, 540 nm. These wavelengths detect oxyhemoglobin (oxyHb) and bilirubin.\n415 nm for oxyHb is usually the most sensitive, with a clinical cutoff of 0.023 AU for intracranial hemorrhage.\nBlank with 2 μL of the ultra-pure pure water—ensure no air bubbles.\nLoad 2 μL of each resuspended pellet.\nAny pellet lysates absorbing past a stringent absorbance threshold of 0.02 AU should be discarded.\nStore the samples at −80°C.\nNote: For our studies we used CSF within 12 months of storage at -80 avoiding freezing and thawing cycles. We advise to aliquot before freezing if only part of the volume is needed for downstream readouts.\nPrepare pumps\nTiming: 75 min",
    "In this section, we describe in detail the materials and methods required to prepare micro-osmotic pumps with the polythene catheter tubing coil. Further, we showcase the technique to fill the pumps with artificial CSF and the tubing with young CSF.\nNote: We used the Lynch coil method recommended by ALZET (https://www.alzet.com/wp-content/uploads/2019/06/Pulsatile-Delivery.pdf[href=https://www.alzet.com/wp-content/uploads/2019/06/Pulsatile-Delivery.pdf]) with some modifications as described below. Using this method, we could load only the minimum amount of CSF necessary for the infusion. If the reagent being infused is not precious, it would be advised to use the regular pump filling method using a 1.5 cm catheter to connect the pump to the cannula.\nDisinfect lab bench with 70% ethanol.\nSet down area mats.\nSterilize and bring the following items to the lab bench:\nTwo 2 L glass beakers, one with 1.5 L boiling and the other with 1.5 L ice-cold water.\nTimer, set to 1 min.\nRuler.\nMarker.\nPasteur pipette.\nPacking tape.\nPolythene (PE) catheter tubing.\nMicro-osmotic pump.\nBrain infusion cannula (from Brain infusion kit 3).\nFlow moderators.\n1 mL NORM-JECT syringe.\nBlunt needle.\nDetermine catheter length: Use the following length-volume conversions and the pump infusion rate to determine the appropriate length of catheter tubing. Each cm of the PE tube holds 4.566 μL.\nNote: For example, ALZET model 1007D releases 0.5 μL/h∗ for 7 days. This totals to 84 μL of aCSF or young CSF in a catheter 18.39 cm long. We add to that extra tubing so 91.32 μL in 20 cm.\nNote: Check pump rate for each lot of pumps supplied and adjust the calculations appropriately.\nPrepare polythene catheter tubing coil.6[href=https://www.wicell.org#bib6]",
    "Mark tube at the 1.5 cm point using a ruler and maker, this is the part that will connect the pump to the cannula (Figure 5[href=https://www.wicell.org#fig5]A). This length is fixed regardless of the length of the coil. The rest of the tube (determined by the calculation in step 42) will be coiled.\nTightly coil tubing over a Pasteur pipette (Figure 5[href=https://www.wicell.org#fig5]B).\nHold the coiled tubing over the Pasteur pipette in one hand and seal the tubing with packing tape using the other hand (Figure 5[href=https://www.wicell.org#fig5]C).\nSubmerge the Pasteur pipette into the boiling water for 1 min.\nMove Pasteur pipette from boiling water to ice-cold water for 2 min (Figure 5[href=https://www.wicell.org#fig5]D).\nNote: Make sure the coil is fully submerged in water during steps d and e.\nRemove Pasteur pipette from ice-cold water and using scissors gently cut off the packing tape around the tubing coil.\nSlide the coil tubing off the Pasteur pipette, if the coil holds its shape (Figure 5[href=https://www.wicell.org#fig5]E) this step successful, and one can move on to the next step.\nNote: If the coil does not hold its shape, repeat step 43 before moving on.\nFill micro-osmotic pumps with artificial CSF (aCSF):\nAttach a blunt needle (supplied with the pumps) to a 1 mL NORM-JECT syringe. use only blunt needles to prevent puncturing the pump.\nFill up syringe with aCSF. Roughly 100 μL of aCSF per pump. Transfer aCSF from the syringe into the micro-osmotic pump by pressing it to the far end of the pump and pushing until aCSF spills over.\nNote: Make sure to slowly retract needle from the pump while filling it to prevent air bubbles to get trapped in the pump (Methods video S7[href=https://www.wicell.org#mmc7]).\nPlace the filled pumps in a clean weigh dish.\nFill coil with CSF:\nThaw CSF on ice.",
    "Prepare the flow modulators by cutting off the white plastic caps. We only need the metal part of the flow modulators (Figure 6[href=https://www.wicell.org#fig6]A).\nCut a new small piece ∼1 cm of polythene catheter tubing and attach it to one end of the flow modulator.\nAttach the other open end of the flow modulator to the coiled end of tubing coil and loop it through the inside of the coil (Figure 6[href=https://www.wicell.org#fig6]B).\nFix the brain infusion cannula on the straight end of coil (Figure 6[href=https://www.wicell.org#fig6]C).\nOn the flow modulator side, attach the NORM-JECT syringe with a blunt needle and fill CSF through the coil (Methods video S8[href=https://www.wicell.org#mmc8]).\nNote: No air bubbles should be formed inside the coil while filling it with CSF, or else air bubbles instead of the CSF will be infused into the mouse. Re-fill the coil if bubbles form.\nUse two forceps to remove the catheter tubing attached to one end of the flow modulator in step 45c (Methods video S9[href=https://www.wicell.org#mmc9]).\nInsert open end of the flow modulator into the pump filled in step 45.\nNote: a small air bubble should be formed separating the aCSF in the pump and fluid in the catheter.\nLastly, prime the prepared pumps in ∼5 mL of sterile PBS in a 50 mL canonical tubes at 37°C.\nNote: The brain infusion cannula should remain dry, only the pump and the coil should be submerged in the PBS (as shown in Figure 6[href=https://www.wicell.org#fig6]D).\nNote: Remove the pumps from 37°C, only minutes before surgery because the fluid in the pump retracts in lower temperatures.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2340-Fig5.jpg\nFigure 5. Preparing pumps\n(A) Measuring 1.5 cm of Polythene catheter tubing, in reference to step 43a “prepare pumps[href=https://www.wicell.org#sec3.7]”.\n(B) Coiling Polythene catheter tubing around a Pasteur pipette, in reference to step 43b “prepare pumps[href=https://www.wicell.org#sec3.7]”.",
    "(C) Securing the coil using packaging tape, in reference to step 43c “prepare pumps[href=https://www.wicell.org#sec3.7]”.\n(D) Coil in ice cold water, in reference to step 43e “prepare pumps[href=https://www.wicell.org#sec3.7]”.\n(E) Final product, in reference to step 43g “prepare pumps[href=https://www.wicell.org#sec3.7]”.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2340-Fig6.jpg\nFigure 6. Preparing coil to fill with CSF\n(A) Removing white plastic caps off the flow modulators, in reference to step 45b “prepare pumps[href=https://www.wicell.org#sec3.7]”.\n(B) Looping flow modulator through the coiled tubing, in reference to step 45d “prepare pumps[href=https://www.wicell.org#sec3.7]”.\n(C) Cannula attached to the straight end of the coil, in reference to step 45e “prepare pumps[href=https://www.wicell.org#sec3.7]”.\n(D) Priming the pump and coil in PBS keeping the cannula dry, in reference to step 47 “prepare pumps[href=https://www.wicell.org#sec3.7]”.\n    Your browser does not support HTML5 video.\n  \nMethods video S7. Filling micro-osmotic pump with artificial CSF, in reference to step 44b “Prepare pumps”\n    Your browser does not support HTML5 video.\n  \nMethods video S8. Filling coil with CSF, in reference to step 45f “Prepare pumps”\n    Your browser does not support HTML5 video.\n  \nMethods video S9. Removing excess tubing added to flow modulator in reference to step 45g “Prepare pumps”\nSet up procedure room for pump implantation\nTiming: 45 min\nThis section describes the preparation of the procedure room for pump implantation surgeries.\nDisinfect area.\nSet down area mats.\nFix attachments to stereotactic instrument (Figure 7[href=https://www.wicell.org#fig7]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2340-Fig7.jpg\nFigure 7. Setting up procedure room for pump implantation in reference to step 50 “Set up procedure room for pump implantation”\nA- PBS and H2O2. B- Digital axis reader. C- Cannula Holder. D- Platform with heating pad. E- Drill in stereotactic holder. F- Ear bars. G- Controls for drill. H- Temperature control. I- Isoflurane machine. J- Foot pedal for drill.\nAttach anesthesia tubes to the nose cone.",
    "Connect temperature control system through 3 cords: I) power cord, II) rectal probe blue cord, III) black flat cord that connects to heating plate that is mounted on the elevated platform.\nConnect drill through 3 cords: I) power cord, II) foot control (connected to the back), III) hand piece (connected to the front).\nConnect digital axis reader to the stereotactic frame with the red dot facing up.\nDispense eye lubricant in weigh boat with applicators nearby.\nPlace tubes with 70% EtOH, PBS and 30% H2O2 in a rack.\nAnesthesia for pump implantation\nTiming: 3 min\nIn this section, we will anesthetize the mouse by exposing it to isoflurane.\nTurn on isoflurane for the induction chamber at 3%.\nTransfer mouse to the isoflurane chamber.\nWait for ∼2 min until the mouse breath is slow and shallow, roughly one breath per second.\nEnsure the animal is adequately anesthetized by testing the hindlimb pedal withdrawal reflex. If the foot pad pinch causes a response, keep the mouse in the chamber for an additional 30 s and re-test reflex again.\nFixation to stereotactic instrument for pump implantation\nTiming: 5 min\nIn this section, we will fix the mouse to the stereotactic instrument; isoflurane will be delivered through the nosecone to maintain anesthesia and the ear bars will hold the head in place for the surgery.\nConcurrently, turn off isoflurane to induction chamber and turn on isoflurane to the stereotactic instrument at 3% isoflurane.\nQuickly remove mouse from the induction chamber.\nScruff the mouse with your non dominant hand, using your dominant hand open the animal’s mouth with blunt forceps.\nGently slide the animal’s mouth onto the mouthpiece.\nSlide and secure the nosecone onto the nose, making sure the nosecone fits snugly on the nose (pushing mouse’s whiskers back).",
    "Secure the head centrally with ear bars. The head is positioned at the midline of the frame with both ear bars are pointing to the same number (Figure 8[href=https://www.wicell.org#fig8]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2340-Fig8.jpg\nFigure 8. Mouse’s head secured centrally with ear bars, in reference to step 62 “Fixation to stereotactic instrument for pump implantation”\nNote: Do not use too much pressure as mouse skull can crack at this position, too much pressure can also interfere with breathing.\nAdjust nose upwards/downwards so that the head is horizontal. When moving head downward make sure nosecone is loose to avoid breaking the nose.\nNote: Make sure the eye ointment is covering the entire eye to prevent the eye from drying during this survival surgery.\nInject appropriate dose of Buprenorphine slow release (analgesic, 1 mg/kg) and Baytril (antibiotic, 5 mg/kg) prior to surgery per animal protocol.\nExposure of the skull\nTiming: 2 min\nIn this section, we will make a sagittal incision to expose the skull.\nThroughout surgery, use aseptic technique as per protocol requirements and keep the mouse on a warm surface area (37°C).\nUse an alcohol and iodide swab to disinfect the incision area on the top of the skull and neck. Repeat 2 more times.\nNote: Hair may be shaved before this step.\nTug skin on between the ears and eyes with blunt forceps; cut with scissors to expose a ∼1–1.5-cm-length area (Figure 9[href=https://www.wicell.org#fig9]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2340-Fig9.jpg\nFigure 9. Exposure of the skull\n(A) Tugging and cutting skin between the ears and eyes, in reference to step 67 “exposure of the skull[href=https://www.wicell.org#sec3.11]”.\n(B) Bregma and Lambda exposed, in reference to step 69 “exposure of the skull[href=https://www.wicell.org#sec3.11]”.\nWipe away connective tissue covering the skull with cotton swabs.",
    "Gently stroke the exposed skull with a cotton applicator soaked in H2O2 and wipe – this will enhance the connections between the skull plate and will make it easy to find bregma (the area where the sagittal and coronal sutures cross) (Figure 9[href=https://www.wicell.org#fig9]B).\nDrilling\nTiming: 3 min\nIn this section, we will position the drill to injection coordinates and drill a hole in the skull.\nPlace drill in stereotaxic holder, position above Bregma, and zero X / Y / Z readings on the axis reader (Figure 10[href=https://www.wicell.org#fig10]A). Move to lambda and make sure skull is horizontal in the anterior posterior axis and adjust the nose cone height if necessary.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2340-Fig10.jpg\nFigure 10. Drill position and drilling\n(A) Drill positioned above the bregma and zeroed at all three coordinates: ML 0; AP 0; DV 0, in reference to step 70 “drilling[href=https://www.wicell.org#sec3.12]”.\n(B) Drill positioned at injection coordinates: ML 1; AP 0; DV 0, in reference to step 71 “drilling[href=https://www.wicell.org#sec3.12]”.\n(C) Hole created by the drill, arrow pointing to the hole, in reference to step 72 “drilling[href=https://www.wicell.org#sec3.12]”.\nMove drill to the injection coordinates: Anterior-Posterior (AP) 0; Medio-Lateral (ML) 1 (Figure 10[href=https://www.wicell.org#fig10]B).\nPlace foot on the foot controller and press all the way, move Dorsal-Ventral (DV) axis gently in pulses up and down to gently drill hole just deep enough to penetrate the skull without damaging the cortex (Methods video S10[href=https://www.wicell.org#mmc10] and Figure 10[href=https://www.wicell.org#fig10]C).\nNote: Use a pecking motion—penetrate a bit, then withdraw, penetrate a bit more, then withdraw.\nNote: In case of bleeding- use cotton tip applicators to dry up blood or bone material.\nDisconnect the drill from the stereotactic instrument.\n    Your browser does not support HTML5 video.\n  \nMethods video S10. Drilling a hole at the injection coordinates, in reference to step 72 “Drilling”\nAttaching micro-osmotic pump for I.C.V. infusion",
    "Timing: 5 min\nIn this section, we will implant the cannula through the hole drilled in the previous section. Further, we will fit the coil and micro-osmotic pump subcutaneously and close the incision.\nConnect cannula holder to the stereotactic instrument and place it right above the drilled hole in the skull (Figure 11[href=https://www.wicell.org#fig11]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2340-Fig11.jpg\nFigure 11. Attaching micro-osmotic pump for I.C.V. infusion\n(A) Cannula holder positioned above the drilled hole, in reference to step 74 “attaching micro-osmotic pump for I.C.V. infusion[href=https://www.wicell.org#sec3.13]”.\n(B) Micro-osmotic pump is snugly fit under skin such that the cannula is sticking out, in reference to step 76 “attaching micro-osmotic pump for I.C.V. infusion[href=https://www.wicell.org#sec3.13]”.\n(C) Cannula is attached to the cannula holder, in reference to step 77 “attaching micro-osmotic pump for I.C.V. infusion[href=https://www.wicell.org#sec3.13]”.\n(D) Securing cannula in place by applying a thin layer of glue around the circumference of the cannula, in reference to step 79 “attaching micro-osmotic pump for I.C.V. infusion[href=https://www.wicell.org#sec3.13]”.\n(E). Remove the cannula from cannula holder in reference to step 80 “attaching micro-osmotic pump for I.C.V. infusion[href=https://www.wicell.org#sec3.13]”.\n(F) Using pliers cut the head of the cannula, final product, in reference to step 81 “attaching micro-osmotic pump for I.C.V. infusion[href=https://www.wicell.org#sec3.13]”.\n(G) Glue the skin above the catheter and cannula, in reference to step 82 “attaching micro-osmotic pump for I.C.V. infusion[href=https://www.wicell.org#sec3.13]”.\n(H) Mouse at the end of the surgery, after the skin has been glued back together, in reference to step 82 “attaching micro-osmotic pump for I.C.V. infusion[href=https://www.wicell.org#sec3.13]”.\nInsert big blunt scissors from the incision backwards to make a subcutaneous pocket for the pump (Methods video S11[href=https://www.wicell.org#mmc11]).\nFit the pump through this newly exposed area, such that the pump fits snugly under the skin (Figure 11[href=https://www.wicell.org#fig11]B).",
    "Note: Only the pump and coil fit underneath the skin, the cannula should be sticking out and connected to the cannula holder in the next step.\nUsing forceps prop open the cannula holder with one hand and with the other hand connect cannula to the cannula holder with the needle of the cannula facing downwards (towards the hole in the skull) (Figure 11[href=https://www.wicell.org#fig11]C).\nApply 3 drops of Loctite glue in a triangular pattern on the underside of the cannula (part facing the skull).\nGently lower the cannula holder until the cannula is attached to the skull. Secure the cannula in place by applying a thin layer of glue around the circumference of the cannula (Figure 11[href=https://www.wicell.org#fig11]D).\nLoosen the cannula holder screw and elevate cannula holder (Figure 11[href=https://www.wicell.org#fig11]E).\nCut out the cannula with a plier while pressing down with the wooden side cotton applicator not to disturb the cannula position (Figure 11[href=https://www.wicell.org#fig11]F).\nAlign the skin above the catheter and cannula and attach with surgical glue/stitches/ surgical clips as per animal protocol (Figures 11[href=https://www.wicell.org#fig11]G and 11H).\nRemove mouse from stereotactic instrument and allow to recover in a paper-lined cage placed half-on and half-off of a heating pad; mouse is monitored every 15 min until they are fully awake (e.g., upright and ambulatory) before returning to their home cage.\nMonitor the mouse as per post-operative institutional guidelines. Buprenorphine slow-release will be injected 48–72 h post-op if necessary. If the mouse appears lethargic, has a BCS < 2, or if any other abnormal signs are noted, the mouse will be euthanized immediately.\n    Your browser does not support HTML5 video.\n  \nMethods video S11. Making a subcutaneous pocket for the pump, in reference to step 75 “Attaching micro-osmotic pump for I.C.V. infusion”"
  ],
  "subjectAreas": [
    "Neuroscience",
    "Model Organisms"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}