{
  "id": 12118,
  "origin_website": "Jove",
  "title": "Longitudinal Morphological and Physiological Monitoring of Three-dimensional Tumor Spheroids Using Optical Coherence Tomography",
  "procedures": [
    "1. Preparation of Cells\nObtain cell lines from a qualified supplier.\n\tNOTE: Verify that cells from the cell lines of interest can form spheroid in the culture media or with the help of a substrate (basement membrane matrix like Matrigel). Look into the literature9 or perform one round of a pre-experiment for a check.\nThaw the frozen cells following the specific procedure provided by the cell-line supplier. A general procedure can be found elsewhere43.\nCulture the cells for 1-2 passages in 25 cm2 culture flasks. The cells are then ready to use for 3D cell culture.\nMonitor the health status of the cells every day and maintain them in an incubator under standard conditions (37 °C, 5% CO2, 95% humidity). Refresh the media as needed.\n\tNOTE: The culture medium consists of DMEM (4.5 g/L glucose), 1% antibiotic-antimycotic, 10% fetal bovine serum. Subculture cells before they reach confluence in the culture flask. Follow the cell culture guideline provided by the supplier. A general procedure can be found elsehwhere44.\nPerform 3D cell culture in multi-well plates based on the following general protocol9.\n\t\nRemove the culture media from the culture flask and wash it with sterilized phosphate buffered saline (PBS, heated to 37 °C).\nResuspend the cells by adding 1 mL of trypsin ethylenediaminetetraacetic acid (EDTA, 0.5%) into the flask for 3 min. Then, add culture media to dilute the trypsin.\nTransfer the cell suspension into a 15 mL centrifuge tube and centrifuge for 5 min at 500 x g and room temperature.\nRemove the supernatant and resuspend cells with 4 mL of pre-warmed culture medium. Pipette one drop of sample onto a hemocytometer for cell counting to determine cell concentration. Dilute the cells to appropriate concentration for seeding (e.g., 3,000 cells/mL).",
    "NOTE: Optimize the initial cell concentration of the spheroid for each cell-line and each type of multi-well plate (96-well, 384-well or 1536-well).\nSeed cells into an ultra-low attachment (ULA) round-bottomed multi-well plate. Add 200 µL of cells suspension into each well at the concentration of 3,000 cells/mL so that each well has about 600 cells.\nAt RT, centrifuge the whole plate using a plate adapter for 7 min, right after seeding, at a speed of 350 x g or the lowest speed available.\n\t\tNOTE: The centrifuge helps gather cells to the center of the well to facilitate forming a single, uniform spheroid. The centrifuge step is performed only once at the beginning to form the tumor spheroids. It will not be repeated when the tumor spheroids start growing.\nMaintain the multi-well plate at 37 °C and 5% CO2 in a culture incubator and refresh the culture media every 3 days.\n\t\tNOTE: Growth time may vary for different 3D culture conditions. In our study, 3,000 cells/mL is used for both U-87 MG and HCT 116 cell lines in 96-well plates, so that the spheroid can grow to ~500 μm in 4‒7 days for HCT 116 cells. Consider adding media supplements and growth factors for different spheroid models, based on the general 3D culture protocol.\nPerform OCT imaging of tumor spheroids every 3‒4 days for a longitudinal study of their growth.\n\t\tNOTE: Recommended time points for OCT imaging would be day 4, day 7, day 11, day 14, day 18 and day 21.\n2. High-throughput OCT Imaging Platform\nNOTE: See referenced work29,30,31,32,33,34 for a thorough review of principles and applications of OCT. See Figure 1 and Huang et al.42 for details of the custom OCT imaging system used in this study.",
    "Choose an appropriate broadband light source for the OCT system for tumor spheroid imaging.\n\tNOTE: Here, a superluminescent diode (SLD, Figure 1A,B) with a central wavelength of ~1,320 nm and ~110 nm bandwidth was used as a broadband light source.\nConstruct the reference arm and sample arm of the OCT system following the schematics (See Figure 1A,B for details). See the Table of Materials for a list of optical components to construct the OCT system. Ensure that the optical path length of the reference arm and sample arm are closely matched.\nConstruct the spectrometer, including a collimator, a grating, an F-theta lens and a line-scan camera (See Figure 1C for setup34) for details of spectrometer design of OCT. Alternatively, select a commercial spectrometer that matches the center wavelength of the light source. Make sure that the spectrometer is aligned correctly to cover the entire laser bandwidth, to achieve high photon collection efficiency and to provide slow wash-out of the interference pattern.\nCharacterize the performance of the OCT system, including the following metrics such as sample arm power, total imaging depth, depth-dependent sensitivity, axial resolution, depth of focus and lateral resolution. Place a weak reflector (e.g., a mirror with a neutral density filter) as a sample to measure the depth-dependent sensitivity, axial resolution, and depth of focus. Place a USAF resolution test chart target as the sample to check the lateral resolution.\n\tNOTE: See references34,45 for definitions of metrics of OCT performance and protocols to characterize these metrics45. See Table 1 for a list of measured parameters for the custom OCT system used in our study.",
    "Select a motorized translation stage to provide horizontal movement of the multi-well plate to image tumor spheroids in different wells (See Figure 1B). Use a stage with a travel range larger than 108 mm x 72 mm to ensure a full scanning of all the wells of the multi-well plate. Use a 2D or 3D motorized translation stage with software control to enable precise location of each well and automation of the OCT system for high-throughput imaging.\nUse a plate adapter or design a plate holder (by 3D printing) to hold the multi-well plate in a fixed position.\nCorrect the tilting and rotation of the multi-well plate using a 2D tilting stage and a rotation stage mounted on the translational stage (See Figure 1D), before conducting any OCT imaging to minimize variation of the focus plane from different wells. Use D2, D11, B6, D6, G6 as the guiding wells when monitoring their relative positions in the OCT images (Figure 1A).\nAdjust the rotation of the plate to ensure the edges of the plate are parallel with the direction of stage movement so that the wells remain at the same horizontal positions in the OCT images (Figure 1E). Adjust the tilting of the plate to be parallel to the optical table so that the wells remain at the same vertical locations for OCT imaging (Figure 1F).",
    "NOTE: Adjustment of the tilting angle and focus help optimize the OCT image quality for all the wells. However, variations of the height of culture media in different wells may cause changes in optical paths which may lead to defocusing of the spheroid image. Auto-focus may be implemented to control the focal plane of OCT imaging to achieve optimized image quality. The adjustment step does not resolve poor OCT image quality of the tumor spheroid due to the following issues: the spheroid decentering due to initial seeding location; spheroid elevation when embedded in biofabricated extracellular matrices; poor plate quality with large variations of the height of well bottoms. Additional software control with auto-focus or self-alignment functions can be implemented to optimize the performance of the OCT imaging system.\nUse a custom computer program to control the OCT image acquisition and the stage movement to collect data from each well sequentially.\n3. OCT Scanning and Processing of Tumor Spheroids\nOn the day of the OCT imaging of tumor spheroids, take the multi-well plate from the incubator. Transfer the multi-well plate under the OCT imaging system. Place it on top of the plate adapter.\n\tNOTE: OCT imaging of tumor spheroids may be performed with the polystyrene plate lid on or off. However, the water condensations on the lid due to evaporation from the wells may affect light transmission and distort the light path, yielding less optimal OCT images from the spheroids.\nAdjust the height of the plate by moving along the z-direction of the translation stage. Maintain the focal plane position at ~100–200 μm below the top surface of each spheroid, to minimize the effect of the non-uniform depth-wise focal profile.",
    "Set a proper OCT scanning range (e.g., 1 mm x 1 mm) in the custom software to cover the whole tumor spheroid according to its development stages. Click Save Parameters to save the setting.\nUse the custom software to acquire 3D OCT images of tumor spheroids one by one for all the wells of the plate containing spheroids. Click the Preview button to view the preview image and click the Acquire button to acquire the OCT image.\n\tNOTE: Ensure that the OCT spheroid data are collected when the stage is not in motion. The spheroid is usually located at the center of the U-bottom well. However, the spheroid may be shifted in the culture media when the stage is accelerating or decelerating due to the inertia of the spheroid in the culture media.\nProcess 3D OCT datasets of tumor spheroids to generate OCT structural images with a custom C++ processing code. See Figure 2A for a flowchart of post-processing of OCT data.\n\tNOTE: See Figure 4A for the generated 3D OCT structural images.\n\t\nSee Chapter 5 of Drexler and Fujimoto34 and Jian et al.46 for detail descriptions of post-processing steps of OCT data. Calibrate the pixel size in all three dimensions. Re-scale the OCT structural images on corrected scales.\n\t\tNOTE: The distance in the axial direction (z-direction) of OCT images is a measure of the optical path difference between the reference arm and sample arm. Thus, the refractive index of the sample (n) needs to be taken into consideration when calibrating the pixel size in the axial direction for rescaling. In our study, we use n = 1.37 as the refractive index of the tumor spheroid42.",
    "Generate the collage of spheroid images using 2D OCT Images in three cross-sectional XY, XZ, and YZ planes across the centroid of the spheroid. See Figure 3C–E for the representative output of collages of spheroid images. Perform image registration for all the spheroids, using the MATLAB function dftregistration47, to ensure that the centroids of all the spheroid are located approximately at the same location.\nObtain 3D rendering of the spheroid using a commercial or custom software.\n\tNOTE: The following steps show how to obtain the 3D rendering of tumor spheroids using a commercial software.\n\t\nLoad the 3D OCT data into the software.\nClick the Surpass panel. Then, click Add New Volume. Choose the Blend mode to use for 3D rendering.\nAdjust the viewing angle by dragging the image using the mouse pointer.\n4. Morphological Quantification of 3D Tumor Spheroids\nNOTE: A custom written code in MATLAB processes this quantification. Click the Run button to initiate the process. See Figure 2B for the flowchart of the steps of morphological quantification of spheroids.\nQuantify spheroid diameter, height, and diameter-based volume.\n\t\nSelect 2D OCT Images in three cross-sectional XY, XZ, and YZ planes that cross the centroid of the spheroid.\nMeasure the diameter and height of the spheroid in XY and XZ planes, respectively.\nCalculate diameter-based spheroid volume using: imgsrc://cloudfront.jove.com/files/ftp_upload/59020/59020eq1v2.jpg, with a presumption of the spherical shape of tumor.\nQuantify voxel-based spheroid volume.\n\t\nApply a 3D averaging filter on the OCT structural data of spheroid to remove speckles.\nSegment tumor spheroids using the Canny edge detection48 filter, frame by frame, with a proper threshold separating the tumor spheroid region from the well bottom.\nGroup connective voxels for 3D data (see built-in function: bwconncomp).",
    "Calculate the mean distance between each connective voxel in the group and the spheroid centroid (manually chosen), for each group. Identify the spheroid region as the group with the minimum mean distance.\nCount the number of voxels within the spheroid region and then multiply by the actual volume of an individual voxel (volume/voxel), yielding the total volume of the spheroid.\n5. Dead-Cell Region Detection of 3D Tumor Spheroids\nNOTE: In a homogeneous medium, OCT back-scattered intensity detected as a function of depth (I(z)) can be described by the Beer-Lambert Law49: imgsrc://cloudfront.jove.com/files/ftp_upload/59020/59020eq2v2.jpg, where z represents the depth, μ is the optical attenuation coefficient, and I0 is the incident intensity to the sample. Hence the derived optical attenuation coefficient can be expressed as: imgsrc://cloudfront.jove.com/files/ftp_upload/59020/59020eq3v2.jpg. Since OCT images are often plotted on a logarithmic scale, the slope of the OCT intensity profile can be retrieved to derive the optical attenuation coefficient. See Figure 2C for a flowchart of the generation of the optical attenuation maps.\nPerform segmentation to remove unwanted regions outside the spheroid. Perform 3D average filter to suppress the speckle noise that is inherent in OCT images.\nObtain pixel-wise optical attenuation coefficients by linear fitting the log-scale OCT intensity profile over a certain depth range (moving window), extract its slope, and multiply the slope by -1/2.\n\tNOTE: The attenuation coefficient at each voxel within the segmented spheroid region is calculated based on the slope of OCT intensity profile in a 10-voxel depth window (~40 μm in depth), with the voxel located in the middle of the window.\nApply the methods above (steps 5.1 and 5.2) to each axial scan in a frame and each frame in a 3D dataset containing the segmented spheroid region until optical attenuation coefficients for all voxels of the segmented spheroid region are calculated.",
    "Perform the binary thresholding to highlight the high-attenuation region.\n\tNOTE: See Huang et al.42 for the determination of threshold of the high-attenuation region using histogram analysis.\nHighlight the binarized optical attenuation map on the original image to label the dead-cell region (blending). Generate the 3D-rendered image of the blended attenuation map to visualize the 3D distribution of the dead-cell region.\n6. Histology and Immunohistochemistry\nNOTE: Histology and immunohistochemistry (IHC) stained images of tumor spheroids are obtained to correlate with the corresponding OCT results.\nAt selected time points, select 1-2 tumor spheroids from the multi-well plate for histology and IHC staining. Use a pipette with the 1 mL pipette tips to transfer the spheroid from the well to a 1.5 mL centrifuge tube.\n\tNOTE: Cut the 1 mL pipette tip before transfer to ensure that the opening of the tip is larger than the size of the tumor spheroid to avoid damaging the structure of the spheroid.\nCollect each tumor spheroid in a single 1.5 mL microcentrifuge tube filled with 10% formaldehyde and fix for 48 h.\nPerform the histology and IHC processes for each spheroid, using standard paraffin embedding techniques.\n\tNOTE: Stain 5 μm thick sections of tumor spheroids for hematoxylin and eosin (H&E) and terminal deoxynucleotidyl transferase dUTP nick end labeling (TUNEL) apoptosis detection. A counterstaining of hematoxylin is applied to TUNEL. A digital slide scanner was used to scan the stained sample and obtain high-resolution histological and IHC images.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}