{
  "id": 4712,
  "origin_website": "Bio",
  "title": "Cytokine-stimulated Phosphoflow of PBMC Using CyTOF Mass Cytometry",
  "procedures": [
    "Thaw PBMCWarm complete RPMI to 37 °C in water bath. Each sample will require 20 ml of complete RPMI with benzonase to limit cell clumping. Calculate the amount needed to thaw all samples, and prepare a separate aliquot of warm media with 1:10,000 benzonase (final concentration 25 U/ml). Remove samples from liquid nitrogen and transport to lab on dry ice.Place 10 ml of warmed benzonase media into a 15 ml tube, making a separate tube for each sample. Thaw frozen vials in 37 °C water bath.When cells are partially thawed, carry to hood. Add 1 ml of warm benzonase media from appropriately labeled centrifuge tube slowly to the cells, then transfer the cells to the centrifuge tube. Rinse vial with more media from centrifuge tube to retrieve all cells.Continue with the rest of the samples as quickly as possible.Centrifuge cells at 1,600 rpm (RCF = 390) for 10 min at room temperature.Remove supernatant from the cells and resuspend the pellet by tapping the tube.Gently resuspend the pellet in 1 ml warmed benzonase media. Centrifuge cells at 1,600 rpm (RCF = 390) for 10 min at room temperature. Remove supernatant from the cells and resuspend the pellet by tapping the tube.Resuspend cells in 1 ml warm complete RPMI.Count cells with Vicell (Vi-Cell XR Beckman Coulter) (or hemocytometer if necessary). To count, take 20 µl cells and dilute with 480 µl PBS in vicell counting chamber. Load onto Vicell as PBMC with a 1:25 dilution factor.Adjust the cell concentration to 5 x 106 cells/ml with warm media (no more benzonase at this point.) Using a multichannel pipette, add 100 µl cells (0.5 x 106 cells) into each of eight wells of a 96-well deep well plate. Rest for another 1 h-1.5 h at 37 °C in CO2 incubator.",
    "Prepare the stimulation plate just before stimulation.Example of a full plate:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150604/20150604024939_8531.jpgStimulate cells Prepare cytokines at 5x concentrations, in 500 µl of RPMI in a fresh deep well block. Add enough 5x cytokine (~500 µl for a full plate) into one row of a fresh deep well block to pipette. Example of cytokine stimulation:IFNa: Final concentration of stimulation used= 10,000 units/mlIFNg2, IL6, IL7, IL10, IL21, IL2, IL17A: Final concentration of stimulation used= 50 ng/ mlCD3 = 2.5 µl in 990 µl (final concentration 500 ng/ml) CD28 = 10 µl in above media final (concentration 2,000 ng / ml) LPS: Final concentration of stimulation used= 1 µg/ mlPMA 10 ng/ml final concentration mlIonomycin 1,000 ng/ml final concentration /mlIL5: Final concentration of stimulation used= 10 ng/mlRemove rested cells in the deep well block from incubator and stimulate by adding 25 µl of 5x cytokines with multichannel pipette to each row of patient samples. Change tips between each patient. Work as rapidly as possible.Tap plate to mix, and incubate 15 min at 37 °C in CO2 incubator.Remove cells from incubator at the 15 min and using a multichannel pipette, add 20 µl 16% PFA (~2.2% PFA final concentration) to each row of patient samples in the deep well block. Pipette up and down to mix for each patient. Change tips between patients. Add PFA in the same order that you added the cytokine stimulation.Incubate 10 min at room temperature.Add 1.6 ml CyFACS buffer to each well of the deep well block. Centrifuge cells at 974 rcf (x g) for 10 min at 4 °C. The cells are fixed / dead and has to be spun down harder to prevent cell loss.Aspirate supernatant from the cells.Surface stainingMake cocktail in PBS of metal-chelating polymer-labeled surface antibodies according to previously determined titration.",
    "Make sufficient volume for each sample to have 20 µl of cocktail. Pipet into 0.1 µm spin filter and centrifuge in a tabletop microcentrifuge (RCF = 14,000) for 5 min at room temperature.Add 20 µl of antibody cocktail to the cells in the deep well plate, vortex to mix and let it incubate at RT for 30 min. Wash cells in 1.6 ml/well x2 with CyFACS buffer and centrifuge cells at 974 rcf (x g) for 8 min at 4 °C. Discard supernatant by aspiration. Permeabilize the cells by adding 600 µl -20 °C cold MeOH to each well of the deep well block using a multichannel pipette. Pipette up and down to mix for each patient. Change tips between patients. Cells are stored overnight at this point at -80 °C.Remove samples from freezer. Wash in 1 ml/well CyFACS buffer.Centrifuge cells at 974 rcf (x g) for 10 min at 4 °C. Discard supernatant by aspiration.Wash in 1.8 ml / well CyFACS buffer.Centrifuge cells at 974 rcf (x g) for 10 min at 4 °C. Discard supernatant by aspiration.Intracellular staining Make cocktail in PBS of metal-chelating polymer-labeled intracellular antibodies according to previously determined titration. Make sufficient volume for each sample to have 20 µl of cocktail. Pipet into 0.1 µm spin filter and centrifuge in a tabletop microcentrifuge (RCF = 14,000) for 5 min at room temperature.Add 20 µl of antibody cocktail to the cells in the deep well plate and let it incubate at RT for 30 min. Wash in 1.8 ml/ well CyPBS.Centrifuge cells at 974 rcf (x g) for 10 min at 4 °C. Discard supernatant by aspiration.Make 1:200 dilution in CyPBS of Ir-intercalator. Add 20 µl of diluted Ir-intercalator solution to each well, pipet to mix. Incubate on ice for 20 min.Wash 1.",
    "6 ml/ well x 3 in MilliQ water.Centrifuge cells at 974 rcf (x g) for 10 min at 4 °C. Discard supernatant by aspiration.Acquire samples on the CyTOF, after standard instrument setup procedures."
  ],
  "subjectAreas": [
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}