{
  "id": 6895,
  "origin_website": "Bio",
  "title": "<em>In vitro</em> Assessment of Pathogen Effector Binding to Host Proteins by Surface Plasmon Resonance",
  "procedures": [
    "For all experiments, dock an NTA chip into the SPR instrument and prime it with running buffer. Prior to docking, the NTA chip needs to equilibrate at room temperature for 10-30 min to prevent condensation. Once docked there are four flow cells available with a Biacore T200. In this experiment, use two of these flow cells, with flow cell 1 as the reference (FCref) without immobilize-d ligand and flow cell 2 as the test cell (FCtest). For all experiments, load the tubes with the appropriate amount of solution and placed in the rack as detailed in the BiacoreTM T200 Control Software.Note: Leave the reference cell blank: In this protocol, the reference flow cell is blank and the analyte injected over both cells, this will reveal any non-specific binding of the analyte to the chip and will be subsequently subtracted from the final result. Ideally very little or no binding of the analyte to the chip surface should occur. Preparation of the ligand proteinThe method uses a hexa-histidine tagged protein (Magnaporthe oryzae AVR-Pik, C-terminally tagged in our example), which is captured to the surface on a standard NTA chip (Figure 1). We purified the proteins as described in Maqbool et al. (2015) and De la Concepcion et al. (2018 and 2019).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200628/20200628014633_0402.jpgFigure 1. Cartoon representation and example result of the four steps of the binding experiment. (1) Activation of the NTA chip with nickel. (2) Binding of the his-tagged protein ligand to the chip. (3) Binding of the protein analyte. (4) Regeneration of the chip with EDTA to remove everything bound to start the cycle again. Steps 1 and 2 are only carried out on Flow cell 2 whereas steps 3 and 4 are carried out over both flow cells. The sensorgram shown represent a typical trace of the subtracted FC2-1 sensorgram.",
    "Preparation of stock dilution of His-tagged (ligand) proteinThe concentration of the protein that will be immobilized on the chip is measured and diluted in buffer (20 mM HEPES, 150 mM NaCl, pH 7.5) to obtain 2 ml of stock solution at 2 μM.Note: The stock solution can vary depending on the experiment: The amount of stock solution we prepare in our example is larger than needed. This is because the proteins used in this example can be produce in large amounts, are stable, and can be kept on ice for a few days. If the protein to be tested is not produced in enough quantities and/or is not stable, we recommend preparing a fresh stock solution with a lower volume each time before running. Preparation of working solution of ligand proteinFrom the stock solution, we take 25 μl and dilute it with 975 μl of running buffer to obtain a 50 nM dilution. The volume of the ligand solution will vary depending on the number of cycles that are set up, and will be indicated by the BiacoreTM T200 SPR control software.Manual run to estimate the amount of protein immobilized onto the chipOnce the proteins that will serve as ligand are prepared, test the binding to the chip by performing a manual run. In our experiments, we aimed to use a final capture level of ligand of 250 ± 50 Response Units (RU) for each ligand to be tested.Note: Ligand RUs value: In this experiment, we aim for a ligand immobilization level of ~250 RU as the value that gives a response sufficiently large enough to be measured even for weak binders.",
    "This value was selected by using the Rmax calculation in the data analysis section and this theoretical response obtained is related to the molecular weight of the two proteins and the amount of the His-tagged protein immobilized on the chip. Therefore, we first recommend determining the optimal level of immobilization for each ligand. If the level of binding of the ligand differs too much from the desired RU, it can be corrected by reducing or increasing the concentration of ligand in the working solution. If multiple His-tagged protein are to be tested, the concentration to use to capture on the chip will need to be optimized for each protein.Select flow cellsCarry out the experiments using flow cells 1 and 2. The ligand is captured in flow cell 2 and the analyte is injected over both flow cells. The final result (sensorgram) is a subtraction of the response from flow cell 2 min cell 1 (FC2-1).Activation of the chipInject 30 µl of 0.5 mM NiCl2 with a flow rate of 30 μl/min to activate the chip. This step only applies to flow cell 2.Immobilization of the ligandInject 30 µl of C-terminally His-tagged AVR-Pik in flow cell 2 with a flow rate of 30 μl/min. Binding to the Ni2+ on the surface of the chip is recorded as (RU). An additional check should be carried out without activation with NiCl2 to ensure that the protein does not non-specific binding to the chip surface.RegenerationRegenerate the sensor chip by removing anything bound to the chip, with an injection of 30 μl of 0.35 M EDTA with a flow rate of 30 μl/min over both the flow cells.",
    "Preparation of the protein analyteOnce the manual run is completed and the binding of each ligand to the chip is around 250 ± 50 RUs, prepare the working dilutions of the protein analyte. In our case, we produced purified Pik-HMA domain as described in De la Concepcion et al. (2018 and 2019).Preparation of stock dilution of analyte proteinAfter measuring the concentration of the protein, dilute it in buffer (20 mM HEPES, 150 mM NaCl, pH 7.5) to obtain 2 ml of stock solution at 2 μM as described above for the protein ligand.Preparation of working solution of analyte proteinMake serial dilutions of the protein stock to obtain final concentrations of 4 nM, 40 nM and 100 nM. The total volume depends on the number of cycles and will be indicated by the BiacoreTM T200 SPR control software.Note: Adjust working concentration of analyte: The working concentration of the analyte will vary in each experimental case depending the strength of interaction between proteins. We recommend starting with concentrations of 50 nM and 500 nM to find the appropriate concentrations to use. Ideally a top concentration should be used where the binding is saturated for the strongest interaction to be tested. Set up cycle parameters and Rmax runFor the experiment, dock the chip in the instrument and prime it with running buffer. We carried out the experiment at 25 °C but the samples are stored at 4 °C. We used a flow rate of 30 μl/min.Note: Adjusting experimental temperature and flow rate: The optimal temperature and flow rate can vary depending on the proteins to be tested. The parameters used by this protocol are standard, but some proteins might require a different temperature and/or a higher contact time (achieved by a lower flow rate) for a successful interaction.",
    "Likewise, the time that the protein stock can be stored at 4 °C is protein-dependent. As a standard, we do not recommend freeze-thaw the protein aliquots (working with small, single-use protein aliquots is preferred).Each experimental cycle consists of 4 steps described below and represented in Figure 1. This cycle can be repeated multiple times in an automated fashion using different concentrations of analyte tested over different ligands.Chip activationAs a first step, inject a solution of 0.5 mM NiCl2 with a flow rate of 30 μl/min over Flow cell 2 to activate the chip.Ligand immobilizationAfter chip activation, inject the His tagged protein (ligand) to be tested (in our case C-terminally tagged AVR-Pik effector) over the flow cell 2 (FCtest). Sixty seconds are used as the injection time to achieve a desired response at this concentration. After the ligand has been immobilized buffer is flowed over FC1 and 2 to ensure any non-specific his tagged protein is removed and a stable baseline should be achieved prior to analyte injection.Analyte injectionOnce the ligand is bound to the chip surface, inject the test analyte at a given concentration (or buffer-only control) over both flow cells (FCref and FCtest). A contact time of 120 s is used as a standard to make sure the maximum concentration is (ideally) reaching the steady state. After injection of the protein, the system switches back to buffer only flow and the bound protein will start to dissociate. Generally, 120 s of buffer only is used to see this dissociation. This region of the sensorgram can be used to evaluate differences between analyte proteins as generally tighter interactions take longer to dissociate. Chip regenerationAfter the analyte has been injected in the flow cell, pass a regeneration solution of 0.",
    "35 M EDTA over both flow cells (FCref and FCtest) at a flow rate of 30 µl/min. This strips the Ni2+ from the chip, and the proteins bound to it. After this step, the response should return to similar levels to those prior to Step D1.For each analyte, we set 3 replicates of each cycle at working concentration of 4 nM, 40 nM and 100 nM. In addition, two start up cycles were carried out using buffer only as the analyte. The total running time of 11 cycles is around 4 h for each ligand to be tested and once initiated it does not require further user intervention. Multiple runs involving different ligands and analytes can be stack together in a single run.When the experiment is completed, the NTA chip can be removed from the instrument and stored in buffer at 4 °C until next use. The chip can be re-used multiple times for different experiments. Each time a chip is re-used the capture of nickel and his-tagged protein is checked. As long as this is what is expected the chip can be used again. On the rare occasions a chip fails it is obvious as the nickel and his tagged protein is no longer captured."
  ],
  "subjectAreas": [
    "Plant Science",
    "Molecular Biology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}