{
  "id": 8199,
  "origin_website": "Bio",
  "title": "Colony Immunoblotting Assay for Detection of Bacterial Cell-surface or Extracellular Proteins",
  "procedures": [
    "Place identical orientation marks in three asymmetric locations on the exterior wall of two fresh agar plates (e.g. LB agar for Escherichia coli). Be sure to include orientation marks on the bottom plate (i.e. not on the lid).Pick each fresh colony to be tested with a sterile toothpick or pipette tip and make a short streak of about 0.5 cm in length onto the test agar plate and then onto the master agar plate. To keep the colonies in a clear physical order use a grid pattern (see Figure 1) under the plates and streak each colony in an identical position on both plates. A colony density of 100 colonies per plate (9 cm diameter) is optimal and minimizes possibility of cross-contamination between colonies. It is recommended to include a negative and positive control colony onto the plates. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20130828/20130828050253_5797.jpgFigure 1. A grid template for precise orientation of 100 cell colonies on two agar plates. A single grid with 85 mm in diameter is used for a 90 mm Petri dish (the original picture size 19 cm x 10 cm is suitable for printing).To grow the bacteria, invert the plates and incubate them at an appropriate temperature overnight (e.g. for Escherichia coli at 37 °C). To minimize cross-contamination among neighboring colonies, avoid overgrowth and potential formation of satellite colonies.Using two tweezers, place a circular nitrocellulose membrane (82 mm in diameter) carefully and evenly on top of the colonies on the test plate for 10-60 sec. Pre-cool the test plate at 4 °C for approximately 30 min before placing the membrane on its surface so that the agar will not adhere onto the membrane.To ensure contact with the colonies, take care to avoid introducing air bubbles between the membrane and the agar surface.",
    "Hold the membrane at opposite edges with two tweezers and bend it slightly, and then allow the curved membrane to make contact with the center of the plate. Finally, lower the sides gently onto the agar surface. To avoid cross-contamination and smearing of colonies, do not reorientate the membrane once it has been applied. Mark the membrane orientation according to the three marks on the test plate by stabbing through the membrane with a sterile 18-gauge needle. Save the master plate in 4 °C for later use.Using tweezers, peel off the membrane from the agar and transfer the membrane colony-side up to a beaker.Pour 100 ml of blocking buffer into beaker. Place the beaker on laboratory shaker (Belly dancer) and shake at speed setting 3-4 at room temperature for 5 min to remove excess of colony material. Decant the blocking buffer.Repeat steps 5a and 5b two more times.Pour 100 ml of blocking buffer into beaker and incubate in blocking buffer for 45 min with gently agitation on laboratory shaker (Belly dancer, speed setting 2-3) to ensure complete blocking of unoccupied protein binding sites. Care should be taken to prevent the membrane from drying out during incubation. Multiple membranes can be placed in a single beaker. Note: If working with intracellular proteins, cells should be lysed before blocking. To lyse the cells, transfer the membrane colony-side up from the test plate to a Petri dish containing a sheet of 3 mm (Whatman 3 MM) paper moistened with 2-3 ml of 10% (w/v) SDS solution. Avoid introducing air bubbles. After 5 min incubation, place the membrane on top of the 3 mm paper saturated with 0.5 M NaOH, 1.5 M NaCl for 5 min. Then, neutralize by incubating two times for 5 min on the 3 mm paper soaked with 0.",
    "5 M Tris-HCl (pH 7.5), 1.5 M NaCl. Finally, place the membrane on top of the 3 mm paper saturated with 2x SSC for 15 min. Transfer the membrane colony-side up to a beaker and continue with the blocking step 5d.Prepare a primary antibody dilution in antibody dilution buffer and transfer the membrane to a Petri dish containing the diluted primary antibody (one membrane per Petri dish).For each 82 mm-diameter membrane, use 7-10 ml of diluted primary antibody. Ensure the membrane is adequately covered with the solution to prevent it from drying out during incubation.The antibody dilution and incubation conditions depend on your primary antibody; please refer to primary antibody datasheet. It is recommended to start with the same conditions used for Western blotting. For optimal results, perform a titration experiment (e.g. 1:100-1:3,000) and optimize the dilution according to the results.A serum dilution of 1:500-1:1,000 (5-10 μl in 10 ml) and incubation for 1 hour with gently agitation at room temperature will normally be sufficient. Wash the membrane three times in 10 ml of washing buffer for 5 min each to remove unbound antibodies.Prepare a secondary antibody dilution in antibody dilution buffer and replace the washing buffer with the diluted secondary antibody.Use 7-10 ml of diluted alkaline phosphatase-conjugated secondary antibody per 82 mm-diameter membrane. Please refer to secondary antibody datasheet for recommended antibody dilution buffer and recommended antibody dilution. Typically 1:500 to 1:2,000 dilutions of the commercial conjugates are appropriate. Incubate as in step 6.Wash as in step 7.To visualize positive colonies reacting with the primary antibodies, replace the washing buffer with 5-10 ml of BCIP/NBT solution and incubate with gentle agitation at room temperature until the desired color develops (usually 2 to 5 min) or background colour begin to appear.",
    "The positive control should be dark purple-coloured (see Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20130828/20130828050548_9240.jpgFigure 2. A representative colony immunoblotting membrane of Mat fimbriae expression in Escherichia coli MG1655-Rif derivatives. Bacteria subjected to mini-Tn5 transposon mutagenesis and enrichment with immunomagnetic particles coated with anti-Mat antibodies (available from previous work (Pouttu et al., 2001)) were grown overnight on LB agar plates at 37 °C, and colonies transferred onto a nitrocellulose membrane were left to react with anti-Mat antibodies (a dilution of 1:500) and detected with alkaline phosphatase-conjugated secondary antibodies (a dilution of 1:2,000). Colony-represents MG1655-Rif, a negative control for Mat fimbriae expression (Lehti et al., 2013). Colony + indicates IHE3034 matA(A536C) (ptet-matA), a positive control of Mat fimbriae expression (Lehti et al., 2013). Colonies 1 to 4 are candidate Mat-fimbriated MG1655-Rif Tn5 mutants.Stop the reaction by rinsing the membrane several times in distilled water.Allow the membrane to air dry in the dark.Find the desired colonies by matching the colonies on the master plate to the reaction spots in the membrane by using orientation marks. Prepare pure cultures of the reactive colonies onto fresh agar plates."
  ],
  "subjectAreas": [
    "Microbiology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}