{
  "id": 8732,
  "origin_website": "Jove",
  "title": "Large-scale Three-dimensional Imaging of Cellular Organization in the Mouse Neocortex",
  "procedures": [
    "All experimental procedures were approved by the RIKEN Wako Animal Experiments Committee and RIKEN Genetic Recombinant Experiment Safety Committee and performed according to the institutional guidelines of the animal facilities of the RIKEN Brain Science Institute.\n1. Preparation of Imaging Chambers\nImaging chamber19\nUsing silicone rubber sheets, prepare a chamber with a thickness of approximately 5 mm and floor plates of various thicknesses. Also, prepare Petri dishes with and without a glass bottom (Figure 1A).\nSlice spacer\nPrepare spacers to hold samples, using silicone rubber sheets with a thickness of 0.5 mm (Figure 1C).\n2. Tracer Injection\nNOTE: Make injections into either the pons (2.1) or superior colliculus (2.2). Injection into the pons label sub-cerebral projection neurons in a wide brain region including the visual and motor areas, while injection into the superior colliculus labels sub-cerebral projection neurons in the visual area. For control experiments, inject saline instead of fluorescently-labeled cholera toxin subunit B. For the maintenance of sterile condition use sterilized equipment and plastic gloves cleaned with ethanol.\nMake injections into the pons of adult mice.\nDraw 1 µL of fluorescently-labeled cholera toxin subunit B (25 µg/µL in PBS) into a 26G Hamilton syringe.\nPlace an injector pump on the syringe.\nPlace the syringe and pump on the tool holder of a manipulator placed on a stereotaxic instrument. Tilt the manipulator 12° posteriorly from the vertical axis.\nAnesthetize a male or female adult mouse (C57BL/6J or Tlx3-cre/Ai9) by injecting sodium pentobarbital intraperitoneally (60 mg/kg body weight) or by administering isoflurane (2–3%). Wait until the mouse makes no response when its tail is pinched with forceps, indicating that the mouse is fully anesthetized.\nPlace the mouse on the stereotaxic instrument.",
    "Carefully remove hair using a razor blade to prevent infection and cut 10 mm of the scalp so that the bregma and lambda are visible. Administer 0.1 mL of 1% lidocaine using a pipette. Set the angle of the head by adjusting the vertical position of the mouthpiece on the stereotaxic instrument so that the bregma and lambda have the same z-level.\nAdjust the position of the manipulator by sliding it on the stereotaxic instrument so that the tip of the syringe is close to the bregma and record the position of the manipulator. Retract the syringe by moving the tool holder on the manipulator.\nMove the manipulator 5.4 mm posteriorly and 0.4 mm laterally. Advance the syringe so that the tip is close to the entry point on the skull. Retract the syringe and mark the entry point.\nAt the marked position, drill a hole with a diameter of approximately 1 mm.\nInsert the syringe tip through the hole so that the tip depth is 6.9 mm more than that measured at the bregma.\nInject 1 µL of tracers using the pump at 0.2 µL/min.\nRemove the syringe from the brain.\nIf necessary, cover the exposed brain with small fragments of microfibrillar hemostat and instant adhesive.\nRinse the exposed brain using saline delivered with a pipette to prevent infection and suture the scalp.\nRemove the mouse from the stereotaxic instrument. Allow the mouse to recover from anesthesia in an incubator at 30 ˚C, typically for 1 h. Do not leave the mouse unattended until it has regained sufficient consciousness to maintain sternal recumbency. Return the mouse to the company of other animals after it has fully recovered.\nMaintain the mouse for 3–7 days.\nMake injections into the superior colliculus of adult mice.",
    "Prepare a glass pipette with a tip diameter of 30–50 µm.\nConnect the glass pipette to a Hamilton syringe through a plastic tube (Figure 2A).\nFill the glass pipette, plastic tube, and Hamilton syringe with the paraffin liquid.\nPlace an injector pump on the syringe.\nPlace the glass pipette on the manipulator and tilt the manipulator 60° posteriorly from the vertical axis (Figure 2B).\nPerform 2.1.4–2.1.9. The position of the manipulator is 1.4 mm posterior, 0.5 mm lateral to the lambda.\nPlace a small plastic paraffin film on the skull, then put approximately 1 µL of the tracer solution on it. Quickly advance the glass pipette and fill it with at least 0.5 µL of the tracer solution.\nInsert the glass pipette so that the tip depth is 3.0 mm from the brain surface.\nInject 0.5 µL of tracers using the pump at 0.2 µL/min.\nRemove the glass pipette from the brain.\nPerform 2.1.13–2.1.16.\n3. Fixation and Trimming\nInject sodium pentobarbital (60 mg/kg body weight) intraperitoneally into a mouse (C57BL/6J or Tlx3-cre/Ai9, with or without the tracer injection as described in step 2. Wait until the mouse makes no response when its tail is pinched with forceps, indicating that the mouse is fully anesthetized.\nEuthanize the mouse humanely by perfusing the mouse transcardially20 with 0.9% saline.\nFix the mouse20 by perfusing 4% paraformaldehyde (PFA) in 0.1 M phosphate buffer (pH 7.5).\nCut the scalp using a pair of scissors to expose the skull as described20.\nCut the midline of the exposed skull using a pair of scissors. Remove the skull using forceps.",
    "If marking the position of the bregma and lambda is necessary, first remove one hemisphere of the skull. Insert thin tungsten needles into the brain at the positions of the bregma and lambda on the skull remaining on the brain, then remove the remaining skull.\n\t\tNOTE: The brain can be stored in PBS at 4 ˚C.\nTo perform antibody staining of inhibitory neurons, cut the brain samples into slices.\nPlace the brain sample on a vibratome.\nCut slices up to 500 µm thick in PBS at room temperature and proceed to step 5 (the AbScale method).\nIf antibody staining is unnecessary, trim the brain sample to blocks (up to 3 mm thick) using a razor blade (Figure 3) and proceed to step 4 (the SeeDB method).\n\tNOTE: The brain can be stored in PBS at 4 °C after cutting or trimming. The SeeDB method is preferable when antibody staining is not necessary because it requires less time than the AbScale method.\n4. Clearing without Antibody Staining (the SeeDB Method)\nTransfer the sample using a spatula to a 50 mL plastic tube containing 20 mL of 0.5% α-thioglycerol and 20% (w/v) fructose and incubate it for 4 h with gentle shaking at room temperature.\nTransfer the sample using a spatula to a 50 mL plastic tube containing 20 mL of 0.5% α-thioglycerol and 40% (w/v) fructose and incubate it for 4 h with gentle shaking at room temperature.\nTransfer the sample using a spatula to a 50 mL plastic tube containing 20 mL of 0.5% α-thioglycerol and 60% (w/v) fructose and incubate it for 4 h with gentle shaking at room temperature.",
    "Transfer the sample using a spatula to a 50 mL plastic tube containing 20 mL of 0.5% α-thioglycerol and 80% (w/v) fructose and incubate it for 12 h with gentle shaking at room temperature.\nTransfer the sample using a spatula to a 50 mL plastic tube containing 20 mL of 0.5% α-thioglycerol and 100% (w/v) fructose and incubate it for 12 h with gentle shaking at room temperature.\nTransfer the sample using a spatula to a 50 mL plastic tube containing 20 mL of 0.5% α-thioglycerol and 80.2% (w/w) fructose and incubate it for 24 h with gentle shaking at room temperature.\n\tNOTE: Handle the sample carefully to keep deformations as small as possible. Do not incubate samples longer than indicated, as samples can quickly become opaque.\nEmbed the sample in an imaging chamber filled with the 80.2% fructose solution (Figure 1B). If necessary, fix the sample by putting small pieces of rubber adhesive around. If the chamber is too deep, put a floor plate in the chamber before placing the samples.\nPlace the Petri dish with a glass cover on the imaging chamber and put water in the dish, and image using confocal or two-photon microscopy with a water-immersion long working distance objective. Excitation wavelengths and emission filters are described in Table 1. If necessary, use a motorized stage.\n5. Clearing with Antibody Staining (the AbScale Method)\nPrepare reagents as described in Table 2.\nTransfer the slices using a spatula to a 5 mL plastic tube containing 4 mL of Sca/eS0 solution and incubate them for 12 h with gentle shaking at 37 °C (Figure 4B).\nRemove the solution from the tube using a pipette and add 4 mL of Sca/eA2 solution, and incubate the slices for 36 h with gentle shaking at 37 °C.",
    "Remove the solution from the tube using a pipette and add 4 mL of Sca/eB4 solution, and incubate the slices for 24 h with gentle shaking at 37 °C.\nRemove the solution from the tube using a pipette and add 4 mL of Sca/eA2 solution, and incubate the slices for 12 h with gentle shaking at 37 °C.\nRemove the solution from the tube using a pipette and add 4 mL of PBS and incubate the slices for 6 h with gentle shaking at room temperature.\nCarefully remove the slices to a 2 mL plastic tube using a spatula.\nIncubate with primary antibodies (Table 3) in 1 mL of AbScale solution for 48-72 h at 37 °C (Figure 4C) with gentle shaking.\nCarefully remove the slices to a 5 mL plastic tube using a spatula.\nIncubate in 4 mL of AbScale solution for 2 h 2 times at room temperature with gentle shaking.\nCarefully remove the slices to a 2 mL plastic tube using a spatula.\nIncubate with fluorescently-labeled secondary antibodies (Table of Materials, 1:100) in 1 mL of AbScale solution for 48 h at 37 °C with gentle shaking.\nCarefully remove the slices using a spatula to a 5 mL plastic tube containing 4 mL of the AbScale solution and incubate the slices for 6 h with gentle shaking at room temperature.\nRemove the solution from the tube using a pipette and add 4 mL of the AbScale solution and incubate the slices for 2 h 2 times with gentle shaking at room temperature.\nRemove the solution from the tube using a pipette and add 4 mL of 4% PFA and incubate the slices for 1 h with gentle shaking at room temperature.",
    "Remove the solution from the tube using a pipette and add 4 mL of PBS and incubate the slices for 1 h with gentle shaking at room temperature.\nRemove the solution from the tube using a pipette and add 4 mL of the Sca/eS4 solution, and incubate the slices for 12 h with gentle shaking at 37 °C.\nPlace the spacer on a glass slide and place the slices in the spacer and immerse the slices with Sca/eS4 solution. Seal the spacer with a cover glass (Figure 1D).\nPut water on the cover glass and image using confocal or two-photon microscopy with a water-immersion long working distance objective. If necessary, use a motorized stage.\n\tNOTE: Check whether the deep parts of the sample are labeled similarly to the superficial parts to confirm the absence of a significant labeling bias.\n\tNOTE: Penetration of the tested antibodies is described in Table 3.\n6. Cell Position Determination\nFor each position in the scanned images, calculate correlation values using a three-dimensional image filter14 (Figure 5A-5D).\nDetermine the positions of the peaks of the correlation value (Figure 5D).\nInvestigate images around the peaks to locate cells (Figure 5E).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}