{
  "id": 4582,
  "origin_website": "Bio",
  "title": "Imaging and Quantitative Analysis of Size and Distribution of Spherical Bodies, <EM>e.g.</EM> Embryonic Oil Bodies",
  "procedures": [
    "Sample preparation Remove developing seeds from 2-3 siliques under the binocular with a sharp scalpel and forceps (DUMONT N°5) and place them on a glass slide or in a glass-bottom dish.Add a small volume (between 20 and 30 µl) of Nile Red solution and cover with a cover slip. Remove embryos from the seed teguments by gently pressing seeds between the slide and cover slip with the rounded end of the handle of the scalpel and observe after 30 min of incubation in the dark at room temperature (see Video 1).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Dissecting embryos out of Arabidopsis developing siliques Note: You can use a 60% (v/v) glycerol solution or 0.4 % (w/v) of low melting agarose as mounting medium for your staining solution to better immobilize the embryos for long observation periods. Confocal microscopyFind appropriate embryos and adjust the focus on cotyledon edges using a 40x objective.Set optical parameters to optimize signal to noise ratio.Excitation laser: the argon laser is set at 10% of 488 nm for Nile Red excitation.Emission band of 550 to 650 nm.Capture the images (90 to 100 optical sections of 0.16 µm thickness) with a 40x/1.25 oil objective and 8x digital zooming. Each section is the average of two scans conducted at the resolution of 512 x 512 pixels with a spatial resolution of 0.09 mm x 0.09 mm x 0.16 µm in the x, y, z referential.Notes: The Nile Red stain is highly fluorescent when associated with neutral lipids. Nevertheless you can bleach it if using too high laser power for excitation. According to our experience, reducing the laser power to its minimal value and laser excitation to 10% of laser power is far enough for excellent observation and preserves fluorescence for up to one night.",
    "As the fluorescence signal is usually very strong, you can decrease the pinhole’s size to 0.7 Airy to reduce the thickness of the optical section.  Increasing scanning speed as well as using bidirectional-scanning mode will speed up acquisition. Quantitative analysisObtain images at a similar location from 3 different embryos for statistical analysis.Analyze the images using the following pipeline:The crude image stacks present several characteristics that disturb direct automated counting of the oil bodies (Figure 1). To circumvent this problem, the procedures for image segmentation by watershed and data extraction were implemented in AVIZO® FIRE in a semi-automated pipeline. A specific module (WshedBinSeparate) has been developed in TCL language (Tool Command Language). The outline of the procedure is described in Figure 2. A movie shows the sequence of operations (Video 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150103/20150103192012_6624.jpgFigure 1. 2D/3D view of an image stack with various problems preventing direct use in image analysis. A. Images with high noise; B. Non homogenous objects in size; C. Variable grey levels; D. Objects with touching edges.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180104/20180104175653_6170.jpg Figure 2. Image analysis pipeline. A. Generating binary images with double thresholding; B. Generating watershaded images; C. Individual labelling of objects and 3 D rendering. The segmentation chain in Avizo (left) and the resulting images (right).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 2. OB image processing pipeline  The WshedBinSeparate module allows segmentation of oil bodies images stacks by watershed methods. The input image is a 3D stack in grey scale. The images are first de-noised with a Gaussian filter using ND-SAFIR. Two thresholding operations are then performed with threshold values manually indicated by the operator. The best value is chosen by visual test of various threshold values. The high threshold allows the detection of large objects without worrying about over- or under-estimating them but without consideration of small objects.",
    "The low threshold allows the detection of small objects without worrying about the over- or under-estimation of the large objects. The images are combined to produce a thresholded “binary image”. The 3D distance transform of this binary image is computed (a value is given for each pixel of the image according to its distance to the border of the closest object in the vicinity). The maximum of the distance function produces the “marker image” i.e. the centre of the segmented quasi-spherical filled object. The complement of the distance transform (CDT), with the marker image is used to create the “watershed lines”: the watershed algorithm expands the markers (like inflating a balloon) toward increasing value of the CDT. The watershed lines represent the boundaries separating the objects. Finally, the watershed lines are subtracted from the binary image to obtain separated and individualized objects (“segmented image”). The image of separated objects is then converted to a spread sheet document where each item in the spread sheet is a labeled object volume."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Plant Science"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}