{
  "id": 9920,
  "origin_website": "Jove",
  "title": "SorLA and CLC:CLF-1-dependent Downregulation of CNTFRα as Demonstrated by Western Blotting, Inhibition of Lysosomal Enzymes, and Immunocytochemistry",
  "procedures": [
    "1. Western Blotting of CNTFRα Lysates\nExpress full-length sorLA and Myc-tagged CNTFRα constructs in human embryonic kidney 293 (HEK293) cells using pcDNA3.1/zeo(-) and pcDNA3.1/hyg(-), respectively. Transfect the HEK293 cells with the constructs using a commercial transfection reagent according to manufacturer´s protocol. Select stable clones in medium containing 150 µg/mL Zeocin and/or 500 µg/mL Hygromycin B Gold13.\nSeed equal numbers of HEK293 transfectants expressing either CNTFRα-Myc or co-expressing CNTFRα-Myc/sorLA in two 4-well plates as shown in Figure 1. Culture the cells in Dulbecco Modified Eagle´s Medium (DMEM) supplemented with 10% fetal bovine serum (FBS), 100 U/mL penicillin, and 100 μg/mL streptomycin (full medium) in a 5% carbon dioxide incubator at 37 ˚C.\nWait until the cells are 50 - 80% confluent.\nRemove the medium from the wells, wash once with Dulbecco Phosphate Buffered Saline (DPBS), and add fresh full medium with or without (control) 10 nM CLC:CLF-1 as indicated in Figure 1. Incubate the cells at 37 ˚C.\nAfter 0 and 5 h of incubation, recover the medium and store it at 4 ˚C in 1.5 mL tubes. Then add 1% Triton X-100 lysis buffer (20 mM Tris-HCl, 10 mM EDTA, pH 8.0) supplemented with a proteinase inhibitor cocktail to each well (1 min, 4 ˚C). Subsequently, transfer the cell lysates to 1.5 mL tubes (4 ˚C).\nSpin the tubes containing the medium and cell lysate (3,000 x g, 3 min, 4 ˚C) and transfer the supernatants to 1.5 mL tubes (4 ˚C). Discard the pellet. Transfer 5 μL of each cell lysate supernatant to new 1.5 mL tubes — use them to measure the protein content later (step 1.7). Immediately, add nonreducing LDS sample buffer to all the supernatants and vortex the samples.",
    "Use the 5 μL aliquots to measure the protein content in the cell lysate supernatants using a commercial protein assay according to manufacturer's protocol.\nHeat the samples at 95 ˚C for 5 min.\nSubject an equal amount of protein from each sample to reducing SDS-PAGE13 and Western blotting13 and visualize the content of sorLA, β-actin, and CNTFRα-Myc in the medium and in the cell lysates using rabbit anti-sorLA16 (5 μg/mL), mouse anti-β-actin (0.4 μg/mL), and mouse anti-Myc (1 μg/mL) antibodies and the appropriate HRP-linked secondary antibodies (1:2,000).\nQuantify the bands by densitometry according to manufacturer's protocol.\n2. Immunocytochemistry in Combination with Lysosomal Inhibitors\nSeed HEK293 cells stably transfected with CNTFRα-Myc/sorLA on cover slides in a 4-well plate as shown in Figure 2. Culture the cells in full medium as above.\nWait until cell confluence is 20 - 40%.\nRemove the medium from the wells and add full medium with or without 50 μg/mL of leupeptin and of pepstatin A (leu/pep) (inhibits lysosomal hydrolases) to the cells as indicated in Figure 2. Incubate the cells at 37 ˚C. The medium must be replaced every 6 h during the following 24 h of incubation.\nAfter 24 h of incubation, once again replace the medium (with or without leu/pep) and this time add 10 nM CLC:CLF-1. Incubate the cells at 37 ˚C for 5 h.\nWash the cells once in PBS and fix them in 4% paraformaldehyde, pH 7 for 15 min at RT.\n\tCaution: Paraformaldehyde is highly toxic, avoid contact with skin, eyes, and mucous. Gloves and safety glasses should be worn and solutions made inside a fume hood.\nWash the cells once in PBS and permeabilize the cells for 5 min at RT in saponin diluted in PBS (0.5% saponin).",
    "Dilute goat anti-CNTFRα (1 μg/mL) (notably not the mouse anti-Myc used for Western blotting) and mouse anti-LAMP-1 (15 μg/mL) antibodies in 0.5% saponin and incubate the cells with the antibodies for 2 h at RT.\nWash the cells 4x (5 min) in 0.5% saponin and incubate the cells with donkey anti-goat Alexa 488- and donkey anti-mouse Alexa 568-conjugated secondary antibodies (6 μg/mL) for 2 h at RT.\nWash the cells 4x (5 min) in 0.5% saponin, twice in deionized water (1 min), and mount the cover slides on microscope slides using mounting media.\nAnalyze the antibody-staining of the cells by confocal microscopy using a laser-scanning confocal microscope with a 63X C-apochromat water immersion objective, NA 1.2.\n3. Western Blot-detection of the pSTAT3 Level\nSeed HEK293-sorLA cells (which express endogenous levels of CNTFRα) in a 4-well plate as shown in Figure 3. Culture the cells in full medium as above.\nWait until the cells are 50 - 80% confluent.\nRemove the medium from the wells, wash once in PBS, and add fresh full medium with or without 10 nM CLC:CLF-1 to the cells as indicated in Figure 3. Incubate the cells at 37 ˚C for 5 h.\nRemove the medium, wash the cells twice in unsupplemented DMEM (blank medium; without FBS and antibiotics), and then reincubate the cells for 90 min (37 ˚C) in blank medium.\nOnce again, remove the medium and add fresh blank medium with or without 5 nM CLC:CLF-1 (to initiate STAT3 phosphorylation) as indicated in Figure 3. Incubate for 15 min at 37 ˚C.",
    "Quickly remove the medium and lyse the cells (1 min, 4 ˚C) by adding 1% Triton X-100 lysis buffer (20 mM Tris-HCl, 10 mM EDTA, pH 8.0) supplemented with a proteinase inhibitor cocktail and a phosphatase inhibitor cocktail to each well. Subsequently, transfer the cell lysates to 1.5 mL tubes (4 ˚C).\nTransfer 5 μL of each supernatant to new 1.5 mL tubes — use them to measure the protein content later (step 3.8). Immediately, add nonreducing LDS sample buffer to all the supernatants and vortex the samples.\nMeasure the protein content of the 5 μL aliquots using a commercial protein assay according to manufacturer's protocol.\nSonicate each sample at RT until they are no longer viscous (approximately 1 min) and subsequently heat them at 95 ˚C for 5 min.\nSubject an equal amount of protein from each sample to SDS-PAGE13 and Western blotting13 and visualize the content of pSTAT3 and total STAT3 in the cell lysates using rabbit anti-pSTAT3 (1:2000) and mouse anti-STAT3 (1:1,000) antibodies and the appropriate HRP-linked mouse and rabbit secondary antibodies (1:2,000).\nQuantify the bands by densitometry according to manufacturer's protocol."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}