{
  "id": 19323,
  "origin_website": "Jove",
  "title": "In Vivo Visualization of Spontaneous Activity in Neonatal Mouse Sensory Cortex at a Single-neuron Resolution",
  "procedures": [
    "All the experiments were conducted in accordance with the guidelines for animal experimentation of Kumamoto University and the National Institute of Genetics and approved by the animal experimentation committees.\n1. In utero electroporation (IUE)\nMate male TCA-RFP mice of ICR background with female wild-type ICR mice. Observe the vaginal plug to check for mating early morning of the next day. Observe the abdomen to check for pregnancy 2 weeks later.\nPrepare plasmid solution containing 5 ng/µL TRE-nCre, 1 µg/µL CAG-loxP-stop-loxP-GCaMP6s-ires-tTA-WPRE, and 0.02 % Trypan Blue in ddH2O to sparsely label neurons by GCaMP using the Supernova system8.\nPrepare an analgesic solution by diluting 50 mg/mL carprofen (100x) to a final concentration of 0.5 mg/mL. Keep it at room temperature.\nAt embryonic day (E)14, perform IUE as follows. The IUE methods are essentially the same as previous reports9,10,11.\n\t\nWipe the lab bench with 70% ethanol. Sterilize all surgical instruments with 70% ethanol. Wear a mask and a lab coat to reduce the risk of infection to the mouse.\nPrepare glass micropipettes using a micropipette puller. Take the plasmid mixture solution into the glass micropipette using an aspirator tube.\nAnesthetize the pregnant mice at E14 with sodium pentobarbital intraperitoneal injection (50 mg/kg body weight). Keep the mice anesthetized during the procedure with isoflurane (0.8%-1.2% in air). Pinch the toe to ensure that the anesthesia is deep enough. Use eye drops to prevent eye dryness.\nSterilize the abdominal area with 70% ethanol and make a midline incision. Place a saline-moistened non-woven fabric around the incision. Expose the uterus onto the fabric.\nRepeat dripping warm saline onto the uterus to prevent it from drying or cooling until abdomen closure (Step 1.4.8).\nInject the plasmid solution into one side of the lateral ventricle of embryos one by one using a micropipette and an aspirator tube.",
    "Use a forceps-type electrode to pinch the embryo heads and deliver square electric pulses (40 V, 50 ms) five times at 1 s intervals using an electroporator.\nReturn the uterus to the abdominal cavity. Apply ~3 mL of warm saline into the cavity. Suture the peritoneal membrane and the abdominal skin. Administer the analgesic solution at 10 µL/g weight (carprofen at 5 µg/g weight) under the skin at the back of the neck.\nPlace the mouse on a heater (37 °C) to recover from anesthesia. Lay the mouse on its belly to prevent its tongue and saliva from choking the throat. Keep the mouse apart from other mice and monitor it until it recovers to move normally. Return the mouse to the cage.\nAfter birth, perform genotyping to check for RFP allele, and euthanize the pups without the allele. This step is recommended, especially if imaging is done during the second postnatal week when the TCA-RFP signal is weak and difficult to check at step 2.2.7.\n2. Cranial window surgery\nPrepare the cortex buffer containing 125 mM NaCl, 5 mM KCl, 10 mM glucose, 10 mM HEPES, 2 mM CaCl2, and 2 mM MgSO4 in ddH2O (pH adjusted to 7.4 with 1 M NaOH)12 before the day of surgery. Sterile the buffer using a vacuum filter.\n\tNOTE: The buffer can be kept at 4 °C for up to 3 months. The required volume is 5-10 mL per pup.\nPerform the following steps at P3-12. Also see the previous reports that have described this procedure13,14.\n\t\nMix 50 mg of agarose with 5 mL of cortex buffer and completely dissolve the agarose by heating. Take some of the solution into a 1.5 mL tube and keep it at 42 °C.",
    "Take some cortex buffer into a 50 mL conical tube and keep it at room temperature. Take some saline into a container (e.g., a cap of a 50 mL conical tube) and keep it at room temperature.\nPrepare an analgesic solution by diluting 50 mg/mL carprofen for 100x to be 0.5 mg/mL. Take some of the solution in a 1.5 mL tube and keep it at room temperature.\nSterilize all surgical instruments with 70% ethanol.\nPlace a pup in an acrylic anesthetic container and anesthetize by putting an isoflurane-soaked paper in the container. Pay attention to the pup and take it out when its breathing slightly slows down.\n\t\tNOTE: If the anesthesia is prolonged, the pup's breathing may cease for a few seconds. Even if the pup's breathing is resumed, prolonged anesthesia may decrease the pup's cerebral blood flow and cause irreversible brain damage.\nMake a scalp incision to expose the skull of the plasmid-introduced side. Place the pup onto the heating pad (35 °C) under a fluorescence stereo microscope. Always keep the pup anesthetized with isoflurane (1.5%-2.5% in air).\nSelect the pups expressing TCA-RFP and GCaMP by observing the fluorescence through the skull. Euthanize the pups that do not express both.\nRemove the scalp above the cerebral hemispheres as widely as possible carefully so as not to cause bleeding. Rub the skull with a saline-soaked cotton swab to remove connective tissue.\nAfter the skull dries, adhere the incised scalp surface to the skull with a tissue adhesive.\nTransfer the pup onto a 37 °C heating pad to recover from anesthesia. Wait for at least 15 min to let the adhesive solidify.\n\t\tNOTE: Pause for up to 1 h before moving on to the next step. Prepare other pups in a similar manner if needed during this time.",
    "Anesthetize the pup with isoflurane. Place the pup onto the heating pad (35 °C) under a fluorescence stereo microscope while anesthetized (1.5%-2.5% isoflurane in air).\nMark the GCaMP-expressing location on the skull with a permanent marker. Apply cortex buffer onto the location.\nInsert the corner of a razor blade into the skull. Push the blade slowly to shave off the skull and make a hole. Pinch off the cracked skull with tweezers and remove it.\nCheck that the cranial hole is successfully made by observing blood vessels in the hole. If bleeding occurs, quickly rinse the hole with cortex buffer using a micropipette. Repeat rinsing until the bleeding stops completely.\nApply a drop of cortex buffer to the cranial hole and place in a 3-mm-diameter round coverglass over the hole. Wipe away the excess buffer with non-woven fabric. Wait until the area around the glass dries.\nApply warm agarose solution around the glass edge using a micropipette. Because too much agarose may reduce the fluorescent signals, remove the excess solution under the glass by gently pushing the glass from above.\nRemove the agarose on the glass or distant from the glass edge using tweezers. Leave agarose only around the outer glass perimeter.\nWait until the agarose solidifies. If agarose shrinkage makes a space under the glass, add agarose solution from the side to cover the entire glass edge. Remove any liquid from the skull surface with non-woven fabric.\nMix acrylic resin powder and liquid in a rubber container. Aspirate the mixture with a micropipette and pour it to cover the agarose surrounding the glass edge with resin.",
    "NOTE: Because the resin solidifies soon after mixing the powder and liquid, they need to be mixed repeatedly before applying. The amounts needed in each mixing are ~500 µL for liquid and ~0.15 g for powder.\nFix a titanium bar with resin on the contralateral hemisphere. Keep the bar angle parallel to the cover glass. Fix the entire skull surface with resin.\nAdminister the analgesic solution at 10 µL/g weight (carprofen at 5 µg/g weight) under the skin at the back of the neck. Return the pup to a 37 °C heating pad for anesthesia recovery. Wait for >60 min for resin solidification before imaging.\n\t\t​NOTE: Pause for 1-5 h before imaging. Perform surgery on other pups in a similar manner during this time.\n3. Two-photon calcium imaging\nAttach a two-axis goniometer with a titanium plate to a stage plate with XY positioning beneath the microscope. Set up a heating pad (35 °C) on the stage.\nTurn on the scanning software with the following conditions: Pixels, 512 x 512; Bidirectional, ON; Averaging, none; imaging area, 600 x 600 µm with a 20x objective. Set the settings so that the scan rate is faster than 1 Hz.\nPlace the pup on the heating pad, and fix the head-mount titanium bar to the titanium plate with screws. Keep the pup anesthetized by placing a tube port for isoflurane (1.5-2.0% in air).\nAdjust the window angle horizontally by the goniometer. Turn on the backlight and observe the brain surface with a 5x objective lens, and select the imaging area by XY positioning.\nPut eye drops on the cranial window. Switch the objective to a 20x water-immersion lens. Observe the cortical surface to confirm that blood flow is seen on the brain surface.",
    "Turn off the backlight and scan the brain surface using one-photon mode. Increase the laser power to make the green autofluorescence of the glass and the brain surface visible.\nLower the isoflurane concentration to 1.0%-1.5%. Cover the microscope to avoid light leaks. Switch the scanning software to two-photon mode.\nAdjust the laser power and detector gain appropriate for scanning GCaMP and RFP signals. Find the depth where TCA-RFP signals are seen. Make sure that the depth is layer 4, ~300 µm lower than the brain surface at P6. Select the imaging area where many GCaMP-expressing neurons are seen.\nStart timelapse imaging of GCaMP and RFP signals. If two-channel simultaneous scanning is inapplicable, capture GCaMP and TCA-RFP images before the imaging.\nStop isoflurane to weaken the anesthesia and observe spontaneous activities for ~20 min. When the pup starts moving, stop imaging and anesthetize the pup again (induce with 2% isoflurane, and then lower to 1.2%-1.5% in air).\nAfter the pup stops moving, repeat the imaging from Step 3.9. Change the imaging area if needed.\nFix the brain by transcardial perfusion of saline and 4% PFA, followed by post-fixation in 4% PFA overnight to prepare tangential slices and perform immunohistochemistry. Otherwise, euthanize the pup with an overdose of anesthetic followed by decapitation.\nEuthanize the mother mouse with an overdose of anesthetic followed by cervical dislocation.\n4. Analysis\nStart MATLAB and run EZcalcium toolbox15 to open a graphical user interface (GUI) 'Initial GUI'.\nCompensate for the image frame drifts due to mouse movements or other causes.\n\t\nClick Motion Correction in the Initial GUI to open the Motion Correction GUI. Click 'Add Files...' to load a TIF file of the imaging data.",
    "Set the settings as follows: Non-rigid Motion Correction, blank; Upsampling Factor, 50; Max Shift, 15; Initial Batch Size, 200; Bin Width, 200. Click 'Run Motion Correction' to execute the correction. Motion-corrected imaging data will be saved automatically.\n\t\tNOTE: The settings should be adjusted to the imaging data properties. If the drifts of some frames are not compensated because of nonlinear frame distortions or movement of the cortex in the depth direction, open the original imaging data without correction in ImageJ Fiji and remove the frames, and restart step 4.2.\nDetect neurons and draw regions of interest (ROIs).\n\t\nClick Automated ROI Detection in the Initial GUI to open the ROI Detection GUI. Click Add Files... to load the motion-corrected imaging data.\nSet the settings as follows: Initialization, Greedy; Search Method, Ellipse; Deconvolution, Constrained FOOPSI-SPGL1; Autoregression, Decay; Estimated # of ROIs, 60 (more than double the number visually detected is recommended); Estimated ROI Width, 17 (~20 µm); Merge Threshold, 0.95; Fudge Factor, 0.95; Spatial Downsampling, 1; Temp. Downsampling, 1; Temp. Iterations, 5.\n\t\tNOTE: The settings should be adjusted to the imaging data properties.\nClick Run ROI Detection to execute the detection. ROI data will be saved automatically.\nClick ROI Refinement in the Initial GUI to open the ROI Refinement GUI. Click Load Data to load the ROI data. Select the ROIs that had low activity frequency (<1 Hz), located under the skull, or contained other neurons' neurites. Click Exclude ROI to exclude the ROIs from the analysis.\nSelect the Data Export Format to XLSX and click Export Data to obtain an Excel file with raw dF/F values. The dF/F uses equation (1), where F is the average intensity of pixels in every frame, F0 is the baseline signal intensity, and Fb is the background fluorescence.\nimgsrc://cloudfront.jove.com/files/ftp_upload/65899/65899eq01.jpg     (1)",
    "Calculate the Pearson's correlation coefficient of dF/F between ROIs and make a correlation coefficient matrix. Only use dF/F after anesthesia has weakened and spontaneous activity has begun to occur (~10 minutes after stopping isoflurane).\nDefine the barrel edges from the TCA-RFP image using Fiji. Categorize the ROIs to their respective barrels or septa. Compare the pairwise correlation within the same barrel and that between different barrels.\nGenerate 1,000 to 10,000 surrogate data by randomly shuffling the correspondence between ROI and Ca2+ traces. Calculate the average correlation coefficient within individual barrels in each surrogate data, and evaluate the statistical significance of the correlation in the real data.\n\tNOTE: If one of 10,000 surrogates has a value higher than the real value, the statistical significance is 0.0001. The analyses described in steps 4.5 and 4.6 can be conducted for pooled data from multiple animals, as performed elsewhere7,16.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}