{
  "id": 9142,
  "origin_website": "Jove",
  "title": "Enrichment of Bruch's Membrane from Human Donor Eyes",
  "procedures": [
    "Human eye tissue consented for research purposes was obtained from the Manchester Royal Eye Hospital Eye Bank following the removal of the cornea for transplantation. The use of human tissue for research was in accordance with the Human Tissue Act (2004) guidelines, and with University Research Ethics Committee approval (reference 11305).\n1. Enrichment of Whole Bruch’s Membrane\nClean the workspace around and underneath the dissecting microscope with 1% disinfectant (v/v) and then wipe down with 70% (v/v) ethanol.\nEnsure the following are to hand: one new disposable scalpel, two sterile cell scrapers (commonly used in tissue culture) and three pairs of tweezers (listed here as A, B, and C, see materials list).\nPlace the eye globe into a disposable petri-dish, retaining the lid for later use. Using a new disposable scalpel, remove any residual optic nerve, which may interfere with creating a flat mount of the tissue. Next, make four incisions equally spaced apart to create four quadrants, if proceeding to part 3 (enrichment of macular Bruch’s membrane) do not cut through the macula region.\n\t\nEnsure that the incisions extend through the entire depth of the eye tissue – from the innermost neurosensory retina (NSR), through the choroid and sclera (white of the eye). Continue the incision all the way round the eye from the margin of the eyecup to the optic nerve. This will allow the eyecup to be flattened out (see Figure 1B).",
    "Holding one quadrant of flattened eyecup using tweezer A (to prevent choroid detachment), use the larger tweezer B to grip the vitreous and underlying NSR and pull this tissue away from the retinal pigment epithelium (RPE) starting at the periphery, moving towards the center of the opened eyecup and then to the opposing side. Usually, but not always both vitreous and NSR detach as one. Use the scalpel to excise any residual NSR anchored at the optic disc.\nAgain, whilst holding one quadrant of tissue in place using tweezer A, use the sterile cell scraper to gently dislodge the RPE monolayer from the entire inside surface of the eyecup. These cells readily detach and can be seen as dark brown-pigmented clumps. Rinse with PBS to gently wash away dislodged RPE cells from the eyecup.\nNext, use tweezer A to gently peel off the overlying dark red tissue (comprising both Bruch’s membrane and the choroid) from all 4 eye quadrants. Place the excised tissue into a clean dish.\nUsing the flattened edge of one cell scraper to hold the excised tissue in place, use the second scraper to gently scrape the tissue. Turn the tissue over and repeat, removing as much excess material as possible. Eventually, a translucent membrane will remain: this is the crudely enriched Bruch’s membrane. The use of the dissecting microscope at a minimum of 20X magnification is essential in aiding the removal of choroid and enrichment of Bruch’s membrane.\nUsing a Pasteur pipette, briefly rinse the Bruch’s membrane with ultrapure water to remove residual choroid and blood before placing the membrane into a 1.5 ml microcentrifuge tube.",
    "Suspend the enriched Bruch’s membrane in approximately 1 ml ultrapure water and vortex briefly (approximately 15 sec) to help lyse any contaminating cellular matter (see Figure 2). Centrifuge the sample at 500 x g for 30 sec to pellet the membrane and aspirate off the supernatant.\n\tNote: The remaining enriched Bruch’s membrane is now ready for solubilization (as described in section 2 below) or storage at -80 °C for use later.\n2. Solubilization of Whole Enriched Bruch’s Membrane and Western Blot Analysis\nExtract protein from enriched Bruch’s membrane by immersing the tissue in 500 µl 8 M urea for 6 hr at RT in 1.5 ml microcentrifuge tubes ( Figure 3A).\nCentrifuge solubilized samples at 10,000 x g for 10 min to pellet any remaining extracellular matter. Remove the supernatant and transfer it to 3,500 Da MWCO dialysis membrane, then place the sample in 1 L of PBS to dialyse for 16 hr at 4 °C.\nFor each sample, add 40 µl of protein isolation beads, and rotate sample/bead mix (20 rpm on a rotating mixer) at RT for 30 min.\nCentrifuge samples at 10,000 x g for 5 min to pellet the beads. Remove supernatant and solubilize protein bound to beads in 30 µl 2x sample loading buffer (65.8 mM Tris-HCl, pH 6.8, 2.1% SDS, 26.3% (w/v) glycerol, 0.01% bromophenol blue, 3% β-mercaptoethanol).\nIncubate the samples at 100 °C for 10 min, and then centrifuge at 10,000 x g for 5 min to pellet the remaining beads.\nLoad the supernatant that contains the released proteins on to a pre-cast SDS-page gradient gel (see materials list) for protein separation.\nVisualize separated protein bands using a common staining protocol, e.g., Coomassie blue.",
    "In brief, add 20 ml of the brilliant blue stain (0.1% brilliant blue (w/v), 50% methanol, 10% glacial acetic acid, 40% water) to the gel, and incubate for 30 min at RT with gentle agitation.\nDiscard the staining solution and wash the stained gel with deionized water until background staining is sufficiently reduced to allow stained protein band visualisation.\nAlternatively, transfer separated protein bands to nitrocellulose for western analysis, as described below.\nTransfer separated protein bands onto nitrocellulose membrane at 80 mA for 2.5 hr using semidry transfer apparatus in transfer buffer (25 mM Tris, 192 mM glycine, 10% [v/v] methanol).\nBlock the membrane in 10 ml PBS, 10% (w/v) milk, and 0.02% (w/v) BSA for 16 hr at 4 °C before the addition of the desired primary antibodies for protein detection.\n\tNote: As an example here, Figure 3C shows a representative immunoblot of solubilised Bruch’s membrane from three separate donors probed for a regulator of the complement cascade, factor H-like protein 1 (FHL-1).\n3. Enrichment of Macular Bruch’s Membrane\nFollow steps 1.1 - 1.3 as previously described.\nWhilst the NSR is still in place, locate the yellow foveal colouration that represents the central macula region (see Figure 4). Using a sterile 6 mm biopsy punch, place it above the foveal region and firmly cut in to the macula.\n\t\nKeeping the biopsy punch in place, make a separate incision with a scalpel from the edge of the eyecup to the edge of biopsy punch blade, and then using tweezer B, peel away the surrounding eye material to achieve a clean biopsy.\nUsing tweezer C, remove the 6 mm disc of tissue from the punch and place on the clean petri dish lid. Place the petri dish lid and macular punch under the dissecting microscope.",
    "Remove the thin NSR disc (check for yellow foveal staining to infer accuracy of biopsy). Use a sterile cell scraper to gently remove the RPE cells.\nSecure the macular disc via the sclera using the tips of tweezer A, and slowly peel off the choroid and Bruch’s membrane complex using tweezer C. Again, use the cell scraper to remove unwanted choroid and blood matter from Bruch’s membrane.\nPlace the macular Bruch’s membrane into a 1.5 ml microcentrifuge tube and suspend in 1 ml ultrapure water. Vortex briefly (approximately 15 sec) to help lyse any contaminating cellular matter. Centrifuge the sample at 500 x g for 30 sec to pellet the membrane and aspirate off the supernatant.\n\tNote: The enriched Bruch’s membrane isolated from the macula can now be used for proteomic analysis using the user’s preferred digestion protocols."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}