{
  "id": 5454,
  "origin_website": "Bio",
  "title": "<em>In vitro</em> Detection of Neutrophil Traps and Post-attack Cell Wall Changes in <em>Candida</em> Hyphae",
  "procedures": [
    "Growth of Candida albicans hyphae (3 days; see Figure 2A for a schematic of the procedure).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170328/20170328030951_5751.jpgFigure 2. Schematic of the first three steps of the protocolStreak the appropriate strain of C. albicans to single colonies from a frozen 25% glycerol stock onto YPD agar (see Recipes) and incubate at 37 °C overnight. For these experiments, we use the WT-FarRed670 strain of C. albicans (Genotype: PENO1::PENO1-FarRed670-NATR; [Hopke et al., 2016]). The next day pick a single colony and transfer into 5 ml of YPD liquid (see Recipes). We put the 5 ml in 16 x 150 mm flint glass tubes with caps and incubate at 30 °C on a roller drum overnight. Harvest the YPD culture and count the yeast using a hemocytometer. Dilute into 30 ml of RPMI at a concentration of 2.5 x 106 cells/ml and divide into 5 ml aliquots. Incubate at 30 °C on a roller drum overnight. Pool the RPMI cultures into a 50 ml conical tube and spin down at 3,000 x g for 5 min. Remove most of the supernatant (so only about 5 ml remains) and then flick to resuspend the pellet in remaining liquid. Due to the morphology of the hyphae, you cannot use a hemocytometer to determine cell number, instead we used the spectrophotometer to estimate the concentration of the hyphae. An OD600 of 1 is equivalent to 1 x 107 cells/ml. While quantification of hyphae by OD600 is not as accurate as for quantifying yeast, we found it to provide reproducible results. Adjust to 3 x 108 cells/ml to use as a stock solution in the assay.",
    "Note: You will have a highly concentrated number of hyphae in a small volume, so it is best to do a dilution before finding the OD600 to ensure you fall within a readable range and to conserve cells. Our cuvettes usually take 1 ml, so we take 100 µl hyphae and add it to 900 µl PBS. PBS will then serve as your blank control. Isolation of mouse bone marrow (1-2 h; see Figure 2B for a schematic of the procedure; for a detailed video protocol see [Swamydas and Lionakis, 2013])Euthanize two C57BL/6J female mice of 6-10 weeks of age via CO2 inhalation followed by cervical dislocation. Dissect the hind legs to acquire the femurs and tibiae. Remove all the flesh and transfer into a Petri dish with PBS + 5% FBS (see Recipes). Fill a 10 ml syringe with the PBS + 5% FBS and attach a 25 G 5/8 needle. Insert the needle into the bones and expel the liquid from the syringe to force out the bone marrow into the Petri dish (you can clip the ends of the bones if it is difficult to insert the needle). When all the bone marrow has been released into the Petri dish, pass it through a 70 µm cell strainer and into a 50 ml conical. Centrifuge at 300 x g for 3 min.Notes:  It is best to expel the bone marrow in a Petri dish that has no remnants of soft tissue. The tissue will clog the needle. If necessary, you can finish cleaning the bones in one Petri dish and then move the bones to another one with PBS + 5% FBS before expelling the marrow.",
    "All animal studies were carried out in accordance with the recommendations in the Guide for the Care and Use of Laboratory Animals of the National Institutes of Health. Animals were euthanized by carbon dioxide inhalation. Infected animals were monitored twice daily for signs of infection and morbid animals were euthanized. The UMaine IACUC/Ethics Committee approved this protocol. Isolation of neutrophils from mouse bone marrow via AutoMACs (1.5-2 h; see Figure 2C for a schematic of the procedure)Discard the supernatant and resuspend the pellet by flicking the conical tube. Add 3 ml of Tris/ammonium chloride (TAC) buffer (see Recipes) and incubate at room temperature for 1 min to lyse any red blood cells. After the incubation, dilute to 30 ml total with PBS + 2% FBS. Take 10 µl of the bone marrow solution and add it to 40 µl Turks solution (see Recipes). Count the cells on a hemocytometer. Centrifuge the bone marrow solution at 300 x g for 3 min. Discard the supernatant and flick resuspend the pellet in PBS + 2% FBS at a concentration of 1 x 108 cells/ml. Incubate with anti-Ly6G biotin antibody (stock at 0.5 mg/ml) at 1 µl antibody per 100 µl bone marrow on ice for 15 min. Wash by centrifuging at 300 x g for 3 min and discarding the supernatant. Resuspend in 10 ml PBS + 5% FBS then centrifuge again. Discard the supernatant and resuspend again in 10 ml PBS + 5% FBS. Incubate with anti-biotin magnetic beads (10 µl/1 x 107 cells) on ice for 30 min. Agitate periodically throughout the incubation. Wash once with 10 ml PBS + 5% FBS as outlined above. Resuspend the pellet in 1 ml of PBS + 5% FBS.Note: During this time turn on the AutoMACS and run the CLEAN cycle.",
    "Once finished put clean 50 ml conical tubes in the positive and negative ports. Put the bone marrow at the intake port and run the positive selection program. When all but 0.2 ml of the volume has been taken up the intake, add 1 ml PBS + 2% FBS. This ensures that all of the residual sample is loaded onto the column without significantly increasing the volume. Collect both the positive and negative fractions*. Centrifuge the positive fraction at 300 x g for 3 min. Discard the supernatant and resuspend in 2 ml of RPMI + 5% FBS. Take 10 µl and add to 90 µl trypan blue before counting neutrophils on a hemocytometer.*The negative fraction is saved because it can be re-run if there is an issue with the machine and the neutrophils are not separated. It can be discarded once you have confirmed the presence of neutrophils in the positive fraction. Alternatively, the negative fraction can be used to generate bone marrow derived macrophages.Notes: Turks solution is used to count cells in collected bone marrow because it is effective at lysing red blood cells that are not lysed by the TAC treatment. It is important to lyse red blood cells because it makes it much easier to count white blood cells.The expected yield from tibiae and femurs from two BL/6J mice is around 1 x 108 cells. The expected yield of neutrophils from two BL/6J mice is usually at least 1.4 x 107cells. Neutrophil purification is monitored by light microscopy during counting on the hemocytometer. Additional confirmation can come from labeling with anti-Ly6G antibodies and analysis with flow cytometry (see [Swamydas and Lionakis, 2013]).The details of this process will vary depending on the specific magnetic cell sorter.",
    "These details are for the AutoMACS (Miltenyi), although purification can be performed manually with Miltenyi columns instead.A video explaining clearly how to use the AutoMACS is available from the manufacturer. See the following URL: https://www.youtube.com/watch?v=h06klEgji4o[href=https://www.youtube.com/watch?v=h06klEgji4o]. Biotinylation and fluorescent strepavidin labeling of C. albicans hyphal cell wall.Note: To examine interaction of neutrophils with the cell wall, a fluorescent label can be used. This labeling can be done in parallel with the neutrophil separation from bone marrow. While we did not typically use this step in the experiments involved in looking at NETs, it was used extensively in other assays looking at neutrophil mediated changes to the fungal cell wall. A basic diagram of the C. albicans cell wall is shown in Figure 1A. Detailed schematics of C. albicans cell wall are widely available in the literature (see [Perez-Garcia et al., 2011]):  This protocol uses the FluoReporter® Cell-Surface Biotinylation Kit. In this kit, amine-reactive biotin bonds covalently with cell wall proteins. Using a new kit, take one biotin vial and resuspend it in 250 µl DMSO to make a 0.2 mg/ml stock solution of biotin-XX SSE. This can be stored at -20 °C and reused in later experiments until gone. With your C. albicans at 3 x 108 cells/ml, take enough volume so that you will have 3 x 107 cells for each sample you are going to run. To maintain this concentration, do all wash steps with the same volume of liquid and with 30 sec spins at 15,000 x g in a microcentrifuge. Wash once with PBS + Na2CO3 at pH 8 (see Recipes). Resuspend the hyphae in PBS + Na2CO3 (pH 8) and stain with biotin-XX SSE at 0.01 µg/µl for 15 min at room temperature.Wash three times with PBS pH 7.2. Resuspend in PBS pH 7.2.",
    "Stain with a fluorescently labeled streptavidin at 36 µg/ml for 30 min at room temperature. Wash once with PBS pH 7.2 and resuspend in PBS pH 7.2 until ready for use with neutrophils.Note: The fluorescent label used will depend on the experiment. During cell wall damage experiments, we typically used Alexa Fluor 647-conjugated streptavidin so that green and red fluorescent channels could be used for other labels.  Hyphal/Immune cell interaction (2.5 h)Incubate 3 x 107 hyphal cells with or without 7 x 106 neutrophils in 1.7 ml microcentrifuge tubes with RPMI + 5% FBS, in a total of 1.7 ml, on a rotator at 37 °C for 2.5 h. The sample without neutrophils serves as a control.Note: It is important to have the microcentrifuge tube almost completely full of media so that neutrophils and hyphae do not get trapped and dried out on the sides of the tube in an air pocket. Staining for NET visualization (3 h; for a schematic diagram of the staining process see Figure 3A)imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170328/20170328032634_4365.jpgFigure 3. Schematic of the staining steps of the protocolNote that all steps are done on ice and with ice-cold buffers, unless specified otherwise. This prevents any additional metabolic functions in these live cells.Spin down the samples in a microcentrifuge at max speed (15,000-21,000 x g) for 30 sec. Remove the supernatants and wash once with 500 µl of PBS. Resuspend in 200 µl of PBS + 2% BSA to block the samples. Incubate at room temperature for 30 min. At this point, split all the samples in half, one will receive primary antibody and the other will not to serve as a control. Spin samples in the microcentrifuge tube and discard the supernatant.",
    "Resuspend the samples in 100 µl PBS + 2% BSA with primary antibody or with just PBS + 2% BSA (no primary control). The primary antibody can either be anti-myeloperoxidase (0.1 mg/ml) or anti-histone H3 citrulline R2+R8+R17 (0.014 mg/ml). Incubate the samples on ice for 1 h. Wash the samples 3-5 times with 500 µl PBS. After the final wash, resuspend all samples (both the primary and the no primary controls) in a total of 100 µl PBS + 2% BSA with Sytox Green (156 nM), calcofluor white (25 ng/ml) and secondary antibody. For the samples stained with anti-MPO primary, the secondary antibody we used was donkey anti-goat IgG Cy3 (0.007 mg/ml) and for the samples stained with anti-histone, the secondary we used was donkey anti-rabbit IgG Cy3 (0.0075 mg/ml). Note: Sytox Green is a non-membrane permeable DNA stain which will fluoresce brightly after binding the extracellular DNA found in NETs. CFW is a stain for chitin in the fungal cell wall.Incubate for 30 min at room temperature.After incubation, wash the samples 3-5 times with PBS and resuspend in 35 µl of PBS. Visualizing neutrophil mediated disruptions of the fungal cell wall (for a schematic diagram of the staining process see Figure 3B)As an alternative to staining for NET components, a slight alteration of the protocol will allow the visualization of neutrophil mediated changes to the fungal cell wall. This involves staining with sDectin-1-Fc to look for the exposure of the inflammatory fungal pathogen associated molecular pattern β-glucan, staining with calcofluor white to look for changes in fungal chitin and the fluorescent labeling of the outer cell wall as outlined in step 4 to examine immune mediated disruptions of this outer layer. Steps 1-5 are followed as outlined above but step 6 is skipped.",
    "Spin down the samples in a microcentrifuge at max speed for 30 sec. Remove the supernatants and wash once with 500 µl of PBS.Resuspend in 200 µl of PBS + 2% BSA to block the samples. Incubate at room temperature for 30 min. Resuspend the samples in a total of 50 µl PBS + 2% BSA with sDectin-1-Fc at 17 µg/ml. Incubate on ice for 1 h.Wash the samples 3-5 times with 500 µl PBS. After the final wash, resuspend all samples in a total of 200 µl of PBS + 2% BSA with calcofluor white (CFW; 25 ng/ml) and donkey anti-human IgG Cy3 secondary antibody (0.8 mg/ml). Incubate for 30 min at room temperature. After incubation, wash the samples 3-5 times with PBS and resuspend in 35 µl of PBS. Note: In order to reduce the amount of sDectin-1-Fc used per sample, the sDectin-1-Fc staining step is typically done in a smaller volume (50 µl) than the blocking or secondary antibody steps which are done with 200 µl.The samples are now ready to visualize by fluorescence microscopy. Using clean glass slides, load 5 µl of sample and place a coverslip on top. The coverslip can be sealed with nail polish to prevent drying out during imaging. Depending on the experimental question, random fields of view or specific sites were chosen and imaged. Once set, the exposure times for all channels were kept the same for all images. An equal number of images were obtained from all samples for use in analysis. The hyphae will have the chitin in their cell walls stained with the CFW. Areas of exposed β-glucan that is bound by sDectin-1-Fc will be marked by Cy3 fluorescent signal (shown via diagram in Figure 1B and via microscopy in Figure 4).",
    "Areas of neutrophil attack of the outer cell wall can be detected by examining the loss of fluorescent streptavidin signal (Figure 4A). A viability indicator is usually included by using a C. albicans strain with cytoplasmic fluorophore expression. For these experiments, a prototrophic WT-GFP strain (Genotype: SC5314 Peno1::Peno1-EGFP-NATR; [Wheeler et al., 2008]) was typically used."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Microbiology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}