{
  "id": 4910,
  "origin_website": "Bio",
  "title": "Preparation and Analysis of Crude Autolytic Enzyme Extracts from <em>Staphylococcus aureus</em>",
  "procedures": [
    "Preparation of the crude autolytic extracts from S. aureus cellsThe working area was decontaminated with 70% ethanol (v/v) using paper towels and the burner was turned on. This procedure was done throughout the protocol every time sterile conditions were needed (Note 1).The bacterial S. aureus strains of interest were inoculated on TSA plates by streak plating using 1 μl loops and incubated overnight in a 30 °C incubator (Note 2).Under sterile conditions, a single isolated colony was picked with a 1 μl loop and inoculated in 10 ml of TSB in a 100 ml Erlenmeyer flask. Cultures were grown overnight (16 h-18 h) in a 30 °C incubator shaker at 200 rpm.The optical densities at λ = 600 nm of the overnight cultures were measured after making a 1/10 dilution (100 μl of culture in 900 μl of TSB) in a cuvette, under sterile conditions.The volume required for a starting OD600 of ~ 0.05 was taken from the overnight cultures and inoculated in 250 ml of TSB in a 1 L Erlenmeyer flask. The cultures were grown in a 30 °C incubator shaker at 200 rpm.The centrifuge JA-26 XPI was prepared by placing the JA-14 rotor and cooling it down to 4 °C.An ice/ethanol bath was prepared and kept at 4 °C: The ice was poured into a container and absolute ethanol was homogenously spread onto it. The flask of Washing buffer solution, the JA-14 and JA-20 centrifuge tubes were placed in it to cool down.When the cultures reached an OD600 ~ 0.3 (which should take about 3 h), they were put in the ice/ethanol bath (Note 3). The cultures were transferred into cold JA-14 centrifuge tubes. The tubes were balanced and the cells were pelleted at 4 ºC, 15,050 x g for 15 min.",
    "After centrifugation, the JA-14 rotor was replaced by the JA-20, which was cooled down to 4 °C.The supernatants were discarded by inversion of the tubes.The cells were resuspended in 20 ml of ice-cold Washing buffer and transferred to cold JA-20 centrifuge tubes. Washing buffer was added to the maximum capacity of the tubes (~46 ml).Cells were centrifuged as before (step A9).The supernatants were carefully removed using a 25 ml glass (or plastic) pipette until a semidry pellet was left at the bottom of the tubes.The cells were carefully resuspended in 250 μl of 4% SDS (w/v), transferred to a 1.5 ml micro tube and incubated in a thermomixer at 25 °C, 700 rpm for 30 min (Note 4).After incubation, the cells were harvested using a bench centrifuge at 22,380 x g, for 15 min, room temperature (RT).The supernatants, containing the crude enzyme autolytic extracts, were transferred to clean micro tubes.The extracts were quantified in the Nanodrop (Proteins-280 nm) using a 2 μl aliquot. Mili-Q water was used as a blank.Each extract was divided into 50 μl aliquots, frozen in liquid nitrogen and stored at -80 °C until further use (Note 5).Preparation of substrate cells for gel zymogramsFor preparation of substrate cells, the S. aureus NCTC8325-4 and the M. luteus DSM20030 strains were plated on TSA and LA plates, respectively, by streak plating using 1 μl loops, and incubated in a 37 °C incubator. S. aureus was incubated overnight and M. luteus for at least 24 h (Note 2). Under sterile conditions, a single isolated colony of each strain was picked with a 1 μl loop and inoculated into 10 ml of TSB or LB in 100 ml Erlenmeyer flasks. Cultures were grown overnight (16 h-18 h) in a 37 °C incubator shaker at 200 rpm.",
    "The optical densities at λ = 600 nm of the overnight cultures were measured after 1/10 dilution, using as blanks 1 ml of the sterile TSB or LB. The volume required for a starting OD600 of ~ 0.05 was taken from the overnight cultures and inoculated in 250 ml of TSB or LB in a 1 L Erlenmeyer flask. The cultures were grown using a 37 °C incubator shaker at 200 rpm.When the cultures reached an OD600 ~ 1.0 the cells were harvested by centrifugation in a JA-14 tube for 15 min at 15,050 x g at room temperature. M. luteus culture should take one full day while S. aureus should take about 3 h to reach the desired OD (Note 6). The supernatants were discarded and cells were washed with 250 ml of Milli-Q water.The cells were centrifuged as above and the supernatants were discarded.The cells were resuspended in 30 ml of Milli-Q water and transferred to 50 ml Falcon tubes.The cell suspension was autoclaved for 15 min, 121 °C (Note 7).The autoclaved cells were transferred to JA-20 tubes and centrifuged for 15 min at 15,050 x g, RT.The supernatants were discarded and pellets were stored overnight at -20 °C (Note 8). The pellets were defrosted at room temperature, resuspended in 3 ml of Milli-Q water and divided in half into two pre-weighted 2 ml tubes. The suspension was lyophilized overnight in the speed vac.The weight of the tubes containing the cells was determined and the dry weight was calculated.Bacterial substrate cells were resuspended thoroughly in Milli-Q water at 50 mg/ml final concentration and stored at -20 °C (Note 9).",
    "Analysis of the crude autolytic extracts by gel zymographySubstrate cells were thawed and, to ensure a complete resuspension, kept overnight at room temperature with agitation using a magnetic stirrer at maximum speed (Note 10). Two resolving Acrylamide/0.2% Bisacrylamide SDS-PAGE gels (Laemmli, 1970) were prepared containing a final concentration of 2 mg/ml of substrate cells from S. aureus (10 % gel) and M. luteus (8% gel) (Note 11 and Figure 1).A standard stacking gel, lacking substrate cells, was placed on top of the resolving gels (Laemmli, 1970). 10 μg (for the M. luteus gel) and 15 μg (for the S. aureus gel) of crude autolytic enzyme extracts (Note 12) were mixed with Laemmli loading buffer (Laemmli, 1970) at a final concentration of 2x (samples were not heated, see Recipes).The electrophoresis conditions used were as follows:Temperature: Room Temperature. Voltage constant: 70 V (per gel). Running buffer: Tris-Glycine-SDS buffer.After electrophoresis, the gels were rinsed once with Milli-Q water. The gels were washed 3 times with Milli-Q for 15 min at RT with gentle agitation. The gels were incubated overnight at 37 °C with gentle agitation in Renaturation buffer (Note 13).Zymograms were stained in Methylene Blue Solution for an hour and destained in water until the bands were clear (Note 14 and Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20151220/20151220225813_0888.jpgFigure 1. A 10% zymogram gel and SDS-PAGE gel. Left panel shows a zymogram gel, which is slightly opaque. Right panel shows a regular SDS-PAGE gel that is completely transparent due to the lack of substrate cells.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20151220/20151220225840_3888.jpgFigure 2. Zymography analysis of S. aureus autolytic enzymes. A. Gel zymography analysis of crude autolytic enzyme extracts of S. aureus. M. luteus and S. aureus zymogram gels were used to analyze the autolytic enzymatic extracts harvested from the parental S.",
    "aureus NCTC8325-4 strain and from mutants that lack different autolysins (NCTCΔatl, which lacks the major Atl autolysin; NCTCΔlytM, which lacks the glycyl-glycine endopeptidase LytM; NCTCΔlytN, which lacks the putative cell wall hydrolase LytN and NCTCΔsle1, which lacks the N-acetylmuramoyl-L-alanine amidase Sle1). Five different forms of the major autolysin Atl were seen with either substrate cells. However, only the S. aureus substrate cells allowed detection of Sle1 activity, hence showing Sle1 substrate specificity for S. aureus peptidoglycan. B. Representation of the post-translational cleavage (black arrows) of the atl encoded protein (left). The processed amidase (AM) releases stem peptides from PGN by cutting the bond between the stem peptides and the N-acetylmuramic acid residue. The glucosaminidase (GL) releases muropeptides by cutting the glycosidic linkage between N-acetylmuramic acid and N-acetylglucosamine of glycan strands. Representation of Sle1 (right), which includes three LysM domains (responsible for the interaction with PGN) and a CHAP domain (associated with amidase activity of different PGN hydrolases)."
  ],
  "subjectAreas": [
    "Microbiology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}