{
  "id": 19521,
  "origin_website": "Jove",
  "title": "Examining the Effect of Pesticides on Caenorhabditis elegans Neurons",
  "procedures": [
    "All use of invertebrate animals was in compliance with the animal care and use guidelines of the institution.\n1. Preparation of pesticide-coated Petri plates\nPrepare agar Petri dishes (6 cm diameter work best) using standard procedures6.\n\tNOTE: These can be made months in advance and stored in the refrigerator until use. Bring plates to room temperature (RT) on the benchtop. In most cases, the student groups should be provided with a plate for each dilution of the pesticide mixture, including a water control.\nPrepare 1 mL of each dilution of the chosen pesticide in labeled 1.5 mL microfuge tubes. For safe handling, be sure to read the instructions and provide gloves, or work in a fume hood, if suggested.\n\tNOTE: Suggested dilutions to test: 1 mL of full-strength pesticide, 1:10 dilution in water (100 µL of pesticide, 900 µL of distilled water), 1:100 dilution (10 µL of pesticide, 990 µL of water), 1:1000 dilution (10 µL of the 1:10 dilution, 990 µL of water), etc.\nMake a solution spreader by carefully bending a glass Pasteur pipette (9 ml size) in a Bunsen burner flame. Use the flame to close the opening of the pipette. Then ethanol-sterilize the spreader before each spreading on the Petri plate.\nUsing a micropipetter, place 100 µL of the dilution (or water control) on the center of the agar and spread gently across the surface with the sterilized spreader. Re-sterilize the spreader prior to each use.\nSet aside the Petri dishes covered, and let the solution soak into the surface until \"dry.\"\n\t​NOTE: Depending on the pesticide and humidity levels in the laboratory, this may take some time. Students might need to prepare their plates the day before the exposure period.",
    "For exposure periods longer than 12 h, add 50 µL of an overnight culture of Escherichia coli to the plates prior to adding the nematodes. For acute experiments (12 h or less), there is no need to have E. coli on the plates.\n2. Adding nematodes to pesticide-coated plates\nNOTE: Students will need to have a plate of adult nematodes (5 day cultures are best) of the fluorescent strain LX929, which is available from the Caenorhabditis elegans Genetics Center. There are two possible procedures for this. If students have had prior experience working with nematodes (for example, if this procedure is part of a multi-week exercise and they have already learned how to pick nematodes with a worm pick), use Step 2.1. If they have not, use Step 2.2.\nPick nematodes with a worm pick. Fashion a worm pick from a 1 in piece of platinum wire that is melted to a Pasteur pipette using a Bunsen burner flame. Pick up a small blob of sticky E. coli onto the pick and then pick up adult nematodes using the sticky blob. For a decent sample size, pick 10 nematodes for each treatment plate.\n\tNOTE: Students without much experience can follow Steps 2.2-2.3.\nUse a micropipette to place 1 mL of sterile water onto the plate of nematodes. Swish the water around to lift up the nematodes, then remove the liquid with the nematodes to a 1.5 mL microfuge tube.\nLet the nematodes settle by gravity for about 10 min, then carefully remove at least 500 µL of the water and discard. Resuspend the nematodes and, using a cut off yellow pipette tip, remove 50-100 µL of suspended worms to each treatment plate. Be sure that each plate has at least 10 adult worms.",
    "Set a timer, or note the time, and expose the nematodes at RT for the chosen time period. During the chosen exposure time, prepare microscope slides for wet mounts. The slides should be made the same day as the microscopy.\n\tNOTE: Student groups will have chosen their time of exposure during the planning for their independent study.\n3. Preparing microscope slides for wet mounts\nNOTE: Steps 3.1-3.3 can be performed by each student group. Prepare three slides each.\nPrepare two slides by placing a piece of label tape on only one side of the slide (Figure 1, left panel). The tape is used to create the correct thickness for the agarose to form a pad of uniform thickness. Then position a clean, unused slide in between them on the benchtop, as illustrated in the figure.\nUse a micropipetter to place a 10 µL drop of melted agarose (3% in ddH2O, heated using a 65 °C dry block heater) onto the center of the slide that is in the middle.\nFlatten the drop by placing another clean slide on top, perpendicular to the slide with the drop, as shown in the figure (Figure 1, right panel). Flatten by applying pressure, so the agarose drop forms the thickness of the labeling tape.\nThe agarose will solidify within about 1 min. Then, apply steady pressure to separate the two slides. The agar circle will adhere to one of the slides. Rest this slide, agar side up, on the benchtop, and allow it to dry for 1-2 min before using.\n4. Mounting live nematodes to microscope slides\nTo add nematodes to the prepared slide with the agarose pad, add a 5 µL drop of water containing 1 M sodium azide (NaN3) to the agar pad. This solution anesthetizes the worms and immobilizes them.",
    "CAUTION: Sodium azide stock solution can cause illness if ingested.\nThen transfer nematodes (at least 10 per treatment slide) to the droplet using a worm pick. Sterilize the pick before and after using it to transfer nematodes.\nUse forceps to add a coverslip by placing it at an angle and slowly lowering it. Prevent the coverslip from slipping or lowering too quickly by using a pencil or metal probe.\nPlace the prepared wet mount on a fluorescent microscope to observe the worms, first under 10x magnification and phase contrast, then under 40x magnification with phase contrast and fluorescent illumination.\n5. Fluorescent microscopy\nNOTE: Student groups should make a wet mount of several worms of each type on separate microscope slides, which they should label appropriately. The instructions that follow are general tips about the use of a standard fluorescence compound microscope that can have an attached trinocular setup, digital camera, and computer system. The setup used for this manuscript is seen in Figure 2. Students should be familiar with the settings of the microscope, including the objectives, types of light filters, ability to switch between bright field and fluorescence light, how to send the light signal to the digital camera, etc.\nPlace one prepared wet mount at a time on the microscope stage and secure it in place using the microscope stage clips.\nBegin viewing the wet mounts by first viewing with the lowest magnification objective, which is typically 10x, and use bright field or phase contrast to visualize and focus on the nematodes.",
    "Once a nematode is located in the field of view, focus on it using the fine focus knob on the microscope. Switch the illumination to the fluorescence by turning the dial. Then direct the light to the camera to capture the digital images. Adjust the illumination using the imaging software so that the neurons are brightly illuminated but not oversaturated.\nAt some point, obtain a separate image of a ruler at the same magnification as the cell images to provide a magnification scale for their figure. Place a short section of a transparent ruler, or a micrometer slide, onto the microscope stage, focus on it using the fine focus knob, and obtain an image using the imaging software.\nObtain additional images (from at least 10 separate nematodes) at higher magnifications, if possible. The intense light will likely bleach the area from which it is being imaged, so carefully monitor the imaging and do not allow the light to remain on the same area of the slide for long periods of time. Be sure to name the acquired images to keep track of the nematode and region, as well as the treatment and magnification.\nMake a folder on the computer and move the images into the folder for use in analysis and figure preparation.\n6. Morphological integrity assessment scale\nNOTE: A key cytological characteristic of neurodegenerative damage in neurons is a change to the soma morphology. There are three morphologies that can easily be viewed and counted.\nCount the neurons with smooth, uniformly fluorescent processes and non-round cell bodies as normal, as shown in Figure 3.\nOften the soma becomes rounded and swollen-looking compared with healthy, young neurons. Count the neurons that look like this as \"rounded.\"",
    "Neurons with long neural processes can exhibit blebbing, where there are rounded puncta or even gaps in the processes. Count the neurons that show these features as \"blebbed.\"\n7. Data analysis and figure preparation\nIf the percentage healthy (no rounding, no blebbing) and the percentage impaired (rounding and/or blebbing) for at least ten nematodes for each treatment were counted (Figure 3), perform statistical analysis using available statistical software.\nCount all of the neurons that are fluorescently tagged, keeping a tally of those exhibiting normal morphology, blebbing morphology, or rounding morphology, and then calculate the percentage of each morphology out of the total count for each nematode analyzed.\nTo prepare figures, import the images into an appropriate software like Powerpoint and then add labels and a scale bar based on the ruler or micrometer image acquired.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}