{
  "id": 18284,
  "origin_website": "Jove",
  "title": "Ovine Lumbar Intervertebral Disc Degeneration Model Utilizing a Lateral Retroperitoneal Drill Bit Injury",
  "procedures": [
    "The protocol detailed in this manuscript follows the animal care guidelines of Monash University Animal Ethics. Animal ethics approval for this protocol has been granted by Monash University Animal Ethics. Ethics approval number: MMCA/2014/55\n1. Sheep Preparation\nNOTE: Ewes aged two to four years were used.\nFast sheep for 18 h prior to anesthesia. Provide animals with access to water until 6-12 h prior to operation19.\nSedate animals by intravenous injection of medetomidine hydrochloride (0.015-0.020 mg/kg) to facilitate transfer to operating suite.\n\tNOTE: The medetomidine hydrochloride serves to reduce animal stress and agitation associated with separation from other animals for transfer to the operating suite.\nInject thiopentone (10-13 mL/kg) for induction of anesthesia upon arrival to the operating suite.\nAdminister prophylactic intravenous antibiotics (amoxicillin 1 g IV) immediately following thiopentone injection.\nIntubate sheep using a size 7.5-9 mm (internal diameter) endotracheal tube20.\nMaintain anesthesia using inhaled isoflurane (2-3%) in 100% oxygen at a flow rate of 2 L/min. Attach a pulse oximeter to the sheep's ear.\nClosely monitor the sheep's vital signs (heart rate, respiratory rate and oxygen saturation via pulse oximeter and observation) and level of consciousness.\n\tNOTE: Indicators of light anesthesia such as spontaneous chewing, active regurgitation, and spontaneous movements should prompt increase in the level of anesthesia. Red flag signs indicating urgent lightening of anesthesia include respiratory compromise and severe bradycardia. Rotation of the eye is not a consistent indicator of depth of anesthesia in sheep19.\n2. Disc Level and Incision",
    "Collect the surgical tools needed for this procedure: veterinary clippers, 20 mL luer-lock syringe, 21G IV Needle, #4 scalpel handle, #22 scalpel blades, Gillies tissue forceps, Metzenbaum curved dissecting scissors, Deaver retractor, Hohmann retractor blade, 3.5 mm Brad point drill bit, drill bit stop, drill, autoclavable veterinary drill bag, needle holder, 2-0 absorbable synthetic braided sutures, 3-0 absorbable synthetic braided suture and Mayo suture scissors.\nPrepare the operating suite. Clean the operative table and instrument stand with 70% ethanol. Autoclave all surgical instruments prior to operation. Perform pre-operative anesthetic check.\nPlace the sheep on the operating table in the right lateral position.\nUsing electronic clippers, shave the region defined superiorly by the lower ribs, inferiorly by the iliac bone, medially by the contralateral lumbar transverse processes and approximately 10 cm lateral to the ipsilateral lumbar transverse processes.\nPalpate the iliac crest, lumbar transverse processes (L1-6) and costo-vertebral angle for the landmarks for surgical incision site. Mark these landmarks with a sterile pen.\nPrepare the lateral abdomen by disinfecting with chlorhexidine and alcoholic-iodide antiseptic wash.\nObserve standard surgical aseptic techniques throughout the operation. The surgical team scrubs prior to the operation. Place a sterile fenestrated square drape over the surgical site, and a large sterile square drape on the overhead table.\nSterilize all items to be used within the operative site prior to the operation. Monitor and maintain sterility of the surgical site throughout the operation. Ensure all items introduced into the sterile field are sterile and transferred in a sterile fashion.\nUse surgical loupe magnification and a headlight to facilitate visualization during the surgical procedure.",
    "Make a longitudinal incision using the #22 scalpel blade attached to the #4 scalpel handle parallel to and 1 cm anterior to one to two lumbar transverse processes above and below the intervertebral disc levels of interest.\n\tNOTE: Further information regarding incision planning can be found in the discussion.\nUse the monopolar diathermy to divide the underlying subcutaneous tissue and the lateral aspect of the abdominal wall musculature; direct the dissection towards the tips of the lumbar transverse processes above and below the intervertebral discs of interest.\nDivide the thoracolumbar fascia longitudinally at its attachment to the transverse processes.\nVisualize and preserve the underlying quadratus lumborum, psoas muscles and the traversing neurovascular bundles.\nMaintain hemostasis through the procedure using diathermy.\nSweep the fingers between the plane of the peritoneum and posterior abdominal wall musculature at the exposed intervertebral disc levels to perform digital blunt dissection.\nRetract the quadratus lumborum and psoas muscles posterolaterally using a Deaver retractor to further expose of the intervertebral discs.\nPalpate for the concave intervertebral bodies and the convex intervertebral discs.\nPosition the retractors immediately over the discs and take care to ensure lumbar vessels are not damaged.\nUsing surgical loupe magnification with a headlight, identify the lumbar vessels which are located approximately 1 cm caudal to the inferior endplate.\nPerform an intraoperative lateral X-ray to confirm the disc level.21\n\tNote: Radiograph settings: 47kV; 4 mAs21\nDepending on the disc levels desired, expose the intervertebral disc by separating the surrounding structures and attachments as below.\nFor levels L3/4 and above, sweep aside the muscular attachments over the disc using digital blunt dissections.\nFor levels L4/5 and below, sharply divide the thicker tendinous muscular attachments over the disc using bipolar diathermy and scissors.",
    "NOTE: L6/S1 disc can be difficult to access due to obstruction by the iliac crest. If access cannot be accomplished via the lateral approach an anterior approach may be utilized.\n3. Drill Bit Injury\nNOTE: Pre-operative planning includes the allocation of injury/treatment levels and control levels. Further information regarding level allocation can be found in the discussion.\nDefine the drill bit entry point by observing the left lateral and anterior extremities of the intervertebral disc.\n\tNOTE: The entry point is located at the midpoint of this left anterolateral quadrant (defined by the anterior and lateral extremities of the disc). The drill bit is inserted at this entry point with a trajectory aimed towards the center of the intervertebral discs and directed slightly cranial to perpendicular.\nFit a Brad-point drill bit into the power drill. Ensure the diameter of the drill bit is slightly less than the intervertebral disc height i.e. ~3.5 mm for lumbar intervertebral disc in 60-70 kg sheep.\nApply a drill bit stop to provide an unprotected drill bit length of approximately half the diameter of the lumbar intervertebral disc i.e. ~12 mm for lumbar intervertebral discs in 60-70 kg sheep.\nApply the drill bit to the entry point and direct it in a trajectory slightly cranial to the center of the intervertebral disc. The slight cranial angulation is to minimize the risk of endplate injury.\nAdvance the drill bit slowly into the intervertebral disc with the drill on low power for 1 s. Adjust the trajectory in a slight cranial or caudal fashion if excessive resistance is encountered\n\tNOTE: Such excessive resistance likely indicates contact with the endplate.\n4. Closure\nOnce hemostasis is achieved, irrigate the wound with Ringers' solution.",
    "Perform layered closure, preferably using 2-0 absorbable synthetic braided sutures to the lateral abdominal wall tissues and continuous 3-0 undyed absorbable synthetic braided subcuticular suture to the skin.\n5. Post-operative Management\nPlace a fentanyl transdermal patch (75 µg/h) in the inguinal region for post-surgical analgesia for 3 days.\nAdditionally, use intravenous buprenorphine (0.005-0.01 mg/kg) for top-up analgesia if needed.\nCease the inhalational anesthetic. When spontaneous breathing occurs, remove the endotracheal tube.\nAllow the animal to recover in a holding cage under constant observation.\n\tNOTE: The animal should not be left unattended until it has regained sufficient consciousness to retain sternal recumbency.\nOnce the animal is fully alert and standing, re-introduce food and water. Once fully recovered, return the animal to its operative facility holding pen with other animals.\nMonitor closely for 24 h and continue observation for one week. Monitor for evidence of post-surgical pain or distress.\n\tNOTE: Post-operative transdermal fentanyl patch applied for three days should provide sufficient analgesia. Additional analgesic requirements should prompt animal review.\nFeed the sheep normally, and allow the sheep to carry out normal activities without restriction. Observe the sheep for any evidence of neurological deficit such as lameness.\n\tNOTE: The intervertebral disc defect produced by the drill bit injury method is on the anterolateral aspect of the disc and the injury depth is limited by the drill bit stop to the mid nucleus. As the neural elements are located posterior/posterolateral to the intervertebral disc, the risk of neural compromise secondary to symptomatic nucleus pulposus is remote. This anatomical characteristic of the model precludes the use of neurological examination to distinguish intervertebral disc degeneration with and without nucleus pulposus herniation.\nReturn the sheep to the university farm to await euthanasia and necropsy at the end of the experimental period.\n6. Euthanasia",
    "Perform sheep euthanasia at an appropriate time interval following drill bit intervertebral disc injury.\nInject intravenous pentobarbitone sodium (>100 mg/kg) for euthanasia.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}