{
  "id": 19808,
  "origin_website": "Wiley",
  "title": "Establishment and Culture of Human Intestinal Organoids Derived from Adult Stem Cells",
  "procedures": [
    "This protocol describes a method for establishing human intestinal ASC-derived organoid cultures from fresh biopsies of small intestine or colon. Tissue is dissociated into small epithelial fragments that are embedded into extracellular matrix “domes” using basement membrane extract (BME) and then supplemented with medium containing growth factors for organoid expansion.\nSmall intestine and colon biopsies are both suitable organoid culture sources. Because organoids maintain region-specific characteristics, pooling biopsies from different intestinal regions or different donors is not recommended. In the case of CRC biopsies, a paired normal sample should be collected from surrounding healthy tissue.\nMaterials\nFresh tissue biopsy from human small intestine or colon (healthy or tumor tissue)\n70% (v/v) ethanol\nAdvDMEM+++ (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpim.106#cpim106-rec-0001])\nPrimocin (InvivoGen, cat. no. ant-pm-1)\nCollagenase type II (Sigma-Aldrich, cat. no. C9407-1)\nY-27632 Rho kinase inhibitor (RhoKi; Abmole, cat. no. Y-27632)\nCultrex reduced-growth-factor basement membrane extract (BME), type 2, Pathclear (R&D Systems/Bio-Techne, cat. no. 3533-001)\nRed blood cell lysis solution (Gibco, cat. no. A1049201)\nExpansion medium (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpim.106#cpim106-rec-0006])\n15- and 50-ml Falcon tubes\n10-cm Petri dish\nDisposable scalpels (VWR, cat. no. HERE1110810)\nParafilm (Sigma Aldrich, cat. no. P7793-1EA)\nOrbital shaker\n100-µm cell strainer (Green Bioresearch, cat. no. 542000)\n5-ml pipet\n24-well cell culture plate (Greiner Bio-One, cat. no. 662 102)\nPrepare cell suspension\n1. Collect tissue sample from the tissue sample source site in a 50-ml Falcon tube containing 25 ml AdvDMEM+++ and 100 μg/ml Primocin. Keep at 4°C until use.\nUse 30 mg tissue for optimal organoid line establishment. For increased efficiency, isolate tissue within 24 hr after surgery. Avoid freezing the tissue, as this will result in cell death.\n2. Start up the biosafety cabinet. Disinfect the work area surface and pipets by spraying with 70% ethanol and allow to air dry.",
    "3. Prepare fresh digestion medium for each tissue sample: Aliquot 5 ml AdvDMEM+++ into a 15-ml plastic tube and add 5 mg/ml collagenase type II and 10 µM RhoKi. Mix by inverting and store on ice until use.\n4. Transfer tissue to a 10-cm Petri dish.\nOptionally, excise a tissue piece and place in a cryovial. Snap-freeze and store in liquid nitrogen for additional DNA/RNA analysis and/or fix tissue for histology.\n5. Using two scalpels, mince tissue into pieces of ∼1 mm3. Add the 5 ml digestion medium and mix by pipetting.\n6. Transfer digestion medium with tissue to a 15-ml plastic tube. Rinse the dish with the medium, returning the medium and all tissue pieces to the tube.\n7. Close tube lid and seal with Parafilm. Place tube tilted at a low angle on an orbital shaker. Digest tissue for 30 to 45 min at 37°C and 140 rpm.\nCheck the turbidity of the solution regularly. If the tissue is dissociated (typically after ∼30 min), the solution will look turbid without any large clumps.\n8. Pipet the digested tissue onto a 100-µm cell strainer on a 50-ml plastic tube. Use a 5-ml pipet to help pass the cell suspension through the filter.\nLarge tissue pieces will be retained on the filter.\n9. Rinse the strainer with 5 ml AdvDMEM+++ and transfer the solution (total 10 ml) to a fresh 15-ml plastic tube.\n10. Centrifuge 5 min at 450 × g, 4°C. Aspirate the supernatant.\nIf red blood cells are present (observed as a dark red pellet), resuspend the pellet in 3 ml red blood cell lysis buffer and incubate for 5 min at room temperature. After incubation, add 5 ml AdvDMEM+++ to the cell solution, centrifuge 5 min at 450 × g, 4°C, and aspirate the supernatant.",
    "11. Wash pellet three times with 10 ml AdvDMEM+++. Each time, spin 5 min at 450 × g, 4°C, and aspirate the supernatant.\n12. Resuspend final pellet in undiluted BME.\nThe volume of BME depends on the pellet size. Usually, a pellet from ∼30 mg primary tissue is plated in 300 µl BME. Cells plated at the right density have enhanced efficiency of organoid culture establishment. Plating too densely will result in increased cell death at the core of the dome.\nPlate cells and grow as organoids\n13. Plate 50 µl cell suspension per well as multiple ∼15-µl droplets in a prewarmed 24-well cell culture plate.\n14. Place plate upside-down in a 37°C, 5% CO2 cell culture incubator and allow droplets to solidify for 20 min.\nAs the BME solidifies, the cells/organoids will spread over the volume of the BME, locating closer to the dome surface. This will maximize nutrient exchange and minimize organoid attachment to the plate. This also applies to Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpim.106#cpim106-prot-0002].\n15. Carefully add 500 µl expansion medium supplemented with 10 µM RhoKi to each well and return the plate to the incubator.\nWhen establishing tumor lines, use expansion medium depleted of Wnt3A-CM or Wnt surrogate. In this way, tumor cells with acquired Wnt pathway independence will be selected in culture.\n16. After ∼1 week, expand organoids by mechanical disruption and splitting (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpim.106#cpim106-prot-0002]).",
    "Due to donor-to-donor variability, the time required for a human intestinal organoid culture to reach confluence varies among organoid lines. Seven days is a standard estimation, but expansion time should be determined empirically for each individual line. Passaging organoids too early will result in increased cost in materials and suboptimal expansion speed. Passaging too late may result in spontaneously differentiating organoids, decreased cell viability, and suboptimal expansion. See Figure 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpim.106#cpim106-fig-0001] for a reference for estimating the optimal time to perform the first split and expansion. This also applies to Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpim.106#cpim106-prot-0002].\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/76a10624-b34b-4c84-a65f-4afae7c75fb1/cpim106-fig-0001-m.jpg</p>\nFigure 1\nEstablishment of human colon organoid lines from fresh biopsy of normal tissue. Representative images from two organoid lines. Cells are shown after establishment of cultures (left), before the first split (middle), and after the first split (right). P indicates passage number; d indicates days after seeding or passage; scale bars, 0.5 mm.",
    "The process of mechanical splitting and passage is similar for organoids from human small intestine and colon due to the high similarity of these two organoid types. In short, organoids are recovered from the basement membrane matrix and broken mechanically into smaller fragments. The fragments are then resuspended in fresh BME and replated. They will self-assemble as new organoids, and the stem cells and transit-amplifying cells present in them will continue to proliferate, giving rise to a fully grown expanded organoid culture (Fig. 2A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpim.106#cpim106-fig-0002]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/0da71a91-fd5d-4cc9-bb83-7dc053315a45/cpim106-fig-0002-m.jpg</p>\nFigure 2\nMechanical splitting and expansion of human intestinal organoids. (A) Schematic of culture procedure. (B) Glass Pasteur pipette connected to a 10-μl tip used for mechanical disruption of organoids. (C) Representative bright-field microscopy images of organoid cultures at days 0, 1, 2, and 4 after mechanical split. Scale bars, 2 mm. (D) Examples of a healthy organoid (top), composed mostly of stem/transit amplifying cells, and a suboptimal organoid (bottom), with signs of differentiation (thickening of wall). Scale bars, 0.4 mm.\nAdditional materials (also see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpim.106#cpim106-prot-0001])\nEstablished organoid culture (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpim.106#cpim106-prot-0001] if first passage, or this protocol if later passage)\nSterile plugged glass Pasteur pipette (VWR, cat. no. 14672-400)\nSterile 10-μl pipette tips\nMechanical pipetter\n1. Remove medium from one well of a 12- or 24-well plate of established organoid cultures.\nThe process can be scaled up or down using different plate formats. For a guide to other formats, see Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpim.106#cpim106-tbl-0001].\nTable 1.\n                BME Volumes Used in Different Multiwell Plate Formats\ntable:\n﻿Plate format,BME/well (μl),Domes/well,Culture medium/well (ml)\n6 wells,200,10-15,2.0\n12 wells,100,5-7,1.0\n24 wells,50,1-3,0.5\n48 wells,25,1,0.25\n96 wells,5-10,1,0.1\n2. Using a P1000 pipette, flush the organoids with 1 ml ice-cold AdvDMEM+++ to disrupt the BME droplets. Collect the organoids and transfer to a 15-ml plastic tube containing 4 ml ice-cold AdvDMEM+++.",
    "3. Centrifuge the organoids 5 min at 450 × g, 4°C. Remove supernatant.\nDuring this step, undissolved BME often accumulates over the organoid pellet as a cloudy mesh. It is important to remove as much BME as possible without taking the organoids. If organoids do not separate from the BME, resuspend the pellet with the BME mesh in the AdvDMEM+++, incubate on ice for 10 min, and then repeat step 2.\n4. Resuspend pellet in 1 ml ice-cold AdvDMEM+++ using a P1000 pipette.\n5. Attach a sterile 10-μl pipette tip to the tip of a glass Pasteur pipette (Fig. 2B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpim.106#cpim106-fig-0002]). Pass the organoids through the pipette opening five to ten times until large clumps are no longer visible.\n6. Add 4 ml ice-cold AdvDMEM+++ and centrifuge 5 min at 450 × g, 4°C. Remove supernatant.\nFoam formation at this step usually leads to loss of cells. To avoid this, pipette the cell solution against the middle part of the tube wall.\nAlternatively, mechanical disruption can be done using a fire-polished glass pipette with the tip narrowed down to a diameter of ∼0.5-1 mm using a Bunsen burner.\n7. Resuspend pellet in 300-400 μl BME using a P1000 pipette.\nSome residual AdvDMEM+++ is acceptable in the resuspension step, but the final BME concentration should be 75%-100%.\nAvoid bubble formation, as this will render the BME droplet unstable and lead to its disruption before splitting time.\n8. Dispense 100 μl suspension per well as multiple ∼15-μl droplets in a prewarmed 12-well culture plate (Fig. 2C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpim.106#cpim106-fig-0002]).\nSee Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpim.106#cpim106-tbl-0001] for dome numbers and volumes in different plate formats. The split ratio for a fully grown culture is typically 1:3 to 1:4 (of BME volume).",
    "9. Flip the plate upside down and place plate in an incubator at 37°C and 5% CO2 for 20 min to let domes solidify.\n10. Add 1 ml expansion medium and keep in the incubator, refreshing the medium every 2-3 days.\nUnder these conditions, organoids containing proliferating stem cells should look cystic and have a thin wall (Fig. 2D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpim.106#cpim106-fig-0002], upper panel). If organoids look dense and have a thick wall, they show signs of cell differentiation (Fig. 2D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpim.106#cpim106-fig-0002], lower panel), which will lead to loss of the cultures.\n11. After 7 days, expand organoids further by repeating this process.\nAs mentioned previously, the optimal time between passages varies and must be determined empirically for each line.",
    "This protocol describes ways to differentiate organoids to the various cell types of the small intestinal and colonic epithelia. By withdrawing growth factors, which enforce a stem cell state, and adding components that skew differentiation trajectories, different types and proportions of mature cells can be obtained within 5 days. These mature cell types can be used for functional studies of the human gut epithelium.\nAdditional materials (also see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpim.106#cpim106-prot-0001])\nEstablished human intestinal organoid culture (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpim.106#cpim106-prot-0002])\nDifferentiation medium (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpim.106#cpim106-rec-0003])\n1. Aspirate medium from one well containing an established organoid culture grown to an average size of 100 µm (usually 5 days after splitting).\nSmaller organoids are sensitive to some of the small molecules used for differentiation at later steps.\n2. Add 1 ml prewarmed AdvDMEM+++ and incubate at least 15 min in the 37°C incubator to allow diffusion of growth factors from the BME domes.\nFor domes larger than 15 µl, the incubation time must be extended to allow proper diffusion.\nVolumes are based on a 12-well plate. For other plate formats, see Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpim.106#cpim106-tbl-0001].\n3. Aspirate medium from the well and add 1 ml prewarmed differentiation medium per well of a 12-well plate. Return to incubator overnight.\nSee Table 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpim.106#cpim106-tbl-0002] for different differentiation media and expected cell type composition.\nTable 2.\n                Intestinal Differentiation Media and Expected Cell-Type Compositionsa,b, a,b[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpim.106#cpim106-tbl2-note-0001_cpim106-tbl2-note-0002_55]\ntable:\n﻿Medium,Reference,Expected outcome,Special considerations\nENR,Sato et al. (2011[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpim.106#cpim106-bib-0023]),\"Enterocytes, EECs, TACs, goblet cells\",\"Generic differentiation medium for broad coverage of differentiated cell types, with particular enrichment of enterocytes\"\nENR+Notchi,,Goblet cells,Goblet cell differentiation\nENR+MEKi+Notchi,Beumer et al. (2018[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpim.106#cpim106-bib-0002]),EECs (crypt/lower villus state),Enteroendocrine cell differentiation inducing a crypt hormone profile\nER+MEKi+Notchi+ BMP4+BMP2,Beumer et al. (2018[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpim.106#cpim106-bib-0002]),EECs (upper villus state),Enteroendocrine cell differentiation inducing an upper villus hormone profile\na For full composition of media, see Reagents and Solutions.",
    "b Abbreviations: BMP, bone morphogenetic protein; EEC, enteroendocrine cell; ENR, EGF-Noggin-Rspo1; MEK, p38 MAP kinase; TAC, transit-amplifying cell.\n4. Refresh differentiation medium the next day to wash away any residual growth factors. Continue to refresh differentiation medium every 2-3 days.\nAs organoids differentiate, some cells undergo apoptosis and are shed to the organoid lumen. Together with more granular differentiated cells, this results in a darker appearance of the organoids, with thicker organoid walls and accumulation of debris in the organoid lumen. This can be used as an indicator of the progress of differentiation (Fig. 3A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpim.106#cpim106-fig-0003],B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpim.106#cpim106-fig-0003]).\nAfter 5-7 days, fully differentiated cells will be present in the organoids and the organoids can be used for downstream assays. Organoid viability can decrease substantially within days after terminal differentiation, so assays should be performed as early as possible for optimal results.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/f1c8f28b-aec5-4cd2-8403-b4305761eac1/cpim106-fig-0003-m.jpg</p>\nFigure 3\nDifferentiation of human intestinal organoids. (A) Representative images of organoids differentiated towards the enteroendocrine cell lineage as in Beumer et al. (2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpim.106#cpim106-bib-0003]). Scale bars, 0.2 mm. (B) Representative images of organoids differentiated towards the enterocyte lineage. Scale bars, 0.4 mm. Inset: Detail of differentiated organoid with enterocytes (elongated cells, arrowhead). Scale bar, 0.1 mm.",
    "This protocol details the steps for cryopreservation and thawing of intestinal and colon organoids. Cryopreservation is especially advisable when storing organoids for years in liquid nitrogen, but also for shipping organoid lines on dry ice. Briefly, organoids are freed from the BME and resuspended in freezing medium. To restart the cultures, organoids are carefully thawed, washed, and plated in BME domes. Thawed organoids are passaged according to Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpim.106#cpim106-prot-0002]. After one passage, organoids should have normal growth characteristics and can be used for any downstream assay.\nAdditional materials (also see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpim.106#cpim106-prot-0001])\nEstablished organoid culture (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpim.106#cpim106-prot-0002])\n2× freezing medium (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpim.106#cpim106-rec-0005])\nCryopreservation tubes\nFreezing container\n37°C water bath\nFreeze organoids\n1. Passage organoids 2-3 days before cryopreservation (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpim.106#cpim106-prot-0002]).\nFor optimal recovery, small organoids in exponential growth phase should be frozen.\n2. Remove medium from one well of a 12-well plate of established organoid culture.\nThe process can be scaled up or down using different plate formats. For a guide to other formats, see Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpim.106#cpim106-tbl-0001].\n3. Using a P1000 pipette, flush the organoids with 1 ml ice-cold AdvDMEM+++ to disrupt the BME droplets. Collect the organoids and transfer to a 15-ml plastic tube containing 4 ml ice-cold AdvDMEM+++.\n4. Centrifuge organoids 5 min at 450 × g, 4°C. Remove supernatant.\nDuring this step, undissolved BME often accumulates over the organoid pellet as a cloudy mesh. It is important to remove as much BME as possible without taking the organoids. If this is not possible, resuspend the pellet in 10 ml ice-cold AdvDMEM+++, incubate on ice for 10 min, and then repeat step 3.\n5. Resuspend pellet in 1 volume of ice-cold AdvDMEM+++ using a P1000 pipette, then add 1 volume of 2× freezing medium dropwise under constant shaking.",
    "The volume used in this step depends on the number of cryopreservation tubes being prepared and the organoid number per vial. For one densely plated well of a 12-well plate, 500 µl each of AdvDMEM+++ and 2× freezing medium are recommended.\nEnsure slow addition of freezing medium to avoid an osmotic shock to the cells.\n6. Transfer 1-ml aliquots of organoid suspension to properly labeled cryopreservation tubes.\n7. Place tubes in a freezing container and freeze at −80°C overnight.\n8. Transfer tubes to a liquid nitrogen container.\nOrganoids can be stored at −80°C for several weeks and in liquid nitrogen for years without major impairment of cell viability.\nThaw stocks\n9. Prepare AdvDMEM+++ and labeled 15-ml tubes while organoids are still frozen to minimize thawing and processing times.\nDelays will lead to a decreased recovery rate.\n10. Transport tubes of organoids from liquid nitrogen to a flow cabinet on dry ice.\n11. Thaw tubes in a water bath at 37°C.\n12. Transfer thawed organoid suspension to 15-ml Falcon tubes (one per cryotube) and add 10 ml AdvDMEM+++ dropwise under constant shaking.\nEnsure slow addition of AdvDMEM+++ to avoid an osmotic shock to the cells.\n13. Centrifuge 5 min at 450 × g, 4°C. Remove supernatant.\n14. Resuspend each cell pellet in 100 μl BME using a P200 pipette, being careful to avoid bubble formation.\n15. Dispense as ∼15-µl drops in a well of a 12-well cell culture suspension plate.\n16. Place the plate upside-down in the incubator for 20 min to let domes solidify.\n17. Add expansion medium and keep in the incubator. Refresh medium every 2-3 days.\nAfter 7 days, organoids can be further expanded as in Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpim.106#cpim106-prot-0002].",
    "This protocol describes a way to perform immunofluorescence staining compatible with fluorescence and confocal microscopy. For this purpose, organoids must first be released from the BME without disrupting their 3D architecture. Subsequent fixation, permeabilization, blocking, staining, and washes are performed with the organoids in suspension. This method can be applied to organoids that have been subjected to various experimental conditions.\nMaterials\nEstablished organoid culture (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpim.106#cpim106-prot-0002])\nFetal bovine serum (FBS, Sigma-Aldrich, cat. no. F7524)\nCell Recovery Solution (Corning, cat. no. 354253)\nDispase (StemCell Technologies, cat. no. 07923; optional)\n4% (v/v) formaldehyde in aqueous buffer\nPermeabilization solution (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpim.106#cpim106-rec-0007])\nBlocking solution (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpim.106#cpim106-rec-0002])\nMouse anti–human KI67 primary antibody (BD Pharmigen, cat. no. 550609)\nPBS\nAlexa Fluor 488 donkey anti-mouse secondary antibody (Invitrogen, cat. no. A-21202)\nPhalloidin-Atto 647N (Sigma-Aldrich, cat. no. 65906)\nDAPI\nProLong Gold Antifade Mounting solution (Thermo Fisher Scientific, cat. no. P36934)\nVaseline petroleum jelly\nClear nail polish\nSterile scissors\n1000-μl pipette tips\n1.5-ml microcentrifuge plastic tubes\nBrightfield microscope\nTube roller\n300-μl low-retention filter tips (Greiner Bio-One, cat. no. 738 265)\n96-well black glass-bottom plate (Greiner bio-one, cat. no. 655892)\nMicroscope slides and cover slips\nRelease organoids\n1. Remove and discard medium from one well containing organoids.\nStarting with small organoids will help keep their structure intact. Starting with large and cystic organoids is more likely to result in disruption.\n2. With sterile scissors, cut the opening of a 1000-μl pipette tip 2-3 mm from its end. Coat the tip and a 1.5-ml microcentrifuge tube with FBS by pipetting 1 ml up and down once.\nCutting the tip is required to avoid disrupting the organoid structure while pipetting. Coating with FBS minimizes adhesion of organoids to plastic surfaces.",
    "3. Using the coated pipette tip, pipette 1 ml Cell Recovery Solution to the well, collect the organoids, and transfer to the coated microcentrifuge tube.\nRepeat steps 1-3 for each well of cells to be stained (e.g., for different experimental conditions).\n4. Incubate on ice for 20-30 min, inverting regularly to prevent clumping and heterogeneous BME dissociation.\nCell Recovery Solution dissolves the BME, freeing the organoids without disrupting their structure. Alternatively, the culture can be preincubated with dispase for 30 min at 37°C. Efficient dissolution of BME is key, as remaining BME can result in poor staining and higher background signal.\n5. Monitor BME dissociation under a microscope, stopping when BME is sufficiently dissolved.\n6. Let organoids settle by gravity to the bottom of the tube and remove the supernatant.\nFix and permeabilize organoids\n7. Add 1 ml of 4% formaldehyde and incubate 16 hr at 4°C (or 2 hr at room temperature) with constant rolling of the tube to ensure homogeneous fixation. Let organoids settle by gravity and remove supernatant.\nCAUTION: Formaldehyde is toxic. Avoid contact with skin and dispose of formaldehyde according to institutional and governmental safety rules.\n8. Add 1 ml permeabilization solution and incubate with constant rolling for 30 min at 4°C. Let organoids settle by gravity and remove supernatant.\nPermeabilization time and temperature may need to be optimized for particular staining methods.\nStain organoids\n9. Add 1 ml blocking solution and incubate 15 min at room temperature under constant rolling. Let organoids settle by gravity and remove supernatant.\n10. Add 200 µl of 500 ng/ml mouse anti–human KI67 primary antibody in blocking solution and incubate for 16 hr at 4°C under constant rolling. Let organoids settle by gravity and remove supernatant.\nIf using a different primary antibody, the final concentration must be optimized.",
    "11. Resuspend pellet in 1 ml PBS and incubate 10 min at room temperature with constant rolling. Let organoids settle by gravity and remove supernatant. Repeat wash two more times.\n12. Add 200 µl of 4 µg/ml Alexa Fluor 488 donkey anti-mouse secondary antibody, 10 nM phalloidin-Atto 647N, and 2 µg/ml DAPI in blocking solution and incubate 1-2 hr in the dark at room temperature with constant rolling.\nFrom this point, samples must be kept in the dark to protect the fluorophores from bleaching.\nIf using a different secondary antibody, the final concentration must be optimized.\n13. Wash three times as in step 11.\n14. Wash once with Milli-Q-purified water to prevent crystal formation.\n15. Cut the tip of a low-retention 300-μl tip 2-3 mm from its end and then coat the tip with FBS by pipetting 200 μl up and down once.\nThe FBS coating and low-binding tips minimize the number of organoids lost due to adhesion to the plastic surface in the next step.\n16a. For imaging in 96-well plates: Use the coated tip to resuspend organoids in 150-200 μl PBS and transfer them to one well of a 96-well black glass-bottom plate. For optimal results, image samples immediately after staining (Fig. 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpim.106#cpim106-fig-0004]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/52e08407-9a1d-4033-a218-aa337330e3f7/cpim106-fig-0004-m.jpg</p>\nFigure 4\nConfocal immunofluorescence images of human intestinal organoids cultured under expansion conditions. DAPI, nuclei; KI67, proliferation marker; phalloidin, F-actin staining. Scale bar, 0.1 mm.\n16b. For imaging on microscope slides: Use the coated tip to resuspend organoids in 50 μl ProLong Gold mounting solution and transfer them to a microscope slide. Apply Vaseline at the edges of the slide so that the coverslip does not disrupt organoid structure after mounting. Seal the slide using nail polish.\nSlides can be stored at 4°C, maintaining the fluorescence signal for months.",
    "Many downstream applications of organoid cultures (e.g., CRISPR/Cas9 genetic engineering, whole-genome sequencing) require generation of clonal cultures derived from single cells. To efficiently generate such cultures, organoids are first dissociated to single cells and seeded sparsely. After 10-15 days, individual organoids are picked using a pipette tip, gently disrupted by enzymatic means, and reseeded. After this step, grown organoids can be mechanically split following Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpim.106#cpim106-prot-0002]. For a general overview, see Figure 5A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpim.106#cpim106-fig-0005]. This protocol can be carried out using established organoids from Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpim.106#cpim106-prot-0002] or organoids subjected to various experimental conditions, like genetic engineering, treatment with mutagens, or other experimental setups requiring WGS.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/52988800-a98c-4b47-897a-32c716b4a494/cpim106-fig-0005-m.jpg</p>\nFigure 5\nClonal expansion of human intestinal organoid cultures. (A) Schematic of process. (B) Gating strategy for sorting of living cells used for clonal organoid outgrowth. Cells in P3 gate were sorted and seeded. (C) Single-cell organoid outgrowth after 10 days. Arrowhead indicates organoid of proper size for picking. Scale bar, 2 mm. (D) Organoid fragments after trypsinization of a single picked organoid. Scale bars, 1 mm (left) and 0.4 mm (inset at right).\nAdditional materials (also see Basic Protocols 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpim.106#cpim106-prot-0001] and 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpim.106#cpim106-prot-0005])\nEstablished organoid culture (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpim.106#cpim106-prot-0002])\n1× TrypLE Express Enzyme, phenol red (Gibco, cat. no. 12605036)\n37°C water bath\nSterile plugged Pasteur glass pipettes and automated pipetter\nSterile 10-μl pipette tips\nFlow cytometry tubes with 35-µm strainer cups (Corning, cat. no. 08-771-23)\nFlow cytometer\n12- and 48-well cell culture plates (Greiner Bio-One, cat. nos. 665 102 and 677 102)\nSterile 100-mm cell culture dish\nPrepare organoids\n1. Remove medium from one well of a 12-well plate culture of established organoid culture.\nThe process can be scaled up or down using different plate formats. For a guide to other formats, see Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpim.106#cpim106-tbl-0001].",
    "2. Using a P1000 pipette, flush organoids from the well with 1 ml ice-cold AdvDMEM+++ to disrupt the BME droplets. Collect the organoids and transfer to a 15-ml centrifuge tube containing 4 ml ice-cold AdvDMEM+++.\n3. Centrifuge 5 min at 450 × g, 4°C. Remove supernatant.\nDuring this step, undissolved BME often accumulates over the organoid pellet as a cloudy mesh. It is important to remove as much BME as possible without taking the organoids. If this is not possible, resuspend the pellet in the AdvDMEM+++, incubate on ice for 10 min, and then repeat step 3.\n4. Resuspend cell pellet in 1 ml prewarmed (37°C) TrpLE.\n5. Incubate 5 min in a 37°C water bath, vortexing at regular intervals to increase dissociation. Check progress regularly under a microscope, and stop once the majority of fragments consist of single cells.\n6. Coat a plugged glass Pasteur pipette with FBS to prevent cells from sticking to the glass. Connect a sterile 10-μl tip to the Pasteur pipette and use to mechanically disrupt the organoid fragments to obtain single cells (also see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpim.106#cpim106-prot-0002], step 5).\n7. Check cell suspension under the microscope. If organoids are not dissociated into single cells, repeat steps 5 and 6.\nLong incubation times with TrpLE will lead to increased cell death. It is important to maximize the number of single cells while minimizing dead cells.\n8. Add 4 ml ice-cold AdvDMEM+++ with 10 µM RhoKi to the cells.\n9. Move a small fraction of cells to another tube to use as a DAPI-negative control in the FACS gating.\n10. Centrifuge for 5 min at 450 × g, 4°C. Remove supernatant.\n11. Resuspend cells in 0.5 ml ice-cold AdvDMEM+++ supplemented with 10 µM RhoKi and 2 µg/ml DAPI. Omit DAPI in the negative control sample.",
    "12. Pass cells through the strainer of a 35-μm mesh-cupped flow cytometry tube. Transport cells to the flow cytometer on ice and protected from light.\nDAPI will only stain apoptotic cells with disrupted cell membrane integrity.\nPerform sorting and start cultures from single live cells\n13. Sort living cells (DAPI-negative) into a 1.5-ml microcentrifuge tube containing 0.5 ml AdvDMEM+++ supplemented with 10 µM RhoKi (Fig. 5B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpim.106#cpim106-fig-0005]).\n         \nUse FSC and SSC to gate intact epithelial cells with intact morphology (Fig. 5B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpim.106#cpim106-fig-0005], left panel, P1).\nOn the gated population, use FSC and Trigger Pulse Width to select single cells and deplete cell duplets or triplets (Fig. 5B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpim.106#cpim106-fig-0005], middle panel, P2).\nUse the [405]460/50-DAPI channel to gate and sort living DAPI-negative cells (Fig. 5B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpim.106#cpim106-fig-0005], right panel, P3).\nAt this step, note the number of cells sorted in the tube in order to calculate seeding cell density in the following steps.\nThe cells not treated with DAPI can be used as a negative control in the FACS gating strategy (Fig. 5B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpim.106#cpim106-fig-0005]).\nSorting is important to make sure that single cells are used grow clonal cultures. It is very important if WGS will be performed, as loss of clonality prevents interpretation of WGS data.\nAlternatively, if cells have been subjected to CRISPR/Cas9 gene editing, cells can be passed through a 40-µm cell strainer to increase the likelihood that dissociated single cells are seeded. After this, living cells are counted using a hemocytometer so that the seeding density can be estimated. While this approach is less stringent than sorting, it may enhance outgrowth efficiency and is acceptable if many clonal lines will be generated and screened later. Double-picking strategies can be applied in order to increase the likelihood of obtaining clonal cultures.\n14. Centrifuge cells 5 min at 450 × g, 4°C. Remove supernatant.",
    "The pellet may not be visible due to a low number of sorted cells. Be extremely careful when removing the supernatant, and do not touch the tube walls with the pipette tip.\nIt is important that the BME droplets are solid after seeding to prevent dissociation before picking time and to avoid loss of organoid clones. To this end, make sure to remove as much supernatant as possible to increase the BME concentration.\n15. Resuspend cells homogeneously in BME to a density of 50-100 cells/µl. Pipette cells in ∼15-µl domes in a 12-well plate.\nThe final cell concentration should be 50-100 cells per µl BME in order to maximize organoid outgrowth and minimize organoid fusion afterwards. Sparse seeding will impair organoid outgrowth, while dense seeding could lead to organoid fusion and loss of clonality of the future culture.\n16. Place the plate upside-down in the incubator for 20 min to let the domes solidify.\n17. Add expansion medium supplemented with 10 µM RhoKi and keep in the incubator, refreshing the medium (with RhoKi) every 2-3 days.\nAfter 7-14 days, single cells should have formed organoids (Fig. 5C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpim.106#cpim106-fig-0005]). Due to donor-to-donor variability, some cultures will take longer. If this is the case, keep organoids expanding for an extra week before continuing with the next step.\nIsolate and expand clonal organoid cultures\n18. Remove medium from the organoid well. Collect organoids in 1 ml Cell Recovery Solution and incubate on ice for 30 min.\nThis should liberate organoids from the BME, making them easier to pick in the next step.\n19. Pipette solution containing organoids in ∼500-µl drops in a sterile 100-mm cell culture dish.\nIt is important that the drops not touch the dish walls, as organoids on the walls will not be visible under the microscope.",
    "20. Place the plate under a brightfield microscope and open the lid.\nAvoid moving or speaking above the opened plate. Make sure to add Primocin to the expansion medium at step 26.\n21. Using a P20 pipette, pick individual organoids from the drop and transfer each one to a separate 1.5-ml microcentrifuge tube containing 300 µl TrypLE at 4°C.\nIt is recommended to pick a high number of clonal organoids, because the outgrowth efficiency is not 100%. We recommend picking ∼20 organoids per condition in an optimal growth state.\n22. Incubate in a 37°C water bath for 1 min.\n23. Add 700 µl AdvDMEM+++ containing 10 µM RhoKi and pipette up and down three to five times using a P1000 pipette.\n24. Centrifuge 5 min at 500 × g, 4°C. Remove supernatant.\nAgain, the pellet may not be visible due to the low number of cells in the organoid. Be extremely careful when removing the supernatant, and do not touch the tube walls with the pipette tip.\n25. Resuspend in 20 µl BME and seed in a well of a 48-well plate (Fig. 4D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpim.106#cpim106-fig-0004]).\n26. Add expansion medium supplemented with 100 μg/ml Primocin and 10 µM RhoKi.\n27. After organoids grow out, pass them as in Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpim.106#cpim106-prot-0002].",
    "Wnt3A-CM is an important component of the human intestinal organoid expansion medium. Its role in activating the Wnt pathway is key to maintenance of the stem cell population. Thus, the production of high-quality Wnt3A-CM is essential for successful establishment and culture of human intestinal organoids.\nMaterials\nL-Wnt-3A cells from frozen cryovial (from a T25 flask cultured to 95%-100% confluence) (provided upon request and after material transfer agreement)\nDMEM++ (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpim.106#cpim106-rec-0004])\nZeocin (Gibco, cat. no. R25001)\n1× TrypLE Express Enzyme, phenol red (Gibco, cat. no. 12605036)\nHEK 293-STF cells (ATCC, CRL-3249)\nT175 cell culture flasks (Greiner Bio-One, cat. no. 661160)\n37°C, 5% CO2 cell culture incubator\n145-mm cell culture dishes (Greiner Bio-One, cat. no. 639160)\n0.22-µm Stericup-GP filter (polyethersulfone, 500 ml, radio-sterilized; Millipore, cat. no. SCGPU05RE)\n1. Start L-Wnt-3A cell culture from a frozen cryovial. Seed cells in a T175 flask with 20 ml DMEM++ supplemented with 125 µg/ml Zeocin. Grow at 37°C and 5% CO2 until the culture reaches 90%-100% confluence (~3-4 days).\nA key component of DMEM++ medium is the FBS, to which L cells are very sensitive. Different batches of FBS should be tested to find one that efficiently supports growth of both L cells and organoids.\n2. Split cells to two T175 flasks using TrypLE and grow cells in DMEM++ with 125 µg/ml Zeocin at 37°C and 5% CO2 until they reach 90%-100% confluence (~3-4 days).\n3. Split cells to a total of twelve T175 flasks. Add DMEM++ supplemented with 125 µg/ml Zeocin to two flasks and use these for a new round of Wnt3A-CM production (step 2). Add DMEM++ without Zeocin to the other ten flasks and use these for steps 4-7.\nL-Wnt-3A cells should only be used until passage 10-12.\n4. Allow cultures in the ten flasks to grow to confluence (~1 week).",
    "5. Trypsinize cultures, pool the cells, and seed in sixty 145-cm2 dishes in 20 ml DMEM++ without Zeocin per plate. Incubate cells for 1 week at 37°C and 5% CO2.\n6. Harvest medium and centrifuge for 5 min at 450 × g, 4°C.\n7. Collect supernatant and pass through a 0.22-µm Stericup-GP filter.\nIt is important to remove all L-Wnt-3A cells from the conditioned medium, as they will otherwise overgrow the organoids when the Wnt3A-CM is used for organoid culture.\n8. Test the quality of every batch of Wnt3A-CM using a luciferase-based assay in the HEK 293T-STF Wnt reporter cell line (Xu et al., 2004[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpim.106#cpim106-bib-0030]).\nAs a reference, an optimal batch induces 15- and 300-fold increases in signal when used at concentrations of 12.5% and 50% (v/v), respectively. Using Wnt3A-CM at 1%-2% (v/v) should give a signal similar to background.\nFreshly prepared Wnt3A-CM can be stored at 4°C for long periods of time (>6 months).",
    "Rspo1-CM is used to prepare organoid medium as well as all of the differentiation media described here. The presence of Rspo1 in organoid expansion medium results in a synergistic increase in Wnt pathway activation levels compared to those achieved by Wnt3A-CM alone. Thus, Rspo1-CM is another key component of the medium used for establishment and expansion of human intestinal organoids.\nAdditional materials (also see Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpim.106#cpim106-prot-0007])\n293T-HA-RspoI Fc cells from frozen cryovial (from a T25 flask cultured to 95%-100% confluence) (R&D Systems, cat. no. 3710-001-01)\nT75 cell culture flasks (Greiner Bio-one, cat. no. 658170)\n1. Start 293T-HA-RspoI Fc cell culture from a frozen cryovial. Seed cells in a T75 flask with 20 ml DMEM++ supplemented with 300 µg/ml Zeocin. Grow at 37°C and 5% CO2 until the culture reaches 90%-100% confluence.\n2. Split cells to two T175 flasks using TrypLE and grow cells in DMEM++ with 300 µg/ml Zeocin at 37°C and 5% CO2 until they reach 90%-100% confluence.\n3. Split cells to a total of twelve T175 flasks. Add DMEM++ supplemented with 300 µg/ml Zeocin to two flasks and use these for a new round of Rspo1-CM production (step 2). Add DMEM++ without Zeocin to the other ten flasks and use these for steps 4-6.\n293T-HA-RspoI Fc cells should only be used until passage 10-12.\n4. Grow cells in the ten flasks to 75% confluence (2-3 days).\n5. Remove DMEM++ from the culture and add 50 ml serum-free AdvDMEM+++ without Zeocin per flask. Incubate cells for 1 week at 37°C and 5% CO2.\nDuring the week, the culture medium will acquire a yellow color. The medium should not be refreshed, because Rspo1 is being secreted during this time.\n6. Harvest medium and centrifuge for 5 min at 450 × g, 4°C.",
    "7. Collect supernatant and pass through a 0.22-µm Stericup-GP filter.\nIt is important to remove all 293T cells from the conditioned medium, as they will otherwise overgrow the organoids when the Rspo1-CM is used for organoid culture.\n8. Test the quality of every batch of Rspo1-CM using a luciferase-based assay in the HEK 293T-STF Wnt reporter cell line.\nAs a reference, an optimal batch induces 100- and 600-fold increases in signal over background levels when used at concentrations of 0.25% and 2.5% (v/v), respectively, when used in combination with 12.5% (v/v) Wnt3A-CM. In the absence of Wnt3A-CM, Rspo1-CM does not significantly activate the Wnt pathway. However, its presence there contributes to increased viability of terminally differentiated organoids.\nThe process can be scaled up if larger volumes of Rspo1-CM are required. The ratio of medium volume to culture surface should be maintained.\nFreshly prepared Rspo1-CM can be stored at −20°C for 6 months. The CM should be dispensed in aliquots adequate to your needs before freezing. Once thawed, store at 4°C and use preferably within 4 weeks. Avoid repeated freeze-thaw cycles.",
    "This protocol can be used with established organoid cultures, including those subjected to various experimental conditions.\nMaterials\nEstablished organoid culture (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpim.106#cpim106-prot-0002])\nColumn-based extraction kit (RNAeasy Mini Kit, Qiagen, cat. no. 74104)\nFreshly prepared 70% (v/v) ethanol\nRNase-free DNase set (Qiagen, cat. no. 79254)\nRNase-free 1.5-ml microcentrifuge tubes\n1. Remove medium from organoid well and dissolve the BME drop containing the organoids directly in 350 µl RLT buffer from the RNAeasy Mini Kit. Pipet several times up and down and transfer the suspension to a 15-ml plastic tube.\nThe starting material should be at least one full well of a 24-well culture plate. To ensure there is enough RNA material, it is preferable to use one full well of a 12-well plate. If organoids are cultured under differentiation conditions, expect the yield to decrease and use increased amounts of organoids for RNA assessments.\n2. Mix the resulting solution 1:1 (v/v) with freshly prepared 70% ethanol and vortex.\n3. Isolate RNA according to the manufacturer's instructions, starting with step 4 of “Protocol: Purification of Total RNA from Animal Cells Using Spin Technology” from the Qiagen RNAeasy Handbook Guide (https://www.qiagen.com/ie/resources/resourcedetail?id=14e7cf6e-521a-4cf7-8cbc-bf9f6fa33e24&lang=en[href=https://www.qiagen.com/ie/resources/resourcedetail?id=14e7cf6e-521a-4cf7-8cbc-bf9f6fa33e24&lang=en]).\nPerform optional DNase digestion after step 5 of the protocol, as indicated in Appendix D (“Optional On-Column DNase Digestion with the RNase-Free DNase Set”) of the guide.\n4. Elute in 30 µl RNase-free water.\nElution volume depends on the amount of starting material and should be adjusted accordingly."
  ],
  "subjectAreas": [
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}