{
  "id": 19658,
  "origin_website": "Jove",
  "title": "Measuring Membrane Lipid Turnover with the pH-sensitive Fluorescent Lipid Analog ND6",
  "procedures": [
    "The following protocol includes (1) a simplified procedure for establishing mouse hippocampal and cortical cultures based on a well-established protocol22, (2) a brief introduction to an epifluorescence microscope setup for live neurons, (3) a detailed description of loading and imaging ND6 in mouse neurons, (4) a discussion about the quantification of membrane trafficking by ND6 signal. All procedures follow the biosafety and IACUC guidelines at the Florida Atlantic University. The synthesis of ND6 has been described previously20.\n1. Preparation of mouse hippocampal and cortical cultures\nNOTE: If not specified otherwise, all steps must be performed in a biosafety level 2 laminar flow hood. Sterilize all tools and materials.\nUse size 5 forceps to place glass coverslips in multiwell culture plates.\n\tNOTE: For example, a 24-well plate is ideal for 12 mm imgsrc://cloudfront.jove.com/files/ftp_upload/62717/62717eq01v2.jpg coverslips.\nAdd the appropriate volume of extracellular matrices to coat the cell culture surface (e.g., 75 μL of basement membrane matrix solution per 12 mm imgsrc://cloudfront.jove.com/files/ftp_upload/62717/62717eq01v2.jpg coverslip; see the Table of Materials)\nPlace the prepared plates in the tissue culture incubator (5% CO2, 100% humidity, and 37 °C) for 1-4 h to allow basement membrane matrix crosslinking.\nSacrifice the animals, open the skull, and transfer the whole brain to a 35 mm Petri dish with 3 mL of Hank's Balanced Salt Solution (HBSS) containing 20% fetal bovine serum (H+20). Cut the brain along the midline, and separate the cortices and hippocampi in a laminar flow dissection hood to reduce contamination.\nUse microscissors to cut the tissues into small pieces (~1 mm3). Transfer those tissues to a 15 mL conical tube containing 5 mL of H+20.\nWash the tissues three times with 5 mL of H+20 and three times with 5 mL of HBSS.",
    "Add 1.5 mL of 1% trypsin with ethylenediamine tetraacetic acid and incubate at 37 °C for 10 min for enzyme digestion.\nRepeat step 1.6 and use vacuum to aspirate HBSS in the end.\nDissociate the tissues mechanically in 1 mL of HBSS containing 2.95 g/L MgSO4•7H2O using a fire-polished glass pipette.\nCentrifuge the cell suspension at 400 × g, 4 °C for 5 min.\nAspirate the supernatant and resuspend the cells in an appropriate volume of culture media to obtain a concentration of ~10,000,000 cells/ml.\nPlate the cells at ~1,000,000 cells/cm2 and place the culture in the incubator (5% CO2, 100% humidity, and 37 °C) for 1-4 h to facilitate cell attachment to the glass coverslips.\nAdd an appropriate volume of culture medium (e.g., 1 mL per well for a 24-well plate). Add the same volume of culture medium after 1 week. After 2 weeks, replace half of the existing culture medium with fresh media every week.\n2. Microscope setup for live-cell fluorescence imaging\nNOTE: An exemplary imaging setup (Figure 5) includes at least an inverted fluorescence microscope (see the Table of Materials), fluorescence light source with automatic shutter, fluorescence filter sets (e.g., for imaging ND6, use 405/10 BP for excitation, 495 LP for dichroic, and 510/20 BP for emission), and a high-sensitivity camera (Table of Materials), all of which are controlled by image acquisition software (Table of Materials).\nPrepare an imaging chamber that allows temperature control and solution input/output for live-cell fluorescence imaging.\n\tNOTE: For example, a modified open-bath imaging chamber fixed on a heating platform was used in this protocol (Figure 6).\nSet up a programable device to switch the perfusion solutions and deliver the electric stimulus at defined time points during imaging.",
    "NOTE: Hardware and software synchronization is necessary for quantitative analyses (Figure 7). For example, in this protocol, a trigger output from the imaging camera was used to start a computer program that controls an automatic switch device, which controls a multichannel perfusion system and a square-pulse stimulator.\nTo co-image two or more fluorescent reporters, perform multichannel fluorescence imaging either by sequentially switching filter sets or by simultaneously splitting different fluorescence emissions and projecting to the same camera.\n3. Loading and imaging ND6 in neuronal cultures\nWeigh out an appropriate amount of ND6, dissolve it in dimethylsulfoxide (DMSO), and allow it to solubilize at room temperature; sonicate briefly (e.g., 3 min). Filter the crude stock solution using a 0.22 μm filter to remove large dye aggregates. After filtration, determine the dye concentration by absorption spectroscopy at 405 nm using a conventional or microvolume spectrophotometer using ε = 10,700 M-1 cm-1.\nBefore application, dilute the stock solution to a concentration of 1 μM using the bath solution. Keep the stock solution at room temperature in the dark.\nLabeling of endosomes and synaptic vesicles\n\t\nTo ubiquitously label endocytosed membrane compartments such as endosomes, add ND6 stock solution (e.g., 1 mM in DMSO) to the culture medium at the final concentration of 1 µM, and incubate at 5% CO2, 100% humidity, and 37 °C for 30 min. To reduce the extent of SV labeling, suppress the spontaneous neuronal activity pharmacologically. For example, use tetrodotoxin to block action potentials or 2,3-dioxo-6-nitro-1,2,3,4-tetrahydrobenzo[f]quinoxaline-7-sulfonamide (NBQX) and D-(-)-2-amino-5-phosphonopentanoic acid (D-AP5) to inhibit excitatory transmission23.",
    "To selectively label SVs, use brief but strong stimulation to evoke presynaptic exo-/endocytosis. First, transfer the culture coverslip(s) to a 35 mm imgsrc://cloudfront.jove.com/files/ftp_upload/62717/62717eq01v2.jpg Petri dish containing 2 mL of normal Tyrode's solution at room temperature. Second, dilute the ND6 stock solution in high-K+ Tyrode's solution (90 mM KCl) at the final concentration of 1 μM. Third, replace the normal Tyrode's solution in the Petri dish with ND6-containing high-K+ Tyrode's solution and incubate at room temperature for 2 min.\nTransfer the ND6-labeled cell culture to the imaging chamber filled with prewarmed normal Tyrode's solution containing 10 μM NBQX and 10 μM D-AP5.\nAdjust the perfusion speed to ~0.2 mL/s (i.e., 1 drop per second) and start the perfusion of prewarmed normal Tyrode's solution containing NBQX and D-AP5 to remove excessive ND6 in the culture.\nAdjust the focus and locate the appropriate field of view containing healthy and well-spread neurons bearing connected neurites. Avoid areas containing unresolved dye colloids.\nTry imaging ND6-loaded cells with different exposure times to identify the best imaging settings.\n\tNOTE: For the best exposure time, the highest pixel fluorescence intensity in the resulting image is about half of the bit range (e.g., for a 16-bit image, the bit range is from 0 to 65,535), which will allow a further increase in fluorescence when the acidic bath solution is applied. The selected exposure time should be used for all ND6 imaging.\nSet up the stimulation and perfusion protocol, frame interval, and total duration. For example, in the following protocol, use a 30 s baseline, a 10 s 30 Hz electric field stimulation, 50 s recovery, 120 s 90 mM K+, 60 s recovery, 60 s Tyrode's solution with 50-mM NH4Cl, 60 s Tyrode's solution at pH 5.5, and a frame interval of 3 s.",
    "Start the image acquisition accompanied by the synchronized stimulation and perfusion. Monitor the simulation and solution exchange during imaging.\nStop the perfusion after the imaging ends, remove the coverslip, and clean the imaging chamber for the next trial.\n4. Quantification of membrane trafficking by a change in ND6 fluorescence\nBack up and/or make an electronic copy of all image files.\nChoose an analysis program for data extraction, e.g., an open-source image analysis software such as ImageJ24 and/or FIJI25.\nOpen or import an image stack to the analysis program.\nSet the first image as the reference and align the rest to it using functions/plugins such as Rigid Registration26, which will mitigate artifacts due to xy-drifting. Refer to Figure 8 for example images.\nAverage all images acquired during the 30-s pre-baseline to produce a reference image. Save a copy of this image for future reference.\nSet the intensity threshold to generate a binary image from the baseline-averaged image.\nUse Watershed in ImageJ or similar functions in another program to separate connecting neurites or cells.\nUse the Analyze Particle function with appropriate area size and circularity to solicit regions of interest (ROIs) corresponding to cell membranes, endosomes, lysosomes, or synaptic boutons. Save all selected ROIs.\nSelect four background ROIs in cell-free regions within the field of view.\nMeasure the average pixel intensities for each ROI in every frame of the image stack, and export the results for statistical analysis.\nCalculate the mean intensity of the background ROIs as the baseline noise, which will be subtracted from the average pixel intensities for each ROI.\nAverage the three highest average intensities for every selected ROI during the application of pH 5.5 Tyrode's solution to obtain the maximal fluorescence intensity, which is defined as 100% for normalization.",
    "Average the three lowest average intensities for every selected ROI during the application of 50 mM NH4Cl to set the minimal fluorescence intensity, which is defined as 0% for normalization.\nCalculate the relative fluorescence changes for every ROI based on its own 0% and 100% intensities. Derive mean fluorescence changes, change kinetics, and other values/plots from individual ROI data.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}