{
  "id": 12090,
  "origin_website": "Jove",
  "title": "A Melanoma Patient-Derived Xenograft Model",
  "procedures": [
    "The following animal protocols follow the guidelines of The Wistar Institute’s humane ethics committee and animal care guidelines.\n1. Melanoma tumor tissue collection\nCollect tumor tissue (termed passage 0) from melanoma patients by one of the following surgery or biopsy methods.\n\t\nFor surgical excision tissue, maintain a minimum of 1 g of tissue (resect metastases and primary lesions) in transport storage media (RPMI 1640 + 0.1% fungizone + 0.2% gentamicin) at 4 °C or on ice.\nFor surgical biopsy tissue, maintain less than 1 g of tissue (often punch biopsies of subcutaneous [s.c.] metastases and lymph node [LN] metastases) in transport storage media at 4 °C or on ice.\nFor core biopsy tissue, wash out a cylinder (core) of tissue of approximately 10 mm x 1 mm (often, liver biopsies) into a 15 mL tube containing 5 mL of transport storage media at 4 °C or on ice.\nFor fine needle aspirate (FNAs) tissue, keep  a very small amount of tissue (less than 1 mm in size) taken directly from the patient in a needle and syringe at 4 °C or on ice.\nDeliver the tissue in transport storage media at 4 °C or on ice on the same day or with overnight shipping after surgical excision or biopsy. Process the tissue within 1-2 h of delivery.\n2. Tumor tissue processing for mouse implantation\nSurgical excision or surgical biopsy tissue processing\n\t\nTransfer the tissue to a sterile Petri dish and separate the tumor tissue from surrounding normal tissue as much as possible.\nRemove necrotic tissue (usually identified as pale-whitish tissue located centrally within the tumor) from the remaining tumor as much as possible.\nUse a scalpel to subdivide an initial tumor chunk into approximately equal pieces (~3 mm x 3 mm) for surgical mouse implantation (Figure 2).",
    "Optionally, if enough tumor tissue is available, snap-freeze the tissue for downstream assays (RNA sequencing [RNASeq], whole exome sequencing [WES], etc.).\nMake a tumor slurry by mincing the tumor tissue using a cross blade technique with two scalpel blades. Mince the tumor chunks as finely as possible to form a slurry, which is now ready for surgical mouse implantation.\nAlternatively, if the tumor tissue is too hard for mechanical dissociation, use a digestion dissociation procedure to form gel-like slurry and a single-cell suspension for implantation and/or injection.\n\t\t\nMince the tumor chunks as finely as possible to form slurry.\nPut the slurry in a 50 mL tube with cold Hank’s balanced salt solution (HBSS)-/- (without Ca++ and Mg++); then, centrifuge and pellet at 220 x g for 4 min at 4 °C.\nResuspend the slurry in 10 mL of warmed fresh digest media (200 U/mL collagenase IV + 5 mM CaCl2 + 50 U/mL DNase in HBSS-/-) per 1 g of tumor tissue.\nPlace the tube in a 37 °C water bath for 20 min and mix vigorously every 5 min with a disposable pipette.\nWash with up to 50 mL of HBSS-/-; then, centrifuge at 220 x g for 4 min at 4 °C.\nAdd 5 mL of prewarmed TEG (0.025% trypsin + 40 µg/mL ethylene glycol-bis(β-aminoethyl ether)-N,N,N’,N’-tetraacetic acid [EGTA] + 10 µg/mL polyvinyl alcohol [PVA]) per 1 g of tumor tissue, gently resuspend/shake, and place the tube at 37 °C for 2 min without mixing.\nAdd at least 1 equal volume of cold staining media (1% bovine serum albumin [BSA] + 10 mM 4-(2-hydroxyethyl)-1-piperazineethanesulfonic acid [HEPES] + 1x penicillin-streptomycin in L15 media) to quench the trypsin and centrifuge at 220 x g for 4 min at 4 °C.",
    "Resuspend the sample in 10 mL of staining media per 1 g of tumor tissue and filter it through a 40 µm cell strainer to get a single-cell suspension for mouse injection (Figure 2).\nSlurry remaining on top of the cell strainer can also be collected for surgical mouse implantation.\nCore biopsy tissue processing\nPour the core cylinder tissue in tissue-transport tube into a 5 cm Petri dish.\nRemove excess liquid, scrape tissue to the edge of the Petri dish, finely mince the tumor tissue, add ~100–150 µL of HBSS-/- on top of the tumor tissue, and quickly draw the HBSS/tumor tissue suspension into the 1 mL syringe.\nAttach a 23 G needle to the 1 mL syringe, pass the HBSS/tumor tissue suspension through the needle into a 1.5 mL spin tube.\nRedraw the tumor suspension into the syringe with the needle still on until it can pass smoothly through the needle.\nFinally draw the tumor suspension back into the syringe and detach the 23 G needle.\nAttach a 27 G needle and draw an equal volume (~100–150 µL) of artificial extracellular matrix (see Table of Materials) into the syringe.\nAdd an equal volume of artificial extracellular matrix slowly into the 1.5 mL spin tube with the tumor/HBSS-/- suspension, carefully avoiding the formation of bubbles.\nDraw one last time back into the syringe and the core biopsy tumor tissue is now ready for mouse injection.\nFNA tissue processing\nPlace the syringe containing the FNA samples (trapped in the needle) on ice.\nSeparate the needle (containing FNA tissue) from the syringe and remove the plunger from the syringe, add ~150–200 µL of HBSS-/- to the top of the syringe.",
    "Re-insert the plunger into the syringe and the needle (containing FNA tissue), and push out the HBSS-/- through the needle into a 1.5 mL spin tube. This step removes the FNA tumor from the needle.\nRepeat step 2.3.3 with the HBSS-/-/FNA suspension twice using the same syringe to maximize the retrieval of tumor tissue from the needle.\nAdd an equal volume (~100–150 µL) of artificial extracellular matrix to the 1.5 mL spin tube containing the HBSS/FNA suspension.\nAdequately mix by slowly drawing up the artificial extracellular matrix/HBSS-/-/FNA suspension back into the 23 G needle and repeating twice.\nDraw the entire artificial extracellular matrix/HBSS-/-/FNA volume back into the syringe, replace the 23 G needle with a 27 G needle, and the FNA sample is now ready for mouse injection.\n3. Tumor implantation and injection in mice\nImplantation of surgical excision or surgical biopsy tissue\n\tNOTE: Ensure all surgical instruments are sterile by autoclaving or the use of pre-sterilized disposable instruments.\n\t\nShave hair from the lower back of NSG 6-8 week male or female mice leaving an approximately 1.5 cm x 3 cm area with no hair. Anesthetize mice using isoflurane, and confirm by gently squeezing the foot as a test of responsiveness. Use vet ointment on their eyes to prevent dryness.\nPlace individual mice on a heat pad in the nose cone of the anesthesia machine, scrub the shaved area with chlorhexidine. Then douse with 70% ethanol and allow to evaporate.\nPrepare chunks or divide tumor slurry in a Petri dish into individual mounds for surgical implantation (i.e., into three equal mounds if to be implanted into 3 mice).",
    "Using the scalpel blade, make an incision of approximately 5 mm long on the center of the back of the mouse, take one pair of forceps and lift up skin on the side of the incision opposite of operator.\nTake the scissors into the other hand and separate the skin from the muscle layer by gently cutting the fascial membrane with small scissor cuts, thereby creating a \"pocket\" for the tumor tissue.\nPick up one tumor chunk or one individual mound of tumor slurry tissue with the scalpel blade and gently place tissue into the created pocket.\nAdminister 100 µL of artificial extracellular matrix on the tumor tissue mound in the pocket.\nUsing two pairs of forceps, pull up the incision on both ends so that the wound edges come close together, and close the wound by applying one or two wound clips.\nSubcutaneous inject 1-5 mg/kg meloxicam as an analgesic in mice after surgery.\nTake the mouse out of the nose cone and place it back into its original cage, observe the mouse while waking up. Do not return to a cage until fully recovered.\nRemove wound clips after approximately 7 days. If healing is not complete after 7 days, leave the wound clip in for an additional one or two days.\n\t\tNOTE: If using a single cell suspension from surgical excision or surgical biopsy tissue processing, it will mix with artificial extracellular matrix (at 1:1 ratio) for mice injection.\nInjection of FNA or core biopsy tissue\n\t\nPlace an NSG mouse on a steel grid rack, hold the mouse firmly by the tail, and gently pull the mouse back. It will grasp the grid with its front legs firmly. Alternatively, restrain a mouse in the non-dominant hand and let the flank area visible.",
    "Disinfect the skin of the flank with alcohol prep swabs, slowly and steadily inject the contents of the syringe under the skin of the mouse.\nPull out the needle and place the mouse back into its cage.\n4. Monitor tumor growth\nMonitor mice once weekly to check for palpable tumors.\nOnce tumors are at a measurable size (approximately 50 mm3), use a caliper to record tumor dimensions. Use the following formula to calculate tumor volumes: (width x width x length) / 2.\nHarvest tumor once the tumor volume reaches around 1.5 cm3 (approximately 4–10 weeks). The tumor is now called mouse passage 1 (MP1).\n5. Harvest tumor for banking tissue, reimplantation, and experiment/characterization\nEuthanize mouse in a CO2 chamber, check vital signs to confirm death, and then submerge the mouse in a Virkon solution to sterilize the skin for 30 s in the bio-cabinet.\nUse curved scissors and surgical forceps to lift skin adjacent to the tumor and make a horizontal cut.\nUse a blunt separation technique to mobilize the skin on both sides of the tumor and over the tumor, exposing the tumor.\nUse scissors or a scalpel blade to separate the tumor from the fascia.\nResect the tumor and transfer the tumor to a sterile Petri dish, cut the tumor into small pieces and remove necrotic tissue from the tumor.\nBank tumor tissue for future implantation.\n\t\nTake 2-3 small tumor pieces smaller than ~10 mm x 10 mm and mince them into pieces smaller than ~1 mm x 1 mm.\nTransfer all minced tissue to a 2 mL cryogenic vial, add 1 mL of freezing media (10% DMSO + 90% FBS).\nMix well and place cryogenic vials into a pre-cooled isopropanol-based cell-freezing container on dry ice.",
    "Store container in -80 °C freezer overnight and then transfer cryogenic vials to liquid nitrogen (LN2) storage.\nSnap-freeze tissue for downstream assays (RNASeq, WES, etc.).\n\t\nPlace tumor tissue pieces (~3 mm x 3 mm) into a cryogenic vial and put the cryogenic vial in LN2 immediately. Store vials in -80 °C freezer.\n6. PDX therapy trials\nNOTE: It will take two expansion phases to grow enough tumor tissue to generate the necessary number of PDX bearing mice for the therapy trial.\nPick up a cryovial containing banked PDX tissue from LN2, and place the cryovial in a 37 °C water bath until the freezing media containing the tumor tissue is just starting to melt.\nEmpty the contents of the cryovial into pre-warmed HBSS-/- in a 50 mL tube, and wash tissue.\nPellet tissue by centrifugation for 5 min at 1,200 rpm.\nRemove HBSS-/- from the tumor sample by vacuum aspiration with a Pasteur pipet.\nSlide the PDX tissue from the 50 mL tube into a 5 cm or 10 cm Petri dish and place on wet ice.\nFollow the above implantation protocol to implant banked tissue from a cryogenic vial into 5 NSG mice for the first round of PDX tumor expansion.\nOnce tumors reach ~600–800 mm3, harvest 1-2 tumors to get a single cell suspension with the above protocol for tumor tissue processing: mechanical dissociation, collagenase digestion dissociation procedure.\nPellet cells and resuspend in 6 mL of HBSS-/-/artificial extracellular matrix (1:1 ratio), subcutaneous inject ~50 NSG mice, with 100 µL of cell mixture per mouse for the second round of PDX tumor expansion.\nMeasure tumor size with calipers biweekly.\nWait for a tumor size of ~100 mm3 in 3-5 weeks, randomize mice into groups, and start treatment.\nWhen tumor size reaches the maximum IACUC-approved volume, stop treatment.",
    "Follow the above harvest tumor protocol to collect snap frozen tumor pieces, tumor pieces for paraffin blocks.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}