{
  "id": 10765,
  "origin_website": "Jove",
  "title": "Applications of In Vivo Functional Testing of the Rat Tibialis Anterior for Evaluating Tissue Engineered Skeletal Muscle Repair",
  "procedures": [
    "All animals were humanely treated and all protocols were approved by the University of Virginia IACUC.\n1. Equipment Preparation\nEnsure that all machines are properly connected.\nTurn on the computer, followed by the high-power bi-phase stimulator and dual-mode lever system.\nAt this time, place the animal into the anesthesia chamber supplied with 2% isoflurane, and turn on the heating element so that the platform is heated to 37 °C.\nPlace the electrodes in 70% ethanol so that the polytetrafluoroethylene (PTFE) coated tips are submerged and will be disinfected while setting up the device and software.\nLocate and open the lever system control software on the desktop.\n\tNOTE: This will be the software needed to perform functional testing.\n2. Software Setup\nOnce the program is opened (Figure 1A), change the parameters for Instant Stim under the Setup menu to the desired values.\n\tNOTE: In this protocol, all parameters remain at the preset levels with the exception of \"Run Time (s)\", which is changed to 180 sec (Figure 1B).\nCreate an Autosave folder under the Setup menu.\nLocate a type-able window labeled \"Autosave Base\". Input the name of the sample, for example \"Rat1-date-timepoint\". Directly to the left of the \"Autosave Base\" type-able window, click on the box to \"Enable Autosave.\"\nAt the top of the Control Screen, select \"Sequencer\". A new window will open. On the bottom of the new window, select \"Open Sequence\". A new window will open. Select the premade sequence and click OK. A protocol list with sequence parameters including frequency, duration of stimuli, and rest time will develop in the window named: Sequence Editor (Figure 1C). Click \"Load Sequence\"-> \"Close Window.\"\nTo see real time current and stimulation, select \"File\"->\"Live Data Monitor\". A new window will open.",
    "In the new Live DataWindow, format screen for testing by using the autoscale function, or manually enter the maximum and minimum y-values displayed on the screen.\n3. Animal Set-up\nNOTE: All force measurements are those of an 11 week-old Lewis rat. There is a linear correlation between muscle mass and force production (in Newtons). Therefore, as the age of the rat increases, the force values produced by the leg should increase as well.\nEnsure that the animal is in the proper plane of anesthesia before removing it from the anesthesia chamber. Completely remove all hair on the lateral side between the ankle and pelvis of the experimental leg using an electric hair clipper.\n\tNOTE: The proper plane of anesthesia is achieved when the animal is non-responsive to a toe pinch. It is necessary to follow the guidelines put forth by each institution's Animal Care and Use Committee.\nPlace the animal in the supine position, ensuring the nose of the animal is securely in the anesthesia nose cone so it remains at the sufficient depth of anesthesia.\nRegulate the position of the pedal apparatus by three independent knobs (Figure 2). Using the knobs (A and B) to adjust the foot pedal, place the pedal apparatus at its far left and lowest position, respectively. This will enable the correct positioning of the animal's foot while leaving room for later manipulations. At this position, use the knob on the left of the track to move the apparatus either toward or further away from the experimenter so that the animal leg lies in a straight plane.\nClean the leg with three changes of iodine and alcohol. The iodine should remain on the leg for 30 sec.",
    "Adjust the animal or platform (Figure 2A, D) so that the extended leg ensures complete contact between the sole of the foot and the foot pedal.\nUsing medical tape, secure the foot of the animal against the foot plate (Figure 2D). It is crucial that the heel is flush against the bottom of the pedal and the entire foot is flat and will not dislodge from the plate during testing.\nLocate the clamping mechanism to stabilize the leg. Push the stabilizing pin in far enough to reduce movement of the leg and lock it in place by turning the Allen wrench.\nAt this position, use the knob C to move the apparatus either toward or away from the experimenter so that the ankle, tibia, and femur lie in a straight line (Figure 2C). Ensure that the leg is parallel with the foot pedal. Make adjustments on the course and fine knobs found on the back of the apparatus, to slowly move the ankle so the foot and tibia are at a 90° position.\nContinue to move the leg so the femur and Tibia are at a 90-degree perpendicular angle (Figure 2B). At this point, the animal is ready for the electrodes.\n4. Placement of the Electrodes\nActivate \"Instant Stim\" by clicking on the orange button labeled \"Instant Stim\".\nPlace both electrodes superficially on the proximal end of the tibialis anterior and move the electrode tips around until spikes are seen on the live monitor. Ideally, the spikes should be around 0.4 N.\n\tNOTE: The electrodes should be placed adjacent and orthogonal to the plane of peroneal nerve, which in turn, runs laterally from the knee and perpendicular to the tibia.",
    "Insert one needle far enough to pierce dermis, and barely into the muscular layer. Move the other electrode around until spikes are seen on the live monitor around 0.6 N. Insert needles and clamp them into place using a hobby clamp or medical tape.\nAdjust coarse and fine adjustments to find maximal force output.\nOn the high-power bi-phase stimulator, there will be two knobs in the center. One is labeled \"RANGE\" and the other \"ADJUST\". Turn the \"RANGE\" knob to desired maximum amperage.\n\tNOTE: The peaks will slowly increase in magnitude, and the maximum amperage is determined as the level at which three consecutive stimulations result in identical contractile responses. Resist turning the amperage higher than necessary; the maximum amperage will stimulate the entire muscle to contract, but any higher current will result in the recruitment of neighboring muscles and potentially antagonists as well.\nTurn the \"ADJUST\" knob to set the percentage of the \"RANGE\" that will be used to stimulate the muscle. At this point, force should read around 1.0 N. This may require an increase or decrease in current.\nRecheck the electrodes to make sure that they are secure. Stop Instant Stim.\nOn the \"Live Data\" window, click \"Start Sequence.\"\nContinue to monitor the curves by going back to the Control Screen, and clicking the \"Analysis\" button located above the orange \"Instant Stim\" button. The tetanic curve should begin to take shape around the 60 Hz stimulation.\n5. Finishing Stimulation and Clean Up\nAfter the sequence is finished, remove electrodes and wipe clean with 70% alcohol. Place the electrodes in the covers.",
    "Unfasten the knee clamp and turn off anesthesia. Remove the animal from the anesthesia gas and place the animal in the prone position, still on the heating pad. Maintain the rat on 100% O2 for a few minutes after the isoflurane gas has been turned off to keep the rat oxygenated. The animal may move initially, but do not return the animal back to the cage until the animal regains consciousness. If muscle soreness is noticed upon recovery, a dose of NSAID should be given as specified by your animal care committee. \nTurn off all of the equipment listed in step 1.2, close the software, and continue to data analysis.\nWipe down the platform and foot pedal.\n6. Data Analysis\nNOTE: Data analysis is performed to fit a sequence designed by this lab and according to lab protocols. Analysis values, data points of importance, and other aspects of the procedure will change depending on the intent of the user.\nOpen the data analysis software.\nClick on the High Throughput menu to enable analysis of multiple data files (samples) at a time. Select \"Force Frequency\" Analysis.\nClick on the \"Pick Files\" button and open as many saved data files as desired.\nSelect \"Manual\" in the Cursor Placement Method box.\n\tNOTE: This will allow the user to analyze all of the data within a desired timestamp, as opposed to the program automatically select the analysis location.\nChange the End Cursor timestamp value to 2. Click the \"Analyze\" button (Figure 1D).\nTo save the table and analyze the data using a spreadsheet, click on the \"Save Table to ACSII button. This will save the file, and it can be opened with a spreadsheet at a later time.\nOpen the saved data file in spreadsheet.",
    "Create an additional column labeled \"Absolute Maximum\", and determine the difference between the baseline and the maximum values for each sample. This will provide the total maximum force produced at each frequency.\nTo determine torque, multiply each force value by the length of the lever arm.\n\tNOTE: In this case, that would be represented by the foot length of the animal. This protocol uses the average experimentally determined value of 30 mm. The user has now determined the values for the maximum torque produced at each frequency.\nGraph these values as a torque frequency curve, or, the maximum torque produced by the animal across all stimulation frequencies.\n\tNOTE: This can be identified and used as a single point of comparison between samples."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}