{
  "id": 8615,
  "origin_website": "Jove",
  "title": "Wide-field Single-photon Optical Recording in Brain Slices Using Voltage-sensitive Dye",
  "procedures": [
    "All animal experiments were performed according to protocols approved by the Animal Care and Use Committee of Tokushima Bunri University. The following protocol for slice preparation is almost a standard procedure27 , but the modifications have been the protocols of staining and recording with VSD.\n1. Preparation Before the day of Experiment\nPrepare the stock A (Table 1), stock B (Table 2), and stock C (Table 3) solutions and store in a refrigerator.\nPrepare 1 L of artificial cerebrospinal fluid (ACSF) (Table 4, see step 3) and keep it in the refrigerator.\nPrepare 1 L of Modified ACSF (Table 5) and keep it in the refrigerator.\nDispense 500 µL aliquots of fetal bovine serum (FBS) in 2 mL vials and store in a freezer.\nDissolve 4% of agar powder in ACSF (ca. 120 mL) in a microwave and pour it in a 90 mm disposable Petri dish. The agar plate should be refrigerated before further use.\nPlace the following items in a freezer on the day before the experiment: a surgical tray, a slicer container and an aluminum cooling block (120 x 120 x 20 mm3).\nEnsure that there are sufficient Plexiglass rings with membrane filters for slice handling system17,28 (see step 6.12).\nDissolve 2% of agar powder in 50 mL of 3 M KCl in a microwave. Take around 85 µL of the warm agar-KCl dissolvent in 200 µL tips using a micropipette for the grounding electrode. Detach the tip into the still warm agar 3 M KCl gel. Repeat the step to fill about 20-40 tips with 2% agar.\n2. Preparation of VSD (di-4-ANEPPS) Stock Solution\nPrepare 1 mL of 10% polyethoxylated castor oil solution with ultra-pure water.",
    "Add 1 mL of ethanol to a vial of di-4-ANEPPS (5 mg vial), vortex and sonicate for 10 min. The solution will turn into a deep red color with possible small residues of the di-4-ANEPPS crystals.\nNOTE: The ethanol used in this step should be freshly opened.\nTransfer the solution to a 2 mL microtube with an O-ring. Spin down the solution and add 500 µL of 10% polyethoxylated castor oil solution.\nNOTE: The dye is highly lipophilic. DMSO and poloxamer can also be used to dissolve di-4-ANEPPS but in terms of the optical signal upon change in membrane potential, we found that the use of ethanol -polyethoxylated castor oil gives a better signal to noise ratio. This could be related to transfer rate of solvent to the cell membrane.\nVortex and sonicate until the dye has completely dissolved.\nAvoid exposure to light and keep it in a refrigerator. Do not store in a freezer. The stock can last for a few months.\nNOTE: On the day of the experiment, follow the steps 3-9.\n3. Daily Preparation of ACSF (1 L) (Table 4)\nWeigh NaCl, NaHCO3, and glucose in a flask.\nAdd 950 mL of distilled water to the flask and start bubbling with 95% O2/5% CO2 gas.\nAdd 2.5 mL of stock A solution to the flask and incubate for approximately 10 min at room temperature.\nAdd 2.5 mL of stock C solution to the flask.\nAdd distilled water to make the solution to 1 L.\n4. Daily Preparation of the Staining VSD Ssolution\nSonicate a 500 µL vial of FBS and VSD stock solution (step 2) in an ultra-sonicator for 5 min.\nAdd 500 µL of freshly prepared ACSF into the vial of FBS.",
    "Add 20 (in case of mice) or 40 (in case of rats) µL of VSD stock solution to the vial.\nUltra-sonicate and vortex the vial till the solution becomes pale orange.\n5. Preparation for Surgery\nTake 100 mL of chilled ACSF separately in a 300 mL stainless steel container, a 300 mL beaker, and a plastic container, and place them in a freezer. Pour 150 mL of chilled modified ACSF (Table 2) in another beaker and place it in the freezer. Wait till the solutions are chilled; the time taken should be measured and determined beforehand.\nFold to break a razor blade (carbon steel, industrial grade 0.13 mm thick, blade on both sides) into half for the slicer.\nNOTE: The other half can be used for dissection with a proper blade holder.\nPrepare a block from the ACSF 4% agar plate with an adjusting jig (Figure 1).\nPrepare a moist incubation chamber (an interface type chamber; a modified 1.2 L tight sealed box with a silicone packing) for keeping the brain slices physiologically alive (Figure 2); add ACSF in a small container and carbonate with 95% O2/5% CO2 gas, and fill a 90 mm x 20 mm Petri dish with ACSF in to the top.\nNOTE: A smaller Petri dish (60 mm x 20 mm) should be placed in the center of the 90 mm dish to support a filter paper on the dish.\nPut the box on a heating device and wait for 20 min to warm it up to 28 ˚C.",
    "Add crushed ice into the container of the slicer. Place the following instruments in a stainless-steel vat (small) on ice: scalpel, blade holder, ring tweezers, agar block, and a stage of slicer. Keep frozen ACSF and modified ACSF on ice and bubble with 95% O2/5% CO2 gas (aka. carbogen).\nPlace the following instruments in a vat (large): scissors (large, small), tweezers, a spatula, a spoon, and diagonal pliers.\n6. Surgery (Mice)\nAnesthetize the mouse using isoflurane in a fume hood. Assess the level of the anesthesia by checking the pedal reflex of the animal upon toe pinch.\nDecapitate the mouse and immerse the head in ice-cold ACSF in a stainless-steel surgical tray.\nExtract the brain within 1 min and place it in a beaker containing chilled ACSF for 5 min.\nTake the brain out of the beaker and, using a scalpel, trim the brain block (Figure 3A).\nPlace the brain block onto a 4% agar block (step 5.3, Figure 3B). Both hemispheres can be mounted on an agar block. Wipe the excess ACSF from the block with a filter paper.\nApply thin adhesive (super glue) to the slicer table. Place the agar block on it and wipe the excess adhesive using a filter paper.\nGently apply a small amount of ice-cold ACSF (~5 mL) using a pipette from the top of the brain-agar block. This will help solidify excess super glue and prevent the glue from covering the brain and disturbing the slicing.\nFix the slicer table to the slicer tray (Figure 3C) and pour the modified ACSF.\nSet the slicer to a slow speed, with the blade frequency at maximum.",
    "Set the slice thickness to 350-400 µm and start slicing (Figure 3C). Place the slices on the corner of the slice tray in a sequence, so that the depth of the slices can be easily distinguished. Usually three to five slices can be obtained from one hemisphere.\nCut off the brain stem portion using a 30 G needle (Figure 3D).\nNOTE: Microsurgery on the brain slice such as a cut between the CA3-CA1 border should be done at this stage under a binocular microscope, if necessary.\nUsing a small tipped paint brush, place the slice on the center of the membrane filter (0.45 µm pores, PTFE-membrane, 13 mm diameter) held with the Plexiglass ring17 (15 mm outer diameter, 11 mm inner diameter, 1 mm thickness, Figure 3E). Place the ring in the moist recovery chamber (Figure 2) and secure the cover to keep the inner pressure high.\nNOTE: The slices will stick to the membrane within 30 min and can be handled with the rings in the subsequent steps in the recording chamber. There is no need to use weights or other measures to keep the slice in place.\nAdjust the direction and position of the slice in the ring to ensure it is well centered and has a consistent direction (see step 9.3).\nLeave the specimen at 28 °C for 30 min, and then at room temperature for at least 10 to 30 min for the recovery of slices.\nNOTE: The slices can now retain good physiological condition at least for 15 h.\n7. Staining and Rinsing of the Slices (Mice)",
    "Gently apply 100-110 µL of the staining solution (Step 4) onto each slice on the ring using a micropipette. Eight to nine slices can be stained with one staining solution prepared in step 4. Leave the slices for 20 min for staining.\nPrepare 50-100 mL of ACSF in a container and put the ring with sliced specimen in it to rinse the staining solution.\nStore the rinsed slice to another incubation chamber. Wait more than 1 h for recovery before the experiment.\nNOTE: The incubation chamber can be detached from the gas and moved to the place of recording in a tight sealed condition. The slice can remain alive for at least 20 min without gas supply. This is useful in case you need to move the slice to another place for recording.\n8. Daily Preparation of Experimental Apparatus\nTurn on the amplifier, computer, and camera system, and check that the software is running.\nPlace ACSF in a 50 mL tube and bubble with carbogen.\nUse a peristaltic pump to circulate the ACSF. Adjust the flow rate to approximately 1 mL/min.\nAdjust the height of the suction pipette so that the liquid level inside the experiment chamber is always constant.\nNOTE: The level of the solution is important to obtain a stable recording, therefore, the adjustment should be done using a micromanipulator.\nInstall the ground electrode made up of yellow chip filled with 3 M KCl agar (2%) (step 1.8) into a holder with an Ag-AgCl wire with small amount of 3 M KCl solution.\nFill a small amount of ACSF (approximately two-third of the volume) into the glass electrode (1 mm outer diameter, 0.78 mm inner diameter pulled with a micropipette puller) using a tapered thin tubed yellow tip and place it in the electrode holder.",
    "Attach the holder to the rod installed in the manipulator. Ensure using an amplifier that the electrode resistance is approximately 1 MΩ.\nNOTE: The long-shank wide opening (4-8 µm opening) patch type electrode should be good for field recording and as a stimulating electrode.\n9. Starting a Recording Session\nTake a slice preparation from the moist chamber with forceps.\nQuickly place the slice onto an experimental chamber under the microscope (Figure 4).\nPush the edge of the ring firmly into the silicone O-ring. Be careful not to break the membrane or the bottom of the experiment chamber.\nNOTE: The direction of the slice should be taken into consideration with respect to the direction of the stimulating and recording electrodes in the field of view. The healthy slice should stick to the membrane filter so there is no need to use other devices to fix the slices such as weights and nylon meshes.\nPlace the tip of the stimulating electrode and the field potential recording electrode onto the slice under the microscope with transmitted light.\nUse the electrophysiological recording system to check the response. Confirm the usual (non-stained) electrophysiological recording with given configuration.\nNOTE: The recording electrode can be omitted but is useful to check the physiology of the slice.\nAdjust the excitation light intensity to approximately 70-80% of the maximum capacity at the camera that corresponds to 13-15 mW/cm2 at the specimen when sampling at 10 kHz with 5x water immersion objective lens and 1x PLAN APO tube lens. The excitation light wavelength is 530 nm, and the emission filter must be > 590 nm.",
    "NOTE: Use a shutter to minimize the amount of excitation light. Continuous light exposure may deteriorate the slice physiology. The possible harmful effect of the light depends on the intensity and duration of the light. Use electrophysiological recording to judge the effect of light. In case of the strength of 13-15 mW/cm2, about 1 s exposure should be the upper limit of the tolerance.\nAdjust the focus with the acquisition system using the fluorescent light source because the focus may be different depending on the wavelength and start the acquisition.\nExamine the data in an image acquisition software.\nNOTE: We used original microprogramming package of numerical analysis software for detailed analysis.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}