{
  "id": 19075,
  "origin_website": "Jove",
  "title": "Functional Assessment of Intestinal Motility and Gut Wall Inflammation in Rodents: Analyses in a Standardized Model of Intestinal Manipulation",
  "procedures": [
    "1. Animals\nMale C57Bl6/J mice with a mean weight of 25 g were obtained from Harlan Winkelmann (Borchen, Germany). All experiments were performed in accordance with the federal law regarding the protection of animals. The principles of laboratory animal care were followed. Animals were maintained on a 12-hr light/dark cycle and provided with commercially available rodent chow and tap water ad libitum. Animals should be housed at least 7 days after arrival in your animal facility before experiments. Note that all experiments can be easily adapted to rats or other species and with slight modifications into large animal models.\n2. Operative Procedure\nAnesthesia is induced and maintained with isoflurane (Abbott, Wiesbaden, Germany) in oxygen. After onset of anesthesia place animals in supine position and fix extremities with adhesive tape (Leukosilk, Beiersdorf, Hamburg, Germany).\nAfter shaving and surgical disinfection of the abdominal wall a median laparotomy is performed on a length of 2 centimeters. Enter the abdominal cavity via an incision along the Linea alba. Place two sterile retractors to keep the abdomen open. Carefully eventerate the small bowel to the left and place it on a wet cotton gauze.\nEvacuate the entire small bowel luminal contents with two moist and sterile cotton applicators (MaiMed, Neunkirchen, Germany) by simultaneously rolling the applicator from the pylorus to the cecum. CAUTION: Avoid hemorrhages of the small bowel wall or lesions of the gut vessels. Put the gut back into the peritoneal cavern without twisting to prevent ischemia or mechanical obstruction and close the abdominal incision using a two layer continuous 5/0 polyamid non-absorbable sutures (Ethicon, Norderstedt, Germany).\n3. Postoperative Care",
    "After the procedure place the animal under a heating lamp, observing it until it recovered from anesthesia. Put the mouse back in its cage and allow access to water and food. Due to the property of opioids to affect peristalsis, we perform perioperative analgesia with NSAIDs (for example metamizol) in drinking water.\n4. Functional Studies 24 hr after IM\nGastrointestinal Transit (GIT)\nAnaesthetize mice slightly with isoflurane in oxygen 22.5 hr after IM. Carefully hyperextend the head of the mouse and pull out the tongue with a blunt forceps. Fill a 1 ml syringe with at least 100 μl fluorescein-labeled dextran (FITC-dextran, 70,000 MW, Sigma Aldrich, Taufkirchen, Germany), connect it to an arterial catheter (Vygon, Ecouen, France) and carefully insert the catheter as a gastric tube into the stomach.\nBriefly inject 100 μl FITC-dextran and pull out the catheter. Let the animal awake and wait for 90 min. During this time mice have access to food or water.\nPrepare fifteen 2 ml spinning tubes and label them consecutively.\nEuthanize mice 90 min after gavage and remove the entire gastrointestinal tract from stomach to rectum. Place the intestine onto a polystyrene pad and avoid stretching. CAVE: It is crucial to remove the gut gently to avoid shifting of liquid FITC-dextrane into the nearby segment. For the beginning it might be helpful to use clips at the beginning and at the end of each segment.\nMeasure full length of small bowel and full length of colon. Divide the small bowel into 10 equal sized segments by pinning it down to the polystyrene pad with cannulas. Divide the colon into 3 segments. You have prepared 15 segments (stomach #1), ten equally sized small bowel segments (#2-11), cecum (#12) and three 3 equally sized colonic segments (#13-15).",
    "Transect the intestine at the marked positions, grab it with a forceps and flush them once with 1.0 ml KHB into the previously prepared KHB containing 2.0 ml tubes and vortex vigorously for 20 sec. The stomach and cecum are placed directly and cut in the prepared tubes. Fill these tubes with 1.0 ml KHB, thereby rinsing traces of luminal contents from the scissor into the tubes.\nCentrifuge the probes at 12,000 rcf for 5 min at room temperature in a table top centrifuge. During centrifugation prepare another 15 consecutively numbered 1.5 ml tubes.\nTransfer the clear supernatants into the new 1.5 ml tube and store in the dark at 4 °C until analysis (next step). The probes can be stored for several days at 4 °C without significant loss of FITC signal. For longer storage add 0.09% Natrium-azide or store at < -18 °C.\nPipette 100 μl duplets of the supernatants on a black 96-well plate (Greiner Bio One, Frickenhausen, Germany). Pipette two 100 μl samples of KHB as blank.\nRead the plate in a fluorescence reader (Safire, Tecan, Crailsheim, Germany) and quantify the fluorescence at 494 nm (absorption) / 521 nm (emission) wavelength. Subtract blank values from samples.\nCalculate the geometric center (GC) of FITC-dextran distribution, which is actually the center of gravity for the distribution of marker, by the following formula: GC = ∑ (% of total fluorescent signal per segment * segment number) / 100",
    "Note: By multiplying percentage of fluorescence of each segment with its segment number a weighted mean of the distribution of marker within the intestine is assessed. This point is influenced by both the distribution and distance traveled by marker, but assumes no specific underlying distribution.7 The calculated GC value is often presented in combination with a graph demonstrating the distribution of FITC dextran over the gastrointestinal tract (Figure 1A).\nColonic Transit\nMice should be weakly anaesthetized with isoflurane 2 % in oxygen. CAUTION: Ensure that the animal will awake within 40 sec.\nCarefully examine colonic patency by inserting a fistula probe (metal rod, 2 mm diameter) through the anus into the colon.\nUsing the fistula probe push forward a 2 mm glass ball 3 cm into the colon and pull out the probe immediately. Place the mouse in a transparent cage and start measuring the time after the fistula probe was pulled out of the colon. Keep an eye to the mouse and stop the time directly after the glass ball became excreted.\n5. Histochemical Analysis of Isolated ME Specimens\nMidjejunal segments are cut from the bowel and immersed in cold KHB in a Sylgard-filled dish.\nMesentery is pinned to the dish with 0.2 mm insect needles (Fine Science Tools, Heidelberg, Germany).\nCut open the segment along its mesenteric border and stretch to ~120 % of its length and width. Finalize the fixation with insect pins on opposite site of the mesentery. Rinse the sylgard dish carefully with fresh ice cold KHB, thereby flushing all luminal contents.\n\tME can now mechanically separated from the tunica mucosa starting from the mesentery. During preparation replace fresh chilled KHB several times.\nSeparated tunica mucosa can be shock frozen in liquid nitrogen for further analysis or discarded.",
    "Fix the isolated ME whole mount with 100 % ethanol for 10 min at room temperature.\n\tWash the whole mount three times using chilled KHB. Note: other fixatives (i.e. 4% formaldehyde, acetic acid, aceton) can also be used after testing its compatibility with the subsequent analysis.\nThe ME whole mounts are ready for further histochemical or immunhistochemical staining:\nHistochemistry: myeloperoxidase (MPO) staining\n\tInfiltrated PMNs can be examined by the following MPO staining protocol.\n\t\nSolve 10 mg Hanker Yates reagent (Polyscience Europe, Eppelheim, Germany) in 10 ml KHB and add 100 μl of 3% H2O2. Prepare the solution freshly immediately before use and do not reuse.\nIncubate whole mounts for 10 min at room temperature.\nRinse specimens extensively with cold KHB and incubate for 10 min.\nMount specimens in aqueous mounting medium (Aquatek, Merck, Darmstadt, Germany) After drying for 2 hr analyze slides at under a light microscope.\nCount numbers of cells in 5 randomly chosen fields and calculate as MPO positive cells / mm2.\nImmunohistochemical Staining:\n\tAccordingly to the histochemical MPO staining, immunohistochemical stainings of the whole mounts can be performed. Principally, your established immunohistochemical staining protocols of cell cultures or tissue slices can be easily adapted to a whole mount staining. However, optimizing the procedure for specific antibodies is strongly recommend.\n\t\nCut specimens into 5 x 5 mm pieces and perform staining in 2.0 ml round bottom centrifuge tubes in ~150 μl - 200 μl antibody solution.\nFixation and blocking procedure (i.e. 3% BSA in PBS for 1 hr at room temperature) can be performed in the \"sylgard dish\".\nWashing steps in PBS or other buffers can be performed in 12-well plates.\nTransfer the .specimens carefully with a sharp forceps between staining tubes and washing plates.",
    "After the final washing procedure mount specimens in anti-fading mounting medium with cover slips and analyze with a fluorescent microscope.\n6. Organ Culture of ME\nThe whole small intestine is resected 24 hr after IM and placed in cold KHB containing 200 U/ml penicillin G and 100 μg/ml streptomycin (KHB + P/S).\nCut the gut into 3 cm lengths and pin each segment down to a Sylgard containing glass dish.\nRemove the mesentery with fine scissors and slip the intestine on a knitting needle.\nGently incise the ME with a sharp forceps and strip it off from the submucosa using a moist cotton applicator. The tunica mucosa remains on the knitting needle and can be snap frozen for further investigation. The ME is collected in cold KHB + P/S.\nCut the isolated ME strips into small pieces of 2 - 4 mm length and incubate it in ice cold KHB + P/S for half an hour and rinse the specimen several times.\nTransfer approximately 50-60 mg ME (at least half ME of one small bowel) in a sterile 24-well plate containing 500 μl Dulbecco s modified Eagle medium (DMEM).\nIncubate at 37 °C and 5 % CO2 for additional 24 hr.\nInspect the cell cultures for bacterial or fungal contamination under a microscope.\nCollect supernatant, spin down for 5 min at 1,000 rcf and snap freeze in liquid nitrogen. Meanwhile blot dry the muscle tissue on a clean tissue for 30 sec and weight.\nSupernatants can be used for subsequent analysis of released cytokines (IL-6) by ELISA or other metabolites (i.e. nitrite) in the supernatant by following manufactures instructions.\nNormalize measured concentrations per weight of ME tissue.\n7. Representative Results\nFunctional Studies",
    "The most important parameter to evaluate the severity of POI is the examination of GIT in vivo. Figure 1A demonstrates a typical distribution of FITC dextran along the gastrointestinal tract in untreated controls and intestinally manipulated mice 24 hr after surgery. \"Sham operated\" animals showed a normal GIT with a calculated geometric center (GC) in the cecum while IM led to a significant delay of GIT in the proximal jejunum (Figure 1B)\n\tColonic motility was separately focused on by measurement of the ball excretion time of a 2 mm glass ball. Sham operated mice show an excretion time of 48 - 200 sec while IM led to a prolonged excretion time between 470 - 775 sec (Figure 1C).\nMorphological Studies\n\tTo describe the inflammatory extend within the ME several phenotypes of leukocytes could be analyzed using histochemistry or immunohistochemistry. In figure 2A+B a low presence of PMNs in \"sham operated\" animals was observed (39±7 cells/mm2). IM of the small bowel led to a strong PMN infiltration (660±86 cells/mm2) compared with sham operated mice\nME Organ Culture\n\tMany inflammatory mediators liberated from cells are difficult to detect in tissue lysates. Organ cultures allow detection of liberated mediators in the culture supernatant. A representative mediator in POI is NO, which is as major inhibitory neurotransmitter in the gastrointestinal tract.5\nNO could not be detected in ME organ culture supernatants of unoperated control animals (5±6 μM/ 24 hr /mg tissue). In sham operated (laparotomy) mice basal NO levels of 53±36 μM/ 24 hr /mg tissue were observed. ME cultures of intestinally manipulated (harvested 24 hr after surgery) mice produce significantly more NO (2254±853 μM/ 24 hr /mg tissue) during 24 hr ME organ culture (Figure 3).\nimgsrc://cloudfront.jove.com/files/ftp_upload/4086/4086fig1.jpg",
    "Figure 1.  Effect of IM on GIT (A+B) and colonic transit (C) GIT was measured as the percent of non-absorbable fluorescein-labeled dextran in 15 gastrointestinal segments-stomach (Sto), small intestine (SI 1-9), cecum (Cec), and colon (Co)-90 min after oral ingestion. Colonic transit was measured as the time from pulling out the fistula probe until excretion of a 2 mm glass bead. (A)Gastrointestinal distribution of fluorescein isothiocyanate- dextran after sham operation or IM. In sham operated animals most of the marker is located in the cecum or the proximal colon compared with proximal jejunal location in manipulated animals. Dotted lines indicate calculated GC. (B) Calculation of the GC demonstrated a prolonged gastrointestinal transit time after IM. (C) Colonic transit time showed a significant delay in IM mice compared with sham operated animals. GC for the 15 intestinal segments are displayed as mean (n=5). Colonic transit times were displayed mean with all individual values (n=6). *** = p<0.001, Student's t-test.\nimgsrc://cloudfront.jove.com/files/ftp_upload/4086/4086fig2.jpg\nFigure 2.  Detection of MPO positive cells within small bowel ME.(A) ME whole mounts were stained with Hanker Yates reagent for detection of MPO positive PMN 24 hr after laparotomy (sham) or IM procedure. (B) Quantification of MPO positive cell within 5 randomly chosen fields per mouse. n= 6 animals per group. *** = p<0.001, Student's t-test.\nimgsrc://cloudfront.jove.com/files/ftp_upload/4086/4086fig3.jpg",
    "Figure 3.  NO production in culture supernatants of ME. Muscle specimens from unoperated controls, sham operated and IM mice were taken 24 hr postoperatively and cultured for 24 hr. Untreated mice showed only a very low basal production of NO. After laparotomy NO liberation is increased without measuring significant differences between the control group and sham operated mice. 24 hr after IM NO production is dramatically increased compared with untreated or sham operated mice. n= 5 animals per group. *** = p<0.001, 1 way ANOVA.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}