{
  "id": 17227,
  "origin_website": "Jove",
  "title": "Intubation, Central Venous Catheter, and Arterial Line Placement in Swine for Translational Research in Abdominal Transplantation Surgery",
  "procedures": [
    "All animals used for this study received humane care in accordance with the \"Principles of Laboratory Animal Care\" formulated by the National Society for Medical Research and the \"Guide for the Care of Laboratory Animals\" published by the National Institutes of Health, Ontario, Canada. All studies were approved by the Animal Care Committee of the Toronto General Research Institute. In this study, 11-12-week-old male Yorkshire pigs weighing 30-40 kg were used.\n1. Intubation\nHouse the pigs for at least 5 days before the procedure to allow them to adjust to the environment and reduce overall stress levels\nFast the pig for 6 h before anesthesia.\nAnesthetize the pig with an intramuscular (IM) injection of ketamine (20 mg/kg) as a dissociative anesthetic, midazolam (0.15 mg/kg) for sedation, and atropine (0.04 mg/kg) to reduce salivation and bronchial secretions, in the housing facility.\nGive O2 and isoflurane at 5% with the help of a mask once the pig has fallen asleep for at least 5 min.\nMove the pig into a transportation cart and transfer to the operating room (OR).\nPlace the pig in a supine position on the OR table.\nPlace the ventilation mask with 2 L/min O2 and 5% isoflurane.\n\tNOTE: Make sure the pig has inspiratory effort.\nPosition the oxygen saturation probe on the pigs' ear.\n\tNOTE: The probe can also be placed on the tongue, tail, dewclaw3, lips, or inguinal fold.\nAsk an assistant to place the electrocardiogram electrodes and blood pressure cuff.\n\tNOTE: Electrodes are placed in the right axillary fold, left axillary fold, and left inguinal fold. The blood pressure cuff can be placed either in the foreleg or hindleg.\nCheck for relaxation of the jaw after 4-5 min of ventilation with isoflurane at 5%.",
    "NOTE: if resistance is noted, continue ventilation with isoflurane for an additional 3 min or until the jaw is relaxed.\nAsk the assistant to hold the mandible up, maxilla down, and tongue out of the way.\nInsert a laryngoscope with a straight miller blade down the midline and lift the epiglottis.\n\tNOTE: Use an endotracheal tube to push down the soft palate and allow the epiglottis to pop up (Figure 1).\nVisualize the vocal cords and spray them two times with lidocaine non-aerosol spray (10 mg/metered dose) to prevent spasms during intubation.\nRemove the laryngoscope and replace the oxygen mask for 30 s.\nRemove the oxygen mask, insert the Miller straight blade down the midline, and lift the epiglottis. Insert a 7.0 mm endotracheal tube beyond the vocal cords.\n\tNOTE: If there is resistance or spasm of the vocal cords, repeat steps 1.13 and 1.14.\nHold the endotracheal tube in place and slide out the laryngoscope and stylet.\nInflate the endotracheal tube cuff with 5-8 cc of air and connect it to a capnometry sensor to ensure the correct placement of the tube.\n\tNOTE: Other methods to ensure proper placement include looking for chest drives, condensation in the endotracheal tube, and listening to bilateral breath sounds.\nTurn on the ventilator and adjust to 15-20 breaths per minute, isoflurane to 2%-2.5%, tidal volume to 10-15 mL/kg of bodyweight, and peak inspiratory pressure between 18-20 cmH2O9,10,11.\nFix the endotracheal tube with tape.\nApply eye lube to prevent dryness and ulceration during the procedure.\nEnsure proper anesthetization by assessing the jaw tone and adjusting isoflurane accordingly. Rigid mandibular muscles indicate a light level of anesthesia3.\n2. Central venous catheter placement",
    "NOTE: The choice of catheter depends on the type of model being used. For survival models, a catheter that can be tunneled at the end of the procedure is used. For terminal models, a simpler model (refer to Table of Materials) is used.\nAfter intubation, with the pig in the supine position, disinfect both sides of the neck with either iodine or chlorhexidine solution.\nPrepare the catheter by flushing it with 5 to 10 mL of saline and ensure it does not have air inside. Place the dilator through the catheter.\nInspect and test the guidewire to confirm proper aspects and function.\n\tNOTE: The guidewire must move freely inside the sheath and must not have any defects or kinks. If any alteration is noted, replace the guidewire.\nIdentify the following three landmarks on the pig's neck: (1) the caudal ramus of the mandible, (2) the cranial manubrium, and (3) the cranial point of the right shoulder formed by the greater tubercle of the humerus6 (Figure 2).\nInsert the finder needle attached to a 5 mL syringe in the center of the triangle formed by the three landmarks at a 45° angle from the skin and directed toward the caudal side, while slightly pulling back on the syringe embolus.\nOnce the jugular vein is found, remove the syringe from the finder needle and stabilize the needle while placing the thumb over the needle hub. Ensure the finder needle is secured in place.\n\tNOTE: If blood coming from the needle is suspected to be arterial, remove the needle immediately and apply pressure for 5 min.\nFeed the guidewire into the finder needle and advance into the external jugular vein (Seldinger's technique12). Minimal to no resistance should be met. Remove the finder needle and keep the guidewire in place.",
    "NOTE: Use an ECG trace to make sure the guidewire does not go in too deep. If alterations in cardiac rhythm are noted, remove the guidewire slightly.\nInsert the tip of an 11-blade into the puncture site and create an incision (around 0.5 cm) for the dilator and catheter.\nFeed the dilator and catheter over the guidewire to dilate the skin and the subcutaneous tissue. Once in place, remove the dilator from the catheter.\nAspirate from the catheter lumen to ensure proper flow and flush with 5-10 mL of saline.\nSuture the catheter into the skin with a 0 silk suture and ensure the catheter is secure13.\n3. Arterial line placement\nNOTE: Carotid placement of the arterial line is preferred since it provides a more direct route to the heart, and the vessels of the neck are larger than the femoral vessels11. Preferably, the arterial line should be placed on the contralateral side of the central venous catheter and under direct vision; if this is not possible, it can be placed on the same side as the venous catheter.\nMake a vertical incision of 5-7 cm medial to the trachea using a cautery pen (Figure 3).\nDissect the subcutaneous tissue and the plane between the cutaneous facii and colli muscles11.\nDissect the facial plane between the trachea and the sternomastoideus muscle to localize and open the carotid sheath11 (Figure 4).\nUse blunt dissection to isolate the common carotid artery (Figure 5).\nPlace two 2-0 silk ties around the carotid artery for vascular control and tie the distal one (Figure 6).\nPlace the right angle forceps under the artery.",
    "Ask the assistant to hold the proximal tie and insert the angiocath needle tip into the carotid artery at a 45° angle. Once a flash of blood is seen, advance the needle slightly at a shallow angle and then advance the catheter only into the artery.\nRemove the needle while keeping the catheter in place.\nAttach the catheter to the arterial line, aspirate, and flush with 5-10 mL of saline to ensure there is no resistance.\nPlace a tie around the catheter and artery to secure the catheter.\n4. After surgery care (survival model)\nTunnel the venous line catheter and fix it to the neck of the pig.\nOnce the animal is hemodynamically stable and can be weaned off vasopressors, remove the arterial line catheter, tie the distal side of the carotid artery, and verify hemostasis. Close the wound with an uninterrupted suture.\nMove the pig to the transportation cart and position it in a sternal position.\nTurn off isoflurane and monitor the pig until signs of anesthesia recovery are present (movements and breathing against the ventilator).\nTurn off the ventilator once effective spontaneous respirations are noted, but keep the O2 supply at 2 L/min.\nTurn off the O2 supply after 10-15 min. The pig should be able to maintain a saturation of at least 94% on its own. If that is not the case, turn on the O2 again and reassess in another 5-10 min.\nMove the pig back to its pen once it maintains O2 saturation.\n\tNOTE: The pig should be moved back to its pen with the endotracheal tube in place.\nRemove the endotracheal tube once signs of swallowing and/or chewing are evident (between 2-4 h after the end of surgery).",
    "Monitor the pig in its pen and never leave it alone. Once the pig is extubated and can maintain a sternal position, it can be left unattended.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}