{
  "id": 12179,
  "origin_website": "Jove",
  "title": "High-sensitivity Detection of Micrometastases Generated by GFP Lentivirus-transduced Organoids Cultured from a Patient-derived Colon Tumor",
  "procedures": [
    "The patient provided written informed consent and the project was approved by the Research Ethics Committee of the Juntendo University Faculty of Medicine. The mouse experiments were also approved by the Animal Research Ethics Committee of the Juntendo Faculty of Medicine.\n1. Establishment of CRC PDXs in Immunodeficient Mice\nExperimental procedures for establishing CRC PDXs (step 1) are outlined in Figure 1A.\nPrepare the primary CRC tissue immediately after surgical resection of the tumor from the patient.\nWash the primary CRC tissue by gentle agitation several times in 30 mL of ice-cold sterile phosphate buffered saline (PBS) in a 50 mL conical tube and keep it on ice.\nPlace the tissue on a 10 cm Petri dish using sterile tweezers, remove the necrotic areas as extensively as possible using sterile scissors and cut the solid tumor tissues to small pieces (5 x 5 x 5 mm3 in size) using sterile razor blades.\n\tNOTE: Necrotic areas are often whiter, softer and more friable than the surrounding areas.\nPlace the small pieces of tumor using sterile tweezers in 2 mL of ice-cold sterile PBS on a 6-well plate.\nBreed 6 week-old NOD/Shi-scid IL2Rγ null (NOG) highly immunodeficient mice under germ-free and specific pathogen-free conditions.\nAnesthetize the mice with isoflurane inhalation using the small animal inhalation anesthesia device and disinfect the skin with 70% ethanol. Assure the normal rate and depth of respiration and the absence of a toe pinch reflex for proper anesthetization. Vet ointment on the eyes is an option, to prevent ocular dryness while under anesthesia.\nSterilize all surgical tools using dry heat sterilization and then use these tools for all procedures to prevent wound infections in recipient mice.",
    "Place the anesthetized mouse in a prone position on the laboratory bench. Make a small incision on the lower parts of the right and left flanks of the recipient mouse to generate subcutaneous pockets for tissue implantation using sterile scissors. Take care not to puncture the peritoneal membrane. There should be little bleeding with this procedure.\nGently dip the above prepared tumor fragments into 50 µL of artificial extracellular matrix and then implant them into the lower parts of the right and left subcutaneous pockets.\nSuture the incision with wound clips in the mice undergoing surgical procedures. Make sure that the implanted tumor tissues are located at some distance from the incision under the skin.\n\tNOTE: In accordance with minimizing surgical procedures, no treatments for post-surgical pain and infection were administered in this study.\nPlace the mouse on a warm pad and maintain the sternal recumbent position until sufficient consciousness is restored. Once fully recovered and able to sit up on all four legs, the mice can be returned to their home cages. To prevent predation, do not allow breeding with non-operated animals in the same cage.\nCheck for suture leakage and confirm that the mice are in stable condition the next day, in the surgically treated group. Check the mice for signs of illness and measure the tumor size in each mouse, once a week, employing calipers.\n2. Dissection of CRC PDXs from Mice\nExperimental procedures for dissection of CRC PDXs (step 2) are outlined in Figure 1B.\nAllow the tumor to grow subcutaneously to ~1 cm3 in size, which usually takes approximately 1–3 months.\nAnesthetize the mouse with isoflurane inhalation using the small animal inhalation anesthesia device and disinfect the skin with 70% ethanol.",
    "Place the mouse in a prone position on the laboratory bench. Incise the skin, expose the tumor and carefully detach the skin from the tumor using sterile scissors. After removing the tumor, place it on a 10 cm Petri dish and remove any grossly necrotic regions from the tumor, then rinse twice with 5 mL of PBS.\n\tNOTE: Necrotic areas are often whiter, softer and more friable than the surrounding areas.\nPlace the tumor on ice and divide it equally into at least 4 parts for different applications including 1) the CRC organoid culture, 2) transplantation into secondary mice, 3) histological examination and 4) freezing and storage of the tumor fragments.\nFor generation of the CRC organoids, place the solid tumor tissue on a 6 cm petri dish containing 1 mL of sterile PBS. Keep the tissue on ice until processing (step 3).\nTo establish the PDX model for human CRC, passage the fresh CRC PDXs into a secondary mouse. Cut the tumor tissue into small pieces (5 x 5 x 5 mm3 in size) using sterile razor blades and gently dip these tissue fragments into 50 µL of artificial extracellular matrix. Then, implant these fragments into the lower parts of the right and left subcutaneous pockets of the NOG mouse, as described in step 1.8–1.11.\nFor histological analysis, fix the samples in 5 mL of 10% neutral buffered formalin in a 15 mL conical tube at room temperature for 2 days.\nFor cryopreservation, cut the tumor tissue into small pieces (5 x 5 x 5 mm3 in size) and gently dip the samples into 500 µL of cell freezing solution in 1–1.5 mL cryovial tubes. Then, transfer the tube to a -80 °C freezer.\n3. Extraction of PDXs into the Cell Suspension for the CRC Organoid Culture",
    "Experimental procedures for dissociation of CRC PDXs (step 3) are outlined in Figure 1B.\nPlace the above (step 2.4.1) prepared tumor fragments on a 10 cm Petri dish.\nMince the fragments using sterile razor blades and transfer them into a 15 mL conical tube containing 8 mL of 10% fetal calf serum (FCS)-Dulbecco's Modified Eagle's Medium (DMEM) with 80 µL of collagenase enzyme stock (see Table of Materials).\nClose the tube tightly and wrap the cap with parafilm to prevent leakage. To dissociate the minced tumor fragments into the cell suspension, agitate it gently for 2 h at 37 °C. Note that there will still be many fragments of undigested tissue remaining in the tube.\nCentrifuge the tube at 300 x g for 5 min at 4 °C and remove the supernatant. Resolve the cell pellet using 10 mL of 10% FCS-DMEM to make the cell suspension.\nTo eliminate undigested tissue debris, filter the cell suspension twice using the 40 µm cell strainer set on a 50 mL conical tube. Then, centrifuge the flow-through at 300 x g for 5 min at 4 °C. Remove the supernatant and keep the pellet on ice.\n4. Generation of the CRC Organoids Cultured on Artificial Extracellular Matrix\nExperimental procedures for the CRC organoid culture of the colon PDXs (step 4) are outlined in Figure 1B.\nEstablish a culture medium suitable for the PDX-derived CRC organoids (see Table of Materials, “the CRC organoid culture medium”) employing media previously described for human colon organoids11.\nApply 150 µL of artificial extracellular matrix (see Table of Materials) per well on a 12-well plate on ice and then incubate it for 30-60 min in a 37 °C, 5% CO2 incubator to solidify the gels.",
    "Suspend the cell pellet from step 3.5 with the CRC organoid culture medium (from step 4.1) with 5% FCS to achieve adjustment to 3 x 105 cells/mL. Then, seed 1 mL of the medium onto the artificial extracellular matrix-coated plate prepared in step 4.2. and incubate overnight at 37 °C under 5% CO2. Use a hemocytometer for counting the number of tumor cells including single cells and multicellular clusters (a group of adherent cells) in the cell suspension.\n\tNOTE: 5% FCS is used to quench the residual enzymatic activity of collagenase in this study.\nCarefully collect the culture medium, including floating cells that have detached from the artificial extracellular matrix-coated plate, into a 1.5 mL centrifuge tube on the following day and centrifuge it at 1,400 x g for 5 min. Then, remove the supernatant and re-suspend the pellet in 70 µL of artificial extracellular matrix on ice.\nTo increase CRC cell viability, overlay the tumor cell-containing artificial extracellular matrix onto the tumor organoid cells attached to the artificial extracellular matrix-coated plate and incubate for 30 min in a 37 °C, 5% CO2 incubator to solidify the artificial extracellular matrix coating. Then, incubate it with 1 mL of the CRC organoid cell culture medium with 1% FCS at 37 °C under 5% CO2.\nChange the culture medium every second day. As the CRC organoids fill the medium, it may become necessary to change the medium daily.\n5. Generation and Enrichment of GFP Lentiviral Particles\nExperimental procedures for generation and enrichment of GFP lentiviral particles (step 5) are outlined in Figure 1C.\nCulture HEK293T cells with Roswell Park Memorial Institute (RPMI) 1640 medium containing 10% FCS and prepare six 10 cm dishes (2 x 106 cells per dish) for the following transfection procedure.",
    "For transfection per dish, prepare 500 µL of the mixture including 20 µL of the transfection reagent in DMEM with a PRRL-GFP vector (5 µg)12 and two lentiviral packaging plasmids, such as pCMV-VSV-G (1 µg) and pCMV-dR8.2 dvpr (5 µg), in a sterile 1.5 mL microtube. Keep the mixture at room temperature for 20 min and then overlay it onto each of the 10-cm dishes and incubate them for 18 h.\nRemove the medium, add 5 mL of fresh 10% FCS-RPMI 1640 medium to each dish, and leave standing for 24 h.\nCollect the conditioned medium from each dish into a 50 mL centrifuge tube and store a total of 30 mL of the medium at 4 °C overnight. Add 5 mL of the fresh RPMI 1640 onto each dish and leave standing for 24 h.\nCollect the conditioned medium from each dish into a 50 mL centrifuge tube and keep, in total, 30 mL of the medium on ice. Then, discard the cells.\nFilter 60 mL of the medium (from step 5.4–5.5) through a 0.45 µm filter to remove the cells and divide this quantity into twelve 5 mL polypropylene centrifuge tubes for ultracentrifugation.\nTo concentrate virus, centrifuge them using a swinging bucket rotor (see Table of Materials) at 85,327 x g for 1.5 h at 4 °C.\nImmediately remove the medium. To resolve the concentrated virus pellet, place 250 µL of Nutrient Ham's Mixture F-12 (F12)/DMEM medium without FCS in each of the twelve tubes and maintain it at 4 °C overnight. Note that the virus pellet is often invisible.",
    "Gently pipette the medium to collect 3 mL of the concentrated 5x GFP lentivirus stock, in total, presumably including GFP lentiviral particles with 108 transducing units per mL (TU/mL). Then, store the twelve 1.5 mL microtubes (including 250 µL per tube) under sterile conditions at -80 °C for up to a year. Prepare many small aliquots of the original solution to avoid multiple freeze-thaw cycles.\n6. Labelling of CRC Organoid Cells with GFP Lentiviral Particles Cultured on Artificial Extracellular Matrix\nExperimental procedures for labelling the CRC organoid cells with GFP lentivirus (step 6) are outlined in Figure 1C.\nAllow the CRC organoids prepared in step 4.6 to grow without interference for 7–10 days and harvest them mechanically using a sterile cell scraper and then transfer them into a 1.5 mL microtube.\n\tNOTE: The growth of CRC organoids in culture depends on the nature of the original tumors from patients. Avoid overgrowth of the CRC organoids, by maintaining them at 60–70% confluence prior to transfer at a 1:2 split ratio onto a new artificial extracellular matrix-coated 12-well plate.\nCentrifuge the microtube for 3 min at 1,400 x g, remove the culture medium and resolve the cell pellet in 500 µL of PBS by gentle tapping.\nCentrifuge the microtube for 3 min at 1,400 x g and eliminate PBS.\nTo dissociate the adherent CRC organoids, add 500 µL of a cell detachment solution of proteolytic and collagenolytic enzymes to the cell pellet in the tube and mix it by gentle tapping. Then, leave the tubes to settle for 10 min at room temperature.",
    "Very gently pipette the cell suspension with an additional 500 µL of 1% FCS-DMEM several times in a 1.5 mL microtube to roughly dissociate the cells. Generation of single cells from the CRC organoids by harsh pipetting markedly reduces cell viability. Thus, it is essential to leave the mass of cells visually detectable in the cell suspension by very gently pipetting in a 1.5 mL microtube.\nCentrifuge the cell suspension for 3 min at 1,400 x g and remove the supernatant.\nResolve the cell pellet with a mixture of the 100 µL of 5x GFP lentivirus stock (>108 TU/mL) and 400 µL of the CRC organoid culture medium in a 1.5 mL microtube by gentle tapping to adjust to a concentration of 5 x 105 dissociated tumor cells per 500 µL. Use a hemocytometer for counting the number of tumor cells, including single cells and groups of cells in the cell suspension, as described above (step 4.3).\nPrepare an artificial extracellular matrix-coated 12-well plate, as described in step 4.2. Then, place 500 µL of the cell suspension prepared in step 6.7 on the plate and leave it for 18 h at 37 °C under 5% CO2.\nCollect the medium with the floating cells detached from the artificial extracellular matrix-coated plate into a 1.5 mL centrifugation tube. Centrifuge it at 1,400 x g and then remove the supernatant and re-suspend the pellet in 70 µL of artificial extracellular matrix on ice.",
    "To increase CRC cell viability, overlay the tumor cell-containing artificial extracellular matrix onto the tumor organoids attached to the artificial extracellular matrix-coated 12-well plate, as described in step 4.5. Next, incubate the plate for 30 min in a 37 °C, 5% CO2 incubator to solidify the artificial extracellular matrix coating and then culture it with 1 mL of the CRC organoid culture medium with 1% FCS at 37 °C under 5% CO2.\nObserve the cells at 3 days after infection under a fluorescence microscope to confirm nearly 100% GFP positivity due to the use of a high titer of lentiviral particles (see Figure 2A).\nCulture the CRC organoids for periods of 7–10 days to expand cell growth prior to injection into recipient mice.\n7. Generation of Metastases by GFP-labeled CRC Organoids in Recipient Mice\nExperimental procedures for generation of metastases using the GFP-labelled CRC organoids (step 7) are outlined in Figure 1C.\nTo dissociate the GFP-labeled CRC organoids into the cell suspension, harvest them mechanically using a sterile cell scraper and transfer them into a 1.5 mL microtube, as described above (step 6.1).\nCentrifuge the microtube for 3 min at 1,400 x g, remove the culture medium, and resolve the cell pellet in 500 µL of PBS by gentle tapping.\nCentrifuge the microtube for 3 min at 1,400 x g and eliminate PBS.\nOverlay 500 µL of the cell detachment solution onto the cell pellet in the tube and mix it by gentle tapping. Then, leave the mixture standing for 10 min at room temperature to enzymatically dissociate the adherent CRC organoids, as described above (step 6.4).",
    "Very gently pipette the cell suspension with an additional 500 µL of 1% FCS-DMEM several times in a 1.5 mL microtube to roughly dissociate the cells, as described above (step 6.5). Generation of single cells from the CRC organoids by harsh pipetting markedly reduces cell viability. Thus, leave the mass of cells visually detectable in the cell suspension by very gently pipetting in a 1.5 mL microtube.\nCentrifuge the cell suspension for 3 min at 1,400 x g and remove the supernatant.\nTo establish a spontaneous metastasis mouse model of CRC PDXs:\nPrepare a cell suspension including 5 x 105 cells in 50 µL of PBS with 50% artificial extracellular matrix per mouse. Maintain the suspension on ice before use. Use a hemocytometer for counting the cancer cells, as indicated in step 4.3.\nAnesthetize a mouse with isoflurane inhalation using the small animal inhalation anesthesia device and disinfect the skin with 70% ethanol, as indicated in step 1.6.\nPlace the NOG mouse in a supine position on the laboratory bench. Grasp the rectal mucosa with sterile tweezers and gently pull it out of the anus. Then, immediately inject the cell suspension prepared in step 7.7.1 into the rectal submucosa of the mouse using a syringe (needle size: 22 G). Routinely, 4–6 mice per group are used to evaluate the results.\nTo establish an experimental metastasis model of CRC PDXs:\nPrepare a CRC organoid cell suspension including 4 x 104 cells in 50 µL of PBS per mouse. Maintain the suspension on ice before use. Use a hemocytometer for counting the cancer cells (step 4.3).\nAnesthetize a mouse with isoflurane inhalation using the small animal inhalation anesthesia device and disinfect the skin with 70% ethanol, as indicated in step 1.6.",
    "Place the anesthetized NOG mouse in a prone position on the laboratory bench. Make a small incision on the lower part of the left flank and then cut the peritoneum to carefully expose the spleen using sterile scissors and tweezers. Grasp the fat tissue attached to the spleen with sterile tweezers, then slowly inject 50 µL of the cell suspension (prepared as above, step 8.1) into the spleen. Be certain that the cell suspension is injected appropriately without outward leakage, from the spleen. Routinely, 4 mice per group are used to evaluate the results.\nPlace all mice on a warm pad after surgery and maintain in a sternal recumbent position until sufficient consciousness is restored, as described in step 1.11. Once the mice have fully recovered, return them to their home cages. To prevent predation, do not allow breeding with non-operated animals in the same cage.\nCheck for suture leakage and confirm that the mice are alive, in the surgically treated group, the next day. Check the mice for signs of illness and measure tumor sizes, employing calipers, in all mice once a week.\nObserve mice to detect spontaneous metastasis (for periods of up to 2.5 months) and experimental metastasis (1 month) after injection.\nSacrifice the mice via anesthesia and cervical dislocation on the indicated days. Dissect primary tumors and various tissues including the liver and lungs. Place the dissected tumors and organs in 5 mL of ice-cold PBS on a 10 cm Petri dish and store them on ice.\nTo detect GFP-positive CRC organoid cells, observe the dissected tissues under a stereo-fluorescence microscope. Acquire images with a CCD camera and prepare using standard image-processing software.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}