{
  "id": 8255,
  "origin_website": "Bio",
  "title": "[<sup>3</sup>H]-Spiperone Saturation Binding to Dopamine D<sub>2</sub>, D<sub>3</sub> and D<sub>4</sub> Receptors",
  "procedures": [
    "Before the assay   Prepare assay and wash buffer.    With some receptor sources PEI-pretreated filterplates may improve the TB/SB ratio: Prepare 0.1% PEI solution and pipet 100 μl/filter on the filterplate, subsequently place in refrigerator (4 °C) for at least 2 hours.    The experiment is performed in 96 well plates (polysterene) with a total assay volume of 1,000 μl (450 μl assay buffer + 200 μl radioligand + 200 μl of assay buffer or 5 μM (+)-butaclamol + 150 μl membrane preparation).    Prepare NSB solution.   Prepare radioligand solutions.    Membrane preparation. Prepare receptor-containing membrane suspension according to preparation protocol. Re-homogenize suspension in small volume (< 2 ml) using short burst of Ultra-Turrax. Dilute to desired protein concentration and to yield a total volume of about 4 ml per 24 data point experiment. The protein concentration of the membrane suspension should be chosen so that a robust specific binding signal is obtained but at the same time total binding should be < 10% (even better < 5%) of free radioligand concentration. Protein content can be assayed by a variety of essays, e.g. Bradford (1976). Prepare the membrane suspension initially in ice.   Pre warm all solutions for 15 min in 25 °C water bath.    Final preparation (Table 1), add components to wells in following order:   450 μl assay buffer.   200 μl assay buffer (TB) or 200 μl 5 μM butaclamol (NSB).    150 μl membrane suspension.   Start reaction by adding 200 μl radioligand.  Table 1. Pipetting scheme for sample on microtiter plate table:\n﻿0,1,2,3,4,5,6,7,8,9,10,11\nT1,T1,T2,T2,T3,T3,T4,T4,T5,T5,T6,T6\n,,,,,,,,,,,\nTB1,TB1,TB2,TB2,TB3,TB3,TB4,TB4,TB5,TB5,TB6,TB6\nNSB1,NSB1,NSB2,NSB2,NSB3,NSB3,NSB4,NSB4,NSB5,NSB5,NSB6,NSB6",
    "During the assay   Incubate for 120 min at 25 °C in water bath.   Terminate reaction by rapid vacuum filtration over Whatman GF/C filters using a cell harvester. Wash filter 10 times with ice-cold wash buffer.      After the experiment   Add aliquots of 50 μl radioligand to wells of counting plate to determine total radioactivity.   Dry, e.g. in oven for 2 h.   Place sticker on bottom plate. Add scintillation cocktail (20 μl) to filters, place sticker on top of plate and count in a scintillation counter, allow adequate time (15 min) before counting samples.      Data analysis The following calculations are required to derive Kd and Bmax from the data.   Carefully inspect raw data for consistency of replicates. Do not light-heartedly eliminate apparent ‘outliers’ from the data set.   Subtract mean non-specific binding from each replicate of total binding to obtain specific binding.   Transform totals to molar concentration of radioligand in the assay, and measured bound values (total binding, non-specific binding and specific binding) to molar amount of ligand based upon the specific radioactivity of the radioligand and the efficiency of the scintillation counter. A representative experiment with D2 receptors may look like this.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20131021/20131021184352_1957.jpg    Plot specific binding (y-axis) vs. concentration of radioligand (x-axis).   Analyze data by non-linear iterative curve fitting using a rectangular hyperbolic function using one of many available iterative curve fitting programs, e.g. Prism.   Molar amount of Bmax can be corrected for tissue content, mostly the amount of protein per well (mostly yielding fmol/mg protein); alternative normalization e.g. for tissue wet weight, number of cells or DNA content are possible.   As internal quality check, determine the fraction of total binding from total radioactivity in the assay. This needs to be < 10% (better < 5%) as otherwise non-equilibrium conditions may exist.",
    "In the latter case, membrane concentration in the assay can be reduced if the measured signal remains robust. Alternatively, assay volume can be increased as this will increase total amount of radioligand (concentration constant) but not amount bound (membrane protein amount constant).   In the past when no computer assisted data analysis was available Kd and Bmax were estimated with the Rosenthal plots, better known as Scatchard plots (Rosenthal invented them but Scatchard made them famous). In these plots the specifically bound radioligand is on the x-axis and is plotted against the ratio of bound/unbound radioligand on the y-axis. The x-intercept corresponds to Bmax and the negative reciprocal of the slope corresponds to Kd. Rosenthal/Scatchard plots can still be useful to visualize that data points indeed fall on a linear line but the estimates derived from this are less reliable than those from iterative curve fitting (the assumptions of linear regression used in these plots don’t meet because x and y are not independent of each other), making this an outdated analysis.   If saturation binding experiments are performed in the absence and presence of an inhibitor, the data can be used to test for a competitive nature of the inhibitor. This is the case if the presence of inhibitor changes the Kd but not the Bmax of the radioligand."
  ],
  "subjectAreas": [
    "Biochemistry",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}