{
  "id": 7439,
  "origin_website": "Bio",
  "title": "<em>In vivo </em>Imaging of Calcium Activities from Pancreatic β-cells in Zebrafish Embryos Using Spinning-disc Confocal and Two-photon Light-sheet Microscopy",
  "procedures": [
    "In vivo imaging of calcium activities from pancreatic β-cells in zebrafish embryos using a spinning-disc confocal microscope  Prepare zebrafish embryosSet up male and female adults in the afternoon one day before. Usually, one male and three females in a mating tank are enough.Collect embryos the next morning in Petri dishes filled with approximately 25 ml of E3 medium and discard any unfertilized or dead embryos using wide-bore plastic transfer pipettes.At 24 h post fertilization (hpf), examine the fluorescence under an epifluorescent microscope and select Rcamp1.07-positive embryos of Tg (ins:Rcamp1.07) zebrafish. Transfer the positive embryos to a new Petri dish filled with approximately 25 ml of E3 medium containing 1× PTU. Change the E3 medium containing 1× PTU and discard any dead embryos daily.Note: Supplementing PTU into E3 medium helps to reduce the pigmentation and thus improves imaging quality. Daily medium change is not necessary, though we recommend refreshing E3 medium daily, especially for the first 2 days of incubation, as unfertilized and abnormally developed embryos are commonly seen before 48 hpf. Closer inspection can be done under a stereotype microscope. Dissect embryos out from their chorion membranes using two fine sharp forceps when imaging early-stage embryos (e.g., 12-36 hpf embryos). Specifically, use one forceps to hold the chorion and make a tear in the chorion with the other forceps. The chorion is then held in a region opposite to that of the tear, and the embryo is gently pushed through the opening by passing the chorion and embryo between the tips of the other forceps. Alternatively, many embryos older than 48 hpf may have spontaneously hatched. In this case, no dechorionation is required to dissect embryos out from the chorion membranes.Note: It is critical that the tips of the forceps are sharp and that their ends can touch.",
    "Early-stage embryos are particularly fragile, so great care must be taken to minimize damage. Coat confocal imaging chamber and mount zebrafish embryoCoat each Cellvis confocal imaging chamber with 2-3 μl of Cell-Tak tissue adhesive in the center region of the glass coverslip bottom. Spread the Cell-Tak tissue adhesive using a pipette tip and let it dry until a very thin coating layer is formed.Note: It takes about 5-10 min to dry the Cell-Tak tissue adhesive, and we recommend using the coated chamber immediately. Select one embryo and orient it on the coated region of the imaging chamber, with the right side of the embryo body facing the bottom of the chamber. This reduces the actual distance between the objective lens and the islet of the embryo (Figure 1A).Immediately fill the imaging chamber with 200 μl of E3 medium containing 1× tricaine, ensuring the embryo is fully covered (Figure 1B).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4245/bioprotoc-11-23-4245-g001.jpgFigure 1. An illustration of zebrafish embryo mounting method and the spinning-disc confocal imaging setup. A. Top view shows the method of mounting zebrafish embryo. B. Side view shows the spinning-disc confocal setup for imaging calcium activities in living zebrafish embryo. Image dynamic calcium activities from β-cells in zebrafish embryo using a spinning-disc confocal microscopeFind the zebrafish embryo and fine adjust to image Rcamp1.07 signals with the most islet β-cells on the optimal focal plane.Use a 561 nm laser to illuminate Rcamp1.07 signals under a spinning-disc confocal microscope equipped with a 10×/0.4 N.A objective and use a 1.6× pre-amplifier to magnify images.Use E3 medium containing 1× tricaine for 10-15 min for basal calcium activities. Gently add an equal volume (200 μl) of 40 mM D-glucose stock solution to the imaging chamber to reach a final concentration of 20 mM during stimulation. Image for 20-40 min for stimulated calcium activities (Figure 2).",
    "For time-lapse imaging, capture images once per second (1Hz) with 100 ms exposure time using 561 nm laser under spinning-disc confocal microscope (Figure 2).Collect all the time-lapse images using MetaMorph software. Process and analyze raw image data using Fiji software (for details, see Data analysis).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4245/bioprotoc-11-23-4245-g002.jpgFigure 2. Visualization of glucose-stimulated calcium activities from β-cells in Tg (ins:Rcamp1.07) embryos under spinning-disc confocal microscope.  A. Representative images of calcium activities from pancreatic islets in a living Tg (ins:Rcamp1.07) embryo at 72 hpf at basal condition (indicated by the first two images in the first row of the montage picture) and after 20 mM glucose stimulation (indicated by remaining images of the montage picture). Arrows (red and blue) indicate two active regions showing the glucose-stimulated calcium activities from the principal islet. Time-lapse images were captured using MetaMorph software, and montage picture was generated using Fiji software. B. Representative time-course traces of the calcium activities in the regions marked in (A). Graph was analyzed and generated using GraphPad Prism 6.0 software. Scale bar: 20 μm.In vivo imaging of calcium activities from pancreatic β-cells in living zebrafish embryos using a two-photon light-sheet microscope  Transfer zebrafish embryo to the agaroseHeat up one aliquot (1 ml) of 1% agarose and keep it warm in a heat block set to 38-40°C.Supplement tricaine to a final concentration of 1× into the agarose and mix gently.Select one dechorionated Rcamp1.07-positive embryo of Tg (ins:Rcamp1.07) zebrafish and transfer it into the warm 1% ultra-pure agarose using a plastic transfer pipette (Videos 1-2).Note: When transferring embryos for agarose mounting, it is unavoidable to bring additional E3 medium along with the embryos. The additional E3 medium, if in a large volume, will change the final concentration of agarose solution, and as such, it may result in uneven embryo mounting in agarose.",
    "Transfer as minimal volume of additional E3 medium as possible in this step. <p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Zebrafish embryo transfer. <p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 2. Agarose mounting strategy. Mount the zebrafish embryo in an agarose cylinderFill the self-designed mounting device with 1% agarose solution using a syringe-attached glass capillary (Figure 3A) before taking up the zebrafish embryo.Take up an embryo by pulling the syringe very gently and place the embryo with its head pointing to the opening end of the capillary.Note: Avoid generating bubbles inside of the capillary. Keep the capillary horizontal until the agarose becomes fully solid (Figure 3A).Partially plug out a short agarose cylinder containing the zebrafish embryo, locate it vertically using the device holder equipped on the 4D-stage of light-sheet microscope (Figure 3B-3C ), and immerse the agarose-embedded embryo in the light-sheet cubic imaging chamber pre-filled with 49 ml of E3 medium containing 1× tricaine.Note: The authors find that illuminating zebrafish embryos in agarose cylinders rather than in glass capillaries will greatly increase the signal-to-noise ratio and enhance image contrast. Rotate the device holder to orient the embedded embryo with the right side of the embryo body facing towards the illuminating objective of the light-sheet microscope. This allows light penetration through the zebrafish embryo and more effective illumination of Rcamp1.07 signals (Videos 1-2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4245/bioprotoc-11-23-4245-g003.jpgFigure 3. An illustration of zebrafish embryo mounting method and the 2P3A-DSLM two-photon light-sheet microscopy imaging setup. A. A self-designed mounting device comprised of a syringe-attached with glass capillary. B-C. To improve image quality, partially plug out a short agarose cylinder containing the zebrafish embryo and locate it vertically using the device holder equipped on the 4D-stage of the light-sheet microscope.Image dynamic calcium activities from β-cells in zebrafish embryo using 2P3A-DSLMFind the zebrafish embryo and fine adjust the 4D-stage to place the Rcamp1.",
    "07-positive islet β-cells on the best focal plane.Use a 1030 nm laser to illuminate Rcamp1.07 signals under 2P3A-DSLM equipped with two 40×/0.8 N.A water lenses or a two-photon light-sheet setup with similar parameters.Capture time-lapse images in E3 medium containing 1× tricaine to record basal calcium activities. Add 1 ml of 1 M D-glucose stock solution to the cubic imaging chamber to reach a final concentration of 20 mM during stimulation. Capture time-lapse images under the high glucose E3 medium to record stimulated calcium activities (Figure 4).Note: Depending on specific experimental design and research interests, the stimulation time might be different. In most cases, recording time-lapse images for 15-60 min upon glucose stimulation is required. This allows the time required for glucose penetration and uptake by fish embryos and for capturing the calcium responses to glucose stimulation from β-cells. imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4245/bioprotoc-11-23-4245-g004.jpgFigure 4. Visualization of glucose-stimulated calcium activities from β-cells in Tg (ins:Rcamp1.07) embryos under 2P3A-DSLM.  A. The visibility of Rcamp1.07 fluorescence in β-cells under resting condition represents the basal level of intracellular calcium. B. Robust increase in fluorescent intensity of Rcamp1.07 under 20 mM glucose stimulation distinguishes the glucose-responsive β-cells (labeled with 1, 2, 3 and 4) from the glucose-non-responsive β-cells (labeled with 5 and 6). Scale bar: 10 μm.For 2D time-lapse imaging experiments, optically section the islet into 5-6 planes (z-step = 10 μm). Capture each plane with a 150-200 ms exposure time, using the 1030 nm laser under 2P3A-DSLM or a similar two-photon light-sheet setup and imaging procedure (Mahou et al., 2014). With this strategy, imaging the entire islet takes 1.5-2 s per imaging cycle (Figure 4).For fast volumetric imaging experiments and reconstruction of calcium activities within the entire islet, optically section the islet into 25 planes (z-step = 2 μm).",
    "Capture each plane five times, each with 8 ms exposure, and average into one single image.Note: This averaging process will greatly increase image contrast by increasing signal-to-noise ratios). With this strategy, imaging the entire islet takes approximately 1 s (25 × 5 × 8 ms = 1 s) per imaging cycle (see Videos 3, 5, and 6 in our original eLife research article [Zhao et al., 2019]). Collect all the time-lapse images using HCImage software and process raw image data using Fiji software (details see Data analysis)."
  ],
  "subjectAreas": [
    "Developmental Biology",
    "Biophysics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}