{
  "id": 18106,
  "origin_website": "Jove",
  "title": "A Drosophila In Vivo Injury Model for Studying Neuroregeneration in the Peripheral and Central Nervous System",
  "procedures": [
    "1. Preparation of Culture Plates and Bottles\nPreparation of grape juice agar plates\n\t\nAdd 10 g of agar powder, 200 mL grape juice, and 192 mL ddH2O into a beaker and microwave for about 4-5 min, stirring intermittently until the agar is completely dissolved.\nIn a fume hood, cool down the solution to approx. 60 °C. Add 4.2 mL 95% ethanol and 4.0 mL glacial acetic acid. Adjust the total volume of the solution to 400 mL with ddH2O. Mix well.\nFor each 35-mm plate, add about 2-3 mL of the solution. Make approximately 120-150 plates for a total of 400 mL grape juice agar solution.\nWait for 10 min to cool down the plates and solidify the agar solution. Pack the grape juice agar plates in self-sealed ziplock bags and store at 4°C for future use.\nPreparation of Drosophila culture bottles\n\t\nUse a blade to punch a 1.5 cm side length triangular hole on one wall of the Drosophila culture bottle and fill the hole with a 2-2.5 cm diameter ball of cotton for ventilation.\nPlug the bottle with a grape juice agar plate supplemented with about 0.5 cm3 of yeast paste.\n2. Collection of Drosophila Larvae\nSet up crosses of adult flies\n\t\nPlace 10 virgin females and 5 male adult flies together in a culture bottle plugged with a grape juice agar plate.\nPlace the bottle bottoms up at 25°C, so that flies will lay eggs on the grape juice agar plate. Change the plate with yeast paste at least once a day. For a 2-h collection period, which permits the harvesting of larvae of a homogenous developmental stage, start with more than 20 virgin females and 10 males in Step 2.1.1.",
    "Culture the plate at 25°C in a 60-mm Petri dish with a wet tissue, for example, soaked in 0.5% propionic acid solution. Arrange the tissue so that it does not block oxygen flow.\n\t\tNOTE: The propionic acid solution is used to maintain humidity in the dish and avoid the growth of mold.\nHarvest larvae of a specific age\n\t\nUse a pair of forceps to transfer larvae of the desired stage, for example, 2nd to 3rd instar larvae at 48-72 h after egg laying (AEL), to a new grape juice agar plate without yeast paste.\nRemove the yeast from the larvae's skin by letting them crawl around on the new plate, to prevent from potential interfering of yeast with laser axotomy and imaging. Alternatively, thoroughly clean the larvae by washing them in a dish of PBS and drying briefly on a piece of tissue paper.\n3. Two-photon Injury and Confocal Imaging\nMicroscope setup\n\tNOTE: A confocal laser scanning microscope with a two-photon laser was used for this experiment, but other systems with an equivalent setup will also suffice. The two-photon laser (930 nm) was used for delivering injury and an Argon laser (488 nm) was used for confocal imaging of GFP.\n\t\nAt the beginning of each session, turn on the two-photon laser and/or the confocal laser(s), and the microscope. Open the imaging software.\nFor two-photon injury, set up the following parameters for imaging GFP with the two-photon laser at 930 nm (1,950 mW).\n\t\t\nSelect line scan mode. Open up the pinhole all the way. Increase laser intensity to ~20% (390 mW).\nSelect 512 x 512 as the frame scan. Use maximal scanning speed (typically with the pixel dwell time at 0.77 µs). Ensure that the average number is 1 and bit depth is 8 bits.",
    "Set gain to ~750, and the offset to 0.\nSave this pre-set experimental protocol as 2P GFP 930 Ablation, allowing for easy reuse in future experiments.\nFor confocal imaging, set up the following parameters for imaging GFP with the Argon laser at 488 nm:\n\t\t\nSelect the Acquisition tab and then Z-stack.\nUnder \"Laser\", turn on the power for the 488 nm Argon laser.\nGo to Channels, select the 488 mm laser, and increase the laser power to 5-10%. For the pinhole, use the 1-2 airy unit (AU). Adjust the gain to 650.\nIn Acquisition Mode, select 1024 x 1024 as the frame scan, use the maximum scan speed, an average number of 2, and bit depth of 8 Bit.\nSave this pre-set experimental protocol as GFP Imaging.\nLarvae anesthesia with diethyl ether and mounting\n\t\nIn a fume hood, place a 60-mm glass dish in a 15-cm plastic Petri dish. Fold and lay a piece of tissue paper at the bottom of the glass dish, then place a grape juice agar plate on the tissue. Add diethyl ether into the glass dish, to the point where the tissue paper is soaked and there is a layer of liquid ether remaining in the dish. Keep the lid on at all times.\nPrepare a glass slide with one drop of halocarbon 27 oil in the center. Add 4 spots of vacuum grease onto the four corners of the slide, to later support the coverslip.",
    "Use forceps to pick up a cleaned larva and place it on the agar plate in the 60-mm glass dish. Cover the glass dish with its lid and wait until the larva stops moving. For PNS injury/imaging, take out the larva as soon as its tail stops twitching. For the CNS, wait until the entire larva becomes motionless, especially the head segments.\n\t\tNOTE: The timing of ether exposure is critical. See Discussion.\nCarefully pick up the anesthetized larva and place it head-upright into the drop of halocarbon oil on the slide. Add a coverslip on top of the slide. Use gentle pressure to push down on the coverslip, until it touches the larva (Figure 1A).\nAdjust the larva's position by gently pushing the coverslip towards the left or right to roll the larva, so that the neuron/axon/dendrite of interest is on the top and closest to the microscope lens.\nFor PNS injury, mount the larva dorsal side up, so that both the tracheas are visible. Then roll the larva ~30 degrees to the left for injuring class III da neuron axons (Figure 1B and 1C), 90 degrees for injuring class IV da neuron axons (Figure 1B and 1E), or ~30 degrees for injuring class IV da neuron dendrites (Figure 2A).\nFor CNS injury, position the larva to be perfectly ventral side up (Figure 3A), so that the region of interest is closest to the microscope lens in the z-plane.\nInjury by two-photon laser\n\t\nPlace the slide with the larva under the microscope and secure it in place with the slide holder on the stage. Use the 10X (0.3 NA) objective to find the larva.\nAdd 1 drop of objective oil onto the coverslip, switch to the 40X (1.3 NA) objective and adjust the focus.",
    "Switch to the scanning mode and reuse the experimental protocol 2P GFP 930 Ablation. Make sure the pinhole is opened all the way.\n\t\tNOTE: The configuration needs to be optimized based on individual systems.\nStart the Live mode to locate the region of interest (ROI), and fine-tune the settings to achieve good image quality with the appropriate zoom.\n\t\tNOTE: The purpose of this step is to find the neuron/axon/dendrite to injure, rather than taking the best quality image. Therefore, use the minimal settings sufficient to visualize the target area, in order to avoid overexposure or photobleaching.\nStop Live scan, so that the Crop button will become available. Let the still image serve as the roadmap. Select the Crop function and adjust the scan window to focus on the target to be injured.\nReduce the ROI to be the size of the prospective site of injury. For example, just cover the width of an axon or a dendrite, to ensure the precision of the injury and reduce damage to neighboring tissues. If desired, zoom in on the ROI before cropping, allowing for more precise injury.\nOpen a new imaging window. Reduce the scan speed and increase laser intensity. Determine the increase in laser intensity based on the tissue fluorescence signal scanned in Live mode.\nTypically, set the two-photon laser intensity starting from 25% for PNS injury and 50-100% for VNC injury. For PNS axon injury, ensure that the laser intensity is ~480 mW and pixel dwell time is 8.19 μs. For the VNC axon injury, ensure that the laser intensity and pixel dwell time are usually 965-1930 mW and 8.19-32.77 μs, respectively.",
    "Start Continuous scan. Leave the cursor hovering over the Continuous button. Keep a close eye on the image and stop the scan as soon as a drastic increase in fluorescence is observed.\n\t\tNOTE: The appearance of the fluorescence spike is due to auto-fluorescence at the injury site.\nSwitch back to the Live mode by reusing the settings. Find the region of interest that was just targeted by adjusting the focus.\n\t\tNOTE: A good indication of successful injury is the appearance of a small crater, ring-like structure, or localized debris right at the injury site.\nMove to the next neuron and repeat from Step 3.3.5, to injure multiple neurons in a single animal. Or repeat Step 3.3.5 while gradually increasing the power and/or reducing scan speed if the initial injury was insufficient.\n\t\tNOTE: In the case that the laser power is too high, a large damaged area will be visible in the post-injury live scan image. Too much injury may cause the death of the larva.\nRecover the larva by carefully removing the coverslip and transferring the injured larva onto a new plate with yeast paste. Ditch several caves on the agar plate with forceps; alternatively, make an island of agar in the plate instead of using the whole plate, to reduce the possibility of the larva crawling out of the plate.\nPut the plate in a 60-mm Petri dish with wet tissue (soaked with 0.5% propionic acid solution) and culture at room temperature or 25°C.\n\t\tNOTE: The larva will remain in the larval stage for approximately an extra day at room temperature (22°C) compared to at 25°C.\nPost-injury confocal imaging\n\t\nImage the injured larva at desired time points by preparing the larva using the same procedure of anesthesia and mounting as in Step 3.2, then imaging with the confocal laser.",
    "NOTE: Image the larva at 24 h after injury (AI) to confirm axonal injury and at 48 h AI (class IV da neurons) or 72 h AI (class III da neurons) to assess regeneration.\nLocate the larva using the 10X objective, then switch to a 25X (0.8 NA) objective. Reuse the experimental protocol GFP Imaging.\nClick the Live button and find the same neuron injured previously.\nSet the first and last Z positions in the live scan window. Press stop and click Start experiment to acquire a Z-stack image.\n\t\tNOTE: Make sure that a normalization point (the axon converging point) is included when capturing images so that quantification of regeneration is possible (Figure 1D, 1F) – this is discussed further in the data analysis section.\nSwitch to Image Processing, select the image just taken, and generate a maximum intensity projection. Save both the z-stack and maximum intensity projection images.\n4. Data Analysis\nProcess and quantify images using either the imaging software or ImageJ.\nQuantification of axon regeneration in the PNS\n\t\nCalculate Regeneration percentage, which refers to the percent of regenerating axons among all the axons that were lesioned. Score an axon as regenerating as long as it regrows beyond the injury site.\nMeasure Regeneration length, which is the increase in axon length. If quantifying with ImageJ, use the Segmented Line tool to trace the regenerated axon, and use Measure in the Analyze drop-down menu to obtain the length of the line representing the regenerated axon.\nCalculate Regeneration Index, which is the increase in normalized axon length.",
    "NOTE: Axon length is normalized by the distance between the cell body and the axon converging point (DCAC) – axon length/DCAC (Figure 1D and 1F). This value helps account for any axonal growth that is due to larval scaling. A positive value represents regeneration, a value of 0 means no regeneration, and a negative value means retraction.\nQuantification of dendrite regeneration\n\t\nCalculate Regeneration percentage, which is the percent of da neurons among all those severed that show obvious dendrite regrowth.\n\t\tNOTE: Dendrite regrowth is scored as positive if new dendrites regrow out from the retracted dendritic stem and beyond the injury site. The injury site is determined by landmarks, and in some cases, is readily visible due to the residual injury-induced autofluorescence.\nCalculate Increase of branch points, which counts the addition of new dendritic branch points after injury.\nCalculate Increase of total dendrite length, which is the cumulative length of all the new dendrites added after injury.\nQuantification of axon regeneration in the CNS\n\tNOTE: If a lesion site shows degeneration at the first time point imaged (Figure 3B), it will be included in the analysis of regeneration length and rate.\n\t\nMeasure Regeneration length, which is the length of the regrowing axon.\n\t\tNOTE: The regrowing axon of a single lesion site is identified as it originates off the original axon route before the injury.\nCalculate Normalized regeneration length, which normalizes the regeneration length to the length of the commissure segment - the longitudinal distance between commissures (\"Y\" in Figure 3A and 3B).\n\t\tNOTE: This value helps correct for the effect of larval size differences.\nCalculate Regeneration rate, which is the percent of regenerating segments among all the segments that were lesioned, to reflect the regeneration capacity of a particular genotype.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}