{
  "id": 17335,
  "origin_website": "Jove",
  "title": "A Standardized Approach to Extra-Oral and Intra-Oral Digital Photography",
  "procedures": [
    "The protocol involves standardized documentation of patients' clinical presentation as routinely administered at Columbia University College of Dental Medicine, New York. No patient data were utilized for this publication; the co-authors R.B and J.M.D.O are depicted in the photographs themselves, illustrating techniques described in this protocol and providing consent to publish the images involved. Replicating the procedure under clinical settings will require written informed consent from the patients.\n1. Acquisition of extra-oral photographs\nUtilize a ring flash and an extra-oral photography reflector (see Table of Materials) for extra-oral photography.\nAcquire patient's extra-oral photos with a black background. Use a black velvet cloth for the background to reduce shine or unwanted reflections.\n\tNOTE: Alternatively, a white background is acceptable as well. It is recommended that the patient be positioned away from external sources of light (i.e., sunlight through a window).\nAsk the patient to remove the eyewear so that both ears are equally visible.\n\tNOTE: Individuals with long hair must tuck their hair behind the ear.\nPosition the patient straight across the photographer against the background. Align the patient's head to ensure that the interpupillary line is parallel to the horizontal frame of the camera viewfinder.\n\tNOTE: The photo needs to compromise the superior portion of the patient's head, and the inferior portion needs to encompass the area just below the thyroid gland (Figure 3A).\nFor standard documentation purposes, position the patient at a 90° angle and capture the straight frontal photo and the right-side profile photos (Figure 3B).\n\t​NOTE: Additionally, one may consider adding a left and right photo acquired at a 45° angle for esthetic cases (Figure 3C).\n\t\nFor each position, consider acquiring three poses: repose, natural smile, and widest smile1,17.\n2. Acquisition of intra-oral photographs",
    "Ask the patient to sit in a dental chair at a 45° inclined position (Figure 4A). Ensure that the photographer is at the patient's 9 o'clock position with the armamentarium for photography (see Table of Materials) located within arm's reach.\n\tNOTE: Figure 4B illustrates the viewfinder observed in the cameras. They are employed to center the image captured where the image is centered to the middle of the viewfinder (Figure 4C).\nTurn off the dental operatory light to prevent light interference with the photos.\nAcquire frontal photos following the steps below.\n\t\nPosition the patient in maximal inter-cuspal position (M.I.P.)15.\nPlace and position the retractors intra-orally into the mouth and recruit the patient to hold the retractors (Figure 4D).\nPosition the operator such that the plane of occlusion of the camera is parallel to the horizontal frame line in the camera's viewfinder (Figure 4E,F).\n\t\tNOTE: Incorrect position of the retractors can result in distorted images where the capture of the soft tissues can be incomplete (Figure 4G). The resultant images do not represent the entire oral cavity when the occlusal plane is not parallel to the operator. Figure 4H,I demonstrates the effect of operator position on the image acquired.\nAcquire buccal left and right intra-oral photos.\n\t\nAlign the patient's head toward the operator. For acquiring photos on the patient's right side, place the retractor in the left side of the patient's mouth.\n\t\tNOTE: The retractor needs to be placed at the angle of the patient's mouth without tension (Figure 5A,C).\nUtilize the narrow mirror (see Table of Materials) for the buccal photos. Warm the mirror with a commercially available blow torch before insertion (Figure 5B).\nInsert the mirror into the patient's mouth parallel with the occlusal plane, gently move to the left buccal vestibule, and rotate 90°.",
    "NOTE: The mirror's edge must be rested gently on the external oblique ridge (Figure 5E,F).\nUse the mirror to stretch the patient's cheek and, at the same time, reveal a reflection of the buccal surface of the right maxillary and mandibular posterior dentition. Apply the same for the left side.\nAcquire occlusal intra-oral photographs.\n\t\nPosition the retractor in the patient's mouth. Use the large mirror (see Table of Materials) for capturing this photo.\n\t\tNOTE: The patient is recruited to aid in retracting to reveal the maxillary dentition and the buccal vestibule (Figure 6A).\nBefore insertion, warm the mirror using a Bunsen burner and insert it into the patient's mouth. Request the patient to open the mouth as wide as possible to reveal the entire maxillary dentition from molar to molar in the maxillary (Figure 6B).\nFor mandibular occlusal photos, change the retractor positions appropriately to reveal the mandibular dentition and associated buccal vestibule (Figure 6D). Request the patient to roll their tongue to the back of the mouth to show the floor of the mouth (Figure 6F). Warm up the occlusal mirror and subsequently insert it gently against the ventral surface of the tongue.\nAcquire lingual intra-oral photographs.\n\t\nTo view the maxillary palatal sextants15 (Figure 7A), use the retractor to retract the left or right maxillary lip. Warm up the small mirror, insert it in the patient's mouth, and position it to reveal the palatal surface and the palatal mucosa (Figure 7B).\nTo view the mandibular palatal sextants15 (Figure 7C), warm up the small mirror and insert it between the tongue and the lingual surfaces of the mandibular dentition. Gently align the mirror medially to reveal the reflection of the lingual surface of the dentition.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}