{
  "id": 3912,
  "origin_website": "Cell",
  "title": "A diacylglycerol photoswitching protocol for studying TRPC channel functions in mammalian cells and tissue slices",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nWe provide step-by-step method details for performing either electrophysiology in combination with LED-evoked photoswitching or monochromator-based illumination; or an all-optical method combining laser scanning-controlled photoswitching with intracellular calcium imaging. All experimental procedures should be performed in agreement with animal protocols approved by the institutional animal care and use committees.\nOptical control of TRPC channel activity recorded by electrophysiology\nTiming: 30 min–4 h\nProduce patch pipettes made of borosilicate glass with resistances of 2.0–3.5 MΩ (HEK293T cells) or 5–8 MΩ (olfactory neurons) for whole-cell measurements.\nPlace the slice in a perfusion chamber of the electrophysiology microscope and perfuse the cells/slice with bath solution S1 (aerated with 95% O2 / 5% CO2) or S3 (HEK293T cells) at an appropriate flow rate (e.g., 100 μL/s) to ensure the health of the cells. Control the flow of the bath perfusion solution, e.g., with a pump or gravity feed. The solution speed in a gravity feed system should be strictly controlled using a combination of solution volume (container) and gravity flow controllers. Keep track of the perfusion solution volume to maintain relatively equal pressure on the tubing lines. For measurements of TRPC6 channel activity in transfected HEK293T cells, mount the glass bottom dishes with the loaded cells onto the stage of the inverse microscope. Perfusion is not necessary in this case.\nFill the recording electrode with the artificial intracellular solution (depending on the experiment: S4 or S5; see: Materials and Equipment).\nPlace the recording electrode in the pipette holder of the amplifier headstage. Apply positive pressure using a 10 or 50 mL syringe to prevent the formation of air bubbles when transferring the electrode into the bath solution and attachment of debris onto the glass electrode.",
    "Set the amplifier according to the manufacturer’s manual, and apply a test pulse to monitor the pipette/seal resistance.\nBring the recording electrode into the bath solution, monitor, and correct your junction potential between the solutions and slowly approach the cell of interest.\nUsing the standard whole-cell patch-clamp configuration technique, begin with the formation of a gigaseal between the cell membrane and recording pipette electrode by releasing the positive pressure and applying a little suction (cell-attached configuration). After gigaseal formation, change the voltage to the predicted resting potential of the cell (−60 mV for most neurons) and correct for fast capacitance. Access to the cell interior is made by rupturing the cell membrane under the electrode by introducing a sudden burst of low pressure (suction). This step requires training and practice.\nData are usually acquired using the acquisition software bundled with the patch-clamp amplifier. The following recording voltage step protocols were used in Leinders-Zufall et al. (2018)[href=https://www.wicell.org#bib20]:\nVSN recording protocols\nObtain families of whole-cell currents to a series of depolarizing and hyperpolarizing voltage steps in complete darkness and during activating and inactivating photoswitching illuminations.\nKeep VSNs at a holding potential of −70 mV before initiating a cycle of step protocols.\nA prepulse to +80 mV eliminates the activity of most voltage-activated sodium and calcium channels due to their inactivation kinetics (see Lucas et al., 2003[href=https://www.wicell.org#bib22]). The prepulse is followed by (1) a short step to 0 mV, then to (2) a specific test voltage, (3) back to 0 mV and (4) ending again at the holding potential −70 mV. The test voltages range between −80 and +80 mV in incremental steps of 10 mV.\nPerform experiments in the presence of 1 μM tetrodotoxin to additionally block voltage-gated sodium channels. Voltage-activated potassium channels are blocked by using the Cs+-based S5 solution.",
    "HEK293T cell recording protocols\nObtain current-voltage relations from triangular voltage ramps ( –100 to +60 mV with a slope of 0.4 V s−1) applied at a frequency of 1 Hz.\nExtract the current amplitudes at minimal or maximal currents at ±60 mV, respectively.\nTo estimate the fast activation and deactivation kinetics of TRPC6 currents, use the following protocols: Either apply fast up-ramps (−100 to +100 mV with a slope of 4 V s−1) at a frequency of 12.5 Hz or continuously apply a constant holding potential of −60 mV.\nData are usually acquired at a frequency of 5 kHz after filtering at 1.67 kHz. In case of measurements at continuous constant holding potential, acquire data at a frequency of 200 kHz after filtering at 2.5 kHz.\nPhotoswitching using (a) a monochromator or (b) LEDs:\nSettings for the monochromator: Fluorescence light of λ = 350 or 360 nm, and λ = 450 nm at maximal intensity (100%) should be applied using a monochromator (Polychrome V, Till Photonics) controlled by the PolyCon 3.2 software.\nSettings for the use of LEDs:",
    "For photoswitching in patch-clamp experiments using VSNs (Figure 2[href=https://www.wicell.org#fig2]), light of appropriate wavelengths through two fiber-coupled LEDs with nominal wavelengths of λ = 365 nm (4.1 mW) or λ = 470 nm (10.1 mW) is delivered to switch PhoDAG between the active and inactive state, respectively. A bifurcated fiber bundle with a 400 μm core (0.39 NA) was directly coupled to the LEDs, and a fiber optic mating sleeve (Thorlabs) aligned the 400-μm thick optical fiber with a thinner optical fiber (200 μm, 0.22 NA) which is placed directly in the bath solution in front of the cell preparations. Light switching can be controlled by a DC4104 LED controller (Thorlabs) using a 1-ms switching time, triggered by a TTL signal controlled by the patch-clamp amplifier.\nAnalyze the data using Igor Pro (WaveMetrics), Origin (OriginLab), or similar software packages. Current-voltage (I-V) curves are acquired by (a) a series of depolarizing and hyperpolarizing voltage steps or (b) by voltage-ramp protocols (see voltage-clamp protocols in Figures 3[href=https://www.wicell.org#fig3] and 4[href=https://www.wicell.org#fig4]). Important parameters can be derived from these curves such as reversal potential, ionic properties and selectivity, voltage-dependence (rectification of I-V curves), activation threshold, and overall conductance properties. By using fitting routines obtained in Igor Pro, the activation, inactivation, and deactivation time constants can be determined. A commonly used fitting routine for these procedures is the Levenberg-Marquardt algorithm to minimize least squared errors.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/635-Fig3.jpg\nFigure 3. Combined DAG photoswitching and intracellular calcium recording using an all-optical confocal laser scanning approach",
    "(A) Sketch and stimulus protocol for an upright Zeiss LSM880 laser scanning confocal microscope that contains modifications to enable the combined use of a UV laser (355 nm) for photomanipulation and an Argon laser (488 nm) for excitation of the calcium indicator dye. The Argon laser exciting the calcium fluorophore will scan the preset image size of 512 x 512 pixels at a set cycle time with only a short gap between the scans. The photomanipulation with the UV laser switching the PhoDAG to the active cis-form will interrupt the collection of images from the calcium fluorophore. This pause will depend on the duration of the scanning time in one or multiple regions of interest. In the example shown, one ROI (cell # 1) is excited by the UV laser. Due to the gap in collecting the fluorophore signals of all ROIs, the ΔF/F analysis will thus display a pause in the recording.\n(B) Example of the Ca2+ response of a TRPC2-expressing olfactory type B cell loaded with PhoDAG-1 (10 μM). Photoswitching to 355 nm (10 mW) for 61 ms (thin magenta line) evoked a transient elevation in intracellular Ca2+. The photostimulus consisted of 40 individual scans with a pixel dwell time of 2.05 μs, resulting in a total UV exposure time of 61 ms. Decay time constant of the Ca2+ transient is indicated. Figure reprinted with permission from Figure 4[href=https://www.wicell.org#fig4]D in Leinders-Zufall et al., 2018[href=https://www.wicell.org#bib20].\n(C) Example of the Ca2+ response of an olfactory TRPC2-expressing cell loaded with OptoDArG (30 μM). Photoswitching to 355 nm (30 mW) for 54 ms (thin magenta line) evoked a transient elevation in intracellular Ca2+. The photostimulus consisted of 100 individual scans with a pixel dwell time of 2.05 μs, resulting in a total UV exposure time of 54 ms.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/635-Fig4.jpg",
    "Figure 4. Photoswitching of OptoDArG activates human TRPC6 channels expressed in HEK293T cells\n(A) Schematic depiction of the setup for whole-cell measurements of HEK293T cells using an inverse microscope. Photoswitching was performed with light produced by the monochromator Polychrome V that was controlled by the PolyCon software. The stage of the microscope contained the recording chamber. The Heka EPC10 amplifier with Patchmaster software and the recording electrode are displayed. The microscope was equipped with a 20 x oil immersion objective and with a filter cube containing a dichroic mirror. Pipette solution (S4); bath solution (S3).\n(B) Voltage protocols and resulting currents of HEK293T cells expressing hTRPC6 and preincubated with 30 μM OptoDArG. Currents were measured over time and after stimulation with λ = 450 nm (blue) or λ = 360 nm light (pink). The gray line illustrates the ramp voltage protocols. Ramp currents were examined using 50 ms voltage ramps from −100 to 100 mV (4 V/s). The ramp current with 450 nm exposure is indicated in blue and with a blue data point at 100 mV (1). The ramp current with 360 nm exposure is indicated in pink and with a pink data point at 100 mV (2).",
    "(C) Single data points obtained from ramp currents of the experiment shown in B are plotted at 100 and −100 mV vs. time. Exposure to 360 nm UV light caused the switching of OptoDArG from the trans to the cis form and the activation of hTRPC6 channels. The data points within the gray box are from the current ramps shown in B, whereby the colored data points depict the value at 100 mV. Switching back to 450 nm light exposure returned the ramp currents at 100 and −100 mV back to their original value. The colored data points (1–3) are plotted as I-V curves in D.\n(D) I-V curves obtained from the ramp protocols shown in B. The numbers (1, 2, and 3) indicate the time points at which the I-V curves are extracted from C.\n(E and F) Data points obtained from ramp currents of an untransfected HEK297T cell preincubated with 30 μM OptoDArG are plotted at 100 and −100 mV vs. time using the same ramp and analysis protocols as in B and C. The colored data points (4–6) are plotted as I-V curves in F. Exposure to 360 nm UV light failed to induce a current under these conditions.\n(G) Representative time course of a light-evoked hTRPC6 current recorded at a holding potential (VH) of −60 mV. The activation phase, inactivation with fast and slow phases, and deactivation phase of the hTRPC6 current are indicated. (B, C, E and G) Illumination protocol using light of the wavelengths λ = 360 nm or λ = 450 nm is depicted above each trace.",
    "Note: In some instances, it could be an advantage to (additionally) infuse photoswitchable DAGs through the patch pipette if there appears to be a loading problem. In this case, use the 100 mM PhoDAG-1 stock solution and dilute it with pipette solution S4 to a final concentration of 100 μM PhoDAG-1. Proceed with “Optical control of TRPC channel activity recorded by electrophysiology”.\nCombined laser scanning-controlled photoswitching and calcium imaging\nTiming: 30 min–4 h\nDissociated cells or tissue slices co-loaded with a calcium indicator and PhoDAG are placed in a laminar flow recording chamber and continuously perfused with extracellular S1 solution (aerated with 95% O2 / 5% CO2) at an appropriate flow rate (e.g., 100 μL/s) to ensure the health of the cells. Control the flow of the bath perfusion solution using a pump or gravity feed. The solution speed in a gravity feed system should be strictly controlled using a combination of solution volume (container) and gravity flow controllers. Keep track of the perfusion solution volume to maintain relatively equal pressure on the tubing lines.\nVisualize the cells within a scanning field of 512 x 512 pixels and a depth of ∼9 μm.\nAdjust the pixel dwell time of the laser to a total image scanning of ∼1 s.\nTo measure the basic activity of the cells and to ensure there is no drift in the recording, perform calcium fluorescence imaging of the cells/tissue using the Argon laser (excitation wavelength of 488 nm) for 4 min. The Zen software (Zeiss) will capture the emission fluorescence (510–560 nm). All scanning head settings need to be kept constant during the entire experiment to ensure comparison of the image data. At 488 nm wavelength, PhoDAGs are known to exist in the inactive trans configuration (Frank et al., 2016[href=https://www.wicell.org#bib10]).",
    "For photoswitching of PhoDAG to the active cis form, UV light of 355 nm is used to scan preselected regions-of-interests (ROIs) via the Zen software tool ‘Bleaching’. To prevent damage to the highly sensitive gallium-arsenide-phosphide (GaAsP) detectors, a pre-installed shutter should be activated via the Zen software protocol which will block UV light reaching the detector. Unfortunately, the collection of the calcium indicator fluorescence is halted during photoswitching of the PhoDAG compounds, but resumes at the end of the UV stimulation. An example of the imaging acquisition and stimulus protocol is shown in Figure 3[href=https://www.wicell.org#fig3]A.\nAnalyze images using a combination of Zen (Zeiss), ImageJ (NIH), and Igor (WaveMetrics) software. Raw fluorescence images can be acquired via the manufacturer’s software Zen (Zeiss) and, by using Zen or ImageJ (NIH), regions-of-interests (ROIs) are marked for analysis. The raw fluorescence intensity of the ROIs versus time are exported to an analysis program, e.g., Igor Pro (WaveMetrics), which enables to determine the average baseline fluorescence values (Fo). Cytosolic changes in fluorescence intensity are then calculated as (F–Fo)/Fo. Onset time of Ca2+ transients is defined as the difference between the time point at which 488 nm excitation started after UV exposure and the time at which Ca2+ fluorescence exceeded twice the standard deviation of the mean of the baseline noise. Other parameters (such as Fpeak, and activation or deactivation time courses) can then be determined and fitted using the standard tools provided by Igor Pro.\nNote that a variety of state-of-the-art methods for calcium imaging data analysis and various software tools have been summarized recently (Pnevmatikakis, 2019[href=https://www.wicell.org#bib25]).",
    "Note: UV laser power will have to be adjusted depending on the DAG analog being used and the final concentration loaded into the cells. PhoDAG-1 and PhoDAG-3 could be photoswitched to the active cis form using a UV laser power of 10 mW (Figure 3[href=https://www.wicell.org#fig3]B). However, OptoDArG required 30 mW laser power to obtain a similar Ca2+ response (Figure 3[href=https://www.wicell.org#fig3]C).\nNote: The depth of focus can be increased from 9 μm to 16 μm to ensure, together with the region of interest (ROI) diameter, illumination of individual cells, localized areas of a given cell, or a subcellular region containing the microvilli or dendritic knobs of VSNs in tissue slices.\nNote: Prior to photoswitching, UV laser light can be optimally focused in 18-μm thick tissue sections by loading them with Hoechst 33342 (1:10000) and using the semi-automated correction tool of the Zen software (Zeiss)."
  ],
  "subjectAreas": [
    "Neuroscience",
    "Cell Biology",
    "Molecular/Chemical Probes",
    "Microscopy"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}