{
  "id": 6787,
  "origin_website": "Bio",
  "title": "Characterization of Immunological Niches within Peyer’s Patches by <em>ex vivo</em> Photoactivation and Flow Cytometry Analysis",
  "procedures": [
    "Note: Photoactivation is a time consuming process, therefore it is recommended to evaluate the time necessary for photoactivation of all required niches and analyze a sample size where samples will not wait for more than 3 h for the following staining step. Longer delay in tissue processing might increase the frequency of dead cells and therefore will not contribute to pool of analyzed cells. In the case of the SED photoactivation, ~30 SED regions were photoactivated in each mouse and up to two mice were analyzed a day. In addition, photoactivation can be held on the full PA-GFP mouse, on transferred cells or in chimeras prepared with PA-GFP bone marrow. Heterozygous PA-GFP mice can also be used in this protocol, but homozygous PA-GFP mice generate a stronger GFP signal. In the study associated with this protocol, we generated chimeric mice composed of 90% homozygous PA-GFP bone marrow and 10% AID-GFP bone marrow. AID is expressed by SED and GC B cells, thus AID-GFP was used as a landmark for these compartment. Euthanize a mouse by cervical dislocation or by CO2 inhalation (the technique does not affect the following steps).Open the abdominal cavity and remove the small intestine from the cecum to stomach into a PBS containing petri dish (~15 ml of PBS).Flush the intestine with 40 ml PBS using a 30 ml syringe with an 18 G MonojectTM blunted cannula. Avoid contact of the tissue with the intestinal content flushed out.Excise a piece of the intestine that includes a Peyer’s patch and cut it longitudinally without damaging the PP.Place the tissue on a cover slip glass and add silicone grease around the tissue. Make sure that the silicone layer is not thicker than the tissue.",
    "Add PBS (~30 μl) to hydrate the tissue and cover with an additional cover slip glass (Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200316/20200316185612_8318.jpgFigure 1. Peyer’s patch slide preparation. A. Intestinal tissue containing a Peyer’s patch was cut out (black dashed lines) and an additional longitudinal cut (yellow dashed line) was performed to expose the SED compartment. B. The PP was placed on a cover slip, and hydrated with PBS bound by silicone grease.Place the tissue on a slide with the desired side for photoactivation facing up.Add a drop of DDW on the tissue and place the lens in the region of interest.Focus and image the tissue at 940 nm wavelength (this will also ensure that unspecific photoactivation will take place).Define a 5 µm interval Z-stack within the tissue in the area of desired photoactivation.Image a high quality Z-stack image before photoactivation at 940 nm (Figure 2).Define the area of photoactivation by adding a region in the ZEN setup and make sure to mark this region for acquisition.Change laser parameter to 830 nm and image. This should include imaging of a specific region of interest with a Z-stack at 830 nm.Return laser to 940 nm and remove the marked region.Repeat image acquisition at 940 nm (Figure 2). This should include the entire field with a Z-stack. The photoactivated area will appear green according to the defined region boundaries.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200316/20200316185653_1768.jpgFigure 2. Photoactivation of the SED area in a PP of a chimeric PA-GFP mouse. Images show the SED before photoactivation, during photoactivation at 830 nm and after photoactivation to indicate the labeled population.Repeat for all desired niches.Open cover slip glasses and gently transfer the tissue into a petri dish with a 70 µm cell strainer and 3 ml FACS buffer.",
    "Using a piston of a 3 ml syringe mash the PPs to create a single-cell suspension of PP-derived cells.Transfer the cell suspension into a FACS tube with a cell-strainer cap.Wash the petri dish with additional 1 ml of FACS buffer and collect the solution into the same FACS tube to maximize cell collection. The sample contains all PP cells, ranging 3-10 M cells.Spin down the cells at 300 RCF for 7 min at 4 °C.Discard the supernatant and resuspend the cells with the residual buffer (approximately 100 µl).Add 1 µl Fc blocker antibody (TruStain FcXTM), vortex and place on ice.Incubate 5 min on ice.Add 100 µl staining mix prepared in FACS buffer. In the paper associated with this protocol, Tfh cell markers were used to stain for SED-derived T cells (B220- CD4+ CD44+ CD62L- PD-1+ CXCR5+). In cases where a biotin-conjugated antibody is used, first stain the cells with the biotin-conjugated antibody together with other conjugated antibodies, and in a second step stain the cells with the streptavidin antibody. Since the residual volume in the tube following blocking is approximately 100 μl, the antibody mix is prepared as a 2x concentration to achieve final dilution as indicated in Table 1.Table 1. List of antibodies used for T cell staining in photoactivated PPsimgsrc:https://en-cdn.bio-protocol.org/attached/image/20200316/20200316185747_3347.jpgVortex and incubate on ice for 30 min in the dark to allow surface marker staining.Wash the cells with 2 ml FACS buffer and spin down the cells at 300 RCF for 7 min at 4 °C.Add 100 µl staining mix containing 1:400 AF647 Streptavidin antibody (stock concentration: 0.5 mg/ml) prepared in FACS buffer.Vortex and incubate on ice for 30 min in the dark to allow surface marker staining.",
    "Wash the cells with 2 ml FACS buffer and spin down the cells at 300 RCF for 7 min at 4 °C.Resuspend the cells with 500 µl FACS buffer and analyze the cells using CytoFlex flow cytometer (Beckman Coulter)."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}