{
  "id": 7013,
  "origin_website": "Bio",
  "title": "Measurement of Ascorbic Acid and Glutathione Content in Cyanobacterium <em>Synechocystis</em> sp. PCC 6803",
  "procedures": [
    "Cell harvest and antioxidants extractionPlace fifty milliliters of exponentially-growing culture (~2.5 × 107 cells ml-1) in 50 ml conical centrifuge tubes.Harvest cells by centrifugation (9,300 × g for 10 min, 4 °C).Discard the supernatant and place the pellet with a sterile spatula in a new and sterile 1.5 ml microcentrifuge tube.Place the tube on ice. Resuspend cells in 1 ml 3% TFA and add approximately 100 μl of sterile acid-washed glass beads (150-212 µm).Lyse the cells by mixing vigorously (vortex, 1 min), freeze with liquid nitrogen and thaw in ice.Note: Broken cells can be observed under an optical microscope, in order to ensure a correct rupture of the cells. Repeat Step A5 at least 3 times.Centrifuge the homogenate (16,000 × g 15 min, 4 °C).Collect the supernatant in a new 1.5 ml microcentrifuge tube and keep it on ice before use.Activate Bond Elut C18 columns by applying in the following order:1.5 ml methanol.1.0 ml water for HPLC.1.0 ml phosphate buffer 100 mM pH 7.00.Discard the solution from the washing steps.Pass 500 μl of the supernantant (Step A8) through a previously activated Bond Elut C18 cartridge using a siringe.Discard flow-through (500 μl) and pass 1.5 ml phosphate buffer 100 mM pH 7.00 to elute (pH of the elution around 2). Collect the filtrate in a new 1.5 ml microcentrifuge tube and mix thoroughly by vortexing for 10-20 s.This filtrate is used for ascorbic acid and glutation determination.Note: It is highly recommended to perform the measurements inmediately after obtaining the filtrate. In particular, ascorbic acid determination needs to be done after the preparation. Freezing the samples is not recommended because after thawing a drastic reduction in the antioxidant content is observed. For glutathione measurements, the supernatant can be stored at -80 °C.",
    "Reduced ascorbic acid and total ascorbate measurementsTo determine reduced ascorbic acid mix in a new 1.5 ml microcentrifuge tube:240 μl of the filtrate obtained in Step A10240 μl of K2HPO4 100 mM pH 8.550 µl of TFA 10%15 µl of water for HPLCTo determine total ascorbate mix in a new 1.5 ml microcentrifuge tube:240 μl of the filtrate obtained in Step A10240 μl of K2HPO4 100 mM pH 8.515 µl of DTT 100 mM (final concentration: 3 mM)Incubate for 5 min at at room temperatur and stop the reaction by adding 50 µl of TFA 10%.Reduced ascorbic acid and total ascorbate quantificationTo quantify the reduced ascorbic acid concentration, filter the solution obtained in Step B1 through a 0.22 µm nylon menbrane filter and inject 10 μl in a HPLC equipped with and a C-18 column (100 × 4.6 mm, 3 μM). As mobile phase use a solution of KH2PO4 100 mM (pH 3.00) in water for HPLC (adjust pH with phosphoric acid 85%) at 0.35 and 0. 5 ml min-1 flow.Quantify the area under the peak that displays a maximum at 265 nm (Figure 1).To quantify total ascorbate concentration filter and inject 10 μl of the second solution obtained in step B2 using the same equipment and conditions described in Steps C1 and C2.Prepare a calibration curve using a series of standard L-ascorbic acid dilutions (e.g., final concentrations of 0.1, 0.5 and 1 μM) and measure the peak area following the same procedure as described in Step C2 (Figure 1).Adjust the linear function of ascorbic acid concentration vs. peak area and use the slope to calculate the concentration of the unknown samples as described in the formula:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20201014/20201014033830_1366.",
    "jpgThe x2 is included in the formula because cells are resuspended in 1 ml TFA (Step A4) but only half of the supernatant is passed trought the column (Step A9). The x3 is included because in Step A10 one volume of sample is passed through the column (500 μl) and three volumes are collected (1.5 ml).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20201014/20201014033850_5668.jpgFigure 1. Area under the peak and standard curve to Asa quantificationMeasurement of glutathione contentThe quantitative determination of the total amount of glutathione (GSH + GSSG) employs an enzymatic method. In this, the reduction of DTNB to 5-thio-2-Nitrobenzoato (TNB) by NADPH is quantified spectrophotometrically. This reaction is used to measure the reduction of GSSG to GSH. The rate of the reaction is proportional to the GSH and GSSG concentration.To determine the total glutathione, in a new 1.5 ml microcentrifuge tube add:650 µl phosphate buffer 100 mM pH 7.5 + EDTA 5 mM25 µl DNTB (5 mg/ml) (final concentration 0.2 mM)5 µl NADPH (1 mg/100 µl)5 µl l glutathione reductase 1:30 (0.5 U)300 µl of filtrate obtained in Step A10Note: The blank solution contained all reagents except the filtrate obtained in Step A10. Mix gently and read the absorbance at 412 nm using a spectrophotometer. To extract the oxidized gluthathion (GSSG), add 3 µl of Vinylpyridine (95%) to 300 µl of the filtrate obtained in Step A10, gently mix by vortexing and incubate at room temperature for 25 min.Centrifuge (16,000 × g 10 min, 4 °C) and place the tube on iceIn a new 1.5 ml microcentrifuge tube add365 µl phosphate buffer 100 mM pH 7.5 + EDTA 5 mM.25 µl DNTB (5 mg/ml).5 µl NADPH (1 mg/100 μl)5 µl l glutathione reductase 1:30 (0.5 U)100 µl of the supernatant obtained in Step D4Mix gently and read the absorbance at 412 nm.",
    "Quantification of glutathione levels is based on the oxidized form of glutathione (GSSG). To quantify the glutathione levels, prepare a calibration curve with 0-100 µM standard L-Glutathione oxidized solution.Note: The content of the antioxidant can be expressed either as per mg of fresh or dry weight or as pmol per cell (in the case of of ascorbic acid) and nmol per cell (in the case of glutathione). The content of antioxidants can be correlated with cell number determined with a Neubauer counting chamber."
  ],
  "subjectAreas": [
    "Microbiology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}