{
  "id": 13724,
  "origin_website": "Jove",
  "title": "Generation of Aggregates of Mouse Embryonic Stem Cells that Show Symmetry Breaking, Polarization and Emergent Collective Behaviour In Vitro",
  "procedures": [
    "1. Culture Conditions Prior to Aggregation\nMaintain mESCs in ESLIF medium (see Table of Specific Materials & Equipment for formulation) on gelatin-coated 25 cm2 tissue-culture-treated flasks in a humidified incubator at 37 °C and 5% CO221-25.\nGrow cells for at least two passages post thawing before use in this protocol; cells at lower passages are generally more successful at generating reproducible characteristics throughout experimental replicates (i.e., no more than 15 passages in culture), however slight variation between different ES cell-lines is to be expected (see Table 2 for the cell lines tested).\nGrow cells to 40-60% confluency. Do not use over-confluent cells for aggregation.\n2. Generation of Aggregates\n Pre-warm PBS (+Ca2+, +Mg2+), ESLIF, N2B2726,27 and Trypsin-EDTA in a 37 °C water bath.\n Aspirate culture medium from the tissue culture flask (step 1.3). Rinse the flask gently with 5 ml PBS, twice. Aspirate the PBS and add 1 to 2 ml of pre-warmed Trypsin-EDTA (0.25%) to dissociate the cells.\n\t\n Place the flask in the incubator for < 5 min or until cells have fully detached from the surface of the flask. Pipette up and down with a 1 ml pipette to generate single-cell suspension for accurate counting and uniform aggregate size formation.\n Neutralize Trypsin with 5-10 ml ESLIF; wash down the growth surface to maximize cell recovery and transfer to a 50 ml centrifuge tube. Remove a 1 ml aliquot from the centrifuge tube and count the cells with a haemocytometer.\n Determine the volume of suspension required to give 10 cells/µl (a whole 96-well plate requires 5x104 cells in a 5 ml suspension). Count cells accurately, as large deviations from the stated cell number can adversely affect the response of the aggregates to stimuli.",
    "Add 5x104 cells to 5 ml pre-warmed PBS in a fresh 50 ml centrifuge tube and spin at ~170 x g for 5 min.\n Carefully aspirate the PBS and add 5 ml pre-warmed PBS gently; do not disturb the pellet at the bottom of the tube. Centrifuge at ~170 x g for 5 min.\n Carefully aspirate PBS for a second time. Remove as much PBS as possible without disturbing the pellet as PBS carryover can adversely affect aggregation. Resuspend the pellet firstly in 1 ml warm N2B27 with a P1000 pipette to generate a homogenous cell suspension, followed by further addition of N2B27 to the required volume (e.g., add 4 ml for a 5x104 cells/5 ml suspension).\n Transfer the cell suspension to a sterile reservoir and pipette a 40 µl droplet into the bottom of each well of a non-tissue-culture treated, ‘U’-bottomed 96-well plate using a multichannel pipette. Cover the 96-well plate with its corresponding lid and confirm the presence of cells with an inverted bench-top microscope (Figure 1B).\n\tNote: It is essential that these plates are used to limit the possibility of cells adhering. Do not coat the bottom of the 96-well plate with Gelatin, Fibronectin or any other coating that promotes cell adhesion.\n Incubate the cells for 48 hr in a humidified incubator at 37 °C and 5% CO2 for aggregation.\n3. Applying Stimuli and Changing Medium\n Following the 48 hr incubation period, observe the appearance of the mESCs within each well of the 96-well plate to confirm successful aggregation (Figure 1E). Note: Aggregates will appear spherical in nature and approximately 150-200 µm in diameter. Refer to the troubleshooting section if problems arise (Table 1).",
    "Add 150 µl fresh secondary medium (3 µM Chi99021 (Chi) in N2B2719; stock prepared at 10 mM in DMSO) to each well using a multichannel pipette. Pipette with enough force to dislodge any aggregates that may have started to adhere to the bottom of the wells. Incubate aggregates in secondary medium for 24 hr in a humidified incubator at 37 °C and 5% CO2 (Figure 1A).\n\tNote: Reproducible elongated and polarized aggregates are generated using this secondary medium. Other secondary medium compositions may also be used depending on the experimental conditions required and examples are shown in Figure 3.\n For subsequent medium changes, use a multichannel pipette held at an angle (approximately 30°) to gently remove 150 µl of the secondary medium from the side of each well. Then, pipette 150 µl fresh N2B27 into each well with enough force to dislodge any aggregates that may have started to adhere to the bottom of the wells.\n Repeat point 3. 3 every 24 hr until the time-course is complete (the typical length of an aggregate culture experiment is 120 hr).\n\tNote: Ensure aggregates are freely moving following medium changes to ensure reproducibility and consistency within and between each 96-well plate. Medium must be changed daily following the aggregation period.\n4. Preparation of Aggregates for Immunostaining and Analysis by Confocal Microscopy\nFixation and Primary Antibody Incubation\n\tNote: The protocol described by A.K. Hadjantonakis28 has been modified to suit immunostaining of mESC aggregates. For the typical antibodies used in our studies and their dilutions, refer to previously published work19,21,24,25,29 and Table 3.",
    "Use a multichannel pipette held at an angle (approximately 30°) to gently remove 150 µl medium from the side of each well of the 96-well plate. Wash twice by pipetting 150 µl PBS into each well. Leave a couple of minutes between each wash to allow the aggregates to settle.\nSet a P1000 pipette to dispense 200 µl, attach the corresponding pipette tip and cut off approximately 3 mm from the end of the tip with a pair of sterile scissors. Draw a portion of the PBS within each well of the 96-well plate a short way into the tip and expel it to agitate the aggregate.\nUse the same tip to draw up the whole volume within the well including the aggregate and pipette into a small (30 mm diameter) glass Drosophila dissection well. Transfer all the aggregates from the 96-well plate that will undergo identical immunostaining regimes into the same glass dissection well.\n\t\tNote: Use a new cut pipette tip when transferring aggregates from different experimental conditions to prevent carryover of aggregates.\nPlace the glass well that contains the aggregates onto a dissection microscope. Swirl the glass well to force the aggregates to the centre and aspirate PBS from one side of the well with a glass Pasteur pipette. Use the microscope to ensure the aggregates are not aspirated. Leave a small volume of PBS within the glass well to cover the aggregates to prevent them from drying out.\nAdd 1 ml freshly prepared formaldehyde (4%) dissolved in PBS and incubate for 2 hr at 4 °C on an orbital shaker set to a low speed. Caution: Paraformaldehyde is known to be allergenic, carcinogenic and toxic. Wear appropriate protection whilst handling.",
    "Following fixation, aspirate the formaldehyde solution in the same manner as described in section 4. 1. 4 and wash the aggregates with 1 ml PBS three times, 10 min for with each wash, on an orbital shaker set to a low speed.\nAspirate the PBS as described in section 4. 1. 4 and perform a further three, 10 min washes with PBS containing 10% Foetal Bovine Serum and 0.2% Triton X-100 (PBSFT). Perform the 10 min washes on an orbital shaker set to a low speed.\n\t\tNote: Using Foetal Bovine Serum (FBS) results in a clear wash buffer, reducing the number of aggregates that would otherwise be lost during the protocol if milk was used. It is important to note that following fixation, immunohistochemical procedures can be performed in various ways other than those detailed below and should be determined and optimized by the investigator.\nBlock the aggregates for 1 hr at 4 °C in PBSFT on an orbital rocker set to a low speed. The protocol may be paused at this point, and aggregates blocked O/N, with constant agitation on a horizontal gyratory rocker at 4°C.\nAspirate the PBSFT as previously described (see section 4. 1. 4) and incubate the aggregates with 500 µl of the required primary antibody diluted in PBSFT O/N at 4 °C on an orbital shaker set to low speed. Cover with paraffin film to prevent evaporation.\nSecondary Antibody Incubation",
    "Aspirate the primary antibody solution and wash with 1 ml PBSFT (at 4 °C) in the following manner: twice for 5 min; thrice for 15 min; and four to seven times for 1 hr. Perform each wash step at 4 °C and on an orbital rocker set to low speed. Note: Chill wash medium prior to use. Do not perform the washes on ice as this can cause the aggregates to fragment.\nAspirate the final wash medium and incubate the aggregates with the required secondary antibody in 500 µl PBSFT O/N at 4 °C in the dark on a horizontal gyratory rocker. Add nuclear stain such as Hoechst if required.\nMounting and Imaging by Confocal Microcopy\n\t\nWash the aggregates as described in Section 4. 1. 4 with 4 °C PBSFT. After the final wash, rinse the aggregates with 1 ml PBS containing 0.2% FBS and Triton X-100 (PBT) in the following manner: twice for 5 min; thrice for 15 min. Perform washes at RT on an orbital rocker protected from light.\nAspirate the medium as previously described (section 4. 1. 4) and incubate for 30 min in the dark with a 1:1 solution of glycerol:PBT (1 ml) followed by a second 30 min incubation with a 7:3 solution of glycerol:PBT (1 ml).\n\t\tNote: Mix the glycerol and PBT solutions at 4 °C using a rotator.\nAspirate the final glycerol:PBT solution and replace with 1 ml mounting medium24. The protocol may be paused at this point prior to mounting (if paused, seal the wells with paraffin film and store the staining wells at 4 °C).",
    "Mount the aggregates on microscope slides by pipetting them in 17 µl droplets with a cut P20 tip (Figure 2). Fold double-sided tape back on itself four times to generate spacers and attach to each end of the slide. Place the top coverslip (22 mm x 60 mm) upon these spacers (Figure 2).\n\t\tNote: it is essential that a cut tip is used at this stage so as not to damage the samples. The spacers prevent the coverslip crushing the aggregates.\nOnce the aggregates are mounted, image the samples using confocal microscopy using protocols previously described19,21,24,25. Once placed on the microscope, leave the slide undisturbed on the stage for a few minutes to allow the aggregates to settle within the mounting medium."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}