{
  "id": 6848,
  "origin_website": "Bio",
  "title": "Pancreatic Acinar Cell Preparation for Oxygen Consumption and Lactate Production Analysis",
  "procedures": [
    "Day 1 Pancreatic acinar cell preparationSacrifice young (8-12 weeks old) adult CD1 or C57BL/6 (wild type) mouse using an approved Schedule 1 procedure.Place mouse down on right hand side on fresh tissue paper.Using forceps and scissors cut away fur in the side abdominal area. Once removed make a similar removal of lower skin epidermis to expose the abdominal cavity.Locate the pancreas below the spleen gently with forceps and cut free with a small pair of surgical scissors.Place the freshly excised pancreas in 7 ml ice cold extracellular solution and keep on ice until digestion.Pre-warm 1 ml of collagenase solution (200 U/ml) to 37 °C in a water bath.Carefully inject the pre-warmed collagenase using a 30 G needle into the pancreas samples placed in a weighing boat until the pancreas inflates. Draw up any remaining collagenase not retained within the pancreas from the weighing boat and re-inject into pancreas.Place the inflated pancreas into a 1.5 ml microcentrifuge tube and add any remaining collagenase.Place in a 37 °C water bath for 17 min.Note: This time is dependent on the brand and concentration of collagenase used. You may need to optimize so that you get a optimal amount of cell viability and cell number achieved. After incubation for 17 min remove from water bath and decant contents of the 1.5 ml microcentrifuge tube into a 15 ml falcon tube labeled ‘Panc’, quickly add 5 ml of extracellular solution.Using a 1 ml pipette tip, cut at an angle across the tip, as shown in Figure 1i and the volume set at 700 µl vigorously pipette the whole pancreas tissue up and down, in and out of the pipette tip to allow for tissue dissociation (trituration). Note: Repeat process until the mixture becomes cloudy with the release of cells.",
    "Upon cessation of pipetting quickly remove the cellular solution into a fresh 15 ml tube labeled ‘Cells’, using a 3 ml pasteur pipette being careful to leave behind any pieces of pancreas tissue.Add 5 ml of extracellular solution to the 15 ml tube ‘Panc’.Using a fresh 1 ml pipette tip, cut at a smaller angle than previously used in Step A11 across the pipette tip, as shown in Figure 1ii and the volume set at 700 µl. Vigorously pipette the whole pancreas tissue in and out of the pipette tip to allow further tissue dissociation.Upon cessation of pipetting quickly remove the cellular solution into 15 ml tube ‘Cells’, using a 3 ml pasteur pipette and being careful to leave behind any pieces of pancreas tissue.Repeat Steps A14-A16 for a third and final time using a fresh 1 ml pipette tip cut at an angle across the tip, as shown in Figure 1iii.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200514/20200514002137_1655.jpgFigure 1. How to prepare 1 ml pipette tips for dissociationDiscard any tissue remaining in a 15 ml tube labeled ‘Panc’.Centrifuge 15 ml tube labeled ‘Cells’ for 2 min, 130 x g, room temperature.Carefully pour off the supernatant leaving behind the loose cell pellet.Resuspend the cell pellet in 1 ml of chilled extracellular solution.Add an additional 9 ml of chilled extracellular solution.Set up a 70 micron filter in a 50 ml centrifuge tube (labeled and dated) and pre-wet with a small amount of extracellular fluid.Filter the 10 ml of cell suspension from the 15 ml tube ‘Cells’ through the filter into the 50 ml tube.Rinse the filter and any cells left trapped in the filter through with approximately 30 ml of chilled extracellular fluid until the 50 ml centrifuge tube is filled to the 40 ml mark.",
    "Centrifuge 50 ml tube labeled ‘Cells’ for 2 min, 130 x g, room temperature.Carefully pour off the supernatant leaving behind the loose cell pellet.Resuspend the cell pellet in 1 ml of chilled extracellular solution.Add an additional 9 ml of chilled extracellular solution.Place the 50 ml centrifuge tube with sample overnight at 4 °C.Oxygen consumption and lactate production analysis cell plate preparation and cartridge rehydrationRemove a Seahorse XF 24 well cell plate and remove from packaging.Take a pre-aliquotted 250 µl vial of Matrigel from storage in a -80 °C freezer and thaw on ice.Adapt Corning’s ‘Thin Coating Method’ for use on a Seahorse XF24 cell plate as follows:Using cooled pipettes, mix the BD Matrigel Basement Membrane Matrix to homogeneity.Dilute Corning Matrigel Basement Membrane Matrix using serum-free medium Seahorse media.Carefully add 36 µl diluted BD Matrigel Basement Membrane Matrix to Seahorse XF 24 well cell plate being sure not to create any bubbles.Incubate at room temperature for 30 min.Aspirate unbound material, discard and gently rinse by pipetting 100 µl chilled serum-free Seahorse media into each well and then immediately aspirating and discard, using a multichannel pipette.Pipette 100 µl chilled serum-free Seahorse media into each well and leave at 4 °C until ready for use.Remove a Seahorse XF 24 cartridge from packaging.Remove the sensor plate (green upper half of the cartridge) and place lid down on the bench.Pipette 1 ml of XF callibrant into each of the 24 wells of the utility plate and return the sensor plate so the probes of each well are submerged in XF callibrant.Place in a 37 °C CO2 free incubator overnight until ready for use.Day 2 Assess pancreatic cell viabilityThe next day the cell suspension is mixed to obtain a homogenous suspension by gently pipetting up and down using a 1 ml pipette.",
    "Pipette a 1 ml cell sample from the cell suspension into a 1.5 ml microcentrifuge tube.Label a PI-CassetteTM ‘NV’ (non-viable).Draw the cell suspension into a PI-CassetteTM by inserting the tip of the cassette into the cell suspension in the 1.5 ml microcentrifuge tube and pressing the piston.Set aside the ‘NV’ PI-Cassette™ to be analysed.Pipette 100 µl of the 1ml cell sample from the 1.5 ml microcentrifuge tube into a second 1.5 ml microcentrifuge tube. Return any cell sample remaining to the original cell suspension 50 ml centrifuge tube ‘Cells’.Add 100 µl volume of Reagent A100 to the microcentrifuge tube with the 100 µl cell sample.Mix by pipetting.Add 100 µl volume of Reagent B to the mixture of cell suspension and Reagent A100.Mix by pipetting.Label a PI-CassetteTM ‘T’ (total).Draw the diluted cell suspension into a PI-CassetteTM by inserting the tip of the cassette into the cell suspension and pressing the piston.Immediately place the loaded PI-CassetteTM in the NucleoCounter® NC-100TM sample tray, press RUN.After approximately 45 s the total cell concentration (cells/ml) is presented in the bottom right.The cell count produced will normally be in the order of x 105. Divide by 10 to achieve x 106 for the following calculations.Calculate total cell number and percent viability as follows:Cell viability = [‘NV’/(‘T’ x 3)] x 100Total viable cell count = [(‘T’ x 3) – ‘NV’] x volume of cell suspensionExamples of total cell count and percent viability previously achieved when isolating acinar cells from two separate pancreas (taken from two animals) at the same time and pooled for analysis are shown in Table 1.Table 1. Examples of total cell count and percent viability previously achievedimgsrc:https://en-cdn.bio-protocol.org/attached/image/20200514/20200514002211_2335.jpgCentrifuge 50 ml tube labeled ‘Cells’ for 2 min, 130 x g, room temperature.Carefully pour off the supernatant leaving behind the loose cell pellet.",
    "Resuspend the cell pellet with 1 ml of extracellular solution.The cell suspension needs to be adjusted to a concentration of 1 x 106/ml. This is achieved by adjusting the volume to the same value as the total number of cells (Total viable cell count = 5 x 106, adjust cell volume to 5 ml). Centrifuge 50 ml tube labeled ‘Cells’ for 2 min, 130 x g, room temperature.The cells are now ready to be seeded onto the Matrigel coated Seahorse XF 24 well cell plate (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200514/20200514002303_8934.jpgFigure 2. Well allocation for blank well for XF24 cell plateRemove the XF 24 well cell plate and remove the 100 µl serum-free Seahorse media from each well.Continuously mixing the cell suspension during seeding by pipetting up and down, transfer 75 µl of cell suspension into each well leaving the following cells blank to give a total of 75,000 murine pancreatic cells per well.Place the lid back onto the XF24 cell plate and place in a 37 °C CO2 free incubator for 1 h for the cells to adhere.Whilst the cells are adhering the XF24 cartridge can be loaded with the compounds that comprise a mitochondrial “stress” test.After one hour remove the 75 µl of extracellular solution from the cells. Quickly add 450 µl pre-warmed serum free Seahorse media to every well. Return to a 37 °C CO2 free incubator until ready for use.Preparing and loading compounds for the mitochondrial “stress” testThere are two types of assays that can be performed:Standard Assay–only involves the injection of modulators included in the kit.Modified Assay–includes an additional injection of a test compound prior to oligomycin injection, and Port A is used for the testing compound.Refer to Table 2 for loading volume and port designation for compounds in different types of assays.Table 2.",
    "Loading regime for mitochondrial stress testimgsrc:https://en-cdn.bio-protocol.org/attached/image/20200514/20200514002353_5624.jpgMake a working concentration of 10x the final required concentration required from stock solutions stored at -20 °C as follows:Oligomycin stock solution in DMSO10 µl in 1 ml of Seahorse mediaFor a 10x solution of 10 µg/ml for a final concentration of 1 µg/ml.Carbonyl cyanide-4 (trifluoromethoxy) phenylhydrazone (FCCP) stock solution in DMSO3 µl in 1 ml of Seahorse mediaFor a 10x solution of 3 µM for a final concentration of 0.3 µM.Rotenone stock solution in DMSO and Antimycin A stock solution in ethanol10 µl of each in 1 ml of Seahorse mediaFor a 10x solution of 20 µg/ml for a final concentration of 2 µg/ml.Make a vehicle control solution for any well or port that is not receiving a compound or stress test with appropriate amounts of DMSO/Ethanol or other vehicle utilized for specific compounds.Remove both the sensor plate and the corresponding utility plate together from the 37 °C CO2 free incubator and remove the lid.Load the corresponding volume of each compound appropriate for the assay type into the appropriate port on the Sensor plate.Once all the compounds have been added to the ports, the lid can be replaced on to the Sensor plate and return to a 37 °C CO2 free incubator until ready for use.Oxygen consumption and lactate production analysisProgramme the Seahorse Extracellular Flux instrument as follows:Calibration.Equilibration.[Mix–2 min, Wait–2 min, Measure–2 min] x 5 to ensure a stable baseline.Inject Port A.[Mix–2 min, Wait–2 min, Measure–2 min] x 3 for standard assay oligomycin injection or x 5 typically for modified assay which gives 30 min for any test compound application.Inject Port B.[Mix–2 min, Wait–2 min, Measure–2 min] x 3 for standard assay FCCP injection and also x 3 for modified assay, oligomycin injection.Inject Port C.",
    "[Mix–2 min, Wait–2 min, Measure–2 min] x 2 for standard assay Antimycin A/Rotenone injection and x 3 for modified assay, FCCP injection.Inject Port D (modified assay only).[Mix–2 min, Wait–2 min, Measure–2 min] x 2 for modified assay only, Antimycin A/Rotenone injection.After reviewing the group definitions, plate map layout, click Start Run.After you enter the save location for your result file (following completion of the assay), the tray door on the XF24 Analyser will open.Important! Before starting calibration, ensure: The sensor cartridge fits properly on the Utility plate.The lid is removed from the sensor cartridge.Proper orientation (direction) of the sensor cartridge on the Utility plate.Place the sensor cartridge (hydrated and loaded with compounds) and Utility plate onto the tray when prompted.Press “Start” to initiate sensor cartridge calibration.Time to complete calibration is approximately 10-20 min (for assays at 37 °C). For XF assays performed at temperatures other 37 °C an additional 30 min of pre-calibration time will be added to ensure accurate data acquisition.Once sensor cartridge calibration is complete, the instrument controller will display the Load Cell Plate dialogue.Click Open Tray to eject the Utility plate and load the Cell Plate on the tray. The sensor cartridge remains inside the XF Analyser for this step.Important! Before loading the Cell plate, ensure: The lid is removed the Cell Plate.Proper orientation (direction) of the Cell Plate on the tray.After placing the Cell Plate on the tray, click Load Cell Plate to initiate equilibration.After completing equilibration, the assay will automatically begin acquiring baseline measurements (as outlined in your instrument protocol).Once the final measurement command in the instrument protocol is completed, Wave Controller software will display the Unload Sensor Cartridge dialog.Click Eject when ready to eject the sensor cartridge and cell plate. Set aside for later analysis if necessary (example - cell count normalization).",
    "After removing the sensor cartridge and cell plate, the Assay Complete dialogue will appear.Click View Results to immediately open your assay result file. Download both files for the experiment.Excel file.Xfd. File."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}