{
  "id": 17339,
  "origin_website": "Jove",
  "title": "Estimating Bilateral Atrial Function by Cardiovascular Magnetic Resonance Feature Tracking in Patients with Paroxysmal Atrial Fibrillation",
  "procedures": [
    "This research procedure closely adheres to the rules established by the China-Japan Union Hospital of Jilin University's human research ethics committee (No. 2021092704). Before radiofrequency ablation, CMR was required for all patients with atrial fibrillation. Hence our study did not place an increasing burden on patients. Right ventricular two-chamber cine bSSFP sequences were added, which extended the time of each examination by 2 min. Before the test, written informed consent was obtained from each subject. Patients who refused the further sequence were eliminated from the experiment. Patients with poor image quality or atrial fibrillation (AF) during the examination were also excluded.\n1. Preparation before scanning\nCheck the patient information: Patients' heart rate, blood pressure, weight, and height were accurately measured. The on-duty physician formulates an introductory sequence based on the health history and other supplementary investigations and confirms quick adjustments to the analysis based on the actual circumstances.\nExclude patients having MRI contraindications including renal insufficiency with eGFR ≤ 30 mL/min/1.73 m2, cardiac implantable electronic devices, implanted metal devices, electronic cochlear implantations, etc.\nPlace the patient in the supine position with their heads up and arms at their sides. Due to the length of the examination, do not raise the upper limb above the head.\nClean the skin and place the electrodes according to the manufacturer's instructions. Ensure that the non-metallic electrocardiogram electrodes are correctly placed on the surface of the front chest wall to obtain precise electrocardiogram gating. An accurate R wave is required to reduce CMR artifacts.\n\tNOTE: After the electrocardiogram electrodes are connected, the patient's electrocardiogram is displayed on the computer in real-time to measure the R wave. Reposition the electrodes on the patient's chest if the R wave is not clear enough.",
    "Place a 16-channel cardiac coil flush to the upper edge of the shoulder blade. Ensure the coil is in-line with the heart and placed to the left.\nAsk the patients to hold their breath at the end of exhalation and ask them to maintain the same breath motion amplitude to ensure the consistency of the scanning position. The breath-hold duration was 10-18 s. Patients were provided with sufficient time for respiratory training. During the examination, the heart rate and time of breath-holding were noted.\n2. CMR scanning\nUse a three-plane localization method to locate the long-axis cine images [two-chamber, three-chamber, and four-chamber views of the left ventricle (LV)] and short-axis of the ventricle (i.e., covering the entire LV). See Figure 1 for the positioning process.\n\t\nAcquire the orthogonal multi-slice localizers in the heart's transverse, sagittal, and coronal slices (Figure 1A).\nObtain a two-chamber localizer by selecting a transverse slice at the middle of the ventricle from the transverse images. Set a slice vertically on the transverse image, parallel to the septum, and through the apex of the LV (Figure 1B).\nAcquire the four-chamber localizer by positioning the slice vertically on the two-chamber localizer through the apex of the heart and the center of the mitral valve (Figure 1C).\nAcquire the short-axis localizer by positioning the slice vertically on the four-chamber and two-chamber localizers. This slice should be perpendicular to the septum on the four-chamber localizer and at a right angle to the long axis on the two-chamber localizer (Figure 1D).\nBased on the above localizers, generate the following standard views.",
    "Obtain a four-chamber view.Slice (positioning line) will automatically appear, then position the slice through the center of the LV and vertically on the septum on the short-axis localizer. Place the slice through the apex of the heart and adjust to the center of the mitral valve on the two-chamber localizer to get the four-chamber view. Click on Apply to get the four-chamber view (Figure 1E).\nObtain a two-chamber view. On the short-axis localizers, position the slice parallel to the septum, and adjust it to the center of the LV. On the four-chamber view, place the slice parallel to the septum, and through the apex of the LV (Figure 1F).\nObtain a three-chamber view: Position the slice through the center of the aorta and the left atrium on the short-axis localizers. Ensure the slice passes through the apex of the LV on the four-chamber view (Figure 1G).\nObtain short-axis views. Position the slices vertically on the septum and parallel to the mitral annulus on the four-chamber view. Then, arrange the slices vertically on the connection line between the apex of the LV and the center of the mitral annulus on the two-chamber view (Figure 1H).\nObtain a two-chamber view of the right ventricle (RV) by positioning the slice parallel to the septum and shifting the slice into the center of the RV on the short-axis view. Position the slice parallel to the septum on the four-chamber view, and then shift the slice into the center of the RV. Do not cut the LV into parts (Figure 1I).\nObtain the CMR cine sequences of the two- and four-chamber views of the left and right ventricles, the three-chamber view of the left ventricle, and the short-axis view of the left ventricle using a retrospective ECG gated bSSFP sequence on a 3.0-T MR scanner.",
    "Use the main parameter settings as follows: matrix = 192 x 192, field of view (FOV) = 340 mm x 340 mm, repetition time (TR) = 3.0 ms, echo time (TE) = 1.7 ms, flip angle (FA) = 45°-55°, temporal resolution = 30-55 ms, slice thickness = 8 mm, and slice gap = 2 mm.\n\t\tNOTE: All the patients should be in the sinus rhythm during CMR imaging.\n3. Ventricular and atrial function analysis\nVentricular function analysis\n\t\nClick on PACS, then input Patient ID, and use Search Current Patient to find the images. Next, click on Retrieve to transfer the images to the cardiovascular post-processing workstation. Use the Function Multiplanar module (ventricular function analysis with multiplanar) to analyze the ventricular function.\nChoose the short-axis cine of the ventricle and click on the Detect LV/RV Contours at ED/ES Phases.\n\t\tNOTE: The contours of end-systolic (ED) and end-diastolic (ES) ventricles, endocardium, and epicardium are in all slices and traced automatically. The LV cavity includes the ventricular outflow tract. If the automatic identification is not accurate, it should be adjusted manually. The cardiovascular post-processing workstation automatically calculates the left ventricular ejection fraction (LVEF), left ventricular end-diastolic volume (LVEDV), left ventricular end-systolic volume (LVESV), left ventricular end-diastolic volume index (LVEDVI), left ventricular end-systolic volume index (LVESVI), right ventricular ejection fraction (RVEF), right ventricular end-diastolic volume (RVEDV), right ventricular end-systolic volume (RVESV), right ventricular end-diastolic volume index (RVEDVI), and right ventricular end-systolic volume index (RVESVI).\nLeft atrial function analysis\n\t\nUse the Tissue Tracking (Feature Tracking) module to measure the LA volumes and strains in the four-, three- and two-chamber cine CMR images of the LV.\nManually contour the endocardial and epicardial left atrium (LA) borders at the end of the left atrial systole and diastole (Figure 2).",
    "Exclude the pulmonary veins and left atrial appendage from the LA outline.\nOnce the contouring is completed, ensure that the ROI Series (Segment number selection key) is shown as 6 (the four- and two-chamber CMR cine images of the LV are each divided into six segments).\nClick on the Perform Strain Analysis button for the software to automatically track on-screen pixels during the entire cardiac cycle (25 frames/cardiac cycle).\nEnsure that the software automatically calculates the left atrial volume/time curves, the global and segmental strain, and the strain rate.\nUse the volume/time curves to obtain the maximum volume of the left atrium (LAVmax), the left atrial active pre-systolic volume in early left ventricular diastole (LAVpre-A), and the minimum volume of the left atrium (LAVmin). Calculate the LA total, passive, and active emptying fractions (EF) as follows19:\nimgsrc://cloudfront.jove.com/files/ftp_upload/63598/63598eq01.jpg\nimgsrc://cloudfront.jove.com/files/ftp_upload/63598/63598eq02.jpg\nimgsrc://cloudfront.jove.com/files/ftp_upload/63598/63598eq03.jpg\nObtain the peak global longitudinal strain in systole (Sls) and active strain (Sla) from the strain curve of the left atrium (Figure 2) and calculate the difference between the Sls and Sla as the passive strain (Sle)19.\nAcquire the peak strain rate of the left atrium in left ventricular systole (SRs) (the first positive wave peak value on the curve), the peak strain rate in early left ventricular diastole (SRe) (the first negative wave peak value on the curve), and the peak strain rate in late left ventricular diastole (SRa) (second negative wave peak on the curve) from the strain rate curve19 (Figure 2).\nRight atrial function analysis\nObtain the right atrial volumes and strains using the Tissue Tracking (Feature Tracking) module with the four- and two-chamber RV cine CMR images.\nManually contour the endocardial and epicardial right atrium (RA) borders at the end of the right atrial systole and diastole (Figure 3).",
    "Exclude the vena cava and right atrial appendage from the RA outline.\nThe subsequent steps were the same as steps 3.2.4 and 3.2.6.\nObtain the functional parameters of the right atrium using steps 3.2.3 and 3.2.5."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}