{
  "id": 6992,
  "origin_website": "Bio",
  "title": "Fluorescence Measurement and Calibration of Intracellular pH in Starfish Oocytes",
  "procedures": [
    "imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200921/20200921230731_9709.jpg Figure 3. Flowchart representing the procedure overview (Procedures A to F) Oocyte preparation (Video 1)<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Oocyte Preparation. This video was made at Ochanomizu Univ. according to guidelines from the Ochanomizu Univ. on Animal Care and approved by the Animal Research Ethics Board of Ochanomizu University.Maintain starfish (Asterina pectinifera) in laboratory aquariums supplied with circulating seawater at 14 °C (Murabe et al., 2020).Isolate oocytes or ovaries from female animals and treat them with calcium-free artificial seawater to eliminate follicle cells.Maintain follicle-free oocytes in artificial seawater (ASW) until use. Microinjection of BCECF into oocytes (Video 2)<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 2. Microinjection techniqueGenerate a glass micropipette having a constriction of a few micrometers in diameter to control the flow speed out of the micropipette (Hiramoto, 1974; see also Materials and Reagents 1 and Figure 2A).Fill the constricted micropipette with silicon oil and connect it to the screw-controlled microinjector ( IM-9B  Narishige).Microscopically aspirate 20 pl BCECF solution into the micropipette (Figures 2A-2C).Microinject the BCECF solution into a starfish oocyte sandwiched between the two coverslips of an oocyte holder (Chiba et al., 1992) (Figures 2D and 2E).Incubate oocytes injected with BCECF in ASW for 1 h at 23 °C before measuring the BCECF fluorescence intensity or the pHi.Note: Incubation for 1 h is required for diffusion of injected BCECF.Image acquisition (sequence-imaging) of the oocytes injected with BCECF before and after 1-MA stimulation (Video 3)<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 3. pHi measurement using BCFCFTo evaluate the camera “noise”, acquire a dark image (no light is delivered to the CMOS camera controlled by the HCImage acquisition system, which is connected to a fluorescence microscope equipped with differential interference contrast (DIC) optics including a 4× 0.20 NA CFI super Fluor lens).",
    "Set oocytes pre-injected with BCECF (as shown in Procedure B) in a manipulation chamber for 1-MA treatment at 23 °C (Figures 2F and 2G).Acquire a DIC image of 8-15 oocytes (Figure 4A).Acquire a fluorescence image of oocytes to configure the region of interest (ROI) (Figure 4B): surround the cytoplasm excluding undiffused BCECF and the GV area in the oocyte image to define the ROI, using the HCImage Analysis software. Most of the injected BCECF is diffusely distributed throughout the cytoplasm 1 h after injection; however, a small, brighter fraction, is usually retained at the site of injection near an oil drop. Importantly, this brighter region should be excluded from the ROIs (Figures 4C and 4D).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200921/20200921233930_4903.jpgFigure 4. Oocytes’ images acquisition. A. A representative oocytes’ DIC image. B. A fluorescence image of oocytes injected with BCECF. C. The ROI is defined using a green line. The background area is also colored in green. D. An enlarged oocyte image showing the ROI. The GV area is excluded from the ROI since GVBD causes a rapid change in fluorescence intensity.Select an area without oocytes to get the background fluorescence (Figure 4C).Before treatment with 1-MA, acquire fluorescence microscopic images of BCECF-injected oocytes, excited every 10 s at 436 nm and 495 nm for more than 5 min. This excitation alternation is obtained from a Xenon lamp using a filter wheel under the computational control of the HCImage acquisition system. Then, the emitted light passes through a dichroic beam splitter at 505 nm and through a 510-560 nm emission filter, and finally through the CMOS camera and is recorded by the HCImage acquisition system.Pause the CMOS camera, and aspirate 25% of the volume of ASW and subsequently add 25% of the volume of ASW containing 2 µM 1-MA (final concentration: 0.5 µM).",
    "Immediately after addition of 1-MA, turn on (or resume) the CMOS camera to obtain fluorescence images of the oocyte for 2-30 min. Refer to the original study for more detailed information regarding the procedure and prototypical images (Hosoda et al., 2019; Figure S5F, left panel) (see also Video 3).Calculation of the average fluorescence intensity ratios, using the recorded images of BCECF-injected oocytes and the HCImage analysis systemOpen an Image Display window showing the fluorescence microscopic image sequence of the oocyte. If oocytes move during recording, new ROIs should be defined according to the procedure in Step C4.Calculate the fluorescence intensity ratios between 436 nm and 495 nm excitation from 8-15 oocytes, using the HCImage Analysis software.Average the ROI ratios of 8-15 oocytes at each time point.After the experiments, convert the average ratios to pHi, using the procedure outlined in Procedure F.pHi clamping with modified ASW (sodium-free ASW containing CH3COONH4) and calibration after injection of standard solutions with known pH valuesNote: For oocytes treated with modified ASW at pH 6.8, the pHi is expected to be clamped at ~7.0, because the pHi values become ~0.2 higher than the pH values of the modified ASW (Moriwaki et al., 2013; Hosoda et al., 2019).To calibrate accurately the clamped pHi, inject different sets of oocytes with at least three types of pH-standard solutions. When the actual (or real) pHi is higher than the known pH of the injected standard solution, the BCECF fluorescence intensity ratio will decrease after injection since the pHi also decreases upon injection of the standard solution at a lower pH. Conversely, when the actual pHi is lower than the known pH of the injected standard solution, the BCECF fluorescence intensity ratio will increase. Thereafter, the actual pHi should be between the pH values of the two injected standard solutions.",
    "When the actual pHi is equal to that of the injected solution, the intensity ratio does not change. Using this method, pHi differences as low as 0.05 can be detected. In this section, taking as an example modified ASW at pH 6.8, the pHi of unstimulated oocytes was clamped, and different sets of clamped oocytes were injected with different pH-standard solutions (pH 7.00, 7.05, 7.10) to estimate the values of clamped pH; readers can expect to see three different outcomes as shown in Figures 5A, 5B and 5C, that allowed the calibration of pHi.Remove BCECF-injected oocytes from the oocyte holder (Figure 2D) after Procedure B, and recover them in 20 μl ASW, using an adjustable-volume micropipette. Then, transfer them immediately to 1 ml sodium-free ASW containing CH3COONH4 at pH 6.8 (modified ASW pH 6.8). Thereafter, gently agitate the oocytes for 15 s.Transfer the oocytes in 20 μl modified ASW at pH 6.8 to freshly modified ASW (1 ml) at pH 6.8, and gently agitate the oocytes for 15 s. Repeat this procedure 5 times to completely eliminate Na+ (with modified ASW at pH 6.8).Sandwich immature oocytes with two cover glasses using the oocyte holder (Figure 2D).Define the ROI of an oocyte and select an area without oocytes, as background fluorescence–Steps C4 and C5.Note: The procedures in Steps E1 to E4 should be completed within 20 min to obtain reproducible data. Record a fluorescence image sequence of an oocyte for ≥ 100 s.To inject the pH-standard solution, pause the CMOS camera.Inject oocytes with 2% of the volume per oocyte of a pH-standard solution at pH 7.00; of note modified ASW at pH 6.8 may clamp pHi at ~7.0 (Moriwaki et al., 2013; Hosoda et al., 2019).",
    "Rapidly turn on the CMOS camera system to record the changes in the fluorescence intensity ratio for at least 20 s.Measure the average fluorescence intensities inside the ROI and calculate the ratio of the averaged intensities between the 436 nm and 495 nm excitation wavelengths, using the HCImage analysis software. A typical result is shown (Figure 5A). In this particular example, the fluorescence intensity ratio decreased upon injection of the pH-standard solution. Thus, the clamped pHi is estimated to be higher than pH 7.00. Therefore, in the next step, a standard solution with a pH higher than 7.00 should be used, in a way to cause an increase in the fluorescence intensity ratio, and ultimately to determine the real pHi. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200921/20200921233903_3597.jpgFigure 5. Estimation of the pHi in oocytes treated with modified ASW at pH 6.8. A. The standard solution at pH 7.00 was injected between 100 s and 140 s. Clamped pHi was estimated to be higher than pH 7.00 in this oocyte. B. The standard solution at pH 7.10 was injected between 125 s and 185. Clamped pHi was estimated to be lower than pH 7.10. C. The pH-standard solution at pH 7.05 was injected between 125 s and 220 s. No change in the BCECF fluorescence intensity ratio was observed. Therefore, the clamped pHi is estimated to be pH 7.05.After the procedure described in Steps E1-E6, inject the oocytes with 2% volume per oocyte of a standard solution at pH 7.10; because pH 7.00 decreased the fluorescence intensity ratio (Figure 5A), pH 7.10 is expected to increase this ratio.Turn on the CMOS camera system and calculate the fluorescence ratio for the standard solution at pH 7.10, as mentioned in Steps E7-E9.A typical result is shown (Figure 5B).",
    "As expected, the fluorescence intensity ratio increased upon injection of the pH-standard solution. Thus, the clamped pHi is estimated to be lower than pH 7.10 and higher than pH 7.00. Therefore, to find out a standard solution with an adequate pH value causing no change of the fluorescence intensity ratio, standard solutions 7.00 ≤ pH ≤ 7.10 should be considered.After the procedure described in Steps E1-E6, inject the oocytes with 2% of the volume per oocyte of a standard solution at pH 7.05, and then turn on the CMOS camera system and calculate the respective fluorescence ratio, as mentioned in Steps E7-E9.A typical result is shown (Figure 5C). As expected, the fluorescence intensity ratio did not change upon injection of the pH-standard solution, indicating that the actual pHi should be equal to that of the injected solution (= pH 7.05).Calibration of pHi in normal seawaterNote: The procedure in F should be conducted on the same day when the procedure in C is performed.To conduct a two-point calibration, treat immature oocytes (n = 8-15) with modified ASW to clamp the pHi at higher and lower values, and obtain the respective BCECF high- and low-intensity ratios. Usually, modified SW at pH 6.4 (pHi ~6.6) and that at pH 7.3 (pHi ~7.5) can be used. The actual pHi of oocytes in modified ASW is estimated as described in Procedure E.Calculate the average values for each point.Plot fluorescence ratios against pHi 6.6 and pHi 7.5 to obtain a standard linear calibration graph/function. More detailed information regarding this procedure is already provided in the original study (Hosoda et al., 2019; Figure S5D and E). Convert the ratio data from procedure E to pHi values, using the standard linear calibration graph/function.",
    "Again, refer to the procedure in the original study for more detailed information (Hosoda et al., 2019; Figure S5F)"
  ],
  "subjectAreas": [
    "Cell Biology",
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}