{
  "id": 5485,
  "origin_website": "Bio",
  "title": "Lentiviral Barcode Labeling and Transplantation of Fetal Liver Hematopoietic Stem and Progenitor Cells",
  "procedures": [
    "Lentiviral barcode libraryThe generation of barcode libraries has been previously reviewed (Bystrykh et al., 2014). The complexity and distribution of barcodes in the virus library impact the risk of labelling of two cells with the same barcode and therefore poses a constraint on the number of single cell fates that can be faithfully traced. Thus, these properties need to be empirically determined for each new barcode library and virus prep (Lu et al., 2011; Naik et al., 2014; Bystrykh and Belderbos, 2016). As a rule of thumb the number of cells traced per recipient should not exceed 10% of the library diversity (Naik et al., 2014). Furthermore, the virus library needs to be titrated using the donor cell type of interest prior to experiment as transduction efficiency can vary greatly from cell type to cell type. In our recent study, a previously characterized barcode library was used (Lu et al., 2011). Timed pregnancy set-upDay -14In the afternoon, add two female mice into each cage containing one male mouse (Figure 2).The following morning, separate females from male and check for vaginal plugs.Note: Detection of a vaginal plug at this time point is counted as 0.5 d.p.c. The presence of a vaginal plug is not a guarantee of the female being pregnant. Likewise, the lack of a vaginal plug does not mean the female is not pregnant. To increase chances of fertilization, more than one cage of timed pregnancy should be set up. After E12 females can be palpated for abdominal distention, bilateral bulging and weight increase to confirm pregnancy. However if the female is pregnant with low number of embryos it can be difficult to distinguish. Transduction and cell sorting preparationsDay 0Transduction preparationsDilute Retronectin with sterile PBS to 40 μg/ml.",
    "Coat one well per biological replicate by adding 100 μl of the diluted Retronectin from step C1a to a non-culture treated 96-well plate. Note: If more than one biological replicate is desired, a litter of 6 embryos could be split up into 2 equal biological replicates to be transduced in 2 separate wells (Figure 2). Optional: Transduced LSKs from each biological replicate can later be divided into two equal parts and transplanted into two recipients to facilitate data interpretation (see Notes) (Figure 2).Coat one additional well for an untransduction control.Store the plate at 4 °C overnight.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170417/20170417223319_7559.jpgFigure 2. Example of experimental animal usage based on estimated number of pups and cell yieldToolsAutoclave dissection tools, pestle and mortar, tissue paper, Eppendorf tubes.Cell sorting and culturing preparations Optional: The following steps can be performed on Day 1.Prepare LSK antibody cocktail for FACS (store at 4 °C in the dark until use).Notes:  The fluorochromes listed here are suggestions and can be substituted with other colors. Lineage antibodies include: CD3 PE-Cy5, Gr1 PE-Cy5, Ter119 PE-Cy5, B220 PE-Cy5.table:",
    "﻿0,1,2,3\nAntibody,fluorochrome,Dilution,Final concentration (μg/100 μl)\nc-Kit,APC,1:200,0.1\nSca1,PE-Cy7,1:200,0.1\nLineage Antibodies,PE-Cy5,1:400 each,0.05 each\nPrepare antibody dilutions for single stains and appropriate staining controls.Prepare cytokine mix in SFEM containing 1% P/S (store at 4 °C until use).table:\n﻿0,1\nCytokine,Final concentration (ng/ml)\nSCF,50\nIL6,50\nFLT3,50\nIL3,10\nIL7,10",
    "Cell sorting and transductionNote: All dissections should be performed in appropriate laboratory areas and cell preparations in sterile biosafety cabinets. Day 1Harvesting of total BM support cellsIn the morning, euthanize mouse for support cells (e.g., cervical dislocation or CO2 asphyxiation) (Figure 2).Dissect hind leg bones (femur, tibia and iliac crest) and collect in 50 ml tube with cold (4 °C) staining buffer (see Recipes). Crush bones using pestle and mortar.Make single cell suspension by gently pipetting up and down with a 1 ml pipette tip.Filter through a 40 µm cell strainer and adjust volume to 10 ml with staining buffer. Store at 4 °C until intravenous injections on Day 2.Harvesting of 14.5 d.p.c. FL donor cellsEuthanize the pregnant female (e.g., cervical dislocation or CO2 asphyxiation) in the morning. Lift skin over the peritoneal cavity and make a small incision with scissors.Pull out the uterine horns and release the uterus by cutting the cervix.Dissect the embryos from the uterine membranes in a 60 mm Petri-dish filled with 5 ml cold (4 °C) staining buffer.Place an embryo on autoclaved tissue paper and use fine tipped tweezers to isolate the FL.Transfer the FL to a new 60 mm Petri-dish with 1 ml with cold staining buffer per FL and repeat for all embryos, combining only the FLs intended for the same biological replicate into the same Petri-dish.Remove any attached connective tissue and intestine prior to dissociating by gentle pipetting using a 1 ml pipette tip.Filter the resulting single cell suspension through a 50 µm cup filter and repeat for biological replicates.Count the cells and centrifuge cells at 350 x g for 5 min at 4 °C.",
    "Note: Expect approximately 40 x 106/FL including red blood cells, although some variation in cell number can be expected (depending on loss of cells during dissection and size of the embryo). Remove the supernatant and prepare for Ter119 depletion.Ter119 depletion using MACSTer119 is expressed by mature erythrocytes and erythroid progenitors which are the most abundant cells in E14.5 FL. Depletion of these cells enrich for the LSK population and shortens sorting time.Resuspend the cell pellet to a volume of 50 μl staining buffer/107 cells and add Ter119 biotin antibody to a final concentration of 0.5 μg/ml. Incubate at 4 °C for 25 min.Add 10 ml cold staining buffer and centrifuge at 350 x g for 5 min at 4 °C, remove supernatant.Resuspend the pellet to a volume of 40 μl staining buffer/107 cells and add 10 μl of anti-Biotin MicroBeads/107 cells.Incubate at 4 °C for 15 min.Add 10 ml staining buffer and centrifuge at 350 x g for 5 min at 4 °C, remove supernatant.Resuspend cell pellet in 500 μl staining buffer.Put MACS columns in MACS separator magnet, placing a 50 µm cup filter on top of each column.Equilibrate the columns by running 3 ml buffer through each and discard the liquid flow through.Place labeled collection tubes under each column and add the 500 μl samples through the filter onto the column.Rinse the original sample containing tube with an additional 500 μl staining buffer and add onto the column through the same filter.Add 3 x 3 ml buffer onto each column to rinse off unbound cells. Note: For each round of 3 ml rinse, wait until the existing buffer has almost entirely run through before adding the next 3 ml. Count the cells in the 10 ml flow-through.Set aside approximately 200K cells for FACS staining controls.",
    "Centrifuge the remaining cells at 350 x g for 5 min at 4 °C and remove supernatant, the cell pellet should be white. Cell staining and sortingOur workflow using the BD FACS Aria IIu or III is briefly described below.Resuspend the cell pellets in the LSK antibody cocktail (step C3a) at a volume of 100 μl/107 Ter119 depleted cells. Stain the sample and appropriate staining controls in the dark at 4 °C for 30 min.For each sample prepare one Eppendorf tube containing 100 μl cold staining buffer for post-sort purity check and one containing 500 μl SFEM to collect the sorted cells.Rinse stained cells with staining buffer, centrifuge at 350 x g for 5 min at 4 °C and remove supernatant. Resuspend samples in staining buffer containing 7AAD to a final concentration of 1 μg/ml 7AAD. Note: Volume of buffer to resuspend cells in for sorting depends on the cell number and sort settings (e.g., 7 x 106 cells can be resuspended in 700 μl when sorted on BD FACS Aria III at approximately 4,000 events/sec, flow rate < 4, purity mask 0-32-0, using a 70 μm nozzle).Set-up staining compensation matrix using single stained controls.Set LSK gates as shown in Figure 3.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170417/20170417214623_5251.jpgFigure 3. FACS plots for LSK HSPC gating during cell sorting. Fluorescence minus one (FMO) controls for Sca1 and c-Kit are shown to illustrate the stringent gating that we draw to maximize sort purity (reanalysis plot). The expected HSC content within the FL LSK gate varies from 4-10% in our experience.Take appropriate precautions to ensure sorting purity of > 95%.Sort LSK cells for all samples into prepared collection tubes containing 500 μl cold SFEM. Note: Sort at least 11,000 LSKs for each planned recipient to compensate for cell loss in steps E9-E10.",
    "It is possible to obtain enough LSKs from 3 FLs for 2 recipients if technical replicates are desired (see Notes).Record the cell number yields from the sort and store tubes on ice.Transduction This step should be performed in an appropriate cell culture hood using procedures approved for lentiviral transduction. Note: HSPCs from fetal liver and adult bone marrow differ in transduction efficiency with less virus required to achieve the same transduction efficiency in fetal HSPCs. Before starting the protocol titrate your lentiviral barcoding library specifically for the population of choice, determining the amount of virus needed to achieve a transduction efficiency that ensures that the number of transduced cells per recipient does not exceed 10% of the complexity of the lentiviral barcode library. For an estimated barcode complexity of 80K (Lu et al., 2011), we aimed for a transduction efficiency of 15-30% meaning that 1,500-3,000 cells out of the 10K cells injected per recipient mouse were barcoded (Figure 4). This routinely yielded hundreds of cell fates traced in each recipient out of which around 60 clones demonstrated functional characteristics of active HSCs and minimal instances in which the same barcode transduced more than one cell (Kristiansen et al., 2016) (see Notes).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170417/20170417214749_9609.jpgFigure 4. HSC frequency within the FL LSK population. (Left) representative FACS plots for FL HSCs defined by LSK CD48-CD150+. (Right) %frequency of HSCs within LSK compiled from 6+3 individual embryos from 2 litters in 2 separate experiments. Remove Retronectin from the wells. Immediately add 200 μl 2% BSA (Note: BSA in Iscove’s MDM diluted in PBS.) to each of the coated wells.Incubate the plate for 30 min at room temperature.Set aside approximately 300 LSK cells in a separate tube for an untransduced control.",
    "Centrifuge tubes containing LSK cells at 350 x g for 5 min at 4 °C and remove supernatant.Note: When working with low numbers of sorted cells, every precaution to minimize cell loss must be taken to get reproducible results. Therefore, omit further counting and filtering steps and always leave an appropriate volume when removing supernatant following centrifugation so as not to disturb the cell pellet.Resuspend cell pellet to a final volume of 150 μl cytokine mix. Remove 2% BSA from the coated wells and plate the sorted cells from each biological replicate into a single well. Also plate the LSK cells set aside from step D5d into the well designated for the untransduced control (step C1c).Add the previously optimized amount of lentivirus to each well except for the untransduced control well.Gently rock the plate to disperse the virus.Incubate in humidified CO2 incubator at 37 °C and 5% CO2 overnight.Irradiation of recipient miceIrradiate recipients with 2 x 450 cGy with 3 h between the doses. Transplantation should be performed within 24 h of the first dose.Note: Split dose irradiation is more gentle on the mice while still achieving the desired effects of lethal myeloablation. Recipient mice do not need treatment with antibiotics prior to irradiation.Add Ciprofloxacin to a final concentration of 125 mg/L in the drinking water for 14 days. Intravenous injectionsThe LSK population is heterogeneous containing stem and progenitor cells that survive and proliferate differently in culture. To minimize cell loss we omit additional cell counting steps and treat the donor cell number on Day 2 as equivalent to the number of sorted cells from Day 1.  Note: The following steps must strictly adhere to biosafety protocols for lentiviral handling and approved animal use protocols.",
    "Day 2In the morning, filter support cells from Day 1 through a 40 µm cell strainer as significant aggregation may have taken place over night. Count the cells.Note: The cell count includes red blood cells.Centrifuge support cells at 350 x g for 5 min at 4 °C and resuspend in cold sterile PBS to a concentration of 200K/100 μl.Collect each transduced LSK cell sample in autoclaved Eppendorf tubes containing 500 μl cold PBS.Note: To minimize cell loss associated with filtering, donor cells are collected directly from the well for transplantation. Rinse each well with at least 2 rounds of 200 μl PBS to recover all cells and combine in corresponding Eppendorf tubes. Note: Check that all cells have been harvested from the wells using a microscope.Transfer a small volume of each sample back to their original well for transduction efficiency readout on Day 3. Add cytokine mix to a final volume of 150 μl and incubate the cells at 37 °C in 5% CO2 overnight.Add an additional 500 μl cold PBS to each sample tube and centrifuge at 350 x g for 5 min at 4 °C.Dispose of lentiviral supernatant according to appropriate biosafety protocols. Add 200K support cells (100 μl from step E2)/10K sorted and transduced FL LSKs and add 1 ml cold PBS. Centrifuge samples at 350 x g for 5 min and discard supernatant according to appropriate biosafety protocols.Resuspend the pellet in 275 μl cold PBS/11,000 sorted and transduced FL LSKs (step D4i).Inject 250 μl (the equivalent of 10,000 sorted and transduced LSKs) of sample into the tail-vein of each recipient using a 29 gauge ½ inch 1 ml needle. Note: We routinely warm up the recipient mice for 5 min under a heat lamp to facilitate intravenous injections.",
    "Transduction efficiency readoutDay 3Collect the transduced cells that were set aside on Day 2 for transduction efficiency readout (step E5) and the untransduced control into individual FACS tubes.Centrifuge samples at 350 x g for 5 min at 4 °C and remove supernatant.Resuspend each sample in 150 μl staining buffer containing 7AAD.Analyze by FACS the percentage GFP+ events among of live (7AAD-) cells (Figure 5).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170417/20170417223356_4023.jpgFigure 5. Example of GFP transduction efficiency readout on Day 3. 7AAD- singlet LSK cells from untransduced control (left) and transduced sample (right) are shown.Peripheral blood analysis 4-8 weeks post transplantationWe recommend checking initial engraftment of GFP+ barcoded cells in the peripheral blood. This is done by tail vein bleeding of recipient mice and assessment the percentage GFP+ cells e.g., among granulocytes and B cells using FACS. Note: We frequently observe a higher GFP% in the peripheral blood compared to the transduction efficiency readout on Day 3 with FL HSPCs. This is likely due to a preferential transduction of highly proliferating HSPCs that engraft better.Barcode extractionClonal dynamics of long-term HSCs stabilize after approximately 12 weeks post transplantation (Verovskaya et al., 2013). Therefore, we recommend reading out barcode distribution no earlier than 16 weeks post transplantation.16-20 weeks post transplantationCell sorting and lysisCell populations of interest based on the specific questions posed are FACS sorted. Cells are sorted into 500 μl staining buffer in non-stick tubes as described for step D4 and can be stored at -80 °C as cell pellets initially.Note: Granulocytes have a short turnover time of a few days and is therefore a good representation of recent HSC activity. Lymphocytes on the other hand can survive for weeks and even months and will therefore contain barcodes derived from both long and short term progenitors at the time of barcode labelling.Prepare cell lysis buffer (see Recipes).",
    "Cell pellets are lysed for genomic DNA in 100 μl cell lysis buffer/sample (2 h at 56 °C + 10 min at 95 °C to inactivate the proteinase K) within a week of sorting and can subsequently be stored at -20 °C.Note: With a smaller number of cells it is recommended to sort directly into lysis buffer for immediate lysis. Cell numbers are a limiting factor to getting a good sequencing coverage of the population. Library preparation and barcode deep sequencingGenomic DNA is purified using Ampure XP beads according to manufacturer’s recommendations.Measure genomic DNA concentration using a high sensitivity method e.g., the Qubit Fluorometer and the Qubit dsDNA HS Assay Kit.Up to 100 ng DNA from each sample is divided equally into two technical replicate PCR reactions (50 ng each) using the appropriate primers and a high fidelity DNA Taq polymerase (e.g., Q5 Taq DNA polymerase, NEB) for amplification of the barcode fragment (Figure 1). The amplified fragments are purified using Ampure XP beads according to manufacturer’s recommendations.Optional: Depending on the design of PCR primers and the choice of sequencing platform, a second step of PCR amplification can be performed to add multiplexing adapters.Amplicons are quantified using the Bioanalyzer HS DNA Analysis Kit and according to manufacturers’ instructions. A product of the correct size without contamination of primer dimers is critical for successful sequencing. The presence of primer dimers can be removed with another round of Ampure XP bead purification according to manufacturer’s recommendations.Pool equivalent amounts of amplified and indexed barcode libraries for sequencing–the required concentration of product depends on the sequencing platform of choice. Note: The extent of multiplexing should be informed by the read capacity of the sequencing platform of choice and the expected complexity of your barcoded cells.",
    "Sequencing is performed by experienced technical personnel according to manufacturer’s instructions.Note: We have thus far had good success using the Illumina MiSeq system (MiSeq Reagent Kit v3 150-cycle, Illumina) and the Ion PGM (Ion 314 Chip Kit v2, Thermo Scientific) platforms."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}