{
  "id": 3727,
  "origin_website": "Cell",
  "title": "A protocol for simultaneous in vivo juxtacellular electrophysiology and local pharmacological manipulation in mouse cortex",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPair-pipettes assembly\nTiming: 1 h\nThis part involves preparing two different types of pipettes: (1) a recording pipette for juxtacellular recording and labeling, and (2) an infusion pipette for local infusion of solutions, as well as (3) the method for connecting the two pipettes together (pipette pairing; Figure 1[href=https://www.wicell.org#fig1]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/447-Fig1.jpg\nFigure 1. Pipette pair assembly\n(A) The produced pipette pair visualized under a microscope.\n(B) Custom-made setup for pipette pair assembly. Pipettes are secured in the clamps; the recoding pipette is secured in the vertical clamp (Manipulator 1) and the infusion pipette is secured in the horizontal clamp (Manipulator 2) which moves back and forth as well as left to right. Under microscopic visualization and using Z nub, we first vertically align the recoding pipette with the infusion pipette; then, using nubs X (for back and forth movement) and Y (for left and right movement), the infusion pipette is juxtaposed to the recoding pipette. Finally, the pipettes are fixed together using a hot glue gun.\n(C) Manipulator 1 (front view) with vertical clamps and the recording pipette.\n(D) Manipulator 2 (top view) with horizontal clamp and the infusion pipette.\n(E) An example pipette pair in the setup.\nRecording pipette\nWe use Sutter Micropipette Puller (Model P-97) and Capillary Glasses with 1.5 mm outer diameter (OD) and 0.86 mm inner diameter (ID).\nPull pipettes in 4 steps to produce a tip diameter of ∼0.5–1 μm with a resistance of 5–10 MOhm.\nCheck the pipette under 10× magnification of a microscope to verify the proper tip diameter is achieved.\nSecure the pipette in an electrode storage jar.\nInfusion pipette",
    "We use the same puller and 2 mm OD capillary glass pipettes. Pipettes are pulled in 1 step to make a long narrow tip. Using a pair of fine forceps, break 1–2 mm of the tip of the pipette to achieve a tip diameter of 20–50 μm.\nCheck the pipette under 10× magnification of a microscope to verify the proper tip diameter.\nSecure the pipette in an electrode storage jar.\nNote: Adjust your program to make long narrow tips. This would minimize the damage induced by insertion of the paired pipette.\nPipette pair\nWe have custom built a setup for pairing recoding and infusion pipettes (Figure 1[href=https://www.wicell.org#fig1]B).\nSecure the recording pipette in the vertically-moving (Z axis) manual manipulator (Manipulator 1, Figures 1[href=https://www.wicell.org#fig1]B and 1C) and the infusion pipette in the horizontally moving (X and Y axes) manipulator (Manipulator 2, Figures 1[href=https://www.wicell.org#fig1]B and 1D).\nNote: Manipulators 1 and 2 are parts of a manual manipulator (Narishige MM-3 Micromanipulator) separated to move independently.\nHold the infusion pipette with a pair of forceps and attach ∼5 mm of tubing on the non-tapered end of the pipette.\nNote: This step helps the infusion pipette to attach to the tube originating from syringes and prevents the leakage.\nFirst position the pipettes parallel to each other using vertical manipulator.\nUnder microscope visualization, juxtapose the tips of pipettes using horizontal manipulators. Keep the pipettes at a 35°–40° angle.\nUnite the pipette pair using hot-glue gun at about 1 cm above the tips and leave them to set (Figure 1[href=https://www.wicell.org#fig1]E).\nCheck the pipette pair again under the microscope to verify the tips are still juxtaposed and aligned.\nRepeat the above steps to prepare enough pipette pairs needed for your experiment.",
    "Critical: The step of aligning the tips is critical. If the tips are not well aligned, the quality of the experiment will be compromised. If the tips have some distance between them or if they cross over, the infusion will not reach the recorded neuron. Misaligned tips also increase the risk of damage to the cortex during pipette insertion.\nInduction of anesthesia\nTiming: 15 min\nWeigh the mouse on scale.\nAnesthetize the mouse based on the protocol approved by the animal experimentation ethics committee. Below is the protocol we used.\nBriefly anesthetize the mouse in isoflurane chamber for 2–5 min.\nAdminister 5 mL/kg of anesthetic solution intraperitoneally (ip).\nNote: For studying the sensory processing in mammalian cortex, different anesthetic drugs are used which sometimes vary depending on the modality of interest. Based on our experience, urethane/chlorprothixene mixture provides a stable level of general anesthesia suitable for studying neuronal responses in the rodent somatosensory cortex.\nKeep the mouse on the heating blanket.\nCheck the anesthetic level after 10–15 min by pinching the hind paw; if the mouse is not fully anesthetized, ip inject an additional dose of anesthetic solution equivalent to 10% of original dosage. If the mouse is fully anesthetized move to the next step.\nNote: To achieve stable anesthesia by urethane, it is crucial that a correct ip injection is performed. Incorrect injection would result in slow absorption and may produce an unstable anesthesia.\nHead fixation and craniotomy\nTiming: 1 h\nFor head fixation we use a modified version of the setup described by Guo et al. (Guo et al., 2014[href=https://www.wicell.org#bib1]). Here is a brief description of the head-fixation setup.\nNote: The body temperature control system is compromised under anesthesia. It is therefore critical to keep the mouse on heating blanket during all stages of the experiment.",
    "Head fixation (in brief)Proper head fixation is crucial for having a stable long-lasting recording from single neurons.\nAfter ensuring that the mouse is fully anesthetized and while keeping the mouse on the heating blanket, remove the scalp to expose the frontal, parietal, and occipital bones.\nRemove the periosteal tissue on the skull using forceps or by application of 1 mM hydrogen peroxide with a cotton bud.\nNote: Remember to remove the pieces of hair from the skull and thoroughly clean it.\nFix the head bar (Figure 2[href=https://www.wicell.org#fig2]A) above Lambda using a thin layer of cyanoacrylate adhesive and dental acrylic (Vertex Self-Curing). Ensure the bone is dry before application of adhesive.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/447-Fig2.jpg\nFigure 2. Head fixation and craniotomy\n(A) After inducing anesthesia, scalp is removed and a head bar is attached to the skull.\n(B) The head bar is fixed into a post to produce a stable head fixation for craniotomy.\nLet the cement set for at least 15 min.\nFix the head in the custom-made head post (Figure 2[href=https://www.wicell.org#fig2]B).\nCraniotomy\nNote: The position of craniotomy varies depending on the sensory modality of interest. Here, we focus on the vibrissal primary somatosensory cortex (vS1).\nMark the middle of vS1 on the skull based on its coordinates (1.8 mm posterior to bregma and 3.5 mm lateral from the midline suture).\nDraw a 2 mm circle around that point for craniotomy.\nDrill along the circular mark using a drill bit with 0.3 mm blunt head.\nApply ACSF regularly to clean the drilling area for better visualization and to avoid overheating the bone.\nWhen the bone flap gets loose, it can be lifted up with a pair of forceps held horizontal to the skull.",
    "Critical: Drill patiently while applying constant pressure. Drilling in one direction, either clockwise or anti-clockwise helps maintaining the uniformity of drilling and reduces the possibility of damaging the dura.\nNote: Remove the bone debris powder by flushing with ACSF and suctioning.\nNote: During this step, the bone may be detached from some areas but need more drilling in others. It is helpful to gently touch the bone flap with forceps to identify the areas that need further drilling.\nIn case of accidental damage to a blood vessel see Troubleshooting 1[href=https://www.wicell.org#troubleshooting].\nYou need to keep the cortex always moist with regular application of ACSF.\nNote: At this stage, it is a good idea to fix the ground wire for electrophysiological recording. The wire should be placed away from the craniotomy area. We recommend inserting the wire between the muscles and the exposed skull.\nCortical infusion system\nTiming: 10 min\nYou can use any pump to continuously inject the solution at rates of 1–10 μL/min. Here we use CMA 402 Syringe pumps and 1 mL glass syringes. We use 4 pumps and 4 syringes, 2 syringes for ACSF, 1 syringe each for agonist and antagonist solutions. Adjust the number of pumps based on the number of solutions. The tubes need to be connected at the infusion pipette level and transferred with a blunt needle gauge 21 to the tip of the infusion pipette (Figure 3[href=https://www.wicell.org#fig3]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/447-Fig3.jpg\nFigure 3. Infusion setup\n(A) Blunt infusion needle to transfer solution to the tip of infusion pipette.\n(B) Infusion pipette installation before the start of recording.\nFill the syringes with solutions.\nStart running all pumps for several minutes to ensure every pump works properly.\nStop the pumps except the one filled with ACSF solution.",
    "Note: You can do steps 12–14 while waiting for the cement to set after step 10d.\nFill the recording pipette with 5 μL of the recording solution; remove any potential air bubbles by gently flicking the pipette. Then fill the infusion pipette with 10–20 μL ACSF and remove any potential bubbles similar to before.\nInsert the infusion needle to the infusion pipette and secure the end of pipette with the tube (Figure 3[href=https://www.wicell.org#fig3]B).\nNote: We use a blunt needle to transfer the solution faster to the tip of pipette. With the pump speed set at 3 μL/min, it usually took about 2–3 min for the solution to appear at the pipette tip.\nAttach the recording pipette to the head stage.\nApply 250–300 mmHg pressure to the recording electrode to prevent contamination of the recording solution with ACSF.\nOptional: The following step depends on the modality of interest. As we recorded from vS1, we used piezoelectric actuator connected to a mesh for whisker stimulation.\nAttaching the piezoelectric actuator\nTrim the contralateral whiskers to ∼3 mm using scissors.\nInsert the whiskers into the mesh attached to the piezoelectric actuator (Figure 4[href=https://www.wicell.org#fig4]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/447-Fig4.jpg\nFigure 4. Example outcome\n(A) Schematic for application of sensory inputs (whisker stimulation) and recording/labeling of cortical neurons under pharmacological manipulation.\n(B) Sensory-evoked neuronal responses increased by activating TRPA1 (red); the response levels decreased by introducing TRPA1 blocker (blue). This panel was adapted from Figure 1, Kheradpezhouh et al. (2020)[href=https://www.wicell.org#bib3].\n(C) Sensory-evoked responses increased by activating M1 AChR; the response levels decreased by inhibiting the receptor. In both (B) and (C), histological reconstruction of the recorded neuron is shown on the right column.",
    "Note: The mesh should be close to the hair follicle but not touching the face of the animal. Ensure the piezoelectric actuator is ground shielded to reduce electrical noise.\nCritical: At any stage, it is important to not let the cortex dry out. Regularly apply ACSF on the exposed cortex.\nJuxtacellular recording/labeling\nTiming: 2 h\nHere, we followed the protocol described by Pinault, 1996[href=https://www.wicell.org#bib4] and modified in 2011 (Pinault, 1996[href=https://www.wicell.org#bib4], 2011[href=https://www.wicell.org#bib5]).\nEnsure that all the necessary equipment is connected and turned on. This includes amplifiers, sound system, micromanipulator, national instrument (NI) card and computers.\nTo penetrate the dura mater, apply constant pressure (of ∼300 mmHg) to the recording pipette and insert the pipette pair at a relatively fast speed of ∼100 μm/s.\nAfter passing the dura, reduce the pressure to 10–20 mmHg and start searching for neurons at the slow speed of 1 μm/s. This can be done under current clamp mode with application of 1 nA pulses for 200 ms and 200 ms pause.\nContinue the search until you identify a rise in impedance as the pipette comes in proximity of a neuron.\nAfter reaching a neuron, remove the pressure and stop the current pulse.\nApply the sensory paradigm while recording the neuron. For example, in our experiments, we used a MATLAB (MathWorks, Inc., Natick, MA) script to present the stimuli and acquired the neuronal data through the analog input and output of a data acquisition card (National Instruments, Austin, TX). The whisker stimulation composed brief (20 ms) biphasic vertical movement generated by a piezoelectric actuator (Kheradpezhouh et al., 2017[href=https://www.wicell.org#bib2]). The trials were presented in a pseudorandom order.\nApply agonist or antagonist by switching between the pumps.",
    "Note: We applied the drugs for about 10–15 min each. This period should be optimized based on the specific drugs used in the experiment. In our experiments, it took 2–3 min for the drug to reach the neuron and we usually observed changes in neuronal response 5 min after switching between pumps.\nAfter completing the experiment, load the neuron with neurobiotin as previously described (Pinault, 1996[href=https://www.wicell.org#bib4], 2011[href=https://www.wicell.org#bib5]). Here in brief:\nApply 1-nA current pulses for 200 ms every 400 ms.\nIncrease the pulse amplitude 1 nA every 2–3 min until you observe the following changes in neuronal response which indicates the loading with neurobiotin.\nNote: Systematic rise in the neuronal firing rate and broadening the action potential duration are the main 2 signs of successful loading with neurobiotin (Pinault, 1996[href=https://www.wicell.org#bib4], 2011[href=https://www.wicell.org#bib5]). The other sign is the variability in amplitude and shape of neuronal action potential (Pinault, 1996[href=https://www.wicell.org#bib4], 2011[href=https://www.wicell.org#bib5]). These signs usually disappear after you stop the current injection and allowing the neuron to rest for a few minutes.\nAfter loading the neuron, detach from the neuron by applying 10–20 mmHg of pressure to the recoding pipette and slowly retract the pipette pair.\nNote: If you want to record several neurons from each mouse, record the depth for each neuron to allow matching the recorded neurons with their histological reconstruction. For accurate identification of cell type, we recommend labeling a maximum of 3 neurons in each mouse.\nRepeat these steps for the next experiment and neuron.\nHarvesting the brain and immunostaining\nAfter completing the recording experiment, cull the mouse by intraperitoneal administration of Lethabarb (150 mg/kg mouse weight).\nNote: This step should be modified based on the protocol approved at your institute.\nAfter the mouse stops breathing, open the abdomen and remove the anterior part of the chest.",
    "Chop the liver to let the blood drain out.\nPerform cardiac perfusion form the left ventricle with ∼10 mL of pre-chilled normal saline followed by ∼10 mL of 4% paraformaldehyde in PBS at the speed of ∼3 mL/min.\nHarvest the brain and store in 4% PFA overnight (12–16 h) for fixation.\nThe next day, transfer the brain to PBS containing sequential sucrose solutions from 10% to 30% to achieve brain dehydration.\nEmbed the tissue in a Tissue-Tek mold using Tissue-Tek OCT compound and freeze the brain at −20°C for at least 1 h.\nSection the brain at 100 μm thickness using a cryostat.\nIncubate the sections in a 24-well plate.\nWash the sections with PBS 3 times 5 min each to ensure all remnants of the mounting medium have been rinsed off.\nIncubate the slices in the penetration solution for ∼3 h.\nWash the sections with PBS 3 times 5 min each.\nCritical: The next steps need to be carried out in the dark.\nIncubate the sections with PBS containing 0.1% Tween 20 and 1/1000 (v/v) Streptavidin conjugated with a secondary antibody overnight (12–16 h) at 4°C.\nThe next day, wash with PBS 3 times 5 min each.\nMount the sections on microscope slides, embedded in a mounting medium (Immumount) and cover with a coverslip.\nKeep the section overnight (6–16 h) in a dark dry area.\nSeal the edges with clear nail polish.\nUse confocal microscopy to visualize the recorded neurons and capture images.\nNote: During all incubations and washings, keep the slices on a shaker to increase the efficiency of binding.\nOptional: Stain with DAPI (1:5,000) for 5 min to visualize cell nuclei of the loaded neuron."
  ],
  "subjectAreas": [
    "Neuroscience",
    "Cell Biology",
    "Model Organisms"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}