{
  "id": 581,
  "origin_website": "Nature",
  "title": "Simultaneous inhibition and subsequent re-expression of multiple genes",
  "procedures": [
    "**Modification of siRNA Vector**\n1. Choose a U6 or H3 promoter siRNA vector like pSilencer 2.0 U6 Hygro.\n  2. Use the QuikChange&#xAE; Site-Directed Mutagenesis Kit to modify the vector according to the manufacturer&#x2019;s instructions for:\n  i. Removing all _EcoR_ I sites and generating a single _EcoR I_ site immediately upstream of the U6 promoter.\nii. Adding _Mfe I_ and _Xho I_ sites to the 5&#x2019;-terminus of the U6 siRNA cascade as shown in Figure 1. \n**TIP:** _Mfe_ I and _EcoR_ I have matched ends which can be ligated to each other, but cannot be re-cut by either endonuclease after ligation. This will facilitate the repeated insertion of multiple U6-siRNA cascades into the vector. Alternately, the _BamH_ I and _Bgl_ II pair which also have matched ends may be used if one of them is located immediately before the U6 promoter.  \n**Generation of siRNA constructs**\n1. Choose the proper siRNA targeting sequences corresponding to the multiple genes to be targeted for removal. The online service &#x201C;siDESIGN&#x201D; of Dharmacon Research, Inc., or other similar programs, may be used for selecting potential targeting sites.\n  2. Synthesize forward and reverse chains of oligonucleotides containing 19-21 nt of sense and 19-21 nt of antisense targeting sequences with an intervening &#x201C;AGAGAACTT&#x201D; loop. Several extra nucleotides should be designed to generate proper restriction enzyme sites on annealed oligonucleotides \\(which are _BamH_ I and _Hind_ III if the modified pSilencer 2.0 U6 Hygro vector is used).\n  3. Anneal the forward and reverse chains of oligonucleotides.\n  4. Digest modified siRNA Vector \\(_BamH_ I and _Hind_ III) and purify it using a 1% agarose gel.\n  **TIP:** Do not use the _Mfe_ I and _Xho_ I sites for inserting the siRNA targeting sequences. These two sites will be used to combine multiple siRNA cascades into one vector.",
    "5. Insert the annealed oligonucleotides for multiple genes separately into the modified siRNA vector digested with the corresponding restriction enzymes using Quick Ligation Kits.\n  6. Transform competent _E. coli_ cells for amplifying each construct.\n  \n**Generation of siRNA construct for knocking down multiple genes \\(see Figure 1)**\n1. Digest one of the siRNA constructs with _Xho_ I and _Mfe_ I and purify the vector using a 1% agarose gel.\n  2. Digest a second siRNA construct with _Xho_ I and _EcoR_ I and purify the U6-siRNA cascade fragment \\(the short fragment) on a 1% agarose gel. \n  3. Ligate the above purified vector and the short fragment using the Quick Ligation Kit.\n  4. Transform competent _E. coli_ cells and amplify the combined U6-siRNA construct.  \n  5. If more genes are to be targeted, repeat steps 1-4 to generate multiple U6-siRNA cascades into one vector.\n  \n**Generation of expression vector for gene replacement\\(s)**\n1. Clone the cDNA of genes into a mammalian cell expression vector.\n  2. Generate mutations in the siRNA target region of each cDNA using  QuickChange Site-Directed Mutagenesis Kit to circumvent targeting by siRNA.\n  **TIP:** If the siRNA target region is located in the open reading frame, make 3-5 mutations in the wobble positions of the codons in the siRNA target region. \n**Transfection of cells**\n1. Cells are cultured in the appropriate medium supplemented with 10% fetal bovine serum. Transfections are carried out using Lipofectamine 2000 according to the manufacturer&#x2019;s instructions. \n  2. Proper antibiotics are added to the medium to select for the appropriate multiple siRNA construct following transfection.\n  3. Analyze cell extracts for the removal of targeted genes by northern and/or western blotting.\n  4. Transfect the siRNA stably transfected cells with the corresponding expression vector\\(s) for gene replacement and function analysis."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}