{
  "id": 13561,
  "origin_website": "Jove",
  "title": "Generation of iPSC-derived Human Brain Organoids to Model Early Neurodevelopmental Disorders",
  "procedures": [
    "1. Generation of Brain Organoids (23 days)\nInitiation of neuroectoderm (5 days)\n\tNOTE: The following points should be considered before the start of differentiation. The reprogramming method (lentiviral-, sendai-virus-, episomal-, or microRNA-based etc.) to obtain human iPSCs should ideally be the same for all patient and control iPSC lines. Various reprogramming kits and instructions based on published protocols are available15,16,17,18. The quality of the human iPSC lines is the key to accomplishing an optimal differentiation. Monitor colony and cell morphology with a microscope and validate pluripotency by testing the expression of markers such as Oct3/4, Nanog, or TRA-1-60.\n\t\nCulture human iPSCs under feeder-free conditions in medium A on a dish coated with Engelbreth-Holm-Swarm (EHS) matrix.\n\t\tNOTE: Grow human iPSCs feeder-free and serum-free to maintain a defined culture condition and to avoid an additional step for the removal of mouse embryonic feeder cells (MEFs) before the start of differentiation. The optimal passage number for human iPSCs to start differentiation ranges from passage 15 upon reprogramming to passage 70 in total. When passaging, detach hiPSC colonies as cells aggregate using an appropriate cell detachment solution with low mechanical stress and a 2-mL serological pipette to transfer aggregates to a new dish. Avoid dissociation to single cells, as this might induce differentiation and apoptosis in most iPSC lines. It was reported that long-term, single-cell passaging could increase genomic alterations in human iPSCs19,20. Avoid cell detachment procedures, which require a centrifugation step to remove detachment solution, as this reduces the overall viability of iPSCs. Test all cultures for microbial contaminations, particularly mycoplasma, on a regular basis, because this might alter the quality of the iPSCs and their differentiation capacity.\n\t\t\nCoat a 60 mm tissue culture dish with EHS matrix as per the manufacturer's instructions.",
    "Thaw an aliquot of 1 x 106 human iPSCs. Seed the iPSCs in a 60-mm tissue culture dish coated in EHS matrix and containing 5 mL of medium A (see the Materials Table). Change the medium daily and passage after 5 to 7 days when the cells reach ~80% confluency.\n\t\t\tNOTE: Passage the thawed iPSCs at 80% confluency using standard methods, such as the enzyme-free detachment of colonies21, at least once before starting the differentiation. In brief, remove the iPSC medium, wash the cells once with pre-warmed 37 °C Dulbecco's Modified Eagle's Medium: Nutrient Mixture F-12 (DMEM/F12), and incubate the iPSCs following the manufacturer's instructions using reagent A (see the materials table). Don't exceed the recommended incubation time in order to avoid dissociation to single cells. Human iPSCs should be detached and floating as aggregates, not as single cells. They can then be transferred to new EHS matrix-coated dishes; for example, iPSC aggregates from one 60-mm dish can be distributed to 4 new 60-mm dishes.\nCheck for mycoplasma with a mycoplasma detection kit according to the manufacturer's instructions. Use only mycoplasma-free iPSCs, as mycoplasma can alter the differentiation capability of iPSCs.\nDissociate iPSCs (80% confluent) and prepare a single-cell suspension using reagent B.\n\t\t\nWash the iPSCs once with pre-warmed (37 °C) DMEM/F12.\nAdd pre-warmed reagent B (e.g., 1 mL in a 60 mm dish) and incubate the iPSCs for 5 min at 37 °C and 5% CO2.\nFlick 20 times with a fingertip on the side and bottom of the dish to detach the iPSCs. Check for the detachment of cells under the microscope.\nPipette the cell suspension up and down in the dish 5 times with a 1-mL micropipette.",
    "Add 3 mL of medium A to dilute 1 mL of reagent B and collect the cell suspension in a 15-mL centrifuge tube.\nGently spin down the iPSCs (500 x g) for 4 min at room temperature.\nResuspend the cell pellet in 1 mL of medium B and count the cell number with a hemocytometer.\n\t\t\tNOTE: Be aware of using only medium B for resuspension. Avoid using medium A, as it contains a too-high concentration of bFGF, which might inhibit the differentiation.\nDilute the cell suspension to 4.5 x 105 cells per mL in medium B supplemented with 10 µM rho-associated protein kinase inhibitor (Y-27632).\nAdd 100 µL per well in a non-adherent, v-bottom, 96-well plate.\n\t\tNOTE: Make sure the cells are equally distributed in the suspension by shaking the tube each time before taking out 100 µL portions. It is important that each well should contain an equivalent cell number in order to obtain neurospheres homogenous in size and shape (round, defined surfaces).\nGently spin down the plate with the cells at 500 x g and room temperature for 3 min and incubate at 37 °C and 5% CO2.\nChange the medium daily by removing 50 µL and adding 50 µL of fresh medium B into each well for the next 5 days.\n2. Embedding Neurospheres in EHS Matrix (4 days)\nPrepare neurosphere medium by mixing the following: 1:1 mixture of DMEM/F12 and medium C (v/v), 1:200 (v/v) supplement 1, 1:100 (v/v) supplement 2 without (w/o) Vitamin A, 1:100 L-glutamine, 0.05 mM non-essential amino acids (MEM), 100 U/mL penicillin, 100 µg/mL streptomycin, 1.6 g/L insulin, and 0.05 mM β-mercaptoethanol.\nCollect the neurospheres with a 200 µL micropipette using a ~2 mm tip previously cut with sterile scissors.",
    "Place the neurospheres approximately 5 mm away from each other on paraffin film (3 x 3 cm2) in an empty 100 mm dish and carefully remove as much of the remaining medium as possible.\nAdd a drop (7 µL) of EHS matrix onto each single neurosphere.\nIncubate the EHS matrix drops with the neurospheres for 15 min in an incubator.\nWash the neurospheres carefully from the paraffin film by flushing them with neurosphere medium. To flush, use a 1 mL micropipette and a new 100 mm Petri dish containing 10 mL of neurosphere medium.\nIncubate the neurospheres for the next 4 days and add 2 mL of fresh neurosphere medium on day 2.\n\tNOTE: Make sure that the shelves in the incubator are flat so that the EHS matrix-embedded neurospheres will not clump together on one side of the dish.\n3. Organoids in a Rotary Suspension Culture (14 Days)\nPrepare brain organoid medium by mixing the following: 1:1 mixture of DMEM/F12 and medium C (v/v), 1:200 (v/v) supplement 1, 1:100 (v/v) supplement 2 w/o Vitamin A, 1:100 L-glutamine, 0.05 mM MEM, 100 U/mL penicillin, 100 µg/mL streptomycin, 1.6 g/L insulin, 0.5 µM dorsomorphin, 5 µM SB431542, and 0.05 mM β-mercaptoethanol.\nAdd 100 mL of brain organoid medium to each spinner flask through its side arms and place them in an incubator for pre-warming for at least 20 min.\nSet up a stirring program at 25 rpm, according to the manufacturer's instructions.\n\tNOTE: Before transferring the EHS matrix-embedded neurospheres into spinner flasks, make sure that they are all separated. If two or more are connected through EHS matrix, separate them by cutting the connecting matrix with a scalpel.",
    "Carefully transfer the EHS matrix-embedded neurospheres into spinner flasks containing 100 mL of organoid medium using a 2 mL serological pipette. Use the side arms of the spinner flask to transfer the neurospheres into the flask.\nPlace the spinner flasks on a magnetic stirring platform in an incubator at 37 °C and 5% CO2; this is day 0 of the organoid culture.\nChange the medium once per week (or more often when there is a color change) by removing half of the medium and adding the same amount of fresh medium.\n\tNOTE: When taking the spinner flasks out of the incubator, wait 3-5 min to let the organoids sink down to the bottom of the flask. Remove the medium by placing the glass pipette tip (connected to a pump) on the surface of the liquid; aspirate the medium carefully through one side opening/arm of the flask. These manipulations must be done under the laminar hood.\n4. Analysis of Brain Organoids\nFixation of organoids\nCollect the organoids on day 14 of the spinner flask culture with a cut 1 mL micropipette (cut ~5 mm). Put all of them in a 60 mm dish and wash them once with 5 mL of warm DMEM/F12 for 3 min.\nPrepare a 1.5 mL tube with 500 µL of warm 4% paraformaldehyde (PFA).\n\t\tCaution: Wear skin and eye protection and work under a safety hood when handling PFA fixative.\nPlace each organoid separately in each tube and fix them for at least 30 min at room temperature. Do not fix the organoids for longer than 60 min. To move the organoids, use an inoculation loop or any other devise that is convenient.\nRemove the PFA and wash the fixed organoids twice for 10 min each with 1 mL of PBS.",
    "Store the organoids in 1 mL of PBS at 4 °C for up to 7 days, until further use.\nEmbedding the organoids for cryosectioning\nRemove the PBS and add 1 mL of 30% sucrose in distilled water solution per tube to dehydrate the organoids before cryofreezing them; after adding sucrose solution, the organoids should be floating at the surface. Store the organoids overnight in sucrose solution at 4 °C; by the next day, the organoids should have sunk down to the bottom of the tube.\n\t\tNOTE: Organoids can be stored for up to 3-5 days at 4 °C in sucrose solution, if necessary.\nFill a vinyl specimen mold with 400 µL of optimum cutting temperature (OCT) compound and use an inoculation loop to place an organoid at the center of the mold. Label the rim of the mold with the sample name.\nFreeze the organoid-containing mold at -80 °C until cryosectioning.\nCoat glass cryoslides with 0.1% poly-l-lysine solution (PLL) in PBS for 5 min at room temperature and let the slides dry for 3 h. Store the slides at 4 °C and warm them up to room temperate before use.\n\t\tNOTE: PLL-coating is an important step, as it will prevent the organoid slices from floating away. Collect and store PLL solution at 4 °C for up to 3 months. Before reuse, filter it with a 0.22-µm syringe and let it warm to room temperature.\nSection cryofrozen organoids into 20-50 µm-thick slices on PLL-coated glass cryoslides22. Let the slides with the sections dry for 1 h at room temperature. Store the sections at -80 °C until further processing.\n5. Immunofluorescent Staining of Organoid Sections",
    "NOTE: For the general characterization of organoids, staining with nestin, a neural progenitor marker, and TUJ1, a pan-neuronal marker, is recommended. As additional examples, immunofluorescent staining with phospho-Vimentin (p-Vim), which labels mitotic apical radial glial cells, and Arl13b, for cilium, are described. To test apoptosis, use the Terminal deoxynucleotidyl transferase (TdT) dUTP Nick-End Labeling (TUNEL) assay. Place the slides in a plastic box during the incubations to protect them from dust, light, and drying out.\nThaw the slides for 30 min at room temperature.\nWash the slides twice with 200 µL of PBS-glycine (0.225 g of glycine in PBS) for 3 min to quench the PFA-induced autofluorescence.\nPermeabilize the sections with 200 µL of 0.5% Triton X100/0.1% tween in PBS solution for 10 min at room temperature.\nWash them twice with 200 µL of PBS-glycine solution for 3 min.\nIncubate them with 200 µL of 0.5% fish gelatin/0.1% Triton X100 in PBS for 1 h at room temperature or overnight at 4 °C to block unspecific antigen binding.\n\tNOTE: If a TUNEL assay is required, perform the assay as per the manufacturer's protocol. Start with the TUNEL assay before performing the immunostaining, as it might interfere with secondary antibodies and quench fluorophores when used afterwards.\nDilute the antibodies in blocking solution at the following concentrations: nestin, 1:200; p-Vim, 1:500; TUJ1, 1:200; Arl13b, 1:20; and secondary antibodies, 1:1,000.\nIncubate with 200 µL of the first primary antibody (e.g., nestin) for 1-2 h at room temperature or overnight at 4 °C.\nWash 3 x 3 min with 200 µL of blocking solution.\nDilute the first (anti-mouse 488) secondary antibody 1:1,000 in blocking solution and incubate the slide in 200 µL for 1-2 h at room temperature. From now on, always protect the slides from light.",
    "Wash 3 x 3 min with 200 µL of blocking solution.\nIncubate with 200 µL of the next primary antibody (e.g., TUJ1) for 1-2 h at room temperature or overnight at 4 °C.\nWash 3 x 3 min with 200 µL of blocking solution.\nAdd 200 µL of the next secondary antibody (anti-rabbit 647) for 1-2 h at room temperature.\nWash 3 x 3 min. with 200 µL of blocking solution.\nAdd 200 µL of 4',6-diamidino-2-phenylindole (DAPI) at a 30 nM concentration in PBS for 15 min at room temperature for nuclear staining.\nWash 2 x 3 min with 200 µL of blocking solution.\nWash 1 x 1 min with 200 µL of distilled water and let the sections dry for 10-20 min, until no obvious water drop is visible any more.\nMount the sections with embedding medium. Store them protected from light at 4 °C for up to several weeks.\nProceed with microscopic analysis to image an overview of the organoid, ventricular zone, primitive cortical plate, and other areas of interest.\nUse a confocal microscope with a 63X oil objective and fluorescent filters, chosen according to the fluorescent dye-tagged secondary antibodies used1,10.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}