{
  "id": 11915,
  "origin_website": "Jove",
  "title": "Analytical Determination of Mitochondrial Function of Excised Solid Tumor Homogenates",
  "procedures": [
    "All experiments and procedures involving animals were approved by the Pennington Biomedical Research Center Institutional Animal Care and Use Committee.\n1. Reagent preparation.\nPrepare EO771 cell growth media with 10 mM HEPES, 10% fetal bovine serum (FBS), 1% penicillin-streptomycin (100 U/mL), and 0.2% amphotericin B.\nPrepare 1 L of biopsy preservation (BIOPS) solution in a 1000 mL glass beaker.\n\t\nAdd 3.180 g of Na2ATP (5.77 mM final concentration).\nAdd 1.334 g of MgCL2·6H2O (6.56 mM final concentration).\nAdd 2.502 g of Taurine (20 mM final concentration).\nAdd 3.827 g of Na2Phosphocreatine (15 mM final concentration).\nAdd 1.362 g of Imidazole (20 mM final concentration).\nAdd 0.077 g of Dithiothreitol (.5 mM final concentration).\nAdd 9.76 g of MES hydrate (50 mM final concentration).\nAdd 800 mL of H2O and mix the constituents using a magnetic stirrer at 30 °C.\nAdd 72.3 mL of 100 mM K2EGTA (7.23 mM final concentration).\n\t\t\nDissolve 7.608 g of EGTA and 2.3 g of KOH in 100 mL of H2O.\nAdjust pH to 7.0 with 5 M KOH and bring the volume up to 200 mL with H2O.\nAdd 27.7 mL of 100 mM CaK2EGTA (2.77 mM final concentration).\n\t\t\nDissolve 7.608 g of EGTA in 200 mL of H2O and heat to 80 °C (100 mM final concentration).\nDissolve 2.002 g of CaCO3 in 200 mL of hot 100 mM EGTA solution.\nWhile continuously stirring, add 2.3 g of KOH and adjust the pH to 7.0.\nAdjust the pH to 6.75 at 23 °C (pH 7.1 at 0 °C) with 5 M KOH. Bring the volume up to 980 mL with H2O, and mix the solution. Check the pH once more, adjust if necessary, and bring the final volume up to 1000 mL with water.",
    "Aliquot BIOPS into conical tubes (15 mL or 50 mL) and store at -20 °C until use. Only thaw once, just before use.\nPrepare 1 L of mitochondrial respiration medium (MiR05) in a 1000 mL glass beaker.\n\t\nAdd 0.190 g of EGTA (0.5 mM final concentration).\nAdd 0.610 g of MgCL2·6H2O (3 mM final concentration).\nAdd 2.502 g of Taurine (20 mM final concentration).\nAdd 1.361 g of KH2PO4 (10 mM final concentration).\nAdd 4.77 g of HEPES (20 mM final concentration).\nAdd 37.65 g of D-Sucrose (110 mM final concentration).\nAdd 800 mL of H2O and mix the constituents using a magnetic stirrer at 30 °C.\nAdd 120 mL of 0.5 M Lactobionic acid (60 mM final concentration).\n\t\t\nDissolve 35.83 g of Lactobionic acid in 100 mL of H2O.\nAdjust pH to 7.0 with 5 M KOH and bring volume up to 200 mL with H2O.\nMix the solution and adjust the pH to 7.1 with 5 M KOH.\nWeigh 1 g of BSA, essentially fatty acid-free (1 g/L final concentration), in a 50 mL conical tube. Add 40 mL of the pH 7.1 solution from step 9 to tube, invert gently to mix, and avoid foaming. Transfer the dissolved BSA into the remaining pH 7.1 solution from step 9 and stir gently and continuously. Check pH once more, adjust if necessary, and bring the final volume up to 1000 mL with H2O.\nAliquot the MiR05 medium into 50 mL conical tubes and store at -20 °C until use. Only thaw once, just before use.\nPrepare substrates, uncouplers, and inhibitors.",
    "Prepare 0.8 M Malate: Dissolve 536.4 mg of L-Malic acid in 4 mL of H2O. Neutralize with 5 M KOH to pH 7 and bring the volume up to 5 mL with H2O. Divide into aliquots and then store at -20 °C.\nPrepare 1 M Pyruvate: Dissolve 550 mg of Pyruvic acid sodium salt in 4 mL of H2O. Neutralize with 5 M KOH to pH 7 and bring the volume up to 5 mL with H2O. Divide into aliquots and then store at -20 °C.\nPrepare 0.5 M ADP (adenosine 5′-diphosphate): Dissolve 1.068 g of ADP sodium salt in 4 mL of H2O. Neutralize with 5 M KOH to pH 7 and bring the volume up to 5 mL with H2O. Divide into aliquots and then store at -20 °C.\nPrepare 2 M Glutamate: Dissolve 3.7426 g of L-Glutamic acid monohydrate in 8 mL of H2O. Neutralize with 5 M KOH to pH 7 and bring the volume up to 10 mL with H2O. Divide into aliquots and then store at -20 °C.\nPrepare 4 mM Cytochrome c: Dissolve 50 mg of Cytochrome c in 1 mL of H2O. Divide into aliquots and then store at -20 °C.\nPrepare 1 M Succinate: Dissolve 2.701 g of Succinate disodium salt hexahydrate in 8 mL of H2O. Neutralize with 1 N HCl to pH 7 and bring the volume up to 10 mL with H2O. Divide into aliquots and then store at -20 °C.\nPrepare 1 mM FCCP (carbonyl cyanide-4-(trifluoromethoxy)phenylhydrazone): Dissolve 2.54 mg of FCCP in 10 mL of pure ethanol. Divide into aliquots and then store at -20 °C.",
    "Prepare 150 µM Rotenone: Dissolve 3.94 mg of Rotenone in 10 mL of pure ethanol to prepare 1 mM stock, vortex until fully dissolved. Dilute 225 µL of 1 mM Rotenone stock concentration with 1.275 mL of pure ethanol to make 1.5 mL of 150 µM Rotenone. Protect from light, divide into aliquots, and then store at -20 °C.\nPrepare 125 µM Antimycin A: Dissolve 11 mg of Antimycin A in 4 mL of pure ethanol to prepare 5 mM stock concentration of Antimycin A. Dilute 25 µL of 5 mM Antimycin A stock concentration with 975 µL of pure ethanol to make 1 mL of 0.125 mM Antimycin A. Divide into aliquots and then store at -20 °C.\nPrepare 0.8 M Ascorbate: Dissolve 1.584 g of Ascorbate sodium salt in 8 mL of H2O. Adjust pH with ascorbic acid to pH 6 and bring the volume up to 10 mL with H2O. Protect from light, divide into aliquots, and then store at -20 °C.\nPrepare 0.2 M TMPD (tetramethyl-p-phenylenediamine): Dissolve 32.85 mg of TMPD in 987.5 µL of DMSO. Add 12.5 µL of 0.8 M ascorbate (10 mM final concentration of ascorbate). Protect from light, divide into aliquots, and then store at -20 °C.\nPrepare 4 M Sodium azide: Dissolve 2.6 g of Sodium Azide in 10 mL of H2O. Divide into aliquots and store at -20 °C.\n2. Tumor growth\nGrow EO771 cells in RPMI 1640 growth media and maintain the cells in a 37 °C humidified incubator with 5% CO2.\nSingle-house four-week old female C57BL/6J mice, maintain them at 21-22 °C on a 12 h light: dark cycle. Provide the mice ad libitum access to food and water.\nOnce the mice reach 10 weeks of age, prepare the cells and the mice for cancer cell implantation.",
    "Trypsinize the cells, deactivate trypsin with growth media, and centrifuge cells at 500 x g for 5 min at room temperature. Aspirate the supernatant and resuspend and combine the cell pellets (as needed) in media. Count viable cells using trypan blue and prepare a cell dilution of 1 x 106 cells in a total volume of 60 µL with a 1:1:1 Media/ Basement Membrane Matrix/PBS solution. Once the basement membrane matrix is added, mix well and keep the cell suspension on ice. Fill syringes with 60 µL of cell suspension and place them on ice. Work efficiently and inject cells into mice within 1.5 h of preparation.\nAnesthetize mice by isoflurane inhalation (3%-5% for induction and 1%-3% for maintenance). Shave between the right 4th and 5th inguinal mammary glands. Orthotopically inject the anesthetized mice with the EO771 cell suspension.\nUse electronic calipers to monitor and measure the tumor growth twice a week for 4 weeks. At necropsy, excise, weigh, and then place the tumor (or a minimum of 60 mg tumor section) immediately into 10 mL of ice-cold BIOPS. Keep the tube on wet ice.\n3. Instrument setup and calibration\nWarm the MiR05 medium in a 37 °C water bath.",
    "Turn on the Oroboros O2k system, open DATLAB software, enter or select User. Click on Connect to O2k. Check the O2k configuration and ensure that the correct instrument is labeled for Power-O2k and each chamber corresponds to the correct Oxygen Sensor; click OK. Once the O2k control window opens, under the Systems tab, set the Block Temperature to 37 °C, the Stirrer speed to 750 rpm for both chambers, ND the Data Recording interval to 2.0 s. Check both Stirrer Power and Illumination in Chamber boxes. In the Oxygen, O2 tab, set the Gain for Sensor to 1 V/µA (the gain may need to be adjusted for older instrument models), the Polarization Voltage to 800 mV, and then click on Connect to O2k. Once a new experiment file opens, name the file and click on Save. Once the experiment is active, a protocol selection window will open; click on Cancel to run a custom SUIT (Substrate uncoupler inhibitor titration).\nFollowing protocol selection, a sample window will open to fill out the experimental code, sample type, cohort, sample code, sample number, and subsample number as applicable. Assign the unit to mg and enter the tumor homogenate concentration per mL (amount per chamber will auto-populate). Ensure that the indicated Medium is MiR05 and the Chamber Volume is 2.00 mL. Add comments as needed in the bottom box and click on OK.\nRemove the stoppers and aspirate the 70% ethanol from the chambers. Never aspirate close to the membrane that is exposed on the inside of the chamber. Rinse four times with pure water and fill the chamber with 2.25 mL of MiR05.",
    "Sensor test: Click on F9 to switch off the stirrers for 30 s. Once the stirrer bar switches back on, ensure that the O2 slope rapidly increases monoexponentially in each chamber. If the chamber fails the sensor test, check the electrical connections and clean if salts have accumulated; repeat the test. If the sensor continues to fail the test, remove the polarographic oxygen sensor (POS) connector to inspect the membrane. If visible damage to the membrane, heavy oxidation, or significant bubble accumulation is observed, halt the experimental procedures, and proceed to instrument servicing.\nOxygen calibration: Perform oxygen calibration to obtain accurate respiration measurements.\n\t\nWith a twisting motion, Insert the stoppers slowly to their volume-calibrated position. Siphon off the excess medium ejected through the injection capillary that collects in the well of the stopper. With a twisting motion, lift the stoppers just enough to tightly fit the stopper-spacer tool leaving a gas volume above the liquid phase for the final air equilibration (30-45 min.).\nUse the steady-state achieved over this period to calibrate the oxygen sensor to obtain accurate measurements of respiration. The O2 slope neg. (negative slope of oxygen) is 0 ± 2 pmol/s·mL. If the value is higher than 2 pmol/s·mL, clean the chamber and replenish it with freshly thawed MiR05. If the slope is unstable, proceed to instrument servicing.\nAfter achieving a steady state, select the O2 concentration curve and highlight the steady region of the curve by holding down the shift key and left-click mouse button. Once the region is selected, click on F5, select the mark for air calibration with the drop-down arrow and click on Calibrate and copy to clipboard.\nInstrumental background calibration (optional)",
    "Following air calibration, ensure that there is no gas volume above the liquid phase for flux background equilibration (~15 min) and close the chambers fully.\n\t\tNOTE: The steady-state rate achieved over this period represents instrumental background and can be subtracted from the resulting data for enhanced analytical precision. The O2 slope neg. will initially increase slightly and plateau between ± 2 to 4 pmol/s·mL.\nIf the value is high (>6 pmol/s·mL), there is potential biological contamination. In this case, clean the chamber and replenish it with freshly thawed MiR05. Once a steady-state is achieved, select the O2 slope neg. curve and highlight the steady region of the curve by holding down the Shift key and left-click mouse button.\nAfter selecting the region, click on F5, select the Baseline Correction Box and the mark for Baseline with the drop-down arrow, and click on OK.\n4. Tumor homogenate preparation\nPlace a glass homogenizer containing 1 mL of MiR05 and a tightly fitting glass pestle on wet ice.\nAt the time of the study, place the tissue in 1 mL of BIOPS in an ice-cold Petri dish.\nClean and dissect the tissue to maximize soluble material, avoid necrotic regions, and remove marginal tumor tissue. Using a dissection microscope, scalpel, and surgical tweezers, remove any hair, necrotic tissue, peripheral connective and vascular tissue, and adjacent fat, as applicable. Take care to keep the tumor in ice-cold BIOPS during the dissection.\nCut the tumor into small pieces (~5-10 mg each) and place the remaining tumor pieces back into 10 mL of BIOPS kept on ice. Use this tissue later for additional preparations if needed.",
    "NOTE: Perform the following steps quickly to minimize the amount of time the sample is not submerged fully in BIOPS. Once the sample is placed in MiR05, time is of the essence. Carefully move the prepared homogenate into the calibrated chamber as soon as possible.\nBlot the tissue sections carefully on a filter paper, place them on a small plastic tared weigh boat, and record the initial wet weight. Place the unused pieces back into the 10 mL conical tube of BIOPS for continued preservation.\nSubmerge the tissue sections into an ice-cold homogenizer containing MiR05 and record the remaining weight on the weigh boat, if applicable.\nUsing a glass pestle (clearance range 0.09-0.16 mm), gently disrupt the tumor tissue by completing 5-7 down-and-up strokes. For each stroke, rotate the pestle in a clock-wise-counter-clockwise motion 3 times while pushing the pestle down and 3 additional times while pulling the pestle back up. Be sure to allow the tissue to settle to the bottom of the homogenizer in-between strokes but avoid bringing the pestle fully above the fluid volume to prevent foaming.\n\tNOTE: The resulting homogenate should appear cloudy with minimal solid tissue remnants.\nPour the homogenate into a 15 mL conical tube and place it on ice.\nPipette 1-3 mL of fresh MiR05 over the pestle and into the homogenizer to wash any remaining tissue homogenate. Pour the MiR05 wash into the conical tube containing the homogenate. Repeat the pestle and homogenizer wash 2-3 times to ensure complete transfer of the homogenate. Keep in mind the target concentration and required volume to not over dilute the sample during the washing steps.\nTo accurately calculate the tissue homogenate concentration, carefully inspect the homogenizer and the homogenate for remaining non-homogenized material (i.e., connective tissue).",
    "To remove the non-homogenized material from the homogenizer that cannot be reached with tweezers, add MiR05 to the homogenizer, aspirate the volume (including the tissue) with a pipette and move the contents to a Petri dish.\nTo remove the non-homogenized material from the homogenate (settled in large pieces at the bottom of the conical tube), aspirate the large pieces with a pipette and place them on the tissue cap of the conical tube.\nRemove the tissue from the petri dish or conical tube cap with tweezers and blot it on filter paper. Add the remaining homogenate from the conical tube cap back into the conical tube, cap it, and then invert to mix.\nRe-inspect the homogenizers and homogenate for any additional non-homogenized material, and repeat steps 4.10.1-4.10.3 to remove the material as needed.\nWeigh and record the mass of the non-homogenized material recovered from the homogenizer. Inspect the homogenate preparation for any grossly intact tissue transferred. Remove the non-homogenized pieces and weigh as necessary.\nSubtract the tissue weight recovered from the weigh boat, homogenizer, and homogenate (if necessary) from the initial wet weight to calculate the final sample weight.\nUsing the final sample weight, add additional MiR05 to bring homogenate to the desired concentration (see step 5 for details regarding optimization experiments).\nOnce the homogenate is weighed and prepared, proceed to assay as soon as possible. Keep the sample stored on wet ice until it is transferred to the instrument.\n5. Substrate, uncoupler, inhibitor titration protocol (SUIT)",
    "Once the instrument is calibrated, and the sample is prepared, remove the stoppers with a twisting motion and aspirate the MiR05 from the chambers (avoiding the membrane exposed inside the chamber). Mix the homogenate well and add 2.25 mL of the homogenate to the chamber. If adding one homogenate to multiple chambers, pipette 1 mL at a time into each chamber while mixing the homogenate to ensure equal tissue distribution. Click on F4 to name and time stamp the event and then click on OK.\nFill a 50 mL syringe with oxygen from an oxygen tank with a regulator and gas tubing using a blunt 18 G needle. Hyperoxygenate the chambers to ~500 µM oxygen. For this, inject oxygen directly into the chambers. Loosely insert the stoppers and wait to close until the oxygen reaches ~480 µM. With a twisting motion, slowly close the chamber and allow the respiration to equilibrate (~15-20 min). Fill the stopper central capillary with MiR05 if necessary.\nAnalytical determination of the OXPHOS and ET (electron transfer state) capacity of N-linked and NS-linked and CIV (Complex IV) activity: Use dedicated microsyringes to inject substrates, uncouplers, and inhibitors into fully closed chambers. Click on F4 with each injection to name and time stamp the events for each chamber in real-time. Throughout the study, select F6 to adjust the O2 concentration and O2 slope neg. scales as needed. After each injection, wash the syringes 3 times in water (for water-soluble compounds) or 70% ethanol (for compounds dissolved in ethanol or DMSO).\n\tNOTE: N-linked: O2 flux supported by defined NADH-generating substrate combinations, NS-linked: O2 flux supported by the convergence of defined NADH-generate substrate combinations and succinate.",
    "Add 5 µL of 0.8 M Malate (2 mM final concentration) and proceed immediately to the next injection. Wash the injection syringe 3 times in water.\nImmediately add 5 µL of 1 M Pyruvate (2.5 mM final concentration) and wait for the respiration to stabilize. Wash the injection syringe 3 times in water.\nAdd 10 µL of 0.5 M ADP (2.5 mM final concentration) and wait for the ADP response to stabilize. Wash the injection syringe 3 times in water.\n\t\tNOTE: Additional ADP (2.5-10 mM) may be required to ensure that the adenylate concentrations are not limiting to respiratory fluxes.\nAdd 5 µL of 2 M Glutamate (5 mM final concentration) and wait for the respiration to stabilize. Wash the injection syringe 3 times in water.\nAdd 5 µL of 4 mM Cytochrome c (10 µM final concentration) and wait for the respiration to stabilize. Wash the injection syringe 3 times in water.\nAdd 20 µL of 1 M Succinate (10 mM final concentration) and wait for the respiration to stabilize. Wash the injection syringe 3 times in water.\nTitrate 0.5-1 µL increments of 1 mM FCCP (2-20 µM final concentration) and wait for the respiration to stabilize after each injection, continue until there is no additional increase in respiration. Wash the injection syringe 3 times in 70% ethanol.\nAdd 2 µL of 150 µM Rotenone (150 nM-2 µM final concentration) and wait for the respiration to stabilize. Add another 1 µL of Rotenone to insure there is no further inhibition. If there is a decrease in respiration, continue with additional injections until there is no decrease in respiration. Wash the injection syringe 3 times in 70% ethanol.",
    "Add 2 µL of 125 µM Antimycin A (125 nM-5 µM final concentration) and wait for the respiration to stabilize. Add another 1 µL of Antimycin A to insure there is no further inhibition. If there is a decrease in respiration, continue with additional injections until there is no decrease in respiration. Wash the injection syringe 3 times in 70% ethanol.\nCheck the oxygen concentration of the chamber; if the concentration is below 125 µM, reoxygenate to room air or mildly hyperoxygenate to ensure that oxygen does not limit the respiratory flux. Add 5 µL of 0.8 M Ascorbate (2 mM final concentration). Wash the injection syringe 3 times in 70% ethanol.\nImmediately add 10 µL of 0.2 M TMPD (1 mM final concentration) wait for an increase in respiration slow. Wash the injection syringe 3 times in 70% ethanol.\nAdd 25 µL of 4 M Sodium Azide (50 mM final concentration) immediately when the respiratory flux of Ascorbate/TMPD plateaus. Wash the injection syringe 3 times in 70% ethanol.\nEnd the study- click on File, Save and Disconnect. Continue to wash the chamber and syringe following steps 9.2-9.3.\n6. ADP sensitivity protocol\nOnce the instrument is calibrated and the sample is prepared, remove the stoppers with a twisting motion and aspirate the MiR05 from the chambers (avoiding the membrane exposed on the inside of the chamber). Mix the homogenate well and add 2.25 mL of the homogenate to the chamber. Suppose adding one homogenate to multiple chambers, pipette 1 mL at a time into each chamber while mixing the homogenate to ensure equal tissue distribution. Click on F4 to name and time stamp the event and click on OK.",
    "Insert the stoppers, and with a twisting motion, slowly close the chamber and allow the respiration to equilibrate (~15-20 min). Fill the stopper central capillary with MiR05 if necessary.\nAnalytical determination of succinate-linked mitochondrial ADP sensitivity: Click on F4 with each injection to name and time stamp the events for each chamber in real-time. Throughout the study, select F6 to adjust the O2 concentration and O2 slope neg. scales as needed.\n\t\nAdd 2 µL of 150 µM Rotenone (150 nM final concentration).\nImmediately add 20 µL of 1 M Succinate (10 mM final concentration) and wait for the respiration to stabilize.\nTitrate ADP by stepwise addition of sub-saturating concentrations until reaching the maximal response rate (VMAX; 2.5-10 mM final concentration).\n\t\t​NOTE: The rate may plateau after injection due to a small change in ADP concentration, thus increase the injection concentration after each plateau and continue with the titration until there is no further increase in respiration even with a fold increase in ADP injection concentration.\n7. Recommended optimization experiments\nDetermine optimal homogenate and oxygen concentration for protocol.\n\t\nPerform SUIT protocol (steps 5.1-5.3) at multiple tissue concentrations (e.g., 30 mg/mL, 20 mg/mL, 10 mg/mL, 5 mg/mL, 2.5 mg/mL, 1 mg/mL, and/or 0.5 mg/mL).\nSelect a concentration that maximizes the respiratory flux while limiting the frequency of reoxygenations (no more than 1-2). If more frequent reoxygenations are required, decrease the concentration of the homogenate.\nDetermine the optimal number of strokes with the homogenizer.\n\t\nPerform SUIT protocol (steps 5.1-5.3) at multiple levels of homogenization (e.g., 5 strokes, 10 strokes, 15 strokes, 20 strokes).\nSince there are insufficient data in the literature to determine a threshold of the percentage increase of cytochrome c with tumor homogenate preparation, choose the preparation with limited cytochrome c response but adequate respiration energized by the substrate(s) of interest.",
    "Determine the optimal substrate, ADP, uncoupler, and inhibitor concentrations required for quantitative and reproducible respiratory fluxes.\n\t\nPerform SUIT protocol (steps 5.1-5.3.9) at the chosen tissue concentration (step 7.1). Titrate each substrate, uncoupler, inhibitor, and ADP until no further response is observed. Titrate the inhibition with sodium azide in separate experiments.\n\t\t\nAdd 5 µL of 0.8 M Malate (2 mM final concentration) and proceed immediately to the next injection.\nTitrate 1 µL increments of 1 M Pyruvate and wait for the respiration to stabilize after each injection, continue until there is no additional increase in respiration.\nTitrate 2 µL increments of 0.5 M ADP and wait for the respiration to stabilize after each injection, continue until there is no additional increase in respiration.\nTitrate 1 µL increments of 2 M Glutamate and wait for the respiration to stabilize after each injection, continue until there is no additional increase in respiration.\nAdd 5 µL of 4 mM Cytochrome c (10 µM final concentration) and wait for the respiration to stabilize.\nTitrate 5 µL increments of 1 M Succinate and wait for the respiration to stabilize after each injection, continue until there is no additional increase in respiration.\nTitrate 5 µL increments of 0.5 M ADP and wait for the respiration to stabilize after each injection, continue until there is no additional increase in respiration.\nTitrate 0.5 µL increments of 1 mM FCCP and wait for the respiration to stabilize after each injection, continue until there is no additional increase in respiration.\nTitrate 1 µL increments of 150 µM Rotenone and wait for the respiration to stabilize after each injection, continue until there is no decrease increase in respiration.",
    "Titrate 1 µL increments of 125 µM Antimycin A and wait for the respiration to stabilize after each injection, continue until there is no additional decrease in respiration.\nAdd 5 µL of 0.8 M Ascorbate (2 mM final concentration).\nImmediately add 5 µL of 0.2 M TMPD (.5 mM final concentration) wait for increase in respiration slow. In a separate experiment, add 10 µL of 0.2 M TMPD (1 mM final concentration).\nIn separate experiments add, 10 µL, 25 µL, 50 µL, and 100 µL of 4 M Sodium Azide (20 mM, 50 mM, 100 mM, 200 mM final concentration, respectively) immediately when the respiratory flux of Ascorbate/TMPD plateaus.\nChoose the substrate and inhibitor concentrations that are saturating within the first injection to improve the timing of the experiment. Use ADP at saturating or sub-saturating concentrations to combine ADP sensitivity evaluations with traditional SUIT protocols.\nUse sub-maximal uncoupler concentrations to demonstrate the dose-responsiveness without inhibition of respiration flux.\n8. Data analysis\nSUIT analysis\n\t\nSelect the steady-state or peak rates from each titration and export for analytical reduction.\nExpress the data as pmol O2 per second per mg of tissue (pmol/s/mg).\nAchieve the analytical reduction of PM-L, PM-P, PMG-P, PMGS-P, and PMGS-E by subtracting antimycin A insensitive rate from the respective rate (i.e., steady-state rate obtained after addition of ADP).\n\t\tNOTE: PM: Pyruvate + Malate; PMG: Pyruvate + Malate + Glutamate; PMGS: Pyruvate + Malate + Glutamate + Succinate; -L:Leak state; -P: Oxidative phosphorylation state, -E: Electron transfer state.\nAchieve the analytical reduction of CIV-E by subtracting the sodium azide insensitive rate from the peak ascorbate/TMPD rate.\nAchieve the analytical reduction of PMG-E by subtracting the rotenone insensitive rate from the PMGS-E rate.\nAchieve the analytical reduction of S-E by subtracting the antimycin A insensitive rate from the rotenone insensitive rate.",
    "Achieve the analytical reduction of cytochrome c control efficiency, a marker of outer membrane intactness, by the following equation:\n\t\tjc = ((JCHNOc - JCHNO)/JCHNO) x 100\n\t\tIn the equation, jc is the % increase upon addition of cytochrome c, JCHNOc is the oxygen flux after the addition of cytochrome c, and JCHNO is the oxygen flux prior to the addition of cytochrome c.\nADP sensitivity analysis\n\t\nAnalytically determine the kinetics for the ADP sensitivity relative to the leak rate of succinate + rotenone (not the rate of the tissue homogenate).\nPlot the O2 flux (Y-axis) against the relative ADP concentration (X-axis). Determine the maximum respiratory velocity (Vmax) as the peak rate achieved over the ADP titration.\nDetermine the Michaelis-Menten kinetics using a curve fitting software (PRISM, version 10.1) to reveal the ADP concentration at which 1/2 VMAX is achieved (Apparent KM).\n9. Instrumental quality control\nPerform instrumental O2 background over the desired oxygen concentration range (0-600 µM) and zero calibration.\n\t\nComplete steps 3.1 and 3.2\nRemove the stoppers and aspirate the 70% ethanol from the chambers (avoiding the membrane exposed on the inside of the chamber). Rinse 4 times with double distilled H2O, and fill the chamber with 2.25 mL of MiR05\nHyperoxygenate the chambers to ~600 µM oxygen.\nInsert the stoppers slowly to their fully closed position. Siphon off the excess medium ejected through the injection capillary and collected in the well of the stopper and allow the oxygen signal to stabilize (30-45 min).\nTo perform oxygen calibration, select the region where both the oxygen concentration and slope are stable, open the calibration window for the respective chamber, and select the R1 mark.",
    "Prepare the dithionite solution by dissolving 20 mg of sodium hydrosulfite in 0.5 mL of water. Limit the exposure to air as dithionite is oxidized over time with exposure to oxygen.\nOnce the oxygen signal is stabilized, inject 1 µL and observe the decline in oxygen concentration. Adjust the potency of the dithionite solution as needed.\nInject sufficient dithionite solution to lower the oxygen concentration to 450 µM, 300 µM, 225 µM, 150 µM, 75 µM, and 0 µM, respectively. At each injection, allow the oxygen to stabilize and select a mark for the steady-state slope. Once the oxygen concentration is ~0 µM, mark the oxygen concentration.\nTo perform instrumental O2 background correction, select the flux/slope window for the respective chamber, select O2 Background Calibration, and click on Calibrate for the marks of interest.\nTo perform zero calibration, open the calibration window for the respective chamber, and select the R0 mark attained after dithionite titration.\nInstrument cleaning\n\t\nQuickly rinse each chamber with pure water three times. For the first wash, aspirate the homogenate, fill the chamber fully with water, and then aspirate the water. For the second wash, fill the chamber ¾ full of water, insert the stoppers to force water through the injection capillary, aspirate some of the water through the injection capillary and then remove the stoppers to aspirate wash fully.\nWash the chambers with 70% ethanol for 5 min.\nOver a sink or beaker, clean the stoppers with pure water, 70% ethanol, and 100% ethanol, forcing fluid through the injection capillaries using a wash bottle.\nQuickly rinse each chamber with pure water two times.\nIncubate the chambers with 2 mL of PBS containing ~2 mg of frozen mitochondria, cell lysate, or living fibroblasts for 15 min.\nWash the chambers with pure water for 5 min two times.",
    "Wash the chambers with 70% ethanol for 5 min two times.\nWash the chambers with 100% ethanol for 10 min.\nFill the chambers with 70% ethanol.\n\t\t\nIf running a consecutive experiment, leave the chambers in 70% ethanol for 5 min and then continue to step 3.3.\nIf experiments are complete, put lids on the stoppers and turn off the instrument.\nAfter each use, properly clean the injection syringes and keep the syringes dedicated for specific compound use to prevent carry-over.\n\t\nInsert the syringe into the wash fluid and fully submerge the injection needle.\nDraw up the wash fluid into the syringe to the maximum volume.\nRemove the syringe from the wash container, eject the wash fluid into a beaker and then blot the syringe on a paper towel.\nRepeat steps 9.3.1-9.3.3 three times as soon as possible after each use."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}