{
  "id": 9184,
  "origin_website": "Jove",
  "title": "Functional and Morphological Assessment of Diaphragm Innervation by Phrenic Motor Neurons",
  "procedures": [
    "Experimental procedures were approved by the Thomas Jefferson University institutional animal care and use committee and conducted in compliance with the European Communities Council Directive (2010/63/EU, 86/609/EEC and 87-848/EEC), the NIH Guide for the care and use of laboratory animals, and the Society for Neuroscience’s Policies on the Use of Animals in Neuroscience Research.\n1. Compound Muscle Action Potentials (CMAPs)\nPreparing the animal:\n\t\nAnesthetize the rat using an inhalant (isoflurane) at 1-2% delivered to effect or by injection (ketamine, xylazine, acepromazine). Dosage of injectable anesthesia is as follows: 95.0 mg/kg of ketamine, 10.0 mg/kg of xylazine, 0.075 mg/kg of acepromazine.\n\t\tNOTE: We successfully use both inhalant and injectable anesthetic approaches when conducting this CMAP recording protocol, with no preference.\nThe animal must be maintained at the appropriate anesthetic depth before the surgery is started, through the conclusion of surgery, and until post-operative buprenorphine has taken effect. Confirm proper anesthetization by brief toe pinch to determine that a withdrawal response is not elicited. Additionally, test the corneal reflex with a cotton swab. Throughout the surgical procedure, determine that heart rate and respiratory rate have not increased, which suggests that anesthetic depth has become too light.\nApply a vet ointment on the animal’s eyes to prevent dryness while under anesthesia.",
    "The surgeon should wash her/his hands with a disinfectant (chlorhexidine scrub) before beginning surgery. The surgeon should wear sterile gloves, facemask, and gown or clean lab coat. All instruments should be washed and autoclaved before surgery. Add a sterilization indicator strip inside the instrument kit before autoclaving at the level of the instruments to verify that sterilization is complete. The surgeon should verify that the entire line on the strip is black before beginning surgery. Tape the outside of the box with indicating autoclave tape as well. If surgery is to be performed on several animals on the same day, clean the instruments between surgeries and sterilize in a glass bead sterilizer. If necessary, sterilize both ends of the instrument in the glass bead sterilizer by placing the handle of the instrument in the sterilizer for the appropriate time, removing the instrument with a sterile hemostat, cooling it in a sterile field and then placing the functional end of the instrument into the glass bead sterilizer for the appropriate period of time.\nOnce animal is anesthetized, place on surgical board with dorsal surface down and abdomen facing up so that tape can be used to secure animal’s forelimbs to surgical board.\nShave ventral surface caudally beginning at the base of the skull, and ensure that the area around abdomen on either side of the midline is shaved depending on which hemi-diaphragm is being recorded. Apply povidone-iodine to the shaved surface of the skin.\nPreparation for CMAP recordings:\n\t\nFollowing animal preparation, place ground electrode subcutaneously into tail (Figure 1).\nPlace the reference electrode subcutaneously into the contralateral lower abdominal region.\nPlace conductive gel onto self-adhesive surface strip or disk recording electrode (dimensions of surface strip electrode: 0.5 x 3 cm), and then place surface electrode transversely along the unilateral costal margin.",
    "Place stimulating electrodes transcutaneously 0.5 cm apart lateral to trachea and superior to the clavicle. Insert the electrodes approximately 1.0 cm deep through the skin. Secure the electrodes by hand so that their location does not move with subsequent stimulations.\n\t\tNOTE: Angle stimulating electrodes 90° relative to the skin at the site of insertion.\nCompound Muscle Action Potential (CMAP) recordings:\n\t\nObtain electrophysiological recordings using a stimulator/amplifier followed by computer assisted data analysis.\nThe stimulus parameters of single pull stimulation should be 0.5 msec, 1.0 Hz supramaximal pulses. The amplitude of the stimulus should be between 6.0 and 8.0 V (Figure 2A).\n\t\tNOTE: Within an experiment, use a stimulus intensity with the same amplitude across animals. The objective is to maximize the response amplitude by using the minimal amplitude of stimulation. It is important to note that the initial response that occurs at the time of stimulation is a stimulation artifact. In addition, care should be taken to obtain a CMAP response that is preceded by a stable/flat baseline after the stimulation artifact, which is then followed by the rapid CMAP response. In order to obtain such a response, it may be necessary to reposition the stimulation and/or recording electrodes.\nWait 30 sec between stimulations, and repeat 10 stimulations in a row to obtain the average response (Figure 2B-C). Measure the amplitude from baseline to peak (Figure 2A). Conduct phrenic nerve stimulation during the phase of the animal’s respiratory cycle when the phrenic nerve/diaphragm is not activated. The procedure can be repeated on the same animal for the contralateral hemi-diaphragm.\nAfter the final CMAP recording session, perfuse the animal if NMJ staining will be conducted. Conduct CMAP recordings repeatedly on the same animal approximately once every week (or at interval of choice).",
    "Following survival CMAP recordings, allow animal to recover on a circulating warm water heating pad, and continuously monitor during recovery until awake and sternally recumbent. Do not return an animal that has undergone surgery to the company of other animals until fully recovered.\nOnce sternally recumbent, monitor the animal every 12 hr for the first 48 hr (once daily thereafter). If the animal appears to be dehydrated (flaccid skin, listlessness), administer fluids (lactated ringers solution; subcutaneously; 1-2 ml per injection, with the sites rotated; 2 times per day) until post-surgical weight and fluid loss stabilizes. Provide animals with softened food in small dishes during the acute post-operative period if necessary to encourage eating if they cannot reach the wire bar lid feeder.\nAdminister buprenorphine at a dose of 0.05 mg/kg before the end of surgery and then at 12 hr intervals for the first 24 hr (and dependent upon signs of pain/stress thereafter) via subcutaneous injection (site rotated). If signs of pain or distress are noticed thereafter, treat animals with buprenorphine. Signs indicative of pain/distress include lack of activity, vocalizations, lack of eating or drinking (dehydration), excessive weight loss, guarding, excessive gnawing or scratching at site of incision. Additional criteria used in determining pain and distress include unresponsiveness to extraneous stimuli, transient or unprovoked vocalization, labored or abnormal breathing, persistent reddish-brown naso-occular discharge, marked piloerection. Also monitor evidence of poor hygiene that would suggest ill animals. If animal is still observed to be in distress after 72 hr of treatment (according to the pain/stress criteria outline above, and after receiving the analgesic protocol described above) euthanize the animal.\n2. Diaphragm Neuromuscular Junction (NMJ) Analysis\nAnimal dissection:",
    "Administer the animal an overdose of injectable anesthesia (3 times dose used above: ketamine at 285.0 mg/kg, xylazine at 30.0 mg/kg, acepromazine at 0.225 mg/kg; administered intraperitoneally). Following overdose, all animals should have a second method of euthanasia (thoracotomy) to ensure death. Death should be confirmed by observing cardiac and respiratory arrest and by noting the animal's fixed and dilated pupils.\nConduct a laparotomy with scalpel or dissection scissors extending the excision from the zyphoid process caudally along the midline. Carefully separate skin and connective tissue from underlying muscle using scalpel and forceps.\nWhile pulling up on the zyphoid process, use dissection scissors to remove whole diaphragm, ensuring that the diaphragm remains attached to surrounding bone. This is important as it will prevent damage to the diaphragm muscle, will allow for successful dissection of the entire diaphragm and will aid in cleaning muscle for subsequent staining.\n\t\tNOTE: At this point, animal can be perfused if necessary.\nCleaning and staining of the diaphragm:\n\t\nPin down the whole dissected diaphragm, superior surface facing up, to silicone rubber in a glass 100 mm Petri dish in 4% paraformaldehyde (made in 1% phosphate buffered saline - PBS) for 20 min using a stereomicroscope. Stretch the diaphragm to make it taut, and using insect pins, pin down the surrounding tissue to avoid pinning the diaphragm muscle itself (Figure 3).\nCarefully clean off connective tissue from only the superior surface of muscle with #5 forceps and small scissors.\n\t\tNOTE: Carry out all subsequent steps of this staining protocol slowly rocking at room temperature covered from light unless otherwise specified. Ensure that the diaphragm muscle is always completely submerged in liquid to avoid drying out.",
    "Prior to staining, prepare all necessary reagents: 1x PBS, 2% bovine serum albumin (BSA)/PBS, 0.1 M glycine made in 2% BSA/PBS, 4% paraformaldehyde (PFA) in 1x PBS, and 0.2% TBP (0.2% Triton X100 in 2% BSA/PBS). Be sure to pre-cool methanol at -20 °C.\nWash 3x for 10 min in 1x PBS.\nIncubate in 0.1 M glycine (made in 2% BSA/PBS) for 30 min.\nIncubate in RBTX (rhodamine-conjugated α-bungarotoxin) solution for 15 min. Solution for RBTX is as follows: Rhodamine-conjugated alpha bungarotoxin 1:400 dilution in 1x PBS.\n\t\tNOTE: In this protocol, Rhodamine is used, but any fluorophore of choice can be used for staining.\nWash 3x for 10 min in 1x PBS.\nIn -20 °C freezer, incubate with MeOH for 5 min.\n\t\tNOTE: Do not add MeOH before placing muscle in the freezer, and immediately remove solution following the incubation period.\nWash 3x for 10 min in 1x PBS.\nBlock in 0.2% TBP for 1 hr (0.2% Triton made in 2% BSA/PBS).\nIncubate with primary antibody solution (in 0.2% TBP) at 4 °C overnight while rocking. Dilutions of antibodies as follows: SV2 (1:10) and SMI-312 (1:1,000).\nWash 3x for 10 min with 0.2% TBP.\nIncubate with secondary antibody using 1:100 dilution of FGM1 (FITC-conjugated goat anti-mouse IgG1; made in 0.2% TBP) while rocking for 1 hr.\n\t\tNOTE: Protect from light for the rest of the protocol for staining.\nWash 3x for 10 min with 1x PBS.\nRe-clean surrounding connective tissue on the superior (see above) surface of muscle prior to mounting and coverslipping.\n\t\tNOTE: It is recommended to clean and then mount sample immediately after staining. However, if necessary, sample may be covered in 1x PBS, wrapped in parafilm to prevent evaporation and stored at 4 °C for up to 1 week, with changing of PBS daily.",
    "Upon mounting on glass slide, coverslip with non-hardset Vectashield. Seal edges of coverslip with clear nail polish to prevent drying out. Store slides lying flat in cardboard slide folders in -20 °C for long term.\nAnalysis and Confocal Imaging:\n\t\nQuantitatively analyze the morphology of the stained and mounted hemi-diaphragm under 20X and 40X magnification using an upright epifluorescence microscope.\n\t\tNOTE: Because the diaphragm is stained and analyzed in a whole-mount fashion, the muscle is quite thick. Consequently, most of the fluorescence staining is completely out of focus when a static image is taken using non-confocal fluorescence microscopy. For this reason, it is best to conduct the NMJ analysis in real-time on the microscope as this allows you to constantly focus “up” and “down” through the muscle to properly identify the morphology of each of the individual NMJs. Using this approach, one can easily follow the trajectory of individual motor axons as they move through the tissue in spatial relationship to the post-synaptic receptor clusters.\nBy measuring the ventral-to-dorsal length of the muscle, divide the muscle into 3 separate sections for analysis based on topographic innervation patterns from specific spinal cord levels (Figure 4H).\nBeginning at the ventral region of the muscle and moving dorsally, analyze all en face NMJs located on surface muscle fibers. Do not analyze muscles fibers deeper than the first 3-4 fibers from the surface as interpretation may be difficult due to poorer antibody penetration (RBTX penetrates much deeper into the muscle due to the small size of the toxin compared to the larger antibodies used to label neurons).\nIdentify each NMJ as intact if the pre-terminal axon of the neuron is thick in diameter and all regions of the nerve terminal completely overlap with the underlying muscle acetylcholine receptors (AChRs).",
    "Identify each NMJ as partially denervated if any region of the underlying muscle AChRs is unoccupied with corresponding nerve terminal.\nIdentify each NMJ as completely denervated if the muscle AChRs have no corresponding nerve terminal (it is also important to have other NMJs with labeled neurons in the same field of focus, so that one can be sure the lack of nerve terminal is not simply due to poor antibody penetration in that region of muscle).\nIdentify each NMJ as multiply innervated if there is more than one pre-terminal axon innervating an individual NMJ (this indicates that there has been some level of denervation and likely attempts of reinnervation at this junction).\nIdentify each NMJ as thinly innervated if the NMJ has complete overlap between nerve terminal and underlying AChRs but has a thin pre-terminal axon (this also is indicative of some level of denervation and attempts at reinnervation).\nConduct analysis for each of the 3 identified regions for all of the above NMJ categories for each animal. Average the data from each animal with results from other animals from the same experimental group. Approximately 200-300 junctions in rat hemi-diaphragm muscle and 150-200 in mouse hemi-diaphragm should be quantified in at least 3 (preferably 5-6 or more) animals per experimental group.\nObtain high-resolution confocal images, used for publication, with a confocal microscope.\nObtain Z-stacks at 0.3 μm step size for 20-40 μm depths, and collect additional optical sections above and below each junction to ensure that the entire synaptic profile is included.\nUse acquisition software to reconstruct z-series images into maximum intensity projections.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}