{
  "id": 9950,
  "origin_website": "Jove",
  "title": "The Use of Traditional Fear Tests to Evaluate Different Emotional Circuits in Cattle",
  "procedures": [
    "All methods described here have been approved by the Institutional Animal Care and Use Committee (IACUC) of Texas A&M University (IACUC2016-0356).\n1. Animal and housing\nHouse yearling ¼ Bos indicus x ¾ Bos taurus steers (n = 32) from the same herd in two drylot pens (n = 16 steers/pen) for 7 days prior to test commencement. At the beginning of the study, steers weighed 270.9 ± 14.8 kg and were fed the same standard growing ration throughout the study.\nVisually evaluate steers daily as part of routine husbandry practices. No steers received medical treatment throughout the duration of the study.\n2. Description of the tests\nTest 1: Exit velocity\n\t\nPlace electronic timers in front of a handling chute so that the distance between the starting and stopping points is 1.8 m. These timers are designed to start timing when the animal breaks the first electronic beam and stop when the animal breaks the second electronic beam.\nMove cattle through the handling facility.\nCatch each animal in the headgate of the chute and keep it restrained for 10 s.\nAfter 10 s, release the animal from the headgate.\nWith the electronic timer, record the time it takes for the animal to traverse 1.8 m from the chute.\nCalculate the velocity of the animal as it leaves the chute by dividing 1.8 m by the time it took for the animal to traverse the 1.8 m after release from the headgate and chute.\n\t\tNOTE: Other publications have used this data collection strategy8,9,10,11.\nTest 2: Chute score\n\t\nMove the cattle through the handling facility.\nCatch each animal in the headgate of the chute for 10 s without applying pressure to its body.",
    "Have someone observe the cattle for the 10 s and assign each animal a score according to the 2019 Beef Improvement Federation Guidelines for Uniform Beef Improvement Programs 9th Edition (Table 2) based upon its behavior while being restrained.\nAfter 10 s, release animal from the headgate and chute.\n\t\tNOTE: Other publications have used this data collection strategy12,13,14.\nTest 3: Pen score\n\t\nPlace a group of five cattle in a pen (7.3 m W x 7.3 m L x 2.4 m H).\nHave a single human observer that is unknown to the cattle enter the pen on foot and close the gate after entering the pen.\nHave the observer take two steps towards the group of cattle.\nVisually observe each animal's behavior in response to the observer.\nWithin 30 s of entering the pen, assign each animal a score according to the 2019 Beef Improvement Federation Guidelines for Uniform Beef Improvement Programs 9th Edition (Table 3).\nClean the testing arena from urine and feces in between groups of animals.\n\t\tNOTE: Other publications that have used this data collection strategy10,11.\nTest 4: Bovine zero maze\n\t\nConstruct a Bovine Zero Maze (BZM).\n\t\t\nUse cattle panels to create a circular track 1.6 m wide, with the inner and outer diameters measuring 6.6 m and 8.2 m, respectively (Figure 1).\nDivide the BZM into four quadrants of equal length with two opposing open quadrants and two opposing closed quadrants where the panels are covered with shade cloth and the shade cloth is stretched across the inner and outer rings of the maze to make a roof over the closed portions of the maze.",
    "If the test is conducted outdoors, to minimize variation due to shadows, orient the BZM such that the closed sections of the maze face north and south and conduct tests at approximately noon each test day.\nMount a video camera(s) to capture the entire arena. Turn the camera on and begin recording.\nUsing low stress handling practices, move a single animal into an open portion of the maze, and allow the animal to explore the arena for 10 min.\nAt the end of the 10 min observation period, return the animal to its home pen.\nClean the testing arena from urine and feces in between animals.\nDecode the video recordings for frequency and latency of steps, escape attempts, kicks, urinations, defecations, vocalizations, standing bouts, duration of time spent standing, duration of time spent walking, latency to enter closed areas, number of times the animal enters closed areas, amount of time in closed/open portions, number of transitions between open/closed arms. Metrics were identified based upon previously published work15.\nTest 5: Individual Startle Test and the Group Startle Test\n\t\nConstruct an arena (7.3 m W x 7.3 m L x 2.4 m H) that has a solid, uniform ground surface free of vegetation or manure, and two closed umbrellas at opposite ends of the arena (Figure 2). The umbrellas should be designed so that they open suddenly at the push of a button.\n\t\t\nEnsure that the sides of the arena are solid or covered with plywood or shadecloth to ensure that the animal cannot see outside of the arena.\nCut a hole at approximately cattle head height on opposite sides of the arena for the umbrella to penetrate through.\nMount a video camera(s) to capture the entire arena. Turn the video camera on and begin recording.",
    "Using low stress handling practices, move a single animal into the testing arena. For the group startle test introduce a small group of approximately four animals.\nAfter the animal(s) has been in the arena for 60 s, open the two umbrellas simultaneously.\nLeave the animal(s) in the arena for 4 min after the umbrellas have opened.\nClean the testing arena from urine and feces in between tests.\nDecode the video recordings for the frequency and latency of steps, escape attempts, touching the umbrellas, kicks, urinations, defecations, vocalizations, standing bouts, duration of time spent standing, steps in the first 60 s of testing, and steps in the 60 s after the umbrellas were opened for each animal. Metrics were identified based upon previously published work16.\nTest 6: Open field test\n\t\nConstruct a square arena (7.3 m W x 7.3 m L x 2.4 m H) that has a solid, uniform ground surface free of vegetation or manure. The sides of the arena should be solid or covered with plywood or shadecloth to ensure that the animal cannot see outside of the arena.\nMount a video camera(s) to capture the entire arena. Turn the video camera(s) on and begin recording.\nUsing low stress handling practices, move a single animal to the center of a solid sided open field testing arena.\nLeave the animal in the arena for 10 min.\nAfter 10 min, return the animal to its home pen.\nClean the testing arena from urine and feces in between animals.\nDecode the video recordings for the frequency and latency to first step, escape attempts, kicks, urination, defecation, vocalization, standing bouts, duration of time spent standing, duration of walking, number of steps taken, number of steps taken during the first 60 s of testing. Metrics were identified based upon previously published work17,18,19.",
    "3. Statistical analysis\nEvaluate inter- and intra-test repeatability using a Pearson's Correlation (PROC CORR) and reliability calculated using Cronbach's alpha (PROC CORR). Conduct a validity of response variables with relation to average daily gain (ADG) using a regression analysis (PROC REG).\nAfter standardizing the variables (PROC STANDARD), use a Cluster Analysis (PROC VARCLUS) to identify relationships among variables from within and among different tests. Many of these variables may be regressed against production metrics to identify production-relevant relationships among cattle behavior during these tests and productivity."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}