{
  "id": 9909,
  "origin_website": "Jove",
  "title": "Laboratory Scale Production and Purification of a Therapeutic Antibody",
  "procedures": [
    "NOTE: A suitable mammalian expression vector must be used for this protocol. Here, a single construct containing two expression cassettes is used (i.e. heavy and light chain expression is driven by separate promoters). Trastuzumab heavy and light chains were previously cloned into the vector. This vector was a gift from Andrew Beavil, obtained through a not-for-profit plasmid repository 13.\n1. Recovery and Scale-up of Vector DNA\nNOTE: Vector DNA was received as a soft agar stab culture in Escherichia coli XL-1 Blue strain; vector carries hygromycin resistance.\nInsert a sterile inoculation stab or loop into the soft agar of the stab culture then streak a Luria Bertani (LB) agar plate prepared with 75 µg/ml hygromycin for isolated colonies. Incubate the plate at 37 °C for 18-24 hr.\nInoculate a single colony into 5 ml Terrific broth (TB) containing 75 µg/ml hygromycin. Incubate the culture at 37 °C for 18-24 hr with 225 rpm shaking.\nUse the overnight culture to prepare a glycerol stock of vector DNA by gently mixing 800 µl of culture with 200 µl 80% glycerol in a cryovial and freeze at -80 °C.\n\t\nAdd 100 µl of the overnight culture to 100 ml TB containing 75 µg/ml hygromycin in a baffled shaker flask (i.e. 1/1,000 dilution). Incubate the culture at 37 °C for 18-24 hr with 225 rpm shaking.\nAfter overnight culture, extract and purify the DNA according to manufacturer's instructions of midi/maxi preparation kit with the following exception; during the final step, elute or resuspend DNA with water (pH 7.0-8.5).\nCheck concentration and purity of DNA by absorbance readings at 260 and 280 nm then store DNA at -20 °C.\n\tNOTE: Optional (highly recommended): Sequence DNA using vector-specific primers to confirm identity.\n2. Stable Transfection of HEK-293 Cells",
    "Grow and maintain HEK-293 cells (suspension cells) according to standard protocols in serum-free media supplemented with 0.1% non-ionic surfactant in Erlenmeyer flasks. Maintain at 2 x 105 cells/ml and subculture every fourth day. Culture cells at 37 °C with 5% CO2 and 120 rpm rotation.\n\tNOTE: Cells should have been in culture for no less than 4 days and no more than 4 weeks prior to transfection. HEK-293 cells grown as monolayers in serum-containing media can also be used for this procedure.\nOn the day prior to transfection, seed HEK-293 cells at 3 x 105 cells/ml in wells of a 12-well plate in 2 ml of Dulbecco's Modified Eagle Media (DMEM) supplemented with 10% heat-inactivated fetal bovine serum (FBS). On the day of transfection, check that cells have reached 80-90% confluency\nDilute DNA and polyethylenimine (PEI) separately in transfection media then mix together.\n\t\nDilute 1.25 µg vector DNA per well (15 µg for 12 wells) in 300 µl transfection media. Incubate at room temperature for 5 min.\nDilute 2.5 µl of 1 mg/ml PEI solution (30 µl for 12 wells; i.e. 1:2 ratio of DNA to PEI) in 300 µl transfection media. Incubate at room temperature for 5 min.\nAdd diluted DNA to diluted PEI, gently mix and incubate at room temperature for 15 min.\nAdd 50 µl of DNA/PEI mixture dropwise to each well of the plate. Rock the plate gently to distribute the transfection mixture then place the plate at 37 °C, 5% CO2 for 24 hr.\nAdd 50 µg/ml hygromycin B per well and return plate to 37 °C, 5% CO2 for 10 days.\n\tNOTE: By Day 10, un-transfected cells will have died and detached from the surface of the plate, whereas stably-transfected cells will be viable and attached to the plate.",
    "Replace the media in wells with 1/4 volume serum-free media and 3/4 volume DMEM supplemented with 10% FBS (i.e. 0.5 ml serum-free media + 1.5 ml DMEM = 7.5% final serum concentration) and incubate for 4 days.\nReplace the media in wells with 1/2 volume serum-free media and 1/2 volume DMEM supplemented with 10% FBS (i.e. 1 ml serum-free media + 1 ml DMEM = 5% final serum concentration) and incubate for 4 days.\nReplace the media in wells with 3/4 volume serum-free media and 1/4 volume DMEM supplemented with 10% FBS (i.e. 1.5 ml serum-free media + 0.5 ml DMEM = 2.5% final serum concentration) and incubate for 4 days.\nReplace the media in wells with 2 ml of serum-free media supplemented with 0.1% non-ionic surfactant (i.e. 0% final serum concentration) and incubate for 4 days.\n\tNOTE: Maintain 50 µg/ml hygromycin B selective pressure on cells during serum-free adaptation. Cells adapted to serum-free media detach from the surface of wells and may cluster in suspension. Refer to step 2.1 for culture conditions with the additional supplement of 50 µg/ml hygromycin B.\nUsing a pipette, gently mix the suspension cultures in the 12-well plate and pool cells into a separate tube.\n\t\nUsing a hemocytometer, enumerate pooled cells and seed in 30 ml serum-free media in a Erlenmeyer flask at 2 x 105 cells/ml. Culture cells at 37 °C with 5% CO2 and 120 rpm rotation. Subculture and expand every fourth day.\nContinue to expand culture size to required cell density to obtain 10 vials at 1 x 107 cells/vial for cryopreservation in liquid nitrogen. Freeze the cells in serum-free media containing 10% dimethylsulfoxide (DMSO).",
    "NOTE: Conditioned media containing antibody can be harvested at each subculture to confirm protein production or used to optimize purification conditions. To harvest conditioned media and maintain cells for subculture, centrifuge the culture at 300 x g for 5 min then filter-sterilize supernatant through a 0.22 µm filter. Filtered supernatant may be kept at 4 °C for 1-2 weeks or -20 °C for longer term storage.\n3. Large Scale Antibody Production from Batch Overgrow Culture\nNOTE: Antibody production can be followed on from step 2.11 where existing cells are expanded to the required cell density based on the batch overgrow culture volume to be setup. Otherwise, cells that have been thawed from cryopreservation begin at this stage once expanded to an appropriate cell density and volume. Various culture supplements may be used to optimize antibody production; the use of tryptone to increase antibody yield is demonstrated in this protocol.\nSeed cells at 2 x 105 cells/ml in 100 ml serum-free media in two Erlenmeyer flasks (to compare antibody yields from un-supplemented and nutrient-supplemented cultures). Culture at 37 °C, 5% CO2 and 120 rpm.\nAfter 24 hr, add tryptone to a final concentration of 0.5% to nutrient-supplemented culture. Equalize volume of un-supplemented culture with serum-free media.\nFrom day 8, perform cell counts of the cultures daily using a hemocytometer to monitor cell viability. Harvest the culture supernatants once cell viability is less than 80%.\n\t\nHarvest supernatant by centrifugation of the cultures at 3,000 x g for 15 min then filter-sterilize the supernatant (containing antibody) through a 0.22 µm filter. Store the supernatants at 4 °C (short-term) or freeze at -20 °C (long-term).\n4. Antibody Purification by Affinity Chromatography Using an Automated Fast Protein Liquid Chromatography (FPLC) System",
    "NOTE: The following procedure can generally be applied to most automated systems. Purification can be performed at room temperature or at 4 °C (if FPLC system is kept in a cool room). A series of scouting tests can be performed to identify the optimal purification conditions including appropriate column matrix, binding buffer, elution buffer and pH to ensure maximum recovery of purified antibody from conditioned media (refer to Results section). The optimal conditions are dependent on the antibody or protein being purified. Purifications were performed on an automated FPLC system. Purifications were performed at room temperature using a 5 ml Protein A column.\nPrepare the following buffers using ultrapure water and adjust to the recommended pH then filter through a 0.22 µm filter.\n\t\nPrepare 1 L of phosphate buffered saline (PBS) pH 7.4 (binding buffer) by mixing the following: 0.14 M NaCl, 0.0027 M KCl, 0.01 M Na2HPO4 and 0.001 M KH2PO4. Adjust pH if necessary before filtering the buffer.\nPrepare 500 ml of 0.1 M glycine-HCl pH 2.7 (elution buffer). Adjust pH before filtering the buffer.\nPrepare 50 ml of 1 M Tris pH 9.0 (neutralization buffer).\nEnsure all system power and communication connections with computer are made. Devices should be visible in the software 'System Control' module. Ensure UV cell is set at 280 nm wavelength. Optional: Calibrate pH meter if connected and to be used.",
    "Immerse inlet tubes of A, B and sample pump in ultrapure water to wash the system. Purge the pumps with a syringe if there is air in the tubing or a suspicion of air in the system. Wash the system with water by manual operation via the system controller or via an automated method. Observe that pressure, conductivity, UV280 tracing and pH remain consistent and that the pressure limit for the column is not exceeded as per manufacturer's specification.\n\tNOTE: Abnormalities may indicate air or blockage in the system that should be addressed before proceeding.\nIn the system controller module, start the flowrate at 1 ml/min manually via pump A in either load (bypassing sample loop) or inject (through the sample loop) position to begin connecting the column. Disconnect system tubing at the column position inlet and remove the stopper connected to the column inlet.\n\t\nAllow water to flow from the system tubing dropwise on top of the column then attach the system tubing to the column. Having the column inlet and inlet fitting overflowing with drops of water ensures a connection free of air bubbles.\nAttach the column outlet at the downstream outlet and verify all fittings are tightly fastened. With the column now attached to the system, do not exceed limits for maximum pressure limit and flowrate as outlined in column specifications.\nWash column with 5 column volumes (CV) of water. If necessary, continue column wash until UV280 tracing has stabilized.\nImmerse inlet tubes of A in Binding buffer, B in Elution buffer and sample pump in Binding buffer to equilibrate the system in correct buffers. Fill the inlet tubes with buffer using PumpWash by manual operation.",
    "In the 'Method Editor' module of the software, use the method wizard to setup an affinity chromatography method for the column that is intended to be used.\n\tNOTE: Automated FPLC systems come with methods pre-filled with the recommended settings (i.e. flowrate and pressure limit) and run steps based on the column (manufacturer, matrix and size) selected for purification.\n\t\nUse the following run steps for Protein A affinity chromatography:\n\t\t\nEquilibrate system with 5 CV of Binding buffer and collect flowthrough into waste container.\nLoad sample onto the column (volume to be loaded is specified manually in the method) and collect flowthrough into a separate container.\nWash system with 5 CV of Binding buffer and collect flowthrough into a separate container.\nElute column with 5 CV isocratic fractionation using Elution buffer and collect purified antibody sample as fractions by fraction collector.\nEquilibrate system with 5 CV of Binding buffer and collect flowthrough into waste container.\nOnce the method has been setup, specify the volume of conditioned media to be applied to the column and save the method.\n\tNOTE: The specified volume in the method should be 5-10 ml less than the actual volume to avoid introduction of air during the sample run. The specified volume used in this protocol is 90-120 ml.\nSubmerge the sample pump tubing into the vessel containing the conditioned media.\nPrepare a separate container to collect sample flowthrough via the specified outlet tubing.\n\tNOTE: It is important to collect the flowthrough in the case an error occurs during the run or the binding capacity of the column is exceeded requiring the flowthrough to be reapplied to the column or the purification repeated.",
    "Prepare collection tubes in the fraction collector. Add 100 µl of neutralization buffer per 1 ml fraction volume. The FPLC system will automatically elute the fractions into the collection tubes.\nIn the 'System Control' module of the software, open the method to be run.\n\tNOTE: The method run is initiated in a series of pages that include checking the variables of the method, fraction collector setup and defining result file name and storage location.\nClick START to initiate the run. The run can be monitored in the 'System Control' module.\nAt the completion of the purification run, check the resulting chromatogram in the 'Evaluation' module in the system software.\nCombine all protein-containing fractions into a separate tube, buffer exchange and concentrate in PBS using a centrifugal filter device with 30 kDa molecular weight cut off. Perform centrifugation steps according to manufacturer's instructions.\nMeasure antibody concentration using bicinchoninic acid assay (BCA) according to manufacturer's instructions.\nIf another purification run is to be performed, prime the sample pump tubing in Binding buffer and repeat steps 4.9-4.14.\nAt the completion of purification runs, immerse inlet tubes of A, B and sample pump in ultrapure water and wash the system and column as performed in step 3.\nSubmerge A, B and sample pump tubing in 20% ethanol and repeat wash procedure for storage of the system and column.\nDisconnect the column from the downstream outlet and replace column stopper, then disconnect column at the inlet and replace stopper, reconnect tubing to the system. Store the column at 4 °C.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}