{
  "id": 14432,
  "origin_website": "Jove",
  "title": "Method for Simultaneous fMRI/EEG Data Collection during a Focused Attention Suggestion for Differential Thermal Sensation",
  "procedures": [
    "The following experimental protocol was reviewed and approved by the UCLA Institutional Review Board. Prior to commencing the experiment, subjects underwent a phone prescreening that excluded subject that were potentially pregnant, under the age of eighteen, or who had worked in a machine show or otherwise had metallic implants. Left-handed subjects, or those with a history of mental illness were also excluded from the subject pool. Included participants were then instructed to abstain from caffeine, drugs, and alcohol on the day of the experiment. Written informed consent and comprehension of consent was obtained from each participant on the day of the experiment.\n1. EEG Sensor Net Application\nThe EEG data are recorded using a 256-channel MRI compatible Geodesic Sensor Net. Impedance levels in electrodes should be monitored (step 1.5) at approximately 20 min intervals throughout the experiment to make sure that electrodes have not dried out and that impedances remain below threshold.\nDetermine proper net size by measuring the head circumference from the glabella brow ridge to approximately 2.5 cm above the inion.\nHydroCel Saline potassium chloride electrolyte solution was made according to EGI instructions. EEG Electrogeodesic 256 sensor net was then soaked in electrolyte solution for 10 min.\nThe vertex, or Cz, point on the head was determined by measuring the midpoint between nasion and inion and aligning this with the midpoint that dissects the preauricular points. The EEG net was then placed such that the Cz reference electrode aligns with the vertex point.\nWe collected photographic images of the head and electrodes using the EGI Geodesic Photogrammetry System (GPS) in order to calibrate the sensor space to be used in EEG source analysis.",
    "Electrode impedances were then measured. Contact with the scalp was checked for those electrodes with impedance levels above threshold. The electrodes placements are adjusted, and additional electrolyte solution was added to electrodes as necessary to reduce the impedance.\n2. Concurrent EEG/fMRI and Temperature Recording Protocol Prior to Hypnosis\nAfter the EEG net is applied appropriately, the subject proceeds to the MR scanner room. All metal objects are removed. Structural MRI and functional MRI scans are collected on a Siemens Allegra 3T scanner. Simultaneous EEG/fMRI data is collected prior to hypnotic induction in order to establish a functional baseline for each subject.\nMPRAGE Structural Scan\nT2 Matched Bandwidth - a specialized scanning sequence designed to provide good contrast for image registration, while sharing the same metric distortions as the functional scans that follow.\nFunctional Scan - T2*-weighted echo-planar pulse sequence with a TR=2.5 sec, TE=40 msec, Field of View=200 mm x 200 mm, Flip Angle=90°, collecting whole brain images with a resolution=64 x 64 x 28, voxel size=3 mm3. Data are collected for a total of five minutes.\nEEG data are concurrently recorded using an MR-Compatible Electrical Geodesics (EGI) 256-channel system during the five-minute functional MRI recordings to establish a baseline EEG prior to the hypnotic induction. Our lab has pioneered methods for simultaneous fMRI/EEG collection using software and hardware that removes MR artifact and balistocardiogram noise, in real-time (see reference25 for additional details).\nAfter the resting state scan, subjects listen to a tape that instructs them to visualize that their left hand is immersed in a bucket of cold ice water. Temperature differences between each hand are quantified using our differential thermometry device described below.\n3. Hypnotic Induction",
    "Subjects were then seated comfortably in a dimly lit, quiet room. EEG data were recorded throughout the duration of the hypnotic induction and progressive relaxation deepening technique.\nHypnotic induction began with a brief interview by the hypnotherapist to determine subject specific spatial cues that cause relaxation. Subjects were then asked a number of questions to determine if they were capable of visualizing.\nThe hypnotherapist then began the induction using an ideomoter suggestion known as the arm raising technique. During this time, the hypnotherapist continually gave the subject the suggestion that their arm felt as though it was getting lighter, and at some point their arm would rise in the air automatically without volitional effort. After the subject's arm elevated, they were then instructed to bend their arm and touch their forehead with their fingertips. As soon as the subject complied, the hypnotherapist asked the subject to close his or her eyes and relax as if in a deep sleep.\nLevel of hypnotic susceptibility was then assessed via the 12-point Stanford Scale of hypnotic susceptibility, form C test.\nA deepening technique, in the form of a progressive relaxation, was then used to bring the subject into a greater level of hypnotic depth.\nEEG data are recorded throughout the hypnotic induction in a dimly lit copper shielded room during the hypnotic induction.\n4. EEG/fMRI Data Collection and Differential Thermometry Post Hypnotic Induction\nFollowing hypnotic induction and progressive relaxation, the subject, again enters the MRI scanning room with the MR compatible EEG sensor net in continually in place. At this time, temperature sensors were taped onto the medial portion of both wrists. Wristbands were then placed over the taped temperature sensors to help stabilize placement.",
    "Temperature sensors should be configured according to the schematic in Figure 2. Calibration was performed prior to the experiment, and was accomplished by immersing sensor tips in two solutions of varying temperatures (37 °C± 5). Sensor output was checked against thermometer readings.\nThe subject then listens to a prerecorded progressive relaxation tape made by the hypnotherapist via MR compatible headphones. During this time, fMRI data are collected according to pulse sequences described in step 1.1, with concurrent EEG recording.\nCollection of resting state EEG/fMRI data following hypnotic induction proceeds according to steps 2.2-2.4.\nThe hypnotherapist then administers the 'cold glove' suggestion for the subsequent EEG/fMRI data collection, which again proceeds according to steps 2.2-2.5. During the suggestion, the hypnotherapist repeatedly asks the subject to visualize their hand is immersed in a cold water bath, and to imagine that their left hand was growing progressively colder from fingertips to wrist. Differential thermometry measurements are recorded throughout this block."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}