{
  "id": 19031,
  "origin_website": "Jove",
  "title": "Near Infrared Optical Projection Tomography for Assessments of β-cell Mass Distribution in Diabetes Research",
  "procedures": [
    "1. Sample Preparation and Scanning\n1.1 Sample preparation\nThe following procedure is performed essentially as described previously7.\nHarvest the pancreas. Use ice-cold PBS to avoid proteolytic degradation.\nFix the tissue in 4% PFA in PBS on ice for 2-3 hr. Make sure the lobes are \"spread out\" during fixation. This will facilitate identification of anatomical landmarks after reconstruction.\nWash in excess PBS for 30 min.\nDehydrate the pancreas stepwise in methanol (33, 66%, 100%), 15 min/step. This minimizes the formation of bubbles during bleaching (see step 5) and prevents cell destruction during freeze-thawing (see step 7).\nIncubate the tissue in freshly prepared MeOH:DMSO:H2O2 bleaching buffer in a 2:1:3 ratio at RT for 24 hr to quench endogenous tissue fluorescence. For larger samples, exchange to new bleaching buffer and incubate for another 24 hr.\nWash in excess MeOH, ON.\nFreeze-thaw for at least 5 cycles in -80 °C - RT to facilitate antibody penetration.\nRehydrate stepwise back to TBST (33, 66%, 100%), 15 min/step.\nBlock in TBST with 10% serum (preferably from the same species in which the secondary antibody was generated), 5% DMSO and 0.01% NaAz for 12-24 hr at RT\nIncubate with primary antibodies in blocking buffer for 48 hr, at RT, extend to 72 hr for larger samples (antibodies used here are listed in the table of reagents).\nWash in excess TBST, ON.\nIncubate with fluorescently conjugated secondary antibodies for 48 hr, at RT, extend to 72 hr for larger samples.\nWash in excess TBST, ON.\n1.2\nThe following procedure describes how to mount the sample in agarose and attach it to the custom made sample holder (see Figure 7) prior to OPT scanning.",
    "Separate the splenic, duodenal and gastric lobes according to Figure 3A in Hörnblad et al3. The relationship between the lobes is further clarified in Hörnblad et al11.\nPrepare 1.5% (w/v) low melting temperature agarose in dH2O, filter, allow to cool to 37 °C and rinse the tissue in dH2O to wash away the detergent and remove bubbles before agarose-embedding on ice.\nCut out an agarose block enclosing your sample and leave a ~1 cm spacer between the sample and the base of the agarose. Trim sharp edges (≤ 90 °) of the agarose block to reduce light scattering.\nDehydrate the sample stepwise in MeOH (33, 66%, 100%), allowing time to equilibrate between each step. When the specimen sinks it is considered to be equilibrated.\nClear the sample in a 1:2 solution of Benzyl Alcohol: Benzyl Benzoate (BABB) until it becomes transparent. Exchange BABB solution and incubate for an additional 12 hr.\nPosition the cleared sample in the sample holder and secure it by inserting 2 needles through the agarose spacer via the drilled holes in the flanges of the holder.\nPlace the sample in the scanner and submerge it into a cuvette filled with BABB clearing solution. When comparing a series of pancreata the same magnification should be used for all scans. The magnification should be optimized for the largest sample in the series.\n1.3 Positioning of specimen at the AR\nThe following protocol describes the procedure to precisely position a sample using the COM-AR algorithm. This procedure is only applicable when the ROI includes the entire specimen. For detailed descriptions of the algorithms, please see Cheddad et al2.",
    "Acquire images of the specimen in two positions for both the anatomy and signal channels. Position1 at 0 ° (associated with the X-axis), displaying the largest projection area, and position2 at 90 ° (associated with the Z-axis). We are using the GFP channel to visualize the anatomy.\nApply the expectation-maximization (EM) algorithm on the anatomy images to threshold the ROI.\nCalculate the COM points (x-coordinates) of the binary images obtained in step 2 for both the 0 ° and 90 ° projections.\nSuperimpose a vertical line passing through the identified COM point calculated in step 3 on the 0 ° and 90 ° images of the signal channel.\nUse the images acquired in step 4 as references to move the sample so that the centre line of the Field of View passes through the found COM points of the sample.\n1.4 Scanning\nAdjust exposure times to achieve the highest signal to noise ratio possible without saturating any areas of the projection images. Repeat for all channels to be scanned.\nSelect the filter set for the first fluorescence channel to be scanned. Emission from shorter λ fluorophores may excite fluorophores with longer λ and thereby cause photo bleaching. To minimize this possibility, scan the fluorophore with longest excitation λ first.\nOpen the shutter to illuminate the sample and collect the fluorescence signal over 360 °, rotating the sample along the vertical axis for each channel. The step angle used for the NIR-OPT setup is 0.9 ° and for the Bioptonics 3001 scanner 0.45 °.\nSelect the appropriate filter for the next channel and proceed as above.\n2. Computational Processing and Reconstruction\n2.1 Post-acquisition misalignment detection and correction (A-value tuning)",
    "In projection tomography, it is in general necessary to assign a post-alignment value to the projections to fine-tune the images position along the axis of rotation prior to reconstruction. However, a small aberration in the angle of the camera towards the optical axis can cause non-uniform A-values along the length of the sample and thus induce geometric distortions. To avoid such distortions, a computational method to find the accurate and unified post-alignment value (A-value) throughout the entire specimen may be applied2.\nUse a discrete Fourier transform to divide a projection of the specific signal at 0 ° and 180 ° into 8 pixels height blocks and calculate the shift along the x-axis (the A-value) between each block.\nApply a linear least squares regression to help calculate the angle θ', which describes the slope of the x-axis-shift along the length of the specimen, and to find a rotational centre point.\nCorrect for misalignments during scanning by rotating all projections θ'/2 around the rotational centre point.\n2.2 Contrast limited adaptive histogram equalization (CLAHE)\nTo facilitate detection and segmentation of objects (islets) exhibiting very weak signals, which are at risk to be \"thresholded out\" during reconstruction and/or segmentation for quantitative assessments, a CLAHE algorithm may be applied to the projection images. The CLAHE operation is performed with two major intensity transformations:\nThe local contrast is estimated and equalized within non-overlapping blocks in the projection image.\nThe intensities are then normalized at the border regions between blocks through bilinear interpolation.",
    "The name contrast-limited refers to the clip limit, which is set to avoid saturating pixels in the image. In this protocol, the MATLAB built-in function \"adapthisteq\" was used and applied with the default clip limit of 0.01 and a tile size of 256. Note, the optimal tile size needs to be tested empirically and can vary depending on the specimen analyzed. More details on the algorithm and examples can be found in Hörnblad et al3.\nNote! The above listed computational processing steps (including COM-AR, A-Value tuning and CLAHE, see 1.3-2.2) are built upon standard algorithms and are executed in MATLAB (Mathworks).\n2.3 Tomographic reconstruction and iso-surface rendering\nUsing a filtered back-projection algorithm, the corrected and normalized images may now be reconstructed with unified misalignment compensation and minimal requirement for optimization of dynamic range. In this protocol, all reconstructions are carried out using the filtered back projection method available in the NRecon software (Skyscan), version 1.6.8 (http://www.skyscan.be/products/downloads.htm[href=http://www.skyscan.be/products/downloads.htm]). Note, the magnification of an imaged object depends on its distance from the focal point of the lens unless parallel beam geometry is implemented in the imaging setup. Therefore, when importing a projection dataset to the NRecon software it is important to include the correct object to source distance (mm) and rotational direction of the scanner (for counter clockwise input \"cc\" and for clockwise input \"cw\") in the accompanying log file, to avoid cone beam induced artifacts during reconstruction.\nTo visualize and quantify the stack of virtual sections obtained, generate 3D iso-surfaces using suitable image processing software such as Imaris or Volocity.",
    "Murine islet isolation and transplantation procedures were performed at the Diabetes Research Institute's Preclinical Cell Processing and Translational Model Core under protocols reviewed and approved by the University of Miami Institutional Animal Care and Use Committee. The ethical committee for animal research, northern Sweden, approved all other experiments involving animals."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}