{
  "id": 10992,
  "origin_website": "Jove",
  "title": "Designing Silk-silk Protein Alloy Materials for Biomedical Applications",
  "procedures": [
    "1. Prediction of Protein Interactions\nBioinfomatics Analysis of Protein Molecules\n\t\nVisit the National Center for Biotechnology Information website (www.ncbi.nlm.nih.gov/protein/), and search the protein names that will be used for the alloy study. Note: For this example, two proteins were used: protein A, which is the wild tussah silk fibroin, and protein B, which is the domestic mulberry silk fibroin. For protein A, the amino acid sequences can be found in “fibroin [Antheraea pernyi] GenBank: AAC32606.1” (Antheraea pernyi is the Chinese (Oak) Tussah Moth). For protein B, the amino acid sequences can be found in “fibroin heavy chain precursor [Bombyx mori] NCBI Reference Sequence: NP_001106733.1” and “fibroin light chain precursor [Bombyx mori] NCBI Reference Sequence: NP_001037488.1” together (Bombyx mori is the domesticated silkworm of the mulberry tree).\nSelect and save the amino acid sequences of the protein A and protein B from the database.\nVisit the ExPASy website (the SIB Bioinformatics Resource Portal) (www.expasy.org) or use other commercial software to calculate the basic bioinfomatics data of proteins based on their sequences including, but not limited to, total charge per molecule, hydrophobicity index of the molecule, titration curve of the molecules at different pH values, etc. This information will be used as basic elements for the computational simulation of protein interactions, and will help to understand whether these two proteins have strong interactions. [Note: This step is not for precisely predicting every detail of the protein interaction like those used in small peptides or functional proteins science. The purpose of this section is only to avoid producing a protein mixture with obvious macrophase separations which cannot be called an “alloy” material. Therefore, the estimate could be approximate but the protein alloy system can be verified by an experimental method described in step 3.1 using precise thermal analysis].",
    "Computational Simulation of Protein Alloy system\n\tBelow is described a procedure to simulate the protein alloy system. A simulation program is written in C programming language that can be used on a single or multiprocessor computer system. A lattice-spring-mass (LSM) model was used to simulate the alloy-proteins36-39. The LSM model gives a simple description of the net force on a mass when attached to a spring and one can solve the force equation to understand the motion for each mass. A simple program algorithm to model this protein alloy system using the LSM model is given as follows:\n\t\nRepresent a single protein as a coarse-grained particle that has a mass of m.\nUse a Hookean or a neo-Hookean spring to represent a bond38,39. By interlinking a finite number of particles with springs, one can make a sub-alloy domain that represents a stable building block of the alloy-proteins. To represent different types of bonds in the intra-linkage, use different spring constants/stiffness.\nModel the protein alloy system as a material composed of dully-crosslinked sub-alloys. Again here different stiffnesses were used to represent different bonds between inter-linkages of the sub-alloys.\nModel the bond breaking and reformation process by a Bell Model40,41, through which weak bonds are allowed to be reformed but strong bonds cannot reform once they are broken. When the system is sufficiently stressed (both on the intra-suballoy and inter-suballoy bonds), bonds can be broken and reformed.\nIn order to study deformation effects on the alloy-proteins when they are stressed, apply external forces to the system. Distribute these forces equally to each particle when solving the force equation (The Newton’s Laws).\nTo model interactions between the solution (such as water molecules) and the proteins, apply an additional drag force or frictional force to each particle.",
    "Solve the force equation for each particle with the actions of each force (the spring force from the bond, the external force, and the frictional force).\nCalculate and extract the positions of the protein particles as a function of time.\nCalculate the physical quantities that characterize the alloy-proteins from the positions of the particles.\nChange the bond stiffness in the program to understand interactions between different proteins. (The average bond stiffness is calculated from the Young’s modulus of the protein materials. The Young’s modulus of different fibrous protein materials can be obtained either by Universal Tensile Test18, or directly from previous literatures2-4,18).\n2. Production of Protein Alloy Solutions\nWild tussah silk (protein A) and domestic mulberry silk (protein B) are selected here as an example of protein alloy system. This protocol first presents how to obtain the wild tussah silk (protein A) solution.\nCut raw wild tussah silk cocoons or fibers at a weight of 3 g.\nMeasure 3 g of sodium dicarbonate or sodium carbonate (Note: If using sodium carbonate, the molecular weight of protein chains will reduce during the boiling process42).\nFill a 2 L glass beaker with distilled water (H2O). Then, place the glass beaker on a hot stage, cover it with aluminum foil, and heat to boiling.\nRemove the aluminum foil cover and add the measured sodium dicarbonate slowly into the boiling water, allowing it to completely dissolve. (Note: The role of sodium dicarbonate is the “soap” to clean off soluble sericin proteins and other impurities attached on the surface of wild silk fibers. If using other nature protein fibers, please select corresponding chemical agents according to the literature).",
    "Add the raw protein fibers (wild silk fibers) into the boiling water and allow to boil for 2-3 hr (Note: The boiling time has critical impact to the molecular weight of protein chains26,43. One should select an appropriate time according to the literature or by performing control experiments26,43. The boiling temperature could also be adjusted to impact the molecular weight of the protein chains26,43,44).\nAfter boiling, carefully remove the protein fibers with a spatula from the solution and squeeze them to remove the excess water. (CAUTION: The fibers are very hot!)\nNext, immerse the fibers in a 2 L beaker with cold distilled water, and wash the fibers twice for 30 min each to completely remove the impure residues from the fiber surface. Dry the fibers in a fume hood for at least 12 hr.\nMelt 45.784 g of calcium nitrate (Ca(NO3)2) in a glass beaker to form a liquid at 65 °C for dissolving the wild silk protein fibers. (Note: If using other natural protein fibers, select a corresponding solvent to dissolve the proteins. Here you can also use 9.3 M LiSCN or LiBr solution, or an 85% phosphate solution for dissolving different silk fibers.)\nCombine the fibers and the solvent at a ratio of 1 g fiber into 10 ml solvent. Allow the fibers to dissolve at 95 °C for 5 to 12 hr. (Note: The dissolving time depends on the molecular weight of proteins26,43-45)",
    "Using syringes, inject the wild silk solution into 12 ml dialysis cassettes (maximum 1,000 MW as the cutoff size) or sealed dialysis tubings (maximum 1,000 MW as the cutoff size) and dialyze against 2 L of distilled water. (Note: The injection is more efficient if maintaining the solution at 35 °C, otherwise the viscosity of protein solution will dramatically increase at room temperature). Change the distilled water frequently to remove Ca(NO3)2 solvents in the solution (after 30 min, 2 hr, 6 hr, and then every 12 hr for 3 days. In total, there will be approximately 8 water changes).\nAfter 3 days, collect the protein solutions from the dialysis cassettes or tubing and place into 13,000 rpm rated tubes.\nCentrifuge the solutions for 1 hr at 3,500 rpm at 4 °C 3x to remove deposits. After each centrifuge run, quickly pull the supernatant into new tubes. Store the final solutions in a 4 °C refrigerator.\nPour 5 ml of protein solution onto a polydimethylsiloxane (PDMS) substrate or other flat hydrophobic substrate and allow it to dry completely (this usually takes more than 12 hr). Weigh the remaining solid protein film and calculate the final solution concentration by weight percentage (w/v%) = Measured Weight (in mg) ÷ 5 (in ml) ÷ 10.",
    "Collect another selected natural protein fiber (in this case, domesticated mulberry silk was used as the protein B), and repeat above process with an appropriate “soap” and dissolving solvent, until the final protein water solution with measured concentration is obtained. [Note: If the protein materials are in the powder form, use appropriate porous tubes or membranes to hold the samples during the “soaping” process. If the protein has already been purified, directly go to step 2.8 to dissolve the powder. If the protein has already been purified and is water soluble, make its aqueous solution with a desired concentration first and then go to step 2.15 below to make blend protein solutions.]\nSlowly dilute the Protein A solution (here wild silk solution) in distilled water at 4 °C to form a 1.0 wt% Protein A aqueous solution. Do the same process for Protein B (here domesticated silk).\nSlowly mix the 1 wt% protein A solution with Protein B solution at 4 °C using a pipette to avoid protein aggregation during mixing. (Note 1: Do not use a vortex instrument to mix the proteins since some proteins (e.g., silks) will form hydrogels during the vibration46,47. Note 2: If possible, use additional devices to control the mixing rate and mixing size making sure to mix them as slow as possible to avoid aggregation. Do not quickly pipette the solution during mixing).",
    "The final blending solutions should have a specified mass ratio or a molar ratio of Protein A:Protein B. Typically, mix them with mass ratio of 90:10, 75:25, 50:50, 25:75, 10:90 to obtain a broad spectrum of alloy solutions. Use pure protein A and protein B solutions as controls. For a blending solution with a molar ratio of Protein A:Protein B = R: (100-R). Calculate the mixing volume ratio (based on a same 1 wt% solution) by: Volume A:Volume B = R·(MW of A): (100-R)·(MW of B).\nImmediately cast the final solutions on to PDMS substrates to form films or other designed materials. (Note: Do not store high concentration protein alloy solutions for a long time. More aggregates may form later due to the protein-protein interactions in water). If needed, dilute the blend solutions with ion-free distilled water and keep them in a 4 °C refrigerator to avoid additional protein aggregation in solutions.\n3. Fabrication of Variable Protein Alloy Materials\nConfirm Alloy Prediction by Thermal Analysis3,9,31-35\nPrepare PDMS substrates and clean them by soaking in distilled water.\nCast the protein blend solutions with different mixing ratios onto the PDMS substrates.\nDry the solutions for at least 12 hr in a chemical hood with air flow until films are formed (Note: Use the same volume for different solutions so that the thickness of films can be fixed).\nRemove the protein alloy films from the PDMS substrates and place them onto clean dishes.",
    "Weigh many Differential Scanning Calorimetry (DSC) aluminum pans and lids for DSC study. Match the pan and lid pairs to have an equal total weight (weight of pan plus weight of lid equals a constant weight). For example, here a total weight of lid and pan 22.50 mg was used, and eight sets of lid and pan combinations with this total weight were prepared.\nEncapsulate 6 mg each type of dried protein blends into aluminum DSC pans and seal them with their matched lids in process 3.1.5. Seal an empty pan and lid pair to be used with the sample as the reference so that only the heat capacity of samples themselves will be recorded during the thermal analysis (Note: The DSC will compare the heat capacity of reference pan+lid vs. that of sample+pan+lid. Due to the equal weights, the background heat capacity from the pans and lids will be accounted for leaving only the heat capacity of sample in the pan).\nPut sealed references and sample pans into a DSC instrument, with purged dry nitrogen gas flow of 50 ml/min, and equipped with a refrigerated cooling system. Before the sample measurements, the DSC instrument should first be calibrated with sapphire and indium for heat flow and temperature, respectively.\nPre-run the DSC at a heating rate of 2 K/min to 150 °C and then hold at this temperature for 15 min to remove any remaining water molecules in the samples (typically around 3-10% of total weight). Quickly cool down (10 K/min) to 25 °C.",
    "Run the DSC again at a heating rate of 2 K/min to 300 °C, or until the degradation peak of protein blends appear34. Record the heat capacities of the protein sample at different temperature during this process. Cool down the DSC and change the old sample to a new sample with a different mixing ratio.\nCalculate and plot the Heat Capacity vs. Temperature curves for each protein blend sample using the DSC software31-35.\nJudge the miscibility of protein blends by the following method (See Figure 4 Thermal and Figure 5) and if the two proteins are fully miscible, they may be called “protein alloys”. Otherwise the term “protein composite” would be a suitable name according to polymer descriptive theories48,49):\n\t\t\nThe individual proteins A and B should have individual single glass transitions temperature, Tg(A) and Tg(B) (See the green and blue curves in Figure 5)3,48;\nThis single glass transition temperature is normally intermediate between those of the two individual protein components, Tg (A) and Tg (B) (See Figure 5)3,48;\nImmiscible phase separation blends is obtained if both Tg(A) and Tg(B) appeared at their original positions (Figure 5), and with each Tg step height in proportion to the composition, the two proteins are fully immiscible3,48.\nSemi-miscible composite blend type of will have one very broad glass transition, or may still have two glass transitions, but each has migrated closer to each other relative to the pure protein components, Tg(A) and Tg(B) (see Figure 5). In this case, there might be micro-heterogeneous phase structures formed between the two protein components, and the composition may vary from location to location.\nIf (3.1.11.1) is the case shown in DSC, and it can be confirmed that the protein A-B is an alloy system, then move on to fabricate protein alloy materials.",
    "Fabrication of Optical Materials by Protein Alloys\n\t\nProduce (in the fabrication lab) or purchase a designed topographic surface for casting. In this specific example, a glass with four diffraction patterns was used (Figure 4 Optical).\nPlace the glass with diffraction patterns into a dish, and make sure the patterned surface is faced upward.\nSpread PDMS solution evenly on the glass surface, and fully cover the surface patterns (The PDMS solution is made by potting and catalyst solution in a 9:1 mixing ratio according to the user instruction23,44).\nPlace the casting dish into a 65 °C oven for at least 2 hr while on a flat surface. The PDMS solution should dry into a solid substrate during this process.\nRemove PDMS substrate from the glass. The diffraction patterns should now be transferred to the PDMS surface.\nPunch out the PDMS molds with diffraction patterns using a suitable hole punch.\nDrop protein alloy solutions on the PDMS surfaces with diffraction patterns, and dry them for at least 12 hr to obtain films with diffraction patterns.\nTo obtain insoluble protein alloy materials, place the entire set of dry films, including the PDMS molds into a 60 °C vacuum oven (25 kPa) with a water dish on the bottom of the chamber. Pump out air in the oven, and let the water vapors anneal samples for at least 2 hr. (This process is called temperature-controlled water vapor annealing45. Comparing with the widely used methanol method, it can generate similar beta-sheet content in the silk materials45). Release the vacuum and peel off the water insoluble film from the PDMS substrate using forceps. For this example, wild silk-domesticated silk alloys are used.",
    "Test the quality of diffraction patterns on films by comparing them with the original patterns on the glass (e.g., collect SEM images for the micro-scale details; collect laser diffraction patterns for the general pattern quality).\nFabrication of Electrical Circuits on Protein Alloys Materials\n\t\nTo fabricate an electrical circuit pattern on glass substrate, first clean a glass slide using some degreasing solvent such as Alconox in an ultrasonic cleaner for 5 min, followed by 5 min in acetone, followed by 5 min in methanol. The methanol is used last since it evaporates more slowly than acetone so can be blown off the substrate rather than drying and leaving residues.\nBlow the glass slide dry using dry nitrogen gas which is generated by the boil-off from a 180 L liquid nitrogen dewar.\nIntroduce the substrate materials into the deposition chamber. (These guidelines are for a sputtering system but other deposition techniques could be used.) If the chamber is designed with a loadlock, the vacuum in the deposition chamber is not significantly impacted. Evacuate the loadlock to a pressure of 30 mTorr.\nOpen the gate valve between the loadlock and the main deposition chamber and introduce the substrate into the chamber.\nTurn on the Ar gas and the pressure regulator and control the pressure to the desired deposition pressure. Higher pressures give lower energy sputtered metal atoms and more uniform films while lower pressures yield better adhering faster deposited films. The range of pressures is generally between 3 mTorr and 60 mTorr, with 20 mTorr working well.",
    "Metals are then projected onto a shutter that protects the substrate from coating using an RF power of 100 W. A tuning circuit is required to direct the RF power to the metal target. DC power could be used instead of RF for metallic targets. In order to remove oxide layers and contaminants from the target, pre-sputter for several minutes.\nOpen the shutter and sputter the metal onto the substrate. The deposition rate for the configuration described is about 10 nm per min. This rate will depend on working distance, pressure, magnet strength in the magnetron cathode, target thickness and the metal sputtered. Adjust the deposition time to achieve the desired thickness.\nRemove the coated glass slide from the chamber.\nUsing a spinner, spin a photoresist coating onto the surface of the film. Many resists can be used. For this case, positive photoresist was used.\nAfter the resist is spun onto the film, soft bake at 90 °C for 5 min to dry the resist.\nPlace a contact mask with an image of the device firmly against the resist. A UV light source is used to expose the photoresist. The exposure is 10 sec but varies depending on the strength of the light source and the resist used.\nPlace the film in the photoresist developer until the projected image appears. The developer washes away the resist that was exposed to the UV light which cause the breaking of the polymer bonds. Immediately after the image appears, dip the film in DI water to stop the developer from working on the unexposed photoresist.\nBlow the films dry with dry nitrogen gas.\nPlace the films into an oven at 120 °C for 15 min to “hard bake” the photoresist.",
    "After the films cool, place them in an etching solution until the metal not protected by the photoresist lifts off. Dip in water to stop the etching.\nRinse with acetone to remove the hardened photoresist.\nRinse with methanol and blow dry with dry nitrogen.\nOnce the coated glasses are ready, drop different protein alloy solutions onto the glass surfaces, and dry them for at least 12 hr to obtain protein alloy films on the glasses. (It is suggested to first concentrate the alloy solutions to 5 wt% to obtain thick protein alloy films.)\nDue to the hydrophobic-hydrophilic interactions, the thin metal films will be transferred from the glass surfaces to the attached protein alloy film surfaces51. Peel off the protein alloy films with the thin metal patterns from the glass substrates using forceps.\nTo obtain insoluble protein alloy materials, place the dry films into a 60 °C vacuum oven (25 kPa) with a water dish on the bottom of the chamber. Pump out air in the oven, and let the water vapors anneal samples for at least 2 hr. Release the vacuum and peel off the water insoluble film from the substrate using forceps.\nTest the electrical qualities of metal patterns on protein alloy films such as electrical resistance and compare them to the original patterns on the glass.\nFabrication of Pharmaceutical Materials by Protein Alloys\n\t\nTo fabricate a protein alloy films with pharmaceutical compounds, first prepare a PDMS substrate as described in step 3.2. Clean the formed PDMS substrate by distilled water.\nDissolve or disperse the pharmaceutical compounds into an aqueous solution. Use ultrasound or vortex to homogeneously mix the pharmaceutical compounds with the water. If the compounds are not water soluble, disperse the powders with a homogeneous distribution in the ion-free distilled water.",
    "Calculate the desired mass ratio of compounds to the protein alloys by: volume of compound solution x weight percentage of compound solution : volume of protein alloy solution x weight percentage of compound solution (here 1 wt% alloy solution was used). Select a ratio to obtain a film with desired compound density in the protein alloy film.\nSlowly mix the compound solution with the protein alloy solution following the same instructions in section 2 process 2.16. (Note: To avoid gelation, do not ultrasonicate or vortex the solution during the mixing).\nPour a calculated volume of mixture onto the PDMS substrate and dry it at least 12 hr in a chemical hood to a obtain protein alloy film containing a designed ratio of pharmaceutical compounds.\nPhysically crosslinked the film following the same instruction in Section 3.2 process 3.2.8. An example of alloy films with insoluble model drugs of a low density (LD) or a high (HD) density could be seen in Figure 4 Chemical.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}