{
  "id": 13252,
  "origin_website": "Jove",
  "title": "In Vitro Reconstitution of Spatial Cell Contact Patterns with Isolated Caenorhabditis elegans Embryo Blastomeres and Adhesive Polystyrene Beads",
  "procedures": [
    "1. Preparation of adhesive polystyrene bead\nNOTE: This protocol does not require aseptic technique.\nWeigh 10 mg of carboxylate modified polystyrene beads in a 1.5 mL microcentrifuge tube.\nTo wash the beads, add 1 mL of 2-(N-morpholino)ethanesulfonic acid (MES) buffer into the tube. Since MES buffer does not contain phosphate and acetate, which can reduce the reactivity of carbodiimide, it is suitable to use in protein coupling reaction. Vortex the tube to mix the beads.\nSpin the tube for 60 s at 2,000 x g via a benchtop centrifuge.\nDiscard the supernatant by carefully pipetting out the buffer.\nWash the beads again with 1 mL of MES buffer by following steps 1.2-1.4.\nAdd 1 mL of MES buffer containing 10 mg of EDAC into the tube to activate the surface carboxyl groups. Vortex the tube to mix the beads.\nRotate and incubate the tube for 15 min at room temperature.\nSpin down the beads for 60 s at 2,000 x g.\nDiscard the supernatant by carefully pipetting out the buffer.\nTo wash the beads, add 1 mL of phosphate buffered saline (PBS) into the tube. Vortex the tube to mix the beads.\nSpin down the tube for 60 s at 2,000 x g.\nDiscard the supernatant by carefully pipetting out the buffer.\nWash the beads again with 1 mL of PBS by following steps 1.10-1.12.\nThe final concentration of Rhodamine used will depend on the strain being imaged. Prepare 1 mL of 1-, 10-, 100-, and 1000-fold dilution series of Rhodamine Red-X from the 0.65 mM Rhodamine Red-X stock solution.\nPipette 20 µL of beads into each serial dilution tube.\nRotate and incubate the tube for 5 min at room temperature.\nWash the beads twice with 1 mL of PBS by repeating steps 1.10-1.12.",
    "Add 1 mL of PBS into the tube and store it at 4 °C for up to 6 weeks. Check the fluorescence intensity of the beads under a microscope used for live-imaging. The appropriate concentration of the Rhodamine Red-X succinimidyl ester is dependent on the imaging conditions (Figure 1).\n\tNOTE: Beads without Rhodamine Red-X treatment do not adhere to cell. Rhodamine Red-X serves as fluorescence marker as well as adhesive molecule. The electro static interaction between positively charged Rhodamine Red-X and negatively charged plasma membrane is a putative cause of adhesion.\n2. Assembly of mouth pipette\nCut wide (6.35 mm inner diameter) and narrow (3.175 mm inner diameter) Tygon tubes to about 25 cm and 40 cm in length, respectively (Figure 2).\nConnect the Tygon tubes with a polytetrafluoroethylene (PTFE) filter (0.2 µm pore size) (Figure 2).\nDisassemble a commercially available aspirator tube and attach its capillary holder and mouthpiece to the end of the narrow and wide Tygon tubes, respectively (Figure 2).\n\tNOTE: PTFE filter was used to prevent the inhalation of fumes of hypochlorite solution via mouth pipette.\n3. Isolation of embryo blastomere\nNOTE: Wear gloves and lab coat to avoid cut and contact with the bleaching solution.\nHold each end of a microcapillary (capacity; 10 µL) with right and left hand.\nPull the microcapillary towards both ends to apply tension and bring the center of the capillary over a burner to make two hand-pulled capillaries (Figure 3A).",
    "Trim the tips of the hand-pulled capillaries with forceps under the dissecting microscope and attach the pulled capillary into a mouth pipetting apparatus (Figure 2). Prepare two types of pipettes. The tip opening sizes for the pipettes should be approximately 2x and 1x the short axis length of C. elegans embryos (30 µm) for the embryo transfer and eggshell removal, respectively Figure 3B-D).\nPipette 45 μL of egg salt solution onto a well of a multiwell slide (Figure 4A; bottom).\nPlace 5-10 adult C. elegans onto a well containing egg salt solution.\nTo obtain early C. elegans embryos, cut adults into pieces by positioning two needles to the right and left of C. elegans body and sliding the needles past each other (Figure 4A; upper schematics).\nPipette 45 μL of hypochlorite solution onto a well next to the well containing egg salt solution (Figure 4B).\nPipette 45 μL of Shelton's growth medium onto the subsequent three wells next to the well containing hypochlorite solution (Figure 4B).\nTransfer 1-cell stage and early 2-cell stage embryos into the hypochlorite solution by mouth pipetting with the hand-drawn capillary for embryo transfer (Figure 4B).\nWait for 40–55 s.\nWash the embryos by transferring the embryos from hypochlorite solution into Shelton's growth medium by mouth pipetting with the hand-drawn capillary for embryo transfer (Figure 4B).\nWash the embryos again by transferring the embryos into a new well of Shelton's growth medium by mouth pipetting with the hand-drawn capillary for embryo transfer (Figure 4B).",
    "Transfer the washed embryos into a new well of Shelton's growth medium by mouth pipetting with the hand-drawn capillary for embryo transfer. Using the hand-drawn capillary for eggshell removal, carefully repeat the pipetting (Figure 4C; middle schematics). If the eggshell is successfully removed, the embryonic cells will become more spherical (Figure 4C; right).\nSeparate the 2-cell stage embryonic blastomeres by gently and continuously pipetting with the hand-drawn capillary for eggshell removal (Figure 4D).\n4. Reconstitution of contact patterns with blastomere and bead\nNOTE: Work under the imaging microscope to avoid dissociation of a cell from a bead and to facilitate the timely image acquisition.\nTo observe using an inverted microscope, prepare an imaging chamber as in Figure 5.\n\t\nPlace a coverslip onto a coverslip holder (Figure 5A).\nTape the edges of the coverslip to stabilize it. The side with tape is the 'back' side (Figure 5A,B).\nFlip the coverslip holder over to the 'front' side and draw a circle on the coverslip with a hydrophobic pen (Figure 5C).\n\t\tNOTE: Any glass-bottom dish also works, provided the embryos are manipulatable by the mouth pipette.\nAdd Shelton's growth medium within the circle drawn by the hydrophobic marker (Figure 5D).\nTransfer the isolated blastomere to the imaging chamber.\nDispense a small volume of the chemically functionalized beads using the hand-drawn capillary for embryo transfer.\nControl the position of the polystyrene beads by blowing into the hand-drawn capillary until the bead attaches to the isolated blastomere.\nMount a coverslip to avoid evaporation of medium (Figure 5E). Perform live imaging.\n5. Preparation of important reagents\nEgg Salt Solution (10 mL): Combine 235 µL of 5 M NaCl and 240 µL of 2 M KCl with 9525 µL of dH2O.",
    "Hypochlorite Solution (10 mL): Combine 7.5 mL of Clorox (containing approximately 7.5% sodium hypochlorite) with 2.5 mL of 10 N NaOH (final concentration of sodium hypochlorite is approximately 5.625%).\n\tNOTE: Although many published methods have used chitinase to digest chitinous eggshells, we have adopted a method using hypochlorite solution11. By avoiding the batch-to-batch variations of chitinase activities, we believe this method is more reproducible and cost-effective approach.\n0.81 mM Inulin Solution (40 mL)\n\t\nAdd 0.2 g of Inulin to 40 mL of dH2O.\nAutoclave to dissolve.\n\t\tNOTE: Keeps for 1 month at 4 °C.\n0.5 M MES Buffer (500 mL)\n\t\nDissolve 48.81 g of MES in 400 mL of distilled water (dH2O).\nAdjust pH to 6.0.\nBring the total volume to 500 mL with dH2O.\nPBS Solution (1 L)\n\t\nTo make 10-fold PBS solution, dissolve 1 package of PBS premix powder in 1 L of dH2O.\nCombine 100 mL of 10-fold PBS solution with 900 mL of dH2O.\n5% Polyvinylpyrrolidone (PVP) Solution (4 mL)\n\t\nUnder sterile conditions, dissolve 0.2 g of PVP in 4 mL of Drosophila Schneider's Medium.\n\t\tNOTE: Always open Schneider's Medium stock in tissue culture (TC) hood. Keep for 1 month at 4 °C.\n0.65 mM Rhodamine Red-X stock solution (2 mL)\n\t\nWeigh 1 mg of Rhodamine Red-X.\nAdd 2 mL of dimethyl sulfoxide (DMSO) to dissolve.\nAliquot and store at -20 °C.\nShelton's Growth Medium (SGM) (10.25 mL)\n\t\nUnder sterile conditions, combine 8 mL of Drosophila Schneider's Medium, 1 mL of PVP solution, 1 mL of Inulin solution, 1 mL of Basal Medium Eagle (BME) Vitamins, 50 µL of Penicillin-Streptomycin, and 100 µL of Lipid concentrate together.\nAliquot 325 µL of SGM into 1.5 mL microtubes.\n\t\tNOTE: Keep for about 1 month at 4 °C.",
    "On the day of blastomere isolation, add 175 µL of Fetal Bovine Serum (FBS) to the SGM (for total volume of 500 µL).\n\t\tNOTE: Store FBS at -20 °C and thaw it before usage. FBS does not need to be heat killed.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}