{
  "id": 17415,
  "origin_website": "Jove",
  "title": "Swine Models of Aneurysmal Diseases for Training and Research",
  "procedures": [
    "The experiment was approved by the ethical committee of the Jesús Usón Minimally Invasive Surgery Centre, and all procedures were performed according to Spanish Royal Decree 53/2013 and the European regulation (2010/63/EC).\n1. Presurgical preparation and anesthesia\nHouse large white swine weighing 35-40 kg individually, with free access to water and feed once a day. Acclimate for 2 weeks before the date of the intervention, to perform clinical examination and allow time for detecting silent diseases.\nAdminister the following oral drugs to prevent thrombotic events during the study: Acetylsalicylic acid (1 g/animal/24 h) and Clopidogrel (75 mg/animal/24 h) from 7 days before model induction until IA therapy.\nInject ketamine (10 mg/kg) intramuscularly after a 24 h fasting period. Ten min later, induce anesthesia by 1% propofol intravenously (3 mg/kg).\nAfter endotracheal intubation, use inhaled sevoflurane to maintain anesthesia (3%-4.5% inspiratory fraction). Connect endotracheal tubes to a semiclosed, circular anesthetic circuit attached to a ventilator with a fresh gas flow rate of 0.5-1 L/min.\nTo obtain normocapnia (35-45 mmHg CO2), control ventilation by a tidal volume of 8-10 mL/kg. Ensure an adequate intraoperative analgesia by an initial intravenous dose of ketorolac (1 mg/kg) and tramadol (1 mg/kg) combination and a continuous remifentanil infusion (15-18 µg/kg/h).\nConfirm proper animal plane of anesthesia considering unconsciousness (hypnosis), insensitivity to pain, muscle relaxation, and the absence of reflex responses14.\nTo prevent dryness while under anesthesia, use a vet ointment on eyes during the surgery procedure.\nFix the anesthetized animals at the operating table in supine position. Shave the animals´ necks, scrub with povidone-iodine, and drape under sterile conditions.\nPerform all procedures under sterile conditions, using sterile gloves and material.\n2. Surgery\nSurgical approach\n\t\nPerform a 10 cm long longitudinal skin incision 2-3 cm to the right of the neck´s midline.\nPouch tailoring\n\t\nAutologous pouch",
    "To expose the EJV, dissect the subcutaneous and fat tissue and perform hemostasis.\nSeparate the right sternocephalicus muscle from the connective tissue and retract it with a Weitlaner retractor to facilitate EJV exposure.\nExpose and identify the EJV, which is lateral and deeper than the CCA (Figure 1A).\nUse two bulldog vascular clamps to stop blood flow inside the vessel during the venous segment extraction.\nIsolate a 15-20 mm segment of the EJV to obtain the autologous pouch.\nLigate the proximal and distal ends of the EJV.\nFlush the extracted vein segment with heparinized saline (5,000 IU/L).\nCheck the inside of the excised EJV and select a 7-8 mm long segment where no venous valves are present.\nFashion this segment into a pouch by closing one end with a 7/0 polypropylene running suture (Figure 1B).\nKeep the pouch immersed in heparinized saline until use.\nConfirm no bleeding from the ligated EJV.\nSynthetic pouch\n\t\t\nCut a 1 cm long segment from a PTFE prosthesis (6-8 mm in diameter, depending on the aneurysmal size that is going to be created).\nSuture one end close using a 6/0 polypropylene vascular suture. Seal this closed part of the prosthesis with vascular glue to avoid bleeding from the suture line.\nSterilize this synthetic graft prior to surgical aneurysm creation.\nAneurysm creation surgery\n\t\nTo expose the CCA, dissect the subcutaneous and fat tissue and perform hemostasis.\nSeparate the right sternocephalicus muscle from the surrounding connective tissue and retract it with a Weitlaner retractor to facilitate CCA exposure.",
    "Identify the CCA. Place 2 silicon vessel loops at the cranial and distal end of the exposed CCA (Figure 2A). Dissect 5 cm of this vessel, removing its adventitia with a dissector (Figure 2B). During this surgical access, take care to avoid injuring the vagus nerve that can lead to Horner´s syndrome.\nAdminister vasodilators locally (such as 1-2 mL of nimodipine 10 mg/50 mL) to prevent vasospasms.\nAdminister heparin intravenously (150 IU/kg) 5 min before CCA crossclamping.\nPlace one bulldog vascular clamp at the caudal dissected part of the CCA and another bulldog vascular clamp 4-5 cm apart at the cranial part of the vessel (Figure 2C).\nUse microscissors to perform an 8 mm elliptical arteriotomy in the CCA between the two bulldog vascular clamps (Figure 2D).\nUse heparinized saline solution (5,000 IU/L) to flush the segment of the CCA intraluminally.\nSuture the autologous or synthetic pouch to the elliptical arteriotomy using a 6/0 polypropylene running suture (Figure 3A,B). Flush the distal and proximal clamps before finishing the pouch suture.\nProtect the vessel and nearby structures with warm, heparinized saline solution during the microsurgical procedure.\nOnce the prosthesis or autologous pouch is sutured to the CCA, check there is no bleeding (Figure 3C,D). First, remove the cranial bulldog vascular clamp, and then the caudal one.\nPerform hemostasis by applying pressure with wet swabs if there is some bleeding from the suture line. If required, apply traction to the vessel loops, or replace the bulldog vascular clamps and perform hemostatic stitches at the bleeding site. If necessary, place a piece of hemostatic gelatin sponge around the prosthesis.\nInspect the CCA pulse cranial to the aneurysmal sac to ensure that correct carotid patency has been recovered.",
    "Close the surgical incision by layers using 2/0 absorbable sutures and the skin with single stitches with 0 nonabsorbable sutures.\nAdminister buprenorphine (10 µg/kg/12 h) intramuscularly during the first 24 h and place a fentanyl transdermic release patch (25 µg/h) after the surgical procedures to achieve postoperative analgesia.\nDecrease the inhaled sevoflurane and increase fresh gas flow rate (20 L/min) to obtain recovery conditions. Remove the endotracheal tube when the animals breathe spontaneously and physiological parameters have been recovered, such as oxygen saturation and heart rate.\n\t\tNOTE: The fresh gas is a mixture of pure O2 (100%) and medical air (21% O2). Finally, the fraction of inspired oxygen is 50% to 45% (FiO2 = 0.5-0.45).\nDo not leave the animals unattended until they have regained sufficient consciousness to maintain sternal recumbence.\nKeep the animals that have undergone surgery isolated from other animals until fully recovered.\n3. Angiography test and postoperative phase\nWait for 24-48 h to avoid damaging the suture line.\nAnesthetize the animal again as described above and shave the groin area. Prepare the zone with povidone-iodine and apply sterile draping.\nAccess a femoral artery using the modified Seldinger technique with a 6Fr introducer sheath.\nInsert a 5Fr headhunter catheter through the femoral sheath over a 0.035 in hydrophilic guidewire. Under fluoroscopic guidance, advance this catheter to the origin of the CCA and remove the guidewire.\nInject contrast medium (amidotrizoic acid diluted to 50% with a saline solution) through the headhunter catheter to image the CCA with aneurysm model.\nOnce the angiography confirms correct aneurysm model creation, use animal models for research or for training endovascular treatment procedures.\nEuthanize the animals when the studies or training courses finish with a lethal intravenous administration of potassium chloride (2 mmol/kg) while under deep anesthesia.",
    "Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}