{
  "id": 2550,
  "origin_website": "Cell",
  "title": "A robust approach to differentiate human monocyte-derived microglia from peripheral blood mononuclear cells",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nThis protocol allows for the successful differentiation of MDMi for in vitro characterization. We will cover all steps that might affect MDMi differentiation ranging from the type of method (Protocol I vs Protocol II) for PBMC isolation, thawing of PBMCs, coating of culture plates and medium change for MDMi differentiation.\nPBMC isolation from whole blood\nProtocol I: PBMC isolation using Sepmate-50TM tubes\nTiming: 1 h\nThis protocol enables the successful isolation of PBMCs for MDMi differentiation via the use of SepMate-50 tubes. This method reduces time and sample variability and improves yield and purity (https://www.stemcell.com/products/sepmate-50-ivd.html[href=https://www.stemcell.com/products/sepmate-50-ivd.html]).\nCollect 8–9 mL of human venous blood.\nA certified phlebotomist must perform blood collection.\nAny vacutainer blood tubes containing anti-coagulant can be used. For example: 9 mL Vacuette K3 EDTA tubes.\nPerform all future protocol steps within a tissue culture biohazard hood.\nNote: Blood should be stored at RT (not in fridge or 37°C/5% CO2 incubator) prior to processing. Process blood within 2 h from collection time. Decreased PBMCs recovery is expected for a longer blood processing time.\nUse Sepmate-50TM tube for PBMC isolation.\nAdd 15 mL of Lymphoprep into the center hole of the Sepmate-50TM tube as per the manufacturer’s instructions[href=https://www.stemcell.com/products/sepmate-50-ivd.html].\nNote: If bubbles are introduced, proceed to remove them by pipetting the bubble out.\nGently mix the blood to ensure a homogeneous suspension.\nDiluted blood at 1:1 with room temperature (23°C) sterile PBS in a 50 mL Falcon tube.\nNote: Use PBS without Ca2+ and Mg2+.\nGently pipette the diluted blood sample at the side of the Sepmate-50TM tube.\nThe blood sample should sit above the Lymphoprep (Figure 1[href=https://www.wicell.org#fig1]A).\nNote: Use the lowest speed setting on the pipette gun, or use a pasture pipette.\nCritical: Centrifuge the layered blood immediately.",
    "Centrifuge at 1,200 × g for 10 min at room temperature with the brake on at maximum.\nAfter centrifugation, different layers will be observed (from top to bottom: diluted plasma, buffy coat, Lymphoprep, red blood cell layer) (Figure 1[href=https://www.wicell.org#fig1]B).\nIf PBMCs appear to have adhered on the side of the Sepmate-50TM tube, use a pasture pipette to dislodge the PBMCs carefully, without disrupting the layers. This will enhance PBMC cell recovery (Figure 1[href=https://www.wicell.org#fig1]C).\nTransfer the top layer (buffy coat) containing PBMCs into a new 50 mL tube.\nNote: The buffy coat will look whitish.\nTop up the 50 mL tube with room temperature (23°C) sterile PBS containing 1 mM EDTA to prevent cell clumps and resuspend the cell pellet.\nCentrifuge at 300 × g for 10 min at room temperature (23°C) with the brake on at maximum.\nAfter centrifugation, aspirate the supernatant from the pellet and gently resuspend the cells in 1 mL of PBS containing 1 mM EDTA.\nNote: There will be some visible red blood cell contamination, which will be lost after cryopreservation and downstream assays (Figure 1[href=https://www.wicell.org#fig1]D).\nNote: Minimize the time that the PBMCs remain in pellet.\nPerform a cell count by removing 10 μL for a Trypan Blue exclusion using a hemocytometer (Strober 2001[href=https://www.wicell.org#bib6]) or an automated cell counter.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2054-Fig1.jpg\nFigure 1. PBMC isolation using Sepmate-50TM tube\n(A) Layer diluted blood with PBS into a Sepmate-50TM tube containing Lymphoprep.\n(B) Diluted plasma, buffy coat, Lymphoprep and red blood cell layer after centrifugation.\n(C) The arrow indicates PBMCs being lodged on the side of the tube.\n(D) Presence of red blood cell contamination in PBMC cell pellet.",
    "After removing the aliquot for cell counting, top up the 50 mL tube with PBS containing 1 mM EDTA and centrifuge 300 × g for 10 min at room temperature (23°C) with the brake on.\nAfter centrifugation, remove the supernatant from the pellet.\nPBMCs can be used after this step (see MDMi differentiation[href=https://www.wicell.org#sec3.5]- step 21) or frozen down.\nThe PBMC cryopreservation medium is made up of 10% DMSO and 90% cold FBS (100 μL of DMSO and 900 μL of FBS).\nDissolving DMSO in cold FBS will ensure that the cryopreservation medium does not heat up.\nGently resuspend the PBMC pellet with 1 mL of cryopreservation medium and transfer to a pre-chilled cryovial labeled with the number of cells and date of freezing.\nEach cryovial should contain ∼1 × 107 cells or per tube of blood (9 mL).\nPlace the cryovial in a pre-chilled Nalgene® Mr. Frosty and store in −80°C freezer for 24 h.\nTransfer the vials to the vapor phase of liquid nitrogen after 24 h.\nNote: Do not re-use the unused cryopreservation medium.\nNote: Expected PBMC yields from whole blood (adult) ranges from 1.3–3 × 106 cells/mL.\nCritical: FBS must be heat-inactivated prior to use (see materials and equipment[href=https://www.wicell.org#materials-and-equipment]).\nProtocol II: PBMC isolation using density gradient centrifugation using Lymphoprep\nTiming: 2.5 h\nThis protocol enables the successful isolation of PBMCs for MDMi differentiation using density gradient centrifugation.\nCollect 8–9 mLs of human venous blood.\nA certified phlebotomist must perform blood collection.\nAny vacutainer blood tubes containing anti-coagulant can be used. For example: 9 mL Vacuette K3 EDTA tubes.\nPerform all future protocol steps within a tissue culture biohazard hood.\nGently mix the blood to ensure a homogeneous suspension.\nDilute blood at 1:1 with room temperature (23°C) sterile PBS in a 50 mL Falcon tube.",
    "Note: Use PBS without Ca2+ and Mg2+.\nPrepare density gradient solution in a 50 mL tube for PBMC isolation.\nAdd 7.5 mL of room temperature (23°C) Lymphoprep to a 50 mL tube.\nCarefully layer the diluted blood on top of the Lymphoprep using a transfer pipette.\nSlowly drip the diluted blood against the side of the 50 mL tube to avoid mixing with the Lymphoprep.\nCentrifuge at 400 × g for 30 min at room temperature (23°C), NO BRAKE (1/10) for deceleration to prevent red blood cells remixing with PBMCs.\nNote: Centrifuge blood immediately after layering. Blood will gradually mix with Lymphoprep if not centrifuged. The tube can be spun for an additional 10 min with the break-off.\nCritical: Leaving the break on will disrupt the layers.\nGently transfer the buffy coat to a new 50 mL tube with a transfer pipette.\nNote: Avoid getting any of the Lymphoprep and red blood cell layer.\nTop up 50 mL tube with PBS containing 1 mM EDTA and centrifuge at 300 × g for 10 min. Brake can be turned on.\nAfter centrifugation, aspirate the supernatant from the pellet and gently resuspend the cells in 1 mL of PBS with 1 mM EDTA.\nNote: There will be some visible red blood cell contamination, which will be lost after cryopreservation and downstream assays.\nPerform a cell count by removing 10 μL for a Trypan Blue exclusion using a hemocytometer or automated cell counter.\nAfter removing the aliquot for cell counting, top-up 50 mL with PBS containing 1 mM EDTA and centrifuge 300 × g for 10 min.\nTo freeze down PBMCs- see Protocol 1 – step 7.\nCritical: All steps of PBMC isolation must be completed using room temperature (23°C) buffers.",
    "Alternatives: Lymphoprep can be substituted for Ficoll-Paque Plus (GE healthcare Pharmacia- 17-1440-03). These products have a density of 1.077 g/mL suitable for PBMC isolation.\nCoating procedure using corning Matrigel basement matrix\nTiming: 1–2 day\nThis protocol ensures proper coating of tissue culture plates using Matrigel for successful differentiation of MDMi (https://www.corning.com/catalog/cls/documents/faqs/CLS-DL-CC-026.pdf[href=https://www.corning.com/catalog/cls/documents/faqs/CLS-DL-CC-026.pdf]).\nThaw Matrigel basement membrane matrix overnight (16–24 h).\nThaw Matrigel by submerging the vial in ice at 4°C overnight (16–24 h) as per the manufacturer’s recommendation[href=https://ecatalog.corning.com/life-sciences/b2c/US/en/Surfaces/Extracellular-Matrices-ECMs/Corning%C2%AE-Matrigel%C2%AE-Matrix/p/354234].\nThe next day, swirl the Matrigel vial to ensure homogeneity before use.\nNote: Do not freeze/thaw Matrigel. Aliquot and store Matrigel at −80°C for future use.\nCritical: Matrigel basement membrane matrix is temperature sensitive and will solidify (gelled) above 10°C. Keep Matrigel on the ice at all times and use pre-chilled disposables.\nPrepare ice-cold sterile PBS and chill pipette tips in ice-cold PBS by pipetting repeatedly or in the fridge for 10 min to prevent Matrigel gelling on pipette tip causing inaccuracy.\nSpray down the ice bucket containing Matrigel with 70% v/v ethanol before placing it in the tissue culture hood.\nPerform all subsequent procedure within a tissue culture hood.\nThinly coat tissue culture plates with 100 μg/mL of Matrigel diluted in ice-cold PBS.\nCover the surface of the tissue culture plates. For example, add 200 μL /cm2 of Matrigel coating solution to the growth surface.\nResuspend solution until Matrigel is dissolved in PBS (herein referred as Matrigel coating solution).\nNote: If Matrigel has gelled in PBS, leave the solution in the fridge for 10 min until it dissolves.\nEnsure that the plate’s total surface area is covered with the Matrigel coating solution.\nPlace plates in a 37°C/5% CO2 incubator overnight (16–24 h).",
    "Note: Matrigel's protein concentration ranges between 8-12 mg/mL depending on the lot number. Check the concentration of Matrigel basement membrane matrix: https://www.corning.com/worldwide/en/products/life-sciences/resource-library.html?productNumber=356230&lotNumber=[href=https://www.corning.com/worldwide/en/products/life-sciences/resource-library.html?productNumber=356230&lotNumber=].\nAlternatives: Matrigel can be substituted with Geltrex matrix (Thermo Fisher Scientific - Cat#A1413202).\nCritical: Do not coat plates with undissolved Matrigel. Do not store unused Matrigel at 4°C post-thaw/dilution. Instead, aliquot Matrigel and store at −20°C.\nNote: Matrigel-coated plates are best used the same day, but can be stored in the incubator at 37°C for up to a week in Matrigel coating solution. Do not allow the coated surface to dry out.\nEstablish PBMC cultures for MDMi differentiation\nThis protocol allows for the successful differentiation of MDMi for in vitro characterization. We will cover all steps that might affect MDMi differentiation from thawing PBMCs to coating culture plates and medium changes.\nPBMC thawing protocol to optimize cell recovery for MDMi differentiation\nTiming: 1 h\nThis protocol is optimized for maximum PBMC recovery after thawing for MDMi differentiation.\nPrepare pre-warmed complete RPMI medium in a water bath.\nEnsure that the FBS is heat-inactivated.\nThaw PBMC cryovial at 37°C in a water bath by gentle shaking the vial, and remove when a small amount of ice crystal remains.\nWipe down PBMC cryovial with 70% v/v ethanol before transferring into the tissue culture hood.\nTransfer PBMC from the cryovial to a 10 mL tube.\nDrop-wise addition of pre-warmed complete RPMI medium into the tube containing PBMCs at a rate of 1 drop per second while swirling the sample until 4 mL. Top up to 10 mL with pre-warmed complete RPMI medium.\nNote: Drop-wise addition of complete RPMI medium is critical to minimize osmotic shock to ensure maximum viability of the cells.\nCritical: All thawing steps must be completed using pre-warmed medium for best cell viability and recovery.",
    "Centrifuge sample at 300 × g for 5 min at room temperature (23°C).\nAspirate the supernatant and resuspend the cells in 1 mL of pre-warmed complete RPMI medium.\nPerform a cell count by removing 10 μL for a Trypan Blue exclusion using a hemocytometer or automated cell counter.\nNote: If PBMCs appear clumpy, use a 70 μm cell strainer to remove clumps to obtain a single cell suspension.\nProceed with the MDMi differentiation step.\nMDMi differentiation\nTiming: 14 days\nThis protocol describes the differentiation of MDMi from PBMCs. MDMi were differentiated for 14 days prior to downstream assay. We have also outlined a timeline for medium changes across 14 days of MDMi differentiation (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2054-Fig2.jpg\nFigure 2. Timeline for medium changes across 14 days of MDMi differentiation\nDifferentiate MDMi in a 37°C/5% CO2 incubator for 14 days, as follows:\nOn day 1, plate 4 × 105 PBMCs/cm2 in complete RPMI medium.\nOscillate the plate gently to disperse the cells homogeneously across the plate (day 1), and leave the plate for 5 min before putting them in the incubator.\nLeave plate overnight (16–24 h) in a 37°C/5% CO2 incubator.\nOn day 2 in culture, remove all medium from the plate and replace with fresh MDMi base medium containing 100 ng/mL IL-34 and 10 ng/mL GM-CSF.\nPerform a medium change every 3 days (day 5, day 8, and day 11) by removing half the medium and replacing it with fresh MDMi base medium containing 2× cytokines (i.e., 200 ng/mL IL-34 and 20 ng/mL GM-CSF (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2054-Fig3.jpg\nFigure 3. Representative images of MDMi throughout 14 days of differentiation\n(A) Mixed culture of monocyte and lymphocytes on Day 2.\n(B) Monocytes adhering to the plate’s bottom appear irregular in shape while lymphocytes remains rounded at Day 5.",
    "(C) The elongated appearance of monocytes on Day 8.\n(D) Cells showed an increase in ramification on Day 11.\n(E) Fully ramified MDMi on Day 14. Scale bar, 50 μm.\nMDMi can be used on day 14 for downstream experiments.\nNote: MDMi are non-proliferative and will lose its morphology if re-plated. Therefore the user needs to determine the required cell number prior to plating, in accordance to the assay that will be performed.\nCharacterization of MDMi by immunocytochemistry\nTiming: 15 days\nThis protocol describes how to prepare MDMi for analysis by immunocytochemistry with a microglia-specific marker. MDMi were differentiated for 14 days and stained for P2RY12 (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2054-Fig4.jpg\nFigure 4. Immunocytochemistry of day 14 MDMi\n(A) Representative image of day 14 MDMi stained for P2RY12. Scale bar, 50 μm.\nPrepare imaging chamber slides.\nCoat 8-well chamber slides with 400 μL of 100 μg/mL of Matrigel in cold PBS by incubating overnight (16–24 h) at 37°C. Remove Matrigel solution and rinse each chamber three times with PBS before plating PBMCs.\nPlate PBMCs and differentiate for 14 days as follows:\nPlate 3 × 105 /400 μL PBMCs on Matrigel-coated chamber slides and culture in a 37°C/5% CO2 incubator.\nChange medium every third day until Day 14 (see MDMi differentiation[href=https://www.wicell.org#sec3.5] – step 21).\nAspirate the cell culture medium and wash cells once with PBS.\nFix cells with 400 μL (per well) of 4% paraformaldehyde (PFA) in PBS for 15 min at RT. Wash coverslips thrice with PBS.\nFor permeabilization, incubate cells with 400 μL (per well) of 0.3% Triton-X 100 in 2.5% BSA in PBS for 10 min at RT. Cells do not need to be wash after this step.\nBlock non-specific binding with 400 μL (per well) of 2.5% BSA in PBS for 1 h at RT.",
    "Replace blocking solution with 400 μL (per well) of primary antibody diluted in 2.5% BSA in PBS (see materials and equipment[href=https://www.wicell.org#materials-and-equipment] for antibody details) for 1 h at room temperature (23°C).\nWash chamber slides 5 times with 500 μL (per well) of PBS for 5 min each.\nReplace PBS with 400 μL (per well) secondary antibody with 1 μg/mL Hoechst 33342 (nuclear dye) diluted in 2.5% BSA in PBS (see materials and equipment[href=https://www.wicell.org#materials-and-equipment] for antibody details) for 2 h, in the dark at room temperature (23°C).\nWash chamber slides 5 times with 500 μL (per well) of PBS for 5 min each.\nAdd 500 μL (per well) of PBS. Slides can be imaged immediately or stored at 4°C for long-term storage.\nNote: Samples were visualized on a Zeiss LSM-780 NLO with ZEN software. Image analysis was performed with Image J. Background signal and secondary only control were used to subtract from images in FIJI software using the function “Process> Subtract background”."
  ],
  "subjectAreas": [
    "Immunology",
    "Health Sciences",
    "Cell Isolation",
    "Cell Culture",
    "Cell Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}