{
  "id": 15910,
  "origin_website": "Jove",
  "title": "Quantifying the Binding Interactions Between Cu(II) and Peptide Residues in the Presence and Absence of Chromophores",
  "procedures": [
    "1. Electronic absorption spectroscopy: direct titration with buffer competition\nSample preparation\n\t\nPrepare a buffered solution of 50 mM 2-[bis(2-hydroxyethyl)amino]-2-(hydroxymethyl)propane-1,3-diol (bisTris) at pH 7.4 using ultrapure water (>18 MΩ resistance). Remove trace metal ions by incubating with a high-affinity resin for at least 2 h with subsequent filtration.\nDissolve or dilute a known quantity of the peptide into the metal-free buffer.\n\t\tNOTE: When monitoring d-d bands with small extinction coefficients21, higher concentrations of peptide must be used. Here, the final concentration of C-peptide in buffered solution was 300 µM (volume depends on the size of the cuvette). C-peptide was synthesized by solid-phase peptide synthesis and is detailed elsewhere in literature14.\nDissolve a known mass of CuCl2 in ultrapure water to make a solution at 10-15 mM.\n\t\tNOTE: It is important to initially dissolve the metal salt in nonbuffered water to prevent precipitation. Other Cu(II) salts may be used, but care must be taken to ensure that the anion is weakly coordinating.\nRunning the experiment\n\t\nTurn on the electronic absorption spectrophotometer and let it warm up for ~15-20 min before use. Launch the spectrophotometer software and configure the parameters such as scanning range (200-900 nm), scan rate (200 nm/s), and double beam baseline-corrected (more parameters are listed in the Supplemental File).\nCollect a baseline with no cuvettes or samples in the beam paths.\nUsing two matched cuvettes in the double-beam spectrophotometer, load one cuvette with 115 µL of ultrapure water and the other cuvette with 115 µL of the peptide sample. Ensure that there are no air bubbles in the cuvettes as these will interfere with the signal.\nPlace the cuvette with ultrapure water in the reference beam and the cuvette with peptide in the sample beam.\nCollect the absorption spectrum of the metal-free (apo) peptide.",
    "Add in a sub-stoichiometric amount (0.5 equivalents, 150 µM) of the Cu(II) solution into the cuvette with the peptide sample. Ensure that the volume of Cu(II) added is less than 3 µL and record the volume for analysis later.\nGently pipette up and down to mix the solution while avoiding the generation of air bubbles. Let the solution react and equilibrate for 5 min and record the absorption spectrum.\nRepeat the addition of Cu(II) aliquots as in step 1.2.6 into the peptide solution for the following equivalents: 1.0, 1.5, 2.0, 3.0, and 5.0 (or a total of 300, 450, 600, 900, and 1,500 µM). Make sure to record the total volume of Cu(II) added and the total volume of the cuvette.\n\t\tNOTE: If more resolution is desired, reduce the spacing between equivalents.\nRemove the sample cuvette and thoroughly clean as per the manufacturer's directions.\nAdd the buffered solution without peptide and record the absorption spectrum. Repeat the addition of Cu(II) aliquots as in steps 1.2.5-1.2.8, recording the absorption spectrum for each Cu(II) equivalent.\nExport all spectra as csv files for processing. Thoroughly clean the cuvettes according to the manufacturer's instructions and power down the spectrophotometer.\nProcessing the data\n\t\nLoad all spectra on a spreadsheet program.\nSubtract the buffer-only (0 µM Cu(II)) spectrum from every other spectrum to remove any absorbance features from the buffer itself.\nNormalize each spectrum to account for the dilution resulting from the addition of the Cu(II) solution (step 1.2.6). See the Supplemental File, Eq (1)14 for an example of the normalization where vinitial is the volume (115 µL) of peptide added to the cuvette, vCu(II) is the volume of Cu(II) solution added in step 1.2.6, and Absbuffer subtracted spectrum is the data obtained in step 1.2.7.\nGraph all spectra together to identify regions of change.",
    "​NOTE: Typical d-d bands from Cu(II) complexes range from 500 to 750 nm. This spectrophotometric titration can be challenging due to the small extinction coefficient from d-d bands, which are Laporte-forbidden transitions in octahedral geometry21. If the absorbance is too weak, an alternative approach is to utilize chromophoric ligands that result in charge transfer bands upon binding to Cu(II) (see section 2).\n2. Electronic absorption spectroscopy: peptide competition with chromophoric ligand\nSample preparation\n\t\nDissolve 1,10-phenanthroline (phen) in ultrapure water to obtain a final concentration of ~1 mM.\nIn addition to the sample preparation described in section 1.1 for the peptide (step 1.1.2) and Cu(II) (step 1.1.3), prepare a 10 µM Cu(II) and 40 µM phen solution in buffer ([Cu(phen)3]2+). Ensure that the volume fills the cuvette.\nRunning the experiment\n\t\nStart the electronic absorption spectrophotometer as in steps 1.2.1 and 1.2.2 but set the scanning range to 200-400 nm.\nIn two matched cuvettes, load one cuvette with 115 µL of ultrapure water and the other cuvette with 115 µL of the [Cu(phen)3]2+ solution. Place the cuvette with water in the reference beam and the cuvette with [Cu(phen)3]2+ solution in the sample beam.\nCollect the absorption spectrum of the metal-ligand complex.\nAdd a stoichiometric amount (≈1 equivalents, ≈10 µM) of peptide to the [Cu(phen)3]2+ solution. Gently pipette up and down to thoroughly mix but be careful not to introduce air bubbles. Record the volume of peptide added for future analysis.\n\t\tNOTE: Using cuvettes that hold 115 µL, adding 3.83 µL of 300 µM peptide yields a final peptide concentration of 9.7 µM.\nIncubate the solution for 5 min to reach equilibrium. Record the absorption spectrum.",
    "NOTE: If the binding affinity of the metal-peptide and metal-ligand are similar, the concentration of peptide added will need to be in large excess. Be sure to account for the total volume of peptide added for normalization.\nRepeat the addition of peptide aliquots into the [Cu(phen)3]2+ solution for the following approximate equivalents: 2, 3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 16, 18, 22, and 26. Record the volume of peptide added so that the diluted concentration can be determined.\nRemove the sample and clean the cuvette thoroughly according to the manufacturer's instructions. Collect a spectrum of the buffer. Collect a spectrum of 50 µM peptide in the buffer.\nExport all data as csv files for processing and clean the cuvettes according to the manufacturer's instructions.\nProcessing the data\n\t\nLoad the spectra on a spreadsheet program and subtract the buffer spectrum from the other spectra.\nNormalize the spectra following Supplemental File, Eq (2)14.\nUsing the extinction coefficient for [Cu(phen)3]2+ at 265 nm (εmax = 90,000 M-1cm-1)22, determine the concentration of [Cu(phen)3]2+ with each addition of the peptide.\nFor each addition of the peptide, determine the concentration of the Cu(II)-peptide complex by subtracting the remaining concentration of [Cu(phen)3]2+, as determined in step 2.3.2, from the initial concentration of [Cu(phen)3]2+ (at 0 µM peptide).\nCalculate the concentration of free phen ligand by the equation in Supplemental File, Eq (3)14.\nCalculate the concentration of free peptide using Supplemental File, Eq (4)14, where [peptide]stock represents the undiluted peptide titrated into the cuvette, V1 represents the volume of stock peptide added, V2 is the total volume of the cuvette, and [Cu2+-peptide] is determined in step 2.3.4.\nCalculate the experimental binding affinity (Kex) using Eq (5) in Supplemental File23.",
    "Relate the dissociation constant of Cu(II)-peptide to Kex by Eq (6)23 in Supplemental File, where Kd,Cu(II)-phen = 1.0 × 10-9 (see 22). Determine the average and standard deviation from all the determined dissociation constants.\n\t\t​NOTE: Under a 4:1 ratio of phen:Cu(II), [Cu(phen)3]2+, [Cu(phen)2]2+, and [Cu(phen)]2+ exist in the solution, and the peptide will chelate Cu(II) away from the species ([Cu(phen)]2+) with the weakest binding22.\n3. Isothermal titration calorimetry\nSample preparation\n\t\nPrepare a buffered solution of 15 mM 3-morpholinopropane-1-sulfonic acid (MOPS) at pH 7.4 using ultrapure water (>18 MΩ resistance). Remove trace metal ions by incubating with a high-affinity resin for at least 2 h with subsequent vacuum filtration through a bottle-top 0.45 µm membrane.\nDissolve a known mass of CuCl2 in ultrapure water to prepare a solution of ≈50-100 mM. Dilute this Cu(II) solution into buffer to obtain a 1.0 mL solution with final concentration of 1.4 mM Cu(II). Record the exact volume of the CuCl2 solution used.\nDissolve or dilute the peptide solution in buffer to make 450 µL of a 154 µM peptide solution. Ensure that the same proportion of additional ultrapure water from step 3.1.2 is added to the peptide solution, which will reduce heat of dilution and increase signal-to-noise.\nAfter preparation of the samples, ensure that the solutions are at the same pH and, if needed, adjust accordingly.\nOptional step: Degas the solutions to minimize microbubbles loaded into the ITC.\nRunning the experiment\n\t\nTurn on the ITC. Launch the ITC software to run the instrument. Wait for the first initialization, which will ask to rehome the buret; then, follow the instructions on the screen.\nRemove the cover from the reference cell. Remove any water from the reference cell and rinse three times with 450 µL of degassed ultrapure water.",
    "Slowly draw up ultrapure water to the 450 µL mark of a loading syringe, taking care not to introduce air bubbles into the syringe. Insert the loading syringe into the reference cell until it is ≈1 mm from the bottom, and slowly inject part of the solution until 150 µL remains in the loading syringe. Move the loading syringe plunger quickly up and down by ≈25 µL several times to dislodge any bubbles on the cell surface. Slowly inject until the plunger reaches the 100 µL mark on the loading syringe, thereby dispensing a total of 350 µL of ultrapure water into the reference cell, and replace the reference cell cover.\nRemove any residual solution from the sample cell and load with 450 µL of 10 mM ethylenediaminetetraacetic acid (EDTA) using a loading syringe. Soak for 10 min to ensure that trace metal ions are removed because the EDTA will bind trace metals.\nRemove the EDTA solution (with bound trace metal ions) and thoroughly rinse the loading syringe with copious amounts of ultrapure water.\nClean the ITC in accordance with the manufacturer's directions, rinsing the sample cell with ultrapure water.\nCondition the sample cell by rinsing with 450 µL of buffer at least three times.\nRemove the buffer that is conditioning the sample cell. Load the peptide solution into the sample cell using the loading syringe (follow step 3.2.3).\nRinse the titration syringe with 200 µL of buffered solution. To do this, remove the plunger and use a micropipette to pipette the buffer through the hole at the top of the glass titration syringe, through the syringe, and out the needle below.\nFully insert the plunger into the titration syringe.",
    "Dip the tip of the titration syringe needle into the metal solution and slowly pull the plunger up, causing the metal solution to fill the syringe and result in a void volume at the top of the glass part of the titration syringe. Remove most of the void volume by rotating the titration syringe parallel to the floor, remove the plunger, and slightly tilt the glass part toward the floor. Give the titration syringe a gentle shake so that the solution moves to the end of the glass part of the titration syringe and fills most of the void volume, but ensure that 2-3 µL of void volume remains. While keeping the syringe parallel to the floor, reinsert the plunger.\nHold the titration syringe upright, dip the tip of the needle back into the metal solution, and push the plunger down until air ceases to come out of the needle. Load the titration syringe by slowly pulling up the plunger to just above the 50 µL mark while keeping the tip of the needle in the solution.\nCarefully insert the glass part of the titration syringe into the buret and screw until finger-tight. When a small amount of solution comes out of the titration syringe due to compression of the plunger, use a light-duty delicate wiper to carefully absorb the solution without touching the tip of the needle.\nInsert the buret with titration syringe into the sample cell and fasten it securely.\nSet up the parameters on the ITC software. Starting on Instrument Control, set the stirring rate (typical stirring rates range from 150 to 350 RPM) and the temperature at which the experiment will be conducted (typically 25 °C). Enter the syringe and cell concentrations in millimolar units under Experiment Details.",
    "In the Experiment Method section, select Incremental Titration. Click on Setup and specify 20 injections of 2.5 µL. If more resolution is required to observe the binding event, increase the number of injections and decrease the volume per injection. Input the time spacing between each injection so that it is long enough for the signal to equilibrate and return to baseline, typically 300 s.\nClick the run button to start the experiment and specify where the data are saved.\nUpon completion of the experiment, clean the sample cell and titration syringe.\nRun all experiments in at least triplicate to ensure precise data collection.\nRun a control experiment where the metal solution is titrated into the buffered solution (in the absence of peptide) to ensure the heat of dilution from the metal ion is small and that there are no unaccounted-for equilibria. If the heat of dilution is large, consider a different buffer system, if possible.\nProcessing the data\n\t\nLaunch the ITC analysis software and load the data file for analysis.\nNavigate to the Baseline tab and inspect the thermogram. Note any exogenous heat evolved or absorbed from air bubbles or other artifacts in the thermogram. Look for spikes that are not due to injection of the metal solution.\nEnsure that the baseline generated by the analysis software follows the portion of the data after injection and equilibration. If it deviates, use Baseline Pivot Points to adjust the baseline. Ensure that the Integration Regions include the peak generated from injection of the metal, but occlude any air bubbles or artifacts in the thermogram found in step 2. Subtract the baseline from the thermogram.",
    "NOTE: This type of manipulation is recommended only after multiple thermograms are collected, so the experimenter knows what is real data and what is an artifact, as adjusting the baseline and Integration Regions may drastically affect the data.\nNavigate to the Modeling window to begin fitting the data where the analysis software will show the integrated and concentration-normalized data for each injection.\nLeft-click on the datum of the first injection to remove it from the fitting algorithm.\n\t\tNOTE: This is common since there will be minor mixing between the titrant and sample cell solution leading to inexact molar dispensing of the first injection.\nIn the Models section, select Blank (constant) in the Style dropdown menu, which is based on the final injection enthalpy and will be subtracted from every data point, accounting for the heat of dilution. In addition, select Independent (or the best model for the system) in the second Style dropdown menu to fit the data.\n\t\tNOTE: For standard 1:1 binding interactions, the most common model is Independent.\nFit the data using the two models by pressing the green play button with a Σ.\n\t\tNOTE: Another software to process ITC data is SEDPHAT24.\nAccount for all competing equilibria in post hoc analysis previously reported by Grossoehme et al.20.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}