{
  "id": 7731,
  "origin_website": "Bio",
  "title": "Using BODIPY FL-Sphingolipid Analogs to Study Sphingolipid Metabolism in Mouse Embryonic Stem Cells",
  "procedures": [
    "Plate and culture mESCsDissolve gelatin powder in cell culture-grade water to the final concentration of 0.1% (w/v), then sterilize this solution by autoclave.Apply an appropriate amount of 0.1% gelatin solution to cover the entire surface area of cell culture dishes, then incubate the dishes at room temperature (RT) for 30 min to coat the cell growth area.After incubation, aspirate the gelatin solution and wash the coated cell culture dishes with PBS solution twice for 3 min each time, to completely remove the residual gelatin solution.Note: All above procedures (2–3) must be performed in a sterile hood. The resulting gelatin-coated dishes will be set aside in PBS solution for fresh cell plating. They can also be dried then kept at RT for up to 1 month for future use (after rehydration with PBS solution). Completely disassociate pre-cultured mESCs, by adding an appropriate amount of 0.05% trypsin (e.g., an approximate volume of 300 µL for each well of the 6-well plate) to cover the entire cell growth area, then incubate at 37 °C for 3 min. After cells are completely disassociated from dishes, wash them twice with 30 mL of PBS solution in 50-mL Corning tubes, to completely remove residual trypsin. Harvest cells by centrifugation at 300 × g for 3 min.Note: mESC colonies must be completely disassociated with 0.05% trypsin (extra amount of trypsin and extended digestion time may be applied) to ensure all cells are evenly dispersed in cell suspension before re-plating. Failure to complete dissociate cells could induce differentiation of mESCs, and/or formation of big cell clumps that interfere with subsequent analyses. Resuspend mESCs with the ESGRO growth medium, and plate cells on gelatin-coated 6-well cell culture plates for FACS analysis, or NuncTM Glass Bottom Dishes for CLSM visualization, at the density of approximately 5 × 104 cells/cm2.",
    "Incubate cells in a cell culture incubator at 37 °C with 95% humidity and 5% CO2. Cells will be stained with BODIPY FL-sphingomyelin analogs after their attachment to dishes, or after overnight incubation.Note: mESCs are very sensitive to environmental perturbations, including chemical and physical stresses. Even very minor agitations may result in apoptosis, differentiation, or morphological changes of mESCs. Therefore, cell culture procedures must be performed in an extraordinarily careful and gentle manner. Prepare the stock and working solutions of BODIPY FL C5-sphingomyelin analogsStock solution: Mix absolute chloroform and absolute ethanol at a ratio of 19:1 (v/v) (Recipe 3) inside a chemical safety cabinet. To prepare 1 mM BODIPY FL C5-sphingomyelin stock solution, directly inject an appropriate amount of the prepared chloroform/ethanol solvent into the original product vial containing the BODIPY FL C5-sphingomyelin powder. Shake vials until all powders are completely dissolved in the solvent, then transfer the 1 mM stock solution to amber glass round vials. This stock solution must be stored at -20 °C and strictly protected from light.Working solution:Dispense 50 µL of 1 mM BODIPY FL C5-sphingomyelin stock solution from step B1 into an amber glass round vial. Evaporate the organic solvent under a stream of nitrogen, by placing the nozzle (like a needle) of the nitrogen evaporator into the mouth of the amber glass round vial, and spraying the nitrogen gas toward the stock solution, until no liquid phase is observed. After the liquid phase has been completely dried off, add 200 µL of absolute ethanol into the amber glass round vial, to reconstitute the dried BODIPY FL C5-sphingomyelin powder.To prepare 5 µM defatted BSA solution, dissolve an appropriate amount of defatted BSA into 10 mL of Hanks’ buffered salt solution containing 10 mM HEPES (HBSS/HEPES buffer, Recipe 4).",
    "Add the prepared 200 μL of BODIPY FL C5-sphingomyelin solution in ethanol from step B2a into the 10 mL of 5µM fatty acid-free BSA solution from step B2b, and mix properly on a vortex mixer to generate the working solution (5 μM BODIPY FL-sphingomyelin + 5 μM BSA). Store the working solution at -20 °C, with strict protection from light.Note: The purpose of defatted BSA in the working solution is to remove all residual pools of fluorescent lipid analogs, which will remain on the surface of plasma membranes after internalization of membrane-inserted lipid analogs, by “back-exchange” effects (Kok et al., 1989; Abreu et al., 2003). Stain mESCs with the working solution of BODIPY FL C5-sphingolipid analogs for confocal imaging analysisRemove all ESGRO growth medium from the overnight cell culture dishes and wash adherent cells three times with HBSS/HEPES buffer at RT, to remove residual ESGRO growth medium and floating dead cells. Apply sufficient working solution (prepared from the previous step) into cell culture dishes to completely cover the entire area where cells grow and incubate cells at 4 °C for 30 min with strict protection from light. The negative control sample will be incubated with the HBSS/HEPES buffer instead of BODIPY FL C5-sphingolipid working solution in this step.Note: During the washing step, PBS solution should be added against the side of the well instead of directly on the top of cells, so that cells will not be dislodged. The healthy mESCs are able to attach to gelatin-coated cell culture dishes. The majority of the cells dislodged during washing are dead or apoptotic cells and must be discarded. After 30 min incubation at 4 °C, completely remove all working solution and wash cells three times with ice-cold ESGRO growth medium.",
    "After washing, add adequate fresh RT ESGRO growth medium to cover the cells, and incubate cells in an incubator at 37 °C, 95% humidity, and 5% CO2 for 30 min. Strictly protect the incubation from light.Wash cells with fresh ESGRO growth medium at RT. Stained cells on glass bottom dishes will be directly examined and imaged with the Zeiss LSM 780 UV confocal microscope.Note: Cells can also be counter-stained with other dyes, such as nuclei staining with DAPI or DRQA5 (Fan et al., 2021). The dynamic of BODIPY FL-sphingomyelins in stained mESCs will be analyzed using a Zeiss LSM 780 UV inverted confocal microscope equipped with a cell culture chamber that provides appropriate cell growth conditions (e.g., 37 °C, 95% humidity, and 5% CO2). Time-lapse images of stained mESCs are acquired every 5 min for up to 12 h. An example of the dynamic of BODIPY FL-sphingomyelins in mESCs can be found in our original research article (Fan et al., 2021).Analyze mESCs stained with BODIPY FL C5-sphingolipid analogs by FACSAfter incubation at 37 °C, as described in step C2, wash cells with HBSS/HEPES buffer three times, to completely remove the ESGRO growth medium. Completely disassociate mESCs cells by adding an appropriate amount of 0.05% trypsin (approximately 300–500 µL for each well of the 6-well plate), then incubating at 37 °C for 3 min. Wash cells twice with 30 mL of HBSS/HEPES buffer in 50-mL Corning tubes to completely remove residual trypsin and harvest cells by centrifuging at 300 × g for 3 min.Note: Extra amount of trypsin and extended digestion time can be applied for this step to complete dissociate large mESC colonies and prevent formation of cell clumps.",
    "Discard the supernatant and resuspend the cell pellets in 1 mL of HBSS/HEPES buffer, then transfer the cells into 5-mL round bottom polystyrene test tubes for FACS analysis.Note: Samples must be strictly protected from light in the two steps above. The parameters setup for visualization and quantification analysis by BD LSRFortessa FACS are based on the spectral characteristics of the BODIPY FL-sphingolipid described in Table 1.Table 1. Spectral characteristics of BODIPY FL-sphingolipid  (recommended in the manual of Molecular Probes)table:",
    "﻿0,1,2\nLabel,Absorption/Emission (nm),Optical Filter\nBODIPY FL,505/511,\"Omega/Chroma XF26, XF115/71010,41012\""
  ],
  "subjectAreas": [
    "Cell Biology",
    "Stem Cell"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}