{
  "id": 7683,
  "origin_website": "Bio",
  "title": "Incorporation of a Chemically Diverse Set of Non-Standard Amino Acids into a Gram-Positive Organism",
  "procedures": [
    "S750 protocol for tubes and 96-well plates Remove glycerol stock that contains desired B. subtilis strain from -80 °C freezer. Streak cells from the glycerol stock onto an LB agar plate. Antibiotics may be useful for confirming strain identity but are not necessary as incorporation constructs are stable integrations. Incubate overnight at 37 °C. See Note 1 for essential controls that should be included in every experiment.On the next day, pick desired colonies from the LB plate and transfer to 1 mL of S750 media in culture tubes. Mix vigorously by pipetting up and down to break up biofilms and promote suspension growth. These serve as the seed cultures for the experiment, without induction of heterologous gene expression. See Note 2 for optional media conditions.Grow in a 37 °C shaking incubator or rotor drum for 4–6 h, to an OD between 0.2 and 0.7.Prepare experimental media (which will serve to induce heterologous gene expression and nsAA incorporation) by adding the desired IPTG and nsAA to S750. IPTG final concentration is 1 mM, which is 1,000× of a 1 M stock solution. IPTG is typically added to all cultures including nsAA, except in the case of titration; for double titration see Figure 1. nsAA final concentration is usually 100 μM for most tyrosine-derived nsAAs. 1 mM should be used for boc-K, 5OHW, and CouAA. Similarly, other concentrations can be used for titration (see Figure 1 for an example). Different nsAAs will exhibit different titration dynamics due to the differences in binding to their cognate synthetases.For a 96-well plate format, a suggested higher throughput strategy is to prepare the master mix media unique to each nsAA in 15 mL tubes, then transfer to reservoir and distribute 300 μL with a 1 mL multichannel into a 2 mL deep well plate.",
    "In our experience, culture volumes above 300 μL do not aerate well in the deep 96-well plate format. See Figure 2 for the suggested media layout.For single culture tubes, use no more than 1 mL media per tube for aeration reasons.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4507/bioprotoc-12-17-4507-g001.jpgFigure 1. Double titration with nsAAs and transcriptional inducers. A UAG-mNeongreen construct under the control of a pHyperspank promoter was expressed with variable levels of nsAA and IPTG; a very sensitive induction was possible with low levels of IPTG and titration of nsAA. The signal was normalized to a positive control construct, where a TAC tyrosine codon replaced the UAG stop codon and 1 mM IPTG was provided. For more details, see Data analysis.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4507/bioprotoc-12-17-4507-g002.jpgFigure 2. Suggested plate layout for easy plate-filling. This plate layout is easy to set up with a multichannel pipette with minimal errors.Measure OD of the seed cultures, then dilute them with additional S750 to start the experimental cultures at a theoretical density of 0.002 with desired cells.For a 96-well plate setup, dilute cultures with S750 in a PCR tube to OD 0.2, then use a multichannel to distribute 3 μL across the plate as desired, to achieve a final OD of 0.002 in 300 μL of experimental media.For single culture tubes, dilute media appropriately to final OD 0.002. For example, add 4 μL of OD 0.5 seed culture to 1 mL of S750 containing IPTG and nsAA.Incubate tubes/plate overnight, shaking at 37 °C.For 96-well deep well plates, cover with a breathable cover (see Note 4b). Example data are in Figure 3a.For clear-bottomed shallow 96-well plates used in time courses, cover with a transparent breathable cover. Shaking should be set to a fast speed, though either orbital or double orbital can be used. Read OD600 and fluorescence every 5–10 min.",
    "For the mNeongreen reporter, reading at 488/530 is acceptable, though many different filter settings will work for mNeongreen. Example data in Figure 3b.For single culture tubes, grow in a 37 °C shaking incubator or rotor drum.Read endpoint data after overnight growth. Extensively long growth periods will see some decrease of signal, but anything between 14 and 24 h is usually adequate.For fluorescence readout, dilute culture 1:1 with PBS, mix thoroughly, transfer 200 μL to clear-bottomed plates, and read OD and fluorescence. If the nsAA used is itself fluorescent, such as CouAA, spin down cells and wash them two to three times in PBS before resuspending in PBS for the plate reader experiment. If attempting microscopy, do washes in 1.5 mL tubes, carefully removing as much of the wash as possible in each case, and thoroughly resuspend pellets by pipetting. CouAA’s broad fluorescence spectrum grants very high background unless it is sufficiently washed out.For nanoLuciferase readout, add 100 μL culture to a plate, take ODs, then add 100 μL of Nano-Glo luciferase reagent. The Nano-Glo will lyse cells, making OD measurements taken after addition unreliable.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4507/bioprotoc-12-17-4507-g003.jpgFigure 3. nsAA incorporation data. (A) Endpoint data for nsAA incorporation, using different nsAAs for different AARSs: BipA for bipARS, pAzF for napARS, CouAA for CouRS, BpA for bpaRS, boc-K for the AbkRS. Data processed as discussed in Data Analysis. Biological triplicates were averaged; error bars represent the standard deviation. (B) Time courses for nsAA incorporation; shaded area is standard deviation among biological triplicates.",
    "Variant for incorporation with ammoniaS750 (slower growth, less reliable, more accessible import) When trying to do incorporation of nsAAs that do not import well into the cell (likely due to being large and hydrophobic), import may be improved by using media lacking competing amino acids, such as S750 where ammonia is the sole nitrogen source (see recipes for ammoniaS750).Bacillus will grow in this media and incorporation will occur, but significantly more slowly. Replace both the seed culture and experimental media with ammoniaS750, and allocate roughly 50% more growth time, especially for the seed culture, which may take 6–8 h to reach a high enough OD for seeding (minimum OD is approximately 0.2).Variant for incorporation with LB (less reliable, higher background, hindered cellular import) Replace S750 LB starter culture and experimental cultures with LB.Spin down cells and resuspend with PBS prior to measuring fluorescence. Cells do not need to be spun down for luminescence."
  ],
  "subjectAreas": [
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}