{
  "id": 6865,
  "origin_website": "Bio",
  "title": "Primed Track: Reliable Volumetric Single-cell Tracking and Lineage Tracing of Living Specimen with Dual-labeling Approaches",
  "procedures": [
    "Confined primed conversion of single nuclei in mouse pre-implantation embryosPrepare KSOM medium according to the manufacturer’s instructions one day in advance and let it equilibrate overnight in a CO2 incubator at 37 °C.Prepare glass bottom imaging dishes with ~2 μl drops of KSOM covered with mineral oil and leave it in a CO2 incubator until use.Prepare a sample holder for the LS1 light-sheet microscope with ~10-15 μl KSOM covered with ~300 μl mineral oil and leave it in a CO2 incubator until use.Culture embryos labeled with photoconvertible proteins (by micro-injection of mRNA into zygotes or 2-cell stage embryos as described previously (Plachta et al., 2011), or transgenic lines) ex vivo in a 15-25 μl drop of KSOM covered with mineral oil in a culture dish at 37 °C and 5% CO2 up to desired developmental stage in which you want to convert single nuclei.Set up the microscope for primed conversion as described in detail in Mohr et al. (2016). Since the laser power may decay along the light path, the effective laser power for the 488 nm and 730 nm laser at the focal plane needs to be measured using a power meter device prior to starting the conversion experiments.Transfer the embryos to a drop of KSOM covered with mineral oil in the already prepared (Step A2) glass-bottom culture dish and place the dish in the microscope.Make a z-stack of both the green and red channels prior to photoconversion.Insert the primed conversion filter cube into the light path and convert the region of choice (here the H2B-labeled nucleus) by zooming into that particular region: use simultaneous 488 nm light (30-50 μW) and 730 nm light (5-10 mW), ~20 s conversion time and maximum scan speed (pixel dwell time = 0.79 μs).",
    "Note: Depending on the intensity of the fluorescent labeling, the laser power used for primed conversion and conversion time need to be optimized. See note at the end of this manuscript for more details. Remove the primed conversion filter cube from the light path and check the efficiency of conversion in live mode. The efficiency of conversion can be calculated by measuring fluorescence intensities in both the red and green channel before and after photoconversion followed by calculating the change in intensities for each channel. Test which photoconversion settings give the highest fold change in both the red and green channel for your samples. Repeat primed conversion if necessary (see Figure 1).Make a post-conversion z-stack of the whole embryo of both the green and red channels.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200602/20200602030712_3651.jpgFigure 1. H2B-pr-mEosFP labeled embryos before and after primed conversion with different conversion settings per nucleus. A. 2-cell stage embryo before photoconversion. B. The same embryo after conversion with different powers used for the 730 nm laser: 5 mW for lower nucleus, 10 mW for upper nucleus. The conversion time was 20 s for both nuclei. Scale bar = 100 μm.Live volumetric imaging of mouse pre-implantation embryosRight after performing confined primed conversion on single nuclei of mouse embryos, transfer 10-15 embryos to a pre-equilibrated sample holder for the LS1 light-sheet microscope system (Step A3).Place the sample holder in the LS1 inverted SPIM setup in an incubator chamber at 37 °C and 5% CO2.Acquire a z-stack consisting of 80 planes, 3 μm apart, for each embryo at regular time intervals (10-15 min) in both the green and red channels. Embryos can be imaged up to the blastocyst stage.Note: Imaging frequency can be extended to 30-40 min without this dramatically influencing tracking and lineage tracing fidelities."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}