{
  "id": 3406,
  "origin_website": "Cell",
  "title": "Protocol for generation and assessment of head-like structure in zebrafish",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nGeneration of zebrafish explant with Nodal injection\nTiming: 1 day\nThis section describes the generation of Nodal explants. Completion of this step will achieve Nodal explants, which can develop into head-like structure (troubleshooting 1[href=https://www.wicell.org#troubleshooting]).\nDechorionate zebrafish embryos by pronase.\nNote: Pronase powder is dissolved in 0.3× Danieau at concentration of 10 mg/mL. The duration time of treatment is about 1–2 min.\nPut the dechorionated zebrafish embryos on an agarose-coated plate (2% agarose) with 0.3× Danieau buffer.\nInject ndr2 mRNA (10 pg) mixed with dextran-fluorescein or dextran-rhodamine B into one zebrafish animal pole blastomere at the 128-cell stage (Figures 1[href=https://www.wicell.org#fig1]A and 1B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2986-Fig1.jpg\nFigure 1. Representative images showing manipulations for generating head-like structure (Nodal explants)\n(A) Bright field image showing how to inject mRNA mixed with fluorescein dextran into one animal pole blastomere of zebrafish embryos at 128-cell stage. The embryos were aligned with corrected orientation in the groove made in the agarose.\n(B) Image showing the injection needle which was filled with ndr2 mRNA mixed with fluorescein dextran.\n(C) Bright field image showing how to cut off the zebrafish animal pole explants.\n(D and E) Bright field image showing the Nodal explants at 4 hpf (D) and 10 hpf (E). Scale bar: 500 μm (A, C, D and E), 200 μm (B).\nNote: The ndr2 injected explants are defined as Nodal explants and the un-injected control explants are defined as wild-type explants hereafter. When we identify Nodal downstream genes in the following section (bulk RNA-seq analysis), the Nodal explants with different dosage of Nodal injection (such as: 2 pg, 6 pg Nodal mRNA) or different Nodal duration (different developmental stages, such as: 4 hpf, 5 hpf and 6 hpf) are used.",
    "Critical: Needles should be generated by needle puller with appropriate parameters to get extra long tapers as previous study reported.15[href=https://www.wicell.org#bib15]\nCut off the animal pole region (1/3–1/2) of the embryo using a syringe needle at 1k-cell stage (Figure 1[href=https://www.wicell.org#fig1]C and Methods video S1[href=https://www.wicell.org#mmc1]).\nCulture the animal pole explants in an agarose-coated plate (2% agarose) with zebrafish cell culture medium at 29°C until harvest (Figures 1[href=https://www.wicell.org#fig1]D and 1E).\nNote: At most 30 explants are cultivated in each culture dish. If the samples are used to perform single-cell RNA-seq, these explants are dissociated into single cells immediately. Otherwise, these explants are fixed by 4%(w/v) paraformaldehyde (PFA)/PSB (The PBS solution is prepared using RNA-free water) at 4°C for 12 h–16 h for WISH or HCR. After fixing the embryos or explants in 4% PFA for 12 h–16 h, discard the liquid and rinse once with 100% methanol. Then add 1 mL of 100% methanol and store the samples at -20°C for dehydration.\n    Your browser does not support HTML5 video.\n  \n      Methods video S1. Generation of zebrafish animal pole explants at 1k-cell stage\n    \nRelated to Figure 1.\nCell dissociation and single-cell RNA sequencing\nTiming: 2–3 days\nThis section describes the steps of performing single-cell RNA sequencing of explants. Completion of this step will achieve single-cell sequencing raw data of explants.\nPrepare the cell washing solution and cell resuspended solution.\ntable:files/protocols_protocol_2986_24.csv\ntable:files/protocols_protocol_2986_25.csv\nDissociate the explants into single cells by dissociation reagent (TrypLE Select).\nNote: The explants can be dissociated into single cells by pipetting up and down several times through a P200 tip.\nCentrifuge the dissociated cells at 200 g, 4°C, for 5 min.\nRemove the supernatant, and then resuspend the cells by cell washing solution.\nCentrifuge the dissociated cells at 200 g, 4°C, for 5 min.",
    "Remove the supernatant, and resuspend the cells by cell resuspended solution.\nCount the cell number and assess the cell viability by Trypan blue staining and Propidium iodide (PI) staining.\nConstruct the cDNA libraries using the Chromium Controller and Chromium Single Cell 3′ Library & Gel Bead Kit[href=https://cdn.10xgenomics.com/image/upload/v1660261285/support-documents/CG000204_ChromiumNextGEMSingleCell3_v3.1_Rev_D.pdf] per the manufacturer’s protocol.\nThe libraries can be sequenced by Illumina NovaSeq with paired-end at 150 bp read length.\nNote: When the explants are transferred into 1.5 mL microcentrifuge tube, the tube should be pre-coated with 10% BSA/PBS for 15 mins at 20°C–25°C.\nBulk RNA sequencing analysis\nTiming: 1 day\nThis section details the steps of bulk RNA-seq analysis. Completion of this steps will identify the downstream targets of Nodal (or other molecular signals).\nPre-process bulk RNA-seq data.\nAlign reads from Fastq files to the reference (Danio rerio reference transcriptome Ensembl Release 92) using the STAR function.\nSort aligned reads using the samtools sort function.\nAssign aligned reads to each gene using the featureCounts function, generating gene counts of each sample.\nPre-process data and construct DESeqDataSet object for differential expression (DE) analysis.\nRead in gene count files of each sample using the read.table function.\nMerge gene counts of each sample using the multimerge function, returning a count matrix.\nConstruct a metadata with a sample name column and a condition column merging time and sample treatment.\nConstruct DESeqDataSet object using the DESeqDataSetFromMatrix function with the count matrix and the metadata as inputs and the condition column as design.\nPerform DE analysis for the identification of downstream targets (troubleshooting 3[href=https://www.wicell.org#troubleshooting]).\nPerform DE analysis on DESeqDataSet object using the results function, setting the groups for comparison as contrast.",
    "Both Nodal explants and Cycloheximide (CHX)-treated Nodal explants are compared to wild-type explants at each time point respectively, and appropriate thresholds of p-value and absolute log2FC are used to identified DE genes. Here a p-value <0.05 and absolute log2FC ≥ 1 are used.\nNote: CHX is a protein-translation-blocking inhibitor, which is used to reduce the effects of cascading reactions caused by Nodal for the identification of Nodal immediate-early genes. CHX-treated Nodal explants are generated using CHX-treated embryos with Nodal injection, which are obtained by treating the embryos with 50 μg/mL CHX after 20 mins of Nodal injection.\nNote: Here we are focusing on Nodal targets. Other manipulations can be applied instead for investigating the downstream targets of other molecular signals.\nSelect overlapped DE genes in Nodal explants and CHX-treated Nodal explants at each time point, generating three overlapped DE gene sets.\nDefine common genes in three overlapped DE gene sets as Nodal targets. Here 105 Nodal targets are identified.\nCluster downstream targets and perform functional analysis.\nScale the expression of downstream targets (105 Nodal targets) using the scale function.\nCluster downstream targets into four clusters using the kmeans function.\nNote: Here different cluster numbers can be tested for achieving an optimal clustering performance.\nPerform a heatmap showing scaled expression of Nodal targets within 4 k-means clusters using the Heatmap function with sample treatment annotated on the top and time annotated on the bottom.\nPerform Gene ontology (GO) enrichment analysis on each gene cluster using the enrichGO function.\nVisualize correlations between downstream target clusters and treatment concentration/duration time.\nCalculate mean of scaled gene expression in each cluster using the mean function.\nUse Pearson method to calculate correlation coefficients between scaled expression mean of each cluster and treatment concentration/duration time using the cor.test function with p-values calculated by Student’s t test.",
    "Perform a heatmap using the pheatmap::pheatmap function with color indicating correlation coefficients and p-values displayed in each box.\nSingle-cell RNA sequencing analysis\nTiming: 1 day\nThis section provides the steps of single-cell RNA sequencing analysis. Completion of this section will identify the cell types existing in the explants.\nAlign sequencing reads in FASTQ files to the reference (Danio rerio reference transcriptome Ensembl Release 92) using cellranger count function, generating the output used for Seurat.\nCreate Seurat objects and pre-process scRNA-seq data.\nRead in the output of the cellranger pipeline using the Read10x function, returning a unique molecular identified count matrix.\nUse the count matrix to create a Seurat object using the CreateSeuratObject function.\nCheck the level of unique feature counts, total molecule counts and mitochondrial counts.\nFilter out low-quality cells using the FilterCells function. Here we filter out cells with unique feature counts less than 200 or over 5000 as well as >5% mitochondrial genes.\nNormalize data using the NormalizeData function with the default settings (“LogNormalize” method with a scale factor as 10,000).\nIdentify highly variable features using the FindVariableFeatures function.\nScale the data using the ScaleData Function with regression of nUMI and mitochondrial genes.\nCluster cells and annotate clusters (troubleshooting 4[href=https://www.wicell.org#troubleshooting]).\nPerform PCA on scaled data using the RunPCA function with the identified variable features as input.\nDetermine the optimal component numbers (dimensionality) for data representation using the JackStraw function.\nConstruct a KNN graph using the FindNeighbors function with the defined dimensionality as input.\nCluster cells using the FindClusters function with a resolution ranging from 0.5 to 2.\nRun non-linear dimensional reduction using the RunUMAP function with the defined dimensionality.\nVisualize the dataset using the DimPlot function with UMAP as reduction.\nIdentify top marker genes of each cluster using the FindMarkers function.",
    "Annotate each cluster based on the expression of cellular markers (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2986-Fig2.jpg\nFigure 2. Single-cell RNA-seq analysis of Nodal explant at 10 hpf\n(A) Heatmap showing the expression levels of top 5 markers in each cluster of Nodal explant at 10 hpf.\n(B) UMAP plot showing identified cell types of Nodal explant at 10 hpf. Cells are colored according to their cell-type annotations. Cell type annotations and their corresponding colors are shown on the right.\nWISH (Whole-mount in situ hybridization)\nTiming: 3 days\nThis section describes the steps of WISH. Completion of this step will enable the assessment of gene expression patterns on explants. The process of this section mainly follows the published protocol[href=https://link.springer.com/protocol/10.1007/978-1-4939-1459-3_5].16[href=https://www.wicell.org#bib16] As the assessment of expression patterns is important, we provide the detailed steps below (troubleshooting 2[href=https://www.wicell.org#troubleshooting]).\nThe explants or embryos which are older than 24 h post-fertilization (hpf) should be decolorized by H2O2.\nDecolorization solution preparation: prepare the decolorization solution by mixing 30% H2O2 solution and 5% KOH solution at a volume ratio of 1:9.\nRemove the fixative and place the explants or embryos that need to be decolorized in a 35 mm plastic culture dish.\nAdd 2–3 mL of the decolorization solution\nObserve under a microscope until the pigment on the embryos' eyes (or explants' pigments in epidermis) disappears.\nRemove the decolorization solution and perform gradient dehydration through washing with 25%, 50%, 75% and 100% methanol/PBS for 5 min each at 20°C–25°C.\nStore the decolorized embryos or explants in 100% methanol and keep them at -20°C for later use.\nProbe hybridization (Day 1)\nExplants or embryos rehydration. (Gradient wash through 75%, 50% and 25% methanol/PBST for 5 min each at 20°C–25°C and then three times for 5 min in PBST.)\nDigestion and permeabilization by proteinase K.",
    "Add Proteinase K (20 mg/mL) to PBST to prepare a digestion solution with a final concentration of 10 μg/mL.\nTreat the explants or embryos with digestion solution at 20°C–25°C. The digestion time for explants or embryos at different stages is shown in the following table:\ntable:files/protocols_protocol_2986_26.csv\nRefixation.\nRemove the digestion solution and add 1 mL of 4% PFA for refixation. Leave it at 20°C–25°C for 20 min.\nWash four times with PBST at 20°C–25°C, 5 min each time.\nNote: This step is only required after proteinase K treatment.\nPrehybridization.\nPrepare the HM solution in advance and preheat it in the hybridization oven at 70°C for 30 min.\nPipette 300 μL of the preheated HM solution into the EP tube containing the explants or embryos from the above steps for pre-hybridization.\nIncubate it at 70°C for 3–5 h.\nCritical: HM solution contains formamide, which is toxic, corrosive and potentially carcinogenic, and thus should be handled safely with protective clothing and gloves.\nHybridization.\nUse a vacuum pump to extract the solution from the EP tube.\nAdd 300 μL of HM solution containing 2 ng/μL probe to the tube.\nHybridize for 12 h–16 h in a hybridization oven at 70°C.\nCritical: The HM solution containing the probe also needs to be preheated at 70°C in the hybridization oven for 30 min in this step. If performing single-color in situ hybridization, only probes labeled with DIG need to be added. However, if performing double-color in situ hybridization, probes labeled with both DIG and fluorescent need to be added, and the EP tube should be wrapped with foil to avoid light exposure.\nAntibody incubation (Day 2)\nRecycle the hybridization solution containing the probe and store it in a -20°C freezer.\nNote: Generally, the probes can be reused 5–6 times.",
    "Wash up the residual hybridization solution containing the probe. Quick wash with HM solution first, and then wash through 75%, 50% and 25% HM/2× SSC for 15–20 min each at 70°C. After that, wash once with 2× SSC 70°C for 15–20 min and twice with 0.2× SSC at 70°C for 30–40 min each.\nCritical: All washing steps are carried out in a hybridization oven, and the above solutions need to be preheated in the hybridization oven at 70°C. The HM solution in washing steps does not contain Heparin and tRNA.\nGradual transition to PBST buffer. Wash through 75%, 50% and 25% 0.2xSSC/PBST for 15–20 min each at 20°C–25°C and then once in PBST for 15–20 min at 20°C–25°C.\nBlock and incubate with antibody.\nRemove PBST, add 1 mL of Incubation Mix, and incubate at 20°C–25°C on a low-speed shaker for 3–5 h.\nRemove the Incubation Mix, and add 1 mL of Incubation Mix containing 0.1 μL/mL DIG AP (anti-DIG antibody).\nIncubate for 12 h–16 h at 4°C on a low-speed shaker.\nWashing and labeling (Day 3)\nAntibody removal and washing.\nTransfer the explants or embryos that have been incubated for 12 h–16 h to experimental bench at 20°C–25°C.\nRemove the antibody incubation solution, and quickly wash once with PBST.\nWash with PBST six times at 20°C–25°C, 15 min each time (place on a low-speed shaker).\nRemove the PBST, and add 1 mL of freshly prepared Alkaline Tris (AT) Buffer. Wash with AT Buffer three times on a low-speed shaker at 20°C–25°C, each time for 5 min.\nLabeling.\nTransfer the explants or embryos in the EP tube to the six-well plate. Mark the position of the wells in advance.\nRemove the AT Buffer and add 2 mL of labeling solution to the wells.",
    "Transfer the six-well plate to a dark place to avoid light.\nObserve the labeling under a microscope every 15–30 min to prevent over-labeling.\nCritical: The labeling solution is prepared as needed and stored in the dark.\nTermination of staining.\nRemove the labeling solution, and wash quickly with PBST.\nWash three times with PBST at 20°C–25°C for 5 min each time.\nStorage.\nRemove the PBST.\nAdd glycerol and transfer to a 4°C refrigerator for storage (this step is not performed for double-color in situ hybridization).\nPhotography and data processing. Use a stereomicroscope to photograph and record the results of in situ hybridization from different angles and positions for subsequent analysis (Figures 3[href=https://www.wicell.org#fig3]A and 3B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2986-Fig3.jpg\nFigure 3. Whole Mount In Situ hybridization (WISH) and HCR for the marker genes of prechordal plate (fzd8b and frzb) and notochord (tbxta)\n(A) Cartoon plot showing the pattern of prechordal plate (magenta) and notochord (green) in Nodal explant at 10 hpf.\n(B) WISH of fzd8b (top) and tbxta (bottom) in Nodal explant at 10 hpf.\n(C) HCR co-staining of frzb (magenta) and tbxta (green) in Nodal explant at 10 hpf. Scale bar: 200 μm (B, top), 500 μm (B,bottom), 50 μm (C).\nThe following experimental steps are required for double-color in situ hybridization (continuing from Step 32 above):\nTreat with 0.1 M glycine-HCl (pH 2.2, 0.1% Tween 20) at 20°C–25°C for 10 min.\nWash with PBST at 20°C–25°C four times, 5 min each time.\nRemove the PBST, add Incubation Mix and transfer to a low-speed shaker at 20°C–25°C for 5 h.\nBlock and incubate with antibody.\nAdd fluorescein-labeled antibody at a ratio of 1:2000 in the Incubation Mix.\nRemove the Incubation Mix, and add the Incubation Mix containing the antibody.\nTransfer to a low-speed shaker in a 4°C refrigerator for 12 h–16 h.",
    "Antibody removal and washing.\nRemove the incubation solution.\nWash quickly with PBST at 20°C–25°C once.\nWash six times with PBST at 20°C–25°C, 15 min each time (on a low-speed shaker).\nRemove the PBST, add 1 mL of pH 8.2, 1 M Tris-HCl, and wash three times on a low-speed shaker at 20°C–25°C for 5 min each time.\nLabeling: Remove Tris-HCl and add labeling solution. Labeling should be carried out in the dark. The labeling solution (10 mL):\ntable:files/protocols_protocol_2986_27.csv\nTermination of staining: After specific regions are stained, remove the staining solution, wash once with PBST, and then wash three times with PBST at 20°C–25°C, 5 min each time (on a low-speed shaker).\nRemove PBST and add glycerol. Store in a refrigerator at 4°C for later use.\nPhotography and data processing: Use a stereomicroscope to photograph and analyze the results of in situ hybridization.\nHCR probe sets and amplifiers design and generation\nTiming: 3 days\nThis section describes the steps of HCR. Completion of this will enable assessment of multiple gene expression patterns on one explant. As genes are assigned with different fluorescence, the signals of different genes will not be mixed up. And the fluorescent signals can be quantified, reflecting the gene expression patterns better (troubleshooting 5[href=https://www.wicell.org#troubleshooting]).\nIdentify the marker genes that are specifically expressed in each cell cluster by analyzing the single cell sequencing data. Find the NCBI Accession numbers of each gene for HCR probe set design.\nNote: Sometimes we may find one gene that is not only expressed in a specific cell cluster but also in any other cell clusters. For this circumstance, we can use 2 or more genes to distinguish this cell cluster.",
    "All the HCR probes and HCR Amplifiers are purchased from Molecular Instruments, Inc. (https://www.molecularinstruments.com/[href=https://www.molecularinstruments.com/]), and the probe set and amplifier information is listed below.\nNote: The B isoform is a specific and unique sequence designed in HCR probes, which will initiate corresponding amplifier polymerization. Here we provide the NCBI Accession number and the required B isoform to the company, and they will design a set of HCR probes accordingly. When performing double HCR experiment, make sure different B isoforms are selected for two HCR probe sets to ensure achieving different fluorescence.\ntable:files/protocols_protocol_2986_28.csv\nNote: Here we choose tbxta and frzb as examples. We always choose 20 for the probe set size, which means a probe set consists of 20 probe pairs. For most circumstances, it is enough to gain strong fluorescent signals. The production of all the reagents usually takes 1–2 weeks.\nSample preparation\nWe use explants for HCR RNA-FISH experiments. The preparation of explants is described in the first section.\nNote: Because the explant is too small to discern with naked eye, you can take advantage of a stereo microscope when exchanging solutions. And it is better to incubate without agitation.\nCollect 30–40 explants at the time points required into 2 mL microcentrifuge tube. Discard the extra culture media as much as possible.\nExplant fixation. Add 1 mL 4% PFA to the tube and store at 4°C for at least 16 h but no more than 24 h.\nExplant dehydration and permeabilization.\nWash explants with 1 mL 1× PBST 3 times for 10 min per wash.\nWash explants with 1 mL 100% methanol 2 times for 10 min per wash.\nStore explants at -20 °C at least 2 h before use.\nRehydration the explant with a series of MeOH/PBST for 10 min per wash.\n75% MeOH/ 25% 1× PBST",
    "50% MeOH/ 50% 1× PBST\n25% MeOH/ 75% 1× PBST\n3 times in 100% 1× PBST, 10 min per wash\nPermeabilization by Proteinase K treatment.\nIncubate with 10 μg/mL Proteinase K at 20°C–25°C for 1 min.\nFix explants with 4% PFA for 10 min.\nWash explants with 1× PBST 4 times for 10 min per wash.\nNote: Proteinase K treatment can dramatically increase the HCR fluorescent signal for explants.\nHCR hybridization\nIn this step, the HCR probe will hybridize with its target mRNA in explants. All the incubation at 37°C in this section is carried out by water bath.\nPre-hybridize the explants.\nPre-warm the probe hybridization buffer to 37°C.\nTransfer 30–40 explants to a 1.5 mL centrifuge tube.\nRinse explants with 100 μL probe hybridization buffer.\nDiscard the excess probe hybridization buffer, add 100 μL probe hybridization buffer, and incubate for 30 min.\nNote: The probe hybridization buffer is provided by the manufacturer who makes the HCR probe.\nProbe hybridization in explants.\nPrepare probe hybridization buffer by adding 0.4 μL probe stock (1 μM) to 100 μL probe hybridization buffer (2 pmol for final concentration).\nPre-warm the probe hybridization buffer to 37°C.\nIncubate the explants with 100 μL probe hybridization buffer at 37°C for 12 h–16 h.\nHCR signal amplification\nIn this step, the fluorescent signals are gained by amplifiers undergoing hybridization chain reaction with HCR probes.\nStop the hybridization by repeated washing.\nCarefully remove the hybridization buffer.\nRemove excess probe by washing 4 times for 20 min per wash with 100 μL pre-warmed probe buffer.\nNote: Keep at 37°C during washing.\nPre-amplify the samples with 200 μL probe amplification buffer at 20°C–25°C for 30 min.\nPrepare the hairpin solution.\nTransfer 2 μL hairpin h1 and 2 μL hairpin h2 to separate centrifuge tubes.",
    "Snap cool the hairpins by heat at 95°C for 90 s and cool for 30 min at 20°C–25°C in the dark\nAdd the snap cooled hairpins to 100 μL amplification buffer.\nIncubate the explants with 100 μL hairpin solution at 20°C–25°C in the dark until appropriate strength of fluorescent signals is gained.\nNote: Incubate with hairpin solution at least 1 h but no more than 16 h.\nStop amplification by using 5× SSC 0.001% tween-20 to wash several times at 20°C–25°C.\nCritical: This process should be performed as fast as possible to minimize light exposure.\nHCR samples are stored at 4°C and protected from light. The fluorescent signals will not reduce significantly after as long as 2-month storage.\nFinished HCR samples are photographed by confocal at specific channels (Figures 3[href=https://www.wicell.org#fig3]A and 3C).\nSecondary axis induction\nTiming: 4 day\nThis section describes the induction of secondary axis by Nodal downstream targets. Completion of this step will assess the Nodal targets on their capability of inducing secondary axis.\nIn vitro synthesis of specific mRNA downstream of Nodal which were identified by bulk RNA-seq.\nInject the mRNA into one random blastomere at the margin of the 32-cell stage zebrafish embryos.\nCritical: About 4 pL of the mixture composing the mRNA and fluorescent dye was injected. The appropriate dose of injected mRNA needs to be determined by injecting different dosage of the mRNA and checking the morphology of the secondary axis.\nNote: The mRNA in vitro synthesis and injection take one day, and the following WISH takes 3 days.\nSelect the embryos with fluorescent signal in ventral side at shield stage using a fluorescence stereoscopic microscope, and transfer them to a new culture plate.",
    "Photograph the selected embryos, and then fix them for 12 h–16 h by 4% PFA at 12 hpf or 24 hpf (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2986-Fig4.jpg\nFigure 4. Representative images of ventral injection of ndr2 mRNA in zebrafish embryos\nMerged image showing a zebrafish embryo with ventral injection of ndr2 mRNA at 6 hpf (Left). Black arrow indicates the shield region of the embryo, and the dotted line indicates the ventral region with fluorescence labeling. Merged image showing a zebrafish embryo with a secondary axis at 12 hpf (Middle). Black arrow indicates the first axis (Primary axis) of the embryo, and the dotted line indicates the secondary axis with fluorescence labeling. Merged image showing a zebrafish embryo with a secondary axis at 24 hpf (Right). Scale bar: 200 μm (Left), 500 μm (Middle and Right).\nPerform WISH of six3b, egr2b, shha, pax2a and cdx4 for the fixed embryos.\nNote: The WISH images of these genes are available in our published article.1[href=https://www.wicell.org#bib1]\nPhotograph the embryos, and analyze the WISH results."
  ],
  "subjectAreas": [
    "Rnaseq",
    "Microscopy",
    "Stem Cells",
    "Developmental Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}