{
  "id": 18223,
  "origin_website": "Jove",
  "title": "Technique of Minimally Invasive Transverse Aortic Constriction in Mice for Induction of Left Ventricular Hypertrophy",
  "procedures": [
    "Male C57BL/6J mice (10 weeks, 25 - 30g, n=60) are used in this protocol. Animals receive humane care in compliance with the guidelines formulated by the French Ministry of Agriculture and of Higher Education and Research, and all procedures are performed in accordance with the European Community Council Directive of November 24, 1986 (86/609/EEC) and the French laws. The protocol was approved by the \"Regional Ethics Committee for Animal Experimentation CREMEAS\" (#2016092816207606).\n1. Preparation for surgery\nMaintain the mice for one week after arrival in the animal facility on a 12h/12h light/dark cycle, in standard cages, with food (for details see the Table of Materials) and water available ad libitum.\nOn the day of operation, place the mice in individual cages a few minutes prior to induction of anesthesia, in order to avoid any additional stress to the animal. Sterilize all surgical instruments the day before surgery.\nInject intra-peritoneally a single dose of a mixture of ketamine (51.4 mg/kg) and xylazine (3.3 mg/kg) diluted in saline solution (0.9% NaCl).\nMake sure of the depth of the anesthesia by the absence of the toe-retreat reflex.\nShave the neck and chest of the animal with a commercially available razor and disinfect the shaved area with 70% alcohol.\nPlace the animal supine on a clean cork working pad and fix the paws with adhesive tape.\n2. Surgery\nSterile surgical technique is used throughout the procedures. In a spontaneously breathing animal, perform a longitudinal midline cervical incision over 10 mm with an 11-blade knife from supra-sternal notch to the mid-chest in order to expose the sternum (Figure 1).\nRetract the thyroid by passing a 4/0 monofilament polypropylene stay suture with a Crile-Wood needle holder and tape it to the working pad.\nSeparate bluntly the pre-tracheal muscles with micro-surgical forceps to uncover the trachea.",
    "Slide gently the smooth-tipped curved micro-surgical forceps with the closed jaws over the trachea and behind the sternum.\nBy carefully opening and closing the jaws of the smooth-tipped curved microsurgical forceps carry out a blunt dissection under the pre-tracheal muscles and behind the sternum to move the pleura away.\nGrasp the right supra-clavicular muscles with the smooth-tipped straight micro-surgical forceps and pull up gently the chest of the animal.\nSlide the inferior jaw of the bone nipper under the sternum and perform a 3-4 mm upper partial sternotomy (Figure 2). Direct the lower part of the mini-sternotomy slightly toward the left.\nPass a 7/0 monofilament polypropylene stay suture from inside to outside through the second intercostal space on each side of the mini-sternotomy using a micro-surgical needle holder. Stay close to costo-sternal angle to avoid injury to intercostal and internal thoracic vessels or pleura.\nSpread the sternal edges using 7/0 monofilament polypropylene stay sutures on each side and fix them to the working pad with adhesive tape.\nGently move aside the pre-tracheal muscles, mediastinal fat and thymus using smooth-tipped curved microsurgical forceps to visualize the aortic arch under low-power magnification (2 - 3X) (Figure 3). Take particular care not to touch or damage the parietal pleura to prevent pneumothorax development.\nExpose the soft tissue under the aortic arch by tying forceps (Figure 4A) and spread gently its jaws. Prepare a tunnel in the soft tissue under the aortic arch with second tying forceps by gently opening and closing the jaws in the soft tissue.",
    "Pass a segment of 6/0 silk ligature threaded through the eye of a ligation aid (Figure 4B) held in the left hand under the aortic arch and retrieve it by tying forceps held in the right hand between the origin of the right innominate and left common carotid arteries (Figure 5).\nCut a 27-gauge needle to a length of 5 mm and blunt both ends by pressing them with a Crile needle holder. Place the blunted 27-gauge needle next to the aortic arch (Figure 6) with smooth-tipped straight micro-surgical forceps and tie the suture snugly around the needle and the aorta between the right innominate and left common carotid arteries using the two tying forceps (Figure 7). To tie snugly the suture, perform an initial double knot followed by four additional knots. Make sure that all knots are flat.\nAfter ligation, remove quickly but gently the needle to achieve a 0.4 mm diameter narrowing and a reproducible transverse 65-70% aortic constriction.\nCheck for hemostasis of the soft tissue around the aortic arch, of the sternal edges and pre-tracheal muscles. Put resorbable hemostatic gauze wherever oozing of blood is observed.Remove the 7/0 monofilament polypropylene stay sutures used for spreading the sternal edges.\nPass a simple 6/0 monofilament polypropylene suture with a micro-surgical needle holder from outside to inside of the left second intercostal space and then from inside to outside of the right second intercostal space. Stay close to costo-sternal angle to avoid injury to intercostal and internal thoracic vessels or pleura.\nBring together the sternal edges by tying 6/0 monofilament polypropylene suture with a Crile-Wood needle holder.\nClose the skin with a 5/0 monofilament polypropylene running suture in one layer with a Crile-Wood needle holder.",
    "Perform the sham procedure identical to the constriction operation but without tying a suture around the aorta.\n3. Post-operative recovery\nMonitor the animals very closely. Transfer the mouse to an individual cage and place it in a prone position.\nAllow the mouse to recover under a warming light until fully awake (less than 1 h after inducing anesthesia).\nFor post-operative analgesia, inject 0.1 mg/kg of buprenorphine intraperitoneally. Repeat subcutaneous injections of 0.1 mg/kg of buprenorphine every 8 h for the first three days as indicated.\nPlace the operated mice in standard cages (maximum 3 mice per cage and minimum 2 mice per cage).\n4. Heart harvest\nOn the day of analysis, euthanize the mouse with a solution of ketamine 300 mg/kg and xylazine 20 mg/kg in saline by intraperitoneal injection.\nFirst harvest the blood from the inferior vena cava and then through the same line inject 5 mL of solution of 2.6 mM EDTA in saline.\nHarvest the heart, remove the atria and weight the heart (left and right ventricles without atria).\nSeparate the left from the right ventricle with the septum remaining to the left ventricle part. Weigh both tissue samples and freeze them in liquid nitrogen.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}