{
  "id": 19465,
  "origin_website": "Jove",
  "title": "How to Quantify the Fraction of Photoactivated Fluorescent Proteins in Bulk and in Live Cells",
  "procedures": [
    "1. Plasmid Construction\nGenerate two-color fusion probes. Use a mammalian cell expression vector (see Table of Materials) in which mCherry112 and PA-mCherry113 have been inserted with the restriction sites AgeI and BsrGI.\nOrder custom oligo-nucleotides to amplify the monomeric variants of eGFP and PA-eGFP containing the A206K mutation, i.e., mEGFP and PA-mEGFP14 without a stop codon as a SalI-BamHI fragment. Use the N-terminal primer 5’-AAT TAA CAG TCG ACG ATG GTG AGC AAG GGC GAG G 3’ and the C-terminal primer 5’-AAT ATA TGG ATC CCG CTT GTA CAG CTC GTC CAT GC 3’ and insert this SalI-BamHI fragment into the multiple cloning site of the expression vector. This will create the five amino acid linker RNPPV between the green and red fluorescent protein. We will refer to the fluorophore chimeras as GFP—Cherry, PA-GFP—Cherry, and GFP—PA-Cherry for the remainder of this article.\n\tNote: The coupling of fluorophores and creation of internal rulers to assess photoactivation efficiency can be done with any spectrally distinct fluorophore pair, e.g. superfolder PA-GFP 15/ PA-TagRFP 16, etc. Many of the photoactivatable fluorescent proteins are derived from GFP. Hence, the primer sequence provided above can be used for many fluorescent proteins to construct a fluorophore chimera in a mammalian cell expression vector.\n2. Cell Culture and Transfection\nUse either any standard cell line such as HeLa, NRK, Cos-7 or a specific cell line to be used for specific photoactivation experiments. Use DMEM (supplemented with 10% fetal bovine serum, and 2 mM glutamine) and trypsin without phenol red (see Table of Materials) to reduce background fluorescence.",
    "Detach the cells of a confluent culture with trypsin, count the number of cells in cell suspension using a Neubauer chamber, and seed 5,000 – 10,000 cells per well. Alternatively, use 1 drop from a 2-mL pipette of a 10-mL cell suspension from a confluent cell culture grown in a T 25-cell culture flask or 3 drops from a 5-mL cell suspension from a confluent culture grown in a T 12.5-cell culture flask.\nGrow cells in 8-well chambers with #1.0 cover glass (see Table of Materials) for fluorescence live-cell microscopy.\nTransfect cells 24 h after plating using commercial reagents (see Table of Materials) per distributer’s protocol with the GFP—Cherry, PA-GFP—Cherry, and GFP—PA-Cherry chimeras.\nImage cells after a total of 20 h post transfection to allow for protein expression, folding and maturation.\n3. Imaging and Photoactivation\nImage cells in a humidified and heated environmental chamber at 37 degrees Celsius. To buffer the cell media at physiological pH and render it CO2-independent, add 20 mM HEPES, or use CO2 gas set to 5% flow.\nFirst, image cells expressing the GFP—Cherry construct. Set parameters that define time-integrated laser intensity per pixel in a confocal image, i.e., pixel dwell time in microseconds, acousto-optical tunable filter (AOTF) transmission in percent, and digital zoom.\n\tNote: Using a 60x objective and a digital zoom of 3x allows imaging of a cell in its entirety while providing sufficient magnification. Set pixel dwell time to 2-4 μs and AOTF transmission for the 488-nm and 561-nm laser such that images show a good signal-to-noise ratio without any bleaching and no pixels indicating fluorescence intensity saturation.\nImage, using the set laser power, AOTF transmission, pixel dwell time and digital zoom, 15-20 cells expressing GFP—Cherry.",
    "Then, image with the same set laser power, pixel dwell time, AOTF transmission and digital zoom cells expressing GFP—PA-Cherry and PA-GFP—Cherry. Search for expressing cells in the green channel or red channel, respectively. Avoid long exposure of the cells during the search for expressing cells in order to not bleach the fluorescent proteins.\nSet up a mini-time series with one pre-activation image and three post-activation images. The post-activation images will help identify potential transient dark states due to the exposure to UV-light.\n\tNote: In our hands, changes in detected fluorescence intensity due to transient dark states were <1% and could be neglected, but those dark states should be assessed for every experimental set-up.\nTo determine photoactivation efficiency, i.e., the fraction of PA-FPs that is switched on to be fluorescent, in the specific photoactivation experiments that have already been established, apply the same photoactivation settings to 15-20 cells that are expressing the internal rulers introduced here and proceed with image analysis (section 4). If beginning to set up photoactivation experiments, find here a few different settings based on our experimental experience with PA-GFP and PA-Cherry; modify as needed.\n\t\nFor instantaneous photoactivation of PA-GFP and PA-Cherry using a confocal laser scanning microscope (CLSM), apply 90 μW of 405-nm laser light in 3 or 5 iterations, respectively.\n\t\tNote: With our microscopic set-up, using a 38% AOTM transmission and a 2 μs pixel dwell time, we measured this 405-nm laser power in line-scan mode at the objective lens. With these settings, about 8% and 16% of the PA-GFP and PA-Cherry expressed can be photoactivated to be fluorescent. The entire titration series using CLSM for instantaneous photoactivation has been published previously17.",
    "If a higher fraction of photoactivated PA-GFP and PA-Cherry fluorophores is advantageous e.g. to achieve a higher signal-to-noise ratio, and photoactivation does not have to be immediate, apply 40 μW of 405-nm laser light with a 2 μs pixel dwell time and 6% AOTF transmission for 450 iterations. Then, photoactivation will take up to 4 min as opposed to only 1-2 seconds, but photoactivation efficiency for PA-GFP will be 29% instead of 8%, allowing for a higher signal-to-noise ratio.\nIf a mosaic digital illumination system that contains micro mirror arrays in a spatial light modulator is available, 405-nm laser light can be used for widefield-photoactivation. This allows for efficient photoactivation within milliseconds.\n\tNote: With 1.6 mW laser power as measured at the objective lens and an exposure time of 250 ms, 29% of PA-GFP can be photoactivated to be fluorescent.\nImage with any set photoactivation parameters 15-20 cells expressing PA-GFP—Cherry and GFP—PA-Cherry, respectively.\nSince pH, reactive oxygen species and other environmental factors may influence photoactivation efficiency, it may be important to assess photoactivation efficiencies of the PA-FPs in the respective subcellular micromilieu where the protein of interest is located. By coupling the fluorophore chimeras to the protein of interest, as the authors have done with the plasma membrane protein VSVG 18, photoactivation efficiency can be assessed in the specific subcellular compartment of interest.\n4. Image Analysis and Algorithm for Ratiometric Intensity-based Quantification of Photoactivation Efficiency\nImage analysis can be done with the open source image processing platforms ImageJ or Fiji. Determine the background fluorescence intensity in non-transfected cells in the green (B1) and red (B2) channel. Avoid perinuclear or any areas showing increased auto-fluorescence.",
    "To determine the fluorescence intensity in a transfected cell, outline the cell body with the freehand selections tool. Again, avoid perinuclear or any other areas showing auto-fluorescence.\nSubtract the background from the measured fluorescence intensity in each channel.\n\tIG = IGreen_measured – B1\n\tIR = IRed_measured – B2\nUse the GFP—Cherry construct to calculate the red-to-green ratio (RtoGr) and correct for donor-quenching due to fluorescence resonance energy transfer (FRET). The FRET efficiency E was determined to be 0.3 in previous experiments for the GFP—Cherry construct using the same amino acid linker between the two fluorophores18.\n\tRtoGr = (IRed_measured – B2) / (IGreen_measured – B1)\n\tRtoGrcorr = RtoGr * (1 – E)\n\tNote: In this intensity- based approach, donor quenching for mEGFP and PA-mGFP may be different given possible distinct spectral properties which have not been characterized. The rate of FRET (kET) and the Foerster distance (R0) depend upon the quantum yield of the donor which has not been determined for mEGFP and PA-mGFP.\nUse the GFP—PA-Cherry construct to assess the fraction of photoactivated PA-Cherry. Determine the expected fluorescence intensity of PA-Cherry by multiplying the measured unquenched green fluorescence intensity of the GFP—PA-Cherry construct prior to photoactivation with the corrected red-to-green-ratio (RtoGrcorr).\n\tIRed_expected = (IGreen_measured – B1) * RtoGrcorr\n\tNote: As indicated above, the molecular brightness of the always-on FP and the photoactivatable FP may be different. See Discussion for more information on how to account for these differences.\nCalculate the PA-Cherry photoactivation efficiency as a fraction of the measured red fluorescence intensity after photoactivation and the expected fluorescence intensity in the red channel.\n\t(FPA-Cherry) = (IRed_measured – B2) / IRed_expected",
    "Use the PA-GFP—Cherry construct to assess the fraction of photoactivated PA-GFP. Determine the expected fluorescence intensity of PA-GFP by dividing the measured red fluorescence intensity of the PA-GFP—Cherry construct prior to photoactivation by the red-to-green-ratio (RtoGr). Here, the RtoGr does not need to be corrected for donor quenching, because GFP and PA-GFP are subject to donor quenching to the same amount.\n\tIGreen_expected = (IRed_measured – B2) / RtoGr\nCalculate the PA-GFP photoactivation efficiency as a fraction of the measured green fluorescence intensity after photoactivation and the expected fluorescence intensity in the green channel.\n\t(FPA-GFP) = (IGreen_measured – B1) / IGreen_expected\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}