{
  "id": 7241,
  "origin_website": "Bio",
  "title": "Generation of Mouse Pluripotent Stem Cell-derived Trunk-like Structures: An <em>in vitro</em> Model of Post-implantation Embryogenesis",
  "procedures": [
    "Seeding mouse embryonic fibroblasts (MEFs)NOTES: Seed MEFs at least one day prior to seeding the mESCs. Pre-warm MEF medium in the water bath for at least 20 min before starting. MEF plates should be used within one week of seeding. Coat a 6 cm cell culture plate with 3 ml 0.1% gelatin solution.NOTE: Gelatin-coated culture plates have to be prepared fresh on the day of seeding MEFs and cannot be stored. Leave the plate at room temperature for 15 min.Next, thaw a vial of mitotically inactive MEFs at 37°C in the water bath.NOTES: Inactive MEFs are mitotically inactivated in-house using mitomycin C treatment (3 h at 37°C). You need 1.0 × 106 MEFs to coat a 6 cm cell culture plate. Thaw the appropriate number depending on the number of 6 cm cell culture plates needed. Add the MEFs to a 15 ml Falcon tube containing 5 ml pre-warmed MEF medium.Centrifuge the cells at 200 × g for 5 min.While centrifuging, aspirate gelatin from each 6 cm plate and add 2 ml MEF medium.Aspirate the supernatant from the 15 ml tube containing MEFs and resuspend the cell pellet at a concentration of 1.0 × 106 cells per ml.NOTE: Viable MEFs are counted at the time of freezing and there is no need to count them again after thawing. Add 1 ml cell suspension to each prepared 6 cm plate.Place the plate in the incubator and swirl the plate to ensure even distribution of cells.Seeding mouse embryonic stem cells (mESCs)NOTES: Pre-warm mESC medium in the water bath for at least 20 min before starting. We routinely use mESCs with an F1G4 genetic background for TLS protocol generation (George et al., 2007). Thaw a vial of mESCs at 37°C in the water bath immediately before plating.NOTE: You need 3.",
    "5 × 105 mESCs for a 6 cm MEF-coated plate. Thaw the appropriate number depending on the number of 6 cm cell culture plates needed. Add the mESCs to a 15 ml Falcon tube containing 5 ml pre-warmed mESC medium.Centrifuge the cells at 200 × g for 5 min.While centrifuging, aspirate MEF medium from each 6 cm plate containing MEFs and add 2 ml mESC medium.Aspirate the supernatant from the 15 ml tube containing mESCs and resuspend the cell pellet at a concentration of 3.5 × 105 cells per ml.NOTE: Viable mESCs are counted at the time of freezing and there is no need to count them again after thawing. Add 1 ml cell suspension to each MEF-coated 6 cm plate.Place the plate in the incubator and swirl the plate to ensure even distribution of cells.Replace the medium daily with 3 ml fresh mESC medium.Passaging mESCs NOTES: Passage mESCs every 48 h at a splitting ratio of 1:8-1:10. Colony density and morphology should look similar to that shown in Figure 1A. Do not let your culture overgrow (Figure 1B).The splitting time and ratios detailed here are optimized for the mESC lines used in Veenvliet et al. (2020). Based on the proliferation rate of the mESC line used, splitting times and ratios may need to be adjusted. This may be especially true if transgenic lines and/or mESCs with different genetic backgrounds are used. Pre-warm mESC medium and TrypLE in the water bath for at least 20 min before starting. Prepare MEF-coated plates one day prior to passaging mESCs. Instead of TrypLE, 0.05% Trypsin-EDTA can be used. imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4042/bioprotoc-11-11-4042-g001.jpgFigure 1. Optimal embryonic stem cell culture densities for successful TLS generation. A. mESC culture densities suitable for TLS generation (24 h and 48 h after seeding). B.",
    "mESC culture density unsuitable for TLS generation (96 h after seeding). Scale bars for all panels, 50 μm.Aspirate the medium from the mESC plate and wash with 3 ml DPBS.Aspirate the DPBS and add 1 ml TrypLE.Ensure that the plate surface is evenly covered with TrypLE and place it in the incubator at 37°C for 5 min.After 5 min, dislodge the colonies with a P1000 pipet set to 800 μl by pipetting up and down in the plate 20 times.Inactivate the TrypLE by adding 1 ml mESC medium and pipet further to obtain a single cell suspension.Transfer the cell suspension to a 15 ml Falcon tube and wash the plate with an additional 3 ml mESC medium to recover all cells. Transfer these cells to the same 15 ml tube.Centrifuge the cells at 200 × g for 5 min.While centrifuging, aspirate the MEF medium from the previously prepared 6 cm plate containing MEFs and add 2 ml mESC medium.Aspirate the supernatant from the 15 ml tube containing mESCs and resuspend the cell pellet in 2 ml mESCs medium.Add the appropriate amount of cell suspension to each MEF-coated 6 cm plate (ratio 1:8-1:10 → 200-250 μl). Adjust the final volume to 3ml.Place the plate in the incubator and swirl the plate to ensure even distribution of cells.Replace the medium daily with 3 ml fresh pre-warmed mESC medium.Generation of trunk-like structures (TLSs)NOTES: The input cell number for each well detailed here is optimized for the mESC lines used in Veenvliet et al. (2020). Based on the proliferation rate of the mESC line (especially for transgenic lines and/or mESCs with a different genetic background), the cell amount may need to be adjusted to reach the same efficiency reported in Veenvliet et al. (2020).",
    "We recommend first optimizing the standard gastruloid protocol for new cell lines, using gastruloid elongation efficiency as a fast experimental readout (Cermola et al., 2021). In our experience, good gastruloid elongation efficiency (>95%) is essential to achieve a similar TLS efficiency to that reported in Veenvliet et al. (2020). A routine optimization procedure involves the seeding of 100-600 mESCs per well, with a stepwise increase of 50 cells. mESCs must be in culture for at least one passage before starting. Pre-warm mESC medium and TrypLE in the water bath for at least 20 min before starting. Here, we use commercially available, quality controlled NDiff 227 medium (N2B27). We and others have successfully generated gastruloids with home-made N2B27 (Beccari et al., 2018b); however, in our hands, more robust results of the gastruloid and TLS protocols are obtained with the NDiff 227 medium. Instead of TrypLE, 0.05% Trypsin-EDTA can be used. A schematic overview of the TLS generation protocol indicating critical timepoints is provided in Figure 2. imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4042/bioprotoc-11-11-4042-g002.jpgFigure 2. Schematic overview of the TLS generation protocol. Workflow for the generation of trunk-like-structures (TLS) from seeding of MEFs to downstream analysis. MG, Matrigel; CL, CHIR+LDN; MEFs, mouse embryonic fibroblasts; mESCs, mouse embryonic stem cells.D1. Prepare 6-well plate for MEF depletion Coat three wells of a 6-well plate with 2 ml 0.1% gelatin solution for each 6 cm plate that will be used for TLS generation.Incubate the 6-well plate at room temperature for 15 min.Aspirate gelatin solution and add 1 ml mESC medium to each well.Store plate in the incubator until use.D2. Prepare a single cell suspension Aspirate the medium from the mESC plate and wash with 3 ml DPBS.Aspirate the DPBS and add 1 ml TrypLE.",
    "Ensure that the plate surface is evenly covered with TrypLE and place it in the incubator at 37°C for 5 min.After 5 min, dislodge the colonies with a P1000 pipet set to 800 μl by pipetting up and down in the plate 20 times.Inactivate the TrypLE by adding 1 ml mESC medium and pipet-mix.Transfer the cell suspension to a 15 ml Falcon tube and wash the plate with an additional 3 ml mESC medium to recover all cells. Transfer these cells to the same 15 ml tube.Centrifuge the cells at 200 × g for 5 min.Resuspend the cell pellet in 1 ml mESC medium and pipet up and down 50 times.NOTE: Here, it is critical to achieve a proper single cell suspension to avoid losing mESCs (or retaining MEFs) during MEF depletion and to ensure the best protocol performance. We recommend checking for a proper single cell suspension under a microscope. D3. MEF depletion NOTE: An example how the wells with cells attached to the bottom should look like after each step of MEF depletion is provided in Figure 3.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4042/bioprotoc-11-11-4042-g003.jpgFigure 3. MEF depletion prior to mESC aggregation. MEFs attach to the 0.1% gelatin-coated wells. Scale bars, 50 μm.NOTE: With consecutive transfers, the amount of attached cells decreases. After the third incubation, MEF depletion is completed and mESCs are ready to be used for aggregation. Transfer the obtained cell suspension to a well of the prepared 6-well plate (see D1).NOTE: Transfer the amount of mESCs present in one 6 cm plate into one well of the prepared 6-well plate. The presence of too many cells could result in decreased depletion efficiency. Pipet-mix 10 times.Place the plate in the incubator and swirl the plate to ensure even distribution of cells. Leave untouched for 25 min.",
    "Next use a P1000 pipet set to 1 ml to carefully transfer all the cells in suspension to another well.NOTE: It is critical not to dislodge the MEFs, which are attached to the bottom of the wells. Pipet up and down 10 times in the new well to ensure a single cell suspension.NOTE: Cells may clump during the incubation; therefore, it is critical to pipet once the cells are transferred to the new well. We recommend confirming under the microscope that you have obtained a proper single cell suspension. Place the plate in the incubator and swirl the plate to ensure even distribution of cells. Leave untouched for 20 min.Next, use a P1000 pipet set to 1 ml to carefully transfer all the cells in suspension to another well.NOTE: It is critical not to dislodge the MEFs, which are attached to the bottom of the wells. Pipet up and down 10 times in the new well to ensure a single cell suspension.NOTE: Cells may clump during the incubation; therefore, it is critical to pipet once the cells are transferred in the new well. We recommend confirming under the microscope that you have obtained a proper single cell suspension. Place the plate in the incubator and swirl the plate to ensure even distribution of cells. Leave untouched for 15 min.During this last 15-min step, equilibrate the required amount of NDiff 227 in a 10 cm dish in the incubator for at least 20 min. Longer incubation is also possible (e.g., NDiff 227 can be placed in the incubator after step 6. See Table 1 for the volume needed as a function of the number of 96-well plates to seed).NOTE: NDiff 227 is light-sensitive and should be protected from (direct) light as much as possible.",
    "Carefully transfer all MEF-depleted mESCs to a 15 ml Falcon tube with a P1000 pipet.NOTE: It is critical not to dislodge the MEFs, which are attached to the bottom of the wells. D4. mESC aggregation (0 h) NOTE: The first 96 h of the TLS protocol are similar to the gastruloids protocol (Baillie-Johnson et al., 2015; van den Brink et al., 2014; Beccari et al., 2018b; Anlas et al., 2021). Detailed protocols for gastruloid formation, including troubleshooting, are provided elsewhere (Baillie-Johnson et al., 2015; Beccari et al., 2018b; Anlas et al., 2021). Centrifuge the cells at 200 × g for 5 min.Resuspend the cell pellet in 5 ml PBS with MgCl2/CaCl2 and pipet up and down 20 times (Wash 1).Centrifuge the cells at 200 × g for 5 min.NOTE: In case of low starting cell numbers, steps 2 and 3 can be omitted. This may however slightly compromise protocol efficiency. Resuspend the cell pellet in 5 ml pre-equilibrated NDiff 227 and pipet up and down 20 times (Wash 2).Centrifuge the cells at 200 × g for 5 min.Resuspend the cell pellet in 500 μl pre-equilibrated NDiff 227 and pipet up and down 30 times. NOTE: It is critical to obtain a single cell suspension prior to counting and plating. For counting, prepare a 1:2 dilution of the cell suspension by adding 10 μl cell suspension to 10 μl Trypan Blue.Count using the Luna automated cell counter with the following set up: Dilution factor → 2; Noise reduction → 5; Live detection sensitivity → 5; Roundness → 85%; Min cell size → 10 μm; Max cell size → 20 μm; Declustering level → High.",
    "Transfer the amount of cells needed for the experiment to a new Falcon tube (see Table 1 for the number of cells needed as a function of the number of 96-well plates to seed).Add the pre-incubated NDiff 227 volume required to bring the cell suspension to a concentration of 5.7 × 103 cells/ml (see Table 1 for the volume to add as a function of the number of 96-well plates to seed).NOTE: This cell concentration is optimized for an input of 200 cells/well, which has been shown to give high TLS generation efficiency for all cell lines tested (Veenvliet et al., 2020). Similar results were obtained for inputs ranging from 200 to 250 cells/well. Mix the new cell suspension vigorously and transfer it to a reservoir.Use a multichannel pipet to transfer 35 μl to each well of an ultra-low attachment 96-well plate. Pipet gently up and down in the reservoir between each transfer.Gently tap the plate 5 times on a clean bench, transfer to the incubator, and allow undisturbed aggregation for 48 h.NOTE: Keeping NDiff 227 outside the incubator for longer periods of time (more than 5 min) will lead to disequilibration of the medium. Therefore, try to avoid keeping NDiff 227 or plates with freshly seeded cells in NDiff 227 out the incubator for too long. In the case of handling multiple plates, we recommend putting each plate into the incubator directly after pipetting.Table 1. Cell numbers and volumes required for mESC aggregation. The amounts are calculated for an input of 200 cells/well in 35 μl. Volumes and cell numbers in column 4 are calculated for 100 samples (instead of 96) per plate plus a 10% excess dead volume.",
    "In column 2, the volume of NDiff 227 to equilibrate is calculated based on the amount needed for washing and counting the cells (5.5 ml per experiment, independent of the number of plates, see step D4.4 and D4.6), plus the amount indicated in column 4, plus an extra volume to account for dead space in the dish and evaporation during medium equilibration.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210601/20210601225013_8963.jpg D5. CHIR pulse (48 h) NOTES: Start this procedure at least one hour before the end of the 48 h. Cells at 48 h should have formed one single round aggregate with a diameter measuring 214 ± 13 μm (seeFigure 4A).CHIR99021 is light-sensitive and should be protected from (direct) light as much as possible. CHIR99021 should be aliquoted in single-use aliquots in brown (light-protected) sterile tubes upon arrival and not subjected to repeated freeze-thaw cycles. Equilibrate the needed amount of NDiff 227 in a 10-cm dish in the incubator for at least 20 min. (see Table 2 for the volume needed as a function of the number of 96-well plates used in the experiment).Transfer the required amount of NDiff 227 to a 50-ml Falcon tube (see Table 2 for the volume needed as a function of the number of 96-well plates used in the experiment).Table 2. Volumes of NDiff 227, CHIR99021, and Matrigel required during the last three steps (protocol steps D5, D6, D7) of the TLS generation protocol. In column 2, the volume of NDiff 227 to equilibrate is calculated including an excess volume (2 ml for each dish that is used for medium equilibration) to account for dead space in the dish(es) and medium evaporation during equilibration.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210601/20210601230646_0948.jpg *For volumes higher than 30 ml, use more than one 10-cm plate to equilibrate NDiff 227 in the incubator.**Use two 50-ml tubes if the volume exceeds 50 ml.",
    "***Note that we calculate 5% v/v Matrigel as a function of the final volume in each well (35 μl + 150 μl = 185 μl) (as opposed to CHIR99021). This means that in the NDiff 227, the concentration of Matrigel is slightly higher than 5% (6.17%). For instance, for 1 plate of TLSs, the volume of Matrigel added is calculated as (0.05*16)*(185/150) = 0.987 ml.Add CHIR99021 to the NDiff 227 medium to obtain a final concentration of 3 μM.Mix the medium vigorously and transfer it to a reservoir.Use a multichannel pipet to add 150 μl CHIR99021-supplemented medium to each well of the plates containing the aggregates.Gently tap the plate 10 times on a clean bench, transfer to the incubator, and allow further undisturbed development for 24 h.NOTES: The tapping is critical to prevent cell aggregates from attaching to the culture plates. Ensure that the aggregates are freely moving immediately after tapping (this can be checked under the microscope). Take caution to avoid splashing medium on the lid while tapping the plates. imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4042/bioprotoc-11-11-4042-g004.jpgFigure 4. Examples of expected morphology of mESC-derived aggregates at several timepoints during TLS generation. A, B. mESC-derived aggregates at 48 h and 72 h after aggregation are round without clear signs of symmetry breaking. C. At 96 h after aggregation, the structures have clearly broken symmetry and are teardrop shaped. The white arrowheads indicate the posterior pole, where localized expression of Brachyury is expected. Note that, depending on the cell line used, aggregates may establish the teardrop-like morphology prior to 96 h. In that case, structures should be embedded in Matrigel earlier (as soon as the teardrop-like morphology is observed) to achieve optimal TLS efficiency (see main text for details). D.",
    "Upon addition of 5% Matrigel, the aggregates will establish an architecture reminiscent of the embryonic trunk, with somites (magenta arrowheads) flanking a neural tube (green arrowheads). Chemical modulation with a WNT agonist (5 μM CHIR99021) and BMP inhibitor (600 nM LDN193189) results in compromised neural tube development and formation of excess somites arranged like a “bunch-of-grapes” (TLSCL). Scale bars for all panels, 50 μm. A, Anterior; P, Posterior.D6. Media change (72 h) NOTES: Start this procedure at least one hour before the end of the 72 h. Aggregates at 72 h should look like the example given in Figure 4B and measure 244 ± 15 μm in diameter. If available, perform this step on a clean bench containing a stereoscope or a light ring to help visualize the structures and avoid loss of structures while pipetting off the old medium. Equilibrate the required amount of NDiff 227 in a 10-cm dish in the incubator for at least 20 min (see Table 2 for the volume needed as a function of the number of 96-well plates used in the experiment).Transfer the required amount of NDiff 227 to a 50-ml tube (see Table 2 for the volume needed as a function of the number of 96-well plates used in the experiment).Use a multichannel pipet to remove 150 μl from each well without disturbing the structure. NOTE: CRITICAL STEP. Avoid losing structures while pipetting off the medium. This is best achieved by keeping the plate under a 30-40° angle and putting the pipet tips against the side opposite to that where the aggregate should be located. As a visual aid, a stereoscope or light ring could be used as stated above (see Figure 5 for a schematic of how to position the plate and tips). imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4042/bioprotoc-11-11-4042-g005.jpgFigure 5.",
    "Schematic representation of plate positioning for media changes during the TLS generation procedure. The plate is tilted at a 30-40° angle on a clean bench and the media is carefully aspirated with a multichannel pipet, avoiding disturbance of the aggregates.Pour the pre-equilibrated medium in a reservoir.Use a multichannel pipet to add 150 μl medium to each well of the plates containing the aggregates.Gently tap the plate 10 times on a clean bench, transfer to the incubator, and allow further undisturbed development for 16-24 h.NOTES: The tapping is critical to prevent cell aggregates from attaching to the culture plates. Ensure that the aggregates are freely moving immediately after tapping (this can be checked under the microscope). Take caution to avoid splashing medium on the lid while tapping the plates. Thaw overnight at 4 °C on ice the amount of Matrigel needed the following day (see Table 2 for the volume needed as a function of the number of 96-well plates used in the experiment). We have used multiple Matrigel batches with comparable results. D7. TLS generation (88-96 h) NOTES: Start monitoring the TLSs around 88 h after aggregation for the appearance of a “teardrop-like” shape (see Figure 4C). Structures should present a longer axis (421 ± 33 μm) and a shorter axis (337 ± 30 μm), with an axis ratio of 0.8 ± 0.07. Start this procedure immediately when a “teardrop-like” shape is observed in the majority of the TLSs (or latest 96 h after aggregation) to achieve optimal TLS formation efficiency. If available, perform this step on a clean bench containing a stereoscope or a light ring to help visualize the structures and avoid losing structures while pipetting off the old medium. If performing chemical modulation at this step, follow the “Variant protocol: chemical modulation during TLS generation.",
    "” Equilibrate the required amount of NDiff 227 in a 10-cm dish in the incubator for at least 20 min (see Table 2 for the volume needed as a function of the number of 96-well plates used in the experiment).Transfer the required amount of NDiff 227 to a 50-ml Falcon tube and place it on ice (see Table 2 for the volume needed as a function of the number of 96-well plates used in the experiment).Once the medium has cooled down, supplement it with the correct volume of Matrigel on ice and mix vigorously.NOTE: It is critical, while handling Matrigel, that every step is performed on ice to avoid clumping. It is also recommended to pre-cool the pipet tips used for the handling of 100% Matrigel by placing the box in the fridge until use; see Table 2 for the volume needed as a function of the number of 96-well plates used in the experiment. Move the Falcon tube with Matrigel-supplemented medium to room temperature.Use a multichannel pipet to remove 150 μl from each well without disturbing the structure.NOTES: CRITICAL STEP. Avoid losing structures while pipetting out the medium. This is best achieved by keeping the plate under a 30-40° angle and putting the pipet tips against the side opposite to that where the aggregate should be located. As a visual aid, a stereoscope or light ring could be used as stated above (see Figure 5 for a schematic of how to position the plate and tips). This step should not take more than 5 min after Matrigel-supplemented medium has been placed at room temperature. If there are multiple plates, it is advisable to remove the medium from all plates before equilibrating the Matrigel-supplemented medium at room temperature and keep the structures in the incubator.",
    "Pour the Matrigel-supplemented medium into a reservoir.Use a multichannel pipet to add 150 μl Matrigel-supplemented medium in each well of the plates containing the aggregates.Gently tap the plate 10 times on a clean bench and transfer to the incubator.NOTES: The tapping is critical to prevent cell aggregates from attaching to the culture plates. Ensure that aggregates are freely moving immediately after tapping (this can be checked under the microscope). Take caution to avoid splashing medium on the lid while tapping the plates. If performing Live Cell Imaging after embedding, allow the TLSs to settle for 1 h in the incubator before starting imaging. Variant protocol: chemical modulation during TLS embedding Follow “D7. TLS generation (88-96 h)” for all passages except for point 3.3’. Once the medium has cooled down, supplement it with the correct volume of Matrigel and appropriate chemical compounds for your modulations on ice and mix vigorously.NOTES: It is critical, while handling Matrigel, that every step is performed on ice to avoid clumping; see Table 2 for the volume needed as a function of the number of 96-well plates used in the experiment. Add an equal volume of diluent to the control sample TLSs when performing chemical modulations. In Veenvliet et al. (2020), we induced excess somite production and compromised neural tube development by supplementing the medium with 5 μM CHIR99021, alone (TLSC) or in combination with 600 nM LDN193189 (TLSCL). EXPECTED OUTCOME: TLSs at 120 h should look elongated with a clear anterior and posterior domain (Figure 4D upper panel; Figure 6A). Moreover, they should show clear segmentation (somites) on one or both sides of a tubular structure (neural tube). TLSs subjected to chemical modulation (TLSCL) should display compromised neural tube development and formation of excess somites arranged like a “bunch-of-grapes” (Figure 4D lower panel; Figure 6B).",
    "imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4042/bioprotoc-11-11-4042-g006.jpgFigure 6. Expected outcome of the TLS protocol. A. Examples of trunk-like structures (TLSs) 24 h after addition of 5% Matrigel (total culture time 120 h). The left upper structure is immunostained with a SOX2 antibody and counterstained with DAPI, labeling the neural tube and nuclei, respectively. Somites are indicated with magenta arrowheads or with S1, S2, etc. (in magnifications); S1-S8, Somite 1-Somite 8. Neural tube (NT) is indicated with a green arrowhead. A, Anterior; P, Posterior. B. Expected outcome of TLSs subjected to chemical modulation (TLSCL) is compromised neural tube development and formation of excess somites arranged like a “bunch-of-grapes.” Somites are indicated with magenta arrowheads. Scale bars, 100 μm (whole structure) or 20 μm (magnifications). A, Anterior; P, Posterior.D8. TLS analysis (108-120 h) NOTES: Depending on the specific biological question, the exact time of analysis may vary (see Veenvliet et al., 2020 for time-resolved expression dynamics). If available, perform this step on a clean bench containing a stereoscope or a light ring to help visualize the structures and avoid losing structures while processing them. The following protocol variants are performed (D8’, D8’’, D8’’’) depending on the downstream applications. Prepare a P200 tip box with the tip cut-off at the 50-μl mark for TLS picking (if using unmarked tips, cut approximately 9 mm off the tip). D8’. Staining and imaging Use a P200 pipet set to 50 μl and the cut-off tips to manually pick each individual TLS that needs to be analyzed in a well of an Ibidi 8-chamber plate.Add 200 μl cold PBS/0.5% BSA solution to each well containing a TLS.Remove 200 μl with a pipet and perform the same 200 μl cold PBS/0.5% BSA solution wash three times.Use the fixative of interest to fix TLSs in the Ibidi plate for the downstream protocol.",
    "Perform the rest of the staining protocol in the Ibidi plate and image the structure with the desired microscope and settings.NOTE: We have so far used 4% PFA fixation for whole-mount immunofluorescence (WIFC) as well as whole-mount in situ hybridization (WISH). A detailed description of the protocols used for WIFC and WISH, including method-specific fixation times and downstream processing, is provided in the Supplemental Information of Veenvliet et al. (2020). D8’’. RNA extraction Use a P200 pipet set to 50 μl and the cut-off tips to manually pick and transfer each individual TLS that needs to be analyzed to a 1.5-ml tube containing 1 ml cold PBS/0.5% BSA solution.NOTE: The number of TLSs that are pooled in one tube depends on the downstream application and experiment. Centrifuge the TLSs at 200 × g for 1 min at 4°C.Remove the supernatant with a P1000 pipet while being careful not to disturb the TLS pellet.Wash the structures with 1 ml cold PBS/0.5% BSA solution.NOTE: Ensure loosening of the pellet without aspirating into the pipet tip. Centrifuge the TLSs at 200 × g for 1 min at 4°C.Remove the supernatant with a P1000 pipette while being careful not to disturb the TLS pellet.Add the indicated amount of RNA lysis buffer or TRIzol depending on the desired RNA extraction strategy.D8’’’. 10× Genomics single-cell RNA sequencing NOTES: This section explains how to process TLSs to generate a single cell suspension suitable for efficient Gel Bead-in-Emulsion (GEMs) generation. Follow the manufacturer’s instructions for every step after the single cell suspension has been generated and counted. Pre-warm TrypLE in the water bath for at least 20 min before starting.",
    "Use a P200 pipette set to 20 μl and the cut-off tips to manually pick each individual TLS that needs to be analyzed in a well of an ultra-low attachment 96-well plate containing 200 μl cold PBS.Transfer each TLS serially five times to new wells containing 200 μl cold PBS.NOTES: It is CRITICAL to carry over as little volume as possible from the culture to minimize the amount of Matrigel transferred. Carrying over excess amounts of Matrigel can lead to microfluidics clogging during GEM generation. Since washing of TLSs is performed in PBS without BSA, the structures may become sticky and get stuck to the tip wall. Avoid this by pipetting a very low volume to maintain the structure at the liquid/air interphase in the tip. After the five washes, transfer all the structures into a single drop of 200 μl pre-warmed TrypLE in the center of a 6-cm plate.Transfer the plate to the incubator and allow cell dissociation for 25 min with pipetting every 5 min to ensure that a single cell suspension is achieved.NOTE: Perform the pipetting steps under a stereoscope to monitor the degree of cell dissociation and ensure no loss of material. At the end of the 25 min, and after verifying correct achievement of a single cell suspension, transfer the cell suspension to a 1.5-ml tube on ice.To ensure maximum cell recovery and to quench the trypsinization reaction, wash the part of the plate where the drop was located four times with 200 μl PBS/0.5% BSA solution. Add every wash to the same tube (from step 5) containing the cell suspension.Filter the cell suspension using a P1000 set to 1 ml through a 40-µm Flowmi Cell Strainer in a new 1.5-ml tube on ice.",
    "Centrifuge the cell suspension at 300 × g for 5 min at 4°C.Remove 800 μl supernatant with a P1000 while being careful not to disturb the cell pellet.NOTE: The cell pellet may be very small and barely visible, so be extremely careful during these steps. Wash with 1 ml PBS/0.5% BSA solution.Centrifuge the cell suspension at 300 × g for 5 min at 4°C.Remove 800 μl supernatant with a P1000 while being careful not to disturb the cell pellet.NOTE: The cell pellet may be very small and barely visible, so be extremely careful during these steps. Resuspend the pellet in the remaining 200 μl left in the tube.Centrifuge the cell suspension at 300 × g for 5 min at 4°C.Remove the supernatant with a P200 pipet, leaving ~42 μl in the tube.NOTE: Use another tube containing exactly 42 μl PBS/0.5% BSA solution as a guide to evaluate the approximate volume to leave in the tube. Resuspend the cell pellet in the ~42 μl left and determine the cell suspension concentration using a manual hemocytometer (analyze a 1:5 cell suspension dilution by adding 2 μl cell suspension to 8 μl Trypan Blue).Proceed with the desired amount of cells for GEM generation following the manufacturer’s instructions."
  ],
  "subjectAreas": [
    "Stem Cell",
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}