{
  "id": 3530,
  "origin_website": "Cell",
  "title": "Establishing a mouse model of lung metastases using ultrasound-guided right heart ventricle injection",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nAnimal preparation: Fur removal\nTiming: 5–10 min per mouse, 24 h prior to injection\nThis step prepares the animal for ultrasound-guided tumor cell injection by exposing skin required for efficient signal transduction by the ultrasound probe through ultrasound gel.\nNote: The steps for fur removal are identical to those previously described except for site of fur removal.1[href=https://www.wicell.org#bib1] Instead of removing fur from the anterior abdomen, we remove fur from the anterior thorax.\nPrepare depilatory station as previously described:1[href=https://www.wicell.org#bib1]\nTurn on the heated platform and set to 37°C.\nEnsure that there is sufficient isoflurane and oxygen to carry out the procedure.\nPlace an absorbent blue pad on the heated platform and assemble tools:\nElectric shaver.\nUnscented depilatory cream.\nPBS.\nMetal spatula.\nKimwipes.\nCotton-tipped applicators.\nInduce anesthesia as previously described:1[href=https://www.wicell.org#bib1]\nTransfer one mouse at a time to the anesthesia chamber and induce general anesthesia as per local animal review committee protocol.\nApply ophthalmic ointment to both eyes for anesthetic events lasting longer than 5 min.\nTransfer anesthetized mouse to the preheated platform draped with an absorbent pad and continue anesthesia administration via nose cone.\nRemove fur:1[href=https://www.wicell.org#bib1]\nUsing an electric shaver, remove fur from the anterior thorax from the suprasternal fossa to the costal margin (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3101-Fig1.jpg\nFigure 1. Suggested extent of hair removal prior to ultrasound imaging\nComplete fur removal with depilatory cream as previously described.\nDispense a dime-sized amount of unscented depilatory cream and spread evenly over the shaved area using a cotton-tipped applicator.\nWait for approximately 2 min.\nUsing a metal spatula, gently remove cream and fur until skin is completely fur-free.\nTransfer the mouse back to the cage on a heated platform and monitor for recovery from anesthesia.1[href=https://www.wicell.org#bib1]",
    "Repeat above steps until all mice have undergone hair removal and have recovered from anesthesia.1[href=https://www.wicell.org#bib1]\nUltrasound imaging and injection station preparation\nTiming: 30 min\nThis step prepares the imaging and injection station for use and confirms operational status of all experimental equipment as previously described.1[href=https://www.wicell.org#bib1]\nNote: The steps for imaging and injection station preparation are identical to those previously described except for the insulin syringe.1[href=https://www.wicell.org#bib1] In this protocol, a 30-gauge insulin syringe is used. The following steps are abbreviated from the originally published protocol.1[href=https://www.wicell.org#bib1]\nEnsure that tubing connections and anesthetic delivery cone are oriented on the right side of the Vevo Imaging Station such that when a mouse is placed in the supine position the right side of the mouse will face the proceduralist.\nReview supplies for induction and maintenance of anesthesia and ensure sufficient isoflurane and oxygen to perform the procedure.\nTurn on the physiological controller from the Vevo Imaging Station and set the platform temperature to 37°C.\nWarm ultrasound gel.\nAssemble required instruments and materials as previously described.1[href=https://www.wicell.org#bib1]\nSelect and mount the MicroScan Transducer hereafter referred to as “ultrasound probe” (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3101-Fig2.jpg\nFigure 2. Appropriately mounted MicroScan Transducer (ultrasound probe) within the Vevo Imaging Station\n(A) MicroScan Transducer (ultrasound probe).\n(B) Transducer mounting system.\n(C) Animal physiological monitoring and maneuvering system.\nOrient the ultrasound probe indicator toward the mouse’s right side (facing the injector).\nSecure the needle stabilization device to the ultrasound probe with the syringe-holding side facing the injector (Figure 3[href=https://www.wicell.org#fig3])\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3101-Fig3.jpg\nFigure 3. Appropriately mounted and positioned needle stabilization device\n(A) Mounted ultrasound probe.\n(B) Needle stabilization device mounted in correct orientation on ultrasound probe. Note that ultrasound probe indicator snuggly fits into notch within needle stabilization device.",
    "Position the imaging station and ultrasound screen to maximize the injector’s ergonomics and accessibility to the injection site.\nCell preparation for injection\nTiming: 1 h\nThis step prepares tumor cells for injection with the desired cell density and volumes.\nDetach cells adhered to the tissue culture plate suspend in cell culture media according to the preferred cell detachment protocol.\nNote: The B16F10-luc cells and KP4662-G12C gp100-luc cells used in this protocol were detached from a TC-treated 10 cm plate by washing the cells once with 2 mL PBS following incubation with 2 mL 0.25% trypsin. B16F10-luc cells were incubated for 2–3 min while KP4662-G12C gp100-luc cells were incubated for 5–7 min. The trypsin reaction was halted with 5 mL of cell culture media.\nCentrifuge cell suspension at 450 × g for 5 min at 4°C. Remove supernatant.\nResuspend cells in at least 5 mL chilled PBS to wash the cells.\nRepeat centrifugation and PBS wash (steps 16 and 17) twice more for a total of 3 washes.\nNote: Repeated washing of cells with PBS removes the FBS present in culture media prior to injection.\nAfter the 3rd wash resuspend cells in 5 mL PBS and pass through a sterile 40 μm filter into a new, sterile conical vial.\nCount cells and record viability.\nPerform final centrifugation of cells at 450 × g for 5 min at 4°C.\nNote: We recommend that the viability of cells used in this protocol to be at least 90%. We have not tested this protocol with cells less viable than this threshold. We theorize that using less viable cells can adversely affect the reproducible establishment of lung metastases.\nResuspend cells in volume of chilled PBS to reach desired cell concentration.",
    "Note: Recommended injection volume is 100 μL per mouse as previously described.2[href=https://www.wicell.org#bib2] Volume of prepared cells should be sufficient for all mice in study plus 5 additional mice.\nPerform an additional cell count on this final cell suspension to record viability and concentration of viable cells at the time of injection.\nKeep cell suspension on ice until needed for injection.\nNote: When initially establishing this protocol it is recommended to first optimize the number of tumor cells injected. This must be done for each cell line to be investigated. Optimal cell number is determined as the number of cells that consistently establish BLI signal in the anterior thoracic region within the desired time frame (for example 3–5 days). The B16F10-luc cells used in this protocol were injected at a concentration of 1.25–10 × 106 cells/mL, total volume of 100 μL per mouse as previously described.1[href=https://www.wicell.org#bib1] The KP4662-G12C-gp100-luc cells used in this protocol were injected at a concentration of 5–10 × 106 cells/mL, total volume of 100 μL per mouse. The ranges provided here are broad to reflect all the concentrations trialed while working with these cell lines. Titrations should reflect the experimental model and desired experimental design.\nUltrasound-guided injection\nTiming: 10–15 min per mouse\nThis step injects prepared tumor cells into the right ventricle using a short-axis or cross-sectional view of the heart.\nAnesthetize mice.\nAnesthetize one mouse at a time in the anesthesia induction chamber as per local animal review committee protocol.\nNote: It is recommended to minimize the time under isoflurane due to the reduction in sympathetic tone which reduces cardiac output in mice.3[href=https://www.wicell.org#bib3]\nNote: We used 5% isoflurane in oxygen (5 L per min) for anesthesia induction and 2.5% isoflurane in oxygen (5 L per min) for anesthesia maintenance as previously described.1[href=https://www.wicell.org#bib1]",
    "Apply ophthalmic ointment to both eyes for anesthetic events lasting longer than 5 min.\nTransfer mouse to pre-heated animal imaging platform and maintain anesthesia via nose cone.\nSecure mouse to platform by using approximately 1 inch of paper tape for each paw, such that the mouse is supine with face inside the nose cone and each limb fully extended (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3101-Fig4.jpg\nFigure 4. Mouse appropriately secured to imaging platform with paper tape\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3101-Fig5.jpg\nFigure 5. Suggested positioning of the platform for cardiac imaging\nNote: The electrocardiogram (ECG) pads on the Imaging Station will not be utilized during this procedure, so it is not required to have each paw make contact with the pads. However, they can be used as landmarks to aid in mouse positioning.1[href=https://www.wicell.org#bib1]\nNote: Figure 4[href=https://www.wicell.org#fig4] and subsequent Figure 5[href=https://www.wicell.org#fig5] depict the nose cone and mouse oriented on the left side, such that the left side of the mouse faces the injector. These images were taken when utilizing the potential solution described in troubleshooting[href=https://www.wicell.org#troubleshooting] problem 1: difficulty obtaining a short axis cardiac window without shadowing artifact[href=https://www.wicell.org#sec6.1]. To first establish a short axis cardiac window the mouse is oriented as described in step 25 (Figure 5[href=https://www.wicell.org#fig5]).\nSanitize the ultrasound probe with an alcohol wipe or 70% ethanol spray.1[href=https://www.wicell.org#bib1]\nWipe the previously shaved area of the mouse with an alcohol swab.1[href=https://www.wicell.org#bib1]\nTilt the imaging platform so that the mouse is head down, reminiscent of reverse Trendelenburg position (Figure 5[href=https://www.wicell.org#fig5]).",
    "Note: Positioning the mouse this way facilitates a cross-sectional view of the heart while minimizing the shadowing artifact from the ribs and sternum. We prefer a cross-sectional view in which the ultrasound probe is perpendicular to the ventricles. This allows simultaneous visualization of both ventricles. The most difficult aspect of this technique is obtaining a clear window without shadowing that would obscure the needle (see troubleshooting[href=https://www.wicell.org#troubleshooting] problem 1: difficulty obtaining a short axis cardiac window without shadowing artifact[href=https://www.wicell.org#sec6.1]).\nApply a generous layer of pre-warmed ultrasound gel to the mouse.1[href=https://www.wicell.org#bib1]\nLower the ultrasound probe using the height control until it meets the ultrasound gel layer. Watch the ultrasound screen for the ultrasound image to come into view.1[href=https://www.wicell.org#bib1]\nUsing the fine forward and backward control knobs, scan the mouse and use anatomic landmarks to obtain an ideal window (Figure 6[href=https://www.wicell.org#fig6]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3101-Fig6.jpg\nFigure 6. Short axis cardiac window with labeled anatomic landmarks\nNote: Appropriate anatomical landmarks include: left ventricle (LV), right ventricle (RV), intraventricular septum (IVS), tricuspid/mitral/aortic valves, and tracing of the aorta back to the left atrium.\nNote: Depending on the anatomy of an individual mouse, it may be necessary to adjust the angle of the platform to obtain the desired window. Obtaining an ideal injection window is the most challenging aspect of the procedure. Difficulty in obtaining a window can lengthen procedure time and total time under anesthesia. An experienced sonographer can obtain an injection window in less than two minutes, but a challenging window can take up to five minutes. If a window is not obtained within five minutes, it is recommended to abort the procedure and allow the mouse to recover from anesthesia. A second attempt can be made after the remaining mice in the cage have been injected.",
    "While the injector identifies the relevant landmarks, an assistant should remove the prepared cells from ice, thoroughly resuspend settled cells by vigorous tapping or gentle vortex, and aspirate 100 μL through the needle of 30-gauge insulin syringe.\nNote: The assistant may need to aspirate a small amount of additional volume to aid in degassing of needle.\nCritical: It is essential to degas the needle thoroughly as even small amounts of air can prove lethal for the mouse.\nAdjust the gain as needed to clearly distinguish the ventricular cavity from the ventricular walls. As the ventricular cavities are filled with blood, they should appear black.\nAdjust the depth to fill 75% of the screen with the target anatomy to maximize image quality.\nLoad the device with the syringe by snapping it into place (Figure 7[href=https://www.wicell.org#fig7]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3101-Fig7.jpg\nFigure 7. Image of loaded syringe stabilization device\nNote: The needle stabilization device restricts lateral movement, maintaining the needle in plane with forward advancement.1[href=https://www.wicell.org#bib1] This procedure can be done without the assistance of the device but requires greater dexterity and has a steeper learning curve.\nAdjust the angle of entry so that the needle can be visualized within the gel cap at the intended site of entry.\nUsing toothed forceps, grasp the skin lateral to the intended site of needle entry and gently pull the skin taut.1[href=https://www.wicell.org#bib1]\nGently advance the needle using the dominant hand.1[href=https://www.wicell.org#bib1]\nAdvance the needle through the skin and intercostal muscles.\nRelease the skin and drop the forceps as they are no longer needed.\nAssess needle trajectory to ensure that no further angle adjustment is needed to enter the right ventricle.\nNote: The right ventricle is much smaller and should be inferior to the left ventricle. A steeper angle may be required to avoid unnecessarily piercing the left ventricle.",
    "Advance the needle until it enters the right ventricle cavity. The needle should be seen between the walls of the ventricle during ventricular contraction (Figure 8[href=https://www.wicell.org#fig8]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3101-Fig8.jpg\nFigure 8. Ultrasound image of needle positioned within the right ventricle\nNote: It is important for the needle to be in-plane so that the needle tip is visualized. Failure to do so can result in the needle entering the interventricular septum and lead to injection into the muscle wall rather than the ventricular cavity.\nAspirate to confirm blood return.\nInject cells at a relatively slow and constant rate.\nNote: While the injector focuses on position of the needle during injection, an assistant can confirm blood return and dispensing rate.\nCritical: A rapid bolus into the ventricular cavity can cause cardiovascular collapse if cell suspension is rapidly administered.\nGently remove the needle along the track of the needle stabilization device and discard it.\nRaise the ultrasound probe, remove the tape securing the mouse to the platform and recover the mouse by hand, applying pressure to the injection site with the left thumb.\nNote: Pressure should be firm, but not so firm as to restrict diaphragmatic excursion during respiration as mouse regains consciousness.\nTransfer the mouse to a cage on a heated platform once the mouse has recovered enough from anesthesia to start ambulating.\nBioluminescent imaging\nTiming: 5–10 min per cage\nDuration: Every 3 days until experimental endpoint is reached.\nThis step measures tumor cell engraftment and growth via bioluminescent imaging.\nNote: Imaging frequency of once every 3 days is necessary when initially characterizing the growth kinetics of each cell line and number of cells injected, as time to initial signal can vary.",
    "Anesthetize mice as per local animal review committee protocol. Anesthesia is maintained during imaging via nose cone per local animal review committee protocol.\nOptional: To minimize time under anesthesia, intraperitoneal injections of D-Luciferin can be performed without anesthesia.\nPerform 50 μL intraperitoneal injections of D-Luciferin (50 mg/kg).\nAcquire bioluminescent images at 5 min post-injection for the mice injected with B16F10-luc cells and 15 min post-injection for the mice injected with KP4662-G12C gp100-luc cells using the IVIS Lumina III imaging system.\nNote: Waiting period for image acquisition post-luciferin injection must be optimized for each cell line due to differing expression levels of luciferase.\nNote: For this protocol, we performed a four-image series with an F/Stop of 1.2 at 1, 5, 10, and 20 s as previously described.1[href=https://www.wicell.org#bib1] All images displayed in this protocol were from the fourth image (F/Stop 1 at 20 s) using a color intensity scale ranging from 1.00 × 105 to 1.00 × 108.\nTransfer mice to a cage on heated platform and monitor for recovery from anesthesia.1[href=https://www.wicell.org#bib1]"
  ],
  "subjectAreas": [
    "Model Organisms",
    "Cancer"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}