{
  "id": 13334,
  "origin_website": "Jove",
  "title": "Studying Oxidative Stress Caused by the Mitis Group Streptococci in Caenorhabditis elegans",
  "procedures": [
    "1. Preparation of THY (Todd-Hewitt Yeast Extract) Agar Plates\nFor 1 L of media, add 30 g of Todd-Hewitt powder, 2 g of yeast extract and 20 g of agar to a 2 L Erlenmeyer flask. Add 970 mL of deionized water to the contents of the flask and include a stir bar. Autoclave the media at a temperature of 121 °C and pressure of 15 lb/inch2 for 30 min. Thereafter, set the media on a stir plate and allow for cooling with gentle stirring.\nPour the media into appropriately sized sterile Petri dishes (100 mm x 15 mm dishes for growth and maintenance of bacteria, 35 mm x 10 mm dishes for killing assays) under a laminar flow. Allow the media to dry for 2 h under the laminar hood. Thereafter, the plates can be stored at 4 °C for 1 month.\n2. Preparation of Nematode Growth Medium (NGM) and RNAi Feeding Plates (NGM RNAi)\nUsing a stir bar, dissolve 2.5 g of peptone and 3 g of NaCl in 970 mL of deionized water in a 2 L Erlenmeyer flask. Add 20 g of agar to the media. Autoclave the media at a temperature of 121 °C and pressure of 15 lb/inch2 for 30 min. Set the media on a stir plate and allow for cooling with gentle stirring.\nAdd the following solutions to the media for preparation of NGM plates: 25 mL of 1 M potassium phosphate buffer (pH = 6.0), 1 mL of 1 M MgSO4, 1 mL of 1 M CaCl2, 1 mL of (5 mg/mL in 95% ethanol) cholesterol, 1 mL of (10% v/w in ethanol) nystatin, and 1 mL of 25 mg/mL streptomycin.",
    "Add the following solutions to the media for preparation of NGM RNAi feeding plates: 25 mL of 1 M potassium phosphate buffer (pH = 6.0), 1 mL of 1 M MgSO4, 1 mL of 1 M CaCl2, 1 mL of (5 mg/mL in 95% ethanol) cholesterol, 1 mL of (10% v/w in ethanol) nystatin, 1 mL of 50 mg/mL carbenicillin, and 1 mL of IM IPTG.\nPour the media into 60 mm x 15 mm sterile Petri dishes under laminar flow. Allow the media to dry for 2 h under the laminar hood. Subsequently, plates can be stored at 4 °C for 1 month.\n3. Maintenance of C. elegans\nSeed the NGM plates by spotting 50 µL of overnight grown E. coli OP50 in the center of the plates. The E. coli culture is prepared previously in Luria-Bertani (LB) media and stored at 4 °C for several months. Cover the plates and allow them to dry for 24 h under a laminar hood and thereafter store the plates in polystyrene container.\nUnder a dissecting microscope, pick up 10 to 12 gravid adults using a sterile worm pick and transfer the worms to an E. coli OP50 seeded NGM plate. Incubate the plates at 20 °C overnight.\nThe next day, remove the adults using a sterile worm pick and allow the embryos to develop to L4 larvae at 20 °C (~2.5 days).\n4. Preparation of Age Synchronous Population of Worms\nWash gravid adults from two to four NGM plates using M9W and collect them in a 15 mL conical tube.\nTo prepare M9W: combine 3 g of NaCl, 6 g of Na2HPO4, and 3 g of KH2PO4 and dissolve in a final volume of 1 L of deionized water. Autoclave the solution and add 1 mL of 1 M MgSO4.",
    "Spin the tube at 450 x g for 1 min, then decant the supernatant while ensuring that the worm pellet stays intact.\nAdd 400 µL of 8.25% sodium hypochlorite (household bleach) and 100 µL of 5 N NaOH to prepare the worm lysis solution. Add the lysis solution to the worm pellet and mix the contents by flicking the tube until 70% of the adult worms are lysed. Periodically observe the contents of the tube under a dissecting microscope to ensure there is no overbleaching of the eggs.\nDilute the bleach mix by adding 10 mL of M9W to the contents of the conical tube.\nSpin the tube at 450 x g for 1 min. Decant supernatant, then add 10 mL of M9W.\nRepeat step 4.5 two more times.\nResuspend the resulting egg pellet in 3-5 mL of M9W. Place the tube on a tube rotator. Allow the tubes to rotate at a speed of 18 rpm at room temperature (RT) overnight.\nThe next day, spin the tube at 450 x g for 1 min to pellet the L1 larvae. Remove most of M9W by aspiration, leaving behind ~250 µL of liquid in the tube. Resuspend the L1 larvae and place three 5 µL drops of the worm suspension onto a Petri dish lid, then estimate the number of worms per µL using a dissecting microscope.\n5. Induction of RNAi in Worms\nUsing a sterile loop or pick, streak out the desired strains of RNAi-containing E. coli from frozen stocks (Ahringer and Vidal libraries) onto 100 mm x 15 mm LB agar plates containing 50 µg/mL carbenicillin and 15 µg/mL of tetracycline. Incubate the plates at 37 °C for 24 h.",
    "Pick and inoculate an isolated colony from the desired RNAi strain into sterile 15 mL conical tubes containing 2 mL of LB supplemented with 50 µg/mL carbenicillin. Incubate the tubes at 37 °C for 16 h in an orbital shaker at 150 rpm.\nThe next day, spread 150 µL of overnight grown culture onto 65 mm x 15 mm NGM RNAi feeding plates using a sterile spreader. Incubate the plates at 37 °C for 24 h.\nAllow the plates to cool to RT after incubation at 37 °C. Add an appropriate volume of M9W containing ~200 L1 larvae (obtained from the age synchronous population of worms steps) to the E. coli seeded NGM RNAi feeding plates. Incubate the plates at 20 °C until the larvae reach the L4 stage (~2.5 days).\n6. Preparation of Mitis Group Streptococci for Infection\nStreak out desired strains of streptococci on the 100 mm x 15 mm THY agar (if plates were stored at 4 °C, pre-warm the plates to 37 °C before streaking the respective strains), then incubate the plates at 37 °C overnight (~18 h) in a candle jar providing a microaerophilic environment for the growth of the streptococci (the streaked plates can be stored for a week at 4 °C).\nTo propagate clinical isolates of streptococci, use tryptic soy blood agar. Incubate the plates at 37 °C in a candle jar overnight (~18 h).\nThe next day, remove the plates from the candle jar and pick isolated colonies using a sterile loop. Inoculate 15 mL sterile conical tubes containing 2 mL of THY broth. To propagate clinical isolates of streptococci, supplement the THY broth with 5% v/v of sheep blood. Close the caps tight and incubate the tubes at 37 °C under static conditions.\n7. Survival Assays",
    "NOTE: The steps involved in this assay are depicted in Figure 1. To demonstrate that the H2O2 derived by the mitis group is responsible for the killing of the worm, supplement the media with catalase, or the mutant strain ΔspxB and complement strain ΔspxB;spxB+ of S. gordonii can be used. SpxB encodes for a pyruvate oxidase, which is responsible for the production of H2O2 in the mitis group.\nPre-warm 35 mm x 10 mm THY plates to 37 °C. Add 80 µL of overnight grown cultures of the desired strains of streptococci and spread the bacteria completely across the agar surface using a sterile spreader. Incubate the plates at 37 °C in a candle jar overnight (~18 h). As a control, seed two 35 mm x 10 mm NGM plates with 80 µL of overnight grown cultures of E. coli OP50. Incubate the plates at 37 °C overnight.\nTo confirm that the H2O2 produced by the mitis group is responsible for killing of the worms, add 50 µL containing 1,000 units of catalase c onto the THY plate. Spread the catalase solution using a sterile spreader and allow the plates to dry in the laminar flow for 30 min. Seed the plates thereafter with the respective streptococcus strains as described in step 7.1.\nThe next day, remove the plates from the candle jar and allow the plates to cool to RT for 10-15 min. Using a sterile worm pick, transfer 30 L4 larvae from the NGM or NGM RNAi feeding plates to the streptococcus seeded THY plates. Use two seeded THY plates with a total of 60 worms per strain of streptococcus. Incubate the plates at 25 °C.",
    "Using a dissecting microscope, count the number of live and dead L4 larvae on each plate at several timepoints. Initially, score the worms as dead or live every 30 min. Thereafter, when worms rapidly start to die, score them at 15 min intervals. Use the sterile worm pick to gently prod the worms and determine if they are dead or alive. A worm is considered dead if there is no movement in response to the prodding.\nThe assay will take 5-6 h to complete. Repeat the experiment two more times. After completion of the assay, pool the data from the two plates. Input the data of each group, compare the survival curves, and perform Kaplan-Meier survival analysis using statistical software.\n8. Preparation of Agarose Pads for Microscopy\nDissolve 2% w/v of agarose in deionized water by heating the solution in a microwave. A volume of 5 mL of solution is adequate to prepare 20 slides.\nStick lab tape lengthwise along two glass slides. This will determine the thickness of the agarose pads. Place a clean glass slide between the two taped slides.\nPlace 100 µL of molten agarose on the center of the clean slide. Immediately place another clean glass on top of the molten agarose and gently press down to make a pad. Allow the agarose to solidify and subsequently remove the top slide. The agarose pad is ready for use.\n9. Observation of SKN-1 Localization in Response to Streptococcus Infection",
    "NOTE: The steps involved in this assay are depicted in Figure 2. Localization of SKN-1 was determined using the SKN-1B/C::GFP transgenic worm strain. To demonstrate localization of SKN-1 due to the production of H2O2 by the mitis group, wild-type (WT), ΔspxB, and the complement strain ΔspxB;spxB+ of S. gordonii were used. Furthermore, the transgenic reporter strain SKN-1B/C::GFP and RNAi interference technique were used to demonstrate that components of the p38 MAPK pathway regulate the localization of SKN-1.\nPre-warm 35 mm x 10 mm THY plates to 37 °C. Add 80 µL of overnight grown cultures of the desired strains of streptococcus and spread the bacteria completely across the agar surface using a sterile spreader. Incubate the plates at 37 °C in a candle jar overnight (~18 h). As a control, seed three 35 mm x 10 mm NGM plates with 80 µL of overnight grown cultures of E. coli OP50. Incubate these plates at 37 °C for ~18 h.\nThe next day, remove plates from the candle jar and allow the plates to cool to RT for 10-15 min. Wash L4 larvae using M9W from NGM and NGM RNAi feeding plates. Collect the worms in 15 mL conical tubes.\nSpin the tubes at 450 x g for 1 min. Decant the supernatant and add 10 mL of M9W.\nRepeat step 9.3 three more times.\nResuspend the worms in ~250 µL of M9W and place three 5 µL drops of the worm suspension onto a clean Petri dish lid and estimate the number of worms per µL using a dissecting microscope.\nAdd ~100 L4 larvae to each THY streptococcus seeded and NGM E. coli seeded plates. Use three plates per strain of bacteria. Incubate the plates for 2 to 3 h at 25 °C.",
    "Thereafter, remove the plates from the incubator, wash them with M9W, and collect the worms in 15 mL conical tubes.\nWash the worms 3x as described in steps 9.3.\nRemove most of the M9W by aspiration and add 500 µL of M9W containing 2 mM sodium azide or 2 mM tetramisole hydrochloride to the worm pellet. This will anesthetize the worms, ensuring that no movement occurs when imaged under the microscope.\nCAUTION: Use personal protective equipment (PPE) when handling sodium azide. Prepare the azide solution under a chemical hood.\nIncubate the worm pellets at RT for 15 min. Then, spot 15 µL of the worm suspension onto a prepared agarose pad. Gently place a no. 1.5 coverslip over the agarose pad containing the anesthetized worms.\nUsing a fluorescent microscope, visualize the localization of SKN-1 utilizing FITC and DAPI filters.Image worms at 10x and 20x magnifications.\nScore the worms based on the level of localization of SKN-1. No nuclear localization, localization of SKN-1B/C::GFP in the anterior or posterior of the worm, and nuclear localization of SKN-1B/C::GFP in all intestinal cells are categorized as low, medium, and high levels of localization, respectively.\nAfter scoring the fluorescent micrographs, determine the statistical differences by chi- squared and Fisher's exact tests using statistical software.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}