{
  "id": 13460,
  "origin_website": "Jove",
  "title": "A Rapid and Efficient Method to Dissect Pupal Wings of Drosophila Suitable for Immunodetections or PCR Assays",
  "procedures": [
    "Day 1\n1. Collection and culturing pupae.\nRemove 0 h after puparium formation (APF) or prepupae using a wet paintbrush from cultured vials and place them in new vials to almost complete the development period (see 2.1 and 2.2).\nNote: A healthy population of flies should be maintained using standard culturing protocols. After three or four days in which the eggs are laid, the adults can be removed from vials to allow an optimal development of the individuals. They are maintained at a constant temperature until the third instar larvae initiate pupation. The larval/pupal transition is marked by the formation of the prepupa considered the 0 h APF. The prepupa is an immobile white larva that has an oblong, round shape with protruding anterior spiracles.\nDay 2\n2. Transfer, dissection and fixation.\nTransfer the pupae (2 h before the development time is complete) with a paintbrush, to the microscope slide with double-sided tape adhered to it. Position the pupae to form a row with dorsal sides up and cephalic ends facing the same direction.\nReturn the microscope slide to constant temperature and allow the pupae to complete the appropriate developmental time (i.e. 24-30 h APF).\nNote: The microscope slide with the double-sided tape will be a transitory dissection platform to remove the pupal case (see below). The time lapse on the microscope slide (outside the vial) helps to dry the pupal case making it easily breakable with forceps.\nRemove the operculum from the pupal case using forceps.",
    "Break the case with forceps (as shown in the video) making a line along the side of the pupa to the caudal end of it. With the appropriate illumination it is possible to detect the internal shape of the pupa making evident a space just above the hinge of the pupal wing. This space serves as a guide to perform the opening without damaging the pupa.\nRemove portions of the case, picking them up by the opened border and carrying them to the opposite side where the double-sided tape will hold them. At the end of the dissection the pupae will be almost \"naked\", only a small piece of the case will be covering the posterior tip.\n\tNote: The purpose of leaving a small amount of case on the upper caudal end is to ensure a smooth release from the case onto the slide with the double-sided tape. Reasoning behind this action is because if you remove too much of the case you greatly risk damaging the pupa. On the other hand if you remove too little, the pupa will not easily come free of the case.\nPush down (with forceps) the remainder of the case. This movement will raise the anterior end of the pupa, allowing both the head and thorax to stay in a preferential position to adhere and to be transferred in the subsequent step.\nTake a new slide with double-sided tape and invert it on the pupa or pupae row. We recommend performing this approach by observing the movements with the aid of the stereomicroscope to prevent breakage of the pupae.",
    "Press slightly to make the pupae stick to the tape and gently glide the slide in order to remove the pupae from the rest of the cases. Invert the microscope slide: the pupae will be stuck on the dorsal side at the level of their head / thorax area.\nCover all the naked pupae with 4% paraformaldehyde and wait 10 min. In our experience, this lapse of time with the fixative helps to change the consistency of the cuticle making it firm, less sticky and easy to handle.\nNote: To perform the ribonucleic acid (RNA) extraction, substitute paraformaldehyde for phosphate-buffered saline (PBS) made with RNase free water and remove the pupal wings making a cut (with the aid of scissors) near the hinge point of each appendage. Using forceps, transfer the pupal wing to a microcentrifuge tube with 1 mL of guanidinium thiocyanate and phenol reagent. After collecting a total of 50-80 wings, store the microcentrifuge tube at -80 °C until performing the RNA extraction10,11.\nMake a small incision at the hinge region of the wing or near it. Allow the fixative to reach the wing epithelium. Using a pipette (p200) flush fixative over the wing. When flushing replace the contaminated fixate with new. After flushing, keep wing in fixative for 5 min.\nNote: Although this maneuver helps to clear away the majority of the contaminating tissue, some hemocytes and fat droplets can remain trapped in between the dorsal and ventral epithelial layers of the wing (see Figure 1A).\nTear with forceps from the cuticle borders (as shown in the video) expanding the hole and enabling the release of the wing epithelium from the cuticle sac. Once the wing tissue is released, leave it in the paraformaldehyde solution to complete 30 min of fixation.",
    "Transfer the fixed wings to a one 4-welled plastic dish filled with PBST (Triton X-100 0.05%). Store overnight at 4 °C.\nDay 3\n3. Primary antibody incubation.\nPermeabilize the tissue incubating the pupal wings in PBST (Triton X-100 0.2%) for 15 min using a rocking platform to facilitate a gentle liquid medium movement.\nNote: Until mounting the samples, the steps should be performed using a rocking platform.\nBlock the samples using PBSTA (BSA 3%, Triton X-100 0.1%) for 1 h.\nUse the same buffer to dilute the primary antibody (mouse anti-Ptc, 1:100) and incubate the pupal wings overnight at 4 °C.\nDay 4\n4. Secondary antibody incubation.\nWash samples 4 x 10 min each with PBST (Triton X-100 0.05%)\nIncubate with secondary antibody (e.g., anti-mouse conjugated to fluorochrome) diluted to appropriate concentration in PBSTA (BSA 3%, Triton X-100 0.1%) at room temperature in the dark, for 2 h.\nNote: If it is appropriate, use 4',6-diamidino-2-phenylindole (DAPI) and/or phalloidin to counterstain the tissue. Add these probes with the secondary antibody taking into account the emission wavelength of the fluorochromes to prevent the overlap of signals.\nWash samples 4 x 10 min each with PBST (Triton X-100 0.05%)\n5. Mounting\nPrepare a sample slide by placing 4 dots of transparent nail polish on the microscope slide as if they were the vertices of a square. They will be the points where the coverslips will rest, helping to avoid crushing the tissue.\nPlace 30 µL of mounting media (glycerol/Tris-HCl 80%) in the center of the square of the dots made with nail polish without touching any of the corners (dots). Take a pipette with a yellow cropped tip, load some mounting media and then draw in several pupal wings.",
    "Transfer pupal wings to the dot of mounting media on the microscope slide. With the aid of a tip, spread the mounting media and sink the pupal wings to prevent them from floating. The morphology of the tissue will be kept if the wings remain flat when the cover glass is placed on. Before placing the cover glass, remove air bubbles.\nLower the coverslip onto the samples trying to prevent the generation of air bubbles. This movement can be done with the aid of forceps.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}