{
  "id": 18572,
  "origin_website": "Jove",
  "title": "Induction and Assessment of Ischemia-reperfusion Injury in Langendorff-perfused Rat Hearts",
  "procedures": [
    "All procedures listed here have been approved by the Institutional Animal Care and Use Committee at the Medical University of South Carolina. The experiments described here are acute, non-survival experiments. As such, there is no use of eye ointment and a sterile operating suite is not required. Euthanasia is achieved by exsanguination during harvesting of the heart.\n1. Experimental Preparation\nSet up either a constant pressure or constant flow Langendorff Perfusion Apparatus4.\nPrepare 4 L of modified Krebs Henseleit Buffer (in mM: 112 NaCl, 5 KCl, 1.2 MgSO4, 1 K2HPO4, 1.25 CaCl2, 25 NaHCO3, 11 D-glucose, 0.2 octanoic acid, pH = 7.4).\n\t\nMake 10x stock buffers.\n\t\t\nDissolve NaCl, KCl, MgSO4, and K2HPO4 in 3 L ultrapure water.\nDissolve CaCl2 in 500 ml ultrapure water with 40 ml of 1 N HCl.\nSlowly add CaCl2 solution to the buffer made in 1.2.1.1. Add enough ultrapure water to total 4 L. Allow to stir for 1 hr before filtering through a 0.8 µm filter. Store at 4 °C.\nDissolve NaHCO3 in 4 L ultrapure water. Allow to stir for 1 hr before filtering through at 0.8 µm filter. Store at 4 °C\nCombine 400 ml 10x Krebs Henseleit buffer with 400 ml 10x NaHCO3 buffer. Add enough ultrapure water to total 4 L. Dissolve glucose and octanoic acid while stirring. Filter through 0.8 µm filter.\nPrepare system for heart.\n\t\nAdd 2 L of filtered buffer to a 4 L bottle placed 38 in above the stopcock attached to the aortic cannula. This will deliver a perfusion pressure of 70-80 mmHg to the heart, which is the recommended perfusion pressure4.\nInsert gas dispersion bubbler into the buffer in the bottle.\nRun the buffer through the system, being sure to eliminate any bubbles from inside the tubing.",
    "Turn on gas (95% O2/5% CO2) at least 30 min before heart is to be placed on the system. Use a gas flow probe and blood gas analyzer to verify oxygen saturation.\nPrepare surgical supplies and balloon.\n\t\nFor harvesting of heart, prepare one pair of 6.75” surgical scissors, one pair of 4.5” scissors, two pairs of hemostats, two sets of caramalt forceps, two syringes with 27 G needles, 2 pieces of 0-guage silk suture (about 15 cm in length), one 1/16 inch barbed cannula, and one tracheal cannula.\nTo assemble tracheal cannula, glue a short piece of 1/16 inch diameter plastic tubing to a Y-connector.\nTo assemble balloon apparatus: attach a gavage needle to a piece of 1/16 inch tubing, then attach tubing to pressure transducer housing. A small syringe attached to the other side of the pressure transducer housing will allow inflation and deflation of the balloon.\n\t\t\nCut a square of plastic wrap and place tip of a gavage needle in the center. Wrap the plastic wrap around the gavage needle.\nFill balloon with saline and tie off with two sutures. Inflate balloon to ensure there are no leaks. The volume of saline within the inflated balloon should be roughly 200 µl, but can vary depending on the size of the rat.\nAlternatively, use a latex finger cot in place of the plastic wrap. Place gavage needle within finger cot, fill with saline and tie off.\n2. Harvest the heart\nRestrain a Sprague Dawley rat using a decapicone or other manual restraint device. Weigh rat.\nAdminister ketamine/xylazine mixture (0.85 mg/kg ketamine and 0.15 mg/kg xylazine) via intraperitoneal injection to anesthetize rat.  This dose of anesthetic will provide sufficient anesthesia for 20-40 min, but the procedure should be completed as quickly as possible after anesthesia is confirmed.",
    "Confirm proper degree of anesthesia by testing toe pinch reflex.\nTracheotomy\n\t\nRemove pelt from mid-forepaw to base of jaw, using hemostats to elevate pelt and scissors to make incision. Keep the pelt elevated to separate it from the underlying muscle, allowing one to cut along the pelt and remove it.\nUsing hemostats, lift glandular tissue and make a horizontal incision in fascia inferior to the glandular tissue. Use hemostats to spread incision open, taking care not to nick the jugular veins.\nUsing hemostats, pinch muscle overlying trachea, and using scissors make a transverse incision in the muscle just below the tip of the hemostats. Using hemostats, spread tissue apart to reveal trachea.\nCarefully insert hemostats under trachea, clearing fascia while progressing by gently advancing and retracting hemostats.\nOnce hemostats are successfully placed behind the trachea, pinch 0-0 silk suture with hemostats and hemisect the trachea with a small, sharp pair of scissors.\nInsert tracheal cannula into the hemisected trachea, pull suture behind the trachea, and tie the suture around the cannulated trachea, anchoring the suture to the Y-groin of the cannula with a surgeons knot.\nUsing a 27 G needle, inject 1,000 U/kg heparin into the jugular vein and allow to circulate for 30 sec.\nThoracotomy\n\t\nRemove pelt from mid-abdomen to mid-forepaw region by pinching with hemostats and cutting with scissors.\nMake a ¾ inch transverse incision into the abdominal muscle wall, just below the diaphragm.\nMake a vertical incision up the abdominal wall and chest wall, cutting along the sternum.\nCut the diaphragm back bilaterally, then spread ribcage to reveal heart, clamp ribcage with hemostats to ensure it remains spread.\nUsing hemostats, gently remove thymus, exposing the ascending aorta.\nTease hemostats through aortic loop, advancing and retracting hemostats and gently spreading fascia to allow tip of hemostats through.",
    "Use hemostats to pull 0-0 silk suture behind ascending aorta, tie suture into a loose half-square knot.\nTurn stopcock to start flow of perfusion buffer, hemisect aorta and immediately insert cannula into aortic lumen. Rapidly cinch a half-square knot and complete the knot, tightening thoroughly.\nUse scissors to dissect heart away from the great vessels, remove heart from chest and attach to perfusion column.\nTrim away excess lung tissue and allow heart to equilibrate on column for about 15 min before insertion of balloon. Use a normal flow rate of buffer through the heart of 10-20 ml/min.\n3. Langendorff Perfusion and Ischemia Reperfusion Injury\nPlacement of LV pressure balloon\n\t\nDeflate balloon while rolling into a cone shape and turn stopcock to ensure balloon remains deflated.\nExcise left atrium with a small pair of scissors to expose access to mitral valve.\nInsert balloon through left atrium and mitral valve into left ventricle.\nStart pressure monitoring software (LabChart Pro).\nInflate balloon by opening stopcock and gently increasing amount of saline in balloon until diastolic pressure reading from micromanometer exceeds zero.\nTo check length-tension response, inflate balloon slowly to a diastolic pressure of 75 mmHg, deflate slowly, repeat once.\nSet diastolic pressure to 10 mmHg by modulating the amount of saline in the balloon. Turn stopcock to seal balloon at this level of inflation, and maintain closed pressure system between LV balloon and pressure transducer.\nLower heart into heated chamber and cover chamber with plastic.\nAdministration of Ischemia Reperfusion Injury\n\t\nPlug the bottom of the heated chamber and allow chamber to fill with effused buffer.\nWhen buffer has submerged heart, turn stopcock to stop the flow of buffer into the heart, inducing global ischemia. Ischemia time can vary depending on the goals of the experiment.",
    "After 30 min of ischemia, turn stopcock to restore flow of buffer into heart, initiating reperfusion.\nAllow reperfusion of heart for 1 hr before terminating the experiment. Use variable reperfusion times, depending on the goals of the experiment.\nTermination of Experiment and Harvesting of Tissue\n\t\nUsing side port of stopcock, administer 10 ml of phosphate buffered saline at 4 °C into the heart at a rate of 10 ml/min to arrest the heart.\nRemove heart from perfusion column, trim away remaining atrial tissue.\nPlace heart into a stainless steel tissue slicing matrix, cover with Parafilm, and place at -80 °C for 8 min, or until the heart has a marshmallow-like consistency.\nRemove block from freezer and insert razorblades into slicing matrix to slice heart into 2 mm slices. Tissue blocks can also be purchased with slice sizes other than 2 mm.\nRemove slices one at a time and drop into liquid nitrogen to flash freeze for biochemical studies. Retain the third ventricular slice from the apex for infarct staining.\nRemove tissue from liquid nitrogen and store at -80 °C until use in biochemical experiments.\nInfarct Staining\n\t\nIncubate the third ventricular slice in 10 ml of 1% w/v triphenyltetrazolium chloride (TTC) at 37 °C for 15 min.\n\t\tNote: Incubation in TTC can be performed for 15 or 30 min with no change in effectiveness15.\nTransfer tissue slice from TTC to 10% buffered formalin and allow to incubate at room temperature overnight. For optimal results, hearts should be taken out of formalin and imaged within 24 hr4.\nPhotograph stained slice and use software such as ImageJ to estimate infarct size according to manufacturer’s protocol. Take photographs as soon as possible after fixation, as the dye will fade over time.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}