{
  "id": 10588,
  "origin_website": "Jove",
  "title": "Subject-specific Musculoskeletal Model for Studying Bone Strain During Dynamic Motion",
  "procedures": [
    "The experiment was conducted under the Helsinki Declaration. Prior to data collection, the subject reviewed and signed the consent form approved by the University Institutional Review Board before participating in the study.\n1. CT Imaging Protocol\nTake the participant to a facility where a CT scanner is housed. Prior to the CT scan, configure the CT machine with the following parameters: CT slice thickness of 0.625 mm, CT field of view of 15 cm x 15 cm, and auto setting for parameters of peak kilo-voltage (kVp) and milliampere-seconds (mAs) using machine algorithm.\nAsk the participant to lie on a table that slides into a ring in the CT scanner. Ask the participant to remain very still during the CT scan. Scan each leg separately from the calcaneus through the distal end of the femur.\nUpon completion of the CT scan, export the CT images in a digital imaging and communications in medicine (DICOM) format. Choose an image size of 512 x 512 pixels (gray scale).\n\tNOTE: The CT imaging protocol normally lasts less than 1 h. The radiation dose is minimal. It presents no greater risk than the that encountered during normal X-ray medical procedures.\n2. Anthropometric Measurement Protocol\nDuring the laboratory visit, prior to motion capture, measure the participant's body mass (kg), body height (mm), distance between the anterior-superior iliac spines (ASISs) (mm), leg length (mm), knee joint width (mm), and ankle joint width (mm).\nInter ASIS distance measurement: Use a caliper to measure the linear distance between the left ASIS and right ASIS.\nLeg length measurement: Use a tape measure to measure the linear distance the ASIS and medial malleolus for both legs.\nKnee joint width measurement: Use a caliper to measure the linear distance between the lateral and medial epicondyles of the femur for both knees.",
    "Ankle joint width measurement: Use a caliper to measure the linear distance between the lateral and medial malleoli for both legs.\n\tNOTE: The inter ASIS distance, leg length, knee and ankle width are used to build a subject model in a biomechanics software (see Table of Materials) for performing kinematic and kinetic calculations.\n3. Motion Capture Protocol\nNOTE: See Table of Materials for all software and tools used.\nPlacement of reflective markers\nPlace 14-mm reflective markers on the participant's body at the following anatomical bony landmarks: acromion processes, sternoclavicular joints, base of sternum, posterior process of the 10th thoracic vertebrae, ASISs, posterior-superior iliac spines (PSISs), 1.5 cm above the lateral knee joint lines, 1.5 cm above the medial knee joint lines, lateral malleoli, medial malleoli, posterior heels, bases of the second metatarsals, and bases of the fifth metatarsals.\nPlace semi-rigid plastic plates with 4-marker clusters on the thighs and shanks, respectively.\n\t\tNOTE: For a better motion capture outcome, the participant is recommended to be barefoot and wear skin-tight clothing. In addition, the marker placement procedure follows a modified \"Plug-in-Gait\" protocol21. A total of 39 reflective markers are used for the motion capture and 34 of them are attached to the lower body.\nInstruct the participant to warm up by walking on a motorized treadmill at a self-selected speed for 5 min.\nCalibration of room space for motion capture procedure\nPower on the motion capture system (12 high-speed infra-red cameras) and two force plates. Open a motion capture software program. Within the main program window, open the 'Resources' pane. Click the \"System\" tab. Configure the camera frequency at 200 Hz and force plate frequency at 2,000 Hz.",
    "Within the main program window, open the 'Tools' pane. Click the \"System Preparation\" button. Click \"Calibrate Cameras\". Click \"Start\". Ask a research staff to wave a standard 5-marker calibration wand to perform a dynamic calibration within the room space where the drop-landing movements are to be performed. Click \"Stop\" after 5 s of wand data have been acquired.\nPlace the calibration wand flat on the floor to align with a corner of a force plate for the purpose of specifying a reference location (origin) for the calibrated space. Click \"Set Volume Origin\" within the 'System Preparation' tools pane.\nParticipant preparation in motion capture software program\nWithin the main program window, open the 'Resources' pane. Click the \"Subject\" tab. Click the \"Create a new Subject from a Labeling Skeleton\" button. Select a labeling template from a list of template files provided.\nIn the 'properties' window, enter the subject's name and values of body mass (kg), body height (mm), inter-ASIS distance (mm), left and right leg length (mm), left and right knee width (mm), and left and right ankle width (mm). In the 'Subject Resources' pane, right-click the subject name and click \"Save Subject\".\nRecord a static body calibration pose\nAsk the participant to stand motionless in the middle of the calibrated room with feet shoulder width apart while extending the upper extremities laterally so that all reflective markers on the body are well exposed to cameras.\nIn the main program window, open the Tools pane. Click the \"Subject Preparation\" tab. In the Subject Capture section, click \"Start\" to record a 3-s motion trial to be the static calibration trial.\nProcedure of determining functional joint centers\nFunctional hip joint center",
    "Ask the participant to stand with one leg, and fully extend the other leg slightly forward. Instruct the participant to move the extended leg around the hip joint in the following sequence: move anteriorly and return to neutral, move anterior-laterally and return to neutral, move laterally and return to neutral, move posterior-laterally and return to neutral, move posteriorly and return to neutral, and a circumduction motion.\nWithin the main program window, open the 'Tools' pane, click the \"Capture\" tab. In the Capture section, click \"Start\" to record a motion trial for each functional hip motion.\nFunctional knee joint center\nAsk the participant to stand with one leg and maintain a 30° hip hyper-extension of the other leg. Instruct the participant to perform a 45° knee flexion with the non-weight bearing leg for 5 times.\nIn the 'Capture' section of the 'Tools' pane, click \"Start\" to record a motion trial for each functional knee motion.\n\t\t\tNOTE: For details of the functional joint procedure, please see Schwarz, et al.22\nMotion capture of drop-landing movements\nRandomize the order of using three different drop-landing heights (26 cm, 39 cm, and 52 cm)14.\nPlace the height adjusted wood box with a top surface area of 50 x 50 cm2 on the floor covered by a rubber mat. The wood box is 11 cm from edges of the force plates. Ask the participant to stand on the box surface.\nInstruct the participant to extend their dominant foot directly in front of the box and shift their weight forward, and step off from the box. Ask the participant to land with both legs on the ground at the same time with each foot on a separate force plate.",
    "Ask the participant to remain standing until the motion capture of the trial is completed. Repeat the motion capture three times to collect three motion trials for each height.\nMotion capture data processing\nOpen a motion capture software program. Within the main window of the program, go to the 'Communications' pane. Click the \"Data Management\" tab. Select one of the recorded motion trials and open it in the program.\nIn the 'Tools' pane, click the \"Pipeline\" tab. From the 'Current Pipeline' list, select the \"Reconstruct\" pipeline. Click the \"Run\" button to start the reconstruction process to obtain three-dimension (3D) trajectories of reflective markers.\nIn the 'Tools' pane, click the \"Label/Edit\" tab. In the 'Manual Labeling' section, select individual marker names and label the corresponding 3D trajectories. Click the \"Save\" button of the toolbar when labeling is completed.\nIn the 'Tools' pane, click the \"Pipeline\" tab. In the 'Available Operations' section, select \"File Export\". Double-click \"Export C3D pipeline\". Click the \"Run\" button to export the processed motion trial to a file in a coordinate three-dimension (C3D) format.\nBiomechanical analysis of motion capture data\nOpen a biomechanics software program to further process the motion capture data. From the top menu, click \"File\" and click the \"Open/Add\" button. Select the raw C3D files to import into the biomechanics software program.\nFrom the top menu, click \"Model\". Click \"Create (Add Static Calibration File)\". From the sub menu, select \"Hybrid Model from C3DFile\". Select and open the static calibration C3D file.\nFrom the top menu, click \"Model\". From the drop-down list, click \"Apply Model Template\". Select and open a model template file. Click the \"Models\" tab on the tool bar. Click the \"Subject Data / Metrics\" tab. Within the 'Subject Data' window, modify the values of 'Mass' and 'Height' to make the model subject-specific.",
    "Click the \"Models\" tab on the tool bar. Click the \"Model Builder Advanced Post Processing\" button of the top menu bar. In the pop-up window of the \"Model Builder Advanced Post Processing\", click the \"Functional Joints\" tab. Select \"Add Motion File From Workspace\".\nSelect the functional joint center C3D files. Highlight an imported functional joint file. Highlight a functional joint matching the file. Use the \"Set START Frame to Current Frame\" and \"Set END Frame to Current Frame\" to select the appropriate portions of the motion trial. Click the \"Compute Checked Landmarks\" button. Repeat this process to calculate other functional joint centers to refine the skeletal model.\nClick the \"Model\" button on the top menu bar. Select \"Assign Model to Motion Files\". In the pop-up window of the \"Assign Models to Motion Data\", apply the subject-specific skeletal model to all motion trials.\nClick the \"Pipeline\" button of the tool bar. In the pop-up window of the \"Pipeline Workshop\", click the \"Open Pipeline\" button. Select the \"Filtering Targets Pipeline\". Click the \"Execute Pipeline\" button to perform a fourth-order low-pass Butterworth filter with cutoff frequency of 10 Hz on 3D trajectories of motion capture trials.\nClick the \"Pipeline\" button of the tool bar. In the pop-up window of the \"Pipeline Workshop\", click the \"Open Pipeline\" button. Select the \"Filtering Forces Pipeline\". Click the \"Execute Pipeline\" button to perform a fourth-order low-pass Butterworth filter with cutoff frequency of 60 Hz on ground reaction forces of motion capture trials.\nClick the \"Settings\" button of the top menu bar. Place check marks next to \"Use Processed Analogs for Ground Reaction Force Calculations\" and \"Use Processed Targets for Model/Segment/LinkModelBased Items\".",
    "Click the \"Pipeline\" button of the tool bar. In the pop-up window of the \"Pipeline Workshop\", click the \"Open Pipeline\" button. Select the \"Model Based Calculation\" pipeline. Click the \"Execute Pipeline\" button to perform calculations of lower-body joint kinematics and kinetics.\nClick the \"Pipeline\" button of the tool bar. In the pop-up window of the \"Pipeline Workshop\", click the \"Open Pipeline\" button. Select the \"Export C3D Coordinates\" pipeline. Click the \"Execute Pipeline\" button to export the processed 3D coordinates of lower-body visual markers in a C3D file.\nClick the \"Pipeline\" button of the tool bar. In the pop-up window of the \"Pipeline Workshop\", click the \"Open Pipeline\" button. Select the \"Export Ground Reaction Forces\" pipeline. Click the \"Execute Pipeline\" button to export the processed 3D ground reaction forces in a binary file (file extension: MAT).\n\t\tNOTE: To preserve the high impact peaks during landings, a cutoff frequency of 60 Hz is used to filter the raw ground reaction force data23.\nPreparing motion capture data for computer simulations\nOpen a computer programming software. Import the filtered C3D data file and the MAT data file.\nExport a text file containing lower-body joint center coordinates. Convert the C3D data file and the MAT data file into text files (file extension: slf) for use by a multibody dynamic simulation program.\n4. Subject Specific Modeling Procedure\nCreating lower-body skeletal model\nOpen the multibody dynamic simulation software program with the human body modeling plug-in installed. During this process, the human body modeling plug-in module is automatically opened. Within the splash screen, double-click the \"New Model\" icon to open the model building control panel.",
    "Within the main modeling panel, in the \"Anthropometric Database Library\" section, choose the generic body (GeBOD) from the drop-down list. Within the main modeling panel, specify body mass (kg), body height (mm), gender, and age (months).\nWithin the main modeling panel, in the \"Body Configuration\" section, click the \"Lower Body\" radio button. From the \"Units\" drop-down list, select \"Millimeter Kilogram Newton\". Within the main modeling panel, click the \"Apply\" button in the \"Create Body Measurement Table\" section to accept the body measurements. Continue to click the \"Apply\" button in the \"Create Human Segments\" section to create a lower-body skeletal base model.\n\t\tNOTE: This model is scaled based on the individual's height, mass, age, and gender. The model consists of seven segments: a pelvis, two thighs, two shanks, and two feet (Figure 1). All of the segments are modeled as rigid bodies.\nModeling lower-body joints\nWithin the main modeling panel, from the main menu drop-down list, select \"Joints\" to open the joint configuration panel.\nWithin the joint configuration panel, in the \"JOINT ROTATION ELEMENTS\" section, click the button next to the \"Prepare Model with Recording Joints\". In the \"Spring Dampers and Joint Limits Properties\" section, enter the following parameters: Nominal Joint Stiffness of 1 Nmm/°, Nominal Joint Damping of 0.1 Nmm∙s/°, Joint Stop Stiffness of 3.38E7 Nmm/°. Continue to select \"Left Leg\" and \"Right Leg\" by checking the radio buttons next to the names. Click the \"Apply\" button to accept the joint configurations.\nWithin the main modeling panel, from the drop-down list of the main menu, select \"Workflow\". From the drop-down list of the sub-menu, select \"Gait\" and \"Calibrate\". In the \"Joint Center Data\" section, enter the participant's lower-body joint center file.",
    "Click the \"Load\" button to import the data to modify the locations of joint centers. In the \"Load Static Trial\" section, enter the static calibration motion capture trial (in slf file format, generation described in steps 3.8-3.10). Click the \"Load\" button to import the file to parameterize the lower-body skeletal model.\n\t\tNOTE: By default, the hip joints are configured as spherical joints with three degrees of freedom, knee joints are configured as revolute joints with one degree of freedom, and ankle joints are configured as universal joints with two degrees of freedom.\nModeling skeletal muscles\nWithin the main modeling panel, from the drop-down list of the main menu, select \"Soft Tissues\". From the drop-down list of the sub-menu, select \"Create Base Tissue Set\". In the \"MUSCLE CONTRACTILE ELEMENTS\" section, click \"Prepare Model with Recording Muscle Elements\".\nIn the \"GLOBAL RECORDING ELEMENT MUSCLE PROPERTIES\" section, click the radio button of the \"Updated 45 Muscle Set\".\nIn the \"GLOBAL RECORDING ELEMENT MUSCLE PROPERTIES\" section, accept the following default settings for muscle properties: Passive Stiffness of 0.4448 N/mm, Passive Damping of 1.75 E-2 Ns/mm, Muscle Resting Load of 0.4448 N. Check the radio buttons of \"Left Leg\" and \"Right Leg\" for muscle assignments. Click the \"Apply\" button to accept the configurations.\n\t\tNOTE: The 45 Leg Muscle set includes the following muscles: Adductor Brevis, Adductor Longus, Adductor Magnus (three groups), Biceps Femoris Long Head, Biceps Femoris Short Head, Extensor Digitorum, Extensor Hallucis, Flexor Digitorum, Flexor Hallucis, Gastrocnemius, Gemellus, Gluteus Maximus (three groups), Gluteus Medias (three groups), Gluteus Minimis (three groups), Gracilis, Hamstring, Iliacus, Lateral Gastrocnemius, Medial Gastrocnemius, Pectineus, Peroneus Brevis, Peroneus Longus, Peroneus Tertius, Piriformis, Psoas, Quadriceps Femoris, Rectus Femoris, Sartorius, Semimembranosus, Semitendinosus, Soleus, Tensor Fasciae Latae, Tibialis Anterior, Tibialis Posterior, Vastus Intermedius, Vastus Lateralis, Vastus Medialis.\n5. Multi-body Dynamics Simulations",
    "Performing inverse kinematic simulation\nWithin the main modeling panel, from the drop-down list of the main menu, select \"Workflow\". From the drop-down list of the sub-menu, select \"Gait\" and \"Trial\". In the \"Dynamic Trial Data\" section, enter the file name of a dynamic motion capture trial (in slf file format) and click the \"Load\" button to import the data. Continue to enter the corresponding ground reaction force data file (in slf file format) and click the \"Load\" button to import the data.\nWithin the main modeling panel, from the drop-down list of the main menu, select \"_Analyze\". Run the Reparameterize Analysis to adjust the model posture to match the posture in the beginning of the dynamic trial.\nOpen the Simulation panel. Disable the effects of gravity and ground reaction forces. Choose the whole motion trial as the length of the simulation.\nSpecify a simulation time step of 100 steps/s. Run an inverse kinematic simulation driven by the motion capture data. Save the inverse kinematic simulation analysis.\nCreating a motion tracker agent\nOpen the Motion Tracker Agent Creation panel. Accept the default tracker name: MA_Track.\nSet the Translational Stiffness and Rotational Stiffness as 10 N/mm and 1,000 Nmm/°, respectively. Set the Translational Damping and Rotational Damping as 10 Ns/mm and 1,000 Nmms/°, respectively. Set all translational and rotational degrees of freedom as Driven.\nNote. As only the lower-body model is used for the forward dynamic simulation, a motion tracker is necessary to account for the instability due to the lack of upper body motion.\nTraining leg muscles\nOpen the Soft Tissues configuration panel. Choose Closed-loop Simple for the muscle model. Set the following parameters for the muscle model: Proportional Gain of 1.0E6, Integral Gain of 1.0E6, and Derivative Gain of 1.0E4.",
    "Select the inverse kinematic simulation analysis to be the target of the muscle training. Apply the muscle training.\nImporting a flexible tibia\nOpen the Flexible Body Import panel. Perform the Alignment Mapping with three known makers and their corresponding nodes on the surface of the flexible tibia.\nChoose the rigid tibia to be replaced by the flexible tibia. Select the MNF file representing the flexible tibia. Select the muscle attachment mapping file for reattaching leg muscles to the flexible tibia. Import the flexible tibia to the musculoskeletal model.\nPerforming forward dynamic simulation with the flexible tibia in place\nOpen the Simulation panel. Enable the effects of gravity and ground reaction forces. Disable the effects of motion agents.\nChoose to run the simulation for the length of the whole motion trial. Set simulation time step of 100 steps/s. Run a forward dynamic simulation driven by trained muscles. Save the forward dynamic analysis.\n6. Creating a Flexible Tibia Model\nCreating a 3D surface mesh model\nOpen an image processing program. Import CT slices in the DICOM format. Create a mask using the region growing method to separate bone tissue from the surrounding soft tissues.\nSearch for CT slices where the tibia and fibula are connected. Separate the tibia and fibula by erasing the mask along the conjunction of the two bones.\nCreate a second mask using the region growing method to only include the tibia bone. Go through the CT slices to uncover cavities existing in the tibia mask. Fill the cavities in the mask. Create a 3D tibia object based on the tibia mask. Export the 3D tibia object as a file in drawing interchange format (DXF).\nCreating a finite element tibia model\nOpen a FE analysis software program. Import the 3D tibia model file with the DXF extension.",
    "Perform the Sweep command to remove duplicated elements and nodes. Perform the Volume Mesh command to create a FE tibia model with hexagonal elements of 3 mm x 3 mm x 3 mm. Assign the following material properties to all elements: Young's modulus of 17 GPa, Poisson's ratio of 0.3, and density of 1.9E-6 Kg/cm3.\n\t\tNOTE: Material properties are assigned to each element with the assumption that bone tissue is isotropic within the ranges of strain experienced by bone during dynamic motions24,25,26.\nCreating a flexible tibia model\nWithin the main control panel, click the \"Geometry & Mesh\" tab. Select \"Geometry & Mesh\". In the \"Geometry & Mesh\" pop-up window, in the \"Mesh\" section, click \"Add nodes\" to create two new nodes to represent the centers of the knee and ankle joints.\nIn the main control panel, click the \"Links\" tab. Select RBE2's. In the RBE2's pop-up window, create link connections of type 2 rigid body element (RBE2) between the joint nodes and surface nodes on the knee and ankle surfaces.\nIn the main control panel, click the \"Boundary Conditions\" tab. In the \"Boundary Conditions\" section, click the \"New\" button. Select \"DOF_Set Nodes\". In the \"Boundary Condition Properties\" pop-up window, create a boundary condition by assigning six degrees of freedom to each of the two RBE2 joint nodes.\nIn the main control panel, click the \"Loadcases\" tab. In the \"Loadcases\" section, click \"New\", select \"Adams Craig-Bampton\"19. In the \"Loadcase Properties\" pop-up window, click \"DOF-Set Nodes\". Select the dofset_nodes created in the above step.",
    "In the main control panel, click the \"Jobs\" tab. In the \"Jobs\" section, click \"New\". Select \"Structural\". In the \"Job Properties\" pop-up window, select the loadcase created in the previous step. Click the \"Job Results\" button. In the \"Results\" pop-up window, select \"Stress\" and \"Strain\". Also select \"Kilogram\" for Mass, \"Newton\" for Force, \"Millimeter\" for Length, and \"Second\" for Time. Click the \"Run\" button.\nIn the \"Run Job\" pop-up window, click the \"Submit\" button to submit the job for a FE simulation and to create the modal neutral file (MNF) of the tibia16.\n7. Strain Data Analyses\nExporting bone strain data\nOpen the post processor of the multibody simulation program. Load the Durability plug-in program.\nOpen the simulation with the flexible tibia by clicking the simulation name. Export the maximum and minimum principal strains and maximum shear strain of the nodes representing the antero-medial aspect of the mid-tibial diaphysis.\nProcessing raw strain data\nOpen a computer programming software for data processing. Import raw strain data. Apply a fourth order low-pass Butterworth filter to the raw data with a cutoff frequency of 15 Hz.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}