{
  "id": 9255,
  "origin_website": "Jove",
  "title": "Long-term Time Lapse Imaging of Mouse Cochlear Explants",
  "procedures": [
    "Mouse tissue was harvested from Sox2EGFP-reporter mice12 maintained and euthanized in accordance with Canadian Council on Animal Care guidelines for the care and use of laboratory animals.\n1. Culturing Embryonic Cochleae\nSupplement Dulbecco’s Modified Eagle Medium (DMEM) by mixing 8.89 ml of DMEM, 1 ml of fetal bovine serum (FBS), 100 μl of 100x N2 supplement, and 10 μl of 10 mg/ml ciprofloxacin. Supplement Hank’s Balanced Salt Solution (HBSS) by mixing 495 ml HBSS with 5 ml of 100% HEPES.\nPrepare glass bottom culture dishes:\n\t\nIn a laminar flow hood, resuspend 200 µl basement membrane extract substrate in 5 ml DMEM. Prepare 35 mm diameter glass bottom culture dishes with 10 mm wells. Pipette 150 µl substrate/DMEM in to the center of each glass bottomed dish. These dishes can be used after 40 min incubation, or can stored in a CO2 incubator at 35 °C for at least a week.\n\t\tNOTE: Glass bottomed dishes are used for the following reasons: to ensure that the base of the dish is transparent and suitable for imaging, to create a well in the center of the dish that allows the explants to settle in an easily located area and finally so that after an experiment the sample can be processed for immunostaining and subsequent analysis.\nPrepare the work-station and tools:\n\t\nTurn on the laminar flow clean bench, and spray down with 70% EtOH to create a clean work space. Soak forceps, spoons, and a black 184 silicone elastomer dish (a mix of 184 silicone elastomer (10 parts), curing agent (1 part) and charcoal powder (2.5 g)) in 70% EtOH.\nIn the clean work station, harvest embryos for the experiment. Collect embryos of the appropriate gestation in ice cold HBSS supplemented with 1% HEPES.",
    "Determine an external or visible organ that will demonstrate reporter activity and examine the embryos using a fluorescent stereo microscope. Collect the embryos that exhibit reporter activity in ice cold HBSS supplemented with 1% HEPES as these are the subject of the experiment.\nCollect temporal bones:\n\t\nWorking quickly, using a cool light source and fine forceps, collect the heads of the pups. Take care to clip at the cervical vertebrae and below the jaw to avoid damage to the temporal bones.\nCarefully open the skull. Remove the brain, trim off the front of the head, and transfer the posterior skull to fresh ice cold HBSS supplemented with 1% HEPES in a clean dish. Carefully dissect out the peanut shaped temporal bones taking care to keep the vestibular system in tact.\nDissect the cochlea:\n\t\nTransfer the temporal bones to a black silicone elastomer coated dish in ice cold HBSS supplemented with 1% HEPES, pin the vestibular region of the bone. Insert insect pins at an oblique angle in order to stabilize the temporal bone and create room for the forceps. Pinning is a crucial step in the process as if the temporal bone is allowed to move too much it is very difficult to harvest an intact cochlea.\nCarefully remove the cartilage surrounding the cochlea. Insert one tine of the forceps into the cartilage at the outer edge of the base of the cochlea and clip a hole into the cartilage.",
    "Clip a flap up the side, insert the tine of the forceps and gently separate the roof of the duct from the cartilage. Clip horizontally across the top and diagonally, and carefully lift off the front section of the capsule. Insert a prong of the forceps in between the remaining cartilage and the duct and gently clip off the last section. The apical surface of the cochlea is now exposed.\nStarting at the base, catch the area where the roof of the duct meets the cochlear epithelium and open the cochlear duct. Gently peel off the roof, trimming when necessary until it is completely removed. Trim off any portions of membrane left on the medial side of the duct. Clean the duct of excess mesenchymal tissue and detach the duct from the vestibular system.\nCulture the explants:\n\t\nPlace an explant, luminal surface up, in the center of a substrate coated glass bottom culture dish, carefully draw off all of the liquid and leave for two minutes. Add 150 µl supplemented DMEM drop-wise to the explant, taking care not to disturb it. Should the explant float free, reposition with forceps, but take care that the explant settles to the bottom of the dish so that it can attach to the substrate.\nPlace the glass bottom dishes in a deep 12 cm diameter Petri dish, with a small dish of sterile water to maintain humidity. Put the cultures in to a 35 °C incubator overnight in order for the explant to attach to the substrate and flatten.\n2. Live Imaging\nSelect explant samples. Use a fluorescent stereo microscope to evaluate the condition of each explanted cochlea. Only select explants where the duct is intact and attached to the glass from base to apex.",
    "Set the incubator at 35 °C with 5% CO2 to culture cochlear tissue. Put the cultures into the incubator microscope:\n\t\nGently aspirate off the supplemented DMEM and replace with at least 500 μl fresh media. For imaging up to 6 days, 1-1.5 ml is better. In cases where explants are loosely attached, pipette a ring of media around the edge of the dish. This extra liquid will make a miniature ‘humidified chamber’ without disturbing the explant while it continues to attach to the matrix.\n\t\t\nAlternatively, use hinged dish covers to open the lids while the dish stays in its fitting in the microscope if reagents need to be exchanged during intervals between image collections. Hinged dish covers allow the lids to be opened without disturbing the samples or removing the dishes from their settings. This maintains their exact position for subsequent image captures.\nInsert the glass bottom dishes containing appropriate samples into the sample dish holder. The microscope in this example has a rotating platform that holds eight 35 mm sample dishes.\nUnder the laminar flow hood replace the plastic lids with glass lids and insert the dishes into the sample dish holder. Place the sample dish holder inside the incubator taking care not to dislodge the explants from the bottom of the dish or to disturb the media.\nSet up the imaging routine:\n\t\nSwitch on the microscope, UV lamp and camera and open the imaging software.\nLocate the samples, pick an imaging area, plane of focus and adjust exposure times for each dish in sequence. Choose the plane of focus depending not only on the view of the explant at the time of starting, but also bearing in mind how the tissue will move and how long the time course will run.",
    "Set a Z stack centering around the selected focal plane in the fluorescence channel. Set the frequency and length of the sampling for the experiment. The frequency of sampling will be limited by the time it takes to collect images, so this should be determined after selecting fields of view and setting a Z stack. In this case sampling takes place every 30 min over five days. The duration of the experiment can be up to 14 days.\nGenerate a movie:\n\t\nAt the end of the time lapse period open the image files. In this case Metamorph software that opens sequential collection points is used. Frame by frame pick the best focal plane for showing the cell population of interest.\nConvert these images to an .avi file, or export them as a montage to generate a set of images that can be opened and analyzed in image processing software or converted to multiple formats using video processing software.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}