{
  "id": 7710,
  "origin_website": "Bio",
  "title": "Single-molecule Force Spectroscopy on Biomembrane Force Probe to Characterize Force-dependent Bond Lifetimes of Receptor–ligand Interactions on Living Cells ",
  "procedures": [
    "imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4534/bioprotoc-12-20-4534-g002.jpgFigure 2. Scheme of the functionalization of the beads and RBC SH-group modification of borosilicate glass beads Weight and suspend 50 mg glass beads into 500 μL of dH2O in a 1.5 mL tube.Add the glass beads to 5 mL of boiled cleaning buffer I and boil for 5 min in a 50 mL beaker; mix the solution every minute (Figure 2A).Warning: Handle this compound with gloves in the chemical hood. After boiling, cool for 15 min at room temperature (RT), transfer the solution into a 15 mL tube, and then centrifuge at 17,000 × g for 5 min.Remove the supernatant and resuspend glass beads with 15 mL of fresh dH2O in a clean 50 mL beaker, then continue to boil for 5 min.After boiling, transfer the bead suspension to a 15 mL tube and centrifuge at 17,000 × g for 5 min. Repeat steps A2–A5 three times.Resuspend the glass beads with 50 mL of CR buffer and rotate for 3 h at RT (Figure 2A).After the reaction, centrifuge at 17,000 × g for 5 min to discard the supernatant. Wash glass beads once with fresh methanol and discard the supernatant. Resuspend glass beads with 500 μL of methanol.Divide the glass beads into a set of 20 dry clean glass vials. Evaporate the methanol by a jet of dry argon (approximately 0.05 MPa, controlled by a pressure valve) at a 45° angle inside the vial with gently horizontal rotation for 5 min.Place the vials into a preheated drying oven at 120 °C for 5 min.After heating, take the vials out of the drying oven and quickly place them in a vacuum desiccator filled with dry argon until cooled completely for 15 min.Note: The desiccator is vacuumed with a vacuum pump and then flushed with dry argon.",
    "The MPTMS glass beads in the vial desiccated in an argon environment may be stored for up to three months at RT in a dry and dark storage box.Preparation of recombinant ligand–coated beads Take out and resuspend one vial of MPTMS glass beads with phosphate buffer (pH = 6.8) into a 1.5 mL tube, centrifuge at 17,000 × g for 5 min, discard the supernatant, and wash two more times with phosphate buffer.Resuspend the MPTMS beads with 200 μL of phosphate buffer and count the concentration of MPTMS beads with the Z2 cell counter (e.g., 3 × 108 beads/mL).Mix 200 μL of MPTMS beads with 20 μL of 4 mg/mL SA-MAL stock solution (Figure 2A).Incubate the mixture with rotation overnight at RT. Then, wash three times with phosphate buffer containing 0.5% BSA, centrifuge at 17,000 × g for 5 min, resuspend into 200 μL of phosphate buffer containing 0.5% BSA, and store at 4 °C after counting with Z2 cell counter.Mix the desired biotinylated recombinant ligand (add a series of titrations in the different tubes, such as 1, 0.1, 0.01, 0.001, and 0.0001 μg) with 2 × 105 streptavidin (SA) beads in 200 μL of PBS containing 0.5% BSA in the 1.5 mL low surface tension tube (Figure 2A).Note: For the BFP assay, the adhesion frequency should be <20% by adjusting the surface density of desired biotinylated recombinant ligand on the microspheres to ensure approximately 90% single-bond event. Incubate the mixture with rotation for 30 min at RT; then, wash three times with PBS containing 0.5% BSA, resuspend into 100 μL of PBS containing 0.5% BSA, and store at 4 °C for the BFP assay.Preparation of biotinylated RBC Take the biotin-PEG 3500-SGA out of the -20 °C fridge and leave it at RT for 30 min.",
    "Then, take out one vial (approximately 10 mL) of C buffer and one vial (approximately 15 mL) of N2 buffer from the 4 °C fridge. Preheat (37 °C) the electric-thermostatic water bath for subsequent experiments.Prepare a 1.5 mL tube containing 1 mL of C buffer. Add a big drop of blood (approximately 100 μL) to the vial from a volunteer using a finger prick, lancing device, and twist lancet (Figure 2B).Wash and centrifuge blood two times with 1 mL of C buffer for 2.5 min at 2,500 × g, and resuspend with 500 μL of C buffer.Calculate the concentration of RBC with the Z2 cell counter and prepare 3 mg/mL of biotin-PEG 3500-SGA by dissolving 3 mg biotin-PEG 3500-SGA into 1 mL of C buffer (Figure 2B).Mix 500 μL of 7.5 × 107/mL RBC suspension with 117 μL of 3 mg/mL biotin-PEG 3500-SGA in a 1.5 mL tube, add 383 μL of C buffer to get a 1 mL incubate volume, then incubate with rotation for 30 min in a 50 mL tube at RT.After the incubation, centrifuge RBC suspension for 2.5 min at 2,500 × g, wash and centrifuge two more times with 1 mL of N2 buffer for 2.5 min at 2,500 × g, and resuspend RBC with 200 μL of N2 buffer.Add 5 μL of nystatin stock solution to 500 μL of N2 buffer, add 20 μL of RBC suspension from step C6, mix thoroughly, and incubate with rotation for 1 h at 4 °C in a 1.5 mL tube (Figure 2B).Centrifuge the RBC suspension for 2.5 min at 2,500 × g, wash two times with 1 mL of N2 buffer containing 0.5% BSA (37 °C preheat), and resuspend RBC with 200 μL of N2 buffer containing 0.5% BSA.",
    "Add 5 μL of RBC solution into approximately 500 μL of receptor–ligand interaction buffer (such as RPMI-1640) and observe RBC shape (Figure 3).Note: An oval shape of RBC is appropriate, which could be adjusted by the concentration of nystatin in step C7.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20221019/20221019183923_2464.jpgFigure 3. Example of non-ideal and ideal RBC shapes. Scale bar = 2 μm.Establishment of transmembrane receptor–expressing cell line Culture 293T cells in a 10 cm dish to 80%–90% confluence, wash the cells with 2 mL of PBS, add 1 mL of trypsin to trypsinize the cells for 1 min, stop trypsinization with 5 mL of DMEM with 10% FBS, and collect the cells by centrifuging at 300 × g for 3 min.Remove the supernatant, resuspend with 2 mL of PBS, and wash once. Resuspend with 5 mL of DMEM medium and count to adjust the concentration of 293T cells to 2.5 × 106/mL.Add 2 mL of DMEM medium to each well of a 6-well plate, transfer 0.2 mL of 293T cells from step D2 to the plate, and shake well.Place the plate in a cell incubator and incubate at 37 °C with 5% CO2 overnight. After the cells are completely adherent, prepare them for transfection.Add 1 μg of lentiviral plasmid, 1 μg of psPAX2 plasmid, and 1 μg of pMD2.G plasmid to 250 μL of DMEM medium without FBS in a 1.5 mL tube. Incubate for 5 min.At the same time, add 6 μL of PEI (1 mg/mL) to another 1.5 mL tube of 250 μL of DMEM medium without FBS and incubate for 5 min.Slowly add the PEI solution to the mixed plasmid solution and incubate for 15 min.Add the mixed solution from step D7 to the 6-well plate with 293T cells and incubate at 37 °C with 5% CO2.",
    "After 48 h, collect the lentivirus in the medium, filter with a 0.45 μm filter, and store it in a -20 °C refrigerator.Prepare target cells (such as 293T or U937; the cell type can be determined according to each experiment) to be infected and add 2 mL of cells (2.5 × 106/mL) to a 6-well plate.Wait for cells to be completely adherent for approximately 24 h and add 500 μL of prepared lentivirus (for suspension cells, directly add 500 μL of prepared lentivirus).Incubate at 37 °C with 5% CO2 for 48 h and detect the expression level of the transmembrane receptor by flow cytometer.Sort the receptor-expressing cells to obtain a cell line and prepare for BFP experiment.Operation of BFP assay Put a 0.5 mm glass capillary on the glass cutter, select program, and click “start” button. The glass capillary can be heated into two capillaries with sharp tips. Through the selection of the program, obtain the appropriate capillary tips: 6–8 mm taper and 0.1–0.5 μm tip.Use the micropipette forge to melt the capillary tip and insert the tip in the glass sphere, which has been heated. Cool down the glass sphere. The capillary can break from the surface of the glass sphere. Repeat this procedure until the capillary tip orifice is appropriate (RBC is 2.0–2.2 μm and beads are approximately 1.5 μm; the capillary tip orifice depends on the size of cell diameter).Use a glass cutter to cut the cover glass into the required width (usually one-third of the glass width) and glue the cut glass to the top and bottom sides of the chamber holder, to form a parallel-coverslip cell chamber (Figure 4A).Use a 200 μL pipette to inject buffer (such as DMEM or PBS; can be changed according to experiments) in the cell chamber.",
    "Inject 5 μL of prepared target cells (approximately 104 cells), 5 μL of prepared beads, and 5 μL of prepared RBC into the cell chamber. Inject the mineral oil into the two sides of the cell chamber to prevent the volatilization of the buffer during the long-time experiment from affecting the experimental results (Figure 4B).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4534/bioprotoc-12-20-4534-g004.jpgFigure 4. Cell chamber for BFP experiments. (A) The cover glass is cut and glued to the top and bottom of the chamber holder. (B) Inject the buffer to fill the chamber, then sequentially inject the target cell, bead, and RBC; finally, seal the two sides of the cell chamber with mineral oil.Turn on the light source microscope and place the cell chamber on the microscope stage.Backfill the treated capillaries with dH2O with a micro injector and put the capillaries into the pipette holder. This process should be done quickly, ensuring that no air bubble gets into the pipette holder during the injection.Put the pipette holder on the micro-manipulator (Figure 5B). Push the micropipette towards the cell chamber, take the capillary tips into the chamber, and adjust the micropipette position to find the capillary tips under the microscope field of view.Control the water tower height of the RBC micropipette to change the pressure inside the micropipette, adjust the zero point of micropipette (no suction or blowing force to the RBC), and correct it.Move the chamber holder stage and adjust the position of the micropipette to find the target cell, bead, and RBC. Aspirate them by changing the pressure inside the micropipette, and switch the microscope field to the program’s vision field (Figure 5C and Video 1).Adjust the height of RBC and bead to ensure that they are on a uniform plane, then move the bead slowly to adhere to the RBC.",
    "Adjust the pressure and position to move the bead micropipette away (Figure 5D and Video 1).Align the target cell on the same plane as RBC and bead (Figure 5E and Video 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4534/bioprotoc-12-20-4534-g005.jpgFigure 5. Experimental setup for the BFP. (A) Setup of BFP system. (B) Move three micropipettes into the chamber. (C) Aspirate RBC, bead, and target cell. (D) Build up the force probe by attaching the bead to the RBC. (E) Adjust the position of target cell to align with force probe.Select the BFP program to measure the respective diameter of micropipette, RBC, and bead, and the contact area between the RBC and bead (Figure 6A and Video 2).Draw a horizontal line in the contact area between the RBC and bead, which will yield a curve in the adjacent window to adjust the signal during the experiment. If the curve is not sharp—meaning that the RBC and bead are not aligned (Figure 7)—start again.Select the force clamp assay experiment mode, set the parameters (such as Clamp force and Contact time, Figure 6B) as desired, and click “start.” Then, the program will cyclically drive the movement of the target cell by pipetting to contact with the bead for 0.1 s and retract. Meanwhile, the position of the bead is recorded in real time (Video 2). After 500–1000 events, click “stop” to stop the BFP experiment and save recorded data.Note: Approximately 100 bond lifetime curves are generated. imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4534/bioprotoc-12-20-4534-g006.jpgFigure 6. Measurement and parameter settings for BFP experiments. (A) Measure the parameters of force probe to calibrate the force in system in the following order: 1: micropipette; 2: RBC; 3: contact area of the RBC and bead; 4: bead. (B) Program interface in the BFP system.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4534/bioprotoc-12-20-4534-g007.jpgFigure 7. Bead tracking in the BFP system.",
    "Draw a horizontal line (red) to track the border of bead and obtain a tracking curve (right). The sharp curve ensures a stable signal during BFP cycle."
  ],
  "subjectAreas": [
    "Biophysics",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}