{
  "id": 19040,
  "origin_website": "Jove",
  "title": "Intraoperative Detection of Subtle Endometriosis: A Novel Paradigm for Detection and Treatment of Pelvic Pain Associated with the Loss of Peritoneal Integrity",
  "procedures": [
    "1. Patient Selection\nWomen with chronic pelvic pain undergo a history and physical exam.\nLocalization of pain, timing with regards to the menstrual cycle, associated symptoms including irritable bowel complaints or bladder complaints are noted and recorded.\nWomen undergoing laparoscopy are consented for possible resection of endometriosis and use of their tissues for research.\n2. Laparoscopic Techniques\nLaparoscopy is performed using standard techniques through a 5 mm umbilical port and additional 5 mm ports in the lower abdomen.\nCareful inspection of the pelvic is performed to correlate any findings of endometriosis with the pre-operative localization of pain, as indicated by the patient.\nMethylene blue dye is mixed 1:200 with sterile saline and injected onto pelvic surfaces using an aspiration needle.\nSuction irrigation is performed to remove the excess dye and rinse the peritoneal surfaces.\nThe pelvis is inspected and the areas of blue dye uptake are recorded.\nWhen possible, resection of the affected areas of peritoneum is performed.\n3. Scanning Electron Microscopy\nPeritoneal sections are sutured to a sterile telfa board to flatten the specimen and maintain orientation (intraperitoneal side up) and placed in gluteraldehyde fixative (Sigma, St. Louis, MO) for SEM.\nSamples were oriented and post-fixed in 1% buffered osmium tetroxide for 1 hr and dehydrated with sequential ethanol concentrations.\nSamples were dried using liquid carbon dioxide and mounted onto aluminum scanning electron microscope stubs with colloidal silver paste and sputter coated with gold:platinum alloy to a thickness of 20 nM.\nScanning electron microscopy was performed using a JEOL Model JSM-6400 Scanning microscopy and photomicrographs obtained from 12 random areas.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}