{
  "id": 17220,
  "origin_website": "Jove",
  "title": "Measuring the Behavioral Effects of Intraocular Scatter",
  "procedures": [
    "NOTE: The procedures outlined in the following protocol adhere to all institutional guidelines relating to human subject's research. This study was approved by the University of Georgia institutional review board, and the experimental procedures were conducted in accordance with Good Clinical Practice Guidelines and the ethical principles of the Declaration of Helsinki.\n1. Constructing the glare acuity apparatus\nNOTE: A conceptual drawing of the system is shown in Figure 5.\nBegin with an optical table, and install a 1000 W xenon arc lamp with the associated power supply at the posterior end of the bench (see a of Figure 5).\n\tNOTE: The best choice for an optical table is a breadboard with a grid of mounting holes, commonly, the M6 screw thread on a 25 mm grid. The minimum size necessary is ~91 cm x 122 cm. One limitation with these systems is that, if the light output is not constant (within and across sessions), small variations would be interpreted as variation in behavioral thresholds. Hence, make sure that the power supply is highly regulated with optical feedback sensors to ensure constant light output across experimental sessions and over time.\nInstall the first lens at a position that collimates the light from the source (see b of Figure 5), and introduce an optical element to remove heat within the optics generated by the intense light source (Figure 5C).\n\tNOTE: All lenses within the system are plano-convex achromats with anti-reflection coating. The effective focal length is ~100 mm, and the diameter is ~5 cm (slightly larger than the exit aperture of the light source). Infrared filters could be used to remove heat, but they often intrude into the visible. A water bath is a nice alternative. In the current system, two optical flats enclosed a tube filled with water.",
    "Introduce the next lens (see d of Figure 5) within the optical system to focus light to a small point on the 100 mm circular neutral density filter (see e of Figure 5), which attenuates light over a linear range of about 2 log units of optical density. Determine the nominal position of the filter using a digital readout coupled to a potentiometer (see j of Figure 5). Use a calibrated radiometer to determine the actual amount of light transmitted that corresponds to the circular filter's position and to periodically confirm that the overall energy within the system remains constant over the course of the experiment.\n\tNOTE: As the filtering is done over a gradient, light needs to be focused to a fairly small area (4-9 mm2) when passing through the circular filter (this position is also good for baffling using a small aperture that only passes the focused light).\n\t\nUse a mechanical shutter or simply a blocking filter and holder to occlude the stimulus between trials (see f of Figure 5).\nAdd the next lens to the system, a collimating lens (see g of Figure 5), placed such that light expands to match the diameter of each letter aperture (10.16 cm), fully illuminating the optotype (7.62 cm).\nConstruct the letter apertures or purchase them as metal stencils: P, L, D, U, Z, E, T, and F (see h of Figure 5). Place the letter apertures in a circular rotator (to allow for easy alternation between letters) with spring-loaded tabs and divots to lock each letter in place so there is no movement of the wheel during the experiment.",
    "NOTE: The letter apertures were approximately 15 mm x 6 mm x 25 mm (~0.17°), and were chosen because they are classic Sloan optotypes and approximately the same size. In this system, luminance measured at the letter aperture was 4000 lux; 40 lux when measured at the plane of the eye.\nNext, baffle the system such that subjects can only see the back-illuminated letter apertures (e.g., the intense light coming out of an \"E\"). For instance, place the optics of the system in one room with the subject in an adjoining room. Position a hole within the doorway adjoining the rooms and align it so that subjects cannot see the experimenter or stray light. Should the participant be unable to hear the experimenter's instructions, add an intercom system.\nTo ensure that the position of the eye relative to the visual system is fairly precise, create some form of head and chin rest assembly-use a rubber eye cup mounted on a black tube (both mounted on a movable cart). As done in this protocol, add a mount behind the tube to allow for the use of trial lenses to correct for refractive error using standardized lenses (i.e., no tinting).\n\tNOTE: The use of trial lenses will also allow for the use of a glass \"blank\" to ensure that the optical effects of those who did not require refractive correction match those who required refractive corrective optics (see i of Figure 5).\n\t\nAdditionally, ensure the viewing station is secured so that it does not move between subjects. Use a laser level to ensure alignment of the eye piece with the optics (7 m from the plane of the eye).\n2. Measurement of glare recognition acuity",
    "NOTE: At the beginning of an experimental session, it is confirmed that all optical elements within the system are aligned, light intensity (with no attenuation) is correct, and the subject's eye is in the proper position. The task is then explained to the subject (letter identification), and the stimuli are presented in random order at differing levels of intensity. The goal is to find the highest intensity at which a subject can still correctly identify individual letters (with the actual threshold defined probabilistically at 75% correct detection, 6 correct out of 8).\nUse the method of limits (to get close to the threshold) and then constant stimuli to obtain a precise value of the subject's glare recognition acuity threshold.\n\tNOTE: There are more accurate psychophysical methods available (signal detection, forced choice), but this method was used based on the number of measures and time constraints.\nUse a random letter generator to organize the letters on the wheel into a unique, random order. Use letters for the apertures that are commonly found in other recognition tasks (e.g., Snellen chart, Sloan letters).\n\tNOTE: The letters used in the present method were P, L, D, U, Z, E, T, and F.\nBefore beginning the protocol, explain the nature of the experimental task by showing the subject suprathreshold stimuli. Ensure the subject is aware the task is fairly simple: can the letter be seen or not? Run enough trials to generate a psychometric function that allows derivation of an accurate probabilistic threshold.\n3. Constructing the halometer device\nUtilize the same steps 1.1-1.2 in setting up the optics table for these measures. Make sure the light from the source illuminates the back of the light shield over a sufficient space (13-14 cm) to allow a separation of the two points.",
    "Install the light shield, and ensure that it serves as a baffle by blocking most of the light coming from the light source so that the subject just sees the light coming from the aperture and contains a small (~4 mm) aperture for the halo/spoke measures. Affix a digital micrometer to the back of the light shield to be used to measure the physical separation of the two light points.\n\tNOTE: The aperture must be produced by two abutting and movable apertures (2 mm each), and the shield must contain a collapsible baffle such that, as the apertures are moved apart, the baffle occludes light from passing between them.\nTo maintain consistency with this protocol, ensure that the light output measured at the light shield is 10 cd/m2.\nIn accordance with the schematic (Figure 2)13, place the centering calipers in the space between the light shield and the subjects stabilized head position (a simple chin and forehead rest). Make sure the jaws of the caliper are aligned with the 4 mm aperture and ~13-14 cm in height.\n\tNOTE: It is helpful to put some reflective material on the subject side so that they can be clearly seen. The jaws move equally from the center, and their position is indicated by a Vernier scale.\nTo maintain consistency with the setup used in this protocol, verify the light shield is ~100 cm and the calipers are ~60 cm from the plane of the subject's eye.\nWhen making the two-point measures, use a long focal length lens. Determine the exact placement of this final lens based on the focal length and the distance from the light shield and the plane of the subject's eye. Remove this lens when doing the halo/spoke measures.",
    "NOTE: A 200 mm achromatic plano-convex lens 18 cm from the plane of the eye was used in this setup (this places the eye in the focusing beam, but not at the focusing plane, the eye is anterior to the final focal point). This is used because individuals with very good acuity and low scatter can often see two abutting small points of light even when very close. The focusing lens will cause the points to overlap and magnify the distance necessary to distinguish two points.\nUse a white reflectance standard placed at the eye and a telescoping spectral radiometer to measure spectral light output, both radiometrically and photometrically, to ensure that the visible spectrum has the desired characteristics (in this case, simulated sunlight, Figure 2). To monitor energy output more often and with a highly sensitive detector, use a regular radiometer with a silicon-based photo-head.\n\t​NOTE: Such light output measuring devices will yield both the spectral shape of the curve and photometric values (measured in the same position at the eye itself).\n4. Glare geometry\nNOTE: Prior to testing, subjects were provided examples of the appearance of halos and starbursts in natural scenes (see Figure 3).\nOnce the subject is aligned, move the jaws of the caliper until it just surrounds the halo, and then until it is just at the outer circumference of the starbursts or spokes. Obtain the threshold by averaging the spread from both directions (from in to out and out to in).",
    "When beginning the two-point measures, ensure maximal proximity of the two 2 mm apertures; note that the stimulus will appear as a single, bright point of light. Slowly move the two apertures apart, quantifying the distance by the back-facing digital micrometer, centered on the apertures. From the \"zero point,\" (abutting apertures) ask the subjects to indicate when the spread from each light point does not overlap (usually one direction works well here).\nAs some error can be encountered if the subject becomes misaligned with the system, utilize a small-bore camera (with infrared) to ensure the eye always stays in correct position."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}