{
  "id": 10748,
  "origin_website": "Jove",
  "title": "Expanding Nanopatterned Substrates Using Stitch Technique for Nanotopographical Modulation of Cell Behavior",
  "procedures": [
    "1. Replication of PDMS Molds from an EBL Mold\nFabricate silicon mold29\nSpin coat 200 μl polymethyl methacrylate (PMMA) solution on a 1 × 1 cm silicon (Si) substrate at 2,500 rpm for 1 min to form a thin film.\nBake the PMMA film on the Si substrate at 180 °C for 2 min.\nWrite the designed nanopattern on the PMMA film by using a focused electron beam at an area dose of 300 µC/cm2.\nDevelop the PMMA nanopattern in developer for 80 sec.\nDeposit the PMMA nanopattern with a nickel layer of 50 nm in thickness using an E-beam evaporator at an output voltage of 10 kV, emission current of 0.5 mA and a deposition rate of 0.5 Å/sec.\nLift off the PMMA part in 20 ml remover at 80 °C for 20 min.\nReactive ion etch (RIE) the nanopattern into the Si substrate to get a Si mold of the desired depth.\n\t\t​NOTE: Gas mixture of tetrafluoromethane (CF4)/oxygen (O2) (90%/10%) at an inductively coupled plasma (ICP) power of 400 W and RIE power of 150 W is used to etch Si substrate to a depth of 560 nm.\nSilanize Si mold\n\t\nPut a glass coverslip and the Si mold in a 100 mm PS Petri dish and transfer them in a glass desiccator located in a fume hood.\nDrop 10 µl 1H,1H,2H,2H-Perfluorooctyltrichlorosilane on the coverslip.\n\t\t​Caution: 1H,1H,2H,2H-Perfluorooctyltrichlorosilane may cause skin corrosion and serious eye damage. Wear appropriate personal protective equipment (PPE).\nCover the Petri dish partially.\nKeep the desiccator under vacuum for 5 hr in a fume hood to complete the silanization of the Si mold.\nPrepare PDMS prepolymer\n\t\nWeigh 10 g PDMS resin and 1.05 g curing agent in a disposable weighing boat.\nMix the PDMS prepolymer thoroughly by using a plastic spoon.",
    "Degas the PDMS prepolymer in a plastic desiccator under vacuum for about 20 min till a clear mixture is observed.\nReplicate PDMS molds\n\t\nPut the silanized Si mold in a 60 mm Petri dish.\nPour the PDMS prepolymer on the Si mold in the Petri dish.\nPlace the Petri dish in a plastic desiccator and degas for about 10 min till all bubbles disappear.\nTransfer the Petri dish to a hotplate and cure the PDMS prepolymer at 70 °C for 4 hr.\nPeel off the PDMS mold from the Si mold carefully by using tweezers.\n\t\t​NOTE: PDMS molds can be stored at ambient conditions for up to one week. After curing, there are some uncrosslinked PDMS resin molecules and residual curing agent in the PDMS molds30. The low molecular weight molecules will gradually diffuse out and accumulate at the surface over time. This affects the topographical and mechanical properties of the PDMS surface31. The diffusion is not significant within one week.\n2. Stitching of PDMS Molds into a Large, Single Mold\nPrepare multiple PDMS molds by repeating Step 1.4.\n\tNOTE: Weigh same amount of PDMS mixture each time to obtain PDMS molds of same thickness.\nDetermine the orientation of anisotropic PDMS nanopatterns such as nanogratings under an optical microscope and mark it on the backside of the PDMS molds with a marker pen.\n\tNOTE: It is not necessary to mark the orientation of isotropic nanotopography such as nanopillars.\nClean a Si substrate with ethanol in a fume hood and dry it with compressed air.\nTrim off the unpatterned areas of each PDMS mold with a blade.\n\t​NOTE: For the PDMS molds that will be placed at the periphery of the stitched mold, only the unpatterned areas in contact with others should be trimmed off.",
    "Place the trimmed PDMS mold with the nanopattern face-down on the mirror side of the Si substrate and then align other molds close to but not touching the surrounding mold(s).\nPrepare a PDMS adhesive layer\n\t\nCast 1 g degassed PDMS prepolymer (PDMS resin and curing agent ratio: 10:1.05) on a clean glass slide (7.5 cm × 2.5 cm) to form a 0.5 mm thick layer.\nBake the PDMS layer at 100 °C on a hotplate for 3-5 min. Use a needle to touch the layer and ensure that the layer is partially but not completely cured.\n\t\tNOTE: Partially cured PDMS cannot flow like uncured PDMS prepolymer, but it is sticky compared with cured PDMS.\nPlace the PDMS layer on the backside of aligned PDMS molds and quickly invert this assembly and transfer it to the hotplate.\nApply a compressive force (5 kPa) using a metal block on the top of assembly to ensure a good contact between the PDMS adhesive layer and the backside of PDMS molds, and cure the PDMS adhesive layer at 100 °C for 1 hr.\n\tNOTE: Carefully adjust the position of the metal block to avoid the tilt of the assembly.\nRemove the metal block and peel off the single, stitched PDMS mold from the Si substrate.\n3. Generation of a Master Mold on PS Substrates\nNote: The stitched PDMS mold immobilized on a glass slide can be used to generate a master mold on a PS plate or a PS thin film, from which working nanopatterned substrates can be produced.\nGenerate a master mold on a PS plate\n\t\nPrepare a PS plate\n\t\t\nDry the PS pellets in a vacuum oven at 80 °C for two days.\nPreheat a press machine at 230 °C.",
    "Assemble an aluminum plate, a polytetrafluoroethylene (PTFE) sheet and the aluminum spacer in an order from bottom to top.\nLoad 3.5 g PS pellets in the aluminum spacer with a square opening of 3 cm (L) × 3 cm (W) × 0.3 cm (H).\n\t\t\t​NOTE: The spacer is approximately 0.1 cm thicker than the PDMS molds, and thus the final nanopatterned PS substrate is about 0.1 cm thick.\nPlace another PTFE sheet and then another aluminum plate on the aluminum spacer.\nPlace the assembly in the press machine.\nPreheat the PS pellets at 230 °C for 30 min.\nApply a compressive pressure (0.1 MPa) on the assembly for 5 min.\nRelease the pressure and then reapply a compressive pressure of 0.5 MPa on the assembly.\nRepeat Step 3.1.1.9 with a pressure increase of 0.5 MPa till the desirable pressure of 1.5 MPa is reached.\nTurn off the heater of the press machine and cool it down below 70 °C at a constant pressure of 1.5 MPa.\nTake the assembly out and store the PS plate in a vacuum oven at 80 °C to prevent moisture from re-entering the PS plate.\nNanoimprint the stitched PDMS mold into PS plate\n\t\t\nPlace the PS plate in an aluminum spacer set on a 3-inch Si wafer.\n\t\t\t​NOTE: The inner dimensions of the spacer are the same as those of the PS plate so the PS plate fits right in the spacer.\nHeat the PS plate on a hotplate at 250 °C for 30 min.\nPut the stitched PDMS mold with nanopatterns face-down on the molten PS plate.",
    "NOTE: One side of the PDMS mold is put in touch with the surface of the PS plate first and another side is lowered gradually in contact with the PS surface to avoid the formation of air bubbles at the interface.\n\t\t\t​Caution: The surface of the hotplate is hot. Wear thermogloves during nanoimprinting process.\nPlace an aluminum plate on the glass slide of the stitched PDMS mold.\nApply a compressive pressure (12.5 kPa) by using metal blocks on the aluminum plate and wait for 3 min.\n\t\t\t​NOTE: Make sure that the aluminum plate is not tilted.\nLift and replace the metal block from the aluminum plate and increase the compressive pressure to 25 kPa.\nRepeat Step 3.1.2.6 with the pressure increased to 50 kPa.\n\t\t\t​NOTE: This step is to remove the air trapped between the PDMS mold and PS plate.\nMaintain the temperature of the hotplate between 240 and 250 °C under the consistent pressure of 50 kPa for 15 min.\nTurn off the hotplate and cool down the whole setup.\n\t\t\t​NOTE: A fan can be used to expedite the cooling process.\nRemove the metal blocks after the temperature is below 50 °C, and carefully peel off the stitched PDMS mold from the PS plate.\n\t\t\t​NOTE: The PS substrate has the reverse nanopatterns and can be used as a master mold to produce working PDMS substrates.\nGenerate a master mold on a PS thin film\n\t\nPrepare a PS thin film\n\t\t\nDissolve 1 g PS in 10 ml toluene in a fume hood.\n\t\t\t​Caution: Toluene can cause skin irritation and serious eye damage, and may cause damage to organs through prolonged or repeated exposure. Wear appropriate PPE.\nSpin-coat 1 ml PS solution on a 2-in wafer at 2,500 rpm for 1 min to form ~1 μm thick PS thin film.",
    "Evaporate toluene from the film by setting the PS film on Si wafer in a fume hood for 3 days.\nAnneal the PS thin film in a vacuum oven at 80 °C overnight.\nNanoimprint the PDMS mold on a PS thin film\n\t\t\nPut the stitched PDMS mold with nanotopography face-down on the PS thin film, which is set on a hotplate.\nApply a compressive pressure of 12 kPa on the PDMS mold by using metal blocks on the glass side of the PDMS mold.\nIncrease the temperature of the hotplate to 180 °C and maintain it for 15 min.\n\t\t\t​Caution: The molten PS film can function as a lubricant. Pay attention to prevent the metal blocks from sliding off.\nTurn off the hotplate and cool down the whole setup.\n\t\t\t​NOTE: A fan can be used to expedite the cooling process.\nRemove the metal blocks after the temperature drops below 50 °C, and carefully peel off the stitched PDMS mold from the PS film.\n\t\t\t​NOTE: The nanopatterned PS film will serve as a master mold to produce working PDMS substrates.\n4. Nanotopographical Modulation of Cell Behavior\nNote: Human epithelial cells are cultured on the representative nanotopographies to demonstrate nanotopographical modulation of cell spreading.\nCast PDMS working substrates from the master mold generated from either Step 3.1 or 3.2 depending on the application.\nUsing a hollow steel arch punch, cut the nanopatterned PDMS substrates into discs to fit the configuration of a specific multi-well plate (e.g., 24-well plate).\nUse tweezers to place the PDMS discs into the wells of a multi-well plate.\nSterilize the PDMS substrates by using 70% ethanol and then UV exposure, each for 30 min.\nWash the PDMS substrates with 1x sterile phosphate buffered saline (PBS) three times.",
    "Coat the PDMS substrates with extracellular matrix protein (i.e., 20 µg/ml fibronectin) for 30 min at room temperature.\nRinse the PDMS substrates three times with sterile PBS, each for 5 min.\nSuspend human lung cancer cell A549 in Dulbecco's modified eagle medium with 10% fetal bovine serum and count the cells using a hemocytometer.\nPlate the cells at a seeding density of 2,000 cells/cm2 on the PDMS substrates and culture them at 37 °C in a humidified atmosphere containing 5% CO2 for one day.\nWash the cells with PBS three times.\nFix the cells in a mixture of 4% paraformaldehyde and 2% glutaraldehyde in PBS for 4 hr and dehydrate cells using a CO2 critical point dryer for scanning electronic microscopic observation29.\n\tCaution: Paraformaldehyde and glutaraldehyde may cause severe skin burns and eye damage. Operate in a chemical hood and wear appropriate PPE.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}