{
  "id": 10778,
  "origin_website": "Jove",
  "title": "Fabricating Cotton Analytical Devices",
  "procedures": [
    "CAUTION: Proper laboratory hygiene practice is required. Gloves and universal precautions are required when using this POC device. Contamination of results or infection may occur if adequate sterilization procedures are not carried out properly.\n1. Prepare Test Strip Devices\nDetermine the hydrophobicity of the exterior layer of the cleansing cotton by contact angle measurement8 (Figure 3).\nFabricate the cotton-based analytical device by cutting cleansing cotton into 5.5 cm x 1 cm pieces with a paper cutter (Figure 2A).\nDrill holes (ø = 0.5 cm) in a standard sheet of lamination film in rows of three; the distance between two subsequent holes is 1 cm.\n\tNOTE: As many as 36 individual test strips with three test areas each may be made using a standard sheet of lamination film (5.5 cm x 2 cm) (Figure 2B).\nSandwich the cleansing cotton (characterized by exterior hydrophobicity and interior hydrophilicity) between two pieces of lamination film, i.e., the hole-drilled sheet of lamination film on one side, and an undrilled sheet of lamination film (no holes) on the other side. Place the assembly into a laminator to package the device. This enhances the device's mechanical strength, and provides an external, impervious layer.\n\tNOTE: The diameters of holes will shrink from 0.5 cm to ~ 0.47 cm after lamination. Some slight gaps will remain between the cleansing cotton and lamination film around the perimeter of each hole. These slight gaps facilitate the placement of test pad circles made in a subsequent step.",
    "Use a pair of scissor to cut individual 5.5 cm x 1 cm test strip devices from the assembly, i.e., the drilled lamination sheet/cotton pad/undrilled lamination sheet \"sandwich\" (Figure 2C). Make 48 devices total to create standard curves as described later (18 devices for the nitrite assay, 15 devices for the BSA assay, and 15 devices for the urobilinogen assay).\nUse a sharp knife or razor to cut a slit (as a small fluidic channel) from the center of each test area (not covered by lamination film), across and through the hydrophobic layer of test area to the hydrophilic layer of the longitudinal device, being cautious to cut halfway through the depth of the sandwiched device (Figure 2D).\nApply paper test pads (ø = 0.5 cm) by sliding them into the gaps at the perimeter of each hole in the lamination (Figure 2E).\n2. Prepare Standards and Indicator Solutions for Urinalysis\nPrepare 10.0 mM nitrite stock solution by dissolving 69.0 mg sodium nitrite in 100 ml deionized (DI) water. Dilute the nitrite stock solution in DI water to create a series of nitrite concentration standard solutions (2,500, 1,250, 625, 312, 156, and 78 µM) (Figure 4A).\nPrepare 60 µM bovine serum albumin (BSA) stock solution by dissolving 415 mg BSA in 100 ml PBS solution (10 M phosphate buffer, 0.0027 M potassium chloride and 0.137 M sodium chloride; pH 7.0). Dilute the BSA stock solution in DI water to create a series of BSA concentration standard solutions (30, 15, 7.5, 3.75, and 1.875 µM) (Figure 4B).\nPrepare 25 g/L urobilinogen stock solution by dissolving 2.5 g urobilinogen in 100 ml DI water. Dilute stock urobilinogen solution in DI water to create a series of urobilinogen concentration standard solutions (7.8, 15.6, 31.2, 62.5, and 125 mg/L) (Figure 4C).",
    "Prepare nitrite indicator solution containing 50 mM sulfanilamide, 330 mM citric acid, and 10 mM N-(1-naphthyl) ethylenediamine dihydrochloride.\nPrepare BSA indicator solution containing 250 mM citrate buffer solution (pH 1.8) and 3.3 mM solution of tetrabromophenol blue in 95% ethanol.\nPrepare urobilinogen indicator solution containing 0.1 M 4-Dimethylamine benzaldehyde.\n3. Prepare Indicator Pads\nCut three circular shaped pads or disks (ø = 0.5 cm) from chromatography paper and insert each of them (one for each assay on the three-assay strip) onto each test strip device to create a solution standard curve (section 4).\nAt each of the three lamination film holes of the assembly, observe a slight gap between the lamination film and the cotton test pad at the very edges of the cut hole. Note, the hole in the lamination film is slightly smaller in diameter than the paper test pad.\n\tNOTE: Together, these features allow the paper test pad to be applied against the cotton test pad portion of the device so that the edges of the paper test pad slip into the slim gap mentioned, i.e., under the edges of the lamination film hole. This holds the paper test pads in place.\nPrepare the Nitrite Assay Portion of the Device.\n\t\nCoat the nitrite assay pad with 4 µl of nitrite indicator solution (prepared in step 2.4) and allow it to dry completely at ambient temperature.\nPrepare the Total Protein Assay Portion of the Detection Device.\n\t\nCoat the total protein assay pad with 4 µl of BSA indicator solution (prepared in step 2.5) and allow it to dry completely at ambient temperature.\nPrepare the Uroblinogen Assay Portion of the Detection Device.\n\t\nCoat the uroblinogen assay pad with 4 µl of uroblinogen indicator (prepared in step 2.6) and allow it to dry completely at ambient temperature.",
    "4. Create Standard Curves for the Cotton-based Analytical Device\nFor each standard prepared, dip the absorptive end of a prepared device (preloaded with assay indicators (see section 3.4)) into the standard solution for 10 sec (the absorption volume ~ 200 - 300 µl) (Figure 2F).\nPlace the cotton-based device in an ambient environment for 10 min to complete colorimetric reactions (Figure 2F). Repeat each experiment in triplicate.\nScan the device to analyze the colorimetric change occurring at each test pad (Figure 2G). Place resulting test pads on the glass of a desktop scanner and scan test pads in RGB mode with 600 dpi of image resolution. Save each image in jpeg format.\nAnalyze the scanned image on a computer using image analysis software to determine respective color intensities (Figure 2H).\n\t\nDownload ImageJ software at http://imagej.nih.gov/ij/. Open the scanned image files. Select the Image in the menu commands, and select “Type” to convert RGB images to 8-bit grayscale.\nUse the \"Oval\" tool in the toolbar to select the test pad analytical area. Select \"Analyze\" in the menu commands, and select \"Measure\" to analyze color intensity. Record mean intensity results.\nEstablish the standard curves of nitrite, total protein, and urobilinogen assays (Figure 2I).\n\t\nIndicate different concentrations of standard nitrite, total protein, and urobilinogen solutions and correlated mean intensity results on a two-dimensional coordinate system using stastical software.\nFit the standard curve for a nitrite assay by a quadratic model and the standard curves for total protein and urobilinogen assays by linear regression models.\n5. Determine Unknown Sample Concentrations Using Established Standard Curve Values",
    "To determine nitrite, total protein, and urobilinogen concentrations in unknown solutions, use the device as described for measuring standard solution concentrations and substitute measured intensity results for nitrite, total protein, and urobilinogen assays into the equations of the models built in step 2.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}