{
  "id": 7028,
  "origin_website": "Bio",
  "title": "Maternal Immune Activation with the Viral Mimetic Poly:IC in Pregnant Rats",
  "procedures": [
    "BreedingMale and female rats (approximately 60 days old) are delivered to the vivarium, housed in same sex pairs, and given one week to acclimatize before experimentation. In our facility, male and female rats are housed in the same colony room in standard ventilated cages. Food and water are provided ad libitum throughout the experiment. The light-dark cycle is 12 h:12 h (lights on at 7 am) in our facility.Handle female rats for 3 min on 3 consecutive days before breeding.One day before breeding, separate male rats into individual cages.Approximately 1 h before the start of the dark cycle, place female rats with a male rat of the same strain (ratio 2 females in each male cage) and leave overnight.Approximately one hour after the light cycle begins (i.e., 14 h after pairing), remove the female rats from the male’s cage. Immediately collect a sample from the vagina of each rat with a sterile P200 pipette tip filled with 50-60 μl of sterile physiological saline. To achieve this, gently restrain each rat and pipette the saline into the vaginal canal, then retract the saline back into the pipette and eject onto a clean glass microscope slide. If the rat urinates, wait until urination stops before taking the sample.Always use a new pipette tip for each rat.Using a light microscope, check for the presence of spermatozoa (see Lucio et al., 2013 [Figure 2A] for an example photomicrograph of rat spermatozoa).Important: It is not necessary to stain the slides, but it is necessary to visualize the cells collected before the solution dries. If spermatozoa are present, the rat is considered pregnant. That day is then considered day 0 of gestation.Place the pregnant rat in a new home cage and begin monitoring body weight and food intake.",
    "Care should be taken to minimize disturbances during pregnancy. In our protocol, body weight is monitored weekly when the cages are changed. Specific experimental considerations may necessitate more frequent monitoring of the pregnant dams.Rats that are not suspected to be pregnant should be placed back in their home cage (i.e., separated from the male) until they are re-paired. There is some risk that rats believed not to be pregnant actually are. If possible, wait 1-2 weeks before re-pairing. Monitor body weight during this time as rats that are pregnant will show an increase in body weight during the first 14 days of pregnancy.On the day that re-pairing is desired, proceed with Step A2 again.Poly:IC preparationPoly:IC is prepared according to the manufacture’s instructions (poly:IC, High Molecular Weight (HMW), InvivoGen, San Diego, CA). Note that some researchers also use polyI:C sodium salt from Sigma Aldrich.To improve the solubility of the polyI:C, we heat it up in a 300 ml beaker filled with distilled water (150 ml). Using a hot plate, heat the distilled water to a maximum of 65 °C and place the bottle containing the polyI:C solution in the distilled water for 10 min.Shake the bottle containing the polyI:C carefully and slowly when done.Allow the polyI:C to cool for 1 h at room temperature.Prepare appropriate aliquots for the number of rats to be treated and store at 4 °C or -20 °C. The poly:IC solution is stable for 1 month at 4 °C and 1 year at -20 °C.Poly:IC treatmentOn gestational day (GD) 15, the pregnant rats are removed from their colony room one at a time, weighed, and rectal temperature is taken. Use vaseline to aid insertion of the rectal probe.Place the rat inside the anesthesia induction chamber. Induce anesthesia with 5% isofluorane.",
    "Once the rat is anesthetized, remove the rat from the induction chamber and place into a fume hood on a heating pad with a nose cone over its face to maintain anesthesia (2.5% isofluorane is typically sufficient for maintenance).Pinch the rat’s toes to ensure that it is sufficiently anesthetized. In the absence of a reaction, treatment can proceed.Before the injection, clean the tail with an antiseptic isopropyl alcohol pad and then locate one of the two lateral tail veins in the middle third of the tail. With the needle point orientated bevel up, insert just below the surface and into the vein. Inject the appropriate amount of poly:IC or sterile physiological saline (control group) with a 25 Gauge needle. When the needle is placed appropriately, the plunger will depress easily with no resistance. If resistance is felt, remove the needle and try again at a position higher on the tail or on the opposite tail vein. We typically administer 4 mg/kg of polyI:C (Lins et al., 2018 and 2019).Turn off the anesthesia and transfer the rat back into her home cage. The rat should be on a heating pad from the time she is placed under anesthesia to the time she completely wakes up. Once the rat is awake and can maintain balance, she can be returned to the colony room.Our protocol typically involves monitoring weight and temperature 3, 8, 24 and 48 h following treatment. These measurements are taken quickly in a procedure room just outside the rats’ colony room. Body temperature can be a key measure of sickness response in the MIA model. The effect of Poly:IC on body temperature is usually demonstrated as a biphasic response, with an early hyperthermia (3 h-6 h) followed by a delayed hypothermia.",
    "Regarding hypothermia, if a dam’s body temperature is below 36 °C, it is necessary to provide access to a warming pad in their home cage for 24 h until their temperature returns to normal. In the case of persistent hypothermia, euthanasia may be necessary.Pregnant rats deliver their litters naturally. Starting on gestational day 20, we check for litters twice per day during the light cycle. The day of birth is noted as postnatal day 0.On postnatal day 1, remove dams and litters one at a time from the colony to a nearby procedure room. Before handling the pups, place the dam in a holding cage. While handling the pups as little as possible, count and sex them, and weigh as a group. We typically cull litters back to 10 pups with a roughly balanced sex ratio where possible."
  ],
  "subjectAreas": [
    "Immunology",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}