{
  "id": 13654,
  "origin_website": "Jove",
  "title": "Assessment of Social Cognition in Non-human Primates Using a Network of Computerized Automated Learning Device (ALDM) Test Systems",
  "procedures": [
    "Ethics statement: This research was carried out in accordance with French standards and received approval from the national French ethics committee, the “Comité d’Ethique CE-14 pour l’Expérimentation Animale”. Procedures were also consistent with the guidelines of the Association for the Study of Animal Behaviour.\n1. ALDM Test Unit Set-up\nNOTE: Set up the ALDM test units as per Fagot & Paleressompoulle1.\nCreate test chambers of dimension (0.7 x 0.7 x 0.8 m3) as described in1. Ensure that each test chamber has 2 lateral transparent sidewalls. Equip each test chamber with a sliding door that can be open or closed on the backside (see Figure 1). Open the back door of the ALDM unit to provide access to the test system from the enclosure.\nFit the front panel of the test chamber with a (7.3 x 7 cm2) view port providing vision of a 19 in touch screen located in front of the unit, and 2 handports for manual interactions with the touch screen.\nInstall an antenna connected to a microchip reader around each hand port as described in1. The antenna will capture the RFID identity of the subject.\nInstall a 19 in capacitive touch screen in front of each test chamber. The touchscreen serves to present the stimuli and to record response related variables (accuracy and response time). Separate the viewports 25 cm from the screen.\nConnect a PC computer to each test unit that will serve to run the test program.\n\tNOTE: On each trial, the test program determines the test regimen of the subjects (e.g., property of the display, stimulus duration, etc.) and associates the behavioral measures (e.g., response time, accuracy) to the monkey identified by the RFID technology.",
    "Connect a food dispenser to the PC computer via a parallel port, as described in1. This dispenser delivers grains of dry wheat inside the ALDM monkey area.\nInject a RFID microchip in the forearm of each individual of the group as described in1.\n\tNOTE: This procedure should be performed according to the veterinarian practices.\nimgsrc://cloudfront.jove.com/files/ftp_upload/52798/52798fig1highres.jpg\nFigure 1: Picture (A) and schematic view (B) of an ALDM unit. Each test unit has five main component elements. (A) touchscreen; (B) handport; (C) viewport; (D) food dispenser delivering food items inside the cage after a correct response; (E) computer; (F) door providing access from the enclosure. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/52798/52798fig1highres.jpg]\n2. ALDM Network Set-up\nInstall 10 ALDM units inside two 8 x 4 m2 trailers, with 5 ALDM units in each trailer as described in1. Connect each ALDM test unit to a unique controlling server accessible via an IP address (see Figure 2). Ensure that the ALDM unit can both download and upload information from/to the server.\nWrite a computer testing program that downloads text files from the server once a monkey is identified by an ALDM test unit as per1. In the text file, provide indications on the current experimental status (number of trials already performed in the training or testing phase) of the monkey using the unit. Write the testing program such that it can use that information for presenting the training or test trial predefined by the experimental procedure.\nInsert the test program inline script such that it uploads and downloads data from the server. Ensure that the ALDM unit synchronizes the ALDM clock twice a day.",
    "NOTE: With this procedure, the 10 ALDM units can provide indications on which monkey uses which unit, and when, and therefore provide information on the social dynamics in the use of the test systems.\nWrite the testing program such that before each trial, the test program uploads information from the server on the current experimental status of the monkey. Once the trial is complete, the ALDM unit will update the subject’s text file on the server.\n\tNOTE: Centralization of the subject’s related parameters on the controlling server guarantees that the participants will be tested in the predefined test order, independently of ALDM test units it decides to use.\nStore the following data as a text file after each trial: Date, Day time (HH:MM:SS format), Name of the current test program, Monkey name, Number assigned to the ALDM test unit (e.g., 1), Test level (e.g., training), Score (1 = correct behavioral response; 2 = incorrect response), Response time with msec precision.\nimgsrc://cloudfront.jove.com/files/ftp_upload/52798/52798fig2highres.jpg\nFigure 2: Schematic representation of the ALDM network. Each ALDM unit receives and provides information from/to a unique controlling server. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/52798/52798fig2highres.jpg]\n3. Illustration of the Use of the ALDM Network for the Study of Social Cognition\nNOTE: The ALDM protocol has the unique advantage of having monkeys that can interact freely with computers, while being maintained in their social group. Below are presented 3 protocols illustrating the use of a network of ALDM test units to collect unprecedented information on baboons’ (Papio papio) social cognition.\nComputerized ALDM testing combining behavioral (ethological) observations:",
    "NOTE: The main goal of this research is to assess the effects of the valence (positive vs. negative) of affective states on the animals’ cognitive performance during computerized ALDM testing. The procedure is outlined in Figure 3 and full details on this research were published in Marzouki et al.10\nInstall a visual search task consisting of the selection of a target visual stimulus among several distractors on each computer.\nDuring eight days, observe and record manually which behavior each individual exhibits in the enclosure, and when, with a timer synchronized to the controlling server.\nGroup the behaviors exhibited in the enclosure in three clusters corresponding to the emotionally positive social events (e.g., grooming), the emotionally negative social events (e.g., threat), and the emotionally nonsocial (neutral) events (e.g., object manipulation).\nAnalyze the response times of the visual search task obtained within a 3 min time window following a behavioral observation in the enclosure. Synchronize the behavioral observations and computer data and analyze (see Figure 3).\nimgsrc://cloudfront.jove.com/files/ftp_upload/52798/52798fig3.jpg\nFigure 3: Schematic illustration of Section 3.1. The spontaneous behaviors expressed in the enclosure are recorded in parallel with the cognitive performance on the ALDM tests.\nAssessment of social influences during ALDM testing:\n\tNOTE: This protocol is aimed at studying audience effects on cognitive performance recorded during computerized ALDM testing. Full details on this research were published in Huguet et al.11\nOn each ALDM test unit, install a task in which a circle is followed by a response on the right side of the screen or on the left side when a parallelogram is presented.\nAllow the monkey to use the 10 ALDM test systems as they want. Several monkeys can therefore use adjacent test systems. Record which individual uses which system.",
    "NOTE: The baboons can see their conspecifics (when present) using the other test setups of the trailer, thanks to the transparent side walls of each unit.\nMake sure that the test program records the performance of each individual, as well as the social context of the trial (i.e., if the other ALDM test units are simultaneously used, and by whom).\nAnalyze variations in response time depending on the social context.\nCultural evolution assessed via computerized transfer of information from individuals to individuals:\n\tNOTE: This protocol was developed to study the evolution of information transmitted through a chain of participants. The procedure is outlined in Figure 4 and full details on this research were published in Claidière et al.12\nTrain the participants to solve a simple memory task in which they first see four randomly chosen red squares in a four by four grid of otherwise white ones. After 400 msec change all the red squares to white, and ask the participant to touch the squares that were previously red.\nWhen the training is completed, use the behavioral response of one participant (the squares touched) to produce the stimuli for the next individual in the chain (see Figure 4). Except for the first individual in the chain for which the grids are randomly generated by the computer.\nAnalyze the success at the task with the number of transmission events.\nimgsrc://cloudfront.jove.com/files/ftp_upload/52798/52798fig4highres.jpg\nFigure 4: Schematic illustration of Section 3.3. The first baboon (Generation 1) had to complete a set of 50 trials generated by the computer. The motor responses of this baboon were then used to create the stimuli for the second baboon (Generation 2) in the transmission chain. This procedure was repeated until the last baboon in the chain was tested. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/52798/52798fig2highres.jpg]"
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}