{
  "id": 2301,
  "origin_website": "Cell",
  "title": "Engineering yeast to induce the synthesis of GPI-APs with a permanent phosphoethanolamine on mannose 2 of the glycan moiety",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nInduction of mNeon-Gas1p synthesis whereby EtNP is not removed from Man2 and observation of protein expression and trafficking by epi-fluorescence microscopy\nTiming: 4 days\nThis section describes how to induce the expression of mNeon-Gas1p in which Man2 has not been remodeled by the removal of EtNP.\nRevive the yeast strains in which the expression of mNeon-Gas1p and Gpi7p-9myc are driven by the GAL1 promoter (i.e., SARY7331, SARY7333 and SARY7335).\nStreak yeast strains from their −80°C glycerol stocks for single colonies onto YEPD plates.\nIncubate the plates at 25°C for two days.\nSelect well isolated colonies and patch them onto a new YEPD plate.\nInoculate cells from each strain into YEPD medium and culture them overnight at 25°C.\nDilute the overnight culture into 9 mL YEPD medium at a density of 0.3 × 107cells / mL.\nCulture the diluted culture at 25°C for 3 h.\nAliquot 6 mL of culture from each of the strains for induction in YEPGal.\nSpin down cells in Falcon tubes at 3,000 × g for 3 min at room temperature and discard the supernatant.\nWash the cell pellet by resuspension with 5 mL YEPGal medium once.\nSpin down the cells again at 3,000 × g for 3 min at room temperature and discard the supernatant.\nResuspend the cells in 6 mL YEPGal medium and continue culturing at 25°C.\nCritical: It is important to remove the glucose present in the YEPD as any residual glucose will delay induction via the GAL1 promoter.\nFor samples cultured in YEPD.\nPreparation of yeast lysates for immunoblotting.\nMeasure the optical density of the culture in log phase (an OD660 of ∼ 0.6–0.8) (these values will be used to adjust the amount of protein run on SDS-PAGE gels).",
    "Mix 1 mL culture with 200 μL 100% TCA and store the mixture at −80°C for later SDS-PAGE and immunoblotting.\nPreparation of yeast cells for plasma membrane labeling with FMTM 4–64.\nCollect cells from 1 mL culture in log phase (an OD660 of ∼ 0.6–0.8) using the highest speed of a benchtop microcentrifuge at room temperature for 15 s and discard the supernatant.\nResuspend the cells with 1 mL ice-chilled PBS.\nIncubate the cells on ice for 5 min.\nSpin down the cells again as in 6-b-i.\nResuspend the cells with 50 μL ice-chilled PBS containing 30 μM FMTM 4–64.\nIncubate the cells on ice for 20–30 min.\nSpin down the cells at top speed in a benchtop microcentrifuge at 4°C for 15 s and discard the supernatant.\nWash the cells with 1 mL ice-chilled PBS.\nSpin down the cells at top speed in a benchtop microcentrifuge at 4°C for 15 s and discard the supernatant.\nResuspend the cells with ice-chilled PBS at ∼ 107 cells/100 μL.\nApply a 0.8 μL suspension of each strain onto a multispot microscope slide coated with Concanavalin A and seal the slide with a cover slip and nail polish.\nAcquire images of cells using a fluorescence microscope with the configuration optimized for mNeon and FMTM 4–64 excitation/emission spectra.(mNeon: Ex λ 506/ Em λ 517; FMTM 4–64: Ex λ 515/ Em λ 640) (Samples were visualized and photographed through a Nikon Plan Apo VC 100×/1.40 oil objective lens by using a Nikon ECLIPSE 80i microscope (Nikon, Japan) equipped with a SPOT-RT KE monochrome charge-coupled device camera (Diagnostic Instruments, Sterling Heights, MI).\nPreparation of yeast cells for immunoblotting and FMTM 4–64 staining following 2-h induction in YEPGal.\nPreparation of samples for immunoblotting.",
    "Measure the optical density of the culture at 660 nm (these values will be used to adjust the amount of protein run on SDS-PAGE gels).\nMix 1 mL culture with 200 μL 100% TCA and store the mixture at −80°C for immunoblotting.\nPreparation of yeast cells for plasma membrane labeling with FMTM 4–64 (repeat step 6-b).\nPreparation of yeast cells for immunoblotting and FMTM 4–64 staining following 2-h incubation in YEPGal.\nPreparation of samples for immunoblotting.\nMeasure the optical density of the culture at 660 nm (these values will be used to adjust the amount of protein run on SDS-PAGE gels).\nMix 1 mL culture with 200 μL 100% TCA and store the mixture at −80°C for immunoblotting.\nPreparation of yeast cells for plasma membrane labeling with FMTM 4–64 (repeat step 6-b).\nAlternatives: Measuring the absorption of yeast cultures at 600nm is an alternative means by which to estimate the number of cells / mL of yeast culture. Induction of mNeon-Gas1p synthesis can be observed by epifluorescence microscopy following 4 h of induction. However, by contrast a clearer indication of robust expression might require 7 h of induction. Using a preculture in raffinose-rich medium might be helpful to improve the galactose induction.\nCritical: Incubating the cells with ice-chilled PBS before and during the FMTM 4–64 staining is very important as this will reduce the rate at which the dye is endocytosed and reaches the vacuole.\nExamination of the expression of Gpi7p-9myc and mNeon-Gas1p by immunoblotting\nTiming: 2 days\nThis section describes how to monitor the expression of Gpi7p-9myc and mNeon-Gas1p following SDS-PAGE and immunoblotting.\nResolve Gpi7p-9myc and mNeon-Gas1p by SDS-PAGE.\nTake the TCA-containing samples from −80°C and thaw them on ice.",
    "Spin down the pellets at the top speed in a benchtop centrifuge at 4°C for 10 min and discard the supernatant.\nResuspend the pellets with 1 mL pre-chilled acetone (stored at −20°C).\nSpin down the pellets again at the top speed in a benchtop centrifuge at 4°C for 10 min and discard the supernatant.\nAirdry or use a 65°C dry bath to volatilize acetone from the pellets.\nDissolve the pellets with ddH2O containing 1% SDS 0.1 M NaOH (dissolving buffer). The volume of dissolving buffer used will depend on the relative cell number, which was determined from the optical density measurements conducted in steps 6-a-i, 7-a-i and 8-a-i. The desired ratio is ∼107 cells/50 μL dissolving buffer.\nAdd the same volume (9.f.) of 2× SDS-sample buffer to the samples.\nHeat the samples at 95°C for 10 min.\nSpin down the undissolved particles at the top speed in a benchtop microcentrifuge at room temperature for 3 min.\nLoad 10 μL of the supernatants onto separate 8% SDS-polyacrylamide gels (two) in the identical order (one to be used for Gpi7p-9myc immunoblotting and the other for mNeon-Gas1p immunoblotting).\nConduct SDS-PAGE.\nImmunoblotting of Gpi7p-9myc and mNeon-Gas1p.\nTransfer the resolved proteins from each of the two polyacrylamide gels onto separate pieces of nitrocellulose membrane by electrophoretic transfer (200 mA for overnight or 300 mA for 3 h).\nIncubate the nitrocellulose membranes with 5% skim milk in PBST for 1 h to reduce non-specific protein-antibody binding.\nCut each membrane into two parts to separate proteins larger than 64 KDa from proteins which are smaller (this results in 4 pieces of membrane in total – 2 pieces from each of the two original membranes).",
    "Incubate the two pieces of membranes containing larger molecular weight proteins separately with an anti-myc antibody (1:1000 dilution) and an anti-Gas1p (1:5000 dilution) with constant agitation. The antibodies were diluted in PBST with 5% skimmed milk. For the two pieces of membranes containing smaller molecular weight proteins use anti-Pgk1p antibody (1:10000 dilution) (Pgk1p serves as a gel loading control) with agitation. Incubate membranes and antibodies for 1 h at room temperature.\nWash the membranes with PBST for 5 min three times with constant agitation.\nIncubate the anti-Gas1p-bound membranes with HRP-conjugated anti-rabbit antibody (1:3000 dilution) in PBST with 5% skimmed milk for 1 h with constant agitation. Incubate the remaining three pieces of nitro cellulose membrane with an HRP-conjugated anti-mouse antibody (1:3000 dilution) in PBST with 5% skimmed milk for 1 h with constant agitation.\nWash the membranes with PBST for 5 min three times with constant agitation.\nDrain the liquid from the membranes and incubate the membranes with chemiluminescent substrate for 1 min.\nPut the membranes into imaging system (e.g., ChemiDoc Imaging System) to acquire a digital image of the immunoblot by using cumulative mode."
  ],
  "subjectAreas": [
    "Cell Membrane",
    "Biotechnology And Bioengineering",
    "Cell Biology",
    "Genetics",
    "Model Organisms"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}