{
  "id": 2357,
  "origin_website": "Cell",
  "title": "Protocol to photoactivate adipose-derived stem cell differentiation using a tightly-focused femtosecond laser",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nIsolation and culture of primary ADSCs\nTiming: 3 h\nOur protocol is a streamlined adaptation from previously established protocols (Estes et al., 2010[href=https://www.wicell.org#bib5]). Primary ADSCs is used as a viability demonstration of this protocol. If ADSCs or other stem cells are already available, skip directly to step 14.\nSterilize the surgery tools and operation area.\nPrepare the culture medium for ADSCs: BASIC MEM alpha culture medium (MEM-α) with 10% fetal bovine serum (FBS) and 1% Penicillin-Streptomycin (10,000 U/mL). See materials and equipment[href=https://www.wicell.org#materials-and-equipment].\nEuthanize 7-day postnatal male SD rats using methods approved by the animal welfare committee.\nNote: About 107 ADSCs can be extracted from the adipose tissue of 5 rats.\nSpray the surface of the rats with 75% ethanol and place them in the operation area.\nDissect tlistbhe adipose tissue of the groin and epididymal/parametrial fat pads.\nWash the adipose tissue in PBS buffer and mince them with a sterilized scissor.\nNote: It is best to cut the tissue into evenly sized pieces for better control of digestion time.\nTransfer the tissue to a 15 mL tube. Mix it in the ratio of 1:1 (vol/vol) with 2% collagenase type I solution for digestion. Incubate for 30–60 min at 37°C until few tissue clumps are visible.\nNote: Gently agitate the tube every 8–10 min for better mix during digesting. Here you can directly use the incubator shaker instead of manual operation.\nAdd 2 mL digestive termination buffer (culture medium) to the tube, and dissociate the cells by gently pipetting up and down.\nCentrifuge it at 300 × g for 5 min at room temperature (25°C).\nDiscard the supernatant containing adipocytes and debris and resuspend the cell pellets in 7 mL culture medium.",
    "Filter the cell resuspension through a 70-μm cell strainer to obtain single-cell suspension of ADSCs.\nSeed the single cells at 1 × 106/mL into 100-mm culture dishes and initially incubate for 72 h at 37°C and 5% CO2.\nPassage the cells or refresh the medium every 2 days.\nPassage every 2 days during normal culture and expansion.\nRefresh the medium every 2 days after photoactivation for up to 21 days.\nPlating of ADSCs for in vitro photoactivation\nTiming: 30 min\nThe femtosecond laser successively activates individual stem cells. Thus, the time for the entire experiment is dependent on the throughput of cells for photoactivation. Therefore, a large amount of ADSCs is quite time-consuming. But too few cells may lead to poor cell growth in subsequent culture. Therefore, the appropriate plating conditions (cell density and total cells) are important in this protocol. In this protocol, initially 1500 cells in a dish is recommended. The part below describes the specific steps of preparing rat ADSCs for photoactivation in vitro. If other types of stem cells are used, the processing time of each step may need to be adjusted accordingly.\nAt cell confluency of 80%, take out the dishes for passaging and plating.\nWash the cells with pre-warmed PBS buffer 3 times.\nAdd 1 mL of 0.25% Trypsin-EDTA for 30 s to digest the ADSCs and then 2 mL of culture medium to terminate it. Transfer the cell resuspension to a new 15-mL tube.\nCentrifuge the tube at 300 × g for 5 min at room temperature (25°C).\nDiscard the supernatant and resuspend the cell pellets in culture medium to obtain 3 × 105/mL cell suspension.\nCarefully drop 5 μL cell suspension at the center of a petri dish with 15-mm glass bottom. The cell number is around 1500 in the dish.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1846-Fig3.jpg",
    "Figure 3. Preparation of photoactivation experiments\n(A) Schematic of cell plating.\n(B) Fluorescence and brightfield images of ADSCs transfected with R-CEPIA1er and G-CEPIA1er (two ER-expressed fluorescent proteins) plasmids. The focus of femtosecond laser is located in endoplasmic reticulum (ER) region. Arrows: the laser activation region. Scale bar, 20 μm. This figure was reused from Tang et al. (2022)[href=https://www.wicell.org#bib10].\nCritical: After dropping 5 μL cell suspension, take special care to prevent the droplet from any movement, to present a clear edge of the cell growth region (Figure 3[href=https://www.wicell.org#fig3]A). All commercial tissue culture (TC) treated glass-bottom petri dishes can work for good adherence of cells. In our experiments, NEST® confocal dishes (Cat. No.: 801002) were used. The adhesion duration of cells was provided here accordingly. If dishes of other brands are used, there might be some variation of adhesion time of cells. Some pre-tests might be needed to explore the cell adherence. See problem 1[href=https://www.wicell.org#sec7.1].\nPlace the dish in the incubator for 2 h at 37°C and 5% CO2 and wait for the cells to adhere to the bottom.\nAdd another 2 mL culture medium and incubate it for 24 h before photoactivation.\nNote: The supplement of culture medium here should be particularly gentle to prevent poorly adherent cells from being washed away.\nIn vitro photoactivation\nTiming: 2 h\nThe following steps apply to the photoactivation of stem cells in vitro.\nTurn on the femtosecond laser source, the confocal microscope and the mechanical shutter. Ensure the shutter is closed. Set the power of femtosecond laser (1030 nm, ∼220 fs, 1 MHz) at 10–15 mW at the specimen.",
    "Note: It is usually necessary to turn on the laser for more than half an hour before the experiment to warm up the laser system for the stability of output power. The Laser power needs to be measured with a power meter. See problem 3[href=https://www.wicell.org#sec7.5].\nSet the excitation laser at 543 nm at 0.5 mW for transmission bright-field microscopy.\nNote: There is no need to set the laser to high power because the morphology of cells can be observed with extremely low excitation power by the confocal transmission bright-field microscopy.\nSet imaging parameter at 800 × 800 pixels, 2.0 μs/pixel (the pixels of each image can be set according to practical imaging preference which should present clear cell images at least). Set the correction collar of the objective at 0.17 (μm).\nCritical: Check the thickness of the glass bottom of the dishes. The correction collar of the objective must match the penetration depth of microscope images through the glass slide. It is important to set it correctly before imaging. If the thickness of glass slide is not 0.17 mm, change the correction collar of the objective accordingly.\nPut the dish with ADSCs on the microscope stage. Tune the objective (60 ×, N.A. = 1.2) vertically to acquire clear bright-field confocal images of cells by the transmission channel.\nCritical: Be sure to use an objective with a high numerical aperture (> 1.0) to obtain the tightly-focused femtosecond laser to confine the thermal effect in the focal volume and obtain the high photon density for multiphoton excitation. There is no need to change the medium before the laser activation experiment.\nSwitch to the point-scanning mode and position the laser focus in the region of endoplasmic reticulum (ER) (cytoplasm near the nucleus) in the target cell. See Figure 3[href=https://www.wicell.org#fig3]B.",
    "Note: Keep the imaging focal plane at the position where the cell topography is clearest in the brightfield image. Empirically, this imaging plane (the objective position at the z-axis) allows the femtosecond laser focused inside the cell in the z direction (vertically in the ER) if the femtosecond laser is strictly collimated. The laser focus should not locate in the edge of cells to prevent the laser focus from staying outside vertically.\nCritical: A calibration between the focus of femtosecond laser and the imaging plane of the transmission bright-field microscopy (confocal fluorescent microscopy) is highly recommended before experiments here. A 3D standard sample for fluorescent microscopy can be imaged by the femtosecond laser (two-photon microscopy) and transmission bright-field microscopy respectively. Tune the objective to get exactly the same images. Record the tuning distance of objective to acquire the image.\nPre-set the opening gate of the mechanical shutter as 200 ms for a single time (10–15 mW at specimen).\nStart the point-scanning and simultaneously open the mechanical shutter as a single-time 200 ms photoactivation to the target cells.\nMove the scan point to the next cell, localize the laser focus to the ER region, and repeat step 28 until all cells in the FOV are photoactivated.\nMove the microscope stage to get the image of the next neighboring FOV.\nRepeat step 28–30 until all cells in the entire dish are activated.\nNote: The cells may deteriorate during photoactivation experiments (steps 25–31). See problem 2[href=https://www.wicell.org#sec7.3].\nChange the medium half an hour after the photoactivation experiment. Culture the cells and change the cell medium every 2 days up to the 21st day after photoactivation.",
    "Note: For the classic drug-induced osteogenic differentiation of ADSCs, it takes about 21 days to complete the differentiation. Here, we perform the Alizarin Red assay on Day 21 and compared the results with dexamethasone-induced osteogenic differentiation. For other types of stem cells, the date of differentiation test can be adjusted accordingly.\nIdentification of differentiated cells\nTiming: 30 min\nHere we describe the procedures for immunofluorescence microscopy and Alizarin Red S staining to access the differentiated osteoblasts (Figure 4[href=https://www.wicell.org#fig4]). In this protocol, we take Runx2 as an example.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1846-Fig4.jpg\nFigure 4. Imaging and laser-activated differentiation of GNPs to GNs in vivo\n(A) The design drawing of the custom stainless-steel mouse adapter.\n(B) Mice are secured to the adapter.\n(C) The blood vessels under the thinned skull become visible. Scale bar, 2 mm.\n(D) The experimental design for photoactivation of GNPs in vivo. Surgery: pre-treatment before photoactivation. Insert: the mice on the stage with anesthesia during the photoactivation experiment. This figure was reused from Tang et al. (2022)[href=https://www.wicell.org#bib10].\nNote: To exclude false-positive signals, both negative and positive controls are required for Alizarin Red staining. ADSCs cultured with dexamethasone osteogenic differentiation medium (DEX) (10 nM dexamethasone, 10 mM β-glycerophosphate, 50 μM L-Ascorbic acid-2-phosphate and 10% FBS in culture medium) is set as a positive control. For more information on the materials, see the key resources table[href=https://www.wicell.org#key-resources-table]. There are several reasons for a low percentage of differentiated cells. See problem 4[href=https://www.wicell.org#sec7.7].\nImmunolabeling of Runx2 on Day 7\nTake out the dishes plated with the photoactivated ADSCs from the incubator. Wash each dish with 1 mL pre-warmed PBS 3 times.\nNote: Pre-warm the PBS to prevent cells from adhering loosely.\nFix the cells with 2 mL pre-warmed 4% paraformaldehyde (PFA) for 15 min.",
    "Wash cells for 3 × 5 min in PBST (PBS with 0.1% Tween 20).\nTreat the cells with 2 mL PBST containing 0.1% Triton X-100 for 15 min.\nWash cells for 3 × 5 min in PBST.\nBlock non-specific adsorption of proteins with 2 mL 5% skim milk in PBST at room temperature (25°C) for 1 h and wash cells in PBST for 3 min.\nIncubate the cells with 2 mL solution of Runx2 primary antibody (1:500 in PBST, rabbit, conjugated with Alexa Fluor® 488) at 4°C overnight (12–16 h).\nWash each dish for 3 × 5 min in PBST.\nCapture the images by confocal microscopy (excited by 473 or 488 nm laser).\nAlizarin red S staining on Day 21\nPrepare Alizarin Red S solution: add 1 g of alizarin red S powder to 50 mL of ddH2O, tune the pH value of the mixture to 4.2 with 10% NH4OH, and filter the solution through a 0.22 μm strainer.\nNote: The prepared Alizarin Red S solution can be stored at 4°C for 1 month in the dark.\nTake out the dishes plated with the photoactivated ADSCs from the incubator. Wash the cells with 1 mL pre-warmed PBS 3 times.\nFix the cells with pre-warmed 2 mL 4% paraformaldehyde (PFA) for 30 min.\nWash each dish for 3 × 5 min in 1 mL ddH2O.\nTreat cells with 2 mL Alizarin Red S solution for 3 min.\nWash each dish for 3 × 5 min in 1 mL ddH2O.\nCapture the images by bright-field microscope.\nPre-treatment of mice for in vivo photoactivation\nTiming: 30 min",
    "For better in vivo imaging and photoactivation of GNPs in the cerebellum, the Math1-GFP; Dcx-DsRed mice are pre-treated before photoactivation. The opaque skull of the mouse is an insurmountable obstacle for deep microscopy. Its thick and uneven internal structure causes extremely large scattering and complex distortion, making it difficult to observe neurons beneath the skull. To overcome this problem, surgery is usually required to thin the skull or establish a localized cranial window for long-term observation. In this protocol, to protect the intact cerebellum from any possible damage of craniotomy, thinning the skull is recommended (Figure 4[href=https://www.wicell.org#fig4]).\nAnesthetize the Math1-GFP; Dcx-DsRed double reporter mouse (20–25 days old, male) with isoflurane (1–2%) in 0.5–1.0 L/min of O2 during surgery. Many GNPs become mature at P21 while there remained quite a few undifferentiated GNPs.\nNote: If this transgenic mouse model is not preferred, any fluorescent dyes to label neurons can be used for visualization of neural stem cells/GNPs in the cerebellum.\nHold the mouse on a custom stainless steel mouse adapter as shown in Figure 4[href=https://www.wicell.org#fig4]A. Apply eye ointment to prevent mouse eyes from drying out.\nWipe the skin above the cerebellum with iodophor. Remove the hair and skin above the cerebellum with sterilized ophthalmic scissors. Use a scalpel to scrape the periosteum from the skull and carefully remove the muscles overlying the cerebellum.\nWipe the surface of the skull with saline mixed with penicillin.\nCritical: This step aims to eliminate any inflammation. See problem 5[href=https://www.wicell.org#sec7.9].\nSlightly thin the localized skull (about 2.0 mm caudal to lambda). Grind the skull very gently with a 0.5mm cranial drill until the underlying blood vessels are visible.",
    "Critical: Use a cranial drill to remove the topmost bone and then the bone trabecula in the middle layer of the skull, and finally grind the lowest layer of bone until the skull deforms with a light touch. The thin-skull surgery has developed into a relatively mature operation procedure, and many protocols and videos have been reported (Marker et al., 2010[href=https://www.wicell.org#bib8]; Yu and Zuo, 2014[href=https://www.wicell.org#bib13]). Be careful not to drill through the skull. Ideally, the blood vessels under the skull are clearly visible when the skull is maximally thinned, while the integrity of the skull is still maintained (Figure 4[href=https://www.wicell.org#fig4]C). Do not injure the blood vessels below the skull. Do not perforate or crack the skull.\nOnce the skull is dry, glue the custom stainless-steel head fixation plate (as shown in Figure 4[href=https://www.wicell.org#fig4]B) to the skull anterior from the lambda with dental cement.\nAfter the dental cement dries, fix the stainless-steel plate to one end of the mouse adapter with medical tape.\nKeep the mouse anesthetized before and during microscopy and photoactivation experiments.\nIn vivo photoactivation\nTiming: 2 h\nTurn on the femtosecond laser source, the confocal microscope and the mechanical shutter. Ensure the shutter is closed. Set the excitation lasers at 473 nm and 543 nm at 0.5 and 0.8 mW respectively. Set the power of femtosecond laser (1030 nm, ∼220 fs, 1 MHz) at 5 mW at the cerebellum.\nPlace the pre-treated mouse on the microscope stage. Move the stage to put the cerebellum under the objective if the microscope is upright. Tune the water-immersed objective (60 ×, N.A. = 1.0) closely to the skull to allow the water on it to contact with the skull.",
    "Note: If the microscope is inverted, lay the mouse on the back on the stage and move the cerebellum to the objective. In this protocol, we take the inverted microscope as an example.\nRun the fast-scanning mode of the confocal microscope, and tune the objective vertically to acquire a clear fluorescent image of the neurons in the cerebellum (Figure 4[href=https://www.wicell.org#fig4]D). The GNPs are indicated by the green fluorescence of Math1-GFP and GNs by the red fluorescence of Dcx-DsRed.\nNote: The number of GNPs is closely related to the age of the mice. Generally, GNPs decrease as the mouse age. At different microscopy depths, different proportions of GNPs and GNs can be observed. GNPs account for the largest proportion at the surface layer. In the deep cerebellum, GNPs decrease but GNs increase. In young mice, GNPs form dense layers with distinct morphological characteristics near the surface. A single layer or the whole cerebellum can be selected for photoactivation.\nActivate the GNPs in FOV one by one by femtosecond laser at 5–10 mW for 200 ms with the same steps in steps 28–31.\nNote: The femtosecond laser power should match the depth of different GNPs. It is difficult here since the cerebellum tissue attenuates the laser greatly along with penetration depth due to the tissue scattering and absorption. The exact laser power inside the cerebellum tissue cannot be measured directly. Some simulation results of laser penetration efficiency in brain tissue can be referenced to estimate the laser power inside. Experientially, at 50 μm below the skull, the required photoactivation power is about 5 mW at the skull; at 150 μm below the skull, the required power is about 7 mW.\nGNPs in another region in the plane or at different depths can be activated subsequently.",
    "Note: When performing photoactivation experiments, carefully record the location of stimulated cells based on vessel and depth information, such that the same area can be re-localized again for observation at some time after photoactivation.\nRe-localize the photoactivation region in steps 44–47. Re-observe and count GNs (red) and GNPs (green) in the photoactivated region in the cerebellum after 24 h. See problem 5[href=https://www.wicell.org#sec7.9].\nNote: The differentiation of GNPs into GNs can be observed after 24 h of photoactivation. The differentiation can also be observed later. Please note after longer time, the recovery and growth of the skull exacerbate the difficulty of re-localizing the photoactivated regions."
  ],
  "subjectAreas": [
    "Cell Differentiation",
    "Microscopy",
    "Neuroscience",
    "Stem Cells"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}