{
  "id": 2223,
  "origin_website": "Cell",
  "title": "Optical analysis of AMPAR-mediated synaptic scaling in mouse hippocampus",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nSample preparation using immunohistochemistry\nTiming: 7 days\nThis section describes the protocol to stain surface AMPARs using an antibody recognizing the extracellular domain of AMPARs.\nDay 1.\nInject mice (9 weeks) intraperitoneally with AM580 (20 mg/kg) or ketamine (5 mg/kg).\nNote: Inject 0.05 mL of 4 mg/mL AM580 or 1 mg/mL ketamine per 10 g of body weight.\nAt 2 h after injection of drug, anesthetize mice with ketamine (100 mg/kg)/xylazine (10 mg/kg) via intraperitoneal injection.\nNote: Inject 0.1 mL of 10 mg/mL ketamine and 1 mg/mL xylazine per 10 g of body weight.\nTranscardially perfuse mice with ice-cold PBS followed by ice-cold 4% PFA in phosphate buffer using tube pump.\nperfuse mice with ice-cold PBS for 6 min at 3 mL/min.\nperfuse mice with ice-cold 4% PFA for 16 min at 3 mL/min.\nDecapitate mouse, open the skull, and extract the brain.\nPlace the brain in a 15 mL conical tube containing 13 mL of 4% PFA and store for 16–24 h at 4°C.\nDay 2–5.\nCryo-protect and freeze brain.\nTransfer brain into a 15 mL conical tube containing 13 mL of 10% sucrose in PBS and store for 16–24 h at 4°C.\nTransfer brain into a 15 mL conical tube containing 13 mL of 20% sucrose in PBS and store for 16–24 h at 4°C.\nTransfer brain into in a 15 mL conical tube containing 13 mL of 30% sucrose in PBS and store for 16–24 h at 4°C.\nFreeze and embed brain using OCT compound on dry ice.\nStore brain sample at −20°C.\nDay 6.\nCut the brain into 25 μm-thick sections using a cryostat.\nTransfer sections using a brush into ice cold PBS and place on ice.",
    "Alternatives: A vibratome could be used to section the brain. Brain slices can be cut using a vibratome after post-fixation. Brain tissue may need to be embedded in low-melting agarose gels.\nWash sections three times in 1× PBS.\nUse a 12 well plate for free-floating sections.\nUse 1 mL of 1× PBS for washing.\nWash sections with 1× PBS while briefly shaking gently.\nRepeat this step three times.\nWhen aspirating solution, use clean Pasteur glass pipette with bent tip to carefully hold sections so it is not inadvertently removed.\nBlock with 5% normal goat serum and 1% BSA without permeabilization.\nUse 1 mL of blocking buffer for 12 well plate.\nIncubate at RT (20°C–22°C) on the shaker at low speed for 1 h.\nPrepare primarily antibody solutions. To stain surface AMPARs, an antibody specific to an N-terminal extracellular epitope of GluA1 (1:400) or GluA2 (1:100) is used.\nPrimary antibody is diluted with blocking solution.\nUse 1 mL of primary antibody solution per well for a 12 well plate.\nNote: We use the anti-GluA1 and -GluA2 antibodies at 1:400 and 1:100, respectively. One would need to confirm optimal primary antibody concentrations for staining typically starting at a 1:50–1:1000 dilution.\nIncubate sections with primary antibody solution for overnight (15–20 h) at 4°C.\nIncubate on the shaker at low speed.\nMake sure brain sections are gently and slowly moving on the shaker to avoid tissue damage.\nDay 7.\nWash sections with 1× PBS three times.\nIncubate at RT (20°C–22°C) on the shaker at low speed (around 50 rpm) for 10 min.\nRepeat this step three times.\nPrepare AlexaFluor 488-conjugated secondary antibody solutions at 1:500 ratio.\nSecondary antibody is diluted with blocking solution.\nUse 1 mL of secondary antibody solution per well for 12 well plate.",
    "Incubate sections with AlexaFluor 488-conjugated secondary antibody for 2 h at RT (20°C–22°C).\nIncubate on the shaker at low speed.\nWash sections with 1× PBS two times.\nIncubate at RT (20°C–22°C) on the shaker at low speed for 10 min.\nRepeat this step once.\nIncubate sections with DAPI in 1× PBS.\nDilute DAPI in 1× PBS at 1:10,000 ratio.\nIncubate at RT (20°C–22°C) on the shaker at low speed for 10 min.\nWash sections with 1× PBS once.\nIncubate at RT (20°C–22°C) on the shaker at low speed for 10 min.\nMount sections using mounting solution.\nMount free-floating sections in 1× PBS on the glass slide.\nPlace the slide with the mounted section in the dark until dry.\nEmbed the mounted section using Aqua-Poly/Mount mounting solution and a coverslip.\nPlace the samples on a slide tray at RT (20°C–22°C) for overnight in the dark.\nStore the sample at 4°C in the dark.\nConfocal imaging\nTiming: Typically it takes ∼10 min for 1 image with several hours required in total (depending on the number of images)\nThis section describes the strategy to provide images of surface AMPARs in dendritic regions of hippocampal CA1.\nAcquire images of the dendritic region of hippocampus neurons using confocal microscopy.\nTake confocal fluorescence z-stack images (0.5 μm intervals, 10 images at scan zoom of 8, 17.86 μm × 17.86 μm image size) of the stratum radiatum of the dorsal hippocampal CA1 in the brain section using a ZEISS LSM 510 with a 63× objective (NA 1.4, oil) at 1.504 × 1.504 pixels resolution.\nMultiple images should be taken from multiple sections of similar stereotaxic coordinate.\nTake images under the same conditions of laser power and gain without saturation.",
    "Note: To take confocal images from the stratum radiatum of the dorsal hippocampal CA1 in the brain section, initially locate the pyramidal layer of CA1 with a 10× or 20× objective. Then, focus this region with a 63× objective and move focus to the stratum radiatum. We usually take two z-stack images from 1 section which are localized in proximal dendrites. Expected images are shown in Figure 2[href=https://www.wicell.org#fig2] of this paper and Figure 5 of Suzuki et al. (2021)[href=https://www.wicell.org#bib7].\nImaging analysis\nTiming: The imaging analysis can take several hours to days. Specifically, it will take time to determine the optimal parameter to isolate puncta (see steps 22 and 23)\nThis section explains details to isolate AMPAR puncta using Fiji/ImageJ and build rank order plots for analyzing synaptic weight.\nOpen images in Fiji. Project Z-stack images to single image by summation. Save images in TIF file.\nProjection of Z-stack images: Image – Stacks – Z project – Sum slice.\nSave image: Save as – Tiff.\nTo remove background, threshold images using Li’s minimum cross entropy algorithm which is one of threshold program in Fiji/ImageJ.\nOpen image: File | Open.\nDecide threshold: Image | Adjust | Threshold – select Li – apply – set to NaN (Not a Number).\nSubtract background: Process | Math | Subtract minimum intensity.\nSave image: Save as – Tiff.\nTo enhance contrast, apply a fast Fourier transform (FFT) band pass filter to the image which background is removed (Figures 1[href=https://www.wicell.org#fig1]A and 1B).\nConvert image to 8 bit: Image | Type – 8 bit.\nApply FFT band pass filter: Process | FFT – Bandpass Filter – select minimum and maximum feature sizes.",
    "Critical: Need to decide the criteria for FFT/bandpass filter. We have selected 50 and 7 pixels for large and small structures in our images. This parameter affects outcome of puncta size (Figures 2[href=https://www.wicell.org#fig2]A–2D).\nSegment adjacent puncta using the Interactive Watershed program (Figures 1[href=https://www.wicell.org#fig1]C, 1D, 3[href=https://www.wicell.org#fig3]A, and 3B).\nOpen Interactive Watershed: SCF | Labeling | Interactive H_Watershed.\nApply Interactive Watershed: Set seed dynamics. Set intensity threshold, which was determined by Li’s minimum cross entropy threshold. Peak flooding (in %) is set to 100. Click allow splitting. Click export regions mask. Then, click export. A new file will be shown as binary image with H-Watershed segmentation.\nNote: The setting of parameters is crucial to determine the segmentation of each punctum accurately. We have set seed dynamics to 3 (Figure 3[href=https://www.wicell.org#fig3]A). The intensity threshold is determined by Li’s minimum cross entropy threshold (Figure 3[href=https://www.wicell.org#fig3]B). While we have used 100% in peak flooding, this can be decreased slightly to select the precise punctuate area (Figures 2[href=https://www.wicell.org#fig2]A, 2B, and 3[href=https://www.wicell.org#fig3]A). These criteria need to be optimized depending on the image quality. Always refer to the original image before determining these criteria. The same criteria for seed dynamics and peak flowing should be used in the analysis of all images. See the website which provides a detailed explanation of Interactive Watershed plugin (also, see before you begin[href=https://www.wicell.org#before-you-begin]), which includes more information about the settings and the criteria.\nUsing binary image, determine the regions of interest (ROIs) for individual punctum by particle analysis. Area criteria are set to 0.05–1 μm2. Theoretical lateral resolution in the confocal image is calculated to 178 nm (0.51× λexc/NA=0.51∗488 nm/1.4). 0.05 μm2 is larger than 0.0313 μm2 (Square meter of 177 nm × 177 nm). Then, measure area and intensity of puncta from the image which is subtracted background (Figure 1[href=https://www.wicell.org#fig1]E).",
    "Perform particle analysis: Analysis | Analysis particles – set size to 0.05–1.\nMeasure area and mean intensities of puncta in image obtained from z-stack image with background subtraction using ROI manager.\nSave these values in an Excel worksheet.\nNote: We calculate theoretical lateral resolution in confocal image using the following equation (0.51× λexc/NA). If a dye such as AlexaFluor 555 or 647-conjugated secondary antibody is used, area criteria should be changed. Since these secondary antibodies could reduce imaging resolution due to the lateral resolution changes, we recommend to use dye for the green channel. Since background is set to NaN, small puncta (<0.05 μm2) may be detected. If so, do not select these puncta in further analysis.\nMake a list including area and total intensity in Excel.\nCalculate total intensity of puncta by multiplying the area by average intensity.\nGenerate histogram for area of puncta and perform nonlinear fitting with Gaussian using GraphPad prism. This analysis gives the number of Mean and SD values from Gaussian distribution (Figures 4[href=https://www.wicell.org#fig4]A and 4B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1697-Fig4.jpg\nFigure 4. Strategy for plotting rank ordered plot\n(A) Distribution of individual GluA1 puncta area size in vehicle treatment (n=3824 from 4 mice). The histogram was fitted by Gaussian distribution (Mean + 3SD=0.272 μm2). 3743 puncta were selected as single postsynaptic structure.\n(B) Distribution of individual GluA1 puncta area size in AM580 treatment (n=3998 from 4 mice). The histogram was fitted by Gaussian distribution (Mean + 3SD=0.262 μm2). 3902 puncta were selected as single postsynaptic structure.\n(C) Rank ordered plot for GluA1 intensity compared between vehicle and AM580 treatment. (Linear regression, slope= 1.21, n=3743). Blue area includes 90% fraction of GluA1 puncta.\n(D) Rank order plot is built with 90% of GluA1 puncta. (Linear regression, slope= 1.21, n=3368). Figure adapted with permission Suzuki et al. (2021)[href=https://www.wicell.org#bib7].",
    "Copy the number of areas in Excel and paste it in GraphPad Prism.\nMake histogram at 0.025 bin width.\nApply Gaussian using nonlinear fitting.\nObtain the number of Mean and SD from Gaussian distribution.\nCalculate the number of Mean+3SD.\nSelect puncta that exist within that area range in Excel.\nNote: The value of Mean+3SD from Gaussian distribution is determined when considering the range of area for a single postsynaptic structure. In contrast, large puncta outside these fits may be attributed to fluorescence values originating from multiple adjacent postsynaptic sites.\nPlot rank ordered plot (Figures 4[href=https://www.wicell.org#fig4]C and 4D).\nTo compare total intensity of all selected puncta with vehicle and drug treatment in rank ordered plot, match the number of puncta between vehicle and drug treatment condition using RAND function in Excel. The Excel RAND function gives a random number between 0 and 1.\nPlace total intensity of all selected puncta and a random number in parallel in columns in the Excel worksheet. Then, the numbers are sorted from smallest to largest according to the random number column. In this way, the total intensities of puncta can be randomized.\nAfter matching a number to each punctum total intensity, rank these puncta total intensities from smallest to largest to build the rank order plot.\nApply linear regression in Prism. Force the line to go through 0 at X and Y and obtain the slope from this linear regression.\n0%–90% fractions of total intensities are shown in figure (Figure 4[href=https://www.wicell.org#fig4]C) since higher intensities show supralinear or sublinear distribution.\nRepeat this process at least three times since the slope in linear regression may vary slightly depending on the degree of randomization. Take intermediate data and consider it as better randomization.",
    "Alternatives: Several other spreadsheet based plotting software options (Sigma Plot etc.) or custom scripts can be used to plot the rank ordered plot."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Neuroscience",
    "Microscopy"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}