{
  "id": 6494,
  "origin_website": "Bio",
  "title": "Isolation of Cancer Epithelial Cells from Mouse Mammary Tumors",
  "procedures": [
    "Sacrifice or anesthetize the animal and restrain the animal by pinning its feet into a foam surface using pushpins. Make a parallel incision from the base of the tail up to the neck along the mouse’s abdomen, careful not to puncture the peritoneum. Gently pull back the skin and pin it to the foam surface to reveal the tumor(s). Cut the tumor free from the skin and the body, carefully removing as much excess tissue surrounding the tumor as possible.Store the harvested tumors in serum-free DMEM/F12 medium on ice until the digestion procedure. Notes: Tumors should be digested as soon as possible after removal. We would not recommend more than 1 h on ice.In a 10 cm Petri dish, mince the tumor (0.5-1.0 mg or more dependent on experimental needs) into 1-2 mm pieces using a razor or scalpel and place into a 50 ml conical tube. This should be performed in a biological cabinet at room temperature. A small amount of digestion medium can be added to the tumor to make mincing easier. It is not essential to mince the cells on ice. The tumors should be minced efficiently but not in a rush so as to leave pieces that are too large.Add the digestion medium to the 50 ml conical tube in a 10:1 ratio to the volume of the tumor such that there is approximately ten times more digestion medium in the tube than tumor.Place the tube securely onto an incubated shaker in an inclined position such that the medium and tumor are constantly mixing. Digest the minced tumors for 3-5 h at 37 °C. Though some pieces of tumor may remain, check that most of the tumor has been dissolved for thorough digestion.Dilute the digested mixture with DMEM/F12 containing 0.",
    "2% BSA at a 1:1 ratio with the digested tumor. This will lead to a doubling of the volume.Filter the mixture through a 40 micrometer sterile nylon mesh cell strainer into another sterile 50 ml conical tube. From this point forward, keep cells on ice at all times except during centrifugation and digestion with Accutase.Spin down the filtered cells at 200 x g for 5 min and remove supernatant.Resuspend the cells in an appropriate volume of DMEM/F12-0.2% BSA to wash (~1 ml per ml cell pellet).Spin down the cells again at 200 x g for 5 min and remove supernatant.In order to lyse red blood cells contaminating the pelleted cells, mix 4 ml NH4Cl and 1 ml PBS-1.0% BSA (4:1 ratio) first and use this mixture to resuspend the pellet (these calculations are appropriate for a pellet that occupies a volume of approximately 5 ml. The amount of NH4Cl and PBS-1.0% BSA should be adjusted for the size of the pellet with the ratio remaining 4:1). Leave the cells in the solution for 2-3 min at room temperature depending on the amount of RBC contamination, which can be determined by the presence of red color. If the tumor is well-vascularized and the pellet is very red in color, repeat the procedure until the red color diminishes.Spin down the cells at 200 x g for 5 min and remove supernatant.Wash the cell pellet in DMEM/F12-0.2% BSA and spin down cells. Repeat this step several times until the supernatant becomes clear. If cells are clumped together during medium washing, digest the 1-2 x 106 cells with 1 ml Accutase for 10 min at 37 °C to dissociate aggregated cells.Add 2 ml DMEM/F12-0.2% BSA per 1 ml Accutase and mix by pipetting to neutralize the reaction of the enzyme.",
    "Spin down cells at 200 x g for 5 min and wash cells using PBS.Remove supernatant and suspend in an appropriate volume of PBS for the pellet size (~1 ml per ml of pellet present). Store cells on ice until isolation.Lineage marker negative (Lin─) epithelial cells from mammary glands can then be isolated using the EasySep negative selection kit according to the manufacturer’s instructions. This will remove unwanted cells by targeting these cells with antibodies against non-epithelial cells. The Lineage marker positive (Lin+), non-epithelial cells are attracted to the magnet required for use with the EasySep negative selection kit and desired cells remain free to be collected. This yields a purified epithelial sample for use in other experiments.Isolated cells can be kept on ice for at least 1 h until they are used for experimental analyses. Isolate cells can also be kept in appropriate cell freezing medium and then stored at -80 °C or in liquid nitrogen for long-term storage."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}