{
  "id": 16968,
  "origin_website": "Jove",
  "title": "Laparoscopic Posterior Radical Antegrade Modular Pancreatosplenectomy for Distal Pancreatic Carcinoma",
  "procedures": [
    "The surgical procedure was approved by the institutional review board at The First Affiliated Hospital of Jinan University. The patient, a 58-year-old female, was admitted with a chief complaint of \"abdominal pain for 2 months.\" A computed tomography (CT) scan conducted at an external hospital revealed a space-occupying lesion in the distal pancreas, raising concerns about the possibility of pancreatic carcinoma. Before the surgery, the patient provided written informed consent. The surgical tools and equipment used for this procedure are listed in the Table of Materials.\n1. Preoperative preparation\nPrior to the surgery, conduct preoperative blood tests, including a complete blood count, liver and renal function tests, coagulation function test, and serum tumor biomarkers detection10,11.\n\tNOTE: The blood sample was drawn by the nurse and sent to the laboratory, where various blood tests were performed, and the results were reported. Serum tumor biomarkers detection revealed elevated levels of carcinoembryonic antigen (48.34 ng/mL) and carbohydrate antigen 125 (131.1 U/mL)10,11.\nPerform preoperative electrocardiogram, abdominal magnetic resonance imaging (MRI), chest CT, and other related examinations10,11.\n\tNOTE: In this study, the patient underwent abdominal MRI in the Medical Imaging Department. The results of abdominal MRI indicated that the size of the pancreatic body and tail mass is approximately 3.5 cm × 3.0 cm × 3.0 cm, suggesting an epithelial-derived malignant tumor (Figure 1).\n2. Surgical technique\nAfter tracheal intubation and general anesthesia (following institutionally approved protocols)12, place the patient in a supine position with their legs apart. Perform routine disinfection with povidone iodine solution.\n\tNOTE: The chief surgeon is located on the right side of the patient, the assistant is on the left side, and the endoscope holder is positioned between the patient's legs.",
    "Make a longitudinal incision of approximately 1 cm through the umbilicus, insert a pneumoperitoneum needle, inject carbon dioxide gas to maintain an abdominal pressure of 12 mmHg, and place a 10 mm trocar and a 30-degree laparoscope.\nExplore the abdominal cavity to determine if there is any tumor metastasis. Under direct vision, place a 5 mm trocar in the left middle abdomen and right upper abdomen, respectively, and a 10 mm trocar in the left upper abdomen and right middle abdomen, respectively (Figure 2).\nUse non-invasive forceps to lift and pull the stomach toward the cephalic side, and cut the gastrocolic and gastrosplenic ligaments at the upper edge of the transverse colon using an ultrasonic-harmonic scalpel (Figure 3).\nSeparate the stomach and spleen by ligating and severing the left gastroepiploic vessels, short gastric vessels, posterior gastric vessels, and left subphrenic vessels near the gastric wall. Enter the lesser omental sac and expose the pancreas. Explore the condition of the pancreatic tumor (Figure 2).\nSeparate and expose the common hepatic artery, and remove the lymph nodes adjacent to the common hepatic artery. Suspend the common hepatic artery, separate and expose the celiac trunk and the left gastric artery, and dissect the surrounding lymph nodes (Figure 4).\nIncise the retroperitoneum from the pancreatic neck to the pancreatic tail at the lower margin of the pancreas, and remove the surrounding lymph nodes. Continue to incise the anterior layer of the left Gerota fascia at the lower margin of the pancreas to reveal the left renal vein. Peel the anterior layer of Gerota fascia from the surface of the left kidney along the left renal vein (Figure 5).",
    "Lift the distal pancreas toward the cephalic side to expose the superior mesenteric artery (SMA) and abdominal aorta, and dissect the surrounding lymph nodes at the same time (Figure 5). Separate and expose the superior mesenteric vein (SMV) at the lower margin of the pancreatic neck, and separate the retropancreatic tunnel along the surface of the SMV and portal vein.\nSever the pancreas at the neck with a linear stapling device (Figure 6 and Figure 7). Dissect and expose the splenic vein, ligate and sever the root of the splenic vein (Figure 7). Dissect and expose the splenic artery, and remove the surrounding lymph nodes. Then, ligate and cut off the root of the splenic artery (Figure 4).\nLift the pancreas and the anterior layer of the Gerota fascia toward the cephalic side to expose the left adrenal vessel and sever it (Figure 5). Continue to peel off the anterior layer of the Gerota fascia and the left adrenal gland upwards (Figure 5 and Figure 8).\nAbove the pancreas, cut off the posterior peritoneum from right to left along the stomach wall. Clear the connective tissues between the abdominal aorta and the left kidney along the left crus of diaphragm. Sever the Gerota fascia tissues at the upper margin of the left adrenal gland (Figure 8).\nRelease the spleen by severing the ligaments and adhesions around the spleen, and ultimately remove the distal pancreas, the anterior layer of the Gerota fascia, the left adrenal gland, and the spleen as a whole (Figure 8). Place the excised specimen into a specimen bag.\nIrrigate the abdominal cavity with sterile distilled water. Carefully examine the surgical field for active bleeding, pancreatic leakage, and gastrointestinal collateral injury. Place a drainage tube beside the incisal margin of the pancreas.",
    "Extend the umbilical incision to about 5 cm in length, cut the abdominal wall layer by layer, and take out the specimen. Send the specimen for intraoperative rapid frozen pathological examination to see whether there is cancer at the incisal margin of the pancreas (Figure 9).\nCheck the number of surgical instruments and gauzes, and remove the trocars under direct vision. Finish the operation after suturing the abdominal wall incisions using 5-0 polypropylene suture.\n3. Postoperative procedures\nSend the patient back to the ward safely after resuscitation.\nAdminister intravenous antibiotics and somatostatin after the surgery.\nStart a fluid diet on the first day after surgery.\nSend the abdominal drainage fluid to the laboratory every day to check the amylase concentration.\nRemove the abdominal drainage tube on the fourth day after surgery.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}