{
  "id": 19750,
  "origin_website": "Wiley",
  "title": "High-Resolution Multiparameter DNA Flow Cytometry for Accurate Ploidy Assessment and the Detection and Sorting of Tumor and Stromal Subpopulations from Paraffin-Embedded Tissues",
  "procedures": [
    "The first part of this protocol describes the generation of cell suspensions from FFPE carcinoma tissue blocks. It is an alternative to earlier HIAR and pepsin- or trypsin-based protocols. Instead, cells are obtained after pretreatment of thick FFPE tissue rolls by HIAR, followed by dissociation with an enzyme mixture composed of collagenase Ia and dispase. An enrichment step by taking FFPE cores of preselected tissue area can be applied to samples with low percentages of tumor cells. Dissociation with collagenase/dispase is relatively mild, and cellular morphological characteristics are maintained. Two dissociation procedures are described: one makes use of nylon biopsy bags allowing the cells to be isolated via a centrifugation step; but a second procedure is described using the gentleMACSTM, allowing mechanical disruption of the predigested tissue followed by cell isolation (see also Strategic Planning and Fig. 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-fig-0001] at the end of this article). In addition to epithelial (carcinoma) cells, stromal cells can be detected after this dissociation procedure. These cells can be used as reference for diverse techniques, including accurate ploidy measurements of FFPE tissues and detection of chromosomal aberrations.",
    "In turn, the second part of the protocol is specifically designed for the simultaneous labeling and measurement of epithelial cells (keratin-positive, FITC fluorescence), stromal cells (vimentin-positive, RPE or APC or Alexa FluorTM 647 (AF647) fluorescence), and DNA content (DAPI or PI fluorescence) using a flow cytometer equipped with ultraviolet (UV; 355 nm), violet (violet; 405 nm), and/or blue (488 nm) and red (633 nm) excitation lasers (see as examples Figs. 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-fig-0004] to 8[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-fig-0008]). It has the advantage over the alternate protocols in that hardly any correction for spectral spillover of the DNA dye (DAPI) is necessary (Fig. 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-fig-0004] and 6[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-fig-0006]). The spectral spillover of PI into the FITC or Alexa FluorTM 488 and APC or AF647 emission spectrum is limited (Fig. 7[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-fig-0007] and 8[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-fig-0008]). However, other dye combinations can also be used (see Alternate Protocols 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-prot-0002] and 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-prot-0003], and Background Information) depending on the configuration of the flow cytometer, cell sorter, or image-based sorter (Bolognesi et al., 2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-bib-0006]).\nThe third part of this protocol demonstrates how to measure the keratin, vimentin, and DNA-labeled cell suspensions, and how to calculate the DNA index of the samples.\nMaterials\nFormalin-fixed, paraffin-embedded tissue sample (carcinoma), H&E-stained: see Hofman & Taylor (2013[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-bib-0030]) and Zeller (1989[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-bib-0058])\n100% xylene (e.g., Merck, Sigma-Aldrich, cat. no. 108684, CAS 106-42-3)\n100% (v/v), 70% (v/v), and 50% (v/v) ethanol in distilled water\nMilli-Q water (instrument for highly purified water can be obtained from Veolia or Merck)\nHeat-induced antigen-retrieval (HIAR) buffer (see recipe)\nPhosphate-buffered saline (PBS; see recipe)\nRPMI 1640 medium (can be obtained ready-to-use from: e.g., Invitrogen Life Sciences, (http://www.invitrogen.com/site/us/en/home.html[href=http://www.invitrogen.com/site/us/en/home.html]; cat. no. 11875093)\nDissociation solution (see recipe)\nHematoxylin, ready-to-use (e.g., Merck, cat. no. 51275)\nCrushed ice (ice making machine, MRC Laboratory Instruments, cat. no. XB-30)\nPBS/BSA/Tween (PBATw buffer; see recipe)\nPrimary reagents (see recipe):",
    "anti-keratin clones AE1/AE3 IgG1 (ThermoFisher Scientific, cat. no. A500-019A)\nanti-keratin clone MNF116 IgG1 (Agilent, Dako, cat. no. M082101)\nanti-vimentin clone Vim 3B4 IgG2a (Agilent, Dako, cat. no. M702001) or\nanti-vimentin clone V9-2b IgG2b (http://www.abforresearch.nl/new2/catalog/moabs/V9-2B.htm[href=http://www.abforresearch.nl/new2/catalog/moabs/V9-2B.htm]; cat. no. ARA27)\nSecondary reagents (see recipe):\n               \ngoat anti–mouse IgG1-FITC (e.g., SouthernBiotech cat. no. 1070-02) or\ngoat anti–mouse IgG1-Alexa FluorTM 488 (ThermoFisher Scientific, cat. no. A-21121\ngoat anti–mouse IgG2a-RPE (e.g., SouthernBiotech cat. no. 1082-09 or\ngoat anti–mouse IgG2b-RPE, e.g., SouthernBiotech cat. no. 1092-09)\nDNA staining solution containing 4′,6-diamidino-2-phenylindole (DAPI; Merck cat. no. 508741, CAS 28718-90-3 (see recipe)\nDNA staining solution containing propidium iodide (PI) and RNase A (see recipe)\nNylon biopsy bags EprediaTM (31 × 43–mm, normally used for fixing and dehydration of biopsies; e.g., Fisher Scientific, cat. no. 11932355\nPair of tweezers (steel)\nAn ordinary cigarette lighter\n2.0 mm punch set for the Beecher tissue arrayer, AlphaMetrix Biotech, cat. no. MP20\nTissue arrayer, AlphaMetrix Biotech, cat.no. MTA-1\ngentleMACSTM, Miltenyi Biotec, cat. no. 130-093-235\ngentleMACSTM C Tubes (Miltenyi Biotec, cat. no. 130-093-237)\nMicrotome, e.g., Leica BioSystems, HistoCore BIOCUT, cat. no. 149BIO000C1, blades cat. no. 3802112\npH meter, e.g., HANNA Instruments\n13 × 100–mm Pyrex (glass) disposable culture tubes, capacity 10.0 ml, e.g., Merck, Corning, cat. no. CLS9944513\nTube racks (e.g., FisherbrandTM DelrinTM, cat. no. 15340380, 15340390 and 15340400)\nAny safety cabinet with an air-controlled hood\nNitrile examination gloves, powder free, e.g., FisherbrandTM¸ ThermoFisher Scientific, cat. no. 15642367 (medium, number is glove-size dependent)\n80°C and 37°C water baths, e.g., PURA 4, VWR, cat. no. 462-0625P\nVortex, e.g., MS 3 basic IKA, cat. no. 0003617000\n1.5-ml microcentrifuge tubes e.g., Merck, Eppendorf Biotech, cat. no. Z606340\nBrandTM Bürker (or equivalent) cell count chamber, Fisher Scientific, cat. no. 10513451\nStandard microscope e.g., Zeiss Primovert Tissue Microscope\n12 × 75–mm (5 ml, FalconTM, e.g., Scientific Lab Supplies, cat. no. 352052)",
    "CellTrics 50-μm and 100-μm nylon mesh filters (e.g., Sysmex or equivalent, cat. no. 04-004-2317 and cat. no. 04-004-2318, respectively)\nCentrifuge with cooling device (maximum g needed: 1000 × g), e.g., Heraeus CryofugeTM 5500i\nMicropipettes (range 1- to 1000-μl, Eppendorf Bioteck or LabSystems or equivalent)\nMicrotips (1-2 μl, 1-10 μl, 10-200 μl, 100-1000 μl (Eppendorf Bioteck, or LabSystems, or Greiner Bio-ONE or equivalent)\nConventional refrigerator (2°C to 8°C)\nFlow cytometer equipped with UV (355 nm) or violet (405 nm), blue (488 nm) and red (633 nm) excitation and filters for collection of blue (BP 450/50 nm), green (BP 530/30 nm), orange (BP 575/26 nm) or red (610/20 nm), and infra-red (BP 670/14 nm, or >670 nm) fluorescence. Filter configurations can vary between different types of instruments.\nImaging device capable of collecting blue (DAPI), green (FITC or Alexa FluorTM 488) and orange (RPE) fluorescence. (e.g., DEPArrayTM PLUS, Menarini Silicon Biosystems (sorting capabilities) or the NucleoCounter® NC3000TM, ChemoMetec (imaging only)\nAdditional reagents and equipment for immunohistochemistry (see Current Protocols articles Hofman & Taylor, 2013[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-bib-0030]; Zeller, 1989[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-bib-0058])\nIMPORTANT NOTE: For imaging cell suspensions stained for DNA, keratin, and vimentin, the following combination of fluorescent dyes is recommended: DAPI (DNA), Alexa FluorTM 488 (keratin), and Alexa FluorTM 647 (vimentin). Labels for keratin and vimentin can be interchanged. The fluorescent dyes FITC and RPE (also accounts for APC) are more sensitive to fading due to the longer exposure times used for acquisition of images compared to flow cytometers.\nPrepare cell suspensions from FFPE carcinomas",
    "There are two alternative procedures for doing this, both of which are described in the steps below: one involving use of a nylon biopsy bag for containing the sample during treatment and the other involving the use of the gentleMACSTM instrument and C-Tubes from Miltenyi Biotec. For the gentleMACSTM procedure, skip step 1a and b and carry out the dissociation in C-Tubes as in the instructions below. The following instructions will focus on the nylon bags; see variations for C-Tubes in step 3.\n1. Prior to tissue sectioning, prepare a nylon biopsy bag.\n         \nObtain a nylon biopsy bag.\nBiopsy bags are obtainable from different companies. Bags larger than 3 × 5 cm need to be resized (next step of this protocol), or, depending on the size (large bags), cut in half. Keep the width of the bag wider than the diameter of the glass tube. This way, the bag can be fixed at the bottom of the tube, allowing easy handling of fluids (see Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-fig-0002] at the end of this article for detailed instructions).\nIf necessary, cut away superfluous nylon using a pair of scissors. With a pair of tweezers, tightly close an open boundary of the nylon bag keeping the legs of the tweezers parallel to the opening. Let a few millimeters of the open boundary stick out. Light the cigarette lighter and melt the nylon with a small flame (Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-fig-0002]).\nThree of the four boundaries must be sealed, leaving one open.\n2. Prepare tissue cores prior to sectioning (Fig. 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-fig-0003] at the end of the article).",
    "Tissue cores can be very useful when a sample contains small areas of malignant cells enclosed by abundant stroma, e.g., as can be observed in lung cancer (Bolognesi et al., 2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-bib-0006]). This way, the sample can be enriched for cancer cells. However, compared to whole tissue sections, the surface area content ratio is changed, and the sample might contain more sliced nuclei, impairing DNA histogram quality.\nWhen taking whole sections instead of tissue cores from the tissue block, go to step 3, substep b.\nTo take the core, have an experienced pathologist select the area of interest of the H&E-stained FFPE tissue section with a waterproof marker using a light microscope (Fig. 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-fig-0003]).\nPrepare a clean recipient paraffin block and drill 2.0-mm-diameter cores (number of cores depends on the number of tissue cores that will be taken) using the red recipient puncher by simultaneously punching and swinging the puncher sideways.\nSee Hofman & Taylor (2013[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-bib-0030]) and Zeller (1989[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-bib-0058]) for basic immunohistochemical procedures.\nOrient the marked-up H&E-stained section in such a way that the section matches the contours of the corresponding tissue in the paraffin tissue block.\nCopy the boundaries of the marked-up area of H&E-stained section on the tissue block using a permanent marker.\nUsing a tissue arrayer, punch 2.0-mm-diameter tissue cores (blue donor punch, Fig. 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-fig-0003]) within the marked-up area (number of cores needed will depend on the depth and type of the tissue and must be empirically explored).\nTransfer the punches to the paraffin recipient block containing the 2.0-mm-diameter pre-drilled empty cores.\nStore the block overnight at 37°C.\nThis way the punches will be properly fixed into the recipient paraffin.\n3. Cut FFPE tissue sections, collect tissue, and deparaffinize.",
    "Two sections of tissue block with an approximate 1-cm2 surface are sufficient to isolate several million cells. For the punch-recipient block, 20-30 sections are needed. The optimal number depends on the tissue type, but also on the number of punches (cores) enclosed in the recipient paraffin block.\nIf using the gentleMACSTM, collect the sections directly into C-Tubes, put the tubes in a tube rack, and go to step 3, substep f. If not, when using nylon biopsy bags, start from substep b, below.\nIf using nylon biopsy bags, carefully collect the 60-μm sections (paraffin rolls) in the nylon bag via the last opening.\nClose the nylon bag as described in step 1, substep b. (see also Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-fig-0002]).\nCAUTION: Do not heat up the tissue roll.\nPut the bag containing the tissue roll(s) at the bottom of a clean 10.0-ml Pyrex glass disposable culture tube(s).\nPut the tube(s) in a tube rack and place the tube rack containing the tube(s) in a safety cabinet with an air-controlled hood.\nAdd 5.0 ml of 100% xylene to the glass tube(s) until the nylon bag with the tissue roll(s) is completely immersed. If using C-Tubes, add 5.0 ml of 100% xylene to the C-Tube(s) with the section(s).\nLet stand for 10 min at room temperature in the safety cabinet.\nDiscard the xylene, re-immerse the sections in the tube(s) or the bag completely in fresh xylene, and let stand for another 10 min at room temperature.\nRepeat step 3, substep h.\nCAUTION: Xylene is harmful and can cause irritation, e.g., of the skin and eyes. Long exposure can cause neurological damage. Wear protective nitrile examination gloves. Xylene is also harmful to the environment. It must be collected in special containers for organic solvents and should not be discarded down the sink.",
    "Discard the 100% xylene and rehydrate the sample by sequential incubation in each of the following:\n               \n100% ethanol, three 5-min changes\n70% ethanol, three 5-min changes\n50% ethanol, three 5-min changes\nMilli-Q water, once for 5 min.\nDo not allow the tissue roll(s) to dry. Always re-immerse the bag completely for each sequential incubation. This also applies for the following steps.\nSubstitute the Milli-Q water with HIAR buffer, pH 6.4, at room temperature. Immerse the bag completely.\nRefresh the HIAR buffer after 5 min with prewarmed HIAR buffer (80°C) and place the sample tube in an 80°C water bath for 60 min.\nTake out the tube containing the sample bag from the 80°C water bath and let it cool down to room temperature.\nThis will take ∼20 to 30 min.\nWash the sample twice, each time for 5 min with PBS.\nReplace the PBS with plain RPMI 1640 medium, pH 7.6.\nAfter 5 min, replace RPMI 1640 medium with prewarmed dissociation solution. Ensure that the nylon bag containing the sample is completely immersed in the RPMI-enzyme mixture.\nIncubate the sample 30 to 120 min in a 37°C water bath.\n               \nFor nylon bags: Monitor the dissociation process by swirling the sample on a vortex every 15 min until the tissue section(s) disintegrate.\nFor C-Tubes: Put the C-Tube(s) in the gentleMACSTM after 15 min of incubation. Select program 3.2: SPLEEN followed by RUN (16 sec). Repeat the dissociation process every 15 min until the tissue section(s) are disintegrated.\nThe solution will get cloudy. This is indicative of cell release. Optimal dissociation is tissue- (type-), time-, and temperature-dependent (Corver et al., 2005[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-bib-0016]). Do not completely digest the sample, as this might induce bare nuclei and debris. Some optimization might be needed\nMonitor dissociation more precisely as follows:",
    "Take a small aliquot from the sample (10 μl), put it in a 1.5-ml microcentrifuge tube, and add 40 μl of hematoxylin.\nMix well and count the number of cells (nuclei will be stained dark blue) using a Bürker counter chamber and a standard microscope.\nStop the dissociation process by putting the sample on ice as soon as the cell numbers of two consecutive 15-min counts are approximately identical.\nTransfer the cells through a 100-μm mesh nylon filter into a FACS tube (12 × 75–mm) and spin down the cells by centrifuging 5 min at 1000 × g, using a pre-cooled centrifuge (4°C).\nWash the pellet twice with 2 ml ice-cold PBATw (4°C), and spin down 5 min at 1000 × g, using a pre-cooled centrifuge (4°C). Discard the supernatant after each wash.\nAdd 2 ml of ice-cold PBATw to the cell pellet, vortex, take a 10-μl sample, and put it in a 1.5-ml microcentrifuge tube. Dilute cells 1:5 in hematoxylin and count cells using a Bürker counter chamber and a standard microscope.\nPerform immunocytochemistry for keratin and vimentin, and DNA labeling for UV or violet and blue excitation\n4. Take four 12 × 75–mm tubes, pipet 1 × 106 cells in each, and spin cells down by centrifuging 5 min at 1000 × g, 4°C.\nThe different cell fractions, including controls, are stained for keratin, vimentin, and DNA according to the scheme shown in Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-tbl-0001]. For simultaneous keratin/vimentin staining, the following MAb clones (and dilutions) can be used: MNF116 (1:50), AE1/AE3 (1:100), and V9-2b (1:50). These dilutions are recommendations. To ensure optimal performance of the essay titrate antibodies in your hands in your lab.\nTable 1.\n                Labeling Scheme for Measurement of Epithelial Cells (Keratin-Positive, FITC), Stromal Cells (Vimentin-Positive, RPE), and DNA Content (DAPI)\ntable:",
    "﻿Tube #,Primary reagent,Secondary reagent,DNA staina\n1,Staining buffer,GaMIgG1-FITC/GaMIgG2b-RPE,DAPI\n2,Anti-keratin,GaMIgG1-FITC/GaMIgG2b-RPE,DAPI\n3,Anti-vimentin,GaMIgG1-FITC/GaMIgG2b-RPE,DAPI\n4,Anti-keratin/anti-vimentin,GaMIgG1-FITC/GaMIgG2b-RPE,DAPI\na Requires a flow cytometer equipped with UV (355 nm) or violet (405 nm) and blue (488 nm) excitation; for alternative DNA stains, see Alternate Protocols 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-prot-0002] and 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-prot-0003]. GaM = Goat anti-mouse; FITC = fluorescein isothiocyanate; RPE = R-phycoerythrin; DAPI = 4′,6-diamidino-2-phenylindole.\n5. According to the scheme, add 100 μl of primary reagent (or irrelevant isotype control or buffer), vortex gently until the pellet is completely in solution, and incubate overnight at 4°C in PBATw.\n6. The next day, wash twice, each time with 1 ml ice-cold PBATw, centrifuging 5 min at 1000 × g, 4°C, and removing the supernatant after each wash.\n7. Then, add 100 μl of secondary reagents (mixture of GaMIgG1-FITC and GaMIgG2b-RPE) to the pellets and gently vortex until the pellet is completely dissolved (± 5 s). Place tubes on ice.\nIMPORTANT NOTE: When the anti-vimentin 3B4 clone is used, replace the GaMIgG2b-RPE secondary reagent with GaMIgG2a-RPE.\n8. After 30 min on ice, wash twice, each time with 1 ml PBATw, centrifuging 5 min at 1000 × g, 4°C, and removing the supernatant after each wash.\n9. Add 0.5 ml DNA staining solution containing DAPI to the cell pellets and vortex gently until the pellet is completely dissolved (± 5 s).\n10. Store in the dark for at least 2 hr before analysis.\nBest results are obtained after an overnight DNA labeling in the refrigerator at 2°C to 8°C (Bauer, 1993).\n11. To prevent clogging of the flow cytometer, filter all samples over a nylon mesh of 50-μm before acquisition.\nCell filters with different pore sizes are commercially available from several companies.\nPerform multiparameter DNA measurement of cell suspensions from FFPE carcinomas",
    "12. For data acquisition and sorting, design a layout displaying the following bivariate dot plots and single-parameter histograms as follows (see Fig. 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-fig-0004] at the end of this article as an example):\nBivariate dot plots\na. FSC (lin) vs. SSC (lin).\nb. 355 DNA-DAPI 450/50-A (lin) or Height (lin) vs. 355 DNA-DAPI 450/50-A (lin).\nThis dot plot is used to gate on single cells.\nc. 355 DNA-DAPI 450/50-A (lin) vs. green (FITC) fluorescence (biexponential).\nd. 355 DNA-DAPI 450/50-A (lin) vs. orange (RPE) fluorescence (biexponential).\ne. Green (FITC) fluorescence (biexponential) vs. orange (RPE) fluorescence (biexponential).\nSingle-parameter histograms\nf. Green (FITC) fluorescence (biexponential).\ng. Orange (RPE) fluorescence (biexponential).\nh. 2 × 355 DNA-DAPI 450/50-A (lin) for ungated and gated events.\n13. Acquire data from the sample tube stained with DAPI alone.\n14. Place a threshold on the FSC (i.e., 5000 at 256 × 100 channel resolution) in combination with a threshold on the DAPI detector.\n15. Adjust the PMT settings of the DAPI fluorescence detector until the first G0G1 peak is approximately positioned at one fifth of the linear scale (i.e., channel 50,000 at 256 × 100 channel resolution).\n16. Create an electronic region/gate R1 around the G0G1 peak and color-code this gate in the FSC–SSC dot plot.\n17. Adjust the FSC settings until all colored events show up to the right of the FSC threshold.\nThis procedure circumvents cells being undetected due to incorrect FSC settings (Fig. 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-fig-0004]).\n18. Draw a second electronic region/gate R2 around the single-cell events of the 355 DNA-DAPI 450/50-A or Height versus 355 DNA-DAPI 450/50-A bivariate dot plot and activate this region/gate R2 in the other dot plots and histograms.\n19. Adjust PMT settings. A log-normal distribution must be shown in the first log-decade of the 4-decade FITC (488 530/30-A) or RPE (488 575/26-A) detector.",
    "Spectral spillover of DAPI into the FITC and RPE fluorescence detector is very limited and can, depending on the instrument and/or instrument settings, frequently be neglected.\n20. Take the vimentin-positive sample (RPE and DAPI fluorescence) and adjust for RPE spillover into the FITC and DAPI fluorescence detectors, respectively.\n21. Repeat the same action for the keratin-positive sample (FITC fluorescence emission) and adjust for FITC spillover into the RPE and DAPI fluorescence detectors, respectively.\n22. The flow cytometer is now ready to acquire and store events for multiparameter DNA analysis of samples labeled with DAPI, FITC, and RPE (Fig. 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-fig-0004], M-P).\n23. For S-phase estimates, it is recommended to stop acquisition only when >20,000 single keratin-positive events are collected within R2 when using a 1024-channel resolution scale for data analysis (Brown et al., 1996). Higher data analysis resolution settings are not useful.\nThe ModFit DNA-histogram analysis software package (Verity Software House) has an option “Fit Diagnostics.” In this submenu green, yellow and red indicators represent the Quality of Histogram and Fit, including S-phase error analysis. Collecting high cell numbers improves the fit.\n24. Store the data in the computer.\nFor data storage, use all collected events, including background and debris.\nPerform immunophenotypic analysis of flow cytometry data\n25. For data analysis, design a layout displaying the following bivariate dot plots and single-parameter histograms:\nBivariate dot plots\na. FSC (lin) versus SSC (lin).\nb. 355 DNA-DAPI 450/50-A (lin) or Height (lin) versus 355 DNA-DAPI 450/50-A (lin).\nThis dot plot is used to gate on single cells.\nc. 355 DNA-DAPI 450/50-A (lin) versus green FITC fluorescence (biexponential) (488 FITC 530/30-A).\nd. 355 DNA-DAPI 450/50 A (lin) versus orange (RPE) fluorescence (biexponential) (488 RPE 575/26-A).\ne. Green (FITC) fluorescence (biexponential) (488 FITC 530/30-A) vs. orange (RPE) fluorescence (biexponential) (488 RPE 575/26-A).Single-parameter histograms:",
    "f. Green (FITC) fluorescence (biexponential) (488 FITC 530/30-A).\ng. Orange (RPE) fluorescence (biexponential) (488 RPE 575/26-A).\nh. Three 355 DNA-DAPI 450/50 A (lin) histograms [one ungated and two gated histograms for showing the cell cycle distribution of the vimentin-positive stromal cell fraction and of the keratin-positive cell fraction(s), respectively].\n26. Open the data file of the DAPI-labeled cells only and create an analysis region R1 around the single events excluding debris and cell aggregates using the 355 DNA-DAPI 450/50 A (lin) or Height (lin) versus 355 DNA-DAPI 450/50 A (lin) bivariate dot plot.\n27. Activate R1 in the following bivariate dot plots and single parameter histograms:\n         \n355 DNA-DAPI 450/50 A (lin) versus green (FITC) fluorescence (biexponential) (488 FITC 530/30-A).\n355 DNA-DAPI 450/50 A (lin) versus orange (RPE) fluorescence (biexponential) (488 RPE 575/26-A).\nGreen (FITC) fluorescence (biexponential) (488 FITC 530/30-A) versus orange (RPE) fluorescence (biexponential) (488 RPE 575/26-A).\nGreen (FITC) fluorescence (biexponential) (488 FITC 530/30-A).\nOrange (RPE) fluorescence (biexponential) (488 RPE 575/26-A).\nThree 355 DNA-DAPI 450/50 A (lin) histograms.\n28. Next, open the data file of the vimentin-positive control.\nDepending on the flow cytometer (analog or digital) and data file format, fluorescence signals must be compensated when applicable.\n29. Adjust the spectral spillover of RPE fluorescence in the DAPI fluorescence parameter until the vimentin-positive events are parallel to the ordinate of the 355 DNA-DAPI 450/50 A (lin) versus red (RPE) fluorescence (log) dot plot.\n30. Create a region R2 around the vimentin-positive events and activate this gate in the first 355 DNA-DAPI 450/50 A (lin) histogram.\n31. Open the data file of the keratin-positive control and, when necessary, correct for spectral spillover of FITC into the RPE and DAPI parameter.",
    "Keratin-positive events should be parallel to the ordinate of the 355 DNA-DAPI 450/50 A (lin) versus green (FITC) fluorescence (log) (488 FITC 530/30-A) bivariate dot plot.\n32. Create a region R3 around the keratin-positive events and activate this gate in the second 355 DNA-DAPI 450/50 A (lin) histogram.\n33. Finally, load the data file containing the triply stained cells and make small final spectral spillover adjustments when required.\n34. Create a region R4 around the G0G1 population of the DNA histogram composed of the vimentin-positive events. Calculate the median fluorescence using the software.\n35. Create a region R5 around the G0G1 population of the DNA histogram composed of the keratin-positive events. Calculate the median fluorescence using the software.\n36. Do the same for other G0G1 populations when present in the keratin-positive population.\nThe G0G1 population of the vimentin-positive fraction can serve as a DNA diploid reference (Corver et al., 2005[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-bib-0016]) for calculating the DNA-index of FFPE carcinomas. The DNA index is calculated as follows:\n         formula:\n$$\\begin{equation*} {\\rm{DNA Index}} = \\frac{{{\\rm{median fluorescence of }}{{\\rm{G}}}_0{{\\rm{G}}}_1{\\rm{keratin}} - {\\rm{positive population}}}}{{{\\rm{median fluorescence of }}{{\\rm{G}}}_0{{\\rm{G}}}_1{\\rm{vimentin}} - {\\rm{positive population}}}} \\end{equation*}$$\nFor more accurate DNA index calculation and S-phase estimates, specially developed software packages are recommended, such as ModFit or MultiCycle. In addition, ModFit can be remotely connected to WinList. This allows automated ploidy analysis of tumor subpopulations using the median relative fluorescence of G0G1 peak of the stromal, vimentin-positive, cell fraction as DNA-diploid reference. A ModFit remote WinList script can be found below (see as examples Figs. 7[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-fig-0007] and 8[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-fig-0008]). For more details see ModFit and WinList manuals.",
    "In addition, ModFit and MultiCycle software packages contain sophisticated algorithms that can correct for debris and aggregates. Therefore, data storage during acquisition should contain all events. Modfit and WinList can be obtained from Verity Software (http://www.vsh.com/[href=http://www.vsh.com/]). Multicycle can be obtained from Phoenix Flow Systems (http://www.phnxflow.com/[href=http://www.phnxflow.com/]).\nWinList script “Edit Remote Link”\nPOKE (DATA, VSH)\nPOKE (KEYWORDS, VSH, KEYWORDS)\n[SetProperty(ExternalReference={DS1.R4.MedianX},262144)]\nWhen another region is used to define the G0G1 of the DNA-diploid internal vimentin-positive, keratin-negative stromal reference R4 must be changed accordingly.\n[AutoAnalysis()]\n[AutoLinearity()]\n[Update()]\n[SetGraphicSize({HISTOGRAMSIZE})]\n[Copy('Graph')]\nPASTE(DIB)\n[Copy('Results')]\nPASTE(Text)",
    "Most modern standard equipped flow cytometers, e.g., FACSCanto, CytoFlex, or NovoCyte, permit violet, blue, and red excitation, and assist the use of DAPI as DNA stain. However, some instruments, especially older models, e.g., FACSCalibur, do not support the use of DAPI. A good alternative for DAPI is propidium iodide (PI). However, PI, in contrast to DAPI, is not base-pair specific and requires RNase treatment in order to reduce binding of PI to dsRNA. A cell population left untreated will show a significantly higher coefficient of variation (CV) of the G0G1 peak as compared to the G0G1 peak of an RNase-treated cell population, stained with PI.\nThe following protocol is identical to the Basic Protocol, except for steps 7 and 9. GaMIgG2b-RPE or GaMIgG2a-RPE is replaced by GaMIgG2a-APC or GaMIgG2b-APC, DNA is labeled by PI, and cells need to be treated by RNase, respectively.\nAdditional Materials (also see Basic Protocol)\nSecondary reagents:\n               \nGoat anti–mouse IgG2a-RPE or goat anti–mouse IgG2b-RPE are replaced by:\ngoat anti–mouse IgG2a-APC (e.g., SouthernBiotech, cat. no. 1080-11)\ngoat anti–mouse IgG2a-Alexa FluorTM 647, ThermoFisher Scientific, cat. no. A-21241\ngoat anti–mouse IgG2b-APC (e.g., SouthernBiotech, cat. no. 1090-11)\ngoat anti–mouse IgG2b- Alexa FluorTM 647 (e.g., ThermoFisher Scientific, cat. no. A-21242)\nDNA staining solution with PI (see recipe) is used instead of the DAPI staining solution.\nFlow cytometer equipped with a blue 488-nm laser and red 633-nm laser and optical filters for collection of green (FITC or and Alexa FluorTM 488), red (PI), and infra-red (APC or and Alexa FluorTM 647) fluorescence equipped with the following optical filters: BP 530/30 nm, BP 610/20 nm or LP 670 nm, and BP 670/14 nm.\nImager suitable for the collection of FITC or Alexa FluorTM 488, PI and APC, or Alexa FluorTM 647 fluorescence and corresponding optical filters\nPrepare cell suspensions from FFPE tissues",
    "1. Prepare cell suspension from FFPE tissues as described in the Basic Protocol (steps 1 to 3).\nCell staining\n2. Follow steps 4 to 11 of the Basic Protocol.\n3. Add 100 μl of secondary reagents (mixture of GaMIgG1-FITC or GaMIgG1-Alexa FluorTM 488 and GaMIgG2b-APC) to the pellets and gently vortex until the pellet is completely dissolved (±5 s). Place tubes on ice.\nWhen the anti-vimentin 3B4 clone is used, replace the GaMIgG2b-APC (or Alexa FluorTM 647) secondary reagent with GaMIgG2a-APC (or Alexa FluorTM 647).\n4. After 30 min on ice, wash twice, each time with 1 ml PBATw, centrifuging 5 min at 1000 × g, 4°C, and removing the supernatant after each wash.\n5. Add 0.5 ml DNA staining solution with PI to each of the cell pellets and vortex gently. Put the tubes for 30 min in a 37°C water bath.\n6. Store in the dark at 2°C to 8°C (refrigerator) for at least 2 hr before analysis.\nBest results are obtained after an overnight DNA labeling at 2°C to 8°C in the refrigerator (Bauer, 1993).\n7. To prevent clogging of the flow cytometer, filter all samples over a 50-μm nylon mesh before acquisition.\nCell filters with different pore sizes are commercially available from several companies.\nPerform multiparameter DNA measurement of cell suspensions from FFPE carcinomas and flow cytometry data analysis\nMeasurement and data analysis are identical to the Basic Protocol except for the parameters used to analyze the stromal cell fraction (vimentin-positive, APC or fluorescence or Alexa FluorTM 647 fluorescence) and the DNA content (PI fluorescence).",
    "8. Follow steps 12 to 24 of the Basic Protocol, but replace the orange (488 RPE 575/26-A) fluorescence (biexponential) and the 355 DAPI-DNA 450/50-A (lin) parameters by the red (633 APC or Alexa FluorTM 647 670/14-A) fluorescence (biexponential) and the 488 DNA-PI 610/20-A (lin) or 488 DNA-PI 670-A (lin) parameters, respectively.\nThe latter depend on the flow cytometer configuration.",
    "Relatively old standard benchtop flow cytometers, e.g., the Coulter XL or FACSCan, are only equipped with a blue (488 nm) laser. Single-laser excitation limits the choice for optimal dye combinations. However, despite the broad emission spectrum of PI, results comparable to those achievable with UV (DAPI) and blue excitation (FITC and RPE, Basic Protocol) can be obtained (see Fig. 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-fig-0005], 6[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-fig-0006] at the end of this article). Special detector and compensation settings are required in order to separate the fluorescent signals from RPE and PI (see Commentary and Corver et al., 1994[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-bib-0011]), but the standard optical filters used to detect FITC, RPE, and PI fluorescence do not have to be changed for the FACScan or FACSCalibur flow cytometers. The following protocol is identical to the Basic Protocol, except for step 9 (staining DNA with DAPI). Instead of using DAPI to stain DNA, DNA is labeled by PI and cells need to be treated by RNase.\nAdditional Materials (also see Basic Protocol)\nDNA staining solution containing PI (see recipe) instead of DAPI\nFlow cytometer equipped with blue (488 nm) excitation and filters for collection of green (FITC), orange (RPE) and red (PI) fluorescence\nPrepare cell suspensions from FFPE tissues\n1. Prepare cell suspension from FFPE tissues as described in the Basic Protocol (steps 1 to 3).\nCell staining\n2. Follow steps 4 to 11 of the Basic Protocol.\n3. Add 0.5 ml PI staining solution (containing RNase) to the cell pellets and vortex gently. Put the tubes for 30 min in a 37°C water bath.\n4. Store in the dark (refrigerator) for at least 2 hr before analysis.\nBest results are obtained after an overnight DNA labeling at 2°C to 8°C in the refrigerator (Bauer, 1993).",
    "5. To prevent clogging of the flow cytometer, filter all samples over a 50-μm nylon mesh before acquisition.\nCell filters with different pore sizes are commercially available from several companies\nPerform multiparameter DNA measurement of cell suspensions from FFPE carcinomas and flow cytometry data analysis\nMeasurement and data analysis are identical to the Basic Protocol except for the DNA content parameter (PI fluorescence).\n6. Follow step 12 to 24 of the Basic Protocol but replace the 355 DAPI-DNA 450/50-A (lin) parameter by the 488 DNA-PI >650-A (lin) or 488 DNA-PI >670-A (lin), depending on flow cytometer parameters.",
    "Solid tumors are heterogeneous in their composition, and frequently multiple populations with differing cell DNA contents can be identified in the keratin-positive cell fraction. For example, it has been demonstrated that overall DNA aneuploid tumors also harbor tumor cells with a DNA index of 1.0 or close to 1.0 (Bonsing et al., 2000[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-bib-0007]; Corver et al., 2008[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-bib-0014]; Corver et al., 2011[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-bib-0017]). These can be normal epithelial cells contaminating the sample, but are very frequently shown to be pseudo-diploid. These cells have harbored chromosomal alterations in which the total sum of copy number gains and losses shows a DNA content equal to that of normal DNA diploid cells (Abeln et al., 1994[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-bib-0001]; Bonsing et al., 2000[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-bib-0007]; Corver et al., 2008[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-bib-0014]; Corver et al., 2011[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-bib-0017]; see Fig. 7[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-fig-0007] at the end of this article as example). In addition, tumor subpopulations within a single G0G1 fraction defined by flow cytometry DNA cell content measurements have been identified. These can be based on differences in phenotype (Corver et al., 2000[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-bib-0012]; Koopman et al., 2000[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-bib-0032]; Corver et al., 2000a[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-bib-0012]), but also on a mixture of subpopulations with slightly different genomic make-ups. The differences in DNA content are small and fall within the range of variation of a G0G1-peak. The latter is caused by chromosomal instability and mitotic errors, and has been demonstrated by sorting, copy number, LOH, and FISH analysis of the particular G0G1 population (Corver et al., 2018[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-bib-0009]; Corver et al., 2012[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-bib-0015]).",
    "In order to reduce unintended cell loss during sorting, a four-way sorter is recommended. This allows the simultaneous sorting of the vimentin-positive stromal cell fraction, together with up to three tumor subpopulations, saving precious clinical material. For example, the sorting of two tumor subpopulations and normal stromal cells simultaneously would take more time and sample on a two-way cell sorter as compared to a four-way cell sorter (see as examples Fig. 6[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-fig-0006] and 7[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-fig-0007]). Cell suspensions prepared from FFPE carcinomas by the presented protocol can also be sorted using a recently introduced imaging and digital-sorting device: the DEPArray (Menarini Silicon Biosystems, S.P.A., Italy). Small tumor samples can be applied (advantage over a cell sorter) and reliably allow detection of DNA variants in samples with a very low percentage of tumor cells, e.g., lung cancer, which would have been missed without sorting (Bolognesi et al., 2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-bib-0006]).\nThe Support Protocol below is typically used to sort tumor subpopulations coexisting in FFPE carcinomas using the Basic Protocol after staining for keratin (FITC), vimentin (RPE), and DNA (DAPI). A sorter with UV (355 nm) and blue (488 nm) excitation lasers is required. Sorting of different cell fractions treated according to Alternate Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-prot-0002] and Alternate Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-prot-0003] demand blue (488 nm) and red (635 nm), and only blue (488) excitation, respectively.\nAdditional Materials (also see the Basic Protocol)\nCommercial DNA purification kit (e.g., NucleoSpin, Macherey-Nagel, cat. no. 740980.50 or Promega Wizard genomic DNA Purification Kit, cat. no. A1120)\nor (cheaper):\nProteinase K solution (see recipe in Reagents and Solutions)\n1.5-ml microcentrifuge tubes\nFlow cytometer instrument equipped with sorting capabilities (i.e., ability to simultaneously sort four different cell populations), e.g., InFlux, FACSAria or CytoFLEX SRT cell sorter, or DEPArray (Bolognesi et al., 2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-bib-0006]). DEPArray set-up is outside the scope of this article.",
    "Spectral sorters like the BigFoot (ThermoFisher), Aurora CS (Cytek Biosciences) or FACSDiscover S8 are not obligatory for cell purification of cell suspensions prepared by the presented protocol\nCell purification/sorting and DNA extraction\n1. Follow the steps described for sample preparation and cell staining in Basic Protocol (steps 1 to 11).\n2. Display dot plots and histograms as described in the Basic Protocol and follow steps 12 to 22 of the Basic Protocol.\n3. Design a gating strategy to sort the stromal, vimentin-positive cell fraction and keratin-positive cell fraction.\nBased on DNA content, the keratin-positive cell fraction can be composed of multiple populations each being included in a different electronic region/gate for sorting. Sorting gates may include G0/G1 only or G0/G1 plus S and/or G2/M cells.\n4. Sort cells into 12 × 75–mm tubes or directly into 1.5-ml microcentrifuge tubes.\n5. After sorting, spin cells down by centrifuging 10 min at 3000 × g, 4°C.\n6. Carefully remove the supernatant.\n7. Extract DNA using proteinase K (Abeln et al., 1994[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-bib-0001]) at 56°C overnight or using a commercial kit, of which there are many on the market. For proteinase K digestion, use 1 μl proteinase K buffer per 2000 nuclei. When a commercial kit is used, follow the instructions of the manufacturer.\n8. The following day, inactivate proteinase K for 10 min at 100°C.\nDNA can be used directly for detection of loss of heterozygosity. Further purification is not essential.\nFor accurate determination of loss of heterozygosity by microsatellite markers without the aid of whole-genome amplification, a minimum of approximately DNA equivalents from 2000 cells is required. Lower numbers can cause false negative or positive results (Sieben et al., 2000[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-bib-0047]).",
    "Next-generation sequencing is more sensitive and requires a minimum input of 100 nuclei, as shown by Bolognesi et al. (2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-bib-0006]). It is important to understand that the input of near-haploid cells must be twice as high.\nCells can also be directly sorted onto glass slides for down-stream chemical staining (Corver et al., 2005[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-bib-0016]) or fluorescence in situ hybridization (Corver et al., 2012[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.825#cpz1825-bib-0015])."
  ],
  "subjectAreas": [
    "Cytometry"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}