{
  "id": 5775,
  "origin_website": "Bio",
  "title": "<em>Drosophila</em> Fecal Sampling",
  "procedures": [
    "Medium preparationCook desired sterile fly medium (see Recipes) by autoclaving the medium at 120 °C for 20 min. Decontaminate empty and clean Drosophila vials and plugs under a safety cabinet via UV light for at least 30 min (Figure 1A).Let the medium cool down to 65 °C and add preservative agents under sterile conditions, if necessary.Pour the sterile fly medium into the decontaminated Drosophila vials under sterile conditions (Figure 1B).Let the medium dry under the safety cabinet and plug the vials (Figure 1C).It is possible to store the sterile medium at 4 °C in a sterile plastic box.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170910/20170910233327_1557.jpgFigure 1. Preparation of sterile medium vials. A. Put empty (marked) vials and fresh plugs under the sterile bench and sterilize them using UV light for at least 30 min. B. Decant the fresh and sterile medium in the vials after decontamination under the bench and let the medium dry for about 45 to 60 min. C. Plug the vials. Vials can be kept at 4 °C in a sterile box.Feces collectionAnesthetize the flies with nitrogen using the Blowgun (anesthetizing pistol). Transfer cohorts of 30 to 50 flies under sterile conditions to a sterile Drosophila vial and let them defecate for 24 h at 25 °C (Figure 2A).Then, transfer flies to a new vial under sterile conditions or discard them. Note: Figures 2B and 2C show how vials and fecal spots will look like after 24 h.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170910/20170910233620_0957.jpgFigure 2. Feces in the vial. Transfer 30 to 50 flies into a sterile prepared vial and let the flies defecate for about 24 h at 25 °C for standard wildtypes or crossings. B. After 24 h many fecal spots can be seen all over the vial (Figure 2C shows a magnification, red arrows mark only a few spots for better understanding).",
    "Place sterile spin swabs, sterile 1x PBS (see Recipes), sterile scissors and the Drosophila vial containing the feces under the safety cabinet (Figure 3A).For better control, filtrate the needed amount of 1x PBS using a sterile filtropour filter (Figure 3B).Soak sterile spin swab with sterile 1x PBS (Figure 3C; for preparation step 5-8, see Video 1).Open vial and carefully collect the feces with the soaked spin swab.Note: Don’t come in contact with the medium (Figures 3D and 3E). imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170910/20170910233730_3322.jpgFigure 3. Feces collection. A. UV sterilization of all used materials, for example 1x PBS buffer, single packed swabs, sterile syringe, scissors and reaction tubes. B. Filter the needed amount of 1x PBS once again using a syringe filter. C. Soak the sterile swab with the fresh prepared and filtered 1x PBS. D. Start to collect/swab all fecal spots from the vial. ONLY from the walls, ignore spots on the plug AND take care NOT to touch the medium with the swab (E). F. Collected fecal spots from 40 flies after 24 h at 25 °C.    <p>imgsrc:https://bio-protocol.org/javascript:;</p>   Video 1. Feces collection   Transfer the spin swab into a reaction tube and carefully cut off the stick with the sterile scissors (Figure 4C).Close the reaction tube.Prepare a negative control in the same way using an empty medium vial prepared at the same day as the used medium.Soak sterile spin swab with sterile 1x PBS (Figure 3C).Open vial and carefully collect the feces with the soaked spin swab (Figure 4A).After collection, the NTC (No Template Control) swab shows no feces (Figure 4B).Note: Don’t come in contact with the medium (Figures 3D and 3E).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170910/20170910233839_4033.jpgFigure 4. Negative control.",
    "A negative control (NTC), prepared at each time point of an isolation is necessary to check for a contamination of the vials and to have a baseline for later analysis. Start with the negative control always. A. Swab an empty medium vial (from the same charge as the treatment vials); B. Swab after ‘collection’; C. Transfer the swab into a Mobio Power Soil Tube.gDNA isolation (manufacturer’s data with some simple modifications)Add 60 µl solution C1 (Power Soil Kit) and 20 µl Proteinase K to the reaction tube. Mix by inverting the reaction tube.Note: If the solution is precipitated at room temperature, heat it up to 60 °C until it is homogenous again (Figures 5A-5C).Incubate the sample for 2 h at 50 °C and 750 rpm in the thermomixer (Figure 5D).Vortex (vortex adapter) the samples at highest speed for 10 min (Figure 5E).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170910/20170910234856_8063.jpgFigure 5. First steps of isolation using MOBIO Power Soil Kit. A. Add 60 µl of C1 (A, B) using sterile filter tips. C. Add 20 µl Proteinase K (STEP ADDED TO MANUFACTURERS PROTOCOL) and let the samples incubate in a thermos shaker (750 rpm) for 2 h at 50 °C (D, STEP ADDED TO MANUFACTURERS PROTOCOL) to induce Proteinase K activity. E. Transfer the vials into the MOBIO Vortex adapter and shake for 10 min at highest speed. F. The samples will look a lightly orange and may show a solid orange or red powder in the vial from the grinded silicate splints. This is absolutely normal. Go on by following the manufacturer’s protocol.Centrifuge the sample at 10,000 x g for 30 sec at 20 °C.Note: MAXIMUM 10,000 x g, tubes can break at higher rotations!Pipette up to 400 µl of the supernatant in a sterile 2 ml collecting tube.",
    "Add 250 µl solution C2 (Power Soil) to the supernatant and vortex for 5 sec.Incubate the sample for 5 min at 4 °C and centrifuge at 10,000 x g for 60 sec at 20 °C.Pipette up to 550 µl of the supernatant in a sterile 2 ml collecting tube.Add 200 µl solution C3 (Power Soil) to the supernatant and vortex shortly.Incubate the sample for 5 min at 4 °C and centrifuge at 10,000 x g for 60 sec at 20 °C.Pipette not more than 600 µl of the supernatant in a sterile 2 ml collecting tube, add 1,200 µl of C4 (shake solution 4 well before using!) and vortex 5 sec.Because the maximum spin column capacity is 675 µl, pipette only 600 µl of the mixture of step C11 onto the column, centrifuge at 10,000 x g for 60 sec at 20 °C. Discard the flow through and repeat this step twice.Afterwards, wash the column by pipetting 500 µl of C5 onto the column.Centrifuge at 10,000 x g for 30 sec.Discard flow through and dry the column by centrifugation at 10,000 x g for 60 sec at 20 °C.Put the spin-filter (column) into a new sterile collecting tube.Pipette 30 µl of TE onto the middle of the column and incubate for 1 min.Centrifuge the column at 10,000 x g for 30 sec at 20 °C.Dispose of the spin-filter.gDNA can be stored at -20 °C. Note: Keep a negative control for each isolation run! Further experiments After gDNA extraction, use a Qubit 3.0 Fluorometer to measure the gDNA concentration. This gDNA can be used for further analysis by qPCR or MiSeq (454 sequencing described in Fink et al., 2013).Notes:  You need at least 5 ng/µl for metagenomics.Check all fly strains for a Wolbachia infection before performing your experiments.",
    "In some cases, Wolbachia OTUs (Operating Taxonimic Units) will dominate in your 454 data sets of whole fly samples or gut samples. This is important if feces samples are compared with whole tissue samples.PCR amplificationsFor PCR amplification we used 2.5 µl of gDNA as template in 25 µl reaction volume. Using 0.25 µl Phusion® Hot Start DNA polymerase, 0.5 µl of sense and antisense primer (10 mmol each); for PCR amplification, the Sensoquest labcycler was used. The general Wsp (Wolbachia specific) primers 81F (5’-TGGTCCAATAAGTGAAGAAAC-3’) and 691R (5’-AAAAATTAAACGCTACTCCA-3’) were used [10 mM] to amplify Wolbachia 16S RNA gene (Braig et al., 1994). To check the quality of the isolated DNA insect specific mitochondrial 12S ribosomal DNA primers were used, 12SAI (5’-AAACTAGGATTAGATACCCTATTAT-3’) and SBI (5’-AAGAGCGACGGGCGATGTGT-3’) (Simon et al., 1994). PCR conditions were: initial denaturation for 30 sec at 98 °C; 35 cycles of 9 sec at 98 °C, 30 sec at 55 °C, and 30 sec at 72 °C. The results are represented after gel electrophoresis in Figure 6 using 1.5 % Crystal-Agarose in 1x TBE (see Recipes).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170910/20170910235818_7706.jpgFigure 6. PCR analysis for Wolbachia contamination. A. PCR results using Wolbachia specific oligonucleotides (Wsp81F, Wsp691R) in lanes 1, 3 and 5. It is shown that fecal samples are free of Wolbachia contamination. To approve the success of DNA isolation gDNA specific 12S primers were used in lanes 2, 4 and 6 (12SAI and 12SBI) (Fink et al., unpublished data).qPCR amplificationsPCR was performed in 10 µl reactions containing 2 µl of gDNA template in a total reaction volume of 10 µl using 5 µl of the qPCR Bio SYBR-Hi-ROX. The general V2 primers were used as general detection primer or control primer [8 pmol] when comparing to other species specific amplification.",
    "PCR conditions using the StepOne Cycler were: Holding stage for 10 min at 95 °C; cycling stage 40 cycles of 10 sec at 95 °C, 30 sec at 60 °C annealing as time point for data collection. Melting curve stage: 10 sec at 95 °C, 5 sec at 60 °C, starting of data collection every 0.3 °C until the temperature of 95 °C was reached for 10 sec.454 proceduresFor PCR amplification of the 16sRNA gene a 311-nucleotide sequence flanking the hypervariable V1 and V2 region was used. For each sample, the 16S rRNA gene was amplified using the composite forward:(5’-CTATGCGCCTTGCCAGCCCGCTCAGTCAGAGTTTGATCCTGGCTCAG-3’) and reverse (5’-CGTATCGCCTCCCTCGCGCCATCAGXXXXXXXXXXCATGCTGCCTCCCGTAGGAGT-3’) primers. These primers include the 454 Life Sciences Adaptor A (for reverse primer) and B (for forward primer)–(labeled with italics). In addition, barcodes of 10 bp (designated as XXXXXXXXXX) were added to the reverse primers. The underlined sequences represent the broadly conserved bacterial primers 27F and 338R. A two-base linker sequence (TC/CA) and four-base key (TCAG) were added (see Supplemental file[href=https://os.bio-protocol.org/attached/file/20170910/Supplemental file.docx]). The amplification mix contained the Phusion® Hot Start DNA polymerase which was used following the standard protocol (initial denaturation for 30 sec at 98 °C; 35 cycles of 9 sec at 98 °C, 30 sec at 55 °C, and 30 sec at 72 °C; final extension for 10 min at 72 °C). See results after amplification in Figure 7.All samples were done in duplicates. Duplicates were combined after PCR. PCR products were extracted with the QIAGEN MinElute Gel Extraction Kit and quantified with the Quant-iTTM dsDNA BR Assay Kit on a NanoDrop 3300 Fluorometer. Equimolar amounts of purified PCR product were pooled and further purified using Ampure Beads (Agencourt). A sample of each library was run on an Agilent Bioanalyzer prior to emulsion PCR (Rausch et al.",
    ", 2011; SI) and sequencing as recommended by the manufacturer. Amplicon libraries were subsequently sequenced on a 454 GS-FLX using Titanium sequencing chemistry (Fink et al., 2013).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170911/20170911000218_4007.jpgFigure 7. Gel electrophoresis for PCR quality check and Gel extraction. Samples show an amplicon size about 400 bp. Negative controls (neg. Ktr.) are included for each amplification. Samples are cut off by using the Gel DocTM XR+ X-tracta Tips. All represented negative controls are free of contamination here. If negative controls (NTC) show any contamination, re-run the samples in the PCR."
  ],
  "subjectAreas": [
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}