{
  "id": 8655,
  "origin_website": "Jove",
  "title": "Dissection of Local Ca2+ Signals in Cultured Cells by Membrane-targeted Ca2+ Indicators",
  "procedures": [
    "All the experiments described here were approved by the RIKEN safety committee and animal experiment committee, according to the guideline issued by the Japanese Ministry of Education, Culture, Sports, Science, and Technology. \n1. Preparation of Cells \nPreparation of poly(ethyleneimine)-coated coverslips\nNOTE: Poly(ethyleneimine) (PEI) coating is recommended for the glass apparatus, as it allows neurons and astrocytes to attach tightly to the coverslips without preventing their development. However, other coating methods (e.g., poly-ornithine, poly L-lysine, laminin coating) are also available, if necessary, for glass-bottom dishes. \n\t\nPlace an 18 mm-diameter glass coverslip in each well of a 12-well plate. Prepare 0.04% PEI solution (12.5 mL/12-well plate) using sterilized water.\nAdd 1 mL of 0.04% PEI solution to each well. Ensure that there are no bubbles underneath the coverslips.\nIncubate the plates in a CO2 incubator overnight at 37 °C.\nThe next day, wash the coated coverslips 3x with 1 mL of sterilized water. Remove the PEI solution with an aspirator, add 1 mL of sterilized water to each well, and shake the 12-well plate so that the PEI solution between the coverslip and the plate can be washed out thoroughly. As the remaining PEI is toxic for cells, ensure that the water after the final wash is aspirated completely.\nDry and sterilize the coverslips inside the hood with ultraviolet (UV) light for at least 15 min. The PEI-coated dish can be stored at 4 °C for up to 2 months. Illuminate the dishes with UV light for 15 min just before use.\nAdd 5 mL of sterile distilled water in the space between the wells to prevent evaporation of the culture medium.\nPlating cell lines",
    "NOTE: This protocol provides just one example for transfection into cells from mammalian cell lines, such as HeLa cells and COS-7 cells. Users can apply other transfection protocols that are optimized for their experiments. In this section, we will describe the HeLa cell culture protocol, which is also applicable to COS-7 cells.\n\t\nOn the day before the transfection, culture the cells in a 10 cm culture dish until they attain 70%–90% confluence.\nPrewarm the culture medium (see Table of Materials) to 37 °C.\nWash the cells 2x with phosphate-buffered saline without Ca2+ and Mg2+ (PBS [-]).\nAspirate the PBS(-), add 1 mL of 0.5% trypsin-ethylenediaminetetraacetic acid (EDTA) solution, and incubate the cells at 37 °C for 90 s until they attain a round shape.\nAdd 9 mL of prewarmed culture medium to stop the trypsinization. Dilute the cells with culture medium at a ratio of 1:6.\nSeed 1 mL of the diluted cells on PEI-coated coverslips in the 12-well plates.\nPreparation of hippocampal neuron-astrocyte mixed culture from rats or mice\nNOTE: Sections 1.3 and 1.4 must first be reviewed and approved by an Institutional Animal Care and Use Committee and must follow officially approved procedures for the care and use of laboratory animals. The flowchart of the neuronal culture protocol is shown in Figure 2.\n\t\nPrepare all reagents under the laminar flow hood. Place Dulbecco’s modified Eagle’s medium (DMEM) into two 100 mm culture dishes (approximately 20 mL/dish) that are in an icebox. \nPrepare 50 mL of the dissection medium composed of DMEM and 20 mM 4-(2-hydroxyethyl)-1-piperazineethanesulfonic acid (HEPES) (see Table of Materials) and dispense the medium into three 60 mm culture dishes (approximately 7 mL/dish) and eight 35 mm culture dishes (approximately 2 mL/dish). Place the dishes in another icebox.",
    "Prepare 50 mL of the incubation saline, composed of Hanks’ balanced salt solution supplemented with 20 mM HEPES (see Table of Materials), and place 8 mL of the saline in a 15 mL conical tube on ice.\nPrepare the plating medium with minimum essential medium (MEM) supplemented with B-27, glutamine, and penicillin-streptomycin (see Table of Materials). Maintain this medium at room temperature (20–28 °C).\nSterilize the surgical instruments with 70% ethanol. \nPlace a paper towel in a glass jar with a lid and 1 mL of isoflurane. Let the isoflurane evaporate for 1 min.\nPlace a pregnant rat or a mouse in the jar prepared according to step 1.3.6 and keep the animal in the jar until it is deeply anesthetized (approximately 30 s to 1 min).\nTake the anesthetized animal out of the jar and disinfect the animal and the dissection equipment by spraying them with 70% ethanol. Cut the ventral midline with standard dissecting scissors and tweezers and extract the uterus from the pregnant rat or mouse.\nExtract E18–19 embryos from the uterus of an anesthetized female rat or mouse, using delicate dissecting scissors, and place the extracted embryos with a ring forceps into ice-cold DMEM in a 10 cm dish for cold anesthesia.\nDecapitate the embryo with fine dissection scissors and place the head in ice-cold DMEM in a 10 cm dish.\nExtract the brain from each embryo with a 13 cm curved Semken forceps and forceps with fine tips. Keep the brain in the ice-cold dissection medium in a 60 mm dish.\nRemove the hippocampi, using two forceps with fine tips, in the ice-cold dissection medium in 35 mm dishes and maintain the isolated tissue in the incubation saline placed in a 15 mL conical tube on ice.",
    "Wash the hippocampi with incubation saline and incubate with trypsin (1.25 mg/mL) and DNase I (0.25 mg/mL) in the incubation saline for 5 min at 37 °C. The recommended incubation volume is 2.7 mL of the incubation saline, 150 µL of 20x stock trypsin, and 150 µL of 20x stock DNase (see Table of Materials).\nWash the hippocampi 3x with ice-cold incubation saline.\nAspirate the incubation saline and add 1 mL of the plating medium containing DNase I (10 µL of stock solution; see Table of Materials). Suspend the tissue by pipetting no more than 20x and measure the density of viable cells, using a cell counter and Trypan blue assay.\nDilute the hippocampal cells to a density of 1.4 x 105 viable cells/mL for rats and 2.5 x 105 viable cells/mL for mice. Seed 1 mL of the diluted cell suspensions onto the PEI-coated coverslips in 12-well culture plates.\nMaintain the cells at 37 °C in a CO2 incubator for 2–3 days.\nRemove the plating medium. Do not let the cells dry out. Gently and quickly add the prewarmed maintenance medium (see Table of Materials). \nPreparation of rat cortical neuron-astrocyte mixed culture and frozen cells, and the revival of frozen cultures\nNOTE: A cryopreservation method for cortical cells was described previously11. Here, a modified protocol in which cortical cells can be stored at -80 °C for at least 3 months is provided. The flowchart for this protocol is shown in Figure 2.\n\t\nPrepare DMEM, dissection medium, incubation saline, and plating medium as indicated in steps 1.3.1–1.3.4, and the Table of Materials. \nPrepare the wash medium constituted of DMEM, heat-inactivated fetal bovine serum, and penicillin-streptomycin (see Table of Materials), if necessary.",
    "Extract E18–19 embryos from the uterus of an anesthetized female rat or mouse, using delicate dissection scissors, and use ring forceps to place each extracted embryo into ice-cold DMEM for cold anesthesia.\nRemove the brains from the embryos and keep them in ice-cold dissection medium. Remove the cortexes and maintain them in the incubation saline placed in a 15 mL conical tube on ice.\nWash the cortexes with incubation saline and incubate the cortexes with trypsin (1.25 mg/mL) and DNase I (0.25 mg/mL) in incubation saline for 5 min at 37 °C. The recommended incubation volume for 12 cortexes is 5.4 mL of incubation saline, 300 µL of 20x stock trypsin, and 300 µL of 20x stock DNase I.\nWash the cortexes 3x with ice-cold incubation saline.\nRemove the supernatant and add 2 mL of plating medium supplemented with 150 µL of DNase I stock. Dissociate the cells by pipetting less than 20 strokes, and filter the cells using a cell strainer with a pore size of 70 µm.\nWash the cell strainer with 20 mL of the plating medium for plating. For the preparation of frozen cell stock, wash the cells with 20 mL of the wash medium (see Table of Materials)\nMeasure the density of the viable cells, using a cell counter and the Trypan blue method.\nDilute the cortical cells to a density of 1.4 x 105 viable cells/mL with the plating medium and add 1 mL of the diluted cell suspension to PEI-coated coverslips in the 12-well culture plates.\nMaintain the cells at 37 °C in a CO2 incubator for 2–3 days and change the culture medium to the maintenance medium.\nAfter step 1.4.9, prepare the frozen cortical cell stock by centrifuging the cells at 187 x g for 3 min, using a swing rotor.",
    "Aspirate the supernatant and add the cryopreservation medium (see Table of Materials) kept at 4 °C, to obtain a cell density of 1 x 107 cells/mL. Aliquot 1 mL of the cell suspension into cryogenic tubes.\nPlace the tubes in a cell freezing container with a freezing rate of -1 °C/min, until a temperature of -80 °C is reached, and transfer the freezing container to a -80 °C freezer. The cells can be stored for at least 3 months at -80 °C.\nTo revive frozen cells, prewarm the wash medium (approximately 13 mL for each cryogenic tube) and maintenance medium for frozen cortical cells (see Table of Materials).\nThaw the frozen cells rapidly at 37 °C in a water bath.\nDilute the thawed cells gently with prewarmed wash medium. Centrifuge the cells at 187 x g for 3 min, using a swing rotor.\nSuspend the pellet in 1 mL of wash medium and measure the viable cell density.\nDilute the cells with the maintenance medium for frozen cortical cells to yield a cell density of 3.0 x 105 viable cells/mL, and seed 1 mL of the cell suspension in the PEI-coated 12-well plates.\n2. Expression of Membrane-targeted GECIs\nTransfection of cells \nAdd 250 ng of the GECI plasmid (i.e., Lck-GCaMP6f, Lck-RCaMP2, or OER-GCaMP6f with CMV promoter)7,8,9 to 100 µL of the reduced serum medium (see Table of Materials) per well. For the cotransfection of Lck-RCaMP2 and OER-GCaMP6f, use 250 ng of each plasmid in 100 µL of reduced serum medium in each well.\nAdd 0.5 µL of transfection reagent (see Table of Materials) per well into the plasmid-reduced serum medium mixture. For the cotransfection of Lck-RCaMP2 and OER-GCaMP6f, add 0.5 µL of transfection reagent per well.\nIncubate the mixture for 30 min at room temperature (20–28 °C).",
    "Add 100 µL of the mixture to each coverslip in a drop-wise manner.\nIncubate the cells for 48–72 h in a CO2 incubator at 37 °C to allow the expression of the GECIs.\nTransfection and adeno-associated virus infection of hippocampal or cortical neurons\nNOTE: Transfection for 3–5 days in vitro (DIV) results in a higher transfection rate for neurons. Transfection at 6–8 DIV is preferred for the optimal expression of GECIs in astrocytes. For the expression of GECIs in dissociated culture neurons after 9 DIV, the infection of the adeno-associated virus (AAV) vectors provides a better expression efficacy. AAV vectors for the expression of Lck-GCaMP6f, Lck-RCaMP2, and OER-GCaMP6f under the EF1a promoters were prepared as described previously, using HEK293 cells12 (see Table of Materials). \n\t\nFor transfection 3–8 days after plating, label two tubes, one for plasmid DNA and the other for transfection reagent.\nAdd 50 µL of reduced serum medium (see Table of Materials) per well to each tube.\nAdd 0.5 µg of plasmid DNA per coverslip and 1 µL of supplement accompanied by transfection reagent for neurons (see Table of Materials) per well to the plasmid DNA tube. For the cotransfection of Lck-RCaMP2 and OER-GCaMP6f, 0.5 µg of each plasmid and 1 µL of supplement are mixed in 50 µL of reduced serum medium per well. \nAdd 1 µL of transfection reagent (see Table of Materials) per well in the transfection reagent tube. The same amount of transfection reagent is used for cotransfection.\nVortex both tubes for 1–2 s.\nAdd the transfection reagent mixture (from step 2.2.4) to the DNA mixture (from step 2.2.3). Mix by pipetting gently and incubate the mixture (100 µL per coverslip) for 5 min at room temperature.\nLoad this mixture onto the cells in a drop-wise manner.",
    "Incubate the cells in a CO2 incubator for 2–3 days until the marker proteins are expressed.\nFor AAV infection, add 3 µL of AAV per well to the mixed neuron-astrocyte culture. Mix gently by rocking the dish. For the double infection of Lck-RCaMP2 and OER-GCaMP6f, 3 µL of each AAV is introduced per well. In case the numbers of cells expressing GECIs are insufficient, the optimal AAV amount for infection should be determined.\nMaintain the culture for 1–2 weeks until the GECIs are expressed.\n3. Ca2+ Imaging\nSimultaneous imaging of cells expressing Lck-RCaMP2 and OER-GCaMP6f\nNOTE: To simultaneously record the Lck-RCaMP2 and OER-GCaMP6f signals, image-splitting optics are required. The optics enable the separation of RCaMP2 and GCaMP6f and their projection onto the same photographic frame of the camera (Figure 3A). Simultaneous imaging also requires (1) light sources that can simultaneously emit excitation light in the blue (450–490 nm) and green (500–560 nm) spectra, (2) double-band filter and dichroic mirror sets in the microscope, and (3) emission filters for RCaMP2 and GCaMP6f. For details, refer to the Table of Materials. \n\t\nTurn on the imaging devices and computers at least 30 min before the recording. Prewarm the microscope heating chamber to 37 °C. Set up the image-splitting device, filters, and light source. Align the image-splitting optics so that the same field of view appears on the camera. Choose the appropriate objective lens (see Table of Materials).\nMount the coverslip containing the cells transfected with Lck-RCaMP2 and OER-GCaMP6f in the recording chamber, add the appropriate imaging medium or buffer (400 µL for 18 mm coverslips) in the chamber, and place it on the microscope stage. Place a lid on the recording chamber to avoid the evaporation of the medium.",
    "Locate the cells expressing both Lck-RCaMP2 and OER-GCaMP6f by fluorescent imaging. Minimize the excitation light intensity to prevent photobleaching and phototoxicity.\nRemove the lid and start a time-lapse recording at 10 Hz. During this recording, add the agonist to the chamber to evoke Ca2+ responses (e.g., histamine for HeLa cells, ATP for COS-7 cells). \nSave the time-lapse data in the hard disk drive (HDD).\nAnalyze the data using image analysis software.\nRecording spontaneous activities of astrocytes expressing Lck-RCaMP2 and OER-GCaMP6f\nNOTE: Without image-splitting optics, the Ca2+ signals at the plasma membrane and those around the ER can be monitored in the same cell. Here, the sequential recording of Lck-RCaMP2 and OER-GCaMP6f in the same astrocytes is described. An oil-immersion objective with a numerical aperture larger than 1.3 is highly recommended for spontaneous Ca2+ activity. \n\t\nTurn on the microscope, camera, light source, and the microscope heating chamber at least 30 min before recording.\nMount the coverslip containing the cells transfected with Lck-RCaMP2 and OER-GCaMP6f in the recording chamber and add 400 µL of the imaging medium. Place a lid on top of the chamber.\nChoose the filter set for GCaMP6f and the light source (blue excitation light, e.g. 470– 490 nm; see Table of Materials). Locate the astrocytes expressing OER-GCaMP6f.\nChoose a filter set and the light source for RCaMP2 (green excitation light, e.g., 510–560 nm; see Table of Materials) and confirm whether Lck-RCaMP2 is expressed in the same astrocytes. Avoid long exposure to the light source to prevent photobleaching. \nRecord time-lapse images of Lck-RCaMP2 at 2 Hz for 2 min. Save the imaging data on the HDD.\nChange the filter set to that for GCaMP6f. Record time-lapse images of OER-GCaMP6f in the same field of view, at 2 Hz for 2 min. Save the data on the HDD.",
    "Analyze the data using the image analysis software.\nRecording spontaneous neuronal activity and induced Ca2+ elevation in neurons\nNOTE: The microscope setup for neuronal imaging is the same as that described in section 3.2. Here, the imaging of spontaneous Ca2+ elevation due to Lck-GCaMP6f and Ca2+ elevation induced by mGluR activation due to OER-GCaMP6f is described. \n\t\nTo record spontaneous neuronal activity, mount the coverslip containing the cells expressing Lck-GCaMP6f in the recording chamber and add 400 µL of imaging medium. Place a lid on top of the chamber.\nSet the filter and the light source (blue excitation, e.g. 470–790 nm; see Table of Materials) to those for GCaMP6f. Find the neurons expressing Lck-GCaMP6f and showing spontaneous activity.\nAcquire images at 2 Hz or faster. Save the data on the HDD.\nAnalyze the data using the image analysis software.\nTo record induced Ca2+ elevation, mount the coverslips containing the cells expressing OER-GCaMP6f with 400 µL imaging medium. Place a lid on top of the chamber. \nUsing the filter set for GCaMP6f, find the neurons expressing OER-GCaMP6f.\nRemove the lid. Start the time-lapse recording at 2 Hz or faster. During the recording, add the agonists for a Gq-protein-coupled receptor (e.g., mGluR5 agonist [RS]-3,5-dihydroxyphenylglycine [DHPG]) to evoke a Ca2+ release from the ER.\nSave the time-lapse images on the HDD and analyze the data."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}