{
  "id": 2545,
  "origin_website": "Cell",
  "title": "Single-Cell Sorting of HBsAg-Binding Memory B Cells from Human Peripheral Blood Mononuclear Cells and Antibody Cloning",
  "procedures": [
    "Step-By-Step Method Details\nStep-By-Step Method Details\nPurification of CD19+ B Cells from PBMCs\nTiming: ~2 h\nThis step will provide a detailed procedure for enrichment of CD19+ B cell from human PBMCs.\nNote: Use a vial of PBMCs from naïve donor or an extra vial from selected donors with elite serum neutralizing activity to process alongside for flow cytometry compensation and for background determination during sorting.\nNote: All the procedures should be performed following institutional biohazard guidelines for human sample preparation.\nNote: Refer to CD19-MicroBeads (Cat#130-097-055, Miltenyi Biotech) User Guide for detailed instructions.\nTake the cryovials of PBMCs from liquid nitrogen and quickly thaw them in the 37°C warm water until little ice left. Transfer all PBMCs into a 50 mL falcon tube filled with 40 mL warmed RPMI 1640 medium and mix well.\nPre-cool the centrifuge to 4°C. Spin cells 300 × g for 5 min at 4°C.\nDiscard the supernatant into bleach and resuspend the cell pellet with pre-chilled MACS buffer (100 μL of buffer per 1 × 107 total cells).\nAdd 20 μL of CD19 MicroBeads (Cat#130-097-055, Miltenyi Biotech) per 1 × 107 total cells.\nNote: For example, if five cryovials (2 × 107 cells per cryovial) are thawed, resuspend the cell pellet with 1 mL pre-chilled MACS buffer and further add 200 μL of CD19 MicroBeads for incubation.\nMix well and incubate with rotation for 20 min at 4°C.\nDuring the incubation, prepare the QuadroMACS Separator (Cat#130-091-051, Miltenyi Biotech) for LS columns (Cat#130-042-401, Miltenyi Biotech), and place LS column in the magnetic field of a QuadroMACS Separator.\nNote: One LS column is sufficient for positive selection for 1 × 108 labeled cells from 2 × 109 total cells.\nRinse the LS columns with 3 mL MACS buffer.",
    "When the incubation is over, fill the tubes with chilled MACS buffer. Spin cells 300 × g for 5 min at 4°C and discard the supernatant. Resuspend the washed cell pellet in 2 mL cold MACS buffer.\nProceed to magnetic separation and apply cell suspension onto the rinsed LS columns.\nCollect the CD19- cells that pass through into a 15 mL falcon tube.\nNote: This is unlabeled CD19- cell fraction. Discard these cells or use them for other purposes.\nPerform washing steps by adding 3 mL MACS buffer three times.\nNote: Wait until the column reservoir is empty and then add the fresh buffer to wash.\nRemove the LS column from the MACS Separator and place it on a 15 mL falcon collection tube.\nPipette 5 mL MACS buffer onto the column. Immediate take the plunger and flush out the magnetically labeled cells by pushing the plunger (supplied with the LS column) firmly and gently.\nNote: If there are two LS column with the same sample of PBMCs, repeat the same with the second LS column and flush out the CD19+ cells into the same collection tube.\nFill the collection tube with chilled FACS buffer. Spin cells 300 × g for 5 min at 4°C.\nThere will be a small CD19+ cell pellet in the collection tube. Discard the supernatant and resuspend the washed cell pellet in cold FACS buffer (use 300–500 μL for original 1 × 108 total cells).\nOptional: The number of the enriched CD19+ B cells in this step could be determined.\nNote: The purity of enriched B cells, assessed by flow cytometry using CD19 or CD20 staining, reaches 96%–98%.\nAlternatives: For the enrichment of CD19+ cells, alternative magnetic separation beads, such as Dynabeads magnetic beads, could be used.\nLabeling of HBsAg+ B Cells and Single-Cell Sorting",
    "Timing: ~3–6 h\nThis step will provide a detailed procedure for fluorescent staining of the enriched CD19+ cells. The two-color (HBsAg-PE+ and HBsAg-APC+) with a dump channel (ovalbumin-Alexa Fluor 488+) staining strategy increases the specificity of the sorted single cells.\nAdd Human Fc Block (Cat#564220, BD Biosciences) into the suspended cells at 1:50 of total volume and incubate at 4°C for 20 min.\nNote: Human Fc Block is used to block unwanted binding of antibodies to human Fc receptor-expressing cells and to decrease staining background. Human Fc Block (Cat#564220, BD Biosciences) is widely used due to its high specificity, but alternative products or homemade reagents could also be used.\nWash the cells with chilled FACS buffer. Spin cells 300 × g for 5 min at 4°C.\nDiscard the supernatant and resuspend the washed cell pellet in cold FACS buffer (use 300 μL for original 1 × 108 total cells). Use a small proportion of cells for flow cytometry compensation, while the rest for the real sample staining.\nGeneration of single stained controls and flow cytometry compensation.\nSplit the cells used for compensation into six aliquots (eppendorf tubes or six wells in a 96-well plate).\nGenerate single stained controls by adding PE-Cy7 anti-human CD20 (Cat#335811, BD Biosciences), PE anti-human CD27 (Cat#555441, BD Biosciences), APC anti-human IgG (Cat#550931, BD Pharmingen), Alexa Fluor 488 anti-human CD19 (Cat#557697, BD Biosciences) and Bv421 anti-human CD19 (Cat#562440, BD Biosciences) antibodies, respectively, to five of the aliquoted samples. All antibodies are added in a 1:10–1:20 volume dilution. The sixth aliquot is a non-staining control.\nIncubate at 4°C for 30 min in the dark.\nWash twice with cold FACS buffer by centrifugation at 300 × g for 5 min at 4°C.\nResuspend the cells in 200 μL FACS buffer.",
    "Perform fluorescence-activated cell sorting (FACS) compensation using flow cytometer (BD FACSAria™ II Cell Sorter, BD Biosciences) before single-cell sorting.\nNote: Prepare the samples for compensation in parallel with the following staining.\nGeneration of fully stained samples.\nAdd the pre-incubated strep-PE-HBsAg, strep-APC-HBsAg, and strep-Alexa Fluor 488-ovalbumin (dump channel) simultaneously to the enriched CD19+ cell fraction.\nCritical: For every original 108 total cells, add 3 μg of each fluorescently labeled HBsAg and 3 μg ovalbumin for staining. Lower amount of proteins may lead to inefficient staining.\nIncubate at 4°C in the dark for 30 min.\nAdd PE-Cy7 anti-human CD20 (Cat#335811, BD Biosciences) and Bv421 anti-human IgG (Cat#562581) directly to the CD19+ cell fraction without washing.\nNote: Anti-human IgG staining is optional.\nIncubate at 4°C for another 20 min in the dark.\nAfter incubation, wash twice with cold FACS buffer by centrifugation at 300 × g for 5 min at 4°C.\nResuspend each CD19+ cell sample in 1 mL FACS buffer.\nOptional: Viability dye could be used in the dump channel to gate out dead cells and debris.\nRun the control samples (CD19+ cells enriched from a naïve donor or a vaccinated donor with low level of serum anti-HBs titer) to confirm proper compensation on the sorter and set the gate for sorting (CD20-PE-Cy7+, IgG-Bv421+, HBsAg-PE+, HBsAg-APC+, ovalbumin-Alexa Fluor 488−) (Figure 1[href=https://www.wicell.org#fig1]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/205-Fig1.jpg\nFigure 1. Gating Strategy and Representative Data for Flow Cytometry Analysis\n(A) Samples with a low level of anti-HBs titers. Each panel from left to right corresponds to a sequential gating strategy. Frequencies of HBsAg-specific memory B cells in PBMCs are shown in the right most panel. FSC, forward scatter; SSC, side scatter (-A, area; -H, height; -W, width).",
    "(B) Samples with a high level of anti-HBs titers and a high level of serum neutralizing activities. The percentages of IgG+ memory B cells that bind to HBsAg antigen (HBsAg-PE+ and HBsAg-APC+) are significantly increased.\nPrepare the lysis buffer for single-cell sorting.\nRecipe for the lysis buffer (for ten 96-well plates in theory).\ntable:files/protocols_protocol_205_1.csv\nAdd 4 μL into each well of 96-well plates using multichannel pipette (Cat#17013808, RAININ). Avoid bubbles during adding.\nCritical: Keep the plates on ice before sorting.\nCritical: Perform this step in the DNA-free hood to avoid RNase contamination.\nPerform the calibration procedure of the sorting instrument for 96-well plate sorting prior to the single-cell sorting.\nPerform single-cell FACS using flow cytometer (BD FACSAria™ II Cell Sorter, BD Biosciences). Sort CD20-PE-Cy7+ IgG-Bv421+ HBsAg-PE+ HBsAg-APC+ ovalbumin-Alexa Fluor 488− single cells into each well of the 96-well plates (Figure 1[href=https://www.wicell.org#fig1]B).\nNote: Two-color flow cytometry of HBsAg-PE and HBsAg-APC yield diagonal patterns, eliminating B cells with non-specific binding to PE or APC.\nAfter sorting, seal the 96-well plates immediately by using aluminum foil.\nPut the 96-well plates on dry ice immediately and store them at −80°C.\nPause Point: RNA in the sorted single cells could be stable at −80°C for at least 2 months.\nReverse Transcription from Sorted Single Cells\nTiming: ~2.5 h\nThis step will provide a detailed procedure for reverse transcription of the sorted HBsAg-binding single B cells.\nCritical: To avoid DNA/RNA and RNase contamination is crucial for this step. Perform this step in the DNA-free hood, and decontaminate the hood prior to use.\nTake plates out from −80°C and thaw on ice for 5–10 min.\nCentrifuge at 300 × g for 5 min at 4°C.\nPrepare reverse transcription mixture (RT mix-I) under sterile conditions and on ice.\nRecipe for RT mix-I (for one 96-well plate).\ntable:files/protocols_protocol_205_2.csv",
    "Add 7 μL into each well of 96-well plates using multichannel pipette. Avoid bubbles during adding. Now there are 11 μL in each well.\nPipette the liquid to rinse the sides of wells and then mix 10 times using a multichannel pipette\nCritical: Keep the plates on ice.\nCover plates with sterile aluminum sealing foil and centrifuge at 300 × g for 1 min at 4°C.\nIncubate plates for 5 min at 65°C in the preheated thermocycler (Cat#A24811, Thermo Fisher Scientific).\nAfter incubation, chill the plate on ice for 2–5 min.\nPrepare reverse transcription mixture (RT mix-II) under sterile conditions and on ice.\nRecipe for RT mix-II (for one 96-well plate).\ntable:files/protocols_protocol_205_3.csv\nNote: Prepare dNTP (25 mM) by mixing stock of dATP (Cat#R0141, Thermo Fisher Scientific), dTTP (Cat#R1191, Thermo Fisher Scientific), dCTP (Cat#R0151, Thermo Fisher Scientific), and dGTP solutions (Cat#R0161, Thermo Fisher Scientific) at 1:1:1:1 ratio. Aliquot and store them at −20°C.\nAdd 7 μL into each well of 96-well plates using multichannel pipette. Avoid bubbles during adding. Now there are 18 μL in each well.\nMix 10 times using a multichannel pipette.\nCover plates with sterile aluminum sealing foil and quick centrifuge at 4°C.\nPlace plates into PCR thermocycler (Cat#A24811, Thermo Fisher Scientific) and run the program as below.\ntable:files/protocols_protocol_205_4.csv\nRemove the plates from the PCR thermocycler and quick centrifuge at 4°C.\nPause Point: Seal the plates by wrapping the sides with parafilm membranes and store the plates at −80°C. The transcribed cDNA could be stable at −80°C for at least several months.\nNote: Researchers could also proceed to perform the PCR amplification immediately.\nAntibody Cloning – 1st PCR\nTiming: ~4 h\nThis step will provide a detailed procedure for 1st round of nested PCR reactions.\nTake the plates out from −80°C and thaw on ice for 10 min.",
    "Add 10 μL of pre-chilled nuclease-free water (Cat#129114, QIAGEN) and mix 10 times using a multichannel pipette. Centrifuge at 300 × g for 1 min at 4°C. Now there are 28 μL in each well. Keep the plates on ice for the first round of nested PCR reactions.\nPrepare primers for PCR reactions.\nDilute all primers to 50 μM each.\nTo prepare forward primer mixture, mix forward primers at 1:1:1 ratio for immunoglobulin heavy chain, Kappa light chain, and Lambda light chain respectively.\nUse forward primer mixtures and individual reverse primers (1st PCR) for the first round of nested PCR reactions.\nNote: Forward primers mixture for heavy chain: F1-HC (5′-ACAGGTGCCCACTCCCAGGTGCAG) + F2-HC (5′-AAGGTGTCCAGTGTGARGTGCAG) + F3-HC (5′-CCCAGATGGGTCCTGTCCCAGGTGCAG) + F4-HC (5′-CAAGGAGTCTGTTCCGAGGTGCAG). Reverse primer for heavy chain (1st PCR): R1-HC (5′-GGAAGGTGTGCACGCCGCTGGTC).\nNote: Forward primers mixture for kappa light chain: F1-Kappa (5′-ATGAGGSTCCCYGCTCAGCTGCTGG) + F2-Kappa (5′-CTCTTCCTCCTGCTACTCTGGCTCCCAG) + F3-Kappa (5′-ATTTCTCTGTTGCTCTGGATCTCTG) + F4-Kappa (5′-ATGACCCAGWCTCCABYCWCCCTG). Reverse primer for kappa light chain (1st PCR): R1-Kappa (5′-GTTTCTCGTAGTCTGCTTTGCTCA)\nNote: Forward primers mixture for lambda light chain: F1-Lambda (5′-GGTCCTGGGCCCAGTCTGTGCTG) + F2-Lambda (5′-GGTCCTGGGCCCAGTCTGCCCTG) + F3-Lambda (5′-GCTCTGTGACCTCCTATGAGCTG) + F4-Lambda (5′-GGTCTCTCTCSCAGCYTGTGCTG) + F5-Lambda (5′-GTTCTTGGGCCAATTTTATGCTG) + F6-Lambda (5′-GGTCCAATTCYCAGGCTGTGGTG) + F7-Lambda (5′-GAGTGGATTCTCAGACTGTGGTG). Reverse primer for lambda light chain (1st PCR): R1-Lambda (5′-CACCAGTGTGGCCTTGTTGGCTTG).\nPrepare mixture for the first round of nested PCR reactions (1st PCR mix) under sterile conditions and on ice.\nRecipe for 1st PCR mix (for one 96-well plate).\ntable:files/protocols_protocol_205_5.csv\nNote: Prepare dNTP (25 mM) by mixing stock of dATP (Cat#R0141, Thermo Fisher Scientific), dTTP (Cat#R1191, Thermo Fisher Scientific), dCTP (Cat#R0151, Thermo Fisher Scientific), and dGTP solutions (Cat#R0161, Thermo Fisher Scientific) at 1:1:1:1 ratio. Aliquot and store them at −20°C.\nAdd 38 μL into each well of 96-well plates using multichannel pipette. Avoid bubbles during adding.\nPrepare PCR plates for heavy chain, kappa light chain, and lambda light chain respectively.",
    "Transfer 4 μL diluted cDNA from each well of cDNA plates to the corresponding wells in the prepared 1st PCR plates. Mix 10 times using a multichannel pipette.\nNote: Transfer three times respectively: 4 μL diluted cDNA to the heavy chain-1st PCR plate, 4 μL diluted cDNA to the kappa light chain-1st PCR plate, and 4 μL diluted cDNA to the lambda light chain-1st PCR plate.\nNote: After use, put the cDNA plates at 4°C for short-term storage and put them back to −80°C for long-term storage.\nCover the prepared 1st PCR plates with sterile aluminum sealing foil and centrifuge at 300 × g for 1 min at 4°C.\nPlace the 1st PCR plates into PCR thermocyclers and run the program as below.\ntable:files/protocols_protocol_205_6.csv\nRemove the 1st PCR plates from the PCR thermocyclers and quick centrifuge at 4°C.\nPause Point: Researchers could also proceed to perform the 2nd round of nested PCR amplification immediately or store the 1st PCR plates at −20°C for long-term storage.\nAntibody Cloning – 2nd PCR\nTiming: ~4 h\nThis step will provide a detailed procedure for 2nd round of nested PCR reactions.\nTake the 1st PCR plates. If they are frozen, thaw on ice for 10 min.\nPrepare 40% sucrose loading buffer for the 2nd PCR reaction.\nDissolve 20 g of sucrose (Cat#15503022, Thermo Fisher Scientific) in 50 mL nuclease-free water (Cat#129114, QIAGEN) in a 50 mL falcon tube.\nAdd cresol red (Cat#114472, Sigma-Aldrich) to quick dissolve and a red color is produced.\nNote: Add sufficient (but not excessive) cresol red as a dye for agarose gel electrophoresis later after the 2nd PCR reactions.\nPrepare primers for PCR reactions.\nNote: Forward primers mixtures for heavy chain, kappa light chain, and lambda light chain are the same as the ones for the 1st PCR reactions.",
    "Note: Reverse primers for the 2nd PCR reaction are different. Reverse primer for heavy chain (2nd PCR): R2-HC (5′-GTTCGGGGAAGTAGTCCTTGAC). Reverse primer for kappa light chain (2nd PCR): R2-Kappa (5′-GTGCTGTCCTTGCTGTCCTGCT). Reverse primer for lambda light chain (2nd PCR): R2-Lambda (5′-CTCCTCACTCGAGGGYGGGAACAGAGTG).\nPrepare mixture for the second round of nested PCR reactions (2nd PCR mix) under sterile conditions and on ice.\nRecipe for 2nd PCR mix (for one 96-well plate).\ntable:files/protocols_protocol_205_7.csv\nNote: Prepare dNTP (25 mM) by mixing stock of dATP (Cat#R0141, Thermo Fisher Scientific), dTTP (Cat#R1191, Thermo Fisher Scientific), dCTP (Cat#R0151, Thermo Fisher Scientific), and dGTP solutions (Cat#R0161, Thermo Fisher Scientific) at 1:1:1:1 ratio. Aliquot and store them at −20°C.\nNote: The 2nd PCR mix is pink or light pink due to the presence of cresol red dye.\nAdd 38 μL into each well of 96-well plates using multichannel pipette. Avoid bubbles during adding.\nPrepare the 2nd PCR plates for heavy chain, kappa light chain, and lambda light chain respectively.\nTransfer 4 μL from each well of the 1st PCR plates to the corresponding wells in the prepared 2nd PCR plates. Mix 10 times using a multichannel pipette.\nNote: Transfer three times respectively: 4 μL of 1st PCR product to the heavy chain-2nd PCR plate, 4 μL of 1st PCR product to the kappa light chain-2nd PCR plate, and 4 μL of 1st PCR product to the lambda light chain-2nd PCR plate.\nNote: After use, put the 1st PCR plates at 4°C for short-term storage and freeze them at −20°C for long-term storage.\nCover the prepared 2nd PCR plates with sterile aluminum sealing foil and centrifuge at 300 × g for 1 min at 4°C.\nPlace the 2nd PCR plates into PCR thermocyclers and run the program as below.\ntable:files/protocols_protocol_205_8.csv",
    "Remove the 2nd PCR plates from the PCR thermocyclers and quick centrifuge at 4°C.\nPause Point: Researchers could put the 2nd PCR plates at 4°C for short-term storage and −20°C for long-term storage.\nAntibody Sequencing and Analysis\nTiming: ~6 days\nThis step will provide a detailed procedure for the sequencing and analysis of the amplified variable regions.\nTake 2nd PCR plates. If they are frozen, thaw on ice for 10 min.\nDirectly load 5 μL of 2nd PCR product from each well onto 2% agarose gel with ethidium bromide.\nNote: The presence of cresol red requires no other loading dye.\nAlternatives: Many popular ethidium bromide alternatives, such as SYBR Safe (Thermo Fisher Scientific) or Gel Red (Biotium), could be used instead.\nNote: After use, cover the remaining 2nd PCR plates with sterile aluminum sealing foil and put them back to 4°C for short-term storage.\nRun the gel.\nNote: The expected size of PCR product is around 500 base pairs for heavy and light chains (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/205-Fig2.jpg\nFigure 2. Representative Figures of Gel Electrophoresis\nEach band of immunoglobulin heavy, kappa, and lambda light chains is amplified from the sorted single B cells by two rounds of nested PCR reactions.\nNote: If a multichannel pipette is used for sample loading, the sample order is as shown in Figure 2[href=https://www.wicell.org#fig2].\nCut the gel bands or purify the PCR products for sequencing. Sequence the PCR product using the reverse primers for the 2nd PCR reactions.\nNote: Sequencing primers: R2-HC (5′-GTTCGGGGAAGTAGTCCTTGAC) for heavy chain; R2-Kappa (5′-GTGCTGTCCTTGCTGTCCTGCT) for kappa light chain; and R2-Lambda (5′-CTCCTCACTCGAGGGYGGGAACAGAGTG) for lambda light chain.\nUse IMGT/V-QUEST (http://www.imgt.org/IMGT_vquest/vquest[href=http://www.imgt.org/IMGT_vquest/vquest]) (Brochet et al., 2008[href=https://www.wicell.org#bib1]) or IGBLAST (https://www.ncbi.nlm.nih.gov/igblast/[href=https://www.ncbi.nlm.nih.gov/igblast/]) (Ye et al., 2013[href=https://www.wicell.org#bib4]) tools to analyze all the sequencing results of heavy and kappa/lambda light chains.",
    "Note: The productivity of both amplified heavy and light chains will be determined, and the rearranged V-, D-, and J-genes will be assigned.\nIdentify the antibodies with functional and paired heavy and light chain.\nDetermine the antibody clonality. The antibodies with the same V and J allele assignments, the same CDR3 length, and ≥80% CDR3 identity are from an expanded clone.\nChoose the antibodies from clones for vector construction and antibody expression as previously described (von Boehmer et al., 2016[href=https://www.wicell.org#bib2])."
  ],
  "subjectAreas": [
    "Immunology",
    "Antibody",
    "Health Sciences",
    "Flow Cytometry",
    "Microbiology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}