{
  "id": 19388,
  "origin_website": "Jove",
  "title": "Targeted Knockdown of Genes in the Choroid Plexus",
  "procedures": [
    "All animal procedures described in this study were conducted in accordance with the guidelines outlined in the NIH Guide for the Care and Use of Laboratory Animals and approved by the Institutional Animal Care and Use Committee at Wenzhou Medical University.\n1. Animals\nPurchase male C57BL/6 mice aged 8-12 weeks and weighing 20-22 g.\nObtain the transgenic Rosa-LSL (Lox-StoP-Lox)-tdTomato (Ai9) mouse line, and male A2ARflox/flox mice.\nRandomly assign the mice to two groups and house in cages, with a maximum of five mice per cage, under a standard 12 h light/12 h dark cycle for 1 week.\nProvide the mice with sufficient food and water and maintain them at a constant temperature at 25 °C.\n2. ChP-specific knockdown of A2ARs with AAV2/5-shRNA\nWeigh each mouse and write down the values.\nAnesthetize the mice intraperitoneally with 1% pentobarbital sodium at a dosage of 6-8 mL/kg equivalent to 60-80 mg/kg pentobarbital, and place the mouse on a heating pad to keep it warm.\n\tNOTE: It is crucial to administer the correct dosage of pentobarbital sodium according to the mouse's weight to ensure successful surgery. The anesthesia should not be too deep, as it may result in mortality, but should not be too shallow, as the mouse may wake up during the procedure, potentially affecting the effectiveness of the virus injection. Check for the proper anesthesia dose by toe pinch and ensuring that mice do not respond.\nUse a specialized mouse shaver to trim the top hair of the anesthetized mice.\nApply eye ointment on both eyes to prevent from drying, and fix the mice onto a stereotaxic apparatus to immobilize the brain. Cover the animal with a sterile drape.",
    "Thoroughly sterilize the skin of the head and neck of the mice with three rounds of iodophor disinfectant and 75% alcohol to reduce postoperative infection. Then apply 1% lidocaine topically to the scalp of mice and make a small incision to fully expose the skull under a microscope.\n\tNOTE: Use sterile instruments throughout the procedure.\nPrepare two 10 µL syringes: one with purchased AAV2/5-A2AR-shRNA (titer: 6.27 × 109 vg/µL) and the other with purchased AAV2/5-Scramble (titer: 6.21 × 109 vg/µL).\n\tNOTE: When using the syringe, the front end needs to be connected to a glass capillary, and a range of 10 µL can be obtained by controlling the length of the glass capillary.\nUse the microscope to locate the bregma and lambda and set the coordinate point (AP: -0.58; ML: ±1.10; DL: -2.20) on the 10 µL syringe (Figure 1). The coordinate point is based on the mouse brain stereotaxic atlas15.\nDrill a small hole in the skull at the adjusted coordinate point.\n\tNOTE: Under the microscope, drilling is performed using a sterile microdrill against the surface of the skull. After drilling, by removing the meninges covering the brain and exposing the underlying brain parenchyma, injury to the blood vessels is prevented. This step prevents the tip of the glass capillary from being broken off by the meninges. The diameter of the drilled hole should be sufficient to allow the needle tip to enter the brain tissue.\nAdminister 2 µL of AAV2/5-A2AR-shRNA virus into the brain ventricle via lateral injection at a steady rate of 100 nL/min. Keep the needle in place for 10 min before withdrawing. Note that the virus was administered with unilateral injection.",
    "Seal the injured skin using medical biofibrin glue promptly to prevent virus loss, which can be rinsed out with CSF after removing the needle if the glue is not applied quickly. Also, do not use cotton buds to wipe the CSF, as it may also cause virus loss.\nTo facilitate recovery, place the mouse on a heating pad to maintain the body temperature at 37.0 ± 0.5 °C, and apply 1% lidocaine topically to the mouse's scalp. Allow the mice to recuperate for 2 weeks before inducing the EAE model, as this period is necessary for AAV2/5-A2AR-shRNA virus expression and subsequent A2AR knockdown.\n3. ChP-specific knockdown of A2AR with a Cre/locus of X-overP1 (Cre/LoxP) system\nNOTE: The following procedures can be achieved using the method described previously. Refer to steps 2.1-2.11 for detailed injection methods.\nInject 2 µL of CRE-TAT recombinase into each lateral ventricle of a Rosa-LSL (Lox-StoP-Lox)-tdTomato mouse as the experimental group and 2 µL of sterile phosphate-buffered saline (PBS) as the control group. Using the same protocol as above (section 2), inject 2 µL of CRE-TAT recombinase into each of the lateral ventricles of A2ARflox/flox mice along with 2 µL of sterile PBS as a control group.\nPrepare frozen tissue sections and perform nuclear staining 2 weeks after the CRE-TAT recombinase injection. See steps 4.1-4.3 for more information.\n4. Transcardial perfusion in mice\nAdminister 60-80 mg/kg pentobarbital sodium to deeply anesthetize the mice. Confirm the plane of anesthesia by a toe pinch and perform transcardial perfusion using 40 mL of sterile PBS solution followed by 20 mL of 4% paraformaldehyde (PFA).\n\tNOTE: Successful perfusion is indicated by a white color in the liver, while the presence of enlarged lungs or PBS outflow from the mouth during perfusion suggests a failure of the procedure.",
    "Quickly extract the mouse brain, ensuring minimal protein degradation.\nSubmerge the mouse brain in 4% PFA/PBS overnight for post-fixation, followed by replacement with 30% sucrose PB solution for 72 h.\n\t​NOTE: It is critical to avoid excessive dehydration of the brain tissue, so the brain should not be left in the sucrose PB solution for too long.\n5. Frozen tissue sectioning and staining\nEmbed the previously dehydrated mouse brain in optimal cutting temperature (OCT) glue, freeze the embedded brain, and use a sliding microtome to cut coronal sections with a thickness of 20 µm.\nPlace the brain sections on the glass slide. Once the brain sections are dry, store them in a -20 °C refrigerator for subsequent experiments.\nPlace each glass slide into a frame case and submerge the frame into a container filled with PBS to thoroughly rinse the slide. Gently rinse the brain slides with PBS solution three times, for 10 min each time.\n\tNOTE: Caution should be exercised to prevent the brain sections from falling off the glass slide.\nStain the brain slides with 4′,6-diamidino-2-phenylindole (DAPI) solution for 10 min.\nRinse the brain slides with PBS solution for 5 min.\nApply one drop of antifade mounting medium to the brain sections.\nPlace a coverslip on the brain sections, seal the coverslip with nail polish, and analyze the sections using a conventional fluorescence microscope.\n6. EAE induction\nNOTE: Perform EAE induction after 2 weeks of the shRNA or CRE-TAT recombinase injection11.\nCreate an aqueous solution by mixing 2.5 mg myelin oligodendrocyte glycoprotein (MOG35-55) with 2 mL of PBS. Prepare a complete Freunds adjuvant (CFA) oil solution by mixing M. tuberculosis (H37Ra) with incomplete Freunds adjuvant (IFA).\nMix the aqueous and oil solutions in a 1:1 ratio. Use a tee pipe to whip the mixture into an oil-in-water state.",
    "NOTE: The tee pipe is also called a three-way pipe. It is a plastic tube that can control the direction of flowing solution to fully mix the MOG35-55 and CFA.\nUse a high-speed homogenizer to make the MOG antigen emulsion for the EAE model under ice bath conditions.\nAnesthetize the mice intraperitoneally with 1% pentobarbital sodium at a dosage of 6-8 mL/kg equivalent to 60-80 mg/kg pentobarbital.\nSubcutaneously inject the MOG antigen emulsion into four different points (neck, back, left and right hips) at a volume of 10 mL/kg for a total of four injections each.\n\tNOTE: It is important to carefully select the injection site, as different sites may have varying effects on the morbidity and mortality of mice. Additionally, repeated MOG injections can lead to immune tolerance, so the research team chose a single injection method to prevent this potential issue.\nImmediately inject 500 ng/mL of pertussis toxin (PT) intraperitoneally at a dosage of 5 mg/kg after MOG injection.\n\tNOTE: PT increases the permeability of the blood-brain barrier (BBB) and facilitates the infiltration of T cells into the brain.\nAfter 48 h, intraperitoneally inject the PT solution at the same volume.\n7. Neurological deficit score\nEvaluate and grade the mice daily using a rating scale16 ranging from 0 to 15 to assess the incidence and severity of EAE according to the following neurological deficits:\n\tTail: 0 indicates no signs, 1 represents a half-paralyzed tail, and 2 indicates a fully paralyzed tail.\n\tLimbs: 0 indicates no signs, 1 represents a weak or altered gait, 2 indicates paresis, and 3 represents a fully paralyzed limb.\nAssign a quadriplegic animal having complete paralysis a score of 12, and assign mortality a score of 15.\n8. Hematoxylin-eosin (H&E) staining",
    "Take the dehydrated mouse brain and embed it in molten paraffin. Allow the paraffin block to cool and solidify for later use.\n\tNOTE: The paraffin block should be completely dry and cool to avoid tissue damage.\nCut the mouse brain paraffin block into 5 µm thick slides. Place the paraffin mouse brain section on a glass slide and dry it in a 60 °C oven for 3 h.\nSubmerge the slides sequentially in xylene solution I for 10 min, xylene solution II for 10 min, 100% alcohol I for 3 min, 100% alcohol II for 3 min, 95% alcohol for 3 min, 90% alcohol for 3 min, 80% alcohol for 3 min, 70% alcohol for 3 min, and distilled water for 1 min.\n9. Quantitative polymerase chain reaction (qPCR) analysis\nAfter perfusing the mice with PBS, remove the ChP from the ventricles and extract RNA with Trizol. Synthesize the cDNA using the first Strand cDNA Synthesis Kit.\nCarry out qPCR analysis using Ex Taq SYBR-green premix and a real-time PCR system. Use the following A2AR primers: forward - GCCATCCCATTCGCCATCA; reverse - GCAATAGCCAAGAGGCTGAAGA.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}