{
  "id": 18493,
  "origin_website": "Jove",
  "title": "Human Vastus Lateralis Skeletal Muscle Biopsy Using the Weil-Blakesley Conchotome",
  "procedures": [
    "Ethics statement: A description of the muscle biopsy procedure we follow within our institution now follows. The muscle biopsy procedure is used in the Hertfordshire Sarcopenia Study which has been approved by the Hertfordshire Research Committee number 07/Q0204/68. All participants gave written informed consent 20.\nNOTE: A single operator can perform the procedure, aided by an assistant who can engage the participant in conversation in order to reduce anxiety and ensure that they are comfortable at all times. The procedure room should be equipped with a sink, a height adjustable couch, clean surfaces and a procedure trolley.\n1. Prepare the Participant (Figure 2)\nAsk the participant to lay comfortably, supine on a couch. Expose the preferred thigh from the groin crease. Spread a disposable absorbent sheet under the exposed thigh. Ensure that the leg remains straight and relaxed throughout the procedure but the thigh is tensed momentarily to outline the vastus lateralis.\nMark the procedure site approximately two-thirds down an imaginary line from the anterior superior iliac spine to the patella.\n2. Prepare the Skin (Figure 2)\nShave the skin to approximately 4 cm in diameter surrounding the proposed biopsy site with a sterile shaving blade and clean the skin with an alcohol swab.\n\tNOTE: This is to prevent any subsequent hair entrapment in the wound during the healing process. This step is optional according to the operator's preference.",
    "Infiltrate the skin and overlying fascia with local anesthetic. Use a 25 G needle to raise a subcutaneous bleb of 2% lidocaine then infiltrate deeper into the subcutaneous tissue with a 23 G needle. Aim to penetrate to at least half to one inch depending on the subcutaneous tissue content at the biopsy site. This depth should be sufficient to ensure the overlying fascia is anesthetized. Allow 2 - 5 min for the anesthetic to action. Confirm anesthesia by probing the skin gently with the needle or scalpel blade tip.\n3. Prepare a Sterile Field (Figure 2)\nWash hands with soap and maintain clean hands until a sterile gown is worn. Cover hands with sterile gloves before creating a sterile field on the procedure trolley.\nSterilize the biopsy site with 2% chlorhexidine/isopropyl alcohol solution or an iodine based skin disinfectant. Apply a sterile drape with an adhesive aperture to expose the biopsy site but to also maintain a sterile field.\n4. Perform the Procedure (Figure 2)\nWith a size 11 scalpel, make a 5 - 10 mm incision on the skin and down and through the overlying fascia. Insert the closed biting tip of the conchotome through the incision at a right angle to the long axis of the femur, to a depth averaging half to one inch. If required use the free hand to hold and support the thigh surrounding the biopsy site while the tip of the conchotome is opened and closed within the muscle.",
    "Rotate the conchotome through 90 - 180° to cut the muscle. Withdraw the conchotome and open the tip onto sterile gauze dampened by sterile normal saline. Repeat the procedure within the single wound site, if necessary, to obtain sufficient muscle tissue. Transfer the gauze into a container placed on ice. Transfer the container to a preparation laboratory to process the muscle according to the local institutional protocol.\n5. Post Procedure (Figure 2)\nApply direct pressure to the wound for up to 5 min. Close the wound with steri-strips by placing them parallel to the wound as opposed to right angles to avoid potentially removing scar tissue and reopening the wound if the steri-strips are removed inadvertently. Place a sterile absorbent dressing on the steri-strips and tie a two-layer bandage for compression and secure with tape.\nExplain the wound dressing method to the participant as they will have to perform a dressing change 3 - 4 days after the procedure. Ensure that the participant removes the compression bandage before going to bed later that evening.\n6. Post Biopsy Advice\nInform the participant that it is common to experience some thigh stiffness which can be relieved by gentle exercise (e.g., walking). Use simple analgesia such as acetaminophen. Warn the participant about transient numbness around the biopsy site that may persist for up to two weeks as well as the potential complication of wound infection.\n7. Instructions for the Subject Post Procedure\nAsk the participant to avoid vigorous activity for 72 hr (such as climbing, running, heavy lifting). Ask the participant to avoid immersion in water for 48 - 72 hr. However, instruct the participant to wrap cling film or similar around the biopsy site when having a shower to keep the dressing dry.",
    "Ask the participant to change the dressing after 3 - 4 days and remove the steri-strips after one week.\n\tNOTE: The participant should be given written instructions for post biopsy care, spare dressings and emergency contact details of the team responsible for performing the procedure.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}