{
  "id": 12665,
  "origin_website": "Jove",
  "title": "The Motivation for Alcohol Reward: Predictors of Progressive-Ratio Intravenous Alcohol Self-Administration in Humans",
  "procedures": [
    "This protocol follows the guidelines of the National Institutes of Health's human research ethics committee.\n1. Initial nursing measures and set-up\nPerform a breathalyzer test to ensure a zero BrAC.\nTake vitals of interest such as temperature, respiration rate, blood pressure, and heart rate. Confirm age and sex. Take height (cm) and weight (kg).\nCollect a urine sample for a urine drug screen for all participants. Run a urine beta-hCG pregnancy test for females. Ensure both are negative to continue the study.\nProvide participants with a standardized 350 kcal metabolic meal.\nComplete a brief medical history to determine any recent hospital visits, illnesses, new medications since their screening visit for any changes that may significantly impact their safety during the study and quality of the data collected.\nAdminister a recent drinking history questionnaire to assess any changes in alcohol consumption since their screening visit.\nIf there are any clinically significant medical findings, alert nursing and research staff.\nInsert a 20 G IV catheter into a vein in the antecubital fossa of the non-dominant arm for the alcohol infusion. Secure the positioning, Flush the indwelling catheter with a 5 mL of pre-filled saline flush, and cap the catheter.\nConfirm delivery of alcohol infusate, including participant name, age, sex, and date of expiration.\nObtain aliquots from both IV bags and test the solution for correct alcohol concentration amount using a refractometer.\nInstruct the participant to void the bladder.\nAdminister baseline measures of interest.\n2. Set up IV pump\nEnsure the IV pump is plugged into an outlet.\nConnect the standard IV tubing to the infusion bags. Run the infusate through the entire length of the IV tubing using the IV pump to saturate the inner-tubing surface area and flush out any significant air bubbles.",
    "Choose enough tubing sets between the participant's arm to be infused and IV pump based on proximity to the bathroom so that the participant may use the restroom while remaining connected to the IV pump.\nConnect the ethernet cable from the computer to the pump.\nSwitch on the pump by pressing the gray Power ON button on the upper right side.\nPress the Volume Infused button on the left side. Make sure the numbers read zero.\nIf the numbers do not read zero, press the Clear button.\nPress the Options/Edit button. Press the number 4 to select the computer control option.\nUse the arrow buttons on the top row of the pump to select Yes and press Enter.\nEnsure that there is a Computer Control flashing on the top of the pump screen.\n3. Set up the laptop (Figure 1)\nNOTE: The sections below are performed using the software and the accessories associated with the CAIS system.\nConnect the Drink button that the participant uses to click for drinks into the USB portal closest to the participant.\nEnsure the Drink button is connected prior to opening the software, or the software will not detect the button.\nInsert the dongle.\nSelect the drive to enter the password.\nOnce the password has been accepted, open the drive titled SecuDrive to access the software.\nDouble click the software icon.\nClick on File > New Session\nCreate a filename using desired participant number.\nSave the data to the desktop, not the dongle, as the software may overload the dongle and crash.\nSelect the PR experiment from the drop-down menu labeled Select Experiment.",
    "When the set-up screen appears requesting further information on the participant, fill in the fields requesting participant identification number, select \"Standard\" as study type, then enter sex and age in the appropriately labeled fields.\nEnter height (cm) and weight (kg) in the required fields using the data collected earlier in the visit.\nClick on the Submit button.\n\tNOTE: The graph panel and the \"welcome\" window for the participant will now appear on the screen.\nMove the window over to the participant's monitor by clicking and dragging across the screen. Enlarge to full screen so the participant can see it.\n4. Progressive Ratio (PR) self-administration session (Figure 2)\nOffer participants a bathroom break before beginning. Afterward, connect IV tubing from the infusion bags to the participant. Read instructions to the participant.\n\tNOTE: Instructions should include what participants are not allowed to do (i.e., read, do work, use their phone), what will happen during the experiment, such as serial measures collected, and any information regarding the increasing work scale for receiving drinks.\nOn the laptop, click on the Start/Run button at the top of the screen.\n\tNOTE: A prompt appears on the participants' monitor, informing them to click the Drink button for their priming rewards.\nInstruct the participant to press the Drink button as soon as the monitor prompts them to for their four individually standardized priming doses. Remind the participant to begin pressing the Drink button each time the screen prompt appears so that they reach their expected BrAC within 10 min.\n\tNOTE: The entire priming phase should last 10 min. The doses require 2, 4, 7, and 10 button presses respectively in order to reach approximately 30 mg/dL (0.030 g/dL).",
    "At the 10 min mark (immediately following the last priming drink), collect the BrAC and blood pressure. Administer the subjective response measures.\nEnter the BrAC into the software by pressing Ctrl + B and typing in the value (i.e., 0.030). This will cause the algorithm to adjust if need be. Repeat this step every time a BrAC is collected.\nAllow the participant to rest for 10 min.\n\tNOTE: The infusion system will continue to deliver the infusate with a rate profile that achieves a linear descent in BrAC and will not count any button pushes until the ad-lib phase begins.\nAt the 20 min mark, collect the BrAC and blood pressure. Administer the subjective response measures.\nAt the 25 min mark, inform the participant that the bar is open and include any further instructions required for the experiment. Do not interrupt work efforts when collecting measures from the participant.\n\tNOTE: This instruction marks the transition from the priming to voluntary self-administration phase; participants are now working towards earning a reward any time and rate they wish or to pause or stop. Each drink requires increasing numbers of button presses before the reward is initiated.\nAt the 45 min mark, collect the BrAC, blood pressure, and subjective response measures.\nContinue to collect subjective response measures, blood pressure, and BrAC every 15 min until the 165 min mark.\nEnter BrAC measures immediately into the system to adapt to any modeling errors.\n5. End of session\nClick the Data tab on the software and select Export.",
    "NOTE: The system will create a .CAS file of all time-stamped data relevant to the experiment, including participant number, dates, morphometric data, PBPK parameters, BrAC trajectory, infusion rate profile, BrAC measurements, button push history, alcohol used, bathroom breaks, and any technician comments entered during the session. The .CAS file is write-protected but can be used to replay the session at any future date.\nRemove the IV catheter.\nPress the Volume Infused button on the left side of the pump to see the values.\nRecord the total volume of infusate used on the flowsheet.\nRemove the IV catheter.\nContinue to collect BrAC every 15-30 min until BrAC is below 20 mg/dL (0.02), or until the study-specific discharge criteria are met.\n\t​NOTE: The protocol ends here. The following steps are for potential troubleshooting issues and data analysis.\n6. Drink button troubleshooting\nDo not stop the session if the Drink button loses connection with the software and no longer responds to a press.\nRemove the Drink button from the port and place it in a different port on the computer.\n\tNOTE: The original port is no longer recognized by the software.\nClick View on the software screen, scroll to the bottom, and select Map Drink Buttons.\nAfter a pop-up window appears on the screen, select the Drink button (signaling the software its new location) so that the address of the button's new location is entered for the Drink button.\nSelect OK on the pop-up window on the computer screen.\nPress the Drink button again, and let the participant accept the drink."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}