{
  "id": 1956,
  "origin_website": "Cell",
  "title": "An adaptable live-cell imaging protocol to analyze organelle morphology in Saccharomyces cerevisiae",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPreparation for growing and imaging cells\nTiming: 1–2 days\nGrow the liquid cultures\nInoculate a single colony of yeast in appropriate synthetic minimal/ complete media and grow overnight (12–14 h) at 30°C with shaking at 220 rpm.\nSub-culture into fresh medium to a starting OD 600 of 0.15–0.2 the next day and grow for 3–4 h at 30°C with shaking at 220 rpm.\nPrepare the cell suspension\nHarvest cells from mid-log phase (OD 600- 0.6 to 1.0) by spinning 1 mL of culture at 3000g for 1 min. If imaging from other stages of growth, use appropriate volume of the starting culture. For reference to the size of pellet, see Figure 2[href=https://www.wicell.org#fig2]A.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1438-Fig1.jpg\nFigure 1. Representative images of nuclear components in budding yeast. The figure shows various nuclear sub-compartments in yeast imaged using ectopically expressed fluorescent markers in wild type cells\n(A) Nucleolus and nuclear membrane are visualized by mRFP-Nop1 and GFP-Esc1 respectively. Scale-5 μm.\n(B) dsRed-HDEL is used to mark ER and GFP-Nup49 marks the nuclear pore complexes distributed along the nuclear envelope. Scale-2 μm\n(C) The image panel shows localization of various proteins tagged with GFP that can be used to assess nuclear morphology. The nuclear region visualized using each construct is mentioned beneath the image. Scale-5 μm. Scale bar for each image is shown and micrographs in A and B are deconvolved using Huygens Professional.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1438-Fig2.jpg\nFigure 2. Preparing cells for imaging\n(A) The picture shows pellet size obtained for cells harvested at the indicated OD600.\n(B) The field represents an ideal distribution of cells for acquiring images. Scale-10 μm\n(C) The image shows a live-cell imaging setup with a 35 mm dish with glass bottom mounted on a temperature-controlled stage.",
    "Wash the pellet with 1 mL of fresh media prewarmed to the growth temperature (usually 30°C). This allows removal of any debris or particles that can interfere with the field of view while imaging.\nResuspend the pellet in 20–50 μL of media.\nImmobilize the cells (Methods video S1[href=https://www.wicell.org#mmc2])\nTake the glass bottom dish coated with 0.1% ConA.\nLay 10 μL cell suspension over the ConA coated dish and spread gently with P200 pipette tip.\nNote: Immobilization of cells with 0.1% ConA in the glass dish containing growth media does not affect the cell division time. The wild-type cells complete division in 80–100 min, similar to the time taken when grown in a liquid culture placed in an incubator.\nLet the cells adhere to the glass by leaving it undisturbed for 3–5 min.\nAdd 500 μL of media and mix up and down gently using a pipette to remove unadhered cells. Remove excess liquid and repeat the process two times.\nCritical: Do not pipette directly over the cells to avoid loss of adhered cells.\nAdd 500 μL -1 mL of fresh media and begin imaging.\nNote: The above steps give a cell density of approximately 35–50 cells in a field of 50 μm × 50 μm (Figure 2[href=https://www.wicell.org#fig2]B). The cells remain healthy for up to 12 h in media containing 2% glucose. In order to increase cell density, a higher volume of cell suspension can be laid over the ConA coated base. To reduce the cell density, either dilute the cell suspension or increase the washing step mentioned in step 6d. For dishes with a glass base of 25 mm diameter, use 20 μL ConA (0.1%) to coat the base. Similarly, a higher volume of cell suspension can be laid on the coated base (30–50 μL).",
    "Your browser does not support HTML5 video.\n  \nTable S1. Excel sheet with values of shape descriptors exported from FIJI, related to step 7e\nImage acquisition\nTiming: 30 min–3 h\nHere we describe the steps involved in acquisition of images. Some of the terms and features mentioned are specific to acquiring images on Leica TCS (SP8) using LAS X. However, equivalent options also exist in other commonly available microscope devices and their respective software. They have been mentioned where necessary. We use a HC PL APO CS2 63×/1.40 OIL objective on our Leica TCS SP8. The temperature is controlled using a stage top incubator (Figure 2[href=https://www.wicell.org#fig2]C). For standard wild type yeast, the temperature is set to 30°C.\nSet the imaging parameters\nPlace the dish on the stage after adding immersion oil to the objective and focus a field of cells.\nCritical: If several rounds of cell division are to be recorded during time lapse imaging, start with a field with low cell density (3–5 cells/50 μm × 50 μm field).\nVisualize the signal for the fluorophore of interest. During visualization and scanning for a proper field of view, a low imaging format (512 × 512 or 1024 × 1024) can be used with a high scan speed (400 Hz or 600 Hz). Set the laser intensity and detector gain, and observe the signal.\nNote: Start scanning with low laser power (0.5%–2%) and increase further based on the signal. The laser output can vary depending on laser power and usage lifetime. Ensure that the signal is not saturated by following the image histogram to check the dynamic range. Switch to ‘Quick lookup table’ mode on Leica to highlight saturated regions. Equivalent ‘Range indicator’ is also available in Zen while using the Zeiss microscope.",
    "Critical: Ensure that the cells have adhered properly and there are no cells floating in the field of view. If the field of view is crowded with cells or cells are layered, repeat step 6d until optimum density is obtained (Compare 2B and 3A). Alternately, the cell suspension can also be diluted before placing cells for immobilization. Ensure that there is no bacterial contamination and the background should also be clear (Figures 3[href=https://www.wicell.org#fig3]B and 3C). If a lot of nonspecific signals appear, refer to troubleshooting steps Problem 1 and 2.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1438-Fig3.jpg\nFigure 3. Fields to avoid during imaging\n(A) This micrograph shows a field which is populated with too many cells. Such regions should be avoided at the start of a time course of live cell imaging. Scale-10 μm\n(B) The micrograph shows bacteria contaminating the culture. The plane shows bacterial culture in focus. Scale-5 μm\n(C) This image shows non-specific fluorescent signals due to contaminating particles in the imaging medium. Scale-5 μm\nAcquire images\nChoose the correct format and image size. Figure 4[href=https://www.wicell.org#fig4] shows how different image formats can affect the pixel size. Line averaging of 2–3 can be used with frame accumulation to improve the quality of image and signal to noise ratio (SNR). We advise using the ‘optimal’ z-step size suggested by the software based on the image format and size. This is an in-built feature on most of the commercially available microscope software. Basic settings used for image acquisition of GFP and RFP tagged proteins in S. cerevisiae at 400 Hz scan speed are mentioned hereunder:\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1438-Fig4.jpg\nFigure 4. Setting image acquisition parameters",
    "(A–C) The figure shows a comparison between three different settings for image acquisition. Pixel size can be reduced either by imaging at a higher format or increased zoom. Settings in panel A and B have the same acquisition format and speed, but the pixel size in B is smaller due to increased zoom. For the same field size in B and C, the pixel size in C is lower due to a higher imaging format (2028 × 2048 in C versus 1024 × 1024 in B).\ntable:files/protocols_protocol_1438_5.csv\nNote: Image acquisition time varies based on the requirement. Faster processes such as protein and organelle dynamics can be recorded with shorter time intervals (5–10 s), while monitoring long lived proteins and slower processes over the course of cell division will take longer time (3–5 min). Pixel size of the image should be at least 2.3 times smaller than the structure being resolved (Nyquist Sampling). This will vary based on the image resolution and size, and objective in use. For instance, pixel size of 40–50 nm is sufficient for gross morphological observation of yeast mitochondrial or nuclear morphology. However, for structures such as autophagosomes or ER-mitochondria contact sites, images with 10–20 nm pixel size should be acquired. Most of the microscope operating systems have an in-built calculator to determine the optimum sampling. Ideal sampling can also be calculated using online tools such as https://svi.nl/NyquistCalculator[href=https://svi.nl/NyquistCalculator]. Even in a xyz scan, one must select the step size determined optimally. While monitoring processes, the imaging rate should also be 2.3 times faster than the actual process. Therefore, the time interval between images should also be determined carefully. When doing longer time course imaging, under sampling is preferable to get a brighter signal and prevent photobleaching. Oversampling implies increased acquisition time, reduced signal intensity and higher photobleaching.",
    "To semi-automate the process of image acquisition, positions of multiple fields can be defined by registering the XY coordinates in the acquisition mode. The ‘Mark and Find’ function of LAS X can be used as shown in Figure 5[href=https://www.wicell.org#fig5]A. Multiple positions can be easily defined in other softwares also (locate ‘Positions’ on Multi-dimensional acquisition mode in Zen for Zeiss and ‘Process manager’ in CellSens for Olympus).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1438-Fig5.jpg\nFigure 5. Marking fields for imaging\n(A) The yellow box with a dotted line highlights the ‘Set Mark and Find’ option in the LAS X Acquire tab. Activating this opens a dialog box where stage coordinates can be seen. Multiple positions can be saved while scanning the field for regions to be imaged. Once the acquisition is started, the images corresponding to each position are saved under Mark and Field in the active project.\n(B) In order to prevent drift during longer imaging, the autofocus function can be used. A mid-focal plane can be stored as an AFC position at the start of acquisition.\nCritical: To avoid drift, activate the autofocus function (Figure 5[href=https://www.wicell.org#fig5]B). This ensures that each position is detected and imaged accurately in the selected z-axis. Also, for automated imaging it is best to store positions that are near-by. Moving too far in the field of view while navigating costs time and can result in xy-focal drift overtime.\nOnce the regions are marked and stack thickness and step size are set, begin the acquisition. A project tree is generated that stores images for each position marked.\nThe images can be exported directly to Huygens Professional for deconvolution or processed later after acquiring all the samples.\nCritical: Imaging 3–4 fields, yields sufficient cells (∼120 cells) for manual phenotypic assessment per replicate. One must image at least three biological replicates for each sample.",
    "Deconvolution and analysis of morphology parameters\nHere we describe the steps involved in deconvolving images using the deconvolution wizard of Huygens Professional version 17.04 (Scientific Volume Imaging, The Netherlands, http://svi.nl[href=http://svi.nl]). Huygens computes a theoretical PSF (point spread function) to restore the images based on the imaging parameters that include the kind of microscope and acquisition parameters (viz image size, pixel size, z-step size). Alternatively, deconvolution can also be performed using in-built deconvolution tools of respective microscope software or plugins for ImageJ/FIJI (Deconvolution, DeconvolutionLab2).\nDeconvolve the images.\nExport the images to Huygens professionals.\nThe thumbnail of exported images can be viewed in the window (Figure 6[href=https://www.wicell.org#fig6]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1438-Fig6.jpg\nFigure 6. Deconvolution using Huygens Professional\n(A) Images acquired using LAS X can be directly exported to Huygens Professional or opened using import file function. The metadata of the image is read by the deconvolution software. Features of the image in selection can be read in the tab. The arrow in A shows the Nyquist sampling parameters.\n(B) If the imaging parameters are incorrect, the deconvolution wizard shows a message indicating either oversampling or under sampling.\n(C) The two screenshots show nuclear envelope of wild type cells marked by GFP-Esc1 after and before deconvolution.\nBefore starting deconvolution, check the image quality. The Nyquist parameters can be viewed for the image under selection (arrow, Figure 6[href=https://www.wicell.org#fig6]A).\nRight click on the selected image and select deconvolution wizard. If the image acquisition parameters are not optimum, a dialog box with the issue will appear (Figure 6[href=https://www.wicell.org#fig6]B). Use another image obtained at a higher format and better resolution.",
    "The subsequent steps involve an automatic estimation of the background done using the in/near object estimation mode. GMLE (Good’s roughness Maximum Likelihood Estimation) deconvolution algorithm is used and images are deconvolved on the basis of PSF in an iterative fashion. The signal to noise ratio (SNR) can be set between 10–14 depending on the intensity of fluorophore.\nThe effect of deconvolution on NE staining using the GMLE algorithm, with SNR:12 and 10 iterations is shown in Figure 6[href=https://www.wicell.org#fig6]C.\nQuantify the morphological parameters using FIJI The nuclear morphology between strains can be compared by assessing the distribution of a nuclear envelope marker. The Circularity Index is one of the most widely quantified morphological features of the nucleus. It is calculated as: 4∗π∗area/perimeterˆ2. The steps below are a guide to measure the circularity of the nucleus. Other measurements such as perimeter, area and volume can also be extracted using this method by the Analyze tool of FIJI (Schindelin et al., 2009[href=https://www.wicell.org#bib9]).\nOpen the image file in FIJI (Figure 7[href=https://www.wicell.org#fig7]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1438-Fig7.jpg\nFigure 7. Image analysis using FIJI\n(A) FIJI toolbar with the freehand tool in selection is shown here.\n(B) The Set Measurement window showing parameters that can be measured for a selection is shown. To access this window- Click on analyze menu from the menu bar→ select Set measurement from the drop-down menu.",
    "(C) In order to get measurements for each nucleus, the objects have to be marked manually. The freehand tool is used to draw over the nuclear outline in the focal plane. The plane with maximum diameter for each nucleus can vary. The star marks the nuclei for which maximum diameter can be seen in the mentioned z-stack. For the 4 nuclei within the region marked in green box, the yellow star indicates the nucleus for which outline is marked in the indicated z-plane.\n(D) The star mark indicates the nuclei not considered for phenotype assessment in this panel showing nuclei of wild type cells.\n(E and F) After all the objects have been marked, the ROI manager shows a list of those objects. Click on Measure (Blue rectangle) and this gives a results window as shown in (F). This indicates the values of all the parameters selected in B. The values can be exported for further analysis.\n(G and H) A screenshot of cells with abnormal nuclear morphology marked for measurement.\nCritical: For comparison between two samples, images of the same format and size should be used.\nTo select the desired measurements, go to the analyze menu and select Set Measurement. Parameters of interest can be selected and used for further comparison (Figure 7[href=https://www.wicell.org#fig7]B). Select ‘Shape descriptors’ option to get circularity index.\nTrace the nuclear outline, circumscribing the Esc1-GFP signal using the free hand selection tool (Figure 7[href=https://www.wicell.org#fig7]C).\nCritical: Adjust the pixel width of the line depending on the structure that is traced. To change the thickness of the selection, select the ‘Freehand selections’ tool, go to the Edit menu, click on Options and enter the appropriate value.",
    "Note: Not all cells in the field will have the nuclei in the same plane. Therefore, the z section should be selected carefully before drawing the ROI (Region of interest) over the NE. As shown in Figure 7[href=https://www.wicell.org#fig7]C, the maximum nuclear perimeter lies in different z-planes for the indicated nuclei marked with star.\nAfter marking each nuclei, add the selection to the ROI manager (Press T or go to Edit in the menu bar → Selection→Add to Manager). Ensure that the ‘Label’ box is ticked in the ROI manager dialog box to avoid marking the same nuclei multiple times. (Figures 7[href=https://www.wicell.org#fig7]D and 7E)\nCritical: When marking the nuclei, we excluded dividing cells (red ∗ in Figure 7[href=https://www.wicell.org#fig7]D), cells with entire nucleus not covered in the stack (Magenta ∗ in Figure 7[href=https://www.wicell.org#fig7]D) or cells in the edges of field (Yellow ∗ in Figure 7[href=https://www.wicell.org#fig7]D).\nAfter completing selection of cells, click on Measure and the Results tab appears as shown in Figure 7[href=https://www.wicell.org#fig7]F. Save the table as either .csv or copy the data and import to Excel (Table S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1438-Mmc1.xlsx]: Tab1-Circularity index)",
    "Analysis using ER membrane marker: Similar analysis can also be performed to quantify the differences in the distribution of ER localized proteins. An example of this is presented in Figure 8[href=https://www.wicell.org#fig8]. Here we compare the differences in ER architecture between wild type (Figure 8[href=https://www.wicell.org#fig8]A, left) and Δyop1 (Figure 8[href=https://www.wicell.org#fig8]A, right). Yop1 is an ER protein involved in tubule formation. Since the perinuclear ER (pER) outlines the NE, circularity of the pER can be measured to represent phenotypic variations between samples (Figure 8[href=https://www.wicell.org#fig8]B). The distribution of the marker protein along peripheral or cortical ER (cER) can also be determined similarly by selecting a ROI using freehand tool (Figure 8[href=https://www.wicell.org#fig8]C, Table S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1438-Mmc1.xlsx]: Tab2-Plot profile). To compare differences in distribution of protein between pER and cER a line profile of fluorescence intensity can be plotted by drawing a line across the cell using ‘Line Tool’ as shown in Figures 8[href=https://www.wicell.org#fig8]D and 8E. Such line profiles for multiple ROIs can be extracted from the ROI manager by clicking on More, followed by Multi Plot (Figure 7[href=https://www.wicell.org#fig7]E, magenta outline). The intensity based differences can be further quantified as aggregation index (Lord and Wente, 2020[href=https://www.wicell.org#bib5]; Deolal et al., 2021[href=https://www.wicell.org#bib1]) or a function of variation in intensity along the ROI (Schuck et al., 2009[href=https://www.wicell.org#bib10]). Intensity profiles from at least 10 to 15 cells from 3 independent experiments should be compared to derive inferences on phenotype.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1438-Fig8.jpg\nFigure 8. Analyzing ER morphology\n(A) The image shows ER morphology as marked by Scs2-GFP for wild type (left) and yop1Δ (right). The abnormalities observed in yop1Δ are marked by yellow arrows.\n(B) The screenshot shows selection (yellow outline) of the perinuclear ER for wild type (left) and Δyop1Δ (right) using the freehand tool. The circularity index (CI) varies between the two samples, indicative of the phenotype.",
    "(C) The screenshot shows selection (yellow outline) of the cortical ER for wild type (left) and yop1Δ (right) using the freehand tool.\n(D) The screenshot shows the line (yellow line) drawn across the wild type (left) and yop1Δ (right) cell drawn using the line tool.\n(E) The intensity profile for the ROI can be obtained by selecting the ‘Plot profile’ option from the ‘Analyze’ menu as shown in the screenshot. This gives a plot as shown on the right. Click on ‘Data’ and then copy all data to excel for analysis. The data can also be saved as a .csv file by clicking on ‘Save Data’ option (Blue arrow).\nAlternatives: Nuclear shape can also be determined by marking nuclei with a fluorescently tagged nucleoplasmic protein or a nuclear dye. In such cases, nuclear ROI can be selected by intensity-based thresholding. ImageJ plugin ‘3D objects counter’ can be used to semi-automate the process. In such cases, it is important to ensure that the NE deformation is accompanied by nucleoplasmic deformation (Figure 9[href=https://www.wicell.org#fig9]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1438-Fig9.jpg\nFigure 9. Analysis and quantification\n(A) The cartoon represents expected outcome when calculating circularity index of nuclei using a NE marker (green). The circularity index of nuclei reduces as the deformities increase. For most spindle shaped or bilobed nuclei, the circularity index value lies close to 0.5 if derived by tracing NE outline.\n(B) The box and whisker plot shows a comparison of the circularity index between wild type and ssf1Δ cells. Horizontal line at the center represents the median (Table S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1438-Mmc1.xlsx]: Tab1-Circularity index). The narrow range of distribution for wild type shows that most of the cells display a round nuclear morphology unlike the abnormal shapes seen in ssf1Δ.",
    "(C) The plot shows the intensity-based profile for WT and yop1Δ as marked in Figure 8[href=https://www.wicell.org#fig8]D (Table S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1438-Mmc1.xlsx]:Tab3-Line profile). The localization density of Scs2-GFP spans a broader area representative of the perinuclear ER extension for yop1Δ as shown in Figure 8[href=https://www.wicell.org#fig8]D, right."
  ],
  "subjectAreas": [
    "Microscopy",
    "Cell Biology",
    "Microbiology",
    "Genetics",
    "Model Organisms"
  ],
  "bigAreas": [
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}