{
  "id": 1882,
  "origin_website": "Cell",
  "title": "Mechanical spinal cord transection in larval zebrafish and subsequent whole-mount histological processing",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nTransection of the larval zebrafish spinal cord\nTiming: 1 h\nThis protocol describes two methods for the mechanical transection of the larval zebrafish spinal cord: perforation lesion and incision lesion. Perforation lesions leave the dorsal edge of the larval trunk intact and may be more suitable for downstream histological processing than incision lesions. Incision lesions result in clean lesion edges and less tissue perturbation, which may be beneficial for live imaging. To prevent notochord damage and ensure the complete transection of the spinal cord, surgeries are performed under visual control at high magnification using a stereo microscope (Figure 1[href=https://www.wicell.org#fig1]D). The relevant anatomical structures of a 3 dpf zebrafish larva are indicated in Figure 2[href=https://www.wicell.org#fig2]A.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1362-Fig2.jpg\nFigure 2. Mechanical spinal cord transection in larval zebrafish\n(A) Lateral view of a Tg(her4.3:EGFP) transgenic zebrafish larva at 3 dpf, labeling ependymoradial glia cells (astroglia-like cells) in the spinal cord with GFP protein (green). Anatomical structures relevant for the described protocol are indicated. Abbreviations: de, dorsal edge; nc, notochord; sc, spinal cord; urp, urogenital pore.\n(B) Larvae placed in lateral position on the surgery plate in preparation for perforation lesion.\n(C) Perforation lesion procedure to transect the larval zebrafish spinal cord. Images shown are single frames of the Methods video S1[href=https://www.wicell.org#mmc1]. Lateral view; dorsal is left. Abbreviations: D, dorsal; V, ventral.\n(D) Representative image of a perforation lesion immediately after injury. Note that the dorsal edge of the trunk remains intact. Lateral view; rostral is left, dorsal is up.\n(E) Larvae placed in lateral position on the surgery plate in preparation for incision lesion.\n(F) Incision lesion procedure to transect the larval zebrafish spinal cord. Images shown are single frames of the Methods video S2[href=https://www.wicell.org#mmc2]. Lateral view; dorsal is right. Abbreviations: D, dorsal; V, ventral.",
    "(G) Representative image of an incision lesion immediately after injury. Note that the notochord is left intact. Lateral view; rostral is left, dorsal is up.\n(H) Extensive injury to the notochord following an incision lesion leads to the formation of a bulgy tissue structure (arrowhead). Lateral view; rostral is left.\n(A–H) Scale bars: 500 μm (B, E), 200 μm (A, C, F), 100 μm (D, G, H)\nAnesthetize zebrafish larvae (3 dpf) in E3 medium containing 0.02% Ethyl 3-aminobenzoate methanesulfonate (MS-222/Tricaine). Larvae are sufficiently anesthetized when no response to touch can be observed.\nPrepare a recovery dish containing E3 medium without MS-222.\nNote: To suppress hyperpigmentation of the wound, add PTU to the E3 medium (before you begin[href=https://www.wicell.org#before-you-begin] step 1).\nPerforation lesion:\nTransfer anesthetized larvae to the surgery plate (agarose-coated petri dish; Figure 1[href=https://www.wicell.org#fig1]A) using a transfer pipette.\nRemove excess E3 medium using an aspiration pipette (Figure 1[href=https://www.wicell.org#fig1]E). The trunks of the larvae will settle into a lateral position (Figure 2[href=https://www.wicell.org#fig2]B).\nApproach the larva with the micro scalpel (Figure 1[href=https://www.wicell.org#fig1]C) from the ventral side, at the level of the urogenital pore. The needle bevel should be facing up (towards the dorsal side of the larva). Push the tip of the needle through the trunk immediately dorsal to the notochord to transect the spinal cord (Figures 2[href=https://www.wicell.org#fig2]C and 2D, Methods video S1[href=https://www.wicell.org#mmc1]). Take care not to injure the notochord.\nNote: Usually, the spinal cord should be transected after a single perforation. However, untrained experimenters may require several repetitions of step 3c. For training purposes, we recommend the use of transgenic reporter lines that fluorescently label the spinal cord (before you begin[href=https://www.wicell.org#before-you-begin] step 1), which enables visual verification of complete transection using a fluorescence stereo microscope.",
    "Gently flush lesioned larvae off the surgery plate into the recovery dish using a transfer pipette filled with E3 medium.\nNote: Steps 3a to 3d require approximately 10–20 s per larva.\nKeep lesioned larvae in a 28.5°C incubator for recovery.\nRemove sick and dead larvae on the same day and subsequently check lesioned larvae daily.\nIncision lesion:\nTransfer anesthetized larvae to the surgery plate (roughened surface of a sealed plastic petri dish; Figure 1[href=https://www.wicell.org#fig1]B) using a transfer pipette.\nRemove excess E3 medium using an aspiration pipette (Figure 1[href=https://www.wicell.org#fig1]E). The trunks of the larvae will settle into a lateral position (Figure 2[href=https://www.wicell.org#fig2]E).\nApproach the larva with the micro scalpel (Figure 1[href=https://www.wicell.org#fig1]C) from the dorsal side, at the level of the urogenital pore. The needle bevel should be facing sideways. Induce an incision into the dorsal trunk spanning from the notochord to the dorsal edge (Figures 2[href=https://www.wicell.org#fig2]F and 2G, Methods video S2[href=https://www.wicell.org#mmc2]). Take care not to injure the notochord.\nCritical: Larvae that undergo excessive damage to the notochord typically show the formation of a bulging tissue structure within hours after surgery, which can be of varying size and is highly inhibitory to regeneration (Figure 2[href=https://www.wicell.org#fig2]H; arrowhead). Those animals should be excluded from further analysis and terminally anesthetized by adding an overdose of MS-222 to the E3 medium (final concentration of ≥ 0.1%).\nGently flush lesioned larvae off the surgery plate into the recovery dish, using a transfer pipette filled with E3 medium.\nNote: Steps 4a–4d require approximately 10–20 s per larva.\nKeep lesioned larvae in a 28.5°C incubator for recovery.\nRemove sick and dead larvae on the same day and subsequently check lesioned larvae daily.",
    "Critical: Avoid desiccation of the larvae as this will result in exacerbated tissue damage and high mortality rates (Problem 2). Ensure that a sufficient volume of E3 medium is left on the surgery plate.\n    Your browser does not support HTML5 video.\n  \nMethods video S1. Perforation lesion procedure to transect the larval zebrafish spinal cord, related to Step-by-step method details Step 3 and Figure 2C\nScale bar: 100 μm\n    Your browser does not support HTML5 video.\n  \nMethods video S2. Incision lesion procedure to transect the larval zebrafish spinal cord, related to Step-by-step method details Step 4 and Figure 2F\nScale bar: 100 μm\nWhole-mount in situ hybridization\nTiming: 3–4 days\nThe following protocol describes in situ hybridization (ISH) to detect specific mRNAs in whole-mount zebrafish larvae. After spinal cord lesion (0–2 days post-lesion; dpl), zebrafish larvae are fixed with paraformaldehyde (PFA) to prepare them for labeling. Fixed larvae are permeabilized and incubated with the labeled antisense RNA probe (before you begin[href=https://www.wicell.org#before-you-begin] steps 6 and 7) which hybridize to their complementary mRNA sequence in cells expressing the corresponding gene. RNA hybrids are visualized using immunohistochemistry (Figure 3[href=https://www.wicell.org#fig3]). The step-by-step details are described in this section. Note that the protocol provides efficient probe penetration in whole-mount 5 dpf zebrafish larvae as previously reported (Wehner et al., 2017[href=https://www.wicell.org#bib19]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1362-Fig3.jpg\nFigure 3. Representative examples of whole-mount ISH in spinal cord lesioned larval zebrafish",
    "(A and B) ISH reveals local upregulation of col12a1a expression in the lesion site at 1 dpl (perforation lesion) as compared to adjacent unlesioned trunk tissue. col12a1a mRNA expression was visualized using either NBT/BCIP substrate (A; blue) or Fast Red substrate (B; red). Note that PTU was used to suppress developmental and lesion-induced pigmentation in (A) while the larva in (B) was untreated. Images shown are brightfield recordings (A) or a maximum intensity projection of a confocal image (B) of the lesion site (lateral view; rostral is left, dorsal is up). Abbreviation: BF, brightfield. Scale bars: 50 μm.\nUnless stated otherwise, perform all incubations at room temperature (RT; 20°C–22°C) without agitation and use a vacuum pump to draw media. Take care not to aspirate larvae. Small volumes can be aspirated using a fine hypodermic needle (≤ 27 G × ¾”) attached to the vacuum pump. The volume of the solutions should always be sufficient to cover the larvae. Unless stated otherwise, we recommend using 2 mL solution per tissue condition.\nTerminally anesthetize larvae by adding an overdose of MS-222 to the E3 medium (final concentration of ≥ 0.1%).\nTransfer larvae to a 2 mL reaction tube using a transfer pipette.\nCritical: Use 2 mL reaction tubes to allow for sufficient washing volumes.\nFix larvae in 4% PFA at 4°C for 14–18 h. Place reaction tubes in a tube rack tilted by 90°.\nWash larvae 2× in PBST for 1 min each.\nDehydrate larvae stepwise by successive incubation in 25% MeOH-PBST, 50% MeOH-PBST, 75% MeOH-PBST, and 100% MeOH for 5 min each.\nNote: Samples can be stored in 100% MeOH at −20°C for several months.",
    "Critical: MeOH is acutely toxic and flammable. It damages organs when in direct contact, if swallowed or inhaled. Wear protective gloves, protective clothing, eye, and face protection.\nRehydrate samples stepwise by successive incubation in 75% MeOH-PBST, 50% MeOH-PBST, 25% MeOH-PBST, and PBST for 5 min each.\nWash larvae 2× in PBST for 1 min each.\nFor permeabilization, incubate larvae in PBST containing 40 μg/mL Proteinase K for 30 min. Place reaction tubes in a tube rack tilted by 90°.\nCritical: Due to batch-to-batch variations of Proteinase K activity, its concentration and incubation time need to be tested and adjusted for each batch to avoid over or under digestion of the samples. As a starting point, we recommend 40 μg/mL for 30 min to permeabilize 3–5 dpf (0–2 dpl) zebrafish.\nStop the Proteinase K digestion by washing larvae 2× in PBST for ≤1 min each.\nRe-fix larvae by incubation in 4% PFA for 15 min.\nNote: Do not fix longer than 15 min, otherwise hybridization efficiency may be suboptimal.\nWash larvae 5× in PBST for ≤1 min each.\nFor prehybridization, incubate larvae in hybridization buffer (preheated to 66°C) for a minimum of 1 h at 66°C in a water bath. This step can be extended up to several hours.\nIn the meantime, prepare hybridization mixes (1 mL hybridization buffer + 5 μL RNA probe stock solution for a 1:200 dilution) in 2 mL reaction tubes.\nNote: Optimal concentration of the RNA probe needs to be determined. As a starting point, we recommend a 1:200 dilution of the stock solution (before you begin[href=https://www.wicell.org#before-you-begin] step 7i).\nPreheat the hybridization mix to 66°C for 10 min on a thermomixer under vigorous shaking at ∼900 rpm.",
    "Aspirate media and add 1 mL of preheated hybridization mix to each reaction tube. Hybridize at 66°C in a water bath for 14–18 h.\nFor the following washing steps, buffers should always be preheated in a water bath to hybridization temperature (66°C). The reaction tubes with the hybridized larvae should only be briefly taken out of the water bath for aspiration of solutions to avoid significant temperature drops.\nWashing:\nAspirate the hybridization mix and wash samples in hybridization buffer for 20 min.\nNote: When stored at −20°C, RNA probes can be reused several times before the signal of the staining reaction weakens (step 26). We typically reuse RNA probes twice.\nFreshly prepare the SSCT/formamide mixture and wash larvae 3× at 66°C for 20 min each.\nWash 2× in 2× SSCT buffer at 66°C for 20 min each.\nWash 4× in 0.2× SSCT buffer at 66°C for 30 min each.\nCritical: This is the most stringent washing step and washing time should not be extended.\nWash 2× in PBST for ≤1 min each.\nNote: This, and all following steps, are again carried out at RT without agitation unless stated otherwise.\nIncubate larvae in blocking solution for at least 1 h. Place the tubes on a see-saw rocking shaker with low agitation at ∼10 rpm.\nDilute anti-digoxigenin-alkaline phosphatase antibody (anti-digoxigenin-AP) 1:3000 in blocking solution.\nNote: This protocol describes the use of digoxigenin-labeled RNA probes, but can be also applied for fluorescein-labeled RNA probes. If fluorescein-labeled probes are used, apply appropriate antibody (anti-fluorescein-AP) and keep samples in the dark.\nIncubate larvae in ≥ 1 mL antibody solution at 4°C for 14–18 h. Keep tubes in a 90° tilted tube rack, optionally on a see-saw rocking shaker with low agitation at ∼10 rpm.",
    "Critical: Ensure that the larvae are fully immersed in antibody solution at all times.\nWash on a see-saw rocking shaker with low agitation at ∼10 rpm:\n2× in PBST for 1 min each.\n6× in PBST for 20 min each.\nNote: Recover the antibody solution; it can be reused several times when stored at 4°C. For storage, add sodium azide at a final concentration of 0.02% (3 mM) to prevent microbial growth.\nFreshly prepare NTMT staining buffer. Wash larvae in NTMT staining buffer 2× for 5 min each to replace PBST and increase the pH to 9.0–9.5.\nNote: The alkaline phosphatase (AP) enzyme is most stable between pH 7.5–9.5, with pH 9.0 being optimal.\nStaining reaction: The anti-digoxigenin antibody is conjugated to AP, which catalyzes chromogenic reactions. Various AP substrates, which yield different colors can be used, such as nitro blue tetrazolium (NBT)/5-bromo-4-chloro-3-indolyl-phosphate (BCIP) and BM-Purple to obtain blue color, 2-(4-iodophenyl)-5-(4-nitrophenyl)-3-phenyltetrazolium chloride (INT)/BCIP for brown color and Fast Red for a red precipitate which is also fluorescent in the red spectrum.\nDissolve one NBT/BCIP Ready-to-Use Tablet in 10 mL ddH2O, mix, and replace NTMT buffer with 1 mL staining solution to initiate the chromogenic reaction.\nNote: If AP substrates other than specified are used, prepare staining solution according to the manufacturer’s instructions or dilute the substrate in NTMT buffer to ensure that both pH and salt concentrations are optimal for the AP enzyme.\nDecant reaction tubes containing staining solution and larvae into a 12-well plate.\nIncubate larvae in the dark.\nNote: The staining reaction should be monitored every 15–30 min using a stereo microscope (Figure 1[href=https://www.wicell.org#fig1]D) to prevent overstaining. If no background signal develops, the staining procedure can be continued for several days. In that case, renew staining solution daily.",
    "Stop the staining reaction by washing larvae 2× in PBST for 1 min each.\nNote: Larvae can be stored in PBST for several days to weeks at 4°C.\nOptional: When NBT/BCIP or BM-Purple substrates are used, background staining can be removed by clearing larvae in EtOH. Note that this needs to be done soon after the termination of the staining reaction as after some days the background precipitate cannot be efficiently dissolved.\nNote: NBT/BCIP and BM-Purple result in an insoluble blue precipitate. In these cases, clearing with EtOH is recommended. However, Fast Red and INT/BCIP stains are soluble in EtOH and the background cannot be cleared.\nWash in 50% EtOH-PBST for 5 min.\nIncubate larvae 2× in 100% EtOH for 5–15 min each.\nWash in 50% EtOH-PBST for 5 min.\nWash 4× in PBST for 5 min each.\nNote: Larvae can be stored in PBST or 75% glycerol for several days at 4°C.\nDecapitate larvae and mount trunks in 75% glycerol on a microscope slide. Cover samples with a coverslip and seal with transparent nail polish.\nNote: Decapitation facilitates the lateral positioning and alignment of the larval zebrafish trunks.\nImage larvae with a stereo microscope or laser scanning confocal microscope for Fast Red-stained samples.\nNote: Fast Red produces a fluorescent red precipitate with an excitation peak at 560 nm and an emission peak at 635 nm.\nWhole-mount immunohistochemistry\nTiming: 6 days",
    "The following protocol describes immunohistochemistry (IHC) to detect specific proteins in whole-mount zebrafish larvae, such as acetylated tubulin to label neurites. After spinal cord lesion (0–2 dpl), zebrafish larvae are fixed with PFA to prepare them for labeling. Fixed larvae are permeabilized and probed with antibodies of interest. This protocol enables efficient antibody penetration which can detect proteins located as deeply as in the spinal cord of 5 dpf (2 dpl) larvae and which is also sufficiently sensitive for the simultaneous detection of extracellular matrix (ECM) proteins (Figure 4[href=https://www.wicell.org#fig4]B–C) (Wehner et al., 2017[href=https://www.wicell.org#bib19]; Tsata et al., 2021[href=https://www.wicell.org#bib15]). Another advantage of this protocol is that it preserves the signal of fluorescent proteins of reporter transgenes (Figure 4[href=https://www.wicell.org#fig4]D).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1362-Fig4.jpg\nFigure 4. Representative examples of whole-mount IHC in larval zebrafish\n(A) Co-labeling of neurites (anti-acetylated tubulin; red) and astroglia-like processes (anti-GFAP; green) in the spinal cord of unlesioned larvae (top panel), immediately after incision lesion (middle panel) and at 2 dpl (bottom panel). Continuity of axonal labeling between rostral and caudal spinal cord stumps is restored within 2 dpl (bottom panel).\n(B) Co-labeling of neurites (anti-acetylated tubulin; red) and fibronectin matrix (anti-Fibronectin; green) in the lesion site at 1 dpl (perforation lesion).\n(C) Labeling of lesion-induced collagen type XII matrix deposition at 2 dpl (perforation lesion).\n(D) Labeling of neurites with anti-acetylated tubulin immunohistochemistry (red) preserves the GFP signal of the GFP reporter in Tg(pdgfrb:Gal4ff;UAS:EGFP) transgenic animals. GFP+ cells accumulate in the lesion site at 1 dpl (perforation lesion).\n(A–D) Images shown are maximum intensity projections of the unlesioned trunk or the lesion site at indicated timepoints after lesion (lateral view; rostral is left, dorsal is up). Scale bars: 50 μm (C) and 25 μm (A, B, D).",
    "Unless stated otherwise, all steps are carried out at RT. Media are drawn with a vacuum pump. Care should be taken not to aspirate tissue samples. Small volumes can be aspirated using a fine hypodermic needle (≤ 27 G × ¾”) attached to the vacuum pump.\nCritical: For all incubation steps ≥ 10 min, samples are placed in a tube rack tilted by 90°. To ensure that exact incubation times are met, set the tubes upright about 1 min before the end of the incubation period to allow samples to sink to the bottom of the tube. Gently tap the tubes to ensure that there are no samples floating on the surface before aspirating the supernatant.\nTerminally anesthetize larvae by adding an overdose of MS-222 to E3 medium (final concentration of ≥ 0.1%).\nTransfer larvae to a 2 mL reaction tube using a transfer pipette.\nFix larvae in 4% PFA for exactly 1 h.\nCritical: Do not fix longer than 1 h, otherwise antibody penetration may be impaired.\nWash 2× in PBST for 1 min each.\nDehydrate larvae stepwise by successive incubation in 25% MeOH-PBST, 50% MeOH-PBST, 75% MeOH-PBST and 100% MeOH for 5 min each.\nNote: Samples can be stored in 100% MeOH at −20°C for several months.\nCritical: Methanol is acutely toxic and flammable. It causes damage to organs in direct contact, or if swallowed or inhaled. Wear protective gloves, protective clothing, eye and face protection.\nTransfer larvae to a plastic petri dish (35 mm in diameter) filled with 100% MeOH. Remove heads and tails using micro scissors under visual control (stereo microscope). This will improve penetration of the antibodies.",
    "Transfer the trunk tissue containing the lesion site to a new 1.5 mL reaction tube using a glass Pasteur pipette with rubber bulb and incubate samples in 100% MeOH at −20°C for 14–18 h.\nStepwise rehydrate samples by successive incubation in 75% MeOH-PBST, 50% MeOH-PBST, 25% MeOH-PBST and PBST for 5 min each.\nWash 2× in ddH2O for 5 min each.\nCritical: Remove as much ddH2O as possible to avoid dilution of acetone in the next step.\nFor permeabilization, incubate samples in 100% acetone (pre-chilled to −20°C) at −20°C for exactly 10 min.\nAspirate acetone and wash samples in ddH2O for 5 min.\nCritical: Remove as much acetone as possible to reduce the sticking of tissue to the reaction tube wall in the following steps.\nWash 2× in PBST for 5 min each.\nCritical: Samples will stick to the tube wall. To avoid sample loss, aspirate the supernatant using a transfer pipette pre-coated with PBST. Discard the supernatant into 50 mL conical centrifuge tubes filled with PBST. Accidentally-withdrawn samples can thereby be collected and returned to the reaction tube.\nFor further permeabilization, incubate samples in PBST containing 5–7.5 μg/mL Proteinase K for 15 min.\nCritical: Due to batch-to-batch variations of Proteinase K activity, its concentration and incubation time needs to be tested and adjusted for each batch to avoid over or under digestion of the samples. As a starting point, we recommend 15 min incubation of 5 μg/mL or 7.5 μg/mL to permeabilize 3–4 dpf (0–1 dpl) or 5 dpf (2 dpl) zebrafish larvae, respectively.\nWash samples 2× in PBST for ≤1 min each.\nRe-fix samples by incubating in 4% PFA for exactly 15 min.\nCritical: Over fixation may mask epitopes and/or reduce antibody penetration.",
    "Wash samples 3× in PBTx for 10 min each on a see-saw rocking shaker with low agitation at ∼10 rpm.\nIncubate in IHC blocking solution for a minimum of 1 h on a see-saw rocking shaker with low agitation at ∼10 rpm.\nIncubate in IHC blocking solution containing primary antibody at 4°C for ≥ 3 nights on a see-saw rocking shaker with low agitation at ∼10 rpm.\nNote: The working dilution needs to be determined for each antibody. We routinely use antibodies to detect endogenous proteins at a dilution of 1:300. See Table 2[href=https://www.wicell.org#tbl2] for a list of primary antibodies that have been successfully used with the described protocol.\nTo remove unbound antibody, wash samples 8× in PBTx for 15 min each on a see-saw rocking shaker with low agitation at ∼10 rpm.\nIncubate in IHC blocking solution containing appropriate fluorescent secondary antibody at 4°C for 2 nights on a see-saw rocking shaker with low agitation at ∼10 rpm.\nNote: Protect the samples from light in subsequent steps.\nTo remove unbound antibody, wash 6× in PBTx for 10 min each on a see-saw rocking shaker with low agitation at ∼10 rpm.\nWash samples 2× in PBS for 1 min each to dilute PBTx.\nMount larvae in 75% glycerol or commercially available antifade mounts on a microscope slide, cover with a cover slip, and seal with transparent nail polish.\nImage samples with a laser scanning confocal microscope for high resolution.\ntable:files/protocols_protocol_1362_18.csv"
  ],
  "subjectAreas": [
    "Neuroscience",
    "Microscopy",
    "Model Organisms",
    "Developmental Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}