{
  "id": 13843,
  "origin_website": "Jove",
  "title": "The Use of the Puzzle Box as a Means of Assessing the Efficacy of Environmental Enrichment",
  "procedures": [
    "Ethics statement: All procedures were approved by the Animal Ethics Committee of the University of Sydney and conformed to National Health and Medical Research Council of Australia guidelines. Procedures were performed on C57/BL6J mice which were reared at the University of Sydney Bosch Rodent Facility. All mice were housed in a single adequately-ventilated room in 21 °C ambient temperature on a 12 hr light-dark cycle with lights on at 0600 hr in individually ventilated cages with ad libitum access to dry food and water. Late-pregnancy females were randomly assigned to standard or environmentally enriched housing conditions.\n1. Housing (Enrichment Levels):\nObtain 4 late-pregnancy adult female mice. Randomly assign 2 to the standard condition and place each of them into a clean standard mouse cage (overall dimensions 391 x 199 x 160 mm) containing one red mouse igloo. For the enriched condition, place the remaining 2 mice into a single clean rat-sized cage (overall dimensions 462 x 403 x 404 mm).\nInto the enrichment cage, place a variety of objects designed to increase sensory and motor stimulation (e.g. running wheels, visual stimuli, scented cotton balls, Velcro strips).\nEvery 2 to 3 days move these objects about within the cage; refresh any that have been destroyed.\nUpon weaning at 21 days postnatal, sex animals and place into male-female segregated housing consistent with the environmental condition they were raised. For the enriched condition ensure that there are between 3 and 10 mice per cage with 2 and 5 mice for standard. Commence behavioral testing once animals reach adulthood (12–14 weeks of age).\n2. Construction of the Puzzle Box\nObtain 6 pieces of white acrylic (or other non-porous material): one 750 x 280 mm, two 280 x 250 mm, two 750 x 250 mm, and one 150 x 280 mm (see Figure 1).",
    "Obtain one piece of black acrylic 280 x 250 mm, with a 40 x 40 mm square opening cut into one side of this piece (see Figure 1).\nAssemble the Puzzle Box as follows: use the 750 x 280 mm piece as the bottom of the box, use 280 x 250 mm pieces as the ends of the box, and the 750 x 250 mm pieces as the sides of the box.\nMeasure 150 mm into the box from one end, and place the black piece of acrylic across the box so that it splits it into two compartments (one large, one small) with the opening flush with the bottom of the box.\nTake the 150 x 280 mm piece of white acrylic and place it atop the smaller compartment of the box making sure it covers this area completely, providing a dark “goal-box” chamber. Affix this piece of acrylic to the body of the main box by hinges, or leave free to be completely removed during behavioral testing.\nTake 3 pieces of acrylic (three 4 x 120 mm) and join to make a “u-shaped” channel.\nimgsrc://cloudfront.jove.com/files/ftp_upload/52225/52225fig1highres.jpg\nFigure 1: Schematic diagram of the Puzzle Box task. The Puzzle Box is an acrylic box consisting of an open-field area (600 x 280 mm) and a sheltered goal-box area (150 x 280 mm), measuring 750 x 280 mm in all. A 40 x 40 mm opening within the partition (grey) separating the two areas allows animals to access to the covered goal-box area from the open field. This opening is blocked with obstructions that are increasingly difficult to remove as testing progresses. Animals undergo a five-day protocol, consisting of four obstruction conditions with three trials for each condition.\n3. Running of the Puzzle Box Task",
    "Thoroughly clean the Puzzle Box with 70% alcohol. Repeat this step between each animal tested.\nPlace a clean red mouse igloo within the goal-box area of the Puzzle Box, and replace the lid on the goal-box.\nIf there is an obstruction condition being tested, place the obstruction within the doorway of the goal-box (see Figure 2).\nPlace the mouse being tested into the open-field section of the Puzzle Box, oriented towards the goal-box, and at the end furthest from the goal-box.\nRecord the time taken for all four paws of the animal to enter the goal-box section of the Puzzle Box.\nIf an animal does not enter the goal-box, terminate the trial once the set time limit is reached (see Table 1).\nOnce a trial is finished, remove the animal from the Puzzle Box and place it into a separate holding cage until the next trial begins. Keep a 60 to 180 sec gap between trials for each animal.\nFor each animal, perform three trials per day for five consecutive days of testing, with four obstruction conditions and three trials of each condition. The third trial of a given obstruction condition should always administered on a subsequent day (see Table 1).\nimgsrc://cloudfront.jove.com/files/ftp_upload/52225/52225table1.jpg\nTable 1: Scheme of the Puzzle Box task. The Puzzle Box task is run for five days, and consists of four obstruction conditions. There are three trials on each of the first four days, and one on the fifth day. Each obstruction condition has three trials; the first two on one day, and the third the day immediately following. The first trial of an obstruction condition aims to test native problem-solving ability, the second trial examines task acquisition and reinforcement, and the third trial is used as an assay for solution retention and recall.\nimgsrc://cloudfront.jove.com/files/ftp_upload/52225/52225fig2highres.jpg",
    "Figure 2: Obstruction conditions within the Puzzle Box task. Schematic diagrams of the Puzzle Box arena and the obstruction conditions used within this study. (A) Condition 0 (C0), with no obstruction present within the doorway between the open-field and goal-box areas. (B) Condition 1 (C1), with a “u shaped” channel present within the doorway between the open-field and goal-box areas. (C) Condition 2 (C2), where the channel is filled with clean bedding material. (D) Condition 3 (C3), with a “tissue plug” present within the doorway between the open-field and goal-box areas. (E) Condition 4 (C4) with a “foam plug” present within the doorway between the open-field and goal-box areas. Dimensions of the arena are as per listed in Methods and Figure 1.\n4. Interpretation of Data\nRepresent data as either time taken to complete the trial (including null trials where animals did not complete the task within the specified time limit) or as the number of null trials.\nUse a repeated measures ANOVA to assess the effect of housing condition upon performance within the Puzzle Box, with obstruction type/condition (C) and task number (T) within-subjects factors and enrichment level (standard versus enriched) as between-subjects factor.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}