{
  "id": 18532,
  "origin_website": "Jove",
  "title": "Modeling Encephalopathy of Prematurity Using Prenatal Hypoxia-ischemia with Intra-amniotic Lipopolysaccharide in Rats",
  "procedures": [
    "Institutional Care and Use Committees at both Boston Children’s Hospital and the University of New Mexico Health Sciences Center approved all experimental procedures.\nNOTE: Prior to commencing the procedure, seal, sterilize and autoclave all surgical instruments and surgical drapes. Additionally, prepare post-operative medications in sterile vials including 0.125% bipivucaine and 0.1 mg/kg buprenorphine. Also prepare the lipopolysaccharide (LPS) solution sterilely: 0.04 mg/ml LPS (0111:B4) in sterile saline containing dilute Evan’s blue dye.\n1. Anesthesia\nInduce anesthesia in an embryonic day 18 (E18) pregnant Sprague Dawley rat with a mixture of 3% isoflurane balanced 70% nitrogen and 30% oxygen.\nRemove rat from the induction chamber and place the rat supine on draped surgical circulating water blanket set at 37 °C. Transfer anesthesia to nose cone and reduce isoflurane level to 2%.\nGently apply ophthalmic ointment to each eye to prevent corneal drying. During the procedure continually monitor temperature, respiration rate and heart rate of the animal. Maternal physiology should remain stable throughout the procedure.\n2. Surgical Prep and Scrub\nUsing small animal clippers remove all hair in the lower abdominal region. Shave in a rectangular pattern with care to avoid nicking the nipples or generating razor rash that can be irritating for future nursing of live born pups.\nPrepare abdominal skin by alternating application of povidone-iodine and 70% ethanol scrub with sterile cotton swabs. Repeat the scrub such that povidone-iodine and 70% ethanol are each applied 3x in alternating fashion. Let dry.\nConfirm depth of anesthesia via absence of toe-pinch reflex. In the absence of reflex and stimuli to pain, reduce isoflurane level to 1%.",
    "Using sterile surgical towels, drape the animal. Take care to place the drapes at an appropriate angle such that they maximize the amount of irrigation fluid they absorb whilst not obstructing blood flow to the uterine horns.\n3. Abdominal Laparotomy\nUsing a scalpel make a 3 cm midline incision in the prepared abdominal skin. Bluntly dissect the skin layer from the abdominal fascia with scissors. Using forceps and surgical scissors, elevate the abdominal fascial layer and make an incision of the avascular linea alba to gain access to the peritoneal cavity.\nPlace surgical gauze on the exterior of the incision and moisten with sterile saline. Using blunt forceps and external pressure on the abdomen, gently remove the uterine horns from the peritoneal cavity and arrange on the moistened gauze.\nCarefully avoid entanglement and contact with intestines. Arrange fetuses using forceps by contacting only the muscular tissue in between individual amniotic sacs. Expose and isolate the 4 uterine arteries using blunt dissection.\n\tNOTE: Care must be taken to dissect the uterine arteries. Surrounding tissue and vessels themselves are extremely delicate. Damage to maternal vessels can cause bleeding, and in severe cases, fetal and maternal death.\n4. Placement of Aneurysm Clips\nPlace a rat 30 G aneurysm clip on each uterine artery. Ensure cessation of blood flow, including proximal and distal pulses, and darkening of the uterine vessels including individual placentas. Cover the exposed horns and entire surgical field with gauze and irrigate with sterile saline. Take care to keep the field moist with irrigation approximately every 10 min.",
    "After 60 min, remove the gauze and irrigate the field. Ensure that the uterine horns and vessels are adequately moistened for successful clip removal. Gently remove each aneurysm clip using forceps. Take care not to cause trauma to the vessel, and maintain tissue integrity during removal.\nThoroughly irrigate the uterine horns and field, taking care to remove any stray threads of gauze from the amniotic sacs.\n5. Injection of Lipopolysaccharide in to Amniotic Sacs\nAt the base of each individual amniotic sac, just anterior to the placental plate, inject 100 µl of LPS (4 µg/sac) with diluted Evan’s blue dye in to the amniotic fluid. Use blunt forceps to stabilize and rotate each amniotic sac in to an optimal position for injection. Dilute Evan’s blue dye is a contrast agent that is helpful in confirming proper syringe placement and injection.\n\tNOTE: Use only an ultra-fine 0.3 ml insulin syringe with attached 8 mm 31 G needle for the intra-amniotic injections. Using larger gauge needles will result in chronic amniotic fluid loss, fetal death and reabsorption of the pregnancy. Small amounts of amniotic fluid leakage upon removal of the syringe can be mitigated by direct pressure to the amniotic sac. Some rat fetuses may tolerate a degree of oligohydramnios. However, acute amniotic fluid loss from puncture with large gauge needles, or accidental puncture resulting in chronic fluid leakage, results in fetal loss and in severe cases, loss of neighboring pregnancies.\nIrrigate the uterine horns 3x with sterile saline.\n6. Closing the Laparotomy",
    "Using forceps, carefully return the uterine horns to the peritoneal cavity. Ensuring adequate space between the amniotic sacs and the midline incision, re-approximate the musculofascial layer edges using a running 3-0 silk suture. Be aware of the placement of the amniotic sacs while closing the muscle incision. Be careful to not to suture into or through a sac.\nRe-approximate the skin layer, using a running 3-0 silk suture, closing the skin layer.\n\tNOTE: The laparotomy should be closed in two layers of continuous sutures to allow for skin and muscular expansion with increasing gestation. Continuous sutures allow for evenly distributed wound tension. Interrupted sutures are less desired as multiple knots are irritating and can be easily chewed by the rat upon recovering from anesthesia. Surgical staples are not desired. Tails of the surgical knots should be cut very short (<3 mm).\nInject 1 ml of 0.125% bupivacaine subcutaneously around wound edges using a 26 G needle. Administer one dose of 0.1 mg/kg buprenorphine subcutaneously at the nape of the neck.\nTurn off isoflurane and towel dry rat as necessary. Place in clean home cage and monitor recovery from anesthesia. Ensure rat does not become hypothermic.\n7. Postoperative Recovery and Care\nMonitor the rat every 8-12 hr for 72 hr and then daily until pups are born (approximately E22 or E23). Administer additional doses of buprenorphine q8-12 hr/72 hr or prn as dictated by the IACUC.\nMonitor rats for signs of pain, discomfort, vaginal bleeding or bleeding from the surgical site. Inspect the sutures and incision and take care to ensure rat is not chewing or removing their sutures prematurely. Although exceptionally rare, rats that compromise their sutures are at risk for wound dehiscence.",
    "NOTE: Occasionally rats may ingest excessive amounts of bedding or non-food items, termed pica, as a side effect of buprenorphine administration. Although very uncommon, rats must be monitored for pica and potential subsequent bowel obstruction.\n8. Tissue Processing and Cryosectioning\nTo prepare for Hematoxylin & Eosin (H&E) staining of the postnatal brain, remove pups from their home cage on postnatal day 2 (P2). Using surgical scissors decapitate rat pups and gently remove the brain from the skull.\nDrop fix brain in a 15 ml conical tube containing 7 ml of 4% paraformaldehyde in phosphate buffered saline (PBS). Place brain at 4 °C and fix for 72 hr.\nAfter 72 hr, transfer brains to a sterile PBS solution containing 30% sucrose (w/v) and return to 4 °C.\n\tNOTE: Once brains drop in the sucrose solution they are ready to be sectioned on a cryostat.\nRapidly freeze brains and mount on cryostat pestle for acquisition of frozen coronal sections. Cut 20 µm frozen coronal sections and mount on slides. Ensure sections are collected serially.\nAllow slides to dry at room temperature overnight. Store slides at -20 °C.\n9. Hematoxylin & Eosin Staining\nTake slide mounted frozen sections and warm to room temperature.\n\tNOTE: Prepare all solutions fresh.\nPlace slides on a slide warmer set to 50 °C for 2 hr.\nTransfer slides to a staining rack. Dip slides 10x in double-distilled deionized water (ddH2O).\nIncubate slides in 100% hematoxylin for 5 min. Time in hematoxylin can be optimized depending on degree of purple staining.\nDip slides 4x in tap H2O, and let stand in clean tap H2O for 1 min.\nDip slides 15x in acid alcohol (250 ml 70% ethanol + 1 ml concentrated hydrochloric acid).\nDip slides 4x in tap H2O, and let stand in clean tap H2O for 1 min.",
    "Incubate in 1% lithium carbonate for 2 min.\nDip slides 4x in tap H2O, and let stand in clean tap H2O for 1 min.\nIncubate in 95% ethanol for 1 min.\nDip slides 7x in 100% Eosin. Number of dips in Eosin can be modified depending on degree of pink staining.\nDip slides 5x in 95% ethanol.\nDip slide 5x in a fresh change of 95% ethanol.\nIncubate slides in 100% ethanol for 1 min.\nIncubate slides in a fresh change of 100% ethanol for 1 min.\nIncubate slides in 100% xylene for 15 min.\n\tNOTE: Xylene steps and coverslipping should occur in a fume hood.\nIncubate slides in fresh changes of xylene for 15 min.\nCoverslip with Permount and let dry in fume hood.\nImage slides with a light microscope.  \nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}