{
  "id": 10469,
  "origin_website": "Jove",
  "title": "Environmental Dynamic Mechanical Analysis to Predict the Softening Behavior of Neural Implants",
  "procedures": [
    "1. Preparation of polymer samples for testing\nSynthesize the softening thiol-ene polymer according to previous protocols inside a fume hood.1,2,4,18 Briefly, mix quantitative amounts of thiol to alkene monomers with a total of 0.1 wt% photo initiator.\n\t\nPrepare a 20 mL glass vial for polymer mixing. Cover the vial in aluminum foil to prevent incident light from contacting the monomer solution and keep at room temperature (RT). Use all chemicals as received without further purification.\nFor fully softening polymer, add 50 mol% 1,3,5-triallyl-1,3,5-triazine-2,4,6(1H,3H,5H)-trione (TATATO), 45 mol% trimethylolpropane tris(3-mercaptopropionate) (TMTMP), and 5 mol% Tris[2-(3-mercaptopropionyloxy)ethyl] isocyanurate (TMICN) to the covered vial using a disposable plastic pipette.\nAdd 0.1 wt% of the photoinitiatior 2,2-dimethoxy-2-phenylacetophenone (DMPA) to the polymer solution.\nMix the contents inside the vial thoroughly by planetary speed mixing without exposing the solution to light.\n\t\tNOTE: The polymer solution is sensitive to light and will start to polymerize after 45 to 60 min, even if covered with foil. Therefore, use the polymer solution as quickly as possible after mixing.\nSpin coat the polymer solution prepared in section 1.1 as thin films between 5 to 50 µm in thickness on microscopic glass slides or silicon wafers as a carrier substrate according to the spin curve (Figure 2). For 30 µm film thickness, spin at 600 rpm for 30 s.\n\tNOTE: When using a different SMP formulation, the spin speed and time may vary depending on the viscosity of the polymer solution.\nTransfer the polymer films on the carrier substrate immediately after spinning to the crosslinking chamber. Photo-polymerize the films for 60 min under 365 nm UV bulbs and post-cure for 24 h in a vacuum oven at 120 °C to further complete the conversion.",
    "Cut the cured polymer films into rectangular samples with widths of 4.5 mm and lengths of 50 mm for the DMA testing. Thicknesses may vary from 5 to 50 µm. The samples can be brought into measuring geometry applying two different methods (choose step 1.4.1 or 1.4.2).\n\t\nCut the cured polymer films into rectangles using a CO2 laser. Set the CO2 laser micromachining parameters to 5.0% power (2.0 W) and 10.0% speed (0.254 m/s) (Figure 3A).\nDefine the DMA samples using photolithography in a Class 10000 cleanroom facility (Figure 3B). Use the SMP-on-glass or wafer substrates as the starting substrates in the cleanroom.\n\t\t\nDeposit low temperature silicon nitride to act as a hard mask for the following plasma etching processes. Pattern the device outline/shape using standard lithography techniques. Use a plasma etcher with SF6 and O2 plasma to remove the hard mask and SMP layer, respectively.\nAfter the SMP layer is plasma etched down to the glass slide/wafer, etch the remaining silicon nitride hard mask away in diluted 10:1 HF dip.\nDelaminate the test devices from the glass slide/wafer by soaking in deionized water as the last step.\n2. Machine setup\nUse a dynamic mechanical analyzer (DMA) with an immersion system. Equip the machine with the immersion fixture in tension mode (Figure 1). Connect the liquid nitrogen to the machine and enable LN2/air as a gas source for the furnace.\nWrite the method for dry measurements with the machine software, including the following three steps: conditioning, oscillation temperature ramp, and conditioning end of test, then set up the parameters as follows:",
    "Set the following parameters for the conditioning options: mode = active, select “tension”, axial force = 0.05 N, set initial value to “on”, sensitivity = 0.0 N, proportional force mode = force tracking, compensate for modulus = on, select “axial force” then set dynamic force to 25.0%, minimum axial force = 0.05 N, programmed extension below 0.0 Pa, mode enabled, strain adjust = 0.05%, minimum strain = 0.1%, maximum strain = 0.5%, minimum force = 0.05 N, maximum force = 0.2 N.\nSet the following parameters for the oscillation temperature ramp: start temperature = 10 °C, inherit set point = off, soak time = 0.0 s, wait for temperature = on, ramp rate = 2.0 °C/min, end temperature = 100 °C, soak time after ramp = 0.0 s, sampling rate = 1 pts/s, strain % = 0.275%, single point, frequency = 1 Hz.\nSet the following parameters for the conditioning end of test: environmental control = off, axial force adjustment = on, mode disabled, transducer/motor = off.\nWrite the method for the immersion testing with the machine software including the following four steps: conditioning, oscillation-time, oscillation-temperature ramp, and conditioning-end of test, then set up the parameters as follows:\n\t\nSet the following parameters for the conditioning options: mode = active, select “tension”, axial force = 0.05 N, set initial value to “on”, sensitivity = 0.0 N, proportional force mode = force tracking, compensate for modulus = on, select “axial force” and set dynamic force to 25.0%, minimum axial force = 0.05 N, programmed extension below 0.0 Pa, mode enabled, strain adjust = 0.05%, minimum strain = 0.1%, maximum strain = 0.5%, minimum force = 0.05 N, maximum force = 0.2 N.",
    "Set the following parameters for the oscillation time: temperature = 39.5 °C, inherit set point = off, soak time = 0.0 s, wait for temperature = off, duration = 3600.0 s, sampling rate = 1 pts/s, strain % = 0.275%, single point, frequency = 1 Hz.\nSet the following parameters for the oscillation temperature ramp: start temperature = 10 °C, inherit set point = off, soak time = 300.0 s, wait for temperature = off, ramp rate = 2.0 °C/min, end temperature = 85 °C, soak time after ramp = 300.0 s, sampling rate = 1 pts/s, strain % = 0.275%, single point, frequency = 1 Hz.\nSet the following parameters for the conditioning end of test: environmental control = off, axial force adjustment = on, mode disabled, transducer/motor = off.\n3. Sample loading and unloading for dry measurements\nMeasure the actual thickness of the polymer specimen for dry (in air) testing with Caliper with 0.001 mm precision.\nEnter the sample name, description, and sample geometry into the software.\nSet the loading gap to 15 mm and load the sample. Make sure to center and align specimen before the clamps are screwed hand tight or use a torque wrench with 0.1 N (Figure 3C).\nClose the furnace and start the measurement using the methods described in section 2.2.\nWait until the measurement is over. Open the furnace and remove the polymer sample from the machine.\n4. Sample loading and unloading for immersion testing\nMeasure the actual thickness of the polymer specimen for immersion testing in PBS with Caliper with 0.001 mm precision.\nEnter the sample name, description, and sample geometry into the software.\nPrepare the setup with the immersion beaker fixed with a clamp at the upper grip (Figure 4A,B).",
    "Set the loading gap to 15 mm and load the sample (Figure 4C). Make sure to center and align the specimen (Figure 5) before the clamps are screwed hand tight or use a torque wrench with 0.1 N.\nPlace the immersion bath on the bottom fixture and screw it tightly (Figure 4D). Fill the bath with RT PBS (Figure 4E), place the lid on top (Figure 4F), close the furnace (Figure 4G), and start the measurement immediately using the methods described in section 2.3. Ensure that the drain is closed (Figure 4H).\nWait until the measurement is over. Remove the PBS from the immersion baths using the drain. Open the furnace, remove the lid from the beaker, unscrew the immersion beaker, lift it, and remove the polymer sample from the machine.\nClean the clamps and immersion beaker with de-ironed water to remove any remaining salt from the PBS.\n5. Measurements\nMeasure the polymer in air without the immersion beaker. Follow the instructions for sample loading and unloading as described in section 3. Repeat this measurement at least 3x to gather results with statistical relevance.\nMeasure the polymer inside the immersion bath following the steps described in section 4. Repeat the measurement at least 3x to gather results with statistical relevance.\n6. Data interpretation\nOpen the results tab in the machine software, where the raw data can be viewed in a table format or plotted as a graph.\nPlot the first part of the immersion measurement, the oscillation-time measurement, as storage modulus over time to evaluate the softening kinetics. The curve displays how fast the modulus of the polymer decreases over time while immersed in PBS.\nNote the time at which the modulus levels out. This represents the time for softening under physiological conditions.",
    "If the polymer is not fully softened after the set immersion time of 1 h, repeat the measurement with increased immersion time.\nDisplay the oscillation-temperature ramps of the measurements in air and PBS as storage modulus on the left axis and tan delta on the right axis over temperature to display the thermomechanical properties of the polymer before (dry) and after (in PBS) plasticization.\nPlot the data for the dry (air) and PBS measurements together to better display the changes in thermomechanical properties due to plasticization.\nNote the storage modulus of the dry material at 25 °C and of the soaked sample at 37 °C, as these are relevant numbers for evaluating how much the polymer will soften during implantation.\nNote the changes in tan delta peak between the dry and soaked samples.\nExport the data as a .txt or .csv file for further data interpretation and plotting with other software.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}