{
  "id": 19349,
  "origin_website": "Jove",
  "title": "Microsurgical Creation of Giant Bifurcation Aneurysms in Rabbits for the Evaluation of Endovascular Devices",
  "procedures": [
    "The animal studies were approved by the Institute Animal Ethics Committee of the institute at which this study was conducted. For this animal model, New Zealand white rabbits (2.5-5.5 kg) were used.\nNOTE: Our standard technique for the creation of the venous pouch true arterial bifurcation aneurysms in rabbits was published in 2011, and an adaption for giant aneurysms was published in 201612,13. We summarize these techniques and highlight essential steps for the modification of giant aneurysms.\n1. Preoperative phase\nAdminister ketamine (30 mg/kg) and xylazine (6 mg/kg) via perilumbar intramuscular injection for general anesthesia. Then, intubate the rabbit (tube diameter: 4 mm, length: 18 mm; this size may vary depending on the animal's size), and continue with gas anesthesia (2% isoflurane). Monitor the depth of anesthesia by a toe pinch every 15 min, and adjust if necessary.\nShave the area from the angle of the jaw down to the thorax using clippers. Disinfect the surgical area using at least three alternating rounds of chlorhexidine or povidone-iodine scrub followed by alcohol. Drape the surgical site.\n2. Surgical phase I\nIncise the skin along the midline from the angle of the jaw down to the manubrium sterni using a scalpel. Perform blunt dissection in the subcutis.\nSwitch to the surgical microscope. Dissect a 2-3 cm long branchless segment of the left external jugular vein. Apply 4% papaverine dropwise repeatedly on the vessels to prevent vasospasm and optionally add 5 mg/mL neomycin sulfate dropwise for infection control.\nHarvest the vein segment after proximal and distal ligation using 6-0 non-resorbable sutures. Put the vein segment in a heparinized saline solution (1,000 IU heparin in 20 mL of 0.9% saline and 1 mL of 4% papaverine HCl)13.\n3. Surgical phase II",
    "Prepare both CCAs by dissecting them from the carotid bifurcation down to their origin. Watch carefully for the medial arterial branches, which supply the laryngeal, tracheal, and neural structures.\nAdminister 1,000 IU heparin intravenously.\nApply a temporal microsurgical clip at the distal end of the right CCA.\nLigate and cut the right CCA proximally directly above the brachiocephalic trunk using poly filament 6-0 non-resorbable sutures.\nUse a sterile piece of rubber (e.g. from a glove) as an underlay to facilitate the procedure. Remove the adventitia at the anastomosis site of both vessels with anatomic micro-forceps and micro-scissors. Clip the anastomosis site of the left CCA distally and proximally13.\n4. Surgical phase III\nMake an arteriotomy at the left CCA according to the size of the planned anastomosis with the right CCA and the venous pouch. Determine the length of the arteriotomy by the diameter of the contralateral carotid artery (about 2 mm) together with the size of the planned aneurysm neck.\n\tNOTE: The size is as flexible as the possible aneurysm sizes and neck sizes of this universal aneurysm model. The minimum size should not be smaller than 3 mm and can be up to a maximum of about 15 mm.\nClean the aneurysm site with heparinized saline (about 5 mL). Using four to five non-resorbable 10-0 monofilament sutures, and suture the posterior circumference of the right CCA stump with the before-described arteriotomy of the left CCA.\nCut the stump of the right CCA longitudinally to a length of 1-1.5 cm. Anastomose the posterior part of the venous pouch with the arteriotomy of the left CCA using 10-0 sutures. Then, suture the rear side of the venous pouch with the posterior wall of the right CCA with three to four sutures.\nSuture the anterior anastomosis in the same sequence.",
    "Release the temporal clip on the right CCA. Usually, the anastomosis leaks. Use this to wash air and blood clots out.\nSeal the anastomosis with fat derived from the subcutaneous tissue of the surgical approach and fibrin glue.\nClose the fascia using 4-0 non-resorbable sutures. Perform the wound closure using 4-0 resorbable sutures13.\n5. Postoperative phase\nAdminister 10 mg/kg acetylsalicylic acid intravenously.\nAchieve postoperative analgesia by a transdermal fentanyl patch (12.5. µg/h) at the shaved region for 3 days13. \n\tNOTE: Consult the facility veterinarian on appropriate\n\tanalgesia options.\nAchieve postoperative anticoagulation by administering 100 IU/kg low molecular heparin daily subcutaneously for 2 weeks."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}