{
  "id": 6004,
  "origin_website": "Bio",
  "title": "Quantification of Plant Cell Death by Electrolyte Leakage Assay",
  "procedures": [
    "Inoculation of Arabidopsis leaves with Pto DC3000 avrRpt2 Culture the bacterial strain in 2 ml King’s B liquid medium supplemented with 50 µg/ml kanamycin and 50 µg/ml rifampicin at 28 °C for 16-18 h.Note: The bacterial culture used should be in a late log phase of growth (OD600 = 1.5 - 2.0).Transfer 1 ml of the liquid culture to a 2-ml microcentrifuge tube.Harvest bacteria by centrifugation at 3,000 x g for 5 min at room temperature.Remove supernatant and then suspend bacteria in 1 ml sterilized ultrapure water.Repeat Steps A3-A4 one more time.Adjust the optical density of the bacterial suspension with sterilized ultrapure water to OD600 = 0.1 (measured by a spectrophotometer).Pressure-infiltrate the density-adjusted bacterial suspension (Katagiri et al., 2002) into two leaves per plant in a walk-in Arabidopsis growth chamber.Note: Gently pressure-infiltrate the bacterial suspension through the stomatal openings on the abaxial side of the leaf using a 1-ml needleless syringe. The infiltrated area of a leaf is readily visible as the appearance of the infiltrated area turns dark green due to flooding of the intercellular space of the leaf with bacterial suspension.Measurement of electrolytic conductivityCut two leaf disks (7.5 mm diameter) from one plant (one disk per leaf) using a cork borer on paper towels (Figure 1B). Leaf disks should be cut out before the infiltrated bacterial suspension from Step A7 dries out from the intercellular space of the leaves, which occurs approximately 20 min after infiltration.Note: We typically use 4-weeks old plants grown under the growth conditions described in Equipment section and select the 7th and 8th leaves of each plant to obtain leaves of comparable developmental stages.",
    "Selecting leaves in similar developmental stages is important not only to have a similar amount of tissue for each leaf disk but also to have a similar response to the pathogen.Float two leaf disks (adaxial surface down) from a single plant on 2 ml of sterilized ultrapure water in one well of a 12-well plate, immediately after the leaf disks are cut out in Step B1 (Figure 1C). Use as many wells and 12-well plates as needed according to the number of plants to be assayed. Cover the plate with the lid and incubate it for 30 min in a walk-in Arabidopsis growth chamber.Replace the water in the well with 2 ml of fresh sterilized ultrapure water. Note: Steps B3 and B4 are to remove electrolytes initially leaked from the damaged cells on the edges of the leaf disks.Incubate the plate in a walk-in Arabidopsis growth chamber.Calibrate the electrolytic conductivity meter before the first use with the conductivity standard solution to 1.41 mS/cm.Wash the sensor of the electrolytic conductivity meter with sterilized ultrapure water.Sample 100 µl of the water per well at the determined time point and measure its conductivity using the sensor of an electrical conductivity meter (Figure 1D).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180228/20180228020606_0328.jpgFigure 1. Experimental procedure to measure the electrolytic leakage from Arabidopsis leaf disks. A. 4-weeks old Arabidopsis thaliana accession Col-0 grown under the growth conditions described in Equipment section. B. Cut two leaf disks (7.5 mm diameter) from one plant (one disk per leaf) using a cork borer on paper towels. C. Float two leaf disks (adaxial surface down) on 2 ml of sterilized ultrapure water in one well of a 12-well cell culture plates. D. Drop 100 µl of the water from one well with a pipette onto the sensor of an electrical conductivity meter and measure its conductivity.",
    "Return the sampled water to the well to maintain the water at constant volume during the time course.Continue incubating the plate and repeating Steps B8-B9 at additional time points.Note: The sensor of the electrical conductivity meter should be rinsed with sterilized ultrapure water between one sample and the other."
  ],
  "subjectAreas": [
    "Plant Science",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}