{
  "id": 19314,
  "origin_website": "Jove",
  "title": "Real-time Analysis of Gut-brain Neural Communication: Cortex wide Calcium Dynamics in Response to Intestinal Glucose Stimulation",
  "procedures": [
    "All experimental protocols were approved by the Institutional Animal Care and Use Committee of Ochanomizu University, Japan (animal study protocols 22017). All animal experiments were performed according to the guidelines for animal experimentation of Ochanomizu University that conform with the Fundamental Guidelines for Proper Conduct of Animal Experiment and Related Activities in Academic Research Institutions (Ministry of Education, Culture, Sports, Science and Technology, Japan). Efforts were taken to minimize the number of animals used. This study was carried out in compliance with the ARRIVE guidelines.\n1. Preparation of transgenic mice\nTo follow this experiment, use adult male and female BAC GLT-1-G-CaMP7 #817 transgenic mouse line, namely G7NG817 mice24,25 (older than 8 weeks). The background strain of G7NG817 mice25 is C57BL/6J.\nHouse the mice under a 12 h /12 h light/dark cycle and raise them in groups of up to five mice.\n2. Catheter creation\nUse scissors to adjust the silicon tube (inner diameter 0.5 mm, outer diameter 1.0 mm) to a precise length of 7 cm (Figure 1A-a).\nAdhere diminutive plastic beads (inner diameter 3 mm, outer diameter 5 mm) to the tailored tube, ensuring they are situated 3 mm from its terminus (Figure 1A-b). Affix the beads securely using cyanoacrylate glue (medical or standard variants are acceptable).\nExcise a 23 G needle's apex and subsequently cut 1.5 cm from the needle tip (Figure 1A-c).\nIntroduce the sectioned 23 G needle from step 2.3 into the silicon tube's extremity, opposite to where the beads were affixed (Figure 1A-d).\n3. Injector creation\nUse pliers to excise 1 cm from the needle tip (Figure 1B-a).\n\tNOTE: Ensure the orifice at the severed end retains its integrity and does not get deformed, as any distortion could obstruct the injection solution's flow.",
    "Couple the adapted 23 G injection needle from step 3.1.1 to a 2.5 mL syringe (Figure 1B-b).\nSegment a silicon tube to the requisite length (a 15 cm silicon tube in this experiment) and sheath it over the 23 G injection needle (Figure 1B-c).\n\tNOTE: The volume of solution dispensed will fluctuate based on the tubing's length. For instance, with a 15 cm tube, approximately 50 µL of solution will linger post experiment.\nSever the 23 G injection needle 1.5 cm from the needle tip.\nJoin the sectioned portion from step 3.4 with the silicon catheter fashioned in step 3.3 (Figure 1B-d).\n\t​NOTE: Ensure the orifices created in steps 3.1 and 3.4 remain undistorted post incision. If rectification is needed, employ pliers to restore its circular configuration.\n4. Gastric localization\nAdminister anesthesia to the mouse via 3.0% isoflurane inhalation in a specified chamber.\nDelicately transfer the anesthetized mouse from the inhalation chamber to the surgical table upon verifying the mouse's anesthetized state.\nLay the mouse supine, aligning its mouth proximate to the inhalation apparatus, and modulate the isoflurane concentration from 3.0% to 2.0%.\n\tNOTE: Disengage the inferior segment of the isoflurane mask from its superior counterpart and anchor the separated mask (upper segment) to the surgical table using adhesive tape.\nSupplement the mouse's oral cavity, forelimbs, and hindlimbs to the surgical table using adhesive tape.\n\tNOTE: By fixing the mouse to the table, surgical errors due to movement can be prevented even if the mouse is anesthetized.\nRemove the mouse's hair from the upper left abdomen by using depilatory cream.",
    "Make a skin incision roughly 1.5 cm in length (Figure 1C-b), situated 1 cm to the right of the abdominal median and 5 mm below the xiphoid process (Figure 1C-c). Then, create a 1.5 cm incision in the abdominal wall at the same location as the initial skin incision.\n\tNOTE: Exercise caution to avoid inflicting harm to the underlying liver.\nDelicately reposition the left hepatic lobe laterally using blunt-ended forceps, revealing the stomach beneath.\n5. Catheter insertion\nElevate the stomach and cautiously extricate it through the incision.\n\tNOTE: Exercise utmost care to preserve the integrity of adjacent organs, notably the liver, and refrain from exerting undue force on the stomach.\nUse scissors to create a diminutive perforation (approximately 1.5mm in diameter) in the pyloric antrum.\nIntroduce the catheter's terminus into the perforation, ensuring the bead is in direct contact with the pyloric antrum.\nAdhere the catheter's bead to the stomach employing medical-grade cyanoacrylate glue.\n\tNOTE: Ensure the stomach remains unattached to surrounding organs.\nVerify the firm attachment of the catheter to the stomach, then delicately reposition the stomach to its innate locale beneath the left hepatic lobe.\nStitch the abdominal wall, permitting the catheter to extend externally, using a 5/0 silk suture. After that, close the skin incision in a manner analogous to the abdominal closure.\nSterilize the operated region with 70% ethanol.\nGently reposition the mouse in a sanitized cage.\n\tNOTE: Postoperative mice should be singularly housed.\nAllow a minimum recovery period of 48 h in a standard environment.\n6. Preparation for in vivo transcranial Ca2+ imaging\nAdminister anesthesia to the mouse using isoflurane (induction at 2%; maintenance between 0.8% and 1.0%).",
    "Secure the mouse onto a stereotaxic platform using auxiliary ear bars to mitigate the effects of pulsation and respiration. Subsequently, position the mouse under a fluorescence stereo microscope.\nEmploy a wideband blue fluorescence filter set (with excitation at 460-490 nm and emission at 520 nm) in conjunction with a mercury light source.\nCapture the images using a camera and process them using the designated imaging software.\nCarefully remove the hair from the scalp using an electric shaver or hair removal cream.\n\tNOTE: If using a razor, ensure that it is thoroughly disinfected and be careful not to cut the skin.\nDisinfect the surface of the scalp using a cotton swab or similar tool with a solution of chlorhexidine gluconate diluted to 0.1-0.5%.\nApply a local anesthetic gel and wait for 5-10 min.\nPrepare to apply dental acrylic cement.\n\t\nUse scissors to cut the scalp. Either completely remove the scalp or make a straight cut from the back of the head to the forehead.\nUse clips to expose the skull by extending any excess skin.\nUse a cotton swab to remove the connective tissue of the periosteum.\nImmediately apply the acrylic cement after removing the periosteum. Act quickly to prevent the skull surface from becoming opaque due to evaporation from the exposed bone.\nWait for about 5 min for the cement to dry.\n7. Transcranial Ca2+ imaging with intraduodenal glucose administration\nEquilibrate both the experimental solution and saline to ambient temperature. Subject the mice to a dietary restriction for a specified duration (e.g., 2 h).\nPurge any residual content within the mouse-side catheter using ~0.03 mL of saline before initiating the injection.",
    "Aspirate the experimental solution (for instance, a 10% glucose solution prepared in 300 µL of water, complemented with an additional 300 µL of water) into the syringe, then interface it to the catheter. Ascertain the optimal dosage of the solution tailored to the specific experimental objective.\n\tNOTE: During this phase, exercise caution to prevent undue strain on the catheter, which might jeopardize the mouse's internal anatomy. Endeavor to manipulate the mouse-side tubing with utmost gentleness. Additionally, ensure the syringe remains devoid of air post solution aspiration, as entrapped air and bubbles could induce gastrointestinal distension.\nAssess the mouse's physiological state and activate the imaging software's recording function by clicking on the recording process button of the software application.\nCapture images at a resolution of 512 x 512 pixels, 16 bit depth, and a frame rate of 10 Hz.\n\tNOTE: The recording parameters can be adjusted to align with specific experimental requirements.\nAcquire spontaneous data (e.g., spanning 50 s), followed by the gradual infusion of the experimental solution at a rate tailored to the experiment (here, 0.035 mL/s).\n8. Image data processing and analysis\nBin image data into 64 x 64 pixels.\nDetermine hand-drawn regions of interest (ROIs) using ImageJ. Refer to the mouse brain atlas to designate ROIs as the frontal area (M2), the somatosensory area including the Barrel (Somato), the occipital area (Visual), and the retrosplenial region (RSC).\nUse the MATLAB function ReadImageJROI to extract the coordinates corresponding to the ROIs. Access the MATLAB function through the provided link: https://jp.mathworks.com/matlabcentral/fileexchange/32479-readimagejroi\nCompute the average rate of fluorescence intensity change within the ROI using MATLAB.\n\t\nDefine the fluorescence intensity change rate (ΔF/F) with equation (1):\nimgsrc://cloudfront.jove.com/files/ftp_upload/65902/65902eq01.jpg     (1)",
    "Where Ft represents the fluorescence intensity value at a specific time and the average intensity value from the start of recording until 50 s into the injection is denoted as F0.\nAccount for the delay in the injection solution reaching the organ. Use the average intensity value spanning the three seconds post injection as a baseline. Target waveforms surpassing the baseline intensity value + 1 SD for analysis if they occur 3 s or later post injection."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}