{
  "id": 5286,
  "origin_website": "Bio",
  "title": "Delayed Spatial Win-shift Test on Radial Arm Maze",
  "procedures": [
    "2-day habituationDuring habituation, all eight arms are opened and the rodents are placed in the center arena facing away from the investigator (to give consistent introduction to the spatial cues) and allowed to freely explore the maze. Three standard chow grain pellets (45 mg) are placed along each arm to encourage exploration. Rodents are habituated to the maze for two consecutive days, with two 10 min sessions 4 h apart (Figure 2). After the final habituation session, the rodents are returned to their home cages and provided with approximately 20 grains of standard chow food pellets per animal. The arena is cleaned with 70% ethanol after each animal (and session) and allowed to dry thoroughly before the next rat is tested.Note: Spatial cues such as colourful flags that are significantly different in appearance should be placed around the maze to allow the rat to orientate itself to its environment as albino rats are able to discriminate colour of certain wavelengths (Walton, 1933).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20161128/20161128213542_7570.jpgFigure 2. Delayed win-shift radial arm maze schematic representation with spatial cues placed around the maze (spatial cues in this figure are for illustrative purposes and were not the actual cues used). During the training phase, rodents are allowed to explore four pseudo-randomly selected arms baited with grain pellets whilst the other four arms are blocked. After a 5 min inter-trial-interval spent in their home cages, rodents are placed back into the maze with all arms accessible for the test phase. Previously blocked arms are then baited with grain pellets.13-day (26 trials) experimental phaseNote: The duration of the experimental phase is dependent on the control group making a mean of no more than one error in the test phase. Therefore this experiment may go for less or longer than 13 days (26 trials).",
    "At the completion of the habituation phase, rodents are placed back into their home cages until the bi-daily training and test phases the following day. On day three the rodents undergo bi-daily sessions consisting of a 5 min training phase, a 5 min inter-trial interval (ITI) where the rodent is returned to its home cage, and a 5 min test phase. The bi-daily sessions are 5 h apart (Figure 3).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20161128/20161128213733_3612.jpgFigure 3. Timeline of the bi-daily habituation, training and test phases. A). Habituation sessions consist of two 10 min sessions with a 4 h interval. All eight arms are open and baited. B). Experimental bi-daily sessions. Each session includes a 5 min training phase, a 5 min inter-trial interval (ITI) and a 5 min test phase.Throughout the experiment, access to standard chow food can be restricted to approximately 80% of the rodents’ normal food intake as recorded at the commencement of the experiment to encourage explorative behaviour during testing (Halagappa et al., 2007). Body weight is measured three times a week to ensure rodents do not fall below 80% free-feeding weight. If this does occur the amount of daily food intake can be increased. An alternative strategy is also to impose food deprivation during the dark cycle (Olton and Schlosberg, 1978).  During the 5 min training phase, four of the eight arms are blocked. These are pseudo-randomly chosen (daily by the investigator) with no more than two adjacent arms being blocked at a time such that the combination of arms 1, 3, 4, 5 is excluded because 3, 4 and 5 are adjacent arms but 1, 2, 5, 7 is a valid combination because only 1 and 2 are adjacent (Floresco et al., 1997; Taylor et al., 2003b; Furgerson et al., 2014).",
    "The four unblocked arms are baited with three food pellets in each food well. During this phase of the experiment, the rodent is allowed to explore the maze for 5 min or until it has explored all of the open baited arms and retrieve the grain pellet rewards from all of them. The training phase can be video-recorded and scored using automated tracking programs such as EthovisionXT or can be manually scored in real time. An arm entry is recorded when the rodent moves all four paws off the central platform into the arm. Working errors (re-entry of an arm that had been baited and visited) can be recorded during this training phase.At completion of the training phase, rodents are returned to their home cage for 5 min. During this time, the maze is wiped down with 70% ethanol, allowed to dry completely and all eight arms opened. The previously blocked arms are baited with food pellets with the previously open arms left empty. After the ITI, rodents are placed back into the center of the maze and are allowed to explore all eight open arms for 5 min. This test phase can be video-recorded for automated scoring on camera or can be manually scored in real time. Two types of errors are recorded: working error (re-entry of an arm that had been baited and visited) and reference error (entry into an arm that had been baited during the training phase). The experiment is continued bi-daily until the control group makes a mean of no more than one error in the test phase (criterion), achieved after 26 trials in De Luca et al., 2016.",
    "Troubleshooting: If the rodent does not explore the maze during the habituation phase, a longer duration or additional sessions can be performed across the entire cohort before moving on to the test phase. The investigator may increase the amount of standard chow food pellets provided during the sessions as a greater incentive to explore.Rodents may attempt to jump from the arm they are exploring to an adjacent arm over the wall. To deter this from occurring the investigator should physically remove the rodent from the arm and place it back into the center of the maze facing away from the investigator."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}