{
  "id": 12108,
  "origin_website": "Jove",
  "title": "Analysis of Combinatorial miRNA Treatments to Regulate Cell Cycle and Angiogenesis",
  "procedures": [
    "1. miR-143 and miR-506 transfection\nCAUTION: Use latex gloves, protective eyeglasses, and a laboratory coat while performing the described experiments. When required, use the biosafety cabinet with the cabinet fan on, without blocking the airways or disturbing the laminar airflow. Always set the protecting glass window to the appropriate height, as described by the manufacturer.\nSeed NSCLC A549 cells in a T25 cm2 flask/6/96 well plate in DMEM/F12K media supplemented with 10% FBS and 1% penicillin-streptomycin (culture media) in a tissue culture hood and incubate overnight at 37 °C with 5% CO2 in a tissue culture incubator.\nSuspend miR-143 and/or miR-506 mimics, or scramble siRNA with transfecting agent (2.4 µg of miR were mixed with 14 µL of transfecting agent; see Table of Materials) in 500 µL of transfection media and 1.5 mL of serum and antibiotic-free DMEM/F12K media at a final miRNA concentration of 100 nM. miRNA amount may require optimization on different cells and concentrations. Appropriate approaches include the transfection of cells with increasing concentrations of miRNA (i.e., 50-200 nM) and evaluation of expression downregulation of the genes of interest.\nRemove culture media from flask/plate and wash once with 1x PBS.\nAdd miRNA/scramble-transfecting agent complexes and incubate at 37 °C with 5% CO2 for 6 h (flask size defines the added incubation volume).\nReplace the media with 4 mL of culture media and incubate cells for 24 h and/or 48 h.\nHarvest transfected cells by trypsinization, by adding 1 mL of trypsin-EDTA in each T25 cm2 flask, incubate for 5-10 min at 37 °C, and add 3 mL of culture media to harvest the cells. Place the contents of each flask into a separate, marked 15 mL tube. Work in a tissue culture hood.\nCentrifuge at 751 x g for 5 min and remove the supernatant.",
    "NOTE: Caution is required during supernatant removal, as agitation of the tube may cause loss of cells.\nAdd 2 mL of 1x PBS and centrifuge for 5 min at 751 x g.\nRepeat steps 7 and 8 once to remove any traces of media and supernatant.\n\tNOTE: At this stage, sample tubes can be stored at -80 °C or can be used immediately.\n2. RNA extraction\nClean the work area by spraying with 70% isopropyl alcohol and RNAse decontamination solution.\nRNA extraction should be performed using an appropriate RNA kit (see Table of Materials).\nRemove the tubes from -80 °C and allow them to thaw. Add 300 µL of lysis buffer and pipette up and down to break the cell membrane.\nAdd an equal volume of 100% ultra-pure ethanol.\nMix well and place in separating column.\nCentrifuge between 11 and 16 x g for 30 s and remove the flow-through.\nAdd 400 µL of washing buffer and centrifuge to remove the buffer.\nAdd 5 µL of DNAse I with 75 µL of DNA digestion buffer in each sample and incubate for 15 min.\nWash the sample with 400 µL of RNA prep buffer.\nWash 2x with RNA wash buffer.\nAdd nuclease-free water to the column, centrifuge, then collect the RNA.\nMeasure total RNA concentration with a UV spectrophotometer.\n3. RT-qPCR\nPrior to RT-qPCR, synthesize the cDNA. Subsequent to RNA concentration quantification, place 1 µg of RNA in a 20 µL final volume of reaction to prepare cDNA in a PCR tube. Always work on a clean bench.\nAll other necessary ingredients are included in Table 1.\ntable:\n﻿0,1\nIngredients,Quantity (µL)/sample (20 µL)\n5X cDNA Master mix,4\ndNTPs,2\nRandom hexamers,1\nRT enhancer,1\nVerso enzyme mix,1\nDNase and RNase free water,Required qty after adding RNA to make 20 µL",
    "Table 1: Materials for cDNA synthesis from RNA samples. Required quantities of respective ingredients to prepare a master mix for one sample for cDNA synthesis.\nIncubate in a thermal cycler with the following temperature conditions: 42 °C for 30 min; 95 °C for 2 min; 4 °C until collection of samples.\nUse immediately in regular PCR or qPCR, or store cDNA at -20 °C.\nPrepare forward and reverse primer solutions with DNase/RNase-free water at a concentration of 10 µM from stock primer solution.\nPrepare separate master mixes for each gene to be detected, according to the number of samples. For each cDNA sample (qPCR well), the reaction quantity is prepared according to Table 2.\ntable:\n﻿0,1\nIngredients,Quantity (µL)/sample (20 µL)\nSYBR master mix,10\nForward Primer - 10 μM,2\nReverse Primer - 10 μM,2\nDNase and RNase free water,3\ncDNA sample,3\nTable 2: Materials for quantitative real-time PCR from cDNA samples. Required quantity of ingredients to prepare a master mix for one sample for qPCR.\nPlace each sample in the respective wells.\nDesign the sample layout for the 96 well qPCR plate. For each sample and analyzed gene, perform the reaction in triplicates, or at least in duplicates.\nSeal the 96 well plate with an optically clear adhesive cover.\nQuick-spin the plate to allow the reaction mixture to reach the bottom of each well.\nRun RT-qPCR according to the following thermal gradient:\n\t1) 50 °C for 2 min\n\t2) 95 °C for 2 min\n\t3) 95 °C for 15 s\n\t4) Take reading\n\t5) 60 °C for 1.5 min\n\t6) Repeat step 3 for 39 times\nRun the following thermal gradient in continuation of the above to determine melting curve which indicates single product amplification.\n\t7) 65 °C for 0.31 min\n\t8) +0.5 °C/cycle\n\t9) Plate read",
    "10) Repeat step 8 for 60 times until reaching 95 °C\n\t11) 72 °C for 2 min\n4. Agarose gel electrophoresis to confirm single gene amplification\nPrepare 1% agarose gel in 1x TBE buffer.\nAdd ethidium bromide (EtBr) in warm (~50 °C) gel until achieving a final concentration of approximately 0.2-0.5 µg/mL. EtBR binds with DNA and allows it to be visualized under UV light in a gel imager.\nPour warm gel in a gel tray supplied with an electrophoresis gel box. Attach the provided comb tightly for uniform wells.\nAllow the gel to rest and cool to room temperature (RT) for ~30 min.\nWhen the gel is solidified, place the gel and tray in the gel box.\nFill the gel box with 1x TBE buffer until the gel is completely covered.\nMeasure the concentration of the DNA from PCR amplification process using a UV spectrometer.\nTake ~15 ng of DNA in a small PCR tube, add 5 µL of dye, and add the required amount of nuclease-free water to achieve a 15 µL total volume.\nLoad the DNA ladder and samples into the wells.\nRun the gel at 100 V until the dye line is approximately 75%-80% down the gel.\n\tNOTE: Make sure the gel runs from a negative to positive charge.\nRemove the gel and place it in the gel imager to visualize DNA.\n5. Cell cycle analysis\nSeed 5 x 105 cells for each sample in a T25 cm2 flask and perform a transfection according to the protocol described in section 1, steps 1-5.\nAfter 24 h and 48 h, then harvest the cells by trypsinization.\nTransfer the cell suspensions to 15 mL sterile tubes and label them properly.\nCentrifuge samples at 751 x g for 5 min and discard the supernatant.",
    "Add 2 mL of ice-cold 1x PBS, vortex, and centrifuge at 751 x g for 5 min. Discard the supernatant.\nRepeat the washing step with 1x PBS to remove residual media.\nResuspend and break the pellet by adding 200 µL of ice-cold 1x PBS by pipetting.\nFix the cells by adding 2 mL of 70% ice-cold ethanol dropwise to the tube while vortexing gently.\nIncubate tubes for 30 min at RT and place the tubes at 4 °C for 1 h.\nRemove tubes from 4 °C and centrifuge at 751 x g for 5 min.\nAdd 2 mL of ice-cold 1x PBS, vortex, and centrifuge at 751 x g for 5 min. Discard the supernatant.\nAdd 500 µL of 1x PBS with propidium iodide (50 µg/mL) and ribonuclease A (200 µg/mL)\nIncubate for 30 min at RT while protecting the samples from light.\nAcquire data on flow cytometer. Use forward vs. side scatter (FSC vs. SSC) to select the main population of cells, excluding debris at the bottom left corner of the FSC vs. SSC density plot and cell clusters at the top to top-right side of the FSC vs. SSC density plot.\nAnalyze data for identification of cell populations per cell cycle stage with appropriate software.\n6. Apoptosis assay\nSeed 5 x 105 cells for each sample in a T25 cm2 flask and perform a transfection according to the protocol described in section 1, steps 1-5.\nAfter 24 h and 48 h, harvest the cells by trypsinization.\nTransfer the cell suspensions to 15 mL sterile tubes and label them properly.\nCentrifuge at 751 x g for 5 min and discard the supernatant.\nAdd 2 mL of ice-cold 1x PBS, vortex, and centrifuge at 751 x g for 5 min. Discard the supernatant.",
    "Repeat the washing step with 1x PBS to remove residual media.\nDilute 10x Annexin V binding buffer to 1x with ice-cold dH2O.\nAdd 1 mL of 1x Annexin V binding buffer to each sample tube and resuspend gently.\nPlace 96 µL of cell suspension in a 1.5 mL microcentrifuge tube.\nAdd 1 µL of Annexin V-FITC conjugate and 12.5 µL of propidium iodide (PI) to the tube containing the cell suspension.\nIncubate the cell suspension for 10 min on ice in the dark.\nAdd 250 µL ice-cold 1x Annexin V binding buffer to each sample tube to dilute.\nAnalyze samples with flow cytometer immediately.\n7. Protein expression by antibody cell cycle microarray\nSeed 5 x 105 cells for each sample in T25 cm2 flasks and perform a transfection according to the protocol described in section 1, steps 1-5.\nAfter 24 h and 48 h, harvest cells by trypsinization.\nTransfer cell suspensions to 15 mL tubes and label them accordingly.\nCentrifuge at 751 x g for 5 min and discard the supernatant.\nAdd 2 mL of ice-cold 1x PBS, vortex and centrifuge at 751 x g for 5 min. Discard the supernatant.\nRepeat the washing step with 1x PBS.\nAdd 150 µL of lysis buffer supplemented with protease inhibitors. Pipet up and down gently to disrupt the cell membranes.\nTo prevent any lysis buffer interference, perform a buffer exchange to replace the lysis buffer with labeling buffer, using the manufacturer's solvent exchanging columns.\nQuantify the total protein with a BCA assay.\nTake 70 µg of protein sample and add labeling buffer to achieve a final volume of 75 µL.\nAdd 100 µL of dimethylformamide (DMF) to 1 mg of biotin reagent (biotin/DMF).",
    "Add 3 µL of the biotin/DMF to each protein sample (biotinylated protein sample) and incubate for 2 h at RT.\nAdd 35 µL of stop reagent and mix by vortexing.\nIncubate samples at RT for 30 min.\nRemove the microarray slides from the refrigerator so that they warm to RT for 1 h before use.\nPerform blocking for non-specific binding by incubating the slides with 3% dry milk solution (in blocking reagent provided by manufacturer) in a Petri dish with continuous shaking for 45 min at RT.\nWash the slides with ddH2O water (unless otherwise specified, washing takes place with ddH2O).\nRepeat the washing step ~10x to completely remove the blocking solution from the slide surfaces. This is important to achieve a uniform and low background.\nRemove excessive water from the slide surfaces and proceed to the next step without letting the slides dry.\nPrepare coupling solution by dissolving 3% dry milk in a coupling reagent.\nAdd 6 mL of the coupling solution and to the full quantity of the previously prepared biotinylated protein sample from step 7.12.\nPlace one slide in one well of the coupling chamber provided by the vendor and add ~6 mL of protein coupling mix to it.\n\tNOTE: Ensure that the slide is completely submerged in protein coupling mix solution.\nCover the coupling chamber and incubate for 2 h at RT with continuous agitation in an orbital shaker.\nTransfer the slides to a Petri dish and add 30 mL of 1x washing buffer. Place the Petri dish in orbital shaker, shake for 10 min, and discard the solution.\nRepeat step 7.24 2x.\nRinse the slides with ddH2O water extensively as described in steps 7.17 and 7.18 and proceed to next step immediately to avoid drying.",
    "Add 30 µL of Cy3-streptavidin (0.5 mg/mL) in 30 mL of detection buffer.\nPlace the slide in a Petri dish and add 30 mL of detection buffer containing Cy3-streptavidin.\nIncubate in an orbital shaker for 20 min with continuous shaking protected from light.\n\tNOTE: Cy-3 is a fluorescent dye. Cover with aluminum foil or operate under dark conditions to maintain fluorescence intensity.\nPerform steps 7.24-7.26 and allow the slide to dry using a gentle stream of air or placing the slide in a 50 mL conical tube and centrifuge at 1300 x g for 5-10 min.\nPlace the slide in slide holder and cover with aluminum foil.\nScan the slide in a microarray scanner with the appropriate excitation and emission wavelengths. In the case of Cy3, the excitation wavelength peak is at ~550 nm and emission peak at ~570 nm.\nAnalyze the data (see Table of Materials) for software used).\n8. RNA sequencing\nSeed 5 x 105 cells for each sample in T25 cm2 flasks and perform a transfection according to the protocol described in section 1, steps 1-5.\nAfter 24 h and 48 h, harvest the cells by trypsinization.\nTransfer the cell suspensions to 15 mL tubes and label them accordingly.\nExtract RNA according to section 2, steps 1-6.\nCheck RNA quality as well as concentration with a bioanalyzer. An RNA integrity score (RIN) above eight and appropriate histograms are necessary to confirm RNA quality.\nFrom the total RNA, use ~2 µg of the sample for RNA sequencing (messenger RNA from total RNA)\nSequence using a next-generation sequencer11.\nRun quality trimming and map with a reference genome from FASTQ files generated from the RNA sequencing machine11.\nUpload FASTQ files and raw read the count data to Genebank, following the instructions of the <https://www.ncbi.nlm.nih.gov/> website.",
    "NOTE: See accession number SRP133420 for previous results.\n9. Tube formation assay\nAssess the angiogenic potential of miRNA-transfected human umbilical vein endothelial cells (HUVECs) 36 h post-transfection, as described in section 1, steps 1-5, using HUVEC cells instead of A549 cells.\nStarve HUVECs with M199 starvation media for 4 h at 37 °C with 5% CO2.\nRemove reduced growth factor basement membrane matrix from -80 °C and store at 4 °C overnight, allowing gradual thawing to avoid bubble formation and polymerization.\nCarefully and slowly coat wells of a 96 well plate with 0.04 mL of reduced growth factor basement membrane matrix, avoiding bubble formation. Perform the whole procedure under a laminar flow hood.\nFill adjacent wells of the 96 well plate with 0.1 mL of PBS to maintain humidity and preserve temperature.\nIncubate the 96 well plate at 37 °C for at least 20 min so that polymerization of basement membrane extract is achieved. Do not incubate for more than 1 h.\nTrypsinize transfected HUVECs from each group and resuspend in medium M199 at a concentration of 1 x 105 cells/mL.\nAdd 0.1 mL of each cell suspension to the wells containing polymerized basement membrane matrix in the 96 well plate.\nIncubate the 96 well plate at 37 °C with 5% CO2 while preparation of the growth factors takes place. Preparation of growth factors also takes place under the laminar flow hood.\nReconstitute growth factors (VEGF) in 2x the final desired concentration (4 ng/mL concentration for 2 ng/mL final concentration) and add 0.1 mL of growth factor-containing M199 starvation medium on top of the 0.1 mL of M199 starvation medium with the cells. For non-VEGF-treated wells, add 0.1 mL of M199 starvation medium on top of the 0.1 mL of M199 starvation medium with the cells.",
    "Incubate the 96 well plate for 6 h at 37 °C with 5% CO2.\nAt the end of the incubation period, obtain images of each well with 4x magnification, using a brightfield microscope connected with a digital camera.\nProcess images with software equipped with an \"angiogenesis analyzer\" plug-in19. Use three parameters, the number of nodes, number of junctions, and total sprout length, to compare the effects of miRNA treatment on angiogenesis.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}