{
  "id": 17731,
  "origin_website": "Jove",
  "title": "Treatment of Facial Deformities using 3D Planning and Printing of Patient-Specific Implants",
  "procedures": [
    "1. Repositioning of the jaws\nNOTE: This section is performed using the imaging software (i.e., Dolphin).\nLoad the facial bones CT image DICOM files of the patient (Figure 1A) into the software by selecting the 3D button on the left and clicking Import New DICOM (Supplemental Figure 1). Enter the 3D editing mode by clicking 3D | Edit.\nOrient the 3D image using the orientation button on the left. Create a panoramic image using the build X-rays button on the left (Supplemental Figure 2).\nGo to Tools | Orthognathic Surgical Planning | Start New Workup.\nPosition the segments in the panoramic image. Crop each segment to contain the area of the corresponding bone.\n\tNOTE: The cleaning stage is useful when, for accuracy, a scanned dental arch and a CT scan are superimposed to create a wafer. This is not indicated in a “waferless” surgery as presented here and thus at this stage one can clean CT imperfections if they exist.\nChoose the appropriate osteotomy for the patient on the left pan under osteotomies (such as LeFort I, sagittal split, etc.). Mark the exact location of the osteotomy lines by moving the yellow circles (Supplemental Figure 3).\n\tNOTE: It is extremely important to note the root apexes of the teeth as the location of the osteotomy decided here will be the one performed later based on the surgical guides. Always avoid the roots and maintain a 5 mm distance.\nMark different landmarks by left clicking on the right location for each suggested landmark.\n\tNOTE: This is important for measurements and movement purposes in the next stages.\nPerform movements of bone segments. Drag the bone to the right location, or for accuracy, right click and choose Input Movements Using Keyboard.",
    "In order to track the movement of key landmarks, press Treat Options Button on the left and choose Show Landmark Offset and Measurement Tables.\n\tNOTE: In the next tab the pre and post virtually planned operation can be observed (Supplemental Figure 4).\nExport the stl files of the two different positions of bone segments, one in the pre-operative stage and one in the post-operative stage, using the slide bar on the left and the Export Segments in stl button on the left.\n2. Preparation of patient-specific fixation plates and surgical guides\nNOTE: This section is performed using the 3D design software (i.e., Geomagic Freeform).\nClick File | Import Model (Supplemental Figure 5A) to import the stl files obtained from step 1.9 showing the position of the upper jaw and midface following the osteotomy but prior to the repositioning in the final position.\nStart with planning the patient-specific fixation plates in the final position of the upper jaw. In the tool palette on the left under the Planes category, select Create Plane (Supplemental Figure 6A). Here the initial design of the plates will be performed. Manually move the plane parallel to the bone where the plate will be placed.\nUnder the Sketch category (Supplemental Figure 6B), choose a circle shape and create circles with a size appropriate for the screws to be used later. Create a second circle around the previous one 3 mm larger in diameter to outline the fixation plate.\n\tNOTE: The size of the circles is determined based on the fixation sets used in each institute. The circles are placed above and below the planned surgical osteotomy (decided already in section 1).",
    "Project the design from the plane to the bone. Under the Curves category (Supplemental Figure 7), use the project sketch tool and choose the circles that will be transferred from the plane to the bone.\nTo connect the outer circles for the outer border plate design, choose under the Curves category the split tool and define the part of the circle that will be removed to allow for a connection to the adjacent circles. Using the select option, choose the defined part of the circle and delete it. Under the Curves category, use the draw curve tool and connect the outer circles to create a continuous outer shape of the patient-specific plate.\nBefore creating the fixation plate, duplicate the upper jaw by right clicking and selecting Duplicate from the object list (Supplemental Figure 7A). This will allow the use of the Boolean tool in the next stages to create the fixation plate.\nUnder the Detail Clay category, use the emboss with curve tool. This creates the volume of the fixation plate based on the curves previously projected. Choose the outer shape curve and then place the circle-shaped cursor inside and on the surface of the shaped plate (note that the cursor should be placed on the side to be embossed). At the bottom, choose the parameters of the function, mainly the Distance option that controls the thickness of the future fixation plate.\nSeparate the plate from the upper jaw. At this stage the Boolean option is performed. Choose the original upper jaw, right click from the object list and click Boolean | Remove from | Upper Jaw with Plate.",
    "To create the holes for the screws, either draw the screws/scan them and then use the Boolean option or use the SubD tool. Under the SubD Surfaces category (Supplemental Figure 8), use the wire cut SubD tool to create rods perpendicular to the plate in the size of desired holes, which is performed based on the circles created in step 2.3 originating from the perpendicular plane.\nNext, subtract the rods from the plate using the Boolean | Remove from technique.\n\tNOTE: At this stage the final fixation plate is ready (Supplemental Figure 9). Appropriate surgical guides need to be planned for the osteotomy in order for the plates to fit perfectly.\nTo create the guides, reposition the upper jaw to its original location but with the screw holes marked in the bone according to the fixation plate created in the final position of the jaw (note the holes in the midface do not change position as the midface stays in the same position).\n\t\nTo perform this, reposition the jaw with the curves for the holes used for the final fixation plate to the original location of the jaw prior to the movement. Under the Select/Move Clay category, use the Register Pieces option. choose the Source (upper jaw post movement) and the Target (upper jaw and midface prior to the movement). Use a large number of fixed points on both objects for accuracy in the repositioning.\nBased on newly positioned holes create the surgical guides in a similar way as described for the fixation plates (steps 2.3−2.10).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}