{
  "id": 4501,
  "origin_website": "Bio",
  "title": "Construction of Glycine Oxidase Mutant Libraries by Random Mutagenesis, Site Directed Mutagenesis and DNA Shuffling",
  "procedures": [
    "Random mutagenesisPrepare the amplification mixture (100 µl) as follows:10 µl of 10x Taq buffer (Mg2+ plus)5 µl of 10 mM Mn2+2 µl of 10 mM dGTP and dCTP1 µl of 10 mM dATP and dTTP2 µl of 100 nM oligonucleotide primer F2 µl of 100 nM oligonucleotide primer R1 µl of recombinant plasmid pGEX-GO as template2 µl of Taq DNA polymeraseAdd ddH2O to a final volume of 100 μlThe error-prone PCR procedure was performed using the following parameters:table:\n﻿0,1,2,3\nSegment,Cycles,Temperature,Time\n1,1,94 °C,3 min\n2,30,94 °C,30 sec\n2,30,59 °C,30 sec\n2,30,72 °C,80 sec\n3,1,72 °C,7 min\nCheck product by electrophoresis of 5 μl of error-prone PCR product on 1% agarose gel.Error-prone PCR products were purified, digested with BamHI and XhoI, cloned into pGEX-6P-1, and transformed into E.coli DH5α to construct the random mutant library.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140930/20140930203044_4890.jpgFigure 1. Agarose gel electrophoresis of PCR products by the first round error-prone PCR and recombinant plasmids. A. PCR products. Lane 1: Wide Range DNA Marker (500~12,000 bp); Lane 2-5: Error-prone PCR products; B. Recombinant plasmids. Lane 1: The empty vector pGEX-6P-1; Lane 2-11: Recombinant plasmids pGEX-GOs from colonies.Site directed mutagenesisPrepare the amplification mixture (50 µl) as follows:10 µl of 10x FastPfu buffer (Mg2+ plus)1 µl of 10 mM high pure dNTPs1 µl of 100 nM oligonucleotide primer F1 µl of 100 nM oligonucleotide primer R1 µl of dsDNA template 1 µl of FastPfu DNA polymeraseAdd ddH2O to a final volume of 50 μlThe site directed mutagenesis PCR procedure was performed as the following parameters:table:\n﻿0,1,2,3\nSegment,Cycles,Temperature,Time\n1,1,97 °C,2 min\n2,20,94 °C,20 sec\n2,20,54 °C,30 sec\n2,20,72 °C,1 min/kb of plasmid length\n3,1,72 °C,7 min",
    "Check product by electrophoresis of 5 μl of the site directed mutagenesis PCR product on 1% agarose gel.The site directed mutagenesis PCR products were purified, digested with DpnI, and transformed into E.coli DH5α.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140930/20140930203100_3230.jpgFigure 2 Agarose gel electrophoresis analysis of cylcled PCR product and mutated plasmid.  A. PCR product. Lane 1: Wide Range DNA Marker (500~12,000 bp); Lane 2: Cycled PCR product. B. Mutated plasmid. Lane 1: The empty vector pGEX-6P-1; Lane 2: Mutated plasmid.DNA shufflingObtaining DNA fragments for shuffling.Prepare the parental genes by PCR amplification (100 µl) as follows:10 µl of 10x Taq buffer (Mg2+ plus)2 µl of 10 mM High Pure dNTPs2 µl of 100 nM oligonucleotide nested primer F12 µl of 100 nM oligonucleotide nested primer R11 µl of beneficial mutatant as template2 µl of Taq DNA polymeraseAdd ddH2O to a final volume of 100 μlThe DNA shuffling PCR procedure was performed as the following parameters:table:\n﻿0,1,2,3\nSegment,Cycles,Temperature,Time\n1,1,94 °C,3 min\n2,30,94 °C,30 sec\n2,30,62 °C,30 sec\n2,30,72 °C,80 sec\n3,1,72 °C,7 min\nCheck product by electrophoresis of 5 μl of product on 1% agarose gel.Mix ~1 μg of each purified PCR products.Prepared for DNA fragmentation by ultrasonic treatment at 0 °C for 40 min to generate a pool of fragments, then the DNA fragments between 100~200 bp were purified using gel purification column.Check the DNA fragments by electrophoresis of 10 μl of product on 3% agarose gel.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140930/20140930203119_1834.jpgFigure 3. Schematic of parental genes with the nested primers in the process of DNA shuffling Reassembled by primerless PCR.Prepare the amplification mixture (50 µl) as follows:10 µl of 10x Taq buffer (Mg2+ plus)2 µl of 10 mM high pure dNTPs42 µl of purified fragment DNA1 µl of Taq DNA polymeraseAdd ddH2O to a final volume of 50 μlThe primerless PCR procedure was performed as the following parameters:table:\n﻿0,1,2,3\nSegment,Cycles,Temperature,Time",
    "1,1,94 °C,3 min\n2,60,94 °C,30 sec\n2,60,40 °C,30 sec\n2,60,72 °C,20 sec + 1 sec per cycle\n3,1,72 °C,7 min\nCheck product by electrophoresis of 5 μl of PCR product on 1% agarose gel. A smear of reassembled product that extends above the molecular weight of the parent gene should be visible.Amplification of full-length sequences.Prepare the amplification mixture (50 µl) as follows:10 µl of 10x Taq buffer (Mg2+ plus)2 µl of 10 mM high pure dNTPs1 µl of 100 nM oligonucleotide nested primer F21 µl of 100 nM oligonucleotide nested primer R25 µl of unpurified reassembly reaction mixture as template1 µl of Taq DNA polymeraseAdd ddH2O to a final volume of 50 μlThe PCR procedure was performed as the following parameters:table:\n﻿0,1,2,3\nSegment,Cycles,Temperature,Time\n1,1,94 °C,3 min\n2,30,94 °C,30 sec\n2,30,59 °C,30 sec\n2,30,72 °C,80 sec\n3,1,72 °C,7 min",
    "Check product by electrophoresis of 5 μl of product on 1% agarose gel.PCR products were purified, digested with BamHI and XhoI, cloned into pGEX-6P-1, and transformed into E.coli DH5α to create the DNA shuffling library.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140930/20140930203139_7755.jpgFigure 4. The schematic of glyphosate oxidase gene by DNA shuffling. A. Amplification of six variants GO. Lane 1: Wide Range DNA Marker (500~12,000 bp); Lanes 2-7: DNA fragments encoding variants GO. B. DNA fragmentation. Lanes 1-8: DNA fragments were treated by ultrasonic at 0 °C with a time gradient of 5 min from 0 to 35 min; Lane 9: 20 bp DNA Ladder Marker (20~500 bp). C. Purification of DNA fragments. Lane 1: 20 bp DNA Ladder Marker (20~500 bp); Lane 2: DNA fragments of 100~200 bp were purified from an agarose gel. D. Fragments were reassembled without primers. Lane 1: Wide Range DNA Marker (500~12,000 bp); Lane 2: DNA fragments were reassembled into a full-length gene by 60 cycles without primers. E. The reassembled full-length products were amplified by the standard PCR. Lane 1: Wide Range DNA Marker (500~12,000 bp); Lane 2: PCR product with primers.ScreeningThe resulting library of BceGO mutants were expressed into 96 deep-well plates (containing 0.6 ml Luria-Bertani medium) and transferred onto Luria-Bertani agar plates as corresponding copies, followed by an overnight growth (37 °C, 300 rpm). When the cultures grew to saturation, both IPTG (at a final concentration of 0.1 mM) and the bacteriophage T7 (above 100 particles per cell) were added into 96 deep-well plates to synchronize the induction of recombinant mutants with the release of the lysis of the host E.coli DH5α at 37 °C with shaking for 6 h.",
    "The enzyme-coupled colorimetric assay (200 µl) was performed as follows:159 µl of lysis cell extracts20 µl of 50 mM glyphosate (at a decreasing substrate concentration gradient in sequential rounds of screening system)20 µl of 0.32 mg/ml o-dianisidine dihydrochloride1 µl of 5 unit/ml horseradish peroxidase Then incubated at 25 °C for 8 hThe absorbance change at 450 nm for each well in the microtiter plates was measured and compared with the control (harboring wild-type BceGO or containing the empty vector pGEX-6P-1). Mutants that outperformed the wild-type were chosen for further activity analysis (Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140930/20140930203154_1431.jpgFigure 5. The screening process of glycine oxidase mutant library"
  ],
  "subjectAreas": [
    "Microbiology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}