{
  "id": 19939,
  "origin_website": "Wiley",
  "title": "Establishment of Humanized Mice from Peripheral Blood Mononuclear Cells or Cord Blood CD34+ Hematopoietic Stem Cells for Immune-Oncology Studies Evaluating New Therapeutic Agents",
  "procedures": [
    "HIS reconstitution using cord blood–derived huCD34+ HSCs in sublethally irradiated immunodeficient mouse strains is described in detail in this protocol. After huCD34+ HSC engraftment into NOG or NOG-EXL mice, subcutaneous implantation of PDX tumors into these mice generates a tumor-bearing humanized mouse model (please refer to Fig. 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpph.77#cpph77-fig-0001] for a schema).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/44ea3cf5-6c00-4b45-9824-a1259f317cbf/cpph77-fig-0001-m.jpg</p>\nFigure 1\nStudy schema for huCD34+ HSC-HIS-PDX study. Four- to six-week-old immunodeficient mice are irradiated and intravenously injected with huCD34+ HSCs, and in parallel, a cohort of immunodeficient mice is implanted SC with stock PDX for rederivation. At 10 to 12 weeks post-transplant of the HSCs, mice are bled for assessment of chimerism in the periphery, followed by “warm” PDX implant. Mice are monitored for tumor growth and then randomized into study groups for subsequent dosing. At the end of the study, terminal analysis is performed as required.\nMaterials\n4- to 7-week-old female NOG (NOD.Cg-Prkdcscid Il2rgtm1Sug/JicTac) or NOG-EXL [NOD.Cg-Prkdcscid Il2rgtm1Sug Tg (SV40/HTLV-IL3, CSF2)10-7Jic/JicTac] mice (Taconic), housed in individually ventilated microisolator cages\nCryopreserved cord blood huCD34+ HSCs, 1 × 106/vial (Lonza or equivalent)\n1× phosphate-buffered saline (PBS; Invitrogen)\nRPMI-1640 medium (ATCC, cat. no. 30-2001)\nDiet gel or other suitable feed (Tekland)\nCryopreserved PDX tumors\nNude mice: Hsd: Athymic Nude-Foxn1nu (Envigo; optional)\nIrradiation cages\nIrradiation source (e.g., RS 2000 Biological Research Irradiator, Rad Source Technologies)\n37°C water bath\n15-ml polypropylene tubes\nClass II biosafety cabinet (BSC)\nStandard tabletop centrifuge\nHematocytometer, trypan blue, and light microscope or automated cell counter (e.g., Cellometer Auto 2000, Nexcelom Bioscience)\n1-cc tuberculin syringes with 25-G × ⅝-in. needle\nScale\nScalpel\nForceps\nIsoflurane anesthesia machine\nVernier or digital calipers\nK2EDTA tubes\nScissors\nDigital calipers\nAdditional reagents and equipment for flow cytometry and phenotyping (see Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpph.77#cpph77-prot-0003]), subcutaneous tumor implantation, and mouse euthanasia",
    "1. Approximately 4 hr prior to inoculation, sublethally irradiate 4- to 7-week-old female NOG or NOG-EXL mice in irradiation cages with 175 cGy whole-body irradiation from an irradiation source.\n2. Thaw cryopreserved cord blood huCD34+ HSCs (1 × 106 CB-CD34+ cells per vial for 8 to 10 mice) in a 37°C water bath until a sliver of ice remains. Then, transfer cells to a 15-ml polypropylene tube in a class II BSC and wash twice in 10 ml of 1× PBS at room temperature, with centrifugation for 5 min at 300 × g. Resuspend cells in 0.5 to 1 ml RPMI-1640 medium and count viable cells either manually, using a hematocytometer, trypan blue, and a light microscope, or with an automated cell counter.\n3. Adjust concentration of huCD34+ HSCs by resuspension to 6 × 105 cells/ml in RPMI-1460 and store cells briefly on ice prior to injection. Using a 1-cc tuberculin syringe with a 25-G × ⅝-in. needle, inject 0.2 ml (1.2 × 105 HSCs) into lateral tail vein of each irradiated mouse by intravenous (IV) injection.\n4. Monitor animals via clinical observation and record body weight at days 0, 3, 6, and 8 of the humanization period and once weekly thereafter for 3 months.\nBody weight is monitored to ensure that mice recover from irradiation because they can start losing body weight due to development of xGVHD.\n5. Provide mice with diet gel or other suitable feed for 2 weeks during recovery after irradiation. Provide water ad libitum.\n6. After 10 to 12 weeks, evaluate HIS reconstitution by flow cytometry every 2 weeks (see Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpph.77#cpph77-prot-0003]).",
    "7. At the time of humanization, thaw cryopreserved PDX tumors in a 37°C water bath, implant subcutaneously (SC) into a parallel cohort of immunocompromised mice (nude or NOG) bilaterally while under isoflurane anesthesia, and monitor for growth using Vernier or digital calipers (see Current Protocols article; Verma, Ritchie, & Mancini, 2017[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpph.77#cpph77-bib-0015]).\nUsing either scissors or a scalpel, an incision is made to create a pocket to insert the PDX with forceps. Incisions are closed using staples.\nThe timing and mouse cohort size for rederivation of a cryopreserved PDX are dependent on the take rate and growth kinetics of the specific PDX model.\nThese “stock mice” will provide the “warm” growing tumor that will later be implanted directly into humanized mice (refer to Fig. 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpph.77#cpph77-fig-0001] and step 9).\n8. At 10 and 12 weeks post-transplant of huCD34+ HSCs, assess human chimerism in circulating cells by collecting ∼100 µl peripheral blood from mice via the facial vein into K2EDTA tubes and prepare cells for flow cytometry phenotyping (refer to Figs. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpph.77#cpph77-fig-0002] and 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpph.77#cpph77-fig-0003] for data and to Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpph.77#cpph77-prot-0003] for phenotyping details).\nBlood can be drawn from different sites depending on institutional approval.\nNOG-EXL mice undergo engraftment more efficiently than NOG mice. Circulating levels of huCD45+ cells in the periphery of mice are expected to reach 25% of total circulating live cells by 10 to 12 weeks, where up to 10% of CD45+ cells are CD3+ T cells.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/41d6afde-bce5-4e52-83cc-ff8b7bc254cc/cpph77-fig-0002-m.jpg</p>\nFigure 2",
    "NOG-EXL mouse strain shows superior engraftment with cord blood–derived CD34 cells compared to NOG mouse strain. Four- to six-week-old NOG (left) or NOG-EXL (right) mice were irradiated and intravenously injected via tail vein with 1–1.2 × 105 CD34 cells. Nine different CB-CD34 donors were utilized for implantation. At weeks 8, 10, 12, and 15 post-injection, 100 µl blood was collected, and the percentage of huCD45+ cells in the periphery was detected using flow cytometry. Each data point represents an individual mouse, the horizontal line represents the median, and the error bars represent the interquartile range.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/2b967a65-723e-4bdc-a081-9bffcdca7242/cpph77-fig-0003-m.jpg</p>\nFigure 3\nNOG-EXL mouse strain has higher CD33 levels in periphery in comparison to NOG mouse strain. No differences in CD3 and CD19 levels are observed. Four- to six-week-old mice were irradiated and intravenously injected via tail vein with 1–1.2 × 105 CD34 cells. At weeks 8, 10, 12, and 15 post-injection, immune cell lineage development was evaluated by determining the levels of huCD3+, huCD19+, and huCD33+ cells in circulation using flow cytometry. Each data point represents an individual mouse, the horizontal line represents the median, and the error bars represent the interquartile range.\n9. To generate humanized PDX mice, harvest PDX tumors from stock mice (see step 7) using a scalpel. Generate 5 × 5 × 5–mm fragments using scissors and implant SC into flank of the humanized mice under isoflurane anesthesia.\nFor PDX tumors with slower growth kinetics, tumors may be implanted into humanized mice as early as 9 weeks to avoid longer study timelines. Note that stock tumors could range in size from 500 to 1500 mm2, with variation based on the growth rate in the stock mice.",
    "10. Following subcutaneous tumor implantation, monitor tumor growth kinetics by digital caliper measurements of length and width to calculate volume, with the first measurements taken on the seventh day of tumor implantation. Record tumor volume measurements (TVMs) at two timepoints to ensure that tumors are growing prior to randomization into study groups, performed when tumor volumes range from 80 to 150 mm3, as shown in Figure 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpph.77#cpph77-fig-0004]. Continue TVMs twice weekly throughout duration of the study (see Fig. 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpph.77#cpph77-fig-0005] for example data). Calculate tumor volume using the following formula:\n         imgsrc:/cms/asset/21e31240-5db5-4e9b-9dbc-fdcf2f15503d/cpph77-math-0001.png\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/9656888b-979d-46b2-9031-9f1d5ff8a6c5/cpph77-fig-0004-m.jpg</p>\nFigure 4\nNo significant impact is observed on tumor growth kinetics in huCD34+ HSC-HIS mice. Four- to six-week-old mice were irradiated and intravenously injected via tail vein with 1–1.2 × 105 CD34+ cells. Two CB-CD34 donors were used. After tumor implantation, PDX volume measurements were taken and used to randomize mice in the study.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/6ca60b3e-e2d5-4640-85ad-a664cd89fdca/cpph77-fig-0005-m.jpg</p>\nFigure 5\nDonor dependent antitumor efficacy in HIS CD34 ImmunoGraft model. Four- to six-week-old mice were irradiated and intravenously injected via tail vein with 1–1.2 × 105 CD34+ cells. Two CB-CD34 donors were used. After tumor implantation, PDX volume measurements were taken and used to randomize mice, and dosing commenced with nivolumab at 80 to 150 mm3. Tumor growth was monitored by caliper measurements at 3- to 4-day intervals. The graphs on the left show mean tumor volumes, and the graphs on the right show the individual tumor volumes of the mice in the groups, n = 5-7/group.\n11. At the endpoint of the study, euthanize mice as per IACUC-approved protocol and collect tumors for downstream analysis.\nFor TIL evaluation by flow cytometry, see Support Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpph.77#cpph77-prot-0004] (please see Fig. 6[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpph.77#cpph77-fig-0006] for data). The gating strategy defined for T-cell subsets and the myeloid population is shown in Figures 7[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpph.77#cpph77-fig-0007] and 8[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpph.77#cpph77-fig-0008], respectively.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/91af8f3c-7c6e-443e-9db9-84a32631d3a9/cpph77-fig-0006-m.jpg</p>",
    "Figure 6\nTumor-infiltrating immune T-cell and myeloid cell subsets detected in huCD34+ HSC-HIS-PDX in NOG-EXL mice. Single-cell tumor digests were evaluated by flow cytometry for tumor infiltration of myeloid cell subsets, including CD3+ cells and MDSCs, and T-cell subsets. Average ± SEM is shown in each instance for groups of mice of N = 3-6.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/4c3fcfb7-4e92-44c7-a436-906ac57f6139/cpph77-fig-0007-m.jpg</p>\nFigure 7\nGating strategy for T-cell subset identification by flow cytometry. A representative flow cytometry gating strategy for analyzing T-cell subsets is shown. Cells were first gated on total live cells and then on CD45+ and CD3+ lymphocytes infiltrating tumors. Next, bivariate plots for CD4+CD8+ cells were generated from the CD3+ cell population. Granzyme B+ and PD-1+ cells were gated from the CD8+ cell population.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/0176b5b4-ab7a-4606-ae00-3669cff018d3/cpph77-fig-0008-m.jpg</p>\nFigure 8\nGating strategy for myeloid subpopulation identification by flow cytometry. A representative flow cytometry gating strategy for analyzing myeloid subsets is shown. Cells were first gated on total live cells and then on CD45+ leukocytes in the tumors. Next, bivariate plots for CD11b+CD33+ cells were generated from the CD45+ cell population. CD11b+CD33+ co-expressing cells were gated and further interrogated for macrophages (CD14+HLA-DR+), M-MDSCs (CD14+HLA-DR-), and G-MDSCs and immature MDSCs (CD14-HLA-DR-).",
    "This protocol describes generation of humanized mice by injecting PBMCs isolated from healthy adult donors. After a PDX or CDX is implanted SC, PBMCs are transplanted within several days via IV injection. Tumor growth kinetics are recorded, and PBMC engraftment is monitored as described in Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpph.77#cpph77-prot-0003]. For PBMC-humanized mice, no irradiation is used, as this would enhance the onset and severity of xGVHD.\nAdditional Materials (also see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpph.77#cpph77-prot-0001])\nCryopreserved PDX or CDX tumors\n4- to 7-week-old female NOG (NOD.Cg-Prkdcscid Il2rgtm1Sug/JicTac) or NOG-B2M (Taconic) mice or NSG (NOD.Cg-Prkdcscid Il2rgtm1Wjl/SzJ) or NSG-B2M (NOD.Cg-B2mtm1Unc Prkdcscid Il2rgtm1Wjl/SzJ) mice (The Jackson Laboratory), housed in individually ventilated microisolator cages\nCryopreserved PBMCs, isolated from normal human donor leukopaks by density gradient centrifugation with Ficoll-Paque Premium (Thomas Scientific) as per manufacturer's recommendation\n1. Implant cryopreserved PDX or CDX tumors SC into 4- to 7-week-old female NOG, NOG-B2M, NSG, or NSG-B2M mice prior to humanization with PBMCs.\nCryopreserved PDX tumors must be thawed and implanted into mice for tumor growth for 8 to 9 weeks prior to humanization using PBMCs (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpph.77#cpph77-prot-0001] for details). CDX tumors must be thawed and implanted 1 to 7 days prior to humanization.\nTiming of PBMC implantation with respect to tumor implantation may vary, and in some instances, it may be preferable for PBMC implantation to precede tumor inoculation.\n2. Thaw cryopreserved PBMCs in a 37°C water bath and transfer cells to a 15-ml polypropylene tube in a class II BSC. Wash twice in 10 ml of 1× PBS by centrifugation for 5 min at 350 × g, room temperature. Resuspend cells in 0.5 to 1 ml RPMI-1640 medium and enumerate viable cells either manually, using a hematocytometer, trypan blue, and a light microscope, or with an automated cell counter.",
    "Process in batches of five vials at a time. Store unthawed vials on dry ice until use to ensure proper thawing.\n3. Adjust PBMC concentration by resuspension to 5 × 107 cells/ml in RPMI-1640 and store on ice briefly prior to injection. Using a 1-cc tuberculin syringe with a 25-G × ⅝-in. needle, inject 0.2 ml (1 × 107 PBMCs) into lateral tail vein of each mouse by IV injection.\n4. Monitor animals via clinical observation and record body weight twice weekly for signs of xGVHD throughout duration of the study.\nPBMC-engrafted mice can be immediately used in experiments (see Fig. 9[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpph.77#cpph77-fig-0009]).\nPBMCs engrafted in NOG mice will reach the endpoint by ∼4 weeks due to development of xGVHD; use of B2M-/- mice increases longevity to ≥8 weeks.\nxGVHD can be monitored by assessing body weight loss, dehydration, and lethargy and by body condition scoring.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/62fba03b-ddfa-48a2-a869-735cf6a591f6/cpph77-fig-0009-m.jpg</p>\nFigure 9\nPBMC engraftment in immunodeficient mouse strains. Six- to ten-week-old NOG and NOG-B2M mice were intravenously injected via tail vein with 2.5 × 106, 5 × 106, and 1 × 107 doses of PBMCs from donor 1. Peripheral blood was collected each week. (A) The percentage of huCD3+ cells in the periphery was detected using flow cytometry. (B) The survival of mice implanted with 1 × 107 cells was compared between NOG and NOG-B2M. Mice were euthanized when signs of severe xGVHD onset occurred.\n5. Collect 100 µl peripheral blood from mice via the facial vein into K2EDTA tubes weekly or at least every 2 weeks post–PBMC implant for assessment of humanization by flow cytometry phenotyping (see Figs. 9[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpph.77#cpph77-fig-0009] to 11[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpph.77#cpph77-fig-0011] and Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpph.77#cpph77-prot-0003]).\nBlood can be drawn from different sites depending on institutional approval.",
    "NOG mice have higher levels of circulating CD3+ cells in comparison to NOG-B2M or NSG-B2M mice, as demonstrated in Figures 9[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpph.77#cpph77-fig-0009] and 10[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpph.77#cpph77-fig-0010].\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/1649d03f-c4be-4d86-8dee-5c69e29bf7bd/cpph77-fig-0010-m.jpg</p>\nFigure 10\nNOG-B2M mice permit prolonged T-cell expansion without xGVHD in multiple donors after IV engraftment of PBMCs. PBMCs (1 × 107) from multiple donors were implanted into NOG or NSG-B2M mice in parallel, and CD3+ T-cell engraftment levels were assessed over time by flow cytometry for 7 to 8 weeks. Mice were euthanized when signs of terminal xGVHD were observed.\n6. Following subcutaneous tumor implantation, monitor tumor growth kinetics by digital caliper measurements of length and width to calculate tumor volume (typical results are shown in Fig. 12[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpph.77#cpph77-fig-0012]). Randomize mice into study groups within 7 days of CDX implantation or when PDX tumor volumes are in the range of 80 to 150 mm3. Continue TVMs twice weekly throughout duration of the study. Calculate tumor volume using the following formula:\n         imgsrc:/cms/asset/9284a8a9-3a1b-417f-820a-05d0bd0c5726/cpph77-math-0002.png\n7. At the study endpoint or another predetermined time point, euthanize tumor-bearing humanized mice as per IACUC-approved protocol and collect tumors for downstream analysis.\nTumors are manually and enzymatically processed using a scalpel and a tumor dissociation kit, respectively, to obtain single-cell suspensions (see Support Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpph.77#cpph77-prot-0004]). TILs can be detected by performing flow cytometry analysis on single-cell suspensions using the desired panel for immune subsets of interest (refer to Support Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpph.77#cpph77-prot-0004] and to Fig. 13[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpph.77#cpph77-fig-0013] for data analysis).",
    "This protocol provides a detailed procedure for assessment of engraftment levels of chimerism in immunodeficient mice implanted with huCD34+ HSCs (Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpph.77#cpph77-prot-0001]) or PBMCs (Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpph.77#cpph77-prot-0002]). The percent chimerism is calculated by flow cytometric assessment of levels of human pan-leukocyte marker (CD45) in the peripheral blood in comparison to total live cells, as follows:\n         imgsrc:/cms/asset/9f5206da-22de-489b-b6d6-8bc780470655/cpph77-math-0003.png\nimgsrc:/cms/asset/e990479b-01fd-47f9-819b-8518b7ca8d48/cpph77-math-0004.png\nMaterials\nMouse whole blood, freshly collected via facial vein into K2EDTA tubes (see Basic Protocols 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpph.77#cpph77-prot-0001] and 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpph.77#cpph77-prot-0002])\nStreck CD-Chex™ Plus Immunophenotyping Control (Fisher Scientific, cat. no. 23-046-500D)\nHuman BD Fc Block (BD Biosciences, cat. no. 564220)\nFACS buffer: MACSQuant Running Buffer (Miltenyi Biotec, cat. no. 130-092-747) + 5% (v/v) fetal bovine serum (FBS)\nFluorochrome-labeled antibodies: antibodies to murine CD45 and human CD45 (clone HI30), CD3 (clone UCHT1), CD4 (clone RM4-5), CD8 (clone SK1), CD33 (clone p67.6), and CD19 (clone HIB19; all Biolegend; see Table 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpph.77#cpph77-tbl-0002])\n1× red blood cell–lysing buffer (diluted from 10×; BD Pharm Lyse, BD Biosciences, cat. no. 555899)\n7-Aminoactinomycin D (7-AAD; Biolegend, cat. no. 420403)\n96-deep-well plates (Analytical Sales and Services, cat. no. 59623-23)\n5-ml Falcon round-bottom tubes (VWR, cat. no. 60819-820)\nTube rocker\nAluminum foil\n5°C centrifuge with plate rotor (Eppendorf 5810 or equivalent)\nFlow cytometer [MACSQuant® Analyzer 10 (Miltenyi Biotec) or equivalent flow analyzer with three-laser (405/488/635 nm) configuration]\nFlow cytometry analysis software (FlowJo V8 or equivalent)\nNOTE: A maximum of 150 µl blood can be drawn weekly from each mouse, as per IACUC guidelines.\nTable 2.\n                Panels for Flow Cytometric Phenotyping of Engrafted Cells in Human Immune System–Reconstituted Mice\ntable:\n﻿Humanization cell source,Engraftment panel,Time post-implant for engraftment checks to begin\nCD34+ HSCs,\"huCD45, muCD45, huCD3, huCD4, huCD8, huCD33, huCD19, live/dead marker\",10 weeks\nPBMCs,\"muCD45, huCD3, huCD4, huCD8, live/dead marker\",2 weeks",
    "1. Aliquot 60 μl mouse whole blood per sample into each well of a 96-deep-well plate. Include 50 μl Streck CD-Chex™ Plus Immunophenotyping Control as a positive control in first well and pool small aliquots of blood for a 60-μl unstained negative control.\n2. Incubate samples with 0.6 μl Human BD Fc Block + 0.14 μl FACS buffer (2 μl total; 2.5 μg/million cells) for 10 min.\n3. Prepare a flow cytometry antibody staining cocktail in a 5-ml Falcon round-bottom tube using fluorochrome-labeled antibodies at the manufacturer's recommended concentration in FACS buffer as per the flow panel being tested. Add antibody staining cocktail to all whole-blood samples, followed by incubation for 30 min at room temperature in the dark.\nThe antibody concentrations may be optimized via a titration study.\n4. Add 1.25 ml of 1× red blood cell–lysing buffer per sample. Incubate samples at room temperature on a tube rocker for 20 min, covered with aluminum foil.\n5. Centrifuge samples for 5 min at 388 × g, 5°C, and discard supernatant.\n6. Wash off excess antibody and lysing buffer by adding 1.25 ml FACS buffer per sample, centrifuging for 5 min at 388 × g, 5°C, and discarding supernatant. Repeat this step for a total of two washes. After the last wash, discard supernatant and resuspend each cell pellet in a final total volume of 150 μl FACS buffer.\n7. Add 1 μl viability stain (7-AAD) per sample. Incubate for 5 min at room temperature in dark.\n8. Acquire samples using a flow cytometer, ensuring collection of 20,000 gated live-cell events.\nSamples can be acquired in either plates or tubes depending on the flow cytometer being used.\n9. Perform flow cytometry data analysis with flow cytometry analysis software (Fig. 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpph.77#cpph77-fig-0003]).",
    "Flow cytometric assessment of TILs in tumor-bearing humanized mice (Basic Protocols 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpph.77#cpph77-prot-0001] and 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpph.77#cpph77-prot-0002]) is described in detail in this support protocol. At the study endpoint, tumors are harvested from the humanized mice and dissociated to obtain a single-cell suspension for staining and marker assessment.\nAdditional Materials (also see Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpph.77#cpph77-prot-0003])\nSurgically excised PDX or CDX tumors (see Basic Protocols 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpph.77#cpph77-prot-0001] and 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpph.77#cpph77-prot-0002]), collected from mice in tubes with MACS Tissue Storage Solution (Miltenyi Biotec, cat. no. 130-100-008) and kept on ice until processing\nTumor Dissociation Kit, human (Miltenyi Biotec, cat. no. 130-095-929), including Enzymes A, H, and R (see recipes[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpph.77#cpph77-rec-0001])\nRPMI-1640 medium (ATCC, cat. no. 30-2001)\n1× red blood cell–lysing buffer (diluted from 10×; Miltenyi Biotec, cat. no. 130-094-183)\nClass II BSC\nSmall petri dishes\nForceps\nScalpel\ngentleMACS C Tubes (Miltenyi Biotec, cat. no. 130-096-334)\ngentleMACS Dissociator (Miltenyi Biotec, cat. no. 130-093-235) or gentleMACS Octo Dissociator with Heaters (Miltenyi Biotec, cat. no. 130-096-427)\n15- and 50-ml conical tubes (Thermo Fisher, cat. no. 339650 and cat. no. 339652, respectively)\nMACS SmartStrainers (30 µm; Miltenyi Biotec, cat. no. 130-098-458)\nRoom-temperature centrifuge (Eppendorf 5810 or equivalent)\nHematocytometer, trypan blue, and light microscope or automated cell counter (e.g., Cellometer Auto 2000, Nexcelom Bioscience)\n1. In a class II BSC, transfer each surgically excised PDX or CDX tumor to a small petri dish. Using a forceps and scalpel, dissect each tumor into pieces of 2 to 4 mm3 in the dish.\n2. Transfer tumor fragments into a gentleMACS C Tube and add Enzymes A, H, and R from Tumor Dissociation Kit according to the manufacturer's instructions. Place tube in a gentleMACS Dissociator or gentleMACS Octo Dissociator with Heaters and use appropriate setting based on tumor toughness according to the manufacturer's instructions.",
    "3. After completion of tumor digestion, empty contents of the C Tube into a 15-ml conical tube, strain into a 50-ml conical tube using a MACS SmartStrainer, and add 10 ml RPMI-1640 medium.\nIf filtration stops before the contents have completely filtered through, mix the unfiltered sample with a P1000 pipet. If filtration is still not proceeding, add a new filter over the opening of the 50-ml tube and carefully transfer the contents of the first filter into the second one.\n4. When filtration has stopped, cap tube and centrifuge 10 min at 300 × g. Remove supernatant and add 2 ml of 1× 1× red blood cell–lysing buffer per sample to dissociated tumor cells.\n5. Incubate cells for 20 min on a tube rocker at room temperature. Centrifuge 5 min at 350 × g, 5°C, and discard supernatant.\n6. Add 2 ml FACS buffer, centrifuge as in step 5, discard supernatant, and resuspend cells in 0.5 to 1 ml FACS buffer. Count cells with a hematocytometer, trypan blue, and light microscope or an automated cell counter and aliquot 500,000 live cells in 60 μl per sample per well of a 96-deep-well plate.\n7. Incubate cells with 0.3 μl Human BD Fc Block + 0.7 μl FACS buffer (1 μl total; 2.5 μg/million cells) for 10 min.\n8. Prepare a flow cytometry antibody staining cocktail in a 5-ml Falcon round-bottom tube using fluorochrome-labeled antibodies at the manufacturer's recommended concentration in FACS buffer as per the flow panel being tested. Add antibody staining cocktail to cells, followed by incubation for 30 min at 4°C in the dark.",
    "9. Wash cells twice with 1.25 ml FACS buffer by centrifugation for 5 min at 350 × g, 5°C. After the last wash, discard supernatant and resuspend each cell pellet in a final total volume of 150 μl FACS buffer.\n10. Add 1.5 μl viability stain (7-AAD) and incubate at room temperature in dark for 5 min.\n11. Acquire samples using a flow cytometer, ensuring collection of a minimum of 200,000 total events.\n12. Perform flow cytometry data analysis with flow cytometry analysis software as per defined gating strategy (Figs. 7[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpph.77#cpph77-fig-0007] and 8[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpph.77#cpph77-fig-0008])."
  ],
  "subjectAreas": [
    "Pharmacology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}