{
  "id": 7847,
  "origin_website": "Bio",
  "title": "In vivo Drug Screening to Identify Anti-metastatic Drugs in <em>Twist1a-ER<sup>T2</sup></em> Transgenic Zebrafish",
  "procedures": [
    "Zebrafish spawning (Day 0) On the night before collecting the embryos, arrange pairs of male xmrk fish and female  Twist1a-ERT2 fish in a zebrafish breeding tank with a divider.Early in the morning, remove the divider to allow the fish to spawn.Scoop out the embryos with a plastic tea strainer.Transfer the embryos into a 150 mm plastic dish containing E3 medium.Remove dead embryos with a pipette.Maintain the embryos for six days in an incubator set at 27 °C.Change the E3 medium and remove dead embryos with a pipette daily.Notes:   Adult Twist1a-ERT2 and xmrk transgenic zebrafish lines were maintained in a recirculating aquaculture system with an ambient water temperature of approximately 28 °C in Singapore. 6–8 pairs of female heterozygous  Twist1a-ERT2 transgenic fish and male heterozygous xmrk transgenic fish were crossed in the breeding tank (one pair per tank). Young adult zebrafish (3–9 months of age) were preferentially used for the crossing. Electric lighting in the facility was switched on from 07:00 to 19:00. Brine shrimps were fed to both zebrafish lines five times a day, at 08:30, 10:30, 12:30, 14:30, and 16:30. The Fish facility at the National University of Singapore connects to the outdoors. Therefore, the facility does not have air conditioning and the room temperature in the facility fluctuates between 25 °C and 30 °C. Embryos and larvae are maintained in an incubator set at 27 °C. Therefore, all larvae zebrafish were maintained at 27 °C to ensure consistency of the zebrafish development.  If a specific developmental stage is required, the embryos should be grown at the optimal condition of 28.5 °C, in order to allow a standard development of the embryos and larvae (Westerfield, 2007).  Feeding of the zebrafish larvae began at 5 dpf.",
    "A pinch of micron powder was diluted in 1 mL of E3 medium and added to the zebrafish larvae every morning. The zebrafish larvae were transferred into each well of a 6-well plate at a time point between 8 and 11 dpf, and a few drops of the E3 medium were added to each well every morning.  Collect  Twist1a-ERT2/xmrk  double transgenic zebrafish (Day 6)  Transfer the zebrafish larvae into a 50 mL tube.To anesthetize the fish, add 2% (v/v) phenoxyethanol to the E3 medium with the micron powder that contains the fish. Thus, the final concentration of phenoxyethanol is 0.02%.Array the fish on a lid of a 150 mm plastic dish.Visualize under a fluorescence microscope and use a pipette to collect the fish expressing green fluorescent protein (GFP) in the skin (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4673/bioprotoc-13-10-4673-g002.jpgFigure 2. A  Twist1a-ERT2/xmrk  double transgenic zebrafish expresses green fluorescent protein (GFP) in a skin-specific manner (A) and mCherry in a liver-specific manner (B).  Representative images of GFP and mCherry signals in  Twist1a-ERT2/xmrk  double transgenic zebrafish at 6 days post-fertilization (dpf). Scale bar, 200 μm.Among the GFP-positive fish, visualize under a fluorescence microscope and use a pipette to collect those expressing mCherry in the liver (Figure 2).Transfer the collected fish into a 150 mm plastic dish containing E3 medium.Maintain the fish for two days in an incubator set at 27 °C.Notes:  At 6 dpf, Tg (fabp10a:mCherry-T2A-Twist1a-ERT2) begins to express the gene coding mCherry-T2A-Twist1a-ERT2 in a liver-specific manner. Tg (fabp10a:TA; TRE:xmrk; krt4:GFP) expresses GFP in a skin-specific manner. Therefore, Twist1a-ERT2/xmrk double transgenic zebrafish is indicated as mCherry- and GFP-positive in the liver and skin, respectively. The screening process is divided into two steps. Firstly, zebrafish possessing the xmrk transgene are screened at 3–5 dpf and then the xmrk transgenic zebrafish possessing the Twist1a-ERT2 transgene are screened at 6 dpf.",
    "The zebrafish larvae should not be overcrowded in the 150 mm plate, since overcrowding negatively affects their viability. By 6 dpf, 100–300 zebrafish larvae can be maintained in the 150 mm plate. After 6 dpf, a maximum of 100 zebrafish larvae should be maintained in the 150 mm plate. Primary tumor induction (Day 8) Aliquot a maximum of 100 zebrafish larvae into a 150 mm plate along with 100 mL of E3 medium.At 8 dpf, treat the fish with 30 μg/mL of doxycycline in E3 medium for three days.Change the E3 medium containing doxycycline every two days.Note: 100 μL of doxycycline stock solution (30 mg/mL) is added to 100 mL of E3 medium. Chemical treatment (Day 11) Aliquot approximately 20 zebrafish larvae into each well of a 6-well plate with 8 mL of E3 medium containing doxycycline (30 μg/mL) at a time point between 8 and 11 dpf.Add each test chemical to each well of the plate at a final concentration of 5 μmol/L.Notes:All test chemicals are dissolved in DMSO at a concentration of 10 mmol/L (stock solution). 4 μL of each stock solution (10 mmol/L) is diluted with 100 μL of E3 medium and added into each well of the plate containing 8 mL of E3 medium. Metastatic dissemination induction in the presence of a chemical (Day 11.5) Beginning 12 h after the addition of the test chemical, treat the fish with 0.1 μmol/L of 4-OHT in E3 medium for five days.Change the E3 medium containing doxycycline, 4-OHT, and the test chemical every two days.Notes:  The quality of the E3 medium is critical for the survival of the zebrafish larvae. The fish excrete waste materials including urine. Waste materials and leftover foods are harmful for the viability of the fish.",
    "Thus, the E3 medium should be changed before a high concentration of waste materials is reached. We recommend changing the E3 medium every two days after 8 dpf."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}