{
  "id": 7771,
  "origin_website": "Bio",
  "title": "Preparation and Characterization of DNA-assembled GRS-DNA-CuS Nanodandelions",
  "procedures": [
    "Preparation of DNA-assembled GRS-DNA-CuS nanodandelions   Synthesis of gold nano-rods (GRs)  Mix 5 mL of HAuCl4·4H2O (0.2 mg/mL) with 5 mL of CTAB (0.2 M).Dilute 20 μL of fresh NaBH4 (0.6 M) in 1 mL of ice-cold water and add it to the mixture under vigorous stirring at 1793  × g  for 1 min. Then, the  seed solution  CTAB-stabilized gold core is obtained.Add 0.9 g of CTAB and 0.15 g of NaOL into 25 mL of double-distilled water (ddH2O) at 50°C under magnetic stirring for 1 h. Note: ddH2O should be warmed to 50°C in advance.  Cool the solution from the previous step to 30°C and add 2.4 mL of AgNO3 (4 mM) and 25 mL of HAuCl4·4H2O (0.4 mg/mL). Let them stand at 30°C for 10 min and stir again for 15 min at 747  × g  . Note: Add the ice to the water bath in order to cool down the hot water. Real-time monitor the temperature of water bath by thermometer so that the reaction temperature is kept at 30°C.  Add 0.24 mL of HCl (37 weight percent) and stir for another 15 min at 747  × g  . Then, add 125 μL of AA (0.064 M) and stir for 1 min to obtain the  growth solution  .Let the obtained growth solution stand for 12 h at 30°C for GR growth. Collect the resulting products by centrifugation at 9,710  × g  for 20 min, wash with 40 mL of ddH2O, re-dissolve into 50 mL of ddH2O, and obtain gold nano-rods (GRs). Note: Rotating speed should be 9,710 × g in order to totally collect GRs.  Finally, mix 5 mL of GRs solution with 5 mL of CTAC (0.2 M) and centrifuge at 11,203  × g  for 10 min. Wash the precipitate with 10 mL of CTAC (0.",
    "1 M) three times and re-disperse them in 10 mL of CTAC solution (0.1 M) for completely replacing CTAB. CTAC-capped GRs are obtained. Note: Both the long sonication time and high solution temperature are helpful to completely dissolve CTAC and CTAB in the ddH2O. The better temperature for dissolving them is 45°C. Optimal sonication time is 30 min. In addition, during the displacement of CTAB with CTAC, the samples should be dispersed by sonication before proceeding to the next step, as they easily adsorb on the surface of tube.   Prepare Raman molecule–modified GR  Mix 10 mL of CTAC-capped GRs with 500 μL of Raman molecule 4-NBT (1 mM) under vigorous ultrasonication in an ice-water bath in an ultrasonic cleaner for 15 min. Note: Raman molecule 4-NBT should be dissolved in DMSO in advance. The concentration of 4-NBT is 1 mM.  Add 10 mL of CTAC (0.1 M) to the solution and centrifuge at 8,963  × g  for 10 min. Wash the precipitate with 10 mL of CTAC solution (0.05 M) twice and re-disperse the precipitate in 10 mL of CTAC solution (0.1M). The precipitate is  Raman molecule-modified GR  . Synthesis of GRS by modifying seed-mediated growth method  Sequentially add 2.5 mL of HAuCl4·4H2O (2 mg/mL) and 2.5 mL of AA (0.04 M) to 50 mL of CTAC (0.1 M).Add the mixture to 5 mL of Raman molecule-modified GR solution drop by drop under continuous sonication.Let the mixture solution stand at room temperature for 24 h, centrifuge at 4,481  × g  for 10 min, and re-disperse them in 50 mL of ddH2O. Then,  GRS  is obtained. Synthesis of single-stranded DNA (ssDNA)-modified GRS (GRS-ssDNA)  Centrifuge the obtained GRS (20 mL) at 7469  × g  for 10 min and wash twice with ddH2O.",
    "Then, add 200 μL of mPEG5k-SH (10 μM) to the GRS solution.Subsequently, add 20 mL Tween 20 (0.01 weight percent) to PEG-modified GRS solution, sonicate for 30 s, and severely mix by vortex. Repeat this step four times. Note: The processes including adding Tween 20, sonicating, and severely mixing by vortex should be repeated four times in order to completely remove the CTAC from the surface of PEG-modified GRS. Zeta potential of PEG-modified GRS should be changed from positive to negative.  Add 200 μL of single-stranded DNA (ssDNA, sequence: 5′-TAG GTG TAG TGA GGA AAA AAA AAA A-C6-SH-3′, 10 μM) and 2 mL of citrate sodium dihydrate (1 M) to the obtained GRS solution, and then mix them for 30 s by vortex. Let the solution stand at room temperature for 2 h. Note: 2.894 g of citrate sodium dihydrate is dissolved in 10 mL of ddH2O to obtain citrate solution (1 M).  Centrifuge the ssDNA-modified GRS, wash three times with ddH2O, and re-dissolve in 20 mL of 1× PBS.  GRS-ssDNA  is obtained. Synthesis of ultrasmall CuS PAs  Add 13.45 mg of CuCl2 and 20 mg of citrate sodium dihydrate to 100 mL of ddH2O.Add 8.68 mg of Na2S into the mixture from the previous step under stirring. Five minutes later, heat the reaction solution to 90 and stir for 15 min.Keep the citrate-modified CuS nanoparticles in ice-cold water for 30 min and store at 4 for less than one week. Note: Ultrasmall CuS nanoparticles should be prepared prior to use. The storage time of CuS at 4  should be no more than one week because CuS is easily degraded.",
    "Synthesis of the complementary single-stranded DNA (cssDNA)-modified CuS (CuS-cssDNA)  Add 380 μL of the complementary single-stranded DNA (cssDNA, 5′-TCC TCA CTA CAC CTA AAA AAA AAA A-C6-SH-3′, 10 μM) to 50 mL of CuS solution and gently shake at room temperature at the incubator shaker at 60 rpm for 12 h.Centrifuge the mixture at 232,580  × g  for 30 min and re-disperse in 50 mL of 1× PBS.  CuS-cssDNA  is obtained. Synthesis of GRS-DNA-CuS nanodandelions  Mix 20 mL of GRS-ssDNA with 10 mL of CuS-cssDNA and incubate at 37 for 12 h to generate GRS-DNA-CuS nanodandelions.Collect the GRS-DNA-CuS nanodandelions by centrifugation in 50 mL centrifuge tubes at 8,963  × g  for 10 min and re-dissolve in 20 mL of 1× PBS.Add 200 μL of mPEG5k-SH (10 μM) to GRS-DNA-CuS nanodandelions for improvement of their stability.Wash the PEG-modified GRS-DNA-CuS with 20 mL of 1× PBS and re-dissolve in 20 mL of 1× PBS. The whole procedure for preparation of GRS-DNA-CuS nanodandelions is illustrated in Figure 2 .imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4595/bioprotoc-13-02-4595-g002.jpg Figure 2. Flow chart of the whole procedure for preparation of GRS-DNA-CuS nanodandelions   Characterization of DNA-assembled GRS-DNA-CuS nanodandelions   Characterize the morphology  Dribble 10 µL of the obtained GRS-DNA-CuS solution onto the formvar-coated grid.Dry the sample at room temperature for 30 min.Monitor the morphology of GRS-DNA-CuS by transmission electron microscopy (TEM). Measure particle size  Dilute 5 μL of the obtained GRS-DNA-CuS into 1.5 mL of ddH2O.Add the sample to the cuvette without any bubbles.Insert the cuvette into the particle analyzer chamber.Detect the size of GRS-DNA-CuS using the Malvern laser particle size analyzer. Measure zeta potential  Dilute 5 μL of GRS-DNA-CuS nanodandelions into 1.5 mL of ddH2O.Add the sample to a capillary cell.Cover the capillary cell with a plastic cap.Place the capillary cell into the chamber of the zeta potential analyzer.",
    "Measure the zeta potential value of GRS-DNA-CuS (-32.2 mV) using the Malvern laser particle size analyzer. Measure Raman signal intensity of GRS-DNA-CuS nanodandelions  Dilute 5 μL of GRS-DNA-CuS nanodandelions in 150 μL of ddH2O.Drop 20 μL of the diluted GRS-DNA-CuS solution onto the foil-wrapped slide.Place slide in the instrument and measure Raman signal intensity of GRS-DNA-CuS by Renishaw inVia Raman microscope in StreamLine mode (5× objective, 62.6 mW) with 5 s of exposure time under 830 nm laser excitation, as shown in Figure 3 .imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4595/bioprotoc-13-02-4595-g003.jpg Figure 3. Process for measuring Raman signal intensity of GRS-DNA-CuS nanodandelions   Measure the photothermal effect of GRS-DNA-CuS nanodandelions and CuS PAs  Irradiate GRS-DNA-CuS nanodandelions and CuS nanoparticles (NPs) by 808 nm laser (2.8 W/cm2) for 4 min.Use a FLIR Ax5 camera to record the temperature changes in each group at an interval of 30 s during the laser irradiation. Measure the accumulation of GRS-DNA-CuS nanodandelions at tumor tissues  Intravenously inject GRS-DNA-CuS nanodandelions at the dose of 50 μmol/kg body weight into A549 tumor-bearing Balb/c male nude mice (approximately 20 g, 6 weeks old). Note: A549 cells (5 × 106 cells/mouse in 100 μL PBS) are subcutaneously injected into the back of Balb/c nude mice and allowed to grow to the tumor size of 125 mm3 for the imaging and therapeutic studies.  Collect Raman signals of GRS-DNA-CuS nanodandelions at the tumor tissues at 0, 1, 2, 4, 8, 12, and 24 h post-injection, by Renishaw inVia Raman microscope in StreamLine mode (5× objective, 62.6 mW) with 5 s of exposure time under 830 nm laser excitation. Measure the intratumoral penetration of GRS-DNA-CuS nanodandelions  Intravenously inject GRS-DNA-CuS nanodandelions (50 μmol/kg body weight) into A549 tumor-bearing Balb/c male nude mice (approximately 20 g, 6 weeks old).Irradiate the A549-tumors on Balb/c nude mice for 2 min at 2.",
    "8 W/cm2 under 808 nm laser at 12 h post-injection.Image the photoacoustic signals at the tumor tissues by photoacoustic imaging system at 0, 0.5, 6, and 12 h of post-laser irradiation Note: In the control group, tumors on mice are intratumorally infected with RS-DNA-CuS nanodandelions without NIR laser irradiation.   Evaluate the photothermal therapeutic efficiency of GRS-DNA-CuS nanodandelions  Intravenously inject GRS-DNA-CuS nanodandelions (50 μmol/kg body weight) into A549 tumor-bearing Balb/c male nude mice (approximately 20 g, 6 weeks old).Irradiate the tumors at 12 h after injection of GRS-DNA-CuS nanodandelions by the first 808 nm NIR laser. Note: This first 808 nm NIR laser irradiation is for the dissociation of GRS-DNA-CuS nanodandelions that are accumulated at the tumors.  Six hours later, tumors are irradiated again by the second 808 nm NIR laser. Note: This second 808 nm NIR laser irradiation is used for the tumor photothermal treatment.  Measure the tumor size by vernier caliper and calculate according to the equation: V = L × W2/2, where the L and W are the tumor size at the longest and widest point, respectively."
  ],
  "subjectAreas": [
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}