{
  "id": 2053,
  "origin_website": "Cell",
  "title": "An optimized protocol to analyze membrane protein degradation in yeast using quantitative western blot and flow cytometry",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nQuantification of protein degradation by western blot\nHere, we describe a method that takes advantage of the stability of GFP, which resists proteolytic degradation inside the vacuole lumen. When Ypq1-GFP is sent to the vacuole lumen, Ypq1 is rapidly degraded, whereas GFP stays intact. This is visible as a band shift from a ∼64 kDa full-length Ypq1-GFP band in +Lysine conditions to a 27-kDa free GFP band in –Lysine conditions (Figure 1[href=https://www.wicell.org#fig1]C).\nThis method can be used to quantify the degradation efficiency of mutant strains compared to the wild-type. As an example, here we test point mutants of Ypq1-GFP, which have previously been shown to have a reduced degradation compared to the wild-type (Arines et al., 2021[href=https://www.wicell.org#bib1]). The corresponding mutated regions were found to be part of putative regulatory regions that govern Ypq1 degradation.\nNote: Prior to starting the experiment, Ypq1-GFP in mutant strains can be checked for proper localization and stability using standard microscopy and western blot methods.\nStarter culture\nTiming: Operation (30 min), Incubation (overnight)\nIn the morning, inoculate a fresh yeast colony in 5 mL +Lys Uracil dropout Yeast Nitrogen Base (YNB) media (refer to materials and equipment[href=https://www.wicell.org#materials-and-equipment] for recipe) and grow with shaking (250 rpm) at 26°C for 8–10 h.\nIn the late afternoon or evening, measure the cell density (optical density at 600 nm wavelength, OD600) using a spectrometer.\nInoculate the appropriate volume of starter culture to a large culture (typically 30 mL) so that the cells will be at mid-log (exponential growing phase) the next morning. Use the following formula to calculate:\n  Starter  culture   OD 600  × Volume  to  inoculate =   Target   OD 600    2 growth time/doubling time   × Large  culture  volume  \nwhere\nStarter culture OD600 is the concentration from step 2.",
    "Target OD600 is mid-log (i.e., 0.5–0.8), we typically aim for an OD600 of 0.7.\nNote: In our hands, cells are not very adherent if OD600 is lower than 0.5, and so are difficult to pellet. A higher OD600 (i.e., OD600 = 0.5–0.8) is preferred so that the majority of the cells can be spun down and collected.\nLarge culture volume is 15 mL × number of time points. For a standard starvation experiment, we collect samples at 0 h and 6 h. So, we need a 30 mL culture. Adjust this volume if you need to collect more time points.\nGrowth time (in hours). For example, if you inoculate at 5 pm and start the next step at 9 am the following day, the total growth time is 16 h.\nThe doubling time of cells in Yeast Nitrogen Base media is typically 2 h at 26°C. In Yeast Extract Peptone Dextrose (YEPD or YPD), the typical doubling time is 1.5 h. Some strains or mutants may have growth defects, so adjust this value accordingly.\nGrow yeast culture with shaking (250 rpm) at 26°C for 16–20 h.\nStarvation and sample collection\nTiming: 8 h\nHere, we subject cells to lysine starvation to trigger the degradation of Ypq1. From the previous section, cells are grown overnight in media containing lysine. In this section, mid-log cells are collected, washed with sterilized Milli-Q (MQ) water to remove any residual lysine, and incubated in YNB media without lysine for 6 h. An equivalent number of cells (7 OD600) will be collected at 0 h and after 6 h.",
    "Note: Different MPs degrade at different kinetics in response to their degradation triggers. A pilot experiment is necessary to empirically determine the appropriate incubation time for your protein of interest. From here, select the time point that shows complete protein degradation, where the full-length band disappears accompanied by the appearance of a free GFP band (refer to Figure 1[href=https://www.wicell.org#fig1]C).\nLabel two sets of 15-mL Falcon tubes:\nOne set will be for the collection of 0 h samples (details start at step 8).\nThe second set will be for setting up the starvation (“6 h –Lys”) (details start at step 9).\nTake out the overnight culture and measure OD600 using a spectrometer.\nFrom the overnight culture, 7 OD600 of cells will be collected for western blot, while another 7 OD600 (or 14 OD600 if two time points are needed) of cells will be washed and resuspended in starvation media.\nFor 0 h sample:\nCalculate the volume of cells needed to get 7 OD600.\n  Volume  of  cells  to  be  collected  =   7   OD 600    ÷    OD  600      of  overnight  culture  \n As an example,\n  7   OD 600  ÷   0.5  OD  mL  = 14  mL  \nPipette the appropriate volume into a labeled 15-mL Falcon tube. Centrifuge the tubes at 2,250 × g for 5 min.\nCarefully aspirate the supernatant to the 1-mL mark using a vacuum or pipette, making sure not to touch the pellet.\nResuspend the pellet by pipetting and transfer it to a 1.5-mL tube. Centrifuge in a tabletop centrifuge at 13,500 × g for 2 min.\nAspirate supernatant to the 100-μL mark using a vacuum. Make sure not to touch the pellet.\nAdd 1 mL ice-cold MQ H2O and add 100% trichloroacetic acid (TCA) to a final concentration of 10% (i.e., 120 μL 100% TCA). Resuspend by vortexing.",
    "Critical: TCA is categorized as an acid and/or corrosive. Wear gloves and goggles. Dispose according to your institute’s regulations.\nKeep cells on ice for at least 30 min. These will be your 0 h sample.\nPause point: Once cells are in TCA, they can be kept at 4°C for several weeks.\nFor setting up the starvation:\nIf only one starvation time point will be collected, use the same volume as in step 8a. If more time points are needed, multiply the volume accordingly.\nPipette the calculated volume into the labeled 15-mL Falcon tubes. Centrifuge at 2,250 × g for 5 min.\nCarefully aspirate the supernatant to the 1-mL mark using a vacuum or pipette, making sure not to touch the pellet.\nResuspend the pellet by pipetting and transfer it to a 1.5-mL Eppendorf tube. Centrifuge in a tabletop centrifuge at 13,500 × g for 2 min.\nWash the pellet twice with 1 mL MQ H2O, centrifuging at 13,500 × g, 1 min each time.\nResuspend the washed pellet in 1 mL YNB-Ura-Lysine by vortexing.\nInoculate the washed cells into 14 mL YNB-Ura-Lysine media in a culture tube or flask.\nIncubate the culture tube with shaking for 6 h at 26°C in a shaking incubator (250 rpm).\nAt 6 h, take out the culture tubes, measure the OD600 using a spectrometer, and collect 7 OD600 starved samples as in step 8.\nProcessing of samples for western blot\nTiming: 2–3 h (as needed)\nHere, TCA-precipitated samples are further processed for SDS-PAGE and western blot. Be careful with pipetting and supernatant removal.\nPellet the samples from steps 8 and 10.\nCentrifuge samples at 13,500 × g, 5 min, at 20°C–25°C.\nAspirate supernatant to the 100-μL mark.\nWash the pellet:",
    "Add 500 μL of 0.1% TCA to the sample. Vortex to mix. Centrifuge at 13,500 × g, 2 min, at 20°C–25°C.\nRemove the supernatant using vacuum up to the 100-μl mark. Centrifuge at 13,500 × g, 1 min, at 20°C–25°C.\nUse a pipette (P200) to manually remove the remaining supernatant.\nLyse the cells in sample buffer:\nAdd 70 μL 2× urea Boiling buffer and about ∼50 μL of acid-washed glass beads.\nUsing a multi-tube vortex or bead-beater (please refer to key resources table[href=https://www.wicell.org#key-resources-table]), vortex samples at maximum speed for 5 min to break the yeast cells.\nNote: Some samples might be stuck at the top of the tube after vortexing; centrifuge the tubes briefly.\nIncubate samples at 42°C, 5 min to aid in denaturing the proteins.\nNote: Using a low temperature such as 42°C minimizes membrane protein aggregation. Never boil membrane protein samples.\nWhile waiting, prepare 2× Urea sample buffer supplemented with DTT: In a 1.5-mL tube, combine 900 μL of 2× Urea sample buffer and 100 μL 1 M DTT. Vortex to mix.\nAdd 70 μL of this solution to the sample.\nNote: If TCA was not completely removed in step 12, your sample could turn yellow. But this will not affect the SDS-PAGE.\nUsing a multi-tube vortex or bead-beater, vortex samples at maximum speed for 5 min.\nIncubate tubes at 42°C, 5 min.\nCentrifuge samples at 13,500 × g, 5 min. While spinning, prepare a new set of 1.5-mL tubes and label them accordingly.\nTransfer as much supernatant (∼100 μL) as possible to the new tubes. Samples can be used right away for SDS-PAGE.\nPause point: Samples can also be stored overnight at −20°C. But for longer storage, we recommend −80°C to minimize any residual protease cleavage.",
    "Note: Frozen samples will need to be reheated at 42°C for 5 mins before gel loading.\nSDS-PAGE and fluorescence western blot\nTiming: 1 day\nHere, samples are resolved by SDS-PAGE, transferred to a nitrocellulose (or PVDF) membrane, and probed using primary and secondary antibodies using standard procedures. For first-time users, we have detailed our western blot protocol below. However, any other western blot method and materials that have been optimized in your lab would also be sufficient.\nFor probing, we recommend using LI-COR fluorescent secondary antibodies, which allow us to simultaneously detect two different proteins (Ypq1-GFP and Pgk1). Using these secondary antibodies will also aid in quantification, as discussed in the next section. For more information, please refer to technical notes[href=https://www.licor.com/documents/fxc6evxvxbub4srkqy6i9yg46l7i0xz5] from LI-COR.\nLoad 20 μL (equivalent to 1 OD600) of the processed samples in an 11% SDS-PAGE gel.\nCritical: A polyacrylamide concentration of 10% or higher is recommended to ensure that the free GFP band (27 kDa) is separated from the dye front since you need to quantify the free GFP signal.\nPrepare the molecular weight marker in a 1.5-mL tube by mixing 5 μL Precision Plus Protein™ All Blue Prestained Protein Standards (Bio-Rad, Cat#1610373), 5 μL 2× Boiling Buffer, and 10 μL 2× Urea sample buffer supplemented with DTT (from step 13d). Load this mixture into the gel.\nNote: We recommend using pre-stained molecular weight markers to allow monitoring of the separation of protein samples during electrophoresis.\nRun the gel until the dye front is at the end of the gel. For a standard Ypq1-GFP assay, we run the gel in 1× Tris-Glycine-SDS buffer at 160 V for 1 h.",
    "Using a standard wet transfer system (e.g., Bio-Rad 2-Gel Tetra and Blotting Module, Cat# 1660827EDU), blot the protein samples onto a nitrocellulose membrane (Cytiva, Cat# 10600016) at 120 V for 2–3 h on ice.\nNote: The transfer time can be optimized based on the transfer efficiency of the pre-stained molecular weight marker.\nAlternatives: The transfer can also be performed overnight at 75 V, 4°C.\nAlternatives: Semi-dry transfer systems (e.g., Trans-Blot® Turbo™ Transfer System (Bio-Rad, Cat# 1704150)) can also be used and are usually quicker. Optimize the transfer time to ensure that the samples are completely transferred.\nPerform western blot:\nUsing forceps, transfer the membrane into a new container and block the membrane in 10 mL Blocking Solution (5% dry milk in 1× Tris-buffered Saline with 0.1% Tween (TBST)) with gentle shaking for 30 min at 20°C–25°C.\nPrimary Antibody: Prepare 10 mL of Primary Antibody in Blocking Solution.\ntable:files/protocols_protocol_1536_16.csv\nReplace the spent blocking solution with freshly prepared Primary Antibody solution. Incubate with shaking for 2 h at 20°C–25°C.\nAlternatives: Membranes can also be incubated with shaking overnight at 4°C.\nWash the membrane with 10 mL 1× TBST 5 times for 5 min with shaking.\nSecondary Antibody: Prepare 10 mL of Secondary Antibody in Blocking Solution.\ntable:files/protocols_protocol_1536_17.csv\nIncubate the membrane in 10 mL Secondary Antibody with shaking for 1 h at 20°C–25°C.\nCritical: Because LI-COR secondary antibodies are coupled to light-sensitive fluorophores, membranes should be protected from light upon secondary antibody incubation.\nWash the membrane with 1× TBST at least 4 times for 5 min. Then, wash the membrane once in ddH2O for 5 min to remove the residual salt.",
    "Critical: Keep the membrane wet by immediately pouring buffer onto the membrane at every wash or incubation step. Drying out the membrane may result in a background signal that may affect the band quantification.\nVisualizing the membrane\nTiming: 10–30 min\nHere, the membrane is visualized using a LI-COR Odyssey® CLx scanner and Image Studio software. This system detects and quantifies the fluorescence signals from infrared dye-coupled secondary antibodies. Through this system, any image brightness and contrast adjustments will not affect the raw fluorescence data, making it suitable for quantitative western blot analysis.\nAlternatives: Other fluorescent/chemiluminescent western blot detection systems such as Azure Biosystems and Bio-Rad ChemiDoc MP imaging systems can also be used.\nUsing forceps, place the membrane (protein side facing down) on the scanning plate.\nScan the membrane:\nClick the Acquire tab. Use the following parameters: μ = 169 μm, Q = Medium, f = 0.0 mm.\nChoose the region of interest that covers the membrane. Click Preview, which will do a quick and low-resolution scan.\nAdjust the region of interest, so it occupies all samples on the membrane. Click Start. A typical Ypq1-GFP degradation blot is shown in Figure 2[href=https://www.wicell.org#fig2].\nImage display settings can be adjusted to optimize sample and background signals.\nNote: If adjusted through the LI-COR Image Studio software, brightness and contrast modifications affect visualization only and not the quantification.\nExport the image as a .tiff file. Save the following images: Membrane in both Green and Red channels, Membrane in Green channel only, Membrane in Red channel only.\nAfter imaging:\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1536-Fig2.jpg\nFigure 2. A typical Ypq1-GFP degradation blot\n(A and B) GFP bands were viewed under the 800 nm (Green) channel (A), and Pgk1 bands were viewed under the 680 nm (Red) channel (B).",
    "Strip the membrane in 2% SDS for at least 60 min with shaking at 20°C–25°C.\nWash the membrane twice with 1× TBST shaking for 30 s each time.\nTransfer the wet membrane into a Ziploc bag. Label properly and store the bag in −20°C. The membrane can be re-blocked and probed with different antibodies in the future.\nDensitometry using LI-COR Image Studio and quantification\nTiming: 30 min\nHere, we quantify the fluorescence signal coming from full-length Ypq1-GFP, free GFP, and Pgk1 bands, and normalize them to calculate the degradation efficiency of Ypq1-GFP after lysine withdrawal.\nCritical: We recommend using Image Studio instead of ImageJ. Adjusting the image brightness or contrast using Image Studio will not change the signal intensity of raw data, unlike ImageJ.\nAlternatives: Other fluorescent/chemiluminescent western blot detection systems also have their analysis softwares such as Azurespot Pro (Azure Biosystems) and Image Lab (Bio-Rad) that can be used for the quantification.\nTo measure the band intensity,\nClick on the Image tab > Shapes > Add Rectangle. Click on a band corresponding to Full-length Ypq1-GFP on your image. Adjust the size of the rectangle so that it covers the whole band.\nPress Ctrl + C and Ctrl + V to duplicate the rectangle. Make rectangles for all full-length bands (Figure 3[href=https://www.wicell.org#fig3]A).\nNote: Copying and pasting ensure that the selected size will be equivalent among samples, providing a stringent quantification.\nAdjust the image brightness and contrast as necessary to be able to see and add boxes onto faint bands.\nRepeat step 24 for bands corresponding to Free GFP (27 kDa), and for Pgk1 bands under the Red channel.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1536-Fig3.jpg\nFigure 3. Quantification of Ypq1-GFP bands after lysine starvation",
    "(A) During densitometry, full-length (FL) Ypq1-GFP and Free GFP bands are quantified with equally sized rectangles. Shown also are the raw fluorescence values obtained for each band using the Image Studio software.\n(B) Final graph quantifying the degradation of Ypq1-GFP mutants vs. wild-type after 6 h lysine starvation. FL Ypq1-GFP was measured and normalized to total GFP (FL GFP + free GFP). A higher FL-GFP signal at 6 h-Lys corresponds to a lower degradation efficiency. Error bars denote standard deviation (n=3).\n(C) An alternative way of quantification is to normalize the 6 h FL Ypq1-GFP levels to the values at 0 h.\nExport quantification values as an Excel file.\nTo quantify degradation,\nCalculate the degradation efficiency in terms of percentage of full-length Ypq1-GFP relative to total GFP (full-length Ypq1-GFP + free GFP):\n Full-length  Ypq1-GFP   %  =   Full-length  band   Full-length   band  +  Free  GFP  band   × 100 % \nNote: The benefit of this quantification method is that it is internally controlled. We are comparing full-length vs. total GFP signal within the same sample, and so Pgk1 values will be canceled out. But probing for Pgk1 ensures that the loading is equivalent.\nPlot a bar graph comparing the protein levels at 0 h and 6 h –Lys (Figure 3[href=https://www.wicell.org#fig3]B).\nRepeat the process to obtain a total of 3 biological replicates for statistical analysis.\nCritical: A successful quantification relies on clean western blots that are free from stains, bubbles, or background signals. Assess the quality of your western blots and repeat the process as necessary before quantification.\nQuantification of membrane protein degradation by flow cytometry",
    "Upon lysine starvation, Ypq1-GFP is recognized by a ubiquitin ligase complex consisting of two proteins Ssh4 and Rsp5. Ubiquitinated Ypq1-GFP is then internalized into the vacuole lumen. Although GFP is proteolytically stable inside the vacuole lumen, the low luminal pH causes a decrease in GFP fluorescence (Arines et al., 2021[href=https://www.wicell.org#bib1]; Patterson et al., 1997[href=https://www.wicell.org#bib20]) (Figure 4[href=https://www.wicell.org#fig4]). This decrease in fluorescence is detectable by flow cytometry and can be used as a quantitative readout for protein degradation.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1536-Fig4.jpg\nFigure 4. The rationale for flow-cytometry-based quantification of Ypq1-GFP degradation\n(A) Upon lysine starvation, the E3 ligase complex (Rsp5-Ssh4) ubiquitinates Ypq1-GFP, leading to its internalization into the vacuole lumen. Ypq1 is degraded, while GFP stays intact. However, due to the low pH in the vacuole lumen, the fluorescence of GFP decreases.\n(B) In the absence of Ssh4, the cytosolic E3 ligase Rsp5 cannot be recruited onto the vacuole membrane. In effect, Ypq1-GFP is retained on the vacuole membrane.\n(C) The quenching of GFP in –Lys conditions is detectable as a shift in median fluorescence.\n(D) When Ssh4 is deleted, there is no shift in median fluorescence.\nThis method can be used as an alternative to or corroborate data from the western blot protocol, and offers speed and higher throughput with a 96-well plate format. For this protocol, we used the IntelliCyt® iQue Screener PLUS flow cytometer (Sartorius) and the iQue Forecyt® Software (Sartorius).\nNote: Other than GFP, the pH-sensitive pHluorin may also work, but for relatively abundant proteins. For red fluorophores, the pH-sensitive pHuji (Shen et al., 2014[href=https://www.wicell.org#bib23]) may be suitable.\nAlternatives: The details that we outline here can be easily adapted to other flow cytometry systems.\nStarter culture\nTiming: Operation (8–10 h), Incubation (overnight)\nAs in the western blot protocol, this pre-culture step ensures that all strains start at mid-log before starvation.",
    "In the morning before the day of the experiment, inoculate yeast in 5 mL YNB+Lys and grow with shaking at 26°C for 8–10 h.\nInclude the following set of controls:\nNo GFP control (e.g., SEY6210 + Empty vector).\nPositive degradation control (e.g., SEY6210 + Ypq1-GFP).\nNegative degradation control (e.g., SEY6210 ssh4Δ + Ypq1-GFP).\nNote: Here, our negative degradation control is a strain where Ssh4 (a component of the ubiquitin ligase complex that recognizes Ypq1) is deleted, so Ypq1-GFP does not degrade. For other membrane proteins, the following strains can be used as negative controls:\nA strain where the corresponding ubiquitin ligase is deleted or non-functional.\nIf the protein is on the plasma membrane, an endocytosis-deficient strain (e.g., end3Δ) can be used (Munn, 2001[href=https://www.wicell.org#bib16]).\nA strain where the vacuole sorting machinery is defective, for example, an ESCRT (endosomal sorting complexes required for transport) mutant (e.g., vps4Δ, vps27Δ) (Katzmann et al., 2001[href=https://www.wicell.org#bib8]).\nIn the late afternoon or evening, measure the cell concentration (OD600) using a spectrometer.\nInoculate the appropriate volume of starter culture to a 10-mL culture so that the cells will be at mid-log the next day. Use the following formula to calculate:\n  Starter  culture   OD 600  ×  Volume  to  inoculate  =     Target   OD 600    2 growth time/doubling time     ×   10  mL  \nNote: For more details, refer to the western blot protocol (Starter Culture).\nCulture yeast with shaking (250 rpm) at 26°C overnight.\nLysine starvation\nTiming: Operation (30 mins to 1 h), Incubation (6 h)\nHere, we separate the overnight culture into two halves: one half will be diluted and grown in the presence of lysine, while the second half will be diluted and grown in media without lysine. Depending on your protein, you may need to modify the starvation media and the duration of starvation.",
    "Measure the cell concentration (OD600) of the overnight cultures using a spectrometer. When the cells are at mid-log, proceed with lysine starvation.\nPrepare two sets of culture tubes:\nPipette 4 mL YNB-Ura into the set labeled as “+Lys”.\nPipette 4 mL YNB-Ura-Lys into another set labeled as “–Lys”.\nPrepare the cells for starvation:\nFor each sample, measure out 0.94 OD and pipette into a tube labeled +Lys. Similarly, measure out 3.75 OD and label it as -Lys.\nNote: This calculation is based on the goal of reaching the final cell concentration of ∼1.5 OD/mL after 6 h. In YNB+Lys, yeast cells have a doubling time of 2 h. Therefore, they will double three times after 6 h. However, in the absence of lysine, yeast cells double only once, and so you will need to inoculate more cells in –Lys.\nNote: Here, we determined 1.5 OD/mL as the optimal cell concentration for flow cytometry. To determine the optimal cell concentration for your flow cytometer, you need to dilute the yeast culture and check which concentration minimizes sample clogging and uneven cell flow. Consult with your flow cytometry core for further guidance.\nNote: Some strains may have a growth defect and so will have longer doubling times. Adjust your calculation accordingly.\nCentrifuge the cells at 2,250 × g for 5 min in a benchtop centrifuge.\nAspirate the supernatant and wash the cells twice with 1 mL MQ H2O.\nFinally, resuspend the cells in either 1 mL YNB-Ura or 1 mL YNB-Ura-Lys, and pipette them into the corresponding culture tubes. The final volume will be 5 mL.\nIncubate both sets of tubes at 26°C with shaking for 6 h.",
    "Note: After 6 h of growth, the OD600 of samples can be measured by a spectrometer, but is optional. Any small differences in OD600 will not affect the quantification.\nPlate setup for flow cytometry\nTiming: 30 min to 1 h\nFor each sample, pipette a triplicate of 200 μL cells into a 96-well plate, using Figure 5[href=https://www.wicell.org#fig5] as a guide.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1536-Fig5.jpg\nFigure 5. Sample loading arrangement in a 96-well plate\nA typical setup for analyzing Ypq1-GFP mutants. All Ypq1-GFP mutants were expressed from a plasmid and transformed into the SEY6210 strain.\nCritical: Each plate should contain all three controls (refer to step 29).\nCritical: All samples, including controls, should be treated with +Lys and –Lys conditions.\nProceed to flow cytometry.\nCritical: Proceed quickly to avoid further protein degradation. Also, yeast cells may settle to the bottom of the plate after waiting. This can lead to inaccurate readings due to non-uniform laminar flow (e.g., clogging and sample surging).\nFlow cytometry\nTiming: 30 min to 1 h\nHere, we measure the GFP fluorescence using an IntelliCyt iQue Screener PLUS flow cytometer and the iQue Forecyt® software. The researchers may need to adjust steps according to their flow cytometer and software.\nLoad the plate into the flow cytometer equipped with all the necessary buffers. For the iQue Screener PLUS, we used the following buffers:\nRunning buffer: Colorless media such as YNB or PBS should be suitable. In our experiments, we use YNB without nutrients.\nDecontamination solution: 1 vial of IntelliCyt Decontamination Concentrate (Sartorius, Cat#90077) in 180 mL of water.\nCleaning solution: 3 mL of IntelliCyt Cleaning Concentrate (Sartorius, Cat#90079) in 197 mL of water.\nddH2O.\nSheath fluid: 1 bottle of IntelliCyt Bacteriostatic Concentrate (Sartorius, Cat#90078) in 1 liter of water.\nOpen the Forecyt Standard Edition software.",
    "Prime the system for 5 min using YNB as the running buffer.\nWhile priming, set up the flow cytometry protocol on the “Protocol” tab as follows:\ntable:files/protocols_protocol_1536_18.csv\nNote: By setting the SHAKE step this way, we ensure that after every three samples, the flow cytometer will clean the probe, as well as shake the plate to prevent cells from settling to the bottom.\nNote: The FSC-H threshold establishes which signals are most likely coming from samples and which are artifacts or debris. Here, any debris with FSC-H less than 50,000 will be omitted. For every set of experiments, we recommend doing a pilot run on cells expressing your GFP-tagged protein. Iteratively increase or decrease the FSC-H cut-off to test the effect on fluorescence. A reasonable FSC-H threshold minimizes artifacts without affecting fluorescence readings. Consult with your flow cytometry core for further advice.\nGating and analysis of flow cytometry data using Forecyt\nWhen the run is finished, set the Noise ID filter by drawing a polygon around the cell population to gate out any debris (Figure 6[href=https://www.wicell.org#fig6]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1536-Fig6.jpg\nFigure 6. Setting up Well ID\n(A) Set the Well ID Noise Filter to the select cells and gate out any debris.\n(B) Wells, shown here as event columns, are automatically selected by Forecyt.\n(C) Zoom in to confirm if the selections correspond to technical triplicates and manually adjust the boxes if necessary.\nMatch the signals to the samples:\nOn the Well Identification toolbar, set the Algorithm to Adaptive and click on Calculate Wells. This will automatically draw boxes over cell populations coming from each well (Figure 6[href=https://www.wicell.org#fig6]B).",
    "Zoom in to check if each selection box corresponds to events from each well (Figure 6[href=https://www.wicell.org#fig6]C). Because we loaded triplicates for our samples, it will be easy to distinguish real cells from artifacts. Triplicates of the same sample should look similar in height and have a small gap in between. Note that there should be a gap between triplicates of different samples corresponding to the shake and probe wash step in step 42.\nIf a selection box is misplaced, click on Move Well (hand icon), then click on the misplaced selection box to the proper column of events.\nPlot FSC-H vs. SSC-H. Draw a polygon as shown to gate for Yeast Cells (Figure 7[href=https://www.wicell.org#fig7]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1536-Fig7.jpg\nFigure 7. Gating for singlets in preparation for fluorescence measurement\n(A) In a FSC-H vs SSC-H plot, draw a polygon around the cell population to gate for Yeast Cells.\n(B) From this population, generate a FSC-H vs FSC-A plot and draw a polygon around the bottom half of the diagonal to gate for Singlets.\nPlot FSC-H vs. FSC-A. Draw a polygon as shown to gate for Singlets (Figure 7[href=https://www.wicell.org#fig7]B).\nNote: Clumps of two cells (doublets) will give high fluorescence readings. Similarly, budding cells will have a higher total fluorescence because they are essentially two cells. Since buds differ in size depending on the stage of cell division, this can lead to a wide range of fluorescence values. Therefore, we recommend gating for singlets to measure the fluorescence from single, non-budding cells. Singlets have proportionate FSC-A and FSC-H, while doublets and budding cells are slightly larger and will have a higher FSC-A value. Thus, singlets lie along the diagonal in FSC-H vs. FSC-A plot. Meanwhile, doublets and budding cells will have higher FSC-A values (Cattoglio et al., 2020[href=https://www.wicell.org#bib2]; Wersto et al., 2001[href=https://www.wicell.org#bib25]).",
    "Plot BL1-H (i.e., Blue laser for GFP fluorescence) vs. SSC-H.\nQuantification of GFP signals using Forecyt\nClick on the Analysis tab.\nOn the Populations tab, click Heat Map. On the pop-up window, click Metric, then choose Median BL1-H of Singlets.\nRight-click the resulting heat map, then click Show > Actual Values. The resulting heat map can be saved as an image and can be further processed for publication (Figure 8[href=https://www.wicell.org#fig8]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1536-Fig8.jpg\nFigure 8. Median fluorescence values and heat map of Ypq1-GFP mutants after growing in +Lys and –Lys media\nThis heat map can be automatically generated from the Forecyt software. Here, the lightest wells correspond to cells with no fluorescence (SEY6210 + EV), while the darkest wells correspond to the highest levels of GFP fluorescence. Notice the difference in levels of GFP fluorescence between cells grown in +Lys vs. –Lys conditions.\nWe can further process this data to quantify the degree of degradation of each sample. To do so, export the median fluorescence values as .csv or .xlsx files. Go to the Metrics tab, then click Export Current Plate.\nAlternatives: Generating this heat map is optional but provides a quick glance to distinguish which samples could be having a somewhat normal or disrupted degradation. For flow cytometers and software that do not have this feature, export the median fluorescence values as .csv or .xlsx. Then, generate a heat map using Excel following the instructions in step 53. Set the Minimum value Type as “Lowest Value”, and the Maximum value Type as “Highest Value”.\nFluorescence retention heat map generation\nCalculate degradation efficiency in terms of fluorescence retention:\nUsing Microsoft Excel, calculate the Average Fluorescence (AF) of the median fluorescence values from three technical replicates.",
    "To correct for any auto-fluorescence inherent in your cells, compute the Corrected Average Fluorescence (CAF) by subtracting the AF value of the No Fluorescence control (e.g., SEY6210 + Empty vector). A sample data set calculation is shown in Figure 9[href=https://www.wicell.org#fig9].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1536-Fig9.jpg\nFigure 9. Calculating the Fluorescence Retention score as a measure of degradation efficiency\nShown here are sample calculations for the controls. Generally, the median GFP fluorescence values from technical replicates are averaged. Next, the average fluorescence of the No Fluorescence control is subtracted to obtain the corrected fluorescence value. Then, the Fluorescence Change is calculated by dividing the values from –Lys with the values from +Lys. Lastly, the Fluorescence Change values are normalized to that of the Negative Degradation control to obtain the FR score.\nCalculate the fluorescence change (FC) by dividing the CAF of cells from –Lys samples with the CAF of cells from +Lys samples.\nFinally, calculate the fluorescence retention (FR) score by normalizing the FC value of the mutant with the FC value of the Negative Degradation Control (e.g., SEY6210 ssh4Δ + Ypq1-GFP). This method sets the final FR score of the negative control to 100%; all other samples would have a lower score. Essentially, a higher FR score indicates a higher fluorescence after lysine starvation, hence, a stronger block of degradation. Scores that approach 100% correspond to a complete block.\nTo further transform the FR scores into a heat map,\nHighlight the FR scores and click on Conditional Formatting > Color Scales > More Rules… (Figure 10[href=https://www.wicell.org#fig10]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1536-Fig10.jpg\nFigure 10. Making an FR score heat map on Microsoft Excel\nGenerating a heat map of the FR scores provides a visual component of the quantification to compare degradation efficiencies easily.\n(A) Select the FR scores and click on Conditional Formatting > Color Scales > More Rules.",
    "(B) Choose 2-Color Scale, set the minimum and maximum values, and set your preferred colors.\nSet the Format Style as “2-Color Scale” (Figure 10[href=https://www.wicell.org#fig10]B).\nSet the Minimum value Type as “Lowest Value” and the Maximum value Type as 100.\nSet your preferred colors and click OK. The FR score heat map should appear as in Figure 11[href=https://www.wicell.org#fig11].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1536-Fig11.jpg\nFigure 11. FR score heat map of Ypq1-GFP mutants and controls\nHigher FR scores correspond to more Ypq1-GFP stabilized on the vacuole membrane and thus indicate a stronger block in degradation."
  ],
  "subjectAreas": [
    "Molecular/Chemical Probes",
    "Cell Membrane",
    "Protein Biochemistry",
    "Flow Cytometry",
    "Cell Biology",
    "Molecular Biology",
    "Model Organisms",
    "High Throughput Screening"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}