{
  "id": 17504,
  "origin_website": "Jove",
  "title": "Synthesis and Characterization of Multi-Modal Phase-Change Porphyrin Droplets",
  "procedures": [
    "1. Dehydrated lipid films\nCalculate the masses of each of the shell components needed (see Supplemental File \"Lipid Formula Sheet\").\n\tNOTE: For this protocol, the shell composition will be: 10 molar % 1,2-distearoyl-sn-glycero-3-phosphoethanolamine-N-[methoxy(polyethylene glycol)-5000] ammonium salt (DSPE-PEG5K), x molar % pyropheophorbide conjugated 1-stearoyl-2-hydroxy-sn-glycero-3-phosphocholine (Pyro-SPC), and (90 - x) molar % 1,2-distearoyl-sn-glycero-3-phosphocholine (DSPC). The amount of Pyro-SPC will be varied across 7 shell compositions (x = 0, 1, 10, 20, 30, 40, 50). Check the molecular weight of DSPE-PEG5K on the stock bottle.\n\t\nScale the protocol to any lipid volume with a minimum volume of 1 mL. For this protocol, a total lipid volume of 10 mL with a total lipid concentration of 1 mg per mL was used for all formulations. The excipient solution will be: 10% propylene glycol, 10% glycerol, and 80% phosphate buffer saline (PBS, 1X, 7.4 pH) (% v/v/v) (see Step 2.3 and \"Lipid Formula Sheet\").\n\t\tNOTE: Synthesis protocol of Pyro-lipids is outlined in the Supplemental File \"Other Protocols and Data\" Steps S1 to S1.19, which was modified from the work done by Zheng et al.15.\nBased on the calculated masses (see Step 1.1 and \"Lipid Formula Sheet\"), weigh out each of the non-Pyro-lipids and transfer to a sufficiently sized borosilicate glass vial with a screw-on cap.\nCap the vial, label the cap and vial, and cover the bottom and walls of the lipid vial with aluminum foil. This vial will be referred to as the \"Lipid Vial\" for the rest of the protocol. Store the Lipid Vial in a cool, dry, dark area.\nIf the formulation contains Pyro-SPC, dissolve 10 mg of Pyro-SPC dry film (see \"Other Protocols and Data\") into 1 mL of chloroform. Vortex for 5 s, measure the absorbance, and calculate the appropriate volume to add to the Lipid Vial.",
    "CAUTION: Chloroform is a health hazard, irritant, and toxic. Wear a protective lab coat, eye protection, gloves, and avoid breathing fumes.\n\t​NOTE: As Pyro-SPC is light sensitive, reduce the lights in the working area if possible when handling Pyro-SPC. Keep Pyro-SPC sealed and covered when not in use.\n\t\nOn the ultraviolet-visible spectrophotometer, set it to measure absorbance from a wavelength range of 800 nm to 300 nm with 0.5 nm increments, and measure a baseline with 2000 µL of pure methanol in a compatible 1 cm path length cuvette.\nCAUTION: Methanol is a health hazard, irritant, toxic, and flammable. Wear a protective lab coat, eye protection, gloves, and avoid breathing fumes. Keep away from sparks and heat.\nAdd 2 µL of the Pyro-SPC in chloroform into 2000 µL of methanol, and vortex for 30 s. Transfer it into a clean, compatible 1 cm cuvette, and measure the absorbance. Adjust this dilution factor if the absorbance peak at 667 nm out of the ultraviolet-visible spectrophotometer's absorbance range.\n\t\tNOTE: Whenever transferring chloroform or methanol, use a clean glass syringe or a positive-displacement pipette rather than a mechanical pipette for better accuracy.\nRepeat Step 1.4.2 two more times to get triplicate absorbance values.\nAverage the absorbance peak values at 667 nm and use the following equation to calculate the volume of Pyro-SPC in chloroform needed for the Lipid Vial14,15:\nimgsrc://cloudfront.jove.com/files/ftp_upload/62665/62665eq01.jpg",
    "where V is the volume of Pyro-SPC in chloroform needed, m is the required mass of Pyro-SPC (see Step 1.1 and \"Lipid Formula Sheet\"), M is the molecular weight of Pyro-SPC at 1040.317 g·mol-1, A is the averaged absorbance at 667 nm, d is the dilution factor based on the methanol and Pyro-SPC in chloroform volumes (Step 1.4.2), L is the cuvette path length at 1 cm, and ε is 667 nm molar attenuation coefficient of Pyro-SPC at 45000 L·mol-1·cm-1.\n\t\t​NOTE: The denominator of the equation is the Beer-Lambert Law, which relates the concentration of an analyte in solution to the measured optical absorbance over a distance.\nAdd the calculated volume of Pyro-SPC in chloroform from the previous step to the Lipid Vial using a clean glass syringe (Figure 1A) and then cap and cover the vial.\n\t\tNOTE: Figure 1 only shows the 30% Pyro-lipid formulation only.\nIf there is any Pyro-SPC in chloroform remaining: In a fume hood, uncap the Pyro-SPC + chloroform vial from Step 1.4, partially tilt the vial to its side and continuously flow nitrogen gas as gently as possible into the Pyro-SPC/chloroform vial. Rotate the vial to dry out the chloroform using the nitrogen gas flow and to evenly coat the Pyro-SPC onto the interior wall of the vial as it dries. Ensure no splashes are made and none of the solution falls out.\nOnce the Pyro-SPC lipid film appears dry and coated onto the wall of the vial, turn off the nitrogen gas flow. Cap the vial, seal the vial neck with wax film, and store the vial at -20 °C and in the dark.",
    "Prepare a solution of 90% chloroform and 10% methanol (% v/v), and add 5 mL of it to the Lipid Vial. Cap the Lipid Vial, and gently swirl to homogenize the contents (Figure 1B).\n\tNOTE: If the formulation contains phosphatidic acid lipids (such as 1,2-distearoyl-sn-glycero-3-phosphate sodium salt (DSPA)), add: 60% chloroform, 32% methanol, and 8% ultrapure water (% v/v/v) to the Lipid Vial instead. More intense swirling may be necessary to fully dissolve the lipid contents.\nIn a fume hood, uncap the Lipid Vial, partially tilt the Lipid Vial to its side and continuously flow nitrogen gas as gently as possible into the Lipid Vial. Rotate the Lipid Vial to dry out the solution using the nitrogen gas flow and evenly coat the lipid film onto the interior wall of the Lipid Vial as it dries. Ensure no splashes are made and none of the solution falls out.\nOnce the lipids appear dry and coated onto the interior walls of the lipid vial (Figure 1C), turn off the nitrogen gas flow, cover the bottom and wall of the Lipid Vial with aluminum foil, and cover the top opening with aluminum foil poked with a few holes with a needle for venting (Figure 1D).\nLabel and place the covered Lipid Vial inside a vacuum desiccator and allow the lipids to dry further for at least 24 h but no more than 72 h.\n\t​NOTE: The protocol can be resumed later, after 24 to 72 h.\n2. Lipid Hydration\nFill a bath sonicatorwith water and heat it to 70 °C. Turn on the sonication to help mix the water.\nCAUTION: The water and sonicator are at high temperatures. Avoid touching the water and the sonicator. Wear eye protection, a protective lab coat, and protective gloves.",
    "Once the bath sonicator has reached 70 °C, remove the Lipid Vial from the vacuum desiccator. Reduce the lights in the working area if possible.\nPrepare an excipient solution of 10% propylene glycol, 10% glycerol, 80% PBS (% v/v/v) and add 10 mL of it to the Lipid Vial (see Step 1.1.1 and \"Lipid Formula Sheet\").\n\tNOTE: If using a standard air-displacement pipette, use care when handling viscous solvents like propylene glycol and glycerol. Aspirate and plunge the volume slowly and wait for the residual volume to reach the bottom of the pipette tip. Ensure liquid does not cling to the outside of the pipette tip when transferring volumes by moving slowly.\nCap the Lipid Vial, remove the aluminum cover, and gently swirl the vial in the bath sonicator for 15 min while the sonication is on to dissolve the lipids. Make sure the Lipid Vial's neck is above the water. Occasionally check if the vial cap is securely closed.\n\t\nOccasionally, remove the Lipid Vial from the water bath. Briefly hold it to the light to check if the contents are fully dissolved (Figure 1E).\nIf the Lipid Vial contents are not homogenizing, remove the Lipid Vial from the bath sonicator. Secure the cap, swirl more aggressively, and return it to the bath sonicator.\nRemove the Lipid Vial from the bath sonicator, and turn off the bath sonicator. Dry the Lipid Vial exterior with paper towels, and re-label the Lipid Vial.\nCover the Lipid Vial with aluminum foil, and cool the Lipid Vial at room temperature in a cool, dark, dry area for 10 minutes.\nAliquot the Lipid Vial contents: about 2 mL of the lipid solution in 3 mL borosilicate glass clear serum vials (7 mm inner mouth diameter, 13 mm outer mouth diameter).",
    "NOTE: Some protocols may use 1.5 mL of lipid solution in the 3 mL vial7.\nCap the serum vials with lyophilization-style gray chlorobutyl rubber stoppers (7 mm inner mouth diameter, 13 mm outer mouth diameter) and secure the rubber stopper with tear-off aluminum seals (13 mm outer mouth diameter) and a crimper (Figure 1F).\nVacuum, degas, and re-pressurize the lipid solution in each of the serum vials4,5,7 (Figure 2).\n\tNOTE: Refer to \"Other Protocols and Data\" for instructions on how to assemble the Gas Exchanger and more details.\n\t\nClose every valve between and including Pressure Valve A and Gas Cylinder Valve (Figure 2). Connect the serum vials to the manifold needles, then open the corresponding Manifold Valves, then open Vacuum Valve A and Vacuum Valve B, and vacuum at -90 kPa (-13 psi, -900 mbar) for 5 min to remove atmospheric air. DO NOT vacuum out any of the liquid (see \"Other Protocols and Data\" Steps S3 to S3.1.5).\nCAUTION: The vacuum pump can burst if handled incorrectly. Do not use the vacuum pump with organic, acidic, or basic chemicals.\nWith the vacuum still on, hold a serum vial (to prevent it from swinging) and tap it rapidly with a pen or marker to degas. Keep tapping until no bubbles form and there are no bubbles in the vial. DO NOT let any liquid be vacuumed out. Pause tapping if necessary. Repeat for all connected serum vials. After degassing all serum vials, CLOSE Vacuum Valve A and Vacuum Valve B and TURN OFF the vacuum pump (see \"Other Protocols and Data\" Steps S3.2 to S3.2.3).",
    "With the serum vial still connected to the needle and with the vacuum pump turned off, slowly turn the Gas Cylinder Valve 1/16 to 1/8 (about 22.5 to 45 ° of full revolution) counterclockwise to partially open, then open the T-Handle Valve, and SLOWLY turn the Air Regulator Valve clockwise to 3 psi (20.7 kPa) gauge. Then, open Pressure Valve A and Pressure Valve B (see \"Other Protocols and Data\" Steps S3.3 to S3.3.21).\nCAUTION: The decafluorobutane gas cylinder is under pressure and can explode if heated. Keep way from heat and impact. Decafluorobutane gas may cause oxygen displacement and suffocation. Wear proper eye protection and handle in a fume hood. If handled incorrectly, it is possible to vacuum the gas cylinder, which can cause rapid de-pressurization and implosion. Opening the Gas Cylinder Valve more than 1/8 turn can damage the Air Regulator.\nAfter 30 s of pressurization (gauge should still read 3 psi (20.7 kPa)), close all Manifold Valves with serum vials, disconnect the serum vials, sheath the needles, and CLOSE the Gas Cylinder Valve.\nRelieve the built-up pressure by partially opening a single Manifold Valve until Air Regulator gauge needle goes to its resting position. Then close everything between and including the Manifold Valves and the T-Handle.\nLabel serum vials and store them at 4 °C and in the dark. Ensure all Gas Exchanger valves are closed and the vacuum pump is turned off afterwards.\n\tNOTE: The serum should be stable for up to 4 months in this state. At this step, the protocol can be resumed later, after 4 months at most.\n3. Decafluorobutane vials",
    "With clean, empty 3 mL borosilicate glass clear serum vials (7 mm inner mouth diameter, 13 mm outer mouth diameter), cap them with lyophilization-style gray chlorobutyl rubber stoppers (7 mm inner mouth diameter, 13 mm outer mouth diameter) and secure the rubber stopper with tear-off aluminum seals (13 mm outer mouth diameter) and a crimper4,7,8.\nFollow Step 2.9.1 to vacuum the atmospheric air (see \"Other Protocols and Data\" Steps S3.1 to S3.1.5).\nSkip the degassing and follow Steps 2.9.3 to 2.9.5 to re-pressurize the vial (see \"Other Protocols and Data\" Steps S3.3 to S3.3.21).\nLabel the decafluorobutane vials and store them at 4 °C and in the dark. Ensure all Gas Exchanger valves are closed and the vacuum pump is turned off afterwards.\n\t​NOTE: Serum vials filled with decafluorobutane gas will be needed for the droplet condensation. They should be stable for up to 4 months in this state. At this step, the protocol can be resumed later, after 4 months at most.\n4. Droplet formation\nRemove a hydrated lipid solution in the serum vial (from Step 2.10) from the fridge.\nUsing a decapper, remove the aluminum seal on the serum vial and transfer 1 mL of the lipid solution to a 1.85 mL borosilicate glass sample vial (with a phenolic screw cap) by letting the lipid solution flow down the interior wall. Do not create bubbles.\n\t\nIf there is any remaining lipid solution in the serum vial, follow Steps 2.9 to 2.10 to degas and re-pressurize the serum vial for storage (see \"Other Protocols and Data\" Steps S3 to S3.3.21).\nWith the 1.85 mL sample vial, gently flow in decafluorobutane gas into the sample vial headspace using the Gas Exchanger (see Figure 2 for the specific valve names).",
    "Ensure that all the valves on the Gas Exchanger are properly closed and the pump is turned off.\nCAUTION: If done incorrectly, it is possible to vacuum out the gas cylinder causing rapid decompression and implosion.\nOpen one manifold valve and carefully unsheathe the corresponding needle from the manifold.\nCAUTION: Sharp object, avoid contact/piercing.\nOpen Pressure Valve A and Pressure Valve B and turn the Gas Cylinder Valve 1/16 to 1/8 (about 22.5 to 45 ° of full revolution) counterclockwise to partially open and then open the T-Handle Valve.\nCAUTION: Do not open the Gas Cylinder Valve more than this as it could cause damage to the Air Regulator.\nUncap the sample vial with the lipid solution and move it so the Manifold needle is above the liquid-air interface inside the vial. Hold the vial there.\nSLOWLY turn the Air Regulator Valve clockwise until the Air Regulator gauge needle moves slightly from its resting position and perfluorocarbon gas is gently flowing out of the manifold needle. Let the perfluorocarbon gas gently flow into the vial headspace for 30 s. Do not create bubbles. Adjust the Air Regulator Valve if necessary.\n\t\tNOTE: The liquid-air interface should be slightly perturbed by the decafluorobutane gas flow. As the system is now open, the Air Regulator gauge cannot properly read pressure.\nAfter 30 s, carefully and quickly cap the sample vial without moving the vial too much.\nClose the Gas Cylinder Valve (clockwise), the T-Handle Valve, Air Regulator Valve (counterclockwise), Pressure Valve A, Pressure Valve B, and Manifold Valve.\nCarefully sheath the needle.\nLabel the sample vial and seal the neck with wax film going clockwise (Figure 3A and 3B).\n\t\tNOTE: Figures 3B to 3F only show the 30% Pyro-lipid formulation.",
    "Store the sample vial in the dark and at 4 °C for at least 10 min or up to 24 h.\n\tNOTE: At this step, the protocol can be resumed later, 24 h at most.\nPlace about 100 g of dry ice (carbon dioxide) in an insulated container and place regular ice in another insulated container. Retrieve prepared decafluorobutane serum vials mentioned in Step 3, two 3.81 cm (1.5 inch) 20-gauge needles, a 1 mL plastic syringe (unstick the plunger before use), a 200 mL container, metal tongs, and a thermometer (-20 to 100 °C).\n\tNOTE: If only making microbubbles, then there is no need for isopropanol, dry ice, and ice.\nPlace the sample vial with the lipid solution in the mechanical agitator and agitate for 45 s (Figure 3C).\nAfter the mechanical agitation, stand the sample vial right side-up, shielded from light, and start a 15 min countdown to cool down the vial and size-select the microbubbles8,17.\n\t\nWhen the 15 min countdown has reached 10 minutes (5 minutes left on the countdown), fill a container with about 200 mL of isopropanol and cool it to -20 °C with dry ice using metal tongs.\n\t\tNOTE: The target temperature is -15 to -17 °C but the isopropanol will warm up while handling the microbubbles.\nCAUTION: Isopropanol is flammable. Keep away from heat and sparks. Dry ice can cause skin damage. Handle with tongs. Wear gloves, eye protection, and a protective lab coat.\nAfter the microbubbles have been size-selected for 15 min, look for the size-selected partition inside the sample vial (Figure 3D).",
    "Keeping the sample vial right side-up, carefully uncap the sample vial, and withdraw about 0.7 mL of the bottom partition with a 1.5 inch 20-gauge needle attached to a 1 mL plastic syringe. Ensure none of the top partition is withdrawn. Do not flick the syringe to remove air pockets.\nInsert a different 20-gauge needle into a decafluorobutane serum vial (keeping the needle near the top of the serum vial) to vent and then insert the needle/syringe with the size-selected microbubbles.\nSlowly transfer the size-selected microbubbles. Tilt the vial and angle the syringe to let the liquid slide down the interior wall of the decafluorobutane serum vial.\nOnce all the size-selected microbubble solution has been transferred, remove the needle with the syringe but keep the venting needle in to relieve negative pressure (Figure 3E).\n\t\nIf making only size-selected microbubbles, stop here. Keep the venting needle in and near the top. Keep the vial in the dark and at room temperature.\nAdd small amounts of dry ice or room temperature isopropanol to the isopropanol bath to ensure the bath temperature is between -15 to -17 °C.\nWith the 20-gauge venting needle inserted near the top of the serum vial, place the serum vial in the isopropanol bath, keeping the microbubble level below the level of the isopropanol but the vial neck above it, and intermittently swirl the serum vial for 2 min to condense the microbubbles.\n\tNOTE: This step was modified from the work done by Sheeran et al.6",
    "Do no swirl the serum vial continuously in the isopropanol and do not let the solution freeze. Swirl for about 5 s, and lift the serum vial out of the isopropanol. Check for ice nucleation, and resume swirling in isopropanol. If there is ice formation, swirl the serum vial in the air until it dissipates.\nAfter the 2-minute condensation, remove the serum vial from the isopropanol bath and remove the venting needle.\n\tNOTE: The microbubbles should have been condensed into droplets, as indicated by the change in translucency (Figure 3E versus Figure 3F for the 30% Pyro-lipid formulation).\nWipe the serum vial, label it, and place it on regular ice in a dark, insulated container until ready for use. Unopened (intact aluminum seal) droplets should be stable in this state for up to 6 h as long as the melted ice gets replaced as needed.\nWhen ready to use, remove the aluminum seal with the decapper. Keep droplets (even open vials) on ice and in dark while not in use. Keep microbubbles in dark and at room temperature.\n5. Morphological and Optical Characterization\nPrepare 1% Triton by: adding 5 mL of Triton X-100 into 500 mL of PBS (1x, pH 7.4) and stir with a magnetic stir bar until homogenous14.\n\tNOTE: Triton X-100 very viscous. If using a standard air-displacement pipette, use care when handling. Aspirate and plunge the volume slowly and wait for the residual volume to reach the bottom of the pipette. Ensure liquid does not cling to the outside of the pipette tip when transferring volumes by moving slowly.\nPrepare droplets (Step 4). If microbubbles are also being characterized, collect a small volume of the size-selected microbubbles prior to condensation (Step 4.9).",
    "Size the microbubbles or droplets on a Coulter Counter (CC) from 0.2 to 6 µm to obtain size-distributions and concentrations (Figure 4).\n\t\nFill a clean 20 mL cuvette with 10 mL of CC electrolyte that was filtered through 0.2 µm pore polyethersulfone membrane filter. Measure it on the CC with three runs to get a baseline.\nIn the same CC electrolyte, add 5 µL of microbubble or droplet sample and gently mix.\n\t\tNOTE: 2 to 20 µL of sample can be added depending on how concentrated the sample is.\nRun the sample on the CC (3 runs), subtract the averaged baseline, and calculate the size distribution and concentration (number per mL).\nMeasure the droplet absorbance with UV-Vis spectroscopy (Figure 5).\n\tNOTE: Figure 5 only shows the 30% Pyro-lipid formulation only.\n\t\nOn the UV-Vis spectrophotometer, set the absorbance measurement as 800 nm to 300 nm wavelengths with 0.5 nm increments and enable baseline correction.\nUsing a clean 1 cm path length cuvette filled with PBS, perform a baseline measurement. Ensure the volume is high enough to intersect the spectroscope beam path.\nDilute the Pyro-lipid droplets into PBS (recommend 2 µL to 500 µL of droplets into 2000 µL of diluent) and mix by pipetting.\n\t\tNOTE: DO NOT vortex or else the assemblies will be destroyed.\nTransfer the diluted droplets into a cleaned cuvette and measure the absorbance. Alter the dilutions if necessary.\nRepeat Steps 5.4.1 to 5.4.4 but use 1% Triton instead of PBS. After dilution, transfer sample to a sealable/capped vial and vortex for 30 s before measuring.\nMeasure the fluorescence of microbubbles or droplets (Figure 6).\n\tNOTE: Figure 6 only shows the 30% Pyro-lipid formulation only.",
    "On the fluorescence spectrophotometer, set the excitation wavelength as 410 nm and the emission wavelength range from 600 to 750 nm with 1 nm increments.\nMeasure the fluorescence of the PBS diluent to get a baseline using a cuvette that is compatible with the fluorescence spectrophotometer.\nDilute the Pyro-lipid microbubbles or droplets into PBS (recommend 0.5 µL to 10 µL of droplets into 2000 µL of diluent) and mix by pipetting.\n\t\tNOTE: DO NOT vortex or else the assemblies will be destroyed.\nTransfer the diluted sample to the cleaned, baselined cuvette and measure the fluorescence. Alter the dilutions if necessary and avoid signal saturation.\nRepeat Steps 5.5.1 to 5.5.4 but use 1% Triton instead of PBS. After diluting in 1% Triton, transfer the diluted sample to a sealable/capped vial and vortex for 30 s before measuring. Add enough volume to ensure bubbles generated from vortexing are above the laser path.\n\t\tNOTE: The fluorescence signal of the sample in Triton will be much higher than in PBS due to fluorescence unquenching (Figure 6).\n6. Vaporization imaging\nFill an appropriately sized water tank with deionized water and let it rest for 24 hours to equilibrate the gases in the water with the atmosphere.\nPrepare droplets and keep on ice and in dark until use.\nMake a flow phantom tube from 2% agar as described by Pellow et al.18 Submerge the phantom into a water tank heated to 37 °C.\nWarm up PBS to 37 °C and flow through the phantom.\nWith a pre-clinical ultrasound system and 21 MHz linear array transducer (see Table of Materials), align the view to the flow phantom, set it to B-mode imaging, set the output pressures, and capture videos or images to acquire baselines at each pressure.",
    "Dilute 20 µL of the droplet into 50 mL of 37 °C PBS and mix gently. Transfer the solution into a 30 mL plastic syringe and push the solution through the agar phantom.\nKeeping the same alignment as Step 6.5, increase the output pressures until vaporization is observed (bright speckles in the phantom, see Figure 7).\n\tNOTE: Figure 7 shows the 30% Pyro-lipid droplet sample. This commercially available 21 MHz linear array transducer is capable of both imaging and vaporizing droplets."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}