{
  "id": 10906,
  "origin_website": "Jove",
  "title": "Procedure for Decellularization of Rat Livers in an Oscillating-pressure Perfusion Device",
  "procedures": [
    "Animals were kept at the Facility for Experimental Medicine (FEM, Charité, Berlin, Germany), and all experimental protocols were reviewed and approved by the State Office of Health and Local Affairs (LAGeSo, Berlin, Germany; Reg. No. O 0365/11).\n1. Liver Harvesting\nPre-surgical Preparation\n\t\nUse a cork plate for fixation. Put a medical drape on the plate. Using four needles, fix an inhalation mask on the cork plate for intraoperative inhalation narcosis.\nPrearrangement of the Portal Venous Cannula\n\t\nConnect a peripheral venous catheter (G 20) to a three-way stopcock. The venous catheter should be cut obliquely, with a length of approx. 1.5 cm.\nDe-air the system using a 10 ml syringe filled with Ringer solution. It is very important to carefully de-air because gas embolism may negatively affect the perfusion decellularization.\nPrearrangement of the Arterial Cannula\n\t\nUse a butterfly cannula and cut the needle to a length of 5 mm. Fit a 5 cm tube (ID 0.58 mm; OD 0.96 mm) to the 5 mm needle and fix it with superglue. Insert a 2 cm-long tube (ID 0.28 mm; OD 0.61 mm) into the bigger tube and fix it with superglue.\nSlip another tube over this construction as an abutment and fix it with superglue. De-air the arterial cannula with a 5 ml syringe filled with Ringer solution.\nAnesthesia and Analgesia\n\t\nInduce narcosis of the rat in the anesthesia induction chamber by 3.5% isoflurane in oxygen at a flow rate of 1.5 L/min.\nTo ensure safe analgesia during the operation, inject metamizol (100 mg/kg body mass) and low-dose ketamine/medetomidine (10 mg/0.1 mg per kg body mass) intraperitoneally.\nSupply 1.5% isoflurane in 1 L/min oxygen via the inhalation mask for subsequent maintenance of surgical anesthesia.\nPreoperative Arrangements",
    "Shave the abdomen liberally with an electric shearing machine. Moisten the shaved incision site on the abdomen with 70% ethanol for disinfection.\nPlace the animal in the supine position on the prepared plate, insert the head into the inhalation mask and fix the limbs with medical tape and pins. Remove excess ethanol and fur with a gauze compress.\nAnesthesia Assessment\n\t\nAssess the anesthesia depth by watching the respiratory rate. When the anesthesia seems deep enough (40-60 breaths/min), check whether analgesia is sufficient by trying to trigger the toe pinch reflex using surgical forceps to pinch the skin between the toes of both hind limbs.\nAbdominal Approach\n\t\nMake a median incision into the caudal abdominal wall above the bladder. Cut from this point to both lateral costal arches in a V-shaped manner. Take care not to cut into the diaphragm. Pull the cut abdominal wall over the chest.\nFix the xiphoid with an overholt clamp, pull it cranially and fix it with a rubber band. Use wet cotton swabs to evacuate the intestine. Wrap the intestine in a wet gauze bandage. Furthermore, cover all abdominal margins with wet bandages.\nLiver Preparation\n\t\nDissect the falciform ligament. Use a wet gauze bandage to hold the medial and left liver lobes cranially under the dome of the diaphragm. Expose the hepatoduodenal ligament and the upper omental liver lobe. \nUse two microforceps and spring scissors to carefully dissect the ligament attached to the upper omental lobe until the lobe is mobile. Move the lobe using wet cotton swabs under the gauze compress,holding the medial and left lobes in place.\nAfter mobilization of the upper omental liver lobe, move the stomach to the left. Fix the stomach with a clamp and dissect the minor omentum with microforceps and the spring scissors.",
    "Mobilize the lower omental liver lobe until it is mobile and subsequently move the lobe back into its cavity. Use a Backhaus clamp to retain the duodenum. Move the duodenum to the left to stretch and expose the hepatoduodenal ligament. Circumscribe the common bile duct in the stretched hepatoduodenal ligament.\nDissect the bile duct from the adipose and pancreatic tissue. Cut the bile duct 1.5 cm from the bile duct bifurcation. Dissect the portal vein from the surrounding adipose tissue. Expose the gastroduodenal vein.\nLigate the gastroduodenal vein twice with silk 6-0 and divide the vein between the 2 ligatures. Dissect the celiac trunk and the common hepatic artery from the surrounding tissue until all arterial rami are revealed.\nLiberate the gastroduodenal artery from the surrounding tissue. Tie the gastroduodenal artery twice with silk 6-0, with the ties distant from each other. Dissect the gastroduodenal artery between the 2 ligatures.\nLiberate the splenic artery from the surrounding tissue. Tie the splenic artery twice with silk 6-0, with the ties distant from each other. Dissect the splenic artery between the 2 ligatures.\nLiberate the left gastric artery from the surrounding tissue. Tie the left gastric artery twice with silk 6-0, with the ties distant from each other. Dissect the artery between the 2 ligatures.\nCircumscribe the inferior caval vein between the right kidney and the right lateral liver lobe. Dissect the vein from the retroperitoneal space. Expose the aorta by following the celiac trunk.\nDissect the retroperitoneal adipose tissue. Inject 1,000 I.E. heparin in 1 ml saline into the inferior vena cava. Retract the cannula and close the incision with a cotton pad. Wait 1-2 min for the systemic effect of heparin.",
    "Circumscribe the aorta with forceps. Dissect the aorta and exsanguinate the rat. Furthermore, dissect the inferior vena cava distally from the kidney.\nPortal Venous Cannulation (Use the cannula prepared in section 1.2)\n\t\nMake a fish-mouth incision in the distal portal vein. Open the incision with forceps and cannulate the portal vein. Flush the liver with 20 ml Ringer solution until the liver decolorizes and fix the cannula with ligatures (silk 6-0).\nArterial Cannulation (Use the cannula prepared in section 1.3)\n\t\nDissect the aorta above the celiac trunk. Liberate the aorta segment from the retroperitoneal space. Cut the aorta segment longitudinally to generate an aortic patch. Insert the self-built cannula into a static holder.\nUse 2 forceps to slip the aortic patch over the cannula. Ligate the hepatic artery with silk 6-0 over the cannula and fix the patch at the abutment.\nLiver Explantation\n\t\nOpen the diaphragm, make a circular incision and dissect the liver from the surrounding structures.\nStorage\n\t\nStore the liver in a sterile 500 ml tank filled with 350 ml Ringer solution until use.\n2. Detergent Solutions\n10% Triton X-100 stock solution\n\t\nFill a 1,000 ml bottle with 900 ml aqua dest. and add 100 ml Triton X-100 (99,9%). Use a stirrer to dissolve the Triton X-100. Fill the bottle with aqua dest. until a total volume of 1,000 ml is reached.\n1% Triton X-100\n\t\nAdd 100 ml of the stock solution (10%) to a 1,000 ml bottle. Add 900 ml aqua dest. and shake the bottle twice. Filter the 1% Triton X-100 solution through a sterile filter.\n10% SDS Stock Solution",
    "Fill a 1,000 ml bottle with 900 ml aqua dest. and add 66.99 g SDS (99.9%, density 0.67). Use a stirrer to dissolve the SDS. Fill the bottle with aqua dest. until a total volume of 1,000 ml is reached.\n1% SDS\n\t\nAdd 100 ml of the stock solution (10%) to a 1,000 ml bottle. Add 900 ml aqua dest. and shake the bottle twice. Filter the 1% SDS solution through a sterile filter.\n3. Decellularization\nSet-up of Perfusion Deviceimgsrc://cloudfront.jove.com/files/ftp_upload/53029/53029fig1.jpg\nFigure 1: Scheme of the Perfusion Device for Selective Arterial and Portal Venous Perfusion of Four Rat Livers under Oscillating Pressure Conditions. (modified from Struecker et al. 14)\nLink the drain to a three-way stopcock and a Heidelberger extension to regulate the fill level and fill the reactor with 500 ml 0,9% NaCl.\nimgsrc://cloudfront.jove.com/files/ftp_upload/53029/53029fig2.jpg\nFigure 2: Scheme of the perfusion set-up. Link the perfusion chamber (1,400 cm3)(1) to the distal end (4) of the bubble trap (5) via the portal venous access (2) or via the arterial access (3). The bubble trap (5) should be equipped with an obturation (4) at the distal end and a vent (6). Connect the bubble trap (5) to a Heidelberger extension (7). Link the Heidelberger extension to the pump segment (8). Furthermore, connect the pump segment (8) to another Heidelberger extension (9). Insert the last Heidelberger extension (9) into the bottle of detergent solution (10). Connect the respirator (11) to the perfusion chamber (or to the pressure distributor in the case of multiple perfusions). To drain the reactor fluids, connect the outflow to the waste bottle (12).",
    "Insert the pump segment into the pump. Start the pump to fill the cycle with PBS, close the distal end of the bubble trap and open the vent. When the bottom of the bubble is securely covered with PBS (2-3 cm), close the vent and open the distal end of the bubble trap.\nLiver Installation\n\t\nLink the three-way stopcock of the portal vein cannula to the related reactor access. Connect the arterial cannula to the arterial access. Be careful to ensure that no air enters the systems.\nApplication of Oscillating Pressure Conditions\n\t\nUse a respirator with a frequency of 15 bpm and an amplitude of 26 mbar (min. 4 mbar, max. 30 mbar). Connect the respirator to the pressure distribution chamber and connect the chamber to the reactor. Start pressure application.\nDecellularization Protocol\n\t\nPerform perfusion steps with a flow rate of 5 ml/min. Start the decellularization with perfusion of the liver with 1% Triton X-100 for 90 min. Allow waste effluence via the outflow of the perfusion device to keep the fluid level inside the perfusion chamber constant and above the perfused liver. After 90 min, change the detergent to 1% SDS.\nimgsrc://cloudfront.jove.com/files/ftp_upload/53029/53029fig3.jpg\nimgsrc://cloudfront.jove.com/files/ftp_upload/53029/53029table1.jpg\n Figure 3: Perfusion Protocol for All Experimental Groups.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}