{
  "id": 5743,
  "origin_website": "Bio",
  "title": "Isolation and Expansion of Mesenchymal Stem Cells from Murine Adipose Tissue",
  "procedures": [
    "Isolation of murine MSCsNote: Perform all manipulations under sterile conditions. In order to keep digestion conditions reproducible between subsequent cell isolations, the volumes of solutions during the crucial collagenase digestion step are determined based on the weight of adipose tissue. Sacrifice mice by cervical dislocation. Sterilize animals by submerging into 70% ethanol for 5-10 min.Note: Mice may also be euthanized by CO2 inhalation or other approved methods. The number of animals used for isolation depends on the set goals. Given the high expansion capacity of MSCs, one to two animals would suffice for most applications.Dissect the abdominal skin to expose subcutaneous adipose tissue (Video 1).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Mouse dissection Extract the subcutaneous adipose tissue using sterile forceps and scissors (Video 2).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 2. Excision of adipose tissue Place the extracted tissue to a pre-weighted 6-cm Petri dish. Measure the weight of extracted tissue (N g) using an analytical balance.Add 1x N ml (where N is the weight of adipose tissue in grams) of the room temperature MSC isolation medium (see Recipes) to the Petri dish containing adipose tissue.Note: Although adipose tissue can stay for some time in MSC isolation medium until collagenase solution (see Recipes) for tissue dissociation is added, it is recommended to recruit an assistant solely for this step, whose task would be to prepare the collagenase solution once the weight of extracted adipose tissue is determined.Mince adipose tissue with sterile scissors until a fine-pieced slurry is formed (Video 3).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 3. Mincing of adipose tissue Using a 1-ml filter tip with the cut-off end, transfer accurately the minced tissue to a 15-ml centrifuge tube (Video 3).Note: If the weight of adipose tissue exceeds 2 g, use a 50-ml centrifuge tube instead.Add 2.",
    "5x N ml of MSC isolation medium to the Petri dish, wash and transfer the remaining pieces of tissue to the same 15-ml tube.Add 0.5x N ml of the prepared collagenase solution to the tube with the minced tissue (Video 3).Incubate for 40 min at 37 °C with constant agitation in a thermostated shaker at a speed of 200 RPM (Video 4).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 4. Treatment with collagenase and centrifugation Pipette up and down the resulting cell suspension 20-30 times using a 10 ml pipette until homogeneous.Centrifuge cell suspension at 22 °C for 10 min at 370 x g (Video 4).Discard the supernatant, add 1 ml of MSC isolation medium and resuspend cells using a 1-ml filter tip. Add 9 ml of MSC isolation medium, mix and centrifuge at 22 °C for 10 min at 370 x g (Video 4).Repeat the step A12 once more. Resuspend cells in 1 ml of MSC growth medium (see Recipes).Count the total number of isolated cells using hemocytometer.Note: The average number of isolated cells at this stage is variable but usually about 5-15 million cells per mouse.Seed 5 to 7 million cells per 10-cm Petri dish, add MSC growth medium to each dish to a final volume of 10 ml, and cultivate at 37 °C in a CO2 incubator under hypoxic conditions (5% CO2, 5% O2) (Video 4).Note: When adding MSC growth medium, aim to spread cells evenly throughout the dish by tilting it and/or using pipet.Culture passage zero cells for 5-7 days up to 70-80% confluency, with MSC growth medium changes after the first day and every 3 days afterwards. The cells at this stage have a slightly elongated fibroblast-like shape.",
    "Tilt the Petri dish and carefully aspirate the culture medium from the plastic-attached cells avoiding their disturbance and detachment, wash once with 1x PBS (see Recipes). Add 1 ml of trypsin solution (see Recipes) to each 10-cm Petri dish, detach cells at 37 °C for 5-10 min.Note: Monitor the degree of cell detachment microscopically after 5 min of incubation; if necessary, extend incubation until the vast majority of cells are detached, but not longer than 10 min (see Note 3).Transfer cells to a 15-ml centrifuge tube, add 5 ml of MSC growth medium, mix by gentle pipetting and centrifuge at room temperature for 7 min at 370 x g.Suspend cells in 1-2 ml of MSC growth medium. Mix a cell aliquot with an equal volume of trypan blue solution and count live cells using hemocytometer.Expansion of murine MSCsNote: Perform all manipulations under sterile conditions. Seed the MSC cell suspension into appropriate culture vessels at a density of 200 to 400 cells/cm2.Culture cells in MSC growth medium for 3 to 4 days in a CO2 incubator under hypoxic conditions (5% CO2, 5% O2) until reaching 50% to 70% confluency. Change medium every 3 days.Notes:   The effect of hypoxic conditions on murine MSC growth is illustrated in the Figure 1.The optimal culture time depends on seeding density: for 200 cells/cm2 the optimal culture time is usually 4 days, whereas for 400 cells/cm2–3 days.Detach cells with trypsin and count them analogously to the steps A16-A20 of the Procedure A above.Repeat steps B1-B3 until the required number of MSC is obtained.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170815/20170815194507_6396.jpgFigure 1. Expansion of mouse adipose tissue MSCs under hypoxia (5% O2) and normoxia conditions. Cells were seeded at a density of 200 cells/cm2 in 3.",
    "5-cm Petri dishes and grown in MSC growth medium for 4 days followed by the transfer to the next passage. Y axis depicts the magnitude of expansion factor, defined as a ratio of a number of live cells collected at the end of the passage to the number of seeded live cells. Data are presented as mean ± SD. Cells grown at normoxia show lower growth rates and faster proliferation decline within 4 passages as compared to the cells grown under hypoxia conditions. Importantly, mouse MSCs at normoxia do not proliferate longer than 3-4 weeks whereas those at hypoxia can proliferate for at least 8-9 weeks before becoming senescent.Freezing MSCsNote: Perform all manipulations under sterile conditions. The protocol below is intended for freezing 4-5 million cells (8-10 frozen cell samples). If necessary, scale up or down the protocol to accommodate for desired cell numbers. Grow MSCs in six 10-cm Petri dishes under hypoxia conditions until reaching 70% to 80% confluency.Detach cells with 1 ml of trypsin solution per dish as described above.Transfer cells to a 15-ml centrifuge tube, add 5 ml of MSC growth medium, mix with pipette and centrifuge at room temperature for 7 min at 370 x g.Discard the supernatant and resuspend cells in 4 ml of growth medium.Count the total number of live cells using hemocytometer as described in the step A22 of the Procedure A.Note: The total number of collected cells is expected to be about 4-5 x 106.Add to the cells 5 ml of fetal calf serum.Add to the cells 1 ml of DMSO. Addition should be performed dropwise to the cells kept under constant agitation (vortexing).Note: After addition of DMSO, subsequent operations with cells should be performed promptly as high concentrations of DMSO are harmful for cells.Aliquot 1.",
    "0 ml of cell suspension into pre-labeled cryotubes (8-10 cryotubes in total). Place the cryotubes into a box lined with cotton wool and transfer to a -80 °C freezer for 2-3 days.Transfer the cryotubes into a liquid nitrogen tank.Thawing MSCsNote: Perform all manipulations under sterile conditions. The protocol below is designed for thawing one frozen cell sample. If necessary, scale up the protocol to accommodate for desired cell numbers. Remove the cryotube with frozen MSCs from the liquid nitrogen tank, let cell suspension thaw at room temperature.Note: Make sure cells are completely thawed within 10 min. Hand warming may be used to speed up the process.Add 10 ml of MSC growth medium to the 15-ml centrifuge tube and transfer thawed cells to the same tube.Centrifuge cells at room temperature for 7 min at 370 x g.Carefully aspirate the supernatant using the pipet, suspend cells in 1 ml of MSC growth medium.Count the total number of live cells using hemocytometer as described in the step A22 of the Procedure A.Note: The total number of live cells at this stage may vary but usually is about 250-350 thousand per one frozen cell sample.Transfer cells to a 10-cm Petri dish, add MSC growth medium to a final volume of 10 ml.Culture cells in MSC growth medium in a CO2 incubator under hypoxic conditions (5% CO2, 5% O2) until reaching 50% to 70% confluency. Change medium every 3 days.Note: Growth for 5 to 7 days is considered as sufficient for cells to recover and acquire normal physiological state."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Stem Cell"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}