{
  "id": 6064,
  "origin_website": "Bio",
  "title": "3D Co-culture System of Tumor-associated Macrophages and Ovarian Cancer Cells",
  "procedures": [
    "Note: All animal studies were approved by the Institutional Animal Care and Use Committee of Yale University. Macrophage isolation and labelingCross Lysozyme Cre mice with tomato reporter C57BL/6 background mice and isolate EGFP-positive macrophages from peritoneal cavity by FACS sorting (Yin et al., 2016). As a positive control for spheroids, ID8 cells (1 x 106/ml) are injected into the abdominal cavity of Lysozyme Cre C57BL/6 mice (Age: 8 weeks) in 100 μl of DMEM. Sacrifice the mice after nine weeks according to procedures approved by Yale’s Institutional Animal Care and Use Committee, and analyze and sort the primary mouse tumor-associated macrophages (TAMs-GFP) using FACS (Yin et al., 2016).Preparation of ID8 cell culturesExpand the ID8 mouse ovarian cancer cells (Number of starting cells: 1 x 106 ) in DMEM (4.5 g/L D-glucose, 10% FBS, 100 IU penicillin and 100 μg/ml streptomycin) on a 15 cm Petri dish and culture ID8 cells until reaching 70-80% confluence.Preparation: Prepare a safety cabinet. Switch on and allow the cabinet to reach working airflow pressure for approximately 15 min before use.Warm medium. To avoid unnecessary stress to the cells, pre-equilibrate the medium in the incubator. If you are going to passage adherent cells, also thaw and warm an aliquot of trypsin.Checking cells: Cells should be checked microscopically daily to ensure they are healthy and growing as expected. Attached cells should be mainly attached to the bottom of the Petri dish, round and plump or elongated in shape and refracting light around their membrane.Upon reaching 70-80% confluence, aspirate the culture medium from the dish and add 10 ml of fresh DMEM.Harvest the ID8 cells by washing them from the Petri dish with the DMEM (10 ml) using a pipette-aid and 10 ml serological pipette.",
    "Transfer the ID8 cell suspension from the plate to a 50 ml conical tube, and pellet the cells by centrifugation at 200 x g for 4 min (room temperature).Suspend the ID8 cell in DMEM and count the cells and prepare a suspension of the ID8 in DMEM at a density of 1 x 106 cells per ml and ID8 cells should be kept on ice for injection. ID8 tumor implantation and metastasis modelPathogen-free C57BL/6 background mice are purchased from THE JACKSON LABORATORY.ID8 cells (1 x 106/ml in 100 μl of DMEM) will be injected into the abdominal cavity of C57BL/6 background mice.Mice body weight gains will be measured weekly.The mice will be sacrificed at nine weeks prior to obvious signs of distress, pain or death.Ascitic fluid volume and tumor weight will be measured, and the tumor spheroids will be analyzed by histology and FACS.Ascitic fluid may begin to build up within 8-10 weeks following the injection of the ID8 cells. Tap the fluid when the mouse is noticeably large, but before the mouse has difficulty moving. Carefully withdraw as much fluid as possible with an 18-gauge needle attached to 10 ml syringe. Note: Sedating the mouse will make the collection of the ascitics fluid easier: ketamine 2 ng/mouse. Collect TAMs from tumor spheroids (Figure 3)imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180416/20180416231001_5870.jpgFigure 3. The steps of collecting TAMs from spheroidsCollect tumor spheroids from 3 ml ascitic fluid by using FalconTM cell strainers.Transfer the tumor spheroids to a 50 ml conical centrifuge tube, add wash medium (0.5% BSA with PBS 10 ml) for 2 min and discard it, and then add wash medium, repeat this washing step 3 times. At the end of the washing cells, centrifuge the cell suspension at 200 x g for 3 min (room temperature).",
    "Discard the wash medium and add 10 ml 500 U/ml collagenase in DMEM solution to the tube containing the tumor spheroids.Incubate the tube at 37 °C for 1 h, and swirl the tube vigorously every 15 min. At the end of the incubation period, spheroid should be almost completely digested and no longer visible.Note: If spheroids are still visible after 1 h, continue incubation, checking every 15 min, until spheroids are no longer visible (do not exceed 2.5 h).At the end of the collagenase digestion, centrifuge the cell suspension at 200 x g for 10 min (room temperature).Remove the supernatant from the tube carefully without dislodging the pellet.Add 2 ml FACS buffer (0.5% BSA with PBS) to the 50 ml tube and suspend the cell pellet, and then transfer the suspension to a FACS tube through filters (Corning Falcon 5 ml round bottom tube with cell strainer snap cap, A 35 μm nylon mesh).Note: It is necessary to obtain a single cell suspension.Centrifuge the cell suspension again at 200 x g for 10 min (room temperature).Remove the supernatant from the tube carefully without dislodging the pellet.Resuspend the pellet in 500 μl FACS buffer.Add 2.5 μl F4/80 (APC, 0.2 mg/ml) and 5 μl CD206 (PE, 0.2mg/ml) antibody to stain TAMs.Sort GFP+ F4/80+ and CD206+ TAMs through FACS analysis (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180416/20180416231431_6650.jpgFigure 2. FACS sorting of M2 TAMs. Spheroids were collected from ovarian cancer-bearing donor mice and dispersed to single cells. Cells labeled with anti-F4/80 and anti-CD206 were isolated by FACS sorting on FACSAriaII (BD Biosciences).Precoat 24-well plate with Matrigel A 3D culture model was examined to determine the suitable cell culture system for our study.In the 3D-base model, a 24-well plate is precoated with Matrigel as basement membrane by adding 160 μl of Matrigel to each well.",
    "Incubate at 37 °C for 30 min to let the Matrigel solidify.Plate the cells (TAMs from step D7, ID8 cells or SKOV-3) onto the gel in 1 ml regular medium containing 2% Matrigel (3D-base and embedded, containing laminin as a major component, collagen type IV, heparin sulfate proteoglycan, entactin, and other minor components).3D co-culture system of TAM and ID8 cellsIsolate mouse GFP+ F4/80+ and CD206+ TAMs by FACS sorting from spheroids of ovarian cancer-bearing donor tomatolysM-cre mice.Precoat the 24-well plates with Matrigel as described above.Seed the mixtures of TAMs and ID8 cells (at a ratio of 1:10 but with a fixed total cell number as 40,000 cells/well) directly onto the Matrigel-precoated 24-well plate with 300 μl DMEMs in each well.Incubate the cells were incubated at 37 °C for up to 48 h to allow the aggregates spheroids to form.Note: The wells without cells but containing medium are used as negative control. E-Cadherin staining in ID8 cells by immunofluorescent methodGently wash the wells 2 times each with 500 μl PBS to remove DMEM.After PBS removal, add 300 μl of buffered paraformaldehyde (3.7% paraformaldehyde, 10 nM, pH 7.4) for 10 min.Wash the wells 2 times with PBS for removing the PFA and add 100 μl E-Cadherin antibody (1:200 with 1% BSA) to incubate at 4 °C overnight (staining protocol see Yin et al., 2016).On the second day wash spheroids 3 times with 500 μl PBST for about 15 min/time.Add 100 μl PE anti-mouse second antibody (1:500 with 1% BSA) into the 24-well plate with spheroids and incubate for 1-h at RT.Capture fluorescent microscopic images by using Openlab 3 software (Improvision, Lexington, MA) under Zeiss Axiovert 200 fluorescence microscope (Carl Zeiss MicroImaging; Thornwood, NY). The captured images are used for analyzing the cell morphology."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Immunology",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}