{
  "id": 9106,
  "origin_website": "Jove",
  "title": "Peering at Brain Polysomes with Atomic Force Microscopy",
  "procedures": [
    "The practices used to obtain the mouse tissues were approved by the Body for the Protection of Animals (OPBA) of the University of Trento (Italy), protocol no. 04-2015, as per art.31 Legislative Decree no. 26/2014. All mice were maintained at the Model Organism Facility of the Centre for Integrative Biology (CIBIO), University of Trento, Italy.\nCaution: To avoid any RNA degradation of the samples, prepare all buffers using DEPC-treated water for minimizing RNase contamination.\n1. Preparation of Polysomes from Whole Brains\nGathering brain tissues (15 min)\n\t\nEuthanize wild-type mouse strain C57BL/6 with CO2 asphyxiation for 5 min36. Carefully dissect the brain out from the skull36, place the tissue into a 1.5 ml tube and immediately place it in liquid nitrogen. Store at -80 °C until use.\nPreparation of lysate (30 min)\n\t\nPulverize the whole brain tissue using a mortar and pestle under liquid nitrogen.\nTransfer about 25 mg powder to a cold microcentrifuge tube and immediately (to avoid the thawing of the pulverized tissue) add 0.8 ml of Lysis Buffer (see Table 1) and disrupt the cell by pipetting up and down 25 times quickly.\nCentrifuge the tube at 12,000 x g for 1 min at 4 °C to pellet cellular debris.\nTransfer the supernatant to a new microcentrifuge tube and keep the tube on ice for 15 min.\nCentrifuge the tube at 12,000 x g for 5 min at 4 °C to pellet nuclei and mitochondria.\nTransfer the supernatant to a new microcentrifuge tube.\nStore the supernatant at –80 °C for a maximum of 6 months or use it immediately.\nSucrose gradient preparation and centrifugation (2 hr and 30 min)\n\t\nWash ultracentrifuge tubes extensively with RNase-free water (diethylpyrocarbonate treated water (DEPC-water) or commercial) and 3% H2O2/DEPC H2O solution.",
    "Put the tubes on ice and add 5.5 ml of cold 50% sucrose solution at the bottom of each tube (see Table 1 for sucrose solutions). Carefully add the 15% sucrose solution drop by drop, staying close to the interphase in order to preserve a sharp interphase, until the tube is completely filled. When the tube is completely filled, close it with a rubber stopper to avoid air bubble formation.\nIn a cold room gently lay down the tubes horizontally and keep it in this position for 2 hr. After this time, slowly straighten the tubes back into the vertical position and put them on ice. The gradients are now ready to be used. Alternatively, prepare the 15-50% sucrose gradient using a conventional gradient former.\nIn a cold room remove carefully 1.0 ml from the top of the gradient and overlay the sucrose drop by drop with the cytosolic lysate (i.e., the supernatant obtained in step 1.2).\nCarefully lower the tubes into the buckets of swinging bucket rotor. Centrifuge the gradients for 100 min at 180,000 x g at 4 °C using an ultracentrifuge.   \nAfter the centrifugation, leave the tubes in their buckets for 20 min at 4 °C to let the gradients stabilize.\nSucrose gradient fractionation (2 hr)\n\t\nCarefully remove one ultracentrifuge tube from the ultracentrifuge rotor and mount it on the collector device of a Density Gradient Fractionation System. Collect 1 ml fractions monitoring the absorbance at 260 nm with a UV/VIS detector (See Figure 1 upper panel). Keep the collected fractions on ice.\nPrepare aliquots of 30-40 μl of the fractions of interest, keep them on ice before storing them at -80 °C till use. Do not use aliquots or sucrose fractions that underwent more than two freezing-thawing cycles (see Figure 1 lower panel).",
    "2. Sample Preparation for Atomic Force Microscopy (3 hr)\nUsing tape, peel off the mica sheets.\nWash the mica sheets 3-4 times with DEPC-water and place it into a small Petri dish. Then dry the surface using air.\nCover the mica with 200 μl of 1 mM NiSO4 and incubate for 3 min at RT.\nRemove the nickel solution and then dry the surface using air. Carry out all future steps at 4 °C by placing the Petri dish with the mica on ice.\nThaw an aliquot obtained in 1.4.2 on ice and gently add all of the sample drop by drop on the mica. Using a 100-200 μl tip, spread the sample on the entire surface of the mica. Incubate the sample on ice for 3 min.\nCover the mica sheet drop by drop with 200 μl cold Buffer-AFM (see Table 1) and incubate for 1 hr on ice.\nImaging in liquid\n\t\nRemove carefully the Buffer-AFM and wash the mica sheets 3-4 times with 200 μl cold Buffer-AFM to remove excess sucrose. Then wash the mica sheets 3 times with cold Washing Solution (see Table 1), leaving the mica surface covered by some microliters of solution.\nGo to point 3 (Image acquisition).\nImaging in air\n\t\nCarefully remove the Buffer-AFM and wash the mica 3-4 times with 200 μl cold Buffer-AFM to remove the excess sucrose. Then, wash the mica 3 times with cold Washing Solution (see Table 1) and drain the excess water using paper.\nLeave the sample to dry under the chemical hood with the top of the Petri dish partially open. After 2 hr, close the Petri dish and store at RT. Measure the sample after 2-3 hr as they are stable for years.\n3. Image Acquisition (15 min per image after thermal stabilization)",
    "Note: Polysomes immobilized on mica can be imaged in air or in liquid, using AC mode.\nAttach the mica to the sample holder using double-sided tape.\nInsert the sample holder in the AFM stage following manufacturer's directions. When imaging in liquid, if possible, try to maintain the sample at a temperature lower than 25 °C to increase polysome stability in time.\nSelect a cantilever suitable for AC imaging and mount it on the tip holder following manufacturer's directions. Here, use cantilevers with force constant between 2-20 N/m for air imaging and around 0.1 N/m for liquid imaging.\nAdjust the laser spot on the cantilever and zero the quadrant detector signals.\nSelect an opportune driving frequency and drive the cantilever with an amplitude of 10-20 nm.\nApproach the sample until the tip engages the surface.\nSelect a scan area of 2x2 μm, acquire at least 512x512 pixel images (pixel width < 4 nm), select a live background subtraction mode and a Z scale of 20-25 nm.\nInspect the image looking for the presence of round objects characterized by the height between 10 and 15 nm when acquiring in air and 25 and 30 nm when in liquid and the width in the range 25-30 nm. Adjust the setpoint and feedback parameters until sharp objects are visualized. The background should appear relatively flat in good samples, with some 2-4 nm height objects (see Figure 2A and B).\nIf the image looks good (as indicated at point 3.8), acquire several (at least ten) 2x2 micron scans at different sample areas.\n(optional). If necessary, acquire high resolution images of selected polysomes (see Figure 2C).\nApply software corrections (plane subtraction and line-by-line correction algorithms) to correct the AFM images removing arbitrary tilt and drifting effects.\n4. Data Analysis (30 min per image)",
    "Export images in ImageJ (optional: apply a scale factor) preferentially using a lossless compression format, e.g., the TIFF format (see Figure 3A).\nUse the ImageJ macro toolset RiboPick.ijm (to be copied in the ImageJ macro/toolset subdirectory) to count ribosomes in polysomes (see Figure 3B) and compute statistical properties of the sample (see Figure 3C).\n\t\nStart loading an image using the <Read image> tool that initializes the program.\nPick the ribosome centers with the standard ImageJ <Point selection> tool (shift + left click allows the multi-selection of ribosomes). Mark the selected ribosomes with the <Mark ribosomes> tool. Ribosome coordinates will appear in a custom text window.\nAdd more ribosomes to the same polysome repeating the procedure indicated at the point 4.2.2.\nRemove wrongly marked ribosomes using the <Undo last pick> tool (starts removing from the last added ribosome to the first one — in the current polysome only).\nWhen the polysome is completed, use the <New polysome> tool. As the polysome number is added as an overlay to the image, the text window is updated.\nUse the <Save results and close> to write the ribosome coordinates file (the default units of the image are used) and a PNG image that summarizes the picked ribosomes and polysomes. The original image is closed without being saved.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}