{
  "id": 18003,
  "origin_website": "Jove",
  "title": "Semi-quantitative Assessment Using [18F]FDG Tracer in Patients with Severe Brain Injury",
  "procedures": [
    "This study was performed in compliance with the institutional review board (approval No. 07-01) and adhered to the tenets of the Declaration of Helsinki. Informed consent for medical record and brain image use was obtained from the patients’ legal representatives. The study was conducted after approval by the institutional ethics committee (2017-14). This protocol was made following the guidelines of the Japanese Society of Nuclear Medicine and European Association of Nuclear Medicine as a reference15,16.\n1. Screening of the Participants\nObtain informed consent to use the medical records and brain images of the patients from the patients’ legal representatives. A Glasgow Coma Scale score ≤ 8 at the time of accident must have been recorded in each patient’s medical record17,18,19.\nHold neurology, psychology, and multi-disciplinary staff conferences every six months to assess clinical manifestations.\n\tNote: Conference members should include medical staff such as medical doctors, nurses, physical therapists, occupational therapists, speech therapists, nutritionists, and medical social workers. Be sure to constantly check whether patients can communicate (verbally or nonverbally) and make decisions for themselves because arousal state and neurological status are typically unstable.\nConduct clinical assessments of the auditory function, visual function, motor function, oromotor/verbal function, communication function, arousal state, facial expression, and other relevant functions, using standard assessment batteries such as the Coma Recovery Scale-Revised (CRS-R), the Nociception Coma Scale, and the Wessex Head Injury Matrix20,21,22.\nSchedule [18F]FDG-PET/CT scans for the patients who are medically stable and can safely participate in examinations. Only schedule those who have provided informed consent or whose legal representatives have provided informed consent, as stated in the informed consent form. Schedule [18F]FDG-PET/CT image acquisition near the day of clinical assessment.\n2. Preparation of the [18F]FDG Tracer in the Hot Lab",
    "In the hot lab, begin to manufacture reagent kits for the automated production of FDG tailored to the FDG synthesizer (see Table of Materials). Be sure to use the automatic program to check the mobility of the pumping system in the FDG synthesizer and to ensure that air does not leak from the reagent kit. Sterilize the contact area of the machine (this is the start time).\n\tNote: Be sure to check the radiation monitor in the hot lab and use the portable radiation dosimeters to check the radiation levels of each person before they enter the hot lab.\nCheck the volume of [16O]-water and [18O]-water and the volume of helium, hydrogen, and nitrogen in the gas tank. Check whether the tap water temperature for primary cooling is under 25 °C and that for secondary cooling is under 22 °C. Use all water in the closed system (30 min after the start) for production.\nBegin the preliminary irradiation of [16O]-water in the cyclotron (1 h after the start). Check the monitor to be sure that 2 - 3 mL of [16O]-water is irradiated in optimal conditions (e.g., 20 µA, 5 min) in the target area of the cyclotron. After irradiation, install the vial of [16O]-water into a radioisotope dose calibrator and measure the level of radioactivity (see Table of Materials).\n\tNote: The radioactive decay should be calculated using the following formula.\nimgsrc://cloudfront.jove.com/files/ftp_upload/58641/58641eq1.jpg\n\tHere,\n\tN(t) is the number radioactive nuclei at t = t seconds;\n\tN(0) is the number radioactive nuclei at t = 0 seconds;\n\t​T = the half-life.\nBegin the irradiation of [18O]-water in the cyclotron (1 h 30 min after the start). Set the bombardment time for up to 20 min and the energy of the impinging protons to 16.5 MeV.",
    "Start the FDG synthesizer according to the operator manual22 (2 h after the start). A modified procedure is given below.\n\t\nAfter the irradiation, use helium gas to transfer 2 - 3 mL of the [18O]-water from the cyclotron to the polypropylene receiver of the FDG synthesizer.\nHook syringes onto the corresponding syringe drivers, pressurize reagent vials, dissolve the 1,3,4,6-Tetra-O-acetyl-2-O-trifluoromethanesulfonyl-β-D-mannopyranose in one vial (7 ± 0.2 mL) of acetonitrile (purity ≥ 99.5%), and rinse the cassette with acetonitrile.\nAfter the bombardment, transfer the irradiated [16O]-water and [18O]-water to the FDG synthesizer.\n\t\tNote: Once the synthesis has started, the irradiated [18O]-water moves through an anion exchange cartridge (see Table of Materials). Be sure to condition and convert the cartridge to the carbonate before the synthesis.\nAfter transferring the eluent containing the [18F]activity without liquid into the reaction vessels, allow the solvents to evaporate until dry. During the drying process, add small amounts of acetonitrile to the reaction vessel 3x (each time, add 80 µL). Perform the evaporation at 95 °C under nitrogen flow and vacuum.\nAdd the mannose triflate precursor (25 mg) to the dry residue after dissolving it in about 3.5 mL of acetonitrile (with a purity of ≥ 99.5%). A nucleophilic substitution reaction occurs at 85 °C in the FDG synthesizer.\nAs a preliminary purification, mix the labeled solution with 26 mL of distilled water. Send about 4 mL of the diluted labeling solution back to the reaction vessel to recover the remaining activity. Pass the solution through the reverse-phase cartridge (see Table of Materials). Rinse the cartridge containing the trapped labeled precursor 4x using 10 mL, 10 mL, 13 mL, and 13 mL of distilled water on the successive washes.",
    "Convert the acetylated compound (labeled precursor) into FDG within the cartridge via alkaline hydrolysis, using 750 µL of 2 N NaOH for 2 min at room temperature.\nAfter hydrolysis, collect the alkaline FDG solution in 7 mL of water and mix it with the neutralization solution (5 mL of citrate buffer and 1 mL of 2 N HCl).\nPurify the resulting neutralized FDG solution.\n\t\t\nPass the neutralized FDG solution through a second reverse-phase cartridge (see Table of Materials), retaining the partially hydrolyzed compounds and nonpolar by-products.\nPass it through an Alumina N cartridge (see Table of Materials), retaining the last traces of unreacted [18F]fluoride ions. Then, pass it through a 0.22-µm filter.\nRinse the cassette and cartridges, filter with 3 mL of water to recover the residual FDG that is left in the lines and, then, drain the FDG into the final vial, which contains 15 - 17 mL of liquid.\nPerform a qualitative analysis of the [18F]FDG tracer (2 h 30 min after the start).\n\t\t\nVisually observe the vial. Confirm that it is transparent and that it does not include any particles.\nMeasure the amount of liquid using a Roberval’s balance (should be 15 - 17 mL).\nMeasure the radioactivity and half-life using a radioisotope dose calibrator (the same as in step 2.3, see Table of Materials) (criterion: 105 - 115 min).\nDispense 0.5 mL from the vial. Perform a radiochemical purity test via carbohydrate analysis. Use columns of 3.9 x 300 mm for high-performance liquid chromatography (see Table of Materials) to detect the peak radioactivity (over 95).\n\t\t\tNote: A single peak means high purity.",
    "Measure the pH (pH 5.0 - 8.0) by using pH test paper (see Table of Materials). Measure the　residual 4,7,13,16,21,24-Hexaoxa-1,10-diazabicyclo[8.8.8]hexacosane (see Table of Materials) (< 40 ppm) using test paper (see Table of Materials). Measure the endotoxins with the appropriate endotoxin-measuring device through absorbance measuring (see Table of Materials) (0.25 EU/mL). Do a test for sterility (finding no bacteria after 8 d at 37 °C).\nFill the vial covered by lead and tungsten with the [18F]FDG tracer at a dosage of 5 MBq/kg body weight.\nTransfer the [18F]FDG tracer from the hot lab to the working room (3 h 25 min after the start).\n3. Time Course for the Acquisition of the [18F]FDG-PET/CT Brain Images\nSchedule the patients. Be sure to inform the staff to stop nutrition and feeding via gastrostomy. Do not stop providing water. The patients should fast starting 7 h before the image acquisition.\nPrepare the intravenous route for [18F]FDG tracer administration. Secure a 22- to 24-G needle with 5 mL of heparin sodium (10 units/mL) on one of the lower limbs before entering the radiation-controlled area.\nHave the patients lie down on a light stretcher before entering the radiation-controlled area. Bring the patients to the radiation-controlled area and wait for 30 min, in silence, while medical staff are on stand by.\nRecheck the patency of the intravenous route by drawing blood with a 10-mL syringe. Measure the blood-glucose levels with a glucose meter.\nAfter transferring the [18F]FDG tracer from the hot lab to the working room, set it up in the auto-dispensing and injection system (see Table of Materials).",
    "Recheck the following information (via the medical staff): patient ID number, name, birthday, height, and body weight; the name of the tracer, the amount of tracer (water with 3.5 mL of [18F]FDG tracer + 12 mL of saline), the programmed radioactivity (5 MBq/kg), the time of injection, the [18F]FDG tracer-lot number, the injection speed (normally, 0.3 mL/s), and the level of radioactivity that was measured in the hot lab.\nRecord the automatic measurement of preinjected radioactivity that appears on the display of the auto-dispensing and injection system.\nInject the [18F]FDG tracer via the intravenous route prepared in step 3.2 (3 h 30 min after the start).\nRecord the residual volume of the [18F]FDG tracer, which is shown automatically on the display of the auto-dispensing and injection system.\nHave the patients wait in the waiting room of the radiation-controlled area for 50 min.\nTransfer the patients from the waiting room to the PET/CT machine (see Table of Materials). Record the brain images for 10 min (4 h 30 min after the start).\n\tNote: The imaging parameters for [18F]FDG-PET/CT images are 10 min list mode. Reconstruct the data from 10-min bins. The data under 3 min are not used because the low-intensity signals are not adequate. Set the image reconstruction parameters: a block sequential regularized expectation maximization reconstruction algorithm (see Table of Materials); the matrix size = 192; the field of view = 25 cm; β-value: 100 - 200; z-axis filter: none.\nAfter taking the images, check the injection area for extravasation. Discard all urine if the patient has a urinal catheter with urine bag.\nRemove the patient from the radiation-controlled area (4 h 50 min after the start).\n\tNote: See Figure 1 for a schematic of the time schedule of events (patient procedure and synthesis of the [18F]FDG tracer).",
    "4. Analysis of the [18F]FDG-PET/CT Images\nEvaluate all image data for a standardized uptake value (SUV) measurement using the imaging software (see Table of Materials).\nSelect the patients.\nAssign the data to the MM oncology workflow.\nClick the button for Functional browsers.\nClick the VOI (volume of interest) threshold button.\nSet the VOI sphere to the three-dimensional browser.\n\tNote: The maximum SUV (SUVmax) and mean SUV (SUVmean) are automatically measured for the VOI according to the chosen SUVmax threshold. Be sure to draw a border around the targeted VOI on the browser using the three-dimensional sphere, excluding other targets, extraocular muscles, and the scalp because they tend to disturb the set SUV threshold. Check the target area on axial, coronal, and sagittal slices.\nAfter selecting all the right settings, click the Edit the measure button.\nChange the threshold value (e.g., 50%) of the VOI and click OK.\nRecord the SUVmax, SUVmean, target volume, and threshold of the target area, which are automatically measured.\nTo sterically visualize the glucose metabolism of the whole-brain surface, use the software (see Table of Materials) to set a color map for the [18F]FDG-PET/CT images based on blood glucose.\nFinally, compare the clinical assessment with the [18F]FDG-PET/CT images.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}