{
  "id": 7695,
  "origin_website": "Bio",
  "title": "A Simplified Paradigm of Late Gestation Transient Prenatal Hypoxia to Investigate Functional and Structural Outcomes from a Developmental Hypoxic Insult",
  "procedures": [
    "Oxygen Sensor Calibration Calibrate the oxygen sensor once a month according to the manufacturer’s instructions (using parameters for low oxygen control).Replace oxygen sensor as necessary (i.e., if calibration is unsuccessful, per manufacturer).Mouse Enclosure Set up Retrieve one plastic bin and clean it with 70% ethanol.Wipe down with water on cloth and then with a dry cloth.Line the bottom of the plastic bin with lab table soakers (shiny side down).Place 10–15 Lab Diet 5015 pellets and ¼ contents of a Hydrogel cup in a 10 cm Petri dish.Place the Petri dish in the back right corner of the plastic bin (see Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4519/bioprotoc-12-19-4519-g001.jpgFigure 1. Mouse enclosure setup. Shows appropriate setup of mouse enclosure for hypoxic chamber. Plastic bin previously cleaned with 70% ethanol is lined with VERSI-DRY lab table soaker. A 10 cm Petri dish is filled with several food pellets and ¼ contents of a Hydrogel cup and placed in the back right corner.Chamber Set up Place the mouse enclosure in the back right corner of the hypoxia chamber (see Figure 2A).If performing two exposures in the same chamber, place a cutting board to the left of the first mouse enclosure, then place the second mouse closure to the left of the cutting board to prevent mice from visualizing each other.Fill a 10 cm Petri dish with a liberal amount of fresh soda lime (around 15 g).Use fresh soda lime in each exposure to maximize its absorptive ability.Soda lime is added to scavenge for expired carbon dioxide (CO2) that may accumulate in the sealed chamber.We have used this same amount of soda lime for two mice in the same chamber.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4519/bioprotoc-12-19-4519-g002.jpgFigure 2. Hypoxia chamber setup. A. Appropriate setup for hypoxia chamber when one exposure is being performed. The enclosure setup is placed in the back right corner of the chamber.",
    "A liberal amount of soda lime is added to a Petri dish, which is placed on the floor of the chamber (indicated by red arrow). B. Appropriate setup for hypoxia chamber when two exposures are being performed. The enclosure setups are placed against the back wall of the chamber, side by side. A large cutting board is placed between chambers to prevent mice from visualizing each other. A liberal amount of soda lime is added to a Petri dish, which is placed on the floor of the chamber. C. Zoomed out view of appropriate setup for hypoxia chamber when two exposures are being performed, with oxygen controller on top of chamber. D. Oxygen controller. Highlighted are the buttons (1) for adjusting the inspired oxygen levels and the switch (2) for turning on the flow to the chambers. As pictured, the chamber is currently set to room air, 21%.Acclimation Place the mouse in the prepared enclosure within the hypoxia chamber.Close and seal the door to the hypoxia chamber.Allow the mouse to roam freely within the enclosure for 1 min.Normoxic Control (if performing hypoxia, jump to Section F) Ensure the hypoxia chamber is closed and sealed correctly.Ensure the ProOx 360 controller is powered on. If so, it will display the current percentage of inspired oxygen, also known as fraction of inspired oxygen (FiO2), in the chamber (it should be approximately 21%).Ensure the switch on the right side of the sensor is set to “OFF,” not “GAS.”If performing only normoxia, there is no need to open the gas canister; if performing both normoxia and hypoxia at once, the gas canister will be open. If “OFF” is selected, no nitrogen will flow to the chamber.Start a timer for the desired normoxic exposure duration.After the desired exposure time, continue to section L.",
    "Starting the Hypoxic Exposure Open the nitrogen canister and visualize the kPa nitrogen remaining using the meter on the right side of the regulator (see Figure 3).Approximately 3,000 kPa is necessary for 8 h of 5% FiO2 in one chamber; if performing hypoxia in two chambers, approximately 6,000 kPa is necessary.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4519/bioprotoc-12-19-4519-g003.jpgFigure 3. Gas regulator dials. The right dial (1) is the inlet pressure gauge and shows the amount of nitrogen left in the canister in kPa. The left dial (2) is the delivery pressure gauge and shows the flow rate, which should stay between 15 and 20 psi during an exposure.Ensure the ProOx 360 controller is on (if so, it will display the current FiO2 percentage in the chamber; it should be approximately 21%).Ensure the switch on the right side of the sensor is set to “OFF,” not “GAS.”Set initial FiO2 value by holding down the leftmost button labeled “*” under FiO2 reading, using the “▼” and “▲” buttons to navigate to the desired value, and then releasing all buttons.Before turning the switch from “OFF” to “GAS,” change FiO2 setpoint to 19%.Current FiO2 setpoint can be checked at any point by holding the “*” button.Simultaneously start a timer (counting up) and turn the switch from “OFF” to “GAS.”Nitrogen gas will start flowing:If a loud, high-pitched, whining noise is heard, tighten the connection between the regulator and the nitrogen canister.If the tubing is well connected to the canister, there will be a low, intermittent hissing noise when the controller is using nitrogen to regulate O2 levels.Within the first 2 min, check the flow rate on the left meter of the regulator; it should be between 15 and 20 psi (see Figure 3).If the flow rate is too high, decrease it by turning the gold lever counterclockwise.",
    "If the flow rate is too low, increase it by turning the gold lever clockwise.Titrating Oxygen from 21% to 5% At the time points given in Table 1, change the FiO2 setpoint to the corresponding value by holding down the leftmost button labeled “*” under the FiO2 reading, using the “▼” to navigate to the desired value, and then releasing both buttons.Regarding differing FiO2 setpoints and actual FiO2 readings, see Notes.Table 1. Setpoints by time with expected FiO2. table:",
    "﻿0,1,2\nTime after start (min),FiO2 setpoint (%),Actual FiO2 reading (%)\n0,19,20–21\n2,17.5,18.5–19\n5,Keep at 17.5,17–17.5\n7,15,16.5–17\n10,Keep at 15,14.5–15\n12,12.5,14–14.5\n15,Keep at 12.5,12–12.5\n17,10,12–12.5\n20,Keep at 10,10.5–11\n22,7.5,9.5–10\n25,Keep at 7.5 or change to 5 if not at 7.5,8–8.5\n26,5,7.5–8\n30,Keep at 5,5–5.5",
    "Reaching Steady State FiO2 at 5% After the first 30 min of exposure, the FiO2 in the chamber will be around 5%.The FiO2 reading typically fluctuates approximately 0.2% in any direction, i.e., from 4.8% to 5.2%; any fluctuation greater than 0.2% from the setpoint means the ProOx 360 controller should be recalibrated, or the hypoxia chamber should be inspected per manufacturer instructions.Visualize the mouse inside the chamber, ensuring it is breathing.Breaths will appear shallow and quick.The mouse will often choose to sleep near or in the Petri dish for the duration of the exposure, exhibiting minimal movement.Stay for an additional 10 min, ensuring that the equipment is working correctly, the flow rate is between 15 and 20 psi, and the FiO2 value remains constant (within 0.2% of the setpoint).Checking on the Mouse During Exposure Approximately 4 h into the exposure, check on the mouse, ensuring it is still breathing.Check that the flow rate is between 15 and 20 psi (see Figure 3) and that the FiO2 reading remains constant (within 0.2% of the setpoint).Changing the Nitrogen Canister During Exposure If necessary, the nitrogen canister can be swapped for a new one during the exposure.Avoid, if possible. Replace the canister before the exposure when the tank is at or below 3,000 kPa for one chamber and 6,000 kPa for two.If changing the canister during the exposure, do not open the hypoxia chamber; the FiO2 value will remain relatively constant if the canister is changed quickly.Change the nitrogen canister out quickly, moving the regulator to a new canister.The process should not take more than 3–4 min.After changing the canister, wait for nitrogen to flow into the chamber.Adjust the flow rate as necessary, so it lies between 15 and 20 psi (see Figure 3).",
    "Ending the Hypoxic Exposure When the desired exposure time is reached, immediately open the door to the hypoxia chamber, allowing air to rush in.Remove the mouse enclosure from the chamber and set it on a nearby surface.Turn off the ProOx 360 controller and close the nitrogen canister completely.Cleaning Up Remove the mouse from the enclosure and place it into a clean new cage.Visualize the mouse periodically while cleaning to ensure it is recovering well.A normoxic mouse will be alert and moving around.A hypoxic mouse will be cold and move slowly and sluggishly; it will recover within 5 min.Remove all the materials from the mouse enclosure and discard.Clean the mouse enclosure with 70% ethanol.Throw out the soda lime.If the soda lime is excessively purple, it is scavenging a lot of CO2; inspect the hypoxia chamber for issues and add more soda lime when performing the next exposure."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}