{
  "id": 18753,
  "origin_website": "Jove",
  "title": "Adjustable Stiffness, External Fixator for the Rat Femur Osteotomy and Segmental Bone Defect Models",
  "procedures": [
    "Animal care and experimental protocols were followed in accordance with NIH guidelines and approved by the Beth Israel Deaconess Medical Center Institutional Animal Care and Use Committee, Boston, MA. (Protocol Number: 098-2009)\n1. Preparation of Surgical Materials and Instruments\nSterilize all surgical materials and instruments used to perform surgery prior to use. Pack needed materials, with or without an instrument tray, inside a folded cloth or wrapped paper and seal with autoclave tape for steam sterilization. The temperature of the autoclave should be at 125-135 ºC for 20-25 min of sterilization time, and then 10-15 min of drying time.\nMake sure that at the time of surgery the rats are 200-250 g. This is very important because if the rats are heavier in size, then a different sized fixator should be used. For rats heavier than 250 g a larger version of the external fixator system should be used.\n2. Surgical Procedure and Application of the External Fixator\nPurchase Sprague-Dawley (or any other strain) rats (male or female, 200-250 g) from any certified animal supplier. Follow the appropriate animal care and experimental protocols in accordance with national guidelines that is approved by the investigator’s Institutional Animal Care and Use Committee. Allow a minimum of 48 hr acclimatization period before the procedure.\nFor surgery, transport the rat to a dedicated surgical procedure room.",
    "Anesthetize the rat with isoflurane first via induction chamber, and then continue with face mask connected to an anesthesia machine at a rate of 1.5-2% in 1-1.5 L of O2/min. At the start of surgery make sure the animal is under deep anesthesia. To do this, use pedal reflex technique by extend the limb and pinching the web between the toes with the fingers (not the toe itself!). The animal is not sufficiently anesthetized if the limb is withdrawn, muscle twitch occurs or if the animal makes noise.\nAfter the rat is under deep general anesthesia for surgery, inject the antibiotic (cefazolin, 20 mg/kg) and the analgesic buprenorphine (dose 0.08 mg/kg) intramuscularly in the right leg. To avoid large amount of fluid loss during the surgery administer warm sterile saline subcutaneously at 3-5% of the body weight prior to the surgery, and if it’s necessary at the end. Apply sterile eye ointment to the eyes to keep them hydrated to prevent corneal injury.\nFollowing the drug injections, shave and clean the entire right hind leg of the rat with chlorohezadine or other disinfecting solution and transfer the animal to the surgical table. (The leg operated upon must be the same as the one that was injected.)\nPlace the animal on a heated surface in the prone position (Figure 1A). Make sure the facemask remains on the nose and mouth after the transfer to the surgical table, and maintain the anesthesia regimen mentioned in 2.3). Drape the area of the surgical procedure with a sterile fenestrated drape so that only the leg intended for surgery is exposed.",
    "Make an approximate incision of 3-4 cm (Figure 1B) through the skin running craniolateral on the surface of the right femur from the greater trochanter to the supracondylar region of the knee using a scalpel (Figure 1C). Expose the shaft of the femur by gentle dissection separating the fascia lata, and making sure that the muscle tissue is not cut. After that, separate apart the M. vastus lateralis and M. biceps femoris and lift the M. tensor fasciae latae to expose the full length of the femur (making sure that the sciatic nerve is preserved; Figure 1D).\nIn the planned area of osteotomy, prepare the femur along the midway area of the diaphysis by releasing the surrounding muscle tissue from the femur. First, start by putting the Henahan elevator perpendicular to the exposed surface of the femur, and then using a scalpel, release the muscle in the adjacent area.\n\t\nContinue by advancing forward and go around the femur, staying close to the bone surface, until all of the surrounding muscle tissue is released from the entire middle section of the bone (where the defect will be created), and the muscle tissue is completely cleaned from the bone. While doing this, it is very important to stay close to the bone surface to avoid cutting any major vessels.",
    "For a 5 mm large bone defect, loop 2 pieces of Gigli wire saw (0.22 mm) around the bone in medio-lateral orientation (Figure 1E,F). After looping the wire saw, position one piece on the distal side of the femur, close to the knee joint, and a second piece on the proximal side close to the hip joint. Clamp the Gigli wire saw pieces on each side using S-shape curved dissecting and ligature forceps, so that it stays in the intended place. If a single cut osteotomy is planned, then only use one piece of wire saw.\nUse the external fixator plate as a template to determine the exact position of the implant. The position of the external fixator has to be as close as possible to the center of the femur.\n\t\nPosition the external fixator plate on the anterolateral surface of the bone. This is achieved by externally rotating the femur. In that position the soft tissue layer is at its thinnest, which prevents excessive soft tissue tension under the fixator plate after the wound is closed.\nThen slightly lift the external fixator plate off the bone surface to make sure that the holes of the plate are centered to the bone surface. Hold the external fixator with a small clamp for it to stay parallel to the longitudinal axis of the bone, and then use a power tool or a hand drill to predrill the first hole on the proximal side of the femur with the 0.79 mm drill bit. Before advancing forward, make sure that the tip of the drill bit is still centered on the bone surface .",
    "If the tip of the drill keeps slipping, use the 1.00 mm counter sinker (Figure 8F) to center the position of the first hole. The counter sinker should be used to position all remaining mounting pins. This will ensure a perfect alignment of the drill holes and the fixator plate relative to the bone surface.\n3. External Fixator Implantation Method Using Saw Guide\nMake sure that the plate of the external fixator is not mounted upside down before clipping it on the saw guide. Determine this by comparing the size of the holes on the plate. The correct side is with the larger hole’s diameter facing up. If the difference between the size of the holes within the fixator is not apparent, use the counter sinker.\n\t\nInsert the tip of the counter sinker into one of the holes on the fixator plate, if the counter sinker easily fits into the hole then this is the upside of the fixator, however, if the tip of the counter sinker doesn’t fit then this is a bottom side of the fixator, and has to be flipped for the implantation accordingly.\n\t\t(Important: Make sure to drill perpendicular to the longitudinal axis of the bone as this will ensure a perfect orientation of the fixator to the bone surface. The direction of the first drill hole determines the final orientation of the fixator on the bone. Remember the mounting pins are the same length, and if the fixator is not parallel to the longitudinal axis of the bone the distance between the fixator and the bone will vary too much and might prevent the ability of all four mounting pins to penetrate both cortices.)",
    "After the orientation is confirmed, clip the plate on the saw guide (Figure 2A,B) and then clip the unit on the bone so that the first predrilled hole is aligned with the first hole on the plate (Figure 2C). Use the 0.70 mm square box wrench inserted into the hand drill to drive the first mounting pin into the hole. Doing this will permit reproducible positioning for the remaining mounting pins.\nAfter the first mounting pin is in place, then drill the most distant hole from the first mounting pin on the distal side, and drive the second mounting pin into the hole. The implantation order of the two middle mounting pins is not important.\n4. External Fixator Implantation Method Without the Saw Guide:\nThe application of the external fixator can be also performed without using the saw guide. The beginning steps of the external fixator implantation are the same up until the unit with the saw guide is clipped on the bone (step 3.1). If the saw guide is not used, it is very crucial to keep the fixator plate in the correct orientation during the entire application procedure. The femur needs to be externally rotated in the anterolateral direction.\nHold the external fixator plate with a small clamp or S-shape curved dissecting and ligature forceps so that it is parallel to the longitudinal axis of the bone (Figure 3A). The application of the first mounting pin will determine the alignment of the fixator, therefore, the rotation of bone has to be retained until the first pin is inserted (Figure 3B). After the first pin is in place, carefully use the forceps to hold the fixator plate that is acting as a drill guide.",
    "Insert the drill bit into the second hole – this is the most distal hole to the planned osteotomy gap (Figure 3C). Before drilling, check to make sure that the second hole has the same orientation as the first hole; also make sure that after the drilling is complete, both cortices are penetrated.\nInsert the 0.70 mm square box wrench to the hand drill and then insert the mounting pin into the tip. Carefully insert it into the plate of the external fixator without losing the alignment of the first predrilled hole.\nAs soon as the tip is in contact with the bone, start turning the wrench under continuous axial loading applied to the proximal end of the hand drill. After about 5 full turns, make sure that the thread at the proximal end of the mounting pin catches the external fixator plate’s body. This thread locks the system. Stop turning when the end of the bone thread is close to the top surface of the bone (Figure 3D).\nAfter the pins on the most distal and proximal side are in place, predrill the remaining two middle holes. The implantation order of the two middle pins is not important (Figures 3C).\nAfter the external fixator is in place, use the 0.22 mm Gigli wire saw directed by the saw guide to make the segmental defect (Figure 4A). If the latter method is chosen, the saw guide is clipped before making a defect.",
    "For this, pass a 0.22 mm Gigli wire saw through the 2 grooves underneath the femur (Figure 5A) to create a 5 mm segmental defect by reciprocal motion back and forth (Figure 5B) using sufficient irrigation (use 5 ml syringe to dispense saline at the time of the defect creation). To avoid damage to the soft tissue, cut the saw wire close to the bone on one side after completing the osteotomy. Remove the saw guide (Figure 4B).\nAfter the defect or osteotomy is created, remove the saw guide and close the wound in layers, the muscle first (Figure 4C), and then the skin (Figure 4D). Before the wound is closed, treat the defect as planned in the study protocol. Close the muscular layer and the fascia lata using Ethibond vicryl suture 4-0, and the skin using Ethicon Monocryl 3-0 suture. Avoid dragging suture material over non-sterile surfaces while suturing wounds. Note: To avoid wound biting, the suture must not end distal to the lower implant. Likewise, skin glue can be used instead of a suture.\nOn the first three postoperative days, give the rat analgesic every 12 hr and antibiotic every 24 hr. Of course, the post-operative regimen of drugs will vary depending upon the make and brand of the drugs used by each investigator (refer to drug specification instructions).\nMonitor animals frequently after the procedure to make sure they recover from anesthesia and only then return them to the housing facility. Provide solitary housing for the first few days after the surgery to make sure that there are no complications.",
    "Monitor water, food intake and body weight after the surgery to make sure the animal is not in pain and distress. If the animal shows a decreased activity level, difficulty moving around (possible implant failure), ataxia, unkempt greasy fur, porphyrin staining around eyes and nostrils, hunched posture, respiratory distress, reduced intake of food and water, etc. consult a veterinarian.\n5. Change of External Fixator Stiffness In vivo\nIf the study protocol requires the change of fixator stiffness during the healing process in vivo this is achieved by changing the connection elements secured with the special interlocking screws using 0.5 mm square wrench box attached to the hand drill. For this procedure, anesthetize the rat (refer to the 2.3 in the protocol) and give analgesia (refer to the 2.4 in the protocol) only once at the time of the procedure (Figure 6A).\n\t\nSedate the rat, and then insert the tip of the 0.50 mm square box wrench into the interlocking screw attached to the side of the assembled fixator, and start carefully turning it counter clockwise until the pin is half way out (Figure 6B). After this part is complete, repeat the procedure for the second pin that is on the same side of the external fixator plate (Figure 6C).\nWhen both pins on the same side are half way out, use forceps or a clamp to remove the connection element on the opposite side with a gentle motion (Figure 6D). The connection element should come off easy, if it doesn’t, then do an additional couple of turns on both interlocking screws to make sure that the tip of the interlocking screw is not imbedded in the connection element.",
    "After the connection element is removed, slide the desired stiffness connection element in place of the removed one (Figure 6E), and from the opposite side using the square box wrench start turning until the interlocking screw is half way out on the opposite side (Figure 6F). Repeat the same procedure for the second interlocking screw (Figure 6G). Important: this will require switching to the opposite side of the plate to make sure that both interlocking screws are half way out on the side where the connection element was replaced (Figure 6H,I).\nAfter this part is successfully completed, remove the second connection element (Figure 6J) and replace it with the same stiffness connection element as the one replaced on the opposite side (Figure 6K). After the second connection element is in place, start driving the interlocking screw until the interlocking screw end exits the opposite side of the plate, and the interlocking screw tip has exited the same amount on each side (Figure 6L). Repeat the same procedure for the second interlocking screw (Figure 6M,N). This procedure takes about 15 min to complete.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}