{
  "id": 8089,
  "origin_website": "Bio",
  "title": "Quantification of Retro- and Lentiviral Reverse Transcriptase Activity by Real-time PCR",
  "procedures": [
    "Overview of the procedure:Preparations (see A): Make the lysis buffer / RNase inhibitor mix and qRT-PCR reaction mix.Lysis of the viral samples (see B): Addition of lysis buffer to the viral supernatant to release reverse transcriptase.qRT-PCR (see C): Addition of qRT-PCR reaction mix to the lysed samples, followed by the reverse transcription and quantitative PCR reaction.Analysis (see D): Calculation of the reverse trancritpase activity of the samples based on the obtained standard curve.Preparations:Calculate the amount of samples that will be included in the RT assay (x samples).Always include:Standard curve (SC) (containing 7 dilutions of viral supernatant or 7 dilutions of recombinant HIV reverse transcriptase + 1 medium control = 8 samples). 3 control viral supernatant (C ) (= 3 samples)your samples (S)Make a mixture of 2x lysis buffer and RNase inhibitor (40 U/μl) (see Table 1): Table 1. Required Lysis buffer/RNase inhibitor table:\n﻿0,1,2\n,Reagent per reaction (1 sample),Reagent for all reactions ((x *1.25) samples)\n2x lysis buffer,5 μl,5*(x*1.25) μl\nRNase inhibitor (40 U/μl),0.1 μl,0.1* (x*1.25) μl\nNotes: 1) lysis buffer is very viscious. Therefore always make 25% extra and do not vortex to avoid formation of bubbles. 2) keep RNase inhibitor on ice.Calculate the amount of samples that you will measure by qRT-PCR (n samples)Always include:Each sample in duplicate (= x*2 samples)H2O twice (= 2 samples) (negative control of the qPCR)Make the qRT-PCR reaction mix (see Table 2a [Light Cycler 480] or Table 2b [ABI 7300].): Notes: 1) Make 10% extra.2) Keep LC 480 Sybr Green I mix, MS2 RNA and RNase inhibitor on ice.3) Do not vortex LC480 Sybr Green I mix.4) RNase inhibitor has to be diluted 10x in H2O (final concentration: 4 U/μl).Table 2a. qRT-PCR reaction mix for use on LightCycler 480 (384 well plates)table:\n﻿0,1,2",
    ",Reagent per reaction (1 sample),Reagent for all reactions ((n *1.1) samples)\nLC 480 Sybr Green I (2x),10 μl,10*(n*1.1) μl\nFwd primer (100 μM),0.1 μl,0.1* (n*1.1) μl\nReverse primer (100 μM),0.1 μl,0.1* (n*1.1) μl\nMS2 RNA,0.1 μl,0.1* (n*1.1) μl\n\"RNase inhibitor (10x diluted in H2O, final concentration: 4 U/μl)\",0.1 μl,0.1* (n*1.1) μl\nTable 2b. qRT-PCR reaction mix for use on ABI 7300 real-time PCR system (96 well plates)table:\n﻿0,1,2\n,1 sample,(n *1.1) samples\nEurogentec qPCR core kit for SYBR Green I,10.6 μl,10*(n*1.1) μl\nFwd primer (100 μM),0.1 μl,0.1* (n*1.1) μl\nReverse primer (100 μM),0.1 μl,0.1* (n*1.1) μl\nMS2 RNA,0.1 μl,0.1* (n*1.1) μl\n\"RNase inhibitor (10x diluted in H2O, final concentration: 4 U/μl)\",0.1 μl,0.1* (n*1.1) μl",
    "Lysis of the viral samplesAdd 5 μl of the viral supernatant or standard curve per well of a 96W U bottom plate.Add 5 μl of Lysis buffer/RNase mix to each well and mix.Incubate 10 min at room temperature (RT).Add 90 μl nuclease-free water to each well and mix. Spin plate for 3 min at 1,600 x g at RT in table top centrifuge.Keep the plate on ice until transfer to the 384W [LightCycler 480] OR 96W [ABI 7300] qPCR plate. qRT-PCRTake a cooling element out of the -20 °C and cover the cooling element with aluminium foil. Put the 384W [LightCycler 480] OR 96W [ABI 7300] plate on the aluminium foil during the filling of the plate to prevent evaporation.Put 10.4 μl [LightCycler 480] OR 11 μl [ABI 7300] of qRT-PCR reaction mix in each well of 384W [LightCycler 480] OR 96W [ABI 7300] plate.Resuspend all the viral samples in the lysate plate. Add 9.6 μl [LightCycler 480] OR 9 μl [ABI 7300] of sample to each well and resuspend.Seal the plate using Sealing foil [LightCycler 480] OR Optical Adhesive film [ABI 7300], by removing the protective layer and press it to the plate using the applicator.Spin the plate at 1,600 x g for 3 min at RT in table top centrifuge. Run reaction:Light Cycler 480:Detection format: Sybr Green/HRM dyeReaction volume: 20 μlProgram:Step 1: Reverse transcription (rt): 42 °C for 20 min.Step 2: Pre-incubation: 95 °C for 5 min.Step 3: Amplification: 40 cycles of            95 °C for 5 sec            60 °C for 5 sec + detection             72 °C for 15 secStep 4: Melting curveStep 5: CoolingRun on the ABI Prism 7300: Reaction volume: 20 μlProgram:Step 1: Reverse transcription (rt): 42 °C for 20 min.Step 2: Pre-incubation: 95 °C for 2 min.",
    "Step 3: Amplification: 40 cycles of            95 °C for 5 sec            60 °C for 30 sec + detection            72 °C for 15 secStep 4: Melting curveAnalysisExport the obtained Cq (Cycle of quantification) values from the LC480 or ABI Prism 7300.Calculate for each sample the average Cq value of the duplicate measurements.Make the standard curve: plot the average Cq value of SC1-SC7 versus the logarithm of the RT activity (expressed as mU RT/ml), determine the trendline and the formula expressing the correlation between the Cq values and the logarithm of the RT activity.Use the obtained formula to calculate the absolute RT value of the samples."
  ],
  "subjectAreas": [
    "Microbiology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}