{
  "id": 9301,
  "origin_website": "Jove",
  "title": "Combining X-Ray Crystallography with Small Angle X-Ray Scattering to Model Unstructured Regions of Nsa1 from S. Cerevisiae",
  "procedures": [
    "1. Recombinant Protein Production and Purification of Nsa 1\nNsa1 Expression Plasmid Design and Cloning\n\t\nObtain or purchase S. cerevisiae genomic DNA.\nPCR amplify the target sequences of Nsa1 (Nsa1FL, residues 1-463) and C-terminal truncated Nsa1 (Nsa1ΔC, residues 1-434) with appropriate primers using genomic DNA isolated from S. cerevisiae and a melting temperature of approximately 60 °C with an extension time of 1-2 min. The following primers were used to amplify Nsa1:\n\t\tSC_Nsa1_FLFw:CGCCAAAGGCCTATGAGGTTACTAGTCAGCTGTGTGGATAG\n\t\tSC_Nsa1_FLRv:AATGCAGCGGCCGCTCAAATTTTGCTTTTCTTACTGGCTTTAGAAGCGC\n\t\tSC_Nsa1ΔcFw:GGGCGCCATGGGATCCATGAGGTTACTAGTCAGCTGTGTGG\n\t\tSC_Nsa1ΔcRv: GATTCGAAAGCGGCCGCTTAAACCTTCCTTTTTTGCTTCCC\nSubclone Nsa1 into the Escherichia coli (E. coli) expression vector pHMBP containing an N-terminal 6X-Histidine tag followed by the Maltose Binding Protein (MBP) and a Tobacco Etch Virus (TEV) protease site using standard cloning techniques17.\nUse DNA sequencing to verify that Nsa1 was cloned in frame with the N-terminal His-MBP tag.\nNsa1 Protein Expression\n\t\nTransform the expression plasmid(s) into a suitable E. coli expression strain with a T7 promoter-based system. Plate the transformants on LB agar plates containing 100 µg/mL ampicillin and incubate the plate inverted overnight at 37 °C.\nInoculate a 50 mL culture of LB with 100 µg/mL ampicillin from the transformation plate, and grow it overnight with shaking at 200 rpm at 37 °C.\nInoculate 3 x 1000 mL of LB in Fernbach flasks with 100 µg/mL ampicillin with 15 mL of the overnight culture and grow it with shaking at 200 rpm at 37 °C.\n\t\tNOTE: For protein structure solution, selenomethionyl (SeMet) incorporation can be achieved by growing cells in M9 minimal medium that is supplemented with SeMet and an amino acid mixture to inhibit methionine production prior to induction, as opposed to LB media18.",
    "Induce expression of Nsa1 when the OD600 reaches ~0.8 by addition of isopropyl β-D-1 thiogalactopyranoside (IPTG) at a final concentration of 1 mM followed by incubation at 25 °C overnight with shaking at 200 rpm.\nHarvest cells by centrifugation at 4 °C for 15 min at 5,050 x g.\n\t\tNOTE: Cells can be stored long-term at -80 °C or used immediately for protein purification.\nNsa1 Protein Purification\n\t\nResuspend the cells in 25 mL of Lysis buffer (50 mM Tris-HCl, pH 7.5, 500 mM NaCl, 10% glycerol, 10 mM MgCl2) pre-chilled at 4 °C containing one EDTA-free protease inhibitor tablet.\nLyse cells by sonication at 4 °C (time 7 min, 2 s on cycle, 2 s off cycle; amplitude: 70%).\nClarify lysate by centrifugation at 26,900 x g for 45 min at 4 °C.\nApply clarified lysate to a gravity flow column loaded with 10 mL of immobilized cobalt affinity resin, pre-equilibrated with Lysis buffer.\nAllow the supernatant to pass over the resin by gravity flow at 4 °C and wash the resin twice with 100 mL of Lysis buffer.\nElute Nsa1 with 20 mL of Elution buffer (50 mM Tris-HCl pH 7.5, 500 mM NaCl, 5 mM MgCl2, 5% glycerol and 200 mM imidazole).\nTake 15 μL of the eluate and run it on a 4-15% SDS-PAGE gel to verify that the protein is eluted from the affinity resin (Figure 1A).\nRemove the MBP tag by TEV protease digestion. Add 1 mL of TEV protease19 (1 mg/mL stock) to the Nsa1 affinity resin elution and incubate it at 4 °C overnight.\nConcentrate MBP cleaved Nsa1 to ~ 5 mL using a centrifugal filter with a molecular weight cut off of 10 kDa.",
    "Apply MBP-cleaved Nsa1 to a gel-filtration column, pre-equilibrated in buffer A (20 mM Tris-HCl pH 7.5, 100 mM NaCl, 1 mM MgCl2, 5% glycerol and 1 mM β-mercaptoethanol) (Figure 1B).\nAnalyze column fractions from gel filtration to verify that MBP is cleaved and separated from Nsa1 by running 15 μL samples on a 4-15% SDS-PAGE gel (Figure 1B).\nCombine fractions containing Nsa1 and concentrate to 8 mg/mL using a centrifugal filter with a molecular weight cut off of 10 kDa.\nDetermine the protein concentration by measuring the absorbance at 280 nm on a spectrophotometer using the extinction coefficient 42530 M-1cm-1. Use protein immediately for proteolytic screening and crystallization trials.\n2. Crystallization and Proteolytic Screening of Nsa 1\nSparse Matrix Crystal Screening of Nsa1\n\t\nCentrifuge 500 μL of the 8 mg/mL stock of Nsa1 at 16,000 x g at 4 °C for 10 min.\nSetup crystallization trials using a crystallization robot and sparse matrix crystal screens. Fill the reservoir of 96 well trays with 30 μl of the individual crystal screen reagents from sparse matrix crystallization screens. Setup sitting drops with the robot by mixing 250 nL of the well solution with 250 nL of the protein solution.\nSeal the crystallization plates with tape and incubate them at 25 °C.\nInspect the plates every two days for the first 2-3 weeks with a stereomicroscope.\nVerify that potential crystals hits contain protein with a UV microscope.\n\t\tNOTE: For Nsa1 two different crystal forms (cubic and orthorhombic, Figure 2A) were obtained within 1 week from the following screens: JCSG+ condition B11 (1.6 M sodium citrate tribasic dehydrate, pH 6.5) and Wizard Precipitant Synergy Screen Block 2 condition C11 (20.1%(v/v) PEG 1500, 13.4%(v/v) PEG 400, 0.1 M Tris HEPES/sodium hydroxide, pH 7.5).\nProteolytic Screening",
    "NOTE: During crystallization optimization, it was discovered that the orthorhombic crystals of Nsa1 arose as a result of proteolytic cleavage and the crystals could not be duplicated using the full-length protein. Using a combination of limited proteolysis coupled with mass spectrometry, it was determined that the C-terminus of Nsa1 was sensitive to proteolysis and removal of the C-terminal tail was required for subsequent reproduction of the orthorhombic crystal form (Nsa1ΔC).\n\t\nPrepare 1 mg/mL protease stock solutions of the following proteases α-chymotrypsin, trypsin, elastase, papain, subtilisin, and endoproteinase Glu-C.\nCreate 1:10, 1:100, and 1:1000 dilutions of each 1 mg/mL protease stock with Dilution Buffer (10 mM HEPES, pH 7.5, 500 mM sodium chloride).\nPipette 1 μL of protease stock (1:10, 1:100 and 1:1000) into 9 μL aliquots of protein (1 mg/mL) for each protease to be screened.\nIncubate the solution at 37 °C for 1 h.\nStop the reaction by adding 10 μL of 2x SDS-PAGE sample buffer and heat the reaction at 95 °C for 5 min.\nAnalyze the digests by running them on a 4-15% SDS-PAGE gel (Figure 2B).\nIdentify protease resistant domains of the target protein by in-gel mass spectrometry analysis.\nRemove the protease-labile regions from the target protein by creating truncated expression constructs and following the cloning, expression, and purification protocol described above.\nCrystallization Optimization\n\t\nPrepare or obtain stock solutions of the following initial crystallization reagents: 1.6 M sodium citrate tribasic dehydrate pH 6.5, 100%(v/v) PEG 400, 50%(v/v) PEG 1500, 1 M HEPES/sodium hydroxide, pH 7.5.\nPrepare a stock solution of Nsa1FL and Nsa1ΔC at 8 mg/mL as described above.\nOptimize the Nsa1 cubic crystals (Nsa1FL).",
    "Prepare a 24-well grid screen with wells containing 500 µL with a gradient of 1-1.6 M of sodium citrate with pH 6.5 from a stock solution of 1.6 M sodium citrate tribasic with pH 6.5.\nMix 1 µL of protein with 1 µL of well solution and place the mixture onto a siliconized cover slide. Carefully invert the cover slide on top of the pre-greased well and ensure it is well sealed but take care to not disturb the drop or break the cover slide. Repeat this process until the tray is filled and then store at 25 °C.\n\t\t\tNOTE: Small cubic crystals should appear in 2-7 days.\nPrepare a microseed stock of the cubic crystals. Use a mounted nylon loop to transfer ~10 small cubic crystals to a 1.5 mL micro-centrifuge tube containing a small bead and 50 µL of 1.6 M sodium citrate tribasic wit pH 6.5.\nVortex the 1.5 mL micro-centrifuge tube at high speed (~ 3000 rpm) for 1 min.\nMake a series of 10-fold serial dilutions of the seed stock with 1.6 M sodium citrate tribasic and vortex the mixture thoroughly for 5 s.\nFill each well of a 24-well grid, screen with 500 µL of 1.6 M sodium citrate tribasic pH 6.5.\nOptimize the microseeding conditions by setting up drops with varying ratios of protein with the seed stock solutions (Figure 3A). Larger cubic crystals of high diffraction quality should appear in 2-5 days (Figure 3C).\nOptimize the orthorhombic crystals (Nsa1ΔC)\n\t\t\nPrepare a grid screen with 500 µL in each well with 24 different conditions (Figure 3B) from stock solutions of 50%(v/v) PEG 1500, and 100%(v/v) PEG 400. In addition to gradients of PEG 1500 and PEG 400, each well should also contain 0.1 M HEPES/sodium hydroxide pH 7.5.",
    "Mix 1 µL of protein solution with 1 µL of well solution on a siliconized cover slide. Carefully invert the cover slide on top of the pre-greased well and ensure it is well sealed. Repeat this process until the entire tray has been filled. Store the trays at 25 °C.\n\t\t\tNOTE: Nsa1 orthorhombic crystals should appear in 2-7 days.\nFurther optimize the orthorhombic crystals by microseeding as described for the cubic crystals (steps 2.3.3.3 to 2.3.3.7) using 500 µL of 20.1%(v/v) PEG 1500, 13.4%(v/v) PEG 400, and 0.1 M HEPES/sodium hydroxide pH 7.5 as the well solution.\n\t\t\tNOTE: Nsa1 SeMet crystals should be optimized analogous to the native crystals.\n3. X-ray Diffraction Data Collection and Nsa 1 Structure Solution\nCryo-protection of Crystals and X-ray Diffraction Data Collection\n\t\nFor the orthorhombic crystals (Nsa1ΔC), prepare a 1 mL cryoprotectant solution containing 22.5%(v/v) PEG 1500, 15%(v/v) PEG 400 and 0.1 M HEPES/sodium hydroxide pH 7.5.\nFill a foam Dewar with liquid nitrogen, and pre-cool a crystal puck. Use caution when working with liquid nitrogen and wear protective gloves and goggles.\nCarefully invert the cover slide of the crystallization well containing crystals onto the stage of a stereomicroscope.\nPipette 2 µL of the cryoprotectant solution onto a new cover slide.\nAttach a mounted nylon loop of the appropriate size for the crystal to a magnetic cryo wand.\nUsing the aid of the stereomicroscope, quickly transfer a crystal to the cryoprotectant solution with the mounted cryo loop.\nLet the crystal equilibrate for 5 min in the cryoprotectant solution.\nUsing the aid of the stereomicroscope, quickly loop the crystal from the cryoprotectant solution and plunge-freeze into liquid nitrogen.\nWait for the liquid nitrogen around the loop to stop boiling and then release the loop from the wand into a specific location within the crystal puck.",
    "Cubic Nsa1FL crystals do not need to be cryoprotected and can be directly flash frozen (following steps 3.1.8-3.1.9 above).\nSeal the crystal puck using cryo tools and transfer to a shipping cane in a pre-chilled dewar. Store crystals in the pucks/dewars until data collection.\nIf collecting data at a synchrotron, ship crystals to the synchrotron using a dry shipper.\nCollect X-ray diffraction data following standard techniques20.\n\t\tNOTE: For Nsa1 native and SAD (single-wavelength anomalous dispersion) datasets were collected at 100 K on the SER-CAT beam lines 22-ID and 22-BM of the Advanced Photon Source at Argonne National Laboratory (Chicago, IL). The SAD Nsa1 dataset was collected at λ= 0.97911 Å. Data was recorded using a 1 s exposure time and 0.5° oscillations. The mosaicity of these crystals was typically around 0.3°.\nProcess and scale the X-ray diffraction images to generate reflection files for each data set in the appropriate space group.\n\t\tNOTE: Nsa1 diffraction datasets were processed with HKL200021. The Nsa1 cubic crystals were processed in the space group P213 and the orthorhombic crystals were processed in the space group P212121.\nNsa1 Structure Solution.\n\tNOTE: There are several crystallography software packages that can be used to solve and refine crystal structures including Phenix and CCP422,23. Following is the protocol for Nsa1 structure solution using the Phenix software suite22.\n\t\nAnalyze the Native and SAD scaled datasets with phenix.xtriage22.\nSolve the structure of Nsa1 with Phenix.autosol using the SAD peak reflection file22,24. To run the program of AutoSol, input the number of selenomethionine sites (sites= 9), the fasta sequence file of Nsa1ΔC, and the wavelength used for SAD data collection (λ= 0.97911 Å).\n\t\tNOTE: From the Nsa1 SAD dataset, phenix.autosol should be able to determine the experimental phases and build most of the model.",
    "Make manual adjustments to the model with Coot25, followed by refinement in phenix.refine22,26.\nSolve the structure of the high-resolution native orthorhombic crystal and the cubic crystal by molecular replacement using Phaser27,28.\nAfter successful structure solution, inspect the model and the electron density map in Coot25.\nBuild and refine the structures by running iterative rounds of refinement in phenix.refine22,26 and model building in Coot25.\n4. SAXS Data Collection, Processing, and Modeling\nSAXS Data Collection\n\tNOTE: SAXS data were recorded for full-length S. cerevisiae Nsa1 at the Advanced Light Source, on the high-throughput SIBYLS beamline 12.3.1 at Lawrence Berkeley National Laboratory, Berkeley, CA29.\n\t\nPurify Nsa1FL following the protocol described above. 24 h prior to shipment of Nsa1FL to the beamline, run protein over a gel filtration column pre-equilibrated in buffer A.\nPool fractions containing Nsa1 and determine the protein concentration as described earlier.\nPrepare 30 μl aliquots of a concentration series of Nsa1 from 1 to 6.2 mg/mL using buffer A.\nTransfer 20 μl of each concentration series of Nsa1 to a clear full skirt 96 well microplate along with buffer A alone controls.\n\t\tNOTE: SAXS data is collected on dilute solutions using several concentrations of purified sample to avoid aggregation, inter-particle repulsion, and radiation damage effects.\nSeal the microplate with a silicone sealing mat and ship overnight at 4 °C to the beamline.\nStore the microplate at 4 °C until data collection.\nImmediately before data collection, spin the plate at 3200 x g for 10 min at 4 °C to remove potential aggregates and air bubbles.\nRecord SAXS data.\n\t\tNOTE: For Nsa1, SAXS data were recorded for the buffer before and after each protein concentration series. Thirty-three consecutive scans of 0.3 s were collected for Nsa1FL over a concentration series (1 to 6.2 mg/mL) at 10 °C.",
    "Perform buffer subtraction for SAXS data.\n\t\tNOTE: For Nsa1 buffer subtraction was done automatically at the beamline but buffer subtraction can also be performed using data reduction software such as Scatter30 and the ATSAS suite31. Buffer subtraction is a critical part of SAXS data analysis and care must be taken to ensure that the buffer used for subtraction is identical to the protein sample buffer.\nAverage the 33 consecutive scans to create a *ave.dat file for each concentration.\n\t\tNOTE: Overlay the 33 consecutive frames to compare the curves. Changes to the scattering curves over time is often indicative of radiation damage. Exclude these frames from averaging. Averaging of the Nsa1 consecutive scans was performed automatically at the SIBYLS beamline.\nSAXS Data Processing and Comparison of Concentration Series\n\tNOTE: There are several software packages that can be used to analyze SAXS data. For Nsa1 the radius of gyration and pair-wise distance distribution functions were determined using PRIMUS32 and Gnom33 from the ATSAS 2.7.2 suite31 and compared across all protein concentrations to ensure there was no radiation damage or concentration-dependent inter-particle interactions10.\n\t\nOpen a terminal shell and go to the directory containing the SAXS data.\nLaunch the PRIMUS32 GUI from within the terminal shell.\nWithin the PRIMUS GUI, load the scattering curves (*ave.dat).\nUse AutoRg to determine the Radius of Gyration (Rg) and forward scattering intensity I(0), for each scattering curve (*ave.dat).\nGenerate Kratky plots for each scattering curve (*ave.dat), to evaluate the degree of compactness.",
    "Use AutoGNOM33 to calculate the pair-wise distribution function (also called P(r)) for each scattering curve (*ave.dat). Enter a starting Dmax ≈ 3*Rg and optimize the Dmax value to obtain a smooth P(r) curve. During the optimization of Dmax, ensure that the calculated P(r) function is consistent with the experimental scattering curve by checking the reported χ2 value and visually assessing the overall fit to the scattering curve.\nCalculate the molecular weight of Nsa1 from the scattering curves using the volume of correlation34.\nCompare the structural parameters for each concentration to ensure that there are no radiation damage or concentration-dependent effects.\n\t\tNOTE: Concentration effects can manifest as an increasing Rg and Dmax in relation to an increasing protein concentration. Forward scattering I(0) divided by the sample concentration should also remain constant across the protein concentration series.\nSAXS Modeling\n\tNOTE: To determine the position of the C-terminus of Nsa1FL, the Nsa1 crystal structure10 (PDB 5SUM) and the SAXS scattering curves were used to carry out a combination of rigid body and ab initio modeling, using the programs BUNCH35 and Ensemble Optimization Method (EOM)36 from the ATSAS software suite31. The WD40 domain of Nsa1 was treated as a rigid body, while the C-terminus of Nsa1 along with several disordered loops from the WD40 domain were modeled to fit the experimental SAXS data.\n\t\nGenerate the input PDB file(s). The PDB file must be split every time residues are missing from the main chain, and the PDB file cannot contain multiple conformations, ligands, or water molecules.\nRun the program Pre_BUNCH35 to prepare the input PDB file for BUNCH (pre_bunch.pdb). Input the sequence of the target protein (*.seq), the number of domains/PDBs generated in 4.3.1, and each of the individual PDB files generated above.",
    "Calculate the scattering amplitudes for each individual PDB file using the program CRYSOL37. To run CRYSOL input the individual PDB file and the experimental SAXS scattering curve (*.dat). This will generate an amplitudes file (*.alm).\nRun the program BUNCH35 to model the WD40 domain of Nsa1 against the SAXS data using a combined rigid body and ab initio approach. Input the PDB file from Pre_BUNCH (pre_bunch.pdb), the experimental SAXS scattering curve (*.dat), and the individual amplitude (*.alm) files for each partial PDB file generated by CRYSOL.\nCompare the χ2 value from the starting PDB (5SUM) with that from the ab initio model generated by BUNCH using the experimental SAXS data.\n\t\tNOTE: A successful BUNCH model should have a significantly lower χ2 value than the starting model. The theoretical scattering of the BUNCH model should also describe well the experimental data as judged by visual inspection of the overlay between the theoretical scattering of the BUNCH model to the SAXS data and its χ2 value (Figure 4, center pipeline).\nManually inspect the output files from BUNCH in Pymol38 to overlay the crystal structure with the model generated by BUNCH, and the SAXS envelope (Figure 4, center pipeline).\nRerun BUNCH 10-20 times to generate independent models to confirm that the models are similar.\n\t\tNOTE: For Nsa1 there was a range of χ2 values from ~1 to 3 from 20 independent runs.\nEnsemble Modeling\n\t\tNOTE: As an optional approach to BUNCH run either EOM36 or Minimal Ensemble Search39 (MES). EOM and MES use ensemble approaches, which are well suited for proteins with flexible domains/regions that are in multiple conformations.\n\t\t\nRun the program EOM36 using the ATSAS online server. To run EOM, input the PDB files from 4.3.1, the sequence of the target protein (*.seq), and the experimental SAXS data (*.dat).",
    "Compare the χ2 values from the starting PDB (5SUM) with that from the ensemble generated by EOM using the experimental SAXS data.\n\t\t\tNOTE: A successful EOM ensemble should have a significantly lower χ2 value than the starting model. The theoretical scattering of the ensemble should also describe well the experimental data as judged by visual inspection of the overlay between the theoretical scattering of the ensemble to the SAXS data and its χ2 value (Figure 4, right pipeline). One should also compare the χ2 values from BUNCH and EOM to determine which model best describes the experimental SAXS data.\nManually inspect the EOM conformers in Pymol38 to overlay the crystal structure with the conformers generated by EOM (Figure 4). Note the total number of conformers and the fraction of occupancy for each conformer that contributes to the scattering curve. For more rigid molecules, such as Nsa1, the number of conformers should be small (1-5) (Figure 4, right pipeline)36.\nRe-run EOM several times to ensure consistent results.\n\t\t\tNOTE: For Nsa1 the number of conformers was typically 3 to 4 with χ2 values ranging from 0.1 to 0.3.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}