{
  "id": 19133,
  "origin_website": "Jove",
  "title": "Segmentation and Measurement of Fat Volumes in Murine Obesity Models Using X-ray Computed Tomography",
  "procedures": [
    "1. Animals\nFor the results reported below, three C57BL/6J mice and four B6.V-Lepob/J mice were obtained from Jackson Laboratories (Bar Harbor, Main, USA). B6.V-Lepob/J mice represent one of the earliest models of obesity and remain actively researched. B6.V-Lepob/J mice exhibit a phenotype characterized by increased adipocyte size and number and can weigh up three times more than wild type mice.7,8 Here, B6.V-Lepob/J mice were employed as a positive control for an obese phenotype to illustrate the feasibility of the Albira CT system for CT based fat content measurements.\nImaging was performed when the animals reached approximately 12 weeks old. (Obesity in B6.V-Lepob/J mice is manifest after 4 weeks of age).\nMice were anesthetized by Isofluorane (2.5% flow rate) and kept under at 2.5% via a nose-cone setup for imaging. Animals were positioned prone in the standard rat bed (M2M Imaging Inc. Cleveland, OH) in supplied with the Albira image station. Limbs were positioned lateral from the torso for a uniform CT acquisition. \nAfter image acquisition was completed, mice were removed from the nose cone and returned to a recovery cage until ambulatory.\n2. Image Acquisition and Reconstruction\nImage acquisitions are performed using the Albira CT system (Carestream Molecular Imaging, Woodbridge, CT). Mice were anesthetized by Isofluorane (2.5% flow rate) and kept under at 2.5% via a nose-cone setup for imaging. Acquisitions were performed to scan a bed of 115 mm length, using 600 projections. The X-ray source was set to a current of 200 μA and voltage of 45 kVp, and used a 0.5 mm Al filter to harden the beam.\nApproximate radiation deep dose equivalent for CT settings was 220 mSv, and shallow dose equivalent was 357.4 mSv. These doses are over 20-fold lower than reported LD50 values.9",
    "Images are reconstructed using the FBP (Filtered Back Projection) algorithm via the Albira Suite 5.0 Reconstructor using \"Standard\" parameters. These combined acquisition and reconstruction settings produce a final image with 125 μm isotropic voxels, deemed sufficient for whole animal analysis. For detailed region specific analysis, a reconstruction with 35 μm isotropic voxels may be selected for a final resolution of 90 μm.\n3. Image Analysis\nImage analysis is performed using the PMOD (PMOD Technologies LTD, Zurich, Switzerland) analysis software. Images are segmented in PMOD according to tissue density-first for total volume and then for fat volume.\n3.1 Images may be reduced for analysis to minimize computational demands.\nTo reduce, navigate to the main View tab.\nSelect Tools > Reduce.\nSelect X by 2, Y by 2, and Z by 2.\nCheck Replace.\nSelect Run.\nThe message: \"Bounding box will change\" displays once the reduction is complete.\n3.2 Images can be masked to eliminate bed and nose-cone elements for subsequent volume-of-interest (VOI) analysis.\nTo mask, navigate to Planes, Layouts, Rotations, Mirror, 3D Markers > Planes & Layouts.\nSelect Show plane Z.\nScroll to the nose cone in the Z plane.\nSelect the main VOI tab > Draw vertices.\nDraw a region of interest (ROI) around the animal nose-excluding the bed and nose cone.\nSelect Copy Actual ROI.\nMove to the next slice, and paste ROI from buffer through the relevant planes of nose.\nUse Edit Group of Vertices to adjust the ROIs as necessary.\nSelect Delete ROI at the first planes beyond the nose cones.\nGenerate a new VOI to encompass the animal girth (excluding the animal bed) at the first planes beyond the nose cones.\nNavigate to VOI Tools > Masking & Algebra.\nEnter -1000 in the dialogue box provided.\nSelect the Mask voxels outside the selected VOIs button.",
    "The message: \"Irreversible data operation. Do you want to continue?\" displays.\nSelect Yes.\nNavigate to Planes, Layouts, Rotations, Mirror, 3D Markers >  Planes & Layouts.\nSelect Show all planes.\nExamine the VOI for integrity.\nSelect Save.\nSave as Analyze.\nChange the file name prefix.\n3.3 First, segment the image for total animal volume:\nSelect Tools > External.\nSelect the Segmentation check box.\nEnter a range of -300 to +3500 (density range reference derived from abdominal fat-region density range).\nSelect Run Segmentation.\nExamine the integrity of the segmentation.\nSelect OK.\nSelect Remove ROI.\nSelect VOI statistics.\nReported statistics represent the total volume.\nRecord the reported volume.\n3.4 Next, segment the image for fat volume:\nReturn to the non-segmented masked image for fat-volume segmentation.\nTo load the saved Masked data file, check the Analyze box in the Load window).\nSelect Tools > External.\nSelect the Segmentation check box.\nEnter a range of -200 to -50.\nSelect Run Segmentation.\nExamine the integrity of the segmentation.\nSelect OK.\nSelect VOI statistics.\nThe reported statistics represent the fat volume.\nRecord the reported volume.\nSelect Save.\nSave as Analyze.\nChange the file name prefix.\nOptional: If skin/peripheral density remains, the \"Erosion and Dilation\" protocol below may be performed to eliminate these regions for VOI analysis.\nSelect Tools > External.\nSelect the Morphological check box. The Morphological view displays.\nSelect Erosion.\nSelect OK.\nSelect Tools > External.\nSelect the Morphological check box. The Morphological view displays.\nSelect Dilation.\nSelect OK.\n4. Visualization of CT Images\n4.1 VolView v3.2 (Kitware, Clifton Park, NY, USA) was utilized to create rendered 3D visual displays of segmented images.\nOpen the CT data set in Analyze format.\nUse the default settings in the pop-up window.\nOpen the plug-ins menu.\nUnder Utility, select Merge volumes.\nUncheck Rescale Components.\nClick Assign Second Input.",
    "Choose the segmented fat data for the second input.\nUse the default settings in the pop-up window.\nClick Apply plug-in.\nDouble-click Volume view window for a larger view of the subject mouse.\n4.2 Return to the Color/Opacity tab. The component drop-down box refers to which data set is currently being edited. Two sliders are located at the bottom of the tab and determine the relative brightness of each component data set within the overlay, using values 0 to 1. For component 1, the CT, we prefer to use a grayscale color scheme. To change the color:\nIn the Scalar Color Mapping section, double-click on one of the color sliders.\nTo remove a slider, drag it out of the box.\nTo add a new slider, click anywhere within the slider area.\nRemove one of the sliders.\nMake the left color slider black (scalar value (S)= -19000).\nMake right color slider white ((S) = 15000).\nFrom the Scalar Opacity mapping box, create a new point by clicking within the box. This will give a total of three points in the window.\nFor the middle point, change the (S) to ~-3000, and the Opacity (O) value to 0.\nSelect the third point at the right of the window.\nChange (S) to about 32000, and O to .25.\nThe first point can be anywhere at left, just as long as the Opacity value is set to 0.\nChange to component two, which should edit the look of the fat.\nChange each of the color sliders to red by double-clicking and sliding the Hue (H) slider to the left to false-color map the fat to red. Very little else should be needed to adjust the look of the fat.\n4.3 To create a three-panel rotation movie displaying the CT, fat, and overlay:",
    "Click and the drag the subject mouse into an upright position with the back facing you.\nUnder Component Weights, set the value of Component two to 0 to display only the CT scan.\nClick Review > Camera.\nSelect a number of frames for the rotation movie (for the present case, we chose \"36\").\nChange the X rotation value to 360 degrees.\nSelect Create.\nIn the pop-up dialog box, create a new folder named CT, and save the file in tiff format, which will output a series of rotation images.\nRepeat this step for the fat image, as well as for the overlaid fat/CT image, saving them into individual folders each time.\n4.4 ImageJ v 1.43u was used to generate a rotation movie file using the VolView output images.\nIn ImageJ, select File > Import > Image Sequence.\nSelect the first image in the CT folder. The software will automatically detect the other files and open them as a stack.\nRepeat to open the fat and overlay sequences.\nOpen the ROI manager under Analyze > Tools > ROI Manager.\nDraw an ROI around the subject mouse, excluding needless background pixels.\nIn the ROI manager, click Add to add the ROI.\nSelect a different image sequence.\nIn the ROI manager, click the ROI to apply it to the picture. In this fashion, each of the cropped stacks will match up perfectly.\nWhen the ROI is on all the stacks, right-click within the ROI.\nSelect Duplicate.\nSelect Check the Duplicate Stack Box to separate the ROI from the rest of the image.\nClose the larger image stacks.\nRepeat this procedure for all three image sequences.\nGo to Image > Stacks > Tools > Combine to combine the stacks together.\nSelect CT for Stack 1.\nSelect Fat for Stack 2.",
    "Repeat, and select Combined Stacks for Stack 1 and Overlay for Stack 2.\nThere is now a three-panel, image-rotation stack that can be previewed by selecting Play in the lower-left corner of the image window.\nTo save the movie as an AVI, select File > Save as… > AVI…\nClick Save.\n5. Representative Results\nResults for three WT (C57BL/6J) mice and four obese (B6.V-Lepob/J) mice are reported here as a representative example of fat/total volume ratio measurements employing the Albira CT system. Figure 1 below provides a representative display created with VolView v3.2 for the segmentation (i.e. total volume and fat volume) of obese mice CT images.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3680/3680fig1.jpg\nFigure 1. Representative CT images segmented for fat. (A) Obese mouse (B6.V-Lepob/J) CT total volume in grayscale, (B) fat volume in red, and (C) image fusion. (D) WT mouse (C57BL/6J) CT total volume in grayscale, (E) fat volume in red, and (F) image fusion.\nTotal volumes, fat volumes, and calculated fat/total volume ratios are reported below in Table 1 for each WT mouse and each obese mouse. The averaged fat/total volume ratio for the WT group and the obese group was 0.09 and 0.42 respectively (Figure 2). The fat/total volume ratios for the WT mice versus the obese mice was found to differ significantly (p = 0.001).\ntable:\n﻿0,1,2,3,4,5,6,7\nWT (C57BL/6J),Total (cm3),Fat (cm3),Fat/Total Ratio,Obese (B6.V-Lepob/),Total (cm3),Fat (cm3),Fat/Total Ratio\nAnimal 1,28.79,3.00,0.10,Animal 1,66.25,26.75,0.40\nAnimal 2,33.25,3.05,0.09,Animal 2,61.15,26.31,0.43\nAnimal 3,30.30,2.63,0.09,Animal 3,64.19,25.7,0.40\n,,,,Animal 4,54.25,23.78,0.44\nTable 1. Total volume, fat volume, and fat/total volume ratios for WT and obese mice. Total and fat volumes were derived from segmented images using PMOD VOI analysis.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3680/3680fig2.jpg",
    "Figure 2. Averaged fat/total volume ratios for WT mice versus obese mice.  Averaged fat/total volume ratios for WT (C57BL/6J) and obese (B6.V-Lepob/J) found to be 0.09 and 0.42 respectively are displayed. (Error bars = single standard deviation). WT versus obese fat/total volume ratios were found to differ significantly (p-value = 0.001)."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}