{
  "id": 17499,
  "origin_website": "Jove",
  "title": "Preparation of Site-Specific Cytotoxic Protein Conjugates via Maleimide-thiol Chemistry and Sortase A-Mediated Ligation",
  "procedures": [
    "1. Conjugation of the Fc-domain with MMAE\nNOTE: Prior to site-specific conjugations prepare key reagents: highly pure protein of interest (in this case the Fc fragment and engineered FGF2 variant, as a starting point 1-5 mg of recombinant protein, prepared according to Sokolowska-Wedzina18), maleimidocaproyl-Val-Cit-p-aminobenzyl alcohol (PABC)-monomethyl auristatin E (MMAE) (CAUTION, highly cytotoxic agent, handle with care), Tris(2-carboxyethyl)phosphine‎ (TCEP) and sortase A16. Methotrexate linked to tetraglycine peptide (GGGG-MTX) (CAUTION, MTX is a highly cytotoxic agent, handle with care) can be either synthesized on the solid support phase according to the solid phase peptide synthesis (SPPS) method in the Fmoc strategy19 or obtained from commercial sources.\nTo reduce disulfide bonds within the Fc fragment (Figure 1), add tenfold molar excess of TCEP over the Fc protein (39 µM) in PBS (100 mM NaCl, 18 mM NaH2PO4, 33 mM Na2HPO4 pH 7.4) and incubate at 37 ˚C for 1 h. TCEP stock solution should have pH adjusted with 0.1 M NaOH to 6.0, in order to prevent protein precipitation from pH changes.\nAfter incubation, filter the reduced protein using 0.2 µm filter to remove protein precipitates.\nTo the new reaction tube add first four-fold molar excess of MMAE (dissolve MMAE in N,N-dimethylacetamide (DMAc) to prepare 40 mM stock solution) over protein -SH groups. Then add double volume of PBS buffer in relation to the volume of the Fc protein. At last add reduced Fc fragment from step 1.2.\n\tNOTE: In this step, order of reagents addition is important.\nCarry out the conjugation reaction overnight at 15 ˚C with gentle rotation. These mild conditions prevent protein denaturation.\nFilter the solution with conjugate using 0.2 µm filter to remove potential precipitates.",
    "Carry out SDS-PAGE to analyze the efficiency of the reaction. Use 10% separation gel, 10 – 250 kDa protein marker, and analyze bands between 35 and 50 kDa (Figure 2).\n\tNOTE: The protocol can be paused here, and the reaction mixture stored either at 4 ˚C for short term storage, or at -80 ˚C for long term storage. However, freezing and thawing can cause additional precipitation and decrease conjugate purification yields.\nLoad the reaction mixture on a column with protein A-conjugated beads and wash off the excess of MMAE with Washing buffer 1 containing 300 mM NaCl, 18 mM NaH2PO4, 33 mM, Na2HPO4, 0.1% Tween 20, 2 mM EDTA pH 7.4. Then wash the column using Washing Buffer 2 with 650 mM NaCl, 18 mM NaH2PO4, 33 mM Na2HPO4, pH 7.4.\n\tNOTE: Through selective interaction of Fc region of the conjugate with protein A on the beads, the conjugate is captured on the column, while unreacted MMAE is washed out. This step is necessary to obtain highly pure conjugate.\nElute the Fc-MMAE conjugate from the column with 0.1 M sodium citrate pH 3.5 to 1.5 mL tubes containing 1 M Tris pH 9.0 (1 mL of protein to 200 µL of 1 M Tris pH 9.0).\nDesalt Fc-MMAE to PBS pH 7.4 using a column with Sephadex G-25 resin. This step prevents denaturation of the conjugate and allows the conjugate to be used in in vitro and in vivo tests.\n\tNOTE: The protocol can be paused here.\nCarry out SDS-PAGE (10%) to analyze the final Fc-MMAE conjugate. Use 10% separation gel, 10 – 250 kDa protein marker, and analyze bands between 35 and 50 kDa (Figure 2).\n2. Conjugation of engineered FGF2\nConjugation of GGGG-MTX to the C-terminal LPETGG sequence of engineered FGF2 via sortase A-mediated ligation",
    "Transfer purified engineered FGF2 containing N-terminal KCKSGG and C-terminal LPETGG sequence (used in this step for conjugation) to the sortase A Reaction Buffer (25 mM HEPES pH 7.4, 150 mM NaCl, 10 mM (NH4)2SO4, 5 mM CaCl2) using a column with G-25 resin. Adjust the protein concentration to 1 µM with sortase A Reaction Buffer.\nAdd GGGG-MTX peptide dissolved in DMAc, directly to the protein solution to a final concentration of 100 µM.\nAdd sortase A to a final concentration of 0.1 µM and incubate for 12 h at 15 °C with gentle rotation. The concentrations of reagents to be used in steps 2.1.1-2.1.3 are largely determined by the yield of conjugate to be achieved and the biochemical characteristics of the targeting protein (protein purification effectiveness, its solubility and stability). For effective sortase A reaction, use a starting point ten- to hundred-fold times lower concentration of sortase A than the LPETGG-containing target protein and 100 times higher concentration of GGGG-MTX than LPETGG-tagged protein.\nLoad the reaction mixture on a Heparin Sepharose column.\nWash off unreacted molecules with 25 mM HEPES pH 7.4.\nElute the product of the reaction (FGF2.MTX) with 25 mM HEPES pH 7.4 with 2 M NaCl.\n\t\tNOTE: The protocol can be paused here.\nAnalyze the efficiency of the conjugation using SDS-PAGE. Use 15% separation gel, 10 – 250 kDa protein marker, and analyze bands between 15 and 25 kDa (Figure 3).\nConjugation of MMAE to the N-terminal KCKSGG sequence of engineered FGF2 via maleimide-thiol reaction\nDesalt engineered FGF2 containing N-terminal KCKSGG and C-terminal LPETGG sequence to the Reaction Buffer (25 mM HEPES pH 7.0, 10 mM (NH4)2SO4, 10 mM methionine, 0.1 mM EDTA) using a column with Sephadex G-25 resin. Adjust the protein concentration to 25 µM with the Reaction Buffer.",
    "Dissolve MMAE in DMAc to prepare 40 mM stock solution.\nTo the new reaction tube add first four-fold molar excess of MMAE over protein -SH groups. Then add double volume of PBS buffer in relation to the volume of the FGF2 protein. At last add FGF2 protein.\n\t\tNOTE: In this step order of reagents addition is important.\nCarry out the reaction for 1 h at 20 °C with gentle rotation.\nLoad the reaction mixture on a Carboxymethyl (CM)-Sepharose column and wash off the excess of the unconjugated cytotoxic agent with 25 mM HEPES pH 7.4. These mild conditions prevent protein denaturation.\nElute the MMAE.FGF2 conjugate from the column with 25 mM HEPES pH 7.4 with 0.5 M NaCl.\n\t\tNOTE: The protocol can be paused here.\nAnalyze the efficiency of the conjugation using SDS-PAGE. Use 15% separation gel, 10 – 250 kDa protein marker, and analyze bands between 15 and 25 kDa (Figure 3).\nPreparation of dual warhead conjugate of enginnered FGF2 using combination of maleimide-thiol chemistry and sortase A-mediated ligation\n\tNOTE: For the generation of dual warhead conjugates of engineered FGF2 steps 2.1 and 2.2 are combined. First MMAE.FGF2 conjugate is produced via maleimide-thiol chemistry (step 2.2) and used for the attachment of GGGG-MTX with sortase A to the C terminal LPETGG tag of MMAE.FGF2 (step 2.1). Also, reverse procedure is also possible (first sortase A-mediated conjugation, then maleimide-thiol reaction).\n\t\nUse steps 2.2.1-2.2.7 for the preparation of mono-substituted MMAE.FGF2 conjugate.\nExchange the buffer for the sortase A Reaction Buffer (25 mM HEPES pH 7.4, 150 mM NaCl, 10 mM (NH4)2SO4, 5 mM CaCl2) using a column with Sephadex G-25 resin.\nContinue as described in 2.1.2-2.1.7.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}