{
  "id": 10329,
  "origin_website": "Jove",
  "title": "Advanced 3D Liver Models for In vitro Genotoxicity Testing Following Long-Term Nanomaterial Exposure",
  "procedures": [
    "1.Culturing cryopreserved HepG2 cells\nNOTE: HepG2 cells, obtained from American Type Culture Collection (ATCC) were cultured in 1x Dulbecco's Modified Eagle Medium (DMEM) with 4.5g/L D-glucose and L-glutamine supplemented with 10% foetal bovine serum (FBS) and 1% penicillin/streptomycin antibiotic.\nPre-warm DMEM cell culture medium (including the supplements) in a 37 °C water bath for 30 min.\nRemove one vial of HepG2 cells from liquid nitrogen and thaw in a 37 °C water bath for 2-3 min, whilst gently swirling the vial to allow for uniform thawing of the cell suspension. Take care not to submerge the vial above the O-ring in order to reduce the potential for contamination.\nOnce thawed, remove the vial from the water bath and spray generously with 70% ethanol to decontaminate the outer surface of the vial before placing under a sterile, Class II laminar tissue culture hood.\nCarefully pipette the contents of the cryovial of HepG2 cells into a centrifuge tube containing 9 mL of pre-warmed DMEM cell culture medium (with supplements).\nUsing a 10 mL strippette, transfer 10 mL of the cell suspension into a 25 cm2 disposable cell culture flask and incubate the culture for 3 days (from seeding) at 5% CO2 and 37 °C until ~80% confluency is reached before undergoing sub-culture into a larger 75 cm2 disposable cell culture flask.\nOnce 80% confluency is reached, sub-culture cells under sterile conditions by trypsinization with 0.05% trypsin/EDTA solution pre-warmed in a 37°C water bath for 30 min. At no point should the cells be allowed to dry out.",
    "As cells form an adherent monolayer, remove the media by tipping into a disinfectant waste pot. Then immediately wash the monolayer to remove all traces of existing media by rinsing the flask twice with 3 mL of sterile 1x PBS solution kept at room temperature. Also, discard PBS into disinfectant waste pot.\nOnce PBS wash is removed, add 5 mL of pre-warmed 0.05% trypsin-EDTA solution, ensuring to cover the entire surface of the cells and incubate cells for 6-8 min at 37 °C and 5% CO2.\nGently tap the flask to dislodge the cells from the bottom of the flask and then add 5 mL of DMEM cell culture medium (with supplements) to neutralize the trypsin enzyme.\nTransfer the cell suspension into a 50 mL centrifuge tube and pipette the cell suspension up and down thoroughly to ensure that cells are completely disassociated.\nCentrifuge the diluted cell suspension at 230 x g for 5 min. Discard the supernatant into disinfectant and re-suspend cell pellet in 25mL of DMEM cell culture medium (with supplements).\nTransfer cell suspension into a 75 cm2 disposable cell culture flask and incubate at 37 °C and 5% CO2 for a further 3 days before undergoing spheroid preparation. Once the HepG2s have had time to acclimatize and once again reach ~80% confluency, determine the cell concentration in preparation for spheroid seeding.\n2. HepG2 spheroid preparation\nRepeat sub-culture steps stated above, except after centrifugation, re-suspend the cell-pellet in 1 mL of DMEM culture medium pre-warmed in a 37 °C water bath. Pipette cell suspension up and down thoroughly.",
    "Score cell viability using the Trypan Blue Exclusion Assay (see OSHA SOP 3.21 Reproductive Toxins, Mutagens, Teratogens and Embryotoxins – Procedures for Safe Handling and Storage (2019) for health and safety guidance)14 with a 1:1 ratio of cell suspension to pre-filtered 0.4% Trypan blue solution.\nPrior to cell counting, take 1 mL of Trypan blue solution using a 1 mL syringe and filter with a 0.45 µm filter unit into a sterile, 1 mL tube.\nTransfer 10 µL of filtered, Trypan blue solution into a 0.2 mL tube and add 10 µL of cell suspension. Remaining filtered Trypan blue solution can be stored up to 3 months at room temperature for future use.\nSpray the haemocytometer thoroughly with 70% ethanol and wipe dry with a sterile paper towel before securing the coverslip on top using breath vapor. Sliding the coverslip across the breath moistened surface induces cohesive forces by generating Newton rings.\nGently pipette the Trypan blue cell suspension up and down using a 1000 µL pipette (to reduce sheer stress) before adding 10 µL to the haemocytometer. Ensure that the solution is dispersed underneath the cover slip and covers the entire grid without air bubbles.\nimgsrc://cloudfront.jove.com/files/ftp_upload/61141/61141fig1.jpg\nFigure 1: Counting cells using a haemocytometer. Diagrammatic representation of a haemocytometer highlighting which quadrant to count cells from. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/61141/61141fig1large.jpg]\nUnder the microscope, count the live (unstained) and dead (stained blue) cells found in the four large corner squares (Figure 1). Exclude any cells found to overlap or sit on the interior two edges of the large corner squares (i.e., on the lines) in the count.\nUsing the following calculation, calculate the average number of live, viable cells (unstained) present in the sample:",
    "Total Number of Cells/mL = Live Cell Count x imgsrc://cloudfront.jove.com/files/ftp_upload/61141/61141eq1.jpg x 10,000\n\twhere dilution refers to how many times the stock solution was diluted in Trypan blue (2x in this case) and # of squares counted refers to the four large corner squares of the haemocytometer counted\nBased on the viable HepG2 cell count and using the following formula:\n\tC1V1=C2V2\n\twhere C1 = the concentration of viable cells currently,\n\tV1 = the volume of cell suspension currently,\n\tC2 = the concentration of cell suspension wanted,\n\tV2 = the volume of cell suspension wanted\nPrepare a 10 mL stock solution of HepG2 cell suspension with DMEM cell culture medium at a concentration of 2.0 x 105 cells/mL in order to achieve 4000 HepG2 cells per 20 µL hanging drop. Mix the cell suspension thoroughly by gently pipetting up and down using a 1000 µL pipette to ensure all cells are fully suspended within the media.\nTo the wells of a 96-well cell culture plate, add 100 µL of sterile, room temperature PBS to prevent the hanging drops from drying out during incubation.\nTake the lid of a standard flat bottom 96-well cell culture plate, invert it and carefully pipette 20 µL drops of the cell suspension into the center of each well groove of the lid, as shown in Figure 2. Use a multi-channel pipette but add only 2 - 4 drops at once as multiple seeding can affect the accuracy and placement of the drops.",
    "Center the drops within the grooves of the wells laid out on the lid; otherwise they will not hang in the center of the wells when the lid of the plate is turned over and are at risk of falling off into the plate. Gently flip the lid of the 96-well plate, so the drops are now hanging and carefully place on top of the 96-well plate.\nPlace the whole 96 well plate with lid gently into an incubator at 37 °C and 5% CO2 for 3 days prior to spheroid transfer onto agarose.\n\tNOTE: Extra care must be taken not only when transporting the plates to/from the incubators, but when opening and closing the incubator in general as excessive movement can cause the plates to shift and the spheroids to either fall or form incorrectly.\nimgsrc://cloudfront.jove.com/files/ftp_upload/61141/61141fig2.jpg\nFigure 2: 3D HepG2 in vitro spheroid model preparation. (A) The HepG2 cells seeded in 20 µL drops onto the lid of a 96-well plate. (B) The HepG2 cells post-seeding in the hanging drop model to allow for spheroid formation. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/61141/61141fig2large.jpg]\n3. HepG2 spheroid transfer from hanging drop to agarose suspension\nNOTE: On Day 3 post seeding into hanging drops, the spheroids are transferred into the wells of the same 96-well plate all of which have been previously coated with a fine layer of 1.5% agarose gel.\nPrepare agarose gels and autoclave (i.e., day 2 post seeding) prior to the day of plate coating (i.e., day 3 post seeding).",
    "To prepare a 1.5% agarose gel, weigh 0.30 g of agarose into a clean, glass bottle and then add 20 mL of phenol-red free DMEM medium. Autoclave the agarose for 1 h at 230 °C for sterilization. The agarose coating prevents the HepG2 spheroids from adhering to the base of wells and forming a cellular monolayer instead of retaining their 3D spheroid structure.\nOn Day 3 post seeding, remove the 96-well plate containing the HepG2 hanging drop spheroids out of the incubator and carefully flip the lid so the spheroids are no longer hanging.\nUsing a multichannel pipette, remove and discard the 100 µL of PBS previously added to the base of the 96-well plate. Allow the plates to airdry for 2-3 min whilst heating the agarose in preparation for coating.\n\tCAUTION: This procedure results in very hot, liquid agarose which if spilt onto the skin may burn and cause injury. Furthermore, care must be taken when handling the glass bottle containing the liquid agarose as this too can be very hot.\nUsing the 1.5% agarose gels previously prepared, heat the glass bottle containing the 20 mL agarose gel for 30 s in a microwave at the maximum watt (i.e., 900 W). To coat two 96-well plates, one 20 mL bottle of pre-prepared 1.5% agarose gel should be sufficient.\nOnce melted, gently swirl the agarose by rotating the glass bottle to remove any bubbles and then add 50 µL of agarose into the base of each well.\n\tNOTE: When adding the agarose, ensure not to angle the plate >45° as the agarose sets quickly and will not form a flat, level layer that can disrupt spheroid growth. It is important to work efficiently at this stage to prevent the agarose from solidifying before the plate is completely coated.",
    "Allow the plate to stand for 2 min at room temperature before adding 100 µL of pre-warmed DMEM cell culture medium (with supplements) on top of the solid agarose layer in each well.\nFlip the lid of the 96-well plate and place back on top of the 96-well plate so the spheroids are now hanging once again.\nCentrifuge the plate for 3 min at 200 x g in order to transfer the spheroids from the hanging droplet into the individual wells of the 96-well plate. Following the transfer, the HepG2 spheroids should now be suspended in the cell culture medium. Allow them to settle for 24 h in the incubator at 37 °C and 5% CO2.\nExpose HepG2 spheroids of this size to either chemical or ENM treatments on Day 4 post seeding (i.e., 24 h after transfer to agarose coated plates).\nIn order to maintain cell viability over extended culture periods, refresh the cell culture medium every 3 days. To do this, gently aspirate 50 µL of the cell culture medium from the surface of the well and replace with a fresh 50 µL of DMEM cell culture medium. Take care not to remove or disturb the spheroid when performing a medium change.\n4. Nanomaterial/Chemical exposure\nNOTE: The HepG2 liver spheroid model can support both ENM and chemical based exposure regimes, but the primary focus of this protocol is ENM exposures. Prior to exposure, the test ENM must be suitably dispersed; this can be performed as directed by the NanoGenoTox Dispersion Protocol (Grant Agreement No. 20092101, 2018)15.",
    "Following dispersion according to the NanoGenoTox Dispersion Protocol, dilute the ENM suspension from the starting concentration of 2.56 mg/mL to the final desired concentration in pre-warmed DMEM cell culture medium (including the supplements). A total volume of 5 mL is required to dose one 96 well plate.\nTo expose the HepG2 spheroid to either a chemical or ENM, using a 200 µL pipette, aspirate 50 µL of cell culture medium from the surface of each well (leaving 50 µL in the well so as not to disturbed the spheroids) and replace with 50 µL medium containing the test toxicant at the required dose.\nOnce the test material has been applied, incubate the plates for the desired exposure time at 37 °C and 5% CO2.\nIf a long-term (≥24 h) exposure regime is conducted, then immediately after the desired exposure timeframe has elapsed, harvest the spheroids for micronucleus endpoint analysis as described below in steps 6.1 – 6.4.\nHowever, with acute exposure regimes (e.g., ≤24 h), once the exposure period has ended, harvest, pool, and store 50 µL of supernatant from each well in the 96 well plate at -80 °C for further biochemical analysis later. Replace the cell culture medium with 50 µL of fresh medium containing 6 µg/mL of Cytochalasin B and leave to incubate for 1 – 1.5 cell cycles (i.e., 24 – 26 h for HepG2) in preparation for the cytokinesis block micronucleus assay harvest.\n\tNOTE: For Acute (≤24 h) exposure regimes, the cytokinesis block micronucleus assay with Cytochalasin B can be applied but for long-term (≥24 h) exposure regimes, the mononuclear version (without Cytochalasin B) of the assay must be utilized as described below in Figure 4.\n5. HepG2 spheroid harvesting",
    "NOTE: Following either chemical or ENM exposure treatments, both cell culture medium or spheroid tissue can be harvested for multiple endpoint analysis. Depending on the endpoint analysis, spheroids can either be harvested individually (e.g., for image analysis) or pooled together (e.g., for cytokinesis block micronucleus assay).\nRemove the 96-well plate from the incubator.\nUsing a 200 µL pipette, aspirate the 100 µL of cell culture medium including the spheroid tissue from each well and collect in a sterile, 15 mL centrifuge tube. Take care to avoid contact with the agarose.\nOnce collected, centrifuge the spheroid suspension at 230 x g for 5 min. Remove the supernatant and store at -80 °C for further endpoint analysis (e.g., liver function tests) later.\nRe-suspend the pellet of spheroids in 1 mL of sterile, room temperature PBS (1x).\nOnce washed, centrifuge the spheroid suspension again at 230 x g for 3 min. Discard the supernatant, re-suspend in 500 µL of 0.05% trypsin-EDTA solution and incubate for 6-8 min at 37 °C and 5% CO2.\nFollowing incubation, gently pipette the trypsinized cells up and down to fully disassociate and re-suspend the HepG2 cells prior to neutralizing with 1 mL of DMEM cell culture medium.\nCentrifuge the diluted cell suspension at 230 x g for 5 min. Discard the supernatant into disinfectant and re-suspend cell pellet in 2mL of room temperature PBS (1x).\nCentrifuge the cell suspension at 230 x g for 5 min. Discard the supernatant into disinfectant and then re-suspend the cell pellet once more in 2 mL of cold PBS (1x). Ensure the cells are well dispersed to prevent clumps of cells obscuring the field of view when mounted onto microscope slides.\n6. Micronucleus assay and scoring",
    "For the manual method of the micronucleus assay, a cytocentrifuge is required to produce a cytodot (a defined, concentrated region of cells) in the centre of the microscope slide. This process supports more efficient scoring of the slide as it allows the scorer to easily locate the cells of interest, as opposed to evaluating a whole slide where the cells can be widely spread.\nDip frosted microscope slides (three per dose) in 70% ethanol followed by ddH2O and leave to air dry for 5 min.\nPlace prepared microscope slides into cuvette funnel as shown in Figure 3A, where the glass slide (iii) is placed in the metal support (iv) with a filter card (ii) and cuvette funnel (i) secured on top.\nArrange cuvette funnels in the cytocentrifuge with the funnel facing up, so 100 µL of cell suspension can be directly added into each one.\nCytospin for 5 min at 500 x g to ensure cells are evenly distributed onto the surface of the slide.\nimgsrc://cloudfront.jove.com/files/ftp_upload/61141/61141fig3.jpg\nFigure 3: Cytospin setup to prepare treated cells on microscope slides. (A) Displays the individual components, (i) cuvette funnel, (ii) filter card, (iii) glass microscope slide and (iv) metal support required to cytospin HepG2 cells onto microscope slides. (B) The final cuvette funnel set up. (C) The correct placement of the cuvette funnel within the cytocentrifuge. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/61141/61141fig3large.jpg]\nLeave slides to air dry before fixation in ice-cold, 90% methanol for 10 min.\nOnce fixed, leave the slides to air dry overnight at room temperature before storing at -20 °C for up to 6 months.\nWhen required, remove the pre-prepared microscope slides from -20 °C freezer and allow to warm to room temperature before undertaking Giemsa staining.",
    "CAUTION: According to Regulation (EC) No. 1272/2008 [CLP], Giemsa staining solution is a highly flammable liquid which can be toxic if swallowed and cause damage on contact with the eyes, skin or if inhaled. Refer to the associated SDS sheet for detailed storage, handling and health and safety advice on this chemical prior to use.\nWhilst the slides are defrosting, prepare a 20% Giemsa staining solution (25 mL required to stain ~30 slides) diluted in phosphatase buffer (pH 6.8). Mix thoroughly by gently swirling the solution before filtering using folded filter paper placed in a funnel.\nUsing a Pasteur pipette, add 3 – 5 drops of filtered Giemsa solution to the cytodot on each slide and leave for 8 – 10 min.\nWash slides in two successive phosphatase buffer washes before briefly rinsing under cold water to remove any excess stain leftover. Leave slides to air dry.\nOnce dry, in a fume hood, dip stained slides in xylene for 10 s before adding a drop of mounting medium to the center of the cytodot and a place a glass coverslip on top.\nLeave microscope slides in the fume hood overnight to dry before manual scoring; they can be stored indefinitely at room temperature.\n7. Data analysis\nAs described in the OECD Test Guidelines 487 (2014)11, to assess and quantify DNA damage induced as a result of exposure to an ENM or chemical agent, use a light microscope (100x objective with immersion oil) 2000 mononucleated or 1000 binucleated cells per biological replicate to score for the presence of micronuclei, as shown in Figure 4.\nimgsrc://cloudfront.jove.com/files/ftp_upload/61141/61141fig4.jpg",
    "Figure 4: Micronucleus assay scoring decision tree. Schematic decision tree to highlight the necessity for different scoring and cytotoxicity assessment procedures when using the micronucleus assay with 3D models following acute or long-term exposure regimes. Acute (≤24 h) exposures allow use of the cytokinesis blocked micronucleus assay, while long-term (≥24 h) exposures require the mononuclear version of the assay; both of which are described in OECD Test Guideline 487. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/61141/61141fig4large.jpg]\nBased on the proportion of micronuclei present per number of mononucleated or binucleated cells scored, calculate a percentage of genotoxicity value.\nIn order to assess the DNA damage observed is not as a result of cell debris caused by a high proportion of apoptotic cells, take a measure of cytotoxicity alongside. In this case, depending on the presence of Cytochalasin B, use either CPBI or RVCC calculation (as described in Figure 4). Genotoxicity must only be evaluated in samples where cytotoxicity is less than 55% ± 5% as defined in OECD Test Guideline 48711."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}