{
  "id": 2638,
  "origin_website": "Cell",
  "title": "Protocol to knock in or out target genes in mouse epidydimal white adipose tissue by spot injecting adeno-associated viruses",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nIn this protocol, we will describe how to inject AAV9 in eWAT of anesthetized mice. The method details are outlined in the following protocol and video (Methods video S1[href=https://www.wicell.org#mmc1]).\n    Your browser does not support HTML5 video.\n  \nMethods video S1. AAV spot injection in eWAT, related to step-by-step method details\nAnesthetizing mice prior to surgical procedures\nTiming: 5 min\nRandomly divide eight-week-old male C57BL/6 mice into two groups: the experimental group and the control group.\nWeigh the mouse before injection of anesthetic solution.\nIntraperitoneally inject 0.1–0.2 mL of anesthetic mixture per 10 g of body weight.\nPlace the mouse back in another clean cage until it is immobilized.\nNote: Decreased muscle tone in the mouse, such as pedal withdrawal reflex disappearance, is proved to be completely anesthetized. Anesthetized mice should never be placed in a cage with non-anesthetized mice for prolonged periods as anesthesia leaves them vulnerable to attacks by cage mates.\nNote: The safety range of pentobarbital sodium is narrow. The dose of anesthetic must be administered to ensure that the mice remain anesthetized during the surgical procedure and wake up after the surgical procedure, as soon as possible. Take care of the dosage of anesthetics to avoid overdosage. An additional volume might be needed to achieve full anesthetic effect. In addition, the dosage of anesthetic needs to be adjusted according to the strain of the mice. Alternatively, other injectable anesthesia (e.g., the mixture of ketamine and xylazine) and inhalation anesthesia (e.g., isoflurane) can be taken into consideration.\nNote: Keep airway patency of the anesthetic mouse, so that there is no excessive secretion that could block the trachea and cause the animal to suffocate.\nAAV9 spot injection\nTiming: 20–30 min\nPlace the anesthetized mouse in the supine position.",
    "Fix the limbs with adhesive tape on a small workbench on a sterile operating table and expose the skin on the abdomen of the mouse adequately.\nShorten the fur of mouse for the incision on the abdomen with hair clipper (Figure 2[href=https://www.wicell.org#fig2]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2133-Fig2.jpg\nFigure 2. The snapshot for AAV spot injection in eWAT\n(A) The fur of mouse is shortened for the incision on the abdomen with hair clipper.\n(B) An incision along the ventrimeson in the median abdomen is made with fine scissors sharp.\n(C) Spot injection the AAV in the eWAT.\n(D) Simple interrupted suture each layer of the abdominal wall of the mouse.\nDisinfect the mouse skin with 75% alcohol at the site where you wish to make a surgical incision.\nMake an approximately 0.7 cm in length incision along the ventrimeson in the median abdomen with fine scissors sharp and cut each layer of the abdominal wall, successively (Figure 2[href=https://www.wicell.org#fig2]B).\nLocate and fully expose the eWAT by blunt separation with an ophthalmic forceps (10 cm, curved with hook).\nInject the AAV in the left eWAT (relative to midline of mouse abdomen) at 3 points inject 5 μL of the AVV, using a 1 mL sterile BD 29-gauge insulin syringe (Figure 2[href=https://www.wicell.org#fig2]C).\nRepeat for the right eWAT.\nNote: A 3:1 ratio of anhydrous ethanol to pure water can be mixed to make 75% alcohol.\nNote: The eWAT is strip shaped. the center of the eWAT is selected as one injection point, and the midpoint between the center point and the two endpoints of the eWAT are selected as the other two injection points.\nArrange and reposition the eWAT back into the mouse’s abdominal cavity with an ophthalmic forceps.",
    "Simple interrupted suture each layer of the abdominal wall of the mouse intermittently after injection with 4-0 Coated VICRYL Plus (Polyglactin 910) Synthetic Absorbable Suture (Figure 2[href=https://www.wicell.org#fig2]D).\nAfter operation, the mouse is individually placed in a clean cage. Keep the mice warm until they recover from anesthesia.\n(Optional) Local anesthetics such as lidocaine can be used to relieve local pain and itching.\nOptional: Identification the effect of spot injection of AAV by Western blotting.\nExtract protein from fresh adipose tissue samples into RIPA buffer. The protein extraction was performed as previously described (Zhao et al., 2022[href=https://www.wicell.org#bib2]).\nLoad protein onto a 10% SDS-polyacrylamide gel, and transfer separated proteins to PVDF membranes.\nPerform Western blot assays using specific antibodies.\nPause point: The experimental mice are housed in the SPF facility and maintained on a 12 h light-dark cycle until the eWAT are collected and the exogenous protein is detected."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Metabolism",
    "Model Organisms"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}