{
  "id": 19747,
  "origin_website": "Wiley",
  "title": "Immunophenotypic Detection of Measurable Residual (Stem Cell) Disease Using LAIP Approach in Acute Myeloid Leukemia",
  "procedures": [
    "This protocol describes immunophenotypic MRD detection using the leukemia associated immunophenotypes (LAIPs) approach. Appropriate instrument settings are crucial for performing adequate flow cytometric assays; this topic is beyond the scope of this protocol. A flow cytometer setup guideline, including instructions concerning compensation settings, can be found in the video article by Cloos and colleagues (2018[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-bib-0008]). Details are also provided by the EuroFlow guideline for standardization of instrument settings (Kalina et al., 2012[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-bib-0016]).\nMaterials\n10 ml bone marrow in heparin (e.g., lithium heparin, 102 IU coated tubes; Becton Dickinson) or EDTA tube (e.g., plastic K2EDTA 7.2 mg; Becton Dickinson)\nTürk cell staining solution (MilliporeSigma, cat. no. 1092770100)\nPBS (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-rec-0002])\nMeasurable residual disease (MRD) antibody panel (see Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-tbl-0001])\nLysing solution (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-rec-0001])\nCell counting chamber or automated cell counter (e.g., Cellometer Spectrum, Nexcelom)\nTabletop centrifuge\nMulticolor flow cytometer\nSoftware (e.g., Infinicyt, Flowjo)\n4 FACS tubes\nPipets\nFilter pipet tips\nPrepare bone marrow sample\n1. Assess concentration of white blood cells (WBCs) in the BM sample using a cell counting chamber with Türk cell staining solution by dissolving 10 µl BM in 90 µl Türk solution. Mix gently and incubate ∼1 min. Fill cell counting chamber and define cell concentration.\nAlternatively, an automated cell counter (e.g., Cellometer Spectrum, Nexcelom) can be used to determine the cell concentration and viability.\n2. Define volume of BM needed and pipet this volume into a separate regular 15-ml tube. For one tube (see Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-tbl-0001]) use ∼500,000 white blood cells (for the four tubes, 2 × 106 cells). For follow-up samples, use 2 × 106 cells per tube (for the four tubes, 8 × 106 in total).\n3. Add lysing solution to the tube containing white blood cell suspension to lyse any red blood cells.",
    "The volume of lysing solution should be ten times the volume of the white blood cell suspension.\nPreferably for bulk lysing, use one tube (e.g., 50 ml).\n4. Mix gently by inverting the tubes and incubate 10 min at room temperature then centrifuge 7 min at 700 × g (room temperature with mild brake, e.g., Hettich Rotolavit centrifuge brake 3).\n5. Remove supernatant and re-suspend cell pellet in excess PBS. Centrifuge 7 min at 700 × g (room temperature with mild brake).\n6. Remove supernatant. Re-suspend cell pellet in PBS to a cell concentration of ∼100 × 106 WBC/ml before dividing cell suspension evenly over the four different FACS tubes.\nStain white blood cells\n7. Pipet appropriate monoclonal antibodies into the different tubes (detailed in Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-tbl-0001]; eight different antibodies per tube). Mix gently and incubate cell suspensions (20 µl) with the appropriate antibodies (20 µl premix containing all eight antibodies) 15 min at room temperature while protecting from light.\nEach antibody must have been titrated on appropriate control cells by the laboratory itself, to assess the optimal concentrations of the antibodies.\n8. Add 3 ml PBS per tube to wash the stained cells. Centrifuge cells at 400 × g for 5 min (with brake). Remove supernatant and re-suspend cell pellet in 300 µl PBS.\nFlow cytometry LAIP assessment at diagnosis\n9. Use the flow cytometer to measure at least 100,000 gated WBCs per tube for diagnosis samples.\nTypically, due to losses in the procedures, 200,000-300,000 cells are available. LAIP assessment at diagnosis is required for proper identification of residual LAIP positive cells at follow-up.\nMeasure all four tubes to enable full LAIP identification.\n10. Save FACS data using an appropriate file name (e.g., MRD-diagnosis-BM-patient number 1-date sample measurement-LAIP CD34/CD13/CD56).\nFlow cytometry LAIP assessment at follow-up",
    "11. Use the flow cytometer to measure at least 1,000,000 gated WBCs for follow-up samples.\n12. Usually there is enough BM at follow-up to use all four regular tubes for complete LAIP follow-up identification and to enable detection of upcoming LAIPs. Exceptions are possible; these include absence of LAIPs at diagnosis or absence of diagnosis information:\n         \nIn case of limited amount of BM cells, use tube(s) that allow determination of LAIP(s) that were present at diagnosis of AML.\nIn rare cases both with no diagnosis of LAIP available and with shortage of follow-up material, only one, two, or three tubes can be measured at follow-up. Based on the frequencies of LAIPs, as used in the recent HO102 study (Zeijlemaker et al., 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-bib-0029]), the chances of finding a good LAIP (tube numbers shown in Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-tbl-0001]) are 59% for tube 1, 20% for tube 2, 11% for tube 3, and 10% for tube 4. So, with such a shortage of material and with no diagnosis information, the preferential choice would be tube 1, followed by tube 2, followed by tube 3 and tube 4.\nImportantly, if there is evidence for a CD34-negative AML (in most cases defined already at diagnosis), at least tube 4, with the antibody for the primitive marker CD133 present, should be used.\nNote that some upcoming LAIPs (defined as LAIPs present at follow-up that were not, or in very low frequency, present at time of diagnosis), representing upcoming leukemic populations, can be missed when not all four tubes are measured at follow-up.\n13. Save FACS data using an appropriate file name (e.g., MRD-follow-up-BM-patient number 1-date sample measurement-LAIP CD34/CD13/CD56).\nGating strategy to identify LAIPs at diagnosis and follow-up",
    "14. Open FACS data from the diagnosis files using gating software to assess diagnosis of LAIPs. Use these diagnosis files at follow-up to assess both the LAIPs defined at diagnosis to be important for follow-up, as well as LAIPs that were not present at diagnosis but emerged during and/or after treatment.\nFor white blood cells\n15a. Gate CD45 positive cells in the CD45/SSC plot (Fig. 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-fig-0001]A). In the FSC/SSC plot, set a gate on the larger cells, thereby gating out the red cells, debris, and cells with very high FSC (Fig. 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-fig-0001]B). Figure 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-fig-0001]C illustrates gating of the single cells and removal of doublets in an FSCA/FSC-H plot. All WBCs are shown in Figure 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-fig-0001]D.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/de65b1d0-c45b-400c-a535-ceda29e84290/cpcy66-fig-0001-m.jpg</p>\nFigure 1\nGating white blood cells. (A-C) Gating of the white blood cells. For a detailed description of the gating steps see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-prot-0001], step 15a. (D)The final population of white blood cells is shown in blue in D.\nFor lymphocytes\n15b. Within the population of WBCs (blue), as shown in Figure 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-fig-0001]D, gate CD45 high and SSC low cells (Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-fig-0002]A). Ensure that there are no myeloid cells in the gate using CD34, CD117, CD13, and/or CD33.\nExamples of the absence of expression of these four markers is shown in Figure 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-fig-0002]B and C. The final population of lymphocytes is shown in green in Figures 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-fig-0002]B-D. Lymphocytes can be used as an internal control to define marker expression (e.g., use the CD7-negative population of lymphocytes to define CD7-positivity on leukemic blasts).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/4e940037-e7d8-4f1d-8340-e7410d749d4c/cpcy66-fig-0002-m.jpg</p>\nFigure 2\nGating lymphocytes. (A) Gating of the lymphocytes. (B-D) Lymphocytes are shown in green in B-D. See Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-prot-0001], step 15b for a detailed description of the gating steps.\nFor immature blasts",
    "15c. Within the WBC fraction (shown in blue in Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-fig-0002]D), gate immature blasts in the CD45/SSC plot (Fig. 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-fig-0003]A). Blasts are CD45 intermediate and have a low SSC.\nLymphocytes are shown in green (Fig. 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-fig-0003]A).\nUse the FSC/SSC plot to ensure that mature granulocytes or immature lymphocytes have been excluded from the immature blast fraction (Fig. 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-fig-0003]B); the final population of immature blasts cells is shown in dark blue in a CD45/SSC plot in Figure 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-fig-0003]C.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/a9db2490-ba12-4625-8d5d-3764e5047992/cpcy66-fig-0003-m.jpg</p>\nFigure 3\nGating immature blasts. (A-B) Gating of the immature blast cells. See Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-prot-0001], step 15c for a detailed description of these gating steps. (C) The final population of immature blast cells is shown in dark blue.\nFor LAIP positive cells at diagnosis\n16. Within the immature blast fraction (Fig. 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-fig-0003]C), identify primitive marker positive blasts cells (CD34, CD117, or CD133 positive cells; example with CD34 shown in Fig. 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-fig-0004]A). Plot primitive marker positive cells (in Fig. 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-fig-0004]B, light blue represents all CD34 positive blast cells) in a plot with a positive myeloid marker (CD13, CD33, or HLA-DR positive cells; example with CD13 shown in Fig. 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-fig-0004]B) and search for an LAIP.\nAn example with CD56 is shown in Figure 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-fig-0004]B and this shows that part of the CD34+CD13+ cells represents the LAIP CD34+CD13+CD56+ and is shown in red in Figure 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-fig-0004]C. In this example the LAIP covers 47.1% of the total amount of immature blast cells.",
    "In a small fraction of AML patients, the leukemic blasts do not express a primitive marker (CD34, CD117, or CD133). In these cases, more mature LAIPs may be detectable. Figure 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-fig-0005] shows an example of such a “mature” LAIP. Figure 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-fig-0005]A and B show gating of the mature blast cells. In Figure 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-fig-0005]C, the mature blasts are shown in orange. Figure 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-fig-0005]D shows that part of the mature blast cells are CD14 positive. Subsequently, Figure 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-fig-0005]E shows all CD14 positive mature blast cells in light blue whereby staining for CD36 reveals that part of the CD13 positive cells are negative for CD36. Finally, the CD45+/CD14+/CD13+/CD36− LAIP positive cells are shown in red in Figure 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-fig-0005]F. In this example, the LAIP covers 25.2% of the total amount of mature blast cells.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/9dc579ff-7121-4df9-96ae-1ff4768a00b9/cpcy66-fig-0004-m.jpg</p>\nFigure 4\nLAIP detection on immature blasts at diagnosis. (A-B) Gating of LAIP positive cells. For a detailed description of the gating steps see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-prot-0001], step 16. (C) LAIP positive immature blasts are shown in red. LAIP, leukemia associated immunophenotype.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/81b08899-5440-40b2-a945-94109635f055/cpcy66-fig-0005-m.jpg</p>\nFigure 5\nLAIP detection on mature blasts at diagnosis. (A-B) Gating of mature blast cells. (C) The population of mature blast cells is shown in orange. (D-E) Gating of LAIP positive cells. See Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-prot-0001], step 16 for a detailed description of these gating steps. (F) LAIP positive mature blasts are shown in red. LAIP, leukemia associated immunophenotype.\nFor LAIP positive cells at follow-up",
    "17. Gate lymphocytes and (im)mature blasts as described in steps 14 and 15a-15c. Similar to step 16, check for the presence of all possible LAIPs. First, focus on the LAIP phenotype that was established at diagnosis. Choose the best LAIP based on the percentage of LAIP positivity and on LAIP specificity (see also the Commentary section; in this example we use CD45/CD34/CD13/CD56 LAIP).\nIn Figure 6[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-fig-0006]A-C, the same gating steps as described in step 16 for diagnosis (Fig. 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-fig-0004]) are illustrated for follow-up BM. In this case, we defined the sample as MRD positive, because LAIP positive cells were 1.80% of the total amount of WBCs which is above the presently defined European LeukemiaNet (ELN) consensus cut-off of 0.1% (Schuurhuis et al., 2018[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-bib-0020]); thus, this AML BM sample was defined as MRD positive. A similar approach is used for mature LAIPs, although detection of mature LAIPs in follow-up BM is challenging and requires some gating experience.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/71a7406c-45fd-49cc-b03c-f7337c2cc0fd/cpcy66-fig-0006-m.jpg</p>\nFigure 6\nLAIP detection at follow-up. (A-B) Gating of LAIP positive cells in follow-up BM. See Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-prot-0001], step 17 for a detailed description of these gating steps. (C) LAIP positive blasts are shown in red. LAIP, leukemia associated immunophenotype; BM, bone marrow.",
    "An overview is given of the approach of immunophenotypic detection of CD34+CD38− leukemic stem cells. We developed an antibody panel that allows the assessment of the total CD34+CD38− LSC load using only one tube (Zeijlemaker et al., 2016b[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-bib-0031]). The content of this tube is shown in Table 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-tbl-0002]. It is characterized by a cocktail of six different antibodies in the phycoerythrin (PE) channel (referred to as Combi-6 channel) that, together with CD45RA, CD123, CD44, and CD33, allows the assessment of total LSC load efficiently and accurately in the majority of AML patients. More information concerning the limitations of this approach is given in the Commentary section.\nAdditional Materials (see also Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-prot-0001])\nLeukemic stem cell (LSC) monoclonal antibodies (see Table 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-tbl-0002])\nPrepare bone marrow sample\n1. Prepare bone marrow cells for flow cytometry measurement as described in step 1 of Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-prot-0001].\nUse 8 × 106 WBCs (or more if possible) for measurement of stem cells.\nStaining of white blood cells\n2. See step 2 of Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-prot-0001].\nUse 500 µl to re-suspend the cell pellet to prevent excessively high flow rates in the flow cytometer due to the higher cell number used for stem cell analyses.\nFlow cytometry LSC assessment\n3. Use a flow cytometer to measure as many gated WBCs as possible, at least 4 × 106, especially for follow-up samples.\nHigh WBC counts are recommended to enable proper LSC detection.\n4. Save FACS data using an appropriate file name, e.g., LSC-diagnosis-BM-patient number 1-date sample measurement-Marker Combi-6.\nGating strategy to identify CD34+CD38−LSCs at diagnosis and follow-up\n5. Gate white blood cells, lymphocytes, and immature blast cells as described in steps 14-15 of Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-prot-0001].",
    "6. CD34+CD38− cells: Gate CD34 positive blast cells as shown in Figure 7[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-fig-0007]A; CD34 positive blasts are shown in light blue in Figure 7[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-fig-0007]B, where CD34 is plotted against CD38. Identify CD38 low cells (also referred as CD38− cells; gate in Fig. 7[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-fig-0007]B). To facilitate the detection of CD38 low cells, use CD38 expression of remaining red blood cells (CD38 negative). Alternatively, use a fixed cut-off point.\nThe latter is possible if all instrument settings and staining protocols are standardized and results are reproducible. In our experimental setting, the chosen cut-off is 102 (see dashed line, Fig. 7[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-fig-0007]B). Such a cut-off had to be chosen because there is no robust control for CD38 negativity; such a cut-off for negativity can only be chosen if instrument settings are standardized.\nUse FSC/SSC plot to gate the cluster of CD34+ blasts (exclude non-specific cells with higher SSC and/or FSC, Fig. 7[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-fig-0007]C); Figure 7[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-fig-0007]D shows the population of CD34+CD38− stem cells (azure blue).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/2bfe0203-b6fe-4a2b-aaf0-83d38c57d5eb/cpcy66-fig-0007-m.jpg</p>\nFigure 7\nGating of CD34+CD38− cells. (A-C) Gating of the CD34+CD38− cells. For a detailed description of the gating steps see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-prot-0002], step 6. (D) The population of CD34+CD38− stem cells is shown in azure blue.\n7. Gate aberrancies on CD34+CD38− LSC cells: For this step, use the different stem cell markers as shown in Table 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-tbl-0002] (CD45RA, Combi-6, CD123, CD44, and CD33) to discriminate presumed normal hematopoietic stem cells (HSCs) from the LSCs.\nExamples of LSC gating are shown in Figures 8[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-fig-0008] and 9[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-fig-0009]. Figure 8[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-fig-0008] shows an example where LSC and HSC can easily be defined using the CD45RA marker and Figure 9[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-fig-0009] shows a more difficult example using the Combi markers. A detailed description of the gating strategies in these cases is outlined in the legends of Figures 8[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-fig-0008] and 9[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-fig-0009].",
    "The background of the stem cell tube used (Table 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-tbl-0002]) is described in the Critical Parameters and Troubleshooting, Discrimination between LSCs and HSCs section. More detailed information, including examples about how to gate LSCs using these different stem cell markers, is found in Zeijlemaker et al. (2016a[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-bib-0030]). Furthermore, more examples of how secondary parameters can be attributed to further define CD34+CD38− HSC and LSC are shown in Terwijn et al. (2014[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-bib-0025]).\nGating strategies to identify CD34+CD38− LSCs at follow-up are identical compared to diagnosis, as described above in steps 5-7.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/194f4d02-aad3-4ba2-af71-545250b9f21e/cpcy66-fig-0008-m.jpg</p>\nFigure 8",
    "Gating of CD34+CD38− LSC cells using CD45RA as a stem cell marker. (A) This figure shows gating of the CD34+CD38− cells using CD45RA. (B-C) Backgating of both the CD45RA positive and negative cell fractions in a FSC/SSC plot is shown in B and C, respectively. (D) Differences in CD34 expression between presumed LSC and HSC. (E) Final LSC results based on CD45RA as a stem cell marker. (F) Overview of the different secondary gating parameters is shown. A more detailed description of this figure can be found in Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-prot-0002], step 7. In more detail: CD45RA negative and positive cell fractions were quite clearly separated (highlighted with a frame in A). Secondary gating parameters (FSC/SSC/CD34/CD45) were used to establish whether the presumed LSC and HSC populations were pure (this is further elucidated in the Critical Parameters and Troubleshooting section). B shows backgating of the CD45RA positive stem cells in a FSC/SSC plot. This shows that two populations with a different FSC and SSC can be discriminated within the CD45RA positive cell fraction. Backgating of the CD45RA positive FSClow cells (marked in gray, B) in a CD34/CD38 plot shows that these cells have relatively low CD34 expression and are defined as a-specific. C shows backgating of the CD45RA negative stem cells in an FSC/SSC plot. This backgating shows a pure CD45RA negative clustered FSClow population, implying that there is little/no contamination with LSCs. D shows differences in CD34 expression between the LSC (in red), the presumed HSC (in green), and the earlier defined a-specific events (in gray). Subsequently, the a-specific events were removed from further analyses and E shows the final CD45RA expression results.",
    "F shows the results for all secondary gating used (FSC/SSC, CD34/SSC, and CD45/SSC), also showing that the CD45/SSC parameter does not contribute in this particular AML case. LSC, leukemic stem cell; HSC, hematopoietic stem cells; AML, acute myeloid leukemia.",
    "<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/535a7879-f2ab-4259-b25e-3616c18fa63f/cpcy66-fig-0009-m.jpg</p>\nFigure 9",
    "Gating of the CD34+CD38− LSC cells using the Combi-6 marker. (A) This figure shows gating of the CD34+CD38− cells using the Combi-6 marker. (B-C) Backgating of both the Combi-6 positive and negative cell fractions in a FSC/SSC plot is shown in B and C, respectively. (D) Differences in CD34 expression between presumed LSC and HSC. (E) Final results of Combi-6 as a stem cell marker including FSC as a secondary gating parameter. (F) Overview of the different secondary gating parameters. A more detailed description of this figure can be found in Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-prot-0002], step 7. In more detail: An example of LSC gating in the same AML using the Combi-6 marker is shown in A. In contrast to CD45RA there is no clear separation between putative LSC and HSC. Possible Combi-6 positive and Combi-6 negative cells were globally defined in A (highlighted with a frame). B shows backgating of the Combi-6 positive stem cells in a FSC/SSC plot. This shows that two populations with a different FSC and SSC can be discriminated within the Combi-6 positive cell fraction. Similar to CD45RA, backgating of the Combi-6 positive FSClow cells (marked in gray, B) in a CD34/CD38 plot shows that these marker-positive FSClow cells have relatively low CD34 expression and are defined as a-specific events. C shows backgating of the Combi-6 negative stem cells in an FSC/SSC plot. In contrast to CD45RA, this backgating shows a Combi-6 negative FSClow population and a tiny Combi-6 negative FSChigh population. Based on the FSC characteristics of the Combi-6 positive stem cells (dotted line between B and C), there is a tiny fraction which should be defined as leukemic based on FSC as a secondary gating parameter (Terwijn et al., 2014[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-bib-0025]).",
    "D shows the differences in CD34 expression between the LSC (in red), the presumed HSC (in green), and the earlier defined a-specific events (in gray). Subsequently, the a-specific events were removed from further analyses and E shows the final Combi-6 expression results. F shows the results for all secondary gating used (FSC/SSC, CD34/SSC, and CD45/SSC), also showing that the CD45/SSC parameter does not contribute in this particular AML case. So, despite the initial poor separation between LSC and HSC (A), LSC and HSC can be fairly well distinguished using secondary gating parameters resulting in similar calculated LSC frequencies: 0.012% in both CD45RA and Combi-6 analyses which is below the previously defined cut-off of 0.03% (% of WBCs) for positivity at diagnosis (Zeijlemaker et al., 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcy.66#cpcy66-bib-0029]). Also, quite similar LSC/HSC ratios in the total CD34+CD38− compartment were found: 37:63 for CD45RA and 34:66 for Combi-6. LSC, leukemic stem cell; HSC, hematopoietic stem cells."
  ],
  "subjectAreas": [
    "Cytometry"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}