{
  "id": 13125,
  "origin_website": "Jove",
  "title": "In Ovo Feeding of Commercial Broiler Eggs: An Accurate and Reproducible Method to Affect Muscle Development and Growth",
  "procedures": [
    "All methodologies were approved by the University of Georgia Institutional Animal Care and Use Committee.\n1. Egg incubation and treatment administration\nEgg procurement and treatment assignment\n\t\nObtain unincubated, fertilized high-yield broiler eggs and transport them to the laboratory.\nInspect and discard eggs deemed poor quality.\n\t\tNOTE: Eliminate misshapen eggs (round, elongated, slab-sided), cracked, dirty/stained, thin-shelled, and wrinkled. This is important to minimize the risk of rotten eggs.\nAssign individual egg numbers, weigh, and record egg numbers and weights in a spreadsheet software program.\nUtilize the spreadsheet software program to sort eggs by weight.\n\t\t\nHighlight the egg number and egg weight columns.\nSelect the Data tab and then Sort - sort data by egg weight from smallest to largest.\n\t\t\tNOTE: For the best hatching rate, use eggs weighing between 40 and 70 g.\nBased on the design of the experiment, assign eggs (numerically or alphabetically) an injection treatment and day of euthanasia. Enter treatment number and day of euthanasia in separate columns and randomly assign these factors within each stratum.\n\t\t\t​NOTE: For this publication, treatments were randomly assigned within each 8-egg strata.\nGenerate a PivotTable within the spreadsheet software program to ensure each treatment possesses similar starting egg weights.\n\t\t\nHighlight all data within the spreadsheet to be analyzed.\nSelect PivotTable option under Insert tab.\nSelect the independent variable (Day of Euthanasia column) within the PivotTable Fields sub-window and drag to Rows field.\nSelect the independent variable (Treatment column) within the B sub-window and drag to Rows field, under Day of Euthanasia.\nSelect the dependent variable of interest (Egg Weight) and drag it to the Values field.\nChange Value field settings by clicking on the dependent variable and selecting Value Field Settings.\n\t\t\t\nChange the setting to Average.\nTray assignment",
    "In the spreadsheet software program, assign eggs to a tray (numerically or alphabetically), so treatments are equally represented within a tray.\n\t\t\nAssign the first four eggs with assigned treatments to tray 1. Assign the next four eggs to tray 2 and continue until all eggs are assigned to a tray.\n\t\t\t​NOTE: This step will vary depending on the number of incubators and trays used in the experiment.\nEnsure all treatments are equally represented on a tray using the PivotTable function.\n\t\nHighlight all data within the spreadsheet to be analyzed.\nSelect the PivotTable option under the Insert tab.\nSelect the independent variable (Tray column) within the PivotTable Fields sub-window and drag to the Rows field.\nSelect the dependent variable of interest (Egg Weight) and drag it to the Values field.\nChange Value field settings by clicking on the dependent variable and selecting Value Field Settings.\n\t\t\nChange the setting to Count.\nIncubation\n\t\nPlace eggs in their appropriate incubation tray and pre-incubate them at 26.6 °C with 40% ± 4% relative humidity for 6 h.\n\t\tNOTE: Some incubators have self-monitoring systems that may not be entirely accurate. Use other temperature and humidity monitoring devices to control conditions.\nIncrease the incubator temperature to 37 °C with 40% ± 4% relative humidity and maintain these conditions until incubation day 18.\n\t\t\nTo ensure proper incubator temperature, measure several eggs' surface temperatures throughout the incubator twice daily with a thermal surface thermometer to ensure surface temperatures are 37 °C.\nRotate eggs hourly to reposition.\nRecord egg weights daily to ensure 10%-12.5% egg weight loss during the first 18.5 days of incubation.\n\t\tNOTE: If weight loss is not within the desired range, adjust (increase or decrease) humidity.\nIncubation day-10 in ovo injections",
    "Calculate the amount of nicotinamide riboside needed for each treatment using the formula weight of 290.07 g/mol, with 100 µL of solution injected into each eggs' yolk sac.\n\t\tNOTE: Sterile saline (0.9%) solution will be used as the diluent for all solutions.\n\t\t​Calculation: 50 eggs × 100 µL = 5,000 µL (5 mL) of solution needed. Round up to 6 mL to ensure enough solution is available for injection (Figure 1).\n\t\t\nOnce solutions are made, place them in a 37 °C water bath to keep them at the temperature of the eggs.\nRemove eggs from the incubator one tray at a time and cover with a warm towel.\nCandle egg to locate the yolk sac and clean the area of injection with 70% ethanol.\nInsert a sterile 20 G, 2.54 cm hypodermic needle ~1 cm into the eggshell and inject the assigned dose into the yolk sac. Inject the eggs from the 0 mM nicotinamide riboside treatment with 100 µL of sterile saline (0.9%).\nImmediately, cover the injection site with a small piece of absolute waterproof tape to avoid excessive moisture loss.\nOnce all eggs have received their treatment, place the tray back into the incubator.\nOn incubation day 18, remove eggs from trays and place them in hatching boxes according to their treatments.\nPlace hatching boxes into the incubator and increase humidity to 60 ± 2% until all eggs hatch or until day 23 of incubation.\n\t\tNOTE: If eggs do not contain an embryo at candling, discard the egg. This will prevent the occurence of rotten eggs. \n2. Euthanasia and pectoralis major  muscle sample collection\nChick euthanasia",
    "On incubation day 18, remove the embryonic eggs from the incubator and place them at room temperature for 1 h to cease metabolism. Remove the embryos from the eggs, weigh without the yolk sac, and then decapitate. 12 h post-hatching, euthanize the chicks by exposure to CO2 for 10 min, weigh, quickly collect crown-to-rump length measurement, and then decapitate.\n\t\tNOTE: The fact that the bird no longer has their head ensures euthanasia.\nConsider the following measurements (steps 2.1.2.1-2.1.2.4) using digital calipers for embryos and chicks.\n\t\t\nFor determining crown-to-rump length, lay the chick on its side with its head tucked down and legs under its body. Measure from the top of the head to the tail.\nTo measure the head width, measure from one ear hole to the other ear hole.\nFor determining head length, measure from the rear of the beak to the back of the cranium.\nTake a non-elastic string and wrap it around the skull from one ear hole to the other to measure the head circumference. Place string on a metric ruler to obtain a measurement.\nCollect chest circumference by wrapping a string around the chest, under where the wings contact the body and placing the string on a metric ruler to obtain the measurement.\nSpray breasts with 70% ethanol, and using fingers, pull the feathers and skin to reveal the pectoralis major muscles and take the measurements (steps 2.1.4.1-2.1.4.2) with digital calipers.\n\t\t\nFor determining the chest width, measure across the chest where the wings contact the body.\nFor determining the chest length, measure from the bottom of the clavicle to the top of the fat pad.\nExtraction of pectoralis major muscle, measurement, and collection",
    "Using surgical scissors or scalpel and forceps, remove the right pectoralis major muscle by cutting along the keel bone and releasing the muscle from the body wall.\n\t\tNOTE: Be sure not to collect the pectoralis minor muscle by visually identifying that the muscle remains on the rib cage.\nAfter removing the pectoralis major muscle, lay the muscle flat on a popsicle stick, and collect the following measurements (steps 2.2.2.1-2.2.2.3) using digital calipers.\n\t\t\nFor determining the muscle length, measure from the cranial to the caudal portion of the muscle.\nFor determining the muscle width, measure at the widest portion of the cranial part of the muscle.\nFor determining the muscle thickness, pick up the breast with forceps and measure at the thickest portion of the cranial part of the muscle.\nIf desired, store this muscle and the left pectoralis major muscle for further analyses (such as histology, protein and gene expression, etc.) at -80 °C for up to a year.\n3. Statistics\nAnalyze the data as a completely randomized design with egg/chick as the experimental unit.\n\tNOTE: Nicotinamide riboside dose (DOS) served as the fixed effect. All data were analyzed with a statistical analysis software program (see Table of Materials), and pairwise comparisons between least-square means of treatments were computed. Differences were considered significant at P < 0.05.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}