{
  "id": 19436,
  "origin_website": "Jove",
  "title": "Assessing Changes in Synaptic Plasticity Using an Awake Closed-Head Injury Model of Mild Traumatic Brain Injury",
  "procedures": [
    "Approval for all animal procedures was provided by the University of Victoria Animal Care Committee in compliance with Canadian Council on Animal Care (CCAC) standards. All male Long-Evans rats were bred in-house or purchased (see the Table of Materials).\n1. Housing and breeding conditions\nAllow the animals to acclimate to their housing environment for 1 week before weaning at postnatal day (PND) 21.\nMaintain the rats in standard cage housing at 22.5 °C ± 2.5 °C, with ad libitum access to food and water, on a 12 h light/dark cycle.\nGroup and house the animals with two or three sex-matched littermates and randomly assign them to either sham or r-mTBI conditions.\nPerform all procedures between 7:30 AM and 11:30 PM.\n2. Setup of awake closed-head injury procedure\nPosition a 2.75 in. low-density foam pad (100 cm x 15 cm x 7 cm) underneath the impactor to allow for rotational head movement.\n\tNOTE: The foam pad had a spring constant of ~2,500 N/m but can vary between 3,100 and 5,600 N/m58. The level of firmness (low, medium, and high) has not shown to be predictive of injury outcome59. The foam pad is a non-consumable material. It is normally replaced yearly or if soiled or damaged.\nTurn on the modified cortical impact device (Figure 1A), and set the velocity to 6 m/s.\n\t​NOTE: These specifications are designed to elicit acute neurological impairment in juvenile and adolescent aged rats that are analogous to features of an mTBI, but such parameters may not be suitable for older animals or other species (e.g., mice or ferrets). For a review of common ACHI parameters, see60.\n3. Induction of mTBI",
    "When the rats reach PND 24, move them into the procedure room where the procedures will be performed. Ensure this room is separate from their normal housing environment.\nGently place the rat in a restraint cone, ensuring that the snout and nostrils are close to the cone's small opening to allow for adequate ventilation. Use a plastic hair clip to hold the cone closed at the caudal end to prevent movement once the rat is placed in the restraint cone.\n\t\nUse restraint scores to record the animals' compliance or tolerance with the restraint cone and ACHI procedure.\n\t\tNOTE: The restraint score can be used as an assessment of stress in the animals. Thus, exclusion criteria can be developed using the restraint score to reduce variability between subjects that arises due to an excessive stress response.\n\t\t\nGive a score from 0 to 4 based on the animal's willingness to enter the cone, their movements, and vocalizations. Give a score of 0 if there is no resistance to the restraint, while a score of 1 corresponds with the animal turning 1-2x and little-to-no vocalization or squirming. Give a score of 2 if the animal has turned 2-3x and exhibits some vocalization or squirming. Give a restraint score of 3 if the animal has turned 5-10x and exhibits more vocalizations and squirming. Finally, give a score of 4 if the animal has turned more than 10x with frequent vocalizations and squirming.\n\t\t\tNOTE: This information is also on the scoring sheet itself (Supplementary Table S1 and Supplementary Table S2).\nWhile the rat is restrained, manually position the helmet (Figure 1B) over the midline, with the targeting disk over the left parietal lobe (Figure 1C,D).",
    "Place the rat on the foam pad and manually set the impactor to the Extend position. Manually lower the impactor tip so that it comes in contact with the targeting disk on the helmet. Manually set the impactor to the Retract position to make the impactor withdraw 10 mm above the helmet.\nUse the dial on the stereotaxic arm to lower the impact tip by 10 mm so that it is again touching the targeting disk on the helmet. Flip the Impact switch so that the animal's head is rapidly accelerated for 10 mm at 6 m/s.\nOnce the device has been activated, immediately remove the animal from the restraint cone and proceed to perform an immediate neurological assessment protocol (NAP).\n\t​NOTE: For the current experiments, this protocol was repeated eight times in total at 2 h intervals.\n4. Induction of sham injury\nFollow all experimental procedures as described above in section 3 but place the rat adjacent to the path of the impact piston, so no injury is delivered.\n5. Neurological assessment protocol\nNOTE: The NAP can be used to measure the level of consciousness, as well as cognitive and sensorimotor functioning.\nAt baseline and immediately following induction of the mTBI or sham injury, assess the rats using the NAP as described in56,61. On a table, place the rats' home cage and a recovery cage spaced 100 cm apart. Evenly center the balance beam on top of both cages. Additionally, place a folded towel or additional cushioning underneath the balance beam.",
    "If required, assess the level of consciousness. If animals are non-responsive after the mTBI, assess the apnea (cessation of breathing) and any delay in the righting reflex by using a stopwatch to record the time taken for the animal to resume breathing and/or right themselves from a supine into the prone position.\n\tNOTE: Loss of righting reflex and apnea are rare with the ACHI model but they can occasionally be observed in juvenile animals.\nAssess the rat's cognitive and sensorimotor function using the following sequence of tests. Administer these tests rapidly in succession following the assessment of consciousness.\n\tNOTE: The summation of these four tests yields a total score out of 12, if there are no observed behavioral deficits. Deficits detract from this score.\n\t\nStartle response\nPlace the rat in the empty recovery cage and clap loudly (50 cm) over the cage. Record the animal's response to the noise using the following scoring system:\n\t\t\t3 = Quick startle reaction to sound (e.g., ear movement/twitches, jump, whole body freezes).\n\t\t\t2 = Slow reaction or slight freezing reaction to sound.\n\t\t\t1 = Only ear movements observed.\n\t\t\t0 = No reaction to sound.\nLimb extension\nWith the beam (100 cm long x 2 cm wide x 0.75 cm thick) placed horizontally across the rat's home and recovery cages, pick up the rat by the base of the tail and hold it near the beam. Ensure the rat is close enough to be able to easily grasp it. Assess the rat's ability to extend both limbs out to the beam with the following scoring system:\n\t\t\t3 = Full extension of both forelimbs and grasps the beam.\n\t\t\t2 = Only one limb is extended.\n\t\t\t1 = Intermittent extension or retraction of forelimbs.\n\t\t\t0 = Forelimbs are limp/no extension.\nBeam walk",
    "Place the animal in the center of the horizontal beam at the 50 cm mark facing its home cage. Ensure the beam is spaced equally between the rat's home cage and recovery cage (placed ~80 cm apart). Allow the rat to walk across the beam. Assess the rat's ability to balance and walk with the following scoring system:\n\t\t\t3 = Successfully walks across the beam with less than two foot slips within 10 s.\n\t\t\t2 = Successfully walks the beam, but more than two foot slips are observed.\n\t\t\t1 = Non-locomotive movement, 'swimming' motion.\n\t\t\t0 = Unable to walk along the beam or unable to move within 10 s.\nRotating beam\nReposition the rat at the center of the beam, ensuring the rat is balanced. Lift the beam 80 cm above a towel or padded surface and begin manually rotating the beam at a rate of one rotation per second for 4 s (a total of four rotations). Assess the rat's ability to remain on the beam as it rotates with the following scoring system:\n\t\t\t3 = Rat remains on the beam for all four rotations.\n\t\t\t2 = Rat falls on the fourth rotation.\n\t\t\t1 = Rat falls on the second or third rotation.\n\t\t\t0 = Rat falls during the first rotation.\nUpon completion of NAP, return mTBI and sham rats to their home cages. Repeat as necessary for r-mTBI procedures. Monitor the well-being of the animals following injuries with the Cage-side Monitoring Checklist (Supplementary File 1). If there is any indication of abnormality (any score that is not N) during cage-side monitoring, a full pain score should be taken with the Pain Scale and Advanced Monitoring Checklist after Head Impact (Supplementary File 2).\n6. Slice preparation",
    "NOTE: In the current study, synaptic plasticity was assessed in animals following r-mTBI at either 1 or 7 days after mTBI. On these days, the animals were brought individually into the laboratory in covered cages prior to sacrifice.\nRefrigerate (-20 °C) overnight all surgical tools (Figure 2A) required for making hippocampal slices: standard scissors, dissecting scissors, forceps, rongeurs, spatulas, and chilling block.\n\tNOTE: The tissue glue and incubation chamber should not be refrigerated.\nPrepare artificial cerebrospinal fluid (aCSF) containing 125 mM NaCl, 2.5 mM KCl, 1.25 mM NaHPO4, 25 mM NaHCO3, 2 mM CaCl2, 1.3 mM MgCl2, and 10 mM dextrose (300 ± 10 mOsm; pH 7.2-7.4).\n\tNOTE: The main solution of aCSF must be continuously bubbled with carbogen (95% O2/5% CO2) for the duration of the protocol.\nBefore euthanizing the animal (step 6.8), prepare 12.5 mL of agarose. Dissolve 0.25 g of agarose in 12.5 mL of phosphate-buffered saline (1x PBS) by microwaving in a 50 mL conical tube in 10 s increments.\nKeep the agarose warm (42 °C) and shake in a heating plate to prevent it from solidifying.\nSet up a cutting station on ice, including a Petri dish and a small beaker (50 mL) filled with ice-cold aCSF (4 °C) and an overturned Petri dish with a piece of wetted filter paper on top (Figure 2A). Continuously bubble the aCSF in the small beaker with carbogen.\nWarm the water bath to 32 °C. Fill the recovery chamber with aCSF and continuously bubble with carbogen (Figure 2B).\nTransport the animal to the experimental room.\nAnesthetize the animal using 5% isoflurane as an inhalant (until lack of a withdrawal reflex) and then rapidly decapitate it using a small guillotine.",
    "Dissect the brain from the skull in the Petri dish filled with ice-cold (4 °C) aCSF, holding the skull submerged in the aCSF to help rapidly cool the tissue.\n\tNOTE: This procedure normally requires under 5 min, but the speed of brain removal is not a critical factor if the brain is submerged in chilled aCSF.\nPlace the brain into the small beaker of chilled and carbogenated aCSF to further clean and chill the sample.\nMove the brain to the upside-down Petri dish and place it on the filter paper. Use a sharp scalpel to remove the cerebellum and prefrontal cortex to \"block\" the brain. Separate the two hemispheres by making a cut down the midline of the brain.\n\tNOTE: The following protocol is performed one hemisphere at a time. It is imperative that the hemisphere not currently being prepared remains submerged in the beaker of ice-cold (4 °C) carbogenated aCSF.\nTo create transverse hippocampal slices, place the hemisphere on the medial surface. Tilt the blade of a scalpel at ~30° inward and remove a thin slice from the dorsal surface of the brain to provide a flat surface for the brain to be mounted on the piston used by the slicer. Flip the brain onto the dorsal surface and gently dab the tissue on dry filter paper to remove any excess aCSF. Using cyanoacrylate glue, attach the dorsal surface of the brain to the piston, leaving the ventral surface upright.\n\tNOTE: Ensure that the glue does not run over the edge of the piston, as this will cause it to adhere to the metal tube used to contain the agarose and prevent movement of the piston.",
    "Extend the outer tube of the piston over the brain and pour the liquid agarose into the tube until the brain is completely covered. Quickly solidify the agarose by clamping a chilling block over the piston tube (Figure 2A).\nPosition the piston into the chamber of the slicer and secure the chamber with a screw. Secure the blade and add ice-cold, oxygenated aCSF to the slicer chamber.\nOn the slicer (Figure 2B), set the cutting speed to 4, oscillation to 6, and toggle the continuous/single slicing switch to continuous. Push start to begin sectioning the brain at 400 µm.\nAs the slicer sections the brain, use a large diameter Pasteur pipette to transfer each slice to the recovery bath of oxygenated aCSF as it is sectioned (Figure 2C).\n\tNOTE: As each slice is cut, it can be placed sequentially in the different wells of the recovery bath. This protocol usually yields between six and eight slices, containing the hippocampus for each hemisphere. A rat atlas62 can be used to identify the dorsal-ventral position of individual slices in the rat brain.\nLet the slices recover at 32 °C for 30 min and then leave to recover for an additional 30 min at room temperature (23 °C).\nRepeat these steps to create slices from the second hemisphere.\n7. Field electrophysiology\nNOTE: To acquire extracellular field recordings from the dentate gyrus (DG), perform the following steps. Following the 60 min recovery, individual hippocampal slices are ready for extracellular field recordings.\nUsing a commercially available micropipette puller, pull recording electrodes (1-2 MΩ) from 10 cm borosilicate glass capillaries with an outer diameter of 1.5 mm and an inner diameter of 1.1 mm.",
    "NOTE: Recording electrode should have a resistance of ~1 MΩ and the tips should be ~1 mm in size. Consistency in electrode parameters is important for good recordings.\nTurn on the computer and equipment to be used for recordings: the amplifier, digitizer, stimulator, micromanipulator, temperature regulator, microscope light, and vacuum pump.\nFill a beaker with aCSF and connect it to a gravity-controlled perfusion system. Open the aCSF valve on the perfusion system to begin a flow of aCSF through the perfusion chamber. Maintain a flow rate of approximately one or two drips/s or 2 mL/min. Continuously carbogenate aCSF for the duration of electrophysiological recordings.\n\tNOTE: It is imperative to maintain a constant drip rate of carbogenated aCSF during field recordings. It is also imperative that the reference electrode is completely submerged in aCSF.\nUse a Pasteur pipette to transfer a hippocampal slice from the recovery bath to the perfusion chamber that is continuously perfused with carbogenated aCSF and maintained at 30 ± 0.5 °C. Orientate the brain slice so that the dentate gyrus and granule cell layer are visible in the field of view. Stabilize the slice with bent wire weights. Start the computer software for data acquisition.\n\tNOTE: It can be helpful to turn off the vacuum pump during this step to allow for free manipulation of the tissue. This should be done quickly as too much manipulation can damage the tissue. Additionally, the perfusion chamber can overflow with aCSF if this takes too much time. Once the tissue is orientated properly and stabilized, turn on the vacuum pump.",
    "Use an upright microscope to visualize the DG with oblique optics. Position a concentric bipolar stimulating electrode to activate the medial perforant path (MPP) fibers in the middle third of the molecular layer. Then, position a glass micropipette, filled with aCSF in the MPP (Figure 3A,B). Begin with the electrodes further apart (i.e., the stimulating electrode near CA3 and the recording electrode just above the genu of the DG), as touching the tissue will cause damage to the fibers.\n\tNOTE: Optimally, all recordings should have the electrodes placed equidistant from the cell layer, approximately 200 μm apart.\nOnce the stimulating and recording electrodes are positioned, visualize the evoked field responses using an amplifier, a digitizer, and recording software.\nTo find a suitable field excitatory postsynaptic potential (fEPSP), stimulate the tissue with 0.12 ms current pulses at 0.2 Hz (every 5 s) when the user is proficient at finding responses, or at 0.067 Hz (every 15 s) for less proficient users to avoid overstimulation. Ensure that the fEPSP has a minimum amplitude of 0.7 mV with a clear fiber volley that is smaller than the fEPSP.\n\tNOTE: It is critical to position both electrodes equidistant from the cell layer to obtain maximal field responses and far enough apart (i.e., ~200 μm) to generate a small fiber volley. Small adjustments in electrode position may help enhance the amplitude of the response, although these should be kept to a minimum to avoid tissue damage.\nDetermine the maximum fEPSP amplitude by increasing the stimulation intensity and then set the simulating intensity so that the fEPSP is at 70% of the maximum amplitude.",
    "NOTE: The maximum amplitude is set to 70% for long-term depression (LTD) studies and to 50% for long-term potentiation (LTP) studies. The maximum amplitude is determined by adjusting the stimulation strength until the fEPSP no longer increases in amplitude. For a fEPSP with a 2 mV maximum amplitude, the response size would then be adjusted to 1.4 mV for LTD studies and 1.0 mV for LTP studies, to allow room for the fEPSP to depress or potentiate (respectively).\nEstablish a stable preconditioning baseline for 20 min with 0.12 ms pulses delivered at 0.067 Hz. For slices to be considered stable, look for <10% variability in the initial slope of the fEPSP and for the slope of the line of best fit through the plotted fEPSP slopes to be <0.5. Proceed with the next steps of the recording when EPSPs are verified to be stable for 20 min.\n\tNOTE: Various receptor antagonists can be added to the aCSF to block or enhance LTD and LTP. If they are required, ensure the slices are exposed to these pharmacological agents during this baseline period and that the requirements for stable recordings are met. For examples, see63,64,65.\nFirst, determine changes in basic synaptic properties by using paired-pulse stimuli and by constructing stimulus-response input-output curves. For the paired-pulse test, apply a series of paired pulses with an interpulse interval of 50 ms at 0.033 Hz. For the input-output curves, apply a series (10) of increasing stimulus intensities (0.0-0.24 ms) at 0.033 Hz to plot the fEPSP response size change.\nTo study LTD that is primarily dependent on the activation of CB1 receptors64,66, employ a 10 Hz protocol (6,000 pulses at 10 Hz). This protocol takes 10 min to administer.",
    "For postconditioning recordings, resume using single-pulse stimulation (0.12 ms at a frequency of 0.067 Hz) for an additional 60 min.\nFollowing the postconditioning recording, again administer the paired-pulse stimuli, followed by an input-output curve. Compare these to baseline recordings to observe alterations in presynaptic release properties and help assess the health of the slice for long-term recordings.\nDuring analysis, be conservative and adhere to the exclusion criteria when determining if the data from individual slices should be retained in the synaptic plasticity data set. Exclude slices that display a large slope in a line of best fit of fEPSP slopes during the preconditioning baseline (slope >0.5), instability in preconditioning baseline (>10% change), and or instability in the postconditioning period (slope >1.5 in 50-60 min of postconditioning).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}