{
  "id": 9314,
  "origin_website": "Jove",
  "title": "Super-resolution Imaging of Neuronal Dense-core Vesicles",
  "procedures": [
    "1. Sample Preparation\nPrepare DNA encoding a photoconvertible or photoactivatable chimera targeted to DCVs, using standard molecular biology techniques.\n\tNote: One possibility is DNA encoding a tissue plasminogen activator-Dendra2 chimera (tPA-Dendra2). Dendra2 is a photoconvertible protein that switches from green to red emission upon exposure to ultraviolet light12.\nCulture hippocampal neurons on high performance #1.5 cover slips for ~5-10 days, following standard protocols13.\nTransfect developing hippocampal neurons using a cationic lipid reagent.\n\tNote: Viral-mediated infection is more effective for mature neurons. This alternative approach has been described in detail elsewhere14.\n\t\nPrepare a 1.5 ml tube containing ~1 µg of DNA and 250 µl of minimal essential medium (MEM) and a second 1.5 ml tube containing 4 µl of the cationic lipid reagent and 250 µl of MEM.\nIncubate the solutions for 5 min.\nCombine the two solutions and incubate the resulting mixture for an additional 30 min.\nDuring the incubation, prepare a dish containing several ml of culture medium warmed to 37 °C.\nGently transfer cover slips containing neurons to the dish containing warm medium and add the transfection mixture.\nTilt the dish gently and then place it in an incubator at 37 °C for 90 min.\nReturn neurons to their \"home dish\" and wait ~12-18 hr.\nFix cells for 45 min in 4% paraformaldehyde/4% sucrose in phosphate buffered saline (PBS, pH 7.4) warmed to 37 °C.\n\tNote: In PALM experiments, it is important to achieve good preservation of ultrastructure, and standard formaldehyde fixation protocols used for immunofluorescence staining typically are not sufficient15. One important reason for poor structural preservation is insufficient fixation time because formaldehyde fixation involves adduct formation and protein crosslinking, and the latter process is quite slow16. A 45 min fixation helps to mitigate this problem with no detectable overfixation-induced loss of fluorescence.",
    "Wash cover slips ~10x with filtered PBS.\n\tNote: This reduces fluorescent contaminants. Image samples relatively quickly after fixation. In the interim, store cells at 4 °C in filtered PBS in a light-tight container.\nMount cover slips containing neurons in a chamber in filtered PBS.\n\tNote: The sample must be mounted in an aqueous medium, like PBS, with refractive index lower than that of glass, to implement total internal reflection fluorescence (TIRF)-based illumination. TIRF-based illumination is very useful because only cover slip-proximal fluorophores are excited, and there is a large associated drop in background fluorescence17.\n2. Image Acquisition\nTurn on the super-resolution imaging system.\n\t\nTurn on the arc lamp.\nFlip the \"system/pc\" and \"component\" switches (on the power remote switch) to \"on.\"\nTurn on the computer (after the microscope control tablet/docking station comes on).\n\t\tNote: The docking station can be used to control and monitor many attributes of the optics and light path, notably choice of objective and focus.\nDouble click the software icon and choose the \"start system\" option in the login dialog.\nExamine the sample.\n\t\nOpen the front and top access panels on the laser safety cabinet.\nTilt the transmitted light arm to access the stage and objectives.\nPut oil on the alpha Plan-Apochromat 100X numerical aperture/NA = 1.46 (TIRF) objective.\n\t\tNote: A 63X high-NA objective can be used in lieu of the 100X.\nMount the sample on the stage, and raise the objective toward the sample.\nMonitor the lens position using the XYZ function of the docking station. Stop when the lens is in the ballpark of focus (e.g., z ~2.50 mm).\nFully close the access panels.\n\t\tNote: To engage the laser safety.\nFine tune the focus using the oculars and buttons in the locate tab.",
    "Note: The locate tab provides access to buttons that produce arc lamp-based illumination and facilitates direct observation of the sample with the oculars. Similarly, the acquisition tab provides access to tools that produce laser-based illumination and facilitates image capture by the camera.\n\t\t\nGo to the locate tab, choose \"Trans On.\"\nClick the ocular expansion symbol.\n\t\t\tNote: This brings up a schematic of the light path. Attributes of the light path can be altered by left clicking appropriate icons in the schematic or by using the touch screen on the docking station. For example, a filter appropriate for viewing emission from Dendra2 can be chosen using the reflector revolver icon.\nLook into the eyepieces, and bring the cells into focus using the docking station as a guide.\n\t\t\tNote: The sample will be very sparsely populated with fluorescent cells because hippocampal neurons are difficult to transfect, and it thus can be a little tricky to focus using reflected illumination. If this is the case, use transmitted illumination and the z reading of the docking station as a guide.\nToggle the light \"Off\" after focusing.\nIdentify a cell that is fairly bright, exhibits punctate fluorescence, and has a classic morphology that is indicative of good health.\n\t\nChoose reflected light and the filter appropriate for viewing green emission from Dendra2.\nScan the cover slip for cells expressing Dendra2 chimeras using low intensity excitation light.\nSwitch to the acquisition tab.\n\t\nUse the \"experiment manager\" to load a PALM acquisition configuration that is appropriately designed or easily modified.",
    "Note: If no such experiment exists, design a starting experimental configuration using the following settings as a guide: Laser power sliders: 405 nm (~0.01% for a 50 mW laser); 488 nm (~3% for a 100 mW laser); 561 nm (~40% for a 100 mW laser); Exposure time: ~50 msec; Camera gain: ~200; Multidimensional acquisition: time series (cycles = 30,000, interval = 0); Tracks: 488 nm with epi-illumination, and 561 nm with TIRF-based illumination (see step 2.5.1); Objective: 100X (NA = 1.46); TIRF angle slider: incidence angle ~67-72°; Pixel size: 100 nm; Field of view: TIRF (the alternative choices yield higher laser intensities and are used for fluorophores that are more difficult to bleach).\nClick \"yes\" when a pop up menu appears with a query about switching on lasers.\nBring the image of the cell into focus at the camera plane.\n\t\nChoose the 488 nm epi-illumination laser track.\n\t\tNote: Tracks are beam configurations used during imaging. Here, track names are determined by the excitation wavelength that produces the emission that is passed to the camera. For example, the 561 nm track uses both the 405 and 561 nm laser lines, but the filter cube passes only emission from photoconverted Dendra2 excited by 561 nm light to the camera.\nFocus the image of the cell on the camera using the \"continuous\" acquisition button.\nCollect a conventional widefield image.\n\t\nUse the \"Snap\" button.\nSave the image by going to the \"File\" menu and choosing \"save/save as.\"\nSet up the TIRF-based illumination.\n\t\nChoose the 488 track and switch to \"TIRF\" using the EPI/TIRF button.\nChoose \"continuous\" acquisition.\nAdjust the TIRF-based illumination slider.",
    "Note: TIRF is achieved when there is a sudden darkening of background AND the specimen can be focused in ONE plane18. If new features become apparent via focusing up into the sample, the incidence angle is too low because in TIRF there is only one plane of focus.\nDouble check the TIRF angle using the 561 track with the 405 nm laser \"off.\"\nTurn the 405 nm laser back \"on\" before initiating a PALM experiment.\nCollect PALM data.\n\t\nHit \"start experiment.\"\n\t\tNote: If desired, open the \"online processing options\" tab and check \"online processing PALM\" and \"Fit Gauss2D\" (before starting the experiment) to monitor the reconstructed PALM image during raw data collection. This will facilitate assessment of the quality of the data and thus the value of continuing the relatively time-consuming data collection process.\nVisually monitor photoconversion.\nIncrease the intensity of the 405 nm (photoconverting) laser when Dendra2 photoconversion diminishes (typically after acquisition of ~10,000 raw images).\nContinue the experiment if photoconversion increases. Otherwise, stop the experiment (without loss of data) by hitting the \"stop\" current step button.\nSave the images when data collection is complete (after ~15 min).\n3. Image Processing, Display, and Analysis\nIn the absence of online processing, process raw images that were saved to disk.\n\t\nClick on the processing tab, open the method tab, and select \"PALM.\"\nChoose \"PALM\" again from the four suboptions.\nGo to the file menu, open and view the file of interest, and hit \"select.\"\nHit \"apply.\"",
    "Note: This will initiate peak/fluorophore finding and peak localization with default options. If necessary, peaks also can be grouped using the \"PAL-Group\" tab. Grouping assigns peaks that appear in several consecutive frames to a single molecule if the peak coordinates are sufficiently similar. In addition, the data can be corrected for sample drift using the software’s model-based drift alignment option.\nFilter out poorly localized and poorly sampled components in the peak-localized data.\n\t\nDiscard fluorophores with localization precisions, σ, >35 nm using the \"PAL-Filter\" tool.\nDiscard fluorophores in areas where the mean distance between peaks, d, is too large to resolve vesicles of diameter, D.\n\t\t\nExtract the mean localization precision, σ, from the localization precision histogram.\nCalculate a maximum acceptable value for d based on σ, and the Shannon-Nyquist criteron19, as embodied in the resolution approximation20 R = D = [(2.35σ)2 + (2d)2]1/2.\nSet the threshold in the \"Remove PALM outliers\" tool to delete peaks surrounded by fewer than πD2/(4d2) neighbors within a circle of radius D/2.\nConvert the processed PALM data into a PALM image using the \"PAL-Rendering\" tool; see Figure 1.\nQuantify sizes and separations by choosing the \"Profile\" function.\n\t\t\nCheck the associated line and table options, and draw a line along the desired direction in the image.\nQuantify diameters by determining full widths at half maximal intensity.\nQuantify separations by determining peak-to-peak spacings of intensity profiles.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}