{
  "id": 7546,
  "origin_website": "Bio",
  "title": "<em>Phytophthora sojae</em> Transformation Based on the CRISPR/Cas9 System",
  "procedures": [
    "Screening and analysis of sgRNA targetsUse EuPaGDT to find all qualified sgRNAs in the target gene sequence.Enter the gene ID in the \"Job Name\" column, select the \"SpCas9\" option in the \"RNA guided nuclease selection\" column, select P. sojae P6497 from Oomycetes in the \"Genome (expand a category and choose one)\" column, enter the gene sequence in the \"Sequence\" column, and click \"get guide RNA\" to obtain all the potential sgRNA targets in the target sequence.Off-target analysis of candidate sgRNA.Find an sgRNA target in the sense strand and antisense strand of the candidate gene, select the core region of candidate sgRNA (the 12 bp seed sequence at the 3'end and the NGG PAM sequence), and compare it with the genome sequence of P. sojae, using sequence alignment tools in Seqhunter2 or online webserver EumicrobeDB (http://www.eumicrobedb.org[href=http://www.eumicrobedb.org/]). Choose sgRNA targets with good specificity.Construction of CRISPR/Cas9 plasmidsgRNA synthesis (taking Ps139767 as an example)Primer designThe sequence of HH-RIbo +sgRNA+HDV-Ribo is as follows:NNNNNNCTGATGAGTCCGTGAGGACGAAACGAGTAAGCTCGTCNNNNNN(N)14GTTTTAGAGCTAGAAATAGCAAGTTAAAATAAGGCTAGTCCGTTATCAACTTGAAAAAGTGGCACCGAGTCGGTGCTTTTGGCCGGCATGGTCCCAGCCTCCTCGCTGGCGCCGGCTGGGCAACATGCTTCGGCATGGCGAATGGGAC(Taking 20 bp sequence TGACGGTGTAGTCACCATTG as an example)Target fragment sequence:5’CTAGCTAGCCCGTCACTGATGAGTCCGTGAGGACGAAACGAGTAAGCTCGTCTGACGGTGTAGTCACCATTGGTTTCGAGACCCTAG 3’NheI:5′… GCTAGC …3′3′… CGATCG … 5′BsaI:5′… GGTCTC (N)1 …3′3′… CCAGAG (N)5 … 5′The primers designed are:F: 5′ CTAGCTAGCCCGTCACTGATGAGTCCGTGAGGAC 3′R: 5′ CTAGGGTCTCGAAACCAATGGTGACTACACCGTCAGACGAGCTTACTCGTTTCG 3′Clone sgRNAThe sgRNA vector template was pYF515 containing sgRNA fragment.Setup reactions for PCR amplification using:table:\n﻿0,1\n2× Phanta® Max Master Mix (Dye Plus),25 μL\nForward oligo (10 µM),1 μL\nReverse oligo (10 µM),1 μL\nThe template,1 μL\nAdd ddH2O to,50 μL\nAmplify the targeted region by PCR [The annealing temperature (x) depends on the primers]:table:\n﻿0,1,2\n95°C,5 min,1 cycle\n95°C,30 s,32 cycles\nx°C,30 s,32 cycles\n72°C,10 s,32 cycles\n72°C,5 min,1 cycle\n4°C,hold,1 cycle\nEnzyme digestion of sgRNA fragments.table:\n﻿0,1\nBsaI,0.5 μL\nNheI,0.5 μL\n10× Cutsmart Buffer,5 μL\nsgRNA fragment,20 μL\nAdd ddH2O to,50 μL\nEnzymatic digestion of pYF515 vector.table:\n﻿0,1\nBsaI,4 μL\nNheI,4 μL\n10× Cutsmart Buffer,20 μL\nThe template,8 μg",
    "Add ddH2O to,200 μL\nUse the MiniBEST DNA Fragment Purification Kit to purify the digested vector and fragment respectively.Connect the sgRNA fragment to the pYF515 vector.table:\n﻿0,1\nT4 DNA Ligase,1 μL\n10× T4 DNA Ligase Buffer,1 μL\nLinearization vector,1–2 μL\nsgRNA fragment,7 μL\nPlace it at 10–16°C for 2 h.Use 10 μL of the ligation product to transform E. coli JM109 competent cells (homemade).Use the FastPure Plasmid Mini Kit to extract the plasmids and send them for sequencing with M13F and M13R primers.Construction of the replacement vectorAmplify the sequence 1 kb upstream and 1 kb downstream of the target gene, and the replacement fragment HPH.After cutting the gel, use the FastPure® Gel DNA Extraction Mini Kit to recover the fragments.Multi-fragment connection.Optimal cloning vector usage = [0.02× number of base pairs of cloning vector] ng (0.03 pmol)Optimal usage amount of each fragment = [0.02× number of base pairs per fragment] ng (0.03 pmol)The volume (X, Y1, Y2, and Y3) of the vector and fragments depends on the number of base pairs and their concentration.table:\n﻿0,1\n2× ClonExpress Mix,5 μL\n\"pBluescript SK II+ vector, Linearized\",X μL\nUP-1Kb fragment,Y1 μL\nDown-1Kb fragment,Y2 μL\nReplacement fragment,Y3 μL\nddH2O,to 10 μL",
    "Set in the PCR machine at 50°C for 15 min; drop directly to 4°C.Use 10 μL of the ligation product to transform E. coli JM109 competent cells (homemade).Use the FastPure Plasmid Mini Kit to extract the plasmids and send them for sequencing with M13F and M13R primers.PEG-mediated stable transformation of P. sojae protoplastsActivate P. sojae on a 70 mm Nutrient pea broth and agar medium (NPB) solid plate, and cultivate it in the dark at 25°C for 3 to 4 days (Figure 2A).Use a scalpel to cut a 3 × 3 mm fresh mycelium block from the edge of the colony, and add it into a 250 mL Erlenmeyer flask containing 50 mL of liquid NPB. Each Erlenmeyer flask can hold eight mycelium blocks. Incubate the flasks at 25°C in the dark for 2.5 to 3 days, shaking them once every half a day during the culture period. Three flasks of P. sojae culture are optimal for six DNA samples (Figure 2B).Turn on the ultra-clean workbench and sterilize with an UV lamp for 30 min. During this period, weigh the amount of enzyme needed to prepare the enzyme solution, and the PEG needed for 40% PEG into a sterile 50 mL beaker. The tools used in the weighing process must be as clean and sterile as possible.Filter the hyphae of P. sojae that have been cultured for 2.5 to 3 days with autoclaved gauze tied to a 200 mL beaker, place the hyphae mass into a 50 mL Falcon tube, and rinse once with about 40 mL of 0.8 M mannitol. Collect the hyphae again with another sterile gauze wrapped over a 200 mL beaker, place the hyphae in a 50 mL Falcon tube, and pour 35 mL of 0.8 M mannitol buffer over them.",
    "To sufficiently treat the hyphae with mannitol, turn the Falcon tube upside down to fully separate the hyphae. Shake and wash the hyphae with a rotating mixer at 20 rpm (0.003 × g) and at room temperature (RT) for 10 min.During this period, prepare the enzyme solution. Add the specified volume of each component to a sterilized 50 mL beaker, stir with a pipette tip to fully dissolve, and filter into a 50 mL Falcon tube with a 0.45 nm bacterial filter.After the hyphae have been rinsed for 10 min, collect an appropriate amount of hyphae, and add them to the Falcon tube containing the enzyme solution. To fully digest the hyphae, invert the centrifuge tube upside down, and perform enzymatic hydrolysis by centrifuging at 60 rpm and 25°C for 40–50 min (Figure 2C).To prepare a 40% PEG solution, add the specified volume of each component, stir with a pipette tip until they are completely dissolved, filter the solution with a 0.45 nm bacterial filter into a 50 mL sterile beaker, and place it on ice for later use.Use a 50 mL beaker with two layers of mira-cloth to filter the hyphae and collect the protoplasts. Use a 50 mL round bottom centrifuge tube to place the collected protoplasts in a horizontal centrifuge at at 240 × g and 4°C for 4 min. Note: All subsequent operations require the protoplasts to be kept at low temperature (Figure 2D).  Discard the supernatant, add approximately 10 mL of pre-cooled W5 solution to gently resuspend the protoplasts, then add W5 solution to 35 mL, and centrifuge at 240 × g and 4°C for 4 min.Discard the supernatant and add approximately 10 mL of pre-cooled W5 solution to gently resuspend the protoplasts.",
    "Place on ice for 30 min, then centrifuge it at 240 × g and 4°C for 4 min.Discard the supernatant, add pre-chilled MMg solution according to the number of samples to resuspend the protoplasts, to achieve a protoplast concentration of 2 × 106/mL. Keep at RT for 10 min.Add at least 30 μg of transformed plasmids to the bottom of several new 50 mL Falcon tubes placed on ice.Add 1 mL of protoplasts to each Falcon tube, mix completely by gently tapping the tube, and keep the samples on ice for 5–10 min.Add 580 μL of PEG solution to each Falcon tube along the tube wall three times, for a total of 1.74 mL of PEG solution. Gently rotate the Falcon tube during the addition, so that the PEG can flow into the mixture of plasmids and protoplasts along the wall of the tube. After adding the total amount of PEG solution, gently tap the tube to mix well, and place on ice for 20 min (Figure 2E).Add the storage solution of ampicillin (50 mg/mL) to mannitol-pea broth (PM) medium to make the final concentration of ampicillin 50 μg/mL, mix it well, and set aside for later use.Add 2 mL of PM medium to each Falcon tube, slowly invert it once, and place on ice for 2 min.Add 8 mL of PM medium to each Falcon tube, slowly invert it once, and place on ice for 2 min.Add 10 mL of PM medium to each Falcon tube. Incubate it in a tilted stand at 25°C, and regenerate overnight (Figure 2F).Take 5 μL of the culture that has been regenerated overnight (~14 h) and check the regeneration under a microscope. Centrifuge the Falcon tube at 430 × g for 5 min to precipitate the regenerated hyphae (Figure 2G).",
    "Discard the supernatant to leave about 5 mL of liquid in the tube, gently pipette to suspend it, and then add 35 mL of pea/0.5 M mannitol agar medium containing 25 μg/mL G418. Mix up and down, pour it into a Petri dish, blow-dry the water vapor, and incubate at 25°C in the dark (Figure 2H).After 2–3 days, after new hyphae grow out, cover with 15 mL of V8 agar medium containing 50 μg/mL G418, blow-dry the water vapor, and continue culturing at 25°C in the dark (Figure 2I).After approximately 3 to 4 days, the mycelium will grow again. Cut a single regenerated small colony with dense hyphae and transfer them to a V8 plate, containing 50 μg/mL G418 for culture. The regenerated strains obtained are initially considered to be knockout mutant, used for subsequent identification, and phenotypic analysis.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4352/bioprotoc-12-06-4352-g002.jpgFigure 2. PEG-mediated transformation procedure of P. sojae.  (A) A colony of P. sojae (strain P6497) was grown on nutrient pea broth for 3–5 days. (B) An agar plug was used to inoculate nutrient pea broth in a flask. The image was taken after 3 days of inoculation. (C) P. sojae mycelium digestion using a flip mixer. (D) Filter the hyphae and collect the protoplasts in a 50 mL beaker with two layers of mira-cloth. (E) Slowly add 40% PEG solution along the wall of the Falcon tube and let the droplet slide to the bottom of the tube. (F) Incubate protoplasts at 25°C in a tilted and static manner, and allow them to regenerate overnight. (G) Check the regenerated hyphae under a microscope. (H) Pour plates with regenerated protoplasts. (I) After new hyphae grow out, cover with V8 agar medium containing 50 μg/mL G418.",
    "Screening and verification of knockout mutantsIt is recommended that the resistant transformants obtained by Phytophthora transformation grow on G418-containing plates for 7 days, before screening transformants. Extract the genes of the transformants, then screen and verify the knockout mutants by genomic PCR and sequencing methods.CTAB method for crude extraction of mycelial genomic DNA:Scrape an appropriate amount of mycelium into a 2 mL centrifuge tube, then add 500 μL of 2% CTAB and 500 μL of chloroform, and treat it in a shaker at 37°C for 1–2 h.Centrifuge the tube at 16,000 × g for 10 min. Take 400 μL of the supernatant, transfer it to a new 1.5 mL centrifuge tube, add 800 μL of absolute ethanol, mix well, and place it at -20°C for precipitation for more than 30 min.Centrifuge the tube at 16,000 × g for 10 min, discard the supernatant, centrifuge again for 2 min, and use a pipette to completely aspirate the supernatant.Place the centrifuge tube in an oven at 50°C for 10–20 min, to allow the ethanol to volatilize.Dissolve with 30 μL of ddH2O and store at -20°C.Alternative:  Refined extraction of genomic DNAUse Tiangen new plant genome extraction kit (DP320-50), and carry out the operation in accordance with the manufacturer’s instructions.Screening for knockout mutantsUse the Ps139767 gene internal primer 139767-genome-F/R to conduct a PCR, to verify whether the Ps139767 sequence exists in the genome. Select the transformants which contain no Ps139767 signal as candidate knockout mutants.Perform the PCR with primer 139767-overup-F1 outside the upper arm 1 kb with HPH internal primer Hph-overup-R1, and HPH internal primer Hph-overdown-F2 with primer 139767-overdown-R2 outside the lower arm 1kb, to verify that the replacement fragment was successfully integrated into the correct position in the genome (Figure 3).",
    "Further verify the PCR results by sequencing with M13F and M13R, to screen the candidate knockout mutants.Set up the reaction for PCR amplification of genomic DNA extracted from candidate mutants:table:",
    "﻿0,1\ndNTP,2 μL\n10× PCR Buffer (Mg2+ plus),2.5 μL\nrTaq,0.25 μL\nForward oligo (10 μM),0.25 μL\nReverse oligo (10 μM),0.25 μL\nThe template,1.5 μL\nAdd ddH2O to,25 μL\nAmplify the targeted region by PCR [The annealing temperature (x) and extension time (n) depend on the primers]:table:\n﻿0,1,2\n95°C,5 min,1 cycle\n95°C,30 s,32 cycles\nx°C,30 s,32 cycles\n72°C,n min,32 cycles\n72°C,5 min,1 cycle\n4°C,hold,1 cycle\nimgsrc:https://en-cdn.bio-protocol.org/attached/image/e4352/bioprotoc-12-06-4352-g003.jpgFigure 3. Analysis of genomic DNA from Ps139767 candidate transformants."
  ],
  "subjectAreas": [
    "Microbiology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}