{
  "id": 10883,
  "origin_website": "Jove",
  "title": "Mimicking a Space Mission to Mars Using Hindlimb Unloading and Partial Weight Bearing in Rats",
  "procedures": [
    "All methods described here were approved by the Institutional Animal Care and Use Committee (IACUC) of Beth Israel Deaconess Medical Center under protocol number 067-2016.\nNOTE: Male Wistar rats aged of 14 weeks at baseline (day 0) are used. Rats are housed individually in custom cages 24 h prior baseline to allow for acclimation.\n1. Hindlimb unloading\nNOTE: The pelvic harness can be put on either anesthetized or awake animals. Here, the description of the protocol is given on anesthetized animals. Wear proper personal protective equipment (PPE) to handle animals.\nPlace the rat in an anesthesia box with 3.5% isoflurane and an oxygen flow of 2 L/min.\n\tNOTE: Proper anesthetization is confirmed when a firm pinch of the rear paw does not elicit a reaction.\nOnce the animal is fully anesthetized, place the rat on the bench with anesthetic gas coming from a nosecone with 2% isoflurane and an oxygen flow of 1.5 L/min.\nPlace the rat in a prone position and put the pelvic harness on in a rostro-caudal movement.\nGently bend the pelvic harness to provide a snug fit while being careful not squeeze the hindlimbs to prevent abrasions and discomfort.\nAttach the stainless steel chain with the swivel clasp to the top of the pelvic harness, where a hook is attached at the base of the tail.\nRemove the rat from anesthesia and place the animal in a custom cage with the chain extended at its maximum.\nOnce the rat is fully awake and mobile, shorten the chain using the top swivel clasp until the hind limbs can no longer reach the floor.\nObserve the animal for a few minutes to assess its comfort and make sure that at all times, both hind limbs remain completely unloaded.\n2. Partial weight bearing",
    "NOTE: This step can be realized in both awake and anesthetized animals.\nConvert the HLU suspension device into a PWB suspension by adding the triangle-shaped part composed of stainless steel chains and a back rod.\nAnesthetize the animal following the same procedures as detailed for the HLU (steps 1.1 and 1.2).\nPlace a tether jacket of the appropriate size on the forelimbs of the rat (M for rats of 400 g or lower, L for rats weighing above 400 g) and close it using the back bra extender.\nAttach one clasp of the triangle-shaped part to the hook located on the back bra extender and the opposite clasp on the hook located on the pelvic harness at the base of the tail.\nAllow the animal to recover from anesthesia in the cage. Once awake, verify that the suspension is equal on both the forelimbs and the hindlimbs by shortening the chain and modifying the location of the bottom swivel clasp if needed.\n\tNOTE: This step can also be realized using a force plate to confirm the equal loading on all limbs.\nPlace the rat on top of the scale to record the “loaded” body weight, i.e., the weight of the animal and the entire apparatus, without shortening the chain.\nShorten the chain until the scale displays 40% of the “loaded” body weight and record the achieved gravity level (expressed as the ratio between unloaded weight and loaded weight).\nObserve the animal to make sure that the unloaded weight is stable and that the rat is equally loaded on all limbs.\nRemove the entire apparatus from the scale using the rod and place the rat back in its cage.\n3. Assessment of hindlimb grip force",
    "Hold the rat with a traditional restraint by placing one hand underneath the forelimbs. Gently hold the tail with the second hand.\nApproach the grip bar with the rear paws and make sure that both paws are fully resting on the bar.\n\tNOTE: If the rat does not fully grip the bar or does not display any evidence of voluntary gripping, slightly release the restraint. If this is unsuccessful, return the rat to its cage and retry after a few minutes.\nGently pull the rat straight back until it releases its grip. Record the maximal force displayed on the transducer.\nWait approximately 30 s between measurements and repeat the test 3 times.\nCalculate the average of the three measurements for scoring, to account for fatigue.\n4. Recording of muscle wet mass\nPlace the rat in a CO2 euthanasia chamber. After waiting the appropriate time according to IACUC and AVMA guidelines, confirm euthanasia by a visual observation of a lack of breathing.\nPlace the rat on the dissection table in a prone position and remove the fur and skin by incising near the ankle using small dissection scissors. Use hands to pull the skin layer off.\nUsing small dissection scissors, gently break the muscle fascia and isolate the calcaneus tendon.\n\tNOTE: The calcaneus tendon is the attachment point of both the soleus and the gastrocnemius muscles.\nWhile holding the calcaneus tendon with a small pair of tweezers, use the dissection scissors to isolate the gastrocnemius and soleus muscles from the biceps femoris, located above.\nOnce isolated, cut the attachment point of the gastrocnemius and soleus muscles in the popliteal area.\nGently pull the soleus away from the gastrocnemius and detach them by cutting the calcaneus tendon.",
    "Place the rat in a supine position. Carefully remove the fascia and peel the tibialis anterior from the ankle in an upward movement.\nCut the tibialis anterior at its superior attachment point.\nRecord the exact wet mass of each excised muscle using a tared precision scale and a weighing boat.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}