{
  "id": 17513,
  "origin_website": "Jove",
  "title": "Sterile Pericarditis in Aachener Minipigs As a Model for Atrial Myopathy and Atrial Fibrillation",
  "procedures": [
    "This protocol has been approved by the University of Antwerp Ethical Committee for Animal Testing (case number 2019-29) and follows the animal care guidelines of the University of Antwerp. Seventeen 6-month-old Aachener minipigs (male, castrated) weighing ~20 kg were selected for this study.\n1. Medication and anesthesia\nPremedication\n\t\nEnsure that the pigs are fasted for 12 h, but with unlimited access to water.\nFor sedation, administer the following in one intramuscular injection: atropine 0.05 mg/kg, ketamine 10 mg/kg, midazolam 0.5 mg/kg.\nDetermine the exact weight of the pig after it has lost consciousness (approximately 10 min post dose). Transport the pig to the operating theater.\nPlace the pig on a heating pad.\nApply ECG monitoring, pulse oximeter, and perform an initial thermometry.\nInsert an over-the-needle catheter (22 G) into the marginal ear vein or the external saphenous vein.\nAnesthesia\n\t\nFor the induction of anesthesia, administer a bolus of propofol (1-4 mg/kg IV) before starting intubation. If superficial anesthesia is noted, administer an extra bolus of midazolam 0.2 mg/kg IV, and proceed to the intubation after ~5 min.\nIntubation\n\t\t\nPlace the pig in prone position.\nAsk an assistant to hold the mouth of the animal open using two slings of gauze and/or a mouth spreader. Spray 1 mL (10 mg) of lidocaine in the larynx with a 2 mL needleless syringe, wait for 30-60 s to desensitize the larynx, and then continue.\nPlace an endotracheal tube (ETT) with an internal diameter of 6.5 mm using a laryngoscope. Use a laryngoscope to visualize, displace the epiglottis from the soft palate, and place a stylet into the ETT for better manipulation.",
    "NOTE: The pig's mouth cannot be opened widely, and the distance from the nose tip to the larynx is long. Therefore, visualization of the rima glottis is limited. Hence, the ETT and the stylet help visualization.\nWhen connecting the ventilator, give supplementary medication if needed: midazolam 0.5 mg/kg IV and/or alfentanil 30 µg/kg IV.\nUse the following ventilator settings: volume control ventilation (VCV) with a pre-set tidal volume of 10 mL/kg, leading towards a peak inspiratory pressure (PIP) of 11-15 cmH20, a positive end-expiratory pressure PEEP of 2-5 cmH20; respiratory rate: 12-16 Brpm to maintain end-tidal CO2 (ETCO2) between 35-45 mmHg; FiO2: 50% (to be reduced when saturation is 100%); sevoflurane 2.5%.\nFor analgesia, use alfentanil 0.5-1 µg·(kg·min)-1 CRI.\nAdminister a bolus of 10 mL/kg of plasmalyte 3-5 mL·(kg·h)-1 over 10-20 min to correct hypotension due to hypovolemia.\nAdminister 1 g of cefazoline IV. For every 2 h of surgery, administer an extra 500 mg of cefazoline IV.\n\t\tNOTE: For an overview of the emergency medication to have at hand in the operating theater, see Table 1. Urinary bladder catheterization is difficult in male pigs and, in general, not necessary for this procedure.\nShave the thoracic and neck region of the animal.\nApply vet ointment to the eyes to prevent dryness and eye irritation during anesthesia.\nContinuously monitor the vital parameters. Check the depth of anesthesia at least every 10 min by assessing whether the jaw tonus is relaxed, the palpebral reflex is absent, the eyes are rotated, and there are no behavioral signs of excitation. Check the color of the mucosa and capillary refill time to evaluate tissue perfusion. Record all data, together with all administered medication, in an individual anesthetic chart.\nArterial line placement",
    "Prepare the pressure conducting system. Add 5000 IU of heparin to an IV bag of 500 mL of 0.9% NaCl.\nReturn the animal to supine position. Extend the leg and locate the femoral artery using ultrasound with the vascular probe in carotid setting. Disinfect the inguinal zone with chlorhexidine. Use umonium for sterilization of the ultrasound probe (or use a sterile transducer cover) and use sterile gloves to assure antiseptic technique.\nPuncture the femoral artery using ultrasound guidance. Insert a 3 Fr sheath using the Seldinger technique.\n\t\t\tNOTE: Because of the small diameter of the femoral artery, it can be helpful to let an assistant insert the guide wire through the needle. Just the action of lifting the ultrasound probe may dislocate the needle tip.\nFixate the sheath with a suture. Connect the sheath to the transducer and flush. Monitor the arterial blood pressure in real time.\n2. Surgery\nPreparation\n\t\nEnsure that the animal is supine in a stable position. For extra stability, place prewarmed IV bags in a paraspinal position to support the animal.\nPlace the earthing plate of the electrocautery underneath the animal. Use a small amount of ultrasound gel to ensure proper contact with the skin.\nSkin preparation: shave the animal in the following regions: neck, upper limbs, anterior thorax, upper part of the abdomen, inguinal and ECG electrode sites. Perform three alternating scrubs with alcohol 70% and iodine 2% to properly disinfect the skin.\nPlace sterile drapes. Wrap the claws of the animal in sterile sheets or gloves as well. Use sterile gauze to retract them.\nTo ensure sterile conditions, drape the surgical area with sterile surgical covers, use sterile instruments, and work under sterile conditions until skin closure.",
    "NOTE: Throughout the procedure, surgeons must wear a hair cap, a mouth mask, a surgical gown, and sterile gloves.\nSurgical placement of a permanent central venous catheter (CVC)\n\t\nMake a 5 cm incision in the groove at the medial border of the sternocleidomastoid muscle. Bluntly dissect until the internal jugular vein is reached.\nRemove fibrous tissue around the vein and place a squared suture (=  3 to 4 stitches forming a circle) with Prolene 6-0 around the desired catheterization site to gain vessel control.\nCannulate the internal jugular vein with a 3 French triple-lumen CVC using the Seldinger technique. Tighten the Prolene 6-0 suture around the catheter.\nFixate the handle of the catheter to the sternocleidomastoid muscle.\nTunnel the three catheter lumina separately: use a large pair of blunt dissecting scissors to create the tunnel and an atraumatic clamp pull the catheter lumina through the tunnel.  Attach the ends of the catheter firmly to the skin andput on the needle-free injection port. The exit sites of the catheter lumina are situated behind the ear and as far away as possible from the incision site to ensure a maximal trajectory length of the catheter under the skin.\nClose the incision site in two layers.\nSternotomy\n\t\nMake a median incision from the manubrium of the sternum to 3 cm below the xiphoid process until the sternum becomes apparent.\nBluntly dissect caudally from the xiphoid process. Put a finger on the visceral side of the sternum and remove connective tissue as far as possible following the visceral sternal surface.\n\t\tNOTE: The connective tissue is removed to prevent myocardial injury whilst performing sternotomy.\nUse the sternum saw to cleave the sternum. Control all bleeding sites. Use the sternum spreader to enlarge the access to the thoracic cavity. Avoid damaging the pleura.",
    "Open the pericardium carefully and use suspension sutures to keep it out of the surgical field.\nPacemaker lead placement (see Figure 1)\n\t\nPlace a pacemaker lead on the left atrium.\n\t\t\nTest the extension and retraction mechanism of the lead's fixation screw. Then, put the tip on a (curved) forceps and curve the stylet by 60° if necessary.\nPut a compress on the left ventricle and gently pull it aside to have a view of the left atrium.\n\t\t\tNOTE: Pressure on the ventricle will quickly cause hypotension. Make sure the anesthesiologist anticipates this with low-dose norepinephrine through the CVC. Release the ventricle when the mean blood pressure drops below 40 mmHg for >20 s. Only proceed when the blood pressure of the animal has normalized.\nUpon visualization of the left atrium, firmly put the lead tip on the left atrial free wall, as close as possible to the pulmonary veins and as far as possible from the ventricle. Screw it in by extending the helix into the atrial tissue, preferably with a slight inclination. Do this as fast as possible and release the pressure on the left ventricle immediately.\nMeasure the sensing and pacing threshold and impedance of the lead using a programmable electrical stimulator or pacemaker programmer. Ensure that there is no ventricular overcapture (broad QRS on ECG) when pacing at high voltages (10 V). If not satisfied, retract the helix of the lead and start over from step 2.4.1.1.\n\t\t\tNOTE: Normal pacing threshold should be <1 V with a pulse width of 0.5 ms (typically ~0.5 V @0.5 ms).\nPlace a pacemaker lead on the right atrium, completely analogous to the placement of the left atrial lead.",
    "Ensure that both leads leave the thorax at the midline; the left atrial lead must be tunneled through the abdominal subcutaneous fat from the xiphoid process to the left flank, the right atrial lead to the right flank.\nMake a pacemaker pocket in the subcutaneous fat at the left and right flank of the pig. Connect the pacemakers to the leads and place them inside the pockets. Connect a pacemaker capable of performing (50 Hz) burst pacing with the left atrial lead (to allow pacing) and a pacemaker from a different manufacturer (in order to avoid crosstalk while reading out both pacemakers simultaneously) to the right atrial lead (to allow sensing). Close in 2 layers with classic single sutures, the inner layer with Vicryl 1-0 and the outer layer with Mersilene 0.\nInduction of sterile pericarditis\n\t\nExpose the atria again by gently pulling aside the ventricles. Cover up the ventricles with gauze (and take the gauze away afterward).\nSpray sterile talcum over the epicardial surface of both atria using the dispenser that is included in the pack. As bradycardia and hypotension will follow this manipulation, give the heart enough time to recover spontaneously after approximately one minute; if necessary, start or increase (the infusion rate of) a norepinephrine drip.\nLeave one layer of sterile gauze (5 cm x 5 cm) on the epicardial surface of both atria: one piece left and one right.\nCheck the position of the pacemaker leads one last time before starting closure.\nClosing the chest\n\t\nLeave a drain in the mediastinum and tunnel it to the skin surface. Connect the drain to a sterile vacuum jar; open the connection when the first layer of the skin is closed (to avoid air leakage). Remove the drain when bringing the animal back to its stable.",
    "Close the pericardium with Prolene 6-0.\nClose the sternum using a classical cerclage technique with stainless steel wire.\nClose the subcutis in two layers with resorbable thread.\nPerform a sternal block by infiltrating 5 mL of 0.5% bupivacaine into the skin; ensure bone contact with the sternum to infiltrate the periosteum.\n\t\tNOTE: Alternatively, it might be even better to use pre-emptive analgesia by performing the sternal block BEFORE incision of the sternum.\nClose the skin with a continuous intradermal suture using resorbable thread.\n3. Postoperative care\nProgressively, turn off all sedatives while closing the skin of the animal.\nKeep the animal in the surgery room with close monitoring of body temperature, ventilation and airway patency, oxygenation, and hemodynamic parameters.\nDue to a substantial drop in body temperature that frequently occurs during the procedure, keep the animal warm using blankets, heating pad, and hot packs. Provide oxygen during recovery, especially when shivering is noted.\nApply a fentanyl patch of 50 µg/h for postoperative analgesia. Because there is a delay of 6-8 h before the fentanyl patch becomes effective, administer 0.05-0.1 mg/kg of morphine subcutaneously to bridge this period.\nWhen the animal is stable, is showing an increase in body temperature; can lift its head; is swallowing; shows normal ocular reflexes; and is breathing spontaneously, freely, and deeply without an ETT in place, without signs of upper airway obstruction; it can be transported back to the pen. Provide means of heating during the recovery phase (e.g., infrared lamp, heating mat, blankets).\n\tNOTE: Avoid putting the animal back in the pen too soon as respiratory arrest is possible, even hours after the cessation of narcotics.",
    "Perform a check-up on the animal: every 15 min during the first hour postoperatively, then hourly for the first 4–6 h or more frequently if the animal is not comfortable. When the animal shows signs of pain, administer supplementary morphine subcutaneously 0.025–0.05 mg/kg every 2 h until it is comfortable. Administer 1 g of cefazoline 8 and 16 h after surgery.\n\tNOTE: Pain assessment consists of subjective elements such as attitude, behavior (standing, eating, drinking), and grimace. Objective signs of pain are elevated heart rate, elevated respiratory rate, and superficial respiration. The animal will return to its normal status and behavior within 24 h. Remove the fentanyl patch on day 3 post operation.\n4. Atrial tachypacing for induction of AF\nInject ketamine 10 mg/kg and midazolam 0.5 mg/kg intramuscularly (without atropine) and wait until a sufficient level of sedation is reached.\nWeigh the pig again for follow-up. Place the animal in a restraining sling and bring it to the operating theater.\nAttach ECG and oxygen saturation monitoring and place the programmer heads over their corresponding pacemakers. Interrogate the pacemakers.\nCheck the pacemaker settings for the occurrence of spontaneous AF. Look for a ventricular lead warning when using a dual-chamber pacemaker.\nDetermine impedance and sensing and pacing thresholds. When performing electrophysiology (EP) studies, always pace at twice the threshold voltage and watch for an increase in voltage threshold during the experiment.\nDetermine the atrial effective refractory period (AERP) approximated by the shortest cycle length at which 1:1 capture is maintained during burst pacing.\n\tNOTE: This method is different from clinical AERP determination but more relevant to this protocol.\nDetermine the conduction time between left and right atrial leads by measuring the time between the initiation of the pacing spike and the atrial depolarization on the right atrial lead.",
    "For the first protocol, apply a burst pace for 20 s with a cycle length of AERP + 30 ms. After the cessation of the pacing, check for the presence of AF and measure how long the episode lasts. Pause for at least 5 s between each pacing session and wait until the sinus rhythm heart rate has recovered to baseline. Repeat this ≥10 times; note the display of the AF inducibility as a percentage-the proportion of \"successful\" attempts to the total amount of attempts to induce AF.\n\tNOTE: Only episodes > 5 s are considered relevant.\nFor the second protocol, apply a burst pace for 20 s, starting with a cycle length of AERP + 20 ms. During the following burst, decrease the cycle length until the minimal cycle length with 1:1 capture. Repeat this at least 10 times. Note the AF duration and AF inducibility.\nFor the third protocol, apply a burst pace for 5 s at 50 Hz. Repeat this at least 10 times. Note the AF duration and AF inducibility.\nLet the animal awaken or continue with other procedures (e.g., echocardiography, treatment, blood draw)\n5. Euthanasia\nAfter the experiment ─ which lasted one month ─ the animals are euthanized with an overdose of IV pentobarbital (50 mg/kg, IV). Humane endpoints for euthanasia were persisting signs of severe pain or discomfort, despite adequate treatment. This is assessed clinically on a daily basis: alarming signs include hypertension, tachycardia, increased respiratory rate, behavioral changes (restlessness, immobilization, vocalization) and jaw clenching.\n6. Sham surgery\nPerform the same protocol without spraying talcum over the atrial epicardium or leaving a layer of sterile gauze.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}