{
  "id": 18189,
  "origin_website": "Jove",
  "title": "Repeated Blood Collection from Tail Vein of Non-Anesthetized Rats with a Vacuum Blood Collection System",
  "procedures": [
    "All procedures were approved by the Tongji Medical College Council on the Animal Care Committee of Huazhong University of Science and Technology (Wuhan, China). The manuscript was prepared according to ARRIVE (Animal Research: Reporting of In Vivo Experiments) guidelines6.\n1. Husbandry\nUse Sprague-Dawley (SD) rats (n = 20, 10 males, 8 week-old, weighing 261 to 291 g, mean = 272.85 ±9.07 g) from the Experimental Animals Center of Huazhong University of Science and Technology and maintain rats in accordance with the Guide for the Care and Use of Laboratory Animals published by the US National Institute of Health (NIH Publication No.85-23, revised 1996)\nHouse under standard conditions with free access to food and drinking water. Keep rats in 530 cm2 cages with wood-shaving bedding. House two rats in each cage. Keep all cages open to the room environment (no micro-isolation or ventilated caging)\nEnsure the staff involved in the experimental protocol regularly handle the rats.\nMaintain room temperature between 21 °C and 23 °C. Give rates a normal salt diet (0.3% NaCl) throughout the study.\n2. Blood Collection Procedure\nNOTE: The vacuum blood collection system consists of a double-pointed needle [22 G (0.7 mm x 25 mm)], a plastic holder, and a series of vacuum tubes (2 mL) with rubber stoppers (Figure 1).\nPlace the rat in a plastic restraining holder and wash the tail with warm (20-30 °C) water to remove any visible dirt or feces. While an assistant holds the tail in an extended position, wipe the tail with 70% ethanol, and clean with gauze to make the vein clear.",
    "Insert the 22 G butterfly needle tip into one of the lateral tail veins (around 5 mm) at a position approximately 2-3 cm away from the tip of the tail at angle of approximately 20° (Figure 2). Collect blood into the vacuum collection tube by inserting the rubber end of the butterfly needle into the vacuum blood collection tube (Figure 3).\n\tNOTE: The maximal collection blood volume is 1.2 mL7.\nAfter blood collection, remove the needle and gently apply pressure to the puncture site with gauze for 15-30 s to stop the flow of blood. Then, release the rat from the plastic restraining holder and return the rat to its cage.\nUse tubes that contain EDTA as an anticoagulant to collect blood plasma. Gently invert the tube several times to mix anticoagulant in the blood and place the samples on ice vertically.\nCentrifuge the blood sample collection tubes in a refrigerated centrifuge at 2,000 x g for 10 min to separate plasma or serum.\nExtract the plasma/serum, taking care not to disturb the red and white blood cell layers. To collect blood serum, use tubes without anticoagulant. Both types of sample can be used immediately, or stored at -80 °C for up to one year.\n\tNOTE: Successful blood collection was defined as obtaining 1.2 mL blood each time. Maximal puncture time was set to three trials, if the total blood volume was lower than 1.2 mL after the third puncture, it was defined as a failed blood collection. The sampling duration starts from the tail vein puncture to the removal of the butterfly needle after blood collection.\nCollect blood twice within two weeks7.",
    "To test and verify the feasibility of this method, train two medical students (beginners) for 2 h before performing this blood collection protocol. Use twenty rats and draw blood from 10 rats by 2 experienced fellows (experimental group) and from 10 rats by the 2 medical students (beginner group).\n3. Statistical Analysis\nExpress data as a mean value ± standard deviation and analyze with SPSS Statistics 17. An α value of 0.05 was chosen, therefore p <0.05 was considered statistically significant."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}