{
  "id": 9480,
  "origin_website": "Jove",
  "title": "Structural Characterization of Mannan Cell Wall Polysaccharides in Plants Using PACE",
  "procedures": [
    "1. Harvesting of Plant Material\nHarvest fresh plant material (~20 mg) and immediately submerge it in 96% (v/v) ethanol and incubate at 70 °C for 30 min; this deactivates any cell wall degrading enzymes present. For dry material, start at step 2.\n\tCAUTION: Ethanol is flammable.\n\tNote: A single stem or rosette leaf will provide enough material for analysis. However, fewer errors arise if a larger amount of tissue is pooled and analyzed since this is easier to weigh out and handle.\nCarefully record tissue type and developmental stage, as polysaccharide structure varies with both. For example, with Arabidopsis thaliana (used here), stage the tissue according to the methods from Boyes et al.15\n\tNote: In this protocol, we have used the lower half of the inflorescence stem, where the first silique is fully elongated but not yellowing.\n2. Preparation of Alcohol Insoluble Residue (AIR)\nPrepare AIR, following the method of Mortimer et al.9 or another similar method, in order to produce a powder lacking soluble sugars, such as sucrose and starch.\n3. Aliquoting and Pre-treatment of AIR\nNote: The exact quantity of AIR needed for each sample will depend upon (a) the abundance of the polysaccharide of interest in the material and (b) the average size of oligosaccharides released by the GH. The method adds a single fluorescent molecule to the reducing end of each oligosaccharide, so the number of oligosaccharides determines the sensitivity of the experiment. As a guideline, for glucomannan in Arabidopsis stem digested with GH5/GH26 (as described), 500 µg is recommended11, whereas for xylan in Arabidopsis stem digested with GH11, 100 µg is recommended as in Mortimer's study3.",
    "Weigh AIR (10 - 15 mg) into a 15-mL centrifuge tube, and add H2O to a final concentration of 2 mg/mL. Vortex to achieve an even suspension. If this is problematic, then use a glass homogenizer to assist this process.\nAliquot 500 µg into microfuge tubes. Dry aliquots using a vacuum centrifuge (see the Table of Materials) overnight at 30 °C.\nPre-treat AIR with 1 M NaOH (20 µL) for 1 h at room temperature; this de-acetylates the polysaccharides and swells the cellulose microfibrils, disrupting the biomass structure and allowing GH access.\n\tNOTE: This step can be skipped for purified polysaccharides. CAUTION – strong acid/base.\n\t\nInclude an aliquot for a no-enzyme AIR control (treated the same as all samples, except step 4.1. is excluded).\nAdd 200 µL of H2O and 20 µL 1 M HCl to neutralize. Test that the pH is ~6-7 by removing 1 µL and spotting it onto paper pH indicator strips.\nAdd 50 µL 1 M ammonium acetate buffer, pH 6.0 (or whichever pH is appropriate for the GHs used in the study) and H2O to give a total volume of 500 µL.\n\tNote: Ammonium acetate is used since it sublimes upon drying, and so it does not add additional salt to the sample. An excess of salt can lead to poor band-shape and resolution on the PACE gel.\n4. Hydrolysis of AIR with Glycosyl Hydrolases (GHs)",
    "Note: As mentioned in the Discussion, the purity of the GHs is critical. Only use heterologously expressed, affinity purified enzymes. Upon receipt of each lot from the manufacturer, hydrolyze defined aliquots of substrate (e.g., 500 µg AIR) with increasing quantities of GH overnight (e.g., 0.5, 1, 2, 5, 10, 15, 20 µL) (3 units/µL). When there is an excess of GH, the PACE fingerprint will look identical. An excess of enzyme is required to deliver a reproducible result because it must be certain that the hydrolysis reaction is approaching the endpoint.\nAdd a pre-determined amount (see above) of mannanases (GH5 and GH2611) to the AIR aliquots in buffer from step 3.5, as well as a positive control (30 µg of konjac glucomannan), and a no-AIR negative control (enzyme mix in an empty tube). Vortex, and then spin briefly to collect the reaction mixture in the bottom of the tube.\nIncubate overnight at 37 °C (or the appropriate temperature for the GH of choice) with gentle agitation (~100 rpm).\nStop the reaction by incubating at 95 °C for 20 min.\n\tNote: Cap closures can be used to seal flip-top microfuge tubes.\n\t\nCentrifuge using a bench top microfuge at maximum speed for 10 min, and retain supernatant.\nResuspend pellet in 250 µL H2O, centrifuge as above, and retain supernatant.\nCombine both supernatants, and dry in a vacuum centrifuge (see the Table of Materials) at 30 °C (~3 h or overnight without heating).\n5. Preparation of Oligosaccharide Standards\nPrepare 1 mM stock solutions in H2O of mannose (Man), mannobiose (Man2), mannotriose (Man3), mannotetraose (Man4), mannopentaose (Man5) and mannohexaose (Man6), all β,1-4 linked. Aliquot and store at -20 °C until required.",
    "Prepare 3 different concentrations of a Man1-6 mixture by combining 1 µL (Standard S1), 2 µL (S2) or 5 µL (S3) of all six.\nDry in a vacuum centrifuge (see Table of Materials) at 30 °C (~1 h).\n6. Derivitization of Oligosaccharides\nPrepare a stock solution of 0.2 M ANTS (8-Aminonaphthalene-1,3,6-trisulfonic acid) in H2O:acetic acid 17:3. Warm stock to 60 °C to completely dissolve the solid. Store at -20 °C, protected from light, for 2 - 3 months.\nPrepare a 0.2 M stock solution of 2-picoline borane (2-PB) in DMSO. This is extremely hygroscopic, so immediately resuspend all powder upon receipt in DMSO. Aliquot, and store at -20 °C for 1 - 2 years. Thaw aliquots as required (store at 4 °C for 2 weeks, and then discard).\nPrepare the derivatization buffer of H2O:acetic acid:DMSO at 17:3:20.\nTo each sample, add 5 µL of ANTS, 5 µL of 2-PB and 10 µL of derivatization buffer. Spin briefly to collect in the bottom of the tube, vortex thoroughly, and then spin briefly again. See Figure 1 for reaction description.\nIncubate samples overnight at 37 °C, protected from light.\nDry in a vacuum centrifuge (see Table of Materials) at 30 °C (~2 h).\nResuspend samples and standard in 100 µL 3 M urea. Store at -20 °C, protected from the light until required.\n7. Preparation of PACE gels\nNote: Assembly of the gel casting equipment will depend on the brand. Here, we use a vertical electrophoresis system (see Table of Materials), equipped with 18 cm x 24 cm glass plates and 1.5 mm spacers.\nAssemble gel casting equipment per the manufacturer's instructions.",
    "Make 10x PACE buffer (1M Tris-Borate, pH 8.2) as follows: add 121.14 g of Tris-Base to ~400 mL of H2O, and mix to dissolve. Adjust the pH to 8.2 by addition of solid boric acid (approximately 60 g), and then make volume up to 1 L.\nMake a 10% (w/v) ammonium persulfate (APS) stock in H2O. Aliquot and store at -20 °C. Thaw aliquots once, store at 4 °C and discard after 2 weeks.\nMake and pour the resolving gel. For the above equipment, 1 gel equate to 50 mL. In a 50 mL centrifuge tube, mix H2O (20.2 mL), 5 mL 10x PACE buffer, 24.6 mL 40% acrylamide/Bis-acrylamide (29:1 acrylamide:Bis). (Caution: toxic).\nAdd 200 µL of APS and 20 µL of N,N,N,N´-tetramethyl-ethylenediamine (TEMED). Invert gently to mix (to avoid introducing air bubbles). Pour the gel using a serological or other large volume pipette, to ~4 cm below the top of the glass plates. Pay attention to the possibility of air bubbles getting trapped in the gel. If they do, stop pouring, and tilt/tap the gel to release them.\nOverlay the gel with isopropanol (Caution: flammable) or, carefully, with H2O. Allow gel to polymerize (20 - 30 mins), then pour off the top layer. If isopropanol was used, then wash 2x with H2O. Dry any excess liquid using blotting paper.\nMake and pour the stacking gel. Mix 6.8 mL H2O, 1 mL 10x PACE buffer, 2.8 mL acrylamide/Bis-acrylamide (Caution: toxic), 80 µL APS, and 8 µL of TEMED in a 15 mL centrifuge tube. Invert to mix, and overlay on top of polymerized resolving gel. Gently insert combs, avoiding trapping air bubbles under the comb teeth.",
    "Allow gel to polymerize (20-30 min), wrap in moist tissue and then in plastic wrap, and store at 4 °C until required. Store with the combs in place.\n\tNote: PACE gels can be stored for a maximum of 2 weeks (although less than 1 week is ideal), if they are kept moist.\n8. Running a PACE Gel\nUse a permanent marker to label the well positions on the glass, which will assist in keeping track of the loading order, and in identifying where the wells are once the comb is removed.\nRemove the comb. Fill the wells with 1x PACE buffer.\nUse a 10 µL microsyringe to load 2 µL of standards and samples into wells. Avoid using the outermost lanes, which tend to run samples poorly.\nAssemble the upper chamber of the gel-running apparatus, and place the gel in a cooled (~10 °C) running tank (10 °C) containing 1x PACE buffer. Fill the upper chamber with 1x PACE buffer.\nTurn on the power, and run the gel at 200 V (constant V) for 30 mins, and then increase voltage to 1000 V for 1 h 40 mins. Protect gels from light (e.g., by wrapping tanks in black garbage bags).",
    "Note: Check on the gels ~5 min after turning the voltage on, and then another 5 mins after increasing the voltage to 1,000 V. If the power pack is unable to maintain the voltage then there is likely a buffer leak. Remove the gel from the tank. Reassemble the upper chamber, carefully checking placement of all gaskets. A large chip on the upper edge of the glass plate may prevent the plate forming a good seal with the gasket. This can usually be temporarily resolved by adding a drop of 5 % (w/v) molten agarose to the chipped part of the glass, before adding the upper chamber.\n9. Visualizing a PACE gel\nNote: Use a gel imaging system equipped with long-wave UV bulbs in the transilluminator, and an emission filter for the camera which is suitable for the fluorophore, here 530 nm. Alternatively, a laser scanner may also be used, as described in Goubet2.\nEnsure the gel imaging system is dust free by wiping it with moist lint-free tissue.\nRemove the gel from the PACE tank, and view briefly whilst the gel is still in the glass plates (<80 ms) to determine if the dye front is still on the gel.\nOpen the gel using a wedge tool, and whilst gel is still on one glass plate, use a pizza cutter to remove both the stacking gel and, if the dye front is still on the gel, the bottom of the gel.\nPut ~5 mL H2O onto the surface of the transilluminator, and then transfer the gel directly onto the transilluminator. Set the filter to UV 605, and turn on the longwave UV transilluminator (see Table of Materials) using the software.\n\tNote: The ANTS fluorophore used here has an excitation/emission of 353/520 nm.",
    "Take several images at various exposure times (e.g., 100 ms to 10 s). Ensure that the UV light is turned off between images by clicking the UV light button (to turn it off) to avoid degrading the fluorescence. Ensure that at least 2 of the images have no saturated bands (the gel imaging software will indicate this).\nSave files as high-resolution.tif images.\n\tNote: Images can be analyzed using the software provided with the gel imaging system, or by using freely available image analysis software, such as ImageJ (https://imagej.nih.gov/ij/). See the Results section for a discussion of quantitation."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}