{
  "id": 5584,
  "origin_website": "Bio",
  "title": "Single Genome Sequencing of Expressed and Proviral HIV-1  Envelope Glycoprotein 120 (<em>gp120</em>) and <em>nef</em> Genes",
  "procedures": [
    "RNA and DNA extractionThoroughly clean work surfaces and equipment before and after use with ELIMINase Decontaminant. Note: RNA and DNA extractions, cDNA synthesis and first round PCR set-up should be performed using filtered pipette tips and must be conducted in a restricted-access amplicon-free room with separate air-handling and laboratory equipment where no amplified PCR products or recombinant cloned plasmids are allowed. If no such room is available, conduct steps before amplification in a cell biology-grade clean hood equipped with separate air-handling mechanisms. Total RNA and genomic DNA are isolated separately and simultaneously from each tissue section (30-50 ng) using the AllPrep DNA/RNA Mini Kit following manufacturer’s guidelines. Two final 50 μl elutions using RNase-free water are performed during the last step of RNA isolation, totaling a final volume of 100 μl. Tissues are homogenized just prior to extraction using a TissueRupter rotor-stator homogenizer with a fresh sterile disposable probe for each sample.The 100 μl final volume of RNA is concentrated using RNeasy MinElute Cleanup Kit according to manufacturer’s instructions. A single final elution of 20 μl RNase-free water is used.Quantification of the resulting RNA and DNA is performed to determine the success of the extraction protocol and the concentration, utilizing the Qubit 2.0 fluorometer and either the Qubit RNA HS Assay Kit or Qubit dsDNA HS Assay Kit where appropriate. Failure to detect DNA or RNA, or a yield of less than 1 ng/μl for either RNA or DNA, indicates a failed extraction and the extraction should be repeated until more than 1 ng/μl of RNA and DNA is detected.cDNA synthesiscDNA is created immediately from the RNA of each sample using the SuperScript® III First-Strand Synthesis System using the provided oligo(dT)20 primer according to manufacturer’s recommendations with slight modifications, detailed below, to increase product length.",
    "In two identical reactions for each sample, 8 μl RNA is incubated at 65 °C for 5 min with deoxynucleoside triphosphates (0.5 mM [each]) and 5 µM oligo (dT)20, then cooled quickly to 4 °C.Note: Use thermocycler for accurate temperatures and hold times. cDNA synthesis reactions are conducted in 0.2 ml PCR 8-tube FLEX-FREE strips.First-strand cDNA synthesis will continue in a 20 µl reaction volume containing 1x reverse transcription buffer (10 mM Tris-HCl [pH 8.4], 25 mM KCl), 5 mM MgCl2, 10 mM ditiothreitol, 2 U/µl of RNase-OUTTM (RNase inhibitor), and 10 U/µl SuperScript® III RT. The reaction is heated to 45 °C for 90 min, and then 85 °C for 5 min. The reaction is then cooled to 37 °C and 0.1 U/µl of E. coli RNase H is added, followed by a 20-min incubation. The two reactions for each sample are combined with gentle pipette mixing to avoid shearing the cDNA. cDNA is stored at -20 °C until needed.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170614/20170614020215_3917.jpgSingle genome sequencing of gp120 and nefcDNA and genomic DNA (gDNA) dilutions using EB buffer are usually performed to achieve 30% or less of positive nested PCR reactions, which indicates the positive reactions will have a greater than 80% chance of one starting template.Notes: For patients on cART, it is practical to start with 1:3 and 1:9 dilutions of cDNA and gDNA, with 24 PCR wells for each dilution. For patients not on cART, higher dilutions can be used.Stock and dilutions must be kept on ice after thawing and mixing, and frozen at -20 °C when not in use. Pipette mix or flick mix samples and dilutions, do not vortex to mix.Serial dilutions and first round PCR setup must be done in the amplicon-free room and always use filtered pipette tips.",
    "Two rounds of PCR are required to generate enough product for visualization, quantification and sequencing when starting with only a single template.During the first round PCR, 1 µl of diluted cDNA or genomic DNA is amplified in 20 µl reactions containing 1x Platinum® Blue PCR SuperMix and 0.05 µM of each primer: BEF1, 5’-TAATAGCAATAGTTGTGTGG-3’ and BNR1, 5’-AGCTCCCAGGCTCAGATCT-3’ (6,111-6,130 and 9,558-9,576 bp of HIV-1 HXB2 respectively). The first round primers are at 0.05 µM concentration in the reaction volume to eliminate unused excess first round primer carryover into the second round PCR. Excess first round primers in the second round PCR produces non-specific PCR products and reduces the amount of the desired product. See Figure 1 for an example of the non-specific PCR products generated by first round PCR primer carryover.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170612/20170612224739_9001.jpgFigure 1. Example of non-specific primer binding to genomic DNA. This gel provides an example of experiments where the concentration of the first round PCR primers was 0.2 µM in the first round PCR. First round primers at this concentration resulted in non-specific product formation in the second round PCR, as seen by the fainter bands found in most wells, whether or not those wells have a bright band that corresponds to the size of the positive control. When the first round PCR primers were used at 0.05 µM, these secondary products are no longer visible while the positive PCR products of the correct size are still visible, resulting in easier to interpret results and direct sequencing of the second round products without further gel purification to isolate a single band.",
    "First round PCR cycling parameters–an initial denaturation 94 °C for 3 min, then 40 cycles of 94 °C for 30 sec, 56 °C for 30 sec,72 °C for 4 min, followed by a final extension of 72 °C for 10 min.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170619/20170619185611_0382.jpgNotes: PCRs are conducted in a 96-well format using TempPlate semi-skirted polypropylene 0.2 ml 96-well PCR plates and Tape pads. Large batches of PCR plates containing premixed SuperMix and primers are created and frozen for future use to reduce inter-experiment variability.Positive PCR controls should be selected carefully and diluted enough to produce only a single band after nested PCR is complete–therefore a band will not be visible after the first round PCR. Very concentrated positive controls can easily contaminate the PCR plates and diluted to a workable level.Using automated pipettes reduces the possibility of error and cross-contamination. We use Matrix multichannel electronic pipette (Range: 1-30 µl; 12-channel) and Eppendorf Repeater stream electronic pipette.The amount of primer in first round PCR is reduced significantly to reduce non-specific binding and primer carry-over during second round PCR. Extension times and cycle number are increased to generate an increased number of complete products.Second round gp120 PCR consists of 2 µl of the first round PCR product added to a 20 µl second round reaction consisting of 1x Platinum® Blue PCR SuperMix and 0.2 µM of each primer: BEF2, 5’-CAATAGTTGTGTGGTCCATAG-3’ and BER2, 5’-CAACAGATGCTGTTGCGC-3’ (6,117-6,137 bp and 7,905-7,922 bp of HIV-1 HXB2 respectively)Second round gp120 PCR cycling parameters–an initial denaturation 94 °C for 3 min, then 40 cycles of 94 °C for 30 sec, 56 °C for 30 sec, 72 °C for 3 min, followed by a final extension of 72 °C for 10 min.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170614/20170614020727_1851.",
    "jpgSecond round gp120 PCR products are visualized on 1% agarose gels stained with ethidium bromide run at 150 V for 30 min in 1x TAE buffer. Notes:  This second round PCR generates a 1.8 Kb product when positive, containing a complete gp120 sequence. Products from positive wells are sent sequencing with BEF2 and BER2 primers. This protocol produces single specific PCR products that can be directly sequenced, and do not require PCR purification. See Figure 2 for an example of successful gp120 second round PCR with two different patient samples and a dilution series for DNA from another tissue.We use Platinum® Blue PCR SuperMix to direct load second round products on agarose gels rather than mixing loading dye in each reaction. We use Matrix multichannel electronic pipette (Range: 2-125 µl; 12-channel) to automated loading on a Sub-CellTM Model 192 electrophoresis system. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170612/20170612224437_4873.jpgFigure 2. Example of Second Round gp120 PCR plate agarose gel image. The two samples used on the top row of the gel are undiluted genomic DNA from spleen tissue of two patients. Both samples have a total number of positive wells that equals less than 30%, indicating that the positive wells are most likely the result of nested PCR amplification of gp120 from a single integrated proviral genome in the DNA present in that well. The bottom row (HC09SPd1 DIL_1) provides an example of serial dilution testing to assess the correct SGS dilution. Four dilutions are tested here, and while all four dilutions are high enough to generate the amplification of a single integrated provirus in a positive well, all four are too high of a dilution to get many positive reactions resulting in wasted reagents.",
    "The ideal situation would be to find a dilution where 20-30% of the wells are positive, so lower dilutions must be tested to find an optimal dilution. The negative control, while not labeled on the gel, is in well A1, and the positive control (labeled POS) is in well H12. The negative control has 1 µl of the water used for dilution of the DNA, and the positive control is diluted genomic DNA from a patient who was not on cART that was PCR positive in previous experiments. Subsequently, the first round reactions that corresponded to positive second round gp120 PCRs were used to amplify the nef gene sequence; second round nef PCR consisted of 2 μl of the first round PCR added to a 20 μl second round reaction consisting of 1x Platinum® Blue PCR SuperMix and 0.2 µM of each primer: BNF1, 5’-CTGGCTGTGGAAAGATACCT-3’ and BNR2, 5’-ATCTGAGGGCTCGCCACT-3’ (7,965-7,984 bp and 9,488-9,505 of HIV-1 HXB2 respectively).Nef cycling parameters–an initial denaturation 94 °C for 3 min, followed by 40 cycles of 94 °C for 30 sec, 58 °C for 30 sec, 72 °C for 2 min, followed by a final extension at 72 °C for 10 min.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170619/20170619185639_5370.jpgSecond round nef PCR products were visualized on 1% agarose gels stained with ethidium bromide run at 150 V for 30 min in 1x TAE buffer. Note: Reactions containing single 1.5 Kb products were considered positive and selected for sequencing with BNF1 and BNR2. This protocol produces single specific PCR products that can be directly sequenced, and do not require PCR purification."
  ],
  "subjectAreas": [
    "Microbiology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}