{
  "id": 1661,
  "origin_website": "Cell",
  "title": "Dissociation of human oral mucosal tissue for single-cell applications",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nSample collection\nTiming: 30 min\nOral mucosal biopsies (buccal mucosa 3–4 mm punch and/or gingival collar single sample ) are obtained by qualified clinicians under local anesthesia. Collected tissue samples are placed in a 2 mL Sarstedt tube containing 1 mL of RPMI 1640 (no FBS) on wet ice and transferred quickly (within 15–30 min) to the laboratory for processing.\nInitial tissue preparation\nTiming: 5 min\nThe purpose of this step is to mince the tissue into smaller pieces that can be further digested enzymatically. Tissue is transported to the lab on ice, but dissection and subsequent steps are performed at room temperature (20°C–24°C) unless otherwise stated.\nRinse tissue with PBS to remove remaining blood.\nPlace tissue in bottom of petri dish, put 1–2 mL of PBS on top of it.\nWith forceps, gently agitate tissue in PBS.\nTransfer the tissue with forceps to top of petri dish and add 200ul tissue culture media to prevent tissues from drying out.\nMince tissue in petri dish with tissue culture media by using forceps to hold the tissue and scissors to cut. Keep cutting until tissue is minced into pieces <1 mm in all dimensions. (Figures 1[href=https://www.wicell.org#fig1]A and 1B)\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1123-Fig1.jpg\nFigure 1. Gingiva dissections\n(A) Gingiva in petri dish containing tissue culture media (scale bar 1 cm).\n(B) Minced tissue prior to gentleMACS\nTransfer minced tissue to a gentleMACS C tube containing 10 mL of tissue culture media.\nMinced pieces can be transferred using a 1000ul pipette tip that has the narrow end cut off. (Figure 2[href=https://www.wicell.org#fig2])\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1123-Fig2.jpg\nFigure 2. Aspirate minced tissue using a 1000ul tip with the narrow end cut off\nRemove all visible tissue, then rinse petri dish with 1 mL tissue culture media. Collect media and transfer to C tube.",
    "Mechanical and enzymatic tissue dissociation\nTiming: 60 min for steps 4–13\nAttach C tube containing tissue upside down to gentleMACS dissociator, then run program m_lung_01.01 (8 s at 168 rounds per run no heat). (Figure 3[href=https://www.wicell.org#fig3])\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1123-Fig3.jpg\nFigure 3. Image of gentleMACS with C tube attached\nCritical: During the dissociation process, some tissue may get stuck to the plastic blades in the C tube. If this occurs, use forceps to transfer the tissue to the liquid prior to centrifugation.\nNote: All centrifugation steps are carried out at room temperature.\nCentrifuge C tube at 300 × g for 5 min.\nDispose of the supernatant into a 10% bleach solution and add 10 mL of digestion buffer to C tube containing tissue.\nPlace tube in Innova 44 incubator shaker (or equivalent) at 37°C 220 RPM for 45 min.\nAttach C tube upside down to gentleMACS dissociator and run program m_lung_02.01 (38 s 2083 rounds per run no heat).\nCentrifuge C tube at 300 × g for 5 min.\nResuspend sample in 0.5 mL tissue culture media by pipetting and decant contents through a 70 μm cell strainer fitted onto a 50cc tube. Use the rubber end of a 3 mL syringe plunger to press any remaining tissue through the filter. (Figures 4[href=https://www.wicell.org#fig4]A and 4B)\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1123-Fig4.jpg\nFigure 4. Application of minced tissue to cell strainer\n(A) Decant contents into a 70 μm cell strainer.\n(B) Press any remaining tissue pieces through cell strainer with rubber end of a syringe.\nRinse C tube with remaining tissue culture media and pour through filter.\nCentrifuge 300 × g for 5 min.\nDispose of supernatant into a 10% bleach solution.",
    "Optional: Timing 10-30 min.Perform red blood cell lysis if necessary for downstream application. Lyse red blood cells by resuspending cells in 5 mL of hypotonic lysis solution and rick the tube back and forth for 60 s. Add 5 mL of re-equilibration buffer, then top off tube with PBS. Centrifuge 5 min at 300 x g. Repeat lysis steps if RBC are still present.\nResuspend sample in 100 μL of 0.01% BSA in PBS or other resuspension solution according to the single-cell technology protocol and transfer to a 1.5 mL microcentrifuge tube for single-cell library preparation. Resuspend in 100 μL PBS for flow cytometry, or other buffer depending on downstream application. Keep sample on wet ice and proceed as quickly as possible with subsequent processing as cells will begin to attach to each other. For scRNA-seq, filter the sample immediately before loading the cells into the instrument for the single cell protocol.\nCell counting and viability\nTiming: 5 min\nOn a small piece of parafilm, mix 10 μL of cell suspension and 10 μL of AOPI.\nLoad 20 μL onto slide and count using Auto 2000. Adjust volume to obtain the required cell recovery target."
  ],
  "subjectAreas": [
    "Immunology",
    "Health Sciences",
    "Cell Isolation",
    "Cell Biology",
    "Single Cell"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}