{
  "id": 13081,
  "origin_website": "Jove",
  "title": "Generation of Human Patient iPSC-derived Retinal Organoids to Model Retinitis Pigmentosa",
  "procedures": [
    "The protocol follows the guidelines of Capital Medical University's human research ethics committee.\n1. Cell culture and generation of iPSCs\nChoose RPGR patients for this study. Here, three patients, one familial carrier and three healthy controls, were used. Patient 1 possessed a mutation c.1685_1686delAT in exon 14 of the RPGR gene, patient 2 harbored a mutation c.2234_2235delGA in exon 15 of the RPGR gene, and patient 3 had a mutation c.2403_2404delAG in exon 15 of the RPGR gene. Choose three healthy volunteers as controls14. Collect peripheral whole blood samples from the patients and healthy controls with venipuncture, and put them in blood collection tubes (Table of Materials).\nIsolate peripheral blood mononuclear cells (PBMCs) by density gradient centrifugation with a density gradient medium25. Expand CD34+ PBMCs activated with cytokine in 8 mL of growth enhancement medium (Table 1) in a Petri dish.\nAfter 1 week, electroporate the CD34-positive peripheral blood mononuclear cells with a transfection system (Table of Materials) and choose CD34-positive cells and the inbuilt T-01 Program without any modification. Transfect a cocktail of reprogramming plasmids (2 µg) that could produce human OCT4, SOX2, NANOG, LIN28, c-MYC, and KLF4 proteins.\nSeed the transfected cells in vitronectin human recombinant protein-coated six-well plates in 2 mL of DMEM/ F12 supplemented with B-27 (1x), N-2 (1x), PD0325901 (0.5 µM), bFGF (100 ng/mL), CHIR99021 (3 µM), HA-100 (10 µM) , A-83-01 (0.5 µM), and hLIF (1000 U/mL) to maintain the growth of the iPSCs.\n3 weeks after transduction, pick the colonies of iPSCs manually, subsequently transfer them into six-well plates, and maintain them in reagent B (Table of Materials) for expansion.",
    "NOTE: The six-well plates should be coated with vitronectin human recombinant protein. Dilute vitronectin solution in DPBS to reach a final concentration of 10 µg/mL. Add the diluted vitronectin to tissue culture-treated six-well plates. Swirl the cultureware to spread the vitronectin solution evenly across the surface of the six-well plates. Incubate the plates at 37 °C for at least 1 h.\nEnsure that cells are disaggregated with 0.5 mM EDTA when the iPSCs reach around 80%-90% confluence and that the splitting ratio is 1:8 or 1:10. On the day of passage, add blebbistatin (2.5 µM) to reagent B (Table 1).\n\tNOTE: Blebbistatin was used to promote cell adhesion and stem cell viability and prevent stem cell apoptosis. 18 h later, the medium should be refreshed with reagent B.\n2. Generation of human ROs\nNOTE: The iPSCs must be dissociated when the iPSCs reach around 80%-90% confluence.\nDissociate the human iPSC (hiPSC) colonies using 0.5 mM EDTA at 37 ◦C for 5 min.\nSegregate the hiPSC clumps into single cells by gentle pipetting. Count the cells for maintenance and grow them in reagent B (Table 1).\nOn day 0, seed 12,000 cells/well in 96 V-bottomed conical wells for cell reaggregation in 100 µL of differentiation medium (Table 1).\nOn day 6, carefully aspirate the cell culture medium and add 100 µL of the differentiation medium containing 20 μM Y 27632 and 1.5 nM (55 ng/mL) hBMP4.\nOn day 9, replace half of the differentiation medium to maintain the hBMP4 concentration at around 0.75 nM.\nAspire 60 µL of the differentiation medium from each well and add 60 µL of the fresh differentiation medium containing 20 μM Y-27632 to each well.\nOn day 12, replace half of the differentiation medium with fresh differentiation medium to achieve 0.375 nM hBMP4.",
    "On day 18, transfer the aggregates into a new Petri dish with 10 mL tips and cut each aggregate into 2-4 pieces with a microsurgical knife under an inverted microscope to generate more organoids.\nTransfer the aggregates from the same group into one 15 mL centrifuge tube. When the aggregates settle down to the bottom of the tubes, aspirate the supernatant.\nResuspend the aggregates with 1 mL of neural retina medium (DMEM/F12, 10% fetal bovine serum, 1% N-2 supplement, 0.5 µM retinoic acid, 0.1 mM taurine, 1% penicillin-streptomycin), and transfer them into non-stick Petri dishes with 15 mL of neural retina medium in it. Put 10-15 retinal organoids in one Petri dish.\nRefresh the culture medium every 5 days. Keep the culture in the dark since retinoic acid is sensitive to light (Figure 1) and check the formation of the self-organizing human retinal tissue with an inverted microscope26,27,28,29.\n3. Analysis of retinal organoids\nImmunofluorescence staining of hiPSC-derived 3D retinae\n\t\nFix the 3D retinae in 1 mL of fresh 4% paraformaldehyde in DPBS for 20 min at 4 °C. Then, rinse the organoids with 1 mL of DPBS buffer.\nMeasure 0.5 g of agarose (Table of Materials), and mix the agarose powder with 100 mL of DPBS in a microwavable flask. Use a microwave to dissolve the agarose for 1-3 min until it is completely dissolved. Let the agarose solution cool down to about 40 °C.\nEmbed them in 2% in DPBS.\nSlice the samples into sections with a thickness of 50 µm using a vibratome. Place the sliced sections on adhesion microscope slides (Table of Materials) and store them at −80 °C.\nThaw the slices for 15 min at room temperature (RT).\nWash the slices with DPBS for 5 min, and repeat 3x.",
    "Use 0.5% Triton X-100 in DPBS solution to permeabilize the slices for 15 min at RT.\nRemove the permeabilization solution, wash the slices with DPBS for 5 min, and repeat 3x.\nIncubate the slices with 1% BSA and 0.5% Triton X-100 in DPBS for 30 min at RT.\nIncubate the slices with anti-Rhodopsin antibody (1:1000) and anti-L/M opsin antibody (1:1000) diluted in 1% BSA and 0.1% Triton X-100 for 16 h at 4 °C.\nWash the slices with DPBS for 5 min, and repeat 3x.\nIncubate the slices with donkey anti-mouse and rabbit secondary antibody (1:500) diluted in 1% BSA and 0.1% Triton X-100 for 1 h at RT.\nAdd 30 nM 4',6-diamidino-2-phenylindole (DAPI) in DPBS for 15 min at RT for nuclear staining.\nWash the slices with DPBS for 5 min, and repeat 5x.\nMount the slices with embedding medium (Table of Materials) and cover the slides (Table of Materials). Keep in a dark box and store at 4 °C for up to 4 weeks.\nRNA extraction and RNA sequencing\n\t\nCollect 1-3 (according to sizes) 3D retinae derived from each control and patient at the same differentiation time points (day 0, day 47, day 91, day 121, and day 151) in 1 mL of RNA extraction reagent (Table of Materials) on ice.\nUse the homogenizer (Table of Materials) to disrupt the samples, 1 min ON, 30 s OFF, for three cycles, and check the sample for disruption.\nStop the homogenization when the samples are totally homogenized, and vortex the tube vigorously for 30 s.\nIncubate the samples on ice for 15 min.\nCentrifuge the samples at 13,800 x g for 15 min at 4 °C and transfer the supernatant to a new 2 mL RNase-free tube.",
    "Add 0.4 mL of chloroform to the tube, vortex, and centrifuge at 13,800 x g for 10 min at 4 °C.\nTransfer a portion (about 2/3) of the colorless upper phase to a new RNase-free tube carefully. Do not aspirate or disturb the white interface containing DNA.\nAdd 0.5 mL of cold isopropanol, vortex for 30 s, and centrifuge at 13,800 x g for 15 min at 4 °C. A pellet forms on the side of the tube bottom.\nCarefully aspirate the supernatant with a pipette tip and keep the pellet.\n\t\tNOTE: The RNA pellet is jelly-like and transparent when the purity is very high.\nAdd 1 mL of cold 70% ethanol, vortex the samples vigorously for 30 s, and centrifuge at 13,800 x g for 10 min at 4 °C.\nCarefully aspirate the supernatant with a pipette tip and air-dry the pellet in the hood at RT for 5-10 min. Do not overdry the pellet.\nAdd 20-50 µL of RNase-free water and resuspend the pellet carefully by pipetting up and down.\nApply 1 µL of RNA on a spectrophotometer (Table of Materials). A total of around 10 µg of RNA from controls and patients respectively were used for Illumina library preparation30.\nStore the RNA at −80 °C.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}