{
  "id": 8964,
  "origin_website": "Jove",
  "title": "Electrophysiological Method for Whole-cell Voltage Clamp Recordings from Drosophila Photoreceptors",
  "procedures": [
    "1. Reagent Preparation\nNOTE: Prepare all solutions according to the instructions in Tables 1-4.\nFill a 10 mL syringe with Extracellular Solution (ES or ES-0Ca2+; as required; see Table 1) and keep it on ice.\nPrepare one vial of Trituration Solution (TS; see Table 2; i.e. ES or ES-0Ca2+ + FBS and sucrose) and keep this on ice .\nPrepare sufficient ES for the experiment and keep this on ice until needed.\n\tNOTE: Continuous bath perfusion is not required, so the volume of ES need not be more than a few dozen mL.\nUsing a 22 µm PVDF filter, load the intracellular solution (see Table 3 or Table 4) into a 1 mL syringe with an electrode filling elongated tip. Keep this on ice.\n2. General Setup of Dissecting Tools\nimgsrc://cloudfront.jove.com/files/ftp_upload/55627/55627fig1.jpg",
    "Figure 1: Tools and Devices Needed for Making the Isolated Ommatidia Preparation. The pictures show the various devices required for creating the isolated ommatidia preparation, as described in the detailed protocol above. Two beakers, one filled with water (A) and the other filled with ethanol (B) for cleaning the trituration pipettes (D), which are connected to tubing (C). The dissecting tools are: 2 pairs of fine and 1 pair of coarse tweezers (F) and a retina scooper (E). In order to prepare the retina scooper, a micro dissection needle (H) is pressed between two lathe tools acting as a vice (G) to flatten the top of the needle (I). Then it is connected to an elongated piece of metal using glue (J) and mounted onto a needle holder (E). Razor blade chip and holder: Break off and mount a small triangular chip of a razor blade using a razor blade holder (K). The dissection working area is composed of a binocular (L) and a cool red light source ((M),) with two light guides (N). The dissection tools, including tweezers (F), the retina scooper (E), beakers (A and B), a flashlight with a red filter (Q), and delicate wipers (R) are placed on both sides of the binocular. An ice bucket with the ES, the FBS-ES, the intracellular solution syringes, the 60 mm Petri dish (S), and the electrode holder (P) are also placed on the table. The recording electrodes are pulled using a horizontal puller (T). Please click here to view a larger version of this figure.[href=http://cloudfront.jove.com/files/ftp_upload/55627/55627fig1large.jpg]\nConstruct a retina scooper to isolate the retinae.\nInsert the point (1-4 mm) of a micro dissection needle (entomological needle, 12 mm length, 0.1 mm diameter) between the two vise jaws and flatten it by tapping with a small hammer.",
    "Mount the flattened needle on a micro dissecting needle holder (see the Table of Materials).\nUsing a pair of tweezers, curve the flattened end of the needle to form a hook with a curvature of ~2.5 mm.\nCreate trituration pipettes for ommatidia separation.\nPlace a 1.2 x 0.68 mm (O.D. x I.D.) glass capillary over an open flame and fire polish it to reduce its opening.\nMeasure the size of the capillary opening under a microscope. Sort the created ommatidial trituration pipettes into seven groups according to the size of their openings (i.e 0.2-0.5 mm). Store them in separate suitable containers (e.g. test tubes).\nFill one small beaker with double-distilled water (DDW) and another small beaker with ethanol 70%. Cover each beaker with a paraffin film sheet.\nPunch one small hole in the paraffin film sheet covering the DDW beaker (see Figure 1A).\nPunch seven small holes in the paraffin film sheet covering the ethanol beaker and number the holes from 0 to 6 (see Figure 1B).\nPlace one ommatidial trituration pipette from each size group in every paraffin film hole, such that the pipette with the largest opening is located in the 0th hole and the pipette with the smallest opening is located in the 6th hole.\nConnect a plastic 200 µL pipette tip to a 35 cm long, 1.57 x 1.14-mm (O.D. x I.D.) piece of polyethylene tubing. Connect the other end of the tubing to one of the ommatidial trituration pipettes with the largest opening (i.e. 0.46 - 0.5 mm), ensuring that the pointed end of the trituration pipette is not facing into the tubing.\nPrepare whole-cell recording pipettes by pulling patch clamp pipettes from a 1 x 0.58 mm (O.D. x I.D.) borosilicate filament containing glass capillaries.",
    "NOTE: The resistance of the pipettes should be 8-15 MΩ when using potassium gluconate-based intracellular solution (IS1). Any suitable patch pipette puller can be used (for examples, see the Table of Materials). Fire-polishing is not necessary.\nPrepare a recording chamber (see Figure 2) by fixing a coverslip (see the Table of Materials) to the bottom of the bath chamber using melted paraffin or high-vacuum silicone grease. Use any suitable homemade or commercial chamber that allows electrode access and perfusion.\nMount the bath on the stage of an inverted microscope. Place the perfusion system tube, suction system, and ground (i.e. Ag-AgCl wire/pellet) in the bath (see the Table of Materials and Figure 2).\nPlace two pairs of fine #5 tweezers (Figure 1) on the working surface for use during the retina dissection and ommatidia isolation steps.\n3. D. melanogaster Rearing\nRaise D. Melanogaster flies at a low population density (i.e. ~20 flies in a 6 oz. bottle) in bottles containing standard cornmeal food at 19-24 °C.\n\tNOTE: It is preferable to work on dark-adapted flies. To maintain high sensitivity to light, reduce the diversity and prevent retinal degeneration in mutant flies.\nRear the flies in the dark for at least 24 h prior to the experiment.\n\tNOTE: The flies used for the experiments should be recently eclosed (<2 h) and still soft, pale, and display the meconium. Ommatidia can also readily be prepared from pupae, though their sensitivity to light is then steeply dependent on age10.\n4. Retina Dissection and Ommatidia Isolation: Option 1\nNOTE: Perform all of the following steps under the stereoscopic zoom microscope using an amplification suitable for properly viewing the preparation (See Figure 1).\nPlace four drops of ES-0Ca2+ and one drop of TS solution on a 60-mm Petri dish that has been turned over.",
    "Using rough tweezers, catch a newly eclosed (<2 h after eclosion) fly by its wings or body. From this point on, perform all procedures rapidly and under dim red illumination at 20 ±1 °C.\nWhile still grasping the fly with the rough tweezers, use the first pair of fine tweezers to detach the fly head from the body. Submerge the head in the first ES-0Ca2+ drop.\nDissect the head in half along the sagittal plane using the second pair of fine tweezers. Ensure that, at the end of this step, both eyes are still intact.\nTransfer one half of the head to the second ES-0Ca2+ drop and the other half to the third ES-0Ca2+ drop.\nUsing the fine tweezers, remove as much of the tissue surrounding the eye as possible and ensure that no harm is caused to the retina.\nFirmly grasp the edge of one cornea with the fine tweezers and scoop out the retina using the scooper.\n\tNOTE: Upon completion of this step, the cornea will be left empty and intact, separated from an intact retina.\nRinse the trituration pipette connected to the tubing with DDW and fill the pipette with a small amount of ES-0Ca2+ from the fourth drop.\n\tNOTE: This step must be performed every time a new ommatidia-separating pipette is used and removed from the ethanol beaker (the solution filling the pipette should match the solution in which the retina is submerged).\nGently aspirate by mouth to draw the isolated retina into the pipette. Use extreme caution not to aspire air bubbles into the pipette.\nTransfer the isolated retina to the drop of TS. Perform steps 4.6-4.10 on the second eye as well.",
    "Wipe away the drops of ES-0Ca2+ using delicate wipes, leaving only the drop of TS containing both retinae on the Petri dish. Add six more drops of TS to the top of the Petri dish. Transfer both retinas to one of the other TS drops.\nReplace the trituration pipette with a pipette of a smaller-diameter opening. Rinse it as described in step 4.8, using TS as the solution to fill the pipette.\nRapidly and repeatedly aspirate and expirate both retinae in the solution to begin the separation of isolated ommatidia stripped of pigment cells from the whole retina.\n\tNOTE: The isolated ommatidia are visible in the TS drop, and as the isolation process progresses, the TS drop becomes less translucent.\nTransfer the remaining retinae to the next TS drop. Fill the pipette with the entire former TS drop (containing the isolated ommatidia) and expirate the drop into the bath chamber.\nRepeat steps 4.12-4.14 to achieve maximal isolated ommatidia. Wait approximately 1 min to allow the isolated ommatidia to sink and bind to the bottom of the bath chamber.\nUsing the perfusion system, start the flow of ES-0Ca2+ with 1.5 mM Ca2+ into the bath chamber. Ensure that the chamber is completely filled with the solution, from bottom to top, and that the ground is completely submerged in the solution. Continue to wash the bath 4-5x.\n5. Retina Dissection and Ommatidia Isolation: Option 2\nNote: Perform all of the following steps under the stereoscopic zoom microscope, using an amplification suitable for properly viewing the preparation (See Figure 1).\nPrepare a razor blade chip and holder. Break off and mount a small triangular chip of a razor blade using a razor blade holder (Figure 1).\nPrepare a silicone dissection dish/block according to the manufacturer's instructions (see the Table of Materials).",
    "For the dissection, create a large drop (<0.5 mL) of ES solution on the silicone dissection block. Add two \"reservoir\" drops (~50 µL each) of TS solution to a 60 mm Petri dish\nImmobilize a newly eclosed (<2 h post-eclosion) fly in a glass tube on ice and pick it up by its wings using tweezers. From this point on, perform all procedures rapidly and under dim red illumination at 20 ±1 °C.\nHolding the fly with tweezers, cut off the fly's head using a razor blade chip mounted in a holder. Pick up an insect pin (12 mm long, 0.1 mm in diameter) with the tweezers and pierce the head between the eyes.\nBriefly submerge the head in 70% ethanol; this prevents air bubbles from forming on the head/eye surface. Pin the head under the ES drop on the silicone dissection dish.\nCut off both eyes using the razor blade chip by using a sawing motion along the line of the frontal margin of the eye.\nFirmly grasp the edge of one cornea with the fine tweezers.\nScoop out the retina using the scooper.\n\tNOTE: Upon completion of this step, the cornea will be left empty and intact, separated from an intact retina.\nWithout damaging the retina, use the tweezers and scooper to gently remove adhering air sacs and excess brain tissue.\n\tNOTE: The preparation of isolated retinae is also useful for Western blot analyses of non-specific retinae proteins11, whole-mount histology, and whole-retina imaging. Patch clamp recordings can also be conducted on photoreceptors from the whole retina12.",
    "Take the trituration pipette with the largest diameter, connect it to the tubing, and backfill the pipette with a small amount of TS from one of the reservoir drops in the Petri dish by gentle suction (i.e. by mouth). Perform this step every time a new ommatidia trituration pipette is used.\nGently blow the TS over the two retinae by mouth and then draw the isolated retinae into the pipette using gentle suction. Use caution to ensure that no air bubbles enter the pipette.\nTransfer the isolated retinae to the Petri dish, forming a small drop (~20 µL), and wash them once or twice with TS from one of the reservoir drops.\nIncubate the retinae in the dark for 20-25 min.\nReplace the ommatidia trituration pipette with a pipette with a smaller-diameter opening (using fresh TS from one of the reservoir drops as in step 4.6 to backfill the pipette).\nRapidly aspirate and expirate both retinae in a small drop (~20 µL) to begin the separation of the isolated ommatidia.\n\tNOTE: At the first stage, the surrounding pigmented glia should disintegrate, leaving visible small debris in the solution.\nAfter substantial small debris has accumulated, but before many ommatidia have separated, use fresh TS from one of the reservoir drops and transfer the retinae to a new small drop.\nSelect a smaller-diameter trituration pipette, backfill, and continue to triturate.\n\tNOTE: As ommatidia now begin to separate, their elongated forms should be clearly visible under the high power of the stereomicroscope. If necessary, keep changing the trituration pipettes to smaller diameters until a good yield of ommatidia is visible",
    "Once a reasonable yield of ommatidia are visible and the drop is no longer translucent, fill the pipette with the entire drop containing the isolated ommatidia and expirate the drop gently into the bottom of the bath chamber pre-filled with ES.\nWait approximately 1 min to allow the isolated ommatidia to sink and settle on the bottom of the bath chamber.\nUsing the perfusion system, start the flow of ES into the bath chamber. Ensure that the chamber is completely full of the solution, from bottom to top, and that the ground is totally submerged in the solution. Continue to wash the bath 4-5x.\n\tNOTE: Thereafter, continuous perfusion is not required, though the bath should be briefly flushed before introducing a new patch pipette.\n6. Whole-Cell Recording\nimgsrc://cloudfront.jove.com/files/ftp_upload/55627/55627fig2.jpg",
    "Figure 2: Overview of the Electrophysiological and Optical Setup. The setup contains an iron, black-painted Faraday cage (F). The front side is covered using a black curtain with copper mesh inside. This configuration enables the preparation to be completely sealed off from any stray light and is suitable for recording dark spontaneous bumps. The inverted fluorescence microscope (A) is fixed to an anti-vibration table (E). The photoreceptor recording apparatus consists of a homemade acrylic glass bath chamber (O) with a perfusion input (Q), a suction pipette (S), and a silver-silver chloride ground (P). The bath chamber is mounted on the microscope stage (T) with a homemade adaptor. The recording pipette is connected via silver-silver chloride wire to an acrylic glass holder, which is connected to the amplifier head stage (C). The head stage is then mounted on a coarse micromanipulator that is mounted on a fine XYZ mechanical micromanipulator (B). The perfusion system (D) is composed of a syringe set, while the flow of liquid is controlled by pinch valves (H). The rack is electrically connected to the same central ground to which all the equipment inside the Faraday cage is connected and consists of a patch clamp amplifier (N), an oscilloscope (J), a pulse/function generator (K), an A to D converter (L), a perfusion controller (I), and a filter wheel and shutter controller (M). For imaging experiments, a cooled (-110 °C, see the Table of Materials) CCD camera is connected via a side port (G). Please click here to view a larger version of this figure.[href=http://cloudfront.jove.com/files/ftp_upload/55627/55627fig2large.jpg]",
    "NOTE: During all of the following steps, use only dim red light illumination and ensure that the exposure of the ommatidia to light is minimal (i.e. work rapidly and turn off the dissecting light source and chamber red illumination used for viewing the ommatidia when performing tasks that do not demand viewing the ommatidium). In addition, perform all of the following steps according to standard electrophysiological protocol.\nUnder an inverted microscope (40X objective), carefully inspect all of the ommatidia in the bath and choose a suitable ommatidium for the experiment.\nEnsure that the outer membrane of the ommatidium is smooth and intact, that the long axis is approximately at a right angle relative to the electrode approach direction (as seen in Figure 3A), and that the distal section of the ommatidium is not surrounded by any excess tissue. Place the chosen ommatidium at the optical axis of the objective lens (in the center of the field of vision) to ensure uniform illumination.\nFill a patch pipette with intracellular solution (IS1 or IS2).\n\tNOTE: To measure the intensity response and bump analysis, use IS1. To measure the reversal potential of the light-sensitive channels, use IS2.\nMount the patch pipette onto the electrode holder.\nBlow into the pipette by mouth, through the tube connected to the electrode holder, causing it to fill with positive pressure. Close the tube valve to maintain the pressure.\nUsing the micromanipulator, insert the electrode into the bath chamber.\nGuide the electrode close to the distal section of the ommatidium, such that there is no contact between the electrode and the ommatidium, until a small dimple (due to the positive pressure in the patch pipette) can be observed in the ommatidium.",
    "Open the recording software (see the Table of Materials). Open the \"membrane test module\" to apply continuous square voltage pulses of 2 mV at a rate of 100 Hz.\nSet the junction potential to \"zero,\" by adjusting the appropriate knob in the patch clamp amplifier to set the base of the square pulse to \"zero\" current\n\tNOTE: The electrophysiological setup includes a head stage (i.e. first-stage amplification) connected to an amplifier (i.e. second-stage amplification). The amplified analogue signal is converted to a digital signal using the A/D converter, which is controlled by software installed on a PC computer.\nRelease the positive pressure in the pipette by opening the valve of the tube connected to the electrode holder. Gently create negative pressure in the pipette by sucking out of the tube, leading to the association of the pipette to the cell membrane. Close the tube valve to maintain the pressure.\nEnsure that the electrode resistance viewed on the computer screen is elevated to 100 - 150 MΩ. Release the negative pressure in the pipette by manually opening the valve of the tube connected to the electrode holder.\nEnsure that the electrode resistance is elevated to at least 1-2 GΩ.\n\tNOTE: At this point, a seal has been formed between the electrode and the photoreceptor.\nOffset the capacitive currents of the pipette by adjusting the appropriate knob in the patch clamp amplifier.\nCreate rapid, short, and forceful bouts of negative pressure in the electrode, sucking by mouth out of the tube connected to the electrode holder to \"break\" into the photoreceptor membrane and create a whole-cell configuration. Alternatively, use the \"Zap button\" to apply short, rectangular electrical pulses, starting with a duration of \"0.1 ms,\" or apply a combination of both methods.",
    "NOTE: The generation of the whole-cell configuration is revealed by a sudden increase in pipette capacitance (typically ~60 pF for a wildtype R1-6 photoreceptor; a capacitance of only ~20 pF indicates a recording from an R7 photoreceptor; a capacitance above ~90 pF indicates a recording from two photoreceptors).\nSet the holding potential of the photoreceptor to the required voltage (usually, -70 mV), manually using the appropriate knob in the patch clamp amplifier.\n\tNOTE: It is possible to perform this step after a seal has been obtained (step 6.11) and before the whole-cell configuration has been achieved.\nOffset the capacitive currents and series resistance (a measured series resistance value greater than 25 MΩ indicates that the electrode pipette has been clogged) and, if required (i.e. for larger currents), apply series resistance compensation using the appropriate knobs in the patch clamp amplifier.\nClose the black front curtain of the Faraday cage to obtain maximal darkness and electrical isolation.\nBegin the recording process using the software and administer light stimuli and/or pharmacological substances according to the desired experimental procedure.\n7. Simultaneous Whole-Cell Recordings and Ca2+ Imaging\nFor genetically encoded Ca2+ indicators, isolate the ommatidia as described above using D. melanogaster flies expressing GCaMP6f13. Use a CCD camera (see the Table of Materials) for the fluorescence measurement and ensure that the microscope is equipped with proper excitation and emission filters and a dichroic mirror (see the Table of Materials)4.\nFor the use of exogenous Ca2+ indicator (Figure 4; see the Table of Materials), isolate the ommatidia as described above. In addition, ensure that the pipette solution includes a 20-100 µM calcium indicator.",
    "Use the imaging software (see the Table of Materials) to acquire images at a rate of 40 Hz. Perform image acquisition during a 10 s dark period followed by an intense 2 s light stimulation.\nUse the imaging software and define a Region of Interest (ROI). Measure the florescence intensity in the ROI. Average the dark fluorescence (FD) and subtract it from the fluorescence recordings during the light (FL) stimulation (FL-FD). Normalize these measurements according to the fluorescence intensity at the beginning of the light stimulation (FL0)."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}