{
  "id": 5883,
  "origin_website": "Bio",
  "title": "Immunogold Electron Microscopy of the Autophagosome Marker LC3",
  "procedures": [
    "FixationSterilize the coverslips with ethanol, wash three times with PBS, and accommodate one slide for each well of the 24-well plate. Plate the cells to be tested on these slides in appropriate medium to obtain a 60-70% confluency on the following day. Note: To obtain enough technical replicates, we usually prepare 6 slides for each condition to be tested. In our study, we used primary keratinocytes expressing empty-control vector or a plasmid for the overexpression of the HPV oncoviral proteins E6/E7 (seeded about 1 x 105 cells/well) (Mattoscio et al., 2017). In addition, to unequivocally identify autophagosomes, appropriate positive and negative controls of autophagosome formation should be prepared. For example, consider activating/inhibiting autophagy with rapamycin 10-500 nM (to increase autophagosomes formation) or with class III PI3K inhibitors (such as 1-10 mM 3-methyladenine or 10-100 nM wortmannin to inhibit autophagosomes accumulation), respectively (Mizushima et al., 2010).The next day, remove the medium, wash 2 times with PBS, and fix cells in 4% freshly-prepared PFA in 0.1 M phosphate buffer pH 7.4 for 1 h at room temperature.Note: Since glutaraldehyde lowers protein antigenicity, although it provides best structural preservation, we prefer to initially fix cells with PFA alone, and then re-fix with glutaraldehyde after antigen labeling.Remove PFA, wash 2 times with PBS. Store fixed cells at 4 °C.Note: Since PFA fixation is reversible, for long time storage keep cells in storage solution (1% PFA in PBS) instead of PBS alone. ImmunolabelingRemove fixative or storage solution, wash wells three times for 5 min each in PBS, and treat with quenching solution for 10 min at room temperature to quench the free aldehydes of the primary fixative.Permeabilize cells by incubation with 0.25% saponin, 0.1% BSA in PBS for 10 min at room temperature.Incubate cells for 30 min at room temperature with blocking buffer (0.",
    "2% BSA, 5% normal goat serum, 50 mM NH4Cl, 0.1% saponin, 20 mM phosphate buffer, 150 mM NaCl, see Recipes) to block non-specific staining.Remove blocking buffer and incubate coverslips with anti-LC3 primary antibody (1:150 dilution) in blocking buffer, for 2 h at room temperature.Wash cells with washing buffer (0.1% BSA, 0.1% saponin in PBS) 4 times for 5 min each.Incubate coverslips with 1.4 nm Nanogold goat anti rabbit secondary antibody conjugated with nanogold (1:200 dilution) in blocking buffer for 1 h at RT. Wash slides 3 times with washing buffer and wash three times in PBS.Re-fix stained cells with 1% glutaraldehyde in PBS for 30 min at room temperature to preserve ultrastructure. Rinse in PBS and leave in PBS at 4 °C until next step.Gold enhancementEquilibrate all the components of gold enhancement solution (A, B, C, D) at room temperature before use.Wash 3 x 5 min with 50 mM glycine in PBS.Wash 3 x 5 min with 1% BSA, 0.05% Tween in PBS.Rinse 3 times in PBS and in the meanwhile activate gold enhancement solution by adding in an Eppendorf tube one part each of component (A-enhancer and B-activator), mix well and incubate for 5 min. Note: Gold enhancement solution should be prepared immediately before use. Increasing the amount of component B might help in reducing nonspecific signals.Add to the gold enhancement mix one part of components C (initiator) and D (buffer), respectively, rinse cells in distilled water and add few drops of the solution to the coverslip. Prepare about 40 µl of gold enhancement solution per coverslip.Check the appearance of a dark purple/black precipitate (Figure 1). Incubation time with the gold enhancement solution may vary. Usually, it takes between 1 to 3 min for the full development. Always compare with the negative control (without primary antibody).",
    "Note: The goal of this step is to enlarge gold particles associated to the secondary antibody. To improve penetration and density labeling, gold particles of small size are preferable (1.4 nm). Since these nanogold particles will be hardly visible in samples, this step is mandatory. However, as an alternative to gold, a silver enhancement solution could be used. Silver enhancement is both commercially available (Nanoprobes, catalog number 2013) or can be prepared from single components (Stierhof et al., 1991). Silver enhancement is light sensitive and can be damaged by osmium tetroxide, therefore gold enhancement solution is usually preferred for its simplicity of use.Wash three times for 5 min each with distilled water.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171213/20171213233117_4718.jpgFigure 1. Gold enhancement. Put a drop of gold enhancement solution on the coverslips and incubate until a dark precipitate appears (visible by eye). Longer incubations may cause darker signals. Check under a bright field microscope or a stereomicroscope for a fine control of gold development. Note that the dark precipitate will not appear in the negative control (CTRL: no primary antibody). Bottom: magnification of coverslips at Time = 0 and at the end of gold enhancement incubation (T = 3 min). Please note that the dark precipitate appeared only where the primary antibody is present.Contrast enhancementPost-fix samples with reduced osmium tetroxide (see Recipes) for 1 h at RT. Wash 3 times for 5 min in 0.1 M sodium cacodylate and wash three times in distilled water.Note: The use of reduced osmium fixation step preserves membrane lipids. The addition of potassium ferrocyanide reduces the osmium making it more reactive to membranes, improving their contrast.En bloc stain with 1% uranyl acetate water solution overnight at 4 °C. Note: Do not expose to light.",
    "Uranyl acetate improves image contrast due to the high affinity of uranyl and lead ions for proteins, nucleic acids, and hydroxyl groups in carbohydrates and RNA, respectively. It is important to use water instead of alcoholic solution to better preserve cellular structures.EmbeddingDehydrate specimens in an ascending ethanol series 30%, 50%, 70%, 80%, 90%, 96% for 5 min in each of the ascending series. Finally, dehydrate 3 times in 100% ethanol for 10 min every time.Replace absolute ethanol with a 1:1 solution of ethanol-embedding medium, on a rocking shaker for 2 h at room temperature.Remove coverslips from the ethanol-resin mix, absorb the excess of resin with a paper tissue and place the coverslips on top of a drop of resin. After 1 h, move the coverslips to a new drop of resin (Figure 2A).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171213/20171213233344_5060.jpgFigure 2. Embedding. Move the coverslip on drop of resin and incubate for one hour (A). Place a drop of Epon on a Chang Mold and lay the coverslips (B).Fill the cavities of a Chang monolayer Mold with few drops of resin and lay the coverslips (make sure to clean the top side of the coverslip from the excess of resin) on top of the cavity (Figure 2B).Place in the oven at 45 °C overnight, then increase the temperature to 60 °C and bake for further 24 h.SectioningTo detach Epon from slide, take the Epon block out of the oven and let it cool down. Then, immerse block in liquid nitrogen for 30 sec and then in hot water. This will detach resin containing embedded cells from the coverslip where cells were initially grown. Note: Alternatively, put the coverslips in a plastic multiwell, cover with a solution of concentrated hydrofluoric acid (30%), and shake for 5-10 min until the glass is completely dissolved.",
    "Wash the samples several times with distilled water, soak the samples in 0.1 M cacodylate buffer for 30 min, then wash with distilled water and dry.With a single edge razor blade remove a small portion of the resin block and stick with a cyanoacrylate glue on top of an empty resin block (Figure 3).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171213/20171213233717_5223.jpgFigure 3. Sectioning. After glass coverslips have been removed, cut with a razor blade a small portion of the resin block and glue on top of an empty resin block (plasticine, blue material in this image). After 1-2 h, the sample can be placed in an ultramicrotome for sectioning.Cut ultrathin sections of 60-90 nm thick and collect sections onto 200 mesh grids with square or hexagonal openings.Stain grids with 1% uranyl acetate water solution for 5 min and then Sato’s lead solution (see Recipes) for 2 min.Observe under an electron microscope and take digital micrographs.Note: To visualize autophagosomes, specimens should be observed at a magnification of 4,000 (for an overview) to 10,000x (to finely observe ultrastructure) looking for double-membraned organelles positive for LC3 gold particles, and containing undigested cytoplasmic contents (Figure 4A)."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}