{
  "id": 16732,
  "origin_website": "Jove",
  "title": "Preparing Lamellae from Vitreous Biological Samples Using a Dual-Beam Scanning Electron Microscope for Cryo-Electron Tomography",
  "procedures": [
    "Human blood was obtained from anonymized donors through the UK National Blood and Transplant service and is used within 2 weeks of receipt. No ethical approval is required for its use.\n1. Preparation and plunge freezing of  Plasmodium falciparum  infected red blood cells\nIsolate mature schizonts by centrifugation (1,580 x g) over a 70% (v/v) isotonic density gradient medium (for standard procedures for how to culture asexual blood stages of 3D7 Plasmodium falciparum in human erythrocytes see Blackman M.J., 199537).\nFix the air-dried thin blood films on a glass slide with 100% methanol to check the morphological homogeneity of the schizonts before staining with 10% Giemsa stain in 6.7 mM phosphate buffer, pH 7.1.\n\tNOTE: To enrich the preparation for schizonts stalled at specific points of egress, schizonts can be further synchronized with compound 2 and E64 inhibitors (see Representative Results and Figure 1 for an explanation of the effect of these inhibitors).\n\tCAUTION: Plasmodium falciparum is a human pathogen and must only be handled in a suitable containment facility following local health and safety guidelines.\nGently centrifuge schizonts (240 x g) to pellet them and resuspend in 2x volume of the cell pellet of RPMI media, resulting in a 50% haematocrit suspension.\nOn a manual plunge-freezing rig, apply 2.5 μL of schizonts to the carbon side of a glow-discharged (Use glow-discharge unit settings of 60 s, 30 mA in air, treating the carbon side of the grid only) 200 mesh copper grid with a 2/4 holey carbon film and blot for ~20 s from the back of the grid using grade 1 filter paper with a torn edge. Plunge into liquid nitrogen-cooled liquid ethane and transfer the grids to storage (see Table of Materials for equipment used in this study).",
    "NOTE: The experiment can be paused here, and grids can be stored under liquid nitrogen indefinitely.\n\tCAUTION: Liquid nitrogen is an asphyxiant and causes frostbite; handle with care in a suitable environment with oxygen monitoring.\n\tCAUTION: Liquid ethane causes severe burns and is flammable; use in a fume hood away from sources of ignition.\n\tNOTE: Plunge frozen schizonts are no longer viable. This was determined by incubating human blood with several gold grids of air-thawed plunge-frozen schizonts and observing no parasite growth after several days, in comparison to un-frozen controls. Frozen grids of schizonts are therefore safe to handle outside of containment facilities using normal safety and decontamination procedures (gloves, surface/tool sterilization with >70% ethanol and disposal of grids in >70% ethanol).\nScreen grids using a cryo-stage for a light microscope, paying particular attention to the gradient of ice across the grid. In the thinner areas of ice, check individual grid squares for cell coverage.\n\t​NOTE: The best squares should be one cell thick at the center of the grid square (Figure 2). This ensures that a lamella can be milled across the center of the square without hitting the thicker ice at the edges against the grid bars. The experiment can be paused here, and grids can be stored under liquid nitrogen indefinitely. If cells carry a fluorescent marker, grids can also be screened by cryoCLEM to locate X/Y positions of interest, which can be correlated with grid locations in the cryoFIB-SEM to direct milling.\n2. On-grid FIB-milling of plunge frozen cells\nMark the front of cryoFIB-specific autogrid rims with a black indelible marker pen to indicate the center of the cutaway section and the opposite side of the rim (Figure 3). Setup the clipping station and clip grids into the marked rings carbon side down.",
    "Load grids into the cryoFIB-SEM shuttle (typically 2 grids, depending on the shuttle) carbon side up and apply a platinum sputter coat in an argon atmosphere (5 x 10-2 mbar) (5 mA for 60 s - thickness is variable) or a carbon/platinum e-beam rotary coat (~4 nm thickness) to the surface of the cells.\n\tNOTE: Both types of coatings aid charge dispersal during SEM imaging. The benefit of the e-beam rotary coater is that the exact thickness of the coating can be specified.\nLoad the shuttle into the cryoFIB-SEM and assess the cell distribution on each grid by SEM at 5 kV (13 pA or 25 pA). Take a low-magnification overview (~100x) to look at ice gradients across the grid. Then, take higher-magnification (~5,000x) images to look at individual grid squares and identify the areas of the grid with visible cellular features and low surface contamination to mill.\nApply a >2 µm organoplatinum coat to the surface of each grid using the gas injection system (GIS). To do this, insert the GIS needle into the chamber above the grid and warm the organoplatinum source to a set temperature for a set time (for example, ~27 °C for 3-10 s) to produce a flow of vapor.\n\tNOTE: The angle of application, temperature, and timing of the organoplatinum coat via the GIS needle should be optimized to maximize an even coating. This will depend on the specific cryoFIB-SEM used (see Representative Results for further explanation).\nTilt the sample so that the plane of the grid is ~10° from the incidence angle of the ion beam and move the center of a suitable grid square to be seen in both the SEM and FIB images.",
    "Survey the grid using the ion beam at low current (nominally 1.5 pA, 30 kV) and go to high enough magnification (~7,000x) to visualize the cells at the center of a grid square. Bring the sample into focus at the first milling current (300 pA) and correct for astigmatism. Adjust the brightness and the contrast, then mark out two rectangular patterns to mill, one above and one below a 3 µm thick protected region, the center of which is the desired location of the final lamella.\n\tNOTE: The chosen width of the patterns will depend on the topography of the surrounding cell layer and the cell size. 7-20 µm is a suitable width for schizonts, but wider lamellae take longer to mill. The chosen height of the patterns for the first milling step depends on the sample thickness, starting around 6 µm; this may need to be adjusted during milling. Milling is carried out directionally from the outside top and bottom edges of the patterns toward the face of the lamella. This can be done in parallel, where both patterns are milled concurrently or sequentially, first removing material from above the lamella and then from underneath.\nStart milling at the first current; monitor the live progress in the ion beam view and intermittently by SEM (5 kV, 13 or 25 pA). Check that the ion beam has broken through the sample above and below the protected region. If not, increase the height of the rectangular patterns to remove more material. Stop when the surface above and below the lamella is completely smooth in the ion beam view.",
    "NOTE: The ion beam has broken through the sample above and below the protected region when the inside of the rectangular patterns contains no features in the focal plane. Some features, such as grid bars, may be visible out of focus in the background.\nChange to the next milling current (100 pA); focus and adjust the brightness/contrast. Decrease the space between the two rectangular patterns to 1.5 µm and decrease the pattern height to only cover the un-milled material. Begin milling at the new current until the surface above and below the lamella is completely smooth.\nRepeat this process stepwise until a thickness of 0.3 µm is reached, reducing the ion beam current each time according to the milling scheme in Table 1.\nMill several lamellae (the amount is dependent on the thickness of the sample and the time available) on one or both grids to a thickness of 0.3 µm, record the X/Y/Z position of each lamella and reserve ~1-2 h at the end of the session to polish the lamellae to their final thickness (60-200 nm).\nTake a low-magnification SEM overview of the entire grid and plan a polishing route starting from lamellae at the front of the grid (closer to the ion beam source) to lamellae at the back of the grid (furthest away from the ion beam source) (Figure 5).\n\tNOTE: This reduces redeposition of ablated material back onto the surface of polished lamellae.",
    "Reduce the space between the two rectangular patterns to 100-200 nm and begin the final polishing step at an ion beam current of 30 pA. Monitor the progress by SEM at 2-3 kV (13 pA, dwell = 300 n, 3072 x 2048, ~2 s for a full frame) and stop polishing when the contrast is lost in the lamella by SEM or when the organoplatinum coat of the lamella itself begins to lose integrity.\nBefore removing the grids, acquire a low-magnification SEM image of the entire grid and save images of each lamella. Use them to cross-check the grid later in the TEM. Pause the experiment here and store the grids with lamellae under liquid nitrogen - handle with care.\n\t​NOTE: Grids can be lightly sputter coated upon removal from the cryoFIB-SEM, which can help limit drift and charging in the TEM at high-magnification, but this should be done cautiously as too much sputter coating can obscure the biological contents inside the lamellae. It is possible to screen lamellae for fluorescence at this stage; however, obtaining enough signal will depend on the abundance of the labeled protein within the thickness of the lamella. Great care must be taken handling the grids to limit damage to the lamellae and prevent surface contamination.\n3. Tilt-series acquisition and general overview of data processing\nLoad the grids into the TEM, aligning the milling direction perpendicular to the tilt axis of the stage.\n\tNOTE: Alignment of the grids is done by eye using the marks on the autogrid rim. A ~10° margin of error is acceptable, otherwise the walls of the trench either side of the lamella may obscure the lamella as the grid is tilted.",
    "Acquire a low-magnification map (~150x) of the entire grid and locate the lamellae; then, acquire a medium-magnification map (~1,500x, depending on lamella size) of each lamella and locate the areas of interest.\nPre-tilt the grid by ±10° to make the plane of the lamella (not the grid) perpendicular to the optical axis\n\tNOTE: The direction of the pre-tilt can be determined by the position of the front edge of the lamellae (looking for the left over organoplatinum coat) in the low and medium magnification maps. For the TEM used here, grids require a +10° pre-tilt if the front edges of the lamellae point up in the maps and require a -10° pre-tilt if they point down. Each grid may be different due to how they were picked up and inserted into the autoloader.\nAcquire dose-symmetric tilt-series38 (for example, -54° to +54° with an increment of 3-5°) at a pixel size that permits both the field of view and resolution required for the region of interest. Use a range of defocus values between -2 and -5 µm. Collect movies with 3-10 frames at each increment and for this, adjust these parameters depending on the pixel size to accumulate a total dose of ~150 e-/Å2 (for a 300 kV TEM).\n\tNOTE: Cracks in the lamella should be avoided as these regions may drift. Surface contamination should also be avoided as it may obscure the region of interest or the focus area at high-tilt.\nMotion correct the movies using a program such as MotionCor239. Apply a dose weighting filter to the corrected images (accumulated e-/image)40 and estimate the defocus of each image using a program such as CTFFIND441.\nUse fiducial-less alignment (patch tracking) in a program such at etomo (IMOD)42 to calculate the alignment and angular relationship of the images in tilt-series.",
    "Input the alignment and rotation information, along with the defocus values into a program that can apply three dimensional CTF correction, for example, NovaCTF43. Calculate a corrected tomogram to get output tomograms with binning factors relevant to downstream analysis.\nAnalyze the reconstructions and prepare for any downstream processing, for example, filtering, segmentation, or sub-tomogram averaging."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}