{
  "id": 5780,
  "origin_website": "Bio",
  "title": "Preparation of Primary Cultures of Embryonic Rat Hippocampal and Cerebrocortical Neurons",
  "procedures": [
    "Remove E18 embryos (to prepare cultures of hippocampal neurons) from a pregnant Wistar rat, anesthetized and sacrificed as previously described, by cesarean-section (Caldeira et al., 2013; Mele et al., 2014; Curcio et al., 2015; Mele et al., 2017).Note: To culture cerebrocortical neurons, it is recommended to use E17 embryos. The same procedure also applies.Transfer the embryos to a 150 mm glass Petri dish filled with ice-cold HBSS (150 ml should be enough; see Recipes).Sacrifice the embryos by decapitation with scissors and remove the brains (Figure 1). Separate the brain hemispheres and remove the cerebellum with forceps (and other non-essential parts; Figure 2). Carefully remove the meninges under a dissecting microscope using both curved and straight forceps (Video 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170912/20170912015109_9963.jpgFigure 1. Brain of an E18 rat embryo observed at different magnification levelsimgsrc:https://en-cdn.bio-protocol.org/attached/image/20170912/20170912015146_1877.jpgFigure 2. Cerebral cortex from the brain of an E18 rat embryo with the hippocampus still enclosed. The meninges can still be observed at the surface of the cerebral cortex.    <p>imgsrc:https://bio-protocol.org/javascript:;</p>   Video 1. Initial steps in the dissection of the rat hippocampal   Dissect and isolate the hippocampi and transfer the tissue to a 55 mm plastic Petri dish filled with HBSS (5-7 ml should be enough; see Figure 3 for end result). The use of a dissecting microscope will facilitate this procedure.Notes: We recommend to use the hippocampi from all the embryos obtained from the pregnant rat since the cell yield is low. To prepare cerebrocortical neurons, dissect the two cortices (see Figure 3 for end result). imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170912/20170912015302_5131.jpgFigure 3. Dissected cerebral cortex (left side) and the isolated hippocampus (right side)Take the Petri dish with all the hippocampi obtained from the pregnant rat to a laminar flow hood for sterile conditions.",
    "Collect all intact hippocampi (or cortices) by pipetting them to a 15 ml conical tube and bring the volume of HBSS to about 6 ml.Notes: Use a glass pipette of 10 ml. This type of pipette has a wider tip that avoids damaging the tissue.For cerebrocortical neurons, wash the tissue three times with HBSS (5-8 ml is enough) by allowing the tissue to deposit by gravity; the obtained final volume after the second washing step should be as mentioned in step 6.Tip: Use four hemispheres for each 15 ml conical tube for preparation of cerebrocortical neuron cultures.Add 1.5 ml of the trypsin solution (see Recipes) to the medium containing the hippocampi and incubate for 15 min at 37 °C. At the end of the incubation period the tissue should be sedimented.Notes: A water-bath system can be used for this incubation.For cerebrocortical neurons, this process should last 10 min.Allow the tissue to deposit, and carefully remove the supernatant in the laminar flow hood.Add 8 ml of previously warmed (37 °C) 10% FBS solution (see Recipes) to the sedimented hippocampi and agitate gently.Allow the tissue to sediment and wash out the 10% FBS solution by removing the supernatant and rinsing the hippocampi with 10 ml of previously warmed (37 °C) HBSS.Remove the supernatant and add 5 ml of previously warmed (37 °C) supplemented neuronal culture medium (see Recipes).To prepare cultures of cerebrocortical neurons, steps 10-12 must be substituted by washing the tissue five times with ice-cold HBSS (6-9 ml) and by bringing the volume to about 4 ml of HBSS in the last washing step.Note: This volume was found to be optimal for having a final concentration of cells of about 3-5 x 106/ml of solution.",
    "Use mechanical force provided by the Pipetboy to dissociate the tissue with a sterile 5 ml glass pipette, pipetting up and down the hippocampi suspension.Notes:  After dissociation of the cells, the suspension becomes cloudy (see Figure 4).The mechanical dissociation to prepare cultures of hippocampal neurons is performed in supplemented neuronal culture medium, whereas HBSS should be used in the preparation of cerebrocortical neurons.Tip: The tip of the 5 ml glass pipette should be in close proximity with the bottom of the 15 ml conical tube, keeping only a narrow space to allow the passage of the solution. When the suspension is pipetted up and down, the medium will become cloudy as a result of the cell dissociation.Since this procedure is rather aggressive to the cells it should not be repeated more than 10 times. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170912/20170912015520_0225.jpgFigure 4. Cell suspension after dissociation of the cerebrocortical tissue (right). The tube on the left contains the non-dissociated cortical tissue. Similar results are obtained after dissociation of hippocampal cells (not shown).Collect the cell suspension solution and filter to a sterile 50 ml conical tube through a cell strainer of 70 μm.Note: This step allows separating the cells in suspension from the small aggregates of non-dissociated tissue that are retained.To count the number of cells, dilute equal volumes of the following solutions: HBSS, cell suspension, trypan blue (50 μl of each should be enough).Add 10 μl of the cell suspension prepared in step 14 to a hemocytometer. Using an inverted phase contrast microscope equipped with a 10x objective, count the cells present in each of the four quadrants located at the corners (area = 0.01 cm2; volume 0.0001 cm3).",
    "Note: The number of cells present in each ml of solution can be calculated using the following formula: average number of cells/square x 3 (dilution factor in step 14) x 104 = number of cells/ml of solution.Plate the cells in a poly-D-lysine-coated multi-well plate at the appropriate density.To prepare the poly-D-Lysine solution, first dilute the 100 mg vial in 100 ml of boric acid (0.1 M, pH 8.2). Aliquots of this solution should be stored at -20 °C until further use. The resulting solution (1 mg/ml) should be further diluted in boric acid (166.3 mM, pH 8.2) and filtered immediately before coating the plates, to obtain a final concentration of 0.1 mg/ml. To coat the plastic dishes, add enough solution to cover the bottom of the wells and incubate for 2 h at 37 °C (overnight incubation in a humidified incubator is recommended). After this coating period, wash each well twice with enough volume of sterile distilled water to cover the bottom of the well, and allow the wells to dry inside the laminar flow hood.The protocol for coverslip coating is as follows: 1) wash the coverslips in nitric acid overnight with constant agitation, in a closed glass recipient (we use an 11 x 9 x 7 cm; 0.5 cm thick container); 2) after removing carefully nitric acid, with the help of a plastic pipet, wash abundantly with distilled water (5 washes, 20-30 min each); 3) wash the coverslips for 5 min with absolute ethanol; 4) dry the coverslips at 160 °C for 1 h (in a closed glass container); 5) sterilize the coverslips by UV radiation inside a flow chamber, in a glass Petri-dish for about 30 min. To coat the coverslips, transfer them to the appropriate multi-well plates, and follow the instructions mentioned in step 16a.",
    "Notes: Tip 1: For a glass container with 11 x 9 x 7 cm we wash a maximum of 100 coverslips. The coverslips may stick onto each other if a higher number is used.Tip 2: The poly-D-lysine solution used to coat the wells can be recycled once if used in consecutive days.Tip 3: in a 11 x 9 x 7 cm, 0.5 cm thick glass container we use 50 ml of water/absolute ethanol.Hippocampal neurons are plated at a density of 90.0 x 103 cells/cm2 whereas cerebrocortical neurons are plated at 92.8 x 103 cells/cm2.During plating, hippocampal neurons can be diluted and plated directly in supplemented neuronal culture medium containing 25 μM of glutamate (see Recipes), whereas cerebrocortical neurons must be plated in neuronal plating medium (see Recipes). After 2-3 h of incubation at 37 °C in a humidified incubator with 5% CO2/95% air, replace the neuronal plating medium with fresh supplemented neuronal culture medium without glutamate (only valid for the preparation of cerebrocortical neurons).Feed hippocampal neurons once a week, by changing equal parts of volume (1/3 of the initial volume of culture medium), and cerebrocortical neurons twice a week by changing equal parts of volume (¼ of the initial volume of culture medium). At day 3 replace 1/3 of the culture medium with fresh medium (devoid of glutamate) containing 30 μM 5-FDU (final concentration–10 μM; the stock solution is kept at 10 mM) in order to stop the growth of glia cells. In this step always use supplemented neuronal culture medium lacking glutamate. Subsequent neuronal feeding should be done by using supplemented neuronal culture medium devoid of glutamate and 5-FDU. See Figures 5-8 for final results. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170912/20170912015821_3077.jpgFigure 5. Cultured hippocampal neurons with 1 DIVimgsrc:https://en-cdn.bio-protocol.org/attached/image/20170912/20170912015906_4888.jpgFigure 6. Example of cultured hippocampal neurons with 15 DIVimgsrc:https://en-cdn.bio-protocol.org/attached/image/20170912/20170912020010_6402.jpgFigure 7. Cultured cerebrocortical neurons with 1 DIVimgsrc:https://en-cdn.",
    "bio-protocol.org/attached/image/20170912/20170912020108_6773.jpgFigure 8. Cultured cerebrocortical neurons with 15 DIV"
  ],
  "subjectAreas": [
    "Cell Biology",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}