{
  "id": 19433,
  "origin_website": "Jove",
  "title": "In Vitro Myelination of Peripheral Axons in a Coculture of Rat Dorsal Root Ganglion Explants and Schwann Cells",
  "procedures": [
    "All procedures were performed in accordance with the European Communities Council Directive for the care and use of laboratory animals.\n1. Schwann cell culture\nCoating for Schwann cell culture\n\t\nCoat the cell culture dishes under sterile conditions. Apply 2 mL of 0.01% poly-L-lysine (PLL) to two 60 mm tissue culture (TC) dishes each and incubate overnight at 4 °C.\nRemove the PLL, wash the TC dishes 2x with distilled water, and incubate with 2 mL of 1 µg/cm2 laminin overnight at 4 °C. Wash the TC dishes 2x with aqua dest, and let the plates air-dry.\nMedium preparation for Schwann cell culture\n\t\nPrepare 50 mL of Schwann cell medium by adding 10% heat-inactivated fetal calf serum (FCS), 2 µM forskolin, 10 nM neuregulin, and 50 µg/mL gentamycin to Dulbecco′s Modified Eagle′s Medium (DMEM)/F-12 (high glucose) under sterile conditions.\nPrepare 70 mL of Leibovitz's L-15 medium with 50 µg/mL gentamycin under sterile conditions.\nSciatic nerve preparation\n\tNOTE: All sciatic nerve preparation steps are performed under a clean bench.\n\t\nPrepare one 100 mm TC dish with 5 mL of ice-cold Dulbecco's phosphate-buffered saline (DPBS) without Ca2+ and Mg2+, one 100 mm TC dish with 5 mL of ice-cold Leibovitz's L-15 medium, and one 100 mm TC dish with 5 mL of ice-cold Leibovitz's L-15 medium and 50 µg/mL gentamycin.\nClean all the instruments by autoclaving. Spray the instruments and working area with 70% ethanol.\nEuthanize five 3-week-old male Sprague Dawley rats using CO2 inhalation and decapitation. Spray the rat's torso with 70% ethanol.\nOpen the dorsal lower left limb with scissors and remove the biceps femoris muscle carefully. Loosen the sciatic nerve by smooth elevation with curved forceps, ensuring not to bruise the nerve.",
    "Hold the most proximal part of the nerve with the curved forceps to straighten the nerve, and clip the nerve as high as possible using scissors. Then, clip the nerve close to the sacral plexus and the paw with scissors. Repeat steps 1.3.4-1.3.5 for the right side.\n\t\tNOTE: While opening the limb, take care not to bruise any blood vessels.\nUsing forceps, put the left and right sciatic nerves into a 100 mm TC dish with ice-cold DPBS.\nSciatic nerve refurbishment\n\t\nUse forceps to transfer all the nerves to a 100 mm TC dish with ice-cold Leibovitz's L-15 medium and 50 µg/mL gentamycin. Continue using a stereomicroscope and remove fat, muscle, and blood vessels from the nerves with two pairs of fine forceps. Grab the nerves with forceps and transfer them to a 100 mm TC dish with ice-cold Leibovitz's L-15 medium.\nIdentify the proximal and distal ends of the sciatic nerve. Remove the epineurium with one pair of fine forceps in a proximal to distal direction, while holding the proximal nerve end with the second pair of fine forceps.\nTransfer the purified nerves to a 100 mm TC dish with ice-cold Leibovitz's L-15 medium and 50 µg/mL gentamycin. Tease the isolated nerve fascicles to separate and isolate single nerve fibers using two pairs of fine forceps.\nTransfer the nerve fibers to a 50 mL tube using a 10 mL serological pipette and take up as little medium as possible. Add 50 mL of Leibovitz's L-15 medium with 50 µg/mL gentamycin to the nerve fibers and slew a few times in the 50 mL tube.\nEnzymatic digestion of the sciatic nerve\n\t​NOTE: The next steps (steps 1.5-1.8, 2.1, and 2.2) are performed under sterile conditions.",
    "Prepare the enzymatic digestion solution containing 0.25% dispase II, 0.05% type I collagenase, and 50 µg/mL gentamycin in 10 mL of DMEM (high glucose).\nCentrifuge the tube at 188 x g for 5 min at 4 °C, remove the supernatant with a 25 mL serological pipette ,and transfer the pellet with the remaining Leibovitz's L-15 medium into a 60 mm TC dish using a 1,000 mL pipette.\nRinse the 50 mL tube with 10 mL of the enzymatic digestion solution and add it to the dish containing the nerve fibers. Distribute the tissue in the dish carefully with the tip of a pipette to maximize the accessible surface for digestion.\nIncubate at 37 °C and 5% CO2 for 18 h, and stop the digestion by adding 10 mL of 40% FCS in Hanks' balanced salt solution, without Ca2 and Mg2+ (HBSS).\nCell separation\n\t\nTransfer the digested nerves into a 50 mL tube using a serological pipette and centrifuge at 188 x g for 10 min at 4 °C. Discard the supernatant and resuspend the pellet in 10 mL of DMEM containing 10% FCS and 50 µg/mL gentamycin. Resuspend the pellet 20 times subsequently, using a 10 mL, 5 mL, 2 mL, 1 mL, and 200 µL pipette tip.\nFilter the cell suspension through a 100 µm cell strainer and centrifuge at 188 x g for 10 min at 4 °C. Discard the supernatant and resuspend the pellet with 4 mL of DMEM containing 10% FCS and 50 µg/mL gentamycin.\nAdd 2 mL of the cell suspension to each of the two PLL- and laminin-coated 60 mm TC dishes, and incubate at 37 °C and 5% CO2. Leave the plates untouched for 2 days in the incubator to protect the cells from mechanical stress and to support adherence.\nSchwann cell differentiation",
    "After 2 days, remove the medium and carefully rinse the plates 2x with DMEM (high glucose), 10% FCS, and 50 µg/mL gentamycin. Afterward, add 2 mL of Schwann cell medium. Replace the Schwann cell medium every 2nd day, and observe the cell appearance and confluency using a microscope.\n\t\t​NOTE: Schwann cells and DRG explants need to be prepared in a timely, coordinated manner for the coculture. Make sure a rat with embryos at E 13.5 is available for DRG preparation when the Schwann cells are close to a confluency of 80%.\nCell trypsinization and magnetic separation\n\tNOTE: For exemplary pictures of different Schwann cell culture stages, see Supplementary Figure 1.\n\t\nWhen the cells reach a confluency of about 80% (6-12 days of culture), carefully wash the plates 2x with 3 mL of DPBS and incubate with 2 mL of 0.05% Trypsin/EDTA (prewarmed to 37 °C) for 3 min. When the cells detach from the plate bottom, inactivate digestion by the addition of 2 mL of DMEM with 10% FCS and 50 µg/mL gentamycin.\n\t\tNOTE: Stick to a trypsinization time of strictly 3 min, and proceed rapidly afterward.\nResuspend the cell pellet in 2 mL of magnetic cell separation buffer containing DPBS with 0.5% bovine serum albumin (BSA) and 2 nM EDTA. Combine 10 µL of the cell suspension with 10 µL of trypan blue and count the cells using a staining chamber.\nCentrifuge the cell suspension at 188 x g for 10 min at 4 °C and resuspend the cell pellet in 90 µL of magnetic cell separation buffer per 1 x 107 cells. Add 10 µL of Thy-1 microbeads per 1 x 107 cells. Resuspend the solution a few times and incubate for 15 min in the dark at 8 °C.",
    "Add 2 mL of the magnetic cell separation buffer to the cell suspension and centrifuge at 300 x g for 10 min at 4 °C. Discard the supernatant and resuspend the pellet in 500 µL of magnetic cell separation buffer.\nMoisten the magnetic cell separation column with 1 mL of the magnetic cell separation buffer. Place the magnetic cell separation column in the magnetic cell separator. Apply the cells to the magnetic cell separation column. Collect the flow through and centrifuge at 300 x g at 4 °C for 10 min.\n\t\t​NOTE: Fibroblasts are positively selected and remain in the column, while Schwann cells pass the column. Fibroblasts can be collected with a stamp (e.g., as a negative control for Schwann cell staining protocols).\nDiscard the supernatant and resuspend the pellet in 1 mL of the coculture medium (see step 3.1.1). Count the cells after staining with trypan blue and a staining chamber.\n2. DRG explant culture\nDRG growth medium preparation\n\t\nPrepare DRG growth medium by adding 2% B27, 2% horse serum, 1% L-glutamine, 0.5% penicillin/streptomycin, and 10 ng/mL nerve growth factor (NGF) to the neurobasal medium. Store the growth medium at 4 °C.\n\t\tNOTE: The growth medium can be used for 2 days.\nCoating for DRG explants\n\t\nIncubate the coverslips in 70% ethanol for 1 h and place in the wells of 4-well dishes using curved forceps. After the ethanol has dried, apply 300 µL of 0.2 mg/mL poly-D-lysine (PDL) per well and incubate overnight at 37 °C and 5% CO2.\nWash the coverslips 3x for 5 min each with DPBS consecutively. Take off the DPBS, apply 300 µL of 1 µg/mL laminin to the coverslips, and incubate overnight at 37 °C and 5% CO2.",
    "After three washing steps with DPBS for 5 min, replace the DPBS with 190 µL of DRG growth medium. Place the 4-well plates into the incubator at 37 °C and 5% CO2.\nDRG preparation\n\tNOTE: Harvest the DRG of embryonic rats under a clean bench.\n\t\nBefore preparation, clean all the instruments with 70% ethanol. Fill 10 (two per embryo) 35 mm TC dishes with 2 mL of ice-cold HBSS per dish, and two 100 mm TC dishes with 5 mL of ice-cold HBSS per dish.\nEuthanize the pregnant rats (adult female Sprague Dawley rats, E13.5) by CO2 inhalation and decapitation.\nSpray the body with 70% ethanol and open the ventral torso of the rat. Carefully remove the uterus and place it into a 100 mm TC dish with ice-cold HBSS.\nHold the uterus using curved forceps and open the uterus wall with fine forceps. Remove one amniotic sac and open it carefully by pinching a hole with fine forceps.\nRemove the embryo from the surrounding tissues, cut the umbilical cord, and decapitate the embryo using fine forceps. Place the torso into a 100 mm TC dish filled with HBSS using curved forceps and a spatula.\nQuickly remove all the embryos from the uterus and transfer them into one 100 mm TC dish filled with HBSS. If there are more than five embryos, prepare an additional 35 mm TC dish with 2 mL of HBSS, according to step 2.3.1.",
    "Gently place one embryo torso into a 35 mm TC dish filled with HBSS using a spatula and curved forceps. Under a stereomicroscope, open the dorsal part of the torso to divide the embryo into two halves using fine forceps and micro scissors. Turn one half to the side and identify the strand of DRG located in a line at the dorsal part of the embryo.\nCut out the DRG as a whole strand using fine forceps and micro scissors. Place the DRG in a fresh 35 mm TC dish filled with 2 mL of HBSS, and separate a single DRG from the remaining tissue using fine forceps and micro scissors.\nDRG cell culture\n\t\nTake 4-well plates containing 190 µL of DRG growth medium from the incubator to the clean bench where the DRG are to be prepared. Transfer a single DRG carefully into one well of a 4-well culture plate using fine forceps and a spatula. Place the DRG into the center of each well, since a central position is important for the attachment of the DRG.\nWork under sterile conditions from now on. Place the explant cultures in the incubator at 37 °C and 5% CO2. The next day, add 50 µL of the DRG growth medium carefully to each well using a 100 mL pipette.\nObserve DRG explant adherence and axon outgrowth using a microscope daily, and discard DRG explants that have detached from the coverslip or failed to outgrow axons on day 3 of culture.",
    "​NOTE: DRG explants are very fragile in the first days of culture and need to be handled with care, especially when moving the plates in and out of the incubator when the medium is changed, or even when closing the incubator door. The precise volume of 190 µL of medium per well is crucial to keep the DRG explants in place during the first day of culture. Loose DRG explants can be identified easily during the daily control, as they swim in the medium instead of adhering to the coverslip.\n3. Coculture\nTransfer of Schwann cells to the DRG explant culture\n\t\nPrepare the coculture medium by adding 0.1% ascorbic acid to the DRG growth medium.\nOn day 3 of the DRG explant culture, carefully replace the DRG growth medium with 250 µL of the coculture medium containing 30,000 Schwann cells (from step 1.8) per well.\nKeep the coculture of the DRG explants and Schwann cells for up to 22 days. Replace 250 µL of the coculture medium carefully every other day, and observe the appearance of the cells using a microscope.\n\t\tNOTE: For an example of DRG axons and Schwann cells in the coculture in the first days of culture, see Figure 1.\nImmunocytochemical staining\n\tNOTE: Handle the coculture samples extremely carefully during the staining procedure, since they can be damaged easily.\n\t\nTo fix the cells on the coverslips, remove the medium slowly, wash 3x with DPBS carefully, and incubate in 4% paraformaldehyde (PFA) for 10 min. Replace the PFA with DPBS, and store the fixed cells at 4 °C for up to 1 week.\n\t\tCAUTION: When handling 4% PFA, wear the recommended personal protective equipment.",
    "Wash the coverslips 3x with DPBS for 5 min, then block with blocking solution (10% goat serum, 10% bovine serum albumin [BSA], 0.1% gelatin, and 0.05% Triton X-100) in DPBS for 1 h. Dilute the primary antibodies βIII-tubulin (1:7,500) and myelin basic protein (MBP) (1:750) in the blocking solution, and incubate overnight at 4 °C.\nWash the cells 3x with DPBS for 5 min. Use fluorescent dye-conjugated secondary antibodies in a dilution of 1:1,000 in blocking solution, and incubate for 2 h at room temperature (RT).\nWash the cells 3x with DPBS for 5 min, and mount the cells on microscopic slides with fluorescence mounting medium, including 4′,6-diamidino-2-phenylindole (DAPI). Store the slides in the dark at 4 °C until microscopic documentation.\n\t\tCAUTION: When handling fluorescence mounting medium, wear the recommended personal protective equipment.\nAnalysis\n\t\nTake pictures of eight defined regions surrounding the DRG explant in the center using an inverted microscope.\nUse an image analysis software application to quantify the areas of βIII-tubulin positive axons and myelination stained by MBP.\nCalculate the percentage of myelination as a ratio of the myelinated axons and non-myelinated axons.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}