{
  "id": 5618,
  "origin_website": "Bio",
  "title": "Thermal Stability of Heterotrimeric pMHC Proteins as Determined  by Circular Dichroism Spectroscopy",
  "procedures": [
    "Purification and buffer exchange of pMHC proteinHLA-A2 and human β2-microglobulin (β2m) sequences were generated as described and cloned into separate pGMT7 expression plasmids (Cole et al., 2007). Complexes of HLA-A2, β2m and peptides are refolded and purified as described (Bulek et al., 2012, MacLachlan et al., 2017) with the essential steps summarized below. For CD analysis, proteins should be of high purity and the preparation should lack the presence of denatured or incorrectly folded protein. In order to achieve this, the proteins are purified on the day of, or the day before analysis, and stored on ice to avoid any freeze thaw cycles.Prepare a 500 ml solution of PBS using 1 tablet per 100 ml of ultra-pure water. With the bottle top filtration device and vacuum pump, filter this solution through a cellulose nitrate 0.45 µm filter paper, with a 1.2 µm glass microfiber filter as a pre-filter, into a 500 ml Duran bottle. Prepare another 500 ml Duran bottle of ultra-pure water.Connect the gel filtration column to the ÄKTA FPLC system and wash with sterile ultra-pure water followed by equilibrating the system with PBS. Wash the 2 ml injection loop with ultra-pure water and equilibrate with PBS using a 10 ml syringe, taking special care to avoid the occurrence of any air gaps that can be transferred to the column.Using a 25 G needle transfer the protein solution, of no more than 1 ml, into the injection loop using a 1 ml syringe avoiding any air bubbles.Run the column at 0.5 ml/min and monitor elution by UV absorbance at 280 nm (Note 1).",
    "Collect 1-ml fractions (the number of fractions depends on the elution profile, but we try and take 2-4 fractions from the center of the peak) and analyse by SDS-PAGE under reducing conditions to check for purity of the pMHC sample. We use 4-12% gradient Bolt® Bis-Tris gels, BLUeye prestained protein ladder, NuPAGE MES running buffer, and Quick Coomassie Stain.Run an SDS-PAGE. Upon SDS-PAGE, pMHC dissociates into its constituent parts. Bands of HLA-A2 and β2m run at positions corresponding to ~32 and ~12 kDa, respectively. The peptide (~1 kDa) will run out of the gel (Figure 1).Combine only the purest two or three fractions and concentrate using an Amicon centrifugal filtration tube with an MWCO of 10 kDa. This provides protein of adequate purity and concentration for CD analysis.Directly before CD measurements, spin the samples at 14,000 x g for 20 min at 4 °C usually without resulting in any visible pellet.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170630/20170630223414_3753.jpgFigure 1. SDS-PAGE analysis of pMHCI. Approximately 20 µg of pMHCI (right lane) was loaded onto a 4-12% gradient Bolt® Bis-Tris gel with 3 µl BLUeye prestained protein ladder (left lane) and run at 200 V for 23 min in NuPAGE MES running buffer. The gel was stained for 5 min in Quick Coomassie Stain and destained with ddH2O. The pMHCI α chain runs as a separate band at ~32 kDa and β2m at ~12 kDa.Determination of parametersRecord UV spectra of the supernatant (step A7) from 360 to 230 nm in a 1-cm quartz cuvette with the buffer baseline subtracted. Within the 360 to 320 nm range, the absorbance should be essentially zero; any slope is due to light scattering indicating the presence of large aggregates.Calculate the 280 nm absorption coefficient based on the amino acid composition (Pace et al., 1995) using the ProtParam website at http://web.expasy.org/protparam/[href=http://web.expasy.org/protparam/].",
    "Due to the high amount of the aromatic residues Tyr (5.3%) and Trp (3.2%) within the HLA-A2 and β2-microglobulin sequences combined (see Supplements 1 and 2[href=https://en-cdn.bio-protocol.org/attached/file/20170619/20170619005214_4478.docx]), a good estimate for imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170702/20170702203821_4670.jpg (absorption coefficient) can be expected. As HLA-A2 and β2-microglobulin have two and one intra-chain disulphide bonds, respectively, the cystine contribution to the absorption is included (ProtParam option: ‘assuming all pairs of Cys residues form cystines’).Calculate protein concentration from the measured optical density at 280 nm imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170702/20170702203857_7571.jpg as:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170702/20170702203935_4914.jpgUse ProtParam to calculate the molecular mass based on the average isotopic masses of amino acids. All three sequences of the HLA-A2/β2m/peptide complex are entered into the program input field together. To account for the two missing peptide bonds due to the three instead of single chain complex as seen by the program, two times the molecular mass of water (2 x 18.02) is added to the resulting mass Mr.Calculate the mean residue weight (MRW) required for the normalization of the CD data from this mass by dividing the number of peptide bonds:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170702/20170702204014_2434.jpgwhere, n is the number of amino acids within the trimer.Data acquisitionBased on the concentration of the stock solution determined as described above, dilute an aliquot with buffer to result in ca. 600 μl of sample with c ~0.15 mg/ml (~3 μM), and record a further absorption spectrum to give the final protein concentration (Note 2).Following the usual start-up procedure of the CD instrument (30 min flushing with N2 followed by a further 30 min period for stabilizing the xenon arc lamp), record a spectrum of the buffer (step A1) in a clean 0.1-cm stoppered quartz cell from 260 to ~195 nm with the cell holder equilibrated to 4 °C. This spectrum is termed the baseline. We usually record spectra using a 1 nm bandwidth in 0.",
    "2 nm intervals with 3 or 4 sec measuring time per data point resulting in ca. 20 to 25 min per spectrum (Note 3).Record a further buffer baseline in the Kinetic Mode at a constant wavelength of 218 nm for 1 min in 2 sec intervals.Clean the cell with water by rinsing, followed by rinsing with absolute ethanol and dried under a stream of nitrogen.Fill the same cell completely with the protein solution (~550 μl), closed tightly with a Teflon stopper avoiding trapping of an air bubble, and place into the CD cell holder in the same orientation as used for recording the baseline.After ~2 min to allow for temperature equilibration, record the protein spectrum using the same instrument settings as used for the baseline. Data are reliable if the photomultiplier dynode voltage is < 500 V (Note 4).For temperature denaturation, set the wavelength to 218 nm (minimum in CD spectrum). Record changes in ellipticities in 0.5 °C intervals from 4 to ~80 °C using the following parameters: data collection 12 sec/point; temperature equilibration 12 sec; temperature dead band 0.3 °C; instrument heating rate 4 °C/min. During the intervals between data collection, the sample is shielded from the light beam by a closed slit. These settings result in an average heating rate of ~36 °C/h (Note 5).At elevated temperatures the HLA-A2/β2m/peptide complexes form large, visible aggregates (precipitation) that result in sharp changes of the melting profile and an increase of the dynode voltage indicating increased scattering. At this point, the measurement can be stopped.Clean protein precipitate containing cuvettes thoroughly rinsing with water followed by filling with 70% HNO3 in a fume hood, incubation for 2 h to overnight, rinsing with water, ethanol, and drying with a stream of N2."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}