{
  "id": 17584,
  "origin_website": "Jove",
  "title": "Minimizing Post-Infusion Portal Vein Bleeding during Intrahepatic Islet Transplantation in Mice",
  "procedures": [
    "All procedures were conducted with the approval of the Institutional Animal Care and Use Committees at the Medical University of South Carolina and the Ralph H Johnson Medical Center in Charleston.\n1. Diabetes induction using streptozotocin (STZ)\nRecipient mice preparation:\n\t\nWeigh all mice individually.\nCheck blood glucose levels from a tail vein blood sample using a glucometer.\nSTZ dose determination for three different scenarios:\n\t\nFor mice with fatty liver disease inject one dose of STZ [40 mg/kg/day, intraperitoneal (i.p.) injection] for 5 consecutive days.\nFor NOD-SCID mice inject 125 mg/kg of STZ, single injection, i.p. after overnight fasting.\nFor C57BL/6 mice inject 225 mg/kg of STZ, single injection, i.p.\nCalculations for STZ (13.5 mg/mL):\n\tNOTE: This calculation is for five C57BL/6 mice with body weights of 30 g:\n\t\nTotal body weights: 5 mice x 30 g/mouse = 150g\nSTZ needed: 150 g x 225 mg/1000g STZ = 33.75 mg\nSTZ preparation:\n\t\nWeigh the STZ following the pre-calculated dose.\nTransfer the weighed STZ powder into a 10 mL beaker on ice.\nAdd 3 mL of sodium citrate solution to the beaker to dissolve the STZ.\nMix well, filter sterilize through a 0.22-μm pore, and use the STZ solution within 10 min of preparation.\nSTZ injection:\n\t\nLoad the desired amount of STZ solution (enough for one mouse) into 1 mL syringe.\nPerform intraperitoneal injection at the lower right quadrant of mouse abdomen.\nObserve mice for 5 min after injection and check for any signs of discomfort during this period of time before putting them back into the cages.\nMonitor blood glucose level from a tail vein blood sample using a glucometer daily after the STZ injection.\n\t\tNOTE: In this experiment, mice are considered diabetic when non-fasting blood glucose is > 350 mg/dL for two consecutive days.\n2. Islet preparation",
    "NOTE: Human islets were cultured in CMRL-1066 media supplemented with 10% fetal bovine serum (FBS), and 1% penicillin/streptomycin (P/S) at a density of 10,000 islet equivalent number (IEQ) per 100 mm cell culture dish9. Mouse islets were cultured in DMEM with 10% FBS and 1% P/S with the same density13. Male NOD-SCID and C57BL/7 mice between 6-10 weeks of ages were obtained from commercial sources.\nDetach cultured islets from cell culture dish by gentle scratching.\nHand-pick desired numbers of islets (e.g., 300-350 islets) using a 1cc syringe and put them into sterile 1.5 mL microcentrifuge tubes on ice.\nSpin the tube for 10 seconds using the microcentrifuge.\nRemove the supernatant, leaving some liquid to avoid losing the pellet.\nResuspend the pellet in 200 μL of HBSS with 0.5% bovine serum albumin (BSA).\nAspirate the resuspended islets into a 0.5 mL insulin syringe.\nPlace the syringe in the upright position. Let the islets sink down for 1 min.\nPush the syringe to remove all the bubbles, leaving about 100-150 μL of liquid containing islets.\nPlace syringe head down and gently tap the side of the syringe to let the islets equally distribute throughout the liquid. Islets are now ready for injection.\n3. Islet transplantation\nInduce and maintain the mouse under general anesthesia with 2% isoflurane. Check for the lack of pedal reflexes to ensure proper anesthetization of the animal.\nShave and remove the fur in the abdomen area of the mouse.\nAdminister a single pre-operative dose of Buprenorphine (0.1 mg/kg i.p.).\nDisinfect the surgical area with three alternating wipes of 2% iodine and 75% alcohol.\nPerform a laparotomy with micro scissors to generate a 1-1.5 cm incision.\nOpen the peritoneal cavity with a retractor. Follow with either method A or method B as detailed below.",
    "4. Method A: (stop bleeding with gel foam,  Figure 1A)14,15,16\nMouse preparation\n\t\nPlace a sterile gauze around the incision.\nGently pull out the intestine using a forceps and keep it on the gauze.\nIdentify the portal vein by its location and expose it well.\nCover the intestine with a warm saline-wet gauze during the entire surgery.\nInsert the islet preloaded insulin syringe needle through the portal vein near the duodenum (Figure 1B). To do so, hold the needle with the hole (bevel) facing down and position the opening surface's angle parallel to the portal vein wall before penetrating through the wall.\n\t\nPull the plunger to draw some blood (20-50 μL) into the syringe to mix the islets first.\nInfuse the islets into the portal vein slowly while repeatedly pulling and pushing the plunge.\nPlace a piece of gel foam (about 0.5 cm x 0.5 cm in size) to cover the injection site.\nPress the gel foam down with a cotton tip while pulling out the needle from the portal vein.\nContinue pressing on the gel for about 2 min to confirm there is no active bleeding.\nRollover the cotton tip over and away from the gel foam to make sure the gel foam covers the portal vein well.\n5. Method B: (stop bleeding with fat pad,  Figure 1C)17\nExpose the portal vein thoroughly.\n\t\nUse two cotton tips to hold the exposed portal vein from both the left and the right sides.\nIdentify the fat tissue pad between the duodenum and the portal vein.\nPenetrate through the fat pad before inserting the needle into the portal vein (Figure 1D).\nInfuse the islets, following the similar procedure described above in part 4.2.1 and 4.2.2 of Method A.\nPull out the needle while pressing down on the fat with a cotton tip.",
    "Continue pressing on the fat pad for 1 min after removing the needle.\nAfter confirming that there is no bleeding from the portal vein, gently return the intestine to the peritoneal cavity in its original position.\nLeave 0.5 mL of warm saline (36-37 °C) in the abdominal cavity before closure.\n\tNOTE: Warm saline facilitates post-surgery intestine movement and recovery and prevents intestine necrosis.\nClose the muscle layer with an 5-0 suture.\nClose the skin layer with an 4-0 suture.\nPlace the mouse in a clean cage on a heating pad until fully recovered from anesthesia.\nContinue to provide an analgesic (e.g., buprenorphine 0.1 mg/kg i.p.) every 12 h and supplemental heat for 48 h post-surgery.\n\t​NOTE: The islet transplantation procedure takes approximately 15-20 min to complete.\n6. H&E staining and photograph of whole liver section\nLiver perfusion\n\t\nPut the mouse under anesthesia as described above in part 3.1.\nCarefully expose the portal vein and cut the inferior vena cava.\nManually perfuse the liver using 20 mL of 10% paraformaldehyde via the portal vein for about 5 minutes, using a 20 mL syringe with 25G needle18.\n\t\tNOTE: Liver perfusion can remove blood from liver tissue and improve liver fixation without disturbing the islet grafts.\nDissect the perfused whole liver from other organs.\nFix the perfused liver tissue in 10% paraformaldehyde for 24 h.\nEmbed the tissue in paraffin.\nCut tissue sections of 5 µm thickness each and put them on a glass slide for staining.\nPerform H&E, insulin, fibrin, and polymorphonuclear neutrophil (PMN) staining using standard methods15,16.\nScan whole liver section under a microscope.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}