{
  "id": 10201,
  "origin_website": "Jove",
  "title": "High-Dimensionality Flow Cytometry for Immune Function Analysis of Dissected Implant Tissues",
  "procedures": [
    "NOTE: Figure 1 gives an overview of the flow cytometry protocol.\n1) Reagent preparation\nPrepare media for diluting enzymes and for tissue culture.\n\t\nAdd 5 mL of 4-(2-hydroxyethyl)-1-piperazineethanesulfonic acid (HEPES) buffer solution into 500 mL of RPMI medium and shake well. Store the medium at 4 °C until further use.\nCalculate the volume of the enzyme solution.\n\t​NOTE: The volume of the enzyme solution is the volume of the medium containing the enzymes (collagenase and DNase I) that will be needed to digest diced tissue in 6-well plates; it depends on the number of samples.\n\t\nUse the following equation to calculate the required volume:\n\t\t(Number of samples to be digested) × 5 mL of serum-free RPMI with 10 mM HEPES buffer\n\t\t​NOTE: For example, for 0.1 to 0.3 g of dissected spleen, use 5 mL of medium to prepare the enzyme solution. The enzymatic digestion protocol described in this manuscript is primarily for soft tissues (ranging from 0.1 to 1 g) dissected from mice which include the brain, kidney, skin, liver, lungs, spleen, muscles, as well as capsules around subcutaneous implants made of synthetic materials or extracellular matrix proteins. Digesting hard cartilaginous tissues might require different conditions and volumes of digestive enzymes, which can only be ascertained by optimization.\nCalculate the amount of collagenase and DNase I needed for the enzyme solution.\n\t\tNOTE: In this protocol, 0.25 mg/mL of collagenase and 0.2 mg/mL of DNase I were used. The working concentrations required for collagenase and DNase can vary for different types of tissues19.\nPrepare a 1:1000 viability dye solution by adding 1 µL of the viability dye (see Table of Materials) to 999 µL of phosphate-buffered saline (PBS) and vortex the solution. Store the solution in the dark at 4 °C until further use.",
    "Prepare the staining buffer by adding 1 g of bovine serum albumin (BSA) to 100 mL of PBS, and vortex the solution until BSA is completely dissolved. Store the solution at 4 °C until further use.\n2) Setting up enzymatic digestion plates\nSet up a 6-well plate with 70 µm cell strainers in each well. Add 3 mL of the prepared medium from step 1.1.1 into each well, and incubate on ice.\nStore the remaining media (2 mL/well) in an incubator or water bath at 37 °C for suspending the calculated amount of collagenase and DNase I (step 1.2.2).\n3) Isolation of cells\nPlace the dissected implants/tissue into plates, and dice finely using scissors. Alternatively, utilize a mechanical disruption method using a tissue dissociator or hand-held homogenizer. Owing to the high number of leukocytes, dissect out the spleen to utilize as a staining control in each run.\n\tNOTE: As some materials induce higher levels of fibrosis, this protocol is applicable for both highly fibrotic and minimally fibrotic materials. However, each processing method should be evaluated for both cell yield and viability after digestion prior to staining. Avoid peripheral blood contamination during dissection.\nAdd collagenase and DNase I (volume calculated in step 1.2.2) to the remaining RPMI (2 mL) that has been warmed to 37 °C. Add 2 mL of the complete enzyme solution to each well.\nPlace the plates in an incubated shaker for 45 min at 37 °C and 100 rpm.\n\tNOTE: Be cautious when stacking plates as this can inhibit proper heat transfer.",
    "Meanwhile, prepare a suspension-dispensing tip by chopping 3-4 mm from the end of a 1000 µL tip with scissors. After incubation, pipette the suspension in the wells up and down to mix it thoroughly using the chopped tip. Place the cell strainer on the top of a 50 mL conical tube and pass the digested solution through the cell strainer.\n\tNOTE: The 70 µm cell strainer is sufficient to separate cells from implanted biomaterial, such as alginate. If greater purity is required, use processes such as density gradient separation to obtain an enriched population of leukocytes.\nRinse the wells with 1x PBS solution, and transfer the rinse volume through the strainer, followed by adding the washes of the strainer with 1x PBS solution until the volume in the tube reaches 50 mL.\n\tNOTE: The 1x PBS must be at room temperature to prevent any increase in the viscosity of the digest and to allow cell pelleting during centrifugation.\nCentrifuge the tube at 300 × g for 5 min at room temperature. Following centrifugation, aspirate the supernatant carefully using a serological pipette without disturbing the pellet. Re-suspend the pellet in 1000 µL of 1x PBS, and transfer the suspension to a microcentrifuge tube.\nMix 10 µL of the cell suspension with 10 µL of trypan blue, and load the suspension on counting chamber slides for counting cells using an automatic cell counter or on a hemocytometer to count via the conventional method under a microscope. Alternatively, use flow cytometry cell counting beads.\n4) Staining for flow cytometry",
    "See Figure 2 for an example plate layout for a 14-color experiment with 45 samples, fluorescence minus one (FMO) controls, compensation controls, and a fully stained spleen sample control. After estimating the total number of cells, calculate the volume of the cell suspension required for staining 1 × 106 cells for each sample, and 0.5 × 106 cells for each compensation and FMO control. Dispense the required volume of the cell suspension into the wells of a V-bottom 96-well plate, and make up the volume to 100 µL with 1x PBS.\n\tNOTE: As an example, if 1000 µL of cell suspension obtained at step 3.6 contain 40 × 106 cells, then for 1 × 106 cells, 1000/40 × 106 = 25 µL of cell suspension will be required.\nCentrifuge the plate at 300 × g for 5 min at 4 °C, aspirate the supernatant, and then resuspend the cells in the sample wells and in a compensation control well to determine viability, with 100 µL of a 1:1000 solution of the viability dye (see Table of Materials).\nFor cells in the other compensation wells as well as FMO and unstained wells, resuspend them with 100 µL of 1x PBS.\nIncubate the cells in the dark for 30 min at 4 °C.\nIn the meantime, prepare a surface antibody cocktail for staining the sample and FMO controls: 50 µL per sample or FMO. See Table 1 for an example of the antibody cocktail.\nAfter incubation, add 100 µl of 1x PBS to each well, spin down at 300 × g for 5 min at 4 °C.\nAspirate the supernatant and resuspend in 200 µL of staining buffer (1x PBS + 1% BSA); centrifuge at 300 × g for 5 min at 4 °C.",
    "Aspirate the supernatant, and resuspend the cells in the compensation, FMO, and unstained wells with 50 µL of 1x PBS. Add 50 µL of the antibody cocktail to the respective sample wells and FMO wells. Add the respective antibodies to the different compensation wells.\nIncubate the plate for 45 min in the dark at 4 °C. After incubation, add 150 µL of staining buffer in each well, and centrifuge the cell suspension at 300 × g for 5 min at 4 °C.\nAspirate the supernatant, resuspend the cells with 200 µL of staining buffer, and centrifuge the cell suspension at 300 × g for 5 min at 4 °C.\nIf analyzing samples without fixation, resuspend them in 200 µL of staining buffer, and proceed to section 6 on cytometer setup and sample analysis. If fixing the cells, aspirate the supernatant after washing, and add 100 µL of a fixative such as 4% paraformaldehyde. If staining for intracellular markers, proceed to section 5 on intracellular staining, and fix and permeabilize the cells (see Table of Materials). Incubate cells for 20 min in the dark at 4 °C.\n\tNOTE: As fixation can affect the fluorescence intensity of some fluorophores, evaluate each panel both with and without fixation.\nAfter incubation, add 100 µL of 1x PBS, followed by centrifugation at 300 × g for 5 min at 4 °C. Aspirate the supernatant, resuspend in 1x PBS, and centrifuge at 300 × g for 5 min at 4 °C.\nRe-suspend the cells in 200 µL of staining buffer, and store at 4 °C prior to flow cytometric analysis.\n5) Intracellular staining",
    "Continuing from step 4.11 for fixation and permeabilization for intracellular markers, add 100 µL of the appropriate buffer. Centrifuge the cells at 350 × g for 5 min at 4 °C. Aspirate the supernatant, and re-suspend the pellets in 200 µL of the fixative-permeabilizing agent solution; centrifuge the cells at 350 × g for 5 min at 4 °C. Aspirate the supernatant, and resuspend the pellets with intracellular antibodies diluted in the appropriate buffer.\n\tNOTE: Antibody types and dilutions will depend on the target cells. For example, one common intracellular marker is forkhead box P3 for regulatory T cells, which is frequently used at a 1:100 dilution.\nIncubate the cell suspension in the dark for 45 min at 4 °C. After incubation, add 150 µL of the appropriate buffer, and centrifuge the suspension at 350 × g for 5 min at 4 °C.\nAspirate the supernatant, and re-suspend the cells in 200 µL of staining buffer followed by centrifugation at 300 × g for 5 min at 4 °C. Aspirate and re-suspend the cells in 200 µL of staining buffer for flow cytometric analysis.\n6) Cytometer and compensation setup\nImmediately before running the samples, prepare compensation beads (see Table of Materials) if utilizing bead-based compensation as opposed to cell-based compensation.\n\t\nLabel separate microcentrifuge tubes for each fluorochrome-conjugated antibody, and add 100 µL of 1x PBS followed by one full drop of anti-mouse negative control compensation beads and one drop of positive control compensation beads to each tube. Add 1 µL of the appropriate antibody to each separate tube. Vortex and incubate for 5 min before acquisition.\n\t\tNOTE: As some dyes, such as BUV737, cannot be bound to beads, use a cell-based control.",
    "Calibrate the flow cytometer before each experiment by running the cytometer setup with the tracking beads, and maintain the flow cytometer settings for each experiment.\nBefore analyzing the sample, adjust the flow cytometer by running an unstained sample to adjust the cell population on a side scatter (SSC) versus forward scatter (FSC) plot so that the cell population falls in the center of the plot and is not off-scale.\nRun the stained sample briefly to adjust the voltages for FSC and SSC and for each channel to make sure that no events fall outside the logarithmic scale of each channel. Record 5,000 events for each compensation control, followed by gating of positive and negative populations. Calculate the compensation matrix and then run the samples, gathering at least 1,000 events for the populations of interest.\n\tNOTE: Compensation on larger-color panels should be verified, as automated compensation can be prone to over- or under-compensation. Each parameter should be graphed against every other parameter to monitor for signs of over- or under-compensation, and each single-color control should be evaluated. Complex compensation of larger-color experiments should be carried out with the assistance of a collaborator or a core facility with extensive flow cytometry experience. Newer types of flow cytometers such as spectral cytometers utilize the full spectrum of a fluorophore through a process known as spectral unmixing, which can yield a cleaner distinction of fluorescent overlap as compared to standard compensation alone22.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}