{
  "id": 3911,
  "origin_website": "Cell",
  "title": "Chromatin immunoprecipitation of transcription factors and histone modifications in Comma-Dβ mammary epithelial cells",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nHarvesting and cross-linking nuclei\nTiming: 2 h\nIn this step cells are harvested by scraping, crosslinked in solution and nuclei are extracted. Nuclei can be frozen down for later use. The protocol below is for 1 ChIP assay.\nWorking on ice, aspirate media from 150 mm dish of sub-confluent cells and add 3 mL ice-cold PBS (pH 7.4) containing protease inhibitors (PBS + PI)\nNote: Perform all steps on ice unless otherwise stated\nNote: The amount of input material can be increased when performing ChIP for lower abundance proteins such as transcription factors, and needs to be optimized on a case-by-case basis. If ChIP signal is low then increasing the amount of input material may help improve signal over background (see Troubleshooting section).\nScrape cells off the dish and transfer the suspension into a 50 mL falcon tube\nPerform long strokes in perpendicular planes then scrape around the outside, being sure to scrape the entire surface of the dish for maximum recovery.\nWash dish with 10 mL PBS and transfer the wash solution into the same tube\nPellet cells by centrifugation at 500 ×g for 5 min at 4°C\nAspirate supernatant and loosen the cell pellet by flicking three times\nResuspend cells in 2 mL of PBS + PI by pipetting with a P1000 3 times\nPass cell suspension gently through a 19-gauge needle 10 times to break up large clumps of cells. Avoid bubbles.\nAdd 23 mL PBS + PI and invert 3 times to mix.\nWorking in a fume hood, add 1.67 mL of 16% paraformaldehyde (final concentration 1%). Invert tube 4 times.\nIncubate for 15 min at 20°C–25°C to crosslink the chromatin.\nQuench crosslinking reaction by adding 1.77 mL 2 M glycine (final concentration 125 mM). Invert 4 times to mix.",
    "Incubate for 5 min at 20°C–25°C\nCentrifuge at 500 ×g for 5 min at 4°C, aspirate supernatant and resuspend in 10 mL PBS + PI. Pipette up and down 3 times.\nRepeat above wash step two more times for a total of 3 washes.\nCentrifuge at 500 ×g for 5 min at 4°C and aspirate supernatant.\nResuspend in 0.5 mL nuclei extraction buffer. Pipette to mix.\nIncubate on ice for 10 min.\nMeanwhile chill Dounce homogenizer tube on ice\nTransfer cell suspension into Dounce homogenizer tube and perform 20 strokes with a tight pestle\nFor 1 stroke plunge the pestle to the bottom of the tube and rotate 180°\nRemove a 10 μL aliquot and mix with 10 μL trypan blue in an eppendorf tube and use a hemocytometer to check nuclei extraction (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/634-Fig1.jpg\nFigure 1. Cells stained with trypan blue before and after homogenization in nuclei extraction buffer with 40 strokes\nNote that trypan blue is expected to stain all nuclei under these conditions.\nRepeat Dounce step if necessary until most nuclei are extracted\nNote: Clean Dounce homogenizer and pestle thoroughly with dH20 and 70% ethanol between uses if extracting nuclei from different conditions. Soak in 1 M NaOH for 16–20 hr after use to clean.\nTransfer suspension to a new 1.5 mL eppendorf tube\nWash nuclei by centrifuging at 1000 ×g for 5 min at 4°C, aspirate supernatant and re-suspend nuclei pellet in 300 μL PBS + PI\nRepeat centrifugation as in step 22 and aspirate supernatant. Nuclei can be stored at −80°C or continue with either sonication optimization or chromatin immunoprecipitation below.\nPause Point: Crosslinked nuclei pellet can be stored at −80°C for several months.\nOptimizing sonication\nTiming: 1.5 days",
    "In this step the optimal sonication time to generate 100–500 bp DNA fragments is determined. The sample is sonicated in increments and aliquots are taken at various time points, DNA is reverse crosslinked and size determined by agarose gel electrophoresis. This step only needs to be performed once per cell line and sonicator and not for every ChIP experiment.\nTurn on sonicator cooling system or add ice to water bath\nThaw nuclei pellet on ice\nAdd 300 μL of sonication buffer to nuclei pellet\nIncubate for 5–10 min on ice\nPipette to mix\nNote: It is normal for suspension to be clumpy\nVortex sample and briefly centrifuge to collect the liquid at the bottom of the tube.\nOptional: Take a 10 μL aliquot before sonication for unsonicated control.\nSonicate on high for 5 cycles\n1 cycle = 30 sec on and 30 sec off\nAdd balance tubes containing 300 μL water to the remaining positions\nRemove sample tube, vortex, and briefly centrifuge. Remove a 10 μL aliquot into an eppendorf tube and place on ice\nReturn sample volume to 300 μL by adding 10 μL sonication buffer. Vortex and briefly centrifuge.\nSonicate for a further 5 cycles.\nRepeat steps 31–33 every 5 cycles up to 30 cycles, transferring the aliquot into a new eppendorf tube each time.\nAt the end of the time course there will be 6 tubes: 5, 10, 15, 20, 25, and 30 cycles.\nNote: If using an ice bath sonicator, replenish ice when it is low to ensure samples do not overheat, as this will denature the proteins.\nTo each 10 μL aliquot add 90 μL nuclease free water, 4 μL 5 M NaCl and 1.25 μL Proteinase K (20 mg/mL)\nIncubate at 65°C for 16–20 hr to reverse crosslinks and remove protein",
    "The following day add 2.5 μL RNase (4 mg/mL) and incubate at 37°C for 1 h.\nExtract DNA using 2 mL Phase Lock Gel (PLG) tubes\nSpin PLG tubes for 20–30 sec at 12,000–16,000 ×g to pellet the gel\nTransfer sample to PLG tubes\nWorking in fume hood, add equal volume of phenol-chloroform-isoamyl alcohol mixture to each sample and shake vigorously for 15 sec or until the solution is a uniform, milky white.\nSpin at 12,000–16,000 ×g for 5 min at 20–25°C\nTransfer the aqueous phase to a LoBind eppendorf tube\nPerform ethanol precipitation\nTo each sample add 1 μL GlycoBlue and 1:10 volume of 3 M sodium acetate and mix well\nNote: The GlycoBlue will aid in visualization of the DNA pellet which will be very small.\nAdd 2.5× volumes of 100% ethanol\nIncubate at −80°C for 4–20 hr\nSpin for 15 min at top speed (13,000 – 22, 000 ×g) at 4°C\nOrientate hinge of tubes on the outside so pellet can be located.\nRemove supernatant\nWash pellet with 1 mL 80% ethanol.\nDo not disturb pellet.\nSpin at top speed (13,000 – 22, 000 ×g) for 5 min at 4°C\nRemove supernatant. Use a P10 to remove all traces of ethanol without disturbing the pellet\nAir dry pellet on bench for 5 min or until no ethanol is visible\nResuspend DNA in 10 μL nuclease free water\nQuantify DNA concentration using a NanoDrop spectrophotometer\nLoad 0.5−1 μg of DNA on a 2% agarose gel with a 100 bp ladder\nChoose the number of cycles that shears DNA to 100–500 bp in size (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/634-Fig2.jpg\nFigure 2. Sonication optimization time-course samples run on a 2% agarose gel with 100 bp ladder",
    "Fragments between 100–500 bp are required for ChIP. 10 cycles is the optimal number of cycles in this case as the majority of the DNA lies within the desired range of 100–500 bp.\nImmunoprecipitation\nTiming: 1 day\nThis step details the immunoprecipitation of protein/DNA complexes from sonicated nuclear lysates. We recommend using ChIP-grade antibodies if they are available. In this study we used antibodies raised against H3K4me3 (active promoter mark), H3K27me3 (repressive chromatin mark), H3K27ac (active enhancer mark) and the bHLH transcription factor HEB. If ChIP-grade antibodies are not available we recommend checking the ability of the antibody to pull down its target protein under the crosslinking conditions described in this protocol. At the very minimum antibodies should be validated by western blotting or immunofluorescence.\nAdd 1 mL 0.5% BSA in PBS to a 2 mL eppendorf tube\nNote: 2 mL tubes are preferred to 1.5 mL tubes for better mixing during immunoprecipitation.\nAliquot 50 μL Pierce ChIP-grade protein A/G magnetic beads per ChIP into the 2 mL tube and briefly vortex.\nCritical: Mix beads by vortexing just before aliquoting as the beads settle rapidly\nPlace tube on magnetic rack and allow beads to separate for approximately 30 sec. Remove supernatant with a pipette.\nRepeat wash with another 1 mL 0.5% BSA in PBS, vortex tube, place on magnetic rack and wait for beads to separate, then remove supernatant.\nAdd 350 μL 0.5% BSA in PBS to washed beads and remove from magnetic rack.\nAdd antibody to bead solution\nNote: Amount is antibody dependent, generally 10 μg per ChIP is a good starting point\nVortex tubes and place on rotating platform at 4°C for a minimum of 4 h\nDuring the 4 h incubation, proceed with nuclei sonication and clearing steps below\nThaw nuclei pellet on ice",
    "Add 300 μL of sonication buffer and incubate for 5–10 min on ice.\nPipette to mix\nVortex and briefly centrifuge sample.\nSonicate on high for pre-optimized number of cycles as previously determined in step 42[href=https://www.wicell.org#o0365]\nCentrifuge sample for 5 min at top speed (13,000 – 22, 000 ×g) at 4°C\nTransfer supernatant into a 2 mL eppendorf tube and dispose of the pellet\nRemove a 10 μL aliquot and store at −80°C\nCritical: Do not forget to set aside the sonication check sample as it is important to check that the fragments are in the appropriate size range\nAdd 200 μL dilution buffer to the sonicated lysate to bring volume to 500 μL\nWash 15 μL of magnetic beads two times with 1 mL 0.5% BSA in PBS, then remove supernatant\nAdd the diluted lysate to the beads and place on rotating platform for at 1.5 h at 4°C to clear\nNote: pre-clearing helps to remove proteins that bind non-specifically to the beads\nPlace bead/lysate mix on magnetic rack and transfer the cleared lysate into a new 2 mL tube.\nRemove 10 μL aliquot of the sample and store at −80°C.\nNote: This is the “total input” and represents what your sample looks like without enrichment of your protein of interest\nCritical: Do not forgot to set aside the total input sample as this is the control for the immunoprecipitation\nRetrieve the antibody/bead solutions and wash three times in 0.5% BSA in PBS. Remove supernatant.\nTransfer the cleared lysate into the tube containing the washed antibody-bound beads.\nPlace on the rotating platform and incubate for 16–20 hr at 4°C.\nThe following day either validate successful IP by western blotting, or proceed to elute DNA.\nValidating IP antibodies by western blotting\nTiming: 1–2 days",
    "For the first time performing ChIP experiments, we recommend checking the ability of the antibody to pull down its target protein under the crosslinked conditions used in the ChIP protocol by western blotting.\nPlace bead/lysate mix on magnetic rack. Remove supernatant.\nOptional: keep the supernatant to check depletion of protein of interest\nWash beads three times with RIPA buffer\nEnsure you remove as much of the last wash as possible by briefly spinning tubes down and use a P10 to remove all supernatant\nResuspend beads in 80 μL 2× NuPage sample buffer for 1 dish of cells\nNote: For the purpose of western blotting, the amount of input material, beads, and antibody can be quartered. In this case add 20 μL of sample buffer to beads, which is enough for 1 western blot lane.\nNote: Using 2× loading buffer rather than 1× loading buffer is thought to help remove protein from the beads. The input sample is also made up with 2× loading buffer so that the western blot runs evenly.\nThaw input sample and make up in 2× NuPage sample buffer to 20 μL\nHeat samples at 85°C for 10 min\nPlace IP tubes on magnet rack to separate beads from the supernatant which contains the protein\nThis step is not necessary for the input\nLoad 20 μL input and 20 μL IP samples onto an SDS-PAGE gel\nDo not load the beads onto the gel\nPerform western blot as described on the antibody datasheet.\nEluting DNA\nTiming: 2.5 days\nIn this section, chromatin is eluted from the beads and DNA-protein crosslinks are reversed overnight. The next day, DNA is cleaned up by ethanol precipitation. We advise performing ethanol precipitation overnight to increase yield. This protocol is based on the Millipore ChIP Assay Kit (#17-295)",
    "Place bead mixture on magnetic rack and remove the supernatant\nWash beads for 5 min on a rotating platform at 20°C–25°C with 1 mL of each of the following buffers. Following washing place tube on magnetic rack, remove supernatant, and add the next wash buffer in the following order:\nLow salt wash buffer – one wash\nHigh salt wash buffer – one wash\nLiCl wash buffer – one wash\nTE buffer – two washes\nAdd 100 μL ChIP elution buffer.\nCritical: Make the sodium bicarbonate stock immediately before use\nRotate on rotating platform at 20°C–25°C for 15 min\nPlace sample on magnetic rack and transfer supernatant into a new eppendorf tube\nCritical: Do not discard the supernatant as this contains the eluted DNA\nAdd another 100 μL of ChIP elution buffer to the beads and rotate for a further 15 min. Place on magnetic rack and combine supernatant with the first eluate for a total of 200 μL.\nThaw the total input and sonication check aliquots and add 190 μL nuclease free water.\nReverse crosslinking of all samples (ChIP, input and sonication check) by adding 8 μL of 5 M NaCl and 2.5 μL of Proteinase K (20 mg/mL). Pipette to mix. Incubate at 65°C for 16–20 hr.\nAfter incubation, centrifuge briefly.\nAdd 5 μL of RNase A (4 mg/mL) to each sample and incubate at 37°C for 1 h\nExtract DNA using 2 mL PLG tubes\nSpin PLG tubes for 20–30 sec at 12,000–16,000 ×g to pellet the gel\nTransfer sample to PLG tubes\nWorking in fume hood, add equal volume of Phenol-chloroform-isoamyl alcohol mixture to each sample and shake vigorously for 15 sec\nSpin at 12,000–16,000 ×g for 5 min at 20°C–25°C\nTransfer the aqueous phase to a LoBind eppendorf tube\nPerform ethanol precipitation",
    "To each sample add 1 μL GlycoBlue and 1:10 volume of 3 M sodium acetate and mix well\nAdd 2.5× volumes of 100% ethanol\nIncubate at −80°C for 16–20 hr.\nSpin for 15 min at top speed (13,000 – 22, 000 ×g) at 4°C.\nOrientate hinge of tubes on the outside so pellet can be located.\nRemove supernatant\nWash pellet with 1 mL 80% ethanol\nDo not disturb pellet\nSpin at top speed (13,000 – 22, 000 ×g) for 5 min at 4°C\nRemove supernatant. Use a P10 to remove all traces of ethanol without disturbing the pellet\nAir dry pellet on bench for 5 min or until no ethanol is visible\nCritical: Remove as much ethanol as possible but do not over dry the pellet\nResuspend in 20 μL TE buffer\nPause Point: ChIP’ed DNA can be stored at −20°C for several months.\nDetermine DNA concentration using the Qubit Fluorometer with the dsDNA HS Assay Kit according to the manufacturer’s protocol.\nNote: Input concentrations should be in the range of 300–800 ng/μL. As this is above the detection limit of the HS kit (10 pg/μL to 100 ng/μL), first dilute the input samples 1:10 (1 μL input + 9 μL nuclease-free water) before performing quantification.\nNote: ChIP’ed DNA concentrations will be low (0.1–2.5 ng/μL) and sometimes undetectable (see Troubleshooting section)\nCheck fragment size of the sonication check sample from step 57 by DNA gel electrophoresis"
  ],
  "subjectAreas": [
    "Chromatin Immunoprecipitation (Chip)",
    "Molecular Biology",
    "Chipseq"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}