{
  "id": 18790,
  "origin_website": "Jove",
  "title": "Primary Culture of Human Vestibular Schwannomas",
  "procedures": [
    "Ethics Statement: use of the human tumor specimens in this protocol was approved by the University of Iowa Institutional Review Board (IRB).\n1. Setup the Day Before Tumor Harvest\nCoat Cell Culture Plates: In a sterile culture hood, add enough poly-L-ornithine (0.01% solution) to cover the bottom of a polystyrene/plastic culture well/dish, replace the lids, and let sit at room temperature for at least 2 hr. Glass slides or coverslips can be substituted for polystyrene for experiments requiring imaging.\nAfter 2 hr, remove the poly-L-ornithine solution with suction and allow the plates to dry completely in a sterile culture hoods. Add enough laminin solution (10 µg/ml in Ca2+/Mg2+-free HBSS [HBSS-/-]) to completely cover the culture plates, replace lids, then either 1) place in cool 4 °C refrigerator overnight, or 2) place in 37 °C incubator for at least 2 hr. If plates will be stored overnight or longer, wrap the plates in plastic wrap to prevent evaporation/desiccation.\n2. Setup the Day of Tumor Harvest\nPrepare Culture Media: Media is made fresh on day of tumor harvest and processing, stored at 4 °C, and warmed to 37 °C in incubator immediately prior to media additions/changes.\nSchwannoma culture media is high-glucose (4.5 mg/ml) DMEM (with phenol red) with 0.1 mg/ml penicillin and 0.1 mg/ml streptomycin; N2 media supplement final dilution 1:100; Bovine Insulin 5 µg/ml; Fetal Bovine Serum to 10% total volume. Filter all media through 0.22 μm filter.\nPrepare Specimen Transport Cooler: Send an ice filled cooler with 1-2 (depending on amount of tumor to be harvested) sterile 50 ml conical tubes with 25 ml HBSS with Ca2+/Mg2+ (HBSS+/+) to the operating room for tumor sample transfer and transport.",
    "Prepare individual tumor dissociation tubes – fill sterile 2 ml round bottom tubes with 1 ml of HBSS+/+ and place on ice. (Tubes will be used for sharp dissection/dissociation of tumor samples).\nFor dissociation, prepare approximately one dissociation tube for every 0.5 cm3 of harvested tissue; for example, a tumor specimen measuring 1.0 x 1.0 x 1.0 cm (1 cm3) will require two HBSS+/+ dissociation tubes.\nUltraviolet light sterilization: Place tissue scissors, small forceps, scalpel handle, 1x normal Petri dish, P1000 pipette, and pipette tips in a sterile culture hood, and leave under ultraviolet light for ~15 min prior to arrival and processing of tumor tissue.\n3. Specimen Isolation and Transport\nIsolate tumor specimens by surgical resection.\nImmediately place tumor specimens into the ice-cold HBSS+/+ as quickly as possible after removal from the patient. Once all tissue samples are collected, transport samples (on ice) from the operative theater to the lab for further processing.\n4. Tissue Dissociation and Trituration\nFollowing standard sterile technique in a laminar flow hood, bring conical tube with tumor specimen into the culture hood, and wash samples by inverting tube and tumor 50x. Allow fragments to fall to the bottom of the tube, and then remove HBSS+/+. Refill with 30 ml HBSS+/+, and agitate/invert 50x again. Repeat inversion/media removal for a total of 4x.\nRe-suspend tumor fragments in 30 ml HBSS+/+ for the last time, then pour mixture into a sterile100 mm petri dish, and separate tumor into 0.5 cm3 groupings. If larger tumor fragments are encountered, use the tissue scissors or scalpel (#11 or #15 blade) to cut into smaller pieces.",
    "Use the forceps to place the 0.5 cm3 tissue groups into the individual HBSS+/+ filled, 2 ml round bottom conical tubes, all on ice. Use the tissue scissors to mince tumor fragments into sub-1 mm fragments –the suspension should have a ‘snowglobe’ appearance (Figure 1). Mince the tumor only until the majority of the fragments are sub-1 mm; do not ‘over-mince’ the tumor samples. Place completely minced tissue tube back on ice, and repeat with all additional specimen tubes.\nTransfer all fragmented tumor samples into a single 15 ml conical tube. A P1000 pipette with a cut/modified sterile tip works well for this step. Use extra HBSS+/+ to flush/rinse the 2 ml dissociation tubes to make sure all tumor sample has been collected in 15 ml tube. Spin down mixture in centrifuge at 23 °C, at 73 x g for 5 min.\nSuction off HBSS+/+, leaving the cell pellet. Re-suspend fragments in 1:1 mixture of 0.25% trypsin:0.2% collagenase (dissolved in HBSS-/-) – add just enough to keep tumor fragments in tight suspension. Replace screw-top, and place in 37 °C incubator for 30 min. Agitate cell mixture at least once during incubation to keep fragments in suspension. Place the Schwannoma culture media into the incubator to warm it at this time as well.\nAfter incubation, add 100 µl FBS to each tube to inactivate the trypsin, and then centrifuge sample at 23 °C, 73 x g for 5 min. Using a pipette, carefully suction off as much supernatant as possible without disturbing cell pellet. Add the warmed culture media (N2/insulin/5% FBS) to the tumor fragments to a final ratio of 1:2 tumor fragments: culture media (for example, if there is 1 ml of tumor fragments, add in 2 ml of warmed media).",
    "Prepare for tumor trituration by cutting the tip off of a P1000 pipette tip to a diameter of approximately 1-2 mm. Slowly triturate the cell suspension using progressively smaller and smaller diameter pipette tips, until you can easily pipette the solution through an unaltered P1000 pipette tip. Immediately move to a smaller tip once you can easily pipette the tumor solution through the tip – do not over triturate the sample. If a single larger piece of tissue blocks aspiration during trituration, tapping the pipette tip on the bottom of the conical tube often allows continued trituration.\n5. Cell Plating\nOne 0.5 mm3 fragment of tissue is enough to seed 1 x 100 mm dish, or 4 x 8-well/4-well slides. Just prior to adding the media/cell mixture, remove the laminin solution from the culture plates but do not let the plates dry.\nFor each 100 mm dish, dissolve the tumor fragment in 10 ml warmed culture media.\nFor each well of a 4-well slide, use 750 μl warmed culture media (3 ml for the whole slide).\nFor each well of an 8-well slide, use 400 μl warmed culture media (3.2 ml for the whole slide).\nIncubate the cultures in 37 °C, 100% humidity, 6% CO2. Leave the cultures alone for at least 36 hours, and then change the media if the solution is yellowed (acidic). Otherwise change the media at 72 hr, then every 2-3 days or when the media become acidic. If the media becomes acidic daily for several days in a row, this is generally an indication of potential bacterial or yeast contamination.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}