{
  "id": 7666,
  "origin_website": "Bio",
  "title": "Co-differentiation and Co-maturation of Human Cardio-pulmonary Progenitors and Micro-Tissues from Human Induced Pluripotent Stem Cells",
  "procedures": [
    "Matrigel Coating Note: All steps are performed under class II biological safety cabinet, unless otherwise stated. Thaw a -80 °C aliquot of Matrigel (100 µL) by placing it in a 4 °C fridge for 1 h.Prepare the 1% (v/v) working solution by diluting the thawed Matrigel (100 µL) in 10 mL of DMEM/F12.Add the Matrigel working solution into each well of the desired multi-well plate: 100 µL for the 96-well plate format, and 1.5 mL for the 6-well plate format.Incubate the plate at 37 °C for at least 3 h.Prior to use, aspirate the diluted Matrigel solution and use without washing the well.BU3-NGST cell maintenance and passaging Note: All steps are performed under class II biological safety cabinet, unless otherwise stated. Prior to cell passaging, coat the wells of a 6-well plate with 1% (v/v) Matrigel for at least 3 h at 37 °C.Remove mTeSR-Plus from Day 5 sub-confluent BU3-NGST cultured on a 6-well tissue culture plate and wash twice with 4 mL of DPBS.Add 2 mL of ReLeSR and incubate for 15 s. Remove the ReLeSR and incubate the cells at 37 °C for an additional 5 min.Collect the cells by adding 2 mL of fresh mTeSR-Plus and centrifuge at 300× g for 3 min.Discard the supernatant and resuspend the cells in 1 mL of fresh mTeSR-Plus.Passage the cells at ratios of 1:10 to 1:20.Replenish 2 mL of mTeSR-Plus medium on Day 2, and 4 mL of medium on Day 4.Normally, cells will be ready to passage again on Day 5.Plating of BU3-NGST for differentiation Note: All steps are performed under class II biological safety cabinet, unless otherwise stated. The following steps describe the procedure for obtaining dissociated cells from one well of a 6-well plate.",
    "Prior to cell plating, coat the wells of a 96-well plate with 1% (v/v) Matrigel for at least 3 h at 37 °C.Remove mTeSR-Plus from Day-5 sub-confluent BU3-NGST (Figure 1A) cultured on a 6-well tissue culture plate and wash twice with 4 mL of DPBS.To dissociate the hiPSCs into single cells, add 3 mL of pre-warmed Accutase (avoid repeating the freeze-thaw cycle), and incubate for 5 min at 37 °C. Transfer dissociated BU3-NGST into 3 mL of fresh mTeSR-Plus and centrifuge at 300 × g for 3 min.Discard supernatant and resuspend the cell pellet with 1 mL fresh mTeSR-Plus supplemented with 10 μM Y27632. Gently pipette up and down 10 times to break the cell pellet into single-cell suspension.Perform cell counting using a hemacytometer by diluting the cells in Trypan Blue at ratio 1:2.Plate 150,000 cells/cm2 per well in 100 μL of mTeSR-Plus supplemented with 10 μM Y27632 (Figure 1B).Note: The cells will be ready for differentiation the following day.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4488/bioprotoc-12-16-4488-g001.jpgFigure 1. Undifferentiated iPSCs in culture. A. Undifferentiated hiPSC colony. B. hiPSCs after one day of single-cell plating (scale bars = 200 μm).Differentiation from hiPSCs to human cardio-pulmonary progenitors Note: All steps are performed under class II biological safety cabinet unless otherwise stated. The following steps describe the procedure for differentiating hiPSCs from one well of a 96-well plate. On the day of induction (Day 0, one day after single-cell plating), remove cell culture medium and add 200 μL of 7 μM CHIR99021 in mTeSR-Plus supplemented with 10 μM Y27632. Refresh the medium on Day 1.Note: The CHIR99021 concentration required for effective and balanced cardio-pulmonary induction can be cell line dependent. Perform optimization of CHIR99021 concentration as needed. On Day 2, remove the medium and wash the culture twice with 200 μL pre-warmed RPMI-1640.",
    "Add 100 μL pre-warmed medium (composed of RPMI-1640, 1× GlutaMAX, 1× B27 minus insulin, 10 μM Y27632, and 1% Pen/Strep). Refresh the medium on Day 3.Note: Check for cell viability at this stage. Massive cell death will lead to poor co-differentiation outcome. On Days 4–7, remove the medium and add 100 μL of pre-warmed medium supplemented with 1 μM A83-01 and 5 μM IWP4. Refresh the medium daily.On Day 8, remove the medium and wash the culture once with 100 μL pre-warmed RPMI-1640. During Days 8–14, add 100 μL of pre-warmed medium (composed of RPMI-1640, 1× GlutaMAX, 1× B27 complete, and 1% Pen/Strep) supplemented with 3 μM CHIR99021 and 100 nM retinoic acid, and refresh the medium daily. Note: The appearance of NKX2.1-GFP, which indicates early lung progenitors, can be observed from Day 10 onwards (Figure 2A).  To assess the co-differentiation efficiency, fix the differentiated human cardio-pulmonary progenitors on Day 15, and check for cardiac (NKX2.5) and pulmonary (NKX2.1) markers using immunocytochemistry (Figure 2C–2D) (see section G). Quantify NKX2.1-GFP lung progenitor efficiency on Day 15 by flow cytometry (Figure 2B) (see section H).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4488/bioprotoc-12-16-4488-g002.jpgFigure 2. Characterization of the co-induced human cardio-pulmonary progenitors. A. GFP expression indicating NKX2.1-expressing pulmonary progenitors (scale bar = 125 μm). B. Quantification of NKX2.1-GFP lung progenitors on Day 15 by flow cytometry. C, D. Immunofluorescence staining of NKX2.1 (pulmonary) and NKX2.5 (cardiac) (scale bars for panel C = 250 μm; scale bars for panel D = 125 μm).Generation of human cardio-pulmonary microtissues (μTs) On Day 15, trypsinize at least 3 wells (96-well plate format) of the human cardio-pulmonary progenitors using 100 μL TrypLE Express and incubate at 37 °C for 15 min.Neutralize the TrypLE Express by adding 200 μL RPMI-1640 supplemented with 10% FBS.Centrifuge at 300 × g for 3 min.",
    "Resuspend the cell pellet in alveolar maturation medium (comprising RPMI-1640, 1× GlutaMAX, 1% Pen/Strep, 1× B27 complete, 3 μM CHIR99021, 10 ng/mL KGF, 50 nM dexamethasone, 0.1 mM cAMP, 0.1 mM IBMX, and 10 μM Y27632).Plate 500k cells into one well of an ultra-low adhesion 24-well plate in 500 μL of alveolar maturation medium and incubate on an orbital shaker at 125 rpm to generate μTs.On Day 16, perform full medium change with alveolar maturation medium without 10 μM Y27632. Tilt the plate at a small angle to collect all μTs at one corner, then carefully aspirate and remove the majority of medium without losing the μTs. Refresh the medium on Day 17.On Day 18, check for SFTPC-TdTomato using a fluorescence microscope (Figure 3).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4488/bioprotoc-12-16-4488-g003.jpgFigure 3. Formation of human cardio-pulmonary μTs. Alveolar type 2 cell maturation identified through the emergence of SFTPC-TdTomato fluorescence signal on Day 17; the signal becomes stronger on Day 18 (scale bars = 125 μm).Segregation of human cardio-pulmonary μTs On Day 18, transfer one μT from the ultra-low adhesion 24-well plate into each well of an ultra-low adhesion 96-well plate.Note: The μTs are visible to the naked eye. By inserting a 100 μL pipette tip close enough to the μTs, one can transfer a single μT from the well. Examine under the microscope to confirm. Replace the medium with alveolar maturation medium without CHIR99021 or Y27632.On Days 19–23, add 20 μL of cell culture water into each well to compensate medium evaporation and incubate for at least 10 min to allow complete mixture.Note: Evaporation of the culture medium is inevitable. This step is crucial to prevent salt from accumulating over time in the culture medium following evaporation. Remove 50 μL of medium and replenish with 50 μL of fresh medium.",
    "On Day 23, look for segregated pulmonary μTs expressing GFP and contracting cardiac μTs (Figure 4).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4488/bioprotoc-12-16-4488-g004.jpgFigure 4. Segregation of human cardio-pulmonary μTs. μTs before and after segregation (scale bars = 125 μm). Schematic diagram adapted from Ng et al. (2022).Immunocytochemistry Note: The following steps describe the staining protocol for cells plated on one well of a 96-well plate. Fix cells with 100 μL of ice-cold methanol for 20 min.Discard methanol and air-dry the samples for at least 1 h.Note: Complete air-dried samples can be rehydrated in PBS and kept at 4 °C for up to a week prior to immunocytochemistry staining. Insufficient air-drying may compromise staining outcome. Permeabilize cells with 1% (v/v) Triton X-100 in PBS at room temperature for 20 min.Discard the permeabilization buffer and wash three times with PBS.Block the cells with 1% BSA diluted in PBS for 30 min at room temperature.Prepare working stocks of primary antibodies by dilution in 1% BSA (in PBS). See Table 1 for recommended primary antibodies and their working dilutions for each cell type.Incubate the cells in 30 μL of primary antibodies overnight at 4 °C.Wash the cells three times with PBS, add 30 μL of secondary antibodies diluted in 1% BSA (in PBS), and incubate at room temperature for 1 h. See Table 1 for recommended secondary antibodies and dilutions.Wash three times with PBS and leave 300 μL of PBS in the well following the final wash. The cells are then ready for imaging.Table 1. Antibody dilution table:",
    "﻿0,1\nAntibody,Dilution\nAnti-NKX2.1 (rabbit monoclonal),1:500\nAnti-NKX2.5 (goat polyclonal),1:500\n\"Donkey anti-rabbit IgG (H+L), Alexa Fluor 488\",1:500\n\"Donkey anti-goat IgG (H+L), Alexa Fluor 647\",1:500\nFlow cytometry Dissociate Day 15 co-differentiated cells in TrypLE Express for 15 min at 37 °C.Neutralize TrypLE Express using RPMI-1640 supplemented with 10% FBS and centrifuge at 300 × g for 3 min.Discard supernatant and resuspend cells in incubation medium (composed of DPBS and 1% FBS).Analyze the percentage of cells expressing GFP using BD FACSAria II."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}