{
  "id": 4016,
  "origin_website": "Cell",
  "title": "Low-cost synthesis of peptide libraries and their use for binding studies via temperature-related intensity change",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPeptide synthesis\nTiming: 5–14 days\nThe automated peptide synthesis in the MultiPep 2 robot follows a standard Fmoc chemistry procedure. Timing may vary strongly based on the length of the desired peptides.\nSet up the MultiPep 2 synthesizer to carry out the steps described in Table 1[href=https://www.wicell.org#tbl1] until the desired peptides are generated.\ntable:files/protocols_protocol_731_3.csv\nAll concentrations are given as final.\nThe synthesis method can be adjusted in the “Methods” section of the program (Figure 5[href=https://www.wicell.org#fig5]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/731-Fig5.jpg\nFigure 5. Methods settings in the MultiPep 2 – CelluSpots software\nPreparation, Cycle and Finalization steps (left) and schematic depiction of the robot tray (right).\nNote: We generally recommend performing three coupling steps for each aa and two Fmoc-deprotection steps, independently of parameters such as peptide sequence or length. The upper limit of the coupling time is determined by the evaporation of the reaction mix. Here, we use 1.2 μL, which allows for coupling times of up to 30 min.\nCritical: Change the DIC, Oxyma Pure and Ac2O solutions every 48–72 h. This also goes for aliquots of Fmoc-Phe, Fmoc-Pro and Fmoc-His, which tend to form percipitates upon evaporation of the solvents.\nFinalize the synthesis with the steps described in Table 2[href=https://www.wicell.org#tbl2].\ntable:files/protocols_protocol_731_4.csv\nPeptide work-up\nTiming: 6 h\nSide chain deprotection and concomitant cleavage are performed with TFA and scavengers. The disks must be fully dried before deprotection is started.\nPrepare cleavage and sidechain-deprotection mix.\n90% TFA, 2% dichloromethane (DCM), 5% H2O, 3% triisopropylsilane (TIPS).\nPrepare a 10% excess to account for evaporation.\nMix well and gradually release the pressure from the bottle.\nAdd 150 μL cleavage and sidechain-deprotection mix to each well with a stepper-pipette.\nMake sure to properly cover the disks as they may adhere to the side of the deepwells due to electrostatic attraction.",
    "Incubate the disks on an orbital shaker at 1,000 rpm for 3 h.\nTransfer the solution to new 96-deepwell plates.\nWhen multichannel pipettes are used, we recommend the use of filtered tips to avoid internal damage.\nAdd 700 μL ice cold ether per well to precipitate the peptides.\nIncubate the deepwell plates at −20°C for 8 h.\nCentrifuge the plates at 2,000 × g for 30 min and 4°C.\nCritical: Check if a pellet is visible in the deepwells. Depending on the amount of peptide prepared, an additional centrifugation at 2,000 × g for 30 min might be necessary. Handle gently to avoid discarding the peptide pellets along with the supernatant.\nGently discard the supernatant and again, add 700 μL ice cold ether to each well.\nAgitate the plates on a vortex mixer to fully dispense the pellet.\nCentrifuge the plates at 2,000 × g for 30 min and 4°C.\nGently discard the supernatant and let the ether evaporate in a fume hood for 15 min or until the pellet is visibly dry (Problem 3).\nPause Point: Cleaved peptides may be stored at −20°C for at least one month. For storage, close the 96-deepwell plates with silicone sealing mats.\nQuality control by LC-MS\nTiming: 8 h\nTo assess the peptide purity after synthesis, which may vary depending on peptide length and sequence, we recommend conducting liquid chromatography coupled to mass spectrometry (LC-MS) measurements of control peptides (Schulte et al., 2020[href=https://www.wicell.org#bib12], Moreno-Yruela et al., 2020[href=https://www.wicell.org#bib10], Sereikaite et al., 2019[href=https://www.wicell.org#bib14]) (see 18). Alternatively, matrix-assisted laser desorption-ionization-time of flight (MALDI-TOF) mass spectrometry can be performed to determine peptide purity.\nTransfer the disks with the quality control peptides to an individual reaction tube.",
    "Add 150 μL of cleavage and sidechain-deprotection mix to each reaction tube and incubate in a thermoshaker at 1000 rpm for 2 h at ambient conditions.\nTransfer the cleavage and sidechain-deprotection mix to new reaction tubes.\nAdd 1 mL of ice-cold ether to each reaction tube and incubate for 2 h at −20°C\nCentrifuge the reaction tubes at 15,000 × g and 4°C for 15 min.\nCritical: Check if a pellet is visible (Problem 3) in the reaction tubes and handle the tubes carefully to not disturb the pellet.\nDiscard the supernatant and add 1 mL of ice cold ether\nVortex the reaction tubes thoroughly and centrifuge again at 15,000 × g and 4°C for 15 min\nDiscard the supernatant and repeat the washing step as before.\nLet the ether evaporate in a fume hood for 15 min or until the pellet is visibly dry.\nDissolve the peptide by adding 100 μL of a buffer consisting of 49.95% H2O, 49.95% acetonitrile and 0.1% formic acid and incubating in a thermoshaker at 1000 rpm for 1 h at ambient conditions.\nFilter the peptide solution through a 0.45 μM pore-size PVDF filter and use for LC-MS purity assessment.\nNote: Depending on the LC-MS or MALDI-TOF system available, sample preparation may need to be varied.\nTRIC measurements\nTiming: 1 day\nWhile in most cases, TRIC measurements are conducted using fluorescently labeled proteins (Asmari et al., 2018[href=https://www.wicell.org#bib2]), we present a protocol for quasi-label free measurements using a fluorescent tracer, which prevents the need to fluorescently label the protein of interest.\nWhen employing a fluorescently labeled target, it is critical to determine the stability of the labeled protein before performing the TRIC assay and to potentially adjust the parameters such as the labeling strategy or the assay buffer (Toseland, 2013[href=https://www.wicell.org#bib16]).",
    "Add 50 μL/well TRIC assay buffer to the 96-well plates containing the dried peptides.\nShake the 96-well plates for 1 h at ambient conditions to solubilize the peptides.\nNote: Solubility can differ substantially between different peptides in your library, so the time for solubilization might need to be adjusted.\nCentrifuge the 96-well plate at 1,000 × g for 15 min to remove precipitate.\nDetermine the concentration of each peptide using a NanoDrop (Thermo Fisher Scientific).\nPeptide concentrations can be easily quantified using the Scopes method (Scopes, 1974[href=https://www.wicell.org#bib13]). We furthermore recommend to account for peptide sequence-specific differences in absorbance (https://spin.niddk.nih.gov/clore/[href=https://spin.niddk.nih.gov/clore/]) (Anthis and Clore, 2013[href=https://www.wicell.org#bib1]). Peptide concentrations may further be determined by high performance liquid chromatography (HPLC).\nUsing a liquid handling robot, transfer the peptide solutions with known concentration into a conventional 384-well plate. In this case we used a PrecisionXS liquid handling system (Biotek).\nAt this point, a dilution step can be implemented to adjust the concentration of your peptides in accordance to the expected KD value of the interaction between the peptides and the target protein. We diluted our library of unlabeled peptides 2:1 in TRIC assay buffer.\nCritical: Depending on the type of assay to be conducted, transfer the peptides either along a 12-point serial dilution to perform a dose response (Dose response affinity determination) or at equal concentrations for single-dose measurements (Single-dose screening).\nNote: TRIC can resolve affinities ranging from low picomolar to millimolar dissociation constants. The resolvability of weak affinities is only limited by the solubility of the titrated molecule at high concentrations. Resolving strong affinities in the picomolar range is limited by the affinity of the fluorescently labelled tracer in displacement assays.",
    "Critical: The affinity between tracer and target must first be determined in a 1:1 binding experiment in order to derive Ki values from dose response experiments and furthermore to determine the optimal concentrations of tracer and target. In our case, a KD value of 1.54 nM was determined, based on which we employed the target protein and fluorescent tracer at a concentration of 20 nM and 10 nM, we generally recommend using a low nanomolar concentration of tracer and a concentration of target protein of 1–2×KD (of the tracer-protein complex). The lower end of the affinity range that can be resolved will approximately correspond to the KD of the tracer-protein complex, the higher end will be limited by the concentration of the protein target. Interestingly, opposite to common assumption, high-affinity tracer molecules do work well for competition assays (Huang, 2003[href=https://www.wicell.org#bib6]). The higher the affinity of the tracer, the broader the range of affinities that can be resolved in competition assays. However, high affinities are usually associated with slow binding kinetics. Hence, long incubation times are recommended for tracer molecules with low nanomolar to picomolar affinities to the protein target. A simple control experiment, where the labelled tracer is displaced by the same unlabeled ligand molecule, can be used to test if a system reaches equilibrium after selected timepoints.\nUsing a liquid handling robot, mix the unlabeled peptide ligands with the pre-incubated tracer-target complex solution in a 384-well Dianthus plate and incubate at 4°C.\nAdjust the incubation time of the tracer with the unlabeled ligand, depending on the expected kinetics of the studied protein-peptide interaction. In our case, incubation was performed for 16 h to ensure the system had sufficient time to reach kinetic equilibrium.",
    "Immediately before measuring, centrifuge the 384-well Dianthus plate at 1,000 × g for 30 sec. (Problem 4)\nSet the set temperature of the Dianthus NT.23 PicoDuo system to 25°C and ensure that the prepared plate has sufficient equilibration time to also reach 25°C. This step ensures temperature homogeneity of all wells during the 30 min read time required to measure one full plate.\nNote: Assay temperature should be adjusted according to the protein-peptide interaction of interest, specifically the proteins thermal stability.\nPerform the measurement with optimal parameters. Parameters should be selected depending on characteristics of the fluorophore and interaction type.\nDepending on the concentration of fluorescent tracer molecule, the LED power of the instrument should be set to reach between 10,000 and 15,000 counts for the reference sample.\nNote: While performing a screen, the setting should not be set to auto but given a fixed value that is consistent for all plates measured in one screen.\nThe IR-LASER on-time should be selected based on the assay development measurements. For most assays, an on-time of 5 sec is recommended. Only for large assays with many ligands, an on-time of 3 sec is recommended to reduce measurement time and increase throughput.\nData analysis (single-dose screening)\nTiming: 30 min\nIn DI.Control, a reference ID is assigned to each well of the measured assay.\nNote: References (target-only) controls are needed to compare the signal obtained in presence of various ligands. We generally recommend placing references according to the liquid handling system used. In the present case, a 4-channel STARlet system (Hamilton) was used. Hence, references were placed in each pipetted row in duplicate and ligand wells were always grouped with references that were prepared with the same pipettor.\nAll relevant files are loaded into DI.ScreeningAnalysis and the relevant experiments are selected (Figure 6[href=https://www.wicell.org#fig6]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/731-Fig6.jpg",
    "Figure 6. DI.ScreeningAnalysis single-dose screening\n(A) In the “data” section of the program, datasets can be selected and statistical parameters for hit identification (Z-score value) may be customized.\n(B) In the “reference” section, reference measurements may be manually inspected.\n(C) the “ligands” section allows to inspect each measured datapoint and manually exclude datapoints.\n(D) In the “summary” section, overviews are automatically generated and analyzed datasets may be exported.\nOn DI.ScreeningAnalysis’ data page, depending on the statistical variation of the references, the standard hit threshold of the 3-fold global standard deviation of references can be modified. In this assay we selected a z-score (i.e., multiplication factor) of 7 (Figure 6[href=https://www.wicell.org#fig6]A, Problem 5).\nWe recommend a manual inspection of all references in an assay to identify reference samples that have an aggregation bias that was not noticed by the automatic algorithms of the software (Figure 6[href=https://www.wicell.org#fig6]B). This manual inspection is easily done on the reference page in DI.ScreeningAnalysis. Such reference samples can be manually excluded.\nThe automatically sorted ligands can be manually investigated on the ligands page in DI.ScreeningAnalysis. Sorting of ligands into different categories (such as hit, non-binder or aggregation) by the software algorithms can be manually overwritten by the user if necessary (Figure 6[href=https://www.wicell.org#fig6]C).\nThe batch data export on the summary page in DI.ScreeningAnalysis can now be used to export a list of ligands in user-selected categories for further investigation e.g., in a dose-response experiment (Figure 6[href=https://www.wicell.org#fig6]D).\nData analysis (dose responses)\nTiming: 30 min\nIn Di.Control, a dilution series ID is assigned to each well of a measured dataset. That way wells are grouped as one single dilution series for further analysis.",
    "On the ligands page in DI.ScreeningAnalysis, select the “use merge sets” function that merges replicates of dilution series of the same ligand, depending on the ligand name. Dilution series are then shown as merged data sets that are approximated by a global fit to all datapoints (Figure 7[href=https://www.wicell.org#fig7]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/731-Fig7.jpg\nFigure 7. DI.ScreeningAnalysis dose-response\n(A) In the “ligands” section, the “merge sets” feature can be used to merge replicate datasets for analysis. Furthermore, the “use hill-fit” feature should be applied accordingly to the experimental setup. Additionally, individual datapoints may be manually inspected.\n(B) In the “summary” section, overviews are automatically generated, and analyzed datasets may be exported.\nDepending on the assay conditions, select or deselect “use Hill fit” (Figure 7[href=https://www.wicell.org#fig7]A).\nNote: The Hill fit is only recommended for competition assays or assays with known cooperativity. For direct binding of one ligand to one target molecule, the function is deselected and a law of mass action-based KD fitting algorithm is commonly used.\nWe recommend manual inspection of all ligands for smaller datasets to review software decisions, such as aggregation or ligand-induced quenching (Figure 7[href=https://www.wicell.org#fig7]A).\nUse the batch export on the summary page of DI.ScreeningAnalysis to export vector graphics of dose-response plots and raw-data values and fit parameters in a tabular format for further use (Figure 7[href=https://www.wicell.org#fig7]B)."
  ],
  "subjectAreas": [
    "Molecular/Chemical Probes",
    "Biophysics",
    "Biotechnology And Bioengineering",
    "Protein Biochemistry",
    "High Throughput Screening"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}