{
  "id": 19450,
  "origin_website": "Jove",
  "title": "Transplantation of Human Stem Cell-Derived GABAergic Neurons into the Early Postnatal Mouse Hippocampus to Mitigate Neurodevelopmental Disorders",
  "procedures": [
    "All experimental procedures were approved by the Malmö/Lund Animal Research Ethics Board, ethical permit number 12548-19, and conducted in agreement with the Swedish Animal Welfare Agency regulations and the EU Directive 2010/63/EU for animal experiments. C57BL6/J and Contactin-associated protein-like 2 (Cntnap2) knock-out (KO) mice, both males and females, were used at postnatal day (P) 2 for the present study. Human embryonic stem cells (hESCs) were used. The animals and stem cells were obtained from commercial sources (see Table of Materials).\n1. Generation of the hdIN precursors\nNOTE: All the steps in this section are done in a cell culture hood. The hESCs were maintained as feeder-free cells on coated plates using a stem cell culture medium and passaged as colonies.\nPerform forward programming of the hESCs to hdIN precursors (Figure 1).\n\tNOTE: The forward programming approach is based on the procedure described in Gonzalez-Ramos et al.8 and Yang et al.9.\n\t\nTransduce the hESCs with lentiviral vectors containing the Tet-On system in a fresh stem cell culture medium containing 10 µM of ROCK inhibitor (RI) (see Table of Materials). Keep at 37 °C in the incubator.\nChange the medium to a fresh stem cell culture medium 16 h after transduction and maintain the transduced cells in the same way as the non-transduced hESCs.\nWhen confluent, detach the hESCs as single cells using a cell detachment solution (see Table of Materials) and plate them in coated 6-well plates at a density of 3 x 105 cells/well in stem cell culture medium containing 10 µM of RI on day in vitro (DIV) −1.\nAt 1 DIV, replace the culturing medium with N2 medium containing 2 g/L of doxycycline (DOX, see Table of Materials).",
    "NOTE: DOX is used to induce transgene expression of Ascl1 and Dlx29, from 1 DIV to 7 DIV, and then continues in vivo by its addition to the drinking water25.\nAt 2 DIV, an antibiotic resistance selection period starts that will last until 5 DIV. Add puromycin (puro) and hygromycin (hygro) to the fresh medium (see Table of Materials). Change the medium on 2 DIV, 4 DIV, and 5 DIV.\n\t\tNOTE: Optimize the concentrations of puro and hygro before the differentiation protocol using transduced and non-transduced hESCs to ensure the survival of only the cells carrying the antibiotic resistance cassettes. In this protocol, 0.5 µg/mL of puro and 750 µg/mL of hygro were used.\nAt 5 DIV, the antibiotic selection period ends. Change to N2 medium supplemented with 2 g/L of DOX and 4 µM of cytosine β-D-arabinofuranoside (Ara-C, see Table of Materials).\nimgsrc://cloudfront.jove.com/files/ftp_upload/64272/64272fig01.jpg\nFigure 1: Generation of hdIN precursors from hESCs by overexpressing Ascl1 and Dlx2. (A) Schematics of the differentiation protocol used for the generation of hdIN precursors. (B-E) Immunocytochemistry of hdIN precursors at 7 DIV for (B) the neuronal marker MAP2, (C) the proliferative marker Ki67, (D) general nuclear staining, and (E) a merge of the previous markers. Scale bar: 50 µm. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/64272/64272fig01large.jpg]\n2. Preparation of the single-cell suspension for transplantation\nNOTE: All the steps in this section are done in the cell culture hood. On 7 DIV, hdIN precursors are dissociated and used for transplantation.\nPerform detachment of the cells following the steps below.\n\t\nRemove the medium and carefully rinse the cells with DPBS without calcium and magnesium.\nAdd 400 µL of the cell detachment solution (see Table of Materials) to each well of the 6-well plate.",
    "NOTE: Ensure the coverage of the whole surface by the solution.\nIncubate for 2-3 min at 37 °C in the incubator until the border of the cells starts to look shiny, indicating enzymatic degradation of cell surface proteins and detachment from the well surface.\n\t\tNOTE: To increase cell survival, do not wait too long when all the cells are completely detached and floating around.\nThen, add 600 µL of fresh N2 medium to each well of the 6-well plate to stop the enzyme, and mechanically with the pipette, help to detach the cells to obtain a single-cell suspension.\nTransfer the cell suspension to a plastic tube (15 mL) and centrifuge at 180 x g for 4 min at room temperature (RT).\nPerform resuspension of the cells.\n\t\nDiscard the supernatant using a vacuum system (carefully, without disturbing the pellet) and resuspend the pellet in the transplantation medium containing 10 µM of RI, 1 µg/mL of DNase, and 2 µg/µL of DOX.\nCount the total cells in the suspension using a counting chamber and a manual cell counter and adjust the volume to a final concentration of 100,000 cells/µL.\nKeep the cell suspension in a closed tube on ice until transplantation for a maximum of 4 h.\n\t\tNOTE: The transplantation has to be performed on the same day as the preparation of the cell suspension (7 DIV).\n3. Intrahippocampal cell transplantation\nNOTE: All the steps in this section are performed outside the cell culture hood in the animal facility. Early postnatal transplantation of cells into the brain was performed on P2, considering P0 the day of birth.\nPrepare for the transplantation experiment following the steps below.\n\t\nAutoclave all the surgical material or, if not possible, sterilize with another approved method.",
    "Mount the injecting syringe in the holder without any glass capillary. Rinse the needle with water.\n\t\tNOTE: The needle must be 33 G.\nCurve 90° the tip of a 30 G insulin needle.\nCreate a homemade Play-Doh-like stage for positioning the pup with the head flat (Figure 2A).\nFetch the mice cage with the mother and pups before preparing anything for the surgery to allow them to acclimatize to the new environment.\nPrepare a tray with wet ice and an empty cage with some paper for the isoflurane.\nAnesthetize the mouse pup.\n\t\nSoak a piece of paper with isoflurane (see Table of Materials) and place it inside the empty cage. Carefully take one pup and place it into the cage with the paper soaked in isoflurane.\n\t\tNOTE: Never leave less than three pups with the mum. Do not exceed 20-30 s of isoflurane anesthesia, or the pup may die.\nVerify the effect of the anesthesia by movement cessation.\nImmediately after anesthesia, place the pup onto a wet tissue on the surface of wet ice. Keep the animal on ice for 3 min until the upper limbs become whiteish (Figure 2B, blue arrow). This usually takes 2-3 min.\nUse this time for loading the syringe with the cell suspension. Resuspend the cells carefully with a pipette before.\nPlace the pup on the stereotaxic frame. Use the ear bars in the opposite direction (Figure 2A, magenta arrows).\n\t\tNOTE: The back side of the ear bars is less pointy, and as P2 pups do not have ears, use the flatter side to avoid hurting the animal.\nFrom the side, check if the head is straight. The head must be flat; use the Play-Doh-like stage to adjust for that.",
    "NOTE: Pups at this age have not yet opened their eyes, so no additional step in this regard needs to be done. Pups do not have fur at this age, so no shaving of the area is required. No specific pain treatment is given as it is not an open incision to the skin, and no suturing is involved.\nKeep the pup covered on ice (on top of tissue paper) for the entire duration of the surgery.\n\t\tNOTE: Do not place the ice in direct contact with the pup's skin.\nPerform the injection.\n\t\nClean the surface of the skin using a soft tissue soaked in ethanol.\nIdentify lambda and set the coordinates to zero on the digital display console of the stereotaxic instrument (Figure 2C, yellow dashed line). Sagittal and lambdoid sutures are easily visible by the eye, since they are vascularized, as red lines.\n\t\tNOTE: If experiencing difficulties visualizing lambda, place a small piece of ice on the skin and wait a couple of minutes for it to cool down. Then, remove the piece of ice, and the subtle whitening of the skin will allow you to visualize.\nRelocate the injection needle to the desired coordinates. In the described protocol, the targeted region was the hippocampus, and the coordinates were as follows: anterior-posterior (AP) +0.85 and medio-lateral (ML) +1.35.\nUse a 90° bent insulin needle to penetrate the skull and create a tiny hole.\nBring down the injection needle until it has crossed the skull, and zero the dorso-ventral (DV) coordinates. Lower the needle until the desired DV coordinates. In the described protocol, the coordinates were DV −1.1.\nInject according to the predetermined time intervals.",
    "NOTE: In the described protocol, the exact timings were the following: (i) after going down to the DV coordinate, wait 3 min, (ii) inject 1 µL of volume for 5 min, and (iii) after all the volume has been injected, wait 3 min.\nRetract the needle slowly.\nEnd the procedure.\n\tNOTE: The surgery cannot last more than 15 min to ensure the pup's survival and avoid any damage derived from the anesthesia by hypothermia.\n\t\nWarm up the pup with the hands until it starts moving before giving it back to the mother.\nGive DOX at a concentration of 1 mg/mL in 0.5% sucrose solution as drinking water for at least 2 days before and 3 weeks post transplantation (PT) to continue the cell differentiation in vivo.\nimgsrc://cloudfront.jove.com/files/ftp_upload/64272/64272fig02.jpg\nFigure 2: Stereotaxic transplantation in newborn mice pups at P2. (A) A Play-Doh-like stage for holding the pup's body in position and inverted ear bars (magenta arrows). (B) White front paw (blue arrow) indicative of the reduced blood flow in that area so that the pup is experiencing anesthesia by hypothermia. (C) Overview of the setup with the pup already covered by ice over the soft tissue paper. (c#) Closed-zoom of the head of the pup, with the injection needle already inserted into the brain (yellow dashed line indicating lambda and lambdoid sutures). This figure is adapted from Gonzalez Ramos et al.27. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/64272/64272fig02large.jpg]"
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}