{
  "id": 16973,
  "origin_website": "Jove",
  "title": "A Modified Eggshell Technique for Sclerosing Thoracic Disc Herniation",
  "procedures": [
    "This protocol has received approval and adheres to the guidelines established by The Ethics Committee of Hebei Medical University Third Hospital. Patient data were collected after obtaining informed consent from them. The inclusion criteria for patients were as follows: patients suffering from symptoms of spinal cord damage with ineffective conservative treatment, the presence of hardened tissue observed on X-ray, computer tomography (CT), and magnetic resonance imaging (MRI) on the ventral side of the spinal cord, and complete clinical data with regular follow-ups. Patients with coexisting contraindications such as infection or tumor, or those unable to tolerate the operation, were excluded from the surgery. The surgical tools and equipment used for this study are listed in the Table of Materials.\n1. Preoperative preparation\nAllow the patient to fast for 6 h and proceed with anesthesia via endotracheal intubation20 following institutionally approved protocols.\nPosition the patient in the prone position.\nPerform a double disinfection of the surgical area using povidone-iodine, followed by two rounds of alcohol. Place sterile sheets to cover the surgical site.\nMark the positions for surgical incisions with a marker. Place a Kirschner needle horizontally and perpendicular to the spine on the surgical area. Verify the needle placement using a C-arm fluoroscope.\n2. Exposing the surgical site\nMake an incision along the posterior midline of the designated surgical site, approximately 10 cm in length. Successively expose the skin, subcutaneous tissues, and paraspinal muscles. Completely expose the upper and lower vertebral segments20.\nCarefully peel the soft tissue away from the bone surface to prevent damage to the intercostal nerve, arteries, and veins. Expose the bony protrusion of the spine, both above and below, as well as the joints.\n3. Inserting pedicle screws",
    "Insert pedicle screws into the decompression section of the spinal column. Identify the intersection of the vertical line of the lateral margin of the pedicle and the midline of the transverse process as the location for inserting pedicle screws.\nUse a rongeur to remove part of the cortical bone from the articular process where a pedicle screw is to be inserted. Establish the pathway of a pedicle screw using an awl, then use a probe to confirm the integrity of the pedicle pathway and measure the length of the pedicle screw pathway. Insert the pedicle screw into this pathway.\nVerify the suitability of the pedicle screw instrumentation using intraoperative fluoroscopy20. Ensure that the pedicle screws remain within the pedicle pathways, avoiding extension beyond the anterior edge of the vertebrae and surpassing the central axis of the spinal column. This indicates the appropriate location of the pedicle screws.\n4. Posterior decompression\nUse lamina forceps to extract the bone situated at the intersection of the vertebral lamina and the inner side of the pedicle. Employ the uncover technique to eliminate the spinous process and lamina20.\nRemove the bilateral facet joints using a rongeur to fully expose the dura mater and spinal cord (see Figure 1A and Figure 2A).\n5. Modified eggshell technique\nUse a clamp to remove the vertebral body corner and cut open the annular fibrosis with a No. 11 scalpel blade.\nHollow out the intervertebral disc by extracting the disc tissue from the intervertebral space, retaining only the anterior and a portion of the lateral section of the annulus (see Figure 1B and Figure 2B).",
    "Employ a nerve retractor crook or hook blade to detach the adhesion between the herniated calcified disc and dura mater. Subsequently, use a reverse-angled curette to push the hardened disc tissue into the anterior intervertebral space (see Figure 1C and Figure 2C).\n\tNOTE: This procedure is known as the \"modified eggshell procedure,\" and the surgical tools used are depicted in Figure 3.\nUtilize a curved clamp to remove the hardened disc tissue.\nTo detach the hardened disc from surrounding tissues, use a grinding drill to remove the hardened tissues. If the adhesion between the hardened tissues and spinal dura mater is severe and poses a risk, consider making it 'floating' rather than attempting a risky removal.\n6. Strengthening the stability of the spine\nFill the cages with bone harvested from the spinous, lamina, and articular processes.\nImplant a cage vertically on both sides into the intervertebral space, maintaining a minimum distance of 0.5 cm between the back edge of the cage and the back edge of the vertebral body.\nSecure the pedicle screw-rod system in its current position. Press the pedicle screws longitudinally along the rod and secure the rods with nuts. Prevent any minor alteration in curvature following decompression and minimize harm to the spinal cord (see Figure 1D and Figure 2D).\n7. Suturing the incision\nCheck for bleeding and completely stop it using electrocautery.\nThoroughly clean the incision with saline. Insert a drainage set.\nSuture the incision layer by layer. Use an absorbable suture No.7 for the fascia layer, an absorbable suture No.4 for the subcutaneous tissues, and a silk suture No.4 for the skin.\n8. Postoperative procedures\nAdminister preventive antibiotics to patients for 2 days following the operation.\nPrescribe bed rest for 1 week.",
    "Initiate ambulation with a lumbar brace for patients starting at 1 week after surgery.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}