{
  "id": 15312,
  "origin_website": "Jove",
  "title": "High Resolution Fluorescent In Situ Hybridization in Drosophila Embryos and Tissues Using Tyramide Signal Amplification",
  "procedures": [
    "1. PCR amplification of cDNA templates from plasmids\nNOTE: Use high quality plasmid or PCR-generated DNA templates for RNA probe synthesis. The Drosophila Gene Collection (DGC) libraries generated by the Berkeley Drosophila genome project provides coverage of most coding genes found in the Drosophila genome (see Table 1a). These also allow the use of universal primers for the amplification of any cDNA insert. These PCR amplifications are performed on plasmid DNAs present in the lysates of plasmid-containing bacterial cultures. The DNA products are then used as templates for in vitro transcription to generate antisense RNA probes (see Table 1b).\nDesign primers to amplify a specific exon region of a gene of interest by PCR (e.g. from genomic DNA), preferably with the T7 polymerase recognition site on the antisense end.\nFor experiments with fewer than 96 samples, cut off unneeded portions of 96-well plates. Cover plates with sealing tape (see Materials) for all incubations and storage. If microcentrifuge tubes are used, adjust volumes accordingly.\n\tNOTE: 96-well plates allow the use of multichannel pipettes for increased throughput, as well as smaller volumes for cost saving.\ntable:\n﻿0,1,2,3,4\nTable 1a,,,,\nVector,Antibiotic  working concentration 1:1000,Primers,RNA polymerase  for  antisense,RNA polymerase.  for  sense\npFLC-I,Amp,pBst_SK(-)_F/R,T3,T7\npBSt(-),Amp,pBSt_SK(-),T7,T3\npOT2,Chlor,pOT2_F/R,SP6,T7\npOTB7,Chlor,pOT2_F/R,T7,SP6\nTable 1b,,,,\nPrimer,Sequence,,,\npOT2_Forward,5'-AAT-GCA-GGT-TAA-CCT-GGC-TTA-TCG-3',5'-AAT-GCA-GGT-TAA-CCT-GGC-TTA-TCG-3',5'-AAT-GCA-GGT-TAA-CCT-GGC-TTA-TCG-3',5'-AAT-GCA-GGT-TAA-CCT-GGC-TTA-TCG-3'\npOT2_Reverse,5'-AAC-GCG-GCT-ACA-ATT-AAT-ACA-TAA-CC-3',5'-AAC-GCG-GCT-ACA-ATT-AAT-ACA-TAA-CC-3',5'-AAC-GCG-GCT-ACA-ATT-AAT-ACA-TAA-CC-3',5'-AAC-GCG-GCT-ACA-ATT-AAT-ACA-TAA-CC-3'\npBst_SK(-)_Forward,5'-GAA-ACA-GCT-ATG-ACC-ATG-ATT-ACG-CC-3',5'-GAA-ACA-GCT-ATG-ACC-ATG-ATT-ACG-CC-3',5'-GAA-ACA-GCT-ATG-ACC-ATG-ATT-ACG-CC-3',5'-GAA-ACA-GCT-ATG-ACC-ATG-ATT-ACG-CC-3'\npBst_SK(-)_Reverse,5'-CGG-CCA-GTG-AAT-TGT-AAT-ACG-ACT-C-3',5'-CGG-CCA-GTG-AAT-TGT-AAT-ACG-ACT-C-3',5'-CGG-CCA-GTG-AAT-TGT-AAT-ACG-ACT-C-3',5'-CGG-CCA-GTG-AAT-TGT-AAT-ACG-ACT-C-3'\nTable 1: A) General DGC clone information for amplifying cDNA inserts in plasmids. B) Sequences of Universal Primers for DGC plasmids.\nGrow 250 µL of plasmid-containing bacterial culture in 96-well culture plates by adding 240 µL of LB media per well with proper antibiotic selection (1:1000 dilution of a 1000 X antibiotic stock), and 10 µL of the original plasmid-containing bacteria (from a glycerol stock). Seal with sealing tape.\nIncubate by shaking at 215 rpm at 37 °C overnight (O/N).",
    "NOTE: Make a new copy of bacterial glycerol cDNA plasmid clone stock to replace the original. Do not refreeze original bacterial stock, as this may kill the bacteria.\nTo produce the PCR templates, dilute 10 µL of the O/N bacterial culture in 90 µL autoclaved ddH2O in each well of a new 96-well PCR plate. Denature the DNA for 5 min at 95 °C in thermocycler. Immediately place the plate on ice for at least 5 min.\nPrepare PCR reactions using appropriate universal primers as per Table 2.\ntable:\n﻿0,1,2,3\nReagents,50 μl sample reaction,96 Well mix  (112x reaction),Final concentration\n2 X PCR polymerase Mix,25 μl,2800 μl,1 X\nPrimer_For (25 pmol/μl),0.5 μl,56 μl,0.25 pmol/μl\nPrimer_Rev (25 pmol/μl),0.5 μl,56 μl,0.25 pmol/μl\nddH2O,22 μl,2464 μl,\nTotal,48 μl,5376 μl,\nTable 2: PCR Master Mix.\nUsing a pipette, aliquot 48 µL of the PCR master mix into each well of a new 96-well PCR plate.Add 2 µL of each denatured plasmid DNA template per well.\n\tNOTE: Use between 1 picogram (pg) to 1 nanogram (ng) of plasmid DNA. Excessive DNA template reduces PCR yield and specificity.\nProgram the 96-well PCR machine as per Table 3 and perform the amplification.\n\tNOTE: The extension time at 72°C is determined by the size of the PCR product (45 s for ≤2.0 kb, 1.5 min for ≤3.0 kb, 3 min for ≤4.0 kb and 3.5 min for 4.0-5.0 kb). The annealing temperature (Tm) is determined by the sequence of primers. When a primer is equal or longer than 20 nt, the Tm is calculated as:\n\tTm (°C )=(4 X number of CG) + (2 X number of AT)-4.\ntable:\n﻿0,1,2,3\nSTEP,Temperature,Time,Cycle(s)\nInitial Denaturation,95 °C,3 min,1 cycle\n\"Amplification  Denaturation, annealing and extension\",95 °C,45 sec,30 cycles\n\"Amplification  Denaturation, annealing and extension\",54-58 °C,45 sec,30 cycles",
    "\"Amplification  Denaturation, annealing and extension\",72 °C,45 sec-3.5 min,30 cycles\nFinal Extension,72 °C,7 min,1 cycle\nStorage,4 °C,hold,\nTable 3: Recommended PCR Program.\nPCR product precipitation with Ethanol (EtOH) and Sodium acetate (NaOAC) (see Table 4).\n\tNOTE: If the PCR reaction volume is less than 50 µL, fill to 50 µL with ddH2O.\n\t\nTo precipitate the DNA, mix the components from Table 4 and store samples O/N at -20 °C or for 30 min at -80 °C.Centrifuge the 96-well plate for 45-60 min at 2,250 x g at 4 °C. Use an 8-channel manifold pipette to carefully remove the supernatant. Wash once with 160 µL of cold 70 % EtOH (RNase-free) for 30 min at 2,250 x g at 4 °C.\n\t\tNOTE: The precipitated DNA can be seen at the bottom of wells. Shorter PCR products require longer centrifugations.\nGently invert the 96-well plate on a paper towel to remove the last drops of liquid in each well (as much as possible). Air dry DNA pellet for 1 h at room temperature (RT). Resuspend the precipitated DNA in 25 µL RNase free water.\n\t\tNOTE: The 1 h air dry will allow all traces of EtOH to evaporate. However, a very small volume of liquid (about 1 µL) should remain in each well to prevent the DNA pellet from completely drying. Use 25 µL for a 50 µL PCR reaction. Do not use DEPC treated water at this stage to avoid interference with in vitro transcription in the following steps.\ntable:\n﻿0,1,2\nComponent,Volume,Portion\nPCR,50 μl,\n100 % Ethanol,125 μl,2.5 X vol. of PCR\n\"3M NaOAc (pH=5.2, RNase free)\",5 μl,10% of vol. of PCR\nTotal,180 μl,\nTable 4: Example of a 50 µL PCR reaction.",
    "Check the size and yield of PCR products by running 5 µL of the resuspended DNA solution on a 1 % agarose gel in 1 X TAE buffer.\n\tNOTE: A total of 250-500 ng of DNA template is required for the 15 µL in vitro transcription reaction. Samples with higher yields can be further diluted. The RNA yield also depends on the sequence and length of the DNA template. According to the general guide for DIG-RNA labeling with T7 RNA polymerase, approximately 10 µg of DIG-labeled RNA is produced from 1 µg linearized template.\n2. In vitro transcription to generate antisense probes.\nNOTE: It is crucial to work in an RNase-free environment. All reagents and lab-ware must be RNase free (such as certified DNase/RNase free plastic ware).\ntable:\n﻿0,1,2,3\nComponent,Stock concentration,Volume,Final concentration\nATP,100 mM,7 μl,10 mM\nCTP,100 mM,7 μl,10 mM\nGTP,100 mM,7 μl,10 mM\nUTP,100 mM,4.5 μl,6.5 mM\nDig-11-UTP,10 mM,25 μl,3.5 mM\nRNase free water,,19.5 μl,\nTotal,,70 μl,\nTable 5: DIG-NTP Mix preparation.\ntable:\n﻿0,1,2,3\nComponent,15 μl reaction,96 Well mix  (112x reaction),Final Conc.\n5X Transcription Buffer,3.00 μl,3.00 μl,1 x\nDig-NTP mix (10 mM),0.75 μl,0.75 μl,0.5 mM\nRNase inhibitor,0.25 μl,0.25 μl,0.67 U/ μl\nRNA polymerase (T7 or T3 or SP6),2.00 μl,2.00 μl,2.67 U/ μl\nRNase free water,1.50 μl,1.50 μl,\nTotal,7.50 μl,7.50 μl,\nTable 6: 2X transcription Master Mix.\nPrepare the DIG-NTP mix as per Table 5.\n\tNOTE: To avoid mistakes, always align the plate such that A1 is at the top left corner of the plate.\nAdd components described in Table 6 to each well in a new 96-well PCR plate (probe plate). Add 7.5 µL of PCR product (DNA template) to each corresponding well, using a multichannel pipette. Cover the plate with sealing tape.",
    "NOTE: The optimum amount of PCR product added per transcription reaction should be between 0.5 and 1 µg. If bands on the gel are significantly weaker or more intense, the volume of DNA added to the reaction can be adjusted accordingly. The exact amount is not critical.\nIncubate the probe plate at 37 °C for 3.5-4 h. Mix 15 µL of synthesized probe with 35 µL of DEPC treated ddH2O, 125 µL of 100 % EtOH, and 5 µL of 3 M NaOAC (pH=5.2, RNase free). Store at -80 °C for at least 30 min. Centrifuge and wash as described in steps 1.10.2 and 1.10.3.\nResuspend the precipitated probe in 25 µL of DEPC treated ddH2O. Run 5 µL on a 1% agarose gel (running time < 20 min) to check the integrity and yield of the probe (Figure 2).\n\tNOTE: The agarose gel must be made with DEPC treated ddH2O and TAE buffer. Gel electrophoresis apparatus should be assigned for RNA work only. Longer gel running time at low speed can lead to RNA degradation during electrophoresis.\nMix the remaining 20 µL of the synthesized probe with 100 µL hybridization solution (Table 7) and store at -80 °C until needed.\n\tNOTE: The probe concentration can be diluted more if bands are particularly robust (see Figure 2 for examples). Hybridization solution is very effective at preventing RNase contamination. Immediately add hybridization solution to the resuspended probe to avoid RNA degradation. Hybridization solution has to be filtered through a 0.2 µm filter. For tissue samples, increase the detergent concentration in the hybridization solution by adding Triton-X-100 to a final concentration of 0.3 %.\ntable:\n﻿0,1,2\nComponent,Volume,Final concentration\nDEPC treated ddH2O,11.85 ml,23.7 %\n20 X SSC,12.5 ml,25 % (5 X)\nFormamide,25 ml,50 %\nHeparin (50 mg/ml),0.1 ml,0. 2 % (0.1 mg/ml)",
    "Salmon sperm single stranded DNA,0.5 ml,1.0 %\nTween-20,0.05 ml,0.1 %\nTotal,50.00 ml,100 %\nTable 7: Hybridization solution.\n3. Drosophila rearing and embryo, larva and adult tissue collection.\nNOTE: For both small scale (bottles) and mass (boxes) fly rearing, use standard fly lab protocols on cornmeal based food at 25 °C. Keep proper adult and larval density and provide additional active yeast powder on food surfaces.\nCollect embryos following standard protocols. The major steps of embryo collection are illustrated in Figure 3.\n\tNOTE: After rinsing devitillinized embryos in methanol, the fixed embryos can be stored at -20 °C for up to one year. Embryo permeabilization and post-fixation are performed on Day 1 of the FISH protocol.\nPrepare fresh 40 % PFA stock solution.\n\t\nPrepare a freshly made stock solution of 40% paraformaldehyde (PFA) by mixing 10 mL of DEPC treated ddH2O to 3.68 g of PFA and 70 µL of 2N KOH in a 20 mL glass scintillation vial containing a small stir bar.\n\t\tCaution: PFA is highly toxic with potential acute and chronic health effects. Read MSDS (Material Safety Data Sheets) and use with proper protection for eyes, skin, and respiratory tract.\nIn a fume hood, heat and stir the vial for 3-5 min on a heating plate at 200 °C until the PFA is fully dissolved. Remove the PFA stock solution from the heat as soon as the PFA is dissolved (do not overheat).\nCool the dissolved 40 % PFA stock solution on ice for 5 min, and filter with a 0.2 µm filter and 10 mL syringe.\nThird instar larvae (L3) or adult tissue fixation, quenching and permeabilization\n\tNOTE: This protocol should be finished in one day. It includes tissue dissection, fixation, quenching of endogenous HRP, permeabilization and post-fixation.",
    "Prepare fixing solutions (Fix-I and Fix-II) as per Table 8.\n\t\tNOTE: Picric acid is used as an additional fixative when tissue has a delicate structure that must be preserved. It is not a good fixative when tissue ultrastructure must be preserved for electron microscopy (EM).\n\t\tWarning: Picric acid is unstable and has the ability to react with other materials and create explosive compounds. Use and store according to safety guidelines.\nPlace larvae or adult flies in a 50 mL plastic tube containing 10 mL of cold 1 X PBS and 100 µL of Fix-I solution. Chill on ice for 2 min to reduce larval or adult fly motility.\nCut off the tip of a 1 mL plastic tip to create a 2-3 mm opening. Transfer 10-30 larvae or adult flies with the 1 mL tip into a Petri dish (9 cm diameter) with a shallow layer of 1 X PBS from the 50 mL tube (step 3.3.2). Adding a bit of PBTT can decrease surface tension. Carefully dissect larval (open from anterior and squeeze tissues from posterior to anterior) or adult tissues of interest with a pair of sharp forceps under a dissecting scope.\n\t\tNOTE: About 200-300 larvae or adult testes can be dissected and fixed in one day by experienced individuals.\nTransfer dissected tissues with a 200 µL pipette (with the tip cut off to create a 2 mm diameter opening) into a 1.5 mL tube and store on ice. Complete each round of dissection within 10-15 min before progressing to the next step.\n\t\tNOTE: Continue with additional rounds (within a 2 h time window) as required to generate sufficient material.",
    "Fix tissues with 800 µL of Fix-I solution for 30 min on a bench top mixer. Rinse tissues once with 800 µL 1 X PBTT and keep tubes on ice for a maximum of 2.5 h. Due to the 30 min limit, this needs to be performed batch-wise until sufficient tissue has been collected.\nPool all dissected and fixed tissues into a single 15 mL plastic tube containing mesh in the lid (see Figure 4 for tube design). Aspirate excess liquid through the mesh in the tube lid. Wash 3 X 5 min each with 10 mL of 1 X PBTT.Rinse twice with 10 mL of 1 X PBS to remove detergent. This prevents excess bubbles in the next step.\n\t\tNOTE: If dissected tissues sink to the bottom of the tube, steps can be performed in regular microtiter plates or 0.5-1.5 mL microcentrifuge tubes (300-800 µL volume per tube).\nQuench endogenous HRP activity with 5 mL of 0.3 % H2O2 in PBS for 15 min at RT. Repeat once more. Keep the lid open during this step without mixing. Rinse twice using 10 mL of 1 X PBTT. Wash twice for 5 min with 10 mL of 1 X PBTT.\nPermeabilize tissues with 10 mL of 80% acetone (-20 °C, pre-chilled) at -20 °C for 10 min. Invert the tube twice during the incubation period. Wash twice for 10 min with 10 mL of 1 X PBTT to rehydrate the tissues.\nRinse with 10 mL mixture of 5 ml PBTT plus 5 ml hybridization solution (1:1). Discard mix and replace with 10 ml hybridization solution. Samples can be stored at -20 °C until needed. For best results, do not store samples for more than a week.\ntable:\n﻿0,1,2\nComponent,Fix I (10 ml),Fix II (10 ml)",
    "40 % PFA stock,1 ml,1 ml\nPBTT,8.99 ml,9 ml\nPicric acid solution,10 μl,-\nTable 8: Fixing Solutions for tissues. \n4. In situ hybridization\nNOTE: This portion of the protocol requires a minimum of 2 days, with sample preparation, pre-hybridization and hybridization taking place on day 1 and probe detection on day 2. If the number of samples is relatively high, if unfamiliar with the protocol, or a full day is not possible, the protocol should be performed in 3 days with the steps of probe detection and signal amplification divided into 2 days. Large numbers of embryos or dissected tissue samples may also require additional days to process. For dissected tissue samples, replace 1 X PBT with 1 X PBTT in all steps, unless otherwise indicated. The extra detergent is required for penetration of many larval and adult tissues, such as the brain and testis. Although not tested, 1 X PBTT may also be used for embryos. Use 100 µL per well for 96-well plates and 800 µL for 1.5 mL tubes.\nPre-hybridization and hybridization\n\tNOTE: Steps 4.1.1-4.1.6.2 are for embryo in situ hybridization. For larval or adult tissue in situ hybridizations, skip these steps.\n\t\nRemove 2 mL of fixed embryos (stored in methanol at -20 °C) to a new 15 mL tube. Wash embryos twice for 7 min with 10 mL of methanol in each wash. Wash embryos for 7 min with 10 mL mixture of methanol and 1 X PBTT (1:1). Wash embryos twice for 7 min with 10 mL of 1 X PBTT to rehydrate.",
    "For embryo permeabilization, prepare an intermediate proteinase K solution (40 µL/mL) by diluting 1:500 from stock solution (20 mg/mL). Store at -20 °C. Make a working proteinase K solution by diluting the intermediate proteinase K solution 1/15 in 1 X PBTT for a final working concentration of 2.667 ug/mL.\nPermeabilize embryos with 10 mL of working proteinase K solution (use less for smaller numbers of embryos). Incubate the tube at RT for 13 min. Gently invert the tube 4 times during the incubation. Incubate the samples in proteinase K solution on ice for 1 h without mixing.\n\t\tNOTE: This relatively long incubation with dilute proteinase K ensures reproducibly uniform permeabilization and subsequent staining.\nWhile embryos permeabilize, make a 2 mg/mL glycine solution from 10 X stock (20 mg/mL) in 1 X PBTT for a total volume of 30 mL.\nRemove proteinase K solution, rinse with 10 mL of glycine solution (2 mg/mL) and wash twice for 2 min each. Rinse three times with 10 mL of 1 X PBTT to remove the glycine.\nPost-fixation of embryos.\n\t\t\nPrepare 10 mL of 4% PFA (1 mL of 40% PFA in 9 mL of PBTT, filtered through 0.45 µm filter).\nIncubate the samples in 4% PFA for 20 min. Wash 3 X for 2 min each with PBTT.\nTo prepare denatured hybridization solution, boil the hybridization solution for 5 min. For a full 96-well plate, use three tubes of 12 mL. Cool on ice immediately for 5 min.\nRinse embryos once with 10 mL of 1 X PBTT: hybridization solution (1:1). Rinse twice with 5 mL of hybridization solution. Aliquot ~20 µL per well of settled embryos (30-40 embryos) or fixed tissues into a 96-well PCR plate on ice.Remove hybridization solution from tissues or embryos using an 8-channel manifold pipette (Figure 1/video).",
    "NOTE: The manifold pipette has a ‘stop’ that prevents the tips from going to the bottom of the wells and removing sample. For experiments using tissues that float, remove liquid carefully with a 100 µL pipette from the top.\nAdd 100 µL of the denatured hybridization solution to each well. Pre-hybridize embryos for a minimum of 2.5-3 h at 56 °C using a dry bath heating unit containing metal beads (see materials and Figure 1).\nDenature 100 µL of the prepared probe in a 96-well PCR plate using a thermocycler for 5 min at 80 °C. Immediately cool on ice for 5 min.Remove pre-hybridization solution from embryos or tissues. Add denatured gene-specific probes to each sample, cover with sealing tape and hybridize at 56 °C for 16-18 h O/N, under metal beads in dry bath heating unit.\n5. Probe detection\nPre-warm the solutions in Table 9 in the 56 °C heating unit. Remove probes from the plate.\n\tNOTE: Probes can be reused between 2-3 times if stored at -80 °C (never store any RNA samples in -20 °C). After hybridization, the double stranded RNA is more stable than single strand RNA, and is less susceptible to degradation caused by RNase contamination.\n\tIf using a a multi-well plate vacuum filtration system for tissues, a collection plate should be included under the filter plate to collect the probes (see video for assembly details). Hybridized tissues will need to be transferred from the regular 96-well microtiter plate used for hybridization to one with 1.2 µm pore size PVDF membranes on the bottom of each well.\ntable:\n﻿0,1,2,3\nStep,Pre-warmed solution (56 °C),Time,Volume per well\n1,Hybridization Solution:PBTT (3:1),15 min,100 μl\n2,Hybridization Solution:PBTT (3:1),15 min,100 μl\n3,Hybridization Solution:PBTT (1:1),15 min,100 μl\n4,Hybridization Solution:PBTT (1:3),15 min,100 μl\n5,PBTT 3 washes,5 min,100 μl",
    "Table 9: Washing probes after hybridization.\nIf using normal plates, wash samples as per Table 9 in a heating unit at 56 °C.  If using the vacuum manifold system, use heated solutions with vacuum system on bench and remove solutions immediately from below by vaccuum. After the 3rd wash with 1 X PBTT, the normal plate can be removed from the heating unit.\nPrepare antibodies.\n\t\nPrepare 11 mL of primary antibody solution (2.5 µg/mL) from stock (1 mg/mL) by diluting biotin-conjugated mouse monoclonal anti-DIG antibody (see material list) in PBTTB (1:400). If processing fewer samples, adjust volumes accordingly.\nPrepare 11 mL of streptavidin-HRP solution (1 µg/mL) from stock (1 mg/mL) by diluting 1:1000 streptavidin-HRP conjugate (see material list) in PBTTB. If using fewer samples, adjust volumes accordingly.\nBlock embryos or tissues with PBTTB (1 % skim milk in 1 X PBTT) for 20 min on a bench top mixer at RT.\n\tNOTE: Filter PBTTB using filter paper (grade 3, 6 µm) before using it on 96-well filter plates to avoid clogging the filters. Instead of PBTB, PBTTB (PBTB with additional 0.3 % Triton-X-100) is used for all tissues during the protocol.\nIncubate embryos or tissues in antibody solution (100 µL/well) for 2 h on bench-top sample mixer. Rinse twice with 1x PBTTB. Wash 3 X for 5 min and 5 X for 10 min with PBTTB. Incubate embryos or tissues with streptavidin-HRP solution (100 µL/well) for 1.5 h using a bench-top sample mixer. Wash 2 X for 5 min with PBTTB. Keep samples in the dark from this point on.\n\tNote: during all antibody washes, if tissue is being lost due to the opacity produced by the milk, try washing without the milk (PBTT instead of PBTTB).\nPrepare a DAPI solution by diluting 100 X DAPI in PBTTB (1:100).",
    "Incubate embryos or tissues with DAPI solution (100 µL/well) for 15 min on a bench-top sample mixer. Wash 4 X for 10 min with PBTT. Store the 96-well plate with samples O/N at 4 °C or proceed to the next step.\n\tNOTE: The procedure can be paused here.\n6. Antibody detection using tyramide (see Figure 5)\nNOTE: Here homemade cyanine 3-conjugated tyramide was used, which was prepared according to the protocol described in 12. If performing many experiments or testing many samples, this saves a significant amount of money and is effective compared to commercial reagents (from experience). For fewer experiments and samples, commercially available cyanine 3-tyramide can be used (see Materials).\nWash sample plates 3 X for 5 min with 1 X PBTT.\nPrepare tyramide activation buffer (activation buffer) containing 0.006 % of H2O2 in PBTT (dilute 30% (w/w) H2O2 stock 1:5000).\nRinse the plates with the activation buffer.\nPrepare cyanine 3-tyramide solution by diluting it in activation buffer in a 15 mL tube.\n\t\nFor embryos, use 1:80 dilution (137 µL of cyanine 3-tyramide in 11 mL of activation buffer). For larval tissues, use 1:150 dilution (73 µL of cyanine 3-tyramide in 11 mL of activation buffer). For adult testes, use 1:200 dilution (55 µL of cyanine 3-tyramide in 11 mL of activation buffer). For adult ovaries, use 1:300 dilution (36 µL of cyanine 3-tyramide in 11 mL of activation buffer).\nIncubate samples with cyanine 3-tyramide solution for 2 h on bench-top sample mixer. Rinse four times with PBTT. Wash 6 X for 10 min with PBTT. Wash 3 X for 5 min with PBS to remove the detergent.",
    "Add 150 µL/well of anti-fade mounting media. Keep samples O/N at 4 °C to allow tissues or embryos to sink to the bottom of the tube. Mount samples on microscope slides (under dissecting scope for tissues) and cover with coverslip. Seal the edges of the coverslip with transparent nail polish.\nImage using a fluorescence microscope.\n\tNote: analyze negative control first to get an idea of ‘non-specific’ background."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}