{
  "id": 18548,
  "origin_website": "Jove",
  "title": "The In Ovo Chick Chorioallantoic Membrane (CAM) Assay as an Efficient Xenograft Model of Hepatocellular Carcinoma",
  "procedures": [
    "1. Egg Incubation\nObtain 8 day old specific pathogen-free embryonated eggs.\nPlace eggs in rotating egg tray, stamped ends facing upwards, and place the rotating tray inside an egg incubator. Incubate eggs for 48 hr at 36 °C and 50% humidity.\n2. Dropping the CAM and Opening the Eggs\nGather eggs from incubator. Place eggs in egg rack, stamped side up, and bring to laminar flow hood.\nTurn off the room and hood lights.\nHold the stamped end of egg lightly to the egg candler to expose the vasculature of the CAM as well as the air sac.\n\tNOTE: The egg candler is a light source used to visualize the developing embryo and associated air sac and vasculature.\nPlace a pencil mark in between two major blood vessels.\nTurn on the lights and use a sterile push pin to make one hole at the tip of the egg above the air sac (stamped end) and one hole at the pencil mark. Do not push the push pin all the way through; a hole around 3 mm deep will usually suffice.\nTurn off the lights. Squeeze safety bulb, pressing the open end firmly against the hole above the air sac. Apply suction to pull air into the hole at the pencil mark, causing the CAM to drop away from the shell at the pencil mark.\nCheck that the air sac has moved from the stamped end of the egg to the pencil-marked hole using the candler. If it has not, use the push pin to make both holes slightly deeper and then re-apply suction using the safety bulb.",
    "Turn on the lights. Holding the egg in one hand, turn on the dremel rotary tool with a 15/16 inch cut-off wheel attached and make two transverse cuts just deep enough to cut through the shell but not deep enough to cut all the way down to the depressed CAM. Make the cuts around 2 cm in length and 1 cm apart from each other. Make the cuts wide enough so that a silicone ring 1 cm in diameter can pass through but thinner than the width of standard scotch tape.\nNext, make 1 longitudinal cut between and at the ends of the two transverse cuts by lightly touching the cut-off wheel to the shell.\nSlide sterile forceps under the shell piece and parallel to the shell. Grab the shell piece with the forceps and remove the entire piece cleanly.\nPlace scotch tape over the newly opened window, making sure to fold one end over on itself for ease of removal.\nPlace eggs back in incubator in the egg tray (NOT in the rotating egg racks) until time of inoculation.\n3. Inoculation\nKeep basement membrane protein mixture, such as matrigel, on ice (to prevent polymerization) and place in hood.\nUse 2 mM EDTA to detach cells (4 - 5 ml per T75 flask) and place flasks in tissue culture incubator for 5 min.\nResuspend the detached cells in media and count using a hemocytometer and trypan blue. Use between 500,000 to 2,000,000 cells for grafting onto the CAM, depending on cell line. Optimize the proper number in preliminary experiments.\nMeasure volume required for appropriate cell number and centrifuge at 500 x g for 5 min.\nDiscard supernatant and then resuspend cell pellet in 40 µl of PBS++ and 20 µl of basement membrane mixture.",
    "NOTE: At this point, cells can be treated with drugs or other test agents as needed for experiments by resuspending into the cell/basement membrane mixture suspension. Alternatively, agents can be pipetted onto the cell/basement membrane mixture suspension after grafting.\nRetrieve egg rack with eggs from the incubator and place in the laminar flow hood.\nPeel tape off of the window, retrieve a 1 mm silicone ring from the cap of a cryogenic vial using sterilized forceps, and drop the ring through the window.\nPipet the 60 µl cell solution of PBS++ and basement membrane mixture directly into the center of the silicone ring resting on the CAM.\nRe-tape the window and move egg rack back to incubator. At this point, use caution when moving the eggs as the ring and the cell suspension can easily become displaced.\nAllow tumors to grow for 5 to 7 days.\n4. Harvesting Tumors\nPlace under-pad in hood. Prepare 35 x 10 mm plates and paraformaldehyde containers as needed for histology. Put 1 ml PBS++ in each 35 x 10 mm plate.\nPlace biohazard bag in hood. Take sterile dissection scissors and insert the pointed end into the egg at the hole near the stamped end.\nCut around the entire egg longitudinally.\n\tNOTE: the CAM and the tumor with the ring should stick to the top half of the shell with the window.\nUsing dissection scissors and forceps, dissect the tumor away from the CAM and place tumor in the 35 x 10 mm plate. Measure and weigh tumors. Fixed tumors in paraformaldehyde and then paraffin-embed them for use in histology and immunohistochemistry experiments.\n5. (Optional): Tumor Cell Dissociation",
    "Use dissection scissors to mince the tumor in the 35 x 10 mm plate. Pour minced tumor into a 15 ml centrifuge tube and remove as much PBS++ as possible through pipetting.\nAdd 2 ml of collagenase (1 mg/ml in PBS++), turn tube over several times, and incubate tube at 37 °C for at least 30 min (up to several hours).\nAdd 5 ml media to each tube and resuspend thoroughly by pipetting up and down 20 - 40x. Thorough pipetting is critical for complete cell dissociation.\nAllow sediment to settle, and transfer the supernatant to a fresh tube. Centrifuge at 500 x g for 5 min. Remove supernatant, leaving behind dissociated cell pellet.\n\tNOTE: At this point, cell pellets can be used for various experiments (flow cytometry, lysis for use in Western blotting, RNA isolation, etc). Total tumor cell count can also be obtained using a hemocytometer and trypan blue staining. Note that smaller, oval-shaped cells are chicken cells from the CAM and should not be counted as tumor cells. There should be a minimal number of contaminating non-tumor (CAM) cells if the tumor is dissected away from the CAM carefully.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}