{
  "id": 15543,
  "origin_website": "Jove",
  "title": "DetectSyn: A Rapid, Unbiased Fluorescent Method to Detect Changes in Synapse Density",
  "procedures": [
    "Isolation of cells and tissue from animals was in accordance with the National Institutes of Health's Guide for the Care and Use of Laboratory Animals and approved by the Wake Forest Institutional Animal Care and Use Committee\nNOTE: This protocol is used on samples already treated and fixed per specific experimental paradigms and requirements. For demonstration purposes, synapse formation due to rapid antidepressant treatment is used to highlight this synapse detection technique6. Neurons previously cultured on coverslips, treated, fixed in 4% paraformaldehyde (PFA), and stored in 1x phosphate-buffered saline (PBS) will be used to highlight the in vitro procedures. Previously sliced hippocampal tissue (25 µm thick) from mice treated, transcardially perfused with ice-cold PBS and 4% PFA, and then stored in cryoprotectant will be used to highlight the slice procedures. Please see11,12 for more information about how to culture neurons or transcardially perfuse rodents. See Figure 1 for a graphical representation of this procedure.\nimgsrc://cloudfront.jove.com/files/ftp_upload/63139/63139fig01.jpg\nFigure 1: Graphical representation of DetectSyn assay. After permeabilizing cell membranes, primary antibodies for Synapsin1 and PSD95 bind to these synaptic proteins. Secondaries with oligonucleotide tags then bind to the primary antibodies. If Synapsin1 and PSD95 are within 40 nm, as at a synapse, then the oligonucleotides interact, and a fluorescent tag is amplified. This fluorescent signal can then be imaged via standard microscopy and analyzed. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/63139/63139fig01large.jpg]\n1. Rinse samples\nRinse the samples with 500 µL of 1x PBS + 0.75% glycine for 5 min 3 times with gentle agitation on an orbital shaker to remove residual PFA or cryoprotectant.\n2. Block and permeabilize samples\nPrepare blocking and permeabilization solution (10% normal donkey serum, 0.25% Tween 20) in 1x PBS. Prepare enough to use for blocking, primary, and secondary incubations.",
    "To samples (e.g., coverslips or free-floating slices) in 24 well plates, add 500 µL of blocking and permeabilization solution. Ensure each well contains a different sample and is appropriately labeled to prevent samples from being switched.\nIncubate the samples at room temperature (RT) for 60 min for cultured cells or 2 h for sliced tissue. Use an orbital shaker for gentle agitation.\n3. Incubate samples in primary antibodies\nPrepare primary antibodies in blocking buffer:\n\t\nPrepare Postsynaptic density 95 (PSD95; 1:500, rabbit polyclonal), Synapsin1 (1:500, mouse monoclonal), MAP2 (1:400, chicken polyclonal)\nPrepare a negative control aliquot that omits one of the synaptic pairs (e.g., without PSD95)\nCarefully remove the blocking solution with a plastic Pasteur pipette. Try to remove as much as possible without disturbing the cells or tearing tissue.\nFor cultured cells:\n\t\nLine a large plastic petri dish with parafilm. Carefully transfer coverslips to the parafilm using forceps.\nCarefully add 60 µL of the primary antibody solution to the top of the coverslips. Make sure not to spill the primary antibody solution over the side of the coverslip.\nTo provide humidity and prevent samples from drying out during the incubation period, add ultrapure water to a smaller Petri dish and carefully arrange the small Petri dish around the coverslips.\nCover the large Petri dish and incubate cultured cells for 1 h at RT.\nFor sliced tissue:\n\t\nCarefully add 250 µL of the primary antibody solution to free-floating slices in a 24 well plate.\nCover the plate and incubate the tissue overnight at 4 °C with gentle agitation on an orbital shaker.\n4. Wash samples, then incubate in secondary antibodies\nPrepare secondary antibodies in the blocking buffer:\n\t\nPrepare Donkey anti-mouse (1:5), donkey anti-rabbit (1:5), donkey anti-chicken (1:400).",
    "At this step, additional technical controls can be obtained by preparing a secondary aliquot that omits either the anti-mouse or anti-rabbit secondary.\nFor cultured cells:\n\t\nUsing forceps, carefully tap off the primary solution from coverslips onto a paper towel\nUsing forceps, carefully transfer the coverslips back to their original 24 well plate filled with 500 µL of 1x PBS.\nFor sliced tissue:\n\t\nCarefully remove the primary antibody solution with a plastic Pasteur pipette. Try to remove as much as possible without tearing tissue.\nAdd 500 µL of 1x PBS\nWash the samples for 10 min 3 times in 1x PBS with gentle agitation on an orbital shaker. During this time, bring all wash buffers to RT.\n\t\nDuring this time, change the parafilm in the large Petri dish\nFor cultured cells:\n\t\nUsing forceps, carefully transfer the coverslips back to the parafilmed large Petri dish\nCarefully add 40 µL of the secondary antibody solution to the top of the coverslips. Make sure not to spill the secondary antibody solution over the side of the coverslip.\nIf needed, add more ultrapure water to a smaller petri dish and carefully arrange the small petri dish around coverslips.\nCover the large Petri dish\nFor sliced tissue:\n\t\nCarefully add 250 µL of the secondary antibody solution to free-floating slices in a 24 well plate.\nCover the plate\n\t\tNOTE: From here on, protect samples from light by wrapping the tops of the plates with foil.\nIncubate the samples at 37 °C for 1 h\n5. Ligation\nMix the ligation stock 1:5 in molecular-grade water.\nAs in section 4, carefully transfer the coverslips and remove the secondary mix from the sliced tissue.\nWash the samples in 500 µL of wash buffer A",
    "For cultured cells, wash 2 times for 5 min. For sliced tissue, wash 2 times for 10 min. Use gentle agitation on an orbital shaker for both.\nDuring this time, change the parafilm in the large Petri dish\nWhile keeping the ligase on a cold block, dilute the ligase 1:40 in the ligation stock from step 5.1. Perform this dilution immediately before adding the ligase to the samples.\nAs in section 4, remove as much of the wash buffer A as possible from samples before adding the ligase.\nFor cultured cells: Transfer coverslips back to the parafilmed Petri dish. Add 40 µL of the ligation mix to coverslips, arrange small water-filled Petri dishes around the coverslips, and cover the large Petri dish.\nFor sliced tissue: Add 250 µL of the ligation mix from Step 5.4 to each well and cover the plate.\nIncubate the samples for 30 min at 37 °C.\n6. Amplification\nMix the amplification stock 1:5 in molecular-grade water.\nAs in section 4, carefully transfer the coverslips and remove the ligation mix from the sliced tissue.\nWash samples in 500 µL of wash buffer A\n\t\nFor cultured cells, wash 2 times for 2 min. For sliced tissue, wash 2 times for 10 min. Use gentle agitation on an orbital shaker for both.\nDuring this time, change the parafilm in the large Petri dish\nPerform this dilution immediately before adding the polymerase to samples. While keeping the polymerase on a cold block, dilute polymerase\n\t\nFor cultured cells, dilute polymerase 1:80 in the amplification stock from step 6.1.\nFor sliced tissue, dilute polymerase 1:40 in the amplification stock from step 6.1.\nAs in step 4, remove as much of the wash buffer A as possible from samples before adding the polymerase.",
    "For cultured cells: Transfer the coverslips back to the parafilmed Petri dish. Add 40 µL of the amplification mix from Step 6.4.1 to coverslips, arrange small water-filled Petri dishes around the coverslips, and cover the large Petri dish. Incubate the samples for 100 min at 37 °C.\nFor sliced tissue: Add 250 µL of the amplification mix from Step 6.4.2 to each well and cover the plate. Incubate the samples for 2 h at 37 °C.\n\tNOTE: During this time, prepare and label slides.\n7. Mounting\nAs in Step 4, carefully transfer the coverslips and remove the amplification mix from the sliced tissue.\nWash the samples in 500 µL of wash buffer B 2 times for 10 min with gentle agitation on an orbital shaker.\nWash the samples in 500 µL of 1% wash buffer B for 1 min with gentle agitation on an orbital shaker.\nFor cultured cells:\n\t\nDrop 3 µL of mounting media onto a slide\nTap off excess wash buffer from the coverslip and then place the coverslip (with cells facing down) into the mounting media. Seal the sides with a small amount of clear nail polish to seal the coverslip in place.\nFor sliced tissue:\n\t\nCarefully transfer a tissue slice to the prepared slide and arrange it, so the slice is lying flat. Drop between 5-10 µL of mounting media (amount will depend on the size of the slice) onto tissue slice\nCarefully place a glass coverslip over tissue slice and seal with a small amount of clear nail polish along the edge to seal the coverslip in place.\nWait at least 15 min before analyzing under the microscope, or store at -20 °C.\n8. Obtain digital images with a confocal microscope",
    "Optimize the acquisition settings (e.g., laser power, gain, offset) across samples from all treatments. Ensure that the optimization includes decreasing background noise and enhancing the signal without oversaturating the intensity of the fluorescent signals. Once settings are determined, apply the same acquisition settings across all images obtained.\n\tNOTE: The following acquisition details can be used with a Nikon A1 confocal microscope and the Nikon NIS AR Elements software.\nSet the slide with sample on the stage and find the focal plane for the sample using DAPI through the eyepiece.\nTurn off the eye port by clicking on Eye port and choose an optical configuration button to adjust the settings.\nAdjust the gain, offset, and laser power for each fluorescent channel to decrease background noise and enhance the fluorescent signal. Make sure the fluorescent signal does not become oversaturated as mentioned in steps 8.5-8.6.\nMonitor oversaturation using a pseudocolor for the fluorescent signal. At the bottom of the live image, right-click the tab labeled with the fluorescent channel currently being used.\nNext, choose Channel Coloring and pick a pseudocolor like Rainbow Dark to visualize the fluorescence intensity in a heat-map-like pseudocolor. In Rainbow Dark, cooler colors indicate less fluorescent intensity, and hotter colors indicate more fluorescent intensity.\nOnce all fluorescent channels are optimized, right-click on the optical configuration button previously chosen and choose Assign Current Camera Setting for this button.\nVerify that the chosen settings are sufficient for a random sample from each treatment group. If the chosen settings oversaturate any of these samples, repeat step 8.4 to eliminate the oversaturation.\nFor cultured neurons, follow steps 8.10-8.16.\nUsing the eye-port, search for a neuron with dendrites that have minimal overlap with other dendrites.",
    "Turn off the eye port and use the DAPI channel to visualize the cell body of the chosen neuron. Double-click on the center of the soma to center the neuron in the middle of the field of view.\nUsing the MAP2 channel, find the best plane of focus for the MAP2 signal with live scanning.\nUnder the ND Acquisition tab, click on Save to File and choose a file to save the image into under Browse. Then, input the filename.\nUnder the Z tab, select the Symmetric Mode Defined by Range option. Set the focus to the best MAP2 plane and click on the Relative button to set this focal plane as the middle of the z-stack.\nSet the range to 5 µm with 1 µm steps, and make sure to check Close Active Shutter During Z Movement. Under the Wavelength tab, select the name of the optical button with the previously configured acquisition settings under Optical Conf. Then, click on Run Now.\nRepeat steps 8.1.10-8.1.15 for about 10 neurons per coverslip/treatment.\nFor sliced tissue, follow steps 8.18-8.22.\nUsing the eye-port, search for the region of interest. For example, locate CA1 of the hippocampus.\nTurn off the eye-port and use the MAP2 channel to find the best plane of focus for the MAP2 signal with live scanning.\nUnder the Acquire menu, choose Scan Large Image. Next, select the optical button's name with the previously configured acquisition settings under the Capturing panel from the panel that opens. Also, ensure to select the correct objective in this panel.\nUnder the Area panel and the eyepiece, use the arrow keys to set the boundaries of the region of interest. Next, click on Save Large Image to File and create a save path filename for the image.",
    "Under the Setup panel, make sure Multichannel Capture is checked, and then choose the name of the optical button with the previously configured acquisition settings under Optical Conf.\n\tNOTE: A z-stack for a large image is possible but will increase the scan time.\n9. Analysis\nSimilar to acquisition settings, use samples from all treatments to optimize threshold settings. Ensure that the threshold optimization focuses on decreasing background noise and enhancing the signal without oversaturating the intensity of the fluorescent signals. Once these settings are determined, apply the same threshold settings across all images used for analysis as described in steps 9.2-9.3.\nIn ImageJ, the threshold option is located under the menu Image > Adjust > Threshold. Choose the Dark Background option if the image has a dark background.\nNext, adjust the upper and lower bounds of the threshold per previously determined optimized threshold settings, then click on Apply.\nFor cultured cells, use the MAP2 channel and a freehand region of interest (ROI) tool to draw an ROI for each neuron, including dendrites and soma. For sliced tissue, draw a freehand ROI within the slice image that encapsulates the area of interest (e.g., stratum radiatum of the CA1 within the hippocampus).\nObtain the area of the ROI. In ImageJ, measure the area under the menu Analyze > Measure.\nDetect the number of puncta within each ROI using an automatic detection tool like Particle Analysis in ImageJ following steps 9.7-9.9.\nFind the Particle Analysis option under the menu Analyze > Analyze Particles. First, define the puncta size diameter, typically 0.1-3 µm2.\nNext, choose the Overlay Masks option from the Show drop-down menu and check the Display Results option. Then, click on OK.",
    "If puncta are not detected with the diameter range chosen, adjust the range until all puncta are detected with this analysis. Make sure to use the same Particle Analysis settings for all images.\nDivide the number of puncta by the area of an individual region of interest by following steps 9.11-9.13.\nCopy and paste the results for each image from the Results pop-up from ImageJ into a spreadsheet.\nFirst, identify which file and sample the data were obtained from. Then, divide the area of the ROI by the number of puncta.\nThen, clear the data from the Results pop-up, and repeat steps 9.2-9.12.\nNormalize results to control samples: Average the results (number of puncta/ROI area) for the control samples. Then, divide the obtained results of all samples by the average of the control to obtain the normalized results. The new average of the control samples should be equal to 1.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}