{
  "id": 7850,
  "origin_website": "Bio",
  "title": "<em>Agrobacterium</em>-mediated Genetic Transformation of Cotton and Regeneration via Somatic Embryogenesis",
  "procedures": [
    "Transformation of Agrobacterium and seed germination for transformation Fresh, uniform culture of transformed Agrobacterium is required for efficient plant transformation.LBA4404 competent cells’ transformation with pBI121 (14.7 kb) construct (Figure 2):imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4677/bioprotoc-13-10-4677-g002.jpgFigure 2. Construct map of the vector used for Agrobacterium-mediated genetic transformation Place the competent cells (LBA4404) on ice and let them thaw (do not rub the Eppendorf to force thawing). Once the cells thaw, add 1 μL of the desired plasmid to the competent cells. (Plasmid concentration: 10–100 ng/μL.)Mix the plasmid and cells by gentle pipetting and let it sit for 5 min.Transfer the cell mixture to an electroporation cuvette and mix by gentle pipetting.Place the cuvette into the cuvette chamber and start the electroporation machine. Press the pulse button until a beep sound is heard, indicating that the pulse has been given.Remove the cuvette, transfer the entire cell mixture into a 1.5 mL Eppendorf, and add 950 μL of YEB media (see Recipes).Gently mix the cell mixture by pipetting and then place it in the incubator shaking at 200 rpm for 2 h in the dark at 28 °C. Dark conditions help the bacteria to repair and prepare itself for growth and multiplication.After 2 h, remove the Eppendorf and centrifuge at 3,500× g for 2 min at RT.Discard the supernatant (used YEB media) and add 300 μL of YEB media again. Mix the pelleted cell mixture by pipetting.Once mixed properly, spread 50–100 μL of cells on YEB agar plates containing 50 mg/L kanamycin, 250 mg/L streptomycin, and 50 mg/L rifampicin. Spreading should result in a moistureless plate (this leads to appropriate single colony formation).Wrap the plates with foil and place them in an incubator at 28 °C for 48 h in the dark.After 48 h, single colonies start to appear.",
    "Pick 10–12 single colonies and check by PCR if the cells are transformed.Create a master plate by streaking the positive colonies on YEB agar plates containing 50 mg/L kanamycin, 250 mg/L streptomycin, and 50 mg/L rifampicin. These Agrobacterium colonies consist of our gene of interest.Incubate the master plate for 48 h in an incubator at 28 °C.Store the plate in the dark at 4 °C.Cotton seed sterilization and germination (Figure 3):imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4677/bioprotoc-13-10-4677-g003.jpgFigure 3. Cotton seed sterilization and germination  (created with BioRender.com[href=https://www.biorender.com/])Defuzz the cotton bolls. After defuzzing, remove the remaining lint by delinting the seeds.To delint 100 seeds, prepare a liter of saturated sodium bicarbonate solution by mixing sodium bicarbonate in 1 L of double-distilled water until it stops dissolving.Add 25 seeds to a 100 mL wide-mouth bottle and pour 7–8 drops of concentrated sulfuric acid on it. Stir the seeds continuously until the whole lint is removed.Once the lint is removed, add saturated sodium bicarbonate solution to the bottle and simultaneously keep stirring the seeds. Stir the seeds until the effervescence ceases.Discard the solution and rinse the seeds with tap water by vigorous shaking. Repeat this 4–5 times to remove traces of sodium bicarbonate.Once washed properly, place the seeds on a blotting sheet and let them dry.For sterilization, prepare a 0.1% (w/v) solution of HgCl2 by mixing 100 mg of HgCl2 with 100 mL of autoclaved double-distilled water in a 250 mL conical flask.In a laminar flow hood, add 25–30 dried seeds to 0.1% HgCl2 solution and stir vigorously for 5 min. Try not to exceed 5 min. Excess sterilization will degrade the seed quality. Discard the solution and rinse the seeds 5–6 times for 30 s each by adding 100 mL of double-distilled water to the flask after every rinse.",
    "After sterilizing the seeds, place half in a stainless-steel strainer and scorch them with ethanol. Do not burn the seeds. Scorching loosens the seed coat and aids in better germination (Video 1).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Seed scorching Let the seeds cool down for 5 min.Cut two pieces of filter paper in the shape of a Petri plate (90 × 15 mm). Pour autoclaved double-distilled water, just enough to dampen the filter paper. Next, place the seeds on it and cover them with cut pieces of filter paper. Once again, pour enough autoclaved double-distilled water to dampen it.Seal the Petri plate with parafilm tape and cover it with foil. Place the plate in an incubator at 28 °C for 48–72 h.Radicals start appearing within two days. Once proper radicals are seen, place them on paper boats (made of computer paper) in test tubes containing Hoagland media (see Recipes, Table 1), with the radical in a downward position. Seeds can also be grown on ½ MS media, but Hoagland media is preferred as its carbohydrate absence leads to fewer chances of contamination.Place the test tubes in the test tube stand and keep the stands in a culture room set at 28 °C.Plantlets appear in 10 days, ready to be used for transformation (Figure 4).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4677/bioprotoc-13-10-4677-g004.jpgFigure 4. Seed germination. a) Test tube with a paper boat immersed in Hoagland media, on which a cotton plantlet has been grown. b) Fully grown 10-day-old plantlet with a slender and proper hypocotyl. c) 10-day-old plantlets grown in ½ Murashige & Skoog media with phytagel, ready for transformation (shown in red box).Plant transformation and transgenic development Agrobacterium culture preparation and induction for plant transformation (Figure 5):imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4677/bioprotoc-13-10-4677-g005.jpgFigure 5. Agrobacterium culture preparation and induction for plant transformation (created with BioRender.com[href=https://www.biorender.",
    "com/])Using a toothpick, pick a single colony from the master plate and add to it 5 mL of YEB media (with 50 mg/L kanamycin, 250 mg/L streptomycin, and 50 mg/L rifampicin) in a 30 mL culture vial. Incubate the culture for 2–3 days in an incubator with shaking at 200 rpm at 28 °C. This primary will be used for culturing a secondary culture.After the culture grows in 5 mL of YEB media, take 100 μL of culture and inoculate it in 50 mL of YEB media containing 50 mg/L kanamycin, 250 mg/L streptomycin, and 50 mg/L rifampicin in a 250 mL conical flask. Incubate it for 16 h with shaking at 200 rpm at 28 °C.Check the OD of the secondary culture after 16 h. A culture OD600 = 0.8–1.6 is used for transformation.Once the desired OD is attained, transfer the cultures to 50 mL falcon tubes. Use two autoclaved 50 mL falcons for 50 mL of culture, equally dividing 25 mL into each falcon. Pellet down the cells at 3,500× g for 10 min at 4 °C.Discard the supernatant and dissolve the pellets, each in 50 mL of induction media, and transfer the total 100 mL of media to a 250 mL conical flask. Incubate for 4 h with shaking at 175 rpm at 27 °C.After 4 h, centrifuge the culture at 3,500× g for 10 min at 4 °C. Dissolve the pellet in 100 mL of Murashige & Skoog-0 (MSO; see Recipes, Table 3) media and incubate for 2 h with shaking at 150 rpm at 26 °C. Later on, this culture will be used for transformation.Plant transformation:In a laminar flow hood, take the hypocotyls from the 10-day-old plantlet and cut them into 1 cm long pieces.",
    "After cutting, place them on a plain MS media plate, so as not to dry them out (Video 2).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 2. Explant preparation Meanwhile, the Agrobacterium culture should be ready in MSO for further transformation processes. Add the explants to 100 mL of MSO and incubate the mixture of explants and culture at 25 °C with shaking at 125 rpm for 30 min.Remove the explants from the culture after 30 min and blot them dry with an autoclaved filter paper sheet.Arrange the explants on MSP-1 culture media (without any antibiotics; see Recipes, Table 3) for co-cultivation. Wrap the plates with foil and keep in the dark for 48 h.After 48 h, wash the explants with 100 mL of autoclaved double-distilled water in a conical flask containing 250 mg/L cefotaxime. Shake the flask for 5 min and then rinse 4–5 times again with autoclaved water.Once the explants are properly washed, dry them on an autoclaved filter paper.Callus induction and somatic embryogenesis (Figure 6):imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4677/bioprotoc-13-10-4677-g006.jpgFigure 6. Regeneration from transformed explants and transgenic development. a) Callus induction. b) Callus initiation. c) Callus proliferation. d) Embryogenic callus. e) Germinated embryo in ½ Murashige & Skoog with phytagel media. f) Developed plantlet. g) Hardening of plantlets. h and i) Fully grown transgenic plants.After drying the explants, place 8–9 explants on each selection media (MSP-1; see Recipes, Table 3) plate. Place the culture plates in a culture room set at 28 °C with 16 h light and 8 h dark conditions.Subculture the explants after 21 days on selection media. At this stage, callus starts appearing from the ends of the explants.After two cycles of MSP-1, place the explants on MSP-2 (see Recipes, Table 3) media for a third and fourth cycle.",
    "A total of four cycles (each consisting of 21 days) of antibiotics ensure proper selection of positive callus.At this point, the calli starts proliferating, and lots of friable, yellow-colored beady calli can be seen. Remove the callus from the explants with caution and place it on MSA-1 (see Recipes, Table 3) for further proliferation. Subculture the callus every 21 days for an extra 2–3 times. Lots of yellowish-colored, friable calli emerge when proper subculturing is done. Embryogenic callus will have a tinge of pinkish color, which is due to presence of the anthocyanin pigment. Presence of pink color shows onset of embryogenesis (Figure 7).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4677/bioprotoc-13-10-4677-g007.jpgFigure 7. Different types of regenerated callus. a–c) Non-viable calli can be green, light brown, or dark brown in color. These types of calli are either too hard (a) or soggy and wet (b and c). d–f) Viable calli, which are friable, beady, and have a slight pinkish color.Transfer the friable callus to MSA-2 (see Recipes, Table 3) media for embryogenesis. Normal friable callus shows embryogenesis on plain MS media too, but the absence of NH4NO3 results in more anthocyanin production, which is an indication of stress for plants. As such, embryogenesis starts early in callus. Also, placing the proliferating callus at lower temperature (2–3 °C) accelerates the embryogenesis process.Once the globular embryos can be seen converting to bipolar (Figure 8), subculture them on ½ MSP (see Recipes, Table 3) plates. When placed on ½ MSP, the root develops appropriately, giving the required anchorage for growth (Video 4).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4677/bioprotoc-13-10-4677-g008.jpgFigure 8. Distinguishing stages of embryos. a) Globular embryo development after a few subcultures. b) Development of bipolar embryos. Once developed, bipolar embryos leave the connection with callus and have their own root and shoot apex with vascular connections.",
    "Remove the bipolar embryos from the plates after 10 days and place them in planton boxes containing approximately 100 mL of ½ MSP media. This ensures the required space for plantlet development.Let the plantlets grow a decent and stable root system. During this time interval, the shoot system starts touching the planton box cap, so replace the cap with another autoclaved planton box, attaching both the boxes with a coupler frame.Transfer the developed transgenic plant into a 5” plastic pot containing autoclaved soil mixture, and water it with Hoagland media (see Recipes). Cover the pot with a polythene bag. Sprinkle a few drops of water inside the bag to maintain moisture.Place the pots in a plastic tray and pour Hoagland media in the tray to maintain the water level in the pots.Transfer these pots to the culture room. After 10 days, shift them to a greenhouse for hardening. One week later, make a cut at the top of polythene bag. After another week, remove the polythene bag from the pots. This ensures appropriate acclimatization of transgenic plants.After 10–15 days, when the plants are 15–20 cm long, transfer them into 14” earthen pots containing cotton field soil. Place them in a greenhouse at 28 °C until the harvest.Extract DNA from the plants and conduct PCR to confirm the insertion of the gene of interest in the cotton plants (Figure 9).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4677/bioprotoc-13-10-4677-g009.jpgFigure 9. PCR check for the presence of the AnPME gene in putative transgenic lines. 1–9: transgenic lines; N: negative control; P: positive control; NTC: non-template control."
  ],
  "subjectAreas": [
    "Plant Science",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}