{
  "id": 2790,
  "origin_website": "Cell",
  "title": "Generating Patient-Derived Gliomas within Cerebral Organoids",
  "procedures": [
    "Step-by-Step Method Details\nStep-by-Step Method Details\nThawing hESCs\nTiming: ∼ 30 min\nThis step provides a detailed procedure for thawing hESCs.\nNote: Due to the sensitivity of hESCs and hESC-derived tissue, all steps in this protocol should be considered mandatory and should be followed exactly to ensure success.\nWarm mTeSR1 in 37°C water bath (∼20 min).\nRemove Matrigel-coated plates from the incubator and place in TC hood.\nRemove vial of hESCs from liquid nitrogen and thaw 1-2mins in 37°C water bath.\nTransfer contents of vial to 15mL tube, and then add 5-10mL mTeSR1 dropwise to cells. Do NOT create single-cell suspension!\nSpin @200 rcf for 3 min, pour off/aspirate supernatant, and resuspend cell pellet in 2 mL mTeSR1. Again, do NOT create single-cell suspension.\nAspirate hESC-Qualified Matrigel from one well of a 6-well plate and add the 2 mL hESC suspension to the well.\nIncubate at 37°C for 12-24 h.\nThe next day, aspirate the media and rinse the well with 1 mL of warm DMEM F12. Aspirate the DMEM F12 and replace with 2 mL of fresh, warmed mTeSR1. Examine cell survival/morphology.\nFeeding hESCs\nTiming: 25 min\nThis step provides a detailed protocol for the daily maintenance of hESC cultures.\nOn the day following either thawing or passaging, if you see a lot of dead cells, wash once with 1mL warm DMEM F12 before feeding.\nNote: It is normal for cells to resemble differentiated cells on the first day post-thaw, but colonies should adopt normal morphology after a few days of routine feeding.\nAspirate media from well, and feed the cells with 2mL fresh, warm mTeSR1 daily, monitoring cells for appropriate morphology (See Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/23-Fig1.jpg\nFigure 1. Human Embryonic Stem Cell (hESC) Colony Formation\nNormal morphology of healthy, hESC colonies 48 h after passaging; scale bar, 400 μm.",
    "Passaging hESCs\nTiming: ∼30 min per well; add 5 min to time duration for each additional well.\nThis step describes how to passage hESCs to ensure their health throughout the experiment.\nhESCs usually need to be passaged every 5-7 days. It is best to passage them when they are no more than 80% confluent to prevent spontaneous differentiation.\nWhen ready to passage, aspirate the media and wash once with PBS. Aspirate PBS and add 1 mL of PBS containing EDTA (0.5M EDTA diluted 1:1000 in PBS). Incubate at 37°C for approximately 5-7 min to dissociate the cells. Check the morphology of cells at 5 min. If colonies are rounded up, proceed to Step 3.\nCarefully aspirate the EDTA and wash gently with 1 mL sterile PBS. Allotted wash time should be less than 10 s.\nAspirate the Matrigel from a new, coated well(s).\nCarefully aspirate the PBS wash and gently remove the cells using a 5 mL serological pipette that contains 2 mL of warm mTeSR1 medium.\nCritical: Do not over-pipet; avoid creating a single-cell suspension!\nTransfer the cells to the new well.\nNote: The passaging ratio differs based on the experiment and the cell line in hand, but generally is 1:2 depending on confluency.\nExamine morphology day by day. Colonies should be well circumscribed, i.e., differentiated cells appear fibroblastic or dense over-confluent colony cores.\nMaking Embryoid Bodies (EBs)\nTiming: 45 min to split one well of hESCs into one 96-well plate\nThis step describes how to dissociate confluent hESCs into a single-cell suspension that will ultimately promote the formation of embryoid bodies.",
    "When hESC colonies are ready for splitting (80% confluent), passage according to protocol (Steps 2, 3, and 5 above), but resuspend cell pellet in warm STEMdiff Neural Induction Medium containing 1:100 Rock Inhibitor. When resuspending, create a single-cell suspension.\nPlate cells into individual wells of a low-attachment, round-bottom 96-well plate (150 μL per well). Plate approximately 7,000-9,000 cells per well.\nPerform partial medium change (∼100 μL) every other day for 4-5 days, with Rock inhibitor for the first 2 days. Monitor morphology of EBs (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/23-Fig2.jpg\nFigure 2. Embryoid Body Formation after 5 Days\nMorphology of healthy embryoid body, left; morphology of unhealthy embryoid body, right; scale bars, 400 μm.\nForming Neural Rosettes\nTiming: 5 min for transfer of 10 EBs to single well of 6-well plate; allow 1.5 h for rosette selection and subsequent plating for secondary rosette formation\nThis step describes how to promote neural induction and generation of neural rosettes.\nThe inclusion of a neural rosette formation step can be used to enrich for neural progenitors and improve efficiency of neuronal differentiation in 3D organoid cultures ( Mariani et al., 2015[href=https://www.wicell.org#bib2]). When EBs are about 500-600 μm in diameter and begin to brighten and have smooth edges (Figure 2[href=https://www.wicell.org#fig2], left), transfer ≤ 10 EBs to one hESC-Qualified Matrigel-coated well of a 6-well plate. (Coating procedure is the same as the one you use when culturing hESCs). Note: Use a p1000 tip to transfer embryoid bodies to coated well. Make sure you have at least 2 mL of warm STEMdiff Neural Induction Medium covering the embryoid bodies in each coated well. Transfer of embryoid bodies to coated well should be completed within 10 min to avoid any issues with EB survival or detachment from coated well surface.",
    "Change medium every day for 5-6 days. Examine the morphology daily. You should clearly see the formation of neural rosettes within 3-4 days of plating the embyroid bodies (Figure 3[href=https://www.wicell.org#fig3]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/23-Fig3.jpg\nFigure 3. Neural Rosette Clusters\n(A) Normal morphology of primary neural rosette clusters at Day 4.\n(B) Suboptimal neural rosette cluster with necrotic center (arrow).\n(C) Normal morphology of rosettes during secondary rosette formation; scale bars, 500 μm.\nOnce rosettes are readily apparent with radial arrangements of columnar cells and lumen-like centers (Day 5 or Day 6), aspirate the medium and wash with PBS for 1 min. Apply STEMdiff Neural Rosette Selection Reagent to the well and incubate at 37°C for one h. Please note that rosette clusters may develop necrotic centers if not detached at Day 5 or Day 6 (Figure 3[href=https://www.wicell.org#fig3]B); clusters with necrotic cores should be discarded.\nAspirate the STEMdiff Neural Rosette Selection and wash with PBS for 1 min. Using a p1000 tip containing 1 mL of STEMdiff Neural Induction Medium, propel the medium quickly to dislodge the rosettes clusters from the coated well and—using a 5 mL serological pipette, transfer the rosettes clusters to a new Matrigel-coated well for a second round of rosette formation. Use an additional 1 mL of STEMdiff Neural Induction Medium to dislodge any remaining rosettes. Rosettes should lift off, leaving only more differentiated neural cells behind (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/23-Fig4.jpg\nFigure 4. Stage-Specific Morphology of Cerebral Organoids\n(A) Bright-field microscopy of cerebral organoid maturation.\n(B) Hematoxylin and Eosin staining of cerebral organoids at 4 weeks and 8 weeks post-Matrigel embedding; scale bars, 400 μm.",
    "Change medium daily for 5-6 days (monitoring for healthy, rosette formation each day). Morphology for secondary rosettes should closely-resemble that of primary rosettes (Figure 3[href=https://www.wicell.org#fig3]C). Once rosettes exhibit radial arrangements of columnar cells with lumen-like centers, apply the neural rosette selection reagent as before, followed by a one-h incubation, and a PBS wash.\nDevelopment of Cerebral Tissue\nTiming: 1 h for Matrigel-embedding of neural rosette clusters and subsequent plating into a single, 10 cm dish; add 10 min to allotted time for each additional 10 cm dish\nThis step describes how to embed the neural rosette clusters in Matrigel and promote differentiation into a mature, cerebral organoid.\nAfter the PBS wash, use a p1000 tip containing Differentiation Type I Medium to remove the rosette clusters; rosette clusters are approximately 1-2 mm in diameter. Using the p1000 tip, transfer the clusters one by one to sterile Parafilm in a 10 cm dish. The goal is to embed one cluster in one droplet of Matrigel.\nRemove excess media from each drop and add ∼75 μL of Matrigel (#356234, NOT hESC-qualified) to each rosette cluster. Position each cluster in the center of the droplet using a p200 pipet tip.\nPlace Parafilm (should be in a 10 cm Petri dish) at 37°C for 30 min to allow Matrigel to polymerize.\nUsing a sterile p200 tip, gently roll off Matrigel droplets into a 10 cm dish containing 10 mL Differentiation Type I Medium. Place plate in incubator without shaking for 72 h.\nAfter 3 days, transfer plate to an orbital shaker (85 rpm) in 10 mL Differentiation Type II Medium in a standard TC incubator.\nChange media every 3-4 days and monitor for morphology.",
    "Cerebral organoids are ready for analysis when tissue completely fills matrigel droplet and have been growing on the shaker for at least 2 weeks (Figure 5[href=https://www.wicell.org#fig5]). Histopathological evaluation of resultant organoids should be performed by a board-certified pathologist using the neuronal and glial markers as originally described (Linkous et al., 2019[href=https://www.wicell.org#bib1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/23-Fig5.jpg\nFigure 5. Stage-Specific Morphology of Cerebral Organoids\n(A) Bright-field microscopy of cerebral organoid maturation.\n(B) Hematoxylin and Eosin staining of cerebral organoids at 4 weeks and 8 weeks post-Matrigel embedding; scale bars, 400 μm.\nGeneration of Cerebral Organoid Glioma (GLICO) Tumors\nTiming: 48 h for tumor development\nThis step describes how to initiate patient-derived brain tumors within cerebral organoids.\nFor co-culture experiments, transfer individual organoids to a 24-well plate (one organoid per well).\nRemove excess media from organoids and gently wash organoids twice with PBS. Allotted wash time is 1 min per wash. Do not physically disturb the organoids, as they can shear easily.\nSeed 10,000 fluorescently-labeled glioma stem cells (GSCs) into each organoid-containing well (10,000 GSCs/2 mL of NBE per well).\nIncubate plates at 37°C for 24 h (no shaking).\nWash organoids once with PBS (1 min) and transfer to 6-well plates containing 2 mL of Differentiation Type II medium per well.\nPlace the plate on the orbital shaker at 37°C and monitor daily for tumor growth (Figure 6[href=https://www.wicell.org#fig6]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/23-Fig6.jpg\nFigure 6. GLICO Formation\nTumor cell infiltration of cerebral organoid one week after co-culture; scale bar, 500 μm.\nNote: The number of GSC-derived GLICO tumors that form can vary depending on the cell line, however, tumor invasion into the organoid should be evident within 48 h of co-culture for the majority of cell lines.",
    "Note: Depending on the invasive and proliferative properties of the glioma stem cell line, tumor cells can invade the entire organoid within 2 weeks of co-culture (Linkous et al., 2019[href=https://www.wicell.org#bib1]; Ogawa et al., 2018[href=https://www.wicell.org#bib3]).\nIf the desired endpoint requires that some normal cerebral organoid tissue should remain, then GLICOs should be harvested before tumor invasion has reached capacity."
  ],
  "subjectAreas": [
    "Organoids",
    "Neuroscience",
    "Stem Cells"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}