{
  "id": 10217,
  "origin_website": "Jove",
  "title": "Formulation and Acoustic Modulation of Optically Vaporized Perfluorocarbon Nanodroplets",
  "procedures": [
    "1. Perfluorocarbon nanodroplet formulation\nRinse out a 10 mL round-bottom flask with chloroform and wash out a 10 µL and 1 mL gas tight glass syringe with chloroform by repeatedly aspirating the full syringe volume and expelling it for a total of three times.\n\tCAUTION: Chloroform is volatile and can be toxic if inhaled. All work with this solvent should be performed in a fume hood.\nUsing the syringes, add 200 µL of DSPE-mPEG2000 (25 mg/mL), 6.3 µL of 1,2-distearoyl-sn-glycero-3-phosphocholine (DSPC, 25 mg/mL) and 1 mL of IR 1048 (1 mg/mL in chloroform) into the round-bottom flask. Remember to clean out the syringes between lipids/dye to prevent contamination of the stock.\n\tNOTE: Infrared dyes are light sensitive, and work should be done in dim conditions or flasks should be covered in aluminum foil.\nRemove the solvent utilizing a rotary evaporator. Ensure that the vacuum is slowly adjusted to 332 mbar to prevent bumping. After 5 min, reduce the pressure to 42 mbar to remove any water that may have entered the solution.\n\tNOTE: The lipid cake can be stored overnight in a round bottom flask covered with parafilm at 4 °C.\nSuspend the lipid cake in 1 mL of phosphate buffered saline (PBS) and sonicate or vortex at room temperature for 5 min or until all of the lipid cake has been suspended and dissolved in the solution. Sonicate for an additional 2 min to homogenize the solution.\nTransfer the solution to a 7 mL glass vial and place the vial in a glass dish filled with ice to allow the solution to cool down for 5 min before adding 50 µL of perfluorohexane using a gas tight glass syringe. Remember to rinse out the syringe with perfluorohexane before dispensing it into the vial.",
    "Place the glass vial containing the lipids and ice bath in the probe sonicator enclosure and submerge the probe tip below the miniscus. Ensure that the sides of the sonicator probe does not touch the lip of the glass vial.\nProbe sonicate the mixture with the following settings: Amplitude 1, Process time: 20 s, Pulse-On: 1s, Pulse-off: 5s. Then sonicate at the following settings: Amplitude: 50, Process time: 5 s, Pulse-on: 1 s, Pulse-off: 10 s.\nTransfer the nanodroplet solution to a 1.5 mL centrifuge tube and centrifuge at 300 x g for 3 min to separate out the larger droplets (>1 µm) from smaller droplets.\nDiscard the pellet and transfer the supernatant to another 1.5 mL centrifuge tube. Wash the supernatant by centrifuging at 3000 x g for 5 min to pellet all the droplets in solution. Resuspend the PFCnDs in 1 mL of PBS by pipetting the pellet up and down and then sonicate in a bath sonicator for 1 min.\nMeasure the size of the droplets using dynamic light scattering (DLS). Dilute the stock PFCnDs by 100-fold (10 µL of PFCnD stock in 990 µL of PBS) and bath sonicate to disperse the PFCnDs before measuring. Representative results are shown in Figure 1.\nDetermine the concentration of the PFCnDs utilizing the nanoparticle tracking analyzer (see Table of Materials). Dilute the PFCnDs by 100-1000-fold to ensure accurate measurement of the concentration. The protocol typically yields droplets at a concentration on the order of 1010 particles/mL.\nPrepare 10 mL of ultrasound coupling gel in a 50 mL centrifuge tube and add 1% (v/v) or 100 µL of PFCnDs to make solution of ~108 particles/mL. Vortex the solution to mix. Centrifuge the mixture at 4000 x g for 3 min to remove bubbles.\n2. Polyacrylamide phantom preparation",
    "Degas water by filling a 500 mL vacuum flask with 400 mL of deionized water, seal with a rubber cork, and connect the flask to the vacuum line. Open the vacuum line and submerge the bottom of the flask in the bath sonicator. Sonicate for 5 min or until no gas bubble formation is visible.\nPrepare 10% ammonium persulfate (APS) solution by dissolving 500 mg in 5 mL of degassed water. Gently swirl the solution if the ammonium persulfate does not fully dissolve.\nIn a 400 mL beaker with a stir bar on a stir plate, add 150 mL of degassed water and 50 mL of 40% (w/v) acrylamide-bisacrylamide solution to form 200 mL of 10% acrylamide-bisacrylamide solution. Stir the mixture at 200 rpm to allow for the proper mixing without introducing bubbles.\n\tCAUTION: Acrylamide is a carcinogen, and all work should be done in a fume hood with gloves, especially if working with acrylamide in powder form.\nWeigh out 400 mg of silica to and add it to the 10% acrylamide-bisacrylamide solution from step 2.3 to form a 0.2 %(w/v) of silica and acrylamide solution.\n\tCAUTION: Silica when inhaled can be a carcinogen. All work including weighing should be performed in a fume hood.\nPrepare a 58 mm x 58 mm x 78 mm square mold with a cylindrical inclusion by cutting off the tips of from a plastic transfer pipette and supporting it in the mold with lab tape. See Figure 2.\nAdd 2 mL of 10 % APS solution to the beaker to make a final concentration of 0.1% APS and add 250 µL of Tetramethylethylenediamine (TEMED) to the phantom solution. Allow the solution to stir briefly (less than a min).",
    "Quickly pour the solution into the mold, while being careful not to introduce air bubbles into the solution. The solution should polymerize within 10 min. Remove the phantom by running the flat end of a lab spatula around the edge of the mold and inverting the mold.\n\t​NOTE: These phantoms can be reused multiple times and should be submerged in water and stored at 4°C.\n3. Perfluorocarbon nanodroplet imaging\nTurn on and warm up the pulsed laser system for ~20 min following manufacturer instructions. Ensure that the fiber optical bundle is properly connected to the laser output and the two legs are properly placed within the fiber bundle holder.\nTurn on the ultrasound imaging system, connect array imaging transducer (L11-4v) to the system and fix the transducer within the holder to align its imaging plane with laser cross section.\nSet the pulse repetition frequency of the laser system to 10Hz and place a powermeter at the end of the fiber bundle to measure energy. Tune the q-switch delay until the estimated fluence is 70 mJ/cm2.\n\tCAUTION: Appropriate eyewear must be worn when firing the laser and laser curtains must enclose the space.\nBackfill one of the channels in the polyacrylamide phantom with the ultrasound gel/PFCnD mixture using a 1 mL plastic slip tip syringe. Liberally cover the top of the channel with ultrasound gel and remove any bubbles with a 1 mL plastic slip tip syringe. Place the polyacrylamide phantom underneath the transducer and fiber bundle as shown in Figure 3.\nUse the combined laser ultrasound and elasticity (CLUE) imaging platform based on the software20 to image PFCnD synchronized with optical activation. Change the general user-defined parameters in Param structure for imaging: set start/end depth to 0/40mm, center frequency to 6.9MHz, and transducer name to 'L11-4v'.",
    "Define a new RunCase and design a module sequence for repeated optical activation/recondensation and US imaging of PFHnDs. This is done by listing predefined modules such as ultrafast imaging (mUF), external laser (mExtLaser) and idle(mIdle).\n\t\nRepeat the sequence set mExtLaser-mIdle-mUF-mExtLaser-mUF twice to acquire both n-pulse and p-pulse imaging data.\n\t\tNOTE: The first mExtLaser module in each sequence is set as a sham laser by setting ExtLaser.Enable to 0 and the 'mIdle' is included to minimize time between background US images and the n/p-pulse US images after laser activation.\nSet module parameters for each module placed in the current run case's module sequence. Access each module parameter by index corresponding to its order in module sequence. Modules will execute pre-defined operations with module parameters user set here.\n\t\nSet ExtLaser.QSdelay in external laser modules to the value of laser Q-switch delay tuned in step 3.3, in microseconds. This module waits for laser system's flashlamp trigger out and generates Q-switch trigger after the delay specified in QSdelay.\nIn ultrafast imaging module, set Resource.numFrame to 100, set SeqControl.PRI to 200 (µs), and set TW.polarity to 1 for P-pulse and -1 for N-pulse (see Figure 4 for corresponding pulse shape). This module will transmit ultrafast 0-degree planar wave with pulse type specified in TW.polarity.\n\t\t\nAcquire full aperture imaging window of 38.8 mm wide for number of frames in Resource.numFrame, pulse repetition interval of SeqControl.PRI, then save data for off-line processing.",
    "Set SeqControl.lastPRI_Module in idle module to the length of time between laser pulses (100 ms) subtracted by Q-switch delay, imaging data acquisition time (20 ms), and a 20 µs margin for the signal to travel. This module keeps the system under 'no operation' state for the time in SeqControl.lastPRI_Module to fill the time gap between the end of imaging data acquisition and next laser pulse excitation.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}