{
  "id": 7176,
  "origin_website": "Bio",
  "title": "Analysis of TORC1-body Formation in Budding Yeast",
  "procedures": [
    "This protocol accompanies Hughes Hallett et al. (2015) and Sullivan et al. (2019).We generally follow movement of TORC1 on the vacuolar membrane in a standard W303 lab strain (trp1-1;can1-100;leu2-3,112;his3-11,15;ura3;GAL+;ADE+) carrying Kog1 with a yellow fluorescent protein tag at its native locus (Kog1-ECitrine, or Kog1-YFP for short). Tags on other TORC1 subunits (particularly Tco89) can also be used, but Kog1-YFP gives the strongest signal. It is worth noting fluorescent tags on Tor1 disrupt TORC1 localization and activity.Prepare an 8-well glass-bottom chamber slide by adding 200 μl of 2 mg/ml Concanavalin A (ConA) solution to each well (ensuring the bottom of each slide is completely coated). Incubate the slide for 10 min at 25 °C, and then remove the solution and allow the wells to air-dry overnight (in the dark) with the lid in place. The ConA treatment ensures that the yeast adheres to the coverslip at the bottom of each chamber, making medium swaps and high-quality imaging possible.Patch out the strains that are going to be examined onto fresh YEPD plates, starting from glycerol stocks (yeast in 15% glycerol and YEPD, stored at -80 °C) using sterile applicator sticks, and then incubate the plates at 30 °C overnight (or up to three days).Transfer approximately 5 μl of each strain/patch into a separate 28 ml tube containing 5 ml of SD medium (again using sterile applicator sticks).Grow the 5 ml starter cultures at 30 °C in a drum rotator (rotating at approximately 40 rpm) until they reach mid-log phase (OD600 between 0.5 and 0.7) – this usually takes 5 h.Transfer approximately 4 ml of each starter culture into a separate 150 ml Erlenmeyer flask containing 20 ml of SD medium, so that the final OD600 is 0.1.",
    "Grow the 20 ml cultures at 30 °C, shaking at 200 rpm, until they reach an OD600 ~0.4.While the cultures grow, heat the microscope chamber, 15 ml of fresh SD medium, and 15 ml of fresh starvation medium (e.g., S-glucose or S-nitrogen) to 30 °C.Pipet 300 μl of each culture into the wells of a ConA-treated chamber slide and then allow the cells to settle for 5 min at 30 °C.Gently aspirate the medium from each well and discard.Add 300 μl fresh SD medium at 30 °C.Capture log-growth (time 0) images in each well using a 100× objective and YFP excitation/emission filter (λEX 510/25; λEM 540/21) collecting a stack of sixteen images, each separated by 0.4 µm in the z-plane, with a 200 ms exposure per plane*. In general you need to capture images in 2-3 fields to ensure you have data for enough cells (>100) to get an accurate TORC1-body count. Once the fluorescence imaging is complete, capture a Differential Interference Contrast (DIC) or Brightfield reference image.*Note: The imaging is difficult since there are only ~100 TORC1 molecules per cell. First, you must have a high-quality microscope and a sensitive camera to see Kog1-YFP – particularly when the TORC1 molecules are spread across the vacuole. We currently use a Nikon Ti-E inverted microscope with a Photometrics Prime 95-B camera. Second, you can only image a given field once before significant photobleaching occurs. Third, you must take z-stacks (3D images) that span the entire depth of the cell to identify all of the TORC1 foci since the bodies form on the edge of the vacuole and are thus often at the top or bottom of the cell. Remove the chamber slide from the microscope, aspirate and discard medium from each well.",
    "Wash each well three times with synthetic medium missing glucose (S-glucose), or synthetic medium missing nitrogen (S-nitrogen), at 30 °C, using 350 μl, 400 μl, and then 450 μl of medium, by gently pipetting against the same corner of each well and then aspirating and discarding each wash except the last (which is left in the well during imaging).Start a timer after the first wash and capture z-stacks at each time-point in all wells as described in Step 11 (we typically take pictures every 10 min for 1 h), keeping the slide at 30 °C during the entire experiment.In each experiment, a wild-type (or relevant mutant strain) missing a fluorescent (YFP) tag should also be imaged as a control. We have found that starvation (particularly glucose starvation) can trigger the formation of autofluorescent puncta. The intensity and number of puncta increase over time, and their appearance is highly dependent on the batch of medium being used. We discard data from experiments/time-points where a significant number of autofluorescent foci form in the control strain and rerun the experiment in a fresh batch of medium."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}