{
  "id": 19342,
  "origin_website": "Jove",
  "title": "Rat Model of Closed-Head Mild Traumatic Injury and its Validation",
  "procedures": [
    "Animal experiments were approved by the Central South University Animal Care and Use Committee. All studies were conducted in line with the welfare and ethical principles of laboratory animals.\n1. Animal feeding and anesthetization procedure\nGroup house 280-320 g Sprague-Dawley male rats and maintain them on a 12 h/12 h light/dark cycle with access to food and water ad libitum. Perform the study after the rats acclimatize for 6 days.\nAnesthetize the rat with 3% isoflurane at 0.6 L/min air flow in an induction box until it is non-responsive to paw or tail pinch. Maintain the flow rate for 30 s.\n2. Preoperative setup\nPosition a sponge with a hardness value of 35D (weight of 35 kg/m3 of sponge), with identical length and width but a thickness of 12 cm, within an acrylic box (15 cm x 22 cm x 43 cm) lacking a top cover.\nTrim a tin foil (a thickness of 20 µm) and affix it onto the acrylic box using adhesive tape to form a destructible surface capable of supporting the weight of a rat. Additionally, mark a cut line measuring approximately 10 cm to be the designated location for positioning the rat's head.\nWith the aid of an iron stand, firmly secure the PVC tube in place. Prepare a perforated weight, weighing 550 grams with an 18-millimeter diameter. Attach the weight to a fishing line at a height of 1 meter inside a polyvinyl chloride or PVC tube. and adjust the position of the guide tube 3 centimeters above the tin foil.\nPrepare a helmet and a pillow. Make a helmet using a stainless-steel disk measuring 10 mm in diameter and 3 mm in thickness. Prepare a wedge-shaped sponge pillow to place beneath the rat's head, ensuring that it is perpendicular to the direction of gravity.",
    "NOTE: A schematic diagram of the impact apparatus is presented in Figure 1. The helmet serves the purpose of identifying the impact location and enhancing the distribution of external force. The pillow is utilized to guarantee uniform and stable damage.\n3. mTBI induction\nQuickly place the anesthetized rat on its chest on the tin foil.\n\tNOTE: Two operators are required for mTBI induction-one for the preparation and the other for verification.\nPreparation: Place the pillow beneath the rat, ensuring its head is parallel to the foil paper. Align the helmet with the rat's ears and secure it in place.\nVerification: Verify that the PVC pipe is positioned directly above the helmet. Once both operators confirm the correct setup, proceed to the next step.\nInduction of head rotation: Release the weight, allowing it to fall and strike the rat's head, inducing a fall onto the sponge and a 180° rotation.\nPlace the rat on its back in a clean cage.\n4. Sham induction\nTreat the rat the same way as the previous mTBI induction description, but do not subject it to the head impact.\n5. Validation procedure: Acute neurobehavioral assessments\nNOTE: The following assessments were modified based on the Neurological Severity Scores9 and the protocol by Flierl et al.10. All these assessments were performed 10 min after the rat recovered the righting reflex.\nTime of loss of consciousness: Record the duration from when the rat is anesthetized to when it recovers the righting reflex.\n\tNOTE: The righting reflex is the process in which the rat turns over when placed on its back.\nFirst seeking-behavior time: Record the duration from when the rat is anesthetized to when it shows the seeking behavior for the first time.\n\tNOTE: Seeking behavior is a sign of interest in the environment, a physiological response.",
    "Ability to escape\n\t\nPlace the rat in the middle of a circular apparatus (0.5 m diameter and 0.3 m height) with an exit (12.5 cm long and 9 cm wide).\nRecord the time the rat takes to exit the circle.\n\t\tNOTE: If the rat does not exit the circle within 180 s, record the time as 180 s.\nBeam balance ability test\n\t\nPlace the rat on a 3 cm, 2 cm, and 1.5 cm wide beam for 1 min accordingly.\nIf the rat maintains a balance with a steady posture on the beam, score it as 0.\nIf the rat grasps the side of the beam, give a score of 1. If the rat hugs the beam and one limb falls off it, score it as 2.\nIf the rat hugs the beam and the two limbs fall off it or spin on it (>60 s), score it as 3.\nIf the rat attempts to balance on the beam but falls off (> 40 s), score it as 4.\nIf the rat attempts to balance on the beam but falls off (>20 s), score it as 5.\nIf the rat does not attempt to balance or hang on the beam and falls off within 20 s, score it as 6.\n\t\tNOTE: The beam balance test does not require a pre-trial.\n6. Validation procedure: Neurobehavior assessment\nNOTE: Prior to the behavioral experiments, the rats were handled for 2 min daily for 3 consecutive days to minimize stress and novelty disruption. All behavioral experiments were performed by placing the animals in the test environment for 60 min prior to the start of the experiment.\nMotor coordination ability (Beam task)\n\t\nExperimental setup",
    "Place the rats on one end of the balance beam (1.5 m long and 75 cm above the floor). Place an escape box (a slanted bedding home cage) on the other end.\nPosition a foam padding below the beam to mitigate the potential risk of injury to rats in case of falls during the test.\nTurn on the video camera.\nSchedule testing days at specific time points post-injury or post-sham treatment (e.g., day 1, day 3, and day 7).\nTraining phase (2 days)\n\t\t\nTrain the rats to cross the 4 cm wide beam 3 consecutive times, followed by two trials on the 2 cm wide beam.\nDuring the training, gently guide the rats across the beam until they can cross them easily without interference.\nBalance beam experiment\n\t\t\nPlace the rats on the 2 cm wide beam for 5 consecutive trials.\nRecord the start and end of each trial when the rat's nose crosses the starting and finishing lines, respectively.\nReturn the rats to their cages at the end of the experiment.\nBaseline testing\n\t\t\nConduct the balance beam experiment before the injury or treatment.\nCalculate the average values from these 5 consecutive trials to establish the baseline for each rat.\nData analysis\n\t\t\nAnalyze the time to cross the beam and the total number of hindfoot slips using video analysis by researchers blinded to the experimental conditions.\nAnxiety (Open field test)\n\t\nExperimental setup\n\t\t\nPrepare the open field arena, ensuring it is clean and free from any previous odor cues. Divide the arena into three zones: a central inner zone (33 cm x 33 cm), a middle zone (66 cm x 66 cm), and an outer zone.\nTesting phase",
    "Place a rat in the center of the open field arena and start the timer. Allow the rat to explore the arena for 5 min freely. After 5 min, carefully and gently return the rat to its home cage.\nData collection\n\t\t\nMeasure the total distance traveled by the rat during the 5-minute exploration period. Determine the time the rat spends in the central inner, middle, and outer zones.\nData analysis\n\t\t\nUse the total distance traveled as a measure of overall exploratory behavior and locomotor ability. Calculate the time spent in the central inner zone as an indicator of anxiety-like responses.\nLearning and memory abilities (Morris water maze test)\n\t\nEnsure the water maze apparatus is in proper condition. Dye the water black and place cues in the four cardinal directions. Position the platform 2.5 cm below the water surface.\nSet up a monitoring system to record and observe the behavior of the rats.\nTrail day\n\t\t\nQuickly place the rat into the water maze. If the rat fails to reach the platform within 2 min, gently guide it using the wooden stick.\nAllow the rat to familiarize itself with the maze environment while standing on the platform for 20 s, then remove it. Once the rat is on the platform, let it stay for 20 s, then remove it.\nDaily repetition\n\t\t\nRepeat the training day procedure, placing the rat in the water from different quadrants. Repeat step 6.3.3. Continue the training for 5 consecutive days.\nProbe test day: On the 6th day, remove the platform and place the rat in the same quadrant for 2 min.\nObservation and recording: Utilize the monitoring system to monitor the rat's behavior on trial and probe test days.\nCleaning: After removing the rat from the water maze, use a towel to dry it thoroughly.",
    "Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}