{
  "id": 8610,
  "origin_website": "Jove",
  "title": "Quantitative Autoradiographic Method for Determination of Regional Rates of Cerebral Protein Synthesis In Vivo",
  "procedures": [
    "Note: All animal procedures were approved by the National Institute of Mental Health Animal Care and Use Committee and were performed according with the National Institutes of Health Guidelines on the Care and Use of Animals.\nAn overview of the protocol is presented in Figure 1.\n1. Surgically implant catheters in a femoral vein and artery for administration of the tracer and collection of timed arterial blood samples, respectively. Complete surgery at least 22 h prior to administration of the tracer. Surgery requires about 1 h to complete.\nGather necessary materials: sterile surgical instruments (surgical scissors, micro-scissors, forceps, three surgical skin hooks), equipment for isoflurane anesthesia (isoflurane vaporizer, active gas scavenger, sealed anesthesia chamber, anesthesia nose cone), sterile surgery stage, fur clippers, 70% ethanol, betadine, sterile gauze, surgical tape, commercial hand warmers, surgical microscope, sterile 0.9% sodium chloride (saline), sterile heparin 100 USP units/mL in 0.9% sodium chloride (heparinized saline), sterile five 20-cm strips of 6-0 absorbable suture, sterile 25-cm strands of PE-8 and PE-10 polyethylene catheters with one end cut at 45o, sterile 1 cc syringes, sterile 32 gauge needles, cautery equipment, sterile 15-20 cm hollow stainless steel rod (2.5 mm inside diameter, 3 mm outside diameter), local anesthetics (bupivacaine and lidocaine ointment), and an animal enclosure with swivel appendage setup (30 cm spring tether with button, swivel, swivel mount and arm, 20 X 13 cm clear cylindrical container).\nPrepare animal for surgery.\nAssure that proper aseptic and sterile techniques are used as required by your institution.\n\t\nWeigh the animal. The animal must be at least 25 g for successful surgery.",
    "Place the animal inside a sealed plexiglass chamber and connect the chamber to the isoflurane anesthesia apparatus. Set flow rate to 2.5 L/min for males and 3.0 L/min for females of 1.5% isoflurane in O2. After roughly 2 min, ensure the mouse is appropriately sedated by lack of a withdrawal reflex with a toe pinch.\nOnce sedated, remove the mouse from the chamber and lay it in a prone position with its face inside the anesthesia nose cone. Set up nose cone to receive gas from the vaporizer and to return gas to the gas scavenger. The scavenger will capture isoflurane in a charcoal filter.\nUse clippers to shave fur between the shoulder blades. Make sure to properly sterilize the shaved region, alternating three times between betadine and ethanol scrubs.\nFlip the mouse over into a supine position keeping the face in the nose cone. Tape down the left leg onto the surgery stage and use clippers to shave fur from the left inner thigh to the upper left abdomen. Make sure to properly sterilize the shaved region, alternating three times between betadine and ethanol scrubs.\nSlide an activated commercially available handwarmer, wrapped in gauze, under the mouse. Tape down the right leg onto the surgery stage.\nInsert catheter into the left femoral vein.\n\t\nWith the aid of a surgical microscope, use surgical scissors to make a 1 cm incision from the upper medial portion of the left thigh rostrally towards the midline, revealing the femoral artery and vein.\nRetract loose skin with surgical skin hooks to further expose the vesicles.\nApply sterile 0.9% sodium chloride to exposed area to maintain adequate moisture.\nUse forceps to blunt dissect, separating connective tissue around a small section of the femoral artery and vein. Carefully, separate the artery and vein (Figure 2).",
    "Use forceps to thread one strand of absorbable suture (Strand A) under both the femoral vein and artery at the most lateral point of the incision. Pull the suture halfway through so the ends are even.\nAt a more proximal point to the groin, use forceps to thread a second suture (Strand B) under only the femoral vein. Gently tie a half knot that will be used to restrict blood flow.\nAt a point between Strand A and Strand B, use forceps to thread a third suture (Strand C) under only the femoral vein. Gently tie a full knot that will be used to restrict blood flow. Be careful not to tear the vein.\nGently tug on Strand B to restrict blood flow. Use a hemostat to gently pull Strand B to maintain restricted blood flow.\nCut a small hole in the restricted area of the femoral vein with microscissors and carefully insert the angled end of the PE-8 tubing (previously flushed with heparin saline) towards Strand B. Once inserted, release Strand B’s tension and guide the catheter further up the vein. Tighten Strand B around the vein containing the catheter.\nUsing Strand C, tie an additional knot around the catheter. Make sure this knot does not capture the femoral artery.\nGently pull back on the syringe barrel to partially fill the tubing with blood to ensure that the catheter has been implanted properly.\nFollowing the same procedure, insert a PE-10 catheter into the left femoral artery.\nComplete surgical procedure.\n\t\nOnce both femoral vein and artery catheters have been secured, tie Strand A into a knot around both catheters.\nCut all excess sutures and remove skin hooks. Flush the arterial catheter with heparinized saline to prevent clotting. Cauterize the ends of both catheters to create a seal.",
    "Place the mouse in the prone position and make a small incision at the base of the neck and apply saline to the exposed area.\nInsert hollow metal rod subdermally from the neck incision to the femoral incision. Snake the catheters through the hollow rod and out of the neck incision. Remove the hollow rod. Implanting catheters subdermally will prevent mice from damaging the catheters.\nApply bupivacaine to the sides of the wound. Close the femoral incision with suture. Add lidocaine ointment over closed, sutured wound.\nSnake the catheters through a 30-cm flexible hollow tube (spring tether) and suture the button of the spring tether under the skin. Apply bupivacaine to the sides of the wound. Suture the button of the spring tether under the skin. Add lidocaine ointment over closed, sutured wound.\nMove the mouse into a clear cylindrical container (20 cm high, 13 cm diameter) with a swivel mount and arm to house the animal during the recovery period. Place a hand warmer under the container to keep the animal warm.\nScrew the top of the spring tether to a swivel and secure the swivel to the swivel arm attached to the cylindrical container. Make sure the mouse has full range of motion and the catheters can be accessed.\nPlace a slotted lid that does not interfere with the swivel mechanism over the animal enclosure. Refer to Figure 3 for the full setup.\nAllow the mouse to recover. At least 22 h is recommended.",
    "2. Prepare L-[1-14C]leucine solution for injection and 16% (w/v) 5-sulfosalicylic acid (SSA) dihydrate solution for deproteinizing plasma samples. In the SSA solution, also include 0.04 mM norleucine and 1 µCi/mL [H3]leucine as internal standards for amino acid analysis and analysis of tracer concentration in the acid-soluble plasma fractions, respectively. Store the SSA up to two months at 4 ˚C.\nPurchase commercially available L-[1-14C]leucine (50-60 mCi/mmol), which is sold as a solution in 2% ethanol or 0.1 N HCl. Blow dry a known activity of the tracer under a gentle stream of nitrogen and reconstitute in a solution of sterile normal saline made up to a concentration of 100 μCi/mL.\n3. Administer L-[1-14C]leucine intravenously and collect arterial blood samples.\nGather necessary materials: 18 1.5 mL microtubes for deproteinizing plasma samples (add 70 mL of deionized water to each tube), 17 250mL glass vial inserts (15 inserts for collection of arterial blood samples and 2 inserts for collection of dead space blood to be reinjected. To limit the collection of extra and unnecessary blood, small, thin glass vial inserts with tapered bottoms that allow for accessible pipetting of supernatant plasma is recommended), 2 microcapillary tubes (32 X 0.8mm, for hematocrit measurement), 1 heparin and lithium fluoride-coated microcentrifuge tube (to prevent clotting and glycolysis, respectively), hemostats (cover the tips with tygon tubing so that clamps will not damage PE tubing), blood glucose monitor, blood pressure transducer, 1 mL sterile syringes (for saline flushes), and commercially available euthanasia solution (diluted 1:1 in deionized water (for mice)).\nEnsure the animal is in a normal physiological state at the outset of the experiment.",
    "Clamp the arterial tubing about 2 cm from the end and cut off the tip, creating an opening for blood to flow. Then unclamp tubing and collect dead space blood ((c. 30 mL) to collect any residual saline and/or blood from previous draws), and, in a separate tube, collect a control sample (approx. 30 µL), hematocrit samples (about half of the capillary tube volume), and a glucose sample (approx. 20 µL).\nMeasure hematocrit by plugging one end with sealant putty and centrifuge for 1 min at 4500 x g. Measure the ratio of the volume of red cells to the total blood volume. If an animal has a hematocrit below 30%, do not continue the study.\nUse a commercially available blood glucose monitor to measure the glucose level in a drop of blood.\nCentrifuge control sample for 2 min at 18,000 x g to separate plasma. Deproteinize plasma samples as follows: add 5 µL of plasma to 70 µL of deionized water in a 1.5 mL microtube, add 25 µL of the 16% SSA solution and vortex. Place on ice for 30 min before freezing on dry ice.\nReturn dead space blood to the animal through the venous line, followed by a heparinized saline flush to prevent excess blood loss.\nConnect the arterial line to a blood pressure transducer to measure mean arterial blood pressure.\nAfter taking the samples be sure to re-clamp the arterial line and to flush the line with a small (50 mL) volume of heparinized saline.\nAdminister tracer intravenously and collect timed arterial blood samples.\n\t\nUse a Y-connector to attach one syringe with the tracer (100µCi/kg) and one syringe with 50 mL sterile saline to flush the venous line after injection of tracer. Connect Y-connector to the venous line.",
    "Initiate the study by simultaneously starting a stop watch and injecting the tracer. Flush the venous line with saline (c. 100mL) immediately following injection.\nCollect blood samples 1-7 continuously throughout the first 2 min of the experiment in the same manner. After collecting the 7th sample, collect 30 µL dead-space blood before each remaining sample. Samples 8-14 are collected at 3, 5, 10, 15, 30, 45, and 60 min, respectively.\nProcess blood samples immediately after collection, as was described for the control sample. If there is a delay, place the samples on ice. Carefully reinject dead space blood into the artery via the arterial catheter and flush with heparin saline.\nAt some point during the experiment, process three internal standards by adding 25 µL 16% SSA, 0.04 mM norleucine, and 1 mCi/mL [3H]leucine to 75 µL water, vortex and place on ice.\nAfter collecting the 14th sample at 60 min, inject approximately 0.2 mL of B-euthanasia-D into the venous line to euthanize the animal. Record the time of death.\nUnscrew the animal from the swivel mount and remove from the animal enclosure. Carefully remove the brain, place on aluminum foil, and freeze on dry ice. Do not freeze brains with liquid nitrogen as brains may crack. Store brain, samples, and internal standards at -80 ˚C until ready for processing. Processing can be performed at any point afterwards.\n4. Analyze concentrations of leucine and L-[1-14C]leucine in plasma samples.\nThaw samples and internal standards on ice, vortex, and centrifuge 18,000 x g for 5 min at 2 ˚C. The supernatant fraction will contain the free labeled and unlabeled leucine.",
    "Transfer 40 µL of the supernatant to a liquid scintillation vial and add scintillation cocktail. Quantify disintegrations per min (DPM) of 3H and 14C by means of liquid scintillation counting and a quench curve designed for simultaneous double-label (3H and 14C) counting.\nTo quantify plasma leucine concentrations, use an HPLC system with a sodium cation exchange column and post-column derivatization with o-phthaldehyde and fluorometric detection.\n\t\nSet HPLC to the following specifications: fluorometer excitation of 330 nm and emission of 465 nm. The mobile phase consists of sodium eluant, pH 7.40, and sodium eluant + 5% sulfolane, pH 3.15. Set the buffer flow rate of 0.400 mL/min and the derivatization instrument flow rate to 0.300 mL/min. Set the column temperature to 48 ˚C and reactor temperature to 45 ˚C.\nCalibrate the system with a range of amino acid concentrations (including norleucine) between 30 and 500 pmol/10mL. The calibration curve is linear. The amino acid concentrations of the tested 10 mL injection samples fall within the ranges of this calibration curve.\n5. Perform quantitative autoradiography.\nPrepare brain sections 20 µm in thickness for autoradiography. Section brain by means of a cryostat at -20 ˚C.\nThaw mount serial brain sections on gelatin-coated slides. Air dry.\nWash slides in five changes of 10% formalin for 30 min per change, followed by a continuous flow of deionized water for 1 h. Cover the slides loosely with foil to avoid dust and allow to dry for 24 h.",
    "Arrange slides in an X-ray film cassette (cassettes that fit 20X25 cm mammography films are recommended) along with a set of [14C]methylmethacrylate standards, which were previously calibrated against tissue of known 14C concentrations as described29. Standards can be commercially purchased but ensure that they cover a range of 2-300 mCi/g of tissue and are calibrated against 20 µm tissue thickness. Under red safelight, place a piece of mammography film, emulsion side down, on top of the sections.\nSeal the cassettes and place in a black changing bag and store in a cabinet for 40-45 days.\nDevelop films according to manufacturer’s directions. Note: Automated film development is not recommended because the background may be uneven and can affect quantification.\n6. Analyze images.\nNote: A commercially available program for image analysis coupled with a CCD camera and a fluorescent light box with even illumination is recommended. The relative optical densities in the illuminated film are detected by the CCD camera.\nConstruct a calibration curve of optical density (OD) v. tissue 14C concentration based on the ODs of the set of calibrated standards on the film. Fit these data (including the blank or background) to a polynomial equation. Either a second or third degree polynomial equation fits very well.\nTo analyze specific brain regions, locate the region of interest (ROI) in six to eight sections by comparison with a brain atlas. Record the ODs of the pixels within a ROI in all sections and, based on the calibration curve, compute the tissue 14C concentration in each pixel. Compute the average tissue 14C concentration in the ROI.\n7. Computation of rCPS. Compute rCPS in each ROI by means of the following equation:\nimgsrc://cloudfront.jove.com/files/ftp_upload/58503/58503eq1.jpg",
    "Where P*(T) is the weighted average tissue concentration of 14C in the ROI, Cp(t) and C*p(t) are the arterial plasma concentrations of unlabeled and labeled leucine at time, t, T is the time that the animal died (about 60 min), and λ is the fraction of leucine in the tissue precursor pool that comes from the plasma. Evaluation of λ is carried out in a separate experiment 6. λ has been evaluated in WT, Fmr1 knockout, Tsc+/-, and PKU mice 6,22,25,28. If an experiment involves either genetic or pharmacological changes that might affect rates of protein synthesis, degradation, or metabolism of leucine, λ should be evaluated under the new conditions.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}