{
  "id": 15027,
  "origin_website": "Jove",
  "title": "Two Infection Assays to Study Non-Lethal Virulence Phenotypes in C. Albicans using C. Elegans",
  "procedures": [
    "1. Preparatory steps for the experiments\nPreparing C. albicans and Escherichia coli cultures\n\tNOTE: The strains used in this study are listed in Table 1.\n\t\nMaintain C. albicans and E. coli strains as glycerol stocks at −80 °C.\nUsing a sterile toothpick, streak desired C. albicans strain onto solid yeast peptone dextrose (YPD) (1% yeast extract, 2% bactopeptone, 2% glucose, 1.5% agar, 0.004% adenine, 0.008% uridine) and grow overnight at 30 °C.\n\t\t​NOTE: If the C. albicans strain is auxotrophic, supplement the media with the necessary amino acids.\nUsing a sterile loop or toothpick, inoculate a single C. albicans colony into 2 mL of liquid YPD. Incubate at 30 °C with shaking for 24 h.\nUsing a sterile toothpick, streak E. coli (OP50) onto Luria Broth (LB; 10 g/L tryptone, 5 g/L yeast extract, 10 g/L NaCl, 15 g/L agar) agar plates. Incubate overnight at 30 °C.\nInoculate a single OP50 colony into 50 mL of LB. Incubate at 30 °C with shaking overnight.\nNematode growth media preparation\n\t\nIn a 2 L flask, add 29 g of nematode growth media powder (NGM; 17.5 g/L agar, 3.0 g/L Sodium Chloride, 2.5 g/L Peptone, .005 g/L cholesterol) to 1L of water and mix with a stir bar.\nTo inhibit E. coli overgrowth and allow C. albicans proliferation supplement NGM with 0.2 g/L streptomycin sulfate after autoclaving.\n\t\t​NOTE: If using NGM for nematode maintenance, streptomycin is not required.\nMaintaining nematode populations\n\t\nSpread 300 µL of overnight E. coli culture onto prepared NGM agar plates using a metal spreader. This technique will be referred to as seeding.\nAllow plates to dry at room temperature (RT). Grow plates overnight at 30 °C.",
    "Maintain nematode population by chunking every 3-4 days onto a newly seeded NGM plate with E. coli. Store at 20 °C. Chunking is a technique used to quickly transfer a random population of nematodes to a newly seeded plate, which allows for populations to proliferate. To do this, use a sterile spatula to cut a small square (1 x 1 inch) out of the NGM agar plate. Carefully transfer the square to a new seeded NGM plate with the side with the nematodes facing down on the new agar8.\n\t\tNOTE: C. elegans maintained at 20 °C will produce offspring ~48 h later which is useful to consider when synchronizing a population of nematodes. C. elegans maintained at 25 °C will develop and reproduce faster and populations maintained at 15 °C will have slower growth.\nNematode population synchronization\n\t\nBegin with an existing nematode population maintained on NGM/OP50.\nPipette ~3 mL of M9 buffer onto the NGM plate containing nematodes. Wash nematodes eggs off the plate and gently use the tip of the pipette to scrape eggs off the agar (they tend to stick). Using a P1000 pipette, transfer the liquid containing both eggs and worms to a 15 mL conical tube. To assess the number of eggs still on the plate, use a dissecting microscope to look at the agar.\nCentrifuge conical for 2 min at 279 x g and RT.\nRemove the supernatant, being careful not to disturb the nematode pellet.\nAdd 3 mL of 25% bleach solution (\"CAUTION\" when handling).\nInvert tube for 2 minutes. Check that the nematodes are dead using the dissecting microscope - they will be stick-straight and non-motile.\n\t\tNOTE: This will only kill the existing nematodes. The integrity of the eggs will not be affected.\nCentrifuge for 2 min at 279 x g and RT.",
    "Remove the supernatant and resuspend the pellet in 3 mL M9.\nCentrifuge for 2 min at 279 x g and RT.\nRemove the supernatant and resuspend the pellet in 300 µL of M9.\nUsing a dissecting microscope, check the concentration of eggs by pipetting 5 µL of eggs onto a small Petri plate. The ideal concentration should be between 20-100 eggs. If the culture is too dilute, concentrate the solution by centrifugation and removal of excess liquid. If the culture is too concentrated, add more M9 until the desired concentration is reached.\nPrepare C. albicans and E. coli cultures for nematode infection (seeding).\n\t\nPrepare a blank solution. In a cuvette, combine 900 µL of ddH2O and 100 µL of liquid YPD.\nInsert the cuvette into the spectrophotometer. Set the wavelength to 600 nanometers using the up arrow. Click on the button \"0 ABS 100% T\" to set the blank solution.\nIn a new cuvette, combine 900 µL of ddH2O and 100 µL of overnight yeast culture. Take the blank solution out of the spectrophotometer and add the cuvette containing the yeast solution. Record the optical density shown on the screen (do not press any buttons). Multiply the reading by 10 (the yeast solution measured was a 1 in 10 dilution).\nNormalize culture to 3.0 OD600/mL with ddH2O in a 1.5 mL microcentrifuge tube. 1 OD600 is approximately 3 x 10-7 CFU/mL21.\n\t\t​NOTE: If the OD600 reading is 6.7, 3 OD/6.7 OD= 0.447 mL, add 447 µL of C. albicans culture to the microcentrifuge tube. Centrifuge at maximum speed (16, 873 x g) for 30 s. Remove supernatant and resuspend in 1 mL of ddH2O.\nTransfer the overnight E. coli culture to a 50 mL conical tube.\nCentrifuge the culture at 279 x g for 2 min at RT.",
    "Aspirate a majority of the supernatant, leaving ~1 mL.\nResuspend the pellet in the remaining supernatant and transfer to a pre-weighed 1.5 mL microcentrifuge tube.\nSpin down the microcentrifuge tube at maximum speed for 30 s.\nUsing a p1000 pipette, remove the supernatant and weigh the final pellet.\nDilute E. coli to 200 mg/mL in ddH2O.\nUse master mix calculations (Table 2) and scale appropriately.\n2. Fecundity assay\nNOTE: Representative data in shown in Supplementary Table 1 and a schematic in shown in Figure 1A.\nObtain or prepare the following: 35 mm x 10 mm Petri plates, NGM supplemented with 0.2 g/L streptomycin sulfate, E. coli OP50 culture, LB, C. albicans culture, YPD, Wire Pick, M9 buffer (3.0 g/L KH2PO4, 6.0 g/L Na2HPO4, 0.5 g/L NaCl, 1.0 g/L NH4Cl), 15 mL conical tubes.\nTwo Days Prior to Experiment\nInoculate C. albicans strains in 2 mL of YPD and E. coli (OP50) in 50 mL of LB and grow overnight at 30 °C.\nPrepare 35 mm x 10 mm Petri plates with NGM supplemented with 0.2 g/L streptomycin sulfate. The number of plates prepared should last the whole experiment. The recommended number of replicates is 10 per treatment. For 10 replicates, 70 plates will be used. 1 L of NGM will make ~250 plates.\nOne Day Prior to Experiment\nSeed 35 mm x 10 mm NGM agar plates supplemented with streptomycin for Day 0, Day 2 & Day 3 according to the seeding protocol described above with the mastermix concentration (Table 2). Pipette the appropriate amount of mastermix onto the center of the plate. Spreading the culture is not necessary because a single spot of microbial growth is sufficient for host feeding and allows for us to easily identify hosts outside of the seed. Incubate the plates overnight at RT.",
    "NOTE: The Day 0 mastermix contains 50 µL of \"seed\" per replicate for each experimental treatment. Days 2 -7 include 10 µL of \"seed\" per replicate for each experimental treatment. There is no Day 1 plate because nematodes will reach the L4 stage 48 h after being synchronized onto a Day 0 plate. Once they reach L4, individual nematodes will be transferred to Day 2 plates.\ntable:\n﻿0,1,2,3,4,5,6,7\nFor 1 replicate,E. coli (OP50) control condition,E. coli (OP50) control condition,E. coli (OP50) control condition,C. albicans & E. coli (OP50) treatment condition,C. albicans & E. coli (OP50) treatment condition,C. albicans & E. coli (OP50) treatment condition,C. albicans & E. coli (OP50) treatment condition\nFor 1 replicate,OP50,H2O,Total,OP50,C. albicans,H2O,Total\nDay 0,6.25 ul,43.75 ul,50 ul,6.25 ul,1.25 ul,42.5 ul,50 ul\nDays 2-7,1.25 ul,8.75 ul,10 ul,1.25 ul,.25 ul,8.5 ul,10 ul\nTable 2: Mastermix volumes of E. coli and C. albicans cultures needed to infect nematodes for the fecundity assay.\nDay of Experiment (Day 0)\nSynchronize nematodes and plate ~50 eggs onto each Day 0 replicate of the control plates (OP50 only) and treatment plates (C. albicans + OP50). Incubate at 20 °C for 48 h.\nDay 2\nTransfer a single L4 nematode by picking8 from the Day 0 plate to each of the replicate Day 2 seeded plates. L4 hosts can be identified by a small pocket in the middle of the dorsal side of their body22. Transfer the nematodes hatched and matured from the same type of seeded plate (i.e., L4 nematodes from D0 control plates must be transferred to Day 2 control plates).\nInoculate C. albicans cultures needed in 2 mL of YPD and E. coli (OP50 strain) in 50 mL of LB.\nDay 3",
    "Transfer nematodes from Day 2 plates to Day 3 seeded plates, keeping track of each replicate (i.e., Replicate A from Day 2 must be moved to the Replicate A Day 3 plate).\nIncubate Day 2 (only containing eggs) and Day 3 (containing the single adult) plates at 20 °C for 24 h.\nSeed 35 mm x 10 mm NGM supplemented with streptomycin plates for Days 4 & 5 using 10 µL of mastermix per plate (Table 2) and incubate plates at RT for 24 h.\nDay 4\nTransfer nematodes from Day 3 plates to Day 4 seeded plates.\nIncubate Day 3 and Day 4 plates at 20 °C for 24 h.\nUsing a dissecting scope, count the viable progeny for each Day 2 plate. Note any replicates that died or are no longer on the plate (censored). Once the number of progeny are recorded, discard Day 2 plates.\n\tNOTE: Censored refers to nematodes that disappear on the plate. This can occur when nematodes crawl off the plate. Although less common during the 24 h window, dead nematodes' carcasses disintegrate into the agar also resulting in censorship. Censored data is not included in the final progeny and survival data analysis.\nInoculate new cultures of C. albicans strains in 2 mL of YPD and E. coli (OP50) in 50 mL of LB.\nDay 5\nTransfer nematodes from Day 4 plates to Day 5 seeded plates.\nIncubate Day 4 and Day 5 plates at 20 °C for 24 h.\nCount the viable progeny for each Day 3 plate. Note any replicates that died or are no longer on the plate (censored). Once the number of progeny are recorded, discard Day 3 plates.",
    "Seed 35 mm x 10 mm NGM supplemented with streptomycin plates for Days 6 & 7 using 10 µL of mastermix per plate (Table 2) and incubate plates at room temperature for 24 h.\nDay 6\nTransfer nematodes from Day 5 plates to Day 6 seeded plates.\nIncubate Day 5 and Day 6 plates at 20 °C for 24 h.\nCount the viable progeny for each Day 4 plate. Note any replicates that died or are no longer on the plate (censored). Once the number of progeny are recorded, discard Day 4 plates.\nDay 7\nTransfer nematodes from Day 6 plates to Day 7 seeded plates.\nIncubate Day 6 and Day 7 plates at 20 °C for 24 h.\nCount the viable progeny for each Day 5 plate. Note any replicates that died or are no longer on the plate (censored). Once the number of progeny are recorded, discard Day 5 plates.\nDay 8\nCount the viable progeny for each Day 6 plate. Note any replicates that died or are no longer on the plate (censored). Once the number of progeny are recorded, discard Day 6 plates.\nDay 9\nCount the viable progeny for each Day 7 plate. Do not count the largest nematode (parent). Note any replicates that died or are no longer on the plate (censored). Once the number of progeny are recorded, discard Day 7 plates.",
    "​NOTE: This assay can also be used to assess survival. Record when each nematode died. At the end of the experiment, the percentage of nematodes that survived over the seven-day experiment can be compared for each treatment. Nematodes will sometimes crawl away from the food/pathogen source and try to climb the slides of the Petri plate. Check all areas of the plate before moving on. Dead nematodes will generally leave behind a carcass. Censor any nematode that cannot be located and do not count that nematode as dead. Do not include censored data in the final analysis of progeny and survival.\nAnalyze data for brood size and late reproduction using either one-way ANOVA or Kruskal-Wallis, depending on the normality of the data sets, as well as post-hoc Tukey/Dunn's multiple testing to identify significant differences between the treatment groups using GraphPad Prism software. Detect differences between survival curves using the Wilcoxon log-rank test.\n3. Lineage Expansion Assay\nNOTE: Representative data in shown in Supplementary Table 2 and a schematic is shown in Figure 2A.\nObtain or prepare the following: 100 mm x 15 mm Petri plates containing NGM agar supplemented with 0.2 g/L streptomycin sulfate, E. coli OP50 cultures, LB, C. albicans cultures, YPD, M9 buffer, Wire Pick, 15 mL conical tubes.\nDay -2\nInoculate C. albicans strains in 2 mL of YPD and E. coli (OP50) in 50 mL of LB and grow overnight at 30 °C.\nDay -1",
    "Seed 100 mm x 15 mm NGM agar plates supplemented with streptomycin with 300 µL of mastermix per plate (Table 3). Spread the mastermix onto the plate using a sterile metal spreader. Incubate the plates overnight at 30 °C. Six replicates per treatment is recommended. Thus, prepare seven plates (One plate for synchronized nematodes, six plates for each adult nematode) per treatment.\ntable:\n﻿0,1,2,3,4,5,6,7\n,E. coli (OP50) control condition,E. coli (OP50) control condition,E. coli (OP50) control condition,C. albicans & E. coli (OP50). treatment condition,C. albicans & E. coli (OP50). treatment condition,C. albicans & E. coli (OP50). treatment condition,C. albicans & E. coli (OP50). treatment condition\nFor 1 replicate,OP50,H2O,Total,OP50,C. albicans,H2O,Total\nFor 1 replicate,1.25 ul,8.75 ul,10 ul,37.5 ul,7.5 ul,255 ul,300 ul\nTable 3: Mastermix volumes of E. coli and C. albicans cultures needed to infect nematodes for the lineage expansion assay.\nNematode population growth: Day 0\nSynchronize nematodes and plate 10-25 eggs on a single plate for each control (OP50 only) and treatment (C. albicans + OP50) and incubate at 20 °C for 48 h.\nDay 2:\nTransfer a single L4 worm from each control and treatment Day 0 plate to seeded plates of the same treatment. L4 hosts can be identified by a small pocket in the middle of the dorsal side of their body22.\nIncubate at 20 °C for 5 days (a total of one week following synchronization).\nDay 7:\nUsing a p1000 pipette, wash entire nematode population from each plate using 5 mL of M9 buffer and transfer to a 15 mL conical tube.\nStore at 4 °C for 1 h to allow the nematodes to settle for easier counting.\nDilute each conical to final volume of 10 mL with M9 buffer.",
    "For each biological replicate, count the number of nematodes in a 20 µL aliquot. Repeat this to obtain 6 technical replicates for each biological replicate. Back calculate to determine the total population size. If samples are too dilute (i.e., fewer than 10 nematodes per sample), concentrate the population in a smaller volume of M9 buffer.\n\tNOTE: Centrifugation of live nematodes will not harm the nematodes.\n\tExample calculation:\n70 Hosts           =               X (Total hosts)\n\t20 µL (aliquot)                  10,000µL (Total Volume)\nAnalyze data for lineage expansion using either one-way ANOVA or Kruskal-Wallis, depending on the normality of the data sets, as well as post-hoc Tukey/Dunn's multiple testing to identify significant differences between the treatment groups using GraphPad Prism software.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}