{
  "id": 3330,
  "origin_website": "Cell",
  "title": "Protocol for observing microtubules and microtubule ends in both fixed and live primary microglia cells",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nLive cell analysis: Sir-tubulin labeled microtubule length tracing\nTiming: 2 h (per time-lapse movie)\nThis step enables the analysis of microtubule dynamics by tracking changes in microtubule length between successive frames of a time-lapse movie. The analysis accounts for potential bending or movement of the microtubule and can be performed using tools available in ImageJ software.\nNote: This analysis has been adapted from Dhamodharan and Wadsworth 1995,12[href=https://www.wicell.org#bib12] Dhamodharan et al., 1995,14[href=https://www.wicell.org#bib14] Rusan et al. 2001.16[href=https://www.wicell.org#bib16]\nFor image preparation, use ImageJ for level adjustments of frame brightness and contrast, and background subtraction.\nMicrotubule tracing:\nUse ImageJ to open the movie obtained by recording SiR-tubulin labeled microglia.\nInvert LUT using ImageJ dedicated command.\nSelect a “substack” to extract from a stack a selected image in which microtubules are clearly visible.\nFrom “Image” menu, select “Stacks”, then “Tools” and “Make substack”.\nSelect one microtubule that is visible for the duration of the entire substack.\nChoose a reference point that is stable for the duration of the entire substack and make a note of its XY coordinates.\nStarting from the reference point, trace a line using the “Freehand line” tool, outlining the microtubule entire length.\nIf needed, draw the microtubule for future reference selecting “Draw” from the “Edit” menu.\nMeasure the length of the selection with the “Measure” command in the “Analyze” menu.\nChange frame and repeat, making sure to trace the line from the same reference point, until the end of the “substack”.\nReport the measurements and measure microtubule dynamics parameters:\nCopy the values into an Excel file.\nStarting from the second frame, measure the difference in length with the previous frame.\nFor each difference value, note if it represents a “growth” (positive value), “shrinkage” (negative value) or “pausing” (value ≤ 0.5 μm) event.",
    "For each “growth” or “shrinkage” event, divide the absolute value by the time interval between frames to obtain a “growth” or “shrinkage” rate in μm/s, and average all values to obtain an “average growth” or “shrinkage rate” in μm/s.\nCount the number of “growth”, “shrinkage” or “pausing” events and divide each one by the number of total events (“growth” + “shrinkage” + “pausing”) to obtain a percentage of “growth”, “shrinkage” and “pausing”.\nCalculate the total time of analysis (in seconds) by multiplying the number of frames by the time interval between frames.\nCount the number of transitions between “growth” and “shrinkage” (catastrophe) and vice versa (rescue).\nCalculate “catastrophe” or “rescue frequency” by dividing the number of “catastrophe” or “rescue” events by the product between the percentage of “growth” or “shrinkage” and the total time of analysis.\nCalculate microtubule “dynamicity” by dividing the sum of all the “growth” or “shrinkage” event absolute numbers by the total time of analysis.\nCritical: Draw the line as carefully as possible, comparing successive frames through the entire video to follow the behavior of the entire microtubule. This will help discriminate the microtubule when the frame is blurred or unclear. See Figure 1[href=https://www.wicell.org#fig1] as an example.\nNote: As an indication, at least 30 substacks per condition from three independent culture experiments should be analyzed for a treatment comparison.\nLive cell analysis: EB3-EGFP comet kymograph analysis\nTiming: 2 h (per cell)\nThis widely used procedure allows for the analysis of microtubule plus end dynamics and orientation in ramified segments of homeostatic microglia.\nNote: the signal of microtubule plus end binding (EB) proteins (later defined as “comet”) typically decays exponentially after the maximum at the microtubule end that is toward the microtubule lattice.17[href=https://www.wicell.org#bib17],18[href=https://www.wicell.org#bib18]\nObtain a kymograph from an EB3-EGFP microglia movie:",
    "Use ImageJ to open the movie obtained by recording EB3-EGFP comets in expressing microglia.\nInvert LUT using ImageJ dedicated command.\nSelect a “substack” based on the planes where the signal is bright and the EB3 comets are clearly trackable.\nWith the “Segmented line” tool, select the section that will be analyzed by the Kymograph plugin.\nNote: Adjust the line width to cover the region that will be analyzed and make a note of the value.\nFrom the ImageJ Plugin menu, select “Kymograph” and “Kymograph builder”.\nNote: The resulting kymograph displays the line length as X, and the time as Y (as displayed in Figure 2[href=https://www.wicell.org#fig2]). Make sure the values are based on the correct pixel-micron conversion by checking the original file properties from “Image” menu.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2917-Fig2.jpg\nFigure 2. Example of Projected kymograph and outline of Complete comets\n(A) Frame from a movie obtained from EB3-EGFP expressing homeostatic microglia (Scale bar: 20 μm). The yellow line is obtained with the «Segmented line » tool, with known width and indicates the region from which the kymograph is obtained in B. The direction of the drawn line is highlighted by the arrow and will determine the direction of the comets in the kymograph in B.\n(B) Projected kymograph with Complete comets highlighted in yellow and numbered with the ImageJ ROI manager. Comets number 1, 2, 6 and 13 are defined as Retrograde.\nCalculate the percentage of anterograde and retrograde comets.",
    "Note: The direction of the drawn line will determine the direction of the comets (as explained in Figure 2[href=https://www.wicell.org#fig2]): by drawing the line from the proximal part of the process towards the distal part with respect to the nucleus, the resulting kymograph will display anterograde comets as directed from left to right, while retrograde comets will be directed from right to left (Figure 2[href=https://www.wicell.org#fig2]B).\nComet analysis (optional):\nReport on an Excel file the Frame interval, the Number of analyzed frames and the Duration of the analyzed substack, obtained by multiplying the number of analyzed frames for the frame interval.\nReport the analyzed cell Process length and Process width in μm, defined by the length and the width of the drawn line, respectively.\nOn the Projected kymograph, outline with the “Freehand line” tool the complete comets to be analyzed and add them to the ROI Manager, from the “Tools” section in the “Analyze” menu. See Figure 2[href=https://www.wicell.org#fig2] for an example of Projected kymograph and Complete comets.\nNote: Comets are defined as “complete” if not intersecting with the borders of the Projected kymograph and the start and the end of it are clearly identifiable.\nMicrotubule dynamics analysis (optional):\nFor each comet outlined in the Projected kymograph, measure Length of growth (covered distance on the X axis) and Comet lifetime (projection on the Y axis of the comet trajectory) as in Figure 3[href=https://www.wicell.org#fig3].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2917-Fig3.jpg\nFigure 3. Example of Comet lifetime and Length of growth measurement X and Y projections of the comet (highlighted in yellow) represent Length of growth and Comet lifetime, respectively (dashed lines, black)\nConvert the value of the Comet lifetime from microns to seconds.",
    "Note: The width of the drawn line in pixels (Process width in pixels) will define the number of pixels corresponding to the Y axis of the kymograph; by multiplying this number for the pixel dimensions in microns (determined by the camera and the objective used during acquisition) the Value of the Y axis of the kymograph (microns) will be obtained. The conversion of the Comet lifetime value from micron to seconds will be therefore obtained as [(Comet lifetime in microns ∗ Duration of analyzed substack in seconds) / Value of the Y axis of the kymograph in microns].\nCalculate comet Growth rate as Length of growth / Comet lifetime and the other desired parameters accordingly.\nNote: the number of kymographs that provide a statistically valid sample size will be dependent on the length of the lines that can be drawn to cover the extension of a process (or most of the cell area in the case of an amoeboid cell). Approximately, one should collect a number of kymographs to cover at least 10 processes per experiment (e.g., at least 2 kymographs per microglia, 5 microglia per experiment) and three independent experiments.\nFixed cell analysis: EB1 fluorescence gradient analysis\nTiming: 2 h\nThe comet-shaped accumulation of EBs at microtubule ends, with the intensity of comet tail decaying exponentially from the maximum at the microtubule end, enables the measurement of fluorescence intensity gradients of EB-positive comets relative to the location of the nucleus. Although live imaging of EBs remains the gold standard technique, this approach is straightforward and reproducible in our hands. This method enables the definition of anterograde or retrograde comets by using the fluorescence intensity gradient of endogenous EB protein signal from immunolabeled fixed cells. This method can also be applied to single frames of EB3 movies.",
    "Open images of EB1 and Tyr-tubulin from immunostained microglia cells in ImageJ.\nUsing the signal of Tyr-tubulin as a reference, identify EB1 comets at the plus end of tyrosinated microtubules.\nMeasure fluorescence intensity signal of EB1 at the tip of the microtubule defined by Tyr-tubulin:\nOpen the EB1 channel.\nInvert LUT.\nWith the “Freehand line” tool, draw a line starting from the end of the comet proximal to the nucleus.\nNote: depending on the microtubule distribution and on the cell shape, the fluorescence gradient of different comets may occur at varying degrees relative to the direction or trajectory: draw the lines accordingly. Select as many clearly detectable (e.g., bright signal at the maximum of the tip of the comet, with comet tail intensity decaying exponentially) comets as possible. At least 100 comets will be needed from at least three independent experiments.\nIncrease the line width to cover the width of the comet.\nWith the “Plot profile” command from the “Analyze” menu, obtain a line scan of the selection for each comet.\nIf the peak of the line scan is in the second half of the plot, define the comet as Anterograde. Otherwise, define as Retrograde, as in Figure 4[href=https://www.wicell.org#fig4].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2917-Fig4.jpg\nFigure 4. Analysis of EB1 fluorescence intensity gradients\nExample of analysis of EB1 fluorescence intensity gradients from homeostatic microglia. Top: representative image of microglia immunolabeled for tyrosinated α-tubulin (Tyr tub, green) and microtubule end binding protein EB1 (magenta), Hoechst for nuclei visualization (blue), and EB1 inverted LUT signal (left); Scale bar: 20 μm.",
    "Bottom: zoom of regions A (magenta) and B (green) highlighted in EB1 inverted contrast image (scale bar: 2 μm) and relative analysis: a line is drawn following the direction of the arrow, from the proximal to the distal part of the cell with respect to the nucleus. If the peak of the line scan is in the second half of the graph, the comet is defined as Anterograde (A1, B1), otherwise as Retrograde (A2, B2)."
  ],
  "subjectAreas": [
    "Cell Culture",
    "Biotechnology And Bioengineering",
    "Antibody",
    "Microscopy"
  ],
  "bigAreas": [
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}