{
  "id": 2228,
  "origin_website": "Cell",
  "title": "In utero electroporation and cranial window implantation for in vivo wide-field two-photon calcium imaging using G-CaMP9a transgenic mice",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nIn utero electroporation\nTiming: 30 min per pregnant mouse\nThis protocol describes the critical steps of in utero electroporation to introduce Flp recombinase in layer 2/3 pyramidal neurons in the right hemisphere of the barrel cortex.\nPrepare glass capillaries (I.D.: 1.17 mm, O.D.: 1.50 mm) using a puller (P-97, Sutter). The detail of the parameters is shown in Table 3[href=https://www.wicell.org#tbl3]. After pulling, break the tip of the capillaries with fine forceps so that the tip diameter is approximately 50 μm.\ntable:files/protocols_protocol_1700_5.csv\nNote: Pulled glass capillaries are irradiated with U.V. for 15 min before use.\nAdd 1/20 volume of 1.0% dye (Fast Green) to the plasmid solution used for injection and fill the glass capillary.\nCritical: We used the mixture of pCAG-Flpo and pCAG-mCherry plasmids, in which Flpo and mCherry are expressed under the control of the CAG promoter (Miyazaki et al., 1989[href=https://www.wicell.org#bib5]; Seita et al., 2016[href=https://www.wicell.org#bib10]). The plasmid solution (see materials and equipment[href=https://www.wicell.org#materials-and-equipment] section) should be purified using an endotoxin-free kit[href=https://www.mn-net.com/media/pdf/18/eb/8f/Instruction-NucleoBond-Xtra-EF.pdf]. The G-CaMP9a fluorescence induced by Flp recombination is very dim. Therefore, to identify the electroporated region, we recommend mixing a plasmid encoding red fluorescent protein (e.g., mCherry).\nNote: The plasmid solution is made each before use.\nAttach the glass capillary to the suction tube and suck up 10 μL plasmid solution (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1700-Fig2.jpg\nFigure 2. Mouth-controlled micropipette\n(Top) A glass capillary containing DNA solution is attached to the suction tube. A syringe filter is installed between the mouthpiece and the tube for safety. The glass capillary is inserted into the ventricle, and the plasmid solution with dye is injected through the mouthpiece by exhalation. (Bottom) Glass capillary is marked every millimeter. One millimeter corresponds to 1 μL.",
    "Critical: The plasmid solution should be loaded very slowly to prevent air bubbles. Injection of bubbles will likely result in the embryo’s death.\nNote: For safety, a syringe filter with a 0.22 μm pore size is installed between the mouthpiece and the tube via a luer fitting.\nNote: Use a ruler to mark every 1 mm on the outside of the capillary. One millimeter corresponds to 1 μL.\nAnesthetize a pregnant mouse (E15.5) with an intraperitoneal injection of an anesthetic mixture (see materials and equipment[href=https://www.wicell.org#materials-and-equipment]). An anesthetic mixture is administered at 100 μL per 10 g of body weight (BW).\nAlternatives: Some alternative anesthetic methods are available, including ketamine/xylazine and isoflurane.\nWait 10 min and make sure that the mouse has been anesthetized by pedal reflex and breathing deeply and steadily.\nAdminister carprofen (dissolved in saline; 5.0 mg/kg-BW, subcutaneously) and dexamethasone (dissolved in saline; 2.0 mg/Kg-BW, intraperitoneally) to relieve pain and inflammation, respectively.\nPlace the mouse on its back on the operating table and fix the limbs with surgical tape (Figure 3[href=https://www.wicell.org#fig3]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1700-Fig3.jpg\nFigure 3. Significant steps of in utero electroporation\n(A) Fix limbs with surgical tape.\n(B) Remove hairs from the abdomen with a razor.\n(C) Make an incision through the skin with fine scissors.\n(D) Make an incision through the abdominal wall with fine scissors.\n(E) Pull the uterus out of the abdominal cavity.\n(F) Inject plasmid solution with dye into the lateral ventricle of the embryo. If the plasmid solution is correctly placed in the lateral ventricle, a blue crescent-like line can be visualized on the injection site (white dotted line).\n(G) Hold embryo with electrodes and deliver electric pulses.\n(H) Suture the abdominal cavity and skin.\n(I) Suture the skin.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1700-Fig4.jpg\nFigure 4. Operating table for in utero electroporation",
    "(Left) Top view of the table. (Right) Side view of the table.\nNote: We use an operating table shown in Figure 4[href=https://www.wicell.org#fig4]. To better position and fix the animal, when the pregnant mouse is placed on the table with a heating pad, styrofoam platforms at both ends will be the same height as the limbs. We lay a surgical drape on the table during the surgery. The surgical tape connects the two sides of the styrofoam platforms. Make sure the mouse limbs are secured.\nCritical: Warm the mouse on a heating pad at 37°C during the surgery.\nApply white petrolatum ointment to the eyes for physical protection and prevent dehydration using small cotton tips.\nSterilize the abdomen with 70% ethanol.\nRemove hairs from the abdomen with a razor (Figure 3[href=https://www.wicell.org#fig3]B).\nPinch the skin through the slit with micro-adson forceps and make a ∼30-mm-long midline incision through the skin and then the abdominal wall with fine scissors (Figures 3[href=https://www.wicell.org#fig3]C and 3D).\nCritical: Avoid hurting the nipples of the dam. It will result in poor feeding of the pups.\nCritical: The surgery should be finished within 30 min completely (from incision to the closure of the skin). Prolonged procedures cause embryo death and abortion.\nCover the abdomen with sterilized gauze with a ∼30 mm slit in its center.\nWet the gauze with warm saline (40°C) by transfer pipette.\nNote: The saline is transferred to a sterile beaker and warmed in a water bath.\nAttach a ring forceps to the uterus at a gap between embryos and carefully pull the uterus out of the abdominal cavity (Figure 3[href=https://www.wicell.org#fig3]E).\nCritical: Immediately after uterus exposure and before electroporation, the embryos should be wet with warm saline to avoid excessive cooling and to favor current flow during electroporation.",
    "Inject with 1 μL plasmid solution into the lateral ventricles of the embryos by exhalation (Methods video S1[href=https://www.wicell.org#mmc1]).\nNote: The capillary is inserted vertically into the lateral ventricles. It is approximately 1 mm depth from the uterine wall.\nCritical: When plasmids with dye are appropriately placed in the lateral ventricle, a blue crescent-like line can be visualized on the injection site (Figure 3[href=https://www.wicell.org#fig3]F).\nHold the plasmid-injected head of the embryo with forceps-type electrodes and deliver five electric pulses with an electroporator (Figure 3[href=https://www.wicell.org#fig3]G). The detail of the parameters is shown in Table 4[href=https://www.wicell.org#tbl4].\ntable:files/protocols_protocol_1700_6.csv\nCritical: The position and polarity of the electrodes are very critical. Make sure the anode is pointing at the targeted cortical area. In addition, make sure that the electrodes (especially the platinum tip) are clean. Before delivering electric pulses to embryos, make sure that air bubbles appear on the electrodes’ surface when electric pulses are delivered into saline.\nCritical: Pulse intensity and duration are key parameters. When increasing these parameters, the efficiency of the electroporation will increase. However, if these are too high, neurons expressing G-CaMP9a will be unhealthy or dead. In some cases, it can lead to abortion. Therefore, we recommend a voltage in 25–35 V.\nAlternatives: We use a 5 mm platinum disk electrode. Another 3 mm platinum disk electrode (CUY650P3, Nepa Gene) is also available. In that case, the electroporated region will be smaller.\nReturn the uterus carefully into the abdominal cavity.\nFill the abdominal cavity with warm saline by a transfer pipette.\nSuture the abdominal cavity with microneedle holder and suture with surgical needle (Figure 3[href=https://www.wicell.org#fig3]H).\nSuture the skin with microneedle holder and suture with surgical needle (Figure 3[href=https://www.wicell.org#fig3]I).\nAdminister atipamezole hydrochloride (0.75 mg/kg-BW, intraperitoneally) to reverse medetomidine-induced anesthesia.\nRemove the surgical tape and transfer the mouse to a clean recovery cage.",
    "Warm the mouse on a heating pad at 37°C until the mouse recovers from the anesthetic.\nTransfer the mouse to the original cage.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1700-Fig5.jpg\nFigure 5. Fluorescence after the delivery by green light LED illumination\nNote: Within 48 h of birth, the electroporated site is confirmed by detecting red fluorescence expression (filler plasmid) over the skin under green light LED illumination (Figure 5[href=https://www.wicell.org#fig5]). The expression can be seen in the entire somatosensory cortex and sometimes in the visual cortex. Because of the low copy number of G-CaMP9a, it is not possible to see the G-CaMP9a fluorescence on the skin by blue light LED illumination. After the screening, we remove pups that do not have red fluorescence at that time.\n    Your browser does not support HTML5 video.\n  \nMethods video S1. Injection of DNA solution with dye into the lateral ventricle, related to step-by-step method details (step 15)\nHeadplate fixation\nTiming: 40 min per mouse\nThis part describes the critical steps of headplate attachment for in vivo two-photon calcium imaging. This surgery is performed after one month of age. The headplate is attached to the barrel cortex of the right hemisphere.\nTransfer the mouse into an anesthesia induction chamber and induce deep anesthesia with 3% isoflurane and 1.0 L/min airflow.\nTransfer the mouse from the chamber to the mouse adaptor and anesthetize with 1.5%–2.0% isoflurane and 1.0 L/min airflow.\nOptional: Injecting anesthetic mixture is also available.\nAdminister carprofen (dissolved in saline; 5.0 mg/kg-BW, subcutaneously) and dexamethasone (dissolved in saline; 2.0 mg/Kg-BW, intraperitoneally) for the relief of pain and inflammation, respectively.\nApply white petrolatum ointment to the eyes for physical protection and prevent dehydration using small cotton tips.\nTrim the hair on the scalp with a pair of fine scissors.",
    "Apply hair-removal cream over the trimmed scalp and wait 5 min. Then, clean it off using small cotton tips.\nCritical: Make sure that hair-removal cream does not leave any residue on the eyes.\nApply 70% ethanol over the trimmed scalp for sterilization and wash off residual hair and hair-removal cream using small cotton tips.\nSecure the head in a mouse adaptor by engaging ear bars (Figure 6[href=https://www.wicell.org#fig6]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1700-Fig6.jpg\nFigure 6. Significant steps of headplate fixation and cranial window implantation\n(A) Remove hair over the scalp.\n(B) Incise the scalp.\n(C) Cut the scalp skin on both sides of the incision.\n(D) Push remaining skin to the side with small cotton tips.\n(E and F) Before scratching the skull with fine forceps. Panel F is a higher magnification of the skull in panel E.\n(G) After scratching the skull with fine forceps.\n(H) Apply superglue on a titanium headplate.\n(I and J) Attach the headplate with superglue. Panel J is a higher magnification of the skull in panel I.\n(K) Glue the headplate with dental acrylic on the headplate.\n(L) Glue the headplate with dental acrylic to the skull by filling the space under the headplate and exposing the skull.\n(M) Mark the area where the cranial window will be made.\n(N) Drill the skull of the inside of the circle made in panel M.\n(O) Peel away the thinned skull with fine forceps.\n(P) Clean the dura.\n(Q) Place the coverglass and press it with a toothpick.\n(R) Apply surgical superglue to the edge of the coverglass.\n(S) Apply dental acrylic surrounding the coverglass.\n(T) Dry the dental acrylic completely.\nApply lidocaine jelly (2%, 0.3 g) over the trimmed scalp for local anesthesia using small cotton tips. Wait 5 min for local anesthesia.\nIncise the scalp.",
    "Open the skin above the skull (∼30 mm) with a fine scissor (Figure 6[href=https://www.wicell.org#fig6]B).\nCut the scalp skin (∼30 mm) on both sides of the incision (Figure 6[href=https://www.wicell.org#fig6]C).\nNote: Only skin without hair should be removed. Otherwise, cutting hair will irritate the wound.\nPush remaining skin to the side with small cotton tips (Figure 6[href=https://www.wicell.org#fig6]D).\nScratch the exposed skull with fine forceps (Figures 6[href=https://www.wicell.org#fig6]E–6G).\nNote: Superglue and dental acrylic bond better to the rough surface.\nApply superglue to the titanium headplate (Figure 6[href=https://www.wicell.org#fig6]H).\nAttach a custom-made titanium headplate to the skull with superglue (Figure 6[href=https://www.wicell.org#fig6]I).\nCritical: Keep pushing the headplate from the top for a while to get firmly attached to the headplate cranium.\nWait at least 10 min to dry the superglue completely.\nGlue the headplate with dental acrylic to the skull by filling the space under the headplate and exposing the skull. (Figures 6[href=https://www.wicell.org#fig6]K and 6L).\nCritical: Cover all the exposed bone because the open wound might get infected. Since the ear bars block space below the headplate, the mouse must be detached from the adaptor. Then, continue filling dental acrylic under the headplate with the mouse in your hand (Figure 6[href=https://www.wicell.org#fig6]L).\nCritical: To dry dental acrylic completely, wait 10 min.\nCranial window implantation\nTiming: 120 min per mouse\nThis part describes the critical steps of cranial window implantation.\nPlace the coverglass (#0 thickness, 3 mm diameter) over the skull and drill around it to mark where the cranial window will be made (Figure 6[href=https://www.wicell.org#fig6]M).\nNote: The skull where the cranial window will be made is removed in step 41. If the skull is removed beyond 3 mm in diameter, the exposed brain will not fit within the coverglass. Otherwise, surgical superglue (see step 44) and dental acrylic (see step 46) penetrate the brain.",
    "Drill the skull inside of the circle made in step 39. Continue to thin until there is a small crack or the skull can be easily pushed with gentle pressure with fine forceps (Figure 6[href=https://www.wicell.org#fig6]N).\nCritical: Rash punctures cause long-term inflammation leading to high autofluorescence of the brain, cell death, and consequently poor quality of neuronal imaging. It is best to use the drill speed at 3,000–5,000 rpm. Also, prolonged drilling in the same position will cause overheating and damage the brain tissue and blood vessels. Such damage may cause bruising or bleeding under the bone in the thinned part of the skull. The skull should be cooled and cleaned with saline and gently sprayed periodically with compressed air.\nPeel away the thinned skull gently with fine forceps when some cracks are visible (Figure 6[href=https://www.wicell.org#fig6]O).\nCritical: Do not try to force the bones to strip off. If you force it to come off, it will damage blood vessels and cause bleeding. If it is still hard, drill further to remove a thin layer of bone. If bleeding occurs, use a gelatin sponge moisturized with saline to stop the bleeding immediately.\nCritical: It is reported that two-photon imaging in the deep brain region (at a depth of 600–800 μm) is possible in the presence of dura (Augustinaite and Kuhn, 2020[href=https://www.wicell.org#bib1]). Therefore, we think the dura should be kept intact throughout the surgery. Attempted dura removal can lead to bleeding.\nClean the dura with a gelatin sponge moisturized with saline by a transfer pipette (Figure 6[href=https://www.wicell.org#fig6]P).\nCritical: Make sure no bleeding when adding a drop of saline to the dura.\nPlace the coverglass on the dura pressing on its center with a toothpick, and make sure there is no bleeding (Figure 6[href=https://www.wicell.org#fig6]Q).",
    "Note: Clean the coverslip with 70% ethanol and sterilize them with U.V. light before use.\nCritical: Do not proceed if bleeding starts. Remove the coverglass and clean the dura with a gelatin sponge moisturized with saline.\nWhile pressing on the center of the coverglass with a toothpick, apply surgical superglue (Aron alpha A) to the edge of the coverglass using a blunt needle (Figure 6[href=https://www.wicell.org#fig6]R).\nCritical: Pressing the coverslip prevents the spread of the surgical superglue under the coverglass. It is also important to reduce motion artifacts during imaging.\nWait 10 min to dry the surgical superglue completely.\nCritical: Make sure that the surgical superglue completely seals the glass periphery. If not, apply an additional seal to it.\nApply dental acrylic to hide the exposed cranium except for the coverglass (Figures 6[href=https://www.wicell.org#fig6]S and 6T).\nCritical: To dry dental acrylic completely, wait 10 min.\nApply silicone sealant to protect the exposed region from light.\nRemove the mouse from the mouse adaptor.\nTransfer the anesthetized mouse to a clean recovery cage.\nWarm the mouse on a heating pad at 37°C until the mouse recovers from the anesthetic.\nAfter waking up from anesthesia, transfer the mouse to the original cage."
  ],
  "subjectAreas": [
    "Neuroscience",
    "Microscopy",
    "Model Organisms",
    "Developmental Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}