{
  "id": 1650,
  "origin_website": "Cell",
  "title": "Accelerated protocol for the differentiation of podocytes from human pluripotent stem cells",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nGrowing human iPSC in feeder-free culture with mTeSR medium\nTiming: ∼ 7 days\nNote: The timing for human iPSC thawing is around 30 min.\nPrepare Geltrex or Matrigel coated plates (see materials and equipment[href=https://www.wicell.org#materials-and-equipment]).\nTransfer 5 mL of warmed mTeSR media (see materials and equipment[href=https://www.wicell.org#materials-and-equipment]) into a 15 mL tube.\nThaw a frozen vial of hiPSC containing at least 1.5–2.0 × 106 cells in a 37°C water bath with gentle shaking until the ice starts to melt.\nTransfer hiPSCs in a drop-wise manner into the 15 mL conical tube containing 5 ml prewarmed media (iPSC passage media). Gently rotate the tube to mix the cells with the media. Centrifuge the cells for 5 min at 300 × g at room temperature.\nRemove the supernatant and add 3 mL of fresh iPSC passage media (see materials and equipment[href=https://www.wicell.org#materials-and-equipment]).\nSeed the cells onto plates coated with Geltrex or Matrigel i.e., 1.5 × 106 into one well of a 6-well plate. Make sure that cells are distributed evenly by rocking back and forth gently to distribute the cells and incubate at 37°C in a 5% CO2 incubator.\nAfter 24 h, change the iPSC passage media to regular mTeSR media.\nChange the media every day.\nCritical: Changing media every day is very crucial since iPSCs proliferate quickly. Lack of nutrients in the exhausted media will lead to cell detachment and death.",
    "Note: Different iPS cell lines are grown in different starting media such as StemFlex or Essential 8. We have used StemFlex and Essential 8 in substitution for mTeSR for cell lines requiring these media types. Cells should be approximately 70%–80% confluent after 7 days of culture. If cells do not reach this confluency, allow them to grow until they reach confluency. The cells can be cryopreserved or differentiated when they reach confluency. Follow the instructions below for cryopreservation or differentiation.\nHuman iPSC passage\nTiming: 30 min\nPrepare Geltrex or Matrigel coated plates (see materials and equipment[href=https://www.wicell.org#materials-and-equipment]).\nRemove the media from the hiPSCs in the 6-well plate.\nWash the cells with 3 mL of PBS three times. Aspirate PBS.\nAdd 1 mL per well of Accutase to cells and incubate at 37°C for 5 min.\nAdd 2 mL per well of warm mTeSR to the cells, mix, and ensure cells have lifted off from the plastic surface.\nCritical: Do not pipette cells more than twice as hiPSCs are very sensitive to mechanical perturbation.\nCollect cells in a 15 mL tube. Count the cell number using a hemocytometer.\nCritical: Automatic cell counters should be validated with a hemocytometer before use. Some commercial machines do not accurately count iPSC due to their unique shape.\nCalculate required volume to achieve 1.5 × 106 iPSC per well of the 6-well plate. Aliquot the iPSC to be plated into a 15 mL tube and centrifuge at 300 × g for 5 min.\nRemove the supernatant and gently resuspend the cells in iPSC passage media (see materials and equipment[href=https://www.wicell.org#materials-and-equipment]).\nSeed the cells onto the Geltrex or Matrigel coated plates. Make sure that cells are distributed evenly by gently rocking back and forth and incubate at 37°C in a 5% CO2 incubator for 24 h.",
    "The iPSC will attach and grow colonies and will be 20%–30% confluent on Day 1. If the cells do not attach and grow after 24 h, do not attempt to use the cells for differentiation. Lower cell density leads to spontaneous differentiation of iPSCs.\nHuman iPSC cryopreservation\nTiming: 30 min\nRinse the cells 3 times with PBS and add 1 mL of Accutase per 6-well plate.\nIncubate the cells at 37°C and 5% CO2 for 5 min or until the cells start to detach. Incubate for 2–3 min more if the cells do not start to detach.\nCritical: Do not overdigest the cells with Accutase, as this will result in cell death (Figure 6[href=https://www.wicell.org#fig6]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1113-Fig6.jpg\nFigure 6. Brightfield images of human iPSC after Accutase treatment\n(A) Prolonged Accutase treatment results in over-digestion resulting in single cells with more debris (white arrows) when resuspended.\n(B) Cells treated for the optimal time are in clumps (black arrows) after resuspension. Scale bar is 200 μm.\nAdd 3 mL of fresh mTeSR media to the dissociated cells, mix, and ensure cells have lifted off from the plastic surface.\nCritical: Do not pipette cells more than twice as hiPSCs are very sensitive to mechanical perturbation.\nCollect cells in a 15 mL tube. Count the cell number using a hemocytometer.\nCentrifuge the cells for 5 min at 300 × g at room temperature.\nRemove the supernatant and gently resuspend 2×106 cells per mL of a cryopreservation medium consisting of 90% FBS and 10% DMSO. Alternatively, commercially available cryopreservation media such as Cryostor can be used.\nAdd 1 mL of cell suspension per cryopreservation tube.\nPlace the tubes into a cryovial freezer box and freeze at −80°C for 24 h.\nTransfer the tubes to a liquid nitrogen cell storage tank for long-term cryopreservation.",
    "Note: To start a live culture from a frozen vial, follow steps 1–8.\nhiPSC plating for differentiation\nTiming: ∼1 day, day 0\nFollow steps from 9–14.\nNote: Earlier passage cells (P1–P25) are better for differentiation. If the morphology looks different while passaging, check for pluripotency before beginning differentiation.\nCalculate required cell volume to achieve 1 × 105 iPSC per well of the 12-well plate.\nAliquot the iPSC to be plated to a 15 mL tube and centrifuge at 300 × g for 5 min.\nRemove the supernatant and gently resuspend the cells in iPSC passage media (see materials and equipment[href=https://www.wicell.org#materials-and-equipment]).\nSeed the cells on the Geltrex/Matrigel plates. Make sure that cells are distributed evenly by rocking back and forth and incubate at 37°C in a 5% CO2 incubator for 24 h.\niPS cells will attach and grow colonies and will be 30%–40% confluent on Day 1 (Figure 2[href=https://www.wicell.org#fig2]). If the cells have not reached the desired confluency, they may grow for one additional day prior to proceeding.\nDifferentiation of human iPSCs into the posterior primitive streak\nTiming: 2 days, day 1–2\nPrepare primitive streak induction media (see materials and equipment[href=https://www.wicell.org#materials-and-equipment]).\nAspirate the iPSC passage media from cells and add 2 mL primitive streak media per well of a 12-well plate.\nCulture the cells in primitive streak media for 2 days without changing the media.\nPrimitive streak cells have a triangular shape morphology are 40%–50% confluent (Figure 2[href=https://www.wicell.org#fig2]).\nInduction of intermediate mesoderm\nTiming: 3 days, day 3–5\nPrepare intermediate mesoderm induction media (see materials and equipment[href=https://www.wicell.org#materials-and-equipment]).\nAspirate the primitive streak media from the cells and add 2 mL per 12-well plate intermediate mesoderm media.\nRefresh medium every day and let the induction of mesoderm continue until day 5.",
    "The intermediate mesoderm cells will start to proliferate and reach 55%–60% confluency (Figure 2[href=https://www.wicell.org#fig2]).\nCritical: Since the cells start to proliferate, the rate of consumption of growth factors and supplements will increase. Make sure to add sufficient media (i.e., 2 mL for each well of a 12-well plate), since the lack of nutrients will lead to cell death.\nInduction of nephron progenitor cells\nTiming: 2 days, day 6–7\nPrepare nephron progenitor differentiation medium (see materials and equipment[href=https://www.wicell.org#materials-and-equipment]).\nAspirate the medium from the intermediate mesoderm cells and incubate with 2 mL per 12-well plate of nephron progenitor medium.\nRefresh medium daily.\nCulture cells in nephron progenitor medium for 2 days.\nThe intermediate mesoderm cells will start to form clumps and will have 60%–70% confluency (Figure 2[href=https://www.wicell.org#fig2]).\nCritical: As the cells start to proliferate, the rate of consumption of growth factors and supplements will increase. Make sure to add sufficient nephron progenitor media, since the lack of nutrients will lead to cell death.\nNote: FGF9 concentration below 200 ng/mL may result in an inefficient induction of the nephron progenitors.\nDerivation of mature kidney podocytes on laminin-coated plates\nTiming: 5 days, day 8–12\nPrepare laminin-511-coated plates (see materials and equipment[href=https://www.wicell.org#materials-and-equipment]).\nPrepare podocyte induction medium (see materials and equipment[href=https://www.wicell.org#materials-and-equipment]).\nRemove the intermediate mesoderm differentiation medium from cells and wash cells one time with PBS.\nAdd Accutase (0.5 mL per well for 12-well plates) to cells and incubate for 5 min at 37°C.\nVisualize cells under the microscope to ensure the cells are properly dissociated into either individual cells or small clumps.\nCritical: It is important to avoid bigger clumps since it leads to poor podocyte differentiation.\nPipette the cells gently 3 times and transfer the cells to a 15 mL tube. Add fresh nephron progenitor media to the tube to quench the Accutase.",
    "Centrifuge cells at 300 × g for 5 min and aspirate the supernatant. Resuspend the cells with podocyte induction media at a 1:4 dilution ratio to plate 2.5 × 105 cells per well of a laminin-511-coated 12-well plate.\nChange the podocyte induction media daily.\nThe derived podocytes are characterized by a large cell body and arborized morphology (Figure 2[href=https://www.wicell.org#fig2]). The iPSC-derived podocytes may be used for further studies at this point.\nEndpoint analysis of iPSC-derived podocytes by immunostaining\nTiming: 2 days, day 13\nRemove the media from the podocytes and wash the cells with PBS twice.\nFix the cells in 4% paraformaldehyde (PFA) in PBS by adding 1 mL per well of a 12-well plate for 15 min. Then wash the cells with PBS twice.\nBlock the samples by adding 1 mL per well of 12-well plate in PBS-BT for 30 min.\nStain with the desired primary antibodies diluted in 2% BSA for either 4 h at room temperature (RT) or 24 h at 4°C (Table 1[href=https://www.wicell.org#tbl1]).\ntable:files/protocols_protocol_1113_5.csv\nWash the cells with 500 μL PBS per well of 12-well plate twice by aspirating and adding fresh PBS. Incubate the cells with the corresponding secondary antibody (Table 1[href=https://www.wicell.org#tbl1]).\nStain the nuclei with DAPI diluted 1:1000 in PBS for 5 min and visualize using a fluorescent microscope.\nFor F-actin staining, fixed cells may be stained with phalloidin and DAPI instead (Figure 5[href=https://www.wicell.org#fig5]).\nEndpoint analysis of iPSC-derived podocytes by flow cytometry analysis\nTiming: 1–2 days, day 13\nRemove the media from the podocytes and wash the cells with PBS twice.\nAdd 1 mL of 0.05% trypsin per well of 12-well plates and incubate at 37°C for 5 min.\nAdd 2 mL of warm DMEM/F12 to the cells, mix, and ensure cells have lifted off from the plastic surface.",
    "Collect cells in a 15 mL tube and centrifuge at 300 × g for 5 min.\nWash the cells with 1 mL of PBS twice. Aspirate PBS.\nFix the cells in 1 mL of 4% paraformaldehyde (PFA) in PBS for 15 min. Then wash the cells with 500 μL of 2% BSA twice by centrifugation at 400 × g for 2 min after each wash. Remove the supernatant.\nFor intracellular staining, permeabilize the cells with 100% cold ethanol for 10 min at 4°C, then centrifuge at 400 × g for 2 min. Remove the supernatant and wash the cells with 2% BSA for twice with centrifugation. Remove the supernatant.\nBlock the samples by adding 1 mL of 5% BSA in PBS for 30 min, then centrifuge briefly at 400 × g for 2 min. Remove the supernatant and wash the cells with 2% BSA for twice with centrifugation. Remove the supernatant.\nDepending on the secondary antibodies being used, separate the desired isotope controls. These controls are samples that will only be treated with secondary antibody and no primary antibody.\nStain with the desired primary antibodies (200 μL) diluted in 2% BSA for either 4 h at RT or 24 h at 4°C (Table 1[href=https://www.wicell.org#tbl1]).\nWash with 2% BSA and aspirate the supernatant. Incubate the cells with 200 μL of the corresponding secondary antibody diluted in 2% BSA for 2 h at RT or for 24 h at 4°C (Table 1[href=https://www.wicell.org#tbl1]). Wash with PBS twice and resuspend the cells in 200 μL PBS.\nAnalyze the cells using a flow cytometer and compare to the negative isotype controls using FlowJo software (Figure 3[href=https://www.wicell.org#fig3]C).\nEndpoint analysis of iPSC-derived podocytes by FITC albumin uptake assay\nTiming: 1 day, day 13",
    "Remove the media from the podocytes and incubate with podocyte induction medium for 24 h.\nWash the cells with PBS two times by aspirating and replacing with fresh PBS.\nTo evaluate the temperature-dependent endocytosis of albumin in podocytes add 50 μg/mL FITC-conjugated bovine serum for either 1 h at 4°C or 37°C for 24 h to the podocytes.\nVisualize endocytosis with a fluorescent microscope."
  ],
  "subjectAreas": [
    "Stem Cells",
    "Biotechnology And Bioengineering",
    "Cell Culture",
    "Tissue Engineering",
    "Developmental Biology",
    "Cell Differentiation"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}