{
  "id": 4541,
  "origin_website": "Bio",
  "title": "Preparation of Golgi Membranes from Rat Liver",
  "procedures": [
    "About 30 mg rat liver tissue is excised from six male Sprague-Dawley rats (weighing 200-300 g each) fed ad libitum the day before the Golgi-membrane preparation. The tissue is placed into 100 ml ice-cold 0.5 M sucrose solution and squeezed to expel the blood. Then, the tissue is minced to a fine purée with scissors in 140 ml ice-cold 0.5 M sucrose solution, and then homogenised for 30 sec at 12 Watt using an Ultraturrax homogeniser (or equivalent) at 4 °C.    The homogenate is centrifuged for 10 min at 600 x g at 4 °C.    The supernatant (~120 ml in 0.5 M ice-cold sucrose solution) is then split into 20 ml aliquots, each of which is slowly layered onto an 18 ml 1.3 M sucrose cushion by being carefully dripped down the side of the 38.5 ml centrifuge tubes (so as not to disturb the cushion) for the SW28 (or equivalent) swing-out rotor. Centrifuge the cushion plus homogenate supernatant for 60 min at 105,000 x g at 4 °C in an SW28 swing-out rotor. This results in the formation of: (a) an upper fat layer; (b) a clear reddish supernatant; (c) a thick membrane felt layer above the 1.3 M sucrose interface; (d) a turbid 1.3 M sucrose supernatant; and (e) a sediment at the bottom of the tube.   The interface between the 1.3 M and 0.5 M sucrose layers (~2.5 ml per tube) is collected and used for the preparation of the Golgi-rich fraction. This is collected by carefully puncturing the tube at the middle of the interface with an 18 gauge needle (3.8 cm long) and using a syringe to extract the interface. This is gently resuspended and the molarity of the sucrose adjusted to 1.1 M by adding 2.",
    "3 M sucrose (usually to a final volume of ~16 ml), with the aid of a Bausch and Lomb (or equivalent) refractometer. The volume is then brought to a total of 18 ml with 1.1 M sucrose.    The suspension is split into two 9-ml aliquots that are layered onto sucrose gradients that are previously prepared using 7.5 ml each of 1.4 M, 1.3 M and then 1.25 M sucrose, layered on top of each other from the bottom of the cellulose acetate tubes (using the same tubes as in step 3) for the SW28 (or equivalent) swing-out rotor. Finally, the 1.1 M sucrose sample layer is covered with 6.5 ml 0.5 M sucrose solution. These stages are all carried out with care taken not to disturb or mix the layers of the gradient in any way. Prior to the layering of the sample onto the 1.25 M sucrose, the prepared gradients are stored for at least 20 min at 4 °C.   These are centrifuged for 90 min at 105,000 x g at 4 °C, and then the Golgi-enriched membrane fraction is collected at the interface between the 0.5 M and 1.1 M sucrose (as for step 4).    The collected Golgi-enriched membrane fractions are pooled and assayed for protein concentration using a commercially available protein assay kit, according to the manufacturer instructions. This provides an estimate of the yield of the Golgi fraction and its contamination with rough endoplasmic reticulum membranes and/or free ribosomes. The yield for the Golgi-enriched fraction is about 1.5 mg to 2.0 mg of protein per 1 g liver. The pooled Golgi-enriched membrane fractions are then aliquoted as required, frozen in liquid nitrogen, and stored at -80 °C.",
    "Routinely, for batch control variations, Western blotting analysis of the Golgi-enriched fraction protein is performed using antibodies against Golgi-localised and/or endoplasmic reticulum-localised proteins (e.g., anti-mannosidase and anti-protein disulphide isomerase antibodies, respectively).   To solubilise these Golgi-enriched membranes for use in pull-down assays, 4 mg Golgi-enriched membrane proteins (800 μl) are diluted two-fold (1:1) in 10 mM HEPES (pH 8.0), 50 mM KCl, with protease and phosphatase inhibitor cocktails added, centrifuged (10 min, 20,000 x g, 4 °C). This wash step is then repeated again, resuspending the Golgi-enriched membrane pellets in 800 μl of the same buffer.   The final Golgi-enriched membrane pellet is resuspended in 400 μl 20 mM HEPES (pH 8.0), 100 mM KCl, 1% Triton X-100, 2 mM EDTA, with protease and phosphatase inhibitor cocktails added, and solubilised for 30 min at 4 °C.    The solubilised suspension is then diluted 1:1 with water (to a final 800 μl volume), and centrifuged for 10 min at 2,000 x g at 4 °C. The supernatant from this final centrifugation is used as the “solubilised Golgi-enriched membranes”."
  ],
  "subjectAreas": [
    "Cell Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}