{
  "id": 3496,
  "origin_website": "Cell",
  "title": "Michaelis-Menten Kinetics Measurements of Aldo-Keto Reductases for Various Substrates in Murine Tissue",
  "procedures": [
    "Step-By-Step Method Details\nStep-By-Step Method Details\nPulverization and Lysis of Tissue\nTiming: 2 h\nIn order to maximize the yield of cytosolic proteins, the tissue of interest should be grounded to a fine powder prior to lysis. In our experience this is not achievable using electrical homogenizer, ultrasonic disruption techniques, or aggressive extraction buffers, which would interfere with the subsequent measurement of enzyme activity. Therefore, a common mortar and pestle is required. In our lab, we have designed a metal based mortar and pestle which allows for more efficient grinding of the tissues (Figures 1[href=https://www.wicell.org#fig1]A and 1B and Methods Video S1[href=https://www.wicell.org#mmc1]). It is critical that the mortar and pestle as well as any additional tools such as spatulas are kept at an extremely low temperature in order to avoid thawing of the material (Troubleshooting 1[href=https://www.wicell.org#sec7.1]). This is achievable using a bucket, which is filled permanently with liquid nitrogen (Methods Video S1[href=https://www.wicell.org#mmc1]). As it is difficult to effectively weigh the pulverized material without thawing, a reference to a filled \"spoon\" has been made in this protocol. For most samples, one \"spoon\" of tissue powder can then be used for 200 μL of lysis buffer. The lysis of the tissue has to be performed at 4°C. For every sample a new 1 mL syringe and 20-gauge needle should be filled with the appropriate amount of lysis buffer, depending upon the amount of samples and/or spoons taken (Methods Video S2[href=https://www.wicell.org#mmc2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/307-Fig1.jpg\nFigure 1. Self-Made Mortar and Pestle Construction for Grinding Frozen Tissue to Powder\n(A) Open.\n(B) Closed.\nPulverization of tissue\nPlace a tissue sample of around 0.3–10 mg in the precooled mortar\nGrind the tissue into a fine powder\nTake 1–5 \"spoons\" of powder and transfer it into 1.5 mL precooled tubes, which are then put on dry ice",
    "Aspirate the remnants of powder with a vacuum pump in order to avoid contamination of the next tissue sample\nCritical: Every item which is in contact with the pulverized material should be precooled in liquid nitrogen. Including the mortar, pestle, tubes, spatulas, and whatever is needed when aliquoting the pulverized material. Experimenter should use 2–3 gloves to avoid cold burn when following this protocol.\nLysis of tissue\nFor each \"spoon\" (~25 mg) of tissue, 200 μL of cytosolic lysis buffer is required.\nAdd an appropriate amounts of lysis buffer to a syringe, ensuring that all air has been removed from the top of the needle\nPush the needle gently trough the lid of the tube\nHomogenize the tissue by passing the lysis buffer 20 times through a 20-gauge needle (Methods Video S2[href=https://www.wicell.org#mmc2])\nIncubate the tissue homogenates on ice for 5 min and then centrifuge for 10 min at 10,500 × g. Protein concentration of the soluble fraction should be determined using the standard Bradford or BCA assay (Troubleshooting 2[href=https://www.wicell.org#sec7.3])\nFor enzyme activity measurement, samples should be diluted to final concentration of 5–10 μg/μL with lysis buffer\nCritical: During lysis with the needle and syringe, there is the potential for pressure to build up in the tube. This can be avoided by gently opening the lid of the tube every 5 times of buffer passing through the needle. It is also possible that the needle becomes blocked. If this occurs, then the needle should be replaced with a new one in order to avoid the increase of under-/overpressure in the tube.\n        Your browser does not support HTML5 video.\n      \nMethods Video S1. Pulverization of Liver Tissue Using a Special Mortar and Pestle\n        Your browser does not support HTML5 video.\n      \nMethods Video S2. Process of Lysis of Tissue Powder Using a Syringe Technique",
    "Aldo-Keto Reductase Enzyme Assay\nTiming: 2 h\nThe enzyme activity of AKR is determined in 0.1 M sodium phosphate buffer (pH 7.2) containing the appropriate amount of substrate of interest (Table 1[href=https://www.wicell.org#tbl1]). The reaction is monitored at 37°C by following the loss of NADPH at 340 nm with a microplate reader. For each substrate concentration it is important to run four blanks in parallel in order to correct for autoxidation of NADPH. The setup at the microplate reader can differ between the manufacturers, but it is important to configure a path length correction which is defined by the used 96-well plate and the final volume (200 μL) (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/307-Fig2.jpg\nFigure 2. Software-Specific Settings at FLUOstar OMEGA Multiplate Reader\n(A) Microplate can be chosen on a drop down scale.\n(B) Wavelength has to be set to 340 nm.\n(C) Path length correction has to be turned on and depends on the microplate used (A) and the final volume in the plate.\n(D) One cycle per minute; 30 cycles in total should be recorded.\nPreparation of samples and blanks and plate loading\nFor each sample and concentration prepare 125 μg of protein lysate in 25 μL assay buffer\nBlank 1 consists of enzyme assay buffer with the addition of 50 μL lysis buffer (substitutes the sample)\nA 96-well clear flat bottom microplate is loaded from top left to right bottom (Figure 3[href=https://www.wicell.org#fig3])\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/307-Fig3.jpg\nFigure 3. Possible Microplate Setup for 20 Liver Samples Quantifying Two Different Substrate Concentrations (Yellow/Turquoise)\nBlank should be run in quadruplicates and all samples are loaded in duplicates (10 μL per well)\nFinalize the assay buffer with the appropriate concentrations of the substrate of interest and NADPH\nAdd 190 μL of the assay buffer in a prompt fashion using a multichannel pipette",
    "Monitoring the loss of NADPH and calculation of enzyme activity\nStart to monitor the absorption at 340 nm over a period of 30 min with measurements every 1 min (Troubleshooting 3[href=https://www.wicell.org#sec7.5])\nAfter completion of the measurement period, the slope should be determined once it has a linear character\nUse the mean of the duplicate values to calculate the slope per minute and normalize the raw data of the slope/min by the blank\nThe slope is normalized by the extinction of NADPH and protein content to achieve the U/mg (please refer to formula below) (Vander Jagt and Hunsaker, 2003[href=https://www.wicell.org#bib4])\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/307-Si1.jpg\nOptional: For some substrates in some tissues, it is possible to reduce the amount of cytosolic lysates (e.g., 20 μg/well) due to the naturally high basal enzyme activity of AKR (e.g., methylglyoxal in kidney tissue). The formula above has to be multiplied by 50 (instead of 20) in order to normalize for the lower total protein content. Furthermore, it is possible to run a positive control in your assay. This can be achieved by adding 0.01 μg/μL recombinant AKR1a1 or AKR1b1 protein, both representing the the isotypes with the highest activity and physiological relevance."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Metabolism",
    "Protein Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}