{
  "id": 18345,
  "origin_website": "Jove",
  "title": "Analyzing Beneficial Effects of Nutritional Supplements on Intestinal Epithelial Barrier Functions During Experimental Colitis",
  "procedures": [
    "All animal experiments have been approved by the Institutional Animal Care and Use Committee of Cinvestav.\n1. Preparation of DSS Drinking Water and the Induction of Colitis\nPrepare a 3.5% w/v dextran sulfate sodium (DSS) solution in autoclaved drinking water. DSS dissolves easily and it is not required to filter the final solution.\n\tNOTE: 7 days of DSS treatment induces severe colitis. If inducing mild colitis, 3 - 4 days of treatment are recommended. As long as the DSS drinking water stays clear, it is not necessary to change the water. However, if it turns turbid, it must be replaced.\nRecord the baseline weight of male mice. Ensure that they are 8 - 12 weeks of age and within a range of 21 - 25 g bodyweight.\n\tNOTE: The appropriate DSS concentration must be optimized in each laboratory. Results can greatly vary, depending upon the housing conditions. Concentrations between 2.5 - 5% are usually reported to induce strong colitis in C57Bl/6J WT mice10. DSS from different companies and different lots should be tested, as results may also vary with different sources of DSS.\nProvide water ad libitum and replace it with fresh 3.5% DSS water if necessary.\n2. Application of Nutritional Supplements by Gavage\nPrepare a \"feedable\" solution of the desired nutritional supplements in an appropriate solvent. For this study, we used a mixture containing 200 mg/kg L-arginine, 83 mg/kg vitamin C, 46 mg/kg vitamin E, 77 mg/kg eicosapentaenoic acid (EPA), and 115 mg/kg docosahexaenoic acid (DHA) in a 1:1 solution of water and safflower oil.\nFill a 1-mL syringe connected to a gavage needle (15 G x 50 mm) with the nutritional supplement mixture. Wipe the outside of the gavage needle to remove any compound outside of the needle and to ensure proper dose application.",
    "Restrain the mouse by grasping the base of the tail with one hand and by firmly gripping a skin fold at the back of the neck with the thumb and forefinger of the other hand. Place the tail between the third finger and the base of the thumb of the same hand that holds the neck.\nWhile maintaining the mouse in an upright position, insert the needle into the left side of the animal's mouth and carefully follow the roof of the mouth to locate the esophagus. If no resistance is encountered, advance the needle towards the stomach.\n\tNOTE: Verify that the animal is breathing properly before proceeding.\nAdminister the mixture slowly, remove the tube by slowly pulling out the syringe, and release the mouse. Apply nutritional supplements once daily by gavage during the course of the colitis experiment.\n3. Determination of the Disease Activity Index\nNOTE: The disease activity index is the combination of the scores for weight loss, perianal bleeding, and stool consistency, which are obtained daily13.\nMeasure the bodyweight daily and assign a score of 0 to 4 according to the weight loss percentage (0: 0%, 1: 1 - 5%, 2: 5 - 10%, 3: 10 - 20%, and 4: > 20%).\n\tNOTE: Bodyweight loss is determined by calculating the difference in percent between the basal weight before the induction of DSS-colitis and the actual weight.\nTo determine the level of perianal bleeding, collect a fresh stool sample and use the provided applicators to apply a thin smear on a slide from a guaiac fecal occult blood test kit. Use a fresh applicator for each sample.\n\t\nClose the cover on the front and open the window on the back of the slide. Apply two drops of the developer solution to the back at the sample location.",
    "Read the results after 30 s. Any trace of blue color is positive for occult blood. Assign a score of 0 to 4 (0: none, 0.5 - 2.5: positive guaiac fecal occult blood test (depending upon the signal strength), and 3 - 4: gross bleeding).\n\t\tNOTE: If blood in the stool is visible, the guaiac fecal occult blood test does not have to be performed, and a score of 3, 3.5, or 4 is assigned, depending upon the amount of visible blood.\nDetermine stool consistency by observing a fresh stool sample. Assign a score of 0 to 4 (0: normal/solid, 0.5 - 2.5: pasty stool, and 3 - 4: diarrhea).\n4. Determining Intestinal Epithelial Permeability In Vivo by Evans Blue Assay\nAnesthetize the animals by injecting them intraperitoneally with a mixture of ketamine (100 mg/kg of bodyweight) and xylazine (13 mg/kg of bodyweight) diluted in saline solution (0.9% NaCl), and assess the depth of anesthesia by monitoring the pinch withdrawal reflex.\nPlace the anesthetized animals in a supine position and perform a laparotomy to expose the intestines.\nLocate the cecum and make a small incision in the proximal segment of the colon ascendens (ideally, immediately adjacent to the cecum).\nInsert a feeding needle (G22) and secure it with a ligature using a common silk thread. Carefully flush abundant PBS through the tube to rinse out all feces from the colon. Instill Evans blue solution (1.5% w/v in PBS) into the colon until it reaches the anus.\nIncubate the Evans blue for 15 min. Wash out the dye by flushing the tube with abundant PBS until the perianal washout is clear.\nEuthanize the animals by cervical dislocation.",
    "Excise the colon and rinse it again with abundant PBS. Rinse once with 1 mL of 6 mM N-acetylcysteine in PBS to eliminate any dye sticking to the colonic mucus.\nCut the colon longitudinally and rinse it once more with PBS and 1 mL of 6 mM N-acetylcysteine.\nRecord the weight and length. To extract the Evans blue dye, place the colon in 2 mL of N,N-dimethylformamide overnight at room temperature with gentle agitation. Measure the dye concentration spectrophotometrically at 610 nm.\n5. Tissue Collection\nAnesthetize the animals by injecting them intraperitoneally with a mixture of ketamine (100 mg/kg of bodyweight) and xylazine (13 mg/kg of bodyweight) diluted in saline solution (0.9% NaCl), and assess the depth of anesthesia by monitoring the pinch withdrawal reflex.\nEuthanize the animals by cervical dislocation.\nPlace the animals in a supine position and perform a laparotomy to expose the abdominal cavity.\nUsing scissors, dissect the entire colon and record its length.\nFlush the colon carefully several times with chilled PBS to remove the feces. Record the tissue weight and prepare for the following experiments, as described in steps 5.6 - 5.8.\nFor RNA isolation and myeloperoxidase (MPO) assays, cut off an appropriately-sized tissue sample (100 mg is usually sufficient), place it inside a tube, and snap-freeze it in liquid nitrogen. Store the tissues at -80 °C for future use.\nFor immunofluorescence staining and oxidative stress determination (see below), cut a small colon sample (0.5 - 1 cm) and submerse it in small aluminum cups filled with optimal cutting temperature (OCT) compound. Place the cups on dry ice and let them freeze slowly, in order to avoid bubble formation. Frozen tissue samples can be stored at -80 °C for future use.",
    "For Swiss rolls14, open the colon longitudinally and carefully remove feces using forceps. Roll it up, with the mucosa facing inwards, using fine-tipped forceps or a thin, round wooden stick. Carefully place it inside an embedding cassette and continue with step 6.1.\n\tNOTE: DSS induces damage in the colon. However, damage distribution varies from the proximal to the distal colon, with most damage usually seen in the distal colon and rectum. Thus, we recommend analyzing the histology either in the distal colon or in Swiss roles of the entire colon.\n6. Analysis of Colon Histology by Hematoxylin-eosin Staining\nTissue Preparation\nFor the histological analysis, submerge either the Swiss rolls or the small tissue pieces from certain colon regions of control and treated mice in 5 mL of 10% formaldehyde for 48 h at room temperature (RT) to achieve proper fixation.\n\t\tNOTE: All further steps in step 6 are carried out at RT, unless otherwise indicated.\nWash them with tap water for 18 h.\nDehydrate them with 15 mL of 70% ethanol for 1 h, 96% for 1 h, and absolute ethanol for 1 h. Repeat each step with fresh alcohol before proceeding to the next concentration.\nContinue the dehydration in a mixture of 7.5 mL of absolute ethanol and 7.5 mL of absolute xylene for 1 h. Repeat once before passing the samples to 15 mL of absolute xylene for 1 h. Repeat this step once with fresh xylene.\nEmbedding Colon Tissue Samples in Paraffin\nImmerse the samples in 50 mL of liquid paraffin for 17 h. Repeat this step once but for only 3 h.\nImmerse the samples in cubes (plastic, square mold, size: 22 x 22 x 22 mm) in 810 mL of liquid paraffin.",
    "Allow the paraffin with the colon tissue samples to solidify for 24 h at RT.\nCutting Tissue Cross-sections using a Microtome\nCut colon samples using a microtome, according to the manufacturer's instructions, at a thickness of 5 µm.\nCollect the cuts in a water bath (1 L) containing 0.3% gelatin. This prevents the folding of tissue cross-sections. Recover the tissue sections and mount them on glass slides.\nHematoxylin and Eosin Staining of Tissue Cross-sections\nDeparaffinize the samples for 18 h at 60 °C in an incubator. For this purpose, use a glass slide rack with a handle.\nAfter deparaffinization, immerse the slides in 70 mL of absolute xylene for 5 min. Repeat this step once with fresh xylene.\nTransfer the samples into 70 mL of absolute alcohol for 1 min. Repeat this step once with fresh alcohol.\nIncubate the colon tissue samples in 70 mL of ethanol 96% for 1 min. Repeat this step once with fresh alcohol.\nWash the samples in tap water twice for 2 s.\nIncubate the tissues in Harris hematoxylin for 7 min.\nWash the samples in tap water twice for 2 s.\nIncubate the samples in acidic alcohol (70 mL of ethanol 70% and 700 µL of 1 M hydrochloric acid) for 7 s.\nWash the samples in tap water twice for 2 s.\nIncubate the tissue samples in 70 mL of lithium carbonate (1 g of lithium carbonate in 100 mL of distillated water) for 7 s.\nWash the samples in tap water twice for 2 s.\nIncubate the samples in 70 mL of ethanol 80% for 1 min.\nTransfer the samples into 70 mL of Eosin-Y for 15 s.\nIncubate them in 70 mL of 96% ethanol for 1 min. Repeat this step once with fresh alcohol.",
    "Incubate the tissue samples in 70 mL of absolute ethanol (ethyl alcohol absolute anhydrous) for 1 min. Repeat this step once with fresh alcohol.\nIncubate the samples in 70 mL of a mixture of 35 mL of absolute alcohol and 35 mL of absolute xylene for 1 min.\nTransfer the samples into 70 mL of absolute xylene for 1 min. Repeat this step for 5 min in 70 mL of fresh absolute xylene.\nAdd 80 µL of synthetic resin to the colon tissue samples, cover them with coverslips, and let them dry for 24 h at RT. Finally, analyze the samples using bright-field microscopy8.\n7. Analyzing Junction Composition by Immunofluorescence\nPrepare the tissue as described in step 5.7 and cut 8 µm-thick cross-sections using a cryostat.\nFix and permeabilize colon cross-sections with 96% ethanol at -20 °C for 20 min.\n\tNOTE: All subsequent incubations should be carried out at RT, unless otherwise stated, in a humid dark box to prevent drying and fluorochrome fading.\nAir-dry samples, and then rinse them 3 times for 5 min each with 1x PBS\nIncubate the samples with blocking solution (PBS containing 0.01% Tween and 2% BSA) for 2 h.\nRemove the blocking solution and rinse it with PBS-0.01% Tween for 10 min.\nDuring this time, dilute the primary antibodies to the desired concentrations in PBS-0.01% Tween.\nRemove the washing solution, apply the antibody solution from the previous step, and incubate overnight at 4 °C in a humidified box.\nRemove the antibody solution and wash 3 times with PBS-0.01% Tween for 5 min each and once with deionized water for 10 min, with very gentle agitation.\nWhile washing, centrifuge fluorochrome­conjugated, species-specific secondary antibodies at 14,000 x g for 20 min at 4 °C.",
    "Dilute the secondary antibodies without precipitates as indicated by the provider in PBS-0.01% Tween, apply them, and incubate for 1 h at RT.\nRepeat step 7.8 and remove the washing solution as completely as possible.\nPipette 4 µL of anti-fading agent over each sample on the slide.\nCover the samples with a coverslip.\nAir dry for 1 h.\nSeal slide with nail polish. Slides can be stored at -20 °C until further analysis.\nAnalyze on a confocal laser microscope8.\n8. Determination of Oxidative Stress by Oxidation of Ethidium\nAfter 7 days of DSS colitis, prepare tissue as described in step 5.7 and cut colon sections in a cryostat at a thickness of 5 µm. Mount cross-sections onto glass slides treated with poly-L-lysine solution and incubate the samples with 5 µM of dihydroethidium (DHE) in water at 37 °C for 30 min in the dark.\nWash the samples with PBS (pH 7.6) three times for 15 min each with gentle agitation at RT. Air dry the samples and add a drop of mounting medium to protect the fluorescence. Observe the fluorescence of oxidized ethidium on a laser-scanning confocal microscope (40X magnification, 568 nm wavelength).\n9. Analysis of Leukocyte Recruitment by MPO Assay\nAfter 7 days of DSS colitis, collect colon tissue and homogenize the samples (200 - 400 mg) with 1 mL of hexadecyltrimethylammonium (HTAB) buffer (0.5% HTAB in 50 mM phosphate buffer, pH 6.0) using a homogenizer on ice.\nRinse the tip of the homogenizer twice with 1 mL of HTAB buffer to include all tissue in the lysate and sonicate it five times at 40% amplitude for 10 s each. Freeze-thaw in liquid nitrogen three times.",
    "Centrifuge at 14,000 x g for 15 min and collect the supernatant. Prepare 2,2'-azino-bis(3-ethylbenzothiazoline-6-sulphonic acid) (ABTS) solution by mixing ABTS, 5 mL of sodium citrate (1 M in water), 0.1 mL of hydrogen peroxide, and 45 mL of bi-distilled water.\nMix 0.1 mL of each supernatant with 0.1 mL of ABTS solution in a 96-well flat-bottomed plate. After 10 min, measure the absorbance at 460 nm using a spectrophotometer.\n10. Evaluating the Expression of Pro-inflammatory Cytokines by PCR\nTissue Homogenization\nHomogenize 50 to 100 mg of colon tissue samples in 1 mL of an acid guanidinium thiocyanate-phenol-chloroform mixture using a power homogenizer.\nIncubate it at room temperature for 15 min.\nPhase Separation\nAdd 0.2 mL of chloroform and shake vigorously for 30 s.\nIncubate at 4 °C for 30 min.\nCentrifuge at 12,000 x g for 60 min at 4 °C.\nTransfer the upper aqueous phase into a fresh tube (~500 µL).\nRNA Precipitation and Resuspension\nAdd 0.5 mL of isopropyl alcohol and incubate the samples at 4 °C for 60 min.\nCentrifuge at 12,000 x g for 30 min at 4 °C.\nRemove the supernatant completely.\nAdd 1 mL of ethanol 75% and vortex.\nCentrifuge at 12,000 x g for 30 min at 4 °C.\nRemove the supernatant.\nAllow the remaining ethanol to air-dry for 3-5 min.\n\t\tNOTE: It is important not to let the RNA pellet dry completely, as this will greatly decrease its solubility.\nRe-dissolve the pellet in 0.3 mL of diethylpyrocarbonate (DEPC)-treated water. Immediately transcribe the RNA samples into cDNA (more stable, see step 10.5) or store at -80 °C.\nRNA Quantification\nDilute 1 µL of RNA with 99 µL of DEPC-treated water.\nRead the OD at 260 nm and 280 nm using a UV/VIS spectrophotometer to determine sample concentration and purity.\ncDNA Synthesis",
    "Mix RNA samples (1-5 µg) with 1 µL of Oligo(dT)12-18 (0.5 µg/µL) and DEPC-treated water (total volume of 12 µL) in RNase-free sterile tubes.\nIncubate at 70 °C for 10 min.\nAdd 2 µL of 10x PCR Buffer, 1 µL of 50 mM MgCl2, 1 µL of 10 mM dNTP mix, and 2 µL of 0.1 M dithiothreitol (DTT).\nIncubate at 4 °C for 5 min.\nAdd 1 µL of reverse transcriptase and incubate at 42 °C for 5 min.\nIncubate at 70 °C for 15 min.\nIncubate at 4 °C for 15 min. cDNA can be stored at -20 °C until further use.\nPCR\nMix 2.5 µL of 10x PCR Buffer, 1.5 µL of 25 mM MgCl2, 0.5 µL of 10 mM dNTP mix, 0.25 µL of Taq DNA polymerase, 0.25 µL of each primer (10 µM) and cDNA (100 ng), and sterile water to a total volume of 25 µL.\nRun the samples on a 96-well thermal cycler. To prevent amplification of genomic DNA, forward and reverse primers should be located in different exons: IL1β-FW: GCAACTGTTCCTGAACTCAACT and IL1β-RE: TCTTTTGGGGTCCGTCAACT; IL6-FW: CCTTCCTACCCCAATTTCCAA and IL6-RE: AGATGAATTGGATGGTCTTGGTC; KC-FW: TGTCAGTGCCTGCAGACCAT and KC-RE: CCTGAGGGCAACACCTTCA; and Actin-FW: TATCCACCTTCCAGCAGATGT and Actin-RE: AGCTCAGTAACAGTCCGCCTA. Use the following PCR conditions: 95 °C for 5 min followed by 30 cycles at 95 °C for 15 s, 58 °C for 30 s, and 72 °C for 30 s, plus a final extension for 10 min at 72 °C.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}