{
  "id": 3087,
  "origin_website": "Cell",
  "title": "Calcium measurements in enzymatically dissociated or mechanically microdissected mouse primary skeletal muscle fibers",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPart I. Surgical removal of FDB muscles\nTiming: 30 min\nThis section describes the surgical removal of the FDB muscle, which serves as the substrate for the single fiber isolations described in the following part II.\nSacrifice the animal according to the locally approved procedures.\nRemove the foot from the leg by amputating at the level of the ankle joint using sharp surgical scissors.\nPlace the foot in prewarmed Tyrode solution.\nPin the outermost toes of the isolated foot with dissection needles on the dissection pad with the plantar side of the foot facing upward (Figure 1[href=https://www.wicell.org#fig1]D).\nNote: We use the lid of a pipette tip box coated with a 1 cm thick layer of Sylgard 182 elastomer as the dissection pad.\nRemove the skin overlaying the FDB using dissection scissors.\nGrip and lift the proximal tendon of the FDB using forceps.\nMake a transverse incision to separate the FDB tendon from its origin at the back of the heel (calcaneus).\nCarefully cut and remove all soft and connective tissue between the FDB muscle and the underlying flexor digitorum longus (FDL) using forceps and dissection scissors (Figure 2[href=https://www.wicell.org#fig2]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2662-Fig2.jpg\nFigure 2. Illustration of critical steps during the mechanical single fiber dissection\n(A) Lifted FDB muscle (arrow). Scale bar = 1 cm.\n(B) Enzymatically dissociated fibers after 15 min attachment. Scale bar = 500 μm.\n(C) FDB muscle in the process of being separated into 3 digits (asterisks). The muscle is attached at both sides to the dissection tray via the nylon rods. Scale bar = 1 cm.\n(D) Several intact single fibers (arrows) attached to the tendons. Scale bar = 500 μm.\n(E) Single intact fibers after removal of damaged fibers and connective tissue. Scale bar = 500 μm.",
    "(F) Intact viable single fiber (highlighted by arrow). Scale bar = 500 μm.\n(G) T-clip template (left) and the final T-clip (right) are shown before attaching it to the single fiber. The labeled units on the ruler are in mm.\n(H and I) Clean single fiber (H) and, for comparison, a fiber with remaining connective tissue (I) are shown at 4x magnification. Scale bars = 500 μm.\n(J) Single fiber attached to T-clips and mounted in the stimulation chamber.\nCritical: Always point the dissection scissors towards the FDL to minimize the risk of damaging fibers in the FDB.\nCut the FDB tendons as far out on the toes as possible to leave a long distal tendon. This helps a lot in the later stages of single fiber dissections.\nCritical: Make sure not to stretch the FDB muscle. This is best done by folding back the freed portion of the FDB onto the part of the FDB that remains joined by connective tissue to the underlying FDL muscle. Do not hold or pull the FDB upwards in the solution.\nCritical: During the whole procedure, ensure that the muscle does not dry out by covering the foot in warmed Tyrode solution.\nPart II. Isolation of single skeletal muscle fibers\nNote that the following parts IIa and IIb are alternative methods for the isolation of single skeletal muscle fibers. For enzymatic dissociation, follow steps 10–18. For mechanical microdissection, follow steps 19–27.\nPart IIa. Fiber isolation by enzymatic dissociation\nTiming: 3–4 h\nThis part describes the isolation of primary single muscle fibers from FDB muscles by enzymatic dissociation.\nPlace 50 mL of complete DMEM/F12 in an incubator at 37°C.\nPrepare 5 mL of supplemented collagenase type 1.\nClean FDB muscles of tendons, connective tissue, and blood vessels.",
    "Incubate the cleaned muscle for 2–3 h at 37°C in the supplemented type 1 collagenase.\nTransfer muscles to 3 mL fresh DMEM/F12 that was prewarmed in step 10.\nGently triturate the muscle using a regular blue plastic 1 mL pipette tip filled with 900 μL DMEM/F12.\nNote: Pipette slowly 10–20 times up and down to separate the individual muscle fibers.\nNote: One second up and one second down is the right timing.\nTransfer a volume of 300 μL of the resultant muscle fiber suspension in laminin-coated 35 mm glass-bottom Petri dishes.\nAllow fibers to attach for 15 min at 37°C (Figure 2[href=https://www.wicell.org#fig2]B).\nAdd a further 2.7 mL of supplemented DMEM/F12.\nNote: Cells are ready for further experimentation up to 4 h after being attached in the Petri dish.\nPart IIb. Fiber isolation by mechanical microdissection\nTiming: 2 h\nThis part describes the isolation of primary single muscle fibers from FDB muscles by microdissection.\nPlace the FDB muscle in a custom-made dissection tray equipped with a pair of hollow movable metal 10G syringe needles mounted at opposite ends (see setup in Figure 1[href=https://www.wicell.org#fig1]B).\nFix both tendons of the muscle by inserting the proximal and the distal tendons into the split ends of a nylon rod located inside the metal 10G syringe needles (Figure 2[href=https://www.wicell.org#fig2]C).\nNote: The nylon rods are pulled into the needles to hold the tendons tightly and the needles can be rotated as needed when cutting away fibers and connective tissue during the dissection.\nMake FDB fibers accessible by removing connective tissue, fat, and visible blood vessels using sharpened dissection forceps and scissors.\nSeparate the FDB muscle longitudinally into three FDB digits.\nNote: It is recommended to use a stereomicroscope with dark-field illumination with up to 40× magnification for this process.",
    "Critical: It is important to keep some muscle fibers of each FDB digit attached to the tendons at both sides (proximal and distal). These are the fibers that will be used for isolation.\nMount one digit in the dissection tray and fix into the split rods on both sides (Figure 2[href=https://www.wicell.org#fig2]D).\nAssess whether fibers are susceptible to electrical stimulation by applying single electrical stimuli using a pen stimulator at supramaximal voltage (≤10 V).\nNote: A brief twitch contraction of a few milliseconds followed by relaxation shows that the fibers are intact and functional (Methods video S1[href=https://www.wicell.org#mmc1]).\nCritical: We use a pen-type stimulation electrode connected to a generic current pulse stimulator with up to 100V stimulation voltage (World Precision Instruments; model no. SYS-A300 or Aurora Scientific; model no. 701C).\nAt 40× magnification, select a few twitching fibers that are positioned on the FDB surface and isolate those by cutting and removing all other fibers in small steps (Figure 2[href=https://www.wicell.org#fig2]E).\nCritical: Check the remaining fibers repeatedly to identify fibers that give a robust contraction upon electrical stimulation.\nCritical: Make sure not to damage the fibers by overstretching the FDB digit.\nDecide on one fiber and carefully remove the other fibers using the jeweller’s forceps and micro-iris scissors (Figure 2[href=https://www.wicell.org#fig2]F).\nCheck that the isolated single fiber contracts upon electrical stimulation.\n    Your browser does not support HTML5 video.\n  \n      Method video S1. Electrical stimulation to confirm that fibers are intact and functional, related to step 24\n    \nPart III. Calcium measurements in microdissected muscle fibers",
    "For measurements of calcium in enzymatically dissociated fibers, we refer to the interested reader to the accurate methodological descriptions in ref.10[href=https://www.wicell.org#bib10],11[href=https://www.wicell.org#bib11] Note that the following parts IIIa and IIIb are alternatives for calcium measurements. In our experience, the best results are obtained with injection of the dye. For injection with intracellular calcium indicator, follow steps 28–34. For loading the fiber with a membrane permeable dye, follow steps 35–37.\nPart IIIa. Injection with intracellular calcium indicator\nTiming: 45 min\nThis section describes the measurement of calcium in isolated single fibers by microinjection of an intracellular calcium dye.\nThe proximal and distal tendons of the mechanically dissected single fibers are trimmed longitudinally and fitted into aluminum or platinum T-clips using two pairs of forceps to fold the T-clips.\nCritical: T-clips should be clamped to the tendon as close as possible to the muscle fiber as a long tendon can interfere with some downstream applications, such as force measurements (Figure 2[href=https://www.wicell.org#fig2]G).\nCritical: It is essential to have an intact single fiber free of debris when using membrane permeable fluorescent calcium indicators, such as indo-1 AM or fura-2 dyes, because indicator trapped in remnant dead fibers can affect fluorescent measurements resulting in drastically increased experimental variability. For comparison, Figures 2[href=https://www.wicell.org#fig2]H and 2I show a clean fiber and a fiber that was not well cleaned from connective tissue.\nInstall a micropipette in a micromanipulator and load it with ∼0.5 μL of 10 mM indo-1 salt solution.\nNote: If other calcium dyes are to be used, the concentration might need to be titrated for optimal results.\nCritical: Pressure during injection is driven by inert nitrogen gas.\nCritical: It is recommended to use Picospritzer gas pressure pulse settings of ∼100 psi with a duration of 1–5 ms.",
    "Mount the fiber in the recording chamber between a force transducer and an adjustable holder (Figure 2[href=https://www.wicell.org#fig2]J).\nCritical: During this procedure the stimulation chamber should be mounted onto an inverted microscope. Suitable stimulation chambers can be custom-made or are available commercially (e.g., Aurora Scientific; model no. 1500A). Suitable chambers have one mounting peg attached to a force transducer or fixed end and the other mounting peg attached to a movable screw. Superfuse the fiber with Tyrode solution at the desired temperature. For reference, the in vivo temperature of FDB muscles is 31°C (ref.12[href=https://www.wicell.org#bib12]).\nAdjust the stimulation current intensity and fiber length to obtain maximum tetanic force.\nTo this end, determine the supramaximal stimulation intensity by stimulating with 70 Hz tetani at ∼1 min intervals and increase the voltage incrementally until the stimulation intensity is 10%–20% above that needed to achieve the maximum force.\nThereafter, adjust the fiber length by using the movable screw to the length that gives maximum tetanic force.\nPosition the tip of the injection micropipette in close proximity to the fiber.\nCritical: The emitted fluorescence is measured with any suitable fluorescence system, which, for indo1 AM, has two photomultiplier tubes (e.g., HORIBA, Wedel, Germany or IonOptix, Amsterdam, The Netherlands).\nCritical: Measure and subtract background fluorescence of the fiber prior to injection by recording the emitted fluorescence signal values at 405 and 495 nm.\nInject the fiber with the dye.\nCritical: It is important to make sure that the fiber is in focus since imprecision can lead to an inaccurate estimate of the amount of injected dye.\nCritical: To control the amount of dye injected in the fiber, measure the increase in fluorescence signal at 405 nm–495 nm without stimulating the fiber. Withdraw the pipette when enough dye (∼two-times the background fluorescence) has been injected.",
    "Allow an even distribution of the dye through the myoplasm of the fiber by waiting for at least 20 min before starting the experimental recordings.\nPart IIIb. Loading the fiber with a membrane permeable dye\nTime: 1.5 h\nThis section describes the measurement of calcium in isolated single fibers by loading the fiber with a membrane permeable indicator.\nIncubate the fiber in the diluted indo-1 AM dye for at least 1 h at room temperature (20°C–25°C) to allow the dye to diffuse into the fiber.\nCritical: It is important to avoid that the fiber is drying out during loading in the stimulation chamber. This is done by placing a water filled cap from an Eppendorf tube in the incubation dish and ensuring that the lid is tightly sealed by wrapping it in Parafilm.\nMount the fiber as described above.\nSuperfuse with Tyrode solution for ∼30 min to remove any remaining dye outside of the fiber before starting the measurement.\nPart IV. Quantification of calcium measurements\nTime: 30 min\nThis part describes how intracellular calcium levels can be calculated based on fluorescent measurements of calcium indicators.\nAfter the fiber is loaded with the dye using either the injection technique or the loading method, measure the fluorescence in the dark with excitation at 360 nm and dual emission at 405 and 495 nm.\nCritical: Always close the shutter for the excitation light when measurements are not performed to minimize light exposure of the dye-loaded fiber and prevent bleaching of the dye.\nCritical: Measure the emitted fluorescence of the dye with a suitable fluorescence system (e.g., HORIBA, Wedel, Germany or IonOptix, Amsterdam, The Netherlands).\nStimulate the fiber with supramaximal electrical pulses (0.5 ms in duration).\nTo obtain the steady-state [Ca2+]cyt frequency, stimulate the fiber for 350 ms at 15–150 Hz every 1 min.",
    "[Ca2+]cyt is calculated using the ratio of light emitted at 405 nm to that at 495 nm (R) in the following equation13[href=https://www.wicell.org#bib13]:\n[\nC\na\n2\n+\n]\nc\nv\nt\n=\nK\nd\n∗\nβ\n∗\n(\nR\n−\nR\nmin\n)\n/\n(\nR\nmax\n−\nR\n)\n,\nwith Kd as the apparent dissociation constant of the used dye, Rmin as the ratio of 405 nm–495 nm emission at very low [Ca2+]cyt, Rmax as the ratio of 405 nm–495 nm emission at saturating [Ca2+]cyt and β as the ratio of the 495 nm signals at very low and saturating [Ca2+]cyt.\nFor an example of calculating [Ca2+]cyt using the above equation in enzymatically dissected murine skeletal muscle we refer to the interested reader to ref.14[href=https://www.wicell.org#bib14]"
  ],
  "subjectAreas": [
    "Cell Culture",
    "Biotechnology And Bioengineering",
    "Cell Isolation",
    "Microscopy"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}