{
  "id": 17978,
  "origin_website": "Jove",
  "title": "Normothermic Ex Situ Heart Perfusion in Working Mode: Assessment of Cardiac Function and Metabolism",
  "procedures": [
    "All the procedures in this manuscript were performed in compliance with the guidelines of the Canadian Council on Animal Care and the guide for the care and use of laboratory animals. The protocols were approved by the institutional animal care committee of the University of Alberta. This protocol has been applied in female juvenile Yorkshire pigs between 35–50 kg. All individuals involved in ESHP procedures had received proper biosafety training.\n1. Pre-surgical Preparations\nPlace the organ chamber properly on the apparatus cart and install the silicon support membrane inside the organ chamber. The Ao, pulmonary artery (PA) and LA connection points can be seen in Figure 1.\nInstall the ESHP tubing network (represented in Figure 2A,B) oxygenator and filter. Attach the heat exchanger water lines and the sweep gas tubing to the oxygenator.\nPlace the flow probes for measuring coronary sinus/PA and LA flow on the corresponding tubing.\nConnect the Ao and LA pressure transducers to the representative lines on the circuit.\nEnsure that all the tubing connections are firmly attached and all the stopcocks and luer locks are properly closed on the unattached sites.\nPrime the circuit with 750 mL of modified Krebs-Henseleit buffer (NaCl, 85; KCl, 4.6; NaHCO3, 25; KH2PO, 1.2; MgSO4, 1.2; glucose, 11; and CaCl2, 1.25 mmol/L) containing 8% albumin. De-air the Ao and LA pumps by positioning the pump outlet above the inlet so that the air leaves the pump chamber (Figure 3). The solution typically does not need to be oxygenized before the start of the perfusion.\nInitiate the software after the Ao and LA pumps are de-aired and the circuit is primed.\n2. ESHP Software Initialization and Adjustments",
    "NOTE: The ESHP apparatus used here is equipped with a custom software program to allow control of pump speed in order to achieve and maintain desired LA and Ao pressures. The software also analyzes functional parameters and provides a visual evaluation of pressure waveforms (Figure 4).\nTo start the ESHP program, click on the program shortcut on the monitor.\nIn the “setting” page, click “initialize”. The initializing message will appear on the board (Figure 5).\nOn the same page, zero the flow sensors clicking the “zero LA flow” and “zero PA flow”. The message will appear on the board.\nAdjust the height of the pressure transducers to the height of the silicon support. To zero the pressure transducers, open the Ao and LA pressure transducers (and any other transducers set to check the pressure) to the atmosphere, then click “zero all pressures” button. The message will appear on the board.\nIn the “main” page, increase the Ao pump speed gradually up to the point where flow from the Ao cannula appears in the organ chamber. In the present system, this is achieved with 900–1000 revolutions per minute (RPM).\nAdd 750 mL of blood to the perfusate solution to bring the total perfusate volume to 1.5 L (as described in the “Surgery, harvesting blood, and heart procurement” section) and then increase the LA pump PRM (800-900 RPM) so that no air remains in the LA cannula or the LA tubing beneath the silicone support membrane.\nAfter initializing the controlling software and de-airing of the ESHP apparatus, donor heart procurement may proceed.\n3. Preparations and Anesthesia\nAdminister 20 mg/kg of ketamine and 0.05 mg/kg of atropine intramuscularly for premedication.\nTransfer the pig to the surgical suite and place the pig on the operating table with tabletop heating to maintain normothermia.",
    "Titrate oxygen flow rate for mask induction according to animal weight and the anesthetic system. For the closed-circle anesthetic circuits the oxygen flow should be 20 - 40 mL/kg.\nTurn on isoflurane to 4–5%; after one or two minutes this may be reduced to 3%.\nEvaluate the depth of anesthesia. The pig is in the surgical plane if there is no withdrawal reflex in response to noxious stimulus.\nAfter confirmation of the appropriate depth of anesthesia, proceed to intubation.\nPlace the pulse oximeter probe on the tongue (preferred) or ear. The oxygen saturation measured by pulse oximetry should remain above 90%.\nShave patches of hair off on the left and right elbow regions, and left stifle. Wash off skin oils with soap and water, rinse with rubbing alcohol and dry completely. Place the ECG contacts. Avoid lead wire interference with the surgical site. Connect the leads to the correct locations.\nTo maintain the anesthesia, adjust oxygen flow (20–40 mL/kg) and inhalant gas rate (1–3%). The heart rate should be 80–130 beats/min. Respiration rate should be 12–30 breaths/min.\nShave, wash and aseptically prepare the incision site.\n4. Blood Collection and Heart Procurement\nEvaluate the anesthesia level every minimum every 5 min to confirm the surgical plane (no pedal reflex and no blink reflex, no response to painful stimuli).\nPerform a median sternotomy.\nIdentify jugulum and xiphoid as landmarks.\nUsing electrocautery, develop the midline between the landmarks by dividing the subcutaneous tissue and the fascia between the fibers of the pectoralis major muscle.\nMark the midline along the sternal bone with the cautery. Perform sternal osteotomy with an electric or air-powered saw. To prevent creating injuries to the underlying structures (e.g. pericardium and brachiocephalic vein, and innominate artery), proceed gradually with the saw.",
    "Retract the sternum gradually, using a sternal retractor. To avoid excessive tension and vascular injury, do not place the retractor too far cranially.\nFree the sternopericardial ligaments from the posterior surface of the sternum using cautery.\nOpen the pericardium with a Metzenbaum Scissor and fix the pericardial edges to the sternum using 1-0 silk suture.\nExtend the midline incision cranially by 2–3 cm and expose the right common carotid artery and internal jugular vein.\nObtain proximal and distal control of the vessels by encircling the vessels with silk ties (2-0).\nTie the cranial encircling ties on each vessel.\nOpen the anterior 1/3 of each vessel with an 11-blade and then insert a 5–6 F sheath into each vessel. Tie the caudal encircling tie around each vessel to secure the respective sheathes.\nMonitor the arterial and central venous pressures by connecting each sheath to a pressure transducer.\nDeliver 1,000 U/kg heparin intravenously.\nPlace a 3-0 polypropylene purse-string suture around the right atrial appendage and secure it with a snare.\nInside the purse-string suture, create a 1 cm incision on the appendage using an 11 blade. Insert a two-stage venous cannula (28/36 FR) inside the incision and position the distal tip in the IVC. Secure the cannula by tieing snare to the venous cannula. Control the outlet of the cannula with a tubing clamp.\nFrom the two-stage venous cannula placed in the right atrium, collect 750 mL of whole blood from the pig gradually over a period of 15 min into an autoclaved glass container, and simultaneously replace the volume with 1 L of an isotonic crystalloid solution such as Plasmalyte A.",
    "Add the blood to the perfusion circuit (which has been previously primed with 750 mL Krebs-Henseleit buffer containing 8% albumin) to reach a final volume of 1.5 L of perfusate. The perfusate is a 1:1 combination of Krebs-Henseleit containing 8% albumin solution and whole blood from the donor animal 17.\nPlace a cardioplegia needle (14–16 F) in the ascending Ao and secure it with a snare.\nConnect the cardioplegia cannula to the cardioplegia bag and add 100 mL of blood to 400 mL of cardioplegia (St. Thomas Hospital Solution) to reach a final volume of 500 mL blood cardioplegia.\nEuthanize the pig by exsanguination. If intending to add more blood to the perfusate after starting of the perfusion (according to the aims of the study), collect the blood and add 10–30 U/mL of heparin to it and store it in a glass container or a plastic bag at 4 °C for short durations (hours\nCross-clamp the ascending Ao with an Ao clamp and deliver the cardioplegic solution into the Ao root.\nAfter delivery of the cardioplegic solution is completed, remove the cross-clamp and perform the cardiectomy.\nFor ease of attaching the Ao and PA to their representative cannula, partially dissect the ascending Ao from the PA using a Metzenbaum scissors.\nTransect the superior and inferior vena cava, leaving roughly 1 cm of length on each.\nSeparate the heart from the posterior mediastinum by transecting the pulmonary veins.\nExcise the heart ensuring all of the Ao arch vessels are procured along with a segment of descending Ao. Preserve up to the PA bifurcation.\nWeigh the empty heart. The amount of weight gain over the ex situ preservation interval can be used as a metric for organ edema.\n5. Placement of the Heart onto the ESHP Apparatus and Initiation of Perfusion",
    "Trim excess tissue around the LA with a Metzenbaum scissor and cut between the pulmonary veins to create a common orifice.\nPlace a purse-string suture around the LA orifice using a 3-0 polypropylene suture.\nSuture and close the inferior vena cava with a 3-0 polypropylene suture. Leave the superior vena cava open at the beginning of the perfusion to ensure the right ventricle (RV) remains decompressed until the perfusate warmed and an organized rhythm is achieved.\nPlace the LA cannula into the LA orifice and secure it with a snare (Figure 6).\nGently squeeze the ventricles to de-air the heart” from 5.5. and add it to 5.7. as Increase the Ao pump speed to 1600 RPM as gently squeezing the heart. The remaining air in Ao root will be ejected through the innominate and subclavian branches.\nAttach the Ao to the Ao cannula embedded in the silicone membrane. Secure the Ao around the cannula with a silk tie. Trim the Ao to achieve a proper lie without tension or kinking.\nIncrease the Ao pump speed to 1600 RPM. The remaining air in Ao root will be ejected through the innominate and subclavian branches.\nConnect the Ao purge line to the innominate artery. Secure the connection with a silk tie.\nSnare the left subclavian artery orifice with a silk tie. Secure the closure with a snare and snap. Through the orifice of the subclavian artery, place an introducer sheath (5f). Ensure that the length of the catheter and its orientation is properly adjusted so that it does not interfere with Ao valve function.\nConnect the Ao pressure transducer to the introducer sheath side port.",
    "Read the Ao pressure on the monitor. Adjust the Ao pump speed to reach a mean pressure of 30 mm Hg. At this point (Time 0), the perfusion will have started in the non-working mode (Langendorff mode) and appearance of a dark deoxygenated perfusate in the PA line is a reflector of reestablishment of coronary flow. Set a timer to follow duration of the perfusion if needed.\nTurn on the heat exchanger and set the temperature to 38 °C. The perfusate will warm up to 37–38 °C in approximately 10 min. For normothermic perfusion of a porcine heart, keep the temperature at 38 °C throughout the perfusion.\nMaintain the perfusion in non-working mode for the first hour of the perfusion. Adjust the LA pump speed to maintain the LA pressure at 0 mmHg.\nOnce the perfusate temperature is >34 °C, evaluate the heart rhythm and pace and defibrillate as required (5–20 joules). Ensure the heart is completely decompressed before attempting cardioversion.\nCheck the dissolved gas status using a blood gas analyzer. Adjust the gas mixture to maintain a pH: 7.35–7.45, arterial partial pressure of carbon dioxide (PaCO2): 35–45 mmHg, arterial partial pressure of oxygen (PaO2): of 100–150 mmHg, and oxygen saturation (sO2) ≥95%.\nOnce the heart is normothermic and in a stable rhythm, ligate the superior vena cava.\nAttach temporary pacemaker leads to the right atrial wall and pace the heart in an AAI mode at 100 beats/min.\nAttach the epicardial electrocardiography electrodes to the surface of the heart.",
    "Switch to working mode after 1 h of perfusion in Langendorff mode. For this purpose, enter the desire LA pressure (typically 6–8 mmHg) on the left side of the main page, in the “desired LAP” section of the software, and click on the button to initiate the feedback loop. The activated working mode will appear as a green button, and the LA pump speed will automatically increase and decrease to reach and maintain the desired LA pressure.\nAs the heart begins to work, coronary vascular resistance will drop resulting in a low diastolic pressure. Adjust the Ao pump speed to maintain the Ao diastolic pressure of 40 mmHg as afterload during perfusion in the working mode.\n6. Metabolic Support During ESHP\nNOTE: Organ perfusion solutions, including Krebs-Henseleit buffer solution, typically contain glucose as the primary energy substrate.\nCheck the glucose level (e.g. with blood gas analysis) at regular intervals during the perfusion. In accordance with the consumption rates, using a standard infusion pump replace glucose by continuous arterial infusion and/or bolus doses, to maintain an arterial concentration of 6–8 mmol/L of glucose throughout the perfusion.\nUsing a separate infusion pump, deliver 2 U/h of insulin to the perfusate throughout the perfusion, changing the rate of insulin infusion according to the aims of the study.\nFor β-adrenoceptor stimulation of the heart, deliver 0.08 µg/min of epinephrine to the perfusate using a standard infusion pump, and continue throughout the perfusion. Alternatively, an infusion of 4 µg/min of dobutamine may be used.\n7. Anti-microbial and Anti-inflammatory Agents\nAdd a broad-spectrum antibiotic (e.g. 3.375 grams of piperacillin-tazobactam) to the perfusate at the start of perfusion.\nAdd anti-inflammatory agents (e.g. 500 mg of methylprednisolone) to the perfusate in accordance with the aims of the study, if necessary.\n8. Assessment of Function",
    "NOTE: The ESHP controlling software automatically calculates and records steady-state hemodynamic and functional indices every ten seconds.\nAssessment of steady state systolic and diastolic function\nFor assessment and recording of the steady state data, through the introducer sheath placed earlier in the subclavian artery, place a fluid-filled pigtail catheter into the left ventricle (LV) while in working mode.\n\t\t\nFlush the pigtail catheter with saline and place the guide wire inside it.\nGently insert the catheter into the Sheath cannula previously placed in the subclavian artery. As soon as it passes through the Ao valve, remove the guidewire slowly and connect the pigtail catheter to the LV pressure line.\nFollow the LV pressure wave on the monitor. The diastolic portion of the pressure wave will reach zero when the catheter has properly placed inside of the LV. Of note, this step is only possible in working mode since the Ao valve must be opening normally for the pigtail catheter to be able to enter the chamber. Once the pigtail catheter is placed in the LV and connected to the LV pressure transducer, the LV maximum and minimum rate of pressure change (dP/dT min and dP/dT max) will be recorded automatically.\nDetermine the myocardial performance by indexing the measured ﬂow on the LA line, for heart mass (mL·min–1·g–1), at a given constant LA pressure (6–8 mmHg), and an Ao diastolic pressure of 40 mm Hg, and a heart rate of 100 beats·min–1. The LA pressure equals the cardiac output, assuming there is no Ao insufficiency. Examine the Ao pressure waveform to ensure there is no Ao insufficiency.\nAssessment of preload recruitable stroke work (PRSW)",
    "NOTE: PRSW is the linear relationship between end-diastolic volume and LV stroke work (LVSW) and represents an index for the evaluation of ventricular function, independent of preload, afterload, and size of the ventricle18,19. PRSW can be measured with this system in a non-invasive fashion as described below13.\n\t\nRemove the pigtail catheter from the LV, since the catheter may induce arrhythmias during PRSW analysis that will negatively affect the accuracy of the results.\nOn the main page, in the “Capture PVL” section, adjust the desired rate of drop in LA pump speed during the analysis (typically 100–200 RPM) and desired time during which the analysis will take place (typically 10–12 s) (Figure 4).\nAfter performing the adjustments mentioned above, click on “Record PVL”. The software will automatically exit working mode and gradually reduce LA pump RPM while simultaneously recording LVSW and LA pressure. At the conclusion of data collection, the software will perform linear regression on the newly acquired dataset to yield PRSW. After the ESHP software has completed the analysis, a message will appear on the main page, showing the correlation coefficient of the analysis. Press “OK” if the coefficient (R-value) is desirable (typically >0.95). The PRSW analysis results will be recorded.\nAfter performing the analysis, to return to perfusion in the working mode, click on “Press To Start Working Mode;” otherwise the software will continue in Langendorff (non-working) mode. The gray button will turn to green indicating a return to working mode. If repeated PRSW analysis is needed, before each new attempt ensure that the LA pressure/flow values return to the previous steady state values.\n9. Metabolic Assessment of the Ex Situ Perfused Heart",
    "Assess the metabolic state of the heart and the perfusate during ESHP, using the information obtained from the blood gas analysis of the perfusate samples collected from both Ao (arterial), and PA (venous) lines every 1–2 h.\nPerform blood gas analysis (every 1–2 h) to monitor the gas and ionic state of the perfusate. Adjust the gas composition (O2 and CO2) and sweep speed to maintain a pH of 7.35–7.45, paO2 of 100–150 mmHg, and paCO2 of 35–45 mmHg. Adjust and maintain the perfusate ionic concentration of potassium and calcium in the physiologic range during the perfusion (e.g. by addition of calcium chloride if needed).\nUse the information obtained from the blood gas analysis and coronary blood flow to calculate metabolic parameters. For example, calculate myocardial oxygen consumption (MVO2), and LV mechanical efficiency (ME) as follows:\nDetermine MVO2 (mL O2 · min-1 · 100 g-1) multiplying the coronary blood flow (CBF) by the arterial-venous difference in oxygen content (CaO2 – CvO2).\n\t\tMVO2 = [CaO2 - CvO2 (mL O2 · 100 mL-1)] × CBF (mL . min-1 . 100 g heart mass), where;\n\t\tArterial oxygen content (CaO2) = [1.34 (mL O2 . g Hb-1) × Hb concentration (g · 100 mL-1) × oxygen saturation (%)] + [0.00289 (mL O2 · mm Hg-1 · 100 mL-1) × PaO2 (mm Hg)]\n\t\tVenous oxygen content (CvO2) = [1.34 (mL O2 · g Hb-1) × Hb concentration (g · 100mL-1) × oxygen saturation (%)] + [0.00289 (mL O2 · mm Hg-1 · 100 mL-1) × PvO2 (mm Hg)]\nCalculate LV mechanical efficiency (ME) as follows:\n\t\tME = LVSW (J . beat-1) / MVO2 (J . beat-1) where",
    "Stroke work = {mean arterial pressure (mmHg) - LA pressure (mmHg)} × {LA flow (mL . min-1)/ heart rate (beats . min-1)} × 0.0001334 (J . mL-1 . mmHg-1), and\n\t\tMVO2 (J . beat-1) = {MVO2 (mL . min-1)/heart rate (beats . min-1)} × 20 (joules . mL-1)\n10. Removing the Heart from ESHP Apparatus at the End of Perfusion\nExit the working mode. Bring the LA pump RPM to zero.\nDecrease the Ao pump RPM to zero.\nRemove the pigtail and sheaths.\nQuickly remove all the attachments to the heart.\nWeigh the empty heart to determine the degree of myocardial edema formation.\nQuickly take tissue samples of proper size from the left and right ventricles and place them in optimum cutting temperature (OCT) gel, formalin and/or snap freeze them in liquid nitrogen. Store the samples for future investigations (OCT and snap frozen samples in a -80 °C freezer, formalin-stored samples in a properly sealed container at room temperature).\nClose the program; all the recorded data will be saved.\nDiscard the remaining tissue, blood, bioactive materials and used ESHP apparatus components according to institutional protocols.\nClean the ESHP cart using a sanitizing hard surface cleaner (e.g. 70% ethanol) thoroughly.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}