{
  "id": 5350,
  "origin_website": "Bio",
  "title": "Two-electrode Voltage-clamp Recordings in <em>Xenopus laevis</em> Oocytes：Reconstitution of Abscisic Acid Activation of SLAC1 Anion Channel via PYL9 ABA Receptor",
  "procedures": [
    "Prepare cRNAAll constructs were cloned into the pNB1 oocyte expression vector using the USER method (Nour-Eldin et al., 2006).cRNAs were synthesized from 0.5-1 μg of linearized plasmid DNA template using the mMESSAGE mMACHINE® T7 Kit from Thermo Fisher Scientific.Isolation of oocytesIndividual Xenopus laevis oocytes can be ordered from Ecocyte Bioscience and arrives the next day on dry ice. Alternatively, ovary lobes can be surgically extracted as described in previous reports (Miledi, 1982; Gundersen et al., 1983; Stühmer and Parekh, 1995).To isolate oocytes from ovary lobes, wash ovary lobes with ND96 buffer 3 times, incubate it in ND96 buffer at 16 °C overnight.Place 2-3 ovary lobes in ND96 buffer containing 30 mg/ml collagenase D, shake 2-3 h to remove follicle cell layer at room temperature (~23 °C) (Figure 1A).Wash oocytes with ND96 buffer 5 times, sort stage IV and V oocytes (approximate diameter 1 mm, Wasserman et al., 1984) in ND96 buffer. Incubate sorted oocytes in ND96 buffer at 16 °C overnight before injecting cRNA (Figure 1B).Injection of cRNAUse stage IV and V oocytes, for which the follicle cell layer has been removed (Wasserman et al., 1984). Inject more than 30 oocytes with each mRNA combination that is to be investigated.Pull injection glass needles on P-87 flaming/brown microelectrode micropipette puller using borosilicate glass capillaries to produce injection needles (Figure 1C).Break off the needle tip with forceps so that it is easier to inject cRNA into oocytes (Figure 1D).Fill pipette tip with mineral oil to about one-third to two-thirds.Mount pipette to the microdispenser.Deposit cRNA sample onto Parafilm, to a total volume of cRNA > 1 μl.Fill the pipette with RNA solution with microdispenser by applying negative pressure to the pipette.Inject cRNA into selected oocytes. The volume of cRNA injected into oocytes is about 50 nl (oocyte volume ~500 nl).",
    "The concentration of injected cRNA is better more than 2 ng/μl (Figure 1E).Incubate oocytes in ND96 buffer at 16 °C for 2-3 days before recording currents.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170116/20170116181505_7081.jpgFigure 1. Oocytes and glass needle at different steps. A. Oocyte ovary lobes; B. Oocytes after isolation; C. Injection glass needle before the tip is ‘broken’; D. ‘Broken’ needle; E. An oocyte being injected with cRNA. Note that injection pipette is out of focus. F. An oocyte impaled with two electrodes for voltage clamping.RecordingPull recording glass electrodes on P-87 flaming/brown microelectrode micropipette puller using custom glass tubing.In some case, slightly break the needle tip so that it is easier to insert the micropipette into oocytes since needle tips can be too soft for multiple sequential injections into oocytes. Alternatively, press the electrode against the oocyte and tap the recording table. Vibrations aid in impaling the oocyte.Fill the micropipette with 3 M KCl. Place one electrode into each of the two holders, making sure that Ag/AgCl electrode wire contacts the KCl solution in the micropipette. The resistances of the filled electrodes were 0.5-1.5 M (Figure 1F).For anion channel recordings, steady state currents are recorded starting from a holding potential of 0 mV and ranging from +40 to -160 mV in -20 mV decrements, followed by a -120 mV voltage ‘tail’ pulse (Figure 2).Note: The time-dependent properties of SLAC1 channel currents in Xenopus laevis oocytes vary among individual oocytes. This may depend on posttranslational modification of the channel protein. This property is also known from guard cell recordings of the SLAC1-encoding S-type anion channels (Schmidt and Schroeder, 1994).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170116/20170116181738_0112.jpgFigure 2. OST1 activates SLAC1 anion channel currents in Xenopus laevis oocytes. A. The voltage protocol used for recording SLAC1 anion channel currents. B and C.",
    "Example of whole-cell current traces recorded from oocytes injected with cRNA of (B) SLAC1yc only and (C) SLAC1yc+OST1yn (in SLAC1yc, SLAC1 is tagged with the C-terminal ‘half’ of YFP and in OST1yn, OST1 is tagged with N-terminal ‘half’ of YFP. Constructs for similar experiments see Geiger et al., 2009; Lee et al., 2009; Hua et al., 2012; Brandt et al., 2015; Wang et al., 2016).To assess whether ‘monomeric’ abscisic acid ABA receptor PYL9 (Dupeux et al., 2011; Hao et al., 2011) activation of SLAC1 can be reconstituted, we co-injected cRNAs of the SLAC1yc channel, ABI1 (ABA-INSENSITIVE1) protein phosphatase, the PYL9 receptor, and the OST1yn protein kinase into oocytes (Geiger et al., 2009; Brandt et al., 2012). Without ABA, PYL9 did not activate the anion channel currents in oocytes expressing the ABI1 with SLAC1yc and OST1yn. When ABA was injected into oocytes 30 min before measuring of oocyte currents, SLAC1 anion channels activity was dramatically enhanced in oocytes expressing SLAC1yc, OST1yn, PYL9 and ABI1 (Figure 3). Thus, the ‘monomeric’ ABA receptor PYL9 enables ABA signaling reconstitution in oocytes.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170116/20170116181942_1094.jpgFigure 3. Reconstitution of ABA activation of SLAC1 anion channels by PYL9 ABA receptor. Average current of SLAC1 anion channels recorded at -140 mV. In the absence of ABA, the ABA receptor PYL9 is unable to enhance SLAC1 anion channels currents. However, in the presence of injected ABA, SLAC1 anion channels currents are greatly increased. Data are mean ± SEM (SLACyc, n = 9; SLAC1yc+OST1yn, n = 13; SLAC1yc+OST1yn+ABI1, n = 10; SLAC1yc+OST1yn+ABI1+PYL9, n = 12; SLAC1yc+OST1yn+ABI1+PYL9+ABA, n = 15)."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Plant Science"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}