{
  "id": 3730,
  "origin_website": "Cell",
  "title": "An updated protocol for the cost-effective and weekend-free culture of human induced pluripotent stem cells",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nGenerating B8 supplement aliquots\nTiming: 1 h\nPreparation of B8 supplement aliquots\nNote: All the values in this section are to prepare B8 supplement aliquots for 100 L of B8 medium. To prepare other volumes, these values can be scaled up and down accordingly.\nPrepare AA2P solution.\nAdd 35 mL of sterile Milli-Q water and 7 mL of HCl (1 N) into a 50 mL conical tube.\nWeight 20 g of L-ascorbic acid 2-phosphate and add to the Falcon tube.\nMix vigorously and place on a rocker at 50 rpm for 10 min or until dissolved.\nNote: Final volume should be 50 mL and pH should be 7.1.\nCritical: Always add the AA2P powder to the water. Otherwise, a hydrogel will be formed when the water starts being added to the salt, resulting in an increased difficulty of obtaining a homogenous solution.\nNote: Only the tri sodium salt version of L-ascorbic acid 2-phosphate (also called 2-phospho-L-ascorbic acid trisodium salt) can be made at his high concentration.\nPrepare insulin solution.\nPlace 48 mL of sterile Milli-Q water into a 50 mL conical tube.\nWeight 0.5 g of insulin and add into the conical tube.\nAdd 400 μL of HCl (1 N) and mix by inversion until solution is clear (approximately 1 min).\nAdd 550 μL of NaOH (1 N), and mix by inversion until solution is clear.\nNote: Insulin is relatively insoluble in water at physiological pH, but solubilizes at acidic pH. Once in solution, it is possible to increase the pH without precipitation of the solute. As pH increases with the addition of NaOH, solution becomes cloudy again. However, simply mixing by inversion is enough to homogenize the tube and obtain a crystal clear solution.\nNote: Final pH should be 7.1.\nPrepare B5 solution.",
    "Place 47 mL of sterile Milli-Q water into a 50 mL conical tube.\nWeight 0.5 g of transferrin, add into the tube, and mix by inversion until solution is clear.\nAdd 1 mL of 2 mg/mL sodium selenite solution.\nAdd 1 mL of 4 mg/mL FGF2 solution.\nAdd 40 μL of 250 μg/mL TGFB3 solution (comes as a solution).\nAdd 100 μL of 100 μg/mL NRG1 solution.\nMix by inversion until solution is clear.\nMixing the components made on steps 1–3 and making the B8 supplement aliquots.\nIn a cell culture hood, add the three tubes (AA2P, insulin, and B5) along with 50 mL of sterile Milli-Q water to a sterile bottle and mix.\nAdd the 200 mL solution to a 250 mL bottle-top PES filter to sterilize.\nMake 2 mL B8 supplement aliquots in sterile 2 mL microtubes. Freeze at −20°C.\nNote: B8 supplement aliquots can be stored at −20°C for up to 1 year.\nTroubleshooting 1[href=https://www.wicell.org#troubleshooting].\nPreparation of B8 medium\nTiming: 10 min\nIn a cell culture hood, thaw one B8 supplement aliquot.\nAdd the aliquot to 1 L of 4°C DMEM/F12.\nMix by inversion.\nKeep the media at 4°C and avoid exposure to light.\nMedia should be used within 4 weeks.\nCritical: If using a DMEM/F12 basal medium from supplier other than Corning, make sure that the concentrations of salts and the chemical properties (pH and Osmolarity) of the basal medium are the same as those presented in (Kuo et al., 2020[href=https://www.wicell.org#bib9]). For example, for 1 L of Gibco DMEM/F12 (11330-032), a separate aliquot of 15 mL at 1 M of sodium bicarbonate would be needed, which would also require correction of pH and osmolarity of the final solution.\nPreparation of B8T medium\nTiming: 10 min",
    "In a cell culture hood, thaw one B8 supplement aliquot and one aliquot of thiazovivin.\nAdd the aliquots to 1 L of 4°C DMEM/F12.\nMix by inversion.\nKeep the media at 4°C and avoid exposure to light.\nMedia should be used within 4 weeks.\nNote: Both B8 and B8T media are needed for the following steps of the protocol. B8 medium is used in the daily media exchange steps, whereas B8T medium is used for thawing and passaging of hiPSCs.\nThawing and initial plating of hiPSCs\nTiming: 15–20 min\nNote: hiPSCs should preferentially be generated in house. All lines generated by other laboratories, including commercially available lines, must be mycoplasma tested (Lonza MycoAlert Plus).\nNote: We do not prewarm media to room temperature or 37°C before use due to concerns of the stability of the FGF2 in the media. All media used in all steps is at 4°C. We have not noted any negative effects on the growth. Additionally, avoiding placing media bottles in water baths reduces potential for contamination.\nTransfer a 6-well Matrigel-coated plate from the incubator to the cell culture hood.\nAspirate the Matrigel solution from 3 of the wells, add 2 mL of B8T medium into each of them.\nTransfer a vial of hiPSCs from liquid nitrogen into a 37°C water bath.\nKeep the cells into the water bath until only a sliver of ice remains.\nUse a 10 mL pipette to remove the contents from the vial. Fill the pipette with 10 mL of B8T medium, and use this to remove the contents of the vial. Transfer approximately 5 mL to a 15 mL conical tube, then wash out the vial with approximately 1 mL of medium, and transfer the remainder to the conical tube.",
    "Note: The use of a thiazovivin-containing medium (B8T) improves cell survival after dissociation, improving plating consistency.\nCentrifuge 3 min at 200 × g. Aspirate supernatant. Resuspend pellet in 2 mL B8T and transfer to the three B8T-containing wells of the Matrigel-coated 6-well plate from step 16 at a 1:2 (1 mL of cell suspension), 1:3 (670 μL of cell suspension), and 1:6 ratios (330 μL of cell suspension).\nReturn the plate to the incubator. Medium should be exchanged with B8 medium every 24 h, until wells become 70%–80% confluent.\nNote: Ideally, the cells should reach 70%–80% confluence in 3–4 days. Adjust the split ratio to 1:12 to 1:20 to achieve this result, as higher split ratios are associated with more uniform distribution of cells across the well and result in more efficient differentiations into cardiomyocytes. For other desired cell types, split ratios might be changed to improve differentiation efficiency.\nPause Point: When cells reach 70%–80% confluence, they could be passaged (steps 22–28), frozen (steps 29–38), or differentiated (your choice of differentiation protocol according to specific cell needs and experimental design (Burridge et al., 2014[href=https://www.wicell.org#bib1]; Cyganek et al., 2018[href=https://www.wicell.org#bib3]; Hogrebe et al., 2020[href=https://www.wicell.org#bib7])). For a weekend-free culture of hiPSCs, check steps 39–45.\nTroubleshooting 2[href=https://www.wicell.org#troubleshooting].\nPassage of hiPSCs with EDTA\nTiming: 20–30 min\nNote: All the volumes here are for one well of a 6-well plate. For other types of plates, the volumes need to be changed accordingly.\nNote: EDTA solution is kept at room temperature.",
    "Critical: This protocol is designed to keep the hiPSCs in the logarithmic growth phase. Therefore, the number of days of culture should be kept consistent and cells should not be allowed to become more than 90% confluent. If cells overgrow, becoming more than 90% confluent, they become contact inhibited, which results in a slow lag phase growth after passaging.\nAspirate cell culture medium.\nAdd 1 mL of 0.5 mM EDTA per well and incubate for 6 min at room temperature (inside the cell culture hood).\nNote: The chosen incubation duration should be set so that the cells come off easily during step 26. We use 6 min for all cell lines. Longer incubation times will result in the cells detaching from the wells before the aspiration of the EDTA solution, leading to preventable loss of cells during the following steps.\nNote: We use EDTA for cell passaging to preserve small clumps of cells when passaging, instead of isolated single cells as would be the case if TrypLE was used.\nWhile hiPSCs are still incubating in EDTA, aspirate Matrigel solution from two new 6-well plates and replace it with 1 mL of B8T medium per well.\nWhen the 6 min are finished, aspirate EDTA from the well from step 23.\nWith a P1000 tip, add 1 mL of B8T medium to the well from step 25, and blast medium against cell surface to dissociate cells and detach them from the Matrigel layer. Cells should come off easily after pipetting about 5 times.\nCritical: Avoid pipetting cells too much as it decreases the cell survival after passaging.",
    "Top up well with B8T medium for the desired split ratio. For 1:12 split ratio, top up well with 11 mL of B8T medium. For 1:15, use 14 mL of B8T medium. For 1:20, remove 250 μL, then top up well with 14.25 mL of B8T medium. For 1:24 remove 400 μL, then top up well with 14.4 mL of B8T medium.\nAdd 1 mL of cell solution per well to two new Matrigel-coated 6-well plates to a final volume of 2 mL per well.\nNote: Figure 1[href=https://www.wicell.org#fig1] presents representative phase contrast images of hiPSCs during steps 24, 26, and 28 (10 and 30 min post seeding).\nTroubleshooting 3[href=https://www.wicell.org#troubleshooting].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/450-Fig1.jpg\nFigure 1. Dissociation with EDTA and plating of hiPSCs using B8T\nPhase-contrast images of hiPSCs: (A) during EDTA treatment; (B) in suspension in B8T immediately after dissociation; (C) 10 min; and (D) 30 min post seeding in a Matrigel-coated plate. Scale bar, 100 μm.\nFreezing of hiPSCs\nTiming: 25–26 h\nTo prepare the freezing solution, combine 5 mL of DMSO with 45 mL B8T medium in a 50 mL Falcon tube to a final concentration of 10% (v/v) DMSO. Mix the solution by inverting. This should be prepared fresh each time, immediately before use.\nStart with cells at 70%–80% confluence.\nAspirate culture medium.\nAdd 1 mL of 0.5 mM EDTA per well and incubate for 6 min at room temperature (inside the cell culture hood).\nAfter 6 min, aspirate EDTA from the wells.\nWith a P1000 tip, add 1 mL of B8T medium to the wells, and blast medium against cell surface to dissociate cells and detach them from the Matrigel layer. Cells should come off easily after pipetting about 5 times. Transfer the cells to a 15 mL conical tube.",
    "Critical: Avoid pipetting cells too much as it decreases the cell survival after passaging.\nCentrifuge the tube(s) at 200 × g for 3 min, then aspirate supernatant.\nUse 1 mL of freezing solution to resuspend the cells for each well, transferring each cell solution to a cryovial.\nPlace the cryovial(s) in a Coolcell (or other cell-freezing container) and move it to a −80°C freezer.\nCritical: After addition of freezing media to the cells and their transfer to the cryovial, move them to −80°C freezer as quickly as possible. Viability of cells decay with their long-term maintenance in freezing medium at room temperature.\nAfter 2–24 h in –80°C, transfer the cells to liquid nitrogen storage.\nCritical: Long-term storage in the −80°C freezer decreases the viability of the cells post thawing.\nNote: Freezing one well of a 6 well plate will result in about 1 million cells per vial.\nWeekend-free culture of hiPSCs\nTiming: 1 week\nThe following protocol provides a strategy for a 7 days hiPSC culture schedule, with two passaging steps (days 1 and 4) and 3 days (day 3, day 6, and day 7) without need of media change. If day 1 is chosen to be on a Monday, no media changes will be required on Wednesday and during the weekend.\nNote: Cell culture can be transitioned to the weekend-free culture protocol after hiPSCs have been split at least four consecutive times at 1:15 ratio in a 4 day schedule (passage (d0), media exchange (d1), media exchange (d2), media exchange (d3), passage (d4)).\nNote: A medium volume of 2 mL per well of a 6-well plate or equivalent is maintained for all steps.\nOn the morning of day 1 (Monday), passage the cells following steps 22–28, and seed them at 1:12–1:15 ratio in B8T medium.",
    "Note: This ratio can be further optimized for different cell lines in order to have the cells ready for a new passage after 3.5 days.\nOn the morning of day 2 (Tuesday), change the media to B8 medium, adding 2 mL per well.\nSkip media change on day 3 (Wednesday).\nOn the afternoon of day 4 (Thursday), split the cells and seed them at 1:20 ratio in B8T medium.\nNote: Similar to the previous passage, the ratio mentioned here could be optimized for each cell line in order to have cells ready for passage after 3.5 days.\nOn the afternoon of day 5 (Friday), change media to B8 medium. Add 2 mL per well.\nSkip media change on day 6 (Saturday) and day 7 (Sunday).\nOn the morning of day 8/day 1 (Monday), passage the cells again to 1:20 ratio in B8T medium.\nTroubleshooting 4[href=https://www.wicell.org#troubleshooting]."
  ],
  "subjectAreas": [
    "Cell Culture",
    "Stem Cells"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology"
  ]
}