{
  "id": 19313,
  "origin_website": "Jove",
  "title": "Free-Hand Intracerebroventricular Injections in Mice",
  "procedures": [
    "All the procedures were approved by the Colorado State University (#3960) and University of California San Diego Institutional Animal Care and Use Committees, where the representative data were collected (S13235, PI Kellie Breen Church). Data from five adult female and two adult male C57/BL6 mice (9-16 weeks old) are depicted in the representative data section. Female mice were ovariectomized 3-4 weeks prior to ICV injection and blood collection as described previously7. Prior to experimentation, these mice were housed with a 12 h light/12 h dark light cycle and had free access to feed and water in accordance with the Guide for the Care and Use of Laboratory Animals.\n1. Performing craniotomy\nNOTE: Craniotomy can be performed one or more days prior to the actual injection, which makes the injection process quicker on the day of the experiment.\nPrepare the materials for the craniotomy as described below.\n\t\nPlace a clean bench pad or drape material on the work surface. Tape the nose cone of an isoflurane vaporizer to the work surface (close to, but facing away from, the experimenter; see Figure 1A).\nPlace silastic tubing on the end of a sterile sharp 18 G needle so that ~1 mm of the needle tip protrudes. Place silastic tubing on the end of a sterile blunt needle so that ~1 mm of the needle tip protrudes.\n\t\tNOTE: Separate and sterile pre-packaged needles (sharp and blunt) should be used for each mouse.\nGather an electric shaver, iodine scrub, sterile gauze, and alcohol pads for preparing the injection site.\nPractice moving a needle 2 mm lateral and 1 mm caudal as described below.",
    "Use a ruler and a pen to mark a sheet of paper with a starting point (this will be bregma), a mark 2 mm to either the left or right, and another mark 1 mm above the last one (this will be the injection site; see Figure 1B).\nPractice moving the needle from the starting point to mark point 1 to mark point 2 (bregma to injection site) until confident that the movement is repeatable without guides.\n\t\tNOTE: The coordinates described here are effective in adult C57/BL6 mice, but other strains or age groups may require adjustment.\nPrepare the mouse for craniotomy as described below.\n\t\nPlace the mouse in an induction chamber and anesthetize the mouse with 3%-4% isoflurane in medical-grade oxygen. With practice and familiarity with the procedure, reduce the total duration of isoflurane exposure to less than 10 min for the craniotomy procedure.\n\t\tCAUTION: Isoflurane exposure is hazardous to human health; use an approved and inspected isoflurane vaporizer in a well-ventilated area with means of scavenging waste gases.\nOnce the toe reflex is absent, shave the head of the animal. Apply eye lubricant.\nPlace the mouse on the work surface with the head in the nose cone to maintain anesthesia.\nAdminister an analgesic agent, such as buprenorphine (0.6-0.8 mg/kg mouse body weight, subcutaneously), as directed by the supplier.\nClean the injection site by wiping the head with sterile gauze dipped in an iodine solution (perform three scrubs), and then wipe with an alcohol scrub pad (perform three times).\n\t\t​NOTE: Remove the fur and clean the skin around the injection site and use sterile instruments and needles, as recommended by the American Veterinary Medical Association to prevent infections.",
    "Firmly hold the head of the mouse with the non-dominant hand. Position the head as flat on the work surface as possible.\nLocate the site of the injection.\n\t\nUse the prepared sharp 18 G needle to first identify bregma; for this, drag the needle across the skin of the head along the midline, moving in the rostral-caudal plane. Imagine an equilateral triangle in which the two vertices are the eyes and the third vertex is the approximate location of bregma (see Figure 1C).\nFrom bregma, move the needle 2 mm lateral and 1 mm caudal to the site of injection.\nWhile holding the needle vertically, firmly push the needle through the skin and bone until the tubing is flush with the skin.\nRetract the needle, rotate the needle, and press through the skin and bone again. Repeat the process until a small hole is created in the bone.\nUse the blunt needle to check that a sufficient hole has been produced in the bone. Aim to make an opening in the bone large enough for the blunt needle to pass through.\nRemove the mouse from the nose cone, clean off any blood from the injection site with sterile gauze, and place the mouse in a cage on a cage warmer until awake. Since the opening made by the craniotomy is small (18 G needle), the site does not need to be closed with a suture or wound clips.\n\tNOTE: The opening produced here is small (18 G), so many institutions consider this procedure an injection as opposed to a surgery. Moreover, although an opening through skin and bone to the brain is made, holding the skin taut results in the holes not aligning, which likely aids in preventing skin flora or cage bedding from contacting the brain.",
    "2. Making the injection\nPrepare the materials for the injection as described below.\n\t\nPlace a clean bench pad or drape material on the work surface. Tape the nose cone of an isoflurane vaporizer to the work surface (close to, but facing away from, the experimenter; see Figure 1A).\nAttach a 10 mm long 27 G needle with a 45° bevel onto a 5 µL glass syringe. Place silastic tubing on the needle so that 3.5 mm of the needle tip protrudes; use laboratory tape to hold the tubing to the syringe body (see Figure 1D).\nPrepare the injection media (drug, virus, or other liquid for injection) in a tube. For the representative results in this study, sterile isotonic saline was injected.\n\t\tNOTE: Select a tube that permits access by the glass syringe and needle, such as a 2 mL microcentrifuge tube.\nDraw 3 µL of injection media into the glass syringe. First, draw more than the desired volume, and eject until 3 µL remains in the syringe.\nGather iodine scrub, sterile gauze, and alcohol pads for preparing the injection site.\nStart a laboratory timer in count-up mode and place the timer so that it is visible to the experimenter while making injections.\nPractice moving a needle 2 mm lateral and 1 mm caudal as performed on the previous day.\nPrepare the mouse for injection as described below.\n\t\nPlace the mouse in the induction chamber and anesthetize the mouse with isoflurane. Once the toe reflex is absent, apply eye lubricant, and place the mouse on the work surface with the head in the nose cone.",
    "Clean the injection site with three wipes each of iodine and alcohol. Identify the injection site with an 18 G needle (or blunted needle) as described in step 1.8. The hole created during craniotomy should be detectable.\n\t\tNOTE: If the craniotomy has not been performed in advance, or if the hole in the skull is not detectable, the craniotomy can be performed here.\nPerform the injection with a glass syringe as described below.\n\t\nFirmly hold the head of the mouse with the non-dominant hand. Position the head as flat on the work surface as possible.\nPlace the needle of the glass syringe through the hole in the skull until the tubing placed over the needle prepared in step 2.1.2 rests on the skin of the mouse.\nHold the syringe as vertically as possible, paying attention to both the coronal and sagittal planes. Slowly inject the media over a period of 1 min.\nHold the syringe and needle in place for another minute after the completion of the injection to minimize backflow. Slowly retract the needle from the head of the mouse.\nRemove the mouse from the nose cone, clean off any blood from the injection site with sterile gauze (if there is any present), and place the mouse in a cage on a cage warmer until awake.\n3. Confirming the injection location\nDeeply anesthetize and perfuse the mouse with saline and 4% paraformaldehyde in phosphate-buffered saline (PBS) as previously described8. Store the brain in 30% sucrose in PBS at 4 °C until the brain sinks (typically 2 days).\nCut 20-50 µm coronal sections on a cryostat as described previously9. While sectioning, observe the injection tract in the tissue block. Record whether the injection tract clearly intersects the lateral ventricle.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}