{
  "id": 19941,
  "origin_website": "Wiley",
  "title": "Plant Sample Collection and Shipment for Multi-omic Analyses and Phytosanitary Evaluation",
  "procedures": [
    "Leaf disks are collected in screw-cap microcentrifuge tubes, freeze-dried, and shipped to a centralized laboratory/service provider for DNA extraction/genotyping. The freeze-drying (lyophilization) method offers a robust and stable format that also facilitates easier shipment and storage. Lyophilization is used to remove moisture from various types of samples while preserving their structure (Maisl et al., 2023[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.952#cpz1952-bib-0024]).\nMaterials\nYoung leaves from plant of interest\nLiquid nitrogen\n2-ml screw-cap polypropylene microcentrifuge tubes, with O-ring and frosted writing surface (e.g., Brand BR780758)\nParafilm\nRefrigerated microcentrifuge, 4°C\nBreathe-Easier Sealing Film (e.g., VWR, 10141-844)\nTube rack, 4°C\nFreeze-dryer\n1. Label 2-ml screw-cap polypropylene microcentrifuge tube on the frosted surface.\n2. Collect 1 to 2 leaf disks per plant from young leaves of plants of interest by punching the leaves directly on the plant between the tube rim and a clean Parafilm surface held with the other hand. Twist the tube to make a clean cut. Avoid veins. Keep on ice until step 3.\nThe number of leaf disks varies according to the amount of tissue requested by the genotyping provider and to the plant species, so it is recommended to perform preliminary tests to determine the optimal amount of starting material or to consult the genotyping company.\n3. Centrifuge briefly in a refrigerated microcentrifuge to move the disks to the tube bottom.\n4. Freeze the tubes containing the leaf disks in liquid nitrogen and store at −80°C until freeze-drying is performed.\n5. For freeze-drying, open the tube and cover the tube opening with a piece of Breathe-Easier Sealing Film.\nIf Breathe-Easier Sealing Film is not available, you can use Parafilm perforated with a needle.\n6. Place the sample tube in a cold tube rack quickly to avoid defrosting and freeze-dry overnight in a freeze-dryer.",
    "Times may vary according to the number of samples and efficiency of the freeze-dryer.\n7. Remove the sealing film and cap tube tightly.\n8. Store at room temperature.\nShip at room temperature as well. See Basic Protocol 6[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.952#cpz1952-prot-0008] for shipping information. In some countries, reducing the material to powder before shipment is sufficient to comply with phytosanitary regulations. Please refer to Basic Protocol 6[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.952#cpz1952-prot-0008] for how to check phytosanitary requirements. Grinding of plant samples can be achieved by adding a tungsten bead to each tube and homogenizing the samples in a Mixer Mill (Retsch, model no. MM 400) after freeze-drying. For high-throughput applications, individual tubes can be substituted with 96-well deepwell polypropylene plates (e.g., Thermo Fisher, 260252). In this case, leaf disks are collected using a metallic hole puncher of appropriate diameter. Plates must be sealed with air-tight polypropylene mats after freeze-drying (freeze-dried disks can stick to sealing tape and get lost).",
    "This protocol is for laboratories on a limited budget that do not wish to use commercial kits (Alternate Protocol[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.952#cpz1952-prot-0003]) or automated DNA extractors. Nucleic acids are extracted in a 96-well format using a phenol-chloroform-sodium dodecyl sulfate (SDS) method, precipitated with isopropanol, and shipped as a pellet. In our hands, the nucleic acids can be used for most genotyping applications and for detection of pathogen DNA/RNA using quantitative or end-point PCR.\nMaterials\nExtraction buffer (see recipe)\nPhenol-chloroform (e.g., Thermo Fisher, 17909)\nIsopropanol\n80% (v/v) ethanol\nTE buffer (10 mM Tris /0.1 mM EDTA, pH 8.0) with freshly added 100 ng/µl RNase A (DNase-free, e.g., Thermo Fisher, EN0531)\nNuclease-free water (DEPC-treated or, e.g., Thermo Fisher, AM9935)\n5-mm hole puncher\nCollection microtubes racked 10 × 96 (Qiagen, cat. no. 19560)\nMicrosoft Excel\nGauze\nRubber band\nTungsten carbide beads, 3 mm (e.g., Qiagen, 69997)\nCollection microtube caps 120 × 8 (Qiagen, cat. no. 19566)\nMixer Mill homogenizer (Retsch, model no. MM 400)\n8-channel micropipets, variable volume (100 to 500 µl and 10 to 50 µl)\nRefrigerated high-RCF (4000 to 5000 × g) microplate centrifuge\n96-well deepwell plates, with polypropylene sealing mats (e.g., Thermo Fisher, 260252)\nBenchtop plate mixer\nBubble wrap\nTransparent packing tape\nPolypropylene PCR plates, with plate seals\n37°C or 60°C heating block\nAdditional reagents and equipment for collecting plant tissue disks (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.952#cpz1952-prot-0001], step 2)\nPreparation of 192 samples\n1. Using a 5-mm hole puncher, collect two young leaf disks or disks of cotyledon tissue (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.952#cpz1952-prot-0001], step 2) per tube in collection microtubes racked 10 × 96. Enter the sample names in a Microsoft Excel file for documentation.\n2. Mark two sets of collection microtubes racked 10 × 96 as 1 and 2 and pay attention to the orientation in order not to confuse the samples.",
    "The rack has a reference 96-well grid that can be used for guidance.\n3. Cover all the collection microtubes with gauze and a rubber band and freeze-dry leaf material.\nFreeze-drying is optional and allows better tissue disruption, recovery of high-molecular-weight DNA, and yield.\n4. Add 1 tungsten carbide bead to each collection microtube and cover the tubes with collection microtube caps 120 × 8.\n5. Disrupt the leaf tissue with a Mixer Mill homogenizer for 1 min at 25 Hz.\n6. Using an 8-channel micropipet, add 400 µl extraction buffer and 100 µl phenol-chloroform to each well. Seal the microtubes with collection microtube caps.\n7. Homogenize in homogenizer for 2 min at 25 Hz.\n8. Centrifuge 10 min at maximum speed, 4°C, in a refrigerated high-RCF microplate centrifuge.\n9. While centrifuging, prepare two clean 96-well deepwell plates on ice, numbered 1 and 2, with 250 µl isopropanol per well and two sealing mats, numbered 1 and 2 and with a mark at position A1.\n10. Without disturbing the interface, collect 300 µl from each microtube using the 8-channel micropipet and transfer it to the isopropanol-filled plates, paying attention to the plate orientation.\n11. Seal plates with a mat and mix with a benchtop plate mixer for 30 s. Leave on ice for 20 min.\n12. Centrifuge 20 min at maximum speed, 4°C.\n13. Discard supernatant, blot dry on a clean paper towel, and place upright on the bench.\n14. Using the 8-channel micropipet, add 200 µl of 80% ethanol to each well.\n15. Paying attention not to invert the mats and their orientation, seal the plates and mix with a benchtop plate mixer for 30 s.\n16. Centrifuge 10 min at maximum speed, 4°C.\n17. Discard the supernatant carefully using the 8-channel micropipet.",
    "18. Air-dry the plate for 10 min at room temperature to allow evaporation of residual ethanol.\n19. Paying attention not to invert the mats and their orientation, seal the plates again. Wrap in bubble wrap and seal with transparent packaging tape to avoid plate breakage during transport.\n20. Ship at room temperature.\nUpon receipt of the samples\n21. Centrifuge 2 min at maximum speed to collect nucleic acid pellet at the bottom of the plate.\n22a. For DNA genotyping/resequencing or pathogen DNA detection: Add 50 µl TE buffer with freshly added 100 ng/µl RNase A to each well. Pipet up and down 5 times. Transfer samples to a polypropylene PCR plate. Incubate 30 min at 37°C in a heating block. Seal and store at −20°C.\n22b. For RNA virus detection: Add 50 µl nuclease-free water to each well. Pipet up and down 5 times. Transfer to a polypropylene PCR plate. Incubate for 10 min at 60°C in a heating block. Seal and store at −20°C.\nGiven that phenol-chloroform-SDS extraction inactivates all known plant pathogens, this protocol is amenable to shipment to countries with strict phytosanitary regulations without the need for a phytosanitary certificate. In our hands, it works well for most genotyping applications and for pathogen detection using quantitative or end-point PCR.\nFor applications in which DNA quantitation is critical, DNA should not be quantified spectrophotometrically (because RNase treatment leaves short ribonucleotides with a strong extinction coefficient at 260 nm) but rather using an assay based on DNA intercalating agents (e.g., Thermo Fisher Picogreen, P7589) or quantitation on an agarose gel using a known-concentration DNA as reference.",
    "In the case of a low number of samples, the extraction can be performed in individual 2-ml round-bottom safe-lock microcentrifuge tubes (e.g., Eppendorf, 0030120094) for the initial homogenization step and 1.5-microcentrifuge tubes (e.g., Eppendorf, 0030120086) for the subsequent steps.",
    "To maintain the high quality standards required for sequencing, it is recommended to use commercial kits to purify DNA from plant tissues. Below, the Qiagen DNeasy Plant Mini Kit and one for the LGC Sbeadex Maxi Plant Kit are mentioned as examples, but there are several different kits on the market that can be used for obtaining high-quality DNA. Some kits, like the LGC Sbeadex Maxi Plant Kit, are easily adaptable to high-throughput automation. Freeze-drying is required to obtain high-molecular-weight DNA; otherwise, fresh leaf material can be used.\nMaterials\nLiquid nitrogen\nQiagen DNeasy Plant Mini Kit (Qiagen, 69104) or LGC Sbeadex Maxi Plant Kit (LGC, 41602)\nAnalytical balance\n2-ml safe-lock microcentrifuge tubes (e.g., Eppendorf, 0030120094)\nTungsten carbide beads, 3 mm (e.g., Qiagen, 69997)\nMixer Mill homogenizer (Retsch, model no. MM 400) with pre-cooled or non-pre-cooled adapter set\nBag with silica gel\nAdditional reagents and equipment for harvesting (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.952#cpz1952-prot-0001], step 2) and freeze-drying (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.952#cpz1952-prot-0001], steps 4 to 6) leaf material\nDNA extraction from fresh leaf material\n1a. Harvest leaf material (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.952#cpz1952-prot-0001], step 2) and place a sample (≤100 mg of young leaf for Qiagen DNeasy Plant Mini Kit or 40 to 120 mg for LGC Sbeadex Maxi Plant Kit depending on the plant species) in a 2-ml safe-lock microcentrifuge tube together with 1 tungsten carbide bead. Freeze the tube in liquid nitrogen.\n2a. To disrupt tissue, put the tube in a pre-cooled adapter set in a Mixer Mill homogenizer and grind the samples for 1 min at 25 Hz.\nThe method of precooling the adapter set (−80°C for ≥2 hr or liquid nitrogen) depends on the Mixer Mill accessory used.\n3a. Refreeze the tubes in liquid nitrogen and repeat step 2a, reversing the position of the tubes within the adapter set.",
    "4a. After the sample is ground to a fine powder, carefully follow the protocol recommended by the manufacturer for the Qiagen DNeasy Plant Mini Kit or LGC Sbeadex Maxi Plant Kit.\nFor the LGC Sbeadex Maxi Plant Kit, both manual and automated protocols are available.\n5a. If the leaf samples are not processed immediately, store at −80°C.\nDNA extraction from freeze-dried material\n1b. Harvest leaf material (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.952#cpz1952-prot-0001], step 2) and place a sample in a 2-ml safe-lock microcentrifuge tube. Freeze-dry it following the instructions in Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.952#cpz1952-prot-0001], steps 4 to 6, and then weigh ≤20 mg (Qiagen DNeasy Plant Mini Kit) or 10 to 30 mg (LGC Sbeadex Maxi Plant Kit ) freeze-dried tissue into a 2-ml safe-lock microcentrifuge tube.\n2b. Add 1 tungsten carbide bead to the tube, put the tube in a non-pre-cooled adapter set in a Mixer Mill homogenizer, and grind the sample for 1 min at 25 Hz.\n3b. Repeat step 2b, reversing the position of the tubes within the adapter set.\n4b. After the sample is ground, carefully follow the protocol recommended by the manufacturer (for the Qiagen DNeasy Plant Mini Kit or LGC Sbeadex Maxi Plant Kit).\nFor the LGC Sbeadex Maxi Plant Kit, both manual and automated protocols are available.\n5b. If the leaf samples are not processed immediately, store at room temperature in a bag with silica gel.",
    "Before shipment to a DNA genotyping/resequencing facility, it may be necessary to perform QC. Usually, DNA is shipped in dry ice, or if EDTA is present (0.1 mM EDTA), it can be shipped using ice pads if the transit time is fast (24 to 48 hr).\nFor genomic analyses, DNA isolation is a crucial step because low-quality DNA may impair the analyses (Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.952#cpz1952-tbl-0001]). Therefore, QC of DNA must be performed before the analyses, depending on the number of samples. A total of 3 to 4 QC samples can be added to each batch, which contains around 60 samples. To perform QC, usually 6 µl is required for each test (2 µl for agarose gel electrophoresis, 2 µl for spectrophotometer readings, and 2 µl for fluorimetric determination of DNA concentration). QC usually consists of the following steps:\n         \n1)Agarose (0.8% w/v) gel electrophoresis to check DNA integrity and RNA contamination: Use a high-molecular-weight marker like phage lambda DNA not digested and/or digested with HindIII to evaluate the size of extracted DNA. Moreover, loading different amounts of the reference marker (e.g., 25, 50, and 100 ng total), the fluorescence can be used to have a rough estimation of the DNA concentration of the unknown samples.\n2)Determination of 260/230 and 260/280 ratios by a spectrophotometer: This is only for samples isolated with a commercial kit like the Qiagen DNeasy Plant Mini Kit or LGC Sbeadex Maxi Plant Kit (see Alternate Protocol[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.952#cpz1952-prot-0003]) that completely eliminates oligoribonucleotides remaining after RNase digestion. Optimal 260/280 and 260/230 ratios are 1.7 to 2.0 and 2.0 to 2.2, respectively.",
    "3)Fluorimetric determination of DNA concentration based on a DNA intercalating agent: Picogreen (Thermo Fisher, P7589), a Qubit dsDNA High Sensitivity Assay Kit (Thermo Fisher Scientific, Q33230), or similar can be used. Depending on the specific protocol/kit used and on the species, the DNA concentration can range from 10 to 20 ng/µl up to 200 ng/µl. It is possible to increase the DNA concentration by reducing the elution volume.",
    "Drying is required for some specific analyses, especially for metabolomics, because water provides the medium for enzyme-mediated reactions that may cause metabolite decomposition (Kim & Verpoorte, 2010[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.952#cpz1952-bib-0021]). Different methods are available for drying samples, such as ambient air-drying, oven-drying, freeze-drying, and trap-drying (Harbourne et al., 2009[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.952#cpz1952-bib-0015]). Among these methods, the most common and suitable method to dry plant material is freeze-drying.\nDuring the process of freeze-drying, the material is first frozen and then exposed to low pressure and subjected to a vacuum to remove the frozen water through sublimation, which reduces oxidative denaturation. Before complete drying, samples are kept at low temperatures so that enzyme activity is inhibited and thus enzyme-catalyzed degradation is reduced.\nMaterials\nLiquid nitrogen\nDry ice (optional)\nStorage tubes or bags\nPermanent marker\nDewar\nFreeze-dryer with vacuum pump (e.g., Christ, model no. Alpha 2-4)\nMixer Mill homogenizer (Retsch, model no. MM 400)\nTungsten carbide beads, 3 mm (e.g., Qiagen, 69997)\nVacuum bags\nAdditional reagents and equipment for harvesting plant tissue (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.952#cpz1952-prot-0001], step 2)\n1. Label as many storage tubes or bags as samples with a permanent marker before harvesting to avoid sample mixture. Then, harvest appropriate plant tissue (e.g., source leaves and sink leaves, stems, and/or roots; see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.952#cpz1952-prot-0001], step 2) according to the experimental aim.\n2. Immediately freeze tissue in liquid nitrogen in a dewar and store it at −80°C until further processing.\n3. Turn on and set up a clean and properly working freeze-dryer with a vacuum pump according to the manufacturer's instructions.\n4. Place the sample on dry ice or in liquid nitrogen until ready to place in the freeze-dryer. Remove the lid of the sample and quickly place it into the freeze-dryer.\nDuring preparation, samples must remain frozen.",
    "To allow water sublimation, samples must be open during the freeze-drying.\n5. Follow the manufacturer's instructions to ensure the freezing temperature is reached.\nThe freezing temperature may vary between samples. The freezing stage includes lowering the temperature inside the freeze-dryer to freeze the sample. The product temperature must be kept below melt temperature to minimize product damage during the primary drying (sublimation) (Wolkers & Oldenhof, 2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.952#cpz1952-bib-0039]).\n6. Once the desired level of dryness is achieved, gradually increase the temperature inside the freeze-dryer to atmospheric pressure.\nDepending on the used plant samples, the level of dryness changes. Therefore, before starting a big experiment, a preliminary test is suggested.\n7. Grind the sample using a Mixer Mill homogenizer and tungsten carbide beads until a fine-powdered form is obtained. Keep samples at a low temperature with liquid nitrogen or dry ice during the grinding process.\n8. After lyophilization, keep samples in vacuum-sealed bags for long-term storage.",
    "In this protocol, samples are frozen in liquid nitrogen or directly transferred to an ultra-low-temperature freezer as soon as possible after collection. Fresh-frozen samples can be stored for several years, as they are kept stable at low temperatures.\nMaterials\nLiquid nitrogen\nDry ice (optional)\n2-ml tubes\nMixer Mill homogenizer (Retsch, model no. MM 400)\nAnalytical balance\nAdditional reagents and equipment for harvesting plant tissue (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.952#cpz1952-prot-0001], step 2)\n1. Harvest plant material from plants (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.952#cpz1952-prot-0001], step 2), place it inside a 2-ml tube, and freeze it in liquid nitrogen.\nAvoid liquid nitrogen entering inside the tube because it can cause the tube to burst.\nIt is recommended that all samples follow the same exact procedure before, during, and after grinding and/or freeze-drying to avoid variation in the omics analysis.\n2. Use a Mixer Mill homogenizer to grind plant samples that are frozen in liquid nitrogen, grinding to a fine powder for 2 min at 25 Hz. Then, place the samples either on dry ice or in liquid nitrogen until the next step to avoid sample melting.\nKeep the grinding mill equipment cool using liquid nitrogen while obtaining powder to avoid sample thawing.\nDuring preparation, samples must remain frozen.\nEach plant material has a specific amount of time until becoming powder, e.g., whereas leaf samples can be ground at a lower frequency and for less time, fruit samples would require relatively more time. If the samples do not become a fine powder within the suggested time, place the tubes back in liquid nitrogen to avoid sample thawing and then repeat grinding.\n3. Label transferring 2-ml tubes before cooling down in liquid nitrogen.\nLabeling of samples is important during sample preparation from the field/greenhouse to sample processing.",
    "4. Aliquot (50 mg) frozen ground material into each labeled transferring 2-ml tube.\n5. For long-term storage, store material at −80°C.",
    "The protocol below is adapted for shipment to countries with strict phytosanitary regulations (see Basic Protocol 6[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.952#cpz1952-prot-0008]), in which freeze-drying or pulverizing of biological materials is considered insufficient for the inactivation of possible pathogens. The introduction of a chaotropic agent like chloroform during the extraction ensures such inactivation. The protocol is adapted for the analysis of both semi-polar and non-polar metabolites, but, because it involves a drying step, not for volatile ones.\nSemi-polar and non-polar internal standards are added to correct for sample loss during the procedure. It is suggested to use QC samples for the large number of samples, which then can help to make sure that samples are treated in the same way in the case of using batches. Samples must be shipped in dry ice, stored at −80°C upon arrival, and analyzed as soon as possible due to the intrinsic instability of extracts. See Basic Protocol 6[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.952#cpz1952-prot-0008] for further shipping information.\nMaterials\nFreeze-dried plant tissue (see Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.952#cpz1952-prot-0005])\nMethanol (LC-MS grade) spiked with fixed concentration of freshly prepared internal semi-polar standard (e.g., 3 ng/ml formononetin)\nChloroform (LC-MS grade) spiked with fixed concentration of freshly prepared internal non-polar standard (e.g., 50 µg/ml DL-alpha-tocopherol acetate).\nTris-NaCl buffer (1 M NaCl and 50 mM Tris-HCl, pH 7.5)\n100% methanol (LC-MS grade)\n100% chloroform (LC-MS grade)\nDry ice\n1.5-ml (conical) and 2-ml (round-bottom) safe-lock microcentrifuge tubes (e.g., Eppendorf, 0030120094 and 003012008620)\nAnalytical balance\nTungsten carbide beads, 3 mm (e.g., Qiagen, 69997)\nRotary shaker for microcentrifuge tubes\nVortex\nRefrigerated microcentrifuge, 4°C\n500-µl Hamilton syringe\nRotary evaporator for microcentrifuge tubes (e.g., Thermo Fisher SpeedVac or Eppendorf Concentrator Plus)\n1. Prepare and label as many 2-ml (round-bottom) safe-lock microcentrifuge tubes as samples.",
    "2. Working under dim light, weigh 5 to 25 mg freeze-dried plant tissue in each tube (quantity depends on the tissue and analytical method used). Place tubes on ice.\nContinue to work under dim light and on ice. Some metabolites (e.g., carotenoids) are extremely sensitive to light and oxygen at room temperature.\n3. Add a clean tungsten carbide bead to each tube.\n4. Add 200 µl methanol spiked with a fixed concentration of freshly prepared internal semi-polar standard (e.g., 3 ng/ml formononetin).\n5. Shake for 10 min in rotary shaker for microcentrifuge tubes.\n6. Add 400 µl chloroform spiked with a fixed concentration of the freshly prepared internal non-polar standard (e.g., 50 µg/ml DL-alpha-tocopherol acetate).\n7. Shake for 10 min in the rotary shaker.\n8. Add 200 µl Tris-NaCl buffer.\n9. Vortex for 10 s.\n10. Centrifuge the samples for 10 min at maximum speed at 4°C in a refrigerated microcentrifuge.\nTwo phases should be visible: the lower one contains the non-polar metabolites, and the upper one contains the semi-polar metabolites.\n11. Collect 300 µl of upper phase (semi-polar metabolites) with a 500-µl Hamilton syringe in a 1.5-ml (conical) safe-lock microcentrifuge tube without disturbing the interface. Wash the syringe with 100% methanol between samples.\n12. Collect 300 µl of lower phase (non-polar metabolites) with the 500-µl Hamilton syringe in a 1.5-ml (conical) safe-lock microcentrifuge tube without disturbing the interface. Wash the syringe with 100% chloroform between samples.\n13. Dry completely in the dark in a rotary evaporator for microcentrifuge tubes. Dry chloroform extracts first (they dry almost immediately) and then dry the semi-polar extracts.\nDo not mix semi-polar and chloroform extracts in the same drying batch.\n14. As soon as pellets are dry, cap and store at −80°C in the dark.",
    "Ship on dry ice. See Basic Protocol 6[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.952#cpz1952-prot-0008] for shipping information.",
    "Sample Shipping\n1. Phytosanitary certificate and import permit\nCountries have different regulations, with some plant products regulated and some not. In general, for the import of unprocessed plant products, a phytosanitary certificate issued by the National Plant Protection Organization of the exporting country is required. Grinding, freezing, and drying are not considered as processing. Certain plants and plant products or plants originating from certain countries or regions may be completely banned from import. The following process can be used as guidance in obtaining a phytosanitary certificate and import permit, if needed:\n1) Check whether the movement of plant samples is legally possible and whether a phytosanitary certificate or other documents are required.\nNational contact points can inform whether a phytosanitary certificate is required for importing plant samples: https://www.ippc.int/en/countries/all/contactpoints/[href=https://www.ippc.int/en/countries/all/contactpoints/]. The legal environments for plant imports across countries can be found here: https://www.ippc.int/en/countries/all/legislation/[href=https://www.ippc.int/en/countries/all/legislation/].\nFor the EU, regulation (EU) 2016/2031 of the European Parliament and the Council regulates the import of plant material from third countries into the EU (https://eur-lex.europa.eu/legal-content/EN/TXT/HTML/?uri=CELEX:32019R2072#d1e32-216-1[href=https://eur-lex.europa.eu/legal-content/EN/TXT/HTML/?uri=CELEX:32019R2072#d1e32-216-1]), and Article 13 of this regulation lists plants, unprocessed plant products, and other objects for which a plant passport is required for their movement within the EU territory.\nProfessional operators can request exemptions from the national authorities from import bans or the requirement for phytosanitary certificates for official testing, scientific or educational purposes, trials, varietal selections, or breeding following the Commission Delegated Regulation (EU) 2019/829 that supplements Regulation (EU) 2016/2031. If granted, a letter of authority will be issued that must accompany shipments in lieu of a phytosanitary certificate.",
    "In the USA, import of plant samples is regulated by Plant Protection and Quarantine (PPQ) under the authority of the Plant Protection Act (https://www.aphis.usda.gov/aphis/ourfocus/planthealth[href=https://www.aphis.usda.gov/aphis/ourfocus/planthealth]). A Controlled Import Permit (CIP) is required to import plant samples that are not intended for plating and are imported solely for destructive analysis. A containment facility may be required for importation of the regulated material. The facility will be evaluated before the permit is issued. Information and forms to apply for a CIP to import plant samples for destructive analysis can be found here: https://www.aphis.usda.gov/aphis/ourfocus/planthealth/import-information/permits/plants-and-plant-products-permits/prohibited/cip[href=https://www.aphis.usda.gov/aphis/ourfocus/planthealth/import-information/permits/plants-and-plant-products-permits/prohibited/cip]. The application is filed online and the CIP to import restricted or not authorized plant material is issued electronically via the ePermit system.\nIn Canada, movement of plants and plant parts is governed by Plant Protection Regulations (https://laws-lois.justice.gc.ca/eng/regulations/SOR-95-212/FullText.html[href=https://laws-lois.justice.gc.ca/eng/regulations/SOR-95-212/FullText.html]). Samples for scientific research can be imported after requesting an import permit from the Canadian Food Inspection Agency (CFIA, https://inspection.canada.ca/importing-food-plants-or-animals/plant-and-plant-product-imports/eng/1299168480001/1299168593866[href=https://inspection.canada.ca/importing-food-plants-or-animals/plant-and-plant-product-imports/eng/1299168480001/1299168593866]), and the permit must be obtained before the shipment arrives in Canada.\n         \n2) Check whether an additional declaration on phytosanitary certificates is required.\nFor the EU, Annex VII of Commission Implementing Regulation (EU) 2019/2072 lists plants, plant products, and other objects originating from third countries, and the corresponding special requirements for their introduction into the EU territory is set out. For export to third countries, the Plant Health Authority in the importing country informs about additional declarations.\n         \n3) Obtain a phytosanitary certificate for the cross-border movement of plant products.\nThe sender of the material contacts the Plant Health Authority in the exporting country and requests a phytosanitary certificate. Some countries can issue electronic phytosanitary certificates using the electronic certification tool TRACES NT (https://webgate.ec.europa.eu/tracesnt/login[href=https://webgate.ec.europa.eu/tracesnt/login]).\n         \n4) Make sure that a phytosanitary certificate or a Letter of Authority [please refer to (1)] is accompanying the consignment.\n2. Biosecurity",
    "Check the plant health status and plant samples for any signs of pests or diseases before packaging.\nCheck and comply with international regulations for shipping plant materials because some countries have strict rules to prevent the spread of pests and diseases. Pest risk usually increases with plant age and size, so larger plants have more potential for exposure to the diversity of pests (Eschen et al., 2017[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.952#cpz1952-bib-0010]).\n3. Labeling\nProperly label samples and carefully print the address of the sender and recipient along with the contact information on the shipping box.\nInclude all the special handling instructions, tracking number, plant species, and quantity of samples and indicate if the phytosanitary certificate is included.\n4. Packaging\nSelect appropriate containers, choosing containers that are suitable for the type of samples being shipped, such as vials, tubes, bags, or boxes.\nPack fresh-frozen or fresh-frozen powdered samples on dry ice.\nUse bubble wrap when sending samples with dry ice, which can prevent shifting of the samples and minimize the risk of sample loss during transit when the ice dissipates. Insulation materials such as Styrofoam can be used for temperature-sensitive plant materials to provide thermal protection.\nIndicate the sample shipping list on the box.\nPlace lyophilized plant samples in vacuum-sealed bags so that samples do not moisturize and can be stored longer.\nEnsure that samples are packed tightly to minimize movement and potential breakage/opening.\nInclude silica gel packets inside the shipping container in order to minimize the potential damage caused by humidity.",
    "Laboratories might have specific packing requirements for shipping. For instance, fresh leaf samples should be double-bagged, and for lyophilized samples, static electricity may cause dried tissue samples to move unexpectedly and cling to the surface (Shillito & Shan, 2022[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.952#cpz1952-bib-0033]). Therefore, it is suggested to consult with the laboratory if static electricity is an issue and if they have a recommended way to remedy it.\n5. Documentation\nInclude a detailed packaging list with a description of each sample.\nClarify the quantity of the samples and provide all the permits and customs forms.\n6. Shipping method\nChoose a suitable shipping method that aligns with the urgency of the shipment and any special requirements.\nKeep a record of the tracking number provided by the shipping service to monitor the progress of the shipment.\nTrack the status of the shipment online and address any issues promptly.\nInform the recipient about the tracking number and the expected delivery date of shipment.\nLong-Term Storage\nIt has been shown that different ways and durations of storage can influence the stability of plant materials (Houba et al., 1995[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.952#cpz1952-bib-0020]). Different enzymes have shown distinct activities after keeping samples at −20°C or −80°C (Hartmann & Asch, 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.952#cpz1952-bib-0016]). For a long safe storage period, we suggest keeping fresh-frozen samples at −80°C for several months or years. Freeze-dried samples must be kept in vacuum-sealed bags, and for short-term storage, silica gel packets can be placed inside the sample boxes to minimize humidity. It is suggested to perform quality checking during storage or after shipment. Performing physicochemical or biochemical analyses at different time points during sample storage can be helpful while carrying out the quality check (Fish & Davis, 2003[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.952#cpz1952-bib-0013]; Phillips et al., 2005[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.952#cpz1952-bib-0030])."
  ],
  "subjectAreas": [
    "Plant Biology"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}