{
  "id": 7873,
  "origin_website": "Bio",
  "title": "Selection of Molecules with Immunological Potential from Excretory and Secretory Products from the Nematode Haemonchus placei by Cell Proliferation and Gene Expression Assays",
  "procedures": [
    "Obtaining H. placei L3 antigens Recovery of H. placei’s L3 stages using parasitological techniques:Note: Basic knowledge of copro-parasitological techniques and at least one isolated H. placei strain is required to perform this methodology. Any further information can be consulted in Thienpont et al. (2003). McMaster technique: Perform the parasitological diagnosis of infected bovine with H. placei by McMaster technique to estimate the number of eggs per gram (EPG) from fecal samples (Liébano-Hernández et al., 2011; Cedillo-Borda et al., 2020).i. Collect 10 g of fecal samples from infected bovine by rectal route using a clean plastic bag. Using nitrile gloves, introduce the index finger into the anal sphincter of the bovine, performing circular movements in a clockwise direction. The rectal stimulus will allow the transit of the feces from the rectum, until they cross through the anal sphincter. Collect the expelled feces with a plastic bag.ii. Weigh 2 g of feces on a granatary scale and place them in a 50 mL plastic tube.iii. Add 28 mL of saturated sodium chloride solution at 1:24 density (see Recipes) and homogenize the feces with a plastic paddle. Put a piece of gauze (5 cm × 5 cm) on the surface of the homogenized feces.iv. Take out 5 mL of the homogenized sample through the folds formed in the introduced gauze with a Pasteur pipette. Then, fill both compartments of the McMaster chamber.v. Perform egg count through the McMaster chamber. Consider the number of EPG into the McMaster chamber lines from top to bottom and from left to right between chambers.vi. Quantify the total EPG using the formula shown in Figure 1.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4702/bioprotoc-13-12-4702-g001.jpgFigure 1. Representative figure of McMaster technique Coproculture and Baermann technique (Liébano-Hernández et al., 2011; Cedillo-Borda et al., 2020):i.",
    "Collect bovine fecal samples directly from the rectum (from 300 to 500 g) using nitrile gloves as indicated in step A.1.a.i.ii. Place the fecal sample in a plastic container (38 cm diameter by 18 cm depth), add distilled water (dH2O) at 25 °C to cover the sample (~350 mL), and macerate the feces with a pistil (20 cm long × 5 cm wide) until obtaining a paste.iii. Add foam rubber and homogenize with the fecal sample. Cover with aluminum foil and incubate at room temperature (25 °C) for seven days. Mix the feces culture every 48 h to ease the development from egg to L3.iv. After seven days, place 100 g of fecal/foam tuber mixture in a piece of non-sterile gauze (15 cm × 15 cm) and wrap in a ball.v. Place each gauze ball using the hands into a Baermann funnel (plastic funnel of 14 cm diameter connected with PVC hose to a 10 mL tube) and add dH2O (at 25 °C) to cover the gauze ball.vi. After 12 h, remove all tubes with the larvae on the bottom and store them at 4 °C for 2 h to precipitate the L3.vii. Remove the supernatant using plastic Pasteur pipettes and recover the L3 pellets.viii. Mix all the L3in new plastic tubes. Taking advantage from the hydrotropism and phototropism of the L3, filter the L3using the optical lens paper over the Baermann funnel for their precipitation (Thienpont et al., 2003).ix. After 24 h at room temperature, remove the tubes from the Baermann funnels, recover L3 at the bottom of the tube using a Pasteur pipette (3 mL), and place the pellet in a T-75 cell culture flask with 15 mL of dH2O. Store in a refrigerator at 4 °C (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4702/bioprotoc-13-12-4702-g002.jpgFigure 2.",
    "Representative figure of the fecal culture and Baermann technique Cleaning of H. placei L3 by density gradient and centrifugation (Liébano-Hernández et al., 2011; Cedillo-Borda et al., 2020):i. Centrifuge the L3 at 1,000× g for 3 min at room temperature. Discard the supernatant and add 2 mL of dH2O.ii. Add 6 mL of 40% sucrose solution (see Recipes) in a 15 mL plastic tube.iii. Place carefully the L3 pellet in the tube containing the sucrose solution. Centrifuge the plastic tube at 1,000× g for 5 min.iv. A larval ring will be formed in the plastic tube. Carefully transfer the larval ring (maximum 2 mL) to a new plastic tube using a glass Pasteur pipette.v. Add 10 mL of dH2O and centrifuge at 1,000× g for 3 min at room temperature. Discard the supernatant and repeat this step twice.vi. Suspend the larval pellet in dH2O. Store the L3 at room temperature or remove the second molt of L3 (Figure 3).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4702/bioprotoc-13-12-4702-g003.jpgFigure 3. Schematic representation of L3 cleaning by density gradient Removal of H. placei L3 sheath (Liébano-Hernández et al., 2011; Cedillo-Borda et al., 2020):i. Centrifuge the L3 pellet at 1,000× g for 3 min. Discard the supernatant.ii. Prepare 6 mL of 0.187% NaClO solution (see Recipes) in a 15 mL plastic tube. Homogenize L3 from 5 to 10 min.iii. Confirm the elimination of H. placei L3 sheath by observing a 10 μL aliquot under an optical microscope (10×).iv. Add 7 mL of dH2O and centrifuge at 1,000× g for 3 min. Discard the supernatant and repeat this step twice or more.v. Suspend the unsheathed larval pellet in dH2O (Figure 4).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4702/bioprotoc-13-12-4702-g004.jpgFigure 4. Representation of the technique for removing H. placei L3 sheath Obtaining excreted-secreted products (ESP) from H. placei:  Note: Count the third-infective larvae considering 10 aliquots of 5 μL.",
    "Then, make a conversion taking the total volume from the aliquots and the final volume of the larvae stock. Example:  50 μL (total aliquots volume) = 300 L3 (counted larvae) 25 mL (final volume) = X (Total larvae stock) = 150,000 L3 Obtaining ESP from in vitro culture (Figure 5)i. Add 18,000 unsheathed L3 to a 50 mL tube with 20 mL of 1× PBS (see Recipes) supplemented with 1% antibiotic-antimycotic 100×.ii. Then, place the 50 mL tube with L3 vertically and incubate for 30 min at room temperature.iii. Centrifuge the L3 at 1,000× g for 5 min. Remove the supernatant and recover the L3 at the bottom of the tube.iv. Place 3,000 L3 in a 6-well plate with 3 mL of Hank’s balanced salt medium (see Recipes) per well.v. Incubate the 6-well plate at 37 °C with 5% CO2 for five days, in order to stimulate and collect the ESP into the culture medium.vi. Collect 1 mL per well of the supernatant from the plate; the first collection of ESP should be at 16 h and then every 24 h. Replace the volume removed with new Hank’s medium.ESP concentration and confirmationi. Centrifuge the ESP from H. placei xL3 at 12,000× g for 40 min at 4 °C to recover the supernatant containing the ESP; then, filter the ESP using 0.2 μm syringe filters and store at -80 °C until use.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4702/bioprotoc-13-12-4702-g005.jpgFigure 5. Schematic representation of obtaining excreted and secreted products from H. placei ii. Confirm ESP through SDS-PAGE (Sambrook and Russell, 2001) at 5%–12% and protein estimation (Bradford, 1976) (Figure 6).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4702/bioprotoc-13-12-4702-g006.jpgFigure 6. Summary of SDS-PAGE assays Peripheral blood mononuclear cells (PBMCs) proliferation and relative gene expression assays Obtaining PBMCs:Blood samplesi. Select three young cattle (male or female) of similar age (between six to eight months) and housed under worm-free conditions.",
    "ii. Identify the jugular vein and clean the puncture site with dH2O and 70% alcohol.iii. Collect ~12 mL of blood from each bovine in EDTA tubes and mix by inverting the tubes repeatedly (Figure 7).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4702/bioprotoc-13-12-4702-g007.jpgFigure 7. Representative figure of PBMCs isolation PBMCs isolation (protocol modified from human mononuclear cells)i. Dilute each blood sample in PBS 1× pH 7.4 in a 1:1 proportion (3 mL of blood sample to 3 mL of PBS) and mix slowly by inversion to avoid the lysis of PBMCs.ii. Place 3 mL of Lymphoprep reagent in a sterile 15 mL plastic tube and carefully add 6 mL of mixed blood/PBS. Avoid mixing the Lymphoprep reagent with the mixed blood/PBS by placing the tip of the micropipette on the side of the tube close to the Lymphoprep reagent and carefully adding the mix. Two phases should be seen.iii. Centrifuge at 800× g for 20 min at room temperature in a Sorvall ST 8R centrifuge with oscillating rotor and slow deceleration. A white PBMCs ring will be formed in the plasma/Lymphoprep reagent interface.iv. Remove the white PBMCs ring using a 3 mL glass Pasteur pipette and transfer all cells in 15 mL tubes with PBS. Immediately dilute the PBMCs with PBS 1× pH 7.4 in a 1:2 proportion and homogenize the mix slowly.PBMCs quantificationi. Determine the volume of PBMCs suspension in RPMI 1640+HEPES supplemented media, according to the total number of flat-bottom plates per trial, including replicates of each treatment. Mix the PBMCs suspension carefully by inversion. Consider that each well should contain 50 μL as final volume if using 96-well plates.ii. Dilute 45 μL of 0.4% trypan blue and 5 μL of PBMCs (1:10 proportion) in a 0.2 mL tube and mix slowly using a glass Pasteur pipette.iii.",
    "Place 20 μL of PBMCs/trypan blue mix into a Neubauer chamber and quantify under an optical microscope (40×).iv. Count the cells using four quadrants (Figure 8). Cells localized on the outer margins of each corner should not be included. Quantify dead (blue) and living cells (white) separately in each quadrant.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4702/bioprotoc-13-12-4702-g008.jpgFigure 8. Schematic figure of the PBMCs quantification v. Obtain the PBMCs concentration per milliliter using the following formula:imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4702/bioprotoc-13-12-4702-ga002.jpg Proliferation assays and H. placei ESP from larval stages:Proliferation assaysNotes:  1) Use a concentration from 2.5 to 5 μg/mL of positive controls (i.e., phytohemagglutinin, lipopolysaccharide, or Concanavalin A) and from 0.02 to 2 μg/mL for ESP suspended with culture medium. Untreated cells as negative controls are required, and a final volume of 100 μL should be adjusted per treatment. 2) An evaluation with different periods of incubation post-treatment (i.e., 6, 12, 24, 48, and 72 h) is recommended. 3) Perform at least three repetitions and replicates from each donor animal. i. Place 300,000–500,000 PBMCs containing 50 μL of medium per well in flat-bottom 96-well plates. Add 50 μL of serial dilutions (previously prepared) of each treatment (e.g., controls and ESP). Incubate the 96-well plates at 37 °C with 5% CO2 (Figure 9).ii. To count the PBMCs proliferation, add 20 μL of CellTiter 96® Aqueous One Solution to each well. Incubate at 37 °C with 5% CO2 for 2 h.iii. Cell quantification is carried out at 490 and 690 nm using a microplate reader for data analysis.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4702/bioprotoc-13-12-4702-g009.jpgFigure 9. Proliferation assays representation Data analysis of proliferation assaysi. Subtract the absorbance of 490 nm from the 690 nm value. This data will allow the elimination of background from the excess of cell debris, fingerprints, and other non-specific absorbance.ii. Obtain the proliferation values through the normalization of untreated cells, expressed as percentage, as follows:imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4702/bioprotoc-13-12-4702-ga003.",
    "jpg Relative gene expression method and analysis of immune genes:Notes:  1) Perform the study with at least three repetitions per replicate of each donor animal. 2) Determine ESP concentrations according to the proliferation assays. 3) Evaluate different periods of incubation post-treatments (i.e., 6, 12, 24, 48, and 72 h). 4) The evaluation of immune genes activated by ESP using relative gene expression requires untreated cells as negative controls. RNA purification (protocol modified from TRizolTM):i. Place from 3 × 106 to 5 × 106 PBMCs in a 24-well plate containing 1.5 mL of RPMI 1640 + HEPES culture medium per well. Add each treatment—ESP or control groups (negative and positive)—using a micropipette. Incubate at 37 °C with 5% CO2.ii. With a micropipette, collect the stimulated PBMCs from each well treated after incubation. Place the cells in 1.5 mL plastic tubes and centrifuge at 250× g for 5 min at room temperature. Remove the supernatant.iii. Add 1 mL of TRizol reagent to 1.5 mL tubes with PBMCs and homogenize slowly at 4 °C with plastic pestle.iv. Mix the samples using a vortex and incubate for 5 min at room temperature.v. Add 0.2 mL of cold chloroform per 1 mL of TRizol reagent and mix by inverting the tubes repeatedly for 15 s. Incubate for 5 min at room temperature.vi. Centrifuge samples at 12,000× g for 20 min at 4 °C. Transfer the aqueous phase corresponding to the RNA to a new tube. This phase will have a transparent appearance.vii. Add 0.5 mL of isopropyl alcohol to the aqueous phase and mix slowly. Incubate for 15 min at room temperature.viii. Centrifuge at 12,000× g for 15 min at 4 °C. Total RNA will remain as a pellet at the bottom of the tube.ix. Carefully discard the supernatant with a micropipette or by decantation.",
    "x. Suspend the RNA with 75% of cold ethanol.xi. Homogenize the samples using a vortex and centrifuge at 7,500× g for 5 min at 4 °C. Discard the supernatant with a micropipette.xii. Leave the RNA to air dry for 20 min inside the fume hood.xiii. Add 30 μL of RNase-free water by carefully pipetting.xiv. Estimate the RNA purity and concentration using a Nanophotometer at a ratio A260/A280 value. Set 1–2 μL of nuclease-free water as blank and then a similar quantity of RNA. Use a 0.5–10 μL micropipette. The result corresponds to the RNA sample purity between 1.8–2.0 values, where lower ratios indicate contamination with proteins.xv. Confirm the integrity of RNA by setting a volume of 8 μL on electrophoresis with a 3% agarose gel (see Recipes) and carry out at 60 V for 30 min in buffer 1× TAE (see Recipes). Then, visualize the RNA integrity (28S and 18S rRNA) using a transilluminator Imagine System (Sambrook and Russell, 2001; Cedillo-Borda et al., 2020).RNA decontamination:i. Perform RNA decontamination in 0.2 mL plastic tubes using the reaction DNase as follows (Table 1):Table 1. Components of the RNA decontamination reaction table:",
    "﻿Component,Volume (μL)\nRNA in water (300 ng is recommended),3\nRQ1 RNase-Free DNase 10× Reaction Buffer,1\nRQ1 RNase-Free DNase,1\nNuclease-free water,5\nii. Incubate at 37 °C for 30 min.iii. Add 1 μL of RQ1 DNase Stop Solution and incubate at 65 °C for 10 min to stop the reaction.Reverse Transcription reaction (protocol modified from ImProm-II Reverse Transcription System Kit®):i. Add 1 μL of random primers and incubate at 70 °C for 10 min. Immediately place the tube with the sample on ice.ii. Working on ice, add the following components (Table 2) to the same PCR tube.Table 2. Components for the reverse transcription reaction table:\n﻿Component,Volume (μL)\nimProm-IITM 5× Reaction Buffer,4.0\nMgCl2(final concentration 1.5–8.0 mM),2.0\ndNTP mix (final concentration 0.5 mM each dNTP),1.0\nRecombinant RNasin® Ribonuclease Inhibitor,0.3\nImProm-IITM Reverse Transcriptase,1.0\nNuclease-free water (to 15 μL),6.7\niii. Incubate at 25 °C for 5 min, at 42 °C for 60 min, and then at 70 °C for 15 min.qPCR assay:i. Perform qPCR assays using the commercial custom RT2 Profiler PCR and NCBI primer BLAST. The genes are selected from the National Centre of Biotechnology (https://www.ncbi.nlm.nih.gov/[href=https://www.ncbi.nlm.nih.gov/]) show in Table 3.Table 3. Gene information used in the PCR design table:\n﻿Custom PCR array design (CAPB13410R),Unnamed: 1\nGenes,GenBank Access\nIL2,NM_180997\nIL4,NM_173921\nIL5,NM_173922\nIL6,NM_173923\nIL8,NM_173925\nIL10,NM_174088.1\nIL13,NM_174089.1\nIFNγ,NM_174086.1\nFCεR1A,NM_001100310.1\nTGFβ1,NM_001166068.1\nHousekeeping design using the NCBI Primer BLAST,\nGenes,GenBank Access\nβ-2 microglobulin FwRv,XM_002691119.4CCATCCAGCGTCCTCCAAAGATTCCTGCTCCGATTTAATCTTCTCCCCA\nβ-actin FwRv,XM_027528015.1CATCGCGGACAGGATGCAGAAACCTGCTTGCTGATCCACATCTGCT\ngapdh FwRv,NM_001190390.1TTGTCTCCTGCGACTTCAACAGCGCACCACCCTGTTGCTGTAGCCAAAT\nii. Perform the PCR assay using the reagents indicated in Table 4 (Estrada-Reyes et al., 2017).Table 4. Components of qPCR assays table:\n﻿Component,Volume (μL)\ncDNA (from 300 ng of RNA),2.0\nGoTaq® qPCR Master Mix,10.3\nNuclease-free water,12.68\niii. Place the commercial custom RT2 Profiler PCR in the Rotor-Gene 6000 and perform the PCR with the following conditions (Table 5):Table 5. Conditions for real-time PCR table:\n﻿Cycles,Stages,Temperature (°C),Time\n1,Initial denaturation,95,10 min\n40,Denaturation,95,15 s",
    "Annealing-elongation,60,45 s,\n1,Dissociation temperature,65–95,Rising ramp\nData analysis:i. Obtain the threshold cycle (CT) from each gene using a threshold value of 0.05.ii. Record the CTvalue in an Excel spreadsheet and analyze on the Qiagen® Gene Globe Data Analysis Center web platform, to normalize through the ΔΔCT method (Double delta CT).iii. Enter https://geneglobe.qiagen.com/mx/analyze/[href=https://geneglobe.qiagen.com/mx/analyze/] and select the PCR analysis tool option. A registered user account is required to access the web platform (Figure 10).iv. Select and upload the data recorded in a datasheet with the CT values.v. Select the control group, groups under study, and housekeeping genes. Select at least two housekeeping genes to the expression analysis.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4702/bioprotoc-13-12-4702-g010.jpgFigure 10. Process to use the Qiagen® GeneGlobe Data Analysis Center web platform vi. The Qiagen® Gene Globe Data Analysis Center platform shows the fold change values. Optionally, download graphs to represent the fold change values. Figure 11 shows an example of the relative expression interpretation.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4702/bioprotoc-13-12-4702-g011.jpgFigure 11. Fold change values on the Qiagen® GeneGlobe Data Analysis Center web platform"
  ],
  "subjectAreas": [
    "Immunology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}