{
  "id": 3824,
  "origin_website": "Cell",
  "title": "Purification of differentiated tumor cells from medulloblastoma for transplantation into mouse cerebellum",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nTissue dissociation\nTiming: 3 hrs\nThis section describes the steps for MB tissues dissociation.\nOn the day of tumor tissue dissociation, prepare the following solutions:\nPapain solution:\nDissolve 100 U papain in 10 mL DPBS.\nAdd 200 μL DNase I, and mix by inversion. The final concentration of DNase I is 250 U/mL.\nAdd 2 mg L-cysteine into the solution.\nAdjust pH value until the solution becomes orange (same shade as DPBS, pH, 7.0–7.3) using 4–6 μL 2N NaOH.\nFilter the solution with a 0.45 μm membrane.\nOvo solution:\nAdd 200 μL DNase I in 5 mL DPBS, and mix by inversion.\nAdd 1 mL Ovo stock solution into the above solution.\nNB-B27 culture medium:\nMix 38 mL neurobasal medium, 800 μL B27 supplement, 400 μL penicillin/streptomycin, 400 μL L-glutamine and 400 μL sodium pyruvate.\nAdjust pH value of the medium to 7.2–7.4 with 2N NaOH (4–6 μL), using a bench-top pH meter.\nNote: The above volume of prepared solutions including papain and Ovo solutions are enough for dissociation of one tumor from Math1-Cre/Ptch1fl/fl mouse. Prepare another set(s) of solutions for dissociation of more than 2 tumors. The pH value of NB-B27 medium is critical for the in vitro survival of MB cells.\nEuthanize a Math1-Cre/Ptch1fl/fl mouse (at 6–8 weeks of age, Figure 1[href=https://www.wicell.org#fig1]) with CO2 following the routine procedure approved by the Institutional Animal Care and Use Committee at Fox Chase Cancer Center.\nRemove the mouse head with a cut posterior from the ears using surgical scissors. Using the scissors, make a midline incision in the skin. Flip the skin over the eyes.\nHold the head with forceps, access the brain by inserting microdissection scissors into the foramen magnum and cutting straight towards the eyes.",
    "Using forceps, peel away the skull and pinch off the cerebellum. Remove the brain stem (anterior to the cerebellum) as much as possible using forceps.\nCut cerebellar tissue into small (2–3 mm) pieces on a 6 cm plastic dish (with 1–2 mL ice cold PBS) using a replacement blade, and bring to tissue culture hood for further dissociation.\nNote: To reduce the risk of contamination, always wipe the working surface in the hood with 70% ethanol and turn on UV light in the hood for 30 min each time before and after using the hood.\nUsing a disposable plastic pipette, transfer tissue pieces to a 15 mL conical tube containing 10 mL Papain solution with DNase I and L-cysteine, and incubate at 37°C in a water bath for 30 min.\nNote: Try to minimize the amount of PBS (less than 500 μL) transferred with the tissue.\nAspirate off the papain solution, and add 2 mL Ovo solution to tissue pieces.\nGently triturate the tissue pieces using a Pasteur glass pipette (fire polished) with a bulb.\nNote: Bubbles should be avoided at this stage for an effective dissociation. It is recommended to pipette up and down 5 times using a Pasteur pipet.\nLet the tissue pieces settle for 1 min at 20°C–25°C, and transfer the top 1 mL suspension to a cell collection tube (a 15 mL conical tube).\nAdd another 1 mL Ovo solution, and triturate again using a Pasteur pipet with a bulb.\nLet the tissue pieces settle for 1 min, and transfer the top 1 mL suspension to the cell collection tube.\nAdd another 1 mL Ovo solution, and triturate using a P1000 pipette (set to 1 mL) with a 1000 μL sterilized pipette tip. Pipette up and down 5 times.",
    "Let the tissue pieces settle for 1 min, and transfer the top 1 mL suspension to the cell collection tube.\nRepeat steps 13 and 14 for another two times, and remove top 1.5 mL suspension to the cell collection tube.\nTransfer all remaining solution/cells to a 1.5 mL Eppendorf tube.\nTriturate with a P200 pipette (set to 200 μL) with a 200 μL pipette tip. Pipette up and down 5 times.\nLet the tissue pieces settle for 1 min, and transfer top solution (approximate 300 μL) into the cell collection tube. (Problem 1[href=https://www.wicell.org#sec6.1])\nNote: Discard the remaining solution (~200 μL) at the bottom of the tube, which contains tissue debris.\nCentrifuge cells (220 × g) in the cell collection tube for 10 min at 4oC.\nAspirate the supernatant and resuspend the cell pellet in 6 mL DPBS-BSA.\nStrain cells through a cell strainer (40 μm) into a 50 mL tube.\nNote: This step will remove the tissue chunks that are not thoroughly dissociated by the trituration. Some liquid is often underneath the strainer after straining dissociated cells. Make sure to suck off liquid from underside of the strainer, to minimize cell loss.\nTransfer the cell suspension from the 50 mL tube to a 15 mL conical tube.\nCentrifuge for 10 min, 220 × g at 4oC. Remove the supernatant.\nWash the cells with 2–3 mL PBS.\nRepeat steps 23 and 24 for another 2 times.\nAfter the last centrifugation, resuspend the cell pellet in 5 mL NB-B27.\nTake 10 μL of above cell suspension into an Eppendorf tube and add 190 μL 0.4% Trypan Blue. Mix gently to count the number of harvested cells and examine cell viability.",
    "Using a P200 pipette, take 100 μL of Trypan Blue-treated cell suspension and apply to a glass hemocytometer. Gently fill both chambers underneath the coverslip, allowing the cell suspension to be drawn out by capillary action.\nUnder an inverted microscope, focus on the grid lines of the hemocytometer with a 10× objective.\nCount live (unstained) cells in all 4 sets of 16 corner squares. Dead cells stained with Trypan Blue in 4 sets of 16 corner squares are counted separately to measure cell viability.\nNote: When counting, cells are only counted when they are set within a square or on the right-hand or bottom boundary line.\nTake the average count of live cells from each of the sets of 16 corner squares, multiply by 104 to get the concentration of Trypan Blue-treated cell suspension, and further multiply by 20 to correct for the 1:20 dilution from the addition of Trypan Blue solution.\nNote: The final value is the number of viable cells/mL in the original cell suspension (5 mL NB-B-27). 6–9 × 107 tumor cells (1.2–1.8 × 107/mL in 5 mL NB-B27) can be obtained from a Math1-Cre/Ptch1fl/fl mouse at 6–8 weeks of age.\nTo calculate the cell viability, add together the live and dead cell count from each set of 16 corner squares to obtain a total cell count. Divide the live cell count by the total cell count to calculate the percentage viability. (Problem 2[href=https://www.wicell.org#sec6.3])\nNote: More than 95% of cells should be alive. If over 5% of cells are dead, the cell suspension should be washed with NB-B27 medium by centrifugation (220 × g for 5 min).\nCollection of differentiated tumor cells by FACS\nTiming: 2 hrs\nThis section describes the steps for immunolabelling tumor cells and purifying differentiated cells by FACS.",
    "Note: All steps for cell immunolabelling should be performed on ice, and all centrifugations should be operated at 4oC.\nCentrifuge the cell suspension at 220 × g for 5 min and resuspend the cell pellet in FACS buffer.\nNote: The ideal density of cells for immunolabelling should be approximately 2 × 106 cells/mL.\nIncubate the cells with the primary antibody against Tag1 (1:50, mouse IgM) or mouse IgM isotype control (1:500) in FACS buffer for 30 min.\nWash the cells with 2 mL PBS, centrifuge at 220 × g for 5 min and remove the supernatant. Repeat this step for 3 times.\nIncubate the cells with Alexa Fluor 594 goat anti-mouse IgM antibody in FACS buffer (1:200, goat IgG) for 30 min in the dark.\nWash the cells with 1 mL of FACS buffer and centrifuge at 220 × g for 5 min. Repeat this step for 3 times.\nAdd 5 μL of Propidium Iodide (PI) staining solution per 100 μL of cell suspension.\nIncubate for 15 min on ice in the dark. Do not wash the cells.\nExclude dead cells from the cell suspension on a BD FACS ARIA-II cytometer. (Problem 3[href=https://www.wicell.org#sec6.5])\nNote: Typically, the percentage of dead cells (PI+) in total cells should be less than 5%.\nHarvest Tag1+ cells and Tag1- cells by FACS (gating strategies are described in the section of expected outcomes[href=https://www.wicell.org#expected-outcomes]). Purified cells are collected into 2–3 mL cold NB-B27 medium.\nNote: Tag1+ cells typically account for 15%–20% of tumor cells harvested from Math1-Cre/Ptch1fl/fl mice at 6–8 weeks of age. (Problem 4[href=https://www.wicell.org#sec6.7])\nKeep purified cells on ice (up to 4 h) for transplantation into mouse cerebella.\nCerebellar transplantation of differentiated tumor cells\nTiming: 3 hrs",
    "This section provides steps for injection of differentiated tumor cells into the cerebella of immunocompromised mice (CB17/SCID mice), to test the tumorigenicity of differentiated cells.\nCentrifuge the cell suspension at 220 × g for 5 min and resuspend the cell pellet in NB-B27 medium. Quantify the number of live cells using a hemocytometer as described in steps 27–32.\nDilute the cell suspension to a density of 4–6 × 104 cells/ μL in NB-B27 medium, and keep on ice until use.\nNote: We routinely inject 5–8 μl of cell suspension (2–5 × 105 tumor cells) into the cerebellum of each CB17/SCID mouse. However, if more cells need to be transplanted into each mouse, the cell density may be scaled up accordingly.\nAnesthetize CB17/SCID mouse for brain surgery:\nWeigh mice using an animal weighing scale.\nAdminister Ketamine/Xylazine solution via intraperitoneal injection (at a dosage of 10 μL per g of mouse weight).\nInject 0.1 mL bupivacaine subcutaneously into the loose skin over the neck (where the incision will be).\nThe proper level of anesthesia in mouse should be confirmed by verifying a lack of pain response after tail pinching.\nNote: The mice should be ready for the surgery within 10 min following the injection of ketamine/xylazine.\nPlace anesthetized mouse on a Kopf stereotaxic frame. Gently tighten the ear bars on the stereotaxic frame, so that they support mouse head and the head is centered. Adjust the height of the bite plate to make sure that mouse head is level on the stereotaxic frame. Press gently on the top of mouse head to ensure that the head does not move (Figures 2[href=https://www.wicell.org#fig2]A and 2B). (Problem 5[href=https://www.wicell.org#sec6.9])\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/546-Fig2.jpg\nFigure 2. Procedures for cerebellar transplantation of MB cells",
    "After being anesthetized, a CB17/SCID mouse was mounted on a stereotaxic frame (A), with ear bars positioned just below the mouse ear (B). A 10–14 mm incision was made through the midline of the scalp (C). An inset in C shows a close-up image of the incision. A small hole (2 mm in diameter) was drilled on the skull over the cerebellum using a hand-held needle (D and E). To locate the cerebellum beneath the skull, find the intersection of sagittal suture line and lambdoid suture lines (red solid circle). The cerebellum is located at 5–6 mm posterior to the intersection (blue solid circle), where the small hole should be made over the skull (F). A, anterior; P, posterior. Following the injection, the syringe should be left in place for 2 min to prevent efflux of injected cell suspension (G). After that, the mouse was removed from the stereotaxic frame, and the incision was sutured (H).\nNote: After placing mouse on the stereotaxic frame, watch the mouse carefully as too much pressure through the ear bars may cause respiratory distress.\nApply non-antibiotic ointment on mouse eyes to ensure that they remain moist while the mouse is anesthetized and during recovery.\nUsing a sharp scalpel or scissors, make an incision (approximately 1/2”) in the midline of the scalp over the position of the cerebellum (Figure 2[href=https://www.wicell.org#fig2]C).\nUsing a cotton swab with PBS, gently scrape away muscles and tendons covering the skull.\nDrill a small hole (2 mm in diameter) in the skull over the cerebellum using a hand-held beveled 18-gauge needle (Figures 2[href=https://www.wicell.org#fig2]D and 2E). Remove skull pieces from the drill point by forceps. (Problem 6[href=https://www.wicell.org#sec6.11])",
    "Critical: The hole on the surface of the skull should be positioned at 5–6 mm posterior to the intersection point of sagittal suture line and coronal suture line (Figures 2[href=https://www.wicell.org#fig2]E and 2F). The depth of the hole should be just through the skull, but not to the beneath cerebellar tissue. Place a beveled 18-gauge needle on the surface of the skull, and gently rotate the needle to make a hole. Must not strongly press the needle over the skull to avoid piercing into beneath cerebellum.\nNote: The small hole in the skull made in this step does not affect mouse survival or cause brain herniation.\nFill a Hamilton syringe (with an unbeveled 24-gauge needle) with cell suspension (5–8 μL) to be implanted and mount the syringe on a micromanipulator.\nNote: The total volume of cell suspension should not be more than 8 μL for each injection.\nThe syringe loaded with purified cells (Tag1+ or Tag1- tumor cells) is introduced through the skull and into the cerebellum at a depth of 2–3 mm through the small hole made at step 50, by manually operating the micromanipulator though the lateral (Y-axis), probe (X-axis) and vertical (Z-axis) directions.\nNote: Because the cerebellum is located beneath the forebrain, introduce the syringe needle at an angle of 40o–60o (relative to the mouse head) to target the cerebellum (as shown in Figure 2[href=https://www.wicell.org#fig2]G). The depth of the needle injection is controlled by a micromanipulator. Fine positioning on Z-axis gives 1 mm movement per revolution.\nCritical: To prevent efflux of the injected cell suspension, penetrate the syringe (loaded with cell suspension) into the cerebellum to a depth of 4 mm and withdraw the needle slowly by 1–2 mm. This step will create some space in the cerebellum for injected cells.",
    "Inject the cells slowly, after which the needle should be left in place for 2 min to avoid flow-back of the injected cells (Figure 2[href=https://www.wicell.org#fig2]G).\nNote: It takes approximately 2 min to inject 8 μL of cell suspension into the cerebellum.\nRemove the mouse from the stereotaxic frame. Close the incision by pulling the edges of the skin together and suturing by a 18” PC-1 needle with a needle holder and Nylon 6-0 suture (Figure 2[href=https://www.wicell.org#fig2]H). A simple interrupted pattern is recommended to close the incision, as it minimizes the risk of skin dehiscence. Tie sutures using square knots with 4 throws. The knots should be loose enough to allow for blood flow at the skin edge to minimize tissue ischemia.\nNote: The Nylon sutures should be removed within 7 days after the surgery.\nBefore being put back into cages, mice should be placed on a warming pad until they start moving (for approximate 20–30 min).\nPut back the mice into cages, and observe the mice until they regain a normal level of activity (including movement, feeding and drinking). (Problem 7[href=https://www.wicell.org#sec6.13])\nMonitor the mice for signs of tumor development in the cerebellum (ataxia, head tilt and hunched back etc.). (Problem 8[href=https://www.wicell.org#sec6.15])\nNote: It typically takes 2–3 months for mice to develop tumors after cerebellar injection of 2–5 × 105 MB cells. However, the tumor latency varies depending on the number of injected cells, as well as age of recipient mice. Tumor formation in recipient mice can be further confirmed by brain dissection combined with histopathological analyses."
  ],
  "subjectAreas": [
    "Cell Isolation",
    "Neuroscience",
    "Cancer"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology"
  ]
}