{
  "id": 6896,
  "origin_website": "Bio",
  "title": "Tyramide Signal-Amplified Immunofluorescence of MYCN and MYC in Human Tissue Specimens and Cell Line Cultures",
  "procedures": [
    "Tissue sections Sample fixation and preparationWhen harvesting tissue, quickly place specimen (with a maximum thickness of 3 mm) directly into 10% neutral buffered formalin and incubate tissue for 24 h at room temperature.Note: Invert the container and/or mix contents every 30 min for the first few h to ensure even exposure and proper fixation. Transfer specimens to 70% ethanol and take tissue to appropriate facility for FFPE sample preparation.Note: If unable to process samples immediately, place specimens at 4 °C. Use standard microtone sectioning procedures to section tissue and dry specimens on positively charged microscope slides overnight.Note: This protocol has been optimized for staining 4 micron thick FFPE tissue sections. If tissues are not to be stained immediately, dip slides in paraffin and store at 4 °C.Antigen retrievalLabel slides as desired with HistoPrep pen.Melt paraffin wax by placing slides on slide warmer at 60 °C for 60 min.Quickly transfer slides to vertical slide holder already submerged in xylene.Incubate slides in xylene four times for 10 min each.Rehydrate tissue with graded alcohol incubations:100% ethanol: two separate incubations for 1 min each90% ethanol: two separate incubations for 1 min each75% ethanol: two separate incubations for 1 min each50% ethanol: two separate incubations for 1 min eachdH2O: two separate incubations for 5 min eachTransfer slides into 1x citra plus antigen retrieval buffer.Add 175 ml of dH2O to the base of pressure cooker and set program to high pressure (or 125 °C) for 4 min.Allow slides to remain in pressure cooker for another 30 min for depressurization and cooling.Remove slides from pressure cooker and allow slides to cool further at room temperature (RT) for 45 min.Wash slides with 1x PBS twice for 5 min each.",
    "Blocking steps (do not allow your tissue to dry out):Inactivate endogenous peroxidases by incubating slides in 3% H2O2 (1:10 dilution of 30% H2O2 in 1x PBS) at RT for 10 min.Wash slides with 1x PBS twice for 5 min each.Permeabilize tissue with permeabilization buffer at RT for 20 min with gentle rocking.Wash slides with 1x PBS twice for 5 min each.Quickly vacuum off PBS around tissue, add PAP circle, place slide in microscope slide moisture chamber, and add PBS to tissue inside PAP circle until all slides are in place.Note: Add 0.5-1 inch of water to bottom of microscope slide moisture chamber and keep chamber covered during incubations. Aspirate PBS and incubate slides in Image-it Enhancer at RT for 30 min.Transfer slides to slide holder already submerged in blocking buffer and incubate at RT for 1 h.Wash slides with 1x PBS twice for 5 min each.Return slides to microscope slide moisture chamber and add PBS to each slide until all slides have been transferred.MYC staining (TSA-IF round 1)Prepare the appropriate amount of antibody diluent with anti-MYC antibody at a 1:500 dilution.Incubate slides with the diluted anti-MYC antibody at 4 °C overnight.Transfer slides to slide holder already submerged in wash buffer and incubate 5 min.Wash slides further with 1x PBS three times for 5 min each.Return slides to microscope slide moisture chamber and add PBS to each slide until all slides have been transferred.Apply the anti-rabbit HRP secondary antibody at 1:1,000 in antibody diluent for 1 h.Transfer slides to slide holder already submerged in wash buffer and incubate 5 min.Wash slides further with 1x PBS three times for 5 min each.Return slides to microscope slide moisture chamber and add PBS to each slide until all slides have been transferred.Prepare the FITC SAB.",
    "One slide at a time, aspirate PBS and apply the FITC SAB to tissue.Note: This protocol has been optimized to apply the FITC SAB for 6 min. Incubation times may need to be optimized for a given experiment to ensure a robust signal and minimal background. The latter can be achieved by using positive and negative controls that differ in the amount of MYC transcript. When applying the stain across multiple slides, be extremely precise with timing. Start timer when FITC SAB is applied to first slide. Continue to replace PBS with FITC SAB and stop reaction at the exact designating time for each slide. To stop reaction, transfer slide to wash buffer. Incubate 5 min in wash buffer after all slides have been transferred.Wash slides with 1x PBS twice for 5 min each.Wash slides with dH2O once for 5 min.To prepare for the second antibody probe, perform the antigen retrieval Steps B6-B10.Note: At this point, FITC has been selectively conjugated to MYC-proximal tyrosine residues. Use of the pressure cooker at this step serves as the stripping method to remove the previously applied primary and secondary antibodies. Stated further in the Notes section, be sure to include appropriate controls to ensure the antibodies have been properly stripped. Reblock tissue by performing Steps C1-C2 and C5-C9.MYCN staining (TSA-IF round 2)Prepare appropriate amount of antibody diluent with anti-MYCN antibody at a 1:500 dilution.Incubate slides with the diluted anti-MYCN antibody at 4 °C overnight.Transfer slides to slide holder already submerged in wash buffer and incubate 5 min.Wash slides further with 1x PBS three times for 5 min each.Return slides to microscope slide moisture chamber and add PBS to each slide until all slides have been transferred.Apply the anti-rabbit HRP secondary antibody at 1:1,000 in antibody diluent for 1 h.",
    "Transfer slides to slide holder already submerged in wash buffer and incubate 5 min.Wash slides further with 1x PBS three times for 5 min each.Return slides to microscope slide moisture chamber and add PBS to each slide until all slides have been transferred.Prepare the Cy3 SAB.One slide at a time, aspirate PBS and apply the Cy3 SAB to tissue.Note: This protocol has been optimized to apply the CY3 SAB for 8 min. Incubation times may need to be optimized for a given experiment to ensure a robust signal and minimal background. The latter can be achieved by using positive and negative controls that differ in the amount of MYCN transcript. When applying the stain across multiple slides, be extremely precise with timing. Start timer when CY3 SAB is applied to first slide. Continue to replace PBS with CY3 SAB and stop reaction at the exact designating time for each slide. To stop reaction, transfer slide to wash buffer. Incubate 5 min in wash buffer after all slides have been transferred.Wash slides with 1x PBS twice for 5 min each.Apply either DAPI at 1:50,000 or Hoechst at 1:2,000 at RT for 15 min.Note: Increase length of incubation if a shorter exposure time at the microscope is needed. Wash slides with 1x PBS three times for 5 min each.Seal tissue by applying 2-4 drops of SlowFade Gold Antifade Mountant, laying on cover slip, gently applying pressure to roll out bubbles and wicking off excess mounting medium.Lay flat and allow slides to dry overnight at RT shielded from light.Note: For longer term use, seal edges of coverslip with nail polish and store at 4 °C. Chamber slides Slide preparationOptimize seeding density for chamber slides so cells are near confluent at time of fixation.",
    "Note: This protocol has been optimized for 8-well chamber slides and fixation 4-5 days after cell seeding. Perform a quick wash with 1x PBS.Incubate slides in 100% methanol for 10 min.Wash slides with 1x PBS twice for 5 min each.Note: Depending on experimental design, chambers can be removed off of slides at this point or anytime here after. Remove chambers according to manufacturer’s recommendations in the presence of PBS and do not let cells dry out.Blocking and antibody incubationsPerform blocking steps and antibody incubations as you would for FFPE tissue described in the previous section, Procedures C, D and Steps E1-E13.Wash slides with dH2O once for 5 min.To prepare for the third antibody probe, perform the antigen retrieval and reblocking steps as you would for FFPE tissue described in the previous section, Steps B6-B10, C1-C2, and C5-C9.Apply the histone H3 antibody at 1:100 and incubate at 4 °C overnight.Note: Application of the histone H3 antibody acts as the nuclear counterstain. After the antigen retrieval step(s), nuclear dyes such as DAPI and Hoechst will no longer completely localize to the nucleus. Transfer slides to slide holder already submerged in wash buffer and incubate 5 min.Wash slides further with 1x PBS three times for 5 min each.Return slides to microscope slide moisture chamber and add PBS to each slide until all slides have been transferred.Apply the Cy5-conjugated anti-rabbit secondary antibody at 1:200 and incubate at RT for 1 h.Transfer slides to slide holder already submerged in wash buffer and incubate 5 min.Wash slides further with 1x PBS three times for 5 min each.Seal tissue by applying 4-6 drops of SlowFade Gold Antifade Mountant, laying on cover slip, gently applying pressure to roll out bubbles and wicking off excess mounting medium.",
    "Lay flat and allow slides to dry overnight at RT shielded from light.Seal edges of coverslip with nail polish (apply at least three coats to ensure cells are fully sealed and the mountant does not leak) and store at 4 °C."
  ],
  "subjectAreas": [
    "Biochemistry",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}