{
  "id": 19475,
  "origin_website": "Jove",
  "title": "Human Microglia-like Cells: Differentiation from Induced Pluripotent Stem Cells and In Vitro Live-cell Phagocytosis Assay using Human Synaptosomes",
  "procedures": [
    "NOTE: All the reagents used in this protocol must be sterile, and all the steps must be performed in a biosafety cabinet under sterile conditions. All the iPSC lines, as well as maintenance and differentiation media, are described in the Table of Materials. The microglia differentiation method illustrated below is based on previously published protocols7,8,12 with new modifications described herein.\n1. Microglia differentiation\nNOTE: An overview of the protocol is summarized in Figure 1.\nInduced pluripotent stem cell (iPSC) culture\n\tNOTE: Further details describing iPSC culture techniques can be found elsewhere17.\n\t\nThawing and maintenance\n\t\t\nPrepare iPSC medium, aliquot the medium, and store at -20 °C for up to 6 months. Thaw the aliquots overnight at 4 °C and use them for up to 1 week. Leave the media at ambient temperature for at least 1 h before use.\nCoat the wells of a 6-well plate by adding 1 mL of 10 µg/mL of laminin 521 diluted in DPBS containing calcium and magnesium18. Keep the plates in an incubator at 37 °C and 5% CO2 for at least 2 h or preferably overnight. Once diluted, store the laminin at 4 °C for 3 months.\nPrepare 10 mM Rho kinase inhibitor Y27632 (ROCK Inhibitor) stock solution by diluting in sterile water. Make single-use aliquots of ROCK inhibitor solution and store them at -20 °C for up to 1 year.\nPrepare 0.5 mM EDTA by diluting the stock solution of 0.5 M EDTA in DPBS.\nTo thaw a vial of frozen iPSCs, place the vial in a water bath at 37 °C until it is mostly thawed. Immediately transfer the content of the vial to a 15 mL conical tube containing 4 mL of iPSC medium. Centrifuge at 500 × g for 1 min.",
    "Aspirate the supernatant and resuspend the cells by adding 1 mL of iPSC medium containing 10 µM ROCK inhibitor slowly against the wall of the tube to avoid disturbance of the colonies.\nAdd 1.5 mL of iPSC medium containing 10 µM ROCK inhibitor to each of the coated wells and transfer the resuspended colonies drop by drop to the wells containing the medium.\n\t\t\tNOTE: Use 5-7 drops from step 1.1.1.6 for culture maintenance but adjust the optimal seeding density for every iPSC line.\nEvenly distribute the cells in the wells by manually shuffling the plate side-to-side and back to front. Place the cells in an incubator at 37 °C and 5% CO2. The next day, completely replace the medium by adding fresh iPSC medium without ROCK inhibitor.\nFor maintenance, change the medium every day until the cells reach 80% confluency.\n\t\t\tNOTE: The cells can be maintained without changing the medium for 2 days if the iPSC medium used allows a flexible feeding schedule. It is advised to limit this to one time per passage and only if the cells are less than 50% confluent.\nSplitting\n\t\t\nAspirate the medium and wash the cells with 1 mL of DPBS (without calcium and magnesium).\nTo dislodge the cells, add 1 mL of 0.5 mM EDTA and incubate for 2-3 min at room temperature until the edges of the cell colonies lift from the surface of the well. Wash the cells again with DPBS and add 1 mL of iPSC medium.\nDissociate the cell colonies by gently scraping them using a cell lifter. Scrape each area of the well only once to avoid disturbing the colonies.\n\t\t\tNOTE: Alternative methods to dislodge the colonies from the well can be found elsewhere17.",
    "Using a 1 mL pipette tip, collect the cells and transfer them drop by drop at a 1:6 ratio (cells to medium) into precoated wells (as mentioned in step 1.1.1.2) containing 1.5 mL of iPSC medium.\niPSC differentiation to microglia-like cells (iMGs)\n\tNOTE: The small molecules and growth factors are dissolved in sterile-filtered 0.1% bovine serum albumin in DPBS to a stock concentration 1,000x higher than the final concentration. It is recommended to differentiate iPSCs into iMGs during early passages. Routine karyotyping of iPSC lines is advised.\n\t\nPrepare standard coating solution\n\t\t\nThaw the stock solution of an extracellular matrix coating reagent on ice at 4 °C overnight.\nPrechill microcentrifuge tubes and filter pipette tips at 4 °C.\nAliquot 250 µL of the concentrated extracellular matrix coating reagent into each tube and immediately place on ice. Store the aliquots at -20 °C.\nTo prepare the coating solution, thaw one of the extracellular matrix coating reagent aliquots on ice at 4 °C overnight.\nAdd 50 mL of ice-cold DMEM-F12 optimized for growth of human embryonic and induced pluripotent stem cells (referred as to DMEM-F12) media to a prechilled conical tube and keep it on ice.\nChill a 1 mL pipette tip by pipetting ice-cold DMEM-F12 up and down multiple times, and then immediately use the pipette tip to transfer 250 µL of the extracellular matrix coating reagent into the conical tube containing the DMEM-F12 medium.\n\t\t\tNOTE: The standard coating solution can be stored for 2 weeks at 4 °C.\nEmbryoid body (EB) formation\n\t\t\nPrepare EB medium that can be maintained at 4 °C for up to 4 days.",
    "Once iPSCs have reached 80% confluency, dissociate the colonies by washing with 1 mL of DPBS and adding 1 mL of a dissociation reagent for 2 min at 37 °C. Dislodge the colonies using a cell lifter by scraping multiple times to create a single-cell suspension. Collect the cells and transfer everything to a 15 mL conical tube containing 9 mL of DPBS.\nCentrifuge the cells at 500 × g for 1 min, remove the supernatant, and resuspend the cells in 1 mL of EB medium. Take 10 µL of cells and dilute 1:1 with Trypan blue. Count the cells with a hemacytometer, and based on the cell count, dilute the cell-stock to a final dilution of 10,000 cells per 100 µL. For plating cells, add 100 µL of the diluted cells per well into a low adherence, round-bottom, 96-well plate.\n\t\t\tNOTE: Generally, 48 wells of the 96-well plate can be obtained from each 80% confluent well of iPSCs.\nCentrifuge the plate at 125 × g for 3 min and incubate at 37 °C and 5% CO2 for 4 days. Perform a half-medium change on day 2 by using a multichannel pipette and gently collecting 50 µL of old medium, and then adding back 50 µL of fresh EB medium.\n\t\t\tNOTE: On day 4, iPSCs will form spherical cellular structures termed EBs as described in the results section. The EB differentiation process can be extended up to 7 days, if necessary.\nGeneration of primitive macrophage precursors (PMPs)\n\t\t\nPrepare PMP base medium, sterile-filter, and store it at 4 °C for up to 1 month.\nCoat the wells of a 6-well plate by adding 1 mL of ice-cold Matrigel coating solution and incubate at 37 °C and 5% CO2 for at least 2 h or preferably overnight.",
    "On day 4 of EB differentiation, transfer the EBs to the Matrigel-coated wells by collecting the EBs with 1 mL pipette tips (using a pipette). Pipette up and down once or twice to dislodge the EBs from the well. Hold the 6-well plate at a tilted angle to allow for the EBs to settle down at the edge of the well.\n\t\t\tNOTE: Nine or ten EBs can be plated per coated well.\nOnce all the EBs have settled down, gently pipette and remove the old medium using a 1 mL pipette tip while keeping the EBs at the edge of the well. Add 3 mL of freshly prepared PMP complete medium to each well. Evenly distribute the cells in the wells by manually shuffling the plate side-to-side and back to front. Place the plate in the incubator at 37 °C and 5% CO2.\nDo not disturb the plate for 7 days to allow the EBs to attach to the bottom of the well. After that time, perform a half-medium change using PMP complete medium.\n\t\t\tNOTE: At this point, most of the EBs should be attached to the plate. Any floating EBs can be removed.\nAfter 5-7 days, inspect the EBs under a light field microscope at 4x magnification to ensure that they are attached to the bottom of the wells. Change the medium as described in 1.2.3.5. On day 21, perform a complete medium change with 3 mL of PMP complete medium.\n\t\t\tNOTE: Myeloid progenitors floating in the medium may be evident at this point. These cells should be discarded during the medium change.",
    "On day 28, look for round cells referred to as PMPs in the supernatant and collect the medium containing the PMPs using a 10 mL pipette and automatic pipettor. Take care not to disturb the EBs. Transfer the PMPs and the medium to a 15 mL conical tube and proceed as described in step 1.2.4.\n\t\t\tNOTE: Usually PMPs from the same iPSC line can be collected from five wells of a 6-well plate and pooled together in a single 15 mL conical tube.\nAdd 3 mL of fresh PMP complete medium for further maintenance of the EBs. As PMPs continuously emerge from EBs for more than 3 months, collect them every 4-7 days (do not allow the medium to change color to a yellow tone) as described in steps 1.2.3.7 and 1.2.3.8.\n\t\t\tNOTE: Although PMPs can be collected for several months, they may change their phenotype over time.\nDifferentiation to iMGs\n\t\t\nPrepare iMG base medium (Table of Materials), sterile-filter and store it at 4 °C for up to 3 weeks.\nOnce the PMPs have been collected into a 15 mL conical tube, centrifuge them at 200 × g for 4 min. Aspirate the supernatant and resuspend the PMPs using 1-2 mL of iMG basal medium. Count the cells using a hemocytometer by taking a small aliquot and diluting 1:1 with Trypan blue.\n\t\t\tNOTE: 0.5-1.5 × 106 PMPs are normally obtained every week depending on the iPSC line and the age of the EB culture.",
    "Centrifuge the rest of the cells again at 200 × g for 4 min. Dilute the PMPs to the desired concentration such that cells are plated at a density of ~105/cm2 on cell culture-treated plates using freshly prepared iMG complete medium. Perform a half-medium change using freshly prepared iMG complete medium every 3-4 days throughout 10-12 days to allow for terminal differentiation.\n\t\t\tNOTE: At this point, the cells should acquire microglia-like morphology. To confirm the commitment of PMPs to microglia fate, immunofluorescence analysis is performed to corroborate the expression of microglia-enriched markers such as purinergic receptor P2RY12 and transmembrane protein 119 (TMEM119)9.\nTo preserve cell health and viability, perform all the experiments between days 10 to 12 of iMG differentiation.\n2. Phagocytosis assay using motor-neuron-derived human synaptosomes\nTranscription factor-mediated differentiation of iPSC-derived lower motor neurons (i3LMNs)\n\tNOTE: A WTC11 line with stable insertion of the hNIL inducible transcription factor cassette containing the neurogenin-2 (NGN2), islet-1 (ISL1), and LIM homeobox 3 (LHX3) transcription factors into the CLYBL safe harbor locus was used for the differentiation process as described previously17. The iPSC line was maintained as described in step 1.1.1 but with the coating conditions described in step 1.2.1. Any extracellular matrix coating reagent can be used for culturing iPSCs that will be used for neuronal differentiation since laminin 521 is not required. All the media are equilibrated to ambient temperature for at least 1 h before use.\n\t\nCoat 10 cm dishes with 5 mL of standard coating solution as described in step 1.2.1.\n\t\tNOTE: Here, 3-4 10 cm dishes were used per differentiation.\nPrepare Induction Base medium, sterile-filter, and store it at 4 °C for up to 3 weeks.\nPrepare Neuron medium, sterile-filter, and store it at 4 °C for up to 2 weeks.",
    "Prepare borate buffer by mixing 100 mM boric acid, 25 mM sodium tetraborate, and 75 mM sodium chloride in sterile water. Adjust the pH to 8.5 and sterile-filter it.\nOnce iPSCs have reached 80% confluency, wash the cells with DPBS and dislodge the colonies by adding 0.5 mM EDTA.\n\t\tNOTE: Two wells are usually sufficient for each 10 cm dish.\nIncubate the cells for 4-5 min at ambient temperature. Remove the EDTA and add 3 mL of DMEM/F12 with HEPES to each well.\nScrape the cells using a cell lifter and use a 10 mL pipette to remove the cells from the bottom of the well by gently pipetting up and down 2-3x.\nCollect the cells in a 15 mL conical tube and centrifuge at 300 × g for 3 min.\nResuspend the cells in 3 mL of iPSC medium containing 10 µM ROCK inhibitor and count them using a hemacytometer.\nPlate 1.5 × 106 iPSCs in a precoated 10 cm dish with 12 mL of iPSC medium containing 10 µM ROCK inhibitor.\nThe next day, remove the medium and wash the cells with DPBS. Add 12 mL of freshly prepared Complete Induction medium to induce the expression of the transcription factors.\nOn day 2, coat 10 cm dishes with 5 mL of neuron coating solution prepared with equal volumes of 0.1 mg/mL of poly-D-lysine and 1 mg/mL of poly-L-ornithine diluted in borate buffer. Incubate overnight at 37 °C and 5% CO2.\nOn day 3, wash the coated dishes with sterile water 3x, aspirate the water completely, and let the dishes dry by tilting the plates and leaving them partially uncovered inside a biosafety cabinet for at least 1 h at ambient temperature.",
    "Once the dishes have fully dried, coat them with 6 mL of Complete Induction medium supplemented with 15 µg/mL of laminin and 40 µM BrdU for at least 1 h at 37 °C and 5% CO2.\n\t\tNOTE: BrdU treatment is recommended to eliminate mitotically active cells and thus to enhance the purity of the neuronal cultures. The effects of BrdU on neuronal health are minimal.\nTreat the differentiating cells with 3 mL of dissociation reagent per 10 cm dish and incubate for 3-4 min at ambient temperature.\nAdd 6 mL of DPBS into the plate without removing the dissociation reagent and pipette the cells in solution up and down 4-5x with a 10 mL pipette to dissociate the cells.\nCollect the cell suspension and pass it through a 40 µm cell strainer into a 50 mL conical tube. Add 1 mL of Induction base medium to rinse the strainer.\nCentrifuge the cells at 300 × g for 5 min. Aspirate the medium and resuspend the cells in 3 mL of Complete Induction medium containing 40 µM BrdU.\nCount the cells with a hemocytometer. Plate approximately 2.5 × 106 cells per 10 cm dish into precoated dishes by diluting the cells in 6 mL of Complete Induction medium containing 40 µM BrdU without removing the coating solution added in step 2.1.14.\nOn day 4, aspirate the medium, wash the cells 1x with DPBS, and add fresh Complete Induction medium containing 40 µM BrdU.\nOn day 6, aspirate the medium, wash the cells 1x with DPBS, and add Neuron medium supplemented with 1 µg/mL of laminin.\nAt day 9, change 1/3rd of the medium by replacing it with fresh Neuron medium supplemented with 1 µg/mL of laminin.",
    "Maintain i3LMNs for an additional 25 days by performing half medium changes with Neuron medium supplemented with fresh 1 µg/mL of laminin every 3-4 days.\n\t\tNOTE: At this timepoint, i3LMNs should present a neuronal morphology with long processes. Neurons also tend to form clumps or clusters of cells. A more detailed description of how to validate the differentiation of i3LMNs can be found elsewhere17.\nSynaptosome purification and labeling\n\tNOTE: Maintain sterile conditions and perform all steps inside a biosafety cabinet.\n\t\nWash i3 LMNs twice with DPBS.\nAdd 2 mL of ice-cold cell lysis reagent for isolation of synaptosomes, incubate on ice for 2 min, and firmly scrape the neurons.\nTransfer the lysate to multiple 2 mL microtubes (~1.5 mL lysate per tube) and centrifuge at 1,200 × g for 10 min at 4 °C.\n\t\tNOTE: Maintain the tubes on ice throughout this procedure.\nCollect the supernatant (discard the pellet) and centrifuge at 15,000 × g for 20 min at 4 °C. Save and resuspend the pellet containing the synaptosomes with a similar volume (as the original lysate) of 5% DMSO in DPBS.\n\t\tNOTE: The synaptosomes can be immediately labeled with a fluorophore or stored at -80 °C for future use.\nPerform a Bicinchoninic acid (BCA) protein assay for all tubes to assess the total yield of protein in the synaptosome preparation.\n\t\tNOTE: Other assays to measure protein concentration can be used. The total protein yield obtained from different preparations has been included in Table 1 as a reference. It is recommended to perform western blot analysis of the synaptosome preparation to confirm the presence of presynaptic and postsynaptic proteins. Here, the presynaptic marker, synaptophysin (SYP), and the postsynaptic marker, postsynaptic density protein 95 (PSD95) were chosen for western blotting analysis as described previously19.",
    "Prepare a solution of 100 mM sodium bicarbonate in water, adjust the pH to 8.5, and sterile-filter.\nSolubilize 1 mg of lyophilized powder of the used pH-sensitive dye into 150 µL of DMSO. Make single-use aliquots and store them at -80 °C.\nCentrifuge the synaptosomes at 15,000 × g for 5 min at 4 °C.\nDilute up to 1 mg of synaptosomes in 100 µL of 100 mM sodium bicarbonate solution.\nTo label the synaptosomes, add 1 µL of the reconstituted pH-sensitive dye per 1 mg of synaptosomes and cover the reaction with aluminum foil to avoid light exposure. Shake at room temperature for 2 h using a tube shaker.\nAdd 1 mL of DPBS to the tube and centrifuge the labeled synaptosomes at 15,000 × g for 5 min at 4 °C.\nRemove the supernatant and perform four additional washes as described in step 2.2.11.\nAfter the final wash and spin, remove the supernatant as much as possible without disturbing the pellet and resuspend the labeled synaptosomes with 5% DMSO in DPBS at a volume for the desired concentration (0.7 µg/µL used here). Prepare single-use aliquots and store at -80 °C. Be sure to avoid light exposure to the labeled synaptosomes.\nLive-cell phagocytosis assay\n\t\nPlate 20-30 × 104 PMPs into 96-well plates in 100 µL of iMG complete medium and follow the differentiation process for 10 days as indicated in step 1.2.4.\nOn the day of the assay, prepare the nuclear staining solution by adding 1 drop of a nuclear stain for live cells into 2 mL of iMG basal medium.\nRemove 40 µL of medium per well of the 96-well plate and add 10 µL of the nuclear staining solution using a multichannel pipette. Incubate the plate at 37 °C and 5% CO2 for 2 h.",
    "Thaw the labeled synaptosomes on ice and gently sonicate using a water sonicator for 1 min. Immediately transfer the synaptosomes back to ice. Dilute the labeled synaptosomes in iMG complete medium at a ratio of 1 µL of synaptosomes per 50 µL of medium.\n\t\tNOTE: The concentration of synaptosome is assay-dependent and may require optimization. To maintain a relatively low percentage (i.e., 0.1% or less) of DMSO in the medium, it is advised not to add more than 2 µL of synaptosomes per well.\nAs negative control, pretreat some of the wells with cytochalasin D to inhibit actin polymerization and thus phagocytosis. Prepare a solution of 60 µM cytochalasin D in iMG complete medium. Add 10 µL of this solution to each well for a final concentration of 10 µM and incubate at 37 °C and 5% CO2 for 30 min.\nRemove the plate from the incubator and incubate at 10 °C for 10 min. Maintain the plate on ice and add 50 µL of medium containing synaptosomes prepared as described in step 2.3.4.\nCentrifuge the plate at 270 × g for 3 min at 10 °C and maintain the plate on ice until imaging acquisition.\nImaging acquisition and analysis\n\t\nInsert the plate into a live-cell imaging reader and select the wells to be analyzed.\nSelect a 20x objective lens.\nAdjust the focus, light-emitting diode (LED) intensity, integration time, and gain of the brightfield and blue (4',6-diamidino-2-phenylindole [DAPI]) channels. The synaptosome fluorescence should be negligible at the initial time point. To focus on the red (RFP) channel, use the brightfield channel as a reference. The integration time and gain can vary between experiments; use these initial settings for the red channel: LED: 4, integration time: 250, and gain: 5.",
    "Select the number of individual tiles to be acquired in a montage per well (acquire 16 tiles at the center of the well, thereby imaging approximately 5% of the total well area). Set the temperature to 37 °C and the desired time interval for imaging.\n\t\tNOTE: Images were acquired every 1 - 2 h for up to 16 h in this study.\nOpen the analysis software.\n\t\t\nOpen the experiment that contains the images. Click on the Data Reduction icon.\nIn the menu, pick Imaging Stitching under Imaging Processing to create a complete image from the 4 x 4 individual tiles in the montage with the parameters described in Table 2.\nOnce the stitched images have been created, define an intensity threshold using the DAPI and RFP channels for these images. Open an image and click on Analyze; under Analysis, select Cellular Analysis, and under Detection Channel, pick a stitched image either in the DAPI or RFP channels. Go to the Primary Mask and Count tab and establish a threshold value and object size values that properly select the cell nuclei in the DAPI channel or the synaptosome signal in the RFP channel. Repeat the process with different images until parameters that can be applied to the entire experiment are optimized.\n\t\t\tNOTE: Suggested values can be found in Table 2.\nTo count the number of nuclei, go to the Data Reduction menu, and under Image Analysis, select Cellular Analysis. Go to the Primary Mask and Count tab and under Channel, select the DAPI stitched images and use the parameters described in Table 2.\nGo to the Calculated Metrics tab and select Cell Count. To obtain the area of the synaptosome signal, go to the Data Reduction menu and under Analysis, select Cellular Analysis.",
    "Go to the Primary Mask and Count tab and under Channel, select RFP stitched images and use the parameters detailed in Table 2.\nGo to the Calculated Metrics tab and select Object Sum Area. In the Data Reduction tab , click on OK and allow the software to analyze all the acquired images.\nExport the Object Sum Area and Cell Count values for each time point. Divide the Object Sum Area by the Cell Count to calculate the normalized area per time point. If comparing multiple treatments or genotypes, calculate the phagocytosis index using equation (1):\nimgsrc://cloudfront.jove.com/files/ftp_upload/64323/64323eq01.jpg (1)\nSave the results and integrate the data.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}