{
  "id": 4509,
  "origin_website": "Bio",
  "title": "Isolation and <em>in vivo</em> Transfer of Antigen Presenting Cells",
  "procedures": [
    "imgsrc:https://en-cdn.bio-protocol.org/attached/image/20141005/20141005060518_0627.jpg Figure1. Scheme of cell enrichment protocol      Implantation of B16.Flt3L melanoma in mice   The B16.Flt3L melanoma cell line is grown to confluence in complete DMEM medium in standard cell culture flasks (25 cm2), and the cells are harvested by trypsinization. For this, aspirate the medium from the culture, and wash the adherent cells with sterile PBS. After washing, add 5 ml Trypsin EDTA (0.05%) solution and incubate at 37 °C for 5 min.    After incubation, gently tap the flask on one side to lift the cells off of the surface of the vessel.    Add 20 ml of complete DMEM medium to quench the protease digestion.   Harvest cells from the flask by gently pipetting up and down three times, and then collecting the medium into a sterile 50 ml centrifuge tube.    Pellet cells by centrifuging at 300 x g for 5 min at 4 °C. Wash the cells three times with PBS and resuspend in PBS to a density of 108 cells/ml.     Inject mice with 100 µl cell suspension (107 cells) subcutaneously into a single site in the area of the shoulder at the base of the neck.  This and all other procedures involving animals must be in accordance with and approved by the Institutional Animal Use and Care Committee (IACUC).    Allow the tumor to grow until palpable or visible (2-10 mm in diameter, usually 7-10 days) before sacrificing animals for harvesting organs.      Preparation of splenic single cell suspension   Anesthetize mice with isoflurane. A typical approach for anesthesia involves placing the animal in an induction chamber connected to an oxygen source and isofluorane vaporizer, and adjusting oxygen flow to 0.9 liters/min and the isofluorane vaporizer to 3.5%. As soon as mice become unresponsive, they are sacrificed by cervical dislocation.",
    "Sterilize the left side of the abdomen by spraying the skin with 70% ethanol.   Working under clean, aseptic conditions, make an incision under the rib cage on the left side of the abdomen and extract spleen using scissors.  Place in sterile serum free RPMI medium.   From this step onwards, work in the biosafety cabinet and perform all the steps under sterile conditions.    Wash the aseptically extracted spleen by submerging it in 5 ml of serum-free RPMI medium, and then transfer to a fresh 100 mm diameter Petri dishes. Note that because of the high yield of splenocytes from B6.Flt3L tumor bearing mice, one spleen is sufficient for most experiments, and this protocol is for the processing of a single spleen. For larger experiments involving pooling of two or more spleens, volumes may need to be scaled up proportionately.    Cut spleen tissue into approximately 2 mm3 pieces using scissors and incubate in 10 ml of collagenase D (~200 units) and DNase I (10 μg/ml) solution at 37 °C for 30 min. Make sure the tissue pieces are completely immersed in the solution.    Place a 70 µm cell strainer placed in a fresh Petri dish, and transfer the tissue pieces to it by pipetting with a 25 ml pipette.    Crush the splenic pieces by gently compressing the tissue fragments against the mesh with the syringe plunger. Wash the mesh filter with 5 ml of complete RPMI medium to wash cells through the filter and into the collection dish. Use of 70 µm mesh filter removes larger cell aggregates and helps in generation of single cell suspension.   Pellet cells by centrifuging at 300 x g for 5 min.   Discard supernatant and add 2 ml RBC lysis buffer to the pellet.",
    "Mix gently by pipetting thrice with a 1 ml pipette and further incubate at room temperature for 5 min. Avoid longer incubations with RBC lysis buffer, since this may compromise cell viability.   Neutralize the RBC lysis buffer by adding complete RPMI medium (12 ml per spleen) to the resulting suspension and centrifuge at 300 x g for 5 min.    Resuspend the cell pellet in MACS buffer, using 0.5 ml per spleen. Filter through 70 µm cell strainer to remove cell clumps to prevent MACS column from clogging.      Purification of CD8αPos DCs and CD8αNeg DCs from splenic single cell suspension Isolation of the CD8αPos DCs and CD8αNeg DCs from splenic cell suspension is a three-step protocol as illustrated in Figure 1. It relies on depletion of undesired populations like B, T and NK cells in the first step, followed by positive selection of CD8αPos DCs in the second step, and positive selection of CD8αNeg dendritic cells in the third step. Keep the cells on ice and use pre-cooled buffers to maintain 2-8 °C working temperature to prevent antibody capping and non-specific binding to irrelevant cells.   Determine the cell number, and adjust concentration to approximately 5 x 108 cells/ml in MACS buffer containing 20 µg/ml Fc-gamma receptor blocking antibody (2.4G2).   For each 108 total cells, add 100 µl of biotin antibody cocktail provided in the CD8αPos DC isolation kit. The antibody cocktail binds to B cells, T cells and NK cells.   Mix thoroughly and incubate in ice cold water (4-8 °C) for 15 min.    For each 108 total cells, add 150 µl of MACS buffer and 100 µl of anti-biotin beads provided in the CD8αPos DC isolation kit.    Mix gently and incubate again in ice cold water (4-8 °C) for 15 min.",
    "Add 12 ml MACS buffer and pellet cells by centrifuging at 300 x g for 5 min.    Discard supernatant and resuspend the cell pellet in 2 ml of MACS buffer.   Place a fresh MACS column in the magnetic field of an appropriate MACS separator.    Equilibrate column by washing with 5 ml of MACS buffer.    Pipette the cell suspension gently in the middle of the column.   Collect unlabeled cells that flow through the column followed by washing with 10 ml MACS buffer.  The unlabeled flow through thus collected is enriched for DCs.    Pellet the enriched DC fraction by centrifuging at 300 x g for 5 min.    Resuspend the cells into 1 ml MACS buffer and add 200 µl of anti-CD8α conjugated Miltenyi magnetic bead suspension and incubate in ice cold water (4- 8 °C) for additional 15 min.   Repeat steps C6-11.  The CD8αPos dendritic cells are bound with the anti-CD8α magnetic beads in this enrichment method, and are thus retained in the column.  The flow through of the column is enriched for CD8αNeg DCs and depleted for CD8αPos dendritic cells. The flow through should be retained to use for isolation of CD8αNeg dendritic cells in steps C18-22 below.      To elute the CD8αPos DCs from the column, gently remove the column from the magnetic field, add 5 ml MACS buffer and purge the column firmly with a syringe plunger.   For enhanced purity, the CD8αPos enriched cells are passed through two consecutive columns. For this, pellet the eluted cells in step C15, resuspend with 2 ml MACS buffer and repeat steps 8-15.    Pellet the collected CD8αPos DCs by centrifugation, resuspend in 0.2 ml medium and count. Keep the cells on ice until needed to enhance viability.",
    "For isolation of CD8αNeg DCs, use the unlabeled cells collected as the column flow through in step C16. Pellet the cells by centrifugation and resuspend in 300 µl of MACS buffer.    Add 100 µl of anti-CD11c magnetic beads and incubate in ice cold water (4- 8 °C) for 15 min.     Repeat steps C6-10.   Wash column with 10 ml of MACS buffer. Elute the column retentate containing enriched CD8αNeg DCs.   Pellet the cells and resuspend in 2 ml MACS buffer and pass them through a second MACS column to increase the purity if required.      Isolation of B cells from splenic cell suspension    Determine the cell number.   Add 200 µl MACS buffer containing 20 µg/ml Fc-gamma receptor blocking antibody (2.4G2), and 150 µl of anti-CD19 conjugated magnetic beads.   Mix thoroughly and incubate in ice cold water (4-8 °C) for 10 min.    Add 12 ml MACS buffer and pellet cells by centrifuging at 300 x g for 5 min.    Discard supernatant and resuspend the cell pellet 2 ml of MACS buffer.   Place a MACS column in the magnetic field of an appropriate MACS separator.    Equilibrate column by washing with 5 ml of MACS buffer.    Pipette the cell suspension gently in the middle of the column.    This is a positive selection, so the target cells will be retained in the MACS column. To elute the cells from the column, gently remove column from magnetic field, add 5 ml MACS buffer and purge the column firmly with a plunger to collect CD8αPos DCs.      Pulsing APCs with antigens and cell transfer   Count live cells after MACS enrichment procedure by trypan blue exclusion.    Plate cells in low-binding U-bottom 96 well plates at a density of 106 cells per well in 250 µl complete RPMI containing antigen of interest at desired concentration.",
    "Pulse the cells with antigen (typically at concentration of 100 nM, although this may vary depending on the particular antigen) for one hour in 37 °C incubator maintaining 5% CO2. Use of low binding plates allows for easier recovery of adherent cell populations.   Harvest cells by pipetting up and down 5 times with the wide-bore tips. Pool cells from multiple wells and transfer to 15 ml tube. Add complete RPMI medium to 10 ml and pellet the cells by centrifuging at 300 x g for 5 min. Wash twice with PBS.    Count the cells again and resuspend in PBS to a cell density of 107 cells/ml. Use these cells for injection into mice by the preferred route of administration."
  ],
  "subjectAreas": [
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}