{
  "id": 17480,
  "origin_website": "Jove",
  "title": "Culture and Imaging of Human Nasal Epithelial Organoids",
  "procedures": [
    "HNE samples were collected at the Children's of Alabama hospital. All procedures and methods described here have been approved by the IRB University of Alabama at Birmingham (UAB IRB #151030001). To facilitate the expansion and improve the function of human nasal epithelial cells (HNEs), the present culturing methods are adapted from the well-known air-liquid interface (ALI) culture method28,34. HNEs were initially collected by brush biopsy as previously described12,14, with the only difference being the use of a cytology brush. All sample processing steps and cell culture were performed in the biosafety cabinet.\n1. Cell culture and expansion of nasal epithelial cells\nAfter brushing, store the nasal biopsy sample in 8 mL of RPMI media in a 15 mL conical tube on ice and transfer it to the lab within 4 h (not more than 24 h).\nDissociate the nasal brush biopsy into 8 mL of RPMI media in a 15 mL conical tube by passing the cytology brush through a 1 mL large bore pipette tip (cut off the tip) several times until the brush is clear of tissue.\nCentrifuge the cells at 500 x g for 5 min at 4 °C, remove the supernatant, and then re-suspend the cell pellet in 3 mL of cell detachment solution (see Table of Materials) and incubate at room temperature for 16 min to digest.\nUse 5 mL of expansion media (Table 1) to wash the cells twice. Then, add cells to a T75 flask pre-seeded with irradiated and inactivated 3T3 fibroblasts22 (50%-60% confluence) to co-culture the cells and expand in the expansion media for 7-14 days (see Figure 1 for the appropriate colony). Before use, test the irradiated 3T3 fibroblasts to ensure they cannot proliferate, which will negatively influence the epithelial cell expansion.",
    "NOTE: Discard the cells if the nasal epithelial cell confluence does not reach 70% within 14 days.\nFor the cells derived from patients with CF, introduce four antibiotics (100 µg/mL of tobramycin, 2.5 µg/mL of amphotericin B, 100 µg/mL of ceftazidime, 100 µg/mL of vancomycin, see Table of Materials) into the expansion media for disinfection of the cells for the first 3 days of culture, and then replace the media with antibiotic-free expansion media changing the media every 2 days.\n\tNOTE: This limited use of antibiotics is intended to reduce culture loss due to bacterial colonization while encouraging proliferation after the additional antibiotics are removed. These antibiotics can be tailored to the patient's specific microbiology results, with sensitivities, if needed.\nHarvest HNEs from co-culture using the double trypsinization method22 once the cells reach approximately 80% confluence. This method ensures that the irradiated and inactivated 3T3 fibroblasts are removed from the flask, and they do not contaminate subsequent organoid seeding.\n\t\nWash the cells with 1x DPBS, and then add 1.5 mL of 0.05% trypsin-EDTA into the T75 flask for 4 min at 37 °C to remove the irradiated and inactivated 3T3 fibroblast from culture.\nRinse the T75 flask with 1x DPBS twice to thoroughly wash away any remaining 3T3 fibroblasts; add 1.5 mL of 0.05% trypsin-EDTA into the T75 flask for 10 min at 37 °C to detach HNEs.\nNeutralize the trypsin with soybean trypsin inhibitor (see Table of Materials) at a 1:1 ratio. Centrifuge the cells at 500 x g for 5 min, and then remove the supernatant. After washing the cells with 5 mL of expansion media once, the cells are ready for seeding to grow organoids.\n\t\t​NOTE: HNEs with a passage number of three are recommended to be used for further experiments.",
    "2. Growth and differentiation of organoids in slides and culture inserts\nThaw the organoid culture extracellular matrix (ECM) overnight at 4 °C. Cool pipette tips to 4 °C and 15-well angiogenesis slides (see Table of Materials) overnight at 4 °C.\n\tNOTE: ECM should be put at 4 °C the night before the cell harvesting needs to be done.\nCoat the slides with 5 µL of cold 100% ECM on ice (pipette 5 µL of cold 100% ECM with a cold pipette tip into each well of the 15-well slide), and then place them into a cell culture incubator at 37 °C for at least 30 min for consolidation.\nCount the HNEs harvested from co-culture using a hemocytometer and dilute the cells to 500 cells/µL in total number with 20% ECM diluted by differentiation media (Table 2) on ice. Then, seed 5 µL of the cold cell/ECM mixture into each well of the slides coated with ECM.\nImmediately transfer the slides into a culture incubator at 37 °C for 1 h to consolidate the cell/ECM mixture.\nFeed the cells in each well of the 15-well angiogenesis slides with 50 µL of differentiation media. Change the media every other day until the organoids are ready for further experiments.\n\tNOTE: Organoids can usually be visualized after 1-2 days. There are 20-90 organoids commonly formed in each well of the slides. The organoids can typically survive for 40-60 days in ECM with feeding every other day when kept in a humidified incubator at 37 °C.\nCulture the organoids in the culture inserts (see Table of Materials) for greater quantity for specific applications (such as sectioning for histology or immunofluorescence) as per the steps mentioned below.",
    "To grow organoids in the culture inserts, prepare the organoid culture ECM, pipette tips, and inserts as mentioned in steps 2.1-2.2. Coat the inserts with 100 µL of cold 100% ECM.\nSeed 60 µL of cell/ECM mixture (500 cells/µL with 20% ECM in differentiation media) on top of the ECM coating in the insert.\n\t\tNOTE: All the other steps for making organoids in the inserts are the same as those conducted in the slides, steps 2.4-2.5.\nAdd 600 µL of the differentiation media into the bottom part of the insert. Change the media every alternate day until the organoids are used for experiments, typically 2-3 weeks.\n3. Preparation and isolation of organoids for whole-mount immunofluorescence\nIsolation and fixation of organoids\n\t\nPre-treat 8-well glass-bottom chamber slides with cell adhesive (see Table of Materials) for 30 min following Reference35. After discarding the solution, air-dry the wells for 30 min.\nTo harvest the organoids, remove the media from the top of the ECM, and then add 50 µL of cold 1x PBS into each well of the 15-well slides on ice (1:1 with ECM volume).\nPipette up and down 3-5 times using 200 µL of the large-bore pipette tip, and then dispense the solution onto the center of a well of the 8-well chamber slides.\nImmediately remove excess liquid from the wells by a fine-tip pipette. Then, place the chamber slide into a 37 °C incubator for 40 min to enhance the organoid adhering to the glass bottom.\nAfter gently washing with 1x PBS twice, fix the organoids with 300 µL of 4% paraformaldehyde in each well for 30 min at room temperature (RT).\nWash twice with 1x PBS and store the organoids in 1x PBS at 4 °C for immunostaining for up to 2 weeks.\nImmunofluorescence staining",
    "To reduce auto-fluorescence, add 250 µL of 50 mM NH4Cl in 1x PBS into each well of the slides at RT for 30 min while gently shaking on a shaker at 20 rpm.\nAfter washing with 1x PBS twice, permeabilize the cells with 0.1% Triton X-100 for 30 min at RT while gently shaking at 20 rpm.\nAfter washing with 1x PBS twice, add 300 µL of blocking solution, including 5% BSA and 0.1% Triton X-100 in 1x PBS, into each well for 1 h at RT.\nFollowing washing, add primary antibody into the appropriate wells followed by secondary antibodies (see Table of Materials). Prepare primary and secondary antibody solutions in 2% BSA and 0.3% Triton X-100 in 1x PBS. Incubate all the primary antibodies at 4 °C for 2 days and all the secondary antibodies at 4 °C for 1 day.\n\t\tNOTE: The final concentrations are dependent on the protein desired for the experiment. Please check the stock concentration on the manufacturer's datasheet. Then, calculate the final concentrations based on the dilutions used in the Table of Materials.\nAfter incubation, wash the wells thoroughly with 1x PBS and add DAPI in 2% BSA and 0.3% Triton X-100 into each well for nuclear staining.\nImage the organoids using a confocal laser scanning microscope, with a 20-60x oil immersion objective (see Table of Materials). Use Z-stack mode to set the upper and lower bounds of the image and use the recommended optimal Z-step size determined by the confocal software.\n\t\t​NOTE: The following four confocal laser excitation wavelengths were used: 408.7 nm, 489.1 nm, 561.7 nm, and 637.9 nm.\n4. Preparation and isolation of organoids for histological sectioning",
    "To harvest the organoids for histological studies, remove the media from the culture and add 50 µL of cold 1x PBS into each well of the slides on ice.\nPipette up and down three to five times using a 200 µL large-bore pipette tip, combine all the solutions from the 15-well slide or culture inserts into a 15 mL conical tube on ice. Adjust the total solution volume in the tube to 10 mL by adding additional cold 1x PBS.\nCentrifuge the tube at 4 °C, 300 x g for 5 min; aspirate out the supernatant and add 60 µL of warm histogel (see Table of Materials) to mix with the organoid pellet using a 200 µL of the large-bore pipette tip.\nImmediately transfer the suspension into a histology mold. After the consolidation of the histogel at room temperature, put the mold block into 4% paraformaldehyde for fixation overnight at 4 °C.\nAfter embedding in paraffin, cut the histogel block into 5 µm cross-sections (for example, with a microtome), fix the sections onto glass slides, and stain using hematoxylin and eosin (H&E) or immunofluorescence-labeled antibodies. Take images using a bright-field microscope or inverted epi-fluorescence microscope (see Table of Materials).\n5. Imaging of live organoids\nNOTE: The following steps are carried out using an automated imaging system (see Table of Materials). Different imaging systems need to adapt these steps following their specific manufacturer's instructions. Regardless of the equipment utilized, imaging live organoids require a temperature-controlled and humidified environmental chamber with an accompanied CO2 gas controller.\nTo monitor the differentiation of organoids before performing a functional swelling assay36, capture the whole slide images manually with any bright-field microscope or with an automated imaging system, as detailed below.",
    "Turn on the power to the automated imaging system and the CO2/O2 gas controller and allow the system to complete the automated calibration (~30 min).\nAfter completion, set the imaging system temperature to 37 °C; add 15 mL of sterile water to the humidification reservoir, open the CO2 valves, close the lids, and let the imaging system pre-incubate for a minimum of 30 min before imaging.\nOpen the automated imaging software to set up a protocol for imaging and choose the location to save the raw experimental data.\n\t\tNOTE: An example protocol file (Supplementary File 1), specific to the imaging system, has been provided as a template for the automated imaging of organoids to monitor organoid differentiation.\nOnce the environmental settings are met, immediately transfer up to two 15-well slides with lids into the environmental chamber in the automated image system's slide holder insert (see Table of Materials).\nSelect the wells to be imaged and start imaging to complete imaging of the desired wells.\n\t\tNOTE: The basic recommended settings are: 4x and 10x air objective, bright-field channel, 2 x 2 montage for 4x objective to cover the whole well area, 4 x 4 montage for a 10x objective. Z-stack settings: three to six Z-stack slices, Z-step size = 50-100 µm, one to two slices below autofocus point, and three to five slices above.\nTo image live organoids for use in a forskolin-induced swelling (FIS) assay, use a microscope with an automated stage equipped with an environmentally controlled imaging chamber that allows temperature and CO2 control.\n\t\nBegin with steps 5.1.1-5.1.4, substitute the protocol file in step 5.1.3 with the one provided in the example protocol file (Supplementary File 2) containing settings specific for performing a FIS assay.",
    "Before each experiment, adjust the exposure settings by evaluating at least three wells for each slide (far left, middle, and far right). Apply the X and Y coordinate offsets to ensure that the objective will be in the center of the well for all the wells.\n\t\tNOTE: The basic recommended settings are: 4x air objective, Channel 1 = Bright Field, Channel 2 = DAPI, 2 x 2 montage (four image tiles). Z-stack settings: three to four Z-stack slices, Z-step size = 50-100 µm, one slice below autofocus point and two to three slices above. Image acquisition time: 8 h with 20 min intervals (Total reads = 25; Read 1 is T = 0).\nOnce all the settings are appropriately selected, choose the wells to image for both slides, or select all, and begin the run as per the equipment's instructions.\nAfter running, save the experiment, close the imaging software, and shut down the imaging system37.\n6. Baseline lumen measurements\nNOTE: This is done using manual imaging analysis software (see Table of Materials). A similar methodology can be followed using an open-source software38 or any software that can measure the area of a region on an image.\nIn the software, open the Automated Measurement Panel by right-clicking the bottom of the screen, select Measurement, and then Automated Measurement Results. The area of each region of interest (ROI) measured will appear there.\nOpen the organoid image in the software and select 5-10 organoids with visible lumens.\n\tNOTE: Lumens will be a circular area in the middle of the organoid that is visibly different in color than the rest of the organoid (Figure 2A).",
    "Using the polygon ROI measurement feature, hold right click on the image to open the menu and select Polygonal ROI to outline the full organoid to obtain the organoid's total surface area (TSA). Then using the same feature, outline the lumen area (LA) (Figure 2B).\nRepeat for the remaining organoids in the well and all the wells in the assay.\nExport the data to excel. Divide the LA by the TSA and average all the organoids from the sample to get the Baseline Lumen Ratio (BLR)11,13.\n\t​NOTE: Typically, ~87% of non-CF organoids will have a BLR over 0.6, and 97% will be over 0.5, while only 14% of CF organoids will have a BLR over 0.6, and 31% will be over 0.5.\n7. Pre-treatment and automated imaging of HNE organoids\nNOTE: All pre-treatment steps are carried out in a clean biosafety cabinet. Pre-setup the automated imaging system and the software for recording the assay before step 7.1. The incubation with DAPI is optional but is recommended as a fail-safe if the quality of bright field images is compromised. In this case, the DAPI channel (377 nm) can be analyzed instead.\nPre-incubate the organoids in a well of 15-well slides with 50 µL of differentiation media containing DAPI with or without 100 µM of CFTRinh-172 (see Table of Materials) in a 37 °C incubator for 1 h. While the organoids incubate, perform step 5.2.1 using a swelling assay custom protocol following Supplementary File 2.\nRemove the pre-incubation medium using a glass Pasteur pipette with aspiration. Add 10 µM of forskolin and 100 µM of IBMX (stimulation cocktails) (see Table of Materials) for a total volume of 50 µL differentiation media into each well.\n\tNOTE: Ensure no bubbles are introduced into the wells. Bubbles on the images will affect the automated analysis.",
    "Without delay, begin the FIS imaging protocol following step 5.2.2 to 5.2.4. Acquire images every 20 min in each well, with a total runtime of 8 h.\n8. Automated analysis of forskolin-induced swelling assay on HNE organoids\nOpen the automated imaging analysis software, find the experiment previously saved from step 7.3, and bring up the images of the experiment.\nChoose the vessel window to be evaluated and select the option containing the processed images that have been stitched and z-projected. This step should provide a picture of the entire well with all organoids within the imaging frame for masking assessment and measurements.\nChoose the well image to assess. Select Analyze. Repeat this process for other images to ensure appropriate masking for all images included in the automated measurements. Save the setting parameters.\nAfter completing the analyzing settings, apply the changes. The software will change the measurements based on the settings.\n\tNOTE: After the initial image pre-processing is complete, quality control (QC) measures should be performed to ensure consistent masking. These include manually reviewing all wells to ensure organoids are within the imaging frame, bubbles or debris are not inappropriately masked, and checking the masking in bright field and DAPI channels.\nExport the data for the summary analysis (including graphing and statistical analysis).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}