{
  "id": 8675,
  "origin_website": "Jove",
  "title": "Quantifying the Heterogeneous Distribution of a Synaptic Protein in the Mouse Brain Using Immunofluorescence",
  "procedures": [
    "This protocol does not involve experiments on live animals. Experiments involving euthanizing of animals to obtain brain samples were approved by the local animal protection authorities (Tierschutzkommission der Universitätsmedizin Göttingen) under the approval number T 10/30.\nNOTE: For this protocol, 3 adult male C57BL/6 mice were used.\n1. Sample Preparation\nPrepare fixative and 0.1 M phosphate buffer (PB; see Table 1).\nFix the animal by transcardial perfusion as described in Gage et al.28. First wash out the blood with 0.9% NaCl-solution, then perfuse with 30 mL of 4% paraformaldehyde (PFA).\nOpen the skull with scissors and carefully isolate the brain using a spoon with blunt edges to avoid damaging the tissue.\nFill a 50 mL reaction tube with fixative and postfix the brain in 4% PFA at 4 °C overnight.\nRemove the fixative and wash the brain in 50 mL of 0.1 M PB on a shaker for 30 min.\nAfter washing, incubate the brain in a 50 mL reaction tube in 30% sucrose in 0.1 M PB for 48 h or until it sinks in the tube at 4 °C for cryoprotection.\nTrim the cryoprotected brain with a sharp blade, place it in a cryomold, and embed it with optimal cutting temperature (OCT) compound. Avoid bubbles. Orient the brain and freeze the cryomold in the -80 °C freezer.\nMount the frozen tissue for sectioning. Equilibrate the tissue to the cryomicrotome temperature for at least 15 min before sectioning.\nSection the brain into 25 µm thick coronal slices. Touch the OCT carefully with a glass hook without touching the brain tissue. Collect 3 adjacent slices per well in a 24 well plate and store them in 0.1 M PB at 4 °C until staining.",
    "NOTE: The protocol can be paused here for up to two weeks. Longer storage times can interfere with the tissue quality and thus influence the outcome of the experiment.\n2. Immunofluorescence\nPrepare solutions including the blocking buffer, antibody buffer, washing buffer 1, and washing buffer 2 (see Table 1).\nRinse slices once with PB to remove excess OCT.\n\t\nRemove the solution with a plastic pipette without sucking in the brain slices. Add 250 µL of fresh PB with a 1000 µL pipette.\n\t\tCAUTION: Slices should not dry out, so remove and add fluids well by well.\nRemove the PB with a plastic pipette and add 250 µL of blocking buffer per well with a 1000 µL pipette. Incubate for 3 h at room temperature (RT) on the shaker.\nDuring the incubation time, dilute the primary antibodies in antibody buffer in a reaction tube. Use 250 µL antibody buffer per well and add the appropriate amount of antibody (see Table 2) by pipetting it directly into the solution using a 2 µL pipette. Mix the solution by gently pipetting up and down several times. Vortex shortly afterwards to ensure proper mixing.\n\tNOTE: To determine the background fluorescence, stainings should also be performed without adding the primary antibody. For that, incubate the slice in antibody solution without primary antibodies according to the protocol.\nAfter the incubation time, remove the blocking buffer with a plastic pipette and add 250 µL of antibody solution containing primary antibodies per well. Incubate slices with primary antibody overnight at 4 °C on a shaker.\nNext day, wash the slices with washing buffer 1 3x for 10 min at RT on a shaker.",
    "Remove the medium with a plastic pipette and add 300 µL of washing buffer 1 per well. Incubate at RT for 10 min. Repeat 3 times.\nDuring the washing steps, dilute the fluorophore-coupled secondary antibodies in antibody buffer in a reaction tube. Use 250 µL antibody buffer per well and add the appropriate amount of antibody (see Table 2) by pipetting it directly into the solution using a 2 µL pipette. Mix the solution by gently pipetting up and down several times. Vortex shortly afterwards to ensure proper mixing.\n\tCAUTION: Because the antibodies are light-sensitive, all steps from this point on need to be performed in the dark.\nAfter the washing steps, remove the washing buffer with a plastic pipette and add 250 µL of antibody solution containing secondary antibodies per well. Incubate the slices with secondary antibody for 90 min at RT in the dark.\nWash the slices with washing buffer 2 3x for 10 min at RT.\nDuring the washing steps, dilute 4′,6-diamidino-2-phenylindole (DAPI) in 0.1 M PB in a concentration of 1:2000.\nRemove the washing buffer 2 with a plastic pipette and add 250 µL of DAPI solution per well. Incubate for 5 min at RT on the shaker.\nRemove the DAPI solution with a plastic pipette and add 500 µL of 0.1 M PB per well with a 1000 µL pipette.\nMount slices on microscope slides.\n\t\nPlace a microscope slide under the stereoscope. With a fine brush, add three separate drops of 0.1 M PB onto the slide. Place one slice per drop onto the microscope slide.\nUse the fine brush to flatten and orient the slices on the microscope slide.\nWhen all slices are positioned correctly, remove excess PB with a tissue and dry the slide carefully.\n\t\tCAUTION: Avoid drying the brain slices completely.",
    "Add 80 µL of embedding medium onto the slide. Carefully lower the coverslip onto the slide, thereby embedding the brain slices.\nLeave the slides to dry in the fume hood for 1-2 h (cover them to avoid light exposure) and store them in a microscope slide box at 4 °C.\n\t\tNOTE: The protocol can be paused here.\n3. Imaging\nAfter the embedding medium is completely hardened, place the microscope slide under the confocal microscope.\n\tNOTE: Epifluorescence microscopy combined with deconvolution software should yield similar image quality.\nAdjust the laser settings by increasing or decreasing the laser intensity for every channel so that few pixels are overexposed to ensure maximum distribution of grey values.\nAcquire virtual tissues of the whole brain slice for the different channels.\n\t\nIn the imaging software (see Table of Materials), select the Tiles option and manually delineate the brain slice with the Tile Region Setup.\nDistribute support points throughout the tile region and adjust the focus for the different support points by pressing Verify Tile Regions/Positions….\nAdjust the settings in Acquisition Mode according to the desired resolution and file size of the resulting image and start the scan.\nWhen the scan is finished, use the Stitching function to process the virtual tissue. Export the file as a .tif with the function Image Export.\n4. Computer-based Analysis\nLoad all single channels for one image into FIJI29 by clicking File| Open.\nWith the Freehand selection tool, delineate one hemisphere in the DAPI-channel. Create a mask of the selection by clicking Edit| Selection| Create mask.\nDetermine the mean fluorescence intensity for the single channels (Mover and synaptophysin) by clicking Analyze| Measure.\n\tNOTE: Make sure to select the different channels to determine the mean fluorescence intensity values for each channel.",
    "Copy the mean fluorescence intensity for the single channels into a spreadsheet.\nDetermine the mean fluorescence intensity for the single channels in an area of interest by delineating the area also with the Freehand selection tool. Use a mouse brain atlas as reference.\nRepeat steps 4.1-4.5 for all hemispheres and all areas of interest.\n\tNOTE: Determine the values for each hemisphere separately in order to later compare the values in an area of interest to that in the hemisphere (see step 5.2).\n5. Data Handling\nIn case the background fluorescence is high (see Discussion), a background subtraction might be needed. For that, determine the mean fluorescence intensity for the slice processed without primary antibody against the reference protein (here: synaptophysin) and subtract that value from all values obtained for the brain regions and hemispheres.\nWhen the mean fluorescence intensities for the single channels for every hemisphere and every area of interest have been determined (see Table 3), calculate the ratio of Mover to synaptophysin by dividing the value for Mover by the value for synaptophysin (yellow in Table 3). Perform this action for every hemisphere and every area of interest separately.\nDivide the ratio obtained for one area of interest by the ratio obtained for the corresponding hemisphere (orange in Table 3) to determine the ratio of the area of interest to the hemisphere.\nTo determine the relative Mover abundance, translate the ratio obtained in 5.2 into a percentage by determining its deviation from 1 (red in Table 3). A ratio of 1.25 would therefore give a relative Mover abundance of 25% above average, and a ratio of 0.75 would yield a relative Mover abundance of 25% below average.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}