{
  "id": 10998,
  "origin_website": "Jove",
  "title": "High-resolution Spatiotemporal Analysis of Receptor Dynamics by Single-molecule Fluorescence Microscopy",
  "procedures": [
    "1. Sample Preparation\nCoverslip cleaning\nNOTE: Work under a fume hood.\n\t\nUse clean tweezers to place glass coverslips (24 mm diameter) into a coverslip holder that separates individual coverslips.\nPut the holder with coverslips into a beaker, and add chloroform until the coverslips are covered. Cover the beaker with aluminum foil to reduce evaporation and sonicate in a bath sonicator for 1 hr at RT. Take the coverslip holder out of the beaker and let the coverslips dry.\nRepeat step 1.1.2 with 5M NaOH solution instead of chloroform.\nTake the coverslip holder into a new beaker and wash three times with distilled water. Put cleaned coverslips in a glass cell culture plate filled with 100% ethanol.\nPreparation of calibration samples\n\t\nDissolve fluorescent dye in appropriate solvent.\nPrepare a 1:10 serial dilution of the fluorescent dye ranging from 1 pM to 1 nM in filter sterilized (0.22 µm) water.\nTake cleaned coverslips stored in 100% ethanol and wash with filter-sterilized water. Spot 20 µl of each fluorescent dye dilution on a separate cleaned coverslip. Let the coverslips dry under a sterile hood. Protect the coverslips from light and dust until use. Use these samples to estimate the intensity of single fluorescent molecules (see step 3).\nTransfection\n\t\nCulture CHO cells in 1:1 Dulbecco's modified Eagle medium/nutrient mixture F-12 (DMEM/F12) supplemented with 10% fetal bovine serum (FBS), 100 U/ml penicillin and 100 µg/ml streptomycin at 37 °C, in 5% CO2. NOTE: Use phenol-red free media throughout the experiment to minimize autofluorescence.\nTake cleaned coverslips from 100% ethanol solution, wash them with sterile phosphate-buffered saline (PBS), and place one coverslip into each well of a 6 well cell culture plate.",
    "Trypsinize, count and seed CHO cells at a density of 3 x 105 cells/well in the 6-well cell culture plate containing the coverslips. Let the cells grow in an incubator (37 °C, 5% CO2) for 24 hr in order to achieve approx. 80% confluency, which is the optimal cell density for transfection.\nFor each well, dilute 2 µg of the desired plasmid DNA (e.g., SNAP-tagged β2-adrenergic receptor) and 6 µl Lipofectamine 2000 in two separate tubes containing 500 µl OptiMem medium. Incubate at RT for 5 min.\nCombine the solutions from step 1.3.4 into one tube and mix to obtain a transfection mixture. Incubate the transfection mixture at RT for 20 min.\nDuring the incubation (1.3.5), take the CHO cells and wash twice with pre-warmed (37 °C) PBS. Replace PBS with 1 ml/well of phenol red-free DMEM/F12 medium supplemented with 10% FBS but no antibiotics.\nAdd the entire transfection mixture (1 ml) from step 1.3.5 dropwise to each well, and gently rock the plate back and forth to ensure complete mixing.\nIncubate for 2 to 4 hr at 37 °C, in 5% CO2 and proceed immediately afterwards to the next step. NOTE: These transfection conditions have been optimized to achieve receptor densities <0.45 particle/µm2, which are suitable for single-molecule imaging. Adjustments might be required when using different cells, constructs or reagents.\nProtein labeling\n\t\nDilute 1 µl of fluorophore-BG stock solution in 1 ml DMEM/F12 medium supplemented with 10% FBS to obtain a final concentration of 1 µM. Take the transfected cells from the incubator and wash twice with prewarmed (37 °C) PBS. Replace PBS with 1 ml of 1 µM fluorophore-BG solution and incubate for 20 min at 37 °C 5% CO2 in an incubator.",
    "After the incubation, wash the cells three times with DMEM/F12 medium supplemented with 10% FBS, each time followed by 5 min incubation at 37 °C. Take a coverslip (with labeled cells) with tweezers and place it into an imaging chamber.\nWash twice with 300 µl imaging buffer. Add 300 µl of fresh imaging buffer and proceed immediately to imaging (Part 2).\n2. Image Acquisition\nNOTE: Use a total internal reflection fluorescence (TIRF) microscope, equipped with an oil-immersion high numerical aperture objective (e.g., 100X magnification/1.46 numerical aperture), suitable lasers (e.g., 405 nm, 488 nm, 561 nm and 645 nm diode lasers), an electron multiplying charge coupled device (EMCCD) camera, an incubator and a temperature control to visualize single fluorescent molecules.\nSet the desired microscope parameters, i.e., laser line, TIRF angle (this parameter controls the penetration depth of the evanescent field), exposure time, frame rate and number of images per movie10. Keep the heater/incubator and temperature control always on to avoid temperature drifts and moisture condensation.\nPut a drop of immersion oil on the 100X objective of the microscope. Place the imaging chamber with the labeled cells onto the specimen holder of the microscope, and bring the cells in focus using brightfield illumination.\nSwitch to TIRF illumination. Keep laser power as low as possible to allow searching for the desired cell but at the same time minimizing photobleaching.\nSelect the desired cell and fine adjust the focus. Set the laser power to a level that allows visualization of single fluorophores. Acquire image sequence and save raw image sequence file as .tiff.\n3. Calibration (Single Fluorophores on Glass and Monomeric/dimeric Receptor Controls)",
    "Assemble each calibration sample prepared as described in 1.2 in the imaging chamber. Place each sample on the microscope and choose the sample containing well-separated diffraction-limited spots that bleach in a single step. NOTE: These spots represent single molecules of the fluorescent dye.\nAcquire TIRF image sequences as described in step 2. Important: the same imaging parameters must be used for all experiments, including the ones for calibration.\nPerform the detection and tracking analysis as detailed in 4.1 - 4.2. Extract the intensity of each particle as described in 4.2.6. From these data, calculate the mean (µ) and standard deviation (σ) of the intensity of single fluorophores.\nOptional: perform the same analysis on cells transfected with a monomeric cell-surface receptor (e.g., CD86), N-terminally tagged with either one or two copies of SNAP10 and labeled with the fluorophore-BG derivative. Follow the procedure described above for the single fluorophore on glass. Estimate the labeling efficiency as described in Calebiro, D. et al.10\n4. Image Analysis\nImage sequence preparation\n\t\nUse an image processing software (e.g., ImageJ) to crop the images.\nSave individual frames as separate .tiff images in a new folder, indicating on each image the frame number.\nMeasure the cell surface area by drawing a region of interest (ROI) along the contour of a cell and using the measure tool in ImageJ or a similar tool in another software. Use this value to calculate particle density by dividing the total number of particles at the beginning of the movie by the cell surface area.\nParticle detection and tracking\nNOTE: Use noncommercial software such as u-track13, working in Matlab environment, to automatically detect and track single receptor particles.",
    "NOTE: The u-track algorithm is based on the multiple-hypothesis tracking approach. This approach links particles between frames by building cost matrices, where the individual probabilities that a given particle in one frame corresponds to a given particle in the next frame, appears, disappears or merges/splits with/from other particles are assigned. The solution that globally minimizes the costs, i.e., the one with the highest probability, is finally selected. This also allows tracking a temporarily disappearing particle, a typical phenomenon caused by fluorophore blinking. The latest version of u-track (2.1.0) has graphic user interfaces that facilitate the execution of these analyses.\n\t\nFrom the Matlab command prompt, type “movieSelectorGUI” to open the movie selection interface. Follow the instructions to create a new movie database starting from the previously saved separate images (see 4.1.2).\nProvide the pixel size in nm, time interval in seconds, numerical aperture, camera bit depth and emission wavelength of the fluorophore, required for particle detection and tracking. Save the movie database.\nFrom the movie selection interface, run the analysis, choosing “single-particles” as type of objects. A new window will appear where the parameters used for particle detection and tracking can be defined. Begin with the default parameters. Later, adjust these parameters if the quality of the detection and/or tracking is not satisfactory (e.g., some particles are not detected or tracks are fragmented). Optional: under the tracking settings, check “Export tracking results to matrix format” to store the coordinates and amplitudes of all particles in a single matrix (field called “trackedFeaturedInfo”). For a detailed description of these parameters, refer to the u-track documentation.",
    "Run the detection algorithm. This algorithm automatically determine the location and intensity above background of each diffraction-limited spot (i.e., single receptors/receptor complexes) by fitting a two-dimensional Gaussian function with standard deviation equal to the point spread function of the microscope around local intensity maxima. Then, run the tracking algorithm. Store the results of the analyses in a .mat file.\nUse the “movieViewer” routine, contained in the u-track package, or similar custom ones to visualize the tracks and check the quality of the detection and tracking.\nOpen the .mat file to see the position and amplitude (i.e., intensity) of the tracked particles at each frame. Data generated in step 4.2.4 are contained in the tracksCoordAmpCG field of the tracksFinal array and/or in trackedFeaturedInfo. From the total number of particles detected calculate the particle density dividing this value by the cell surface area measured at 4.1.3.\nOptional: Use the particle coordinates over time (see 4.2.6) to analyze the motion of the receptor particles. Calculate the mean square displacements (MSD) and diffusion coefficients (D) using Matlab or similar software. For each particle and every time interval (Δt) considered, calculate the mean square displacement (MSD) using the following formula:\nimgsrc://cloudfront.jove.com/files/ftp_upload/51784/51784eq1.jpg\n\t\twhere Δt is the time interval in frames, N is the number of steps analyzed, x and y are the particle’s x and y coordinates at the frame indicated by the index. Use the MSD over time plots to evaluate the type of motion of a given particle: Linear relationships indicate free diffusion (i.e., Brownian motion), a positive curvature (i.e., the curve looks like a parabola) suggests directed motion, a negative curvature is indicative of confined motion14. In case of freely diffusing particles, calculate the diffusion coefficient (D) of each particle by fitting the obtained MSD data with the following equation:\nimgsrc://cloudfront.jove.com/files/ftp_upload/51784/51784eq2.jpg",
    "Calculation of particle size with Gaussian fitting method\nNOTE: Once the intensity distribution of calibration samples (single fluorophores on glass and/or fluorescently labeled monomeric receptors) is known, perform a mixed Gaussian fit on the distribution of particle intensities at the beginning of an image sequence to determine the size of receptor complexes (i.e., the number of receptors per particle)10. Perform these analyses using Matlab or similar software.\n\t\nCalculate the intensity of each particle by averaging the intensity of the particle from the first frame to the frame before the first change in intensity occurred (in most cases a decrease due to photobleaching).\nPerform a mixed Gaussian fitting according the following equation:\nimgsrc://cloudfront.jove.com/files/ftp_upload/51784/51784eq3.jpg\n\t\twhere φ(i) is the frequency of particles having intensity i, n is the component number, αn is a parameter that contributes to the height of component n, μ and σ are the mean and standard deviation of the intensity of reference single fluorophores (calculated as described in step 3). NOTE: Determine the maximal number of components (nmax) for each image sequence by progressively increasing nmax until the addition of a component does no longer produce a statistically better fitting, as judged by an F-test.\nOptional: Perform a mixed Gaussian fit on the intensity distribution obtained on the last frames of the movie (e.g., the last 60 frames of a 400 frame sequence). Replace μ and σ with the values obtained after this fitting, which provide refined estimates for those parameters, and repeat step 4.3.2.\nCalculate the area under the curve (AUC) of each component of the mixed Gaussian fit. Calculate the relative abundance of receptor particles of different size (i.e., monomer, dimer, trimer, etc.) by dividing the AUC value of each component by the AUC of the entire distribution.",
    "Optional: Use data from different cells and the corresponding particle densities (calculated as described in 4.2.6) to generate plots where the distribution of particles with different size is correlated with particle density10.\nCalculation of particle size with step fitting method\nNOTE: Use a step-fitting analysis as an alternative method to determine the size of receptor complexes10. The basis for this analysis is that the light-induced destruction (photobleaching) of a single fluorophore results in its instantaneous disappearance – thus particles containing n fluorophores are expected to progressively bleach producing an intensity profile with n steps.\n\t\nExtract intensity profiles of each particle from the .mat file generated by u-track or similar detection/tracking software (see 4.2.6).\nUse a step-fitting algorithm, such as the one presented in ref. 10, to count the number of bleaching steps for each particle.\nOptional: use the results to generate distributions showing the relative abundance of receptor particles of different size and correlate them with particle density as previously described for the results of the mixed Gaussian fitting (see 4.3).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}