{
  "id": 9855,
  "origin_website": "Jove",
  "title": "Low-stress Route Learning Using the Lashley III Maze in Mice",
  "procedures": [
    "1. Preparation:\nThe Lashley III maze is constructed of Plexiglas and is shown in Figure 1. The start box, maze arms, and goal box are modular to allow for cleaning and modifiability of the maze. The walls of the start box, maze arms, and goal box are constructed of black Plexiglas to eliminate visual cues from outside and inside the maze. Maze arms are 45 cm long, 7 cm high, and 5 cm wide. Doors leading to consecutive arms of the maze are 4 cm x 4 cm and are situated 11 cm from the outer walls of the maze. The goal box is 19.5 cm long x 7 cm high x 5 cm wide. The start box is 8 cm x 9.5 cm x 7 cm. Separate clear Plexiglas pieces are placed on top of the start box, maze, and goal box to allow visualization of each mouse as it progresses through the maze while preventing mice from escaping. The maze rests on a base constructed of red Plexiglas that is large enough to hold the three pieces of the maze plus a pseudo-home cage that is the same size as the animal's standard home cage.",
    "To prepare pseudo-home cages prior to the first maze trial, fresh bedding material of the same kind as that used in the animals'  home cages is added to individual cage bottoms having doorways (2 cm x 2 cm) cut into the sides. Place wire tops on these cage bottoms and individually number them, one for each animal in a testing cohort. These cages will serve as individual pseudo-home cages for each animal for the duration of the testing timeframe. Because we are investigating the roles of stress and/or anxiety-related behaviors in learning and memory, we use pseudo-home cages to avoid individually housing mice in their home cages. However, if these factors are not of primary concern, animals can be singly housed in home cages modified with doorways and these cages can serve as the home cages for successful maze navigation.\n2. Testing:\nEach day, animals are moved to the behavior testing room a minimum of one hour before testing to allow them to acclimate to the testing environment. \nThirty min before the testing start time, food and water is removed from all home cages. Keep the food and water in the behavior testing room but out of reach of the mice. Food and water is typically removed 30 min after the change from the light phase to the dark phase, after peak feeding has occurred. This ensures that animals are mostly food- and water -satiated prior to testing; however, testing during this period provides a small additional motivating force to navigate the maze even though there is no overt food or water reward upon task completion.",
    "After the 30 min pretest period has elapsed, clean the maze with 70% ethanol. Leave the door leading from the start box into the maze arms closed. The doors at both ends of the goal box are left open.\nPlace the pseudo-home cage corresponding to the first animal at the end of the goal box.\nCarry the first mouse to the maze, cupping it in your hand. Put the mouse in the start box and replace the lid.\nWhen in position to observe the maze without obstruction, open the start box door and immediately start three stopwatches.\nWhen all four paws of the mouse have left the start box, close the start box door and stop the first timer.\nRecord by hand the pathway the mouse travels as it navigates the maze. A mouse enters a new zone or arm of the maze when all four paws have crossed into that area (See Fig. 1).\nWhen all four paws enter the goal box, close the door leading between the maze and the goal box and stop the second stopwatch.\nWhen the mouse has completely entered the pseudo-home cage, close the door between the goal box and the cage. Stop the third stopwatch.",
    "Record the times from the three stopwatches. Count the number of errors the mouse has made. An error is defined as an entry into a dead-end cul-de-sac zone (e.g., going from arm L to zone K; Fig. 1) or travelling back through an already-travelled arm of the maze (e.g., going from arm F to arm C; Fig. 1). While we score mouse performance as it is occurring, it is possible to videotape or otherwise record maze trials to allow for subsequent scoring either by eye or by automated software. Experimenter discretion should be used to choose an appropriate method.\nLeave the animal in the pseudo-home cage for 1 min before returning it to its home cage.\nRepeat steps 2.3 to 2.12 for all mice in the testing cohort.\nWhen the last mouse in the cohort has been returned to its home cage, start the 30 min timer. At the end of this 30 min period, return food and water to all mice in the cohort and then return the animals to their colony room.\nRepeat this procedure on consecutive nights, with one trial per testing day per animal, until all mice in the cohort have reached a defined learning criteria or until a predetermined number of test trials has occurred. A mouse is classified as having learned the maze when it can perform the task with 0 or 1 error(s) on two consecutive trials. Mice are tested in the same order on successive trials.\n3. Representative Results:",
    "Days to learn (reach criterion) can be analyzed and compared between different groups in a particular study (Figs. 2A and 3A). Additionally, a learning index (learning ratio), which characterizes maze acquisition, can be evaluated over the first four days of the testing period (Figs. 2B and 3B). The learning index is the ratio of the number of correct path segments travelled to the total number of path segments travelled for each trial. The average learning index should be approximately 0.5 for trial 1, when mice are first exposed to the maze and navigating by chance. The learning index increases and approaches 1 between trials 2 and 4 indicating that learning is occurring. In Figure 2, young (2 mo) and aging (24 mo) male C57Bl/6NCr mice were trained on the Lashley maze for up to 15 trials. The young mice learned the maze in 7.2 (± 1.5) d. By contrast, the aging animals took 11.7 (± 2.1) d to reach criterion. There was a strong trend for aging C57Bl/6NCr mice to take longer to learn the maze ([t(23)=1.59, P=0.056]; one-tailed t-test, a priori hypothesis that days to learn is longer in aging mice). When the learning index is calculated, both age groups show a steady increase in the learning index from trials 2 through 4 (significant main effect of time P<0.001). However, there were no statistically significant differences in the learning index between young C57 mice and old C57 mice (main effect of age P=0.58).",
    "Figure 3 is representative of studies examining the effects of background strain on learning behavior. Data from the young male C57Bl/6NCr shown in Fig. 2 are now compared to data from young Crl:CD-1(ICR)BR mice [CD-1, 4-5 mo]. CD-1 mice learned the Lashley III maze in 4.5 (± 1.4) d; however, there was no significant difference between the strains in days to learn (Fig. 3A; [t(18)=1.328, P=0.20]; two-tailed t-test). By contrast, examination of the learning index shows that, while all animals were navigating the maze on the first trial by chance, CD-1 mice learned the task more quickly (main effect of strain P<0.001). This is illustrated by the statistically significant increase in the learning index in trials 2 through 4 in CD-1 mice compared to C57Bl/6NCr mice. Interestingly, if CD-1 mice continue to be trained in the maze beyond the point of reaching criterion, they exhibit behavior indicative of overtraining (Fig. 4) which is discussed in more detail below.\nimgsrc://cloudfront.jove.com/files/ftp_upload/1786/1786fig1.jpgFigure 1: The Lashley III maze. The dead-end cul-de-sac zones of the maze are colored red in this diagram for illustrative purposes only. The base and arms of the actual maze are solid colors (inset). The maze is drawn to scale (dimensions in text).",
    "imgsrc://cloudfront.jove.com/files/ftp_upload/1786/1786fig2.jpgFigure 2: Lashley III maze performance in 2 and 24 month-old male C57Bl/6NCr mice. The Lashley III maze was used to assess route learning in young (2 mo) and aging (24 mo) male C57Bl/6NCr mice. The parameters measured were (a) days to criterion, the number of days required for a mouse to run the maze for two consecutive nights with 0 errors or 1 error; and (b) learning index, the number of correct four-paw arm entries made versus the total number of arm entries made on days 1-4 of Lashley III maze testing. Numbers of animals per group were n=10 for 2 month-old and n=15 for 24 month-old mice. \nimgsrc://cloudfront.jove.com/files/ftp_upload/1786/1786fig3.jpgFigure 3: Lashley III maze performance in young male C57Bl/6NCr and CD-1 mice. The Lashley III maze was used to assess route learning in 2 month-old C57Bl/6NCr and 4-5 month-old CD-1 mice . The parameters measured were (a) days to criterion, the number of days required for a mouse to run the maze for two consecutive nights with 0 errors or 1 error; and (b) learning index, the number of correct four-paw arm entries made versus the total number of arm entries made on days 1-4 of Lashley III maze testing. Numbers of animals per group were n=10 for C57Bl/6NCr and n=10 for CD-1 mice. Statistical significances: *P<0.05, **P<0.01 versus C57Bl/6NCr mice.",
    "imgsrc://cloudfront.jove.com/files/ftp_upload/1786/1786fig4.jpgFigure 4: Lashley III maze performance in 4-5 month-old male CD-1 mice. The Lashley III maze was used to assess route learning in ten 4-5 month-old male CD-1 mice on 15 consecutive days. The parameters measured were (a) number of errors made per day, with an error defined as a four-paw entry into a dead-end cul-de-sac zone or travelling an already-travelled arm of the maze; and (b) time spent in the maze per day. The day at which criterion was reached is indicated with a red arrow.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}