{
  "id": 12177,
  "origin_website": "Jove",
  "title": "Bouncing Ball with a Uniformly Varying Velocity in a Metronome Synchronization Task",
  "procedures": [
    "This protocol was approved by the Institutional Review Board of Psychology Department of Sun Yat-Sen University.\nNOTE: A custom program \"BouncingBall\"9 is provided for accomplishing this protocol. Extracting the file \"BouncingBall.zip\" generates a directory \"BouncingBall\", which contains auditory and visual stimuli files (see Section 1 below), a script \"BouncingBall_run.m\" for programming of stimulus presentation and response recording (see Section 2 below) and presenting stimuli and recording responses (see Section 3 below), and a script \"BouncingBall_analyze.m\" for programming of data analyses (see Section 4 below) and performing data analyses (see Section 5 below).\n1. Preparation of Auditory and Visual Stimuli\nNOTE: The \"BouncingBall\" directory contains generated stimuli. Readers can use or modify the stimuli as required.\nUse software in which auditory tones can be generated, to create a pure tone of 600 Hz and 50 ms duration.\nUse software in which visual images can be generated, to create an image of an orange ball with a transparent background.\nUse a smartphone with a camera to take a picture of an orange basketball, and use software in which visual images can be generated, to create an image of the basketball with a black background.\n2. Programming of Stimulus Presentation and Response Recording\nNOTE: The programming of stimulus presentation and response recording is already implemented in the script \"BouncingBall_run.m\" in the directory \"BouncingBall\", which can be opened and edited using a text edit software. Readers can set up or modify the settings as required, following the comments in the script.\nSet up the background color as black.\nSet up each sequence to have 55 events (54 IOIs). For practice (see below), set up the event number as 20.\nSet up each sequence to be repeated 6 times. For practice, set up the repetition number as 2.",
    "Setup the IOI to be 600 ms or 900 ms.\nConstruct the AT sequence.\nPresent the pure tone every IOI.\nPermanently display an orange ball of 1.74 cm in diameter (subtended a visual angle of 1.66°) and a white bar of 3.54 cm x 4.06 cm. Present the ball at the center of the computer screen and display the bar 0.92 cm below the bottom edge of the ball.\n\t\tNOTE: The orange ball and the bar are presented to keep visual settings as consistent as possible between the AT sequence and the visual sequences, and to keep the subject fixating on the ball and maintaining attention on the auditory task.\nConstruct the VF sequence.\nHave the orange ball flash every IOI, i.e., it lasts for 50 ms and disappears for the remaining IOI time.\nConstruct the VB sequence.\nReplace the orange ball with the realistic orange basketball.\nLet the ball continually move 0.92 cm (movement distance) down and touch the white bar, and then move up to the initial position.\n\t\tNOTE: The velocity of the ball is uniformly varied with a constant acceleration. The acceleration is 0.20 m/s2 for the 600-ms IOI or 0.09 m/s2 for the 900-ms IOI. The ball reaches its peak velocity when touching the bar. Use different accelerations for different IOIs.\nRecord and save the time when the subject presses the responding key on a computer keyboard.\n3. Experimental Procedure\nNOTE: Presenting stimuli and recording responses are accomplished by typing \"BouncingBall_run(SequenceType, IOI, ScreenX, ScreenY, isFormal)\" in the command window of the software. \"ScreenX\" and \"ScreenY\" refer to the width and height of the computer screen in cm, respectively. The tapping data are automatically recorded in the file \"SequenceType_IOI_ScreenX_ScreenY.mat\" by the program. IsFormal refers to whether the experiment is the formal experiment or the practice.",
    "Ask the subject to sit in front of a computer screen with a 60-cm viewing distance and wear a headset.\nGive the subject the written informed consent form to sign.\nGive the subject the written experiment instructions.\nIn the instructions, explain the metronome synchronization task to the subject: tap (on a keyboard key using their index finger of their preferred hand) in synchrony with the tones in the AT sequence, the flashing balls in the VF sequence, and the moments when the bouncing ball moves to the lowest position (i.e., touches the bar) in the VB sequence.\nOpen the software.\n\tNOTE: The software continuously runs and its command window stays open. Typing the Bouncingball_run command in the command window will run the stimulus presentation and return to the command window when the stimulus presentation is finished.\nAsk the subject to practice with the 600 ms IOI AT, VF, and VB sequences twice to become familiar with the stimuli and task.\n\tNOTE: The practice was the same as the below formal experiment except: (1) The order of the three sequence types is not changed across the subjects; (2) Each sequence is repeated 2 times; and (3) Each sequence has 20 events.\n\t\nType \"Bouncingball_run('AT', 600, 53.1, 29.8, 0)\" in the command window and then press the 'Enter' key, to perform the practice of the AT sequence.\n\t\tNOTE: The screen size was 53.1 cm x 29.8 cm in Gan et al.4, but the readers should assign the size according to the screen that they use. When the experiment program is running, the subject is performing the task described in the experiment instructions. In addition, the sequence presentation is self-paced, i.e., the subject presses the space bar to start a sequence.",
    "Type \"Bouncingball_run('VF', 600, 53.1, 29.8, 0)\" in the command window and then press the 'Enter' key, to perform the practice of the VF sequence.\nType \"Bouncingball_run('VB', 600, 53.1, 29.8, 0)\" in the command window and then press the 'Enter' key, to perform the practice of the VB sequence.\nAsk the subject to conduct the experiment. Counterbalance the orders of IOI types and sequence types among subjects.\n\tNOTE: Below is the procedure for one subject.\n\t\nType \"Bouncingball_run('AT', 600, 53.1, 29.8, 1)\" in the command window and then press the 'Enter' key, to perform the 600-ms IOI AT sequence.\n\t\t\nNote that the subject will tap on a keyboard key using the index finger in synchrony with the tones in the AT sequence.\nType \"Bouncingball_run('VF', 600, 53.1, 29.8, 1)\" in the command window and then press the 'Enter' key, to perform the 600-ms IOI VF sequence.\n\t\t\nNote that the subject will tap on a keyboard key using the index finger in synchrony with the flashing balls.\nType \"Bouncingball_run('VB', 600, 53.1, 29.8, 1)\" in the command window and then press the 'Enter' key, to perform the 600-ms IOI VB sequence.\n\t\t\nNote that the subject will tap on a keyboard key using the index finger in synchrony with the moments when the bouncing ball moves to the lowest position (i.e., touches the bar).\nType \"Bouncingball_run('AT', 900, 53.1, 29.8, 1)\" in the command window and then press the 'Enter' key, to perform the 900-ms IOI AT sequence.\n\t\t\nNote that the subject will tap on a keyboard key using the index finger in synchrony with the tones in the AT sequence.\nType \"Bouncingball_run('VF', 900, 53.1, 29.8, 1)\" in the command window and then press the 'Enter' key, to perform the 900-ms IOI VF sequence.",
    "Note that the subject will tap on a keyboard key using the index finger in synchrony with the flashing balls.\nType \"Bouncingball_run('VB', 900, 53.1, 29.8, 1)\" in the command window and then press the 'Enter' key, to perform the 900-ms IOI VB sequence.\n\t\t\nNote that the subject will tap on a keyboard key using the index finger in synchrony with the moments when the bouncing ball moves to the lowest position (i.e., touches the bar).\n4. Programming of Data Analyses\nNOTE: The programming of data analyses is already implemented in the script \"BouncingBall_analyze.m\" in the directory \"BouncingBall\", which can be opened and edited using a text edit software. Readers can set up or modify the settings as required, following the comments in the script. The raw synchronization data are a sequence of tap times. Use a circular method to analyze the variable periodic synchronization data, which has been detailed in4,5,10. Here, the present protocol describes a procedure to analyze the stability (R) of synchronization, using the circular statistics toolbox (e.g., CircStat toolbox11 ), as described in Gan et al.4\nOmit the taps to the first five events in the tap sequence because synchronization typically requires a few taps to stabilize.\nCompute asynchrony.\nFor each tap sequence, calculate asynchrony as the difference between the time of a tap and the time of the corresponding event onset, resulting in a sequence of asynchronies.\n\t\tNOTE: It is better to exclude invalid taps for each sequence. Invalid taps include missing tap (i.e., there is no tap during the -1/2 to +1/2 IOI interval around an event) and multiple taps (i.e., when there is more than one tap during the -1/2 to +1/2 IOI interval).",
    "Convert the times (ms) of asynchronies into angles (degree) by asynchrony*(360/IOI). Then use function circ_ang2rad11 to convert degrees into radians, which results in the relative phase (RP) on a unit circle.\nCompute synchronization stability (R).\nFor each asynchrony sequence, use function circ_var11 to calculate the variance (S) of the RPs.\nCompute R using R = 1 - S.\n\t\tNOTE: R is the length of the resultant (i.e., average of vectors) of the RPs, ranging from 0 (unstable tapping with uniformly distributed RPs) to 1 (perfectly stable tapping with a unimodal distribution of RPs).\nFor each sequence type, calculate the mean value of the RPs of the 6 trials, as the R of that sequence type of that subject.\n5. Performing Data Analyses\nNOTE: Below is the analysis of data from one subject collected as introduced above. Performing data analyses is accomplished by typing \"Bouncingball_analyze(RecordedFile)\" in the command window of the software, which returns the mean and standard deviation (SD) of the stability.\nFor the 600-ms IOI AT sequence, type \"Bouncingball_analyze('AT_600_53.1, 29.8.mat')\" in the command window and then press the 'Enter' key.\nFor the 600-ms IOI VF sequence, type \"Bouncingball_analyze('VF_600_53.1, 29.8.mat')\" in the command window and then press the 'Enter' key.\nFor the 600-ms IOI VB sequence, type \"Bouncingball_analyze('VB_600_53.1, 29.8.mat')\" in the command window and then press the 'Enter' key.\nFor the 900-ms IOI AT sequence, type \"Bouncingball_analyze('AT_900_53.1, 29.8.mat')\" in the command window and then press the 'Enter' key.\nFor the 900-ms IOI VF sequence, type \"Bouncingball_analyze('VF_900_53.1, 29.8.mat')\" in the command window and then press the 'Enter' key.\nFor the 900-ms IOI VB sequence, type \"Bouncingball_analyze('VB_900_53.1, 29.8.mat')\" in the command window and then press the 'Enter' key.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}