{
  "id": 7095,
  "origin_website": "Bio",
  "title": "Characterization of Hippocampal Adult-borne Granule Cells in a Transient Cerebral Ischemia Model",
  "procedures": [
    "Transient middle cerebral artery occlusionPrepare the necessary instrumentation before starting the experiments (Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3890/bioprotoc-11-02-3890-g001.jpgFigure 1. Necessary instrumentation for the MCAO procedure Weigh the mouse and apply antalgic treatment with one drop of meloxicam (0.5 mg/ml, ca. 25 µg for a 25 g mouse) orally 30-60 min before starting the operation.Place the mouse in an anesthesia box and turn on a gas mixture of 2.5% Isoflurane in 3:1 N2O:O2 and wait for the mouse to fall asleep. Test pain reaction by pinching the tail or the paw.Place the mouse supine on a heating pad. Secure the paws with surgical tape, introduce the mini rectal thermistor probe, and keep the body temperature at 37 °C on the operating table under a continuous flux of isoflurane/oxygen/nitrous oxide.Note: A lower body temperature in the mouse MCAO model will result in a smaller infarct size, and, more generally, variations in body temperature during the MCAO protocol will result in a greater variability in infarct size and severity of neurological deficit. The age of the mouse is also relevant for the outcome (Sieber et al., 2010). Disinfect the ventral cervical region with Softasept N and make a midline incision. Use the standard forceps and the curved standard forceps to expose the common carotid artery by gently pushing to the side fat tissue, muscle, and the thyroid. Use the fine tip tweezers under the stereomicroscope to dissect the common carotid artery, the bifurcation, and the internal and external carotid arteries.Place a silk suture around the proximal external carotid artery after the bifurcation and another suture around the common carotid artery close to the bifurcation. Using the mini vessel clip, clamp the internal carotid artery proximally to cause a slight vessel engorgement in the common carotid artery, helping in the next step.",
    "Make a small incision in the common carotid artery proximal to the suture, open the mini vessel clip and insert the monofilament to occlude the middle cerebral artery until no further advancement to light pressure is possible (insertion length of about 10 mm). Fix the monofilament in place with a suture around the internal carotid artery which should be fixed with only one node. Close the wound.Note: Write down the insertion depth of the monofilament both to control that it did not move during the ischemic period and as a control across mice. Allow the animal to recover from anesthesia under a heat lamp. Ischemia time is usually 45 min but can vary from 30 to 45 min depending on the intended size of the infarct. With longer time intervals there is also cortex involvement of the infarct.Note: There is a trade-off in the time of ischemia: shorter durations may lead to a number of animals not becoming a sufficiently large enough infarct, while longer periods of ischemia are associated with increased mortality and hence a need for larger experimental groups. Qualified and well-practiced personnel is essential for reducing variability. Re-anesthetize the animal 5 min before the end of the ischemia time. Loosen the suture over the monofilament and remove the monofilament. Suture the common carotid artery, check for bleeding and close the wound. Observe the animal during recovery from anesthesia and place it back in its cage.For mice from the control group Step A7 is skipped.Control and score the mice according to a pre-established scoring table immediately after the operation, at three hours postoperatively and daily afterwards.",
    "Note: Body weight should be checked once or twice daily and early interventions such as providing wet food and a beaker of water on the cage floor for mice with reduced mobility can help reduce mortality. Scoring would also allow correlation of clinical stroke severity with single-cell electrophysiological properties. Acute hippocampal slicesBefore starting:Assemble a dissecting tray by gluing a smaller, plastic Petri dish into a larger, glass one, as in Figure 2 (lower row, middle). Optionally, the bottom of the small Petri dish can be covered in a couple of mm of silicone rubber to provide an anti-slip surface during dissection.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3890/bioprotoc-11-02-3890-g002.jpgFigure 2. Necessary instrumentation for the preparation of acute hippocampal slices Assemble a brain slice chamber: Cut the top part of a 50 ml Falcon tube and cut out the lid of the tube so that only the outer cylinder remains. Place a cotton or nylon net between the cut-out lid and the top part of the Falcon tube and screw it in place. Use a 15-ml Falcon tube with the bottom cut out and a small plastic weigh dish to secure all elements in place as in Figure 2 (lower row, rightmost). Alternatively, and if an associated research workshop is available, a more stable construction made from acrylic glass can pe prepared or can be bought commercially.Prepare 500 ml sucrose-based slicing solution and fill the half of a 200 ml beaker, the bottom of the buffer tray of the vibratome (not covering the stage) and the outer ring of the dissecting tray, and place these in the freezer at -20 °C overnight.On day of the experiment, prepare 500 ml fresh sucrose-based slicing solution and 1,000 ml aCSF.",
    "Fill the brain slice chamber with aCSF and put it in the water bath at 33 °C while bubbling Carbogen (5% CO2/95% O2). Fill up the 200 ml beaker and the bottom of the inner ring of the dissecting tray with slicing solution. Place the rest of the slicing solution on ice with constant Carbogen bubbling.Note: Surgical instruments can also be cooled by placing them on ice before starting the experiments. Prepare the vibratome according to the instruction manual: place a razor blade in its holder and align the blade using the Vibrocheck.Anesthetize the mouse with isoflurane, start the timer and decapitate the anaesthetized mouse with the surgical scissors. Place the head immediately in the ice-cold slicing solution in the 200 ml beaker.Note: Removal of the brain is a critical step that must be completed in under one minute. Keep visual track of time during these critical steps and fill it in the lab book afterwards to account for possible variations in slice or measurement quality. Inadvertent stress on the day of recording should be avoided, as activation of β-adrenergic receptors may lead to GluA3 AMPA receptor potentiation and variability in the data (Renner et al., 2017). Use the small scissors to cut the occipital skull from the foramen magnum towards the auditory meatus on each side, then cut medially from the foramen magnum towards lambda. Keep the cranium in ice-cold slicing solution between steps.Use the Adson forceps to remove the occipital bone by flapping it medially to laterally, then remove the parietal bone similarly along the sagittal suture, exposing the brain. Keep the cranium in ice-cold slicing solution between steps.Insert the spatula along the clivus, severing the cranial nerves, and remove the brain into the dissecting tray.",
    "Use a razor blade make a coronal cut at the level of the superior colliculus, and separate and remove the cerebellum. Separate the two hemispheres with a median sagittal cut and place the hemisphere ipsilateral to the stroke (right) on its medial side. Next, make a longitudinal cut along the parietal cortex (Figure 3A) and perpendicular to the sagittal plane (Figure 3B) and separate the frontal lobes by sectioning in the coronal plane (Figure 3C).Note: This is a critical step as the plane of section will determine perhaps to the greatest extent cellular viability and hence slice quality. The goal is to achieve a transverse sectioning plane, parallel to the plane of the apical dendritic tree and perpendicular to the long axis of the hippocampus. However, due to the complex, three-dimensional configuration of the hippocampus (similar to a seahorse or a banana), no one plane will be optimal for the entire length of the hippocampus. The above coordinates will give viable slices from the middle to ventral hippocampus (Figure 3a, 3b [Lein et al., 2007]). Depending on slice thickness, about three good quality slices can be expected from one hippocampus. For other subregions of the hippocampus, different slicing angles are chosen (Bischofberger et al., 2006). We recommend allowing a generous amount of time and (animal) resources at the beginning of the project for finding and perfecting the slicing angles which will result in the optimal slice viability. The removed frontal lobes may be used for estimating the size of the ischemia (e.g., by Map2 staining), since affected areas usually include the frontoparietal cortex and lateral caudatoputamen. imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3890/bioprotoc-11-02-3890-g003.jpgFigure 3. Orientation and cut surfaces of the brain for preparing acute hippocampal slices. A. Lateral view. B. Cranial view. C. Dorsal view.",
    "Red shaded areas represent regions of the hippocampus where slice quality in the present orientation will presumably be suboptimal, whereas green shaded areas represent slices with optimal cellular viability. © 2015 Allen Institute for Brain Science. Allen Brain Atlas API. Available from: brain-map.org/api/index.html.Place a couple of drops of cyanoacrylate glue on the dry stage of the buffer tray. With the help of a small curved forceps place the hippocampus dorsal side down on the spatula, use the filter paper to absorb any excess fluid, and carefully place the hippocampus dorsal side down in cyanoacrylate glue on the stage. The brain should be glued with its lateral side facing the blade (Figure 3C). Pour ice-cold slicing solution to completely cover the hippocampus in the buffer tray.Make 300 µm slices using a speed of 0.05 mm/s and a horizontal oscillation amplitude of 1.2 mm (Geiger et al., 2002). Transfer slices into the brain slice chamber in the water bath at 33 °C and incubate under constant Carbogen bubbling for 45 min.Remove the brain slice chamber from the water bath and let slices recover for another 60 min at room temperature.Note: Temperature and time allowed to recover influence the metabolic and electrophysiologic properties of the brain slices and should be carefully monitored and kept constant (zur Nedden et al., 2011). Electrophysiological considerations for whole cell recordings from adult borne granule cells and biocytin stainingA detailed description of the instrumentation and steps required to obtain the whole-cell configuration is beyond the scope of this paragraph and there are already excellent resources available (Walz, 2007; Sakmann, 2009; Okada, 2012; Graziane and Dong, 2015). Below are presented technical particularities relevant for performing whole cells analysis from adult-borne granule cells.",
    "For acute hippocampal slices from older mice (over 3-6 months), modified formulations of the slicing solution can be adopted for improved slice quality and cellular viability (Ting et al., 2011 and 2014).The very high input resistance (1-10 GΩ) and low capacitance (5-10 pF) due to a very small size pose technical difficulties for the electrophysiologist. Patch pipettes should be made of thick-walled glass, and the pipette capacitance should be carefully compensated. The seal resistance should be at least 3 times (preferably > 5 times) the input resistance.An understanding of the membrane dynamics and stability during formation of the seal can help select cells which have formed stable seals and discard cells with a gigaseal but a bad seal structure, ultimately saving time (Suchyna et al., 2009). Variations of promising seals as well as seals with a low probability of successful, qualitative recording, are presented in Figure 4A and Figure 4B respectively.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3890/bioprotoc-11-02-3890-g004.jpgFigure 4. Aspect of cell membrane during gigaseal formation can inform on the probability of a good recording. A. Promising aspects include a convex, straight, or slightly concave seal membrane with a relatively homogenous fluorescent signal (slightly dimmer at the pipette tip). B. Seals unlikely of giving stable recordings showing a more concave patch membrane with inhomogeneous fluorescent signal, a sloped patch membrane (line added for reference), and more inhomogeneous membrane patches indicative of membrane blebbing (arrowheads).Electrophysiological properties of a group of neurons (e.g., dentate granule cells) display heterogeneity in multiple space dimensions (Cembrowski and Spruston, 2019), therefore settling on a particular hippocampal region (e.g., ventral or dorsal hippocampus) may help reduce variability.The liquid junction potential should be measured and be compensated for before experiments (Barry and Lynch, 1991).",
    "Due to the very high input resistance of immature, adult-borne granule cells, relatively small current injections may be enough to destabilize the membrane and damage the cell. Incrementing steps of 5-10 pA should be initially implemented, since the median rheobase is around 30 pA in immature granule cells (Ceanga et al., 2019). The resting potential at the start of the protocol is of critical importance, since at depolarized potentials Na+ channels are in the inactive state. Some neurons which only produce spikelets/immature action potentials when depolarized starting from the resting membrane potential (Ihold = 0 pA), may produce taller action potentials when depolarized starting from a more negative potential (Ihold = -20 pA).Biocytin staining of recorded cells is complicated by the precarious anchoring of immature adult-borne granule cells in the tissue due the small soma size and underdeveloped dendritic tree (Figure 5), which often lead to the removal of the cell with the pipette (cells remain glues to the pipette tip). Very slow removal of the pipette from the neuron can help increase the percentage of patched cells which remain in the slice. Good quality reconstructions usually require at least 10 min for filling of the neurons.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3890/bioprotoc-11-02-3890-g005.jpgFigure 5. Confocal images of adult-borne granule cells following biocytin filling at different maturation stages. The neurons show a progressive development of the dendritic tree from immature to the left to a mature phenotype to the right (3.5 month-old mice). Bar=50 μm.After recordings, transfer slices into 4% PFA (e.g., in 4-well plates, one slice/well) and store overnight at 4 °C (however slices may also be processed after 4 h in 4% PFA).Next, gently wash the slices 4 × 15 min in TBS, then incubate the slices for 2 h in TBS Plus. Then add 1:500 Streptavidin-Cy3 and incubate overnight at 4 °C.",
    "Next day wash the slices 4 × 15 min in TBS and embed slices in Fluoromount.Note: The orientation of the slice must be noted on the cover of the well plates (e.g., tip of the dentate gyrus pointing left or right). Since slices are 300 µm thick, they should be placed with the cut surface closest to the recording cells facing upwards, otherwise scatter and autofluorescence from the tissue will affect image quality when cells are scanned. Recorded cells are often near the surface, around 50 µm deep–slices should be handled and transferred gently. When embedding the slices, press only very gently on the cover glass to avoid morphological disruption of the recorded cells."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}