{
  "id": 10010,
  "origin_website": "Jove",
  "title": "Designing a Bioreactor to Improve Data Acquisition and Model the Throughput of Engineered Cardiac Tissues",
  "procedures": [
    "This protocol used a de-identified iPSC line, SkiPS 31.3 (originally reprogrammed using dermal fibroblasts from a healthy 45 year old male)47, and was, thus, exempt from specific Institutional Review Board approval, in concordance with the institution's human research ethics committee guidelines. Perform all the cell and hECT manipulation in aseptic conditions in a HEPA-filtered class II biological safety cabinet or laminar flow work bench. Sterilize all the non-sterile solutions by filtration through a 0.22 µm filter, and maintain all the cells and hECTs in an incubator at 37 °C, 95% relative humidity, and 5% CO2.\n1. Bioreactor fabrication\nBioreactor components and aluminum master cast fabrication\n\tNOTE: Computer-aided design (CAD) files are provided in Supplementary File 1. The protocol may be paused anywhere between these steps. It is recommended to enlist a professional machinist to manufacture the master molds described in this section, as high tolerances (≤5 µm) and a smooth finish are required for accurate post geometry and for proper press-fitting of the polysulfone frames to the polytetrafluoroethylene (PTFE) baseplates (aiming for a snug friction fit, but not too tight).\n\t\nUsing a computer numerical control (CNC) mill, machine the baseplate out of PTFE according to the schematics in Figure 1A. The hECTs will be formed in the six evenly spaced wells (white arrows).\nUsing a CNC mill, machine the polydimethylsiloxane (PDMS) rack negative master cast out of aluminum according to the schematics in Figure 1B, with three frame supports (green asterisks). Drill six evenly spaced holes (magenta arrowheads) of 0.5 mm in diameter for creating the PDMS posts.\nUsing a CNC mill, machine the bioreactor frame out of polysulfone according to the schematics in Figure 1C. The frame supports (green asterisks) correspond to the frame supports seen in the rack cast (Figure 1B, green asterisks).",
    "Using a CNC mill, machine the aluminum cast holder out of aluminum according to the schematics in Figure 1D. Each slot contains a triangular shelf (orange triangle) that is 0.25 mm tall to provide a dead space for the PDMS to flow through the holes in the PDMS rack casts (Figure 1B, magenta arrowheads).\nCasting of the PDMS rack from the aluminum negative masters\n\t\nUsing a thermoplastic fused deposition modeling 3D printer, print two PDMS rack casting apparatus brackets (Supplementary File 1). Use the following print settings: a layer height of 0.1 mm, a wall/bottom/top thickness of 1 mm, an infill density of 90% with triangles, a printing temperature of 230 °C, a build plate temperature of 70 °C, and a brim for adhesion.\nPlace four aluminum negative master casts in the cast holder (Figure 2AI) such that the post holes align with the dead space opposite the triangle shelves (see Figure 1D). Wrap the apparatus in a rectangular piece of 0.5 mm thick silicone sheeting (Figure 2B, white arrows) as a gasket to prevent leakage of the liquid PDMS and clamp it between two parallel 3D printed brackets using a screw clamp.\nAdd 0.5 mL of PDMS curing agent to 5 mL of PDMS elastomer base (1:10 ratio, as per the manufacturer's instructions) in a shallow container, and mix vigorously for 5 min. Degas the PDMS mixture in a vacuum chamber, and apply a strong vacuum (0.1-1 kPa) for 20-60 min at room temperature or until bubbles disappear.",
    "Pour the PDMS mixture onto the casting apparatus, overfilling to ensure the complete coverage of each slot (Figure 2AII). If desired, add small, colored glass beads to the body of the PDMS racks (Figure 2AII), opposite the side with the posts (Figure 2B), for the unique identification of each PDMS rack. Return the casting apparatus to the vacuum chamber (ensuring it is horizontally level), and apply a strong vacuum for at least 12 h. Allow the PDMS to cure at room temperature for about 48 h away from dust to enable the complete curing and maximum strength of the delicate posts. Avoid using an oven as this warps the 3D-printed components.\n\t\tNOTE: The protocol can be paused here.\nPDMS rack removal from the aluminum negative master casts\n\t\nRemove the clamp, brackets, and silicone sheeting from the casting apparatus. Using a stainless-steel razor blade, trim away the PDMS film on top of the casting apparatus and frame supports, and gently use fingers to separate the PDMS racks from the sides of the cast holder. Insert a blunted stainless-steel razorblade into the dead space between the cast and the cast holder, and pry them apart (Figure 2CI, II), ensuring that the PDMS filling the dead space remains with the cast holder (as this is attached to the posts). Using a sharp stainless-steel blade, cut away the remaining PDMS films, and cut the dead-space PDMS from the tips of the posts (Figure 2C III-V).\nCRITICAL STEP: Free the PDMS rack from the cast (Figure 2D). Beginning with the side opposite the posts, use fingers to slowly separate the PDMS rack from the cast, working on alternate sides until the posts are free of the master casts.",
    "Repeat the previous step until all the PDMS racks and all the posts are freed. Use a sharp razor blade to trim away any remaining excess PDMS from the racks. The result is a PDMS rack (Figure 2E) with six intact posts (orange arrowheads) and colored beads (blue arrow) for identification.\n\t\tNOTE: The protocol can be paused here.\nStable post tracker (SPoT) fabrication\n\t\nUsing a thermoplastic fused deposition modeling 3D printer, print the components of the SPoT casting apparatus (Supplementary File 2 and Figure 3AI, II). Use the following print settings: a layer height of 0.1 mm, a wall/bottom/top thickness of 1 mm, an infill density of 80% with triangles, a printing temperature of 230 °C, a build plate temperature of 70 °C, and a brim for adhesion.\nEnsure a secure press fit between the 3D-printed pieces, as well as between the PDMS racks and the three-pronged jig, and confirm that the PDMS racks fit snugly with the posts just reaching the bottoms of the wells without being bent. Trim/file the plastic if necessary.\nAdd 0.5 mL of black PDMS part A to 0.5 mL of part B (1:1 ratio, as per the manufacturer's instructions) to a small weighing boat (or a similar small, shallow container), and mix thoroughly until uniform in color. Degas the mixed black PDMS in a vacuum chamber under a strong vacuum for 20 min. Pour the degassed black PDMS onto the 3D-printed base to fill the holes, and tap to ensure that no bubbles remain. Scrape away as much excess PDMS off the base as possible.",
    "Snap the three-pronged piece onto the base, and place the PDMS racks in the grooves on the three-pronged jig (Figure 3AII, turquoise rectangle), ensuring that the ends of the posts dip into the black PDMS in the circular wells (Figure 3B, C). Cure the black PDMS at room temperature and protected from dust for 48 h.\n\t\tNOTE: The protocol can be paused here.\nSlide out the three-pronged piece, minimizing tension on the posts. Use small forceps to scrape away the thin film of black PDMS that surrounds each SPoT; then, insert fine-tipped bent forceps into the SPoT well to free it from the 3D-printed base (Figure 3D).\nInspect the SPoTs (Figure 3E), and trim away any remaining black PDMS film from the casting process not removed in step 1.4.5 using fine Vannas scissors. Ensure that the finished posts are of the correct length by fitting the PDMS racks onto the polysulfone frame and then sliding this onto the black baseplate (Figure 4A).\n\t\tNOTE: The protocol can be paused here.\nPair the PDMS racks, and add them to the frame using the frame tabs (Figure 4A). Autoclave in a bag with a PTFE baseplate for at least a 30 min cycle (<122 °C to reduce warping).\nimgsrc://cloudfront.jove.com/files/ftp_upload/64368/64368fig01.jpg",
    "Figure 1: hECT bioreactor components. (A) Top view (left) and side view (right) of the PTFE baseplate with six evenly spaced wells for forming hECTs (white arrows). (B) Side view (left) and top view (right) of the aluminum negative master casts for the PDMS racks with six evenly spaced posts (magenta arrowheads) and three gaps for attaching to the bioreactor frame (green asterisks). (C) Side view (left) and bottom view (right) of the polysulfone frames for the PDMS racks with three evenly spaced frame supports (green asterisks) corresponding to the frame supports in the PDMS rack cast (panel B). (D) Top view (top) and side view (bottom) of the aluminum cast holder with four slots for the PDMS rack casts, each with a 0.25 mm high triangular shelf (left-most shelf highlighted in orange). This figure was modified from van Neste27. Abbreviations: hECT = human engineered cardiac tissue; Ø = diameter; PTFE = polytetrafluoroethylene; PDMS = polydimethylsiloxane; R = radius. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/64368/64368fig01large.jpg]\nimgsrc://cloudfront.jove.com/files/ftp_upload/64368/64368fig02.jpg",
    "Figure 2: Fabrication of the PDMS racks. (A) CAD renderings show an oblique view of the casting apparatus. (I) A negative PDMS rack master cast is inserted into each of the four slots of the cast holder with the holes that form the PDMS posts (magenta arrowheads) placed over the dead space opposite the triangular shelf (Figure 1D, orange triangle). (II) PDMS is poured into each cavity of the negative master cast. (III) Colored beads are added to the uncured PDMS as a color-coded identification system. (B) Photo showing the assembled PDMS rack casting apparatus, which is clamped on either side with two 3D-printed brackets held in place by a screw clamp and wrapped with 0.5 mm thick silicone sheeting (white arrows) to seal the clamped sides. The colored beads are placed so that they do not cover the 0.5 mm diameter holes that form the posts (magenta arrowheads). (C) Once the PDMS is cured, the cast is removed from the cast holder. (I) A blunted stainless-steel razor blade or similar thin metal tool is inserted between the cast and the cast holder to pry the cast from the cast holder (II). (III) The film (turquoise brackets) formed by the PDMS flowing through the holes of the posts is attached to the tips of the posts and must be cut away using a sharp blade (IV,V). (D) The PDMS rack is separated from the cast. (E) Photos showing oblique (top), side (middle), and bottom (bottom) views of the PDMS rack with a glass bead embedded in the body for identification (blue arrow). The tips of the posts (orange arrowheads) have been marked with black ink. Scale bar = 1 cm. This figure was modified from van Neste27. Abbreviations: CAD = computer-aided design; PDMS = polydimethylsiloxane.",
    "Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/64368/64368fig02large.jpg]",
    "imgsrc://cloudfront.jove.com/files/ftp_upload/64368/64368fig03v2.jpg\nFigure 3: SPoT fabrication. (A) CAD renderings indicating key dimensions of the (I) base and (II) three-pronged piece of the SPoT casting jig. The dimensions of the circular SPoT forms (AI, black arrows) are set as 0.2 mm deep x 1.2 mm in diameter, and each holds the black PDMS for an individual SPoT. The 11.1 mm x 27 mm shelf seen in the top view (AII, top, turquoise rectangle) is depressed by 0.4 mm (as seen in the side view below) to hold the PDMS rack in place during curing. (B) CAD rendering showing the assembly of the SPoT casting apparatus. (C) A photo of the assembled SPoT casting apparatus. (D) After the PDMS has cured, the three-pronged jig is slid out from underneath the PDMS racks, and the SPoTs are freed from their wells using fine forceps. (E) Photos of the PDMS rack without (top) and with (bottom) SPoTs. Insets show magnified views of the posts. Scale bars = 1 cm (E), 2.5 cm (zoomed-in images in of E). This figure was modified from van Neste27. Abbreviations: CAD = computer-aided design; Ø = diameter; PDMS = polydimethylsiloxane; R = radius; SPoT = stable post tracker. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/64368/64368fig03large.jpg]\n2. Cell culture\nCulturing the iPSCs\n\tNOTE: Different cell lines may require adjustments to the passage dilution and frequency and/or the titration of the medium additives.\n\t\nCoat a cell-culture-treated 6-well plate with qualified basement membrane matrix (diluted in 1:1 Dulbecco's Modified Eagle Medium:Ham's F12 Nutrient Solution [DMEM/F12] according to the manufacturer's instructions), and incubate the plate at 37 °C for at least 30 min. Prepare 500 mL of iPSC culture medium according to the manufacturer's instructions, and add 5 mL of penicillin-streptomycin (10,000 IU/mL to 10,000 µg/mL) stock solution.",
    "To passage the iPSCs, aspirate the medium from the wells and wash each well once with 1 mL of phosphate-buffered saline (PBS). Add 1 mL of iPSC dissociation solution per well, and incubate in a laminar flow hood for 1 min.\nAspirate the iPSC dissociation solution, and incubate the cells at 37 °C (without any medium) for 5 min. Add 1 mL of 2 µM thiazovivin in iPSC medium to neutralize the iPSC dissociation solution.\nUse a 2 mL serological pipette to dissociate the colonies into clumps of roughly 10 cells, and wash each well with an additional 1 mL of 2 µM thiazovivin in iPSC medium. Add 2 mL of cell suspension to each well of the plate newly coated with basement membrane matrix (step 2.1.1).\nAfter 24 h, remove the medium, and add fresh iPSC medium (without thiazovivin). Feed the iPSCs every 48 h with 2 mL of iPSC medium or every 72 h with 4 mL of medium. Replate the cells at a 1:6 dilution for passaging every 3 days or when they reach 80% confluence.\n\t\tNOTE: Different cell lines may require adjustment of the dilution and passage frequency .\nCardiomyocyte differentiation\n\t\nBegin the differentiation when the iPSC monolayers are 80%-90% confluent.\nPrepare the differentiation medium by adding 10 mL of B27 supplement without insulin and 5 mL of penicillin-streptomycin stock solution to 500 mL of Roswell Park Memorial Institute 1640 medium (RPMI). Prepare the cardiomyocyte maintenance medium by adding 10 mL of B27 supplement and 5 mL of penicillin-streptomycin stock solution to 500 mL of RPMI 1640.\n\t\tNOTE: The differentiation medium and cardiomyocyte maintenance medium can be stored at 4 °C for up to 2 weeks.",
    "Day 0: Wash the cells with 1 mL of DMEM/F12, and add 2 mL of 10 µM CHIR99021 and diluted basement membrane matrix in differentiation medium.\nDay 1: After 24 h, or when the cell confluence has reduced to below 70%, wash the cells with 1 mL of DMEM/F12, add 2 mL of differentiation medium, and incubate for 48 h.\nDays 3-4: Wash the cells with 1 mL of DMEM/F12, and add 2 mL of 5 µM IWR-1 in differentiation medium. Repeat on day 4.\nDays 5-6: Wash the cells with 1 mL of DMEM/F12, and add 2 mL of differentiation medium. Repeat on day 6.\nDays 7-10: Wash the cells with 1 mL of DMEM/F12, and add 2 mL of cardiomyocyte maintenance medium. Repeat every 24 h.\nDays 11+: Replace the medium with 4 mL of fresh cardiomyocyte maintenance medium every 48-72 h. Aspirate and pipette slowly to avoid damaging the vigorously beating monolayers.\n3. hECT culture\nHarvesting the cardiomyocytes\n\t\nHarvest the cardiomyocyte monolayers for use in the hECT fabrication 8-60 days post-differentiation induction. Expect 2-5 million cells per well.\n\t\tNOTE: If the cells have not begun beating by day 10, the differentiation is unlikely to be successful. Vigorously beating monolayers often detach after 11-15 days into the differentiation and compact into dense tissues. It is recommended to use or replate such cells at this time.\nRinse each well of cardiomyocytes 2x with 2 mL of PBS. Add 1 mL of room-temperature 0.25% trypsin-EDTA. Incubate at 37 °C for 5-10 min until the cells appear rounded and will detach with light tapping of the plate.",
    "Add 1 mL of 10% FBS in cardiomyocyte maintenance medium to each well to neutralize the dissociation. Gently pipette the monolayers using a 5 mL serological pipette tip, and transfer to a 50 mL conical tube to break up the pellet into clumps of 10-20 cells.\nMix the cell suspension by inverting the conical tube before transferring 10 µL of cells to 10 µL of trypan blue. Count the cells using an automated cell counter or glass hemocytometer. Separate the cell suspension appropriately if not all the cells will be used or if some cells are set aside for flow cytometry.\n\t\tNOTE: Supplemental cells (such as fibroblasts) may be added at this point.\nCentrifuge the cells at 250 × g for 5 min. Immediately aspirate as much supernatant as possible without disturbing the cell pellet, and keep on ice. Work quickly to minimize the time that the cells spend in the pellet.\nhECT fabrication\n\t\nUse the volumes in Table 2, and adjust according to the number of cells in the pellet so that each hECT contains 1 million cells. After each step, mix by pipetting slowly to avoid bubbles.\n\t\tNOTE: Perform steps 3.2.2-3.2.3 shielded from direct light as some components are light-sensitive.\nPrepare a 2.9 g/mL type-1 collagen solution in a 1.7 mL microtube by adding 13.442 µL of distilled water, 4.4 µL of 10x PBS, and 0.638 µL of 1M NaOH. Add 25.52 µL of 5 mg/mL collagen stock solution, and mix slowly.",
    "Prepare extracellular matrix mix (ECM mix from Table 2): Add 5.5 µL of 0.2 N pH 9 HEPES solution followed by 5.5 µL of 10x MEM. Mix thoroughly until a uniform light-yellow to light-pink color is observed. Transfer 35.2 µL of the ECM mix solution to the cell pellet, and add 4.4 µL of basement membrane matrix.\nOpen the autoclaved bag of bioreactor parts (step 1.4.7, Figure 4A). While wearing gloves sterilized with 70% ethanol, remove the black baseplate from the autoclave bag, and place in a 60 mm dish with the wells facing up. Pipette 44 µL of the cell mixture into each well slowly to avoid introducing bubbles. If necessary, use the pipette to remove any bubbles that were introduced by pipetting or have formed due to the hydrophobicity of the PTFE. Restore the volume of the hECT such that the surface of the liquid is flush with the lip of the well (Figure 4BI).\nDon a fresh pair of sterilized gloves, and remove the polysulfone frame with PDMS racks from the autoclave bag. Lower the frame onto the baseplate such that the ends of the frame fit into the grooves at the ends of the baseplate (Figure 4BII, III). Inspect the bioreactor to ensure the posts are all straight and the frame is not tilted before placing into a 60 mm dish.",
    "Add 1 mL of 10% FBS in cardiomyocyte maintenance medium to the 60 mm dish (take care not to disturb the hECTs) to increase the humidity in the dish as the hECTs solidify. Place the 60 mm dish without a lid into a high profile (20 mm tall) 100 mm dish, cover with a 100 mm dish lid, and return the bioreactor to the 37 °C, 5% CO2 incubator to allow the collagen to form a gel with the cells in suspension.\nAfter 2 h, remove the dish from the incubator. Add 13 mL of 10% FBS in cardiomyocyte maintenance medium, tilting the dish to encourage the medium to flow between the PTFE baseplate and the PDMS racks.\nInspect the bioreactor from the side to ensure no air bubbles are trapped between the hydrophobic surfaces of the PTFE baseplate and the PDMS racks, and return the dish to the incubator. If there is trapped air, tilt the bioreactor out of the medium to let the bubble break, and slowly lower it again, or use a micropipette with a gel loading tip to siphon out the air, taking care not to disturb the posts.\nBaseplate removal",
    "Inspect the hECT compaction through the gap in the frame. Over the course of 24-96 h, the hECTs compact and become more opaque (Figure 4CI-III). Once there is a visible gap between the hECTs and the wall of the baseplate (Figure 4CII), perform two half-volume medium changes to change the medium to cardiomyocyte maintenance medium without FBS. Remove the baseplate when the hECTs are compacted by at least 30% compared to the original diameter (Figure 4CIII). Fill the 60 mm dish containing the bioreactor with cardiomyocyte maintenance medium until the liquid is flush with the lip of the dish, and add 14 mL to a new 60 mm dish.\nCRITICAL STEP: While wearing sterile gloves, flip the bioreactor over in its dish so that the baseplate is on top (Figure 4BIV). Inspect for trapped air bubbles as in step 3.2.8. Slowly lift the baseplate, keeping it level (Figure 4BV).\nIf an hECT falls off during baseplate removal but remains in the baseplate, use sterile curved fine forceps to transfer the hECT from the baseplate into the 60 mm dish. Use the forceps to guide the end of the hECT to its post. Use a second pair of forceps to hold the post steady, and thread it through the hole in the hECT. Repeat for the second post if necessary.\nWith all the hECTs attached to the posts, transfer the frame with the hECTs to the new 60 mm dish, and place the frame with the posts pointing down (Figure 4BVI). Inspect the bioreactor to ensure the hECTs remain on their posts just proximal to the SPoTs.",
    "If an hECT has been pushed by surface tension to the base of its posts, stabilize the frame with a pair of sterile curved forceps. Insert the other pair of forceps through the slot in the frame, keeping it closed. Once the tip of the forceps has been lowered past the PDMS racks, twist it so that it reaches the post, and use the closed tips to gently push the hECT toward the end of the post until it rests on the SPoT (Figure 4BVI, inset).\nhECT maintenance\n\t\nPerform half-volume medium changes with cardiomyocyte maintenance medium every 24-48 h (after 2 weeks of culture, the frequency can be reduced to twice per week.)\nWhen the hECTs display clusters of spontaneous beating, typically by day 3, and coordinated beating with visible post deflection by day 5, begin the functional measurements, and repeat as often as desired.\n\t\tNOTE: hECTs that have not started coordinated beating by day 7 are unlikely to do so at all.\ntable:\n﻿0,1,2,3,4,5,6,7,8\nComponent,Component,Component,Volume (μL),Volume (μL),Volume (μL),,,\ndistilled H2O,distilled H2O,distilled H2O,13.442,13.442,13.442,2.9 mg/mL collagen solution,\"\"\"ECM mix\"\"\",final hECT cell mixture\nNaOH 1N,NaOH 1N,NaOH 1N,0.638,0.638,0.638,2.9 mg/mL collagen solution,\"\"\"ECM mix\"\"\",final hECT cell mixture\nPBS 10x,PBS 10x,PBS 10x,4.4,4.4,4.4,2.9 mg/mL collagen solution,\"\"\"ECM mix\"\"\",final hECT cell mixture\n5 mg/mL collagen stock,5 mg/mL collagen stock,5 mg/mL collagen stock,25.52,25.52,25.52,2.9 mg/mL collagen solution,\"\"\"ECM mix\"\"\",final hECT cell mixture\n0.2 N pH 9 HEPES,0.2 N pH 9 HEPES,0.2 N pH 9 HEPES,5.5,5.5,5.5,,\"\"\"ECM mix\"\"\",final hECT cell mixture\n10x MEM,10x MEM,10x MEM,5.5,5.5,5.5,,\"\"\"ECM mix\"\"\",final hECT cell mixture\nVolume of ECM mix to transfer to cell pellet,Volume of ECM mix to transfer to cell pellet,Volume of ECM mix to transfer to cell pellet,35.2,35.2,35.2,,,final hECT cell mixture\nVolume of Matrigel,Volume of Matrigel,Volume of Matrigel,4.4,4.4,4.4,,,final hECT cell mixture\nTable 2: hECT reagents. The components should be added in the order listed and kept on ice.\nimgsrc://cloudfront.jove.com/files/ftp_upload/64368/64368fig04.jpg",
    "Figure 4: Bioreactor assembly and hECT fabrication. (A) (I) Two PDMS racks (left, light blue) fitted onto the polysulfone frame (right, tan). (II) The PTFE baseplate (black, left) then fits onto the frame (right) such that each pair of posts fits into a well of the baseplate. (B) (I) Forty four microliters of cardiomyocyte suspension in collagen-based extracellular matrix is added to each of the six baseplate wells. (II,III) The frame with PDMS racks is press-fit onto the baseplate. After 1-4 days, the hECTs can be removed from the baseplate. (IV) First, the bioreactor is inverted before (V) the baseplate is lifted off the frame. (VI) Side-view of the bioreactor with six hECTs. Inset: magnified view showing the hECT position on the posts relative to the SPoTs (inset). (C) CAD rendering showing three levels of hECT compaction ([I] low, [II] medium, and [III] high) as seen through the gap in the polysulfone frame. This figure was modified from van Neste27. Abbreviations: CAD = computer-aided design; PDMS = polydimethylsiloxane; PTFE = polytetrafluoroethylene; SPoT = stable post tracker; hECT = human engineered cardiac tissue. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/64368/64368fig04large.jpg]\n4. hECT pacing equipment\nJacket for the heated stage\n\t\nUse a laser cutting machine to cut the components of the acrylic insulating jacket out of a 0.635 cm thick clear acrylic sheet (Supplementary File 3), one each of Figure 5A-D, and two each of Figure 5E, F.\nAssemble parts (B), (C), (D), and one of (E) from Figure 5, and bond together using acrylic glue as shown in Figure 5GI. Attach the top panel (Figure 5GII), allow several hours for the glue to set, and then slide the heated stage into the side of the jacket (Figure 5GIII).",
    "Once the jacket is in place, use tape to secure the inserts in between the legs of the heated stage, and add the front panel (Figure 5GIV) to finish the assembly (Figure 5GV).\nGraphite electrode fabrication\n\t\nCut 6.25 mm thick, 25 mm wide graphite bars using a band saw into blocks 35 mm long; then, cut each block lengthwise in a curved line so that each electrode is 13-16 mm tall at one end and 8-10 mm tall at the other end. Drill two 0.7 mm diameter holes in the upper corner (Figure 6AI). Polish the pieces with paper towels, and sonicate in water for 20 min to remove graphite dust. Ensure that the electrodes wedge between the walls of the dish and the 25 mm wide bioreactor to ensure a consistent distance between the electrodes (Figure 6AII).\nThread a 150 mm long x 0.25 mm diameter steel wire through the holes of the electrodes, and bend it to fit over the lip of the 60 mm dish and around the walls of the 100 mm dish so that the lid can be closed (Figure 6AII).\nClean the electrodes by soaking in distilled water for 1-2 h after each use to remove any absorbed medium, allow to dry overnight, and then autoclave at 132 °C for 30 min. Before commencing the measurements, place one electrode on either side of the bioreactor (Figure 6AII). Position the wires so that the 100 mm dish lid can be closed, and return the bioreactor to the incubator to equilibrate.\nimgsrc://cloudfront.jove.com/files/ftp_upload/64368/64368fig05.jpg",
    "Figure 5: Acrylic jacket for insulating the heated glass stage. CAD images showing the key dimensions of the pieces of the acrylic jacket designed for the glass table. (A) The top panel has a 27 cm x 18.5 cm hole cut-out to allow for the bioreactor dish to sit on the heating element. The orange rectangles in the corners indicate the suggested placement of small spacer pieces to provide space between the top of the jacket and the heating element. (B) The bottom piece of the jacket has two cut-outs to allow the legs of the heated stage to slide in (green asterisks). (C&D) Two side panels fit under the top piece. (D) The left side panel includes a 3 cm x 0.3 cm cut-out (inset) for the stage power cord. (E) Long panels fit on the front and back. (F) Inserts are added to fill the gaps once the table is inside. (G) (I) The side and back panels are attached to the bottom piece, and then (II) the top panel is added. (III) The glass table is slid into the jacket (magenta arrows). (IV) The inserts are attached between the legs of the table, and the back fits onto the opening to close the box. (V) The completed jacket assembly. This figure was modified from van Neste27. Abbreviations: CAD = computer-aided design; R = radius; Ø = diameter. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/64368/64368fig05large.jpg]\nimgsrc://cloudfront.jove.com/files/ftp_upload/64368/64368fig06.jpg",
    "Figure 6: Data acquisition of hECT contraction. (A) (I) Photos of the electrodes cut from graphite bars. The magenta arrows indicate holes for attaching the stainless steel wires. Scale bar = 1 cm. (II) Oblique view (left) and top view (right) showing the placement of the graphite electrodes in the bioreactor. The electrodes take up the space between the 25 mm wide bioreactor and the wall of the dish to ensure a consistent distance between the electrodes. The wires are bent to allow the closure of the dish lid. (B) Photo of the hECT pacing setup inside the laminar flow clean bench-all equipment is placed on the vibration isolation table to reduce vibration noise from the clean bench. The bioreactor (magenta arrowhead) sits on the jacketed heated stage, illuminated by an LED light source from above. The dissecting microscope is pointed horizontally at a right-angled mirror (orange asterisk) to view the bioreactor from below and is fitted with a CCD camera (left). The turquoise bracket indicates a water bath for continuous temperature monitoring to provide feedback to the closed-loop heated stage controller. This figure was modified from van Neste27. Abbreviations: hECT = human engineered cardiac tissue; LED = light-emitting diode. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/64368/64368fig06large.jpg]\n5. hECT functional measurements\nSetting up the pacing workspace",
    "Turn on the heated stage to 39.5 °C, and set up the pacing equipment on a vibration isolation table inside a laminar flow clean bench according to Figure 6B. Mount the dissecting microscope on a boom stand, and point it at a right-angled mirror (Figure 6B, orange asterisk) located on a lab jack below the glass table to view the bioreactor from below. Affix a high-speed CCD camera to the microscope, and connect to the computer. Irradiate the setup with UV light for 15 min to sterilize the workspace.\nPlace the bioreactor (Figure 6B, magenta arrowhead) on the jacketed heated stage, illuminated by a dual-head gooseneck LED light source from above (the necks of LED lamps can be more securely fastened to the main unit compared to the fiber-optic lamps). Minimize additional noise by ensuring the pacing equipment on the vibration table (and the table itself) is not touching any part of the laminar flow clean bench.\nAdd a second 60 mm dish filled with prewarmed water inside of a 100 mm dish onto the heated table (Figure 6B, turquoise bracket), and outfit with a temperature probe for continuous temperature monitoring. Adjust the temperature setting of the heated stage as needed to maintain the temperature of the reference dish at 36-37 °C.\nSet the microscope magnification to 1.5x (or another desired magnification with which an hECT can be visualized in its entirety with adequate resolution).\nAdjusting the camera settings\n\t\nOpen the camera software. Resize the video feed to crop the field of view as much as possible while still visualizing a whole hECT. This maximizes the camera speed.",
    "Set the capture rate to 90 frames per second. Adjust the exposure time and light source position to optimize the uniformity of the lighting conditions across the field of view and maximize the contrast of the SPoTs.\nAcquisition software setup\n\t\nTurn on the square pulse stimulator, and connect it to the computer. Adjust the settings to deliver biphasic pulses with an amplitude of 12 V and a duration of 5 ms.\nOpen the data acquisition software, and then open the \"AutomatedPostTracking3.vi\" file (Supplementary File 4). Once it loads, click on the white arrow on the left side of the toolbar to initialize the program (Figure 7A).\nCalibrate the software using a glass hemocytometer on the heated stage. In the toolbar (Figure 7B), click the line tool to draw a line across 1 mm of the hemocytometer markings (not shown). In the Distance calibration (pixels/mm) box (Figure 7C), set the Reference length (mm) to 1, and then click on the Calculate button.\nMeasure the hECT cross-sectional area by using the line tool to draw a line across the width of the tissue. Click on the 1 in the Cross-sectional area (mm^2) box (Figure 7D) to calculate the area (assuming a cylindrical geometry of the linear tissue strips, as established in the literature1,2,3,4,5,6,7,8,9,10,11,12,15,16,18,19,20,\n21,22,23,24,25,26,37,38). Repeat along different parts of the hECT, and record the values under the other two buttons in the box. The output data table file reports the average of these three values to calculate the diameter of the tissue.\nhECT functional characterization\n\t\nEnsure the post tips are in focus. Turn on the thresholding switch (Figure 7E), and adjust the slider (Figure 7F) until the SPoTs (Figure 7G) are nicely demarcated and do not change shape as the hECT contracts.",
    "Use the rectangle tool to draw a rectangle around one of the SpoTs (Figure 7, green rectangle), and click on the Set 1 button inside the Post boundaries box (Figure 7H) to set the rectangle position around the SPoT, ensuring that the SPoT remains within the boundary of the rectangle at all times. Repeat for the other post, and record it under Set 2.\nAdjust the object size settings (Figure 7I) to prevent the program from tracking smaller objects. Ensure that the number of objects tracked in each rectangle remains constant. The interface (Figure 7J) shows the measured distance between the tracked objects in real time. Use this graph to monitor the noise.\nSelect a directory to save the files (Figure 7K). Store data from different days in separate folders. Select the current Tissue number, and write any desired comments in the Comments box.\nUnder the Pacing Frequency (Hz) header (Figure 7L), indicate the range of frequencies desired (Min and Max), and the desired Interval for stepping from Min to Max. If pacing the hECTs across their entire capturing range, test different pacing frequencies to find the lowest frequency at which a 1:1 stimulus:peak ratio is achieved, and continue to increase the frequency until that ratio is lost. Measure the spontaneous function by choosing an arbitrary frequency range (e.g., 0.01 Hz to 0.01 Hz) and keeping the square pulse stimulator output off.\nIn the boxes to the right, choose the desired Setting time (s) (an interval of time after the frequency has been set but data are not recorded) to allow the hECT to adjust to the new pacing frequency. Specify the Recording time (s) and Pacing Voltage (V). Begin the program by clicking on the Start Program button (Figure 7M).",
    "NOTE: The results are saved automatically in the selected directory. After each recording, observe that the script displays the Fourier transformation of the data (Figure 7N), where the peaks correspond to the detected beating frequency.\nIf desired, run the \"Excitation Threshold Finding\" program to find the minimum voltage required to stimulate the hECT in view (Figure 7O). If desired, calculate the maximum and minimum deflections of the posts (Figure 7P).\nimgsrc://cloudfront.jove.com/files/ftp_upload/64368/64368fig07.jpg\nFigure 7: Post deflection data acquisition interface. (A) Button for running the software. (B) Toolbar containing the line and rectangle tools for the length measurements and object selection, respectively. (C) Distance calibration controls. (D) Tools for measuring the hECT cross-sectional area at three different points. (E) Thresholding switch and (F) slider for converting the video feed into high-contrast images in real time. (G) A SPoT visible in the preview window. (H) Tools for selecting the SPoTs. (I) Slider for filtering the objects by size. (J) Graph showing the measured distance between the tracked objects in real time. (K) Options for selecting the directory to save the output files. (L) Options for setting the frequency range, frequency interval, recording time, and setting time between recordings for the post tracking program (M). (N) Graph output of the Fourier transformation of the deflection curve of the last saved recording. (O) Program to find the minimum voltage required to stimulate the hECTs. (P) Program to calculate the maximum and minimum deflections of the posts. Abbreviations: hECT = human engineered cardiac tissue; SPoT = stable post tracker. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/64368/64368fig07large.jpg]\n6. PDMS rack measurements\nUnloaded distances",
    "Before hECT fabrication, mount the desired pair of PDMS racks onto a frame. Use the pacing setup and software described in step 5.1 for the functional measurements. Select the stationary SPoTs at the ends of the posts.\nAdjust the light source and/or thresholding if necessary to reduce the noise to <2 µm. Record the average live y-value indicated in the graph in a spreadsheet.\nPost heights and hECT heights\n\t\nFrom the pacing setup described in step 5.2, remove the angled mirror and heated stage. Place the bioreactor directly on the lab jack for a side view of the bioreactor.\nOpen the camera software. Adjust the exposure time and light source position to optimize the uniformity of the lighting conditions across the field of view and maximize the visibility of the posts.\nOpen the data acquisition software, and then open the \"PostMeasurement_PB3.vi\" file (Supplementary File 5). Once it loads, click on the white arrow on the left side of the toolbar to initialize the program.\nCalibrate the software using a glass hemocytometer. Click on the line tool in the vertical toolbar to the left of the viewing window, and draw a line across 1 mm of the hemocytometer markings. In the Distance calibration (pixels/mm) box in the lower left of the screen, set the Reference length (mm) to 1, and then click on the Calculate button.\nBelow the calibration fields, set the desired tissue number (for identification) in the Tissue Number field. Focus the camera on the left post of the hECT, and select Left in the Post Side box.\nUse the line tool to draw a line from the base of the post (top) to the tip of the SPoTs (bottom), and record by clicking on Measure Post Ht.",
    "Draw a line from the base of the post to the far edge of the hECT, and record by clicking on Measure Tissue Top Ht. Draw a line from the base of the post to the near edge of the hECT, and record by clicking Measure Tissue Base Ht.\nAt this point, turn the bioreactor around to measure the right post height. Select the right post option to record the same measurements. Click on the Add button to populate the spreadsheet with the measured values and automatically calculate the average height of the hECT, which will be used in step 7.\nOnce finished recording the tissue heights, click on the Save button to save the values to a text file.\n7. Functional data processing using custom analysis scripts\nIn a spreadsheet editor, fill out the summary file using the template (Supplementary File 6). Use the post length and average tissue height values acquired in steps 6.2. Ensure that all the hECTs that have data in the folder are represented in the summary file. Name the file \"summary #.csv\", where # refers to the number of days into the experiment.\n\tNOTE: The hECT functional data must be in separate folders according to the experiment day.\nEnsure the folder containing the AnalyzeLogsGUI scripts (Supplementary File 7) and the folder with the hECT recordings are both added to the path.\nOpen the data analysis software. To the left of the directory bar, click on the Browse for folder button to navigate to the parent folder that contains both the AnalyzeLogsGUI folder and the hECT functional data. In the Current Window sidebar, right-click on these folders to Add to Path | Add Selected Folders and Subfolders.",
    "Open the \"AnalyzeLogsGui_SC.m\" file. In the Editor tab, press the Run button, and wait for the graphical user interface (GUI) to appear in a new window.\n\t\nIn the Log Selection box (Figure 8AI), click the Select Directory button, and navigate to the folder that includes the hECT functional data. Select the desired hECT to be processed from the Tissue dropdown menu.\nIn the Data Inputs box (Figure 8AII), input the unloaded distance between the posts recorded from steps 6.1 in the Diastolic Distance field. Input 0.25 in the Post Radius (mm) field.\nIn the Analysis Constraints box (Figure 8AIII), choose the frequencies to omit from the analysis, or select specific frequencies to include (separated by commas). The start time and end time are set to 0 and −1, respectively, by default to process the whole length of the recordings. Change these values to trim the recordings if necessary.\nChange the filter parameters (Figure 8AIV) of Polynomial Order and Frame Size to alter the level of smoothing during the filtering process and the Peak Detection Threshold slider to set the minimum peak size that will be recognized by the scripts.\n\t\tNOTE: The script contains the Spike Removal option, which clips tall peaks caused by artifacts; however, this is not recommended as it changes the shape of the twitches. Remove artifacts through trimming the recording instead (Figure 8AIII).\nUse additional options (Figure 8AV) for additional data analysis output: Post deflection analysis to run an additional peak detection algorithm, Autoscale y-axis on zoom plots to automatically adjust the axes on the twitch force curve (Figure 8B), Save force-trace curves to save each twitch force figure to a .fig file, and Save force-time data to save the x- and y-coordinates of the filtered data plotted in the twitch force curve figure.",
    "Click on Run Analysis to generate a .txt file that contains the attributes of the twitch force curve (Supplementary File 8) averaged across a whole recording.\nimgsrc://cloudfront.jove.com/files/ftp_upload/64368/64368fig08.jpg",
    "Figure 8: Twitch force curve calculations. (A) Running the \"AnalyzeLogsGUI.m\" file in the data processing software opens the GUI window. (I) The Log Selection box allows the user to select the directory for the folder containing the hECT functional data. The Day Num field is automatically populated from the title of the summary file created in protocol step 7.1. The hECT to be processed is selected using the Tissue dropdown menu. (II) The Data Inputs box contains information about the pair of PDMS posts that support the hECT, such as the unloaded distance (obtained in protocol step 6.1) and the post radius (0.25 mm). (III) The Analysis Constraints box allows the user to choose the frequencies to omit or to include and to trim the recordings. (IV) The filter parameters box contains the options to choose how the raw twitch force curve is filtered. Polynomial Order and Frame Size change the level of smoothing during the filtering process. The Peak Detection Threshold slider decides the minimum peak size that will be recognized by the scripts. The Spike Removal option clips tall peaks caused by artifacts. (V) Additional options include Post deflection analysis, which runs an additional peak detection algorithm, Autoscale y-axis on zoom plots, which acts on the twitch force curve, Save force-trace curves, which saves the twitch force figures, and Save force-time data, which saves the plotted twitch force data. (B) Example of the twitch force curve of a 30 s recording of an hECT paced at 1 Hz produced by the GUI screenshot from panel A. The red twitch force curve shows the filtered force produced by the parameters in AIV, superimposed onto the raw twitch force curve (dark blue curve, appears when the Show unfiltered data option in AV is selected).",
    "Abbreviations: hECT = human engineered cardiac tissue; GUI = graphical user interface; PDMS = polydimethylsiloxane. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/64368/64368fig08large.jpg]Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}