{
  "id": 10762,
  "origin_website": "Jove",
  "title": "Multimodal Imaging and Spectroscopy Fiber-bundle Microendoscopy Platform for Non-invasive, In Vivo Tissue Analysis",
  "procedures": [
    "Institutional Review Board approval (IRB #15-09-149) was obtained from the Human Subjects Research program at the University of Arkansas for all aspects of this study. The methods described were carried out in accordance with the approved guidelines, and informed consent was obtained from all participants.\n1. Assembly of the High-resolution Fluorescence Microendoscopy Modality\nNote: The outlined steps for assembly of the high-resolution fluorescence microendoscopy modality can be visualized in Figure 2.\nPlace a 470 nm Dichroic Mirror Inside a 30 mm Cage Cube.\n\t\nObtain a 30 mm cage cube and remove the dichroic filter mount.\nPlace a 470 nm dichroic mirror in the dichroic filter mount.\nRe-insert and secure the dichroic filter mount back inside the cage cube.\nAttach Cage Assembly Rods to the 30 mm Cage Cube.\n\t\nSecure four 1.5 inch cage assembly rods to the front of the cage cube.\nSecure four 3.0 inch cage assembly rods to the right side of the cage cube.\nSecure two 2.0 inch cage assembly rods diagonally on the left side of the cage cube.\nBuild a Cage Plate/Lens Tube Assembly.\n\t\nObtain a 1.0 inch threaded 30 mm cage plate and attach a stress free retaining ring to the inside of the cage plate using the provided threading.\nScrew in a 1.0 inch lens tube to the stress-free retaining ring.\nAttach a second 1.0 inch threaded 30 mm cage plate to the 1.0 inch lens tube and adjust the standard retaining rings so that the two cage plates are flush.\nSlide the 1.0 inch Cage Plate/Lens Tube Assembly onto the Left Side of the 30 mm Cage Cube.\nBuild the right-angle mirror mount assembly.\n\t\nObtain a right-angle mirror mount and a 1.0 inch UV-enhanced aluminum mirror.\nPlace the 1.0 inch UV-enhanced aluminum mirror into the mirror mount and tighten.",
    "Secure four 2.0 inch cage assembly rods to the front of mirror mount\nSecure two 2.0 inch cage assembly rods diagonally on the right side of the cage cube.\nConnect the right-angle mirror mount assembly onto the left side of the 1.0 inch cage plate/lens tube assembly by placing the opposing cage assembly rods through the respective openings of the 30 mm cage plate.\nThread a z-axis translation mount through the 3.0 inch cage assembly rods on the right side of the assembly.\nAttach a 10X achromatic objective lens to the z-axis translation mount.\nBuild a 1.0 inch fiber adaptor plate/xy-axis translation lens mount assembly.\n\t\nObtain an xy-axis translation mount and a 1.0 inch fiber adaptor plate.\nSecure the 1.0 inch fiber adaptor plate into the xy-axis translation lens mount.\nSlide the 1.0 inch fiber adaptor/xy-axis translation lens mount assembly in front of the objective lens.\nObtain two 0.5 inch long, 1.0 inch diameter lens tubes, one 440/40 nm bandpass filter (excitation filter) and one 525/36 nm bandpass filter (emission filter).\nPlace each filter inside a 0.5 inch long, 1.0 inch diameter lens tube, such that the arrow on the outside of the filter is facing the side of the lens tube with the external threads.\nAttach the filters to the assembly.\n\t\nObtain two standard retaining rings.\nSecure the filters inside the 0.5 inch long, 1.0 inch diameter lens tubes with the standard retaining rings.\nScrew in the lens tube with the excitation filter to the front of the 30 mm cage cube and screw in the lens tube with the emission filter to the right-angle mirror mount.\nScrew in the 0.5 inch lens tube with the emission filter to the front of the right-angle mirror mount.",
    "Obtain two 1.0 inch threaded 30 mm cage plates and place them in front of the 0.5 inch long, 1.0 inch diameter lens tubes containing the filters.\nUsing epoxy or strong adhesive, attach a 455 nm LED to the cage plate connected to the excitation filter.\nObtain one 0.5 inch long, 1.0 inch diameter lens tube and a 1.0 inches achromatic doublet tube lens with focal length of 50 mm.\nPlace the tube lens inside the lens tube such that the arrow on the outside of lens is facing the side of the lens tube with the external threads.\nScrew in the tube lens to the assembly.\n\t\nObtain one standard retaining ring.\nSecure the lens inside the 0.5 inch long, 1.0 inch diameter lens tube with the standard retaining ring.\nAttach the lens tube with the tube lens to the left-most cage plate.\nPlace a 30 mm cage plate in front of the 0.5 inch long, 1.0 inches diameter lens tube containing the tube lens.\nAttach a stress free retaining ring to the inside of the 30 mm cage plate.\nAttach a USB monochrome camera to the cage plate with the stress free retaining ring.\nConstruct the optical post mounting devices.\n\t\nObtain four 0.5 inch post holders, four 0.5 inches optical posts, and four mounting bases.\nSecure the 0.5 inch optical posts inside the 0.5 inch post holders.\nSecure the 0.5 inch post holders onto the mounting bases.\nScrew in the four optical post mounting devices to the screw holes located under the 30 mm cage cube, the right-angle mirror mount, the cage plate connected to the LED, and the cage plate connected to the camera.",
    "Screw in the four the optical post mounting devices to either an optical breadboard or optical table to finish construction of the high-resolution fluorescence microendoscopy modality.\nimgsrc://cloudfront.jove.com/files/ftp_upload/54564/54564fig2.jpg\nFigure 2: Assembly of the high-resolution fluorescence microendoscopy modality. The high-resolution fluorescence microendoscopy modality can be constructed by building a shell of 1.0 inch diameter-sized components, with special care taken in handling the dichroic mirror, objective lens, excitation/emission filters, and tube lens. Glass surfaces of these components must be carefully handled using lens paper. Please click here to view a larger version of this figure.[href=http://cloudfront.jove.com/files/ftp_upload/54564/54564fig2large.jpg]\n2. Assembly of the Sub-diffuse Reflectance Spectroscopy Modality\nNote: The outlined steps for assembly of the sub-diffuse reflectance spectroscopy modality can be visualized in Figure 3.\nObtain a tungsten-halogen light source and, using epoxy or a strong adhesive, secure a 1.0 inch threaded 30 mm cage plate onto the front.\nSecure four 3.0 inch cage assembly rods to the cage plate.\nAttach a z-axis translation mount to the cage assembly rods.\nScrew in a 20X achromatic objective lens to the z-axis translation mount.\nBuild a fiber adaptor plate/xy-axis translation lens mount assembly.\n\t\nObtain an xy-axis translation mount and a 1.0 inches fiber adaptor plate.\nSecure the fiber adaptor plate into the xy-axis translation lens mount.\nSlide the 1.0 inch fiber adaptor/xy-translation mount assembly in front of the objective lens.\nBuild the motor arm assembly.\n\t\nObtain the custom-built aluminum motor arm and one SMA fiber adaptor plate.\nScrew in the fiber adaptor plate (with external threading) into the aluminum motor arm (with internal threading).\nAttach the custom-built aluminum motor arm adaptor to the motor arm with four #4-40 0.5 in. screws.\nBuild the motor/motor arm/motor housing assembly.\n\t\nObtain the custom-built aluminum motor housing and the 400-step stepper motor.",
    "Line up the screw holes on the stepper motor and motor housing and then secure with four #4-40 0.5 inch screws.\nFeed the rotating motor rod of the stepper motor through the opening of the motor arm assembly and tighten the locking screw on the aluminum motor arm adaptor.\nBuild the optical switch assembly.\n\t\nObtain the custom-built aluminum optical switch and three 1.0 inch fiber adaptor plates.\nThread the adaptor plates into the threaded holes in the optical switch.\nAttach the custom-built aluminum optical switch face-plate onto the optical switch with four #4-40 0.5 inch screws.\nAttach the motor/motor arm/motor housing assembly to the optical switch by feeding the rotating motor rod of the stepper motor through the central hole of the optical switch.\nObtain an electric circuit board and stepper motor driver, and then place the stepper motor driver across the central groove of the breadboard.\nObserve the electrical connection schematic (Figure 3, 2.12) for the stepper motor driver, 12 V power supply, and stepper motor.\nConnect the stepper motor driver, 12 V power supply, and stepper motor as specified in the circuit diagram (Figure 3, 2.12) to complete construction of the motorized optical switch.\nScrew in the optical switch components and tungsten-halogen light source to an optical breadboard or optical table near the previously constructed (Figure 2, 1.24) high-resolution fluorescence microendoscopy assembly.\nAttach one end of a 550 µm, 0.22 NA patch cable to the 1.0 inch fiber adaptor plate of the motor arm assembly.\nAttach the other end of the 550 µm, 0.22 NA patch cable to the fiber connector of the USB spectrometer.\nScrew in the five distal probe cables to the respective 1.0 inch fiber adaptor plates on the instrumentation to finish completion of the multimodal high-resolution imaging and sub-diffuse reflectance spectroscopy fiber-bundle microendoscope.",
    "Screw in the central 1 mm diameter image fiber cable to the 1.0 inch fiber adaptor plate mentioned in step 1.9.2.\nScrew in the leftmost 200 µm multimode fiber cable to the 1.0 inch fiber adaptor plate mentioned in step 2.6.\nScrew in the 2nd 200 µm multimode fiber cable to the leftmost 1.0 inch fiber adaptor attached to the tungsten-halogen lamp mentioned in step 2.9.2.\nScrew in the 3rd 200 µm multimode fiber cable to the middle 1.0 inch fiber adaptor plate mentioned in step 2.9.2.\nScrew in the 4th 200 µm multimode fiber cable to the rightmost 1.0 inch fiber adaptor plate mentioned in step 2.9.2.\nimgsrc://cloudfront.jove.com/files/ftp_upload/54564/54564fig3.jpg\nFigure 3: Assembly of the sub-diffuse reflectance spectroscopy modality. The sub-diffuse reflectance spectroscopy modality can be constructed using a basic tungsten-halogen lamp coupled to an objective lens to focus light through the 200 µm multimode delivery fiber, and a spectrometer. Additionally, a custom-built motorized optical switch can be constructed within the lamp-fiber-spectrometer path to switch between each SDS. Investigators using multiple spectrometers to acquire from multiple SDSs can bypass the optical switch component. Please click here to view a larger version of this figure.[href=http://cloudfront.jove.com/files/ftp_upload/54564/54564fig3large.jpg]\n3. Calibration of the Sub-diffuse Reflectance Spectroscopy Modality\nNote: The following steps (section 3) must be completed prior to spectral data collection (section 4).\nTurn on all components of the instrumentation, including the 455 nm LED, broadband tungsten-halogen lamp, CMOS camera, USB spectrometer, stepper motor, and motor control board. Ensure the shutter on the tungsten-halogen lamp is open.\nTurn off all ambient light.\nOpen the custom data acquisition software.\nKeep equipment running for 30 min for the lamp reach an appropriate temperature and for inherent noise from the spectrometer to stabilize.",
    "Place a 20% diffuse reflectance standard inside the bottom opening of the custom-built, 3D printed calibration standard device.\nPlace the fiber-optic probe inside the leftmost slot of the custom, 3D printed fiber-holder, demonstrated in Figure 4. The leftmost slot fixes the perpendicular distance from the fiber-optic probe tip to the reflectance standard at 2.1 mm, which is the optimum distance in which the signal reaching the spectrometer is maximized for the first SDS of 374 µm.\nAdjust the motorized optical switch to the left-most position such that the spectrometer is connected to the first SDS of 374 µm.\nSet the integration time to 500 msec. This integration time must be chosen as to not saturate the spectrometer but maintain a practically low integration time.\nAcquire a spectrum, Rmax,374µm, by clicking \"Acquire Spectrum\" in the software.\nClose the shutter on the tungsten-halogen lamp and record a spectrum, Rdark,374µm, of background noise, by clicking \"Acquire Spectrum\" in the software. Once acquired, open the shutter once again.\nPlace the fiber-optic probe inside the rightmost slot of the custom, 3D printed fiber-holder, demonstrated in Figure 4. The rightmost slot fixes the perpendicular distance from the fiber-optic probe tip to the reflectance standard at 3.9 mm, which is the optimum distance in which the signal reaching the spectrometer is maximized for the second SDS of 730 µm.\nAdjust the motorized optical switch to the middle position such that the spectrometer is connected to the second SDS of 730 µm.\nAcquire a spectrum, Rmax,730µm, by clicking \"Acquire Spectrum\" in the software.\nClose the shutter on the tungsten-halogen lamp and record a spectrum, Rdark,730µm, of background noise, by clicking \"Acquire Spectrum\" in the software.\nOpen the shutter once again.\nimgsrc://cloudfront.jove.com/files/ftp_upload/54564/54564fig4.jpg",
    "Figure 4: Calibration of the sub-diffuse reflectance spectroscopy modality. For pre-experimental calibration, the fiber-optic probe tip must be placed at different perpendicular distances from the 20% diffuse reflectance standard depending on the SDS. To consistently achieve these perpendicular distances across all experiments, a calibration standard device was designed (device cross section shown in (a)) to hold the probe at exact distances from the 20% diffuse reflectance standard. In this specific fiber-optic probe setup, light from the tungsten-halogen lamp is shown through the optical switch at source-detector separations of (b) 374 µm and (c) 730 µm (with motor and motor arm removed from the optical path for clarity). Distances of (d) 2.1 mm for the 374 µm SDS, and (e) 3.9 mm for the 730 µm SDS are required for calibration. Please click here to view a larger version of this figure.[href=http://cloudfront.jove.com/files/ftp_upload/54564/54564fig4large.jpg]\n4. In Vivo Data Acquisition and Optical Property Extraction from Human Skin\nIn this section, the multimodal microendoscope technique will be demonstrated on in vivo human skin.\nOpen the custom data acquisition software and adjust the spectrometer integration time by clicking \"Integration Time\" and set it so that it is the same as during calibration, which was 500 msec in this case (step 3.8).\nDetermine the area of skin in which to acquire data, which may differ on the application of the investigator. In this case, the thin skin of the forearm was chosen as a demonstration.\nIf the skin area contains hair, remove the hair with a disposable sterile razor.\nObtain a standard yellow highlighter, which contains pyranine ink, and lightly mark the chosen skin area.\nTurn on the 455 nm LED and close the shutter to the tungsten-halogen lamp.\nPlace the probe in gentle contact with the skin.",
    "Move the probe around on the stained area of tissue to view a live high-resolution feed of apical keratinocyte architecture on the viewing window of the software.\nSelect an appropriate exposure time and gain, 150 msec and 10 dB gain in this case, to avoid image saturation, by clicking \"Exposure Time\" and \"Gain\", typing in the appropriate values, and then clicking \"Apply Settings\" in the software interface.\nAcquire an image by clicking \"Acquire Image\" in the software interface.\nWhile keeping the probe at the same image site, turn off the 455 nm LED and open the shutter to the tungsten-halogen lamp.\nAdjust the motorized optical switch to the left position such that the spectrometer is connected to the second SDS of 374 µm.\nAcquire spectra, Rtissue,374µm, by clicking \"Acquire Spectra\" in the software interface.\nAdjust the motorized optical switch to the middle position such that the spectrometer is connected to the second SDS of 730 µm.\nAcquire spectra, Rtissue,730µm, by clicking \"Acquire Spectra\" in the software interface.\nOpen the custom post-processing software.\nRun the post-processing software by clicking \"Run\" and select the high-resolution fluorescence image, four calibration spectra, and the two in vivo spectra from the folder in which the data was saved when prompted by the software.\n\tNOTE: The custom software obtains the true absolute reflectance (Rabs,374µm and Rabs,730µm) using the following equations.\nimgsrc://cloudfront.jove.com/files/ftp_upload/54564/54564eq1.jpg\nimgsrc://cloudfront.jove.com/files/ftp_upload/54564/54564eq2.jpg\n\tThe post-processing code, as previously described, calculates a fitted curve to the diffuse reflectance spectra (equations 1 and 2) and then determines tissue physiological parameters including ([Hb], [Mel], and SaO2).11,22,24\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}