{
  "id": 6868,
  "origin_website": "Bio",
  "title": "Electrophoretic Mobility Shift Assay of <em>in vitro</em> Phosphorylated RNA Polymerase II Carboxyl-terminal Domain Substrates",
  "procedures": [
    "Expression and Purification of GST-yeast CTD SubstrateNote: GST fusions of the CTDs from various organisms, including Homo sapiens, Drosophila melanogaster, and Saccharomyces cerevisiae, are utilized extensively. The easy availability of synthetic constructs containing defined numbers of heptad repeats greatly simplified cloning. The EMSA method presented here applies to all of these various substrates. However, a universal purification method does not apply to all constructs. We provide a purification protocol for a 6X-HIS tagged GST and Saccharomyces cerevisiae CTD fusions due to their historical precedence, the content of primarily consensus heptad repeats, and extensive use as a model substrate regardless of CTD modifying enzyme origin. Purification schemes for alternative CTD constructs are available throughout published literature and/or should be determined empirically.Subclone GST-yeast CTD sequence (as described in Mayfield et al., 2019) into the pET-28 a (+) vector, or equivalent, using any standard cloning method.Transform sequence-verified plasmid into BL21 (DE3) Competent E. coli cells using conventional methods and select for transformants by growing overnight at 37 °C on an agar plate with 50 μg/ml kanamycin.Inoculate a single colony into 10ml of LB media containing 50 μg/ml kanamycin (10 ml LB + 10 μl 1,000x kanamycin stock) and grow overnight at 37 °C to generate a saturated culture.Inoculate two 1 L flasks of LB containing 50 μg/ml kanamycin (1 L LB + 1,000 μl 1,000x kanamycin stock) with 4 ml of the saturated overnight culture each flask. Incubate at 37 °C with shaking at 180 rpm. Monitor OD600 using UV-Vis spectrophotometry until the cultures reach a value of approximately 0.6-0.8.Induce expression by adding 1 ml of 1,000x IPTG stock and allow the culture to grow at 37 °C with shaking at 180 rpm for an additional four hours.",
    "Harvest cell pellet by transferring culture to appropriate 1 L centrifuge flasks, counterbalancing the flasks if necessary, and centrifuging at 5,000 x g for 20 min at room temperature. Cell pellets can be processed immediately or frozen at -20 °C for up to 1 year.Combine cell pellets from 2 L of growth media and resuspend in 100 ml of Lysis Buffer. Allow pellet to resuspend fully by stirring solution vigorously on ice for 30 min.Lyse cells via sonication using a properly tuned instrument. Sonicate suspended cells on ice using 10 cycles of 30 s continuous sonication followed by 1 min of recovery with constant stirring. In the end, the solution will appear yellowish for an effective sonication.Clear lysate of cell debris by splitting lysate equally among 50 ml centrifuge tubes, verifying they are of equal mass, and centrifuging samples at 10,000 x g for 40 min at 4 °C. Pool supernatant fractions and discard cell debris containing pellets.Apply 5 ml of Ni-NTA His Bind Resin slurry to an empty chromatography column and allow supernatant to flow through. Equilibrate beads with 5 ml of lysis buffer and combine bead/lysis buffer slurry with pooled supernatant fractions. Stir the supernatant with the beads on a stir plate in the cold room for 30 min to ensure protein binding.Apply supernatant/bead mixture to the chromatography column and allow the supernatant to flow through. Collect flow-through and pour it back over the beads one time. Your protein is now bound to the beads.Wash the beads with 100 ml of wash buffer, allowing it to flow through.Elute GST-yeast CTD from the column by adding 10 ml of Elution buffer and allowing the solution to slowly drip from the chromatography column and collect it in a clean 50 ml conical tube.",
    "Verify protein content by mixing 200 μl Pierce Coomassie Plus (Bradford) Assay Reagent with 2 μl of the elution. If protein is present, the solution turns a vibrant blue. Verify protein content and identity using classical SDS-PAGE analysis of the elution. GST-yeast CTD (as described in Mayfield et al., 2019) has a theoretical molecular weight of 48.7 kDa.Transfer eluted protein to SnakeSkin Dialysis tubing and dialyzed against 1 L of Dialysis Buffer overnight at 4 °C.Equilibrate HiLoad 16/600 Superdex 200 pg column with Dialysis Buffer using an FPLC by washing the column with 1.5 column volumes at a flow rate of 1 ml/min.Prepare an Amicon Ultra-15 Centrifugal Filter Unit by adding 5-10 ml deionized water to the unit and spinning the unit at 3,500 x g for 5 min. Discard remaining water on both sides of the molecular weight cut off filter.Apply dialyzed protein to the prepared centrifugal filter unit and centrifuge the unit at 3,500 x g for 10-min intervals at 4 °C until the volume above the molecular weight cut-off filter reaches 1 ml. Transfer the volume above the filter to a 1.5 ml tube and centrifuge at 13,000 x g at 4 °C for 10 min to remove any protein aggregates. Transfer cleared supernatant to a fresh 1.5 ml tube.Inject concentrated sample onto the FPLC and prepared column. Monitor elution absorbance at 280 nm and collect 1 ml fractions beginning at the void volume and ending at 1.2 column volumes. Using the absorbance trace, determine fractions containing GST-yeast CTD and prepare SDS-PAGE samples by mixing 20 μl of the fraction with 20 μl of 2x Laemmli’s Sample Buffer and boiling the samples at 95 °C for 5 min. Verify protein identity and purity using established SDS-PAGE and Coomassie Brilliant Blue staining protocols, similar to those presented below.",
    "Pool fractions containing GST-yeast CTD and concentrate in Amicon centrifugal unit until approximately 10mg/ml as determined by absorbance at 280 nm on NanoDrop. Aliquot to 50 μl fractions to 1.5 ml tubes and flash freeze in liquid nitrogen. Store at -80 °C.In vitro phosphorylation of GST-yeast CTD Substrate using CTD KinasesKinase reactionsCombine stock solutions as follows:5 μl 4x Kinase Buffer (Recipe 8)5 μl 4x GST-yeast CTD Substrate (Recipe 10)5 μl 4x Kinase Solution (Recipes 11, 12, 13 as desired)5 μl 4x ATPInitiate reactions by adding 4x ATP. Incubate reactions in a thermocycler at 30 °C for the desired amount of time. Reaction time to completion is kinase-dependent and should be determined empirically. In our hands, TFIIH and P-TEFb reactions approach completion after approximately 1 h, while c-Abl reactions require approximately 4 h to reach completion. Exact reaction times depend on the kinase, experimental goal, and production lot and should be determined empirically. Completed reactions can be analyzed immediately or stored at -80 °C for up to 1 year.Note: To date, various CTD kinases are commercially available or described in the literature. Here, we provide a reaction condition for studying CTD phosphorylation by three commercially available human CTD kinases/kinase complexes: TFIIH, P-TEFb, and c-Abl. Alternative kinases can also be used, but reaction conditions should be optimized for the kinase of interest. Special attention should be paid to the lot number, and commercial sources of kinases as their individual activity varies widely and require optimization. No kinase control reactionsCombine stock solutions as follows:5 μl 4x Kinase Buffer (Recipe 8)5 μl 4x GST-yeast CTD Substrate (Recipe 10)5 μl Deionized water5 μl 4x ATPInitiate reactions by adding 4x ATP. Incubate reactions in thermocycler at 30 °C for desired amount of time. No kinase control reactions should be run in parallel with the kinase-containing reactions.",
    "Completed reactions can be analyzed immediately or stored at -80 °C for up to 1 year.Preparation of Electrophoresis SamplesNote: Samples for both SDS-PAGE and Semi-Native PAGE are prepared identically. The denaturation/reduction of Semi-Native PAGE samples in Laemmli sample buffer increases the sharpness and resolution of final bands relative to purely native samples. It tends to increase the degree of electrophoretic mobility shift between unphosphorylated and phosphorylated substrates over that observed in SDS-PAGE.Quench reactions by adding 20 μl of 2x Laemmli’s Sample Buffer and boiling at 95 °C for 5 min. This yields approximately 40 μl of the final sample with a GST-yeast CTD substrate concentration of around 0.5 μg/μl.SDS-PAGE (Denaturing/Reducing)Note: 10% acrylamide SDS-PAGE gels are suggested here as they resolve proteins well in the mass range of GST-yeast CTD substrates. Consider alternative acrylamide concentrations when using alternative substrates or a different resolution is desired.Set up the Bio-Rad Mini-PROTEAN Tetra Cell according to factory directions with SDS-PAGE gels (Recipes 18-19) and 1x Laemmli’s Running Buffer (Tris-glycine) (Recipe 20). Load 2 μl (1 μg) of prepared electrophoresis samples to each well, making sure to include both kinase containing and no kinase control reactions. Include a molecular weight ladder.Run the gel at 150 V (constant) for approximately 1 h, or until the dye front reaches the bottom of the gel.Remove the gel from the electrophoresis chamber and glass casting and proceed immediately to Coomassie Brilliant Blue Staining or alternative downstream application.Semi-Native PAGENote: 10% acrylamide Semi-native PAGE gels are suggested here as they resolve proteins well in the mass range of GST-yeast CTD substrates. Consider alternative acrylamide concentrations when using alternative substrates or a different resolution is desired.Set up the Bio-Rad Mini-PROTEAN Tetra Cell according to factory directions with Semi-native PAGE gels (Recipes 18-19) and 1x Native Laemmli’s Running Buffer (Tris-glycine) (Recipe 21).",
    "Load 2 μl (1 μg) of prepared electrophoresis samples to each well, making sure to include both kinase containing and no kinase control reactions. Include a pre-stained molecular weight ladder. The ladder masses are not directly interpretable in Semi-native PAGE but aid in reproducibility of Semi-native PAGE experiments and provide gel progress information if the proteins of interest are not well separated before the dye front leaves the gel.Run the gel at 150 V (constant) for approximately 1-4 h with an ice pack. Long runs may be necessary to obtain well-separated bands, and this time should be optimized for your particular samples.Remove the gel from the electrophoresis chamber and glass casting and proceed immediately to Coomassie Brilliant Blue Staining or alternative downstream application.Coomassie brilliant blue stainingBriefly rinse gel with deionized water. Decant deionized water and add sufficient Coomassie Brilliant Blue stain to cover the gel. Incubate gel at room temperature with gentle agitation for a minimum of 1 h or overnight. Decant Coomassie Brilliant Blue stain into an appropriate container. The stain can be reused multiple times.Rinse gel thoroughly in deionized water to remove residual Coomassie Brilliant Blue stain and cover gel completely with Destain. Incubate gel at room temperature with gentle agitation until stained protein bands become visible, and background is minimal, changing the destain as necessary."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}