{
  "id": 10460,
  "origin_website": "Jove",
  "title": "Brain State-dependent Brain Stimulation with Real-time Electroencephalography-Triggered Transcranial Magnetic Stimulation",
  "procedures": [
    "All experimental procedures described in the following sections have been approved by the Institutional Ethics Committee following the guidelines of the Declaration of Helsinki, and all participants provided written informed consent prior to study enrollment.\n1. Study Participants\nSubject recruitment\nRecruit study participants based on predefined inclusion criteria. Screen candidates for contraindications, such as the presence of implanted medical devices (e.g., cardiac pacemaker), according to TMS safety guidelines21, or for neurological or psychiatric diseases and the use of drugs that act on the nervous system.\nFor studies requiring magnetic resonance imaging (MRI), assess the potential study participants for possible contraindications to MRI according to radiological safety standards22. Perform a power analysis to ensure that the study sample is sufficient for statistical analysis.\nOptionally, preselect subjects having a prominent oscillation of interest in the signal extracted by the chosen EEG montage in order to improve the accuracy of the phase detection.\nNOTE: In this experiment, the C3-centered Laplacian (C3 referenced to the average of the surrounding electrodes CP1, CP5, FC1, and FC5) was used to extract the sensorimotor µ-rhythm with the subject at rest and eyes open. Preselected were subjects having a single peak in the alpha band (8-14 Hz) which contains >25% of total power in the current source density (CSD) power spectrum. This criterion ensured that the oscillation amplitude was sufficiently large in comparison to the background noise (good signal-to-noise ratio [SNR]) to enable the algorithm to estimate the instantaneous phase of the trigger signal with sufficient accuracy and increased the likelihood of observing a significant excitability effect11,12,28,29,30.\nSubject information\nProvide the subjects with the study-related informed consent form. Provide printed TMS and MRI safety screening questionnaires.",
    "NOTE: These documents and the study protocol, as well as the use of personal data (e.g., from questionnaires) and identifiable human data (e.g., from MRI), need to be preapproved by the ethics committee (Institutional Review Board).\nAsk the subject to fill out the TMS and MRI safety screening questionnaires. Acquire written informed consent for participation in the study and the planned use of data.\nAcquire demographic data.\nAssess subject handedness using standard inventories (e.g., the Edinburgh Handedness Inventory)23.\nIntroduce the subject to the setup and stimulation procedure. Ensure that each participant is familiarized with the sensation of TMS and tolerates it well.\nAcquire MRI for each participant prior to the TMS experimental sessions. Whole-head anatomical MR images are required, including the top of the scalp and anatomical landmarks (i.e., the tragus of both ears), as these will serve as fiducial points for neuronavigation in subsequent steps of this protocol.\nSchedule the experimental sessions according to the specifications of the study protocol (i.e., take into account \"washout periods\" between the experiments).\nNOTE: Ideally, subjects should come at the same time and on the same day of the week in protocols comparing different conditions in multiple sessions.\nInstruct the participants to refrain from consuming alcohol, nicotine, or caffeine before the scheduled experimental sessions. The subjects should also have had their regular sleep on the night before the experiment and not be unusually tired.\n2. Setup Preparation\nReal-time-data-stream-capable EEG system\nUse a TMS-compatible EEG/EMG amplifier that can handle the voltage spikes induced by the TMS pulse.\nNOTE: The amplifier system needs to make a raw data stream available at a constant low latency (<5 ms) for subsequent processing by a real-time processor. In this experiment, a 24-bit 80-channel biosignal amplifier was used for EEG and EMG recordings.",
    "Configure the EEG/EMG amplifier system to low-pass filter (e.g., 0.16 Hz cut-off), and down-sample the biosignal data to 5 kHz from the sampling rate at the amplifier head stage.\nEnsure that the amplifier system sends data packets containing the relevant channels via a real-time user datagram protocol (UDP) to the real-time processor at regular constant intervals ≤1ms. Use a high sampling frequency (e.g., 5 kHz) to capture the EMG responses and to minimize filter delay of the EEG data.\nEEG-compatible TMS device\nUse a TMS device that can be triggered externally with a fixed and minimal delay and which minimizes artifacts in the simultaneous EEG recording (e.g., line noise in the EEG through the TMS coil cable, recharging artifacts after the pulse).\nEnsure that the distance between the TMS stimulator (including the coil and coil cable) and the EEG recording system is maximized to reduce electrical interference (at least 1 m). Where possible, turn off sources of electromagnetic interference such as fans and motors. Furthermore, ensure that the EEG and EMG recording leads are positioned and aligned such that common interference cancels out.\nReal-time EEG data processing system\nNOTE: The real-time EEG data stream is acquired and analyzed using a real-time digital signal processing system, which then triggers the TMS device when a predetermined condition is met. Such a system has been custom-developed in our laboratory11 to implement a phase detection algorithm similar to the approach by Chen et al.24 and consists of the following steps.\n\t\nAnalyze a sliding window of data, 500 ms long (Figure 1a), to estimate the instantaneous phase of the target brain oscillation to phase-specifically trigger the TMS stimulator.",
    "Perform bandpass filtering of the window for the frequencies of interest (e.g., between 9 and 14 Hz for the sensorimotor µ-alpha rhythm; Figure 1b). Consider adjusting the filter parameters to the individual peak frequency of the target oscillation.\nRemove any data distorted by the filtering edge effects. Note that there is a trade-off in that stronger filters have larger edge effects.\nUse an autoregressive model to forward predict the signal (Yule-Walker, order 30; Figure 1c).\nApply a Hilbert transform of the resulting window of data to yield the analytic signal, from which the instantaneous phase of the signal is determined by taking the angle of the complex number at the relevant time-point.\nEstimate the EEG power spectrum from the sliding window of data in the frequency bins of interest (e.g., 9-14 Hz) using a short-time Hann-windowed FFT.\nWhen both phase and power meet a predetermined criterion (e.g., a negative peak, the minimum power threshold), generate a digital output (TTL) pulse with the real-time system to trigger the TMS device.\nNeuronavigation system\nTo monitor coil position and achieve accurate and consistent TMS targeting within and across sessions, use a neuronavigation system.\nNOTE: A stereo infrared camera system is used precisely to locate in three-dimensional space reflective trackers, which are mounted on the subject's head and the stimulation coil, enabling precise relative positioning of the coil with respect to the individual's brain anatomy after calibration and MRI registration. For single-session studies and when planning to analyze only the EMG and not the EEG responses to TMS, navigation based on a standard brain instead of an individual MRI is sufficient.\nLoad the individual structural MRI data into the navigation system software prior to starting the experiment for each participant.\nExperimental control computer",
    "Use an experimental control computer that is connected to the EEG system, the TMS device, the real-time device, and the neuronavigation system.\nNOTE: The EEG software controls the EEG amplifier system, sets parameters, and starts and stops EEG data archiving. The TMS device can be remote-controlled to change stimulation parameters (intensity, current direction, etc.) with a remote-control toolbox25.\nRemotely control the real-time device to set the desired trigger conditions.\nNOTE: The neuronavigation system can be remote-controlled, for example to target different coil locations.\nCombine all of the above in an experimental control script to enable the automation of the experimental conditions and control flow.\nEEG recording electrodes\nEnsure that TMS-compatible EEG recording caps with the desired electrode layout are available in different sizes. Measure the subject's head circumference and prepare the appropriately sized cap.\nKeep the required materials for EEG preparation handy (e.g., abrasive and conductive gels, syringes with sterile blunt needles, etc.).\nEMG recording electrodes\nKeep the surface EMG electrodes, leads, and required materials for skin preparation ready.\n3. Conducting the Experiment\nPreliminaries\nEnsure that the required paperwork is in order (study consent form is signed) and that the participant has had no adverse effects since the previous session.\nSeat the subject in a comfortable reclining position to minimize movement of the head during the experiment. A vacuum pillow wrapped around the neck and lower head can help to support the participant's head without causing additional muscle tension (e.g., like a chin rest would do).\nEEG and EMG preparation\nPlace the appropriately sized EEG cap on the subject's head and position the cap correctly. Avoid excessive tension below the chin to reduce cranial and neck muscle activity that could contaminate the EEG26.\nRegister the subject in the EEG recording software.",
    "Prepare the EEG electrodes according to the lab-specific protocol (e.g., apply abrasive gel followed by conductive gel).\nCheck that EEG electrode impedances are below 5 kΩ.\nTo keep the conducting gel from drying up or getting smeared to the adjacent electrodes by any movement of the TMS coil, cover the EEG cap with plastic wrap. Then, fit a net cap above the plastic wrap to keep the cables in a fixed position to reduce EEG-artifact variability, and apply adhesive tape to increase the stability of the multiple layers.\nAttach the surface EMG electrodes over the target muscles after having cleaned and lightly abraded the skin (e.g., use a bipolar recording from the right abductor pollicis brevis hand muscle in a belly-tendon montage).\nNOTE: Here, a bipolar recording from the right abductor pollicis brevis hand muscle in a belly-tendon montage was used. The placement of EMG electrodes is important as surface electrodes generally record activity from multiple underlying muscles.\nVerify the correct matching between the actual EEG sensors on the head and the traces recorded in the EEG system by tapping on a few EEG electrodes to cause artifacts. As a sanity check, verify that occipital alpha increases when the participant closes their eyes.\nVisually inspect the ongoing EEG and EMG signal for artifacts (e.g., line noise, muscle activity) or bad electrodes.\nEnsure that the participant remains awake and keeps their eyes open throughout the experiment to avoid occipital alpha oscillations contaminating the signal.\nPreparation of the neuronavigation\nAttach the reflective head tracker to the participant's head with sufficient adhesive tape to ensure stability throughout the experiment.\nUse the pointer tool to coregister the head model with the relevant anatomical landmarks (e.g. the nasion, the tragi of both ears, the corners of the eyes).",
    "Attach a coil tracker to the stimulation coil and calibrate the coil.\nPlace the pointer at different points on the head surface and verify the correctness of the displayed position on the monitor of the neuronavigation system.\nPinpoint the EEG sensor locations for coregistration with the individual MRI.\nBaseline EEG\nDemonstrate typical EEG artifacts to the subject (e.g., swallowing, chewing, eye blinks) and instruct the subject to avoid them throughout the experiment. Also, ask them to avoid jaw clenching, yawning, or talking.\nAsk the subject to fixate on a point with the eyes open and perform a short recording of resting-state EEG with the eyes open.\nIf required for the computation of real-time filters, record additional EEG activity during tasks.\nFinding the motor \"hotspot\" and determination of the resting motor threshold\nFind the motor \"hotspot\" (i.e. the stimulation location over which single-pulse TMS elicits well-shaped MEPs of a comparably consistent amplitude across trials) and save the corresponding coil position (including coil orientation and angulation) in the neuronavigation system.\nFind the resting motor threshold (RMT) by applying single TMS pulses over the motor cortex at gradually increasing stimulation intensities until the elicited MEPs have peak-to-peak amplitudes greater than 50 µV in more than 50% of the trials21.\nIf available, use an automated script for parameter estimation by sequential testing (PEST), for instance, following a maximum likelihood strategy27 which also provides an online estimate of the confidence interval of RMT based on the observed variability of single responses and which typically requires ca. 30 test pulses of adaptively varying intensity to obtain a robust RMT estimate.\nIf this is not the first experimental session, compare the coil position with the previous position and compare the obtained RMT with the previous RMT to validate consistency.",
    "If required, determine stimulation intensities for the active motor threshold (AMT) or for the 1-mV peak-to-peak MEP amplitude using standard procedures21.\nFinal participant preparation\nOptionally, immobilize the head of the subject using a vacuum pillow.\nOptionally, deliver a masking noise through earplugs (when planning to analyze TMS-evoked EEG potentials). Otherwise, provide the subject with earplugs and headphones for hearing protection.\nOptionally, align and fix the coil at the desired position using a mechanical arm.\nPre-experiment data quality validation\nCheck that the real-time processor is receiving data from the EEG system.\nCheck the signal obtained from the desired EEG spatial filter (e.g., C3-centered Laplacian montage) for obvious artifacts.\nVisually confirm the EEG signal quality, check for bad electrodes, excessive line noise, and muscle artifacts, and adjust the time window and amplitude scaling on the EEG system software for ongoing visual inspection during the experiment.\nMain experimental session\nUnless the stimulator intensity is remote-controlled in the experimental script, manually set the stimulation intensity to the desired value (e.g., 110% of the RMT).\nStart the experimental script to apply pulses at different phases of the target oscillation in a randomized order.\nDuring the experiment, monitor the trigger condition thresholds (artifact-detection threshold, pre-innervation threshold, minimum power, etc.).\nNOTE: Stimuli will be triggered at irregular intervals, as the real-time processor is waiting for the trigger conditions to occur. However, the conditions should be set such that most stimuli occur within a predictable interval (e.g., 2-3 s after the previous pulse), and long pauses (e.g., in this case, >5 s) are avoided as these would lead to larger evoked responses due to novelty.\n\t\t\nAlternatively, use post hoc stratification to remove trials following overly long intervals.\nTo achieve sufficient statistical power to differentiate phase-specific stimulation effects, acquire a sufficient number of trials",
    "NOTE: We typically chose 80-120 interleaved trials per condition20.\nDocument the start and end times of the various sessions and keep a record of any unusual occurrences."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}