{
  "id": 5232,
  "origin_website": "Bio",
  "title": "Subcellular Fractionation Using Accudenz Gradient to Separate ER/Golgi in Yeast",
  "procedures": [
    "Preparation of cell lysateCollect 50 OD of cells and wash once in 10 mM NaN3, 1 mM sodium fluoride (NaF), 50 mM Tris-HCl (pH 7.5), to poison energy-dependent processes. Incubate them in 10 OD/ml 100 mM Tris-HCl (pH 9.4), 50 mM beta-mercaptoethanol, 10 mM NaN3 at room temperature (RT) for 10 min to reduce disulfide bonds in the cell wall.Wash and resuspend in Spheroplasting buffer 30 ~50 OD/ml and incubate at 37 °C until 90% of the cells are converted to spheroplasts (30 ~ 40 min).Centrifuge at 3,000 x g for 5 min to collect spheroplasts. Resuspend in 2 ml of Lysis buffer. Lyse cells in a dounce homogenizer (tight pestle, 15 strokes).Centrifuge lysates at 500 x g for 5 min to clear unbroken cells. Centrifuge twice if necessary.Preparation of Accudenz gradientPrepare gradient solutions in lysis buffer. Generate gradients with the following weight/volume amounts of Accudenz: 1 ml 43%, 1 ml 37%, 1 ml 31%, 1.5 ml 27%, 1.5 ml 23%, 1.5 ml 20%, 1 ml 17%, 1 ml 13% and 1 ml 8%.Measure the refractive index of the standard Accudenz gradient using a refractometer and convert these values to grams per milliliter based on a standard curve generated by five weighed standards. Measure the refractive index of the collected fractions to determine their densities.Fractionation by equilibrium sedimentationIntracellular membranes can be separated on the basis of their characteristic densities, and cofractionation of the protein of interest with a known membrane marker protein can be examined.Load the cleared lysates at the top of the Accudenz gradient (8% - 43%) and centrifuge to equilibrium in a Beckman rotor for 18 h at 170,000 x g at 4 °C. Use slow break.Collect 12 fractions from the top of the gradient; precipitate proteins with 10% TCA. Western blottable:\n﻿0,1,2,3,4,5",
    "Catalog number or source (MP biomedicals),Yeast gene name,Yeast antigen tecognized by antibody,Yeast organelle in which antigen resides,\"Monoclonal or polyclonal, host\",Western blots (g/ml)\nA-6427,Vma 2,V-ATPase 60 kDa subunit,Vacuole membranes,,\nA-6429,Dpm 1,Dol-P-Man Synthase,ER,,\nA-6457,PGK,3-Phosphoglycerate,Cytoplasm,,\n,,Kinase,,,"
  ],
  "subjectAreas": [
    "Cell Biology",
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}