{
  "id": 18118,
  "origin_website": "Jove",
  "title": "Development of Recombinant Proteins to Treat Chronic Pain",
  "procedures": [
    "All animal experiments were performed in accordance with international guidelines and prior approval from the local experimental ethical committee. Whole blood was obtained from the Mini Donor Service (Mini Donor Dienst, MDD) at the University Medical Center Utrecht (UMCU) in the Netherlands. The MDD has received positive approval from the Medical Ethics Committee of the UMCU (Medisch Ethische Toetscommissie) for the protocol number 07-125/C.\n1. Protein Production and Characterization\nCell culture\n\tNote: See the Table of Materials for culture medium used.\n\t\nThaw the HEK293-F cells at 37 °C until there is a small clump of ice. Transfer the thawed cells immediately to 10 mL of ice-cold medium (4 °C) and centrifuge the cell suspension at room temperature (RT) for 4 minutes (min) at 500 x g.\nRemove the medium and resuspend the cell pellet in 10 mL of fresh medium at RT, followed by centrifugation at 500 x g for 4 min.\nRemove the supernatant and resuspend the cell pellet in 5 mL of medium at RT. Add the cell suspension directly into a 125 mL flask containing 25 mL of pre-warmed medium (37 °C). Culture the cells at 37 °C, 8% CO2, and 95% humidity on an orbital shaker rotating at a speed of 125 rpm.\nSubculture the cells twice a week. Use an automated cell counter (see Table of Materials) to assess cell number and cell viability. Seed viable cells at a concentration of 3 x 105 cells/mL into Erlenmeyer flasks. Keep the total volume of the culture medium at 1/5 of the total volume of culture Erlenmeyer flasks at all times to keep aeration optimal.\nTransfection",
    "Note: Subculture the cells three to four times prior to transfection and transfect them when the cell viability is >90%. Cell viability is assessed by an automated (electric field multi-channel) cellcounting system based on the integrity of plasma membrane. See the Table of Materials for the transfection reagent.\n\t\nCentrifuge the cells at RT for 4 min at 500 x g; resuspend the cell pellet in 10 mL of pre-warmed culture medium (37 °C) and dilute the cell suspension to ~1.0 x 106 cells/mL in a total volume of 1 L. Aliquot the cell suspension in 10 aliquots of 100 mL in 500 mL Erlenmeyer flasks.\nDilute 1 mg of plasmid DNA in 33 mL reduced-serum minimal essential medium (MEM, see Table of Materials) by gentle mixing. In a separate tube, dilute 1,330 µL of transfection reagent in MEM by gentle mixing. Incubate both solutions at RT for 5 min. Add and mix the DNA diluted in MEM to the transfection reagent in MEM and incubate the mix for 30 min at RT.\nAdd the DNA- transfection reagent mix to the cells (cultured in section 1); add 6.6 mL of the mix to each 500 mL Erlenmeyer flask containing 100 mL of cells in culture medium. Maintain the cells in the previously mentioned culture conditions. Harvest the culture supernatant containing secreted IL4-10 fusion protein three days after transfection.\nDetermine the concentration of the IL4-10 fusion protein in the culture supernatant by performing an IL10 ELISA according to manufacturer's protocol (see Table of Materials).\n\t\tNOTE: In optimal culture conditions, the concentration of the fusion protein can be expected to be between 2.5 and 5 µg/mL.\nProtein purification by affinity chromatography",
    "NOTE: Affinity chromatography is performed at room temperature. However, all fractions (culture supernatant, load, flow through, and elution fractions) are kept on ice during the procedure.\n\t\nCouple 10 mg of an in-house-made monoclonal antibody against IL4 to 1 g of CNBr- activated sepharose 4B, according to the manufacturer's protocol (see Table of Materials). Pour 2.5 mL of coupled sepharose beads slowly into the glass chromatography column (30 cm length and 1.5 cm inner diameter, see Table of Materials).\nBlock the remaining binding sites of the beads by passing 50 mL of phosphate buffered saline (PBS) containing 1% Bovine Serum Albumin through the column. Wash the column with 25 mL of PBS (pH = 7.4) followed by 12.5 mL of 0.1 M Glycine buffer (pH = 2.5) and 25 mL of PBS (pH = 7.4).\nPass 100 mL of 10-fold concentrated HEK293 cell culture supernatant through the column at a flow rate of 1 mL/min. Wash the column with 50 mL of PBS.\nElute the bound IL4-10 fusion protein with 12.5 mL of 0.1 M Glycine buffer (pH = 2.5) at a flow rate of 1 mL/min and collect fractions of 2.5 mL. Add 350 µL of 1 M Tris buffer (pH = 9) to each fraction to bring the pH to 7. Dialyze neutralized fractions overnight against 2 L of PBS (pH = 7.4).\n\t\t\nUse dialysis tubing with 16 mm dry diameter and a 3.5 K molecular weight cut-off. Sterile filter the dialyzed fractions using disposable filters with 0.45 µM pore diameter. Store sterile IL4-10 fusion protein solution in aliquots at -80 °C.",
    "Evaluate the purity of eluted IL4-10 fusion protein by Coomassie-stained 12% SDS-PAGE gel and HP-SEC (3 µm SEC-2000 column). For HP-SEC analysis, load 40 µL of protein at the concentration of ~1 mg/mL on the column. Use 100 mM Sodium Phosphate Buffer with 150 mM Sodium Chloride (pH = 6.8) as a mobile phase. Set the flow rate at 1 mL/min.\nDetermine the concentration of each batch of purified IL4-10 fusion protein by IL10 ELISA and Bicinchoninic Acid Protein Assay (BCA Protein Assay Kit, see Table of Materials) according to the manufacturer's protocols.\nUse recombinant human IL10 to create a standard curve in the ELISA assay. To correct for the size difference between recombinant IL10 (18 kDA) and IL4-10 fusion protein (34 kDa), multiply the obtained concentration by a factor of 1.8.\nBioactivity of IL4-10 fusion protein\n\tNOTE: The whole blood assay is performed for each batch of IL4-10 fusion protein produced and the activity of different batches is compared as a part of quality control. The whole blood assay is performed in fresh human blood collected the day of the assay in heparin tubes. Blood was obtained from healthy volunteers in our in-house donor service. Samples should be handled as potentially biological hazards.\n\t\nPrepare 3-fold serial pre-dilutions of the purified IL4-10 fusion protein in RPMI medium (see Table of Materials) over a concentration range 5 - 1,215 ng/mL.\nPrepare pre-dilutions of LPS (100 ng/mL) and human blood that is diluted 4 times in RPMI medium.\nPipette the pre-dilutions of the IL4-10 fusion protein, LPS, and human blood into a 48-well plate. To each well, add 50 µL IL4-10 fusion protein (final concentration 1 - 243 ng/mL), 75 µL RPMI medium, 25 µL LPS (final concentration 10 ng/mL), and 100 µL human blood (final diluted).",
    "NOTE: Total volume per well is 250 µL.\nIncubate the plate at 37 °C, 8% CO2, and 95% humidity for 18 h.\nEvaluate the concentration of TNFα in culture supernatants using a TNFα ELISA, according to the manufacturer's protocol.\nCalculate the inhibition of the inflammatory response by IL4-10 fusion protein according to the formula: % inhibition = (1-(A-B)/(C-B)) x 100\n\t\tNOTE: Here A = TNFα levels in LPS stimulated cultures treated with IL4-10 fusion protein, B = TNFα levels in unstimulated culture, and C = TNFα levels in LPS stimulated culture.\n2. Mouse Model for Persistent Inflammatory Pain\nNOTE: It is important to use both male and female mice (C57Bl/6) because this will enable the identification of sex-dependent effects. In general, the mice used are between 8 - 16 weeks old. To determine the number of animals required, power calculations should be performed. Web-based tools to perform such calculations are readily found on the internet (e.g., http://www.powerandsamplesize.com; http://www.sample-size.net).\nInduction of chronic inflammatory pain\n\tNOTE: Induce persistent inflammatory pain in adult mice with intraplantar injections of carrageenan or Complete Freud's Adjuvant (CFA). The different tests do not interfere with each other.\n\t\nPrepare carrageenan (2% w/v) by dissolving λ-carrageenan (see Table of Materials) in 0.9% NaCl by passing the solution through a 23-gauge needle to ensure that the carrageenan is properly dissolved. Prepare a fresh solution directly before the injection is performed.\nAlternatively, if CFA is used, mix the CFA solution properly before injecting it intraplantarly, because the CFA is a water-in-oil emulsion containing 1 mg of Mycobacterium tuberculosis (H37Ra) heat killed and dried, 0.85 mL paraffin oil, and 0.15 mL mannide monooleate (see Table of Materials).\n\t\tNOTE: Glass Hamilton syringes with metal plungers are recommended for injecting this compound because rubber plungers may react with the oil in the adjuvant.",
    "Intraplantar injection\nMaintain the compound (steps 2.1.1 or 2.1.2) in the syringe at RT for at least 15 min before injection to allow adjustment to RT. Inject 20 µL of the compound (or dissolvent as a control) subcutaneously into the hind paw of the non-anesthetized mouse using a 30-gauge needle.\nInsert the needle at the base of the thumb directing to the heel and inject the compound when the needle is inserted approximately 0.5 cm. After injection, slowly retract the needle whilst slightly rotating the syringe to avoid leakage of solution out of the injection site.\n3. Pain Measurements\nNote: Ensure that researchers performing the behavioral experiments are blind to the mouse treatment. It is important to acclimatize the animals to the testing environment before performing any measurement. Preferably, the week before starting the experiments, animals are placed 1 - 2 times for 15 - 30 min in each of the different devices used for performing the tests. When handling males and females in the same experiment, evaluate males independently of females. Clean cages and surfaces extensively between the different groups to avoid potential unwanted effects on behavior of the different sexes. Measure baseline withdrawal latencies or mechanical thresholds two to three times to accurately determine baseline thresholds and identify whether these are stable before intraplantar injection of any compound.\nVon Frey test: mechanical sensitivity to innocuous stimuli\nPlace the animals individually into acrylic cages on a wire mesh stand and allow the mice to acclimatize for at least 15 min prior to measurements.",
    "Assess mechanical sensitivity by measuring the paw withdrawal threshold in response to a calibrated series of von Frey hairs ranging from 0.02 to 4 g. Consider any movement of the paw away from applied hair as a positive withdrawal response. Apply the filaments perpendicular to the paw surface with sufficient force to cause slight bending against the skin and hold for ~3 s. Make sure the hair does not twist during application to the paw.\nCalculate the 50% paw-withdrawal threshold using the up-and-down method15,21.\n\t\tNOTE: The first filament to apply is 0.4 g (other starting filaments may be used depending on the thresholds these mice display at baseline). A lack of response to a filament indicates that the next thicker filament is used in the following stimulation, while a positive response indicates the use of the next thinner filament. The number of hair presentations is determined by the first differential response; after that, 5 more applications are performed. Calculate the 50% threshold according to the methods described previously15,21.\nThermal sensitivity: Hargreaves test\nPlace the animals into cages on a pre-warmed (30 °C) glass plate and allow the mice to acclimatize for at least 15 min prior to measurements, waiting until the animals sit still.\nDetermine heat withdrawal latency times by heating the paw of the animals by a focused visible light beam using a Hargreaves apparatus (see Table of Materials).\n\t\tNOTE: The intensity of the beam is set to 12%, because with this experimentally determined intensity setting, the light beam evokes a withdrawal response of an average time of 8 s at baseline on C57Bl/6 mice. The intensity setting should be determined per individual machine and mouse strain. Maximal cut-off times of 20 s or more are used to avoid injury to the animals.",
    "Measure the withdrawal latency times ~4 times per animal. Average all responses measured. Measure each paw independently, and with at least 1 min intervals between subsequent measurements in the same paw.\nPostural deficits: dynamic weight bearing test\nMeasure the body weight of each animal before the test, since weight bearing analysis requires the body weight of each individual animal as an input parameter.\nPlace the animals individually in a floor-instrumented dynamic weight-bearing system assembled onto a cover supporting a camera that will record mouse movements. Let the animal acclimatize for 0.5 to 1 min before recording for 5 min.\n\t\tNOTE: In this test, only one freely moving animal can be evaluated at a time.\nAdjust settings to perform weight bearing and analyze the data.\n\t\tNOTE: In these experiments, we use the following parameters: (i) Low weight threshold of 0.6 g: this is the minimum weight necessary to activate one of the cells of the sensor. (ii) High weight threshold of 1 g: this number indicates the weight needed to fully activate one cell. (iii) Surface threshold of 2 cells: this number indicates the number of cells adjacent to each other that need to be activated to be taken into account. (iv) Minimum number of images is 5: it takes 0.1 s to capture every image. The number indicates the minimal number of frames in which the mouse does not move. As such, a value of 5 means that the mouse posture needs to be stable for >0.5 s to obtain a measurement that is taken into account for analysis.\nPerform the analysis of each video by replaying the video, and ensure that each limb is recognized correctly by the software at the time frame indicated by the software.",
    "NOTE: A minimum of 1 min of the recorded time needs to be validated. The dynamic weight bearing software calculates and provides the following parameters: (i) The weight borne by each individual paw in grams, and as a percentage of the whole body's weight. (ii) The weight borne by the combined front paw or the combined rear paws in grams and as a percentage of the whole body's weight. (iii) The ratio of left/right paws weight bearing or front/rear weight bearing. (iv) The surface area of each paw or combined front/rear paws that activated the pressure sensitive pad. (v) Mean and standard deviation for each parameter. (vi) Duration of different postures (rearing, 3 paws, or 4 paws) during the whole experiment. (vii) Time (s) each paw carries weight during the whole experiment.\n4. Intrathecal Injection of IL4-10 fusion protein for analgesia\nNOTE: Confirm that the ventilation to the room is open to ensure proper air flow. To test the efficacy of the IL4-10 fusion protein (1 µg/mouse; 5 µL total injection volume) it should be tested against vehicle injections and injections of the combination of the individual cytokines (IL4 + IL10, 0.5 µg + 0.5 µg/mouse, 5 µL total injection volume).\nAnesthetize the mouse with 3 - 4% isoflurane with an oxygen flow rate of 2 L/min in the induction chamber. Check that the mouse is properly anesthetized by pinching the paw to ensure that the animal is not responsive.\nPlace the mouse on the table with its head placed in the nose cone of the apparatus and maintain the mouse sedation with 1.5 - 2% isoflurane with an oxygen flow rate of 2 L/min whilst performing the intrathecal injection.\nBack-fill the injectable compounds into a clean 25 µL glass Hamilton syringe connected to a 27-gauge needle.",
    "Hold the mouse firmly by the spine posterior to the ribs and slightly lift the mouse. Place the needle vertically between the lumbar vertebrae L5 and L6 and carefully insert it through the skin right at the middle of the lumbar vertebrae. Place the needle into the intervertebral space.\n\t​NOTE: Finding the intervertebral space may require some 'searching' by move the needle along the rostral ventral axis, lightly pressing the needle until a loss of resistance of bone tissue is felt.\n\t\nConfirm correct targeting by verifying that a tail flick occurred. Inject 5 µL of the compound slowly, wait a couple of seconds, and then slowly retract the needle. If only a single paw flick is observed, the needle is likely not placed correctly.\nAfter injection, check the mouse closely for the first 30 min after recovery from anesthesia to ensure the absence of any motor impairment/paralysis.\n\tNOTE: Pain behaviors can be measured (as described in section 3) 15 minutes after recovery.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}