{
  "id": 6190,
  "origin_website": "Bio",
  "title": "HCV Reporter System (Viral Infection-Activated Split-Intein-Mediated  Reporter System) for Testing Virus Cell-to-cell Transmission <em>ex-vivo</em>",
  "procedures": [
    "Construction of HCV reporter system (VISI system) cell lineThe mechanism and construction of VISI system have been described in detail in our research paper (Zhao et al., 2017). The materials (plasmids and cell lines used in VISI system) are available upon request from our lab.Plasmid constructionTechnically, most reporters are applicable to VISI system, such as green fluorescent protein (GFP), red fluorescent protein (RFP), luciferases, antibiotic-resistant proteins. Here, we chose two different fluorescent proteins: green fluorescent protein (GFP, green signal) and mCherry (red signal), for HCV reporter system construction (VISI-GFP/VISI-mCherry). N/C-terminal sequences of VISI are inserted into lentiviral vectors pWPI-blasticidin or pWPI-puromycin, respectively.Note: These four DNA sequences have been uploaded (Genbank: KY067203 [N-terminal of VISI-GFP], KY067204 [C-terminal of VISI-GFP], KY067205 [N-terminal of VISI-mCherry], KY067206 [C-terminal of VISI-mCherry]).Generation of Huh7.5.1-VISI by lentiviral transductionLentiviral productionDay 1:Plate 1.2 x 106 293T cells in complete DMEM into a 6 cm dish.Day 2:Replace the medium with 4 ml fresh complete DMEM and warm up the solutions of calcium phosphate (CaPO4) transfection (2x HEPES solution, 2.5 M calcium chloride solution, sterile H2O). After 1-2 h, dilute 15 μg DNA (pWPI vector:psPAX2:pMD2.G = 6.4 μg:6.4 μg:2.1 μg) in a final volume of 270 μl sterile H2O, and add 30 μl calcium chloride solution (2.5 M). Then vortex the mixed liquid gently and add 2x HEPES solution (300 μl) drop by drop simultaneously. Finally transfer the mixture into a 6 cm dish by dropwise, gently shake to distribute the precipitate evenly.Day 3: Change the medium with 4 ml fresh complete DMEM at 16 h post calcium phosphate transfection.Day 4: Harvest the supernatant (lentivirus) at 48 h post calcium phosphate transfection, after filtration with 0.45 μm filter, store in aliquots at -80 °C.These lentiviral preparations are used to transduce the targeted cell line Huh7.5.",
    "1 of which 5 x 105 cells are seeded into a 6-well plate. Eight hours after transduction, discard the lentiviral preparation and replace with fresh complete medium. Two days later, resuspend the transduced cells and transfer them into a 10 cm dish. Then add antibiotics after cell adhesion.After selection by both puromycin (1 μg/ml) and blasticidin (4 μg/ml) for days, Huh7.5.1-VISI-GFP and Huh7.5.1-VISI-mCherry cell lines will be successfully obtained, respectively.Construction of cell model for testing cell-to-cell transmissionWe choose Huh7.5.1-VISI-mCherry as donor cells that were electroporated with purified HCV RNA. Huh7.5.1-VISI-GFP is used as recipient cells which could receive virus genome from donor cells.First, Huh7.5.1-VISI-mCherry is electroporated with in vitro transcripts of HCV (Jc1) or subgenomic JFH1 (sgJFH1) which in vitro transcripted from HCV infectious clone pFK-JC1 or subgenomic construct pFK-sgJFH1 (Long et al., 2011). These two HCV genomes could be the positive and negative control of this experiment.pFK-JC1 and pFK-sgJFH1 are linearized by restriction enzyme Mlu1 or Xba1 respectively. Assemble transcription reaction at room temperature (1 μg linearized template, 2 μl Enzyme Mix, 2 μl ATP solution, 2 μl CTP solution, 2 μl GTP solution, 2 μl UTP solution, 2 μl 10x Reaction buffer, Add proper amount of Nuclease-free water to 20 μl), Mix thoroughly and incubate for 3 h at 37 °C.Then add 1 μl DNase to digest the template and incubate for 15 min at 37 °C.Lithium Chloride (LiCl) precipitation can be used to purified transcriptional RNA. Add 30 μl LiCl precipitation solution and chill for 1 h at -20 °C, then centrifuge for 15 min at maximum speed to pellet the RNA.After wash twice with 70% ethanol, resuspend the RNA pellet with 20 μl RNase-free water. And store in 10 μg aliquots at -80 °C.",
    "Add 10 μg of in vitro transcripts (RNA) with the cell suspension–5 x 106 Huh7.5.1-VISI-mCherry cells are resuspended in 400 μl cytomix buffer (Recipe 2). Then the cells are transfected by electroporation at 960 mF and 270 V using Bio-Rad Gene Pulser system and a cuvette with a gap width of 0.4 cm (Bio-Rad). Immediately after electroporation, resuspend the cells in complete DMEM and seed as required.Electroporated Huh7.5.1-VISI-mCherry are individualized and mixed with Huh7.5.1-VISI-GFP cells at a ratio of 1:30.Note: For single well of 96-well plates, it needs 1,000 Huh7.5.1-VISI-mCherry cells plus 30,000 Huh7.5.1-VISI-GFP cells.Culture the cells in the presence of HCV-neutralizing antibody AR3A at 50 μg/ml to block cell-free transmission (Figure 1B). Replace antibody-containing medium every 24 h.After co-culture for 72-96 h, HCV cell-to-cell transmission efficiency can be evaluated by capturing the fluorescent images and examining the number of GFP or mCherry glowing cells.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180719/20180719021727_2116.jpgFigure 1. Schematic diagram of VISI system and HCV cell-to-cell transmission system. A. Fusion proteins of N-terminal and C-terminal halves of VISI are located in nucleus and mitochondria by different location signal (nuclear localization signal [NLS] or IPS), respectively; upon virus infection, HCV NS3-4A cleavage activates transportation of the C-terminal piece from mitochondria to the nucleus where intact GFP is reconstituted through split-intein splicing. B. Huh7.5.1-VISI-mCherry cells electroporated with the HCV genome are used as donor cells; and Huh7.5.1-VISI-GFP cells are used as recipient cells. Donor cells are co-cultured with recipient cells at a cell number ratio of 1:30. To block cell-free transmission, we added HCV-neutralizing antibody AR3A into the supernatant. After incubation for 96 h, images are taken under a fluorescence microscope (Figure 2A)."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}