{
  "id": 2173,
  "origin_website": "Cell",
  "title": "NADH-independent enzymatic assay to quantify extracellular and intracellular L-lactate levels",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nSample collection\nTiming: 30 min\nLactate extraction from intracellular and extracellular fractions is a key step. To this end, proper quenching of interfering enzymatic reactions and removal of endogenous enzymes is achieved using acidic extraction.\nTwo methods are proposed according to cell types:\nNon-adherent cells:\nCollect 2 mL cells in their culture medium in a 2 mL Eppendorf tube kept on ice for 5 min and centrifuged at 1,000 g and 4°C, for 5 min.\nCollect the supernatant containing cell culture medium (extracellular lactate fraction) in a new tube.\nWash the cell pellet with PBS and centrifuge as performed in step 1.\nCollect the cell pellet (intracellular lactate fraction) quenched in 100 μL of 14% PCA w/o EDTA and incubate 5 min on ice.\nCentrifuge at 20,000 g and 4°C for 1 min and collect the supernatant containing intracellular lactate.\nNeutralize the supernatant to pH 7.4 with KOMO solution.\nFor extracellular lactate quantification, check the pH of cell culture medium collected in step 2 and if required, adjust with HEPES solution. The final volume is 450 μL.\nAdherent cells:\nCollect the medium (extracellular lactate fraction) and wash cells with PBS.\nScrape cells in PBS, and collect them in a 15 mL Falcon tube kept on ice.\nCentrifuge at 1,000 g and 4°C, during 5 min.\nRemove the supernatant and collect the pellet (intracellular lactate fraction) quenched in 100 μL of 14% PCA w/o EDTA.\nCentrifuge at 20,000 g for 1 min and collect the supernatant containing intracellular lactate.\nNeutralize the supernatant to pH 7.4 with KOMO solution.\nFor extracellular lactate quantification, check the pH of cell culture medium and if required, adjust with HEPES solution. The final volume is 450 μL.",
    "Note: After acidic precipitation and neutralization, samples can be stored at −20°C, and lactate levels are stable over several months.\nNote: Initial volume of medium in the culture dish or well should be reported and used to calculate the final concentration of extracellular fraction.\nNote: Resuspension volume as well as PCA and KOMO volume used during acidic extraction of the pellet should be reported and used to calculate the final concentration of lactate in the intracellular fraction.\nDetermination of the total protein content in extracted samples using the BCA kit protocol\nTiming: 40 min\nThe intracellular L-lactate level is normalized to the amount of protein recovered in the pellet after protein precipitation with PCA. In this protocol, the PierceTM BCA Protein Assay kit is used in 96-well plate.\nPrepare mix following BCA assay protocol.\nIn a 96-well plate, add the mix in 5 wells with a defined quantity of BSA: 0, 5, 10, 15, 20 μg (200 μL final/well).\nAdd 190 μL of mix in wells and add 10 μL of sample (intracellular fraction only) per well.\nIncubate the plate at 37°C during 30 min.\nMeasure absorbance at 562 nm (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1650-Fig2.jpg\nFigure 2. Protein quantification\nProtein measurement is performed according to the PierceTM BCA Protein Assay kit recommendations. First and second columns (4A to 4E and 5A to 5E) contain the BSA standard titration and third column (6A to 6D) contains intracellular (2A-B) and extracellular (2C-D) samples in duplicate.\nMeasurement\nTiming: 40 min",
    "To quantify the absorbance signal and validate that the absorbance values are comprised within a range where absorbance is proportional to the L-lactate level, a standard curve is systematically performed. Two independent measures were performed for each sample. Moreover, to further validate the absence of interfering reaction in the extract, an internal control (50 pmol of L-lactate standard) was added at the end of each reaction. Absorbance measurement is performed at 572 nm, using 22 flashes (0.5 s) per well.\nPrepare enzyme master mix and keep it on ice.\nStandard curve\nIn a 96-well plate, add the master mix in 5 wells with a defined quantity of L-lactate: 0, 50, 100, 200, 2,000 pmol (200 μL final/well).\nStep 21 is repeated to replicate measurement of standard curve with 0, 100, 200, 400, 2,000 pmol.\nHomogenize quickly by flushing 2–3 times with a P200 pipette and incubate 5 min at RT before the measurement (Figure 3[href=https://www.wicell.org#fig3] and Table 1[href=https://www.wicell.org#tbl1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1650-Fig3.jpg\nFigure 3. Lactate measurement with one or four additions of samples",
    "The first and second columns (1A to 1E and 2A to 2E) contain standard curve with L-lactate. The third and fourth columns (3A to 3E and 4A to 4E) is standard curve with D-lactate. In the first and the third columns, lactate amount in wells are 0, 50, 100, 200, and 2000 pmol. In the second and the fourth columns, lactate amount in wells are 0, 100, 200, 400 and 2,000 pmol. The fifth column (5A to 5F) is sample quantification in this order: measurement of intracellular for control (5A and 5E) and treated with MCTs’ inhibitors (5B and 5F) and extracellular fraction for control (5C and 5G) and treated with MCTs’ inhibitors (5D and 5F), in duplicate. The seventh column (7A to 7F) is identical to column 5 but does not contain L-LOX in the master mix. Samples volume is 10 μL per well.\ntable:files/protocols_protocol_1650_9.csv\nL-lactate quantification (simultaneously)\nAdd 190 μL of master mix and 10 μL of sample per well. Inhibitor cocktail of lactate transporters are used to challenge this quantification during cell culture step 29 (Table 2[href=https://www.wicell.org#tbl2]).\ntable:files/protocols_protocol_1650_10.csv\nStep 24 is repeated to replicate measurement of each sample.\nHomogenize quickly by flushing 2–3 times with a P200 pipette and incubate 5 min at RT before the measurement (Figure 3[href=https://www.wicell.org#fig3]).\nInternal control quantification\nAdd 50 pmol of L-lactate standard in well with samples.\nNote: As presented above, D-lactate was used to verify the specificity of the L-Lactate Oxidase from Aerococcus viridans for L-lactate. Our results demonstrated that this enzyme is highly specific for L-lactate as Amplex red is not converted in resorufin in the presence of D-lactate (Figure 3[href=https://www.wicell.org#fig3]). The standard curve as well as the samples reads should be performed at least in duplicates.",
    "Critical: In order to keep the values of sample measurement from extracellular fraction in a standard range, a 1/100 dilution is carried out.\nNote: This protocol is described for a measurement in a 96-well plate but can be adapted to other spectrophotometric fluorometric measurement methods.\nControl section\nTiming: 3 days\nSyrosyngopine (10 μM) and AR-C155858 (100 nM) are well validated inhibitors of lactate transporters (MCT1, MCT2 and MCT4 (Benjamin et al., 2018[href=https://www.wicell.org#bib2]; Nancolas et al., 2015[href=https://www.wicell.org#bib7]; Ovens et al., 2010[href=https://www.wicell.org#bib8]).\nStep-by-step procedure to use MCT inhibitor in cell culture\nSeeding.\nSeed 8 × 106–107 cells per well in non-adherent conditions and between 0.5 × 106 to 106 cells per well in adherent conditions in a 6-well plate with 2 mL of cell culture medium.\nTreatment.\nDirectly in the well, add inhibitor under the indicated conditions (10 μM final for syrosyngopine and 100 nM final for AR-C155858).\nIncubation.\nTreated cells are incubated at 37°C, under 5% CO2 for 3 days before collecting cell to perform experiments.\nNote: Our results showed that, as expected, MCT inhibitors increase intracellular L-lactate and decrease extracellular lactate levels, validating that these inhibitors counteract the L-lactate secretion in the extracellular compartment (Table 2[href=https://www.wicell.org#tbl2])."
  ],
  "subjectAreas": [
    "Cell Culture",
    "Metabolism",
    "Cell Biology",
    "Protein Biochemistry"
  ],
  "bigAreas": [
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}