{
  "id": 3769,
  "origin_website": "Cell",
  "title": "Quantification of zinc intoxication of Candida glabrata after phagocytosis by primary macrophages",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPreparation of immune cells and fungal cells: day 1\nTiming: 2–3 h\nBMDMs are seeded into wells and Candida cultures are started for next-day interaction.\nIn the morning, pick one fungal colony with a sterile tip and inoculate into 5 mL liquid YPD medium in culture tubes (Starlab). Let the cells grow in the tube for 4–8 h at 30°C with agitation (200 rpm) at an angle of 45° (Innova 44 New Brunswick Scientific).\nMeasure the optical density at 600 nm (OD600) in a spectrophotometer (U-2000 Hitachi) to follow growth. To stay in the linear range of the spectrophotometer for the measurement, dilute the fungal cell suspension 1:10 with fresh YPD.\nAdjust fungal cells to reach logarithmic growth phase (OD600 = 0.8–1) at the time of harvest on the next day with the formula: imgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/489-Si1.jpg\nNote: This formula works if the doubling time of C. glabrata is around 1 h. It is highly discouraged to use fungal cell suspensions with OD600 above 2. In this case, new fungal cultures should be set up.\nLet cells grow in the tube for 14–17 h at 30°C with agitation (200 rpm) at an angle of 45° (Innova 44 New Brunswick Scientific).\nNote: 1 mL YPD culture at OD600 = 1 contains 1 × 107 C. glabrata cells. Hence, set up enough culture volume to have sufficient numbers on the next day. It is advisable to include a tube filled with liquid YPD only, when inoculating Candida to exclude media contamination.\nHarvest differentiated BMDMs by gently scraping them off the culture dish with a natural-rubber spatula (Deutsch & Neumann) into a 50 mL conical tube (Starlab); pellet BMDMs at 300 × g for 6 min at RT (Rotina 38R Hettich).",
    "Resuspend macrophages in 1 mL fresh macrophage medium and take out an aliquot to count in a CASY cell counter. Seed 2 × 105 macrophages/well into a 24-well plate (Starlab) at least in triplicates for each experimental condition. Troubleshooting 1[href=https://www.wicell.org#sec7.1]\nAdd macrophage medium at a final volume of 1 mL/well; let BMDMs equilibrate 17 h at 37°C, 5% CO2 (CB-S 170 Binder).\nNote: Macrophage medium should be pre-warmed to 37°C to minimize temperature stress.\nInteraction and staining: day 2\nTiming: 6–18 h\nImmune cells are infected with fungal cells, harvested, and stained.\nHarvest Candida cells when OD600 = 1 is reached by transferring the fungal suspension into a 50 mL conical tube (Starlab).\nTake a small aliquot to check for morphology of the fungal cells and possible contaminations under the microscope.\nPellet fungal cells at 3,000 × g for 2 min (5702R Eppendorf).\nDiscard the supernatant and resuspend the cells in the same volume of PBS.\nRepeat the centrifugation and remove supernatant.\nResuspend the fungal pellet in 1 mL PBS.\nTake a small aliquot of 10 μL to determine the cell count in a CASY cell counter.\nSuspend fungal cells in macrophage medium at a final cell number of 4 × 106 counts/mL. This gives a multiplicity of infection (MOI) = 1 when adding 50 μL/well of this suspension to immune cells.\nFor a heat-killed Candida control (see Expected outcomes[href=https://www.wicell.org#expected-outcomes]), take a culture aliquot of 150–200 μL and transfer it into a new 1.5 mL microcentrifuge tube (Eppendorf). Heat-stress fungal cells by placing them on a thermomixer (Eppendorf Thermomixer comfort) at 65°C for 1 min.\nNote: All centrifugation steps and reagents are at RT.\nInfect macrophages by adding 50 μL of Candida suspension/well (2 × 105 C. glabrata cells).",
    "Incubate host-pathogen mixtures in the incubator (CB-S 170 Binder) at 37°C, 5% CO2.\nCritical: The time, BMDMs are outside the incubator should be kept to a minimum to avoid major temperature changes.\n15 min before the end of the infection, prepare a 10 μM Zinpyr-1 solution (as described in Materials and equipment[href=https://www.wicell.org#materials-and-equipment]) and store at RT in the dark.\nCritical: Zinpyr-1 is a light sensitive probe and the prepared Zinpyr-1 solution should be stored in the dark until use.\nAfter 2–12 h of infection, aspirate culture medium.\nNote: Optimal endpoints can vary, depending on the macrophages and Candida strains used and should be tested for every new setup.\nGently wash each well 3× with 1 mL PBS at RT.\nNote: At least three washing steps are needed to get rid of extracellular Candida cells, which would interfere with the readout of the assay. Discarding the PBS can be done by inverting plates and applying reasonable force to decant, as macrophages are very adherent to the plastic.\nAdd 300 μL of the Zinpyr-1 solution/well and incubate cells for 30 min at 37°C, 5% CO2.\nDecant supernatant and wash 3× with 1 mL PBS at RT.\nTo lyse macrophages and liberate phagosomal Candida cells, put the plate on ice, add 300 μL of the SDS solution/well and incubate for 15 min at 4°C.\nNote: SDS lysis to remove immune cells like macrophages is only possible for pathogens that are not susceptible to the applied SDS concentrations. This should be tested before the assay.\nDuring step 23, pre-cool a tabletop centrifuge (5424 R Eppendorf) to 4°C.\nFill up every well with ice-cold PBS to 1 mL and harvest C. glabrata via pipetting. Transfer volume of each well into a separate 1.5 mL microcentrifuge tube (Eppendorf).",
    "Critical: Pipet bottom of the wells vigorously and make sure to include the entire bottom of each well. Candida spp adhere easily to plastic surfaces and thus need gentle force for removal.\nPellet fungal cell suspension at 21,000 × g for 10 min at 4°C (5424 R Eppendorf).\nDuring step 26, prepare a fresh PI solution (2 μg/mL) as described in Materials and equipment[href=https://www.wicell.org#materials-and-equipment].\nAspirate supernatant and resuspend pellet in 200 μL PI solution.\nIncubate for 5 min at RT in the dark.\nAdd 800 μL ice-cold PBS to a final volume of 1 mL and pellet at 21,000 × g for 10 min at 4°C (5424 R Eppendorf).\nCarefully aspirate supernatant and wash fungal pellet 2× with 1 mL ice-cold PBS.\nResuspend fungal cell pellet after the last washing step in 300 μL PBS.\nNote: To avoid loss of fungal cells in steps 30 and 31, centrifuge each time with 21,000 × g for 10 min.\nAnalyze Candida cells right away on a flow cytometer.\nDiscriminate Candida cells from debris by morphology and granularity, by setting proper forward (FSC-A) and side scatter (SSC-A) gates surrounding the dense cell population (see Expected outcomes[href=https://www.wicell.org#expected-outcomes]). Troubleshooting 2[href=https://www.wicell.org#sec7.3]\nExclude doublets by plotting FSC-A against FSC-H and gate on the dense population.\nAnalyze PI+ (dead) population against Zinpyr-1+ population. Troubleshooting 3[href=https://www.wicell.org#sec7.5]\nNote: Zinpyr-1 has an excitation and emission spectrum peak wavelengths of approximately 488 nm and 525 nm, respectively. PI is excited at 561 nm and detected at 610 nm."
  ],
  "subjectAreas": [
    "Cell-Based Assays",
    "Immunology",
    "Microbiology",
    "Flow Cytometry"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}