{
  "id": 2055,
  "origin_website": "Cell",
  "title": "Applying imaging flow cytometry and immunofluorescence in studying the dynamic Golgi structure in cultured cells",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nCell culture and mitosis induction\nTiming: 2 days for nocodazole—3 days for thymidine treatment\nIn this section we describe how to culture HeLa cells for IF or ISX and treat them to induce mitosis.\nNote: All reagents used to treat cells such as complete medium (10% fetal calf serum in DMEM and supplements; termed here complete medium) or phosphate buffered saline (PBS) are warmed at 37°C prior to use.\nNote: Microscope cover slips are autoclaved prior to use to ensure sterilization.\nFor IF, seed 2–4 × 105 HeLa cells per well in a 12-well culture dish containing one 18 mm diameter sterile microscope cover slip and complete medium in each well.\nFor ISX, seed 5 × 105 HeLa cells in a 60 mm plate in complete medium.\nPlace cells at 37°C humidified atmosphere with 95% air and 5% CO2 incubator. Cells allowed to attach for approximately 18–20 h.\nNote: Optimal cells confluency is critical. Cell number and complete medium type were optimized for HeLa cells. When other cells are used, each line should be optimized individually to reach 70%–80% confluency the day following seeding in its optimal complete medium. This is because mitosis-inducing treatment may cause cells detachment. Detachment may also occur when siRNA or overexpression transfection are applied. A lower cell density may result in either insufficient number of cells following treatment, or insufficient number of transfected cells.\nCells synchronization at prometaphase using nocodazole:\nBlock mitotic progression (end of prometaphase) by adding nocodazole directly into the complete medium of the relevant wells (IF)/plates (ISX) at a final concentration of 0.3 μM. Incubate for 16 h.\nControl cells are left untreated, containing complete medium only.\nAlternatively, cells can be synchronized by a double-thymidine block:",
    "Treat cells by directly adding thymidine to a final concentration of 2 mM into the complete medium of the relevant wells/plates. Incubate for 16 h.\nAspirate complete medium containing thymidine, and rinse plates twice with PBS by applying and immediately aspirating it.\nAdd complete medium for 8 h. This step completes one thymidine block cycle.\nRepeat the thymidine treatment for an additional cycle of 16 h.\nWash twice with PBS as mentioned above and apply fresh complete medium. This marks time 0.\nContinue growing the cells under regular conditions.\nNote: For the double-thymidine block, save an unwashed plate. This will represent cells at the G1/S border.\nOptional: When smaller plates or wells are used and total volume is reduced, it is recommended to aspirate medium and add a fresh complete medium that already contains nocodazole or thymidine diluted to the desired concentration. This will ensure homogenous distribution of the reagents.\nDetermining Golgi structure in synchronized HeLa cells by IF\nIn this section we describe the protocol for immunostaining HeLa for Golgi marker followed by imaging acquisition using fluorescence microscopy.\nCell fixation by paraformaldehyde for IF\nTiming: 40 min\nCarefully aspirate the complete medium from each well.\nWash cells once with PBS to remove any residual medium. Immediately aspirate PBS.\nFix cells with 4% paraformaldehyde (PFA) in PBS, 1 mL per well and incubate for 20 min at room temperature (22–25°C, RT).\nNote: Since cells might be more susceptible to detachment due to previous treatments, it is recommended to carefully apply all solutions and washes on the edge of the well and not directly on cells.\nRemove PFA and add PBS for 5 min at RT. Repeat wash with PBS for a total of three times to remove all residual PFA.",
    "Pause point: Cells can be kept following fixation in PBS at 4°C for up to 2 weeks before proceeding to the next step.\nImmunofluorescence staining for IF\nTiming: 3 h\nPermeabilization / Blocking: permeabilize cells with Triton X-100 and block with bovine serum albumin (BSA) by applying 1 mL of blocking-permeabilization solution per well. Incubate for 5 min at 23°C.\nOptional: This step may be separated to a permeabilization step (0.1% Triton X-100 in PBS, 5 min at 23°C), which is followed by a blocking step (2% BSA in PBS, 15 min at 23°C). This may be required when harsher conditions are needed in order to permeabilize the cell membrane, or for better blocking of non-specific binding according to the antibody used.\nPrimary antibody labeling: Prepare the primary antibody solution. Dilute the GM130 antibody at a ratio of 1:100 in PBS for a total volume of 25 μL per sample.\nNote: We use GM130 antibody as an endogenous Golgi marker to detect mitotic Golgi dynamics, however other Abs (p58, Giantin and GRASP65) were equally successful (Shaul and Seger, 2006[href=https://www.wicell.org#bib5]; Wortzel et al., 2017[href=https://www.wicell.org#bib9]).\nNote: Both GM130 antibodies mentioned in the KRT worked equally well and are diluted similarly. They should be preferred based on the relevant species.\nOptional: To increase antibody specificity it is recommended to dilute the antibody in 2% BSA in PBS.\nOnce blocking is completed, remove the solution and wash cells once with PBS.\nPrepare parafilm on a clean bench surface and apply a drop of 25 μL diluted antibody for each slide.\nCarefully invert each cover slip on the liquid drop, while making sure that the cells are facing the antibody dilution.",
    "Cover the parafilm with an aluminum foil covered box. Attach wet Kimwipes on top of the box. This will ensure a humidified cover preventing the coverslips from drying out.\nIncubate for 1 h (at RT).\nTransfer coverslips back to the 12-wells plate and wash cells three times with PBS, 5 min per wash at RT as explained above to remove the residual antibody.\nSecondary antibody labeling: Prepare the secondary antibody solution by diluting the Alexa Fluor 568 conjugated antibody 1:400 together with 4′,6-diamidino-2-phenylindole (DAPI) for the nuclear staining at a dilution of 1:250 in PBS.\nPrepare parafilm on the clean bench surface and apply a drop of 25 μL diluted secondary antibody for each slide as described in step 12.\nInvert coverslips on the secondary antibody drop and incubate for 1 h (at RT) using the humidified covered box.\nSecondary antibody should be applied in the dark to prevent photobleaching.\nTransfer coverslips back to the 12 wells tissue culture plate and wash cells with PBS three times to remove any residual antibody as specified in step 13.\nPrepare microscope slides marked with the specific cell type, treatment and antibody wave-length. Apply a drop of 10–20 μL Elvanol mounting solution per coverslip. Once washing is complete, carefully remove each slide from the well and absorb leftover PBS using Kimwipes.\nSlowly invert each slide, cells side facing down, on the mounting reagent within an angle until fully placed on the slide. Carefully place the slides in a covered dark place and allow it to dry overnight in RT.",
    "Optional: Transferring of the slides from the well plate to the paraffin back and forth, as described above in steps 12–15, allows the use of a smaller antibody volume. Alternatively, the primary or secondary antibody mix can also be applied directly into the coverslips in the well plate, but this requires much larger volumes. The latter, however, limits the chance of confusion between treatments and/or breaking/damaging the slides from the frequent removals.\nNote: It should be noted that IF can be successfully applied to co-localize two different proteins within the same cells as well as staining of specific proteins within overexpressed cells. For this purpose, the two primary antibodies should be generated in different species (i.e., rabbit and mouse), while both secondary antibodies should be generated in the same third different species animal (i.e., goat) to prevent cross reactivity. Moreover, secondary antibodies should be conjugated to fluorescent probes with different, non-overlapping, wavelengths to ensure specificity of the signal.\nImaging by a spinning disk confocal microscopy and image analysis\nTiming: 1–2 h\nImage acquisition of the stained cells to analyze the endogenous Golgi is applied using fluorescence microscopy. We used the Observer.Z1 Confocal Spinning Disk Microscope (Zeiss, Jena, Germany) equipped with a ROLERA (Q-Imaging) 12-bit monochrome CCD camera. Turn on the microscope and the ZEN 2.5 system software on the computer.\nAdd the relevant channels on the software:\nDAPI - 405 nm laser. BP450/50 emission filter.\nAF568 - 532/561 nm, 529/62 emission filter.\nOptimize image to avoid saturation for each channel, while maximizing the dynamic range of the camera. Capture images with a 63×/1.4 NA oil immersion objective according to the specific microscope software.\nCapture images of at least 5 different fields from each slide for quantification to have a total of at least 100 cells.",
    "Note: Counting should include at least 100 cells per treatment to have enough cells to reach statistical significance. Thus, if the confluency of the cells is low, more images per treatment should be acquired.\nAcquired images are transferred to Photoshop software (only to view the image, while maintaining the original scientific information of the picture. Other image-handling programs can be used as well). Analysis and quantification of the fine Golgi structure according to the GM130 staining is then done manually for each cell within each frame (by eye). Intact Golgi appears as one concentrated GM130 spot (∼2–3 μm) adjacent to the nucleus (stained with DAPI). Initial fragmentation appears as a little more spread (>4 μM), less intense GM130 staining. Partially fragmented ones (chunks) will be seen as 2–5 distinct spots, and fully fragmented Golgi will be seen as a diffused GM130 staining all over the cells.\nNote: Automated programs for microscope data analysis such as Image J, ilastik, or CellProfiler are available and can be used for quantification either alone, or preferably when are used together. These are very good tools mainly when following just fragmented vs intact Golgi. However, due to the fluidity of the Golgi structure and the different stages of fragmentations that vary among cells and can all appear simultaneously within the same frame, manual counting can be considered. The automated programs are robust specifically when combined together and result with a good automated quantification of the Golgi, however, a specific knowledge is required for their use.\nCount cells in each field and document number of cells with fragmented Golgi and number of cells with intact Golgi. Repeat counting in 5 different fields for a total of at least 100 cells.\nCalculate percentage of cells containing fragmented vs intact Golgi out of the total cells counted.",
    "Determine significance using student’s T-test to determine difference between untreated to mitosis induced cells. Distinct stages of the fragmentation can be quantified as well.\nNote: More than 100 cells should be counted and three independent experiments should be performed to determine significant results. Double-blinded counting can be applied to ensure accurate results.\nDetermining Golgi structure and mitotic phases in synchronized HeLa cells by ISX\nIn this section we describe the protocol for immunostaining HeLa for Golgi marker followed by imaging acquisition using the Image-Stream X instrument.\nMethanol fixation for IFC\nTiming: 30 min (with an overnight incubation)\nCollect the complete medium from each 60 mm culture dish, and transfer into a 15 mL conical centrifuge tube. Place the tube on ice.\nNote: Mitotic induction (either nocodazole or thymidine) may result (in some cell types) in the detachment of cells from the plate. Therefore, it is important to collect the cells suspended in the complete medium.\nNote: Make sure to have additional plates for the single-color controls as well as an unstained sample for compensation analysis. In this layout, 3 additional plates are needed (for unstained, DNA stain only and for Golgi stain only).\nWash the culture dishes with PBS. Carefully aspirate the PBS and add 500 μL Trypsin C solution to each dish. Incubate the dishes in a 37°C incubator for 3–5 min to allow cells to detach from the plate.\nUse the medium from step 26 to wash the detached cells from the dish. Collect the medium with the washed cells and return to the tube.\nSpin down cells at RT for 5 min at 300 × g.\nAspirate the supernatant, tap to resuspend and add 5 mL of ice-cold PBS. Centrifuge again at RT for 5 min at 300 × g.",
    "Aspirate the supernatant and then resuspend the cell pellet in 500 μL ice-cold PBS.\nSet the vortex condition to a low mixing level relative to the vortex used. Gently vortex the cell suspension while slowly adding 1.7 mL ice-cold methanol into the tube in drop-by-drop manner.\nPlace sample at 4°C for an overnight incubation.\nPause point: Samples can be stored after fixation up to two weeks at 4°C.\nImmunofluorescence staining for ISX\nTiming: 3 h\nAdd 6 mL ice-cold PBS (4°C) to each tube and spin-down at RT for 5 min at 300 × g. Repeat once more to remove all residuals methanol.\nPermeabilization / Blocking: Aspirate the supernatant and resuspend the cell pellet in 500 μL per tube of the following mixed solution; 0.1% Triton X-100 and 2% BSA in PBS, for 5 min at 23°C.\nImmediately after, wash cells by adding 6 mL ice-cold PBS and spin-down at RT for 5 min at 300 × g.\nPrimary antibody labeling: Prepare the primary antibody solution. Dilute the GM130 antibody at a ratio of 1:100 in PBS for a total volume of 100 μL per sample. Aspirate the supernatant and resuspend the cell pellet in 100 μL primary antibody dilution. Mix in an orbital-Mixer for 1 h at 4°C, 99° turns.\nNote: Both GM130 antibodies mentioned in the KRT worked equally well and are diluted similarly. Should be preferred based on the relevant species.\nAdd 6 mL ice-cold PBS (4°C) and spin-down at RT for 5 min at 300 × g.\nSecondary antibody labeling: Prepare the secondary antibody solution containing Alexa Fluor 568 conjugated antibody (1:400) together with DAPI (1:250) for the nuclear staining in PBS.",
    "Aspirate the supernatant in the tube and resuspend the cell pellet in 100 μL secondary antibody solution. Mix in an orbital-Mixer for 30–60 min at 4°C.\nNote: Secondary antibody should be applied in the dark to prevent photobleaching.\nAdd 6 mL ice-cold PBS (4°C) and spin-down at RT for 5 min at 300 × g.\nAspirate the supernatant in the tube, resuspend the cell pellet in 200 μL PBS, and then transfer to a clean 1.5 mL Eppendorf centrifuge tube.\nImage acquisition by ISX\nTiming: 1–3 h\nTurn on the imaging flow cytometer, server and acquisition computer. Log in to the acquisition computer.\nNote: For a detailed explanation on how to use the instrument and analysis software, please refer to the user manual.\nStart the acquisition software, INSPIRE (the version used was 200.1.681.0). Once loaded, click on ‘STARTUP’ and make sure that all the automatic calibrations and tests have passed (marked green).\nChoose the magnification according to your cell size. We recommend the 60× magnification (NA=0.9, pixel size 0.33 mm), if possible, to allow the highest resolution.\nCheck the excitation/emission data for your dyes and turn on the relevant lasers. Refer to the user manual for the detailed spectra for the available acquisition channels. Set the lasers to maximal power. In the example we provide (Figure 1[href=https://www.wicell.org#fig1]B), we used the 561 nm laser (200 mW) for the AF568 dye and 405 nm laser (120 mW) for the DAPI.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1538-Fig1.jpg\nFigure 1. Examples of expected results for Golgi analysis by IF and IFC\nHeLa cells were fixed and stained for GM130 (red) and DAPI (blue) as described in the protocol. Right columns show examples of the different stages of the Golgi (Top row - intact, middle row - partially fragmented, lower row – fully fragmented).",
    "(A) Slides were imaged by a spinning-disc confocal microscope with 63× oil objective. Representative cells with intact, partial and fully fragmented Golgi are enlarged on the right.\n(B) Cells were imaged by ISX using a 40× magnification and analyzed by IDEA 6.2. Cells positive for Golgi staining (Golgi +) were plotted for 'minor axis intensity’ and ‘area’ of Golgi staining. Each Golgi population is gated on the graph, and representative cells are presented on the right. Scale bar 10 μm.\nTurn on the relevant acquisition channels for your dyes. These should include the brightfield channels (#1 and #9 for a two-camera instrument) and side-scatter channel (#6 or #12, depending on your dye combination). In the example we provide, AF568 was acquired on channel 4 (595–640 nm) and DAPI was read on channel 7 (430–505 nm).\nLoad your first sample – start with the sample that contains all dyes, which is expected to produce the highest staining intensity. In this experiment, it would be the control sample.\nCreate a scatter plot of the Area vs. Aspect ratio of the bright-field channel (as set in step 47). Gate on single cells according to your population distribution.\nNote: To include dividing cells in the telophase stage, increase the gate to include higher-area, low-aspect-ratio cells as well.\nCreate a histogram of Gradient_RMS of the bright-field channel (Usually channel 1). Draw a linear gate that includes values between 55 and 90, to collect only cells that are in focus.\nCreate a ‘Raw Max Pixel’ histogram for each fluorescent channel, taken from the ‘single’ gate.\nNote: Make sure the values do not reach 4095 (the instrument uses a 12-bit camera), which indicates the camera is saturated. If they do, reduce the relevant laser intensity until the values are within the target range preferably less than 4000.",
    "Collect ∼30,000 cells from each sample, using the same setup of lasers and acquisition channels as set in step 47 for all samples. If a rare population is assessed, collect enough cells so that the final population contains at least 500 cells.\nMonitor camera focus and cell position during the acquisition.\nNote: If the autofocus fails to maintain its focus, it could be disabled by going to Instrument-> Advanced settings-> Autofocus and disabling the ‘autofocus’ option. Once the autofocus is disabled, the focus can be manually changed on the ‘Focus’ tab.\nNote: If the cell position in the flow is not centralized (this has to be inspected visually, as the software does not alert in case of drift), it can be adjusted manually by moving its position on ‘Centering’.\nAfter recording your samples, acquire single stained controls with the compensation wizard, using the same laser settings as those used for the experimental samples.\nImage analysis by IDEAS\nTiming: 1–3 h\nSet analysis template.\nStart the IDEAS analysis software (preferably version 6.2 or higher).\nOpen the control experimental sample file and calculate the compensation using the single-stain files acquired, using the compensation wizard in IDEAS.\nDraw a bi-variate plot of Area vs. Aspect ratio of the bright-field channel. Draw a gate around the single cells population, usually with low area and high aspect ratio. Verify the gate by visual inspection of the cells. If a cell-cycle analysis is required, make sure to include telophase cells, which are a close-to-doublet population (i.e., have higher area and lower aspect ratio).\nDraw a bi-variate plot of RMS vs. Contrast of the bright-field image. Gate on focused cells, usually values higher than 55 for Gradient RMS and higher contrast values. Verify the gate by visual inspection of the cells.",
    "Draw a bi-variate plot of Area vs. Centroid X of the bright-field channel. Gate on uncropped cells, which have already higher values of Centroid X.\nDraw a bi-variate plot of the Intensity vs. Max Pixel values of the Golgi staining channel. Gate on cells with a positive Golgi staining (Golgi +), by comparing the staining to control samples labeled with all the dyes except the Golgi staining.\nDefine populations: Using ‘Tag Objects’, manually select a group of cells with an intact Golgi and another group featuring a fragmented Golgi (see Figure 1[href=https://www.wicell.org#fig1]B for a typical morphology). Include around 100 cells per group.\nDefine masks: Calculate several masks that delineate the Golgi staining. Usually, this would be done using the ‘Morphology’ and ‘Threshold’ masks, and we recommend using several ‘Threshold’ values. In the example provided (Figure 1[href=https://www.wicell.org#fig1]B), we used ‘Threshold_60’ (top 60% intensity pixels).\nDefine feature: Calculate all the features using the ‘Add Multiple Features’ option in the ‘Features’ panel. Select all the feature options under the ‘Size’, ‘Location’, ‘Shape’ and ‘Texture’ categories. It is undesirable to enable the ‘Signal strength feature option, as it may differ between samples and between experiments. Choose the masks you just created, choose the Golgi staining channel under ‘Image’, and click on ‘Add Features’.\nDiscriminating statistics: Add a new statistics table. Under ‘Statistics’, choose ‘RD-Mean’ and ‘RD-Median’ (RD value, or Fisher’s discriminant, is defined as difference between the means or medians, divided by the sum of standard deviations, of the two populations). Choose as a reference population the intact Golgi cells chosen in step 61, and click ‘Add’ to calculate.\nChoose the best features: Copy the values obtained to an Excel file and arrange them in a descending order according to the RD values.",
    "Examine the ability of the features that are at the top of the list with the highest RD values to separate between the chosen populations, by plotting histograms / bi-variate plots of the selected features. Verify by visual inspections of the populations.\nApply features: Apply the selected features to the whole population and verify that they correspond to the different Golgi morphologies.\nSave the analysis template.\nApply analysis template to samples.\nOpen the files recorded from treated samples using this template.\nIt is recommended to merge the treated and control samples into one file, as it makes it easier to determine the gating. To do so, in each file click on Tools -> Create Data File from Populations, and then select the single, focused, uncropped, Golgi-positive population, and create a ∗.CIF file. Then, click on ‘Merge CIF files’, select the files you just created and use the template that was saved in the previous step.\nDetermine the gating that distinguishes between the different populations according to the controls. Verify by visual inspection of the populations.\nApply the gating on all the other experimental datasets, either in the merged file or by saving the template and applying it to all the other experimental samples.\nIf you have IDEAS version 6.3, quantification of the different Golgi morphologies could also be done by using the Machine Learning Wizard. In this case, use the populations chosen in step 61 to allow the wizard to create a classifier that combines several features weighted for the best separation between populations.\n  Potential applications.\nYou can follow the Golgi fragmentation during the different stages of the cell cycle and cell division by following the next steps:",
    "Cell cycle and division stages: Label DNA using a dye compatible with the ones you used to stain your samples. Common dyes and their corresponding channels (in brackets) include DAPI (Ch7), SyBR Green (Ch2), propidium iodide (Ch4) and Draq5 (Ch11). You can quantify the different stages according to the DNA intensity, plotted as a histogram on a linear scale.\nCell division: using the DNA staining, you can determine the stages of cell division by DNA morphology (examples can be seen in (Filby et al., 2011[href=https://www.wicell.org#bib2]); (Wortzel et al., 2015[href=https://www.wicell.org#bib8]); (Vivante et al., 2021[href=https://www.wicell.org#bib7])), however adjustments may be needed according to particular cell type.\nGate for G2/M based on DNA staining intensity.\nGate for G2, prophase, prometaphase and mitotic (metaphase-telophase) populations using 2 parameters: the bright detail intensity (BDI) of DNA staining (intensity of localized bright areas, subtracted for the local background), and the area of the 50% highest intensity pixels of the DNA staining (defined by the Threshold_50 mask).\nNote: Non-dividing cells will have high area, low BDI, mitotic cells will have a low area and high BDI, and prophase will be in between.\nGate for cells in metaphase according to their lower width using the Width feature masked for the 50% top intensity pixels of the DNA staining (Threshold 50).\nCells with higher area and lower aspect ratio Brightfield (BF) images are defined as belonging to the telophase stage.",
    "The rest of the cells can be then gated using two spot features based on the mask of the 50% high intensity pixels of the DNA staining (Threshold 50). The features used are Spot Distance Min (shortest distance in microns between two spots within the mask) and Spot Area Min (the area of the smallest spot within the mask). Three populations can be defined: (1) High Spot Area Min and 0 Spot Distance Min are considered as metaphase and added to the previously gated cells. (2) Intermediate Spot Area Min and high Spot Distance Min are defined as cells during anaphase. (3) Cells with low Spot Area Min and low Spot Distance Min are defined as cells during Pro/ProM and added to the previously gated cells.\nOnce the Golgi fragmentation is quantified as detailed above, it could be combined with additional parameters or markers:\nApoptosis: Apoptotic cells will have fragmented and condensed DNA. This can be quantified, for example, using the contrast of the bright-field image vs. the area of the top 30% intensity pixels of the DNA staining.\nCo-localization: The co-localization of the Golgi with other proteins or organelles can be quantified by fluorescently labeling them and calculating the similarity using similarity feature (i.e., log transformed Pearson’s Correlation Coefficient, a measure of the degree to which two images are linearly correlated within a masked region) or bright detail similarity (i.e., the intensity of localized bright spots whose radius is three pixels (if defined as number of pixel, important to clarify the magnification used on the Image-Stream) or less within the masked area in the image, with the local background around the spots removed). The pixel resolution is 0.3 μm for the 60× lens, and 0.5 μm for the 40× lens (Wortzel et al., 2015[href=https://www.wicell.org#bib8]).",
    "Cell classification: As you can utilize up to 10 fluorescent channels, you can label additional markers to increase your resolution of specific population identification."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Flow Cytometry",
    "Microscopy"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}