{
  "id": 2140,
  "origin_website": "Cell",
  "title": "Protocol for fluorescence-activated cell sorting of human EpCAM+ lung cancer cells for gene expression analysis of Rac guanine-nucleotide exchange factors",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nTumor and adjacent non-tumoral lung tissue digestion\nTiming: 3.5–4 h\nNote: This section outlines the critical steps needed for efficient tissue digestion. Following these steps will generate high-quality single cell digest, which is essential for isolation of EpCAM+ cells. Fresh non-tumoral and tumor tissue specimens should be obtained from the operating room in a sterile specimen container with sterile saline (Figure 1[href=https://www.wicell.org#fig1]A). Processing of tissue should commence within the first 15 min after tissue procurement.\nNote: To obtain high cell yield and viability, tissue should be processed within 15 min of procuring it. However, if this is not possible, tissue should be fully submerged in 4C wash media. In doing so, cell yield and viability will likely be compromised. We don’t recommend letting tissue sit at 4C longer than 2 h.\nThaw a tube of stock enzyme cocktail described in the previous section in a 37C water bath for approximately 10 min. Dilute the enzyme cocktail mixture in 25 mL of L-15 culture media to obtain a final volume of 50 mL. This dilute enzyme is our working stock with final concentrations indicated in section above. The volume of enzyme cocktail needed is proportional to the tissue mass, with an approximate ratio of 25 mL per 0.5 grams of tissue sample.\nPlace tissue specimens in separate petri dishes for weighting and processing (Figure 1[href=https://www.wicell.org#fig1]B). Add 10 mL of 1× DPBS to each dish. Using forceps, gently press tissue samples and remove remaining air/blood (non-tumoral tissue sample is usually highly vascularized). For tumor tissue, all areas of visible tissue necrosis must be trimmed away and discarded.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1620-Fig1.jpg\nFigure 1. Workflow for digestion of tumoral and non-tumoral lung tissues for EpCAM+ cells isolation\n(A) Tumor tissue and non-tumor tissue specimens procured from the operating room.",
    "(B) Pieces of tumor and non-tumor tissues placed in a petri dish before mincing.\n(C) Minced tissue to demonstrate the homogenous mixture needed.\n(D) Minced tissue resuspension with 1× enzyme cocktail mixture.\nTransfer the tissue specimens to a new petri dish for mincing. Use micro-dissecting scissors to cut up tissues into progressively smaller pieces, aiming a size range of 1–2 mm3.\nContinue until the mincing process gives a homogenous mix with no remaining large tissue pieces (Figure 1[href=https://www.wicell.org#fig1]C). This step should be performed quickly to avoid drying of the tissue samples.\nNote: If large tissue begins to dry out (pink smearing on petri dish), add a small volume (500 μL-2 mL) of enzyme cocktail mixture to keep the tissue samples hydrated.\nAdd 25–30 mL of enzyme cocktail mixture to each petri dish.\nNote: If the tissue does not smoothly pass into the opening of a 25 mL serological pipette, it means that it has not been minced thoroughly. If proper mincing is not reach, proper digestion will be impacted, and this will significantly diminish cell yield and viability.\nTransfer the tissue and enzyme cocktail mixture into a new 50 mL tube (the final volume of tissue it should not exceed the 7.5 mL mark on the conical tube; if it exceeds this mark, add more enzyme cocktail mixture, and split the sample evenly into two 50 mL tubes). (Figure 1[href=https://www.wicell.org#fig1]D).",
    "Note: Not surpassing the 7.5 mL mark on the conical tube with total tissue is an important aspect for tissue digest. The final volume of enzyme in the tube is 25–30 mL, and the tissue within that 25–30 mL should not settle above the 7.5 mL demarcation on the tube, because this allows for optimal tissue to enzyme ratio. If the tissue exceeds this mark, there will be too much tissue and not enough enzyme for proper digestion.\nIncubate the 50 mL tubes in a shaker incubator (1 × g) for 45 min at 37C.\nRemove tissue samples from incubator, using a 10 mL serological pipette to disaggregate the solid component by pipetting up and down against the inside edge of the tube. Repeat 15–20 times, depending on tissue hardness.\nPlace the tubes back in the shaker incubator for 1 h at 37C.\nRepeat step 8.\nFilter tissue sample using a 70 μm pore-size filter. Gentle pressure is then applied with the black rubber bottom of a 5 mL syringe (Fisher Scientific) to any remaining, partially digested tissue on the cell strainer. 25 mL of DPBS is used to wash the filter one last time. Typically, <5% of the tissue (consisting of mainly acellular-connective tissue) remains on the strainer at the end of this step. Centrifuge at 252 × g for 5 min.\nPrepare RBC lysis mixture: dilute 5 mL of 10× RBC lysis with 45 mL sterile water at 20C.\nDiscard the supernatant and resuspend pellets in 25 mL 1× RBC lysis mixture and then incubate for 9 min at 20C.\nAdd 10 mL of 1× DPBS and centrifuge at 252 × g for 5 min.\nDiscard supernatant and resuspend in 5–10 mL of L-15 culture media.\nCount cells and determine the percentage of live cells using trypan blue.",
    "Note: After digestion, cell viability should be ∼80–100%. If total cell viability is below 80%, use a “dead cell removal kit’’. Follow manufacture protocol as stated using the QuadroMACS Separator and Starting kits (https://www.miltenyibiotec.com/upload/assets/IM0001218.PDF[href=https://www.miltenyibiotec.com/upload/assets/IM0001218.PDF]). For this enzyme cocktail, it is expected that the processed tissue will yield ∼6 × 106 cell per gram of tissue. This cocktail is optimal to have minimal effect on the cell surface receptors of the major immune cell populations and preserve their functionality. See Quatromoni et al. (2015)[href=https://www.wicell.org#bib5] for more information.\nPlace samples on ice or proceed immediately with cell surface staining.\nFlow surface staining for EpCAM+ cells\nTiming: 1 h\nNote: All steps should be performed under sterile conditions in a laminar flow hood; samples should be kept on ice. Protect from light.\nTransfer 1–10 million single cell suspension into a 5 mL FACS tube and add 3 mL 1× DPBS, followed by centrifugation at 252 × g for 5 min.\nAspirate and discard supernatant.\nPrepare a 1/1,000 dilution of Live Dead Aqua Fixable Stain or Fixable Viability Dye eFluo with 1× DPBS. Resuspend sample suspension in 100–200 μL of 1× viability stain and incubate for 5 min.\nAdd 3 mL 1× DPBS and centrifuge at 252 × g for 5 min.\nAdd 50 μL of staining buffer and for every 1 million cells add 1 μL of EpCAM antibody (Alexa Fluor 488) and 1 μL of CD45 antibody (BV785). Incubate 30 min on ice.\nWash 3 times with 3 mL of 1× DPBS, with centrifugation at 252 × g for 5 min between washes. Aspirate supernatant and resuspend sample in 500 μL of 1× MACS buffer.\nFilter sample with a pre-separation filter (30 μm pore size membrane) before running on cytometer to prevent clogs.\nEpCAM+ cells sorting by BD FACSAria™ fusion flow cytometer",
    "Set up the FACSARIA fusion sorter\nTiming: 3 h\nNote: This is an operator-dependent procedure. Core facilities with trained personnel might be required. FACSARIA Fusion sorter runs on FACSDiva software.\nTurn on cytometer, computer, compressor, and AMS system, and set temperature at 4C. Start the BD FACSDiva™ software.\nSettings: cytometer tab, select the nozzle size and correct configuration. Select and install the 100 μm nozzle and holder for 2-way sorting. Insert sterile, 5 mL FACS collection tube containing 500 μL of MACS buffer (so viable EpCAM+ cells are not sorted into dry FACS tubes).\nAlign the stream/droplets with the waste drawer. Next, set the stream breakoff point and ensure there is proper droplet formation. For 100 μm nozzle, set sorting parameters as followed (values are starting points):\nAmplitude: 12.\nFrequency: 32.\nDrop 1: 150.\nGap: ∼12.\nNext perform Accudrop to calculate proper drop delay. Create a master mix tube of beads by adding 1 drop of Accudrop beads to 500 μL 1× DPBS/staining buffer.\nLoad the FACS tube of Accudrop beads and turn on the optical filter in the 100 μm side stream, aiming for an event rate of 1,000–1,500 events/sec. Keep the waste drawer in position. Run the automatic accudrop delay program.\nSet up a new FACS sorting experiment for EpCAM+ cells isolation.\nUnder cytometer settings, select the colors needed for the sort. The violet and blue laser will be needed to detect Live Dead Aqua Dye, EpCAM (Alexa Fluor 488/FITC) and CD45 (BV785) fluorochrome. The violet laser will excite at 405 nm; live dead aqua will emit 525/50 and BV785 emit at 780/60. The blue laser will excite at 488 nm and Alexa Fluor 488/ FITC will emit at 530/30.\nSet up compensatory controls and calculate compensation matrix.\nCreate plots for analysis and sorting (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1620-Fig2.jpg",
    "Figure 2. EpCAM+ FACS sorting gating strategy on the BD FACSAria cell sorter\nTo FACS sort EpCAM+ cells from non-tumoral and tumor tissue, all events, minus debris, were gated on Forward scatter (FSC) and Side scatter (SSC) plots. Following this, cells were discriminated and gated on only live cells. Lastly, a EpCAM vs. CD45 plot was made and only Live, EpCAM+CD45- cells were sorted (indicated in the red box).\nNote: There should be 4 plots: a) forward scatter by side scatter (FSC vs SSC), b) forward scatter area by height (FSC-H vs. FSC-A), c) side scatter by live dead aqua (SSC vs. live dead aqua), and d) EpCAM (FITC) vs. CD45 (BV785).\nCollect at least 10,000 EpCAM+ cells to ensure enough yield for obtaining high quality RNA. (By using the FACSAria Fusion sorter, we are able to isolate EpCAM+ cells, with purity of ∼99%).\nOnce sorting is completed, wash FACS tube with 5 mL 1× DPBS.\nPlace cell in a sterile Eppendorf tube and wash cell pellet twice with 1× DPBS. You can store samples at -80 C as a dry pellet for 16–18 h or proceed immediately to RNA extraction.\nRNA extraction (based on QIAgen RNA extraction kit)\nTiming: 3 h\nNote: All steps should be carried out at 20C.\nPrepare in advance following solutions:\n70% Ethanol in RNase-free water (3.5 mL ethanol + 1.5 mL water).\nRLT buffer + 1% β-mercaptoethanol (10 mL RLT + 100 μL β-mercaptoethanol).\n60 μL DNase aliquots should be stored at 4C. At the time of the experiment, mix an aliquot with 420 μL RDD buffer.\nAdd 350 μL RLT buffer to sample. Sample can be stored at -80C if needed, as opposed to dry pellet.\nTransfer sample to a QIAshredder column (purple). Centrifuge 2 min at 12,000 × g.\nRemove the column.",
    "Add 350 μL 70% ethanol to the sample.\nTransfer all volume to the QIAgen column (pink). Centrifuge 1 min at 12,000 × g.\nDiscard the supernatant and keep the column.\nAdd 350 μL RW1 buffer to the pink column. Centrifuge 15 s at 12,000 × g.\nDiscard the supernatant and keep the pink column for subsequent steps.\nMix 10 μL DNase per column. Let it sit on the column for 15 min at 20C.\nAdd 350 μL RW1 buffer directly to the pink column. Centrifuge for 15 s at 12,000 × g.\nDiscard the supernatant and keep the column.\nAdd 500 μL RPE directly to the column. Centrifuge for 1 min at 12,000 × g.\nRepeat step #47 and discard the supernatant.\nNow place the column into a new collection tube. Centrifuge 2 min at 12,000 × g.\nDiscard supernatant and add 50 μL RNase-free water. Incubate 2 min at 20C.\nCentrifugate 2 min at 12,000 × g.\nThis is now your high-quality RNA collect from FACS sorted EpCAM+ cells.\nFor quality check of RNA integrity, quantify RNA by spectrometry measuring 1 μL/sample in duplicates, and assess purity by A260/280 nm ratio (it should be >1.8). Calculate μL/μg RNA per sample.\ntable:files/protocols_protocol_1620_4.csv\ncDNA synthesis\nTiming: 1 h\nNote: All reagents should be kept on ice.\ncDNA synthesis was performed following standard protocol for Taqman Reverse Transcription reagents kit.\nPrepare Mix1 for cDNA conversion as indicated below:\nRNA: 1 μg (complete with RNase free water to obtain final volume of 6.6 μL).\nRandom hexamers 1 μL.\nFinal volume: 7.7 μL.\nAdd Mix #1 into the PCR thermocycle and initiate denaturalization phase. For random hexamers, the thermocycler settings are as followed; 25C for 10 min, 37C for 30 min, 95C for 5 min, and a 4C hold.",
    "Leave cDNA in thermocycler at 4C while Mix #2 is prepared. Mix #2 components are indicated below.\nTaqMan buffer 10×: 2 μL.\ndNTPs: 4 μL.\nMgCl2: 4.4 μL.\nRNase inhibitor: 0.4 μL.\nRT: 0.5 μL.\nFinal volume: 11.3 μL.\nAdd 11.3 μL of Mix #2 to each tube containing Mix #1, reaching a final volume of 20 μL. The cDNA and master mix for q-PCR has been made. The only component omitted from this mix is the specific target probes (Rac-GEFs and control probes). Proceed to PCR cDNA amplification steps for Rac-GEFs in the next section.\nQ-PCR for Rac-GEFs in 96-well plates\nTiming: 2 h\nNote: While this protocol was used primarily for determination of Rac-GEF expression, it can be easily adapted for measuring other genes of interest in Epcam+ cells.\nAssure proper compatibility between the 96-well plate and the Q-PCR system.\nThaw the TaqMan® Fast Advanced Master Mix (2×) reagent and the desired probes for specific Rac-GEFs (or other genes of interest) on ice.\nPrepare a mix with the following components in the indicated proportion. Add 10% overage for pipetting loss.\nGently vortex (avoid vigorous mixing).\nSpin down the mix tube to eliminate bubbles/air in a bench microcentrifuge.\nAdd 19 μL the mix to each well.\nAdd 1 μL of cDNA template (1–100 ng) to each well.\nSeal the plate with the Optimal adhesive film (avoid bubbles/air trapping by applying compression).\nSpin down the 96-well plate in a macro-centrifuge at maximum velocity.\nSet up experimental conditions in the Real-Time PCR system as follows in PCR cycling conditions table.\nRun the reaction.\nAnalyze data (see below).\ntable:files/protocols_protocol_1620_5.csv\nSettings were determined as “Fast” mode based on our laboratory equipment QuantStudio™ 6 and 7 Flex Real-Time PCR System. ∗UNG (uracil-containing DNA) activation, ∗∗Select anneal temperature based on Tm of the primers."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Cell Biology",
    "Flow Cytometry",
    "Cancer"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}