{
  "id": 11747,
  "origin_website": "Jove",
  "title": "Multiplex Immunohistochemistry Staining for Paraffin-embedded Lung Cancer Tissue",
  "procedures": [
    "The protocol is approved by the guidelines of the Ethics Committee of West China Hospital, Sichuan University, China. The lung cancer tissue samples were obtained during surgery in the Center of Lung Cancer at West China Hospital, and informed consent was obtained from each patient.\n1. Tissue section preparation\nFFPE preparation\n\t\nImmerse clinical tissues in neutral formalin solution for more than 72 h.\nComplete the process of dehydrating the tissues using xylene and graded alcoholic solutions20.\nPerform manual paraffin embedding and tissue sectioning at 4 µm section thickness. Use adhesion microscope slides to ensure that the tissue slices do not fall out.\nBake the slides in an oven at 65 °C for 2 h to ensure that the tissue and slides are dry. Store in a slide box at room temperature.\nTissue section pretreatment\n\t\nPretreat the tissue slides in an oven at 65 °C for 5 min, and then sequentially immerse in xylene solutions for 2 x 15 min, anhydrous ethanol solutions for 2 x 15 min, 90% ethanol solution for 10 min, 85% ethanol solution for 10 min, 80% ethanol solution for 10 min, and 75% ethanol solution for 10 min, followed by washing the slides with sterilized water for 3 x 1 min.\n\t\t​NOTE: This experimental technique can only be used for FFPE tissue, not for frozen or fresh tissue, as the multiple high-temperature antigen repair process causes the tissue to fall off the slide.\n2. Optimization of primary antibody\nNOTE: Conventional IHC experiments were used to determine the incubation conditions for individual antibodies, mainly including antibody concentration and antigen repair conditions. Refer to the conditions in the antibody instruction manual.\nUse an antibody concentration slightly higher than the recommended concentration range and intermediate values.",
    "Optimize the antigen retrieval buffer routines PH6 and PH9 according to the location of protein expression. Use PH9 for proteins expressed in the nucleus and use either routine (PH6 or PH9) for other proteins.\n3. mIHC staining method\nNOTE: Opal mIHC staining is one of the available mIHC methods. In this experimental 5-color protocol, as each tissue sample needs to be stained with four antibodies, four primary antibody incubations, secondary antibody incubations, and TSA signal amplification chromogenic incubations, as well as five antigen restorations are needed. Finally, 4'6-diamidino-2-phenylindole (DAPI) staining and anti-fluorescent bursting agent sealing are performed.\nMain reagent preparation\n\tNOTE: Determine the amount of reagent to be added according to the size of the tissue slides. Use enough volume to completely cover the tissue section (generally, 50-150 µL per slide). The working solutions required for the experiment are prepared as follows:\n\t\nWash buffer working solution: dilute 20x Wash buffer at 1:20 with double-distilled water, and store at room temperature.\nPH6 buffer working solution: Dilute 100x PH6 buffer at 1:100 with double-distilled water. Prepare before use and store at room temperature.\nPH9 buffer working solution: Dilute 50x PH9 buffer at 1:50 with double-distilled water. Prepare before use and store at room temperature.\nPolymer HRP: Prepare this ready-to-use solution only for primary antibodies of rabbit and mouse origin.\nFluorophore working solution: Reconstitute each fluorophore powder (except fluorophore 780) in 75 µL of DMSO. Before each procedure, dilute the fluorophore in 1x amplification diluent at 1:100. Discard any unused portion of the fluorophore working solution.\nFluorophore 780 Working Solution: Reconstitute TSA-DIG in 75 µL of DMSO and the fluorophore powder 780 in 300 µL of double-distilled water. Before the procedure, dilute TSA-DIG in 1x amplification diluent at 1:100, and dilute fluorophore 780 with Ab diluent at 1:25.",
    "DAPI working solution: Dilute the DAPI solution at 1:50 with double-distilled water or PBS. Prepare before use and store at 4 °C for no longer than 48 h.\n\t\tNOTE. Wash the slides only with double-distilled water and freshly prepared wash buffer working solution throughout this multilabel fluorescence staining experiment. Tissue sections must not come into contact with tap water; contaminants in the tap water can adhere to the tissue sections and cause autofluorescence. Keep the samples away from light throughout the experiment.\nAntigen retrieval\n\t\nPlace the slides in a staining and repair box and fill it with PH6 or PH9 buffer working solution, cover with the lid, and heat in a microwave oven for 2 x 8 min at 100% power.\n\t\t​NOTE: Add double-distilled water to the repair box during the heating process to prevent excessive evaporation that can cause the slices to dry out.\nAllow the slides to cool at room temperature before proceeding (30-60 min).\nWash the slides 3 x 2 min with double-distilled water. Use a hydrophobic barrier pen to encircle the tissue section on the slide.\nBlocking\n\t\nImmerse tissue sections in wash buffer, cover with blocking solution, and incubate slides in a humidified chamber at room temperature for 10 min.\nPrimary antibody incubation\n\t\nRemove the blocking solution from the slides and cover the tissue sections with the primary antibody working solution. Incubate the slides in a humidified chamber for 1 h at 37 °C in the incubator or overnight at 4 °C in the refrigerator.\n\t\tNOTE: Do not let the slides dry out.\nIntroduction of Polymer HRP\n\t\nWash the slides in wash buffer working solution for 3 x 2 min. Add Polymer HRP directly dropwise to tissue sections and incubate for 15 min at room temperature.",
    "NOTE: For slides stored in the refrigerator, keep them at room temperature for approximately 30 min before washing to remove the primary antibody.\nTyramine signal amplification (TSA) generation\n\t\nWash the slide with wash buffer working solution for 3 x 2 min, add fluorophore working solution directly dropwise to the tissue sections, and incubate for 10 min at room temperature. Wash the slide with wash buffer working solution for 3 x 2 min.\nSpecial procedure for fluorophore 780\n\tNOTE: Fluorophore 780 is weak and is routinely placed last in the color-matching scheme of the entire experiment. Fluorophore 780 is not normally used in this experimental protocol, but because of its specificity, its experimental steps are listed.\n\t\nIntroduction of TSA-DIG\n\t\t\nWash the slide with wash buffer working solution for 3 x 2 min, add TSA-Drg working solution dropwise to the tissue sections, and incubate for 10 min at room temperature.\nMicrowave treatment\n\t\t\nWash the slides with wash buffer working solution for 3 x 2 min.\nPlace the slides in a staining and repair box, fill it with repair solution, cover with the lid, and heat in a microwave oven for 2 x 8 min at 100% power. Allow the slides to cool at room temperature before proceeding (30-60 min).\nWash the slides for 3 x 2 min with double-distilled water.\nFluorophore 780 signal generation\n\t\t\nImmerse the sections in wash buffer, cover with fluorophore 780 working solution, and incubate the slides in a humidified chamber for 1 h at room temperature.\nWash the slides with wash buffer working solution for 3 x 2 min.\n\t\t\tNOTE: DO NOT perform microwave treatment after this step.\nUse fluorophore 780 as the last step of the entire workflow and then stain nuclei directly with the DAPI working solution.\n\t\tNOTE: Skip step 3.7 if not using fluorophore 780.",
    "Microwave treatment\n\tNOTE: This microwave step strips the primary-secondary HRP complex and re-exposes antigens, allowing the introduction of the next primary antibody.\n\t\nPlace the slides in a staining and repair box, fill it with PH6 or PH9 buffer working solution, cover with the lid, and heat in a microwave oven for 2 x 8 min at 100% power.\nAllow the slides to cool at room temperature before proceeding (30-60 min). Wash the slides 3 x 1 min with double-distilled water.\nDip slides in wash buffer working solution for 2 min. Perform the next antibody incubation.\nNext antibody incubation\n\t\nRepeat steps 3.2-3.8 (except step 3.7).\nCell nuclear staining and tissue sealing\n\t\nCover the tissue sections with the DAPI working solution and incubate the slides in a humidified chamber for 5 min at room temperature. Wash the slides for 3 x 2 min with double-distilled water.\nRemove water droplets from the slides, add 10-20 µL of anti-fluorescence quencher to each slide, and seal the slides with a microscope cover glass.\nStore the finished slides at 4 °C, protected from light, for more than 1 month.\n\t\t​NOTE: Take care to avoid air bubbles.\n4. Set up the negative control\nProcess the negative control slides like the tissue-containing slides but without the addition of reagents such as primary antibodies, secondary antibodies, TSA reagents, and DAPI, which are used to remove tissue autofluorescence when scanning the film.\n5. Fully automatic scanning of tissue slides\nNOTE: The equipment used for spectral imaging is a fully automated multispectral tissue quantification analyzer, and imaging and analysis visualization of 5-color slides can be performed using the referenced system (see Table of Materials). The system uses multispectral imaging for quantitative unmixing of multiple fluorophores and tissue autofluorescence.",
    "Manually set the exposure time and scanning program for each fluorescence channel and confirm that the instrument has completed the fully automatic exposure and scanning of the tissue slides.\n\t​NOTE: The slide surface must be clean and free of water film. Be careful with the amount of sealer: too much will cause the coverslip to slip and the instrument to report an error.\n6. Analysis of fluorescence\nDouble-click the software (see the Table of Materials), drag the multicolor fluorescence image file obtained from the original scan into the software, and set the image type to fluorescence.\nClick the Brightness & contrast button and check the channels on the panel. Click outside and then on the channel to select the fluorescence channel of interest. Drag the Min display and Max display to adjust the brightness and contrast of each channel.\nAfter analysis, determine the view to be saved, click on Show slide overview and Show cursor location to remove these two contents, keep the scale bar, and click File | Export snapshot | Current viewer content to export a png file.\n\tNOTE: Every fluorescence channel and a merged figure must be exported for future analysis.\nFor further analysis of target cell positivity, use cell identification and segmentation software21 (see Table of Materials).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}