{
  "id": 18832,
  "origin_website": "Jove",
  "title": "Characterization at the Molecular Level using Robust Biochemical Approaches of a New Kinase Protein",
  "procedures": [
    "1. Cell preparation for transfection\nCAUTION: All the steps of the cell culture must be performed in a dedicated laboratory, and cells are manipulated within a Class 2 microbiological cabinet.\nSeed HEK-293 (Human Embryonic Kidney) cells in Ø 10 cm plates in 10 mL of DMEM (Dulbecco's Modified Eagles Medium) supplemented with 10% fetal calf serum. Culture for 3 to 5 days under 5% CO2, at 37 °C, until the cells reach ~90% confluence.\nTreat Ø 10 cm plates with Collagen R to increase cell adhesion to the plastic plates.\n\t\nAdd 5 mL of a solution of Collagen R, 200-fold diluted in Phosphate Saline Buffer (PBS) in a Ø 10 cm plate. Overlay the liquid over the whole surface of the plate.\nIncubate at room temperature for at least 1 h within the biosafety cabinet.\nRemove collagen solution, and discard it. Add 5 mL of PBS, spread it all over the surface of the plate, remove it and discard it. Repeat this wash once.\nAdd 8 mL of DMEM supplemented with 10% fetal calf serum. Keep the prepared plates within the biosafety cabinet.\nTake HEK-293 plates from step 1.1 within the biosafety cabinet. Remove the medium from the plates and discard it in a dedicated bleach trash. Add 2 mL of supplemented DMEM, and flush the cells to detach them using the flow of a 1 mL micropipette, taking care to avoid making foam.\nCollect the cells in a 15 mL tube and add 4 mL of supplemented DMEM. Homogenize with a 10 mL pipette, by pipetting up and down 3 times.\nTake 2 mL of this cell solution and add them to collagen-treated plates containing supplemented DMEM from step 1.2.4.",
    "Grow for 24 hours in the incubator at 5% CO2 and 37 °C. Cells should be 50-80% confluent at the time of transfection.\n2. Transient transfections\nRemove the medium from the plates, discard it in a dedicated bleach trash, and add 10 mL of fresh supplemented DMEM. Put back the plates into the incubator at 37 °C while preparing the transfection mixture.\nIn a 15 mL tube, add 450 μL of a 10 mM Tris-HCl pH 7.5/1 mM EDTA (Tris stands for Tris(hydroxymethyl)aminomethane, and EDTA for ethylenedinitrilotetraacetic acid) solution and 50 μL of a 2.5 M CaCl2 solution. Mix by inversion.\nAdd 10 μg of plasmidic DNA (Deoxyribonucleic acid) prepared from a midi preparation on a liquid culture of bacteria transformed with the dedicated plasmid. Mix by inversion.\nUnder smooth agitation on a vortex, add 500 μL of BES buffered saline 2x concentrate (composition: BES, 10.7 g/L, NaCl, 16.0 g/L, Na2HPO4, 0.27 g/L; BES stands for N,N-Bis(2-hydroxyethyl)-2-aminoethanesulfonic acid, N,N-Bis(2-hydroxyethyl)taurine) slowly drop by drop.\nIncubate for at least 15 min (up to 45 min) at room temperature within the biosafety cabinet. Do not vortex, do not mix! Move the tubes very carefully not to disturb the complex formation between DNA and calcium phosphate.\nTake the plates from step 2.1 to the safety cabinet. Add the DNA complexes very carefully, drop by drop, onto the cells all over the surface of the plate.\nIncubate for 24 to 72 hours in the incubator at 37 °C. Usually maximum protein expression is reached within 48 hours.\n3. Lysis\nNOTE: Work on ice, and with cold buffers to prevent protein degradation.",
    "Prepare lysis buffer: 50 mM Tris-HCl, pH 7.5, 100 mM NaCl, 5 mM EDTA, 0.1% Triton X-100, 50 mM NaF, 10 mM sodium pyrophosphate, 1 mM Na3VO4, 20 mM p-nitrophenyl phosphate, 20 mM β-glycerophosphate, 10 μg/mL aprotinin, 0.05 μg/mL okaidic acid, 1 μg/mL leupeptin, and 1 mM PMSF (phenylmethylsulfonyl fluoride). Around 4 mL of lysis buffer are required for each transfected plate.\nRemove plates with transfected cells from the incubator. Put them on ice.\n\tNOTE: From this step, it is possible to work on a “normal” bench.\nRemove the media, and discard it in a dedicated bleach trash.\nWash twice with 3 mL of cold PBS: add 3 mL of PBS on the side of the plate drop by drop to avoid detaching transfected cells, spread all over the surface of the plate, remove PBS and discard it; repeat this step once more. At the end, remove carefully the rest of PBS by tilting the plate to prevent lysis buffer dilution for next step.\nAdd 500 μL of cold lysis buffer on the transfected washed cells. Spread it all over the surface of the plate.\nIncubate for 10 min on ice. From time to time (at least twice), spread again the buffer all over the surface of the plate.\nScrap the cells and collect them in a microcentrifuge tube.\nCentrifuge for 10 min at 10,000 x g at 4 °C.\nCollect supernatant in a new microcentrifuge tube. This fraction corresponds to the lysate (whole cell extract). Discard the pellet which corresponds to cell membrane debris.\nCollect an aliquot of this fraction to a new microcentrifuge tube (around 50 μL). This fraction corresponds to the “TOTAL fraction” or “Cell Lysate” or “Whole Cell extract” allowing analysis of whether transfected proteins are expressed by Western Blot.",
    "NOTE: At this point, samples can be directly used for Western Blot analyses. Laemmli buffer must be added to the sample, which is then heated at 95 °C for 5 min, centrifuged at 10,000 x g for 5 min, and loaded on appropriate SDS-PAGE. Samples may also be stored at -80 °C.\n4. Immunoprecipitation\nGently resuspend agarose beads coupled with the appropriate antibody: HA (Human influenza hemagglutinin), Flag, or GFP (Green Fluorescent Protein) by smooth inversion.\nCut the end of a 200 μL tip from a micropipette to allow beads to enter the tip. Pipette the beads up and down several times to saturate the tip to ensure to take the correct volume of beads.\nTake 40 μL of beads in a microcentrifuge tube.\nAdd 500 μL of TENET (30 mM Tris-HCl pH 7.5, 120 mM NaCl, 5 mM EDTA, 1% Triton X-100) buffer. Mix by inversion. Centrifuge for 2 min at 1,000 x g at 4 °C. Remove carefully supernatant and discard it. Add 500 μL of TENET. Incubate for at least 1 hour at 4 °C on a rotating wheel.\n\tNOTE: This pre-incubation step in TENET allows to reduce non-specific interactions and so to decrease background signal.\nWash the beads twice with 500 μL of lysis buffer.\n\t\nCentrifuge 2 min at 1,000 x g at 4°C.\nRemove carefully supernatant buffer, and discard it.\n\t\tNOTE: Take care not to aspirate beads during these washing steps.\nAdd 500 μL of lysis buffer. Homogenize by inverting the tube.\nRepeat steps 4.5.1- 4.5.3.\nCentrifuge for 2 min at 1,000 x g at 4°C. Carefully remove supernatant buffer, and discard it.\nIncubate beads with the lysate from step 3.9 for 2 to 4 hours at 4 °C on a rotating wheel.\nWash immunoprecipitated beads.",
    "NOTE: At this point, the immunoprecipitated beads may be washed five times with the lysis buffer, and then eluted with Laemmli buffer. The eluate may be used for Western Blot analyses or stored at -80 °C. Alternatively, beads may be washed twice with the lysis buffer and then three times with the kinase buffer to perform γ[32P] ATP labeling.\n5. Coimmunoprecipitation analyses\nWash immunoprecipitated beads from step 4.7 with the lysis buffer.\n\t\nCentrifuge for 2 min at 1,000 x g in a refrigerated centrifuge at 4 °C.\nCarefully remove the supernatant, and discard it.\nAdd 500 μL of lysis buffer. Homogenize by inverting the tube.\nRepeat steps 5.1.1-5.1.3 four times.\nElution\n\t\nCentrifuge for 2 min at 1,000 x g in a refrigerated centrifuge at 4 °C.\nCarefully remove the supernatant, and discard it. Remove the last drops of supernatant with a Hamilton syringe in order to avoid aspiration of the beads, and discard the supernatant.\nAdd 40 μL of 4x Laemmli buffer (200 mM Tris/HCl pH 6.8, 4% SDS, 40% glycerol, 0.5 M β-mercaptoethanol, 0.02% bromophenol blue). Homogenize by gently tapping the tube.\nIncubate for 5 min at room temperature.\nCentrifuge for 5 min at 10,000 x g at room temperature.\nWith a Hamilton syringe, remove the supernatant and collect it in a new microcentrifuge tube. This fraction corresponds to the “Eluate”, which may be stored at -80 °C, or directly analyzed by Western Blot.\n6. Kinase assay\nPrepare the kinase buffer: 50 mM HEPES-NaOH pH 7.5 (HEPES stands for 4-(2-hydroxyethyl)-1-piperazineethanesulfonic acid), 150 mM NaCl, 5 mM MgCl2, 5 mM MnCl2, 50 mM NaF, 1 mM Na3VO4, 20 mM β-glycerophosphate, 1 μg/mL leupeptin, and 1 mM PMSF. Around 2 mL of the kinase buffer is required for each immunoprecipitation condition.",
    "Wash immunoprecipitated beads from step 4.7 twice with 500 μL of lysis buffer.\n\t\nCentrifuge for 2 min at 1,000 x g in a refrigerated centrifuge at 4 °C.\nCarefully remove supernatant, and discard it. Add 500 μL of lysis buffer. Homogenize by inversion.\nRepeat steps 6.2.1 and 6.2.2.\nWash immunoprecipitated beads three times with 500 μL of kinase buffer.\n\t\nCentrifuge for 2 min at 1,000 x g in a refrigerated centrifuge at 4 °C.\nCarefully remove supernatant, and discard it. Add 500 μL of kinase buffer. Homogenize by inversion.\nRepeat steps 6.3.1 and 6.3.2 twice.\nCentrifuge for 2 min at 1,000 x g in a refrigerated centrifuge at 4 °C.\nCarefully remove supernatant, and discard it. Remove the last drops of supernatant with a Hamilton syringe in order to avoid aspiration of the beads, and discard the supernatant.\nAdd 40 μL of kinase buffer to the immunoprecipitated beads. Resuspend the beads by gently tapping the tube.\nPrepare the mix for the γ[32P] ATP labeling (final volume is 22.5 μL, complete with kinase buffer) in a safe lock-tube.\n\t\nAdd the required volume of kinase buffer to reach a final volume of 22.5 μL.\nCut the end of a 20 μL tip of a micropipette. Resuspend the immunoprecipitated beads from step 6.6 by pipetting up and down several times. Collect 10 μL of these beads into the safe-lock tube.\nAdd ATP from a 10 μM stock solution to reach 50 mM of finale concentration. According to the number of sample treated, a dilution of the stock solution of ATP in the kinase buffer is suggested to allow to pipette 1 to 2 μL, to be sure the volume is correct.\nAdd 2.5 μg of substrate (cofilin or Myelin Basic Protein, MBP in the present study case).",
    "Add 5 μCi of γ[32P] ATP (3,000 Ci/mmol) to initiate the reaction. Mix by pipetting up and down slowly.\n\tCAUTION: From this point, work must be done in a safety place dedicated for radioactivity manipulations with cautious precaution, dedicated protections and appropriate controls (radioactive shields, Geiger counter, specific waste collect, personal breast and finger badges to detect radioactive exposure, filter tips).\nIncubate for 20 min at 30 °C.\nStop the reaction with 6 μL of 5x Laemmli buffer.\nHeat at 95° C for 5 min.\nCentrifuge at 10,000 x g for 5 min at room temperature.\nLoad on a SDS-PAGE. Proceed to migration.\n\tNOTE: Take care that the front line of free γ[32P] ATP does not exit the gel to avoid contamination of the migration tank.\nStain the gel at room temperature.\n\t\nRemove the gel from the glass plates.\nProceed with three baths in water at room temperature.\nStain the gel overnight with Coomassie Blue at room temperature.\nDestain the gel with several wash baths with water at room temperature.\nWrap the gel with plastic wrap.\nExpose for one night or more on a phosphorimager screen.\nRead the screen on a phosphorimager to detect labeled bands.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}