{
  "id": 4573,
  "origin_website": "Bio",
  "title": "Imaging and Measurement of Nanomechanical Properties within Primary Xylem Cell Walls of Broadleaves",
  "procedures": [
    "Separate leaf midrib samples (0.3-0.4 cm x 0.3-0.4 cm) from the donor plants (Figures 2A-B).   Immerse the samples into a fixative solution of 5% (v/v) glutaraldehyde (Grade I) in a 0.1 M cacodylate buffer at pH 7.2, and then place them in a vacuum for 15 min at room temperature to remove air from the leaf tissue. Fix the samples in a fixative solution for six hours at 4 °C.   Dehydrate the samples in an ascending series of ethanol solutions for 20 min each step at room temperature, follow with mixtures of ethanol and xylene at the ratios 3:1, 1:1 and 1:3 (v/v) for 30 min each, ending with pure xylene for 30 min.   Continue with mixtures of xylene and paraplast plus at the ratios 3:1, 1:1 and 1:3 (v/v) for 30 min each at 42 °C.   Immerse the samples into pure paraplast plus for 2-3 days and keep them in a laboratory drying chamber at 60 °C. Transfer the samples into freshly prepared paraplast plus twice a day.   Embed the leaf midrib samples in paraplast plus blocks (Figure 2C).   Cut leaf midrib cross-sections, 10-15 micrometer-thick, with a microtome.   Transfer the cross-sections to water droplets on circle glass slides coated with (3-aminopropyl)triethoxy-silane. After relaxation of the sections, carefully remove the water, place the slides on a slide warmer, and allow them to air dry for 2 h at 45 °C.   Deparaffinize the cross-sections in two successive immersions in xylene for 3 min each, followed by rinsing 3 min each with mixtures of xylene and ethanol at the ratios 3:1, 1:1 and 1:3 (v/v), and complete the process with two successive rinses in 100% ethanol for 3 min each.    Allow the cross-sections to air dry for 20 min and keep them in sterile Petri dishes.",
    "Determine the dimensions of tip cantilever from the calibrated light microscopy image, and insert the tip cantilever into the probe holder.   Calibrate the deflection sensitivity of the tip cantilever on a clean fused silica surface using a PeakForce QNM in air mode. Use a single ramp test. Accept the value to be automatically entered into the deflection sensitivity parameter. (Fused silica is a suitable reference sample for determination of deflection sensitivity of stiff cantilevers, approximately 5 N/m, which are required for the measurement of samples with MOE less than 10 GPa.)   Use the Nanoscope Thermal Tune function with a simple harmonic oscillator model to obtain the quality factor (Q value) and the resonance frequency (v0 value) of the tip cantilever. Following the Sader’s method of spring constant calibration, enter the dimensions of tip cantilever together with the above values for the quality factor and the resonance frequency, and directly calculate the stiffness of the tip cantilever on this website: http://www.ampc.ms.unimelb.edu.au/afm/calibration.html[href=http://www.ampc.ms.unimelb.edu.au/afm/calibration.html]. Add the calculated value into the spring constant parameter window.   Image one peak of TGT1 tip grating using a PeakForce QNM, and calculate the tip radius for expected depth. Use the fact that the tip might be approximated by ellipsoid surface. Calculate the fitted ellipsoid below the expected depth using the least square method. If the radii are similar, use the average. In other cases, use another tip or anticipate a non-ideal tip.   In case of difficulties with the calibration of deflection sensitivity, spring constant or tip radius for a novice user, consult the calibraton chapter of the PeakForce QNM User Guide (available on the websites: http://nanopicolab.cnsi.ucla.edu/pages/publicview/manuals/PEAKFORCE_QNM_USERS_GUIDE-A.pdf[href=http://nanopicolab.cnsi.ucla.edu/pages/publicview/manuals/PEAKFORCE_QNM_USERS_GUIDE-A.pdf] or http://www.torontomicrofluidics.ca/cms/manuals/peak_force.pdf[href=http://www.torontomicrofluidics.ca/cms/manuals/peak_force.pdf]).   Place the circle glass slide containing the sample cross-section onto a steel sample mounting disk using an adhesive pad.",
    "Place the steel sample mounting disk with the glass slide onto the scanner tube of a microscope.   Image the tracheary element cell wall fragment within the primary xylem tissue (Figure 2D) by adjusting the peak force setpoint to achieve a sufficient sample deformation of 2 nm.   Perform the measurement of cell wall topography (i.e. heights), MOE, adhesion, deformation, and energy dissipation at low approach tip velocities (approximately 0.3-0.5 μm/s).   Import the raw data of MOE into the MATLAB software. The data of MOE must be filtered in order to account for the slippery effect of the tip on the steep cell wall surface. Calculate the height gradients (by means of a function “gradient”) using the height data of surface topography, and also calculate the surface slope (an angle between the gradient vector and the horizontal x, y plane) for each image pixel. Disregard MOE values where the surface slope exceeds the value of 30 degrees, and remove these values from the quantification of MOE. The values for other nanomechanical properties such as adhesion, deformation, and energy dissipation do not seem to be effected by high surface slope. However, to be consistent with the spatial distribution and the statistics of the measured characteristics, we suggest that the filtered data of adhesion, deformation, and energy dissipation be taken into account as well.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20141217/20141217232647_4669.jpg Figure 2. Leaf midrib separation and preparation of a primary xylem tissue for the PeakForce QNM measurement. A. Fully expanded leaf of Ulmus, free of leaf midrib damage. The red boxes indicate the sites of leaf midrib separation. Scale bar = 1 cm. B. Leaf midrib samples separated for the tissue fixation and embedding. Scale bar = 1 cm. C. Leaf midrib sample embedded in a paraplast plus block, ready for microtome sectioning. Scale bar = 1 cm. D.",
    "Primary xylem tissue and lignin autofluorescence within tracheary elemet cell walls. The red box indicates the cell wall fragment subjected to the PeakForce QNM measurement. Scale bar = 100 μm"
  ],
  "subjectAreas": [
    "Cell Biology",
    "Plant Science"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}