{
  "id": 17029,
  "origin_website": "Jove",
  "title": "Rodent Model of Intestinal Ischemia-Reperfusion Injury via Occlusion of the Superior Mesenteric Artery",
  "procedures": [
    "The procedures described here were approved by the National Heart, Lung, and Blood Institute Animal Care and Use Committee at the National Institutes of Health and conform to the policies outlined in The Public Health Service Policy on Humane Care and Use of Laboratory Animals, The Animal Welfare Act, and the Guide for the Care and Use of Laboratory Animals.\n1. Surgical setup\nFollow aseptic procedures. Don a mask, hair cover, and clean jumpsuit/lab coat/surgical scrubs.\nPrepare the following sterilized materials: surgical instruments (see Table of Materials), warm saline, cotton swabs, gauze, surgical staples, surgical drapes, and gloves. Also obtain surgical tape, which does not need to be sterilized. Sterilize the materials with either autoclave or ethylene oxide sterilization techniques.\nPlace a heated circulating water blanket in the surgery area and cover it with a sterile towel or drape.\nUse a precision isoflurane vaporizer, pressurized medical air (21% O2), and a Bain non-rebreathing circuit with a nose cone designed for mice to provide surgical anesthesia.\n2. Animal preparation\nAnesthetize the mouse in an induction chamber by delivering 2%-4% isoflurane with 21% O2 medical air at a rate of 0.5 L/min for each liter of chamber volume.\n\tNOTE: It is preferable to use 21% O2 medical air over 100% O2 for this particular model, as saturating the blood with O2 may interfere with the IRI.\nRemove the mouse from the chamber and move it to a clean surface separated from the surgery area. Fit it with a nose cone delivering 1.5% isoflurane with 21% O2 medical air.\nInject 1 mg/kg buprenorphine subcutaneously into the dorsal cervicothoracic area.\nInject 200-600 IU/kg heparin intraperitoneally to prevent thrombus formation during the period of occlusion.\nRemove hair from the ventral abdomen using clippers.\nApply ophthalmic ointment to the eyes to prevent corneal damage.",
    "Move the mouse onto the heated water blanket in the surgery area. Again, fit it with a nose cone delivering 1.5% isoflurane with 21% O2 medical air to achieve a surgical plane of anesthesia.\nPosition the mouse in dorsal recumbency and secure the limbs to the table with surgical tape.\nMonitor the animal's body temperature rectally using a rodent-specific thermometer. Keep the body temperature at 36.5 ± 0.5 °C for the entire duration of the surgery.\nDisinfect the ventral abdomen using sterile gauze soaked in either chlorhexidine scrub or povidone-iodine scrub, followed by 70% alcohol. Repeat this sequence three times, alternating between the scrub and the alcohol. A new set of scrubs and alcohol gauzes should be used each time.\n\t\nApply the scrub in a circular motion, starting with small circles at the center of the surgical site and gradually working toward the edges by increasing the size of the circles. Discard the gauze once the edge of the surgical site has been reached. Do not scrub backward from edge to center.\nApply alcohol in a single top-to-bottom wiping motion and then promptly discard.\nPerform a toe pinch test (pedal reflex) to ensure the animal is fully anesthetized.\nDon sterile gloves. Aseptically drape the surgical site.\n3. Surgery and ischemia\nMake a 3-5 cm ventral midline abdominal incision in the skin using a #15 scalpel blade, dissect it free from the underlying muscle fascia, and reflect it laterally. Continue the incision through the abdominal wall along the linea alba using either micro dissecting scissors or spring-loaded micro scissors and place a retractor in position.\nPlace sterile gauze pads moistened with warm sterile saline around the operating area.",
    "Remove the small intestine from the abdominal cavity, flip it cranially and to the animal's left, and place it on the moistened pads. Place another moistened gauze pad over the tissues to prevent desiccation. Periodically drip warm sterile saline on the gauze to keep the tissues moist.\nIsolate the SMA, which is located ventral to the inferior vena cava, caudal to the celiac artery, and cranial to the renal artery.\n\tNOTE: Figure 1 shows the location of the SMA where it is isolated during surgery. The SMA normally lies ventral to the inferior vena cava and extends toward the right. When the intestines are exteriorized and flipped to the left during the surgery, the SMA lies to the left of the inferior vena cava.\nPlace an atraumatic microvascular clip across the base of the SMA where it branches off the abdominal aorta, ensuring the clip does not occlude the superior mesenteric vein.\nVerify ischemia of the small intestine by noting the color change from pink to pale-white and the loss of mesenteric pulsation.\nReturn the viscera to its original position inside the abdominal cavity for the duration of the ischemic period. Remove the retractor and cover the incision with moist gauze. Periodically add warm sterile saline to the gauze to prevent desiccation and maintain body temperature.\nAfter a 45 min period of ischemia (the beginning of which is marked by the initial application of the clip), remove the occluding clip. Verify the restoration of blood flow by observing a mesenteric pulsation and flushed color.\nApply warm sterile saline intraperitoneally just prior to final closure to maintain appropriate hydration.",
    "Close the abdominal muscles with a 6-0 polyglactin 910 suture. Administer bupivacaine (up to 2 mg/kg) along the muscle incision line for pain relief. Close the skin with surgical staples or wound clips.\n4. Recovery and reperfusion\nReturn the mouse to a warm chamber or cage on a circulating water blanket, hand warmer, or other appropriate heat source. Deliver 21% O2 at a flow rate of 0.5 L/min for each liter of chamber volume. Let the mouse recover here for 90 min. Periodically monitor the mouse for signs of pain or distress.\n5. Euthanasia and blood collection\nAt the end of the 90 min recovery period, return the mouse to the induction chamber and deliver 2%-4% isoflurane with 21% O2 at a rate of 0.5 L/min of chamber volume to re-induce full anesthesia.\nTransfer the animal back to the surgery area and fit it with a nose cone delivering 2%-4% isoflurane with 21% O2 to achieve deep anesthesia.\n\tNOTE: CO2 is not an appropriate method of euthanasia for this procedure, as it induces physiologic changes which may interfere with ischemic injury or tissue analytes13.\nRe-open the ventral midline incision and perform a terminal bleed by collecting as much blood as possible from the abdominal vena cava using a 23 G needle and syringe. Expect to collect between 0.3-0.5 mL of blood (less in mice who have undergone IRI, more in those who received sham laparotomy).\nFollowing blood collection, the abdominal aorta is severed to allow for complete exsanguination.\nPerform either cervical dislocation or thoracotomy as a secondary measure to ensure successful euthanasia.\n6. Tissue processing for histology\nAfter euthanasia, collect the desired tissues. Ensure that the tissue processing is done promptly, as autolysis begins immediately after death14,15.",
    "Intestines: Collect the entire length of the small intestine and large intestine. Discard the cecum.\nLiver: Collect the left lateral, left median, and right median lobes.\nKidneys: Collect both kidneys. By convention, the left kidney is cut longitudinally, and the right is cut as a cross section at the time of necropsy.\n\t\tNOTE: The colon, liver, and kidneys may be used for assessing multi-organ failure or other systemic effects of IRI. The small intestines are used to assess the primary injury. It is not necessary to keep track of individual sections of the liver lobe and kidneys, as each organ will be analyzed and scored as one unit. The intestinal segments, however, should be kept separate and then labeled and scored individually.\nDivide the intestine into four sections: duodenum, jejunum, ileum, and colon. Ensure that the three small intestinal segments are equal in length. Do this by folding the small intestines into a \"Z\" shape, where the top line is the duodenum, the middle line is the jejunum, and the bottom line is the ileum. It is important to keep track of the proximal versus the distal end.\nFlush the lumen of the intestinal segments with saline using a 10 mL syringe affixed with a 20 G angio-catheter.\nPrior to making sections, lay each intestinal segment flat with the luminal side facing up. Using a 3 mL syringe affixed with a 27 G needle and generously apply 10% buffered formalin dropwise to coat the entire length of the mucosa. Then, roll each intestinal segment individually and place in separate, labeled tissue cassettes.",
    "To roll, lay each segment flat with the luminal side facing up, then roll circumferentially around a toothpick. The proximal portion should form the inner part of the roll. The lumen should face the inside/center. Try to roll as gently as possible to avoid compressing the villi.\nWhen rolled, the intestine should look like a Swiss roll. Place the Swiss roll spiral face-up inside the cassette.\nPlace the tissues in labeled vials filled with 10% buffered formalin to fix them at room temperature. Over-fixing is better than under-fixing. The vials should be large with plenty of formalin-at least 20x more fixative than tissue.\n\t\nIntestines: Place the four cassettes together in a specimen cup. Fix for 24-48 h.\nLiver: Place the liver lobes together in a 50 mL conical tube. Fix for 24-48 h.\nKidneys: Place the kidneys together in a 50 mL conical tube. Fix for 48-72 h.\n\t\tNOTE: Untrimmed kidneys take longer to fix than trimmed kidneys. To shorten the fixation time to 24-48 h, the kidneys may be cut along the median plane, longitudinally (left kidney) and transversely (right kidney), and placed in cassettes before being deposited in the formalin.\nAfter the tissues have been fixed in formalin for the designated time, rinse with phosphate-buffered saline (PBS) or distilled water and transfer to labeled vials filled with 70% EtOH. The tissue can be stored in the EtOH indefinitely at room temperature while awaiting histology.\n\t\nIntestines: Place the four cassettes together in a specimen cup.\nLiver: Place the liver lobes together in a 50 mL conical tube.\nKidneys: Place the kidneys together in a 50 mL conical tube.",
    "When ready, have the tissues processed onto glass slides using hematoxylin and eosin (H&E) stains. The tissue samples should be fixed in 10% buffered formalin and then sectioned, trimmed, and embedded in paraffin. Mount five-micron sections on the slides and stain with H&E.\n7. Tissue scoring\nTissue scoring should preferably be performed by experienced personnel who are blinded to the sample groups.\nIntestinal ischemia is scored using the Chiu/Park scoring system17.\nKidney damage is scored using the Jablonski scoring system18,19.\nLiver damage is scored using the Suzuki scoring system20,21.\n\tNOTE: There are many scoring systems currently in use for assessing tissue damage in rodent models of intestinal IRI. The scoring systems used in this study were selected to minimize arbitrary estimation and to maximize intentional qualitative assessment (Table 1)."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}