{
  "id": 14964,
  "origin_website": "Jove",
  "title": "Getting an A with the 3Cs: Chromosome Conformation Capture for Undergraduates",
  "procedures": [
    "1. Primer design\nNOTE: The 3C primers design tools are available online28. Alternatively, custom primers can be designed by the students (see below).\nIdentification of primer locations\n\t\nOpen the UCSC Genome Browser (http://genome.ucsc.edu/), select the organism of study, and search the region of the genome to be assessed using 3C.\nIn the next window, activate the enzyme track in the Mapping and Sequencing tab below the browser by clicking on Restr Enzymes.\nEnter the restriction enzyme(s) to be used, and set the display mode to pack. Click on Submit.\nIn the Variation and Repeats, make sure RepeatMasker is set to dense.\nUsing the restriction sites as guides, identify sites of interest not within the masked repeat regions (black bars). Highlight 300 base pairs (bp) flanking both the upstream and downstream sequence surrounding the restriction site by clicking on the position (topmost track) and dragging to the desired length (~600 bp).\nRelease the mouse, and a pop-up box will appear. Take note of the genomic location, click on Zoom in, and let the browser readjust to the selection.\nHover the mouse over the View tab on the upper browser ribbon, and in the drop-down menu, select DNA.\nLeave the default option, note the designation of masked sequences (there is an option to make them N's). Click on get DNA.\nThe highlighted sequence will then be displayed in the window. Copy and paste this sequence into Primer3 (https://primer3.ut.ee/).\nUsing the Primer3 default settings, generate primers by clicking on Pick primers.\nIn the results, take note of the location of the restriction enzyme, and select primers that create a 200-500 bp PCR product with the restriction site located in the middle.",
    "Following these steps, design test primers 1 kilobase (kb), 2 kb, 5 kb, 10 kb, and 20 kb from the site(s) of interest.\nTo design the input control primers, repeat these steps for a site 1-2 kB from the site of interest that lacks a restriction site, meaning it is never cut.\nFunctional primer validation\n\t\nTo validate the primer functionality, set up PCR reactions using titrated primer concentrations and purified genomic DNA. Either through quantitative or semi-quantitative means, determine if the primers create the expected product.\nRedesign primers that fail validation.\n2. Day 1\nNOTE: The protocol can be paused (frozen at −20 °C) after chromatin cross-linking and after the nuclei collection. The steps take, on average, 5-6 h with undergraduates.\nYoung-adult (YA) C. elegans nuclei collection (adapted from Han et al.29)\n\t\nChromatin crosslinking\n\t\t\nCollect 5,000 YA worms in 30 mL of M9 medium in a 50 mL conical tube, and spin at 400 × g for 2 min at room temperature (RT).\nWash the worm pellet 3x more with M9 to remove bacteria.\nRemove the supernatant, resuspend the worm pellet in 47.3 mL of M9 containing 2.7 mL of 37% formaldehyde (2% final), and incubate with agitation (rocking or nutating) for 30 min at RT.\n\t\t\tCAUTION: Handle formaldehyde with care, and work under a fume hood with proper personal protective equipment (PPE-lab coat, proper gloves, and eye protection). Formaldehyde is an irritant that affects the eyes, nose, throat, and lungs.\nSpin the worms at 400 × g for 2 min at RT.\nRemove the supernatant, and resuspend the worm pellet in 50 mL of 1 M glycine. Spin the worms at 400 × g for 2 min at RT.\nNuclei collection",
    "Resuspend the worm pellet in 6 mL of chilled NP buffer (50 mM HEPES at pH 7.5, 40 mM NaCl, 90 mM KCl, 2 mM EDTA, 0.5mM EGTA, 0.1% Tween 20, 0.2 mM DTT, 0.5 mM spermidine, 0.25 mM spermine, 1x complete protease inhibitor).\nTransfer the worm suspension to a 7 mL loose-fitting Dounce on ice. Dounce the sample 15x, and hold on ice for 5 min.\nTransfer the worm suspension to a 7 mL tight-fitting Dounce on ice. Dounce the sample 20x, and hold on ice for 5 min.\nTransfer the worm suspension to a clean 15 mL conical tube, and add NP buffer to 10 mL in total (approximately 4 mL).\nVortex the worm suspension on a high setting for 30 s. Incubate the sample on ice for 5 min.\nRepeat the previous step.\nSpin the worm suspension at 100 × g for 5 min at 4 °C.\nTransfer the supernatant to a fresh 15 mL conical tube.\nCheck the sample for worm debris. Visualize 10 µL of the sample with a light microscope. If worm debris is present, spin the sample at 2,000 × g for 5 min at 4 °C, resuspend the pellet in a fresh 10 mL of NP buffer, and spin the sample again at 100 × g for 5 min at 4 °C. Discard the pellet, check the supernatant for worm debris, and repeat until the sample is free of worm debris.\n\t\t\tNOTE: Alternatively, the worm debris can also be removed by straining the sample through a 40 µm cell strainer (6x) followed by a 20 µm cell strainer (6x).\nIf the sample is clear of worm debris, take 5 µL of the sample, add 5 µL of methyl green pyronin (the nuclei will be blue), and count the nuclei with a hemocytometer.",
    "Spin the sample at 2,000 × g for 5 min at 4 °C\nRemove the supernatant, place the samples on ice, and proceed; alternatively, snap-freeze the nuclei, and store at −80 °C.\nChromatin digestion\n\t\nResuspend the nuclei in 450 µL of clean water. Transfer the nuclei to a clean 1.5 mL microcentrifuge tube.\nTo the cross-linked sample, add 60 µL of 10x DpnII restriction enzyme buffer, and mix well.\n\t\t​NOTE: Other restriction enzymes that still cut crosslinked DNA can be used.\nAdd 15 µL of 10% sodium dodecyl sulfate (SDS) to permeabilize the nuclei, and incubate with agitation (rocking or nutating) at 37 °C for 1 h.\n\t\t​CAUTION: SDS is an irritant and is toxic if ingested or absorbed through the skin. Handle with care, and use proper PPE (lab coat, proper gloves, and eye protection).\nQuench the SDS by adding 75 µL of 20% Triton X-100 and incubating with agitation at 37 °C for 1 h.\nTake 10 µL from the sample as an undigested control. Store at 4 °C.\nAdd 400 U of DpnII, and incubate at 37 °C overnight with agitation.\n3. Day 2\nNOTE: On average, it takes undergraduates 5 h to complete these steps.\nChromatin digestion\n\t\nAdd an additional 200 U of DpnII, and incubate the samples for 4 h at 37 °C with agitation to ensure the complete digestion of the crosslinked sample.\nTake a 10 µL aliquot from the samples as a digestion control.\nHeat-inactivate the restriction enzyme by incubating the sample for 20 min at 65 °C (or according to the manufacturer's instructions). Continue to step 2.1.3.",
    "If the enzyme cannot be inactivated by heat, add 80 µL of 10% SDS, and incubate the sample for 30 min at 65 °C. Then, add 375 µL of 20% Triton X-100, and mix by swirling. Incubate the sample for 1 h at 37 °C, and continue to step 2.2.\nChromatin ligation\n\t\nTransfer the sample to a clean 50 mL conical tube, adjust the sample volume to 5.7 mL with molecular-grade H2O, and mix by swirling.\nAdd 700 µL of 10x T4 Ligase buffer, and mix by swirling.\nAdd 60 U of T4 DNA Ligase, and mix by swirling.\nIncubate overnight at 16 °C.\n4. Day 3\nNOTE: On average, it takes undergraduates 15-30 min to complete these steps. After the overnight incubation, the samples can be frozen.\nProtein digestion and reverse cross-linking\n\t\nAdd 30 µL of proteinase K (10 mg/mL) to the 3C sample, and incubate at 65 °C overnight with agitation. Add 5 µL of proteinase K (10 mg/mL) to the undigested and digestion control, and incubate at 65 °C overnight with agitation.\n5. Day 4\nNOTE: On average, it takes undergraduates 4-5 h to complete these steps.\nPurification of the 3C library\n\t\nAdd 30 µL of RNase A (10 mg/mL) to the 3C sample, and swirl to mix. Incubate the sample for 45 min at 37 °C.\nAdd 7 mL of phenol-chloroform to the sample, and mix by shaking.\n\t\tCAUTION: Phenol-chloroform is a skin and eye irritant and can cause burns if contact is not treated. Phenol-chloroform should be used in a fume hood with proper eye protection and gloves (nitrile).\nCentrifuge the sample for 15 min at 3,270 × g at RT. Collect the aqueous phase, and transfer to a clean 50 mL conical tube. Add equal volumes of chloroform, and mix the sample by shaking.",
    "Centrifuge the sample for 15 min at 3,270 × g at RT. Collect the aqueous phase, and transfer to a clean 50 mL conical tube. Add 7.5 mL of molecular-grade H2O, 35 mL of 100% ethanol, and (optional) 7 µL of glycogen (1 mg/mL). Mix by shaking, and incubate at −80 °C until the sample is frozen.\n\t\tNOTE: It can take 1 h or more for the sample to freeze. The protocol can be paused here.\n\t\t\nWhile the 3C sample is freezing, purify the control samples. To the control samples, adjust the volume to 500 µL using molecular-grade water, and add 2 µL of RNase A (10 mg/mL) mix by flicking the tube.\nBriefly spin to collect the sample at the bottom of the tube. Incubate the samples for 45 min at 37 °C.\nTo the control samples, add 1 mL of phenol-chloroform, and mix by shaking the tubes. Centrifuge the sample for 15 min at 3,270 × g at RT. Collect the aqueous phase of the controls, and place in a clean 1.5 mL microcentrifuge tube.\nAdd equal volumes of chloroform, and mix the sample by shaking. Centrifuge the sample for 15 min at 3,270 × g at RT. Collect the aqueous phase of the controls, and place in a clean 1.5 mL microcentrifuge tube.\nAdd 1 mL of 100% ethanol and 2 µL of glycogen (1 mg/mL). Mix by shaking, and incubate at −80 °C for 30 min.\nCentrifuge the sample for 15 min at 3,270 × g at 4 °C. Remove the supernatant, and add 750 µL of chilled 70% ethanol.\nCentrifuge the sample for 10 min at 3,270 × g at 4 °C. Remove the supernatant, and air-dry the samples. Resuspend the pellet in 50 µL of molecular-grade H2O. Freeze, or continue to step 6.",
    "Centrifuge the sample for 60 min at 3,270 × g at 4 °C. Remove the supernatant, and add 10 mL of chilled 70% ethanol. Disrupt and break up the DNA pellet by shaking the sample to mix.\nCentrifuge the sample for 30 min at 3,270 × g at 4 °C. Remove the supernatant, and allow the sample to partially air-dry at RT. Resuspend the pellet in 150 µL of 10 mM Tris-HCl (pH 7.5) by pipetting up and down. This is the \"3C Library.\"\n\t\t​NOTE: Freeze the sample, or continue to the analysis.\n6. Day 5\nNOTE: On average, it takes undergraduates 1-2 h to complete these steps.\nDetermining the sample quality using the standard curve of the control primer\n\t\nQuantify the DNA concentration for the 3C sample as well as all the controls, and adjust samples to 30 µg/µL (if the concentrations permit). Serially the dilute samples two-fold four times, resulting in five dilutions for each sample (1x, 0.5x, 0.25x, 0.125x, 0.0625x).\n\t\tNOTE: If quantification cannot be easily done, serially dilute the samples as indicated above, and proceed.\nSet up PCR reactions for the 3C, genomic control, and digested control for each diluted sample with the control primers: 1 µL of DNA, 10 µL of 5x reaction buffer, 1 µL of 10 mM dNTPs, 1 µL of 10 mM control primer (forward and reverse mixed), 1 µL of Taq polymerase, and 36 µL of water.\nFollowing the instructions for the software specific to the PCR machine, set up the standard curve PCR program using cycling conditions as follows: 30 s at 98 °C; 30 cycles of 5 s at 98 °C, 5 s at 60 °C, and 10 s at 72 °C; 1 min at 72 °C; 4 °C hold.",
    "Using the software, generate the standard curves for the samples. After the software generates the curve, take note of the PCR efficiency and R2 value.\nDetermining the DNA concentration\n\t\nTo determine the DNA concentration of the 3C samples, compare the samples to a genomic DNA sample of known concentration. Dilute the samples to 30 ng/µL, and serially dilute the genomic control from 10 ng/µL to 0.01 ng/µL in two-fold steps to create a standard curve.\n\t\tNOTE: If quantification cannot be easily done, dilute the sample 1:10, and proceed.\nSet up the PCR reactions for the 3C, genomic control, and digested control for each diluted sample with the control primers: 1 µL of DNA, 10 µL of 5x reaction buffer, 1 µL of 10 mM dNTPs, 1 µL of 10 mM control primer (forward and reverse mixed), 1 µL of Taq polymerase, and 36 µL of water.\nFollowing the instructions for the software specific for the PCR machine, set up the standard curve PCR program using the cycling conditions as follows: 30 s at 98 °C; 30 cycles of 5 s at 98 °C, 5 s at 60 °C, and 10 s at 72 °C; 1 min at 72 °C; 4 °C hold.\nUsing the software, generate the standard curves for the samples, plotting the 3C samples on the curve. Compare the position of the 3C sample abundance to the standard curve created by the reactions of the genomic DNA of known concentration, and adjust the 3C samples to 30 ng/µL.\nDetermining the presence or absence of chromatin interaction",
    "Set up qPCR reactions with 30 ng of the 3C sample, genomic control sample, and digested control sample: 1 µL of DNA, 10 µL of 5x reaction buffer, 1 µL of 10 mM dNTPs, 1 µL of 10 mM primer (forward and reverse mixed), 1 µL of Taq polymerase, and 36 µL of water.\n\t\tNOTE: The reactions should be set up using the control primer, the test primers for individual genomic loci, and desired combinations of the test primers (site \"a\" forward and site \"b\" reverse) being used to determine the chromatin interaction (Figure 3).\nFollowing the instructions for the software of the PCR machine, set up the PCR program as follows: 30 s at 98 °C; 40 cycles of 5 s at 98 °C, 5 s at 60 °C, and 10 s at 72 °C; 1 min at 72 °C; 4 °C hold.\nAfter the PCR has been run, inspect the amplification plot. Ensure that the PCR reactions display exponential amplification, doubling every cycle.\n\t\tNOTE: Reactions that do not display exponential amplification cannot be analyzed further.\nFollowing the instructions for the software of the PCR machine, define the threshold of the qPCR experiment.\nExport the Ct values for all the samples.\nDetermine the digestion efficiency using the test primer (TP) and control primer (CP) Ct values from the undigested control (UC) and the digested control (DC) samples using equation (1).\n\t\tPercent digested = 100 - imgsrc://cloudfront.jove.com/files/ftp_upload/65213/65213eq01.jpg     (1)\nThese values should be in the range of 80%-90% digestion. Record these values (Figure 4A).\nDetermine the relative chromatin interaction using the test primer combination (TPC) and control primer (CP) Ct values from the undigested control (UC) and the 3C (3C) samples using equation (2).\n\t\tChromatin interaction = 100 - imgsrc://cloudfront.jove.com/files/ftp_upload/65213/65213eq02.jpg      (2)",
    "Plot the values for each sample on a bar graph for each test primer combination.\nCompare the signal of the 3C samples to the control samples to determine if the 3C sample has enrichment of a particular chromatin interaction over the control samples. 3C samples that show enrichment over the control can be considered conditionally positive and require validation using Sanger sequencing (Figure 4B).\n\t\tNOTE: When analyzing the graph data, it is important to remember that unless a \"control template\" is used (see discussion), the abundance between reactions (i.e., from one set of primers to the next) cannot be compared.\nIdentification of the 3C products\n\t\nRun the PCR products on a 1.5% agarose gel.\nVisualize the gel for the correct size of the PCR products using a UV light box or gel documentation system.\n\t\tNOTE: Well-constructed 3C libraries will contain a diverse range of DNA fragments, and despite previous validation of the primers for specificity, PCR reactions from 3C libraries have the potential to contain many bands (Figure 5A). This does not prevent the analysis of the 3C libraries.\nExcise the product bands corresponding to the expected fragment size, and perform gel extraction of the PCR products following the instructions of a commercial kit or the homemade protocol outlined below.\n\t\tCAUTION: UV light is a known carcinogen, and great care should be taken to limit the time exposed to UV light. UV-resistant eye protection, a specimen shield, gloves, and a lab coat should be worn.\n\t\t\nTo construct a homemade purification cartridge, poke a hole in the bottom of a 0.5 mL tube with a needle.\nPack a small amount of cotton from a cotton ball into the bottom of the 0.5 mL tube, filling no more than half of the tube.",
    "Place the 0.5 mL tube into a 1.5 mL tube; ensure that the smaller tube rests on the lip of the bigger tube, not in the tube.\nCarefully cut a gel fragment into smaller pieces, and place it in the 0.5 mL tube of the cartridge.\nPlace the assembly in a −20 °C freezer for 5 min. Spin the assembly for 3 min at 13,000 × g at RT.\nKeep the 1.5 mL tube with the extracted DNA in buffer, and dispose of the 0.5 mL tube containing the agarose debris.\nPurified DNA can be sent for Sanger sequencing using forward and reverse primers for the 3C fragment.\nIdentification of chromatin contacts using Blat\n\t\t\nUpon the completion of the sequencing, determine if the samples meet the quality control standards as indicated in the sequencing report.\nFor sequences passing the QC, open .seq and .ab1 (trace) files in a sequencing editing program such as Another Plasmid Editor (ApE), inspect the .ab1 file for clear base calling peaks, and edit the peaks miscalled in the .seq file.\nUsing the edited .seq file, search for the DpnII site. Depending on the sequence result, this should be halfway into the reported sequence.\nTo determine if the sequence is the expected target sequence, highlight the DpnII site and an additional 30-50 bp of the upstream sequence corresponding to the forward primer of the genomic loci tested for 3C. Perform a Blat search of this sequence against the target species. Make sure the genomic loci match those of the primer.\nRepeat the step above for the reverse primer sequence, making sure the genomic locus returned matches that of the reverse primer."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}