{
  "id": 13642,
  "origin_website": "Jove",
  "title": "Rearing the Fruit Fly Drosophila melanogaster Under Axenic and Gnotobiotic Conditions",
  "procedures": [
    "1. Culture Bacteria (Start ~1 Week before Picking Eggs)\nPrepare modified MRS20 (mMRS) plates and broth tubes (Table 1). Pour 20 ml mMRS agar into each 100 mm Petri plate and allow to cool/dry overnight, or 5 ml mMRS broth into 18 mm test tubes.\nStreak Acetobacter pomorum, A. tropicalis, Lactobacillus brevis, and L. plantarum on mMRS agar plates. Incubate Acetobacter overnight at 30 °C. Incubate Lactobacillus anaerobically by placing the plates in an airtight container and flooding with carbon dioxide before sealing. Incubate at 30 °C overnight.\n\tNote: L. brevis colonies may not be visible until 24-48 hr. Plates can be stored at 4 °C and colonies can be used for up to 3 weeks.\nTwo to three days before transferring dechorionated eggs to sterile diet (section 5), pick a single colony from the mMRS plate into a test tube containing mMRS broth. Grow Acetobacter with shaking and grow Lactobacillus statically for 24 hr or until turbid, both at 30 °C.\n2. Prepare Sterile Diet\nPrepare sterile diet (Table 2) in a 2 L Erlenmeyer flask. Microwave the diet until it has boiled 3 sequential times; mix in between each boil.\nPlace the flask on a stir plate to maintain stirring while transferring diet to conical centrifuge tubes. Transfer 7.5 ml of diet to 50 ml centrifuge tubes. Loosely cap the tubes, and place in a covered, autoclavable polypropylene rack.",
    "Sterilize fly diet using an autoclave at 121 °C and 15 psi for 25 min. Remove racks from autoclave, and immediately shake each rack horizontally to ensure diet does not separate during cooling. Be careful to not shake the racks vertically to prevent transfer of diet to the lid or rims of the tubes. Allow the diet to cool on a shaker for exactly 45 min and again shake the diet horizontally by hand.\n\tNote: Diet can be stored at 4-15 °C for up to a week.\nAs an alternative to using covered autoclavable racks (steps 2.1-2.3), or to raise flies on diets containing acid preservative, perform the following steps:\n\t\nPrepare 1 L liquid diet in a 2 L flask with a stir bar in the flask. Autoclave the diet.\nAfter autoclaving, add 10 ml preservative and stir continuously on a heated stir plate. When the agar has cooled to 50-60 °C, move the flask to a heated stir plate in a biosafety cabinet and maintain flask temperature by heating at 50-60 °C.\nIn the biosafety cabinet, pipet ~7.5 ml individually into conical tubes.\n3. Prepare Egg-laying Cages\nMake grape-juice agar plates by microwaving 100 ml water, 10 g brewer's yeast, 10 g glucose, and 1 g of agar. Bring to a boil 3 times in step 1.1 and add 10 g of frozen grape juice concentrate to increase visibility of eggs on the agar plate.\nWhen agar has cooled to 55 °C, pour 20 ml into 100 mm Petri dishes and allow to solidify.",
    "Cover the surface of the agar plates with a yeast paste by mixing 1 g brewer's yeast with 15 g water. Pour yeast paste onto the agar plate making sure the surface is covered, then pour off the excess, leaving a thin yeast residue behind. If multiple plates are used, the paste can be sequentially poured to multiple plates.\nTransfer agar plates into the bottom of a cage.\n\tNote: A 32 oz deli container is a good substitute for acrylic fly cages.\n\t\nMake lids for 32 oz deli containers by cutting a hole in the top and gluing a breathable mesh over the hole with non-toxic glue. If the glue is water soluble prevent water exposure to the lid.\nTransfer 200-300 flies into the container and cover with lid. Cover the mesh-protected hole with an empty Petri dish lid to prevent evaporation from the agar surface and add a moist tissue paper inside the lid if desired. Incubate flies at 25 °C overnight for 16-20 hr.\n4. Collect Eggs\nPrepare a sieve for egg collection by placing nylon mesh into a plastic bushing.\nTo retrieve the plate with eggs on it, remove flies from the cage by transferring to an empty container. If same flies will be used the next day, transfer immediately to a new cage containing a freshly yeasted grape-juice agar plate. Flies can be used for 3-5 sequential days\nRemove dead flies from the agar with a clean paintbrush, being careful to not break up the agar.\nCollect eggs by rinsing the agar plate with distilled water, gently brushing eggs from the agar surface, and pouring the slurry over the mesh. Repeat 3-4 times until all or most of the eggs have been removed from the agar plate.\n5. Dechorionate Eggs and Transfer to Sterile Diet",
    "Prepare the biosafety cabinet by spraying the inside (including sides) with 70% ethanol. Wipe the bottom with a lab tissue, and sterilize the hood with UV light for ~15 min. Sterilize all non-biological supplies (specimen cups, paintbrush, forceps, waste container, 400 ml sterilized water, and 100 ml of 0.6% sodium hypochlorite) by spraying with ethanol and immediately placing in the biosafety cabinet. Sterilize with UV light for 15 min.\nStart the first of 2 sodium hypochlorite washes by placing the bushing with the eggs into a 120 ml specimen cup or other sterile container. Slowly pour ~90 ml of 0.6% sodium hypochlorite solution into the bushing until just below the rim.\nRinse eggs for 2.5 min. Periodically re-suspend the eggs by using forceps to move the bushing up and down in the hypochlorite solution.\nTransfer the bushing directly into a second specimen cup, pre-filled with 90 ml bleach, inside the biosafety cabinet.\nRepeat step 5.3 inside the biosafety cabinet. At the end of the second bleach treatment, the eggs should begin to adhere to the sides of the bushing.\nCarry out steps 5.7-5.8 in the biosafety cabinet.\nDiscard the bleach and wash the bushing with sterile water 3 times. Re-suspend the eggs several times during each washing by moving the bushing with forceps. By the end of the third washing most eggs should be attached to the side of the bushing.\nUsing a paintbrush sterilized in ethanol, transfer eggs from the side of the bushing to the sterile diet. Transfer eggs individually or in small batches. Aim for 30-50 eggs per vial. Leave the caps loose to allow oxygen to enter the tube. If vials are to remain axenic, transfer to an insect incubator; otherwise, add bacteria as below.\n6. Make Gnotobiotic Flies Using 4 Bacterial Species\nPrepare Bacteria",
    "Prepare a sterilized biosafety cabinet with necessary supplies (pipettes, pipette tip boxes, sterilized centrifuge tubes, MRS broth, and test tube racks) as in step 4.1. Wipe the outside of test tubes with an ethanol-soaked laboratory wipe before placing in biosafety cabinet.\nPellet the bacteria by first transferring 500 µl of overnight growth to a sterile microfuge tube. If bacterial density is low, add up to 1.5 ml to each tube or sequentially remove supernatant and add extra culture to the same tube. Remove samples from the biosafety cabinet and centrifuge for 10 min at 10,000 x g. Use filter tips to avoid contamination between samples.\nDetermine the density of each culture by measuring OD600. If using a multi-well plate reader, transfer 200 µl of each culture to a 96-well plate in 1-, 2-, and 4- fold dilutions.\nDetermine the amount of mMRS in which to dilute each cell pellet (5.2.2) using a plate reading spectrophotometer and the following equations. Plan to add enough broth to inoculate 50 μl to each fly vial.\n\t\t\nCollect OD600 readings for a 1:1, 1:2, and 1:4 dilution of each bacterial culture on a plate-reading spectrophotometer. Select the dilution for each bacterial strain that produces an OD600 value between 0.1 and 0.2 and use this value and its corresponding dilution factor as 'O' and 'D' in the formulas given in 6.1.4.2 or 6.1.4.3.\nIf using the 4 species described here, normalize cells to equivalent colony forming unit (CFU)/ml densities (OD600 to CFU conversion determined previously20) using this equation:\n\t\t\tE = ((O-B) x V x D)/C",
    "where E = volume to resuspend pellet in (μl), O = OD600 bacteria, B = OD600 blank media, D = fold-dilution, V = µl bacterial culture prior to centrifugation, C = OD600 of predetermined constant. See Supplemental Code File for examples of calculations using these equations. For spectrophotometers that automatically blank, use \"O\" in place of \"O-B\".\n\t\t\tNote: The predetermined constants (units OD600, normalized to 107 CFU ml-1, constants derived in20) are as follows: A. tropicalis (0.053), A. pomorum (0.038), L. brevis (0.077), L. plantarum (0.056).\nIf using other bacterial species (no CFU/OD600 constant is available), normalize density to OD600 = 0.1 using this equation:\n\t\t\tE = ((O-B) x V x D)/0.1 OD600\n\t\t\tNote: Units are the same as in step 6.1.4.2. See Supplemental Code File for examples of calculations using these equations.\nIn the biosafety cabinet, remove supernatant with a pipet tip and resuspend the pellet in fresh mMRS or PBS as calculated in step 6.1.4.2.\nInoculate Bacteria\n\t\nTransfer 50 µl of the bacteria to the conical tubes with sterile diet and dechorionated eggs in biosafety cabinet. Add bacteria after egg transfer to prevent contamination between vials.\nPlace inoculated tubes in an incubator at 25° C.\n7. Measure CFU Load/Test for Sterility\nTo measure the CFU load in whole body fly homogenates, transfer 5 flies (5-7 days post eclosion) to a 1.7 ml microfuge tube containing 125 µl of ceramic beads and 125 µl of mMRS broth. Homogenize flies using a tissue homogenizer for 30 sec at 4.0 M/sec.\n\t\nAlternatively, omit beads and hand homogenize in microcentrifuge tubes with plastic pestles for 1 min.",
    "If quantifying the gut microbiota, surface sterilize the flies to remove exogenous microbes22. Transfer flies to a microcentrifuge tube containing 100 µl 70% ethanol for 1 min, aspirate ethanol, and transfer to a new microcentrifuge tube for homogenizations. If the DNA content of the gut will be measured, rinse for 1 min with 0.6% sodium hypochlorite before the ethanol wash.\nDilute the homogenate with 875 μl mMRS, vortex for 5 sec, and pipet 120 µl of homogenate into the first well of a microtiter plate.\nPerform two sequential 1:8 dilutions using 10 µl homogenate and 70 µl MRS in the next two wells.\n\t\nRemove 10 µl from the first well and add it to the second well containing 70 µl MRS. Mix the contents of the second well thoroughly, transfer 10 µl from the second well to the third well containing 70 µl MRS, and mix thoroughly. This leads to 3 total concentrations of the original 1,000 μl homogenate: undiluted, 1:8, and 1:64. \nTransfer 10 µl of each dilution to a mMRS plate (using a multi-channel pipet if desired). Slightly incline the dish to spread the dilution several millimeters down the agar surface and allow liquid to dry before moving the plate. The liquid dries on the plate quickly if the plates are 2 days old, reducing mixing of two neighboring droplets.\nIncubate at 30 °C for 1-2 days. Remove plates from the incubator once distinct, individual colonies are visible, and count from a dilution with 10-100 isolated colonies.\nCalculate CFU per fly using the equation E  = C x D/P x V/F, where E =CFU per fly, C = number of colonies counted, D = dilution, P = µl plated, V = volume of fly homogenate, and F = number of flies homogenized.",
    "Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}