{
  "id": 13047,
  "origin_website": "Jove",
  "title": "Generation of Natural Killer Cells from Human Expanded Potential Stem Cells",
  "procedures": [
    "The present study involved in vitro experiments; therefore, ethics approval is not applicable. The established cell lines used in this study were obtained from commercial sources (see the Table of Materials).\n1. Generation of 3D organoid structures from hEPSCs\nMaintain hEPSCs by culturing them with 1 mL of EPSC medium (12-well plate) on SNL feeder cells1.\n\tNOTE: Dome-shaped colonies are observed (Figure 2A) if their expanded potency remains.\nPerform pre-differentiation of the hEPSCs.\n\t\nRemove the hEPSC medium, and add 1 mL of DFK medium (DMEM/F12 + 10% serum replacement medium, see the Table of Materials). Incubate for 2-3 days at 37 °C and 5% CO2. Perform a medium change on the second day if continuing the incubation for 3 days.\n\t\tNOTE: Under the microscope, the dome-shaped colonies are flattened (Figure 2B).\nCheck the formation of embryoid bodies by the hanging drop technique7,8.\n\t\nRemove the DFK medium, and wash with 1 mL of PBS once. Add 500 µL of 0.05% trypsin, and incubate the plate at 37 °C and 5% CO2 for 3-7 min based on the morphology.\n\t\tNOTE: The hEPSCs must be able to be detached from the feeder cells when the plate is slightly disturbed.\nRemove the trypsin, and add 2 mL of DFK medium to harvest the cells. Spin down the cells at 300 x g for 3 min at room temperature.\nRemove the supernatant with a pipette. Add 1 mL of DFK medium and 1 µL of Y27632 (see the Table of Materials) to resuspend the cells by flicking.\nCount the number of cells within the cell suspension with a hemocytometer9. Dilute the cell suspension with DFK medium and Y27632 (1,000x) so that there are 4,000 cells/25 µL of DFK medium.",
    "Fill the cap of a 10 cm Petri dish with around 30-40 drops of 25 µL of cell suspension per cap. Pour some PBS into the lower dish to prevent the evaporation of the droplets. Gently invert the cap, and cover the dish. Incubate the dish at 37 °C and 5% CO2 for 3 days.\n2. Mesoderm and hemato-endothelial patterning of the embryoid body (EB)\nCollect EBs within the droplet.\n\t\nCollect all the EBs from the droplet into a 15 mL tube using a 1 mL pipette and some PBS. Pump a little PBS into the droplet, and then aspirate out the medium, including the EBs, with the pipette.\n\t\tNOTE: Droplets that are more yellow indicate more successful formation and growth than pink droplets.\nSpin down the collected EBs at 100 x g for 1 min at room temperature, and use a pipette to remove the supernatant. Add 1 mL of medium A (from a commercially available cell differentiation kit, see the Table of Materials) to transfer the collected EBs to a non-adherent 24-well plate. Label this day as Day 0 (Figure 1).\n\t\tNOTE: Usually, all the EBs collected from one 10 cm dish are grouped and transferred to one well of a 24-well plate.\nPerform mesoderm patterning of the EBs.\n\t\nIncubate the plate for 3 days at 37 °C with 5% CO2. On Day 2, remove 500 µL of medium A (from the kit, step 2.1.2) while avoiding pipetting the EBs. Then, add 500 µL of fresh medium A.\nPerform haemato-endothelial specification of the embryoid body.\n\t\nRemove 700 µL of medium A from the well, and add 700 µL of medium B (from the kit, step 2.1.2). Culture for 7 days. Perform a half-change of medium B on Day 5, Day 7, and Day 9.\n3. NK cell differentiation",
    "Transfer the patterned EBs onto an air-liquid interface.\n\t\nSlightly tilt the plate so the EBs aggregate on the bottom. Use a 1 mL pipette to remove as much of medium B as possible while avoiding the EBs.\nPick up the EBs with a pipette by aspirating the remaining medium. Transfer them to a transwell in a 24-well plate (see the Table of Materials).\n\t\tNOTE: Restrict the numbers to two to three EBs per transwell for optimal density.\nPerform lymphoid progenitor expansion.\n\t\nAdd 500 µL of NK-1 medium (commercially available lymphoid expansion medium + 14 IU/mL IL-3, 4,500 IU/mL IL-15, 8,800 IU/mL IL-7, 26 IU/mL SCF, and 12 IU/mL ftl3L, see the Table of Materials) to the lower compartment of the transwell. Culture for 14 days, and perform a medium change every other day.\nHarvest and transfer the cells on Days 7-10 to a coated plate.\n\t\nTo coat the plate, dilute the coating material (commercially available lymphoid differentiation coating material, 100x, see the Table of Materials) in PBS. Add 1 mL of diluted coating solution to each well of a 12-well plate, and incubate the plate at 4 °C overnight. Cover the opening of the plate with wrapping film.\nAdd 200 µL of PBS into the transwell, and slowly pipette up and down around five to six times to harvest the cells released from the organoids. Avoid pipetting the organoids.\n\t\tNOTE: Round cells are released from the organoids continuously (Figure 2D).\nTransfer the harvested cell suspension to a 2 mL tube, and spin down the cells at 500 x g for 5 min at room temperature. Remove the supernatant with a pipette, and add 1 mL of NK-1 medium (step 3.2.1) to resuspend the cells by pipetting.",
    "Remove all the coating solution from the well, and wash each well of a 12-well plate with 1 mL of PBS twice.\nSplit the harvested cells at a 1:2 ratio. Transfer the cell suspension onto a coated 12-well plate (step 3.3.1). Add 1 mL of NK-1 medium so that each well has 1.5 mL of medium.\nTo perform a medium change, let the cells sit for 1-2 min to allow the cells to sink to the bottom. Carefully aspirate out 750 µL of medium. Spin down the collected supernatant at 500 x g for 5 min at room temperature.\nDiscard most of the supernatant, and resuspend in 750 µL of NK-1 medium with pipetting five to six times. Add the cells resuspended in the fresh medium into the original well.\n\t\tNOTE: This parallel system is referred to as the 2D system in Figure 1. Follow the medium change schedule of the well of the organoids the cells originated from.\nPerform NK cell maturation following the steps below.\n\t\nRemove the old medium of the 3D system, and add 500 µL of NK-2 (commercially available NK cell differentiation medium + 4,500 IU/mL IL-15, 8,800 IU/mL IL-7, 26 IU/mL SCF, and 12 IU/mL ftl3L, see the Table of Materials) into the lower compartment of the transwell. Incubate at 37 °C and 5% CO2 for 14 days.\n\t\tNOTE: Ensure that the medium is touching the bottom of the transwell.\nPerform a full medium change on the cells in the 2D system. Collect all 1.5 mL of cells from one well, and centrifuge it at 500 x g for 5 min at room temperature. Remove most of the supernatant with a pipette, and resuspend the pellet with 1.5 mL of NK-2 medium (step 3.4.1).",
    "Perform a medium change every alternate day. Slightly tilt the plate of the 3D system, and remove all the old medium outside the transwell. Add 500 µL of NK-2 medium outside of the transwell.\nTo perform a half medium change on one well of a 12-well plate for the 2D system, let the cells sit for 1-2 min to allow the cells to sink to the bottom. Carefully aspirate out 750 µL of the medium.\nSpin down the collected supernatant at 500 x g for 5 min at room temperature to prevent cell loss. Discard most of the supernatant, and resuspend in 750 µL of NK-2 medium by pipetting five to six times. Add the cells resuspended in fresh medium into the original well.\n4. Harvesting mature cells\nHarvest the cells cultured in the 2D system.\n\t\nHarvest the cells by pipetting up and down during Days 38-45. Wash with 1 mL of PBS twice. Centrifuge the cell suspension at 500 x g for 5 min at room temperature.\nRemove the supernatant with a pipette, and resuspend it in the buffer of choice (i.e., PBS + 2% FBS for flow cytometry, see the Table of Materials).\nHarvest the cells embedded in the organoid.\n\t\nCollect the medium from outside of the transwell into a 15 mL tube during Days 38-45. Wash the organoid twice by adding 200 µL of PBS inside the transwell and pipetting up and down five to six times. Transfer the suspension to the 15 mL tube.\nAdd 500 µL of PBS into a well of a 12-well plate. Transfer the organoid from the transwell to that well of the 12-well plate with forceps.",
    "Cut the organoid 20 times using a pair of scissors and forceps. Flush the remaining cells on the forceps and scissors into the well with PBS. Collect as much PBS as possible, and transfer it to the 15 mL tube used in step 4.2.1 without aspirating the organoid structure.\nAdd 500 µL of the dissociation reagent (see the Table of Materials) into the transwell to digest the organoid enzymatically. Incubate with a commercial cell detachment solution (see the Table of Materials) for 7-10 min at 37 °C and 5% CO2. Quench the reaction by adding 1 mL of PBS with 2% FBS, and collect the solution in another 15 mL tube. Wash the well with 1 mL of PBS with 2% FBS twice.\n\t\tNOTE: Determine the length of the incubation based on the morphology. Try to achieve the point at which single cells start to be released from the membrane of the 3D structure.\nAdd 1 mL of PBS with 2% FBS, and pipette up and down 8-10 times. Collect all the solutions, including the organoid structures. Transfer them to the 15 mL tube used in step 4.2.3 with a cell strainer.\nCentrifuge both of the tubes at 500 x g for 5 min at room temperature. Discard the supernatant with a pipette. Resuspend the cell pellet with the buffer of choice (step 4.1.2)."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}