{
  "id": 1859,
  "origin_website": "Cell",
  "title": "Optimized protocol to detect protein UFMylation in cells and in vitro via immunoblotting",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nAssay for UFMylation in cells\nTiming: 48 h\nWe have adopted previously reported protocols (Komatsu et al., 2004[href=https://www.wicell.org#bib3]; Tatsumi et al., 2010[href=https://www.wicell.org#bib5]; Ishimura et al., 2017[href=https://www.wicell.org#bib2]) with optimization. In addition, we have included an active (UFM1ΔC2) and defective (UFM1ΔC3) UFM1 for UFMylation detection and data interpretation.\nThe following steps describe the detailed procedure to efficiently transfect HEK293T with HA-tagged UFMylation component expression plasmids and FLAG-tagged substrate expression plasmid DNAs using PEI transfection solution.\nPlasmid transfection\nHEK293T cells were seeded the night before and transfected with plasmids DNA around 8–10 h later.\nIn the next morning, transfect cells reached 50%–60% confluency with plasmids using PEI transfection solution. Pre-warm complete DMEM and Opti-MEM in a water bath at 37°C and thaw a fresh aliquot of PEI, HA-tagged UFMylation expression plasmids, FLAG-tagged p53 expression plasmid, and empty vectors in cell culture hood.\nAdd pre-warmed 500 μL Opti-MEM in the tube A.\nAdd 54 μL PEI transfection solution in the tube A and mix by gently tipping the tube.\nTake HA-tagged expression plasmids of UBA5 (2 μg), UFC1 (2 μg), UFL1 (2 μg), DRGK1 (2 μg), UFM1 (6 μg), and FLAG-tagged p53 expression plasmid (2–6 μg) in a separate tube B.\nAdd pre-warmed 500 μL Opti-MEM to tube B and mix well by tipping the tube.\nAdd diluted DNA of tube B to diluted PEI of tube A and mix well.\ntable:files/protocols_protocol_1339_4.csv\nNote: The optimized amounts, ratios of reagents, and plasmids were listed. For different target proteins, adjust the amount of plasmid DNA that does not exceed 20 μg in total. PEI transfection solution is used for high efficiency transfection in HEK293T cells. However, alternative transfection approaches including calcium phosphate transfection or lentivirus mediated gene delivery may be considered.",
    "Incubate for 15 min at 20°C–25°C. Meanwhile, replace the medium with 8 mL fresh complete DMEM medium.\nAdd the DNA-PEI complex dropwise to cells and gently rotate the dish to mix the transfection mix and medium. Return plates to the incubator.\nAt 6–8 h after transfection, gently aspirate the culture medium and add 15 mL fresh complete DMEM to each 10 cm dish.\nHarvest cells 48 h after transfection.\nNote: Pre-warm the complete DMEM and Opti-MEM with a 37°C water bath. Pre-thaw PEI transfection solution and plasmids in cell culture hood and avoid repeated freeze-thaw cycles.\nCell collection, lysis and immunoprecipitation\nTiming: 14–16 h\nAspirate culture medium and gently rinse cells once with 6 mL PBS. Aspirate the PBS and thoroughly remove the residual liquid.\nAdd 400 μL lysis buffer dropwise to cells, collect cells using a plastic scraper and transfer them into a 1.5 mL EP tube.\nLyse cells by boiling for 7–10 min at 100°C, then centrifuge at 14,000×g for 1 min at 20°C–25°C to collect the supernatant.\nAdd 900 μL Buffer A into the supernatant and mix well by vortex for 10 s.\nCentrifuge at 14,000×g for 20 min at 4°C.\nTake out 80 μL supernatant (collected from step e) of each sample as input, and transfer the rest to a 15 mL conical centrifugal tube which is pre-filled with 8 mL ice-cold buffer A.\nAdd pre-washed beads evenly into the above 15 mL tube and vortex with a rotator at 4°C for 10–12 h.\nAdd 1× SDS loading dye to the input and boil for 10 min at 100°C, then store at −20°C freezer for use.\nIn the next morning, Spin down the overnight incubated beads at 800×g at 4°C for 5 min and aspirate the supernatant.",
    "Add 10 mL pre-cold buffer A into the 15 mL tube and mix by tapping, then centrifuge at 800×g at 4°C for 5 min. Then, discard the supernatant carefully and repeat the wash step 5 times.\nAdd 160 μL of 2× SDS loading buffer into beads for each sample and mix well, boiling for 10 min at 100°C.\nCentrifuge at 14,000×g for 2 min at 20°C–25°C and transfer approximate 160 μL of supernatant into a new 1.5 mL EP tube as IP sample, then store at −20°C freezer.\nPreparation of Anti-Flag M2 Affinity Gel during the period of the centrifuge (step e) as following:\nVortex beads stock solution thoroughly for 30 s to make a homogeneous slurry.\nTransfer the beads (30 μL beads/sample) into a 1.5 mL EP tube using a pre-trimmed 200 μL pipette tip.\nCentrifuge at 800×g for 3 min at 4°C, carefully discards the supernatant.\nAdd 1 mL buffer A to the tube and mix by tapping and centrifuge at 800×g for 3 min at 4°C, carefully aspirate the supernatant.\nResuspend beads with 1 mL buffer A and put it on ice.\nNote: To reduce the loss of beads during the washing steps, we recommend to aspirate most of the supernatant with the vacuum pump, and keep 100–200 μL of liquid at the bottom of the 15 mL tube. Aspirate the residual liquid by 200 μL pipette along the wall of the tube.\nDetection of UFMylated proteins by immunoblotting\nTiming: 24 h\nInput (5 μL) and IP (20 μL) samples were separated on 10% SDS-PAGE gel and then transferred to 0.22 μM PVDF membrane.\nNote: PVDF membranes should be immersed in a methanol bath for 1 min with a shaker for activation of PVDF membrane before transfer of protein samples from SDS-PAGE.",
    "The PVDF membranes were blocked by 5 % (w/v) nonfat dry milk for 1 h at 20°C–25°C and incubated with primary antibodies at 4°C on a shaker for 10–12 h.\nCollect the primary antibodies.\nRinse PVDF membranes with 20 mL TBS with 0.1% tween-20 (TBST) for 5 min on a shaker 3 times.\nIncubate membranes with secondary antibodies for 1 h on a shaker at 20°C–25°C .\nRinse PVDF membranes as described above.\nPrepare fresh ECL solution and incubate PVDF with ECL solution for 30–60 s at 20°C–25°C .\nAdjust the chemiluminescence signals and record images.\nNote: For the very weak signals, we recommend that a high sensitivity ECL solution can be used, such as SuperSignalTM West Femto Maximum Sensitivity Substrate (Thermo Fisher).\nAssay for UFMylation in vitro\nTiming: 2–3 days\nA substrate protein can be UFMylated in an in vitro system containing UBA5 (E1), UFC1 (E2), UFL1 (E3), DDRGK1 and UFM1 in the presence of ATP. Here, we describe the detailed procedure we used to determine p53 as a novel substrate of UFMylation.\nQuantify and adjust the concentration of each component (UBA5, UFC1, DDRGK1, UFL1, and UFM1) with Coomassie brilliant blue (CCB).\nNote: This in vitro UFMylation procedure was referred to the protocol established by Kanako Tatsumi (Tatsumi et al., 2010[href=https://www.wicell.org#bib5]). To reconstitute in vitro UFMylation system with all indicated components (including UBA5, UFC1, DDRGK1, UFL1, and UFM1), we quantified the relative concentration of each component using densitometry based on the CCB staining and reconstituted in vitro UFMylation reaction by adding all components at equal amount.\nPreparation of 12% SDS-PAGE gel.\nLoad each protein separately about 100–300 ng per well.\nStain gels with staining solution for 2–4 h and de-stain gels with destaining solution for 2–4 h.\nRecord images and quantify the relative concentrations.",
    "Adjust the loading quantities of each component and make a vitro UFMylation reaction with an equal amount of each component.\nPerform in vitro assay of UFMylation.\nPrepare a master mix of in vitro UFMylation reaction in PCR tube as follow:\ntable:files/protocols_protocol_1339_5.csv\nNote: The amount of each component in the table is for one reaction. The amount of substrate protein depends on its concentration based on the CCB staining, and the final volume of each reaction can be scaled proportionally up by the number of reactions in the experiment. We recommend keeping all reagents in an ice bath during the procedure.\nIncubate the master mix at 30°C for 90 min.\nAdd 5 μL of 5× Loading buffer and mix well, then boil for 5 min at 100°C.\nCentrifuge at 14,000×g for 1 min at 20°C–25°C, then store at −20°C freezer.\nAnalysis UFMylation of substrate protein by immunoblot, detected by an antibody of the substrate protein as described above.\nNote: If substrate (p53) protein was modified by UFM1 successfully, at least two bands will be detected (Figure 2[href=https://www.wicell.org#fig2])."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Cell Biology",
    "Protein Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}