{
  "id": 18107,
  "origin_website": "Jove",
  "title": "Murine Salivary Functional Assessment via Pilocarpine Stimulation Following Fractionated Radiation",
  "procedures": [
    "All in vivo procedures outlined below were approved by the University Committee on Animal Resources at the University of Rochester, Rochester. NY.\n1. Preparation\nUsing an analytical balance, weigh 20 mg of pilocarpine. Dissolve it in 2 mL of sterile saline in a microcentrifuge tube.\n\tNOTE: Because pilocarpine is light sensitive and loses activity over time, this solution should be prepared the day of injection, and protected from light until administered.\nUsing an analytical balance, weigh and identify all collection tubes and glass capillaries. The number of collection tubes and glass capillaries should match the number of mice.\n2. Tracheostomy\nWeigh C57/BL6 mice using an analytical balance.\nUsing a 0.5 mL syringe with 29G x ½\" needle, anesthetize mice with an intraperitoneally injected sterile saline solution of 100 mg/kg ketamine and 10 mg/kg xylazine. Proceed to the following step when the mouse no longer responds to stimuli (i.e. absence of the pedal withdrawal reflex), which generally occurs within 5 to 10 min following injection.\nAfter dispensing lubricant on a cotton-tipped applicator, gently apply to eyes and place the mouse in a supine position on the stage. The anesthetized animal must be kept on warm surface.\n\tNOTE: All steps are performed at room temperature.\nSecure the nose, limbs, and tail to the stage using surgical tape.\nClean and wet the neck with an alcohol wipe.\n\tNOTE: This will help prevent fur from entering subsequent incisions.\nRaising the ventral midline neck skin with forceps, make a small, superficial cut using dissecting scissors. Guide the scissors into the opening and slowly open the blades subcutaneously to separate tissue planes.\nKeeping the skin raised, carefully cut to 1 cm below the mouth.",
    "Make two lateral incisions at the inferior and superior aspects of the first cut. Using forceps, gently reflect away the skin to enable access to head and neck structures.\nUsing the dissecting microscope at 8X magnification, visualize the submandibular glands (midline: Figure 1).\nUsing fine forceps, gently lift the glands to expose the four infrahyoid (strap) muscles overlying the trachea. Avoid tearing or disrupting the surrounding vasculature or excretory ducts.\nIf collecting saliva from more than one mouse, repeat steps 2.1 - 2.10 with each mouse before continuing.\n\tNOTE: This procedure can be safely performed on up to 5 mice concurrently.\nWith small dissecting scissors, remove the medial portion of strap muscles while staying as close to midline as possible. Cut only as much as necessary to visualize trachea and keep strap muscles out of the way during the procedure. Avoid nicking any nearby vessels because if there is volume depletion secondary to significant hemorrhage, pilocarpine will not be effective at inducing secretion.\nReflect the strap muscles away from the trachea.\nVisualize the larynx, trachea, and thyroid gland. Ensure that the trachea is clear of overlying tissue.\nMake a horizontal incision in the trachea inferior/posterior to the thyroid using small dissecting scissors. Ensure that the airway is patent and clear of fluid.\n3. Saliva Collection\nRemove the tape near mouth and angle dissection stage downward (45°, cranially) to assist with saliva flow.\nUsing a 0.5 mL syringe with 29G x ½\" needle, perform intraperitoneal injection of 10 µL/g body weight pilocarpine for a total dose of 100 mg/kg.\nStart a timer. If dosing multiple mice, reduce lead time by moving quickly and by having an assistant simultaneously inject the remaining mice.\nUsing standard forceps, open the mouth for capillary tube access.",
    "Once a bead of saliva is observed in the mouth, place the proximal end of the capillary tube into the fluid, with the distal end placed into a collecting tube positioned below the dissecting stage (both tubes pre-weighed).\n\tNOTE: In C57/BL6 female mice 6 - 10 weeks of age, gross salivation occurs within 2 min of pilocarpine injection.\nIf saliva is building in the mouth, but not flowing through the tube, reattempt previous step. Ensure that the tube is not placed directly against a mucosal surface, which can obstruct the inlet.\nCollect saliva for a total of 12 min following pilocarpine stimulation. Ensure that the stoma remains clear.\n\tNOTE: Increased tidal volume and secretions (salivary, urinary, fecal) are normal during this time.\nIf mice have depressed saliva function (e.g., due to injury or intervention), transfer the remaining fluid from the mouth to the collection tube using a P200 micropipette. If collecting from multiple mice, ensure that tips are changed.\nRecord the weight of collected saliva plus tubes 12 min after pilocarpine injection.\n4. Gland Dissection\nEuthanize mice by CO2 euthanasia (as described in the AVMA Guidelines for Euthanasia of Animals: 2013 Edition) followed by thoracotomy, taking care to preserve the structures of the head and neck. For this reason, avoid cervical dislocation as a method of euthanasia.\nPlace the mouse in a supine position on the stage. Reposition glands in the original site over the trachea (Figure 1).\nUsing a dissecting microscope under 8X magnification, visualize the major glands: the PG, SMG, and SLG. To distinguish the glands during the dissection, identify that the PG is diffuse, lying lateral to the SMG and SLG.\n\tNOTE: If dissecting the PG, this should be done first because it is the least defined and most likely to be torn.",
    "Grasp the tail of the PG with forceps, pulling it away from underlying structures, and gently apply tension before cutting the head of the PG with dissecting scissors.\nBreach the capsule surrounding the SMGs using forceps. Gently separate the left and right SMG.\nFree the dorsal aspect of the SMG from adhered nonglandular tissue using forceps.\nRemove the SMG from the neck by drawing Wharton's duct taut with forceps and cutting the duct with dissecting scissors.\nGently separate the SLG from the SMG using forceps.\n\tNOTE: The SLG is in the superolateral aspect of the SMG.\nUsing an analytic balance, record SMG weights.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}