{
  "id": 17543,
  "origin_website": "Jove",
  "title": "Co-Translational Insertion of Membrane Proteins into Preformed Nanodiscs",
  "procedures": [
    "1. Preparation of S30 lysate\nDay 1: Streak out cells from glycerol stocks on an LB agar plate and incubate at 37 °C overnight.\nDay 2: Inoculate 200 mL of LB medium with the cells from the agar plate and incubate at 37 °C for 12-14 h.\nDay 3: Inoculate 10 L of sterile YPTG medium (10 g/L yeast extract, 16 g/L tryptone, 5 g/L NaCl, 19.8 g/L glucose, 4.4 mM KH2PO4, 8 mM K2HPO4) tempered to 37 °C in a 15 L stirred tank reactor with 100 mL of the pre-culture (1:100). Cultivate at 37 °C, 500 rpm and high aeration (~ 3 air volumes per minute). To prevent excessive foaming, add sterile antifoam.\nMeasure optical density (OD) at 600 nm in regular time intervals. After approximately 2 h the culture will enter the log-phase.\nModification for HS30 lysate: When cells are in mid log phase (OD600 ≈ 3.6-4.2) add 300 mL of ethanol to the culture medium and proceed cultivation at 42 °C, 500 rpm, and high aeration (approximately 3 air volumes per minute) for another 45 min. Then proceed with cooling and harvesting of the cell culture as described in step 1.6. For the production of standard S30 lysate, skip this step and proceed with step 1.6.\nWhen cells are in mid log phase (OD600 ≈ 3.6-4.2), cool fermenter below 20 °C within < 30 min. The final OD600 should be around 4.5-5.5. Harvest cells at 4,500 x g for 20 min at 4 °C and discard the supernatant. Keep cells at 4 °C throughout the following steps.\n\tNOTE: During cooling, excessive foaming can occur. In this case, either add antifoam or reduce stirring speed and/or decrease the air stream in the bioreactor.",
    "Suspend cells completely in 300 mL of S30-A buffer (10 mM Tris-HCl, pH 8.2, 14 mM Mg(OAc)2, 60 mM KCl, 6 mM 2-mercaptoethanol) using a spatula followed by pipetting the suspension up and down until homogeneity. Centrifuge at 8,000 x g for 10 min at 4 °C. Repeat this step twice.\n\tCAUTION: 2-mercaptoethanol is toxic. Avoid contact with skin or respiratory tract. If possible, work under a hood. Weigh the empty centrifuge beaker before the last washing step. After centrifugation, weigh the wet cell pellet and either proceed with step 1.8 or store the pellet until further use.\n\tNOTE: The weight of the wet cell pellet is 5-7 g per 1 L bioreactor culture. At this point the protocol may be paused and the pellet can be frozen in liquid nitrogen and stored at -80 °C for 4-8 weeks.\nSuspend cells thoroughly in 1.1 volumes (1 g = 1 mL) of S30-B buffer (10 mM Tris-HCl, pH 8.2, 14 mM Mg(OAc)2, 60 mM KOAc, 1 mM DTT, 1 tablet of cOmplete protease inhibitor). Fill the suspension into a pre-cooled French press pressure cell and disrupt cells at 1,000 psig. Pass cells through the French press once.\nCentrifuge the lysate at 30,000 x g for 30 min at 4 °C. Transfer the supernatant into a fresh tube and repeat the centrifugation step.\n\tNOTE: A loose and slimy layer may be present on top of the pellet after the first centrifugation, which should not be transferred with the supernatant.\nApply a high salt and heat step to remove unstable lysate components and to release mRNA from ribosomes. Adjust the lysate to 0.4 M NaCl and incubate at 42 °C for 45 minutes in a water bath.",
    "NOTE: This step will cause significant precipitate formation. Flip or invert the tube during incubation from time to time.\nTransfer the turbid suspension (usually 50-80 mL) into dialysis tubes with a 10-14 kDa cutoff and dialyze against 5 L S30-C buffer (10 mM Tris-HCl, pH 8.2, 14 mM Mg(OAc)2, 60 mM KOAc, 0.5 mM DTT). Exchange the S30-C dialysis buffer after 2-3 h and dialyze for another 12-14 h.\nDay 4: Transfer the dialyzed suspension into centrifuge tubes and centrifuge at 30,000 x g for 30 min at 4 °C. Transfer supernatant (S30 lysate) into fresh 50 mL tubes and gently mix. The protein concentration of the lysate should be approximately 30-40 mg/mL. Shock freeze aliquots (e.g. 0.5 mL, 1 mL) in liquid nitrogen and store at -80 °C. The aliquots are stable for > 1 year.\n2. Expression and purification of T7 RNA polymerase\nDay 1: Inoculate 200 mL LB medium containing 100 µg/mL ampicillin with freshly plated BL21(DE3) Star x pAR1219 cells and incubate at 37 °C and 180 rpm for 12-16 h.\nDay 2: Inoculate 1 L terrific broth (12 g/L tryptone, 24 g/L yeast extract, 4 mL/L glycerol) in a 2 L baffled flask with 10 mL of the pre-culture and incubate at 37 °C and 180 rpm agitation. The starting OD600 should be around 0.1.\nWhen the OD600 reaches 0.6-0.9, add IPTG to a final concentration of 1 mM to induce T7RNAP expression and continue cultivation for another 5 h.\nHarvest cells by centrifugation at 4,500 x g for 20 min at 4 °C. Freeze cells in liquid nitrogen and store at -80 °C.\n\tNOTE: The protocol may be paused here.",
    "Day 3: Add 30 mL of ice-cold suspension buffer (30 mM Tris-HCl, pH 8.0 with one tablet of cOmplete protease inhibitor) to the frozen cell pellet and thaw the pellet in a water bath at room temperature. Then, suspend the pellet by pipetting up and down until homogeneity.\nPerform cell disruption using a French press as described in the previous section or use a sonication device according to manufacturer’s recommendations. Subsequently, centrifuge at 20,000 x g for 30 min at 4 °C and transfer supernatant into a fresh tube.\nTo precipitate genomic DNA, add streptomycin sulfate slowly and under gentle agitation to the supernatant until a final concentration of 3% (w/v) is reached. Incubate at 4 °C for 5-10 min under gentle agitation. Centrifuge at 20,000 x g for 30 min at 4 °C.\nFilter the supernatant with a 0.45 µm filter and load it on a Q-Sepharose column with a column volume (CV) of 40 mL equilibrated with 2 CV equilibration buffer (30 mM Tris-HCl, pH 8.0, 10 mM EDTA, 50 mM NaCl, 5% glycerol and 10 mM 2-mercaptoethanol) using a peristaltic pump at a flow rate of 4 mL/min. Then, connect the column to a UV detector and continue elution with equilibration buffer until the UV signal at 280 nm reaches a stable baseline.\nElute T7RNAP with a gradient from 50 mM to 500 mM NaCl per CV at a flow rate of 3 mL/min. Collect 1 mL fractions and prepare samples for SDS-PAGE analysis by mixing 10 µL of each fraction with 2 x SDS sample buffer. Run SDS-PAGE and stain the gel with Coomassie Blue R. T7RNAP should appear as a prominent band at approximately 90 kDa along with numerous additional bands of impurities.",
    "Pool fractions containing T7RNAP and dialyze using membranes with a 12-14 kDa MWCO for 12-16 h in dialysis buffer (10 mM K2HPO4/KH2PO4, pH 8.0, 10 mM NaCl, 0.5 mM EDTA, 1 mM DTT, 5% (w/v) glycerol).\nDay 4: Collect T7RNAP solution and concentrate using filter units with 12-14 MWCO to a final concentration of 3-10 mg/mL. T7RNAP may start to precipitate during concentration. Stop concentration instantly as soon as turbidity in the sample occurs. Add glycerol to a final concentration of 50% (w/v) and mix gently. Shock-freeze 0.5-1 mL aliquots and store at -80 °C. Working T7RNAP aliquots can be stored at -20 °C.\n\tNOTE: Approximately 20-40 mL of 5 mg/mL partially purified T7RNAP with 20,000-40,000 units should be obtained from a 1 L fermentation. To test the optimum amount of each T7RNAP batch, CF expression reactions of green fluorescent protein (GFP) containing 0.02 mg/mL-0.1 mg/mL of the prepared T7RNAP sample should be performed.\n3. Expression and purification of MSP1E3D1\nDay 1: Transform E. coli BL21 (DE3) Star cells with the pET28(a)-MSP1E3D1 vector31 using standard heat shock transformation or electroporation protocols. Streak out or plate transformed cells on LB agar containing 30 µg/mL kanamycin and incubate at 37 °C for 12-16 h.\nDay 2: Inoculate 200 mL of LB medium supplemented with 0.5% (w/v) glucose and 30 µg/mL kanamycin with a single colony picked from the agar plate and incubate at 37 °C at 180 rpm for 12-16 h.\nDay 3: Inoculate 10 L LB medium supplemented with 0.5% (w/v) glucose and 30 µg/mL kanamycin with 100 mL of the pre-culture in a stirred-tank bioreactor. Conduct fermentation at 37 °C, 500 rpm and aeration of approximately 3 bioreactor volumes per minute. In the case of excessive foaming, add antifoam.\n\tNOTE: Baffled shaking flasks may be used instead of a fermenter.",
    "At OD600 of 6.5-7.5, add IPTG to a final concentration of 1 mM and continue incubation at 37 °C for 1 h. Harvest cells by centrifugation at 4,500 x g for 20 min at 4 °C. Wash cell pellets with 200 mL of 0.9% (w/v) NaCl and centrifuge again at 8,000 x g for 10 min at 4 °C. Discard supernatant and transfer cells into 50 mL tubes using a spatula. The expected wet pellet weight is 8-12 g per L of bioreactor culture. Shock-freeze cell pellets in liquid nitrogen and store at -80 °C until further use.\n\tNOTE: The protocol can be paused here.\nDay 4: For purification, thaw cell pellets in a water bath at RT. Suspend the cells in MSP-A buffer (40 mM Tris-HCl, pH 8.0, 300 mM NaCl, 1% (w/v) Triton X-100, 1 tablet of c0mplete protease inhibitor cocktail per 50 mL cell suspension) to yield a 30-40% (w/v) cell suspension.\nDisrupt cells by sonication or using a French press and centrifuge at 30,000 x g for 30 min at 4 °C. Transfer the supernatant into a fresh tube and filter through a 0.45 µm filter. Apply the filtrate on a Ni2+ loaded nitrilotriacetic acid column (CV > 15 mL) equilibrated with 5 CV of MSP-B buffer (40 mM Tris-HCl, pH 8.0, 300 mM NaCl, 1% (w/v) Triton X-100) by using a peristaltic pump.\n\tNOTE: To facilitate filtration, the supernatant can be sonicated for another minute to break down large DNA fragments.",
    "After sample loading, wash the column with 5 CV MSP-B, 5 CV MSP-C (40 mM Tris-HCl, pH 8.9, 300 mM NaCl, 50 mM cholic acid), 5 CV MSP-D (40 mM Tris-HCl, pH 8.9, 300 mM NaCl), 5 CV MSP-E (40 mM Tris-HCl, pH 8.0, 300 mM NaCl) and 5 CV MSP-F (40 mM Tris-HCl, pH 8.0, 300 mM NaCl, 50 mM imidazole).\n\tNOTE: Cholic acid in the MSP-C buffer is important to remove lipids attached to MSP. Cholic acid is not completely soluble at low pH values. The pH value must therefore be adjusted to 8.9 in MSP-C and MSP-D. It is important to wash the column with MSP-D buffer, as a lower pH might cause residual cholic acid to precipitate and to block or damage the column.\nElute MSP with MSP-G (40 mM Tris-HCl, pH 8.0, 300 mM NaCl, 300 mM imidazole). Collect fractions of 1 mL and monitor UV absorption at 280 nm. Collect and pool the fractions of the elution peak.\nTransfer pooled MSP fractions into 12-14 kDa MWCO dialysis membrane tubes and dialyze against 5 L of MSP-H (40 mM Tris-HCl, pH 8.0, 300 mM NaCl, 10% (w/v) glycerol) for 2-3 h at 4 °C. Change to fresh 5 L MSP-H buffer and dialyze for another 12-16 h at 4 °C.\nDay 5: Transfer MSP solution into centrifuge tubes and centrifuge at 18,000 x g for 30 min at 4 °C to remove precipitate. Transfer supernatant into a fresh tube and concentrate to 200-800 µM using ultrafiltration devices with 12-14 kDa MWCO at 4 °C. Measure concentration using a UV/VIS measuring device. Use extinction coefficient of 27.31 M-1 cm-1 and the molecular mass of 31.96 kDa for calculation of concentration.\n\tNOTE: Expression in a bioreactor usually yields 15-30 mg of MSP1E3D1 per L culture.",
    "Shock-freeze aliquots of the concentrated MSP solution in liquid nitrogen and store at -80 °C.\n4. Assembly of MSP1E3D1 nanodiscs\nDay1: Prepare 1-2 mL of 50 mM lipid stocks (DMPG, DOPG, POPG DMPC, DOPC or POPC) in 100 mM sodium cholate. Store at -20 °C if not used on the same day.\n\tNOTE: The lipid solution must be clear. If the solution is not clear, sodium cholate concentration may be increased to 150 mM.\nMix the MSP1E3D1 solution with the lipid solution. Add dodecyl phosphocholine (DPC) at a final concentration of 0.1% (w/v). Assembly reactions may be adjusted to final volumes of 3 mL (Table 2) or 12 mL corresponding to typical volumes of dialysis cassettes (10 kDa MWCO). Incubate assembly reactions for 1 h at 21 °C under gentle agitation.\n\tNOTE: For each lipid, a specific MSP1E3D1:lipid ratio has to be used to ensure homogeneous nanodisc preparation (Table 2). For new lipids or lipid mixtures, the optimal ratio should be determined with a pilot experiment and size exclusion chromatography analysis14.\nPre-wet the membrane of a dialysis cassette with disc formation (DF) buffer (10 mM Tris-HCl, pH 8.0, 100 mM NaCl). Transfer the assembly mixture into the dialysis cassette with a syringe. Potential air bubbles can be removed by aspiration using the syringe.\nDays 1-4: Dialyze against 3 x 5 L DF buffer for 10-20 h at RT under agitation using a stirring bar. Then transfer the assembly mixture from the dialysis cassette into centrifugal filter units with 10 kDa MWCO equilibrated with DF buffer. Concentrate at 4,000 x g at 4 °C.",
    "NOTE: A turbid dialysis mix could indicate a wrong stoichiometric ratio of MSP:lipid. Precipitate must be removed at 18,000 x g for 20 min at 4 °C before concentration of sample. To avoid precipitation during sample concentration, use ultrafiltration units with a large deadstop.\nConcentrate the assembled nanodiscs to a concentration of at least 300 µM. Measure concentration using an UV/VIS reader. Consider that one nanodisc is formed by two MSP1E3D1 molecules and thus, the concentration of MSP must be divided by 2 to determine the correct amount of nanodiscs.\n\tNOTE: The described setup (Table 2) will yield 0.6-1 mL of a 300 µM nanodisc solution.\nCentrifuge the concentrated nanodisc preparation at 18,000 x g for 20 min at 4 °C to remove precipitate. Then, aspirate the supernatant and shock-freeze 50 µL aliquots in liquid nitrogen and store at -80 °C.\n\tNOTE: It is advisable to evaluate the success of nanodisc formation using size exclusion chromatography. The sample should be monodisperse and should contain only a low amount of aggregates. Aggregates indicate that the amount of lipid in the setup is too high. As a reference, purified MSP1E3D1 can be used. If the nanodisc preparation shows a peak at the height of the reference MSP1E3D1 peak, the chosen lipid to MSP1E3D1 ratio was too low.\n5. Preparative scale 3 mL CECF reaction setup\nDay 1: Prepare all necessary stock solutions as listed (Table 3). Stocks are stored at -20 °C and thawed at room temperature. Make sure to thoroughly mix all stocks after thawing and before pipetting. Calculate the required volumes for all stocks and make a pipetting scheme (Table 4). High-molecular weight compounds will only be added into the RM. For the low-molecular weight compounds, a combined 3 x mastermix for RM and FM can be prepared.",
    "NOTE: Final volumes of compound mixtures might be less than calculated due to volume loss during mixing. This can be avoided by adding an excess volume of 2-5% to compensate for volume loss.\nEquilibrate the membrane of a 3 mL dialysis cassette in 100 mM Tris-acetate, pH 8.0. Make sure to remove excess buffer.\nUsing a syringe to transfer the RM into the dialysis cassette. Remove excessive air in the RM compartment by aspiration with the syringe. Place the dialysis cassette into the dialysis chamber.\nFill up the dialysis chamber with 60 mL of FM. Place the lid on the chamber and tighten the screws to fix it. Incubate the chamber for 12-16 h at 30 °C at 200 rpm.\n\tNOTE: Make sure that the chamber remains in the upright position during agitation, otherwise exchange of low molecular compounds will be hampered. \nDay 2: Using a syringe, aspirate the RM from the dialysis chamber. Transfer the RM to fresh tubes and centrifuge at 16,000 x g at 4 °C for 10 min to remove precipitate. Transfer the supernatant into fresh tubes. The protein in the supernatant can now be further analyzed.\n\tNOTE: In some cases, a pellet will be present after centrifugation. This can provide important information on the suitability of the analyzed nanodiscs or the reaction compounds to keep the synthesized MP soluble. It is therefore advisable to analyze the amount of target potentially present in the precipitate by using SDS-PAGE, Western Blot, or by visual evaluation of the pellet size.\n6. Analytical scale 60 µL CECF reaction setup for Mg2+ ion screening",
    "Day 1: Mix all components of the respective 3x master mix and distribute 60 µL to the RM and 825 µL to the FM. Fill up FM with H2O and mix FM by vortexing. Transfer FM into 3 wells of the 24 well microplate (Table 5).\n\tNOTE: Since the customized Mini-CECF container might not be accessible, the volumes in Table 5 are calculated for a reaction carried out in dialysis cartridges (10-14 kDa MWCO, RM: 100 µL) with a FM volume of 1.7 mL in 96 deep-well (2 mL) plates (Figure 1).\nCut regenerated cellulose dialysis tubes with a 10-14 kDa MWCO into approximately 25 x 20 mm sized pieces and store in H2O with 0.05% (w/v) sodium azide.\n\tCAUTION: Sodium azide is very toxic. Avoid any contact with skin or mucous membrane. Do not use metal containers as sodium azide can react with metals to form explosive metal azides.\nBefore Mini-CECF container assembly, remove excessive H2O from the dialysis membranes with a tissue. Place one membrane piece on each container and fix the membranes with a polytetrafluorethylene ring.\nTransfer the Mini-CECF container into the wells of a 24-well plate with 825 µL of FM. Avoid air bubbles below the dialysis membrane of the Mini-CECF container.\nAdd high molecular components to the RM as described (Table 5) and mix by pipetting up and down. Add 60 µL to the reaction container. Avoid air bubbles during transfer of the viscous solution.",
    "Cut 2 8 x 10 cm sheets of a sealing thermoplastic film and wrap them around the 24-well plate with the reaction containers inside. This will reduce evaporation from the reaction mixture. Now place the lid of the cell culture plate on the plate and fix it with tape. Incubate the plate at 30 °C and 200 rpm agitation for 12-16 h.\nDay 2: Harvest the reaction mix by piercing through the dialysis membrane with the pipet tip at the Mini-CECF container and aspirate the RM. Transfer RM into fresh tubes and centrifuge at 16,000 x g at 4 °C for 10 min to remove precipitates. Transfer the supernatant into fresh tubes. The protein in the supernatant can now be further analyzed.\n\tNOTE: In some cases, after centrifugation a pellet will be present. This can provide important information on the suitability of the analyzed nanodiscs or other reaction compounds to keep the synthesized MP soluble. It is therefore advisable to analyze the amount of target potentially present in the precipitate by SDS-PAGE, Western Blot, or visual evaluation of the pellet size.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}