{
  "id": 18283,
  "origin_website": "Jove",
  "title": "Assessment of Spontaneous Alternation, Novel Object Recognition and Limb Clasping in Transgenic Mouse Models of Amyloid-β and Tau Neuropathology",
  "procedures": [
    "The methods detailed in this publication were reviewed by the institutional animal care and use committee (IACUC) at Hilltop Laboratory Animals to ensure proper care, use, and humane treatment of animals in compliance with applicable federal, state, and local laws and regulations, such as the federal Animal Welfare Regulations, or AWRs (CFR 1985), and Public Health Service Policy on Humane Care and Use of Laboratory Animals, or PHS Policy (PHS 1996).\n1. General Guidelines for all Behavioral Assessment\nBefore any animal handling, cover existing cage cards with a new cage card that indicates only the unique, blinded animal identifier.\n\tNOTE: Investigators that handle mice during routine compound/placebo dosing are not permitted to handle mice for behavioral assessment.\nDim or turn off the overhead lights and adjust the lighting such that illumination at the floor of the arena or maze is 30-35 lux.\nFor studies that span several weeks, record body weights weekly as an indirect measure of overall health.\n\tNOTE: Additional cage-side checks for coat quality, posture, gait and spontaneous locomotion can be included if more robust health checks are warranted.\n2. Habituating Mice to Handling by Investigators\nTwo days prior to any behavioral test, habituate the mice to handling. Remove the cage from the cage rack and place on a level surface.\nRemove the lid from the cage. Handle the mouse exactly as it would be handled during performance of the upcoming behavioral test. Place the mouse into a cupped hand above the home cage.\nMeasure the latency to jump from the investigator's hand back into the home cage. Hold mice for a maximum of 5 s.\n\tNOTE: Mice that exhibit latencies of ≥2 s are deemed \"habituated\". Mice that exhibit latencies <2 s during the first trial undergo 2 additional habituation sessions that day.",
    "Have the mice undergo 2 consecutive days of handling habituation. Note any mouse that is not habituated by the end of the 2nd day.\n3. Assessing Spatial Working Memory by Measuring Spontaneous Alternation in a Y-maze8\nPrior to initial use, thoroughly clean the Y-maze with an unscented bleach germicidal wipe, 70% EtOH, followed by dH2O9. Clearly designate the arms of the maze as 'A', 'B' & 'C' or other comparable unique identifiers.\nPrior to the start of a testing session, set the data acquisition system or video cameras and set up proper tracking of mice in the maze. Calibrate the distance in the maze using captured video images of a ruler or other object of known length.\n\tNOTE: The behavioral methods in this procedure will work with a variety of data acquisition systems and the authors assume anyone performing this procedure is proficient in the use of their chosen data acquisition system. Power analyses indicate that sample sizes of 10-15 mice per group are required for a β ≤0.2.\nRemove the cage from the rack and gently place it on a table in close proximity to the Y-maze. Remove the mouse from its home cage and gently place it into one arm of the Y-maze, facing the center. Have the investigator step far enough away from the maze so that the mouse cannot see the investigator.\nActivate the data/video acquisition system immediately after placement of the mouse into the maze.\nPress play and record the spontaneous behavior for each mouse for a period of 10 min. Once a session is complete, gently place the mouse back into its home cage and return the cage to the rack.",
    "Clean the maze thoroughly between each session with an unscented bleach germicidal wipe, 70% EtOH, followed by dH2O. Repeat from step 3.4 to assess all mice.\nOnce all mice have completed exploration of the Y-maze, analyze the data from the acquisition system or manually score the videos of the sessions. An arm entry occurs when all 4 paws of the mouse cross the threshold of the central zone and into the arm and the animal's snout is oriented toward the end of the arm.\n\tNOTE: Endpoints that will be analyzed include: total distance traveled in the maze, total distance traveled within each arm (including the central zone), total time spent in each arm (including the central zone), total number of arm entries, number of entries made into each arm, and a sequential list of arms entered to assess number of alternations made.\nA spontaneous alternation occurs when a mouse enters a different arm of the maze in each of 3 consecutive arm entries. Spontaneous alternation % is then calculated with the following formula.\nimgsrc://cloudfront.jove.com/files/ftp_upload/55523/55523eq1.jpg\n\tNOTE: For example, if the order of arm entry was: ABCCBABCABC, investigator would score a total of 6 spontaneous alternations (in order: ABC, CBA, ABC, BCA, CAB, ABC). With a total of 11 arm entries, the spontaneous alternation % would be 67%.\nMake the following quality control checks to ensure the data represent an unbiased assessment of spontaneous alternation.\nPerform a Pearson's correlation of spontaneous alternation % to both total distance traveled and number of arm entries made.\n\t\tNOTE: If there is a significant correlation of spontaneous alternation % to either parameter, then data should be further scrutinized due to potential influence of hyperdynamic locomotion on the apparent cognitive endpoint10.\nAnalyze number of entries made into each arm with a 1-way ANOVA test.",
    "NOTE: If this analysis is significant then this would indicate presence of cues in the environment that attracted mice to a particular region of the maze.\n4. Assessment of Intermediate-term Recognition Memory by Measuring Novel Object Recognition11,12,13\nFor each phase of this test, thoroughly clean the open field arena with an unscented bleach germicidal wipe, 70% EtOH followed by dH2O prior to initial use.\nOne day prior to object exposure, habituate the mice to the open field arena.\nPrior to the start of the habituation session, set up the data acquisition system or video cameras and confirm proper tracking of mice in the maze. Calibrate the distance in the arena using captured video images of a ruler or other object of known length. Mark the corners of the arena in the software to permit scoring of positional biases.\n\t\tNOTE: The behavioral methods in this procedure will work with a variety of data acquisition systems and the authors assume anyone performing this procedure is proficient in the use of their chosen data acquisition system. Power analyses indicate that sample sizes of 15-20 mice per group are required for a β ≤0.2.\nRemove the cage from the rack and gently place on a table in close proximity to the arena.\nRemove the mouse from the home cage and gently place the mouse in the center of the arena. Turn on the tracking software and/or video recording system immediately after placing the mouse into the arena.\nAllow mice to freely explore the arena for 30 min.\n\t\tNOTE: During this period, investigators will not disturb the mice.\nAfter the habituation session, place mice back into their home cage and clean the arena thoroughly with an unscented bleach germicidal wipe, 70% EtOH followed by dH2O.",
    "Repeat from step 4.2.2 until all mice have been habituated to the arena.\nAfter all mice have been habituated to the arena, analyze the video.\n\t\tNOTE: Endpoints to analyze include total distance traveled in the arena and time spent near each corner. If relevant to the mouse model, stereotyped behaviors are included in these analyses (i.e., myoclonic corner jumping, circling, etc.). Mice exhibiting biases in time spent in particular regions of the arena are excluded from further experimentation as this will influence object exploration.\n\t\tNOTE: The first phase of novel object recognition involves familiarizing mice to an object. Herein this portion of the novel object recognition procedure will be referred to as the Sample phase.\nPrior to the start of a sample phase session, place objects into the arena and fix them to the floor with a mounting putty so that animals cannot move the objects. Align two identical objects to a particular wall with enough distance between the walls and objects so that the mice can freely explore the objects from all angles.\nSet up the data acquisition system or video cameras and confirm proper tracking of mice and objects in the maze. Calibrate the distances in the arena using captured video images of a ruler or other object of known length.\nMark the corners of the arena in the software to permit scoring of positional biases. Mark objects in software and track their exploratory behavior separately for each object (i.e., \"Object A\" and \"Object B\").\nRemove the cage from the rack and gently place it on a table in close proximity to the arena.\nRemove the mouse from the home cage and gently place it into the center of the arena, facing the objects.",
    "Allow the mouse to freely explore the objects for 15 min. During this period do not disturb the mice.\nAt the end of the session, gently place the mouse back into its home cage. Clean the arena and objects with 70% EtOH and dH2O. Place these objects back into the arena.\nRepeat step 4.2.11 until all mice are familiarized to an object.\nOnce all mice have been familiarized to an object, analyze the videos.\n\t\tNOTE: Object explorations are counted once the following criteria have been met: the mouse is oriented toward the object, the snout is within 2 cm of the object, the midpoint of the animal's body is beyond 2 cm from the object, and the previous criteria have been fulfilled for at least 1 s. Additionally, if an animal has satisfied the exploration criteria but exhibits immobility for > 10 s then the exploratory bout is deemed finished.\nCalculate an object bias score for each mouse as follows.\nimgsrc://cloudfront.jove.com/files/ftp_upload/55523/55523eq2.jpg\n\t\tNOTE: Mice exhibiting an object bias score below 20% or above 80% are excluded from further experimentation.\nThe final phase of novel object recognition involves assessing exploratory behavior directed toward both a novel and familiar object in the environment, referred to here as the Test phase. This phase is performed 2-3 h after completion of sample phase.\nPrior to the start of a test phase session, place objects into the arena and fix them to the floor so that the animals cannot move the objects.\n\t\t\nPlace the objects in the same position in the arena relative to the sample phase13.\nBalance the relative position of novel and familiar objects across genotypes and treatment groups.\nEnsure there is enough distance between the walls and objects so that the mice can freely explore the objects from all angles.",
    "Setup the data acquisition system and/or video cameras. Confirm proper tracking of mice and objects in the maze. Calibrate distances in the arena using captured video images of a ruler or other object of known length.\nMark corners of the arena in the software to permit scoring of positional biases. Mark objects in software and track exploratory behavior for each object individually (i.e., \"Novel\" and \"Familiar\").\nRemove the cage from the rack and gently place it on a table in close proximity to the arena.\nGently place animals into the center of the arena, facing the objects. Record mice freely exploring objects for 10 min.\nAt the end of the test session, remove mice from the arena and place mice back into their home cage. Thoroughly clean arena and objects with an unscented bleach germicidal wipe, 70% EtOH and dH2O after each session.\nRepeat from step 4.4.3 until all animals have been assessed.\nOnce object exploration is measured for all mice, videos are analyzed.\n\t\tNOTE: Object explorations are counted once the following criteria have been met: the mouse is oriented toward the object, the snout is within 2 cm of the object, the midpoint of the animal's body is beyond 2 cm from the object, and the previous criteria have been fulfilled for at least 1 s. Additionally, if an animal has satisfied the exploration criteria but exhibits immobility for > 10 s then the exploratory bout is deemed finished.\nAssess novel object recognition by comparing time spent exploring the novel to familiar object. Three methods are commonly reported in the literature.\n\t\t\nAnalyze raw time spent exploring both novel and familiar objects using a repeated measure test. This method is best used when genotype and/or treatment do not affect total exploration time.\nCalculate novelty preference, using the equation:\nimgsrc://cloudfront.jove.com/files/ftp_upload/55523/55523eq3.jpg",
    "NOTE: This provides the percentage of time spent exploring the novel object relative to the total time exploring objects. Values range from 0% (no exploration of novel object) to 100% (exploration only of the novel object), with a value of 50% indicating equal time spent exploring novel and familiar objects.\nCalculate discrimination index11, using the equation:\nimgsrc://cloudfront.jove.com/files/ftp_upload/55523/55523eq4.jpg\n\t\t\tNOTE: This yields the difference in time spent exploring the novel and familiar objects relative to the total time spent exploring objects. Values range from -1 (exploration only of the familiar object) to +1 (exploration only of the novel object, with a value of 0 indicating equal time spent exploring novel and familiar objects.\nRemove animals that do not participate in the test session due to hyperdynamic locomotion or other stereotypies, from consideration11.\n\t\tNOTE: Criteria used for removal must be objective and determined a priori for the mouse model (i.e., <5th percentile for total exploration time and either >100 average turn angle during test session or >50th percentile time exhibiting myoclonic corner jumping).\n5. Assessment of Corticospinal Function in Mice with Limb Clasping14\nVideo document the entire session. Record the video using a portable hand-held device (i.e., smartphone or equivalent).\n\tNOTE: Power analyses indicate that sample sizes of 10-15 mice per group are required for a β ≤0.2.\nRemove the home cage from the rack and place it on a table. Document the animal ID in the video prior to the next step.\nGently remove the mouse from its cage and suspend by the tail for 5-10 s. The video must record the animal's hind and forepaws while suspended.\nAfter capturing at least 5 s of video, place the mouse back into its home cage, and return the cage to the rack.",
    "Clean the table. Repeat from step 5.2 until all mice have been recorded.\nScore limb clasping from videos of mice suspended by their tail on a scale from 0-4 (see Table 1 for description of scoring). Inspect videos of suspended mice and then assign a score based on the following criteria.\nNo limb clasping. Normal escape extension. One hind limb exhibits incomplete splay and loss of mobility. Toes exhibit normal splay.\nBoth hind limbs exhibit incomplete splay and loss of mobility. Toes exhibit normal splay.\nBoth hind limbs exhibit clasping with curled toes and immobility.\nForelimbs and hind limbs exhibit clasping and are crossed, curled toes and immobility.\nAll mice are scored by 2 independent investigators. Any mouse where the 2 scores differ by more than 1 point is rescored once again.\nScores that differ are averaged.\nimgsrc://cloudfront.jove.com/files/ftp_upload/55523/55523table1.jpg\nTable 1: Description of Limb Clasping Scores."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}