{
  "id": 1901,
  "origin_website": "Cell",
  "title": "Protocol for bioelectrochemical enrichment, cultivation, and characterization of extreme electroactive microorganisms",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPreparation of growth media\nTiming: 1 day\n        As explained earlier, a suitable terminal electron acceptor (TEA) should\n        be supplemented to the growth media based on the targeted microbial\n        group.\n        \n            Procedure:\n            \n                Prepare the growth medium as described in the earlier sections.\n              \n                Select the TEA after analyzing the sediment samples as well as\n                according to the desired reaction, as explained above. Analysis\n                of the Lonar lake sediment samples revealed high concentrations\n                of nitrate ions, which indicated the presence of\n                nitrate-reducing bacteria in these samples (Chaudhary et al., 2021[href=https://www.wicell.org#bib2]). Thus, nitrate is supplemented as the sole TEA in the growth\n                medium in this study.\n              \nSetting up of double-chambered electrochemical reactors\n      This section describes steps to set up the H-shaped double-chambered\n      reactor with a three-electrode configuration.\n    \nTiming: 6–7 h\n        The steps are as follows.\n        \n            Resources required:\n            \n                An autoclave instrument (CL-32L, ALP Co. Ltd.) is required to\n                sterilize different components.\n              \n                A two-chambered reactor consisting of glass chambers and all\n                accessories such as stoppers and clamps.\n              \nA pre-treated PEM.\nPre-treated working electrodes (i.e., cathode).\n                Reference electrodes such as Ag/AgCl and standard calomel\n                electrode.\n              \n                A graphite-based electrode can be used as the anode. However, we\n                recommend using MMO-coated Ti anode since it is a\n                high-performing material for water splitting reaction compared\n                to the graphite electrode.\n              \n            Procedure:\n            \n                Join the autoclaved chambers by placing the pre-treated PEM\n                between the junction. The representative schematic (Figure 1[href=https://www.wicell.org#fig1]A) and an image (Figure 1[href=https://www.wicell.org#fig1]B) of the reactor\n                are presented in Figure 1[href=https://www.wicell.org#fig1]. Maintain the\n                aseptic condition by autoclaving everything before use (except\n                the reference electrode, which is sterilized by 70% ethanol) and\n                setting up everything under sterile conditions in the laminar\n                hood (Logic+ A2, Labconco Corporation). It is necessary to avoid\n                any contamination in the electrochemical setup. Alternatively,",
    "in the initial phase of the enrichment experiments, a bench\n                flame/bunsen burner can be used to achieve aseptic conditions to\n                some extent.\n                \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1381-Fig1.jpg\n                      Figure 1. Two-chambered bioelectrochemical reactor\n                    \n(A) Schematic representation\n(B) Digital image\nNote: Autoclaved distilled\n                  water can be used in both chambers to check for any leakage.\n                \n                Place all three electrodes, viz. cathode (working electrode),\n                anode (counter electrode), and reference (Ag/AgCl), by using\n                butyl rubbers stoppers along with the chamber\n                ports/openings/head.\n              \n                Place both the cathode and anode to face the PEM with the\n                largest exposed surface area.\n              \n                Add both catholyte (same as the minimal growth medium;\n                Table 1[href=https://www.wicell.org#tbl1]) and anolyte (Table 2[href=https://www.wicell.org#tbl2]) in the respective chambers. Flush the cathodic chamber with\n                99.999% inert N2/ He at a flow rate of 0.5 L/min (He\n                gas is used in case N2 production is checked in the\n                headspace) for about 15–20 min. Then seal off all reactor\n                openings or sampling ports using butyl rubbers or other stoppers\n                to make the chamber air-tight.\n              \nMonitoring of bioelectrocatalytic current generation\nTiming: Varies according to the target\n      group and growth cycle of microorganisms. For example, for exoelectrogenic\n      microbial biofilms, the initial enrichment duration may be shorter for a\n      few days to weeks. However, for electrotrophic microbial biofilms, mostly\n      longer duration of several days to weeks may be needed.\n    \n      Based on the target reaction and literature survey, a suitable electric\n      potential is applied at the working electrode using the chronoamperometry\n      (CA) technique, and the current generation is recorded at regular time\n      intervals. This section describes the steps to conduct these experiments.\n    \n        The procedure to conduct bioelectrochemical experiments is as follows:\n        \n            Procedure:\n            \n                Connect the electrodes of the BES to the potentiostat, and apply\n                a fixed potential of −0.3 V∗ (vs. Ag/AgCl sat. KCl) at\n                the working electrode, i.e., cathode in this case.",
    "Record the Cyclic Voltammetric (CV) profiles before and after\n                inoculating the reactors in a potential window of −1.0 V–0.0 V∗∗\n                at a scan rate of 1 mV/s (Labelle and Bond, 2005[href=https://www.wicell.org#bib13]; Harnisch and Freguia, 2012[href=https://www.wicell.org#bib7]).\n                Alternatively, different scan rates (higher or lower) can also\n                be used. However, higher scan rates will mask the presence of\n                redox peaks, while the lower scan rates may disrupt the biofilm\n                leading to decreased performance (Ruiz et al., 2020[href=https://www.wicell.org#bib22]). Low scan rates can also affect the repeatability of the\n                bioelectrochemical experiments. These control CVs are conducted\n                to check the presence of any redox-active components in the\n                growth medium and at the electrode surface.\n              \n                Analyze all the CVs using the EC-Lab software accompanied with\n                the potentiostat (Biologic - VMP3 Multichannel Potentiostat).\n                Plot and calculate the first derivative for the turnover CV by\n                the same software to look for the presence of any redox peak.\n                \nNote: Other electrochemical\n                  workstations and accompanying analysis software such as\n                  that from Gamry Instruments, Metrohm, CH Instruments, etc. can\n                  also be used for bioelectrochemical experiments .\n                \n                Then perform CA at the fixed applied potential of −0.3 V\n                vs. Ag/AgCl at pH 9.5. After completing each batch\n                cycle∗∗∗, replenish the reactor with a fresh medium by\n                maintaining anaerobic conditions.\n              \n                Along with this, set two control experiments, namely, abiotic\n                and biotic. In abiotic control, to monitor the\n                (electro)chemically-induced nitrate reduction in the medium,\n                keep all the conditions identical to the main experimental setup\n                except inoculating the reactor with microbes. In biotic control,\n                inoculate the reactor but do not connect it to the potentiostat\n                to observe the microbial growth in the absence of an electron\n                donor.\n                \n∗Note: The −0.3 V potential is\n                  selected to target the nitrate reduction reaction at the\n                  cathode. It can be altered according to the desired reaction.",
    "For example, Pozo et al. applied a fixed potential of −1.105 V\n                  (vs. Ag/AgCl at pH 7) to grow the sulfate-reducing\n                  mixed microbial community in the cathodic chamber (Pozo et al., 2015[href=https://www.wicell.org#bib19]). Similarly,\n                  Yadav and Patil (2020)[href=https://www.wicell.org#bib26]\n                  have used a potential of 0.2 V (vs.\n                  Ag/AgCl at pH 9.5) to enrich acetate oxidizing\n                  haloalkaliphilic exoelectrogens at the anode surface.\n                \n∗∗Note: The potential window\n                  for recording cyclic voltammograms is selected in a manner to\n                  avoid any undesired redox reactions at the electrodes and\n                  according to the target reaction.\n                \n∗∗∗Note: The completion\n                  of a batch cycle is considered when the bioelectrocatalytic\n                  current approaches zero and almost all substrate is cosumed.\n                  The time taken by each cycle of the CA profile can vary\n                  depending upon the life cycle of the enriched microorganisms\n                  and the concentration of the nutrients.\n                \n        Along with the CA profiles, regular sample analysis is conducted.\n        \n            Procedure:\n            \n                Monitor different parameters, including OD600, pH,\n                nitrate and nitrite concentrations in the medium, and N2\n                gas in the headspace, at a regular time interval.\n              \n                Quantify the microbial growth in the bulk phase of the BES via\n                protein estimation using Bradford assay, as described earlier.\n              \nNote: Initial polarization at a fixed\n      potential allows the electrode to acclimatize it as an analog to a\n      solid-state electron donor and eliminate any redox chemicals present on\n      its surface (Gregory et al., 2004[href=https://www.wicell.org#bib6];\n      Karbelkar et al., 2019[href=https://www.wicell.org#bib9]).\n    \n      Electrochemical characterization of the cathodic biofilm\n    \nTiming: 4–6 h\n        To check the presence of any redox-active moieties or components\n        involved in the electron transfer mechanisms, for indirect (medium) and\n        direct (electrode-biofilm interface) after the completion of the\n        experiment, cyclic voltammetry (CV) is recorded at different conditions.\n        These include bare electrode (i.e., abiotic control), substrate turnover\n        and non-turnover conditions, and filtered spent medium in the new\n        electrochemical set-up (Harnisch and Freguia, 2012[href=https://www.wicell.org#bib7];",
    "Labelle and Bond, 2005[href=https://www.wicell.org#bib13]). Different conditions at\n        which CVs may be recorded are described below.\n      \nSubstrate turnover: The growth condition when the enriched EAMs\n        utilize the substrate at their maximum capabilities results in the\n        highest current production values. So, upon completing at least three∗\n        batch cycles, perform a CV at this condition. The resulting CV will most\n        likely depict the presence of redox peaks associated with the components\n        involved in the electron transfer process.\n      \nSubstrate non-turnover: The growth condition when all the\n        substrate is completely consumed results in very low or close to zero\n        current response. This CV is performed to confirm the presence of redox\n        moieties actively involved in electron transfer, even in the absence of\n        substrate.\n      \nCV with filtered spent media: After completing a batch cycle and\n        replacing the spent medium with a fresh medium, record a CV in the\n        filtered spent medium in a new electrochemical set-up to check the\n        presence of any soluble mediators involved in the electron transfer\n        processes∗∗.\n        \n∗Note: This is to ensure sufficient\n          growth of microbial biofilm at the electrode surface.\n        \n∗∗Note: For detecting the presence of\n          any soluble mediators, mass spectrophotometry may be conducted for\n          samples (biofilm and reactor suspension) and blank medium (catholyte)\n          using HR-MS (Waters Corporation, Agilent Instruments, Thermo\n          Scientific, and Zevo). In this study, HR-MS (Waters Corporation)\n          recorded mass spectrometric profiles for each sample are compared\n          against the blank and are also referred to the masslynx software. For\n          the same purpose, other mass spectrometric-based techniques such as\n          GC-MS, LC-MS, and HPLC-MS can also be used.\n        \nTesting of the use of hydrogen as the electron source\nTiming: 6–7 days\n      A trace amount of H2 gas produced (note: depends on the set\n      cathode potential and medium conditions) in the headspace could serve as",
    "an electron source for the microorganisms. A methodology to check if the\n      target group of microbes (here, nitrate-reducing microorganisms grown at\n      the cathode and in suspension) uses hydrogen as an alternate electron\n      donor is summarized in this section.\n    \n        Two different experiments which can be performed to confirm this are as\n        follows.\n        \n            Procedure for experiment 1:\n            \n                Set a BES by following the same procedure as explained earlier.\n              \n                After biofilm development at the cathode surface, electrically\n                disconnect the bioelectrochemical set-up from the potentiostat.\n              \n                Then add pure hydrogen gas (e.g., 20% [v/v] of total headspace)\n                in the cathode chamber of the unconnected BES.\n              \n                Monitor all the parameters, including OD600, pH,\n                nitrate/nitrite concentrations in the bulk phases, and H2\n                and N2 gases in the headspace.\n              \n            Procedure for experiment 2:\n            \n                For the anaerobic cultivation of the enriched biofilm, set serum\n                flasks with H2 as the sole electron donor and nitrate\n                as the TEA under autotrophic conditions.\n              \n                To monitor the growth of the enriched culture, analyze\n                parameters including OD600, pH, nitrate/nitrite\n                concentrations, and H2 and N2 gases in the\n                headspace.\n              \n      Anaerobic cultivation of enriched microbes with different electron donors\n      in serum flask\n    \nTiming: 15–20 days\n    \n      The growth of enriched electrotrophic microbial culture is tested with\n      soluble electron donors, selected based on their presence in sediment\n      samples. It can reveal the capabilities of electroactive microorganisms to\n      grow using soluble electron donors and suggest the role of enriched\n      microorganisms in the cycling of chosen elements in the natural habitat\n      and their respiratory capabilities.\n    \n        Triplicate experimental set-ups in serum flasks are started. At least\n        three growth batch cycles are conducted to validate the microbial growth\n        profiles of the inoculated electrotrophic culture (Yee et al., 2020[href=https://www.wicell.org#bib27]; Stieglmeier et al., 2009[href=https://www.wicell.org#bib25]).\n        \n            Resources required:\n            \n                Five 100 mL serum flasks are required for each experimental\n                setup.",
    "1M autoclaved anaerobic solutions, each of nitrate, citrate, and\n                acetate.\n              \n99.999% He gas is required for flushing.\n                UV-Vis spectrophotometer and pH meter are required to analyze\n                different parameters.\n              \n            Procedure:\n            \n                Flush each serum flask containing 40 mL growth medium with\n                99.999% He gas for 10–15 min. In this study, two soluble\n                electron donors, namely citrate and acetate, are used.\n              \n                Set two controls, namely, biotic and abiotic, with each main\n                experiment to observe the microbial growth in the absence of\n                electron acceptor (i.e., nitrate) and monitor the\n                chemically-induced nitrate reduction in medium, respectively.\n              \n                After flushing, seal off the serum flasks using butyl rubbers\n                and crimp seals to maintain anaerobic conditions.\n              \n                Autoclave all the serum flasks before inoculating them with the\n                enriched microbial culture.\n              \n                Monitor OD600, pH, and nitrate/nitrite concentrations\n                every 24 h, and analyze N2 gas in the headspace and\n                citrate/acetate concentrations on the 0th and last\n                day of each growth cycle.\n              \n      Microscopic observations for cathodic biofilm confirmation and\n      visualization\n    \nTiming: 2–3 days\n      The microbial growth at the cathode surface and in the bulk phase of BESs\n      and serum flasks can be confirmed by observing the samples by microscopic\n      techniques such as fluorescence microscopy, confocal microscopy, and\n      electron microscopy (scanning electron and transmission electron\n      microscopy). Here, a scanning electron microscope (SEM) protocol is\n      described.\n    \n        The samples are prepared following a series of steps described below (Khan et al., 2014[href=https://www.wicell.org#bib10]).\n        \n            Reagents required:\n            \n                Make 2% glutaraldehyde and 2.5% paraformaldehyde∗ solutions\n                beforehand by dissolving the chemicals in distilled water.\n              \n                Prepare different solutions (30%, 50%, 70%, 80%, 90%) of ethanol\n                by diluting 100% ethanol.\n              \n                Use 0.2 μM isopore membrane filters (Sigma-Aldrich) for\n                filtering the cell suspension.\n              \n            Procedure:\n            \n                Take the biocathode or suspension samples∗∗ and incubate\n                overnight (12–14 h) in a fixative solution of 2% glutaraldehyde\n                and 2.5% paraformaldehyde at 4°C.",
    "Then sequentially dehydrate the fixed samples using 30%, 50%,\n                70%, 80%, 90%, and 100% ethanol solutions for 20 min each.\n              \n                After dehydrating the samples with alcohol, keep them overnight\n                (12–14 h) in a silica desiccator for further dehydration. A\n                critical point drying method and equipment can also be used for\n                this purpose.\n              \n                After dehydration, coat the samples with gold nanoparticles\n                using JEOL JEC-1600 Auto-Fine Coater (JEOL Ltd., Japan) at 20 mA\n                for 45 s. Then, observe the coated samples under a scanning\n                electron microscope (JEOL JSM-6010 PLUS-LS, JEOL Ltd. Japan).\n              \n                Subject the biocathode samples to an element analysis via\n                FEG-SEM-EDS (Hitachi SU8010 series) to check the presence of any\n                chemical compound deposition on its surface which might be toxic\n                or involved in any chemical reaction.\n              \n∗Note: Paraformaldehyde takes ∼2 days to\n      completely dissolve in the distilled water. Thus, it should be prepared\n      beforehand.\n    \n∗∗Note: Electrode samples are fixed, and\n      the suspension samples are collected on 0.22 μM polycarbonate membrane\n      filters.\n    \nMicrobial community analysis in the enriched biofilm\nTiming: 40–60 days\n    \n      To know and understand the microbial communities enriched in any specific\n      experimental condition, various amplicon and metagenomic sequencing\n      approaches including V3-V4, V2-V4, complete 16S and 18S rRNA, and\n      whole-genome metagenomics can be used.\n    \n        The steps to achieve this are as follows (Yadav and Patil, 2020[href=https://www.wicell.org#bib26]; Chaudhary et al., 2021[href=https://www.wicell.org#bib2]).\n        \n            Resources required:\n            \n                A genomic DNA extraction kit is required (e.g., Fast DNA SPIN\n                kit (MP biomedicals, France); DNeasy® PowerSoil® Pro kit\n                (Qiagen, Germany))\n              \n                A nanodrop and Qubit fluorometer are required for DNA\n                quantification and gel electrophoresis for DNA quality check.\n              \n                A next-generation sequencing platform, such as Illumina\n                (MiSeq/HiSeq/NovoSeq/NextSeq), Pyrosequencing, and Nanopore is\n                required.\n              \n                Bioinformatic analysis is performed via different computer\n                programs and tools such as Linux, Anaconda, Miniconda, and\n                R-packages.\n              \n            Procedure:\n            \n                For a detailed procedure, refer to",
    "Marizzoni et al., (2020)[href=https://www.wicell.org#bib16] and\n                Jo et al. (2020)[href=https://www.wicell.org#bib8]."
  ],
  "subjectAreas": [
    "Chemistry",
    "Biotechnology And Bioengineering",
    "Microbiology",
    "Sequencing",
    "Environmental Sciences"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}