{
  "id": 19866,
  "origin_website": "Wiley",
  "title": "Highly Efficient Microcell-Mediated Transfer of HACs Containing a Genomic Region of Interest into Mammalian Cells",
  "procedures": [
    "Here, the user will insert a TAR/BAC containing a gene or genomic locus of interest into the alphoidtetO-HAC backbone via Cre/loxP-mediated recombination. There are three major components: CHO cells carrying alphoidtetO-HAC (available upon request from the authors), the TAR/BAC with a gene of interest (see Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.236#cpz1236-fig-0002] for details), and the plasmid encoding Cre-recombinase. Cre-mediated recombination (Abremski, & Hoess, 1984[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.236#cpz1236-bib-0001]) is based on Cre-recombinase recognition of a specific DNA sequence (loxP site), followed by recombination between two loxP sites. The alphoidtetO-HAC contains one recombination site, and the TAR/BAC, another. When the TAR/BAC DNA is transfected along with the Cre-encoding plasmid, the Cre-recombinase expressed from the plasmid carries out recombination between the two loxP sites, inserting the TAR/BAC molecule into the alphoidtetO-HAC. A scheme of the uploading of the TAR/BAC molecule into the loxP site of the alphoidtetO-HAC is shown in Figure 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.236#cpz1236-fig-0004].\nTo confirm TAR/BAC uploading into the alphoidtetO-HAC backbone, the user will then exploit the feature that CHO cells are HPRT-deficient and cannot survive when sodium hypoxanthine, aminopterin, and thymidine (HAT) are added to the culture medium. The alphoidtetO-HAC backbone contains a segment of the HPRT gene, and the TAR/BAC vector contains the rest. Each of these parts is nonfunctional by itself, and only when Cre/loxP recombination occurs correctly, the active HPRT gene is reconstituted. This then allows cells to survive and form clones in the presence of HAT supplementation (Fig. 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.236#cpz1236-fig-0004]). Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.236#cpz1236-prot-0001] is applicable for HACs containing a single loxP gene-loading site.\nMaterials\nBAC containing a gene of interest (see Strategic Planning)\nCHO cells carrying the alphoidtetO-HAC (cells available upon request from the Larionov laboratory)\nCre-plasmid (Addgene, cat. no. 31132)\nF12 growth medium (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.236#cpz1236-rec-0002])\n2× cell culture freezing medium (CFM; see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.236#cpz1236-rec-0001])\nF12-HAT medium (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.236#cpz1236-rec-0003])\nOpti-MEM (Thermo Fisher Scientific, cat. no. 51985034)",
    "Viafect (Promega, cat. no. E4981)\nPBS (Thermo Fisher Scientific, cat. no. 10010023)\n0.25% trypsin (Thermo Fisher Scientific, cat. no. 25200056)\nGeneRuler 1 kb plus DNA ladder (Thermo Fisher Scientific, cat. no. SM1331)\nPulse MarkerTM 0.1-200 kb (MilliporeSigma, cat. no. D2291)\nNuclease-free water (Quality Biological, cat. no. 351-029-721)\nReadyMix™ Taq PCR Reaction Mix (MilliporeSigma, cat. no. P4600)\nDiagnostic primers to confirm HPRT reconstitution:\n               \nF1: 5′-AGCCTTCTGTACACATTTCTTCTC-3′\nR1: 5′-GCTCTACTAAGCAGATGGCCACAGAACTAG-3′\nDiagnostic primers for gene or region of interest\nLarge-Construct Kit (Qiagen, cat. no. 12462)\nDNA Purification Kit (Qiagen, cat. no. 69506)\n6-well culture plates (Thermo Fisher Scientific, cat. no. 140675)\n96-well culture plates (Thermo Fisher Scientific, cat. no. 167008)\n24-well culture plates (Thermo Fisher Scientific, cat. no. 142475)\nCloning cylinders (Thermo Fisher Scientific, cat. no. 09-552-20)\nCryovial (Thermo Fisher Scientific, cat. no. 5012-0012)\n1.7-ml microcentrifuge tubes (Thomas Scientific, cat. no. 1159M35)\n2-ml collection tubes (Qiagen QIAquick PCR Purification Kit, cat. no. 28104)\n15-ml centrifuge tubes (Falcon, Corning, cat. no. 352196)\n50-ml centrifuge tubes (Falcon, Corning, cat. no. 352070)\n10-ml disposable pipets (Falcon, Corning, cat. no. 356551)\n10-cm culture dishes (Thermo Fisher Scientific cat. no. 174902)\nCell culture incubator\n-80°C freezer\nLiquid nitrogen tank\nPCR thermocycler\nNanoDrop spectrophotometer or equivalent\nRefrigerated centrifuge\nRefrigerated microcentrifuge\nTransfection\nApproximate time for this part of the protocol is 3 weeks.\n1. Purify BAC DNA containing a gene of interest and Cre-plasmid from the bacterial stock with large-construct kit.\n2. One day before transfection, plate 3.5 × 105 CHO cells per well in a 6-well plate in 2 ml F12 growth medium so that the cells are ∼70%-80% confluent at the time of transfection.\n3. The next day, mix 1 μg BAC (30-150 kb in size) and 0.1 μg Cre-plasmid in 200 μl Opti-MEM medium without serum in a 1.7-ml tube. Mix gently by tapping.",
    "Note that this and all the calculations below are for one well of a standard 6-well plate. Increase accordingly.\n4. Mix Viafect transfection reagent gently before use and then add 10 μl directly to the mix from step 3.\n5. Mix gently and incubate 5 min at room temperature.\n6. After incubation, add mixture from step 5 directly to one well with the cells (from step 2).\nDo not mix by pipetting, just add drop by drop into the well.\nChanging the medium before transfection is not necessary.\n7. Shake plate vigorously, backward and forward, and left to right, before placing back in the incubator.\nOptional: Change the medium 6 hr after transfection.\n8. Incubate cells overnight (typically 16-18 hr) at 37°C.\n9. Wash cells with PBS once, add 300 μl of 0.25% trypsin, and incubate 5 min at 37°C.\n10. Add 4 ml F12-HAT medium, re-suspend cells by pipetting up and down five to seven times, and transfer suspension to a 10-cm culture dish containing 6 ml F12-HAT medium. Place plate in the incubator.\n11. Let cells grow until individual colonies appear. This usually takes 2-3 weeks. Change F12-HAT medium every 2-3 days.\n12. Pick colonies. To do this, wash cells once with PBS, apply a cloning cylinder around a colony, and add 30 μl 0.25% trypsin into the cylinder's well. Incubate cells 5 min. Add 150 μl F12-HAT medium into the cylinder. Re-suspend cells well by pipetting five to seven times and transfer suspension into one well of a 96-well plate.\n13. Continue to grow cells and then transfer them as described from one well of a 96-well plate to one well of a 24-well plate for further colony expansion.\n14. Continue to expand each colony until a confluent 10-cm culture plate is obtained.",
    "15. Collect cells from the 10-cm culture plate. To do this, wash cells once with 10 ml PBS, add 2 ml 0.25% trypsin, incubate 5 min at 37°C, add 8 ml F12 growth medium, and re-suspend well. Use 5 × 105 cells for further genomic DNA extraction. Prepare frozen stocks for the remaining cells.\nIt is important not to cross-contaminate culture. Use separate pipet tips for each individual clone.\nTo prepare frozen stocks, centrifuge the cells at 1,200 rpm (1,000 × g) for 3 min at room temperature. Discard the supernatant. Re-suspend the cell pellet in 1 ml of F12 growth medium and add 1 ml of 2× CFM (see Reagents and Solutions). Mix well and add 0.5 ml of the mixture to four cryovials. Place cryovials into the freezing box and place it at -80°C. For long-term storage, place the cells in the liquid nitrogen tank the next day.\n16. To check whether the DNA segment of interest has been inserted into the HAC intact, isolate genomic DNA using a genomic DNA purification kit and then use 1 μl of the DNA elution in a 50-μl PCR reaction with diagnostic primers to confirm HPRT gene reconstitution. Expected fragment size is 1,600 bp.\nPCR confirmation of the HPRT gene reconstitution is a critical step, informing the user that the desired gene of interest was correctly uploaded into the HAC backbone. In addition, it is also important to confirm that the gene of interest is intact, at least by PCR analysis, using diagnostic primers for exons. The user should also evaluate whether the gene is expressed, either by reverse transcription PCR (RT-PCR) or Western blot.",
    "Additionally, it is advisable to perform fluorescence in situ hybridization (FISH) analysis on a metaphase spread to confirm that alphoidtetO-HAC remains autonomous and has not integrated into the chromosomes. For more detail, see previously published papers Kim et al. (2011[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.236#cpz1236-bib-0023]) and Kononenko et al. (2014[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.236#cpz1236-bib-0025]). Clones that have passed PCR and FISH verification are suitable to be used in Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.236#cpz1236-prot-0002].",
    "Microcell-mediated chromosome transfer (MMCT) allows individual chromosomes, megabase-sized chromosome fragments, or artificial chromosomes to be transferred from donor cells to a cell of choice (Ege & Ringertz, 1974[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.236#cpz1236-bib-0006]; Liskovykh et al., 2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.236#cpz1236-bib-0036]).\nHere, the user will prepare microcells from the donor hamster CHO cells containing the alphoidtetO-HAC vector carrying the gene of interest (obtained in Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.236#cpz1236-prot-0001]).\nBasic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.236#cpz1236-prot-0002] includes prolonged incubation of the CHO cells in the presence of drugs (TN16 and griseofulvin) that block cell cycle progression in metaphase and induce formation of a nuclear envelope around individual condensed chromosomes, also known as micronuclei. The next step of the procedure involves centrifugation in the presence of an actin cytoskeleton disruptive drug (latranculin B). This stage leads to formation of a cytoplasmic membrane around each micronucleus. Thus, centrifugation yields a population of microcells: A HAC surrounded by two membranes, nuclear and cytoplasmic. The cytoplasmic membrane of the microcells allows them to fuse with recipient cells.\nThe fusion procedure is similar to the protocol to form a hybridoma cell. There are several methods to induce fusion between two different cell types, but in our protocol we have found the HVJ Envelope Cell Fusion Kit to work well.\nBecause the alphoidtetO-HAC backbone contains a blasticidin resistance gene, selection should be done with this antibiotic. At the end of the protocol, the user will have several clones of cells carrying the alphoidtetO-HAC bearing the gene of interest. A scheme of the MMCT protocol is presented on Figure 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.236#cpz1236-fig-0005]. Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.236#cpz1236-prot-0002] is applicable to any type of HAC.\nAdditional Materials (see also Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.236#cpz1236-prot-0001])\nDonor cells from Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.236#cpz1236-prot-0001]\nTarget recipient cells\nF12 growth medium (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.236#cpz1236-rec-0002])\nDMEM medium (Thermo Fisher Scientific, cat. no. 10566016)",
    "Collagen solution (Thermo Fisher Scientific, cat. no. A1048301; prepare dilution according to the manufacturer's protocol)\nPBS (Thermo Fisher Scientific, cat. no. 10010023)\nLaminin solution (Thermo Fisher Scientific, cat. no. 23017015; prepare dilution according to the manufacturer's protocol)\nGriseofulvin (Santa Cruz, cat. no. sc-202171)\nTN-16 (Santa Cruz, cat. no. sc-204347)\nLatranculin B (Santa Cruz, cat. no. sc-203318)\nHVJ Envelope Cell Fusion Kit (Cosmo Bio, cat. no. ISK-CF-001-EX)\nEndotoxin-free water (Thermo Fisher Scientific, cat. no. 10977023)\n∼2 L of distilled sterile water (37°C pre-warmed)\nT25 culture flasks (Thermo Fisher Scientific, T25, cat. no. 156340)\n8-μm filters (Millipore, cat. no. TETP02500)\n5-μm filters (Millipore, cat. no. TMTP02500)\n3-μm filters (Millipore, cat. no. TSTP02500)\nSwinnex filter holders (Millipore, cat. no. SX0002500)\n10-cm culture dishes (Thermo Fisher Scientific, cat. no. 174902)\n0.5-L spin bottles\n0.5-L sterile bottles\nParafilm\n50-ml centrifuge tubes (Corning, Falcon, cat. no. 352070)\n15-ml centrifuge tubes (Corning, Falcon, cat. no. 352196)\n1.7-ml microcentrifuge tubes (Thomas Scientific, cat. no. 1159M35)\n2-ml collection tubes (Qiagen QIAquick PCR Purification Kit, cat. no. 28104)\nAutoclave\nCentrifuge for 0.5-L bottles (Sorvall RC 5B or equivalent)\nCentrifuge for 1.7-2 ml tubes\nWater bath (37°C pre-warmed)\nHemocytometer\nRefrigerated centrifuge\nFluorescent light microscope\nMicrocell-mediated chromosome transfer\nSteps 1-8 are preparational steps. Estimated time for these steps is 2 days.\n1. Prepare medium for donor CHO cells: F12, 10% FBS, 1% PenStrep, 10 μg/ml blasticidin.\n2. Prepare the appropriate medium for the recipient cell line of choice.\n3. Incubate six T25 flasks, each with 2 ml collagen solution (final concentration: 50 μg/ml), overnight at room temperature.\n4. Remove collagen solution.\nOptional: Collagen solution can be stored for further use at 4°C for a month.\n5. Gently wash flasks with 3 ml  PBS, three times.",
    "6. Add laminin solution (final concentration: 25 μg/ml in PBS) to each flask, 2 ml per flask, and incubate overnight at room temperature.\nOptional: Laminin solution can be stored for further use at 4°C for a month.\n7. Wash flasks with 3 ml PBS, three times.\nOptional: Collagen/laminin-treated flasks can be stored at 4°C for up to 4 weeks. Be sure to seal the flasks carefully to avoid contamination.\n8. Assemble four 8-μm, four 5-μm, and four 3-μm filters in Swinnex filter holders. Wrap them with aluminum foil, autoclave 40 min, and then dry 2-3 hr.\nThe filters can be prepared in advance and stored at room temperature.\nPrepare cell culture\nSteps 9-12 are cell culture preparation steps. Estimated time for these steps is 3 days.\n9. Grow up to 3 × 106 of the recipient cells in a 10-cm culture dish in proper medium until they reach 70%-80% of confluency.\nUsers will need the cells ready in step 33, so plan accordingly.\n10. Add 3 ml culture medium to each of the six flasks from step 7 and seed donor CHO cells from Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.236#cpz1236-prot-0001] until they reach 80% confluency.\nTypically, to have 80% of culture confluency on the next day, the user should seed 3 × 105 CHO cells per flask. Sometimes, however, it takes 2 days to reach 80% confluency. Users should check culture confluency before proceeding to the next step.\n11. When the CHO donor cells reach 80% confluency, change culture medium to F12 growth medium containing a cytostatic cocktail: 160 μM TN-16 and 50 μM griseofulvin. Change medium with fresh F12 growth medium plus cytostatic cocktail every 24 hr.\n12. Grow cells for 72 hr.\nAfter 72 hr, proceed immediately to microcell preparation.\nPrepare microcells and recipient cells",
    "Approximate time for this part of the protocol is 2-4 hr.\n13. Prepare the latranculin B medium by mixing 400 ml DMEM and 40 μl 2 mM latranculin B in a sterile 0.5-L bottle.\n14. Warm latranculin B-containing medium to 37°C.\n15. Collect cell culture medium from all T25 culture flasks with the CHO donor cells (from step 12), centrifuge at 1,200 rpm (1,000 × g) for 3 min at room temperature, and discard supernatant. Re-suspend cells in 6 ml latranculin B-containing medium and put cells back into the flasks.\n16. Fill each T25 flask until it is full with latranculin B-containing medium (typically, 60-61 ml of the medium per flask).\nFill the flask as much as possible with the medium.\n17. Close cap of the flask tightly, and closely wrap each neck and cap of the flask with Parafilm three times to protect flasks from contamination with water.\n18. Place each T25 flask from step 16 into a 0.5-L spin bottle with a wide neck and attach them with an adhesive tape to a bottle wall from the inside (see Fig. 8[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.236#cpz1236-fig-0008]). The side where the cells are seating should face the inside (center) of the bottle. Fill each of the spin bottles with the attached flask with pre-warmed (37°C) distilled water (130 ml per each bottle). Each bottle (with the flask and the water) should weigh ∼280 g. Check that they are balanced before placing bottles into the centrifuge.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/742f3c45-59f9-49ca-b249-f7f82f5c7b81/cpz1236-fig-0008-m.jpg</p>\nFigure 8\nT25 flask position in the centrifuge bottle. (A) Position of the adhesive tape on the flask. (B) Position of the flask inside the centrifuge bottle (upper view). (C) Position of the flask inside the centrifuge bottle (lateral view).\n19. Centrifuge water-filled bottles containing the flasks for 60 min at 34°C at 8,000 rpm (10,800 × g).",
    "20. After centrifuging, remove latranculin B-containing medium.\nMicrocell pellets become visible at the angles of the flask.\nDo not aspirate the microcell pellets off.\n21. Add 1 ml of warm serum-free DMEM medium to each flask and re-suspend microcell pellets completely.\n22. Transfer re-suspended microcells into a 50-ml Falcon tube.\n23. Wash flasks once again with 1 ml DMEM medium and collect microcells in the same tube.\n24. Centrifuge microcell suspension at 3,000 rpm (900 × g) for 5 min.\n25. Re-suspend microcell pellets in 1 ml DMEM medium.\n26. Adjust volume to 48 ml with DMEM medium.\n27. Divide the combined microcell suspension into four equal portions using 15-ml Falcon tubes.\n28. Filter each of the microcell portions sequentially through the 8-, 5-, and 3-μm filters prepared in step 8.\n29. After filtration, centrifuge tubes at 3,000 rpm (900 × g) for 5 min.\n30. After centrifugation, re-suspend each pellet completely in 1 ml serum-free DMEM medium.\n31. Combine all pellets together in a 15-ml Falcon tube and adjust volume to 10 ml with DMEM medium. Then, re-suspend the pellet carefully and centrifuge again at 3,000 rpm (900 × g) for 5 min.\n32. After centrifugation, place tube with the collected microcells under the hood.\nClean microcells are now ready for fusion. A microcell pellet should be visible. If necessary, the microcells can be kept on ice for up to 2 hr.\n33. Aspirate medium from the recipient cells from step 9.\nCells should be at 70%-80% confluency.\n34. Wash once with 10 ml PBS, add 2 ml 0.25% trypsin, incubate for 5 min at 37°C, and then add 8 ml of the recipient cell's culture medium. Re-suspend cells well.",
    "35. Count cells using a hemocytometer and transfer 1.5 × 106 cells into two separate 15-ml Falcon tubes. One tube will be used for fusion and the other will serve as a negative control. Treat both tubes equally in the following steps.\n36. Centrifuge cells at 1,200 rpm (1,000 × g) for 3 min.\n37. Re-suspend cells in 10 ml serum-free DMEM medium and spin them down at 1,200 rpm (1,000 × g) for 3 min. Repeat.\nThe clean recipient cells are now ready for fusion.\nUsers should be aware that steps 13-37 are time consuming, especially for the inexperienced user. Average time for this part of the protocol (steps 13-37) is 4-6 hr and it should be followed immediately by a fusion procedure, i.e., steps 38-49 of this protocol.\nFusion of microcells and recipient cells\nApproximate time for this part of the protocol is 30-45 min.\n38. Use the HVJ envelope cell fusion kit. Dilute cell fusion buffer (20× concentrate; stored at 4°C, part of the HVJ envelope cell fusion kit) 1:20 with sterile, pure ice-cold water (e.g., endotoxin-free water).\n39. Prepare 2 ml of 1× cell fusion buffer on ice.\n40. Suspend microcells (from step 32) and recipient cells (from step 37) pellets separately in 0.5 ml ice-cold cell fusion buffer (from step 39) using 2-ml tubes (preferably round-bottom tubes).\n41. Centrifuge both suspensions at 3,000 rpm (900 × g) for 3 min at 4°C using a centrifuge in a cold-room or a pre-cooled centrifuge.\n42. Re-suspend recipient cells to a concentration of 8 × 103 cells/μl in cell fusion buffer.\nFor example, re-suspend 1.5 × 106 recipient cells in 188 μl of cell fusion buffer.\n43. Re-suspend microcell pellet in cell fusion buffer using the same volume used to re-suspend the recipient cells.",
    "It is impossible to count the microcells. Therefore, use the same volume as that used for the recipient cells.\n44. Mix both suspensions together (from steps 42 and 43) by pipetting.\n45. Place a 10-μl aliquot of the HVJ-E suspension (part of the HVJ envelope cell fusion kit) from -80°C on ice and then add to the mixed cells suspension from step 44. Mix by tapping.\n46. Leave mixture on ice for 5 min to allow HVJ-E to be adsorbed on the cell surface.\n47. Place mixture into a water bath at 37°C for 15 min (mix by tapping every 5 min to induce cell fusion).\n48. After 15 min, centrifuge mixture at room temperature at 3,000 rpm (900 × g) for 3 min to remove residual viral proteins.\n49. Re-suspend fused cells in 1 ml of the recipient cell medium and transfer mix to a 10-cm culture dish containing 10 ml of the same medium. Place dish in the incubator for 24 hr.\n50. Start blasticidin S selection after 24 hr of incubation by replacing culture medium with medium containing 10 μg/ml of blasticidin S. Change medium every 2-3 days.\n51. After 2-3 weeks, pick colonies using cloning cylinders and 0.25% trypsin.\nAfter 2-3 weeks of selection, the user will have individual clones of the recipient cells containing the alphoidtetO-HAC along with the loaded gene of interest. It is important to confirm that the gene of interest remained intact after MMCT transfer. Use PCR analysis with diagnostic primers for exons. The user should also evaluate whether the gene is expressed, either by RT-PCR or Western blot. It is advisable to perform FISH analysis on a metaphase spread to confirm that the alphoidtetO-HAC remained autonomous after MMCT transfer and has not integrated into the chromosomes."
  ],
  "subjectAreas": [
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}