{
  "id": 19576,
  "origin_website": "Jove",
  "title": "Detection of Small GTPase Prenylation and GTP Binding Using Membrane Fractionation and  GTPase-linked Immunosorbent Assay",
  "procedures": [
    "1. Determination of RhoA Localization Using Membrane/Cytosol Fractionation\nCell culture and simvastatin treatment\nSeed 50,000 of U251 cells in a 100 mm dish and culture them in Dulbecco's modified Eagle's medium (DMEM) (high glucose, 10% fetal bovine serum [FBS]).\nWhen 30% confluent, treat the cells by removing the medium and adding simvastatin-containing medium to it (10 µM of simvastatin dissolved in dimethyl sulfoxide [DMSO]), and incubate for 36 h at 37 °C8. Use DMSO alone as a vehicle control.\n\t\tNOTE: 10 million cells are needed for the cytosol and membrane fractionation of the cells.\nCollection of cells\nRemove the cells from the 37 °C incubator. Look at the cells under a microscope to confirm the confluency.\n\t\tNOTE: The cells should be 70% - 80% confluent.\nAspirate the medium, wash the cells 1x with cold phosphate-buffered saline (PBS). Add 5 mL of ethylenediaminetetraacetic acid (EDTA) buffer (KCl: 400 mg/L, NaCl: 6800 mg/L, NaHCO3: 2200 mg/L, NaH2PO4.H2O: 140 mg/L, D-glucose: 1,000 mg, EDTA disodium: 373 mg/L) per plate and place the cells back into the 37 °C incubator for 5 min.\nAfter 5 min of incubation, collect the EDTA with the cells in a 15 mL tube containing the same amount of medium as EDTA.\n\t\tNOTE: Having medium in the tube neutralizes the EDTA and prevents any further digestion of the cell membranes.\nPlace the tube in an ice box and proceed to the centrifuge.\nSet up the centrifuge to 1,500 x g at 4 °C and spin the cells for 5 min.\nRemove the supernatant without disturbing the pellet and add 1 mL of cold PBS. Mix the cells well.\nTransfer the cell mixture (solution) to a new 1.5 mL tube, centrifuge at 1,500 x g at 4 °C, and spin the cells for 5 min.",
    "Check the pellet size (for estimating the volume of the buffer for the next step). Place the samples on ice. Discard the supernatant completely without disturbing the pellet.\nAdd ice-cold buffer I (10 mM Tris-HCl [pH 7.5], 0.1 mM EDTA, 0.1 mM EGTA, 1 mM dithiothreitol, and protease inhibitor cocktail), mix the samples well by pipetting up and down, and then, proceed to sonication.\nSonication\nSet the sonicator for five cycles, 5 s each, and repeat 3x.\nPerform the sonication on ice. Proceed to the ultracentrifuge.\n\t\tNOTE: Ice and cold condition preserve the proteins and make the results more reliable.\nUltracentrifugation\nUse an ultracentrifuge to separate the cell homogenates into cytoplasmic and membrane fractions. Set the centrifuge to 100,000 x g for 35 min at 4 °C. As shown in Figure 1, check the pellet size.\n\t\tNOTE: The membrane fraction is at the very bottom of the tube and the rest is other cytoplasmic components.\nCollect the supernatant completely while being careful not to disturb the pellet. The supernatant is the cytosolic fraction. Place the supernatant in a newly labeled tube.\nAdd 300 µL of dissociation buffer (buffer II) (50 mM Tris-HCl [pH 7.5], 0.15 M NaCl, 1 mM dithiothreitol, 1% SDS, 1 mM EDTA, 1 mM EGTA, and protease inhibitor cocktail) to the pellet (contains the membrane fraction). Mix well by pipetting up and down.\nProceed to protein determination and western blot (immunoblot analysis) sample preparation.\nImmunoblotting\nPrepare the cell protein extracts from the separated fractions in lysis buffer (20 mM Tris-HCl [pH 7.5], 0.5 mM PMSF, 0.5% non-ionic detergent-40, 100 µM β-glycerol 3-phosphate, and 0.5% protease inhibitor cocktail).",
    "Measure the protein concentration using the Lowry method8 and calculate the volume of the lysis buffer (20 mM Tris-HCl [pH 7.5], 0.5 mM PMSF, 0.5% nondenaturing detergent, octylphenoxypolyethoxyethanol, 100 µM β-glycerol 3-phosphate, and 0.5% protease inhibitor cocktail) to normalize the concentration of protein between the samples.\nHeat the samples at 90 °C for 5 min and load 15 - 20 µL of the samples on a 15% SDS-PAGE gel to separate the proteins.\n\t\tNOTE: Load 1 µg of protein for each sample. Calculate the volume that needs to be run accordingly.\nTransfer the separated proteins to nylon membranes under reducing conditions (500 nM glycine, 50 mM Tris-HCl, and 20% methanol) for 2 h, at room temperature (RT) at 100 V.\n\t\tNOTE: To confirm the successful protein transfer, use Ponceau stain or visualize the protein marker on the membrane.\nBlock the membranes with 5% nonfat dried milk and 1x Tris-buffered saline containing detergent (TBS/0.01% nonionic detergent; TBST) to block nonspecific antibody binding at 4 °C overnight or at RT for 1 h.\nAdd primary antibodies for immunoblotting analysis and incubate overnight at 4 °C.\n\t\tNOTE: In this experiment, Rac1/2/3, cdc42, RhoA, GAPDH, and pan-Cadherin were used at a 1:1,000 dilution in 1% milk in 1x TBST. Pan-Cadherin and GAPDH were used to confirm membrane and cytosolic fraction purity, respectively.\nWash the membranes 3x with a washing buffer with 1x TBST for 20 min.\nIncubate the membranes with anti-rabbit horseradish peroxidase (HRP)-conjugated secondary antibody for the respective primary antibodies (for 1 h at RT).\nWash the blots 3x for 20 min and develop them with enhanced chemiluminescence (ECL) detection.\n2. Measurement of the RhoA GTP Load Using a Small G-protein Activation Assay\nCount 10,000 cells/mL and culture the U251 cells in a 100 mm dish.",
    "When they are 30% confluent, treat the cells with simvastatin as described in step 1.1.2.\nBring the culture plates out of the incubator. Look at the cells under the microscope to confirm confluency. Ensure that the cells are 70% - 80% confluent. Place the Petri dish on ice, aspirate the media, and wash the cells 3x with ice-cold PBS (pH 7.2).\nAspirate the PBS. Tilt the Petri dish on ice for an additional minute to remove all remnants of PBS.\n\tNOTE: Residual PBS adversely affects this assay.\nLyse the cells in a 700 µL volume of ice-cold lysis buffer containing protease and phosphatase inhibitors.\n\tNOTE: 700 µL is usually enough for a 100 mm Petri dish. See Table 1 to find the proper volume for each culture vessel.\nHarvest the cell lysate with the cell scraper. Incline the culture plate for this technique.\nTransfer the lysate to a labeled ice-cold cryotube and keep it on ice.\nMix thoroughly using a vortex. Keep 10 µL of the lysate for the protein assay, to measure the protein concentration in the sample.\nSnap-freeze the remaining cell lysate in liquid nitrogen.\n\tNOTE: Prepare multiple aliquots of cell lysate before snap-freezing them, to avoid repeated freeze/thaw cycles which can lead to the loss of activity of RhoA GTPase.\nTransfer the snap-frozen cryotubes to a -80 °C freezer and store the samples for the GTPase-linked immunosorbent assay.\n\tNOTE: Do not store the samples for longer than 14 days. Work quickly and never leave the samples on ice for longer than 10 min. Never handle all Petri dishes simultaneously.\nMeasure the protein concentration using the Lowry method8 and calculate the volume of the lysis buffer to normalize the concentration of protein between the samples.",
    "NOTE: The best concentration is usually 1 mg/mL; however, 0.3 - 2 mg/mL can be detectable.\nPrepare a blank control by adding 60 µL of lysis buffer and 60 µL of binding buffer to a microtube.\n\tNOTE: The blank control has all reagents except the antigen and is used for the subtraction of the background.\nPrepare a positive control by adding 12 µL of Rho control protein, 48 µL of lysis buffer, and 60 µL of binding buffer.\n\tNOTE: The positive control has all reagents plus a confirmed antigen for Rho-A-GTP.\nTake the Rho affinity plate out of its bag and place it on ice.\nDissolve the powder in the wells with 100 µL of ice-cold distilled water. Keep the plate on ice.\nThaw the snap-frozen cell lysates in a water bath set to 25 °C.\nAdd the calculated volume of ice-cold lysis buffer (from step 2.11) to each sample to normalize the protein concentration.\n\tNOTE: Remove the PBS after washing the cells (using a vacuum tube aspirator) to avoid causing changes in the composition of the lysis buffer. Equalize the sample protein to a concentration between 0.8 and 2 mg/mL for an accurate comparison between samples in GTPase activation assays. Table 2 provides details about the buffer to be used for this assay.\nTransfer 60 µL of the normalized ice-cold samples to microtubes and add 60 µL of binding buffer; mix the samples thoroughly and keep them on ice.\nCompletely remove the water/solutions from the microplate by vigorous flicking, followed by five to seven hard taps on a lab mat.\nAdd 50 µL of the normalized samples, a blank control, and a positive control to the wells in duplicates.\nPlace the plate on an orbital shaker for 30 min at 4 °C at 300 rpm.",
    "NOTE: The shaking step is very important, and it is recommended to use the orbital plate shaker at 300 rpm.\nClear the samples from the plate by flicking and wash them 2x with 200 µL of washing buffer at RT. Vigorously remove the washing buffer from the wells after each wash by flicking, followed by tapping, and keep the plate on the bench at RT.\nAdd 200 µL of RT antigen-presenting buffer to each well and incubate at RT for 2 min.\nFlick out the solution from the wells and wash the wells 3x with 200 µL of washing buffer at RT.\nAdd 50 µL of freshly prepared 1/250 anti-RhoA primary antibody to each well.\nPlace the plate on an orbital shaker for 45 min at 300 rpm set to 25 °C. Flick out the solution from the well.\nRepeat the washing steps 2x (step 2.24).\nAdd 50 µL of freshly prepared 1/250 anti-RhoA secondary antibody to each well.\nPlace the plate on top of an orbital shaker for 45 min at 300 rpm set to 25 °C.\nPrepare the HRP detection reagent by mixing equal volumes of reagent A and reagent B.\nFlick out the solution from each well and wash the wells 3x with 200 µL of washing buffer at RT.\nAdd 50 µL of freshly prepared HRP detection reagent to each well.\nRead the luminescent signal within 3 - 5 min to obtain the maximum signal and analyze the results using an appropriate software package.",
    "NOTE: Readings must be taken within 3 - 5 min to obtain the maximum signal. Run a \"test plate\" to confirm the proper lysis buffer volume is being used for the cell lysates so that the protein concentration is high enough to detect RhoA GTPase activity. (A test plate is a plate of cells used to determine if the protein concentration falls within the acceptable range and also to determine if the volume of the lysis buffer being used is appropriate.) The positive control should read 4- to 10-fold higher than the blank wells if it is in the linear range. If not, then adjust the luminometer by consulting the manufacturer. The settings for the luminometer are given in Table 3.\nEnter raw data in the columns where the headings read Sample, Mean, Standard Deviation, rep1, rep2, rep3, and rep4, which is to show the number of replicates being done on each sample.\nUnder Mean, enter the formula =average(Xn:Yn) where X = the column designator for rep1, Y = the column designator for rep4, and n = the row designator of the row being worked on.\nUnder Standard Deviation, enter the formula =stdev (Xn:Yn) where X = the column designator for rep1, Y = the column designator for rep4, and n = the row designator of the row being worked on.\nEnter the replicate data into rep1, rep2, etc.\nAfter entering the data, use the click-and-drag method to select the Sample, Mean, and Standard Deviation.\nThen, in data analysis software, select the function for chart making which looks like a square with a mini bar chart inside.\n\tNOTE: This brings up the chart making process where it is possible to design charts based on the data entered.\nChoose column chart and, for input values, designate the Mean numbers.",
    "NOTE: The chart for the Mean numbers is first made, and then, the Standard Deviation column for the y-axis error bars is designated. To do this, double-click on the graph bars, select the Y-axis error tab, click the Custom option, and select the area in the worksheet to enter the location of the Standard Deviation data. The difference between the groups that need to be compared can be seen after the creation of the desired charts.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}