{
  "id": 19385,
  "origin_website": "Jove",
  "title": "Chronic Intermittent Ethanol Vapor Exposure Paired with Two-Bottle Choice to Model Alcohol Use Disorder",
  "procedures": [
    "All procedures were approved by the Purdue University Animal Care and Use Committee. The present study used 8 week old C57BL/6J mice. The CIE group had 5 mice (3 male, 2 female), and the Air group had 10 mice (5 male and 5 female). The animals were obtained from a commercial source (see Table of Materials) and were group-housed on a 12 h light-dark cycle with access to food. The body weights of the mice were measured once per week throughout the experiment.\n1. General experimental design\nNOTE: Two-bottle choice (2BC)/chronic intermittent ethanol vapor exposure (CIE) is a preclinical mouse model to explore ethanol dependence47.\nDuring the 2BC weeks, ensure that the mice have access to a bottle containing ethanol (15% w/v) and a bottle containing water for 2 h daily (Monday to Friday), beginning 2 h into the dark cycle.\nAt first, allow the mice a minimum of 2 weeks of baseline 2BC drinking until a stable level of ethanol intake has been reached. Depending on the experimental needs, divide the mice into two groups (a CIE group and an Air group) or more if additional treatments are included based on the average baseline ethanol intake.\nAfter the baseline 2BC weeks, expose the mice from the CIE group to ethanol vapor (CIE) for four consecutive days (Monday to Thursday) with 16 consecutive hours of vapor on and 8 consecutive hours of vapor off.\n\tNOTE: Mice from the Air group remain in their regular housing setting so they are exposed to Air with no ethanol vapor.\nDuring the CIE/Air week, ensure 2BC does not occur. After 1 week of CIE/Air, resume the mice on 2BC for the following Monday to Friday.",
    "Allow mice alternate weeks of CIE/Air and 2BC for the remainder of the procedure until the escalation of alcohol drinking occurs in the CIE mice. Collect blood from the mice at least once per week of CIE to determine their blood ethanol concentration (BEC)48.\n2. Experimental preparation\nAcquire all the following supplies before the start of the study: mice, cages/metal cage tops, drinking bottles to fit two per cage side by side, bedding, food, a scale, a chronic intermitted vapor chamber, and an Analox machine or another method to analyze the BECs (see Table of Materials).\nEnsure all the required chemicals are ready for the experiment: drinking water, 95% ethanol, pyrazole, heparin and sterile saline.\n3. Animal habituation\nIf the mice are not already housed in the same location as the experiments, allow at least 1 week for them to acclimate to the new environment. During this time, handle the mice regularly, and transfer them to any areas where experimentation will occur for 30 min daily.\nEnsure that the mice are given 1 week of two-bottle choices with both bottles filled with water to allow them to adjust to the different cage setup and being placed into an individual cage for drinking.\n4. Two-bottle choice with 15% w/v ethanol and water\nTwo-bottle choice habituation\n\t\nThe two-bottle choice testing paradigm is the same throughout the week of two-bottle choice with water and the later testing with water and ethanol. Move the group-housed mice to their individual drinking cages 30 min before the lights turn off, and then allow the mice to drink for 2 h.\nRecord the volumes of each drinking bottle before and after the 2 h drinking period. Each group undergoes 2BC for 5 days, from Monday to Friday.",
    "NOTE: The purpose of the habituation week is to let the animals adjust to two bottles being in the cage to minimize any bias caused by the natural side position of a single bottle. During this week, both bottles are filled with water. If the supplied metal hopper is designed to hold only one bottle, carefully use the space between its bars adjacent to the first bottle to create space for the second bottle. The bottles used for drinking experiments are custom-made using 10 mL and 25 mL pipettes with the ends cut to allow a straight sipper with a ball bearing to be inserted for the mice to drink from. Using binder clips to clip the bottles to the wire lid will ensure that the bottles do not move during the drinking period (Supplementary Figure 1 and Supplementary Figure 2).\nBaseline two-bottle choice\n\t\nAfter habituation, allow the mice to undergo at least 2 weeks of baseline 2BC drinking to establish a stable ethanol intake. During the baseline drinking, test the mice for 2 h per day and 5 days per week (Monday to Friday) with one water bottle and a second bottle with 15% w/v ethanol. Record the volumes of each drinking bottle before and after the 2 h drinking period.\n\t\tNOTE: To establish a stable baseline of ethanol intake, repeat the weeks of 2BC until each mouse has approximately less than 15% variation in intake between days.\nAfter the mice achieve a stable baseline of ethanol intake, evenly divide the mice based on their ethanol intake into ethanol-nondependent (Air treatment) and ethanol-dependent (CIE treatment) groups. Once the baseline ethanol intake has been established, the mice undergo CIE (or Air exposure) the following week.",
    "NOTE: Not all experiments require a non-dependent group to be included, and this must be determined based on the focus of the study. For example, ethanol-dependent mice with and without specific treatment may be a more relevant comparison.\nTwo-bottle choice (2BC)\n\t\nResume the 2BC procedure as performed during baseline drinking after the first CIE week.\n\t\t​NOTE: The two-bottle choice mouse drinking formula is a 15% w/v ethanol mixture (1 L): 95% ethanol (195 mL) and mouse drinking water (805 mL).\n5. Chronic intermittent ethanol vapor (CIE) exposure\nArrange the following materials: custom-made CIE vapor chambers (Supplementary Figure 3), 95% ethanol, an ethanol-pyrazole solution (68.1 mg/kg pyrazole mixed in 20% ethanol), a saline-pyrazole solution (68.1 mg/kg pyrazole mixed in saline), syringes (1 mL), and needles.\nChronic intermittent ethanol vapor (CIE) procedure\n\t\nPrior to being put into the vapor chambers for CIE, intraperitoneally inject the mice with an ethanol-pyrazole solution (0.0075 mL/g), which is used to create an initial ethanol intoxication, inhibit ethanol dehydrogenase, and block the metabolism of ethanol49.\nInject all the Air controls and other groups with the same pyrazole dose mixed with saline (0.0075 mL/g) instead of ethanol. It is recommended to give a half dose (0.00375 mL/g) of the pyrazole solutions on the first day and last day of CIE each week.\nAfter the injections, return the Air/control mice to their home cages, and place the cages for the CIE group inside the vapor chamber.",
    "NOTE: During CIE, the mice are most susceptible to poor health outcomes from vapor exposure at the end of the week as they enter an extended withdrawal period; thus, a half dose of pyrazole is given on the last day of CIE to minimize the withdrawal occurring after the CIE is paused for the weekend and the following week. A half dose of pyrazole is also given each week on the first day of CIE to ease the mice back into the weekly vapor exposure. The dose of pyrazole may need to be adjusted in order to calibrate the BEC to be higher or lower, as desired. It is recommended to use a pyrazole dose ranging from 0.00375 mL/g to 0.0075 mL/g.\nOnce the mice are put into the vapor chambers, lock the doors, and set the pump to the appropriate vapor level (e.g., 1-3). Set the run time of the experiment. For the present study, the experiment started at 17:00 PM and finished at 09:00 AM, and a pump setting of 1-2 was used (used throughout).\nThen, press the Start button on the CIE vapor chamber control screen to start the experiment.",
    "NOTE: This step could vary depending on the chamber being used and differences in the setup. Here, once all the mice are injected and placed into the ethanol chamber, the chamber should begin pumping 95% ethanol into a glass flask and heat the liquid ethanol into vapor. The vapor flows through the chamber where the mice are held for 16 h/day for 4 days (Monday evening through Friday morning). Each day, the mice experience 8 h of the vapor being off. The mice are then removed from the chamber at the end of the fourth day (Friday morning) and begin 2BC the following Monday. Depending on the specific vapor chamber system and setup, there may be variations in the BECs caused by the different settings/vapor levels. Various factors, such as slight differences in the system components, air flow, exhaust, etc., can cause this. Adjusting the ethanol vapor level instead of the pyrazole dose is suitable to maintain a BEC in the target range. As tolerance develops, the BECs may be too low, and the vapor level may need to be adjusted. If the gradient between the vapor levels is too steep for increasing the BECs, then adjusting the pyrazole dose accordingly is recommended to alter the BECs.\nMeasure the BECs (see step 5.3) of the mice at least once per week during CIE. Perform blood collection 30 min before the vapor stops to ensure the BECs have not started to drop.\n\t\tNOTE: The vapor level may need to be adjusted during the experiment as ethanol tolerance builds over the course of several weeks. BECs should be tested before and after adjusting the vapor settings.",
    "Return the mice to 2BC testing on the week following the CIE. Repeat step 4 and step 5. Keep the mice alternating between CIE and 2BC for four to eight cycles (8-16 weeks) until they have significant ethanol consumption escalation compared with their baseline drinking volume.\nBlood measurements\n\t\nArrange the following materials: equipment to measure BECs, such as an Analox system, a blade, a tube (0.2 mL), heparin/EDTA, and a centrifuge (see Table of Materials).\nTail-snip the CIE mice once during the CIE week, 30 min before the vapor system turns off, to collect blood for determining the BEC. The blood collection can be performed using several methods depending on the preferences of the lab50.\n\t\tNOTE: The blood is collected into heparinized or EDTA-coated 0.5 mL tubes (see Table of Materials).\nMaintain the collected blood samples at 4 °C until processed.\nTo process the samples, first centrifuge at 208 x g for 10 min at 4 °C to separate the plasma.\nDetermine the blood ethanol concentrations using an oxygen-rate ethanol analyzer (see Table of Materials) or other systems capable of determining BECs.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}