{
  "id": 15231,
  "origin_website": "Jove",
  "title": "Endogenous Protein Tagging in Human Induced Pluripotent Stem Cells Using CRISPR/Cas9",
  "procedures": [
    "1. In Silico Design of crRNA and Donor Template Plasmid for FP Knock-in\nObtain the annotated reference sequence from NCBI16 or the UCSC Genome Browser17 (e.g., GenBank format) of the gene of interest and import it into a bioinformatics software of choice. If the host genome sequence is known to contain variants relative to the reference, include those now by adjusting the reference sequence in the bioinformatics software (see Discussion).\nLocate the desired FP insertion site. For C-terminal tags, the sequence for the FP tag will be introduced between the last base of the last codon and the first base of the stop codon. For N-terminal tagging, the sequence for the FP tag will typically be introduced between the last base of the start codon and the first base of the next codon. In some cases, such as when the start codon is a single codon exon, or where a signal sequence exists near the protein terminus, the desired FP insertion site may be situated in a more 3ʹ position, so long as it continues to be in frame.\nUse 50 bp on each side of the desired insertion site as the input sequence for any publicly available crRNA design tool. Once 2-4 crRNA targets are identified near the insertion site, annotate the crRNA binding sites and protospacer-adjacent motif (PAM) sequences (NGG) in the bioinformatics software. These crRNAs will be used to induce double stranded breaks (see Discussion for more guidance on crRNA design).\n\tNOTE: Custom crRNA sequences can be submitted for synthesis with a commercial vendor (recommended), or the sequence can be used as a starting point to design a cloning or in vitro synthesis strategy, which is beyond the scope of this protocol (see Discussion).",
    "To initiate the donor template plasmid, use 1 kb of sequence upstream of the desired insertion site as the 5ʹ homology arm (this should include the start codon for N-terminal insertions), and use 1 kb of sequence downstream of the desired insertion site as the 3ʹ homology arm (this should include the stop codon for C-terminal insertions). Bases between the two homology arms are typically not omitted. Including cell-line specific variants in the homology arms will preserve these genetic variants in the resulting edited cells.\nBetween the two homology arms, insert the sequence for the FP (or other knock-in sequence) and the linker sequence (see Discussion for more guidance on linkers). For N-terminal tags, the linker sequence should be directly 3ʹ of the FP; for C-terminal tags, the linker sequence should be directly 5ʹ of the FP.\nDisrupt crRNA binding sites in the donor template plasmid to prevent Cas9 cutting of donor sequence (see Discussion for considerations when altering crRNA binding sites). If possible, disruption of the PAM to a sequence other than NGG or NAG is preferred. Alternatively, introducing point mutations to three bases in the seed region of the crRNA (10 bases proximal to the PAM) is predicted to sufficiently disrupt crRNA binding. Some crRNA binding sites are disrupted by introduction of the FP sequence in the donor template plasmid; ensure that no PAM, or intact binding region still exists in these cases.\n\tNOTE: In silico donor template plasmid can be submitted for gene synthesis by a commercial vendor, or it can be used as a starting point to design a cloning strategy, which is beyond the scope of this protocol. A simple backbone such as pUC19 or pUC57 is sufficient.\n2. Ribonucleoprotein (RNP) Transfection for CRISPR/Cas9 Mediated Knock-in in hiPSCs",
    "NOTE: In this protocol, the term 'gRNA' describes synthetic crRNA and tracrRNA properly re-suspended, quantified, and pre-complexed per manufacturer's instructions (see Table of Materials). Supplement all media with 1% Penicillin Streptomycin. General culturing guidelines of the WTC hiPSC line are described in more detail at the Allen Cell Explorer18,19. WTC hiPSCs are used in this protocol, but with proper transfection optimization, electroporation of RNP and donor template plasmid may be successfully adapted to other cell types.\nPrepare 10 µM working stocks of gRNA and wild type S. pyogenes Cas9 protein2,20; keep on ice. Prepare 1 µg/µL working stock of donor template plasmid; keep at room temperature (RT). Use pH 8.0 TE buffer for all dilutions.\nPrepare a matrix-coated 6-well tissue culture plate with 5 mL of fresh growth media supplemented with 10 µM ROCK inhibitor (Ri) per well. Keep plate with media in the incubator at 37 °C and 5% CO2 until ready to plate cells after the transfection procedure (maximum 2 h).\n\tNOTE: All matrix-coated plates used in this protocol are made by adding a volume of ice-cold Matrigel diluted 1:30 in cold DMEM/F12 media according to the Allen Institute for Cell Science's protocol for culturing the WTC hiPSC line19.\nUsing a gentle single-cell dissociation reagent as recommended in the Table of Materials, passage hiPSCs into single-cell suspension and count cells using an automated cell counter, or hemocytometer.\n\tNOTE: A detailed protocol for the WTC hiPSC line used here can be found at the Allen Cell Explorer19. Briefly, wash cells once with RT DPBS and treat with dissociation reagent for 3-5 minutes. Then triturate cells into single-cell suspension by gentle pipetting and pellet by centrifugation. Resuspend the live cell pellet in growth media supplemented with 10 µM Ri.",
    "Prepare an aliquot of 1.84 x 106 cells for each experimental condition to be transfected in separate 1.5 mL tubes.\n\t\tNOTE: All volumes are calculated for a 4.5 µL total reaction volume in a 100 µL electroporation volume, times 2.3 reactions. This accounts for duplicate transfection and excess for pipetting error.\nPrepare ribonucleoprotein (RNP) complex tubes for each experimental condition by adding 2.88 µL of 10 µM gRNA and 2.88 µL of 10 µM Cas9 to a 1.5 mL tube. Incubate at RT for a minimum of 10 min (maximum 1 h).\nPellet one cell aliquot (prepared in step 2.3.1) at 211 x g for 3 min at RT. Aspirate supernatant and resuspend cell pellet in 220 µL of manufacturer's electroporation buffer.\nAdd 220 µL of resuspended cells from step 2.5 into the 1.5 mL RNP complex tube prepared in step 2.4.\nAdd 4.60 µL of 1 µg/µL donor template plasmid to the 1.5 mL tube prepared in step 2.4.\nUse the nucleofection tip and pipette to mix the tube contents 2-3 times, then transfer 100 µL of suspension to the prepared electroporation device. Avoid introducing any bubbles in the tip. Apply 1300 V for 1 pulse of 30 ms.\nGently transfer the suspension into the prepared 6-well plate from step 2.2 with a swirling motion. Disperse cells by gently moving the plate side-to-side and front-to-back.\nUsing a new nucleofection tip, repeat steps 2.8-2.9 with the remaining 100 µL of suspension and transfer into a second well of the prepared 6-well plate.\n\t\nRepeat steps 2.4 through 2.10 for each gRNA and donor template plasmid combination, including non-targeting gRNA, donor template plasmid only, and buffer only controls. Take care to change pipette and nucleofection tips to avoid cross-contamination.",
    "Incubate transfected cells at 37 °C and 5% CO2. Change the media to regular growth media (no Ri) at 24 h, and continue feeding hiPSCs every 24 h for 72-96 h, monitoring confluency. When hiPSCs reach 60-80% confluence, proceed to step 3.\n\tNOTE: Heavy cell death (>70%, estimated) is normal 24-48 h after transfection.\n3. FACS-Enrichment of Putatively Edited hiPSCs\nNote: When sorting stem cells, adapt instrument settings to promote cell survival as suggested in the Discussion. Briefly, use the largest nozzle possible (130 µm), a low flow-rate (≤ 24 µL/min), preservative-free sheath fluid (such as saline, see Table of Materials), and low sample pressure (10 psi).\nPrior to beginning a FACS experiment, change media to growth media supplemented with 10 µM Ri and incubate cells at 37 °C and 5% CO2 for 2-4 h to promote survival after FACS.\nUsing a gentle single-cell dissociation reagent as recommended in the Table of Materials, passage hiPSCs into single-cell suspension in growth media supplemented with 10 µM Ri19.\nFilter hiPSC suspension through 35 µm mesh filter into polystyrene round-bottomed tubes.\nSort cells using forward scatter and side scatter (including height vs. width) to exclude debris and doublets. Use live, buffer only control cells to set the FP-positive gate, such that <0.1% of buffer only cells fall within the gate.\nSort the entire population of FP-positive cells into a 1.5-15 mL polypropylene tube containing 0.5-2 mL of RT growth media supplemented with 10 µM Ri.\n\tNOTE: Polypropylene reduces the potential for cell adhesion to the plastic.\nCentrifuge collected cells at 211 x g for 3 min at RT.\nCarefully aspirate supernatant and resuspend cell pellet in 200 µL of growth media supplemented with 10 µM Ri. Transfer up to 3,000 sorted cells to a single well of a fresh matrix-coated 96-well plate19.",
    "NOTE: With appropriate instrument setup, cells can also be sorted (in bulk) directly into a single well of a matrix-coated 96-well tissue culture plate containing 200 µL of growth media supplemented with 10 µM Ri at a recommended density of 1,000-3,000 cells per well for hiPSC.\nIncubate sorted cells at 37 °C and 5% CO2. Change the media to growth media supplemented with 5 µM Ri at 24 h. At 48 h begin feeding cells regular growth media (no Ri) every 24 h for 72-96 h, monitoring confluency. Survival after FACS is estimated to be greater than 50% if a minimum of 500 cells are seeded in one well of a 96-well plate.\n\t\nWhen hiPSCs reach 60-80% confluence and show mature morphology (smooth, well-packed colony centers), passage into a larger format plate such as a 24-well plate, then from a 24-well plate into a 6-well plate.\nWhen the hiPSCs in a 6-well plate reach 60-80% confluence and show mature morphology, expand to a 100 mm plate, re-plate for imaging, cryopreserve, or seed at clone picking density (step 4)19.\n4. Generating Putatively Edited Clonal hiPSC Lines\nUsing a gentle single-cell dissociation reagent as recommended in the Table of Materials, passage hiPSCs into single-cell suspension and determine the number of cells per mL19.\nSeed 10,000 cells of the edited population of hiPSCs onto a fresh matrix-coated 100 mm tissue culture dish using growth media supplemented with 10 µM Ri19. Change the media to growth media without Ri 24 h after seeding, and feed the hiPSCs with fresh growth media every 24 h for 5-7 days.",
    "When hiPSCs have formed colonies that are visible macroscopically (approximately 500 µm) they are large enough to be isolated. Prepare a matrix-coated 96-well plate by aspirating excess matrix and adding 100 µL of growth media supplemented with 10 µM Ri per well19.\nOn a dissecting microscope use a P-200 pipette, or similar, to gently scrape and aspirate individual colonies from the plate surface. Transfer volume (~20-100 µL) containing the colony to a single well of the 96-well plate prepared in step 4.3.\n\t\nAfter all colonies have been transferred, incubate the plate in a tissue culture incubator at 37˚C and 5% CO2. Change the media to regular growth media (no Ri) at 24 h, and continue feeding cells every 24 h for 72-96 h until colonies have approximately tripled in size (approximately 1500 µm).\n\t\tNOTE: Picking 24-96 colonies per crRNA used in the transfection is recommended. Survival of isolated clones is typically greater than 95%.\nUsing a gentle single-cell dissociation reagent as recommended in the Table of Materials, passage hiPSC clones into a new matrix-coated 96-well plate as follows19.\n\t\nUsing an 8-channel aspirator, remove and discard media from the first column of the 96-well plate.\nUsing a P-200 multichannel pipette, add ~200 µL of DPBS to the first column of the 96-well plate to wash the cells. Using an 8-channel aspirator, remove and discard DPBS wash from the first column of the 96-well plate.\nUsing a P-200 multichannel pipette, add 40 µL of dissociation reagent to the first column of the 96-well plate.",
    "Repeat steps 4.5.1-4.5.3 for up to a total of six columns of the 96-well plate, changing tips to be sure to not cross-contaminate wells. Place the plate in the 37 °C incubator for 3-5 minutes from the time the dissociation reagent was added to the first column (step 4.5.3).\n\t\tNOTE: It is recommended to only passage a maximum of six columns (48 wells) at a time due to the time it takes to perform these steps. When performing this protocol for the first time, start with only passaging one or two columns at a time. Limiting the number of columns passaged at one time ensures that cells are not left in the dissociation reagent for too long, which could be harmful to hiPSCs.\nWhen the cells in the first column of the plate have begun to lift off the plate bottom, use a P-200 multichannel pipette to add 160 µL of DPBS to the first column of the 96-well plate and gently triturate the cells at the \"12:00\", \"3:00\", \"6:00\", and \"9:00\" positions of each well. Transfer the entire volume of cell suspension (200 µL) to a V-bottom 96-well plate.\nRepeat step 4.5.5 for the remaining columns of cells that have dissociation reagent in them; change tips as to not cross-contaminate wells.\nSpin the V-bottom plate in a centrifuge at 385 x g for 3 min at RT.\nUsing a P-200 multichannel pipette, gently remove the supernatant and resuspend cells in 200 µL of fresh growth media supplemented with 10 µM Ri per well. Repeat for all wells, changing tips as to not cross-contaminate.",
    "Transfer all of the cell suspension to a fresh matrix-coated 96-well plate19. Incubate the plate in a tissue culture incubator at 37 °C and 5% CO2. Change the media to regular growth media (no Ri) at 24 h, and continue feeding cells every 24 h for 72-96 h, until the majority of clones reach 60-80% confluence.\n\t\tNOTE: This passage helps to spread out the cells and allow for more growth over the entire area of the 96-well plate.\nObserve clones and identify an appropriate split ratio for each individual clone in the 96-well plate (e.g., 1:10, or 1:8). Using a gentle single-cell dissociation reagent as suggested in the Table of Materials, passage hiPSC clones into a new matrix-coated 96-well plate (steps 4.5.1-4.5.8) transferring a ratio of the cell suspension appropriate for each clone. Incubate the plate in a tissue culture incubator at 37˚C and 5% CO2. Change the media to regular growth media (no Ri) at 24 h, and continue feeding cells every 24 h for 72-96 h, until the majority of clones reach 60-80% confluence, and show mature morphology.\n\tNOTE: Each clone may have a different split ratio because of slightly different growth rate or survival from the previous passage, so this passage helps to normalize the number of cells per well of each clone for the freezing step to follow. Due to the varying rates of survival and growth, some clones may overgrow or fail to grow during these passaging steps.\n\t\nSave the remainder of the cell suspension and pellet for gDNA isolation by centrifuging cells in a V-bottom 96-well plate at 385 x g for 3 min at RT. Remove supernatant and proceed to gDNA isolation using a 96-well kit, or store plate of pelleted cells at -20˚C for up to three weeks.",
    "5. Cryopreservation of clonal cell lines in 96-well plate format\nUsing a single-cell dissociation reagent, passage hiPSC clones as previously described (steps 4.5.1-4.5.7). Aspirate the supernatant using a P-200 multichannel pipette and re-suspend in 60 µL of growth media supplemented with 10 µM Ri. Repeat for all wells; change tips as to not cross-contaminate.\nTransfer 30 µL of cell suspension to a non-matrix coated 96-well tissue culture plate. Then quickly add 170 µL freezing buffer (see Table of Materials) to each well, without mixing. Repeat by transferring the remaining 30 µL of suspension into a sister plate and adding 170 µL freezing buffer.\n\tNOTE: This process is done in duplicate sister plates so that a back-up population of cells exists after thawing one of the individual plates. Putting cryopreserved cells into only every other column of a 96-well plate allows for faster thawing (step 5.6).\nWrap plate with parafilm and place in a RT Styrofoam box with lid. Place the whole box in a -80 °C freezer.\nAfter 24 h plates can be transferred out of the Styrofoam box and stored at -80˚C for up to four weeks.\n\tNOTE: While the cells are temporarily stored at -80 °C, genetic quality control assays can be performed with the gDNA harvested from cells obtained in step 4.6.1 in order to identify the clones to thaw and propagate further, as discussed in previously published work12. Briefly, a copy number droplet digital PCR assay can be used to identify clones that contain one or two copies of GFP and no donor template plasmid backbone integration. A combination of end-point PCR assays and Sanger sequencing can then identify clones that contain a precise insert.",
    "To thaw, bring the entire plate to 37 °C in a tissue culture incubator, watching carefully for the ice pellets to melt. Wells at the edge of the plate tend to thaw first.\n\t\nWhen the ice pellet of desired clone melts, gently transfer entire 200 µL to a 15 mL conical tube containing 3 mL of RT growth media supplemented with 10 µM Ri and centrifuge at 211 x g for 3 min at RT.\nAspirate supernatant and resuspend pelleted cells in 1 mL of RT growth media supplemented with 10 µM Ri. Transfer to a fresh matrix-coated 24-well plate and incubate at 37˚C and 5% CO2. Change the media to regular growth media (no Ri) at 24 h, and continue feeding cells every 24 h for 72-96 h until the clone reaches 60-80% confluency and has mature morphology19."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}