{
  "id": 2858,
  "origin_website": "Cell",
  "title": "Purification of hetero-oligomeric protein variants using a modified tandem affinity purification approach",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nRecombinant protein expression using bacterial cells\nTiming: 4 days\nThe recombinant protein constructs are expressed in bacterial cells such as E. coli BL21 (DE3) and Rosetta (DE3) pLysS strains. Single isolated colonies of the transformed cells are further picked up and grown ∼16–18 h in Luria Bertani (LB) broth (containing the appropriate antibiotic depending upon the expression vector used) at 37°C. These cultured cells serve as the primary source for plasmid isolation (by miniprep method[href=https://www.sigmaaldrich.com/deepweb/assets/sigmaaldrich/product/documents/433/883/pln350bul.pdf], as per manufacturer’s instructions) or as the primary culture for protein expression.\nFor protein expression, inoculate about 1–2% (v/v) of the ∼16–18 h grown primary culture to each liter of LB broth containing the appropriate antibiotic.\nGrow the cells further at 37°C (180 rpm) until the optical density (OD) at 600 nm reaches up to ∼0.6 AU.\nNote: The antibiotic used in the media should correspond to the antibiotic resistance gene present in the plasmid as well as in the competent cells used for protein expression.\nOnce the required OD is achieved, induce protein expression by adding isopropyl β-D-1-thiogalactopyranoside (IPTG) to a final concentration of 0.3 mM to the cultured cells and incubate at 18°C for 18 h at 180 rpm.\nCollect 10 μL samples of the pre- and post-induction cultures for analysis of protein expression by SDS-PAGE.\nHarvest the induced cells for protein production by centrifuging at 4°C using Beckman Coulter centrifuge (Rotor ID JA-10) or equivalent for 30–45 min at - ∼3000 × g and store at −80°C until protein purification.\nProtein purification by affinity chromatography\nTiming: 10–12 h\nAll the steps for cell lysis, solubilization, and protein purification are to be carried out on ice, with all the buffers pre-chilled at 4°C.\nCell lysis and protein solubilization",
    "For every gram of the harvested cell pellet, add about 5 mL of lysis buffer (Ni-NTA lysis buffer/ MBP protein purification lysis buffer).\nCritical: Resuspend the pellet in the solution using a glass rod or by gentle vortexing, with intermittent incubation on ice, to avoid protein degradation by heat generated during homogenization.\nTransfer the solubilization mixture to a clean pre-chilled sonicator tube and sonicate the homogeneous cell suspension using a cell sonicator, with the following parameters:\nSonication Pulse: 1 min - On, 2 min - Off.\nAmplitude: 50%.\nNumber of cycles: 5–6 (depending on the lysate volume and clarity of suspension).\nCritical: Perform this step on ice or at 4°C to prevent protein degradation. The number of sonication cycles and the amplitude of sonication can be standardized depending on the stability of the protein.\nCentrifuge the sonicated mixture at ∼17,000–31,000 × g (Beckman Coulter JA-25.50 rotor or equivalent) for 50–60 min at 4°C depending on the volume of cell lysate.\nNote: The particulates (unlysed cells and cellular debris) in the lysate pellet settle at the bottom of the sonication tube, while the soluble protein is present in the supernatant.\nAfter centrifugation, ensure not to disturb the pellet and transfer the supernatant carefully to a clean, chilled 50-mL Falcon tube.\nTo check the efficiency of protein solubilization, prepare 20 μL sample of the supernatant and a sample of pellet (small amount of pellet homogenized in SDS sample loading buffer buffer) for analysis by SDS-PAGE.\nFilter the supernatant once more using a sterile 0.45 μm syringe filter to remove any particulates or remnant debris and transfer the filtered supernatant in clean pre-chilled falcon tube.\nProtein purification",
    "For this part of the protocol, the homo-oligomeric protein variants are purified using affinity chromatography based on the type of affinity tag present in each variant. In our case, WWW with a C-terminal histidine tag was purified using Ni-NTA resin (Nucleo-pore, Genetix Biotech Asia Pvt. Ltd), while ΔΔΔ with N-terminal maltose binding protein (MBP) fusion tag was purified using amylose resin (New England Biolabs). These protein variants were purified using the equilibration buffer (20 mM Na2HPO4/NaH2PO4 (pH 8.0) containing 100 mM NaCl and 3% (v/v) glycerol) and the composition of buffers used for protein elution varied with the type of affinity tag present in each variant. All the buffers used for this process are to be pre-chilled at 4°C before starting with the purification process.\nLoad the filtrate obtained in step 9 onto fresh affinity purification resin (Ni-NTA Agarose for Histidine-tagged proteins or Amylose resin for MBP-tagged proteins) taken in a glass/plastic column used for manual purification (or pre-packed resin columns used with FPLC instrument) and is well equilibrated with the equilibration buffer.\nGently mix the solution at a constant slow speed by placing the purification column on the rocker for 45–60 min at 4°C to promote efficient protein binding to the resin.\nAfter incubation, allow the resin beads to settle and collect the flow-through containing the non-specific cellular proteins.\nAs the flow-through should not contain the protein of interest, prepare a small volume of sample (∼20 μL) for SDS-PAGE analysis to get an estimate of the amount of unbound target protein and save the flow-through until the analysis at 4°C is done.",
    "Wash the column with the equilibration buffer until the coloration in Bradford’s test[href=https://www.sigmaaldrich.com/deepweb/assets/sigmaaldrich/product/documents/358/973/b6916bul-mk.pdf] (used for protein content estimation, performed in micro-titer plates as per the manufacturer’s instructions) becomes negligible or the UV absorbance at 280 nm for the eluant (for purifications performed using FPLC instrument) is nearly to the baseline.\nFor the elution of the bound target protein, increase the concentration of imidazole (for Ni-NTA resin) or maltose (for amylose resin) in the elution buffer in a stepwise manner.\nFor purification using Ni-NTA resin, wash with ∼30 mL of 10 mM, 50 mM, 100 mM, and 250 mM imidazole-containing elution buffer, while for MBP-tagged protein purification, wash with ∼30 mL of 10 mM and 20 mM maltose-containing elution buffer. His-tag proteins (with ∼6 histidine residues) generally elute in 250–300 mM imidazole-containing buffer while MBP-tagged proteins elute in 10 mM maltose-containing elution buffer.\nNote: The concentration gradients selected for elution of the target protein of interest need to be standardized depending on the type of impurities present in the lysate supernatant. If there are more impurities, increase the gradient range and the number of washes for each gradient buffer.\nThe washing with a particular elution buffer should be carried out until the coloration for a particular gradient in Bradford’s test becomes negligible or the UV absorbance at 280 nm for the eluant fraction nearly reaches the baseline.\nDuring standardization, collect ∼20 μL sample for each elution gradient and prepare SDS-PAGE samples to check the amount of impurities that get eliminated in each step of buffer wash. The flow-through from the lower gradient steps should be stored at 4°C until the analysis.",
    "The elution step for the gradient at which the target protein elutes should be performed under cold conditions by placing the collection tubes on ice and the fractions have to be stored immediately at 4°C to avoid protein degradation.\nCollect samples to check the purity of the protein of interest in the collected fractions through SDS-PAGE analysis. Store the pure protein fractions (>95% pure, as estimated by SDS-PAGE) at 4°C for immediate use or flash freeze and stored at −80°C for long-term use depending on the stability of the protein.\nRemoval of affinity tag\nTiming: 1–2 day\nFor enzymatic assays where the affinity tag of the target protein can interfere with the readout of the assay, removal of the tag becomes essential. For this purpose, a protease cleavage site is generally introduced between the affinity tag and the target protein gene during the stages of cloning. In our case, the N-terminal MBP tag in the ΔΔΔ protein variant was interfering with the recombination of the heterotrimer during the renaturation process. Therefore, we preferred to cleave the tag with TEV protease before proceeding to the next steps of hetero-oligomer generation.\nPull together the elution fractions of the purified protein variant and add the recommended units of TEV protease in a protease to target protein ratio as recommended by the manufacturer or as per the amount standardized for laboratory-purified TEV protease.\nNote: A typical protease to target protein ratio (w/w) of 1:50 to 1:200 generally works out effectively for most of the target proteins.\nIncubate the mixture for 12–18 h at 4°C–22°C, depending upon the activity previously determined for the TEV protease. Furthermore, incubate a small aliquot of the uncleaved target protein at similar conditions, which serves as a negative control for SDS-PAGE analysis.",
    "After the incubation period, prepare 20 μL samples (control and test) for SDS-PAGE analysis to determine the successful cleavage of the affinity tag from the target protein.\nNote: If the amount of uncleaved protein is still visible in the SDS-PAGE sample, increase the amount of TEV protease in the cleavage process.\nAfter SDS-PAGE analysis, load the cleaved protein onto an appropriate resin (affinity or size-exclusion chromatography) or use a protein concentrator with an appropriate molecular-weight cut-off for separating the cleaved tag. In our case, since the ΔΔΔ variant had a C-terminal histidine tag, we preferred to incubate the MBP cleaved protein fraction onto Ni-NTA resin and repeated the steps of purification, as suggested in steps 13–19. The cleaved MBP tag elutes in the flow-through, while the target protein now binds to the Ni-NTA resin through the C-terminal His tag.\nPerform the washing with the gradient buffers as mentioned in steps 15–16 for Ni-NTA purification. Depending upon the amount of impurity imparted by the presence of the affinity tag, standardize the volume of gradient buffer used in each washing step.\nElute the target protein using 10–250 mM imidazole containing elution buffer depending on the number of histidine residues present in the C-terminal tag. In our case, since the ΔΔΔ variant had three histidine residues in the C-terminal tag, the target protein was eluted in 50 mM Imidazole. Save the flow-through and each elution fraction until the analysis at 4°C.\nTake 10 μL samples during each step of gradient wash and elution to elucidate the pattern of purification of cleaved target protein through SDS-PAGE analysis.\nFor analysis of tag separation performed using protein concentrator or size-exclusion chromatography, prepare SDS-PAGE samples for each step of separation (filtrate and concentrated samples) to estimate the amount of pure target protein obtained after tag cleavage.",
    "Sample preparation\nTiming: 5–10 h\nBefore proceeding with the step of hetero-oligomer generation using sequential denaturation-renaturation strategy, we need to start with a suitable concentration of the homomeric protein variants. To achieve this, the purified elution fractions for a particular variant are pooled together and protein concentration is carried out until a particular concentration is reached. The concentration of both the parent proteins should be such that there is no chance of aggregation of the protein molecules during the process of denaturation and renaturation.\nFor carrying out protein concentration, use either an Amicon tangential-flow spin filter or an Amicon stirred cell concentrator with an appropriate molecular-weight cut-off for the target protein.\nPrepare the membrane of these concentrators by extensively rinsing first with autoclaved deionized water (two-three times) to remove any debris and then equilibrate it with the respective equilibration buffer ∼16–18 h at 4°C.\nPool the eluted pure fractions for a particular protein obtained from the affinity chromatography purification, load it onto the equilibrated membrane concentrator and perform the concentration process at 4°C, until the desired concentration and volume is reached. Discard the filtrate at each regular interval to maintain the reservoir load on the concentrator membrane.\nNote: For spin filters, centrifuge the concentrators at a speed recommended in the manufacturer’s guidelines to prevent the rupturing of the membrane.\nRun the concentrated sample on SDS-PAGE to determine the purity of the protein and identify the presence of any impurity (cleaved tag or uncleaved protein).\nNote: Concentration of the target protein can also result in amplifying the amount of the impurities that may have been previously present in negligible amounts and is now visible on SDS-PAGE. If any impurity is present, run the concentrated sample through the size-exclusion column and separate the pure protein fraction.",
    "Estimate the concentration of the final protein sample for the two homomeric parent variants by performing Bradford measurements (as per manufacturer’s guidelines) or by measuring the absorption of the sample at 280 nm using the UV-visible spectrophotometer.\nGeneration of hetero-oligomeric protein variants using the protomer mixing strategy\nTiming: 1–4 days",
    "For generating the hetero-oligomeric variants, one needs to perform a protomer mixing strategy where the two asymmetric homomeric parent variants are reconstituted together at a particular concentration, and subjected to a series of sequential denaturation-renaturation process. However, before starting with the protomer mixing strategy, one should be aware of the stability of individual parent homomers towards the denaturation scheme. This can be achieved by performing thermal and/or chemical denaturation studies using fluorescence spectroscopy, circular dichroism spectroscopy, or nano-DSF (Nano differential scanning fluorimetry). If both the homomer variants have melting temperatures within a suitable range, perform heat denaturation of the reconstituted mixture of parent homomers at a temperature that is at the lower end of the two melting temperatures to prevent the denaturation of the lesser stable variant. However, if the parent proteins are less thermostable, then one may opt for chemical denaturation as an alternative, using reagents such as guanidium hydrochloride and urea.2[href=https://www.wicell.org#bib3],3[href=https://www.wicell.org#bib4],4[href=https://www.wicell.org#bib5],5[href=https://www.wicell.org#bib6] The optimal concentration of the denaturant to be used for the final process can be standardized by performing folding studies of each parent homomer at different concentrations of the chemical denaturant using circular dichroism spectroscopy. This study will provide a detailed understanding of the unfolding-refolding dynamics of the parent homomeric proteins and help in deciding the final denaturant concentration. The standardized denaturant concentration or melting temperature finally chosen for the purpose of denaturation of the reconstituted mixture of parent protein should be such that the condition destabilizes the quaternary structure of each variant and is enough to dissociate the parent oligomer into its individual folded protomers. In our case, since both the parent oligomers were found to be highly thermostable, the use of simultaneous heat and chemical denaturation process was employed.",
    "Mix 500–1000 μL of each concentrated parent homomeric protein variant in equimolar concentrations (50–60 μM) and dilute the reconstituted mixture up to 15-fold in the equilibration buffer that additionally contains 6 M guanidinium chloride (pH 8.0).\nNote: The volume and the concentration of homomeric proteins to be used in this step needs to be standardized depending on the stability of the concentrated protein samples.\nIncubate the mixture at 50°C for 1–2 h (depending upon the protein stability) under slow rocking conditions for efficient denaturation into individual protomers.\nTo recombine the protomers into hetero-oligomeric variants, transfer the denatured protein mixture to a dialysis apparatus having the membrane with an appropriate molecular-weight cut-off (10 kDa) and is well pre-equilibrated with buffer A.\nSeal the dialysis apparatus at both ends and place it in a beaker containing 1 L–3 L (approximately 200–500 times greater than the sample volume) of renaturation buffer (the dialysate) pre-chilled at 4°C.\nNote: The renaturation buffer is similar to buffer A (pH 8.0) that additionally contains 300 mM arginine and varies in the glycerol content (starting from 15%–5%). For the first buffer exchange, use renaturation buffer with 15% glycerol.\nPlace a magnetic stir bar inside the beaker and incubate this assembly under constant gentle stirring for 3–4 h at 4°C.\nAfter incubation, carefully replace half the volume of the used dialysate renaturation buffer in the beaker with fresh renaturation buffer containing 10% glycerol. Incubate under constant gentle stirring conditions for 3–4 h at 4°C.\nNote: This step dilutes the concentration of the contaminants diffused in the dialysate and gradually reduces the total glycerol content of the dialysate to 12.5%, thus preventing the protein sample from undergoing instant shock due to fresh buffer exchange.",
    "Replace the equilibrated renaturation buffer entirely with fresh renaturation buffer containing 10% glycerol and continue the incubation for 3–4 h at 4°C.\nRepeat steps 38 and 39 by gradually decreasing the glycerol content until the final dialysis is performed in renaturation buffer containing 5% glycerol. At this step, the protein variants are expected to regain the quaternary structure by reassociation of the protomers.\nFor removal of arginine from the reconstituted protein mixture, perform two-step dialysis with a fresh buffer A containing only 5% glycerol in a similar way as described for steps 38–39 and incubate at 4°C for 3–4 h at each step.\nAfter complete dialysis, carefully transfer the renatured protein mixture from the dialysis apparatus to pre-chilled falcon tubes.\nFilter the solution using a sterile 0.22 μm syringe filter to remove any aggregated protein or particulate matter formed during dialysis or particulate matter.\nLoad the filtrate onto fresh pre-equilibrated membrane concentrator and concentrate the renatured protein mixture (as described in steps 29–30) back to the original volume used before diluting with the denaturant.\nTransfer the concentrated sample to a clean micro-centrifuge tube and spin it for 10 min at ∼13,500 × g and 4°C for removal of any aggregated protein.\nCarefully separate the supernatant and store it in a fresh micro-centrifuge tube at 4°C, until use for the further steps of purification.\nFor analysis of the hetero-oligomer generation, prepare 20 μL samples of the concentrated renatured mixture for SDS-PAGE and Native PAGE.",
    "Note: SDS-PAGE analysis will help to determine the purity of the total renatured mixture and most importantly, help in identifying the presence of any degradation that may have occurred during the denaturation-renaturation process. Through Native PAGE, one can get a correct estimate of the success of the renaturation process. For a protein with ‘N’ number of protomers, one should observe ‘N+1’ number of bands in Native PAGE, where two bands will be of the homomeric parent protein variants while the rest indicate the hetero-oligomeric variants. Depending on the native molecular weight of each variant ensemble present in the renatured mixture, calculate the percentage of Native PAGE gel to be prepared.\nRun two sets of identical Native PAGE gels for all the samples at a constant voltage of 50 V for 5 h at 4°C to avoid any degradation of the protein. Use one gel for Coomassie staining and set aside the other unstained Native PAGE gel for western blot analysis (described below) to confirm the identity of the hetero-oligomers formed in the protomer mixing strategy.\nSeparation of the hetero-oligomeric protein variants\nTiming: 10–12 h\nFor further separation of the different homo- and hetero-oligomeric variants from the renatured protein mixture, one can employ size-exclusion chromatography or ion-exchange chromatography6[href=https://www.wicell.org#bib7] if the variants have a significant difference in their molecular weights or pI respectively. However, if there are no significant differences in the biochemical properties of the variants then one can opt for the tandem affinity tag-based purification protocol for separation, as described below.",
    "For separation based on differences in the histidine tag residues, load the concentrated renatured protein mixture onto fresh Ni-NTA resin pre-equilibrated with buffer A. Take about 1–2 mL of the resin for about 500–700 μL of the concentrated protein mixture in a pre-chilled Eppendorf tube depending on the binding capacity of the resin.\nAfter incubation, allow the resin beads to settle by giving a fast spin in a micro-centrifuge (∼5000–6000 × g) at 4°C for 1 min.\nCollect the flow-through carefully and prepare a small volume of sample (∼20 μL) for SDS-PAGE analysis to get an estimate of the amount of unbound target protein or the presence of any degraded proteins. Save the flow-through at 4°C until the analysis through SDS-PAGE.\nWash the column with the equilibration buffer till the coloration in Bradford’s test (used for protein content estimation, performed in micro-titer plates) becomes negligible or the 280 nm signal for the eluant (using FPLC instrument) is near the baseline.\nFor the elution of the bound target protein variants, increase the concentration of imidazole in the elution buffer in a stepwise manner.\nNote: Since the protein variants differ in the total number of histidine residues present in the terminal tags, a very shallow gradient of imidazole (ranging from 10–250 mM, with a 10 mM interval) in the elution buffers should be used for their separation.\nFor the elution of a particular protein variant, incubate about 200 μL of each buffer gradient to avoid unnecessary dilution of the variants. The impurities are eluted in the flow-through fraction (up to 30 mM imidazole buffer washes), followed by elution of the first homomeric parent protein with the lowest number of histidine residues between 40–50 mM imidazole buffer washes.",
    "Note: The elution step for each gradient should be performed under cold conditions by placing the collection tubes on ice.\nThe hetero-oligomers then elute between 50–200mM imidazole buffer washes in the increasing order of the histidine residues present in the tag.\nThis is followed by the elution of the second homomeric parent protein with the highest number of histidine residues.\nNote: In our case, ΔΔΔ eluted in 50 mM imidazole, while WΔΔ and WWΔ eluted in 80–130 mM imidazole and WWW in 250 mM imidazole containing elution buffers. Depending on the elution profile, the interval between the gradients and the number of washes for each gradient buffer can be standardized.\nElute the protein at each step by micro-centrifuging the beads (at ∼5000–6000 × g) and then carefully collecting the supernatant. Store each fraction immediately at 4°C to avoid protein degradation.\nDuring standardization, collect ∼20 μL sample of every elution gradient wash to check the amount of protein variant through SDS-PAGE as well as Native PAGE analysis.\nRun the native PAGE gels in a set of two – use one gel for Coomassie staining and set aside one unstained gel for western blot analysis (described below) to confirm the purity of the separated hetero-oligomers in comparison to the homomers present in the renatured mixture.\nAfter PAGE analysis, store the fractions containing a single protein variant (>95% pure, as estimated by Native PAGE) at 4°C for immediate use or flash freeze and stored at −80°C for long-term use depending on the stability of the protein.\nConfirmation of hetero-oligomer formation using Western blot\nTiming: 1–2 days",
    "For analysis of the previously run Native PAGE gels (steps 48 and 59), transfer the gel slice containing the separated protein bands from the unstained native PAGE gel onto the nitrocellulose membrane using Invitrogen wet transfer mini blot module and 1X transfer buffer, at a constant voltage of 15 V for 60–90 min.\nOnce the transfer is over, remove the membrane and block it with 5% bovine serum albumin (BSA) prepared in 1X TBST (Tris-buffered saline with Tween-20) buffer for 1 h. Stain the gel with Coomassie Blue to check the transfer efficiency.\nAfter the incubation for blocking, wash the membrane three-six times with 1X TBST buffer for 5–10 min intervals each.\nDepending on the type of tag present in the protein variants, probe the protein bands in the blot using primary antibody against the tag present at the C-terminal or N-terminal end of the variant.\nNote: In our case, since all the homo- and hetero-oligomers also differed in the number of FLAG tag at the N-terminal end (originally introduced in ΔΔΔ protein construct), the western blot was performed using monoclonal anti-FLAG antibody.\nIncubate the membrane ∼16–18 h with the recommended/standardized dilution of the primary antibody (1:2000 dilution for anti-FLAG antibody) under constant rocking conditions at 4°C. The dilution of the antibody used can be standardized depending on the manufacturer’s guidelines.\nOn the following day, remove the membrane from the antibody solution and wash the membrane three-six times with 1X TBST buffer for 5–10 min intervals each.\nIncubate the membrane further at ∼22°C–24°C for 1 h with the recommended/standardized dilution of the secondary antibody (1:5000 dilution of goat anti-mouse IgG HRPO secondary antibody).\nNote: Prepare the antibody dilutions in 1X TBST and add 1% BSA to prevent non-specific interactions.",
    "Wash the membrane three-six times with 1X TBST buffer for 5–10 min intervals each and store in 1X TBST buffer at 4°C until probing the blot.\nDevelop the blot using an enhanced chemiluminescence kit (as per manufacturer’s instructions[href=https://assets.thermofisher.com/TFS-Assets/LSG/manuals/MAN0011536_Pierce_ECL_West_Blot_Subs_UG.pdf]) in the ChemiDoc™ MP Imaging System with optimum exposure."
  ],
  "subjectAreas": [
    "Protein Expression And Purification",
    "Protein Biochemistry",
    "Biophysics"
  ],
  "bigAreas": [
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}