{
  "id": 10876,
  "origin_website": "Jove",
  "title": "Polymeric Microneedle Array Fabrication by Photolithography",
  "procedures": [
    "1. Photomask Fabrication\nClean a 4” glass wafer with piranha solution (H2SO4/H2O2 in 2:1 ratio) for 20 min at 120 °C by immersion in a quartz tank.\nDeposit a layer of Chromium/Gold (30 nm of Cr/1 µm of Au) layer on the glass wafer using an e-beam evaporator7 (Figure 1A).\n\t\nPlace the wafers in an e-beam evaporator. Once the vacuum reaches 5 x 10-6 Torr, turn on the high voltage source (10 kV). Control the thickness by the monitor control panel.\nPre-clean each material for 30 sec using the e-beam gun, keeping the shutter “OFF” (in order to avoid the deposition on the wafers).\nGenerate a Cr/Au photoresist masking layer for deep wet etching of the glass.\n\t\nApply a 2 µm thick photoresist by spinning 5 ml of the solution for 30 sec at 3,000 rpm using a spin-spray coater system. Prebake the photoresist on a hotplate at 100 °C for 1.5 min.\nExpose and hard bake the photoresist at 120 °C for 30 min on a hot plate. It is critical to generate a hydrophobic surface and a strong adhesion of the photoresist to the metal layer. Pattern the Cr/Au layer using Cr and Au etchants through the photoresist mask8,9.\nFor protection of the un-patterned glass surface, temporarily bond the glass wafer to a dummy silicon wafer.9\nPlace the glass wafer on a hot plate at 110 °C and melt the wax on the opposite side of the glass wafer (in such a way that the entire surface of the wafer is covered with wax).\nPlace a dummy silicon wafer in contact with the glass wafer and press to remove the excess wax. In order to avoid spilling of the wax, place a clean room tissue paper on the hotplate.",
    "Perform isotropic etching of the lens using optimized hydrofluoric acid (49% v/v) and hydrochloric acid (37% v/v) solution ( in a volumetric ratio of 10:1) with a magnetic stirrer for 8.5 min.10 Presence of the HCl is critical in achieving a good surface quality of generated lenses.\n\t\nEnsure that the etching rate is 7 µm/min; using a total volume of 200 ml of etching solution. Perform etching in a plastic container and take safety precaution for this processing step.\nClean the wafer in the deionized (DI) water by rinsing and further drying at RT.\nAfter the process completion, separate the glass wafer from the dummy silicon wafer and warm up the wax using a hot plate at 100 °C for 15 sec. As the wax melts at this temperature, detach the glass wafer from the dummy silicon wafer.\nRemove remaining wax, the photoresist and the overhanging Cr/Au layers at the edges of the lenses using ultrasonication for 1 hr using N-methyl-2-pyrrolidone as the solvent at 80 °C in an ultrasonic tank.\nCreate a PDMS mold replica of the microlenses fabricated on the photomasks11.\nCharacterize the photomask dimensions (length and width) and the microlenses PDMS mold (depth and diameter) replicas using a scanning electron microscope and stereomicroscope respectively.12-14\n2. MN Shafts Fabrication\nCreate a cavity of 2.5 cm × 0.9 cm using the glass slides mounted on either sides of a glass. The number of the glass slides stacked on either side will determine the height of the cavity known as spacer thickness (Figure 1B).",
    "Secure each layer of the glass slide by applying a thin layer of the prepolymer solution containing Poly(ethylene glycol) diacrylate (PEGDA, MW = 258 Da) with 0.5% w/w 2-hydroxy-2-methyl-propiophenone (HMP) onto the glass slide followed by irradiation of the set up with the high intensity ultraviolet (UV) light for 2 sec.\nPosition the photomask (previously fabricated) with the Cr/Au coated surfaces facing the interior of the cavity. Ensure that the sides of the cavity walls are not obscuring the lenses embedded in the photomask.\nFill the cavity with the prepolymer solution until the Cr/Au coated surface is in contact with the solution without any visible bubbles.\nIrradiate the setup with high intensity UV light of a desired intensity for 1 sec at a distance of 3.5 cm from the UV source using the UV curing station with a UV filter range of 320-500 nm. Use a collimating adaptor with the UV light probe.\nMeasure the intensity of UV light used using a radiometer.\nFollowing UV exposure, remove the photomask with the array of MNs. Pour the excess prepolymer solution that is not polymerized in the process back into its original container for reuse.\nQuantify the length and tip diameter of the MNs using a stereomicroscope according to manufacturer’s instructions.\n3. MN Backing Layer Fabrication\nWith forceps, place the MNs (previously fabricated) attached onto the photomask in a well of a 24-well plate as shown in the Figure 1C.\nAdd a specified volume (300 - 400 µl) of the prepolymer solution into the well until the needles are submerged to a desired height. This volume determines the thickness of the resultant backing layer.\nIrradiate the setup with high intensity UV light (15.1 W/cm2), 10.5 cm away from the UV source for a duration of 1 sec.",
    "Separate the backing layer on the MN array from the photomask using a sharp blade.\nQuantify the length, tip diameter and base diameter of the MNs with the backing layer using a stereomicroscope according to manufacturer’s instructions.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}