{
  "id": 18356,
  "origin_website": "Jove",
  "title": "Induction and Assessment of Exertional Skeletal Muscle Damage in Humans",
  "procedures": [
    "The following procedures are in accordance with the standards of the Brigham Young University Institutional review board (IRB).\n1. Prepare the Contraction Protocols\nNOTE: The following protocol instructions are based on the Biodex Advantage software. Navigating the software and operating the dynamometer will be different if different systems are used.\nIsokinetic Strength Test Protocol\n\t\nTo make the isokinetic protocol, open dynamometer control software on the computer and select the \"Protocol\" tab and then select the \"Record\" tab on the toolbar on the top of the screen. Select \"New Protocol\" from the dropdown list.\nIn the \"Study Type\" box, select the \"Test\" option.\nSelect the following parameters from the dropdown menus: Under the \"Mode\" menu select Isokinetic. Under the \"Joint\" menu select knee. Under the \"Pattern\" menu select extension/flexion. Select concentric contractions for both extension and flexion movements. Select \"reps\" under the \"End By\" dropdown menu.\nOn the \"Unilateral\" tab program 1 set of 3 repetitions at a speed of 60°/sec for both the away and toward contractions. To do this, enter \"1\" into the \"# sets\" field and type \"3\" in the \"End By Reps\" row. Then type 60 in both the \"Speed Away\" and \"Speed Toward\" rows.\nUse 90° as the anatomical reference point and set range of motion limits to approximately 10° away and 110° towards (0° = full extension, 135° = full flexion).To do this, select the \"set ROM\" button on the left side of the screen. Calibrate the lever arm so that 90° is parallel to the floor (as indicated using the lever arm angle indicator provided on the computer screen). Then using 90° as the anatomical reference point, set the range of motion limits to approximately 10° away and 110° towards (0° = full extension, 135° = full flexion).",
    "NOTE: The joint angle settings given here are preferred, however these settings should be modified on a case-by-case basis especially when working with subjects with a fixed flexion deformity or other limitation.\nName the protocol in the \"Description\" field on the bottom left of the screen and select the save button on the top menu bar.\nIsometric Strength Test Protocol\n\t\nRepeat steps 1.1.1 to begin making the isometric protocol.\nSelect the \"Test\" option from the \"Study Type\" box.\nSelect the following parameters from the dropdown menus: Under the \"Mode\" menu select \"isometric\". Under the \"Joint\" menu select \"knee\". Under the \"Pattern\" menu select \"extension/flexion\". Under the \"Contraction Direction\" menu select \"away\". In the \"End By\" menu select \"reps\".\nProgram a test with 1 set of 3 isometric contractions lasting 5 sec each at a joint angle of 70°. To do this, type \"1\" into the \"Positions\" field on the \"Unilateral\" tab. Under the position #1 column, type \"3\"in the \"End by Reps\" row. In the row labeled \"Angle\" select \"70\".\nSelect 90° as the anatomical reference point and an away limit to 70°.\nName the protocol in the \"Description\" field on the bottom left of the screen and select the save button on the top menu bar.\nMuscle Damaging Eccentric Exercise Protocol\n\t\nTo make the eccentric exercise protocol, open dynamometer control software on the computer and select the \"Protocol\" tab. Then select the \"Record\" tab on the toolbar on the top of the screen. Now click on \"New Protocol\" from the dropdown list.\nSelect the \"Exercise\" option from the \"Study Type\" box.\nSelect the following parameters from the dropdown menus: Under the \"Mode\" menu select \"isokinetic\". Under the \"Joint\" menu select \"knee\". Under the \"Pattern\" menu select \"Extension/Flexion\". Under the \"Contraction\" menu select \"Con/ECC\".",
    "On the \"Unilateral\" tab, program 10 sets of 10 repetitions at speeds of 180°/sec away and 120°/sec towards with 60 sec rest between sets.\n\t\t\nType \"10\" into the \"# Sets\" field.\nIn the first column (labeled #1), type \"10\" in the row labeled \"End by Reps\". Then type \"180\" in the next row labeled \"Speed Away\". In the next row labeled \"Speed Toward\", type \"120\". In the row labeled \"Torque\", type 200 to 600 depending on the anticipated strength of the subject.\nRepeat step 1.3.4.2 for sets #2 through #10.\nType 60 in the \"Rest Time in secs\" field.\nType 90° into the \"Anatomical Reference\" field.\nSelect the \"Set ROM\" button on the left side of the screen and set range of motion limits to 40° away and 110° towards (0° = full extension, 135° = full flexion). These settings provide the range of motion through which the subject must provide resistance against the arm of the dynamometer. As a safety precaution, the dynamometer will stop moving if the subject stops providing resistance within this specified range of motion.\n\t\t\nTo set the range of motion, select the \"set ROM\" button on the left side of the screen. Calibrate the lever arm so that 90° is parallel to the floor (as indicated using the lever arm angle indicator provided on the computer screen). Then using 90° as the anatomical reference point, set the range of motion limits to 40° away and 110° towards (0° = full extension, 135° = full flexion).\n\t\t\tNOTE: These joint angle settings are suggestions for a typical healthy subject. These should be modified to fit the abilities from one individual to another.\nName the protocol in the \"Description\" field and select the \"Save\" button at the top tool bar.\n2. Baseline Measurements\nSoreness Measurements",
    "Make a visual analog scale by drawing a 100 mm line horizontally across a page.\nOn the left-hand side of the line indicate \"No soreness\" and on the right-hand side of the line indicate \"Extreme soreness\" (Figure 1). This method is commonly used to assess delayed-onset muscle soreness1,10,11.\nInstruct the subject to do two body-weight squats. Perform both squats with arms held straight out in front of the shoulders and feet shoulder-width apart. Proper depth is reached when the upper legs are parallel to the floor before returning to the start position.\nAsk the subject to indicate the intensity of the soreness he or she felt in the quadriceps femoris muscles during the squats by drawing a vertical line at the appropriate spot on the visual analog scale.\nQuantify the subject's level of soreness by measuring the distance in millimeters from the no-soreness end of the visual analog scale to subject's mark.\nSerum Creatine Kinase\n\tCAUTION: Wear protective gloves before handling blood and dispose of needles immediately after use in a sharps container as per hospital or university policy.\n\t\nFollow standardized phlebotomy procedures to withdraw blood from the antecubital region of the subject's arm under fasting conditions to obtain 5 to 6 ml of blood12.\nCentrifuge the blood sample at 15 x g for 15 min at 3 °C to separate serum from blood cells.\nUsing a transfer pipette, transfer the serum sample into a microcentrifuge tube labeled appropriately for subject and time point.\nStore the sample at -80 °C for later use.\nAssay the serum samples for creatine kinase activity using a commercially available kit according to manufacturer's protocol. Alternatively, the serum samples can be transported to a local medical diagnostic laboratory for analysis.\nSubject Preparation",
    "Forty-eight hours prior to the subject's visit, instruct them to avoid strenuous or unaccustomed exercise, non-steroidal anti-inflammatory drugs and alcohol.\nWhen the subject arrives, collect weight, height, sex, and leg dominance information prior to setup. Leg dominance can be determined by asking the subject with which leg they would choose to kick a ball.\nHave the subject warm up at 50 to 150 W for 10 min on a bicycle ergometer before performing the strength tests.\nAfter the warm-up ask the subject to sit in the chair of the dynamometer. Adjust the tilt, height, depth, recline, and rotation of the seat and shaft arm to fit the subject. Use the lateral femoral condyle as a reference and align rotational axis of the knee with that of the dynamometer shaft arm. Adjust the shaft arm length so that it is just proximal to the medial malleolus, and secure with strap. Subject should be able to plantar flex comfortably with full range of motion.\nLeave sufficient space (25 mm) between the front edge of the seat and the back of the leg to allow maximal flexion of the knee joint without pinching or discomfort.\nStabilize subject with shoulder, hip, ankle and thigh straps. To isolate the knee extensors and avoid ancillary muscle involvement, it is essential that the subject be securely stabilized.\nHave the subject perform 3-5 practice extension/flexion maneuvers of the knee, monitor range of motion and signs of discomfort that may exist prior to beginning the contraction protocol, and adjust as needed.\nNow that the adjustable components of the dynamometer are properly fitted to the subject, record the seat position settings and shaft arm position for repeatable setup on subsequent visits.",
    "NOTE: It is important that the subject is safe and comfortable. The dynamometer is equipped with an emergency stop button for both the subject and operator in the case of an emergency.\nForce Measurement\n\t\nAfter the subject is properly oriented in the seat and the isometric strength test protocol is loaded, instruct the subject on how to perform the test.\n\t\t\nTell the subject that he or she will be contracting against the lever arm that will stay stationary. Tell the subject to follow the prompts of the computer screen doing 3 contractions lasting 5 sec each.\nTell the subject to maintain maximal effort for each contraction. Tell the subject to breathe during the contractions. Ask the subject to cross their arms across the chest during the test.\nStart the isometric protocol and allow the subject to practice the test with submaximal effort. This practice trial will familiarize the subject to the test as well as provide a test-specific warm-up. Allow the subject to practice the test 2 to 3 times.\nOnce the subject is ready, start the test and verbally encourage the subject to provide maximal effort for each contraction.\nRecord torque, power, and work. The software also calculates the coefficient of variance (a statistical representation of test validity based on reproducibility of performance, lower values indicate higher reproducibility). If the coefficient of variance exceeds 15%, repeat the test. Repeat the test up to 4 times. If the subject is unable to produce a coefficient of variance less than 15% after 4 attempts use the data from the set that yielded the lowest coefficient of variance value.\nAllow the subject two to three minutes to rest, and then load the isokinetic protocol to obtain isokinetic strength data.",
    "After the subject is secured in the seat, instruct on how to perform the isokinetic test.\n\t\t\nTell the subject that they will be doing three extension and flexion contractions against the lever arm that will move at a fixed rate. Tell the subject the goal is to contract as forcefully as possible throughout the entire range of motion for each contraction.\nTell them that the lever arm will stop when they reach the end of the range of motion. Ask the subject to cross his arms across the chest during the test. Remind the subject not to hold their breath during the contractions\n\t\t\tNOTE: While the data gathered from the flexion component of the contraction may not be of interest to the researcher, subjects who provide maximal effort for both the flexion and extension maneuvers tend to yield better force consistency during the extension maneuver.\nStart the test and verbally encourage the subject to provide maximal effort.\nRecord torque, power, and work. The software also calculates the coefficient of variance (a statistical representation of test validity based on reproducibility of performance, lower values indicate higher reproducibility). If the coefficient of variance exceeds 15%, repeat the test.\n\t\t\nRepeat the test up to 4 times. If the subject is unable to produce a coefficient of variance less than 15% after 4 attempts, use the data from the set that yielded the lowest coefficient of variance value.\n3. Damage Induction\nOne to three days after the baseline measurements of Part 2, have the subject return to the lab for the damage induction portion of the protocol\nHave the subject warm-up on a cycle ergometer for 10 min at 50 to 150 W.",
    "After the warm-up, orient and secure the subject in the dynamometer using the adjustment settings recorded in step 2.3.7, load the muscle damaging eccentric exercise protocol and instruct the subject on how to properly perform the exercise.\n\t\nTell the subject that they will contract against the lever arm to initiate the movement of the shaft arm for each contraction. Tell the subject that as the shaft arm moves toward them at a fixed rate, their goal is to contract against it as forcefully as possible.\nAllow the subject to grasp the handgrips located on either side of the seat.\nTell the subject to breathe during the contractions; exhale during the eccentric phase.\nWhen the subject is ready, start the first set of contractions by pushing the start button on the screen.\nVerbally encourage the subject to maintain maximal effort for each contraction.\nFollow the prompts on the screen that will guide the subject through 10 sets of 10 repetitions with a 1 min rest period between sets.\nOnce 10 sets are completed allow the subject 1 to 5 min to rest before repeating the protocol.\n\tNOTE: The maximum number of sets available under the eccentric protocol is 10 however this may vary depending on the dynamometer and software used. The rest provides time for the operator to reload the protocol if necessary.\nRepeat the procedure two more times for a total of 300 predominantly eccentric contractions.\n4. Muscle Damage Assessment\nRepeat both Isokinetic and isometric strength tests as described in 2.4 immediately after the damaging exercise and at 24, 48, 72, and 96 hr after.",
    "Repeat the soreness measurement as described in part 2.1 at 24, 48, 72, and 96 hr after damaging exercise. Be sure to use a new visual analog scale for each assessment so that the subject cannot see their previous responses.\nRepeat the blood draw as described in part 2.2 for the creatine kinase assay at 48 and 120 hr after damaging exercise, or at time points dictated by the experimental protocol.\nPlot the creatine kinase, strength and soreness data on the y-axis of a graph against time on the x-axis.\nObserve how these variables deviate from and return toward baseline values in the days following exercise, indicating damage and repair, respectively.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}