{
  "id": 13326,
  "origin_website": "Jove",
  "title": "Thawing, Culturing, and Cryopreserving Drosophila Cell Lines",
  "procedures": [
    "1. Thawing and Reviving Frozen Drosophila Cell Lines\nSterilize the hood by wiping the working surface with 70% ethanol. Dispense 5 mL of the appropriate medium (Table 1) into a 25 cm2 T-flask (T-25).\nRemove the cryovial/ampule from liquid N2 or dry ice. Wipe the cryovial with 70% ethanol, carefully loosen and unseal the ampule.\nUsing a Pasteur pipette, withdraw 1 mL of room temperature (RT) media from the T-25 flask. Slowly add the media into the cryovial and gently mix to thaw the frozen cells, ensuring that the cell suspension does not overflow.\nTransfer the entire volume of the thawed cell suspension from the ampule into the T-25 flask. Repeat to ensure the cell suspension has been completely transferred.\nPlace the flask in a 25 °C incubator, allowing the cells to settle and adhere for at least 2 h. Examine the cells under a microscope to ensure that most cells have settled on the growing surface. Gently remove old media and replace with 5 mL of fresh media. Return the flask into the incubator.\nOn the following day, gently remove the old media and replace with 5 mL of fresh media. Return the culture to the incubator.\n2. Thawing and Reviving Frozen Drosophila Cell Lines (Alternative)\nIn a sterile hood, thaw the cells by resuspending the frozen pellet with 1 mL of RT media. Transfer all the thawed cell suspension into a 15 mL conical tube.\nPellet the cells by centrifugation at 1,000 x g for 5 min. Discard the supernatant and resuspend the cell pellet in 5 mL of fresh media.\nTransfer the entire volume of the cell suspension into a T-25 flask and incubate the culture at 25 °C.",
    "1 to 2 h later, examine the cells under the microscope to ensure that most cells have settled on the growing surface. On the following day, replace the old media with 5 mL of fresh media and return the culture to the incubator.\n3. Subculturing Semi-adherent Cells Grown in 100 mm Culture Plates\nSterilize the hood by wiping with 70% ethanol. Bring the sterile materials for subculturing into the hood, including media bottles, pipettes, pipette aid, and culture plates.\nExamine the morphology and confluence of the culture under a microscope. Look for clear signs of microorganismal contaminations in the culture. Determine whether the cells are ready to be passaged, based on the characteristics of the culture: cell density and doubling time, including the last time they were subcultured.\nIf the culture appears highly confluent (Figure 1), determine the cell density. In the sterile hood, dislodge the cells from the growing surface by pipetting up to 10 mL of the medium from the plate and dispensing it over the cells. Repeat a few times, ensuring not to create foam, until the growing surface becomes clear. Determine the cell density using a hemocytometer or an automatic particle counter (section 5, Figure 3). Subculture the cells if the cell density is between 5 x 106 and 1 x 107 cells/mL.\nNOTE: Do not subculture Drosophila cell lines to a cell density below 1 x 106 cells/mL.\nDilute the cell suspension accordingly using an appropriate medium to a final seeding concentration of at least 1 x 106 cells/mL.\nFor routine passaging and maintenance, add an appropriate volume of cell suspension to a pre-determined volume of medium in a new culture plate to achieve the desired seeding cell density.",
    "For scaling up a culture, transfer all the cell suspension into a large flask. Dilute the cell suspension to the desired cell density with an appropriate volume of the medium. Distribute equal volumes of the diluted cell suspension to new plates. This method minimizes the variations in cell density between plates.\nCover and label the plates with the operator initials, date, split ratio, seeding cell density, cell line identifier, media, passage number and any media additions such as antibiotics.\nPlace the plates into a plastic container and return the box to the incubator.\nNOTE: Table 3 lists the culture vessels commonly used for culturing Drosophila cell lines and the associated working volumes.\n4. Dislodging Adherent Cells Grown in 100 mm Culture Plates\nTransfer all the medium from the plate to a new sterile flask. Save the medium.\nRinse cells by slowly adding 1 mL of 0.05% trypsin-EDTA to the plate. Swirl gently to ensure the trypsin solution covers the entire growth surface. Discard the trypsin solution.\nGently add 1 mL of 0.05% trypsin-EDTA to the plate. Incubate the plate at 25 °C between 3−10 min while monitoring for visible signs of the cell layer detaching and sliding off the growing surface.\nAdd 9 mL of the saved medium to the plate to stop trypsin activity. Mix the cell suspension to dissociate cell clumps. Once all cells have been dislodged, the growing surface will be clear.\nNOTE: The use of digestive enzymes such as trypsin aids in passaging strongly adherent cell lines. Trypsin is a mixture of proteases often derived from porcine pancreas and is commercially available in different grades of purity.\n5. Manual Cell Counting Using the Neubauer Cell Counting Slide\nPrepare the hemocytometer slide and coverslip by wiping the surface with 70% alcohol.",
    "Mix the cell suspension and dispense 15 µL of the cell suspension into the grooved edge of the hemocytometer (Figure 3A) to fill the first chamber of the hemocytometer. Fill the second chamber of the hemocytometer. The cell suspension will be drawn into the counting chamber by capillary action.\nUsing a 10x microscope objective, count the cells within the 1 mm2 area in the middle of the grid bound by the parallel lines (Figure 3C,D). To avoid duplicate counting, count the cells that overlay the top and left boundaries, but not cells that cross the right and bottom boundaries of the 200 µm2 squares. Count between 100−200 cells. Repeat the count with the second chamber.\nCalculate the average of the two counts and determine the cell density according to the following formula: Cell density (cells/mL) = Average cell count (n1 + n2/2) x 104.\nNOTE: Cell viability is expressed as the percentage of viable cells over total cells. To determine cell viability, mix the cell suspension with an equal volume of trypan blue (0.4%) solution prior to manual or automatic cell counting. Live cells will not take up the dye, while dead cells will be stained blue.\n6. Cryopreservation of Drosophila Cell Lines\nCheck the culture for healthy morphology, growth, and the lack of contamination. Harvest the cultures from the mid to late-log growth phase (step 3.3, or section 4). For many Drosophila cell lines, it is approximately between 4 x 106 cells/mL to 8 x 106 cells/mL.\nTransfer the entire cell suspension into a 15 mL or 50 mL conical tube. Collect the cells by centrifugation at 1,000 x g for 5 min and discard the supernatant.",
    "Resuspend the cell pellet in a volume of freezing medium (Table 4) that will result in a final cell density of at least 4 x 107 cells/mL.\nAdd dropwise the appropriate amount of the cryoprotectant dimethyl sulfoxide (DMSO) into the cell suspension such that the final DMSO concentration is 10%. Gently mix the cell suspension.\nCarefully dispense 0.5 mL of the cell suspension into aliquots of the pre-labeled cryovials (~2 x 107 cells/vial). Place the ampules into a freezing container filled with isopropanol (Figure 4A). Transfer the freezing container into a -80 °C freezer overnight to allow the temperature of the cryovials to drop slowly (-1 °C/min) to the freezer temperature.\nTake out the frozen cryovials and rapidly attach them to canes (Figure 4B). Insert the canes containing cryovials into a canister (Figure 4C). Alternatively, place frozen cryovials inside a pre-cooled freezing box (Figure 4D). Store frozen cryovials in the liquid phase of N2 freezers (Figure 4E,F).\nNOTE: When using freezing media containing DMSO, a delay of up to 30 min at RT is not detrimental to the cells."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}