{
  "id": 18334,
  "origin_website": "Jove",
  "title": "Assessment of Child Anthropometry in a Large Epidemiologic Study",
  "procedures": [
    "All the procedures are approved by the Harvard Pilgrim Health Care Institutional Review Board.\n1. Training Procedures\nHave the trainees (research assistants) complete a multi-day, multiple hour training program to learn proper positioning, watch training videos, and receive in-person training from an experienced auxologist.\n\t\nInstruct the trainees to practice performing measurements on each other, while an auxologist or resident anthropometry expert evaluates each trainee's technique and makes appropriate adjustments.\nOrganize a workshop with external volunteers, optimally of a variety of ages and body types, ideally a representative sample of the study population. Have the trainees measure each volunteer a minimum of two times per measurement.\nAfter completing the training program, have the trainees spend approximately an additional 40 - 50 h practicing manual anthropometry techniques on one another and volunteers. During this time, observe the trainees, monitoring adherence to protocol and proper technique. Give each trainee the necessary amount of training based on innate skill level and previous experience.\n2. Preparation of Subjects\nInstruct participants to wear light clothing that allows easy access to the extremities and torso while maintaining modesty, optimally a standard outfit provided by the research staff.\n3. Height\nMeasure height using a well-constructed stadiometer, which can be wall-mounted or portable. Either way, take measurements while ensuring that the stadiometer is set up against a wall on a hard, flat surface.\n\tNOTE: Among children under the age of 2 years, measure recumbent length instead of standing height. Recumbent length measurements require different procedures8, not detailed in this protocol.\nAsk the participant, before stepping on the stadiometer, to remove any items that could impede measurements. For example, shoes, thick socks, hats, and hair accessories (e.g. hats, headbands, hair bands on the crown of head).",
    "Guide the participant back onto the board until the participant's buttocks, shoulder blades, or back of head make contact with the board.\nWhile facing the participant, instruct the participant to stand on the board with feet spread approximately 2 feet apart. Ask the participant to slowly inch his/her legs back together until the legs, mid-thighs, knees, or feet make contact.\nInstruct the participant to stand as straight as possible, without slouching or leaning. Ensure that feet are flat on the bottom of the height board or floor, and arms hang down by the participant's sides. Confirm that weight is evenly distributed between the left and right sides of the body.\nVisually verify that the mid-axillary line is perpendicular to the floor. Instruct the participant to move his/her feet away from the back of the stadiometer if necessary to achieve this position.\n\tNOTE: The mid-axillary line is an imaginary line in the coronal plane midway between the anterior axillary line and the posterior axillary line, extending from the center of the axilla down through the most superior part of the iliac crest (Figure 1).\nimgsrc://cloudfront.jove.com/files/ftp_upload/54895/54895fig1.jpg\nFigure 1: Location of the Mid-axillary Line. A coronal line halfway between the anterior and posterior axillary lines15. Please click here to view a larger version of this figure.[href=http://cloudfront.jove.com/files/ftp_upload/54895/54895fig1large.jpg]\nAsk the participant to stand up straight. Ensure that one or more of the following body parts makes contact with back of the stadiometer: feet, head, shoulders, or buttocks.\nPlace the participant's head into the Frankfort Plane (Figure 2).",
    "Determine the Frankfort Plane by doing the following: Looking at the side of the participant's head, draw an imaginary line from the lowest margin of the eye orbit to the highest margin at the opening of the ear canal. Position the head so that the imaginary line is parallel to the floor and perpendicular to the stadiometer.\nimgsrc://cloudfront.jove.com/files/ftp_upload/54895/54895fig2.jpg\nFigure 2: The Frankfort Plane. A horizontal plane that passes through the inferior margin of the orbit and the tragion (notch above the tragus of the ear) 16. Please click here to view a larger version of this figure.[href=http://cloudfront.jove.com/files/ftp_upload/54895/54895fig2large.jpg]\nRemind the participant to stand straight and tall, and position the headpiece firmly on top of his/her head with sufficient pressure to compress the hair and make contact with the skull. With the headpiece at eye level, take the measurement to the nearest tenth of a centimeter.\n4. Sitting Height\nPlace the stadiometer on top of a sturdy stool tall enough to allow the participant's legs to form a 90° angle with the ground. Alternatively, if the stadiometer is wall-mounted, place a stool of known height in front of the stadiometer.\nAsk the participant to sit on the stadiometer or on top of the stool so that the buttocks are touching the back of the board.\nHave the participant sit as erect as possible, with buttocks, shoulders and/or head touching the back of the board. Ensure that the mid-axillary line (as described in 3.6) is perpendicular to the stool and parallel to the stadiometer.\nGuide the participant's knees directly in front of his/her body, and place his/her hands on the thighs.\nPlace the participant's head into the Frankfort Plane. Refer to 3.8.",
    "Position the headpiece firmly on top of the participant's head with sufficient pressure to compress the hair and make contact with the skull.\nWhile directly facing the measuring index with the headpiece at eye level, take measurement to the nearest tenth of a centimeter.\n5. Weight\nInstruct the participant to wear either light clothing or the standard clothing provided at the onset of the anthropometric measurements, to empty his/her bladder, and to remove his/her shoes before attempting the weight measurement.\nAsk the participant, to stand on the scale. Record the measurement to the nearest tenth of a kilogram.\n6. Waist Circumference\nInstruct the participant to stand erect, still, and lateral to a chair, ideally in front of a mirror. Sit facing the mirror, with the participant's right or left hip bone at eye level. Instruct the participant to cross his/her arms in front while holding up his/her shirt.\nSitting to the side of the participant, locate the anterior part of the hip bone, which is usually the portion of the hip bone that is most easily identified through dense adipose tissue. Palpate upward along the hip bone to locate the iliac crest, the superior ridge of the hip bone. Continue to palpate the iliac crest until reaching the intersection between the uppermost point of the iliac crest and the mid-axillary line (refer to section 3.6 to locate mid-axillary line). Identify site with a self-adhesive sticker.\nRepeat 6.2 on the other side of the participant's body.",
    "While the participant stands perpendicular to the mirror, gently place the measuring tape around the waist on top of the two stickers with the zero side (or base) of the tape measure below. Using the mirror as a guide, adjust the tape so that it is on a level, horizontal plane across the front, back, and both sides.\nTighten the tape, without pulling the skin. As this is a fine balance, start with the tape measure pinching the skin slightly. Then slowly loosen the tape measure to form a smooth line along the skin, so that the skin is no longer constricted. Place the tape measure firmly on skin without cinching the participant's waist, so that there are neither gaps in the tape measure nor pinched skin.\nAt the end of the participant's natural exhalation, read the tape to the nearest tenth of a centimeter.\n\tNOTE: This measurement is most effectively performed in the presence of mirrors or two research assistants. One researcher, alone, cannot observe proper placement of the tape measure on all sides of the body. The mirrors and/or additional staff member compensate for obstructed areas, informing proper tape measure placement.\n7. Hip Circumference\nInstruct the participant to stand erect next to a chair, perpendicular to the mirror. Ask the participant to fold his/her arms in front of the body with feet pressed together.\nSit to the side of the participant and face the mirror, so that eyes are level with the participant's hips.",
    "Place the measuring tape around the hips over lightweight, tight-fighting clothing. Anchor the tape measure at the maximum protuberance of the buttocks. Adjust the tape so that it is on a horizontal plane around the body. Hold the tape measure firmly. Similarly to the waist measurement, tighten the tape measure so that skin is pinched. Release the tape measure slowly until there is a smooth line around the tape measure.\nHolding the tape measure firmly and flatly, read the measurement to the nearest tenth of a cm.\n8. Mid-Upper Arm Circumference (MUAC)\nInstruct the participant to lift his/her shirtsleeve to shoulder height, to ensure that measurement is conducted directly on skin. While the participant is standing, position his/her right arm so that it is flexed at a 90° angle at the elbow with the palm facing up and fingertips pointing straight ahead.\nStand behind the participant. Locate the posterior lateral shoulder bone that connects the participant's shoulder blade and clavicle bone (Figure 3). This bony structure, known as the acromion process, will serve as initial point zero on the tape measure.\nimgsrc://cloudfront.jove.com/files/ftp_upload/54895/54895fig3.jpg\nFigure 3: Anatomy of the Shoulder. Shoulder anatomy includes the acromion process, identified in red17. Please click here to view a larger version of this figure.[href=http://cloudfront.jove.com/files/ftp_upload/54895/54895fig3large.jpg]\nExtend the tape down the midline of the back of the arm, past the bony tip of the elbow, known as the olecranon. Using a tape measure the distance between the acromion process and the olecranon to the nearest tenth of a centimeter and place a self-adhesive sticker halfway between the olecranon and the acromion process over the posterior center of the humorous.\nHold the participant's arm slightly away from body, to ensure that muscles are relaxed.",
    "Standing to the right and slightly behind the participant, wrap the MUAC Tape (small, flip tape) around the upper arm so that it covers the self-adhesive sticker. Ensure that the tape measure is perpendicular to the arm length.\nPull the tape so that there are no gaps in tape or areas of skin constriction. As with the hip and arm circumferences, this is a fine balance. Use greater tension and slowly release the tape until there are no further areas of pinched skin.\nRead the measurement and record to the nearest tenth of a centimeter.\n9. Triceps Skin Fold Thickness\nUse the sticker placement at the posterior midpoint of the participant's arm (as determined by steps 8.1 - 8.3). Instruct the participant to stand upright, with shoulders relaxed and arms hanging loosely.\nStanding behind the participant, identify a location approximately 2 cm above the sticker at the upper arm midpoint. Grasp a sizable fold of skin between the thumb and index finger about 1 - 2 cm into the skin. Roll the skin between fingers.\n\tNOTE: If the skinfold rolls easily between the fingers, it likely contains only skin and subcutaneous fat. If the skinfold does not roll easily or the grasp is particularly painful for the participant, it may contain muscle.\nShake the skin and/or roll fingers slowly to adjust the fold so that it contains only skin and subcutaneous fat, not muscle. Measure all subcutaneous fat above the muscle.\nHold the skinfold parallel to the arm. Place the skinfold caliper jaw perpendicular to the length of the fold and on either side of the marked midpoint.",
    "While holding the skinfold, completely release grip on the caliper lever. The caliper dial will continue to decrease as the skin is compressed by the caliper jaws. Hold the skin between the caliper jaws for 4 full s, after which time the skin should be fully compressed. After 4 s, record the measurement to the nearest two tenths of a centimeter.\n\tNOTE: If it is the correct amount of skin and subcutaneous tissue, the measurement (as read on the caliper dial) will decrease less rapidly or will not decrease at all after 4 s. If the measurement value on the caliper dial continues to decrease rapidly, the skinfold did not contain enough subcutaneous fat. Should this be the case, wait two minutes for the compressed skin to return to normal. Retry the measurement by grasping a thicker fold.\n10. Subscapular Skinfold Thickness\nInstruct the participant to stand upright, with shoulders relaxed and arms hanging loosely.\nStanding behind the participant, palpate the lowermost tip of the scapula. Locate the measurement site, two centimeters below the lower tip of the scapula, and place the calipers there.\nGrasp a sizable fold of skin between the thumb and index finger on a diagonal approximately 2 cm above and to the left of the measurement site. The skin should roll easily between fingers if it contains only skin and subcutaneous fat. Adjust the skinfold, so that the measurement contains only skin and subcutaneous fat.\nPlace the caliper jaws perpendicular to the measurement site, so that the measurement is taken parallel to the medial, inferior bone of the scapula. While holding the skinfold, completely release grip on the caliper lever. Record measurement to the nearest two tenths of a cm after 4 s.",
    "Ensure that the caliper dial remains consistent or decreases only minimally after 4 s. A rapidly decreasing measure on the caliper dial indicates that not enough subcutaneous fat has been obtained. If this is the case, wait 2 min for the compressed skin to return to normal. Retry the measurement by grasping a thicker fold.\n11. Quality Control (QC) Procedures\nRequire all staff members, including experienced and new research staff members, to measure volunteers during the QC sessions. Obtain an equal number of volunteers and staff members to maximize efficiency. If the study staff consists of 1-3 people, request at least four volunteers to ensure that reliability is properly assessed.\nDesignate one individual to be the gold standard rater for the QC session, either a quality rater from the research staff or an outside expert. Ensure that he/she has a proven record of reliability (both intra-rater reliability and reliability when compared to either a skilled auxologist or a gold standard, such as DXA).\nHave all study staff members conduct each manual anthropometric measure two or more times on each volunteer.\nCalculate intra-rater and inter-rater reliability after the QC session, using technical error of measurement (TEM).\n\tNOTE: TEM is used to assess the difference between two measurements that is attributable to measurement error12. TEM is the square root of measurement error variance: TEM= imgsrc://cloudfront.jove.com/files/ftp_upload/54895/54895eq1.jpg, where d2 is either the difference between repeated measurements by each research assistant (intra-rater reliability) or the difference between the sum of the anthropometry expert's replicates minus the sum of a research assistant's replicates (inter-rater reliability)12.",
    "Identify staff members whose inter- or intra-rater TEM values fall outside of the predetermined TEM range of acceptability14. Provide more training for staff members whose anthropometric measures fall outside of the acceptable range, prior to allowing field data collection from study participants.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}