{
  "id": 7110,
  "origin_website": "Bio",
  "title": "<em>In vitro</em> STING Activation with the cGAMP-STINGΔTM Signaling Complex",
  "procedures": [
    "STINGΔTM protein purificationThe DNA sequences (sources: Tmem173 NM_028261 Mouse Tagged ORF Clone, Origene Catalog number: MR227544, STING TMEM173 NM_198282 Human Tagged ORF Clone, Origene Catalog number: RC208418) of STINGΔTM protein (138 to 378 amino acids for mouse STING, 139 to 379 amino acids for human STING) were synthesized as gBlock DNA fragments (Integrated DNA Technologies) and cloned into the pSH200 expression vector (linearized via Nco I and Not I restriction enzymes) with a hexa-histidine-tag at the N-terminus (Figure 1). Plasmids for STINGΔTM mutants such as S365A were then generated via site-specific mutagenesis. DE3 Escherichia coli (E. coli) was used to express the proteins (mouse STINGΔTM in BL21 DE3, human STINGΔTM in Rosetta DE3). Lysogeny Broth (LB) containing the antibiotic ampicillin (100 mg/L) was used for bacteria culture, shaker conditions were 37 °C 220 rpm for growth and 18 °C 220 rpm for induction.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210201/20210201002253_3152.jpgFigure 1. Plasmid maps of (A) pSH200_His6_TEV_human STING (139-379aa) and (B) pSH200_His6_TEV_mouse STING (138-378aa) Day 1: Bacteria culture Pick DE3 E. coli from glycerol stock and culture in 50 ml of LB with ampicillin at 37 °C overnight.Day 2: Induction Transfer 50 ml of overnight culture into a flask containing 1 L LB with ampicillin and culture for approximately 2 h at 37 °C until the culture’s OD600 reaches 0.4. This OD value is critical for expressing human STINGΔTM in Rosetta DE3, as we have found that higher concentration can compromise protein purity; for the expression of mouse STINGΔTM in BL21 DE3, the OD600 can be in the range of 0.4-0.8 without compromising yield and purity.Cool the 1 L culture on ice and add 0.5 ml 1 M IPTG, then shake at 18 °C for approximately 20 h.Day 3: Protein purification After induction, centrifuge bacteria cultures at 6,000 × g for 20 min.",
    "Collect pellets and wash once with 30 ml PBS, then lyse in 20 ml protein binding buffer (Recipe 1) with 20 mg lysozyme, 200 μl Triton X-100, 1 mM PMSF (replenished every 30 min until Cobalt binding) and one tablet of cOmplete protease inhibitor cocktail tablets at room temperature for 20 min with gentle rotation at 20 rpm. After cells are lysed, the proteins should be kept ice-cold throughout the purification to minimize degradation (using cold protein binding buffer, protein elution buffer, and protein storage buffer).Cool cell lysate on ice water and sonicate with Misonix sonicator 3000 at 18 W (with 3-s on and 5-s off intervals to prevent heat-deactivation of the protein) for a total of 5 min.After sonication, centrifuge cell lysate at 14,000 × g at 4 °C for 30 min.Wash 0.5 ml HisPur Cobalt Resin with 5 ml protein binding buffer, then add to the bacteria supernatant separated from the centrifugation, along with 20 μl Triton X-114 (to eliminate endotoxin) for Cobalt-HisTag binding (4 °C for 1 h with gentle rotation at 20 rpm).After binding, carefully aspirate the supernatant and wash the Cobalt resin twice (4 °C for 30 min each time with gentle rotation at 20 rpm) with 5 ml protein binding buffer containing 5 μl Triton X-114.Transfer washed Cobalt resin into a Poly-Prep chromatography column with 5 ml of protein binding buffer. After all the protein binding buffer has drained out under gravity, add 1.5 ml protein elution buffer (Recipe 2) and collect the elution.Desalt the protein elution with ZebaTM Spin Desalting Columns (40k MWCO 10 ml). Add 10 ml of protein storage buffer (Recipe 3) into the column and allow it to completely drain under gravity (until no liquid remains above the resin surface). Add the 1.",
    "5 ml protein elution dropwise onto the middle of the resin and allow it to drain completely. Finally, collect five 1 ml fractions with protein storage buffer (add 1 ml of storage buffer then collect the flow-through as “Fraction 1”, then add another 1 ml of storage buffer and collect “Fraction 2” … all the way till “Fraction 5”). Combine Fractions 3 and 4 (which contains the majority of the desalted protein) for SDS-PAGE characterization and BCA quantification of protein concentration. Fractions 1, 2 may contain minimal amounts of protein, fraction 5 may contain protein with imidazole. The concentrations of each fraction may also be quantified through the BCA assay.For storage, 1 mM DTT was added and protein solution was aliquoted then stored in -80 °C. Protein function can be maintained for years under this storage condition, but can be compromised by multiple freeze-thaw cycles.Cell lines used for in vitro STING activationHuman embryonic kidney 293T (HEK293T) cells are deficient in cGAMP synthase (cGAS) and STING proteins, but express other essential proteins in downstream STING signaling, including TANK-binding kinase 1 (TBK1) and Interferon regulatory factor 3 (IRF3). Therefore, it provides a good model for studying the function of cGAMP-STINGΔTM without interactions with endogenous cGAMP or STING proteins (Figure 2). Additionally, it can be transfected to overexpress full-length mutant STING proteins (for example HAQ STING). To detect STING activation, we generated an interferon (IFN) reporter cell line by integrating an IFN-stimulated response element (ISRE) that drives luciferase expression through the stable transfection of pGL4.45[luc2p/ISRE/Hygro] plasmid selected in hygromycin (200 μg/ml). HEK293T cells are not capable of uptaking cGAMP-STINGΔTM complex directly, so commercial transfection reagents (we primarily used TransIT-X2, though others like Lipofectamine also work) are required in order to deliver cGAMP-STINGΔTM complex into the cells.",
    "HEK293T cells are cultured in Dulbecco’s modified Eagle’s medium (DMEM) with 10% fetal bovine serum (FBS) and 1% penicillin/streptomycin.  Mouse macrophage RAW264.7 and dendritic cell DC2.4 both express cGAS and STING, as well as TBK1 and IRF3 (Figure 2). They are also capable of internalizing cGAMP-STINGΔTM complex without the help of a transfection reagent. To detect STING activation, we can measure the cell secreted CXCL10 concentration in the medium with enzyme-linked immunosorbent assay (ELISA) or quantify the interferon-β mRNA level with qPCR. The aforementioned media contains no cells – medium that contains cells is denoted simply as ‘cells’. In addition, a reporter cell line derived from RAW264.7: RAW-BlueTM ISG cells can be used to study the kinetics of STING activation in vitro, and since the Secreted embryonic alkaline phosphatase (SEAP) – IFN assay only requires 20 μl of media, it can be performed at multiple time points post treatment. RAW264.7 cells are cultured in Dulbecco’s modified Eagle’s medium (DMEM) with 10% fetal bovine serum (FBS) and 1% penicillin/streptomycin. For SEAP-IFN assay, RAW-BlueTM ISG cells are cultured in DMEM with 10% heat-inactivated (56 °C, 30 min) FBS and 1% penicillin/streptomycin. DC2.4 cells are cultured in Roswell Park Memorial Institute (RPMI) medium with 10% FBS and 1% penicillin/streptomycin.  All cells are cultured in a 37 °C, 5% CO2 incubator, used at low passage number and tested negative for Mycoplasma contamination.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210201/20210201002309_9162.jpgFigure 2. Immunoblotting of endogenous expression of cGAS, STING, TBK1, and IRF3 proteins from HEK293T, RAW264.7, and DC2.4 cells IFN-luciferase assay with HEK293T-luc2p/ISRE/HygroDay 1: Preparation of Cells Seed HEK293T-luc2p/ISRE/Hygro cells into 96-well plates (clear bottom flat white plates for luciferase assay) at a density of 3 × 105 cells/ml in 100 μl media per well.Day 2: Cell treatment For each well, mix 1 μg of STINGΔTM protein with 0.",
    "025 μg cGAMP, then add 1 μl of TransIT-X2 in OptiMEM media to a total volume of 20 μl and incubate at room temperature for 15 min.Add the mixture to the cell medium without pipetting up and down. At least 3 replicates should be performed for each treatment.Incubate treated cells for 24 h.Day 3: Luminescence measurement Remove plates from the incubator, aspirate medium and add 25 μl lysis buffer (five-fold diluted with DI water from the provided 5× firefly luciferase lysis buffer) to each well, then incubate at room temperature for 15 min with orbital shaking.Add 50 μl of luciferase assay buffer to each well (with D-luciferin freshly added at final concentration of 0.2 mg/ml), read plate for bioluminescence on a Tecan microplate reader.mCXCL10 ELISA with RAW264.7 and DC2.4Day 1: Preparation of Cells Seed RAW264.7 or DC2.4 cells into 96-well plates at a density of 2 × 105 cells/ml in 100 μl medium per well.Day 2: Cell treatment For each well, mix 1 μg of STINGΔTM protein with 0.025 μg cGAMP and 1 μl of TransIT-X2 in 20 μl OptiMEM medium, then incubate at room temperature for 15 min. Alternatively, for vehicle-free treatment, mix 5 μg of STINGΔTM protein with 0.125 μg cGAMP in 20 μl OptiMEM medium and incubate at room temperature for 15 min.Add the mixture to the cell medium without pipetting up and down. At least 3 replicates should be performed for each treatment.Incubate treated cells for 48 h.Day 3: Preparation of ELISA plates ELISA was performed according to the manufacturer’s protocol: Mouse CXCL10 ELISA kit (R&D,  DY466  )Dilute CXCL-10 capture antibody in PBS to 2 μg/ml.Add 100 μl capture antibody solution to each well of the ELISA assay plates. Incubate at 4 °C overnight.",
    "Day 4: ELISA Aspirate each well of the ELISA assay plates, wash three times with Wash Buffer (PBS with 0.05% Tween 20).Add 300 μl Reagent Diluent (PBS with 1% BSA) to each well to block plates. Incubate at room temperature for 1 h with orbital shaking at 220 rpm.Aspirate plates and wash three times with Wash Buffer.Add 100 μl media of RAW264.7 or DC2.4 cells 48 h post-treatment without dilution. Incubate at room temperature for 2 h with orbital shaking at 220 rpm.Aspirate plates and wash three times with Wash Buffer.Add 100 μl of the Detection Antibody at 100 ng/ml (diluted in Reagent Diluent) to each well. Incubate at room temperature for 2 h with orbital shaking at 220 rpm.Aspirate plates and wash three times with Wash Buffer.Add 100 μl of the provided Streptavidin-HRP stock solution 40-fold diluted in Reagent Diluent to each well. Incubate at room temperature for 20 min avoiding light with orbital shaking at 220 rpm.Aspirate plates and wash three times with Wash Buffer.Add 100 μl of TMB Substrate Solution, freshly prepared from mixing equal volumes of TMB Substrate A with TMB Substrate B. Incubate at room temperature for 20 min with orbital shaking at 220 rpm, avoiding light.Add 50 μl of Stop Solution (2 N H2SO4) to each well. Gently tap the plate for mixing. Measure absorbance at 450 nm with a spectrophotometer/plate reader.Quantification of mIFN-β expression by qPCR with RAW264.7 and DC2.4Day 1: Preparation of Cells Seed RAW264.7 or DC2.4 cells into 24-well plates at a density of 3 × 105 cells/ml in 400 μl media per well.Day 2: Cell treatment For each well, mix 5 μg of STINGΔTM protein with 0.125 μg cGAMP and 5 μl of TransIT-X2 in 50 μl OptiMEM medium. Incubate at room temperature for 15 min.",
    "Alternatively, for vehicle-free treatment, mix 25 μg of STINGΔTM protein with 0.625 μg cGAMP in 50 μl OptiMEM medium and incubate at room temperature for 15 min.Add the mixture to the cell medium without pipetting up and down.Incubate treated cells for 24 h.Day 3: RNA extraction, reverse transcription and qPCR Perform RNA extraction following protocol provided by RNeasy Micro Kit:Prepare fresh lysis buffer by adding 10 μl β-mercaptoethanol into 1 ml RLT buffer.Aspirate medium, wash cells once with PBS, then add 350 μl lysis buffer per well. Incubate at room temperature for 5 min.Transfer the cell lysate into Eppendorf tubes, vortex for 20 s, then add 350 μl 70% ethanol, pipette up and down, transfer to a spin column provided in the kit, and centrifuge for 15 s at 8,000 × g.Discard flowthrough, add 350 μl RW1 buffer, and centrifuge for 15 s at 8,000 × g.Prepare DNase buffer from DNase supplied in lyophilized form in glass vials. Use syringe to inject 500 μl water into the glass vial to dissolve the powder. Then open the vial and add 10 μl DNase solution + 70 μl RDD buffer to the column. Incubate at room temperature for 15 min. Then add 350 μl RW1 buffer to the spin column, centrifuge for 15 s at 8,000 × g and discard the collection tube.Place the spin column in a new 2 ml collection tube as supplied. Add 500 μl RPE buffer, centrifuge for 15 s at 8,000 × g, and discard the flow through.Add 500 μl 80% ethanol to the spin column, centrifuge for 2 min at 8,000 × g and discard the collection tube.Place the spin column in another new 2 ml collection tube as supplied. Centrifuge at 8,000 × g for 5 min, discard the collection tube.",
    "Place the spin tube in a new 1.5 ml collection tube as supplied, add 14 μl RNase-free water to the center of the spin column, and centrifuge for 1 min at 8,000 × g to elute the RNA.Measure RNA concentration of each cell sample with Nanodrop spectrophotometer.Reverse transcription Dilute 1 μg extracted RNA with water to a total volume of 10 μl.For each RNA sample, prepare below mixture in a PCR tube:Diluted RNA           10 μl10× RT buffer            2 μldNTP                          0.8 μlRandom primer        2 μlRNase inhibitor      1 μlEnzyme                      1 μlWater                         3.2 μl Total volume             20 μlTreat the sample with thermal cycler with the program below:25 °C  10 min37°C    2 h85 °C   5 min4 °C     Infinite holdqPCR Dilute qPCR primers to 10 μM working concentration.Add 80 μl water to 20 μl reverse transcription product from the previous step (this 5-fold dilution is denoted as ‘template’ in the following step)Add the following to the qPCR 96-well plate for each reaction (add primer first, then add master mix):Template                        1 μl2x SYBR mixture          10 μlForward Primer           0.5 μlReverse Primer            0.5 μlWater                          8 μl Total volume               20 μlIFN-SEAP assay with RAW-Blue ISG cellsDay 1: Preparation of Cells Seed RAW264.7 or DC2.4 cells into 96-well plates at a density of 2 × 105 cells/ml in 100 μl media per well.Day 2: Cell treatment 2 h prior to treatment, remove the medium and replenish it with 100 μl DMEM with 10% heat-inactivated FBS and 1% penicillin/streptomycin pre-warmed to 37 °C in order to reduce the noise level in subsequent QUANTI-Blue assay.For each well, mix 1 μg of STINGΔTM protein with 0.025 μg cGAMP then 1 μl of TransIT-X2 in 20 μl OptiMEM medium, incubated at room temperature for 15 min. Alternatively, for vehicle-free treatment, mix 5 μg of STINGΔTM protein with 0.",
    "125 μg cGAMP in 20 μl OptiMEM medium and incubate at room temperature for 15 min.Add the mixture to the cell medium without pipetting up and down. At least 3 replicates should be performed for each treatment.Incubate treated cells in 37 °C incubator.Days 3-4: IFN-SEAP assay Take 20 μl of medium from treated cell wells and mix with 180 μl of QUANTI-Blue assay buffer in a separate 96-well plate. (Multiple time points between 12 to 48 h can be taken to study the kinetics.)Incubate the plate at 37 °C for 6 to 10 h until a visible color difference is observed (Figure 3).Determine the IFN-SEAP activity by measuring the absorbance at 635 nm with a spectrophotometer/plate reader.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210203/20210203184027_5739.jpgFigure 3. Example IFN-SEAP assay of mixing medium of treated RAW-Blue ISG cells with QUANTI-Blue assay buffer showing color differences due to STING signaling"
  ],
  "subjectAreas": [
    "Cell Biology",
    "Immunology",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}