{
  "id": 6370,
  "origin_website": "Bio",
  "title": "<em>In vitro</em> Generation of CRISPR-Cas9 Complexes with Covalently Bound Repair Templates for Genome Editing in Mammalian Cells",
  "procedures": [
    "Generation of Benzylguanine (BG)-coupled repair template oligosBG oligo coupling reactionNotes: Starting with a 5 nmol reaction results in approximately 3 nmol BG-coupled oligo after HPLC purification. For a transfection of HEK293T cells in a single 24-well 2.2 pmols are needed. The ratio 100:1 BG-GLA-NHS: amino-modified oligo has been optimized to achieve maximal coupling for 81 base long oligos. For shorter oligos, smaller ratios of BG-GLA-NHS: amino-modified oligo could be applied.  Dissolve 2 mg BG-GLA-NHS in 207 μl DMF. This gives a stock concentration of 20 mM. Syringe and needle are needed for the DMF, when this is packaged with a Sure/Seal. Before starting the experiment, prepare a BG-GLA-NHS working stock solution of 3.3 mM in DMF.Mix the following components in 1.5 ml Eppendorf tubes in a flow hood (see the following Table for amounts, this example is for 5 nmols reaction in the ratio 100:1 BG-GLA-NHS: amino-modified oligo): imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190101/20190101173508_8252.jpgMix the components properly by pipetting the up and down 5 times. Incubate the BG coupling reaction at 30 °C for 60 min. PAUSE POINT: BG coupling reactions can be stored at -20 °C when decided not to proceed with the protocol on the same day. Ethanol precipitation on BG coupling reactionsAdd the following components to the BG coupling reaction:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190101/20190101173539_4986.jpgVortex the BG coupling reaction briefly and store the Eppendorf tube(s) at -20 °C for 4-6 h or overnight (PAUSE POINT). Spin the Eppendorf tube(s) for 15 min at 13,500 x g at 4 °C.Remove the supernatant and add 500 μl 100% ethanol (-20 °C) to wash the pellet.Spin for 10 min at 13,500 x g at 4 °C.Remove the supernatant and add 500 μl 80% ethanol (-20 °C) to wash the pellet.Spin for 10 min at 13,500 x g at 4 °C.",
    "Remove the supernatant and air dry the pellet for 10-15 min.Dissolve the pellet in 200 µl RNase-free sterile water when proceeding with purification of the BG-coupled DNA on reversed phase HPLC. When using the Glen Gel-Pak cartridge purification method, dissolve the pellet in 1,500 µl RNase-free sterile water.Purification of BG-coupled DNA on reversed phase HPLCDilute reaction mixture to 200 µl with RNase-free ultrapure H2O.Determine the threshold for UV absorbance based fraction collection: Inject 10 µl of the crude reaction mixture and record chromatogram at 260 nm. Perform purification on an Agilent 1200 Series HPLC system (see item 26 in the equipment list) fitted with a Waters XBridge Oligonucleotide BEH C18 column (10 x 50 mm, 2.5 μm) at 65 °C using a gradient of 5%-25% methanol (Table 1) over 8 min with a flow rate of 5 ml min-1. HPLC eluent A is 0.1 M triethylammonium acetate, pH 8.0 (see Recipes).Table 1. Gradient for HPLC purificationimgsrc:https://en-cdn.bio-protocol.org/attached/image/20190101/20190101174026_2709.jpgEstimate a suitable threshold for bulk product purification according to the following empirical formula: A2 = (2 × V2 ×A1)/(3 × V1) where,V1 = volume of test injectionV2 = volume of main injectionA1 = absorbance threshold suitable for test injectionA2 = absorbance threshold suitable for main injectionBulk product purification: Inject residual 190 µl of the reaction mixture and collect the product containing fraction using the threshold estimated above.Remove solvent under vacuum from product containing fractions using a centrifugal concentrator, such as Genevac miVac Duo, at 35 °C and re-dissolve the purified product in 100 µl RNase-free ultrapure H2O. A representative HPLC chromatogram of the separation of BG-coupled DNA from unreacted 5’-amino DNA is shown in Figure 2.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190101/20190101173002_5914.jpgFigure 2. Representative chromatogram of the separation of unreacted DNA from 5’-BG-linked DNA. 5’-BG-DNA was purified using a gradient of 5%-25% methanol over 8 min.",
    "BG conjugation was performed under non-optimized conditions. Note: If the lab has no access to a suitable HPLC system, the ethanol precipitated BG-coupled oligos can also be further separated from unreacted BG by using a size-exclusion based desalting column, such as Glen Gel-Pak 1.0. For Glen Gel-Pak based purification follow the manufacturer’s protocol. In our hands, the combination of ethanol precipitation and Glen Gel-Pak based purification resulted in only a slightly lower coupling efficiency compared to the purification on reversed phase HPLC (Figure 3). In addition, when we functionally tested RNPD complexes purified with different methods in fluorescent HEK reporter cells, we found that the correction efficiencies were comparable (Figure 4).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190101/20190101173037_9546.jpgFigure 3. LC/MS analysis of BG-coupled and uncoupled DNA after different methods of purification. A. Uncoupled RFP DNA repair templates after HPLC purification (M = 20516.4). B. BG-coupled RFP repair templates after HPLC purification (M = 20882.8). C. BG-coupled repair templates after desalting on Glen Gel-Pak cartridge only. D. BG-coupled repair templates after ethanol precipitation only. E. BG-coupled repair templates after ethanol precipitation followed by Gel-Pak cartridge purification. BG conjugation was performed under optimized conditions for quantitative coupling. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190101/20190101173100_7485.jpgFigure 4. Correction efficiency of RNPD systems with differently purified BG-coupled DNA. Results show that repair oligos can also be purified from excess BG using Gel-Pak cartridge purification in combination with EtOH purification. FACS analysis of the fluorescent reporter cells transfected with different RNPD systems: Non-treated, no oligo, uncoupled RFP oligo after HPLC purification, coupled RFP oligo after HPLC purification, coupled RFP oligo after desalting on Glen Gel-Pak cartridge only, coupled RFP oligo after ethanol precipitation only, coupled RFP oligo after ethanol precipitation followed by Gel-Pak cartridge purification.Quality control of purified BG-coupled DNA by LC/MSMix 1 µl purified BG-DNA with 30 µl RNase-free ultrapure H2O in a 1.",
    "5 ml screw neck vial with a 200 µl insert.Inject 30 µl and record absorbance at 260 nM and total ion chromatogram (TIC). Perform LC/MS analysis on an Agilent 1200 Series HPLC fitted with a Waters Acquity UPLC OST C18 column (2.1 x 50 mm, 1.7 μm) connected to an Agilent 6130 Series Quadrupole (or equivalent) using a gradient of 5%-45% methanol (see Table 2) over 14 min with a flow rate of 0.3 ml min-1 at 65 °C. LC/MS eluent A is aqueous 0.4 M 1,1,1,3,3,3-hexafluoro-2-propanol containing 15 mM triethylamine. MS parameters (negative mode) are as follows:Mass range: m/z 500-3000Capillary voltage: 3500VDrying gas flow: 13.0 L/minDrying gas temperature: 350 °CNebulizer pressure: 45 psiTable 2. Gradient for LC/MS analysisimgsrc:https://en-cdn.bio-protocol.org/attached/image/20190101/20190101174147_9296.jpgProduction of Cas9-SNAP proteinExpression of SpCas9-SNAP in E. coli Transformation (Day 1)Add 1 ng of pNS20-SpCas9-SNAP plasmid (Addgene #113717) to 50 μl of chemically competent E. coli RosettaTM 2 (DE3) cells.Tap gently to mix and incubate tube on ice for 30 min.Incubate cells at 42 °C for 45 s in a heat block.Immediately place tube back on ice for 3 min.Add 350 µl of room temperature sterile LB medium. Incubate at 37 °C while shaking for 60 min.Plate 100 µl of the mixture on an LB agar plate containing 50 µg/ml of kanamycin and 33 µg/ml of chloramphenicol. Use sterile glass beads or a Drigalski spatula for spreading the cells.Incubate LB agar plate overnight at 37 °C.Preparation of media and stock solutions (Day 1)Prepare 8 x 750 ml LB media in 2 L Erlenmeyer flasks.Prepare 1 x 100 ml LB media in a 250 ml Erlenmeyer flask for pre-culture.Prepare antibiotic stock solutions.",
    "Start pre-culture (Day 2)Add 100 µl of 50 mg/ml kanamycin stock solution and 33 µl of 50 mg/ml chloramphenicol stock solution to 100 ml of sterile LB medium prepared on Day 1.Pick a single colony from the LB agar plate of E. coli Rosetta 2 (DE3) cells transformed with P120 on Day 1. For picking, you can use a sterile pipette tip or an autoclaved tooth pick.Incubate pre-culture at 37 °C overnight while shaking at 220 rpm. Start pre-culture in the late afternoon.Prepare 10 ml of IPTG stock solution.Expression of SpCas9-SNAP in E. coli RosettaTM 2 (DE3) (Day 3)Add 750 µl of 50 mg/ml kanamycin stock solution and 750 µl of 33 mg/ml chloramphenicol stock solution to each of the 750 ml LB media from Day 1.Inoculate each flask with 10 ml of the overnight preculture prepared on Day 2.Incubate the cultures at 37 °C while shaking at 110 rpm.Check the optical density at a wavelength of 600 nm (OD600) of the culture every hour until it reaches 0.6-0.8.Reduce the temperature in the incubator to 18 °C.Remove a 1 ml sample of the culture and centrifuge for 10 min at 17,000 x g. Discard the supernatant and resuspend the pellet in 1x Laemmli SDS loading buffer according to the measured OD600, by adding 10 µl of 1x Laemmli buffer per 0.1 absorbance (i.e., if OD600 is 0.7 add 70 µl of 1x Laemmli buffer). Store the sample at -20 °C for later analysis by SDS-PAGE (“uninduced culture” sample).To induce the expression of SpCas9-SNAP, add 150 µl of 1 M ITPG to each flask (0.2 mM final concentration).Incubate culture overnight at 18 °C (~16 h), shaking at 110 rpm.Prepare 100 ml of Lysis buffer, 1 L of Wash buffer and 1 L of Elution buffer.",
    "Harvesting of bacterial culture (Day 4)Before harvesting the cells, remove a 200 µl sample from overnight culture for SDS-PAGE analysis (“induced culture” sample), add 800 µl LB medium and determine the OD600. Centrifuge for 10 min at 17,000 x g. Discard the supernatant and resuspend the pellet according to the measured OD600 (same procedure like with the uninduced sample as described in Step B1d vi). Store at -20 °C.Transfer overnight cultures from Day 3 in 1 L centrifuge bottles. Pellet the cells by centrifuging at 5,000 x g at 4 °C for 20 min.Discard supernatant.Cell pellets can be stored at -20 °C (pellets can be also frozen and stored after resuspension in Lysis buffer).Prepare buffers for Ion exchange and Size exclusion chromatography (500 ml of Heparin buffer A, 500 ml of Heparin buffer B, 1 L of SEC buffer).SpCas9-SNAP purificationPurification of SpCas9-SNAP: Part I (Day 4)If cell pellets were frozen after harvesting, thaw the cell pellets on ice. Resuspend pellets in a total volume of 40 ml of Lysis buffer (~2.5-5 ml Lysis buffer per gram of cell pellet). To lyse the cells use a sonicator with the following settings: 6 min total time, 1 s on, 2 s off, 20% amplitude. The cell suspension noticeably changes color and viscosity during lysis. Transfer the lysed cells into Oak Ridge centrifuge tubes and centrifuge for 45 min at 30,000 x g at 4 °C.Remove a 5 µl sample of the cleared lysate for SDS-PAGE analysis (“clarified lysate” sample, Figure 8). Mix with 20 µl 1x Laemmli buffer. Store at -20 °C.Use a peristaltic pump to wash a 10-ml self-packed Ni-NTA Superflow column (or two 5 ml QIAGEN Ni-NTA Superflow prepacked cartridges connected in series) with 5 column volumes of water at a flow rate of 3 ml/min.",
    "Wash the column with another 5 column volumes of Wash buffer.Load the cleared lysate (~50 ml) onto the equilibrated column with a flow rate of 3 ml/min.Note: There might be still unbound SpCas9-SNAP protein left in the flow-through. It can be loaded again on the Ni-NTA column for a second round of purification. Equilibrate the Ni-NTA column in Wash buffer before reloading the flow-through. Remove a 5 µl sample of the flow-through for SDS-PAGE analysis (“flow-through” sample, Figure 8) and mix it with 20 µl 1x Laemmli buffer. Store at -20 °C.Wash the pumps of the Äkta FPLC system with Wash buffer (pump A) and Elution buffer (pump B) and flush the flow-path of the system with Wash buffer until the absorbance signal (280 nm wavelength, A280) in the UV detector reaches a stable baseline. Connect the loaded Ni-NTA column to the Äkta FPLC and wash the column with Wash buffer with a flow rate of 3 ml/min until A280 reaches baseline level (Figure 5).Elute the protein with 50% Elution buffer and collect in 1.8 ml fractions in a 96-well 2 ml deep-well block, or in tubes with appropriate capacity (Figure 5).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190101/20190101173129_1213.jpgFigure 5. Representative chromatogram of Cas9 SNAP purified by HisTrap HP (10 ml) affinity purification. Blue line denotes absorbance signal at 280 nm (A280), green line denotes the concentration of the Elution buffer, and the fractions are indicated with red tick marks. The blue shaded area indicates fractions collected for dialysis and subsequent purification steps.Pool the peak fractions in a clean 50 ml tube and determine the concentration by measuring the absorbance at 280 nm using a NanoDrop UV-VIS spectrophotometer. The extinction coefficient of His6-MBP-TEV-SpCas9-SNAP is 1416140 M-1 cm-1.",
    "Remove a 5 µl sample of the pooled fractions for SDS-PAGE analysis (“Ni-NTA elution” sample, Figure 8) and mix it with 20 µl 1x Laemmli buffer. Store at -20 °C.Add 1 mg of recombinant, His-tagged TEV per 50 mg of Cas9 SNAP (as determined from absorbance measurement).Incubate overnight at 4 °C.Purification of Cas9 SNAP: Part II (Day 5)Remove a 5 µl sample of the overnight TEV cleavage reaction for SDS-PAGE analysis (“TEV cleavage” sample, Figure 8) and mix it with 20 µl 1x Laemmli buffer. Store at -20 °C.Heat the collected samples for SDS-PAGE analysis for 5 min at 95 °C.Load 3 µl on a 12% SDS PAGE gel with 15 wells to check if cleavage is complete. Connect a 5 ml Heparin FF column to a peristaltic pump and wash with at least 5 column volumes of water at a flow rate of 3 ml/min.Equilibrate the column with at least 5 column volumes of Heparin buffer A.Load the overnight cleavage reaction onto the column and collect the flow-through in a clean 50 ml tube.Remove a 5 µl sample of the flow-through for SDS-PAGE analysis (“Heparin flow-through” sample, Figure 8) and mix it with 20 µl 1x Laemmli buffer. Store at -20 °C.Wash the pumps of the Äkta FPLC with Heparin buffer A and Heparin buffer B and flush the flow path of the system with Heparin buffer A until it reaches a stable baseline at the absorbance of 280 nm.Connect the loaded Heparin FF column to the Äkta FPLC system and wash the column with Heparin buffer A at a flow rate of 3 ml/min until the A280 signal reaches a steady baseline (Figure 6).Elute with a linear gradient to 50% Heparin buffer B over 20 column volumes (100 ml).Collect eluted protein in 1.",
    "8 ml fractions in a 96-well 2 ml deep-well block, or in tubes with appropriate capacity (Figure 6).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190101/20190101173146_9866.jpgFigure 6. Representative chromatogram of Cas9 SNAP purified by Heparin FF (5 ml) affinity purification. Blue line denotes absorbance signal at 280 nm (A280), red line denotes absorbance signal at 260 nm (A260), green line denotes concentration of the Elution Buffer. Fractions are indicated with red tick marks. The blue shaded area indicates fractions collected for subsequent purification steps.Pool the peak fractions containing SpCas9-SNAP (Figure 6).Remove a 20 µl sample of the pooled fractions for SDS-PAGE analysis (“Heparin peak” sample, Figure 8) and mix it with 5 µl 5x Laemmli buffer. Store at -20 °C.Transfer the pooled fractions to an Amicon Ultra-15 Centrifugal Filter Unit (MWCO of 100 kDa). Centrifuge the sample at 4,500 x g at 4 °C and concentrate to a final volume of < 5 ml. Mix the concentrate periodically throughout the concentration procedure by gently pipetting the solution up and down.Transfer concentrated sample into a 15 ml tube and centrifuge for 5 min at 4,500 x g at 4 °C to remove any precipitated material.In the meantime, equilibrate a HiLoad 16/600 Superdex 200 pg with 1 column volume of SEC buffer on the Äkta FPLC at a flow rate of 1 ml/min.Prepare a 5 ml injection loop by washing with 15 ml of SEC buffer on the Äkta FPLC. Flush the injection port with 10 ml of SEC buffer using a 10 ml syringe.Load the concentrated sample on the HiLoad 16/600 Superdex 200 pg via the 5 ml injection loop at a flow rate of 1 ml/min. Elute with SEC buffer at a flow rate of 1 ml/min (Figure 7).Collect elution in 1.",
    "8 ml fractions in a 96-well 2 ml deep-well block, or in tubes with appropriate capacity (Figure 7).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190101/20190101173206_3193.jpgFigure 7. Representative chromatogram of Cas9 SNAP resolved on a HiLoad 16/600 Superdex 200 pg size-exclusion column. Blue line denotes absorbance signal at 280 nm (A280), red line denotes absorbance signal at 260 nm (A260), and fractions are indicated with red tick marks. The blue shaded area indicates fractions pooled for final concentration.Pool the peak fractions and determine the concentration by measuring the absorbance at 280 nm using the NanoDrop UV-VIS spectrophotometer. Remove a 20 µl sample of the pooled fractions for SDS-PAGE analysis (“SEC peak” sample, Figure 8) and mix it with 5 µl 5x Laemmli Buffer. Store at -20 °C.Concentrate the SpCas9-SNAP protein to the required concentration (~1 mg/ml) by using an Amicon Ultra-15 Centrifugal Filter Unit (MWCO of 100 kDa). SpCas9-SNAP can be concentrated up to 10-20 mg/ml as long as the SEC buffer contains at least 500 mM KCl.Prepare 50 µl aliquots of purified SpCas9-SNAP protein, freeze in liquid nitrogen and store at -80 °C.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190101/20190101173227_3028.jpgFigure 8. Representative analysis of SpCas9-SNAP fractions on a 10% SDS-PAGE gel. M: PageRuler Plus Prestained Protein Ladder. Marker band sizes are indicated in kDa. The gel is stained with Coomassie Brilliant Blue.Production of sgRNAGuide RNAs can be produced via in vitro transcription from a template DNA (see protocol below), or purchased from various sources (e.g., Integrated DNA Technologies).sgRNA productionOrder IVT primers that generate the DNA template when annealed:sgRNA specific forward primer with T7 promoter:GAAATTAATACGACTCACTATA(GGN18-20)GTTTTAGAGCTAGAAATAGCNote: An example from the Savić et al. publication–sgRNASpCas9 (mutRFP) for: GAAATTAATACGACTCACTATAGGTGGCTACCAGCTTCATGCTGTTTTAGAGCTAGAAATAGC (Savić et al., 2018). SpCas9 common reverse primer containing the sequence of the sgRNA scaffold: AAAAGCACCGACTCGGTGCCACTTTTTCAAGTTGATAACGGACTAGCCTTATTTTAACTTGCTATTTCTAGCTCTAAAACPerform the PCR with Phusion polymerase using a Thermal cyclerReaction setup:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190101/20190101192537_4201.jpgThermocycling conditions:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190101/20190101174515_0683.",
    "jpgPurify the DNA template using QIAquick purification kit, according to the manufacturer’s protocol and elute in 50 µl DEPC-treated water. Measure the eluted DNA concentration on a NanoDrop spectrophotometer.Run 500 ng of the purified PCR products mixed with 5 volumes of 6x loading dye on a 2% agarose gel containing 1x GelRed Nucleic Acid Stain. Separate bands by electrophoresis in 1x TBE buffer at 100 V for 1 h using Horizontal Electrophoresis System. Image using a Gel imaging System to confirm the concentration and the correct amplicon size.Important: From here on, work RNase free! In vitro transcribe the template DNA using the T7 RNA polymerase to obtain the guide RNA.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190101/20190101174548_8586.jpgIncubate reaction overnight at 37 °C in the Thermal Cycler.sgRNA purificationPurify the sgRNA by DNase I treatment followed by ethanol precipitation: Add 1 µl DNase I and incubate for 15 min at 37 °C in the Thermal Cycler.Add DEPC-treated water up to 100 µl.Add 10 µl 5 M Ammonium acetate and 330 µl 100% ethanol and incubate overnight at -20 °C.Add 1 µl Glycogen (20 µg), vortex and centrifuge at 17,000 x g for 15 min at 4 °C using Microlitre Centrifuge.Wash the pellet with 500 µl 75% ethanol and centrifuge at 17,000 x g for 15 min at 4 °C using Microlitre Centrifuge.Dissolve the pellet in 20-30 µl DEPC-treated water.Purify the sgRNAs further using RNA Clean & Concentrators, according to the manufacturer’s protocol. Measure the eluted RNA concentration on NanoDrop spectrophotometer. Store the RNA at -80 °C.sgRNA control on a denaturing MOPS gelControl the sgRNA on a denaturing 2% MOPS gel:Prepare the gelHeat 2 g agarose in 80 ml double distilled and deionized water using a microwave oven until dissolved, and then cool to 60 °C. Add 10 ml 10x MOPS running buffer, and 10 ml 37% formaldehyde (12.",
    "3 M), pre-warmed to 60 °C using a water bath. Mix and pour the gel using a comb that will form wells large enough to accommodate at least 25 µl. Let the gel settle for 30 min. Assemble the gel in the tank, and add enough 1x MOPS running buffer to cover the gel by a few millimeters. Remove the comb.Note: Prewash the chamber, tray, and comb with soapy water/tween/SDS, wipe with RNase AWAY, and remove the leftover RNase AWAY with a paper tissue. Use autoclaved or UV-treated Erlenmeyer flask. Warning: Formaldehyde is toxic through skin contact and inhalation of vapors. Manipulations involving formaldehyde should be done in a chemical fume hood. Prepare RNA samples and ladder1)Add 3 volumes of Formaldehyde Load Dye to 1 µg (500 ng/U) sgRNA. Adjust total volume to 10 µl with DEPC-treated water. Use 2 µg of Low Range ssRNA Ladder. 2)Heat denature samples at 65 °C for 15 min using a Thermoshaker.3)Briefly spin down samples in a microcentrifuge and place on ice.RNA electrophoresisLoad the gel and run at 5-6 V/cm (approx. 80 V) until the bromophenol blue (the faster-migrating dye) has migrated at least 2-3 cm into the gel, then raise to 120 V and let run as far as 2/3 the length of the gel.Stain the RNA gel using Sybr Gold1)Dissolve 15 µl of Sybr Gold (10,000x) in 150 ml TE buffer pH 8.0.2)Incubate for 45 min, shaking at room temperature. Wash 1 x 5 min in TE buffer followed by 1 x 5-min wash in double distilled and deionized water.Note: Protect the gel from the light during incubation. Image on ChemiDoc imaging System to confirm the concentration and the RNA quality.",
    "Note: An example of denaturing RNA gel with in vitro transcribed sgRNAs can be found in Figure 3–figure supplement 1 g from Savić et al., 2018.Cell culturingCulture HEK293T lineNotes: Change cell culture medium (for HEK293T medium, see Recipes) every other day. Passage cells before they become fully confluent, approximately every 4 days.  Cells grow at 37 °C in a humidified 5% CO2 environment. Aspirate the medium from dish.Add 1 ml of TrypLE Express per 10 cm (for a 10 cm dish).Place the plate in the 37 °C incubator for 5 min.Once the cells detach, add 9 ml of DMEM medium and transfer the cells to a 15 ml conical tube.Centrifuge at 250 x g for 5 min at 4 °C.Aspirate the medium from the conical tube.Add 10 ml of fresh DMEM medium and split cells at a 1:10-1:15 dilution factor on to a new 10 cm dish and add enough additional medium to each plate for 10 ml total.Culture K562 line (suspension)Notes: Change cell culture medium (for K562 medium, see Recipes) every other day. Passage cells before they become fully confluent, approximately every 4 days.  Cells grow at 37 °C in a humidified 5% CO2 environment.Collect the K562 cells from the dish in a 15 ml conical tube.Centrifuge at 250 x g for 5 min at 4 °C.Aspirate the medium from the tube.Add 10 ml of fresh RPMI medium and split cells at a 1:5-1:10 dilution factor on to a new 10 cm dish and add enough additional medium to each plate for 10 ml total.Culture mouse embryonic stem cell lineNotes:Change cell culture medium (for mESC proliferative growth medium, see Recipes) daily. Passage cells every 2-3 days depending upon the growth rate of cells. The optimal condition is to maintain cells at approximately 80% confluency on Day 2 or 3.",
    "Cells grow at 37 °C in a humidified 8% CO2 environment. mECS grow on 0.2% gelatin-coated flasks/plates in absence of feeder cells.Aspirate the medium from the T75 flask.Rinse the T75 flask or dish with PBS pH 7.4 (1x) without CaCl2 and MgCl2.Add 1 ml 0.05 % Trypsin containing EDTA to the flask.Place the flask in the 37 °C incubator for 5 min.Once cells begin to dissociate from the flask, transfer the detached cell aggregates to a 15 ml conical tube containing 5 ml mESC DMEM growth medium.Rinse the flask with an additional 3 ml of DMEM growth medium to collect any remaining aggregates. Add the rinse to the conical tube that contains the cells.Centrifuge the conical tube at 250 x g for 2 min at room temperature. Aspirate the medium from the conical tube and add the desired amount of growth medium. Split the cells at a 1:4 to 1:10 dilution factor into a new flask or dish and add enough additional growth medium to each flask or plate.Covalent binding of Cas9-SNAP protein and BG-coupled oligonucleotideComplex the BG-coupled repair oligo templates with Cas9-SNAP proteins directly before performing the transfection. Thaw the SpCas9-SNAP protein on wet ice.Note: Very small samples such as 10 μl aliquots can be thawed by holding the tube in your hand. Once thawed, gently mix the sample using a micropipettor with a polypropylene tip to make sure the solution is homogeneous. Be careful not to introduce bubbles into the solution. When necessary, dilute the protein in Protein buffer. Mix 2.2 pmols BG-coupled oligos together with 2.2 pmols SpCas9-SNAP protein in 1.5 ml Safe-Lock microcentrifuge tubes.Mix by flicking the microcentrifuge tubes.Briefly spin down samples in a microcentrifuge.Incubate for 60 min at 30 °C using Thermoshaker.Briefly spin down samples in a microcentrifuge.",
    "Place the sample on ice until used for cell transfection.Note: An example of silver-stained SDS-PAGE gels showing band shifts that confirm covalent linkage of Cas9-SNAP proteins to BG-coupled oligos can be found in Figures 3e and 3f from Savić et al., 2018.Transfecting cell lines with RNPD complexesSeeding HEK293T cellsOne day prior to transfection (24 h): Seed HEK293T cells at a density of 120,000-140,000 cells per well in 24-well plates. Aspirate the medium from dish.Add 1 ml of TrypLE Express (for a 10 cm dish).Place in a 37 °C incubator with 5% CO2 environment for 5 min.Once the cells detach, add 9 ml of DMEM medium and transfer the cells to a 15 ml conical tube.Pipette up and down several times with 5 ml Serological pipette to ensure single cell suspension.Perform a cell count using a hemocytometer or automated cell counter.Dilute the cells with DMEM medium at the desired final concentration of 120,000-140,000 cells/well.Seeding mES cellsOne day prior to transfection (24 h): Seed mES cells at a density of 180,000-190,000 cells per well in 6-well plates.Aspirate the medium from a flask or dish.Rinse the T75 flask or dish with PBS pH 7.4 (1x) without CaCl2 and MgCl2.Add 1 ml 0.05% Trypsin containing EDTA to the flask or dish.Place the flask in the 37 °C incubator with 5% CO2 environment for 5 min.Once cells begin to dissociate from the flask, transfer the detached cell aggregates to a 15 ml conical tube containing 5 ml mESC growth medium.Rinse the flask with an additional 3 ml of growth medium to collect any remaining aggregates. Add the rinse to the conical tube containing the cells.Perform cell count using a hemocytometer or automated cell counter.Dilute the cells with DMEM growth medium without PenStrep at the desired final concentration of 180,000-190,000 cells/well.",
    "Seeding K562 cellsOn the day of transfection: K562 cells (suspension culture) can be distributed 6 h prior to transfection in 24-well plates at a density of 220,000-240,000 cells per well.Collect the K562 cells from the dish in a 15 ml conical tube.Centrifuge at 250 x g for 5 min at 4 °C.Aspirate the medium from the tube.Add fresh RPMI medium and pipette up and down several times with 5 ml Serological pipette to ensure a homogeneous cell suspension.Perform cell count using a hemocytometer or automated cell counter. Dilute the cells with RPMI medium at the desired final concentration of 120,000-140,000 cells/well.Preparation of transfection reactionsPrepare transfection reactions by mixing following components in a laminar flow hood (see Table 3 for amounts, this example is for 24-well plate format):Table 3. Transfection formatimgsrc:https://en-cdn.bio-protocol.org/attached/image/20190101/20190101174738_6461.jpg1.5 ml Eppendorf Tube A: Add selected RNP complex (2.2 pmols), and sgRNA (3.88 pmols) to Opti-MEM. Total volume in reaction Tube A should be 50 µl after adding components. 1.5 ml Eppendorf Tube B: Add 3 µl Lipofectamine 2000 to the 47 µl Opti-MEM. Total volume in the reaction Tube B should be 50 µl. Briefly vortex Tube A and B, and spin down samples in a microcentrifuge. Incubate for 5 min at room temperature.Add the content of Eppendorf Tube B to Eppendorf Tube A, briefly vortex and spin the content down in a microcentrifuge.Incubate the complexes at room temperature for 15 min, to allow lipid particle formation.Add the transfection mixture to the desired wells, by slowly dropping the mixture on the medium. Gently mix the media via back and forth motion. Note: The medium of the mES transfected cells should be replaced to mES culture medium with Pen-Strep 8 h post-transfection. Incubate at 37 °C with 5% CO2 environment for 24 h.",
    "Next day (post-transfection), HEK293T and K562 cells can be transferred to 10 cm dish for further expansion of the transfected cells. The mES cells can be collected after 48 h post transfection for extracting genomic DNA.At Day 5 post-transfection, HEK293T and K562 cells can be analyzed by different methods. When a reporter-line is used, the correction and indel formation events can be visualized by fluorescence imaging and quantified by FACS. In case no reporter line used, cells can be collected for DNA extraction and analysis via next-generation sequencing (NGS). Correction efficiency analysisThe protocols described here allow to assess the correction rates of the RNPD system in the cell line of interest. The protocols are designed for HEK293T cells, and would have to be adapted for the cell line of interest.Microscopy imagingAs mentioned above, when a fluorescent reporter cell line is used, correction and indel formation events can be visualized by either fluorescence imaging or flow cytometry. One day post-transfection, the HEK reporter cell line can be transferred to Poly-L-lysine coated glass chamber slides and can be analyzed 5-7 days post-transfection.Conformation and visualization by microscope imaging can be achieved as followed:A few hours before transferring the transfected cells, coat the glass chamber slides with Poly-L-lysine. Pour a few hundred microliters of 0.2% Poly-L-lysine solution on the bottom of the chamber slides, distribute homogeneously (the entire surface must be covered, e.g., 150 µl for 8-well chamber slide), incubate for minimum 1 h at 37 °C and finally remove the leftover Poly-L-lysine solution that is on the chamber slides. Note: Store the chamber slides until use in a 37 °C incubator when using them on the same day or else store the chamber slides at 4 °C.  Aspirate the medium of the HEK293T cells that got transfected the day before.",
    "Add 100 µl of TrypLE Express to each well (in case of 24-well plate).Pipette up and down several times with a P200 pipet to ensure single cell suspension.Add 240 µl pre-warmed DMEM medium (HEK293T cells) to the coated chamber slides. Take 10 µl of the trypsinized HEK293T suspension and add this to the coated chamber slide. Let the HEK293T cells grow until they reach a confluency of 80%-90%. This will be probably around Days 5-7 post-transfection.Prior to the image session, add Hoechst 33342 to the cell culture medium to a final concentration of 0.1 µg/ml. Incubate the cells for 10 min at 37 °C with 5% CO2 environment.Start imaging session. Flow cytometry analysisDepending on the type of experiment, the best time point for flow cytometry analysis should be determined by the experimenter. In this protocol, we analyze HEK293T reporter cells at 5 days post-transfection. Important note when performing flow cytometry: Make use of proper controls for setting up your gating.Quantification of correction and indel formation events by flow cytometry analysis can be achieved as followed:Aspirate the medium of dishes. Add 1 ml of TrypLE Express per 10 cm dish.Incubate for 3 min at 37 °C.Once the cells detach, add 4 ml of DMEM medium and transfer the cells to a 15 ml conical tube.Centrifuge at 250 x g for 5 min at 4 °C.Aspirate the supernatant. Add 1 ml FACS buffer with or without Sytox Red to the cell pellet and pipette up and down several times with P1000 pipet to ensure single cell suspension. Sytox Red can be added for excluding dead cells from the populations.Transfer the cell suspension to 5 ml test tubes with cell strainer cap. Place samples on ice until starting with the flow cytometry analysis on the BD LSR Fortessa cell analyzer.",
    "Next Generation Sequencing (NGS)For the library preparation, collected cell pellets should be extracted by using for example a DNeasy Blood and Tissue kit, according to the manufacturer’s instructions. Preparation of the library:PCR to amplify the target regionFor each 50 µl reaction mix, combine the following in 0.2 ml tubes:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190101/20190101175457_1452.jpgGently mix the reaction and briefly spin down content in a microcentrifuge.PCR cycling conditions used in this protocol:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190101/20190101175841_6246.jpgNote: Annealing temperatures should be optimized for each primer set to ensure that a single amplicon will be produced.Run 10 µl of the PCR products on agarose gel (2%) to confirm correct amplicon size.Purify PCR amplicons by solid phase reversible immobilization (SPRI) bead cleanup using Agencourt AMPure XP reagent, according to the manufacturer’s protocol. Run 5 µl of the purified samples on agarose gel (2%) to confirm the purification step succeeded.Generation of pooled sequencing librariesFor generating the libraries, order Index Adaptor Sequences for the second amplification step. In this protocol, TruSeq Index Adaptor Sequences were used from Illumina (see Publication Savić et al., 2018).For each 50 µl reaction mix, combine the following in 0.2 ml tubes:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190101/20190101175924_4597.jpgGently mix the reaction and briefly spin down content in a microcentrifuge.PCR cycling conditions used were as follows in this protocol:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190101/20190101175958_8235.jpgPurify the PCR products (PCR amplicons with adaptors) by solid phase reversible immobilization (SPRI) bead cleanup using Agencourt AMPure XP reagent, according to the manufacturer’s protocol.Run 5 µl of the purified samples on an agarose gel (2%) to confirm the purification step succeeded and that the adaptors are added. Additional tip: run one PCR product from the first PCR along the PCR samples of the second PCR on the agarose gel. This will show a clear difference when the Index Adapters are successfully added to the PCR amplicons.",
    "Note: Before sequencing the libraries, it is recommended to perform a quality check on, e.g., Agilent 2200 TapeStation system."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}