{
  "id": 10309,
  "origin_website": "Jove",
  "title": "Near Simultaneous Laser Scanning Confocal and Atomic Force Microscopy (Conpokal) on Live Cells",
  "procedures": [
    "1. Preparation of instruments, culture media, dishes\nTurn on the power sources for both the confocal microscope and the atomic force microscope, as well as any other associated instruments or devices utilized during Conpokal. Allow enough time for the instruments to thermally equilibrate and stabilize before beginning measurements. Typically, 1 h is sufficient.\nPrepare one clean, system-approved, glass-bottomed Petri dish and fill half full, but no more than two-thirds full, with phosphate buffered saline (PBS), or similar clear liquid. This dish (referred to as the “calibration dish”) is separate from the sample dishes and will be used to locate and calibrate the atomic force microscope (AFM) cantilever.\n\tNOTE: It is important that the liquid is clear and has low autofluorescence to prevent any interference with the fluorescence spectra. PBS is recommended because it mimics the biological environment.\nPrepare experimental sample dishes such that the associated liquid has filled the dish at least half full. If the sample is fluorescent, ensure it is covered or in a dark place until needed. Clean the bottom of all glass dishes using lens cleaner and lens wipes.\nCreate data storage folders for the confocal and AFM on the computer(s) hard drive(s).\n2. Selection of cells or microorganisms\nTo create bacteria stock solution, inoculate Streptococcus mutans bacteria, using an inoculation loop, in 15 mL of Todd Hewitt Yeast (THY) overnight (for exponential phase) in a 5% CO2 incubator.\n1 h before the overnight incubation is complete, coat experimental sample dishes with 1 mL of poly-l-lysine solution or enough to cover the glass portion of the glass-bottomed dish and leave in the biosafety cabinet for 1 h. After setting, aspirate poly-l-lysine solution and rinse the dishes 3x with PBS.",
    "After 18 – 24 h of bacterial incubation, inoculate THY with 1 mL of bacterial suspension until an optical density of 0.6 – 0.7 is achieved (typical values for inoculation are 3 mL of THY with 1 mL of bacterial suspension per dish). Add 1 mL of new bacteria solution to each poly-l-lysine-coated dish and incubate for 1 h. During the last 10 min, add 1 mL of green fluorescent membrane stain (concentration of 1 µM) to each dish.\nRinse each dish 3x with PBS. Gently fix the bacteria with about 1 mL of 4% paraformaldehyde solution for 15 min at room temperature inside a biosafety cabinet. Rinse each dish 3x with PBS after fixation.\nStore the Human Embryonic Kidney (HEK) 293 cells in liquid nitrogen. Perform fast thawing at 37 ˚C water bath before plating.\nAdd 1 mL of basement membrane matrix solution in cell culture media to each cell sample dish and incubate (5% CO2) at 37 ˚C for 1 h. Aspirate the solution and wash the dishes with cell culture media. Plate the required number of HEK 293 cells (e.g., 100,000 cells per 35 mm dish) and add 2 mL of cell culture media. Then, incubate (5% CO2) the cells at 37 ˚C for 48 h.\nAfter 48 h, add 2 µL of a fluorescent microtubule cytoskeleton dye (concentration of 1x) to each cell sample dish and incubate for 30 min. Aspirate the solution containing the dye, wash the cells 3x with PBS, and add 2 mL of cell culture media.\nAdd 1 µL of plasma membrane dye (concentration of 10 µM) to the sample dishes and incubate for 30 minutes. Wash the solution containing the dye 3x with PBS and add 2 mL of cell culture media.",
    "Counterstain the nucleus by adding 1 µL of a nucleic acid dye (concentration of 10 µM) solution to the sample dishes and incubate for 30 min. Wash the solution containing the dye 3x with PBS and add 2 mL of culture media.\n3. AFM procedure\nOpen the atomic force microscope (AFM) operating software by clicking on the software icon on the computer.\nRotate to or insert a low magnification air objective (recommended 10x or 20x). A long working distance of 5 mm or more is beneficial during tip lowering and calibration.\nMount the chosen cell sample stage if not already installed. For live samples, use a dish heater to keep the sample at desired temperature.\nLoad the clean, system-approved Petri dish filled half full of PBS (prepared in step 1.2) or similar clear liquid (calibration dish). If sample stage has built-in clasps, use these, otherwise, use vacuum grease to stabilize the sample.\nSelect an appropriate AFM cantilever for the desired data collection and install it following the steps below.\n\t\nUsing gloves, mount the AFM chip into the glass block by using the AFM chip mounting stage, tweezers, and a small screwdriver. Carefully place the AFM chip onto the glass block and orient it such that it is centered. The cantilever, plus a very small portion of the AFM chip, should be in the visible, non-opaque portion of the mounting block.\nSecure the chip with the screwdriver by tightening the screw until the chip is snug against the glass block. Check that the AFM cantilever is oriented correctly using a stereo microscope or a handheld spyglass. Adjust as needed. Once properly oriented, place the glass block into the AFM head in the proper orientation and lock it in place.",
    "NOTE: The orientation of the AFM chip within the glass block is important so that the system lasers aim at the backside of the cantilever and reflect onto the photodetector correctly. Be careful not to overtighten the screws during the placement as this procedure could cause the AFM chip, cantilever, or tip to break.\nUsing the brightfield option of the confocal microscope, locate the bottom of the calibration dish by using the focus knob. Take note of this z height as the value where the bottom of the dish is located with respect to the microscope objective.\nUsing the AFM system’s motor control panel on the computer that operates the z stepper motors, move the AFM cantilever away from the sample upwards 2000 µm.\nUsing both hands, gently place the AFM head with the AFM chip onto the sample stage making sure that each of the vertical points on the AFM head are firmly set in their designated grooves on the AFM stage. Once the AFM head is in place, visually see how close the cantilever holder is to the dish. If it appears to be too close, such that the AFM head is in contact or within 1 mm of the top of the sample dish, back it out using the z stepper motors before lowering the AFM tip towards the sample.\nUsing brightfield illumination, slowly lower the AFM chip to the bottom of the glass dish using the z stepper motor control panel on the AFM software. Locate the manual micrometers that control x-y or in-plane motion of the AFM head on the instrument platform. Adjust the position of the AFM cantilever within the field of view by correcting the AFM head as the cantilever comes into view.",
    "Since the location with respect to the bottom of the dish is unknown at this time, lower with steps of 100 – 200 µm to avoid crashing the AFM tip into the Petri dish. Typically, the tip needs to be lowered 800 – 2000 µm. As the tip is lowered, watch for a shadow to appear on the microscope software view, which indicates the AFM tip is getting closer to the bottom of the dish.\nDecrease increments to 20 – 50 µm. Be sure to adjust the look up tables (LUTs) of the camera image as the tip lowers into the dish by using the LUTs panel on the confocal software. Continue to lower the AFM tip using small steps until it is mostly in-focus.\nEnsure that the tip is dark enough so that the general shape of it can be seen and centered in the field of view. Also ensure that the tip appears blurry, which confirms that it has not encounter the bottom of the dish, yet.\nAdjust the microscope focus such that the tip is now in focus, keeping in mind the working distance of the objective. Before moving to a higher magnification objective, use the microscope measurement tool to collect the width and length of the AFM cantilever by accessing the measurement tools panel on the confocal software. Take note of these measurements.\n\tNOTE: It is important not to crash the objective into the bottom of the sample dish which may also cause the sample dish to come into contact with the AFM tip, potentially damaging it.\nIf present, remove the laser light filter, and ensure the AFM laser is on, so that the laser light becomes visible in the optics.",
    "Using the laser alignment dials, move the laser into the field of view and near the AFM tip. Once the laser is at this location, replace the laser light filter.\nUsing the laser alignment dials, place the laser on the backside of where the AFM tip is located on the cantilever. At this point, the laser alignment panel should be reading a sum signal greater than 0.0 V. If no sum signal is obtained, adjust the mirror by using the manually controlled mirror knob until a sum signal greater than 0.0 V reads on the screen.\nMove the laser in small amounts in all directions on the AFM cantilever until the maximum sum signal is achieved but the position is at the AFM tip. Once the laser position is set, zero the vertical and lateral deflection by using the manually controlled deflection dials.\nObserve the laser alignment panel on the AFM software and by using the vertical and lateral deflection knobs on the AFM head, align the detector so that the target is centered (red dot in center of crosshairs) and there is no vertical or lateral deflection.\nOpen the calibration window in the AFM software. Input all experiment specific information. Before calibrating, turn off the confocal microscope light source and close the AFM enclosure, if applicable, to dampen any potential noise coming from the room light or room vibrations. Then press the calibration button to automatically allow the system to calibrate the tip. After calibration is complete, the stiffness of the cantilever (N/m) and its sensitivity (nm/V) will be provided within the calibration panel. Note these for later analysis.",
    "Retract the AFM cantilever at least 2000 µm with the stepper motors. Take the AFM head off the stage and remove the calibration dish. Rotate to or insert the desired objective. Retract the objective 10% of the working distance if the system is programmed to maintain the same focal plane between objectives. If this is an oil objective, place one drop of immersion oil on the eye of the objective.\n\tNOTE: The retraction of the objective reduces the likelihood of the objective contacting the sample dish during placement.\nTo securely hold the sample dish in place, use a cotton swab to apply small dabs of vacuum grease around the edge of the sample ring within the sample stage, or employ sample clips. Carefully load the sample dish into the sample stage.\nOnce the sample is placed, rotate it a few times to ensure a good seal of the dish to the sample holder via the grease. Raise the objective to the bottom of the dish until the oil just wicks over the eye of the objective.\nUsing the microscope, without the AFM head on the stage, focus the imaging system so that the sample is in focus. Note this z height for reference.\nCarefully replace the AFM head onto the platform.\nUsing the z stepper motors, lower the tip towards the sample. As the AFM tip is lowered, adjust the look up tables (LUTs) in the brightfield image as needed. Lower the tip until almost sharp. Using the manually operated AFM tip position micrometers, move the AFM head so that the AFM tip is in the center or left centered in the field of view.",
    "NOTE: Since the z height of the AFM was noted before in step 3.6, larger steps may be taken to lower the AFM tip, however, grease has been added to the bottom of the dish and potentially oil to the objective, so this value is just for reference. It is recommended to take 50 – 100 µm steps and adjusting smaller as the tip comes into focus\nReadjust the laser position by using the manual micrometers on the AFM head. If needed, zero the vertical and lateral deflections by adjusting the respective knobs and recalibrate the AFM cantilever in the sample dish.\n\tNOTE: If the cantilever was calibrated in a medium different from the sample, it must be recalibrated in the scanning medium to account for a potential change in refractive index. Additionally, the laser may drift from the backside of the cantilever due to noise or temperature changes. Only readjust the laser and recalibrate if necessary and in the sample dish above the glass substrate if using non-contact calibration. If using contact calibration, recalibrate inside of the calibration dish using the sample medium.\nTo achieve high quality confocal microscope images, replace the current attenuating light filter with the filter that blocks all AFM laser light. This light filter ensures no interference from the bright light of the AFM laser.\nUsing the automated approach command button, typically denoted by a downward facing arrow, lower the tip to the bottom of the sample dish. Set the size/area of the scan, the resolution, the setpoint, the z length, and the pixel time (or use the calibrated/propagated values) on the imaging control panel and begin scanning.",
    "After a scan is complete, lift the AFM chip 50 – 100 µm up before navigating to a new measurement position in the sample dish. Once a new location is found, approach the glass, and start to scan again following the steps 3.21 and 3.22.\nSelect the Autosave option, or manually save each generated file from each individual scan by clicking on Save.\n4. Confocal procedure\nOpen the confocal operating software. Ensure all associated peripherals, light sources, and controllers are switched on and functioning normally.\nRotate or insert an objective of low magnification (10x or 20x) to view sample. Ensure the objective is at a safe working distance from where the sample dish will be and if needed, back-out the objective to avoid any potential collision of the objective with the sample. Using a cotton swab, dab vacuum grease around the edge of the sample dish ring. If using an oil objective, place a single drop of immersion oil onto the front lens of the objective\nPlace desired sample into the sample stage. Spin the sample around a few times to ensure that vacuum grease has generated a tight bond to the sample stage insert or employ sample clips. If using an oil objective, raise the objective to the bottom of the dish so the oil just wicks over the glass bottom. To avoid excessive bleaching, minimize ambient lighting.",
    "Using brightfield or epifluorescence modes via the camera or eyepieces, locate the sample and using the focus knob, focus on an area of interest containing multiple cells or a single cell. Often, the field of view within the optical microscope will be larger than the x-y scanning window on the AFM system (100 x 100 μm). Make adjustments of the AFM position within the confocal field of view by using the motor control panel in the AFM software so that the AFM scan and confocal optics are imaging the same features.\n\tNOTE: Within the field of view, there are typically only a few cells, so it is easier to determine which cell is desired to probe. As AFM is conducted, the cell becomes visible on the AFM software and, from there, the user can pinpoint specific regions of interest to probe.\nIf desired, capture images in bright-field or epifluorescence using a camera or CLSM modes based on the label of the sample, focus knobs, and capture buttons on the microscope software.\nUsing the microscope software, select the option or open the panel to enable confocal capabilities (e.g., lasers and subsequent parameters). This option is typically noted by the laser line wavelength values.\nSelect the laser lines appropriate for the dyes that are used for staining the samples. Turn on one or multiple laser lines to excite and image those features in the sample.\nSet the gain to a value that optimizes the samples fluorescence but limits the amount of noise. A typical starting value is a gain of 70.\nAdjust the laser power to avoid saturated pixels but maximize the dynamic range. A typical starting range for the laser power is 1 – 3 %.",
    "Set the pinhole size to 1 Airy unit to maximize the resolution for the optical sectioning. If the sample is dim and the laser power is already high, open up the pinhole to increase the signal at the cost of decreasing the z axis resolution.\nSet the pixel dwell time (i.e., the scanning speed). Start off with a 2 µs dwell time and if needed, adjust to reflect the sample brightness. Choose the pixel size/scan size for the selected objective by letting the instrument calculate it via the Nyquist option button and the chosen number of pixels in the image.\n\tNOTE: Longer dwell times in thicker samples can lead to excessive bleaching when z stacks are collected.\nSelect the Scan option on the instrument’s software and begin data collection.\n\tNOTE: If the instrument has multiple lasers, each can be optimized independently, and then ran simultaneously for multi-fluorescent images.\nUse the focus knob to zoom in and out and locate the optimal field of view in the sample.\nCapture images by using the system’s Capture button and save all necessary file formats of the sample to a desired location/folder on the computer’s hard drive, or local external hard drive.\nContinue to adjust gain, laser power, pinhole size, sampling rate, and other values accordingly to optimize the image. The pixel saturation index can be activated to check if pixels are over-saturated. If this over-saturation is present, gain and laser power can be readjusted to eliminate saturated pixels. Use the LUTs as a guide to make specific adjustments.\nIf possible, use the system’s Nyquist sampling rate, which is displayed in the software as a panel or button, to ensure images are collected at the maximum obtainable resolution.",
    "Activate the confocal system’s z stack or image volume collection tool. Using a bottom-to-top option, with only one laser line, specifically the laser line that illuminates a feature in the sample the clearest, set the start and finish planes for the volume to be measured.\nUse the suggested spacing between planes in the z stack, which is calculated to fulfill the Nyquist sampling criteria for the best obtainable axial resolution afforded by the instrument and used laser line.\nWhen multiple laser lines are used, use the shortest wavelength for calculation of the spacing. When the acquisition finishes, save the file to the appropriate folder.\nAlternatively, if a priori knowledge of the sample’s thickness exists, define the volume by selecting the middle plane, the one that appears the brightest and sharpest. In this situation, set the top to half the sample thickness above the middle plane and the bottom to half the thickness below the middle plane.\nAfter sample collection in this field of view is complete, or the sample has bleached, use the motorized or manually controlled stage to find another place of interest on the sample and repeat the steps for image collection.\n5. Clean up procedure\nEnsure all data files, both from the CLSM and AFM, are saved to the proper locations.\nRetract the AFM chip using the z stepper motors at least 2000 µm or the distance that was traveled to get to the sample surface. Remove the AFM head from the stage and place it carefully in its resting place.\nRetract the microscope objective so that it is far away from the sample. If an oil objective was used, the objective should be retracted far enough such that there is no longer contact between the objective and the sample substrate.",
    "Using gloves, remove the sample and clean off the grease, and oil if applicable, from the bottom of the sample dish. Acquire a new, clean, empty Petri dish and fill it with 70% ethanol solution one-half to three-quarters full. Place it into the sample holder and replace the AFM head to allow the AFM chip to soak in the ethanol solution for 5 min.\nWhile the AFM chip is soaking, it is recommended to begin copying the experiment data onto an external hard drive. After immersion of the AFM chip in ethanol solution for at least 5 minutes, remove the AFM head and put it in its resting place.\nUsing gloves, remove the AFM chip holder and place it into the mounting station. Carefully remove the AFM chip using tweezers with rubber grips. Place the used tip back into the location of the box it came from oriented off axis to denote that it has been used. For future reference, note which tip was used in the experiment.\nTake the Petri dish filled with the ethanol solution out of the system and dispose of the liquid and the dish. Using gloves, lens cleaner, and lens wipes, gently clean the oil from the microscope objective following standard protocols. Clean the sample holder by removing any grease. Dispose of all waste materials according to biosafety protocols and return tools to their known locations.\nFinish data collection from the computer(s) and shut them down. Power off all instruments, accessories, peripherals, or other devices utilized for the experiment."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}