{
  "id": 4702,
  "origin_website": "Bio",
  "title": "<em>Magnaporthe oryzae</em> Inoculation of Rice Seedlings by Spraying with a Spore Suspension",
  "procedures": [
    "Preparation of M. oryzae conidiaGrow M. oryzae by placing a stock piece (Figure 2E) on an oatmeal agar plate at 26 °C for 10-12 d.Transfer the plate to 24 °C and incubate for 3 d under a black fluorescence light to induce conidia formation.Pour about 20 ml of sterilized water into the plate (Figure 1A) and collect fungal conidia using a painting brush (Figure 1B). Filter the fungal conidia through KimWipe in a glass funnel set on a 50-ml conical plastic tube (Figure 2A), and determine the concentration of conidia in the filtrate with Hemocytometer under a microscope (Figure 2C).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150604/20150604002400_6680.jpgFigure 1. A. M. oryzae grown on an oatmeal agar plate. B. Painting brush used for collecting fungal conidia. C. Sprayer used for spraying the conidia.Rice infection with M. oryzaeSoak rice seeds in water at 30 °C for 1 d in the dark and then sow them in a pot of soil (Bonsal No.2), and leave the pots in a greenhouse at 28 °C in the day and 23 °C at night for 10-14 d. Rice seedlings at four-leaf stage (three true leaves; Figure 2B) with fully expanded top leaves give the best results in this assay and the duration until reaching this stage varies with different seasons. At least ten rice seedlings are required for each infection assay.Suspend the conidia in 0.02% Silwet L-77 (or 0.05% Tween 20) at a density of 105/ml (in summer) or 1.5 x 105/ml (in winter) and spray them onto rice plants until the uppermost leaf is completely wet (Video 1). After incubation in a dew chamber at 24 °C for 24 h, move the rice plants back to the greenhouse.     <p>imgsrc:https://bio-protocol.org/javascript:;</p>   Video 1. Procedure of M.",
    "oryzae inoculation  After 5-7 d of infection, count the number of blast lesion of susceptible-type in unit length (e.g., 10 cm) of the fourth leaves (Figure 3A, 3B and 3C).In the case of too many blast lesions formed to distinguish and count (Figure 3B), determine the amounts of M. oryzae 28S ribosomal DNA relative to rice  ubiquitin 1 (Os06g0681400) by qPCR (Qi and Yang, 2002).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150604/20150604002423_0852.jpgFigure 2. A. Filtration of conidia. B. Rice seedlings at 4-leaf stage. C. Spores under microscope. D. M. oryzae grown on a filter paper placed on an oatmeal agar plate. E. Filter pieces with M. oryzae grown on in a 1.5 ml-Eppendorf tube.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150604/20150604002449_8861.jpgFigure 3. Blast lesions on rice leaves. A. Lesion number appropriate to count. B. Lesions too many to count. C. Susceptible-type lesions. D. Resistant-type lesions.Making M. oryzae stocksPlace a piece of sterile filter paper on an oatmeal agar plate.Transfer a small piece of M. oryzae mycelium grown on another oatmeal agar plate onto the filter paper. Grow M. oryzae on the filter paper at 26 °C for 10-12 d until fungal hyphae covers all over the filter paper (Figure 2D).Take out the filter paper with grown M. oryzae hyphae (Figure 2D), and dry it for 1-2 d in a petri dish with silica gel (Figure 2E). Cut the filter paper into 5 mm square pieces and dispense 2-3 of them together with 2-3 silica gel into a 1.5 ml-Eppendorf tube, then keep the tube at -20 °C until use."
  ],
  "subjectAreas": [
    "Microbiology",
    "Plant Science"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}