{
  "id": 9762,
  "origin_website": "Jove",
  "title": "Optimized Protocol for the Extraction of Proteins from the Human Mitral Valve",
  "procedures": [
    "In this protocol, the human hearts are collected during multiorgan explantation (cold ischemia time of 4-12 h, mean 6 ± 2 h) from multi-organ donors excluded from organ transplantation for technical or functional reasons, despite normal echocardiographic parameters. They are sent to the Cardiovascular Tissue Bank of Milan, Monzino Cardiologic Center (Milan, Italy) for the banking of the aortic and pulmonary valves. The mitral posterior leaflets are not used for clinical purposes, so they are collected during the aortic and pulmonary valve isolation after informed consent is obtained from the donors' relatives. The tissue for transplantation and research is collected only after parental consent; on the consent sheet, they authorize (or not) the use of the cardiac tissue for research only if it is not suitable for human clinical use (i.e., microbiological, functional, and serological problems), following the guidelines of the ethics committee of Monzino Cardiologic Center.\n1. Mitral valve preparation\nHarvest the human mitral valve as soon as possible after organ explantation (cold ischemia time of 4-12 h).\nIn a clean room, remove the heart from the transport bag containing a cold (4 °C) solution (i.e., saline solution or balanced medium Eurocollins or Wisconsin). Put it into a bucket and place it in a biosafety cabinet (biohazard vertical air flow, class A, Good Manufacturing Practices (GMP) classification) to proceed with the valve preparation.\nPlace the heart on a sterile disposable drape in the cabinet. Using a sterile disposable scalpel, cut the heart completely, perpendicularly to its major axis, on the level of the left and right ventricles, about 4 cm away from the apex.\nMove the ascending aorta and pulmonary artery to display the left atrial roof.",
    "With sterile autoclavable forceps and picks, cut around the left auricle on the left atrial roof, making the mitral valve visible and allowing for the great mitral leaflet (anterior) and the small mitral leaflet (posterior) to be identified.\n\tNOTE: Antero-lateral and the posterior medial commissures define the border of the anterior leaflet and the posterior area.\nUsing sterile autoclavable scissors and non-traumatic forceps, dissect the left atrium and the ventricle wall thickness around the circumference of the whole mitral valve.\nIdentify the mitro-aortic valve continuity.\n\tNOTE: The left ventricle contains the whole mitral valve and chords.\nSeparate the anterior mitral valve leaflet from the posterior mitral valve leaflet, cutting the posterior leaflet along the insertion with the ventricle (commissure).\nWash the posterior leaflet in the saline solution. Cut the leaflet into small pieces (<1 cm2) and individually wrap them in aluminum foil. Snap-freeze them with liquid nitrogen.\n\tCaution: Follow organizational safety procedures when using liquid nitrogen.\n\t\nSanitize the table of the cabinet with a 70% isopropyl alcohol solution and a 6% hydrogen peroxide solution at the end of the procedure.\n2. Protein extraction\nUse forceps to pick up the sample stored in liquid nitrogen and immediately place it on dry ice while still wrapped in the aluminum foil. Do not leave the sample to thaw during any transfers.\nPrior to grinding, chill the porcelain/zirconium mortar and pestles of a grinder system (e.g., CryoGrinder), together with the sample, by putting them in a Dewar flask containing liquid nitrogen (~500 mL).\n\tCaution: Follow organizational safety procedures when using liquid nitrogen.\nPut the mortar and pestles in a polystyrene box containing dry ice. Remove the sample from the aluminum foil and put it into the mortar.",
    "Grind the sample with the big pestle against the mortar 15-20 times, using the screwdriver to rotate the pestle. Mix the sample with the tip of a pre-chilled spatula during the grinding process.\nRepeat with the small pestle.\nTransfer the ground sample to a previously weighed tube (e.g., 15 mL centrifuge tube) by inverting the tube, placing it over the mortar, and inverting them together to move the sample to the tube. Use a pre-chilled spatula to recover all material from the mortar.\nKeep the tube with the sample on dry ice to avoid sample thawing during the transfer.\nCalculate the net weight of the sample.\nClean the mortar and the pestles after each sample and decontaminate them by autoclaving or heating them at 200 °C for 2 h.\nTransfer the powdered sample from the centrifuge tube to the glass tube of a homogenizer by inversion.\nAdd filtered urea buffer (8 M urea, 2 M thiourea, 4% w/v CHAPS, 20 mM Tris, and 55 mM dithiotreitol) to the glass tube, 200 µL of urea buffer for every 10 mg of powdered tissue.\n\tNOTE: Residual powdered sample left in the centrifuge tube can be recovered using part of the calculated volume of urea buffer.\nHomogenize the sample using a stirrer equipped with a borosilicate glass mortar and a polytetrafluoroethylene (PTFE) pestle. Slowly press the pestle onto the sample with a twisting motion (1,500 rpm) 10 times.\nRecover the supernatant and transfer it to a clean 1.7 mL centrifuge tube. Again extract the remaining sample with fresh urea buffer, adding half of the volume used during the first extraction.\nRepeat step 2.10.\nRecover the supernatant and combine it with the supernatant from step 2.11. Place the combined supernatant on a tube rotator for 30 min.",
    "Centrifuge the tube for 30 min at 13,000 x g and 4 °C.\nRecover the supernatant and measure the protein concentration using the Bradford protein assay, per the manufacturer's instructions. Store the sample at -80 °C until use.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}