{
  "id": 18979,
  "origin_website": "Jove",
  "title": "Treatment of Osteochondral Defects in the Rabbit's Knee Joint by Implantation of Allogeneic Mesenchymal Stem Cells in Fibrin Clots",
  "procedures": [
    "A. Preparation of a Donor Rabbit for the Isolation of Mesenchymal Stem Cells (Surgery Room)\nCells are isolated from male New Zealand White (NZW) rabbits at age of 4 months and approximately 3 kg body weight.\nInduce anesthesia by propofol (10 mg/kg body weight i.v.) and sacrifice with sodium pentobarbital (100 mg/kg body weight i.v.).\nShave fur from hind limbs, back and belly with an electric clipper and vacuum the fur.\nDisinfect the shaved area thoroughly with 70% ethanol.\nUse blunt forceps, sharp scissors (or scalpel) and bone cutters for tissue and ligaments.\nMake an incision along the cranial surface of the leg and calf.\nReflect skin and subcutaneous tissue by either sharp or blunt dissection.\nSeparate muscles and ligaments from tibia and femur. Keep cuts as close to the bone as possible to make a clean dissection. Do not separate femur from tibia at this time.\nCut through the hip joint to separate the head of the femur from the acetabulum.\nElevate the tibial-femoral complex.\nUse the scalpel blade to scrape off any remaining soft tissue from the bones or rub the bones with sterile cloth tissues. At this point, femur and tibia are still connected.\nRemove patella by cutting, then cut knee joint ligaments to separate bones finally.\nSpray separated bones with 70% ethanol, let air dry and place each bone into a 50 ml centrifuge tube with cell culture medium (DMEM + 1% penicillin/streptomycin (Pen/Strep)) to keep them moist.\nNow switch under a sterile cell culture laminar flow hood.\nB. Flushing of Rabbit MSC from Bones and Expansion (Cell Culture Hood)\nCollect bones from tubes and place them into 150 mm dishes using sterile forceps.\nRemove both bone ends with a sterile saw and move pieces to new 150 mm dishes.",
    "Fill a 10 ml syringe with medium (DMEM), attach an 18 gauge needle and insert into the opening of the bone marrow.\nThen, rinse marrow cavity with medium to flush the bone marrow into the dish. Afterwards, rinse from the other end, if possible. If necessary, saw off more from the ends. If bone should break, just rinse the inside of the bone.\nAspirate cell medium suspension into the syringe and rinse the bone marrow repeatedly until suspension is free floating through the bone marrow cavity and no further bone marrow-clots appear.\nOnce bone marrow has been collected from all bones, disrupt the marrow clumps by passing through an 18 gauge needle: fill syringe with needle attached and force out into medium.\nAfterwards, filter the suspension through a cell filter into a 50 ml tube. In order to prevent cell loss, wash culture dish 2x with 10 ml medium and filter as well.\nCentrifuge suspension at 500 x g for 5 min at RT.\nRemove supernatant and resuspend cell pellet in 10 ml medium (DMEM + 1% Pen/Strep).\nSeparate blood cells from Peripheral Blood Mononuclear Cells (PBMC) and mesenchymal stem cells (MSC) using a Biocoll Separating Solution.\nFill 5 ml of Biocoll Separating Solution into a 15 ml tube and carefully add 5 ml of cell-suspension on top and centrifuge at 800 x g for 20 min at RT (without brake).\nPossible results see Figure 1: Being denser than Biocoll, red blood cells sediment to the bottom while PBMC and mesenchymal stem cells remain at the interface.\nCarefully remove interface into a 15 ml tube and wash with 5 ml PBS.\nCentrifuge as described in step 22, resuspend in 5 ml PBS and repeat 2-3x.\nThen, centrifuge again at 350 x g for 10 min at RT (with brake).",
    "Resuspend in 10 ml medium and count cells in a hemocytometer.\nPlate cells at an initial seeding density of approximately 5 x 106 in 150 mm dishes.\nAfter 2-3 days, remove non-adherent cells. You might have to rinse with PBS first in order to remove cell debris. Add fresh complete medium (DMEM + 10% Fetal Calf Serum (FCS) + 1% Pen/Strep) afterwards.\nFeed cells every 3-4 days (Figure 2).\nAfter 5-10 days, passage the cells for the first time.\nC. Preparation of Fibrin Clots in vitro\nAt the day of implantation, release adherent cells from flasks/dishes by a 3 min-exposure to 0.25% trypsin-EDTA. Stop trypsinization by adding complete medium.\nDistribute cells in a 50 ml falcon tube and wash them twice with PBS.\nDetermine cell viability and numbers by trypan blue staining.\nAdd 50,000 cells/microcentrifuge tube and collect pellets by centrifugation at 500 x g for 5 min at RT. Prepare a mastermix for at least one more clot as needed.\nResuspend the cell pellet in 17 μl PBS and mix 25 μl of the fibrinogen component of TISSUCOL-Kit with this 17 μl MSC suspension.\nTake a sterile plate with pre-drilled holes (3x3.6 mm) in accordance to the drill holes in vivo (Figure 3).\nFirst, inoculate 4 μl thrombin solution (500 IU/ml) into one hole, followed by immediate addition of 42 μl fibrinogen-cell-suspension and again 4 μl thrombin solution on top. Do not mix the suspension to avoid clotting in the pipette tip. First, the 50 μl volume of the pipetted fibrinogen-cell-suspension will protrude the rim of the pre-drilled holes without melting due to the surface tension. However, after complete clotting (after 60 min) the clot is contracting and fits into the pre-drilled hole.",
    "Remove the clot carefully using a blunt forceps and place into a microcentrifuge tube with PBS. Prepare 2 clots/animal.\nTake the clots to the surgery room.\nD. Implantation of Allogeneic Mesenchymal Stem Cells in Fibrin Clots\nInduce anesthesia to rabbit (NZW, male, 3.5-4.0 kg body weight, 5-6 months old) by i.v. injection of propofol (10 mg/kg body weight).\nShave the knee to be operated on with an electric clipper and vacuum the fur. All the procedures named before are performed in a surgery preparation room to avoid contamination of the sterile environment of the operating room.\nAfter intubation, maintain anesthesia with 1.5 mg/kg/min propofol and 0.05 mg/kg/min fentanyl intravenously. Monitor anesthesia by using capnography, pulse oximetry and pulse rate.\nDisinfect the shaved knee thoroughly and cover the rest of rabbit with a sterile dressing.\nPalpate the patella and perform a skin incision medial to the patella.\nOpen the knee joint by a medial parapatellar arthrotomy under sterile conditions. Try to avoid cutting any small superficial blood vessels.\nDisplace the patella laterally (Figure 4).\nAfter inspection of the knee joint for any concomitant cartilage lesions or joint anomalies, create two osteochondral defects (3 mm deep, figure eight-shaped) in the trochlear groove with a sterile air operating power drill (3.6 mm in diameter) with a stop-device (Figure 5) .\nClean the defects and rinse them with sterile saline.\nPrior to implantation, fill 20 μl of fibrin glue into the defects and distribute them evenly onto the bottom of the defect.\nThen implant the clots press-fitted into the figure eight-shaped defect.\nAfter clotting, relocate the patella within the trochlear groove and bend and stretch the knee a few times.\nDisplace the patella laterally once again and check if fibrinogen-cell-clots are still in place.",
    "Replace the patella again and finish the operation with wound closure in layers with single button sutures (4-0 Vicryl) and a continuous cutaneous suture (4-0 Monocryl) (both with absorbable suture material).\nFinally, seal the wound with a spray dressing permeable to water vapor.\nFor post-operative care, the wound is checked daily for 7 days. The rabbits receive for post-operative analgesia Carprofen 4 mg/kg s.c. every 24 hr (for 4 days) and Buprenorphin 0.03 mg/kg s.c. every 12 hr (for 2.5 days). A stabilization of the knee (e.g. dressing) is not necessary. \nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}