{
  "id": 10449,
  "origin_website": "Jove",
  "title": "Home-Based Prescribed Pulmonary Exercise in Patients with Stable Chronic Obstructive Pulmonary Disease",
  "procedures": [
    "The protocol has been approved by the Ethics Committee of Yueyang Hospital of Integrated Traditional Chinese and Western Medicine affiliated with Shanghai University of Traditional Chinese Medicine (Shanghai, China).\n1. Video construction and study design\nConstruct a video of the prescribed pulmonary exercise. Our video was based on the TCE video issued by the General Administration of Sport of China.\n\t\nIn the video, have a member of the research team in a spacious place display and give a general introduction to the different characteristics of the prescribed pulmonary exercises.\nHave the member simulate the exercises in different dimensions to clarify these characteristics.\n\t\tNOTE: The video used here is in Chinese. The person in the video is of normal weight and is a middle-aged female in good physical shape, from Shanghai University of Traditional Chinese Medicine. The video structure and contents can be seen in Figure 1.\nUse a parallel-designed single-blind randomized controlled trial to determine the effect of prescribed pulmonary exercise on COPD patients.\n\t\nObtain written, informed consent and collect basic characteristics including age, sex, body mass index (BMI), duration, and disease grade from recruited participants.\nRandomize the divided participants into two groups at a 1:1 ratio according to a random number table.\n\t\tNOTE: Random numbers should be generated using a computer and enclosed in an opaque envelope by an independent individual who does not participate to achieve allocation concealment.\n2. Power calculation\nConduct a power analysis using analysis software of choice to determine the minimal sample size necessary to obtain statistical results.\n\t\nChoose an appropriate statistical test according to the study design.\nSelect an assumed mean difference of the changes in quality of life after 3 months of intervention of prescribed pulmonary disease. This can be based on any previous work that may have been done.",
    "Select an assumed standard deviation (SD), as well as an appropriate alpha and power value.\nUsing a previous study as a reference (if possible) and considering the study design, define an assumed drop-out rate.\n\tNOTE: The power analysis of this study was based on an independent t-test assuming equal variance. Based on the minimal clinical important difference of the total SGRQ and item scores21, the assumed mean difference was set at 4 scores, and the assumed SD in both groups was set at 3.6 scores according to previous studies17. The two-side significance level was set at an alpha-level of 0.05, and a power of 0.8. Results of the power calculation revealed that a total of 28 participants were needed (14/group). Considering a drop-out rate of about 15%, we planned to recruit 34 participants (17/group) (Figure 2).\n3. Participant recruitment\nNOTE: Participant recruitment in this example was conducted in the Department of Respiratory, Yueyang Hospital of Integrated Traditional Chinese and Western Medicine, Shanghai University of Traditional Chinese Medicine.\nRecruit patients with stable COPD between the ages of 40 and 80.\n\tNOTE: The COPD diagnosis was based on the guidelines of the Global Initiative for Chronic Obstructive Lung Disease (GOLD) (forced expiratory volume in 1 second (FEV 1)/forced vital capacity (FVC) < 0.7, FEV1 < 80% the predicted value)5.\nExclude participants who have regularly exercised in the past 6 months (>2x per week for >60 min each). Also, exclude participants in acute exacerbation as well as those that have serious cardiovascular diseases or musculoskeletal disorders that could affect exercise intervention and testing programs.\nAsk participants for written consent after informing them about possible discomfort and risks during the training sessions and testing. The possible discomfort and risks include but are not limited to sourness of muscle, dizzy, dyspnea, and falling.\n4. Training",
    "Give training instructions 3x within 2 weeks to PG participants before the formal training session. Ask participants to study the complete action and breathing requirements of each intervention.\nDeliver the video of the prescribed pulmonary exercises and the exercise record brochure to all participants.\nInstruct PG participants to perform the prescribed pulmonary exercises in accordance with the intervention program (60 min each, 2x per day, 7 days a week, for a total of 3 months).\n\tNOTE: On Sunday afternoons, ask participants to gather in the hospital to perform exercises under the supervision and instruction of physiotherapists, and for the remaining 6 days to perform exercises at home.\n\t\nInstruct PG participants to perform a warm-up exercise for 10 min, mainly focusing on dynamic flexibility exercises of involved muscle groups and stretching muscles.\nInstruct PG participants to perform prescribed pulmonary exercises for 40 min, which is composed of six characteristics including the “hu” and “si” sounds in liu zi jue, “pushing up the sky to regulate the triple warmer” and “drawing a bow to shoot a vulture” in ba duan jin, “the crane actions” in wu qin xi, and “cross-armed iron staff” in yi jin jing22.\n\t\tNOTE: Evaluate the exercise intensity using the Borg category-ratio 10 (Borg CR-10) and ask participants to maintain a level of dyspnea in the range of 4 to 623. In the hospital, the Borg CR-10 and heart rate monitor (Polar team2) are both used to evaluate exercise intensity.\nInstruct PG participants to perform a cool-down exercise for 10 min, mainly focusing on stretching and relaxing the muscles.\nAsk participants to record detailed information after each exercise session in the exercise record brochure, including details about exercise method, time, duration, intensity, and site.\n5. Outcome assessment",
    "NOTE: Conduct an assessment session within 7 days before and after the formal intervention.\nAssessment of height, weight, and body composition\n\t\nAsk participants to remove all items and metal objects from their clothing and bodies.\nAsk participants to stand barefoot on the corresponding positions of the electrode pads with their back to the instrument column. Wait briefly for the apparatus to automatically print data including height, weight, body fat, and BMI.\nSix minutes walking test (6MWT)\n\t\nPerform the 6MWT in accordance with the technical standard described by European Respiratory Society/American Thoracic Society (ERS/ATS)24.\nExplain the test procedure and inform participants that temporary rest is available when discomfort or exhaustion arises. Encourage participants to walk as fast as they can during the 6 min duration.\nPrior to the test, inquire participants about their levels of dyspnea using the Borg CR10.\nAsk participants to walk back and forth as quickly as possible in a marked, 30 m straight line. Standardized phrases of encouragement are used for each minute.\nAfter 6 min, ask participants to stand stationary, then record their distance in meters and levels of dyspnea.\nAfter a 30 min rest, instruct participants to perform the test a second time.\n30 seconds arm curl test\n\tNOTE: The 30 s arm curl test was carried out according to the senior fitness test manual25.\n\t\nExplain and demonstrate the test procedure and inform participants that the test should be performed as quickly as possible during a 30 s duration.\n\t\tNOTE: The test is initiated from the down position to the arm curl position, and the wrist should not move during the motion.\nAsk participants to sit on a 43 cm tall straight-back armless chair with their backs upright and feet flat on the ground.\nAsk participants to perform the arm curl motion 1–2x to familiarize.",
    "Ask participants to hold the dumbbells (8 lbs for men, 5 lbs for women) using the dominant hand.\nOn the signal “go”, instruct participants to curl the weight through a full range of motion as many times as possible in 30 s. A researcher should stand to the side to time and record the results.\n30 seconds sit-to-stand test\n\tNOTE: The 30 s SST was performed according to the senior fitness test manual25.\n\t\nPlace a chair with the backrest leaning against a wall.\nExplain and demonstrate the test procedure and inform participants that the test should be performed as quickly as possible in 30 s.\n\t\tNOTE: The test is initiated from a seating position, with feet separated and knee flexed at about 90°.\nAsk participants to sit in the middle of the chair with back straight, arms crossed on the chest and placed on the opposite shoulder.\nAsk participants to perform the sitting up motion 1–2x to familiarize.\nOn the signal “go”, instruct participants to stand up and sit down as many times as possible in 30 s. A researcher should stand to the side to time and record the results.\n\t\tNOTE: If participants conduct more than half of the motion at the end of the 30 s duration, this counts as a full motion.\nQuestionnaire for quality of life\n\t\nAsk participants to complete the SGRQ to assess quality of life. The SGRQ consists of three subdomains including symptoms (cough, cough, asthma attacks, etc.), activity (climbing, dressing, housework, etc.), and impact (anxiety, pain, insecurity, etc.)26,27.\nCalculate final SGRQ scores (total and sub-domains) per previous protocols, using analysis software of choice26,27.\n\t\tNOTE: Participants who display deficiency of knowledge or defects in vision should complete the questionnaire with the help of staff.\n6. Statistical analysis",
    "Carry out statistical analysis using software of choice.\nConduct normality and variance homogeneity tests for continuous data.\nConduct two paired t-tests or a Wilcoxon rank-sum test to analyze differences within the group according to data normality and variance.\nCalculate the changes after 3 months of intervention as post-values minus pre-values.\nConduct an independent t-test or Mann-Whitney U test to analyze differences between the group according to change-value normality and variance.\nConduct a chi-squared (χ2) test for category data.\n\tNOTE: Conduct a two-sided test and use p < 0.05 as the significance cut-off value.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}