{
  "id": 10370,
  "origin_website": "Jove",
  "title": "Generating Controlled, Dynamic Chemical Landscapes to Study Microbial Behavior",
  "procedures": [
    "1. Fabrication of the Microfluidic Device for the Single Chemical-pulse Experiment\nDesign the channel using computer-aided design (CAD) software and print it onto a transparency film to create the photo mask (Figure 1A).\nFabricate the master by soft lithography (under clean-room conditions).\n\t\nClean a silicon wafer (4 inches) in quick succession with acetone, methanol and isopropanol, then dry using nitrogen. Bake the wafer in the oven at 130 °C for 5 min.\nPlace the wafer at the center of a spin-coater and pour SU-8 photoresist onto the wafer. Ramp the speed of the spin-coater up to 500 rpm over 5 s, and keep at 500 rpm for 10 s. Ramp up to the final speed over 10 s and maintain at this speed for 30 s.\n\t\tNOTE: The exact value of the final speed depends on the targeted coating thickness and the SU-8 used.\nAfter the spin-coating process, bake the wafer at 65 °C and then at 95 °C. Let the wafer cool at room temperature (RT) for at least 5 min.\n\t\tNOTE: The baking time depends on the targeted thickness and type of photoresist used. As a general rule, for every 100 µm layer the wafer should be baked for 5 min at 65 °C and 45 min at 95 °C.\nPlace the photo mask onto the wafer to ensure that just the region of interest is exposed and polymerized. Expose to UV light for the time recommended in the SU-8 manual.\n\t\tNOTE: Here, with exposure energy of 200 mJ cm-2 at a wavelength of 350 nm, the wafer was exposed for 150 s.\nBake the wafer at 65 °C and 95 °C for the time recommended in the SU-8 manual.",
    "NOTE: As a general rule, for every 100 µm layer the wafer should be baked for 5 min at 65 °C and 45 min at 95 °C.\nImmerse the wafer in a beaker filled with polymethyl methacrylate (PMMA) developer in order to obtain the master. Gently shake the beaker to ensure that the unpolymerized photoresist is washed out. Bake the master at 200 °C to further cross-link the SU-8 layer.\nPrepare a polydimethylsiloxane (PDMS) mixture by combining the elastomer with its curing agent (Table of Materials) at a 10:1 ratio in a beaker (here, 40 mL). Mix vigorously until the liquid is homogeneous.\n\tNOTE: The PDMS mixture will look opaque because bubbles are generated during the mixing process.\n\tCAUTION: In order to prevent skin coming into contact with potentially hazardous chemicals or biological material, always wear a lab coat and disposable plastic gloves throughout the protocol and follow any specific safety protocols according to the Material Safety Data Sheet (MSDS).\nDegas the PDMS mixture in a vacuum chamber for 45 min at RT. To expedite the process, periodically release the vacuum in order to burst the bubbles that form at the interface.\n\tNOTE: The degassing process must be performed within 1 h to prevent the PDMS mixture from beginning to cure.\nRemove dust from the surface of the master with a pressurized cleaner, then pour the degassed PDMS mixture onto the master and bake in an oven at 80 °C for 2 h.\n\tNOTE: Alternatively, baking overnight (or for at least 12 h) at 60 °C would achieve the same hardened PDMS.\nCut the PDMS with a blade around the microstructures (at a distance of approximately 5 mm) and then carefully peel the PDMS from the master.",
    "Punch holes to serve as inlet and outlet of the microchannel (here, one inlet and one outlet, see Figure 1A). Ensure that nothing touches the bottom face of the PDMS where the features are located.\n\tNOTE: The protocol can be paused here. The microchannel should be sealed with adhesive tape to prevent accumulation of dust and other particles during storage.\nBond the PDMS microchannel to a glass slide.\n\t\nThoroughly clean a glass slide with soap, isopropanol and deionized water. Let the glass slide dry or use compressed air to speed up the process.\nRemove dust particles by dabbing with adhesive tape. Bond the PDMS microchannel on the clean glass slide, immediately after treating both surfaces with plasma (by using either a corona system or a plasma oxygen chamber) for 2 min.\nPlace the microfluidic device to heat on a hot plate at 80 °C for at least 1 h to strengthen the chemical bond with the glass.\n2. Fabrication of the 3D-printed Millifluidic Device for the Experiment with Multiple Pulses\nDesign the 3D shape using 3D-design software and print the master for the PDMS mold with a high-resolution 3D printer (Figure 1B).\n\tNOTE: See Table of Materials for the 3D printer and mold material used to create the master.\nRepeat steps 1.3−1.4, then clean the surface of the master by dabbing with adhesive tape. Put the master on a scale, then, while avoiding the central region of the master that will be occupied by the membrane, pour on the exact quantity of uncured PDMS mixture (here, 23.4 g) in order to obtain the desired height of PDMS by matching the height of the master (here, 0.5 mm). Remove any remaining bubbles with the help of compressed air.",
    "Place the PDMS cast on the master in an oven at 45 °C to bake for at least 12 h.\nBond the 3D PDMS mold to a Petri dish.\n\t\nGently peel off the hardened PDMS layer and punch inlet and outlet holes for the injection of the bacterial suspension (Figure 1C).\nActivate both the surface of a Petri dish (90 mm x 15 mm) and the PDMS mold with oxygen plasma for 2 min. Bond the PDMS mold on the Petri dish. Gently press the mold to the Petri dish, but do not press where the features are located as this can collapse the interrogation chamber.\nPlace the Petri dish bonded to the PDMS 3D mold in an oven at 45 °C for at least 12 h to strengthen the chemical bond.\n\t\tNOTE: The protocol can be paused here.\nMembrane surface functionalization18\nActivate the nanoporous polycarbonate (PCTE) membrane in an oxygen plasma chamber for 1 min at RT.\n\t\tCAUTION: Avoid using a corona system for the plasma activation because it will damage the membrane.\nUnder a chemical hood, dilute a commercial solution of 3-aminopropyltriethoxysilane (APTES) in deionized water to 1% by volume (here, 40 mL), by using a polypropylene tube.\n\t\tCAUTION: The APTES solution is acutely toxic (MSDS health hazard score 3) and should be handled with extreme care exclusively under a chemical hood with gloves. Change gloves immediately after handling APTES solution. APTES fumes are destructive to the mucous membranes and the upper respiratory tract. The target organs of APTES are nerves, liver, and kidney. If a fume hood is not available, a face shield and full-face respirator must be implemented.\nTransfer the diluted APTES solution in a Petri dish and immerse the activated membrane in the APTES solution for 20 min.",
    "Remove the membrane from the APTES solution with tweezers and place it on a cleanroom wipe to dry.\nFor the fabrication of the PDMS microfluidic channels that will lie on the membrane and allow washing of the bacterial arena, repeat steps 1.1−1.7.\nBond the PDMS washing channels to the functionalized membrane.\n\t\nActivate both the PDMS washing channel and the PCTE membrane with an oxygen plasma chamber for 2 min.\n\t\tNOTE: The membrane, which will be sandwiched between two PDMS layers, should be smaller than the PDMS washing channel.\nImmediately after the plasma treatment, bring the functionalized membrane and the PDMS washing channel into contact by gently pressing the PDMS washing channel onto the membrane.\n\t\tNOTE: Do not apply excessive pressure at this stage, because it might cause (irreversible) attachment of the membrane to the channel's roof, blocking the channel.\nSandwich the membrane between two PDMS layers (Figure 1E).\n\t\nActivate both the bonded laminate PDMS washing channel−PCTE membrane and the 3D PDMS mold previously bonded to the Petri dish with an oxygen plasma chamber for 2 min. Bring them into contact and press together.\nPlace the Petri dish bonded to the sandwich structure in an oven at 45 °C for at least 12 h to strengthen the chemical bond.\n\t\tNOTE: The protocol can be paused here.\n3. Cell Culture\nGrow a population of V. ordalii (strain 12B09 or 12B09pGFP) overnight for 20 h in 2216 medium19 on an orbital shaker (600 rpm) at 30 °C and harvest cells in late-exponential phase. For isolates harboring pGFP, add spectinomycin (50 µg mL-1) to maintain the plasmid.\nCentrifuge a 1 mL aliquot of cells at 2500 x g for 3 min, remove the supernatant and re-suspend the cells in 1 mL of filtered artificial seawater. Repeat this step.",
    "Starve the population of V. ordalii on an orbital shaker (600 rpm) at 30 °C for 3 h.\nPrepare a stock artificial seawater solution of 10 mM (here, 1 mL) of 4-methoxy-7-nitroindolinyl-caged-L-glutamate (MNI-caged-L-glutamate) and store at -20 °C.\n\tNOTE: Protect the MNI-caged-L-glutamate solution from ambient light to prevent photolysis.\nDilute the cells 50x by re-suspending the starved cells in an artificial seawater solution of 1 mM MNI-caged-L-glutamate.\n\tNOTE: This will ensure a final bacterial concentration lower than 5 x 107 mL-1 (the exact value depends on the initial concentration of cells in late exponential, which is typically ~109 mL-1). Bacterial concentration was estimated using a spectrophotometer at optical density (OD) of 600 nm.\n4. Calibration of the Uncaging Protocol\nPlace a droplet (20 μL) of an artificial seawater solution of MNI-caged-L-glutamate20 at a concentration C0 = 10 mM on a glass slide. Encapsulate the droplet by covering it with a circular PDMS chamber (diameter d = 5 mm, height h = 250 μm).\nPlace the glass slide on a microscope stage and expose the entire chamber for 20 ms to an LED beam at a wavelength of 395 nm (power 295 mW) by using a 4x objective (numerical aperture [NA] = 0.13).\nOpen the PDMS chamber and extract a droplet (1 μL) for analysis with a UV-Vis spectrophotometer.\nRepeat steps 4.1−4.3 for different durations of LED illumination of 0.1 s, 0.5 s, 2.5 s, 25 s, 250 s (or until saturation of the chemical reaction) and 0 s (to obtain the background). Replicate the procedure steps 4.1−4.4 at least 3x (here, 4x).",
    "From the absorption spectrum, extract the value at 405 nm, which represent the peak in the absorption spectrum of the cage molecule21. To determine the rate k of the chemical uncaging reaction by the LED exposure14, use the following first-order kinetics equation for the numerical fit of the experimental data17\nimgsrc://cloudfront.jove.com/files/ftp_upload/60589/60589equ01.jpg\n\twhere C(t) is the value of the absorption spectrum of the solution at 405 nm (after background removal) with an uncaging time of t seconds. For small uncaging time t such that kt 1, Eq. 1 can be simplified to the linear formulation\nimgsrc://cloudfront.jove.com/files/ftp_upload/60589/60589equ02.jpg\n5. Single Chemical-pulse Experiment\nMaintain the microfluidic channel under vacuum for 20 min to reduce the gas concentration within the PDMS so that bubbles are less likely to form during the filling process.\nExtract the channel from the vacuum pump and immediately introduce the dilute bacterial suspension in 1 mM MNI-caged-L-glutamate in artificial seawater into the microchannel gently using a micropipette to avoid flagellar damage by mechanical shearing forces (here, the entire filling process took 5-10 s). After filling the channel with the bacterial suspension, suck the solution in excess with paper towel, and seal inlet and outlet with PDMS plugs by gently pressing them into the holes.\n\tNOTE: In this way, fluid flow in the chamber is prevented.\nPlace the microchannel onto a microscope stage and move the stage to set the field of view in mid-channel. Set up the microscope to perform imaging in phase contrast (4x objective) at a frame rate of 12 fps.\n\tNOTE: This value can be varied but should not be less than 10 fps to allow reconstruction of the bacterial trajectories through image analysis (see protocol section 7).",
    "Set the pinhole of the LED beam at the minimum aperture. By setting the exposure time of the camera to 5 s, record a few frames to obtain precise measurements of the spatial location and size of the LED beam.\n\tNOTE: The LED light source connects to the microscope's epi-fluorescence illuminator via liquid light guide connection. The LED beam does not affect video capturing, because video acquisition and LED stimulation are commanded independently via software.\nPerform continuous imaging for a total duration of 10 min (20 min for the largest chemical pulse), and simultaneously activate the focused LED beam at 395 nm for the desired duration (in this experiment, t = 20 ms, 100 ms, 500 ms) at a user-defined time point (here, 10 s after the start of the video acquisition) via microscope software. To obtain multiple replicates of the same process, move the stage to record the bacterial response over different positions of the microfluidic channel. Replicate this procedure for each pulse size, using a new microchannel.\n\tNOTE: The uncaging process generates an axisymmetric cylindrical pulse that diffuses radially outwards in the imaging plane.\nConduct separate experiments without chemical uncaging at higher magnification (20x objective, NA = 0.45) at a higher frame rate (50 fps) to record the unbiased swimming motion of the bacteria.\n6. Multiple Chemical-pulse Experiment\nMaintain the millifluidic chamber under vacuum for 20 min.",
    "Place the Petri dish containing the millifluidic chamber onto a microscope stage. Fill the chamber below the membrane with the dilute bacterial suspension (here, the entire filling process took 10−15 s) of GFP-fluorescent V. ordalii in 1 mM MNI-caged-L-glutamate solution in artificial seawater. After filling the channel with the bacterial suspension, suck the solution in excess with paper towel, and seal inlet and outlet with PDMS plugs by gently pressing them into the holes.\n\tNOTE: In this way, fluid flow in the chamber is prevented. To allow better visualization of bacteria in this setup where the imaging occurs through the nanoporous membrane, it is strongly recommended to use fluorescent strains instead of the wild type (as used in the single chemical-pulse experiment).\nFill a syringe with an artificial seawater solution of 1 mM MNI-caged-L-glutamate and attach tubing to the inlet and outlet of the washing channel above the membrane.\nConnect the tubing to a waste reservoir and ensure that the tubing is entirely submerged in the fluid waste reservoir to avoid pressure oscillations.\nSet the appropriate flow rate on the syringe pump (here, 50 μL min-1) to obtain the desired mean flow rate in the washing channel, which depends on the channel geometry.\nStart the syringe pump to establish the flow in the washing channel above the membrane.\nRun the software controlling the LED beam and microscope stage to generate user-defined sequences of pulses at different locations and with different intensities.\n\tNOTE: The continuous flow of the artificial seawater solution of 1 mM MNI-caged-L-glutamate in the washing channel above the membrane replenishes the caged compound solution and washes the spent medium from the bacterial arena.",
    "Record video using a 4x objective at regular time intervals over a period of several hours and over multiple contiguous locations to cover a large surface (here, 1 cm x 1 cm, Figure 1F).\n7. Image Analysis and Data Analysis\nReconstruction of the bacterial trajectories\n\t\nFrom the movies recorded with the 4x objective, reconstruct the bacterial trajectories using tracking software17.\n\t\tNOTE: These trajectories represent the 2D projections of the 3D bacterial motion in the microchannel.\nFrom the reconstructed bacterial trajectories, determine the radial drift velocity of each swimming individual by projecting its swimming speed over the direction towards the center of the chemical pulse (Figure 2D). For the visualization of the spatio-temporal dynamics of the radial drift velocity, use a binning grid with spatial size 75 μm x 75 μm and temporal window of 5−10 s interval (Figure 2D,E).\n\t\tNOTE: Because of the cylindrical symmetry of the process, data can be analyzed in polar coordinates and averaged over the angular dimension (Figure 3).\nFrom the reconstructed bacterial trajectories, determine the spatio-temporal dynamics of the distribution of bacteria as they respond to the chemical pulses (Figure 2E).\nFrom the higher resolution movies recorded with the 20x objective during the single-pulse experiments, extract the distribution of swimming speed and run time for the bacterial population as they respond to the chemical pulse (Figure 4).\nEstimate the diffusion coefficient of bacteria by considering the dissipation dynamics of the bacterial population after chemotaxis is completed17 (here, for t > 300 s; Figure 3).\nEstimate the diffusion coefficient of glutamate by applying the Stokes-Einstein equation\nimgsrc://cloudfront.jove.com/files/ftp_upload/60589/60589equ03.jpg",
    "where the amino acid molecules are assumed to be spherical particles with hydrodynamic radius22 rG, kB is the Boltzmann constant (1.38 x 10-23 m2 kg s-2 K-1), T is the temperature (296 K), and η is the dynamic viscosity of the artificial seawater (salinity 36 g kg-1) at 23 °C (10-3 Pa s)23\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}