{
  "id": 11921,
  "origin_website": "Jove",
  "title": "Fluorescence Microscopy for ATP Internalization Mediated by Macropinocytosis in Human Tumor Cells and Tumor-xenografted Mice",
  "procedures": [
    "All procedures reported herein were performed in accordance with Ohio University's IACUC and with the NIH.\n1. Selection of nonhydrolyzable fluorescent ATP (NHF-ATP) and dextrans\nSelect a fluorophore-conjugated NHF-ATP (Figure 1A) and endocytosis tracers, high and low molecular weight fluorescent dextrans (TMR-HMWFD and TMR-LMWFD) (Figure 1B), based on the preferred emission wavelengths (e.g., imaging system equipped with appropriate filters) and the specific endocytosis process to be studied.\n2. ATP localization studies, in vitro (Figure 2)\nimgsrc://cloudfront.jove.com/files/ftp_upload/62768/62768fig02.jpg\nFigure 2: In vitro procedure to examine ATP internalization. Schematic representation of the protocol to visualize the internalization of extracellular ATP in cultured cancer cells using fluorescence microscopy. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/62768/62768fig02large.jpg]\nCell culture and preparation of cells\n\tNOTE: Perform cell culture under sterile conditions in a tissue culture hood.\n\t\nPrepare Dulbecco's Modified Eagle Medium (DMEM), containing 10% (v/v) fetal bovine serum (FBS) and 1% (v/v) penicillin/streptomycin (hereafter called DMEM/FBS), sterile phosphate-buffered saline (PBS), and 0.25% trypsin/ethylenediaminetetraacetic acid (EDTA), in a 37 °C water bath.\nCulture human cancer cells in DMEM/FBS in a 100 mm tissue culture dish. Maintain the cells in an incubator set to 37 °C with a 5% CO2 atmosphere.\nWhen the cells reach confluence, passage the cells by first removing the culture medium. Next, rinse the dish with 5 mL of sterile PBS, remove the PBS, and add 3 mL of 0.25% trypsin. Incubate at 37 °C in a 5% CO2 atmosphere for 5 min.\nRetrieve the dish, then add 6 mL of DMEM/FBS to stop the trypsinization. Transfer the cells in suspension to a 15 mL conical tube and centrifuge at 800 × g for 5 min to pellet the cells.\nAfter centrifugation, aspirate the supernatant and use 10 mL of DMEM/FBS to resuspend the cell pellet by pipetting.",
    "Count the cell density and viability using a hemocytometer. Use DMEM/FBS to dilute the cell suspension to a density of ~7.5 × 104 cells/mL.\nPreparation of coverslips and seeding cells\n\t\nWash 12 mm coverslips with 70% ethanol and wipe them carefully with delicate task wipes. Sterilize the coverslips and one pair of forceps via autoclaving.\nIn a tissue culture hood, use forceps to place one coverslip into each well of a 24-well tissue culture plate.\n\t\t​NOTE: Later, the coverslip, with cells, will be mounted directly onto a microscope slide for imaging.\nDispense 300 µL of the cell suspension (cells in DMEM/FBS), at a seeding density of ~2.5 × 104 cells per well, into the 24-well plate containing the sterilized coverslips.Incubate in sterile conditions at 37 °C with 5% CO2 flow.\nStarvation of cells\n\t\nTwenty-four hours after seeding, remove the DMEM/FBS from each well. Immediately add 300 µL of prewarmed serum-free DMEM into each well to serum-starve the cells for 15-18 h to induce uptake of extracellular nutrients.\n\t\tNOTE: The 15-18 h starvation period is a critical parameter.\nPreparation of NHF-ATP and HMWFD/LMWFD solutions\n\t\nUse an analytical balance to weigh high-molecular-weight (70 kDa) fluorescent TMR-dextran (TMR-HMWFD, 1 mg/mL), a tracer for visualizing macropinosomes, or NHF-ATP (10 µmol/L) in serum-free DMEM in a 1.5 mL microcentrifuge tube. Place the tubes, protected from light, in a 37 °C water bath for 15 min.\nCentrifuge at 12,000 × g for 5 min at room temperature. Carefully transfer the clear supernatant to a new 1.5 mL microcentrifuge tube, leaving any pellet or debris intact to remove indissoluble crystals.\nAdd the solutions from step 2.4.1 to the cells in each well, and incubate the cells for 30 min at 37 °C.",
    "​NOTE: If HMWFD and NHF-ATP solutions are to be mixed for co-incubation with the cells, prepare both solutions at 2x the final concentrations. The solutions will be mixed later at a 1:1 ratio to achieve the final accurate working concentrations. Avoid light as the reagents are light-sensitive.\nTreatment of cells and fixation\n\t\nIn a fresh 24-well plate, dispense 500 µL of prewarmed PBS into each of five wells.\nAfter cell incubation, carefully pick up each coverslip using forceps. Rinse each coverslip by dipping it in 500 µL of prewarmed PBS. Repeat five times using the five PBS-filled wells.\n\t\tNOTE: Gentle washing of cells-on-coverslips is critical for the success of this experiment.\nAfter the final PBS wash, tap the coverslip on a delicate task wipe to absorb extra PBS and transfer the coverslip immediately to cold (4 °C) 3.7% formaldehyde, preloaded in a 24-well plate. Fix the cells for 15 min at room temperature.\nWhile the cells are being fixed, pre-clean microscope slides with 70% ethanol. Remove the coverslips from the wells and mount them onto the slides, using 5 µL of aqueous mounting medium containing the nuclear stain 4′,6-diamidino-2-phenylindole (DAPI), per coverslip. Gently blot excess PBS with a paper towel or a delicate task wipe.\nFluorescence microscopy and image acquisition\n\t\nTwo to 24 hours after the steps above, capture images of cells and internalized HMWFD and/or NHF-ATP using an epifluorescence imaging system and data acquisition software.\n\t\tNOTE: This sub-section describes steps to acquire images using a Nikon NiU microscope, equipped with epifluorescence imaging capability, and Nikon NIS Elements software. However, other comparable imaging systems and acquisition software may be used. Follow the operating instructions from the manufacturer.\n\t\t\nPlace the slide on the stage of an upright epifluorescence microscope in binocular mode. Access the imaging program.",
    "Select the 10x objective, adjust the stage to define focus, and scan the slide from left to right in a serpentine manner to identify the regions of interest.\n\t\t\tNOTE: Identifying regions of interest will vary between cell types, with some cell lines/cancer types exhibiting diverse and distinct degrees of TMR-HMWFD and/or NHF-ATP uptake.\nSelect the 40x objective, and switch from binocular mode to image capture mode, using the toggle on the microscope.\nClick on the Live Quality icon on the imaging program to view and subsequently acquire images.\nUsing the OC Panel on the Annotations and Measurements toolbar, define the exposure parameters for each filter cube or fluorescent channel.\n\t\t\tNOTE: Select the appropriate exposure time for each channel, as signal intensities are different. For example, select an exposure time of 200 ms for DAPI, 2 s for HMWFD, and 4 s for NHF-ATP. Once the exposure time is determined per channel, use this setting for all images, per channel, with different treatment or conditions.\nOnce the exposure settings have been set for each channel, use the multichannel acquisition toolbar to acquire a 3-channel image with the defined exposure settings.\n\t\t\tNOTE: Image acquisition through the multichannel ND acquisition mode enables automatic image capture for each channel of the same field of view. The shutter is closed automatically between turret changes.\nAlternatively, acquire multichannel images manually by toggling between filter cubes, setting the exposure time, closing/opening shutter in between image acquisition for each channel, and overlaying each image taken for individual channels.\n\t\t\tNOTE: The ND acquisition mode automates this process and provides merged images.\nSave the image as .nd2 file (Nikon Elements format saves metadata). Save TIF files, including the merged channel image and individual channel images.\n\t\t\tNOTE: TIF files can be used with a broader selection of software applications.",
    "Use the Object Count feature on the Analysis toolbar to count the number of NHF-ATP-, TMR-HMWFD-, and/or TMR-LMWFD-positive cells on a saved .nd2 image file.\nExport the data to a spreadsheet through the analysis program.\nData quantification and analysis\n\t\nFor each condition assayed, image 50 to 100 cells for quantification. Using the data analysis software (software included in the epifluorescence imaging system or other software), count and calculate the mean number of fluorescent vesicles per cell.\nUse appropriate statistical methods to analyze the quantified results.\n3. ATP internalization in tumors, ex vivo (Figure 3)\nimgsrc://cloudfront.jove.com/files/ftp_upload/62768/62768fig03.jpg\nFigure 3: In vivo procedure to examine ATP internalization. Schematic representation of the protocol to visualize the internalization of extracellular ATP in tumor xenografts using cryosectioning and fluorescence microscopy. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/62768/62768fig03large.jpg]\nPreparation of cell cultures for implantation\n\t\nGrow cancer cells to 80% confluence at 37 °C in a 225 cm2 flask, using DMEM supplemented with FBS, to a final concentration of 10% (v/v) and penicillin/streptomycin at 1% (v/v).\nWash the cells two times with 10 mL of PBS. Pre-warm 0.25% trypsin/EDTA to 37 °C. Add 8 mL of trypsin/EDTA and incubate at 37 °C for 2 min.\nOnce the cells start detaching from the bottom of the flask, use a 10 mL sterile serological pipette to add 8 mL of DMEM/FBS. Aspirate two times to dislodge any adherent cells. Use the pipette to transfer the detached cells from the flask into a 50 mL conical tube.\nAdd 10 mL of DMEM/FBS using a 10 mL pipette, and collect all remaining floating cells in the same 50 mL conical tube.\nCentrifuge the cell suspension at 600 × g, 4 °C for 4 min. Remove the supernatant and resuspend the cells in 1 mL of ice-cold PBS.",
    "Count the cell density using a hemocytometer. Keep the cell suspension on ice while counting.\nCentrifuge the cell suspension at 600 × g, 4 °C for 4 min. Remove the supernatant and suspend the cells in ice-cold PBS such that the cell density becomes 5 × 106 cells per 100 µL of PBS. Transfer the cell suspension to a 1.5 mL microcentrifuge tube.\nSubcutaneous injection of cancer cells for xenograft tumor development\n\t\nUse a latex-free syringe (1 mL) with a precision glide needle (27 G needle) for cancer cell injection.\nTransfer the cell suspension (5 × 106 in 100 µL of PBS)to a 1.5mL microcentrifuge tube. Draw the cells into the syringe.\nSelect an injection site on the flank of an immunodeficient (nude) mouse, and gently clean the skin using 75% ethanol. Wipe off excess ethanol with a delicate task wipe.\nFor subcutaneous injection, hold the needle at an approximately 10° angle to the skin. Insert the needle tip, bevel side up, just underneath the skin, so that only 1-2 mm of the needle is visible outside the skin. Dispense the cells from the syringe slowly over approximately 10 s.\nAfter injecting the entire volume, continue to hold the needle in place for 3-5 s, then withdraw the needle and use a finger to apply gentle but firm pressure to the injection site for 3-5 more seconds to prevent leaking of the injected content.\nMonitor and measure tumor growth using vernier calipers until the tumors reach a volume of 200-500 mm3.\nPreparation of HMWFD and NHF-ATP solutions to be used post-tumor resection",
    "Dissolve 300 µL of 16 mg/mL HMWFD in serum-free DMEM (culture medium), incubate in a 37 °C water bath for 30 min, and centrifuge at 12,000 × g for 5 min as described above. Transfer the solution to a 1.5 mL microcentrifuge tube.\nAdd 40 µL of NHF-ATP analog stock (1 mM) to 160 µL of serum-free DMEM to prepare a 0.2 mM NHF-ATP solution.\nPreparation of experimental wells\n\t​NOTE: This experimental design will assay the intracellular internalization of HMWFD + NHF-ATP, indicative of uptake by macropinosomes.\n\t\nPrepare the wells as follows: Well #1, Control: 200 µL of serum-free DMEM; Well #2, Control: 100 µL of 16 mg/mL LMWFD + 100 µL of serum-free DMEM = 200 µL of 8 mg/mL LMWFD; Well #3, Control: 100 µL of 0.2 mM NHF-ATP + 100 µL of serum-free DMEM = 200 µL of 0.1 mM NHF-ATP; Well #4; Experimental: 100 µL of 16 mg/mL HMWFD + 100 µL of 0.2mM NHF-ATP = 200 µL of 0.1 mM NHF-ATP and 8 mg/mL HMWFD.\nPreparation of tumor tissues\n\t\nEuthanize the mouse by cervical dislocation or according to the IACUC-approved protocol.\nUse a size 10 scalpel to slice the isolated tumors at a thickness of ~500-1,000 µm.\nIncubate the tumor slices in serum-free DMEM supplemented with 100 µM NHF-ATP and/or 8 mg/mL H/LMWFD in microcentrifuge tubes for 40 min at 37 °C with 5% CO2 flow.\n\t\tNOTE: After incubation, tumor tissue metabolism causes the color of the medium to change.\nRinse the tissues in 37 °C prewarmed PBS (2 mL for each rinse in a 24-well plate).\nTransfer the tissue to a new 24-well plate with prewarmed fresh PBS, rinse and repeat four times with gentle shaking.\nCryo-embedding (preparing frozen tissue blocks)",
    "Prepare identification labels for each tumor to be harvested. Cut a 2 cm piece of laboratory tape and fold in half, adhesive sides together, lengthwise. Use a marking pen to label the tag, e.g., with a mouse/tumor identification number.\nPrepare embedding molds by placing stainless steel tissue molds directly on dry ice.\n\t\t​NOTE: Dry ice may cause frostbite, burns, and asphyxiation. Wear insulated gloves when handling dry ice. Use dry ice in a well-ventilated area. Do not store dry ice in a tightly sealed container. Instead, store in a container (such as a Styrofoam cooler) that allows gas to escape.\nWhile the mold chills, place a small pool of tissue-freezing medium into a 10 mm tissue culture plate. Ensure that the volume is enough to submerge the tumor tissue that will be harvested.\nUse a perforated spoon to scoop up the resected tumor tissue and immediately place the tissue into a freezing medium, ensuring that the tissue is submerged. Using the perforated spoon, gently roll the tissue in the freezing medium, ensuring that the medium is bathing all the tissue surfaces.\nCarefully move the tissue into the embedding mold containing the freezing medium. Place the corresponding label tag vertically into the freezing medium/mold to freeze in place. Ensure the written label is visible outside of the medium.\nWhen the freezing is complete (freezing medium turns opaque-white), remove the tissue block from the mold, place it on dry ice, and repeat for each tumor. Store the tissue blocks at -80 °C for several months before the cryosectioning procedure.\nPreparation of slides of tissues samples\n\t\nTo maximize the chance of finding internalization-positive cells and having more representative tissue regions, collect serial cryosections at -18 to -20 °C using a cryostat.",
    "Prechill cryostat tools (blade, razor blade, anti-roll plate, tissue chuck holder, paintbrush) and equilibrate the tumor tissue blocks by placing them in a cryostat chamber at -18 to -20 °C. Set the blade holder angle to 5-10°. Carefully trim the tissue block, as needed, with a razor blade, and mount it onto the chuck holder using tissue freezing medium as \"glue.\"\nLock the chuck holder into the vertical position on the microtome unit, which advances to the set distance (e.g., 10 µm) with each turn of the hand crank. Position the anti-roll plate to rest just above the height of the blade. To prevent tissue curling before advancing the microtome, carefully slide the thumb over the bottom edge of the tissue block.\nAs the microtome advances and the tissue section falls onto the metal plate, use a paintbrush to guide the tissue section and unroll the tissue, if necessary.\nHover the microscope slide over the tissue section without touching so that the section will be attracted to the slide.\n\t\t\tNOTE: Cryostat blades (high-profile, disposable) are extremely sharp and can cause serious injury. Use care when handling blades and operating the cryostat. Use a blade protector, if available. Proper training is required.\nSlice the tumor into sections of 10 µm thickness. Immediately transfer the sliced sections onto a positively charged glass microscope slide.\n\t\t\tNOTE: For serial sections, first collect a 10 µm-thick section onto the upper left corner of each of eight positively charged slides. Advance the cryostat through subsequent 100-200 µm of tissue, and discard the tissue. Immediately transfer all sliced sections onto glass microscope slides.",
    "Next, collect another 10 µm-thick section, next to the previously placed tissue section, for each of the eight slides. Repeat this serial collection process until each of the eight slides contains eight tissue sections, each 100-200 µm apart. Keep the tissue sections in the dark to preserve fluorescence.\n\t\t\t​NOTE: Tissue sections on slides can be stored in a slide box at -80 °C for several months.\nFixation of tissue slides\n\t\nCRITICAL STEP: Fix the tissue sections in 95% ethanol at -18 to -20 °C to for 5 min.\nWash the fixed section for 5 min with room temperature PBS, and then mount the fixed tumor sections under a glass coverslip using 10 µL of an aqueous mounting medium with DAPI.\nTwelve to 24 h after mounting, examine the fixed tumor sections by fluorescence microscopy and acquire images, as described for the cultured cells above.\nFluorescence microscopy and image acquisition\n\t\nIdentify regions of interest and acquire images, as described in section 2.6.\nData quantification and analysis\n\t\nQuantify the cells and apply appropriate statistical analyses, as in section 2.7.\n4. ATP internalization in tumors, in vivo\nPrepare cell cultures for implantation as described in section 3.1.\nSubcutaneous injection of cancer cells for xenograft tumor development\n\t\nGenerate xenografted tumors as described in section 3.2.\nATP and/or dextran injection into xenograft tumors\n\t\nPrepare the treatment solutions of DMEM (vehicle) or 8 mg/mL HMWFD or LMWFD, with or without NHF-ATP (100 µM) in DMEM, as described above.\nUse a 1 mL syringe to collect 50 µL of one treatment solution and inject the solution directly into each xenograft tumor. Repeat the procedure for four biological replicates of each treatment.\nTissue harvest and cryo-embedding",
    "Prepare identification labels for each tumor to be harvested. Cut a 2 cm piece of laboratory tape and fold in half, adhesive sides together, lengthwise. Use a marking pen to label the tag, e.g., with a mouse/tumor identification number.\nApproximately 5 min post-injection, euthanize the mouse by cervical dislocation or according to the IACUC approved protocol.\nUsing a size 10 scalpel, make an incision adjacent to the tumor and approximately perpendicular to the direction of the needle injection. Use forceps and surgical scissors to resect the tumor tissue from the surrounding tissue.\nDivide the tumor into two to four 1 cm2 pieces, depending on the total tumor size.\nPrepare the embedding molds and embed the tissue, as described above in section 3.6. Ensure that harvest time, from intratumoral dextran injection to cryo-embedding, is no more than 7-8 min.\nPreparation of slides of tissues samples\n\t\nCollect serial tumor sections, as described in section 3.7.\nFixation of tissue slides\n\t\nFix the tissue, as described in section 3.8.\nFluorescence microscopy and image acquisition\n\t\nIdentify the regions of interest and acquire images, as described in section 2.6.\nData quantification and analysis\n\t\nQuantify the cells and apply appropriate statistical analyses, as described in section 2.7.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}