{
  "id": 13317,
  "origin_website": "Jove",
  "title": "Mapping the Emergent Spatial Organization of Mammalian Cells using Micropatterns and Quantitative Imaging",
  "procedures": [
    "NOTE: An overview of the method is provided in Figure 1.\n1. Mask design\nDesign the photomask according to the guidelines described in Azioune et al.18. See the Table of Materials for a reference to the software and mask manufacturer used for this study.\n\tNOTE: Multiple geometries, sizes or spacing between shapes can be created on one mask. The UV lamp can fit a 15 cm photomask which may contain up to 49 different designs (assuming 2 cm x 2 cm chips).\n2. Micropattern manufacturing procedure\nPrepare the necessary materials.\n\t\nPrepare a solution of 0.1% poloxamer 407 (10 mg for 10 mL) in phosphate buffered saline (PBS) and leave on a shaker at room temperature. The poloxamer 407 will take about 20 min to dissolve.\nLay laboratory film (see the Table of Materials) in the bottom of a 10 cm square Petri dish. This will be used as the chamber for matrix deposition.\nClean the surface of the photomask, first with 100% acetone, then with 100% isopropanol and finally with ddH2O. If possible, air dry the photomask or otherwise dry the mask with clean paper towel.\nPrepare a square, rigid and opaque piece of plastic with the exact same size as the photomask (later on referred as ‘holder’).\n\t\tNOTE: This will be used to maintain plastic coverslips in contact with the photomask during the illumination step.\nTurn the UVO lamp on and run a warming illumination for 10 min.\nCreate photopatterned chips.\n\tNOTE: It is possible to adapt the procedure to create chips of any desired size. For simplicity, we describe here the procedure to generate a 12 mm round micropatterned chip.\n\t\nUsing a 12 mm hole punch, cut hydrophobic plastic slides to create 12 mm round coverslips and place them in a clean new Petri dish.",
    "CAUTION: Use gloves at all time to avoid skin contact with the surface of the plastic as this may damage the surface treatment.\nCarefully remove the protective film from the coverslips with tweezers.\n\t\tNOTE: Avoid damaging the plastic surface as this may influence the placement of the cells on the chip during the seeding procedure (section 3).\nPlace the photomask on a clean and stable surface (e.g., photomask box), chrome side facing up, and add a 2 µL drop of ddH2O at the position of the desired chip design.\nLay a coverslip onto the drop of ddH2O and press gently.\n\t\tNOTE: Ensure that the plastic side which faces the photomask is the side which was protected by the film that was removed in the earlier step.\nPlace the holder on top of the plastic slides and carefully fix this sandwich with clamps in order to maintain the plastic pieces in contact with the photomask.\n\t\tNOTE: Place the clamps as close as possible to the location of the plastic slides in order to ensure that the plastic slides are perfectly maintained in contact with the surface of the photomask.\nPlace the assembly in the UVO lamp at approximately 2 cm from the light source and illuminate for 10 min.\n\t\tNOTE: The power of the light is estimated to be 6 mW/cm2 at 254 nm of wavelength when the chip is placed at a distance of 2 cm from the source.\nHold the sandwich with the photomask at the bottom and carefully remove the clamps while maintaining pressure with one hand to prevent the slides from moving about while disassembling the sandwich. Remove the holder, ensuring that all plastic pieces are still on the mask and not stuck to the holder.",
    "Add ddH2O on top of the chips and gently detach the chips from the photomask.\n\t\tNOTE: If the plastic chip is stuck to the photomask, detach the chip using a plastic pipette tip to push the chip while holding tweezers slightly above the chip in case the chip detaches suddenly.\nFinally, place the photopatterned chips within the matrix deposition chamber.\n\t\tNOTE: Ensure that the illuminated side of the chip is facing upwards.\nDeposit the matrix.\n\tNOTE: All procedure in this section should be performed in a tissue culture hood.\n\t\nFilter the poloxamer 407 solution through a 0.22 µm polyethersulfone (PES) filter.\nPrepare the ECM coating solution by mixing 500 μg/mL of sterile filtered poloxamer 407 and 1 mg/mL of gelatin.\n\t\tNOTE: See also Table 1 for additional information regarding other possible ECM molecules.\nAdd 200 µL of the coating solution onto each illuminated chip. The laboratory film will prevent the drop from falling outside of the chip.\nAdd a 3 cm Petri dish filled with ddH2O in order to limit evaporation and place it with the chip at 4 °C overnight.\n3. Seeding procedure\nNOTE: The steps described below have been optimized for CGR8 mouse embryonic stem cells (mESC)24 using standard mESC medium (see also the Table of Materials). However, it is possible in principle to adapt the procedure for any cell type. Note also that conventional cell culture of mouse embryonic stem cells is not described here as extensive documentation can be found elsewhere25.\nAspirate the coating solution and incubate the chips twice for at least 5 min with sterile PBS.\nIn the meantime, prepare a cell suspension of 5.5 x 105 cells/mL in warm medium.\nPipet 200 µL of cell suspension onto each chip (~100,000 cells/cm2).",
    "Close the seeding chamber and leave the cells to adhere for 1 h in the incubator.\nAfter 1 h, fill the wells of a multiwell plate (4-well or 24-well plate depending on the number of chips) with 500 µL/well of warm medium and transfer the chips into the plate with sterile tweezers.\nShake the plate vigorously in order to detach non-adherent cells. Aspirate the medium and immediately replace with fresh warm medium. Check under the microscope to see if patterning is visible (Figure 2a).\n\tNOTE: Adhesion time may need to be optimized when using cell lines other than mESC or other matrix proteins (see also Table 2).\nRepeat this step until patterns become clearly visible as shown in Figure 2a.\n\tNOTE: This step is critical and determines the success of the procedure. A washing procedure which is too intense may detach the cells, in contrast insufficient washing may result in cells remaining attached in between the patterns (Figure 2c,d).\n4. Fixation\nNOTE: After 48 h in culture the cells should form dense colonies which rigorously follow the shape of the patterns (as shown in Figure 2b).\nLeaving the chips in the plate, remove ~90% of the medium, leaving just enough medium to prevent the chips from drying.\n\tNOTE: It is important that the chip never dries to avoid staining artefacts and to prevent cell detachment from the surface. Due to the hydrophobicity of the chip surface between adhesive patterns, the chip may have a tendency to de-wet. At this stage, the fixative may cause large domed colonies to detach from the chip. Washes should be very gentle, ideally performed by pipetting liquid on the side of the well and not directly onto the chip.",
    "Add at least 500 µL of paraformaldehyde (PFA)-based fixation solution per well and incubate for 10 min.\n\tNOTE: If colonies appear particularly thick (more than 5 cell layers), it may be necessary to adjust fixation time to 20 min.\nAfter fixation, wash 3 times with the washing solution (PBS with 0.01% poloxamer 407). An extra wash using 50 mM NH4Cl diluted in washing solution may be intercalated to quench residual PFA cross-linking activity.\nIncubate the samples for at least 30 min in blocking solution.\n\tNOTE: At this stage, samples may be stored at 4 °C for about a week prior to staining. If so, seal the plate with laboratory film to prevent evaporation.\n5. Immunostaining\nPrepare a staining chamber by placing a sheet of laboratory film in the bottom of a 10 cm square Petri dish.\nPrepare antibody solutions (See Table 3 for a list of antibodies and dilutions used in this article).\nPlace the chip into the staining chamber with the side supporting the cells facing upwards and immediately add 100 µL of primary antibody solution onto the chip.\n\tCAUTION: At this stage, chips should not easily de-wet as in step 4.1. However, care should still be taken because it is important that the chips do not dry. If multiple chips have to be processed, apply step 5.3 to each chip sequentially.\nIncubate for 1 h on a rotating platform at room temperature.\n\tNOTE: If the cells have formed large 3D structures, a longer incubation time may be required to allow for uniform staining of the sample. Incubation time may be increased up to 24 h. However, the staining chamber must contain a 3 cm dish filled with water and the staining chamber must be sealed with laboratory film to prevent evaporation.",
    "Transfer the chips into a fresh multiwell plate and wash 3 times with the washing solution.\nPerform incubation with secondary antibodies as described in step 5.3 and 5.4.\nMount the chip on a microscopy slide using 20 µL of any standard mounting medium (e.g., Mowiol).\n6. Imaging\nNOTE: Imaging can be performed on a standard confocal microscope. Here we only provide recommendations to ensure an image quality which will be sufficient for the subsequent quantitative analysis.\nCAUTION: To avoid any operator bias, the colonies to image should only be chosen using the nuclear envelope signal (to see if a colony properly follows the shape of the pattern). Avoid checking the signal of markers of interest except when adjusting microscope settings.\nEnsure that the acquisition bit depth is 12 or 16 bits.\nIdentify the appropriate settings to maximize the dynamic range for each image channel. In particular, avoid image clipping.\nInclude a channel to image the micropattern autofluorescence (see Figure 3).\nAdjust Image size and zoom factor to obtain voxel sizes ranging between 0.1 and 0.6 µm in the x- and y-axes and ranging between 0.2 and 2 µm in the z-axis.\n\tNOTE: For example, in this study, we used an inverted scanning confocal microscope with a 40x objective (numerical aperture equal to 1.3), an image size of 1024 x 1024 pixels without digital zoom and a z-step size of 0.5 μm. This resulted in a voxel size of 0.38 µm x 0.38 µm x 0.5 μm.\nFor each colony, define the minimum and maximum position along the z-axis to ensure that the entire colony is acquired. At least one plane with low to no signal should be included below and above the colony.\nEnsure that z-stack orientations are acquired consistently (either always top to bottom or always bottom to top)",
    "Adjust the scanning speed, image resolution, frame averaging, and detector gains to identify an optimum between image quality and imaging time. As an indication, imaging time for one colony as shown in Figure 3 was approximately 2–3 min. Perform the image acquisition.\n\tCAUTION: All images, in order to be comparable, must be acquired on the same microscope with the same objective and acquisition settings.\nAt the end of the acquisition, save all the images and assign a unique naming convention to identify the experimental condition that each image represents.\n\tNOTE: See Figure 4 as an example, this convention will be used later during the analysis procedure. Note that images may be saved to any format that is supported by BioFormats 26. If colonies are larger than the field of view, the stitching plugin of ImageJ may be used27. Note also that in case of stitching, illumination roll off correction might be necessary.\n7. Image analysis\nNOTE: The recommended computer specifications for this procedure is: 16 GB RAM, a multi-core 3.33 GHz CPU, and at least 50 GB of disk space (or more depending on the number of chips that have been imaged). The software has been tested on Linux, Windows and MacOS. PickCells is a cross-platform image analysis application with a graphic user interface dedicated to the analysis of the collective organization of the cells in complex multidimensional images (Blin et al, in preparation). Note that more information on PickCells as well as documentation for the specific modules mentioned here can be found online: https://pickcellslab.frama.io/docs/. Note also that the interface is subject to change as we keep improving the software. If the interface differs from what is shown in the figure or video, please refer to the online manual.\nInstall and run PickCells following the documentation available online.",
    "Import images and verify the accuracy of the provided information (Figure 4-1).\nDocument the name of each channel.\nSegment nuclei based on the nuclear envelope signal using the Nessys module28 (Figure 4-2) and provide a prefix (“nuclei” for example) which will be used to name the generated segmented images.\n\tNOTE: Documentations about usage and parameter adjustments can be found at https://framagit.org/pickcellslab/nessys.\nInspect and edit segmentations if necessary, using the segmentation editor module (Figure 4-3)\n\tNOTE: If for any reason the segmentation process did not provide satisfactory results, manually delete images in the database folder and also delete the ‘segmentation result’ node in the MetaModel View. Then, repeat step 7.4 and 7.5. If the segmentation of only a small subset of images did not provide satisfactory results, then use the Nessys standalone application (see the link in 7.4), attempt segmentation on the ‘faulty images’ and replace the corresponding file in the database folder).\nSegment the pattern autofluorescence signal using the basic segmentation module (Figure 4-4)\n\t\nProvide a prefix (“pattern” for example) which will be used to name the generated segmented images.\nSelect the channel containing the autofluorescence signal.\nApply noise reduction; generally using a gaussian filter with a kernel size of 10 x 10 x 0.5 voxels gives satisfactory results.\nSet the lower threshold so that the background appears in blue while the foreground appears white. Set also the upper threshold to its maximum value to avoid high intensities being excluded from the final result (red areas).\nSelect skip for the last step.\nClick finish and wait till all images are processed.\nAs for nuclei, segmentation results can now be visually inspected and corrected if necessary using the segmentation editor module (Figure 4-5).\nCreate nuclei objects and compute basic object features.",
    "Launch the intrinsic features module from the task bar on the left of the main interface (Figure 4-6).\nClose the Ellipsoid Fitter and Surface Extractor panels to keep only the Basic Features panel open.\nChoose Nucleus as object type and choose the prefix given in step 7.4 for “segmented images”.\nPress Compute and wait till all the images have been processed.\n\t\tNOTE: After this step, it will not be possible to edit the nuclei segmentations again.\nCreate pattern objects and compute basic object features. Repeat steps 7.8.1 to 7.8.4, only this time choose Custom Type as object type and the prefix given in step 7.6.1 for segmented images.\n\tNOTE: After this step, it will not be possible to edit the pattern segmentations again.\nStore the name of the image each nucleus belongs to as a nucleus attribute.\n\t\nClick on Data > New Attribute and select Nucleus in the popup dialog and click Ok.\nSelect Collect data from other objects connected to the node and click Next.\nIn the left panel, select Image and then double click on the interrogation mark under the Finish flag in the Path definition panel to set the image node as target of the path.\nExpand the Available Attributes pane on the left panel and select the name attribute.\nExpand the Reduction operation pane and select Get One, then click on the change button and click Next.\nType “Image Name”, press the tab key and click OK.\nCreate a “normalised coordinate” attribute in nuclei objects (Figure 4-7).\n\t\nAdapt steps 7.10.1 to 7.10.6 to store the coordinates of the pattern centroid as a nucleus attribute. Name this new attribute “Pattern Coordinate”.\nThen, click on Data > New Attribute, select Nucleus and click Ok.",
    "Select Define a function between spatial or directional vectors of the node and click Next.\nFor Type of function select Array Operation, for V1 select Item Vector and then Centroid, and for V2 select Item Vector and then Pattern Coordinate.\nClick Next, Type “Normalised Coordinate” in the Name field and click Finish.\nExport the data to a tab separated value file.\n8. R analysis\nDownload and install Rstudio.\n\tNOTE: Software information and download links are available at https://www.rstudio.com/.\nDownload the R scripts required for this analysis.\n\tNOTE: Scripts can be downloaded from the GitLab repository: https://framagit.org/pickcellslab/hexmapr.\nOpen Rstudio.\n\tNOTE: If running the scripts for the first time, install the required R packages (ggplot2 and scales).\nFrom Rstudio, open the binnedmap_template.R script.\nSet the working directory to the source file location.\nFollow instructions provided in the script to adapt the script to any given dataset in order to obtain spatial maps as shown in Figure 5.\nRun the script to generate density maps."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}