{
  "id": 13261,
  "origin_website": "Jove",
  "title": "An Enhanced Green Fluorescence Protein-based Assay for Studying Neurite Outgrowth in Primary Neurons",
  "procedures": [
    "All procedures followed were in accordance with the ethical standards of the animal experimentation ethics committee of the Chinese University of Hong Kong.\n1. Preparation of Coverslips\nPlace a sterile 18 mm circular coverslip into each well of a 12-well tissue culture plate.\nCoat the coverslip with 5 µg/mL poly-D-lysine solution in a humidified 37 °C incubator for at least 1 h.\nAspirate the poly-D-lysine solution from the tissue culture plate and rinse the coated coverslips once with sterile water.\n2. Rat Embryonic Neuron Dissection\nSacrifice a timed-pregnant Sprague-Dawley rat at a gestational age of 18 days (E18) by either cervical dislocation or CO2 asphyxiation.\nNOTE: Please check local regulations for the sacrifice of pregnant rats.\nOpen the abdominal cavity of the pregnant rat with dissecting scissors and transfer the uterus to a 10 cm Petri dish.\nOpen the uterus and the amniotic sac carefully with small dissecting scissors and remove the placenta from the rat embryo using small dissecting scissors. Transfer the whole embryo to a 10 cm Petri dish with pre-chilled phosphate buffered saline supplemented with glucose (PBS-glucose, 10 mM sodium phosphates, 2.68 mM potassium chloride, 140 mM sodium chloride and 3 g/L glucose) using a pair of small forceps.\nCut along the sagittal suture of the skull and open it carefully with a pair of small dissecting scissors. Transfer the embryonic brain with a small flat spatula to a 10 cm Petri dish with ice-cold PBS-glucose.\nSeparate the two cerebral hemispheres from the cerebellum and brain stem using two #5 tweezers under a dissection microscope.\nNOTE: Please see reference12 for the structure of the rat brain.\nRemove the meninges using the #5 tweezers.\nIsolate the cortex from the cerebral hemispheres with two straight #5 tweezers.",
    "Transfer the isolated cortex to ice-cold PBS-glucose in a 15 mL centrifuge tube.\n3. Primary Cortical Neuron Culture\nNOTE: All procedures in steps 3 and 4 are performed inside a Class II Biosafety cabinet.\nSettle the isolated cortex by gravity at 4 °C for 5 min and aspirate the PBS-glucose.\nAdd 1 mL of 0.05% Trypsin-EDTA to the isolated cortex and mix gently by tapping and incubate the tissue in a 37 °C water bath for 10 min to allow enzymatic digestion. Tap the tube gently to mixing every 2 min.\nAdd 4 mL of maintenance medium (e.g., Neurobasal Medium) to the tissue/trypsin mixture.\nNOTE: All the maintenance medium used in this protocol is supplemented with Penicillin-Streptomycin and B-27 supplement13.\nDissociate the tissue gently by trituration using a 1 mL pipette.\nPellet the dissociated cells by centrifugation at 200 x g for 5 min. Aspirate the supernatant.\nRepeat steps 3.5 to 3.7 twice.\nResuspend the cell pellet in 1 mL of maintenance medium.\nAdd 10 µL of 0.4% Trypan Blue solution to 10 µL of cell suspension for counting of viable cells by a hemocytometer.\nPlate the neurons at a density of 65,000/cm2 (viable cells) in 1 mL of maintenance medium per well in a 12-well plate.\n4. Cell Transfection and Fixation\nAt 2 days in vitro (DIV2), transfect 0.5 µg of EGFP construct (pEGFP-C1) to neurons together either with or without of 0.5 µg of POI by using 1 µL of transfection reagent (e.g., Lipofectamine 2000). Use manufacturer's instructions.\nNOTE: Mammalian expression constructs were prepared by using an endotoxin free plasmid preparation kit. Treatment with chemicals/molecules (in this manuscript cytochalasin D (Cyto D) and nerve growth factor (NGF) were used) can be done at 6 h after transfection.",
    "Aspirate the culture medium 24 h post-transfection and wash the transfected cells once with 37 °C PBS (10 mM sodium phosphates, 2.68 mM potassium chloride, 140 mM sodium chloride).\nFix the cells with 4% paraformaldehyde in PBS for 10 min in the dark at room temperature.\nWash the fixed cells three times with PBS.\nAdd a minimal amount of fluorescence mounting medium on a microscope glass slide. Carefully transfer the coverslip from the 12-well plate onto the mounting medium with the sample facing the glass slide.\nNOTE: Seal the edge of the coverslip with nail polish if an aqueous mounting medium is used.\n5. Measurement of Neurite Outgrowth\nUse a 40x objective for capturing images using an epi-fluorescent microscope.\nCapture images from at least 40 intact neurons with EGFP signal per transfection.\nOpen the captured image in ImageJ software with the NeuronJ plugin11 to measure the length of the longest neurite, from the cell body to the tip of the growth cone, of each imaged neuron.\nAnalyze the data obtained with the software to determine the effect of the targeted proteins in neurite outgrowth.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}