{
  "id": 18084,
  "origin_website": "Jove",
  "title": "A Protocol to Acquire the Degenerative Tenocyte from Humans",
  "procedures": [
    "The protocol was conducted in accordance with the Declaration of Helsinki and the protocol was approved by the Institutional Review Board at CHA Bundang Medical Center.\n1. Degenerative Tendon Tissue Harvest from the Patient\nDiagnose lateral epicondylitis by taking a medical history and using physical exam findings: tenderness over the tendinous origin close to the lateral epicondyle; pain evoked by resisted extension of the wrist joint.\nUse the following inclusion criteria: over 18 years of age; a history of lateral epicondylitis for a minimum of six months; recalcitrant for non-operative treatment; at least three months have passed since injection of corticosteroid, platelet rich plasma, or botulinum toxin\nExclude the following: pregnant women; patients with a history of cervical spine disease, elbow arthritis, rheumatologic disease, surgery around elbow, and nerve entrapment syndrome; patients refusing to donate tissue.\nSurgical technique\n\t​NOTE: See Figure 124.\n\t\nAfter general anesthesia by isoflurane and endotracheal intubation, put the arm on the table and apply a tourniquet. Then apply betadine agent on the whole arm and drape with an aseptic surgical sheet.\nExpose the lateral elbow through a 3–5 cm incision with No. 15 surgical scalpel blade just anteromedial to the lateral epicondyle and proximal to the level of the joint.\nVisually identify the extensor carpi radialis longus (ECRL) and extensor aponeurosis interface and make a splitting incision 2–3 mm in depth between the ECRL and extensor aponeurosis with a No. 15 surgical scalpel blade at the identified interface.\nExtract the ECRL anteriorly, which will bring the pathologic extensor carpi radialis longus brevis (ECRB) origin below into direct view.\nVisually identify the pathologic degenerative tissue by its characteristic dull grayish color and usually edematous and friable tissue.\nAfter identification, carefully resect all degenerative tissue sharply using No. 15 surgical scalpel and mini-blades.",
    "Embed the resected tissue (about 1 cm3) into phosphate buffered saline (PBS) immediately and remove all the surrounding tissue except tendon tissue carefully into about 10 mL of PBS as soon as possible.\nIn cases with bony exostosis at the lateral epicondyle, remove exostosis using a rongeur and smoothen it with a rasp. Make multiple drill holes (diameter 1.6 mm, about 6–8 holes) in the anterolateral condyle to enhance vascular supply. This is optional.\nClose the wound layer by layer using non-absorbable suture material.\nHealthy control tenocyte\nObtain healthy tenocytes from the remaining tendon of the auto-hamstring or auto-patella tendon during anterior cruciate ligament reconstruction, and use it as the control for the following experiment25.\n\t\tNOTE: The number of samples used in this study were three in each group.\n2. Histology\nStore about half of the harvested tissue in neutral buffered 10% formalin in a chemical fume hood or equivalent.\nEmbed the tissue in a paraffin block (4–5 mL) and section it in 4–5 µm sections coronally.\nStain sections from control and degenerative tendon with Hematoxylin and Eosin stain (H&E) and Alcian blue stain at a pH of 2.5. Perform H&E staining in an automated stain machine as follows.\nDeparaffinize using xylene (3 times, 5 min, respectively).\nHydrate from graded alcohols to water (100% alcohol, 4 min; 100% alcohol, 3 min; 95% alcohol, 2 min; 70% alcohol, 1 min; water, 2 min).\nStain in Hematoxylin for 5 min. Wash well in water for 2 min.\nDifferentiate in 1% acid alcohol (1% HCl in 70% alcohol) for 3 s. Wash well in water for 3 min.\nNeutralize HCl by dipping in an 0.5% ammonia for 10 s, followed by a 3 min water wash.\nStain in Eosion for 5 min.",
    "Dehydrate through alcohols (80% alcohol, 30 s; 95% alcohol, 1 min; 100% alcohol 1 min, 100% alcohol 2 min).\nClear in xylene (3 times, 2 min, 2 min, and 3 min, respectively).\nMount with a cover slide.\nPerform immunohistochemitry (IHC) using the Bond Polymer Refine Detection kit according to the manufacturer's instructions with minor modifications.\nAfter deparaffinization using xylene, perform an antigen retrieval procedure using Bond Epitope Retrieval Solution for 30 min at 100 °C. The Bond Epitope Retrieval Solution contains a citrate based buffer and surfactant (1 L, pH 5.9–6.1).\nQuench endogenous peroxidases by incubating the tissue with hydrogen peroxide for 5 min.\nIncubate the sections for 15 min at an ambient temperature (21-22 °C) with primary antibodies against vascular endothelial growth factor (VEGF) (1:200), tenomodulin (1:200), or mohawk (1:200).\nPerform secondary antibody tagging with a biotin-free polymeric horseradish peroxidase-linker antibody conjugate system.\n\t\t\nUse secondary rabbit anti mouse IgG in 10% (v/v) animal serum in Tris-buffered saline/0.09% 2-Methyl-4-isothiazolin-3-one solution to localize mouse antibodies.\nUse polymer anti-rabbit Poly-HRP-IgG (<25 µg/mL) containing 10% (v/v) animal serum in Tris-buffered saline/0.09% to localize rabbit antibodies.\nUse 3,3'-Diaminobenzidine tetrahydrochloride hydrate in a stabilizer solution to visualize the complex via a brown precipitate.\nCounterstain with <0.1% hematoxylin (blue) to visualize the cell nuclei.\nObserve the slides stained with H&E, Alcian blue stains, and IHC for VEGF, tenomodulin, and mohawk under light microscope and obtain representative microscopic images of each slide under one high power field (400X).\n3. Tenocyte Culture\nTissue preparation\nPrepare the tendon sample by removing all the surrounding tissue thoroughly with micro-scissors and forceps.\nWash with PBS and mince into small pieces (about 1 mm3 or less).\nDigest tissue for 1 h in 30 mL of Dulbecco's Modified Eagle's Medium (DMEM) supplemented with 30 mg/mL Collagenase II at 37 °C.",
    "Pass cells through a 100 µm cell strainer.\nDeactivate Collagenase II by adding 1 mL of fetal bovine serum (FBS).\nCentrifuge at 196 x g for 5 min.\nCell culture\nSeed 3 x 105 cells into a 100 mm dish and culture with DMEM supplemented with 10% FBS and 1% Antibiotic-Antimycotic solution at 37 °C in a 5% CO2 incubator for 1 week.\nChange the culture medium every three days until 80% confluence occurs. Culture both healthy control and degenerative cell samples until passage four and use for experiment.\n4. Immunocytochemistry (ICC)\nTransfer 200 µL of cultured cell (2 x 105 cells) to the eight wells of a chamber slide and grow the cells to confluence with the addition of fresh media for 1 day.\nWash the cells with PBS and fix with 500 µL of 4% formaldehyde per well.\nIncubate the slides with 0.5% Triton X-100 in PBS for 10 min for permeabilization of the membranes.\nBlock in PBS with 1% bovine serum albumin and 0.05% TWEEN-20 for mohawk and tenomodulin, respectively.\nIncubate in the dark with mouse anti-mohawk monoclonal antibody (1:100 dilution) and goat anti-tenomodulin antibody (1:100 dilution) at 4 °C overnight.\nIncubate the secondary antibodies (Alexa 555-anti goat (1:200) for tenomodulin; Alexa 488-anti mouse (1:200) for mohawk) in the dark for 1 h at room temperature.\nMount with 0.5 µL of a fluorescence mounting medium.\nAnalyze using a fluorescence microscope (400X).\n5. Proliferation Assay\nMeasure cell viabilities using water-soluble tetrazolium (WST)-1.\nSeed both healthy and degenerative cells into 96 well plates at a density of 2 x 103 cells per well for 24, 72, and 120 h.\nAfter incubation, add 10 µL of the 10% WST-1 solution to each well.\nIncubate the plates for 3 h at 37 °C in 5% CO2.",
    "Measure the optical densities at 450 nm using a microplate reader. Take readings at least three times at all time points for each sample.\nMeasure cellular DNA amount using the BrdU assay.\nSeed both healthy and degenerative cell into 96 well plates at a density of 2 x 103 cells per well for 24, 72, and 120 h.\nAfter incubation, add 10 µL of 10% BrdU solution to each well.\nIncubate the plates for 3 h at 37 °C in 5% CO2.\nAdd 100 µL/well of the Fixing/Denaturing Solution (60–70% ethanol, 0.1–0.5% sodium hydroxide) and keep the plate at room temperature for 30 min.\nAdd 100 µL/well prepared 1x detection antibody solution and keep the plate at room temperature for 1 h.\nRemove solution and wash plate three times with 1x Wash Buffer.\nAdd 100 µL/well prepared 1x HRP-conjugated secondary antibody solution and keep the plate at room temperature for 30 min.\nRemove the solution and wash plate three times with 1x Wash Buffer.\nAdd 100 µL of 50% TMB Substrate.\nIncubate for 30 min at room temperature.\nAdd 100 µL of STOP Solution.\nMeasure the optical densities at 450 nm using a microplate reader.\n\t\tNOTE: Take readings at least three times at all time points for each sample.\n6. Statistical Analysis\nCollect and analyze data using SPSS.\nDepict data by mean ± standard error of mean.\nUse Mann Whitney U test.\nConsider differences statistically significant when the p value is less than 0.05 (p <0.05).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}