{
  "id": 6460,
  "origin_website": "Bio",
  "title": "Separation of Natural Collagen Crosslinks Using Buffer and Ion-pairing Agent Free Solvents on Silica Hydride Column for Mass Spectrometry Detection",
  "procedures": [
    "Prepare the crosslink standards by serial dilution as shown in Table 2. Use water containing 0.1% formic acid as diluent and measure all volumes in μl and transfer them into amber autosampler vials. Notes: Different volumes can be used but you must use the same dilution factor.  The prepared crosslink standard can be stored at -20 °C for up to one year, however, always make one new standard to check the concentration of the frozen ones.  PYR and DPYR may degrade over time and their concentrations change by exposure to light, therefore always use amber autosampler vials and store them in the dark. Table 2. Standard concentrations in µM of crosslinks diluted by water containing 0.1% formic acidimgsrc:https://en-cdn.bio-protocol.org/attached/image/20190428/20190428014814_7548.jpg*Volume measured in μl.**D.F. is dilution factor. Set the temperature of the autosampler at 6 °C then place the vials in the autosampler.Use the following separation procedure on diamond hydride column:Flow rate of 0.3 ml/min.Note: Higher flow rates can be also used (0.4-0.6 ml/min) which will elute the crosslinks faster, however this may affect the resolution. Column temperature 25 °C.Use the following parameter for the mass spectrometry: Positive ion mode.Mass scans (100-700 m/z). Spray voltage 3,300 V. The capillary 320 °C.The probe heater temperatures 350 °C.Nitrogen gas set at flow rate of 10 L/min.Set the injection volume at 1.0 μl. Note: Injected volume can be adjusted up to 10.0 μl depending on the crosslink concentration in the sample. Solvent A is water and solvent B is 80% acetonitrile in water both containing 0.1% (v/v) formic acid (see Recipes).Use gradient elution program as below:Time: 0.00, %A 20% and %B 80%.Time 10.00, %A 60% and %B 40%.Time 15.00, %A 90% and %B 10%.Time 20.00, %A 20% and %B 80%.Use post run time of 10 min.",
    "Note: You must ensure that binary pump pressure reaches initial conditions, and this may differ depending on the void volume of the UHPLC instrument, usually 10 min will be enough. The typical separation chromatography of the standard is shown in Figure 1 and separation chromatography of the standard in Figure 2. You must inject a blank (water only) after every 10-20 injections, depending on the samples. Also you must wash the column every 100-150 samples with 50% methanol in water containing 0.1% formic acid with flow rate of 0.2 ml/min. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190428/20190428013854_5407.jpgFigure 1. Extracted Ion Chromatogram (EIC) of LNL, HLNL, DHLNL, HHL, PYR, DPYR, DES and HHMD standards. Insets show the extracted mass range of each crosslink.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190428/20190428013943_7922.jpgFigure 2. Extracted Ion Chromatogram (EIC) of LNL, HLNL, DHLNL, HHL, PYR, DPYR, DES and HHMD in skin hydrolysates (for the preparation of biological sample hydrolysates see Naffa et al., 2016 and Avery et al., 2009 for more details). Insets show the extracted mass range of each crosslink."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}