{
  "id": 6566,
  "origin_website": "Bio",
  "title": "A Radioactive <em>in vitro</em> ERK3 Kinase Assay",
  "procedures": [
    "This assay is performed by mixing ERK3 protein, purified substrate, 5 μCi [γ-32P]-ATP, and 30 μM non-radioactive ATP in a kinase reaction buffer that contains Mg2+. Fifty to one hundred nanograms of ERK3 protein purified from Sf9 cells or mammalian cells can be used per reaction. If using ERK3 protein purified from bacteria, a larger amount has to be used (500 ng-1 µg). It is best to do an initial optimization experiment using different amounts of the kinase to determine the kinase concentration appropriate for phosphorylating substrate. A catalytically-inactive (kinase-dead) mutant of ERK3 can serve as a negative control for the reaction. In addition, a reaction that lacks ERK3 would confirm the absence of contamination of the substrate with radioactive isotopes or co-purified kinases. As for all enzymatic assays, the amount of substrate used in each reaction has to be in excess so that it is not rate-limiting. Typically about 0.5-2 µg substrate is used per reaction.   After incubation of ERK3 with the substrate in the presence of ATP, the reaction is stopped by addition of sample buffer containing sodium dodecyl sulfate (SDS) followed by boiling. Reaction components are separated by gel electrophoresis. The gel is then stained with Coomassie blue solution, dried and visualized by autoradiography (Figure 1). imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190813/20190813010739_1137.jpgFigure 1. Outline of radioactive in vitro ERK3 kinase assaySteps of the procedure are described below:Prepare a 10x kinase reaction buffer stock (listed in Recipes), and dilute an appropriate volume as needed with deionized water to 1x concentration. Dilute ERK3 protein and each purified substrate in 1x reaction buffer such that 1 μl of each is used per reaction. For example, if 100 ng ERK3 protein and 1 μg MBP will be used in the assay, dilute ERK3 to 100 ng/μl, and MBP to 1 μg/μl using 1x reaction buffer.",
    "Note: It is recommended to store purified proteins at -80 °C in small aliquots to avoid multiple freeze-thaws. Thawing has to be done slowly on ice before an experiment is to be performed. Prepare 0.5 mM non-radioactive ATP solution by diluting stock ATP in 1x reaction buffer. It is best to prepare fresh dilute ATP at the time of the experiment, and to avoid repeated freeze-thaws of the stock ATP.Determine the volume of each component to be used such that the total reaction volume is 30 μl (Table 1). The ATP mix added per reaction contains 5 μCi [γ-32P]-ATP and non-radioactive ATP that yields final concentration of 30 μM. For example, ATP mix for one reaction can be prepared by mixing 0.5 μl of radioactive ATP (10 μCi/μl) and 1.8 μl of 0.5 mM non-radioactive ATP. Note: The rate of decay of [γ-32P]-ATP has to be taken into consideration when calculating the volume required per reaction. Manufacturers specify a calibration or reference date, which corresponds to the indicated activity of a radiolabeled reagent. This date can be used to determine the residual activity of the radioactive isotope on the day the assay is conducted. For example, for an experiment to be done two weeks after the [γ-32P]-ATP reference date, since the half-life of 32P isotopes is 14.29 days, double the volume of radiolabeled ATP has to be used to account for the decreased activity. Hence, instead of mixing 1.8 μl of 0.5 mM non-radioactive ATP with 0.5 μl of radioactive ATP as suggested above, 1.8 μl of 0.5 mM non-radioactive ATP should be mixed with 1 μl of radioactive ATP. The total volume of each reaction should always be adjusted to 30 µl. Table 1. Components of each kinase reactionimgsrc:https://en-cdn.bio-protocol.org/attached/image/20190813/20190813012144_8361.",
    "jpgAssemble reactions on ice by mixing all the components except for the ATP mix. If multiple reactions will use the same substrate, a master mix comprising 10x reaction buffer, substrate, and water can be prepared and distributed to the tubes to minimize pipetting errors.From this step onwards, precautions of using radioactive isotopes have to be taken. Prepare sufficient ATP mix for the number of assays to be performed. Start the reactions by adding an appropriate volume of ATP mix to each tube.Note: Radioactive material handling precautions have to be taken. These include the use of appropriate shielding materials such as Perspex shielding (3/8 inches thick) behind which all work should be done, and Perspex Eppendorf tube holders. Surfaces should be routinely monitored by Geiger counters, and ring dosimeters can be used to monitor personal exposure. Radioactive isotopes should be used only by authorized personnel in designated places following the institution’s biosafety regulations. Requisition and storage of radioactive material, solid and liquid radioactive waste disposal, and spill decontamination should be done following the institution’s regulations. Incubate the tubes in a water bath or sand bath at 30 °C for 30 min.Stop the reactions by adding 10 μl of 4x SDS sample buffer (listed in Recipes) followed by boiling at 95 °C for 5 min. Spin down the tubes to bring the reaction components to the bottom of the tube.Load the entire volume of each reaction into a well of a 10-well polyacrylamide gel. The percentage of resolving gel depends on the molecular weight of protein substrates used in the assay. Run the gel at 100-130 constant voltage.",
    "It is important to stop gel running when the dye front is about 1-2 cm away from the bottom of the gel to prevent the entry of free [γ-32P]-ATP into the buffer in the gel tank. Cut the gel just above the dye front and discard the lower portion into solid radioactive waste.Stain the gel with a sufficient volume of InstantBlue Coomassie protein stain for 30 min, followed by two washes using deionized water for 30 min each. Alternatively, standard Coomassie blue staining and destaining solutions can be used. Discard the solutions used for staining and washing into a liquid radioactive waste container.Place the gel on a thick filter paper, and dry it in a gel dryer at 70 °C for 60 min. Expose radioactivity with X-ray film for an appropriate time as follows:In a dark room place the gel in an X-ray film cassette with an X-ray film directly above it. Close the cassette and put it in an X-ray cassette security bag to ensure light protection. The use of intensifying screens enhances the signal. Also, keeping the cassette in a -80 °C freezer enhances the signal. Depending on the activity of the kinase towards the specific substrate (the phosphorylation level of the substrate), an X-ray film may be exposed for as short as 2-3 h, or as long as 1-2 days. Develop and fix the X-ray film to visualize substrate phosphorylation by autoradiography. Dark bands appearing on the X-ray film correspond to phosphorylated substrate that is isotope-labeled. Several exposures can be obtained to ensure that the signal is not over-saturated.A representative image of an in vitro ERK3 kinase assay using MBP as substrate is shown in Figure 2. The first lane is a negative control reaction which lacks ERK3.",
    "The second lane is a reaction that contains ERK3 and MBP. Note that ERK3 protein is barely seen in the Coomassie-stained gel because of its small amount, whereas the appearance of phosphorylated ERK3 band in the autoradiograph indicates ERK3 autophosphorylation. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190813/20190813011020_9534.jpgFigure 2. Representative image of in vitro ERK3 kinase assay using MBP as substrate. ERK3 protein with an N-terminal HA-tag (HA-ERK3) was expressed in 293T cells. HA-ERK3 protein was then purified by immunoprecipitation using HA antibody-conjugated beads, followed by elution with HA peptide. In vitro kinase reaction was performed in the presence of [γ-32P]-ATP and MBP (1 µg), with or without 100 ng purified ERK3 (lanes 2 and 1 respectively). Total protein levels of MBP in both reactions are shown by Coomassie staining (left panel). Phosphorylation of MBP is detected by autoradiography (right panel)."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}