{
  "id": 4521,
  "origin_website": "Bio",
  "title": "Measuring UV-induced Mutagenesis at the <em>CAN1</em> Locus in <em>Saccharomyces cerevisiae</em>",
  "procedures": [
    "By inoculating a single colony from a fresh plate, grow up 10 ml overnight cultures in YPD (one reference, or wild type strain, and the strains to be examined).   Put the culture tube into a waterbath sonicator and sonicate the cells at room temperature for 3 min to disrupt clumps (40 Hz). Check for the presence of clumps under the microscope.   Make 200x dilutions of each strain in water (5 µl cell culture into 995 µl water) and put 10 µl onto a Burker-chamber.   Count the cells under the microscope in a big square of the Burker-chamber (bordered by three lines) (Figure 1). One cell in a big square means 1 x 104 cells/ml.   Calculate the density of the original cultures (multiply the counted cell number by 200).   Make 10x serial dilutions of each strain, starting from 108 to 103 cells/ml. If necessary concentrate cells to get 108 cells/ml. When calculating the volume of a given dilution step, take into consideration how many plates you will be plating from that dilution (see steps 8 and 9 below).   Label the SC and the +can plates with the strain names and the UV doses you want to apply. For each UV dose, including zero, label 2 SC and 2 +can plates for each strain. The SC plates will be used to calculate survival at different UV doses, the +can plates will be used to calculate mutagenesis at different UV doses.   Plate 200 µl on the control, 0 J/m2 SC plates from the 103 cells/ml dilution. For wild type, EMY747 or BY4741 cells that are quite resistant to UV showing 20% survival at 80 J/m2, for up to that dose the 103 cells/ml dilution should be used for plating.",
    "In case of more sensitive strains the expected survival rate should be taken into consideration when determining which dilution to use for plating for given UV doses.   Plate 200 µl cells on the +can plates from the 108 cells/ml dilutions.   Wait till plates absorb the moisture, then irradiate the plates without lids, with the required UV doses. Make sure the irradiated plates are not exposed to white light after irradiation (work with yellow light on), and they are placed right away in a box that shields them from light and put in the 30 °C incubator.   Incubate the plates until colonies grow to 2-3 mm in diameter. For SC plates it takes usually 2-3 days, for +can plates it takes up to 5 days (check them under yellow light).   Count the colonies on each plate.   Calculate the percentage of survival on SC plates. Divide the average number of colonies of the two 0 J/m2 plates with the number of cells that were plated on one plate and multiply it by 100. That gives the percentage of cells that survived plating.   Calculate the survival at each UV doses. Multiply the average colony number of the two parallel plates with the plating survival percentage calculated from 0 J/m2 plates (see step 13 above), and divide it by the number of cells that was plated. (Take into consideration the actual volumes you plated at different doses: 100 µl, or 200 µl!)   Calculate mutagenesis from +can plates. Multiply with the survival percentage the number of cells plated on a plate at the given UV dose. Calculate the average number of colonies from the two parallel plates of the same UV dose. That gives you the number of mutants/plated cells.",
    "Based on that calculate how many mutants would be in 106 cells, because mutagenesis data usually corresponds to 106 cells. (Take into consideration the actual volumes you plated at different doses: 100 µl, or 200 µl!)  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20141015/20141015002449_8250.jpg Figure 1. Burker chamber. One cell in one blue area means 1 x 104 cells/ml. (Source: http://openwetware.org/wiki/IGEM:University_of_Debrecen:_transfection[href=http://openwetware.org/wiki/IGEM:University_of_Debrecen:_transfection])"
  ],
  "subjectAreas": [
    "Microbiology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}