{
  "id": 8410,
  "origin_website": "Jove",
  "title": "Super-Resolution Imaging to Study Co-Localization of Proteins and Synaptic Markers in Primary Neurons",
  "procedures": [
    "1. Primary cultures\nCulture mouse hippocampal primary neurons in chambered coverslips (such as Ibidi µ-Slide 8 Well or Nunc Lab-Tek Chambered Coverglass) that match the objective requirement for #1.5 (0.17 mm) coverslip thickness.\nCoat chambered coverslips with 100 µL of poly-L-lysine (100 µg/mL).\nThe next day, wash the chambered coverslips twice with sterile phosphate-buffered saline (PBS).\nTo obtain mouse primary neurons, isolate hippocampi from P1-P4 pups23.\nPlace dissected hippocampi in 10 mL of Dissection Media (Table 1) and let them deposit at the bottom of the tube.\nUsing a sterile pipette, carefully remove the Dissection Media, leaving the hippocampi undisturbed at the bottom of the tube.\nAdd 10 mL of Media 1 (Table 1) to the hippocampi and incubate for 30 minutes at 37 °C.\nUsing a sterile pipette, carefully remove Media 1, leaving the hippocampi undisturbed at the bottom of the tube.\nAdd 10 mL of Media 2 (Table 1) and leave the (capped) centrifuge tube under the hood horizontally for 45 minutes.\nLet the centrifuge tube stand vertically to allow the tissue to settle at the bottom of the tube.\nUsing a sterile pipette, carefully remove Media 2, leaving the hippocampi undisturbed at the bottom of the centrifuge tube.\nAdd 2 mL of Media 3 (Table 1).\nUsing a p1000 pipette with a filtered tip, mechanically dissociate cells from the tissue.\nTransfer the supernatant, in which are located the isolated neurons, to a 15 mL centrifuge tube.\nCentrifuge the cell suspension for 2 min at 300 x g at room temperature (RT).\nAfter centrifugation, cells are located at the bottom of the centrifuge tube. Using a sterile pipette discard the supernatant.\nResuspend cells in 1 mL of Media 4.\nUse a 70 µm filter to eliminate undissociated cells.",
    "Count viable cells in a Bürker chamber by adding 1 µL of 0.4 % Trypan blue solution to 19 µL of the cell suspension.\nPlate cells at 70,000 cells/well in a volume of 200 µL per well.\nAllow the cells to attach for 2 h in a humidified incubator at 37 °C and 5% CO2.\nTake out the chambered coverslips from the incubator and carefully replace the medium with 200 µL of Culture Media.\nLeave the chambered coverslips in a humidified incubator at 37 °C and 5% CO2.\nReplace one third of the medium with fresh culture media every 5-7 days.\nWait until hippocampal primary neurons are fully matured (12-14 days after plating) to perform co-localization studies.\n2. Immunofluorescence staining\nTake the chambered coverslips from the incubator.\nRemove the medium.\nQuickly wash the wells with 200 µL of PBS.\nAdd 4% paraformaldehyde (PFA) in PBS (200 µL/well) to neurons to fix them quickly.\nIncubate the cells for 15 min at RT.\nRemove the PFA solution.\nPermeabilize the cells by adding PBS with 0.2% Triton X-100 (200 µL/well).\nIncubate for 1 min at RT.\nRemove the solution and incubate the samples with 1% bovine serum albumin (BSA) in PBS (200 µL/well) for 1 h at RT to passively cover all free binding surfaces of the plate with an irrelevant protein for the analysis. A BSA-based blocking buffer without Triton X-100 reduces the antibody background more efficiently than the same buffer with 0.2% Triton X-100.\nRemove the solution.\nAdd the primary antibody of choice diluted in a PBS solution containing 1% BSA and 0.2% Triton X-100 (120-200 µL/well, depending on the antibody dilution and availability). Incubate the samples for 2 h.",
    "As a negative control, do not add any primary antibody to one of the wells. Multiple antibodies of different species against different targets may be used at the same time. Use an antibody against MAP2 (a neuronal marker) raised in chicken, an antibody against either PSD95 or synaptophysin raised in mouse, and an antibody against a target protein raised in rabbit. This allows three-color SIM analyses.\nQuickly wash the wells three times with PBS (200 µL/well).\nAdd secondary antibodies (dyLight and Alexa secondary antibodies can both be used) diluted in a PBS solution containing 1% BSA and 0.2% Triton X-100 (200 µL/well). Incubate the samples for 1 h at RT.\nQuickly wash the wells three times with PBS (200 µL/well).\nAdd Hoechst dye at a concentration of 1 μg/mL diluted in PBS (200 µL/well) to stain nuclei. Incubate the samples for 10 minutes at RT.\nQuickly wash the wells twice with PBS.\nMount cells using a SIM-compatible mountant. Use 10 µL/well of ProLong Glass Antifade Mountant.\nCover and protect the cells with a coverglass (e.g., a round coverglass with a diameter of 8 mm). Square ones can also be used.\nStore the chambered coverslips at RT and wait at least 48 h before acquiring images. Diamond Glass requires at least two days of curing before super-resolution acquisitions.\n3. Antibody specificity control\nNOTE: Use two strategies to assure antibody specificity. The first strategy is to use at least two different antibodies targeting the same substrate. The second strategy is antibody neutralization by incubation with the purified protein target or the epitope used to raise the antibody.\nIncubate the antibody of choice with five times excess of the recombinant target or epitope for 1 h at RT in 1% BSA in PBS.",
    "After the incubation, use the neutralized antibody at the usual concentration for staining as described above from 2.11.\n4. Microscope calibration\nNOTE: We routinely use an N-SIM Super-Resolution Microscope System manufactured by Nikon for the super-resolution studies. However, several other companies also offer super-resolution microscopes in their catalogues. Although specific indications for Nikon’s N-SIM system are described, the instructions that follow can be generalized to other systems. Before the acquisition of SIM images, the system requires a proper calibration with specific sub-resolution size fluorescent beads. An example is the TetraSpeck microspheres. These beads are stained with different fluorescent dyes to allow the calibration of different lasers with one sample.\nIn a water bath sonicate around 1.8 x 108 fluorescent microspheres for 10 minutes. Nikon’s N-SIM system requires a sparsely populated multicolor beads sample for the calibration. This could differ for other systems that require a dense single layer of sub-resolution size fluorescent beads. Adjust the number of fluorescent particles accordingly.\nDilute the fluorescent microspheres 1:500 in double distilled water.\nSonicate a second time for an additional 10 minutes.\nPipet 15 µL of the diluted beads into a well of a chambered coverslip.\nLet the solution dry for 5 minutes at RT.\nAdd 10 µL of the mounting solution and place an 8 mm coverslip on top.\nWait at least 48 hours to allow proper curing.\nTurn on the microscope and lasers.\nLet the system warm up to reach the thermal equilibrium of all microscope components. N-SIM Super-Resolution Microscope System requires at least 3 hours.\nSelect the 100x objective.\nStart the calibration by aligning the lasers to the center of the diffraction grating block. In the N-SIM system, a micrometer knob and a dedicated camera allow centering of the light beams to the target.",
    "Insert the chambered coverslip in the microscope for viewing. Set the system to the chambered coverslip thickness by adjusting the objective correction collar. NIS software, the proprietary software provided with N-SIM Super-Resolution Microscope systems, has an automatic function to regulate correction collars.\nAdjust grating block focus for each channel to ensure focused structured pattern illumination on the sample. NIS software provides an automatic function for this task.\nNext, acquire raw 3D-SIM images of the multicolor microspheres. Reconstruct the raw images to obtain a super-resolved image using the microscope software or the open-source software platform for the analysis of biological images ImageJ24 and the plugin fairSIM25.\nCalculate, for each separated wavelength, the Fourier transform of the super-resolved image obtained in 4.14. If the transformed image fails to obtain a correct flower-like pattern, restart calibration from 4.11 since super-resolution has not been achieved.\nIn the super-resolved image, select a single microsphere and calculate its intensity profile for each channel to measure the resolution achieved. It should now be close to 100 nm laterally.\nNext, perform channel registration by overlaying a multichannel acquisition of the microspheres. The goal is to collimate all channel signals laterally and axially. This will eliminate chromatic aberrations due to the misalignment of the different channels and help the co-localization analysis.\nConfirm the quality of calibration by using the functions “Illumination Phase Steps” and “Illumination Pattern Focus” of SIMcheck26, a suite of plugins for the open-source application ImageJ. To this end, prepare a chambered coverslip to obtain a dense single layer of TetraSpeck microspheres and acquire a 3D-SIM image of the sample. Analyze the image in ImageJ and, if aberrations are detected, restart microscope calibration from step 4.11.\n5. Acquisition",
    "Start analyzing the sample using a 40x objective in confocal or widefield mode. This allows navigation to the sample, maintaining good details and a large field of view.\nUse MAP2 antibody signal to identify an area representing neuronal processes.\nAcquire images of the sample in confocal mode to determine the quality of the staining. Poor confocal quality will reflect in poor SIM quality, therefore requiring the samples to be discarded.\nIf the area and the quality of the images are satisfactory, switch the objective to 100x.\nApply oil to the 100x objective.\nAcquire a widefield or confocal image that will be used later to assess the quality of the super-resolved image (Figure 1A,B).\nSwitch to 3D-SIM mode.\nUsing dialog windows to set parameters for acquisition, select the highest bit-depth setting available to maximize color information. Typically, 16-bit is the standard choice. Moreover, to improve signal-to-noise ratio, select a low frequency value for acquisition, such as 1 MHz.\nUsing histogram windows, set lasers power to obtain a linear response of signal. To avoid loss of information, limit saturated pixels in the images. The N-SIM system uses an Andor iXon3 camera. When working at 16-bit, choose a target intensity of 16,000 to ensure the linear response of the camera. Alternatively, choose a range between 30,000-45,000 to maximize the dynamic range of the acquisition.\nSet laser power between 0.1% and 50% when imaging the samples and exposure times between 50 ms and 2 s. Laser powers above 50% may cause rapid photobleaching of the fluorophores in use.\nStart acquiring the images in 3D-SIM mode.\nUse SIMcheck, a suite of free plugins for ImageJ, to assess the quality of acquisition of the raw images.",
    "If SIMCheck does not detect any artifacts or quality issues, acquire a minimum of 10 images from 4 technical replicates to allow statistical analysis.\n6. Post-production: image reconstruction\nNOTE: 3D-SIM acquired images are raw images that need to be processed to obtain reconstructed super-resolved images. Incorrect reconstruction of raw images can lead to artifacts that would affect the analysis of the samples. Great attention should therefore be paid to properly choosing reconstruction parameters.\nProcess the raw images using the microscope reconstruction analysis software to obtain a super-resolved image (Figure 1C). Alternatively, use the freely available ImageJ plugin fairSIM to reconstruct raw images.\nCalculate the Fourier transform of the super-resolved images using the microscope reconstruction software or ImageJ plugin SIMCheck. A good reconstructed image should return, for each channel, a flower-like image. If the reconstructed images fail to recreate a flower-like shape, restart from the raw images and reconstruct them by modifying the reconstruction parameters such as Wiener filtering, apodization and zero-order suppression27. In NIS software, using the preview to monitor how changing the parameters affects the final resolved image, modify the parameters i) Illumination Modulation Contrast, ii) High Resolution Noise Suppression and iii) Out of Focus Suppression.\nNext, analyze the reconstructed image to unbiasedly detect artefacts by using NanoJ-SQUIRREL28, an ImageJ-based plugin to assess the quality of super-resolved images.\nIf NanoJ-SQUIRREL detects artifacts, restart from the raw images and reconstruct them by modifying the reconstruction parameters such as Wiener filtering, apodization and zero-order suppression. In NIS software, using the preview to monitor how changing the parameters affects the final resolved image, modify the parameters Illumination Modulation Contrast, High Resolution Noise Suppression and Out of Focus Suppression.\nUse the super-resolved images to calculate the co-localization profile and/or Pearson’s and Mander’s coefficients.\n7. Co-localization with profile analysis",
    "NOTE: As a first step to study co-localization between synaptic markers and a protein of interest, take a super-resolved image and analyze a single locus to determine signal overlap.\nIdentify a single locus on the super-resolved image.\nObtain the intensity profiles of the fluorescent signals of the locus of interest.\nExport the data.\nUse GraphPad Prism, or a similar analysis software, to normalize all signal peaks and obtain comparable signal intensities for each channel with the final goal of determining locus specific co-localization.\n8. Quantification of Pearson’s and Mander’s coefficients\nNOTE: If profile analysis has suggested single locus co-localization, a more general analysis of the whole image can be carried out by calculating Pearson’s and Mander’s coefficients29,30.\nUse JACoP31, an ImageJ plug-in, to determine the two parameters of co-localization: Pearson’s and Mander’s.\n9. Statistical analysis\nUse GraphPad Prism, or a similar analysis and graphing software, to process data collected with JACoP.\nUse at least 40 SIM images for each condition analyzed to obtain graphs and for statistical relevance.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}