{
  "id": 18484,
  "origin_website": "Jove",
  "title": "Systems Biology of Metabolic Regulation by Estrogen Receptor Signaling in Breast Cancer",
  "procedures": [
    "1. Preparation of RNA-Seq Samples\nCell Culture and Treatment\n\t\nCulture the MCF7 cells in Improved MEM (IMEM) plus phenol-red medium with 10% Heat inactive FBS, 1% penicillin/streptomycin at 37 °C in humidified 5% CO2 atmosphere.\n\t\tNote: Same cell line and cell culture condition is used throughout the study.\nSeed 100,000 MCF7 cells per well in 6-well plates. Have triplicates for each treatment. On day 3, remove the medium and add 2 ml fresh medium with or without 10-8 M E2 to each well. Incubate the plates for 24 hr in 37 °C in humidified 5% CO2 atmosphere.\nTo harvest the cells, add 1 ml RNA isolation reagent (acid guanidinium thiocyanate-phenol-chloroform) into each well and incubate for 5 min at room temperature (RT). Then collect the cell lysate reagent by pipetting and deposit into 1.5 ml tubes\nRNA Isolation\n\t\nAdd 200 µl chloroform to 1 ml cell lysate reagent (1.1.3) and vortex for 10 sec. Incubate at room temperature for 5 min. Centrifuge samples at 16,000 x g for 15 min at 4 °C. Following centrifugation, transfer the aqueous phase (top) to a new tube without disturbing the other phases.\nAdd 500 µl 100% isopropanol to a new tube with the transferred-aqueous phase, and mix by inverting. Incubate at -20 °C overnight. Centrifuge the samples at 16,000 x g for 10 min at 4 °C. Observe a pellet at the bottom of the tube. Discard the supernatant and wash the pellet with 750 µl RNase-free 70% ethanol by brief vortex.",
    "Centrifuge samples at 6,000 x g for 5 min at 4 °C. Remove the supernatant, and centrifuge the sample at 16,000 x g for 1 min at 4 °C to collect all the remaining ethanol. Remove the remaining ethanol by pipetting with a gel-loading tip and set the tubes up-side down to air-dry for 10 min. Dissolve the pellet in 20-50 µl DEPC treated water depending on the size of the pellets.\nPurify the RNA using RNA clean-up kit following the protocol4. Measure the RNA concentration using a fluorometry based assay kit following the protocol9.\n\tNOTE: OD at 260 nm is taken to determine the RNA concentration and ratio of OD at 260 nm and 280 nm are used to determine the purity of sample. It is recommended checking the RNA quality using Bio-analyzer assay.\nTake about 0.5 to 1 μg purified RNA for sequencing.\n\tNOTE: Biotech center prepares the sequencing libraries and performs paired-end read sequencing using methods detailed previously2.\n2. Preparation of ChIP-Seq Sample\nCell Culture and Treatment\n\t\nSeed 500,000 MCF7 cells per 10 cm plate in growth medium.\n\t\tNOTE: For each pull down 16 plates were used. On day 3, remove the medium and add 5 ml fresh medium with or without 10-8 M E2 to each plate. Treat the cells for 45 min (37 °C in humidified 5% CO2 atmosphere).\nCrosslink and Cell Harvest\n\t\nAdd 250 µl 37% Formaldehyde into 5 ml medium to crosslink chromatin, incubate at room temperature for 15 min. Stop crosslinking by washing cells with 5 ml ice cold 1x MEM.\nHarvest the cells in 250 µl Cell Lysis buffer (10 mM EDTA, 50 mM Tri HCl, 1% SDS, 0.5% N,N-dimethyldodecan-1-amine oxide) per plate.\nFragmentation of Chromatin",
    "Sonicate the cells for 30 sec x 8 at amp of 30 to reach required chromatin sizes. Cool each sample on ice after a sonication of 30 sec.\nCentrifuge at 16, 000 x g for 10 min at 4 °C, and carefully pipette the supernatant without disturbing the pellet at the bottom.\nTake a 5 µl aliquot of the supernatant, and check the DNA size by electrophoresis through 1.5% agarose gel as described previously10. The ideal size of DNA should be between 200-500 bp.\nChromatin Immunoprecipitation\n\t\nSave 25 µl of cell lysate as input. In a 50 ml tube, mix 4 ml of cell lysate with 20 ml IP buffer (2 mM EDTA, 100 mM NaCl, 20 mM Tris-HCl, and 0.5% Triton X), ERα antibody (500 µl F10 and 500 µl HC-20), and 500 µl ProtA and ProtG protein coating magnetic beads. Incubate the mixture by rotation at 4 °C overnight to allow the formation of chromatin- antibody complex.\nWashes and Reverse-crosslinking\n\t\nUse a magnetic stand to collect the magnetic beads on the magnetized side to remove the wash buffer.\nWash the magnetic beads in 25 ml Wash buffer I (2 mM EDTA, 20 mM Tris HCl, 01% SDS, 1% Triton X, and 150 mM NaCl). To thoroughly wash the magnetic beads without disturbing DNA-Protein complexes, add 25 ml wash buffer slowly to the tube along the side then invert the tubes until all the magnetic beads are mixed well with the wash buffer without appearing as a pellet. As an alternative, use the rotator to invert the tube. Do not vortex the samples. Wash the magnetic beads using the same method in the following steps.",
    "Wash the magnetic beads in 25 ml Wash-buffer II (2 mM EDTA, 20 mM Tris HCl, 01% SDS, 1% Triton X, and 500 mM NaCl).\nWash the magnetic beads in 25 ml Wash-buffer III (1.6 mM EDTA, 10 mM Tris HCl, 1% NP-40, 1% Dexycholate and 250 mM LiCl).\nWash the magnetic beads in 25 ml 1x TE buffer (1 mM EDTA, and 10 mM Tris HCl) twice.\nElute DNA in 500 µl Elution buffer (1% SDS, and 10 mM NaHCO3) and then allocate the 500 µl DNA elution into 4 tubes. For the DNA from inputs, elute DNA in 125 µl Elution buffer.\nIncubate the tubes at 65 °C overnight on a heating block. Cover the tubes on the heating block with aluminum foil to keep the heat even over all the tubes. Place a weight on the tubes to keep them from opening.\nDNA Isolation\n\t\nCool the tubes at RT for 5 min. Isolate DNA from the pull down samples using ChIP DNA isolation kit. Follow the directions from the manufacturer.\n\t\t\nWarm up the Elution buffer at 65 °C. Add 625 µl binding buffer to each tube. If the precipitate forms, add another 250 µl binding buffer until the solution is clear.\nLoad the sample onto the column and centrifuge at 16,000 x g for 30 sec. Wash the sample with 250 µl wash buffer. Remember to add ethanol to the wash buffer when first time to use it. Repeat the wash.\nElute the DNA in 15 µl Elution buffer. Combine the DNA of same pull down from 4 tubes to achieve around 55 µl DNA.\nIsolate the Input DNA Using a DNA Purification Kit.",
    "Warm up the Elution buffer at 65 °C. Add 625 µl binding buffer in each tube and incubate for 10 min. Load the sample onto the column in a 2 ml collection tube.\nWash the sample with 750 µl wash buffer, centrifuge at 16,000 x g for 1 min. Repeat centrifuging to remove any remaining buffer. Elute the DNA into 30 µl of EB.\nMeasure the DNA Concentration Using a Commercial Fluorochrome Assay with Modification11.\n\t\t\nDilute the 20x TE buffer into 1x TE as the assay buffer for diluting the reagent and DNA samples. Take 5 µl isolated DNA and dilute it into 50 µl in 1x TE.\nFrom 2 µg/ml DNA stock solution make a DNA standard ranging from blank to 1, 10, 100, 1000 µg/ml. In a 96 well plate, allocate 25 µl of each standard as well as DNA dilution in duplicate. (Triplicate for standard is recommended.)\nPrepare the working reagent by making a 200-fold dilution from dsDNA reagent in 1x TE buffer in plastic tube. Cover the working reagent solution with aluminum foil to avoid light. Add 200 µl working reagent into each sample. Incubate at room temperature for 5 min. Cover the plate with aluminum foil to avoid light.\nMeasure the florescence of the samples using a fluorescence plate reader (excitation at 480 nm, emission 520 nm). Generate the DNA standard curve of florescence versus DNA concentration. Determine the concentrations of the samples based on the generated DNA standard curve.\nVerification of ChIP Experiment Using qPCR\n\t\nTake 2 µl isolated DNA and diluted into 20 µl in water. Set up the qPCR reaction in triplicate by mixing 2.5 µl DNA dilution, 5 µl Green I PCR master mix, 1 µl primer, and 1.5 µl nuclease free water.",
    "Run the qPCR with the Fast Real-Time PCR system using the following program: Step 1: 95 °C for 60 sec, Step 2: 95 °C for 10 sec, 60 °C for 60 sec, repeat Step 2 39 times.\nSend 10 ng DNA sample to Biotech center for sequencing.\n\tNOTE: The biotech center prepares the ChIP DNA into libraries according to instruction, and performs single-read sequencing using methods detailed previously2.\n3. Metabolomics Assay Sample Preparation\nCell Culture and Treatment\n\t\nSeed 400,000 MCF7 cells per 10 cm plate in growth medium. For each treatment prepare three samples. Use two plates in each sample to receive enough cells for the detection. On day 3, remove the medium and add 5 ml fresh medium with or without 10-8 M E2 to the cells. Treat the cells for 24 hr (37 °C in humidified 5% CO2 atmosphere).\nSample Collection\n\t\nAdd 5 ml ice cold 1x PBS to the plate, aspirate the PBS after briefly tilting the plate several times. Repeat twice, and remove as much PBS as possible after the last wash.\nAdd 750 µl of pre-cold acetone to each plate and scrape the cells. Combine the cells in acetone from two plates into a 2 ml tube on ice.\nCell count for normalization\n\t\t\nFor each treatment, use two extra plates for cell quantification. To de-attach the cells from plate, add 2 ml of HE buffer (1x HBSS, 10 mM HEPES, 0.075% NaHCO3, and 1 mM EDTA) into each plate and incubate for 5 min.\nCollect and mix well the cells by pipetting cells in the HE buffer. Use total of 20 µl cell solution to count the cell number using a hemocytometer.",
    "Store the samples at -80 °C before sending to the Metabolomics center to identify and quantify the metabolites using Gas chromatography mass spectrometry (GC-MS) analysis.\n4. Integrative Analysis\nRNA-Seq Data Analysis:\n\t\nPerform Quality check of FASTQ files using FastQC:Read QC (http://galaxy.illinois.edu)\n\t\t\nSelect FastQC:Read under the tool of NGS:QC and manipulation. Upload the raw data file from current history.\n\t\t\tNOTE: It is recommended to give a title for the output file to remind you what the job was for since there might be multiple outputs.\nExecute and the output file will appear under the History. Repeat the same procedure for each sequence file. Trim adapters using Clip under NGS:FASTX Toolkit.\nAlign reads to hg19 using Tophat2 with RefSeq genome reference annotation12 (default values).\n\t\t\nSelect Tophat2 under tool of NGS:RNA analysis. Indicate the library paired type (single-end vs paired-end).\nUpload the input FASTQ file from the current history. Select the reference genome. Choose defaults settings. Or use the full parameter list to modify.\nExecute and it will produce two output files: one is UCSC BED track of junctions; another one is a list of read alignments in BAM format.\nUpload BAM files to sequencing data analysis tool. Calculate expression values using Quantification Tool.\nIdentify differentially up-regulated genes using Expression Analysis Tool using default values and fold change >2 and p-value <0.05. Likewise, identify differentially down-regulated genes using Expression Analysis Tool using default values and fold change <0.5 and p-value <0.05.\nChIP-Seq Data Analysis:\n\t\nAlign FASTQ Reads to hg19 using Bowtie213 (Default Values) in Galaxy.\n\t\t\nSelect Bowtie2 under the tool of NSC:Mapping. Verify if the library is mate-paired (single-end vs paired-end). Upload the FASTQ file from current history.",
    "Select the reference genome. Use the default parameter settings. Execute and it will produce output file with mapped sequence reads as BAM file. Repeat the procedure for every sequence file.\nIdentify peaks using MACS14 a p-value cutoff of 6.0e-7 and FDR of 0.01, as previously described2.\nMetabolomics Data Analysis:\n\t\nConvert chemical names of metabolites to KEGG_IDs.\nIdentify differentially regulated metabolites by comparing levels detected in Vehicle vs. E2 treated samples (a 2 fold cut-off was used in this study).\nIntegrative Analysis:\n\t\nIdentify genes that have ERα binding sites using sequencing data analysis tool. Translate Regions to genes function using 20 kb as distance cut-off.\nIdentify differentially up- and down-regulated genes from RNA-Seq data analysis using fold change >2 and fold change <0.5, respectively with the p-value <0.05 as cut off. Compare to the list of ERα binding site containing genes using Venn diagram comparison.\nUse this list to identify E2 modulated metabolic pathways using Metscape15 module of Cytoscape.\n\t\t\nBy selecting Metscape module from apps, choose Build network and then pathway-based option.\nSelect the Organism (Human). Select data file of E2 unregulated compound list (KEGG ID) as well E2 up-regulated gene list.\nChoose Compound -Reaction -Enzyme-Gene as the Network type. Choose compound/genes as the query.\nBuild network. Repeat using the E2 down-regulated compound and genes.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}