{
  "id": 13504,
  "origin_website": "Jove",
  "title": "Multi-Photon Time Lapse Imaging to Visualize Development in Real-time: Visualization of Migrating Neural Crest Cells in Zebrafish Embryos",
  "procedures": [
    "The protocol described here was performed in accordance with the guidelines for the humane treatment of laboratory animals established by the University of Michigan Committee on the Use and Care of Animals (UCUCA).\n1. Embryo Collection for Time-lapse Imaging\nBetween 3 and 9 pm, set up male and female adult Tg(sox10:EGFP) or Tg(foxd3:GFP) transgenic zebrafish in a divided breeding tank for pairwise mating.\n\tNOTE: The Tg(sox10:EGFP) and Tg(foxd3:GFP) fish, kind gifts from Thomas Schilling and Mary Halloran, respectively, were crossed into the Casper (roy -/-, nacre -/-) background to decrease auto-fluorescence and interference with pigmentation.\n\t\nAssemble the breeding tank (slotted inner tank + solid outer tank) and fill it with reverse osmosis (RO) system water.\nTransfer up to 3 females and 3 males into opposing sides of the tank separated by a divider; up to 6 fish can be bred pairwise in a single breeding tank.\nThe next morning, remove the divider shortly after the lights turn on in the vivarium.\n\t\tNOTE: In the present study, the lights are on a 14-hour light (on at 9 am) and 10-hour dark (off at 11 pm) cycle.\nAllow undisturbed mating for 20 min or until sufficient numbers of embryos are produced; the embryos will be at the bottom of the breeding tank. When eggs are observed, lift the slotted inner tank out along with the fish and quickly place them (fish and inner tank) into a clean solid outer tank filled with RO water.\nPrepare standard 1X embryo medium by adding the following per 1 L of RO water: 0.287 g (4.9 mM) NaCl, 0.127 g (0.17 mM) KCl, 0.048 g (0.33 mM) CaCl2.2H2O, 0.04 g (0.33 mM) MgSO4 (anhydrous). Stir solution until the salts are completely dissolved.",
    "Add 100 µL of 0.1% methylene blue as a fungicide. Add 0.25 g of sodium bicarbonate to adjust the pH to 7.75. Store medium at room temperature.\nCollect eggs from the outer tank using an egg-collecting screen, and transfer the eggs to Petri dishes (~50 embryos per dish) containing 30 mL of 1X embryo medium. Incubate the collected eggs at 28.5 °C.\nEmbryo preparation\nTg(sox10:EGFP) embryos.\n\t\t\nFor Tg(sox10:EGFP) embryos, at 12 h post-fertilization (hpf), remove the dead eggs and assess the developmental stage of the embryos. Screen for GFP-positive embryos using a dissecting fluorescent stereomicroscope with a standard 460-490 nm band-pass excitation filter. Using forceps, remove the chorions from 3-4 embryos that express GFP, and transfer these embryos to a separate Petri dish containing 30 mL of fresh 1X embryo medium.\nTg(foxd3:GFP) embryos.\n\t\t\nFor Tg(foxd3:GFP) embryos, at 22-24 hpf, remove the dead eggs and assess the developmental stage of the embryos. Screen for positive embryos using a dissecting fluorescent stereomicroscope with a standard 460-490 nm band-pass excitation filter. Using forceps, remove the chorions from 3-4 embryos that express GFP.\nPrepare 1000X Phenylthiourea (PTU) stock solution by dissolving 0.75 g (3%) of PTU in 25 mL of Dimethylsulfoxide (DMSO). Aliquot and store the stock solution at 4 °C. Add 30 µL of 1000X PTU (3%) stock solution to 30 mL of 1X embryo medium to generate 0.003% PTU solution.\nPlace the screened and dechorionated GFP-positive embryos in 0.003% PTU solution to inhibit pigmentation. Do not initiate treatment of the embryos with PTU prior to 20 hpf, as early treatment (at <20 hpf) can have adverse effects on neural crest and neuroepithelial development.28\nPrior to conducting the time-lapse experiment, monitor the embryos through live imaging using a standard stereomicroscope at 12-24 h intervals in age-matched comparisons as a control for temperature drift.",
    "2. Mounting of Embryo for Time-lapse Imaging\nPreparation of time-lapse embryo media\nPrepare standard 0.4% tricaine stock solution by adding 0.004 g of tricaine to 100 mL of RO water. Aliquot (~1 mL) the stock solution into fresh 1.5-mL centrifuge tubes and store at -20 °C.\nPrepare time-lapse embryo medium (50 mL of 1X embryo medium, 0.016% tricaine) by adding 2 mL of 0.4% tricaine solution to 48 mL of 1X embryo medium. If using embryos >22 hpf, then also add 50 µL of 3% PTU stock solution (final concentration.003% PTU) to the embryo medium.\nPreparation of 2% low-melt agarose\nAdd 0.4 g of low-melt agarose powder to 20 mL of 1X embryo medium. Heat for 1-2 min or until the solution is clear and all particles are dissolved.\n\t\tNOTE: Increasing the percentage of the agarose gel decreases the porosity of the matrix, which may physically impede the growth and development of the embryo. Therefore, the agarose solution can be lowered to 1.5% to minimize these effects. However, when the excitation beam is held stationary during laser-scanning microscopy, greater heating can occur, increasing rapidly in a logarithmic relationship with time. In this protocol, heating due to fluorophore absorption is highly localized to the focal region. Thus, in the region of interest, the temperature could increase to a value high enough (≥ 30 °C) to melt agarose solutions made at percentages lower than 1.5, thereby directly exposing the embryo to the laser or enabling conditions in which the embryo floats out of the focal plane. For this reason, the use of agarose solutions lower than 1.5% is not recommended.\nAliquot (~1 mL) the agarose solution into fresh 1.5-mL centrifuge tubes for storage. Store excess agarose solution in liquid form on a heat block (60-70 °C) for 2-3 weeks.\nMounting the Embryo",
    "To set up the open bath chamber, place a small amount of high vacuum grease on the base of the open bath chamber. Place a circular glass coverslip onto the base and screw the top of the open bath chamber onto the base until tight ( Figure 1A, B).\nPipet (~500-700 µL) of 2% agarose solution (60-70 °C) into the open bath chamber until the base is ~3/4 filled ( Figure 1C). Note that once the agarose solution is in the open bath chamber on the lab bench, the temperature of the solution decreases approximately 1 °C/s.\nWait 30 s to allow the agarose to cool slightly (~30-40 °C), without completely polymerizing, and subsequently transfer a single embryo to the center of the base ( Figure 1D, E).\nUnder a fluorescent stereomicroscope, position the embryo using a 1-10 µL micropipette tip, making sure that the embryo is placed near the bottom of the agarose, as the embryo may float away when covered with embryo media if it is placed too near the surface of the agarose.\n\t\tNOTE: In the presented videos (Videos 1-3), the embryos are oriented laterally, but depending on the area of interest, the embryos can be oriented ventrally or dorsally.\nMonitor and reposition the embryo until the agarose has set. Once the agarose has set, use a transfer pipet to fill the assembled open chamber entirely with time-lapse embryo media ( Figure 1F).\nPlace the open bath chamber in the quick exchange platform, which fits onto the stage adapter ( Figure 1G). Place the entire setup (embryo, open bath chamber, quick exchange platform and stage adaptor) onto the stage of the microscope immediately above the condenser ( Figure 1H).\n3. Microscope Set-up for Time-lapse Imaging\nDetermining laser settings",
    "Determining laser wavelength to use. Use a wavelength that is twice the excitation wavelength of the fluorophore of interest (e.g. wavelength between 880 and 940 nm for GFP).\n\t\tNOTE: In the present study, the wavelength setting for GFP was between 880 and 940 nm. The higher the wavelength, the lower the output power of the laser.\nDetermine laser transmission. A high percent of laser transmission will kill the embryo, use the lowest level of transmission (recommended). For 24 to 48 h time-lapse studies, as presented herein, keep transmission below 5%.\nDetermine microscope detection systems and ensure that the correct filters for the fluorophore are in place.\n\t\tNOTE: For multi-photon microscopes, there are multiple detection systems with various sensitivities for the emitted fluorescence. In general, an internal detection system has less sensitivity than an external detection system. For transgenic lines with high levels of GFP expression, the internal detection system is adequate. For transgenic lines with low levels of GFP expression or with other fluorophores (e.g., red fluorescent protein), an external detection system may be required to maintain the percent of laser transmission at a reasonable level. Regardless the detection system used, the correct filters for the fluorophore must be in place.\nAdjusting software settings on the multi-photon microscope\nUsing the 5X objective, locate the embryo. Manually raise the stage to the highest position, and use the fine focus to position the embryo in the middle of the microscope range.\nManually lower the stage, and change the 5X objective to the 25X water immersion objective (numerical aperture NA, 0.95). Carefully raise the stage to bring the embryo back into focus.",
    "In the software, click on the \"xyzt\" mode for obtaining multiple images at time intervals (t) in the x-y plane over a depth of \"z\". Use the epifluorescence or brightfield view to find the depth of focus in the area of interest, which will demarcate the Z-stack.\n\t\t\nIn the software, click on \"begin\" button; for these experiments, the lateral edge of the eye was the beginning of the Z-stack. Click on \"end\" button; the midline of the embryo was the end of the Z-stack.\n\t\t\tNOTE: The step size was 0.3-0.6 µm and there was a total of ~200 steps for a z-stack size of 60 to 120 µm).\nClick on the menu for adjusting acquisition time and imaging frequency. For the present system, ~200 steps requires approximately 5 min for each z-stack acquisition. For adequate recovery of the fluorophore and survival of the embryo, allow for a ratio of at least 1:3 between z-stack acquisition (laser power on) and recovery time (laser power off).\n\t\tNOTE: For example, z-stacks are acquired every 20 min with 5 min of z-stack acquisition and 15 min of recovery. For this protocol, larger z-stacks can be obtained, but would appropriately increase the time between z-stack acquisitions, resulting in fewer images over the time-lapse course.\n\t\t\nWith appropriate time for embryo recovery, set the time between z-stacks in the designated window. Set the total length of time for the experiment in the appropriate window.\nFinal software, laser, and embryo adjustments.",
    "Turn on the live image setting to make final adjustments to the laser settings. Adjust laser transmission (see 3.1.2), gain and offset slider bars within the software to optimize the fluorescent image. Also, adjust the orientation of the embryo, as needed, depending on the length of the experiment, anticipated growth of the embryo, etc. Make sure that the area of interest remains within the frame through the duration of the experiment.\nTurn off the epifluorescent light source as it is no longer needed during time-lapse acquisition. Cover the stage with the laser safety box ( Figure 1I). When using the internal detection system, the laser safety box is adequate for protection against background light. Press \"start\".\n\t\t\tNOTE: However, with more sensitive external detection systems, the laser safety box does not block enough background light, and additional covers are required to prevent the disruption of image acquisition.\n4. During Time-lapse Acquisition\nRefill the open bath chamber with time-lapse embryo media every 8-12 h (at least 2 times per day) during time-lapse acquisition through the sliding doors on the laser safety box ( Figure 1I).\nBefore opening the doors of the laser safety box, ensure that the microscope is not actively acquiring an image.\n\tNOTE: The use of heaters and circulating media systems is not necessary for time-lapse imaging experiments lasting 24 to 48 h. Indeed, the temperatures of both stage and in-line heaters are difficult to control, and during image acquisition the embryo exhibits an adequate development rate at a temperature range from 25-28 °C. Moreover, circulating media systems tend to overflow and potentially damage the equipment. Thus, all embryos are routinely staged post-acquisition.\n5. Post-acquisition processing\nIn the software, click on the \"file\" menu and choose \"save\".",
    "Open the file in image processing software (see the Table of Materials). Highlight the correct image series. In the software, choose the \"Process\" menu. Click on 3D Deconvolution and \"Apply\" to deconvolve each z-stack.\n\tNOTE: The file is large; therefore, this step may take many hours.\nIn the software, under the \"Process\" menu, click on \"maximum projection.\" Click on \"Apply\" to initiate maximum projection to generate 1 image per z-stack. Export each maximum projected file (1 image per z-stack) as a tiff.\nImport individual tiff files into video processing software. Select all tiff files and drag them into the video editor. Adjust length of each image within the video to 0.1s. Export video as mov or mp4 file.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}