{
  "id": 3832,
  "origin_website": "Cell",
  "title": "Identifying cytokine signaling signatures in primary human Th-1 cells by phospho-proteomics analysis",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPeripheral blood mononuclear cell (PBMC) isolation\nTiming: 3 h\nBlood donated by healthy donors was obtained from the Blood Transfusion Unit (Ninewells Hospital, Dundee, UK) already in blood transfusion bags (Figure 1[href=https://www.wicell.org#fig1]). Cut the lower tube of the bag containing the blood samples. Make sure it is properly introduced in a 50 mL Falcon tube to avoid spillage of the blood and then cut the upper tube. Distribute the 50 mL of blood between two clean, sterile 50 mL Falcon tubes (25 mL in each tube).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/554-Fig1.jpg\nFigure 1. Blood transfusion bag scheme showing the upper and lower tubes for clarity\nAdd 25 mL of RPMI-1640 media without additives to each tube.\nIn 50 mL Falcon tubes add 25 mL of sterile Lymphoprep and slowly layer 25 mL of 1:2 diluted blood on top of the Lymphoprep layer.\nNote: Lymphoprep is a commercial density gradient medium recommended for the isolation of mononuclear cells from peripheral blood. Alternatively, Ficoll gradients can also be used for the isolation of lymphocytes (Corkum et al., 2015[href=https://www.wicell.org#bib2]).\nCritical: Special care is needed not to mix the Lymphoprep-Blood layers to get PBMCs clear of red blood cells. For that, use an electronic pipette controller with a 25 mL pipette. Carefully put the tip of the 25 mL pipette containing 25 mL of blood in touch with the Lymphoprep layer and slowly add the blood on top (Please refer to Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/554-Fig2.jpg\nFigure 2. Schematic representation of the Blood-Lymphoprep layer preparation\nSpin tubes at 800 g in a swing-bucket rotor centrifuge for 30 min at 18°C–25°C with maximum acceleration but with no brake.",
    "Collect the white buffy coat layer that forms an interface between the plasma layer above and the red blood cells below into a clean, sterile 50 mL Falcon tube using sterile pastettes.\nWash the cells with 50 mL RPMI-1640 without additives and spin cells down cells by centrifugation: 5 min at 300 g maximum acceleration and maximum deceleration.\nRepeat step 6 again.\nFinally, resuspend the pellet in 50 mL of RPMI-1640 supplemented with 100 Units/mL Penicillin/, 100 μg/mL Streptomycin and 2 mM L-Glutamine.\nCount the number of cells in a Flow cytometer gating on the lymphocytes based on their forward scatter (FSC) and side scatter (SSC) profile (Figure 3[href=https://www.wicell.org#fig3]). Dilute 10 μL of the cell suspension obtained in step 8 in 490 μL RPMI (1:50 dilution) and count cells in the Flow cytometer for 60 s at a flow rate of 1 μL/s. Using the number of lymphocytes (Figure 2[href=https://www.wicell.org#fig2]) counted in 60 s (60 μL) calculate the total number of lymphocytes in the 50 mL of sample obtained in step 8 taking into account the 1:50 dilution factor.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/554-Fig3.jpg\nFigure 3. Lymphocytes gating using the forward and side scatter profile\nHuman primary CD4+ T cells isolation\nTiming: 3 h\nTransfer 108 lymphocytes into a new 50 mL Falcon tube and spin them down by centrifugation at 300 g for 5 min.\nResuspend cells in 10 mL of sterile PBS supplemented with 0.5% BSA and 2 mM EDTA (PBE buffer).\nCollect cells again by centrifugation at 300 g for 5 min.\nResuspend the cells in 500 μL PBE buffer (sterile PBS supplemented with 0.5% BSA and 2 mM EDTA), transfer to a 15 mL Falcon tube and stain them with 30 μL of anti-CD4-FiTC antibody at +4°C for 15 min.",
    "Transfer 10 μL of stained cells into a 96 well V-bottom plate. This will be your pre-elution sample that will allow you to calculate the total number of positive CD4 T cells in the cell suspension and the efficiency of isolation.\nSpin down cells in the Falcon tube at 300 g for 5 min at +4°C.\nRepeat the PBE wash again to remove unbound antibody.\nResuspend the cells in 500 μL PBE buffer and add 50 μL of anti-FiTC microbeads.\nIncubate the cells at +4°C for 15 min.\nResuspend the cells in 10 mL of PBE buffer and spin them down at 300 g for 5 min at +4°C.\nRepeat step 19 twice to remove the excess of unbound microbeads.\nEquilibrate an LS column on a QuadroMACS separator with 3 mL of PBE.\nResuspend the cell pellet in 3 mL of PBE buffer and proceed to the isolation of CD4 stained cells by Magnetic Activated Cell Sorting using the previously equilibrated LS column using a QuadroMACS separator.\nAfter loading the cells onto the column wash the column three times with 3 mL of PBE buffer. Collect the eluates from the three washes plus the eluate after loading your cells as your flow-through samples. Transfer 10 μL of the flow-through into a 96 well V-bottom plate to check the efficiency of isolation at the end of the procedure.\nFinally, remove the LS column containing the CD4 stained cells from the separator and place it into a 15 mL Falcon tube\nAdd 5 mL of PBE buffer and immediately flush out the CD4 positive T cells by firmly applying the plunger supplied with the LS column. This sample contains the CD4+ T cells. Transfer 10 μL of the flow-through into a 96 well V-bottom plate.",
    "In the 96 well plate containing 10 μL from each sample add another 190 μL to dilute the samples (1:20) and count cell in a flow cytometer to check the efficiency of isolation and to determine the number of CD4+ T cells recovered at the end of the procedure. Add 190 μL of PBE to the 10 μL of samples in the 96 well plate (1:20 dilution) and count cells in a flow cytometer to check the efficiency of isolation and to determine the number of CD4+ T cells recovered at the end of the procedure.\nNote: Usually starting with 108 lymphocytes, ~25–30 × 106 CD4+ T cells with a purity greater than 95% should be recovered.\nActivation and SILAC labeling of cells\nTiming: 10–14 days\nResuspend 107 CD4+ T cells in 5 mL of RPMI-1640 supplemented with Pen/Strep and L-Glutamine and activate them for three days in the presence of 300 μL ImmunoCult Human CD3/CD28 T cell Activator and 20 ng/mL IL-2 under Th1 polarizing conditions: 20 ng/mL IL-12 and 10 ng/mL anti-IL-4.\nAfter three days spin down cells at 300 g for 5 min and resuspend them in 10 mL of light, medium or heavy SILAC RPMI-1640 medium (please refer to Tables 1[href=https://www.wicell.org#tbl1] and 2[href=https://www.wicell.org#tbl2] in the materials and equipment[href=https://www.wicell.org#materials-and-equipment] section) supplemented with 20 ng/mL IL-2, 20 ng/mL IL-12 and 10 ng/mL anti-IL4.\ntable:files/protocols_protocol_554_1.csv\ntable:files/protocols_protocol_554_2.csv\nNote: Prepare amino acids stock solutions in newly opened, sterile PBS and store 0.5 mL aliquots at −20°C. Each aliquot is enough to prepare 500 mL of complete SILAC medium.\nNote: SILAC media for T cells is supplemented with light Proline as T cells can convert arginine into proline affecting the labelling, so by increasing the concentration of proline we block this pathway.",
    "Note: After combining all the reagents required for the preparation of SILAC media filter the media using a 500 mL Stericup Filtration System and keep the media at +4°C.\nCount the number of cells every two-three days and dilute them down to 106 cells / mL. Keep them growing in the appropriate SILAC media (light, medium or heavy) supplemented with IL-2, IL-12 and anti-IL-4 for 5 cell division cycles to ensure complete labeling.\nPreparation of sample for proteomics\nTiming: 2–3 days\nCount cells in a flow cytometer and collect about 108 cells per SILAC labeling (light, medium or heavy) by centrifugation at 300 g for 5 min. Transfer them into a clean T175 flask containing 25 mL of the appropriate SILAC media without IL-2 and starve the cells for 24 h. Alternatively, at this stage cell counting could be done using standard cell counting practices, such as counting slides.\nNote: Cells are starved of cytokines (IL-2, IL-4 and IL-12) for 16 h before stimulation to reduce the basal levels of the signaling pathways engaged by IL-2, IL-4 and IL-12. This step allows us to reduce the confounding effects of having IL-2, IL-4 and IL-12 present during the stimulation with the cytokine of interest (i.e., IL-6 in this study).\nNext day collect cells again by centrifugation, resuspend them in SILAC RPMI-1640 media containing FBS and stimulate them as required. In our case cells were treated as follows:\nT cells grown in light SILAC media were unstimulated and used as a reference control.\nT cells grown in medium SILAC media were stimulated with 20 nM IL-6 for 15 min.\nT cells grown in heavy SILAC media were treated with 2 μM of MSC2530818, a specific CDK8 inhibitor, for 30 min and then stimulated with 20 nM IL-6 for 15 min.",
    "After stimulation, wash cells three times with 50 mL of ice cold PBS, then combine in a 1:1:1 (light : medium : heavy) ratio.\nNote: It is important to check for the label incorporation efficiency. To do so, collect about 106 cells labelled with the different amino acids (light, medium, and heavy) and transfer them into a clean, low protein binding microcentrifuge tube. Follow the same protocol described below, just adjusting the volumes as required and analyze the peptides to determine the percentage of labelling of the different samples. At least, 95% labelling efficiency is required.\nNote: Light, medium and heavy SILAC labels are mixed at this point in order to avoid differences arising from the manipulation of the samples during cell lysis, protein precipitation and digestion, peptide fractionation and enrichment.\nAfter the final wash, resuspend the cell pellet (1 volume) in SDS-lysis buffer (5 volumes) and incubate on ice for 10 min to ensure complete cell lysis.\nNote: SDS-containing lysis buffer should be freshly prepared by dissolving SDS (1% w/v) in 100 mM Triethylammonium Bicarbonate Buffer (TEAB) pH8.\nCentrifuge the cell lysates at 20,000 g for 15 min at +4°C and transfer supernatants to clean Falcon tubes.\nDetermine protein concentrations using a BCA Protein Assay kit.\nTransfer 10 mg of total protein per experiment of combined light, medium, and heavy labeled proteins into a clean, low protein binding microcentrifuge tube and reduce the protein sample with 10 mM dithiothreitol for 1 h at 55°C in order to break all disulfide bridges and linearize the proteins.\nAlkylate the protein sample with 20 mM iodoacetamine for 30 min at 18°C–25°C in order to block the free cysteine residue and avoid the formation of new disulfide bridges.",
    "Finally, precipitate the proteins using six volumes of chilled (−20°C) acetone for 16 h at −20°C.\nAfter precipitation, protein pellets were obtained by centrifugation at 14,000 g for 30 min at +4°C . Then, resuspend protein pellet (10 mg) in 1 mL of 100 mM TEAB and digest with 100 μg of Trypsin (1:100 w/w) for 16–24 h at 37°C. Digestion was done in two steps. First add 50 μg of Trypsin to the protein suspension and incubate for 2 h. Then, add the remaining 50 μg of Trypsin and digest the protein for 16–24 h at 37°C in a thermoblock with shaking at 1000 rpm.\nNote: After resuspension in 1 mL of 100 mM TEAB the protein suspension can look cloudy as proteins will not be completely in solution. This is normal and the protein solution will become clear during protein digestion.\nNote: Trypsin purchased from Thermo in 100 μg vials was reconstituted using 50 mM acetic acid to (1 mg / mL) (i.e., add 100 μL of 50 mM acetic acid to 100 μg of lyophilized Trypsin).\nAfter protein digestion, clear the samples by centrifugation at 20,000 g for 30 min at +4°C, and determine the peptide concentration using a Quantitative Colorimetric Peptide Assay.\nLyophilize 3.5 mg of peptides per sample (already containing the light, medium, and heavy peptides) using an EZ-2 Plus Centrifugal Evaporator (GeneVac, HPLC program, 40 h, 40°C).\nPeptide fractionation\nTiming: 5–6 h per sample\nNote: This step is not required to determine the labelling incorporation efficiency, so samples prepared to check this can be already analyzed by mass spectrometry and .RAW files analyzed by MaxQuant (see below).",
    "Resuspend the lyophilized peptide samples in 200 μL Buffer A (10 mM ammonium formate), trap them on a XBridge trap cartridge (Waters, C18, 3.5 μM, 4.6 × 20 mm) and separate them on a XBridge Peptide BEH column (Waters, C18, 3.5 μM, 4.6 × 250 mm) using an Ultimate 3000 RSLCnano system (Thermo Scientific). Resolve peptides using a gradient (102 min, 0.8 mL/min) of Buffer A (10 mM ammonium formate) and Buffer B (10 mM ammonium formate, 90% acetonitrile): 8% Buffer B for 16 min, 8%–45% Buffer B for 54 min, 45%–100% Buffer B for 5 min, 100% Buffer B for 16 min and 100%–2% Buffer B for 21 min.\nCollect 80 fractions of 0.8 mL each (1 min) using a WPS-3000FC autosampler (Thermo Scientific) from 1 to 80 min over the chromatogram.\nConcatenate fractions to 20 fractions to provide a similar quantity of peptide per fraction based on the online (U3000 Variable Wavelength Detector, Thermo Scientific) UV values of the eluted peptides at 200 nm.\nDry fractions (EZ-2 Plus Centrifugal Evaporator, GeneVac) prior to phosphopeptide enrichment.\nPhosphopeptide enrichment\nTiming: depends on the number of samples to be processed; in our case 2–3 days\nNote: Buffers required for phosphopeptide enrichment and purification are described in Table 3.\nFor phosphopeptide enrichment, use 50 μL (1 mg of beads) of MagResyn Ti-IMAC beads per sample to ensure complete depletion of phosphopeptides. Phosphopeptide enrichment could be done using an automatic processing pipeline (Tape et al., 2014[href=https://www.wicell.org#bib12]).\nFor this protocol 60 fractions of peptides (20 fractions per replica) were being used. Thus, transfer 3 mL of MagResyn (50 μL per sample) into 2 mL clean low protein binding microcentrifuge tube (1.5 mL per tube).\nPlace tubes in a magnetic separator, and after 10–20 s remove the solution.",
    "Resuspend particles in 2 mL of Loading buffer and allow 1 min for equilibration.\nPlace tubes back in the magnetic separator allowing 10–20 s for microparticles to clear. Then, remove the loading buffer.\nRepeat steps 49 and 50 three more times.\nAfter the last step of equilibration distribute microparticles into 60 1.5 mL clean, low protein binding microcentrifuge tubes.\nPlace tubes in a magnetic separator and remove supernatant. Microparticles are now ready for the phosphopeptide enrichment procedure.\nResuspend each peptide fraction in 100 μL of loading buffer and vortex to allow complete resuspension of the peptides.\nCentrifuge samples for 10 min at 15000 g to remove insoluble material and transfer the supernatant into 1.5 mL clean, low protein binding microcentrifuge tubes containing the MagResyn Ti-IMAC microparticles, resuspending the microparticles by vortexing samples for 10 s.\nIncubate the peptide – microparticles mixture for 20 min at 18°C–25°C with continuous mixing.\nCritical: In order to optimize the binding of the phosphopeptides to the TiO2 microparticles it is essential to apply continuous mixing (every 2–3 min, slow vortexing) during the incubation at 18°C–25°C.\nPlace the tube on the magnetic separator, allow 10–20 s for the magnetic beads to separate. Remove and discard the supernatant.\nNote: This supernatant should contain unbound, non-phosphorylated peptides.\nWash the microparticles with 100 μL of loading buffer for 2 min with gentle shaking in order to remove unbound peptides. After this, place the tubes again in the magnetic separator and once the microparticles have cleared remove and discard the supernatant.\nWash the microparticles with 100 μL of Wash buffer 1 for 2 min with gentle shaking in order to remove peptides bound non-specifically.\nRemove the supernatant by placing the tubes back in the magnetic separator and allow 10–20 s for the magnetic microparticles to clear.",
    "Repeat steps 59 and 60 for an additional wash discarding the supernatant after every wash.\nWash the microparticles for 2 min with 100 μL of Wash buffer 2. After incubation place the tubes back in the magnetic separator, remove, and discard the supernatant.\nResuspend the magnetic microparticles with 150 μL of Elution buffer and incubate for 10 min at 18°C–25°C to allow the elution of the phosphopeptides.\nCritical: In order to optimize the elution of the phosphopeptides from the magnetic microparticles it is essential to ensure the microparticles remain in suspension by constant gentle agitation in a shaker at 1000 rpm during the elution.\nRecover the phosphopeptides in suspension by placing the tubes in the magnetic separator for 10 s to allow the magnetic microparticles to clear. After this, transfer the supernatant (eluted phosphopeptides) to a clean 1.5 mL protein low protein binding microcentrifuge tube with 50 μL of formic acid 10%.\nTo maximize phosphopeptide recovery repeat the elution steps 62 and 63 with another 150 μL of Elution buffer.\nPlace the tubes again in the magnetic separator, allow 20 s for microparticles to clear and pool the supernatant with the previously eluted phosphopeptides, adding a further 50 μL of 10% formic acid for a total volume of 400 μL.\nVacuum dry the eluates using an EZ-2 Plus Centrifugal Evaporator (GeneVac, HPLC program, 40 h, 40°C).\nMass spectrometry analysis of phosphopeptides\nTiming: depends on the number of samples to be processed; in our case 1 week\nPhosphopeptide samples were analyzed using a nanoflow liquid chromatography system (Ultimate 3000 RSLCnano, Thermo Scientific) coupled to a Q Exactive Plus Mass Spectrometer (Thermo Scientific).\nNote: Mass spectrometry analysis can be carried out using different system (e.g., Q Exactive HF, LTQ Orbitraps, etc)",
    "Phosphopeptide samples (10 μL) were loaded onto a C18 trap column and washed for 5 min with 0.1% formic acid.\nPhosphopeptides were resolved using a gradient (170 min, 0.3 μL/min) of Buffer A (0.1% formic acid) and Buffer B (80% acetonitrile in 0.08% formic acid): 5% Buffer B for 5 min, 5%–35% Buffer B for 125 min, 35%–98% Buffer B for 2 min, 98% Buffer B for 20 min, 98%–2% Buffer B for 1 min and 2% Buffer B for 17 min.\nPhosphopeptides, initially trapped in an Acclaim PepMap 100 C18 column (100 μm x 2 cm, Thermo Scientific), were separated on an Easy-Spray PepMap RSLC C18 column (75 μm x 50 cm, Thermo Scientific)\nFinally, the phosphopeptides were transferred to a Q Exactive Plus Mass Spectrometer via and Easy-Spray source with temperature set at 50°C and a source voltage of 0.2 kV.\nPeptides were identified with a top 15 method (1 MS plus 15 MS2, 150 min acquisition) consisting of full scans and mass range (m/z) between 350 to 1600 (m/z) for MS search and 200 to 2000 (m/z) for MS2 search.\nFor the MS2 scan the Q Exactive Plus Mass Spectrometer was operated in a data dependent acquisition mode, resolution of 70,000 with a lock mass set at 445.120024 and max fill time of 20 ms.\nFor the MS2 scan the Q Exactive Pluss Mass Spectrometer was operated in a centroid mode, resolution of 15,000 with isolation window = 1.4 (m/z), normalized collision energy = 27, max fill time of 100 ms and dynamic exclusion of 45 s.\nAnalysis of mass spectrometry raw files\nTiming: depends on the number of samples to be processed; in our case 1–2 week",
    "Q Exactive Plus Mass Spectrometer .RAW files were analyzed and phosphopeptides identified and quantified using MaxQuant software (Cox and Mann, 2008[href=https://www.wicell.org#bib3]), utilizing the built-in search engine Andromeda (Cox et al., 2011[href=https://www.wicell.org#bib4]).\nNote: There are available different proteomic software for phosphopeptide identification and quantitation (e.g., PEAKS (Bioinformatics Solutions), Proteome Discoverer (Thermo), Scaffold (Proteome Software)).\nAll settings were set as default, except for minimal peptide length of 5, and the Andromeda search engine was configured for the Uniprot Homo sapiens database (release date: 2018_09).\nOnly phosphopeptides quantified in at least two out of three replicates were considered, and the p values were determined by Student’s t test corrected for multiple testing using the Benjamini–Hochberg procedure (Benjamini and Hochberg, 1995[href=https://www.wicell.org#bib1]).\nGO analysis were carried out using DAVID GO analysis tools (Huang da et al., 2009[href=https://www.wicell.org#bib5]; Huang et al., 2007[href=https://www.wicell.org#bib6])."
  ],
  "subjectAreas": [
    "Immunology",
    "Cell Isolation",
    "Proteomics",
    "Signal Transduction",
    "Protein Biochemistry"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}