{
  "id": 9711,
  "origin_website": "Jove",
  "title": "Neuromodulation and Mitochondrial Transport: Live Imaging in Hippocampal Neurons over Long Durations",
  "procedures": [
    "1. Description of Lab-built Stage-top Incubator\n Maintaining living cells on a microscope stage for extended durations offers three major challenges: 1) ambient temperature control and regulation; 2) humidity control, i.e., maintaining moisture content of environmental atmosphere; and 3) maintenance of proper pH in the culture medium.  These 'life support' issues are critical for experiments involving the long-term observation of cultured neurons, cells that are particularly sensitive to changes in temperature and pH.  Below, we describe a simple lab-built stage-top incubator that we designed and constructed for live imaging of neurons over extended durations.  This incubator is connected, via a closed circuit, to a standard tissue culture incubator (Thermo Scientific, Asheville, NC), which provides a stable heated (37°C), humidified atmosphere of 10% CO2/90% air.",
    "Incubator enclosure: The body of the incubator (Figure 1(I, II); A) was fabricated on a computerized C&C milling machine from a solid piece of black delrin plastic. It measures  97.74mm (L) x 73.60mm (W) x 28.58mm (H), (internal dimensions of 96.74mm x 72.60mm x 27.58mm) providing a closed volume of approximately 19,370cm3.  Two holes were drilled at either end of the enclosure and fitted with threaded brass barbs to accommodate inlet and outlet hoses from/to the tissue culture incubator.  A rectangular opening measuring 70.0mm x 43.0mm was milled out at the top of the enclosure to allow placement of a polycarbonate plastic window (Figure 1(I, II); B).  The base of the incubator (Figure 1(I, II, III); C; top view and profile shown in detail at top left), milled from 3/16\" aluminum stock, measures 159.77mm (L) x 109.86mm (W) x 3.175mm (D), and is designed to fit into the insert recess of a Leica motorized 3-plate stage (Model 11-522-068, Leica GmBh, Leipzig, Germany).  Four steel posts with internal threads were attached to the corners of thebase by flush-mounted flat-head screws.  These provide solid attachment points for the incubator enclosure, which has been drilled out at each corner to accept the posts (Figure 1(II, III); D).  A sorbothane gasket (McMaster Carr, Inc., Elmhurst, IL) was cut and fitted to the base to provide a seal at the enclosure/base interface.  Four brass thumbscrews with threading matching that of the posts are used to secure the enclosure to the base (Figure 1(II, III); D).  A 35.1mm diameter hole with a thin recessed lip was cut at the center of the incubator base to accommodate 35mm GBMs (Figure 1(III); E; detail at top left); additional bases have been designed to accommodate other culture dish sizes.",
    "Heating elements: Two 10 Kohm heat sink resistors (Digi-Key Corp., Thief River Falls, MN) are affixed to the inner walls of the incubator enclosure.  These are wired to a 9V DC, 500mA transformer that is plugged into an Alife 1000W terrarium temperature controller (Carolina Pet Supply, Irmo, SC). A wired probe placed through a gasket in the polycarbonate window of the incubator enclosure detects internal ambient temperature and determines current flow to the resistors.  In conjunction with the tissue culture incubator, the resistors provide an added measure of ambient temperature control.\nClosed circuit atmosphere system: To provide a constant humidified and heated atmosphere of 10%CO2/90% air, the stage-top incubator is connected, via inlet and outlet hoses (Figure 1(I); F, G), to a standard, water-jacketed tissue culture incubator (Figure 1(I); H); Forma Scientific Model 3154; Thermo Scientific, Inc., Asheville, NC).  Just before connecting to the stage-top incubator, the inlet hose (Figure 1(I); F) runs into a standard aquarium pump (Figure 1(I); I; Lifegard QuietOne Model 1200, Pentair Aquatics, El Monte, CA) that has been enclosed in a sealed ABS plastic box (Figure 1(I); J; Model 1150, Pelican Products, Inc., Torrance, CA) to maintain a closed circuit.  This pump promotes continuous airflow from the tissue culture incubator to the stage-top incubator.  After the pump stage, the inlet hose runs to a 1500ml Erlenmeyer flask (Figure 1(I); K) that acts as a muffler to minimize transmission of vibration from the pump to the stage-top incubator.  An outlet hose (Figure 1(I); G) leading from the stage-top incubator to the tissue culture incubator (Figure 1(I); H) is fitted with an enclosed computer fan (Figure 1(I); L), which, like the pump, is also intended to promote continuous airflow.",
    "PFTE membrane lid for 35mm GBM: Prior to placing the neuronal culture in the stage-top incubator for imaging, the 35mm GBM is fitted with a special membrane lid (Figure 1(II, IV); M; detail shown at top right) to allow gas exchange and at the same time minimize evaporation of culture medium.  This lid consists of a delrin plastic rim and a pre-cut sheet of PFTE membrane (Teflon; American Durafilm Co., Inc., Holliston MA) that has been stretched over the rim and held in place with a viton gasket that slips into a recessed channel along the side of the delrin plastic rim.\nInjection ports: Two holes were drilled into the polycarbonate window (Figure 1(II), center detail, yellow arrows near B) of the stage-top incubator.  These were fitted with stainless steel Hamilton syringe ends to provide injection ports for administering 5-HT, DA, various receptor agonists and antagonists, and other reagents during a given experiment. \n2. Preparation of Primary Hippocampal Cultures\nAll of the work is performed in either a BSL2 laminar flow hood or in a laminar flow bench. Primary hippocampal neurons are isolated from E18 rat embryos according to standard procedures6-7, and are grown in serum-free medium that has been conditioned by primary cortical astrocytes.  Glial cells are prepared according to published methods7.  The conditioned medium consists of low glucose DMEM, supplemented with proline (1.76 ug/ml), asparagine (0.83 ug/ml), vitamin B12 (0.34 ug/ml), glucose (20mM), lipid-rich BSA (0.5 mg/ml) and 2% of B278-10. No antibiotics are added to the medium as they may interfere with neuronal gene transcription.",
    "Cover the central glass coverslip portion of a 35mm glass-bottom culture dish (GBM) with poly-D-lysine (0.05 mg/ml in PBS), and leave standing for two hours at 37°C.  Aspirate the poly-D-lysine solution, allow to dry for 20 minutes in a BSL2 laminar flow hood. Cover the poly-D-lysine-coated coverslip portion of the GBM with laminin (0.01 mg/ml in PBS), and leave for a minimum of 40 minutes before removing the excess laminin solution.  Set aside for 20 minutes.\nDissect hippocampi from the brains of E18 rat embryos, and dissociate them as described in Current Protocols in Neuroscience6.\nDilute dissociated cells into growth medium to allow for a density of 110,000 cells per GBM.  Calculate the necessary concentration of cells in your master mix according to the number of GBMs you will be preparing.\nPlace seeded GBMs in an incubator set ata temperature of 37°C and an atmosphere mixture of 10% CO2/90% air.\nThree to five days later, depending on the growing conditions of the neurons, add arabinoside C  (0.14 ng/ml) to the cultures to suppress glial proliferation.\nAllow the cultures to grow for two weeks before infecting with the lentivirus.  During this time, replace one third of the volume of medium in each GBM with fresh medium every three days.  Do not exceed this amount of media, as this may lead to osmotic shock and cell death.\n3. Preparation of Recombinant Lentivirus Encoding Red Fluorescent Protein\n For investigators who do not have access to facilities for producing recombinant lentiviruses, custom production by a commercial entity e.g. System Biosciences (Mountain View, CA) is an option.",
    "A mitochondrially-targeted red fluorescent protein gene (MitoTurboRFP; Axxora LLC, San Diego, CA) is inserted into a self-inactivating recombinant feline immunodeficiency virus under the transcriptional control of the enhancer from the cytomegalovirus major immediate early gene promoter11. Recombinant lentiviruses are produced by transiently transfecting 293T cells.\n Plate 293T cells at a density of ~75,000 cells/ cm2, the following day, co-transfect the cells with plasmids encoding the recombinant viral vector, FIV gag and pol genes, and the vesicular stomatitis virus G glycoprotein gene, using PolyJet (SignaGen Laboratories, Gaithersburg, MD). A total of 12 ug of DNA (4.8 μg viral vector, 4.8 μg gagpol plasmid, and 2.4 μg VSV G plasmid) is used for every 10cm culture dish of 293T cells.\nAfter 24 hours, aspirate the culture medium and wash cells with phenol red-free Hanks balanced salt solution to remove residual DNA. Add 10ml of serum-free neural basal medium supplemented with 50μg/ml lipid-rich BSA and Glutamax .\nThe following day, harvest the supernatant, filter through a 0.2 micron low protein binding filter and add to a Vivaspin 20 polyethersulfone ultrafiltration unit (Sartorius, Concord, USA). Pre-treat the Vivaspin unit by sequentially washing with 70% ethanol, tissue culture grade water, and phosphate- buffered saline. Concentrate the virus-containing supernatant ~50-fold by centrifugation at 1500xg for 30 minutes. Aliquot the virus preparation and store in liquid N2.\nEstimate the amount of virus by infecting rat B104 cells with an aliquot of concentrated virus, and measuring fluorescent protein expression by flow cytometry 72 hours later. The percentage of positive cells provides an estimate of the amount of virus i.e. volume of concentrated virus needed to obtain fluorescent protein expression in a given number of primary neurons.\n4. Infection of Cultured Neurons",
    "Hippocampal neuron cultures are infected at 14 days in vitro by simply adding the amount of virus estimated to infect up to 50% of all neurons based on flow cytometry data. No polybrene is used. Cultures are maintained for 3 days before checking for fluorescent protein expression.  If the signal is too weak, then the culture is returned to the tissue culture incubator and retested after several days.\n5. General Maintenance of Closed Circuit Life Support System\nTo maintain proper humidity, make sure that the incubator's water jacket is periodically checked and filled when necessary.  Be sure to place a stainless steel or aluminum tray inside the incubator containing a small volume of water (25mm deep) and algicide.\nWhen necessary, clear the inlet and outlet hoses of the incubator atmosphere circuit by emptying collected water from the catchment tubes.  Periodically flush the hoses with 70% ethanol.\n6. Applying Membrane Lid to GBM and Placement in Stage-top Incubator\nPrior to placement of the GBM inside the stage-top incubator, replace the plastic lid with the membrane-covered lid in a tissue culture hood.  Once this is done, you may move the covered GBM to the microscope.\nCarefully seat the GBM with the membrane-covered lid in the recessed opening on the base of the stage-top incubator.  To avoid jostling the GBM, make sure that the base is already in place on the microscope stage; since the base clips into the stage with some difficulty, it is best to place the GBM after the base is in position.\nAlign the incubator enclosure with the steel posts on the incubator base and lower the enclosure onto the base.  Tighten the thumbscrews until a good seal is achieved between enclosure and base.\n7. Image Acquisition",
    "Note that the majority of available imaging software platforms have comparable functionality across a wide range of microscopes and related hardware.  A variety of image acquisition and analysis software platforms are available, including MetaMorph and programs designed for specific makes of microscope, such as Leica Application Suite, Nikon's NIS-Elements, and Carl Zeiss' AxioVision.  In this protocol, we describe the image acquisition and analysis procedures we performed using Slidebook 5 (Intelligent Imaging Innovations, Denver, CO).  However, the constituent steps of each operation described in this protocol can be readily adapted to the use of a variety of other programs.\nDescription of inverted fluorescence microscope, filter configurations, CCD camera, xenon light source, and imaging software:\nFor dynamic imaging of mitochondrial transport in hippocampal neurons, we use a Leica DMI-6000B inverted fluorescence microscope and Model 11-522-068 motorized stage (Leica Microsystems CMS GmbH, Wetzlar, Germany) fitted with a Cooke Sensicam EQ CCD camera (The Cooke Corporation, Romulus, MI), a Sutter Lambda 10-2 filter wheel and controller (Sutter Instrument Company, Novato, CA), and a Sutter DG-4 300W xenon light source.  To visualize mitochondria labeled with the MitoTurbo Red fluorescent protein, we use the combination of a 555nm filter at the DG-4 light source for excitation and filters of 600nm (peak; Sedat Quad Beamsplitter Model 86100bs fitted to Leica DM series filter cube, Chroma Technology Corp., Bellows Falls, VT) and 617nm at the microscope and filter wheel, respectively, for emission.\nFor image acquisition and analysis, we use the digital microscopy imaging software package Slidebook 5.  This is a comprehensive package that allows fully automated control of the microscope, stage, filter wheel, camera, and light source during image acquisition, as well as a variety of image processing and analysis modules.",
    "Below, we provide specific, step-by-step instructions for acquiring time lapse images of moving mitochondria in fluorescently labeled neurons using Slidebook 5.\nMake sure that the microscope, filter wheel controller, light source, and CCD camera have been turned on before opening Slidebook 5.\nFor live imaging of mitochondria, switch to a 63X oil-immersion objective, lower the objective turret sufficiently to provide access to the objective below the microscope stage (and stage-top incubator), and carefully apply oil directly to the surface of the objective.  Open the focus window by clicking the 'Focus Window' icon on the Slidebook toolbar.  In the focus window, turn on the brightfield lamp by sliding a slider labeled 'lamp' to adjust brightfield intensity to a suitable level.  Acquire focus on a field of cells and find a cell of interest. \nUnder the 'Scope' tab, select the 'CY3' fluor.  Using the oculars, under fluorescent illumination find the plane of focus for mitochondria in the cells that have been labeled with the Mito TurbRed protein.  Once you have acquired focus through the oculars, switch to the CCD camera and re-acquire focus if necessary.\nOpen the image capture window by clicking the 'Image Capture' icon on the Slidebook toolbar.  Starting with an initial exposure time of 100ms, find the optimal exposure time using the 'Test' and 'Find Best' buttons; alternatively, you can use the 'Once' button.  Remember that exposure time should provide ample intensity spread across the entire image field (e.g., 0-2500; indicated by histogram at the bottom of the image capture window) within a minimum duration (e.g., 200-800ms).",
    "Before starting time-lapse image acquisition, open the 'Advanced' window by clicking the 'Advanced' tab still within the image capture window.  Find the 'Focus' tab, check the 'Autofous' during time-lapse/multipoint captures' option, and adjust the autofocus settings for time-lapse image acquisition.  Generally, we use the following parameters for autofocus: update focus every 2-3 frames; select as the autofocus channel the fluor used for imaging labeled mitochondria, i.e., CY3; total search range 2 um for 63x magnification.\nIn the 'Capture' window, under 'Capture Type' box, check the 'Timelapse' option and select the desired imaging interval and duration of imaging session under 'Timelapse Capture' options.  In our studies of the effects of neuromodulators on mitochondrial transport, time-lapse imaging was performed in one hour sessions in which a total of 360 images were acquired at 10 second intervals between images.\nStart time-lapse image acquisition by clicking the 'Start' button at the bottom, right side, of the 'Capture' window.\nAfter the initial, or control, imaging session, administer neurotransmitters and other reagents via the top ports of the stage-top incubator and start a new imaging session.\n8. Image Analysis\nOpen the image file saved after the last imaging session.\nIndividual mitochondria can be labeled in a time-lapse image series either automatically or manually by employing the masking functions provided in Slidebook 5.\nUnder the 'Mask' menu, select 'Segment' from the menu bar.  By sliding the low and high threshold line of the 'histogram' tool, masking all the particles in blue in the entire image, covering all the mitochondria contained in the process, but leaving particles as discrete as possible.  Apply the mask to the entire image series.",
    "Create a second mask (under the 'Mask'  menu, select 'Create') that covers the entire image except for the process of interest in which the particles has been highlighted by the previous mask.  This is accomplished, first, by using the thickest 'pencil' tool to trace the boundaries of the areas outside of the process, and then, using the 'paint bucket' tool to fill in the bounded regions.  Apply this mask to the entire image series.\nUnder 'Mask,' select 'Mask Operations' and perform 'Minus' operation, i.e., the second mask is subtracted from the fist mask (the entire image except the process).  A third mask will be generated in which only the process of interest is highlighted.  Note that this new mask will be applied to the entire image series.\nUnder 'Annotations,' select 'Object IDs.' \nVerify the continuity and numerical assignments of individual masked mitochondria by manually reviewing the image series (in Slidebook 5, the 'play,' 'forward frame,' and 'reverse frame,' buttons below the image window can be used for this purpose).\nSelect the 'Mask' tab on the menu bar.  Under 'Mask,' select 'Particle Tracking' and run 'Basic Particle Tracking' to generate 'Path Statistics,' including coordinates of the centroid for each masked mitochondrion.\nDistance traveled by each mitochondrion between two adjacent image frames is calculated from the coordinates of each particle in each frame.",
    "In our previous studies of the effect of neuromodulators on mitochondrial movement, we identified three distinct populations of mitochondria: 'stationary,' 'oscillatory,' and 'directionally moving.' If a mitochondrion travels less than 0.2 um (or 2 pixels, under 63X magnification; 1 pixel=0.10235 um) within one hour, it is characterized as 'stationary.'  If a mitochondrion moves at least 0.2 um, but less than 2.5 um, in an anterograde-retrograde cycle, it is defined as 'oscillatory.'  Finally, if a mitochondrion travels a net distance of more than 2.5 um in one direction, it is categorized as moving directionally.  Depicted in Figure 2 is a histogram showing the movement of all labeled mitochondria in a representative experiment, as well as a pie chart showing percentage distribution of the three distinct populations of mitochondria.\nAverage speed of each mitochondrion is calculated according to total distance traveled during a given imaging session.  The mean speed of a mitochondrial population is calculated by adding individual speeds and dividing by the total number of mitochondria tracked.\nKymographs can be generated using a module provided in Slidebook 5.  Using the 'Mask' function, draw a thin line across the entire extent of a given process (e.g. axon); be sure to pass through as many mitochondrial centroids as possible.  Go to the 'Mask' tab on the menu bar and select 'Advanced Operations,' and then 'Smooth Curve Analysis.' Use the default setting for smooth curve analysis or customize as desired. Run the smooth curve analysis module.  At the end of the analysis, a kymograph of the imaging session will be displayed.\nGo to the menu bar and select 'View,' and then 'Export TIFF.'\nOpen the saved .tif file containing the kymograph in Photoshop or a comparable image processing program and convert the image to inverted grayscale.\n9. Representative Results",
    "By tracking and analyzing mitochondrial movement in cultured hippocampal neurons, we have demonstrated a link between neuromodulation and mitochondrial trafficking.  Specifically, we found that serotonin (5-HT) or the 5-HT1A receptor agonist, 8-OH-DPAT, stimulates mitochondrial movement (Figure 2A-C)8,whereas dopamine (DA) or the D2 receptor agonist, bromocriptine, inhibits mitochondrial movement (Figure 2D-G)9.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2599/2599fig1.jpg\nFigure 1. Design of closed circuit stage-top incubator system.  The following components of the incubator system are shown: Heat-resistant delrin plastic enclosure (A); rectangular opening for polycarbonate plastic window (B); aluminum base of the incubator (C); holes to accept steel posts of base (D); 35.1mm diameter hole with thin recessed lip at the center of incubator base to accommodate 35mm GBM dishes (E); nalgene hoses (connections between tissue culture and stage-top incubators; moisture traps) (F,G,N); tissue culture incubator (H); aquarium pump (I);  air-tight ABS plastic box (housing for aquarium pump) (J); 2000ml Erlenmeyer flask (muffler for vibration suppression in hose before stage-top incubator) (K); plastic enclosure for cooling fan (L); plastic frame for 35mm GBM lid (M); position of plastic stopcocks (O).  Locations of ports for administration of reagents are indicated by yellow arrows in (II).\n imgsrc://cloudfront.jove.com/files/ftp_upload/2599/2599fig2.jpg",
    "Figure 2. Representative results: regulation of mitochondrial transport. A. Axon of a typical rat hippocampal neuron in culture. Mitochondria labeled with a lentivirus-encoded fluorescent protein are shown in green; axons immunolabeled with phospho-neurofilament antibody are shown in red. Extent of axon is indicated by yellow arrowheads. Image is composed of four overlapping micrographs. B. Example of a time-lapse image series showing changes in mitochondrial movement after administration of 5-HT.  Images were acquired via an inverted fluorescence microscope and stored as sequences that were later converted to Quicktime movies.  A representative sequence of Images shows individual mitochondria at different time points before (left panel) and after (right panel) administration of 8-OH-DPAT, a 5-HT1A receptor agonist. Vertical red rectangle highlights a stationary mitochondrion (left) and an oscillatory mitochondrion (right) over multiple time points.  The oscillatory mitochondrion indicated (left panel) is moving toward the axon terminal after treatment with 8-OH-DPAT (right panel; red-bordered white arrowheads). The vertical yellow line (right panel) indicates the starting position of the moving mitochondrion.  Time intervals are shown in the lower right-hand corner of each frame. Magnification (63×) is indicated at the lower right corner of right panel. C, D. Plots showing changes in mitochondrial movement after administration of 5-HT.  Changes in mitochondrial movement before (C) and after (D) administration of 5-HT are presented as plots of velocity (X axis) vs. initial positions of individual mitochondria along the axon (Y axis). Velocity and proportion of stationary (red), oscillatory (blue), and directionally moving (green) mitochondria are represented in plots and pie charts (insets above plots), respectively.  Red dotted lines projecting from highlighted regions of the cartoon axon to the Y-axis of each plot indicate approximate location and extent of the axon segment that was imaged.  E, F. Plots showing changes in mitochondrial movement after administration of DA.",
    "Changes in mitochondrial movement before (E) and after (F) administration of DA are presented as plots of velocity (X axis) vs. initial positions of individual mitochondria along the axon (Y axis).  Velocity and proportion of stationary (red), oscillatory (blue), and directionally moving (green) mitochondria are represented in plots and pie charts (insets above plots), respectively.  Red dotted lines projecting from highlighted regions of the cartoon axon to the Y-axis of each plot indicate approximate location and extent of the axon segment that was imaged.  G, H. Representative kymographs showing mitochondrial movement in a cultured neuron before (G) and after (H) administration of the D1R receptor agonist, bromocriptine. The neuron was imaged for one hour before (G) and one hour following (H) administration of bromocriptine."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}