{
  "id": 18830,
  "origin_website": "Jove",
  "title": "Osteopathic Manipulative Treatment as a Useful Adjunctive Tool for Pneumonia",
  "procedures": [
    "The five OMT's described here are a small representation of the osteopathic procedures that can be utilized for a patient with pneumonia when indicated. These techniques focus on improving thoracic cage compliance, improving lymphatic and circulatory flow, and balancing autonomic tone. These techniques are similar to the techniques utilized in the three OMT studies demonstrating efficacy in treating patients with pneumonia.\n1. Muscle Energy to Rib 1 - Exhalation Dysfunction 24,25\nAssess rib 1 motion by placing a first digit on the posterior aspect of the patient's first rib, second digit on the supraclavicular portion of the first rib, and third digit on the infraclavicular portion of the first rib. Palpate for restricted motion or tissue congestion.\nPatient lies supine on table. Stand on the opposite side of the rib dysfunction (for example, if it is a left Rib 1 Exhalation Dysfunction, stand on the patient's right side and vice versa).\nReach the caudad hand under the patient and grasp the rib angle of the dysfunctional rib 1. Apply traction in an inferolateral direction.\nPlace the dorsum of the patient's left wrist on forehead. Then, place a hand over patient's wrist.\nHave the patient take a deep breath in while moving the rib inferiorly to engage the restrictive barrier.\nHave the patient hold his or her breath for 3-5 seconds while attempting to lift their head against isometric resistance provided by a hand.\nRepeat steps 1.5-1.6 three to five times while re-engaging a new restrictive barrier after each repetition. \nFollowing the last repetition, a final, passive stretch is performed further into the restrictive barrier.\nRe-assess rib 1 motion and check for signs of improvement. \n2. Muscle Energy to Rib 1 - Inhalation Dysfunction 24,25\nSit at the head of the table while the patient lies supine.",
    "Assess for dysfunction using digital palpation of rib 1. Place a thumb on the posterior aspect of the rib, second digit on the supraclavicular portion, and third digit on the infraclavicular region. Feel for restricted motion or local tissue congestion.\nMonitor the head of the dysfunctional rib in the supraclavicular fossa with a thumb.\nFlex patient's head forward with the opposite hand until motion is felt at rib 1 in order to relieve the tension of the anterior scalene muscles.  \nInstruct the patient to inhale and exhale deeply. As the patient exhales, move rib 1 inferiorly into the restrictive barrier. Instruct the patient to hold his/her breath in exhalation for 3-5 seconds.\nWhile the patient holds his/her breath in exhalation, instruct patient to push his/her head backwards against isometric resistance. This should last for 3-5 seconds while the patient is holding his/her breath.\nWhen the patient inhales, resist the natural tendency of the rib to move superiorly with inhalation.\nRepeat steps 2.5-2.7 three to five times, while re-engaging a new restrictive barrier with each repetition. After the final repetition, a passive stretch is performed further into the restrictive barrier.\nRe-asses rib motion to evaluate for any improvement. \n3. Doming the Thoracic Diaphragm 24,25\nAssess thoracic cage motion bilaterally by palpating the rib cage while the patient inhales and exhales.\nPatient lies supine on the table. Stand on either side of patient. Thumb tips should be placed inferolateral to the xiphoid process and rest along the anterolateral costal margin below rib 7, which corresponds to muscular attachments of the respiratory diaphragm. The remaining digits should rest along the inferolateral border of ribs 8-10.",
    "Instruct the patient to “take a deep breath and then breathe all the way out.” As the patient exhales, follow the diaphragm by pressing thumbs posterior towards the table. \nHold this point on the diaphragm as the patient takes the next deep inhalation. During the next exhalation, a further cephalad motion of the diaphragm is recommended (within a reasonable means and not providing any excessive discomfort to the patient). Continue to monitor the superior movement of the diaphragm. \nRepeat steps 3.3-3.4 for three to five respiratory cycles, or until the diaphragm domes easily at the end of exhalation. \nRe-asses by monitoring the diaphragm for improvement in excursion.\n4. Seated Rib Raising 24,25\nAssess respiratory motion by palpating the rib cage. In particular, assess specific ribs for individual restrictions that impede the motion of the entire thoracic cage.\nBegin by having patient seated. Stand facing the patient with one foot behind the other.\nInstruct patient to cross his or her arms and rest their elbows on your shoulder. Patient may rest his/her head on his/her arms. \nReach underneath the arms of the patient. Position finger pads near the costotransverse articulation, at the level of ribs 2-6. The finger pads are used as a fulcrum for extension of the patient's spine.\nLean weight onto the back foot and draw patient forward, providing an anterior-lateral traction of the rib angles. Also, extend the patient's spine by shifting center of gravity posteriorly, thereby stretching the intercostal spaces and engaging the restrictive barrier.\nHold this position for one second, and then release by allowing your weight to transfer forward to the more anterior foot and the patient to spring back to a more upright position.",
    "Move finger pads down one rib level and repeat steps 4.5-4.6. Continue this step-by-step down the rib levels until the rib levels are out of reach (typically around ribs 6-8).\nReverse the procedure by working back up the rib cage until reaching rib 2.\nDetermine success of treatment by reassessing rib motion of previously restricted rib levels.\n5. Thoracic Pump with Respiratory Assist 24,25\nAssess thoracic cage motion bilaterally by palpating the rib cage while the patient inhales and exhales.\nThe patient is positioned supine on table, while the physician stand at the head of the table. The table height should be adjusted to a comfortable height where the hands can fully extend onto patient's pectoral region.\nPlace hands over the patient's pectoral region, with heels of hands just distal to clavicles and thumbs at approximately 45 degrees to sternum. \nInstruct patient to inhale and exhale deeply. Provide a compressive force downward onto the chest cage. Then, oscillate the degree of compression to produce a pump motion. Continue for approximately one minute or until adequate time passes for proper lymph flow.\nRespiratory assist is initiated by instructing the patient to inhale deeply and then exhale deeply. During the exhalation phase, follow the chest wall down until exhalation is complete. At the end of exhalation, hold chest wall in place and provide resistance while patient begins inhalation. Follow this step (step 2d) for several cycles of inhalation/expiration (2-6 cycles).\nDuring the final inhalation phase, right before the patient has completed a full deep inhalation, rapidly remove hands from patient's chest to allow for a sudden influx of air into the patient's chest.\nRe-asses for improvements by palpating thoracic motion."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}