{
  "id": 4228,
  "origin_website": "Cell",
  "title": "In-yeast reconstruction of the African swine fever virus genome isolated from clinical samples",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nConcentration of ASFV particles and isolation of high molecular weight viral genomic DNA\nTiming: 2 h\nThis step describes the concentration of viral particles from the serum of domestic pigs experimentally infected experimentally with ASFV via ultracentrifugation and the subsequent isolation of high molecular weight viral DNA (vDNA). Organ material from a field case of ASF in Western Georgia in June 2007 was obtained from Tinatin Onashvili and Cezar Machitidze, Laboratory of the Ministry of Agriculture (LMA), Tbilisi, Georgia. Spleen homogenate was used to infect six 6-week-old male specific pathogen-free Large White pigs by oro-nasal (three pigs) or intramuscular (three pigs) application. Sera were collected five days after infection for further processing in this protocol. On the fifth day after infection, the serum of ASFV- infected pigs contained ∼108 ASFV genome equivalents and was processed as described below. The same protocol can be applied for isolation of vDNA from cell-culture supernatants containing viral particles.\nForm a sucrose cushion by adding 2 mL of a 20% sucrose solution in a 13.2 mL ultra-clear centrifuge tube (Beckman Coulter, see key resources table[href=https://www.wicell.org#key-resources-table])\nOverlay the sucrose with 7 mL of ASFV-infected pig serum by gently pipetting down the side of the tube\nCarefully add phosphate buffer saline (PBS) (see key resources table[href=https://www.wicell.org#key-resources-table]) up to 2–3 mm from the top of the tube.\nCentrifuge at 50,000 × g for 90 min.\nNote: Familiarize yourself with the user manual and safety instructions before using the rotor and operating the ultracentrifuge.\nCarefully discard the supernatant by pipetting without disturbing the pellet. Usually a discrete pale-white pellet is visible.\nResuspend the pellet in 200 μL of PBS.\nExtract the virus DNA using the MagAttract HMW DNA Kit (Qiagen) according to manufacturer’s instructions (see here[href=https://www.qiagen.com/us/resources/resourcedetail?id=3e331b6c-0742-483b-b74f-a7be2d4c1116&lang=en]).",
    "Transformation-associated recombination (TAR) cloning of ASFV sub-genomic fragments\nTiming: 1 day (+ 2 days of incubation after yeast transformation)\nThis section describes all the necessary steps required for the individual isolation of the different ASFV sub-genomic fragments in yeast. It encompasses the generation of the different TAR vectors carrying the appropriate hook sequences up to their individual co-transformation in yeast spheroplasts along with the previously isolated high-quality ASFV genomic DNA. Each of the five sub-genomic fragments has to be isolated individually but all the transformations can be performed in parallel.\nInsertion of the overlapping regions (hooks) and I-SceI restrictions sites in the pCC1BAC-Ura3 TAR vector\npCC1BAC-Ura3 plasmid (10 ng/μL) was used as DNA template in the following PCR reaction.\ntable:files/protocols_protocol_985_10.csv\ntable:files/protocols_protocol_985_11.csv\nPrimeSTAR GXL DNA polymerase was selected as it consistently resulted in specific amplicons. Alternative high-fidelity DNA polymerases such as the KOD Hot Start DNA polymerase (#71086, Merck) can also be used.\nPCR products were separated and visualized on a 0.8% agarose gel containing RedSafe 1×, which is a substitute for ethidium bromide.\nOptional (but recommended): Add 1 μL of DpnI restriction enzyme directly to the PCR mixture without prior treatment and incubate for 1 h at 37°C in a temperature-controlled heat block to digest template DNA. After 1 h, add another 1 μL of DpnI and incubate for an extra hour.\nDpnI-treated PCR products are purified using the High Pure PCR product purification kit (Roche) following manufacturer’s recommendations (here[href=https://www.sigmaaldrich.com/deepweb/assets/sigmaaldrich/product/documents/184/921/hppcrpkrobul.pdf]).\nPurified PCR products are quantified individually by measuring the absorbance at 260 nm using the μCuvette® G1.0 of the Biospectrophotomer (Roche) and concentrations are adjusted to 100 ng/μL when possible.\nYeast spheroplasts preparation\nStart an overnight culture of S. cerevisiae VL6-48N in 10 mL YPDA (pH 6.5) medium at 30°C under agitation (200 rpm).",
    "The next morning, measure the OD600nm and use the appropriate volume to start a fresh 100-mL S. cerevisiae VL6-48N culture in YPDA with an initial OD600nm of ∼0.2.\nWhen the OD600nm of this new culture reaches ∼2, collect yeast cells by centrifugation at 1,750 × g for 3 min, discard the supernatant and resuspend the pellet in 20 mL of 1M sorbitol. Incubate overnight at 4°C.\nCollect the yeast cells by centrifugation at 1,750 × g for 3 min at 4°C. Resuspend the pellet in 10 mL of SPEM solution (see recipe) in a 50-mL sterile centrifuge tube.\nAdd 20 μL of ß-mercaptoethanol and 20 μL of Zymolyase®-100T solution (see recipe) and incubate at 30°C with gentle agitation (80 rpm) until spheroplasts are ready.\nCritical: The formation of spheroplasts needs to be assessed by comparing the OD600nm measurements of a 1/10th dilution of the spheroplast solution in a 1M sorbitol solution (intact spheroplasts) versus in a 2% SDS solution (lysed spheroplasts). Spheroplasts are considered ready when the ratio between the two readings is comprised between 3 and 4. Ideally, OD600nm of 0.8 and 0.2 should be obtained when cells are diluted in 1M sorbitol and 2% SDS solutions, respectively.\nWhen spheroplasts are ready, add immediately 40 mL of 1M sorbitol and mix gently by inversion.\nCollect the yeast cells by centrifugation at 1,200 × g for 5 min at 4°C.\nGently resuspend the pellet in 20 mL of 1M sorbitol using a 25-mL serological pipette. Add another 30 mL of 1M sorbitol and gently invert the tube 2–3 times.\nCollect spheroplasts by centrifugation at 1,200 × g for 5 min and resuspend the pellet in 2 mL STC (see recipe). Incubate at room temperature for 10 min.\nSpheroplast transformation",
    "Mix 100 μL of yeast spheroplast with 5 μg of ASFV genomic DNA and 250 ng of the PCR-amplified pCC1BAC-Ura3 TAR vector containing the appropriate hooks (i.e., sharing overlaps with the ASFV sub-genomic fragment to clone). Incubate at room temperature for 10 min.\nNote: One transformation is performed per tube, which corresponds to the individual TAR cloning of one ASFV sub-genomic fragments. In total, seven independent transformations need to be performed in parallel in order to individually cloned all ASFV sub-genomic fragments described here.\nAdd 0.5 mL of PEG solution (see recipe). Mix by rotating the tube very gently. Incubate at room temperature for 20 min.\nCollect the cells at 2,500 × g for 5 min. Carefully remove the supernatant and resuspend the pellet in 700 μL SOS solution (see recipe). Incubate for 2 h at 30°C.\nMix the spheroplasts with 12 mL of melted TOP agar medium (see recipe), previously equilibrated at 55°C in a bead/water bath. Quickly pour the mixture onto Sorbitol-Ura plates (see recipe) and allow it to solidify for few seconds at room temperature.\nIncubate at 30°C for 2 days.\nNote: If no transformants are observed, see the troubleshooting[href=https://www.wicell.org#troubleshooting] section (problem 1[href=https://www.wicell.org#sec7.1]).\nPCR-based screening of yeast transformants\nTiming: 2 days",
    "This section describes the PCR-mediated identification of yeast transformants carrying the sub-genomic ASFV fragments of interest. Figure 2[href=https://www.wicell.org#fig2] summarizes the different steps involved in this section. The first step consists in the replication of individual yeast colonies on a new selection plate to ensure adequate propagation. The first screening relies on the amplification of a short internal region of the desired fragment, which is performed on pools of eight yeast colonies to allow a large but rapid initial pre-screening. The same PCR is then carried out on all individual colonies of previously tested positive pools to identify individual positive yeast clones. The second and third PCRs target the junctions between the TAR vector and the ASFV sub-genomic fragments.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/985-Fig2.jpg\nFigure 2. Flowchart describing the steps required for the PCR-based screening of yeast transformants\nYeast colonies obtained on Sorb-Ura plates are replicated individually onto a fresh SD-Ura plates. A first GC extraction is performed on eight patches pooled together into a single tube (“Pool” GC preparation). New GC extractions are then carried out on each of the eight patches from a positive pool (“Individual” GC preparations). These steps are repeated for every TAR-cloned sub-genomic fragment.\nPick isolated colonies from the original Sorbitol-Ura plates and patch each of them onto fresh SD-Ura plates. A total of 32 colonies are usually patched per plate using a 32-square grid PetriSticker™ (Sigma-Aldrich). Incubate at 30°C for 24 h.\nExtract yeast (extra)-chromosomal DNA using the glass bead Chelex 100 preparation (GC prep) method as described elsewhere (Blount et al., 2016[href=https://www.wicell.org#bib1]).",
    "Collect a ∼2-mm2 surface of a yeast patch with the tip of a 20-uL sterile pipette tip and placed into an 1.5mL-Eppendorf tube containing 100 μL of a 5% Chelex 100 solution (resuspended in deionized water) and add acid washed glass beads to half total sample volume.\nRepeat step a) for 7 additional patches (in order to make a pool of 8 colonies)\nVortex at 1,400 rpm for 4 min.\nIncubate for 2 min at 99°C and centrifuge at 18,000 × g for 1 min.\nTransfer 30–40 μL of the supernatant to a clean tube. Store at 4°C for 24–48 h or at −20°C for a longer period.\nUse 1 μL of the supernatant as DNA template in each of the subsequent screening PCRs\nPCR amplifications of i) the internal genomic DNA region and ii) the two junctions between the TAR vector and ASFV gDNA fragment are performed. Amplicons obtained from pooled clones and individual clones are displayed in Figure 3[href=https://www.wicell.org#fig3].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/985-Fig3.jpg\nFigure 3. PCR-based screening and identification of yeast clones carrying an ASFV sub-genomic fragment\n(A) Agarose gels showing the amplification products of the internal DNA regions located on ASFV sub-genomic fragment 3 (left) and sub-genomic fragment 4 (right). PCRs were carried on pools (P) of eight colonies. Pools indicated in red are considered positives.\n(B) Amplification products obtained when the 5′ and 3′ junctions between the TAR vector and each of the two sub-genomic fragments were assessed. Plus and minus signs indicate the positive (ASFV gDNA) and negative (water) controls for each of the PCRs, respectively. GeneRuler 100 bp Plus DNA ladder (Thermo Scientific) was used as marker (M).\nPCR reactions are performed using the GoTaq® G2 Green Master mix (Promega) according to manufacturer’s recommendations (see here[href=https://ch.promega.com/resources/protocols/product-information-sheets/g/gotaq-g2-green-master-mix-protocol/]). The set-up for each reaction is presented in the following table:",
    "table:files/protocols_protocol_985_12.csv\nPCRs are run following the cycling conditions described below:\ntable:files/protocols_protocol_985_13.csv\nOptional: Sanger sequencing of the different PCR products is recommended to confirm the identity of the ASFV sub-genomic fragment cloned and that the junctions do not contain any SNPs that would be detrimental for the subsequent steps.\nSelect one or two yeast clones containing the desired fragment for each of the five TAR cloning experiments for further use. Save these yeast clones at −80°C in Roti®Store yeast cryo vials following manufacturer’s conditions (see here[href=https://www.carlroth.com/ch/en/cryo-conservation/rotistore-yeast-cryo-vials/p/x983.1]).\nIf no positive yeast transformants are obtained, see troubleshooting[href=https://www.wicell.org#troubleshooting] section (problem 2[href=https://www.wicell.org#sec7.3]).\nMulticopy plasmid induction in E. coli\nTiming: 2 days\nThis section describes the extraction of the yeast artificial chromosomes (YACs) containing ASFV sub-genomic fragments from yeast followed by their subsequent transformation into E. coli. The multicopy induction system present on the pCC1BAC-Ura3 TAR vector is then used to purify larger amounts of plasmids/YACs required for the final reassembly in yeast.\nYAC extraction from yeast based on the QIAGEN mini kit\nResuspend ∼half of the remaining yeast patch from positive clones (from step 16) into 250 μL of P1 solution (included in the QIAGEN mini kit), 25 μL of Zymolyase solution (see recipe) and 2.5 μL of β-mercaptoethanol. Vortex for 10 s and incubate the mixture at 37°C for 30 min.\nVortex for another 10 s and incubate for 30 min at 37°C.\nAdd 250 μL of P2 solution and follow all the next steps according to manufacturer’s instructions (here[href=https://www.qiagen.com/us/products/discovery-and-translational-research/dna-rna-purification/dna-purification/plasmid-dna/qiagen-plasmid-kits/?catno=12125]) up to the elution step.\nFor the elution step, add 30 μL of elution buffer into the column and let sit for 5 min. Place the column into a fresh microcentrifuge tube and centrifuge for 1 min at 18,000 × g at room temperature.\nE. coli transformation using Transformax™ EPI300™ electrocompetent cells",
    "Chill 1-mm electroporation cuvettes and sterile Eppendorf tubes on ice for 15 min (one cuvette and one tube per transformation).\nAdd 3 μL of the previously extracted plasmid solution to 35 μL of freshly thawed Transformax™ EPI300™ electrocompetent E. coli cells in a pre-chilled tube.\nTransfer the mixture to the pre-chilled 1-mm electroporation cuvette and electroporate following manufacturer’s instructions. In our case, we used the Gene Pulser Electroporation system (Bio-Rad) with the following parameters: 2 kV; 25 μFD and 200 Ohms.\nAdd immediately 950 μL of SOC medium and incubate for 1 h at 37°C under agitation (200 rpm).\nTransfer the mixture to a fresh sterile microcentrifuge tube and centrifuge for 30 s at 18,000 × g, discard the supernatant.\nResuspend the pellet in 200 μL of fresh SOC medium and plate on selective medium (LB-Agar plates containing 12.5 μg/mL chloramphenicol). Transformants are usually observed after 24 h of incubation at 37°C.\nNote: An additional 24 hours incubation might ease the picking of the E. coli colonies in some cases.\nPCR verification of the E. coli clones.\nResuspend one E. coli colony per ASFV sub-genomic fragment in a fresh microcentrifuge tube containing 10 μL of deionized water.\nUse 1 μL of the mixture as DNA template for each of the two junction PCRs as previously described in step 18.\nUse the remaining 8 μL to start a 12-mL culture in LB-ChlR12.5 for each positive E. coli clone tested. Incubate for 12–14 h at 37°C under agitation (220 rpm).\nSave one or two E. coli clones at −80°C using 750 μL of the overnight cultures mixed with glycerol (15% final concentration).\nMulticopy induction and plasmid purification from E. coli clones",
    "Use the remaining 10 mL of the overnight culture (from step 22) to start a 100-mL LB-ChlR12.5 culture into a 250-mL Erlenmeyer baffled flask to ensure proper aeration.\nAdd 100 μL of CopyControl™ induction solution to the culture and incubate for 5 h at 37°C under agitation (220 rpm).\nCritical: Proper aeration of the culture is extremely important to ensure high yields of plasmid after purification.\nCentrifuge the culture for 20 min at 4,250 × g at room temperature. Pellets can be stored at −20°C.\nPlasmids were extracted using the QIAGEN midiprep plasmid purification kit following manufacturer’s instructions (here[href=https://www.qiagen.com/us/products/discovery-and-translational-research/dna-rna-purification/dna-purification/plasmid-dna/qiagen-plasmid-kits/?catno=12125]).\nQuantify DNA concentration using a biospectrophotometer.\nFull-length reassembly of ASFV clones\nTiming: 1 day (+2 days after yeast transformation)\nThis section describes the reconstruction of full-length ASFV genomes in yeast. It consists in the co-transformation of S. cerevisiae with a mixture of precipitated DNA containing all five overlapping ASFV sub-genomic fragments as well as the two chemically-synthetized fragments 1 and 2. This section also contains the final screening step of the reconstructed ASFV genomes confirming the presence of all the junctions between the seven different ASFV sub-genomic fragments.\nGel purification of the two synthetic fragments 1 and 2\nFive micrograms of the pUC57-Fragment1 plasmid were SmaI-digested in five 50-μL total reaction volume each containing 1 μg of DNA. Digestions were performed following manufacturer’s instructions (NEB[href=http://nebcloner.neb.com/]). The same protocol was applied to the digestion of the pUC57-Fragment2 plasmid.\nDigested products were loaded on a 1% TAE agarose gel containing RedSafe™ 1×. Electrophoresis was carried out for 1 h at 50 V (3.85 V/cm).\nThe DNA bands corresponding to the linearized synthetic constructs were excised from the gel using an X-tracta gel extractor tool (Sigma-Aldrich) after short exposure to blue light using an LED transilluminator (MaestroGen).",
    "Note: Blue light should be preferred over ultraviolet light to avoid DNA damage during the purification process\nThe excised gel band was placed in a 1.5-mL microcentrifuge tube and DNA was eluted in 30 μL final volume using the QIAQuick gel extraction kit following manufacturer’s instructions (QIAGEN[href=https://www.qiagen.com/us/shop/pcr/qiaquick-gel-extraction-kit/]).\nQuantify DNA concentrations using a biospectrophotometer. One hundred fmoles of each of the SmaI-digested Fragment1 and Fragment2 are used for step 26.\nLinearization of the YACs containing the different ASFV sub-genomic fragments\nDigest 50 fmoles of each of the ASFV sub-genomic fragments individually by I-SceI following manufacturer’s instructions (here[href=http://nebcloner.neb.com/]). If DNA concentration is too low, multiple 50-μL reactions can be performed in parallel.\nAfter 1 h restriction time, add 1 μL of I-SceI to the reaction and incubate for an extra hour.\nPrecipitation of DNA prior yeast transformation\nAll digested ASFV fragments (synthetic and TAR-cloned ones) are pooled together in a microcentrifuge tube.\nThe total volume (VDNA) of all digested ASFV fragments is calculated. Digested ASFV fragments is precipitated in a solution containing 1/10th VDNA of isopropanol; 1/10th VDNA of 3M NaAc; 1 μL of Glycoblue™ coprecipitant (ThermoFisher) and 1 μL of tRNA (Sigma-Aldrich).\nCentrifuge the mixture at 12,500 × g for 30 min at 4°C and discard the supernatant.\nResuspend the pellet in 700 μL of 70% ethanol solution.\nCentrifuge at 12,500 × g for 15 min at 4°C and discard the supernatant.\nResuspend the pellet in 30 μL of TE buffer (10 mM Tris-HCl pH8; 1 mM EDTA). Store at 4°C if used immediately or at −20°C for a longer period.\nYeast spheroplast co-transformation with all ASFV sub-genomic fragments and final pCC1BAC-His3 TAR vector\nYeast spheroplasts were prepared as previously described (step 14).",
    "Mix yeast spheroplast with 250 ng of PCR-amplified pCC1BAC-His3 and the 30 μL of all seven precipitated ASFV fragments.\nThe following steps were performed as previously described in step 15 with the exception that yeast cells were plated on Sorbitol-His plates instead of Sorbitol-Ura. Transformants can be observed after 24 h and colonies are big enough to be picked after 48 h.\nScreening of yeast transformants using multiplex PCR\nPatch yeast colonies onto a fresh SD-His plate.\nExtract yeast DNA using the GC-prep method as previously described (step 17)\nUse 1 μL as DNA template and set up two independent multiplex PCR reactions for individual colonies using the Qiagen® Multiplex PCR kit (Qiagen) following manufacturer’s instructions (here[href=https://www.qiagen.com/us/shop/pcr/qiagen-multiplex-pcr-kit/]). Expected profiles for ASFV full-length clones are presented in Figure 4[href=https://www.wicell.org#fig4]. All primers included in each multiplex PCR can be found in the primer table here. The set-up for each reaction is presented in the following table:\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/985-Fig4.jpg\nFigure 4. Identification of positive full-length clones using multiplex PCRs screening\nTwo independent multiplex PCRs were performed on full-length assembled ASFV constructs with two sets of primers in order to ensure the presence of all junctions between the different ASFV sub-genomic fragments. Amplification profiles expected for the multiplex Set1 (top) and multiplex Set2 (bottom) can be observed for positive clones (in red). Expected sizes of the PCR products are indicated on the left side of the gels. GeneRuler 100 bp Plus DNA ladder (Thermo Scientific) was used as marker (M).\ntable:files/protocols_protocol_985_14.csv\nCycling conditions for the two PCRs are described in the table below:\ntable:files/protocols_protocol_985_15.csv\nSelect one or two yeast positive transformants for further use. Biobank these yeast clones at −80°C in Roti®Store yeast cryo vials following manufacturer’s conditions (see here[href=https://www.carlroth.com/ch/en/cryo-conservation/rotistore-yeast-cryo-vials/p/x983.1]).\nIf no positive yeast transformants are obtained, see troubleshooting[href=https://www.wicell.org#troubleshooting] section (problem 5[href=https://www.wicell.org#sec7.9]).",
    "Large-scale preparation of full-length ASFV genomic DNA\nYAC extraction from yeast\nStart a 500-mL culture of S. cerevisiae containing full-length ASFV construct in SD-His at 30°C under agitation in a 2 L baffled Erlenmeyer flask.\nWhen OD600nm reaches ∼2, centrifuge the culture at 4,250 × g for 20 min at 4°C.\nResuspend the pellet in a solution containing 20 mL of P1 solution (included in the QIAGEN® Large-construct kit), 2 mL of Zymolyase solution (see recipe) and 200 μL of β-mercaptoethanol. Vortex for 30 s and incubate the mixture at 37°C for 1 h.\nVortex for another 30 s and incubate for another 1 h min at 37°C.\nDNA extraction is performed using the Qiagen® Large-construct kit following manufacturer’s instructions (here[href=https://www.qiagen.com/us/products/discovery-and-translational-research/dna-rna-purification/dna-purification/plasmid-dna/qiagen-large-construct-kit/])\nPlasmid extraction from E. coli\nRepeat steps 20 and 21 with an S. cerevisiae clone carrying a full-length ASFV construct.\nProceed to DNA extraction using the Qiagen® Large-construct kit starting with a 300-mL E. coli culture following manufacturer’s instructions (here[href=https://www.qiagen.com/us/products/discovery-and-translational-research/dna-rna-purification/dna-purification/plasmid-dna/qiagen-large-construct-kit/]).\nNote: Alternatively, agarose plugs containing intact ASFV chromosome-sized DNA can be prepared following manufacturer’s instructions (here[href=https://www.bio-rad.com/en-ch/product/chef-genomic-dna-plug-kits?ID=21f77550-a849-4d32-b90f-c9428fc7b425]). Such plugs can be prepared from either E. coli or yeast cultures using the CHEF Bacterial Genomic DNA plug kit (Bio-Rad, 1703592) or CHEF Yeast Genomic DNA plug kit (Bio-Rad, 1703593), respectively.\nGenetic engineering of ASFV clones\nTiming: 3 days\nThis section describes the necessary steps for the engineering of the ASFV genome using the previously isolated sub-genomic fragments. Here, we substituted one non-essential gene in Fragment 4 (namely the C962R gene; Figure 5[href=https://www.wicell.org#fig5], in dark gray) (Ramirez-Medina et al., 2020[href=https://www.wicell.org#bib16]) and replaced it by chemically-synthetized DNA cassettes carrying reporter genes as a proof of concept.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/985-Fig5.jpg\nFigure 5. Design for the replacement of the ASFV C962R gene with synthetic DNA cassettes carrying the eGFP or secNLuc reporter genes",
    "The ASFV sub-genomic fragment 4 excluding the C962R gene (Fragment 4ΔC962R) was first isolated using TAR cloning. Two DNA cassettes, namely the P_Pol-eGFP_C962R-int or P_Pol-secNLuc_C962R-int, were chemically synthesized and cloned in the pUC57 plasmid. They carry either the eGFP and secreted Luciferease reporter genes and contain overlaps with their neighboring fragments during genome reassembly, namely Fragment 4ΔC962R and Fragment 5. Asterisks indicate the presence of SmaI restriction sites used for linearization. All genetic features included in the synthetic DNA cassettes are detailed in step 31.\nDesign of the chemically-synthetized DNA cassettes carrying the reporter genes\nSmaI restrictions sites (indicated with asterisks in Figure 5[href=https://www.wicell.org#fig5]): Two SmaI restrictions sites were added at the 5′ and 3′ ends of the DNA cassettes to ensure linearization and purification from the pUC57 backbone plasmid.\n5′-overlap (Figure 5[href=https://www.wicell.org#fig5], in light gray): a region of 250 bp, overlapping the ASFV genome upstream of the C962R coding sequence included in the ASFV sub-genomic fragment 4, was added to ensure legitimate recombination in yeast.\nPromoter region (Figure 5[href=https://www.wicell.org#fig5], in yellow): the promoter region of the DNA polymerase (G1211R) of the ASFV Armenia isolate was used as previously reported (Portugal et al., 2017[href=https://www.wicell.org#bib15]).\nReporter sequences: the respective 720-bp and 600-bp nucleotide sequence of the enhanced GFP (eGFP) (Figure 5[href=https://www.wicell.org#fig5], in green) and secreted Luciferase (secNLuc) (Figure5[href=https://www.wicell.org#fig5], in pink) obtained from Promega were added in frame with the promoter region.\nTerminator sequence (Figure 5[href=https://www.wicell.org#fig5], in red): the 281-bp terminator sequence of the thymidine kinase (TK, L60) was added after the reporter sequences in both constructs (Portugal et al., 2017[href=https://www.wicell.org#bib15]).",
    "3′-overlap (Figure 5[href=https://www.wicell.org#fig5], in orange): a 387-bp region consisting of the last 65 bp of the 3′UTR of the C962R open reading frame (Cackett et al., 2020[href=https://www.wicell.org#bib4]). The rest of the sequence, overlapping with the ASFV sub-genomic fragment 5, was added to ensure legitimate recombination in yeast.\nIsolation of the ASFV sub-genomic fragment 4 deleted for the C962R gene\nGeneration of pCC1BAC-Ura3 with appropriate hooks. A PCR amplification of the pCC1BAC-Ura3 TAR vector was carried out with primers ASFTARhook4-R/F2 as reported in step 8.\nYeast clones carrying the ASFV sub-genomic fragment 4 deleted for C962R were obtained using TAR cloning as reported in steps 9 and 10.\nRepeat steps 11 to 18 in order to obtain purified YACs containing the ASFV sub-genomic fragment 4 deleted for C962R.\nFull-length reassembly of genetically engineered ASFV genomes carrying eGFP or secNLuc reporter genes\nRepeat steps 24 to 30 including one of the two chemically-synthetized DNA cassettes, namely pUC57-P_Pol-secNluc _C962R-int or pUC57-P_Pol-eGFP_C962R-int, previously gel purified along with all the required ASFV sub-genomic fragments."
  ],
  "subjectAreas": [
    "Genomics",
    "Systems Biology",
    "Health Sciences",
    "Biotechnology And Bioengineering",
    "Microbiology",
    "Molecular Biology",
    "Sequencing"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}