{
  "id": 9885,
  "origin_website": "Jove",
  "title": "Modification and Functionalization of the Guanidine Group by Tailor-made Precursors",
  "procedures": [
    "Note: All reagents and solvents were obtained from commercial suppliers and were used without further purification.\nCaution: Please consult all relevant material safety data sheets (MSDS) before use. Please use all appropriate safety equipment when performing chemical syntheses (e.g., fume hood, safety glasses, gloves, lab coat, full-length pants, and closed-toe shoes).\n1. Synthesis of the Guanidinylation Precursors\nAlkylated species\nMethylated species\nDissolve 1.0 g of N,N′-di-Boc-1H-pyrazole-1-carboxamidine (3.2 mmol, 1 eq.) and 1.0 g of triphenylphosphine (PPh3, 3.8 mmol, 1.2 eq.) in 10 mL of dry tetrahydrofuran (THF) in a 50-mL round-bottom flask in an inert atmosphere using a rubber septum at room temperature (RT). Add 194 µL of dry methanol using a syringe (4.8 mmol, 1.5 eq.) and let it stir at RT.\nSeparately, prepare a solution with 747 µL of diisopropyl azodicarboxylate (DIAD, 3.8 mmol, 1.2 eq.) in 2 mL of dry THF in a small glass vial. While stirring, add the solution of DIAD in THF dropwise to the solution of N,N′-di-Boc-1H-pyrazole-1-carboxamidine, PPh3, and methanol using a syringe (over 15 min). Let the solution stir for 2 h at RT.\nRemove the solvent under reduced pressure using a rotary evaporator and dissolve the crude product in 1 mL of dichloromethane (DCM). Load a flash column (2.5 cm x 20 cm) with 100 g of silica in 10% ethyl acetate (EtOAc) in a pentane solution. Load the dissolved crude product on the column and add the solvent under pressure (1.5 bar).",
    "Collect the fractions (solvent system: isocratic 10% EtOAc in pentane), identify the desired compound spot by thin layer chromatography (TLC), and collect it (Rf = 0.4, EtOAc/pentane 1:9, UV). Combine the desired fractions and evaporate the solvent under reduced pressure using a rotary evaporator to obtain 0.85 g of the title compound as a yellow, viscous oil (2.6 mmol, 81% yield). Store the yielded compound at RT for further use.\nHexylamine-modified species\nDissolve 1.0 g of N,N′-Di-boc-1H-pyrazole-1-carboxamidine (3.2 mmol, 1.0 eq.), 0.9 g of Dde-6-aminohexanol (3.8 mmol, 1.2 eq.), and 1.0 g of PPh3 (3.8 mmol, 1.2 eq.) in 10 mL of dry THF in a 50-mL round-bottom flask in inert atmosphere using a rubber septum at RT.\nSeparately, prepare a solution with 747 µL of DIAD (3.8 mmol, 1.2 eq.) in 2 mL of dry THF in a small glass vial. While stirring, add the solution of DIAD in THF dropwise to the solution of N,N′-di-Boc-1H-pyrazole-1-carboxamidine, PPh3, and Dde-6-aminohexanol using a syringe (over 15 min). Let the solution stir for 2 h at RT.\nRemove the solvent under reduced pressure using a rotary evaporator and take the crude product up in 1 mL of DCM. Load a flash column (2.5 cm x 20 cm) with 100 g of silica in a solution of pentane/EtOAc (2:1). Apply the dissolved crude product on the column and add solvent under pressure (1.5 bar).\nCollect the fractions (solvent system: isocratic 2:1 pentane/EtOAc), identify the desired fractions with TLC, and collect them (Rf = 0.66, 2:1 pentane/EtOAc, UV). Combine the desired fractions and evaporate the solvent under reduced pressure using a rotary evaporator to obtain 1.6 g of the title compound as a yellow, viscous oil (2.8 mmol, 88% yield). Store the yielded compound at RT for further use.\nAcylated species (2 reaction steps)",
    "Dissolve 1.4 g of S-methylisothiuronium hemisulfate (10 mmol, 1.0 eq.) and 2.2 g of di(tert-butyl) dicarbonate (10 mmol, 1.0 eq.) in a vigorously stirring biphasic solution of DCM/ sat. aq. NaHCO3 and let it stir for 24 h at RT.\nSeparate the layers in a separatory funnel and extract the aqueous phase three times with DCM. Combine the organic phases, dry them with Na2SO4, and remove the solvent under reduced pressure using a rotary evaporator. Take the crude product up in 1 mL of hexane.\nLoad a flash column (2.5 cm x 20 cm) with 100 g of silica in a solution of 4:1 hexane/EtOAc. Load the dissolved crude product on the column. Add solvent under pressure. Identify the desired fractions with TLC (solvent system: 4:1 isocratic hexane/EtOAc (detection UV: 254 nm), and collect them (Rf = 0.30).\nCombine the desired fractions and evaporate the solvent under reduced pressure using a rotary evaporator to obtain 1.1 g of the title compound as a yellow, viscous oil (5.8 mmol, 58% yield). Store the reagent, N-(tert-butoxycarbonyl)-S-methylisothiourea, at RT for further use.\nDissolve 250 mg of N-(tert-butoxycarbonyl)-S-methylisothiourea (1.3 mmol, 1.0 eq.) in 10 mL of dry N,N-dimethylformamide (DMF) in a 50-mL round-bottom flask in an inert atmosphere at RT. Add 440 µL of N, N-diisopropylethylamine (DIPEA) (2.6 mmol, 2 eq.) using a syringe. While stirring, add 245 µL of Ac2O (5.2 mmol, 4.0 eq.) dropwise using a syringe and let it stir for 1 h at RT.\nAdd an excess of methanol (2 mL) to the mixture using a syringe and let it stir for 15 min at RT. Remove the solvent under reduced pressure using a rotary evaporator. Take the crude product up in 1 mL of DCM.",
    "Load a flash column (2.5 cm x 20 cm) with 60 g of silica in a solution of 3:1 hexane/EtOAc 3:1. Apply the dissolved crude product to the column. Add solvent (3:1 hexane/EtOAc) and pressure (1.5 bar). Identify the desired fractions with TLC (3:1 hexane/EtOAc, UV: 220 nm), and collect them (Rf = 0.62).\nCombine the desired fractions and evaporate the solvent under reduced pressure using a rotary evaporator to obtain 210 mg of the title compound as a white solid (0.9 mmol, 70% yield). Store the compound at RT for further use.\n2. Synthesis of Cyclic Peptide Precursors\nLoading and capping TCP resin\nAdd 1.00 g of 2-chlortriyl chloride (CTC) resin (0.9 mmol/g) and 320 mg of Fmoc-Gly-OH (1.2 eq.) into a plastic 20-mL syringe with a frit. Prepare a solution of 313 µL of DIPEA (2 eq.) in 5 mL of dry DCM and add it to the syringe. Let it rotate for 1 h at RT using a rotary unit.\nMeanwhile, prepare a 2-mL solution of 5:1 methanol/DIPEA (v/v; capping solution). Add the capping solution to the syringe and let it rotate for another 15 min. Wash the resin with DCM (5x) and DMF (3x).\nOn-resin Fmoc deprotection\nTreat the resin-bound Fmoc-Gly with 20% piperidine in DMF for 10 min and then for 5 min. Wash the resin with DMF (3x).\nOn-resin coupling of Fmoc-Orn(Dde)-OH\nAdd 934 mg of Fmoc-l-Orn(Dde)-OH (2 eq.), 684 mg of 1-[bis(dimethylamino)methylene]-1H-1,2,3-triazolo[4,5-b]pyridinium 3-oxid hexafluorophosphate (HATU) (2 eq.), and 245 mg of 1-hydroxy-7-azabenzotriazole (HOAt) (2 eq.) to a small glass vial and dissolve it in 5 mL of DMF. Add 814 µL of DIPEA.\nAdd this solution to the Fmoc-deprotected, washed, and resin-bound Gly and let it rotate for 1 h. Wash the resin with DMF (3x).\nOn-resin Fmoc deprotection",
    "Treat the resin-bound Fmoc-Orn(Dde)-Gly with 20% piperidine in DMF for 10 min and then for 5 min. Wash the resin with DMF (3x).\nOn-resin coupling of Fmoc-Val-OH\nAdd 610 mg of Fmoc-Val-OH (2 eq.), 684 mg of HATU (2 eq.), and 245 mg of HOAt (2 eq.) to a small glass vial and dissolve it in 5 mL of DMF. Add 814 µL of DIPEA.\nAdd this solution to the Fmoc-deprotected, washed, and resin-bound Orn(Dde)-Gly and let it rotate for 1 h.\nOn-resin Fmoc deprotection\nTreat the resin-bound Fmoc-Val-Orn(Dde)-Gly with 20% piperidine in DMF for 10 min and then for 5 min. Wash the resin with DMF (3x).\nOn-resin N- Methylation\nWash the resin with DCM (3x). Dissolve 887 mg of 2-nitrobenzenesulfonylchloride (o-NBS-Cl, 4 eq.) in DCM and add 1.2 mL of 2,4,6-collidine (10 eq.).\nAdd the solution to the resin-bound peptide and let it incubate for 20 min at RT.\nWash the resin with CH2Cl2 (3x) and with THF (5x). Prepare a solution with 1.18 g of PPh3 (5 eq.) and 365 µL of methanol in THF. Add this solution to the syringe.\nPrepare a solution with 883 µL of DIAD in 2 mL of THF and add it to the syringe. Let it incubate for 15 min. Wash the resin with THF (5x) and with DMF (5x).\no -Ns deprotection\nPrepare a solution with 570 µL of mercaptoethanol (10.0 eq.) and 672 µL of diazabicycloundecen (DBU) in 2 mL of DMF. Add this solution to the syringe and let it incubate for 5 min.\nRepeat the deprotection step and then wash the resin with DMF (5x).\nOn-resin coupling of Fmoc- d-Phe-OH",
    "Add 697 mg of Fmoc-D-Phe-OH (2 eq.), 684 mg of HATU (2 eq.), and 245 mg of HOAt (2 eq.) to a small glass vial and dissolve it in 5 mL of DMF. Add 814 µL of DIPEA.\nAdd this solution to the Fmoc-deprotected, washed, and resin-bound peptide and let it rotate for 1 h.\nOn-resin Fmoc deprotection\nTreat the resin-bound peptide with 20% piperidine in DMF for 10 min and then for 5 min. Wash the resin with DMF (3x).\nOn-resin coupling of Fmoc-Asp(OtBu)-OH\nAdd 741 mg of Fmoc- Asp(OtBu)-OH (2 eq.), 684 mg of HATU (2 eq.), and 245 mg of HOAt (2 eq.) to a small glass vial and dissolve it in 5 mL of DMF. Add 814 µL of DIPEA.\nAdd this solution to the Fmoc-deprotected, washed, and resin-bound peptide and let it rotate for 1 h.\nCleavage of the linear peptide from the resin\nWash the resin with DCM (3x) and subsequently prepare 10 mL of a solution of hexafluoroisopropanol (HFIP) in DCM (1:4; v/v).\nAdd the solution to the resin and let it rotate for 15 min. Collect the solution in a round-bottom flask. Repeat the cleavage and evaporate the solvent using a rotary evaporator.\nCyclization of the linear peptide\nDissolve 384 mg of NaHCO3 (5.0 eq.) and 582 µL of diphenylphosphoryl azide (DPPA) (3.0 eq.) in 50 mL of DMF and add it to the crude product. Let it stir overnight or until no linear peptide is observed with ESI-MS (10 h)17.\nUnder reduced pressure, reduce the solvent to a small volume using a rotary evaporator. Prepare a saturated aqueous solution of NaCl (brine). Using a Pasteur pipette, add the cyclized peptide dropwise to 40 mL of saturated aqueous solution of NaCl in a centrifuge tube.",
    "Centrifuge the suspension (5,000 x g, 5 min) and wash the precipitate with HPLC-grade water (2x). Lyophilize the product.\n3. Guanidinylation and Deprotection in Solution\nGuanidinylation with the tailor-made precursors\nDissolve a small amount (e.g., 25 mg) of the orthogonally deprotected cyclic peptide in a small volume of DMF (e.g., 2 mL). Add 2 eq. of the guanidinylation precursor and 2 eq. of DIPEA to the solution and let it stir for 2 h at RT.\nMonitor the progress of the reaction with HPLC-MS. After the reaction is complete, remove the solvent, re-dissolve the guanidinylated cyclic peptide in acetonitrile, and perform semipreparative HPLC purification16.\nRemoval of acid labile side chain protecting groups\nPrepare 2 mL of a solution containing trifluoroacetic acid (TFA), water, and triisopropylsilane (TIPS) (95/2.5/2.5; v/v/v). Add this solution to the purified product in a small glass vial and let it stir at RT for at least 1 h. Observe the complete deprotection with ESI-MS17.\nEvaporate the solvent under reduced pressure to a small volume. Prepare ice-cold ether and add 10 mL in a 50-mL centrifuge tube. Precipitate the deprotected peptide in ice-cold ether using a Pasteur pipette by adding it dropwise. Centrifuge the suspension (5,000 x g, 5 min) to obtain a pellet.\nWash the precipitate with ice-cold ether and centrifuge it (5,000 x g, 5 min, 2x). Dissolve the product in 2 mL of HPLC-grade water and purify it with semipreparative HPLC16.\n4. Analytical Data and Parameters for Purification\nAnalytical HPLC-ESI-MS\nPerform analytical HPLC-ESI-MS with an LCQ mass spectrometer using a C18 column (12-nm pore size, 3-µm particle size, 125 mm × 2.1 mm) or a C8 column (20-nm pore size, 5-µm particle size, 250 mm × 2.1 mm), with H2O (0.1% v/v formic acid)/acetonitrile (0.1% v/v formic acid) as eluents.\nSemi-preparative HPLC",
    "Perform semi-preparative HPLC using a preparative HPLC instrument with an ODS-A column (20 x 250 mm, 5 µm), a flow rate of 8 mL/min, and linear gradients of H2O (0.1% v/v TFA) and acetonitrile (0.1% v/v TFA).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}