{
  "id": 17939,
  "origin_website": "Jove",
  "title": "Mechanical Micronization of Lipoaspirates for Regenerative Therapy",
  "procedures": [
    "This research was approved by the Ethical Review Board in Nanfang Hospital, Guangzhou, China. Adipose tissue was collected from healthy donors who gave written informed consent to take part in the study. All animal experiments were approved by the Nanfang Hospital Institutional Animal Care and Use Committee and performed according to the guidelines of the National Health and Medical Research Council (China).\n1. ECM/SVF-gel Preparation\nHarvest fat.\n\t\nPerform liposuction on a human with a 3-mm multiport cannula, which contains several sharp side holes of 1 mm in diameter, at -0.75 atm of suction pressure.\nCollect 200 mL of lipoaspirates in a sterile bag.\nPrepare Coleman fat.\n\t\nTransfer the lipoaspirates into four 50 mL tubes and allow the harvested fat to stand still for 10 min.\nCollect the fat on the top layer into two 50 mL tubes by using a wide-tip pipette to transfer, and discard the liquid portion at the bottom layer.\nUsing 50 mL tubes, centrifugate the fat layer at 1,200 x g at room temperature (RT) for 3 min.\nDefine the upper layer (approximately 80 mL) as Coleman fat.\nTransfer the upper 2/3 of the Coleman fat to a 20 mL tube by using a wide-tip pipette, and define this portion as low-density fat.\nTransfer the lower 1/3 of the Coleman fat to another 20 mL tube by using a wide-tip pipette, and define this portion as high-density fat.\nProduce ECM/SVF-gel from low-density fat.\n\t\nUsing two 20 mL syringes connected by a female-to-female Luer-Lock connector (with an internal diameter of 2.4 mm) to intershift 20 mL of low-density fat.\nKeep the shifting speed stable (at 20 mL/s) and repeat for 6x to 8x.\nCentrifugate the mixture at 2,000 x g at RT for 3 min.",
    "Collect the oil portion on the top in a 10 mL tube by using a wide-tip pipette at RT for further use.\nCollect the sticky substance in the middle layer, which is ECM/SVF-gel (Figure 1A), by using a wide-tip pipette, and discard the fluid at the bottom layer.\nProduce ECM/SVF-gel from high-density fat.\n\t\nAdd 5 mL of oil (collected from step 1.3.4) to 15 mL of high-density fat.\nIntershift the mixed fat between syringes 6x to 8x until a flocculate is observed within the emulsion.\nCentrifugate the mixture at 2,000 x g at RT for 3 min.\nDiscard the oil portion on the top.\nCollect the sticky substance in the middle layer (ECM/SVF-gel) by using a wide-tip pipette and discard the fluid at the bottom layer.\nMix the ECM/SVF-gel from steps 1.3.5 and 1.4.5.\n2. Nude Mouse ECM/SVF-gel Graft Model\nAnesthetize the nude mice (8 weeks old, female) with isoflurane (1% - 3%) inhalation anesthesia in an animal operation room.\nTransfer the ECM/SVF-gel to a 1 mL syringe.\nConnect the 1 mL syringe with a blunt infiltration cannula.\nInsert the cannula subcutaneously into each flank of the mouse.\nInject 0.3 mL of the ECM/SVF-gel.\n3. Tissue Harvesting on 3, 15, and 90 Days after ECM/SVF-gel Injection\nAnesthetize the mice with isoflurane (1% - 3%) inhalation anesthesia.\nSacrifice the mice by the cervical dislocation method.\nMake an incision at the midline of the mouse's dorsal skin with surgical scissors.\nDissect and harvest the fat grafts on both sides of the mouse. Embed the fat grafts in the 4% paraformaldehyde at RT overnight.",
    "Dehydrate the tissue in increasing concentrations of ethanol: 70% ethanol, two changes, 1 h each; 80% ethanol, one change, 1 h; 95% ethanol, one change, 1 h; 100% ethanol, three changes, 1.5 h each; xylene, three changes, 1.5 h each.\nInfiltrate the tissue with paraffin wax (58 - 60 °C), two changes, 2 h each.\nEmbed the tissue into paraffin blocks. Cut sections at a thickness of about 4 µm and put them on slides.\n4. Hematoxylin and Eosin Staining\nDeparaffinize the paraffin block slides by soaking them in xylene I, II, and III (10 min each).\nRehydrate the tissue sections by passing them through decreasing concentrations (100%, 100%, 95%, 80%, 70%) of ethanol baths for 3 min each.\nRinse the tissue sections in distilled water (5 min).\nStain the tissue sections in hematoxylin for 5 min.\nRinse the tissue sections in running tap water for 20 min. Decolorize in 1% acid alcohol (1% HCl in 70% alcohol) for 5 s. Rinse in running tap water until the sections are blue again.\nAdd two to three drops of Eosin Y dye directly onto the slides by pipette, and let the dye set for 10 min.\nWash the slides in tap water for 1 - 5 min.\nDehydrate the slides in increasing concentrations (70%, 80%, 95%, 100%, 100%) of ethanol for 3 min each.\nClear the slides in xylene I and II for 5 min each.\nMount the slides in mounting media.\n5. Immunofluorescent Staining\nDeparaffinize the tissue sections in xylene I, II, and III (5 min each).\nRehydrate the tissue sections by passing them through different concentrations (100%, 100%, 95%, 95%, 70%) of alcohol baths for 3 min each.\nIncubate the sections in a 3% H2O2 solution in methanol at RT for 10 min.",
    "Rinse the slides 2x with distilled water, 5 min each.\nDrop the slides in a slide basket. Add 300 mL of 10 mM citrate buffer (pH 6.0) and incubate the slides at 95 - 100 °C for 10 min.\nCool the slides in RT for 20 min.\nRinse the slides 2x with phosphate-buffered saline (PBS), 5 min each.\nAdd 100 µL of 10% fetal bovine serum onto the slides and incubate in a humidified chamber at RT for 1 h.\nIncubate the sections with primary antibody solution (guinea pig anti-mouse Perilipin, 1:400) at 4 °C overnight.\nRinse the slides with PBS 3x, 5 min each.\nIncubate the sections with secondary antibody solution (goat anti-guinea pig-488 IgG) for 2 h at RT.\nRinse the slides with PBS 3x, 5 min each.\nWipe off the water around the section with clean tissue paper.\nDrop 4′,6-diamidino-2-phenylindole (DAPI) and Alexa Fluor 488-conjugated isolectin into the circle to cover the section on the slide.\nMount the coverslips and let them dry in the dark.\nObserve the slides with a fluorescent microscope.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}