{
  "id": 9351,
  "origin_website": "Jove",
  "title": "Examination of Synaptic Vesicle Recycling Using FM Dyes During Evoked, Spontaneous, and Miniature Synaptic Activities",
  "procedures": [
    "1. Primary Culture of Neurons from the Mammalian Brain\nAll animal procedures performed in this study are approved by the Institutional Animal Care and Use Committee of the University of Iowa.\nPrepare the dissociated cell culture of the CA3-CA1 regions of hippocampus from mice or rats on postnatal days 0-119,20. Plate the hippocampal cells on 12-mm coverslips (thickness number 0) preseeded with the rat glial feeder layer, in 24-well dishes, and at a density of 12,000 cells/well.\nCulture the hippocampal neurons for at least 8 days for functional nerve terminals to develop21. We use neurons on 11-14 days in vitro when individual nerve terminals are relatively isolated without much clustering. Neurons can be used for experiments up to about 21-28 days in vitro e.g. Willig et al.22 and Nosyreva and Kavalali23.\nFor functional studies, assess coverslips (before staining) for indicators of healthy neurons using transmitted light microscopy (e.g. phase contrast optics at a magnification of 10-20X). The indicators of good health include: a uniform glial cell layer, a clear cellular margin around the neurons, extended dendrites without beaded structures, a lack of clustered somata, and a lack of bundled neurites.\n2. Loading the Synaptic Vesicles with the FM Dye (Staining)\nStaining due to synaptic activity evoked by electrical field stimulation (involves action potentials)\n\t\nPrepare staining solution 1 by adding the FM dye to a HEPES-based dye-free solution, e.g. Tyrode's solution (see SOLUTIONS for details). The concentration of FM dye is 10 μM FM1-43 and 2.5 μM FM4-64. Typical concentration ranges are: 2-15 μM FM1-43, or 2.5-20 μM FM4-643,6. For experiments requiring suppression of recurrent glutamatergic synaptic activity and the induction of synaptic plasticity, further add antagonists of ionotropic glutamate receptors: AMPA receptors (e.g. 10 μM CNQX) and NMDA receptors (e.g. 50 μM AP5).",
    "Transfer a coverslip with cells from the culture medium to the imaging chamber prefilled with plain Tyrode's solution. We use an imaging chamber with the stimulation electrodes attached to the side walls (platinum wires separated by 6.3 mm, RC-21BRFS). This chamber is designed as a closed imaging chamber, but we use it as an open chamber (i.e. without a top coverslip), with a bath volume of ~200 μl. During transfer, do not expose the cultured cells to air, and avoid pinching the cultured cells with the tweezers (pick the coverslip up from the perimeter rather than near the center).\nPerfuse the imaging chamber with plain Tyrode's solution at room temperature (23-25 °C).\nApply staining solution 1 by constant perfusion.",
    "Evoke synaptic activity by applying electrical pulses. For maximal staining of the total recycling pool of synaptic vesicles in hippocampal neurons, stimulate the cultures at 10 Hz for 60-120 sec 24. When trying to attain maximal efficiency of field stimulation, keep several features in mind. 1) The height of the bath solution should be as low as possible, while keeping the neurons and stimulating electrodes entirely immersed in a thin layer of Tyrode's solution (in order to keep the neurons alive and to obtain a homogeneous electrical field). 2) Current intensity and duration should be optimized using an indicator of neuronal excitability, e.g. fluorescent Ca2+ imaging; in our case, a constant current of 30 mA intensity and 1 msec duration gives reliable results. 3) The bath solution should be applied at constant flow during stimulation; the electrical stimulation leads to electrolysis, causing protons (H+) to accumulate at the positively charged anode and the pH near the anode to decrease rapidly in a static bath. Check the acidification in a separate experiment by passing more than a few hundred pulses through a solution that contains a pH-indicator (e.g. Hanks’ balanced salt solution with phenol red).\nLeave the neurons in staining solution 1 for an additional 60 sec after field stimulation is terminated, so that post-stimulus endocytosis will be completed25.",
    "Wash the staining solution out of the imaging chamber by perfusing it with rinsing solution 1, a dye-free Tyrode's solution plus antagonists of AMPA receptors and NMDA receptors (see section 2.1.1), and a blocker of voltage-dependent Na+ channels (e.g. 0.5-1 μM tetrodotoxin, TTX). The combination of blockers will suppress the loss of FM dye through spontaneous synaptic activity. To maximize the washing efficiency, increase the perfusion rate (e.g. up to 5-6 ml/min) for 1-2 min, and add a bolus (e.g. 1 ml) of rinsing solution 1 directly to the open imaging chamber manually, using a pipette. Control the strength and direction of manual infusion, so as not to disturb the cultured neurons.\nStaining due to synaptic activity evoked by high-K+ solution (does not involve action potentials).\n\t\nPrepare staining solution 2 by adding the FM dye to high-K+ Tyrode's solution. Specifically, prepare a modified Tyrode's solution with 45 mM KCl, by equimolar substitution of KCl for NaCl. If required, add antagonists of AMPA and NMDA receptors. This high-K+ solution will depolarize neurons continuously, enable Ca2+ influx into nerve terminals, and initiate synaptic vesicle exocytosis to the maximal extent26. Higher concentrations (70-90 mM) were also used in other reports e.g. Klingauf et al.27 and Richards et al.28\nTransfer a coverslip with cultured neurons from the culture medium to the imaging chamber prefilled with plain Tyrode's solution.\nStain the neurons at room temperature for 1-2 min by applying staining solution 2 at constant perfusion or using a pipette26,28. In the latter case, the final dye concentration should be controlled by adding a known volume of staining solution 2 to a known volume of dye-free solution.\nWash the staining solution out of the imaging chamber, as described in section 2.1.7.\nStaining due to spontaneous and miniature synaptic activity.­",
    "Prewarm bicarbonate-based solution (e.g. Minimum Essential Medium, MEM) to 37 °C by placing in the culture incubator for more than 60 min.\nFor staining based on spontaneous synaptic activity, prepare staining solution 3 by adding the FM dye to MEM. For staining based on miniature synaptic activity, prepare staining solution 4 by adding TTX to the staining solution 3.\nStain neurons by transferring a coverslip with cultured neurons from culture medium to staining solution 3 or 4, and leaving them in the same staining solution at 37 °C for 10 min.\nRinse the coverslip briefly in rinsing solution 1.\nTransfer the coverslip to rinsing solution 1 in an imaging chamber. Keep in mind the following. 1) Cells should not be exposed to air; if necessary, transfer the coverslip directly to the imaging chamber without rinsing. 2) Neurons can be stained at room temperature by replacing staining solution 3 or 4 with a HEPES-based solution. 3) Neurons can be stained for evoked synaptic activity in the context of high-K+ solution using this method, by replacing staining solution 3 or 4 with staining solution 2 and carrying out the remaining steps at room temperature.\nWash the staining solution out of the imaging chamber as described in section 2.1.7.\n3. Washing out the FM Dye",
    "After neuronal staining and initial washing by any of the above-described methods (section 2.1.7), continue to perfuse the imaging chamber with rinsing solution 1 for 5-10 min at room temperature. This will remove the FM dye from the plasma membrane and the extracellular solution. In the case of our imaging chamber, the bath perfusion rate is 600-1,200 μl/min. Washing can also be carried out in the absence of extracellular Ca2+ to suppress FM dye loss due to synaptic activities17. The washes can be enhanced by a brief application of Advasep-7, a modified cyclodextrin that serves as a scavenger of FM dyes from the plasma membrane29-31. It is crucial to keep any Advasep-7 exposure short (e.g. 5 sec in the case of monolayer culture) to avoid both reducing the intensity of FM puncta31 and compromising the health of the cells. The fluorescence from FM1-43 in the plasma membrane can also be suppressed by an application of a quencher sulforhodamine 101 (50-100 μM) that does not enter synaptic vesicles32.\n4. Searching for an Optimal Image Field During Washing\nVerify that the cells in the field to be imaged are healthy, using transmitted light microscopy with a high-magnification and high-numerical-aperture objective lens (e.g. 40X) . From this section, we continue to use an inverted microscope (Eclipse Ti, Nikon) equipped with phase contrast or differential interference contrast optics. This microscope is also equipped with Perfect Focus System (PFS) that enables continuous, real-time focus correction, which overcomes the microscope focus drift. This feature is essential for time-lapse imaging during destaining with the same focusing plane.",
    "Verify that staining was effective, by using fluorescence optics. Avoid aggregates of FM puncta unless they are the target of research, because individual boutons will be difficult to discern. Pay attention to the shapes of the FM puncta: if most of the stained boutons appear as strings of circular beads, they could represent unhealthy nerve terminals. Minimize the exposure of the neurons to strong fluorescence excitation in order to avoid photobleaching.\n5. Unloading FM Dye from the Synaptic Vesicles (Destaining)\nDestaining due to synaptic activity evoked by electrical field stimulation.\n\t\nWash TTX out by perfusing the neurons extensively with a rinsing solution 2 (same as rinsing solution 1 but without TTX). Confirm the effectiveness of TTX washout in separate experiments, using the same washing parameters (perfusion rate and duration), e.g. by fluorescent Ca2+ imaging of cytoplasmic Ca2+ transients induced by field stimulation, or by patch-clamp recording of voltage-dependent Na+ currents.\nStart imaging the FM dyes. For imaging FM1-43 or FM4-64, use 520 nm or 650 nm long pass emission filters, respectively and a 490 nm excitation filter. Acquire images every 1-2 sec, using a short exposure time (e.g. 10-20 msec), weak excitation intensity (e.g. 5-10% of LED power), and high sensitivity (e.g. with EM gain). Minimize photobleaching of the FM dyes by reducing exposure time and the intensity of fluorescence excitation. Minimize the microscope focus drift by turning on the Perfect Focus System.\nStimulate the neurons in rinsing solution 2, using field-stimulation (e.g. at 10 Hz for 120 sec)20.\nApply multiple rounds of stimulation, with intervening rest periods of 1-2 min, to deplete all the recycling synaptic vesicles of FM dye. This is important when assessing the size of total recycling pool of synaptic vesicles that were stained with FM dyes in the prior state20,33.",
    "Destaining due to synaptic activities evoked in the absence of action potentials.\n\t\nStart imaging the FM dye.\nApply the stimulating reagents dissolved in rinsing solution 1 or 2. Such reagents include: KCl (high-K+ solution, e.g. 45 mM)26, ionomycin (a Ca2+ ionophore that raises the intracellular Ca2+ concentration by allowing Ca2+ influx into the cell from the extracellular solution, used e.g. at 5 μM)20,34, and sucrose (a hypertonic solution that stimulates the release of synaptic vesicles from readily releasable pool, used e.g. at 500 mM)35,36. Use a fast, local perfusion system for a reliable temporal control in applying the reagents, e.g. the SF-77B system from of Warner Instruments37, or Y-tube system38-40.\nDestaining due to spontaneous and miniature synaptic activity.\n\t\nFor destaining due to spontaneous synaptic activity, wash out TTX as above (section 5.1.1), using rinsing solution 2. Start imaging the FM dyes while perfusing neurons with rinsing solution 2. For destaining due to miniature synaptic activities, start imaging the FM dyes, while continuing to perfuse the neurons with rinsing solution 1 (with TTX).\nAfter destaining based on either spontaneous or miniature activity, identify the functional nerve terminals by destaining via evoked synaptic activity. Activity can be evoked by any of the procedures described above. This identification process is necessary because the stained structures can be those other than the functional nerve terminals (e.g. slowly recycling endosomes or astrocytic vesicles) and a large amount of destaining by the evoked activity aids in this process.\n6. Assessing the Photobleaching Rate of FM Dyes\nStain the nerve terminals with aldehyde-fixable FM dye (e.g. FM1-43FX, FM4-64FX). This can done using the evoked, spontaneous, or miniature staining method described above, and by replacing FM dye with a fixable FM dye.\nWash out the fixable FM dye as described in section 2.1.7.",
    "Chemically fix the neurons by transferring the coverslip to fixative solution: 4% paraformaldehyde and 4% sucrose in Tyrode's solution for 30 min at 4 °C. The fluorescence intensity of the fixable FM dye will be retained after chemical fixation.\nWash out the fixative for 10 min in Tyrode's solution, by transferring the coverslip to fresh Tyrode's solution twice.\nTransfer the coverslip into fresh Tyrode's solution in the imaging chamber.\nStart imaging the fixable FM dye using the same set of imaging parameters as for live neurons. It is important to rinse the imaging chamber very well after using any chemically fixed specimen, because any remaining fixative can affect subsequent live-cell imaging experiments carried out in the same chamber. Alternatively to the fixed cell imaging, the stained live cells might be imaged for assessing the photobleaching rate. However, it is worth keeping in mind that it is difficult to block the miniature synaptic activity acutely; for example, the frequency of miniature activity can be reduced to ~50% by removing the extracellular Ca2+ 23, but it is not a complete blockade.",
    "At the end of each imaging session, acquire a background image for assessing the absolute value of the FM fluorescence intensity. The intensity of FM puncta represents not only the true signal from the FM dyes in nerve terminals, but also the background noise from 1) glial cells that underlie the neuronal monolayer culture, 2) the coverslip and optical components (e.g. objective lens, filters and mirrors), and 3) the detector (EMCCD camera). Background noise is assessed in nonstained regions of the imaged field. When such regions are limited in space or heterogeneous in intensity, substitute it with an image with the camera shutter closed and acquire noise from the detector, although it is not an ideal method. Acquire approximately 10 images using the same imaging parameters.\n7. Image Analysis\nImport the acquired data into the image-analysis software as a stack of time-series images. We use ImageJ (W. S. Rasband, NIH) and the associated plug-ins, e.g. Image Stabilizer plug-in (Kang Li) for correcting a small degree of movement among FM puncta, and Time Series Analyzer V2.0 (Balaji Jayaprakash) for analyzing the time series.\nCalculate the changes in FM intensity at the start and end of the series (ΔFM). To this end, average the images before the start of destaining and after the end of destaining (e.g. 5 image frames each), and generate a difference image by subtracting them.\nIdentify the potentially functional nerve terminals by applying an intensity threshold to the difference image, and detect pixels whose intensities are higher than the threshold. One method of setting the threshold is to choose the standard deviation of the background intensity obtained from the bare coverslip area.",
    "Identify the isolated, functional nerve terminals as the contiguous pixels that were detected and that satisfy a size criterion (minimal and maximal numbers of pixels in contiguity). This process eliminates background noise and aggregated nerve terminals from analysis.\nAssign regions-of-interest (ROIs) on the detected pixel clusters (with individual clusters corresponding to individual nerve terminals). The total change in intensity during destaining (ΔFM) is a typical parameter of analysis. This represents the cumulative amount of evoked, spontaneous or miniature synaptic activity. Exclude ROIs if they exhibit any of the following changes in intensity depending on purposes of experiments: an increase during recording, a sudden decrease before stimulation, or a long latency after stimulation.\nAssess the rate of photobleaching by importing the acquired time-series data into the image-analysis software. Average the background images (e.g. with a closed shutter), and subtract it from the individual images. Assign ROIs to FM puncta that putatively correspond to nerve terminals, and measure changes in ROI intensity over time.\nSolutions\nTyrode's solution\n\t\nComposition (in mM): 125 NaCl, 2 KCl, 2 CaCl2, 2 MgCl2, 30 glucose, 25 HEPES, 310 mOsm, pH 7.4.\nStaining solution 1\n\t\nTyrode's solution plus the FM dye.\nThis solution is used for the staining, based on evoked synaptic activity by electrical stimulation.\nAdd the antagonists of AMPA receptors and NMDA receptors if necessary.\nStaining solution 2\n\t\nHigh-K+ Tyrode's solution plus the FM dye.\nThis modified Tyrode's solution is prepared by increasing the KCl concentration to 45 mM, by equimolar substitution of KCl for NaCl.\nThis solution is used for the staining, based on evoked synaptic activity by continuous depolarization.\nAdd the antagonists of AMPA receptors and NMDA receptors if necessary.\nStaining solution 3\n\t\nMEM solution plus the FM dye.\nThis solution is used for the staining, based on spontaneous synaptic activity.\nStaining solution 4",
    "MEM solution plus the FM dye and TTX.\nThis solution is used for the staining, based on miniature synaptic activity.\nRinsing solution 1\n\t\nTyrode's solution plus the antagonists of AMPA receptors and NMDA receptors, and TTX.\nRinsing solution 2\n\t\nTyrode's solution plus the antagonists of AMPA receptors and NMDA receptors, but without TTX.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}