{
  "id": 13488,
  "origin_website": "Jove",
  "title": "The Double-H Maze: A Robust Behavioral Test for Learning and Memory in Rodents",
  "procedures": [
    "1. General Considerations\nThis protocol is approved by the Animal Care and Use Committee of University Hospital Freiburg (same for Strasbourg). Visual acuity is necessary for performance in tests of spatial learning. Rodents with impaired visual systems are thus not suitable. Also, lighting must be sufficient in order for the rats to see the different cues located on the surrounding walls. It is useful to utilize basic-shaped (square, circle, triangle) but well-contrasted cues (e.g., black-painted cues on a white-painted background). Likewise, severe motoric deficits are exclusion criteria because swimming is required for this test and drowning may occur. Finally, hyper-anxious rodents can display a strongly biased search behavior, which impacts on performance.\n2. Apparatus Set Up\nConstruct a double-H maze consisting of a 160 cm central alleyway, which is intersected at both ends and in the center by three 160 cm parallel run arms (see Figure 1). Ensure that the central alleyway and its perpendicular arms are 20 cm wide, and are surrounded by 35 cm high transparent Plexiglas walls. Thickness of the Plexiglas is 6 mm for all parts.\nSecure the walls in place using glue and screws, and waterproof the maze using silicone joints at all internal angles. These joints can be replaced easily should they lose their waterproofness. Place a drain outlet at the extremity of one of the corner arms (or in the middle of the maze) for emptying.\nPlace the maze on an 80 cm high table, with adequate space around it for a) walking around the maze, and b) placement of well-contrasted cues. Designate each arm in the maze by its position, i.e., northwest (NW), north (N), northeast (NE), southwest (SW), south (S), and southeast (SE).",
    "Place a ceiling-mounted camera above the maze for post-test analysis of animal behavior, using either manual or automatic (video-tracking) methods (see §5).\n3. General Comments\nPrior to use, fill the maze with water to an approximate height of 18 cm (200 L). This is high enough to prevent rats from touching the bottom of the maze with their feet, but shallow enough to prevent escape.\nAfter pre-training, render the water opaque by mixing 250 g skim milk powder. Change the water on a daily basis to prevent the milk-water from becoming rancid. Maintain the water temperature between 21 - 23 °C to provide incentive for the rats to seek the escape platform.\n\tNOTE: As rats become familiar with the position of the platform during pre-training, its position is moved to a different arm during training.\nPrior to use, immerse a 17 cm high, 10 cm diameter platform at the extremity of one of the corner arms (NE, NW, SE or SW). Ensure the height to be submerged is 1 cm below the surface of the water surface. Train the rats to reach the target platform using either an allocentric or egocentric learning strategy, which is dependent on the type of paradigm used (see §4).\n4. Basic Training Protocols\nNOTE: Rats are typically provided with an initial day of pre-training, which allows them to become familiar with the maze.\nFor pre-training release the rat from the extremity of one of the center arms (e.g., S arm) and place the goal platform at the extremity of one of the corner arms (e.g., NE), then give the rats 4 consecutive 60 sec trials in which to reach the target platform.",
    "Upon reaching the escape platform, allow the rat to wait there for 15 sec, so that they can rest and observe their surroundings. Regardless of the start position, always block the opposite arm with a transparent guillotine door, which prevents entry.\n\tNOTE: During pre-training, leave the water transparent, and adjust the platform height such that it protrudes 1 cm above the water’s surface, thus making it visible to the rat.\nPerform daily training session consisting of up to 4 consecutive trials, separated by a 10 sec gap at least (discrete training, i.e., with intervals of several minutes between trials, is an alternative).\nFor training, relocate the platform from its pre-training position to the chosen arm (e.g., NW), and submerge it at its extremity 1 cm below the water surface. Now render the water opaque by addition of milk power and perform the following training (section 4).\nFor rats that do not reach the target platform within 60 sec, return them to the starting position, and gently guide them to the platform by the experimenter.\nMeasure several variables during the training and probe sessions, such as, distance swam, latency to goal arm / platform, time spent in each arm, as well as the number of initial/repetitive errors (see Figure 2). Keep in mind that latencies may be influenced by motor difficulties. Should the case arise, distance and errors appear as more reliable variables regarding cognitive performance.\nAllocentric Strategy Training:\n\t\nDay 1 - Pre-Training:\n\t\t\nDo not add milk powder for this step. Place escape platform protruding 1 cm above the water’s surface in a fixed location. Train rats in 4 consecutive trials to reach the platform.\nDays 2 - 5 – Training:",
    "Add 250 g of skim milk powder to the water to render it opaque. Move the platform to a different arm (e.g., from NE to NW) and add water so that the platform is 1 cm below the water surface. Release rats from either the N or S arm in unpredictable sequences for each session, such that both arms are used twice as trial start in a single session (4 trials/day, e.g., SNNS, NSNS; see Figure 3).\nDay 6 – Probe Session:\n\t\t\nRemove platform for the probe trial. Release rats from a different arm to those used during training (e.g., SW), and allow them to swim for 60 sec. See Figure 4 for representative swim tracks. Analysis of the time spent in the target arm (former location of the platform) gives an indication about whether rats use a spatial strategy, another type of strategy, a sequential combination of different strategies (see below), or a disorganized search pattern.\nEgocentric Strategy Training:\n\t\nDay 1 – Pre-Training:\n\t\t\nThis is the same as first step in the allocentric strategy training (step 4.1). Do not add milk powder for this step. Place escape platform protruding 1 cm above the water’s surface in a fixed location. Train rats in 4 consecutive trials to reach the platform.\nDays 2 - 5 – Training:\n\t\t\nAdd 250 g of skim milk powder to the water to render it opaque. Move the platform to a different arm and add water so that the platform is 1 cm below the water surface. Release rats from the same start arm (S or N; see Figure 5) for every trial (4 trials/day).\nDay 6 – Probe Session:",
    "Remove platform for the probe trial. Rats are released from an arm different from where they were released during the training. Allow the rats to swim for 60 sec. Block the opposite arm with a transparent guillotine door.\n\t\t\tNOTE: Modify the above training strategies for according to the requirements of the particular experiment, e.g., Testing Drug Effects etc.\n\tDry the rat off with absorbent towels after each session in the water.\n\t\n5. Analysis\nPerform measurements of latencies, initial and repetitive errors, first choices and response type manually by recording these variables from the videos taken from the overhead camera.\nAlternatively if available, utilize commercially available video-tracking software and configured to record these variables automatically.\nStatistical Analysis:\n\tNOTE: The specific implementation of statistical analysis depends on the study, which is taking place.\n\t\nPerform a one, two or three-way ANOVAs regarding the initial/repetitive errors, latency to goal arm/platform, and time spent in the target arm; with factors that include the test day, and treatment group(s).\nWhere necessary, follow these ANOVAs using post-hoc Newman-Keuls multiple comparisons tests. To compare performance, use a reference value (e.g., the time spent in the target arm during a probe trial vs. the chance level), and perform t-test.\nIf required, use non parametric statistics in addition (e.g., χ², see below) or instead when conditions for parametric ones are not fulfilled.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}