{
  "id": 5193,
  "origin_website": "Bio",
  "title": "Mungbean Yellow Mosaic India Virus (MYMIV)-infection, Small RNA Library Construction and Deep Sequencing for MicroRNA Identification in <em>Vigna mungo</em>",
  "procedures": [
    "Plant material and growth conditionsUse young V. mungo plants for this experiment. Surface sterilize mature seeds (0.1% HgCl2 for 10 min) and rinse twice in double-distilled water and keep in moistened filter papers for germination at 28 ± 2 °C, 16/8 h light/dark photoperiod and 70% relative humidity for 1 day. Perform three replicates of this experiment.Sown pre-germinated seeds in plastic pots and grow under controlled greenhouse conditions (temperature 26 ± 2 °C, relative humidity 70% and photoperiod 16 h day and 8 h night) in Soilrite soil mix (mixture of exfoliated vermiculite, Irish peat moss and perlite in the ratio 1/3:1/3:1/3). MYMIV-stress was given to plants with similar growth when their first trifoliate leaf expanded completely (approx. 21 days after sprouting).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20161010/20161010003046_7139.jpgFigure1. Yellow mosaic symptoms on Vigna leaves MYMIV-stress treatmentsRear white fly (Bemisia tabaci) populations on susceptible black gram plants grown in insect proof cages maintained in the insectory facility at the experimental farm, Madhyamgram, Bose Institute. Capture about 25-30 adult white flies in transparent glass trappers and allowed for a 24 h acquisition access period (AAP) on symptomatic leaves of naturally infected black gram plants (Figure 1). Give a 24 h inoculation access period (IAP) in the glass trappers with viruliferous whiteflies on the leaves of healthy plants, thereby transmitting the virus particles from the viruliferous flies to the plant (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20161010/20161010003449_9495.jpgFigure 2. Trapper method for MYMIV inoculationConfirm the infection by PCR amplification of the MYMIV coat protein (575 bp fragment; Gen-Bank Accession number: HQ221570) using the primers MYMIV- coat protein (CP) gene (CP-F: 5’-GAA ACCTCGGTTTTACCG ACTGTATA G-3’ and CP-R: 5’-TTGCATA CACAGGATTTG AGGCATGAG-3’).Small RNA library preparationConstruct small RNA libraries for sequencing according to the Illumina TruSeq small RNA library protocol outlined in 'TruSeq small RNA sample preparation guide[href=http://support.illumina.com/content/dam/illumina-support/documents/documentation/chemistry_documentation/samplepreps_truseq/truseqsmallrna/truseq-small-rna-library-prep-kit-reference-guide-15004197-02.pdf]' (Part # 15004197; Rev. E; February 2013) (Figure 3).",
    "Manually isolate10 µg of total RNA (with a RIN value of 8 and above) using Trizol reagent and concentrate by 2 volumes chilled isopropanol, then resolve in a 15% denaturing polyacrylamide gel, and then excise small RNA fragments in the range of 18-0 nt from the gel and purify. Ligate 3’ and 5’ adaptors to the small RNAs using T4 RNA Ligase 2 in a buffer (see Recipe 1) by incubating at 25 °C for 1 h. Reverse transcribe the ligated products with Superscript II reverse transcriptase by priming with adapter specific primers in 15 µl reaction mixture containing 0.15 µl dNTP mix (100 mM), 1 µl reverse transcriptase (50 U/µl), 10x buffer (1.5 µl), RNase inhibitor (0.2 µl), water (4.2 µl), 3 µl RT primer and 5 µl RNA. Incubated the reaction mixture at 42 °C for 1 h followed by a heat inactivation of 5 min at 85 °C.Enriched the cDNA by a low cycle PCR amplification of 15 cycles (initial denaturation of 30 sec at 98 °C; 15 cycles of 98 °C for 10 sec, 60 °C for 30 sec, and 72 °C for 15 sec; followed by a final extension at 72 °C for 10 min) to generate ample template for deep sequencing and clean using polyacrylamide gel followed by overnight gel elution and salt precipitation using glycogen, 3 M sodium acetate and absolute ethanol. Re-suspended the precipitate in nuclease free water. Quantify the prepared library using Qubit fluorometer (50 ng/µl), and validate for quality by running an aliquot on high sensitivity DNA kits.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20161010/20161010003837_6787.jpgFigure 3. Flow chart for TruSeq small RNA sample preparationAnalyse small RNA using softwares/programmes like cutadapt-0.9.3 (Martin, 2011), bowtie-0.12.7 (Langmead and Salzberg, 2012), SeqQCv2.1 (DeLuca et al., 2012) and BLAST (Altschul et al., 1990).",
    "Steps of analysis are as under:Sequencing samples read filesGenerate fastq files from sequencing on GAIIx and use for downstream analysis.Sequence reads quality control (QC) reportsPerform QC for all the generated sequence reads from different samples in different lanes (Mugasimangalam et al., manuscript under preparation). Consider QC report for all the sequencing reads on the basis of percentage of high quality reads which has > 70% of bases in a read with > 20 phred score. Based on the analysis as per the QC (HQ reads > 90%) report process the sequenced reads further.Trimming readsTrimming is done using cutadapt-0.9.3 to remove ligated adapter sequences from the original small RNA sequences. Cutadapt tool removes user specified sequences from the fastq files (Martin, 2011).Generating unique reads and countingIdentify unique reads by writing the custom scripts and generate the read counts. Briefly below mentioned steps were carried out:Remove the reads which were less than or equal to 15 bases in length. Consider reads whose lengths were in the range of 16 to 36 bases. Identify unique sequences and remove duplicate sequences. Generate read count for each unique reads by identifying how many times it is present in the sequence data.Annotations of SnoRNA, SnRNA, rRNA, tRNAAlign the sequences against Glycine max genome using bowtie-0.12.7. Bowtie supports end-to-end alignment of fastq reads to the reference fasta file (Langmead et al., 2009). End-to-end alignment considers only those reads which align completely with upto 3 mismatches to the reference fasta file. Check the reads aligning with upto 3 mismatches by BLASTn (Altschul et al., 1990) against Rfam database (using default parameters) to identify other small RNA in the sequenced data (Meyers et al., 2008).miRNA annotationCheck the unique sequences by BLASTn (with an E-value cutoff of 10) against miRbase database to identify known miRNAs.",
    "Blast identifies similar sequences based on the sequence homology between the reference and query (unique reads)."
  ],
  "subjectAreas": [
    "Microbiology",
    "Plant Science",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}