{
  "id": 9791,
  "origin_website": "Jove",
  "title": "A Novel Method for Assessing Proximal and Distal Forelimb Function in the Rat: the Irvine, Beatties and Bresnahan (IBB) Forelimb Scale",
  "procedures": [
    "A. TRAINING OF RODENTS:\nAnimals should be exposed to the smell and taste of the cereal as soon as they arrive at the animal facility so they can become accustomed to eating this food.\nThe animals should also be adapted to the testing environment, a Perspex or plexiglass cylinder (Figure 1). A few pieces of cereal should be placed in the cylinder on the floor. Excessive grooming, urinating, defecating, and jumping are all indicators that the animals are stressed and more time is required for acclimation.\nThe next step involves video recording of the animals eating the cereal. It is advised that the experimenter holds the camcorder for filming, as it is likely that the animal will shift positions during eating.\nThe animals should be filmed eating one entire spherical and one doughnut-shaped cereal piece as the movements required vary somewhat between shapes and the best assessment involves observing both sequences.\nThe data for each shaped piece should be collected separately on the score sheet and then these scores should be combined to create an overall score for that rat on that day post-injury.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2246/2246fig1.jpg\nFigure 1. Recommended room layout for IBB behavioral testing (a) filming the animal within a perspex/plexiglass cylinder (b) filming the animal within its home cage.\nB. ASSESSMENT OF VIDEOS:\nAssessment of the animal's forelimb function should commence as soon as the animal starts to eat the cereal and stop as soon as the cereal piece is eaten.\nAssessments should only be made with spherical- and doughnut-shaped cereals that are of a consistent size and shape prior to the initiation of eating. Animals should not be scored when eating pieces of cereal that are broken prior to testing.",
    "For assessment, it is strongly advised that the speed of the videos be slowed down to at least half the original speed as even when injured, rats can eat quickly and the incidence of key behaviors may be missed. This can be achieved in programs such as QuickTime and Windows media player.  Recently injured (i.e. 1-14 days post-injury), rats will take considerably longer to eat the cereal than rats at a later stage in their recovery. Thus, experimenters should not be concerned about the difference in the length of the video they use to assess the rat at early versus later stages in their recovery.\nWhile observing the animal, use the IBB score sheet (Figure 2) to note the presence of the following behavioral features. Recovery of forelimb function occurs from left to right of the IBB score sheet.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2246/2246fig2.jpg\nFigure 2. The scoring sheet with individual categories that accompanies the Irvine, Beatties and Bresnahan forelimb scale. The first half of the sheet represents recovery of proximal forelimb function and the latter part of the sheet focuses on recovery of the forepaw.\nPredominant Elbow Joint Position:\nThe rat is assessed for the most common position (more than 50% of the time) assumed by the elbow during the eating phase (Figure 3).\nSCORED AS:\nEXTENDED - The elbow is held straight with an angle of more than 160°.\nPARTIALLY FLEXED - The elbow is flexed with an angle of less than 160° but more than 90°.\nFULLY FLEXED - The elbow is flexed with an angle of less than 90°.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2246/2246fig3.jpg",
    "Figure 3. Predominant Elbow Position. The rat is assessed for the most common position (more than 50% of the time) assumed by the elbow during eating. Extended is when the elbow is held straight with an angle of more than 160°. Partially Flexed - The elbow is flexed with an angle of less than 160° but more than 90°.  Fully Flexed - The elbow is flexed with an angle of less than 90°.\nProximal Forelimb Movements:\nThe rat is assessed for movements made by the shoulder and/or elbow of the impaired forelimb that may or may not result in contact of the forelimb with the cereal (Figure 4). [The rats are scored on the greatest extent of recovery they display during eating of the cereal. If animals show both slight and extensive proximal forelimb movements during eating they are scored as having extensive movements.]\nSCORED AS:\nNONE - There are no shoulder and/or elbow movements of the impaired forelimb.\nSLIGHT - is defined as movements through less than a third the range of the shoulder and/or elbow joint. Twitches and shrugs fall into this category.\nEXTENSIVE - is defined as movements that are more than a third the range of the shoulder and/or elbow joint. In early recovery, these movements can be numerous and erratic.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2246/2246fig4.jpg",
    "Figure 4. Proximal Forelimb Movements. The rat is assessed for movements made by the shoulder and/or elbow of the impaired forelimb that may or may not result in contact of the forelimb with the cereal. These proximal forelimb movements are defined as either: None - There are no shoulder and/or elbow movements of the impaired forelimb.  Slight - is defined as movements through less than half the range of the shoulder and/or elbow joint, twitches and shrugs fall into this category. Extensive - is defined as movements that are more than half the range of the shoulder and/or elbow joint, in early recovery, these movements can be numerous and erratic.\nContact Non-Volar Support:\nThe rat is assessed for its ability to use the non-volar surface of the impaired forelimb to stabilize the cereal piece and in doing so, maintaining it in a position to aid eating. Areas of the forelimb that may act as supports are the forearm above the wrist, the wrist or the back of digits (Figure 5).\n* NOTE: Volar comes from the Latin word \"vola\" which the ancient Romans used for \"the palm of the hand and the sole of the foot.\"\nSCORED AS:\nNONE - No non-volar support by the forelimb during the eating phase. (less than 5% of the time)\nSOME - Non-volar support of the object does occur during the eating phase but not always (less than 95% of the time).\nALMOST ALWAYS - Non-volar support of the object occurs nearly always or always during the eating phase (95-100% of the time).\nimgsrc://cloudfront.jove.com/files/ftp_upload/2246/2246fig5.jpg",
    "Figure 5. Contact Non-Volar Support. The rat is assessed for its ability to use the non-volar surface of the impaired forelimb to stabilize the cereal piece and in doing so, maintaining it in a position to aid eating. Areas of the forelimb that may act as supports are the forearm above the wrist, the wrist or the back of digits. Contact non-volar support can be defined as either: None - No non-volar support by the forelimb during eating (<5% of the time). Some - Non-volar support of the object does occur during eating but not always. Almost always - Non-volar support of the object occurs nearly always or always during eating (>95% of the time). Non-volar support includes areas such as (i) above the wrist, (ii) the wrist or (iii) the back of digits.\nPredominant Forepaw Position:\nThe rat is assessed for the most common position (more than 50% of the time) assumed by the digits, from flexed to extended, during eating (Figure 6).\nSCORED AS:\nCLUBBED, FIXED and FLEXED - The digits are flexed and held in a fist with joint angles of ~ 90°.\nEXTENDED NON-ADAPTABLE - The digits are extended with an angle of > 160° and do not conform to the shape of the held object.\nPARTIALLY FLEXED ADAPTABLE - The digits are partially flexed and conform to the shape of the object.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2246/2246fig6.jpg",
    "Figure 6. Predominant Forepaw Position. The rat is assessed for the most common position (more than 50% of the time) assumed by the digits. Scored as either (i) clubbed, flexed and fixed - the digits are flexed and held in a fist with joint angles of ~90°. (ii) extended, non-adaptable - the digits are extended with an angle of > 160° and do not conform to the shape of the held object. (iii) partially flexed, adaptable  - the digits are partially extended and conform to the shape of the object. Diagrams within the squares are observing  the impaired forepaw, depicting digit 1 and 3 (*), from above.\nContact Volar Support:\nThe rat is assessed for its ability to use the volar surface of the impaired forepaw to stabilize the cereal piece and in doing so, maintaining it in a position to aid eating (Figure 7).\nSCORED AS:\nNONE - No support with the volar surface of the forepaw during eating (less than 5% of the time).\nSOME - Support of the object with the volar surface of the forepaw does occur during eating but not always (less than 95% of the time).\nALMOST ALWAYS - Support of the object with the volar surface of the forepaw occurs nearly always or always during eating (95-100% of the time).\nimgsrc://cloudfront.jove.com/files/ftp_upload/2246/2246fig7.jpg",
    "Figure 7. Contact Volar Support. The rat is assessed for its ability to use the volar surface of the impaired forepaw to stabilize the cereal piece and in doing so, maintaining it in a position to aid eating. Contact volar support can be defined as either: None - No volar support by the forelimb during eating (<5% of the time). Some - volar support of the object does occur during eating but not always. Almost always - volar support of the object occurs nearly always or always during eating (>95% of the time).  Examples of recovery of volar support over time are shown above (i) 14 days post-injury, (ii) 28 days post-injury (iii) 42 days post-injury.\nWrist Movement During Manipulation:\nThe rat is assessed for the presence of wrist movements of the impaired forepaw during eating, once volar support has been established. Movements of the wrist that occur in the absence of contact between the impaired forepaw and the cereal are NOT scored. These movements can occur in any direction, for example; a dorsal (towards the head) to ventral (down towards the stomach) direction or medial (in towards the body midline) to lateral (away from the body midline) direction (Figure 8).\nSCORED AS:\nYES OR NO.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2246/2246fig8.jpg\nFigure 8. Wrist Movement. The rat is assessed for the presence of wrist movements of the impaired forepaw during eating, once volar support has been established. Movements of the wrist that occur in the absence of contact between the impaired forepaw and the cereal are NOT scored. These movements can occur in any direction, for example; (i) a dorsal (towards the head) to ventral (down towards the stomach) direction or (ii) medial (in towards the body midline) to lateral (away from the body midline) direction.\nCereal Adjustments (Control):",
    "The rat is assessed for movements made by the impaired forelimb that are synchronized (in time) with successful manipulatory movements of the unimpaired forelimb, and that contribute to the proper manipulation of the cereal (Figure 9). [If animals show both exaggerated and subtle proximal forelimb movements during eating, they are scored as having exaggerated movements, as these disappear with further recovery.]\nSCORED AS:\nNONE - There are NO cereal adjustments made by the impaired forelimb.\nEXAGGERATED - movements by the shoulder and/or elbow and/or wrist of the impaired forelimb that produce a complete loss of contact between the forepaw and the cereal. These incidences are brief and typically occur just prior to successful manipulatory movements of the cereal with the volar surface of the impaired forepaw.\nSUBTLE - is defined as movements by the shoulder and/or elbow and/or wrist of the impaired forelimb that occur without a loss of contact between the forepaw and the cereal during eating.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2246/2246fig9.jpg",
    "Figure 9. Cereal Adjustments (Control). The rat is assessed for movements made by the impaired forelimb that are synchronised (in time) with successful manipulatory movements of the unimpaired forelimb, and that contribute to the proper manipulation of the cereal. These cereal adjustments can be defined as either: None - There are NO cereal adjustments made by the impaired forelimb, Exaggerated - movements by the shoulder and/or elbow and/or wrist of the impaired forelimb that produce a complete loss of contact between the forepaw and the cereal or Subtle - is defined as movements by the shoulder, and/or elbow, and/or wrist of the impaired forelimb that occur without a loss of contact between the forepaw and the cereal during eating. [If animals show both exaggerated and subtle proximal forelimb movements during eating, they are scored as having exaggerated movements, as these disappear with further recovery.]\nPresence of Digit Movements\nThe rat is assessed for the presence of movements made by the individual digits during eating (Figure 10). These movements can be either:\nNON-CONTACT - Movements of the digits occur but these movements DO NOT result in volar contact with the cereal.\nCONTACT MANIPULATORY - Movements of the digits occur that DO result in volar contact of the digit with the object and in doing so, contribute to manipulation of the cereal.\nSCORED AS:\nYES OR NO.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2246/2246fig10.jpg",
    "Figure 10. Presence of Digit Movements. The rat is assessed for the presence of movements made by the individual digits during the eating phase. These movements can be either: Non-contact - movements of the digits occur but these movements DO NOT result in volar contact with the cereal. Contact manipulatory - movements of the digits occur that DO result in volar contact of the digit with the object and in doing so, contribute to manipulation of the cereal. (iii) is a schematic diagram that depicts the palmar surface of the rat forepaw indicating the organization of the digits from 1 to 5, and (iv) is the digits of the forepaw in a partially flexed adaptable position grasping a spherically-shaped object.\nGrasping Method:\nThe rat is assessed for the most common (more than 50% of the time) grasping technique used during the eating phase. Several grasping methods exist but the most common are the \"pincer\", the \"hook\" and the \"whole\" grasp (Figure 11). The grasping techniques used by the rat are stereotypical depending on the size and shape of the cereal piece. The figures below depict the sequence of grasping techniques used by the unimpaired rat during consumption of the doughnut-shaped cereal (Figure 12) and the spherical-shaped cereal (Figure 13).\nSCORED AS:\nABNORMAL - Consistent use of an alternative method of grasping to the method used prior to injury to support and control the cereal piece during the eating phase.\nSOMETIMES NORMAL - Inconsistent use of the grasping method used prior to injury to support and control the cereal piece during the eating phase.\nALMOST ALWAYS NORMAL - Consistent use of the grasping method used prior to injury to support and control the cereal piece during the eating phase.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2246/2246fig11.jpg",
    "Figure 11. Grasping Methods. The rat is assessed for the most common (more than 50% of the time) grasping technique used during the eating phase and if this predominant grasping techinique is consistent with the technique used prior to injury. Several grasping methods exist but the most common are the (i) \"precision\", (ii) the \"hook\" and (iii) the \"whole\" grasp. The grasping techniques used by the rat are stereotypical depending on the size and shape of the cereal piece (See figures 12 and 13). Grasping methods used by the rat can be defined as Abnormal - Consistent use of an alternative method of grasping to the method used prior to injury to support and control the cereal piece during the eating phase. Sometimes normal - Inconsistent use of the grasping method used prior to injury to support and control the cereal piece during the eating phase. Almost always normal - Consistent use of the grasping method used prior to injury to support and control the cereal piece during the eating phase.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2246/2246fig12.jpg\nFigure 12. The stereotypical sequence of grasping techniques used by an unimpaired rat during consumption of a doughnut-shaped cereal piece.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2246/2246fig13.jpg\nFigure 13. The stereotypical sequence of grasping techniques used by an unimpaired rat during consumption of a spherical-shaped cereal piece.\nC. ASSIGNING AN IBB SCORE\nThe predominant elbow position is EXTENDED, with NO or SLIGHT proximal forelimb movements and /or NO non-volar support by the forelimb ipsilateral to the injury site.\nThe predominant elbow position is PARTIALLY FLEXED, with SLIGHT or EXTENSIVE proximal limb movements and SOME non-volar support by the forelimb ipsilateral to the injury site. The predominant forepaw position is CLUBBED, FIXED and FLEXED.",
    "The predominant elbow position is PARTIALLY FLEXED, with EXTENSIVE proximal limb movements and ALMOST ALWAYS non-volar support by the forelimb ipsilateral to the injury site. The predominant forepaw position is CLUBBED, FIXED and FLEXED.\nThe predominant elbow position is FULLY FLEXED, with EXTENSIVE proximal limb movements and SOME volar support by the forelimb ipsilateral to the injury. Wrist movements and/or EXAGGERATED cereal adjustments are present. The predominant forepaw position is EXTENDED, NON-ADAPTABLE.\nThe predominant elbow position is FULLY FLEXED, with EXTENSIVE proximal limb movements and SOME volar support by the forelimb ipsilateral to the injury site. Wrist movements and/or SUBTLE cereal adjustments are present with NON-CONTACT movements of DIGIT 2. The predominant forepaw position is EXTENDED, NON-ADAPTABLE.\nThe predominant elbow position is FULLY FLEXED, with EXTENSIVE proximal limb movements and ALMOST ALWAYS volar support by the forelimb ipsilateral to the injury site. Wrist movements and SUBTLE cereal adjustments are present with CONTACT MANIPULATORY movements of DIGIT 2. The predominant forepaw position is EXTENDED, NON-ADAPTABLE.\nThe predominant elbow position is FULLY FLEXED, with EXTENSIVE proximal limb movements and ALMOST ALWAYS volar support by the forelimb ipsilateral to the injury site. Wrist movements and SUBTLE cereal adjustments are present with CONTACT MANIPULATORY movements of DIGIT 2 and NON-CONTACT movements of DIGIT 3. The predominant forepaw position is EXTENDED, NON-ADAPTABLE with an ABNORMAL grasping method.\nThe predominant elbow position is FULLY FLEXED, with EXTENSIVE proximal limb movements and ALMOST ALWAYS volar support by the forelimb ipsilateral to the injury site. Wrist movements and SUBTLE cereal adjustments are present with CONTACT MANIPULATORY movements of DIGIT 2 and DIGIT 3 and NON-CONTACT movements of DIGIT 4. The predominant forepaw position is PARTIALLY FLEXED ADAPTABLE with a SOMETIMES NORMAL grasping method.",
    "The predominant elbow position is FULLY FLEXED, with EXTENSIVE proximal limb movements and ALMOST ALWAYS volar support by the forelimb ipsilateral to the injury site. Wrist movements and SUBTLE cereal adjustments are present with CONTACT MANIPULATORY movements of DIGITS 2 3 and 4. The predominant forepaw position is PARTIALLY FLEXED ADAPTABLE with a SOMETIMES NORMAL grasping method.\nThe predominant elbow position is FULLY FLEXED, with EXTENSIVE proximal limb movements and ALMOST ALWAYS volar support by the forelimb ipsilateral to the injury site. Wrist movements and SUBTLE cereal adjustments are present with CONTACT MANIPULATORY movements of DIGITS 2 3 and 4. The predominant forepaw position is PARTIALLY FLEXED ADAPTABLE with an ALMOST ALWAYS NORMAL grasping method.\nD. TROUBLESHOOTING\nWhen animals don't eat:\nOccasionally, as with ALL behavioral tasks, some animals may not perform correctly. In an attempt to avoid eliminating the animal(s) from the study, ascertain whether the animal will eat in their home cage while being filmed. If this is possible then, despite the ability of the other animals to eat in the cylinder, ALL of the rats should be assessed individually in their home cage to be consistent. If the animal refuses to eat in the home cage while being filmed, they should have their \"cage buddy\" present during filming. For this reason, animals should be housed in pairs. Failing that, the rat should be dropped from the study.\nWhy do I have to use spherical and doughnut-shaped cereals for testing; why not other shapes and sizes?",
    "During the development of the IBB scale, rats were also tested with a flat, square piece of cereal. After injury, the rats would only use one paw to hold and consume the cereal. In contrast, the spherical and doughnut-shaped cereals forced the rat to engage the impaired forelimb in some form during eating. It was also clear that the size of the object partially determined whether there was an opportunity for contact of all the digits with the cereal. Smaller sized or broken pieces of cereal did not require contact of all the digits with the cereal during eating (most importantly digits 4 and 5), thus preventing the viewer from assessing the function of these digits.\nWhy do I have to use both a spherical and doughnut-shaped cereal for testing?",
    "As discussed previously, the consumption of the spherical and doughnut-shaped cereals will engage the use of all of the digits of an injured forepaw (Figure 12 and 13). However, detailed analysis of the normal eating patterns with each of these cereal shapes revealed both similarities and differences. For example, as the rat eats these two differently shaped cereals, there is a gradual decrease in the space between the digits as the cereal pieces get smaller. This reduction in the interdigital space makes it more difficult for the viewer to determine movements made by the individual digits. In relation to this point, when the rat first handles a spherically-shaped cereal there is a greater distance between the digits than that created with a doughnut-shaped cereal. This will make it easier for the viewer to determine independent movements of the digits at this initial stage of eating. In contrast, the doughnut-shaped cereal requires more contact and movement of the digits during the entire eating phase than the spherical shape, thus increasing the opportunities to see the digits move.\nWhen during the eating phase should I score?\nAssessment of the animal to allocate it an IBB score should commence as soon as the animal starts to eat. Assessment should only be made with objects of the correct size and shape. Animals should not be scored when eating broken pieces of the object.  Furthermore, scoring during the eating phase involves ANY movements made by the impaired forelimb throughout the consumption of the cereal piece. This includes movements made during the times when the rat pauses to chew the cereal.\nWhat determines proximal forelimb movements to be \"extensive\" or \"slight\"?",
    "Extensive proximal forelimb movements are described as those that move MORE than a third of the range of the joint, in many situations these movements are numerous and erratic. Slight proximal forelimb movements are less obvious than extensive movements based on the shorter distance that the affected forelimb is propelled from the object. These are movements of the forearm that move LESS than a third of the range of the joint. See Figure 14 for the range of motion for the joints of the forearm.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2246/2246fig14.jpg\nFigure 14. Ranges of movement of the shoulder, elbow and wrist joints.\nWhat if an animal has both contact non-volar and volar support?\nIf the animal is supporting the cereal by both non-volar and volar areas of the forepaw then that animal should be scored as having some contact non-volar and volar support.\nIn general the rat has subtle cereal adjustments, yet there is a single incidence of an exaggerated adjustment. How should I rate that animal?\nAs you move to the right of the sheet, the rat is penalized more heavily for the presence of abnormal behaviors no matter how infrequently they present themselves during the eating phase. This is to ensure that the rat is given a score that represents its best performance. Normal animals do not exhibit exaggerated cereal adjustments. In this case, the rat should be scored as having exaggerated cereal adjustments.\nWhat does the term extended, non-adaptable paw position mean?\nThe digits of the forepaw are outstretched at an angle of 160 degrees or more, and do not conforming to the shape/size of the cereal piece.\nHow do I determine if the wrist joint is moving?",
    "When establishing whether the wrist of the animal is moving during the eating phase, the observer should confirm that movements of the elbow and/or shoulder are not giving the appearance of wrist movements.\nCan the wrist move prior to volar support?\nFollowing extensive analysis of rats following varying extents of injury, wrist movement was, in general, observed once volar contact was made with the cereal.\nHow do I know if the rat is using a \"normal\" grasping method?\nAs with all behavioral tests, baseline data must be taken to establish how the animal grasps the object prior to injury. This is necessary as the animal may adopt an alternative grasping strategy following injury depending on the shape of the object. Following extensive analysis of rats prior to cervical injury we found that they use stereotypical grasping techniques depending on the shape of the object (as described in Figures 12 and 13). For example, with a sphere, the rat will generally start with a \"whole grip\" and then finish by using the \"pincer grip\", thus anything used in place of these grasping patterns would be considered abnormal.\nHow should I assign an IBB score?\nThe IBB is a 10-point ordinal scale of recovery progression with scores ranging from 0 to 9. Rats must fulfil all of the behaviors that describe each point or the rat is scored the closest deficit score."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}