{
  "id": 15163,
  "origin_website": "Jove",
  "title": "Inducible, Cell Type-Specific Expression in Arabidopsis thaliana Through LhGR-Mediated Trans-Activation",
  "procedures": [
    "Vectors and modules can be obtained from the non-profit repository, Addgene (https://www.addgene.org).\n1. Cloning using GreenGate\nDesign primers using the overhangs listed in Table 1, replacing ‘NNNN’ with module type-specific adapter sequences listed below: Forward: 5´AACA GGTCTC A NNNN (n) CA* + specific sequence 3´, Reverse: 5´AACA GGTCTC A NNNN (n) + reverse complement of specific sequence 3´. Add the underlined bases to ensure maintenance of the reading frame.\n\tModule overhangs:\n\t​NOTE: In the default GreenGate framework, six modules, A-F, are assembled with a plant transformation vector backbone into one expression plasmid (Figure 1C). Typically, the A module will harbor promoter sequences, a B-module an N-terminal tag or “dummy” sequence6, a C-module a CDS, a D-module a C-terminal tag or dummy, an E-module a terminator, and an F-module a resistance cassette for selection of transgenic plants. Adapter for coupling with other preassembled units are available for use instead of the F module2.\nPCR amplification\n\t\nAmplify the sequence of interest with the designed primers by polymerase chain reaction (PCR) according to standard protocols.\nSeparate the PCR product on an agarose gel. Excise and column purify the correct fragment using a commercial kit (see Table of Materials) as per the manufacturer’s instructions.\nEntry module creation\n\t\nSeparately digest the module vector and the PCR fragment (step 1.2.) (Figure 1 A, B) with Eco31I/BsaI using 100-500 ng of DNA (Vector or Fragment), 3 µL 10x digestion buffer, and 5-10 U Eco31I in a tube and bring the volume to 30 µL with ddH2O.\nMix gently by pipetting up and down and spin down briefly at 1,000 x g. Incubate at 37 °C on a heat block for 15 min (or following the time recommendation of the purchased restriction enzyme).",
    "After the digestion, column purify each sample using a commercial kit (see Table of Materials) and quantify the obtained DNA by determining the optical density at 260 nm (OD260) using a spectrophotometer.\nMix the 30 – 100 ng digested insert and the 10 – 50 ng digested vector by pipetting up and down several times and incubate with 1 µL T4 Ligase (5 U/µL, and 3 µL 10 x T4 ligation buffer in a total volume of 30 µL at room temperature for 1 h (following the recommendation of the T4 ligase supplier) (see Table of Materials).\n\t\tNOTE: Calculate the desired molar ratio entry module:destination vector (e.g., 3:1) for the ligation depending on the concentration and length of the entry module inserts.\nTo increase the efficiency of transformation, heat inactivate the T4 ligase by Incubating the reaction at 65 °C for 20 min.\nUse the ligation product to transform competent E. coli cells according to the standard lab protocols and spread the bacteria on agar plates supplemented with ampicillin (100 µg/mL)\nIncubate the plate with bacteria at 37 °C for overnight.\nScreen for colonies with the desired entry module by colony PCR using the primers 86A1 (5′-GTTGTGTGGAATTGTGAGC-3′) and 86A2 (5′-GTTTTCCCAGTCACGACG-3′) and standard PCR conditions.\n\t\tNOTE: This primer combination is valid for all entry modules as the primers bind to the entry vector backbone.\nSelect single colonies for the plasmid isolation. Use 2 mL LB liquid culture supplemented with ampicillin (100 µg/mL) and incubate overnight in a 37 °C shaker.\nIsolate plasmids from the overnight liquid culture with a Mini-Prep Kit or the desired extraction protocol (see Table of Materials).",
    "To identify plasmids with the correct insert, perform restriction enzyme analysis, for example by selecting two enzymes that cut uniquely in your insert by mixing 200 ng of plasmid, 2 µL 10 x digestion buffer, 5-10 U of selected restriction enzymes and ddH2O to 20 µL.\nSequence the selected plasmids using the primers 86A1 and 86A2 (see step 1.3.9.).\nDestination module creation:\n\tNOTE: For the destination plasmid use the desired destination module pGGZ001, pGGZ002 or pGGZ0032 (Figure 1C).\n\t\nIn a tube add and mix 50 – 150 ng empty destination vector (pGGZ003, for example), 50-300 ng of each filled entry module, 2 µL 10 x digestion buffer buffer, 1.5 µL 10 mM ATP, 1 µL T4 Ligase (30 U/µL), 5-10 U µL Eco31I and dH2O to a total volume of 20 µl.\n\t\tNOTE: Calculate the desired molar ratio entry module:destination vector (e.g. 3:1) for the ligation depending on the concentration and length of the entry module inserts.\nMix and perform the GreenGate reaction2 using a PCR thermocycler alternating 30 times between 37 °C for 5 min and 16 °C for 2 min, followed by single steps of 5 min at 50 °C and 5 min at 80 °C.\nTo increase the efficiency, add 1 µL T4 Ligase (30 U/µL) and 1.5 µL 10 mM ATP to the reaction and incubate for 1 h at room temperature, followed by heat-inactivation of T4 DNA Ligase at 65 °C for 20 min.\nUse the ligation reaction to transform competent E. coli and spread the bacteria on agar plates supplemented with the appropriate selective agent spectinomycin (50 µg/mL).\nIncubate the transformed E. coli on the plate at 37 °C for overnight.",
    "To confirm transformation, re-streak each of the selected single colonies on spectinomycin (50 µg/mL) and ampicillin (100 µg/mL) containing plates, respectively. Use only colonies that grow on spectinomycin but not on ampicillin plates.\nIncubate the E. coli colonies overnight at 37 °C.\nSelect single colonies for plasmid isolation. Use 2 mL LB liquid culture supplemented with spectinomycin (50 µg/mL) and incubate overnight at a 37 °C shaker.\nIsolate the corresponding plasmids with a Mini-Prep Kit (see Table of Materials).\nCheck by restriction enzyme analysis (see 1.3.12.) and sequence selected positive constructs using primers 88C3 (5′-ACCTCTCGGGCTTCTGG-3′), 88C4 (5′-CCTTTTTACGGTTCCTG-3′). If the insert cannot be fully sequenced with these primers, design internal primers for sequencing.\n\t\tNOTE: To identify clones with the correct number of pOp repeat sequences (see Discussion), the primers pOp6 (pOp6_F, 5′-TGCATATGTCGAGCTCAAGAA-3′; and pOp6_R, 5′-CTTATATAGAGGAAGGGTCTT-3′) that bind in the short flanking sequences can be used for PCR amplification and subsequent gel electrophoresis to discriminate by size.\nIntermediate supermodule creation\n\t\nTo combine two independent sets of entry modules, as required for generating the GR-LhG4 driver lines with integrated reporter-effector cassette, first build two intermediate plasmids, called supermodules2, before assembling the final expression plasmid in pGGZ001 or pGGZ003.\nBe sure to add F-H adaptor at the end of the first supermodule and H-A adaptor at the beginning of the second supermodule (those serve as connections between two constructs) as described2.\n\t\tNOTE: Only the pGGN000 intermediate module carries the resistance cassette. To generate the expression plasmid, perform the GreenGate reaction with the destination vector and the pGGN000 and pGGM000 intermediate supermodules. Alternatively, mix destination vector, pGGN000 intermediate supermodule, and the remaining single modules to perform the GreenGate reaction2. The latter method is less efficient than the former but can be faster.",
    "To create a pGGM000/pGGN000 supermodule, mix 1.5 µL (100-300 ng/µL) of each of the entry modules with 1 µL (30 ng/µL) empty intermediate vector (pGGM000 or pGGN000), 2 µL 10 x digestion buffer, 1.5 µL 10 mM ATP, 1 µL T4 Ligase (30 U/µL), and 5-10 U Eco31I in a total volume of 20 µL.\n\t\tNOTE: Calculate the desired molar ratio entry module:destination vector (e.g., 3:1) for the ligation depending on the concentration and length of the entry module inserts\nMix and perform the GreenGate reaction as in step 1.4.2\nTo increase efficiency, add 1 µL T4 Ligase and 1.5 µL ATP (10 mM), and incubate for 1 h at room temperature, followed by heat-inactivation at 65 °C for 20 min.\nUse 10 µL of the ligation reaction to transform competent E. coli and streak on plates containing kanamycin (50 µg/mL).\nPerform overnight incubation of the transformed E. coli on the plate at 37 °C.\nRe-streak each of the selected single colonies on kanamycin (50 µg/mL) and ampicillin (100 µg/mL) containing plates, respectively.\nPerform overnight incubation of the E. coli colonies on the plate at 37 °C.\nSelect single colonies that grow only on kanamycin but not on ampicillin for plasmid isolation. Use 2 mL LB liquid culture supplemented with kanamycin (50 µg/mL) and incubate overnight in a 37 °C shaker.\nIsolate the corresponding plasmids using a mini-prep kit (see Table of Materials).\nCheck the plasmids by restriction enzyme analysis (see 1.3.12.)and confirm by sequencing using primers 87E2 (5´-AGGCATCAAACTAAGCAGAAG-3´) and 87E3 (5´-CGTTTCCCGTTGAATATGGC-3´) annealing to the pGGM000/pGGN000 backbone. If the insert cannot be fully sequenced with these primers, design internal primers for sequencing.",
    "NOTE: If cloning into the pGGM000 or pGGN000 vectors is unsuccessful, one possible solution is to digest the pGGM000 or pGGN000 with Eco31I, run on a gel and purify from the gel the pGGM000 or pGGN000 backbone (approximately 2000 bp) fragment without the ccdB cassette (approximately 1400 bp). Then proceed normally with the ligation reaction.\nTransform an A. tumefaciens pSOUP+ strain (e.g. ASE), as the pSa origin of replication (ori A. tum.) in the destination vectors require the presence of the helper plasmid pSOUP12. Streak out bacteria on LB plates containing chloramphenicol (34 µg/mL), kanamycin (50 µg/mL), spectinomycin (50 µg/mL) and tetracycline (12.5 µg/mL). Incubate the transformed A. tumefaciens on the plate in a 28 °C incubator for two to three days.\n2. Generation of Arabidopsis transgenic plants\nTransformation of Arabidopsis thaliana.\n\tNOTE: Transform A. thaliana plants according to Zhang et al., 200613.\nSelection of transgenic lines.\n\t\nTo select the transformed plants, use the selection scheme used at GABI-Kat14 for resistance to sulfadiazine15.\nTo select stable lines with a possible single integration event, choose those in generation T2, that show the 3:1 segregation ratio in the resistance marker. Propagate these lines to T3 generation and select the plants homozygous for the resistance gene. Alternatively, perform a Southern Blot analysis or a standard quantitative real-time PCR (SA-qPCR)16 to select single insertion lines.\n3. Induction of trans-activation in Arabidopsis driver lines\nRoot\n\t\nTo test reporter expression in A. thaliana driver lines generated through steps 1 and 2, sterilize seeds as described below.\n\t\t\nAdd 0.5-1.0 mL of 70 % Ethanol + 0.01 % non-ionic detergent to approximately 100 seeds (20 mg) in a 1.5 ml reaction tube and invert the tube a few times. Spin down at 1000 x g for 15 s and aspirate the supernatant.",
    "Add 0.5-1.0 mL of absolute ethanol. Invert the tube several times, spin down for 1,000 x g for 15 s and discard the supernatant.\nAdd 0.5-1.0 mL of absolute ethanol and invert the tube t a few times, then spin down at 1,000 x g for 15 s and discard the supernatant.\nAllow seeds to dry inside the hood. If seeds are going to be stratified in tubes continue with step 3.1.1.6.\nAdd 0.5-1.0 mL of sterile water and invert the tube a few times. Spin down at 1,000 x g for 15 s and discard the supernatant.\nAdd 0.5-1.0 mL of sterile water and invert the tube several times. Spin down at 1,000 x g for 15 s and discard the supernatant.\nAdd 0.5-1.0 mL of sterile water.\nPrepare half-strength Murashige and Skoog medium, pH 5.8 and add 0.9% plant agar and 1% sucrose. After autoclaving add Dexamethasone (Dex), dissolved in DMSO, to a final concentration of 10 - 30 µM to induction plates and an equal amount of DMSO to control plates, respectively.\nPut seeds for root imaging on plates and stratify them for 48 h in darkness and cold (4 °C).\nPut plates in a vertical position in a plant incubator (long day (16/8 h), 22 °C, humidity, 65 %) and grow them for five days.\nFive days after germination (dag), image the seedlings using confocal laser scanning microscopy.\nStem\n\t\nSterilize seeds as described in 2.1.1. and put seeds on ½ MS, 0.9% plant agar and 1 % sucrose plates. Stratify for 48 h in darkness and cold (4 °C).\nSix to seven days after germination, transfer the seedlings to soil, each plant in a single pot (long day (16/8 h), 22 °C, humidity, 65%).",
    "Induce trans-activation in stems by watering with Dex or mock solution, or by dipping the plants in Dex or mock solutions, respectively.\nFor watering, use a 25 µM Dex solution in water prepared from a stock of 25 mM Dex dissolved in ethanol. Water every 2-3 days until the desired time of induction.\nFor dipping, prepare a 1 L beaker, 750 mL of water containing 0.02% silwet L-77 with 25 µM of Dex or equivalent amount of DMSO for the Dex and mock treatment, respectively. Dip single plants for 30 s in the induction or in the mock solution. Repeat every 2-3 days until the desired time of imaging.\n\t\tNOTE: Following the dipping, the plants should be maintained in high humidity for one hour.\nShoot Apical Meristem (SAM)\n\t\nSterilize seeds as described in 2.1.1. Prepare plates with ½ MS, 0.9 % plant agar and 1 % sucrose medium and put seeds on plates. Store the plates for two days in darkness and cold for stratification.\nPut plates in a vertical position in a plant incubator. Six to seven days after germination, transfer the seedlings to the soil, each plant in a single pot (long day (16/8 h), 22 °C, humidity, 65 %).\nWhen the stem is around 1 cm long (25-30 dag), spray the inflorescence SAM with 10-50 µM Dex in H20 wearing a face mask. For induction and imaging at later stages of development, induce SAMs of longer stems or side shoots.\n\t\tNOTE: SAMs can also be induced by paintbrushing the Dex solution to prevent spray droplets. Do use a mask when Dex is applied by spraying.\n24-48 h after induction, dissect the SAMs and proceed to imaging (see 4.3).",
    "NOTE: Only un-induced plants were used for propagation to reduce the probability of gene silencing. Plants in T2/T3 were used for imaging.\n4. Imaging of reporter expression in Arabidopsis driver lines.\nRoot\n\t\nTransfer seedlings from plate to a 10 µg/mL propidium iodide (PI) solution and counter-stain them for 5 min.\nPlace the roots into a microscope imaging chamber (1-well tissue culture chamber on cover glass II, see Table of Materials) and image them using a confocal laser scanning microscope with a 63x water immersion objective (see Table of Materials).\nTo visualize PI fluorescence, use an excitation wavelength of 488 nm and collect emission between 590 and 660 nm. For mTurquoise2 fluorescence use 458 nm excitation and collect emission between 460 and 615 nm.\nStem\n\t\nPerform horizontal hand cut sections of plant stems with a razor blade, excising a segment of approximately 3 cm. Fix the stem with the finger on the opposite side of the desired section to cut. Perform several fine cuts sequentially but note that only sections from a similar position in the stem should be compared.\nAfter each cut, immerse the razorblade in a petri dish containing tap water and collect the stem sections. Stain sections at this point or directly mount on microscope slides.\nFor staining, prepare a 1 mL of 250 µg/mL of PI solution of water in a small petri dish (see Table of Materials). Immerse the sections for 5 min and rinse them in water. Transfer them to microscope slides with fine forceps or a fine paint brush. Take care to not squeeze the samples with the coverslip.",
    "Image samples using a confocal laser scanning microscope with a 25x dipping water immersion lens (see Table of Materials). Use 561 nm laser light to excite PI fluorescence and collect from 570 to 620 nm. Use 405 nm to excite the mTurquoise2 fluorophore effector encoded by the driver line constructs and collect emission from 425 to 475 nm.\nShoot Apical Meristem\n\t\nCut the stem 2 cm below the shoot tip with forceps. Hold the stem in one hand and use fine forceps to remove the flower buds and large primordia. To remove young primordia, fix the SAM in an upright position into a petri dish containing 3 % agarose. Use a binocular and forceps to remove young primordia close to the SAM. Alternatively, use an injection cannula (see Table of Materials) to cut off these primordia.\nStain the dissected SAM in a 250 µg/mL PI solution for 5-10 min. Perform staining either directly by pipetting a few drops of staining solution on top of the prepared SAM or transfer the sample to a tube filled with staining solution. Keep the SAM fully submerged during the staining procedure.\nPlace the stained SAM into a small petri dish (see Table of Materials) with 3 % agarose medium and cover the SAM with ddH2O.\nImage dissected SAMs using a confocal laser scanning microscope equipped with a 25 x dipping water immersion lens (see Table of Materials).\nUse 561 nm laser light to excite PI fluorescence and collect from 570 to 620 nm. Use 405 nm to excite the mTurquoise2 fluorophore and collect emission from 425 to 475 nm.\n\t\tRecord image stacks spanning 50 µm in z-direction with a step size of 0.5 µm.",
    "NOTE: SAM imaging as described here requires an upright confocal laser scanning microscope and a lens (here, a water dipping lens) with long working distance.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}