{
  "id": 6420,
  "origin_website": "Bio",
  "title": "Quantification of Serum Ovalbumin-specific Immunoglobulin E Titre via <em>in vivo</em> Passive Cutaneous Anaphylaxis Assay",
  "procedures": [
    "Serial 1 in 2 dilutions of serum samplesUsing a 96-well microplate, perform serial 1 in 2 dilutions of serum in PBS to a final sample volume of 55 μl.Notes:  Serum samples are obtained from OVA-sensitized and aerosol challenged murine models. Final serum dilutions include: neat, 1:2, 1:4, 1:8, 1:16, 1:32, 1:64 and 1:128 samples. Duplicate 55 μl PBS only samples are required as negative controls. A total of 8 individual experimental samples can be analyzed per rat, in addition to duplicate negative control samples.Male Sprague Dawley rat anesthetizationPlace male Sprague Dawley rat in an anesthetic induction chamber and anesthetize via isoflurane for approximately 3 min.Once sufficiently anesthetized, intraperitoneally inject the male Sprague Dawley rat with 4 ml 5.71% chloral hydrate solution using a 23 G x 1¼” needle and 5 ml syringe.Notes: This volume of 5.71% chloral hydrate solution will anesthetize an adult male Sprague Dawley rat (> 10 weeks old) for approximately 1 h. The male Sprague Dawley rat has reached sufficient deep plane anesthesia when the pedal withdrawal reflex is absent or barely noticeable. Place a small amount of topical ophthalmic ointment on the eyes of the anesthetized rat to stop them drying out during the procedure.Subcutaneous injections of serum dilutionsPlace the anesthetized male Sprague Dawley rat on a warming pad and closely shave the entire back of the rat from the base of the neck to the hips.Using a marker pen, mark an 8 x 8 dot grid covering the entire back of the rat. Space the dots approximately 1 cm apart (Figure 1).Notes: Do not use a blue marker as this will be hard to distinguish from the Evans blue dye.  An adult male Sprague Dawley rat will fit approximately 8 individual serum samples.",
    "Include 2 additional dots below the 8 x 8 sample grid for duplicate negative control samples. Starting with the highest dilution (1:128), subcutaneously inject 50 μl of the sample under the first marked dot using a 27 G x ½” 1 ml Insulin syringe. Continue down the first row of dots injecting each of the serial dilutions.Note: Start injections from the right-hand side of the rat if you inject with your right hand. This will avoid disturbing the injection sites as you progress across the back (Figure 1). Subcutaneously inject the 7 remaining individual samples and the duplicate PBS negative control samples, as per Step C3.Note: Always use a new sterile syringe for each individual sample. Once all samples have been injected, cover the back of the rat in cotton wool roll and place back in the housing cage.Monitor the anesthetized male Sprague Dawley rat periodically until full consciousness is regained.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190227/20190227180657_4331.jpgFigure 1. Representative diagram of steps performed in Procedure CEvans blue dye intravenous injectionTwenty-four hours after subcutaneously injecting the serum samples, re-anesthetize the rat as per Procedure B.Place anesthetized rat on its back and intravenously inject 2 ml of the 1:1 OVA-Evans blue dye solution (see Recipes) into the penile vein using a 26 G x ½” needle and 3 ml syringe.Place rat on its stomach and allow samples to incubate for 15-30 min.Following injection, subcutaneous serum samples that are positive for OVA-specific IgE will develop a blue color (Figure 2). Record the highest dilution for each individual serum sample that returns a positive indication.Once all data has been recorded, humanely euthanize the male Sprague Dawley rat by intravenously injecting 600 μl of Lethabarb® Pentobarbitone sodium into the heart using a 27 G x ½” 1 ml syringe.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190227/20190227180907_1236.jpgFigure 2.",
    "Extravasation of Evans blue detection dye indicating the presence of OVA-specific IgE in the serum sample. Subcutaneously injected serial dilutions of serum samples that contain OVA-specific IgE will become blue following the intravenous injection of an OVA-Evans blue dye solution. Record the highest dilution at which a blue injection site is present for each sample (i.e., 1:4 dilution for Sample 2)."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}