{
  "id": 9681,
  "origin_website": "Jove",
  "title": "Brain Imaging Investigation of the Neural Correlates of Emotional Autobiographical Recollection",
  "procedures": [
    "1. Collection and Selection of Memories, Imaged Task, and Experimental Protocol\nCollection of the Emotional AMs\nPersonal memories are elicited from each participant during an interview performed prior to the fMRI session, similar to the procedure employed for non-emotional AMs (e.g., 11, 12). Unlike most previous techniques, our AMQ is specifically constructed to target the assessment of emotional personal episodes and their recollective properties. A commonly used method in behavioural research and adapted for use in neuroimaging studies involves the Crovitz and Schiffman technique 13-15, where subjects remember specific, personally experienced events in response to cue words. A photo-paradigm has been also used to investigate AMs in more controlled settings in fMRI studies 16, 17. However, these techniques do not typically target examination of the emotional component of AMs, that are matched in terms of recollective qualities.\nOur AMQ comprises a list of 115 verbal cues for distinct life events (e.g., the birth of a family member, the death of a relative), which is a combination and extension of lists used by others 18, 19. For each cue, participants are asked to remember a unique episode from their life, that occurred in a specific place and time (e.g., one instance when s/he played in a specific basketball game), rather than remembering general or repeated events (e.g., playing high school basketball). Importantly, the memories must be accompanied by the recollection of being personally involved, rather than hearing about them from others.\nUpon recollection, participants are asked to provide a brief description of the memory (see Figure 1), which will then be used as a personalized memory cue during fMRI scanning (participants are naïve to the specific purpose of the pre-scanning interview).",
    "Each memory is also dated and rated on six Likert scales 20, 21, to assess its phenomenological properties (see Figure 1). Our scales included emotional valence (using a 7-point scale: -3 = very negative, 0 = neutral, +3 = very positive), emotional intensity, personal significance, the amount of contextual details, the amount of visuo-perceptual details (i.e., vividness), and the frequency of retrieval (all of the latter using a 7-point scale: 1 = not at all, 7 = extremely).\nimgsrc://cloudfront.jove.com/files/ftp_upload/2396/2396fig1.jpg\nFigure 1. Illustration of AMQ Administration. For each cue, participants remember and briefly describe a specific event, and then date and rate it on 6 scales.\nSelection of Highly Emotional AMs\nNext, the 40 most emotional memories (20 positive and 20 negative) are selected for each participant, based on the ratings provided on the AMQ (i.e., rated 2 or 3 and -2 or -3, respectively). The positive and negative AMs are then matched in terms of age and phenomenological properties, to ensure that any differences in brain activity during recollection are not confounded by differences in these basic properties.\nIf necessary, the descriptions of the selected memory cues are slightly adapted to be matched as closely as possible for length and grammatical complexity; it is also recommended to select a few additional memories for practice purposes.\nThe fMRI Task\nThe fMRI task is designed to allow comparison of the AM task with a semantic memory (SM) control task; the AM and SM retrieval trials have a similar general structure (see Figure 2A). We used CIGAL (http://www.nitrc.org/projects/cigal/[href=http://www.nitrc.org/projects/cigal/]) for stimulus presentation in the MR scanner, but other stimulus presentation software may also be used.",
    "The AM task is based on the personalised cues collected prior to scanning. Each trial begins with a cue that triggers AM recollection, which is indicated by the participant with a button press. Then, participants continue remembering details of the event until cued again to rate the recollected memory (Figure 2B).\nThe SM task involves generation of exemplars from different semantic categories (e.g., musical instruments, sports), which like AM retrieval involves search in memory and extended retrieval time 22 (Figure 2B). After a semantic category is cued, participants press a button as soon as they start recalling exemplars from that category and then continue recalling until cued again for memory ratings.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2396/2396fig2a.jpg\nimgsrc://cloudfront.jove.com/files/ftp_upload/2396/2396fig2b.jpg\nFigure 2. Structure of the fMRI Trials. A. General Structure of the trials. B. Specific structure of the AM and SM trials.\nIn addition to the basic comparison of AM and SM trials, other manipulations can also be involved. For instance, the focus of the AM retrieval can be manipulated by directing the participants to pay attention to emotional or non-emotional aspects of the remembered events (Figure 2B). This manipulation allows investigation of how retrieval focus may influence the experiencing of AMs and any associated changes in the associated neural correlates.\nEach AM or SM trial is followed by rating screens presented in a counterbalanced order, using 5-point Likert scales (see Figure 2B).\nThe experiment is split into runs/blocks of trials both to allow participants time to rest and to avoid data loss in case of equipment malfunction. Run order is counterbalanced between participants. Each run begins with six seconds of fixation, to allow stabilization of the MR signal. The AM and SM conditions are presented in a random order separated by an inter-trial interval of variable duration (5-9 sec, average = 7sec.).",
    "2. Preparing the Subject for the Scan\nAll participants provide written informed consent prior to running the experimental protocol, which is approved by an Ethics Board. Typically, to avoid confounds in the lateralization of brain activations, scanned participants are right-handed.\nPrior to Entering the Scanning Room\nOn the day of scanning, participants' current affective state is assessed 23, to control for the effect of mood on recollection of emotional AMs. In conjunction with post-scanning assessments, these initial evaluations can also be used to screen for changes in mood as a result of the study participation, and as covariates in the fMRI analyses to investigate brain activations influenced by current states. Similarly, assessments of personality traits can also be made (e.g., neuroticism), to investigate their possible biases on the AM task 24 and the associated neural correlates.\nPrior to the scan, participants are informed in detail of the scan procedures, and are given specific instructions for the behavioral task. Participants also complete a short practice session, to familiarize themselves with the task.\nEntering the Scanning Room\nParticipants are instructed to lie supine on the scanning bed, and are provided with additional head cushioning, to ensure comfort during the scan and to minimize movement. To further minimize head movement, the non-adhesive side of a length of tape may be wrapped lightly around the subjects' forehead. Subjects are given ear protection as well as isolation headphones to communicate with the experimenter during the MRI scan.\nSubject's right hand is positioned comfortably on the response box, thus allowing the left hand to be used for support or for other measurements (e.g., skin conductance responses). An emergency stop button is placed nearby so that the subject may indicate any urgent need to stop the scanner.",
    "Before starting data collection, it is critical to make sure that subjects can see the screen projection clearly for stimulus presentation and that the response buttons work properly.\n3. Data Recording and Processing\nScanning Parameters\nWe collected MRI data using a 1.5 Tesla Siemens Sonata scanner for MRI recordings. Anatomical images were 3D MPRAGE anatomical series (repetition time (TR) = 1600 ms, echo time (TE) = 3.82 ms; number of slices = 112; voxel size = 1x1x1 mm), and functional images were series of 28 functional slices, acquired axially using an echoplanar sequence (TR = 2000 ms; TE = 40 ms; field of view FOV = 256x256 mm; voxel size = 4x4x4 mm), thus allowing for full-brain coverage.\nData Analysis\nWe used Statistical Parametric Mapping (SPM: http://www.fil.ion.ucl.ac.uk/spm[href=http://www.fil.ion.ucl.ac.uk/spm]) in combination with in-house Matlab-based tools. Pre-processing involved typical steps: quality assurance, TR alignment, motion correction, co-registration, normalization, and smoothing (8 mm3 Kernel). Individual and group-level statistical analyses may involve comparisons of brain activity according to memory type (AM vs. SM), emotional valence (positive vs. negative), and retrieval focus (emotional vs. non-emotional content).\n4. Representative Results\nimgsrc://cloudfront.jove.com/files/ftp_upload/2396/2396fig3.jpg",
    "Figure 3. Neural Correlates of AM Retrieval. Validating the present protocol, retrieval of AMs yielded increased activity in the AM retrieval network 4, 25, including hippocampal areas (a), involved in general memory retrieval, the medial prefrontal cortex (b), associated with personal engagement, the cuneus/precuneus regions and parieto-occipital junction (c, e, respectively), associated with processing visuo-spatial representation, and the frontal-temporal junction (d), involved in affective AM retrieval; similar effects to the latter were also found in the amygdala (not shown). The \"activation maps\" are superimposed on high resolution brain images displayed in coronal (left panel) and saggital (middle and right panels) views; the color bars indicate the gradient of t values of the activation maps (p < 0.005, 10 contiguous voxels 26), reflecting brain activity time-locked to the onsets of the memory cues. The line graphs illustrate the time courses of the fMRI signal (% signal change), for each trial type and TR (1 TR = 2 seconds). L = Left; R = Right.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}