{
  "id": 5214,
  "origin_website": "Bio",
  "title": "Determination of Recombinant Mannitol-1-phosphate Dehydrogenase Activity from  <em> Ectocarpus </em> sp.",
  "procedures": [
    "The standard F6P reduction reaction mixture contains 50 mM Tris-HCl (pH 7.0), 1 mM F6P, 0.2 mM NADH and 0.1 to 10 µg of purified recombinant M1PDHcat, in a final volume of 100 µl. The standard M1P oxidation reaction mixture contains 50 mM Tris-HCl (pH 9.0), 1 mM M1P, 0.5 mM NAD+ and 0.1 to 10 µg of purified recombinant M1PDHcat in 100 µl. Quantities of proteins are determined with NanoDrop at 280 nm based on the extinction coefficient of 37,525 M-1 cm-1 calculated for the protein of interest. The negative control corresponds to the reaction mixture in which substrate is substituted by MilliQ water (Table1).Table 1. Composition of negative control and reaction mixture for determination of M1PDHcat activity in the direction of F6P reduction and M1P oxidationimgsrc:https://en-cdn.bio-protocol.org/attached/image/20161030/20161030185609_5367.jpgThe mix is prepared with water, Tris-HCl, NAD(H) and enzyme, then the reaction is started by adding the substrate and the activity is monitored by following changes in absorbance at 340 nm, which corresponds to the consumption (F6P • M1P) or production (M1P • F6P) of NADH, in a Safire2 UV spectrophotometer microplate reader. The plate is subjected to 10 sec of orbital shaking before measurements. Values are recorded every 13 sec approximately, and this interval of time can be modified according to the activity of the enzyme under consideration. The assay is performed at 30 °C for up to 20 min. Only the early linear part of the curves is used to calculate activity (Figures 2 and 3).F6P reduction and M1P oxidation activities, based on consumption or production of NADH respectively, are calculated using the formula:[(ΔA340 nm test - ΔA340 nm negative control) x 0.0001/(t x 6220 x 0.",
    "3)]Where,ΔA340 nm = variation of absorbance during the duration of incubation,T = duration of incubation (min),6220 = extinction coefficient for NADH (L mol-1 cm-1),0.3 = optical path (cm). This value depends of the plate/cuvette used,0.0001 = assay volume (L),One unit (U) of activity, F6P reduction or M1P oxidation, corresponds to 1 µmole of co-factor oxidized or reduced per min respectively.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20161030/20161030185724_0112.jpgFigure 2. Measurement of absorbance (340 nm) monitored as a function of time (sec) in presence or in absence of M1P. A. The curves represent two series of triplicates obtained in absence or in presence of 1 mM of M1P and 0.2 µg of enzyme. B. The table contains values of absorbance measured under both conditions tested and at different times of experiment.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20161030/20161030185828_8137.jpgFigure 3. Measurement of absorbance (340 nm) monitored as a function of time (sec) in presence or in absence of F6P. A. The curves represent two series of triplicates obtained in absence or in presence of 1 mM of F6P and 0.04 µg of enzyme. B. The table contains values of absorbance measured under both conditions tested and at different times of experiment.To calculate specific activities, divide the values obtained in the equation above by the quantity of M1PDHcat proteins present in the sample. Perform three replicates for each condition, and use the average calculated in absence and in presence of substrate to determine the specific activity of each reaction. This applies also to the experiments described below. From values of Figures 2 and 3, specific activities of M1PDHcat are 11.3 U/mg in presence of 1 mM M1P and 39.0 U/mg in presence of 1 mM F6P.",
    "To determine substrate specificity, test M1PDHcat activity in the presence of each substrate listed in the ‘Materials and Reagents’ section, using concentration ranging from 1 mM to at least 50 mM, at room temperature.To determine the optimal temperature, incubate the reaction mixtures used in step 1 at temperatures ranging, for instance, from 10 °C to 50 °C, with incremental of 5 °C or 10 °C. The experiments described below are performed at the optimal temperature of 30 °C.To determine the optimal pH, replace the 50 mM Tris-HCl pH 7.0 or pH 9.0 buffer used in step 1 by other buffers prepared at different pHs. As an indication, it is possible to use:50 mM MES for pH 5.5, 6, 6.5 50 mM Bis-Tris propane for pH 6.5, 7, 7.5, 8, 8.5, 9, 9.550 mM Tris-HCl for pH 7, 7.5, 8, 8.5, 950 mM Tris-acetate for 6, 6.5, 750 mM HEPES for 7, 7.5, 8, 8.5To examine the influence of NaCl, add NaCl to the reaction mixture described in step 1 to obtain final concentrations ranging from 0 to 1 M.To estimate the kinetic parameters of the enzyme for a selected substrate S, run individual enzyme reactions in the presence of at least five different concentrations of this substrate (for example 0.1 mM, 0.25 mM, 1 mM, 4 mM, 20 mM final concentration), and a fixed concentration of NAD+ or NADH. Determine the initial reaction rate for each reaction and plot 1/V versus 1/[S] to obtain a Lineweaver-Burk plot, from which Km and Vm for S can be calculated (Figure 4) using the hyper 32 software.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20161030/20161030190103_5816.jpgFigure 4. Lineweaver-Burk plots used to determine in A) the Km (0.19 mM) and Vm (46 U/mg) of M1PDHcat for F6P and in B) the Km (0.38 mM) and Vm (15.",
    "6 U/mg) of M1PDHcat for the M1P. [S] is the substrate concentration (in mM) and V is the reaction rate (in U/mg of protein). Three replicates were performed for each assay."
  ],
  "subjectAreas": [
    "Plant Science",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}