{
  "id": 19141,
  "origin_website": "Jove",
  "title": "Combination Radiotherapy in an Orthotopic Mouse Brain Tumor Model",
  "procedures": [
    "I. Cell Preparation\nThe cells are grown to confluence in DMEM with 10% FBS about one 80% confluent 225 cm3 flask for every 5 mice to be implanted.\nAspirate media off of the cells; wash with 10 ml of PBS without Calcium or Magnesium. Aspirate PBS off cells.\nTrypsinize cells with 3 ml of trypsin, wait 10-15 min, and neutralize the trypsin with 15 ml of media.\nPipet all cells and media into a 50 ml conical. Two large flasks fit into one 50 ml conical.\nSpin cells at 1600 rpm for 7 min at 4 °C. Completely aspirate supernatant. Resuspend cells in 10 ml of cold PBS, and rinse cells by gently pipetting up and down. Make sure the cell pellet is mixed uniformly with the PBS. The suspension should be cloudy.\nAt this time a cell count is done using a coulter counter. The cells are centrifuged again at 1600 rpm for 7 min at 4 °C.\nAfter the 2nd centrifugation of the cells, aspirate all PBS and resuspend in 1 ml of PBS.\nThe cells are spun in the 1ml of PBS at 3000 rpm for 10 min at 4 °C. The PBS is aspirated, and PBS is added to adjust the final concentration to 1x106 per 5 μl for U87 cells, other cell lines may require a different number and concentration of cells for optimal tumor growth.\nAfter the final volume and concentration is obtained the cells are kept on ice in an eppendorf tube.\nII. Xenograft\nPreparing the mouse",
    "The mice are anesthetized using an injection mix of Ketamine/Xylazine/Saline. The mixture is 120 mg/kg of Ketamine, 16 mg/kg of Rompun and Saline. The mice are weighed individually and given 0.1 ml per 10 g based on their weight. The anesthetic is given with 26G needle attached to 1 ml syringe IP. It will take approximately 15 min for the mice to reach a sleeping phase for no pain response. You can check the pain response of the mice by pinching their footpad.\nAfter the mouse is fully anesthetized, eye ointment is administered to their eyes to prevent them from drying out.\nThe mouse is placed on the bed of the stereotaxic with the front upper teeth in the notch on the mouth bar. The bed is then placed in the stereotaxic.\nThe nose guard is placed over the mouse's nose to prevent movement of the head, and the ear bars are gently place in the ear canals of the mice. Be careful not to do either placement of the nose bar or ear bars too tight, as the skull may fracture and/or prevent the mouse from breathing.\nMake sure that the head of the mouse is level using the tick marks on the stereotaxic is helpful during this process.\nTo prep the mouse, alcohol and providine iodine is applied liberally on the head of the mouse alternating for a total of 3 application of alcohol and 3 applications of iodine. One final application of an alcohol pad with 70% is applied to the head.\nSurgical procedure\n\t\nAll instruments in the procedure should be sterilized either by autoclaving or soaking instruments in 70% ethanol before beginning the procedure.",
    "An incision is made on top of the skull behind the right eye diagonally back to the left posterior of the skull. The incision should be about 10 mm to 15 mm long.\nUsing a Q-tip, slowly separate the incision to expose the skull and wipe away the membrane that is between the skull and the skin. Use a Q-tip to blot any blood and watch for excessive bleeding.\nExpose the top of the skull to visualize the bregma. Using the Hamilton syringe point, position it over the bregma. The correct position of the hole to be drilled in the skull is 2 mm right and 1 mm anterior of bregma (figure 2). A surgeon's felt-tipped marker, that is purchased sterile, is used to mark the location of the hole to be drilled.  Please note that the hole is located close to the anterior suture line.\nNext, drill a small hole in the skull at the marked position using the point of a 22G needle in a pin vase or fed through an 18G needle.\nLoad the 10 μl glass Hamilton syringe with 5 μl of cells. The Hamilton syringe is 10 μl with a blunt 30G to 33G fixed needle attached to it. Be sure to mix the cells before loading them, either by pipetting them or using a 1ml syringe with a 25G needle attached. After the Hamilton syringe is loaded, place it back in the arm to line it up with the hole in the skull.\nLower the bunt end of the needle to the surface of the skull, once the needle is level with the skull; lower the needle until it is at the depth of 3 mm below the surface of the skull.",
    "After the needle is lowered, it shall remain there for 2 minutes to avoid any major trauma from the needle affecting the brain. Implanting the cells is at a rate of 1 μl per minute for a total of 6-8 minutes, be careful of any backflow. After the last of the cells have been implanted, leave the needle in place for another 2 minutes, to allow all the cells to settle in.\nRemove the needle from the brain, and clean the hole with a Q-tip. Proceed to clean the needle and syringe with 50% Actone, 100% EtOH, and PBS, 3x in each solution and in that order.\nThe skin on the skull is ready to be sutured at this point. Using 5-0 PBS close the incision with about 3 stitches.\nAllow the mouse to wake up on a heat pad, and reapply eye ointment if needed. The mouse can be returned to the cage after it shows movement on its own (i.e. Lifting up the head or moving the shoulders).\nIII. Treatment of the IC implant By Radiation and Drug\nRadiation treatment\n\t\nDepending on the cell line, treatment of the mice can take place 5 to 7 days post-implant. Our department uses an orthovoltage radiotherapy unit for radiation treatment.\nImaging such as BLI (Bioluminescence Imaging), MRI or CT can be used to visualize the tumor prior to randomization (figure 3A).\nThe mice are anesthetized with the Ketamine/Xylazine/saline cocktail as before, and eye ointment is applied to their eyes.\nThe mice are positioned in a custom made radiation jig that is configured like a pie wheel, in which the heads of the mice point towards the center. The bodies of the mice are shielded from the radiation with lead.",
    "Drug treatment can be given either before or radiation through different delivery routes, i.e. SQ, IP and IV.\nIV. Results\nThe mouse should wake up from the procedure within 45-60 minutes after anesthesia injection. If the mouse has difficultly waking up after the procedure and time has exceeded 1½ hr after the procedure, the mouse may not recover and euthanasia may be an effective alternative. If there is excessive bleeding or the skull becomes cracked at any point during the procedure euthanasia is advised. If all goes well and depending on the cell line, a tumor should start forming within 2-4 weeks after the procedure has take place. When using intracranial xenograft models, therapeutic efficacy is usually measured as survival post-implantation5. However, as this is an IC model signs and symptoms will occur prior to death. Some of the physical signs the mouse may exhibit are a hunched posture, loss of body weight, and inactivity. Some of the neurological signs may be seizures, head tilt, and loss of balance. Figure 3B shows an HE stain of a tumor at mortality. A Kaplan-Meier plot is used to evaluate the data (figure 4). The number of days of survival at 50% are calculated and compared to the control. If the combination group lived longer than the addition of the individual radiation and drug arms the combination is was successful.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3397/3397fig1.jpg\nFigure 1. The Stoelting Stereotaxic equipment.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3397/3397fig2.jpg\nFigure 2. A diagram of the location of the drill hole in the mouse skull.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3397/3397fig3A.jpg\nFigure 3A.  BLI imaging after GBM implantation.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3397/3397fig3B.jpg\nFigure 3B.  H and E of GBM tumor at mortality.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3397/3397fig4.jpg\nFigure 4.  Results of U87 IC implants injected with PARP inhibitor 7 days post surgery.\n Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}